{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vaccinia_virus"}, {"score": 0.004072275820209647, "phrase": "unknown_function"}, {"score": 0.003641713874009232, "phrase": "vacv"}, {"score": 0.003311604528903634, "phrase": "essential_and_highly_conserved_protein"}, {"score": 0.003202361402737197, "phrase": "protein_databases"}, {"score": 0.0031315358193567708, "phrase": "significantly_similar_proteins"}, {"score": 0.0030794433253250476, "phrase": "experimental_approaches"}, {"score": 0.002977835845437357, "phrase": "protein_function"}, {"score": 0.002707741309851526, "phrase": "human_and_archaeal_flap_endonucleases"}, {"score": 0.0024897902536499005, "phrase": "robetta_protein_structure_prediction_server"}, {"score": 0.002128694000627911, "phrase": "active_site_residues"}, {"score": 0.0021049977753042253, "phrase": "dna_substrate_binding_regions"}], "paper_keywords": [""], "paper_abstract": "Motivation: Of the similar to 200 proteins that have been identified for the vaccinia virus (VACV) genome, many are currently listed as having an unknown function, and seven of these are also found in all other poxvirus genomes that have been sequenced. The G5R protein of VACV is included in this list, and to date, very little is known about this essential and highly conserved protein. Conventional similarity searches of protein databases do not identify significantly similar proteins, and experimental approaches have been unsuccessful at determining protein function. Results: Using HHsearch, a hidden Markov model (HMM) comparison search tool, the G5R protein was found to be similar to both human and archaeal flap endonucleases (FEN-1) with 96% probability. The G5R protein structure was subsequently successfully modeled using the Robetta protein structure prediction server with an archaeal FEN-1 as the template. The G5R model was then compared to the human FEN-1 crystal structure and was found to be structurally similar to human FEN-1 in both active site residues and DNA substrate binding regions.", "paper_title": "Predicted function of the vaccinia virus G5R protein", "paper_id": "WOS:000242246300002"}