{"auto_keywords": [{"score": 0.04579939283510067, "phrase": "sleep_transistor"}, {"score": 0.04244375509870692, "phrase": "sleep_transistor_size"}, {"score": 0.03290743426012683, "phrase": "sleep_transistors"}, {"score": 0.02476092840672624, "phrase": "placement_refinement_algorithm"}, {"score": 0.00481495049065317, "phrase": "low-power_mtcmos_design_-_computation"}, {"score": 0.004733901576706854, "phrase": "multithreshold_cmos"}, {"score": 0.004654210559456924, "phrase": "circuit_style"}, {"score": 0.0045888223900501695, "phrase": "leakage_power_consumption"}, {"score": 0.004562923889976588, "phrase": "sleep_transistor_sizing"}, {"score": 0.004524348699657099, "phrase": "key_issue"}, {"score": 0.004486098156258553, "phrase": "mtcmos_circuit"}, {"score": 0.004311809215875557, "phrase": "circuit_performance"}, {"score": 0.004203343568960231, "phrase": "dynamic_power_consumption"}, {"score": 0.003960707793724388, "phrase": "significant_performance_degradation"}, {"score": 0.003916098498242888, "phrase": "increased_resistance"}, {"score": 0.0036795454918516794, "phrase": "mutually-exclusive_discharge_patterns"}, {"score": 0.0028919522313933525, "phrase": "logic_level"}, {"score": 0.0028351316586279407, "phrase": "proposed_clustering_method"}, {"score": 0.0027325449069867222, "phrase": "unit-size_sleep_transistors"}, {"score": 0.0026262033625248445, "phrase": "physical_level"}, {"score": 0.0025383451160985488, "phrase": "traditional_placement_tool"}, {"score": 0.0025239898026543964, "phrase": "topology_check"}, {"score": 0.0024257447861185813, "phrase": "functionality_check_algorithm"}, {"score": 0.0023780623297398576, "phrase": "topology_check_algorithm"}, {"score": 0.0023579143175099324, "phrase": "second_result"}, {"score": 0.002305014991156598, "phrase": "initial_placement"}, {"score": 0.0022725559033018572, "phrase": "first_placement_experiment"}, {"score": 0.0021655683497137234, "phrase": "wire_length"}, {"score": 0.0021049977753042253, "phrase": "clustering_information"}], "paper_keywords": ["design", " MTCMOS", " low power", " sleep transistor", " DSTN"], "paper_abstract": "Multithreshold CMOS (MTCMOS) is a circuit style that can effectively reduce leakage power consumption. Sleep transistor sizing is the key issue when a MTCMOS circuit is designed. If the size of sleep transistor is large enough, the circuit performance can surely be maintained but the area and dynamic power consumption of the sleep transistor may increase. On the other hand, if the sleep transistor size is too small, there will be significant performance degradation because of the increased resistance to ground. Previous approaches [Kao et al. 1998; Anis et al. 20021 to designing sleep transistor size are based mainly on mutually-exclusive discharge patterns. However, these approaches considered only the topology of a circuit (i.e., interconnections of nodes in the circuit-graph saving the functionality of node). We observed that any two possible simultaneously switching gates may not discharge at the same time in terms of functionality. Thus, we propose an algorithm to determine how to cluster cells to share sleep transistors, while taking both topology and functionality into consideration. Moreover, one placement refinement algorithm that takes clustering information into account will be presented. At the logic level, the results show that the proposed clustering method can achieve an average of 22% reduction in terms of the number of unit-size sleep transistors as compared to a method that does not consider functionality. At the physical level, two placement results are discussed. The first is produced by a traditional placement tool plus topology check (functionality check) for insertion of sleep transistors. It shows that the functionality check algorithm produces 9% less chip area as compared with the topology check algorithm. The second result is produced by a placement refinement algorithm where the initial placement is done in the first placement experiment. It shows that the placement refinement algorithm achieves 5% more reduction in area at the expense of 4% increase in wire length. Totally, around 14% reduction is achieved by utilizing the clustering information.", "paper_title": "A functionality-directed clustering technique for low-power MTCMOS design - Computation of simultaneously discharging current", "paper_id": "WOS:000249095700011"}