{"auto_keywords": [{"score": 0.04408711241958952, "phrase": "process-oriented_integration"}, {"score": 0.020603103517625336, "phrase": "proven_practices"}, {"score": 0.007494529710999272, "phrase": "pattern_language"}, {"score": 0.0068597513612578, "phrase": "pattern_primitives"}, {"score": 0.00481495049065317, "phrase": "modeling_process-driven"}, {"score": 0.004631637679516574, "phrase": "patterns_and_pattern_primitives"}, {"score": 0.004580550308652044, "phrase": "service-oriented_architectures"}, {"score": 0.004381749459671914, "phrase": "business_processes"}, {"score": 0.003158088307044493, "phrase": "modeling_concept"}, {"score": 0.0026732973536990373, "phrase": "ocl_constraints"}, {"score": 0.0023920904611571783, "phrase": "model_validation_tool"}], "paper_keywords": ["Design", " Service-oriented architecture", " middleware", " software patterns"], "paper_abstract": "Service-oriented architectures are increasingly used in the context of business processes. However, the proven practices for process-oriented integration of services are not well documented yet. In addition, modeling approaches for the integration of processes and services are neither mature nor do they exactly reflect the proven practices. In this article, we propose a pattern language for process-oriented integration of services to describe the proven practices. Our main contribution is a modeling concept based on pattern primitives for these patterns. A pattern primitive is a fundamental, precisely specified modeling element that represents a pattern. We present a catalog of pattern primitives that are precisely modeled using OCL constraints and map these primitives to the patterns in the pattern language of process-oriented integration of services. We also present a model validation tool that we have developed to support modeling the process-oriented integration of services, and an industrial case study in which we have applied our results.", "paper_title": "Modeling Process-Driven and Service-Oriented Architectures Using Patterns and Pattern Primitives", "paper_id": "WOS:000207047300004"}