{"auto_keywords": [{"score": 0.04645735424769751, "phrase": "enterprise's_independent_innovation_capability"}, {"score": 0.009266536615604505, "phrase": "extension_theory"}, {"score": 0.008893138121735629, "phrase": "matter-element_model"}, {"score": 0.006723545497244096, "phrase": "scientific_method"}, {"score": 0.00481495049065317, "phrase": "independent_innovation_capability"}, {"score": 0.004563182153397349, "phrase": "new_idea"}, {"score": 0.003773049633656302, "phrase": "structural_analysis"}, {"score": 0.0034165310204389682, "phrase": "extension_evaluation_method"}, {"score": 0.0033743949483348626, "phrase": "qualitative_analysis"}, {"score": 0.0033465923623290034, "phrase": "quantitative_analysis"}, {"score": 0.0032916702592724217, "phrase": "changing_process"}, {"score": 0.0031193028729331667, "phrase": "evaluation_result"}, {"score": 0.0028127163745564777, "phrase": "evaluation_grade"}, {"score": 0.002789528662623221, "phrase": "competitive_advantage"}, {"score": 0.0025892330566358503, "phrase": "comprehensive_index_level"}, {"score": 0.0024434201175883674, "phrase": "enterprise's_development"}, {"score": 0.002373615081691254, "phrase": "key_factors"}, {"score": 0.002258546887303777, "phrase": "-_new_idea"}, {"score": 0.0021940118003312397, "phrase": "enterprise's_independent_innovation_activity"}, {"score": 0.00213131678182067, "phrase": "qualitative_and_quantitative_analysis"}, {"score": 0.0021049977753042253, "phrase": "contradictory_problems"}], "paper_keywords": ["Cybernetics", " Strategic evaluation", " Organizational innovation"], "paper_abstract": "Purpose - The purpose of this paper is to apply a new idea and scientific method to evaluate the enterprise's independent innovation capability accurately. Design/methodology/approach - The matter-element, extension set and independent function in extension theory are introduced briefly. Based on extension theory, the matter-element model on comprehensive evaluation of the enterprise's independent innovation capability is established. Then, an instance which makes structural analysis on the enterprise's independent innovation capability with extension evaluation method is given. Findings - The matter-element model on comprehensive evaluation of the enterprise's independent innovation capability is established. Extension evaluation method can combine qualitative analysis and quantitative analysis to reflect the changing process of the objective appropriately. By means of the matter-element model, the evaluation result shows which the grade does the enterprise's independent innovation capability belong to. Research limitations/implications - Extension evaluation method resorting to extension theory, cannot only reveal the evaluation grade and competitive advantage of an enterprise within the industry or within the scope of the evaluation, but also show comprehensive index level of the enterprise's independent innovation capability. Practical implications - It is significant to monitor the enterprise's development and changes effectively, find the key factors influencing the enterprise's independent innovation capability and take effective measures in time. Originality/value - New idea and scientific method are introduced into the enterprise's independent innovation activity, and it can integrate both qualitative and quantitative analysis to solve contradictory problems.", "paper_title": "Extension theory and its application in evaluation of independent innovation capability", "paper_id": "WOS:000267416500021"}