{"auto_keywords": [{"score": 0.044810297548179764, "phrase": "network_structure"}, {"score": 0.03819287679979974, "phrase": "order_information"}, {"score": 0.00481495049065317, "phrase": "fundamental_problem"}, {"score": 0.004767261858417823, "phrase": "numerous_fields"}, {"score": 0.004657808551825796, "phrase": "communication_systems"}, {"score": 0.0041469500929423595, "phrase": "incomplete_data"}, {"score": 0.004038249989123055, "phrase": "\"co-occurrence\"_data"}, {"score": 0.002955050521440921, "phrase": "co-occurrence_observations"}, {"score": 0.0028966970007550824, "phrase": "random_walk"}, {"score": 0.002820675782452964, "phrase": "random_permutation"}, {"score": 0.002710358243468008, "phrase": "missing_data"}, {"score": 0.002595698433525986, "phrase": "random_walk_parameters"}, {"score": 0.0025528981558942372, "phrase": "em_algorithm"}, {"score": 0.002485877135880137, "phrase": "computational_complexity"}, {"score": 0.002461199256106623, "phrase": "reconstruction_process"}, {"score": 0.0023886223145816376, "phrase": "transmission_path"}, {"score": 0.002349228457383314, "phrase": "long_paths"}, {"score": 0.0023259039577313294, "phrase": "exact_e-step"}, {"score": 0.0022573076362326135, "phrase": "polynomial-time_monte_carlo_em_algorithm"}, {"score": 0.0021474369836979048, "phrase": "high_probability"}, {"score": 0.0021049977753042253, "phrase": "internet_measurements"}], "paper_keywords": ["expectation-maximization (EM) algorithm", " graphical models", " importance sampling", " Markov models", " network inference", " network tomography"], "paper_abstract": "The discovery of networks is a fundamental problem arising in numerous fields of science and technology, including communication systems, biology, sociology, and neuroscience. Unfortunately, it is often difficult, or impossible, to obtain data that directly reveal network structure, and so one must infer a network from incomplete data. This paper considers inferring network structure from \"co-occurrence\" data: observations that identify which network components (e.g., switches, routers, genes) carry each transmission but do not indicate the order in which they handle the transmission. Without order information, the number of networks that are consistent with the data grows exponentially with the size of the network (i.e., the number of nodes). Yet, the basic engineering/evolutionary principles underlying most networks strongly suggest that not all data-consistent networks are equally likely. In particular, nodes that co-occur in many observations are probably closely connected. With this in mind, we model the co-occurrence observations as independent realizations of a random walk on the network, subjected to a random permutation to account for the lack of order information. Treating permutations as missing data, we derive an expectation-maximization (EM) algorithm for estimating the random walk parameters. The model and EM algorithm significantly simplify the problem, but the computational complexity of the reconstruction process does grow exponentially in the length of each transmission path. For networks with long paths, the exact E-step may be computationally intractable. We propose a polynomial-time Monte Carlo EM algorithm based on importance sampling and derive conditions that ensure convergence of the algorithm with high probability. Simulations and experiments with Internet measurements demonstrate the promise of this approach.", "paper_title": "Network inference from co-occurrences", "paper_id": "WOS:000258913400012"}