{"auto_keywords": [{"score": 0.04625079398475017, "phrase": "adverse_drug_events"}, {"score": 0.014037918029891145, "phrase": "narrative_nursing_statements"}, {"score": 0.013822772869259183, "phrase": "standardized_terminology-based_electronic_nursing_records"}, {"score": 0.00481495049065317, "phrase": "narrative_nursing_records"}, {"score": 0.004765173195920904, "phrase": "electronic_nursing_records"}, {"score": 0.004034962424068988, "phrase": "narrative_nursing_documentations"}, {"score": 0.0037908515763223107, "phrase": "tertiary-care_hospital"}, {"score": 0.0037516480710384267, "phrase": "korea"}, {"score": 0.003693533648584145, "phrase": "nursing_statements"}, {"score": 0.0032769720645483102, "phrase": "safety_information"}, {"score": 0.002983916676307492, "phrase": "narrative_statements"}, {"score": 0.0028622019660721363, "phrase": "\"adverse_drug_reaction"}, {"score": 0.0021049977753042253, "phrase": "mean_duration"}], "paper_keywords": ["Adverse drug events", " Computerized medical recording system", " Nursing records", " Surveillance"], "paper_abstract": "The purpose of this study was to determine whether the frequency of adverse drug events can be extracted by analyzing narrative nursing statements documented in standardized terminology-based electronic nursing records. For this study, we reviewed the narrative nursing documentations of 487 admissions of 355 cancer patients who were treated with cisplatin at a tertiary-care hospital in Korea. Narrative nursing statements with the terms \"adverse drug reaction,\" \"allergy,\" \"hypersensitivity,\" and other adverse drug events listed in the safety information were analyzed. In addition, nausea, one of the most frequent adverse drug events, was further examined. Narrative statements documenting the presence or absence of an \"adverse drug reaction,\" \"allergy,\" and \"hypersensitivity\" were found in 162 admissions (33.3%). The presence or absence of adverse drug events due to cisplatin was documented in 476 admissions (97.7%). At least one adverse drug event was noted in 258 admissions (53.0%). The presence of nausea was documented in 214 admissions (43.9%), and the mean duration of nausea was 5.2 days. The results of this study suggest that adverse drug events can be monitored using narrative nursing statements documented in standardized terminology-based electronic nursing records.", "paper_title": "Adverse-Drug-Event Surveillance Using Narrative Nursing Records in Electronic Nursing Records", "paper_id": "WOS:000315289300006"}