{"auto_keywords": [{"score": 0.025299381701068747, "phrase": "ade"}, {"score": 0.007599929562090291, "phrase": "population-level_parameters"}, {"score": 0.007266836216637268, "phrase": "optimization_states"}, {"score": 0.00481495049065317, "phrase": "two-level_parameter_adaptation"}, {"score": 0.004732444672509326, "phrase": "differential_evolution"}, {"score": 0.004477765573115626, "phrase": "adaptive_de"}, {"score": 0.0043706785731816265, "phrase": "new_mutation_strategy"}, {"score": 0.003926273177600597, "phrase": "multiple_locally_best_individuals"}, {"score": 0.003663749926218976, "phrase": "fast_convergence"}, {"score": 0.0036384794303356413, "phrase": "population_diversity"}, {"score": 0.0036008989464331835, "phrase": "two-level_adaptive_parameter_control_scheme"}, {"score": 0.0034784018545409193, "phrase": "first_step"}, {"score": 0.0034305738274625634, "phrase": "f-p"}, {"score": 0.0033717094055177995, "phrase": "whole_population"}, {"score": 0.0030496164547515565, "phrase": "population_distribution"}, {"score": 0.002997269132281551, "phrase": "individual-level_parameters"}, {"score": 0.002986907667028281, "phrase": "f-i"}, {"score": 0.0027870176748502045, "phrase": "individual's_fitness_value"}, {"score": 0.0025293860389728516, "phrase": "different_individuals"}, {"score": 0.0024773480858940504, "phrase": "proposed_ade"}, {"score": 0.0024179854244287795, "phrase": "benchmark_functions"}, {"score": 0.002401286805515306, "phrase": "experimental_results"}], "paper_keywords": ["Adaptive parameter control", " differential evolution (DE)", " global optimization"], "paper_abstract": "The performance of differential evolution (DE) largely depends on its mutation strategy and control parameters. In this paper, we propose an adaptive DE (ADE) algorithm with a new mutation strategy DE/lbest/1 and a two-level adaptive parameter control scheme. The DE/lbest/1 strategy is a variant of the greedy DE/best/1 strategy. However, the population is mutated under the guide of multiple locally best individuals in DE/lbest/1 instead of one globally best individual in DE/best/1. This strategy is beneficial to the balance between fast convergence and population diversity. The two-level adaptive parameter control scheme is implemented mainly in two steps. In the first step, the population-level parameters F-p and CRp for the whole population are adaptively controlled according to the optimization states, namely, the exploration state and the exploitation state in each generation. These optimization states are estimated by measuring the population distribution. Then, the individual-level parameters F-i and CRi for each individual are generated by adjusting the population-level parameters. The adjustment is based on considering the individual's fitness value and its distance from the globally best individual. This way, the parameters can be adapted to not only the overall state of the population but also the characteristics of different individuals. The performance of the proposed ADE is evaluated on a suite of benchmark functions. Experimental results show that ADE generally outperforms four state-of-the-art DE variants on different kinds of optimization problems. The effects of ADE components, parameter properties of ADE, search behavior of ADE, and parameter sensitivity of ADE are also studied. Finally, we investigate the capability of ADE for solving three real-world optimization problems.", "paper_title": "Differential Evolution With Two-Level Parameter Adaptation", "paper_id": "WOS:000342225800008"}