{"auto_keywords": [{"score": 0.041903743629553646, "phrase": "large_trucks"}, {"score": 0.04107868567004354, "phrase": "hcm"}, {"score": 0.015612986988991197, "phrase": "signalized_intersection"}, {"score": 0.015090195520798034, "phrase": "signalized_intersections"}, {"score": 0.01294323429902085, "phrase": "traffic_stream"}, {"score": 0.00481495049065317, "phrase": "impact_of_trucks"}, {"score": 0.004510073211984104, "phrase": "highway_capacity_manual"}, {"score": 0.004357410458790669, "phrase": "base_saturation_flow_rate"}, {"score": 0.004224418476742716, "phrase": "passenger_cars"}, {"score": 0.0037316826561473774, "phrase": "pce"}, {"score": 0.003555902292752528, "phrase": "different_sizes"}, {"score": 0.0034472883424839346, "phrase": "single_value"}, {"score": 0.0033304797419738182, "phrase": "queue_composition"}, {"score": 0.0032287289440915187, "phrase": "pce_value"}, {"score": 0.0031408884818354154, "phrase": "hcm."}, {"score": 0.00271735110571002, "phrase": "appropriate_truck_pce_values"}, {"score": 0.0026071599759743833, "phrase": "truck_percentage"}, {"score": 0.0025100713447593773, "phrase": "custom_simulation_tool"}, {"score": 0.0024586427394152196, "phrase": "modified_pitt_car-following_model"}, {"score": 0.0023670716500937667, "phrase": "comprehensive_experimental_design"}, {"score": 0.0023426936553484524, "phrase": "pce_values"}, {"score": 0.0021564750534280863, "phrase": "startup_lost_time"}, {"score": 0.0021049977753042253, "phrase": "large_truck_classifications"}], "paper_keywords": [""], "paper_abstract": "The most common method used for the analysis of signalized intersections in the United States is contained in the Highway Capacity Manual (HCM). In this method, the base saturation flow rate of the signalized intersection is defined in units of passenger cars per hour green per lane (pc/hg/ln). To account for the presence of large trucks in the traffic stream, the HCM includes a Passenger Car Equivalency (PCE) value. In the current edition of the HCM, a PCE value of 2.0 is applied for all large trucks, with no distinction between different sizes of trucks. The HCM also recommends a single value of 2.0 seconds for startup lost time, regardless of queue composition. Many transportation professionals have questioned the validity of the PCE value and startup lost time recommended by the HCM. They are concerned that the impact of trucks at signalized intersections is being underestimated. If this is the case, then capacity is being overestimated and intersections are not being adequately designed. The objective of this study was to identify appropriate truck PCE values and a relationship for startup lost time as a function of truck percentage in the traffic stream. To accomplish this objective, a custom simulation tool was developed based on the modified Pitt car-following model, calibrated with field data, and applied to a comprehensive experimental design. The PCE values determined from this study are 1.8, 2.2, and 2.8 for small, medium, and large trucks, respectively. A model for estimating startup lost time based on the same small, medium, and large truck classifications was also developed.", "paper_title": "Impact of Trucks on Signalized Intersection Capacity", "paper_id": "WOS:000278933600006"}