{"auto_keywords": [{"score": 0.04923607408107278, "phrase": "bayes_factors"}, {"score": 0.018104568446313404, "phrase": "unconstrained_model"}, {"score": 0.014472353611853771, "phrase": "constrained_models"}, {"score": 0.004405596416783185, "phrase": "biems"}, {"score": 0.004066898031169739, "phrase": "multivariate_normal_linear_models"}, {"score": 0.003977505904363489, "phrase": "model_parameters"}, {"score": 0.003374094774912924, "phrase": "constrained_model"}, {"score": 0.0032272929113113203, "phrase": "constrained_space"}, {"score": 0.003005539334280134, "phrase": "broad_class"}, {"score": 0.0025950024597986366, "phrase": "repeated_measurements"}, {"score": 0.0025605773834404253, "phrase": "obtained_bayes_factor"}, {"score": 0.002152397315548125, "phrase": "obtained_bayes_factors"}, {"score": 0.0021333110194180997, "phrase": "biems."}, {"score": 0.0021049977753042253, "phrase": "posterior_model_probabilities"}], "paper_keywords": ["Bayes factors", " equality and inequality constrained models", " Fortran 90", " Gibbs sampler"], "paper_abstract": "This paper discusses a Fortran 90 program referred to as BIEMS (Bayesian inequality and equality constrained model selection) that can be used for calculating Bayes factors of multivariate normal linear models with equality and/or inequality constraints between the model parameters versus a model containing no constraints, which is referred to as the unconstrained model. The prior that is used under the unconstrained model is the conjugate expected-constrained posterior prior and the prior under the constrained model is proportional to the unconstrained prior truncated in the constrained space. This results in Bayes factors that appropriately balance between model fit and complexity for a broad class of constrained models. When the set of equality and/or inequality constraints in the model represents a hypothesis that applied researchers have in, for instance, (M)AN(C)OVA, (multivariate) regression, or repeated measurements, the obtained Bayes factor can be used to determine how much evidence is provided by the data in favor of the hypothesis in comparison to the unconstrained model. If several hypotheses are under investigation, the Bayes factors between the constrained models can be calculated using the obtained Bayes factors from BIEMS. Furthermore, posterior model probabilities of constrained models are provided which allows the user to compare the models directly with each other.", "paper_title": "BIEMS: A Fortran 90 Program for Calculating Bayes Factors for Inequality and Equality Constrained Models", "paper_id": "WOS:000301068800001"}