{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "based_classification"}, {"score": 0.004324985524216987, "phrase": "important_aspect"}, {"score": 0.00409895142748329, "phrase": "audio_features"}, {"score": 0.003926626018798576, "phrase": "music-speech_classification"}, {"score": 0.0037213333316218522, "phrase": "discrete_wavelet_transform"}, {"score": 0.0036227329311981195, "phrase": "mel-frequency_cepstral_coefficients"}, {"score": 0.003470358620464986, "phrase": "lowpass_signal"}, {"score": 0.003342280102112269, "phrase": "maximum_and_minimum_zero-crossings"}, {"score": 0.003034158379493625, "phrase": "viable_set"}, {"score": 0.002953711377604328, "phrase": "better_classification_accuracy"}, {"score": 0.0026384167183586015, "phrase": "neural_networks"}, {"score": 0.0021392418081444798, "phrase": "mlp_networks"}], "paper_keywords": ["speech music classification", " audio signal processing", " audio features", " neural networks", " Hidden Markov Models", " fuzzy C-means clustering"], "paper_abstract": "The need to classify audio into categories such as speech or music is an important aspect of many multimedia document retrieval systems. In this paper, we investigate audio features that have not been previously used in music-speech classification, such as the mean and variance of the discrete wavelet transform, the variance of Mel-frequency cepstral coefficients, the root mean square of a lowpass signal, and the difference of the maximum and minimum zero-crossings. We, then, employ fuzzy C-means clustering to the problem of selecting a viable set of features that enables better classification accuracy. Three different classification frameworks have been studied:Multi-Layer Perceptron (MLP) Neural Networks, radial basis functions (RBF) Neural Networks, and Hidden Markov Model (HMM), and results of each framework have been reported and compared. Our extensive experimentation have identified a subset of features that contributes most to accurate classification, and have shown that MLP networks are the most suitable classification framework for the problem at hand.", "paper_title": "Machine-learning based classification of speech and music", "paper_id": "WOS:000239651700007"}