{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "confirmation-based_theories"}, {"score": 0.0041642891310893, "phrase": "consumption_experience"}, {"score": 0.00409508755819924, "phrase": "overall_perspective"}, {"score": 0.003916098498242888, "phrase": "online_services"}, {"score": 0.0035811651542886746, "phrase": "overall_concept"}, {"score": 0.003541357671562449, "phrase": "different_dimensions"}, {"score": 0.003348838095597268, "phrase": "different_perspectives"}, {"score": 0.003202361402737197, "phrase": "goal-directed_and_experiential_concepts"}, {"score": 0.00306227185008558, "phrase": "online_social_network_services"}, {"score": 0.002475898613632249, "phrase": "utilitarian_benefit"}, {"score": 0.0023941575109692336, "phrase": "insignificant_path"}, {"score": 0.0023151088048303705, "phrase": "hedonic_benefits"}, {"score": 0.0022137465420508785, "phrase": "related_theories"}, {"score": 0.002128694000627911, "phrase": "interesting_implications"}], "paper_keywords": ["confirmation", " continuance intention", " hedonic benefits", " utilitarian benefits"], "paper_abstract": "Related theories have highlighted how important confirmation is to satisfaction. However, in their examinations of the effect of confirmation, all past studies viewed consumption experience from an overall perspective only. Given that the utilisation of online services may generate more than one type of benefits to customers, there is a need to decompose the overall concept into different dimensions and re-examine the importance of confirmation from different perspectives. In this study, based on goal-directed and experiential concepts, we separated the benefits provided by online social network services into two types: utilitarian and hedonic. Then, through confirmations, we tested their direct and indirect impacts on satisfaction. Data collected from 653 student-based Facebook users showed that perceived hedonic benefit is more strongly correlated with satisfaction than is perceived utilitarian benefit. In addition, the insignificant path coefficient hints that confirmation of hedonic benefits is not as important as indicated by related theories. We believe that our results generate interesting implications towards both academia and practitioners.", "paper_title": "Does confirmation always matter? Extending confirmation-based theories", "paper_id": "WOS:000342237100009"}