{"auto_keywords": [{"score": 0.04820345963332842, "phrase": "public_health_professionals"}, {"score": 0.045561303267375446, "phrase": "infectious_disease_visualization_tools"}, {"score": 0.010711620946139524, "phrase": "existing_tools"}, {"score": 0.009156627424963697, "phrase": "organizational_support"}, {"score": 0.00481495049065317, "phrase": "infectious_disease_epidemiology"}, {"score": 0.004704884125484135, "phrase": "new_tools"}, {"score": 0.004578030096508602, "phrase": "complex_data"}, {"score": 0.004549242970806199, "phrase": "infectious_disease_control"}, {"score": 0.004463958296056236, "phrase": "users'_information_needs"}, {"score": 0.004417267632253208, "phrase": "systematic_literature_review"}, {"score": 0.0043071842532281844, "phrase": "special_emphasis"}, {"score": 0.004289104453933747, "phrase": "geographic_information_systems"}, {"score": 0.004009894739765119, "phrase": "infectious_disease_information_visualization_tools"}, {"score": 0.003959594975607075, "phrase": "existing_infectious_disease_information_visualization_tools"}, {"score": 0.003820466176897793, "phrase": "different_data_types"}, {"score": 0.003764603272900618, "phrase": "tool_usability_evaluation_efforts"}, {"score": 0.0036400820942141445, "phrase": "english"}, {"score": 0.003609439090677844, "phrase": "five_bibliographic_databases"}, {"score": 0.00357165418387663, "phrase": "primary_focus"}, {"score": 0.003526832204466656, "phrase": "public_health_users"}, {"score": 0.0034899090274046014, "phrase": "information_visualizations"}, {"score": 0.003338992028053874, "phrase": "diverse_needs"}, {"score": 0.0031148723927633955, "phrase": "usability_studies"}, {"score": 0.0030499657904343256, "phrase": "data_sharing"}, {"score": 0.002851189848197057, "phrase": "siloed_applications"}, {"score": 0.0028153836900036235, "phrase": "widespread_adoption"}, {"score": 0.002780025943393764, "phrase": "access_issues"}, {"score": 0.0027508996603059937, "phrase": "tool_use"}, {"score": 0.0026822322021876127, "phrase": "infectious_disease_data_increases"}, {"score": 0.0026541277754565462, "phrase": "highly_disparate_data"}, {"score": 0.0025715645302001678, "phrase": "public's_health"}, {"score": 0.0025285834281312705, "phrase": "users'_needs"}, {"score": 0.0025020848941045234, "phrase": "computer_literacy"}, {"score": 0.0024706520453553977, "phrase": "routine_workflow"}, {"score": 0.002393782570189017, "phrase": "user_trust"}, {"score": 0.0023192991767600106, "phrase": "prominent_theme"}, {"score": 0.002285335999629823, "phrase": "increasingly_collaborative_and_interdisciplinary_nature"}, {"score": 0.0022471281401375263, "phrase": "future_work"}, {"score": 0.0021543738826833225, "phrase": "cognitive_overload"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Visualization", " Infectious disease", " Public health", " Disease surveillance", " GIS", " Social network analysis"], "paper_abstract": "Background: A myriad of new tools and algorithms have been developed to help public health professionals analyze and visualize the complex data used in infectious disease control. To better understand approaches to meet these users' information needs, we conducted a systematic literature review focused on the landscape of infectious disease visualization tools for public health professionals, with a special emphasis on geographic information systems (GIS), molecular epidemiology, and social network analysis. The objectives of this review are to: (1) identify public health user needs and preferences for infectious disease information visualization tools; (2) identify existing infectious disease information visualization tools and characterize their architecture and features; (3) identify commonalities among approaches applied to different data types; and (4) describe tool usability evaluation efforts and barriers to the adoption of such tools. Methods: We identified articles published in English from January 1, 1980 to June 30, 2013 from five bibliographic databases. Articles with a primary focus on infectious disease visualization tools, needs of public health users, or usability of information visualizations were included in the review. Results: A total of 88 articles met our inclusion criteria. Users were found to have diverse needs, preferences and uses for infectious disease visualization tools, and the existing tools are correspondingly diverse. The architecture of the tools was inconsistently described, and few tools in the review discussed the incorporation of usability studies or plans for dissemination. Many studies identified concerns regarding data sharing, confidentiality and quality. Existing tools offer a range of features and functions that allow users to explore, analyze, and visualize their data, but the tools are often for siloed applications. Commonly cited barriers to widespread adoption included lack of organizational support, access issues, and misconceptions about tool use. Discussion and conclusion: As the volume and complexity of infectious disease data increases, public health professionals must synthesize highly disparate data to facilitate communication with the public and inform decisions regarding measures to protect the public's health. Our review identified several themes: consideration of users' needs, preferences, and computer literacy; integration of tools into routine workflow; complications associated with understanding and use of visualizations; and the role of user trust and organizational support in the adoption of these tools. Interoperability also emerged as a prominent theme, highlighting challenges associated with the increasingly collaborative and interdisciplinary nature of infectious disease control and prevention. Future work should address methods for representing uncertainty and missing data to avoid misleading users as well as strategies to minimize cognitive overload. (C) 2014 The Authors. Published by Elsevier Inc.", "paper_title": "Visualization and analytics tools for infectious disease epidemiology: A systematic review", "paper_id": "WOS:000343362800028"}