{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "suitable_agents"}, {"score": 0.004339293854115301, "phrase": "open_systems"}, {"score": 0.0031753062090452864, "phrase": "novel_trust_model"}, {"score": 0.0030492472433481764, "phrase": "agent's_future_performance"}, {"score": 0.002861160152640875, "phrase": "semantic_comparison"}, {"score": 0.0028119023819663472, "phrase": "current_context"}, {"score": 0.00273167822885383, "phrase": "agent's_performance"}, {"score": 0.00265373679629359, "phrase": "proposed_mechanism"}, {"score": 0.002518989593177879, "phrase": "real_world_application"}, {"score": 0.0022434880661725493, "phrase": "one's_trust"}, {"score": 0.0021543421286324945, "phrase": "future_commitment"}, {"score": 0.0021049977753042253, "phrase": "other's_past_performance"}], "paper_keywords": ["Algorithms", " Semantic matching", " trust and reputation"], "paper_abstract": "This article addresses the problem of finding suitable agents to collaborate with for a given interaction in distributed open systems, such as multiagent and P2P systems. The agent in question is given the chance to describe its confidence in its own capabilities. However, since agents may be malicious, misinformed, suffer from miscommunication, and so on, one also needs to calculate how much trusted is that agent. This article proposes a novel trust model that calculates the expectation about an agent's future performance in a given context by assessing both the agent's willingness and capability through the semantic comparison of the current context in question with the agent's performance in past similar experiences. The proposed mechanism for assessing trust may be applied to any real world application where past commitments are recorded and observations are made that assess these commitments, and the model can then calculate one's trust in another with respect to a future commitment by assessing the other's past performance.", "paper_title": "Trust and Matching Algorithms for Selecting Suitable Agents", "paper_id": "WOS:000329159900016"}