{"auto_keywords": [{"score": 0.0451821857931196, "phrase": "capacity_region"}, {"score": 0.005754364707142748, "phrase": "inner_and_outer_bounds"}, {"score": 0.00481495049065317, "phrase": "cooperative_multiple_access_channels_with_delayed"}, {"score": 0.004707188147442449, "phrase": "cooperative_two-user_multiaccess_channel"}, {"score": 0.0045888223900501695, "phrase": "random_state"}, {"score": 0.004511562580804093, "phrase": "common_message"}, {"score": 0.004385663349966071, "phrase": "individual_message"}, {"score": 0.004287467395064377, "phrase": "communication_model"}, {"score": 0.004263262404800517, "phrase": "different_degrees"}, {"score": 0.003850121210842558, "phrase": "explicit_characterization"}, {"score": 0.0037852512654732223, "phrase": "discrete_memoryless_case"}, {"score": 0.003437697879833853, "phrase": "relatively_simple_form"}, {"score": 0.003078028357912228, "phrase": "individual_description"}, {"score": 0.002975099633631871, "phrase": "compressed_version"}, {"score": 0.0028512515479085826, "phrase": "cooperative_multiaccess_channels"}, {"score": 0.0025600309252608, "phrase": "deterministic_function"}, {"score": 0.0025383451160985488, "phrase": "channel_inputs"}, {"score": 0.002391589663629713, "phrase": "asymmetric_manner"}, {"score": 0.0021717202432775936, "phrase": "delayed_channel_state_information"}, {"score": 0.002135068739125385, "phrase": "state-dependent_cooperative_multiaccess_channels"}, {"score": 0.0021049977753042253, "phrase": "recent_progress"}], "paper_keywords": ["Capacity", " multiaccess channels", " channel state information", " state compression", " block Markov coding", " feedback"], "paper_abstract": "We consider a cooperative two-user multiaccess channel in which the transmission is controlled by a random state. Both encoders transmit a common message and, one of the encoders also transmits an individual message. We study the capacity region of this communication model for different degrees of availability of the states at the encoders, causally or strictly causally. In the case in which the states are revealed causally to both encoders but not to the decoder we find an explicit characterization of the capacity region in the discrete memoryless case. In the case in which the states are revealed only strictly causally to both encoders, we establish inner and outer bounds on the capacity region. The outer bound is nontrivial, and has a relatively simple form. It has the advantage of incorporating only one auxiliary random variable. In particular, it suggests that there is none, or at best only little, to gain from having the encoder that transmits both messages also sending an individual description of the state to the receiver, in addition to the compressed version that is sent cooperatively with the other encoder. We then introduce a class of cooperative multiaccess channels with states known strictly causally at both encoders for which the inner and outer bounds agree, and so we characterize the capacity region for this class. In this class of channels, the state can be obtained as a deterministic function of the channel inputs and output. We also study the model in which the states are revealed, strictly causally, in an asymmetric manner, to only one encoder. Throughout this paper, we discuss a number of examples, and compute the capacity region of some of these examples. The results shed more light on the utility of delayed channel state information for increasing the capacity region of state-dependent cooperative multiaccess channels, and tie with recent progress in this framework.", "paper_title": "On Cooperative Multiple Access Channels With Delayed CSI at Transmitters", "paper_id": "WOS:000342416900026"}