{"auto_keywords": [{"score": 0.04493752827345703, "phrase": "journal_structures"}, {"score": 0.00481495049065317, "phrase": "aggregated_citations"}, {"score": 0.004062937864702115, "phrase": "citation_relations"}, {"score": 0.003546513036085932, "phrase": "cognitive_structure"}, {"score": 0.0032760377953971248, "phrase": "factor_analysis"}, {"score": 0.0023713273141757326, "phrase": "panel_structure"}, {"score": 0.002215274527909304, "phrase": "curriculum_organization"}, {"score": 0.0021049977753042253, "phrase": "institutional_organization"}], "paper_keywords": [""], "paper_abstract": "Using the Arts & Humanities Citation Index (A&HCI) 2008, we apply mapping techniques previously developed for mapping journal structures in the Science and Social Sciences Citation Indices. Citation relations among the 110,718 records were aggregated at the level of 1,157 journals specific to the A&HCI, and the journal structures are questioned on whether a cognitive structure can be reconstructed and visualized. Both cosine-normalization (bottom up) and factor analysis (top down) suggest a division into approximately 12 subsets. The relations among these subsets are explored using various visualization techniques. However, we were not able to retrieve this structure using the Institute for Scientific Information Subject Categories, including the 25 categories that are specific to the A&HCI. We discuss options for validation such as against the categories of the Humanities Indicators of the American Academy of Arts and Sciences, the panel structure of the European Reference Index for the Humanities, and compare our results with the curriculum organization of the Humanities Section of the College of Letters and Sciences of the University of California at Los Angeles as an example of institutional organization.", "paper_title": "The Structure of the Arts & Humanities Citation Index: A Mapping on the Basis of Aggregated Citations Among 1,157 Journals", "paper_id": "WOS:000297303100010"}