{"auto_keywords": [{"score": 0.0450678547644915, "phrase": "cad"}, {"score": 0.00481495049065317, "phrase": "knowledge_configuration_management"}, {"score": 0.004749106104067268, "phrase": "collaborative_engineering"}, {"score": 0.004620093797504386, "phrase": "industrial_design_and_simulation_processes"}, {"score": 0.004556901872357751, "phrase": "automotive_and_aerospace_areas"}, {"score": 0.004473982381245469, "phrase": "business_models"}, {"score": 0.0039341294012600085, "phrase": "expert_rules"}, {"score": 0.0032585499655442404, "phrase": "concurrent_engineering_context"}, {"score": 0.003140888248194296, "phrase": "imperfect_collaboration_process"}, {"score": 0.0030554300179552415, "phrase": "existing_tools"}, {"score": 0.002999749669403939, "phrase": "encapsulated_information"}, {"score": 0.002748775748298028, "phrase": "different_heterogeneous_expert_models"}, {"score": 0.0025420267431501367, "phrase": "expert_models"}, {"score": 0.002427732996314194, "phrase": "collaborative_context"}, {"score": 0.002194011800331242, "phrase": "explicit_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge configuration management", " Concurrent engineering", " Numerical simulation"], "paper_abstract": "This paper focuses on industrial design and simulation processes especially in automotive and aerospace areas. Designers use business models (called expert models) such as CAD (computed aided design) and CAE (computed aided engineering) models to optimize and streamline the engineering process. Each expert model contains information such as parameters, expert rules, mathematic relations (parametric models, for example) which are shared by several users and in several different domains (mechanical, thermal, acoustic, fluid, etc.). This information is exploited at the same time in a concurrent engineering context. It is the basis of an imperfect collaboration process due to the fact that existing tools do not manage encapsulated information well and are unable to ensure that parameters and rules are consistent (same value of parameters for example) throughout different heterogeneous expert models. In this context, we propose an approach to manage knowledge using configurations synchronized with expert models which enable designers to use parameters consistently in a collaborative context. Our approach is called KCModel (knowledge configuration model): it allows acquisition, traceability, re-use and consistency of explicit knowledge used in configuration. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A meta-model for knowledge configuration management to support collaborative engineering", "paper_id": "WOS:000347266100002"}