{"auto_keywords": [{"score": 0.0333191910239342, "phrase": "homa"}, {"score": 0.006806349485511853, "phrase": "nics"}, {"score": 0.006169821652494919, "phrase": "nicss"}, {"score": 0.004553914512652842, "phrase": "broensted"}, {"score": 0.004127164752958245, "phrase": "initio_modeling"}, {"score": 0.00406001734835979, "phrase": "para-substituted_aniline"}, {"score": 0.003980875186335867, "phrase": "anilide_anion_derivatives"}, {"score": 0.003280103828374121, "phrase": "hcn"}, {"score": 0.0031949807365182167, "phrase": "harmonic_oscillator_model"}, {"score": 0.0031740669025323606, "phrase": "aromaticity_index"}, {"score": 0.0028293966058473476, "phrase": "equivalent_prediction"}, {"score": 0.002675715174122091, "phrase": "c-n_bond_length"}, {"score": 0.002547043222086858, "phrase": "aniline_derivatives"}, {"score": 0.002472822097373027, "phrase": "nh-center_dot_center_dot_center_dot_hb_interactions"}, {"score": 0.002233301265743633, "phrase": "anilinium_cations"}, {"score": 0.0021188825171510094, "phrase": "ipso-bond_angle"}], "paper_keywords": [""], "paper_abstract": "The aromaticity of the ring in variously substituted aniline/anilinium/anilide derivatives in their H-bonded complexes with various Broensted acids and bases was a subject of an analysis based on 332 experimental geometries retrieved from the Cambridge Structural Database and geometries optimized at the B3LYP/6311+ G** and MP2/aug-cc-pVDZ levels of theory. Ab initio modeling was applied to the para-substituted aniline, anilinium cation, and anilide anion derivatives (X) NO, NO2, CN, CHO, H, CH3, OCH3, and OH) and their H-bonded complexes ( only for X) NO, NO2, CHO, H, and OH) with B ( B) F- and CN-) or HB ( HB) HF and HCN). In both cases, the harmonic oscillator model of aromaticity index (HOMA) was used, whereas for computational geometries, additionally, the magnetism-based indices NICS, NICS( 1), and NICS(1) zz were also applied (NICS) nucleus-independent chemical shift). There is an equivalent prediction of aromaticity by NICSs and HOMA and approximate monotonic dependences of HOMA and NICS on the C-N bond length. The strongest changes in aromaticity estimated by HOMA and NICSs were found for aniline derivatives with NH2 center dot center dot center dot B and anilide derivatives without and with NH-center dot center dot center dot HB interactions. The changes observed for two other kinds of interactions, NH2 center dot center dot center dot HB and NH3 +center dot center dot center dot base ( for anilinium cations), are much smaller. For all four kinds of interactions, the relationships between ipso-bond angle, mean ipso-ortho bond length, and C-N bond length follow the Bent-Walsh rule.", "paper_title": "Long-distance structural consequences of H-bonding. How H-bonding affects aromaticity of the ring in variously substituted aniline/anilinium/anilide complexes with bases and acids", "paper_id": "WOS:000246776400019"}