{"auto_keywords": [{"score": 0.027093874451057005, "phrase": "self-socio_dialectics"}, {"score": 0.00481495049065317, "phrase": "learners'_interactive_play"}, {"score": 0.004678940805063634, "phrase": "interactive_play_spaces"}, {"score": 0.004482063543727601, "phrase": "merely_a_matter"}, {"score": 0.004355415885815204, "phrase": "rather_their_participation"}, {"score": 0.004192078165260057, "phrase": "relevant_dispositions"}, {"score": 0.003809932244103758, "phrase": "emergent_networks"}, {"score": 0.0036494864560524735, "phrase": "collective_learning"}, {"score": 0.0035632774896594524, "phrase": "intertwining_relationship"}, {"score": 0.003529364798514874, "phrase": "individual_performances"}, {"score": 0.003413183361838603, "phrase": "collective_emergence"}, {"score": 0.003348513474852869, "phrase": "social_communities"}, {"score": 0.003300813776412652, "phrase": "central_focus"}, {"score": 0.002166349705365602, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive game play", " Social", " Learning", " Self socio dialectics"], "paper_abstract": "Research on learning within interactive play spaces have shown how learning for players is far from merely a matter of acquiring information, but rather their participation and interactions bear upon the enculturation of relevant dispositions, demeanor, and outlook. Not only are players constantly engaged in co-appropriation of knowledge and meaning within emergent networks, but so too are their individual actions impacting the collective learning of their social communities. This intertwining relationship between individual performances within the activities transacted and the collective emergence and regulation of social communities represents the central focus of our research. Through a case study descriptive of four youth game players, aged between 14 and 18, our study focused on unpacking how players, as learners, structure their cognitive development, construct and negotiate their identity and sense of self, and make meaning of their social experiences online. Arising from our findings, we propose a framework on self-socio dialectics, explicating on its four constituent constructs of cognitive enactments, metacognitive attunements, affordance management, and inclinatory affinities. We discuss implications of self-socio dialectics with respect to learning practices and conclude with directions for future research. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Unpacking self and socio dialectics within learners' interactive play", "paper_id": "WOS:000306582400016"}