{"auto_keywords": [{"score": 0.032854255577662896, "phrase": "subgame_perfect_equilibrium"}, {"score": 0.014392955633480465, "phrase": "infinite_games"}, {"score": 0.004815053458744014, "phrase": "nash"}, {"score": 0.004605147081797856, "phrase": "new_application"}, {"score": 0.004440277230269978, "phrase": "typical_feature"}, {"score": 0.004281284532043714, "phrase": "infinite_mathematical_structures"}, {"score": 0.004012500850311087, "phrase": "backward_coinduction"}, {"score": 0.00386876598761639, "phrase": "finite_games"}, {"score": 0.0024461989110005447, "phrase": "infinite_dollar_auction_game"}, {"score": 0.0023016843709107297, "phrase": "nash_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "common_sense"}], "paper_keywords": [""], "paper_abstract": "We study a new application of coinduction, namely escalation which is a typical feature of infinite games. Therefore tools conceived for studying infinite mathematical structures, namely those deriving from coinduction are essential. Here we use coinduction, or backward coinduction (to show its connection with the same concept for finite games) to study carefully and formally infinite games especially the so-called dollar auction, which is considered as the paradigm of escalation. Unlike what is commonly admitted, we show that, provided one assumes that the other agent will always stop, bidding is rational, because it results in a subgame perfect equilibrium. We show that this is not the only rational strategy profile (the only subgame perfect equilibrium). Indeed if an agent stops and will stop at every step, we claim that he is rational as well, if one admits that his opponent will never stop, because this corresponds to a subgame perfect equilibrium. Amazingly, in the infinite dollar auction game, the behavior in which both agents stop at each step is not a Nash equilibrium, hence is not a subgame perfect equilibrium, hence is not rational. The right notion of rationality we obtain fits with common sense and experience and removes all feeling of paradox.", "paper_title": "Backward coinduction, Nash equilibrium and the rationality of escalation", "paper_id": "WOS:000303455400001"}