{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bi-copam_method"}, {"score": 0.004786211598268987, "phrase": "five_escherichia_coli_datasets"}, {"score": 0.004701015188740582, "phrase": "increasing_amounts"}, {"score": 0.004672953146379813, "phrase": "high-throughput_biological_datasets"}, {"score": 0.004631172395820296, "phrase": "information_engineering_and_machine_learning_research_community"}, {"score": 0.004508048086020253, "phrase": "novel_methods"}, {"score": 0.004284302478991387, "phrase": "recently_proposed_binarisation"}, {"score": 0.004258717300328513, "phrase": "consensus_partition_matrices"}, {"score": 0.004108369978176129, "phrase": "multiple_gene_expression"}, {"score": 0.003857871979942733, "phrase": "clustering_results"}, {"score": 0.003800507899554071, "phrase": "biological_fact"}, {"score": 0.0036225919379274875, "phrase": "specific_context"}, {"score": 0.003473737415587531, "phrase": "multiple_processes"}, {"score": 0.0031845067058084583, "phrase": "single_cluster"}, {"score": 0.003118367740261359, "phrase": "multiple_clusters"}, {"score": 0.002833035775182696, "phrase": "first_time"}, {"score": 0.0028076592725295646, "phrase": "bacterial_datasets"}, {"score": 0.00274932545791351, "phrase": "five_escherichia_coli_bacterial_datasets"}, {"score": 0.002724696729311532, "phrase": "different_biological_conditions"}, {"score": 0.002387758958649797, "phrase": "first_cluster"}, {"score": 0.0023381288193776778, "phrase": "protein_synthesis"}, {"score": 0.0023241387549221408, "phrase": "dna_repair"}, {"score": 0.002228519136218028, "phrase": "biological_hypotheses"}, {"score": 0.00217565229221241, "phrase": "currently_unknown_biological_processes"}, {"score": 0.0021049977753042253, "phrase": "focused_future_gene_discovery_studies"}], "paper_keywords": ["Genome-wide analysis", " Consistent co-expression", " Bi-CoPaM", " Escherichia coli", " Multiple datasets analysis"], "paper_abstract": "The increasing amounts of high-throughput biological datasets stimulate the information engineering and machine learning research community to direct more studies towards designing and applying novel methods which are sophisticated and specialised to tackle the problems that are specific in such datasets. The recently proposed binarisation of consensus partition matrices (Bi-CoPaM) method tackles the problem of scrutinising multiple gene expression microarray datasets to identify the subsets of genes which are consistently co-expressed across them. It allows for clustering results which better reflect the biological fact that most of the genes in any cell are expected to be irrelevant to the specific context in hand, as well as the fact that many genes might participate in multiple processes. This has been achieved by clustering the given set of genes while allowing any gene to have any of the three eventualities, to be exclusively assigned to a single cluster, to be simultaneously assigned to multiple clusters, or not to be assigned to any of the clusters. In this study, we expand the scope of application of the Bi-CoPaM method by applying it, for the first time, to bacterial datasets, namely to a set of five Escherichia coli bacterial datasets generated under different biological conditions, in order to identify the subsets of genes which are consistently co-expressed, i.e. well correlated with each other. We identify two clusters with such consistent co-expression, and interestingly, they themselves are consistently negatively correlated with each other. The first cluster is enriched with genes participating in protein synthesis and DNA repair while the second is enriched with transporting genes. Consequently, we draw biological hypotheses that relate some of the genes with currently unknown biological processes to their potential processes. These hypotheses can serve as pilots for focused future gene discovery studies.", "paper_title": "Application of the Bi-CoPaM Method to Five Escherichia Coli Datasets Generated under Various Biological Conditions", "paper_id": "WOS:000349379900005"}