{"auto_keywords": [{"score": 0.04163902888281656, "phrase": "coding_errors"}, {"score": 0.010612387000973441, "phrase": "intensive_care_information_system"}, {"score": 0.010034941708424148, "phrase": "activity_level"}, {"score": 0.007879520141796222, "phrase": "coding_process"}, {"score": 0.007515949292926756, "phrase": "manual_coding"}, {"score": 0.007318808480206144, "phrase": "computerized_coding"}, {"score": 0.004772367030970874, "phrase": "tertiary_intensive_care_unit"}, {"score": 0.004688321299229397, "phrase": "french_healthcare_system"}, {"score": 0.004646852519870358, "phrase": "intensive_care_budget"}, {"score": 0.004340822341073993, "phrase": "medical_diagnoses"}, {"score": 0.003913198006939153, "phrase": "icu_budget"}, {"score": 0.00296128862361938, "phrase": "financial_impact"}, {"score": 0.002470987929071079, "phrase": "reduced_difference"}, {"score": 0.0024490834773668153, "phrase": "potential_and_real_icu_financial_supplements"}, {"score": 0.0022942608418577313, "phrase": "specific_computer_programs"}, {"score": 0.0022739194433372173, "phrase": "intensive_process"}, {"score": 0.002142832962924141, "phrase": "icu_budget_allocation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Intensive Care Information Systems", " Intensive Care Unit", " Cost", " Health resources"], "paper_abstract": "Introduction: In the French healthcare system, the intensive care budget allocated is directly dependent on the activity level of the center. To evaluate this activity level, it is necessary to code the medical diagnoses and procedures performed on Intensive Care Unit (ICU) patients. The aim of this study was to evaluate the effects of using an Intensive Care Information System (ICIS) on the incidence of coding errors and its impact on the ICU budget allocated. Patients and methods: Since 2005, the documentation on and monitoring of every patient admitted to our ICU has been carried out using an ICIS. However, the coding process was performed manually until 2008. This study focused on two periods: the period of manual coding (year 2007) and the period of computerized coding (year 2008) which covered a total of 1403 ICU patients. The time spent on the coding process, the rate of coding errors (defined as patients missed/not coded or wrongly identified as undergoing major procedure/s) and the financial impact were evaluated for these two periods. Results: With computerized coding, the time per admission decreased significantly (from 6.8 +/- 2.8 min in 2007 to 3.6 +/- 1.9 min in 2008, p < 0.001). Similarly, a reduction in coding errors was observed (7.9% vs. 2.2%, p < 0.001). This decrease in coding errors resulted in a reduced difference between the potential and real ICU financial supplements obtained in the respective years ((sic)194,139 loss in 2007 vs. a (sic)1628 loss in 2008). Conclusion: Using specific computer programs improves the intensive process of manual coding by shortening the time required as well as reducing errors, which in turn positively impacts the ICU budget allocation. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The positive financial impact of using an Intensive Care Information System in a tertiary Intensive Care Unit", "paper_id": "WOS:000315799800004"}