{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "rca"}, {"score": 0.00481495049065317, "phrase": "well-defined_alkyne-functional_polymers"}, {"score": 0.004001938457469328, "phrase": "click_reactions"}, {"score": 0.003120657021758196, "phrase": "galactose-bearing_glycopolymers"}, {"score": 0.0030847461428168614, "phrase": "ricinus_communis_agglutinin"}, {"score": 0.0029794666460666646, "phrase": "affinity_hplc_analysis"}, {"score": 0.00265373679629359, "phrase": "lectin_conjugation_studies"}, {"score": 0.002447101794397243, "phrase": "multivalent_ligands"}, {"score": 0.0022696277881969896, "phrase": "sugar_anomeric_carbon"}, {"score": 0.0022305310659333864, "phrase": "significant_effect"}, {"score": 0.002129527338875116, "phrase": "con_a"}], "paper_keywords": ["ATRP", " click", " glycopolymer", " lectin recognition", " multivalent ligands"], "paper_abstract": "Glycopolymers have been synthesised by post-functionalisation of well-defined alkyne-functional polymers with sugar azides to yield N-glycosyl 1,2,3-triazole functional polymers. The Cu(I)-catalysed Huisgen cycloaddition was used to attach alpha-mannoside, beta-galactoside and beta-lactoside derivatives via an azide functionality bound directly to the sugar anomeric carbon. Three different catalytic systems were investigated for the click reactions; [(PPh3)(3)Cu(I)Br], TBTA/Cu(I)Br and bathophenanthrolinedisulphonic acid disodium salt/Cu(I)Br. The latter of these was found to be the most efficient for the attachment of the larger/more sterically hindered disaccharide lactose moiety. The interaction of the lactose- and galactose-bearing glycopolymers with Ricinus Communis Agglutinin (RCA I) lectin was investigated by affinity HPLC analysis. The rate of the interaction between mannose polymer and concanavalin A (Con A) lectin was assessed by turbidimetry. The results from the lectin conjugation studies indicate that the glycopolymers prepared in this work are able to function as multivalent ligands, further suggesting that the attachment of the triazole directly to the sugar anomeric carbon has no significant effect on the interaction of these glycopolymers with Con A and RCA I.", "paper_title": "Well-defined poly(N-glycosyl 1,2,3-triazole) multivalent ligands: Design, synthesis and lectin binding studies", "paper_id": "WOS:000251832000013"}