{"auto_keywords": [{"score": 0.049477536567807595, "phrase": "wireless_sensor_network"}, {"score": 0.044010507984638604, "phrase": "pipeline_network"}, {"score": 0.0332283662106352, "phrase": "dd_strategy"}, {"score": 0.00481495049065317, "phrase": "water_pipeline"}, {"score": 0.0045581828632009795, "phrase": "novel_energy-aware_approach"}, {"score": 0.004333283735537634, "phrase": "noisy_water_pipeline"}, {"score": 0.0035390332628376176, "phrase": "wsn"}, {"score": 0.0032938942910948066, "phrase": "smallest_possible_number"}, {"score": 0.003266201217790818, "phrase": "pressure_sensors"}, {"score": 0.0032250961348210473, "phrase": "overall_accuracy"}, {"score": 0.003091767402370757, "phrase": "noisy_environment"}, {"score": 0.00287759989638073, "phrase": "small_leak_sizes"}, {"score": 0.00284137141260141, "phrase": "estimation_error"}, {"score": 0.0026112013707473938, "phrase": "acceptable_accuracy"}, {"score": 0.0023794391656001466, "phrase": "fusion_approach"}, {"score": 0.002349467661235186, "phrase": "better_performance"}, {"score": 0.0023296961971785357, "phrase": "significant_energy_saving"}, {"score": 0.0022906498741695094, "phrase": "noisy_environments"}, {"score": 0.002271372252250557, "phrase": "epanet"}, {"score": 0.0021774965058472527, "phrase": "matlab"}], "paper_keywords": [""], "paper_abstract": "We propose a novel energy-aware approach to detect a leak and estimate its size and location in a noisy water pipeline using least-squares and various pressure measurements in the pipeline network. The novelty in our work hinges on the fusion of the duty-cycling (DC) and data-driven (DD) strategies, both well-known techniques for energy reduction in a wireless sensor network (WSN). To maximize the information gain and minimize the energy consumed by the WSN, we first study the effects of (a) various levels of sensor measurement uncertainty and (b) the use of the smallest possible number of pressure sensors on the overall accuracy of our approach. Using the DD strategy only, a noisy environment, and a small number of sensors, the performance of our scheme shows that, for small leak sizes, the estimation error in both leak location and size becomes unacceptably high. Next, using as few sensors as possible for an acceptable accuracy, we fused the DD strategy with the DC one to minimize the sensing, processing, and communication energies. The fusion approach yielded a better performance with significant energy saving, even in noisy environments. EPANET was used to model the pipeline network and leak and MATLAB to implement, analyze, and evaluate our fusion approach.", "paper_title": "A Novel Energy-Aware Approach for Locating Leaks in Water Pipeline Using a Wireless Sensor Network and Noisy Pressure Sensor Data", "paper_id": "WOS:000363580700001"}