{"auto_keywords": [{"score": 0.03315612316808118, "phrase": "pdf"}, {"score": 0.015488064675672911, "phrase": "visual_tracking"}, {"score": 0.00481495049065317, "phrase": "bittracker_-_a"}, {"score": 0.004322267755421529, "phrase": "general_camera_motion"}, {"score": 0.004027031316965272, "phrase": "vast_majority"}, {"score": 0.0039088121438737924, "phrase": "limited_model"}, {"score": 0.0037940502405699765, "phrase": "target's_appearance"}, {"score": 0.003587842947046177, "phrase": "pan_tilt_zoom_camera"}, {"score": 0.003280891942617853, "phrase": "proposed_tracker"}, {"score": 0.003160854709666311, "phrase": "probability_distribution_function"}, {"score": 0.0030909442697163356, "phrase": "target's_bitmap"}, {"score": 0.002911961514073769, "phrase": "possible_motions"}, {"score": 0.0028053842615436706, "phrase": "optical_flow"}, {"score": 0.002652768049567487, "phrase": "motion_cue"}, {"score": 0.0025844090835070986, "phrase": "error-prone_calculation"}, {"score": 0.0025178072071268534, "phrase": "gibbs_distribution"}, {"score": 0.00247128526955136, "phrase": "first-order_neighborhood_system"}, {"score": 0.002354302193867031, "phrase": "quadratic_pseudo-boolean_function"}, {"score": 0.0022428442879034614, "phrase": "maximum-flow_problem"}, {"score": 0.0021049977753042253, "phrase": "aforementioned_general_context"}], "paper_keywords": ["tracking", " motion", " pixel classification"], "paper_abstract": "This paper addresses the problem of visual tracking under very general conditions: a possibly nonrigid target whose appearance may drastically change over time, general camera motion, a 3D scene, and no a priori information except initialization. This is in contrast to the vast majority of trackers, which rely on some limited model in which, for example, the target's appearance is known a priori or restricted, the scene is planar, or a pan tilt zoom camera is used. Their goal is to achieve speed and robustness, but their limited context may cause them to fail in the more general case. The proposed tracker works by approximating, in each frame, a probability distribution function (PDF) of the target's bitmap and then estimating the maximum a posteriori bitmap. The PDF is marginalized over all possible motions per pixel, thus avoiding the stage in which optical flow is determined. This is an advantage over other general-context trackers that do not use the motion cue at all or rely on the error-prone calculation of optical flow. Using a Gibbs distribution with respect to the first-order neighborhood system yields a bitmap PDF whose maximization may be transformed into that of a quadratic pseudo-Boolean function, the maximum of which is approximated via a reduction to a maximum-flow problem. Many experiments were conducted to demonstrate that the tracker is able to track under the aforementioned general context.", "paper_title": "Bittracker - A bitmap tracker for visual tracking under very general conditions", "paper_id": "WOS:000257504400006"}