{"auto_keywords": [{"score": 0.049198528177459636, "phrase": "personally_controlled_electronic_health_record"}, {"score": 0.045417031794566444, "phrase": "pcehr"}, {"score": 0.03318711500857538, "phrase": "privacy_concerns"}, {"score": 0.004814995543341426, "phrase": "australian"}, {"score": 0.004439436256329065, "phrase": "australia"}, {"score": 0.004237845317333986, "phrase": "first_objective"}, {"score": 0.00411182818527434, "phrase": "general_population"}, {"score": 0.004083281377007922, "phrase": "promoted_idea"}, {"score": 0.004026778553823256, "phrase": "second_objective"}, {"score": 0.003952650994544525, "phrase": "theoretically_derived_consumer_technology_acceptance_model"}, {"score": 0.0038708810091769856, "phrase": "online_survey"}, {"score": 0.0037383254707271905, "phrase": "technology_acceptance_models"}, {"score": 0.0037209965201788608, "phrase": "extant_literature"}, {"score": 0.0035028709590057042, "phrase": "exploratory_factor_analysis"}, {"score": 0.0034704633518551618, "phrase": "mediation_tests"}, {"score": 0.0033593718197446895, "phrase": "perceived_value"}, {"score": 0.0033437936071883476, "phrase": "perceived_risk"}, {"score": 0.003282197445772301, "phrase": "perceived_usefulness"}, {"score": 0.0031697368057340895, "phrase": "partial_mediation"}, {"score": 0.003111336942540226, "phrase": "web-self_efficacy"}, {"score": 0.0029493445611623106, "phrase": "early_stages"}, {"score": 0.002922043012737139, "phrase": "australian_initiative"}, {"score": 0.0028815624510817118, "phrase": "queenslanders"}, {"score": 0.0028284569045716793, "phrase": "pcehr._findings"}, {"score": 0.002500456462028735, "phrase": "increased_sense"}, {"score": 0.0023537101705489957, "phrase": "necessary_web_skills"}, {"score": 0.0022258906408344973, "phrase": "national_level_implementation"}, {"score": 0.002210408095198543, "phrase": "e-phr_system"}, {"score": 0.0021395650579899526, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " E-service", " Technology acceptance", " Personal", " Attitude", " Australia"], "paper_abstract": "Objective: The move internationally by Governments and other health providers to encourage patients to have their own electronic personal health record (e-PHRs) is growing exponentially. In Australia the initiative for a personally controlled electronic health record (known as PCEHR) is directed towards the public at large. The first objective of this study then, is to examine how individuals in the general population perceive the promoted idea of having a PCEHR. The second objective is to extend research on applying a theoretically derived consumer technology acceptance model to guide the research. Method: An online survey was conducted to capture the perceptions and beliefs about having a PCEHR identified from technology acceptance models and extant literature. The survey was completed by 750 Queensland respondents, 97% of whom did not have a PCEHR at that time. The model was examined using exploratory factor analysis, regressions and mediation tests. Results: Findings support eight of the 11 hypothesised relationships in the model. Perceived value and perceived risk were the two most important variables explaining attitude, with perceived usefulness and compatibility being weak but significant. The perception of risk was reduced through partial mediation from trust and privacy concerns. Additionally, web-self efficacy and ease of use partially mediate the relationship between attitude and intentions. Conclusions: The findings represent a snapshot of the early stages of implementing this Australian initiative and capture the perceptions of Queenslanders who at present do not have a PCEHR. Findings show that while individuals appreciate the value of having this record, they do not appear to regard it as particularly useful at present, nor is it particularly compatible with their current engagement with e-services. Moreover, they will need to have any concerns about the risks alleviated, particularly through an increased sense of trust and reduction of privacy concerns. It is noted that although the respondents are non-adopters, they do not feel that they lack the necessary web skills to set up and use a PCEHR. To the best of our knowledge this is one of a very limited number of studies that examines a national level implementation of an e-PHR system, where take-up of the PCEHR is optional rather than a centralised, mandated requirement. Crown Copyright (C) 2014 Published by Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The Australian general public's perceptions of having a personally controlled electronic health record (PCEHR)", "paper_id": "WOS:000346052600003"}