{"auto_keywords": [{"score": 0.046888273895838106, "phrase": "ejis"}, {"score": 0.03784144720028532, "phrase": "ejis."}, {"score": 0.035820952656110384, "phrase": "ais_region"}, {"score": 0.004605147081797856, "phrase": "research_activity"}, {"score": 0.004281284532043714, "phrase": "citation_analysis"}, {"score": 0.004144723510171449, "phrase": "geographic_diversity"}, {"score": 0.0041112665381266315, "phrase": "authors'_background"}, {"score": 0.004078078530972285, "phrase": "subject_areas"}, {"score": 0.003932003833923186, "phrase": "research_methodologies"}, {"score": 0.003700037700138249, "phrase": "prospective_authors"}, {"score": 0.003567455727660992, "phrase": "major_geographical_source"}, {"score": 0.0035386420095120706, "phrase": "information_system"}, {"score": 0.0033571245989445645, "phrase": "europe"}, {"score": 0.003302950005029317, "phrase": "africa"}, {"score": 0.003223494720348768, "phrase": "substantial_ais_region"}, {"score": 0.0029722900280316216, "phrase": "case_study_approach"}, {"score": 0.002877361619893651, "phrase": "library_research"}, {"score": 0.002526938673434697, "phrase": "previous_paper"}, {"score": 0.0023970487263732737, "phrase": "similar_comparisons"}, {"score": 0.0021394674440767124, "phrase": "journal_comparisons"}], "paper_keywords": ["IS research", " meta-analysis", " productive authors", " research paradigm", " research profile"], "paper_abstract": "This paper profiles the types of research activity that have been published in EJIS from 1997 to 2007. Our analysis includes variables such as the most productive authors, citation analysis, universities associated with the most research publications, geographic diversity, authors' background, subject areas most often investigated, unit of analysis and research methodologies. The classification of the topics and methodologies used by the most highly published authors will help prospective authors gauge whether their paper is suitable for EJIS. The major geographical source of information system (IS) research published in EJIS is from AIS region 2 (Europe, the Middle East and Africa), but with a substantial AIS region 1 (American-based researchers and universities) and AIS region 3 (Asia-Pacific) contribution. The most common research method used is the case study approach, with other methods such as surveys and library research also used frequently. IS management and IS development are the two most researched IS topics published in EJIS. This research and results reported in this paper are comparable with a previous paper published about the Information Systems Journal. Any further such studies will thus be able to make similar comparisons between these journals and any others that have subsequently been covered in this way. The paper concludes with the need for more substantive research on the topic if journal comparisons are to achieve their potential.", "paper_title": "Profile of IS research published in the European Journal of Information Systems", "paper_id": "WOS:000262201100009"}