{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dirty_paper"}, {"score": 0.038720528746691095, "phrase": "robust_dirty_paper_coding"}, {"score": 0.03546436402397596, "phrase": "side_information"}, {"score": 0.004437115547184535, "phrase": "common_message"}, {"score": 0.004397000006837371, "phrase": "multiple_receivers"}, {"score": 0.0041074234667687875, "phrase": "additive_noise"}, {"score": 0.003716724243777879, "phrase": "wireless_multiple-antenna_multicasting"}, {"score": 0.003584025547693836, "phrase": "memoryless_channels"}, {"score": 0.0035515951985356374, "phrase": "gaussian_and_binary_special_cases"}, {"score": 0.0029209233709517634, "phrase": "noiseless_binary_case"}, {"score": 0.00266693888510356, "phrase": "transmitter_side_information"}, {"score": 0.0026307897899760383, "phrase": "vanishingly_small_benefit"}, {"score": 0.0024460897937643032, "phrase": "time_sharing"}, {"score": 0.0023802126605244438, "phrase": "gaussian_case"}, {"score": 0.002326669201839705, "phrase": "coding_scheme"}, {"score": 0.0022640009579466924, "phrase": "high_signal-to-interference-plus-noise_limit"}], "paper_keywords": ["common information", " dirty paper coding", " Gel'fand-Pinsker channels", " multiple-input/multiple-output (MIMO) broadcast channel", " writing on dirty paper"], "paper_abstract": "A generalization of the problem of writing on dirty paper is considered in which one transmitter sends a common message to multiple receivers. Each receiver experiences on its link an additive interference (in addition to the additive noise), which is known noncausally to the transmitter but not to any of the receivers. Applications. range from wireless multiple-antenna multicasting to robust dirty paper coding. We develop results for memoryless channels in Gaussian and binary special cases. In most cases, we observe that the availability of side information at the transmitter increases capacity relative to systems without such side information, and that the lack of side information at the receivers decreases capacity relative to systems with such side information. For the noiseless binary case, we establish the capacity when there are two receivers. When there are many receivers, we show that the transmitter side information provides a vanishingly small benefit. When the interference is large and independent across the users, we show that time sharing is optimal. For the Gaussian case, we present a coding scheme and establish its optimality in the high signal-to-interference-plus-noise limit when there are two receivers. When the interference power is large and independent across all the receivers, we show that time-sharing is again optimal. Connections to the problem of robust dirty paper coding are also discussed.", "paper_title": "Carbon copying onto dirty paper", "paper_id": "WOS:000246034600015"}