{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wi-fi_direct"}, {"score": 0.004765482708043842, "phrase": "future_wireless_serial_bus"}, {"score": 0.004620093797504386, "phrase": "performance_analysis"}, {"score": 0.0045726187330434025, "phrase": "wi-fi_direct_power_management_schemes"}, {"score": 0.004342430078306461, "phrase": "enhanced_power_management"}, {"score": 0.004297795905522757, "phrase": "future_wireless_usb"}, {"score": 0.004081385289516914, "phrase": "key_technology"}, {"score": 0.0039772848945723435, "phrase": "future_wsb_services"}, {"score": 0.003916098498242888, "phrase": "high_standards"}, {"score": 0.0038758293658651237, "phrase": "service_quality"}, {"score": 0.003835972725191194, "phrase": "power_efficiency"}, {"score": 0.0029467742734417255, "phrase": "wsb_application"}, {"score": 0.0025493457404304446, "phrase": "wsb_applications"}, {"score": 0.0023346234464901978, "phrase": "novel_power_saving_algorithm"}, {"score": 0.00226322835801988, "phrase": "power_management"}], "paper_keywords": ["Wi-Fi Direct", " Power management", " Wireless serial bus"], "paper_abstract": "This paper presents a performance analysis of Wi-Fi Direct power management schemes and exploits their problems to design a novel, enhanced power management for future wireless USB (WSB) applications. Wi-Fi Direct will become a key technology for the support of future WSB services that require high standards of service quality and power efficiency at the same time. To provide this, Wi-Fi Direct defines two power management schemes, opportunistic power save mode and notice-of-absence. Even though each scheme has its own characteristics and advantages, specification does not have any definition of how to select the schemes and its parameters based on the type of WSB application being serviced. We analyze the properties of the two power management schemes of Wi-Fi Direct, and discover that their performance can greatly vary depending on the number and type of WSB applications that is being transmitted in the network. To solve this problem, we propose a novel power saving algorithm that can dynamically change the power management of Wi-Fi Direct. Our work is extensively evaluated using the Wi-Fi Direct module implemented in the NS-3 simulator.", "paper_title": "Dynamic power management in Wi-Fi Direct for future wireless serial bus", "paper_id": "WOS:000342229400008"}