{"auto_keywords": [{"score": 0.02811223834300324, "phrase": "partial_broadcast_channels"}, {"score": 0.02322730111336099, "phrase": "secret_reconstruction"}, {"score": 0.010446071109433207, "phrase": "secret_sharing_scheme"}, {"score": 0.0078080069679272645, "phrase": "secret_reconstruction_phase"}, {"score": 0.007167729711065306, "phrase": "communication_rate"}, {"score": 0.004784448637292493, "phrase": "secret_sharing_schemes"}, {"score": 0.004694092086199672, "phrase": "secure_communications"}, {"score": 0.0043080553835735825, "phrase": "authorised_subset"}, {"score": 0.0038420778359143917, "phrase": "communication_complexity"}, {"score": 0.0033937776228549557, "phrase": "communication_costs"}, {"score": 0.0031845067058084583, "phrase": "secret_size"}, {"score": 0.0031542454984159634, "phrase": "total_number"}, {"score": 0.0031342307827666675, "phrase": "communication_bits"}, {"score": 0.0027594936602962075, "phrase": "communication_channels"}, {"score": 0.0027159094186967247, "phrase": "share_information"}, {"score": 0.002532151331015729, "phrase": "well-known_combinatorial_objects"}, {"score": 0.0025160740422447837, "phrase": "cover-free_family"}, {"score": 0.0023683286031958538, "phrase": "point-to-point_secure_channels"}, {"score": 0.0021049977753042253, "phrase": "communication_rates"}], "paper_keywords": ["cover-free family", " cryptography", " information-theoretic security", " multicast communication", " secret sharing"], "paper_abstract": "A secret sharing scheme typically requires secure communications in each of two distribution phases: 1) a dealer distributes shares to participants (share distribution phase); and later 2) the participants in some authorised subset send their share information to a combiner (secret reconstruction phase). While problems on storage required for participants, for example, the size of shares, have been well studied, problems regarding the communication complexity of the two distribution phases seem to have been mostly neglected in the literature so far. In this correspondence, we deal with several communication related problems in the secret reconstruction phase. Firstly, we show that there is a tradeoff between the communication costs and the number of participants involved in the secret reconstruction. We introduce the communication rate as the ratio of the secret size and the total number of communication bits transmitted from the participants to the combiner in the secret reconstruction phase. We derive a lower bound on the communication rate and give constructions that meet the bound. Secondly, we show that the point-to-point secure communication channels for participants to send share information to the combiner can be replaced with partial broadcast channels. We formulate partial broadcast channels as set systems and show that they are equivalent to the well-known combinatorial objects of cover-free family. Surprisingly, we find that the number of partial broadcast channels can be significantly reduced from the number of point-to-point secure channels. Precisely, in its optimal form, the number of channels can be reduced from n to O(log n), where n, is the number of participants in a secret sharing scheme. We also study the communication rates of partial broadcast channels for the secret reconstruction.", "paper_title": "On secret reconstruction in secret sharing schemes", "paper_id": "WOS:000252256900041"}