{"auto_keywords": [{"score": 0.047204746937999364, "phrase": "online_learning_community"}, {"score": 0.00481495049065317, "phrase": "tam_model"}, {"score": 0.004327196832280818, "phrase": "up-to-date_information"}, {"score": 0.0037595947142663997, "phrase": "learning_process"}, {"score": 0.0035339597999254064, "phrase": "learning_synergy"}, {"score": 0.00319348234663792, "phrase": "external_variables"}, {"score": 0.0026820489762533987, "phrase": "english"}, {"score": 0.0026370661343466354, "phrase": "research_results"}, {"score": 0.0024786330057813204, "phrase": "extended_variables"}, {"score": 0.0022020622730208514, "phrase": "future_development"}, {"score": 0.0021773853011112882, "phrase": "online_english_learning_communities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evaluation methodologies", " Evaluation of CAL systems", " Interactive learning environments", " Learning communities", " Media in education"], "paper_abstract": "An online learning community enables learners to access up-to-date information via the Internet anytime-anywhere because of the ubiquity of the World Wide Web (WWW). Students can also interact with one another during the learning process. Hence, researchers want to determine whether such interaction produces learning synergy in an online learning community. In this paper, we take the Technology Acceptance Model as a foundation and extend the external variables as well as the Perceived Variables as our model and propose a number of hypotheses. A total of 436 Taiwanese senior high school students participated in this research, and the online learning community focused on learning English. The research results show that all the hypotheses are supported, which indicates that the extended variables can effectively predict whether users will adopt an online learning community. Finally, we discuss the implications of our findings for the future development of online English learning communities. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Extending the TAM model to explore the factors that affect Intention to Use an Online Learning Community", "paper_id": "WOS:000273145400027"}