{"auto_keywords": [{"score": 0.04051211375775462, "phrase": "bop_betweenness"}, {"score": 0.015719716506582538, "phrase": "semisupervised_classification"}, {"score": 0.013203774879704224, "phrase": "unlabeled_nodes"}, {"score": 0.010876313759132828, "phrase": "node_j"}, {"score": 0.004723322467153553, "phrase": "-paths_group"}, {"score": 0.004589124394375718, "phrase": "well-founded_betweenness_measure"}, {"score": 0.004304343690920592, "phrase": "bop"}, {"score": 0.004222388726840072, "phrase": "semisupervised_classification_problems"}, {"score": 0.004195418010131832, "phrase": "weighted_directed_graphs"}, {"score": 0.003998531873723384, "phrase": "whole_topology"}, {"score": 0.003922378980031565, "phrase": "labeled_nodes"}, {"score": 0.003810850017764603, "phrase": "bop_framework"}, {"score": 0.00376230106601654, "phrase": "boltzmann_distribution"}, {"score": 0.0036906305674695985, "phrase": "possible_paths"}, {"score": 0.003015508235745547, "phrase": "k._intuitively"}, {"score": 0.002948547333717581, "phrase": "high_betweenness"}, {"score": 0.002901627749562029, "phrase": "large_probability"}, {"score": 0.002747599993498257, "phrase": "closed_form"}, {"score": 0.0027125596072406525, "phrase": "n_x_n_matrix"}, {"score": 0.0026184796288543878, "phrase": "group_betweenness"}, {"score": 0.002463579791780472, "phrase": "within-class_group_betweenness"}, {"score": 0.002347775213789611, "phrase": "highest_group_betweenness"}, {"score": 0.0022882500116799777, "phrase": "bop_group"}], "paper_keywords": ["Betweenness centrality", " graph and network analysis", " graph mining", " kernels on graphs", " network data", " semisupervised classification"], "paper_abstract": "This paper introduces a novel and well-founded betweenness measure, called the bag-of-paths (BoP) betweenness, as well as its extension, the BoP group betweenness, to tackle semisupervised classification problems on weighted directed graphs. The objective of semisupervised classification is to assign a label to unlabeled nodes using the whole topology of the graph and the labeled nodes at our disposal. The BoP betweenness relies on a BoP framework, assigning a Boltzmann distribution on the set of all possible paths through the network such that long (high-cost) paths have a low probability of being picked from the bag, while short (low-cost) paths have a high probability of being picked. Within that context, the BoP betweenness of node j is defined as the sum of the a posteriori probabilities that node j lies in between two arbitrary nodes (i, k) when picking a path starting in i and ending in k. Intuitively, a node typically receives a high betweenness if it has a large probability of appearing on paths connecting two arbitrary nodes of the network. This quantity can be computed in closed form by inverting an n x n matrix where n is the number of nodes. For the group betweenness, the paths are constrained to start and end in nodes within the same class, thereby defining a within-class group betweenness for each class. Unlabeled nodes are then classified according to the class showing the highest group betweenness. Experiments on various real-world datasets show that the BoP group betweenness performs competitively compared to all the tested state-of-the-art methods. The benefit of the BoP betweenness is particularly noticeable when only a few labeled nodes are available.", "paper_title": "Semisupervised Classification Through the Bag-of-Paths Group Betweenness", "paper_id": "WOS:000336917000013"}