{"auto_keywords": [{"score": 0.03764439525398964, "phrase": "correlated_pattern"}, {"score": 0.00481495049065317, "phrase": "mutually_and_positively_correlated_patterns"}, {"score": 0.004488505301335364, "phrase": "conditional_probability"}, {"score": 0.0032806521851034766, "phrase": "correlated_patterns"}, {"score": 0.0030911702059432224, "phrase": "new_correlation"}, {"score": 0.003074495313651187, "phrase": "interestingness_measure"}, {"score": 0.0029602552900111407, "phrase": "correlation_degree"}, {"score": 0.0028502479839354637, "phrase": "mining_efficiency"}, {"score": 0.002656650588033728, "phrase": "association_measure"}, {"score": 0.002613870237087035, "phrase": "mining_process"}, {"score": 0.0025440911575156755, "phrase": "mutually_and_positively_correlated_pattern_mining"}, {"score": 0.00235843888868088, "phrase": "positive_correlation_relationships"}, {"score": 0.002198173002125907, "phrase": "mining_combined_association"}, {"score": 0.0021510820434023207, "phrase": "quite_a_valid_method"}, {"score": 0.0021049977753042253, "phrase": "execution_time"}], "paper_keywords": [""], "paper_abstract": "Positive correlation mining can find such type of patterns, \"the conditional probability that a customer purchasing A is likely to also purchase B is not only great enough, but also significantly greater than the probability that a customer purchases only B.\" However, there often exist many independence relationships between items in a correlated pattern due to the definition of a correlated pattern. Therefore, we mine mutually and positively correlated patterns, whose any two sub-patterns are both associated and positively correlated. A new correlation interestingness measure is proposed for rationally evaluating the correlation degree. In order to improve the mining efficiency, we combine association with correlation and use not only the correlation measure but also the association measure in the mining process. Our experimental results show that mutually and positively correlated pattern mining is a good approach to discovering patterns which can reflect both association and positive correlation relationships between items at the same time. Meanwhile, our experimental results show that the mining combined association with correlation is quite a valid method to decrease the execution time.", "paper_title": "Efficiently mining mutually and positively correlated patterns", "paper_id": "WOS:000240088200012"}