{"auto_keywords": [{"score": 0.03762867376091313, "phrase": "binding_site"}, {"score": 0.015719716506582538, "phrase": "binding_sites"}, {"score": 0.01425049496070008, "phrase": "experimental_data"}, {"score": 0.010573462342151806, "phrase": "electron_density_map"}, {"score": 0.010504211293054906, "phrase": "vhelibs"}, {"score": 0.0045820747375409435, "phrase": "deposited_structural_models"}, {"score": 0.004536862734384202, "phrase": "high_quality"}, {"score": 0.004067910470129423, "phrase": "research_project"}, {"score": 0.004027751272984522, "phrase": "flawed_model"}, {"score": 0.003832801887709817, "phrase": "crystallographic_models"}, {"score": 0.003794954883650141, "phrase": "pdb._results"}, {"score": 0.003757480190200645, "phrase": "validation_helper"}, {"score": 0.003732702104052828, "phrase": "ligands_and_binding_sites"}, {"score": 0.0033911868693238894, "phrase": "convenient_graphical_user_interface"}, {"score": 0.0031218852898830755, "phrase": "pdb_redo_databank"}, {"score": 0.0031012854824177772, "phrase": "re-refined_and_re-built_crystallographic_models"}, {"score": 0.00290259605431505, "phrase": "electron_density"}, {"score": 0.0025849489224175548, "phrase": "specified_limits"}, {"score": 0.0023249757987087033, "phrase": "inexperienced_users"}, {"score": 0.0021903801614787423, "phrase": "important_step"}, {"score": 0.0021401625519713577, "phrase": "drug_discovery_purposes"}, {"score": 0.002118993962770973, "phrase": "structure-based_pharmacophore_development"}, {"score": 0.0021049977753042253, "phrase": "protein-ligand_docking_experiments"}], "paper_keywords": ["Electron density map", " Binding site structure validation", " Ligand structure validation", " Protein structure validation", " PDB", " PDB_REDO"], "paper_abstract": "Background: Many Protein Data Bank (PDB) users assume that the deposited structural models are of high quality but forget that these models are derived from the interpretation of experimental data. The accuracy of atom coordinates is not homogeneous between models or throughout the same model. To avoid basing a research project on a flawed model, we present a tool for assessing the quality of ligands and binding sites in crystallographic models from the PDB. Results: The Validation HElper for LIgands and Binding Sites (VHELIBS) is software that aims to ease the validation of binding site and ligand coordinates for non-crystallographers (i.e., users with little or no crystallography knowledge). Using a convenient graphical user interface, it allows one to check how ligand and binding site coordinates fit to the electron density map. VHELIBS can use models from either the PDB or the PDB_REDO databank of re-refined and re-built crystallographic models. The user can specify threshold values for a series of properties related to the fit of coordinates to electron density (Real Space R, Real Space Correlation Coefficient and average occupancy are used by default). VHELIBS will automatically classify residues and ligands as Good, Dubious or Bad based on the specified limits. The user is also able to visually check the quality of the fit of residues and ligands to the electron density map and reclassify them if needed. Conclusions: VHELIBS allows inexperienced users to examine the binding site and the ligand coordinates in relation to the experimental data. This is an important step to evaluate models for their fitness for drug discovery purposes such as structure-based pharmacophore development and protein-ligand docking experiments.", "paper_title": "The good, the bad and the dubious: VHELIBS, a validation helper for ligands and binding sites", "paper_id": "WOS:000322574800001"}