{"auto_keywords": [{"score": 0.04571345706034806, "phrase": "multi-class_classification"}, {"score": 0.01174712698258893, "phrase": "specialist_classifiers"}, {"score": 0.011472359439069825, "phrase": "catch-all_classifier"}, {"score": 0.009123334168101899, "phrase": "discharge_summary"}, {"score": 0.0037634608487353183, "phrase": "one-versus-all_manner"}, {"score": 0.0031845067058084583, "phrase": "resulting_combined_classifier"}, {"score": 0.003109390330476147, "phrase": "specializing_classifier"}, {"score": 0.0028715299874549245, "phrase": "discharge_summaries"}, {"score": 0.0021049977753042253, "phrase": "independent_multi-class_classification_task"}], "paper_keywords": ["Classification", " Combination of classifiers", " Natural language processing", " Machine learning"], "paper_abstract": "We present specializing, a method for combining classifiers for multi-class classification. Specializing trains one specialist classifier per class and utilizes each specialist to distinguish that class from all others in a one-versus-all manner. It then supplements the specialist classifiers with a catch-all classifier that performs multi-class classification across all classes. We refer to the resulting combined classifier as a specializing classifier. We develop specializing to classify 16 diseases based on discharge summaries. For each discharge summary, we aim to predict whether each disease is present, absent, or questionable in the patient, or unmentioned in the discharge summary. We treat the classification of each disease as an independent multi-class classification task. For each disease, we develop one specialist classifier for each of the present, absent, questionable, and unmentioned classes; we supplement these specialist classifiers with a catch-all classifier that encompasses all of the classes for that disease. We evaluate specializing on each of the 16 diseases and show that it improves significantly over voting and stacking when used for multi-class classification on our data. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Specializing for predicting obesity and its co-morbidities", "paper_id": "WOS:000270870500013"}