{"auto_keywords": [{"score": 0.05007834503226341, "phrase": "autonomous_systems"}, {"score": 0.03153935796768665, "phrase": "tactical_decision-making_systems"}, {"score": 0.028840656414376893, "phrase": "tdf"}, {"score": 0.0046937237797352515, "phrase": "increasing_need"}, {"score": 0.004460309246062286, "phrase": "unpredictable_environments"}, {"score": 0.004303830426772906, "phrase": "autonomous_decision-making_systems"}, {"score": 0.004007083686875716, "phrase": "dynamic_context"}, {"score": 0.0038862297330905836, "phrase": "unexpected_environmental_change"}, {"score": 0.0034911335714333507, "phrase": "system's_overall_goal"}, {"score": 0.0033857878144822906, "phrase": "design_methodology"}, {"score": 0.0030569913145731408, "phrase": "significant_problem"}, {"score": 0.002466510117718297, "phrase": "skeleton_code"}, {"score": 0.002416589459425828, "phrase": "overall_design"}, {"score": 0.0023079476172758033, "phrase": "uml"}, {"score": 0.0022382002476510573, "phrase": "significant_benefits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Tactics modelling", " Behaviour modelling", " Multi-agent systems"], "paper_abstract": "There is an increasing need for autonomous systems that exhibit effective decision-making in unpredictable environments. However, the design of autonomous decision-making systems presents considerable challenges, particularly when they have to achieve their goals within a dynamic context. Tactics designed to handle unexpected environmental change, or attack by an adversary, must balance the need for reactivity with that of remaining focused on the system's overall goal. The lack of a design methodology and supporting tools for representing tactics makes them difficult to understand, maintain and reuse. This is a significant problem in the design of tactical decision-making systems. We describe a methodology and accompanying tool, TDF (Tactics Development Framework), based on the BDI (Beliefs, Desires, Intentions) paradigm. TDF supports structural modelling of missions, goals, scenarios, input/output, messaging and procedures, and generates skeleton code that reflects the overall design. TDF has been evaluated through comparison with UML, indicating that it provides significant benefits to those building autonomous, tactical decision-making systems. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A framework for modelling tactical decision-making in autonomous systems", "paper_id": "WOS:000364244600013"}