{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "kms"}, {"score": 0.01213857377241656, "phrase": "knowledge-seeking_behavior"}, {"score": 0.010617299507570137, "phrase": "kms_users"}, {"score": 0.009611986627039772, "phrase": "kms."}, {"score": 0.008551570654121893, "phrase": "perceived_usefulness"}, {"score": 0.00481495049065317, "phrase": "organizational_knowledge"}, {"score": 0.0047732596509542135, "phrase": "using_knowledge_management_systems"}, {"score": 0.004650330504968421, "phrase": "knowledge_management_systems"}, {"score": 0.0044524122425287005, "phrase": "knowledge-sharing_tool"}, {"score": 0.004189337956225294, "phrase": "important_concern"}, {"score": 0.003924629168434799, "phrase": "important_enabling_factor"}, {"score": 0.0035199624440843892, "phrase": "extant_literature"}, {"score": 0.003459191419478298, "phrase": "information_technology"}, {"score": 0.003311799410921826, "phrase": "knowledge_seekers'_trust"}, {"score": 0.0027341763737751467, "phrase": "employees'_knowledge-seeking_continuance_intention"}, {"score": 0.002629026692001082, "phrase": "mediated_effect"}, {"score": 0.002462664392109308, "phrase": "stronger_determinant"}, {"score": 0.0024095777415804346, "phrase": "perceived_seeking_efforts"}, {"score": 0.0021987994275190314, "phrase": "corporate_kms_usage"}], "paper_keywords": [""], "paper_abstract": "Knowledge Management Systems (KMS) have become increasingly popular as a knowledge-sharing tool in contemporary corporations. Enticing employees to seek knowledge from KMS remains an important concern for researchers and practitioners. Trust has been widely recognized in many studies as an important enabling factor for seeking knowledge; however, the role of trust in promoting knowledge-seeking behavior using KMS has not been adequately addressed. Drawing upon the extant literature on trust and information technology adoption, this article examines the relationships between the knowledge seekers' trust in the community of KMS users, their perceptions toward the system (perceived usefulness and perceived seeking efforts), and the intention to continually use the KMS. The results reveal that trust in the community of KMS users does not directly affect the employees' knowledge-seeking continuance intention; rather, it happens indirectly through a mediated effect of perceived usefulness of the KMS. Furthermore, we find that trust seems to be a stronger determinant of perceived usefulness than of perceived seeking efforts. Our study thus demonstrates the indirect, but still crucial, role of trust in knowledge-seeking behavior in the context of corporate KMS usage. Other findings and the implications of this study for both researchers and practitioners are correspondingly discussed.", "paper_title": "The Role of Trust in Promoting Organizational Knowledge Seeking Using Knowledge Management Systems: An Empirical Investigation", "paper_id": "WOS:000263935100008"}