{"auto_keywords": [{"score": 0.03909673303902588, "phrase": "ground_states"}, {"score": 0.008713768692145006, "phrase": "computing_ground_states"}, {"score": 0.004461761855323898, "phrase": "efficient_numerical_methods"}, {"score": 0.004207734323806386, "phrase": "ioffe-pritchard_magnetic_field_b"}, {"score": 0.0038534477978822133, "phrase": "numerical_method"}, {"score": 0.0034673190692473903, "phrase": "numerical_results"}, {"score": 0.0028069426877159664, "phrase": "single-mode_approximation"}, {"score": 0.0026624684547385718, "phrase": "simpler_numerical_methods"}, {"score": 0.0024667783849055634, "phrase": "numerical_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Spin-1 Bose-Einstein condensate", " Ground state", " Ferromagnetic", " Antiferromagnetic", " Single-mode approximation", " Gradient flow with discrete normalization"], "paper_abstract": "In this paper, we propose efficient numerical methods for computing ground states of spin-1 Bose-Einstein condensates (BECs) with/without the Ioffe-Pritchard magnetic field B (X). When B (X) not equal 0, a numerical method is introduced to compute the ground states and it is also applied to study properties of ground states. Numerical results suggest that the densities of m(F) = +/- 1 components in ground states are identical for any nonzero B(x). In particular, if B(x) B not equal 0 is a constant, the ground states satisfy the single-mode approximation. When B(x) 0, efficient and simpler numerical methods are presented to solve the ground states of spin-1 BECs based on their ferromagnetic/antiferromagnetic characterizations. Numerical simulations show that our methods are more efficient than those in the literature. In addition, some conjectures are made from our numerical observations. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Efficient numerical methods for computing ground states of spin-1 Bose-Einstein condensates based on their characterizations", "paper_id": "WOS:000323610500010"}