{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_perceptions"}, {"score": 0.03667961778394491, "phrase": "evaluation_method"}, {"score": 0.004677032188041644, "phrase": "numerous_methods"}, {"score": 0.004543046350523362, "phrase": "requirements_modeling"}, {"score": 0.004412881870378388, "phrase": "widespread_use"}, {"score": 0.004180919839686364, "phrase": "proper_empirical_evaluations"}, {"score": 0.004010785080336424, "phrase": "evaluation_methods"}, {"score": 0.003424850089214916, "phrase": "theoretical_model"}, {"score": 0.003368367923339975, "phrase": "relevant_dimensions"}, {"score": 0.0032177835714470027, "phrase": "practical_instrument"}, {"score": 0.00313849462329633, "phrase": "quality_dimensions"}, {"score": 0.0029733203800202303, "phrase": "particular_requirements"}, {"score": 0.0025070703395635133, "phrase": "empirical_test"}, {"score": 0.0024759682272230735, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Requirements modeling", " Method evaluation", " RUP", " Theoretical models", " Controlled experiment"], "paper_abstract": "Numerous methods and techniques have been proposed for requirements modeling, although very few have had widespread use in practice. One drawback of requirements modeling methods is that they lack proper empirical evaluations. This means that there is a need for evaluation methods that consider both the theoretical and practical aspects of this type of methods and techniques. In this paper, we present a method for evaluating the quality of requirements modeling methods based on user perceptions. The evaluation method consists of a theoretical model that explains the relevant dimensions of quality for requirements modeling methods, along with a practical instrument with which to measure these quality dimensions. Basically, it allows us to predict the acceptance of a particular requirements modeling method in practice, based on the effort of applying the method, the quality of the requirements artifacts produced, and the user perceptions with regard to the quality of the method. The paper also presents an empirical test of the proposed method for evaluating a Rational Unified Process (RUP) extension for requirements modeling. That test was carried out through a family of experiments conducted with students and practitioners and provides evidence of the usefulness of the evaluation method proposed. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Evaluating requirements modeling methods based on user perceptions: A family of experiments", "paper_id": "WOS:000291771400006"}