{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tracking_dynamic"}, {"score": 0.004750178261675602, "phrase": "long_range_passive_uhf_rfid"}, {"score": 0.004623224002010226, "phrase": "service_robots"}, {"score": 0.0045404698551856125, "phrase": "impressive_potential"}, {"score": 0.004281568920264999, "phrase": "shopping_malls"}, {"score": 0.004055652445791872, "phrase": "low_cost"}, {"score": 0.004019171295196278, "phrase": "contactless_way"}, {"score": 0.00357362651129581, "phrase": "sight_sensors"}, {"score": 0.0034780071331554003, "phrase": "laser_range_finders"}, {"score": 0.00326469463991041, "phrase": "passive_ultrahigh_frequency"}, {"score": 0.0032061793819537633, "phrase": "sensing_technology"}, {"score": 0.0031773149810690494, "phrase": "mobile_robots"}, {"score": 0.003134503353065008, "phrase": "dynamic_objects"}, {"score": 0.003023129616910419, "phrase": "two-stage_dynamic_motion_model"}, {"score": 0.0029025435402480326, "phrase": "dynamic_motion"}, {"score": 0.002724428781940696, "phrase": "state_estimation"}, {"score": 0.002687702958515561, "phrase": "particle_filter"}], "paper_keywords": [""], "paper_abstract": "Service robots have shown an impressive potential in providing assistance and guidance in various environments, such as supermarkets, shopping malls, homes, airports, and libraries. Due to the low cost and contactless way of communication, radiofrequency identification (RFID) technology provides a solution to overcome the difficulties (e.g., occlusions) that the traditional line-of-sight sensors (e.g., cameras and laser range finders) face. In this paper, we address the applications of using passive ultrahigh frequency (UHF) RFID as a sensing technology for mobile robots to track dynamic objects. More precisely, we combine a two-stage dynamic motion model with the dual particle filter to capture the dynamic motion of the object and to quickly recover from failures in tracking. The state estimation from the particle filter is used in combination with the VFH+ (Vector Field Histogram) to guide the robot towards the target. This is then integrated into a framework, which allows the robot to search for both static and dynamic tags, follow them, and maintain the distance between them. We finally tested our approach on a SCITOS G5 service robot through various experiments.", "paper_title": "On Tracking Dynamic Objects with Long Range Passive UHF RFID Using a Mobile Robot", "paper_id": "WOS:000355827500001"}