{"auto_keywords": [{"score": 0.033411028272843174, "phrase": "continuous_data"}, {"score": 0.007625250936540795, "phrase": "confidence_measure"}, {"score": 0.00481495049065317, "phrase": "association_analysis"}, {"score": 0.004616859702338596, "phrase": "non-binary_data"}, {"score": 0.004344965512058521, "phrase": "general_framework"}, {"score": 0.00329813918116714, "phrase": "traditional_concept"}, {"score": 0.0032370412139943808, "phrase": "error-tolerant_itemsets"}, {"score": 0.002684819249720834, "phrase": "conditional_probability"}, {"score": 0.0025862068041567934, "phrase": "association_rules"}, {"score": 0.002514625755809045, "phrase": "better_coverage"}, {"score": 0.00246800641971897, "phrase": "equivalent_confidence_level"}, {"score": 0.0023996890513009743, "phrase": "traditional_itemsets"}, {"score": 0.0022475295254231714, "phrase": "standard_confidence_measure"}, {"score": 0.0022058510091498666, "phrase": "binary_transaction_data"}, {"score": 0.0021049977753042253, "phrase": "important_issues"}], "paper_keywords": ["confidence", " support", " association rules", " error-tolerant itemsets", " data mining"], "paper_abstract": "In this paper, we explore extending association analysis to non-traditional types of patterns and non-binary data by generalizing the notion of confidence. We begin by describing a general framework that measures the strength of the connection between two association patterns by the extent to which the strength of one association pattern provides information about the strength of another. Although this framework can serve as the basis for designing or analyzing measures of association, the focus in this paper is to use the framework as the basis for extending the traditional concept of confidence to error-tolerant itemsets (ETIs) and continuous data. To that end, we provide two examples. First, we (1) describe an approach to defining confidence for ETIs that preserves the interpretation of confidence as an estimate of a conditional probability, and (2) show how association rules based on ETIs can have better coverage (at an equivalent confidence level) than rules based on traditional itemsets. Next, we derive a confidence measure for continuous data that agrees with the standard confidence measure when applied to binary transaction data. Further analysis of this result exposes some of the important issues involved in constructing a confidence measure for continuous data.", "paper_title": "Generalizing the notion of confidence", "paper_id": "WOS:000248629200001"}