{"auto_keywords": [{"score": 0.049450454172374314, "phrase": "chemical_potentials"}, {"score": 0.04898430559090854, "phrase": "competing_phases"}, {"score": 0.02819827616624647, "phrase": "thermodynamic_stability"}, {"score": 0.012337305024650544, "phrase": "stability_region"}, {"score": 0.005611060139998128, "phrase": "distributed_program"}, {"score": 0.0055833377968117605, "phrase": "test_data"}, {"score": 0.0049737856759223265, "phrase": "standard_states"}, {"score": 0.004650734988806485, "phrase": "simple_and_fast_algorithm"}, {"score": 0.0045896535536496166, "phrase": "necessary_chemical_environment"}, {"score": 0.0045443671106012405, "phrase": "multiternary_material"}, {"score": 0.00446987606516801, "phrase": "constituent_elements"}, {"score": 0.004324521292490181, "phrase": "constituent_elemental_chemical_potentials"}, {"score": 0.00428183967532854, "phrase": "intersection_points"}, {"score": 0.004190796368475121, "phrase": "atomic_species"}, {"score": 0.004122077038067119, "phrase": "free_energy"}, {"score": 0.003922580121023413, "phrase": "chemical_potential_space"}, {"score": 0.003903167239608632, "phrase": "competing_phase"}, {"score": 0.003845500924733243, "phrase": "two-_and_three-dimensional_spaces"}, {"score": 0.0036775449831999555, "phrase": "ternary_system"}, {"score": 0.003653292083664589, "phrase": "quaternary_system"}, {"score": 0.003623199939953831, "phrase": "essential_analysis"}, {"score": 0.003516898780234098, "phrase": "ternary_materials"}, {"score": 0.003419358663401825, "phrase": "increased_interest"}, {"score": 0.003396802661771862, "phrase": "technological_applications"}, {"score": 0.003379983027734299, "phrase": "energy_harvesting"}, {"score": 0.0033245147666408157, "phrase": "great_benefit"}, {"score": 0.0033080518857734158, "phrase": "theoretical_and_computational_study"}, {"score": 0.003270412501042137, "phrase": "program"}, {"score": 0.003253760219100462, "phrase": "cplap_catalogue"}, {"score": 0.0031950646670695546, "phrase": "cpc_program_library"}, {"score": 0.0031845067058084583, "phrase": "queen's_university"}, {"score": 0.0031739836398588976, "phrase": "belfast"}, {"score": 0.0031634950012560384, "phrase": "n._ireland"}, {"score": 0.0031426214970263137, "phrase": "standard_cpc"}, {"score": 0.0029657370927751742, "phrase": "tar.gz_programming_language"}, {"score": 0.002864447850972632, "phrase": "ram"}, {"score": 0.0027301288585331127, "phrase": "constituent_atomic_species"}, {"score": 0.0025636340720115495, "phrase": "constituent_elemental_species"}, {"score": 0.0025131909625516514, "phrase": "elemental_chemical_potentials"}, {"score": 0.0024232694434408093, "phrase": "n_linear_equations"}, {"score": 0.0023211278859252746, "phrase": "compatible_results"}, {"score": 0.0023134511108141606, "phrase": "boundary_points"}, {"score": 0.002256677005409071, "phrase": "material_growth_environment"}, {"score": 0.002234358539133758, "phrase": "thermal_and_diffusive_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Thermodynamic stability", " Chemical potential", " Materials design", " Defect formation analysis"], "paper_abstract": "We present a simple and fast algorithm to test the thermodynamic stability and determine the necessary chemical environment for the production of a multiternary material, relative to competing phases and compounds formed from the constituent elements. If the material is found to be stable, the region of stability, in terms of the constituent elemental chemical potentials, is determined from the intersection points of hypersurfaces in an (n - 1)-dimensional chemical potential space, where n is the number of atomic species in the material. The input required is the free energy of formation of the material itself, and that of all competing phases. Output consists of the result of the test of stability, the intersection points in the chemical potential space and the competing phase to which they relate, and, for two- and three-dimensional spaces, a file which may be used for visualization of the stability region. We specify the use of the program by applying it both to a ternary system and to a quaternary system. The algorithm automates essential analysis of the thermodynamic stability of a material. This analysis consists of a process which is lengthy for ternary materials, and becomes much more complicated when studying materials of four or more constituent elements, which have become of increased interest in recent years for technological applications such as energy harvesting and optoelectronics. The algorithm will therefore be of great benefit to the theoretical and computational study of such materials. Program summary Program title: CPLAP Catalogue identifier: AEQO_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEQO_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 4301 No. of bytes in distributed program, including test data, etc.: 28851 Distribution format: tar.gz Programming language: FORTRAN 90. Computer: Any computer with a FORTRAN 90 compiler. Operating system: Any OS with a FORTRAN 90 compiler. RAM: 2 megabytes Classification: 16.1, 23. Nature of problem: To test the thermodynamic stability of a material with respect to competing phases and standard states of the constituent atomic species and, if stable, determine the range of chemical potentials consistent with its synthesis. Solution method: Assume that the formation of the material of interest occurs, rather than that of competing phases and standard states of the constituent elemental species. From this assumption derive a series of conditions on the elemental chemical potentials. Convert these conditions to a system of m linear equations with n unknowns, where m > n. Solve all combinations of n linear equations, and test which solutions are compatible with the conditions on the chemical potentials. If none are, the system is unstable. Otherwise, the compatible results define boundary points of the stability region within the space spanned by the chemical potentials. Restrictions: The material growth environment is assumed to be in thermal and diffusive equilibrium. Additional comments: For two- and three-dimensional spaces spanned by the chemical potentials, files are produced for visualization of the stability region (if it exists). Running time: Less than one second. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Automated procedure to determine the thermodynamic stability of a material and the range of chemical potentials necessary for its formation relative to competing phases and compounds", "paper_id": "WOS:000328666100033"}