{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "car-following_models"}, {"score": 0.015456171186625827, "phrase": "different_traffic"}, {"score": 0.015111532340446914, "phrase": "instrumented_vehicle"}, {"score": 0.00763811142685463, "phrase": "driver_type"}, {"score": 0.00453531164565523, "phrase": "simulation_tools"}, {"score": 0.004345525254560329, "phrase": "lead_vehicle_trajectory"}, {"score": 0.0042354707960660706, "phrase": "field_data"}, {"score": 0.0038441852899779197, "phrase": "car-following_calibration_parameters"}, {"score": 0.003569451476205552, "phrase": "weather_conditions"}, {"score": 0.003528957477793481, "phrase": "clear_sky"}, {"score": 0.0033811403330431897, "phrase": "assessed_models"}, {"score": 0.0033048445033866795, "phrase": "aimsun_software"}, {"score": 0.0032766807440920494, "phrase": "pitt"}, {"score": 0.0032302647179383915, "phrase": "corsim_software"}, {"score": 0.003166384930533443, "phrase": "mitsimlab_program"}, {"score": 0.0031215289677725693, "phrase": "modified_pitt_model"}, {"score": 0.002965229277927781, "phrase": "field_trajectories"}, {"score": 0.002683304054823427, "phrase": "previous_findings"}, {"score": 0.0026604207233593973, "phrase": "calibration_analysis"}, {"score": 0.002622713543589907, "phrase": "best_variable"}, {"score": 0.0024560114164181765, "phrase": "final_trajectory"}, {"score": 0.002359759876402679, "phrase": "traffic_condition"}, {"score": 0.0023064582783867645, "phrase": "best_results"}, {"score": 0.0022287497627555895, "phrase": "mitsim_model"}, {"score": 0.0021908807203548345, "phrase": "recommended_calibration_parameters"}, {"score": 0.0021721876496534837, "phrase": "application_guidelines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Car-following", " Model calibration", " Microsimulation", " Driver behavior", " Traffic congestion", " Weather conditions"], "paper_abstract": "Car-following models are important components of simulation tools, since they describe the behavior of the following vehicle as a function of the lead vehicle trajectory. Several models have been developed and evaluated using field data. However, the literature has been inconclusive regarding the applicability of various car-following models under different operational conditions such as congested vs. non-congested. There has been very limited research regarding the relationship between car-following calibration parameters and different driver types. The objective of this study was to assess four car-following models using field data under different traffic (congested vs. uncongested) and weather conditions (rain vs. clear sky) and for various driver types (aggressive, average, and conservative). The assessed models were the Gipps (component of the AIMSUN software), Pitt (component of the CORSIM software), MITSIM (utilized in MITSIMLab program), and the Modified Pitt model. The data used in the analysis were collected with the help of an instrumented vehicle. The field trajectories were compared to the trajectories obtained by each of the four models evaluated. Results showed that the variable predicted best by the models was the speed of the following vehicle, which is consistent with previous findings. The calibration analysis also showed that the best variable to be used for calibration is spacing. Calibrating by spacing minimizes the errors that can be accumulated and can distort the final trajectory. Three calibration analyses were completed: first using all data available, second by traffic condition, and third by driver type. The best results were obtained when the parameters were calibrated by driver type using the MITSIM model. The study concludes with recommended calibration parameters, and application guidelines related to the car-following models examined. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Assessment of car-following models by driver type and under different traffic, weather conditions using data from an instrumented vehicle", "paper_id": "WOS:000328593000015"}