{"auto_keywords": [{"score": 0.0456315961504987, "phrase": "ckd"}, {"score": 0.010612382822272996, "phrase": "chronic_kidney_disease"}, {"score": 0.005954999541236424, "phrase": "sankey_diagram"}, {"score": 0.005024157813808587, "phrase": "complex_diseases"}, {"score": 0.0046668582674202555, "phrase": "taiwan"}, {"score": 0.004176033420846065, "phrase": "ckd_diagnosis"}, {"score": 0.004132743580000062, "phrase": "time-evolutionary_type_visualization"}, {"score": 0.004104132253183181, "phrase": "materials_and_methods_our_sample_data"}, {"score": 0.003390149669470349, "phrase": "sankey-style_diagram"}, {"score": 0.0026762323224804197, "phrase": "basic_zooming_and_planning_functions"}, {"score": 0.002427826856342292, "phrase": "novel_visualization_approach"}, {"score": 0.0024109902338204873, "phrase": "temporal_patterns"}, {"score": 0.0023611760395203106, "phrase": "complex_disease"}, {"score": 0.0022963507669678815, "phrase": "promising_method"}, {"score": 0.0021871503075921537, "phrase": "time-evolution_style"}, {"score": 0.0021049977753042253, "phrase": "possible_outcomes"}], "paper_keywords": ["visualize analytic", " data visualization", " CKD polymorbidity visualization", " comorbidity visualization", " CKD Sankey diagram"], "paper_abstract": "Objective The aim of this study is to analyze and visualize the polymorbidity associated with chronic kidney disease (CKD). The study shows diseases associated with CKD before and after CKD diagnosis in a time-evolutionary type visualization. Materials and Methods Our sample data came from a population of one million individuals randomly selected from the Taiwan National Health Insurance Database, 1998 to 2011. From this group, those patients diagnosed with CKD were included in the analysis. We selected 11 of the most common diseases associated with CKD before its diagnosis and followed them until their death or up to 2011. We used a Sankey-style diagram, which quantifies and visualizes the transition between pre- and post-CKD states with various lines and widths. The line represents groups and the width of a line represents the number of patients transferred from one state to another. Results The patients were grouped according to their states: that is, diagnoses, hemodialysis/ transplantation procedures, and events such as death. A Sankey diagram with basic zooming and planning functions was developed that temporally and qualitatively depicts they had amid change of comorbidities occurred in pre-and post-CKD states. Discussion This represents a novel visualization approach for temporal patterns of polymorbidities associated with any complex disease and its outcomes. The Sankey diagram is a promising method for visualizing complex diseases and exploring the effect of comorbidities on outcomes in a time-evolution style. Conclusions This type of visualization may help clinicians foresee possible outcomes of complex diseases by considering comorbidities that the patients have developed.", "paper_title": "A novel tool for visualizing chronic kidney disease associated polymorbidity: a 13-year cohort study in Taiwan", "paper_id": "WOS:000352771500005"}