{"auto_keywords": [{"score": 0.032056921787303426, "phrase": "test_generation_process"}, {"score": 0.02992107899394738, "phrase": "test_set"}, {"score": 0.00481495049065317, "phrase": "n-detection_test_generation"}, {"score": 0.004506968388996092, "phrase": "n_different_tests"}, {"score": 0.0044435677598780796, "phrase": "target_fault"}, {"score": 0.004218602458288531, "phrase": "test_set_size_constraints"}, {"score": 0.00406214911915987, "phrase": "appropriate_values"}, {"score": 0.003802135020791801, "phrase": "n-detection_test_generation_process"}, {"score": 0.0031619994642255846, "phrase": "n-detection_test_set"}, {"score": 0.0024842242921857705, "phrase": "one-detection_test"}, {"score": 0.002292199117499287, "phrase": "unique_pattern"}], "paper_keywords": ["bridging faults", " n-detection test sets", " stuck-at faults", " test generation", " test set quality"], "paper_abstract": "An n-detection test set contains n different tests for each target fault. The value of n is typically determined based on test set size constraints, and certain values have become standard. Appropriate values for n are investigated in this paper by considering the saturation of the n-detection test generation process. As n is increased, eventually, the rate of increase in test set quality starts dropping. Saturation occurs when the increase in test set quality with n drops below a certain level. Three parameters of an n-detection test set are introduced to measure the saturation of the test generation process: 1) the fraction of faults detected n times or less by the test set; 2) the fraction of faults detected fewer than n times by the test set; and 3) the test set size relative to the size of a one-detection test set. It is demonstrated that the behavior of each one of these parameters follows a unique pattern as n is increased, and certain features of this behavior can be used to identify saturation. All the parameters can be efficiently computed during the test generation process.", "paper_title": "On the saturation of n-detection test generation by different definitions with increased n", "paper_id": "WOS:000255222600014"}