{"auto_keywords": [{"score": 0.046903356830179425, "phrase": "corporate_identity"}, {"score": 0.00481495049065317, "phrase": "spanish_banks'_identities"}, {"score": 0.0045324756541157574, "phrase": "key_elements"}, {"score": 0.004388631450145507, "phrase": "entities'_websites"}, {"score": 0.003951800212882157, "phrase": "spanish_banking_institutions"}, {"score": 0.0038417798012011155, "phrase": "identity_elements"}, {"score": 0.003810909603178837, "phrase": "corporate_websites"}, {"score": 0.003765067028482197, "phrase": "content_analysis_methodology"}, {"score": 0.003587125711973247, "phrase": "six_dimensions"}, {"score": 0.0032038465090068646, "phrase": "financial_institutions"}, {"score": 0.003165283275312972, "phrase": "moderating_role"}, {"score": 0.0031398318568608505, "phrase": "different_dimensions"}, {"score": 0.0029553380263320195, "phrase": "natural_sequel"}, {"score": 0.002826949449085849, "phrase": "identity_communication"}, {"score": 0.002759279370360986, "phrase": "corporate_image"}, {"score": 0.0023666732429695908, "phrase": "best_way"}, {"score": 0.0023287359930308864, "phrase": "new_identity"}, {"score": 0.002227508035618043, "phrase": "empirical_basis"}, {"score": 0.0021049977753042253, "phrase": "banking_institutions"}], "paper_keywords": ["Corporate identity", " Brand", " Content analysis", " Banking sector", " Corporate identity", " Web sites"], "paper_abstract": "Purpose - This paper aims to reveal the key elements of corporate identity through the information provided by entities' websites, and to study the differences in the information transmitted by entities through their websites. Design/methodology/approach - The research develops an analysis of corporate identity in Spanish banking institutions, focusing on the communication of identity elements through corporate websites. A content analysis methodology is employed. Findings - A total of 230 categories related to six dimensions of corporate identity were identified: visual identity, communication, culture, behaviour, strategy and structure. The results show the elements most widely used by financial institutions and the moderating role of different dimensions (market scope, specialisation, etc.). Research limitations/implications - A natural sequel of this work would involve the analysis of other sources of identity communication, and measurement of the corporate image transmitted to stakeholders. Practical implications The results obtained will allow entities to compare themselves to others in the same sector; likewise companies that are involved in mergers will be able to gain an understanding of the best way to build a new identity. Originality/value - Most literature on corporate identity is theoretical, with no empirical basis. This paper reveals empirically the elements of identity with a focus on banking institutions, and allows differences between entities to be established.", "paper_title": "Communicating Spanish banks' identities: the role of websites", "paper_id": "WOS:000310124100004"}