{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_cluster_discovery"}, {"score": 0.02937361584816291, "phrase": "proposed_method"}, {"score": 0.004630270043271386, "phrase": "challenging_problem"}, {"score": 0.004323886831151445, "phrase": "natural_clusters"}, {"score": 0.003863758357292741, "phrase": "general_stochastic_clustering_method"}, {"score": 0.0037519679864796906, "phrase": "nature-inspired_ant-based_clustering_approach"}, {"score": 0.0035553221885904467, "phrase": "stochastic_search"}, {"score": 0.0034187896011435245, "phrase": "underlying_clusters"}, {"score": 0.002937318465594425, "phrase": "explicit_assumption"}, {"score": 0.0028944757265206332, "phrase": "underlying_distribution"}, {"score": 0.002414616656410503, "phrase": "linear_time"}, {"score": 0.002391067964886602, "phrase": "space_complexities"}, {"score": 0.002232519579957707, "phrase": "large_datasets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Clustering", " Ant-based clustering", " Automatic cluster detection"], "paper_abstract": "Finding clusters in data is a challenging problem. Given a dataset, we usually do not know the number of natural clusters hidden in the dataset. The problem is exacerbated when there is little or no additional information except the data itself. This paper proposes a general stochastic clustering method that is a simplification of nature-inspired ant-based clustering approach. It begins with a basic solution and then performs stochastic search to incrementally improve the solution until the underlying clusters emerge, resulting in automatic cluster discovery in datasets. This method differs from several recent methods in that it does not require users to input the number of clusters and it makes no explicit assumption about the underlying distribution of a dataset. Our experimental results show that the proposed method performs better than several existing methods in terms of clustering accuracy and efficiency in majority of the datasets used in this study. Our theoretical analysis shows that the proposed method has linear time and space complexities, and our empirical study shows that it can accurately and efficiently discover clusters in large datasets in which many existing methods fail to run. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A general stochastic clustering method for automatic cluster discovery", "paper_id": "WOS:000292849000047"}