{"auto_keywords": [{"score": 0.03779503638379083, "phrase": "resource_integration"}, {"score": 0.03757038924297579, "phrase": "service_integration"}, {"score": 0.015719716506582538, "phrase": "shanghai_jiao_tong_university_library"}, {"score": 0.011831793116441043, "phrase": "portal_requirements"}, {"score": 0.011580950332586628, "phrase": "metalib"}, {"score": 0.011510251292012153, "phrase": "sfx"}, {"score": 0.008444262150214946, "phrase": "service_collaboration"}, {"score": 0.004785356349906913, "phrase": "purpose_-_the_purpose"}, {"score": 0.003964727263291033, "phrase": "promising_approach"}, {"score": 0.0037621210719690594, "phrase": "existing_portal_features"}, {"score": 0.0034506596895901003, "phrase": "findings_-_portal_requirements"}, {"score": 0.0030030452897701863, "phrase": "exhaustive_list"}, {"score": 0.0028494425496120228, "phrase": "information_integration"}, {"score": 0.0026052812376885504, "phrase": "related_standards"}, {"score": 0.0024190798397126924, "phrase": "information_portals"}, {"score": 0.002367315484467406, "phrase": "portal_systems"}, {"score": 0.0021049977753042253, "phrase": "service_framework"}], "paper_keywords": ["Portals", " Resource management", " Worldwide web", " China"], "paper_abstract": "Purpose - The purpose of this paper is to relate how Shanghai Jiao Tong University Library integrates its resources and services, the functions realised and technologies adopted in order to meet user's information needs in a simple, convenient and personalised way. As information resources become more web-based, disparate and distributed, libraries are facing the challenge of how to provide information efficiently to their users. A promising approach is to integrate resources and deliver services via a portal. Design/methodology/approach - This paper analyses existing portal features, needs and functions, and carries out the approach to meet portal requirements through resource integration and service integration supported by MetaLib, SFX and Web 2.0 technologies. Findings - Portal requirements can be met by resource integration and service integration. Methods to achieve cross searching, ways to enhance resource linking, and integration of library, subject and personalisation services are analysed and concluded. The service framework is depicted in the end. Research limitations/implications - Since the analysis is not based on an exhaustive list of portals and as technologies are always developing rapidly, the methods and functions to achieve information integration and provision presented in this paper perhaps are not complete and may need to be adjusted and amended. Work is also needed urgently to develop and establish related standards and protocols for service collaboration. Practical implications - This paper should be helpful for libraries that plan to provide services to their users via information portals, or to develop or evaluate portal systems or products. Originality/value - This paper analyses and concludes methods and functions to meet portal requirements through resource integration and service integration supported by MetaLib, SFX and Web 2.0 technologies. It discusses the service collaboration and depicts the service framework.", "paper_title": "Information portal development and practice at Shanghai Jiao Tong University Library", "paper_id": "WOS:000268705700009"}