{"auto_keywords": [{"score": 0.04464053001280883, "phrase": "supply_chain"}, {"score": 0.008227471502311075, "phrase": "platform_framework"}, {"score": 0.0057707583807024955, "phrase": "net_node"}, {"score": 0.00481495049065317, "phrase": "agent-based_supply"}, {"score": 0.004791878972726824, "phrase": "chain-oriented_virtual_enterprise_platform"}, {"score": 0.004746065479362881, "phrase": "purpose_-_the"}, {"score": 0.004437349839203418, "phrase": "virtual_enterprise"}, {"score": 0.004208881856146758, "phrase": "multi-agent_technology"}, {"score": 0.004069631519385246, "phrase": "system_hierarchy_theory"}, {"score": 0.003154012038613403, "phrase": "cunning_platform_framework"}, {"score": 0.003123808471618783, "phrase": "two-layer_architecture_mode"}, {"score": 0.0030642636185693054, "phrase": "information_alternation_layer"}, {"score": 0.003034916887102753, "phrase": "basic_function_layer"}, {"score": 0.0026268961477241026, "phrase": "theory_base"}, {"score": 0.0023743009016047424, "phrase": "reasonable_basic_function_design"}, {"score": 0.0023178219772486868, "phrase": "main_limitations"}, {"score": 0.0021049977753042253, "phrase": "new_approach"}], "paper_keywords": ["Cybernetics", " Supply chain management", " Virtual organizations", " Systems and control theory"], "paper_abstract": "Purpose - The purpose of this paper is to create a platform framework based on agent for virtual enterprise (VE) with the characteristic of supply chain by adopting multi-agent technology. Design/methodology/approach - According to the system hierarchy theory and the features of VE with the characteristic of supply chain, the conception and organization structure of supply chain-oriented VE are proposed. Combined with characters of multi-agent, a platform framework based on agent for VE with the characteristic of supply chain is created. Aiming at complexity of net node of cunning platform framework, two-layer architecture mode, which are information alternation layer and basic function layer inside net node based on agent, are designed. The modes are proved to be reasonable in the management of the system and networks resources. Findings - The theory base of realization of the YE based on agent with the characteristic of supply chain is found. Research limitations/implications - The reasonable basic function design of various agents are main limitations. Practical implications - The paper presents a very useful tool for the operation and management of YE. Originality/value - A new approach and scheme for YE with the characteristic of supply chain is presented. This paper is aimed at researchers and engineers.", "paper_title": "Design of agent-based supply chain-oriented virtual enterprise platform", "paper_id": "WOS:000294884200014"}