{"auto_keywords": [{"score": 0.04226255901245674, "phrase": "surrogate_competition"}, {"score": 0.011992443847212585, "phrase": "game-based_learning"}, {"score": 0.00481495049065317, "phrase": "enhancing_game-based_learning"}, {"score": 0.004459334186889869, "phrase": "negative_influences"}, {"score": 0.004278807087784626, "phrase": "competition_models"}, {"score": 0.003939296259436904, "phrase": "direct_competition"}, {"score": 0.0034388111429203222, "phrase": "possible_benefits"}, {"score": 0.003378385493203297, "phrase": "surrogate_approach"}, {"score": 0.0032800186243040663, "phrase": "my-pet-my-arena_system"}, {"score": 0.0025286975935774245, "phrase": "competitive_failures"}], "paper_keywords": ["Competition", " game-based learning", " surrogate", " learning achievement", " motivation", " attribution"], "paper_abstract": "Competition is useful in game-based learning, although it can also generate negative influences. To expand the potential for competition models in game-based learning, this study proposes the notion of surrogate competition, which eliminates direct competition between students. Such surrogates could be employed as buffers so that the competition between students is more relaxed. To explore the possible benefits of a surrogate approach to competition, the My-Pet-My-Arena system has been developed and evaluated. Two empirical studies were conducted to examine the effects of the surrogate competition. The results revealed that surrogate competition enhanced students' learning achievement as well as increased their motivation. Furthermore, the surrogate competition might also assist students in attributing competitive failures to a lack of effort. Working from the results obtained in these two studies, a general model of surrogate competition is proposed to help designers implement forms of surrogate competition in other systems for game-based learning.", "paper_title": "A Surrogate Competition Approach to Enhancing Game-Based Learning", "paper_id": "WOS:000330746900004"}