{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "backward-simulation_particle"}, {"score": 0.004718897469501381, "phrase": "hybrid_state"}, {"score": 0.004118587636081584, "phrase": "traffic_monitoring"}, {"score": 0.003975781274672803, "phrase": "separate_sub-systems"}, {"score": 0.003594369823549604, "phrase": "trajectory_estimation"}, {"score": 0.0035048567587934254, "phrase": "temporal_consistency"}, {"score": 0.0033156708990372047, "phrase": "vehicle_class"}, {"score": 0.0031684791285366315, "phrase": "trajectory_estimate_accuracy"}, {"score": 0.002437012847684331, "phrase": "class_estimate"}, {"score": 0.0023642842046859274, "phrase": "class_prediction"}, {"score": 0.0023287359930308864, "phrase": "markov_chain"}, {"score": 0.002282166507956957, "phrase": "experimental_tests"}, {"score": 0.0021049977753042253, "phrase": "classification_accuracy"}], "paper_keywords": ["3D trajectory reconstruction", " Vehicle classification", " Particle filtering", " Hybrid state representation"], "paper_abstract": "The estimation of the 3D trajectory, the class and the dimensions of a vehicle represents three relevant tasks for traffic monitoring. They are usually performed by separate sub-systems and only few existing algorithms cope with the three tasks at the same time. However, if these tasks are integrated, the trajectory estimation enforces the classification with temporal consistency, and at the same time, the estimation of the vehicle class and dimensions can be used to increase the trajectory estimate accuracy. In this work, we propose an algorithm to estimate the 3D trajectory, the class and the dimensions of vehicles simultaneously by means of a Backward-Simulation Particle Smoother whose state contains both continuous (vehicle pose and dimensions), and discrete (vehicle class) quantities. To integrate the class estimate in the Particle Smoother we model the class prediction as a Markov Chain. We performed experimental tests on both simulated and real datasets; they show that the pose and dimension estimation reaches centimeter-accuracy and the classification accuracy is higher than 95 %.", "paper_title": "Backward-Simulation Particle Smoother with a hybrid state for 3D vehicle trajectory, class and dimension simultaneous estimation", "paper_id": "WOS:000351462900015"}