{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "filter_model"}, {"score": 0.01864163178123279, "phrase": "boolean_functions"}, {"score": 0.007851007450938967, "phrase": "desired_form"}, {"score": 0.00769694115263102, "phrase": "pseudo-random_generator"}, {"score": 0.007525165343670645, "phrase": "stream_ciphers"}, {"score": 0.004537170890206354, "phrase": "infinite_classes"}, {"score": 0.004348580182733617, "phrase": "possible_way"}, {"score": 0.004132546937996706, "phrase": "boolean_function"}, {"score": 0.0039050245929822354, "phrase": "combiner_model"}, {"score": 0.003806752687389645, "phrase": "weakened_form"}, {"score": 0.003689982350051231, "phrase": "nonlinear_functions"}, {"score": 0.003597102547969587, "phrase": "particular_form"}, {"score": 0.00353648053045938, "phrase": "distinguishing_attacks"}, {"score": 0.0034768766116014672, "phrase": "tapping_sequence"}, {"score": 0.003332210257373994, "phrase": "main_known_attacks"}, {"score": 0.003266767911612594, "phrase": "ronjom-helleseth"}, {"score": 0.0030606302942851027, "phrase": "found_functions"}, {"score": 0.00290016162105678, "phrase": "extra_variable"}, {"score": 0.0028191026474004093, "phrase": "algebraic_immunity"}, {"score": 0.002795228413298423, "phrase": "resulting_function"}, {"score": 0.0027248086877091756, "phrase": "original_function"}, {"score": 0.0025383451160985488, "phrase": "algebraic_attacks"}, {"score": 0.002495521662819317, "phrase": "best_known_constructions"}, {"score": 0.0024395426929046415, "phrase": "desired_form_result"}, {"score": 0.0023848164282879885, "phrase": "best_possible_algebraic_degree"}, {"score": 0.0022215673111923915, "phrase": "cryptographic_characteristics"}, {"score": 0.0021049977753042253, "phrase": "optimal_or_almost-optimal_tradeoff"}], "paper_keywords": ["Boolean functions", " Balancedness", " Algebraic immunity", " Fast algebraic attack", " Algebraic degree", " Nonlinearity"], "paper_abstract": "The filter model of pseudo-random generator (in stream ciphers) is currently the only one for which are known infinite classes of Boolean functions allowing to resist all the main known attacks. The combiner model, which is another possible way of using Boolean functions, requires the same properties as the filter model does, plus one extra criterion the Boolean function must fulfil: high order resiliency. No construction of functions is known which ensures all criteria for the combiner model, even if resiliency is taken in a weakened form, while such constructions are known for the filter model. But nonlinear functions used in this model must be in the particular form to allow resistance to the distinguishing attacks for any choice of the tapping sequence. Much work has been done to construct and study Boolean functions allowing resistance to the main known attacks (the Berlekamp-Massey and Ronjom-Helleseth attacks, fast correlation attacks, algebraic attacks and fast algebraic attacks) on stream ciphers using the filter model. None of the found functions has the desired form above. Of course, we can take a function in variables and add the extra variable in order to obtain the desired form, but the algebraic immunity of the resulting function can be either equal to that of the original function (and it cannot then be optimal if is odd) or larger by 1. An increasement by 1 considerably impacts the complexity of algebraic attacks. Moreover, taking the best known constructions of functions and adapting them to the desired form result on functions which no longer ensure the best possible algebraic degree. This represents a gap in the research for Boolean functions usable in the filter model. In this paper we study the behavior of the cryptographic characteristics of a function when it is modified into the desired form and we study constructions of functions ensuring an optimal or almost-optimal tradeoff between all the necessary features in this form.", "paper_title": "Enhanced Boolean functions suitable for the filter model of pseudo-random generator", "paper_id": "WOS:000358798400011"}