{"auto_keywords": [{"score": 0.03734631623252398, "phrase": "linux"}, {"score": 0.004568112463762863, "phrase": "vmm"}, {"score": 0.00433386573276633, "phrase": "small_mu-kernel"}, {"score": 0.004133292222875435, "phrase": "user-level_vmm_component"}, {"score": 0.003839510177926892, "phrase": "native_applications"}, {"score": 0.0036043137580229873, "phrase": "standard_operating_systems"}, {"score": 0.003312901888725435, "phrase": "kernel_functionality"}, {"score": 0.0031098631445657158, "phrase": "operating_system_noise"}, {"score": 0.00291923164591297, "phrase": "ethernet-based_communication"}, {"score": 0.0026830601040919166, "phrase": "substantial_performance_hit"}, {"score": 0.0025994945418484935, "phrase": "native_application_environments"}, {"score": 0.0025586903829811296, "phrase": "key_requirement"}, {"score": 0.0023640560785711923, "phrase": "interesting_operating_system_alternative"}, {"score": 0.0022544399432457164, "phrase": "fully_featured_commodity_software_stack"}, {"score": 0.0021385822825864425, "phrase": "low_latency"}, {"score": 0.0021049977753042253, "phrase": "hpc_operating_system"}], "paper_keywords": ["Operating systems", " virtualization", " micro-kernels", " lightweight kernels", " supercomputing", " high-performance computing"], "paper_abstract": "In this paper, we present a lightweight, micro-kernel-based virtual machine monitor (VMM) for the Blue Gene/P supercomputer. Our VMM comprises a small mu-kernel with virtualization capabilities and, atop, a user-level VMM component that manages virtual Blue Gene/P cores, memory, and interconnects; we also support running native applications directly atop the mu-kernel. Our design goal is to enable compatibility to standard operating systems such as Linux on BG/P via virtualization, but to also keep the amount of kernel functionality small enough to facilitate shortening the path to applications and lowering operating system noise. Our prototype implementation successfully virtualizes a Blue Gene/P version of Linux with support for Ethernet-based communication mapped onto Blue Gene/P's collective and torus network devices. Our first experiences and experiments show that our VMM still shows a substantial performance hit, and that support for native application environments is a key requirement towards fully exploiting the capabilities of a supercomputer. Altogether, our approach poses an interesting operating system alternative for supercomputers, providing the convenience of a fully featured commodity software stack, while also promising to deliver the scalability and low latency of an HPC operating system.", "paper_title": "A lightweight virtual machine monitor for Blue Gene/P", "paper_id": "WOS:000304698700002"}