{"auto_keywords": [{"score": 0.03090402495594091, "phrase": "ahp"}, {"score": 0.004781915513030716, "phrase": "party's_grievances"}, {"score": 0.004598933498016774, "phrase": "perceived_value"}, {"score": 0.004128518921056135, "phrase": "higher_priority"}, {"score": 0.004062682236016889, "phrase": "meaningful_resolution"}, {"score": 0.003988719758707836, "phrase": "formal_way"}, {"score": 0.0037921662574137535, "phrase": "short_end"}, {"score": 0.0033037970113095577, "phrase": "verbal_descriptions"}, {"score": 0.003097865379563127, "phrase": "different_values"}, {"score": 0.002786964045867666, "phrase": "positive_approach"}, {"score": 0.002704881797334006, "phrase": "numerical_intensities"}, {"score": 0.0025892330566358503, "phrase": "south_africa"}, {"score": 0.00257735013358606, "phrase": "northern_ireland"}, {"score": 0.0024956789310376635, "phrase": "israeli_participants"}, {"score": 0.0024842242921857705, "phrase": "palestinian_participants"}, {"score": 0.002411036840516453, "phrase": "first_time"}, {"score": 0.0023944552329463035, "phrase": "palestinian-israeli_conflict"}, {"score": 0.0023400004981080818, "phrase": "different_degrees"}, {"score": 0.0022920484507540197, "phrase": "acceptable_agreements"}, {"score": 0.0022041312401435346, "phrase": "moderate_and_extreme_viewpoints"}, {"score": 0.0021049977753042253, "phrase": "negotiation_process"}], "paper_keywords": ["Conflict resolution", " Middle East Israeli-Palestinian conflict", " pairwise comparisons", " Analytic Hierarchy Process", " benefits-opportunities-costs-risks analysis", " gain-loss ratios", " concession trade-off"], "paper_abstract": "In most long-lasting conflicts, each party's grievances increase while the concessions they are willing to make decline in number, quality, and perceived value. Both parties lose sight of what they are willing to settle for, generally exaggerate their own needs, and minimize the needs of the other side over time. But, it is precisely the matter of trading that needs to be made more concrete and of higher priority for both sides, if a meaningful resolution is to be found. Without a formal way of trading off the concessions and packages of concessions, both sides are likely to suspect that they are getting the short end of the bargain. After the parties have agreed to a trade, very specific binding language about the terms of the agreement, clear implementation policies, and outside guarantors are needed. The worth of the concessions traded, as perceived by both the giver and receiver, need to be accurately determined and recorded. All of this requires going beyond verbal descriptions of the concessions to more broadly include their economic, social, geographic, humanitarian, and historical worth. It is critical that all of these need to be translated into priorities derived in terms of the different values and beliefs of the parties. Priorities are universal and include the diversity of measures in terms of which economic, social, and other values are measured. The Analytic Hierarchy Process (AHP) provides a way to perform such an assessment with the participation of negotiators for the parties. It is a positive approach that makes it possible to reason and express feelings and judgments with numerical intensities to derive priorities. It has been used productively in the past to deal with the conflicts in South Africa and Northern Ireland and with other controversies throughout the world. With the assistance of panels of Israeli participants and Palestinian participants brought together in 2009 and 2010, AHP was applied for the first time to the Palestinian-Israeli conflict. The process makes it clear that moderation in different degrees by both sides is essential to arrive at acceptable agreements on concessions proposed and agreed upon by both sides. AHP makes it possible to evaluate moderate and extreme viewpoints and determine their effect on the trading of concessions. The results obtained encourage us to advocate its use in the negotiation process.", "paper_title": "NEGOTIATING THE ISRAELI-PALESTINIAN CONTROVERSY FROM A NEW PERSPECTIVE", "paper_id": "WOS:000286224800002"}