{"auto_keywords": [{"score": 0.023007015607128055, "phrase": "ibm"}, {"score": 0.00481495049065317, "phrase": "massive_data_analytics"}, {"score": 0.004372002674739612, "phrase": "business_intelligence"}, {"score": 0.004191200981137508, "phrase": "commercial_workloads"}, {"score": 0.00399367108161192, "phrase": "limit_various_architectural_aspects"}, {"score": 0.0038516336597530614, "phrase": "memory_access_patterns"}, {"score": 0.003692271726952282, "phrase": "data_reuse"}, {"score": 0.003539479990299223, "phrase": "loaded_byte"}, {"score": 0.0033929894721242367, "phrase": "bit_manipulation"}, {"score": 0.003174903873774882, "phrase": "generated_network_traffic"}, {"score": 0.0031367803372203498, "phrase": "small_packets"}, {"score": 0.0030434561939032597, "phrase": "random_destinations"}, {"score": 0.0026646374739979694, "phrase": "ibm_blue_gene"}, {"score": 0.002419025278429845, "phrase": "data-intensive_applications"}, {"score": 0.0022909325048608054, "phrase": "algorithmic_techniques"}], "paper_keywords": [""], "paper_abstract": "Graph algorithms are becoming increasingly important for biology, transportation, business intelligence, and a wide range of commercial workloads. Most graph algorithms stress to the limit various architectural aspects of conventional machines. The memory access patterns are irregular, with little spatial locality and data reuse. The amount of computation per loaded byte is very small, typically involving bit manipulation; pointer-chasing is often the norm. Likewise, the generated network traffic comprises small packets that are sent to random destinations at a very high messaging rate. With our recent winning Graph 500 submissions in November 2010, June 2011, and November 2011, we have demonstrated the versatility of the IBM Blue Gene (R) family of supercomputers and the possibility of using them to parallelize demanding data-intensive applications. In this paper, we describe the algorithmic techniques that we used to map the Graph 500 breadth-first search (BFS) exploration on the IBM Blue Gene (R)/Q, achieving a performance of 254 billion traversed edges per second.", "paper_title": "Massive data analytics: The Graph 500 on IBM Blue Gene/Q", "paper_id": "WOS:000323321900011"}