{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_commerce"}, {"score": 0.04726196056959379, "phrase": "mobile_users"}, {"score": 0.00457138247462329, "phrase": "location_based_services"}, {"score": 0.003894963476923956, "phrase": "monetary_benefits"}, {"score": 0.0037299231609021783, "phrase": "quantitative_model"}, {"score": 0.003665874747419775, "phrase": "theoretic_metrics"}, {"score": 0.0035564156572789473, "phrase": "anonymity_level"}, {"score": 0.003480230347985338, "phrase": "individual_perceived_risks"}, {"score": 0.00319141242685261, "phrase": "mobile_commerce_company"}, {"score": 0.003109519872758431, "phrase": "mechanism_design_techniques"}, {"score": 0.0030693625816617044, "phrase": "privacy_game"}, {"score": 0.0028762004595878714, "phrase": "budgetary_constraints"}, {"score": 0.0026488343783448273, "phrase": "desired_level"}, {"score": 0.0026033013834547507, "phrase": "information_limitations"}, {"score": 0.0024183363693242943, "phrase": "user_utility_functions"}, {"score": 0.0023974563359295043, "phrase": "iterative_distributed_algorithm"}, {"score": 0.0023767561522363367, "phrase": "regression_learning_methods"}, {"score": 0.0021982976170703884, "phrase": "numerical_example"}, {"score": 0.0021511430180912164, "phrase": "real_gps_data"}], "paper_keywords": ["Game theory", " Mobile commerce", " Privacy", " Mechanism design", " Information theoretic metrics"], "paper_abstract": "In mobile commerce, companies provide location based services to mobile users, who report their locations with a certain level of granularity to maintain a degree of anonymity. This level of granularity depends on their perceived risk as well as the incentives they receive in the form of monetary benefits or improved mobile services. This paper formulates a quantitative model in which information theoretic metrics such as entropy, quantify the anonymity level of mobile users. The individual perceived risks of users and the benefits they obtain are defined as functions of their chosen location information granularity. The interaction between the mobile commerce company and its users is investigated using mechanism design techniques as a privacy game. The user best responses and optimal strategies for the company are derived under budgetary constraints on incentives, which are provided to users in order to convince them to share their private information at the desired level of granularity. Information limitations in the system are analyzed to capture more realistic scenarios where the companies do not have access to user utility functions. Iterative distributed algorithm and regression learning methods are investigated to design mechanisms that overcome these limitations. The results obtained are demonstrated with a numerical example and simulations based on real GPS data. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Trading privacy with incentives in mobile commerce: A game theoretic approach", "paper_id": "WOS:000320547300012"}