{"auto_keywords": [{"score": 0.03593848500567063, "phrase": "grounded_theory"}, {"score": 0.0046256566852302256, "phrase": "accurate_project_status"}, {"score": 0.004461634909525319, "phrase": "information_technology"}, {"score": 0.003923965929636472, "phrase": "inaccurate_status_reporting"}, {"score": 0.003635790924434452, "phrase": "project_status_reporting"}, {"score": 0.0033150213498435617, "phrase": "nine_it_projects"}, {"score": 0.0031337465656628132, "phrase": "state's_it_oversight_board"}, {"score": 0.0029982770062678926, "phrase": "technical_personnel"}, {"score": 0.0028342734482926677, "phrase": "project_status"}, {"score": 0.0027667539384678814, "phrase": "reporting_process"}, {"score": 0.0026900059414552823, "phrase": "self-reinforcing_cycle"}, {"score": 0.002636489396049042, "phrase": "project_team"}, {"score": 0.002472269923319476, "phrase": "project_teams"}, {"score": 0.002442634456448208, "phrase": "auditor's_scrutiny"}, {"score": 0.002253920389285441, "phrase": "defensive_reporting_tactics"}, {"score": 0.0022001958412800745, "phrase": "project_team's_actions"}], "paper_keywords": ["Project Management", " Reporting", " Auditing", " Information Systems Development"], "paper_abstract": "Accurate project status reporting is important to avoid the problem of information technology (IT) project escalation and to successfully manage and deliver IT projects. One approach that some organizations have taken is to audit their IT projects to avoid surprises that are frequently associated with inaccurate status reporting. Little is known, however, about the effects that such auditing arrangements can have on the dynamics of project status reporting. To examine the process of IT project status reporting in this context, we followed a grounded theory inspired approach in which we investigated nine IT projects in one U.S. state's government agencies. All of the projects we studied were subject to the state's IT oversight board. Based on 118 interviews with a variety of stakeholders including technical personnel, managers, users, and contractors, we present a grounded theory of project status reporting dynamics in which the reporting process can best be characterized as a self-reinforcing cycle of distrust between the project team and the auditors. Specifically, in some projects, we observed a pattern whereby project teams interpreted the auditor's scrutiny as unfair and as not adding value to their projects. As a result, they responded by embracing some defensive reporting tactics. The auditors interpreted the project team's actions as indicating either deception or incompetence, and they then increased their scrutiny of the reports, thus exacerbating the situation and further fuelling the cycle of distrust. We discuss implications for both theory and practice.", "paper_title": "The Dynamics of IT Project Status Reporting: A Self-Reinforcing Cycle of Distrust", "paper_id": "WOS:000349678600003"}