{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "animal_sound_recordings"}, {"score": 0.04939422255606209, "phrase": "context_variables"}, {"score": 0.003696550794743764, "phrase": "specific_peculiarities"}, {"score": 0.0031845067058084613, "phrase": "isolated_individuals"}, {"score": 0.0029343925814926787, "phrase": "recording_metadata"}, {"score": 0.0027965187255008647, "phrase": "sound_recordings"}, {"score": 0.002716915166374506, "phrase": "environmental_or_social_contexts"}, {"score": 0.0026268961477241026, "phrase": "current_systems"}, {"score": 0.002527654365712841, "phrase": "context_analysis"}, {"score": 0.0025034338848015166, "phrase": "query_parameters"}, {"score": 0.0024088451312725924, "phrase": "public_services"}, {"score": 0.0023515464194592195, "phrase": "sound_recording_metadata"}, {"score": 0.0022302306304023602, "phrase": "web_prototype"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["sound retrieval", " context analysis"], "paper_abstract": "For decades, biologists around the world have recorded animal sounds. As the number of records grows, so does the difficulty to manage them, presenting challenges to save, retrieve, share, and manage sounds. These challenges are complicated by the fact that animal sound recordings have specific peculiarities, associated to the context in which the sound was recorded. For example, sounds emitted by individuals that are in groups may be different from ones emitted by isolated individuals. Although these characteristics may be relevant to biologists, they are seldom explicit in the recording metadata. This paper discusses our ongoing research on the management of sound recordings, considering factors such as environmental or social contexts, which are not treated by current systems. This work exploits retrieval based on context analysis. Query parameters include context variables that are dynamically derived using public services and ontologies associated with sound recording metadata. Part of the results have been validated through a web prototype, discussed in the text. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "An architecture for retrieval of animal sound recordings based on context variables", "paper_id": "WOS:000326023300007"}