{"auto_keywords": [{"score": 0.011793549578492763, "phrase": "pharmacophore_models"}, {"score": 0.00481495049065317, "phrase": "pharmacophore_model_refinement"}, {"score": 0.004664352260912174, "phrase": "intracellular_glucocorticoid_concentrations"}, {"score": 0.00446490613141384, "phrase": "intracellular_concentrations"}, {"score": 0.004342430078306461, "phrase": "inactive_cortisone"}, {"score": 0.004290969772225093, "phrase": "active_cortisol"}, {"score": 0.003978866233891427, "phrase": "metabolic_syndrome"}, {"score": 0.0036893794227117194, "phrase": "drug_discovery_and_toxicological_studies"}, {"score": 0.0034482025128821548, "phrase": "common_chemical_features"}, {"score": 0.0033402088717816416, "phrase": "virtual_screening_filter"}, {"score": 0.0033005860945173136, "phrase": "new_inhibitors"}, {"score": 0.003036040409062437, "phrase": "good_predictive_power"}, {"score": 0.0029292375702719468, "phrase": "systematic_evaluation"}, {"score": 0.002814956065949522, "phrase": "virtual_screening"}, {"score": 0.002558495760339272, "phrase": "residual_enzyme_activity"}, {"score": 0.0023346234464901978, "phrase": "evaluation_metrics"}, {"score": 0.0022886031992739126, "phrase": "quantitative_comparison"}, {"score": 0.0022614266476954467, "phrase": "old_and_newly_generated_models"}, {"score": 0.0021992603252793995, "phrase": "improved_pharmacophore_models"}, {"score": 0.0021645053655350703, "phrase": "silico_tools"}], "paper_keywords": ["11 beta-Hydroxysteroid dehydrogenase", " Enzyme inhibitor", " Model refinement", " Pharmacophore model", " Virtual screening"], "paper_abstract": "11 beta-Hydroxysteroid dehydrogenases (11 beta-HSD) control the intracellular concentrations of glucocorticoids: 11 beta-HSD1 converts the inactive cortisone to the active cortisol, and 11 beta-HSD2 is responsible for the opposite reaction. Inhibition of 11 beta-HSD1 is beneficial in the treatment of metabolic syndrome, whereas 11 beta-HSD2 inhibition leads to hypertension. Therefore, 11 beta-HSD1 inhibitors should be selective over 11 beta-HSD2. To support drug discovery and toxicological studies, we have previously reported pharmacophore models for 11 beta-HSD1 and 2 inhibition. These models represent the common chemical features of 11 beta-HSD inhibitors, which were used as virtual screening filter. Since new inhibitors are constantly discovered, the quality of the pharmacophore models has to be evaluated in order to main-tain a good predictive power. In this study, we report a systematic evaluation and refinement of our pharmacophore model collection. We employed our models for virtual screening, especially focusing on the 11 beta-HSD2 inhibition. In total, 42 compounds were biologically evaluated and among these we discovered 17 11 beta-HSD inhibitors that decreased the residual enzyme activity to 50% or less at the concentration of 20 mM. The experimental 11 beta-HSD1 and 2 readouts from these compounds were used for further model refinement. Evaluation metrics were applied for a quantitative comparison of the old and newly generated models which resulted in a set of improved pharmacophore models offering reliable in silico tools for the identification of novel and selective 11 beta-HSD inhibitors.", "paper_title": "Pharmacophore Model Refinement for 11 beta-Hydroxysteroid Dehydrogenase Inhibitors: Search for Modulators of Intracellular Glucocorticoid Concentrations", "paper_id": "WOS:000346768100003"}