{"auto_keywords": [{"score": 0.03757432921561726, "phrase": "antecedent_interval"}, {"score": 0.004486800020569973, "phrase": "single_input_variable"}, {"score": 0.004431246962597134, "phrase": "presented_simple_structure"}, {"score": 0.0042157995925335544, "phrase": "closed_form_formulation"}, {"score": 0.004163587877500036, "phrase": "first_time"}, {"score": 0.003895810929926511, "phrase": "karnik-mendel_type_reduction"}, {"score": 0.003847546889061499, "phrase": "closed_form_solution"}, {"score": 0.003737234606207431, "phrase": "tuning_parameters"}, {"score": 0.003615016816532732, "phrase": "lower_membership_functions"}, {"score": 0.003439117493141663, "phrase": "closed_form_output"}, {"score": 0.0033964919992320024, "phrase": "simple_strategy"}, {"score": 0.0031647054743284947, "phrase": "pid_controller"}, {"score": 0.0030995835539697893, "phrase": "easy_design"}, {"score": 0.003010651173285521, "phrase": "extra_degrees"}, {"score": 0.002816814445002924, "phrase": "control_performance"}, {"score": 0.0027703320456201074, "phrase": "nonlinear_benchmark_systems"}, {"score": 0.0026354246446771324, "phrase": "experimental_ph_neutralization"}, {"score": 0.002602734354498382, "phrase": "simulation_and_experimental_results"}, {"score": 0.002528021281333922, "phrase": "superior_control_performance"}, {"score": 0.002486292595645607, "phrase": "nonlinear_dynamics"}, {"score": 0.00235536166148219, "phrase": "standard_pid_controllers"}, {"score": 0.0021049977753042253, "phrase": "control_theory"}], "paper_keywords": ["Interval type-2 fuzzy PID controller design", " Single input fuzzy inference Nonlinear control", " Process independent control curve design"], "paper_abstract": "In this study, a design method for single Input interval type-2 fuzzy PID controller has been developed. The most important feature of the proposed type-2 fuzzy controller is its simple structure consisting of a single input variable. The presented simple structure gives an opportunity to the designer to form the type-2 fuzzy controller output in closed form formulation for the first time in literature. This formulation cannot be achieved with present type-2 fuzzy PID controller structures which have employed the Karnik-Mendel type reduction. The closed form solution is derived in terms of the tuning parameters which are chosen as the heights of lower membership functions of the antecedent interval type-2 fuzzy sets. Elaborations are done on the derived closed form output and a simple strategy is presented for a single input type-2 fuzzy PID controller design. The presented interval type-2 fuzzy controller structure still keeps the most preferred features of the PID controller such as simplicity and easy design. We will illustrate how the extra degrees of freedom provided by the antecedent interval type-2 fuzzy sets can be used to enhance the control performance on linear and nonlinear benchmark systems by simulations. Moreover, the type-2 fuzzy controller structure has been implemented on experimental pH neutralization. The simulation and experimental results will illustrate that the proposed type-2 fuzzy controller produces superior control performance and can handle nonlinear dynamics, parameter uncertainties, noise and disturbances better in comparison with the standard PID controllers. Hence, the results and analyses of this study will give the control engineers an opportunity to draw a bridge and connect the type-2 fuzzy logic and control theory.", "paper_title": "A simple design method for interval type-2 fuzzy pid controllers", "paper_id": "WOS:000337282700005"}