{"auto_keywords": [{"score": 0.04963668061042319, "phrase": "multiple_groups"}, {"score": 0.008554101011033332, "phrase": "monotone_condition"}, {"score": 0.00663160568272817, "phrase": "secret_handshake_scheme"}, {"score": 0.0059335441401858835, "phrase": "member's_affiliations"}, {"score": 0.00481495049065317, "phrase": "secret_handshake_protocols"}, {"score": 0.004682708592184678, "phrase": "secret_handshake_protocol"}, {"score": 0.003729653048324378, "phrase": "yamashita"}, {"score": 0.0036951659461797234, "phrase": "tanaka"}, {"score": 0.0034947408949397127, "phrase": "single_group"}, {"score": 0.002874870266177579, "phrase": "new_concept"}, {"score": 0.0024772998651215964, "phrase": "handshake_protocol"}, {"score": 0.002195033004022173, "phrase": "communication_costs"}, {"score": 0.0021746987512551693, "phrase": "computational_costs"}, {"score": 0.0021049977753042253, "phrase": "trivial_construction"}], "paper_keywords": ["secret handshake with multiple groups", " privacy preserving authentication", " anonymity", " monotone condition"], "paper_abstract": "Secret Handshake protocol allows members of the same group to authenticate each other secretly. That is, two members who belong to the same group can learn counterpart is in the same group, while non-member of the group cannot determine whether the counterpart is a member of the group or not. Yamashita and Tanaka proposed Secret Handshake Scheme with Multiple Groups (SHSMG). They extended a single group setting to a multiple groups setting where two members output \"accept\" iff both member's affiliations of the multiple groups are identical. In this paper, we first show the flaw of their SHSMG, and we construct a new secure SHSMG. Second, we introduce a new concept of Secret Handshake scheme, \"monotone condition Secret Handshake with Multiple Groups (mc-SHSMG),\" in order to extend the condition of \"accept.\" In our new setting of handshake protocol, members can authenticate each other in monotone condition (not only both member's affiliations are identical but also the affiliations are not identical). The communication costs and computational costs of our proposed mc-SHSMG are fewer than the trivial construction of mc-SHSMG.", "paper_title": "Extension of Secret Handshake Protocols with Multiple Groups in Monotone Condition", "paper_id": "WOS:000279250100015"}