{"auto_keywords": [{"score": 0.04810529694345783, "phrase": "workflow_systems"}, {"score": 0.00481495049065317, "phrase": "dw-rbac"}, {"score": 0.004147523799581407, "phrase": "workflow_system"}, {"score": 0.004084510791138056, "phrase": "role-based_access_control"}, {"score": 0.003976523732243618, "phrase": "current_rbac_model"}, {"score": 0.003931118518507637, "phrase": "security_mechanism"}, {"score": 0.0038862297330905836, "phrase": "access_control"}, {"score": 0.003246091321090681, "phrase": "easy_way"}, {"score": 0.0029951555610569225, "phrase": "comprehensive_way"}, {"score": 0.0028715299874549245, "phrase": "rbac_model"}, {"score": 0.00283870598459543, "phrase": "simple_and_straightforward_manner"}, {"score": 0.002806256131739047, "phrase": "new_extended_model"}, {"score": 0.0027741799039550756, "phrase": "rbac"}, {"score": 0.0027215202678634517, "phrase": "workflow_context"}, {"score": 0.0021705796895687864, "phrase": "important_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["workflow", " access control", " delegation", " role-based access control", " security"], "paper_abstract": "One reason workflow systems have been criticized as being inflexible is that they lack support for delegation. This paper shows how delegation can be introduced in a workflow system by extending the role-based access control (RBAC) model. The current RBAC model is a security mechanism to implement access control in organizations by allowing users to be assigned to roles and privileges to be associated with the roles. Thus, users can perform tasks based on the privileges possessed by their own role or roles they inherit by virtue of their organizational position. However, there is no easy way to handle delegations within this model. This paper tries to treat the issues surrounding delegation in workflow systems in a comprehensive way. We show how delegations can be incorporated into the RBAC model in a simple and straightforward manner. The new extended model is called RBAC with delegation in a workflow context (DW-RBAC). It allows for delegations to be specified from a user to another user, and later revoked when the delegation is no longer required. The implications of such specifications and their subsequent revocations are examined. Several formal definitions for assertion, acceptance, execution and revocation are provided, and proofs are given for the important properties of our delegation framework. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "DW-RBAC: A formal security model of delegation and revocation in workflow systems", "paper_id": "WOS:000244019200001"}