{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "company_innovation"}, {"score": 0.004533142516832776, "phrase": "new_technologies"}, {"score": 0.004451846834142146, "phrase": "vitally_important_and_fundamental_goal"}, {"score": 0.004191200981137508, "phrase": "medical_device_industry"}, {"score": 0.004042166795461166, "phrase": "ten_medical_device_companies"}, {"score": 0.0033929894721242367, "phrase": "international_sales_performance"}, {"score": 0.0029887957779347394, "phrase": "empirical_results"}, {"score": 0.0028823939507764238, "phrase": "technological_acquisitions"}, {"score": 0.0027133856739937133, "phrase": "acquiring_firms"}, {"score": 0.002419025278429845, "phrase": "similar_proximity"}, {"score": 0.0022633993976138387, "phrase": "clear_need"}], "paper_keywords": ["US medical device industry", " M&A", " Patent stock", " Patent diversity"], "paper_abstract": "The acquisition of new technologies represents a vitally important and fundamental goal of many corporate managers, particularly those within the medical device industry. We collect data on ten medical device companies as our sample in this study, covering the period from 1990 to 2006; this sample is drawn from the top 20 companies in the US, on the basis of international sales performance. We also collect details on all of the acquisitions undertaken by these companies, along with their patenting performance. The empirical results of this study suggest that technological acquisitions are only likely to be of help to the acquiring firms, in terms of improving their innovative performance, if they set out to acquire those companies that are in similar proximity, in terms of their technological field. There is also a clear need for such acquiring firms to ensure their continuing commitment to internal R&D investment in order to maintain their own versatility.", "paper_title": "The impact of M&As on company innovation: evidence from the US medical device industry", "paper_id": "WOS:000278267100011"}