{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medication_names"}, {"score": 0.042274501183610945, "phrase": "medication-related_information"}, {"score": 0.004775531918452571, "phrase": "related_information"}, {"score": 0.004736434518535051, "phrase": "clinical_narratives"}, {"score": 0.004697655699119423, "phrase": "background_pharmacotherapy"}, {"score": 0.004640079189342692, "phrase": "integral_part"}, {"score": 0.004583205112737672, "phrase": "medical_care_process"}, {"score": 0.0045084510240032535, "phrase": "important_role"}, {"score": 0.00445318311339027, "phrase": "medical_history"}, {"score": 0.004186799638538032, "phrase": "medical_decision"}, {"score": 0.004152502093643003, "phrase": "biomedical_research"}, {"score": 0.004067977399245212, "phrase": "narrative_text"}, {"score": 0.003793206550770237, "phrase": "text_mining"}, {"score": 0.0034083145672246067, "phrase": "narrative_clinical_documents"}, {"score": 0.0031132086055691214, "phrase": "results_results"}, {"score": 0.002728847267539957, "phrase": "highest_f-measure"}, {"score": 0.0026403934420630155, "phrase": "good_results"}, {"score": 0.0021049977753042253, "phrase": "training_and_test_sets"}], "paper_keywords": [""], "paper_abstract": "Background Pharmacotherapy is an integral part of any medical care process and plays an important role in the medical history of most patients. Information on medication is crucial for several tasks such as pharmacovigilance, medical decision or biomedical research. Objectives Within a narrative text, medication-related information can be buried within other non-relevant data. Specific methods, such as those provided by text mining, must be designed for accessing them, and this is the objective of this study. Methods The authors designed a system for analyzing narrative clinical documents to extract from them medication occurrences and medication-related information. The system also attempts to deduce medications not covered by the dictionaries used. Results Results provided by the system were evaluated within the framework of the 1282 NLP challenge held in 2009. The system achieved an F-measure of 0.78 and ranked 7th out of 20 participating teams (the highest F-measure was 0.86). The system provided good results for the annotation and extraction of medication names, their frequency, dosage and mode of administration (F-measure over 0.81), while information on duration and reasons is poorly annotated and extracted (F-measure 0.36 and 0.29, respectively). The performance of the system was stable between the training and test sets.", "paper_title": "Linguistic approach for identification of medication names and related information in clinical narratives", "paper_id": "WOS:000281972200013"}