{"auto_keywords": [{"score": 0.027755210285726976, "phrase": "ssg"}, {"score": 0.00481495049065317, "phrase": "multichannel_downlink_wireless_networks"}, {"score": 0.004641770842098217, "phrase": "scheduling_algorithms"}, {"score": 0.004529957363391184, "phrase": "ofdm"}, {"score": 0.00434906528856802, "phrase": "large_number"}, {"score": 0.004278807087784626, "phrase": "proportionally_large_bandwidth"}, {"score": 0.004141663280057689, "phrase": "classical_maxweight_algorithm"}, {"score": 0.0037866774001097596, "phrase": "zero_rate_function"}, {"score": 0.0035189057079817285, "phrase": "longest_queues_first"}, {"score": 0.0032302647179383915, "phrase": "general_class"}, {"score": 0.002881793492919646, "phrase": "higher_complexity"}, {"score": 0.002634506575564286, "phrase": "server-side_greedy"}, {"score": 0.002274684393868218, "phrase": "computational_complexity"}, {"score": 0.0021837406983565098, "phrase": "maxweight_algorithm"}, {"score": 0.0021222476760114914, "phrase": "nice_tradeoff"}, {"score": 0.0021049977753042253, "phrase": "buffer-overflow_performance"}], "paper_keywords": ["Large deviations", " low complexity", " scheduling algorithms", " small buffer"], "paper_abstract": "This paper considers the problem of designing scheduling algorithms for multichannel (e.g., OFDM-based) wireless downlink networks, with a large number of users and proportionally large bandwidth. For this system, while the classical MaxWeight algorithm is known to be throughput-optimal, its buffer-overflow performance is very poor (formally, it is shown that it has zero rate function in our setting). To address this, a class of algorithms called iterated Heaviest matching with Longest Queues First (iHLQF) is proposed. The algorithms in this class are shown to be throughput-optimal for a general class of arrival/channel processes, and also rate-function-optimal (i.e., exponentially small buffer overflow probability) for certain arrival/channel processes. iHLQF, however, has higher complexity than MaxWeight (n(4) versus n(2), respectively). To overcome this issue, a new algorithm called Server-Side Greedy (SSG) is proposed. It is shown that SSG is throughput-optimal, results in a much better per-user buffer overflow performance than the MaxWeight algorithm (positive rate function for certain arrival/channel processes), and has a computational complexity (n(2)) that is comparable to the MaxWeight algorithm. Thus, it provides a nice tradeoff between buffer-overflow performance and computational complexity. These results are validated by both analysis and simulations.", "paper_title": "Low-Complexity Scheduling Algorithms for Multichannel Downlink Wireless Networks", "paper_id": "WOS:000310141400022"}