{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "path_planning"}, {"score": 0.004771196027464407, "phrase": "fast_marching_square"}, {"score": 0.004642292792558686, "phrase": "path_planning_algorithm"}, {"score": 0.004276016541197123, "phrase": "robot_formations"}, {"score": 0.004085115444878828, "phrase": "leader-followers_scheme"}, {"score": 0.0039027036493682887, "phrase": "follower_robots"}, {"score": 0.003832031470970347, "phrase": "geometric_equations"}, {"score": 0.0035945701438887282, "phrase": "leader's_pose"}, {"score": 0.0035133644847622383, "phrase": "frenet-serret_frame"}, {"score": 0.003021392767766593, "phrase": "mobile_obstacles"}, {"score": 0.0026461080202599694, "phrase": "shape_deformation_scheme"}, {"score": 0.0024481198073210567, "phrase": "different_scenarios"}, {"score": 0.0024147474002390763, "phrase": "quantitative_analysis"}, {"score": 0.0022649119108225564, "phrase": "proposed_shape_deformation_method"}, {"score": 0.0021340985236583017, "phrase": "autonomous_movements"}], "paper_keywords": ["Robot formations motion planning", " Formation control", " Fast marching square"], "paper_abstract": "This work presents a path planning algorithm for 3D robot formations based on the standard Fast Marching Square (FM2) path planning method. This method is enlarged in order to apply it to robot formations motion planning. The algorithm is based on a leader-followers scheme, which means that the reference pose for the follower robots is defined by geometric equations that place the goal pose of each follower as a function of the leader's pose. Besides, the Frenet-Serret frame is used to control the orientation of the formation. The algorithm presented allows the formation to adapt its shape so that the obstacles are avoided. Additionally, an approach to model mobile obstacles in a 3D environment is described. This model modifies the information used by the FM2 algorithm in favour of the robots to be able to avoid obstacles. The shape deformation scheme allows to easily change the behaviour of the formation. Finally, simulations are performed in different scenarios and a quantitative analysis of the results has been carried out. The tests show that the proposed shape deformation method, in combination with the FM2 path planner, is robust enough to manage autonomous movements through an indoor 3D environment.", "paper_title": "3D Robot Formations Path Planning with Fast Marching Square", "paper_id": "WOS:000363981000012"}