{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reliable_server_assignment_problem"}, {"score": 0.012267658682353121, "phrase": "critical_service_rate"}, {"score": 0.008783928016167597, "phrase": "gtga"}, {"score": 0.00863523870484364, "phrase": "nga"}, {"score": 0.00438921882244081, "phrase": "network_reliability"}, {"score": 0.004314595541370065, "phrase": "worst-case_attack"}, {"score": 0.004112303664150895, "phrase": "unreliable_network"}, {"score": 0.003852791434660505, "phrase": "attacked_network_edges"}, {"score": 0.0034284557556382815, "phrase": "bi-level_optimization_problem"}, {"score": 0.0033817007195139767, "phrase": "network_designer"}, {"score": 0.003019444345150991, "phrase": "single_network_configuration"}, {"score": 0.0029788575992692385, "phrase": "np"}, {"score": 0.0028975361811534265, "phrase": "game-theoretic_genetic_algorithm"}, {"score": 0.002723815159181826, "phrase": "joint_payoff_matrix"}, {"score": 0.002508239347479441, "phrase": "solution_quality"}, {"score": 0.0024910622362019573, "phrase": "nearly_identical_cpu_times"}, {"score": 0.002440231768165477, "phrase": "efficient_simulation_method"}, {"score": 0.002193634795186667, "phrase": "novel_algorithmic_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network reliability", " Network design", " Bi-level optimization", " Game theory", " Genetic algorithms"], "paper_abstract": "We introduce the reliable server assignment problem considering attacks, which seeks to choose the locations of servers on a network in order to maximize the network reliability that results from a worst-case attack on the edges of the network. The problem is formulated on an unreliable network such that edges are subject to fail independently, and attacks increase the probability of failure for the attacked network edges. The reliability is measured by the critical service rate, which equals the probability that at least a fraction cc of the nodes in the network are connected to a server. We model this problem as a bi-level optimization problem, with the network designer acting as the leader and the attacker acting as the follower. The problem IN very difficult to solve, both because of its bi-level structure and because simply evaluating the critical Service rate for a single network configuration and attack is NP-hard. We propose a novel Game-Theoretic Genetic Algorithm (GTGA) that simultaneously maintains two populations, one for each player, which interact through a joint payoff matrix. We benchmark the GTGA against a more straightforward Nested GA (NGA) and find that the GTGA significantly outperforms the NGA in terms of solution quality with nearly identical CPU times. We also introduce an efficient simulation method to estimate the reliability for a given set of servers and integrate this into the GAs. We contribute to the literature on the reliable server assignment problem, as well as introducing a novel algorithmic approach that can be adapted to other hi-level optimization problems. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A Game-Theoretic Genetic Algorithm for the reliable server assignment problem under attacks", "paper_id": "WOS:000356111600007"}