{"auto_keywords": [{"score": 0.04653621931999408, "phrase": "characteristic_decomposition"}, {"score": 0.040614078703116396, "phrase": "ordinary_case"}, {"score": 0.03771465750530587, "phrase": "canonical_characteristic"}, {"score": 0.03686325203206044, "phrase": "characterizable_differential_ideal"}, {"score": 0.00481495049065317, "phrase": "differential_characteristic_decompositions"}, {"score": 0.00438105507792004, "phrase": "radical_differential"}, {"score": 0.00405735420159564, "phrase": "new_bound"}, {"score": 0.002846175473457555, "phrase": "target_ranking"}, {"score": 0.0027469703311742647, "phrase": "purely_algebraic_algorithm"}, {"score": 0.0025436978068459565, "phrase": "factorization-free_algorithm"}, {"score": 0.0023694065215394593, "phrase": "radical_ideal"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_ranking"}], "paper_keywords": ["Differential algebra", " Canonical characteristic sets", " Radical differential ideals", " Bounds for orders"], "paper_abstract": "We propose an algorithm for transforming a characteristic decomposition of a radical differential ideal from one ranking into another. The algorithm is based on a new bound: we show that, in the ordinary case, for any ranking, the order of each element of the canonical characteristic set of a characterizable differential ideal is bounded by the order of the ideal. Applying this bound, the algorithm determines the number of times one needs to differentiate the given differential polynomials, so that a characteristic decomposition w.r.t. the target ranking could be computed by a purely algebraic algorithm (that is, without further differentiations). We also propose a factorization-free algorithm for computing the canonical characteristic set of a characterizable differential ideal represented as a radical ideal by a set of generators. This algorithm is not restricted to the ordinary case and is applicable for an arbitrary ranking. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Algebraic transformation of differential characteristic decompositions from one ranking to another", "paper_id": "WOS:000264447200002"}