{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "approximate_string_matching"}, {"score": 0.010400899660176727, "phrase": "similarity_searches"}, {"score": 0.004735414083933722, "phrase": "string-similarity_measure"}, {"score": 0.004415405016793755, "phrase": "samuel"}, {"score": 0.004158290806404304, "phrase": "syntactic_similarities"}, {"score": 0.00406238127438793, "phrase": "common_words"}, {"score": 0.0038385317554884713, "phrase": "syntactically-different_strings"}, {"score": 0.0037126411255026665, "phrase": "bill"}, {"score": 0.003663443192307343, "phrase": "short_form"}, {"score": 0.0036269783053482795, "phrase": "william"}, {"score": 0.0035669891404642015, "phrase": "database_management_systems"}, {"score": 0.002988868585379496, "phrase": "expansion-based_framework"}, {"score": 0.0029590932194209826, "phrase": "string_similarities"}, {"score": 0.0028715299874549245, "phrase": "efficient_algorithms"}, {"score": 0.002668211079063252, "phrase": "length-filtering_strategies"}, {"score": 0.0024627509513027923, "phrase": "online_selection"}, {"score": 0.002446359075737738, "phrase": "signature_filters"}, {"score": 0.002405853977978678, "phrase": "strong_low-error"}, {"score": 0.002213147136067999, "phrase": "experimental_results"}, {"score": 0.0021910825909008946, "phrase": "comprehensive_study"}], "paper_keywords": ["Algorithms", " Experimentation", " Performance", " Theory", " String similarity search", " similarity join", " semantic search"], "paper_abstract": "A string-similarity measure quantifies the similarity between two text strings for approximate string matching or comparison. For example, the strings \"Sam\" and \"Samuel\" can be considered to be similar. Most existing work that computes the similarity of two strings only considers syntactic similarities, for example, number of common words or q-grams. While this is indeed an indicator of similarity, there are many important cases where syntactically-different strings can represent the same real-world object. For example, \"Bill\" is a short form of \"William,\" and \"Database Management Systems\" can be abbreviated as \"DBMS.\" Given a collection of predefined synonyms, the purpose of this article is to explore such existing knowledge to effectively evaluate the similarity between two strings and efficiently perform similarity searches and joins, thereby boosting the quality of approximate string matching. In particular, we first present an expansion-based framework to measure string similarities efficiently while considering synonyms. We then study efficient algorithms for similarity searches and joins by proposing two novel indexes, called SI-trees and QP-trees, which combine signature-filtering and length-filtering strategies. In order to improve the efficiency of our algorithms, we develop an estimator to estimate the size of candidates to enable an online selection of signature filters. This estimator provides strong low-error, high-confidence guarantees while requiring only logarithmic space and time costs, thus making our method attractive both in theory and in practice. Finally, the experimental results from a comprehensive study of the algorithms with three real datasets verify the effectiveness and efficiency of our approaches.", "paper_title": "Boosting the Quality of Approximate String Matching by Synonyms", "paper_id": "WOS:000363567400001"}