{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "taiwan"}, {"score": 0.029881332023957083, "phrase": "physical_objects"}, {"score": 0.00481511567253857, "phrase": "integrated"}, {"score": 0.004701015188740582, "phrase": "lips-doi"}, {"score": 0.004553265070135597, "phrase": "active_effort"}, {"score": 0.004517055580214742, "phrase": "major_libraries"}, {"score": 0.004153739859461064, "phrase": "low-cost_and_high-flexibility_system"}, {"score": 0.0038810583785936505, "phrase": "resource_management"}, {"score": 0.00374399358035391, "phrase": "related_techniques"}, {"score": 0.003669941438286456, "phrase": "integrated_search_system"}, {"score": 0.003583002730249742, "phrase": "resources_management"}, {"score": 0.0035403060198952244, "phrase": "reported_system"}, {"score": 0.0030171910207671205, "phrase": "findings-a_low-cost_and_high-flexibility_system"}, {"score": 0.002841545331522694, "phrase": "digital_objects"}, {"score": 0.002623111480310373, "phrase": "original_system"}, {"score": 0.0023079225317714815, "phrase": "library_end_users"}, {"score": 0.002262209824105154, "phrase": "mixed_formats"}, {"score": 0.0022352169832099153, "phrase": "disparate_locations"}, {"score": 0.0022085455097790537, "phrase": "single_interface"}], "paper_keywords": ["object-oriented methods", " resource management", " computer software", " Taiwan"], "paper_abstract": "Purpose-There is an active effort by major libraries in Taiwan to offer integrated searching as part of their information services. The purpose of this paper is to report a low-cost and high-flexibility system, (LIPS-DOI), which can carry out integrated searching with respect to resource management. Design/methodology/approach-The paper first reviews the related techniques and then designs an integrated search system based on the concept of resources management. The reported system, (LIPS-DOI), is composed of three modules: enumeration module, description module, and resolution module. The various digital contents are first imported into (LIPS-DOI) and thereafter the system is put into operation. Findings-A low-cost and high-flexibility system for integrated searching can be implemented and put into operation. In addition to digital objects, physical objects could also be managed and searched in the proposed (LIPS-DOI) system. This system will redirect users to the original system in which these physical objects reside. Research limitations/implications-Due to the nature of management, registered users have to manage their own objects using the features provided by (LIPS-DOI). Originality/value-Such a system will empower library end users to find materials of mixed formats residing in disparate locations from a single interface. It was also designed with an eye toward integration with its DOI counterpart in the future.", "paper_title": "Integrated searching in Taiwan: the LIPS-DOI experiment", "paper_id": "WOS:000246892600004"}