{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "optimization_problems"}, {"score": 0.009148364139313758, "phrase": "strong_equivalence"}, {"score": 0.008713768692145013, "phrase": "qualitative_optimization_problems"}, {"score": 0.00436890075128947, "phrase": "preference_theories"}, {"score": 0.004252469672259375, "phrase": "separate_modules"}, {"score": 0.003370565320453525, "phrase": "propositional_theory"}, {"score": 0.003245359940011418, "phrase": "standard_propositional_logic_semantics"}, {"score": 0.002992456421856034, "phrase": "latter_interpretation"}, {"score": 0.002881255933884771, "phrase": "answer-set_optimization_programs"}, {"score": 0.002656650588033728, "phrase": "larger_context"}, {"score": 0.002320449502337321, "phrase": "associated_reasoning_tasks"}, {"score": 0.002234165013865669, "phrase": "modular_representation"}], "paper_keywords": [""], "paper_abstract": "We introduce the framework of qualitative optimization problems (or, simply, optimization problems) to represent preference theories. The formalism uses separate modules to describe the space of outcomes to be compared (the generator) and the preferences on outcomes (the selector). We consider two types of optimization problems. They differ in the way the generator, which we model by a propositional theory, is interpreted: by the standard propositional logic semantics, and by the equilibrium-model (answer-set) semantics. Under the latter interpretation of generators, optimization problems directly generalize answer-set optimization programs proposed previously. We study strong equivalence of optimization problems, which guarantees their interchangeability within any larger context. We characterize several versions of strong equivalence obtained by restricting the class of optimization problems that can be used as extensions and establish the complexity of associated reasoning tasks. Understanding strong equivalence is essential for modular representation of optimization problems and rewriting techniques to simplify them without changing their inherent properties.", "paper_title": "Strong Equivalence of Qualitative Optimization Problems", "paper_id": "WOS:000321097700001"}