{"auto_keywords": [{"score": 0.03729405525941563, "phrase": "peer_interactive_communication"}, {"score": 0.00569648271103265, "phrase": "social_sciences"}, {"score": 0.00481495049065317, "phrase": "\"reward_triangle"}, {"score": 0.004661116930794176, "phrase": "funding_acknowledgments"}, {"score": 0.0046276016230633495, "phrase": "\"peer_interactive_communication"}, {"score": 0.004577777897335174, "phrase": "scientific_publications"}, {"score": 0.004336556638639097, "phrase": "recurrent_challenge"}, {"score": 0.0042898529847155255, "phrase": "bibliometric_field"}, {"score": 0.0041079938275505575, "phrase": "general_bibliometric_analysis"}, {"score": 0.004063741692442559, "phrase": "new_funding_acknowledgment"}, {"score": 0.003646516176920946, "phrase": "fa_text"}, {"score": 0.003088178133049113, "phrase": "higher_impact"}, {"score": 0.002780926625471525, "phrase": "china"}, {"score": 0.002721201438773336, "phrase": "highest_share"}, {"score": 0.0023718560142554634, "phrase": "strong_scientific_tradition"}, {"score": 0.00232935232323113, "phrase": "scientific_networks"}, {"score": 0.0021825348057711628, "phrase": "lower_levels"}, {"score": 0.002151183757599893, "phrase": "observed_patterns"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["bibliometrics", " publications", " citation analysis"], "paper_abstract": "Understanding the role of acknowledgments given by researchers in their publications has been a recurrent challenge in the bibliometric field, but relatively unexplored until now. This study presents a general bibliometric analysis on the new funding acknowledgment (FA) information available in the Web of Science. All publications covered by the database in 2009 have been analyzed. The presence and length of the FA text, as well as the presence of peer interactive communication in the acknowledgments, are related to impact indicators, distribution of papers by fields, countries of the authors, and collaboration level of the papers. It is observed that publications with FAs present a higher impact as compared with publications without them. There are also differences across countries and disciplines in the share of publications with FAs and the acknowledgment of peer interactive communication. China is the country with the highest share of publications acknowledging funding, while the presence of FAs in the humanities and social sciences is very low compared to the more basic disciplines. The presence of peer interactive communication in acknowledgments can be linked to countries that have a strong scientific tradition and are incorporated in scientific networks. Peer interactive communication is also common in the fields of humanities and social sciences and can be linked to lower levels of co-authorship. Observed patterns are explained and topics of future research are proposed.", "paper_title": "Approaching the \"reward triangle\": General analysis of the presence of funding acknowledgments and \"peer interactive communication\" in scientific publications", "paper_id": "WOS:000306758600012"}