{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_phone_applications"}, {"score": 0.010037446944454588, "phrase": "user-centred_design_perspective"}, {"score": 0.004344965512058521, "phrase": "obesity_rates"}, {"score": 0.003848088904418221, "phrase": "applications'_acceptance"}, {"score": 0.0037592362369401546, "phrase": "design_and_development_process"}, {"score": 0.0036213041338584756, "phrase": "user-centred_design"}, {"score": 0.0035211747962710246, "phrase": "paper_reviews"}, {"score": 0.0031328221096543823, "phrase": "review_results"}, {"score": 0.0030319482153908037, "phrase": "existing_studies"}, {"score": 0.0029757667083164627, "phrase": "identified_strengths"}, {"score": 0.0028664985822266344, "phrase": "multidisciplinary_skills"}, {"score": 0.0026974065918918275, "phrase": "iterative_design_practices"}, {"score": 0.0025264171945423254, "phrase": "inconsistent_evaluation_protocols"}, {"score": 0.002410942838102255, "phrase": "research_areas"}, {"score": 0.0022793032191981404, "phrase": "greater_understanding"}, {"score": 0.0021049977753042253, "phrase": "behavioural_change"}], "paper_keywords": ["Obesity", " User-centred design", " Mobile phone", " Ubiquitous"], "paper_abstract": "Evidence has shown that the trend of increasing obesity rates has continued in the last decade. Mobile phone applications, benefiting from their ubiquity, have been increasingly used to address this issue. In order to increase the applications' acceptance and success, a design and development process that focuses on users, such as user-centred design, is necessary. This paper reviews reported studies that concern the design and development of mobile phone applications to prevent obesity, and analyses them from a user-centred design perspective. Based on the review results, strengths and weaknesses of the existing studies were identified. Identified strengths included: evidence of the inclusion of multidisciplinary skills and perspectives; user involvement in studies; and the adoption of iterative design practices. Weaknesses included the lack of specificity in the selection of end-users and inconsistent evaluation protocols. The review was concluded by outlining issues and research areas that need to be addressed in the future, including: greater understanding of the effectiveness of sharing data between peers, privacy, and guidelines for designing for behavioural change through mobile phone applications.", "paper_title": "Managing obesity through mobile phone applications: a state-of-the-art review from a user-centred design perspective", "paper_id": "WOS:000344812200019"}