{"auto_keywords": [{"score": 0.04806131990325831, "phrase": "aiim"}, {"score": 0.021465001821075646, "phrase": "interface_problems"}, {"score": 0.009686378890915778, "phrase": "irregular_domains"}, {"score": 0.009631292732545836, "phrase": "gmres"}, {"score": 0.00481495049065317, "phrase": "augmented_immersed_interface_method"}, {"score": 0.004760017604908536, "phrase": "effective_and_efficient_matrix-free_preconditioning_techniques"}, {"score": 0.00420747736707902, "phrase": "schur_complement_a"}, {"score": 0.0040767015025213625, "phrase": "irregular_boundary"}, {"score": 0.0038381762329455556, "phrase": "substantial_difficulties"}, {"score": 0.0037726162825149666, "phrase": "slow_convergence"}, {"score": 0.0037081719941361394, "phrase": "free_boundary"}, {"score": 0.003382547312072468, "phrase": "matrix-free_structured_preconditioning_techniques"}, {"score": 0.0033439015405773093, "phrase": "adaptive_randomized_sampling"}, {"score": 0.0032398798149196432, "phrase": "hierarchically_semiseparable_matrix_approximation"}, {"score": 0.003193669607059425, "phrase": "existing_schemes"}, {"score": 0.0030854280671143556, "phrase": "potential_instability"}, {"score": 0.0023889533502525527, "phrase": "heuristical_justifications"}, {"score": 0.0023548511815224098, "phrase": "comprehensive_tests"}, {"score": 0.002301295044886946, "phrase": "navier_stokes_equations"}, {"score": 0.0022749744354271834, "phrase": "traction_boundary_conditions"}, {"score": 0.00224895418418184, "phrase": "incompressible_flows"}, {"score": 0.002236055625099805, "phrase": "mixed_boundary_problems"}, {"score": 0.002185195325707735, "phrase": "preconditioning_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Augmented immersed interface method", " Schur complement system", " GMRES", " Matrix-free preconditioning", " Hierarchically semiseparable structure", " Adaptive randomized compression"], "paper_abstract": "We present effective and efficient matrix-free preconditioning techniques for the augmented immersed interface method (AIIM). AIIM has been developed recently and is shown to be very effective for interface problems and problems on irregular domains. GMRES is often used to solve for the augmented variable(s) associated with a Schur complement A in AIIM that is defined along the interface or the irregular boundary. The efficiency of AIIM relies on how quickly the system for A can be solved. For some applications, there are substantial difficulties involved, such as the slow convergence of GMRES (particularly for free boundary and moving interface problems), and the inconvenience in finding a preconditioner (due to the situation that only the products of A and vectors are available). Here, we propose matrix-free structured preconditioning techniques for AIIM via adaptive randomized sampling, using only the products of A and vectors to construct a hierarchically semiseparable matrix approximation to A. Several improvements over existing schemes are shown so as to enhance the efficiency and also avoid potential instability. The significance of the preconditioners includes: (1) they do not require the entries of A or the multiplication of AT with vectors; (2) constructing the preconditioners needs only O (log N) matrix vector products and O(N) storage, where N is the size of A; (3) applying the preconditioners needs only O (N) flops; (4) they are very flexible and do not require any a priori knowledge of the structure of A. The preconditioners are observed to significantly accelerate the convergence of GMRES, with heuristical justifications of the effectiveness. Comprehensive tests on several important applications are provided, such as Navier Stokes equations on irregular domains with traction boundary conditions, interface problems in incompressible flows, mixed boundary problems, and free boundary problems. The preconditioning techniques are also useful for several other problems and methods. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Effective matrix-free preconditioning for the augmented immersed interface method", "paper_id": "WOS:000364886900019"}