{"auto_keywords": [{"score": 0.03731816460421424, "phrase": "similarity_search_profile"}, {"score": 0.00481495049065317, "phrase": "chembl_compound_data_sets"}, {"score": 0.004752221133109136, "phrase": "large-scale_similarity_search_investigation"}, {"score": 0.004223032986655664, "phrase": "current_performance_spectrum"}, {"score": 0.003903269701018361, "phrase": "bond_diameter"}, {"score": 0.0035918768194006735, "phrase": "search_calculations"}, {"score": 0.003498782065781398, "phrase": "chembl_database"}, {"score": 0.003393206299636482, "phrase": "fingerprint_search_campaign"}, {"score": 0.0031636612155559267, "phrase": "compound_recovery_rate"}, {"score": 0.0028480459059007468, "phrase": "fingerprint_searching"}, {"score": 0.0027741761880779535, "phrase": "early_enrichment"}, {"score": 0.002749980017065414, "phrase": "active_compounds"}, {"score": 0.002725994306480105, "phrase": "database_selection_sets"}, {"score": 0.00266693888510356, "phrase": "compound_activity_classes"}, {"score": 0.0025977542995083624, "phrase": "different_similarity_search_performance_levels"}, {"score": 0.002497319603143104, "phrase": "benchmark_calculations"}, {"score": 0.0024007585788965655, "phrase": "activity_classes"}, {"score": 0.0023694065215394593, "phrase": "different_search_performance_categories"}, {"score": 0.002123531043641047, "phrase": "wide_spectrum"}, {"score": 0.0021049977753042253, "phrase": "pharmaceutical_targets"}], "paper_keywords": [""], "paper_abstract": "A large-scale similarity search investigation has been carried out on 266 well-defined compound activity classes extracted from the ChEMBL database. The analysis was performed using two widely applied two-dimensional (2D) fingerprints that mark opposite ends of the current performance spectrum of these types of fingerprints, i.e., MACCS structural keys and the extended connectivity fingerprint with bond diameter four (ECFP4). For each fingerprint, three nearest neighbor search strategies were applied. On the basis of these search calculations, a similarity search profile of the ChEMBL database was generated. Overall, the fingerprint search campaign was surprisingly successful. In 203 of 266 test cases (similar to 76%), a compound recovery rate of at least 50% was observed with at least the better performing fingerprint and one search strategy. The similarity search profile also revealed several general trends. For example, fingerprint searching was often characterized by an early enrichment of active compounds in database selection sets. In addition, compound activity classes have been categorized according to different similarity search performance levels, which helps to put the results of benchmark calculations into perspective. Therefore, a compendium of activity classes falling into different search performance categories is provided. On the basis of our large-scale investigation, the performance range of state-of-the-art 2D fingerprinting has been delineated for compound data sets directed against a wide spectrum of pharmaceutical targets.", "paper_title": "Large-Scale Similarity Search Profiling of ChEMBL Compound Data Sets", "paper_id": "WOS:000294081800010"}