{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "preheat_zone"}, {"score": 0.015268626637504532, "phrase": "observable_\"non-signal_zone"}, {"score": 0.009883684449879068, "phrase": "near-extinction_limit"}, {"score": 0.004579780586951551, "phrase": "-oh_simultaneous_plif"}, {"score": 0.00406971620207041, "phrase": "acetone-oh_simultaneous_plif."}, {"score": 0.003912595576016982, "phrase": "yag-dye_laser_and_fluorescence_signals"}, {"score": 0.003815770872944475, "phrase": "fuel_flow"}, {"score": 0.003775008774288817, "phrase": "combustion-generated_oh"}, {"score": 0.003708033700676924, "phrase": "single_iccd_camera"}, {"score": 0.0036815763368083197, "phrase": "clear_\"non-signal_zone"}, {"score": 0.0034271313706984658, "phrase": "flame_holder"}, {"score": 0.003378385493203297, "phrase": "detailed_chemistry"}, {"score": 0.003342280102112269, "phrase": "seven-step_acetone-decomposition_reactions"}, {"score": 0.0028446460307503343, "phrase": "strong_temperature_dependence"}, {"score": 0.0028142286985235977, "phrase": "acetone_fluorescence_signal"}, {"score": 0.0026573974912563014, "phrase": "spatial_variation"}, {"score": 0.002610198789888055, "phrase": "unburned_zone"}, {"score": 0.0023864566654035924, "phrase": "numerically_simulated_temperature_profiles"}, {"score": 0.0022213218042340752, "phrase": "simultaneous_plif"}, {"score": 0.002181851408180827, "phrase": "promising_technique"}, {"score": 0.0021049977753042253, "phrase": "temperature_distribution"}], "paper_keywords": ["Lean premixed flame", " Combustion diagnostics", " PLIF", " Preheat zone"], "paper_abstract": "A strategy to image the preheat zone of a very lean, laminar premixed flame (whose equivalence ratio, I center dot, is < 0.6) is proposed using acetone-OH simultaneous PLIF. A combination of excitation at 283 and 266 nm is accomplished by a YAG-Dye laser and fluorescence signals from the acetone seeded into the fuel flow and the combustion-generated OH together detected by a single ICCD camera. Clear \"non-signal zone\" between these sources is successfully imaged even under very lean conditions, where the flame is blown off without a flame holder. 1-D numerical simulations with detailed chemistry, including seven-step acetone-decomposition reactions are performed for comparison with measured 1-D fluorescence signal distributions. These comparisons clearly indicate that the thickness of the observable \"non-signal zone\" is much wider than the zone where neither the predicted acetone nor the OH exists. It is found that this deviation is caused by the strong temperature dependence of the acetone fluorescence signal. This feature suggests that the observable \"non-signal zone\" should correspond to the region with the spatial variation of temperature in the unburned zone; namely, the preheat zone. In fact, it is shown that the observable \"non-signal zone\" agrees well with the preheat zone obtained by numerically simulated temperature profiles over a range of imposed very lean condition (I center dot > 0.54). Therefore, acetone-OH simultaneous PLIF presents itself as a promising technique capable of visualizing the preheat zone without knowledge of the temperature distribution, even at the near-extinction limit.", "paper_title": "Successful imaging of the preheat zone of a lean (I center dot < 0.6) flame: the potential capability of acetone-OH simultaneous PLIF to diagnose flames at the near-extinction limit", "paper_id": "WOS:000309874200002"}