{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "multi-agent_systems"}, {"score": 0.03472642561979023, "phrase": "unbalanced_overworking_situations"}, {"score": 0.015719716506582538, "phrase": "measurement_approach"}, {"score": 0.004773040022691547, "phrase": "overcoming_unbalanced_overwork"}, {"score": 0.004731492618963217, "phrase": "multi-agent_systems."}, {"score": 0.004529093447865156, "phrase": "unbalanced_communication_patterns"}, {"score": 0.004316396683332752, "phrase": "short_period"}, {"score": 0.004042295865725559, "phrase": "large_amount"}, {"score": 0.0038692638652494697, "phrase": "system's_performance"}, {"score": 0.0037198532511087566, "phrase": "similar_services"}, {"score": 0.003219553875143356, "phrase": "new_metric"}, {"score": 0.0030414140732789186, "phrase": "possible_common_causes"}, {"score": 0.0030017207229983385, "phrase": "defective_behavior"}, {"score": 0.002923876831533028, "phrase": "different_measurement_values"}, {"score": 0.0025863988422430797, "phrase": "agents'_communications"}, {"score": 0.002464709648714996, "phrase": "recommended_solutions"}, {"score": 0.0024325244760735566, "phrase": "current_work"}, {"score": 0.0021049977753042253, "phrase": "nine_different_problem_domains"}], "paper_keywords": ["Agent-oriented software engineering", " communication", " metric", " multi-agent system", " overwork", " performance"], "paper_abstract": "Overworking behaviors appear in multi-agent systems specially when there are unbalanced communication patterns. This occurs when an agent receives many messages in a short period of time in comparison to other agents. As the agent pays attention to the large amount of messages, it worsens its performance, causing the system's performance to worsen as well, while other agents with similar services can be idle. The reasons for these behaviors are varied and depend on the nature of the messages. This article presents a measurement approach that detects unbalanced overworking situations in multi-agent systems with a new metric. Moreover, this approach includes a set of recommendations that determine possible common causes of this defective behavior depending on the relations of different measurement values. These recommendations also propose a solution for repairing each cause, suppressing these unbalanced overworking situations. A tool has been developed for allowing designers to measure the agents' communications, to obtain the diagnosis, and to know the recommended solutions. The current work has been applied in two case studies, whose results advocate that the suppression of unbalanced overworking situations is strongly related to the improvement of performance in multi-agent systems. Furthermore, the experience of this approach in nine different problem domains is presented as support for the causes and solutions of the set of recommendations.", "paper_title": "A MEASUREMENT APPROACH FOR OVERCOMING UNBALANCED OVERWORK IN MULTI-AGENT SYSTEMS", "paper_id": "WOS:000323564900008"}