{"auto_keywords": [{"score": 0.039372340035673914, "phrase": "auxiliary_function"}, {"score": 0.015719716506582538, "phrase": "real_parts"}, {"score": 0.00472955160788118, "phrase": "partial_sums"}, {"score": 0.0044423558024348, "phrase": "new_method"}, {"score": 0.004273338516164498, "phrase": "real_projections"}, {"score": 0.004197505250073651, "phrase": "partial_sum"}, {"score": 0.003919022096381048, "phrase": "riemann_zeta_function"}, {"score": 0.003702908986507269, "phrase": "known_result"}, {"score": 0.003680862877070614, "phrase": "avellar"}, {"score": 0.0035513038412674763, "phrase": "numerical_experiences"}, {"score": 0.0026578445199569893, "phrase": "accumulation_points"}, {"score": 0.0026106041192988706, "phrase": "real_projection"}, {"score": 0.0025261612008752534, "phrase": "exact_interval"}, {"score": 0.0023302648796456452, "phrase": "large_set"}, {"score": 0.0021176256386583555, "phrase": "particular_class"}, {"score": 0.0021049977753042253, "phrase": "entire_functions"}], "paper_keywords": ["Polynomials", " Zeros of entire functions", " Exponential polynomials", " Partial sums of the Riemann zeta function"], "paper_abstract": "Purpose - This paper aims to present a new method for obtaining points of the set determined by the closure of the real projections of the zeros of each partial sum 1 + 2(s) + ... + n(s), n >= 2, s = sigma + it, of the Riemann zeta function and to show several applications of this result. Design/methodology/approach - The authors utilize an auxiliary function related to a known result of Avellar that characterizes the set of points of interest. Several figures and numerical experiences are presented to illustrate the various properties which are studied. Findings - It is first shown that each point of the image of the auxiliary function can be approximated by points of the image of the function formed by the approximants. Secondly, conditions are given on the auxiliary function to obtain points satisfying the property of density which is studied. Finally, by using these conditions, several useful applications are presented to the case n = 4 and sigma(0) = 0 which a more specific criterion is also given. Practical implications - This research is applicable for finding accumulation points of the set of the real projection of the zeros of the approximants on its critical interval. An exact interval included in this set is given for the case n = 4. Also, it is demonstrated that the point 0 is included for a large set of values of n. Originality/value - The method employed is original and it contributes to the study on the properties of the density of the real parts of the zeros of a particular class of entire functions.", "paper_title": "A new approach to obtain points of the closure of the real parts of the zeros of the partial sums 1+2(z) + ... + n(z), n >= 2", "paper_id": "WOS:000304024000010"}