{"auto_keywords": [{"score": 0.04414701944187081, "phrase": "malicious_nodes"}, {"score": 0.010440155729050668, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.008805100615581431, "phrase": "radio_range"}, {"score": 0.006553138706907392, "phrase": "detection_process"}, {"score": 0.005977005374848888, "phrase": "monitor_node"}, {"score": 0.004814966938368356, "phrase": "collaborative"}, {"score": 0.0047676399834833275, "phrase": "intrusion_detection"}, {"score": 0.00452302256811929, "phrase": "collaborative_efforts"}, {"score": 0.004390958289481035, "phrase": "malicious_node"}, {"score": 0.004305055407631358, "phrase": "first_technique"}, {"score": 0.0037611961382938964, "phrase": "second_technique"}, {"score": 0.0025828350676150354, "phrase": "suspected_nodes"}, {"score": 0.002523875743494305, "phrase": "routing_protocol"}, {"score": 0.002441969502075509, "phrase": "first_algorithm"}, {"score": 0.002324055400492893, "phrase": "message_loss"}, {"score": 0.0022118223311537954, "phrase": "good_performance"}, {"score": 0.002175626278359828, "phrase": "message_losses"}, {"score": 0.0021470954708827125, "phrase": "unreliable_channel"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MANET", " Intrusion detection system (IDS)", " Malicious node", " Security", " Wireless network"], "paper_abstract": "In this paper, we present two intrusion detection techniques for mobile ad-hoc networks, which use collaborative efforts of nodes in a neighborhood to detect a malicious node in that neighborhood. The first technique is designed for detection of malicious nodes in a neighborhood of nodes in which each pair of nodes in the neighborhood are within radio range of each other. Such a neighborhood of nodes is known as a clique [12]. The second technique is designed for detection of malicious nodes in a neighborhood of nodes, in which each pair of nodes may not be in radio range of each other but where there is a node among them which has all the other nodes in its one-hop vicinity. This neighborhood is identical to a cluster as mentioned in [12]. Both techniques use message passing between the nodes. A node called the monitor node initiates the detection process. Based on the messages that it receives during the detection process, each node determines the nodes it suspects to be malicious and send votes to the monitor node. The monitor node upon inspecting the votes determines the malicious nodes from among the suspected nodes. Our intrusion detection system is independent of any routing protocol. We give the proof of correctness of the first algorithm, which shows that it correctly detects the malicious nodes always when there is no message loss. We also show with the help of simulations that both the algorithms give good performance even when there are message losses arising due to unreliable channel. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Collaborative techniques for intrusion detection in mobile ad-hoc networks", "paper_id": "WOS:000263410700003"}