{"auto_keywords": [{"score": 0.046363267640327714, "phrase": "horseshoe_vortices"}, {"score": 0.013946562485163936, "phrase": "section_shape"}, {"score": 0.00481495049065317, "phrase": "section_shapes"}, {"score": 0.004555371402128666, "phrase": "cylinder-plate_junction_flow"}, {"score": 0.0038379074449947067, "phrase": "vortex_structures"}, {"score": 0.003799397093447221, "phrase": "laser_doppler_velocimeter"}, {"score": 0.0036861605703168397, "phrase": "velocity_field"}, {"score": 0.00363080961099728, "phrase": "symmetry_plane_upstream"}, {"score": 0.003540392285585644, "phrase": "electrical_pressure-scanning_valve"}, {"score": 0.002709589081384597, "phrase": "primary_horseshoe_vortex"}, {"score": 0.002437012847684331, "phrase": "reduced_streamwise_adverse_pressure_gradient"}, {"score": 0.0023170054862555896, "phrase": "frontal_shape"}, {"score": 0.0021697677572213086, "phrase": "swept_thin_cylinder"}, {"score": 0.0021049977753042253, "phrase": "primary_cylinder"}], "paper_keywords": ["junction flow", " horseshoe vortex", " smoke wire", " laser induced fluorescence"], "paper_abstract": "Through visualization and measurement on the cylinder-plate junction flow, we show the horseshoe vortices can be significantly modified by altering the section shape of the cylinder. Both smoke-wire and Laser-Induced-Fluorescence (LIF) are employed to visualize the vortex structures. Laser Doppler velocimeter is used to measure the velocity field in the symmetry plane upstream of the cylinder. Electrical pressure-scanning valve is applied to acquire the pressure on the plate. It is found that, the sharper the frontal shape of the cylinder, the closer the vortex shedding position and the primary horseshoe vortex location to the cylinder. We quantitatively show the variation of the scale and strength of the primary horseshoe vortex, as well as the maximum wall shear stress, when the section shape of the cylinder is varied. The reduced streamwise adverse pressure gradient explains why the horseshoe vortices are significantly suppressed when the frontal shape of the cylinder becomes sharper. At last, we present a swept thin cylinder installed in front of the primary cylinder can be used to suppress the horseshoe vortices, which is greatly effective and easy to implement.", "paper_title": "Modification of junction flows by altering the section shapes of the cylinders", "paper_id": "WOS:000254171100006"}