{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "australia"}, {"score": 0.004731754442072492, "phrase": "australian_university_research_output"}, {"score": 0.004601606675066839, "phrase": "new_research_funding_system"}, {"score": 0.004413036532585712, "phrase": "heavier_weight"}, {"score": 0.004030449969901066, "phrase": "australian_academics"}, {"score": 0.003933214459874487, "phrase": "research_publications"}, {"score": 0.0038116554893891396, "phrase": "uk"}, {"score": 0.003785115566529808, "phrase": "new_zealand"}, {"score": 0.0036553070575015344, "phrase": "proposed_changes"}, {"score": 0.0033498651263935194, "phrase": "different_citation_systems"}, {"score": 0.0033265580369717996, "phrase": "research_funding"}, {"score": 0.0032124249215543296, "phrase": "istp"}, {"score": 0.0031678720736808574, "phrase": "case_study"}, {"score": 0.0031348622158167195, "phrase": "productivity_and_quality_gains"}, {"score": 0.0030378759123133644, "phrase": "usual_practice"}, {"score": 0.0030062165552187086, "phrase": "australian_federal_government"}, {"score": 0.002964515198409409, "phrase": "country's_research_priorities"}, {"score": 0.002803398730609738, "phrase": "physical_environment"}, {"score": 0.0026051114364288126, "phrase": "long-term_vision"}, {"score": 0.002524473047010871, "phrase": "social_pillar"}, {"score": 0.0024807547991927137, "phrase": "brighter_prospects"}, {"score": 0.0024039564563674673, "phrase": "strong_and_world-class_university_research_sector"}, {"score": 0.0021646872269755067, "phrase": "academic_world"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["citations", " Google Scholar", " ISI", " RQF"], "paper_abstract": "Australian university research output has been questioned by the Federal Government. A new research funding system is soon to be introduced which is likely to place a heavier weight on publications. Although the importance of publications is not disputed, the article argues that there is no reason for the performance of the Australian academics to be doubted. Data on research publications is used to show that Australia outperforms the UK and New Zealand whose systems are being used as the model for the proposed changes in Australia. The gap between Australia and these two countries has in fact widened since their research funding reforms were introduced. Further data is provided on different citation systems, research funding and PhD completions in one academic unit, namely the Institute for Sustainability and Technology Policy (ISTP) as a case study to demonstrate productivity and quality gains during the period under question. It is usual practice for the Australian Federal Government to shape the country's research priorities to better reflect and care for the needs of the economy, society and the physical environment where they exist. The funding for research should provide the basis for achieving such long-term sustainability. A country with a long-term vision for the future should use universities as a social pillar, which can guarantee brighter prospects for its coming generations. For Australia to have a strong and world-class university research sector, adequate resources should be provided to match its current achievements. Also, a (new) funding model should allow for diversity and flexibility in research to properly reflect the complexity of the academic world. (C) 2008 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "The changing research funding regime in Australia and academic productivity", "paper_id": "WOS:000256542000017"}