{"auto_keywords": [{"score": 0.049378038061471514, "phrase": "driving_strategies"}, {"score": 0.015719716506582538, "phrase": "multiobjective_optimization_algorithm"}, {"score": 0.008129732741769776, "phrase": "fuel_consumption"}, {"score": 0.003954837422946628, "phrase": "multiobjective_optimization_problem"}, {"score": 0.003877737556673229, "phrase": "appropriate_optimization_algorithms"}, {"score": 0.0032160319265621285, "phrase": "human_versus_machine_test"}, {"score": 0.0028154895878702633, "phrase": "vehicle_simulator"}, {"score": 0.0026148844854123514, "phrase": "mods"}, {"score": 0.002576503437739865, "phrase": "better_driving_strategies"}, {"score": 0.0022443390559699974, "phrase": "traveling_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Driving strategy", " Human driving", " Traveling time", " Fuel consumption", " Driving optimization", " Multiobjective optimization"], "paper_abstract": "When a person drives a vehicle along a route, he/she optimizes two objectives, the traveling time and the fuel consumption. Therefore, the task of driving can be viewed as a multiobjective optimization problem and solved with appropriate optimization algorithms. The comparison between the driving strategies obtained by humans and those obtained by the algorithms is interesting from several points of view. For example, it is interesting to see which strategies are better. To perform the human versus machine test, we compared the driving strategies obtained by the multiobjective optimization algorithm for discovering driving strategies (MODS) with those obtained by a group of volunteers operating a vehicle simulator. The test was performed using data from three real-world routes. The results show that MODS always finds better driving strategies than the volunteers, especially when the fuel consumption is to be reduced. Moreover, the results show that some volunteers always drive similarly in terms of traveling time and fuel consumption while others significantly vary their driving strategies. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Comparing a multiobjective optimization algorithm for discovering driving strategies with humans", "paper_id": "WOS:000315616500031"}