{"auto_keywords": [{"score": 0.035035001304309796, "phrase": "rescaling_approach"}, {"score": 0.016893984153259465, "phrase": "multi-class_problems"}, {"score": 0.008132235615379254, "phrase": "two-class_problems"}, {"score": 0.004663636232080366, "phrase": "cost-sensitive_learning"}, {"score": 0.004322967486451877, "phrase": "different_ways"}, {"score": 0.004137184278868391, "phrase": "training_examples"}, {"score": 0.004007083686875716, "phrase": "decision_boundaries"}, {"score": 0.003927848423072668, "phrase": "high-cost_classes"}, {"score": 0.002898930717812433, "phrase": "good_choice"}, {"score": 0.002382987346529592, "phrase": "multi-class_problem"}, {"score": 0.0023079225317714815, "phrase": "empirical_study"}, {"score": 0.002244178699939059, "phrase": "cost-sensitive_learners"}, {"score": 0.0021049977753042253, "phrase": "class-imbalance_learning"}], "paper_keywords": ["machine learning", " data mining", " cost-sensitive learning", " multi-class problems", " rescaling", " class-imbalance learning"], "paper_abstract": "Rescaling is possibly the most popular approach to cost-sensitive learning. This approach works by rebalancing the classes according to their costs, and it can be realized in different ways, for example, re-weighting or resampling the training examples in proportion to their costs, moving the decision boundaries of classifiers faraway from high-cost classes in proportion to costs, etc. This approach is very effective in dealing with two-class problems, yet some studies showed that it is often not so helpful on multi-class problems. In this article, we try to explore why the rescaling approach is often helpless on multi-class problems. Our analysis discloses that the rescaling approach works well when the costs are consistent, while directly applying it to multi-class problems with inconsistent costs may not be a good choice. Based on this recognition, we advocate that before applying the rescaling approach, the consistency of the costs must be examined at first. If the costs are consistent, the rescaling approach can be conducted directly; otherwise it is better to apply rescaling after decomposing the multi-class problem into a series of two-class problems. An empirical study involving 20 multi-class data sets and seven types of cost-sensitive learners validates our proposal. Moreover, we show that the proposal is also helpful for class-imbalance learning.", "paper_title": "ON MULTI-CLASS COST-SENSITIVE LEARNING", "paper_id": "WOS:000280359100003"}