{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "natural_interface"}, {"score": 0.0046593017130868, "phrase": "action_breakdowns"}, {"score": 0.004529881123652277, "phrase": "issue-based_method"}, {"score": 0.003861288537079326, "phrase": "users'_actions"}, {"score": 0.003807242767474929, "phrase": "systematic_analysis"}, {"score": 0.003649585593445665, "phrase": "video-coding_software"}, {"score": 0.003125175084962886, "phrase": "virtual_spaces"}, {"score": 0.0028986672783671147, "phrase": "superfeet"}, {"score": 0.0027916287357898544, "phrase": "joypad"}, {"score": 0.0025290375256888883, "phrase": "breakdown_analysis"}, {"score": 0.002470237978694949, "phrase": "progressively_finer_level"}, {"score": 0.0021049977753042253, "phrase": "usability_studies"}], "paper_keywords": ["Usability", " Naturalness", " Action breakdown", " Systematic video analysis"], "paper_abstract": "This paper describes an issue-based method to evaluate the naturalness of an interface. The method consists of the execution of a series of tasks on that interface, which is subsequently systematically analyzed to identify breakdowns in the users' actions. The systematic analysis of breakdowns is allowed by the support of video-coding software (The Observer by Noldus). This method is described on its theoretical bases and then applied to the evaluation of a natural interface, a walk-in-place locomotion system for virtual spaces called Superfeet. The procedure is comparative, since Superfeet is compared to two locomotion devices, Superfeet enhanced with headtracker and a more traditional Joypad. The test involves 36 participants (mean age = 23.68, SD = 3.14). The outcomes of the breakdown analysis are illustrated at a progressively finer level of granularity from the amount and length of breakdowns, to the circumstances of the breakdowns, to the type of actions involved in the breakdowns. The potential of this procedure for usability studies is finally synthesized.", "paper_title": "How natural is a natural interface? An evaluation procedure based on action breakdowns", "paper_id": "WOS:000313017700008"}