{"auto_keywords": [{"score": 0.04954033184026153, "phrase": "tag_spaces"}, {"score": 0.03495708104142219, "phrase": "cosine_similarity"}, {"score": 0.034386187942249034, "phrase": "tag_co-occurrences"}, {"score": 0.00481495049065317, "phrase": "improving_search_and_exploration"}, {"score": 0.004156012879026324, "phrase": "free_nature"}, {"score": 0.003370190834214415, "phrase": "levenshtein_distance"}, {"score": 0.003078028357912228, "phrase": "newly_introduced_variable_cost_levenshtein_similarity_measure"}, {"score": 0.0027794243746094905, "phrase": "syntactic_variations"}, {"score": 0.0027325449069867222, "phrase": "framework_clusters"}, {"score": 0.0027017308406240563, "phrase": "related_tags"}, {"score": 0.0025383451160985488, "phrase": "stcs_framework"}, {"score": 0.002495521662819317, "phrase": "state-of-the-art_clustering_technique"}, {"score": 0.0024257455084132646, "phrase": "stcs"}, {"score": 0.0021533445783500863, "phrase": "flickr"}], "paper_keywords": ["Tagging", " syntactic clustering", " semantic clustering", " tag disambiguation"], "paper_abstract": "In recent years we have experienced an increase in the usage of tags to describe resources. However, the free nature of tagging presents some challenges regarding the search and exploration of tag spaces. In order to deal with these challenges we propose the Semantic Tag Clustering Search (STCS) framework. The framework first groups syntactic variations using several measures based on the Levenshtein distance and the cosine similarity based on tag co-occurrences. We find that a measure that combines the newly introduced variable cost Levenshtein similarity measure with the cosine similarity significantly outperforms the other methods we evaluated in terms of precision. After grouping syntactic variations, the framework clusters semantically related tags using the cosine similarity based on tag co-occurrences. We compare the STCS framework to a state-of-the-art clustering technique and find that the STCS framework performs significantly better in terms of precision. For the evaluation we used a large data set gathered from Flickr, which contains all the pictures uploaded in the year 2009.", "paper_title": "IMPROVING SEARCH AND EXPLORATION IN TAG SPACES USING AUTOMATED TAG CLUSTERING", "paper_id": "WOS:000342116700007"}