{"auto_keywords": [{"score": 0.04973325992892519, "phrase": "mobile_database_applications"}, {"score": 0.04036754417187563, "phrase": "energy_consumption"}, {"score": 0.00849635471689658, "phrase": "mobile_operating_systems"}, {"score": 0.0071437377338875625, "phrase": "mobile_applications"}, {"score": 0.00481495049065317, "phrase": "performance-energy_tradeoffs"}, {"score": 0.004366106816225457, "phrase": "energy_issue"}, {"score": 0.004241299366498948, "phrase": "poor_battery_capacity"}, {"score": 0.0035507457285983268, "phrase": "experimental_study"}, {"score": 0.003486913922294352, "phrase": "energy_tradeoffs"}, {"score": 0.0032783186166708985, "phrase": "basic_applications"}, {"score": 0.003161474881435185, "phrase": "android_system"}, {"score": 0.0031272381208680613, "phrase": "basic_mobile_platform"}, {"score": 0.0029615198132465236, "phrase": "benchmark_platform"}, {"score": 0.002887210021573995, "phrase": "energy_measurement"}, {"score": 0.002855934865505357, "phrase": "tpcdroid"}, {"score": 0.0028045585284215044, "phrase": "mobile_database_performance"}, {"score": 0.0027641218567092665, "phrase": "processor_frequency"}, {"score": 0.0027341763737751467, "phrase": "initial_experimental_results"}, {"score": 0.0025518930446603335, "phrase": "traditional_energy_reducing_technologies"}, {"score": 0.002452008186077373, "phrase": "arm"}, {"score": 0.0023135183406982414, "phrase": "different_kinds"}, {"score": 0.0021049977753042253, "phrase": "dynamic_connection"}], "paper_keywords": ["Android", " Mobile database", " Energy consumption", " Performance", " Energy efficiency"], "paper_abstract": "In recent years, mobile operating systems, represented by android and iOS, have become more and more popular in smartphones. However, the energy issue in smartphones, which refers to the poor battery capacity and management schemes, has been the bottle-neck to further advance the development in this area. Generally, mobile applications have to consider both performance and energy consumption. But unfortunately, few works have been focused on this issue. In this paper, we aim at conducting an experimental study on the performance and energy tradeoffs for mobile applications. In particular, we focus on mobile database applications as they are one of the basic applications on mobile operating systems. In detail, we use the android system as the basic mobile platform, and the TPC-H benchmark as the workload, and build a benchmark platform called TPCdroid to conduct performance and energy measurement. In TPCdroid, we control the mobile database performance by changing the processor frequency. The initial experimental results show that lowering frequency is not always helpful for reducing energy consumption. Moreover, we found that the traditional energy reducing technologies based on X86 and magnetic disks are not suitable for mobile database applications running on ARM and flash memory. Finally, we analyse the relationship between performance and energy consumption under different kinds of workloads, which is done by adjusting the parameters reflecting performance and energy consumption for mobile database applications. The results show that the energy consumption has a dynamic connection with the performance in mobile database applications.", "paper_title": "Exploiting the Performance-Energy Tradeoffs for Mobile Database Applications", "paper_id": "WOS:000347734100008"}