{"auto_keywords": [{"score": 0.047560835467356254, "phrase": "subject_fields"}, {"score": 0.00481495049065317, "phrase": "citation_rates"}, {"score": 0.00477513738640734, "phrase": "research_articles"}, {"score": 0.004599994523941615, "phrase": "general_trends"}, {"score": 0.003439117493141663, "phrase": "original_articles"}, {"score": 0.0030995835539697893, "phrase": "relatively_long_citation_windows"}, {"score": 0.0029857124153761187, "phrase": "negative_binomial_multiple_regression"}, {"score": 0.002828556054338357, "phrase": "author_collaboration"}, {"score": 0.002805121439110729, "phrase": "cited_references"}, {"score": 0.002559775585192185, "phrase": "explanatory_variables"}, {"score": 0.0025385621498128243, "phrase": "nbmr."}, {"score": 0.0024149139610228887, "phrase": "selected_predicting_factors"}, {"score": 0.002306855521822739, "phrase": "price_index"}, {"score": 0.0022782315534795516, "phrase": "strongest_predictor"}, {"score": 0.0021049977753042253, "phrase": "authors'_achievement_measures"}], "paper_keywords": [""], "paper_abstract": "This study examines whether there are some general trends across subject fields regarding the factors affecting the number of citations of articles, focusing especially on those factors that are not directly related to the quality or content of articles (extrinsic factors). For this purpose, from 6 selected subject fields (condensed matter physics, inorganic and nuclear chemistry, electric and electronic engineering, biochemistry and molecular biology, physiology, and gastroenterology), original articles published in the same year were sampled (n=230-240 for each field). Then, the citation counts received by the articles in relatively long citation windows (6 and 11 years after publication) were predicted by negative binomial multiple regression (NBMR) analysis for each field. Various article features about author collaboration, cited references, visibility, authors' achievements (measured by past publications and citedness), and publishing journals were considered as the explanatory variables of NBMR. Some generality across the fields was found with regard to the selected predicting factors and the degree of significance of these predictors. The Price index was the strongest predictor of citations, and number of references was the next. The effects of number of authors and authors' achievement measures were rather weak.", "paper_title": "Factors Affecting Citation Rates of Research Articles", "paper_id": "WOS:000351395800007"}