{"auto_keywords": [{"score": 0.047155778350020494, "phrase": "k._saito"}, {"score": 0.02322730111336098, "phrase": "peer-to-peer_barter_relationships"}, {"score": 0.017289474140564944, "phrase": "e._morino"}, {"score": 0.017218023764672664, "phrase": "j._murai"}, {"score": 0.004626881226537083, "phrase": "sustainable_relationships"}, {"score": 0.004607514855008173, "phrase": "selfish_peers"}, {"score": 0.004502433187097914, "phrase": "peer-to-peer"}, {"score": 0.004254511039364627, "phrase": "computer_science"}, {"score": 0.0042012967972746285, "phrase": "springer-verlag"}, {"score": 0.004071121244999291, "phrase": "wat_system"}, {"score": 0.0038630386710162825, "phrase": "wat_tickets"}, {"score": 0.0035001037990786727, "phrase": "distributed_autonomous_currency_system"}, {"score": 0.003398714712611042, "phrase": "peer_computing"}, {"score": 0.0032657812947251928, "phrase": "moral_hazards"}, {"score": 0.0031645050772280033, "phrase": "natural_evasive_actions"}, {"score": 0.0031446286809385378, "phrase": "apparent_risks"}, {"score": 0.0030663599077087617, "phrase": "regular_tickets"}, {"score": 0.00270320881392633, "phrase": "international_workshop_on"}, {"score": 0.0026637384761565605, "phrase": "pdmst"}, {"score": 0.0025487430813077817, "phrase": "small_worlds"}, {"score": 0.002500987934534128, "phrase": "m._feldman"}, {"score": 0.0024904974828343033, "phrase": "c._papadimitriou"}, {"score": 0.0024800509241747013, "phrase": "j._chuang"}, {"score": 0.00246964807581858, "phrase": "i._stoica"}, {"score": 0.0024284701569889113, "phrase": "peer-to-peer_systems"}, {"score": 0.0023930017325812856, "phrase": "acm_sigcomm_workshop"}, {"score": 0.002353098769419447, "phrase": "networked_systems"}, {"score": 0.0022326306658609365, "phrase": "new_identities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P2P", " Trust", " Currency", " Payment schemes", " Incentive", " Moral hazard"], "paper_abstract": "Complementary currencies in the context of P2P (peer-to-peer) networks can be powerful tools for promoting exchanges and building sustainable relationships among selfish peers on the Internet. i-WAT [K. Saito, Peer-to-peer money: Free currency over the Internet, in: Proceedings of the Second International Conference on Human.Society@Internet, HSI 2003, in: Lecture Notes in Computer Science, vol. 2713, Springer-Verlag, 20031 (Internet WAT) has been proposed as such a currency based on the WAT System [watsystems.net, WATSystems home page, hypertext document. Available electronically at http://www.watsystems.net/] a polycentric, real-life complementary currency using WAT tickets as its media of exchange; participants spontaneously issue and circulate the tickets, whose values are backed up by chains of trust, as needed. This article investigates the claim made in the past [K. Saito, E. Morino, J. Murai, Incentive-compatibility in a distributed autonomous currency system, in: Proceedings of the Fourth International Workshop on Agents and Peer-to-Peer Computing, AP2PC 2005, 2005] that the design of i-WAT is incentive-compatible as to counteraction against moral hazards. Such hazards are impeded in i-WAT because participants will have to take natural evasive actions to avoid apparent risks posed by misbehaviors of others. This effect is measured for regular tickets, whose values remain constant over time, as well as for reduction [K. Saito, E. Morino, J. Murai, Reduction over time to facilitate peer-to-peer barter relationships, IEICE Transactions on Information and Systems E89-D (1)] and multiplication [K. Saito, E. Morino, J. Murai, Multiplication over time to facilitate peer-to-peer barter relationships, in: Proceedings of the 2nd International Workshop on P2P Data Management, Security and Trust, PDMST '05, 2005] tickets, whose values are reduced or multiplied over time, respectively, by simulating some small worlds of traders in the presence of whitewashers [M. Feldman, C. Papadimitriou, J. Chuang, I. Stoica, Free-riding and whitewashing in peer-to-peer systems, in: Proceedings of the ACM SIGCOMM Workshop on Practice and Theory of Incentives in Networked Systems, 2004, pp. 228-236], a kind of free-riders who strategically leave and re-join the system with new identities. The results are compared with simulations of the MCS (Mutual Credit System), the category into which many existing currencies fall. (c) 2009 Elsevier B.V. All rights reserved.", "paper_title": "The brighter side of risks in peer-to-peer barter relationships", "paper_id": "WOS:000281508700023"}