{"auto_keywords": [{"score": 0.004494570360108983, "phrase": "snomed_ct_component_history_documentation"}, {"score": 0.004422325007817267, "phrase": "component_history_table"}, {"score": 0.004212453011596424, "phrase": "semantic_changes"}, {"score": 0.00412796126884884, "phrase": "snomed_ct_concepts"}, {"score": 0.003980106938194548, "phrase": "component_history_mechanism"}, {"score": 0.003853115465608543, "phrase": "snomed_ct_concept_model_mechanism"}, {"score": 0.0032629585038738856, "phrase": "problem_list_subset"}, {"score": 0.0030086877092638945, "phrase": "preferred_term"}, {"score": 0.002796782643988021, "phrase": "normal_forms"}, {"score": 0.002406799309495983, "phrase": "new_snomed_ct_releases"}, {"score": 0.0022011501095573747, "phrase": "patient_case_queries"}, {"score": 0.0021569129153653777, "phrase": "patient_records"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["SNOMED CT", " Reference terminology", " Clinical vocabulary", " Versioning"], "paper_abstract": "Purpose: To determine the changes each Systematized Nomenclature of Medicine Clinical Terms (SNOMED CT) release undergoes and the implications of those changes. Methods: (1) We reviewed the SNOMED CT Component History documentation and analyzed the Component History table in detail. (2) We outlined a list of semantic changes that are made to SNOMED CT concepts that are not recorded as part of the Component History mechanism. (3) We reviewed the SNOMED CT Concept Model mechanism and how it has changed since the July 2006 release. We applied the above methods to determine the impact they had on the Clinical Observations Recording and Encoding (CORE) Problem List published by the United States National Library of Medicine National Institutes of Health. Results: Of the 5182 concepts in the problem list subset, 2135 (41.2%) underwent some form of change in the form of (1) fully specified name and preferred term; (2) concept status; (3) primitive/fully defined status, defining attributes and normal forms; and/or (4) position in hierarchy (top-level hierarchy, supertypes and subtypes). Conclusions: In this paper, we have identified four types of changes that occur over time as new SNOMED CT releases are introduced. Keeping track of these changes is important as they are not well published and have an impact in patient case queries and the accuracy of patient records. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Implications of SNOMED CT versioning", "paper_id": "WOS:000290017100007"}