{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.041577008053686304, "phrase": "active_and_passive_measurements"}, {"score": 0.03729306928688609, "phrase": "end-to-end_data"}, {"score": 0.03552824651719228, "phrase": "network_components"}, {"score": 0.027507999683207576, "phrase": "general_topologies"}, {"score": 0.004755054742217193, "phrase": "faulty_components"}, {"score": 0.004066076430818046, "phrase": "novel_approach"}, {"score": 0.0036097844103129043, "phrase": "optimal_sequential_testing"}, {"score": 0.0034118234596993836, "phrase": "optimal_testing_sequence"}, {"score": 0.0031845067058084583, "phrase": "expected_testing_cost"}, {"score": 0.003029962838440681, "phrase": "np"}, {"score": 0.0028986672783671147, "phrase": "recursive_approach"}, {"score": 0.002722468694023035, "phrase": "polynomial-time_optimal_algorithm"}, {"score": 0.00262191949451482, "phrase": "exponential_running_time"}, {"score": 0.0024014759148123736, "phrase": "extensive_simulation"}], "paper_keywords": ["Wireless sensor networks", " fault localization", " sequential testing"], "paper_abstract": "Faulty components in a network need to be localized and repaired to sustain the health of the network. In this paper, we propose a novel approach that carefully combines active and passive measurements to localize faults in wireless sensor networks. More specifically, we formulate a problem of optimal sequential testing guided by end-to-end data. This problem determines an optimal testing sequence of network components based on end-to-end data in sensor networks to minimize expected testing cost. We prove that this problem is NP-hard, and propose a recursive approach to solve it. This approach leads to a polynomial-time optimal algorithm for line topologies while requiring exponential running time for general topologies. We further develop two polynomial-time heuristic schemes that are applicable to general topologies. Extensive simulation shows that our heuristic schemes only require testing a very small set of network components to localize and repair all faults in the network. Our approach is superior to using active and passive measurements in isolation. It also outperforms the state-of-the-art approaches that localize and repair all faults in a network.", "paper_title": "Fault Localization Using Passive End-to-End Measurements and Sequential Testing for Wireless Sensor Networks", "paper_id": "WOS:000299294400008"}