{"auto_keywords": [{"score": 0.047255570665292616, "phrase": "data_warehouse"}, {"score": 0.01571984293069512, "phrase": "uml"}, {"score": 0.012694401365977239, "phrase": "dw"}, {"score": 0.008482719775455897, "phrase": "data_warehouses"}, {"score": 0.007617726030427163, "phrase": "different_aspects"}, {"score": 0.007415521700768048, "phrase": "data_sources"}, {"score": 0.0056839336272295786, "phrase": "different_parts"}, {"score": 0.004766487181100495, "phrase": "unified_process"}, {"score": 0.00413684709497912, "phrase": "dw_architecture"}, {"score": 0.004026670475951216, "phrase": "extracting"}, {"score": 0.003751143724152193, "phrase": "data_marts"}, {"score": 0.0036759314172445934, "phrase": "end_user_tools"}, {"score": 0.0036144035798673967, "phrase": "different_models"}, {"score": 0.0034944094552943, "phrase": "partial_solutions"}, {"score": 0.003299460925313939, "phrase": "whole_development_process"}, {"score": 0.0032332756920184177, "phrase": "integrated_and_coherent_manner"}, {"score": 0.0030220695120265974, "phrase": "data_warehouse_development_method"}, {"score": 0.002971453391894977, "phrase": "unified_modeling_language"}, {"score": 0.0027123819773059127, "phrase": "extension_mechanisms"}, {"score": 0.0023935561037315375, "phrase": "etl_processes"}, {"score": 0.0022145052062614514, "phrase": "seamless_method"}, {"score": 0.002126458181856629, "phrase": "case_study"}], "paper_keywords": ["data warehouse", " design", " UML", " Unified Process"], "paper_abstract": "The design, development and deployment of a data warehouse (DW) is a complex, time consuming and prone to fail task. This is mainly due to the different aspects taking part in a DW architecture such as data sources, processes responsible for Extracting, Transforming and Loading (ETL) data into the DW, the modeling of the DW itself, specifying data marts from the data warehouse or designing end user tools. In the last years, different models, methods and techniques have been proposed to provide partial solutions to cover the different aspects of a data warehouse. Nevertheless, none of these proposals addresses the whole development process of a data warehouse in an integrated and coherent manner providing the same notation for the modeling of the different parts of a DW. In this paper, we propose a data warehouse development method, based on the Unified Modeling Language (UML) and the Unified Process (UP), which addresses the design and development of both the data warehouse back-stage and front-end. We use the extension mechanisms (stereotypes, tagged values and constraints) provided by the UML and we properly extend it in order to accurately model the different parts of a data warehouse (such as the modeling of the data sources, ETL processes or the modeling of the DW itself) by using the same notation. To the best of our knowledge, our proposal provides a seamless method for developing data warehouses. Finally, we apply our approach to a case study to show its benefit.", "paper_title": "Applying the UML and the unified process to the design of data warehouses", "paper_id": "WOS:000241783400003"}