{"auto_keywords": [{"score": 0.0443587048584781, "phrase": "broadband_access"}, {"score": 0.00481495049065317, "phrase": "service_support"}, {"score": 0.0047624624571243465, "phrase": "ieee"}, {"score": 0.0040366412779632085, "phrase": "wide_variety"}, {"score": 0.003970439654470374, "phrase": "established_and_recent_multimedia_applications"}, {"score": 0.0036958398682001015, "phrase": "network_providers"}, {"score": 0.003421245054271364, "phrase": "rural_and_suburban_areas"}, {"score": 0.003328184259386487, "phrase": "slow_deployment"}, {"score": 0.0031669873302916, "phrase": "traditional_wired_technologies"}, {"score": 0.0028360962841331634, "phrase": "broadband_wireless_access_technologies"}, {"score": 0.0025678829712650437, "phrase": "mac_layer"}, {"score": 0.00240328454980006, "phrase": "traffic_categories"}, {"score": 0.0023768935613577985, "phrase": "different_multimedia_requirements"}], "paper_keywords": [""], "paper_abstract": "During the last few years, users all over the world have become more and more accustomed to the availability of broadband access. This has boosted the use of a wide variety both of established and recent multimedia applications. However, there are cases where it is too expensive for network providers to serve a community of users. This is typically the case in rural and suburban areas, where there is slow deployment (or no deployment at all) of traditional wired technologies for broadband access (e.g., cable modems, xDSL). In those cases, the most promising opportunity rests with Broadband Wireless Access technologies, such as the IEEE 802.16, also known as WiMAX. One of the features of the MAC layer of 802.16 is that it is designed to differentiate service among traffic categories with different multimedia requirements. This article focuses on mechanisms that are available in an 802.16 system to support quality of service (QoS) and whose effectiveness is evaluated through simulation.", "paper_title": "Quality of service support in IEEE 802.16 networks", "paper_id": "WOS:000236214100009"}