{"auto_keywords": [{"score": 0.0429841867448742, "phrase": "students'_choice_patterns"}, {"score": 0.042389058155836386, "phrase": "self-explanation_quality"}, {"score": 0.02664484551875223, "phrase": "students'_ability"}, {"score": 0.00481495049065317, "phrase": "controlled_behaviors"}, {"score": 0.004762893197005439, "phrase": "game-based_environment"}, {"score": 0.004610058444728656, "phrase": "strategic_plan"}, {"score": 0.004381962669035583, "phrase": "bandura"}, {"score": 0.004287680323820891, "phrase": "current_work"}, {"score": 0.004002242925856335, "phrase": "game-based_system"}, {"score": 0.003461702544605219, "phrase": "self-explanation_performance"}, {"score": 0.0033262524445013303, "phrase": "higher_quality_self-explanations"}, {"score": 0.003172969962401266, "phrase": "controlled_choice_patterns"}, {"score": 0.003048782877550259, "phrase": "students'_experiences"}, {"score": 0.00295078850927459, "phrase": "controlled_patterns"}, {"score": 0.0028249975318149468, "phrase": "students'_strategic_planning"}, {"score": 0.002684984491718288, "phrase": "choice_pattern"}, {"score": 0.0023388674614404324, "phrase": "controlled_and_disordered_choice_patterns"}, {"score": 0.0022228943786652914, "phrase": "game-based_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Agency", " Stealth assessment", " Entropy", " Adaptive environments", " Game-based learning"], "paper_abstract": "When students exhibit control and employ a strategic plan of action over a situation they are said to be demonstrating agency (Bandura, 2001). The current work is comprised of two studies designed to investigate how agency manifests within students' choice patterns and ultimately influences self-explanation quality within the game-based system iSTART-2. In Study 1, 75 college students interacted freely within iSTART-2 for 2 h. Random walk and Entropy analyses were used to quantify the amount of control demonstrated in students' choice patterns, as well as to determine the relation between variations in these patterns and self-explanation performance within iSTART-2. Overall, students who demonstrated more controlled choice patterns generated higher quality self-explanations compared to students who exhibited more disordered choice patterns. This link between performance and controlled choice patterns is hypothesized to be driven, in part, by students' experiences of agency. That is, engaging in controlled patterns should be advantageous only when doing so is a result of students' strategic planning. In Study 2, this hypothesis was tested by assigning 70 students to a choice pattern (i.e., controlled or disordered) that had been yoked to students from Study 1, thus removing students' ability to exert agency over the 1START-2 system. Results revealed no differences in self-explanation quality between the groups assigned to controlled and disordered choice patterns. Collectively, findings from these studies support the notion that success within game-based systems is related to students' ability to exert agency over their learning paths. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Does agency matter?: Exploring the impact of controlled behaviors within a game-based environment", "paper_id": "WOS:000349723200031"}