{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intra-flow_contention"}, {"score": 0.008640531524639809, "phrase": "multihop_wireless_networks"}, {"score": 0.006677610775928869, "phrase": "multihop_path"}, {"score": 0.004576253356889219, "phrase": "different_qualities"}, {"score": 0.004116139569480336, "phrase": "admission_decision"}, {"score": 0.004064117897000019, "phrase": "new_flow"}, {"score": 0.004012751049253625, "phrase": "expected_bandwidth_consumption"}, {"score": 0.003813669883040509, "phrase": "shared_nature"}, {"score": 0.0037654565082218595, "phrase": "wireless_medium"}, {"score": 0.0033437537557378157, "phrase": "different_hops"}, {"score": 0.0031912706211861324, "phrase": "actual_bandwidth_consumption"}, {"score": 0.002931569771634119, "phrase": "interfering_nodes"}, {"score": 0.0027741761880779535, "phrase": "other's_transmission_range"}, {"score": 0.0025591748412278174, "phrase": "reactive_and_proactive_routing_environments"}, {"score": 0.002360796860462937, "phrase": "carrier-sensing_neighbors"}, {"score": 0.0023210293050850276, "phrase": "high_power_transmissions"}, {"score": 0.002281930100792185, "phrase": "analytical_and_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "previous_approaches"}], "paper_keywords": ["multihop wireless networks", " admission control", " intra-flow contention"], "paper_abstract": "Several applications have been envisioned for multihop wireless networks that require different qualities of service from the network. In order to support such applications, the network must control the admission of flows. To make an admission decision for a new flow, the expected bandwidth consumption of the flow must be correctly determined. Due to the shared nature of the wireless medium, nodes along a multihop path contend among themselves for access to the medium. This leads to intra-flow contention; contention between packets of the same flow forwarded by different hops along a multihop path, resulting in an increase in the actual bandwidth consumption of the flow to a multiple of its single hop bandwidth requirement. Determining the amount of intra-flow contention is non-trivial since interfering nodes may not be able to communicate directly if they are outside each other's transmission range. In this paper we examine methods to determine the extent of intra-flow contention along multihop paths in both reactive and proactive routing environments. The highlight of the solutions is that carrier-sensing data is used to deduce information about carrier-sensing neighbors, and no high power transmissions are necessary. Analytical and simulation results show that our methods estimate intra-flow contention with low error, while significantly reducing overhead, energy consumption and latency as compared to previous approaches.", "paper_title": "Pre-reply probe and route request tail: Approaches for calculation of intra-flow contention in multihop wireless networks", "paper_id": "WOS:000236147100003"}