{"auto_keywords": [{"score": 0.03400226043083397, "phrase": "consumers'_preferences"}, {"score": 0.00481495049065317, "phrase": "contextual_online_learning_for_multimedia_content_aggregation"}, {"score": 0.004709567162738894, "phrase": "tremendous_growth"}, {"score": 0.004539005582217309, "phrase": "multimedia_content"}, {"score": 0.004169692306713217, "phrase": "content_choices"}, {"score": 0.004093453936415085, "phrase": "diverse_preferences"}, {"score": 0.0037602557461171478, "phrase": "consumers'_demand"}, {"score": 0.003705130724701598, "phrase": "multimedia_content_aggregators"}, {"score": 0.0035708152831417104, "phrase": "numerous_multimedia_sources"}, {"score": 0.003531474887552889, "phrase": "key_challenge"}, {"score": 0.003161065111494053, "phrase": "content_characteristics"}, {"score": 0.002935905915691203, "phrase": "multiple_heterogeneous_producers"}, {"score": 0.0027469703311742647, "phrase": "optimal_content_aggregation_strategy"}, {"score": 0.002495268931035983, "phrase": "consumer_types"}, {"score": 0.0023346234464901978, "phrase": "learning_speed"}, {"score": 0.0021522261505574035, "phrase": "illustrative_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_content_aggregation_system"}], "paper_keywords": ["Content aggregation", " distributed online learning", " multi-armed bandits", " social multimedia"], "paper_abstract": "The last decade has witnessed a tremendous growth in the volume as well as the diversity of multimedia content generated by a multitude of sources (news agencies, social media, etc.). Faced with a variety of content choices, consumers are exhibiting diverse preferences for content; their preferences often depend on the context in which they consume content as well as various exogenous events. To satisfy the consumers' demand for such diverse content, multimedia content aggregators (CAs) have emerged which gather content from numerous multimedia sources. A key challenge for such systems is to accurately predict what type of content each of its consumers prefers in a certain context, and adapt these predictions to the evolving consumers' preferences, contexts, and content characteristics. We propose a novel, distributed, online multimedia content aggregation framework, which gathers content generated by multiple heterogeneous producers to fulfill its consumers' demand for content. Since both the multimedia content characteristics and the consumers' preferences and contexts are unknown, the optimal content aggregation strategy is unknown a priori. Our proposed content aggregation algorithm is able to learn online what content to gather and how to match content and users by exploiting similarities between consumer types. We prove bounds for our proposed learning algorithms that guarantee both the accuracy of the predictions as well as the learning speed. Importantly, our algorithms operate efficiently even when feedback from consumers is missing or content and preferences evolve over time. Illustrative results highlight the merits of the proposed content aggregation system in a variety of settings.", "paper_title": "Contextual Online Learning for Multimedia Content Aggregation", "paper_id": "WOS:000351586300008"}