{"auto_keywords": [{"score": 0.0399982426143156, "phrase": "leader_oracle"}, {"score": 0.023873543228953197, "phrase": "optimal_round_complexity"}, {"score": 0.00481495049065317, "phrase": "byzantine_shared_memory"}, {"score": 0.0047527118741586055, "phrase": "byzantine_disk_paxos"}, {"score": 0.003699210979926274, "phrase": "t-tolerant_wait-free_shared_safe_register"}, {"score": 0.0036040894858791793, "phrase": "t-tolerant_regular_register"}, {"score": 0.003311458758488674, "phrase": "finite_number"}, {"score": 0.003236802914194731, "phrase": "termination_condition"}, {"score": 0.003133052778244851, "phrase": "wait-free_consensus"}, {"score": 0.0030924870122337905, "phrase": "fw-terminating_registers"}, {"score": 0.0029933487820771217, "phrase": "t-tolerant_registers"}, {"score": 0.002670667021775741, "phrase": "prior_fw-terminating_constructions"}, {"score": 0.0026019244311765964, "phrase": "tight_lower_bounds"}, {"score": 0.0025598594511194468, "phrase": "invocation_rounds"}, {"score": 0.0025349467677077803, "phrase": "optimal_resilience_reliable_register_constructions"}, {"score": 0.0021049977753042253, "phrase": "actual_failures"}], "paper_keywords": ["shared-memory emulations", " T-tolerant object implementations", " Byzantine failures", " wait freedom", " consensus", " lower bounds"], "paper_abstract": "We present Byzantine Disk Paxos, an asynchronous shared-memory consensus algorithm that uses a collection of n > 3t disks, t of which may fail by becoming non-responsive or arbitrarily corrupted. We give two constructions of this algorithm; that is, we construct two different t-tolerant (i.e., tolerating up to t disk failures) building blocks, each of which can be used, along with a leader oracle, to solve consensus. One building block is a t-tolerant wait-free shared safe register. The second building block is a t-tolerant regular register that satisfies a weaker termination (liveness) condition than wait freedom: its write operations are wait-free, whereas its read operations are guaranteed to return only in executions with a finite number of writes. We call this termination condition finite writes (FW), and show that wait-free consensus is solvable with FW-terminating registers and a leader oracle. We construct each of these t-tolerant registers from n > 3t base registers, t of which can be non-responsive or Byzantine. All the previous t-tolerant wait-free constructions in this model used at least 4t + I fault-prone registers, and we are not familiar with any prior FW-terminating constructions in this model. We further show tight lower bounds on the number of invocation rounds required for optimal resilience reliable register constructions, or more generally, constructions that use less than 4t + 1 fault-prone registers. Our lower bounds show that such constructions are inherently more costly than constructions that use 4t + 1 registers, and that our constructions have optimal round complexity. Furthermore, our wait-free construction is early-stopping, and it achieves the optimal round complexity with any number of actual failures.", "paper_title": "Byzantine disk paxos: optimal resilience with byzantine shared memory", "paper_id": "WOS:000237023500005"}