{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "defined_buying_factors"}, {"score": 0.012258856880948054, "phrase": "service_performance"}, {"score": 0.007689445398790094, "phrase": "trust_building"}, {"score": 0.007588356966464649, "phrase": "financial_management_systems"}, {"score": 0.0053769412823501655, "phrase": "customer_care"}, {"score": 0.0053060913653819155, "phrase": "product_assortment"}, {"score": 0.004230382915464495, "phrase": "e-commerce_websites"}, {"score": 0.004188459638572375, "phrase": "fashion_products"}, {"score": 0.0040554815862903736, "phrase": "trading_confidence"}, {"score": 0.003945467978172845, "phrase": "exploratory_factor_analysis"}, {"score": 0.003880498041409292, "phrase": "buying_factors"}, {"score": 0.003854809457075099, "phrase": "shopping_malls"}, {"score": 0.0037662262006579023, "phrase": "five_headers"}, {"score": 0.003683124192025618, "phrase": "customer_satisfaction"}, {"score": 0.0034660938095219846, "phrase": "confirmatory_factor_analysis"}, {"score": 0.0033895917080039337, "phrase": "repurchase_intentions"}, {"score": 0.0033639840192975835, "phrase": "purchase_information"}, {"score": 0.003319569552937513, "phrase": "shipping_policies"}, {"score": 0.0032757395605609923, "phrase": "pricing_factors"}, {"score": 0.0031164532805849432, "phrase": "correlation_coefficients"}, {"score": 0.002887083738036996, "phrase": "discriminant_validity"}, {"score": 0.0027834145465170292, "phrase": "full_model"}, {"score": 0.0027375275272639933, "phrase": "partial_positive_relationship"}, {"score": 0.0025784931028501375, "phrase": "delivery_policies"}, {"score": 0.0023886223145816376, "phrase": "information_service"}, {"score": 0.0021403049512708494, "phrase": "store_patronage"}], "paper_keywords": ["E-commerce", " Trust building", " Service performance"], "paper_abstract": "The purpose of this study was to examine defined buying factors affecting trust building and service performance in financial management systems such as e-commerce. We conducted a study of 585 people in their 20-30 s who had experience with e-commerce websites and purchased fashion products from Oct. 1. to 30. 2010. The findings are summarized as follows. First, exploratory factor analysis was conducted and defined buying factors in shopping malls on the internet were classified under five headers: purchase information, customer care, shipping policies, product assortment and pricing factors. In this process, four questions were removed. Confirmatory factor analysis confirmed defined buying factors for classification as the purchase information, customer care, shipping policies, product assortment and pricing factors. In this process, three questions were removed. Second, one of the correlation coefficients did not appear in the relationship between factors such as defined buying factors, building trust, and service performance factors. Therefore, discriminant validity between factors was met. Third, by examining the full model, there was a partial positive relationship among defined buying factors, building trust and service performance. In other words, factors such as customer care, delivery policies, and product assortment in defined buying factors affected trading confidence and this confidence was reinforced through the process of building trust. It showed that information service, shipping policies, product assortment and pricing factors in defined buying factors influenced customer satisfaction. Trading confidence positively affected the service performance, which has been strengthened through customer satisfaction. The study also showed that store patronage was significantly associated with repurchase intentions and word-of-mouth, which strengthened repurchase intentions. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "The study of defined buying factors affecting trust building and service performance in financial management systems", "paper_id": "WOS:000320601000005"}