{"auto_keywords": [{"score": 0.04917331388552703, "phrase": "infant_rats"}, {"score": 0.01288745669826183, "phrase": "group_behavior"}, {"score": 0.011556381955817305, "phrase": "simulated_rats"}, {"score": 0.00481495049065317, "phrase": "movement_ecology"}, {"score": 0.00459039896577789, "phrase": "body_morphology"}, {"score": 0.0032850648549389025, "phrase": "three-segmented_rats"}, {"score": 0.003161740194257218, "phrase": "two-segmented_rats"}, {"score": 0.0030285084113651035, "phrase": "one-segmented_rats"}, {"score": 0.002873247913129334, "phrase": "three-segmented_simulated_agents"}, {"score": 0.0028053237950173508, "phrase": "two-segment_agents"}], "paper_keywords": ["Agent-based modeling", " movement ecology", " morphology", " Rattus norvegicus"], "paper_abstract": "Body morphology appears to strongly determine the behavior of infant rats in an arena (May et al., 2006). In this article, we systematically examined the influence of body-flexibility on the group behavior of infant rats (Rattus norvegicus) by comparing one-, two-, and three-segmented simulated rats with 7- and 10-day-old rats in an arena. Simulated rats provided very different fits to 7-day-old rat pups compared with 10-day-old pups. With respect to 7-day-old pups, three-segmented rats were similar on 83% of our metrics, two-segmented rats were similar on 33% of our metrics, and one-segmented rats were similar on 66% of our metrics. Both one- and three-segmented simulated agents matched 7-day-old rats better than two-segment agents, but it is still premature to conclude which of the three simulated agents best matched the 7-day-old rats. However, no group of simulated rats was similar to 10-day-old pups on any metric. Our results suggest that morphology strongly determines behavior in groups of 7-day-old rats, but that other mechanisms, from more active intersegment control to more influential top-down control, are required to explain the group behavior of 10-day-old rats.", "paper_title": "Modeling the influence of morphology on the movement ecology of groups of infant rats (Rattus norvegicus)", "paper_id": "WOS:000294157400004"}