{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_networks"}, {"score": 0.02639791827216152, "phrase": "revenue_efficiency"}, {"score": 0.004678384952779725, "phrase": "efficient_and_effective_online_spectrum_allocation_methods"}, {"score": 0.0045084510240032535, "phrase": "online_fashion"}, {"score": 0.004362572610448878, "phrase": "salsa"}, {"score": 0.004135458387200662, "phrase": "requests_arrival"}, {"score": 0.004084744133085742, "phrase": "poisson_distribution"}, {"score": 0.004001593118269276, "phrase": "online_spectrum_request"}, {"score": 0.0036553070575015344, "phrase": "existing_spectrum_usage"}, {"score": 0.002999955539996569, "phrase": "bid_values"}, {"score": 0.0025338369486914364, "phrase": "semi-arbitrary-arrival_model"}, {"score": 0.002304754792740636, "phrase": "social_efficiency_ratio"}, {"score": 0.0021845387990972543, "phrase": "random-arrival_case"}, {"score": 0.002157697367447098, "phrase": "social_efficiency"}, {"score": 0.0021311850321045767, "phrase": "two-six_times_the_expected_performances"}, {"score": 0.0021049977753042253, "phrase": "celebrated_vcg_mechanism"}], "paper_keywords": ["Wireless networks", " spectrum", " online allocation", " competitive ratio", " social efficiency", " revenue efficiency"], "paper_abstract": "It is imperative to design efficient and effective online spectrum allocation methods since requests for spectrums often come in an online fashion. In this paper, we propose SALSA, strategyproof online spectrum admission for wireless networks. We assume that the requests arrival follows the Poisson distribution. Upon receiving an online spectrum request, our protocol will decide immediately whether to grant its exclusive usage or not, and how much the request should pay. Preempting existing spectrum usage is not allowed. We proposed two protocols that have guaranteed performances for two different scenarios: 1) random-arrival case: the bid values and requested time durations follow some distributions that can be learned, or 2) semi-arbitrary-arrival case: the bid values could be arbitrary, but the request arrival sequence is random. We analytically prove that our protocols are strategyproof, and are both approximately social efficient and revenue efficient. Our extensive simulation results show that they perform almost optimum. Our method for semi-arbitrary-arrival model achieves social efficiency and revenue efficiency almost 20-30 percent of the optimum, while it has been proven that no mechanism can achieve social efficiency ratio better than 1/e similar or equal to 37 percent. Our protocol for the random-arrival case even achieves social efficiency and revenue efficiency two-six times the expected performances by the celebrated VCG mechanism.", "paper_title": "SALSA: Strategyproof Online Spectrum Admissions for Wireless Networks", "paper_id": "WOS:000283718100009"}