{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "tag_snps"}, {"score": 0.03156640042062977, "phrase": "haptagger"}, {"score": 0.013556434014650771, "phrase": "untyped_snps"}, {"score": 0.005226855509746824, "phrase": "existing_methods"}, {"score": 0.004779085953614184, "phrase": "multimarker_haplotypes"}, {"score": 0.004673079747693193, "phrase": "new_framework"}, {"score": 0.004451360793577698, "phrase": "single_snp."}, {"score": 0.004023775199194536, "phrase": "mtmh"}, {"score": 0.0037899595175206143, "phrase": "minimum_subset"}, {"score": 0.0034643747383816164, "phrase": "mtmh_problem"}, {"score": 0.003275531529444081, "phrase": "np"}, {"score": 0.0028301536956600137, "phrase": "official_tagging_tool"}, {"score": 0.0027985291920293127, "phrase": "haploview"}, {"score": 0.0027159094186967247, "phrase": "real_data_sets"}, {"score": 0.002675516297446243, "phrase": "experimental_results"}, {"score": 0.002606264765409507, "phrase": "smaller_set"}, {"score": 0.00244543519230361, "phrase": "linkage_disequilibrium_statistic"}, {"score": 0.002391067964886602, "phrase": "computational_efficiency"}, {"score": 0.002185394402074883, "phrase": "predictive_haplotypes"}, {"score": 0.0021049977753042253, "phrase": "recent_positive_selection"}], "paper_keywords": ["Algorithm", " Haplotype", " Linkage disequilibrium", " NP-hardness", " SNP"], "paper_abstract": "This paper proposes a new framework for the selection of tag SNPs based on haplotypes instead of on a single SNP. The tag SNPs found by this framework form a set of haplotypes completely predictive of the alleles of all untyped SNPs. We refer to this problem as MTMH, which is defined as follows: given a set of SNPs, find a minimum subset of SNPs (called tag SNPs) which defines a set of haplotypes completely predictive of the alleles of all untyped SNPs. The MTMH problem is solved by dividing into three subproblems, two of which are shown to be NP-hard. Several exact and approximation algorithms are proposed to solve these subproblems. We describe a framework which integrates these algorithms and develop a program called HapTagger for finding tag SNPs. HapTagger is compared with existing methods as well as the official tagging tool (called Haploview) of the International HapMap project using a variety of real data sets. Our theoretical analysis and experimental results indicate that HapTagger consistently identifies a smaller set of tag SNPs and runs much faster than existing methods. HapTagger avoids the need of incorporating a linkage disequilibrium statistic and thus significantly improves the computational efficiency. We also present an algorithm (specific to HapTagger) for reconstructing alleles of untyped SNPs. It is worth mentioning that these predictive haplotypes selected by HapTagger can be used as signatures of recent positive selection or co-evolution. HapTagger is available athttp://www.csie.ntu.edu.tw/-kmchao/tools/HapTagger/. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "A new framework for the selection of tag SNPs by multimarker haplotypes", "paper_id": "WOS:000261220500010"}