{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "facial_expressions"}, {"score": 0.017923970460774888, "phrase": "boundary_precision"}, {"score": 0.009725164961966213, "phrase": "perceptual_categorization"}, {"score": 0.008730010897316173, "phrase": "categorical_perception"}, {"score": 0.006343909310817495, "phrase": "general_cognitive_maturation"}, {"score": 0.0045726187330434025, "phrase": "present_paper"}, {"score": 0.004231699728933577, "phrase": "french-speaking_children"}, {"score": 0.0035497797026638033, "phrase": "identification_slope"}, {"score": 0.0033883824438527316, "phrase": "significant_effect"}, {"score": 0.002841971477743441, "phrase": "different_perceptual_domains"}, {"score": 0.0027126684113045756, "phrase": "specific_effects"}, {"score": 0.0025361866386341774, "phrase": "reading_performances"}, {"score": 0.0023467391904246834, "phrase": "comparative_data"}, {"score": 0.002137947680862631, "phrase": "domain-specific_effects"}, {"score": 0.0021049977753042253, "phrase": "structural_complexity"}], "paper_keywords": ["Categorical perception", " Boundary precision", " Development", " Voice onset time", " Colors", " Facial expressions"], "paper_abstract": "The aim of the present paper was to compare the development of perceptual categorization of voicing, colors and facial expressions in French-speaking children (from 6 to 8 years) and adults. Differences in both categorical perception, i.e. the correspondence between identification and discrimination performances, and in boundary precision, indexed by the steepness of the identification slope, were investigated. Whereas there was no significant effect of age on categorical perception, boundary precision increased with age, both for voicing and facial expressions though not for colors. These results suggest that the development of boundary precision arises from a general cognitive maturation across different perceptual domains. However, this is not without domain specific effects since we found (1) a correlation between the development of voicing perception and some reading performances and (2) an earlier maturation of boundary precision for colors compared to voicing and facial expressions. These comparative data indicate that whereas general cognitive maturation has some influence on the development of perceptual categorization, this is not without domain-specific effects, the structural complexity of the categories being one of them. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Categorical perception of voicing, colors and facial expressions: A developmental study", "paper_id": "WOS:000287561300011"}