{"auto_keywords": [{"score": 0.0044289730051264116, "phrase": "unified_approach"}, {"score": 0.003678023470672862, "phrase": "natural_scenes"}, {"score": 0.0033828748627992193, "phrase": "closed-loop-based_mosaicing_algorithm"}, {"score": 0.003111336942540226, "phrase": "multi-resolution_representations"}, {"score": 0.002997735656669146, "phrase": "interesting_areas"}, {"score": 0.0027570267191549774, "phrase": "moving_objects"}, {"score": 0.0025355968118803956, "phrase": "motion_information"}, {"score": 0.002331909406363425, "phrase": "modified_active_contour_algorithm"}, {"score": 0.002267708463966758, "phrase": "dmp_construction_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["panoramic representation", " video mosaicing", " multi-resolution", " moving object extraction"], "paper_abstract": "This paper presents a unified approach to automatically build dynamic and multi-resolution 360 degrees panoramic (DMP) representations from image sequences captured by hand-held cameras mainly undertaking rotation and zooming for natural scenes with moving targets. A simple (yet stable) rigid motion model and a closed-loop-based mosaicing algorithm are proposed to generate cylindrical mosaics automatically. Multi-resolution representations are built for interesting areas by separating zooming sub-sequences from a pan/zoom sequence. Moving objects are detected and separated from images based on motion information, and then more accurate contours are extracted using a modified active contour algorithm. The DMP construction method is fast, robust, and automatic, achieving five frames per second for image sequences with 384x288 color images on a Pentium III 800 MHz PC. The construction of the DMP representation can be used in virtual reality, video surveillance, and very low bit-rate video coding, (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Fast construction of dynamic and multi-resolution 360 degrees panoramas from video sequences", "paper_id": "WOS:000234957200002"}