{"auto_keywords": [{"score": 0.04036528755803364, "phrase": "temporal_awareness"}, {"score": 0.007740489563401459, "phrase": "conversational_robots"}, {"score": 0.007339483904754688, "phrase": "text_entry_tasks"}, {"score": 0.004492094831481931, "phrase": "interaction_success"}, {"score": 0.004403874076980828, "phrase": "low_tolerance"}, {"score": 0.004374852170791322, "phrase": "long_pauses"}, {"score": 0.004218602458288531, "phrase": "high-workload_tasks"}, {"score": 0.003948613642680196, "phrase": "conversational_robot"}, {"score": 0.003820144626025562, "phrase": "task_performance"}, {"score": 0.003732702104052828, "phrase": "laboratory_experiment"}, {"score": 0.0035052810710060893, "phrase": "clock_display"}, {"score": 0.003368816076401138, "phrase": "operator's_time-dependent_tasks"}, {"score": 0.003153041030690117, "phrase": "operator's_temporal_awareness"}, {"score": 0.002789528662623221, "phrase": "text_entry"}, {"score": 0.0027619548979328154, "phrase": "important_task"}, {"score": 0.0027256122357680393, "phrase": "social_robots"}, {"score": 0.0025935242726503964, "phrase": "first_experiment"}, {"score": 0.002294369814584028, "phrase": "touch-typing_operators"}, {"score": 0.0021049977753042253, "phrase": "operator's_perceived_workload"}], "paper_keywords": ["Situation awareness", " social robots", " teleoperation", " time estimation"], "paper_abstract": "Awareness of time is particularly important for teleoperation of conversational robots, both for controlling the robot and for estimating interaction success, because people have a low tolerance for long pauses in conversation. Findings have shown that people engaged in high-workload tasks tend to underestimate the passage of time. This study confirms that this problem exists for operators controlling a conversational robot, and it investigates mechanisms for improving temporal awareness and task performance while minimizing workload. In a laboratory experiment, two approaches to helping an operator perform various information input tasks were compared: first, assisting temporal awareness by using a clock display, and second, using autonomy to assist one of the operator's time-dependent tasks. Results revealed that assisting the task itself, even without the clock, improved not only task performance but also the operator's temporal awareness. However, results regarding the effect of the clock were ambiguous: it increased workload in general and did not help temporal awareness overall, but it did improve temporal awareness for text entry tasks in particular. As text entry is an important task for teleoperation of social robots, we further investigated the problem of improving temporal awareness during text entry tasks. As the first experiment suggested the effectiveness of a clock, we further validated that the clock is specifically useful to improve temporal awareness. These results showed that the clock did not increase workload for text entry tasks; however, for touch-typing operators, the results suggested that showing a clock after the end of an interaction, rather than continuously throughout the task, could lower the operator's perceived workload.", "paper_title": "Temporal Awareness in Teleoperation of Conversational Robots", "paper_id": "WOS:000305584400010"}