{"auto_keywords": [{"score": 0.03967711273542651, "phrase": "subfield's_specialist_journals"}, {"score": 0.010532719391652949, "phrase": "reference_analysis"}, {"score": 0.007059323507941905, "phrase": "earlier_studies"}, {"score": 0.00481495049065317, "phrase": "scientific_journal_categories"}, {"score": 0.004429727701202369, "phrase": "scientific_subfields"}, {"score": 0.004281125387210667, "phrase": "thomson_scientific's"}, {"score": 0.004090682761004765, "phrase": "first_step"}, {"score": 0.00393844255111604, "phrase": "particular_wos_journal_category"}, {"score": 0.003720600007408015, "phrase": "second_step"}, {"score": 0.0031246358910995316, "phrase": "mesh_descriptors"}, {"score": 0.003101004637768834, "phrase": "medline"}, {"score": 0.0030542703032534766, "phrase": "expert_opinion"}, {"score": 0.002996840657035727, "phrase": "proposed_methodology"}, {"score": 0.0029629009627331355, "phrase": "high_precision"}, {"score": 0.0027671619871474764, "phrase": "retrieved_papers"}, {"score": 0.0026640466056415298, "phrase": "research_topics"}, {"score": 0.002574523719093119, "phrase": "bibliometric_ranking"}, {"score": 0.002497470177389344, "phrase": "citation_impact"}, {"score": 0.002314752262613559, "phrase": "additional_journals"}, {"score": 0.002288519595829552, "phrase": "weak_correlations"}, {"score": 0.0021453734588569823, "phrase": "research_groups"}, {"score": 0.0021049977753042253, "phrase": "scientific_subfield"}], "paper_keywords": [""], "paper_abstract": "This paper explores a methodology for delimitating scientific subfields by combining the use of (specialist) journal categories from Thomson Scientific's Web of Science (WoS) and reference analysis. In a first step it selects all articles in journals included in a particular WoS journal category covering a subfield. These journals are labelled as a subfield's specialist journals. In a second step, this set of papers is expanded with papers published in other, additional journals and citing a subfield's specialist journals with a frequency exceeding a certain citation threshold. Data are presented for two medical subfields: Oncology and Cardiac & Cardiovascular System. A validation based on findings from earlier studies, from an analysis of MESH descriptors from MEDLINE, and on expert opinion provides evidence that the proposed methodology has a high precision, and that expansion substantially enhanced the recall, not merely in terms of the number of retrieved papers, but also in terms of the number of research topics covered. The paper also examines how a bibliometric ranking of countries and universities based on the citation impact of their papers published in a subfield's specialist journals compares to that of a ranking based on the impact of their articles in additional journals. Rather weak correlations especially obtained at the level of universities underline the conclusion from earlier studies that an assessment of research groups or universities in a scientific subfield that takes into account solely papers published in a subfield's specialist journals is unsatisfactory.", "paper_title": "Expansion of scientific journal categories using reference analysis: How can it be done and does it make a difference?", "paper_id": "WOS:000266914500002"}