{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "predicate_encryption"}, {"score": 0.007740489563401459, "phrase": "cloud_computing"}, {"score": 0.004595356579614969, "phrase": "fine-grained_control"}, {"score": 0.004489327204473076, "phrase": "encrypted_data"}, {"score": 0.0042446888127531945, "phrase": "public_key"}, {"score": 0.0040890178236849825, "phrase": "private_key_owner"}, {"score": 0.0032370412139943808, "phrase": "remote_untrusted_storages"}, {"score": 0.003206916619690171, "phrase": "encrypted_webmail_search"}, {"score": 0.0031770714776989282, "phrase": "biometric_matching"}, {"score": 0.0026598200370569433, "phrase": "specified_time_period"}, {"score": 0.0025264171945423254, "phrase": "search_privacy_protection"}, {"score": 0.0025028892126605124, "phrase": "time_trigger"}, {"score": 0.002388487669097511, "phrase": "cloud_storages"}, {"score": 0.002226592967032469, "phrase": "specified_time"}, {"score": 0.0021649437083408425, "phrase": "formal_proofs"}, {"score": 0.0021049977753042253, "phrase": "chosen_ciphertext_attack"}], "paper_keywords": ["Predicate encryption", " Cloud computing", " IND-CCA security", " Attribute hiding", " Timed- Release property"], "paper_abstract": "Predicate encryption is a novel cryptographic primitive that provides fine-grained control over the accesses to encrypted data. In predicate encryption, a message can be encrypted with a public key and a set of attributes. The private key owner uses his own private key to generate a secret token corresponding to a predicate. An evaluator can take the secret token to decrypt ciphertexts if and only if the set of attributes of the ciphertexts satisfies the predicate of the secret token. Predicate encryption could be used in cloud computing such as remote untrusted storages and encrypted webmail search. Biometric matching could also be constructed by predicate encryption. In this manuscript, we first propose an extension of predicate encryption, called timed-release predicate encryption. The evaluator decrypts the ciphertexts that satisfy the predicate only after a specified time period in our construction. Therefore, our proposed encryption scheme can provide not only ciphertext retrieval with search privacy protection but time trigger. It could be used in the applications of cloud storages and networks that need to seal the secret delegated events or happenings before a specified time. We also provide the formal proofs of IND-CCA (indistinguishability under chosen ciphertext attack) security, attribute hiding, and timed-release properties for the construction.", "paper_title": "Timed-Release Predicate Encryption and Its Extensions in Cloud Computing", "paper_id": "WOS:000336885500010"}