{"auto_keywords": [{"score": 0.049378038061471514, "phrase": "social_media"}, {"score": 0.014037595433624385, "phrase": "trust-constructing_procedure"}, {"score": 0.012812021194918541, "phrase": "ss"}, {"score": 0.00481495049065317, "phrase": "rumors_spread"}, {"score": 0.004423284899590467, "phrase": "multi-layered_communication"}, {"score": 0.003858697684681798, "phrase": "social_layer"}, {"score": 0.003705130724701598, "phrase": "communicating_layer"}, {"score": 0.0035184576341236317, "phrase": "sbtbm"}, {"score": 0.0027982016314450717, "phrase": "social_layers"}, {"score": 0.0025796799784169196, "phrase": "spreading_core"}, {"score": 0.0023091050327751746, "phrase": "cs"}, {"score": 0.002258212866482022, "phrase": "core_forms"}, {"score": 0.0021601997088758957, "phrase": "social_behaviors"}], "paper_keywords": ["Social Media", " Social Structure", " Communication Structure", " Trust-Building Mechanism", " Rumor-Spreading", " Rumor-Stopping"], "paper_abstract": "In this paper, we present a multi-layered communication (MLC) model that includes a trust-constructing procedure that can be used to explain how rumors spread and stop over social media. We define two structures in our MLC model: the social structure (SS) in the social layer, and the communication structure (CS) in the communicating layer. We propose two trust-building mechanisms (TBM): the social-based TBM (SBTBM) and the communicating-aimed TBM (CATBM). We discuss the trust-constructing procedure to demonstrate that an individual will sequentially decide to spread information based on three factors: the opinion environment, the individual's social influence, and the cost to confirm the information. The model predicts that individuals will tend to create links with others in social layers to extend their social structures (social clustering principle) when they use social media. Thus, a rumor will spread because a spreading core is formed in the CS. However, a rumor will be stopped by interactions that occur in the SS. Our empirical case supports this prediction. We analyzed the topology of CS to indicate how a spreading core forms and CS evolves, and how a rumor stops spreading because social behaviors in SS encourage the development of more accurate information based on reality.", "paper_title": "How Rumors Spread and Stop over Social Media: a Multi-Layered Communication Model and Empirical Analysis", "paper_id": "WOS:000381274600019"}