{"auto_keywords": [{"score": 0.03712654330339069, "phrase": "computational_complexity"}, {"score": 0.015719716506582538, "phrase": "global_constraints"}, {"score": 0.01553464792979029, "phrase": "constraint_propagation"}, {"score": 0.004454377387615279, "phrase": "constraint_programming"}, {"score": 0.00429715240295033, "phrase": "fast_algorithms"}, {"score": 0.0036993855514735746, "phrase": "quadratic_cost"}, {"score": 0.0036553070575015344, "phrase": "binary_constraints"}, {"score": 0.0032814236411444022, "phrase": "important_questions"}, {"score": 0.002841545331522694, "phrase": "different_questions"}, {"score": 0.0025354258731826148, "phrase": "specific_global_constraints"}, {"score": 0.0023033100935570755, "phrase": "lesser_level"}, {"score": 0.0022758279600841014, "phrase": "local_consistency"}, {"score": 0.0021049977753042253, "phrase": "decomposing_constraints"}], "paper_keywords": ["global constraints", " computational complexity", " constraint propagation", " generalized arc consistency"], "paper_abstract": "Constraint propagation is one of the techniques central to the success of constraint programming. To reduce search, fast algorithms associated with each constraint prune the domains of variables. With global (or non-binary) constraints, the cost of such propagation may be much greater than the quadratic cost for binary constraints. We therefore study the computational complexity of reasoning with global constraints. We first characterise a number of important questions related to constraint propagation. We show that such questions are intractable in general, and identify dependencies between the tractability and intractability of the different questions. We then demonstrate how the tools of computational complexity can be used in the design and analysis of specific global constraints. In particular, we illustrate how computational complexity can be used to determine when a lesser level of local consistency should be enforced, when constraints can be safely generalized, when decomposing constraints will reduce the amount of pruning, and when combining constraints is tractable.", "paper_title": "The complexity of reasoning with global constraints", "paper_id": "WOS:000246520900004"}