{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pedigree_graphs"}, {"score": 0.022979149705141644, "phrase": "genetic_distances"}, {"score": 0.013909263984545894, "phrase": "phylogenetic_trees"}, {"score": 0.009833968840278522, "phrase": "blood_relationships"}, {"score": 0.004199247711875386, "phrase": "n_nodes"}, {"score": 0.0038470175104007524, "phrase": "pedigree_graph"}, {"score": 0.003784328428527216, "phrase": "directed_acyclic_graph"}, {"score": 0.003702323283528696, "phrase": "maximum_indegree"}, {"score": 0.0028305047329728254, "phrase": "phylogenetic_networks"}, {"score": 0.0027996401456881806, "phrase": "similar_data_structures"}, {"score": 0.00221153232497724, "phrase": "time_algorithm"}, {"score": 0.0021049977753042253, "phrase": "distance_matrix"}], "paper_keywords": ["algorithm", " directed acyclic graph", " distance matrix", " pedigree", " genetic distance"], "paper_abstract": "In this paper, we study a problem of inferring blood relationships which satisfy a given matrix of genetic distances between all pairs of n nodes. Blood relationships are represented by our proposed graph class, which is called a pedigree graph. A pedigree graph is a directed acyclic graph in which the maximum indegree is at most two. We show that the number of pedigree graphs which satisfy the condition of given genetic distances may be exponential, but they can be represented by one directed acyclic graph with n nodes. Moreover, an O(n(3)) time algorithm which solves the problem is also given. Although phylogenetic trees and phylogenetic networks are similar data structures to pedigree graphs, it seems that inferring methods for phylogenetic trees and networks cannot be applied to infer pedigree graphs since nodes of phylogenetic trees and networks represent species whereas nodes of pedigree graphs represent individuals. We also show an O(n(2)) time algorithm which detects a contradiction between a given pedigree graph and distance matrix of genetic distances.", "paper_title": "Inferring pedigree graphs from genetic distances", "paper_id": "WOS:000253655800002"}