{"auto_keywords": [{"score": 0.00478218760286811, "phrase": "medical_ultrasound_imaging"}, {"score": 0.004637478829869904, "phrase": "design_and_experimental_evaluation"}, {"score": 0.004528058970767382, "phrase": "cmos"}, {"score": 0.00448179813172021, "phrase": "capacitive_micro-machined_ultrasound_transducers"}, {"score": 0.004405919996432158, "phrase": "medical_ultrasound_imaging_systems"}, {"score": 0.004287166497171827, "phrase": "inverter-based_cascode_amplifier"}, {"score": 0.004200197763119297, "phrase": "continuous_time_amplifier"}, {"score": 0.0041149859710361125, "phrase": "charge_sampling_amplifier"}, {"score": 0.004031495920060339, "phrase": "proposed_front-end_amplifiers"}, {"score": 0.00388278852285898, "phrase": "frequency_bandwidth"}, {"score": 0.0038170129089059013, "phrase": "centre_frequency"}, {"score": 0.003701401653850141, "phrase": "continuous_time"}, {"score": 0.003688773272422118, "phrase": "single-ended_transimpedance_amplifier"}, {"score": 0.0028349323966217386, "phrase": "input_signal_frequency"}, {"score": 0.0026839372202435065, "phrase": "sampling_clock_frequency"}, {"score": 0.0024893297856666808, "phrase": "peak-to-peak_output_signal_amplitude"}, {"score": 0.0021560599270125944, "phrase": "csa"}, {"score": 0.0021049977753042253, "phrase": "single_cmut_element"}], "paper_keywords": ["Inverter-based amplifier", " Ultrasound front-end", " Charge sampling", " Self-biased CSA", " Medical imaging", " CMOS"], "paper_abstract": "In this paper, we present the design and experimental evaluation of 1 V analog front-end amplifiers designed in 90 nm CMOS technology for capacitive micro-machined ultrasound transducers (CMUTs) for medical ultrasound imaging systems. We propose two front-end amplifier topologies based on an inverter-based cascode amplifier; the first is a continuous time amplifier and the second is a charge sampling amplifier (CSA). The proposed front-end amplifiers are designed to amplify the signals from CMUTs in the frequency bandwidth from 15 to 45 MHz with a centre frequency of 30 MHz. From the measurements, the continuous time single-ended transimpedance amplifier achieves a voltage gain of 19 dB, an output noise power spectral density of 0.042 (mu V)/SQRT(Hz) at a centre-frequency of 30 MHz, and a total harmonic distortion of -23 dB at 450 mV p-p output voltage at 30 MHz input signal frequency. It draws only 598 mu A per amplifier from a 1 V power supply. Its area measured only about 32 mu m x 32 mu m per amplifier. On the other hand, a sampling based front-end amplifier [CSA] achieves a transfer gain of 17.4 dB at an input signal frequency of 30 MHz and an upper 3 dB cut-off frequency of 46 MHz at a sampling clock frequency of 100 MHz. It consumes 586 mu A per amplifier from a 1 V power supply and achieves a signal-to-noise (SNR) ratio of 45.7 dB with a peak-to-peak output signal amplitude of 500 mV at a sampling frequency of 100 MHz. It occupies an area of 1470.2 mu m(2) (which is equivalent to 38 mu m x 38 mu m), which also includes the area of the switches for the CSA that will be used for the single CMUT element.", "paper_title": "Inverter-based 1 V analog front-end amplifiers in 90 nm CMOS for medical ultrasound imaging", "paper_id": "WOS:000288165500009"}