{"auto_keywords": [{"score": 0.042403964177785004, "phrase": "experimental_configuration"}, {"score": 0.026635325123366388, "phrase": "proposed_classification"}, {"score": 0.00481495049065317, "phrase": "software_engineering"}, {"score": 0.00465067040500426, "phrase": "important_role"}, {"score": 0.0046184900568047565, "phrase": "experimental_disciplines"}, {"score": 0.004414653335578912, "phrase": "se_experiments"}, {"score": 0.004323620278409076, "phrase": "baseline_experiment_materials"}, {"score": 0.0038419751490849133, "phrase": "new_experiment"}, {"score": 0.0037366473207825234, "phrase": "se_experiment_replication"}, {"score": 0.003378385493203297, "phrase": "research_approach"}, {"score": 0.0031955979242589494, "phrase": "experiment_replication"}, {"score": 0.0030650070965891653, "phrase": "typical_elements"}, {"score": 0.0029499784768149146, "phrase": "different_replications_purposes"}, {"score": 0.002849146732780381, "phrase": "experiment_replications"}, {"score": 0.0028293966058473476, "phrase": "se._results"}, {"score": 0.0024704333220467393, "phrase": "opposing_views"}, {"score": 0.0024447807655923926, "phrase": "broader_framework"}, {"score": 0.002336655334451466, "phrase": "baseline_experiment"}, {"score": 0.002225542510652775, "phrase": "different_types"}, {"score": 0.0021947755130109696, "phrase": "special_verification_purposes"}, {"score": 0.002171979107594173, "phrase": "different_degrees"}, {"score": 0.002134508934917511, "phrase": "replication_type"}, {"score": 0.0021049977753042253, "phrase": "particular_experimental_conditions"}], "paper_keywords": ["Software engineering", " Experimental software engineering", " Experimentation", " Replication"], "paper_abstract": "Context: Replication plays an important role in experimental disciplines. There are still many uncertainties about how to proceed with replications of SE experiments. Should replicators reuse the baseline experiment materials? How much liaison should there be among the original and replicating experimenters, if any? What elements of the experimental configuration can be changed for the experiment to be considered a replication rather than a new experiment? Objective: To improve our understanding of SE experiment replication, in this work we propose a classification which is intend to provide experimenters with guidance about what types of replication they can perform. Method: The research approach followed is structured according to the following activities: (1) a literature review of experiment replication in SE and in other disciplines, (2) identification of typical elements that compose an experimental configuration, (3) identification of different replications purposes and (4) development of a classification of experiment replications for SE. Results: We propose a classification of replications which provides experimenters in SE with guidance about what changes can they make in a replication and, based on these, what verification purposes such a replication can serve. The proposed classification helped to accommodate opposing views within a broader framework, it is capable of accounting for less similar replications to more similar ones regarding the baseline experiment. Conclusion: The aim of replication is to verify results, but different types of replication serve special verification purposes and afford different degrees of change. Each replication type helps to discover particular experimental conditions that might influence the results. The proposed classification can be used to identify changes in a replication and, based on these, understand the level of verification. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Understanding replication of experiments in software engineering: A classification", "paper_id": "WOS:000337261800012"}