{"auto_keywords": [{"score": 0.044758819762876066, "phrase": "medical_digital_libraries"}, {"score": 0.04161409503940423, "phrase": "digital_library"}, {"score": 0.00473342222806555, "phrase": "canada"}, {"score": 0.004698920043417216, "phrase": "usa"}, {"score": 0.004664379282680899, "phrase": "uk."}, {"score": 0.004562847483469705, "phrase": "system_design"}, {"score": 0.0040873794710724965, "phrase": "healthcare_professionals"}, {"score": 0.003998380230709541, "phrase": "author's_definition"}, {"score": 0.003920891569777891, "phrase": "online_database"}, {"score": 0.0037796097990025167, "phrase": "suitable_medical_digital_libraries"}, {"score": 0.003715425273229361, "phrase": "scholarly_databases"}, {"score": 0.003697287104870263, "phrase": "online_search_engines"}, {"score": 0.0036167509502276294, "phrase": "university_web_sites"}, {"score": 0.0035990927554317813, "phrase": "selection_preference"}, {"score": 0.003385480888810982, "phrase": "user's_perspective"}, {"score": 0.003368948014436942, "phrase": "six_distinct_areas"}, {"score": 0.0030696773722514105, "phrase": "unique_set"}, {"score": 0.0030101325901285537, "phrase": "different_services"}, {"score": 0.002973503319954633, "phrase": "relevant_material"}, {"score": 0.0027225697292481165, "phrase": "user_comments"}, {"score": 0.002617932741303421, "phrase": "excellent_conduit"}, {"score": 0.00255458149409373, "phrase": "intensive_resources"}, {"score": 0.0022711450865389093, "phrase": "online_users"}, {"score": 0.0021731423856364003, "phrase": "overall_improvement"}, {"score": 0.0021625170763342957, "phrase": "existing_and_future_medical_digital_libraries"}, {"score": 0.002125735077004312, "phrase": "first_ever_evaluation"}, {"score": 0.0021049977753042253, "phrase": "freely_available_medical_digital_libraries"}], "paper_keywords": ["digital libraries", " information retrieval", " medical libraries", " user studies"], "paper_abstract": "Purpose - The purpose of this paper is to identify two medical digital libraries from each of the following three countries: Canada, the USA and the UK. It aims to discuss strengths and weaknesses in system design in an effort to provide a basis on which to improve both the organisation of, and the access to, electronic, scholarly information. Design/methodology/approach - Inclusion criteria for identifying the medical digital libraries were, those who: had primarily text-based collections, intended for use by researchers or healthcare professionals; were freely accessible, and fulfilled the author's definition of a digital library as opposed to an online database. (Medical digital libraries with either a historical focus or that had primarily image/video collections were excluded.) To identify suitable medical digital libraries, the following resources were used: scholarly databases, online search engines, government and national library web sites, lists of online medical resources, and university web sites. Selection preference was given to those libraries with the most recent launch dates and service features. Each library was systematically evaluated, qualitatively and quantitatively, from the user's perspective in six distinct areas: administrative overview and site architecture, knowledge organisation, results management, interaction with the collection, additional information services, usability, and personalisation. Findings - The study finds that each digital library had a unique set of strengths and weaknesses. Each offered different services to help users identify relevant material and to quickly understand and assess their contents. However, this required that each library have a team of experts to obtain, assess, catalogue, and annotate the information. Where available, user comments were supportive of each effort and very positive. Research limitations/implications - Medical digital libraries are an excellent conduit between authors and practitioners. However, they require intensive resources for establishment and maintenance. For these libraries to realise their full potential, emphasis must be placed on the currency and quality of their collections, maintaining pace with the technology employed by their users, providing services that facilitate the access and digestion of complex, scholarly information, and ensuring that online users are aware of the existence of these libraries. Practical implications - This paper contributes to the overall improvement of existing and future medical digital libraries. Originality/value - This is the first ever evaluation and comparison of freely available medical digital libraries from three countries.", "paper_title": "The medical digital library landscape", "paper_id": "WOS:000252554200002"}