{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_engineers"}, {"score": 0.04222279703077682, "phrase": "basic_views"}, {"score": 0.004727837281331949, "phrase": "successful_software_development"}, {"score": 0.00393852508392789, "phrase": "individual_engineers"}, {"score": 0.003265591844292821, "phrase": "empirical_study"}, {"score": 0.0032064196784562017, "phrase": "ten_different_swedish_software_development_companies"}, {"score": 0.0028340217672278975, "phrase": "extensive_statistical_analyses"}, {"score": 0.0026704265616705023, "phrase": "software_engineering_attitudes"}, {"score": 0.002634031703695684, "phrase": "tested_individuals"}, {"score": 0.002539379289856756, "phrase": "larger_sample"}, {"score": 0.0024819522818492284, "phrase": "general_population"}, {"score": 0.0023067494372458427, "phrase": "associated_statistical_analyses"}, {"score": 0.0022238315004700607, "phrase": "complex_factors"}, {"score": 0.002203570941628287, "phrase": "software_engineering_projects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software engineering", " Human factors", " Personality", " Attitudes", " Empirical study", " Statistical analysis"], "paper_abstract": "Context: Successful software development and management depends not only on the technologies. methods and processes employed but also on the judgments and decisions of the humans involved. These, in turn, are affected by the basic views and attitudes of the individual engineers. Objective: The objective of this paper is to establish if these views and attitudes can be linked to the personalities of software engineers. Methods: We summarize the literature on personality and software engineering and then describe an empirical study on 47 professional engineers in ten different Swedish software development companies. The study evaluated the personalities of these engineers via the IPIP 50-item five-factor personality test and prompted them on their attitudes towards and basic views on their professional activities. Results: We present extensive statistical analyses of their responses to show that there are multiple, significant associations between personality factors and software engineering attitudes. The tested individuals are more homogeneous in personality than a larger sample of individuals from the general population. Conclusion: Taken together, the methodology and personality test we propose and the associated statistical analyses can help find and quantify relations between complex factors in software engineering projects in both research and practice. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Links between the personalities, views and attitudes of software engineers", "paper_id": "WOS:000278150500003"}