{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "multi-objective_optimization"}, {"score": 0.015719804254231088, "phrase": "milp"}, {"score": 0.01135797807583316, "phrase": "pareto_solutions"}, {"score": 0.00450933377534525, "phrase": "environmental_problems"}, {"score": 0.004392569642205692, "phrase": "moo"}, {"score": 0.004195418010131832, "phrase": "useful_technique"}, {"score": 0.004140726362519362, "phrase": "environmental_engineering"}, {"score": 0.003752550907120244, "phrase": "environmental_objectives"}, {"score": 0.00266693888510356, "phrase": "novel_mixed-integer_linear_program"}, {"score": 0.002530359917257626, "phrase": "systematic_manner_groups"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-objective optimization", " Clustering methods", " Pareto solutions", " Environmental objectives", " Life cycle assessment"], "paper_abstract": "Multi-objective optimization (MOO) has recently emerged as a useful technique in environmental engineering. One major limitation of this approach is that its computational burden grows rapidly with the number of environmental objectives, which causes difficulties regarding the computation and visualization of the Pareto solutions. In this work we present several theoretical and algorithmic developments for grouping environmental objectives into clusters on the basis of which the multi-objective optimization can be performed, thereby facilitating the computation and analysis of the Pareto solutions. Our method is based on a novel mixed-integer linear program (MILP) that identifies in a systematic manner groups of objectives that behave similarly. We test the capabilities of our approach using several examples, in which we compare it against other well-known clustering methods. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "MILP-based clustering method for multi-objective optimization: Application to environmental problems", "paper_id": "WOS:000321441400017"}