{"auto_keywords": [{"score": 0.031763843900136826, "phrase": "conjunctive_queries"}, {"score": 0.00481495049065317, "phrase": "web-based_marketplace_services"}, {"score": 0.00464439568459231, "phrase": "pricing_data"}, {"score": 0.004450568197899267, "phrase": "explicit_views"}, {"score": 0.004378182273895574, "phrase": "specific_price"}, {"score": 0.003703611021999795, "phrase": "pricing_function"}, {"score": 0.0036433294654548056, "phrase": "arbitrage-free_and_discount-free_properties"}, {"score": 0.003525683527473192, "phrase": "unique_function"}, {"score": 0.0034342984674830533, "phrase": "seller's_explicit_prices"}, {"score": 0.0033016282588376397, "phrase": "query_determinacy"}, {"score": 0.0027833043858224078, "phrase": "explicit_prices"}, {"score": 0.0027289810731258865, "phrase": "selection_views"}, {"score": 0.00268452026617243, "phrase": "common_practice"}, {"score": 0.0026148807877309417, "phrase": "polynomial_time_data"}, {"score": 0.002472822097373027, "phrase": "problem_to_network_flow"}, {"score": 0.0024405312482831646, "phrase": "cyclic_queries"}, {"score": 0.0023003498123420237, "phrase": "data_complexity"}, {"score": 0.002233756874366828, "phrase": "np"}, {"score": 0.0021398811716327273, "phrase": "pricing_problem"}, {"score": 0.0021049977753042253, "phrase": "selection_queries"}], "paper_keywords": ["Algorithms", " Economics", " Theory", " Data pricing", " arbitrage", " query determinacy"], "paper_abstract": "Data is increasingly being bought and sold online, and Web-based marketplace services have emerged to facilitate these activities. However, current mechanisms for pricing data are very simple: buyers can choose only from a set of explicit views, each with a specific price. In this article, we propose a framework for pricing data on the Internet that, given the price of a few views, allows the price of any query to be derived automatically. We call this capability query-based pricing. We first identify two important properties that the pricing function must satisfy, the arbitrage-free and discount-free properties. Then, we prove that there exists a unique function that satisfies these properties and extends the seller's explicit prices to all queries. Central to our framework is the notion of query determinacy, and in particular instance-based determinacy: we present several results regarding the complexity and properties of it. When both the views and the query are unions of conjunctive queries or conjunctive queries, we show that the complexity of computing the price is high. To ensure tractability, we restrict the explicit prices to be defined only on selection views (which is the common practice today). We give algorithms with polynomial time data complexity for computing the price of two classes of queries: chain queries (by reducing the problem to network flow), and cyclic queries. Furthermore, we completely characterize the class of conjunctive queries without self-joins that have PTIME data complexity, and prove that pricing all other queries is NP-complete, thus establishing a dichotomy on the complexity of the pricing problem when all views are selection queries.", "paper_title": "Query-Based Data Pricing", "paper_id": "WOS:000364039500011"}