{"auto_keywords": [{"score": 0.04553668893926096, "phrase": "software_projects"}, {"score": 0.010612387000973441, "phrase": "software_development_effort"}, {"score": 0.005487721053048796, "phrase": "proposed_method"}, {"score": 0.004446958354683721, "phrase": "heterogeneous_datasets"}, {"score": 0.0042373381286051354, "phrase": "analogy_based_estimation"}, {"score": 0.004153910878671754, "phrase": "widely_accepted_estimation_method"}, {"score": 0.004106974681603632, "phrase": "great_deal"}, {"score": 0.004049046499912914, "phrase": "inconsistent_and_non-normal_datasets"}, {"score": 0.003991932110277654, "phrase": "comparison-based_method"}, {"score": 0.003760685138103153, "phrase": "prior_studies"}, {"score": 0.003697100573612401, "phrase": "weighting_methods"}, {"score": 0.0036761446421770564, "phrase": "outlier_elimination_techniques"}, {"score": 0.003634587156159668, "phrase": "soft_computing_methods"}, {"score": 0.003593497768069278, "phrase": "proposed_methods"}, {"score": 0.0033660587983313536, "phrase": "special_domain"}, {"score": 0.003216358543603351, "phrase": "comparison_and_weighting_processes"}, {"score": 0.0031529693013776852, "phrase": "main_idea"}, {"score": 0.003099627849370732, "phrase": "hybrid_model"}, {"score": 0.0029871209444889716, "phrase": "key_attributes"}, {"score": 0.0027506009796522245, "phrase": "weighting_system"}, {"score": 0.0027194778713860715, "phrase": "project_attributes"}, {"score": 0.0027040482680875605, "phrase": "different_clusters"}, {"score": 0.0026810674110409596, "phrase": "different_weights"}, {"score": 0.002635688414237179, "phrase": "new_project"}, {"score": 0.002532761069408219, "phrase": "related_clusters"}, {"score": 0.0025040966350544135, "phrase": "common_attributes"}, {"score": 0.002372298201966367, "phrase": "proposed_model"}, {"score": 0.0022926465161639633, "phrase": "proposed_localization"}, {"score": 0.0021049977753042253, "phrase": "wide_range"}], "paper_keywords": ["ABE", " PSO", " Clustering", " Effort estimation", " Localization"], "paper_abstract": "The estimation of software development effort has been centralized mostly on the accuracy of estimates through dealing with heterogeneous datasets regardless of the fact that the software projects are inherently complex and uncertain. In particular, Analogy Based Estimation (ABE), as a widely accepted estimation method, suffers a great deal from the problem of inconsistent and non-normal datasets because it is a comparison-based method and the quality of comparisons strongly depends on the consistency of projects. In order to overcome this problem, prior studies have suggested the use of weighting methods, outlier elimination techniques and various types of soft computing methods. However the proposed methods have reduced the complexity and uncertainty of projects, the results are not still convincing and the methods are limited to a special domain of software projects, which causes the generalization of methods to be impossible. Localization of comparison and weighting processes through clustering of projects is the main idea behind this paper. A hybrid model is proposed in which the software projects are divided into several clusters based on key attributes (development type, organization type and development platform). A combination of ABE and Particle Swarm Optimization (PSO) algorithm is used to design a weighting system in which the project attributes of different clusters are given different weights. Instead of comparing a new project with all the historical projects, it is only compared with the projects located in the related clusters based on the common attributes. The proposed method was evaluated through three real datasets that include a total of 505 software projects. The performance of the proposed model was compared with other well-known estimation methods and the promising results showed that the proposed localization can considerably improve the accuracy of estimates. Besides the increase in accuracy, the results also certified that the proposed method is flexible enough to be used in a wide range of software projects.", "paper_title": "A flexible method to estimate the software development effort based on the classification of projects and localization of comparisons", "paper_id": "WOS:000336388500003"}