{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "brain_machine"}, {"score": 0.004671588539217021, "phrase": "man_machine_interfaces"}, {"score": 0.004056769841308405, "phrase": "brain_activity"}, {"score": 0.003935892934907777, "phrase": "neural_signals"}, {"score": 0.0034003686971964707, "phrase": "space_science"}, {"score": 0.003073988343893906, "phrase": "intended_actions"}, {"score": 0.002982307044758515, "phrase": "external_devices"}, {"score": 0.0027929100418926725, "phrase": "electroencephalographic_signals"}, {"score": 0.0027370835853738626, "phrase": "prominent_role"}, {"score": 0.0025503112711036994, "phrase": "brief_survey"}, {"score": 0.0024125253170522816, "phrase": "different_approach"}, {"score": 0.002282166507956957, "phrase": "control_signals"}, {"score": 0.0021697677572213086, "phrase": "gaze_tracking"}, {"score": 0.0021479597698614355, "phrase": "working_principles"}, {"score": 0.0021049977753042253, "phrase": "typical_features"}], "paper_keywords": [""], "paper_abstract": "A great demand for brain machine and, more generally, man machine interfaces is arising nowadays, pushed by several promising scientific and technological results, which are encouraging the concentration of efforts in this field. The possibility of measuring, processing and decoding brain activity, so as to interpret neural signals, is often looked at as a possibility to bypass lost or damaged neural and/or motor structures. Beyond that, such interfaces currently show a potential for applications in other fields, space science being certainly one of them. At present, the concept of \"reading\" the brain to detect intended actions and use these to control external devices is being studied with several technical and methodological approaches; among these, interfaces based on electroencephalographic signals play today a prominent role. Within such a context, the aim of this section is to present a brief survey on two types of noninvasive man machine interfaces based on a different approach. In particular, they rely on the extraction of control signals from the user with techniques that adopt electromyography and gaze tracking. Working principles, implementations, typical features, and applications of these two types of interfaces are reported.", "paper_title": "EMG-BASED AND GAZE-TRACKING-BASED MAN-MACHINE INTERFACES", "paper_id": "WOS:000297655300003"}