{"auto_keywords": [{"score": 0.04289640444279873, "phrase": "multicast_stream"}, {"score": 0.014354522408900162, "phrase": "multicast_data"}, {"score": 0.010116487071630835, "phrase": "nash_equilibrium"}, {"score": 0.008676879903460933, "phrase": "polynomial-time_algorithm"}, {"score": 0.00481495049065317, "phrase": "network-coded_multicast_streaming"}, {"score": 0.004624337472244542, "phrase": "capacity_allocation_game"}, {"score": 0.004218602458288531, "phrase": "multihop_network"}, {"score": 0.004157058883925715, "phrase": "fractional_multicast_streaming"}, {"score": 0.0039341294012600085, "phrase": "particular_receiver"}, {"score": 0.0037921662574137535, "phrase": "multiple_paths"}, {"score": 0.0033712944392793195, "phrase": "individual_receivers"}, {"score": 0.003213920601037463, "phrase": "multicast_capacity_allocation"}, {"score": 0.0028153046221865386, "phrase": "relay_nodes"}, {"score": 0.002511803988580901, "phrase": "socially_optimum_solution"}, {"score": 0.0021520139248317333, "phrase": "efficient_nash_equilibrium_allocation_solutions"}, {"score": 0.0021049977753042253, "phrase": "randomly_generated_network_topologies"}], "paper_keywords": ["Capacity allocation game", " multicast streaming"], "paper_abstract": "In this paper, we formulate and study a capacity allocation game between a set of receivers (players) that are interested in receiving multicast data (video/multimedia) being streamed from a server through a multihop network. We consider fractional multicast streaming, where the multicast stream from the source (origin-server) to any particular receiver (end-user) can be split over multiple paths. The receivers are selfish and noncooperative, but must collaboratively purchase capacities of links in the network, as necessary for delivery of the multicast stream from the source to the individual receivers, assuming that the multicast stream is network-coded. For this multicast capacity allocation (network formation) game, we show that the Nash equilibrium is guaranteed to exist in general. For a 2-tier network model where the receivers must obtain the multicast data from the source through a set of relay nodes, we show that the price of stability is at most 2, and provide a polynomial-time algorithm that computes a Nash equilibrium whose social cost is within a factor of 2 of the socially optimum solution. For more general network models, we show that there exists a 2-approximate Nash equilibrium, whose cost is at most two times the social optimum. We also give a polynomial-time algorithm that computes a (2+epsilon)-approximate Nash equilibrium for any epsilon > 0 , whose cost is at most two times the social optimum. Simulation studies show that our algorithms generate efficient Nash equilibrium allocation solutions for a vast majority of randomly generated network topologies.", "paper_title": "Capacity Allocation Games for Network-Coded Multicast Streaming", "paper_id": "WOS:000335821100019"}