{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.02894041209761437, "phrase": "nutrient_flux"}, {"score": 0.004761132425263795, "phrase": "proto-cell_stationary_growth"}, {"score": 0.00462919213721188, "phrase": "generic_proto-cell_model"}, {"score": 0.0045262653692203815, "phrase": "conservative_chemical_reaction_network"}, {"score": 0.00413684709497912, "phrase": "chemical_species"}, {"score": 0.003378385493203297, "phrase": "membrane_precursor"}, {"score": 0.0028695095228791724, "phrase": "simple_necessary_condition"}, {"score": 0.002651960559564796, "phrase": "sufficient_condition"}, {"score": 0.0025638362414466278, "phrase": "stationary_growth_regime"}, {"score": 0.0024097920845706795, "phrase": "membrane_precursor_incorporation_kinetics"}, {"score": 0.0021529842700733974, "phrase": "chemical_reaction_kinetics"}, {"score": 0.0021288561076024844, "phrase": "membrane_parameters"}, {"score": 0.0021049977753042253, "phrase": "nutrient_flux_diffusion_characteristics"}], "paper_keywords": ["proto-cell", " chemical reaction network"], "paper_abstract": "We consider a generic proto-cell model consisting of any conservative chemical reaction network embedded within a membrane. The membrane results from the self-assembly of one of the chemical species (membrane precursor) and is semi-permeable to some other chemical species (nutrients) diffusing from an outside growth medium into the proto-cell. Inside the proto-cell, nutrients are metabolized into all other chemical species including the membrane precursor, and the membrane grows in area and the proto-cell in volume. Investigating the conditions under which such a proto-cell may reach stationary growth, we prove that a simple necessary condition is that each moiety be fed with some nutrient flux; and that a sufficient condition for the existence of a stationary growth regime is that every siphon containing any species participating in the membrane precursor incorporation kinetics also contains the support of a moiety that is fed with some nutrient flux. These necessary and sufficient conditions hold regardless of chemical reaction kinetics, membrane parameters or nutrient flux diffusion characteristics.", "paper_title": "On Necessary and Sufficient Conditions for Proto-cell Stationary Growth", "paper_id": "WOS:000361966300002"}