{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_cognitive_maps"}, {"score": 0.004776853267973129, "phrase": "density_estimate"}, {"score": 0.004645860180714466, "phrase": "convenient_and_widely_used_architectures"}, {"score": 0.004447201233380302, "phrase": "great_deal"}, {"score": 0.004257000695796238, "phrase": "area_concern_strategies"}, {"score": 0.003916098498242888, "phrase": "resulting_fcms"}, {"score": 0.0037784540167266497, "phrase": "human_experts"}, {"score": 0.0030000149283621255, "phrase": "novel_learning_approach"}, {"score": 0.0029762350325031207, "phrase": "sparse_real-coded_genetic_algorithms"}, {"score": 0.0028037753646260937, "phrase": "density_parameter"}, {"score": 0.0026518169452004465, "phrase": "comparative_tests"}, {"score": 0.002548331088496964, "phrase": "suitable_density_estimate"}, {"score": 0.0025180781216911246, "phrase": "srcga_method"}, {"score": 0.002391067964886602, "phrase": "new_method"}, {"score": 0.0023346234464901978, "phrase": "automated_fashion"}, {"score": 0.0023069016803337365, "phrase": "default_value"}], "paper_keywords": ["Fuzzy cognitive maps (FCMs)", " real-coded genetic algorithms (RCGAs)"], "paper_abstract": "Fuzzy cognitive maps (FCMs) are convenient and widely used architectures for modeling dynamic systems, which are characterized by a great deal of flexibility and adaptability. Several recent works in this area concern strategies for the development of FCMs. Although a few fully automated algorithms to learn these models from data have been introduced, the resulting FCMs are structurally considerably different than those developed by human experts. In particular, maps that were learned from data are much denser (with the density over 90% versus about 40% density of maps developed by humans). The sparseness of the maps is associated with their interpretability: the smaller the number of connections is, the higher is the transparency of the map. To this end, a novel learning approach, sparse real-coded genetic algorithms (SRCGAs), to learn FCMs is proposed. The method utilizes a density parameter to guide the learning toward a formation of maps of a certain predefined density. Comparative tests carried out for both synthetic and real-world data demonstrate that, given a suitable density estimate, the SRCGA method significantly outperforms other state-of-the-art learning methods. When the density estimate is unknown, the new method can be used in an automated fashion using a default value, and it is still able to produce models whose performance exceeds or is equal to the performance of the models generated by other methods.", "paper_title": "Learning of Fuzzy Cognitive Maps Using Density Estimate", "paper_id": "WOS:000304163200026"}