{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hirsch's_h-index"}, {"score": 0.004478782833067256, "phrase": "scientist's_research_work"}, {"score": 0.0036479584876742085, "phrase": "appreciable_attempt"}, {"score": 0.0035609154384221567, "phrase": "objective_problems"}, {"score": 0.0034342161742428666, "phrase": "large_scale"}, {"score": 0.003352256019007896, "phrase": "comparative_evaluation"}, {"score": 0.0028823939507764238, "phrase": "truly_useful_indications"}, {"score": 0.002616762777413686, "phrase": "egghe's_g-indexes"}, {"score": 0.0025697460140513932, "phrase": "italian_university_researchers"}, {"score": 0.0025235718883452585, "phrase": "hard_sciences"}, {"score": 0.002448446849997207, "phrase": "descriptive_statistics"}, {"score": 0.0022909325048608054, "phrase": "robust_benchmarks"}], "paper_keywords": [""], "paper_abstract": "The use of Hirsch's h-index as a joint proxy of the impact and productivity of a scientist's research work continues to gain ground, accompanied by the efforts of bibliometrists to resolve some of its critical issues through the application of a number of more or less sophisticated variants. However, the literature does not reveal any appreciable attempt to overcome the objective problems of measuring h-indexes on a large scale for purposes of comparative evaluation. Scientists may succeed in calculating their own h-indexes but, being unable to compare them to those of their peers, they are unable to obtain truly useful indications of their individual research performance. This study proposes to overcome this gap, measuring the h- and Egghe's g-indexes of all Italian university researchers in the hard sciences over a 5-year window. Descriptive statistics are provided concerning all of the 165 subject fields examined, offering robust benchmarks for those who wish to compare their individual performance to those of their colleagues in the same subject field.", "paper_title": "A Robust Benchmark for the h- and g-Indexes", "paper_id": "WOS:000277892600014"}