{"auto_keywords": [{"score": 0.039523307941736044, "phrase": "clickthrough_data"}, {"score": 0.015620458067193326, "phrase": "image_search_clickthrough_data"}, {"score": 0.006433596226600325, "phrase": "search_term"}, {"score": 0.00481495049065317, "phrase": "implicit_judgments"}, {"score": 0.0046781613377273774, "phrase": "search_engines"}, {"score": 0.0046038458731764926, "phrase": "implicit_relevance_feedback"}, {"score": 0.004063116219782945, "phrase": "subsequent_search_results"}, {"score": 0.003597181536943779, "phrase": "completely_accurate_measure"}, {"score": 0.003330746760940307, "phrase": "mutual_relevance"}, {"score": 0.0032256239062596944, "phrase": "user_study"}, {"score": 0.0030839851024657395, "phrase": "previous_similar_studies"}, {"score": 0.003054450075234415, "phrase": "major_difference"}, {"score": 0.0030058503645435455, "phrase": "previous_work"}, {"score": 0.0029203055813347874, "phrase": "image_searches"}, {"score": 0.0027830917623582903, "phrase": "prior_works"}, {"score": 0.002610090005760493, "phrase": "image_search"}, {"score": 0.002370493290982407, "phrase": "image_clickthrough_data"}, {"score": 0.0023178219772486868, "phrase": "relevance_feedback_measure"}, {"score": 0.0022663183381878044, "phrase": "traditional_text-based_search"}, {"score": 0.0021876814398268775, "phrase": "search_system"}, {"score": 0.0021528432044086044, "phrase": "click_data"}, {"score": 0.0021049977753042253, "phrase": "information-seeking_capacity"}], "paper_keywords": ["relevance", " web mining"], "paper_abstract": "The interactions of users with search engines can be seen as implicit relevance feedback by the user on the results offered to them. In particular, the selection of results by users can be interpreted as a confirmation of the relevance of those results, and used to reorder or prioritize subsequent search results. This collection of search/result pairings is called clickthrough data, and many uses for it have been proposed. However, the reliability of clickthrough data has been challenged and it has been suggested that clickthrough data are not a completely accurate measure of relevance between search term and results. This paper reports on an experiment evaluating the reliability of clickthrough data as a measure of the mutual relevance of search term and result. The experiment comprised a user study involving over 67 participants and determines the reliability of image search clickthrough data, using factors identified in previous similar studies. A major difference in this work to previous work is that the source of clickthrough data comes from image searches, rather than the traditional text page searches. Image search clickthrough data were rarely examined in prior works but has differences that impact the accuracy of clickthrough data. These differences include a more complete representation of the results in image search, allowing users to scrutinize the results more closely before selecting them, as well as presenting the results in a less obviously ordered way. The experiment reported here demonstrates that image clickthrough data can be more reliable as a relevance feedback measure than has been the case with traditional text-based search. There is also evidence that the precision of the search system influences the accuracy of click data when users make searches in an information-seeking capacity.", "paper_title": "Evaluating implicit judgments from image search clickthrough data", "paper_id": "WOS:000311853600008"}