{"auto_keywords": [{"score": 0.049407782669650485, "phrase": "e-government_development"}, {"score": 0.03166181073351054, "phrase": "information_infrastructure"}, {"score": 0.006770900289885845, "phrase": "complementary_role"}, {"score": 0.006354713289125388, "phrase": "political_stability"}, {"score": 0.006177996829741743, "phrase": "regulatory_quality"}, {"score": 0.004582722012454012, "phrase": "resource_complementarity_perspective"}, {"score": 0.004486640769041646, "phrase": "resource-based_view"}, {"score": 0.0038953958723049287, "phrase": "government_effectiveness"}, {"score": 0.003287482882222731, "phrase": "publicly_available_archival_data"}, {"score": 0.0030630037175103032, "phrase": "hypothesized_model"}, {"score": 0.002640114583897493, "phrase": "positive_direction"}, {"score": 0.0021049977753042253, "phrase": "theoretical_discourse"}], "paper_keywords": ["diffusion of innovation", " World Wide Web", " (countries and regions)"], "paper_abstract": "Drawing from the resource complementarity perspective of the resource-based view of a firm, this study examines the complementary role of governance dimensionsnamely, voice and accountability, political stability, government effectiveness, regulatory quality, rule of law, and control of corruptionon the relationship between information infrastructure in a country and its e-government development. Based on publicly available archival data from 178 countries, our results provide support for the hypothesized model. Specifically, whereas political stability, government effectiveness, and rule of law moderated the relationship of information infrastructure with e-government development in a positive direction, voice and accountability and control of corruption moderated the relationship negatively. Further, the relationship between information infrastructure and e-government development was not contingent on regulatory quality. Our findings contribute to the theoretical discourse on e-government development by highlighting the complementary role of governance and provide suggestions for practice in managing e-government development by enhancing governance, thereby leveraging the effect of information infrastructure on e-government development.", "paper_title": "Moderating effects of governance on information infrastructure and e-government development", "paper_id": "WOS:000308888400004"}