{"auto_keywords": [{"score": 0.04972711494665694, "phrase": "sensor_networks"}, {"score": 0.015719716506582538, "phrase": "access_control"}, {"score": 0.01074605054283321, "phrase": "sensor_node"}, {"score": 0.010435409021063343, "phrase": "base_station"}, {"score": 0.009768583151088181, "phrase": "existing_solutions"}, {"score": 0.008465128499941429, "phrase": "multi-access_query"}, {"score": 0.004692227830462433, "phrase": "promising_computing_paradigm"}, {"score": 0.004623503587186056, "phrase": "physical_environment"}, {"score": 0.004489046493029801, "phrase": "hostile_situations"}, {"score": 0.004374593906165761, "phrase": "network_access_control"}, {"score": 0.004154332348800334, "phrase": "sensor_data"}, {"score": 0.004108589735101849, "phrase": "natural_idea"}, {"score": 0.0040334640350288, "phrase": "centralized_design"}, {"score": 0.003989046949801574, "phrase": "access_request"}, {"score": 0.0039016690475620185, "phrase": "trusted_base_station"}, {"score": 0.0034540850937966336, "phrase": "uni-access_query"}, {"score": 0.002777595758483679, "phrase": "privilege_delegation"}, {"score": 0.0025606791601860543, "phrase": "public_key_cryptography"}, {"score": 0.0025230952890994236, "phrase": "additional_feature"}, {"score": 0.0023958326775913165, "phrase": "single_query"}, {"score": 0.0021601997088758957, "phrase": "theoretical_analysis"}, {"score": 0.0021049977753042253, "phrase": "proposed_schemes"}], "paper_keywords": ["Access control", " Sensor networks"], "paper_abstract": "Sensor networks are a promising computing paradigm for monitoring the physical environment and providing observations for various uses. In hostile situations, it is critical to enforce network access control to ensure the integrity, availability, and at times confidentiality of the sensor data. A natural idea is to adopt a centralized design where every access request from users goes through a trusted base station. However, this idea is not practical due to the cost and efficiency issues. This paper proposes two efficient and distributed access control methods, uni-access query and multi-access query. The uni-access query uses only symmetric cryptographic operations; it allows (1) a user to directly access the data on any sensor node in the network without going through the base station and (2) a sensor to protect its data so that only authorized users can access. Compared to existing solutions, this scheme is much more flexible and efficient. In addition, this scheme can also support privilege delegation, which allows a user to delegate all or part of its privilege to others without using the base station. The multi-access query applies public key cryptography to provide an additional feature, which allows a user to access the data on many sensor nodes via a single query. Compared to existing solutions that require a user to send at least one request for every sensor node to be queried, the multi-access query reduces the communication overhead significantly. The theoretical analysis and simulation evaluation show that the proposed schemes are practical for access control in sensor networks.", "paper_title": "Efficient and distributed access control for sensor networks", "paper_id": "WOS:000283584100005"}