{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ict"}, {"score": 0.020786169011423383, "phrase": "student_teachers"}, {"score": 0.008655896406051383, "phrase": "korea"}, {"score": 0.008595181785790555, "phrase": "singapore"}, {"score": 0.006554103858451056, "phrase": "teacher_educators"}, {"score": 0.004455061431809975, "phrase": "pedagogical_beleifs"}, {"score": 0.004078502325220629, "phrase": "particular_focus"}, {"score": 0.004021267064832957, "phrase": "school_students"}, {"score": 0.003992950134435965, "phrase": "ict_related_policies"}, {"score": 0.003760137090849196, "phrase": "net_generation_student_teachers"}, {"score": 0.0037073529462522403, "phrase": "six_factors"}, {"score": 0.003322540556404882, "phrase": "ict_use"}, {"score": 0.0030521898646210413, "phrase": "fairly_constructivisit_beliefs"}, {"score": 0.0030306762103395842, "phrase": "positive_computer_efficacy"}, {"score": 0.0029150253706493852, "phrase": "student_teachers'_perceptions"}, {"score": 0.0028437313714204087, "phrase": "personal_purposes"}, {"score": 0.002658863179011018, "phrase": "empirical_evidence"}, {"score": 0.002640114583897493, "phrase": "students_teachers"}, {"score": 0.002612238631882345, "phrase": "constructivisit_beliefs"}, {"score": 0.0025846562485378247, "phrase": "strong_computer_efficacy"}, {"score": 0.002548331088496964, "phrase": "positive_attitudes"}, {"score": 0.0024423826953133844, "phrase": "future_teaching_practices"}, {"score": 0.0021885820862000962, "phrase": "generational_assumptions"}, {"score": 0.0021501863832966966, "phrase": "structural_and_technological_changes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Net Generation", " ICT", " Past experience"], "paper_abstract": "The aim of this study is to investigate the complexity of past experiences with ICT, pedagogical beleifs, and attitude toward ICT in education that the Net Generation student teachers have about their lived intention to teach and learn with technology. This study has a particular focus on their lived experiences as school students where ICT related policies were actively enacted in Korea and Singapore for the past decade. To unpack the profile of the Net Generation student teachers, we selected six factors (i.e., past ICT experiences, personal computer use, constructivisit belief, computer efficacy, attitude toward computer in education, and prospective computer use) related to ICT use and examined them empirically with 225 first- or second-year student teachers in Korea and Singapore. Overall, our findings indicate that student teachers in both countries tend to hold fairly constructivisit beliefs and positive computer efficacy and attitude: attributes that teacher educators can tap on. Student teachers' perceptions about their use of computers for personal purposes and their past experiences with ICT were not relatively high compared to the other variables examined. This study also provides empirical evidence that students teachers who hold constructivisit beliefs, have strong computer efficacy, and show positive attitudes toward computers in education are more interested in using computers in future teaching practices. As a conclusion, we argue that the profile of the Net Generation student teachers shows a more heterogeneous composition than we initially expected, and that teacher educators need to be cautious about making generational assumptions solely based on the structural and technological changes. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Little experience with ICT: Are they really the Net Generation student-teachers?", "paper_id": "WOS:000309307300016"}