{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_risks"}, {"score": 0.0076430558615737405, "phrase": "global_it_projects"}, {"score": 0.004155113657645735, "phrase": "multiple_locations"}, {"score": 0.004047141845635495, "phrase": "multiple_standards"}, {"score": 0.0033480035183418642, "phrase": "agile_risk-management_framework"}, {"score": 0.003312901888725435, "phrase": "global_it_project_settings"}, {"score": 0.003226744277130179, "phrase": "dynamic_interactions"}, {"score": 0.002798662730881037, "phrase": "project_elements"}, {"score": 0.002640947693258573, "phrase": "global_it_project"}, {"score": 0.0025586903829811296, "phrase": "service-oriented_architecture"}, {"score": 0.0024144659350277954, "phrase": "agile_management_strategies"}, {"score": 0.002326938965568362, "phrase": "mitigation_strategies"}, {"score": 0.0022544399432457164, "phrase": "proposed_framework"}, {"score": 0.00218419478369074, "phrase": "potential_risks"}], "paper_keywords": ["Global IT project", " dynamic risk", " agile risk management processes", " multiplicity", " SOA"], "paper_abstract": "Risk management in global information technology (IT) projects is becoming a critical area of concern for practitioners. Global IT projects usually span multiple locations involving various culturally diverse groups that use multiple standards and technologies. These multiplicities cause dynamic risks through interactions among internal (i.e., people, process, and technology) and external elements (i.e., business and natural environments) of global IT projects. This study proposes an agile risk-management framework for global IT project settings. By analyzing the dynamic interactions among multiplicities (e. g., multi-locations, multi-cultures, multi-groups, and multi-interests) embedded in the project elements, we identify the dynamic risks threatening the success of a global IT project. Adopting the principles of service-oriented architecture (SOA), we further propose a set of agile management strategies for mitigating the dynamic risks. The mitigation strategies are conceptually validated. The proposed framework will help practitioners understand the potential risks in their global IT projects and resolve their complex situations when certain types of dynamic risks arise.", "paper_title": "MANAGING DYNAMIC RISKS IN GLOBAL IT PROJECTS: AGILE RISK-MANAGEMENT USING THE PRINCIPLES OF SERVICE-ORIENTED ARCHITECTURE", "paper_id": "WOS:000329048600004"}