{"auto_keywords": [{"score": 0.04849105041601803, "phrase": "rearrangement_events"}, {"score": 0.02322730111336097, "phrase": "gr-aligner"}, {"score": 0.020942503144405676, "phrase": "breakpoint_regions"}, {"score": 0.004694700982410345, "phrase": "pairwise_genomic_sequences"}, {"score": 0.004577440795549049, "phrase": "homologous_genomic_sequences"}, {"score": 0.004481954307639453, "phrase": "different_rearrgement_events"}, {"score": 0.004406994912939125, "phrase": "specific_patterns"}, {"score": 0.003883194688426525, "phrase": "nucleotide_level"}, {"score": 0.0036914757355166966, "phrase": "related_studies"}, {"score": 0.003479692058963528, "phrase": "neighboring_sequences"}, {"score": 0.0034359094594153304, "phrase": "local_alignment_tools"}, {"score": 0.0032800186243040663, "phrase": "discontinuous_alignments"}, {"score": 0.0032250961348210473, "phrase": "detailed_alignments"}, {"score": 0.003117986133774198, "phrase": "global_alignment_tools"}, {"score": 0.0029020077365708966, "phrase": "conserved_regions"}, {"score": 0.00284137141260141, "phrase": "consistent_order"}, {"score": 0.0026782279715171866, "phrase": "effective_and_efficient_pairwise_sequence_alignment_algorithm"}, {"score": 0.0023794391656001466, "phrase": "homologously_rearranged_sequences"}, {"score": 0.0021228663458966813, "phrase": "possible_evolutionary_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "biological_functionalities"}], "paper_keywords": [""], "paper_abstract": "Motivation: Homologous genomic sequences between species usually contain different rearrgement events. Whether some specific patterns existed in the breakpoint regions that caused such events to occur is still unclear. To resolve this question, it is necessary to determine the location of breakpoints at the nucleotide level. The availability of sequences near breakpoints would further facilitate the related studies. We thus need a tool that can identify breakpoints and align the neighboring sequences. Although local alignment tools can detect rearrangement events, they only report a set of discontinuous alignments, where the detailed alignments in the breakpoint regions are usually missing. Global alignment tools are even less appropriate for these tasks since most of them are designed to align the conserved regions between sequences in a consistent order, i.e. they do not consider rearrangement events. Results: We propose an effective and efficient pairwise sequence alignment algorithm, called GR-Aligner (Genomic Rearrangement Aligner), which can find breakpoints of rearrangement events by integrating the forward and reverse alignments of the breakpoint regions flanked by homologously rearranged sequences. In addition, GR-Aligner also provides an option to view the alignments of sequences extended to the breakpoints. These outputs provide materials for studying possible evolutionary mechanisms and biological functionalities of the rearrangement.", "paper_title": "GR-Aligner: an algorithm for aligning pairwise genomic sequences containing rearrangement events", "paper_id": "WOS:000269196000007"}