{"auto_keywords": [{"score": 0.04016157518902182, "phrase": "lis_articles"}, {"score": 0.004402973626416765, "phrase": "interdisciplinary_changes"}, {"score": 0.004328576620172571, "phrase": "information_science"}, {"score": 0.004095323392273661, "phrase": "lis_researchers"}, {"score": 0.003760685138103153, "phrase": "lis-related_institutes"}, {"score": 0.0035884057190258066, "phrase": "lis"}, {"score": 0.0033517342967390065, "phrase": "direct_citations"}, {"score": 0.0026507289852980512, "phrase": "decreasing_tendency"}, {"score": 0.002583713580625699, "phrase": "direct_citation"}, {"score": 0.002539978170928796, "phrase": "authorship_analysis"}, {"score": 0.002433843373780471, "phrase": "bibliographic_coupling_analysis"}, {"score": 0.002187464225869713, "phrase": "single_bibliometric_method"}], "paper_keywords": [""], "paper_abstract": "This study uses three bibliometric methods: direct citation, bibliographic coupling, and co-authorship analysis, to investigate interdisciplinary changes in library and information science (LIS) from 1978 to 2007. The results reveal that LIS researchers most frequently cite publications in their own discipline. In addition, half of all co-authors of LIS articles are affiliated with LIS-related institutes. The results confirm that the degree of interdisciplinarity within LIS has increased, particularly co-authorship. However, the study found sources of direct citations in LIS articles are widely distributed across 30 disciplines, but co-authors of LIS articles are distributed across only 25 disciplines. The degree of interdisciplinarity was found ranging from 0.61 to 0.82 with citation to references in all articles being the highest and that of co-authorship being the lowest. Percentages of contribution attributable to LIS show a decreasing tendency based on the results of direct citation and co-authorship analysis, but an increasing tendency based on those of bibliographic coupling analysis. Such differences indicate each of the three bibliometric methods has its strength and provides insights respectively for viewing various aspects of interdisciplinarity, suggesting the use of no single bibliometric method can reveal all aspects of interdisciplinarity due to its multifaceted nature.", "paper_title": "A Study of the Evolution of Interdisciplinarity in Library and Information Science: Using Three Bibliometric Methods", "paper_id": "WOS:000302158800003"}