{"auto_keywords": [{"score": 0.041765365816587144, "phrase": "medication_frequency"}, {"score": 0.012315754777167679, "phrase": "medication_adherence"}, {"score": 0.00481495049065317, "phrase": "complex_prescriptions"}, {"score": 0.004552981066668676, "phrase": "poor_medication_adherence"}, {"score": 0.004417848254181138, "phrase": "increased_complications"}, {"score": 0.004305203085016233, "phrase": "chronic_patients"}, {"score": 0.004035946043145475, "phrase": "patients'_medication_compliance"}, {"score": 0.003949974260471287, "phrase": "published_studies"}, {"score": 0.003816197777388722, "phrase": "patients'_lifestyle"}, {"score": 0.0036553070575015344, "phrase": "medication_schedule"}, {"score": 0.003157174936641705, "phrase": "medication_timing"}, {"score": 0.00306334226516593, "phrase": "personal_medication_schedules"}, {"score": 0.002668582249630492, "phrase": "general_public"}, {"score": 0.0026456667695073043, "phrase": "experts'_advice_medication_behavior"}, {"score": 0.0025892330566358503, "phrase": "experts'_advice_method"}, {"score": 0.002437525632451029, "phrase": "combined_medication"}, {"score": 0.002226430168622392, "phrase": "patient_recovery"}, {"score": 0.002197801146305747, "phrase": "drug_hazards"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Medication schedule", " Prescription"], "paper_abstract": "Medication adherence tends to affect the recovery of patients. Patients having poor medication adherence show a worsening of their condition and/or increased complications. Unfortunately, between 20% and 50% of chronic patients are unable to manage their medications. This study proposes a model to improve the patients' medication compliance by reducing medication frequency. Published studies have shown that, based on the patients' lifestyle, simplification of the medication frequency and remodeling of the medication schedule is able to help improve medication adherence. Therefore, this study tried to simplify medication frequency by combining therapies. Moreover, by adjusting according to lifestyle, the study also tries to remodel medication timing in relation to mealtimes to create personal medication schedules. In this study, we used 19,393,452 outpatient prescriptions from the National Health Insurance Research Database to verify our system (algorithm optimized). At the same time, we examined the differences between the frequency summarized by general public and experts' advice medication behavior. Compared with the experts' advice method, this system has reduced the medication frequency in about 49% of prescriptions. Using combined medication to simplify medication frequency is able to reduce the medication frequency significantly and improve medication adherence. Furthermore, this should also improve patient recovery, reduce drug hazards and result in less drug wastage. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A model to personalize scheduling of complex prescriptions", "paper_id": "WOS:000297832500023"}