{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "spurious_matches"}, {"score": 0.0486868426803837, "phrase": "word_matches"}, {"score": 0.00481495049065317, "phrase": "significant_matches"}, {"score": 0.004721162131188487, "phrase": "dna_sequences"}, {"score": 0.004539005582217309, "phrase": "genomic_sequences"}, {"score": 0.004494570360108983, "phrase": "complete_genome_alignment_methods"}, {"score": 0.004073359218158693, "phrase": "large_sequences"}, {"score": 0.003378385493203297, "phrase": "homologous_relationships"}, {"score": 0.0032319109979344184, "phrase": "minimal_match_length"}, {"score": 0.002346160830406661, "phrase": "empirical_threshold_values"}, {"score": 0.0023117182131967523, "phrase": "robust_statistical_methods"}, {"score": 0.0022005118194652704, "phrase": "statistical_approach"}, {"score": 0.002125859121671525, "phrase": "mixture_model"}, {"score": 0.0021049977753042253, "phrase": "geometric_distributions"}], "paper_keywords": ["comparative genomics", " match length", " maximal exact matches", " mixture model"], "paper_abstract": "Word matches are widely used to compare genomic sequences. Complete genome alignment methods often rely on the use of matches as anchors for building their alignments, and various alignment-free approaches that characterize similarities between large sequences are based on word matches. Among matches that are retrieved from the comparison of two genomic sequences, a part of them may correspond to spurious matches (SMs), which are matches obtained by chance rather than by homologous relationships. The number of SMs depends on the minimal match length (l) that has to be set in the algorithm used to retrieve them. Indeed, if l is too small, a lot of matches are recovered but most of them are SMs. Conversely, if l is too large, fewer matches are retrieved but many smaller significant matches are certainly ignored. To date, the choice of l mostly depends on empirical threshold values rather than robust statistical methods. To overcome this problem, we propose a statistical approach based on the use of a mixture model of geometric distributions to characterize the distribution of the length of matches obtained from the comparison of two genomic sequences.", "paper_title": "Separating Significant Matches from Spurious Matches in DNA Sequences", "paper_id": "WOS:000298969900001"}