{"auto_keywords": [{"score": 0.049488021144002546, "phrase": "gps_trajectories"}, {"score": 0.00481495049065317, "phrase": "interest_recommendation"}, {"score": 0.0044968982227349625, "phrase": "hot_research_topic"}, {"score": 0.004441359373498799, "phrase": "real-world_applications"}, {"score": 0.004199766284749713, "phrase": "novel_semantics-enhanced_density-based_clustering_algorithm"}, {"score": 0.003971262520692664, "phrase": "semantic_pois"}, {"score": 0.0034634973175137486, "phrase": "recommendation_score"}, {"score": 0.003077372515276563, "phrase": "different_scoring_functions"}, {"score": 0.002803104254950008, "phrase": "unified_framework"}, {"score": 0.0027857115172243226, "phrase": "ptg-recommend"}, {"score": 0.0027341763737751467, "phrase": "candidate_pois"}, {"score": 0.0026835920552084488, "phrase": "mobile_user"}, {"score": 0.0021049977753042253, "phrase": "baseline_recommendation_methods"}], "paper_keywords": ["points of interest", " POI recommendation", " moving clients", " cosine similarity", " GPS trajectory"], "paper_abstract": "Recently, points of interest (POIs) recommendation has evolved into a hot research topic with real-world applications. In this paper, we propose a novel semantics-enhanced density-based clustering algorithm SEM-DTBJ-Cluster, to extract semantic POIs from GPS trajectories. We then take into account three different factors (popularity, temporal and geographical features) that can influence the recommendation score of a POI. We characterize the impacts caused by popularity, temporal and geographical information, by using different scoring functions based on three developed recommendation models. Finally, we combine the three scoring functions together and obtain a unified framework PTG-Recommend for recommending candidate POIs for a mobile user. To the best of our knowledge, this work is the first that considers popularity, temporal and geographical information together. Experimental results on two real-world data sets strongly demonstrate that our framework is robust and effective, and outperforms the baseline recommendation methods in terms of precision and recall.", "paper_title": "Points of interest recommendation from GPS trajectories", "paper_id": "WOS:000357018400004"}