{"auto_keywords": [{"score": 0.02558536168071286, "phrase": "shrine"}, {"score": 0.0048149533512024095, "phrase": "federated"}, {"score": 0.004764859786310636, "phrase": "clinical_data_repositories"}, {"score": 0.004560881073919516, "phrase": "background"}, {"score": 0.004428452434981208, "phrase": "shared_health_research_information_network"}, {"score": 0.004306610946695577, "phrase": "first_time"}, {"score": 0.0042766757473077024, "phrase": "research_queries"}, {"score": 0.004232160987948483, "phrase": "full_patient_populations"}, {"score": 0.004130079333979522, "phrase": "federated_architecture"}, {"score": 0.0037456980766939836, "phrase": "federal_and_state_privacy_laws"}, {"score": 0.0036172364609815487, "phrase": "multiple_hospitals"}, {"score": 0.003542276457435362, "phrase": "federated_query"}, {"score": 0.0033498651263935194, "phrase": "single_central_repository"}, {"score": 0.003091381857342703, "phrase": "one-time_process"}, {"score": 0.0030062165552187086, "phrase": "multiple_repositories"}, {"score": 0.002974886152979993, "phrase": "one-way_hash_values"}, {"score": 0.002862767868795934, "phrase": "local_databases"}, {"score": 0.0027071661844502992, "phrase": "federated_queries"}, {"score": 0.0025960262223338293, "phrase": "combined_results"}, {"score": 0.0025156683465194967, "phrase": "theoretical_bounds"}, {"score": 0.002498150733439951, "phrase": "simulated_hospital_networks"}, {"score": 0.002249527353528286, "phrase": "patient_populations"}, {"score": 0.0021049977753042253, "phrase": "aggregate_federated_architecture"}], "paper_keywords": [""], "paper_abstract": "Background and objective In 2008 we developed a shared health research information network (SHRINE), which for the first time enabled research queries across the full patient populations of four Boston hospitals. It uses a federated architecture, where each hospital returns only the aggregate count of the number of patients who match a query. This allows hospitals to retain control over their local databases and comply with federal and state privacy laws. However, because patients may receive care from multiple hospitals, the result of a federated query might differ from what the result would be if the query were run against a single central repository. This paper describes the situations when this happens and presents a technique for correcting these errors. Methods We use a one-time process of identifying which patients have data in multiple repositories by comparing one-way hash values of patient demographics. This enables us to partition the local databases such that all patients within a given partition have data at the same subset of hospitals. Federated queries are then run separately on each partition independently, and the combined results are presented to the user. Results Using theoretical bounds and simulated hospital networks, we demonstrate that once the partitions are made, SHRINE can produce more precise estimates of the number of patients matching a query. Conclusions Uncertainty in the overlap of patient populations across hospitals limits the effectiveness of SHRINE and other federated query tools. Our technique reduces this uncertainty while retaining an aggregate federated architecture.", "paper_title": "Federated queries of clinical data repositories: the sum of the parts does not equal the whole", "paper_id": "WOS:000319192100025"}