{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "geometric_variations"}, {"score": 0.04022330940745259, "phrase": "true_profile"}, {"score": 0.03255909926282652, "phrase": "geometric_tolerances"}, {"score": 0.0046092435167207095, "phrase": "hypothetical_point-spaces"}, {"score": 0.004084129504819342, "phrase": "geometric_manufacturing_variations"}, {"score": 0.004043158538239064, "phrase": "specified_two-dimensional_tolerance-zone"}, {"score": 0.0037930162319613856, "phrase": "single_profile_tolerance"}, {"score": 0.0034290777464571864, "phrase": "hypothetical_volume"}, {"score": 0.002755567647101251, "phrase": "testbed_software"}, {"score": 0.0025503112711036994, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "tolerance_accumulation"}], "paper_keywords": [""], "paper_abstract": "The geometric variations in a tolerance-zone can be modeled with hypothetical point-spaces called Tolerance-Maps (T-Maps) for purposes of automating the assignment of tolerances during design. The objective of this paper is to extend this model to represent tolerances on line-profiles. Such tolerances limit geometric manufacturing variations to a specified two-dimensional tolerance-zone, i.e., an area, the boundaries to which are curves parallel to the true profile. The single profile tolerance may be used to control position, orientation, and form of the profile. In this paper, the Tolerance-Map (Patent No. 6963824) is a hypothetical volume of points that captures all the positions for the true profile, and those curves parallel to it, which can reside in the tolerance-zone. The model is compatible with the ASME/ANSI/ISO Standards for geometric tolerances. T-Maps have been generated for other classes of geometric tolerances in which the variations of the feature are represented with a plane, line or circle, and these have been incorporated into testbed software for aiding designers when assigning tolerances for assemblies. In this paper the T-Map for line-profiles is created and, for the first time in this model, features may be either symmetrical or nonsymmetrical simple planar curves, typically closed. To economize on length of the paper, and yet to introduce a method whereby T-Maps may be used to optimize the allocation of tolerances for line-profiles, the scope of the paper has been limited to square, rectangular, and triangular shapes. An example of tolerance accumulation is presented to illustrate this method. [DOI: 10.1115/1.4007404]", "paper_title": "Modeling of Geometric Variations for Line-Profiles", "paper_id": "WOS:000314095100004"}