{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "medical_imaging_applications"}, {"score": 0.004710059800275799, "phrase": "asia"}, {"score": 0.004624337472244542, "phrase": "advanced_high-speed_computer_network"}, {"score": 0.004281053243493438, "phrase": "high-speed_data_transmission"}, {"score": 0.004157058883925715, "phrase": "low_operation_cost"}, {"score": 0.004066416005586085, "phrase": "high_performance"}, {"score": 0.00396315099839886, "phrase": "global_access"}, {"score": 0.0039341294012600085, "phrase": "international_network_peers"}, {"score": 0.0035233696341819437, "phrase": "university_of_southern_california"}, {"score": 0.0034975571855450373, "phrase": "los_angeles"}, {"score": 0.0034719721648820002, "phrase": "california"}, {"score": 0.003334309053314909, "phrase": "hong_kong"}, {"score": 0.0032139576525856118, "phrase": "brazil"}, {"score": 0.002985988377995789, "phrase": "round-trip_time"}, {"score": 0.002942373803701752, "phrase": "available_bandwidth"}, {"score": 0.00280496585980086, "phrase": "consistent_and_repeatable_tuning_protocol"}, {"score": 0.002733646947011804, "phrase": "clinical_environment"}, {"score": 0.002673957615079041, "phrase": "experimental_results"}, {"score": 0.0026446021865907197, "phrase": "ftp_and_dicom_transmission"}, {"score": 0.0026155681847364483, "phrase": "automatic_tuning_protocol"}, {"score": 0.0022741894748181243, "phrase": "overall_network_throughput"}, {"score": 0.0022492129111567824, "phrase": "proposed_tuning_method"}, {"score": 0.002224510044064184, "phrase": "performance_numbers"}, {"score": 0.002175913488493802, "phrase": "commercially_available_isp_connections"}], "paper_keywords": ["International Internet-2 connectivity", " research networks", " bandwidth", " automatic tuning protocol", " PACS", " DICOM compliance"], "paper_abstract": "Internet-2 is an advanced high-speed computer network, which has been widely used for medical imaging applications such as teleradiology and teleconsultation. Internet-2 can fulfill the requirements for high-speed data transmission and short turn-around time with low operation cost once installed. However, high performance may not necessarily be retained for global access from international network peers as well as commercial Internet Service Provider (ISP) solutions. This paper describes the methodology of establishing international Internet-2 connections between three different internationally linked sites: the Imaging Processing and Informatics (IPI) Laboratory, University of Southern California, Los Angeles, California; the Hong Kong Polytechnic University (PolyU), Hong Kong, and the Heart Institute (InCor) of the University of Sao Paulo, Brazil. Two major factors will be discussed including network looping in the US and bottleneck of the connection, raising the round-trip time and limiting the available bandwidth respectively. In addition to the three site International Internet2 Connectivity, a consistent and repeatable tuning protocol for international Internet2 applications in the clinical environment will be presented. The experimental results of the FTP and DICOM transmission using the automatic tuning protocol at both sending and receiving sites will be presented and compared with results for the combinations where this protocol is used at either one site only or no site at all in order to demonstrate the improvement in overall network throughput by this proposed tuning method. These performance numbers will also be compared to commercially available ISP connections to further show the differences between International Internet-2 and its ability to support medical imaging applications.", "paper_title": "International Internet2 connectivity and performance in medical imaging applications: Bridging the Americas to Asia", "paper_id": "WOS:000244530500002"}