{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "classification_models"}, {"score": 0.02166926605259214, "phrase": "information_resources"}, {"score": 0.007463788200680604, "phrase": "reference_implementation"}, {"score": 0.00481495049065317, "phrase": "automatic_selection"}, {"score": 0.004772593750252861, "phrase": "on-line_information_resources"}, {"score": 0.00470975295439431, "phrase": "clinicians'_information_needs"}, {"score": 0.004586531354697466, "phrase": "decision_support_tools"}, {"score": 0.004052616113326177, "phrase": "machine_learning"}, {"score": 0.004016938499717623, "phrase": "web_usage_mining_methods"}, {"score": 0.003759142310009214, "phrase": "particular_infobutton_context"}, {"score": 0.0035806300393050926, "phrase": "infobutton_usage_dataset"}, {"score": 0.002999823428906084, "phrase": "infobutton_session"}, {"score": 0.0025578967205807843, "phrase": "concept_drift"}, {"score": 0.002425524064992056, "phrase": "concept_drift_handling_techniques"}, {"score": 0.002289821830549781, "phrase": "promising_method"}, {"score": 0.002161695357601592, "phrase": "patient_care_questions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["information storage and retrieval", " machine learning", " computerized medical record systems", " infobuttons", " web usage mining"], "paper_abstract": "Objective. Infobuttons are decision support tools that offer links to information resources based on the context of the interaction between a clinician and an electronic medical record (EMR) system. The objective of this study was to explore machine learning and web usage mining methods to produce classification models for the prediction of information resources that might be relevant in a particular infobutton context. Design. Classification models were developed and evaluated with an infobutton usage dataset. The performance of the models was measured and compared with a reference implementation in a series of experiments. Measurements. Level of agreement (K) between the models and the resources that clinicians actually used in each infobutton session. Results. The classification models performed significantly better than the reference implementation (p < .0001). The performance of these models tended to decrease over time, probably due to a phenomenon known as concept drift. However, the performance of the models remained stable when concept drift handling techniques were used. Conclusions. The results suggest that classification models are a promising method for the prediction of information resources that a clinician would use to answer patient care questions. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Infobuttons and classification models: A method for the automatic selection of on-line information resources to fulfill clinicians' information needs", "paper_id": "WOS:000257924400014"}