{"auto_keywords": [{"score": 0.046806984950472454, "phrase": "developmental_disorders"}, {"score": 0.042389058155836386, "phrase": "developmental_disorder_groups"}, {"score": 0.031075315160321897, "phrase": "clustering_results"}, {"score": 0.00481495049065317, "phrase": "clust-a_methodology"}, {"score": 0.004660453113061494, "phrase": "ontological_methods"}, {"score": 0.004318881178805575, "phrase": "multiple_developmental_problems"}, {"score": 0.003290237137651949, "phrase": "potential_developmental_disorder_groups"}, {"score": 0.0031329184724341592, "phrase": "comorbid_developmental_disorders"}, {"score": 0.0030989899982042236, "phrase": "patient_data"}, {"score": 0.00251966141432339, "phrase": "child_development_clinic"}, {"score": 0.0021396960731214225, "phrase": "clustering_method"}, {"score": 0.0021049977753042253, "phrase": "systematic_identification"}], "paper_keywords": ["Ontology", " Clustering", " Developmental disorders", " Comorbidity"], "paper_abstract": "Children with developmental disorders usually exhibit multiple developmental problems (comorbidities). Hence, such diagnosis needs to revolve on developmental disorder groups. Our objective is to systematically identify developmental disorder groups and represent them in an ontology. We developed a methodology that combines two methods (1) a literature-based ontology that we created, which represents developmental disorders and potential developmental disorder groups, and (2) clustering for detecting comorbid developmental disorders in patient data. The ontology is used to interpret and improve clustering results and the Clustering results are used to validate the ontology and suggest directions for its development. We evaluated our methodology by applying it to data of 1175 patients from a child development clinic. We demonstrated that the ontology improves clustering results, bringing them closer to an expert generated gold-standard. We have shown that our methodology successfully combines an ontology with a Clustering method to support systematic identification and representation of developmental disorder groups. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Onto-clust-A methodology for combining clustering analysis and ontological methods for identifying groups of comorbidities for developmental disorders", "paper_id": "WOS:000263882700017"}