{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "time-varying_angular_rate"}, {"score": 0.009552811791720154, "phrase": "z-axis_mems_gyroscope"}, {"score": 0.0065621017393800935, "phrase": "angular_rate"}, {"score": 0.0047517225918491226, "phrase": "mems_z-axis_gyroscopes"}, {"score": 0.004536862734384202, "phrase": "nonlinear_estimation_strategy"}, {"score": 0.004190796368475121, "phrase": "off-line_adaptive_least-squares_estimation_strategy"}, {"score": 0.0039748192550806815, "phrase": "unknown_model_parameters"}, {"score": 0.003482160257566501, "phrase": "proposed_nonlinear_estimation_strategy"}, {"score": 0.0033465923623290034, "phrase": "lyapunov-based_analysis"}, {"score": 0.002451527111936163, "phrase": "representative_numerical_results"}, {"score": 0.0023096222276192194, "phrase": "proposed_nonlinear_strategy"}, {"score": 0.002234358539133758, "phrase": "applied_angular_rate"}, {"score": 0.0021049977753042253, "phrase": "constant_angular_rate"}], "paper_keywords": ["MEMS Z-axis gyroscope", " Least-squares estimation", " Adaptive controller", " Adaptive observer"], "paper_abstract": "In this paper, a nonlinear estimation strategy for sensing the time-varying angular rate of a Z-axis MEMS gyroscope is presented. An off-line adaptive least-squares estimation strategy is first developed to accurately estimate the unknown model parameters. Both axes of a Z-axis MEMS gyroscope are then actively controlled utilizing an on-line controller/observer to facilitate time-varying angular rate sensing. The proposed nonlinear estimation strategy is developed based on a Lyapunov-based analysis, which proves that the time-varying angular rate experienced by the device can be estimated accurately. Two cases for angular rate are investigated which are time-varying and constant magnitudes. An adaptive controller/observer was also utilized for sensing the angular rate to investigate the performance of the proposed controller/observer. Representative numerical results are discussed to demonstrate the performance of the proposed nonlinear strategy in accurately sensing the applied angular rate. Overall, the proposed nonlinear controller/observer improves sensing the constant angular rate by 50% and the time-varying angular rate by 90% when compared with an adaptive controller/observer. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Sensing of the time-varying angular rate for MEMS Z-axis gyroscopes", "paper_id": "WOS:000282470800010"}