{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adversary_structure"}, {"score": 0.0045198174374297285, "phrase": "group_members"}, {"score": 0.003607404191062938, "phrase": "threshold_structure"}, {"score": 0.0034949740315415043, "phrase": "trusted_third_party"}, {"score": 0.0034537189001268113, "phrase": "secret_reconstruction_phase"}, {"score": 0.0033860360186761533, "phrase": "additive_homomorphism"}, {"score": 0.0033328427701162337, "phrase": "storage_cost"}, {"score": 0.0032289419984035954, "phrase": "pre-verification_property"}, {"score": 0.003042752533935891, "phrase": "real_master_shares"}, {"score": 0.0030068193773923387, "phrase": "verification_phase"}, {"score": 0.002701877448139625, "phrase": "heavy_storage_cost"}, {"score": 0.002680556511196791, "phrase": "secret_share"}, {"score": 0.0022162970216404927, "phrase": "favorable_candidate"}, {"score": 0.002138636271204459, "phrase": "secure_multi-party_computation"}, {"score": 0.0021049977753042253, "phrase": "data_mining"}], "paper_keywords": ["(k,t,n) secret sharing", " adversary structure", " pre-verification property", " homomorphism"], "paper_abstract": "A (n,t,n) secret sharing scheme is to share a secret among n group members, where each member also plays a role of a dealer, and any t shares can be used to recover the secret. In this paper, we propose a strong (k,t,n) verifiable multi-secret sharing scheme, where any k out of n participants operate as dealers. The scheme realizes both threshold structure and adversary structure simultaneously, and removes a trusted third party. The secret reconstruction phase is performed using an additive homomorphism for decreasing the storage cost. Meanwhile, the scheme achieves the pre-verification property in the sense that any participant doesn't need to reveal any information about real master shares in the verification phase. We compare our proposal with the previous (n,t,n) secret sharing schemes from the perspectives of what kinds of access structures they achieve, what kinds of functionalities they support and whether heavy storage cost for secret share is required. Then it shows that our scheme takes the following advantages: (a) realizing the adversary structure, (b) allowing any k out of n participants to operate as dealers, (c) small sized secret share. Moreover, our proposed scheme is a favorable candidate to be used in many applications, such as secure multi-party computation and privacy preserving data mining, etc.", "paper_title": "A (k,t,n) verifiable multi-secret sharing scheme based on adversary structure", "paper_id": "WOS:000348048600018"}