{"auto_keywords": [{"score": 0.04903589335092133, "phrase": "non-acceptable_numberings"}, {"score": 0.0380315490706287, "phrase": "finite_learning"}, {"score": 0.032576110574299134, "phrase": "explanatory_learning"}, {"score": 0.00481495049065317, "phrase": "previous_studies"}, {"score": 0.004058951880810154, "phrase": "learnable_class"}, {"score": 0.003948613642680196, "phrase": "hypothesis_space"}, {"score": 0.0039269071382230444, "phrase": "furthermore_an_effective_version"}, {"score": 0.0036553070575015344, "phrase": "effectively_optimal_numberings"}, {"score": 0.0031845067058084583, "phrase": "behaviourally_correct_learning"}, {"score": 0.003030247482854539, "phrase": "k-acceptable_numberings"}, {"score": 0.00280496585980086, "phrase": "vacillatory_learning"}, {"score": 0.0021520139248317333, "phrase": "consistent_learning"}], "paper_keywords": ["Inductive inference", " Recursion theory", " Numberings", " Optimal numberings"], "paper_abstract": "This paper extends previous studies on learnability in non-acceptable numberings by considering the question: for which criteria which numberings are optimal, that is, for which numberings it holds that one can learn every learnable class using the given numbering as hypothesis space Furthermore an effective version of optimality is studied as well. It is shown that the effectively optimal numberings for finite learning are just the acceptable numberings. In contrast to this, there are non-acceptable numberings which are optimal for finite learning and effectively optimal for explanatory, vacillatory and behaviourally correct learning The numberings effectively optimal for explanatory learning are the K-acceptable numberings A similar characterization is obtained for the numberings which are effectively optimal for vacillatory learning Furthermore, it is studied which numberings are optimal for one and not for another criterion, among the criteria of finite. explanatory, vacillatory and behaviourally correct learning all separations can be obtained, however every numbering which is optimal for explanatory learning is also optimal for consistent learning (C) 2009 Elsevier Inc All rights reserved.", "paper_title": "Numberings optimal for learning", "paper_id": "WOS:000276825100004"}