{"auto_keywords": [{"score": 0.03233518018291957, "phrase": "proposed_algorithms"}, {"score": 0.009866836825131734, "phrase": "global_optimal_solution"}, {"score": 0.00481495049065317, "phrase": "multiple_uav_coalitions"}, {"score": 0.004769958800452922, "phrase": "search_and_prosecute_mission"}, {"score": 0.004740198087045941, "phrase": "unmanned"}, {"score": 0.004725385523804256, "phrase": "aerial_vehicles"}, {"score": 0.00422177384286051, "phrase": "different_capacities"}, {"score": 0.004066076430818046, "phrase": "small_quantities"}, {"score": 0.003977921371655919, "phrase": "uavs"}, {"score": 0.0038431888954930083, "phrase": "target_resource_requirement"}, {"score": 0.003807242767474929, "phrase": "assigned_coalition"}, {"score": 0.0037130155038449554, "phrase": "target_prosecution_delay"}, {"score": 0.0034984340449789745, "phrase": "combinatorial_nature"}, {"score": 0.0034225318244532387, "phrase": "real-time_applications"}, {"score": 0.003154701855951328, "phrase": "single_target"}, {"score": 0.003134986603941304, "phrase": "low_computational_complexity"}, {"score": 0.002935248513348432, "phrase": "centralized_combinatorial_optimization_problem"}, {"score": 0.0025730425700096365, "phrase": "account_reduction"}, {"score": 0.0025569530630374995, "phrase": "uav_resources"}, {"score": 0.002470237978694949, "phrase": "particle_swarm_optimization"}, {"score": 0.002327310963701377, "phrase": "mission_performance"}, {"score": 0.0022133711375320244, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "far_less_computational_resources"}], "paper_keywords": ["Multi UAV", " Coalition formation", " Task allocation", " Particle swarm optimization"], "paper_abstract": "Unmanned aerial vehicles (UAVs) have the potential to carry resources in support of search and prosecute operations. Often to completely prosecute a target, UAVs may have to simultaneously attack the target with various resources with different capacities. However, the UAVs are capable of carrying only limited resources in small quantities, hence, a group of UAVs (coalition) needs to be assigned that satisfies the target resource requirement. The assigned coalition must be such that it minimizes the target prosecution delay and the size of the coalition. The problem of forming coalitions is computationally intensive due to the combinatorial nature of the problem, but for real-time applications computationally cheap solutions are required. In this paper, we propose decentralized sub-optimal (polynomial time) and decentralized optimal coalition formation algorithms that generate coalitions for a single target with low computational complexity. We compare the performance of the proposed algorithms to that of a global optimal solution for which we need to solve a centralized combinatorial optimization problem. This problem is computationally intensive because the solution has to (a) provide a coalition for each target, (b) design a sequence in which targets need to be prosecuted, and (c) take into account reduction of UAV resources with usage. To solve this problem we use the Particle Swarm Optimization (PSO) technique. Through simulations, we study the performance of the proposed algorithms in terms of mission performance, complexity of the algorithms and the time taken to form the coalition. The simulation results show that the solution provided by the proposed algorithms is close to the global optimal solution and requires far less computational resources.", "paper_title": "Multiple UAV Coalitions for a Search and Prosecute Mission", "paper_id": "WOS:000288457400007"}