{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "particle_size"}, {"score": 0.014667499720165914, "phrase": "flotation_kinetics"}, {"score": 0.007939773877117915, "phrase": "batch_flotation_cell"}, {"score": 0.0058931192794926986, "phrase": "cumulative_recovery"}, {"score": 0.005368309995089755, "phrase": "fuzzy_model"}, {"score": 0.004770211811866158, "phrase": "coal_flotation_kinetics"}, {"score": 0.004725886853744007, "phrase": "fuzzy_logic"}, {"score": 0.004069963083642548, "phrase": "nonlinear_equations"}, {"score": 0.0036382660173943393, "phrase": "maximum_theoretical_flotation_recovery"}, {"score": 0.003504756881063581, "phrase": "fuzzy_logic_method"}, {"score": 0.002787181295054319, "phrase": "batch_flotation"}, {"score": 0.0026474076254702525, "phrase": "different_coal_particle_size"}, {"score": 0.0026105159490849364, "phrase": "correlation_coefficient"}, {"score": 0.0025264171945423254, "phrase": "proposed_fuzzy_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Coal", " Flotation kinetics", " Modeling", " Fuzzy logic"], "paper_abstract": "This paper investigates the effect of particle size on the flotation kinetics of coal in a batch flotation cell. The relationship between flotation kinetics constant and theoretical flotation recovery with particle size was estimated with nonlinear equations. Analysis of variance shows that varying of particle size is statistically significant on kinetics constant with approximately 96.5% confidence level however it is not significant on maximum theoretical flotation recovery (RI) in 95% confidence level. Using fuzzy logic method, a multi-input/single-output (MISO) fuzzy model with two input variables: particle size and time and one output variable: cumulative recovery was established to predict the effect of particle size on the flotation kinetics of coal in a batch flotation cell. Application of fuzzy model shows that the results of model fits well to the result of batch flotation and the fuzzy model can be applied to predict cumulative recovery of different coal particle size. The correlation coefficient (R-2) values of the proposed fuzzy model were 0.986. 0.993, 0.983, 0.977 and 0.972 for 37.5 mu m, 112.5 mu m, 225 mu m, 400 mu m and 625 mu m average particle sizes, respectively. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A study on the effect of particle size on coal flotation kinetics using fuzzy logic", "paper_id": "WOS:000277726300056"}