{"auto_keywords": [{"score": 0.04008713347741764, "phrase": "gdmt"}, {"score": 0.033579053218340996, "phrase": "snr"}, {"score": 0.03332250075496819, "phrase": "inr"}, {"score": 0.031249752557664757, "phrase": "csit"}, {"score": 0.028267840282014185, "phrase": "mimo_z-ic"}, {"score": 0.02796538698626599, "phrase": "no-csit_assumption"}, {"score": 0.004762202897268383, "phrase": "mimo_z_interference_channel"}, {"score": 0.0042031320273645065, "phrase": "general_case"}, {"score": 0.004157058883925715, "phrase": "arbitrary_number"}, {"score": 0.004007083686875716, "phrase": "full_channel_state_information"}, {"score": 0.003876719738482442, "phrase": "short-term_average_power_constraint"}, {"score": 0.0037094500688222695, "phrase": "reliability_tradeoff"}, {"score": 0.00327356326590461, "phrase": "nominal_snr"}, {"score": 0.0032376465741070274, "phrase": "decibel_scale"}, {"score": 0.0029100802280971065, "phrase": "second_transmitter's_signal"}, {"score": 0.0028360962841331634, "phrase": "first_user's_transmit_signal"}, {"score": 0.0027437235598539904, "phrase": "full-csit_gdmt"}, {"score": 0.002713604305939145, "phrase": "mimo_z-ic."}, {"score": 0.002558450494671067, "phrase": "multiplexing_gains"}, {"score": 0.0023421547766273036, "phrase": "direct_and_cross_links"}, {"score": 0.0022327141073440436, "phrase": "interfered_receiver"}, {"score": 0.0021441057555396013, "phrase": "inr_exponent"}], "paper_keywords": ["Channel state information", " diversity-multiplexing tradeoff", " interference channel", " MIMO", " quasi-static fading", " Z channel"], "paper_abstract": "The generalized diversity-multiplexing tradeoff (GDMT) of the two-user, quasi-static fading, multi-input, multi-output (MIMO) Z interference channel (Z-IC) is established for the general case with an arbitrary number of antennas at each node under the assumptions of full channel state information at the transmitters (CSIT) and a short-term average power constraint. In the GDMT framework, which captures the rate versus reliability tradeoff in the high signal-to-noise ratio (SNR) regime, the direct link SNR and cross-link interference-to-noise ratio (INR) are allowed to be disparate, so that their ratios relative to a nominal SNR in the decibel scale, i.e., the SNR and INR exponents, are arbitrary and fixed. It is shown that a simple Han-Kobayashi message-splitting/partial interference decoding scheme that uses only partial CSIT in which the second transmitter's signal depends only on its cross-link channel matrix and the first user's transmit signal does not need any CSIT can achieve the full-CSIT GDMT of the MIMO Z-IC. The GDMT of the MIMO Z-IC under the No-CSIT assumption is also obtained for some range of multiplexing gains. The size of this range depends on the numbers of antennas at the four nodes and the SNR and INR exponents of the direct and cross links, respectively. For certain classes of channels including those in which the interfered receiver has more antennas than do the other nodes, or when the INR exponent is greater than a certain threshold, the GDMT of the MIMO Z-IC under the No-CSIT assumption is also completely characterized.", "paper_title": "The Generalized Diversity-Multiplexing Tradeoff of the MIMO Z Interference Channel", "paper_id": "WOS:000354943600030"}