{"auto_keywords": [{"score": 0.0424549806447919, "phrase": "atomic_actions"}, {"score": 0.020488311234155433, "phrase": "temporal_relations"}, {"score": 0.008713768692145006, "phrase": "video_events"}, {"score": 0.006821938110334677, "phrase": "and-or_nodes"}, {"score": 0.004769702911065878, "phrase": "intent_prediction"}, {"score": 0.004614643339546038, "phrase": "stochastic_temporal"}, {"score": 0.004370721757813473, "phrase": "stochastic_event_grammar"}, {"score": 0.0042485985883952, "phrase": "grounded_spatial_relations"}, {"score": 0.004100712177044264, "phrase": "terminal_nodes"}, {"score": 0.003976697699412066, "phrase": "grounded_relations"}, {"score": 0.003957952976206386, "phrase": "image_frames"}, {"score": 0.0038111292260056264, "phrase": "alternative_ways"}, {"score": 0.0036871167370303073, "phrase": "valid_temporal_configurations"}, {"score": 0.0035671251110258517, "phrase": "stochastic_context-free_grammar"}, {"score": 0.0034185505275141077, "phrase": "similar_structures"}, {"score": 0.003230001390718772, "phrase": "unsupervised_learning_algorithm"}, {"score": 0.003132236287543072, "phrase": "information_projection_principle"}, {"score": 0.0031100973266506163, "phrase": "coherent_probabilistic_framework"}, {"score": 0.002890266318361907, "phrase": "existing_methods"}, {"score": 0.002776364229179074, "phrase": "hierarchical_compositions"}, {"score": 0.0026107601878587816, "phrase": "video_data"}, {"score": 0.002598437206050684, "phrase": "manual_supervision"}, {"score": 0.0025019192109829932, "phrase": "top-down_process"}, {"score": 0.0024842242921857705, "phrase": "events_insertion"}, {"score": 0.00247249708860822, "phrase": "multi-agent_events"}, {"score": 0.002449208093757498, "phrase": "possible_interpretations"}, {"score": 0.0023806459272452353, "phrase": "globally_optimal_parsing_solution"}, {"score": 0.002363806685815014, "phrase": "bayesian_framework"}, {"score": 0.0023194807260455007, "phrase": "event_context"}, {"score": 0.002233301265743633, "phrase": "extensive_experiments"}, {"score": 0.0022175019341824603, "phrase": "indoor_and_out_door_scenes"}, {"score": 0.0021351033500114735, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Temporal And-Or Graph (T-AOG)", " Event parsing", " Unsupervised learning", " Goal prediction", " Information projection"], "paper_abstract": "In this paper, we present a framework for parsing video events with stochastic Temporal And-Or Graph (T-AOG) and unsupervised learning of the T-AOG from video. This T-AOG represents a stochastic event grammar. The alphabet of the T-AOG consists of a set of grounded spatial relations including the poses of agents and their interactions with objects in the scene. The terminal nodes of the T-AOG are atomic actions which are specified by a number of grounded relations over image frames. An And-node represents a sequence of actions. An Or-node represents a number of alternative ways of such concatenations. The And-Or nodes in the T-AOG can generate a set of valid temporal configurations of atomic actions, which can be equivalently represented as the language of a stochastic context-free grammar (SCFG). For each And-node we model the temporal relations of its children nodes to distinguish events with similar structures but different temporal patterns and interpolate missing portions of events. This makes the T-AOG grammar context-sensitive. We propose an unsupervised learning algorithm to learn the atomic actions, the temporal relations and the And-Or nodes under the information projection principle in a coherent probabilistic framework. We also propose an event parsing algorithm based on the T-AOG which can understand events, infer the goal of agents, and predict their plausible intended actions. In comparison with existing methods, our paper makes the following contributions. (i) We represent events by a T-AOG with hierarchical compositions of events and the temporal relations between the sub-events. (ii) We learn the grammar, including atomic actions and temporal relations, automatically from the video data without manual supervision. (iii) Our algorithm infers the goal of agents and predicts their intents by a top-down process, handles events insertion and multi-agent events, keeps all possible interpretations of the video to preserve the ambiguities, and achieves the globally optimal parsing solution in a Bayesian framework. (iv) The algorithm uses event context to improve the detection of atomic actions, segment and recognize objects in the scene. Extensive experiments, including indoor and out door scenes, single and multiple agents events, are conducted to validate the effectiveness of the proposed approach. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Learning and parsing video events with goal and intent prediction", "paper_id": "WOS:000323913300014"}