{"auto_keywords": [{"score": 0.04571345706034808, "phrase": "low-level_features"}, {"score": 0.00481495049065317, "phrase": "multiple_features"}, {"score": 0.004720269202737973, "phrase": "main_obstacle"}, {"score": 0.004664352260912174, "phrase": "semantic-based_image_retrieval"}, {"score": 0.00446490613141384, "phrase": "semantic_description"}, {"score": 0.004342430078306461, "phrase": "text-based_keywords"}, {"score": 0.004257000695796238, "phrase": "web_documents"}, {"score": 0.004206548500039536, "phrase": "semantic_information"}, {"score": 0.004123781267600542, "phrase": "search_space"}, {"score": 0.003947358102140903, "phrase": "retrieval_precision"}, {"score": 0.0037784540167266497, "phrase": "dynamic_approach"}, {"score": 0.003287482882222731, "phrase": "html_documents"}, {"score": 0.0031592690527974285, "phrase": "composite_colour-texture_features"}, {"score": 0.003036040409062437, "phrase": "retrieval_performance"}, {"score": 0.0029292375702719494, "phrase": "experimental_results"}, {"score": 0.002882980094838904, "phrase": "integrated_approach"}, {"score": 0.0028601252251285025, "phrase": "better_retrieval_performance"}, {"score": 0.0027594936602962075, "phrase": "content-based_techniques"}, {"score": 0.0024981087707313656, "phrase": "indexing_mechanism"}, {"score": 0.002478297391121455, "phrase": "dynamically_growing_features"}, {"score": 0.002372103459168231, "phrase": "image_retrieval_systems"}, {"score": 0.002270449532546444, "phrase": "internet_search_engine"}, {"score": 0.0021645388874653266, "phrase": "www"}], "paper_keywords": ["Internet", " Worldwide web", " Search engines"], "paper_abstract": "Purpose - The main obstacle in realising semantic-based image retrieval from the web is that it is difficult to capture semantic description of an image in low-level features. Text-based keywords can be generated from web documents to capture semantic information for narrowing down the search space. The combination of keywords and various low-level features effectively increases the retrieval precision. The purpose of this paper is to propose a dynamic approach for integrating keywords and low-level features to take advantage of their complementary strengths. Design/methodology/approach - Image semantics are described using both low-level features and keywords. The keywords are constructed from the text located in the vicinity of images embedded in HTML documents. Various low-level features such as colour histograms, texture and composite colour-texture features are extracted for supplementing keywords. Findings - The retrieval performance is better than that of various recently proposed techniques. The experimental results show that the integrated approach has better retrieval performance than both the text-based and the content-based techniques. Research limitations/implications - The features of images used for capturing the semantics may not always describe the content. Practical implications - The indexing mechanism for dynamically growing features is challenging while practically implementing the system. Originality/value - A survey of image retrieval systems for searching images available on the internet found that no internet search engine can handle both low-level features and keywords as queries for retrieving images from WWW so this is the first of its kind.", "paper_title": "Image retrieval from the web using multiple features", "paper_id": "WOS:000273759300009"}