{"auto_keywords": [{"score": 0.039855253243257505, "phrase": "anchoring_effect"}, {"score": 0.00481495049065317, "phrase": "internet_buyer's_product_familiarity"}, {"score": 0.00457138247462329, "phrase": "robust_phenomenon"}, {"score": 0.0042656009036320585, "phrase": "internet_purchasing_domain"}, {"score": 0.003980191398041843, "phrase": "individual_differences"}, {"score": 0.0037138072936226, "phrase": "current_study"}, {"score": 0.003634262647873338, "phrase": "online_experiment"}, {"score": 0.0035410467987580484, "phrase": "internet_buyers'_level"}, {"score": 0.0033909518548844047, "phrase": "online_shopping_context"}, {"score": 0.0032896745636186824, "phrase": "significant_anchoring_effect"}, {"score": 0.0029392020223716966, "phrase": "participants'_confidence"}, {"score": 0.0024713335323674223, "phrase": "banner_advertisement"}, {"score": 0.002335889180060105, "phrase": "final_estimate"}, {"score": 0.0022464835515931592, "phrase": "actual_value"}, {"score": 0.0021604924928015283, "phrase": "external_anchors"}], "paper_keywords": ["anchoring effect", " Internet shopping", " product familiarity", " confidence"], "paper_abstract": "Although anchoring effect is a robust phenomenon and has been discussed in different decision making domains, related research efforts in the Internet purchasing domain are still lacking. Furthermore, little research has been conducted to examine the role of individual differences (e.g. product familiarity and confidence level) in the anchoring effect. Thus, the current study aims to conduct an online experiment to examine the role of Internet buyers' level of product familiarity and confidence in the anchoring effect under online shopping context. The results indicated that the significant anchoring effect was observed only among people who are low in familiarity, but not among people who are high in familiarity. In addition, the participants' confidence in their judgements is also demonstrated to be a moderator to influence the anchoring effect. Specifically, the anchoring effect emerged only among the less confident group. One possible reason for this result is that less confident people tend to look for other attentional resources (such as banner advertisement) as anchor because they are not sure whether or not the final estimate generated on their own is close to the actual value. Consequently, they are more susceptible to external anchors and, hence, a more salient anchoring effect was expected to occur.", "paper_title": "The role of Internet buyer's product familiarity and confidence in anchoring effect", "paper_id": "WOS:000307269700003"}