{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "triangular_prism_elements"}, {"score": 0.009088279764579998, "phrase": "new_formulas"}, {"score": 0.004659128559146272, "phrase": "cfd"}, {"score": 0.004524801966077539, "phrase": "major_computational_expenses"}, {"score": 0.004025040955430234, "phrase": "sufficiently_high-degree"}, {"score": 0.0037823114064881357, "phrase": "far_greater_number"}, {"score": 0.003754731210715724, "phrase": "quadrature_points"}, {"score": 0.0035934073774126856, "phrase": "new_efficient_so-called_nonproduct_numerical_integration_formulas"}, {"score": 0.003489714006817602, "phrase": "degree_d"}, {"score": 0.0034642599795044445, "phrase": "triangular_prisms"}, {"score": 0.003376619185594497, "phrase": "polynomial_moment"}, {"score": 0.002927278301452369, "phrase": "triangular_prism"}, {"score": 0.0025562434609873335, "phrase": "volume_integrals"}, {"score": 0.00239309075766136, "phrase": "conventional_approaches"}, {"score": 0.0023582694348219233, "phrase": "one-dimensional_gaussian_formulas"}, {"score": 0.0022158306933307685, "phrase": "complete_polynomial"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Numerical integration", " Gaussian quadrature", " Cubature", " Finite elements"], "paper_abstract": "Triangular prism elements are widely used in finite element/volume computational fluid dynamics (CFD) codes, where one of the major computational expenses is the evaluation of integrals over the volumes of the elements. In practice, these integrals are typically computed using products of existing, lower-dimensional numerical integration, or quadrature, formulas of a sufficiently high-degree. While this approach is easily applied, it generally results in the use of a far greater number of quadrature points and weights than necessary. Therefore, in this paper, new efficient so-called nonproduct numerical integration formulas designed specifically for integrating complete polynomials of degree d over triangular prisms are derived using the method of polynomial moment fitting, where the weights and points of the formulas are determined by a system of coupled, highly nonlinear equations. Given that the size of the systems of equations quickly becomes prohibitively large in three dimensions, symmetry groups over the triangular prism are constructed and utilized to reduce the number of equations and unknowns. The new formulas, which in some cases are optimal, i.e., minimal-point, are the most efficient means available for numerically computing volume integrals over triangular prism elements in that they require fewer points than any other presently available formulas of the same polynomial degree. By comparison, conventional approaches using products of one-dimensional Gaussian formulas require, on average, more than twice as many points and weights to integrate a complete polynomial of degree d as the new formulas derived here. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "New computationally efficient quadrature formulas for triangular prism elements", "paper_id": "WOS:000315608800015"}