{"auto_keywords": [{"score": 0.049872717903822486, "phrase": "organizational_performance"}, {"score": 0.010058291058694014, "phrase": "km"}, {"score": 0.006312786474911885, "phrase": "rewarding_system"}, {"score": 0.00481495049065317, "phrase": "knowledge_management_practices"}, {"score": 0.004698581290187696, "phrase": "km_practices"}, {"score": 0.004621589167211018, "phrase": "holistic_approach"}, {"score": 0.0045818770241865875, "phrase": "knowledge_management"}, {"score": 0.004474411455845764, "phrase": "seven_critical_success_factors"}, {"score": 0.004426396574581122, "phrase": "namely_leadership_role"}, {"score": 0.0044073345622401595, "phrase": "organizational_culture"}, {"score": 0.004388354277477168, "phrase": "km_strategy"}, {"score": 0.004294666662649339, "phrase": "information_technology"}, {"score": 0.004042803761681556, "phrase": "research_hypotheses"}, {"score": 0.003830386188822068, "phrase": "literature_review"}, {"score": 0.0037003118751531717, "phrase": "bsc's_perspectives"}, {"score": 0.003543890850535647, "phrase": "subsidiary_firms"}, {"score": 0.003528615826379229, "phrase": "iran_national_petrochemical_company"}, {"score": 0.003438333674744448, "phrase": "chronbach's_alpha"}, {"score": 0.0033940595905259914, "phrase": "instrument_i.e._km_practices"}, {"score": 0.0033359100648181882, "phrase": "factor_analysis"}, {"score": 0.0033215284998365656, "phrase": "construct_validity"}, {"score": 0.0031948437788495558, "phrase": "structural_equation"}, {"score": 0.003013791266391433, "phrase": "overall_organizational_performance"}, {"score": 0.0028614628651866805, "phrase": "financial_constructs"}, {"score": 0.002676013568713519, "phrase": "lowest_rank"}, {"score": 0.002658715808421396, "phrase": "survey_organizations"}, {"score": 0.002557249206826381, "phrase": "iran"}, {"score": 0.002540714221355056, "phrase": "manufacturing_and_service_industries"}, {"score": 0.0024070289106543005, "phrase": "longitudinal_study"}, {"score": 0.002386300301874193, "phrase": "deeper_understanding"}, {"score": 0.002370870797207512, "phrase": "cause-and-effect_relationship"}, {"score": 0.0022952034987327916, "phrase": "statistical_and_comprehensive_methods"}, {"score": 0.002114123174482792, "phrase": "comprehensive_approach"}, {"score": 0.0021049982455452216, "phrase": "bsc."}], "paper_keywords": ["Balanced scorecard", " Knowledge management", " Critical success factors", " Organizational performance", " Iran national petrochemical company"], "paper_abstract": "Purpose - The purpose of this paper is to present a holistic approach regarding evaluation of knowledge management (KM) practices on organizational performance. The effects of seven critical success factors (CSFs), namely leadership role, organizational culture, KM strategy, processes and activities, training and education, information technology, and motivation and rewarding system, on organizational performance in the framework of four perspectives of balance scored card (BSC) approach were surveyed. Design/methodology/approach - The research hypotheses were raised based on the four perspectives of this approach, namely, growth and learning, internal processes, customer and financial. By literature review, CSFs of KM and organizational performance along with their items were identified in the framework of BSC's perspectives. Based on these constructs and their items an instrument was designed and distributed among managers and employees of the subsidiary firms of Iran National Petrochemical Company (INPC). Reliability of the instrument was calculated by Chronbach's alpha for the two sections of the instrument i.e. KM practices and organizational performance. Also, using factor analysis the construct validity of the questionnaire was approved. Finally, based on the hypotheses of the study and using structural equation modeling the impacts of KM practices on organizational performance were investigated. Findings - The results revealed that KM practices positively and meaningfully (though weak) impact overall organizational performance. This impact is significant only regarding growth and learning dimension and on the other dimensions is insignificant. Also, as customer and financial constructs were loaded on one factor based on the entity of their indicators we considered these two constructs as stakeholders construct. In addition, among the above mentioned seven CSFs, motivation and rewarding system obtained the lowest rank among the survey organizations. Research limitations/implications - The sample is restricted to only three companies, so gathering data from various parts of Iran including both manufacturing and service industries could increase the generalizability of the results obtained. Also, as in this study the data gathered were cross-sectional, a longitudinal study could help gain deeper understanding of the cause-and-effect relationship among the variables. Originality/value - The most significant gap in the literature is the lack of enough application of statistical and comprehensive methods like BSC that KM makes a difference to organizational performance. This study contributes to the field of KM by empirically investigating the impact of KM practices on various measures of organizational performance in order to prove the suitability of a comprehensive approach like BSC.", "paper_title": "The impact of knowledge management practices on organizational performance A balanced scorecard approach", "paper_id": "WOS:000355689200008"}