{"auto_keywords": [{"score": 0.046347791151487634, "phrase": "graph_simulation"}, {"score": 0.018118978567152666, "phrase": "bounded_simulation"}, {"score": 0.010612387000973441, "phrase": "graph_pattern_matching"}, {"score": 0.009837980628061519, "phrase": "subgraph_isomorphism"}, {"score": 0.009097970836816082, "phrase": "small_changes"}, {"score": 0.0047241071553733825, "phrase": "emerging_applications"}, {"score": 0.004690482437919202, "phrase": "social_network_analysis"}, {"score": 0.004294853638699961, "phrase": "meaningful_matches"}, {"score": 0.003989089382881299, "phrase": "batch_algorithms"}, {"score": 0.0038034297106928384, "phrase": "graph_pattern"}, {"score": 0.0036005398246162184, "phrase": "predefined_number"}, {"score": 0.003499002730845858, "phrase": "sensible_matches"}, {"score": 0.003474067486236726, "phrase": "traditional_matching_notions"}, {"score": 0.0033600243545849917, "phrase": "cubic_time"}, {"score": 0.0032342513872753503, "phrase": "incremental_graph_pattern_matching"}, {"score": 0.0030909774754496575, "phrase": "incremental_matching_problem"}, {"score": 0.00262813542985572, "phrase": "auxiliary_information"}, {"score": 0.002584603537014602, "phrase": "previous_computation"}, {"score": 0.0025478633731566285, "phrase": "graph_patterns"}, {"score": 0.0025176448284720838, "phrase": "incremental_matching_algorithms"}, {"score": 0.0024641495397626748, "phrase": "unnecessary_recomputation"}, {"score": 0.0022132110419604534, "phrase": "real-life_networks"}, {"score": 0.0021765368728946283, "phrase": "incremental_algorithms"}, {"score": 0.0021150721590334843, "phrase": "promising_framework"}, {"score": 0.0021049977753042253, "phrase": "real-life_graph_pattern_matching"}], "paper_keywords": ["Design", " Algorithms", " Performance", " Graph pattern matching", " graph simulation", " subgraph isomorphism", " incremental pattern matching"], "paper_abstract": "Graph pattern matching is commonly used in a variety of emerging applications such as social network analysis. These applications highlight the need for studying the following two issues. First, graph pattern matching is traditionally defined in terms of subgraph isomorphism or graph simulation. These notions, however, often impose too strong a topological constraint on graphs to identify meaningful matches. Second, in practice a graph is typically large, and is frequently updated with small changes. It is often prohibitively expensive to recompute matches starting from scratch via batch algorithms when the graph is updated. This article studies these two issues. (1) We propose to define graph pattern matching based on a notion of bounded simulation, which extends graph simulation by specifying the connectivity of nodes in a graph within a predefined number of hops. We show that bounded simulation is able to find sensible matches that the traditional matching notions fail to catch. We also show that matching via bounded simulation is in cubic time, by giving such an algorithm. (2) We provide an account of results on incremental graph pattern matching, for matching defined with graph simulation, bounded simulation, and subgraph isomorphism. We show that the incremental matching problem is unbounded, that is, its cost is not determined alone by the size of the changes in the input and output, for all these matching notions. Nonetheless, when matching is defined in terms of simulation or bounded simulation, incremental matching is semibounded, that is, its worst-time complexity is bounded by a polynomial in the size of the changes in the input, output, and auxiliary information that is necessarily maintained to reuse previous computation, and the size of graph patterns. We also develop incremental matching algorithms for graph simulation and bounded simulation, by minimizing unnecessary recomputation. In contrast, matching based on subgraph isomorphism is neither bounded nor semibounded. (3) We experimentally verify the effectiveness and efficiency of these algorithms, and show that: (a) the revised notion of graph pattern matching allows us to identify communities commonly found in real-life networks, and (b) the incremental algorithms substantially outperform their batch counterparts in response to small changes. These suggest a promising framework for real-life graph pattern matching.", "paper_title": "Incremental Graph Pattern Matching", "paper_id": "WOS:000324072200005"}