{"auto_keywords": [{"score": 0.03432247275293756, "phrase": "data_quality"}, {"score": 0.022000311221857343, "phrase": "perceived_quality"}, {"score": 0.007628343256777002, "phrase": "hmis"}, {"score": 0.00481495049065317, "phrase": "improving_processes"}, {"score": 0.004788416208637939, "phrase": "health_organizations"}, {"score": 0.004709683359341165, "phrase": "data_quality_management"}, {"score": 0.0035720061878618307, "phrase": "health_management_information_systems"}, {"score": 0.003513203382092187, "phrase": "legal_and_technical_concerns"}, {"score": 0.0033797211728461584, "phrase": "personal_data"}, {"score": 0.003067717298233605, "phrase": "overall_processes"}, {"score": 0.0028705364714772083, "phrase": "special_attention"}, {"score": 0.0023581827290168464, "phrase": "selected_indicators"}, {"score": 0.0022187659808640433, "phrase": "better_values"}, {"score": 0.0022004029656808224, "phrase": "chosen_indicators"}], "paper_keywords": ["Health Management Information System (HMIS or HIS)", " Quality Health Information", " Security Health Information", " Software Engineering", " Security", " Quality", " HIS", " Personal Health Record (PHR)", " Electronic Health Record (EHR)"], "paper_abstract": "There is currently a need to optimize the levels of perceived quality in most public services. Some of the most critical services are those related to Health, since health and welfare are fundamental to the population as a whole. Both public and private Health organizations are therefore interested in quantifying how good their services are, and to what extent the population is satisfied with their usage. These services can be classified into two main groups: health management and clinical. The performance of both kinds of processes is being assessed through the development of certain indicators. However, as these processes are intended to be supported by Health Management Information Systems (HMIS), some legal and technical concerns must be addressed when an HMIS is developed. These HMIS commonly manage personal data which is highly sensitive, and some mechanisms to ensure both security and data quality should therefore be also implemented. But the assurance of security and data quality goes beyond the HMIS, to the overall processes. This paper introduces a framework, HC+, whose objective is to assess and improve the level of perceived quality for services by paying special attention to the way in which the processes manage the levels of security and data quality. This will be achieved by studying the dependence of indicators that are able to describe the levels of perceived quality from the levels of security and data quality. HC+ is composed of three main components: a common Information Model with which to better represent the elements of the processes involved in the study, a set of selected Indicators to measure the levels of quality, and a Methodology to assess and improve the processes so that they can obtain better values for the chosen indicators. In addition, all the changes and decisions made should be consistent with the Quality Management System (e.g. ISO 9000) of the Organization.", "paper_title": "HC plus : Towards a Framework for Improving Processes in Health Organizations by Means of Security and Data Quality Management", "paper_id": "WOS:000308796100007"}