{"auto_keywords": [{"score": 0.04914385504182288, "phrase": "pcos"}, {"score": 0.04284665686826295, "phrase": "recently_published_literature"}, {"score": 0.040762583005439654, "phrase": "ultrasound_images"}, {"score": 0.040089713473101495, "phrase": "proposed_system"}, {"score": 0.03566936043525717, "phrase": "object_growing_algorithm"}, {"score": 0.03549928021386719, "phrase": "follicle_identification"}, {"score": 0.03516146028160122, "phrase": "cost_map"}, {"score": 0.028400074369868366, "phrase": "proposed_diagnostic_system"}, {"score": 0.00481495049065317, "phrase": "polycystic_ovary_syndrome"}, {"score": 0.004674540255612302, "phrase": "complex_endocrine_disorder"}, {"score": 0.0046286484525233885, "phrase": "women's_health"}, {"score": 0.004438559261607655, "phrase": "predominant_diagnosis"}, {"score": 0.004266758267694741, "phrase": "intra-observer_variability"}, {"score": 0.004204054047427536, "phrase": "computer-aided_pcos_diagnostic_system"}, {"score": 0.004011481543601978, "phrase": "human_interaction"}, {"score": 0.003913682716189916, "phrase": "automated_pcos_diagnostic_system"}, {"score": 0.0036613284931115687, "phrase": "preprocessing_phase"}, {"score": 0.003643293770051351, "phrase": "speckle_noise"}, {"score": 0.0036164075087020994, "phrase": "input_image"}, {"score": 0.003572035685714202, "phrase": "adaptive_morphological_filter"}, {"score": 0.0034935290662899488, "phrase": "enhanced_labeled_watershed_algorithm"}, {"score": 0.003228064431860277, "phrase": "cost_function"}, {"score": 0.003034742526832435, "phrase": "possible_follicles"}, {"score": 0.0029900896231825685, "phrase": "proposed_method"}, {"score": 0.002831894638104635, "phrase": "boundary_vector_field"}, {"score": 0.0027833316789624817, "phrase": "fuzzy_support_vector_machine"}, {"score": 0.0026953359825383646, "phrase": "subject_matter_experts"}, {"score": 0.002559012656319167, "phrase": "level_set_method"}, {"score": 0.002540107619260803, "phrase": "bvf_method"}, {"score": 0.0025213418925668163, "phrase": "fsvm_classifier"}, {"score": 0.0023937976277397972, "phrase": "better_performance"}, {"score": 0.002318088516037056, "phrase": "automated_diagnostic_system"}, {"score": 0.002195368428060088, "phrase": "experimental_results"}, {"score": 0.0021364613650251786, "phrase": "pcos_diagnosis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Object growing", " Automated detection of follicles", " Polycystic ovary syndrome", " Ultrasound images"], "paper_abstract": "Objective: Polycystic ovary syndrome (PCOS) is a complex endocrine disorder that seriously affects women's health. The disorder is characterized by the formation of many follicles in the ovary. Currently the predominant diagnosis is to manually count the number of follicles, which may lead to inter-observer and intra-observer variability and low efficiency. A computer-aided PCOS diagnostic system may overcome these problems. However the methods reported in recently published literature are not very effective and often need human interaction. To overcome these problems, we propose an automated PCOS diagnostic system based on ultrasound images. Methods and materials: The proposed system consists of two major functional blocks: preprocessing phase and follicle identification based on object growing. In the preprocessing phase, speckle noise in the input image is removed by an adaptive morphological filter, then contours of objects are extracted using an enhanced labeled watershed algorithm, and finally the region of interest is automatically selected. The object growing algorithm for follicle identification first computes a cost map to distinguish between the ovary and its external region and assigns each object a cost function based on the cost map. The object growing algorithm initially selects several objects that are likely to be follicles with very high probabilities and dynamically update the set of possible follicles based on their cost functions. The proposed method was applied to 31 real PCOS ultrasound images obtained from patients and its performance was compared with those of three other methods, including level set method, boundary vector field (BVF) method and the fuzzy support vector machine (FSVM) classifier. Results: Based on the judgment of subject matter experts, the proposed diagnostic system achieved 89.4% recognition rate (RR) and 7.45% misidentification rate (MR) while the RR and MR of the level set method, the BVF method and the FSVM classifier are around 65.3% and 2.11%, 76.1% and 4.53%, and 84.0% and 16.3%, respectively. The proposed diagnostic system also achieved better performance than those reported in recently published literature. Conclusion: The paper proposed an automated diagnostic system for the PCOS using ultrasound images, which consists of two major functional blocks: preprocessing phase and follicle identification based on object growing. Experimental results showed that the proposed system is very effective in follicle identification for PCOS diagnosis. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "An automated diagnostic system of polycystic ovary syndrome based on object growing", "paper_id": "WOS:000290281900005"}