{"auto_keywords": [{"score": 0.02142384133409441, "phrase": "inverse_problem"}, {"score": 0.01061274527813837, "phrase": "matlab"}, {"score": 0.007805646735854829, "phrase": "sippi"}, {"score": 0.005998077840371179, "phrase": "extended_metropolis_algorithm"}, {"score": 0.004589307360976108, "phrase": "probabilistic_point"}, {"score": 0.004314595541370065, "phrase": "independent_states"}, {"score": 0.004241235563017201, "phrase": "probability_density_functions"}, {"score": 0.004042369239448456, "phrase": "observed_data"}, {"score": 0.003919459003028067, "phrase": "combined_states"}, {"score": 0.0037484651075873968, "phrase": "probability_density_function"}, {"score": 0.0036095967013657906, "phrase": "generic_toolbox"}, {"score": 0.0035603802089559716, "phrase": "gnu_octave"}, {"score": 0.0032452142903668666, "phrase": "simple_gaussian_models"}, {"score": 0.0031464653712924436, "phrase": "priori_models"}, {"score": 0.003114219280081737, "phrase": "higher_order_statistics"}, {"score": 0.003019444345150991, "phrase": "linear_and_non-linear_inverse_problems"}, {"score": 0.0029687761777331765, "phrase": "gaussian"}, {"score": 0.0028876014831335, "phrase": "kriging-based_methods"}, {"score": 0.0025959133277517824, "phrase": "sequential_gibbs_sampling"}, {"score": 0.002569294946452846, "phrase": "computationally_efficient_sampling"}, {"score": 0.002551700779294785, "phrase": "complex_a_priori_models"}, {"score": 0.002398664348595521, "phrase": "forward_problem"}, {"score": 0.0022938652373998337, "phrase": "sippi."}, {"score": 0.0022163699144426155, "phrase": "borehole_inverse_problems"}, {"score": 0.0021711323811863963, "phrase": "second_part"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Inversion", " Nonlinear", " Sampling", " A priori", " A posteriori"], "paper_abstract": "From a probabilistic point-of-view, the solution to an inverse problem can be seen as a combination of independent states of information quantified by probability density functions. Typically, these states of information are provided by a set of observed data and some a priori information on the solution. The combined states of information (i.e. the solution to the inverse problem) is a probability density function typically referred to as the a posteriori probability density function. We present a generic toolbox for Matlab and Gnu Octave called SIPPI that implements a number of methods for solving such probabilistically formulated inverse problems by sampling the a posteriori probability density function. In order to describe the a priori probability density function, we consider both simple Gaussian models and more complex (and realistic) a priori models based on higher order statistics. These a priori models can be used with both linear and non-linear inverse problems. For linear inverse Gaussian problems we make use of least-squares and kriging-based methods to describe the a posteriori probability density function directly. For general nonlinear (i.e. non-Gaussian) inverse problems, we make use of the extended Metropolis algorithm to sample the a posteriori probability density function. Together with the extended Metropolis algorithm, we use sequential Gibbs sampling that allow computationally efficient sampling of complex a priori models. The toolbox can be applied to any inverse problem as long as a way of solving the forward problem is provided. Here we demonstrate the methods and algorithms available in SIPPI. An application of SIPPI, to a tomographic cross borehole inverse problems, is presented in a second part of this paper. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "SIPPI: A Matlab toolbox for sampling the solution to inverse problems with complex prior information Part 1-Methodology", "paper_id": "WOS:000315558400049"}