{"auto_keywords": [{"score": 0.015435571610618171, "phrase": "accessory_protein_recruitment_motifs"}, {"score": 0.013683039496282945, "phrase": "non-clathrin-coated_vesicles"}, {"score": 0.009804496505887605, "phrase": "appendage_domain"}, {"score": 0.00481495049065317, "phrase": "binding_sites"}, {"score": 0.004692229572951354, "phrase": "copi"}, {"score": 0.004108589735101849, "phrase": "intra-golgi_and_golgi-to-er_protein_trafficking"}, {"score": 0.003916098498242888, "phrase": "entire_sequences"}, {"score": 0.0035708152831417104, "phrase": "successive_molecular_dynamics_investigations"}, {"score": 0.0034540850937966336, "phrase": "protein-protein_docking_experiment"}, {"score": 0.0034160263294684785, "phrase": "three-dimensional_structures"}, {"score": 0.0030576885787607796, "phrase": "complexed_state"}, {"score": 0.0026966744704447275, "phrase": "binding_site"}, {"score": 0.0025324393547676623, "phrase": "second_site"}, {"score": 0.0024495702960480076, "phrase": "beta-sandwich_subdomain"}, {"score": 0.0023781827711414107, "phrase": "amphiphysin_fxdxf"}, {"score": 0.002233301265743633, "phrase": "peptide_motif"}, {"score": 0.0021284812539167112, "phrase": "accessory_proteins"}, {"score": 0.0021049977753042253, "phrase": "trafficking_process"}], "paper_keywords": ["Protein trafficking", " Coatomer subunits", " Homology modeling", " Molecular dynamics", " Docking", " Accessory protein motifs"], "paper_abstract": "COPI, a 600 kD heptameric complex (consisting of subunits alpha, beta, gamma, delta, epsilon, zeta, and beta') \"coatomer,\" assembles non-clathrin-coated vesicles and is responsible for intra-Golgi and Golgi-to-ER protein trafficking. Here, we report the three-dimensional structures of the entire sequences of yeast Sec21 (gamma-COPI mammalian ortholog), yeast Ret3 (zeta-COPI mammalian ortholog), and the results of successive molecular dynamics investigations of the subunits and assembly based on a protein-protein docking experiment. The three-dimensional structures of the subunits in their complexes indicate the residues of the two subunits that impact on assembly, the conformations of Ret3 and Sec21, and their binding orientations in the complexed state. The structure of the appendage domain of Sec21, with its two subdomains-the platform and the beta-sandwich, was investigated to explore its capacity to bind to accessory protein recruitment motifs. Our study shows that a binding site on the platform is capable of binding the Eps15 DPF and epsin DPW2 peptides, whereas the second site on the platform and the site on the beta-sandwich subdomain were found to selectively bind to the amphiphysin FXDXF and epsin DPW1 peptides, respectively. Identifying the regions of both the platform and sandwich subdomains involved in binding each peptide motif clarifies the mechanism through which the appendage domain of Sec21 engages with the accessory proteins during the trafficking process of non-clathrin-coated vesicles.", "paper_title": "Full-length structural model of RET3 and SEC21 in COPI: identification of binding sites on the appendage for accessory protein recruitment motifs", "paper_id": "WOS:000305602900029"}