{"auto_keywords": [{"score": 0.039682325996342485, "phrase": "global_selection_pressure"}, {"score": 0.02848867238178844, "phrase": "proposed_algorithm"}, {"score": 0.004815340879031445, "phrase": "adaptive"}, {"score": 0.004605258779434384, "phrase": "exploration_and_exploitation_processes"}, {"score": 0.004470539706227421, "phrase": "new_adaptive_algorithm"}, {"score": 0.004150661689086371, "phrase": "three-dimensional_cellular_genetic_algorithms"}, {"score": 0.0037222908218253054, "phrase": "dynamic_tuning"}, {"score": 0.0036673959568781734, "phrase": "local_selection_rate"}, {"score": 0.0036133077234252633, "phrase": "parameter_tuning"}, {"score": 0.0035600143547053287, "phrase": "local_selection_method"}, {"score": 0.0033879628186273625, "phrase": "diversity_speed_measure"}, {"score": 0.003176626803985225, "phrase": "existing_techniques"}, {"score": 0.003038066486989815, "phrase": "well-known_continuous_test_functions"}, {"score": 0.002579622880371082, "phrase": "different_effects"}, {"score": 0.0021049977753042253, "phrase": "different_selection_pressures"}], "paper_keywords": ["Evolutionary algorithms (EAs)", " Cellular genetic algorithms (cGAs)", " Dynamic adaptation", " Selection pressure"], "paper_abstract": "This paper presents a new adaptive algorithm that aims to control the exploration/exploitation trade-off dynamically. The algorithm is designed based on three-dimensional cellular genetic algorithms (3D-cGAs). In this study, our methodology is based on the change in the global selection pressure induced by dynamic tuning of the local selection rate. The parameter tuning of the local selection method is a way to define the global selection pressure. A diversity speed measure is used to guide the algorithm. Therefore, the integration of existing techniques helps in achieving our aims. A benchmark of well-known continuous test functions and real world problems was selected to investigate the effectiveness of the algorithm proposed. In addition, we provide a comparison between the proposed algorithm and other static and dynamic algorithms in order to study the different effects on the performance of the algorithms. Overall, the results show that the proposed algorithm provides the most desirable performance in terms of efficiency, efficacy, and speed for most problems considered. The results also confirm that problems of various characteristics require different selection pressures, which are difficult to be identified.", "paper_title": "Adaptive three-dimensional cellular genetic algorithm for balancing exploration and exploitation processes", "paper_id": "WOS:000320043100004"}