{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "triangle-area_representation"}, {"score": 0.00447115003744675, "phrase": "shape_retrieval_method"}, {"score": 0.004296264970612285, "phrase": "closed_contours"}, {"score": 0.003989351600022163, "phrase": "boundary_points"}, {"score": 0.003789763907758991, "phrase": "different_scales"}, {"score": 0.003725470458263889, "phrase": "triangle_side_lengths"}, {"score": 0.0035189057079817285, "phrase": "local_and_global_characteristics"}, {"score": 0.0031573626285069157, "phrase": "moderate_amounts"}, {"score": 0.003051073364818384, "phrase": "matching_stage"}, {"score": 0.002585539416877115, "phrase": "optimal_correspondence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["shape matching", " shape retrieval", " dynamic space warping", " dynamic programming"], "paper_abstract": "In this paper, we present a shape retrieval method using triangle-area representation for nonrigid shapes with closed contours. The representation utilizes the areas of the triangles formed by the boundary points to measure the convexity/concavity of each point at different scales (or triangle side lengths). This representation is effective in capturing both local and global characteristics of a shape, invariant to translation, rotation, and scaling, and robust against noise and moderate amounts of occlusion. In the matching stage, a dynamic space warping (DSW) algorithm is employed to search efficiently for the optimal (least cost) correspondence between the points of two shapes. Then, a distance is derived based on the optimal correspondence. The performance of our method is demonstrated using four standard tests on two well-known shape databases. The results show the superiority of our method over other recent methods in the literature. (c) 2007 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Shape retrieval using triangle-area representation and dynamic space warping", "paper_id": "WOS:000246332300005"}