{"auto_keywords": [{"score": 0.03447147592902459, "phrase": "goal_synthesis"}, {"score": 0.00481495049065317, "phrase": "transportation_network"}, {"score": 0.00464811139983244, "phrase": "multi-objective_transportation_network_optimization"}, {"score": 0.0044870272550540415, "phrase": "research_literature"}, {"score": 0.003995876175614403, "phrase": "single_objective"}, {"score": 0.0036491673002304326, "phrase": "real-world_transportation_network_optimization_problems"}, {"score": 0.0034348484776384643, "phrase": "multi-objective_optimization"}, {"score": 0.0030431198971423937, "phrase": "seven_instances"}, {"score": 0.0028933521924166287, "phrase": "preferred_approach"}, {"score": 0.002764856305713066, "phrase": "single_optimization_model"}, {"score": 0.0026023381988430666, "phrase": "multi-objective_optimization_method"}, {"score": 0.002486734224234698, "phrase": "experimental_results"}, {"score": 0.002400373755068185, "phrase": "poor_quality_solutions"}, {"score": 0.002214048743052355, "phrase": "superposition_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Transportation network optimization", " Ant colony optimization", " Multi-goal methods", " Logistics optimization"], "paper_abstract": "Lately the topic of multi-objective transportation network optimization has received increased attention in the research literature. The use of multi-objective transportation network optimization has led to a more accurate and realistic solution in comparison to scenarios where only a single objective is considered. The aim of this work is to identify the most promising multi-objective optimization technique for use in solving real-world transportation network optimization problems. We start by reviewing the state of the art in multi-objective optimization and identify four generic strategies, which are referred to as goal synthesis, superposition, incremental solving and exploration. We then implement and test seven instances of these four strategies. From the literature, the preferred approach lies in the combination of goals into a single optimization model (a.k.a. goal synthesis). Despite its popularity as a multi-objective optimization method and in the context of our problem domain, the experimental results achieved by this method resulted in poor quality solutions when compared to the other strategies. This was particularly noticeable in the case of the superposition method which significantly outperformed goal synthesis. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Composite goal methods for transportation network optimization", "paper_id": "WOS:000356904100003"}