{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "iso"}, {"score": 0.0046859752697029355, "phrase": "purpose_-_the_purpose"}, {"score": 0.004542780650208743, "phrase": "operational_definition"}, {"score": 0.004352974291381373, "phrase": "theoretical_construct"}, {"score": 0.004122781047853192, "phrase": "quality_management"}, {"score": 0.00393516113722461, "phrase": "spanish"}, {"score": 0.003698136685049485, "phrase": "specific_factors"}, {"score": 0.0033690254452595865, "phrase": "clearly_relevant_one"}, {"score": 0.0033170847930578473, "phrase": "previous_works"}, {"score": 0.0029292922955739963, "phrase": "academic_and_professional_spheres"}, {"score": 0.002839625463110821, "phrase": "key_aspects"}, {"score": 0.0028067105937184954, "phrase": "substantive_adoption"}, {"score": 0.0026477564788515984, "phrase": "relevant_construct"}, {"score": 0.002566685388128598, "phrase": "subsequent_works"}, {"score": 0.0024977819584875573, "phrase": "new_exploratory_work"}, {"score": 0.002310915790114425, "phrase": "homogeneous_adoption"}, {"score": 0.0021715177915174375, "phrase": "managers'_opinions"}, {"score": 0.0021049977753042253, "phrase": "participative_observation"}], "paper_keywords": ["Spain", " Quality management", " ISO 9001", " ISO 9000", " Internalization", " Construct operationalisation"], "paper_abstract": "Purpose - The purpose of this paper is to develop the operational definition of the concept of internalization of ISO 9001, a theoretical construct which until recently had not received the attention it deserves in research on quality management. Design/methodology/approach - Extensive exploratory fieldwork based on both in-depth interviews of general managers, middle managers and employees 65 in total as well as on intensive participant observation e.g. 139 direct field-consults and 240 documents analyzed was carried out in eight Spanish organizations that adopted the standard a long time ago. Findings - A set of specific factors and subfactors aimed at operationalizing the ISO 9001 internalization construct are proposed. Moreover, it has been ascertained that the concept of internalization is a clearly relevant one, as in previous works found in the literature in other countries, the conclusion is drawn that organizations do not adopt ISO 9001 homogeneously. Practical implications - The conclusions may be of interest both for academic and professional spheres of activity. For managers, the key aspects of a substantive adoption of ISO 9001 are highlighted. For academics, certain specific categorization elements are proposed for a relevant construct so that these may be used in subsequent works. Originality/value - This is a new exploratory work for its field of research. On the one hand, most works to date have tended to assume the principle of homogeneous adoption of ISO 9001. On the other, they tend to be based solely on managers' opinions without giving voice to employees or using participative observation.", "paper_title": "Internalization of ISO 9000: an exploratory study", "paper_id": "WOS:000296823100004"}