{"auto_keywords": [{"score": 0.049014830901543946, "phrase": "split_deliveries"}, {"score": 0.00481495049065317, "phrase": "capacitated_team"}, {"score": 0.0045262653692203815, "phrase": "potential_customers"}, {"score": 0.003954837422946628, "phrase": "capacitated_vehicles"}, {"score": 0.0035539019235553897, "phrase": "maximum_time"}, {"score": 0.0034166271604770576, "phrase": "vehicle_capacity_constraints"}, {"score": 0.0029020077365708966, "phrase": "twice_the_profit"}, {"score": 0.00257831812581194, "phrase": "branch-and-price_exact_algorithm"}, {"score": 0.0024097920845706795, "phrase": "proposed_approaches"}, {"score": 0.0023827927890399357, "phrase": "benchmark_instances"}, {"score": 0.0023296961971785357, "phrase": "new_set"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["capacitated team orienteering problem", " split deliveries", " worst-case analysis", " branch-and-price", " heuristic"], "paper_abstract": "In this article, we study the capacitated team orienteering problem where split deliveries are allowed. A set of potential customers is given, each associated with a demand and a profit. The set of customers to be served by a fleet of capacitated vehicles has to be identified in such a way that the profit collected is maximized, while satisfying constraints on the maximum time duration of each route and the vehicle capacity constraints. When split deliveries are allowed, each customer may be served by more than one vehicle. We show that the profit collected by allowing split deliveries may be as large as twice the profit collected under the constraint that each customer has to be served by one vehicle at most. We then present a branch-and-price exact algorithm and a hybrid heuristic. We show the effectiveness of the proposed approaches on benchmark instances and on a new set of instances that allow us to computationally evaluate the impact of split deliveries. (c) 2013 Wiley Periodicals, Inc. NETWORKS, Vol. 63(1), 16-33 2014", "paper_title": "The Split Delivery Capacitated Team Orienteering Problem", "paper_id": "WOS:000327733000003"}