{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multi-method_approach"}, {"score": 0.03628364854325394, "phrase": "agile_spl"}, {"score": 0.0047602693158272655, "phrase": "agile_software_product_lines"}, {"score": 0.004478907336898875, "phrase": "similar_objectives"}, {"score": 0.004428025469002531, "phrase": "main_difference"}, {"score": 0.004246333442872459, "phrase": "typically_evidence"}, {"score": 0.00394981748347167, "phrase": "different_research_methods"}, {"score": 0.0037446140218109895, "phrase": "research_topic"}, {"score": 0.003659954070354848, "phrase": "previous_studies"}, {"score": 0.003352722512047951, "phrase": "identified_evidence"}, {"score": 0.0027495914857929584, "phrase": "multi-method_research"}, {"score": 0.0026771333996253783, "phrase": "high_degree"}, {"score": 0.0022806798371116698, "phrase": "agile_spl."}, {"score": 0.002229043128610864, "phrase": "new_agile_spl_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Agile", " Software product lines", " Multi-method approach", " Case study", " Mapping study", " Expert opinion"], "paper_abstract": "Context: Software product lines (SPLs) and Agile are approaches that share similar objectives. The main difference is the way in which these objectives are met. Typically evidence on what activities of Agile and SPL can be combined and how they can be integrated stems from different research methods performed separately. The generalizability of this evidence is low, as the research topic is still relatively new and previous studies have been conducted using only one research method. Objective: This study aims to increase understanding of Agile SPL and improve the generalizability of the identified evidence through the use of a multi-method approach. Method: Our multi-method research combines three complementary methods (Mapping Study, Case Study and Expert Opinion) to consolidate the evidence. Results: This combination results in 23 findings that provide evidence on how Agile and SPL could be combined. Conclusion: Although multi-method research is time consuming and requires a high degree of effort to plan, design, and perform, it helps to increase the understanding on Agile SPL and leads to more generalizable evidence. The findings confirm a synergy between Agile and SPL and serve to improve the body of evidence in Agile SPL. When researchers and practitioners develop new Agile SPL approaches, it will be important to consider these synergies. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Using a multi-method approach to understand Agile software product lines", "paper_id": "WOS:000345947500030"}