{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "online_shopping_information_dependency"}, {"score": 0.006339140732331077, "phrase": "consumer_innovativeness"}, {"score": 0.006293236573856078, "phrase": "online_shopping"}, {"score": 0.006270408511542567, "phrase": "information_dependency"}, {"score": 0.004745362527093198, "phrase": "internet_shopping_adoption"}, {"score": 0.00467677555573346, "phrase": "paper's_purpose"}, {"score": 0.00444439983637316, "phrase": "internet_shopping"}, {"score": 0.003984444229875069, "phrase": "findings_-_data_analysis"}, {"score": 0.0038559375376635047, "phrase": "direct_and_positive_influence_oil_future_online_shopping_intention"}, {"score": 0.003260860308644701, "phrase": "shopping_medium"}, {"score": 0.00315561677959372, "phrase": "shopping_channel"}, {"score": 0.0029230308228548807, "phrase": "non-purchasing_web_users"}, {"score": 0.0028597742552122305, "phrase": "perceived_case"}, {"score": 0.0027876981671591202, "phrase": "significant_influence_oil_shoppers'_willingness"}, {"score": 0.002707541142254756, "phrase": "wen_content"}, {"score": 0.0026683288015968243, "phrase": "key_tools"}, {"score": 0.0026201089205321704, "phrase": "future_online_purchasing"}, {"score": 0.0024004805502253427, "phrase": "file_effects"}, {"score": 0.0023485057246680854, "phrase": "non-purchasing_web_users'_behaviour"}, {"score": 0.002167355210897559, "phrase": "improved_model"}, {"score": 0.0021515951441422082, "phrase": "internet_shopping_acceptance"}, {"score": 0.0021049977753042253, "phrase": "integrated_model"}], "paper_keywords": ["Innovation", " Online operations", " Shopping", " Consumer behaviour", " Electronic commerce", " Spain"], "paper_abstract": "Purpose The paper's purpose is to analyse the influence Of online shopping information dependency and innovativeness on the acceptance of internet shopping. Design/methodology/approach - The impact of online shopping information dependency, domain-specific innovativeness and technology acceptance model (TAM) variables oil future shopping intention has been tested through structural equation modelling techniques. The sample consisted of 465 Spanish consumers who had never purchased online. Findings - Data analysis shows that consumer innovativeness and online shopping information dependency have a direct and positive influence Oil future Online shopping intention and that the basic TAM hypotheses are fulfilled. Online shopping, information dependency, can be increased with interface that are easier to use, but only if perceived usefulness remains high. Consumer innovativeness positively, influences internet exposure and the ease-of-use perception of the shopping medium, referred to throughput this paper as \"shopping channel\". Practical implications - This research enables companies to know which aspects of their communication strategies to highlight in Order to get non-purchasing web users to participate in C-shopping. Perceived case of use and online shopping information dependency has a significant influence oil shoppers' willingness to purchase online. This shows that wen content and design are key tools in the increase of future online purchasing. It is also recommended that managers target some of their advertising campaigns to the more innovative users. Originality/value - There are still too few studies that analyse file effects of innovativeness and online shopping information dependency on non-purchasing web users' behaviour. This work aims to combine the influence of online shopping information dependency. innovativeness and the traditional TAM in Order to construct an improved model for internet Shopping acceptance. It will use all integrated model to do so.", "paper_title": "Influence of online shopping information dependency and innovativeness on internet shopping adoption", "paper_id": "WOS:000261439400008"}