{"auto_keywords": [{"score": 0.049255390034042286, "phrase": "survivable_version"}, {"score": 0.030708473192790596, "phrase": "centralized_optimum"}, {"score": 0.00481495049065317, "phrase": "survivable_network_design"}, {"score": 0.004683073921949839, "phrase": "game_theoretic_network_formation_model"}, {"score": 0.0045547927862194856, "phrase": "anshelevich_et_al"}, {"score": 0.0044608829094248985, "phrase": "acm_symposium_on_theory_of_computing"}, {"score": 0.004234456398783788, "phrase": "common_source"}, {"score": 0.0036595438031512217, "phrase": "exact_and_approximate_nash_equilibria"}, {"score": 0.0035468507553681034, "phrase": "original_connection_game"}, {"score": 0.0034736499231079083, "phrase": "existing_literature"}, {"score": 0.003449585750738867, "phrase": "arbitrary_cost-sharing_games"}, {"score": 0.003285725064532174, "phrase": "special_case"}, {"score": 0.0031624392548836654, "phrase": "nash_equilibria"}, {"score": 0.0029705677977833857, "phrase": "stable_solution"}, {"score": 0.0028590732866152118, "phrase": "general_version"}, {"score": 0.0028293966058473476, "phrase": "survivable_connection_game"}, {"score": 0.002584733102974067, "phrase": "approximation_algorithm_technique"}, {"score": 0.0021049977753042253, "phrase": "time_complexity_issues"}], "paper_keywords": ["Survivable network design", " Connection game", " Price of stability", " Nash equilibrium", " Network formation games", " Algorithmic game theory"], "paper_abstract": "We study the survivable version of the game theoretic network formation model known as the Connection Game, originally introduced in Anshelevich et al. (Proc. 35th ACM Symposium on Theory of Computing, 2003). In this model, players attempt to connect to a common source node in a network by purchasing edges, and sharing their costs with other players. We introduce the survivable version of this game, where each player desires 2 edge-disjoint connections between her pair of nodes instead of just a single connecting path, and analyze the quality of exact and approximate Nash equilibria. This version is significantly different from the original Connection Game and have more complications than the existing literature on arbitrary cost-sharing games since we consider the formation of networks that involve many cycles. For the special case where each node represents a player, we show that Nash equilibria are guaranteed to exist and price of stability is 1, i.e., there always exists a stable solution that is as good as the centralized optimum. For the general version of the Survivable Connection Game, we show that there always exists a 2-approximate Nash equilibrium that is as good as the centralized optimum. To obtain the result, we use an approximation algorithm technique that compares the strategy of each player with only a carefully selected subset of her strategy space. Furthermore, if a player is only allowed to deviate by changing the payments on one of her connection paths at a time, instead of both of them at once, we prove that the price of stability is 1. We also discuss the time complexity issues.", "paper_title": "Price of Stability in Survivable Network Design", "paper_id": "WOS:000290322500006"}