{"auto_keywords": [{"score": 0.049675053299362504, "phrase": "gene_expression_data"}, {"score": 0.015719716506582538, "phrase": "naive-bayes_classifier"}, {"score": 0.015329386272518349, "phrase": "nbc"}, {"score": 0.007742199005195083, "phrase": "classification_accuracy"}, {"score": 0.004537631845923196, "phrase": "machine_learning"}, {"score": 0.004404994123834589, "phrase": "first_choice"}, {"score": 0.004116139569480336, "phrase": "high_dimensional_data"}, {"score": 0.003670843919846253, "phrase": "existing_approach"}, {"score": 0.0034445472801689046, "phrase": "estimate_approach"}, {"score": 0.0033437537557378157, "phrase": "overfitting_problem"}, {"score": 0.0030586736004285216, "phrase": "novel_approach"}, {"score": 0.002931569771634119, "phrase": "robust_function"}, {"score": 0.002833689453299307, "phrase": "proposed_method"}, {"score": 0.002526780881314497, "phrase": "comparative_results"}, {"score": 0.002505412457777352, "phrase": "proposed_robust_naive-bayes_classifier"}, {"score": 0.00229164285862567, "phrase": "r-nbc._simulation_study"}, {"score": 0.0021593396036472777, "phrase": "existing_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Classification", " Naive-Bayes", " Gene expression data"], "paper_abstract": "Naive-Bayes Classifier (NBC) is widely used for classification in machine learning. It is considered as the first choice for many classification problems because of its simplicity and classification accuracy as compared to other supervised learning methods. However, for high dimensional data like gene expression data, it does not perform well due to two major limitations i.e. underflow and overfitting. In order to address the problem of underflow, the existing approach adopted is to add the logarithms of probabilities rather than multiplying probabilities and the estimate approach is used for providing solution to overfitting problem. However, in practice for gene expression data, these approaches do not perform well. In this paper, a novel approach has been proposed to overcome the limitations using a robust function for estimating probabilities in Naive-Bayes Classifier. The proposed method not only resolves the limitation of NBC but also improves the classification accuracy for gene expression data. The method has been tested over several benchmark gene expression datasets of high dimension. Comparative results of proposed Robust Naive-Bayes Classifier (R-NBC) and existing NBC for gene expression data have also been illustrated to highlight the effectiveness of the R-NBC. Simulation study has also been performed to depict the robustness of the R-NBC over the existing approaches. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Robust approach for estimating probabilities in Naive-Bayes Classifier for gene expression data", "paper_id": "WOS:000284863200003"}