{"auto_keywords": [{"score": 0.045235290132819427, "phrase": "traditional_election"}, {"score": 0.00481495049065317, "phrase": "key_exchange_protocol"}, {"score": 0.004745665541429529, "phrase": "democratic_society"}, {"score": 0.003799509133780117, "phrase": "heavy_burden"}, {"score": 0.003516558537200823, "phrase": "\"electronic_voting"}, {"score": 0.0029400959763737364, "phrase": "electronic_voting_mechanism"}, {"score": 0.0028284184438992282, "phrase": "electronic_voting"}, {"score": 0.0024224481033945943, "phrase": "efficient_and_secure_voting_mechanism"}, {"score": 0.002387507583705495, "phrase": "chaum's_blind_signature_scheme"}, {"score": 0.002364496137483642, "phrase": "diffie-hellman"}, {"score": 0.002241816883550397, "phrase": "essential_requirements"}, {"score": 0.0022202042044679984, "phrase": "general_electronic_voting_schemes"}, {"score": 0.002177600561610171, "phrase": "better_efficiency"}, {"score": 0.0021049977753042253, "phrase": "practical_one"}], "paper_keywords": ["election", " electronic voting", " anonymity", " blind signature", " key exchange"], "paper_abstract": "In democratic society, elections and voting are always the most important hallmarks. However, there are plenty of problems in the traditional election such as inconvenience, unfairness, non-mobility, non-anonymity, and so forth. What is more, the cost of the traditional election often places a heavy burden on the nation. To solve the problems of the traditional election, the concept of \"electronic voting\" is introduced, where people are allowed to vote over the Internet and the government can save lots of money. The properties of mobility and convenience are the most significant reasons why people may adopt the electronic voting mechanism in the future. Although technologies for electronic voting have been developed for about 20 years, some problems, such as uncoercibility and completeness, still cannot be overcome. in this article, we are going to present an efficient and secure voting mechanism by employing Chaum's blind signature scheme and Diffie-Hellman key exchange protocol. Our proposed electronic voting mechanism not only achieves lots of essential requirements of general electronic voting schemes but also possesses better efficiency such that it can be the practical one. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "An anonymous voting mechanism based on the key exchange protocol", "paper_id": "WOS:000238929300023"}