{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "safe_landing_zones"}, {"score": 0.010922629619276394, "phrase": "uav"}, {"score": 0.004695900553353526, "phrase": "environmental_monitoring"}, {"score": 0.004579780586951551, "phrase": "natural_disaster"}, {"score": 0.004485200522202792, "phrase": "unmanned_aerial_vehicles"}, {"score": 0.004301834610818624, "phrase": "highly_versatile_and_often_relatively_inexpensive_sensing_platform"}, {"score": 0.0039737570920809215, "phrase": "real-time_colour_imagery"}, {"score": 0.0035648266669315943, "phrase": "manned_aircraft"}, {"score": 0.00290473242917264, "phrase": "safety_critical_event"}, {"score": 0.0027974705482714884, "phrase": "safety_score"}, {"score": 0.0027510752634224726, "phrase": "multichannel_aerial_imagery"}, {"score": 0.0026164433143193015, "phrase": "ordnance_survey"}, {"score": 0.0025730425700096365, "phrase": "map_data"}, {"score": 0.002509284173541882, "phrase": "real-time_nature"}, {"score": 0.0022507188208913394, "phrase": "colour_aerial_imagery"}, {"score": 0.002194929830604162, "phrase": "practical_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["UAV safe landing zone detection", " Terrain classification", " Fuzzy logic", " UAV safety"], "paper_abstract": "For many applications such as environmental monitoring in the aftermath of a natural disaster and mountain search-and-rescue, swarms of autonomous Unmanned Aerial Vehicles (UAVs) have the potential to provide a highly versatile and often relatively inexpensive sensing platform. Their ability to operate as an 'eye-in-the-sky', processing and relaying real-time colour imagery and other sensor readings facilitate the removal of humans from situations which may be considered dull, dangerous or dirty. However, as with manned aircraft they are likely to encounter errors, the most serious of which may require the UAV to land as quickly and safely as possible. Within this paper we therefore present novel work on autonomously identifying Safe Landing Zones (SLZs) which can be utilised upon occurrence of a safety critical event. Safe Landing Zones are detected and subsequently assigned a safety score either solely using multichannel aerial imagery or, whenever practicable by fusing knowledge in the form of Ordnance Survey (OS) map data with such imagery. Given the real-time nature of the problem we subsequently model two SLZ detection options one of which utilises knowledge enabling the UAV to choose an optimal, viable solution. Results are presented based on colour aerial imagery captured during manned flight demonstrating practical potential in the methods discussed. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Timely autonomous identification of UAV safe landing zones", "paper_id": "WOS:000341477800002"}