{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "spike-and-slab_models"}, {"score": 0.004071957673937727, "phrase": "first_model"}, {"score": 0.003955926499405168, "phrase": "spike-and-slab_sparse_coding"}, {"score": 0.0037989951856280423, "phrase": "preexisting_model"}, {"score": 0.0036694287631595995, "phrase": "faster_approximate_inference_algorithm"}, {"score": 0.0035648266669315943, "phrase": "deep_variant"}, {"score": 0.003345320003165773, "phrase": "boltzmann"}, {"score": 0.0027475383418803724, "phrase": "unprecedented_large_problem_sizes"}, {"score": 0.002608040688794517, "phrase": "feature_extractor_results"}, {"score": 0.0024756080101497086, "phrase": "labeled_examples"}, {"score": 0.0023363141951290526, "phrase": "better_samples"}, {"score": 0.0021049977753042253, "phrase": "greedy_layerwise_training"}], "paper_keywords": ["Neural nets", " pattern recognition", " computer vision"], "paper_abstract": "We describe the use of two spike-and-slab models for modeling real-valued data, with an emphasis on their applications to object recognition. The first model, which we call spike-and-slab sparse coding (S3C), is a preexisting model for which we introduce a faster approximate inference algorithm. We introduce a deep variant of S3C, which we call the partially directed deep Boltzmann machine (PD-DBM) and extend our S3C inference algorithm for use on this model. We describe learning procedures for each. We demonstrate that our inference procedure for S3C enables scaling the model to unprecedented large problem sizes, and demonstrate that using S3C as a feature extractor results in very good object recognition performance, particularly when the number of labeled examples is low. We show that the PD-DBM generates better samples than its shallow counterpart, and that unlike DBMs or DBNs, the PD-DBM may be trained successfully without greedy layerwise training.", "paper_title": "Scaling Up Spike-and-Slab Models for Unsupervised Feature Learning", "paper_id": "WOS:000320381400007"}