{"auto_keywords": [{"score": 0.04933164237303433, "phrase": "context-aware_applications"}, {"score": 0.03389692255333701, "phrase": "persona"}, {"score": 0.023227292084049545, "phrase": "end-user_personalization"}, {"score": 0.004684157900507474, "phrase": "context-aware_application"}, {"score": 0.00462919213721188, "phrase": "pervasive_computing_environment"}, {"score": 0.004592905436175987, "phrase": "intuitive_user_centric_services"}, {"score": 0.004556901872357751, "phrase": "implicit_context_cues"}, {"score": 0.004450568197899267, "phrase": "important_issues"}, {"score": 0.003986103192038901, "phrase": "sensor_fusion"}, {"score": 0.00384731849108269, "phrase": "context_cues"}, {"score": 0.003728000957725218, "phrase": "user-centric_issues"}, {"score": 0.00361237042013781, "phrase": "user_experiences"}, {"score": 0.003378385493203297, "phrase": "system_interface_level"}, {"score": 0.003312486229143855, "phrase": "centric_design"}, {"score": 0.002931569771634119, "phrase": "abstract_end-user_customization"}, {"score": 0.00281826552772148, "phrase": "user-centric_aspects"}, {"score": 0.002464709648714996, "phrase": "customizable_and_controllable_context-aware_applications"}, {"score": 0.002426137929553722, "phrase": "existing_context-aware_applications"}, {"score": 0.0021049977753042253, "phrase": "common_context-aware_applications"}], "paper_keywords": ["End-user", " Personalization", " Context-aware application", " Toolkit"], "paper_abstract": "A context-aware application in the pervasive computing environment provides intuitive user centric services using implicit context cues. Personalization and control are important issues for this class of application as they enable end-users to understand and configure the behavior of an application. However most development efforts for building context-aware applications focus on the sensor fusion and machine learning algorithms to generate and distribute context cues that drive the application with little emphasis on user-centric issues. We argue that, to elevate user experiences with context-aware applications, it is very important to address these personalization and control issues at the system interface level in parallel to context centric design. Towards this direction, we present Persona, a toolkit that provides support for extending context-aware applications with end-user personalization and control features. Specifically, Persona exposes a few application programming interfaces that abstract end-user customization and control mechanisms and enables developers to integrate these user-centric aspects with rest of the application seamlessly. There are two primary advantages of Persona. First, it can be used with various existing middlewares as a ready-to-use plug-in to build customizable and controllable context-aware applications. Second, existing context-aware applications can easily be augmented to provide end-user personalization and control support. In this paper, we discuss the design and implementation of Persona and demonstrate its usefulness through the development and augmentation of a range of common context-aware applications.", "paper_title": "A portable toolkit for supporting end-user personalization and control in context-aware applications", "paper_id": "WOS:000275800200004"}