{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "implantable_cardioverter_defibrillators"}, {"score": 0.015518719646278545, "phrase": "diagnostic_algorithm"}, {"score": 0.014906770815057974, "phrase": "inappropriate_therapies"}, {"score": 0.00893390500064685, "phrase": "vt"}, {"score": 0.004729579377207829, "phrase": "cardiac_tachyarrhythmias"}, {"score": 0.00466843910114172, "phrase": "main_aim"}, {"score": 0.004511663118269957, "phrase": "existing_icds"}, {"score": 0.004482400730101345, "phrase": "low_energy_consumption"}, {"score": 0.004446088307122385, "phrase": "critical_factor"}, {"score": 0.004431645472422101, "phrase": "implantable_medical_devices"}, {"score": 0.004241178291414502, "phrase": "heart_rate_variability"}, {"score": 0.004227403921517134, "phrase": "hrv"}, {"score": 0.004193142946272711, "phrase": "input_data"}, {"score": 0.004092026656771699, "phrase": "raw_intracardiac_electrogram"}, {"score": 0.0036040894858791793, "phrase": "initial_set"}, {"score": 0.0035923719610602214, "phrase": "fuzzy_rules"}, {"score": 0.003534375723587815, "phrase": "inst"}, {"score": 0.003477264432055326, "phrase": "software_tool"}, {"score": 0.003465957803362915, "phrase": "automatic_rule_assessment"}, {"score": 0.003454687811707182, "phrase": "simulated_annealing"}, {"score": 0.003437851260889614, "phrase": "training_data"}, {"score": 0.003349427775698219, "phrase": "validation_data"}, {"score": 0.0033222630615013737, "phrase": "real_life_recordings"}, {"score": 0.0033060697466201156, "phrase": "defibrillator_memories"}, {"score": 0.003226275635740122, "phrase": "physiobank_databases"}, {"score": 0.0032157824854214313, "phrase": "mit-bih"}, {"score": 0.0031949879467411727, "phrase": "mit"}, {"score": 0.0031535341431377837, "phrase": "custom_cmos_integrated_circuit"}, {"score": 0.00309752895858441, "phrase": "power_consumption"}, {"score": 0.003082427650896418, "phrase": "dedicated_web_site"}, {"score": 0.0030624066849965817, "phrase": "public_online_access"}, {"score": 0.002973904674745238, "phrase": "total_number"}, {"score": 0.0028274796456372025, "phrase": "st"}, {"score": 0.002809059790212791, "phrase": "dai"}, {"score": 0.002790802993262963, "phrase": "ate"}, {"score": 0.0027591574174861983, "phrase": "vf"}, {"score": 0.0027057155794186433, "phrase": "vf."}, {"score": 0.0025808064613297163, "phrase": "fuzzy_logic_algorithm"}, {"score": 0.0025724131547299293, "phrase": "icd"}, {"score": 0.002547372732377423, "phrase": "correct_therapies"}, {"score": 0.002489899944575695, "phrase": "individual_patients"}, {"score": 0.0024021878137155516, "phrase": "physiobank"}, {"score": 0.002328921198521778, "phrase": "fast_supraventricular_tachycardias"}, {"score": 0.0023175583542961718, "phrase": "estimated_power_consumption"}, {"score": 0.0023062508214156123, "phrase": "dedicated_integrated_circuit"}, {"score": 0.0022542058337152913, "phrase": "fuzzy_logic-based_control_algorithm"}, {"score": 0.0022468672873508745, "phrase": "icd."}, {"score": 0.0021641660270819685, "phrase": "real_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Heart rate variability", " Fuzzy logic control", " Implantable cardioverter defibrillator", " Ventricular tachycardia", " Fibrillation"], "paper_abstract": "Objective: The paper presents a diagnostic algorithm for classifying cardiac tachyarrhythmias for implantable cardioverter defibrillators (ICDs). The main aim was to develop an algorithm that could reduce the rate of occurrence of inappropriate therapies, which are often observed in existing ICDs. To achieve low energy consumption, which is a critical factor for implantable medical devices, very low computational complexity of the algorithm was crucial. The study describes and validates such an algorithm and estimates its clinical value. Methodology: The algorithm was based on the heart rate variability (HRV) analysis. The input data for our algorithm were: RR-interval (I), as extracted from raw intracardiac electrogram (EGM), and in addition two other features of HRV called here onset (ONS) and instability (INST). 6 diagnostic categories were considered: ventricular fibrillation (VF), ventricular tachycardia (VT), sinus tachycardia (ST), detection artifacts and irregularities (including extrasystoles) (DAI), atrial tachyarrhythmias (ATF) and no tachycardia (i.e. normal sinus rhythm) (NT). The initial set of fuzzy rules based on the distributions of I, ONS and INST in the 6 categories was optimized by means of a software tool for automatic rule assessment using simulated annealing. A training data set with 74 EGM recordings was used during optimization, and the algorithm was validated with a validation data set with 58 EGM recordings. Real life recordings stored in defibrillator memories were used. Additionally the algorithm was tested on 2 sets of recordings from the PhysioBank databases: MIT-BIH Arrhythmia Database and MIT-BIH Supraventricular Arrhythmia Database. A custom CMOS integrated circuit implementing the diagnostic algorithm was designed in order to estimate the power consumption. A dedicated Web site, which provides public online access to the algorithm, has been created and is available for testing it. Results: The total number of events in our training and validation sets was 132. In total 57 shocks and 28 antitachycardia pacing (ATP) therapies were delivered by ICDs. 25 out of 57 shocks were unjustified: 7 for ST, 12 for DAI, 6 for ATE Our fuzzy rule-based diagnostic algorithm correctly recognized all episodes of VF and vr, except for one case where VT was recognized as VF. In four cases short lasting, spontaneously ending VT episodes were not detected (in these cases no therapy was needed and they were not detected by ICDs either). In other words, a fuzzy logic algorithm driven ICD would deliver one unjustified shock and deliver correct therapies in all other cases. In the tests, no adjustments of our algorithm to individual patients were needed. The sensitivity and specificity calculated from the results were 100% and 98%, respectively. In 126 ECG recordings from PhysioBank (about 30 min each) our algorithm incorrectly detected 4 episodes of VT, which should rather be classified as fast supraventricular tachycardias. The estimated power consumption of the dedicated integrated circuit implementing the algorithm was below 120 nW. Conclusion: The paper presents a fuzzy logic-based control algorithm for ICD. Its main advantages are: simplicity and ability to decrease the rate of occurrence of inappropriate therapies. The algorithm can work in real time (i.e. update the diagnosis after every RR-interval) with very limited computational resources. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy logic-based diagnostic algorithm for implantable cardioverter defibrillators", "paper_id": "WOS:000332056000005"}