{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human-computer_interaction"}, {"score": 0.04933866662045337, "phrase": "user_experience"}, {"score": 0.004594951819987416, "phrase": "rallying_call"}, {"score": 0.004407813106104401, "phrase": "unitary_thing"}, {"score": 0.0036743708250589484, "phrase": "useful_concept"}, {"score": 0.0036174746598098863, "phrase": "closer_relationships"}, {"score": 0.003434085751246066, "phrase": "complex_concept"}, {"score": 0.0029994894380575604, "phrase": "cell_phones"}, {"score": 0.002592606058287124, "phrase": "specific_sensuousness"}, {"score": 0.0022879728308318205, "phrase": "digital_jewellery"}, {"score": 0.0021049977753042253, "phrase": "relating_enchantment"}], "paper_keywords": ["user experience design", " varieties of experience", " enchantment", " digital jewellery", " wearables"], "paper_abstract": "Improving user experience is becoming something of a rallying call in human-computer interaction but experience is not a unitary thing. There are varieties of experiences, good and bad, and we need to characterise these varieties if we are to improve user experience. In this paper we argue that enchantment is a useful concept to facilitate closer relationships between people and technology. But enchantment is a complex concept in need of some clarification. So we explore how enchantment has been used in the discussions of technology and examine experiences of film and cell phones to see how enchantment with technology is possible. Based on these cases, we identify the sensibilities that help designers design for enchantment, including the specific sensuousness of a thing, senses of play, paradox and openness, and the potential for transformation. We use these to analyse digital jewellery in order to suggest how it can be made more enchanting. We conclude by relating enchantment to varieties of experience.", "paper_title": "The experience of enchantment in human-computer interaction", "paper_id": "WOS:000246339400004"}