{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_test_architecture"}, {"score": 0.012246405069627231, "phrase": "controllability_problems"}, {"score": 0.007577284719282034, "phrase": "m."}, {"score": 0.0046046429665581555, "phrase": "finite-state_machines"}, {"score": 0.004550546226686172, "phrase": "fsm_m"}, {"score": 0.0036592001010420667, "phrase": "global_behaviour"}, {"score": 0.003532885029484907, "phrase": "local_behaviour"}, {"score": 0.0035103899379658006, "phrase": "remote_testers"}, {"score": 0.003476914643052379, "phrase": "fundamental_limitations"}, {"score": 0.0034109154088832376, "phrase": "minimal_fsms"}, {"score": 0.0030696193341147866, "phrase": "non-equivalent_states"}, {"score": 0.002591303221962211, "phrase": "local_s-equivalence"}, {"score": 0.0025502118431246276, "phrase": "polynomial_time_algorithm"}, {"score": 0.0024075916292945715, "phrase": "minimal_length_input_sequences"}, {"score": 0.0022013916728990564, "phrase": "locally_s-equivalent_states"}, {"score": 0.0021049977753042253, "phrase": "locally_s-minimal_fsm_m"}], "paper_keywords": ["testing", " finite state machine", " distributed test architecture", " equivalence"], "paper_abstract": "There has been much interest in testing from finite-state machines (FSMs). If the system under test can be modelled by the (minimal) FSM N then testing from an (minimal) FSM M is testing to check that N is isomorphic to M. In the distributed test architecture, there are multiple interfaces/ports and there is a tester at each port. This can introduce controllability/synchronization and observability problems. This paper shows that the restriction to test sequences that do not cause controllability problems and the inability to observe the global behaviour in the distributed test architecture, and thus relying only on the local behaviour at remote testers, introduces fundamental limitations into testing. There exist minimal FSMs that are not equivalent, and so are not isomorphic, and yet cannot be distinguished by testing in this architecture without introducing controllability problems. Similarly, an FSM may have non-equivalent states that cannot be distinguished in the distributed test architecture without causing controllability problems: these are said to be locally s-equivalent and otherwise they are locally s-distinguishable. This paper introduces the notion of two states or FSMs being locally s-equivalent and formalizes the power of testing in the distributed test architecture in terms of local s-equivalence. It introduces a polynomial time algorithm that, given an FSM M, determines which states of M are locally s-equivalent and produces minimal length input sequences that locally s-distinguish states that are not locally s-equivalent. An FSM is locally s-minimal if it has no pair of locally s-equivalent states. This paper gives an algorithm that takes an FSM M and returns a locally s-minimal FSM M' that is locally s-equivalent to M.", "paper_title": "The effect of the distributed test architecture on the power of testing", "paper_id": "WOS:000257178900008"}