{"auto_keywords": [{"score": 0.04684814051146254, "phrase": "knowledge_sharing"}, {"score": 0.00481495049065317, "phrase": "online_environments"}, {"score": 0.004395185177346749, "phrase": "different_types"}, {"score": 0.003526735797659508, "phrase": "different_possible_combinations"}, {"score": 0.0032536902910768957, "phrase": "online_observations"}, {"score": 0.0032189132350239013, "phrase": "semi-structured_interviews"}, {"score": 0.0031167895790050405, "phrase": "cross-case_analysis"}, {"score": 0.0029221312451219203, "phrase": "practical_knowledge"}, {"score": 0.002859977408815691, "phrase": "seven_motivators"}, {"score": 0.0025409639091476363, "phrase": "eight_barriers"}, {"score": 0.0023694065215394593, "phrase": "online_environment"}, {"score": 0.0022574539115388075, "phrase": "professional_practices"}, {"score": 0.0021975548867457606, "phrase": "different_results"}, {"score": 0.0021049977753042253, "phrase": "future_possible_research_directions"}], "paper_keywords": [""], "paper_abstract": "This study expands the perspective of knowledge sharing by categorizing the different types of knowledge that individuals shared with one another and examining the patterns of motivators and barriers of knowledge sharing across three online environments pertaining to the following professional practices-advanced nursing practice, Web development, and literacy education. The patterns indicate the different possible combinations of motivators or barriers that may exist in individuals. Data were gathered through online observations and semi-structured interviews with 54 participants. The cross-case analysis shows that the most common type of knowledge shared across all three environments was practical knowledge. Overall, seven motivators were found. Analysis also suggests that the most common combination of motivators for knowledge sharing was collectivism and reciprocity. A total of eight barriers were identified. The most common combination of barriers varied in each online environment. Discussions as to how the types of professional practices may contribute to the different results are provided, along with implications and future possible research directions.", "paper_title": "Knowledge sharing in online environments: A qualitative case study", "paper_id": "WOS:000251377600012"}