{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "-fly_data"}, {"score": 0.004762202897268383, "phrase": "efficient_data_exploration"}, {"score": 0.004624337472244542, "phrase": "ever_more_powerful_computing_hardware"}, {"score": 0.004473982381245469, "phrase": "scientific_data"}, {"score": 0.0039053194919285725, "phrase": "small_subset"}, {"score": 0.0036958398682001015, "phrase": "efficient_means"}, {"score": 0.0036418947847496365, "phrase": "full_dataset"}, {"score": 0.003615217162972726, "phrase": "approximate_query_results"}, {"score": 0.003459191419478298, "phrase": "interesting_areas"}, {"score": 0.0031553611552558986, "phrase": "massive_amounts"}, {"score": 0.003109280367693954, "phrase": "generating_data_synopses"}, {"score": 0.0027844017803674444, "phrase": "simulation_applications"}, {"score": 0.0023507916951658455, "phrase": "high-level_language"}, {"score": 0.00226583335721762, "phrase": "data_synopses"}, {"score": 0.002128376306688074, "phrase": "data_management_challenges"}], "paper_keywords": [""], "paper_abstract": "As a consequence of ever more powerful computing hardware and increasingly precise instruments, our capacity to produce scientific data by far outpaces our ability to efficiently store and analyse it. Few of today's tools to analyse scientific data are able to handle the deluge captured by instruments or generated by supercomputers. In many scenarios, however, it suffices to analyse a small subset of the data in detail. What scientists analysing the data consequently need are efficient means to explore the full dataset using approximate query results and to identify the subsets of interest. Once found, interesting areas can still be scrutinised using a precise, but also more time-consuming analysis. Data synopses fit the bill as they provide fast (but approximate) query execution on massive amounts of data. Generating data synopses after the data is stored, however, requires us to analyse all the data again, and is thus inefficient. What we propose is to generate the synopsis for simulation applications on-the-fly when the data is captured. Doing so typically means changing the simulation or data capturing code and is tedious and typically just a one-off solution that is not generally applicable. In contrast, our vision gives scientists a high-level language and the infrastructure needed to generate code that creates data synopses on-the-fly, as the simulation runs. In this paper we discuss the data management challenges associated with our approach.", "paper_title": "On-the-Fly Data Synopses: Efficient Data Exploration in the Simulation Sciences", "paper_id": "WOS:000364948700004"}