{"auto_keywords": [{"score": 0.04601980840223418, "phrase": "monitored_region"}, {"score": 0.015719716506582538, "phrase": "sensor_networks"}, {"score": 0.010690585455066215, "phrase": "gbd"}, {"score": 0.004466519142879166, "phrase": "sensed_data"}, {"score": 0.00436890075128947, "phrase": "scientific_analysis"}, {"score": 0.004311352359122141, "phrase": "historical_queries"}, {"score": 0.004217110862974562, "phrase": "historical_data"}, {"score": 0.004124920849728372, "phrase": "value_distributions"}, {"score": 0.003964007795174772, "phrase": "time_series_snapshots"}, {"score": 0.003502305158321511, "phrase": "gradient_boundary"}, {"score": 0.002986575805559931, "phrase": "predefined_value_range"}, {"score": 0.002512990657100351, "phrase": "monitored_area"}, {"score": 0.002361923085067681, "phrase": "energy_consumption"}, {"score": 0.0022999859758286423, "phrase": "simulation_results"}, {"score": 0.0021906130276146325, "phrase": "comparable_accuracy"}, {"score": 0.002123730137917387, "phrase": "existing_approaches"}, {"score": 0.0021049977753042253, "phrase": "large_gradient_intervals"}], "paper_keywords": ["wireless sensor networks", " query processing", " planar graph"], "paper_abstract": "In many applications of sensor networks, the sink needs to keep track of the history of sensed data of a monitored region for scientific analysis or supporting historical queries. We call these historical data a time series of value distributions or snapshots. Obviously, to build the time series snapshots by requiring all of the sensors to transmit their data to the sink periodically is not energy efficient. In this paper, we introduce the idea of gradient boundary and propose the Gradient Boundary Detection ( GBD) algorithm to construct these time series snapshots of a monitored region. In GBD, a monitored region is partitioned into a set of subregions and all sensed data in one subregion are within a predefined value range, namely, the gradient interval. Sensors located on the boundaries of the subregions are required to transmit the data to the sink and, then, the sink recovers all subregions to construct snapshots of the monitored area. In this process, only the boundary sensors transmit their data and, therefore, energy consumption is greatly reduced. The simulation results show that GBD is able to build snapshots with a comparable accuracy and has up to 40 percent energy savings compared with the existing approaches for large gradient intervals.", "paper_title": "Gradient boundary detection for time series snapshot construction in sensor networks", "paper_id": "WOS:000248943800009"}