{"auto_keywords": [{"score": 0.04356438587076672, "phrase": "knowledge-sharing_service"}, {"score": 0.04082237978577469, "phrase": "inferior_search_engine"}, {"score": 0.017803175073850368, "phrase": "superior_search_engine"}, {"score": 0.010612387000973441, "phrase": "search_quality"}, {"score": 0.005972558063193279, "phrase": "search_quality_difference"}, {"score": 0.0047652444369858295, "phrase": "google"}, {"score": 0.00445388865921667, "phrase": "yahoo"}, {"score": 0.004339609346924681, "phrase": "successful_knowledge-sharing_service"}, {"score": 0.0040771431404398855, "phrase": "search_engine's_competitiveness"}, {"score": 0.0030946423142739813, "phrase": "inferior_search_engine's_profit-maximizing_strategy"}, {"score": 0.0022642601698943687, "phrase": "inferior_search_engine's_market-share-maximizing_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge-sharing services", " Naver Knowledge-In", " Search engine competition", " Two-sided markets", " Yahoo! answers"], "paper_abstract": "Google has been steadily increasing its market share in the US, although its main competitor, Yahoo, began developing a successful knowledge-sharing service in 2005. To verify whether a knowledge-sharing service may increase a search engine's competitiveness, this study considers the competition between an inferior search engine that has an option of introducing a knowledge-sharing service and a superior search engine without this service. We specifically investigate the conditions under which it would be more profitable for the inferior search engine to introduce a knowledge-sharing service rather than increase its search quality. We show that the inferior search engine's profit-maximizing strategy mainly depends on both the amount of information available on the Internet and the difference in search quality between it and the superior search engine. When the search quality difference is small, the inferior search engine should introduce a knowledge-sharing service keeping its answer database inaccessible to the superior search engine. When the search quality difference is large, the inferior search engine generally had better improve its search technology. We also show the inferior search engine's market-share-maximizing strategy when it introduces a knowledge-sharing service. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Inferior search engine's optimal choice: Knowledge-sharing service versus search quality", "paper_id": "WOS:000346236500001"}