{"auto_keywords": [{"score": 0.04398714383022719, "phrase": "telephoto_camera"}, {"score": 0.0428566906057522, "phrase": "wide_angle_camera"}, {"score": 0.026744292893115647, "phrase": "traffic_signs"}, {"score": 0.014700872300191665, "phrase": "different_lighting_conditions"}, {"score": 0.013072128717735774, "phrase": "high_accuracy_image"}, {"score": 0.011621708943313816, "phrase": "proposed_system"}, {"score": 0.010435409021063343, "phrase": "color_transformation"}, {"score": 0.00792827564651759, "phrase": "traffic_sign_recognition"}, {"score": 0.0066288362024687795, "phrase": "traffic_sign"}, {"score": 0.00498930022477275, "phrase": "low_resolution"}, {"score": 0.00481495049065317, "phrase": "dual-focal_active_camera_system"}, {"score": 0.004670431171164122, "phrase": "automatic_vision-based_traffic_sign_recognition_system"}, {"score": 0.0045302298105691615, "phrase": "long_distance"}, {"score": 0.0043058107942196945, "phrase": "originally_proposed_dual-focal_active_camera_system"}, {"score": 0.00388964573736626, "phrase": "view_field"}, {"score": 0.0035135619115963627, "phrase": "traffic_sign_detection"}, {"score": 0.0034311578789991363, "phrase": "different_images"}, {"score": 0.0033964341293094545, "phrase": "wide_angle_camera_and_telephoto_camera"}, {"score": 0.003283198043537134, "phrase": "complex_background"}, {"score": 0.002866663406866159, "phrase": "multi-resolution_detector"}, {"score": 0.0025804616931593897, "phrase": "detected_traffic_sign"}, {"score": 0.0025284524249379265, "phrase": "exposure_time"}, {"score": 0.00237861522566195, "phrase": "hierarchical_classifier"}, {"score": 0.0023148964315569866, "phrase": "detected_traffic_signs"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["traffic sign recognition", " dual-focal active camera system", " invariance to lighting", " color transformation", " hierarchical classifier"], "paper_abstract": "In this paper, we present an automatic vision-based traffic sign recognition system, which can detect and classify traffic signs at long distance under different lighting conditions. To realize this purpose, the traffic sign recognition is developed in an originally proposed dual-focal active camera system. In this system, a telephoto camera is equipped as an assistant of a wide angle camera. The telephoto camera can capture a high accuracy image for an object of interest in the view field of the wide angle camera. The image from the telephoto camera provides enough information for recognition when the accuracy of traffic sign is low from the wide angle camera. In the proposed system, the traffic sign detection and classification are processed separately for different images from the wide angle camera and telephoto camera. Besides, in order to detect traffic sign from complex background in different lighting conditions, we propose a type of color transformation which is invariant to light changing. This color transformation is conducted to highlight the pattern of traffic signs by reducing the complexity of background. Based on the color transformation, a multi-resolution detector with cascade mode is trained and used to locate traffic signs at low resolution in the image from the wide angle camera. After detection, the system actively captures a high accuracy image of each detected traffic sign by controlling the direction and exposure time of the telephoto camera based on the information from the wide angle camera. Moreover, in classification, a hierarchical classifier is constructed and used to recognize the detected traffic signs in the high accuracy image from the telephoto camera. Finally, based on the proposed system, a set of experiments in the domain of traffic sign recognition is presented. The experimental results demonstrate that the proposed system can effectively recognize traffic signs at low resolution in different lighting conditions.", "paper_title": "Traffic Sign Recognition with Invariance to Lighting in Dual-Focal Active Camera System", "paper_id": "WOS:000306198700008"}