{"auto_keywords": [{"score": 0.04355159126538614, "phrase": "video_packets"}, {"score": 0.008713768692145013, "phrase": "advanced_partial_backward_decodable_bit_stream"}, {"score": 0.006585780443464007, "phrase": "apbdbs"}, {"score": 0.004586531354697466, "phrase": "error_robustness"}, {"score": 0.004537254814246843, "phrase": "partial_backward_decodable_bit_stream"}, {"score": 0.004392578942438256, "phrase": "gao"}, {"score": 0.004345370947668258, "phrase": "tu"}, {"score": 0.00394264312173188, "phrase": "pbdbs"}, {"score": 0.0037554497046697432, "phrase": "new_structure"}, {"score": 0.0037150687722055727, "phrase": "video_packet"}, {"score": 0.0034442607586033657, "phrase": "different_types"}, {"score": 0.003407214479510987, "phrase": "syntax_elements"}, {"score": 0.0031417377608722, "phrase": "motion_vectors"}, {"score": 0.0024628046987344846, "phrase": "marginal_mbs"}], "paper_keywords": ["error resilience", " PBDBS", " APBDBS", " resynchronization", " video transmission"], "paper_abstract": "An analysis on the error robustness of partial backward decodable bit stream (PBDBS) presented by Gao and Tu shows that bits at both ends of video packets are safer than those in the middle when the PBDBS is used. According to this, a new structure of video packet called advanced partial backward decodable bit stream (APBDBS) is proposed in this paper. First, different types of syntax elements in video packets are reordered according to their syntactical importance. The more important (such as motion vectors) are placed at both ends of video packets, while the less important in the middle. Second, MBs in video packets are reordered according to their spatial importance. MBs near to the centers of images are placed close to both ends of video packets while marginal MBs are placed in the middle. The simulation shows that with the APBDBS used, up to 2 dB luminance peak signal noise ratio (PSNR) improvement can be found compared with the PBDBS. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Video transmission using advanced partial backward decodable bit stream (APBDBS)", "paper_id": "WOS:000246129700009"}