{"auto_keywords": [{"score": 0.04193513979260514, "phrase": "clinical_trial"}, {"score": 0.03925305170902057, "phrase": "asthma_trial"}, {"score": 0.038608676844847374, "phrase": "key_research_concepts"}, {"score": 0.028900269992777592, "phrase": "interactive_programs"}, {"score": 0.00481495049065317, "phrase": "prototype_interactive_consent_program"}, {"score": 0.0047820521205253035, "phrase": "pediatric_clinical_trials"}, {"score": 0.0046846932351254636, "phrase": "standard_written_methods"}, {"score": 0.004636756166068091, "phrase": "research_information"}, {"score": 0.0044498415012873965, "phrase": "pilot_study"}, {"score": 0.004314595541370065, "phrase": "novel_prototype_interactive_consent_program"}, {"score": 0.004255807517348647, "phrase": "hypothetical_pediatric_asthma_trial"}, {"score": 0.004042369239448456, "phrase": "key_elements"}, {"score": 0.0038133343544929648, "phrase": "age-appropriate_versions"}, {"score": 0.0037742798298349145, "phrase": "interactive_computer_program"}, {"score": 0.0032675746199502614, "phrase": "improved_understanding"}, {"score": 0.0031899784784921222, "phrase": "consent_program"}, {"score": 0.003019444345150991, "phrase": "terms_clinical_trials"}, {"score": 0.002482517733720377, "phrase": "complete_understanding"}, {"score": 0.0022703369939978185, "phrase": "interactive_media"}, {"score": 0.002239340134646663, "phrase": "effective_means"}, {"score": 0.0022163699144426155, "phrase": "understandable_information"}, {"score": 0.0021562588804528667, "phrase": "clinical_trials"}, {"score": 0.0021049977753042253, "phrase": "novel_approach"}], "paper_keywords": [""], "paper_abstract": "Standard written methods of presenting research information may be difficult for many parents and children to understand. This pilot study was designed to examine the use of a novel prototype interactive consent program for describing a hypothetical pediatric asthma trial to parents and children. Parents and children were interviewed to examine their baseline understanding of key elements of a clinical trial, eg, randomization, placebo, and blinding. Subjects then reviewed age-appropriate versions of an interactive computer program describing an asthma trial, and their understanding of key research concepts was again tested along with their understanding of the details of the trial. Parents and children also completed surveys to examine their perceptions and satisfaction with the program. Both parents and children demonstrated improved understanding of key research concepts following administration of the consent program. For example, the percentage of parents and children who could correctly define the terms clinical trials and placebo improved from 60% to 80%, and 80% to 100% among parents and 25% to 50% and 0% to 50% among children, respectively, following review of the interactive programs. Parents and children's overall understanding of the details of the asthma trial were 14.2+/-0.84 and 9.25+/-4.9 (0-15 scale, where 15 is complete understanding), respectively. Results also suggest that the interactive programs were easy to use and facilitated understanding of the clinical trial among parents and children. Interactive media may offer an effective means of presenting understandable information to parents and children regarding participation in clinical trials. Further work to examine this novel approach appears warranted.", "paper_title": "Evaluation of a prototype interactive consent program for pediatric clinical trials: a pilot study", "paper_id": "WOS:000314151400008"}