{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "natural_language_processing"}, {"score": 0.01361771492132752, "phrase": "social_demand"}, {"score": 0.012429611143993574, "phrase": "natural_language"}, {"score": 0.004770832063470752, "phrase": "industrial_objectives"}, {"score": 0.004705407651101506, "phrase": "fully_automated_translation"}, {"score": 0.004556202652548916, "phrase": "basic_theoretical_research"}, {"score": 0.004514444325119011, "phrase": "theoretical_research"}, {"score": 0.004442281964690729, "phrase": "separate_discipline"}, {"score": 0.004311299277420025, "phrase": "good_application"}, {"score": 0.003950069028404172, "phrase": "first_one"}, {"score": 0.003913844170628935, "phrase": "computer_technique"}, {"score": 0.003824723219350318, "phrase": "strict_logic"}, {"score": 0.0036778330583593357, "phrase": "human_way"}, {"score": 0.003488006546734513, "phrase": "concrete_results"}, {"score": 0.00347196873942297, "phrase": "limited_time"}, {"score": 0.0034164129245278806, "phrase": "effective_systems"}, {"score": 0.003400703180346844, "phrase": "real_applications"}, {"score": 0.003307945150897367, "phrase": "fairly_large_areas"}, {"score": 0.003247511769666399, "phrase": "social_and_industrial_productivity"}, {"score": 0.0032103010439584433, "phrase": "essential_criterion"}, {"score": 0.0031735153296803893, "phrase": "technological_developments"}, {"score": 0.0030940591084482215, "phrase": "specific_applications"}, {"score": 0.0030305269251054956, "phrase": "small_specialized_firms"}, {"score": 0.0029478360063281027, "phrase": "'language_industry"}, {"score": 0.0029006425547761783, "phrase": "'linguistic_engineering"}, {"score": 0.002763534846612241, "phrase": "poor_performance"}, {"score": 0.0027192839217465214, "phrase": "theoretical_studies"}, {"score": 0.0026207745018923152, "phrase": "'pilot_systems"}, {"score": 0.002566935533549096, "phrase": "complex_theoretical_approaches"}, {"score": 0.002508407392573185, "phrase": "rather_limited_examples"}, {"score": 0.002468231568545234, "phrase": "different_levels"}, {"score": 0.0023299155749832074, "phrase": "significant_impact"}, {"score": 0.002297887183133991, "phrase": "natural_language_processing_systems"}, {"score": 0.002255864947702048, "phrase": "appropriate_inferences"}, {"score": 0.002129424256562065, "phrase": "position_paper"}, {"score": 0.0021049977753042253, "phrase": "surface_meaning"}], "paper_keywords": ["natural language processing", " artificial intelligence", " communication"], "paper_abstract": "Historically, at the beginning of natural language processing, applications with industrial objectives were preferred, e.g. for a fully automated translation. Soon, during the 1960s, there were attempts to separate applications from basic theoretical research. Since this theoretical research encounters difficulties regarding its status as a separate discipline, and considering the constraints necessary to clarify the concept of 'good application', impossible to satisfy simultaneously (a real problem to solve, in response to a social demand, and a viable solution in terms of reliability, robustness, speed and cost), two main streams have emerged. The first one, as a computer technique, is intended to build applications based on a strict logic, using natural language to facilitate interaction with the computer, but not directly related to the human way of using language (this approach is designated as natural language processing). Such pragmatic research accepts certain kinds of errors, but must lead to concrete results in limited time. The goal is to provide effective systems for real applications, able to respond effectively to requests addressed to them in fairly large areas; these systems are directly related to social and industrial productivity, which is the essential criterion of evaluation. Some technological developments, such as microcomputers, have made available to people specific applications of natural language processing and have enabled the emergence of small specialized firms. This produced, in the second half of the 1980s, the emergence of a 'language industry' and of the field of 'linguistic engineering'. On the other hand, during the late 1960s, the gap between the social demand, the resources invested and the poor performance obtained led to the emergence of theoretical studies intended to formalize languages (as opposed to the more empirical machine translation). This leads to 'pilot systems', aimed at demonstrating the feasibility of complex theoretical approaches, but unable to operate outside a set of rather limited examples. The limits may be at different levels: more or less limited vocabulary or accepted sentences, knowledge about the field more or less complete, more or less developed reasoning and so on. These limits have a significant impact on communication itself. For natural language processing systems to be effective, they must make appropriate inferences from what is said and, conversely their behavior should allow the inferences that the users usually do when using their language. Thus, this position paper stresses that understanding the surface meaning of a natural language is not sufficient but that the goals, intentions and strategies of the participants in a dialogue must be understood.", "paper_title": "Natural Language Understanding, Where Are We Going? Where Could We Go?", "paper_id": "WOS:000294499600007"}