{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_development_projects"}, {"score": 0.0046797114400479135, "phrase": "particular_working_\"product"}, {"score": 0.0043208252177835815, "phrase": "team_members"}, {"score": 0.003944112858235306, "phrase": "future_software_projects"}, {"score": 0.0038114397487574838, "phrase": "process_improvement_initiatives"}, {"score": 0.0035189057079817285, "phrase": "experience_team_members"}, {"score": 0.0034004869983267085, "phrase": "non-disruptive_way"}, {"score": 0.0032860401904845522, "phrase": "daily_project_activities"}, {"score": 0.002849078393246526, "phrase": "best_practices"}, {"score": 0.002706383680762465, "phrase": "future_use"}, {"score": 0.0025561788724870974, "phrase": "main_contribution"}, {"score": 0.002359759876402679, "phrase": "experience_management_activities"}, {"score": 0.0023196699954340437, "phrase": "integral_part"}, {"score": 0.0021049977753042253, "phrase": "follow-up_activity"}], "paper_keywords": ["Knowledge management", " software engineering", " experience capture"], "paper_abstract": "During software development projects there is always a particular working \"product\" that is generated but rarely managed: the knowledge and experience that team members acquire. This knowledge and experience, if conveniently managed, can be reused in future software projects and be the basis for process improvement initiatives. In this paper we present a model for managing the knowledge and experience team members acquire during software development projects in a non-disruptive way, by integrating its management into daily project activities. The purpose of the model is to identify and capture this knowledge and experience in order to derive lessons learned and proposals for best practices that enable an organization to preserve them for future use, and support software process improvement activities. The main contribution of the model is that it enables an organization to consider knowledge and experience management activities as an integral part of its software projects, instead of being considered, as it was until now, as a follow-up activity that is (infrequently) carried out after the end of the projects.", "paper_title": "A Model for Capturing and Managing Software Engineering Knowledge and Experience", "paper_id": "WOS:000276947300005"}