{"auto_keywords": [{"score": 0.02895638037886635, "phrase": "coefficient_strengthening"}, {"score": 0.00481495049065317, "phrase": "mixed-integer_programs"}, {"score": 0.004721711709176679, "phrase": "good_formulation"}, {"score": 0.004652963867892925, "phrase": "important_part"}, {"score": 0.004562847483469705, "phrase": "mixed-integer_program"}, {"score": 0.0036079110889031874, "phrase": "tight_formulations"}, {"score": 0.003287482882222731, "phrase": "production_scheduling"}, {"score": 0.0030847461428168614, "phrase": "desirable_property"}, {"score": 0.0026115277372906805, "phrase": "computational_experiments"}, {"score": 0.002573424607574822, "phrase": "strengthened_formulations"}, {"score": 0.0024383967028975616, "phrase": "commercial_software_package"}], "paper_keywords": ["Mixed-integer programming", " Cutting plane", " Coefficient strengthening", " Tightening", " Reformulation"], "paper_abstract": "Providing a good formulation is an important part of solving a mixed-integer program.We suggest measuring the quality of a formulation by whether it is possible to strengthen the coefficients of the formulation. Sequentially strengthening coefficients can then be used as a tool for improving formulations.We believe this method could be useful for analyzing and producing tight formulations of problems that arise in practice.We illustrate the use of the approach on a problem in production scheduling. We also prove that coefficient strengthening leads to formulations with a desirable property: if no coefficient can be strengthened, then no constraint can be replaced by an inequality that dominates it. The effect of coefficient strengthening is tested on a number of problems in computational experiments. The strengthened formulations are compared to reformulations obtained by the preprocessor of a commercial software package. For several test problems, the formulations obtained by coefficient strengthening are substantially stronger than the formulations obtained by the preprocessor. In particular, we use coefficient strengthening to solve two difficult problems to optimality that have only recently been solved.", "paper_title": "Coefficient strengthening: a tool for reformulating mixed-integer programs", "paper_id": "WOS:000268431500005"}