{"auto_keywords": [{"score": 0.03916771689957212, "phrase": "conjunctive_coding"}, {"score": 0.012418046786443652, "phrase": "synchronous_firing"}, {"score": 0.00481495049065317, "phrase": "conjunctive_binding"}, {"score": 0.004686963264680882, "phrase": "long-standing_issue"}, {"score": 0.004461051281091779, "phrase": "human_brain_contrives"}, {"score": 0.004023120753104693, "phrase": "comparative_merits"}, {"score": 0.003628024127607343, "phrase": "connectionist_researchers"}, {"score": 0.0035156341294017685, "phrase": "synchronous_binding"}, {"score": 0.00295008998986066, "phrase": "general_method"}, {"score": 0.0027950561494657633, "phrase": "above-cited_complaints"}, {"score": 0.0026009105281485888, "phrase": "surface_phenomenon"}, {"score": 0.0024864612830452254, "phrase": "underlying_causes"}, {"score": 0.0023557346035701096, "phrase": "synchronous_bindings"}, {"score": 0.0022218413146898887, "phrase": "conjunctive_binding_nodes"}, {"score": 0.002124036931047162, "phrase": "feasibly_small_number"}, {"score": 0.0021049977753042253, "phrase": "conjunctive_neurons"}], "paper_keywords": ["synchronous firing", " conjunctive coding", " role filler binding", " variable binding"], "paper_abstract": "A long-standing issue in connectionist research has concerned the manner in which the human brain contrives to bind values to variables, fillers to roles, and (sensory) features to features. This paper examines the comparative merits of two binding methods whose biological foundations have been empirically confirmed, namely, binding via synchronous firing and binding via conjunctive coding. Within the community of connectionist researchers, it is often asserted that synchronous binding is far more efficient, in terms of the number of neurons required, than conjunctive coding. Moreover, Singer (Neuron, 24, pp. 49-65, 1999) has argued that conjunctive coding is inadequate as a general method of binding, for several cognitively based reasons. This paper argues that the above-cited complaints against conjunctive binding are not decisive. It is further noted that synchronous firing is a surface phenomenon-one that requires an explanation in terms of underlying causes. A model is proposed herein that illustrates one way in which synchronous bindings could be engendered by a substratum that relies, ultimately, upon conjunctive binding nodes. It is demonstrated that such a substratum would require a feasibly small number of conjunctive neurons.", "paper_title": "Synchronous versus conjunctive binding: a false dichotomy?", "paper_id": "WOS:000248335700001"}