{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "different_graph_topologies"}, {"score": 0.004654928974748418, "phrase": "famous_examples"}, {"score": 0.004081385289516914, "phrase": "contact_networks"}, {"score": 0.00405082837316793, "phrase": "cholera"}, {"score": 0.0036324746826127997, "phrase": "snapshot_view"}, {"score": 0.0033820530570256, "phrase": "influenza"}, {"score": 0.003306559295382181, "phrase": "random_illness"}, {"score": 0.0032449610741097992, "phrase": "contact_network"}, {"score": 0.0029095936591723645, "phrase": "main_cause"}, {"score": 0.002678433668156678, "phrase": "minuscule_subsample"}, {"score": 0.0026583500966092044, "phrase": "infected_nodes"}, {"score": 0.0024842242921857705, "phrase": "diagnostic_power"}, {"score": 0.002465593351432208, "phrase": "network_information"}, {"score": 0.0024287485834314027, "phrase": "sufficient_conditions"}, {"score": 0.002218933616777076, "phrase": "identifiability_condition"}], "paper_keywords": ["Graph theory", " stochastic processes", " inference algorithms", " social networks", " infections"], "paper_abstract": "The history of infections and epidemics holds famous examples where understanding, containing, and ultimately treating an outbreak began with understanding its mode of spread. Influenza, HIV, and most computer viruses spread person to person, device to device, and through contact networks; Cholera, Cancer, and seasonal allergies, on the other hand, do not. In this paper, we study two fundamental questions of detection. First, given a snapshot view of a (perhaps vanishingly small) fraction of those infected, under what conditions is an epidemic spreading via contact (e.g., Influenza), distinguishable from a random illness operating independently of any contact network (e.g., seasonal allergies)? Second, if we do have an epidemic, under what conditions is it possible to determine which network of interactions is the main cause of the spread-the causative network-without any knowledge of the epidemic, other than the identity of a minuscule subsample of infected nodes? The core, therefore, of this paper, is to obtain an understanding of the diagnostic power of network information. We derive sufficient conditions that networks must satisfy for these problems to be identifiable, and produce efficient, highly scalable algorithms that solve these problems. We show that the identifiability condition we give is fairly mild, and in particular, is satisfied by two common graph topologies: the d-dimensional grid, and the Erdos-Renyi graphs.", "paper_title": "Distinguishing Infections on Different Graph Topologies", "paper_id": "WOS:000354943600010"}