{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_traffic"}, {"score": 0.004527371799277529, "phrase": "video_modeling"}, {"score": 0.004256895619944631, "phrase": "wired_and_wireless_networks"}, {"score": 0.0037057255600764475, "phrase": "well-known_distributions"}, {"score": 0.003574830654211291, "phrase": "pearson_type_v_distribution"}, {"score": 0.0035201528214608914, "phrase": "best_fit"}, {"score": 0.003275807170434343, "phrase": "single_videoconference_traces"}, {"score": 0.0030798711656591948, "phrase": "independently_frame_sizes"}, {"score": 0.0030171910207671205, "phrase": "declared_mean_and_standard_deviation"}, {"score": 0.002940626369102927, "phrase": "high_autocorrelation"}, {"score": 0.0028221322455573624, "phrase": "fitting_attempts"}, {"score": 0.0027789349951704177, "phrase": "high_accuracy"}, {"score": 0.0024062585770011987, "phrase": "vbr"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["videoconferencing", " MPEG-4 video encoding", " video traffic modeling", " discrete autoregressive model"], "paper_abstract": "Due to the burstiness of video traffic, video modeling is very important in order to evaluate the performance of future wired and wireless networks. In this paper, we first study the behavior of single MPEG-4 videoconference traces and investigate the possibility of modeling this type of traffic with well-known distributions. Our results show that the Pearson type V distribution is the best fit among all the examined distributions, for all the traces under study. However, the behavior of single videoconference traces can never be perfectly \"captured\" by a distribution generating independently frame sizes according to a declared mean and standard deviation, due to the high autocorrelation of videoconference; therefore none of the fitting attempts can achieve high accuracy. Still, our results on attempting to model single MPEG-4 videoconference sources provide significant insight and help to build a Discrete Autoregressive (DAR(1)) model to \"capture\" the behavior of multiplexed MPEG-4 videoconference movies from VBR coders. Based on our results and on comparisons with other existing approaches, we discuss the contribution of our proposed method to the field. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A new model for video traffic originating from multiplexed MPEG-4 videoconference streams", "paper_id": "WOS:000251496800004"}