{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "protein_structure_similarity"}, {"score": 0.014653830076824493, "phrase": "tm"}, {"score": 0.00833176509125296, "phrase": "posterior_probability"}, {"score": 0.008147613141430905, "phrase": "scop"}, {"score": 0.004620957579769604, "phrase": "squared_deviation"}, {"score": 0.004586531354697466, "phrase": "global_distance_test_score"}, {"score": 0.004192803336288522, "phrase": "structural_similarity"}, {"score": 0.0040691889755318155, "phrase": "quantitative_relation"}, {"score": 0.00399378014373321, "phrase": "conventional_fold_classifications"}, {"score": 0.003775803846431323, "phrase": "statistical_significance"}, {"score": 0.0035298229915690974, "phrase": "specific_tm-score"}, {"score": 0.003275205852713666, "phrase": "pdb"}, {"score": 0.003178550413662537, "phrase": "extreme_value_distribution"}, {"score": 0.0029271812818615042, "phrase": "equal_or_higher_tm-score"}, {"score": 0.002463831358869311, "phrase": "cath"}, {"score": 0.0024000447011533078, "phrase": "cath."}, {"score": 0.0023291617361832157, "phrase": "different_datasets"}, {"score": 0.0023031224517224757, "phrase": "similar_rapid_phase_transition"}, {"score": 0.00216907363015155, "phrase": "approximate_but_quantitative_criterion"}, {"score": 0.0021448202319775634, "phrase": "topology_classification"}, {"score": 0.0021288018260672806, "phrase": "i._e._protein_pairs"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein structure similarity is often measured by root mean squared deviation, global distance test score and template modeling score (TM-score). However, the scores themselves cannot provide information on how significant the structural similarity is. Also, it lacks a quantitative relation between the scores and conventional fold classifications. This article aims to answer two questions: (i) what is the statistical significance of TM-score? (ii) What is the probability of two proteins having the same fold given a specific TM-score? Results: We first made an all-to-all gapless structural match on 6684 non-homologous single-domain proteins in the PDB and found that the TM-scores follow an extreme value distribution. The data allow us to assign each TM-score a P-value that measures the chance of two randomly selected proteins obtaining an equal or higher TM-score. With a TM-score at 0.5, for instance, its P-value is 5.5x10(-7), which means we need to consider at least 1.8 million random protein pairs to acquire a TM-score of no less than 0.5. Second, we examine the posterior probability of the same fold proteins from three datasets SCOP, CATH and the consensus of SCOP and CATH. It is found that the posterior probability from different datasets has a similar rapid phase transition around TM-score = 0.5. This finding indicates that TM-score can be used as an approximate but quantitative criterion for protein topology classification, i. e. protein pairs with a TM-score >0.5 are mostly in the same fold while those with a TM-score <0.5 are mainly not in the same fold.", "paper_title": "How significant is a protein structure similarity with TM-score=0.5?", "paper_id": "WOS:000276045800006"}