{"auto_keywords": [{"score": 0.03689565391010681, "phrase": "bi-criteria_decision_making_problem"}, {"score": 0.015719716506582538, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.015603900522133745, "phrase": "heterogeneous_power_supplies"}, {"score": 0.012356359959687804, "phrase": "hop_count"}, {"score": 0.003890540531028228, "phrase": "traffic_load"}, {"score": 0.0038184296585478724, "phrase": "powered_devices"}, {"score": 0.0037476503270386903, "phrase": "selected_routes"}, {"score": 0.003569681826459428, "phrase": "route_selection"}, {"score": 0.003412887952564431, "phrase": "end-to-end_packet_transfer"}, {"score": 0.0031195948946937378, "phrase": "energy_cost"}, {"score": 0.0030963190575539574, "phrase": "end-to-end_packet_traversal"}, {"score": 0.0027985291920293127, "phrase": "residual_battery_energy"}, {"score": 0.0027776422068966867, "phrase": "battery-enabled_nodes"}, {"score": 0.0027466028572379455, "phrase": "proposed_algorithms"}, {"score": 0.0025578967205807843, "phrase": "static_and_mobile_ad_hoc_networks"}, {"score": 0.002482363351755741, "phrase": "transmission_power_control"}, {"score": 0.0024546155360991567, "phrase": "extensive_simulations"}, {"score": 0.0023554947277883535, "phrase": "battery-powered_nodes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Energy-aware routing", " Heterogeneous power supplies", " Energy consumption model", " Wireless ad hoc networks"], "paper_abstract": "Although many energy-aware routing schemes have been proposed for wireless ad hoc networks, they are not optimized for networks with heterogeneous power supplies, where nodes may run on battery or be connected to the mains (grid network). In this paper, we propose several energy-aware routing algorithms for such ad hoc networks. The proposed algorithms feature directing the traffic load dynamically towards mains-powered devices keeping the hop count of selected routes minimal. We unify these algorithms into a framework in which the route selection is formulated as a bi-criteria decision making problem. Minimizing the energy cost for end-to-end packet transfer and minimizing the hop count are the two criteria in this framework. Various algorithms that we propose differ in the way they define the energy cost for end-to-end packet traversal or the way they solve the bi-criteria decision making problem. Some of them consider the energy consumed to transmit and receive packets, while others also consider the residual battery energy of battery-enabled nodes. The proposed algorithms use either the weighted sum approach or the lexicographic method to solve the bi-criteria decision making problem. We evaluate the performance of our algorithms in static and mobile ad hoc networks, and in networks with and without transmission power control. Through extensive simulations we show that our algorithms can significantly enhance the lifetime of battery-powered nodes while the hop count is kept close to its optimal value. We also discuss the scenarios and conditions in which each algorithm could be suitably deployed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Energy-aware routing algorithms for wireless ad hoc networks with heterogeneous power supplies", "paper_id": "WOS:000295435500004"}