{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "information_technology_investment_decision_processes"}, {"score": 0.015225786405218478, "phrase": "internal_context"}, {"score": 0.004737879690862494, "phrase": "investment_characteristics"}, {"score": 0.004707396263523012, "phrase": "external_environment"}, {"score": 0.004587402291248795, "phrase": "governance_patterns"}, {"score": 0.00447045328907701, "phrase": "organizations'_investment_characteristics"}, {"score": 0.004231699728933577, "phrase": "lead_actors"}, {"score": 0.004123781267600542, "phrase": "approval_stages"}, {"score": 0.003916098498242888, "phrase": "seven_it_governance_archetypes"}, {"score": 0.0028901595183546576, "phrase": "pre-decision_stages"}, {"score": 0.0027982016314450717, "phrase": "final_decision_maker"}, {"score": 0.0027004145919012736, "phrase": "top_management_approval"}, {"score": 0.0026144780997686464, "phrase": "key_role"}, {"score": 0.0025312694615202786, "phrase": "pre-decision_initiation"}, {"score": 0.0023880948210628933, "phrase": "final_decision_rights"}, {"score": 0.0023346234464901978, "phrase": "decision_rights"}, {"score": 0.00222403027114726, "phrase": "contextual_factors"}, {"score": 0.0021186648667919044, "phrase": "desired_outcomes"}], "paper_keywords": ["IT investment", " decision-making process", " IT governance", " centralization", " IT function power", " external environment", " investment characteristics", " monarchy", " duopoly"], "paper_abstract": "This study identifies governance patterns for information technology investment decision processes and explores the impact of organizations' investment characteristics, external environment, and internal context on the shaping of those patterns. By identifying the lead actors of the initiation, development, and approval stages in IT governance, the patterns of 57IT investment decisions at 6 hospitals are analyzed. The results reveal seven IT governance archetypes: (1) top management monarchy, (2) top management-IT duopoly, (3) IT monarchy, (4) administration monarchy, (5) administration-IT duopoly, (6) professional monarchy, and (7) professional-IT duopoly. Each archetype is analyzed by taking into account four specific factors: IT investment level, external influence, organizational centralization, and IT function power. This study makes several contributions to IT governance theory and practice. First, IT governance is refrained to include pre-decision stages, highlighting the importance of participants other than the final decision maker. Second the variation of IT governance archetypes suggests that even when top management approval is required, the IT department may not play a key role in the IT investment decision process. Third, governance of the pre-decision initiation and development stages is found to be jointly affected by several contextual factors, suggesting that the allocation of final decision rights is only a part of IT governance. While decision rights may be allocated by the organization a priori, the actual patterns of IT governance are contingent on contextual factors. It is important to understand how IT governance archetypes are shaped because they may affect desired outcomes of IT investments.", "paper_title": "Information technology governance in information technology investment decision processes: The impact of investment characteristics, external environment, and internal context", "paper_id": "WOS:000253702000004"}