{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "protein_complexes"}, {"score": 0.015558967493238443, "phrase": "affinity_purification_assays"}, {"score": 0.01234137722423257, "phrase": "modular_substructure"}, {"score": 0.010903778421282337, "phrase": "subcomponent_structure"}, {"score": 0.004667149874736771, "phrase": "recent_advances"}, {"score": 0.004618893461411858, "phrase": "high-throughput_technologies"}, {"score": 0.0038304902197108643, "phrase": "experimental_results"}, {"score": 0.003712796038920873, "phrase": "physical_interactions"}, {"score": 0.003380897678672156, "phrase": "direct_physical_interactions"}, {"score": 0.0031107911390188055, "phrase": "maximum_spanning_trees"}, {"score": 0.003078577062864183, "phrase": "scoring_networks"}, {"score": 0.0030308784612749647, "phrase": "protein_complex"}, {"score": 0.002983916676307492, "phrase": "relevant_interactions"}, {"score": 0.0029224275921964724, "phrase": "subsequent_step"}, {"score": 0.0027311809666295565, "phrase": "alternative_indirect_paths"}, {"score": 0.002512850690695835, "phrase": "experimentally_derived_physical_interactions"}, {"score": 0.0021049977753042253, "phrase": "rna_polymerases"}], "paper_keywords": [""], "paper_abstract": "Motivation: Recent advances in high-throughput technologies have made it possible to investigate not only individual protein interactions, but also the association of these proteins in complexes. So far the focus has been on the prediction of complexes as sets of proteins from the experimental results. The modular substructure and the physical interactions within the protein complexes have been mostly ignored. Results: We present an approach for identifying the direct physical interactions and the subcomponent structure of protein complexes predicted from affinity purification assays. Our algorithm calculates the union of all maximum spanning trees from scoring networks for each protein complex to extract relevant interactions. In a subsequent step this network is extended to interactions which are not accounted for by alternative indirect paths. We show that the interactions identified with this approach are more accurate in predicting experimentally derived physical interactions than baseline approaches. Based on these networks, the subcomponent structure of the complexes can be resolved more satisfactorily and subcomplexes can be identified. The usefulness of our method is illustrated on the RNA polymerases for which the modular substructure can be successfully reconstructed.", "paper_title": "Identifying the topology of protein complexes from affinity purification assays", "paper_id": "WOS:000268808600027"}