{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "symbolic_model"}, {"score": 0.015374473183861037, "phrase": "mobile_robot"}, {"score": 0.012198665925419228, "phrase": "real_world"}, {"score": 0.009332742460190523, "phrase": "indoor_mobile_robot"}, {"score": 0.00477190623242136, "phrase": "indoor_environments"}, {"score": 0.004521566043596533, "phrase": "spatial_environment"}, {"score": 0.004208002469225673, "phrase": "indoor_scenarios"}, {"score": 0.004114527599108734, "phrase": "important_problems"}, {"score": 0.0037778009042360758, "phrase": "correct_dynamic_correspondence"}, {"score": 0.0034841647157189985, "phrase": "numerous_possible_models"}, {"score": 0.0025660347613972573, "phrase": "robot_operational_needs"}, {"score": 0.0025316254589087973, "phrase": "evolutionary_algorithm"}, {"score": 0.002453116398642071, "phrase": "large_amounts"}, {"score": 0.002272415777234064, "phrase": "task_planning"}, {"score": 0.0022118619998034742, "phrase": "proposed_framework"}, {"score": 0.002124036931047162, "phrase": "good_symbolic_model"}, {"score": 0.0021049977753042253, "phrase": "adaptation_capabilities"}], "paper_keywords": ["anchoring", " evolutionary algorithms", " robotics", " situated agents", " symbol grounding", " world modeling"], "paper_abstract": "The use of a symbolic model of the spatial environment becomes crucial for a mobile robot. that is intended to operate optimally and intelligently in indoor scenarios. Constructing such a model involves important problems that are not solved completely at present. One is called anchoring, which implies to maintain a correct dynamic correspondence between the real world and the symbols in the model. The other problem is adaptation: among the numerous possible models that could be constructed for representing a given environment, optimization involves the selection of one that improves as much as possible the operations of the robot. To cope with both problems, in this paper, we propose a framework that allows an indoor mobile robot to learn automatically a symbolic model of its environment and to optimize it over time with respect to changes in both the environment and the robot operational needs through an evolutionary algorithm. For coping efficiently with the large amounts of information that the real world provides, we use abstraction, which also helps in improving task planning. Our experiments demonstrate that the proposed framework is suitable for providing an indoor mobile robot with a good symbolic model and adaptation capabilities.", "paper_title": "Life-long optimization of the symbolic model of indoor environments for a mobile robot", "paper_id": "WOS:000249594500019"}