{"auto_keywords": [{"score": 0.04722362806507461, "phrase": "vcg"}, {"score": 0.043345567723172114, "phrase": "self-interested_agents"}, {"score": 0.037280577375628114, "phrase": "vcg_mechanisms"}, {"score": 0.00481495049065317, "phrase": "allocatively-efficient_and_strongly_budget-balanced_mechanisms"}, {"score": 0.004630423009638876, "phrase": "bounded-rational_agents"}, {"score": 0.004579010556250516, "phrase": "vickrey-clarke-groves"}, {"score": 0.004403480614319231, "phrase": "well-known_framework"}, {"score": 0.00423465514675998, "phrase": "distributed_optimization_problem"}, {"score": 0.00400459716272594, "phrase": "wide_attention"}, {"score": 0.0039380388343479384, "phrase": "ai_community"}, {"score": 0.0036214184763804034, "phrase": "groves_family"}, {"score": 0.0030282147475402736, "phrase": "network_flow_domain"}, {"score": 0.002263861731320045, "phrase": "vcg_mechanism"}, {"score": 0.0021049977753042253, "phrase": "np-complete_problem"}], "paper_keywords": [""], "paper_abstract": "Vickrey-Clarke-Groves (VCG) mechanisms are a well-known framework for finding a solution to a distributed optimization problem in systems of self-interested agents. VCG mechanisms have received wide attention in the AI community because they are efficient and strategy-proof; a special case of the Groves family of mechanisms, VCG mechanisms are the only direct-revelation mechanisms that are allocatively efficient and strategy-proof. Unfortunately, VCG mechanisms are only weakly budget-balanced. We consider self-interested agents in a network flow domain, and show that in this domain, it is possible to design a mechanism that is both allocatively-efficient and almost completely budget-balanced. This is done by choosing a mechanism that is not strategy-proof but rather strategy-resistant. Instead of using the VCG mechanism, we propose a mechanism in which finding the most beneficial manipulation is an NP-complete problem, and the payments from the agents to the mechanism may be minimized as much as desired. This way, the mechanism is virtually strongly budget-balanced: for any epsilon > 0 , we find a mechanism that is epsilon-budget-balanced.", "paper_title": "Achieving allocatively-efficient and strongly budget-balanced mechanisms in the network flow domain for bounded-rational agents", "paper_id": "WOS:000241593000006"}