{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "observability_techniques"}, {"score": 0.04959024199151092, "phrase": "structural_system_identification"}, {"score": 0.004064653055162238, "phrase": "young's_modulus"}, {"score": 0.0036303546926971966, "phrase": "adequate_subset"}, {"score": 0.003192700856094016, "phrase": "nonlinear_unknown_variables"}, {"score": 0.0030957429853133147, "phrase": "elemental_variables"}, {"score": 0.002986329509791943, "phrase": "mechanical_and_geometrical_properties"}, {"score": 0.0026806884201358537, "phrase": "algebraic_method"}, {"score": 0.0026261108615242557, "phrase": "standard_observability_problem"}, {"score": 0.002250601866422547, "phrase": "structural_systems"}, {"score": 0.0021487685525986094, "phrase": "proposed_methodology"}], "paper_keywords": [""], "paper_abstract": "This article deals with the problem of applying observability techniques to structural system identification, understanding as such the problem of identifying which is the subset of characteristics of the structure, such as Young's modulus, area, inertia, and/or product of them (flexural or axial stiffnesses) that can be uniquely defined when an adequate subset of deflections, forces, and/or moments in the nodes is provided. Compared with other standard observability problems, two issues arise here. First, nonlinear unknown variables (products or quotients of elemental variables) appear and second, the mechanical and geometrical properties of the structure are coupled with the deflections and/or rotations at the nodes. To solve these problems, an algebraic method that adapts the standard observability problem to deal with structural system identification is proposed in this article. The results obtained show, for the very first time, how observability techniques can be efficiently used for the identification of structural systems. Some examples are given to illustrate the proposed methodology and to demonstrate its power.", "paper_title": "Application of Observability Techniques to Structural System Identification", "paper_id": "WOS:000319882100003"}