{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "combinatorial_optimization"}, {"score": 0.0045850648862091085, "phrase": "combinatorial_optimization_problems"}, {"score": 0.004462105963334103, "phrase": "noteworthy_shift"}, {"score": 0.0034742854447532678, "phrase": "best_way"}, {"score": 0.003219368413618912, "phrase": "enormously_fruitful_cross-fertilization"}, {"score": 0.002966900048034132, "phrase": "powerful_hybrid_algorithms"}, {"score": 0.0026607205525625995, "phrase": "different_metaheuristics"}, {"score": 0.00251966141432339, "phrase": "exact_algorithms"}, {"score": 0.0022595316565074326, "phrase": "literature_review"}, {"score": 0.00217496508306238, "phrase": "illustrative_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Hybrid metaheuristics", " Combinatorial optimization", " Mathematical programming", " Constraint programming", " Local search"], "paper_abstract": "Research in metaheuristics for combinatorial optimization problems has lately experienced a noteworthy shift towards the hybridization of metaheuristics with other techniques for optimization. At the same time, the focus of research has changed from being rather algorithm-oriented to being more problem-oriented. Nowadays the focus is on solving the problem at hand in the best way possible, rather than promoting a certain metaheuristic. This has led to an enormously fruitful cross-fertilization of different areas of optimization. This cross-fertilization is documented by a multitude of powerful hybrid algorithms that were obtained by combining components from several different optimization techniques. Hereby, hybridization is not restricted to the combination of different metaheuristics but includes, for example, the combination of exact algorithms and metaheuristics. In this work we provide a survey of some of the most important lines of hybridization. The literature review is accompanied by the presentation of illustrative examples. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Hybrid metaheuristics in combinatorial optimization: A survey", "paper_id": "WOS:000290561000008"}