{"auto_keywords": [{"score": 0.02814259643228829, "phrase": "numvc"}, {"score": 0.00481495049065317, "phrase": "minimum_vertex_cover"}, {"score": 0.0046118021635786315, "phrase": "prominent_np-hard_combinatorial_optimization_problem"}, {"score": 0.004449045430179066, "phrase": "local_search"}, {"score": 0.0042155743122580846, "phrase": "mvc"}, {"score": 0.0038256426589560774, "phrase": "edge_weighting_techniques"}, {"score": 0.003373181367365139, "phrase": "two-stage_exchange_strategy"}, {"score": 0.003071965703296204, "phrase": "uncovered_edges"}, {"score": 0.0028689475587958917, "phrase": "new_mvc_local_search_algorithm"}, {"score": 0.002797572460958477, "phrase": "numvc."}, {"score": 0.0027675275077806744, "phrase": "extensive_experimental_studies"}, {"score": 0.0027378045447760705, "phrase": "standard_benchmarks"}, {"score": 0.0027084011457248433, "phrase": "dimacs"}, {"score": 0.0026889722517232924, "phrase": "bhoslib."}, {"score": 0.0026315183701883437, "phrase": "state-of-the-art_heuristic_algorithms"}, {"score": 0.002538470301402269, "phrase": "nearest_competitor"}, {"score": 0.002493184318829227, "phrase": "dimacs_benchmark"}, {"score": 0.0024136908511423875, "phrase": "bhoslib_benchmark"}, {"score": 0.0023791769068748194, "phrase": "experimental_results"}, {"score": 0.00232832698253493, "phrase": "optimal_solution"}, {"score": 0.002286781334850213, "phrase": "current_best_exact_algorithm"}, {"score": 0.002245975340642921, "phrase": "random_instances"}, {"score": 0.0022058958906038466, "phrase": "structured_ones"}, {"score": 0.0021049977753042253, "phrase": "run-time_behaviour"}], "paper_keywords": [""], "paper_abstract": "The Minimum Vertex Cover (MVC) problem is a prominent NP-hard combinatorial optimization problem of great importance in both theory and application. Local search has proved successful for this problem. However, there are two main drawbacks in state-of-the-art MVC local search algorithms. First, they select a pair of vertices to exchange simultaneously, which is time-consuming. Secondly, although using edge weighting techniques to diversify the search, these algorithms lack mechanisms for decreasing the weights. To address these issues, we propose two new strategies: two-stage exchange and edge weighting with forgetting. The two-stage exchange strategy selects two vertices to exchange separately and performs the exchange in two stages. The strategy of edge weighting with forgetting not only increases weights of uncovered edges, but also decreases some weights for each edge periodically. These two strategies are used in designing a new MVC local search algorithm, which is referred to as NuMVC. We conduct extensive experimental studies on the standard benchmarks, namely DIMACS and BHOSLIB. The experiment comparing NuMVC with state-of-the-art heuristic algorithms show that NuMVC is at least competitive with the nearest competitor namely PLS on the DIMACS benchmark, and clearly dominates all competitors on the BHOSLIB benchmark. Also, experimental results indicate that NuMVC finds an optimal solution much faster than the current best exact algorithm for Maximum Clique on random instances as well as some structured ones. Moreover, we study the effectiveness of the two strategies and the run-time behaviour through experimental analysis.", "paper_title": "NuMVC: An Efficient Local Search Algorithm for Minimum Vertex Cover", "paper_id": "WOS:000318213600001"}