{"auto_keywords": [{"score": 0.04922237591220716, "phrase": "multispec"}, {"score": 0.00481495049065317, "phrase": "multiple_prioritized_sources"}, {"score": 0.004750178261675602, "phrase": "formal_methodology"}, {"score": 0.004623224002010226, "phrase": "software_specifications"}, {"score": 0.004561019117546361, "phrase": "multiple_perspectives"}, {"score": 0.004499647408293102, "phrase": "viewpoint-based_approach"}, {"score": 0.004300951511110487, "phrase": "different_stakeholders"}, {"score": 0.0037898820206470085, "phrase": "greater_degrees"}, {"score": 0.0035414658322295515, "phrase": "merged_model"}, {"score": 0.0033393377529146893, "phrase": "priority-based_approach"}, {"score": 0.003148709618042979, "phrase": "external_factors"}, {"score": 0.0026634937939104177, "phrase": "priority_value"}, {"score": 0.002627587221594597, "phrase": "internal_factors"}, {"score": 0.002232579371411546, "phrase": "completeness_value"}, {"score": 0.0021049977753042253, "phrase": "simple_example"}], "paper_keywords": ["viewpoints", " incompleteness", " inconsistency", " requirements specification", " prioritization"], "paper_abstract": "The formal methodology MultiSpec supports the evolution of software specifications gathered from multiple perspectives. A viewpoint-based approach is used to explicitly separate the descriptions provided by different stakeholders, and concentrate on identifying and resolving conflicts between them. The challenge addressed in this article consists in taking into account that some views may have greater degrees of relevance and, consequently, their opinion will have more importance when either obtaining the merged model or resolving the contradictions. To this end, we propose a priority-based approach, where such priority value is twofold. On the one hand, it considers external factors to the perspectives such as the importance assigned to each view by the analyst depending on who is specifying the view or the amount of stakeholders involved in that specification. On the other hand, this priority value also considers internal factors related to the quality of the views and, in order to be able to quantify this value, MultiSpec proposes two measures: coverage and density of each perspective which will be combined in a completeness value. The contributions of this approach will be clearly illustrated through a simple example.", "paper_title": "Composing requirements specifications from multiple prioritized sources", "paper_id": "WOS:000258677500002"}