{"auto_keywords": [{"score": 0.049340969667338204, "phrase": "three-class_task_performance"}, {"score": 0.019178869223655356, "phrase": "vus"}, {"score": 0.00886502806463197, "phrase": "binary_roc_analysis"}, {"score": 0.007740489563401459, "phrase": "three-class_hotelling_trace"}, {"score": 0.0046918480568236415, "phrase": "three-class_volume"}, {"score": 0.004667606070383657, "phrase": "roc_surface"}, {"score": 0.004548253531664032, "phrase": "multiclass_classification_performance"}, {"score": 0.00420335381597168, "phrase": "common_sense_understanding"}, {"score": 0.004143196873246147, "phrase": "theoretical_and_empirical_data"}, {"score": 0.003913561587539275, "phrase": "newly_proposed_three-class_fom"}, {"score": 0.0038531644281313056, "phrase": "three-class_receiver"}, {"score": 0.003687034798751446, "phrase": "decision_theory"}, {"score": 0.003639553786151099, "phrase": "roc"}, {"score": 0.0035463870612369645, "phrase": "decision_theoretic"}, {"score": 0.0034022512471548754, "phrase": "three-class_paradigm"}, {"score": 0.0032809302753757257, "phrase": "monotonic_relationship"}, {"score": 0.0031639217570529742, "phrase": "reasonable_results"}, {"score": 0.002896787558938387, "phrase": "theoretical_explanations"}, {"score": 0.0026590401268765003, "phrase": "strong_theoretical_basis"}, {"score": 0.0025114562778824003, "phrase": "classification_performance_evaluation_method"}, {"score": 0.0024281181691350085, "phrase": "theoretical_foundations"}, {"score": 0.0022345441935094023, "phrase": "theoretical_investigations"}, {"score": 0.0021380517771409763, "phrase": "three-class_fom"}, {"score": 0.0021049977753042253, "phrase": "fundamental_binary_classification_theories"}], "paper_keywords": ["L-class Hotelling trace", " L-class linear discriminant analysis", " receiver operating characteristic (ROC) analysis", " three-class classification"], "paper_abstract": "In order to describe multiclass classification performance, several figures of merit (FOM) have been proposed. Among the earliest and most widely known of these is the three-class Hotelling trace (3-HT). The goal of this paper is to present theoretical and empirical data demonstrating the failure of 3-HT as a measure of three-class task performance. To help do this, we contrast it to a newly proposed three-class FOM, the volume under the three-class receiver operating characteristic (ROC) surface (VUS). The VUS is obtained from a decision theory based three-class ROC analysis method which has been proved to extend the decision theoretic, linear discriminant analysis (LDA), and psychophysical foundations of binary ROC analysis to a three-class paradigm. We demonstrate empirically that the VUS and 3-HT do not have a monotonic relationship in general when describing three-class task performance. Numerical experiments demonstrated that the VUS provided reasonable results, while the 3-HT failed to distinguish between the case where all objects could be perfectly classified from the case where only one pair of the classes could be perfectly classified. We have provided theoretical explanations of this failure of 3-HT. The significance of this work goes beyond merely demonstrating the problems of the 3-HT, it demonstrates that a FOM that is mathematically correct and has a strong theoretical basis can provide results that violate a common sense understanding of three-class task performance. This fact raises the question of \"how to evaluate a classification performance evaluation method?\" We believe the answer to this question lies in the theoretical foundations of binary ROC analysis. We have thus contrasted the two FOMs in terms of three fundamental theories underlying binary ROC analysis: decision theory, binary linear discriminant analysis, and the equivalence of two psychophysical classification procedures. These theoretical investigations demonstrated the importance of extending and unifying all the fundamental theories of binary classification in the development of a three-class FOM; violating one of theses fundamental binary classification theories may, as it did for the L-HT, provide predictions of three-class task performance that do not agree with a common sense understanding of three-class task performance.", "paper_title": "The Validity of Three-Class Hotelling Trace (3-HT) in Describing Three-Class Task Performance: Comparison of Three-Class Volume Under ROC Surface (VUS) and 3-HT", "paper_id": "WOS:000263225700003"}