{"auto_keywords": [{"score": 0.004632968695963776, "phrase": "breast_cancer_cell-matrix_adhesion"}, {"score": 0.00445783412174435, "phrase": "cancer_phenotypes"}, {"score": 0.004382127278148236, "phrase": "molecular_therapies"}, {"score": 0.004289291421348352, "phrase": "complex_and_diverse_signaling_mechanisms"}, {"score": 0.0041984140090404985, "phrase": "potential_routes"}, {"score": 0.004162602203448056, "phrase": "targeted_therapy_resistance"}, {"score": 0.0038702288460744274, "phrase": "regulatory_mechanisms"}, {"score": 0.0037398106866046972, "phrase": "dynamic_gene_expression_patterns"}, {"score": 0.0036605323485683983, "phrase": "analytical_techniques"}, {"score": 0.003598317040926701, "phrase": "novel_mp_grammars_method"}, {"score": 0.003537155405923517, "phrase": "putative_regulatory_interactions"}, {"score": 0.003477029725200912, "phrase": "clustered_genes"}, {"score": 0.003388745581055085, "phrase": "regulatory_interactions"}, {"score": 0.003316884515934182, "phrase": "cell_line"}, {"score": 0.0030183163057929687, "phrase": "targeted_gene_knockdown"}, {"score": 0.0028916124463906983, "phrase": "cancer_cell-matrix_adhesion"}, {"score": 0.0026199603775129516, "phrase": "key_intermediate_event"}, {"score": 0.0024884913795612707, "phrase": "longitudinal_gene_expression_data"}, {"score": 0.0024566655761509276, "phrase": "multiple_systems-level_analyses"}, {"score": 0.0021973099304606076, "phrase": "specific_cancer_cell_phenotype"}, {"score": 0.0021049977753042253, "phrase": "model_systems"}], "paper_keywords": [""], "paper_abstract": "Motivation: Oncogenes are known drivers of cancer phenotypes and targets of molecular therapies; however, the complex and diverse signaling mechanisms regulated by oncogenes and potential routes to targeted therapy resistance remain to be fully understood. To this end, we present an approach to infer regulatory mechanisms downstream of the HER2 driver oncogene in SUM-225 metastatic breast cancer cells from dynamic gene expression patterns using a succession of analytical techniques, including a novel MP grammars method to mathematically model putative regulatory interactions among sets of clustered genes. Results: Our method highlighted regulatory interactions previously identified in the cell line and a novel finding that the HER2 oncogene, as opposed to the proto-oncogene, upregulates expression of the E2F2 transcription factor. By targeted gene knockdown we show the significance of this, demonstrating that cancer cell-matrix adhesion and outgrowth were markedly inhibited when E2F2 levels were reduced. Thus, validating in this context that upregulation of E2F2 represents a key intermediate event in a HER2 oncogene-directed gene expression-based signaling circuit. This work demonstrates how predictive modeling of longitudinal gene expression data combined with multiple systems-level analyses can be used to accurately predict downstream signaling pathways. Here, our integrated method was applied to reveal insights as to how the HER2 oncogene drives a specific cancer cell phenotype, but it is adaptable to investigate other oncogenes and model systems.", "paper_title": "Modeling time-dependent transcription effects of HER2 oncogene and discovery of a role for E2F2 in breast cancer cell-matrix adhesion", "paper_id": "WOS:000344644600007"}