{"auto_keywords": [{"score": 0.04102976168027823, "phrase": "electronic_patient_record"}, {"score": 0.025060715166335623, "phrase": "hospital_management"}, {"score": 0.00481495049065317, "phrase": "mobile_computer_application"}, {"score": 0.004605258779434384, "phrase": "new_method"}, {"score": 0.004571204836087041, "phrase": "additional_data"}, {"score": 0.004515004397496303, "phrase": "skin_cancer_research"}, {"score": 0.00437208164450981, "phrase": "medicine_graz"}, {"score": 0.004244154690664235, "phrase": "traditional_paper-based_questionnaire_data_collection_methods"}, {"score": 0.004171259063201874, "phrase": "evaluation_methods"}, {"score": 0.00395996912658317, "phrase": "resulting_medical_data"}, {"score": 0.003834548373258131, "phrase": "doctor's_examination_room"}, {"score": 0.003551208588309043, "phrase": "data_quality"}, {"score": 0.003533662113818541, "phrase": "patient_empowerment"}, {"score": 0.0033963651718225784, "phrase": "manual_entry"}, {"score": 0.003329723570504798, "phrase": "data_completeness"}, {"score": 0.0033050703534275717, "phrase": "front_end"}, {"score": 0.0032643852908042044, "phrase": "user_centered_design_process_for_touch_tablet_computers_and_transfers_the_data_in_xml_to_the_sap_based_enterprise_hospital_information_system"}, {"score": 0.0031220090519585592, "phrase": "bronfenbrenner's_three_level_perspective"}, {"score": 0.0029345317192424193, "phrase": "sus"}, {"score": 0.0026973310437053573, "phrase": "medical_doctors"}, {"score": 0.002418587525752333, "phrase": "cost_model"}, {"score": 0.002234092591045251, "phrase": "single_clinic"}, {"score": 0.002163215349427412, "phrase": "mobile_computers"}, {"score": 0.0021365562685368767, "phrase": "workflow_optimization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Evaluation method", " Information system", " Workflow reengineering", " User-computer interface", " Software design", " Mobile computing"], "paper_abstract": "This paper describes a new method of collecting additional data for the purpose of skin cancer research from the patients in the hospital using the system Mobile Computing in Medicine Graz (MoCoMed-Graz). This system departs from the traditional paper-based questionnaire data collection methods and implements a new composition of evaluation methods to demonstrate its effectiveness. The patients fill out a questionnaire on a Tablet-PC (or iPad Device) and the resulting medical data is integrated into the electronic patient record for display when the patient enters the doctor's examination room. Since the data is now part of the electronic patient record, the doctor can discuss the data together with the patient making corrections or completions where necessary, thus enhancing data quality and patient empowerment. A further advantage is that all questionnaires are in the system at the end of the day - and manual entry is no longer necessary - consequently raising data completeness. The front end was developed using a User Centered Design Process for touch tablet computers and transfers the data in XML to the SAP based enterprise hospital information system. The system was evaluated at the Graz University Hospital - where about 30 outpatients consult the pigmented lesion clinic each day following Bronfenbrenner's three level perspective: The microlevel, the mesolevel and the macrolevel: On the microlevel, the questions answered by 194 outpatients, evaluated with the System Usability Scale (SUS) resulted in a median of 97.5 (min: 50, max: 100) which showed that it is easy to use. On the mesolevel, the time spent by medical doctors was measured before and after the implementation of the system; the medical task performance time of 20 doctors (age median 43 (min: 29; max: 50)) showed a reduction of 90%. On the macrolevel, a cost model was developed to show how much money can be saved by the hospital management. This showed that, for an average of 30 patients per day, on a 250 day basis per year in this single clinic, the hospital management can save up to 40,000 EUR per annum, proving that mobile computers can successfully contribute to workflow optimization. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Design and development of a mobile computer application to reengineer workflows in the hospital and the methodology to evaluate its effectiveness", "paper_id": "WOS:000297904700007"}