{"auto_keywords": [{"score": 0.0351915666065727, "phrase": "human_genome"}, {"score": 0.00481495049065317, "phrase": "mononucleotide_repeats"}, {"score": 0.004736563452994885, "phrase": "increased_single_nucleotide_polymorphism_frequency"}, {"score": 0.004583579470330216, "phrase": "mononucleotide"}, {"score": 0.004387225575447685, "phrase": "eukaryotic_genomes"}, {"score": 0.004292212137716459, "phrase": "high_degree"}, {"score": 0.004245476558619167, "phrase": "length_variability"}, {"score": 0.0038893838564184107, "phrase": "mutation_rates"}, {"score": 0.0038470175104007524, "phrase": "surrounding_sequences"}, {"score": 0.0035826234811610316, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.0031240075437664314, "phrase": "snp_frequency"}, {"score": 0.0027843339377323878, "phrase": "strong_asymmetry"}, {"score": 0.002679501909303057, "phrase": "repeat_tracts"}, {"score": 0.002592784882557155, "phrase": "repeat_motif"}, {"score": 0.0021049977753042253, "phrase": "base_present"}], "paper_keywords": [""], "paper_abstract": "Mononucleotide repeats (MNRs) are abundant in eukaryotic genomes and exhibit a high degree of length variability due to insertion and deletion events. However, the relationship between these repeats and mutation rates in surrounding sequences has not been systematically investigated. We have analyzed the frequency of single nucleotide polymorphisms ( SNPs) at positions close to and within MNRs in the human genome. Overall, we find a 2- to 4-fold increase in the SNP frequency at positions immediately adjacent to the boundaries of MNRs, relative to that at more distant bases. This relationship exhibits a strong asymmetry between 3' and 5' ends of repeat tracts and is dependent upon the repeat motif, length and orientation of surrounding repeats. Our analysis suggests that the incorporation or exclusion of bases adjacent to the boundary of the repeat through substitutions, in which these nucleotides mutate towards or away from the base present within the repeat, respectively, may be another mechanism by which MNRs expand and contract in the human genome.", "paper_title": "Bases adjacent to mononucleotide repeats show an increased single nucleotide polymorphism frequency in the human genome", "paper_id": "WOS:000289162000001"}