{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "h_index"}, {"score": 0.008472996393024918, "phrase": "gender_differences"}, {"score": 0.004744437370338926, "phrase": "scientists'_contributions"}, {"score": 0.004257806363128601, "phrase": "important_decisions"}, {"score": 0.003974349782102708, "phrase": "growing_body"}, {"score": 0.00376488621224566, "phrase": "h_indices"}, {"score": 0.0033950634506367235, "phrase": "gender_effect"}, {"score": 0.002986969236641105, "phrase": "observed_gender_effect"}, {"score": 0.0027878797103973313, "phrase": "gender_difference"}, {"score": 0.002706659627293686, "phrase": "significant_financial_costs"}, {"score": 0.002680114113899346, "phrase": "female_faculty"}, {"score": 0.0023003498123420237, "phrase": "systematic_gender_differences"}, {"score": 0.0021049977753042253, "phrase": "academic_psychologists"}], "paper_keywords": ["h index", " Citations", " Gender", " Psychology"], "paper_abstract": "It has become increasingly common to rely on the h index to assess scientists' contributions to their fields, and this is true in psychology. This metric is now used in many psychology departments and universities to make important decisions about hiring, promotions, raises, and awards. Yet, a growing body of research shows that there are gender differences in citations and h indices. We sought to draw attention to this literature, particularly in psychology. We describe the presence of a gender effect in h index in psychology and analyze why the effect is important to consider. To illustrate the importance of this effect, we translate the observed gender effect into a meaningful metric-that of salary-and show that the gender difference in h index could translate into significant financial costs for female faculty. A variety of factors are discussed that have been shown to give rise to gender differences in impact. We conclude that the h index, like many other metrics, may reflect systematic gender differences in academia, and we suggest using caution when relying on this metric to promote and reward academic psychologists.", "paper_title": "Gender and the h index in psychology", "paper_id": "WOS:000365130100035"}