{"auto_keywords": [{"score": 0.04590884875550201, "phrase": "local_velocity_distribution"}, {"score": 0.008713768692145006, "phrase": "driven_granular_gas"}, {"score": 0.008025192842110188, "phrase": "spatial_profiles"}, {"score": 0.006450689613961788, "phrase": "vibration_direction"}, {"score": 0.004775335634705251, "phrase": "purpose_-_the_purpose"}, {"score": 0.004620093797504386, "phrase": "local_feature"}, {"score": 0.0045820747375409435, "phrase": "driven_granular_gases"}, {"score": 0.004579383942267401, "phrase": "bulk_boundary_effect"}, {"score": 0.0045443671106012405, "phrase": "event-driven_molecular_dynamic_simulation"}, {"score": 0.004360412703519539, "phrase": "granular_temperature"}, {"score": 0.004064548693812535, "phrase": "vibro-fluidized_granular_gas_system"}, {"score": 0.0037886833451021723, "phrase": "steady_state"}, {"score": 0.003516898780234098, "phrase": "driven_granular_gas_system"}, {"score": 0.0034306925765832633, "phrase": "experimental_results"}, {"score": 0.0033465923623290034, "phrase": "nonlinear_spatial_profile"}, {"score": 0.0029928611380840757, "phrase": "system_dissipation"}, {"score": 0.0027437235598539904, "phrase": "energy_equipartition"}, {"score": 0.0024842242921857705, "phrase": "dissipation_properties"}, {"score": 0.0024637379406427878, "phrase": "granular_gases"}, {"score": 0.002393353846080347, "phrase": "first_md_simulation"}, {"score": 0.0021049977753042253, "phrase": "system_dissipative_nature"}], "paper_keywords": ["Granular gases", " Local state", " Asymmetric velocity distribution"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the local feature of driven granular gases in event-driven molecular dynamic simulation, in order to achieve spatial profiles of local velocity distribution and granular temperature, and the local state with various coefficients of restitution. Design/methodology/approach - Event-driven molecular dynamic simulation is performed to study a vibro-fluidized granular gas system. Triangular-wave vibration is adopted in the simulation. The authors focus on the steady state of a driven granular gas. Findings - The simulation finds the local velocity distribution is asymmetric along vibration direction in this driven granular gas system, which agrees with the experimental results obtained in micro-gravity. A nonlinear spatial profile of the skewness of local velocity distribution in vibration direction is found in the simulation. Furthermore, it is found that the value of skewness increases with the system dissipation. It is also found that the two temperature components T+ and T- differ from each other. This shows breakdown of energy equipartition. The ratio between them drops exponentially along y direction in various coefficients of restitution. All results confirm that the bulk boundary effect relates to the dissipation properties of granular gases. Originality/value - This is the first MD simulation that investigates the bulk boundary effect to the local velocity distribution. The spatial profiles of the skewness of local velocity distribution are also investigated when changing the coefficient of restitution to study the influence of the system dissipative nature.", "paper_title": "Asymmetric local velocity distribution in a driven granular gas", "paper_id": "WOS:000357272600008"}