{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "versioning_support"}, {"score": 0.029139449391002565, "phrase": "pipe_programmers"}, {"score": 0.014054703109939047, "phrase": "web_mashups"}, {"score": 0.010904783955134705, "phrase": "debug_mashups"}, {"score": 0.004674952036988355, "phrase": "empirical_study"}, {"score": 0.00462919213721188, "phrase": "end_users"}, {"score": 0.004363846362238565, "phrase": "web_macros"}, {"score": 0.003820896867623235, "phrase": "programming_environments"}, {"score": 0.0031223774204093713, "phrase": "popular_wire-oriented_mashup_environment"}, {"score": 0.0030917825819208903, "phrase": "yahoo"}, {"score": 0.0030614718049558373, "phrase": "pipes"}, {"score": 0.002943147037670826, "phrase": "pipes_plumber"}, {"score": 0.002640781900605126, "phrase": "specific_versions"}, {"score": 0.0022777800735119405, "phrase": "subsequent_qualitative_results"}], "paper_keywords": ["Human Factors", " End-user software engineering", " versioning", " Mashups", " Yahoo! Pipes", " reuse", " debugging", " programming barriers"], "paper_abstract": "End users with little formal programming background are creating software in many different forms, including spreadsheets, web macros, and web mashups. Web mashups are particularly popular because they are relatively easy to create, and because many programming environments that support their creation are available. These programming environments, however, provide no support for tracking versions or provenance of mashups. We believe that versioning support can help end users create, understand, and debug mashups. To investigate this belief, we have added versioning support to a popular wire-oriented mashup environment, Yahoo! Pipes. Our enhanced environment, which we call \"Pipes Plumber,\" automatically retains versions of pipes and provides an interface with which pipe programmers can browse histories of pipes and retrieve specific versions. We have conducted two studies of this environment: an exploratory study and a larger controlled experiment. Our results provide evidence that versioning helps pipe programmers create and debug mashups. Subsequent qualitative results provide further insights into the barriers faced by pipe programmers, the support for reuse provided by our approach, and the support for debugging provided.", "paper_title": "On the Benefits of Providing Versioning Support for End Users: An Empirical Study", "paper_id": "WOS:000334860000002"}