{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neural_p_systems"}, {"score": 0.03323248941990375, "phrase": "extended_rules"}, {"score": 0.003954837422946628, "phrase": "next_step"}, {"score": 0.003815770872944475, "phrase": "output_neuron"}, {"score": 0.0034148795808317555, "phrase": "additional_non-determinism"}, {"score": 0.003213153188898728, "phrase": "computing_power"}, {"score": 0.002927371124061966, "phrase": "turing_machines"}, {"score": 0.002695768552609587, "phrase": "standard_spiking_neural_p_systems"}, {"score": 0.002554662768695568, "phrase": "asynchronous_systems"}, {"score": 0.0023356699564158426, "phrase": "configuration_reachability"}, {"score": 0.0022777800735119405, "phrase": "generated_vectors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Membrane computing", " Spiking neural P system", " Turing computability", " Counter machine", " Decidability"], "paper_abstract": "We consider here spiking neural P systems with a non-synchronized (i.e., asynchronous) use of rules: in any step, a neuron can apply or not apply its rules which are enabled by the number of spikes it contains (further spikes can come, thus changing the rules enabled in the next step). Because the time between two firings of the output neuron is now irrelevant, the result of a computation is the number of spikes sent out by the system, not the distance between certain spikes leaving the system. The additional non-determinism introduced in the functioning of the system by the non-synchronization is proved not to decrease the computing power in the case of using extended rules (several spikes can be produced by a rule). That is, we obtain again the equivalence with Turing machines (interpreted as generators of sets of (vectors of) numbers). However, this problem remains open for the case of standard spiking neural P systems, whose rules can only produce one spike. On the other hand we prove that asynchronous systems, with extended rules, and where each neuron is either bounded or unbounded, are not computationally complete. For these systems, the configuration reachability, membership (in terms of generated vectors), emptiness, infiniteness, and disjointness problems are shown to be decidable. However, containment and equivalence are undecidable. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Asynchronous spiking neural P systems", "paper_id": "WOS:000266446600007"}