{"auto_keywords": [{"score": 0.04882985100763265, "phrase": "service-based_systems"}, {"score": 0.04288125939796196, "phrase": "service-based_system's_lifecycle"}, {"score": 0.00481495049065317, "phrase": "service-based_system_lifecycle"}, {"score": 0.004658426838467567, "phrase": "highly_dynamic_software_systems"}, {"score": 0.00443308765153716, "phrase": "service_providers"}, {"score": 0.004317378385832431, "phrase": "agreed_quality_of_service"}, {"score": 0.004260656420599919, "phrase": "adequate_quality_of_service"}, {"score": 0.004218602458288531, "phrase": "critical_and_significant_challenge"}, {"score": 0.0041357305373417455, "phrase": "different_activities"}, {"score": 0.00404109360612109, "phrase": "current_monitoring_systems"}, {"score": 0.0039748192550806815, "phrase": "specific_activities"}, {"score": 0.0034477636809450312, "phrase": "whole_service-based_system's_lifecycle"}, {"score": 0.00342502909841911, "phrase": "salmon"}, {"score": 0.0033355353594739707, "phrase": "different_strategies"}, {"score": 0.003010250522930773, "phrase": "easy_extensibility"}, {"score": 0.0029903851294825023, "phrase": "new_quality_attributes"}, {"score": 0.002912222095383313, "phrase": "monitored_services"}, {"score": 0.0028267211555015295, "phrase": "performance_evaluation"}, {"score": 0.00280806350681826, "phrase": "real_web_services"}, {"score": 0.002789528662623221, "phrase": "suitable_estimators"}, {"score": 0.002771115819151223, "phrase": "response_time"}, {"score": 0.0024924663319500326, "phrase": "lifecycle's_phase"}, {"score": 0.002256677005409071, "phrase": "working_technology"}, {"score": 0.002147265537489893, "phrase": "reliable_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Service based system", " Monitoring", " Quality of Service", " QoS", " Web service"], "paper_abstract": "Context and motivation: Service-Based Systems are highly dynamic software systems composed of several web services. In contrast to other types of systems, Service-Based Systems rely on service providers to ensure that their web services comply with the agreed Quality of Service. Delivering an adequate Quality of Service is a critical and significant challenge that requires monitoring along the different activities in the Service-Based System's lifecycle. Question/problem: Current monitoring systems are designed to support specific activities (e.g. service selection, adaptation, etc.), but do not fulfil the requirements of all the activities in the Service-Based System's lifecycle. Principal ideas/results: In this paper, we present SALMon, a QoS monitoring framework able to support the whole Service-Based System's lifecycle. SALMon is highly versatile, since it combines different strategies for its configuration (model-based and invocation-based) and for the way it gets the Quality of Service (passive monitoring and online testing). Furthermore, its architecture supports easy extensibility with new quality attributes, independence of the technology of the monitored services and interoperability with other tools. We conducted a performance evaluation over real web services using suitable estimators for response time and evaluated both its overhead and capacity. Contribution: SALMon provides infrastructure that can be used in very different scenarios, as exemplified in this paper, both in terms of the lifecycle's phase addressed and the type of system (pure Service-Oriented Architecture, cloud-based systems, etc.). This diversity of situations addressed makes SALMon a significant contribution both for practitioners that may be interested in integrating a working technology in their software solutions, and for researchers who can conduct their investigation on top of a reliable infrastructure. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Monitoring the service-based system lifecycle with SALMon", "paper_id": "WOS:000356735100003"}