{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "design_ideas"}, {"score": 0.004267468074128779, "phrase": "fundamental_nature"}, {"score": 0.004054931951058077, "phrase": "different_types"}, {"score": 0.0036271080216837286, "phrase": "design_exploration"}, {"score": 0.0034785371344994197, "phrase": "new_ways"}, {"score": 0.0032898346872897383, "phrase": "experience_prototyping"}, {"score": 0.0032593915869553714, "phrase": "paper_prototyping"}, {"score": 0.0030825404960282713, "phrase": "fundamental_characteristics"}, {"score": 0.0028350413546400703, "phrase": "prototype_conceptualization"}, {"score": 0.002523828967909659, "phrase": "design_space"}, {"score": 0.002164602220179823, "phrase": "conceptual_framework"}], "paper_keywords": ["prototype", " prototyping", " design", " design space", " human-computer interaction"], "paper_abstract": "The role of prototypes is well established in the field of HCI and Design. A lack of knowledge, however, about the fundamental nature of prototypes still exists. Researchers have attempted to identify different types of prototypes, such as low-vs. high-fidelity prototypes, but these attempts have centered on evaluation rather than support of design exploration. There have also been efforts to provide new ways of thinking about the activity of using prototypes, such as experience prototyping and paper prototyping, but these efforts do not provide a discourse for understanding fundamental characteristics of prototypes. In this article, we propose an anatomy of prototypes as a framework for prototype conceptualization. We view prototypes not only in their role in evaluation but also in their generative role in enabling designers to reflect on their design activities in exploring a design space. We base this framework on the findings of two case studies that reveal two key dimensions: prototypes as filters and prototypes as manifestations. We explain why these two dimensions are important and how this conceptual framework can benefit our field by establishing more solid and systematic knowledge about prototypes and prototyping.", "paper_title": "The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas", "paper_id": "WOS:000257527300001"}