{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "text_features"}, {"score": 0.04269803168773222, "phrase": "classification_system"}, {"score": 0.004760017604908536, "phrase": "visual_features"}, {"score": 0.004268293864953256, "phrase": "image_classification"}, {"score": 0.003511246498068952, "phrase": "global_visual_features"}, {"score": 0.003471135453226184, "phrase": "local_visual_features"}, {"score": 0.00307657476125683, "phrase": "feature_vector"}, {"score": 0.0029552551661591988, "phrase": "classifier_fusion_strategy"}, {"score": 0.00283870598459543, "phrase": "classifier_outputs"}, {"score": 0.0026955672787561742, "phrase": "unlabeled_images"}, {"score": 0.0025449518236394103, "phrase": "google_image_search"}, {"score": 0.002321234686549485, "phrase": "different_feature_combination_methods"}, {"score": 0.0021416404045850224, "phrase": "classifier_fusion_approach"}, {"score": 0.0021049977753042253, "phrase": "classification_accuracy"}], "paper_keywords": [""], "paper_abstract": "With more and more text-image co-occurrence data becoming available on the Web, we are interested in how text especially Chinese context around images can aid image classification. The goal is to construct a classification system for images, and we used the context of the images to improve the classification system. First, we extracted three kinds of features, including global visual features, local visual features, and text features using both the image content and context. Then, we tried various feature combination methods and train classifiers for each kind of feature vector. Finally, we used a classifier fusion strategy based on weight learning, combining classifier outputs together, and we obtained the category of unlabeled images. In our experiments on the data set extracted from Google Image Search, we demonstrated the benefit of using context to help image classification. By comparing different feature combination methods on our feature set, we adopted the most effective one. Meanwhile, the classifier fusion approach improves the classification accuracy.", "paper_title": "Image Classification Based on the Combination of Text Features and Visual Features", "paper_id": "WOS:000313992600004"}