{"auto_keywords": [{"score": 0.03126190087039677, "phrase": "domino"}, {"score": 0.01562620963780594, "phrase": "wireless_sensor_networks"}, {"score": 0.01395060323824431, "phrase": "end-to-end_delay"}, {"score": 0.010720755363497921, "phrase": "extra_wake-up_slots"}, {"score": 0.009769128151210003, "phrase": "tabu"}, {"score": 0.009283249750366948, "phrase": "bip"}, {"score": 0.00481495049065317, "phrase": "end-to-end_delays"}, {"score": 0.004478782833067256, "phrase": "multi-hop_communications"}, {"score": 0.0036479584876742085, "phrase": "binary_integer_program"}, {"score": 0.003550904898018623, "phrase": "np"}, {"score": 0.0033827600969034873, "phrase": "key_approach"}, {"score": 0.0032920678776655783, "phrase": "minimal_number"}, {"score": 0.0031462682245392785, "phrase": "end-to-end_paths"}, {"score": 0.0030160025335218047, "phrase": "first_set"}, {"score": 0.0028477727736832283, "phrase": "proposed_algorithms"}, {"score": 0.0027713837460773974, "phrase": "large_scale_wsns"}, {"score": 0.002656598121865532, "phrase": "additional_wake-up_times"}, {"score": 0.0025542617599268323, "phrase": "optimal_solution"}, {"score": 0.0025235718883452585, "phrase": "second_set"}, {"score": 0.002419025278429845, "phrase": "average_number"}, {"score": 0.002304824112812496, "phrase": "time_complexity"}, {"score": 0.002150019713922273, "phrase": "maximum_number"}, {"score": 0.0021049977753042253, "phrase": "tabu_algorithm"}], "paper_keywords": ["Wireless Sensor Networks", " Approximation algorithms", " Bounded delays", " Binary Integer Linear Program"], "paper_abstract": "Wireless Sensor Networks (WSNs) have many characteristics that are attractive to a myriad of applications. In particular, nodes employ multi-hop communications to collaboratively forward sensed data back to one or more sinks. In this context, reducing the end-to-end delay between the sink and sensor/source nodes is of interest to many applications. In particular, those that require a fixed, upper bound on end-to-end delays. To this end, we focus on bounding the end-to-end delay from the sink to each source. We first formulate the problem as a Binary Integer Program (BIP). As the problem is NP-hard, this paper proposes and studies two centralized, heuristic algorithms: Tabu and Domino. The key approach used by both algorithms is to determine the minimal number of extra wake-up slots required by a given network in order to ensure the delay of all end-to-end paths is within a given bound. We conducted two sets of experiments. The first set compares BIP, Tabu, and Domino in WSNs with up to 80 nodes. These experiments serve to compare the proposed algorithms against BIP, which become computationally expensive in large scale WSNs. The results show that, compared to BIP, the number of additional wake-up times generated by Tabu and Domino are within 5 and 10 % of the optimal solution. In the second set of experiments, which evaluates the algorithms in WSNs with 100-500 nodes, the average number of extra wake-up slots activated by Domino is 13 % greater than Tabu. These algorithms have a time complexity of and respectively, where is the number of nodes, is the number of slots in one period, and is the maximum number of iterations carried out by the Tabu algorithm.", "paper_title": "Algorithms for bounding end-to-end delays in Wireless Sensor Networks", "paper_id": "WOS:000342229400031"}