{"auto_keywords": [{"score": 0.036123960464141965, "phrase": "indoor_reared_broiler_farm"}, {"score": 0.00481495049065317, "phrase": "intensive_poultry_farming"}, {"score": 0.0047906082951008665, "phrase": "chicken_weight"}, {"score": 0.004718314112245913, "phrase": "feed_conversion"}, {"score": 0.004588583394515502, "phrase": "expected_homogeneous_growth_trend"}, {"score": 0.004485085675709643, "phrase": "novel_method"}, {"score": 0.004428594547779283, "phrase": "growth_rate"}, {"score": 0.004406196943817329, "phrase": "broiler_chickens"}, {"score": 0.004383912116871646, "phrase": "sound_analysis"}, {"score": 0.004317728683659697, "phrase": "process_engineering"}, {"score": 0.004295889364044886, "phrase": "precision_livestock_farming"}, {"score": 0.004231029153290218, "phrase": "audio_and_video_information"}, {"score": 0.0042096265108205804, "phrase": "on-line_automated_tools"}, {"score": 0.0038814864204867855, "phrase": "broiler_vocalisations"}, {"score": 0.003861845081027241, "phrase": "normal_farm_conditions"}, {"score": 0.003793876828939456, "phrase": "animal_sounds"}, {"score": 0.003717656912608012, "phrase": "regular_intervals"}, {"score": 0.0036801209922064817, "phrase": "entire_life"}, {"score": 0.0034017370314037205, "phrase": "audio_recording_procedures"}, {"score": 0.0032251796659158696, "phrase": "broiler_house"}, {"score": 0.0030655302236416502, "phrase": "growth_trend"}, {"score": 0.003026864499652483, "phrase": "sound_recordings"}, {"score": 0.0028697077879305064, "phrase": "significant_correlation"}, {"score": 0.002457862197091562, "phrase": "preliminary_study"}, {"score": 0.0023599666007519788, "phrase": "specific_frequencies"}, {"score": 0.0022091148604217784, "phrase": "health_and_welfare_status"}, {"score": 0.002181227522730908, "phrase": "farm_level"}, {"score": 0.002121105697100881, "phrase": "automated_growth_monitoring_tool"}], "paper_keywords": ["Broiler", " Vocalisation", " PLF", " Grow trend", " Frequency analysis"], "paper_abstract": "Chicken weight provides information about growth and feed conversion of the flock in order to identify deviations from the expected homogeneous growth trend of the birds. This paper proposes a novel method to automatically measure the growth rate of broiler chickens by sound analysis. Through the application of process engineering, Precision Livestock Farming (PLF) can combine audio and video information into on-line automated tools that can be used to control, monitor and model the behaviour, health and production of animals and their biological response. The aim of this study was to record and analyse broiler vocalisations under normal farm conditions, to identify the relation between animal sounds and their weight. Recordings were made at regular intervals, during the entire life of birds, in order to evaluate the variation of frequency and bandwidth of the sounds emitted by the animals. Two experimental trials were carried out in an indoor reared broiler farm; the audio recording procedures lasted for 38 days. The recordings were made, in an automated, non-invasive and non-intrusive way and without disturbing the animals in to the broiler house. Once a week, 50 birds were selected at random and their weight recorded in order to follow the growth trend in the birds. Sound recordings were manually analysed and labelled using the Adobe (R) Audition (TM) CS6 software. Analysing the sounds recorded, it was possible to find a significant correlation (P < 0.001) between the frequencies of the vocalisations recorded and the weight of the broilers. The results explained how the frequency of the sounds emitted by the animals was inversely proportional to the age and to the weight of the broilers; the more they grow, the lower the frequency of the sounds emitted by the animals. This preliminary study, conducted in an indoor reared broiler farm, shows how this method based on the identification of specific frequencies of the sounds, linked to the age and to the weight of the birds, might be used as an early warning method/system to evaluate the health and welfare status of the animals at farm level. This is the basis for a further development of an automated growth monitoring tool. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "An innovative approach to predict the growth in intensive poultry farming", "paper_id": "WOS:000366781500019"}