{"auto_keywords": [{"score": 0.04976229174017987, "phrase": "virtual_environments"}, {"score": 0.048824896279579914, "phrase": "brain_injury_rehabilitation"}, {"score": 0.00481495049065317, "phrase": "interaction_methods"}, {"score": 0.004461131750106576, "phrase": "training_tool"}, {"score": 0.004387707794516453, "phrase": "rehabilitation_process"}, {"score": 0.004329835888760592, "phrase": "so-called_instrumental_activities"}, {"score": 0.004038249989123055, "phrase": "brain_injury_patient"}, {"score": 0.0037662262006579023, "phrase": "virtual_objects"}, {"score": 0.003728885511755734, "phrase": "understandable_way"}, {"score": 0.00367967106192446, "phrase": "brain_injury"}, {"score": 0.003595097948724078, "phrase": "poor_interface"}, {"score": 0.0032757395605609923, "phrase": "initial_usability_testing"}, {"score": 0.0031476805104529377, "phrase": "first_study_four_navigation_input_device_configurations"}, {"score": 0.003095806891672679, "phrase": "intellikeys"}, {"score": 0.003054922297665861, "phrase": "microsoft_sidewinder_joystick"}, {"score": 0.0028966970007550824, "phrase": "second_study"}, {"score": 0.0027557911038816256, "phrase": "sufficiently_usable_input_device"}, {"score": 0.0026304533650262545, "phrase": "navigation_tasks"}, {"score": 0.0024776238724770524, "phrase": "specific_task"}, {"score": 0.002453027723284009, "phrase": "big_differences"}, {"score": 0.0022200746395981876, "phrase": "touch_screen"}, {"score": 0.0021049977753042253, "phrase": "different_ways"}], "paper_keywords": [""], "paper_abstract": "It is speculated that virtual environments (VE) might be used as a training tool in brain injury rehabilitation. The rehabilitation process often involves practicing so-called instrumental activities of daily living (IADL), such as shopping, cooking, and using a telephone. If a brain injury patient is to practice such activities in a VE, the patient must be able to navigate the viewpoint and interact with virtual objects in an understandable way. People with brain injury may be less tolerant to a poor interface and a VE might therefore become unusable due to, for example, an unsuitable input device. In this paper we present two studies aimed to do initial usability testing of VE interaction methods on people without experience of 3D computer graphics. In the first study four navigation input device configurations were compared: the IntelliKeys keyboard and the Microsoft Sidewinder joystick, both programmed with two and three degrees of freedom (DOF). The purpose of the second study was to evaluate a method for interaction with objects, and to find a sufficiently usable input device for this purpose. The keyboard was found to be more suitable for navigation tasks in which the user wants to give the viewpoint a more advantageous position and orientation for carrying out a specific task. No big differences could be found between two and three DOFs. The method for interaction with objects was found to work sufficiently well. No difference in performance could be found between mouse and touch screen, but some evidence was found that they affect the usability of the VE interface in different ways.", "paper_title": "Initial usability testing of navigation and interaction methods in virtual environments: Developing usable interfaces for brain injury rehabilitation", "paper_id": "WOS:000244149200003"}