{"auto_keywords": [{"score": 0.040318064574209334, "phrase": "dynamic_content"}, {"score": 0.015719716506582538, "phrase": "social_network_analysis_parameters"}, {"score": 0.004750440867604888, "phrase": "browser_usability"}, {"score": 0.004718509350356246, "phrase": "malware_exposure"}, {"score": 0.004577440795549049, "phrase": "internet_users"}, {"score": 0.004351595642056769, "phrase": "malicious_content"}, {"score": 0.0042500322609733574, "phrase": "major_threat"}, {"score": 0.004207230913063179, "phrase": "user's_most_sensitive_information"}, {"score": 0.004122915045353472, "phrase": "firefox"}, {"score": 0.0040539330132720285, "phrase": "maxthon"}, {"score": 0.003986130743534159, "phrase": "javascript"}, {"score": 0.0033669963955215427, "phrase": "security_extensions"}, {"score": 0.0033106223384515546, "phrase": "novel_approach"}, {"score": 0.0032115093493071366, "phrase": "user_trust_perspective"}, {"score": 0.0031791333962016507, "phrase": "html_page"}, {"score": 0.0030943929355983437, "phrase": "url"}, {"score": 0.003042555825368091, "phrase": "address_bar"}, {"score": 0.0029614320534324104, "phrase": "inner_html_url_reputations"}, {"score": 0.0027400176498756823, "phrase": "url_reputation"}, {"score": 0.0026134084008199933, "phrase": "whole_web"}, {"score": 0.002569619998744729, "phrase": "url."}, {"score": 0.002306189434657134, "phrase": "malware_web-pages"}, {"score": 0.002267536195741775, "phrase": "user_intervention"}, {"score": 0.002148136905808445, "phrase": "important_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Social network analysis", " Malware", " NoScript", " Web browser", " JavaScript"], "paper_abstract": "Drive-by-download malware exposes internet users to infection of their personal computers, which can occur simply by visiting a website containing malicious content. This can lead to a major threat to the user's most sensitive information. Popular browsers such as Firefox, Internet Explorer and Maxthon have extensions that block JavaScript, Flash and other executable content. Some extensions globally block all dynamic content, and in others the user needs to specifically enable the content for each site (s)he trusts. Since most of the web-pages today contain dynamic content, disabling them damages user experience and page usability, and that prevents many users from installing security extensions. We propose a novel approach, based on Social Network Analysis parameters, that predicts the user trust perspective for the HTML page currently being viewed. Our system examines the URL that appears in the address bar of the browser and each of the inner HTML URL reputations, and only if all of them have a reputation greater than our predetermined threshold, it marks the webpage as trusted. Each URL reputation is calculated based on the number and quality of the links on the whole web pointing back to the URL. The method was examined on a corpus of 44,429 malware domains and on the top 2000 most popular Alexa sites. Our system managed to enable dynamic content of 70% of the most popular websites and block 100% of malware web-pages, all without any user intervention. Our approach can augment most browser security applications and enhance their effectiveness, thus encouraging more users to install these important applications. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "WhiteScript: Using social network analysis parameters to balance between browser usability and malware exposure", "paper_id": "WOS:000287431400003"}