{"auto_keywords": [{"score": 0.022712678496103873, "phrase": "verification_bias"}, {"score": 0.014478685438831943, "phrase": "kappa_coefficients"}, {"score": 0.00897088567145915, "phrase": "gold_standard"}, {"score": 0.0043947942344037105, "phrase": "real_state"}, {"score": 0.0036776458116294986, "phrase": "partial_verification"}, {"score": 0.003265591844292821, "phrase": "first_method"}, {"score": 0.0028731719610706214, "phrase": "maximum_likelihood_estimators"}, {"score": 0.0024258208033731154, "phrase": "simulation_experiments"}, {"score": 0.0023386327847292805, "phrase": "asymptotic_behaviour"}, {"score": 0.002163600705898299, "phrase": "coronary_stenosis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["comparing diagnostic tests", " kappa", " partial verification", " risk", " verification bias"], "paper_abstract": "The comparison of the accuracy of two binary diagnostic tests has traditionally required knowledge of the real state of the disease in all of the patients in the sample via the application of a gold standard. In practice, the gold standard is not always applied to all patients, which gives rise to the problem of partial verification of the disease. In this study, two methods of comparison of the efficiency of two binary diagnostic tests in the presence of verification bias are proposed. The first method consists of a comparison of the risk of error of two diagnostic tests, and the second a comparison of the kappa coefficients of the risk of error. The maximum likelihood estimators of risks and kappa coefficients are obtained. The tests of hypotheses to compare the risks and the kappa coefficients of two binary diagnostic tests when both are applied to the same random sample in the presence of verification bias are deduced, and simulation experiments are performed in order to investigate the asymptotic behaviour of each test of hypothesis. The results obtained have been applied to a study of coronary stenosis. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Comparing two binary diagnostic tests in the presence of verification bias", "paper_id": "WOS:000234940500010"}