{"auto_keywords": [{"score": 0.03399397640770327, "phrase": "citation_networks"}, {"score": 0.00481495049065317, "phrase": "pagerank-based_author_rankings"}, {"score": 0.00469159356595623, "phrase": "basic_indicators"}, {"score": 0.004631099806015235, "phrase": "researcher's_productivity"}, {"score": 0.003894963476923956, "phrase": "fastest_and_cheapest_way"}, {"score": 0.003571850980647625, "phrase": "scientific_achievements"}, {"score": 0.0033762956164519286, "phrase": "pagerank_algorithm"}, {"score": 0.0031502008922533894, "phrase": "recursive_method"}, {"score": 0.0027902541641601324, "phrase": "standard_citation_counts"}, {"score": 0.0026718978608934077, "phrase": "computer_science_papers"}, {"score": 0.0026146109167103655, "phrase": "artificial_intelligence"}, {"score": 0.0025920406425973368, "phrase": "software_engineering"}, {"score": 0.0023974563359295043, "phrase": "resulting_rankings"}, {"score": 0.0023767561522363367, "phrase": "selfcompiled_lists"}, {"score": 0.0023562342764987254, "phrase": "outstanding_researchers"}, {"score": 0.0023257824499250653, "phrase": "frequent_editorial_board_members"}, {"score": 0.002179313258573377, "phrase": "pagerank-based_methods"}, {"score": 0.0021604924928015283, "phrase": "simple_citation_counts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["PageRank", " Scholars", " Citations", " Rankings", " Importance"], "paper_abstract": "The basic indicators of a researcher's productivity and impact are still the number of publications and their citation counts. These metrics are clear, straightforward, and easy to obtain. When a ranking of scholars is needed, for instance in grant, award, or promotion procedures, their use is the fastest and cheapest way of prioritizing some scientists over others. However, due to their nature, there is a danger of oversimplifying scientific achievements. Therefore, many other indicators have been proposed including the usage of the PageRank algorithm known for the ranking of webpages and its modifications suited to citation networks. Nevertheless, this recursive method is computationally expensive and even if it has the advantage of favouring prestige over popularity, its application should be well justified, particularly when compared to the standard citation counts. In this study, we analyze three large datasets of computer science papers in the categories of artificial intelligence, software engineering, and theory and methods and apply 12 different ranking methods to the citation networks of authors. We compare the resulting rankings with selfcompiled lists of outstanding researchers selected as frequent editorial board members of prestigious journals in the field and conclude that there is no evidence of PageRank-based methods outperforming simple citation counts. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Do PageRank-based author rankings outperform simple citation counts?", "paper_id": "WOS:000351640700007"}