{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "game_assessment"}, {"score": 0.004725886853744007, "phrase": "nonverbal_cognitive_skills"}, {"score": 0.004573953147933065, "phrase": "field_study"}, {"score": 0.004205226397573506, "phrase": "tagtiles_console"}, {"score": 0.003920674807745575, "phrase": "cognitive_skills"}, {"score": 0.0037242701420971062, "phrase": "high_correlation"}, {"score": 0.0033603864623013733, "phrase": "nonverbal_skills"}, {"score": 0.0032674478600540477, "phrase": "different_operations"}, {"score": 0.0032370412139943808, "phrase": "abstract_patterns"}, {"score": 0.0031182092708983184, "phrase": "memory_and_mirroring_patterns"}, {"score": 0.0030604342671868836, "phrase": "current_study"}, {"score": 0.0028265625216338875, "phrase": "gaming_context"}, {"score": 0.002514625755809045, "phrase": "study_support"}, {"score": 0.00246800641971897, "phrase": "nonverbal_iq-scores"}, {"score": 0.002154835714714195, "phrase": "specific_skills"}, {"score": 0.0021049977753042253, "phrase": "screening_tool"}], "paper_keywords": ["Tangible interfaces", " TagTiles", " Field test", " Learning", " Assessment", " Training"], "paper_abstract": "We present a field study with a game for children called 'Tap the little hedgehog', which is played on the TagTiles console, a tangible electronic interface. The game was developed to train and assess cognitive skills and includes tasks which, in isolation, exhibit a high correlation with a number of subtests from the Wechsler Intelligence Scale for Children (WISC-III-NL). The tasks address a range of nonverbal skills by requiring children to perform different operations on abstract patterns such as copying, reproducing sequences from memory and mirroring patterns. In the current study, we tested whether these tasks kept their ability to address these skills if included in a gaming context, whether children are able to play the game independently and whether they are motivated to play the game. The results of the study support the hypothesis that nonverbal IQ-scores, as measured by the Wechsler Intelligence Scale for Children, can improve by training with a game. Hence, games like 'Tap the little hedgehog' can be used to train specific skills and serve as a screening tool for these skills. The results also confirm that children can play the game independently and that they enjoy it. We further found that children quickly learn how to play the game and use the interface.", "paper_title": "In-game assessment and training of nonverbal cognitive skills using TagTiles", "paper_id": "WOS:000327131800007"}