{"auto_keywords": [{"score": 0.02707533816895571, "phrase": "gnmm"}, {"score": 0.012314200367381806, "phrase": "ga"}, {"score": 0.01176152859750114, "phrase": "successful_training"}, {"score": 0.008300247302882393, "phrase": "classification_accuracy"}, {"score": 0.00481495049065317, "phrase": "channel_selection"}, {"score": 0.004787261836356901, "phrase": "electroencephalogram_signals"}, {"score": 0.004651246373516082, "phrase": "eeg"}, {"score": 0.00458461023870385, "phrase": "bci"}, {"score": 0.00455821640180683, "phrase": "new_communication_channel"}, {"score": 0.004538538033872606, "phrase": "human_brain"}, {"score": 0.004480008900446322, "phrase": "artificial_neural_networks"}, {"score": 0.004428614141348414, "phrase": "bci_research"}, {"score": 0.004409492803499808, "phrase": "numerous_successful_applications"}, {"score": 0.004352620565010654, "phrase": "conventional_anns"}, {"score": 0.004315112068251308, "phrase": "explicit_input_optimization_mechanism"}, {"score": 0.004271758731365199, "phrase": "ann_learning"}, {"score": 0.004180313676282991, "phrase": "ann-based_method"}, {"score": 0.003935375717589302, "phrase": "fourier"}, {"score": 0.0038669600877722847, "phrase": "signal_strength"}, {"score": 0.003839157256959221, "phrase": "gnmm_method"}, {"score": 0.003577010907689575, "phrase": "fitness_function"}, {"score": 0.0035410467987580484, "phrase": "training_error"}, {"score": 0.003500385958103418, "phrase": "limited_number"}, {"score": 0.003450213580299164, "phrase": "particular_channel"}, {"score": 0.0034353020860809404, "phrase": "winning_chromosome"}, {"score": 0.0033471722682967046, "phrase": "energy_distribution"}, {"score": 0.0033135113265796196, "phrase": "second_step"}, {"score": 0.0032331829927978884, "phrase": "mlp"}, {"score": 0.003200643280638003, "phrase": "large_number"}, {"score": 0.0031230216871739776, "phrase": "input_layer"}, {"score": 0.0030341014659534126, "phrase": "case_studies"}, {"score": 0.0030079209173931795, "phrase": "first_data"}, {"score": 0.002969071798482449, "phrase": "bci_competition"}, {"score": 0.0029349594404635827, "phrase": "imagined_movements"}, {"score": 0.002818614529876468, "phrase": "second_dataset"}, {"score": 0.002790254164160135, "phrase": "hz_eeg"}, {"score": 0.0027422968723193057, "phrase": "right-hand_button-press"}, {"score": 0.002718627370925435, "phrase": "right-pointing_arrow_stimuli"}, {"score": 0.002656500059599507, "phrase": "first_dataset"}, {"score": 0.0025733806003650278, "phrase": "k-fold_cross-validation"}, {"score": 0.0025109329818848196, "phrase": "testing_dataset"}, {"score": 0.0024606422183102382, "phrase": "second_case"}, {"score": 0.002446458869528045, "phrase": "multi-time-windows_pre-processing"}, {"score": 0.002363055184379183, "phrase": "response_correctness_classification"}, {"score": 0.0023460397258997525, "phrase": "actual_responding_hand_classification"}, {"score": 0.002236762786982225, "phrase": "data_collection"}, {"score": 0.0021951221367869237, "phrase": "important_step"}, {"score": 0.0021667479913120105, "phrase": "pre-processing_method"}, {"score": 0.0021233361369222344, "phrase": "appropriate_time_window_position"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Genetic algorithm", " Artificial neural networks", " Least square approximation", " Brain-computer-interface", " EEG channel selection"], "paper_abstract": "Objective: An electroencephalogram-based (EEG-based) brain-computer-interface (BCI) provides a new communication channel between the human brain and a computer. Amongst the various available techniques, artificial neural networks (ANNs) are well established in BCI research and have numerous successful applications. However, one of the drawbacks of conventional ANNs is the lack of an explicit input optimization mechanism. In addition, results of ANN learning are usually not easily interpretable. In this paper, we have applied an ANN-based method, the genetic neural mathematic method (GNMM), to two EEG channel selection and classification problems, aiming to address the issues above. Methods and materials: Pre-processing steps include: least-square (LS) approximation to determine the overall signal increase/decrease rate; locally weighted polynomial regression (Loess) and fast Fourier transform (FFT) to smooth the signals to determine the signal strength and variations. The GNMM method consists of three successive steps: (1) a genetic algorithm-based (GA-based) input selection process; (2) multi-layer perceptron-based (MLP-based) modelling; and (3) rule extraction based upon successful training. The fitness function used in the GA is the training error when an MLP is trained for a limited number of epochs. By averaging the appearance of a particular channel in the winning chromosome over several runs, we were able to minimize the error due to randomness and to obtain an energy distribution around the scalp. In the second step, a threshold was used to select a subset of channels to be fed into an MLP, which performed modelling with a large number of iterations, thus fine-tuning the input/output relationship. Upon successful training, neurons in the input layer are divided into four sub-spaces to produce if-then rules (step 3). Two datasets were used as case studies to perform three classifications. The first data were electrocorticography (ECoG) recordings that have been used in the BCI competition III. The data belonged to two categories, imagined movements of either a finger or the tongue. The data were recorded using an 8 x 8 ECoG platinum electrode grid at a sampling rate of 1000 Hz for a total of 378 trials. The second dataset consisted of a 32-channel, 256 Hz EEG recording of 960 trials where participants had to execute a left- or right-hand button-press in response to left- or right-pointing arrow stimuli. The data were used to classify correct/incorrect responses and left/right hand movements. Results: For the first dataset, 100 samples were reserved for testing, and those remaining were for training and validation with a ratio of 90%:10% using K-fold cross-validation. Using the top 10 channels selected by GNMM, we achieved a classification accuracy of 0.80 +/- 0.04 for the testing dataset, which compares favourably with results reported in the literature. For the second case, we performed multi-time-windows pre-processing over a single trial. By selecting 6 channels out of 32, we were able to achieve a classification accuracy of about 0.86 for the response correctness classification and 0.82 for the actual responding hand classification, respectively. Furthermore, 139 regression rules were identified after training was completed. Conclusions: We demonstrate that GNMM is able to perform effective channel selections/reductions, which not only reduces the difficulty of data collection, but also greatly improves the generalization of the classifier. An important step that affects the effectiveness of GNMM is the pre-processing method. In this paper, we also highlight the importance of choosing an appropriate time window position. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Channel selection and classification of electroencephalogram signals: An artificial neural network and genetic algorithm-based approach", "paper_id": "WOS:000305364000005"}