{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "document_filtering_systems"}, {"score": 0.0495902419915109, "phrase": "document_filtering"}, {"score": 0.02969146130504461, "phrase": "false_positives"}, {"score": 0.0047292449487169345, "phrase": "popular_task"}, {"score": 0.004705037720076602, "phrase": "information_retrieval"}, {"score": 0.004458189822972851, "phrase": "distinguishing_feature"}, {"score": 0.004401342842183475, "phrase": "temporal_aspect"}, {"score": 0.004159668541479049, "phrase": "traditional_metrics"}, {"score": 0.004037177637629661, "phrase": "map"}, {"score": 0.003861175855298779, "phrase": "relevant_aspects"}, {"score": 0.0037152558756361606, "phrase": "temporal_dimension"}, {"score": 0.0036396918790049418, "phrase": "time-sensitive_way"}, {"score": 0.0035473867669654174, "phrase": "trend_estimation"}, {"score": 0.0034308688638878286, "phrase": "trend_line"}, {"score": 0.0033524446366638436, "phrase": "estimated_performance"}, {"score": 0.0032842354746763906, "phrase": "evaluation_period"}, {"score": 0.003103709446145337, "phrase": "valid_significance_testing"}, {"score": 0.002963390095037466, "phrase": "traditional_macro-averaged_true-positive-based_metrics"}, {"score": 0.0028807718824400697, "phrase": "essential_information"}, {"score": 0.0027153723391625043, "phrase": "ground_truth"}, {"score": 0.0026464463491558702, "phrase": "serious_flaw"}, {"score": 0.002546315584783112, "phrase": "new_metric"}, {"score": 0.0024499640547945498, "phrase": "overall_score"}, {"score": 0.0024186620196958867, "phrase": "new_score"}, {"score": 0.0022680361841334105, "phrase": "evaluation_campaign"}, {"score": 0.0021709933368474223, "phrase": "trec_knowledge_base_acceleration_track"}, {"score": 0.002143247921132179, "phrase": "important_new_insights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Time-aware information retrieval", " Evaluation", " Significance testing"], "paper_abstract": "Document filtering is a popular task in information retrieval. A stream of documents arriving over time is filtered for documents relevant to a set of topics. The distinguishing feature of document filtering is the temporal aspect introduced by the stream of documents. Document filtering systems, up to now, have been evaluated in terms of traditional metrics like (micro- or macro-averaged) precision, recall, MAP, nDCG, F1 and utility. We argue that these metrics do not capture all relevant aspects of the systems being evaluated. In particular, they lack support for the temporal dimension of the task. We propose a time-sensitive way of measuring performance of document filtering systems over time by employing trend estimation. In short, the performance is calculated for batches, a trend line is fitted to the results, and the estimated performance of systems at the end of the evaluation period is used to compare systems. We detail the application of our proposed trend estimation framework and examine the assumptions that need to hold for valid significance testing. Additionally, we analyze the requirements a document filtering metric has to meet and show that traditional macro-averaged true-positive-based metrics, like precision, recall and utility fail to capture essential information when applied in a batch setting. In particular, false positives returned in a batch for topics that are absent from the ground truth in that batch go unnoticed. This is a serious flaw as over-generation of a system might be overlooked this way. We propose a new metric, aptness, that does capture false positives. We incorporate this metric in an overall score and show that this new score does meet all requirements. To demonstrate the results of our proposed evaluation methodology, we analyze the runs submitted to the two most recent editions of a document filtering evaluation campaign. We re-evaluate the runs submitted to the Cumulative Citation Recommendation task of the 2012 and 2013 editions of the TREC Knowledge Base Acceleration track, and show that important new insights emerge. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating document filtering systems over time", "paper_id": "WOS:000362619300004"}