{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autism_spectrum_disorders"}, {"score": 0.015407609159732633, "phrase": "cognitive_disorders"}, {"score": 0.01332027453347865, "phrase": "co-design_techniques"}, {"score": 0.00457696724030363, "phrase": "asperger's_syndrome"}, {"score": 0.00395101799538683, "phrase": "individual_abilities"}, {"score": 0.0038131738052230254, "phrase": "technology_design"}, {"score": 0.0030038988468808845, "phrase": "support_agencies"}, {"score": 0.0029137604783116065, "phrase": "information_technologies"}, {"score": 0.0025793874956029795, "phrase": "-design_techniques"}, {"score": 0.0024392031587145728, "phrase": "potential_democratisation"}, {"score": 0.00240230883427752, "phrase": "ict."}, {"score": 0.0021049977753042253, "phrase": "ict_design"}], "paper_keywords": ["Information and communications technologies", " Co-design", " Autism spectrum disorders", " Digital assistive technologies"], "paper_abstract": "People with cognitive disorders, such as autism or Asperger's syndrome, face many barriers when being involved in the co-design of information and communications technologies (ICT). Cognitive disorders may require that co-design techniques be modified to fit with individual abilities. Up until recently, with technology design, purpose and use being in the hands of 'experts' there was little opportunity for customisation. However, ICT bring together various threads that make open many new possibilities. Not only are technologies cheaper, more powerful and more available than ever, but now parents, support agencies and people with autism spectrum disorders expect information technologies to be part of their worlds, and they have the capacity to participate in co-design for customisation. However, co-design techniques have not evolved to the extent that they capture this potential democratisation of the ICT. This paper reports on an investigation of the potential to develop a set of guidelines for co-design techniques to enable people with autism spectrum disorders to participate in ICT design.", "paper_title": "Towards co-design with users who have autism spectrum disorders", "paper_id": "WOS:000207889400001"}