{"auto_keywords": [{"score": 0.03769491979475599, "phrase": "svm"}, {"score": 0.03741531118841527, "phrase": "cmm"}, {"score": 0.00481495049065317, "phrase": "well-known_classifier_paradigms"}, {"score": 0.004706699397060569, "phrase": "new_insight"}, {"score": 0.004396267325338022, "phrase": "mixture_density_models"}, {"score": 0.0036368625017975343, "phrase": "specific_classifier"}, {"score": 0.003528129580568382, "phrase": "fcl"}, {"score": 0.0034882329111886093, "phrase": "rbf"}, {"score": 0.0034096661914349577, "phrase": "objective_function"}, {"score": 0.003371066990851953, "phrase": "optimization_algorithm"}, {"score": 0.0031246358910995316, "phrase": "discriminative_classifier"}, {"score": 0.0030196821790309165, "phrase": "optimal_generalization_capabilities"}, {"score": 0.002996840657035727, "phrase": "new_data"}, {"score": 0.0029629009627331355, "phrase": "generative_classifier"}, {"score": 0.002746225320405654, "phrase": "comprehensible_classifier"}, {"score": 0.002613935123129054, "phrase": "human_domain_experts"}, {"score": 0.0022284577808744316, "phrase": "classifier_paradigms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Gaussian mixture models", " Support vector machines", " Fuzzy classifiers", " Radial basis function neural networks", " Classification"], "paper_abstract": "This article provides some new insight into the properties of four well-established classifier paradigms, namely support vector machines (SVM), classifiers based on mixture density models (CMM), fuzzy classifiers (FCL), and radial basis function neural networks (RBF). It will be shown that these classifiers can be formulated in a way such that they are functionally equivalent or at least highly similar. The interpretation of a specific classifier as being an SVM, CMM, FCL, or RBF then only depends on the objective function and the optimization algorithm used to adjust the parameters. The properties of these four paradigms, however, are very different: a discriminative classifier such as an SVM is expected to have optimal generalization capabilities on new data, a generative classifier such as a CMM also aims at modeling the processes from which the observed data originate, and a comprehensible classifier such as an FCL is intended to be parameterized and understood by human domain experts. We will discuss the advantages and disadvantages of these properties and show how they can be measured numerically in order to compare these classifiers. In such a way, the article aims at supporting a practitioner in assessing the properties of classifier paradigms and in selecting or combining certain paradigms for a given application problem. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "So near and yet so far: New insight into properties of some well-known classifier paradigms", "paper_id": "WOS:000280380500001"}