{"auto_keywords": [{"score": 0.04026157255412937, "phrase": "bounding_box"}, {"score": 0.01049310776231292, "phrase": "segmented_object_region"}, {"score": 0.004706699397060569, "phrase": "single_image"}, {"score": 0.004600870784042767, "phrase": "novel_method"}, {"score": 0.004106225442735525, "phrase": "single_calibrated_camera"}, {"score": 0.0034226302212225206, "phrase": "structural_properties"}, {"score": 0.0033967510986397946, "phrase": "back-projected_object_regions"}, {"score": 0.0031127970604842375, "phrase": "suitable_base"}, {"score": 0.003042697264766327, "phrase": "expected_on-ground_object_points"}, {"score": 0.002951673109860487, "phrase": "bilateral_symmetry"}, {"score": 0.002746225320405654, "phrase": "constructed_box"}, {"score": 0.0024691719264774165, "phrase": "dominant_direction"}, {"score": 0.0024227171881502636, "phrase": "common_direction"}, {"score": 0.0022625835448873495, "phrase": "-ground_objects"}, {"score": 0.0022369407711124775, "phrase": "industrial_working_space"}, {"score": 0.0022115879730677, "phrase": "proposed_method"}, {"score": 0.002121056250381627, "phrase": "smart_surveillance"}, {"score": 0.0021049977753042253, "phrase": "autonomous_navigation"}], "paper_keywords": ["3D bounding box estimation", " object localization", " dominant direction of object", " back-projection of image region", " smart surveillance"], "paper_abstract": "This paper proposes a novel method for determining a three-dimensional (3D) bounding box to estimate pose (position and orientation) and size of a 3D object corresponding to a segmented object region in an image acquired by a single calibrated camera. The method is designed to work upon an object on the ground and to determine a bounding box aligned to the direction of the object, thereby reducing the number of degrees of freedom in localizing the bounding box to 5 from 9. Observations associated with the structural properties of back-projected object regions on the ground are suggested, which are useful for determining the object points expected to be on the ground. A suitable base is then estimated from the expected on-ground object points by applying to them an assumption of bilateral symmetry. A bounding box with this base is finally constructed by determining its height, such that back-projection of the constructed box onto the ground minimally encloses back-projection of the given object region. Through experiments with some 3D-modelled objects and real objects, we found that a bounding box aligned to the dominant direction estimated from edges with common direction looks natural, and the accuracy of the pose and size is enough for localizing actual on-ground objects in an industrial working space. The proposed method is expected to be used effectively in the fields of smart surveillance and autonomous navigation.", "paper_title": "Estimation of a 3D Bounding Box for a Segmented Object Region in a Single Image", "paper_id": "WOS:000348141300011"}