{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "right_patterns"}, {"score": 0.004398457709182882, "phrase": "far_more_patterns"}, {"score": 0.004319566932528865, "phrase": "human_expert"}, {"score": 0.004242085112539693, "phrase": "machine_leaning_technique"}, {"score": 0.00406663414150229, "phrase": "different_patterns"}, {"score": 0.003898411343926653, "phrase": "similar_subset"}, {"score": 0.003626000977962191, "phrase": "new_information"}, {"score": 0.0035181731203867456, "phrase": "redundant_information"}, {"score": 0.0031367803372203498, "phrase": "small_subset"}, {"score": 0.0029351141718104725, "phrase": "general_algorithm"}, {"score": 0.0024336917123957387, "phrase": "original_information"}, {"score": 0.0021960024679620886, "phrase": "classification_results"}, {"score": 0.0021049977753042253, "phrase": "developed_solutions"}], "paper_keywords": ["Data mining", " Post processing", " Pattern reduction"], "paper_abstract": "Constrained pattern mining extracts patterns based on their individual merit. Usually this results in far more patterns than a human expert or a machine leaning technique could make use of. Often different patterns or combinations of patterns cover a similar subset of the examples, thus being redundant and not carrying any new information. To remove the redundant information contained in such pattern sets, we propose two general heuristic algorithms-Bouncer and Picker-for selecting a small subset of patterns. We identify several selection techniques for use in this general algorithm and evaluate those on several data sets. The results show that both techniques succeed in severely reducing the number of patterns, while at the same time apparently retaining much of the original information. Additionally, the experiments show that reducing the pattern set indeed improves the quality of classification results. Both results show that the developed solutions are very well suited for the goals we aim at.", "paper_title": "One in a million: picking the right patterns", "paper_id": "WOS:000262483000003"}