{"auto_keywords": [{"score": 0.034246554531909036, "phrase": "cmc"}, {"score": 0.00481495049065317, "phrase": "contemporary_feminist_philosophy"}, {"score": 0.004709567162738894, "phrase": "changing_meaning"}, {"score": 0.0043584824527198055, "phrase": "european_court_of_human_rights"}, {"score": 0.004063348730077936, "phrase": "social_relations"}, {"score": 0.003916098498242888, "phrase": "common_law"}, {"score": 0.003858697684681798, "phrase": "echr"}, {"score": 0.0037325918533747953, "phrase": "contemporary_feminist_thought"}, {"score": 0.003353521531649663, "phrase": "contingent_factors"}, {"score": 0.003267925215811654, "phrase": "particularly_computer_mediated_communication"}, {"score": 0.0031032109441552287, "phrase": "latter_point"}, {"score": 0.003035177667751495, "phrase": "feminist_critique"}, {"score": 0.0030017207229983385, "phrase": "traditional_reluctance"}, {"score": 0.0029686314779877525, "phrase": "liberal_state"}, {"score": 0.002598821419664902, "phrase": "thomas_nagel's_influential_philosophical_analysis"}, {"score": 0.0025606791601860543, "phrase": "nagel's_position"}, {"score": 0.002192389791199368, "phrase": "traditional_\"neutrality"}, {"score": 0.0021049977753042253, "phrase": "online_identity"}], "paper_keywords": ["Privacy", " Feminism", " Law", " Identity", " CMC"], "paper_abstract": "This paper draws upon contemporary feminist philosophy in order to consider the changing meaning of privacy and its relationship to identity, both online and offline. For example, privacy is now viewed by European Court of Human Rights (ECtHR) as a right, which when breached can harm us by undermining our ability to maintain social relations. I briefly outline the meaning of privacy in common law and under the European Convention on Human Rights (ECHR) in order to show the relevance of contemporary feminist thought, in particular the image of selfhood that stresses its relationality. I argue that the meaning of privacy is in the process of altering as a result of a number of contingent factors including both changes in technology, particularly computer mediated communication (CMC), and changes in the status of women. This latter point can be illustrated by the feminist critique of the traditional reluctance of the liberal state to interfere with violence and injustice within the \"privacy'' of the home. In asking the question: \"how is the meaning of \"privacy'' changing?'' I consider not only contemporary legal case law but also Thomas Nagel's influential philosophical analysis of privacy. Nagel's position is useful because of the detail with which he outlines what privacy used to mean, whilst bemoaning its passing. I agree with his view that its meaning is changing but am critical of his perspective. In particular, I challenge his claim regarding the traditional \"neutrality of language'' and consider it in the context of online identity.", "paper_title": "The Changing Meaning of Privacy, Identity and Contemporary Feminist Philosophy", "paper_id": "WOS:000300364100004"}