{"auto_keywords": [{"score": 0.009761416125651904, "phrase": "ranking-value_matrix"}, {"score": 0.00450231514359539, "phrase": "decision_information"}, {"score": 0.0043875257506180865, "phrase": "decision_making"}, {"score": 0.004188198923320451, "phrase": "group_decision"}, {"score": 0.003997891221012094, "phrase": "decision_makers"}, {"score": 0.0037381083634085424, "phrase": "attribute_weights"}, {"score": 0.003151736708029235, "phrase": "ranking-value_measure"}, {"score": 0.0030872017736888113, "phrase": "ranking_value"}, {"score": 0.0030396665931462, "phrase": "attribute_value"}, {"score": 0.002740885774408238, "phrase": "optimization_models"}, {"score": 0.0025625729433234623, "phrase": "obtained_attribute_weights"}, {"score": 0.0021714122348552747, "phrase": "illustrative_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Interval type-2 fuzzy sets (IT2 FSs)", " The ranking-value matrix", " Multi-attribute group decision making (MAGDM)", " Incomplete information", " Optimization models"], "paper_abstract": "Interval type-2 fuzzy sets (IT2 FSs) are a very useful means to depict the decision information in the process of decision making. In this article, we investigate the group decision making problems in which all the information provided by the decision makers (DMs) is expressed as IT2 fuzzy decision matrices, and the information about attribute weights is partially known, which may be constructed by various forms. We first use the IT2 fuzzy weighted arithmetic averaging operator to aggregate all individual IT2 fuzzy decision matrices provided by the DMs into the collective IT2 fuzzy decision matrix, then we utilize the ranking-value measure to calculate the ranking value of each attribute value and construct the ranking-value matrix of the collective IT2 fuzzy decision matrix. Based on the ranking-value matrix and the given attribute weight information, we establish some optimization models to determine the weights of attributes. Furthermore, we utilize the obtained attribute weights and the IT2 fuzzy weighted arithmetic average operator to fuse the IT2 fuzzy information in the collective IT2 fuzzy decision matrix to get the overall IT2 fuzzy values of alternatives by which the ranking of all the given alternatives can be found. Finally, we give an illustrative example. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Multi-attribute group decision making models under interval type-2 fuzzy environment", "paper_id": "WOS:000303274200012"}