{"auto_keywords": [{"score": 0.032186640943925496, "phrase": "visual_words"}, {"score": 0.00481495049065317, "phrase": "bag-of-words_descriptors"}, {"score": 0.004340081802944066, "phrase": "proposed_approach"}, {"score": 0.004247180402119585, "phrase": "feature_points"}, {"score": 0.004084920064588169, "phrase": "local_fourier_descriptors"}, {"score": 0.003894963476923956, "phrase": "feature_point"}, {"score": 0.0037299231609021783, "phrase": "laplace-beltrami_operator"}, {"score": 0.0033909518548844047, "phrase": "preliminary_step"}, {"score": 0.0033471722682967046, "phrase": "visual_dictionary"}, {"score": 0.003261295948815592, "phrase": "large_set"}, {"score": 0.0032331613500559764, "phrase": "feature_descriptors"}, {"score": 0.0029776614744264724, "phrase": "spatial_information"}, {"score": 0.0029392020223716966, "phrase": "spatially-sensitive_algorithm"}, {"score": 0.0022857899334246946, "phrase": "global_shape_retrieval"}, {"score": 0.0022174469839432013, "phrase": "recent_works"}, {"score": 0.0021049977753042253, "phrase": "partial_shape_retrieval"}], "paper_keywords": ["Shape retrieval", " 3D model", " Bag of words"], "paper_abstract": "This paper presents a 3D shape retrieval algorithm based on the Bag of Words (BoW) paradigm. For a given 3D shape, the proposed approach considers a set of feature points uniformly sampled on the surface and associated with local Fourier descriptors. This descriptor is computed in the neighborhood of each feature point by projecting the geometry onto the eigenvectors of the Laplace-Beltrami operator; it is very informative, robust to connectivity and geometry changes, and also fast to compute. In a preliminary step, a visual dictionary is built by clustering a large set of feature descriptors, then each 3D shape is described by an histogram of occurrences of these visual words, hence discarding any spatial information. A spatially-sensitive algorithm is also presented where the 3D shape is described by an histogram of pairs of visual words. We show that these two approaches are complementary and can be combined to improve the performance and the robustness of the retrieval. The performances have been compared against very recent state-of-the-art methods on several different datasets. For global shape retrieval, our combined approach is comparable to these recent works, however, it clearly outperforms them in the case of partial shape retrieval.", "paper_title": "Combination of bag-of-words descriptors for robust partial shape retrieval", "paper_id": "WOS:000307284700004"}