{"auto_keywords": [{"score": 0.042073270567751814, "phrase": "permanent_magnet_linear_actuator"}, {"score": 0.012100987627014293, "phrase": "pnm"}, {"score": 0.010598680222049952, "phrase": "global_variables"}, {"score": 0.010420690170627822, "phrase": "designed_actuator"}, {"score": 0.008382899194222814, "phrase": "good_agreement"}, {"score": 0.00481495049065317, "phrase": "linear_actuator"}, {"score": 0.004774115617883476, "phrase": "analytical_approach"}, {"score": 0.004640472497133447, "phrase": "industrial_processes"}, {"score": 0.004421770937919324, "phrase": "wanted_features"}, {"score": 0.0042373381286051354, "phrase": "good_accuracy"}, {"score": 0.004213332968720317, "phrase": "reasonable_computation_time"}, {"score": 0.0039022135263746737, "phrase": "electromechanical_considerations"}, {"score": 0.0034142492295833387, "phrase": "geometric_parameters"}, {"score": 0.0033374707981578553, "phrase": "pnm."}, {"score": 0.0029956288559843235, "phrase": "developed_model"}, {"score": 0.0028542251004668156, "phrase": "local_phenomena"}, {"score": 0.002805923530823771, "phrase": "magnetic_flux_density"}, {"score": 0.002782079283183827, "phrase": "induced_current"}, {"score": 0.00235883374582576, "phrase": "pnm_model"}, {"score": 0.0023123057299992587, "phrase": "relative_good_accuracy"}, {"score": 0.0022346638243276717, "phrase": "cogging_forces"}, {"score": 0.002184353189568121, "phrase": "induced_currents"}, {"score": 0.002159623311924437, "phrase": "accurate_results"}, {"score": 0.0021049977753042253, "phrase": "magnetostatic_load_operating"}], "paper_keywords": ["design", " electric machines", " finite element analysis", " actuators"], "paper_abstract": "Purpose - Electromagnetic actuators, with very specific features for industrial processes, are needed much more for an increase in reliability and dynamic. To reach the wanted features, the actuator has to be designed and its performance has to be quantified with good accuracy and reasonable computation time. The purpose of this paper is to present the design and the study of a permanent magnet linear actuator. Design/methodology/approach - The first design of the permanent magnet linear actuator has been introduced from electromechanical considerations. Then, both models utilized to study the actuator are presented: the permeance network model (PNM) and the 3D finite element model. These models are used to quantify the performance of the prototype. Owing to its speed, the influence of geometric parameters on the performances are studied by the PNM. Then, both models are used to perform calculations on global variables. A prototype of the designed actuator has been built up and the results obtained by both models are compared with the measurements. Findings - The developed model has been used to study the behaviour of the designed actuator. Using the 3D-FEM, the local phenomena have been highlighted as the magnetic flux density and the induced current. Then, global variables as the no load fluxes and the forces at load have been determined. The results obtained by both models have been compared together and show a good agreement. They are also very close to the measurements achieved on the prototype constructed. Originality/value - This paper shows that it is possible to use a PNM model to design a permanent magnet linear actuator with a relative good accuracy. The PNM developed does not permit one to calculate the cogging forces and does not take into account the induced currents but it gives accurate results when the interest is focused only on the magnetostatic load operating. The comparison with the results given by 3D-FEM and to the measurements shows a good agreement.", "paper_title": "Design and study of a linear actuator using an analytical approach and the 3D FEM", "paper_id": "WOS:000249232200008"}