{"auto_keywords": [{"score": 0.03791483171214045, "phrase": "behavioral_criteria"}, {"score": 0.006826570995563516, "phrase": "model_behavior"}, {"score": 0.006270161351187629, "phrase": "model_robot"}, {"score": 0.005448935953802025, "phrase": "learning_robot"}, {"score": 0.00481495049065317, "phrase": "underlying_behavioral_criteria"}, {"score": 0.004774115617883476, "phrase": "manipulator_motion"}, {"score": 0.004654779963297256, "phrase": "proposed_method"}, {"score": 0.004633888966463624, "phrase": "conventional_humanoid_robotic_behaviors"}, {"score": 0.004497762477097628, "phrase": "programmer's_personal_experience"}, {"score": 0.0041835168653521, "phrase": "humanoid_robot"}, {"score": 0.004130376386308024, "phrase": "new_adaptive_behaviors"}, {"score": 0.003697100573612401, "phrase": "human_behavioral_criteria"}, {"score": 0.003542786326740931, "phrase": "humanoid_robots"}, {"score": 0.0034386016613475335, "phrase": "similar_tasks"}, {"score": 0.0032950412841674026, "phrase": "morphologically_different_humans"}, {"score": 0.003130633384437765, "phrase": "manipulator_robot"}, {"score": 0.002742787059497186, "phrase": "learning_manipulator_robot"}, {"score": 0.0025291601927956765, "phrase": "human_and_robot_bodies"}, {"score": 0.0024969812322112174, "phrase": "body_sizes"}, {"score": 0.0021968238865548812, "phrase": "model_behaviors"}], "paper_keywords": ["behavioral criteria", " genetic algorithm (GA)", " learning system", " modeling", " robot programming"], "paper_abstract": "Conventional humanoid robotic behaviors are directly programmed depending on the programmer's personal experience. With this method, the behaviors usually appear unnatural. It is believed that a humanoid robot can acquire new adaptive behaviors from a human, if the robot has the criteria underlying such behaviors. The aim of this paper is to establish a method of acquiring human behavioral criteria. The advantage of acquiring behavioral criteria is that the humanoid robots can then autonomously produce behaviors for similar tasks with the same behavioral criteria but without transforming data obtained from morphologically different humans every time for every task. In this paper, a manipulator robot learns a model behavior, and another robot is created to perform the model behavior instead of being performed by a person. The model robot is presented some behavioral criteria, but the learning manipulator robot does not know them and tries to infer them. In addition, because of the difference between human and robot bodies, the body sizes of the learning robot and the model robot are also made different. The method of obtaining behavioral criteria is realized by comparing the efficiencies with which the learning robot ' learns the model behaviors. Results from the simulation have demonstrated that the proposed method is effective for obtaining behavioral criteria. The proposed method, the details regarding the simulation, and the results are presented in this paper.", "paper_title": "A study on acquiring underlying behavioral criteria for manipulator motion by focusing on learning efficiency", "paper_id": "WOS:000247390500001"}