{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "robust_statistical_inference"}, {"score": 0.004765482708043842, "phrase": "statistical_inference"}, {"score": 0.004549063619065006, "phrase": "small_datasets"}, {"score": 0.004479120557712926, "phrase": "abnormally_frequent_data"}, {"score": 0.004145143433523008, "phrase": "training_sample"}, {"score": 0.0034771228725942846, "phrase": "pointwise_probability_reinforcements"}, {"score": 0.002977419551510206, "phrase": "proposed_solution"}, {"score": 0.0027837615811247963, "phrase": "statistical_inference_method"}, {"score": 0.002684740763324991, "phrase": "likelihood_maximisation"}, {"score": 0.0022283519468680475, "phrase": "abnormality_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Maximum likelihood", " Outliers", " Robust inference", " Filtering", " Cleansing", " Probability reinforcements"], "paper_abstract": "Statistical inference using machine learning techniques may be difficult with small datasets because of abnormally frequent data (AFDs). AFDs are observations that are much more frequent in the training sample that they should be, with respect to their theoretical probability, and include e.g. outliers. Estimates of parameters tend to be biased towards models which support such data. This paper proposes to introduce pointwise probability reinforcements (PPRs): the probability of each observation is reinforced by a PPR and a regularisation allows controlling the amount of reinforcement which compensates for AFDs. The proposed solution is very generic, since it can be used to robustify any statistical inference method which can be formulated as a likelihood maximisation. Experiments show that PPRs can be easily used to tackle regression, classification and projection: models are freed from the influence of outliers. Moreover, outliers can be filtered manually since an abnormality degree is obtained for each observation. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Pointwise probability reinforcements for robust statistical inference", "paper_id": "WOS:000330009800012"}