{"auto_keywords": [{"score": 0.049571431541439746, "phrase": "magnetviz"}, {"score": 0.00481495049065317, "phrase": "design_and_evaluation_of_magnetviz-a_graph_visualization_tool"}, {"score": 0.004638602678192715, "phrase": "interactive_manipulation"}, {"score": 0.00458940888106061, "phrase": "force-directed_graph_layouts"}, {"score": 0.004327981760540394, "phrase": "graph_topology"}, {"score": 0.004038076978795421, "phrase": "virtual_magnets"}, {"score": 0.003687960013746783, "phrase": "user-defined_criteria"}, {"score": 0.0035150223642728437, "phrase": "force-directed_nature"}, {"score": 0.003459191419478298, "phrase": "layout_forces"}, {"score": 0.002869613770219469, "phrase": "magnetviz's_concepts"}, {"score": 0.0026771333996253783, "phrase": "usage_scenario"}, {"score": 0.002317533977770783, "phrase": "generated_layout_quality"}, {"score": 0.002150481043278758, "phrase": "task_taxonomy_assessment"}], "paper_keywords": ["Graph visualization", " force-directed layout", " evaluation", " social networks visualization"], "paper_abstract": "MagnetViz was designed for the interactive manipulation of force-directed graph layouts, allowing the user to obtain visualizations based on the graph topology and/or the attributes of its nodes and edges. The user can introduce virtual magnets anywhere in the graph and these can be set to attract nodes and edges that fulfill user-defined criteria. When a magnet is placed, the force-directed nature of the layout forces it to reorganize itself in order to reflect the changes in the balance of forces, consequently changing the visualization into one that is more semantically relevant to the user. This paper describes MagnetViz's concepts, illustrating them with examples and a case study based on a usage scenario. We also describe how the MagnetViz has evolved since its original version and present the evaluation of its latest version. This evaluation consists of two user studies aiming at assessing generated layout quality and how well the concepts can be apprehended and employed, and a task taxonomy assessment focusing on establishing which graph visualization tasks the technique is able to handle.", "paper_title": "Design and Evaluation of MagnetViz-A Graph Visualization Tool", "paper_id": "WOS:000301234200014"}