{"auto_keywords": [{"score": 0.04270615778994474, "phrase": "experimental_programme"}, {"score": 0.00481495049065317, "phrase": "experimental_cscl-programme"}, {"score": 0.004613516457919661, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.004569916626344789, "phrase": "cscl"}, {"score": 0.0043786774510943625, "phrase": "active_participation"}, {"score": 0.004275904315753662, "phrase": "knowledge_sharing"}, {"score": 0.0038515000499988673, "phrase": "cscl_discussions"}, {"score": 0.0035356745476539885, "phrase": "control_programme"}, {"score": 0.0034037221513153566, "phrase": "special_attention"}, {"score": 0.003261133560558666, "phrase": "student's_participation"}, {"score": 0.0031096747349602344, "phrase": "nine_different_primary_school_classes"}, {"score": 0.0030078460113945136, "phrase": "main_effect"}, {"score": 0.0028274743316389437, "phrase": "expected_effects"}, {"score": 0.0027348611289528583, "phrase": "better_quality_participation"}, {"score": 0.0023936956017015696, "phrase": "minority_backgrounds"}], "paper_keywords": ["Cooperative/collaborative learning", " Interactive learning environments", " Elementary education", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "Computer-supported collaborative learning (CSCL) is aimed at enhancing and supporting the active participation of all students in knowledge sharing and knowledge co-construction. In this study, an experimental programme was designed to Support students in elaborating and justifying their positions in CSCL discussions. The effects of this experimental programme on the participation of students as compared to their counterparts in a control programme were determined. It was hypothesised that special attention to elaboration improves the degree and quality of student's participation. The subjects in the study were 190 students from nine different primary school classes. The results both show a main effect on the degree of participation of students in the experimental programme and the expected effects of the programme in terms of better quality participation. Although the programme aimed at enhancing the degree and quality of the participation of all students, participation appeared to depend on certain learner characteristics. Students from minority backgrounds benefited less than majority students from the programme in terms of degree of participation. Boys benefited less than girls from the programme in terms of the quality of their participation. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Effects on participation of an experimental CSCL-programme to support elaboration: Do all students benefit?", "paper_id": "WOS:000263701900012"}