{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quality_scores"}, {"score": 0.007571734101140312, "phrase": "probabilistic_alignments"}, {"score": 0.006813869819206732, "phrase": "probabilistic_alignment"}, {"score": 0.006252437731804319, "phrase": "aligned_columns"}, {"score": 0.004721602309430702, "phrase": "short-read_mapping"}, {"score": 0.004611959213131437, "phrase": "recent_studies"}, {"score": 0.0044002186469797476, "phrase": "next-generation_sequence"}, {"score": 0.004365889412369143, "phrase": "ngs"}, {"score": 0.0041328796505374155, "phrase": "marginal_probabilities"}, {"score": 0.0039122637074546895, "phrase": "conventional_maximum_score-based_alignment"}, {"score": 0.00351938145050947, "phrase": "bisulfite_mapping"}, {"score": 0.0034782306784111494, "phrase": "accurate_estimation"}, {"score": 0.003020279889535487, "phrase": "usual_score_matrix"}, {"score": 0.0029384777371425862, "phrase": "posterior_decoding_techniques"}, {"score": 0.002847691227421257, "phrase": "probabilistic_model"}, {"score": 0.002424506147893058, "phrase": "accurate_detection"}, {"score": 0.002215215130779999, "phrase": "stampy"}, {"score": 0.0021978926568784855, "phrase": "bwa"}, {"score": 0.0021807022596449527, "phrase": "novoalign"}, {"score": 0.0021049977753042253, "phrase": "favorable_precision"}], "paper_keywords": [""], "paper_abstract": "Motivation: Recent studies have revealed the importance of considering quality scores of reads generated by next-generation sequence (NGS) platforms in various downstream analyses. It is also known that probabilistic alignments based on marginal probabilities (e. g. aligned-column and/or gap probabilities) provide more accurate alignment than conventional maximum score-based alignment. There exists, however, no study about probabilistic alignment that considers quality scores explicitly, although the method is expected to be useful in SNP/indel callers and bisulfite mapping, because accurate estimation of aligned columns or gaps is important in those analyses. Results: In this study, we propose methods of probabilistic alignment that consider quality scores of (one of) the sequences as well as a usual score matrix. The method is based on posterior decoding techniques in which various marginal probabilities are computed from a probabilistic model of alignments with quality scores, and can arbitrarily trade-off sensitivity and positive predictive value (PPV) of prediction (aligned columns and gaps). The method is directly applicable to read mapping (alignment) toward accurate detection of SNPs and indels. Several computational experiments indicated that probabilistic alignments can estimate aligned columns and gaps accurately, compared with other mapping algorithms e.g. SHRiMP2, Stampy, BWA and Novoalign. The study also suggested that our approach yields favorable precision for SNP/indel calling.", "paper_title": "Probabilistic alignments with quality scores: an application to short-read mapping toward accurate SNP/indel detection", "paper_id": "WOS:000296637500002"}