{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "learner-controlled_instruction"}, {"score": 0.04892132379047204, "phrase": "effective_and_ineffective_learners"}, {"score": 0.03160214435857137, "phrase": "effective_learners"}, {"score": 0.004339108074589304, "phrase": "fixed_or_adaptive_system-controlled_instruction"}, {"score": 0.0035668128900149814, "phrase": "explorative_study"}, {"score": 0.003097865379563127, "phrase": "learner-controlled_instructional_environment"}, {"score": 0.002860546817196148, "phrase": "ineffective_learners"}, {"score": 0.002723607240517261, "phrase": "learning_tasks"}, {"score": 0.0025459275963373496, "phrase": "self-assessment_criteria"}, {"score": 0.0025148871904409095, "phrase": "subsequent_task_selection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Secondary education", " Teaching/learning strategies", " Interactive learning environments", " Multimedia/hypermedia systems"], "paper_abstract": "Learner-controlled instruction is often found to be less effective for learning than fixed or adaptive system-controlled instruction. One possible reason for that finding is that students - especially novices - might not able to accurately assess their own performance and select tasks that fit their learning needs. Therefore, this explorative study investigated the differences in self-assessment and task-selection processes between effective and ineffective learners (i.e., in terms of learning gains) studying in a learner-controlled instructional environment. Results indicated that although effective learners could more accurately assess their own performance than ineffective learners, they used the same task aspects to select learning tasks. For effective learners, who were also more accurate self-assessors, the self-assessment criteria predicted subsequent task selection. The results are discussed, particularly with regard to their potential to provide guidelines for the design of a self-assessment and task-selection training. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Self-assessment and task selection in learner-controlled instruction: Differences between effective and ineffective learners", "paper_id": "WOS:000276114300011"}