{"auto_keywords": [{"score": 0.03610310423475189, "phrase": "orthogonal_array"}, {"score": 0.00481495049065317, "phrase": "orthogonal_arrays"}, {"score": 0.004737579882204798, "phrase": "maximum-length_binary_shift-register_sequence"}, {"score": 0.00412796126884884, "phrase": "zero_vector"}, {"score": 0.004094639048362357, "phrase": "length_n._munemasa"}, {"score": 0.003640516896245813, "phrase": "trinomial_satisfying_certain_conditions"}, {"score": 0.003495855671790616, "phrase": "c_f"}, {"score": 0.0031845067058084583, "phrase": "munemasa's_result"}, {"score": 0.0024761702541879213, "phrase": "finite_list"}, {"score": 0.002148172508419683, "phrase": "hamming_weight_distribution"}, {"score": 0.0021049977753042253, "phrase": "shift-register_sequence"}], "paper_keywords": ["shift register sequences", " orthogonal arrays", " polymials over finite fields"], "paper_abstract": "Consider a maximum-length binary shift-register sequence generated by a primitive polynomial f of degree m. Let C-n(f) denote the set of all subintervals of this sequence with length n, where m < n <= 2m, together with the zero vector of length n. Munemasa ( Finite fields Appl, 4( 3): 252-260, 1998) considered the case in which the polynomial f generating the sequence is a trinomial satisfying certain conditions. He proved that, in this case, C f n corresponds to an orthogonal array of strength 2 that has a property very close to being an orthogonal array of strength 3. Munemasa's result was based on his proof that very few trinomials of degree at most 2m are divisible by the given trinomial f. In this paper, we consider the case in which the sequence is generated by a pentanomial f satisfying certain conditions. Our main result is that no trinomial of degree at most 2m is divisible by the given pentanomial f, provided that f is not in a finite list of exceptions we give. As a corollary, we get that, in this case, C-n(f) corresponds to an orthogonal array of strength 3. This effectively minimizes the skew of the Hamming weight distribution of subsequences in the shift-register sequence.", "paper_title": "Division of trinomials by pentanomials and orthogonal arrays", "paper_id": "WOS:000249299100001"}