{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "indirect_information"}, {"score": 0.049596205816074275, "phrase": "system_trust"}, {"score": 0.028939438487563716, "phrase": "trust-relevant_information"}, {"score": 0.004198965651975536, "phrase": "overall_valence"}, {"score": 0.004073113268289532, "phrase": "route_planner"}, {"score": 0.003971111060168551, "phrase": "consensus_cue"}, {"score": 0.0036245239349157236, "phrase": "positive_evaluation"}, {"score": 0.003462704420080129, "phrase": "negative_evaluation"}, {"score": 0.0033588449972778004, "phrase": "control_allocation"}, {"score": 0.0028697077879305064, "phrase": "outcome_feedback"}, {"score": 0.0026457367614424777, "phrase": "consensus_effect"}, {"score": 0.0025793874956029795, "phrase": "route_display"}, {"score": 0.00217017119491777, "phrase": "direct_information"}, {"score": 0.0021049977753042253, "phrase": "generated_solutions"}], "paper_keywords": ["system trust", " control allocation", " consensus", " evaluations", " information processing", " indirect information"], "paper_abstract": "In contrast with most other experimental system trust research, this paper examines indirect information as a basis for trust. In experiment 1, the overall valence of an evaluation concerning a route planner was pitted against a consensus cue, i.e. a favourable opinion about the system endorsed by a minority versus a majority. A positive evaluation caused an increase of system trust, whereas a negative evaluation led to a decrease. Control allocation, i.e. choosing manual or automatic mode, however, remained unaffected. Furthermore, no effect was found of consensus; one explanation holds that, despite the absence of outcome feedback, displaying of routes on-screen provided interfering trust-relevant information. Focusing solely on the consensus effect in the absence of route display, experiment 2 revealed consensus to affect both trust and control allocation. These experiments show that trust-relevant information can be processed heuristically and systematically. Possibly, trust can also be based on direct information despite absence of feedback whether generated solutions are good or bad.", "paper_title": "Effect of indirect information on system trust and control allocation", "paper_id": "WOS:000252959600001"}