{"auto_keywords": [{"score": 0.028253416689388026, "phrase": "condition_number"}, {"score": 0.00481495049065317, "phrase": "interpolation_sets"}, {"score": 0.004767261858417823, "phrase": "derivative_free_optimization"}, {"score": 0.004673290248999786, "phrase": "derivative_free_methods"}, {"score": 0.0045357787854931894, "phrase": "nonlinear_optimization_problems"}, {"score": 0.004424268136268051, "phrase": "objective_function"}, {"score": 0.003984968827278219, "phrase": "interpolating_polynomial"}, {"score": 0.00392586404888927, "phrase": "true_function"}, {"score": 0.0038102613924627647, "phrase": "convergence_theory"}, {"score": 0.0037724857647796813, "phrase": "derivative_free_sampling_methods"}, {"score": 0.0034660938095219846, "phrase": "main_task"}, {"score": 0.003347259612209552, "phrase": "interpolation_sampling"}, {"score": 0.0029698211157405618, "phrase": "lagrange_polynomials"}, {"score": 0.0029111767710750117, "phrase": "interpolation_set"}], "paper_keywords": ["multivariate polynomial interpolation", " error estimates", " poisedness", " derivative free optimization"], "paper_abstract": "We consider derivative free methods based on sampling approaches for nonlinear optimization problems where derivatives of the objective function are not available and cannot be directly approximated. We show how the bounds on the error between an interpolating polynomial and the true function can be used in the convergence theory of derivative free sampling methods. These bounds involve a constant that reflects the quality of the interpolation set. The main task of such a derivative free algorithm is to maintain an interpolation sampling set so that this constant remains small, and at least uniformly bounded. This constant is often described through the basis of Lagrange polynomials associated with the interpolation set. We provide an alternative, more intuitive, definition for this concept and show how this constant is related to the condition number of a certain matrix. This relation enables us to provide a range of algorithms whilst maintaining the interpolation set so that this condition number or the geometry constant remain uniformly bounded. We also derive bounds on the error between the model and the function and between their derivatives, directly in terms of this condition number and of this geometry constant.", "paper_title": "Geometry of interpolation sets in derivative free optimization", "paper_id": "WOS:000247429500007"}