{"auto_keywords": [{"score": 0.008656707982822634, "phrase": "international_classification"}, {"score": 0.00481495049065317, "phrase": "icnp_subset_children"}, {"score": 0.004506171772318298, "phrase": "unified_language"}, {"score": 0.004254558771304349, "phrase": "condition-specific_subsets"}, {"score": 0.004179991181159956, "phrase": "easier_and_consistent_use"}, {"score": 0.003999217176949845, "phrase": "developing_countries"}, {"score": 0.003826231150275071, "phrase": "world_health_priority"}, {"score": 0.0036445446531633368, "phrase": "intervention_terms"}, {"score": 0.003365598242636633, "phrase": "different_phases"}, {"score": 0.0027700855441353165, "phrase": "investigators'_process"}, {"score": 0.002615156460073562, "phrase": "nursing_practice_catalogue_development"}, {"score": 0.002479827946513971, "phrase": "nursing_practice_term"}, {"score": 0.002436289099444074, "phrase": "perfect_fit"}, {"score": 0.0024148064819862337, "phrase": "conceptual_fit"}, {"score": 0.002200337772403983, "phrase": "eighty-two_percent"}, {"score": 0.0021809311689473493, "phrase": "local_terms"}, {"score": 0.0021049977753042253, "phrase": "nursing_practice"}], "paper_keywords": ["International council of nursing", " ICNP", " Nursing in HIV/AIDS", " Standardized nursing languages"], "paper_abstract": "Since 1993, the International Classification of Nursing Practice has evolved as a unified language for global nursing diagnoses/outcomes and interventions. It contains 5148 terms. Population-or condition-specific subsets of terms facilitate easier and consistent use of the International Classification of Nursing Practice. One condition, care of children in developing countries with HIV/AIDS, is listed by the World Health Organization as a world health priority. In this study, the investigators identified nursing diagnoses/outcomes and intervention terms used by nurses for this population and mapped the terms to the International Classification of Nursing Practice. Terms represent healthcare at different phases along a continuum: health promotion, health maintenance, acute conditions, chronic conditions, and end-of-life care with the child as the focus surrounded by family, community, and culture. In the analysis, the investigators' process is compared with the one outlined in the Guidelines for International Classification of Nursing Practice Catalogue Development, and the match of each local and International Classification of Nursing Practice term is categorized as perfect fit, conceptual fit, partial fit, or unable to fit. A total of 53 nursing diagnosis/outcome terms and 85 intervention terms make up the subset. Eighty-two percent of local terms mapped at least partially to International Classification of Nursing Practice.", "paper_title": "Creating an ICNP Subset Children With HIV/AIDS in Developing Countries", "paper_id": "WOS:000303807400001"}