{"auto_keywords": [{"score": 0.042646835916719104, "phrase": "global_authentication"}, {"score": 0.04232056931124757, "phrase": "authorisation_infrastructure"}, {"score": 0.00481495049065317, "phrase": "academic_libraries"}, {"score": 0.004535124351828787, "phrase": "current_state"}, {"score": 0.004375061788023814, "phrase": "academic_library_users'_mobility"}, {"score": 0.004288581530198804, "phrase": "digital_information_resources"}, {"score": 0.003912189642066724, "phrase": "national_projects"}, {"score": 0.003850173884725567, "phrase": "public_institutions"}, {"score": 0.0035687137873965684, "phrase": "single_widely_accepted_authentication"}, {"score": 0.003334309053314909, "phrase": "single_username"}, {"score": 0.003255295296893174, "phrase": "local_and_remote_library_services"}, {"score": 0.003053598205821532, "phrase": "local_user_database"}, {"score": 0.002363995836370621, "phrase": "new_services"}, {"score": 0.002326464619238653, "phrase": "user_frustration"}, {"score": 0.0023079225317714815, "phrase": "forgotten_passwords"}, {"score": 0.0022531762659857507, "phrase": "administrative_tasks"}, {"score": 0.0021909411820497707, "phrase": "password_management"}, {"score": 0.0021647968783414504, "phrase": "security_improvements"}, {"score": 0.0021049977753042253, "phrase": "identified_need"}], "paper_keywords": ["mobile communication systems", " academic libraries", " research libraries", " electronic media"], "paper_abstract": "Purpose - To give an overview of the current state and trends in authentication and authorisation in satisfying academic library users' mobility and instant access to digital information resources, and to propose that libraries strongly support efforts to establish a global authentication and authorisation infrastructure. Design/methodology/approach - An overview of some national projects towards such an infrastructure for public institutions, including libraries, is provided. Findings - There are many projects working towards such an infrastructure, but no single widely accepted authentication and authorisation infrastructure exists yet. A global authentication and authorisation infrastructure will enable users to use a single username and a password for all local and remote library services. It will consist of interconnected authentication/authorisation servers, where each institution will be responsible for a local user database. Research limitations/implications - The list of projects towards global authentication and authorisation infrastructure is not complete. Projects are not described in detail. Practical implications - Libraries will have to join efforts towards a global authentication and authorisation infrastructure and to integrate this into their applications. That way, they will improve services for their users who are remote from their home institutions, enable users to access new services faster, lessen user frustration with forgotten passwords, reduce time spent on administrative tasks and also reduce the burden of password management and enable security improvements. Originality/value - This paper fulfils an identified need to speed up the development of a global authentication and authorisation infrastructure.", "paper_title": "Authentication and authorisation infrastructure for the mobility of users of academic libraries - An overview of developments", "paper_id": "WOS:000236038000006"}