{"auto_keywords": [{"score": 0.014523887564457614, "phrase": "protein-protein_interactions"}, {"score": 0.004815607935434171, "phrase": "bayesian"}, {"score": 0.004688321299229397, "phrase": "protein_and_network_topology_information"}, {"score": 0.004626255242038005, "phrase": "predicting_protein-protein_interactions"}, {"score": 0.004242291530697285, "phrase": "high-throughput_technologies"}, {"score": 0.004075946554498088, "phrase": "new_laboratory_experiments"}, {"score": 0.0032489004068215407, "phrase": "topological_properties"}, {"score": 0.0030391594477173485, "phrase": "computational_methods"}, {"score": 0.0029394074636168435, "phrase": "unknown_protein-protein_interactions"}, {"score": 0.002824005136794786, "phrase": "supervised_learning_framework"}, {"score": 0.0027680095380207756, "phrase": "bayesian_inference"}, {"score": 0.0021620042653528846, "phrase": "information_one"}, {"score": 0.0021049977753042253, "phrase": "better_accuracy"}], "paper_keywords": ["Bayesian methods", " protein-protein interaction", " network analysis", " topology"], "paper_abstract": "Computational methods for predicting protein-protein interactions are important tools that can complement high-throughput technologies and guide biologists in designing new laboratory experiments. The proteins and the interactions between them can be described by a network which is characterized by several topological properties. Information about proteins and interactions between them, in combination with knowledge about topological properties of the network, can be used for developing computational methods that can accurately predict unknown protein-protein interactions. This paper presents a supervised learning framework based on Bayesian inference for combining two types of information: i) network topology information, and ii) information related to proteins and the interactions between them. The motivation of our model is that by combining these two types of information one can achieve a better accuracy in predicting protein-protein interactions, than by using models constructed from these two types of information independently.", "paper_title": "A Bayesian Framework for Combining Protein and Network Topology Information for Predicting Protein-Protein Interactions", "paper_id": "WOS:000356608100006"}