{"auto_keywords": [{"score": 0.03597927187198435, "phrase": "binding_modes"}, {"score": 0.004814963720517265, "phrase": "bis"}, {"score": 0.004505881071218599, "phrase": "mm-pbsa"}, {"score": 0.0036479584876742085, "phrase": "combined_docking"}, {"score": 0.00360417515510547, "phrase": "molecular_dynamics"}, {"score": 0.0035609154384221567, "phrase": "poisson-boltzmann_surface_area_analysis"}, {"score": 0.002830617996609902, "phrase": "corresponding_measured_specificities"}, {"score": 0.0027298319171606498, "phrase": "useful_insight"}, {"score": 0.0026970382454914437, "phrase": "possible_existence"}, {"score": 0.0026646374739979694, "phrase": "multiple_conformations"}, {"score": 0.0022361964497681934, "phrase": "new_insights"}, {"score": 0.002143529653780496, "phrase": "future_rational_design"}], "paper_keywords": ["BIS like inhibitors", " Docking", " Glycogen synthase kinase-3 beta (GSK-3 beta)", " MM-PBSA", " Protein-drug binding"], "paper_abstract": "Binding of several bisindolylmaleimide (BIS) like (BIS-3, BIS-8 and UCN1) and other ligands (H89, SB203580 and Y27632) with the glycogen synthase kinase-3 (GSK-3 beta) has been studied using combined docking, molecular dynamics and Poisson-Boltzmann surface area analysis approaches. The study generated novel binding modes of these ligands that can rationalize why some ligands inhibit GSK-3 beta while others do not. The relative binding free energies associated with these binding modes are in agreement with the corresponding measured specificities. This study further provides useful insight regarding possible existence of multiple conformations of some ligands like H89 and BIS-8. It is also found that binding modes of BIS-3, BIS-8 and UCN1 with GSK-3 beta and PDK1 kinases are similar. These new insights are expected to be useful for future rational design of novel, more potent GSK-3 beta-specific inhibitors as promising therapeutics.", "paper_title": "Binding of BIS like and other ligands with the GSK-3 beta kinase: a combined docking and MM-PBSA study", "paper_id": "WOS:000299769700022"}