{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dempster's_rule"}, {"score": 0.007537503864368371, "phrase": "interval-valued_belief_structures"}, {"score": 0.005056686673944276, "phrase": "consistency_measure"}, {"score": 0.0038079353103469865, "phrase": "ibss'_pairwise_relationships"}, {"score": 0.0036488111139918135, "phrase": "important_impact"}, {"score": 0.003314591878914152, "phrase": "beliefs'_pairwise_relationships"}, {"score": 0.0029789104204803137, "phrase": "consistency_interval"}, {"score": 0.0028089634624677957, "phrase": "optimization_problems"}, {"score": 0.0026205405415623525, "phrase": "six_categories"}, {"score": 0.002196944917134202, "phrase": "multiple_ibss"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dempster-Shafer theory", " Consistency measure", " Consistency interval", " Relationships of interval-valued belief structures", " Applicability of Dempster's rule"], "paper_abstract": "To combine interval-valued belief structures (IBSs), it is necessary to investigate the applicability of Dempster's rule to know whether Dempster's rule is adequate to be used and whether other alternatives are needed. This makes it significant to investigate IBSs' pairwise relationships (IPRs) since they have an important impact on the applicability of Dempster's rule to the combination of two IBSs. IPRs can be constructed based on beliefs' pairwise relationships (BPRs), so this paper proposes a consistency measure to quantitatively divide BPRs into three categories. Using a consistency interval between two IBSs that is obtained by solving a pair of optimization problems constructed based on the consistency measure. IPRs are quantified and divided into six categories on the basis of BPRs. According to IPRs, the applicability of Dempster's rule to the combination of two IBSs is recommended. Finally, the applicability of Dempster's rule to the combination of multiple IBSs is investigated. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Analyzing the applicability of Dempster's rule to the combination of interval-valued belief structures", "paper_id": "WOS:000286904600150"}