{"auto_keywords": [{"score": 0.048439279083046086, "phrase": "artificial_agent"}, {"score": 0.00481495049065317, "phrase": "social_exclusion"}, {"score": 0.004604023526673226, "phrase": "earlier_research"}, {"score": 0.0045357787854931894, "phrase": "artificial_social_agents"}, {"score": 0.0044685410845412745, "phrase": "human_behavior"}, {"score": 0.003643185395780667, "phrase": "socially_excluded_people"}, {"score": 0.003029643234751066, "phrase": "energy-saving_task"}, {"score": 0.002984665318717504, "phrase": "social_feedback"}, {"score": 0.0026217213613095322, "phrase": "expected_effects"}, {"score": 0.002595698433525986, "phrase": "behavior_change"}, {"score": 0.0024941578231560055, "phrase": "person's_psychological_state"}, {"score": 0.0024327171018928458, "phrase": "human-agent_interactions"}, {"score": 0.002349228457383314, "phrase": "earlier_findings"}, {"score": 0.0023259039577313294, "phrase": "female_participants"}, {"score": 0.0022573076362326135, "phrase": "agent's_feedback"}, {"score": 0.002234893735225432, "phrase": "male_participants"}, {"score": 0.0021798257311714665, "phrase": "user's_gender"}, {"score": 0.0021049977753042253, "phrase": "persuasive_technology"}], "paper_keywords": [""], "paper_abstract": "Earlier research showed that artificial social agents can influence human behavior. This article argues that, especially under certain circumstances, people are sensitive to persuasion by (artificial) social agents. For example, when people feel socially excluded, they are motivated to increase their social connections with others. It was hypothesized that socially excluded people would attribute more human-likeness and be persuaded more by an artificial agent than socially included people. These hypotheses were investigated in two studies in which participants were either socially included or excluded, after which they performed an energy-saving task while receiving social feedback from an artificial agent. Results did not support the expectation that socially excluded people ascribe more human-likeness to an artificial agent, but they did show the expected effects on behavior change, indicating the importance of including a person's psychological state in the design of human-agent interactions. Also, in line with earlier findings, female participants were more susceptible to the agent's feedback than male participants, indicating that a user's gender may also determine the effectiveness of persuasive technology.", "paper_title": "Lonely and Susceptible: The Influence of Social Exclusion and Gender on Persuasion by an Artificial Agent", "paper_id": "WOS:000366280200009"}