{"auto_keywords": [{"score": 0.01246759775773337, "phrase": "lower_bounds"}, {"score": 0.00481495049065317, "phrase": "graph_representations"}, {"score": 0.004642105253191792, "phrase": "labeling_schemes"}, {"score": 0.004475436844227947, "phrase": "quite_a_few_papers"}, {"score": 0.004434709065369378, "phrase": "network_properties"}, {"score": 0.0044104497301196794, "phrase": "informative_labels"}, {"score": 0.0043305354943056875, "phrase": "graph_function"}, {"score": 0.004221072004655573, "phrase": "distance_function"}, {"score": 0.00418264929442896, "phrase": "f-labeling_scheme"}, {"score": 0.003720537551712015, "phrase": "highly_sophisticated_labeling_schemes"}, {"score": 0.0036866541358511005, "phrase": "short_labels"}, {"score": 0.003573733722229979, "phrase": "vertices_consulted"}, {"score": 0.003476963781647026, "phrase": "large_margins"}, {"score": 0.0034264254358037653, "phrase": "strong_technical_skills"}, {"score": 0.0033828052918594416, "phrase": "traditional_labeling_schemes"}, {"score": 0.003115307756631991, "phrase": "third_vertex_w"}, {"score": 0.002863652837038965, "phrase": "main_importance"}, {"score": 0.002786056780499915, "phrase": "first_step"}, {"score": 0.002770791022032813, "phrase": "different_tradeoffs"}, {"score": 0.0026035011274172753, "phrase": "corresponding_sequential_problem"}, {"score": 0.0025236731245248654, "phrase": "even_just_the_label"}, {"score": 0.0024151140702162632, "phrase": "intermediate_notions"}, {"score": 0.002388710195695894, "phrase": "distributed_settings"}, {"score": 0.002362594304875161, "phrase": "theoretical_interest"}, {"score": 0.0022943361819638027, "phrase": "traditional_model"}, {"score": 0.002277581330767082, "phrase": "sequential_model"}, {"score": 0.0022158306933307685, "phrase": "query_labeling_schemes"}, {"score": 0.002203682494159341, "phrase": "distributed_environment"}, {"score": 0.002175594509651082, "phrase": "potential_usage"}, {"score": 0.0021636664253250814, "phrase": "new_paradigms"}, {"score": 0.002124375450293635, "phrase": "overlay_networks"}], "paper_keywords": ["Distributed algorithms", " Informative labeling schemes", " Compact routing schemes", " Dynamic networks"], "paper_abstract": "This paper is intended more to ask questions than give answers. Specifically, we consider models for labeling schemes, and discuss issues regarding the number of labels consulted vs. the sizes of the labels. Recently, quite a few papers studied methods for representing network properties by assigning informative labels to the vertices of a network. Consider a graph function f on pairs of vertices (for example,f can be the distance function). In an f-labeling scheme, the labels are constructed in Such a way so that given the labels of any two vertices it and v, one can compute the function f (u, v) (e.g. the graph distance between u and v) just by looking at these two labels. Some very involved lower bounds for the sizes of the labels were proven. Also, some highly sophisticated labeling schemes were developed to ensure short labels. In this paper, we demonstrate that such lower bounds are very sensitive to the number of vertices Consulted. That is, we show several constructions of such labeling schemes that beat the lower bounds by large margins. Moreover, as opposed to the strong technical skills that were needed to develop the traditional labeling schemes, most of our schemes are almost trivial. The catch is that in our model, one needs to Consult the labels of three vertices instead of two. That is, a query about vertices u and v can access also the label of some third vertex w (w is determined by the labels of u and v). More generally, we address the model in Which a query about vertices u and v can access also the labels of c other vertices. We term our generalized model labeling schemes with queries. The main importance of this model is theoretical. Specifically, this paper may serve as a First step towards investigating different tradeoffs between the amount of labels consulted and the amount of information stored at each vertex. As we show, if all vertices can be consulted then the problem almost reduces to the corresponding sequential problem. Oil the other hand, consulting just the labels of u and v (or even just the label of u) reduces the problem to a purely distributed one. Therefore, in a sense, our model spans a range of intermediate notions between the sequential and the distributed settings. In addition to the theoretical interest, we also show cases that schemes constructed for our model can be translated to the traditional model or to the sequential model, thus, simplifying the construction for those models as well. For implementing query labeling schemes in a distributed environment directly, we point at a potential usage for some new paradigms that became common recently, Such as P2P and overlay networks. (C) 2008 Elsevier B.V, All rights reserved.", "paper_title": "A note on models for graph representations", "paper_id": "WOS:000264537200011"}