{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_mapping"}, {"score": 0.0047839735747931605, "phrase": "information_systems_investment_evaluation"}, {"score": 0.004137119737646718, "phrase": "challenging_and_complex_process"}, {"score": 0.0040186038781533946, "phrase": "increased_complexity"}, {"score": 0.003853359519337239, "phrase": "numerous_interrelated_factors"}, {"score": 0.003742941972172613, "phrase": "human_or_organisational_dimensions"}, {"score": 0.0036006068766833103, "phrase": "increasing_need"}, {"score": 0.0035658739518719907, "phrase": "investment_decision-making_processes"}, {"score": 0.0034974064973871833, "phrase": "often_far-reaching_implications"}, {"score": 0.003430249143748777, "phrase": "interrelated_knowledge_components"}, {"score": 0.003310447652300423, "phrase": "key_learning_issues"}, {"score": 0.003257379945810655, "phrase": "empirical_findings"}, {"score": 0.0030732613046470314, "phrase": "costly_oversights"}, {"score": 0.002937262271695137, "phrase": "often_obscure_evaluation"}, {"score": 0.0027444334639134217, "phrase": "fuzzy_expert_system"}, {"score": 0.002709161672473817, "phrase": "based_knowledge_mapping_technique"}, {"score": 0.002555950807368337, "phrase": "investment_evaluation"}, {"score": 0.0025230952890994236, "phrase": "knowledge_map"}, {"score": 0.0023958326775913165, "phrase": "explicit_and_tacit_investment_drivers"}, {"score": 0.002365048478879145, "phrase": "fcm"}, {"score": 0.0022897425998475362, "phrase": "causal_relationships"}, {"score": 0.0022676260293002706, "phrase": "knowledge_area"}, {"score": 0.0022457226013538343, "phrase": "principal_relationships"}, {"score": 0.0021462652605453163, "phrase": "managerial_and_user_perspectives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge management", " Knowledge mapping", " Knowledge components", " Supply chain management", " IS investment evaluation", " Expert Systems"], "paper_abstract": "Information systems (IS) facilitate organisations to increase responsiveness and reduce the costs of their supply chain. This paper seeks to make a contribution through exploring and visualising knowledge mapping from the perspective of IS investment evaluation. The evaluation of IS is regarded as a challenging and complex process, which becomes even more difficult with the increased complexity of IS. The intricacy of IS evaluation, however, is due to numerous interrelated factors (e.g. costs, benefits and risks) that have human or organisational dimensions. With this in mind, there appears to be an increasing need to assess investment decision-making processes, to better understand the often far-reaching implications associated with technology adoption and interrelated knowledge components (KC). Through the identification and extrapolation of key learning issues from the literature and empirical findings, organisations can better improve their business processes and thereby their effectiveness and efficiency, while preventing others from making costly oversights that may not necessarily be only financial. In seeking to enlighten the often obscure evaluation of IS investments, this paper attempts to inductively emphasise the dissemination of knowledge and learning through the application of a fuzzy Expert System (ES) based knowledge mapping technique (i.e. Fuzzy Cognitive Map [FCM]). The rationale for exploring knowledge and IS investment evaluation is that a knowledge map will materialise for others to exploit during their specific technology evaluation. This is realised through conceptualising the explicit and tacit investment drivers. Among the several findings drawn from this research, the key resulting knowledge mapping through FCM demonstrated the complex, multifaceted and emergent behaviour of causal relationships within the knowledge area. The principal relationships and knowledge within IS investment evaluation are illustrated as being determined by a blend of managerial and user perspectives. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Visualising a knowledge mapping of information systems investment evaluation", "paper_id": "WOS:000326214800011"}