{"auto_keywords": [{"score": 0.04981327237913682, "phrase": "semantic_data"}, {"score": 0.04902546742954505, "phrase": "data_services"}, {"score": 0.04290558574432031, "phrase": "semantic_annotations"}, {"score": 0.00481495049065317, "phrase": "collaborative_development"}, {"score": 0.004368185635518971, "phrase": "data_providing_services"}, {"score": 0.004007083686875716, "phrase": "deployed_data_services"}, {"score": 0.0038646496286607497, "phrase": "dps_development_process"}, {"score": 0.003800622925737337, "phrase": "dps's_dimensions"}, {"score": 0.0034572649187813655, "phrase": "holistic_and_collaborative_process_-_odep-dps"}, {"score": 0.002966084234963723, "phrase": "ontological_model"}, {"score": 0.002844646030750337, "phrase": "requirements_domain"}, {"score": 0.0027741761880779535, "phrase": "syntactic_data_model"}, {"score": 0.002728166176898541, "phrase": "domain_ontology"}, {"score": 0.00269791640653324, "phrase": "deployed_dpss"}, {"score": 0.0026384167183586015, "phrase": "odep-dps_development_process"}, {"score": 0.0025233151233862734, "phrase": "message_descriptor"}, {"score": 0.002453934333239467, "phrase": "single_reusable_unit"}, {"score": 0.002433493596574017, "phrase": "comprehensive_definition"}, {"score": 0.0024132654682844745, "phrase": "dps"}, {"score": 0.002346861891137455, "phrase": "real-life_case_study"}, {"score": 0.002327310963701377, "phrase": "mental_health_institution"}, {"score": 0.0022759659334501826, "phrase": "holistic_and_collaborative_development_process"}, {"score": 0.0022507188208913394, "phrase": "end-to-end_solution"}], "paper_keywords": ["Service oriented architecture", " Semantic data providing services", " Ontologies", " Ontology-driven development", " Semantic Web", " Semantic Web service development"], "paper_abstract": "Context: Data services are services that handle operations involving the management of data. A problem with data services is that their interfaces are defined by their syntax alone. Consequently, Data Providing Services (DPSs) have been proposed to explicitly define semantics using ontologies for services that only retrieve data. However, the semantic annotations of DPSs are developed as afterthoughts to deployed data services. Objective: The objective of this work is to present a DPS development process that considers all of a DPS's dimensions including its data acquisition logic, syntax and semantics thus addressing the issue of semantic annotations developed as afterthoughts. This shall decrease the cost of deploying and maintaining DPSs. Method: This paper contributes a holistic and collaborative process - ODEP-DPS - for the development of DPSs. It is holistic as it considers both semantics and syntax from requirements to implementation. And it is collaborative as it separates responsibilities between the roles of those who require the data and those who own them. The process is to be ontology-driven as an ontological model shall be utilized through each phase of the process; it shall formalize the requirements domain, be used as a basis for the syntactic data model, and serve as the domain ontology for annotating the deployed DPSs. Results: This paper proposes the ODEP-DPS development process, in addition to defining three artefacts used throughout the process. In particular, a message descriptor is defined that binds semantics and syntax into a single reusable unit. A comprehensive definition of a DPS is also provided. ODEP-DPS is evaluated using a real-life case study from a mental health institution. Conclusion: This study contributes a holistic and collaborative development process that provides an end-to-end solution for the development of semantic data providing services. It addresses semantics being developed as afterthoughts by tightly coupling semantics and syntax. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "ODEP-DPS: Ontology-driven engineering process for the collaborative development of semantic data providing services", "paper_id": "WOS:000321168700003"}