{"auto_keywords": [{"score": 0.028036624933288918, "phrase": "care_plan_information"}, {"score": 0.00481495049065317, "phrase": "healthcare_systems"}, {"score": 0.004722038375317162, "phrase": "meaningful_use"}, {"score": 0.004685375117376838, "phrase": "electronic_health_records"}, {"score": 0.004367898947304223, "phrase": "patients_transition"}, {"score": 0.004152018764100109, "phrase": "current_state"}, {"score": 0.0037957839728524046, "phrase": "emergency_departments"}, {"score": 0.0037662852047763112, "phrase": "acute_care_hospitals"}, {"score": 0.00373701482510911, "phrase": "skilled_nursing_facilities"}, {"score": 0.003693533648584145, "phrase": "home_health_agency_settings"}, {"score": 0.0036081302581727416, "phrase": "usa."}, {"score": 0.0034700069041302003, "phrase": "healthcare_research"}, {"score": 0.0032220148724914867, "phrase": "current_practice"}, {"score": 0.0031474338010045386, "phrase": "lcp._results_participants"}, {"score": 0.0027134630181926854, "phrase": "wide_variation"}, {"score": 0.0023391880766516285, "phrase": "data_reuse"}, {"score": 0.00228499525153, "phrase": "widespread_adoption"}, {"score": 0.002188874450946842, "phrase": "care_transitions"}, {"score": 0.002105012509327858, "phrase": "lcp"}], "paper_keywords": [""], "paper_abstract": "Objective As healthcare systems and providers move toward meaningful use of electronic health records, longitudinal care plans (LCPs) may provide a means to improve communication and coordination as patients transition across settings. The objective of this study was to determine the current state of communication of LCPs across settings and levels of care. Materials and methods We conducted surveys and interviews with professionals from emergency departments, acute care hospitals, skilled nursing facilities, and home health agency settings in six regions in the USA. We coded the transcripts according to the Agency for Healthcare Research and Quality (AHRQ) 'Broad Approaches' to care coordination to understand the degree to which current practice meets the definition of an LCP. Results Participants (n= 22) from all settings reported that LCPs do not exist in their current state. We found LCPs in practice, and none of these were shared or reconciled across settings. Moreover, we found wide variation in the types and formats of care plan information that was communicated as patients transitioned. The most common formats, even when care plan information was communicated within the same healthcare system, were paper and fax. Discussion These findings have implications for data reuse, interoperability, and achieving widespread adoption of LCPs. Conclusions The use of LCPs to support care transitions is suboptimal. Strategies are needed to transform the LCP from vision to reality.", "paper_title": "A patient-centered longitudinal care plan: vision versus reality", "paper_id": "WOS:000343776700021"}