{"auto_keywords": [{"score": 0.028876559292533903, "phrase": "compromise_solutions"}, {"score": 0.00481495049065317, "phrase": "cost_and_time_criteria"}, {"score": 0.004760017604908536, "phrase": "multi-objective_evolutionary_algorithm"}, {"score": 0.004616560363089716, "phrase": "familiar_criteria"}, {"score": 0.004563880494020726, "phrase": "logistic_provider"}, {"score": 0.0041001740903338834, "phrase": "logistic_networks"}, {"score": 0.003991774582021095, "phrase": "three-level_logistic_networks"}, {"score": 0.003769006950727621, "phrase": "available_consumers"}, {"score": 0.003669330508576073, "phrase": "potential_direct_shipments"}, {"score": 0.003531474887552889, "phrase": "dcs_facilities"}, {"score": 0.0034911335714333507, "phrase": "limited_capacity"}, {"score": 0.0032710562699144814, "phrase": "response_time"}, {"score": 0.0030648097361278856, "phrase": "multiple_criteria_decision_making_problems"}, {"score": 0.0026596472456182707, "phrase": "optimal_configurations"}, {"score": 0.0025892330566358503, "phrase": "prior_knowledge"}, {"score": 0.002444544487772349, "phrase": "flexibility_option"}, {"score": 0.00241658945942583, "phrase": "capacitated_facilities"}, {"score": 0.0023525950486853937, "phrase": "pareto-based_multi-objective_evolutionary_algorithm"}, {"score": 0.0023346279654393055, "phrase": "nsga"}, {"score": 0.0022296340517805125, "phrase": "illustrative_case_study"}, {"score": 0.0021049977753042253, "phrase": "optimal_solutions"}], "paper_keywords": ["Flexible logistic network model", " Multi-objective optimization", " Pareto solutions", " Multi-objective evolutionary algorithms"], "paper_abstract": "Nowadays, time and cost are familiar criteria for every logistic provider, and both have been long treated to be minimized simultaneously. However, the criteria are naturally conflicted even with flexibilities and/or constraints appeared in the logistic networks. This paper is concerned with three-level logistic networks with potential suppliers, distributed centers (DCs), and deterministic demands from available consumers. The networks also benefit from potential direct shipments from suppliers to consumers as long as suppliers and DCs facilities might face limited capacity in their own seasonal supplying and warehousing processes. The goal is (re)configure the networks in order to minimize response time to consumers, transportation cost and facility cost. Therefore, the networks are formulated as multiple criteria decision making problems, which have more than one configuration through the time and cost optimizing at the same time. Due to the flexibility and the constraints, the decision maker(s) needs a set of compromise solutions for the networks that represent optimal configurations based on the objectives without considering prior knowledge. To this end, the problems are formulated into four individual logistic network models varying with the flexibility option and/or the capacitated facilities. To find the compromise solutions, Pareto-based multi-objective evolutionary algorithm, NSGA-II is customized and then utilized to deal with an illustrative case study. The results are analyzed through the two performance measures, hypervolume and the number of optimal solutions obtained so far.", "paper_title": "A flexible three-level logistic network design considering cost and time criteria with a multi-objective evolutionary algorithm", "paper_id": "WOS:000316689000006"}