{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "latest_version"}, {"score": 0.010057366722406995, "phrase": "control_condition"}, {"score": 0.008762045705207017, "phrase": "chronological_sorting"}, {"score": 0.004171259063201874, "phrase": "date_version"}, {"score": 0.00393066798511457, "phrase": "old'ngray"}, {"score": 0.0037593414153801394, "phrase": "older_versions"}, {"score": 0.003507504253087326, "phrase": "perceptual_rather_than_cognitive_processes"}, {"score": 0.003192406091820197, "phrase": "failure_percentage"}, {"score": 0.0026973310437053573, "phrase": "folder_size"}, {"score": 0.002579622880371082, "phrase": "control_condition_retrievals"}, {"score": 0.002504011301105577, "phrase": "high_failure_percentage"}, {"score": 0.002394719113232821, "phrase": "additional_retrieval_time"}], "paper_keywords": ["document management", " version control", " interface design prototyping", " retrieval efficiency"], "paper_abstract": "The recent version problemrelates to finding the latest version of a file to avoid reconciliation and rework resulting from editing an out of date version. To identify the most recent version, we developed a prototype, Old'nGray, which automatically grays out the icon of older versions of the file to help users ignore them and spot the latest version using perceptual rather than cognitive processes. We tested our prototype using a within-subjects design (n=60). Use of Old'nGray drastically reduced failure percentage from an average of 24% in the control condition to 4%, and retrieval time from an average of 17.68 s in the control condition to 6.56 with Old'nGray. The benefits of Old'nGray increased with folder size. Chronological sorting was used in only half of the control condition retrievals, which may explain the high failure percentage. The use of chronological sorting also resulted in additional retrieval time compared with the use of Old'nGray. When asked, 70% of the participants indicated that they would like the prototype to be integrated into their next operating system.", "paper_title": "Spotting the Latest Version of a File with Old'nGray", "paper_id": "WOS:000364776900005"}