{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_networks"}, {"score": 0.04418308684293632, "phrase": "community_detection"}, {"score": 0.03805686587453266, "phrase": "semantic_information"}, {"score": 0.03513172920891575, "phrase": "clustered_graphs"}, {"score": 0.004604214511792668, "phrase": "social_networking"}, {"score": 0.004556901872357751, "phrase": "information_sharing"}, {"score": 0.004357410458790669, "phrase": "recent_years"}, {"score": 0.004138010495069077, "phrase": "first_case"}, {"score": 0.004067349981835669, "phrase": "classic_algorithms"}, {"score": 0.003555902292752528, "phrase": "clustering_process"}, {"score": 0.0034000828197314264, "phrase": "second_case"}, {"score": 0.003353521531649663, "phrase": "layout_algorithms"}, {"score": 0.0029722900280316216, "phrase": "different_communities"}, {"score": 0.002881450787481037, "phrase": "social_network_researcher"}, {"score": 0.002851790448644913, "phrase": "key_actors"}, {"score": 0.002707993764473537, "phrase": "novel_model"}, {"score": 0.0026525207297080937, "phrase": "conjoint_way"}, {"score": 0.0025981810951165836, "phrase": "social_network"}, {"score": 0.0025014259919355453, "phrase": "related_groups"}, {"score": 0.0021789194955896124, "phrase": "visualization_tool"}, {"score": 0.0021195791482462004, "phrase": "deep_studies"}, {"score": 0.0021049977753042253, "phrase": "augmented_social_networks"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Performance", " Social networks", " community detection", " clustered graphs layout", " social network analysis", " knowledge extraction", " graph clustering", " unsupervised learning"], "paper_abstract": "Due to the explosion of social networking and the information sharing among their users, the interest in analyzing social networks has increased over the recent years. Two general interests in this kind of studies are community detection and visualization. In the first case, most of the classic algorithms for community detection use only the structural information to identify groups, that is, how clusters are formed according to the topology of the relationships. However, these methods do not take into account any semantic information which could guide the clustering process, and which may add elements to conduct further analyses. In the second case most of the layout algorithms for clustered graphs have been designed to differentiate the groups within the graph, but they are not designed to analyze the interactions between such groups. Identifying these interactions gives an insight into the way different communities exchange messages or information, and allows the social network researcher to identify key actors, roles, and paths from one community to another. This article presents a novel model to use, in a conjoint way, the semantic information from the social network and its structural information to, first, find structurally and semantically related groups of nodes, and second, a layout algorithm for clustered graphs which divides the nodes into two types, one for nodes with edges connecting other communities and another with nodes connecting nodes only within their own community. With this division the visualization tool focuses on the connections between groups facilitating deep studies of augmented social networks.", "paper_title": "Community Detection and Visualization in Social Networks: Integrating Structural and Semantic Information", "paper_id": "WOS:000329159900011"}