{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mediated_search"}, {"score": 0.004743594110762319, "phrase": "holocaust_memorial_museum_data"}, {"score": 0.004673290248999786, "phrase": "holocaust_memorial_museum"}, {"score": 0.004294052530714228, "phrase": "human_atrocities"}, {"score": 0.004209369306023422, "phrase": "nazi_reign"}, {"score": 0.004065156038847781, "phrase": "related_data"}, {"score": 0.0032004205378150354, "phrase": "unstructured_electronic_documents"}, {"score": 0.003152915289414825, "phrase": "semi-structured_indexes"}, {"score": 0.0030600032877646263, "phrase": "collected_data"}, {"score": 0.00286795254228461, "phrase": "single_search_mechanism"}, {"score": 0.0028394925080958205, "phrase": "even_department"}, {"score": 0.0028113140998735366, "phrase": "human_experts"}, {"score": 0.0023846534541336326, "phrase": "common_search_engines"}, {"score": 0.0023143284925318916, "phrase": "natural_language"}, {"score": 0.0022913497040895586, "phrase": "holocaust_researchers"}, {"score": 0.0021049977753042253, "phrase": "ushmm"}], "paper_keywords": [""], "paper_abstract": "The United States Holocaust Memorial Museum (USHMM) recently celebrated its ten-year anniversary. The museum was established to bear witness to the human atrocities committed by the Nazi reign of terror. As such, related data must be collected, and means to store, search, and analyze the data must be provided. Presently, the data available reside in various formats, sizes, and structures, in videotape and films, in microfilms and microfiche, in various incompatible structured databases, as unstructured electronic documents, and semi-structured indexes scattered throughout the organizations. Collected data are partitioned over more than a dozen languages, further complicating their processing. There is currently no single search mechanism or even department of human experts that can sift through all the data in a fashion that provides global, uniform access. We are currently experimenting with our developed Intranet Mediator technology to provide answers, rather than a potential list of sources as provided by common search engines, to questions posed in natural language by Holocaust researchers. A description of a prototype that uses a subset of the data available within the USHMM is described.", "paper_title": "On mediated search of the United States Holocaust Memorial Museum data", "paper_id": "WOS:000239450400004"}