{"auto_keywords": [{"score": 0.03253253627295768, "phrase": "bargaining_problem"}, {"score": 0.015719716506582538, "phrase": "cooperative_resource_sharing"}, {"score": 0.009792510886120345, "phrase": "two-step_procedure"}, {"score": 0.004721162131188487, "phrase": "proactive_dynamic_spectrum_access"}, {"score": 0.004674952036988355, "phrase": "nash_bargaining_solution"}, {"score": 0.004363846362238565, "phrase": "licensed_primary_user"}, {"score": 0.004321177832955602, "phrase": "pu"}, {"score": 0.004257806363128601, "phrase": "cognitive_radio_networks"}, {"score": 0.003531474887552889, "phrase": "shared_radio_resource"}, {"score": 0.003168859801438632, "phrase": "nash_bargaining_problem"}, {"score": 0.0026933542552712033, "phrase": "original_nonconvex_bargaining_problem"}, {"score": 0.002551231163230566, "phrase": "guaranteed_convergence"}, {"score": 0.0024405312482831646, "phrase": "numerical_results"}, {"score": 0.0023117182131967523, "phrase": "significantly_reduced_computational_complexity"}, {"score": 0.002233301265743633, "phrase": "sharing_and_pricing_scheme"}, {"score": 0.0021049977753042253, "phrase": "cooperative_bargaining"}], "paper_keywords": ["Dynamic spectrum access networks", " cooperative resource sharing", " pricing", " Nash bargaining solutions"], "paper_abstract": "In this paper, we investigate the cooperative resource sharing and pricing for the licensed Primary User (PU) and Cognitive Radio Networks (CRNs), where the PU jointly determines how to share its under-utilized radio resource with Secondary Users (SUs) and how to charge the SUs accordingly. Meanwhile, the SUs jointly determine how to utilize the shared radio resource from the PU and their preferred payments. Since both the PU and SUs expect to benefit from cooperation, we model their interactions as a Nash bargaining problem. Viewing the nonconvexity of bargaining problem, we first propose a two-step procedure to solve it efficiently. The two-step procedure explores the connection between the bargaining problem and its associated social optimization problem, and thus turns the original nonconvex bargaining problem into two consecutive convex optimization problems. We then propose two efficient algorithms, each with guaranteed convergence, to solve these two problems, respectively. Numerical results show that our proposed two-step procedure achieves the optimality of the bargaining problem with significantly reduced computational complexity. Also, our joint resource sharing and pricing scheme guarantees that each SU and PU can positively benefit from the cooperative bargaining, and the benefit is fairly allocated among them.", "paper_title": "Cooperative Resource Sharing and Pricing for Proactive Dynamic Spectrum Access via Nash Bargaining Solution", "paper_id": "WOS:000343904400005"}