{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "volatile_organic_compounds"}, {"score": 0.03347678520709377, "phrase": "reliable_prediction_analysis"}, {"score": 0.004767261858417823, "phrase": "narrow-band_spectroscopic_data"}, {"score": 0.004461131750106576, "phrase": "versatile_security_issues"}, {"score": 0.004402295697276237, "phrase": "drug_trafficking"}, {"score": 0.004315487055548749, "phrase": "human_presence"}, {"score": 0.004286931271697226, "phrase": "forbidden_areas"}, {"score": 0.004024863549087511, "phrase": "absorption_peaks"}, {"score": 0.003984968827278219, "phrase": "investigated_compounds"}, {"score": 0.003958591403140206, "phrase": "extended_spectral_recordings"}, {"score": 0.0037412912454999046, "phrase": "physical_mechanisms"}, {"score": 0.0035712919163869176, "phrase": "field_measurements"}, {"score": 0.0033639840192975835, "phrase": "proposed_approach"}, {"score": 0.003341703245432554, "phrase": "support_vector_machine_algorithmic_training"}, {"score": 0.0031164532805849432, "phrase": "probabilistic_classification_performance"}, {"score": 0.003014576010931602, "phrase": "prediction_performance"}, {"score": 0.0029846653187175012, "phrase": "wider_mir_absorption_spectra"}, {"score": 0.00286795254228461, "phrase": "associated_vocs"}, {"score": 0.0026304533650262545, "phrase": "efficient_voc_classification"}, {"score": 0.00256993314099902, "phrase": "john_wiley"}, {"score": 0.0024941578231560055, "phrase": "support_vector_machine_algorithm"}, {"score": 0.0021049977753042253, "phrase": "efficient_volatile_organic_compound_classification"}], "paper_keywords": ["support vector machine", " volatile organic compounds", " midinfrared spectroscopy"], "paper_abstract": "In this work, a list of volatile organic compounds (VOCs) that are associated with targets susceptible to versatile security issues - such as drug trafficking, explosives carrying, or human presence in forbidden areas - are monitored and discriminated through algorithmic processing of their midinfrared (MIR) spectroscopic properties. Usually, such tasks are relatively straightforward by identifying the absorption peaks of the investigated compounds in extended spectral recordings, from a few hundred up to many thousands of wavenumbers (cm(-1)). Nevertheless, the physical mechanisms and instrumentation for obtaining so broad spectral profiles may prove to be complex, especially in field measurements, while data acquisition and processing may also prove to be time-consuming. In the proposed approach, support vector machine algorithmic training is applied in order to evaluate the potential of exploiting very narrow spectral MIR absorption bands that are optimal for reliable prediction analysis and training. The probabilistic classification performance of these bands is evaluated and compared with the prediction performance when using wider MIR absorption spectra. Depending on the data set and the list of the associated VOCs, spectral data recording within a span up to several tens of wavenumbers - at regions where absorption is detectable - prove to be enough for efficient VOC classification. Copyright (c) 2014 John Wiley & Sons, Ltd. In this work, support vector machine algorithm is evaluated towards the potential of exploiting very narrow spectral mid-infrared absorption bands of chemical compounds that are optimal for reliable prediction analysis and training. Depending on the data set nature and the list of the associated volatile organic compounds investigated, spectral data recording within a span up to several tens of wavenumbers - at regions where absorption is detectable - prove to be sufficient for efficient volatile organic compound classification.", "paper_title": "Support vector machine classification of volatile organic compounds based on narrow-band spectroscopic data", "paper_id": "WOS:000348517300006"}