{"auto_keywords": [{"score": 0.035787748081944036, "phrase": "client_software"}, {"score": 0.02771060373285046, "phrase": "timestamp_information"}, {"score": 0.00481495049065317, "phrase": "cloud_storage_data"}, {"score": 0.004707672504464783, "phrase": "collection_result"}, {"score": 0.004551199992546761, "phrase": "timely_acquisition"}, {"score": 0.004449772140968921, "phrase": "cloud_storage"}, {"score": 0.004350594827104932, "phrase": "law_enforcement_agencies"}, {"score": 0.004205940624913343, "phrase": "legal_provisions"}, {"score": 0.003786006028478562, "phrase": "google"}, {"score": 0.003729378605965024, "phrase": "microsoft"}, {"score": 0.003673675864705682, "phrase": "case_studies"}, {"score": 0.003511613254403125, "phrase": "cloud_storage_account"}, {"score": 0.0032941471167321408, "phrase": "original_files"}, {"score": 0.003220643255032943, "phrase": "resulting_data"}, {"score": 0.0024287485834314027, "phrase": "crucial_aspect"}, {"score": 0.0023566987138026285, "phrase": "civil_action"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cloud storage", " Data collection", " Cloud forensics", " Preservation", " Dropbox", " Google Drive", " Microsoft SkyDrive", " Computer forensics", " Digital forensics", " Digital evidence"], "paper_abstract": "The timely acquisition and preservation of data from cloud storage can be an issue for law enforcement agencies and other digital forensic practitioners. In a jurisdiction which has legal provisions to collect data available to a computer or device, the process may involve accessing an account to collect the data. Using three popular public cloud storage providers (Dropbox, Google Drive, and Microsoft SkyDrive) as case studies, this research explores the process of collecting data from a cloud storage account using a browser and also downloading files using client software. We then compare these with the original files and undertake analysis of the resulting data. We determined that there were no changes to the contents of files during the process of upload, storage, and download to the three cloud storage services. The timestamps of the files were also examined in relation to the files downloaded via a browser and via client software. It was observed that some of the timestamp information remained the same throughout the process of uploading, storing and downloading files. Timestamp information may be a crucial aspect of an investigation, prosecution, or civil action, and therefore it is important to record the information available, and to understand the circumstances relating to a timestamp on a file. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Forensic collection of cloud storage data: Does the act of collection result in changes to the data or its metadata?", "paper_id": "WOS:000324741000007"}