{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aid"}, {"score": 0.01738765886397402, "phrase": "attack_traffic"}, {"score": 0.008708477965591871, "phrase": "end_systems"}, {"score": 0.008481768278147095, "phrase": "authorized_clients"}, {"score": 0.004701556483912018, "phrase": "distributed_denial"}, {"score": 0.004578678036953076, "phrase": "open_security_problem"}, {"score": 0.004217708394188058, "phrase": "autonomous_systems"}, {"score": 0.004173244935967375, "phrase": "different_vendors"}, {"score": 0.0041074234667687875, "phrase": "promising_alternative_strategy"}, {"score": 0.004053362743156545, "phrase": "universal_upgrade"}, {"score": 0.004031937401078062, "phrase": "router_infrastructure"}, {"score": 0.003916098498242888, "phrase": "prior_anti-dos_overlays"}, {"score": 0.0038645461670147965, "phrase": "emergency_services"}, {"score": 0.0037336520904376687, "phrase": "private_server"}, {"score": 0.0036650099009321083, "phrase": "overlay_network"}, {"score": 0.0034942203787603856, "phrase": "follow-up_extension"}, {"score": 0.003466536738232506, "phrase": "anti-dos_overlays"}, {"score": 0.0033490781131509458, "phrase": "important_problem"}, {"score": 0.003296212583539166, "phrase": "anti-dos_overlay_service"}, {"score": 0.0032355864829403413, "phrase": "general-purpose_public_servers"}, {"score": 0.003176071904018557, "phrase": "existing_systems"}, {"score": 0.0026377802995807085, "phrase": "aid_service_nodes"}, {"score": 0.0025687008721685454, "phrase": "random_overlay_network"}, {"score": 0.002468450551616404, "phrase": "distributed_virtual-clock_packet"}, {"score": 0.0023346234464901978, "phrase": "aid_service"}, {"score": 0.002316105585203396, "phrase": "probabilistic_models"}, {"score": 0.002208035721125305, "phrase": "clients_attack"}], "paper_keywords": ["network-level security and protection", " denial of service attacks", " overlay networks"], "paper_abstract": "Distributed denial of service (DDoS) has long been an open security problem of the Internet. Most proposed solutions require the upgrade of routers across the Internet, which is extremely difficult to realize, considering that the Internet consists of a very large number of autonomous systems with routers from different vendors deployed over decades. A promising alternative strategy is to avoid the universal upgrade of router infrastructure and instead rely on an overlay of end systems. The prior anti-DoS overlays were designed to protect emergency services for authorized clients. They assume that trust exists between authorized clients and a private server. Only authenticated traffic can pass through the overlay network to reach the server, while the attack traffic is not admitted without passing the authentication. The follow-up extension of the anti-DoS overlays for web service has other serious limitations. This paper attempts to solve an important problem. How to design an anti-DoS overlay service (called AID) that protects general-purpose public servers while overcoming the limitations of the existing systems? Anyone, including the attackers, should be able to access the server. Authentication can no longer be the means of defense. While both normal and malicious clients are given the access, AID is designed to fend off attack traffic while letting legitimate-traffic through. Its operations are completely transparent to the users (humans or hosts), the client/server software, and the internal/core routers. To connect the AID service nodes (which are end systems), we choose a random overlay network for its rich, unpredictable connectivity, short diameter, and ease of management. We use a distributed virtual-clock packet scheduling algorithm to restrict the amount of data any client can impose on AID. We analyze the properties of the AID service based on probabilistic models. Our simulations demonstrate that AID can effectively protect legitimate-traffic from attack traffic. Even when 10% of all clients attack, just 1.4% of legitimate-traffic is mistakenly blocked, no matter how aggressive the attackers are. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "AID: A global anti-DoS service", "paper_id": "WOS:000249745400002"}