{"auto_keywords": [{"score": 0.03714965378696057, "phrase": "personaf"}, {"score": 0.015613917306866312, "phrase": "pervasive_computing"}, {"score": 0.009297301990488597, "phrase": "adaptive_locator"}, {"score": 0.00851075168817477, "phrase": "personaf_approach"}, {"score": 0.00481495049065317, "phrase": "personalised_ontological_reasoning"}, {"score": 0.004669254965563445, "phrase": "highly_personalised_information"}, {"score": 0.0039362209515303795, "phrase": "pragmatic_perspectives"}, {"score": 0.003778081566896723, "phrase": "new_building"}, {"score": 0.0035892794633115227, "phrase": "pervasive_applications"}, {"score": 0.0033406481167452436, "phrase": "new_abstract_framework"}, {"score": 0.003317883538640966, "phrase": "pervasive_ontological_reasoning"}, {"score": 0.0030356410934402503, "phrase": "location_modelling"}, {"score": 0.002984173420996039, "phrase": "best_ontological_reasoner"}, {"score": 0.002854392852477005, "phrase": "personaf_framework"}, {"score": 0.002730240935688002, "phrase": "non-generic_layers"}, {"score": 0.0026384167183586015, "phrase": "user_study"}, {"score": 0.0024304113675154017, "phrase": "system_reasoning"}, {"score": 0.002324657548285756, "phrase": "low_cost_ontologies"}, {"score": 0.002285216591220303, "phrase": "flexible_ontological_reasoning"}, {"score": 0.0022696277881969896, "phrase": "smart_buildings"}, {"score": 0.0021340178074057245, "phrase": "personalised_information"}, {"score": 0.0021049977753042253, "phrase": "understandable_explanations"}], "paper_keywords": ["Personal ontology", " Ontological reasoning", " Pervasive personalisation", " Scrutable personalisation", " Pervasive computing"], "paper_abstract": "Pervasive computing creates possibilities for presenting highly personalised information about the people, places and things in a building. One of the challenges for such personalisation is the creation of the system that can support ontological reasoning for several key tasks: reasoning about location; personalisation of information about location at the right level of detail; and personalisation to match each person's conceptions of the building based on their own use of it and their relationship to other people in the building. From pragmatic perspectives, it should be inexpensive to create the ontology for each new building. It is also critical that users should be able to understand and control pervasive applications. We created the PERSONAF (personalised pervasive scrutable ontological framework) to address these challenges. PERSONAF is a new abstract framework for pervasive ontological reasoning. We report its evaluation at three levels. First, we assessed the power of the ontology for reasoning about noisy and uncertain location information, showing that PERSONAF can improve location modelling. Notably, the best ontological reasoner varies across users. Second, we demonstrate the use of the PERSONAF framework in Adaptive Locator, an application built upon it, using our low cost mechanisms for non-generic layers of the ontology. Finally, we report a user study, which evaluated the PERSONAF approach as seen by users in the Adaptive Locator. We assessed both the personalisation performance and the understandability of explanations of the system reasoning. Together, these three evaluations show that the PERSONAF approach supports building of low cost ontologies, that can achieve flexible ontological reasoning about smart buildings and the people in them, and that this can be used to build applications which give personalised information that can provide understandable explanations of the reasoning underlying the personalisation.", "paper_title": "PERSONAF: framework for personalised ontological reasoning in pervasive computing", "paper_id": "WOS:000274328100001"}