{"auto_keywords": [{"score": 0.0482117522215884, "phrase": "agent-based_approach"}, {"score": 0.04760430605028296, "phrase": "multiple_multicast"}, {"score": 0.026033701006803824, "phrase": "spcco"}, {"score": 0.00481495049065317, "phrase": "agent-based_multicast_strategy"}, {"score": 0.004526129302830441, "phrase": "wormhole_switch-based_networks"}, {"score": 0.00436890075128947, "phrase": "important_communication_pattern"}, {"score": 0.0042734067085669885, "phrase": "collective_communication_operations"}, {"score": 0.004217110862974562, "phrase": "barrier_synchronization"}, {"score": 0.004179991181159956, "phrase": "global_combining"}, {"score": 0.003775803846431323, "phrase": "entire_multicast_problem"}, {"score": 0.0029733865110222785, "phrase": "different_multicasts"}, {"score": 0.0028195727965553367, "phrase": "message-passing_scheduling"}, {"score": 0.0027578496677536373, "phrase": "destination_processors"}, {"score": 0.002697474061842142, "phrase": "optimal_scheduling_algorithm"}, {"score": 0.0025692477422626678, "phrase": "extensive_experiments"}, {"score": 0.002279702500235741, "phrase": "link_contention"}, {"score": 0.0022297712188622293, "phrase": "simultaneous_multiple_multicast"}, {"score": 0.0021049977753042253, "phrase": "large_cases"}], "paper_keywords": ["multicast", " irregular networks", " message passing scheduling"], "paper_abstract": "This paper describes an agent-based approach for scheduling multiple multicast on wormhole switch-based networks with irregular topologies. Multicast/broadcast is an important communication pattern, with applications in collective communication operations such as barrier synchronization and global combining. Our approach assigns an agent to each subtree of switches such that the agents can exchange information efficiently and independently. The entire multicast problem is then recursively solved with each agent sending message to those switches that it is responsible for. In this way, communication is localized by the assignment of agents to subtrees. This idea can be easily generalized to multiple multicast since the order of message passing among agents can be interleaved for different multicasts. The key to the performance of this agent-based approach is the message-passing scheduling between agents and the destination processors. We propose an optimal scheduling algorithm, called ForwardInSwitch to solve this problem. We conduct extensive experiments to demonstrate the efficiency of our approach by comparing our results with SPCCO, a highly efficient multicast algorithm reported in literature. We found that SPCCO suffers link contention when the number of simultaneous multiple multicast becomes large. On the other hand, our agent-based approach achieves better performance in large cases.", "paper_title": "An optimal scheduling algorithm for an agent-based multicast strategy on irregular networks", "paper_id": "WOS:000249921700004"}