{"auto_keywords": [{"score": 0.03859382785095826, "phrase": "ccs"}, {"score": 0.02801601946188134, "phrase": "universal_termination"}, {"score": 0.027562941772462553, "phrase": "existential_termination"}, {"score": 0.00481495049065317, "phrase": "expressive_power"}, {"score": 0.004774937143916685, "phrase": "process_interruption"}, {"score": 0.004618166136069052, "phrase": "foundational_aspects"}, {"score": 0.004579780586951551, "phrase": "linguistic_mechanisms"}, {"score": 0.004541712637353326, "phrase": "programming_long-running_transactions"}, {"score": 0.004447915226010682, "phrase": "scope_operator"}, {"score": 0.004410939163075599, "phrase": "ws-bpel"}, {"score": 0.004266067096140677, "phrase": "process_algebraic_operators"}, {"score": 0.0037324526526073404, "phrase": "termination_problems"}, {"score": 0.0033764764370876376, "phrase": "csp"}, {"score": 0.003265365666305185, "phrase": "exception_handling"}, {"score": 0.0031579997262619758, "phrase": "existential_termination_problem"}, {"score": 0.0028091907694771613, "phrase": "considered_problems"}, {"score": 0.0022133711375320244, "phrase": "expressiveness_gap"}, {"score": 0.0021049977753042253, "phrase": "try-catch_operator"}], "paper_keywords": [""], "paper_abstract": "The investigation into the foundational aspects Of linguistic mechanisms For programming long-running transactions (Such as the scope operator of WS-BPEL) has recently renewed the interest in process algebraic operators that, due to the Occurrence of a failure, interrupt the execution of one process, replacing it with another one called the future handler. We investigate the decidability of termination problems for two simple fragments of CCS (one with recursion and one with replication) extended with one of two such operators, the interrupt operator of CSP and the try-catch operator for exception handling. More precisely, we consider the existential termination problem (existence of one terminated computation) and the universal termination problem (all Computations terminate). We prove that, as far as the decidability of the considered problems is concerned, Under replication there is no difference between interrupt and try-catch (Universal termination is decidable while existential termination is not), while Under recursion this is not the case (existential termination is undecidable while universal termination is decidable only for interrupt). As a consequence of our undecidability results, we show the existence of an expressiveness gap between a fragment of CCS and its extension with either the interrupt or the try-catch operator.", "paper_title": "On the expressive power of process interruption and compensation", "paper_id": "WOS:000267311700004"}