{"auto_keywords": [{"score": 0.04970018005584554, "phrase": "galled-tree_networks"}, {"score": 0.007370583184048263, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "haplotype_inferring"}, {"score": 0.00450052670755585, "phrase": "considerable_prominence"}, {"score": 0.004447201233380302, "phrase": "research_community"}, {"score": 0.004223299391912042, "phrase": "snp_values"}, {"score": 0.004189863767755212, "phrase": "individual_chromosomes"}, {"score": 0.004026598712747509, "phrase": "genetic_causes"}, {"score": 0.003916098498242888, "phrase": "main_algorithmic_tools"}, {"score": 0.0037634608487353183, "phrase": "evolutionary_history"}, {"score": 0.0037188360359702182, "phrase": "original_haplotypes"}, {"score": 0.0036893794227117194, "phrase": "perfect_phylogeny"}, {"score": 0.003559675269411366, "phrase": "individual_blocks"}, {"score": 0.0033269488835014583, "phrase": "exact_determination"}, {"score": 0.00295264307195965, "phrase": "multiblock_sections"}, {"score": 0.0028944757265206332, "phrase": "natural_candidate"}, {"score": 0.002826181226538412, "phrase": "phylogenetic_networks"}, {"score": 0.0025382066972107777, "phrase": "efficient_algorithms"}, {"score": 0.002468450551616404, "phrase": "galled-tree_network"}], "paper_keywords": ["algorithms", " combinatorial optimization", " combinatorics", " RNA"], "paper_abstract": "The problem of determining haplotypes from genotypes has gained considerable prominence in the research community since the beginning of the HapMap project. Here the focus is on determining the sets of SNP values of individual chromosomes (haplotypes), since such information better captures the genetic causes of diseases. One of the main algorithmic tools for haplotyping is based on the assumption that the evolutionary history for the original haplotypes satisfies perfect phylogeny. This tool can be applied only on individual blocks of chromosomes, in which it is assumed that recombinations do not happen. However, exact determination of blocks is usually not possible. It would be desirable to develop a method for haplotyping which can account for recombinations, and thus can be applied on multiblock sections of chromosomes. A natural candidate for such a method is haplotyping via phylogenetic networks (which model recombinations) or their simplified version: galled-tree networks. However, even haplotyping via galled-tree networks appears hard, as the efficient algorithms exist only for very special cases: the galled-tree network has either a single gall or only small galls with two mutations each. Building on our previous results, we show that, in general, haplotyping via galled-tree networks is NP-complete, and it remains NP-complete when galls are allowed to have at most k mutations, for any k >= 3.", "paper_title": "Haplotype Inferring via Galled-Tree Networks Is NP-Complete", "paper_id": "WOS:000282808900007"}