{"auto_keywords": [{"score": 0.04903589335092133, "phrase": "logic_block"}, {"score": 0.014967362359141183, "phrase": "larger_design"}, {"score": 0.012432071353916377, "phrase": "functional_broadside_tests"}, {"score": 0.009933412312209433, "phrase": "stand-alone_circuit"}, {"score": 0.00481495049065317, "phrase": "embedded_logic_blocks"}, {"score": 0.004506968388996092, "phrase": "input_sequences"}, {"score": 0.0039053194919285725, "phrase": "scan-based_tests"}, {"score": 0.003675517796014622, "phrase": "embedded_block"}, {"score": 0.0026543514413663893, "phrase": "embedded_logic_block"}, {"score": 0.0023900527169254744, "phrase": "logic_block_functional_broadside_tests"}, {"score": 0.0022122603123901114, "phrase": "fault_coverage"}, {"score": 0.002128376306688074, "phrase": "computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "test_generation"}], "paper_keywords": [""], "paper_abstract": "When a logic block is embedded in a larger design, the input sequences applicable to it may be constrained by other logic blocks in the design. This has an impact on what would constitute overtesting of the logic block by scan-based tests. This study defines functional broadside tests that avoid overtesting for an embedded block based on functional broadside tests for the larger design. The definition is constructive and results in a procedure for generating the tests. This study compares these tests with ones generated for the logic block as a stand-alone circuit. The results demonstrate that it is important to consider in the discussion of overtesting the extent to which the functionality of an embedded logic block is utilised as a part of the design. Under certain conditions it is possible to apply to the logic block functional broadside tests that were generated for it as a stand-alone circuit in order to maximise the fault coverage without overtesting, and reduce the computational complexity of test generation.", "paper_title": "Functional broadside tests for embedded logic blocks", "paper_id": "WOS:000309511700004"}