{"auto_keywords": [{"score": 0.042945438129372356, "phrase": "dbms"}, {"score": 0.00481495049065317, "phrase": "constraint-based_mining_queries"}, {"score": 0.004722254884093624, "phrase": "previous_materialized_results"}, {"score": 0.004498213310668266, "phrase": "inductive_databases"}, {"score": 0.00443308765153716, "phrase": "new_generation"}, {"score": 0.004326624385772596, "phrase": "decision_support_applications"}, {"score": 0.003409057326528229, "phrase": "frequent_itemsets"}, {"score": 0.003359647377874098, "phrase": "inductive_database"}, {"score": 0.0032471155306148126, "phrase": "query_answering"}, {"score": 0.003018468582368033, "phrase": "result_sets"}, {"score": 0.0026986685585382347, "phrase": "sufficient_conditions"}, {"score": 0.00247215300812495, "phrase": "functional_dependencies"}, {"score": 0.002297949552105756, "phrase": "initial_prototype"}, {"score": 0.0022101055924375725, "phrase": "approach_to_query_answering"}, {"score": 0.0021049977753042253, "phrase": "query_execution_time"}], "paper_keywords": ["data mining", " KDD", " query languages", " inductive databases", " genetic algorithm"], "paper_abstract": "In recent years, researchers have begun to study inductive databases, a new generation of databases for leveraging decision support applications. In this context, the user interacts with the DBMS using advanced, constraint-based languages for data mining where constraints have been specifically introduced to increase the relevance of the results and, at the same time, to reduce its volume. In this paper we study the problem of mining frequent itemsets using an inductive database. We propose a technique for query answering which consists in rewriting the query in terms of union and intersection of the result sets of other queries, previously executed and materialized. Unfortunately, the exploitation of past queries is not always applicable. We then present sufficient conditions for the optimization to apply and show that these conditions are strictly connected with the presence of functional dependencies between the attributes involved in the queries. We show some experiments on an initial prototype of an optimizer which demonstrates that this approach to query answering is viable and in many practical cases it drastically reduces the query execution time.", "paper_title": "Answering constraint-based mining queries on itemsets using previous materialized results", "paper_id": "WOS:000236616100007"}