{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "informatics_literacy"}, {"score": 0.049418985040378574, "phrase": "clinical_nurses"}, {"score": 0.004683116355272958, "phrase": "taiwan"}, {"score": 0.004338661611644755, "phrase": "essential_components"}, {"score": 0.004132743580000062, "phrase": "taiwanese_hospitals"}, {"score": 0.0038822311096089307, "phrase": "critical_informatics_literacy_factors"}, {"score": 0.0035468507553681034, "phrase": "survey_methodology"}, {"score": 0.003378385493203297, "phrase": "senior_administrators"}, {"score": 0.0031734538599865973, "phrase": "nursing_information_systems"}, {"score": 0.003086396772496527, "phrase": "medical_centers"}, {"score": 0.002685558057339722, "phrase": "taiwanese_study"}, {"score": 0.002241087008892355, "phrase": "initial_nursing_informatics_literacy"}], "paper_keywords": ["clinical nurses", " informatics literacy", " nursing informatics"], "paper_abstract": "The purpose of this study is to identify the essential components for informatics literacy for clinical nurses working in Taiwanese hospitals. We developed a framework to explore the critical informatics literacy factors that clinical nurses should understand to be proficient in performing their professional duties. Survey methodology was used and the participants were senior administrators of nursing and other personnel in charge of implementing nursing information systems for 84 regional hospitals and medical centers. A total of 50 valid questionnaires was returned, with a 59.5% response rate. In summary, the results of the Taiwanese study are divided into three factors: informatics knowledge, informatics skills, and computer attitudes. A total of 58 questions was used for the measurement of initial nursing informatics literacy, and 49 items were considered to be the most required informatics literacy skills specifically for clinical nurses.", "paper_title": "A study of the informatics literacy of clinical nurses in Taiwan", "paper_id": "WOS:000259460000007"}