{"auto_keywords": [{"score": 0.0413490378763615, "phrase": "calibration_procedure"}, {"score": 0.011369365297863985, "phrase": "general_imaging_model"}, {"score": 0.00481495049065317, "phrase": "smooth_camera_models"}, {"score": 0.004771435352180973, "phrase": "generic_imaging_models"}, {"score": 0.0045804107341714, "phrase": "current_generic_models"}, {"score": 0.004278807087784626, "phrase": "straight_line"}, {"score": 0.004070276454809864, "phrase": "generic_camera_model"}, {"score": 0.0037506567448470163, "phrase": "projecting_lines"}, {"score": 0.0034403745992576808, "phrase": "radial_basis_functions"}, {"score": 0.0021049977753042253, "phrase": "accurate_calibration_results"}], "paper_keywords": ["General camera models", " camera calibration", " smooth vector-valued functions"], "paper_abstract": "Generic imaging models can be used to represent any camera. Current generic models are discrete and define a mapping between each pixel in the image and a straight line in 3D space. This paper presents a modification of the generic camera model that allows the simplification of the calibration procedure. The only requirement is that the coordinates of the 3D projecting lines are related by functions that vary smoothly across space. Such a model is obtained by modifying the general imaging model using radial basis functions (RBFs) to interpolate image coordinates and 3D lines, thereby allowing both an increase in resolution (due to their continuous nature) and a more compact representation. Using this variation of the general imaging model, we also develop a calibration procedure. This procedure only requires that a 3D point be matched to each pixel. In addition, not all the pixels need to be calibrated. As a result, the complexity of the procedure is significantly decreased. Normalization is applied to the coordinates of both image and 3D points, which increases the accuracy of the calibration. Results with both synthetic and real datasets show that the model and calibration procedure are easily applicable and provide accurate calibration results.", "paper_title": "Calibration of Smooth Camera Models", "paper_id": "WOS:000322029000004"}