{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "brain_activations"}, {"score": 0.04882787382338285, "phrase": "virtual_reality_mood_induction_procedures"}, {"score": 0.030819141245046457, "phrase": "significant_activations"}, {"score": 0.004739056045644449, "phrase": "emotional_regulation"}, {"score": 0.004377077848734575, "phrase": "external_or_internal_emotional_stimuli"}, {"score": 0.0036942726653704213, "phrase": "emotiv_epoc"}, {"score": 0.0036167509502276294, "phrase": "brain_electrical_activity"}, {"score": 0.0034482025128821548, "phrase": "virtual_reality_environment"}, {"score": 0.0029722900280316216, "phrase": "control_group"}, {"score": 0.0027594936602962075, "phrase": "negative_emotions"}, {"score": 0.002508073621696602, "phrase": "emotional_regulation_groups"}, {"score": 0.002378408229095287, "phrase": "emotional_regulation_strategies"}, {"score": 0.0021731423856364003, "phrase": "clinical_neuroimaging_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Emotional regulation strategies", " EEG", " Emotiv EPOC", " Virtual reality", " Sadness", " sLORETA"], "paper_abstract": "Emotional regulation strategies are used by people to influence their emotional responses to external or internal emotional stimuli. The aim of this study is to evaluate the brain activations that are associated with the application of two different emotional regulation strategies (cognitive reappraisal and expressive suppression) during virtual reality mood induction procedures. We used Emotiv EPOC to measure the brain electrical activity of participants while sadness is induced using a virtual reality environment. We monitored 24 participants, who were distributed among three experimental groups: a control group, a cognitive reappraisal group and an expressive suppression group. In the control group, we found significant activations in several right frontal regions that are related to the induction of negative emotions'. We also found significant activations in the limbic, occipital, and parietal regions in the emotional regulation groups. These regions are related to the application of emotional regulation strategies. The results are consistent with those shown in the literature, which were obtained through clinical neuroimaging systems. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Assessing brain activations associated with emotional regulation during virtual reality mood induction procedures", "paper_id": "WOS:000345734700056"}