{"auto_keywords": [{"score": 0.03737634241271661, "phrase": "remote_face_recognition"}, {"score": 0.00481495049065317, "phrase": "unconstrained_acquisition_conditions"}, {"score": 0.003907586297783078, "phrase": "test_images"}, {"score": 0.003757480190200645, "phrase": "training_images"}, {"score": 0.003581797255879607, "phrase": "key_issues"}, {"score": 0.003170667618004276, "phrase": "remote_face_database"}, {"score": 0.0030754582519753474, "phrase": "unconstrained_outdoor_maritime_environment"}, {"score": 0.0029701328654852246, "phrase": "existing_still_image-based_face_recognition_algorithms"}, {"score": 0.0027822459052173113, "phrase": "remote_re-identification_problem"}, {"score": 0.002686935113435742, "phrase": "candidate_sets"}, {"score": 0.002640507929183363, "phrase": "different_location"}, {"score": 0.002583597507349819, "phrase": "remote_conditions"}, {"score": 0.0025389513338018414, "phrase": "preliminary_experimental_results"}, {"score": 0.002516917671182532, "phrase": "remote_re-identification"}, {"score": 0.0023990982005125763, "phrase": "good_classification_algorithm"}, {"score": 0.00226693109377084, "phrase": "statistical_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Remote face recognition", " Re-identification", " Illumination", " Blur", " Low-resolution", " Pose variation"], "paper_abstract": "Face recognition in unconstrained acquisition conditions is one of the most challenging problems that has been actively researched in recent years. It is well known that many state-of-the-art still face recognition algorithms perform well, when constrained (frontal, well illuminated, high-resolution, sharp, and full) face images are acquired. However, their performance degrades significantly when the test images contain variations that are not present in the training images. In this paper, we highlight some of the key issues in remote face recognition. We define the remote face recognition as one where faces are several tens of meters (10-250 m) from the cameras. We then describe a remote face database which has been acquired in an unconstrained outdoor maritime environment. Recognition performance of a subset of existing still image-based face recognition algorithms is evaluated on the remote face data set. Further, we define the remote re-identification problem as matching a subject at one location with candidate sets acquired at a different location and over time in remote conditions. We provide preliminary experimental results on remote re-identification. It is demonstrated that in addition to applying a good classification algorithm, finding features that are robust to variations mentioned above and developing statistical models which can account for these variations are very important for remote face recognition. (c) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Remote identification of faces: Problems, prospects, and progress", "paper_id": "WOS:000309085100005"}