{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "impaired_users"}, {"score": 0.00481495049065317, "phrase": "user_interface_developers"}, {"score": 0.004751216062917875, "phrase": "accessibility_limitations"}, {"score": 0.00450456611645112, "phrase": "user_interfaces"}, {"score": 0.004405596416783185, "phrase": "experience_accessibility_limitations"}, {"score": 0.003821503621554738, "phrase": "realistic_simulations"}, {"score": 0.0036229421570951807, "phrase": "developed_tool"}, {"score": 0.0034194194985380268, "phrase": "standalone_application"}, {"score": 0.003299880298525127, "phrase": "netbeans_integrated_development_environment"}, {"score": 0.0032129756775999296, "phrase": "dias"}, {"score": 0.0031562971707460802, "phrase": "impairment_simulations"}, {"score": 0.0030870287627720702, "phrase": "java"}, {"score": 0.0030595112110658675, "phrase": "mobile_and_web_applications"}, {"score": 0.0023951674998589846, "phrase": "at."}, {"score": 0.002123831297790248, "phrase": "future_development"}, {"score": 0.0021049977753042253, "phrase": "interactive_applications"}], "paper_keywords": ["Human computer interaction", " User interfaces", " Accessibility", " Simulation", " User-centred software design"], "paper_abstract": "His paper presents a tool facilitating developers of user interfaces (UIs) to experience accessibility limitations that can be posed from various disabilities during the interaction of impaired users with their developments. In this respect, various aspects of visual, hearing, physical and cognitive impairments have been modelled through filters providing approximate, yet, realistic simulations over them. These filters have formed the basis for the developed tool, which can be used either on its own (as a standalone application), or be embedded in the NetBeans Integrated Development Environment. The tool, named DIAS, allows for impairment simulations to be performed over Java, mobile and web applications. Moreover, it integrates two of the most common assistive technologies (ATs), namely a screen reader and a magnifier. As a result, developers of UIs can not only experience how interaction would be affected from various impairments, but they can also understand how their developments would be perceived by impaired users through an AT. This work aims to provide an integrated, practical solution for impairment simulation, which could be easily adopted by developers, thus realistically increasing the possibilities for the future development of interactive applications that are more accessible to users with disabilities.", "paper_title": "Enabling user interface developers to experience accessibility limitations through visual, hearing, physical and cognitive impairment simulation", "paper_id": "WOS:000335677000007"}