{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vertex_descriptors"}, {"score": 0.010798706095823249, "phrase": "topological_patterns"}, {"score": 0.0046253989970108985, "phrase": "graph_topology"}, {"score": 0.0045464538515249085, "phrase": "large_attributed_graph"}, {"score": 0.0038492126993451337, "phrase": "topological_properties"}, {"score": 0.003531474887552889, "phrase": "numerical_or_ordinal_types"}, {"score": 0.0032398798149196432, "phrase": "frequent_pattern_mining"}, {"score": 0.0032028587883593702, "phrase": "graph_topology_analysis"}, {"score": 0.002487083025913648, "phrase": "efficient_algorithm"}, {"score": 0.002255431275670053, "phrase": "classical_empirical_study"}, {"score": 0.0022041312401435346, "phrase": "case_studies"}, {"score": 0.0021049977753042253, "phrase": "valuable_knowledge"}], "paper_keywords": ["Data mining", " mining methods and analysis", " attributed graph mining", " topological patterns"], "paper_abstract": "We propose to mine the graph topology of a large attributed graph by finding regularities among vertex descriptors. Such descriptors are of two types: 1) the vertex attributes that convey the information of the vertices themselves and 2) some topological properties used to describe the connectivity of the vertices. These descriptors are mostly of numerical or ordinal types and their similarity can be captured by quantifying their covariation. Mining topological patterns relies on frequent pattern mining and graph topology analysis to reveal the links that exist between the relation encoded by the graph and the vertex attributes. We propose three interestingness measures of topological patterns that differ by the pairs of vertices considered while evaluating up and down co-variations between vertex descriptors. An efficient algorithm that combines search and pruning strategies to look for the most relevant topological patterns is presented. Besides a classical empirical study, we report case studies on four real-life networks showing that our approach provides valuable knowledge.", "paper_title": "Mining Graph Topological Patterns: Finding Covariations among Vertex Descriptors", "paper_id": "WOS:000322136900012"}