{"auto_keywords": [{"score": 0.04738237666161959, "phrase": "counting_methods"}, {"score": 0.012552233873516484, "phrase": "basic_units"}, {"score": 0.01174687721595467, "phrase": "score_functions"}, {"score": 0.008204498151324787, "phrase": "cumulative-turnout_networks"}, {"score": 0.007326169184178033, "phrase": "scientific_cooperation"}, {"score": 0.00481495049065317, "phrase": "scientific_research"}, {"score": 0.004317109072311102, "phrase": "theoretical_and_technical_limitations"}, {"score": 0.004288350745104431, "phrase": "different_methods"}, {"score": 0.004138164176041099, "phrase": "precise_definitions"}, {"score": 0.003905203437405085, "phrase": "measure_theory"}, {"score": 0.0035720594590926127, "phrase": "five_classes"}, {"score": 0.003485516077170446, "phrase": "different_combinations"}, {"score": 0.0033859276361779896, "phrase": "identical_results"}, {"score": 0.0027454383581457555, "phrase": "whole_and_whole-normalized_counting_methods"}, {"score": 0.002649143883163392, "phrase": "different_score_functions"}, {"score": 0.002608081391206139, "phrase": "different_counting_methods"}, {"score": 0.002550519519588985, "phrase": "new_kind"}, {"score": 0.002461044825190643, "phrase": "full_information"}, {"score": 0.0022407927161620855, "phrase": "new_indicators"}, {"score": 0.0021815561949073406, "phrase": "internal_cumulative-turnout_networks"}, {"score": 0.002171836484200008, "phrase": "external_cumulative-turnout_networks"}, {"score": 0.0021477258390613123, "phrase": "internal_underlying_networks"}, {"score": 0.0021381565332182773, "phrase": "external_underlying_networks"}, {"score": 0.0021144189937949646, "phrase": "new_opportunities"}, {"score": 0.0021049977753042253, "phrase": "quantitative_studies"}], "paper_keywords": [""], "paper_abstract": "The literature on publication counting demonstrates the use of various terminologies and methods. In many scientific publications, no information at all is given about the counting methods used. There is a lack of knowledge and agreement about the sort of information provided by the various methods, about the theoretical and technical limitations for the different methods and about the size of the differences obtained by using various methods. The need for precise definitions and terminology has been expressed repeatedly but with no success. Counting methods for publications are defined and analysed with the use of set and measure theory. The analysis depends on definitions of basic units for analysis (three chosen for examination), objects of study (three chosen for examination) and score functions (five chosen for examination). The score functions define five classes of counting methods. However, in a number of cases different combinations of basic units of analysis, objects of study and score functions give identical results. Therefore, the result is the characterization of 19 counting methods, five complete counting methods, five complete-normalized counting methods, two whole counting methods, two whole-normalized counting methods, and five straight counting methods. When scores for objects of study are added, the value obtained can be identical with or higher than the score for the union of the objects of study. Therefore, some classes of counting methods, including the classes of complete, complete-normalized and straight counting methods, are additive, others, including the classes of whole and whole-normalized counting methods, are non-additive. An analysis of the differences between scores obtained by different score functions and therefore the differences obtained by different counting methods is presented. In this analysis we introduce a new kind of objects of study, the class of cumulative-turnout networks for objects of study, containing full information on cooperation. Cumulative-turnout networks are all authors, institutions or countries contributing to the publications of an author, an institute or a country. The analysis leads to an interpretation of the results of score functions and to the definition of new indicators for scientific cooperation. We also define a number of other networks, internal cumulative-turnout networks, external cumulative-turnout networks, underlying networks, internal underlying networks and external underlying networks. The networks open new opportunities for quantitative studies of scientific cooperation.", "paper_title": "Publication, cooperation and productivity measures in scientific research", "paper_id": "WOS:000250198400006"}