{"auto_keywords": [{"score": 0.004533685795068016, "phrase": "autonomous_components"}, {"score": 0.004435514622798228, "phrase": "omnipotent_cpu"}, {"score": 0.004339459955098738, "phrase": "dumb_devices"}, {"score": 0.004292212137716459, "phrase": "database_management_system"}, {"score": 0.003826007045267751, "phrase": "centralized_kernel"}, {"score": 0.0034478392374444177, "phrase": "distributed_data_management_research"}, {"score": 0.0031411751440831165, "phrase": "respective_algorithms"}, {"score": 0.0030562674358159945, "phrase": "cpu_efficiency"}, {"score": 0.0029573932605287947, "phrase": "dynamic_programming"}, {"score": 0.0027843339377323878, "phrase": "memory_resident_databases"}, {"score": 0.002679501909303057, "phrase": "cpu-efficient_query_processors"}, {"score": 0.0026070408483940535, "phrase": "hardware_heterogeneity"}, {"score": 0.002550481822137976, "phrase": "similar_line"}, {"score": 0.0024951467586005094, "phrase": "cpu-efficient_distributed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "micro-distributed_system"}], "paper_keywords": [""], "paper_abstract": "Computer system architecture has changed: an assembly of autonomous components has replaced the omnipotent CPU and its legion of dumb devices. Database Management System (DBMS) architecture, however, does not yet reflect this change: it is still dominated by a centralized kernel that limits the autonomy of the devices and, thus, their ability to exploit their increased \"smartness\". Distributed data management research can serve as an inspiration for an architecture that addresses this problem. However, the respective algorithms were never designed with CPU efficiency in mind implementing principles like dynamic programming and recursion. More than two decades ago, the transition to memory resident databases spawned a plethora of research on CPU-efficient query processors. We predict that hardware heterogeneity will trigger a similar line of research on CPU-efficient distributed algorithms and architectures. In this paper, we examine benefits and challenges that come with such a micro-distributed database management system. We also discuss a number of approaches that we consider steps towards a micro-distributed system.", "paper_title": "...like Commanding an Anthill: A Case for Micro-Distributed (Data) Management Systems", "paper_id": "WOS:000364948700009"}