{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_satisfaction"}, {"score": 0.005264161101597534, "phrase": "economic_theories"}, {"score": 0.0052117323862186865, "phrase": "user_behavior_research"}, {"score": 0.004625881588444304, "phrase": "first_objective"}, {"score": 0.0044219992735047954, "phrase": "significant_interest"}, {"score": 0.004377921202912336, "phrase": "information_system"}, {"score": 0.004000396172153709, "phrase": "system_use"}, {"score": 0.0038819041309353024, "phrase": "second_and_more_ambitious_objective"}, {"score": 0.0036188435232325337, "phrase": "prior_research"}, {"score": 0.003459191419478298, "phrase": "information_valuation"}, {"score": 0.002719055901632759, "phrase": "utility_research"}, {"score": 0.0026120705848349055, "phrase": "economic_model"}, {"score": 0.002459414063407306, "phrase": "research_model"}, {"score": 0.0023864566654035924, "phrase": "consumptive_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["User satisfaction", " Marginal utility", " Information quality", " Economic theory", " Information technology consumption"], "paper_abstract": "This paper has two major objectives. The first objective intends to answer the following question which is of significant interest to information system (IS) researchers and practitioners: How does user satisfaction (satisfaction) respond to changes in system use and system attributes? The second and more ambitious objective is to promote the application of economic theories in user behavior research. In contrast to prior research that conceived the development of user satisfaction as an information valuation and integration process, we consider such development to be embedded in the IS consumption process, that is, users gain utility (satisfaction) from consuming (using) the system. This perspective enables us to re-conceptualize user satisfaction as a proxy of utility and apply utility research in economics to study user satisfaction. An economic model of user satisfaction was developed. Two empirical studies were conducted to examine the research model. The findings confirmed the consumptive nature of user satisfaction. Apart from enriching our understanding of user satisfaction, this research demonstrates the usefulness of economic theories in user behavior research. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Consuming information systems: An economic model of user satisfaction", "paper_id": "WOS:000330909700018"}