{"auto_keywords": [{"score": 0.039064705414874126, "phrase": "offline_dictionary_attack"}, {"score": 0.035984182640015974, "phrase": "server_compromise"}, {"score": 0.025171621517073806, "phrase": "new_functionality"}, {"score": 0.00481495049065317, "phrase": "password-based_key_exchange"}, {"score": 0.004596960835906736, "phrase": "password-authenticated_key_exchange"}, {"score": 0.004491678520807451, "phrase": "client-server_setting"}, {"score": 0.004355026964936104, "phrase": "stored_password_file"}, {"score": 0.004031238480458909, "phrase": "pake_scheme"}, {"score": 0.0035212516951180946, "phrase": "offline_dictionary_attacks"}, {"score": 0.003284550970221379, "phrase": "best_security"}, {"score": 0.0031968441980848436, "phrase": "password_file"}, {"score": 0.002902236818129282, "phrase": "previous_pake_schemes"}, {"score": 0.0027813397260607487, "phrase": "known_general_technique"}, {"score": 0.0027386335451725762, "phrase": "arbitrary_pake_scheme"}, {"score": 0.0025942468561537682, "phrase": "practical_technique"}, {"score": 0.0025347150832077175, "phrase": "essentially_one_extra_round"}, {"score": 0.002429090371567499, "phrase": "universal_composability_framework"}, {"score": 0.0021049977753042253, "phrase": "random_oracle_model"}], "paper_keywords": [""], "paper_abstract": "This paper considers the problem of password-authenticated key exchange (PAKE) in a client-server setting, where the server authenticates using a stored password file, and it is desirable to maintain some degree of security even if the server is compromised. A PAKE scheme is said to be resilient to server compromise if an adversary who compromises the server must at least perform an offline dictionary attack to gain any advantage in impersonating a client. (Of course, offline dictionary attacks should be infeasible in the absence of server compromise.) One can see that this is the best security possible, since by definition the password file has enough information to allow one to play the role of the server, and thus to verify passwords in an offline dictionary attack. While some previous PAKE schemes have been proven resilient to server compromise, there was no known general technique to take an arbitrary PAKE scheme and make it provably resilient to server compromise. This paper presents a practical technique for doing so which requires essentially one extra round of communication and one signature computation/verification. We prove security in the universal composability framework by (1) defining a new functionality for PAKE with resilience to server compromise, (2) specifying a protocol combining this technique with a (basic) PAKE functionality, and (3) proving (in the random oracle model) that this protocol securely realizes the new functionality.", "paper_title": "A method for making password-based key exchange resilient to server compromise", "paper_id": "WOS:000240079900009"}