{"auto_keywords": [{"score": 0.034726425619790245, "phrase": "feedback_services"}, {"score": 0.015719716506582538, "phrase": "stepwise_exercises"}, {"score": 0.011657742055876491, "phrase": "learning_system"}, {"score": 0.0047057084749407485, "phrase": "intelligent_tutoring_systems"}, {"score": 0.004494570360108983, "phrase": "student_practice"}, {"score": 0.003980875186335867, "phrase": "complete_worked-out_solutions"}, {"score": 0.003865033938931324, "phrase": "dedicated_expert_knowledge_module"}, {"score": 0.003789678137602989, "phrase": "domain_reasoner"}, {"score": 0.00376488621224566, "phrase": "existing_architectural_descriptions"}, {"score": 0.0037402558657576124, "phrase": "learning_environments"}, {"score": 0.0034569210133272845, "phrase": "stateless_client-server_architecture"}, {"score": 0.003400640983719424, "phrase": "expert_knowledge_module"}, {"score": 0.0033673122420551952, "phrase": "learning_environment"}, {"score": 0.0029238768315330305, "phrase": "quadratic_equations"}, {"score": 0.0028857130140890787, "phrase": "gaussian_elimination"}, {"score": 0.0028016507334576216, "phrase": "particular_domain"}, {"score": 0.002472822097373027, "phrase": "domain_reasoners"}, {"score": 0.0024485643104830814, "phrase": "generic_functionality"}, {"score": 0.002285278663862646, "phrase": "external_learning_environments"}, {"score": 0.0022628564592874147, "phrase": "simple_prototypes"}, {"score": 0.0022406537579986842, "phrase": "proposed_design"}, {"score": 0.002146926767291475, "phrase": "developing_domain_reasoners"}, {"score": 0.0021050027911633028, "phrase": "elsevier"}], "paper_keywords": ["Intelligent tutoring systems", " Domain reasoners", " Feedback services"], "paper_abstract": "Advanced learning environments such as intelligent tutoring systems for algebra, logic, programming, physics, etc. let a student practice with stepwise exercises, and support a student solving such exercises by providing feedback. These environments usually provide various types of feedback, for example about the correctness of a step, common errors, hints about how to proceed, or complete worked-out solutions. Calculating feedback is generally delegated to a dedicated expert knowledge module, also known as a domain reasoner. Existing architectural descriptions of learning environments do not precisely specify the interaction between this module and the rest of the learning system. We propose a design based on the stateless client-server architecture that clearly decouples the expert knowledge module from the learning environment. We describe a set of feedback services that support the inner (interactions within an exercise) and outer (over a collection of exercises) loops of a learning system, and that provide meta-information about a class of exercises, such as solving quadratic equations, or performing Gaussian elimination. The feedback services do not depend on a particular domain and are based on the various feedback types described in the literature. The paper analyzes which domain-specific knowledge about an exercise class is needed for implementing the feedback services. Based on this analysis, we developed a framework for implementing domain reasoners that offers generic functionality such as rewriting, simplifying, and comparing terms. We have implemented several domain reasoners in this framework, both for external learning environments and for simple prototypes. The proposed design is evaluated with these implementations, and we reflect on our experience with developing domain reasoners. (C) 2014 Elsevier BM. All rights reserved.", "paper_title": "Feedback services for stepwise exercises", "paper_id": "WOS:000336476900008"}