{"auto_keywords": [{"score": 0.04806131990325833, "phrase": "background_knowledge"}, {"score": 0.00481495049065317, "phrase": "main_barriers"}, {"score": 0.0034118234596993836, "phrase": "extensible_diversity-aware_knowledge_base"}, {"score": 0.003310447652300423, "phrase": "properly_organized_knowledge"}, {"score": 0.003130077012135034, "phrase": "proper_context"}, {"score": 0.002544951823639408, "phrase": "suitable_combination"}, {"score": 0.00241658945942583, "phrase": "overall_approach"}, {"score": 0.0023145690608400425, "phrase": "important_use_case"}, {"score": 0.0021601997088758957, "phrase": "large_scale_diversity-aware_knowledge_base"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Context", " Diversity", " Implicit assumptions", " Faceted approach", " Diversity-aware knowledge base", " Semantic matching"], "paper_abstract": "Despite the progress made, one of the main barriers towards the use of semantics is the lack of background knowledge. Dealing with this problem has turned out to be a very difficult task because on the one hand the background knowledge should be very large and virtually unbound and, on the other hand, it should be context sensitive and able to capture the diversity of the world, for instance in terms of language and knowledge. Our proposed solution consists in addressing the problem in three steps: (1) create an extensible diversity-aware knowledge base providing a continuously growing quantity of properly organized knowledge; (2) given the problem, build at run-time the proper context within which perform the reasoning; (3) solve the problem. Our work is based on two key ideas. The first is that of using domains, i.e. a general semantic-aware methodology and technique for structuring the background knowledge. The second is that of building the context of reasoning by a suitable combination of domains. Our goal in this paper is to introduce the overall approach, show how it can be applied to an important use case, i.e. the matching of classifications, and describe our first steps towards the construction of a large scale diversity-aware knowledge base. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Domains and context: First steps towards managing diversity in knowledge", "paper_id": "WOS:000301390400005"}