{"auto_keywords": [{"score": 0.032781743294999326, "phrase": "embedded_capture"}, {"score": 0.012919266180135025, "phrase": "captured_data"}, {"score": 0.00481495049065317, "phrase": "caregiving_domain"}, {"score": 0.004700027722284931, "phrase": "ubiquitous_computing"}, {"score": 0.004543708337879809, "phrase": "everyday_experiences"}, {"score": 0.004456717971917794, "phrase": "commonly_studied_application_area"}, {"score": 0.004267004541988167, "phrase": "classroom_lectures"}, {"score": 0.004165105357908494, "phrase": "surgical_procedures"}, {"score": 0.003987755561492638, "phrase": "infrequent_access"}, {"score": 0.0037811784409635023, "phrase": "high-need_situation"}, {"score": 0.0035852640843794252, "phrase": "specific_situation"}, {"score": 0.002855934865505357, "phrase": "better_reflection"}, {"score": 0.0023990982005125763, "phrase": "developmental_data"}, {"score": 0.0023079225317714815, "phrase": "fully_functional_prototypes"}, {"score": 0.0021049977753042253, "phrase": "data_recording"}], "paper_keywords": ["Ubiquitous computing", " Capture and access", " Caregivers", " Human-computer interaction", " Autism", " Children"], "paper_abstract": "The use of ubiquitous computing to aid in the capture of everyday experiences has been a commonly studied application area. Previous systems have enabled the capture of classroom lectures, meetings, or surgical procedures. However, many of these systems saw infrequent access to captured data, mostly because accessing the data required a high-need situation in order to go through the trouble of finding the specific situation. We believe that if access was made more ubiquitous, people would be more inclined to use it. In this article, we present the notion of embedded capture and access, which aims to make both data capture and access ubiquitous, thus encouraging better reflection on captured data. We provide a description of the notion of embedded capture and access and describe how we applied this technique to two domains of caregivers: therapists working with individuals with autism and parents collecting developmental data on their young children. Through the development of fully functional prototypes, we were able to show that technologies using embedded capture and access are a successful means to supporting data recording and review.", "paper_title": "Embedded capture and access: encouraging recording and reviewing of data in the caregiving domain", "paper_id": "WOS:000299516800008"}