{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "entailment_graphs"}, {"score": 0.049571431541439746, "phrase": "entailment_rules"}, {"score": 0.00439777299939725, "phrase": "active_field"}, {"score": 0.004059673618719782, "phrase": "account_dependencies"}, {"score": 0.004016594765266821, "phrase": "different_rules"}, {"score": 0.003869373085652601, "phrase": "transitive_relation"}, {"score": 0.003727527379253624, "phrase": "rule_quality"}, {"score": 0.003629392214109574, "phrase": "scalability_issues"}, {"score": 0.0031930184711888867, "phrase": "transitive_graphs"}, {"score": 0.0027495914857929584, "phrase": "large_number"}, {"score": 0.0026771333996253783, "phrase": "structural_properties"}, {"score": 0.0025243592424524764, "phrase": "tree-like_property"}, {"score": 0.0023675986784123656, "phrase": "high-quality_solutions"}, {"score": 0.002185235873435714, "phrase": "first_time"}, {"score": 0.002150481043278758, "phrase": "large_graphs"}], "paper_keywords": [""], "paper_abstract": "Entailment rules between predicates are fundamental to many semantic-inference applications. Consequently, learning such rules has been an active field of research in recent years. Methods for learning entailment rules between predicates that take into account dependencies between different rules (e.g., entailment is a transitive relation) have been shown to improve rule quality, but suffer from scalability issues, that is, the number of predicates handled is often quite small. In this article, we present methods for learning transitive graphs that contain tens of thousands of nodes, where nodes represent predicates and edges correspond to entailment rules (termed entailment graphs). Our methods are able to scale to a large number of predicates by exploiting structural properties of entailment graphs such as the fact that they exhibit a tree-like property. We apply our methods on two data sets and demonstrate that our methods find high-quality solutions faster than methods proposed in the past, and moreover our methods for the first time scale to large graphs containing 20,000 nodes and more than 100,000 edges.", "paper_title": "Efficient Global Learning of Entailment Graphs", "paper_id": "WOS:000359625700003"}