{"auto_keywords": [{"score": 0.04617431791749015, "phrase": "proposed_protocol"}, {"score": 0.03224108605324679, "phrase": "intersecting_node"}, {"score": 0.010148717842446378, "phrase": "single_transceiver"}, {"score": 0.00481495049065317, "phrase": "multi-channel_multi-hop_wireless_networks"}, {"score": 0.004696255771858337, "phrase": "intersection-aware_channel_assignment"}, {"score": 0.004638005069508673, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.0045349602638676805, "phrase": "network_capacity"}, {"score": 0.00446753305412928, "phrase": "frequency_diversity"}, {"score": 0.004401103940931994, "phrase": "multiple_communications"}, {"score": 0.004186695596916661, "phrase": "multi-channel_hidden_terminal_problem"}, {"score": 0.004042830127694523, "phrase": "multiple_channels"}, {"score": 0.004012648246599132, "phrase": "network_layer"}, {"score": 0.003972754554131117, "phrase": "single_channel_mac_protocol"}, {"score": 0.003943165449321934, "phrase": "ieee"}, {"score": 0.003640115580601024, "phrase": "single_wireless_card"}, {"score": 0.0035680675987902, "phrase": "modular_exponentiation_congruence"}, {"score": 0.0035325782439205675, "phrase": "channel_schedule"}, {"score": 0.003445386206446506, "phrase": "common_channels"}, {"score": 0.003164665716798173, "phrase": "different_channel"}, {"score": 0.0029878140399724347, "phrase": "single_radio_multiple_channels"}, {"score": 0.002842060319876433, "phrase": "link_capacity"}, {"score": 0.0026966443595372617, "phrase": "nonintersecting_node"}, {"score": 0.0026697992876555366, "phrase": "different_channels"}, {"score": 0.002539519679546011, "phrase": "non-intersecting_node"}, {"score": 0.0024892011202241886, "phrase": "multiple_routes"}, {"score": 0.0024705891356454524, "phrase": "destination_node"}, {"score": 0.0023915281886924392, "phrase": "intersecting_nodes"}, {"score": 0.00224089851484905, "phrase": "simulation_results"}, {"score": 0.002196483866453684, "phrase": "aggregate_end-to-end_throughput"}, {"score": 0.002158342205806634, "phrase": "single-channel_protocol"}], "paper_keywords": ["Multi-channel routing", " Channel assignment", " Modular exponentiation congruence", " Frequency diversity"], "paper_abstract": "This article proposes an intersection-aware channel assignment and routing protocol for wireless ad hoc networks with a single transceiver. This protocol increases the network capacity of an IEEE 802.11 network by exploiting frequency diversity. Using the proposed protocol, multiple communications can simultaneously take place in a region without interfering with each other. However, it must avoid a multi-channel hidden terminal problem for designing channel assignment and routing protocol. This paper considers issues regarding multiple channels at the network layer, assuming a single channel MAC protocol such as IEEE 802.11 DCF. Also, the proposed protocol assumes that each node in the network is equipped with a single transceiver. This set of assumptions is very practical, because most devices have a single wireless card implementing the IEEE 802.11 DCF protocol. Each node uses modular exponentiation congruence to represent the channel schedule, which assures that each pair of nodes has common channels for communication in every cycle. Each node switches across channels in such a manner that each pair of nodes works on the same channel when they desire to communicate; otherwise they work on a different channel, and hence do not interfere with each other. However, for the intersecting node, there is no benefit in using single radio multiple channels since the capacity around the intersection node can at most be O (W), W is the link capacity, regardless of the number of channels. The protocol lets the intersecting node always work on the same channel whereas the nonintersecting node can work on different channels. The two states for every node in the network are the state of an intersecting node and the state of non-intersecting node. Using the proposed protocol, nodes discover multiple routes to the destination node; the node selects the path with most intersecting nodes to avoid more nodes become intersecting nodes when the number of flows increases greatly. Once a node becomes an intersecting node, it will work on the same channel in a cycle. Simulation results show that the proposed protocol significantly increases the aggregate end-to-end throughput and network capacity greatly over a single-channel protocol and some other channel assignment and routing protocols in several wireless networking scenarios.", "paper_title": "Intersection-Aware Channel Assignment and Routing in Multi-Channel Multi-Hop Wireless Networks with a Single Transceiver", "paper_id": "WOS:000265103800024"}