{"auto_keywords": [{"score": 0.04925653227018551, "phrase": "coastline_recession"}, {"score": 0.008713768692145013, "phrase": "new_methodology"}, {"score": 0.005888509736882696, "phrase": "proposed_method"}, {"score": 0.004364446928620496, "phrase": "best_indicators"}, {"score": 0.004314285113050873, "phrase": "coastal_erosion"}, {"score": 0.00402514392911723, "phrase": "dynamic_segmentation_approach"}, {"score": 0.003955926499405168, "phrase": "area-based_approach"}, {"score": 0.0029281780903782284, "phrase": "new_method"}, {"score": 0.0025780134737796085, "phrase": "line_segments"}, {"score": 0.0022434880661725493, "phrase": "mean_and_standard_deviation"}, {"score": 0.0021049977753042253, "phrase": "effective_alternative_method"}], "paper_keywords": ["Coastline recession", " Shoreline change", " Buffering method", " Non-linear least squares"], "paper_abstract": "Coastline recession is one of the best indicators of coastal erosion. Three methods for computing coastline recession - the baseline approach, the dynamic segmentation approach and the area-based approach - have been used, each of which has one or more drawbacks. To overcome these problems, a new methodology for measuring coastline recession is proposed, using buffering and non-linear least squares estimation. The proposed method was compared with the three existing methods with respect to two simulated cases and two real coastlines. Test results confirmed that the new method is more reliable than the three other methods, all of which are susceptible to variability of recession, scale, number of line segments, length of coastlines and direction of the baseline. The proposed method, incorporating two physically meaningful values - magnitude and variability of coastline recession according to the mean and standard deviation of coastline offsets, respectively - presents itself as an effective alternative method of assessing coastline recession.", "paper_title": "A new methodology for measuring coastline recession using buffering and non-linear least squares estimation", "paper_id": "WOS:000269605700004"}