{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "linguistic_scale"}, {"score": 0.004252707756312684, "phrase": "linguistic_expressions"}, {"score": 0.004162602203448056, "phrase": "evaluation_process"}, {"score": 0.003988055287053139, "phrase": "decision_maker's_preference_structure"}, {"score": 0.0038044630943383497, "phrase": "subjective_information"}, {"score": 0.0037719988989298983, "phrase": "intrinsic_uncertainties"}, {"score": 0.003692040748097991, "phrase": "human_judgments"}, {"score": 0.0034179225740833055, "phrase": "linguistic_terms"}, {"score": 0.003288567185099276, "phrase": "semantic_values"}, {"score": 0.003177687211289478, "phrase": "decision_makers"}, {"score": 0.0029797347088361056, "phrase": "group_decision-making_approach"}, {"score": 0.0027940789980683, "phrase": "decision_context"}, {"score": 0.0027347937102326285, "phrase": "modeling_process"}, {"score": 0.0026882700311968025, "phrase": "mathematical_meaning"}, {"score": 0.0025315664299815537, "phrase": "voting_procedure"}, {"score": 0.0024252458095689847, "phrase": "specific_group"}, {"score": 0.0023035249767734286, "phrase": "heterogeneous_groups"}], "paper_keywords": ["Group decision", " Linguistic Decision Analysis", " Linguistic modeling"], "paper_abstract": "In most voting procedures, the evaluation of a candidate is determined by counting the votes without considering any information about the intensity of preference. The use of linguistic expressions in voting makes the evaluation process friendlier, enables the intensity of preference in a decision maker's preference structure to be taken into account, and better captures the subjective information and intrinsic uncertainties that are inherent in human judgments. The quality of the decision will depend on the quality of the information obtained from the linguistic terms and expressions used in the evaluations, the semantic values of which should be representative of how decision makers interpret these within the context in which the language is being applied. The group decision-making approach proposed includes a method for constructing a linguistic scale in which the individuals and the decision context are inserted into the modeling process to determine the mathematical meaning of the terms used in the scale. The approach also includes a voting procedure based on the linguistic scale that was constructed for a specific group and context. The approach is appropriate for supporting decisions with heterogeneous groups, such as decisions involving society in general, because it provides a simple, complete and transparent way for assessing the alternatives. (C)2014 Elsevier Inc. All rights reserved.", "paper_title": "A group decision-making approach using a method for constructing a linguistic scale", "paper_id": "WOS:000343345500025"}