{"auto_keywords": [{"score": 0.04425618028201676, "phrase": "vectorial_approach"}, {"score": 0.018519947344424352, "phrase": "initial_orientation"}, {"score": 0.009474192636368438, "phrase": "matrical_approach"}, {"score": 0.004652016085325825, "phrase": "three-dimensional_motion"}, {"score": 0.004443276312972159, "phrase": "final_orientation"}, {"score": 0.004354910160382692, "phrase": "initial_joint_angles"}, {"score": 0.0043299856054821355, "phrase": "final_joint_angles"}, {"score": 0.004171402455813099, "phrase": "three-dimensional_movements"}, {"score": 0.004030157055463817, "phrase": "joint_range"}, {"score": 0.003972720096368191, "phrase": "rotation_matrix"}, {"score": 0.003946847965755066, "phrase": "distal_segment"}, {"score": 0.003912998909919555, "phrase": "proximal_segment"}, {"score": 0.003673451784862018, "phrase": "angle_sequence"}, {"score": 0.0034216381828892696, "phrase": "insubstantial_errors"}, {"score": 0.003277327351139926, "phrase": "theoretical_justification"}, {"score": 0.003139083793966207, "phrase": "main_findings"}, {"score": 0.0029214769181390653, "phrase": "human_joints"}, {"score": 0.002236055625099805, "phrase": "large_angle"}, {"score": 0.0022104795254900746, "phrase": "first_axis"}, {"score": 0.002166421738415464, "phrase": "specific_criteria"}, {"score": 0.0021049977753042253, "phrase": "movement_analysis"}], "paper_keywords": ["rotation matrix", " three-dimensional kinematics", " range of motion", " joint angles"], "paper_abstract": "To determine the range of motion of a joint between an initial orientation and a final orientation, it is convenient to subtract initial joint angles from final joint angles, a method referred to as the vectorial approach. However, for three-dimensional movements, the vectorial approach is not mathematically correct. To determine the joint range of motion, the rotation matrix between the two orientations should be calculated, and angles describing the range of motion should be extracted from this matrix, a method referred to as the matrical approach. As the matrical approach is less straightforward to implement, it is of interest to identify situations in which the vectorial approach leads to insubstantial errors. In this study, the vectorial approach was compared to the matrical approach, and theoretical justification was given for situations in which the vectorial approach can reasonably be used. The main findings are that the vectorial approach can be used if (1) the motion is planar (Woltring HJ. 1994. 3-D attitude representation of human joints: a standardization proposal. J Biomech 27(12): 1399-1414), (2) the angles between the final and the initial orientation are small (Woltring HJ. 1991. Representation and calculation of 3-D joint movement. Hum Mov Sci 10(5): 603-616), (3) the angles between the initial orientation of the distal segment and the proximal segment are small and finally (4) when only one large angle occurs between the initial orientation of the distal segment and the proximal segment and the angle sequence is chosen in such a way that this large angle occurs on the first axis of rotation. These findings provide specific criteria to consider when choosing the angle sequence to use for movement analysis.", "paper_title": "Can one angle be simply subtracted from another to determine range of motion in three-dimensional motion analysis?", "paper_id": "WOS:000334049100006"}