{"auto_keywords": [{"score": 0.03760584903191966, "phrase": "free_access"}, {"score": 0.014832033159351785, "phrase": "jamia_articles"}, {"score": 0.010612387000973441, "phrase": "biomedical_informatics"}, {"score": 0.004202741104973709, "phrase": "generalist_biomedical_informatics_journals"}, {"score": 0.004072851768196397, "phrase": "scientific_community"}, {"score": 0.0035361001070845677, "phrase": "biomedical_informatics_articles"}, {"score": 0.003444732262403694, "phrase": "significant_way"}, {"score": 0.0033381913087533457, "phrase": "informed_decisions"}, {"score": 0.003303412571939192, "phrase": "unlock_fees"}, {"score": 0.003251920460276645, "phrase": "journal_owners"}, {"score": 0.0031348622158167195, "phrase": "open_access"}, {"score": 0.002637160140011997, "phrase": "article_dissemination"}, {"score": 0.0023254633298356894, "phrase": "significant_change"}, {"score": 0.0021496083700137305, "phrase": "positive_association"}, {"score": 0.0021049977753042253, "phrase": "citation_rate"}], "paper_keywords": [""], "paper_abstract": "Biomedical informatics is a young, highly interdisciplinary field that is evolving quickly. It is important to know which published topics in generalist biomedical informatics journals elicit the most interest from the scientific community, and whether this interest changes over time, so that journals can better serve their readers. It is also important to understand whether free access to biomedical informatics articles impacts their citation rates in a significant way, so authors can make informed decisions about unlock fees, and journal owners and publishers understand the implications of open access. The topics and JAMIA articles from years 2009 and 2010 that have been most cited according to the Web of Science are described. To better understand the effects of free access in article dissemination, the number of citations per month after publication for articles published in 2009 versus 2010 was compared, since there was a significant change in free access to JAMIA articles between those years. Results suggest that there is a positive association between free access and citation rate for JAMIA articles.", "paper_title": "Trends in biomedical informatics: most cited topics from recent years", "paper_id": "WOS:000299871300027"}