{"auto_keywords": [{"score": 0.04715515140798055, "phrase": "e-business_use"}, {"score": 0.00481495049065317, "phrase": "e-business_adoption"}, {"score": 0.004788702191163057, "phrase": "european"}, {"score": 0.00474953919834177, "phrase": "purpose_-_the_purpose"}, {"score": 0.004423392979866108, "phrase": "changing_strategy"}, {"score": 0.004245476558619167, "phrase": "seven_european_countries"}, {"score": 0.004041359131062721, "phrase": "biprobit_estimation"}, {"score": 0.0038470175104007524, "phrase": "findings_-_results"}, {"score": 0.0037533665683654113, "phrase": "firm's_strategy"}, {"score": 0.0035630518377071916, "phrase": "main_factors"}, {"score": 0.0034572968057822633, "phrase": "perceived_benefits"}, {"score": 0.0032909488752766503, "phrase": "main_limitation"}, {"score": 0.0030646542093266103, "phrase": "practical_implications"}, {"score": 0.002925149105307855, "phrase": "additional_factors"}, {"score": 0.0028227569217197926, "phrase": "different_level"}, {"score": 0.0026942333853202556, "phrase": "higher_level"}, {"score": 0.0025434985496917604, "phrase": "-_most_research"}, {"score": 0.0024679299547216956, "phrase": "single_country"}, {"score": 0.0024143815950383647, "phrase": "new_evidence"}, {"score": 0.0022980978400845144, "phrase": "previous_research"}, {"score": 0.0021694774708817498, "phrase": "internal_impact"}, {"score": 0.002122391060295923, "phrase": "first_approximation"}, {"score": 0.0021049977753042253, "phrase": "general_areas"}], "paper_keywords": ["Europe", " Electronic commerce", " Retail management", " Organizational implications", " E-business use", " European retailers", " Cross-country analysis"], "paper_abstract": "Purpose - The purpose of this paper is to contribute to the discussion related to the antecedents of the extent of e-business use and the effect of this level on changing strategy, management and marketing. Design/methodology/approach - The authors use data from 691 retailers in seven European countries. Information is obtained from the survey of the \"e-Business W@tch\". Data analysis was performed using biprobit estimation. The sample is divided into two groups depending on the level of e-commerce of the countries. Findings - Results suggest that the e-business use implies changes in the firm's strategy, management and marketing in all the countries studied. Differences between the two groups of countries are minimal. The main factors that influence the level of e-business use are IT expertise and perceived benefits. Research limitations/implications - The limitations are related to the nature of the data and concretely the main limitation lies in the consequences construct. The data provided are very general and it would be useful to specify what kind of change is generated. Practical implications - Antecedents of the level of use are similar for all the countries, so there might be additional factors that explain why, in some countries, retailers have adopted a different level of e-business. Managers have to take into account that the adoption and use of a higher level of e-business requires changes in all the functional areas. The decision of adopting and using e-business should be taken seriously. Originality/value - Most research has focused on analyzing the antecedents of e-business use in a single country. However, this paper presents some new evidence on the factors that influence the extent of e-business use for two groups of countries. Furthermore, previous research has suggested that changes might be necessary within the firm due to the e-business use but there is little empirical evidence on the internal impact of e-business use. This paper provides a first approximation to the general areas in which managers had to made changes.", "paper_title": "Antecedents and consequences of e-business adoption for European retailers", "paper_id": "WOS:000312470700001"}