{"auto_keywords": [{"score": 0.031369790019902345, "phrase": "content-based_and_collaborative_filtering_algorithms"}, {"score": 0.00481495049065317, "phrase": "effective_filtering"}, {"score": 0.004701015188740582, "phrase": "recommendation_techniques"}, {"score": 0.004589763483242731, "phrase": "electronic_commerce"}, {"score": 0.00407161650109722, "phrase": "similar_users"}, {"score": 0.003677280504320636, "phrase": "memory-based_collaborative_filtering_algorithms_declines"}, {"score": 0.0034633412134999425, "phrase": "time_complexity"}, {"score": 0.0033011569787033297, "phrase": "prediction_phase"}, {"score": 0.003109031770476385, "phrase": "genre-based_fuzzy_inference_filtering_approach"}, {"score": 0.0026600905156986317, "phrase": "hybrid_approach"}, {"score": 0.002373472641477602, "phrase": "computation_time"}, {"score": 0.0022758279600841014, "phrase": "a-cut_approach"}, {"score": 0.0021304214257321, "phrase": "interactive_movie_recommendation_system"}], "paper_keywords": ["Hybrid filtering", " fuzzy inference", " recommendation", " sparse rating"], "paper_abstract": "Recommendation techniques are utilized in electronic commerce because of their potential commercial value. Many e-commerce sites employ collaborative filtering techniques to provide recommendations to customers based on the preferences of similar users. However, as the number of customers and the range of products increase, the prediction accuracy of memory-based collaborative filtering algorithms declines because of sparse ratings. In addition, the time complexity of such algorithms is quite high in the prediction phase. To resolve these issues, we propose a genre-based fuzzy inference filtering approach for predicting movie preferences. We use content-based and collaborative filtering algorithms as baseline methods to evaluate the performance of our approach. The results of experiments demonstrate that the hybrid approach exploits the strengths of the content-based and collaborative filtering algorithms to achieve effective filtering in terms of precision. Moreover, the computation time can be reduced by using the a-cut approach. The findings have implications for the design of an interactive movie recommendation system for the World Wide Web.", "paper_title": "A genre-based fuzzy inference approach for effective filtering of movies", "paper_id": "WOS:000327249300010"}