{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_sequential_fuzzy_extreme_learning_machine"}, {"score": 0.04954756810706401, "phrase": "function_approximation"}, {"score": 0.0041642891310893, "phrase": "classification_problems"}, {"score": 0.00389427992231721, "phrase": "generalized_single_hidden-layer_feedforward_network"}, {"score": 0.003641713874009232, "phrase": "os-fuzzy-elm_algorithm"}, {"score": 0.0034245614958572012, "phrase": "bounded_nonconstant_piecewise_continuous_membership_function"}, {"score": 0.0031845067058084583, "phrase": "input_data"}, {"score": 0.002618366076489732, "phrase": "corresponding_consequent_parameters"}, {"score": 0.0025461386232786356, "phrase": "performance_comparisons"}, {"score": 0.0024075916292945715, "phrase": "real-world_benchmark_problems"}, {"score": 0.002341164727388944, "phrase": "nonlinear_system_identification"}, {"score": 0.002189105604712615, "phrase": "proposed_os-fuzzy-elm"}], "paper_keywords": ["Extreme learning machine (ELM)", " fuzzy inference system (FIS)", " online sequential ELM (OS-ELM)", " online sequential fuzzy ELM (OS-Fuzzy-ELM)"], "paper_abstract": "In this correspondence, an online sequential fuzzy extreme learning machine (OS-Fuzzy-ELM) has been developed for function approximation and classification problems. The equivalence of a Takagi-Sugeno-Kang (TSK) fuzzy inference system (FIS) to a generalized single hidden-layer feedforward network is shown first, which is then used to develop the OS-Fuzzy-ELM algorithm. This results in a FIS that can handle any bounded nonconstant piecewise continuous membership function. Furthermore, the learning in OS-Fuzzy-ELM can be done with the input data coming in a one-by-one mode or a chunk-by-chunk (a block of data) mode with fixed or varying chunk size. In OS-Fuzzy-ELM, all the antecedent parameters of membership functions are randomly assigned first, and then, the corresponding consequent parameters are determined analytically. Performance comparisons of OS-Fuzzy-ELM with other existing algorithms are presented using real-world benchmark problems in the areas of nonlinear system identification, regression, and classification. The results show that the proposed OS-Fuzzy-ELM produces similar or better accuracies with at least an order-of-magnitude reduction in the training time.", "paper_title": "Online Sequential Fuzzy Extreme Learning Machine for Function Approximation and Classification Problems", "paper_id": "WOS:000267865200022"}