{"auto_keywords": [{"score": 0.03780083001021273, "phrase": "role-based_innovators_market_game"}, {"score": 0.027412986283269016, "phrase": "low_relative_information"}, {"score": 0.00481495049065317, "phrase": "role-based_game"}, {"score": 0.004549734943142138, "phrase": "embodied_trigger"}, {"score": 0.004401794742140806, "phrase": "behavioral_change"}, {"score": 0.004178935413340453, "phrase": "shikakes"}, {"score": 0.003930000775297499, "phrase": "innovators_market_game"}, {"score": 0.003820144626025562, "phrase": "new_ideas"}, {"score": 0.003766369160795001, "phrase": "existent_ideas"}, {"score": 0.003678414118674967, "phrase": "new_method"}, {"score": 0.0033465923623290034, "phrase": "real_world"}, {"score": 0.00297346171320082, "phrase": "acting_roles"}, {"score": 0.0027567336518542858, "phrase": "practical_problems"}, {"score": 0.0023694065215394593, "phrase": "algorithm_relativeness"}, {"score": 0.002155412043665635, "phrase": "shikake"}, {"score": 0.0021049977753042253, "phrase": "evaluation_method"}], "paper_keywords": ["Combination", " Creativity", " Thinking method", " Chance discovery", " Innovators marketplace", " Shikakeology"], "paper_abstract": "A \"Shikake\" is an embodied trigger for the person to lead a behavioral change. We can say methods of creation are combinations of Shikakes, designed to encourage participants to find issues and create solutions. Innovators market game is a method for creating new ideas by combining existent ideas. We propose a new method for creating ideas, Role-based Innovators Market Game. In the game, players take part in the role selected from the real world, e.g., journalists, government, and doctors. Players create ideas based on their own roles through communications with other players. The rules, acting roles, and communication make players more creative and imaginative. Players can discover and solve practical problems, and improve their creative and imaginative skills through this activity. The result suggests that combining low relative information may be high evaluated in the situation of creating ideas. The low relative information is calculated by the algorithm Relativeness. In this study, we design Role-based Innovators Market Game and show the functions and the relations of factors worked as Shikake, and propose the evaluation method of ideas, Relativeness.", "paper_title": "Shikakeological approach of innovators marketplace as role-based game and evaluation method for solutions", "paper_id": "WOS:000365105300005"}