{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "triggered_message_sequence_charts"}, {"score": 0.004445739135694758, "phrase": "scenario-based_system_requirements"}, {"score": 0.004296264970612285, "phrase": "message_sequence_charts"}, {"score": 0.004128192012388041, "phrase": "graphical_depictions"}, {"score": 0.0038551626276406175, "phrase": "distributed_system"}, {"score": 0.002784755056588371, "phrase": "tmsc_notation"}, {"score": 0.002690975370565776, "phrase": "composition_operators"}, {"score": 0.002585539416877115, "phrase": "scenario_specifications"}, {"score": 0.0025127604406208668, "phrase": "different_scenarios"}, {"score": 0.002414290278501595, "phrase": "first_part"}, {"score": 0.0021413855297794946, "phrase": "second_part"}, {"score": 0.0021049977753042253, "phrase": "mathematical_underpinnings"}], "paper_keywords": ["Message Sequence Charts", " scenarios", " requirements modeling", " formal semantics", " refinement"], "paper_abstract": "This paper introduces Triggered Message Sequence Charts (TMSCs), a graphical, mathematically well-founded framework for capturing scenario-based system requirements of distributed systems. Like Message Sequence Charts (MSCs), TMSCs are graphical depictions of scenarios, or exchanges of messages between processes in a distributed system. Unlike MSCs, however, TMSCs are equipped with a notion of trigger that permits requirements to be made conditional, a notion of partiality indicating that a scenario may be subsequently extended, and a notion of refinement for assessing whether or not a more detailed specification correctly elaborates on a less detailed one. The TMSC notation also includes a collection of composition operators allowing structure to be introduced into scenario specifications so that interactions among different scenarios may be studied. In the first part of this paper, TMSCs are introduced and their use in support of requirements modeling is illustrated via two extended examples. The second part develops the mathematical underpinnings of the language.", "paper_title": "Triggered Message Sequence Charts", "paper_id": "WOS:000240351700006"}