{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "supervisory_policies"}, {"score": 0.013548197506034275, "phrase": "proc"}, {"score": 0.013414216138812036, "phrase": "ieee"}, {"score": 0.008570782125971853, "phrase": "partially-controlled_fcpns"}, {"score": 0.004695900553353526, "phrase": "partially_controlled_free-choice_petri_nets"}, {"score": 0.0044219992735047954, "phrase": "free-choice_petri_net"}, {"score": 0.003113441660343867, "phrase": "partially_controlled_fcpns"}, {"score": 0.003066945490483524, "phrase": "external_agent"}, {"score": 0.0027741761880779535, "phrase": "partially_controlled_fcpn."}, {"score": 0.002496722870659199, "phrase": "supervisory_synthesis_problem"}, {"score": 0.0024348510123716424, "phrase": "choice-controlled_fcpns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["supervisory control", " Petri nets"], "paper_abstract": "Every arc from a place to a transition in a Free-Choice Petri net (FCPN) is either the unique output arc of the place, or, the unique input arc to the transition [M.H.T. Hack, Analysis of production schemata by Petri nets, Master's thesis, Massachusetts Institute of Technology, February 1972; W. Reisig, Petri Nets, Springer-Verlag, Berlin, 1985; T. Murata, Petri nets: properties, analysis and applications, Proc. IEEE 77 (4) (1989) 541-580]. We consider FCPNs that are not live [J.L. Peterson, Petri Net Theory and the Modeling of Systems, Prentice-Hall, Englewood Cliffs, NJ, 1981; W. Reisig, Petri Nets, Springer-Verlag, Berlin, 1985; T. Murata, Petri nets: properties, analysis and applications, Proc. IEEE 77 (4) (1989) 541-580], and we investigate the existence of supervisory policies that can enforce liveness in partially controlled FCPNs. The external agent, or supervisor, can only prevent the firing of some (i.e. not all) transitions in a partially controlled FCPN. We first present an observation on supervisory policies that enforce liveness in partially-controlled FCPNs. Using this observation, we solve the supervisory synthesis problem for the family of choice-controlled FCPNs, defined in this paper. We then identify a new, sub-class of partially-controlled FCPNs that posses an easily-characterized (and easily-enforced) supervisory policy that enforces liveness. (c) 2005 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Some observations on supervisory policies that enforce liveness in partially controlled Free-Choice Petri nets", "paper_id": "WOS:000235682800003"}