{"auto_keywords": [{"score": 0.03427865092078709, "phrase": "dynamic_threshold"}, {"score": 0.033548531745680885, "phrase": "solution_density"}, {"score": 0.026881613285045625, "phrase": "population_fitness"}, {"score": 0.00481495049065317, "phrase": "genetic_algorithms"}, {"score": 0.004761850836420121, "phrase": "ranked_populations"}, {"score": 0.003668859054928118, "phrase": "static_and_dynamic_selection_thresholds"}, {"score": 0.0035290250358997904, "phrase": "genetic_algorithm"}, {"score": 0.0034904699804007696, "phrase": "ga"}, {"score": 0.0030715948036518603, "phrase": "lower_static_threshold"}, {"score": 0.0029544572689681934, "phrase": "information_source"}, {"score": 0.002794802975530612, "phrase": "static_threshold"}, {"score": 0.002763919794139171, "phrase": "randomly_generated_individuals"}, {"score": 0.0025570607111118793, "phrase": "consequent_improvement"}, {"score": 0.0023920904611571783, "phrase": "randomly_selected_individuals"}, {"score": 0.002225334593038328, "phrase": "dynamic_behavior"}, {"score": 0.0021049977753042253, "phrase": "simulation_and_benchmark_problems"}], "paper_keywords": ["Genetic algorithms", " information theory", " solution density", " ranked populations", " selection thresholds", " selection pressure", " ranking"], "paper_abstract": "Mutation applied indiscriminately across a population has, on average, a detrimental effect on the accumulation of solution alleles within the population and is usually beneficial only when targeted at individuals with few solution alleles. Many common selection techniques can delete individuals with more solution alleles than are easily recovered by mutation. The paper identifies static and dynamic selection thresholds governing accumulation of information in a genetic algorithm (GA). When individuals are ranked by fitness, there exists a dynamic threshold defined by the solution density of surviving individuals and a lower static threshold defined by the solution density of the information source used for mutation. Replacing individuals ranked below the static threshold with randomly generated individuals avoids the need for mutation while maintaining diversity in the population with a consequent improvement in population fitness. By replacing individuals ranked between the thresholds with randomly selected individuals from above the dynamic threshold, population fitness improves dramatically. We model the dynamic behavior of GAs using these thresholds and demonstrate their effectiveness by simulation and benchmark problems.", "paper_title": "Static and Dynamic Selection Thresholds Governing the Accumulation of Information in Genetic Algorithms Using Ranked Populations", "paper_id": "WOS:000277101800003"}