{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.0480015295510878, "phrase": "secure_bootstrapping"}, {"score": 0.004815315858763141, "phrase": "distributed"}, {"score": 0.00464487614824562, "phrase": "constructions"}, {"score": 0.00445997627516653, "phrase": "challenging_problem"}, {"score": 0.004370973501074594, "phrase": "network_users"}, {"score": 0.004232232993872917, "phrase": "trust_relationships"}, {"score": 0.004164516065972361, "phrase": "network_deployment"}, {"score": 0.003734810936407523, "phrase": "numerous_proposals"}, {"score": 0.003660226272906374, "phrase": "common_understanding"}, {"score": 0.003616189733352126, "phrase": "proposed_schemes"}, {"score": 0.0032956583072431423, "phrase": "clear_idea"}, {"score": 0.0026715589067557526, "phrase": "proposed_framework"}, {"score": 0.002607598760956807, "phrase": "good_basis"}, {"score": 0.0025554669315362424, "phrase": "new_manet_bootstrapping_schemes"}, {"score": 0.0024052270356036743, "phrase": "distributed_bootstrapping_schemes"}, {"score": 0.0022546720211200893, "phrase": "relevant_bootstrapping_schemes"}, {"score": 0.0021566565951738658, "phrase": "relevant_system_parameters"}, {"score": 0.0021306709646058295, "phrase": "random_walk"}], "paper_keywords": ["Security", " MANETs", " security bootstrapping", " secure communication"], "paper_abstract": "Secure bootstrapping of mobile ad hoc networks (MANETs) is a challenging problem in scenarios in which network users (or nodes) do not share trust relationships prior to the network deployment. In recent years, a number of schemes have been proposed to solve this problem, assuming either no or limited trust between the nodes prior to their deployment. Despite numerous proposals, there is no common understanding of the proposed schemes and of the trade-offs that they provide. This has consequences for both researchers and practitioners, who do not have a clear idea how to compare the schemes and how to select a scheme for a given application. In this article, we present a framework that helps in understanding and comparing schemes for secure bootstrapping of MANETs. The framework is general because it is policy-neutral and can accommodate many existing bootstrapping schemes. The proposed framework can equally serve as a good basis for the development of new MANET bootstrapping schemes; we show how the development of the framework leads to two new (classes of) distributed bootstrapping schemes. Within the framework, we not only investigate and characterize the properties of the relevant bootstrapping schemes, but also give methods for practitioners to select the relevant system parameters in the Random Walk and the (Restricted) Random Waypoint mobility models.", "paper_title": "Distributed and Secure Bootstrapping of Mobile Ad Hoc Networks: Framework and Constructions", "paper_id": "WOS:000263099900002"}