{"auto_keywords": [{"score": 0.050076272197927096, "phrase": "pedestrian_movement"}, {"score": 0.048613069547930016, "phrase": "israel"}, {"score": 0.02768637916701603, "phrase": "pedestrian_volume"}, {"score": 0.004751216062917875, "phrase": "pedestrian_movement_models"}, {"score": 0.004709193603747991, "phrase": "pre-modern_and_modern_neighborhoods"}, {"score": 0.004544770921520536, "phrase": "urban_areas"}, {"score": 0.004405596416783185, "phrase": "pre-modern_planning"}, {"score": 0.004158290806404304, "phrase": "modern_planning_doctrines"}, {"score": 0.00408501512749186, "phrase": "functional_hierarchy"}, {"score": 0.003995226376780718, "phrase": "neighborhood_unit_concept"}, {"score": 0.0038728151007982378, "phrase": "pre-modem_non-hierarchical_street-based_planning"}, {"score": 0.003359119985242403, "phrase": "observed_pedestrian_volume"}, {"score": 0.003299880298525127, "phrase": "different_axial-"}, {"score": 0.0030868583963299698, "phrase": "street_network"}, {"score": 0.0029133627624098064, "phrase": "pre-modern_neighborhoods"}, {"score": 0.0027252240573281163, "phrase": "street_network's_syntactic_attributes"}, {"score": 0.00221068461235127, "phrase": "self-organized_circular_causality"}, {"score": 0.0021049977753042253, "phrase": "modern_planned_neighborhoods"}], "paper_keywords": ["pedestrian volume modeling", " space syntax", " planning approach", " Israeli cities"], "paper_abstract": "Most pedestrian movement volume models were constructed for urban areas that developed on the basis of pre-modern planning. In this paper, we confront neighborhoods that were built upon modern planning doctrines, combining the functional hierarchy of streets with the neighborhood unit concept, with neighborhoods that developed from pre-modem non-hierarchical street-based planning. We use space syntax analysis to investigate how their street network's structural attributes interact with pedestrian movement distribution. The investigation was conducted in 14 neighborhoods from 4 cities in Israel by examining the correlation of observed pedestrian volume with models using different axial- and segment-based topological, angular, and metric syntactic attributes across different radii (scales). The results indicate that the street network and the distribution of pedestrian movement interact differently in the two neighborhood types. In pre-modern neighborhoods: (i) there is significantly more walking; (ii) the street network's syntactic attributes tend to be much more consistent in their correlation with pedestrian volume across all scales; (iii) the correlation of pedestrian volume with these attributes and with commerce is relatively high; and (iv) pedestrian movement distribution is more predictable. We relate these differences to the absence of a self-organized circular causality between street network structure, commerce, and movement in modern planned neighborhoods.", "paper_title": "The impact of planning on pedestrian movement: contrasting pedestrian movement models in pre-modern and modern neighborhoods in Israel", "paper_id": "WOS:000361533100005"}