{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local_shape_descriptors"}, {"score": 0.003685067218455088, "phrase": "existing_descriptors"}, {"score": 0.003493021648360933, "phrase": "detailed_evaluation"}, {"score": 0.003092842645798083, "phrase": "mesh_resolution"}, {"score": 0.002931569771634119, "phrase": "discriminatory_ability"}, {"score": 0.0028195727965553367, "phrase": "shape_matching"}, {"score": 0.002685558057339722, "phrase": "shape_classification_task"}, {"score": 0.00259554612218815, "phrase": "normal_distribution"}, {"score": 0.0025578967205807843, "phrase": "mean_curvature"}, {"score": 0.0024126686412257407, "phrase": "principal_components_analysis"}], "paper_keywords": ["Spin images", " Shape descriptors", " Mean curvature", " Gaussian curvature", " Feature detection"], "paper_abstract": "Local shape descriptors can be used for a variety of tasks, from registration to comparison to shape analysis and retrieval. There have been a variety of local shape descriptors developed for these tasks, which have been evaluated in isolation or in pairs, but not against each other. We provide a survey of existing descriptors and a framework for comparing them. We perform a detailed evaluation of the descriptors using real data sets from a variety of sources. We first evaluate how stable these metrics are under changes in mesh resolution, noise, and smoothing. We then analyze the discriminatory ability of the descriptors for the task of shape matching. Finally, we compare the descriptors on a shape classification task. Our conclusion is that sampling the normal distribution and the mean curvature, using 25 samples, and reducing this data to 5-10 samples via Principal Components Analysis, provides robustness to noise and the best shape discrimination results. For shape classification, mean curvature sampled at the vertex or averaged, and the more global Shape Diameter Function, performed the best.", "paper_title": "Comparing local shape descriptors", "paper_id": "WOS:000307284700003"}