{"auto_keywords": [{"score": 0.04622076352597457, "phrase": "knowledge_exchange"}, {"score": 0.00481495049065317, "phrase": "interdisciplinary_collaborations"}, {"score": 0.004776669953449352, "phrase": "interdisciplinary_collaboration"}, {"score": 0.004701015188740582, "phrase": "particular_interest"}, {"score": 0.004663636232080366, "phrase": "science_and_social_science_research"}, {"score": 0.004153739859461064, "phrase": "knowledge_management"}, {"score": 0.003927848423072668, "phrase": "common_goal"}, {"score": 0.0031277316566463978, "phrase": "five_to_eight_others"}, {"score": 0.0028529310661977577, "phrase": "factual_knowledge"}, {"score": 0.002686821995335494, "phrase": "important_exchanges"}, {"score": 0.0024408799645640323, "phrase": "new_ideas"}, {"score": 0.0021734768728417977, "phrase": "different_kinds_knowledge"}, {"score": 0.0021049977753042253, "phrase": "disciplinary_boundaries"}], "paper_keywords": [""], "paper_abstract": "Interdisciplinary collaboration has become of particular interest as science and social science research increasingly crosses traditional boundaries, raising issues about what kinds of information and knowledge exchange occurs, and thus what to support. Research on interdisciplinarity, learning, and knowledge management suggest the benefits of collaboration are achieved when individuals pool knowledge toward a common goal. Yet, it is not sufficient to say that knowledge exchange must take place; instead, we need to ask what kinds of exchanges form the basis of collaboration in these groups. To explore this, members of three distributed, interdisciplinary teams (one science and two social science teams) were asked what they learned from the five to eight others with whom they worked most closely, and what they thought those others learned from them. Results show the exchange of factual knowledge to be only one of a number of learning exchanges that support the team. Important exchanges also include learning the process of doing something, learning about methods, engaging jointly in research, learning about technology, generating new ideas, socialization into the profession, accessing a network of contacts, and administration work. Distributions of these relations show that there is more sharing of similar than different kinds knowledge, suggesting that knowledge may flow across disciplinary boundaries along lines of practice.", "paper_title": "Learning and knowledge networks in interdisciplinary collaborations", "paper_id": "WOS:000238005200009"}