{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ct_data"}, {"score": 0.04969089536874819, "phrase": "machine_parts"}, {"score": 0.04507958893647686, "phrase": "car_body_shells"}, {"score": 0.004660702714929615, "phrase": "new_method"}, {"score": 0.004604136423327813, "phrase": "separated_medial_surfaces"}, {"score": 0.004567050624994401, "phrase": "ct"}, {"score": 0.0044025116437190785, "phrase": "plate_structures"}, {"score": 0.004366808573435364, "phrase": "common_mechanical_structures"}, {"score": 0.00407474190126995, "phrase": "surface_models"}, {"score": 0.0038645966233348933, "phrase": "medial_surface_models"}, {"score": 0.003817655499320344, "phrase": "plate_structure"}, {"score": 0.003680212979775528, "phrase": "cad_and_cae_systems"}, {"score": 0.00332375606483146, "phrase": "ct_imaging_technology"}, {"score": 0.0032833625797814474, "phrase": "weak_points"}, {"score": 0.0030386598795433474, "phrase": "ct_scanner"}, {"score": 0.002777949746964955, "phrase": "ct_image"}, {"score": 0.0027441711627551064, "phrase": "mass_distribution"}, {"score": 0.0027108021939930014, "phrase": "cross_section"}, {"score": 0.00260246764210499, "phrase": "image_information"}, {"score": 0.002508663916554954, "phrase": "assembled_parts"}, {"score": 0.00220163445285539, "phrase": "model_shapes"}, {"score": 0.002139638632004415, "phrase": "welded_mechine_parts"}], "paper_keywords": [""], "paper_abstract": "This paper describes a new method for extracting separated medial surfaces from CT (Computed Tomography) data of machine parts. Plate structures are common mechanical structures such as car body shells. When designing such structures in CAD (Computer Aided Design) and CAE (Computer Aided Engineering) systems, their shapes are usually represented as surface models associated with their thickness values. In this research we are aiming at extracting medial surface models of a plate structure from its CT data so as to be used in CAD and CAE systems. However, such a structure consist of many components which are adjacent each other. For example, car body shells are consist of many welded plates. CT imaging technology has some weak points in the area. One of them is that, if there are two or more objects made of same material, CT scanner cannot make the distinction between them. The problem is caused by the principles of CT imaging technology. Because CT image represents the mass distribution within a cross section, we cannot separate the objects only from image information. However, there are many requests for scanning assembled parts and separating objects made of same material. Therefore, we propose a method to separate each components. CT data has not enough information amount as has been metinoned, so we adopt other knowledge about model shapes. We conclude with experiments on welded mechine parts for effectiveness of our method.", "paper_title": "Separated medial surface extraction from CT data of machine parts", "paper_id": "WOS:000239567900022"}