{"auto_keywords": [{"score": 0.034099361893440455, "phrase": "highly_uncertain_data"}, {"score": 0.00481495049065317, "phrase": "attribute_reduction"}, {"score": 0.004747997855358171, "phrase": "traditional_rough_sets"}, {"score": 0.0045208777171271254, "phrase": "discrete_attributes"}, {"score": 0.004304574865291508, "phrase": "real-valued_attributes"}, {"score": 0.004215057618794356, "phrase": "fuzzy_rough_set_model"}, {"score": 0.004069963083642548, "phrase": "real-valued_datasets"}, {"score": 0.0038751504050385183, "phrase": "fuzzy_rough_sets"}, {"score": 0.0036382660173943393, "phrase": "variable_precision_fuzzy_rough_set_model"}, {"score": 0.0026166287606163145, "phrase": "variable_precision_fuzzy_rough_sets"}, {"score": 0.002439308179084911, "phrase": "new_attribute_reduction_approach"}, {"score": 0.0021049977753042253, "phrase": "proposed_reduction_algorithm"}], "paper_keywords": ["Interval type-2 fuzzy sets", " rough sets", " variable precision rough sets", " variable precision interval type-2 fuzzy rough sets", " attribute reduction"], "paper_abstract": "Traditional rough sets only could handle the datasets with discrete attributes, and have difficulty in handling real-valued attributes. The fuzzy rough set model which could deal with real-valued datasets has been introduced. However, fuzzy rough sets are sensitive to misclassification and perturbation. The variable precision fuzzy rough set model was introduced to handle datasets with misclassification and perturbation, but it could not effectively handle highly uncertain data. Interval type-2 fuzzy rough set model is a powerful tool to handle highly uncertain data. However, interval type-2 fuzzy rough set model is sensitive to misclassification. In this paper, the concept of variable precision interval type-2 fuzzy rough sets (VPI2FRS) by combining variable precision fuzzy rough sets and interval type-2 fuzzy rough sets is introduced. Furthermore, a new attribute reduction approach within VPI2FRS framework is developed. In the end, we by experiments demonstrate the feasibility and effectiveness of the proposed reduction algorithm.", "paper_title": "A variable precision interval type-2 fuzzy rough set model for attribute reduction", "paper_id": "WOS:000336491200016"}