{"auto_keywords": [{"score": 0.04760430605028296, "phrase": "cooperation_strategy"}, {"score": 0.02292706481732652, "phrase": "adversarial_environment"}, {"score": 0.010612387000973441, "phrase": "multiple_uavs"}, {"score": 0.009219988534852177, "phrase": "restricted_areas"}, {"score": 0.008631168465458004, "phrase": "cost_function"}, {"score": 0.004330450801016359, "phrase": "threat_exposure"}, {"score": 0.004070573090297285, "phrase": "probabilistic_approach"}, {"score": 0.0036445446531633368, "phrase": "threat_exposure_level"}, {"score": 0.0032342101452939977, "phrase": "total_threat_exposure"}, {"score": 0.003149471116658739, "phrase": "average_distance"}, {"score": 0.0028572658971252616, "phrase": "collision_avoidance"}, {"score": 0.002807118943000936, "phrase": "data-fusion-based_estimation"}, {"score": 0.002721464488351771, "phrase": "noisy_measurements"}, {"score": 0.002697474061842142, "phrase": "simulation_results"}, {"score": 0.002279702500235741, "phrase": "total_threat_exposure_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Tracking", " Motion-planning", " Cooperative systems", " Autonomous vehicles"], "paper_abstract": "This paper presents the development of a cooperation strategy for multiple UAVs to pursue a target moving in an adversarial environment where threat exposure should be minimized, and obstacles and restricted areas should be avoided. A probabilistic approach is used to model the adversarial environment. A cost function is defined to quantify placement of UAVs around the target in formation in terms of threat exposure level and distance to the target. The cost function is used to develop a cooperation strategy for a team of UAVs to follow the target such that the total threat exposure of the team and the average distance to the target throughout the pursuit are minimized according to the weighting coefficients specified. The cooperation strategy has the feature of collision avoidance as well as data-fusion-based estimation of the target trajectory based on noisy measurements. Simulation results have demonstrated that the cooperation reduces the risk of losing the target during the pursuit while avoiding obstacles and restricted areas. Further, the UAVs guided by the cooperation strategy can follow the target closer without increasing the total threat exposure level as compared to cases where the UAVs pursue the target without cooperation. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Cooperative target: pursuit by multiple UAVs in an adversarial environment", "paper_id": "WOS:000297180300003"}