{"auto_keywords": [{"score": 0.03349870335028707, "phrase": "experimental_values"}, {"score": 0.00481495049065317, "phrase": "molecular_dynamics_simulation_package"}, {"score": 0.004794284234356224, "phrase": "gromacs"}, {"score": 0.004732785510739708, "phrase": "widely_used_tool"}, {"score": 0.004652016085325825, "phrase": "broad_range"}, {"score": 0.004612147352416241, "phrase": "different_applications"}, {"score": 0.004231699728933577, "phrase": "gromacs_software"}, {"score": 0.004195418010131832, "phrase": "force_field_agnostic"}, {"score": 0.003751011827704279, "phrase": "spring_concept"}, {"score": 0.003501175642882274, "phrase": "experimental_data"}, {"score": 0.003212074324593725, "phrase": "calculated_physical_properties"}, {"score": 0.00307657476125683, "phrase": "web-_based_database"}, {"score": 0.00295950473406239, "phrase": "liquid_properties"}, {"score": 0.0028468805550323165, "phrase": "opls"}, {"score": 0.002703327151461985, "phrase": "eight_properties"}, {"score": 0.0025014259919355453, "phrase": "constant_volume"}, {"score": 0.0021883400011393564, "phrase": "liquid_structures"}], "paper_keywords": [""], "paper_abstract": "Motivation: The molecular dynamics simulation package GROMACS is a widely used tool used in a broad range of different applications within physics, chemistry and biology. It is freely available, user friendly and extremely efficient. The GROMACS software is force field agnostic, and compatible with many molecular dynamics force fields; coarse- grained, unified atom, all atom as well as polarizable models based on the charge on a spring concept. To validate simulations, it is necessary to compare results from the simulations to experimental data. To ease the process of setting up topologies and structures for simulations, as well as providing pre- calculated physical properties along with experimental values for the same we provide a web- based database, containing 145 organic molecules at present. Results: Liquid properties of 145 organic molecules have been simulated using two different force fields, OPLS all atom and Generalized Amber Force Field. So far, eight properties have been calculated (the density, enthalpy of vaporization, surface tension, heat capacity at constant volume and pressure, isothermal compressibility, volumetric expansion coefficient and the static dielectric constant). The results, together with experimental values are available through the database, along with liquid structures and topologies for the 145 molecules, in the two force fields.", "paper_title": "GROMACS molecule & liquid database", "paper_id": "WOS:000300986600032"}