{"auto_keywords": [{"score": 0.03799635259867219, "phrase": "dr"}, {"score": 0.00481495049065317, "phrase": "visual_cluster"}, {"score": 0.004795772211170926, "phrase": "separation_factors"}, {"score": 0.004626553103375699, "phrase": "visual_cluster_separation_factors"}, {"score": 0.004322967486451877, "phrase": "separation_measures"}, {"score": 0.00405538690701843, "phrase": "dimension_reduction"}, {"score": 0.0038655854071187115, "phrase": "reliable_results"}, {"score": 0.003729065012001506, "phrase": "systematic_qualitative_data_study"}, {"score": 0.003684634192576662, "phrase": "broad_collection"}, {"score": 0.0031402604946939713, "phrase": "real_datasets"}, {"score": 0.0031028232755683674, "phrase": "open_and_axial_coding"}, {"score": 0.0030414140732789186, "phrase": "separability_characteristics"}, {"score": 0.002957471572421436, "phrase": "visual_cluster_separability_factors"}, {"score": 0.0028302049070944944, "phrase": "studied_datasets"}, {"score": 0.002708399936381754, "phrase": "factor_axes"}, {"score": 0.00240213106042981, "phrase": "cluster_factors"}, {"score": 0.0022531762659857507, "phrase": "overarching_factor"}, {"score": 0.0022352169832099153, "phrase": "class_separation"}, {"score": 0.0022085455097790537, "phrase": "resulting_taxonomy"}, {"score": 0.0021049977753042253, "phrase": "cluster_separation_measures"}], "paper_keywords": ["Categories and Subject Descriptors (according to ACM CCS): H.5.0 [Information Interfaces and Presentation]: General", " J.0 [Computer Application]: General"], "paper_abstract": "We provide two contributions, a taxonomy of visual cluster separation factors in scatterplots, and an in-depth qualitative evaluation of two recently proposed and validated separation measures. We initially intended to use these measures to provide guidance for the use of dimension reduction (DR) techniques and visual encoding (VE) choices, but found that they failed to produce reliable results. To understand why, we conducted a systematic qualitative data study covering a broad collection of 75 real and synthetic high-dimensional datasets, four DR techniques, and three scatterplot-based visual encodings. Two authors visually inspected over 800 plots to determine whether or not the measures created plausible results. We found that they failed in over half the cases overall, and in over two-thirds of the cases involving real datasets. Using open and axial coding of failure reasons and separability characteristics, we generated a taxonomy of visual cluster separability factors. We iteratively refined its explanatory clarity and power by mapping the studied datasets and success and failure ranges of the measures onto the factor axes. Our taxonomy has four categories, ordered by their ability to influence successors: Scale, Point Distance, Shape, and Position. Each category is split into Within-Cluster factors such as density, curvature, isotropy, and clumpiness, and Between-Cluster factors that arise from the variance of these properties, culminating in the overarching factor of class separation. The resulting taxonomy can be used to guide the design and the evaluation of cluster separation measures.", "paper_title": "A Taxonomy of Visual Cluster Separation Factors", "paper_id": "WOS:000305604000009"}