{"auto_keywords": [{"score": 0.0370271483774564, "phrase": "inference_attacks"}, {"score": 0.026204257848646835, "phrase": "trust_degree"}, {"score": 0.010504877612890562, "phrase": "trust-based_onion_routing"}, {"score": 0.006177553961356389, "phrase": "trust-based_circuits"}, {"score": 0.004815322347484864, "phrase": "inference"}, {"score": 0.004512512374933493, "phrase": "onion_circuits"}, {"score": 0.00448179813172021, "phrase": "trust-based_routers"}, {"score": 0.004316552692395911, "phrase": "priori_trust_distributions"}, {"score": 0.0041149859710361125, "phrase": "root_cause"}, {"score": 0.004017745870068031, "phrase": "high_probability"}, {"score": 0.003626272370749206, "phrase": "essential_feature"}, {"score": 0.003409880074659807, "phrase": "existing_trust-based_onion_routing"}, {"score": 0.003352088714126572, "phrase": "isolated_model"}, {"score": 0.0033406481167452436, "phrase": "based_analysis"}, {"score": 0.0027116246112603875, "phrase": "exclusive_design_space"}, {"score": 0.0026565317818265394, "phrase": "key_feature"}, {"score": 0.002515014676664348, "phrase": "new_routing_algorithm"}, {"score": 0.0023566987138026285, "phrase": "attackers'_routers"}, {"score": 0.0022234951091677085, "phrase": "real-world_social_networking_datasets"}, {"score": 0.0021049977753042253, "phrase": "real-world_settings"}], "paper_keywords": ["Trust-based onion routing", " Inference attacks", " Anonymity", " Trust degree", " Isolated attack model"], "paper_abstract": "Trust-based onion routing enhances anonymity protection by means of constructing onion circuits using trust-based routers. However, attackers who have the knowledge of a priori trust distributions are still capable of largely reducing the anonymity protected by trust-based circuits. The root cause is that these attackers have a high probability to guess the users who initiate trust-based circuits through the routers trusted by few other users (i.e., inference attacks). In this paper, we uncover trust degree, an essential feature of routing anonymity that is effective in defeating inference attacks but has been overlooked in the design of existing trust-based onion routing. We conduct an isolated model based analysis to understand why the trust degree is effective and how it can be used to resist inference attacks. Our major contributions are three-fold. First, we present a model to exclusively reason about inference attacks in trust-based onion routing. This model isolates the anonymity compromised by inference attacks from other attacks (e.g., correlation-like attacks), and hence derives an exclusive design space that reveals trust degree as the key feature against inference attacks. Second, to show the usefulness of our model, we design a new routing algorithm by taking into account of trust degree. Our algorithm can protect anonymity against inference attacks without sacrificing the capability against attackers' routers. Third, we compare trust-based routing algorithms with and without considering trust degree using real-world social networking datasets. These comparisons present evidence to confirm the effectiveness of trust degree in defeating inference attacks under real-world settings. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Inference attacks against trust-based onion routing: Trust degree to the rescue", "paper_id": "WOS:000329007400024"}