{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "microsoft"}, {"score": 0.00467424463996457, "phrase": "formal_requirements_documentation"}, {"score": 0.004518442937844318, "phrase": "software_products"}, {"score": 0.004240116703465252, "phrase": "actual_implementation"}, {"score": 0.003978866233891427, "phrase": "high-level_topic-based_requirements_traceability"}, {"score": 0.0038624981944755813, "phrase": "version_control_system"}, {"score": 0.003813669883040509, "phrase": "latent_dirichlet_allocation"}, {"score": 0.0037021153060910164, "phrase": "lda_topics"}, {"score": 0.0034738975998176323, "phrase": "industrial_program_managers"}, {"score": 0.003204841443605308, "phrase": "open_source_developers"}, {"score": 0.0031777570808834213, "phrase": "issue_reports"}, {"score": 0.003150900886669123, "phrase": "issue_trackers"}, {"score": 0.002944039482467119, "phrase": "version_control_systems"}, {"score": 0.0025919830205975215, "phrase": "identified_topics"}, {"score": 0.0022434880661725493, "phrase": "high-level_traceability"}, {"score": 0.002177762848946681, "phrase": "version_control"}, {"score": 0.0021501863832966966, "phrase": "topic_analysis"}, {"score": 0.0021049977753042253, "phrase": "actual_stakeholders"}], "paper_keywords": ["LDA", " LDA topics", " User study", " Requirements", " Requirements topic"], "paper_abstract": "Large organizations like Microsoft tend to rely on formal requirements documentation in order to specify and design the software products that they develop. These documents are meant to be tightly coupled with the actual implementation of the features they describe. In this paper we evaluate the value of high-level topic-based requirements traceability and issue report traceability in the version control system, using Latent Dirichlet Allocation (LDA). We evaluate LDA topics on practitioners and check if the topics and trends extracted match the perception that industrial Program Managers and Developers have about the effort put into addressing certain topics. We then replicate this study again on Open Source Developers using issue reports from issue trackers instead of requirements, confirming our previous industrial conclusions. We found that efforts extracted as commits from version control systems relevant to a topic often matched the perception of the managers and developers of what actually occurred at that time. Furthermore we found evidence that many of the identified topics made sense to practitioners and matched their perception of what occurred. But for some topics, we found that practitioners had difficulty interpreting and labelling them. In summary, we investigate the high-level traceability of requirements topics and issue/bug report topics to version control commits via topic analysis and validate with the actual stakeholders the relevance of these topics extracted from requirements and issues.", "paper_title": "Do topics make sense to managers and developers?", "paper_id": "WOS:000353824000008"}