{"auto_keywords": [{"score": 0.044574751613094134, "phrase": "object_base"}, {"score": 0.03343410130414582, "phrase": "static_clustering_algorithms"}, {"score": 0.00481495049065317, "phrase": "oodbms_performance"}, {"score": 0.004734853555630616, "phrase": "oriented_database_management_systems"}, {"score": 0.0038227112550093863, "phrase": "dynamic_clustering"}, {"score": 0.0031912018800904314, "phrase": "prior_research"}, {"score": 0.0030343239259424497, "phrase": "worst_clustered_pages"}, {"score": 0.00284899583294417, "phrase": "opportunistic_prioritised_clustering_framework"}, {"score": 0.002743262400544957, "phrase": "static_clustering_algorithm"}, {"score": 0.0026193328696791306, "phrase": "created_algorithm"}, {"score": 0.0024182831453515782, "phrase": "opcf"}, {"score": 0.002358050109031317, "phrase": "graph_partitioning"}, {"score": 0.002318728604587962, "phrase": "probability_ranking_principle"}, {"score": 0.002289667393538803, "phrase": "dynamic_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["object-oriented databases", " clustering", " caching", " performance optimization"], "paper_abstract": "In object oriented database management systems, clustering has proven to be one of the most effective performance enhancement techniques. Existing clustering algorithms are mainly static, that is re-clustering the object base when the database is off-line. However, this type of re-clustering cannot be used when 24-h database access is required. In such situations dynamic clustering is necessary, since it can re-cluster the object base while the database is in operation. We find that most existing dynamic clustering algorithms do not address the following important points: the use of opportunism to impose the smallest I/O footprint for re-organisation; the re-use of prior research on static clustering algorithms; and the prioritisation of re-clustering so that the worst clustered pages are re-clustered first. Our main achievement in this paper is to create the Opportunistic Prioritised Clustering Framework (OPCF). The framework allows any static clustering algorithm to be made dynamic. Most importantly it allows the created algorithm to have the properties of I/O opportunism and clustering prioritisation which are missing in most existing dynamic clustering algorithms. We have used OPCF to make the static clustering algorithms \"Graph Partitioning\" and \"Probability Ranking Principle\" into dynamic algorithms. In our simulation study we found these algorithms outperformed two existing highly competitive dynamic algorithms in a variety of situations. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Opportunistic prioritised clustering framework for improving OODBMS performance", "paper_id": "WOS:000244833700007"}