{"auto_keywords": [{"score": 0.03666106118361919, "phrase": "image_concepts"}, {"score": 0.014354522408900176, "phrase": "large_numbers"}, {"score": 0.014181556462688087, "phrase": "inter-related_classifiers"}, {"score": 0.01392595239314541, "phrase": "large-scale_image_classification"}, {"score": 0.013027012900296557, "phrase": "inter-concept_visual_correlations"}, {"score": 0.011536909542957876, "phrase": "object_classes"}, {"score": 0.00481495049065317, "phrase": "automatic_image_classification"}, {"score": 0.004669845451682529, "phrase": "structural_learning_algorithm"}, {"score": 0.0041316803676012155, "phrase": "visual_concept_network"}, {"score": 0.0038624981944755813, "phrase": "inter-related_learning_tasks"}, {"score": 0.003769006950727621, "phrase": "visual_feature_space"}, {"score": 0.0036553070575015344, "phrase": "label_space"}, {"score": 0.0030789331635764122, "phrase": "similar_visual_properties"}, {"score": 0.002825681384008326, "phrase": "different_groups"}, {"score": 0.0025615908073796027, "phrase": "inter-related_classifier_training"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Inter-related classifier training", " Large-scale image classification", " Structural learning", " Visual concept network"], "paper_abstract": "A structural learning algorithm is developed in this paper to achieve more effective training of large numbers of inter-related classifiers for supporting large-scale image classification and annotation. A visual concept network is constructed for characterizing the inter-concept visual correlations intuitively and determining the inter-related learning tasks automatically in the visual feature space rather than in the label space. By partitioning large numbers of object classes and image concepts into a set of groups according to their inter-concept visual correlations, the object classes and image concepts in the same group will share similar visual properties and their classifiers are strongly inter-related while the object classes and image concepts in different groups will contain various visual properties and their classifiers can be trained independently. By leveraging the inter-concept visual correlations for inter-related classifier training, our structural learning algorithm can train the inter-related classifiers jointly rather than independently, which can enhance their discrimination power significantly. Our experiments have also provided very positive results on large-scale image classification and annotation. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Training inter-related classifiers for automatic image classification and annotation", "paper_id": "WOS:000315313600014"}