{"auto_keywords": [{"score": 0.02500911542513276, "phrase": "community_detection"}, {"score": 0.00481495049065317, "phrase": "scalable_overlapping_community_detection"}, {"score": 0.0040969285074699, "phrase": "multiple_communities"}, {"score": 0.00369022262431101, "phrase": "high_performance"}, {"score": 0.0036207206487324506, "phrase": "efficient_community_detection"}, {"score": 0.0034690732089830045, "phrase": "overlapping_communities"}, {"score": 0.003371508176308189, "phrase": "disjoint_community_detection"}, {"score": 0.0032766780632972363, "phrase": "new_challenges"}, {"score": 0.0030078460113945136, "phrase": "network_size"}, {"score": 0.002923214590192792, "phrase": "large_datasets"}, {"score": 0.002854505078275351, "phrase": "speaker-listener_label_propagation_algorithm"}, {"score": 0.002721881597385595, "phrase": "slpa"}, {"score": 0.002522344964242888, "phrase": "multithreaded_programming_paradigm"}, {"score": 0.0024397017438101726, "phrase": "significant_performance_gain"}, {"score": 0.002416589459425828, "phrase": "sequential_execution"}, {"score": 0.002371018116266096, "phrase": "high_quality"}], "paper_keywords": [""], "paper_abstract": "Communities in networks are groups of nodes whose connections to the nodes in a community are stronger than with the nodes in the rest of the network. Quite often nodes participate in multiple communities; that is, communities can overlap. In this paper, we first analyze what other researchers have done to utilize high performance computing to perform efficient community detection in social, biological, and other networks. We note that detection of overlapping communities is more computationally intensive than disjoint community detection, and the former presents new challenges that algorithm designers have to face. Moreover, the efficiency of many existing algorithms grows superlinearly with the network size making them unsuitable to process large datasets. We use the Speaker-Listener Label Propagation Algorithm (SLPA) as the basis for our parallel overlapping community detection implementation. SLPA provides near linear time overlapping community detection and is well suited for parallelization. We explore the benefits of a multithreaded programming paradigm and show that it yields a significant performance gain over sequential execution while preserving the high quality of community detection. The algorithm was tested on four real-world datasets with up to 5.5 million nodes and 170 million edges. In order to assess the quality of community detection, at least 4 different metrics were used for each of the datasets.", "paper_title": "Parallelizing SLPA for Scalable Overlapping Community Detection", "paper_id": "WOS:000357219400001"}