{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "supplier_discovery"}, {"score": 0.03797636854358293, "phrase": "supply-demand_relationship"}, {"score": 0.03588915745850245, "phrase": "buffer_contents"}, {"score": 0.004195418010131832, "phrase": "streaming_data_blocks"}, {"score": 0.0040916230716372265, "phrase": "local_node"}, {"score": 0.003940706575253453, "phrase": "higher_the_chance"}, {"score": 0.00389164348807591, "phrase": "quality_suppliers"}, {"score": 0.0037795163893761027, "phrase": "uninterrupted_playback"}, {"score": 0.0031448288291084, "phrase": "vcr_operations"}, {"score": 0.0030160945545795468, "phrase": "efficient_way"}, {"score": 0.00290473242917264, "phrase": "overlapping_relation_network"}, {"score": 0.0027741761880779535, "phrase": "dynamic_supply-demand_relationship"}, {"score": 0.0027054473441439422, "phrase": "peers'_buffer_contents"}, {"score": 0.002551612225562499, "phrase": "overlapping_relationship"}, {"score": 0.00246765655376112, "phrase": "low-cost_supplier_discovery"}, {"score": 0.00241658945942583, "phrase": "simulation_experiments"}, {"score": 0.0023567001173695206, "phrase": "orn"}, {"score": 0.0022226496830385304, "phrase": "streaming_continuity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Peer-to-peer", " Overlay network", " Video on-demand streaming"], "paper_abstract": "There are two major building blocks in operating a peer-to-peer (P2P) video-on-demand (VOD) network: supplier discovery and content delivery. Supplier discovery concerns the discovery of peer nodes in the network that can provide the streaming data blocks needed for playing by a local node. The more suppliers one can discover, the higher the chance of locating quality suppliers for delivering contents smoothly to ensure uninterrupted playback The key to supplier discovery is to establish and track the supply-demand relationship among the peers. For P2P VOD, the supply-demand relationship is determined by the buffer contents of the peers. Unfortunately, the buffer contents change rapidly as peers play the video, especially under VCR operations. The challenge is to track all the dynamic relationships in an efficient way. In this paper, we propose an Overlapping Relation Network (ORN). The idea is to track the dynamic supply-demand relationship by tracking the overlapping of peers' buffer contents. As long as peers play the video at the same rate, the overlapping relationship is stable and can be used for low-cost supplier discovery. Extensive analyses and simulation experiments show that in most cases the ORN can discover more than 96% of the suppliers in the network, resulting in a streaming continuity that is superior to that of other approaches. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "ORN: A content-based approach to improving supplier discovery in P2P VOD networks", "paper_id": "WOS:000296401500002"}