{"auto_keywords": [{"score": 0.029844680935891547, "phrase": "pin."}, {"score": 0.004624337472244542, "phrase": "personal_identification_numbers"}, {"score": 0.00454019648854141, "phrase": "mobile_phones"}, {"score": 0.0042497136254424995, "phrase": "'_usability_requirement_and_the_'hard_to_guess'_security_requirement"}, {"score": 0.0037505809981715024, "phrase": "password_strength"}, {"score": 0.003668768542734106, "phrase": "pin_selection_policies"}, {"score": 0.003562444653947001, "phrase": "stronger_pins"}, {"score": 0.003484721713676736, "phrase": "example_policy"}, {"score": 0.0033465923623290034, "phrase": "online_user_study"}, {"score": 0.003132236287543072, "phrase": "carefully_designed_policies"}, {"score": 0.002733646947011804, "phrase": "collected_pins"}, {"score": 0.0026155681847364483, "phrase": "commonly_used_pins"}, {"score": 0.00240328454980006, "phrase": "significant_memorability_overhead"}, {"score": 0.0023249757987087055, "phrase": "pin-pattern-based_blacklisting_policy"}, {"score": 0.0022575078732617678, "phrase": "total_pin_space"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["PIN selection policy", " PIN distribution", " Entropy", " Memorability", " Password"], "paper_abstract": "Users have conflicting sets of requirements when it comes to choosing Personal Identification Numbers (PINs) for mobile phones or other systems that use PINs for authentication: the conflict lies between the 'easy to remember' usability requirement and the 'hard to guess' security requirement. Users often ignore the security requirement and choose PINs that are easy to remember and reuse, making it also easy for attackers to guess and compromise them. Just as the password strength is controlled through various password policies, PIN selection policies may be used to help users choose stronger PINs and meet various security requirements. An example policy would not allow the use of the most commonly selected PINs. An online user study was conducted to investigate the effectiveness of such PIN selection policies, requesting the participants to choose PINs under some carefully designed policies. The participants were also asked to record the memorability (remembrance difficulty) score of each PIN, indicating how easy/hard it was to remember the selected PIN. Based on the entropies calculated on the collected PINs and their memorability scores, this paper demonstrates that restricting some number of commonly used PINs (e.g. restricting the 200 most commonly used ones) is beneficial: this type of policy would significantly increase the randomness of PINs without incurring significant memorability overhead. Our results also showed that any PIN- or PIN-pattern-based blacklisting policy should be constructed with caution since the total PIN space may become too small, making it easier for attackers to guess PINs. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "PIN selection policies: Are they really effective?", "paper_id": "WOS:000304842100009"}