{"auto_keywords": [{"score": 0.030019925790468825, "phrase": "validation_problem"}, {"score": 0.010612387000973441, "phrase": "set_cover_problem"}, {"score": 0.007865549657213061, "phrase": "previously_discovered_edges"}, {"score": 0.005476620877794796, "phrase": "np"}, {"score": 0.004769182299692333, "phrase": "set_ownership"}, {"score": 0.0047013405841819025, "phrase": "highly_distributed_internet_measurement_systems"}, {"score": 0.004293434614435972, "phrase": "network_graph"}, {"score": 0.00386496062825374, "phrase": "internet_graph"}, {"score": 0.0037377733149169573, "phrase": "agent_locations"}, {"score": 0.002942811795757911, "phrase": "minimum_possible_time"}, {"score": 0.0021049977753042253, "phrase": "approximation_ratio"}], "paper_keywords": ["Internet", " Measurement systems", " Traceroute", " Approximation algorithms"], "paper_abstract": "In highly distributed Internet measurement systems distributed agents periodically measure the Internet using a tool called traceroute, which discovers a path in the network graph. Each agent performs many traceroute measurements to a set of destinations in the network, and thus reveals a portion of the Internet graph as it is seen from the agent locations. In every period we need to check whether previously discovered edges still exist in this period, a process termed validation. To this end we maintain a database of all the different measurements performed by each agent. Our aim is to be able to validate the existence of all previously discovered edges in the minimum possible time. In this work we formulate the validation problem as a generalization of the well know set cover problem. We reduce the set cover problem to. the validation problem, thus proving that the validation problem is NP-hard. We present a O(log n)-approximation algorithm to the validation problem, where it in the number of edges that need to be validated. We also show that unless P = NP the approximation ratio of the validation problem is Omega(log n). (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A Theta(log n)-approximation for the set cover problem with set ownership", "paper_id": "WOS:000262560900004"}