{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "gradual_rules"}, {"score": 0.015579192279283836, "phrase": "stream_data"}, {"score": 0.00481495049065317, "phrase": "gradual_rule_mining"}, {"score": 0.004317848984770719, "phrase": "ordering_correlations"}, {"score": 0.0038194503801108324, "phrase": "tourist_travels"}, {"score": 0.003716724243777879, "phrase": "fuzzy_command_systems"}, {"score": 0.0033937776228549557, "phrase": "data_mining_community"}, {"score": 0.0031990183472675377, "phrase": "numerical_databases"}, {"score": 0.0030017207229983385, "phrase": "data_streams"}, {"score": 0.002855251306715901, "phrase": "high_rate"}, {"score": 0.0026790983342162887, "phrase": "original_approach"}, {"score": 0.0022743274702883456, "phrase": "already-known_gradual_rules"}, {"score": 0.0021632743048552536, "phrase": "owa_operators"}, {"score": 0.002133937537670312, "phrase": "fast_way"}, {"score": 0.0021049977753042253, "phrase": "non_relevant_data"}], "paper_keywords": ["Data streams", " Gradual rules", " OWA operators"], "paper_abstract": "Gradual rules allow users to be provided with rules describing the ordering correlations among attributes. Such a rule is for instance given by the higher the salary and the lower the number of cars, the higher the number of tourist travels. Previously intensively used in fuzzy command systems, these rules were manually provided to the system. More recently, they have received attention from the data mining community and methods have been defined to automatically extract and maintain gradual rules from numerical databases. However, no method has been shown to be able to handle data streams, as no method is scalable enough to manage the high rate which stream data arrive at. In this paper, we thus propose an original approach to mine data streams for gradual rules. Our method is based on B-Trees and OWA (Ordered Weighted Aggregation) operator in order to speed up the process. B-Trees are used to store already-known gradual rules in order to maintain the knowledge over time, while OWA operators provide a fast way to discard non relevant data.", "paper_title": "Speed up gradual rule mining from stream data! A B-Tree and OWA-based approach", "paper_id": "WOS:000285025500004"}