{"auto_keywords": [{"score": 0.04235099281251183, "phrase": "exact_description"}, {"score": 0.042042246124714806, "phrase": "peers'_status"}, {"score": 0.015407609159732633, "phrase": "decision_making"}, {"score": 0.014362530798724378, "phrase": "server-oriented_architecture"}, {"score": 0.009084019020013127, "phrase": "information_collection"}, {"score": 0.008724514662383687, "phrase": "basic_activity"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_distributed_systems"}, {"score": 0.004670722261414736, "phrase": "distributed_systems"}, {"score": 0.0046353421974267475, "phrase": "accurate_information"}, {"score": 0.004600228893803583, "phrase": "available_resources"}, {"score": 0.004530794611704416, "phrase": "previously_proposed_approaches"}, {"score": 0.0044398358177815305, "phrase": "system's_architecture"}, {"score": 0.00433967854548723, "phrase": "main_role"}, {"score": 0.004306795240631196, "phrase": "comprehensive_information"}, {"score": 0.004104219715667327, "phrase": "basic_activities"}, {"score": 0.003971111060168551, "phrase": "accurate_decisions"}, {"score": 0.0037271003384115034, "phrase": "massive_processing"}, {"score": 0.003308085469148074, "phrase": "peer_architecture"}, {"score": 0.0031845067058084583, "phrase": "complete_knowledge"}, {"score": 0.0030733222563633774, "phrase": "precise_description"}, {"score": 0.0029962822997084398, "phrase": "hardware_data"}, {"score": 0.002727606388863445, "phrase": "peer's_status"}, {"score": 0.002572844542125473, "phrase": "proposed_model"}, {"score": 0.002495608496809594, "phrase": "peer-to-peer_serverless_architecture"}, {"score": 0.0024454070844982033, "phrase": "new_approach"}, {"score": 0.0023659694724243764, "phrase": "peer-to-peer_system"}, {"score": 0.002342048999008582, "phrase": "latin_square_concept"}, {"score": 0.002294929467537814, "phrase": "server-oriented_and_serverless_situations"}, {"score": 0.0021979174870847694, "phrase": "server-oriented_situation"}, {"score": 0.0021427744169934537, "phrase": "direct_relation"}, {"score": 0.0021049977753042253, "phrase": "serverless_situation"}], "paper_keywords": ["Distributed systems", " peer-to-peer systems", " server-oriented", " workload", " Latin square", " serverless"], "paper_abstract": "One of the important aspects of decision making and management in distributed systems is collecting accurate information about the available resources of the peers. The previously proposed approaches for collecting such information completely depend on the system's architecture. In the server-oriented architecture, servers assume the main role of collecting comprehensive information from the peers and the system. Next, based on the information about the features of the basic activities and the system, an exact description of the peers' status is produced. Accurate decisions are then made using this description. However, the amount of information gathered in this architecture is too large, and it requires massive processing. On the other hand, updating the information takes time, causing delays and undermining the validity of the information. In addition, due to the limitations imposed by the servers, such architecture is not scalable and dynamic enough. The peer-to-peer architecture was introduced to address these concerns. However, due to a lack of complete knowledge of the peers and the system, the decisions are made without a precise description of the peers' status and are only based on the hardware data collected from the peers. Such an abstract and general image of the peers is not adequate for the purpose of decision making. In this paper, a 4-dimensional model is presented for the purpose of information collection and the exact description of the peer's status, including the features of the peer, the basic activity, the time, and the specifications of the system. The proposed model is for a server-oriented architecture, but it also adapts to the peer-to-peer serverless architecture. Based on this model, a new approach is introduced for information collection and an exact description of the peers' status in a peer-to-peer system based on the Latin square concept. We evaluate the model in the server-oriented and serverless situations. The workload is considered as the basic activity in our evaluation. Our evaluation demonstrates that in a server-oriented situation, increasing the size of the system has a direct relation with time. However, a serverless situation does not follow this behavior.", "paper_title": "Four-dimensional model for describing the status of peers in peer-to-peer distributed systems", "paper_id": "WOS:000325373300011"}