{"auto_keywords": [{"score": 0.043226782433942644, "phrase": "layer_hens"}, {"score": 0.00481495049065317, "phrase": "vivo_study"}, {"score": 0.004776853267973129, "phrase": "potential_application"}, {"score": 0.004739056045644449, "phrase": "novel_method"}, {"score": 0.004615202066192795, "phrase": "poultry_food_chain"}, {"score": 0.004365498117804683, "phrase": "possible_method"}, {"score": 0.004151188559520802, "phrase": "preliminary_live_trial"}, {"score": 0.004096554181817956, "phrase": "optimal_laser_type"}, {"score": 0.004042635935882651, "phrase": "particular_application"}, {"score": 0.003936910716320182, "phrase": "vivo_trials"}, {"score": 0.0039057335221099228, "phrase": "dm_barcodes"}, {"score": 0.003803574975736106, "phrase": "mature_layer_hens"}, {"score": 0.0037534983455974947, "phrase": "high_specification_camera"}, {"score": 0.0036553070575015344, "phrase": "reading_procedure"}, {"score": 0.00347574024760684, "phrase": "commercial_environment"}, {"score": 0.003296212583539166, "phrase": "physical_and_chemical_challenges"}, {"score": 0.0028944757265206332, "phrase": "significant_difference"}, {"score": 0.0025348408238837655, "phrase": "seven_day_period"}, {"score": 0.0023346234464901978, "phrase": "movement_control"}, {"score": 0.002322261865873902, "phrase": "live_mature_poultry"}, {"score": 0.002309965586951879, "phrase": "vulnerable_points"}, {"score": 0.00229164285862567, "phrase": "food_chain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["GS1 DataMatrix barcodes", " Laser printing", " Poultry beaks", " Layer hens", " Readability", " Proportion of identification"], "paper_abstract": "The feasibility of using GS1 DataMatrix (GS1 DM) barcodes laser printed onto the beaks of poultry as a possible method of identification and, therefore, traceability of the individual were examined in this study, including a preliminary live trial on layer hens. The optimal laser type and settings for this particular application had been selected during previous in vitro and in vivo trials. GS1 DM barcodes were printed on both sides of the beaks of mature layer hens and read using a high specification camera based 1-Dimensional/2-Dimensional (1-D/2-D) DataMan 7500 barcode reader. The reading procedure was repeated on a number of occasions over a 5 week period to examine the effects of time in a commercial environment on the clarity and readability of the GS1 DM barcode, and the ability of the printed GS1 DM barcodes to resist the physical and chemical challenges of such a setting. The results show a very short timeframe during which all barcodes, both right and left combined, remain readable. Thereafter the readability deteriorates rapidly, due to the growth and healing of the beaks of the layer hens. Results also show that there was no significant difference in the readability between GS1 DM barcodes printed on the right or left side of the beak. The proportion of identification ( i) (i.e. number of layers identifiable by either one or two readable GS1 DM barcodes) was also calculated. All layer hens were fully identifiable for a seven day period by either one or two readable GS1 DM barcodes. Further analysis showed that the proportion of identification (,)was significantly higher for layer hens when identified with two GS1 DM barcodes as opposed to just one. Secure movement control of live mature poultry at vulnerable points in the food chain, such as transfer of ownership, could well be facilitated by the use of this technology, thereby preventing fraud or substitution at these points. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Preliminary in vivo study on the potential application of a novel method of e-tracking to facilitate traceability in the poultry food chain", "paper_id": "WOS:000292711500001"}