{"auto_keywords": [{"score": 0.03915514201946942, "phrase": "global_diagnoses"}, {"score": 0.01031126770017341, "phrase": "test_results"}, {"score": 0.007450825563377472, "phrase": "automotive_vehicle"}, {"score": 0.006069701094584865, "phrase": "condensed_diagnoses"}, {"score": 0.006062907805601768, "phrase": "complete_system"}, {"score": 0.00481495049065317, "phrase": "distributed_diagnosis"}, {"score": 0.004760017604908536, "phrase": "condensed_representation"}, {"score": 0.004581373625744533, "phrase": "fault_detection"}, {"score": 0.004511799033574768, "phrase": "diagnostic_test_results"}, {"score": 0.004084510791138056, "phrase": "distributed_systems"}, {"score": 0.004037877545494505, "phrase": "multiple_control_units"}, {"score": 0.00385658790017119, "phrase": "local_diagnoses"}, {"score": 0.003585986761045987, "phrase": "fault-tolerant_control"}, {"score": 0.0028170314398963704, "phrase": "abnormal_behavior"}, {"score": 0.0025110337774260773, "phrase": "new_type"}, {"score": 0.002361632539339945, "phrase": "unique_set"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Distributed algorithms", " fault diagnosis", " fault location", " road vehicles"], "paper_abstract": "In fault detection and isolation, diagnostic test results are commonly used to compute a set of diagnoses, where each diagnosis points at a set of components which might behave abnormally. In distributed systems consisting of multiple control units, the test results in each unit can be used to compute local diagnoses while all test results in the complete system give the global diagnoses. It is an advantage for both repair and fault-tolerant control to have access to the global diagnoses in each unit since these diagnoses represent all test results in all units. However, when the diagnoses, for example, are to be used to repair a unit, only the components that are used by the unit are of interest. The reason for this is that it is only these components that could have caused the abnormal behavior. However, the global diagnoses might include components from the complete system and therefore often include components that are superfluous for the unit. Motivated by this observation, a new type of diagnosis is proposed, namely, the condensed diagnosis. Each unit has a unique set of condensed diagnoses which represents the global diagnoses. The benefit of the condensed diagnoses is that they only include components used by the unit while still representing the global diagnoses. The proposed method is applied to an automotive vehicle, and the results from the application study show the benefit of using condensed diagnoses compared to global diagnoses.", "paper_title": "Distributed Diagnosis Using a Condensed Representation of Diagnoses With Application to an Automotive Vehicle", "paper_id": "WOS:000296017400017"}