{"auto_keywords": [{"score": 0.049081938632360274, "phrase": "real_tau-conjecture"}, {"score": 0.04667214504391832, "phrase": "real_roots"}, {"score": 0.039897648477144824, "phrase": "arithmetic_circuit_complexity"}, {"score": 0.00481498338646926, "phrase": "wronskian"}, {"score": 0.004311109608629196, "phrase": "sparse_univariate_polynomials"}, {"score": 0.0035665344993417603, "phrase": "wronksian_determinant"}, {"score": 0.003492155652400838, "phrase": "upper_bound"}, {"score": 0.0032954888655173666, "phrase": "sparse_polynomials"}, {"score": 0.0032437952431945724, "phrase": "special_form"}, {"score": 0.003061072337623773, "phrase": "distinct_sparse_polynomials"}, {"score": 0.002798662730881037, "phrase": "deterministic_polynomial_identity_testing_algorithm"}, {"score": 0.0025052769325080255, "phrase": "sparse_geometric_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Real tau-conjecture", " Sparse polynomials", " Real algebraic geometry"], "paper_abstract": "According to the real tau-conjecture, the number of real roots of a sum of products of sparse univariate polynomials should be polynomially bounded in the size of such an expression. It is known that this conjecture implies a superpolynomial lower bound on the arithmetic circuit complexity of the permanent. In this paper, we use the Wronksian determinant to give an upper bound on the number of real roots of sums of products of sparse polynomials of a special form. We focus on the case where the number of distinct sparse polynomials is small, but each polynomial may be repeated several times. We also give a deterministic polynomial identity testing algorithm for the same class of polynomials. Our proof techniques are quite versatile; they can in particular be applied to some sparse geometric problems that do not originate from arithmetic circuit complexity. The paper should therefore be of interest to researchers from these two communities (complexity theory and sparse polynomial systems). (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A Wronskian approach to the real tau-conjecture", "paper_id": "WOS:000347767600012"}