{"auto_keywords": [{"score": 0.045811643453777584, "phrase": "social_networking_sites"}, {"score": 0.015719716506582538, "phrase": "social_networking_site_loyalty"}, {"score": 0.015244515639195355, "phrase": "user_attitude"}, {"score": 0.01411752654912098, "phrase": "perceived_risks"}, {"score": 0.007044407224828351, "phrase": "formative_construct"}, {"score": 0.00575958876815684, "phrase": "social_networking_site_use"}, {"score": 0.00475924837336259, "phrase": "special_attention"}, {"score": 0.004187284711626886, "phrase": "structural_equation_modelling_techniques"}, {"score": 0.004075053556360946, "phrase": "spanish_social_networking_site_user"}, {"score": 0.003996727479807572, "phrase": "personal_survey"}, {"score": 0.003859500298805362, "phrase": "findings_-_data_analysis"}, {"score": 0.003770633265791941, "phrase": "key_variable"}, {"score": 0.0034618794528555063, "phrase": "main_drivers"}, {"score": 0.0030572112793962004, "phrase": "research_findings"}, {"score": 0.003010063382882408, "phrase": "social_networking_site_content"}, {"score": 0.002940697344380201, "phrase": "user_interactions"}, {"score": 0.002861782260525497, "phrase": "practical_recommendations"}, {"score": 0.002828611294209297, "phrase": "social_networking_site_satisfaction"}, {"score": 0.002752695791351096, "phrase": "perceived_risk_dimensions"}, {"score": 0.0022664208122072657, "phrase": "improved_model"}, {"score": 0.002248863090203165, "phrase": "social_networking_site_loyalty_formation"}, {"score": 0.0021049977753042253, "phrase": "risk_dimensions"}], "paper_keywords": ["Uses and gratifications", " Attitude", " Perceived risk", " Loyalty", " Social networking sites", " Social networks", " Spain"], "paper_abstract": "Purpose - The aim of this paper is to analyse the determinants of social networking site loyalty, paying special attention to the roles of user attitude, perceived risk and satisfaction. Design/methodology/approach - The impact of uses and gratifications of social networking sites, attitude, perceived risks and satisfaction on social networking site loyalty is tested through structural equation modelling techniques. The sample consisted of 811 Spanish social networking site user's collected through a personal survey. Risk is measured as a formative construct. Findings - Data analysis shows that attitude is a key variable in increasing satisfaction and loyalty towards social networking sites. Sociability and entertainment gratifications and perceived risks (psychological, time loss and social) are the main drivers of user attitude towards social networking sites. Practical implications - This research enables managers to know what aspects to highlight in their communication strategies to increase social networking site use and positive word-of-mouth. The research findings show managers that social networking site content should provide fun and foster user interactions in order to improve user attitude. Practical recommendations to increase social networking site satisfaction and loyalty and guidelines to reduce perceived risk dimensions are also provided. Originality/value - Despite the importance of social networking sites for companies, only limited work has been done to identify motivators and barriers of social networking site loyalty. This work aims to combine the influence of gratifications provided by social networking sites, perceived risks, attitude and satisfaction in order to construct an improved model for social networking site loyalty formation. Furthermore risk is measured as a formative construct because there is no reason to expect that risk dimensions in social networking site use are correlated.", "paper_title": "Social network loyalty: evaluating the role of attitude, perceived risk and satisfaction", "paper_id": "WOS:000317635000005"}