{"auto_keywords": [{"score": 0.004815208316739668, "phrase": "decision"}, {"score": 0.004714023408114857, "phrase": "competing_retail_channel"}, {"score": 0.0046544807197808095, "phrase": "third-party_logistics_provider"}, {"score": 0.004461359547152617, "phrase": "supply-chain-wide_system"}, {"score": 0.004446430485477817, "phrase": "dominant_retailer_model"}, {"score": 0.004064117897000019, "phrase": "product_distribution_functions"}, {"score": 0.0038461532860146535, "phrase": "decision_problem"}, {"score": 0.00337224813954299, "phrase": "classic_double_marginalization"}, {"score": 0.0033295966773779174, "phrase": "new_insight"}, {"score": 0.0028822153400215973, "phrase": "retail_competition"}, {"score": 0.002704403349815203, "phrase": "price_leader"}, {"score": 0.0026252106881752067, "phrase": "price_follower"}, {"score": 0.0021870332034407817, "phrase": "decentralized_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Third-party logistics provider", " Competing retailers", " Balance", " Coordination"], "paper_abstract": "This paper investigates decision and coordination in a supply-chain-wide system consisting of a manufacturer, a third-party logistics (3PL) provider, and two competing retailers. The product distribution functions may be implemented by the 3PL provider or the two retailers who face a decision problem that whether the 3PL provider should be introduced. The advantage of introducing the 3PL provider lies in his/her lower logistics cost. The drawback lies in the 3PL provider's profit margin which leads to classic double marginalization. A new insight provided by this paper is that whether or not introducing the 3PL provider depends on the balance of these two effects. This paper reveals the conditions of the balance and explores the effect of retail competition on this balance. Furthermore, we discuss the dominant retailer model where one retailer is a price leader, and the other is a price follower. Whether the 3PL provider should be introduced under the dominant retailer model is also analyzed. Finally, three contracts: a spanning revenue-sharing contract, a quantity discount contract and a two-part tariffs contract are devised to effectively coordinate the decentralized system involving the 3PL provider. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Decision and coordination in a competing retail channel involving a third-party logistics provider", "paper_id": "WOS:000344438700011"}