{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chemistry_research"}, {"score": 0.004563427013973105, "phrase": "major_areas"}, {"score": 0.004278807087784626, "phrase": "major_knowledge_producers"}, {"score": 0.004121015016128205, "phrase": "computational_scientometrics"}, {"score": 0.003969018740062018, "phrase": "large-scale_scholarly_datasets"}, {"score": 0.003470358620464986, "phrase": "prototype_study"}, {"score": 0.0027395968397212053, "phrase": "jcr_categories"}, {"score": 0.002610198789888055, "phrase": "changing_scientific_composition"}, {"score": 0.0025137856138000014, "phrase": "citation_linkages"}, {"score": 0.002460295872115956, "phrase": "major_changes"}, {"score": 0.0022453485299093576, "phrase": "bioengineering"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": [""], "paper_abstract": "How does our collective scholarly knowledge grow over time? What major areas of science exist and how are they interlinked? Which areas are major knowledge producers; which ones are consumers? Computational scientometrics - the application of bibliometric/scientometric methods to large-scale scholarly datasets - and the communication of results via maps of science might help us answer these questions. This paper represents the results of a prototype study that aims to map the structure and evolution of chemistry research over a 30 year time frame. Information from the combined Science (SCIE) and Social Science (SSCI) Citations Indexes from 2002 was used to generate a disciplinary map of 7,227 journals and 671 journal clusters. Clusters relevant to study the structure and evolution of chemistry were identified using JCR categories and were further clustered into 14 disciplines. The changing scientific composition of these 14 disciplines and their knowledge exchange via citation linkages was computed. Major changes on the dominance, influence, and role of Chemistry, Biology, Biochemistry, and Bioengineering over these 30 years are discussed. The paper concludes with suggestions for future work.", "paper_title": "Mapping the structure and evolution of chemistry research", "paper_id": "WOS:000264487900003"}