{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "clustered_interval-censored_survival_data"}, {"score": 0.004624751696958501, "phrase": "semiparametric_cox's_proportional_hazards"}, {"score": 0.004514241562580097, "phrase": "random_effect"}, {"score": 0.004477992162329249, "phrase": "frailty_approach"}, {"score": 0.004424160689087029, "phrase": "clustered_survival_data"}, {"score": 0.004370973501074594, "phrase": "cure_fraction"}, {"score": 0.004164516065972361, "phrase": "health_condition"}, {"score": 0.00398380712846857, "phrase": "observed_covariates"}, {"score": 0.0038417798012011155, "phrase": "hazard_function"}, {"score": 0.003749908582313067, "phrase": "cure_status"}, {"score": 0.0033492947290751996, "phrase": "high_propensity"}, {"score": 0.003229815147800001, "phrase": "longer_time"}, {"score": 0.0026500668745484957, "phrase": "multiple_imputation_estimation_method"}, {"score": 0.002504374718975704, "phrase": "simulation_studies"}, {"score": 0.0024345529783611703, "phrase": "proposed_estimation_method"}, {"score": 0.0023762535034673017, "phrase": "proposed_model"}, {"score": 0.002182958452794581, "phrase": "grade_iv_venous_gas_emboli"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Asymptotic normal data augmentation", " Clustered interval-censored data", " Cure model", " Frailty", " Survival analysis"], "paper_abstract": "A generalization of the semiparametric Cox's proportional hazards model by means of a random effect or frailty approach to accommodate clustered survival data with a cure fraction is considered. The frailty serves as a quantification of the health condition of the subjects under study and may depend on some observed covariates like age. One single individual-specific frailty that acts on the hazard function is adopted to determine the cure status of an individual and the heterogeneity on the time to event if the individual is not cured. Under this formulation, an individual who has a high propensity to be cured would tend to have a longer time to event if he is not cured. Within a cluster, both the cure statuses and the times to event of the individuals would be correlated. In contrast to some models proposed in the literature, the model accommodates the correlations among the observations in a more natural way. A multiple imputation estimation method is proposed for both right-censored and interval-censored data. Simulation studies show that the performance of the proposed estimation method is highly satisfactory. The proposed model and method are applied to the National Aeronautics and Space Administration's hypobaric decompression sickness data to investigate the factors associated with the occurrence and the time to onset of grade IV venous gas emboli under hypobaric environments. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Semiparametric analysis of clustered interval-censored survival data with a cure fraction", "paper_id": "WOS:000340139900012"}