{"auto_keywords": [{"score": 0.026982864739737534, "phrase": "interfacial_roughness"}, {"score": 0.00481495049065317, "phrase": "solid-liquid_interface"}, {"score": 0.00477513738640734, "phrase": "bcc_fe"}, {"score": 0.004376378707877484, "phrase": "aboo"}, {"score": 0.004286492185236324, "phrase": "voronoi"}, {"score": 0.0030611534228319717, "phrase": "slight_asymmetry"}, {"score": 0.0026796495639791426, "phrase": "realistic_interfacial_area_s"}, {"score": 0.002646412155387084, "phrase": "ideal_flat_cross-sectional_area"}, {"score": 0.0024656866249273125, "phrase": "interfacial_roughness_anisotropies"}, {"score": 0.0023651843133643768, "phrase": "melting_process"}, {"score": 0.0022220423638260015, "phrase": "temperature_deviation_delta_t"}, {"score": 0.0021049977753042253, "phrase": "kinetic_coefficient_mu"}], "paper_keywords": ["Anisotropy", " Interfacial roughness", " Kinetic coefficient", " Molecular dynamics simulation", " Solid-liquid interface"], "paper_abstract": "Melting point T-m and kinetic coefficient mu (a proportional constant between the interfacial velocity. and undercooling Delta T), along with the structural roughness of the solid-liquid interface for body centered cubic (BCC) Fe were calculated by molecular dynamics (MD) simulation. All simulations applied the Sutton-Chen potential, and adopted average bond orientational order (ABOO) parameters together with Voronoi polyhedron method to characterize atomic structure and calculate atomic volume. Anisotropy of T-m was found through about 20 similar to 40 K decreasing from [100] to [110] and continuously to [111]. Anisotropy of mu with three low index orientations was found as: mu(s,[100]) >> mu(s,[110])> mu(s), [111] for solidifying process and mu(m,[100]) >> mu(m,[111])> mu(m,[110]) for melting process. Slight asymmetry between melting and solidifying was discovered from that the ratios of mu(m)/mu(s) are all slightly larger than 1. To explain these, interfacial roughness R-int and area ratio S/S-0 (ratio of realistic interfacial area S and the ideal flat cross-sectional area S-0) were defined to verify the anisotropy of interfacial roughness under different supercoolings/superheatings. The results indicated interfacial roughness anisotropies were approximately [100]>[111]>[110]; the interface in melting process is rougher than that in solidifying process; asymmetry of interfacial roughness was larger when temperature deviation Delta T was larger. Anisotropy and asymmetry of interfacial roughness fitted the case of kinetic coefficient mu very well, which could give some explanations to the anisotropies of T-m and mu.", "paper_title": "Anisotropy and roughness of the solid-liquid interface of BCC Fe", "paper_id": "WOS:000348981900013"}