{"auto_keywords": [{"score": 0.029862490220946277, "phrase": "expression-invariant_region"}, {"score": 0.00481495049065317, "phrase": "robust_binary_neural_networks"}, {"score": 0.004669845451682529, "phrase": "accurate_face_registration"}, {"score": 0.004460309246062286, "phrase": "facial_feature_localization_algorithm"}, {"score": 0.0040481944502103505, "phrase": "nose_tip"}, {"score": 0.003807684498435389, "phrase": "main_face_area"}, {"score": 0.003563172322934695, "phrase": "novel_framework"}, {"score": 0.0032668821950788533, "phrase": "server_misalignment"}, {"score": 0.0031360786664165093, "phrase": "human_face"}, {"score": 0.002860546817196148, "phrase": "facial_expression_variations"}, {"score": 0.002556359086441866, "phrase": "standard_face_model"}, {"score": 0.0022961534630650347, "phrase": "expression_variations"}, {"score": 0.0021049977753042253, "phrase": "nose_tip_localization"}], "paper_keywords": ["3D Face", " Facial Feature Extraction", " Face Registration", " Binary Neural Networks", " Correlation Matrix Memories", " Iterative Closest Point"], "paper_abstract": "In this paper, we propose a facial feature localization algorithm based on a binary neural network technique - k-Nearest Neighbour Advanced Uncertain Reasoning Architecture(kNN AURA) to encode, train and match the feature patterns to accurate identify the nose tip in 3D. Based on the results of the 3D nose tip localization, the main face area is detected and cropped from the original 3D image. Then we present a novel framework to implement the 3D face registration by several integrated phases. First we use Principal Component Analysis(PCA) to roughly correct the server misalignment. Then we exploit the symmetric of human face to reduce the misalignment about oy and oz axis. In order to reduce the effect of facial expression variations, the expression-invariant region is segmented. Using Iterative Closest Point(ICP) algorithms, the expression-invariant region of faces can be aligned according to a standard face model, the misalignment about ox is then eventually corrected. Our experiments performed on the FRGC v2 database which contains pose and expression variations show that our approach outperforms the current state-of-the-art techniques both in the nose tip localization and face registration.", "paper_title": "Robust binary neural networks based 3D Face detection and accurate face registration", "paper_id": "WOS:000319191800008"}