{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_vector_space"}, {"score": 0.04957786067961377, "phrase": "batch_processing"}, {"score": 0.04667214504391832, "phrase": "multiple_workflow_cases"}, {"score": 0.004177049813981273, "phrase": "business_processes_execution"}, {"score": 0.0038801697284045864, "phrase": "dataflow_operation_language"}, {"score": 0.003720060615588018, "phrase": "multiple_cases"}, {"score": 0.003330406613112555, "phrase": "formally_defined_model"}, {"score": 0.0028432828877281388, "phrase": "data_operation_primitives"}, {"score": 0.002654911400878851, "phrase": "workflow_management_systems"}, {"score": 0.0024272744483252546, "phrase": "structured"}, {"score": 0.002266364679369248, "phrase": "evaluation_experiments"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["workflow", " batch processing", " partial vector space model", " DBOL"], "paper_abstract": "Batch processing in workflow schedules activity instances in multiple workflow cases of the same workflow type to run as a group. It can optimize business processes execution dynamically. To achieve this goal, it is necessary to define a dataflow operation language to group and ungroup the data in multiple cases of a workflow. Though our previous work has preliminarily investigated the model and its implementation, there is still lack of a formally defined model. In this paper, we first propose a method that is based on a partial vector space to model the dataflow in multiple workflow cases. Based on this model, the data operation primitives for batch processing are specified and defined formally. Since most WfMSs (Workflow Management Systems) use RDBMS (relational database management system) to store their data currently, an SQL (Structured Query Language)-like implementation language, namely DBOL (Data Batch Operation Language), is proposed. Evaluation experiments have also been done to show its performance. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "A data-operation model based on partial vector space for batch processing in workflow", "paper_id": "WOS:000296273600006"}