{"auto_keywords": [{"score": 0.004743806810821005, "phrase": "high-profile_internet_outages"}, {"score": 0.004519736937243476, "phrase": "bogus_routing_information"}, {"score": 0.004195418010131832, "phrase": "main_protocols"}, {"score": 0.0039088121438737924, "phrase": "traffic-attraction_attacks"}, {"score": 0.0034309482755326016, "phrase": "short_path"}, {"score": 0.0033177813460815346, "phrase": "secure_protocol"}, {"score": 0.0032444113660668743, "phrase": "empirically-determined_as-level_topology"}, {"score": 0.0030451958332949735, "phrase": "advanced_security_solution"}, {"score": 0.0030001224724395354, "phrase": "data-plane_verification"}, {"score": 0.002652768049567487, "phrase": "longer_paths"}, {"score": 0.002574788013427524, "phrase": "bgp_loop-detection"}, {"score": 0.002508433454626386, "phrase": "even_more_traffic"}, {"score": 0.002443784721651744, "phrase": "counterintuitive_examples"}, {"score": 0.002363101338529545, "phrase": "empirical_as_topology"}, {"score": 0.0023368018449680295, "phrase": "specific_ases"}, {"score": 0.002234491924392106, "phrase": "clever_export_policy"}, {"score": 0.0022013916728990564, "phrase": "almost_as_much_traffic"}, {"score": 0.002176887956041267, "phrase": "bogus_path_announcement"}, {"score": 0.0021049977753042253, "phrase": "police_export_policies"}], "paper_keywords": ["Security"], "paper_abstract": "In response to high-profile Internet outages, BGP security variants have been proposed to prevent the propagation of bogus routing information. To inform discussions of which variant should be deployed in the Internet, we quantify the ability of the main protocols (origin authentication, soBGP, S-BGP, and data-plane verification) to blunt traffic-attraction attacks; i.e., an attacker that deliberately attracts traffic to drop, tamper, or eavesdrop on packets. Intuition suggests that an attacker can maximize the traffic he attracts by widely announcing a short path that is not flagged as bogus by the secure protocol. Through simulations on an empirically-determined AS-level topology, we show that this strategy is surprisingly effective, even when the network uses an advanced security solution like S-BGP or data-plane verification. Worse yet, we show that these results underestimate the severity of attacks. We prove that finding the most damaging strategy is NP-hard, and show how counterintuitive strategies, like announcing longer paths, announcing to fewer neighbors, or triggering BGP loop-detection, can be used to attract even more traffic than the strategy above. These counterintuitive examples are not merely hypothetical; we searched the empirical AS topology to identify specific ASes that can launch them. Finally, we find that a clever export policy can often attract almost as much traffic as a bogus path announcement. Thus, our work implies that mechanisms that police export policies (e. g., defensive filtering) are crucial, even if S-BGP is fully deployed.", "paper_title": "How Secure are Secure Interdomain Routing Protocols?", "paper_id": "WOS:000284879800009"}