{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-hesitant_fuzzy_sets"}, {"score": 0.004752221133109136, "phrase": "hesitant_fuzzy_sets"}, {"score": 0.004568871736067739, "phrase": "fuzzy_sets"}, {"score": 0.00450933377534525, "phrase": "membership_degree"}, {"score": 0.0030951536886513567, "phrase": "single_hfs."}, {"score": 0.0030414140732789186, "phrase": "multi-hesitant_fuzzy_numbers"}, {"score": 0.002936709606809639, "phrase": "outranking_relations"}, {"score": 0.002835599469639296, "phrase": "traditional_electre_methods"}, {"score": 0.00270221723573854, "phrase": "ranking_alternatives"}, {"score": 0.0026436755508085223, "phrase": "outranking_approach"}, {"score": 0.002530359917257626, "phrase": "electre_iii"}, {"score": 0.002297831085501592, "phrase": "developed_approach"}, {"score": 0.0021993066642488237, "phrase": "comparison_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-criteria decision-making", " Multi-hesitant fuzzy sets", " Outranking relations"], "paper_abstract": "In hesitant fuzzy sets (HFSs), which are generalized from fuzzy sets, the membership degree of an element to a set, for which decision-makers hesitate while considering several values before expressing their preferences concerning weights and data, can be assigned one or more possible precise values between zero and one. If two or more decision-makers assign an equivalent value, that value is only counted once. However, situations in which the same value is repeatedly assigned substantially differ from those in which the value appears only once. Therefore, multi-hesitant fuzzy sets (MHFSs) can be used to manage cases in which values are repeated in a single HFS. In this paper, a method for comparing multi-hesitant fuzzy numbers (MHFNs) is presented. Some outranking relations for MHFNs, which are based on traditional ELECTRE methods, are introduced, and several properties are analyzed. For ranking alternatives, we propose an outranking approach to multi-criteria decision-making (MCDM) problems similar to ELECTRE III, where weights and data are in the form of MHFNs. Finally, an example is given to illustrate the developed approach, and its validity and feasibility are demonstrated by a comparison analysis with other existing methods. (C) 2015 Published by Elsevier Inc.", "paper_title": "An extension of ELECTRE to multi-criteria decision-making problems with multi-hesitant fuzzy sets", "paper_id": "WOS:000351965100009"}