{"auto_keywords": [{"score": 0.04908569685437738, "phrase": "fuzzy_time_series"}, {"score": 0.015719716506582538, "phrase": "interval_information_granules"}, {"score": 0.010722079298486401, "phrase": "information_granules"}, {"score": 0.008140054307418392, "phrase": "proposed_method"}, {"score": 0.004210114198411514, "phrase": "forecasting_performance"}, {"score": 0.004157446556371582, "phrase": "constructed_fuzzy_time_series_model"}, {"score": 0.003790751492305239, "phrase": "forecasting_accuracy"}, {"score": 0.003398714712611042, "phrase": "predefined_number"}, {"score": 0.0032046343506232588, "phrase": "amplitude-change_space"}, {"score": 0.002897283610433351, "phrase": "optimal_intervals"}, {"score": 0.0026975346834867335, "phrase": "corresponding_intervals"}, {"score": 0.0024489727828322693, "phrase": "experimental_results"}, {"score": 0.002358050109031317, "phrase": "sound_semantics"}, {"score": 0.002309000874224222, "phrase": "proposed_partitioning_method"}, {"score": 0.0021861845339709533, "phrase": "constructed_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy time series", " Interval granules", " Unequal-sized intervals", " Forecasting"], "paper_abstract": "In the process of modeling and forecasting of fuzzy time series, an issue on how to partition the universe of discourse impacts the quality of the forecasting performance of the constructed fuzzy time series model. In this paper, a novel method of partitioning the universe of discourse of time series based on interval information granules is proposed for improving forecasting accuracy of model. In the method, the universe of discourse of time series is first pre-divided into some intervals according to the predefined number of intervals to be partitioned, and then information granules are constructed in the amplitude-change space on the basis of data of time series belonging to each of intervals and their corresponding change (trends). In the sequel, optimal intervals are formed by continually adjusting width of these intervals to make information granules which associate with the corresponding intervals become most \"informative\". Three benchmark time series are used to perform experiments to validate the feasibility and effectiveness of proposed method. The experimental results clearly show that the proposed method produces more reasonable intervals exhibiting sound semantics. When using the proposed partitioning method to determine intervals for modeling of fuzzy time series, forecasting accuracy of the constructed model are prominently enhanced. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Using interval information granules to improve forecasting in fuzzy time series", "paper_id": "WOS:000349879900001"}