{"auto_keywords": [{"score": 0.04353359431026346, "phrase": "pp_correlation"}, {"score": 0.0156064537160041, "phrase": "time_series"}, {"score": 0.015271462702187152, "phrase": "time_series_data"}, {"score": 0.010743261784162053, "phrase": "pp_correlations"}, {"score": 0.00481495049065317, "phrase": "partial_periodic_correlations"}, {"score": 0.004710489616113198, "phrase": "periodic_pattern_mining"}, {"score": 0.004524801966077539, "phrase": "interesting_type"}, {"score": 0.00449183202322304, "phrase": "periodic_pattern"}, {"score": 0.00411436400374349, "phrase": "power_consumption"}, {"score": 0.003741016338085083, "phrase": "particular_period"}, {"score": 0.0032433414042726356, "phrase": "insightful_knowledge"}, {"score": 0.0031267359296488118, "phrase": "future_values"}, {"score": 0.002948798472453167, "phrase": "principal_component_analysis"}, {"score": 0.002927438989589266, "phrase": "pca"}, {"score": 0.002720505061804933, "phrase": "multidimensional_space"}, {"score": 0.002175594509651082, "phrase": "pca-based_algorithm"}, {"score": 0.0021049977753042253, "phrase": "minimum_pp_correlations"}], "paper_keywords": ["time series mining", " periodic patterns", " principal component analysis", " correlations"], "paper_abstract": "Recently, periodic pattern mining from time series data has been studied extensively. However, an interesting type of periodic pattern, called partial periodic (PP) correlation in this paper, has not been investigated. An example of PP correlation is that power consumption is high either on Monday or Tuesday but not on both days. In general, a PP correlation is a set of offsets within a particular period such that the data at these offsets are correlated with a certain user-desired strength. In the above example, the period is a week (7 days), and each day of the week is an offset of the period. PP correlations can provide insightful knowledge about the time series and can be used for predicting future values. This paper introduces an algorithm to mine time series for PP correlations based on the principal component analysis (PCA) method. Specifically, given a period, the algorithm maps the time series data to data points in a multidimensional space, where the dimensions correspond to the offsets within the period. A PP correlation is then equivalent to correlation of data when projected to a subset of the dimensions. The algorithm discovers, with one sequential scan of data, all those PP correlations (called minimum PP correlations) that are not unions of some other PP correlations. Experiments using both real and synthetic data sets show that the PCA-based algorithm is highly efficient and effective in finding the minimum PP correlations.", "paper_title": "Mining partial periodic correlations in time series", "paper_id": "WOS:000254361800002"}