{"auto_keywords": [{"score": 0.004571269461883144, "phrase": "misclassification_error_distance"}, {"score": 0.00438105507792004, "phrase": "unadjusted_rand_index"}, {"score": 0.003766369160795001, "phrase": "upper_and_lower_bounds"}, {"score": 0.003410479630045025, "phrase": "geometric_intuitions"}, {"score": 0.003132236287543072, "phrase": "first_result"}, {"score": 0.0027437235598539904, "phrase": "theoretical_study"}, {"score": 0.0027178867838199734, "phrase": "data_clustering"}, {"score": 0.0026045914281028473, "phrase": "new_methods"}, {"score": 0.002580061425699194, "phrase": "cluster_validation"}, {"score": 0.002460825108719896, "phrase": "clustering_algorithms"}, {"score": 0.0024146842687658467, "phrase": "probability_theory_point"}, {"score": 0.002358220053411644, "phrase": "present_results"}, {"score": 0.002292199117499287, "phrase": "finite_valued_random_variables"}, {"score": 0.0022492129111567824, "phrase": "simple_yet_tight_upper_and_lower_bounds"}], "paper_keywords": ["Clustering", " Comparing partitions", " chi(2) divergence", " Misclassification error", " Rand index", " Convexity"], "paper_abstract": "In comparing clusterings, several different distances and indices are in use. We prove that the Misclassification Error distance, the Hamming distance (equivalent to the unadjusted Rand index), and the chi (2) distance between partitions are equivalent in the neighborhood of 0. In other words, if two partitions are very similar, then one distance defines upper and lower bounds on the other and viceversa. The proofs are geometric and rely on the concavity of the distances. The geometric intuitions themselves advance the understanding of the space of all clusterings. To our knowledge, this is the first result of its kind. Practically, distances are frequently used to compare two clusterings of a set of observations. But the motivation for this work is in the theoretical study of data clustering. Distances between partitions are involved in constructing new methods for cluster validation, determining the number of clusters, and analyzing clustering algorithms. From a probability theory point of view, the present results apply to any pair of finite valued random variables, and provide simple yet tight upper and lower bounds on the chi (2) measure of (in)dependence valid when the two variables are strongly dependent.", "paper_title": "Local equivalences of distances between clusterings-a geometric perspective", "paper_id": "WOS:000300589600003"}