{"auto_keywords": [{"score": 0.03776987454864924, "phrase": "contextual_variables"}, {"score": 0.024462482599881798, "phrase": "contextual_search"}, {"score": 0.011611120714036834, "phrase": "statistical_models"}, {"score": 0.006463271900845263, "phrase": "contextual_factors"}, {"score": 0.00481495049065317, "phrase": "growing_availability"}, {"score": 0.004757017456572827, "phrase": "electronic_form"}, {"score": 0.004671434158230026, "phrase": "www"}, {"score": 0.004587348052298537, "phrase": "computational_methods"}, {"score": 0.004559661374976129, "phrase": "large-scale_data_processing"}, {"score": 0.004491170257043608, "phrase": "information_retrieval"}, {"score": 0.00418907090251818, "phrase": "classical_search"}, {"score": 0.003978866233891427, "phrase": "users_relevance"}, {"score": 0.003942877273973905, "phrase": "retrieval_performance"}, {"score": 0.0038953958723049287, "phrase": "out-of-context_aspects"}, {"score": 0.0037449799711986, "phrase": "irrelevant_documents"}, {"score": 0.0036222340564869625, "phrase": "computational_framework"}, {"score": 0.0033989238477802864, "phrase": "real_world_entities"}, {"score": 0.003150900886669123, "phrase": "social_variables"}, {"score": 0.0030661003993462665, "phrase": "contextual_factor"}, {"score": 0.002833689453299307, "phrase": "users_relevance_assessment"}, {"score": 0.002658863179011018, "phrase": "current_search_context"}, {"score": 0.0022777800735119405, "phrase": "useful_publications"}, {"score": 0.002196342933346204, "phrase": "evaluation_methodologies"}, {"score": 0.0021049977753042253, "phrase": "contextual_search_tools"}], "paper_keywords": [""], "paper_abstract": "The growing availability of data in electronic form, the expansion of the World Wide Web (WWW) and the accessibility of computational methods for large-scale data processing have allowed researchers in Information Retrieval (IR) to design systems which can effectively and efficiently constrain search within the boundaries given by context, thus transforming classical search into contextual search. Because of the constraints imposed by context, contextual search better focuses on the users relevance and improves retrieval performance, since the out-of-context aspects of the search carried out by users that are likely linked to irrelevant documents are left apart. This survey introduces contextual search within a computational framework based on contextual variables, contextual factors and statistical models. The framework adopted in this survey considers the data observable from the real world entities participating in contextual search and classifies them as what we call contextual variables. The contextual variables considered are content, geotemporal, interaction, and social variables. Moreover, we distinguish between contextual variables and contextual factor : the former is what can be observed, the latter is what cannot be observed, yet this is the factor affecting the users relevance assessment. Therefore, in this survey, we describe how statistical models can process contextual variables to infer the contextual factors underlying the current search context. In this survey we provide a background to the subject by : placing it among other surveys on relevance, interaction, context, and behavior; providing the description of the contextual variables used for implementing the statistical models which represent and predict relevance and contextual factors; citing and surveying useful publications to the reader for further examination; providing an overview of the evaluation methodologies and findings relevant to this subject; and briefly describing some implementations of contextual search tools.", "paper_title": "Contextual Search: A Computational Framework", "paper_id": "WOS:000208978500001"}