{"auto_keywords": [{"score": 0.027619253127348243, "phrase": "saw_requirement"}, {"score": 0.00481495049065317, "phrase": "folding_problem"}, {"score": 0.004755650013733963, "phrase": "np-complete_one"}, {"score": 0.004716520738331953, "phrase": "first_investigations."}, {"score": 0.0037419747525425586, "phrase": "different_resolutions"}, {"score": 0.00371115485111022, "phrase": "artificial_intelligence_tools"}, {"score": 0.0036202043425301042, "phrase": "prediction_problem"}, {"score": 0.0035770224440318083, "phrase": "np"}, {"score": 0.0034306925765832633, "phrase": "backbone_structure"}, {"score": 0.0033465923623290034, "phrase": "low_resolution_models"}, {"score": 0.003132236287543072, "phrase": "free_energy"}, {"score": 0.0029437270961011077, "phrase": "acceptable_conformations"}, {"score": 0.002883439044844259, "phrase": "self-avoiding_walk"}, {"score": 0.0023834640793589435, "phrase": "real_biological_requirement"}, {"score": 0.002315367926547472, "phrase": "np_completeness"}, {"score": 0.0021049977753042253, "phrase": "research_work"}], "paper_keywords": ["Protein folding problem", " self-avoiding walk requirement", " NP-completeness", " graph theory", " pivot moves"], "paper_abstract": "To determine the 3D conformation of proteins is a necessity to understand their functions or interactions with other molecules. It is commonly admitted that, when proteins fold from their primary linear structures to their final 3D conformations, they tend to choose the ones that minimize their free energy. To find the 3D conformation of a protein knowing its amino acid sequence, bioinformaticians use various models of different resolutions and artificial intelligence tools, as the protein folding prediction problem is a NP complete one. More precisely, to determine the backbone structure of the protein using the low resolution models (2D HP square and 3D HP cubic), by finding the conformation that minimizes free energy, is intractable exactly. Both proofs of NP-completeness and the 2D prediction consider that acceptable conformations have to satisfy a self-avoiding walk (SAW) requirement, as two different amino acids cannot occupy a same position in the lattice. It is shown in this document that the SAW requirement considered when proving NP-completeness is different from the SAW requirement used in various prediction programs, and that they are different from the real biological requirement. Indeed, the proof of NP completeness and the predictions in silico consider conformations that are not possible in practice. Consequences of this fact are investigated in this research work.", "paper_title": "IS PROTEIN FOLDING PROBLEM REALLY A NP-COMPLETE ONE? FIRST INVESTIGATIONS", "paper_id": "WOS:000348346200005"}