{"auto_keywords": [{"score": 0.04325995756918345, "phrase": "natural_selection"}, {"score": 0.00481495049065317, "phrase": "sexual_multi-agent_systems"}, {"score": 0.00447341965028879, "phrase": "natural_organisms"}, {"score": 0.004423061344624088, "phrase": "genetic_variability"}, {"score": 0.004275347843870176, "phrase": "unexpressed_genes"}, {"score": 0.00417961150804265, "phrase": "conservative_sway"}, {"score": 0.003627800727103479, "phrase": "sexual_reproduction"}, {"score": 0.0035065523764817143, "phrase": "artificial_agents"}, {"score": 0.0033511469200347907, "phrase": "agent-oriented_modelling_platform"}, {"score": 0.0031665087019813244, "phrase": "sexual_agents"}, {"score": 0.0028919539528143535, "phrase": "diploidy"}, {"score": 0.002671263324230699, "phrase": "current_niche"}, {"score": 0.0026411384812121503, "phrase": "allele_dominance"}, {"score": 0.0024534188907003747, "phrase": "consistent_findings"}, {"score": 0.0024257447861185813, "phrase": "classical_population_genetics"}, {"score": 0.0021049977753042253, "phrase": "modeller's_motives"}], "paper_keywords": [""], "paper_abstract": "Diploidy and allele dominance are two mechanisms whereby natural organisms preserve genetic variability, in the form of unexpressed genes, from the conservative sway of natural selection. These may profoundly affect evolution, for it is variability upon which natural selection operates. Many multi-agent systems rely on evolutionary processes and sexual reproduction. However, sex in artificial agents often ignores diploidy and dominance. An agent-oriented modelling platform was used to compare the evolution of populations of sexual agents under four models: haploid genetic transmission versus diploid; and with either complete allele dominance versus none. Diploidy fulfils its promise of preserving variability, whereas haploidy quickly commits its possessors to the current niche. Allele dominance too preserves variability, and without sacrificing adaptivity. These results echo consistent findings in classical population genetics. Since both these factors strongly affect evolution, their inclusion in a model may improve both accuracy, and efficacy, according to the modeller's motives.", "paper_title": "Preserving variability in sexual multi-agent systems with diploidy and dominance", "paper_id": "WOS:000238506800012"}