{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cognitive_control_architecture"}, {"score": 0.015502273473651766, "phrase": "perception-action_cycle"}, {"score": 0.004529881123652277, "phrase": "brain_processing"}, {"score": 0.004466519142879166, "phrase": "visual_perception"}, {"score": 0.004342430078306461, "phrase": "cognitive_control"}, {"score": 0.004301834610818624, "phrase": "value_attribution"}, {"score": 0.004047020753789236, "phrase": "coherent_manner"}, {"score": 0.00351491577968631, "phrase": "separate_visuomotor_channels"}, {"score": 0.0034171734618737436, "phrase": "specific_visual_inputs"}, {"score": 0.0031695693589575916, "phrase": "suggested_visual_apparatus"}, {"score": 0.002967634471075658, "phrase": "motor_plans"}, {"score": 0.0028715299874549245, "phrase": "focus-of-attention_signal"}, {"score": 0.002765490759189057, "phrase": "correct_object"}, {"score": 0.002470237978694949, "phrase": "previous_experiences"}, {"score": 0.0023678143146455017, "phrase": "neurocomputational_mechanisms"}, {"score": 0.002323663295811215, "phrase": "experimental_brain_evidence"}], "paper_keywords": ["Saliency", " Attention", " Adaptive resonance theory", " Decision-making", " Value", " Reaching", " Grasping", " Affordances", " Perception-action cycle"], "paper_abstract": "We show aspects of brain processing on how visual perception, recognition, attention, cognitive control, value attribution, decision-making, affordances and action can be melded together in a coherent manner in a cognitive control architecture of the perception-action cycle for visually guided reaching and grasping of objects by a robot or an agent. The work is based on the notion that separate visuomotor channels are activated in parallel by specific visual inputs and are continuously modulated by attention and reward, which control a robot's/agent's action repertoire. The suggested visual apparatus allows the robot/agent to recognize both the object's shape and location, extract affordances and formulate motor plans for reaching and grasping. A focus-of-attention signal plays an instrumental role in selecting the correct object in its corresponding location as well as selects the most appropriate arm reaching and hand grasping configuration from a list of other configurations based on the success of previous experiences. The cognitive control architecture consists of a number of neurocomputational mechanisms heavily supported by experimental brain evidence: spatial saliency, object selectivity, invariance to object transformations, focus of attention, resonance, motor priming, spatial-to-joint direction transformation and volitional scaling of movement.", "paper_title": "A Cognitive Control Architecture for the Perception-Action Cycle in Robots and Agents", "paper_id": "WOS:000323373500008"}