{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chance_thresholds"}, {"score": 0.004726052718910578, "phrase": "association_rule"}, {"score": 0.004610058444728656, "phrase": "positive_frequent_itemsets"}, {"score": 0.004553128404612054, "phrase": "rule_generation"}, {"score": 0.004096635798793164, "phrase": "complementary_problem"}, {"score": 0.004046020290832207, "phrase": "negative_association_rule_mining"}, {"score": 0.003662892058072211, "phrase": "new_approach"}, {"score": 0.0034851070574149993, "phrase": "interesting_negative_association_rules"}, {"score": 0.0029645930408561086, "phrase": "support_threshold"}, {"score": 0.0028382152567141784, "phrase": "coincidental_itemsets"}, {"score": 0.0027684263985790526, "phrase": "individual_itemset"}, {"score": 0.0021715812867126884, "phrase": "pearson_phi_correlation"}, {"score": 0.0021049977753042253, "phrase": "minr"}], "paper_keywords": ["Association rule mining", " sporadic rules", " fisher exact test", " negative association rules", " chance threshold"], "paper_abstract": "Typically association rule mining only considers positive frequent itemsets in rule generation, where rules involving only the presence of items are generated. In this paper we consider the complementary problem of negative association rule mining, which generates rules describing the absence of itemsets from transactions. We describe a new approach called MINR (Mining Interesting Negative Rules) to efficiently find all interesting negative association rules. In our approach, we only consider the presence or absence of itemsets that are strongly associated. Our approach does not require a user defined support threshold, and is based on pruning coincidental itemsets. For every individual itemset we calculate two custom thresholds based on their support: the positive and negative chance thresholds. Itemsets whose support falls above their positive chance threshold are considered positively associated whereas itemsets whose support falls below its negative chance threshold are considered negatively associated. We compared our implementation against Pearson phi correlation and we note that MINR was able to generate sets of rules which are more interesting.", "paper_title": "Efficient negative association rule mining based on chance thresholds", "paper_id": "WOS:000332477600008"}