{"auto_keywords": [{"score": 0.026849568890147245, "phrase": "vrptw."}, {"score": 0.022004291180770838, "phrase": "exact_algorithms"}, {"score": 0.01061238630452144, "phrase": "vehicle_routing_problem"}, {"score": 0.010496797913898742, "phrase": "time_windows"}, {"score": 0.009003568919061225, "phrase": "vrptw"}, {"score": 0.003883850058095871, "phrase": "traveling_salesman_problem"}, {"score": 0.0034975571855450343, "phrase": "formulation_and_exact_solution"}, {"score": 0.0029805015010906013, "phrase": "detailed_analysis"}, {"score": 0.0027286224888843956, "phrase": "different_formulations"}, {"score": 0.0024434201175883674, "phrase": "general_decomposition_approach"}, {"score": 0.002200077887697072, "phrase": "polyhedral_structure"}, {"score": 0.0021049977753042253, "phrase": "possible_future_lines"}], "paper_keywords": ["vehicle routing", " time windows", " exact algorithms"], "paper_abstract": "In this paper we review the exact algorithms proposed in the last three decades for the solution of the vehicle routing problem with time windows (VRPTW). The exact algorithms for the VRPTW are in many aspects inherited from work on the traveling salesman problem (TSP). In recognition of this fact this paper is structured relative to four seminal papers concerning the formulation and exact solution of the TSP, i.e. the arc formulation, the arc-node formulation, the spanning tree formulation, and the path formulation. We give a detailed analysis of the formulations of the VRPTW and a review of the literature related to the different formulations. There are two main lines of development in relation to the exact algorithms for the VRPTW. One is concerned with the general decomposition approach and the solution to certain dual problems associated with the VRPTW. Another more recent direction is concerned with the analysis of the polyhedral structure of the VRPTW. We conclude by examining possible future lines of research in the area of the VRPTW. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Formulations and exact algorithms for the vehicle routing problem with time windows", "paper_id": "WOS:000253025300013"}