{"auto_keywords": [{"score": 0.05007833083333685, "phrase": "random_walks"}, {"score": 0.03989465578041379, "phrase": "cover_time"}, {"score": 0.0047872135686404275, "phrase": "random_uniform_hypergraphs"}, {"score": 0.004377077848734575, "phrase": "underlying_network"}, {"score": 0.00402514392911723, "phrase": "random_walk"}, {"score": 0.003910441483033426, "phrase": "random_vertex"}, {"score": 0.003876669922047053, "phrase": "randomly_selected_hyperedge"}, {"score": 0.003766182463933667, "phrase": "hypergraph_h."}, {"score": 0.0034832884999421374, "phrase": "complete_edge"}, {"score": 0.0033741997276290356, "phrase": "inform_time"}, {"score": 0.003287482882222731, "phrase": "inform_time_models"}, {"score": 0.002886110744751351, "phrase": "directional_transmission"}, {"score": 0.002861160152640875, "phrase": "ad-hoc_network"}, {"score": 0.0028037753646260937, "phrase": "transmission_range"}, {"score": 0.002141898874982106, "phrase": "edge_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Random walks", " Hypergraphs", " Cover time", " Random graphs"], "paper_abstract": "Random walks in graphs have been applied to various network exploration and network maintenance problems. In some applications, however, it may be more natural, and more accurate, to model the underlying network not as a graph but as a hypergraph, and solutions based on random walks require a notion of random walks in hypergraphs. At each step, a random walk on a hypergraph moves from its current position v to a random vertex in a randomly selected hyperedge containing v. We consider two definitions of cover time of a hypergraph H. If the walk sees only the vertices it moves between, then the usual definition of cover time, C(H), applies. If the walk sees the complete edge during the transition, then an alternative definition of cover time, the inform time I(H) is used. The notion of inform time models passive listening which fits the following types of situations. The particle is a rumour passing between friends, which is overheard by other friends present in the group at the same time. The particle is a message transmitted randomly from location to location by a directional transmission in an ad-hoc network, but all receivers within the transmission range can hear. In this paper we give an expression for C(H) which is tractable for many classes of hypergraphs, and calculate C(H) and I(H) exactly for random r-regular, s-uniform hypergraphs. We find that for such hypergraphs, whp, C(H)/I(H) similar to s(r - 1)/r, if rs = O((log log n)(1-epsilon)). For random r-regular, s-uniform multi-hypergraphs, constant r >= 2, and 3 <= s <= O(n(epsilon)), we also prove that, whp, I(H) = O((n/s) log n), i.e. the inform time decreases directly with the edge size s. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "The cover times of random walks on random uniform hypergraphs", "paper_id": "WOS:000327806300005"}