{"auto_keywords": [{"score": 0.04882787382338285, "phrase": "spanish_universities"}, {"score": 0.04192538265978381, "phrase": "university_websites"}, {"score": 0.040454428776653985, "phrase": "ehea"}, {"score": 0.004262643556463569, "phrase": "previous_research_work"}, {"score": 0.004173244935967375, "phrase": "uniweees_tool"}, {"score": 0.0037935066882208235, "phrase": "already_a_reality"}, {"score": 0.0035408501923902477, "phrase": "seven_criteria"}, {"score": 0.0030199761431186434, "phrase": "peer-to-peer_expert_unified_evaluation_methodology"}, {"score": 0.0024037949232582462, "phrase": "best_practices"}, {"score": 0.00229164285862567, "phrase": "evaluated_aspects"}, {"score": 0.0021387992835532367, "phrase": "quality_information_sources"}, {"score": 0.0021049977753042253, "phrase": "scholar_community"}], "paper_keywords": ["Quality assessment", " Web evaluation", " UNIWEEES tool", " European Higher Education Area", " Spanish universities", " Dissemination of information"], "paper_abstract": "This paper draws on the findings from previous research work to present the UNIWEEES tool, designed to evaluate the quality of university websites that provide information about the European Higher Education Area (EHEA), already a reality, and the way they disseminate this information. This tool includes seven criteria (visibility, authority, updatedness, accessibility, dissemination of information, quality assessment, and navigability), further divided into 29 subcriteria that include 60 indicators. A peer-to-peer expert unified evaluation methodology was followed. Findings are presented here, focusing on the strengths and weaknesses of the information provided about the EHEA by the websites of Spanish universities and their dissemination strategies, in particular through their evolution along the last 5 years. Conclusions highlight a number of best practices identified and provide some guidelines to improve the evaluated aspects and dimensions, thus strengthening the role played by the university websites as quality information sources for the scholar community and the society.", "paper_title": "Dissemination of information and visibility of the European Higher Education Area through the websites of Spanish universities: a longitudinal metric analysis, 2007-2012", "paper_id": "WOS:000330622600027"}