{"auto_keywords": [{"score": 0.0243543244580819, "phrase": "brazil"}, {"score": 0.00481495049065317, "phrase": "decentralized_management"}, {"score": 0.004700027722284931, "phrase": "new_hub_location_model"}, {"score": 0.00450000390667755, "phrase": "main_contribution"}, {"score": 0.004267004541988167, "phrase": "hub-and-spoke_network"}, {"score": 0.003516558537200823, "phrase": "subjective_ones"}, {"score": 0.0032232653428491435, "phrase": "origin-destination_pair"}, {"score": 0.002925899335792914, "phrase": "direct_route"}, {"score": 0.002707829887747594, "phrase": "network_user"}, {"score": 0.002655894070657161, "phrase": "hub_route"}, {"score": 0.0024107449502335583, "phrase": "integer_programming_formulation"}, {"score": 0.0023644936731468252, "phrase": "new_model"}, {"score": 0.0023079225317714815, "phrase": "intermodal_general_cargo_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hub location", " Network", " Integer programming", " Intermodal"], "paper_abstract": "We propose a new hub location model defined by the minimization of costs. The main contribution of this work is to permit the analysis of a hub-and-spoke network operated under \"decentralized management\". In this type of network, various transport companies act independently, and each makes its route choices according to its own criteria, which can include cost, time, frequency, security and other factors, including subjective ones. Therefore, due to the diversity of the various companies' criteria, one can expect that between each origin-destination pair, a fraction of the flow will be carried through hubs and a fraction will be carried by the direct route, to resolve this problem, it becomes necessary to determine the probability that any network user will choose the hub route for each trip to be made (or for each load to be carried). We present an integer programming formulation, subject the new model to experiments with an intermodal general cargo network in Brazil and address questions regarding the solution of the problem in practice. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The uncapacitated hub location problem in networks under decentralized management", "paper_id": "WOS:000290932100002"}