{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "graph_transformation"}, {"score": 0.015719716506582538, "phrase": "communication_protocols"}, {"score": 0.015458405179271837, "phrase": "formal_modeling"}, {"score": 0.00467424463996457, "phrase": "crucial_first_step"}, {"score": 0.004556901872357751, "phrase": "critical_communication_protocols"}, {"score": 0.004499334809770281, "phrase": "ip_telephony"}, {"score": 0.003829877278269543, "phrase": "boxos"}, {"score": 0.0036864465771943933, "phrase": "naive_methods"}, {"score": 0.003624429617337833, "phrase": "dynamic_evolution"}, {"score": 0.003578600071301459, "phrase": "reactive_communication_protocol"}, {"score": 0.003533347967582184, "phrase": "generated_model"}, {"score": 0.003287482882222731, "phrase": "local_features"}, {"score": 0.0029817668105720924, "phrase": "graph_transformation_semantics"}, {"score": 0.002870006736445581, "phrase": "clean_separation"}, {"score": 0.002762423953243486, "phrase": "dfc_semantics"}, {"score": 0.0026929458952693465, "phrase": "individual_telephones"}, {"score": 0.0026363807171515255, "phrase": "communication_structures"}, {"score": 0.0024114635128122783, "phrase": "even_modestly_sized_communication_protocols"}, {"score": 0.0023408288327263316, "phrase": "powerful_formalism"}, {"score": 0.002205692205167157, "phrase": "relative_ease"}, {"score": 0.0021229583685841405, "phrase": "likely_avenues"}], "paper_keywords": [""], "paper_abstract": "Formal modeling is a crucial first step in the analysis of safety critical communication protocols such as IP Telephony. These protocols are notoriously resistant to formal modeling due to their sheer size and complexity. We propose using graph transformation, a straight forward, visual approach to do this. In experiments with Distributed Feature Composition (DFC) protocol and its implementation in BoxOs, we find that graph transformation offers several key advantages over naive methods in modeling the dynamic evolution of A reactive communication protocol. The generated model closely follows the way in which communication protocols are typically separated into three levels: the first describing local features or components, the second characterizing interactions among components, and the third showing the evolution of the component set. The graph transformation semantics described here follows this scheme, enabling a clean separation of concerns when describing a protocol. Using DFC semantics one can easily focus on individual telephones, features, and communication structures without reference to components not directly of interest. This separation is a key to being able to deal with even modestly sized communication protocols. Graph transformation is also a powerful formalism, allowing for very expressive and accurate modeling of the systems under study. Finally, the relative ease of using this semantics is demonstrated, and likely avenues for further use are outlined.", "paper_title": "Formal modeling of communication protocols by graph transformation", "paper_id": "WOS:000240312100024"}