{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "skyline_operator"}, {"score": 0.008091770364408554, "phrase": "unexpected_information"}, {"score": 0.007913665829681478, "phrase": "query_output"}, {"score": 0.004502943680955863, "phrase": "multicriteria_decision_making"}, {"score": 0.004248869786808024, "phrase": "flexiq"}, {"score": 0.004063186599879217, "phrase": "query_intent"}, {"score": 0.0038338299812503, "phrase": "search_space"}, {"score": 0.0037827603118271757, "phrase": "proposed_query_refinement_algorithms"}, {"score": 0.003732368382223596, "phrase": "user_feedback"}, {"score": 0.0032347516831068685, "phrase": "initial_query"}, {"score": 0.00303839203670705, "phrase": "expected_information"}, {"score": 0.0029978863469038914, "phrase": "refined_query_output"}, {"score": 0.002451088210833819, "phrase": "refined_query"}, {"score": 0.002162316557411786, "phrase": "decision_tree_based_query_refinement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Skyline operator", " User feedback", " Query refinement"], "paper_abstract": "Skyline operator has gained much attention in the last decade and is proved to be valuable for multicriteria decision making. This paper presents a novel Flexible Interactive Querying (FlexIQ) framework for user feedback-based Select-Project-Join (SPJ) query refinement in databases. In FlexIQ, the user feedback is used to discover the query intent. In addition, we have used the skyline operator to confine the search space of the proposed query refinement algorithms. The user feedback consists of both unexpected information currently present in the query output and expected information that is missing from the query output. Once the feedback is given by the user, our framework refines the initial query by exploiting the skyline operator to minimize the unexpected information as well as maximize the expected information in the refined query output. In our framework, the user can also control different quality metric such as quality of results (e.g., false positive rates, false negative rates and accuracy) and complexity (i.e., quantified as the number of subqueries) in the refined query. We have validated our framework both theoretically and experimentally. In particular, we have demonstrated the effectiveness of our proposed framework by comparing its performance with the nai ve decision tree based query refinement. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "FlexIQ: A flexible interactive Querying Framework by Exploiting the Skyline Operator", "paper_id": "WOS:000343352500006"}