{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high-performance_motorcycles"}, {"score": 0.041549881369567554, "phrase": "conventional_steering_damper"}, {"score": 0.0047395356621991935, "phrase": "fixed-parameter_active_steering_compensation_scheme"}, {"score": 0.004568108391981922, "phrase": "dynamic_behaviour"}, {"score": 0.004402854153653114, "phrase": "design_methodology"}, {"score": 0.004288472456976113, "phrase": "clover-mcfarlane_r_loop-shaping_procedure"}, {"score": 0.004025885154716127, "phrase": "possible_replacement"}, {"score": 0.0036424917384748024, "phrase": "active_compensation"}, {"score": 0.0029972030224205506, "phrase": "software_implementation"}, {"score": 0.0028734230458881903, "phrase": "compensator_parameters"}, {"score": 0.002640947693258573, "phrase": "computer_simulations"}, {"score": 0.0025858215477025117, "phrase": "state-of-the-art_motorcycle_model"}, {"score": 0.0023891283748647416, "phrase": "significant_improvements"}, {"score": 0.002339246282204109, "phrase": "dynamic_properties"}, {"score": 0.0023025177990160487, "phrase": "primary_oscillatory_modes"}, {"score": 0.0021049977753042253, "phrase": "passive_mechanical_steering_compensation_schemes"}], "paper_keywords": [""], "paper_abstract": "A fixed-parameter active steering compensation scheme that is designed to improve the dynamic behaviour of high-performance motorcycles is introduced. The design methodology is based on the Clover-McFarlane R loop-shaping procedure. The steering compensator so designed, is seen as a possible replacement for a conventional steering damper, or as an alternative to the more recently introduced passive mechanical compensation networks. In comparison with these networks, active compensation has several potential advantages including: (i) the positive-reality of the compensator is no longer a requirement; (ii) it is no longer necessary for the device to be low-order; (iii) in a software implementation, it is easy to adjust the compensator parameters and (iv) an adaptive, or parameter varying version of this scheme is a routine extension. The study makes use of computer simulations that exploit a state-of-the-art motorcycle model whose parameter set is based on a Suzuki GSX-R1000 sports machine. The results extend further the significant improvements achieved in the dynamic properties of the primary oscillatory modes ('wobble' and 'weave') obtained previously by replacing the conventional steering damper with passive mechanical steering compensation schemes.", "paper_title": "An H-infinity loop-shaping approach to steering control for high-performance motorcycles", "paper_id": "WOS:000236901900014"}