{"auto_keywords": [{"score": 0.03851553789741941, "phrase": "web_site"}, {"score": 0.005373207690463452, "phrase": "web_site_stickiness"}, {"score": 0.00481495049065317, "phrase": "internet_users"}, {"score": 0.00469678464293492, "phrase": "specific_web_site"}, {"score": 0.004305481798183612, "phrase": "on-line_companies"}, {"score": 0.004071249707923223, "phrase": "substantial_resources"}, {"score": 0.0032546105164772995, "phrase": "persistent_web_site-user_relationship"}, {"score": 0.003115908199991072, "phrase": "relationship_marketing"}, {"score": 0.0029097582786754444, "phrase": "user's_perspective"}, {"score": 0.0026013505538490223, "phrase": "key_mediating_variables"}, {"score": 0.0021715812867126884, "phrase": "stickiness_intention"}, {"score": 0.0021049977753042253, "phrase": "significant_association"}], "paper_keywords": ["commitment", " continuous use", " partial least squares", " relationships", " trust", " Web site stickiness"], "paper_abstract": "To prevent users from switching to competitors, on-line companies in the B2C market are implementing various technologies and investing substantial resources to enhance the \"stickiness\" of their Web sites. The authors propose that users stick with a Web site through a process of developing a relationship with it. Thus, sticking with a Web site reflects a persistent Web site-user relationship. Theories from social psychology and relationship marketing are used to develop a model of Web site stickiness from the user's perspective. The model focuses on the relationship between user and Web site, with commitment and trust as key mediating variables. A total of 239 users responded to a survey concerning Web site stickiness. The survey results supported all the hypotheses generated from the model and explained 70 percent of the variance in stickiness intention. There was a significant association between intention to stick with a Web site and commitment to and trust in the Web site. Implications for theory and practice are discussed.", "paper_title": "Why do Internet users stick with a specific Web site? A relationship perspective", "paper_id": "WOS:000239226000005"}