{"auto_keywords": [{"score": 0.041976525668421034, "phrase": "crepe"}, {"score": 0.00481495049065317, "phrase": "fine-grained_context-related_policies"}, {"score": 0.004322967486451877, "phrase": "wide_adoption"}, {"score": 0.0038985392250620483, "phrase": "context-related_policy_enforcement_system"}, {"score": 0.0037608593980593035, "phrase": "context-related_access_control"}, {"score": 0.003628024127607343, "phrase": "first_work"}, {"score": 0.0035156341294017685, "phrase": "smartphone_environment"}, {"score": 0.002833035775182696, "phrase": "third_parties"}, {"score": 0.0027825094419000637, "phrase": "context-related_policies"}, {"score": 0.0024865049605998723, "phrase": "sms"}, {"score": 0.002442121586461567, "phrase": "bluetooth"}, {"score": 0.0024093494406195386, "phrase": "qr-code"}, {"score": 0.002366361492754389, "phrase": "thorough_set"}, {"score": 0.002262209824105154, "phrase": "negligible_overhead"}, {"score": 0.0022218413146898887, "phrase": "energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "production_environment"}], "paper_keywords": ["Android security", " context policy", " smartphone security"], "paper_abstract": "Current smartphone systems allow the user to use only marginally contextual information to specify the behavior of the applications: this hinders the wide adoption of this technology to its full potential. In this paper, we fill this gap by proposing CRePE, a fine-grained Context-Related Policy Enforcement System for Android. While the concept of context-related access control is not new, this is the first work that brings this concept into the smartphone environment. In particular, in our work, a context can be defined by: the status of variables sensed by physical (low level) sensors, like time and location; additional processing on these data via software (high level) sensors; or particular interactions with the users or third parties. CRePE allows context-related policies to be set (even at runtime) by both the user and authorized third parties locally (via an application) or remotely (via SMS, MMS, Bluetooth, and QR-code). A thorough set of experiments shows that our full implementation of CRePE has a negligible overhead in terms of energy consumption, time, and storage, making our system ready for a production environment.", "paper_title": "CRePE: A System for Enforcing Fine-Grained Context-Related Policies on Android", "paper_id": "WOS:000308711100002"}