{"auto_keywords": [{"score": 0.04974208475172307, "phrase": "multiple_ontologies"}, {"score": 0.029828250733092348, "phrase": "different_ontologies"}, {"score": 0.02589504504769444, "phrase": "related_works"}, {"score": 0.00481495049065317, "phrase": "semantic_similarity_estimation"}, {"score": 0.004680851157467745, "phrase": "biomedical_domain"}, {"score": 0.004582722012454012, "phrase": "semantic_similarity"}, {"score": 0.004502513902377422, "phrase": "valuable_tool"}, {"score": 0.004408106853358092, "phrase": "textual_resources"}, {"score": 0.004285289574869884, "phrase": "general-purpose_solutions"}, {"score": 0.00422516469733364, "phrase": "concrete_fields"}, {"score": 0.0041074234667687875, "phrase": "ontology-based_approaches"}, {"score": 0.0038271712887391015, "phrase": "large_and_consensus_ontologies"}, {"score": 0.0037868092509097404, "phrase": "word_net"}, {"score": 0.0037204810269996476, "phrase": "umls"}, {"score": 0.0034057975804778293, "phrase": "ontological_detail"}, {"score": 0.003241312187060814, "phrase": "existing_methodologies"}, {"score": 0.0031397776924946526, "phrase": "heterogeneous_knowledge_sources"}, {"score": 0.0030738557655525913, "phrase": "simple_terminological_matchings"}, {"score": 0.0030521898646210413, "phrase": "ontological_concepts"}, {"score": 0.002863921785266393, "phrase": "modelled_taxonomical_knowledge"}, {"score": 0.0025846562485378247, "phrase": "similarity_estimation"}, {"score": 0.0021885820862000962, "phrase": "similarity_assessments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Semantic similarity", " Multiple ontologies", " MeSH", " Word Net"], "paper_abstract": "The estimation of the semantic similarity between terms provides a valuable tool to enable the understanding of textual resources. Many semantic similarity computation paradigms have been proposed both as general-purpose solutions or framed in concrete fields such as biomedicine. In particular, ontology-based approaches have been very successful due to their efficiency, scalability, lack of constraints and thanks to the availability of large and consensus ontologies (like Word Net or those in the UMLS). These measures, however, are hampered by the fact that only one ontology is exploited and, hence, their recall depends on the ontological detail and coverage. In recent years, some authors have extended some of the existing methodologies to support multiple ontologies. The problem of integrating heterogeneous knowledge sources is tackled by means of simple terminological matchings between ontological concepts. In this paper, we aim to improve these methods by analysing the similarity between the modelled taxonomical knowledge and the structure of different ontologies. As a result, we are able to better discover the commonalities between different ontologies and hence, improve the accuracy of the similarity estimation. Two methods are proposed to tackle this task. They have been evaluated and compared with related works by means of several widely-used benchmarks of biomedical terms using two standard ontologies (Word Net and MeSH). Results show that our methods correlate better, compared to related works, with the similarity assessments provided by experts in biomedicine. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Enabling semantic similarity estimation across multiple ontologies: An evaluation in the biomedical domain", "paper_id": "WOS:000300478800014"}