{"auto_keywords": [{"score": 0.03411394799533831, "phrase": "suitable_normalizations"}, {"score": 0.033733451481772744, "phrase": "phylogenetic_information"}, {"score": 0.02947563856752874, "phrase": "rank-based_normalization"}, {"score": 0.025307768415117598, "phrase": "distance_functions"}, {"score": 0.004814966223571471, "phrase": "metagenomics"}, {"score": 0.004677847043645765, "phrase": "unculturable_microorganisms"}, {"score": 0.0046240999614456605, "phrase": "different_environments"}, {"score": 0.004466519142879166, "phrase": "compositional_differences"}, {"score": 0.004339293854115301, "phrase": "important_and_challenging_problem"}, {"score": 0.004048483412089098, "phrase": "functional_profiles"}, {"score": 0.004001938457469328, "phrase": "taxonomic_distributions"}, {"score": 0.0029794666460666646, "phrase": "real_and_synthetic_data_sets"}, {"score": 0.0028944757265206332, "phrase": "significant_improvement"}, {"score": 0.002861160152640875, "phrase": "sample_clustering"}, {"score": 0.0025929837295811673, "phrase": "real_or_synthetic_microbiomes"}, {"score": 0.0021049977753042253, "phrase": "reliable_clustering_results"}], "paper_keywords": ["Metagenomics", " normalization", " phylogenetic information", " distance functions", " clustering"], "paper_abstract": "Metagenomics enables the study of unculturable microorganisms in different environments directly. Discriminating between the compositional differences of metagenomes is an important and challenging problem. Several distance functions have been proposed to estimate the differences based on functional profiles or taxonomic distributions; however, the strengths and limitations of such functions are still unclear. Initially, we analyzed three well-known distance functions and found very little difference between them in the clustering of samples. This motivated us to incorporate suitable normalizations and phylogenetic information into the functions so that we could cluster samples from both real and synthetic data sets. The results indicate significant improvement in sample clustering over that derived by rank-based normalization with phylogenetic information, regardless of whether the samples are from real or synthetic microbiomes. Furthermore, our findings suggest that considering suitable normalizations and phylogenetic information is essential when designing distance functions for estimating the differences between metagenomes. We conclude that incorporating rank-based normalization with phylogenetic information into the distance functions helps achieve reliable clustering results.", "paper_title": "The Impact of Normalization and Phylogenetic Information on Estimating the Distance for Metagenomes", "paper_id": "WOS:000299560500027"}