{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "canonical_correlation_analysis"}, {"score": 0.04398714383022719, "phrase": "structural_features_field"}, {"score": 0.014408104682350115, "phrase": "outlier_analysis"}, {"score": 0.004592016716046632, "phrase": "structural_condition_assessment"}, {"score": 0.0036470559917231218, "phrase": "linear_regression_model"}, {"score": 0.0029355502535757696, "phrase": "statistical_method"}, {"score": 0.0028569549040495163, "phrase": "extreme_value_distribution_theory"}, {"score": 0.0025630077791393125, "phrase": "structural_condition"}, {"score": 0.0024111277643627154, "phrase": "numerical_example"}, {"score": 0.00237861522566195, "phrase": "cable-stayed_bridge"}, {"score": 0.0021049977753042253, "phrase": "different_structural_conditions"}], "paper_keywords": ["condition analysis", " canonical correlation analysis", " extreme value distribution", " outlier analysis"], "paper_abstract": "A method of structural condition assessment based on the canonical correlation analysis and outlier analysis was proposed. Assuming that the structural features field and the environmental factors field were known, the predictors of two fields can be calculated by the canonical correlation analysis and a linear regression model or other method can be used to describe the relationship of the predictors. So the residual was calculated by the difference between the structural features field measured and the structural features field estimated. The statistical method, such as extreme value distribution theory, is proceeding to estimate the threshold of the residual. The novelty of the structural condition can be detected by outlier analysis. Finally a numerical example of cable-stayed bridge validated the method proposed in this paper. The results show that this method can effectively distinguish different structural conditions.", "paper_title": "STRUCTURAL CONDITION ASSESSMENT BASED ON CANONICAL CORRELATION ANALYSIS AND OUTLIER ANALYSIS", "paper_id": "WOS:000283468700005"}