{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "content_similarity"}, {"score": 0.004544127927346964, "phrase": "enormous_amount"}, {"score": 0.004356741449157895, "phrase": "widespread_use"}, {"score": 0.004311109608629196, "phrase": "digital_equipment"}, {"score": 0.004068510313497539, "phrase": "vast_amount"}, {"score": 0.00398370478688858, "phrase": "scalable_data_management_systems"}, {"score": 0.0035477930970463432, "phrase": "next_challenge"}, {"score": 0.0031098631445657158, "phrase": "wide_spectrum"}, {"score": 0.0030772505522663612, "phrase": "novel_data-centric_applications"}, {"score": 0.0029657683623403085, "phrase": "high_quality"}, {"score": 0.002654911400878851, "phrase": "similar_content"}, {"score": 0.002518525107994039, "phrase": "content_retrieval"}, {"score": 0.0023640560785711923, "phrase": "reduced_network_traffic"}, {"score": 0.0021049977753042253, "phrase": "large-scale_simulations"}], "paper_keywords": ["Peer-to-peer systems", " Content search", " Self-organizing overlay networks"], "paper_abstract": "The advent of the World Wide Web has made an enormous amount of information available to everyone and the widespread use of digital equipment enables end-users (peers) to produce their own digital content. This vast amount of information requires scalable data management systems. Peer-to-peer (P2P) systems have so far been well established in several application areas, with file-sharing being the most prominent. The next challenge that needs to be addressed is (more complex) data sharing, management and query processing, thus facilitating the delivery of a wide spectrum of novel data-centric applications to the end-user, while providing high Quality-of-Service. In this paper, we propose a self-organizing P2P system that is capable to identify peers with similar content and intentionally assign them to the same super-peer. During content retrieval, fewer super-peers need to be contacted and therefore efficient similarity search is supported, in terms of reduced network traffic and contacted peers. Our approach increases the responsiveness and reliability of a P2P system and we demonstrate the advantages of our approach using large-scale simulations.", "paper_title": "Efficient search based on content similarity over self-organizing P2P networks", "paper_id": "WOS:000284093200007"}