{"auto_keywords": [{"score": 0.04477369047410237, "phrase": "e-mail_messages"}, {"score": 0.009515627722220445, "phrase": "entire_contents"}, {"score": 0.009242624666868272, "phrase": "suspicious_keywords"}, {"score": 0.005232320465119433, "phrase": "spamassassin"}, {"score": 0.00481495049065317, "phrase": "bad_neighborhoods"}, {"score": 0.003923269062268688, "phrase": "interesting_question"}, {"score": 0.0035541673947328163, "phrase": "alternative_spam_detection_approach"}, {"score": 0.003315374849824563, "phrase": "possible_links"}, {"score": 0.0030032915123993837, "phrase": "ip_addresses"}, {"score": 0.0026711292765356064, "phrase": "novel_idea"}, {"score": 0.002565626044684815, "phrase": "'bad_neighborhoods"}, {"score": 0.0023496433751182162, "phrase": "mail_server_log_files"}, {"score": 0.0022568093356079414, "phrase": "remarkably_good_detection_capabilities"}, {"score": 0.0021597049163247476, "phrase": "mail_server"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "One of the most annoying problems on the Internet is spam. To fight spam, many approaches have been proposed over the years. Most of these approaches involve scanning the entire contents of e-mail messages in an attempt to detect suspicious keywords and patterns. Although such approaches are relatively effective, they also show some disadvantages. Therefore an interesting question is whether it would be possible to effectively detect spam without analyzing the entire contents of e-mail messages. The contribution of this paper is to present an alternative spam detection approach, which relies solely on analyzing the origin (IP address) of e-mail messages, as well as possible links within the e-mail messages to websites (URIs). Compared to analyzing suspicious keywords and patterns, detection and analysis of URIs is relatively simple. The IP addresses and URIs are compared to various kinds of blacklists; a hit increases the probability of the message being spam. Although the idea of using blacklists is well known, the novel idea proposed within this paper is to introduce the concept of 'bad neighborhoods'. To validate our approach, a prototype has been developed and tested on our university's mail server. The outcome was compared to SpamAssassin and mail server log files. The result of that comparison was that our prototype showed remarkably good detection capabilities (comparable to SpamAssassin), but puts only a small load on the mail server. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Filtering spam from bad neighborhoods", "paper_id": "WOS:000284214000004"}