{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "magnetic_field"}, {"score": 0.01215558110671096, "phrase": "cold_crucible"}, {"score": 0.007947352194342804, "phrase": "directional_solidification"}, {"score": 0.004751889650408546, "phrase": "electromagnetic_cold_crucible"}, {"score": 0.004429191773525288, "phrase": "numerical_calculation_method"}, {"score": 0.003916098498242888, "phrase": "uniform_magnetic_field"}, {"score": 0.0034319005131102495, "phrase": "different_tial_ingots"}, {"score": 0.0033572130837348623, "phrase": "different_cold_crucibles"}, {"score": 0.0028151944356239952, "phrase": "statistical_methods"}, {"score": 0.002790511479398411, "phrase": "numerical_calculation_results"}, {"score": 0.002623669616798891, "phrase": "crucible_configuration"}, {"score": 0.0025892330566358503, "phrase": "lower_frequency"}, {"score": 0.0025665261770229757, "phrase": "better_uniformity"}, {"score": 0.0022687189700002254, "phrase": "quantitative_study"}, {"score": 0.002238930800075706, "phrase": "distribution_characteristics"}, {"score": 0.0021049977753042253, "phrase": "tial_ingots"}], "paper_keywords": ["Cold crucible", " Finite element", " Magnetic fields", " Uniformity", " Directional solidification", " TiAl alloys", " Finite element analysis"], "paper_abstract": "Purpose - The purpose of this paper is to introduce a numerical calculation method to study the uniformity of the magnetic field in a cold crucible used for directional solidification (DS) and provide information for designing a cold crucible that can induce a uniform magnetic field. Design/methodology/approach - To obtain the characteristics of the magnetic field in a cold crucible and its influence on the directional solidification processing, based on experimental verification, 3-D finite element (FE) models with different crucible configuration-elements and power parameters were established to study the uniformity of the magnetic field in a cold crucible. In addition, different TiAl ingots were directionally solidified with different cold crucibles, and the solid/liquid (S/L) interfaced were examined to investigate the effect of the magnetic field on the macrostructure of those ingots. Findings - The uniformity of the magnetic field in a given domain can be quantitatively analyzed by statistical methods. Numerical calculation results showed that the uniformity of the magnetic field can be improved by optimizing the crucible configuration and adopting lower frequency. Better uniformity of the magnetic field in a cold crucible is beneficial to directional solidification. Originality/value - The calculation of the uniformity of the magnetic field is proposed as a method for quantitative study of the distribution characteristics of the magnetic field in a cold crucible. The relationship between the S/L interfaces of TiAl ingots and the uniformity of the magnetic field is initially characterised; additionally, techniques for improving the uniformity of the magnetic field in a cold crucible are suggested.", "paper_title": "Uniformity analysis of magnetic field in an electromagnetic cold crucible used for directional solidification", "paper_id": "WOS:000318456300018"}