{"auto_keywords": [{"score": 0.049522654987196275, "phrase": "web-based_discussion_boards"}, {"score": 0.00481495049065317, "phrase": "customer_knowledge"}, {"score": 0.004523865550323285, "phrase": "web-based_technologies"}, {"score": 0.004367898947304223, "phrase": "better_understanding"}, {"score": 0.003931402465972151, "phrase": "discussion_boards"}, {"score": 0.00373701482510911, "phrase": "knowledge_sharing"}, {"score": 0.0034971932704828197, "phrase": "key_factors"}, {"score": 0.0030387767523076528, "phrase": "knowledge_self-efficacy"}, {"score": 0.00300339527261653, "phrase": "mostly_cited_reason"}, {"score": 0.002810520668490478, "phrase": "exploratory_analysis"}, {"score": 0.002766963729586353, "phrase": "underlying_reasons"}, {"score": 0.002579140290642792, "phrase": "multiple_theoretical_perspectives"}, {"score": 0.00253916011199984, "phrase": "social_and_technical_domains"}, {"score": 0.0024418934977061876, "phrase": "practical_implications_-_building"}, {"score": 0.002311933249234786, "phrase": "web_designers"}, {"score": 0.00228499525153, "phrase": "customer_sharing"}, {"score": 0.002163367190715979, "phrase": "first_studies"}, {"score": 0.002129818297734379, "phrase": "socio-technical_perspective"}, {"score": 0.0021049977753042253, "phrase": "customer_knowledge_sharing_phenomena"}], "paper_keywords": ["electronic commerce", " knowledge management", " knowledge sharing"], "paper_abstract": "Purpose - The proliferation and advance of web-based technologies create expanded opportunities for retailers to gain a better understanding of their customers. However, the success of these web-based discussion boards depends solely on whether customers are willing to share their knowledge and experience with other customers in these discussion boards. Thus, this study aims at identifying the factors that drive knowledge sharing among customers in web-based discussion boards. Design/methodology/approach - An exploratory study with 104 respondents was conducted to identify and categorize the key factors of customer knowledge sharing in web-based discussion boards. Findings - The results indicate that the enjoyment of helping others is the most frequently cited reason for customer knowledge sharing in web-based discussion boards. On the other hand, the lack of knowledge self-efficacy is the mostly cited reason explaining why customers do not want to share knowledge with others. Research limitations/implications - The exploratory analysis suggests that the underlying reasons that motivate and inhibit customers to share are very different. There is a need to integrate multiple theoretical perspectives from across the social and technical domains if this phenomenon is to be better understood. Practical implications - Building upon the findings of this study, some generic guidelines for retailers and web designers for promoting customer sharing in web-based discussion boards are outlined. Originality/value - This research is one of the first studies to use the socio-technical perspective to investigate customer knowledge sharing phenomena in web-based discussion boards.", "paper_title": "Understanding customer knowledge sharing in web-based discussion boards - An exploratory study", "paper_id": "WOS:000241266700005"}