{"auto_keywords": [{"score": 0.04752705852086144, "phrase": "dnse"}, {"score": 0.010438527539376994, "phrase": "multiple_simulations"}, {"score": 0.007740489288296054, "phrase": "distributed_network_simulation_environment"}, {"score": 0.004762550320451225, "phrase": "computer_networks_education"}, {"score": 0.004459857205489101, "phrase": "grid_technology"}, {"score": 0.004130842663662047, "phrase": "network_scenarios"}, {"score": 0.003743102131902864, "phrase": "multiple_distributed_simulations"}, {"score": 0.0035435867326548665, "phrase": "reasonable_amount"}, {"score": 0.003175792987190499, "phrase": "intuitive_gui"}, {"score": 0.002753971418809189, "phrase": "performance_analysis"}, {"score": 0.0024011766029754006, "phrase": "students_evidence"}, {"score": 0.0022980978400845144, "phrase": "real_learning_scenario"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["network simulation", " computer networks education", " distributed application", " grid services"], "paper_abstract": "This paper presents a Distributed Network Simulation Environment (DNSE) based on grid technology that, unlike the well-known ns-2 simulator, provides two important features that facilitate the study of network scenarios that require running multiple simulations. First, the DNSE is capable of automatically handling the realization of multiple distributed simulations with the aim of completing all simulations in a reasonable amount of time. Second, the DNSE integrates the realization of simulations with the analysis of their results in an intuitive GUI in order to relieve students from the burden of launching multiple simulations and handling the many output files that may be generated to study the results. The performance analysis of the DNSE shows that it can significantly reduce the time required to complete multiple simulations. Furthermore, the assessment of an experience with students evidence that the DNSE can successfully support a real learning scenario and that students prefer using the DNSE over the ns-2. (C) 2010 Wiley Periodicals, Inc. Comput Appl Eng Educ 20: 654665, 2012", "paper_title": "A grid service-based Distributed Network Simulation Environment for computer networks education", "paper_id": "WOS:000310081000009"}