{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "coordination_control"}, {"score": 0.004620093797504386, "phrase": "discrete-time_homogeneous_linear_multiagent_systems"}, {"score": 0.004342430078306461, "phrase": "structural_confinement"}, {"score": 0.004209893377338457, "phrase": "general_setting"}, {"score": 0.0038758293658651237, "phrase": "existing_models"}, {"score": 0.0033190180867511605, "phrase": "different_analyses"}, {"score": 0.0025892330566358503, "phrase": "closed_strong_components"}, {"score": 0.0025361866386341796, "phrase": "coordination_analysis"}, {"score": 0.0022168460543913787, "phrase": "matrix_analysis"}, {"score": 0.0021714122348552747, "phrase": "linear_system_theory"}, {"score": 0.0021049977753042253, "phrase": "algebraic_graph_theory"}], "paper_keywords": ["Arbitrary network topology", " collective behavior", " coordination control", " linear multiagent systems (MASs)"], "paper_abstract": "This paper formulates the coordination control for continuous- and discrete-time homogeneous linear multiagent systems under network topology without any structural confinement. This general setting is proved to unify most of the existing models, such as (leaderless and leader-following) synchronization/consensus control and containment control, which are usually considered separately using different analyses, within the same framework. More important, it unravels the most general collective behavior inherent in the network of diffusively coupled agents with identical dynamics: agents outside the closed strong components asymptotically move into the convex space spanned by those agents in the closed strong components. Coordination analysis for such a general framework is successfully performed based on the exploitation of tools from matrix analysis, linear system theory, and algebraic graph theory.", "paper_title": "Collective Behavior for Group of Generic Linear Agents Interacting Under Arbitrary Network Topology", "paper_id": "WOS:000365086400007"}