{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "handling_fuzzy_membership"}, {"score": 0.004552981066668676, "phrase": "information_exchange"}, {"score": 0.004398872331144531, "phrase": "semantic_web"}, {"score": 0.004213519983188574, "phrase": "crisp_sets"}, {"score": 0.0040708542958968605, "phrase": "clear_boundaries"}, {"score": 0.003916098498242888, "phrase": "existing_ontology_models"}, {"score": 0.0033971539563683174, "phrase": "cognitive_psychologists"}, {"score": 0.003212074324593725, "phrase": "formal_model"}, {"score": 0.0031845067058084583, "phrase": "fuzzy_ontologies"}, {"score": 0.002555950807368337, "phrase": "human_thinking"}, {"score": 0.0024799423362011582, "phrase": "in-depth_investigation"}, {"score": 0.002427035025924384, "phrase": "existing_models"}, {"score": 0.0023855210798264205, "phrase": "cognitive_psychology"}, {"score": 0.002150900082318562, "phrase": "ontology_model"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_propositional_modal_logic"}], "paper_keywords": ["fuzzy ontology", " cognitive model", " typicality", " likeliness", " modal logic"], "paper_abstract": "Ontology has become increasingly important in facilitating information exchange, particularly in the context of the Semantic Web. Currently, most existing ontology models can only specify concepts as crisp sets. However, concepts that are without clear boundaries or are vague in meanings are abundant. Existing ontology models are therefore unable to cope with many real cases effectively. In addition, with respect to a certain category, certain objects can be considered as more representative or typical, which are explained by cognitive psychologists using the Prototype Theory of concepts. Based on this theory, we propose a formal model for fuzzy ontologies. This model is equipped with likeliness, the extent to which an object is considered as an instance of a concept, and typicality, the representativeness of an object in a concept. This model enables ontologies to model concepts and bring the results of reasoning closer to human thinking. Our work is based on an in-depth investigation of the limitations of existing models and findings in cognitive psychology. The nature and differences between likeliness and typicality are also thoroughly discussed. In addition, we present a logic for the ontology model which is based on fuzzy propositional modal logic.", "paper_title": "A Formal Model of Ontology for Handling Fuzzy Membership and Typicality of Instances", "paper_id": "WOS:000274974800007"}