{"auto_keywords": [{"score": 0.04971911912939944, "phrase": "multi-resolution_video_servers"}, {"score": 0.04659271537366934, "phrase": "disk_bandwidth"}, {"score": 0.044775125169566846, "phrase": "data_rates"}, {"score": 0.00481495049065317, "phrase": "resource-effective_admission_control"}, {"score": 0.004567230180529598, "phrase": "balanced_use"}, {"score": 0.004532892812505505, "phrase": "system_resources"}, {"score": 0.004315879542755464, "phrase": "data_retrieval_size"}, {"score": 0.004251210982670317, "phrase": "video_streams"}, {"score": 0.003897659323896113, "phrase": "appropriate_data_retrieval_size"}, {"score": 0.003641528016135388, "phrase": "new_clients"}, {"score": 0.0030606302942851027, "phrase": "admitted_clients"}, {"score": 0.0030376011055855802, "phrase": "ssr"}, {"score": 0.0029920129598858545, "phrase": "striping_unit"}, {"score": 0.0028271058251633815, "phrase": "different_ways"}, {"score": 0.0026813808976594183, "phrase": "existing_scan"}, {"score": 0.0026212628500398944, "phrase": "gss"}, {"score": 0.002543148295176345, "phrase": "disk_bandwidth_usage"}, {"score": 0.002366847878952636, "phrase": "backup_copy"}, {"score": 0.0023137485947956732, "phrase": "proposed_schemes"}], "paper_keywords": ["multi-resolution video severs", " replication", " striping unit size", " admission control"], "paper_abstract": "Video-on-demand (VOD) service requires balanced use of system resources, such as disk bandwidth and buffer, to accommodate more clients. The data retrieval size and data rates of video streams directly affect the utilization of these resources. Given the data rates which vary widely in multi-resolution video servers, we need to determine the appropriate data retrieval size to balance the buffer with the disk bandwidth. Otherwise, the server may be unable to admit new clients even though one of the resources is available for use. To address this problem, we propose the following new schemes that work together: (1) A replication scheme called Splitting Striping units by Replication (SSR). To increase the number of admitted clients, SSR defines two sizes of striping unit, which allow data to be stored on the primary and backup copies in different ways. (2) A retrieval scheduling method which combines the merits of existing SCAN and grouped sweeping scheme (GSS) algorithms to balance the buffer and disk bandwidth usage. (3) Admission control algorithms which decide whether to read data from the primary or the backup copy. The effectiveness of the proposed schemes is demonstrated through simulations. Results show that our schemes are able to cope with various workloads efficiently and thus enable the server to admit a much larger number of clients.", "paper_title": "Replication and retrieval strategies for resource-effective admission control in multi-resolution video servers", "paper_id": "WOS:000237658000005"}