{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_sets"}, {"score": 0.010228940352489778, "phrase": "industrial_applications"}, {"score": 0.00467718964236808, "phrase": "vital_input"}, {"score": 0.00465634671242413, "phrase": "system_modelling"}, {"score": 0.004625255533545965, "phrase": "dissimilar_level"}, {"score": 0.004573895435487473, "phrase": "different_modelling_approaches"}, {"score": 0.004553510708976456, "phrase": "proper_analysis"}, {"score": 0.004335160877166834, "phrase": "existing_approaches"}, {"score": 0.004248869786808024, "phrase": "different_data_forms"}, {"score": 0.0040996651541091575, "phrase": "traditional_mathematical_modelling_techniques"}, {"score": 0.004000125291278951, "phrase": "least_imprecision"}, {"score": 0.003658031754422943, "phrase": "traditional_approach"}, {"score": 0.0035295016310441696, "phrase": "difficult_matter"}, {"score": 0.003227525738236229, "phrase": "robust_and_reliable_solutions"}, {"score": 0.0030520148188164084, "phrase": "model_imprecision"}, {"score": 0.0029911879354481024, "phrase": "fundamental_focus"}, {"score": 0.002931569771634119, "phrase": "basic_reasons"}, {"score": 0.0028795712616923462, "phrase": "existing_studies"}, {"score": 0.0027597311360952346, "phrase": "online_databases"}, {"score": 0.002747409377822161, "phrase": "isi-web_of_science"}, {"score": 0.002722930209707764, "phrase": "springerlink"}, {"score": 0.0027107723150466712, "phrase": "informaworld"}, {"score": 0.0026986685585382347, "phrase": "engineering_village"}, {"score": 0.0026866191003002905, "phrase": "emerald"}, {"score": 0.0026746225019733233, "phrase": "ieee_xplore"}, {"score": 0.002569032527634343, "phrase": "main_keywords"}, {"score": 0.0025121787711016746, "phrase": "relevant_works"}, {"score": 0.0024401411219526774, "phrase": "different_topics"}, {"score": 0.0024075916292945715, "phrase": "existing_research_areas"}, {"score": 0.002354302193867031, "phrase": "future_research_topics"}, {"score": 0.0021334650920198715, "phrase": "industrial_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Type-2 fuzzy sets and systems", " Fuzzy sets and systems", " Industrial applications"], "paper_abstract": "Data, as being the vital input of system modelling, contain dissimilar level of imprecision that necessitates different modelling approaches for proper analysis of the systems. Numbers, words and perceptions are the forms of data that has varying levels of imprecision. Existing approaches in the literature indicate that, computation of different data forms are closely linked with the level of imprecision, which the data already have. Traditional mathematical modelling techniques have been used to compute the numbers that have the least imprecision. Type-1 fuzzy sets have been used for words and type-2 fuzzy sets have been employed for perceptions where the level of imprecision is relatively high. However, in many cases it has not been easy to decide whether a solution requires a traditional approach, i.e., type-1 fuzzy approach or type-2 fuzzy approach. It has been a difficult matter to decide what types of problems really require modelling and solution either with type-1 or type-2 fuzzy approach. It is certain that, without properly distinguishing differences between the two approaches, application of type-1 and type-2 fuzzy sets and systems would probably fail to develop robust and reliable solutions for the problems of industry. In this respect, a review of the industrial applications of type-2 fuzzy sets, which are relatively novel to model imprecision has been considered in this work. The fundamental focus of the work has been based on the basic reasons of the need for type-2 fuzzy sets for the existing studies. With this purpose in mind, type-2 fuzzy sets articles have been selected from the literature using the online databases of ISI-Web of Science, ScienceDirect, SpringerLink, Informaworld, Engineering Village, Emerald and IEEE Xplore. Both the terms \"type-2 fuzzy\" and \"application\" have been searched as the main keywords in the topics of the studies to retrieve the relevant works. The analysis on the industrial applications of type-2 fuzzy sets/systems (FSs) in different topics allowed us to summarize the existing research areas and therefore it is expected be useful to prioritize future research topics. This review shows that there are still many opportunities for application of type-2 FSs for several different problem domains. Shortcomings of type-1 FSs can also be considered as an opportunity for the application of type-2 FSs in order to provide a better solution approach for industrial problems. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Industrial applications of type-2 fuzzy sets and systems: A concise review", "paper_id": "WOS:000287564300002"}