{"auto_keywords": [{"score": 0.04490388164168672, "phrase": "dimensionality_reduction"}, {"score": 0.04008364158880181, "phrase": "full_high-dimensional_data"}, {"score": 0.026043128888567694, "phrase": "high-dimensional_data"}, {"score": 0.00481495049065317, "phrase": "exploratory_dimensionality_reduction"}, {"score": 0.004775918707955445, "phrase": "high-dimensional_data_sets"}, {"score": 0.004566805735863274, "phrase": "traditional_visualization_methods"}, {"score": 0.004209679094023478, "phrase": "numerous_dimensionality_reduction_methods"}, {"score": 0.003755949722774176, "phrase": "exploratory_analysis"}, {"score": 0.0033373303217961803, "phrase": "flexible_methods"}, {"score": 0.0032040376301815544, "phrase": "automated_methods"}, {"score": 0.003051073364818384, "phrase": "quality_metrics"}, {"score": 0.002941147710077221, "phrase": "individual_variables"}, {"score": 0.002870066750788841, "phrase": "single_value"}, {"score": 0.002634506575564286, "phrase": "interactive_environment"}, {"score": 0.00224701149477484, "phrase": "potentially_most_interesting_variables"}, {"score": 0.0021309254505358253, "phrase": "use-case_analysing_data"}, {"score": 0.0021049977753042253, "phrase": "dna_sequence-based_study"}], "paper_keywords": ["High-dimensional data", " dimensionality reduction", " quality metrics", " visual exploration", " interactive visual analysis"], "paper_abstract": "High-dimensional data sets containing hundreds of variables are difficult to explore, as traditional visualization methods often are unable to represent such data effectively. This is commonly addressed by employing dimensionality reduction prior to visualization. Numerous dimensionality reduction methods are available. However, few reduction approaches take the importance of several structures into account and few provide an overview of structures existing in the full high-dimensional data set. For exploratory analysis, as well as for many other tasks, several structures may be of interest. Exploration of the full high-dimensional data set without reduction may also be desirable. This paper presents flexible methods for exploratory. analysis and interactive dimensionality reduction. Automated methods are employed to analyse the variables, using a range of quality metrics, providing one or more measures of 'interestingness' for individual variables. Through ranking, a single value of interestingness is obtained, based on several quality metrics, that is usable as a threshold for the most interesting variables. An interactive environment is presented in which the user is provided with many possibilities to explore and gain understanding of the high-dimensional data set. Guided by this, the analyst can explore the high-dimensional data set and interactively select a subset of the potentially most interesting variables, employing various methods for dimensionality reduction. The system is demonstrated through a use-case analysing data from a DNA sequence-based study of bacterial populations.", "paper_title": "Quality-based guidance for exploratory dimensionality reduction", "paper_id": "WOS:000315073700003"}