{"auto_keywords": [{"score": 0.041361508715379594, "phrase": "reference_object"}, {"score": 0.03879279526882424, "phrase": "ranking_position"}, {"score": 0.00481495049065317, "phrase": "uncertain_databases"}, {"score": 0.0046797114400479135, "phrase": "scalable_approach"}, {"score": 0.004635477242873163, "phrase": "probabilistic_top-k_similarity"}, {"score": 0.004569905085027681, "phrase": "uncertain_vector_data"}, {"score": 0.0045052562941109734, "phrase": "uncertain_object"}, {"score": 0.004357927940322685, "phrase": "vector_instances"}, {"score": 0.004058180509184539, "phrase": "uncertain_data"}, {"score": 0.0034690732089830045, "phrase": "resulting_rank_probability_distribution"}, {"score": 0.0031996871318754685, "phrase": "poisson_binomial_recurrence_technique"}, {"score": 0.002881793492919646, "phrase": "linear-time_complexity"}, {"score": 0.0027741761880779535, "phrase": "incremental_accessing"}, {"score": 0.0027348611289528583, "phrase": "uncertain_vector_instances"}, {"score": 0.002708960273193547, "phrase": "increasing_order"}, {"score": 0.0021971473452127126, "phrase": "experimental_evaluation"}, {"score": 0.0021763278640166707, "phrase": "synthetic_and_real_data"}], "paper_keywords": ["Uncertain databases", " probabilistic ranking", " similarity search"], "paper_abstract": "This paper introduces a scalable approach for probabilistic top-k similarity ranking on uncertain vector data. Each uncertain object is represented by a set of vector instances that is assumed to be mutually exclusive. The objective is to rank the uncertain data according to their distance to a reference object. We propose a framework that incrementally computes for each object instance and ranking position, the probability of the object falling at that ranking position. The resulting rank probability distribution can serve as input for several state-of-the-art probabilistic ranking models. Existing approaches compute this probability distribution by applying the Poisson binomial recurrence technique of quadratic complexity. In this paper, we theoretically as well as experimentally show that our framework reduces this to a linear-time complexity while having the same memory requirements, facilitated by incremental accessing of the uncertain vector instances in increasing order of their distance to the reference object. Furthermore, we show how the output of our method can be used to apply probabilistic top-k ranking for the objects, according to different state-of-the-art definitions. We conduct an experimental evaluation on synthetic and real data, which demonstrates the efficiency of our approach.", "paper_title": "Scalable Probabilistic Similarity Ranking in Uncertain Databases", "paper_id": "WOS:000280134800004"}