{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "differential_transcription"}, {"score": 0.007702630058204689, "phrase": "rna-seq_data"}, {"score": 0.007671470761161116, "phrase": "fdm"}, {"score": 0.004732785510739708, "phrase": "eukaryotic_cells"}, {"score": 0.004709567162738894, "phrase": "alternative_splicing"}, {"score": 0.004652016085325825, "phrase": "rna_transcripts"}, {"score": 0.004606479650820579, "phrase": "important_role"}, {"score": 0.004583878086896926, "phrase": "tissue-specific_differentiation"}, {"score": 0.00439616811739646, "phrase": "great_need"}, {"score": 0.004236908273106904, "phrase": "short-read_rna_sequencing"}, {"score": 0.0040434011979182585, "phrase": "relative_abundance"}, {"score": 0.004013662619667083, "phrase": "transcript_isoforms"}, {"score": 0.003820896867623235, "phrase": "square_root"}, {"score": 0.0037927885415997213, "phrase": "jensen_shannon_divergence"}, {"score": 0.003728000957725218, "phrase": "gene's_transcript_abundance_vectors"}, {"score": 0.0036553070575015344, "phrase": "weighted_splice-graph_representation"}, {"score": 0.003601715012418258, "phrase": "compact_form"}, {"score": 0.003531474887552889, "phrase": "reference_genome"}, {"score": 0.0035054881943660096, "phrase": "flow_difference"}, {"score": 0.003437118197562078, "phrase": "differential_rna_transcript_expression"}, {"score": 0.0034034331737042363, "phrase": "splice_graphs"}, {"score": 0.003353521531649663, "phrase": "underlying_gene_model"}, {"score": 0.0032800186243040663, "phrase": "novel_non-parametric_statistical_test"}, {"score": 0.003161065111494053, "phrase": "group-wise_comparison"}, {"score": 0.0030993917463467214, "phrase": "simulated_rna-seq_data"}, {"score": 0.0030464123943266673, "phrase": "varying_transcription"}, {"score": 0.0028857130140890787, "phrase": "average_rna-seq_coverage"}, {"score": 0.0026472970609754095, "phrase": "higher_sensitivity"}, {"score": 0.0024285310665728634, "phrase": "cufflinks"}, {"score": 0.0023288759982072003, "phrase": "experimental_data"}, {"score": 0.0022005118194652704, "phrase": "subsequent_study"}, {"score": 0.0021735545290040522, "phrase": "quantitative_real_time_polymerase_chain_reaction"}, {"score": 0.0021049977753042253, "phrase": "significant_differences"}], "paper_keywords": [""], "paper_abstract": "Motivation: In eukaryotic cells, alternative splicing expands the diversity of RNA transcripts and plays an important role in tissue-specific differentiation, and can be misregulated in disease. To understand these processes, there is a great need for methods to detect differential transcription between samples. Our focus is on samples observed using short-read RNA sequencing (RNA-seq). Methods: We characterize differential transcription between two samples as the difference in the relative abundance of the transcript isoforms present in the samples. The magnitude of differential transcription of a gene between two samples can be measured by the square root of the Jensen Shannon Divergence (JSD*) between the gene's transcript abundance vectors in each sample. We define a weighted splice-graph representation of RNA-seq data, summarizing in compact form the alignment of RNA-seq reads to a reference genome. The flow difference metric (FDM) identifies regions of differential RNA transcript expression between pairs of splice graphs, without need for an underlying gene model or catalog of transcripts. We present a novel non-parametric statistical test between splice graphs to assess the significance of differential transcription, and extend it to group-wise comparison incorporating sample replicates. Results: Using simulated RNA-seq data consisting of four technical replicates of two samples with varying transcription between genes, we show that (i) the FDM is highly correlated with JSD* (r=0.82) when average RNA-seq coverage of the transcripts is sufficiently deep; and (ii) the FDM is able to identify 90% of genes with differential transcription when JSD* > 0.28 and coverage > 7. This represents higher sensitivity than Cufflinks (without annotations) and rDiff (MMD), which respectively identified 69 and 49% of the genes in this region as differential transcribed. Using annotations identifying the transcripts, Cufflinks was able to identify 86% of the genes in this region as differentially transcribed. Using experimental data consisting of four replicates each for two cancer cell lines (MCF7 and SUM102), FDM identified 1425 genes as significantly different in transcription. Subsequent study of the samples using quantitative real time polymerase chain reaction (qRT-PCR) of several differential transcription sites identified by FDM, confirmed significant differences at these sites.", "paper_title": "FDM: a graph-based statistical method to detect differential transcription using RNA-seq data", "paper_id": "WOS:000295412200003"}