{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "learning_effect"}, {"score": 0.019168388058407922, "phrase": "parametric_analysis"}, {"score": 0.014983823589998262, "phrase": "optimal_sequence"}, {"score": 0.008354570599507205, "phrase": "total_completion_time"}, {"score": 0.008132470872836781, "phrase": "completion_times"}, {"score": 0.0068763338035300456, "phrase": "assignment_problem"}, {"score": 0.00481495049065317, "phrase": "bi-criterion_single_machine"}, {"score": 0.004686504090684836, "phrase": "manufacturing_system"}, {"score": 0.004081385289516914, "phrase": "\"learning_effect"}, {"score": 0.00393675895773741, "phrase": "bi-criterion_single_machine_scheduling_problem"}, {"score": 0.0035010659378711816, "phrase": "linear_combination"}, {"score": 0.003459191419478298, "phrase": "total_absolute_differences"}, {"score": 0.0032182214864142616, "phrase": "earlier_study"}, {"score": 0.0031893014610230985, "phrase": "bi-criterion_problem"}, {"score": 0.002984990015496695, "phrase": "computational_complexity"}, {"score": 0.0026623547595573953, "phrase": "matching_procedure"}, {"score": 0.002506766880001808, "phrase": "learning_index"}, {"score": 0.002189061053183049, "phrase": "optimal_sequences"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["single machine scheduling", " bi-criterion problem", " learning effect", " parametric analysis"], "paper_abstract": "In a manufacturing system workers are. involved in doing the same job or activity repeatedly. Hence, the workers start learning more about the job or activity. Because of the learning, the time to complete the job or activity starts decreasing, which is known as \"learning effect.\" In this paper, we present a parametric analysis of bi-criterion single machine scheduling problem of n jobs with a learning effect. The two objectives considered are the total completion time (TC) and total absolute differences in completion times (TADC). The objective is to find a sequence of jobs that minimizes a linear combination of total completion time and total absolute differences in completion times; i.e., delta*TC + (1-delta) * TADC (0 <=delta <= 1). In an earlier study, this bi-criterion problem with a learning effect is formulated as an assignment problem and the optimal sequence is obtained, for a given value of delta. The computational complexity for solving an assignment problem is O(n(3)). In our study, the learning effect is included in the positional penalties/weights, and hence the simple matching procedure given in an another earlier study is used to obtain the optimal sequence. The complexity of the matching procedure is O(n log n). We show that the optimal sequence, depends on the value of delta and the learning index (alpha). In this paper, a parametric analysis of delta, for a given learning index (alpha) is presented to show the range of delta in which a sequence is optimal. We also present a method of obtaining the set of optimal sequences. A parametric analysis of alpha for a given delta is also presented. Numerical examples are presented for ease of understanding the methodology.", "paper_title": "Parametric analysis of bi-criterion single machine. scheduling with a learning effect", "paper_id": "WOS:000258427400019"}