{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "reactive_programming_model"}, {"score": 0.00481495049065317, "phrase": "hollywood's_garbage"}, {"score": 0.004426882270402403, "phrase": "full_control"}, {"score": 0.004185632403886255, "phrase": "declarative_and_imperative_programming_style"}, {"score": 0.004050996777117918, "phrase": "ml_family"}, {"score": 0.0037069087922811488, "phrase": "usual_garbage_collector"}, {"score": 0.0031182092708983184, "phrase": "single_one"}, {"score": 0.0028799352389969443, "phrase": "formal_algorithm"}, {"score": 0.0027100527874262446, "phrase": "theoretical_model"}, {"score": 0.002622755848331379, "phrase": "reactive_programming"}, {"score": 0.0023662411481713682, "phrase": "reactive_programming_patterns"}, {"score": 0.002185301851004467, "phrase": "declarative_approach"}, {"score": 0.0021049977753042253, "phrase": "imperative_model"}], "paper_keywords": ["Algorithms", " Design", " Languages"], "paper_abstract": "The reactive programming model is largely different to what we're used to as we don't have full control over the application's control flow. If we mix the declarative and imperative programming style, which is usual in the ML family of languages, the situation is even more complex. It becomes easy to introduce patterns where the usual garbage collector for objects cannot automatically dispose all components that we intuitively consider garbage. In this paper we discuss a duality between the definitions of garbage for objects and events. We combine them into a single one, to specify the notion of garbage for reactive programming model in a mixed functional/imperative language and we present a formal algorithm for collecting garbage in this environment. Building on top of the theoretical model, we implement a library for reactive programming that does not cause leaks when used in the mixed declarative/imperative model. The library allows us to safely combine both of the reactive programming patterns. As a result, we can take advantage of the clarity and simplicity of the declarative approach as well as the expressivity of the imperative model.", "paper_title": "Collecting Hollywood's Garbage", "paper_id": "WOS:000280548600007"}