{"auto_keywords": [{"score": 0.04887366145178026, "phrase": "noise_uncertainty"}, {"score": 0.03419586636170197, "phrase": "energy_detector"}, {"score": 0.006902100580363622, "phrase": "cognitive_radio_networks"}, {"score": 0.00571686627503672, "phrase": "detection_performance"}, {"score": 0.00468614661216747, "phrase": "decision_rule"}, {"score": 0.004638587405867967, "phrase": "unknown_deterministic_signal"}, {"score": 0.004568147929502983, "phrase": "noise_power"}, {"score": 0.004318859472263969, "phrase": "random_gaussian"}, {"score": 0.004260134699483774, "phrase": "promising_candidate"}, {"score": 0.0034733518170738517, "phrase": "decision_rules"}, {"score": 0.0032668821950788533, "phrase": "widely_used_model"}, {"score": 0.002479150189700726, "phrase": "theoretical_analyses"}, {"score": 0.002453934333239467, "phrase": "simulation_results"}, {"score": 0.0023197517832705297, "phrase": "precise_sensing_thresholds"}, {"score": 0.0022041312401435346, "phrase": "conventional_decision_rule"}, {"score": 0.0021049977753042253, "phrase": "performance_gains"}], "paper_keywords": ["Energy detector", " Cognitive radio", " Noise uncertainty", " Decision rule"], "paper_abstract": "Energy detector is simple in structure and easy to implement. Therefore, it is a promising candidate for spectrum sensing in cognitive radio networks. However, its detection performance is typically challenged by the noise uncertainty. Thus, the detection performance of energy detector in the presence of noise uncertainty needs to be evaluated. In this paper, we derive the decision rules for the energy detector in the presence of noise uncertainty by employing a widely used model. Firstly, we derive the decision rule for unknown deterministic signal when the noise power is uncertain. Second, we derive the decision rule for random Gaussian distributed signal when there is noise uncertainty. Then, we analyze the detection performance of the energy detector in the presence of noise uncertainty for both unknown deterministic signal and random Gaussian distributed signal. Both theoretical analyses and simulation results show that in the presence of noise uncertainty, our derived decision rules provide precise sensing thresholds for the energy detector. Furthermore, compared with the conventional decision rule obtained by overestimating the noise power, our decision rules provide performance gains in terms of signal to noise ratio.", "paper_title": "Performance of energy detector in the presence of noise uncertainty in cognitive radio networks", "paper_id": "WOS:000320891600006"}