{"auto_keywords": [{"score": 0.04796789568919049, "phrase": "classroom"}, {"score": 0.00481495049065317, "phrase": "harnessing_technology"}, {"score": 0.004761010795871555, "phrase": "undergraduate_art_education"}, {"score": 0.004334280585565239, "phrase": "innovative_instructional_model"}, {"score": 0.00422177384286051, "phrase": "local_resources"}, {"score": 0.0040508247605225214, "phrase": "undergraduate-level_art_history_students"}, {"score": 0.0038144050983900286, "phrase": "theoretical_knowledge"}, {"score": 0.003785836059995376, "phrase": "practical_experience"}, {"score": 0.003743381699791, "phrase": "critical_dialogue"}, {"score": 0.003687512797620773, "phrase": "original_artwork"}, {"score": 0.0036461569988218267, "phrase": "instructional_model"}, {"score": 0.003232779373179631, "phrase": "collaborative_inquiry"}, {"score": 0.0031017521516279664, "phrase": "design_research_approach"}, {"score": 0.0029095936591723645, "phrase": "cognitive_apprenticeship_instructional_approach"}, {"score": 0.0028446460307503343, "phrase": "students'_development"}, {"score": 0.002688532127821979, "phrase": "streamlining_learning"}, {"score": 0.0022610992177831643, "phrase": "students'_gradual_development"}, {"score": 0.0022105951175680856, "phrase": "newly_learned_skills"}, {"score": 0.0021775526153883355, "phrase": "students'_perspective"}, {"score": 0.002128910637262527, "phrase": "seamless_learning"}], "paper_keywords": ["Collaborative learning", " education", " mobile computing"], "paper_abstract": "We report on the development and evaluation of an innovative instructional model, which harnesses advanced technologies and local resources (an in-campus museum), to support undergraduate-level art history students in developing the skills required for analyzing artwork. Theory suggests that analyzing artwork requires theoretical knowledge and practical experience gained through critical dialogue and inquiry of original artwork. An instructional model was designed in which technology (website, collaborative docs, and mobile apps) supported streamlining of learning across settings (class, museum, and home) and conducting collaborative inquiry in situ (e.g., museum). Using a design research approach, the model was studied in three aspects: its potential to enable instructors to implement the cognitive apprenticeship instructional approach; its contribution to the students' development of independence and self-efficacy in analyzing artwork; and the contribution of technology to streamlining learning between settings. Data was collected from two enactments of the course. Findings indicate that the instructors gradually faded their modeling and coaching enabling students to become more active, hence the model we designed was largely implemented by the instructors. Furthermore, it supported students' gradual development of independence in practicing the newly learned skills. From the students' perspective, the integrated technologies created seamless learning between the three settings.", "paper_title": "Harnessing Technology for Promoting Undergraduate Art Education: A Novel Model that Streamlines Learning between Classroom, Museum, and Home", "paper_id": "WOS:000351736100003"}