{"auto_keywords": [{"score": 0.0429434896102935, "phrase": "structured_noise"}, {"score": 0.010785201818497054, "phrase": "nonlinear_kernels"}, {"score": 0.007617663309725312, "phrase": "nonlinear_kernel_methods"}, {"score": 0.007145403409134662, "phrase": "nonlinear_problems"}, {"score": 0.007031953075664576, "phrase": "latent_variable_methods"}, {"score": 0.005991378100166158, "phrase": "constrained_latent_variable_methods"}, {"score": 0.005710160864266501, "phrase": "available_additional_knowledge"}, {"score": 0.00481495049065317, "phrase": "partial_least_squares"}, {"score": 0.0037929268854102944, "phrase": "nonlinear_spaces"}, {"score": 0.0036730421200320985, "phrase": "regression_performance"}, {"score": 0.0032491108935498794, "phrase": "additional_constraints"}, {"score": 0.0022268964676199292, "phrase": "input_and_response_variables"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["PCA", " PLS", " kernels", " structured noise", " latent variables"], "paper_abstract": "Nonlinear kernel methods have been widely used to deal with nonlinear problems in latent variable methods. However, in the presence of structured noise, these methods have reduced efficacy. We have previously introduced constrained latent variable methods that make use of any available additional knowledge about the structured noise. These methods improve performance by introducing additional constraints into the algorithm. In this paper, we build upon our previous work and introduce hard-constrained and soft-constrained nonlinear partial least squares methods using nonlinear kernels. The addition of nonlinear kernels reduces the effects of structured noise in nonlinear spaces and improves the regression performance between the input and response variables. Copyright (c) 2014 John Wiley & Sons, Ltd. Nonlinear kernel methods have been widely used to deal with nonlinear problems in latent variable methods. However, in the presence of structured noise, these methods have reduced efficacy. We have previously introduced constrained latent variable methods that make use of any available additional knowledge about the structured noise. In this paper, we introduce hard-constrained and soft-constrained nonlinear partial least squares methods using nonlinear kernels. Adding nonlinear kernels reduces the effects of structured noise in nonlinear spaces and improves regression performance.", "paper_title": "Constrained kernelized partial least squares", "paper_id": "WOS:000344323400005"}