{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "contracting_ufn_structure"}, {"score": 0.010202525504072989, "phrase": "macguffin"}, {"score": 0.004550029253278477, "phrase": "contracting_unbalanced_feistel_networks"}, {"score": 0.004498812433096501, "phrase": "ufn"}, {"score": 0.004398094237005956, "phrase": "particular_structure"}, {"score": 0.004324031677173549, "phrase": "block_ciphers"}, {"score": 0.0040171817997972335, "phrase": "equal_size"}, {"score": 0.0034279721355412285, "phrase": "differential_fault_analysis"}, {"score": 0.0026411384812121503, "phrase": "similar_hypothesis"}, {"score": 0.002398382089724878, "phrase": "general_model"}, {"score": 0.0022278779300543548, "phrase": "new_reference"}, {"score": 0.002202742267484358, "phrase": "fault_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cryptanalysis", " Side channel attacks", " Differential fault analysis", " Block ciphers", " SMS4", " MacGuffin"], "paper_abstract": "The contracting unbalanced Feistel networks (UFN) is a particular structure in the block ciphers, where the \"left half' and the \"right half' are not of equal size, and the size of the domain of one half is larger than that of the range. This paper studies the security of the contracting UFN structure against differential fault analysis (DFA). We propose two basic byte-oriented fault models and two corresponding attacking methods. Then we implement the attack on two instances of the contracting UFN structure, the block ciphers SMS4 and MacGuffin. The experiments require 20 and 4 faulty ciphertexts to recover the 128-bit secret key of SMS4 in the two fault models, respectively. Under similar hypothesis, MacGuffin is breakable with 355 and 165 faulty ciphertexts, respectively. So our work not only builds up a general model of DFA on the contracting UFN structure and ciphers, but also provides a new reference for fault analysis on other block ciphers. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Differential fault analysis on the contracting UFN structure, with application to SMS4 and MacGuffin", "paper_id": "WOS:000263426900013"}