{"auto_keywords": [{"score": 0.04253979406134334, "phrase": "erp_implementation"}, {"score": 0.004814972659693092, "phrase": "erp"}, {"score": 0.004579780586951551, "phrase": "enterprise_resources_planning"}, {"score": 0.004227064760262924, "phrase": "surprisingly_high_failure_rate"}, {"score": 0.00396050388346298, "phrase": "technical_and_social_uncertainties"}, {"score": 0.0038048583022763796, "phrase": "traditional_erp_practices"}, {"score": 0.0036553070575015344, "phrase": "static_process"}, {"score": 0.0033231814056233103, "phrase": "changing_organization"}, {"score": 0.002931569771634119, "phrase": "project_delay"}, {"score": 0.002902304851882577, "phrase": "cost_overruns"}, {"score": 0.0027464781499539296, "phrase": "active_erp_implementation_management_perspective"}, {"score": 0.0022810491620483737, "phrase": "appropriate_action"}, {"score": 0.002224510044064184, "phrase": "often-changing_erp_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["active management", " ERP implementation", " real options", " uncertainty"], "paper_abstract": "Although enterprise resources planning (ERP) implementation has been one of the most significant challenges of the last decade, it comes with a surprisingly high failure rate due to its high risk nature. The risks of ERP implementation, which involve both technical and social uncertainties, must to be effectively managed. Traditional ERP practices address the implementation of ERP as a static process. Such practices focus on structure, not on ERP as something that will meet the needs of a changing organization. As a result, many relevant uncertainties that cannot be predefined are not accommodated, and cause the implementation fail in the form of project delay and cost overruns. The objective of this paper is to propose an active ERP implementation management perspective to manage ERP risks based on the Real Options (RO) theory, which addresses uncertainties over time, resolves uncertainties in changing environments that cannot be predefined. By actively managing ERP implementation, managers can improve their flexibility, take appropriate action to respond to the often-changing ERP environment, and achieve a more successful ERP implementation. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Active ERP implementation management: A real options perspective", "paper_id": "WOS:000256391400016"}