{"auto_keywords": [{"score": 0.032809741057260984, "phrase": "proposed_method"}, {"score": 0.004225950334493496, "phrase": "partial_answer"}, {"score": 0.004143196873246147, "phrase": "computational_approach"}, {"score": 0.004110549138321181, "phrase": "automatic_caricaturization"}, {"score": 0.003982500388997765, "phrase": "intrinsic_geometric_properties"}, {"score": 0.00289007009553812, "phrase": "natural_comic_exaggeration_effect"}, {"score": 0.0027668603377225564, "phrase": "poisson_equation"}, {"score": 0.002566255769251419, "phrase": "human_faces"}, {"score": 0.002418185868191525, "phrase": "shape's_features"}, {"score": 0.0023896108055582615, "phrase": "artistic_caricature"}, {"score": 0.0023242388639441607, "phrase": "almost_isometries"}, {"score": 0.0022696277881969896, "phrase": "gaussian_curvature"}, {"score": 0.0022428042503686053, "phrase": "scaling_factor"}, {"score": 0.0021901023885734, "phrase": "animated_sequences"}, {"score": 0.0021301766910531137, "phrase": "animated_creature"}], "paper_keywords": ["Poisson equation", " Isometry/pose invariance", " Gaussian curvature", " Laplace-Beltrami operator"], "paper_abstract": "The question whether a caricature of a 2D sketch, or an object in 3D can be generated automatically is probably as old as the attempt to answer the question of what defines art. In an attempt to provide a partial answer, we propose a computational approach for automatic caricaturization. The idea is to rely on intrinsic geometric properties of a given model that are invariant to poses, articulations, and gestures. A property of a surface that is preserved while it undergoes such deformations is self-isometry. In other words, while smiling, running, and posing, we do not change much the intrinsic geometry of our facial surface, the area of our body, or the size of our hands. The proposed method locally amplifies the area of a given surface based on its Gaussian curvature. It is shown to produce a natural comic exaggeration effect which can be efficiently computed as a solution of a Poisson equation. We demonstrate the power of the proposed method by applying it to a variety of meshes such as human faces, statues, and animals. The results demonstrate enhancement and exaggeration of the shape's features into an artistic caricature. As most poses and postures are almost isometries, the use of the Gaussian curvature as the scaling factor allows the proposed method to handle animated sequences while preserving the identity of the animated creature. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Computational caricaturization of surfaces", "paper_id": "WOS:000364981500001"}