{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_knowledge"}, {"score": 0.044111484437312234, "phrase": "male_and_female_users"}, {"score": 0.004630910803911567, "phrase": "web_users"}, {"score": 0.004523865550323285, "phrase": "consumer_and_web_designer"}, {"score": 0.003900853871728297, "phrase": "online_survey_data"}, {"score": 0.0037516215763875225, "phrase": "user_perceptions"}, {"score": 0.003552204377093386, "phrase": "user_beliefs"}, {"score": 0.0032727116186194584, "phrase": "user's_sex"}, {"score": 0.0031107911390188055, "phrase": "positive_relationship"}, {"score": 0.0030865992688177005, "phrase": "perceived_web_knowledge"}, {"score": 0.0030625949549620475, "phrase": "web_usability"}, {"score": 0.0029800360974218836, "phrase": "website_design_experience"}, {"score": 0.002756180088265064, "phrase": "moderation_effect"}, {"score": 0.0026609940110902666, "phrase": "male_web_users"}, {"score": 0.00228499525153, "phrase": "usage_context"}, {"score": 0.0021803388613879896, "phrase": "web_technology"}, {"score": 0.002163367190715979, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Perceived web knowledge", " Perceived web usability", " Usage context", " Website design experience", " Gender", " Sex"], "paper_abstract": "Web users are now a mixture of consumer and web designer. As such, the context within which we are socialized about the web - as both male and female users - moderates the relationship between what we think we know about it and its usability to complete tasks. With online survey data from 2077 web users, we empirically examine the relationship between user perceptions of web knowledge (our confidence in what we think we know) and user beliefs about usability of the web (how easy and useful we believe it to be). We include a user's sex and their website design experience as important moderators on this relationship. Results show a positive relationship between perceived web knowledge and web usability, and under the context of website design experience, more value is placed on the utility of the web, rather than on its ease of use. This moderation effect is stronger for female than it is for male web users. In summary, users with more confidence in their knowledge are more oriented towards the utility of the web than how easy it is to harvest that utility. Our work contributes to an understanding of the influence of the usage context within which the knowledge and beliefs of male and female users are socialized about web technology. Crown Copyright (C) 2012 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Perceptions of web knowledge and usability: When sex and experience matter", "paper_id": "WOS:000313476100001"}