{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "simplification"}, {"score": 0.004762550320451225, "phrase": "thematic_enhancement"}, {"score": 0.00465944657565638, "phrase": "movement_data_sets"}, {"score": 0.004583579470330216, "phrase": "today's_advanced_tracking_devices"}, {"score": 0.004222299135545249, "phrase": "recorded_positions"}, {"score": 0.004176321608449849, "phrase": "multiple_additional_attributes"}, {"score": 0.003622088701900472, "phrase": "relevant_information"}, {"score": 0.0035049738376240567, "phrase": "important_movement_patterns"}, {"score": 0.0034102660898135155, "phrase": "systematic_stepwise_methodology"}, {"score": 0.002925149105307855, "phrase": "morphological_complexity"}, {"score": 0.002285527382381719, "phrase": "simplification_and_enhancement_process"}, {"score": 0.0021994343316143125, "phrase": "analysis_example"}, {"score": 0.0021049977753042253, "phrase": "pedestrian_movement"}], "paper_keywords": ["Visual analysis", " trajectories", " simplification", " thematic enhancement", " clustering"], "paper_abstract": "Movement data sets collected using today's advanced tracking devices consist of complex trajectories in terms of length, shape, and number of recorded positions. Multiple additional attributes characterizing the movement and its environment are often also included making the level of complexity even higher. Simplification of trajectories can improve the visibility of relevant information by reducing less relevant details while maintaining important movement patterns. We propose a systematic stepwise methodology for simplifying and thematically enhancing trajectories in order to support their visual analysis. The methodology is applied iteratively and is composed of: (a) a simplification step applied to reduce the morphological complexity of the trajectories, (b) a thematic enhancement step which aims at accentuating patterns of movement, and (c) the representation and interactive exploration of the results in order to make interpretations of the findings and further refinement to the simplification and enhancement process. We illustrate our methodology through an analysis example of two different types of tracks, aircraft and pedestrian movement.", "paper_title": "SimpliFly: A Methodology for Simplification and Thematic Enhancement of Trajectories", "paper_id": "WOS:000345907200011"}