{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chinese_innovation_system"}, {"score": 0.017179202056663113, "phrase": "china"}, {"score": 0.008771139826752232, "phrase": "'matthew_effects"}, {"score": 0.004723622989145559, "phrase": "scale-independent_indicators"}, {"score": 0.00454610829874136, "phrase": "science_and_technology_point"}, {"score": 0.00441130431691048, "phrase": "important_developments"}, {"score": 0.004303975853361081, "phrase": "conventional_performance_indicators"}, {"score": 0.004210757716316828, "phrase": "gross_domestic_expenditure"}, {"score": 0.004130842663662047, "phrase": "gross_domestic_product"}, {"score": 0.00380511089035825, "phrase": "national_wealth"}, {"score": 0.0033546701239540555, "phrase": "scale-independent_indicator"}, {"score": 0.00314979417863877, "phrase": "growth_rate"}, {"score": 0.0031240075437664314, "phrase": "arci"}, {"score": 0.002877438939246423, "phrase": "scientific_outputs"}, {"score": 0.0028227569217197926, "phrase": "real_tendency"}, {"score": 0.0024951467586005094, "phrase": "economic_growth"}, {"score": 0.0024815011359381692, "phrase": "research_investment"}, {"score": 0.002291804012486431, "phrase": "government_intramural_expenditure"}, {"score": 0.0022420685881946968, "phrase": "stronger_non-linear_impact"}, {"score": 0.00221153232497724, "phrase": "business_enterprise_expenditure"}, {"score": 0.0021458053922984725, "phrase": "china_research_institutions"}], "paper_keywords": ["Scale-independence", " National innovation system", " Performance"], "paper_abstract": "In this paper we use scale-independent indicators to explore the performance of the Chinese innovation system from an economic and from a science and technology point of view, and compare it with 21 other nations. Some important developments in the Chinese innovation system, hidden by rankings by conventional performance indicators, were revealed. We find that gross domestic expenditure on R&D (GERD) & gross domestic product (GDP) and GDP & POP (population) all exhibit strong 'Matthew effects', measured by their scaling factors. This means that the Chinese R&D intensity (GERD/GDP) and national wealth (GDP per capita) are growing significantly with the increase of the GDP. Also pairs such as citations & papers, papers & GDP, citations & GDP, and paper & GERD exhibit these 'Matthew effects'. This observation points to the fact that in China scientific outputs and impacts are growing faster than economic growth and research investment. However, according to another scale-independent indicator, namely the adjusted relative citation impact (ARCI), China ranks on the bottom of the list, but the growth rate of the ARCI is the highest among these countries (comparing the periods 1995-1999 and 2001-2005). To sum up, we interpret these findings to mean that the scientific outputs and impacts of China show a real tendency of catching up with its economic growth. It is expected that with an increase of its GDP and R&D intensity China will show a sustained increase in indicators related to science and technology. Similarly, there are very strong 'Matthew effects' between the outputs of technology (patents) and economic growth and research investment. This means that the outputs of technology are expected to increase considerably with an increase of GDP and R&D expenditure. Furthermore, in the Chinese innovation system the government intramural expenditure on R&D (GOVERD) has a stronger non-linear impact on patent productivity than business enterprise expenditure on R&D (BERD). This shows that in China research institutions financed by the government play a more important role than enterprises. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A scale-independent analysis of the performance of the Chinese innovation system", "paper_id": "WOS:000269075100006"}