{"auto_keywords": [{"score": 0.04737528008749571, "phrase": "home_appliances"}, {"score": 0.015719716506582538, "phrase": "association_rule_mining"}, {"score": 0.015376319150867715, "phrase": "smart_home_environment"}, {"score": 0.014646630285088549, "phrase": "automated_services"}, {"score": 0.011079874661392076, "phrase": "existing_algorithms"}, {"score": 0.00991577568012509, "phrase": "confidence_level"}, {"score": 0.004772137871562584, "phrase": "elderly_surveillance_system"}, {"score": 0.004229927464182562, "phrase": "association_rules"}, {"score": 0.0040996651541091575, "phrase": "service_scenarios"}, {"score": 0.003902992784453769, "phrase": "limited_number"}, {"score": 0.0033525843225012918, "phrase": "mining_association_rules"}, {"score": 0.003107117564014497, "phrase": "association_rule_generation"}, {"score": 0.002918483026678636, "phrase": "new_service_scenario_generation_scheme"}, {"score": 0.0028284924551705516, "phrase": "hypothesis_testing"}, {"score": 0.0025291018422967083, "phrase": "existing_association_rule_mining_algorithm"}, {"score": 0.0024075916292945715, "phrase": "meaningful_service_scenarios"}, {"score": 0.002364865100579589, "phrase": "proposed_scheme"}, {"score": 0.002291905937251069, "phrase": "future_smart_homes"}, {"score": 0.002181766829493483, "phrase": "surveillance_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Service scenario", " Association rule mining", " Surveillance system"], "paper_abstract": "More convenient smart home environments can be constructed by monitoring home appliances, if automated services are supported by their usage information. This paper proposes a scheme for translating association rules among appliances mined from their usage information into service scenarios. A smart home environment is unique in that there exist a limited number of home appliances, some of which operate without interruption like a refrigerator. Furthermore, the number of home appliances is much less than the number of items in itemsets to which existing algorithms for mining association rules have been applied. After showing that the existing algorithms are limited in improving the usefulness of association rule generation by means of adjusting the confidence level due to such unique characteristics, we propose a new service scenario generation scheme which calculates the confidence level based on hypothesis testing. This paper demonstrates that association rule mining based on the dependence between appliances is feasible and its performance is very much comparable with that of an existing association rule mining algorithm. Since home users are allowed to choose their favorable scenarios from meaningful service scenarios generated by the proposed scheme without their intervention, we expect that future smart homes can provide automated services more efficiently to them, especially to surveillance systems for elderly. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A service scenario generation scheme based on association rule mining for elderly surveillance system in a smart home environment", "paper_id": "WOS:000309787800008"}