{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "discovery_of_folktales"}, {"score": 0.0044786435725543685, "phrase": "written_and_audiovisual_formats"}, {"score": 0.004402973626416765, "phrase": "systematic_and_rigorous_development"}, {"score": 0.0043656173407379895, "phrase": "user-focused_and_task-focused_models"}, {"score": 0.004219321533320583, "phrase": "cognitive_task_analysis"}, {"score": 0.0040779081518317415, "phrase": "information-seeking_and_information-use_practices"}, {"score": 0.003941215575554871, "phrase": "intellectual_dimensions"}, {"score": 0.003527712410706358, "phrase": "common_tasks"}, {"score": 0.0034977560416755726, "phrase": "user_groups"}, {"score": 0.0032810180076973806, "phrase": "facet_analysis"}, {"score": 0.003038532168038562, "phrase": "subject_indexing_material"}, {"score": 0.0029998918671747168, "phrase": "random_stratified_set"}, {"score": 0.0029744042270542655, "phrase": "document_surrogates"}, {"score": 0.0028623555849897632, "phrase": "bibliographic_records"}, {"score": 0.0027078974645805736, "phrase": "eight_facets"}, {"score": 0.002342110338541984, "phrase": "systems_designers"}, {"score": 0.0022634699331607615, "phrase": "extant_contextual_material"}, {"score": 0.002225143304518447, "phrase": "discovery_systems"}, {"score": 0.0021688641066186817, "phrase": "account_user-desired_features"}, {"score": 0.002123051344001408, "phrase": "enhanced_services"}, {"score": 0.0021049977753042253, "phrase": "digital_repositories"}], "paper_keywords": [""], "paper_abstract": "The \"Folktales and Facets\" project proposes ways to enhance access to folktales-in written and audiovisual formats-through the systematic and rigorous development of user-focused and task-focused models of information representation. Methods used include cognitive task analysis and facet analysis to better understand the information-seeking and information-use practices of people working with folktales and the intellectual dimensions of the domain. Interviews were conducted with 9 informants, representing scholars, storytellers, and teachers who rely on folktales in their professional lives to determine common tasks across user groups. Four tasks were identified: collect, create, instruct, and study. Facet analysis was conducted on the transcripts of these interviews, and a representative set of literature that included subject indexing material and a random stratified set of document surrogates drawn from a collection of folktales, including bibliographic records, introductions, reviews, tables of contents, and bibliographies. Eight facets were identified as most salient for this group of users: agent, association, context, documentation, location, subject, time, and viewpoint. Implications include the need for systems designers to devise methods for harvesting and integrating extant contextual material into search and discovery systems, and to take into account user-desired features in the development of enhanced services for digital repositories.", "paper_title": "The Elusive Tale: Leveraging the Study of Information Seeking and Knowledge Organization to Improve Access to and Discovery of Folktales", "paper_id": "WOS:000302156300005"}