{"auto_keywords": [{"score": 0.04464397984850976, "phrase": "input_sequences"}, {"score": 0.03478816685509988, "phrase": "dynamic_programming_algorithm"}, {"score": 0.031947736897611906, "phrase": "breakable_arrangements"}, {"score": 0.030820029219094568, "phrase": "greedy_algorithm"}, {"score": 0.00481495049065317, "phrase": "whole_genome_alignment"}, {"score": 0.0047051051659828275, "phrase": "graph-based_model"}, {"score": 0.0045765783794477505, "phrase": "alignment_graph"}, {"score": 0.004513631630494221, "phrase": "mixed_graph"}, {"score": 0.003929689573550262, "phrase": "evolutionary_events"}, {"score": 0.003787108326100196, "phrase": "sequence_alignment"}, {"score": 0.003616108223034427, "phrase": "scoring_function"}, {"score": 0.0035828427627676075, "phrase": "alignment_graphs"}, {"score": 0.003438282563552846, "phrase": "np"}, {"score": 0.0032364494905485677, "phrase": "minimization_problem"}, {"score": 0.0026042472337367015, "phrase": "breakable_arrangement"}], "paper_keywords": ["algorithms", " combinatorics", " probability", " sequences"], "paper_abstract": "We present a graph-based model for representing two aligned genomic sequences. An alignment graph is a mixed graph consisting of two sets of vertices, each representing one of the input sequences, and three sets of edges. These edges allow the model to represent a number of evolutionary events. This model is used to perform sequence alignment at the level of nucleotides. We define a scoring function for alignment graphs. We show that minimizing the score is NP-complete. However, we present a dynamic programming algorithm that solves the minimization problem optimally for a certain class of alignments, called breakable arrangements. Algorithms for analyzing breakable arrangements are presented. We also present a greedy algorithm that is capable of representing reversals. We present a dynamic programming algorithm that optimally aligns two genomic sequences, when one of the input sequences is a breakable arrangement of the other. Comparing what we define as breakable arrangements to alignments generated by other algorithms, it is seen that many already aligned genomes fall into the category of being breakable. Moreover, the greedy algorithm is shown to represent reversals, besides rearrangements, mutations, and other evolutionary events.", "paper_title": "A Theoretical Model for Whole Genome Alignment", "paper_id": "WOS:000290383400003"}