{"auto_keywords": [{"score": 0.04828702148089275, "phrase": "beta-lactam_antibiotics"}, {"score": 0.004561732093492262, "phrase": "bacterial_infectious_diseases"}, {"score": 0.004475562733344479, "phrase": "cell_wall_biosynthesis_pathway"}, {"score": 0.00443308765153716, "phrase": "bacterial_growth"}, {"score": 0.00433553336181385, "phrase": "penicillin-binding_proteins"}, {"score": 0.004213240903095234, "phrase": "glycan_chains"}, {"score": 0.0041205045256557694, "phrase": "bacterial_cell_wall_formation"}, {"score": 0.003953639783762917, "phrase": "increasing_incidence"}, {"score": 0.0037336520904376687, "phrase": "bacterial_pathogens"}, {"score": 0.0036052633308076933, "phrase": "beta-lactam_rings"}, {"score": 0.0031643005824589917, "phrase": "low_toxicity"}, {"score": 0.0030749430762478706, "phrase": "continuing_emergence"}, {"score": 0.0028578496983461136, "phrase": "cephalosporin_core_structure"}, {"score": 0.002750721367040336, "phrase": "antimicrobial_spectra"}, {"score": 0.0025727942759279513, "phrase": "good_antimicrobial_activities"}, {"score": 0.002532151331015729, "phrase": "clinical_trials"}, {"score": 0.0024842242921857705, "phrase": "computer-aided_studies"}, {"score": 0.0021049977753042253, "phrase": "new_cephalosporins"}], "paper_keywords": ["beta-lactam", " penicillin", " cephalosporin", " penicillin-binding proteins", " beta-lactamases", " deacetoxycephalosporin C synthase"], "paper_abstract": "Penicillins and cephalosporins are beta-lactam antibiotics widely used to treat bacterial infectious diseases. They mainly target the cell wall biosynthesis pathway to inhibit bacterial growth. The targets, known as penicillin-binding proteins, are enzymes involved in the polymerization of glycan chains, cross-linking them during bacterial cell wall formation. However, the dispensation of these antibiotics has been concomitant with increasing incidence of resistance to them. Reportedly, this is due to the evolvement of two resistance mechanisms in the bacterial pathogens. One is the production of beta-lactamases that cleave the beta-lactam rings of penicillin and cephalosporin antibiotics, rendering them ineffective against the pathogens. Another is the modification of the targets, resulting in their inability to bind beta-lactam antibiotics. Nevertheless, beta-lactam antibiotics remain clinically relevant due to their high target specificity in bacteria and low toxicity to humans. Thus, to overcome the continuing emergence of resistance in pathogens, more efficacious beta-lactams have to be developed and cephalosporins are often preferred over penicillins due to two alkyl sites in the cephalosporin core structure amenable for modification. Transformed beta-lactams are expected to have improved antimicrobial spectra and pharmacokinetics. This is illustrated by the development of two cephalosporins, namely ceftobiprole and ceftaroline, which have shown good antimicrobial activities and are currently undergoing clinical trials. This review will discuss computer-aided studies of three enzymes closely related to cephalosporins: (1) its synthesizing enzyme, deacetoxycephalosporin C synthase, (2) its targets, the penicillin-binding proteins, and (3) its degrading enzyme, the beta-lactamases, and their implications in the development of new cephalosporins.", "paper_title": "Designing New beta-Lactams: Implications from Their Targets, Resistance Factors and Synthesizing Enzymes", "paper_id": "WOS:000288318200005"}