{"auto_keywords": [{"score": 0.04840706869974126, "phrase": "multiple_visual_features"}, {"score": 0.015582201258123264, "phrase": "out-of-sample_extension"}, {"score": 0.00976627063830256, "phrase": "smff"}, {"score": 0.009099312787110053, "phrase": "low-dimensional_features"}, {"score": 0.00481495049065317, "phrase": "semi-supervised_multiple_feature_fusion"}, {"score": 0.004425215632459868, "phrase": "model_retrieval"}, {"score": 0.004308791766002289, "phrase": "visual_feature"}, {"score": 0.004251728624599691, "phrase": "unique_characteristic"}, {"score": 0.004121490798711703, "phrase": "unequal_discriminative_power"}, {"score": 0.0040309035566691645, "phrase": "specific_category"}, {"score": 0.003821503621554738, "phrase": "model_representation"}, {"score": 0.003449972561293443, "phrase": "efficient_semi-supervised_multiple_feature_fusion"}, {"score": 0.002677217264360258, "phrase": "svm"}, {"score": 0.0026534216058128708, "phrase": "knn"}, {"score": 0.00258347644721642, "phrase": "subsequent_retrieval_phase"}, {"score": 0.0021910825909008946, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["3D model retrieval", " Multiple feature fusion", " Out-of-sample", " Semi-supervised learning"], "paper_abstract": "Multiple visual features have been proposed and used in 3-dimensional (3D) model retrieval in recent years. Since each visual feature reflects a unique characteristic about the model, they have unequal discriminative power with respect to a specific category of 3D model, and they are complementary to each other in model representation. Thus, it would be beneficial to combine multiple visual features together in 3D model retrieval. In light of this, we propose an efficient Semi-supervised Multiple Feature Fusion (SMFF) method for view-based 3D model retrieval in this paper. Specifically, We first extract multiple visual features to describe both the local and global appearance characteristics of multiple 2D projected images that are generated from 3D models. Then, SMFF is adopted to learn a more compact and discriminative low-dimensional feature representation via multiple feature fusion using both the labeled and unlabeled 3D models. Once the low-dimensional features have been learned, many existing methods such as SVM and KNN can be used in the subsequent retrieval phase. Moreover, an out-of-sample extension of SMFF is provided to calculate the low-dimensional features for the newly added 3D models in linear time. Experiments on two public 3D model datasets demonstrate that using such a learned feature representation can significantly improve the performance of 3D model retrieval and the proposed method outperforms the other competitors. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Efficient semi-supervised multiple feature fusion with out-of-sample extension for 3D model retrieval", "paper_id": "WOS:000359170300004"}