{"auto_keywords": [{"score": 0.041357225870640175, "phrase": "mobile_web_users"}, {"score": 0.013980225309547456, "phrase": "disabled_users"}, {"score": 0.013894124234193098, "phrase": "mobile_users"}, {"score": 0.004815328639243071, "phrase": "barriers"}, {"score": 0.0047701277915006, "phrase": "mobile_and_disabled_web_users"}, {"score": 0.004740476936977635, "phrase": "world_wide_web_accessibility"}, {"score": 0.004711009518112459, "phrase": "best_practice_audits"}, {"score": 0.004481740377469438, "phrase": "increasing_number"}, {"score": 0.004453874101119545, "phrase": "conformance_criteria"}, {"score": 0.004303664701305258, "phrase": "web_access"}, {"score": 0.004043363653396813, "phrase": "situationally-induced_impairments"}, {"score": 0.0038584826729133022, "phrase": "visually_disabled_and_motor_impaired_users"}, {"score": 0.0034162643819889054, "phrase": "way_attempt"}, {"score": 0.00331125524068286, "phrase": "additional_conformance_criteria"}, {"score": 0.0032803844011304283, "phrase": "mobile_web_best_practice_guidelines"}, {"score": 0.0027368750412376215, "phrase": "barrier_types"}, {"score": 0.002652693384545025, "phrase": "mobile_and_disabled_users"}, {"score": 0.002555077462660864, "phrase": "mobile_conformance"}, {"score": 0.002461044825190643, "phrase": "low_vision_users"}, {"score": 0.002415331146563814, "phrase": "low_vision"}, {"score": 0.0023704645774716743, "phrase": "similar_rates"}, {"score": 0.0022760856906838814, "phrase": "aggregated_evaluation_results"}, {"score": 0.0022407927161620855, "phrase": "impaired_users"}, {"score": 0.0021314833449798077, "phrase": "british_informatics_society_limited"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Web accessibility evaluation", " Mobile web evaluation", " Barrier Walkthrough aggregation"], "paper_abstract": "World Wide Web accessibility and best practice audits and evaluations are becoming increasingly complicated, time consuming, and costly because of the increasing number of conformance criteria which need to be tested. In the case of web access by disabled users and mobile users, a number of commonalities have been identified in usage, which have been termed situationally-induced impairments; in effect the barriers experienced by mobile web users have been likened to those of visually disabled and motor impaired users. In this case, we became interested in understanding if it was possible to evaluate the problems of mobile web users in terms of the aggregation of barriers-to-access experienced by disabled users; and in this way attempt to reduce the need for the evaluation of the additional conformance criteria associated with mobile web best practice guidelines. We used the Barrier Walkthrough (BW) method as our analytical framework. Capable of being used to evaluate accessibility in both the disabled and mobile contexts, the BW method would also enable testing and aggregation of barriers across our target user groups. We tested 61 barriers across four user groups each over four pages with 19 experts and 57 non-experts focusing on the validity and reliability of our results. We found that 58% of the barrier types that were correctly found were identified as common between mobile and disabled users. Further, if our aggregated barriers alone were used to test for mobile conformance only four barrier types would be missed. Our results also showed that mobile users and low vision users have the most common barrier types, while low vision and motor impaired users experiencing similar rates of severity in the barriers they experienced. We conclude that the aggregated evaluation results for blind, low vision and motor impaired users can be used to approximate the evaluation results for mobile web users. (C) 2011 British Informatics Society Limited. Published by Elsevier B.V. All rights reserved.", "paper_title": "Barriers common to mobile and disabled web users", "paper_id": "WOS:000297871400016"}