{"auto_keywords": [{"score": 0.046117814294263856, "phrase": "virtual_organisations"}, {"score": 0.03118286225306413, "phrase": "collaborative_networks"}, {"score": 0.012135120523856449, "phrase": "extended_axiomatic_design_theory"}, {"score": 0.007740489563401459, "phrase": "structural_complexity"}, {"score": 0.0054237020383791, "phrase": "enterprise_engineering_methods"}, {"score": 0.005134536376569259, "phrase": "collaborative_network"}, {"score": 0.004777392826700429, "phrase": "transaction_cost"}, {"score": 0.0038969619124903884, "phrase": "virtual_organisation's_behaviour"}, {"score": 0.0036457672198249333, "phrase": "virtual_organisation_creation"}, {"score": 0.0029500270981001058, "phrase": "virtual_organisation_creation_transactions"}, {"score": 0.0027705505273051007, "phrase": "heuristic_rule"}, {"score": 0.002738131487658495, "phrase": "optimal_size"}, {"score": 0.002674423963978094, "phrase": "process_and_people_capability_maturity_levels"}, {"score": 0.002541417196444962, "phrase": "higher_maturity"}, {"score": 0.0025215486544004134, "phrase": "higher_probability"}, {"score": 0.0021636476333109144, "phrase": "capability_improvement"}, {"score": 0.0021215910859085146, "phrase": "higher_levels"}, {"score": 0.0021049977753042253, "phrase": "enterprise_engineering_maturity"}], "paper_keywords": ["Extended axiomatic design theory", " structural complexity", " transaction cost", " virtual brokerage", " process and people capability maturity models"], "paper_abstract": "The paradigm of forming and sustaining collaborative networks as environments that create virtual organisations assumes that effective (and efficient) enterprise engineering capabilities and processes are available. However, these processes are only effective if they produce virtual organisations that have sufficiently limited complexity, because as complexity grows, the virtual organisation's behaviour becomes increasingly harder to predict under all circumstances. This article demonstrates that the efficiency of virtual organisation creation by collaborative networks can be limited by the complexity of the network itself. This article proposes the use of enterprise engineering methods based on extended axiomatic design theory to limit the complexity of virtual organisations - and of the collaborative network itself. This article also formulates methods to calculate and reduce the structural complexity of collaborative networks and the cost of virtual organisation creation transactions through virtual brokerages. The method is demonstrated through an example and also yields a heuristic rule regarding the optimal size of such brokerages. Also, process and people capability maturity levels were introduced for the use of enterprise engineering methods based on extended axiomatic design theory, whereupon higher maturity implies higher probability of success of collaborative networks in creating and maintaining virtual organisations, and success of the virtual organisations themselves (i.e. higher capability to limit the complexity of virtual organisations and of collaborative network itself). This article also formulates strategies for capability improvement, intended to achieve higher levels of enterprise engineering maturity.", "paper_title": "Reducing the structural complexity and transaction cost of collaborative networks using extended axiomatic design theory and virtual brokerage", "paper_id": "WOS:000345534100005"}