{"auto_keywords": [{"score": 0.04807496386351964, "phrase": "research_areas"}, {"score": 0.035714486002063964, "phrase": "proposed_methodology"}, {"score": 0.031243977204464993, "phrase": "classification_system"}, {"score": 0.00481495049065317, "phrase": "publication-level_classification_system"}, {"score": 0.004548253531664032, "phrase": "essential_element"}, {"score": 0.004215397034321004, "phrase": "web_of_science_subject_categories"}, {"score": 0.004077508669922702, "phrase": "journal-level_classification_systems"}, {"score": 0.0037610536973798113, "phrase": "multidisciplinary_journals"}, {"score": 0.0035864603175592854, "phrase": "new_methodology"}, {"score": 0.0035356745476539885, "phrase": "classification_systems"}, {"score": 0.0034526191487098093, "phrase": "individual_publications"}, {"score": 0.0032456625605347417, "phrase": "citation_relations"}, {"score": 0.0028140548269469934, "phrase": "extensive_analysis"}, {"score": 0.0026077803487003, "phrase": "important_strengths"}, {"score": 0.002546466113418944, "phrase": "relative_simplicity"}, {"score": 0.002359759876402679, "phrase": "direct_citation_relations"}, {"score": 0.0021454671611847507, "phrase": "relationsfor_instance"}, {"score": 0.0021049977753042253, "phrase": "bibliographic_coupling"}], "paper_keywords": ["citation analysis", " bibliometrics"], "paper_abstract": "Classifying journals or publications into research areas is an essential element of many bibliometric analyses. Classification usually takes place at the level of journals, where the Web of Science subject categories are the most popular classification system. However, journal-level classification systems have two important limitations: They offer only a limited amount of detail, and they have difficulties with multidisciplinary journals. To avoid these limitations, we introduce a new methodology for constructing classification systems at the level of individual publications. In the proposed methodology, publications are clustered into research areas based on citation relations. The methodology is able to deal with very large numbers of publications. We present an application in which a classification system is produced that includes almost 10 million publications. Based on an extensive analysis of this classification system, we discuss the strengths and the limitations of the proposed methodology. Important strengths are the transparency and relative simplicity of the methodology and its fairly modest computing and memory requirements. The main limitation of the methodology is its exclusive reliance on direct citation relations between publications. The accuracy of the methodology can probably be increased by also taking into account other types of relationsfor instance, based on bibliographic coupling.", "paper_title": "A new methodology for constructing a publication-level classification system of science", "paper_id": "WOS:000311853600003"}