{"auto_keywords": [{"score": 0.012418915862911334, "phrase": "algebraic_operations"}, {"score": 0.003945879572348638, "phrase": "mesh_structure"}, {"score": 0.003665874747419775, "phrase": "multiple_strategies"}, {"score": 0.0029776614744264724, "phrase": "irregular_division_schemes"}, {"score": 0.002939202022371694, "phrase": "entropy_weighted_blocks"}, {"score": 0.002863762666256937, "phrase": "recognition_accuracy"}, {"score": 0.0027422968723193057, "phrase": "local_structure"}, {"score": 0.0026146109167103655, "phrase": "different_facial_regions"}, {"score": 0.0024713335323674223, "phrase": "facial_feature_descriptors"}, {"score": 0.0024288443150616056, "phrase": "remarkable_experimental_results"}, {"score": 0.002179313258573377, "phrase": "promising_direction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Automatic 3D facial expression recognition", " Multiple strategies", " Image-like-structure", " Irregular division", " Block weighted strategy"], "paper_abstract": "The research on 3D facial expression recognition has attracted numbers of interests due to its superiority to 2D data and it has been greatly promoted in recent years. However, its performance needs to be further improved and its data structure needs to be further analyzed to keep its automation well as the mesh structure of 3D face models cannot be applied directly to algebraic operations. This paper addresses these problems with multiple strategies, so that 3D facial expression recognition can be automatically implemented and its performance is subsequently enhanced. Firstly, an image-like-structure is proposed to represent the 3D face models, so that algebraic operations can be directly applied to analyze 3D data. Based on this image-like-structure, the strategies of irregular division schemes and the entropy weighted blocks are employed to improve the recognition accuracy. The former aims to keep the integrity of local structure; the latter is employed to emphasize the contribution of different facial regions. Both of them can be separately or jointly, utilized to facial feature descriptors. With the remarkable experimental results based on LBP and LIP, we can conclude that these strategies are available to promote the performance of automatic 3D facial expression recognition, which draws a promising direction for automatic 3D facial expression recognition. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Multiple strategies to enhance automatic 3D facial expression recognition", "paper_id": "WOS:000357910700010"}