{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-agent_planning_problem"}, {"score": 0.004473982381245469, "phrase": "possible_dependencies"}, {"score": 0.004424953471635011, "phrase": "agents'_activities"}, {"score": 0.004007083686875716, "phrase": "plan_coordination_methods"}, {"score": 0.0037643920253363776, "phrase": "design_techniques"}, {"score": 0.003471933181807712, "phrase": "joint_combination"}, {"score": 0.0031553611552558986, "phrase": "resulting_plans"}, {"score": 0.003086492169113408, "phrase": "additional_costs"}, {"score": 0.003019121766552419, "phrase": "design_method"}, {"score": 0.002733646947011804, "phrase": "selfish_agents"}, {"score": 0.002673957615079041, "phrase": "optimal_solution"}, {"score": 0.002216336059488137, "phrase": "resource_usage"}], "paper_keywords": ["Multi-agent systems", " Coordination", " Autonomous planning", " Algorithms"], "paper_abstract": "We consider a multi-agent planning problem as a set of activities that has to be planned by several autonomous agents. In general, due to the possible dependencies between the agents' activities or interactions during execution of those activities, allowing agents to plan individually may lead to a very inefficient or even infeasible solution to the multi-agent planning problem. This is exactly where plan coordination methods come into play. In this paper, we aim at the development of coordination by design techniques that (i) let each agent construct its plan completely independent of the others while (ii) guaranteeing that the joint combination of their plans always is coordinated. The contribution of this paper is twofold. Firstly, instead of focusing only on the feasibility of the resulting plans, we will investigate the additional costs incurred by the coordination by design method, that means, we propose to take into account the price of autonomy: the ratio of the costs of a solution obtained by coordinating selfish agents versus the costs of an optimal solution. Secondly, we will point out that in general there exist at least two ways to achieve coordination by design: one called concurrent decomposition and the other sequential decomposition. We will briefly discuss the applicability of these two methods, and then illustrate them with two specific coordination problems: coordinating tasks and coordinating resource usage. We also investigate some aspects of the price of autonomy of these two coordination methods.", "paper_title": "Coordination by design and the price of autonomy", "paper_id": "WOS:000275787200002"}