{"auto_keywords": [{"score": 0.0357273748039558, "phrase": "specific_tasks"}, {"score": 0.009550321865382686, "phrase": "scheduling_strategies"}, {"score": 0.00481495049065317, "phrase": "configurable_scheduling_strategies"}, {"score": 0.00476323161560059, "phrase": "work-stealing_systems"}, {"score": 0.003879234831701853, "phrase": "task_execution_order"}, {"score": 0.0037554497046697432, "phrase": "underlying_task_storage_data_structure"}, {"score": 0.0034817084307034955, "phrase": "task_parallel_executions"}, {"score": 0.003298441494378465, "phrase": "scheduling_system"}, {"score": 0.0027592065435732955, "phrase": "local_task_execution"}, {"score": 0.002222102813520549, "phrase": "work-stealing_system"}, {"score": 0.0021049977753042253, "phrase": "beneficial_effects"}], "paper_keywords": ["Algorithms", " Work-stealing", " scheduler hints", " strategies", " priorities"], "paper_abstract": "Work-stealing systems are typically oblivious to the nature of the tasks they are scheduling. They do not know or take into account how long a task will take to execute or how many subtasks it will spawn. Moreover, task execution order is typically determined by an underlying task storage data structure, and cannot be changed. There are thus possibilities for optimizing task parallel executions by providing information on specific tasks and their preferred execution order to the scheduling system. We investigate generalizations of work-stealing and introduce a framework enabling applications to dynamically provide hints on the nature of specific tasks using scheduling strategies. Strategies can be used to independently control both local task execution and steal order. Strategies allow optimizations on specific tasks, in contrast to more conventional scheduling policies that are typically global in scope. Strategies are composable and allow different, specific scheduling choices for different parts of an application simultaneously. We have implemented a work-stealing system based on our strategy framework. A series of benchmarks demonstrates beneficial effects that can be achieved with scheduling strategies.", "paper_title": "Work-stealing with Configurable Scheduling Strategies", "paper_id": "WOS:000324158900044"}