{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "game-like_environments"}, {"score": 0.004646852519870358, "phrase": "educational_purposes"}, {"score": 0.004347256848088215, "phrase": "popular_games"}, {"score": 0.004121490798711703, "phrase": "digital_educational_games"}, {"score": 0.0037043953071235185, "phrase": "empirical_research"}, {"score": 0.003449972561293443, "phrase": "essential_characteristics"}, {"score": 0.0031006232333900055, "phrase": "learning_outcomes"}, {"score": 0.0029263562233195423, "phrase": "game-like_learning_tool"}, {"score": 0.0028492532869274743, "phrase": "database_concept"}, {"score": 0.002824005136794786, "phrase": "higher_education_programs"}, {"score": 0.0027989800906333784, "phrase": "software_engineering"}, {"score": 0.0025605773834404253, "phrase": "experimental_results"}, {"score": 0.0021910825909008946, "phrase": "higher_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Post-secondary education"], "paper_abstract": "Considering the role of games for educational purposes, there has an increase in interest among educators in applying strategies used in popular games to create more engaging learning environments. Learning is more fun and appealing in digital educational games and, as a result, it may become more effective. However, few research studies have been conducted to establish principles based on empirical research for designing engaging and entertaining games so as to improve learning. One of the essential characteristics of games that has been unexplored in the literature is the concept of uncertainty. This study examines the effect of uncertainty on learning outcomes. In order to better understand this effect on learning, a game-like learning tool was developed to teach a database concept in higher education programs of software engineering. The tool is designed in two versions: one including uncertainty and the other including no uncertainty. The experimental results of this study reveal that uncertainty enhances learning. Uncertainty is found to be positively associated with motivation. As motivation increases, participants tend to spend more time on answering the questions and to have higher accuracy in these questions. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of uncertainty on learning in game-like environments", "paper_id": "WOS:000320430500002"}