{"auto_keywords": [{"score": 0.04781725718374512, "phrase": "social_sciences"}, {"score": 0.044326271416438294, "phrase": "nse"}, {"score": 0.03937387787146113, "phrase": "ssh"}, {"score": 0.01020309616041841, "phrase": "natural_sciences"}, {"score": 0.007001889609657435, "phrase": "nse."}, {"score": 0.006247203766552978, "phrase": "collaborative_activities"}, {"score": 0.004814955734927369, "phrase": "canadian"}, {"score": 0.004468304427278713, "phrase": "basic_dichotomy"}, {"score": 0.004371160978838441, "phrase": "publication_practices"}, {"score": 0.003847802030433298, "phrase": "nse_share"}, {"score": 0.0038141000450978746, "phrase": "common_practices"}, {"score": 0.003477505397536663, "phrase": "cd-rom_versions"}, {"score": 0.0034168317227203206, "phrase": "social_sciences_citation_index"}, {"score": 0.003284145698220425, "phrase": "collaboration_patterns"}, {"score": 0.0030608148631528767, "phrase": "widely_held_belief"}, {"score": 0.002890557197908352, "phrase": "homogeneous_category"}, {"score": 0.002499590390751339, "phrase": "geographical_proximity"}, {"score": 0.0023294867572824147, "phrase": "empirical_analysis"}, {"score": 0.0022787359717772976, "phrase": "new_light"}, {"score": 0.0021049977753042253, "phrase": "policy_implications"}], "paper_keywords": [""], "paper_abstract": "A basic dichotomy is generally made between publication practices in the natural sciences and engineering (NSE) on the one hand and social sciences and humanities (SSH) on the other. However, while researchers in the NSE share some common practices with researchers in SSH, the spectrum of practices is broader in the latter. Drawing on data from the CD-ROM versions of the Science Citation Index, Social Sciences Citation Index and the Arts & Humanities Citation Index from 1980 to 2002, this paper compares collaboration patterns in the SSH to those in the NSE. We show that, contrary to a widely held belief, researchers in the social sciences and the humanities do not form a homogeneous category. In fact, collaborative activities of researchers in the social sciences are more comparable to those of researchers in the NSE than in the humanities. Also, we see that language and geographical proximity influences the choice of collaborators in the SSH, but also in the NSE. This empirical analysis, which sheds a new light on the collaborative activities of researchers in the NSE compared to those in the SSH, may have policy implications as granting councils in these fields have a tendency to imitate programs developed for the NSE, without always taking into account the specificity of the humanities.", "paper_title": "Canadian collaboration networks: A comparative analysis of the natural sciences, social sciences and the humanities", "paper_id": "WOS:000239300600013"}