{"auto_keywords": [{"score": 0.032329774677387874, "phrase": "uf"}, {"score": 0.00481495049065317, "phrase": "emergency_response_applications"}, {"score": 0.0046432244185370605, "phrase": "first_responders"}, {"score": 0.004539005582217305, "phrase": "remotely_located_base_stations"}, {"score": 0.004201774694043468, "phrase": "automatic_and_robust_multi-user_breadcrumb_system"}, {"score": 0.004015182362035361, "phrase": "breadcrumb_dispenser"}, {"score": 0.003960831041259951, "phrase": "link_estimator"}, {"score": 0.0037506567448470163, "phrase": "reliable_wireless_connectivity"}, {"score": 0.003503497128638099, "phrase": "height_difference"}, {"score": 0.0033175095965171674, "phrase": "dispensed_nodes"}, {"score": 0.0032135959043774085, "phrase": "adaptive_power_management"}, {"score": 0.003170060683860338, "phrase": "link_quality"}, {"score": 0.0029209233709517634, "phrase": "longer_breadcrumb_chain_lengths"}, {"score": 0.002855251306715901, "phrase": "high_system_reliability"}, {"score": 0.002816556934231128, "phrase": "appropriate_benefit_and_cost_functions"}, {"score": 0.002536763634539386, "phrase": "art_solution"}, {"score": 0.002233301265743633, "phrase": "uf_coordination_algorithm"}, {"score": 0.002133937537670314, "phrase": "baseline_greedy_coordination_approach"}], "paper_keywords": ["Breadcrumb systems", " emergency response applications", " link monitoring", " utility function", " deployment and evaluation"], "paper_abstract": "Breadcrumb systems (BCS) aid first responders by communicating their physiological parameters to remotely located base stations. In this paper, we describe the design, implementation, and evaluation of an automatic and robust multi-user breadcrumb system for indoor first response applications. Our solution includes a breadcrumb dispenser with a link estimator that is used to decide when to deploy breadcrumbs to maintain reliable wireless connectivity. The solution includes accounting for realities of buildings and dispensing such as the height difference between where the dispenser is worn and the floor where the dispensed nodes are found. We also include adaptive power management to maintain link quality over time. Moreover, we propose UF, a distributed cooperative deployment algorithm, to achieve longer breadcrumb chain lengths while maintaining fairness and high system reliability via selecting appropriate benefit and cost functions. We deployed and evaluated our systemin real buildings with several different first responder mobility patterns. Experimental results from our study show that compared to the state of the art solution [27], our breadcrumb system achieves 200 percent link redundancy with only 23 percent additional deployed nodes. Our deployed breadcrumb chain can achieve 90 percent PRR when one node fails in the chain. In addition, by applying the UF coordination algorithm, the system can maintain connectivity for up to 87 percent longer distances than baseline greedy coordination approach while maintaining 96 percent packet delivery ratio.", "paper_title": "An Automatic, Robust, and Efficient Multi-User Breadcrumb System for Emergency Response Applications", "paper_id": "WOS:000333092700002"}