{"auto_keywords": [{"score": 0.04844170546569224, "phrase": "molecular_dynamics_simulations"}, {"score": 0.03321547894243722, "phrase": "active_site"}, {"score": 0.024784786504706315, "phrase": "water_molecule"}, {"score": 0.00481495049065317, "phrase": "cyclin-dependent_kinases"}, {"score": 0.003535320700255283, "phrase": "stronger_affinity"}, {"score": 0.0034894451015047875, "phrase": "r_enantiomer"}, {"score": 0.003399466007862412, "phrase": "important_hydrogen_bond"}, {"score": 0.0030754582519753474, "phrase": "binding-enhanced_electrostatic_contributions"}, {"score": 0.002831158147480665, "phrase": "roscovitine-like_inhibitors"}, {"score": 0.002675252546913683, "phrase": "molecular_mechanics"}, {"score": 0.0026175952455594277, "phrase": "area_calculations"}, {"score": 0.0024519545383399773, "phrase": "significantly_different_electrostatic_contributions"}, {"score": 0.0021797112385590913, "phrase": "water-excluded_structure"}, {"score": 0.0021049977753042253, "phrase": "new_indirubin-like_inhibitors"}], "paper_keywords": ["dycline-dependent kinase", " hydrogen bond", " binding pattern", " binding energy", " molecular dynamics simulation"], "paper_abstract": "Molecular dynamics simulations were performed to elucidate the interactions of CDK2 and CDK5 complexes with three inhibitors: R-roscovitine, S-roscovitine, and indirubin-3'-oxime. The preference of the two complexes for R-roscovitine over the S enantiomer, as reported by the experiment, was also found by the simulations. More importantly, the simulations showed that the cause of the stronger affinity for the R enantiomer is the presence of an important hydrogen bond between R-roscovitine and the kinases not found with S-roscovitine. The simulations also showed two amino acid mutations in the active site of CDK5/R-roscovitine that favor binding-enhanced electrostatic contributions, making the inhibitor more effective for CDK5 than for CDK2. This suggests that the effectiveness of roscovitine-like inhibitors can be improved by enhancing their electrostatic interaction with the kinases. Finally, molecular mechanics-Possion-Boltzmann/surface area calculations of the CDK5/indirubin-3'-oxime system in both water-excluded and water-included environments gave significantly different electrostatic contributions to the binding. The simulations detected the displacement of a water molecule in the active site of the water-included CDK/indirubin-3'-oxime system. This resulted in a more conserved binding pattern than the water-excluded structure. Hence, in the design of new indirubin-like inhibitors, it is important to include the water molecule in the analysis.", "paper_title": "Study of the inhibition of cyclin-dependent kinases with roscovitine and indirubin-3 '-oxime from molecular dynamics simulations", "paper_id": "WOS:000242326700009"}