{"auto_keywords": [{"score": 0.03751951230806167, "phrase": "europe"}, {"score": 0.004539005582217309, "phrase": "individual_university"}, {"score": 0.0039055990919333082, "phrase": "eth_zurich"}, {"score": 0.0036874920632325977, "phrase": "ethz"}, {"score": 0.00366185681714204, "phrase": "high_position"}, {"score": 0.003306559295382181, "phrase": "science_and_technology_studies"}, {"score": 0.0031335830806256777, "phrase": "social_sciences"}, {"score": 0.0029221312451219203, "phrase": "bibliometric_indicator_values"}, {"score": 0.0027395968397212053, "phrase": "differing_estimates"}, {"score": 0.00266693888510356, "phrase": "university's_publications"}, {"score": 0.0025546627686955656, "phrase": "citation_impact"}, {"score": 0.0022696277881969896, "phrase": "individual_publications"}, {"score": 0.002116351238579227, "phrase": "leiden_ranking"}], "paper_keywords": ["ranking"], "paper_abstract": "Even with very well-documented rankings of universities, it is difficult for an individual university to reconstruct its position in the ranking. What is the reason behind whether a university places higher or lower in the ranking? Taking the example of ETH Zurich, the aim of this communication is to reconstruct how the high position of ETHZ (in Europe rank no. 1 in PP[top 10%]) in the Centre for Science and Technology Studies (CWTS) Leiden Ranking 2013 in the field social sciences, arts and humanities came about. According to our analyses, the bibliometric indicator values of a university depend very strongly on weights that result in differing estimates of both the total number of a university's publications and the number of publications with a citation impact in the 90th percentile, or PP(top 10%). In addition, we examine the effect of weights at the level of individual publications. Based on the results, we offer recommendations for improving the Leiden Ranking (for example, publication of sample calculations to increase transparency).", "paper_title": "What Is Behind the Curtain of the Leiden Ranking?", "paper_id": "WOS:000359021200015"}