{"auto_keywords": [{"score": 0.03607419095412168, "phrase": "media_data"}, {"score": 0.004781215097314411, "phrase": "cost-effective_streaming_media_distribution"}, {"score": 0.004714448392640623, "phrase": "video_and_audio_data"}, {"score": 0.004681413843223496, "phrase": "real-time_streaming_mode"}, {"score": 0.004168448339217754, "phrase": "cdn_servers"}, {"score": 0.003968112038249246, "phrase": "media_providers"}, {"score": 0.003912655174107315, "phrase": "server_capacity_reservation"}, {"score": 0.003672500644750565, "phrase": "distribution_process"}, {"score": 0.003608437115371213, "phrase": "cdn_server"}, {"score": 0.0033868916699805224, "phrase": "requesting_peer"}, {"score": 0.0030366573271799406, "phrase": "overall_media_distribution_capacity"}, {"score": 0.0029212625534156063, "phrase": "novel_hybrid_architecture"}, {"score": 0.002880393760798211, "phrase": "cdn-"}, {"score": 0.0027034263575471352, "phrase": "cdn_capacity_reservation"}, {"score": 0.0026562224049977213, "phrase": "media_quality"}, {"score": 0.0025642664420937327, "phrase": "different_limited_contribution_policies"}, {"score": 0.0024667783849055634, "phrase": "streaming_capacity"}, {"score": 0.0023897719795915, "phrase": "fair_and_limited_basis"}, {"score": 0.002282755117032059, "phrase": "proposed_architecture"}, {"score": 0.0022667208478315323, "phrase": "different_contribution_policies"}, {"score": 0.0021049977753042253, "phrase": "hybrid_architecture"}], "paper_keywords": ["peer-to-peer systems", " multimedia streaming", " content distribution networks"], "paper_abstract": "To distribute video and audio data in real-time streaming mode, two different technologies - Content Distribution Network (CDN) and Peer-to-Peer (P2P) - have been proposed. However, both technologies have their own limitations: CDN servers are expensive to deploy and maintain, and consequently incur a cost for media providers and/or clients for server capacity reservation. On the other hand, a P2P-based architecture requires sufficient number of seed supplying peers to jumpstart the distribution process. Compared with a CDN server, a peer usually offers much lower out-bound streaming rate and hence multiple peers must jointly stream a media data to a requesting peer. Furthermore, it is not clear how to determine how much a peer should contribute back to the system after receiving the media data, in order to sustain the overall media distribution capacity. In this paper, we propose and analyze a novel hybrid architecture that integrates both CDN- and P2P-based streaming media distribution. The architecture is highly cost-effective: it significantly lowers the cost of CDN capacity reservation, without compromising the media quality delivered. In particular, we propose and compare different limited contribution policies for peers that request a media data, so that the streaming capacity of each peer can be exploited on a fair and limited basis. We present: (1) in-depth analysis of the proposed architecture under different contribution policies, and (2) extensive simulation results which validate the analysis. Our analytical and simulation results form a rigorous basis for the planning and dimensioning of the hybrid architecture.", "paper_title": "Analysis of a CDN-P2P hybrid architecture for cost-effective streaming media distribution", "paper_id": "WOS:000236982300007"}