{"auto_keywords": [{"score": 0.04760688643890386, "phrase": "tensile_forces"}, {"score": 0.015719716506582538, "phrase": "laser_vibrometer"}, {"score": 0.004744991522984322, "phrase": "measurement"}, {"score": 0.00468912237497774, "phrase": "control_of_cable_tensile_forces"}, {"score": 0.004639712384096822, "phrase": "cable-stayed_bridges"}, {"score": 0.0044237033788643715, "phrase": "long-span_bridges"}, {"score": 0.004085713541752114, "phrase": "overall_quality"}, {"score": 0.0036167509502276294, "phrase": "natural_frequency"}, {"score": 0.0033579708256295847, "phrase": "tensile_force"}, {"score": 0.0029409171055888804, "phrase": "data_logger"}, {"score": 0.0023532890136269986, "phrase": "unique_postanalysis_computer_program"}, {"score": 0.0022674379203603224, "phrase": "real_time"}, {"score": 0.002127472359795555, "phrase": "laser_vibrometer_system"}, {"score": 0.0021049977753042253, "phrase": "accurate_and_reliable_matching"}], "paper_keywords": [""], "paper_abstract": "The tensile forces acting on the cable of long-span bridges are one of the most important factors since they reflect not only the structural stability of cables but also the overall quality of construction. Currently, indirect measurement using accelerometers attached to the surface of the cable is widely used to measure the natural frequency of cable. The frequency obtained from the accelerometer is converted to the tensile force of the cable. However, it sometimes requires many hazardous labors such as attaching the device on the surface of cable and wiring it with data logger, which could hinder the safety of workers during the erection of cables. In this study, a method using laser vibrometer is introduced to measure the tensile forces on cables at a distance. In addition, this study developed a unique postanalysis computer program that can calculate the tensile forces in real time. Compared with the values obtained from the accelerometers, the laser vibrometer system provided accurate and reliable matching.", "paper_title": "Application of Laser Vibrometer to the Measurement and Control of Cable Tensile Forces in Cable-Stayed Bridges", "paper_id": "WOS:000310290400001"}