{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soccer_ball"}, {"score": 0.049558064870310475, "phrase": "multiple_fixed_cameras"}, {"score": 0.0046340196745259694, "phrase": "innovative_techniques"}, {"score": 0.004063547375196532, "phrase": "shape_appearance"}, {"score": 0.003826007045267751, "phrase": "soccer_domain"}, {"score": 0.003622088701900472, "phrase": "object_and_motion_models"}, {"score": 0.0033363396054797044, "phrase": "ground_plane_velocity"}, {"score": 0.003264010423431402, "phrase": "normalized_size"}, {"score": 0.0030562674358159945, "phrase": "kalman_filter"}, {"score": 0.0029736479837154843, "phrase": "likelihood_measure"}, {"score": 0.002650279521276126, "phrase": "track_history"}, {"score": 0.0021516991383785985, "phrase": "experimental_results"}, {"score": 0.002128220632893247, "phrase": "quantitative_evaluations"}], "paper_keywords": ["Motion analysis", " Domain knowledge modeling", " Trajectory modeling", " 3D vision", " Video signal processing", " Sports analysis"], "paper_abstract": "This paper demonstrates innovative techniques for estimating the trajectory of a soccer ball from multiple fixed cameras. Since the ball is nearly always moving and frequently occluded, its size and shape appearance varies over time and between cameras. Knowledge about the soccer domain is utilized and expressed in terms of field, object and motion models to distinguish the ball from other movements in the tracking and matching processes. Using ground plane velocity, longevity, normalized size and color features, each of the tracks obtained from a Kalman filter is assigned with a likelihood measure that represents the ball. This measure is further refined by reasoning through occlusions and back-tracking in the track history. This can be demonstrated to improve the accuracy and continuity of the results. Finally, a simple 3D trajectory model is presented, and the estimated 3D ball positions are fed back to constrain the 2D processing for more efficient and robust detection and tracking. Experimental results with quantitative evaluations from several long sequences are reported. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Tracking the soccer ball using multiple fixed cameras", "paper_id": "WOS:000265227200006"}