{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "realistic_avatars"}, {"score": 0.004422632150619634, "phrase": "computer_technology"}, {"score": 0.004278807087784626, "phrase": "users'_requirements"}, {"score": 0.003784209997115174, "phrase": "pre-defined_accessories"}, {"score": 0.002876627851917633, "phrase": "easy_solution"}, {"score": 0.0028093921138602606, "phrase": "non-professional_users"}, {"score": 0.0027567336518542858, "phrase": "sketch_interface"}, {"score": 0.0025922974876210194, "phrase": "prototype_system"}, {"score": 0.002426137929553724, "phrase": "garment_surface"}, {"score": 0.0023139986108451967, "phrase": "garment_shape"}, {"score": 0.0022175019341824603, "phrase": "proposed_method"}, {"score": 0.002175913488493802, "phrase": "uniform_mesh"}, {"score": 0.002125020720324262, "phrase": "mesh_refinement"}], "paper_keywords": ["3D avatar", " Avatar customization", " Virtual dressing", " Virtual world"], "paper_abstract": "The use of 3D avatars is becoming more frequent with the development of computer technology and the internet. To meet users' requirements, some software or programs have allowed users to customize the avatar. However, users are only able to customize the avatar using the pre-defined accessories such as hair, clothing and so on. That is, users have limited chance to customize the avatar according to their own styles. It will be of interest to users if they are able to change the appearance of the avatar by their own design, such as creating garments for avatars themselves. This paper provides an easy solution to dressing realistic 3D avatars for non-professional users based on a sketch interface. After a user drawing a 2D garment profile around the avatar, the prototype system can generate an elaborate 3D geometric garment surface dressed on the avatar. The construction of the garment surface is constrained by key body features. And the garment shape is then optimized to remove artefacts. The proposed method can generate a uniform mesh for processing such as mesh refinement, 3D decoration and so on.", "paper_title": "On generating realistic avatars: dress in your own style", "paper_id": "WOS:000304619900011"}