{"auto_keywords": [{"score": 0.04236022982813548, "phrase": "pst_kbs"}, {"score": 0.030799763592321585, "phrase": "belief_revision_methods"}, {"score": 0.028471899329160756, "phrase": "agm-style_axioms"}, {"score": 0.00481495049065317, "phrase": "probabilistic_spatio-temporal_logics"}, {"score": 0.00473477283457869, "phrase": "extensive_interest"}, {"score": 0.004397487039229447, "phrase": "region_r"}, {"score": 0.00407042677958844, "phrase": "belief_revision"}, {"score": 0.00398916666053909, "phrase": "multiple_methods"}, {"score": 0.0038702962539127867, "phrase": "maximally_consistent_subsets"}, {"score": 0.0038443635340052523, "phrase": "maximal_cardinality"}, {"score": 0.0038314621564116192, "phrase": "consistent_subsets"}, {"score": 0.003594369823549604, "phrase": "spatial_information"}, {"score": 0.0035463496793144748, "phrase": "temporal_aspects"}, {"score": 0.0033832583769880576, "phrase": "belief_revision_mechanisms"}, {"score": 0.0033156995040617312, "phrase": "kb"}, {"score": 0.0029973957125353306, "phrase": "kb_yields"}, {"score": 0.002584879320145739, "phrase": "detailed_complexity_analysis"}, {"score": 0.0022668514286843817, "phrase": "kb."}, {"score": 0.002214048743052355, "phrase": "basic_approaches"}, {"score": 0.0021479597698614355, "phrase": "hybrid_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Belief revision", " Reasoning about motion", " Spatio-temporal logics", " Uncertainty management"], "paper_abstract": "There is now extensive interest in reasoning about moving objects. A probabilistic spatio-temporal (PST) knowledge base (KB) contains atomic statements of the form \"Object o is/was/will be in region r at time t with probability in the interval [e, u]\". In this paper, we study mechanisms for belief revision in PST KBs. We propose multiple methods for revising PST KBs. These methods involve finding maximally consistent subsets and maximal cardinality consistent subsets. In addition, there may be applications where the user has doubts about the accuracy of the spatial information, or the temporal aspects, or about the ability to recognize objects in such statements. We study belief revision mechanisms that allow changes to the KB in each of these three components. Finally, there may be doubts about the assignment of probabilities in the KB. Allowing changes to the probability of statements in the KB yields another belief revision mechanism. Each of these belief revision methods may be epistemically desirable for some applications, but not for others, We show that some of these approaches cannot satisfy AGM-style axioms for belief revision under certain conditions. We also perform a detailed complexity analysis of each of these approaches. Simply put, all belief revision methods proposed that satisfy AGM-style axioms turn out to be intractable with the exception of the method that revises beliefs by changing the probabilities (minimally) in the KB. We also propose two hybrids of these basic approaches to revision and analyze the complexity of these hybrid methods. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An AGM-style belief revision mechanism for probabilistic spatio-temporal logics", "paper_id": "WOS:000272403500004"}