{"auto_keywords": [{"score": 0.04668260212856778, "phrase": "intent_recognition"}, {"score": 0.023988095624660536, "phrase": "plan_recognition"}, {"score": 0.008524619236257719, "phrase": "multi-agent_system"}, {"score": 0.006719153308408374, "phrase": "conceptual_framework"}, {"score": 0.0048833175880779334, "phrase": "intent_recognition_agents"}, {"score": 0.00481495049065317, "phrase": "multi-agent_systems"}, {"score": 0.004812123601633093, "phrase": "plan_recognition_agents"}, {"score": 0.004360412703519539, "phrase": "minimal_communication"}, {"score": 0.0040366412779632085, "phrase": "overall_intent"}, {"score": 0.0039053194919285725, "phrase": "specific_plan"}, {"score": 0.0038624981944755813, "phrase": "observing_agent"}, {"score": 0.0036553070575015344, "phrase": "intent_recognition_systems"}, {"score": 0.0031207372860045427, "phrase": "cow_herding"}, {"score": 0.0030414140732789186, "phrase": "cow_agents"}, {"score": 0.003019121766552419, "phrase": "team_corrals"}, {"score": 0.002931569771634119, "phrase": "task_time"}, {"score": 0.002539689093411356, "phrase": "novel_approach"}, {"score": 0.0024842242921857705, "phrase": "unobserved_actions"}, {"score": 0.0023335495163073544, "phrase": "cow_herding_domain"}, {"score": 0.0022492129111567824, "phrase": "intent_recognition_system"}, {"score": 0.002200077887697072, "phrase": "plan_recognition_system"}, {"score": 0.0021049977753042253, "phrase": "complex_domains"}], "paper_keywords": ["Multi-agent systems", " plan recognition", " intent recognition", " distributed systems", " cooperative agents"], "paper_abstract": "In a multi-agent system, an agent may utilize its idle time to assist other agents in the system. Intent recognition is proposed to accomplish this with minimal communication. An agent performing recognition observes the tasks other agents are performing and, unlike the much studied field of plan recognition, the overall intent of an agent is recognized instead of a specific plan. The observing agent may use capabilities that it has not observed. A conceptual framework is proposed for intent recognition systems. An implementation of the conceptual framework is tested and evaluated. We hypothesize that using intent recognition in a multi-agent system increases utility (where utility is domain specific) and decreases the amount of communication. We test our hypotheses using the domain of Cow Herding, where agents attempt to herd cow agents into team corrals. A set of metrics, including task time and number of communications, is used to compare the performance of plan recognition and intent recognition. In our results, we find that intent recognition agents communicate fewer times than plan recognition agents. In addition, unlike plan recognition, when agents use the novel approach of intent recognition, they select unobserved actions to perform. Intent recognition agents were also able to outperform plan recognition agents by consistently scoring more points in the Cow Herding domain. This research shows that under certain conditions, an intent recognition system is more efficient than a plan recognition system. The advantage of intent recognition over plan recognition becomes more apparent in complex domains.", "paper_title": "INTENT RECOGNITION IN MULTI-AGENT SYSTEMS: COW HERDING", "paper_id": "WOS:000340297700010"}