{"auto_keywords": [{"score": 0.04912868039243805, "phrase": "locally_stratified_boolean_grammars"}, {"score": 0.04801141171062484, "phrase": "boolean_grammars"}, {"score": 0.004815274395208883, "phrase": "boolean"}, {"score": 0.0038152404172111815, "phrase": "string_w"}, {"score": 0.003694652993546994, "phrase": "nonterminal_a"}, {"score": 0.0034926916198124484, "phrase": "nonterminal_b"}, {"score": 0.0027890803075309926, "phrase": "local_stratifiability"}, {"score": 0.002733598121537801, "phrase": "linear_time"}, {"score": 0.0025633455664747606, "phrase": "locally_stratified_grammars"}, {"score": 0.002442634456448208, "phrase": "stratification_mapping"}, {"score": 0.002299689297293321, "phrase": "broadest_subclass"}, {"score": 0.0022268964676199292, "phrase": "classical_semantics"}, {"score": 0.002165091261117016, "phrase": "three-valued_formal_language_theory"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "We introduce locally stratified Boolean grammars, a natural subclass of Boolean grammars with many desirable properties. Informally, if a grammar is locally stratified then the set of all pairs of the form (nonterminal, string) of the grammar can be mapped to a (possibly infinite) set of strata so as that the following holds: if the membership of a string w', in the language defined by nonterminal A depends on the membership of string w' in the language defined by nonterminal B, then (B,w') cannot belong to a stratum higher than the stratum of (A,w); furthermore, if the above dependency is obtained through negation, (B,w') must belong to a stratum lower than the stratum of (A,w). We prove that local stratifiability can be tested in linear time with respect to the size of the given grammar. We then develop the semantics of locally stratified grammars and prove that it is independent of the choice of the stratification mapping. We argue that the class of locally stratified Boolean grammars appears at present to be the broadest subclass of Boolean grammars that can be given a classical semantics (i.e., without resorting to three-valued formal language theory). (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Locally stratified Boolean grammars", "paper_id": "WOS:000259251400020"}