{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "virtual_ball"}, {"score": 0.010111734487628529, "phrase": "interaction_patterns"}, {"score": 0.00481495049065317, "phrase": "character_animation"}, {"score": 0.004642604455537883, "phrase": "motion_data"}, {"score": 0.0035100601949451028, "phrase": "skillful_actor"}, {"score": 0.0032828706086018133, "phrase": "simple_but_interesting_method"}, {"score": 0.003107935254560724, "phrase": "skillful_ball-handling_motion"}, {"score": 0.0029965060407413898, "phrase": "actual_ball"}, {"score": 0.0029244418026475832, "phrase": "regularly_repeated_human_motions"}, {"score": 0.002436289099444074, "phrase": "captured_motion"}, {"score": 0.0023776656246300063, "phrase": "character_motion"}, {"score": 0.0022923586577645143, "phrase": "synthesized_trajectory"}, {"score": 0.0021438155673297377, "phrase": "proposed_technique"}], "paper_keywords": ["Virtual reality", " Interaction motion", " Motion capture", " Motion analysis", " Physics-based animation"], "paper_abstract": "It is very difficult and tedious work to synthesize an animation in which a character skillfully controls several balls. This is because all the virtual balls need to be synchronized with the motion of the character temporally and spatially as following the laws of physics. Moreover, a skillful actor is needed for capturing the motion. We introduce a simple but interesting method such that anyone can synthesize an animation of skillful ball-handling motion using interaction patterns without any actual ball. Interaction patterns involve regularly repeated human motions to control the virtual ball. We first capture the motion that mimics controlling a ball using various interaction patterns. Then we synthesize the trajectory of a virtual ball by analyzing the captured motion and correct the character motion to be fitted to the synthesized trajectory of a virtual ball. Experiments convincingly show the usefulness of proposed technique by synthesizing various ball-handling animations.", "paper_title": "Virtual ball player Synthesizing character animation to control a virtual ball from motion data using interaction patterns", "paper_id": "WOS:000357487500016"}