{"auto_keywords": [{"score": 0.04306145662998196, "phrase": "single_commitment"}, {"score": 0.03148304934847121, "phrase": "commitment_feasibility"}, {"score": 0.00481495049065317, "phrase": "multiagent_commitments"}, {"score": 0.0046141941030386525, "phrase": "autonomous_agents"}, {"score": 0.004575053987970206, "phrase": "multiagent_systems"}, {"score": 0.004328576620172571, "phrase": "multiagent_interactions"}, {"score": 0.004219321533320583, "phrase": "commitment_lifecycles"}, {"score": 0.00402610372759447, "phrase": "multiple_commitments"}, {"score": 0.0033232673019931206, "phrase": "existing_commitments"}, {"score": 0.003211788912325178, "phrase": "prospective_commitments"}, {"score": 0.002475755804232436, "phrase": "solid_method"}, {"score": 0.0023221983158528163, "phrase": "constraint_satisfaction_problem"}, {"score": 0.0022828795331819025, "phrase": "constraint_satisfaction_techniques"}, {"score": 0.0021049977753042253, "phrase": "realistic_cases"}], "paper_keywords": ["Multiagent interaction", " Commitments", " Fulfillment", " Feasibility"], "paper_abstract": "Commitments are being used to specify interactions among autonomous agents in multiagent systems. Various formalizations of commitments have shown their strength in representing and reasoning on multiagent interactions. These formalizations mostly study commitment lifecycles, emphasizing fulfillment of a single commitment. However, when multiple commitments coexist, fulfillment of one commitment may have an effect on the lifecycle of other commitments. Since agents generally participate in more than one commitment at a time, it is important for an agent to determine whether it can honor its commitments. These commitments may be the existing commitments of the agent as well as any prospective commitments that the agent plans to participate in. To address this, we develop the concept of commitment feasibility, i.e., whether it is possible for an agent to fulfill a set of commitments all together. To achieve this we generalize the fulfillment of a single commitment to the feasibility of a set of commitments. We then develop a solid method to determine commitment feasibility. Our method is based on the transformation of feasibility into a constraint satisfaction problem and use of constraint satisfaction techniques to come up with a conclusion. We show soundness and completeness of our method and illustrate its applicability over realistic cases.", "paper_title": "Constraint satisfaction as a tool for modeling and checking feasibility of multiagent commitments", "paper_id": "WOS:000324107400004"}