{"auto_keywords": [{"score": 0.0325826789528908, "phrase": "h_index"}, {"score": 0.00481495049065317, "phrase": "new_impact_indicator"}, {"score": 0.00476527679607755, "phrase": "research_effort"}, {"score": 0.0043555900164106934, "phrase": "international_ranking"}, {"score": 0.004064478393319772, "phrase": "apparent_sole_goal"}, {"score": 0.004008624230034271, "phrase": "research_ranking"}, {"score": 0.0034424690391411093, "phrase": "extremely_good_citation_performance"}, {"score": 0.003336875060853387, "phrase": "hirsch_index"}, {"score": 0.0032682787834955856, "phrase": "research_performance"}, {"score": 0.0032457271401035545, "phrase": "individual_researchers"}, {"score": 0.003113637673848439, "phrase": "original_aim"}, {"score": 0.0030390745780621503, "phrase": "mixed_measure"}, {"score": 0.0027773810175217273, "phrase": "overall_size"}, {"score": 0.0027108484507501907, "phrase": "impact_evaluation"}, {"score": 0.002401286805515306, "phrase": "solely_the_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Research impact indicator", " Institutional impact", " h index", " Size-dependence of the h index"], "paper_abstract": "This paper introduces a new impact indicator for the research effort of a university, (n)h(3). The number of documents or the number of citations obtained by an institution are used frequently in international ranking of institutions. However, these are very dependent on the size and this is inducing mergers with the apparent sole goal of improving the research ranking. The alternative is to use the ratio of the two measures, the mean citation rate, that is size independent but it has been shown to fluctuate along the time as a consequence of its dependence on a very small number of documents with an extremely good citation performance. In the last few years, the popularity of the Hirsch index as an indicator of the research performance of individual researchers led to its application to journals and institutions. However, the original aim of this h index of giving a mixed measure of the number of documents published and their impact as measured by the citations collected along the time is totally undesirable for institutions as the overall size may be considered irrelevant for the impact evaluation of research. Furthermore, the h index when applied to institutions tends to retain a very small number of documents making all other research production irrelevant for this indicator. The (n)h(3) index proposed here is designed to measure solely the impact of research in a way that is independent of the size of the institution and is made relatively stable by making a 20-year estimate of the citations of the documents produced in a single year. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A research impact indicator for institutions", "paper_id": "WOS:000281616200012"}