{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "constrained_nash_equilibria"}, {"score": 0.04978681999804711, "phrase": "graphical_games"}, {"score": 0.048070112256351695, "phrase": "nash_equilibrium"}, {"score": 0.02796399871371536, "phrase": "players'_interactions"}, {"score": 0.004741845603430361, "phrase": "widely_accepted_rational_behavior"}, {"score": 0.004712913906047687, "phrase": "non-cooperative_players"}, {"score": 0.004446677711302801, "phrase": "mixed_framework"}, {"score": 0.004312622975366676, "phrase": "randomized_manner"}, {"score": 0.004031699976413366, "phrase": "single_out_equilibria"}, {"score": 0.00399483173553482, "phrase": "additional_requirements"}, {"score": 0.0038624981944755813, "phrase": "minimum_payoff"}, {"score": 0.003689053436223376, "phrase": "formal_framework"}, {"score": 0.0034804536625952596, "phrase": "player_p"}, {"score": 0.0032336801561165113, "phrase": "large_population_games"}, {"score": 0.002886977102894829, "phrase": "constrained_equilibria"}, {"score": 0.002782694908561637, "phrase": "intrinsic_difficulty"}, {"score": 0.0025459275963373496, "phrase": "mixed_strategies"}, {"score": 0.0024842242921857705, "phrase": "pure_strategies"}, {"score": 0.002329258721870127, "phrase": "latter_case"}, {"score": 0.002217696306116023, "phrase": "nash_equilibria"}, {"score": 0.002157302200451323, "phrase": "highly-parallelizable_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Game theory", " Graphical games", " Nash equilibria", " Computational complexity", " Treewidth"], "paper_abstract": "A widely accepted rational behavior for non-cooperative players is based on the notion of Nash equilibrium. Although the existence of a Nash equilibrium is guaranteed in the mixed framework (i.e., when players select their actions in a randomized manner) in many real-world applications the existence of \"any\" equilibrium is not enough. Rather, it is often desirable to single out equilibria satisfying some additional requirements (in order, for instance, to guarantee a minimum payoff to certain players), which we call constrained Nash equilibria. In this paper, a formal framework for specifying these kinds of requirement is introduced and investigated in the context of graphical games, where a player p may directly be interested in some of the other players only, called the neighbors of p. This setting is very useful for modeling large population games, where typically each player does not directly depend on all the players, and representing her utility function extensively is either inconvenient or infeasible. Based on this framework, the complexity of deciding the existence and of computing constrained equilibria is then investigated, in the light of evidencing how the intrinsic difficulty of these tasks is affected by the requirements prescribed at the equilibrium and by the structure of players' interactions. The analysis is carried out for the setting of mixed strategies as well as for the setting of pure strategies, i.e., when players are forced to deterministically choose the action to perform. In particular, for this latter case, restrictions on players' interactions and on constraints are identified, that make the computation of Nash equilibria an easy problem, for which polynomial and highly-parallelizable algorithms are presented. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "On the complexity of constrained Nash equilibria in graphical games", "paper_id": "WOS:000269683400030"}