{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "abstract_cooperative_path-finding"}, {"score": 0.003925633992809873, "phrase": "spatial_temporal_paths"}, {"score": 0.003359647377874098, "phrase": "passable_regions"}, {"score": 0.0027922467043592597, "phrase": "unoccupied_neighboring_vertex"}, {"score": 0.0025085435314540837, "phrase": "bi-connected_graphs"}, {"score": 0.002320449502337321, "phrase": "theoretical_and_experimental_evaluation"}, {"score": 0.0022756672722130424, "phrase": "suggested_algorithms"}, {"score": 0.002242647404307089, "phrase": "viable_alternative"}, {"score": 0.0022101055924375725, "phrase": "based_techniques"}, {"score": 0.002135995282374723, "phrase": "permutation_groups"}, {"score": 0.0021049977753042253, "phrase": "studied_class"}], "paper_keywords": ["sliding puzzle", " cooperative path-finding", " BIBOX-theta", " makespan optimization", " motion coordination", " NxN-puzzle", " multirobot path-planning", " BIBOX", " (N2- 1)-puzzle", " 15-puzzle", " domain dependent planning"], "paper_abstract": "The problem of cooperative path-finding is addressed in this work. A set of agents moving in a certain environment is given. Each agent needs to reach a given goal location. The task is to find spatial temporal paths for agents such that they eventually reach their goals by following these paths without colliding with each other. An abstraction where the environment is modeled as an undirected graph is adopted-vertices represent locations and edges represent passable regions. Agents are modeled as elements placed in the vertices while at most one agent can be located in a vertex at a time. At least one vertex remains unoccupied to allow agents to move. An agent can move into unoccupied neighboring vertex or into a vertex being currently vacated if a certain additional condition is satisfied. Two novel scalable algorithms for solving cooperative path-finding in bi-connected graphs are presented. Both algorithms target environments that are densely populated by agents. A theoretical and experimental evaluation shows that the suggested algorithms represent a viable alternative to search based techniques as well as to techniques employing permutation groups on the studied class of the problem.", "paper_title": "SOLVING ABSTRACT COOPERATIVE PATH-FINDING IN DENSELY POPULATED ENVIRONMENTS", "paper_id": "WOS:000335401900009"}