{"auto_keywords": [{"score": 0.028038871449425018, "phrase": "pb"}, {"score": 0.015628024409100928, "phrase": "action_costs"}, {"score": 0.013734544581440834, "phrase": "soft_goals"}, {"score": 0.008059047871733883, "phrase": "planning_problems"}, {"score": 0.0069141827936048976, "phrase": "max-sat"}, {"score": 0.00481495049065317, "phrase": "ipc_simple_preferences"}, {"score": 0.004636867727899342, "phrase": "best_approach"}, {"score": 0.004530552828603269, "phrase": "classical_planning_problems"}, {"score": 0.004300133642951283, "phrase": "\"optimal\"_plans"}, {"score": 0.004275262915031191, "phrase": "sat-based_planning"}, {"score": 0.003918940000819495, "phrase": "preferences_framework"}, {"score": 0.0038179283509963695, "phrase": "sat-based_approach"}, {"score": 0.00376293585033711, "phrase": "actual_approach"}, {"score": 0.0036659304472884697, "phrase": "main_limitations"}, {"score": 0.003479331357315815, "phrase": "plan_quality_issues"}, {"score": 0.0034192594083899026, "phrase": "sat_formulas"}, {"score": 0.0032830808525570903, "phrase": "optimal_solutions"}, {"score": 0.0032263862712733934, "phrase": "heuristic_ordering"}, {"score": 0.003115908199991072, "phrase": "ipc_planning_problems"}, {"score": 0.002991774917857528, "phrase": "optimization_problems"}, {"score": 0.0029145912511665843, "phrase": "integer_\"weights"}, {"score": 0.0027501068128017924, "phrase": "ipplan"}, {"score": 0.0027262456979186976, "phrase": "deterministic_part"}, {"score": 0.0026713696264706287, "phrase": "recent_availability"}, {"score": 0.002655894070657161, "phrase": "efficient_max-sat"}, {"score": 0.0024987020562103448, "phrase": "satplan"}, {"score": 0.002469830206270585, "phrase": "wide_experimental_analysis"}, {"score": 0.0023921371117388143, "phrase": "state-of-the-art_planners"}, {"score": 0.0023507916951658455, "phrase": "previous_sat-based_approach"}, {"score": 0.002218054404179068, "phrase": "sat-based_framework"}, {"score": 0.0021420294823879292, "phrase": "side_effect"}], "paper_keywords": ["Planning", " satisfiability"], "paper_abstract": "Planning as Satisfiability (SAT) is currently the best approach for optimally (wrt makespan) solving classical planning problems and the extension of this framework to include preferences is nowadays considered the reference approach to compute \"optimal\" plans in SAT-based planning. It includes reasoning about soft goals and plans length as introduced in the 2006 and 2008 editions of the International Planning Competitions (IPCs). Despite the fact that the planning as satisfiability with preferences framework has helped to enhance the applicability of the SAT-based approach in planning, the actual approach used within the framework somehow suffers from some main limitations: the metrics, i.e. linear optimization functions defined over goals and/or actions, which account for plan quality issues, are fully reduced to SAT formulas, further increasing the size of (often already) big formulas; moreover, the search for optimal solutions is performed by forcing a heuristic ordering. In this paper we address these issues by reducing the IPC planning problems with soft goals (from IPC-5) and/or action costs (from IPC-6) to optimization problems extending SAT and that can naturally handle the integer \"weights\" of the metrics, i.e. to Max-SAT and Pseudo-Boolean (PB) problems. Our idea is partially motivated by the approach followed by IPPLAN in the deterministic part of the IPC-5 and by the recent availability of efficient Max-SAT and PB solvers. First, we prove that our approach is correct; then, we implement these ideas in SATPLAN and run a wide experimental analysis on planning problems from IPC-5 and IPC-6, taking as references state-of-the-art planners on these competitions and the previous SAT-based approach. Our analysis shows that our approach is competitive and helps to further widen the set of benchmarks that a SAT-based framework can efficiently deal with. At the same time, as a side effect of this analysis, challenging Max-SAT and PB benchmarks have been identified, as well as the Max-SAT and PB solvers performing best on these planning problems.", "paper_title": "Planning as satisfiability with IPC simple preferences and action costs", "paper_id": "WOS:000309167900006"}