{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organizational_performance"}, {"score": 0.01941148872083659, "phrase": "km_reliability"}, {"score": 0.017828491249315154, "phrase": "reliable_km"}, {"score": 0.004642377903273107, "phrase": "knowledge_management"}, {"score": 0.0044759626695474106, "phrase": "specific_theory"}, {"score": 0.004272724011826495, "phrase": "unexpected_failures"}, {"score": 0.004230382915464492, "phrase": "organizational_capabilities"}, {"score": 0.0041469500929423595, "phrase": "main_aim"}, {"score": 0.003906357144047631, "phrase": "existing_theory"}, {"score": 0.003880498041409292, "phrase": "high_reliability"}, {"score": 0.0036070601923916196, "phrase": "reliability_measurement_instrument"}, {"score": 0.0034892010527109024, "phrase": "theoretical_framework"}, {"score": 0.0031898025329389376, "phrase": "north_america"}, {"score": 0.0031581587465429593, "phrase": "measurement_model"}, {"score": 0.0030855348881460107, "phrase": "structural_equation_modeling"}, {"score": 0.00293547027122617, "phrase": "multi-dimensional_structure"}, {"score": 0.002887083738036996, "phrase": "proposed_theoretical_framework"}, {"score": 0.0027284410545226306, "phrase": "firm's_success"}, {"score": 0.0024693979425773993, "phrase": "appropriate_outcomes"}, {"score": 0.0024286751532861476, "phrase": "km_initiatives"}, {"score": 0.002364907617070299, "phrase": "starting_point"}, {"score": 0.002249811525923913, "phrase": "successful_km"}, {"score": 0.0022127018991294047, "phrase": "cognitive_infrastructure"}, {"score": 0.002190729937598138, "phrase": "simultaneous_adaptive_learning"}, {"score": 0.0021617722702730407, "phrase": "organizational_reliability_infrastructure"}, {"score": 0.002104999969751625, "phrase": "km"}], "paper_keywords": ["Knowledge management", " Organizational capability", " High reliability theory (HRT)", " Organizational mindfulness"], "paper_abstract": "Purpose - Although the topic of knowledge management (KM) failure has emerged over the past several years, no specific theory has been proposed about the ability of an organization to discover and manage unexpected failures in the organizational capabilities of KM. Thus, the main aim of this paper is to develop a theory of KM reliability by taking into account the availability of existing theory of high reliability for organizations. Furthermore, this study aims to empirically evaluate the impact of a reliable KM on organizational performance by developing a reliability measurement instrument. Design/methodology/approach - The study develops and tests a theoretical framework whereby the reliable KM is supported on its reliability aspects and organizational performance on its financial, process, and internal aspects. Based on a questionnaire, data were obtained from a sample of 254 companies in North America. The measurement model was tested and confirmed by using structural equation modeling (SEM). Findings - The results show that the reliable KM has a multi-dimensional structure as described by the proposed theoretical framework. Additionally, the results underscore the importance of KM reliability in creating conditions favorable for a firm's success. Practical implications - It was verified that the reliable KM affects the measures of organizational performance, including financial, process, and internal performance. This is useful for researchers and executives looking for appropriate outcomes through the implementation of KM initiatives. Furthermore, this study provides a starting point for further research on KM reliability. Originality/value - This study claims that a key to successful KM is to create a cognitive infrastructure that enables simultaneous adaptive learning and provides an organizational reliability infrastructure through the management of unwanted, unanticipated, and unexplainable failures in the KM's required capabilities.", "paper_title": "Knowledge management reliability and its impact on organizational performance An empirical study", "paper_id": "WOS:000342047500001"}