{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information_discovery"}, {"score": 0.0047555023078686386, "phrase": "digital_libraries"}, {"score": 0.004386503433248535, "phrase": "growing_number"}, {"score": 0.004173743791750695, "phrase": "large_fraction"}, {"score": 0.003971262520692664, "phrase": "structured_or_semi-structured_form"}, {"score": 0.003778566972399296, "phrase": "specific_knowledge"}, {"score": 0.0036857412768922827, "phrase": "structured_query_languages"}, {"score": 0.003115908199991072, "phrase": "precis_queries"}, {"score": 0.003077372515276563, "phrase": "free-form_queries"}, {"score": 0.002521623057264411, "phrase": "precis_query"}, {"score": 0.0022402661832994094, "phrase": "precis_query_answering_prototype_system"}, {"score": 0.0021580985506699105, "phrase": "short_factual_information_precis"}, {"score": 0.0021049977753042253, "phrase": "keyword_queries"}], "paper_keywords": [""], "paper_abstract": "Libraries, museums, and other organizations make their electronic contents available to a growing number of users on the Web. A large fraction of the information published is stored in structured or semi-structured form. However, most users have no specific knowledge of schemas or structured query languages for accessing information stored in (relational or XML) databases. Under these circumstances, the need for facilitating access to information stored in databases becomes increasingly more important. Precis queries are free-form queries that instead of simply locating and connecting values in tables, they also consider information around these values that may be related to them. Therefore, the answer to a precis query might also contain information found in other parts of the database. In this paper, we describe a precis query answering prototype system that generates personalized presentation of short factual information precis in response to keyword queries.", "paper_title": "An enhanced search interface for information discovery from digital libraries", "paper_id": "WOS:000241101500008"}