{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "word_order_structure"}, {"score": 0.014461444217164141, "phrase": "topic_model"}, {"score": 0.008616749750618338, "phrase": "document_classification"}, {"score": 0.007407213122025445, "phrase": "topic_models"}, {"score": 0.004727415330218277, "phrase": "document_retrieval_learning"}, {"score": 0.004707913053935566, "phrase": "retrieval_learning"}, {"score": 0.0043029342321223825, "phrase": "useful_side-information"}, {"score": 0.003823584649521733, "phrase": "supervised_topic_models"}, {"score": 0.003378385493203297, "phrase": "semantic_fabric"}, {"score": 0.0032296377835432533, "phrase": "low-dimensional_latent_topic_model"}, {"score": 0.003140004304719746, "phrase": "class_label_information_and_word_order_structure"}, {"score": 0.00305285084207725, "phrase": "supervised_topic_model"}, {"score": 0.0028373742057129126, "phrase": "collapsed_gibbs_sampler"}, {"score": 0.0023827927890399357, "phrase": "pointwise_model"}, {"score": 0.0023296961971785357, "phrase": "learning-to-rank_task"}, {"score": 0.0021288561076024844, "phrase": "extensive_experiments"}], "paper_keywords": ["Topic modeling", " Maximum-margin", " Document classification", " Learning-to-rank", " Structured topic model"], "paper_abstract": "One limitation of most existing probabilistic latent topic models for document classification is that the topic model itself does not consider useful side-information, namely, class labels of documents. Topic models, which in turn consider the side-information, popularly known as supervised topic models, do not consider the word order structure in documents. One of the motivations behind considering the word order structure is to capture the semantic fabric of the document. We investigate a low-dimensional latent topic model for document classification. Class label information and word order structure are integrated into a supervised topic model enabling a more effective interaction among such information for solving document classification. We derive a collapsed Gibbs sampler for our model. Likewise, supervised topic models with word order structure have not been explored in document retrieval learning. We propose a novel supervised topic model for document retrieval learning which can be regarded as a pointwise model for tackling the learning-to-rank task. Available relevance assessments and word order structure are integrated into the topic model itself. We conduct extensive experiments on several publicly available benchmark datasets, and show that our model improves upon the state-of-the-art models.", "paper_title": "Supervised topic models with word order structure for document classification and retrieval learning", "paper_id": "WOS:000356775500001"}