{"auto_keywords": [{"score": 0.04656595045799917, "phrase": "alpha-dense_curves"}, {"score": 0.007152368807539886, "phrase": "global_optimization"}, {"score": 0.005754770785085655, "phrase": "new_technique"}, {"score": 0.0052604635495503305, "phrase": "objective_function"}, {"score": 0.005224237564331307, "phrase": "feasible_set"}, {"score": 0.004603352344461032, "phrase": "new_form"}, {"score": 0.00425141240073214, "phrase": "basic_alpha-densification_technique"}, {"score": 0.004193000200816171, "phrase": "new_concept"}, {"score": 0.003994780550602818, "phrase": "global_optimization_problems"}, {"score": 0.003576060405460302, "phrase": "optimizer_points"}, {"score": 0.003490462324829042, "phrase": "parallelepiped_k"}, {"score": 0.0031789986177545586, "phrase": "new_step"}, {"score": 0.0030601947866320403, "phrase": "residual_subset"}, {"score": 0.0025206379415975083, "phrase": "quadratic_error"}, {"score": 0.002426378123762607, "phrase": "beta_probability_density_function"}, {"score": 0.0023356349192255074, "phrase": "forest_vegetation"}, {"score": 0.0022560827223539934, "phrase": "original_concept"}, {"score": 0.002164180792169302, "phrase": "multivariable_function"}, {"score": 0.0021049977753042253, "phrase": "new_application"}], "paper_keywords": ["Alpha-dense curves", " Sequence of alpha-dense curves with accumulated density", " Beta probability density function", " Global optimization"], "paper_abstract": "Purpose - In this article the aim is to propose a new form to densify parallelepipeds of R-N by sequences of alpha-dense curves with accumulated densities. Design/methodology/approach - This will be done by using a basic alpha-densification technique and adding the new concept of sequence of alpha-dense curves with accumulated density to improve the resolution of some global optimization problems. Findings - It is found that the new technique based on sequences of alpha-dense curves with accumulated densities allows to simplify considerably the process consisting on the exploration of the set of optimizer points of an objective function with feasible set a parallelepiped K of R-N. Indeed, since the sequence of the images of the curves of a sequence of alpha-dense curves with accumulated density is expansive, in each new step of the algorithm it is only necessary to explore a residual subset. On the other hand, since the sequence of their densities is decreasing and tends to zero, the convergence of the algorithm is assured. Practical implications - The results of this new technique of densification by sequences of alpha-dense curves with accumulated densities will be applied to densify the feasible set of an objective function which minimizes the quadratic error produced by the adjustment of a model based on a beta probability density function which is largely used in studies on the transition-time of forest vegetation. Originality/value - A sequence of alpha-dense curves with accumulated density represents an original concept to be added to the set of techniques to optimize a multivariable function by the reduction to only one variable as a new application of alpha-dense curves theory to the global optimization.", "paper_title": "Accumulated densification and applications to global optimization", "paper_id": "WOS:000304024000012"}