{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "emerging_economies"}, {"score": 0.027015990907594968, "phrase": "ict_innovation"}, {"score": 0.004718509350356246, "phrase": "existing_literature"}, {"score": 0.004639612079116459, "phrase": "future_research"}, {"score": 0.004500891637057374, "phrase": "country's_growth"}, {"score": 0.0042246679441555555, "phrase": "future_researchers"}, {"score": 0.004207230913063179, "phrase": "rapid_rate"}, {"score": 0.0037259041366068286, "phrase": "global_economy"}, {"score": 0.0030839447259626215, "phrase": "research_community"}, {"score": 0.002552309172078995, "phrase": "comprehensive_framework"}, {"score": 0.002535115422089855, "phrase": "existing_research"}, {"score": 0.002345500021653278, "phrase": "specific_guidelines"}, {"score": 0.0022984065518052476, "phrase": "research_model"}, {"score": 0.002275214783528274, "phrase": "salient_issues"}, {"score": 0.0021921581733031514, "phrase": "important_contribution"}, {"score": 0.0021049977753042253, "phrase": "useful_resource"}], "paper_keywords": ["ICT innovation", " emerging economies", " literature review"], "paper_abstract": "ICT innovation is known to significantly elevate a country's growth and to enhance productivity. It is now well-acknowledged that emerging economies are beginning to innovate at a rapid rate despite some of the challenges they face. Given that these countries with such economies now comprise a third of the world's largest 25 economies, and that they are likely to be critical for the success of a global economy, it is important to understand how these economies innovate, what factors affect innovation in such nations, and what are the impacts. However, to the best of our knowledge, little research till date has been conducted on this topic, and the few existing studies have failed to catch the attention of the mainstream IS research community. We believe that the absence of studies is primarily due to a lack of understanding of what has been found with respect to ICT innovation in emerging economies, what needs to be studied, and how they should be studied. We attempt to contribute in this area by: (1) providing a comprehensive framework of existing research on ICT innovation in emerging economies, (2) highlighting the gaps that have been left behind, and (3) providing specific guidelines to future researchers, including a research model summarizing the salient issues that need examination. We believe that our study makes an important contribution to research on ICT innovation in emerging economies, and can be a useful resource for future researchers interested in this topic.", "paper_title": "ICT innovation in emerging economies: a review of the existing literature and a framework for future research", "paper_id": "WOS:000327910800002"}