{"auto_keywords": [{"score": 0.04763792342464261, "phrase": "particle_filter"}, {"score": 0.0450388890113316, "phrase": "-only_simultaneous_localization"}, {"score": 0.04284255553021721, "phrase": "mobile_robot"}, {"score": 0.042045601896143696, "phrase": "unstructured_indoor_environment"}, {"score": 0.03875314268879881, "phrase": "genetic_algorithm"}, {"score": 0.03827782610127833, "phrase": "ga"}, {"score": 0.03731832993852691, "phrase": "standard_pf_procedures"}, {"score": 0.03593465438110082, "phrase": "sample_impoverishment_problem"}, {"score": 0.0352614670276214, "phrase": "monochrome_ccd_camera"}, {"score": 0.03331404846245632, "phrase": "measuring_device"}, {"score": 0.03207389561990725, "phrase": "image_quality"}, {"score": 0.031272049250244835, "phrase": "data_association"}, {"score": 0.030878434195440844, "phrase": "pf_update"}, {"score": 0.028981251251504137, "phrase": "range_information"}, {"score": 0.02807555022297119, "phrase": "pseudo_range"}, {"score": 0.027197360727326564, "phrase": "landmark_initialization"}, {"score": 0.02668332444150669, "phrase": "hypothesised_pair"}, {"score": 0.026178742110365947, "phrase": "non-promising_landmark"}, {"score": 0.025358335843562514, "phrase": "map_management_strategy"}, {"score": 0.02503723172060503, "phrase": "simulation_and_experimental_results"}, {"score": 0.0242517079529136, "phrase": "real-life_data"}, {"score": 0.02364063980170435, "phrase": "pioneer_robot"}, {"score": 0.00481495049065317, "phrase": "simultaneous_localization"}], "paper_keywords": ["particle filter", " sample impoverishment", " SLAM", " vision"], "paper_abstract": "The implementation of a particle filter (PF) for vision-based bearing-only simultaneous localization and mapping (SLAM) of a mobile robot in an unstructured indoor environment is presented in this paper. Variations, using techniques from the genetic algorithm (GA), to standard PF procedures are proposed to alleviate the sample impoverishment problem. A monochrome CCD camera mounted on the robot is used as the measuring device and a measure on the image quality is incorporated into data association and PF update. Since the bearing-only measurement does not contain range information, we add a pseudo range to the measurement during landmark initialization as a hypothesised pair and the non-promising landmark is removed by a map management strategy. Simulation and experimental results from an implementation using real-life data acquired from a Pioneer robot are included to demonstrate the effectiveness of our approach. The implementation of a particle filter (PF) for vision-based bearing-only simultaneous localization and mapping (SLAM) of a mobile robot in an unstructured indoor environment is presented in this paper. Variations, using techniques from the genetic algorithm (GA), to standard PF procedures are proposed to alleviate the sample impoverishment problem. A monochrome CCD camera mounted on the robot is used as the measuring device and a measure on the image quality is incorporated into data association and PF update. Since the bearing-only measurement does not contain range information, we add a pseudo range to the measurement during landmark initialization as a hypothesised pair and the non-promising landmark is removed by a map management strategy. Simulation and experimental results from an implementation using real-life data acquired from a Pioneer robot are included to demonstrate the effectiveness of our approach.", "paper_title": "A modified particle filter for simultaneous localization and mapping", "paper_id": "WOS:000240553200003"}