{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "journal_impact_factor"}, {"score": 0.041135101798746534, "phrase": "scientific_publications"}, {"score": 0.029859418919869096, "phrase": "impact_factor"}, {"score": 0.004296264970612285, "phrase": "research_evaluation"}, {"score": 0.003725470458263889, "phrase": "single_scientists"}, {"score": 0.003683213029483699, "phrase": "research_groups"}, {"score": 0.003641433168173135, "phrase": "entire_organizations"}, {"score": 0.0032302647179383915, "phrase": "easily_available_and_relatively_simple_proxies"}, {"score": 0.0031037644581516973, "phrase": "present_work"}, {"score": 0.0022933216359142736, "phrase": "hard_sciences"}, {"score": 0.0022672718785099666, "phrase": "italian_universities"}, {"score": 0.002153653728048424, "phrase": "performance_sensitivity_analyses"}, {"score": 0.0021049977753042253, "phrase": "changing_indicators"}], "paper_keywords": ["Research assessment", " Bibliometrics", " Citations", " Impact factor", " University"], "paper_abstract": "In recent years bibliometricians have paid increasing attention to research evaluation methodological problems, among these being the choice of the most appropriate indicators for evaluating quality of scientific publications, and thus for evaluating the work of single scientists, research groups and entire organizations. Much literature has been devoted to analyzing the robustness of various indicators, and many works warn against the risks of using easily available and relatively simple proxies, such as journal impact factor. The present work continues this line of research, examining whether it is valid that the use of the impact factor should always be avoided in favour of citations, or whether the use of impact factor could be acceptable, even preferable, in certain circumstances. The evaluation was conducted by observing all scientific publications in the hard sciences by Italian universities, for the period 2004-2007. Performance sensitivity analyses were conducted with changing indicators of quality and years of observation.", "paper_title": "Citations versus journal impact factor as proxy of quality: could the latter ever be preferable?", "paper_id": "WOS:000280274400019"}