{"auto_keywords": [{"score": 0.03850376184652666, "phrase": "service_innovation_process"}, {"score": 0.013944789098735906, "phrase": "complementary_resources"}, {"score": 0.013030538387937001, "phrase": "service_innovation_success_rate"}, {"score": 0.00481495049065317, "phrase": "benchmark_significance"}, {"score": 0.004640808212832262, "phrase": "on-site_observation"}, {"score": 0.004068510313497539, "phrase": "service_innovation"}, {"score": 0.0035106041824568618, "phrase": "systematic_service_innovation_methodologies"}, {"score": 0.003437387719239532, "phrase": "clear_steps"}, {"score": 0.003312901888725435, "phrase": "target_groups"}, {"score": 0.0032609360162842767, "phrase": "service_design"}, {"score": 0.0030772505522663612, "phrase": "insufficient_resources"}, {"score": 0.00291923164591297, "phrase": "relevant_resources"}, {"score": 0.0025994945418484935, "phrase": "key_issues"}, {"score": 0.002219040041886641, "phrase": "innovators'_chance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Innovation policy", " Service innovation", " Complementary assets"], "paper_abstract": "This study focuses on a project with benchmark significance in the Taiwan government's Web 2.0 plan, and employs on-site observation and in-depth interviews to explore how the government uses policies to help innovators obtain complementary resources, and thereby speed up the pace of service innovation and enhance the service innovation success rate. The results of this study indicate that the government can successfully intervene in the service innovation process. First, the government can develop systematic service innovation methodologies providing innovators with clear steps and principles to follow when determining target groups and performing service design and verification. Second, because most innovators are limited by insufficient resources and it is usually difficult for innovators to obtain relevant resources during the service innovation process, the service innovation success rate is quite low. With an eye on this, the government should actively clarify key issues that may be faced by innovators during each stage of the service innovation process, and can use various policy tools to provide innovators with the complementary resources needed at each stage, increasing innovators' chance of success. (C) 2010 Published by Elsevier Ltd.", "paper_title": "Overcoming service innovation bottlenecks using Web 2.0", "paper_id": "WOS:000281103600009"}