{"auto_keywords": [{"score": 0.046715451859165, "phrase": "local_verification"}, {"score": 0.00481495049065317, "phrase": "labeling_schemes"}, {"score": 0.004658426838467567, "phrase": "global_properties"}, {"score": 0.004218602458288531, "phrase": "suitable_model"}, {"score": 0.003832801887709817, "phrase": "proof_labeling_scheme"}, {"score": 0.0035755653799043, "phrase": "global_property"}, {"score": 0.0034363735647539267, "phrase": "efficient_construction"}, {"score": 0.0033576858946833587, "phrase": "lower_bounds"}, {"score": 0.0033025823350563087, "phrase": "bit_complexity"}, {"score": 0.0032591491777773035, "phrase": "multiple_basic_problems"}, {"score": 0.0031426214970263137, "phrase": "unique_identities"}, {"score": 0.003020232503089429, "phrase": "proof_labeling_schemes"}, {"score": 0.0030003014343035965, "phrase": "previous_studies"}, {"score": 0.0029805015010906013, "phrase": "related_questions"}, {"score": 0.002951045605925464, "phrase": "distributed_algorithms"}, {"score": 0.0027619548979328154, "phrase": "combined_approach"}, {"score": 0.0025090323307618632, "phrase": "configuration_design"}, {"score": 0.0024112587007106535, "phrase": "desired_configuration"}, {"score": 0.002271679416337276, "phrase": "suitable_verification_scheme"}, {"score": 0.0021049977753042253, "phrase": "original_design"}], "paper_keywords": ["Distributed networks", " Proof labels", " Property verification", " Self stabilization"], "paper_abstract": "This paper addresses the problem of locally verifying global properties. Several natural questions are studied, such as \"how expensive is local verification?\" and more specifically, \"how expensive is local verification compared to computation?\" A suitable model is introduced in which these questions are studied in terms of the number of bits a vertex needs to communicate. The model includes the definition of a proof labeling scheme (a pair of algorithms- one to assign the labels, and one to use them to verify that the global property holds). In addition, approaches are presented for the efficient construction of schemes, and upper and lower bounds are established on the bit complexity of schemes for multiple basic problems. The paper also studies the role and cost of unique identities in terms of impossibility and complexity, in the context of proof labeling schemes. Previous studies on related questions deal with distributed algorithms that simultaneously compute a configuration and verify that this configuration has a certain desired property. It turns out that this combined approach enables the verification to be less costly sometimes, since the configuration is typically generated so as to be easily verifiable. In contrast, our approach separates the configuration design from the verification. That is, it first generates the desired configuration without bothering with the need to verify it, and then handles the task of constructing a suitable verification scheme. Our approach thus allows for a more modular design of algorithms, and has the potential to aid in verifying properties even when the original design of the structures for maintaining them was done without verification in mind.", "paper_title": "Proof labeling schemes", "paper_id": "WOS:000277023500001"}