{"auto_keywords": [{"score": 0.04822326719339386, "phrase": "ccn"}, {"score": 0.004816080792381199, "phrase": "impact"}, {"score": 0.004661775069083667, "phrase": "content_centric_networking"}, {"score": 0.004546000131069232, "phrase": "great_deal"}, {"score": 0.004230749292148046, "phrase": "content_name"}, {"score": 0.004155399041702324, "phrase": "host_ip_address"}, {"score": 0.004110831924517065, "phrase": "cache_memory"}, {"score": 0.003690527690610707, "phrase": "interest_packets"}, {"score": 0.003521961918342562, "phrase": "isp_networks"}, {"score": 0.003459191419478298, "phrase": "traffic_exchanges"}, {"score": 0.003373181367365139, "phrase": "customer_isps"}, {"score": 0.0033249931673591457, "phrase": "transit_fee"}, {"score": 0.0033011569787033297, "phrase": "transit_isps"}, {"score": 0.003253994336864267, "phrase": "traffic_volume"}, {"score": 0.0032075033252058835, "phrase": "transit_links"}, {"score": 0.0028076592725295646, "phrase": "isp_profit"}, {"score": 0.0025476254812544135, "phrase": "hierarchical_topology"}, {"score": 0.002143247921132179, "phrase": "cache_capacity"}, {"score": 0.0021049977753042253, "phrase": "content_popularity_increases"}], "paper_keywords": ["CCN", " ISP", " economics"], "paper_abstract": "Content centric networking (CCN) has attracted a great deal of attention as a network that can efficiently deliver content. In CCN, content is delivered using the content name, instead of the host IP address, from cache memory implemented at routers. The nodes sending content are not explicitly indicated, and content is delivered from routers that have copies of content on the routes where the Interest packets are transmitted. Therefore, as a result of introducing CCN in ISP networks, the pattern of traffic exchanges among ISPs will change considerably. Customer ISPs normally pay a transit fee to transit ISPs based on the traffic volume transmitted on the transit links. Therefore, the introduction of CCN by ISPs will affect the profit of ISPs. CCN is introduced and operated by ISPs based on their business judgment, so it is important to estimate how CCN affects ISP profit to investigate the likelihood of CCN spreading among many ISPs. In this paper, we formalize the profit of ISPs when implementing CCN, assuming a hierarchical topology of ISPs in three levels and show that introducing CCN increases the profit of layer 2 and 3 ISPs, whereas introducing CCN decreases the profit of layer 1 ISPs. We also clarify that the effect of introducing CCN for the profit of ISPs is more remarkable as the cache capacity or the bias of content popularity increases.", "paper_title": "Analyzing Impact of Introducing CCN on Profit of ISPs", "paper_id": "WOS:000357529700006"}