{"auto_keywords": [{"score": 0.03889571019423314, "phrase": "semrex"}, {"score": 0.00481495049065317, "phrase": "semantic_metadata_models"}, {"score": 0.0038624981944755813, "phrase": "semantic_web_technologies"}, {"score": 0.0038154673253945003, "phrase": "knowledge_sharing"}, {"score": 0.0037459885494311217, "phrase": "new_trend"}, {"score": 0.0033548062793973144, "phrase": "heterogeneous_literature_formats"}, {"score": 0.003253560798692431, "phrase": "shared_understanding"}, {"score": 0.003213920601037463, "phrase": "publications_knowledge"}, {"score": 0.002913650880082273, "phrase": "semantic_knowledge_models"}, {"score": 0.0027403605798830984, "phrase": "metadata_models"}, {"score": 0.0025615908073796027, "phrase": "semantic_information"}, {"score": 0.002453934333239467, "phrase": "flexible_description"}, {"score": 0.002157302200451323, "phrase": "semrex_environment"}], "paper_keywords": [""], "paper_abstract": "Peer-to-Peer (P2P) systems are a new paradigm for information sharing and some systems have successfully been deployed. It has been argued that current P2P systems suffer from the lack of semantics. Therefore combining P2P solutions with Semantic Web technologies for knowledge sharing become a new trend. SemreX is a P2P based semantic-enabled knowledge management system for sharing references metadata. In SemreX, we need to handle heterogeneous literature formats, and present a shared understanding about publications knowledge. Meanwhile, peers in SemreX require some compromises with respect to the use of semantic knowledge models for self-description. In this paper, we propose metadata models that combine features of ontology, for encoding and aligning semantic information from references, and for a flexible description of knowledge located in a peer. We describe these models and discuss the roles of the models in the SemreX environment as well as their creations and applications.", "paper_title": "Semantic metadata models in references sharing and retrieval system SemreX", "paper_id": "WOS:000237540300043"}