{"auto_keywords": [{"score": 0.049823295383808835, "phrase": "earliest_deadline"}, {"score": 0.02768765667920818, "phrase": "edf"}, {"score": 0.00481495049065317, "phrase": "group_priority"}, {"score": 0.00451659023910662, "phrase": "priority_levels"}, {"score": 0.003727527379253624, "phrase": "novel_group_priority_earliest_deadline"}, {"score": 0.0035338315037521657, "phrase": "schedulability_test"}, {"score": 0.003422462630994095, "phrase": "job_group"}, {"score": 0.0029789104204803137, "phrase": "shortest_job"}, {"score": 0.0023802825369325354, "phrase": "simulation_results"}, {"score": 0.00232995025271599, "phrase": "new_algorithm"}, {"score": 0.0022928991183989115, "phrase": "least_switching"}, {"score": 0.0021735890994119757, "phrase": "fewest_required_priority_levels"}, {"score": 0.0021049977753042253, "phrase": "higher_success_ratio"}], "paper_keywords": ["real-time system", " group priority", " success ratio", " switching"], "paper_abstract": "In most priority scheduling algorithms, the number of priority levels is assumed to be unlimited. However, if a task set requires more priority levels than the system can support, several jobs must in practice be assigned the same priority level. To solve this problem, a novel group priority earliest deadline first (GPEDF) scheduling algorithm is presented. In this algorithm, a schedulability test is given to form a job group, in which the jobs can arbitrarily change their order without reducing the schedulability. We consider jobs in the group having the same priority level and use shortest job first (SJF) to schedule the jobs in the group to improve the performance of the system. Compared with earliest deadline first (EDF), best effort (BE), and group-EDF (gEDF), simulation results show that the new algorithm exhibits the least switching, the shortest average response time, and the fewest required priority levels. It also has a higher success ratio than both EDF and gEDF.", "paper_title": "A group priority earliest deadline first scheduling algorithm", "paper_id": "WOS:000309721200007"}