{"auto_keywords": [{"score": 0.037989064425371935, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "one-to-many_data_linkage"}, {"score": 0.004579147045265106, "phrase": "prior_publications"}, {"score": 0.004374772264092067, "phrase": "data_linkage"}, {"score": 0.004085115444878828, "phrase": "linkage_techniques"}, {"score": 0.0040111533608228195, "phrase": "matching_entities"}, {"score": 0.003974673997871831, "phrase": "different_types"}, {"score": 0.0037798652680135106, "phrase": "new_one-to-many_data_linkage_method"}, {"score": 0.0035294580355761506, "phrase": "one-class_clustering_tree"}, {"score": 0.003105428650735113, "phrase": "association_rules"}, {"score": 0.0030352396244492604, "phrase": "inner_nodes"}, {"score": 0.0029396242707327986, "phrase": "first_set"}, {"score": 0.0027322025124213566, "phrase": "second_data_set"}, {"score": 0.0025627194819793347, "phrase": "occt."}, {"score": 0.002493333098814506, "phrase": "data_sets"}, {"score": 0.0023173287402646577, "phrase": "occt"}, {"score": 0.0022962183207691188, "phrase": "better_performance"}], "paper_keywords": ["Clustering", " classification", " data matching", " decision tree induction"], "paper_abstract": "One-to-many data linkage is an essential task in many domains, yet only a handful of prior publications have addressed this issue. Furthermore, while traditionally data linkage is performed among entities of the same type, it is extremely necessary to develop linkage techniques that link between matching entities of different types as well. In this paper, we propose a new one-to-many data linkage method that links between entities of different natures. The proposed method is based on a one-class clustering tree (OCCT) that characterizes the entities that should be linked together. The tree is built such that it is easy to understand and transform into association rules, i.e., the inner nodes consist only of features describing the first set of entities, while the leaves of the tree represent features of their matching entities from the second data set. We propose four splitting criteria and two different pruning methods which can be used for inducing the OCCT. The method was evaluated using data sets from three different domains. The results affirm the effectiveness of the proposed method and show that the OCCT yields better performance in terms of precision and recall (in most cases it is statistically significant) when compared to a C4.5 decision tree-based linkage method.", "paper_title": "OCCT: A One-Class Clustering Tree for Implementing One-to-Many Data Linkage", "paper_id": "WOS:000333532100013"}