{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_networks"}, {"score": 0.010009990277475227, "phrase": "iterated_game"}, {"score": 0.0044469055125323466, "phrase": "distributed_network"}, {"score": 0.004401011982385274, "phrase": "multiple_round_game"}, {"score": 0.003953534569134559, "phrase": "interaction_model"}, {"score": 0.0036008989464331835, "phrase": "prototypical_model"}, {"score": 0.003551392586900308, "phrase": "selfish_individuals"}, {"score": 0.0031461489526079236, "phrase": "experimental_results"}, {"score": 0.003102875178186416, "phrase": "current_literature"}, {"score": 0.0028852371404397862, "phrase": "self-adaptive_strategy"}, {"score": 0.0026828233195176155, "phrase": "existing_strategies"}, {"score": 0.0026185499482623, "phrase": "theoretical_finding"}, {"score": 0.0025914765323897604, "phrase": "final_proportion"}, {"score": 0.002401286805515306, "phrase": "initial_proportion"}], "paper_keywords": ["Evolution of cooperation", " self-adaptation", " distributed networks"], "paper_abstract": "This paper studies the phenomenon of the evolution of cooperation in distributed networks by using an iterated game. An iterated game in a distributed network is a multiple round game, where in each round, a player gains a payoff by playing a game with its neighbours and updates its action based on the actions and/or payoffs of its neighbours. The interaction model between players is usually represented as a two-player, two-action (namely cooperation and defection) Prisoner's Dilemma game (which is a prototypical model for interaction between selfish individuals). Many researchers have developed strategies (also called update rules) for the evolution of cooperation in distributed networks in order to enhance cooperation, i.e., to increase the proportion of cooperators. Experimental results reported in the current literature, however, have demonstrated that each of these strategies has both advantages and disadvantages. In this paper, a self-adaptive strategy is proposed for the evolution of cooperation in distributed networks, which can utilise the strengths and avoid the limitations of existing strategies. Moreover, we have a theoretical finding about the final proportion of cooperators, evolved by any pure (or deterministic) strategies, in four types of a game. This finding is independent of the initial proportion of cooperators, the topology of the network (e.g., a small-world network or a scale-free network), and the specific game (e.g., the Prisoner's Dilemma game or the Snow Drift game).", "paper_title": "A Self-Adaptive Strategy for Evolution of Cooperation in Distributed Networks", "paper_id": "WOS:000351458800002"}