{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spectrum"}, {"score": 0.004744437370338926, "phrase": "wireless_networks"}, {"score": 0.004299910946753963, "phrase": "schedule_transmissions"}, {"score": 0.003802135020791801, "phrase": "random_access_protocol"}, {"score": 0.0036914757355166966, "phrase": "access_probability"}, {"score": 0.003428665921276366, "phrase": "nash_equilibrium_behavior"}, {"score": 0.0028574164693918433, "phrase": "path_loss_exponent_alpha"}, {"score": 0.0028154895878702633, "phrase": "latter_regime"}, {"score": 0.0025892330566358503, "phrase": "rival_wireless_networks"}, {"score": 0.002323142666222693, "phrase": "greedy_manner"}, {"score": 0.002255431275670053, "phrase": "distributed_scheduling_protocol"}, {"score": 0.0022223176391038785, "phrase": "carrier_sensing"}, {"score": 0.0021049977753042253, "phrase": "sufficiently_large_alpha"}], "paper_keywords": ["Carrier sensing", " game theory", " Nash equilibrium (NE)", " price of anarchy", " random access", " spectrum sharing", " wireless ad hoc networks"], "paper_abstract": "We consider the problem of two wireless networks operating on the same (presumably unlicensed) frequency band. Pairs within a given network cooperate to schedule transmissions, but between networks there is competition for spectrum. To make the problem tractable, we assume transmissions are scheduled according to a random access protocol where each network chooses an access probability for its users. A game between the two networks is defined. We characterize the Nash Equilibrium behavior of the system. Three regimes are identified: one in which both networks simultaneously schedule all transmissions, one in which the denser network schedules all transmissions and the sparser only schedules a fraction, and one in which both networks schedule only a fraction of their transmissions. The regime of operation depends on the path loss exponent alpha, the latter regime being desirable but attainable only for alpha > 4. This suggests that in certain environments, rival wireless networks may end up naturally cooperating. To substantiate our analytical results, we simulate a system where networks iteratively optimize their access probabilities in a greedy manner. We also discuss a distributed scheduling protocol that employs carrier sensing and demonstrate via simulations that again a near cooperative equilibrium exists for sufficiently large alpha.", "paper_title": "Spectrum Sharing Between Wireless Networks", "paper_id": "WOS:000283446200005"}