{"auto_keywords": [{"score": 0.03766717374009015, "phrase": "design_principles"}, {"score": 0.03317679677856877, "phrase": "synergy"}, {"score": 0.00481495049065317, "phrase": "socio-technical_lifelogging"}, {"score": 0.004760394308239882, "phrase": "deriving_design_principles"}, {"score": 0.00447115003744675, "phrase": "technically_inspired_approach"}, {"score": 0.003966667994579941, "phrase": "lifelogging_systems"}, {"score": 0.0035189057079817285, "phrase": "digital_systems"}, {"score": 0.0034004869983267085, "phrase": "multiple_studies"}, {"score": 0.002527150892127982, "phrase": "new_classes"}, {"score": 0.0024984517279573906, "phrase": "lifelogging_system"}, {"score": 0.002414290278501595, "phrase": "strategic_guidance"}, {"score": 0.00224151735457093, "phrase": "selection_and_embodiment_principles"}, {"score": 0.0021049977753042253, "phrase": "reminiscence_principles"}], "paper_keywords": [""], "paper_abstract": "Lifelogging is a technically inspired approach that attempts to address the problem of human forgetting by developing systems that \"record everything.\" Uptake of lifelogging systems has generally been disappointing, however. One reason for this lack of uptake is the absence of design principles for developing digital systems to support memory. Synthesizing multiple studies, we identify and evaluate 4 new empirically motivated design principles for lifelogging: Selectivity, Embodiment, Synergy, and Reminiscence. We first summarize four empirical studies that motivate the principles, then describe the evaluation of four novel systems built to embody these principles. We show that design principles were generative, leading to the development of new classes of lifelogging system, as well as providing strategic guidance about how those systems should be built. Evaluations suggest support for Selection and Embodiment principles, but more conceptual and technical work is needed to refine the Synergy and Reminiscence principles.", "paper_title": "Socio-Technical Lifelogging: Deriving Design Principles for a Future Proof Digital Past", "paper_id": "WOS:000304010300003"}