{"auto_keywords": [{"score": 0.0423930708228813, "phrase": "physico-chemical_properties"}, {"score": 0.00481495049065317, "phrase": "qsbmr_-_quantitative"}, {"score": 0.004752362132726821, "phrase": "structural_descriptors"}, {"score": 0.004501578643090429, "phrase": "baltic_sea_biota"}, {"score": 0.004451360793577698, "phrase": "quantitative_model"}, {"score": 0.004344460602333245, "phrase": "biomagnification_factors"}, {"score": 0.004263972370406983, "phrase": "brominated_flame"}, {"score": 0.0041693441718721755, "phrase": "polybrominated_diphenylethers"}, {"score": 0.003861534816807933, "phrase": "baltic_sea"}, {"score": 0.0037899595175206143, "phrase": "randomly_sampled_ratios"}, {"score": 0.0034578967977441904, "phrase": "log_k-ow_values"}, {"score": 0.0033937776228549557, "phrase": "binary_fingerprint_variables"}, {"score": 0.003318396860938148, "phrase": "respective_pcb_and_pbde_molecules"}, {"score": 0.003281357070434894, "phrase": "pls"}, {"score": 0.003214455466823939, "phrase": "contaminants'_bmf"}, {"score": 0.0031726052266905043, "phrase": "qsbmr"}, {"score": 0.00252930673503721, "phrase": "seven_contaminants"}, {"score": 0.002510424048850241, "phrase": "multivariate_design"}, {"score": 0.002413572881798075, "phrase": "test_set"}, {"score": 0.002342291313382633, "phrase": "observed_bmf"}, {"score": 0.002333530083198615, "phrase": "predicted_bmf"}, {"score": 0.002298810896354801, "phrase": "good_models"}, {"score": 0.0022603984511506406, "phrase": "ocs"}, {"score": 0.002251911996999611, "phrase": "bfrs"}, {"score": 0.002193600680263771, "phrase": "silico_predictions"}, {"score": 0.002132795201034731, "phrase": "risk_assessments"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Biomagnification", " preditictive models", " Risk assessment", " persistent organic pollutants"], "paper_abstract": "The aim of this project is to establish models to predict the biomagnification of contaminants present in Baltic Sea biota. In this paper a quantitative model that we term QSBMR-Quantitative Structure Biomagnification Relationships is presented. This model describes the relationship between the biomagnification factors (BMFs) for several organochlorines (OCs) and brominated flame retardants (BFRs), for example, polychlorinated biphenyls (PCBs), polybrominated diphenylethers (PBDEs) and hexabromocyclododecane (FHCD), and their descriptors, for example, physico-chemical properties and structural descriptors. The concentrations of contaminants in herring (Clupea harengus) muscle and guillemot (Uria aalge) egg from the Baltic Sea were used. The BMFs were calculated with the randomly sampled ratios (RSR) method that denotes the BMFs with a measure of the variation. In order to describe the physico-chemical properties and chemical structures, approximately 100 descriptors for the contaminants were generated: (a), by using the software (TSAR); (b) finding log K-ow values from the literature, and (c) creating binary fingerprint variables that described the position of the chlorine and bromine for the respective PCB and PBDE molecules. Partial least squares (PLS) regression was used to model the relationship between the contaminants' BMF and the descriptors and the resulting QSBMR revealed that more than 20 descriptors in combination were important for the biomagnification of OCs and BFRs between herring and guillemot. The model including all contaminants ((RX)-X-2 = 0.73, (RY)-Y-2 = 0.87 and Q(2) = 0.63, three components) explained approximately as much of the variation as the model with the PCBs alone ((RX)-X-2 = 0.83, (RY)-Y-2 = 0.87 and Q(2) = 0.58, two components). The model with the BFRs alone ((RX)-X-2 = 0.68, (RY)-Y-2 = 0.88 and Q(2) = 0.41, two components) had a slightly lower Q(2) than the model including all contaminants. For validation, a training set of seven contaminants was selected by multivariate design (MVD) and a model was established. This model was then used to predict the BMFs of the test set (seven contaminants not included in the model). The resulting R-2 for the regression Observed BMF versus Predicted BMF was high (0.65). The good models showed that descriptors important for the biomagnification of OCs and BFRs had been used. These types of models will be useful for in silico predictions of the biomagnification of new, not yet investigated, compounds as an aid in risk assessments. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "QSBMR - Quantitative structure biomagnification relationships: Physicochemical and structural descriptors important for the biomagnification of organochlorines and brominated flame retardants", "paper_id": "WOS:000247019400009"}