{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tasks_applications"}, {"score": 0.004767546015485477, "phrase": "large-scale_platforms"}, {"score": 0.0046741260449047976, "phrase": "distributed_computing_platforms"}, {"score": 0.0045599093158915326, "phrase": "fair_share"}, {"score": 0.003815607281455725, "phrase": "shared_platform"}, {"score": 0.0035249212996297332, "phrase": "decentralized_scheduling_policy"}, {"score": 0.003455765987713262, "phrase": "maximum_stretch"}, {"score": 0.003421697038352743, "phrase": "user-submitted_applications"}, {"score": 0.0032563083791198534, "phrase": "existing_system_traces"}, {"score": 0.0029637093924781825, "phrase": "centralized_design"}, {"score": 0.002710735995572145, "phrase": "centralized_implementation"}, {"score": 0.0023710856920150574, "phrase": "minimal_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fairness", " Large-scale", " Task scheduling"], "paper_abstract": "Users of distributed computing platforms want to obtain a fair share of the resources they use. With respect to the amount of computation, the most suitable measure of fairness is the stretch. It describes the slowdown that the applications suffer for being executed in a shared platform, in contrast to being executed alone. In this paper, we present a decentralized scheduling policy that minimizes the maximum stretch among user-submitted applications. With two reasonable assumptions, that can be deduced from existing system traces, we are able to minimize the stretch using only local information. In this way, we avoid a centralized design and provide scalability and fault tolerance. As a result, our policy performs just 11% worse than a centralized implementation, and largely outperforms other common policies. Additionally, it easily scales to hundreds of thousands of nodes. We presume that it can scale to millions with a minimal overhead. Finally, we also show that preemption is crucial to provide fairness in any case. (C) 2015 Published by Elsevier B.V.", "paper_title": "Fair scheduling of bag-of-tasks applications on large-scale platforms", "paper_id": "WOS:000355062700003"}