{"auto_keywords": [{"score": 0.04206676320027998, "phrase": "high_performance"}, {"score": 0.02591362401088973, "phrase": "enormous_computing_capability"}, {"score": 0.00481495049065317, "phrase": "unstructured_peer-to-peer-based_high_performance_computing_system"}, {"score": 0.004477083974172596, "phrase": "idle_intemet_cycles"}, {"score": 0.00422826362023938, "phrase": "scheduling_issues"}, {"score": 0.003870541730075597, "phrase": "new_application_model"}, {"score": 0.0036174746598098863, "phrase": "program_level"}, {"score": 0.003434085751246066, "phrase": "system_resources"}, {"score": 0.0031107911390188055, "phrase": "job_scheduling_strategy"}, {"score": 0.002983916676307492, "phrase": "global_and_domain_scheduling"}, {"score": 0.0029376803941247084, "phrase": "global_scheduling"}, {"score": 0.002194614077950366, "phrase": "hpc"}, {"score": 0.0021049977753042253, "phrase": "hpc_applications"}], "paper_keywords": ["Production scheduling", " Resource management", " Internet", " Computer applications", " Peer-to-Peer", " High performance computing", " Scheduling"], "paper_abstract": "Purpose - Peer-to-peer (P2P) communities have the capability to construct a powerful virtual supercomputer by assembling idle intemet cycles. The purpose of this paper is to present the scheduling issues in an unstructured P2P-based high performance computing (HPC) system to achieve high performance for applications. Design/methodology/approach - A new application model is proposed for the system, where applications are parallelized in the program level. To address high performance for these applications, the system resources are controlled in a semi-centralized 3-layer network, where volunteers form many autonomous unstructured P2P domains. Furthermore, based on such a resource management policy, a job scheduling strategy is adopted, which is collaborated by global and domain scheduling. The global scheduling is responsible for the balance among domains, while the domain scheduling resolve workpiles' execution in a domain. Findings - Theoretical analysis and a benchmark experiment show that the scheduling provides scalable and enormous computing capability in the P2P-based HPC system. Originality/value - The paper shows that scheduling helps P2HP (an unstructured P2P-based HPC system) provide scalable and enormous computing capability for HPC applications.", "paper_title": "Scheduling in an unstructured peer-to-peer-based high performance computing system", "paper_id": "WOS:000312434000007"}