{"auto_keywords": [{"score": 0.0494096760831155, "phrase": "spatial_networks"}, {"score": 0.010612387000973441, "phrase": "euclidean_space"}, {"score": 0.00939910527788276, "phrase": "existing_techniques"}, {"score": 0.006837789186990492, "phrase": "computation_cost"}, {"score": 0.006524817736641803, "phrase": "communication_cost"}, {"score": 0.004508661664944657, "phrase": "continuous_monitoring"}, {"score": 0.004466519142879166, "phrase": "reverse_k_nearest_neighbors_queries"}, {"score": 0.004425145226299445, "phrase": "euclidean"}, {"score": 0.003666776809252461, "phrase": "continuous_reverse_k_nearest_neighbor"}, {"score": 0.0034494494982242187, "phrase": "safe_region"}, {"score": 0.0033851984021896287, "phrase": "expensive_recomputation"}, {"score": 0.0029260602766930065, "phrase": "client-server_architectures"}, {"score": 0.0026633568650501873, "phrase": "location_update_request"}, {"score": 0.0025892330566358503, "phrase": "rigid_cost_analysis"}, {"score": 0.0024014759148123736, "phrase": "bichromatic_rknn_queries"}, {"score": 0.0021349310877334378, "phrase": "directed_graphs"}, {"score": 0.0021049977753042253, "phrase": "extensive_experiments"}], "paper_keywords": ["Spatial queries", " Continuous queries", " Spatial networks", " Continuous monitoring", " Reverse nearest neighbors"], "paper_abstract": "In this paper, we study the problem of continuous monitoring of reverse k nearest neighbors queries in Euclidean space as well as in spatial networks. Existing techniques are sensitive toward objects and queries movement. For example, the results of a query are to be recomputed whenever the query changes its location. We present a framework for continuous reverse k nearest neighbor (RkNN) queries by assigning each object and query with a safe region such that the expensive recomputation is not required as long as the query and objects remain in their respective safe regions. This significantly improves the computation cost. As a byproduct, our framework also reduces the communication cost in client-server architectures because an object does not report its location to the server unless it leaves its safe region or the server sends a location update request. We also conduct a rigid cost analysis for our Euclidean space RkNN algorithm. We show that our techniques can also be applied to answer bichromatic RkNN queries in Euclidean space as well as in spatial networks. Furthermore, we show that our techniques can be extended for the spatial networks that are represented by directed graphs. The extensive experiments demonstrate that our techniques outperform the existing techniques by an order of magnitude in terms of computation cost and communication cost.", "paper_title": "Continuous reverse k nearest neighbors queries in Euclidean space and in spatial networks", "paper_id": "WOS:000299170700004"}