{"auto_keywords": [{"score": 0.04911477212520224, "phrase": "privacy_requirements"}, {"score": 0.00481495049065317, "phrase": "data_storage"}, {"score": 0.00462291551375938, "phrase": "modern_applications"}, {"score": 0.004384623928442369, "phrase": "reliable_solutions"}, {"score": 0.004331393784852601, "phrase": "sensitive_information"}, {"score": 0.004141663280057689, "phrase": "external_parties"}, {"score": 0.004041686156098498, "phrase": "encryption_techniques"}, {"score": 0.0039280803011236395, "phrase": "data_protection"}, {"score": 0.003710323357333052, "phrase": "personal_information"}, {"score": 0.003392182098020722, "phrase": "encrypted_data"}, {"score": 0.00335095982979018, "phrase": "query_processing"}, {"score": 0.003076052206618737, "phrase": "data_collections"}, {"score": 0.0030386598795433474, "phrase": "data_fragmentation"}, {"score": 0.002941147710077221, "phrase": "confidentiality_constraints"}, {"score": 0.002623783458189614, "phrase": "sensitive_associations"}, {"score": 0.0023026973099101876, "phrase": "experimental_results"}, {"score": 0.00220163445285539, "phrase": "optimal_solutions"}, {"score": 0.0021049977753042253, "phrase": "polynomial-time_computation_cost"}], "paper_keywords": ["Security", " Design", " Privacy", " fragmentation", " encryption"], "paper_abstract": "The impact of privacy requirements in the development of modern applications is increasing very quickly. Many commercial and legal regulations are driving the need to develop reliable solutions for protecting sensitive information whenever it is stored, processed, or communicated to external parties. To this purpose, encryption techniques are currently used in many scenarios where data protection is required since they provide a layer of protection against the disclosure of personal information, which safeguards companies from the costs that may arise from exposing their data to privacy breaches. However, dealing with encrypted data may make query processing more expensive. In this article, we address these issues by proposing a solution to enforce the privacy of data collections that combines data fragmentation with encryption. We model privacy requirements as confidentiality constraints expressing the sensitivity of attributes and their associations. We then use encryption as an underlying (conveniently available) measure for making data unintelligible while exploiting fragmentation as a way to break sensitive associations among attributes. We formalize the problem of minimizing the impact of fragmentation in terms of number of fragments and their affinity and present two heuristic algorithms for solving such problems. We also discuss experimental results, comparing the solutions returned by our heuristics with respect to optimal solutions, which show that the heuristics, while guaranteeing a polynomial-time computation cost are able to retrieve solutions close to optimum.", "paper_title": "Combining Fragmentation and Encryption to Protect Privacy in Data Storage", "paper_id": "WOS:000280545800004"}