{"auto_keywords": [{"score": 0.031194130851866432, "phrase": "automatic_pattern_classification"}, {"score": 0.015719716506582538, "phrase": "non-verbal_cues"}, {"score": 0.013084637275871853, "phrase": "personality_patterns"}, {"score": 0.009564328998752711, "phrase": "personal_traits"}, {"score": 0.004625881588444304, "phrase": "user_personality"}, {"score": 0.004556901872357751, "phrase": "user_speech_signals"}, {"score": 0.004248294537944227, "phrase": "virtual_agent"}, {"score": 0.004122490120202936, "phrase": "speech_interface"}, {"score": 0.003511613254403125, "phrase": "silent_intervals"}, {"score": 0.003306559295382181, "phrase": "maximum_pattern_classification_accuracy"}, {"score": 0.003129096013910626, "phrase": "pattern_classification_test"}, {"score": 0.002816246391862638, "phrase": "second_manual_test"}, {"score": 0.0023390219342052623, "phrase": "second_test"}, {"score": 0.002246955931290095, "phrase": "key_factor"}, {"score": 0.0022133711375320266, "phrase": "better_accuracy"}, {"score": 0.0021049977753042253, "phrase": "future_studies"}], "paper_keywords": ["Voice User Interface", " User Personality Trait", " Speech Processing", " Human-Computer Interaction"], "paper_abstract": "Technology that detects user personality based on user speech signals must be researched to enhance the function of interaction between a user and virtual agent that takes place through a speech interface. In this study, personality patterns were automatically classified as either extroverted or introverted. Personality patterns were recognized based on non-verbal cues such as the rate, energy, pitch, and silent intervals of speech with patterns of their change. Through experimentation, a maximum pattern classification accuracy of 86.3% was achieved. Using the same data, another pattern classification test was manually carried out by people to see how well the automatic pattern classification of personal traits performed. The results in the second manual test showed an accuracy of 86.6%. This proves that the automatic pattern classification of personal traits can achieve results comparable to the level of performance accomplished by humans. The Silent Intervals feature of the automatic pattern classification performed admirably while in the second test done by people, pitch was a key factor in producing better accuracy. This information will be useful and applicable in future studies.", "paper_title": "User-Personality Classification Based on the Non-Verbal Cues from Spoken Conversations", "paper_id": "WOS:000319191800013"}