{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_mining"}, {"score": 0.010277258977943559, "phrase": "declarative_approaches"}, {"score": 0.004342430078306461, "phrase": "possible_future_development"}, {"score": 0.004286708921931472, "phrase": "data_mining_technology"}, {"score": 0.0041773934798743405, "phrase": "introductory_level"}, {"score": 0.004044645056447888, "phrase": "historical_background"}, {"score": 0.0032259472087775138, "phrase": "larger_role"}, {"score": 0.002427035025924384, "phrase": "declarative_data_mining"}, {"score": 0.002260301305523054, "phrase": "computer_science"}, {"score": 0.0022312377180023282, "phrase": "declarative_languages"}, {"score": 0.0021742244283295986, "phrase": "major_leaps"}, {"score": 0.0021049977753042253, "phrase": "early_results"}], "paper_keywords": ["Data Mining", " Inductive Databases", " Inductive Query Languages", " Declarative Modeling Languages", " Constraint Solving"], "paper_abstract": "This article provides a viewpoint on the past and possible future development of data mining technology. On an introductory level, it provides some historical background to the development of data mining, sketches its relationship to other disciplines, and introduces a number of tasks that are typically considered data mining tasks. It next focuses on one particular aspect that may play a larger role in data mining, namely, declarativeness. Despite the fact that many different data mining tools have been developed, this variety still offers less flexibility to the user than desired. It also creates a problem of choice: which tool is most suitable for a given problem? Declarative data mining may provide a solution for this. In other domains of computer science, declarative languages have led to major leaps forward in technology. Early results show that in data mining, too, declarative approaches are feasible and may make the process easier, more flexible, more efficient, and more correct.", "paper_title": "Data Mining: From Procedural to Declarative Approaches", "paper_id": "WOS:000352802100001"}