{"auto_keywords": [{"score": 0.04849394558163613, "phrase": "anomaly_detection"}, {"score": 0.03590850487307706, "phrase": "association_rules"}, {"score": 0.01189284370699676, "phrase": "single_entity"}, {"score": 0.004815133171259446, "phrase": "distributed"}, {"score": 0.004741845603430361, "phrase": "cooperative_learners"}, {"score": 0.00461302961851157, "phrase": "important_branch"}, {"score": 0.00457086975394978, "phrase": "classification_problem"}, {"score": 0.004221186370364584, "phrase": "distributed_data"}, {"score": 0.0041825926310470616, "phrase": "central_location"}, {"score": 0.004093901605219401, "phrase": "distributed_anomaly_detection_problem"}, {"score": 0.0038389110156920926, "phrase": "horizontally_distributed_data"}, {"score": 0.003734531922225675, "phrase": "remote_site"}, {"score": 0.0035668128900149814, "phrase": "whole_dataset"}, {"score": 0.0034486088883791343, "phrase": "local_predictors"}, {"score": 0.0033241072942139568, "phrase": "predicted_and_actual_values"}, {"score": 0.003293688299319582, "phrase": "context_dataset"}, {"score": 0.003213920601037463, "phrase": "normal_and_anomalous_behaviors"}, {"score": 0.0031747618267940155, "phrase": "final_set"}, {"score": 0.002799810685137358, "phrase": "whole_data"}, {"score": 0.002690406375639144, "phrase": "concept_drifts"}, {"score": 0.00257735013358606, "phrase": "potential_dishonesty"}, {"score": 0.0025615908073796027, "phrase": "participating_entities"}, {"score": 0.002461472107682778, "phrase": "speed_requirement"}, {"score": 0.002210903392596343, "phrase": "proposed_method"}, {"score": 0.002163930783583212, "phrase": "participating_datasets"}, {"score": 0.0021179540310789446, "phrase": "local_samples"}], "paper_keywords": ["distributed anomaly detection", " credit card fraud detection", " feature selection", " association rule analysis"], "paper_abstract": "Anomaly detection is an important branch of the classification problem which has attracted much attention during the previous years. This, as well as the growing need for distributed data mining techniques, and concerns for privacy and security issues of gathering all distributed data in a central location, emphasizes the importance of the distributed anomaly detection problem, which has thus far received little attention. In this paper, we address the problem of detecting anomalies in horizontally distributed data, where only a limited ratio of the instances at each remote site are allowed to be shared, and no single entity is allowed to observe the whole dataset, neither at once nor incrementally. In our proposed method, local predictors are trained and association rules are extracted, using the difference between predicted and actual values on a context dataset. These association rules are used to represent normal and anomalous behaviors, while a final set of learners use these representations to detect anomalies. The contributions of our work are: 1) distributed anomaly detection, where (a) both data and process are distributed, (b) only a limited form of sharing is allowed and (c) no single entity is allowed to observe the whole data, in anyway, 2) solving the problem in cases where concept drifts might occur, 3) providing a solution which is able to handle potential dishonesty from participating entities, and 4) using association rules for anomaly detection, while maintaining the speed requirement in anomaly detection which is necessary in various applications. We have conducted a set of experiments, comparing our proposed method to other typical anomaly detection methods (oversampling, undersampling, SMOTE), which indicate the superiority of the proposed method, while preserving the privacy of participating datasets by avoiding the communication of all local samples to other local datasets.", "paper_title": "Distributed anomaly detection, using cooperative learners and association rule analysis", "paper_id": "WOS:000259230900002"}