{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "workflow_nets"}, {"score": 0.004485735417293941, "phrase": "particular_class"}, {"score": 0.00443308765153716, "phrase": "petri_nets"}, {"score": 0.004253618550301311, "phrase": "standard_ways"}, {"score": 0.0036914757355166966, "phrase": "so-called_soundness_property"}, {"score": 0.003299460925313939, "phrase": "domain_knowledge"}, {"score": 0.0032033846797483475, "phrase": "alternative_notions"}, {"score": 0.002763261749602258, "phrase": "different_notions"}, {"score": 0.0026045914281028473, "phrase": "different_extensions"}, {"score": 0.00246957392654378, "phrase": "eight_soundness_notions"}, {"score": 0.0021682027434117095, "phrase": "new_results"}, {"score": 0.002130056082139311, "phrase": "theoretical_limits"}, {"score": 0.0021049977753042253, "phrase": "workflow_verification"}], "paper_keywords": ["Petri nets", " Decidability", " Workflow nets", " Reset nets", " Soundness", " Verification"], "paper_abstract": "Workflow nets, a particular class of Petri nets, have become one of the standard ways to model and analyze workflows. Typically, they are used as an abstraction of the workflow that is used to check the so-called soundness property. This property guarantees the absence of livelocks, deadlocks, and other anomalies that can be detected without domain knowledge. Several authors have proposed alternative notions of soundness and have suggested to use more expressive languages, e.g., models with cancellations or priorities. This paper provides an overview of the different notions of soundness and investigates these in the presence of different extensions of workflow nets. We will show that the eight soundness notions described in the literature are decidable for workflow nets. However, most extensions will make all of these notions undecidable. These new results show the theoretical limits of workflow verification. Moreover, we discuss some of the analysis approaches described in the literature.", "paper_title": "Soundness of workflow nets: classification, decidability, and analysis", "paper_id": "WOS:000289524500006"}