{"auto_keywords": [{"score": 0.04825016108360526, "phrase": "achievable_rate_region"}, {"score": 0.014306773293733581, "phrase": "achievable_edge-rate_region"}, {"score": 0.007219934173631732, "phrase": "max-min_allocation"}, {"score": 0.004228839109569368, "phrase": "edge_rates"}, {"score": 0.00403221710768334, "phrase": "careful_consideration"}, {"score": 0.003911862375084159, "phrase": "neighboring_edges"}, {"score": 0.0038115535592184438, "phrase": "idle_time"}, {"score": 0.003510507340837656, "phrase": "two-edge_topologies"}, {"score": 0.003450213580299164, "phrase": "fundamental_ways"}, {"score": 0.003332704619499476, "phrase": "arbitrary_multihop_topologies"}, {"score": 0.0032331613500559764, "phrase": "neighboring_edge"}, {"score": 0.003029722317983915, "phrase": "aggregate_effect"}, {"score": 0.0025585490847951703, "phrase": "interesting_and_somewhat_surprising_observations"}, {"score": 0.0025145641652082164, "phrase": "rate_regions"}, {"score": 0.002227083991228041, "phrase": "model_verification"}, {"score": 0.0021049977753042253, "phrase": "perfect_scheduler"}], "paper_keywords": ["Capacity region", " IEEE 802.11", " multihop networks"], "paper_abstract": "In this paper, we characterize the achievable rate region for any IEEE 802.11-scheduled static multihop network. To do so, we first characterize the achievable edge-rate region, that is, the set of edge rates that are achievable on the given topology. This requires a careful consideration of the interdependence among edges since neighboring edges collide with and affect the idle time perceived by the edge under study. We approach this problem in two steps. First, we consider two-edge topologies and study the fundamental ways they interact. Then, we consider arbitrary multihop topologies, compute the effect that each neighboring edge has on the edge under study in isolation, and combine to get the aggregate effect. We then use the characterization of the achievable edge-rate region to characterize the achievable rate region. We verify the accuracy of our analysis by comparing the achievable rate region derived from simulations with the one derived analytically. We make a couple of interesting and somewhat surprising observations while deriving the rate regions. First, the achievable rate region with 802.11 scheduling is not necessarily convex. Second, the performance of 802.11 is surprisingly good. For example, in all the topologies used for model verification, the max-min allocation under 802.11 is at least 64% of the max-min allocation under a perfect scheduler.", "paper_title": "The Achievable Rate Region of 802.11-Scheduled Multihop Networks", "paper_id": "WOS:000269155300009"}