{"auto_keywords": [{"score": 0.047599993411656535, "phrase": "information_systems"}, {"score": 0.035215573523279954, "phrase": "context-dependent_information_processing"}, {"score": 0.028972169195566198, "phrase": "medical_informatics"}, {"score": 0.015719716506582538, "phrase": "medical_information_systems"}, {"score": 0.011395027825289356, "phrase": "context-dependent_representations"}, {"score": 0.010283436940826998, "phrase": "concept_spaces"}, {"score": 0.009117151247202703, "phrase": "existing_knowledge_centric_definitions"}, {"score": 0.008521302744512908, "phrase": "context-dependent_medical_information_processing"}, {"score": 0.004592905436175987, "phrase": "user_interfaces"}, {"score": 0.004178935413340453, "phrase": "usability_axiom"}, {"score": 0.004142084961822865, "phrase": "medical_information_technology"}, {"score": 0.003881556746152146, "phrase": "existing_technology"}, {"score": 0.003428665921276366, "phrase": "thought_experiments"}, {"score": 0.0032703403368940743, "phrase": "algorithmic_information_theory"}, {"score": 0.0032510690712452147, "phrase": "case-based_reasoning"}, {"score": 0.0031009188628557957, "phrase": "pragmatic_perspective"}, {"score": 0.0030284566685355456, "phrase": "efficient_management"}, {"score": 0.002940248454513279, "phrase": "medical_information_technology_paradox"}, {"score": 0.0028630535573013686, "phrase": "informatics_centred_on_the_concepts_of_context-dependent_information_processing"}, {"score": 0.002659064774118166, "phrase": "m._musen's_proposal"}, {"score": 0.0023277282036119106, "phrase": "crucial_importance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["artificial intelligence", " usability information systems", " medical informatics", " algorithmic information theory", " case-based reasoning"], "paper_abstract": "Introduction: In this article we begin by connecting the concept of simplicity of user interfaces of information systems with that of usability, and the concept of complexity of the problem-solving in information systems with the concept of usefulness. We continue by stating \"the usability axiom\" of medical information technology: information systems must be, at the same time, usable and useful. We then try to show why, given existing technology, the axiom is a paradox and we continue with analysing and reformulating it several times, from more fundamental information processing perspectives. Discussion: We underline the importance of the concept of representation and demonstrate the need for context-dependent representations. By means of thought experiments and examples, we advocate the need for context-dependent information processing and argue for the relevance of algorithmic information theory and case-based reasoning in this context. Further, we introduce the notion of concept spaces and offer a pragmatic perspective on context-dependent representations. We conclude that the efficient management of concept spaces may help with the solution to the medical information technology paradox. Finally, we propose a view of informatics centred on the concepts of context-dependent information processing and management of concept spaces that aligns well with existing knowledge centric definitions of informatics in general and medical informatics in particular. In effect, our view extends M. Musen's proposal and proposes a definition of Medical Informatics as context-dependent medical information processing. Summary: The axiom that medical information systems must be, at the same time, useful and usable, is a paradox and its investigation by means of examples and thought experiments leads to the recognition of the crucial importance of context-dependent information processing. On the premise that context-dependent information processing equates to knowledge processing, this view defines Medical Informatics as a context-dependent medical information processing which aligns well with existing knowledge centric definitions of our field. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The usability axiom of medical information systems", "paper_id": "WOS:000242781900006"}