{"auto_keywords": [{"score": 0.044454016803517404, "phrase": "speed_governor"}, {"score": 0.04215223424019578, "phrase": "terminal_voltage"}, {"score": 0.027345861668966916, "phrase": "proposed_controller"}, {"score": 0.015719716506582538, "phrase": "control-oriented_model"}, {"score": 0.015400499043015978, "phrase": "diesel_engine"}, {"score": 0.01361498606912764, "phrase": "shaft_speed"}, {"score": 0.011951666679094423, "phrase": "avr"}, {"score": 0.00476527679607755, "phrase": "generating_set"}, {"score": 0.004571630734130793, "phrase": "genset"}, {"score": 0.0045088388224419, "phrase": "prime_mover"}, {"score": 0.0041211075804202905, "phrase": "automatic_voltage_regulator"}, {"score": 0.003939880387831148, "phrase": "pid_controller"}, {"score": 0.0037796484923665855, "phrase": "feedback_signal"}, {"score": 0.0037276938184125532, "phrase": "fuel_mass_input"}, {"score": 0.0036764506727132253, "phrase": "fuel_rack_position"}, {"score": 0.003325343504284345, "phrase": "field_excitation_circuit"}, {"score": 0.003102875178186416, "phrase": "desired_value"}, {"score": 0.0026004698404274483, "phrase": "feedback_linearisation"}, {"score": 0.0022096550791379033, "phrase": "ordinary_pid_controllers"}, {"score": 0.0021049977753042253, "phrase": "time_delay"}], "paper_keywords": ["Genset", " Diesel Engine", " Synchronous Generators"], "paper_abstract": "A generatingset (Genset) comprises a prime mover such as a Diesel Engine, and a synchronous generator. The most important controllers of such systems are the speed governor to regulate the engine or shaft speed and the automatic voltage regulator (AVR) to regulate the terminal voltage. The speed governor is a PID controller that uses the difference between the speed and its desired value as a feedback signal to change the fuel mass input by changing the fuel rack position. AVR is also a PID that uses the difference between the terminal voltage of the generator and its desired value, and changes it by manipulating the voltage of the field excitation circuit. Thus, the two controllers act separately. That is to say, if the speed varies from the desired value, the speed governor will react, while the AVR will not react as long as the voltage is stable, and vice versa. In this work, a control-oriented model is suggested for a Genset, and then a controller, that regulates the shaft speed and the terminal voltage, is designed by feedback linearisation. The proposed controller has two inputs: the fuel mass and the field circuit voltage. Simulations show that the proposed controller makes the two inputs act, simultaneously. Thus, any change of the speed e.g., forces the two input controls to react, in contrast to the ordinary PID controllers. Further, we discuss the robustness of the proposed controller to uncertainties and time delay.", "paper_title": "Control-Oriented Model of a Generating Set comprising a Diesel Engine and a Synchronous Generator", "paper_id": "WOS:000367822100001"}