{"auto_keywords": [{"score": 0.031206211457634393, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "optimal_outcomes"}, {"score": 0.004759507166427077, "phrase": "expressive_representation"}, {"score": 0.00445712058827745, "phrase": "multiple_agents"}, {"score": 0.004355026964936104, "phrase": "possible_outcomes"}, {"score": 0.003548579306515579, "phrase": "potentially_the_other_agents"}, {"score": 0.002993439939273828, "phrase": "key_special_cases"}, {"score": 0.002846647336160784, "phrase": "nontrivial_feasible_solution"}, {"score": 0.002792119634261638, "phrase": "maximum_social_welfare"}, {"score": 0.0025643086619242814, "phrase": "maximal_concession"}, {"score": 0.0024957862318504753, "phrase": "linear_number"}, {"score": 0.0024574537875026634, "phrase": "utility_functions"}, {"score": 0.002410363090950055, "phrase": "piecewise_constant_functions"}, {"score": 0.002373339527491525, "phrase": "social_welfare"}, {"score": 0.0022222152430170254, "phrase": "special_case"}, {"score": 0.002171202123281881, "phrase": "polynomial_time"}, {"score": 0.0021544587602892466, "phrase": "linear_programming"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Expressive markets", " Externalities", " Representation"], "paper_abstract": "When a decision must be made based on the preferences of multiple agents, and the space of possible outcomes is combinatorial in nature, it becomes necessary to think about how preferences should be represented, and how this affects the complexity of finding an optimal (or at least a good) outcome. We study settings with externalities, where each agent controls one or more variables, and how these variables are set affects not only the agent herself, but also potentially the other agents. For example, one agent may decide to reduce her pollution, which will come at a cost to herself, but will result in a benefit for all other agents. We formalize how to represent such domains and show that in a number of key special cases, it is NP-complete to determine whether there exists a nontrivial feasible solution (and therefore the maximum social welfare is completely inapproximable). However, for one important special case, we give an algorithm that converges to the solution with the maximal concession by each agent (in a linear number of rounds for utility functions that additively decompose into piecewise constant functions). Maximizing social welfare, however, remains NP-hard even in this setting. We also demonstrate a special case that can be solved in polynomial time using linear programming. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Computing optimal outcomes under an expressive representation of settings with externalities", "paper_id": "WOS:000297833200002"}