{"auto_keywords": [{"score": 0.05007843377609577, "phrase": "multimedia_communications"}, {"score": 0.04158334139540436, "phrase": "edca"}, {"score": 0.004729576546428915, "phrase": "wlan"}, {"score": 0.004549657384420166, "phrase": "wireless_lans"}, {"score": 0.004482295432728009, "phrase": "multi-service_network"}, {"score": 0.004324650333875634, "phrase": "qos_mechanisms"}, {"score": 0.004123012124092743, "phrase": "required_qos_mechanisms"}, {"score": 0.004086260758014118, "phrase": "protocol_architecture"}, {"score": 0.004013733930501799, "phrase": "recent_studies"}, {"score": 0.00382653658519243, "phrase": "high_collision_rate"}, {"score": 0.003604725094696445, "phrase": "real-time_fast_collision_resolution"}, {"score": 0.003583261176506348, "phrase": "rt-fcr"}, {"score": 0.0034468165006715013, "phrase": "main_deficiency"}, {"score": 0.003395727443433411, "phrase": "proposed_mechanisms"}, {"score": 0.003141983150118255, "phrase": "proposed_qos_mechanisms"}, {"score": 0.003123265938453612, "phrase": "important_and_incompatible_changes"}, {"score": 0.002977475154200498, "phrase": "qos_support"}, {"score": 0.0027880284928874463, "phrase": "in-depth_analysis"}, {"score": 0.002697862107622459, "phrase": "full_compatibility"}, {"score": 0.00257194774026722, "phrase": "ieee"}, {"score": 0.0024812555102598447, "phrase": "hybrid_scenarios"}, {"score": 0.0023583006329955403, "phrase": "comparative_performance_evaluation"}, {"score": 0.0023372424895785103, "phrase": "different_services"}, {"score": 0.0021367093107378847, "phrase": "proposed_mechanism"}], "paper_keywords": ["EDCA", " Qos", " Multimedia communications", " Performance evaluation", " Video quality"], "paper_abstract": "Multimedia communications over WLAN is widely acknowledged as one of the key, emerging applications for wireless LANs. As with any multi-service network. there is the need to provision the WLANs with the QoS mechanisms capable of guaranteeing the requirements of various services. The IEEE 802.11e (EDCA) standard defines the required QoS mechanisms into the protocol architecture of IEEE 802.11 WLANs. However, recent studies have shown that EDCA performs poorly when the medium is highly loaded due to the high collision rate. This situation has led many researchers to design techniques aiming to improve the performance of EDCA, such as real-time fast collision resolution (RT-FCR) and adaptive fair EDCF (AFEDCF). However, the main deficiency of many of the proposed mechanisms to date comes from their inability to properly interoperate with legacy IEEE 802.11 (DCF) systems. Moreover, the implementation of many of the proposed QoS mechanisms requires important and incompatible changes to the IEEE 802.11e specifications. in this paper, we introduce a novel IEEE 802.11 e-based QoS protocol capable of providing QoS Support to multimedia communications, and able to properly interoperate with legacy DCF-based stations. Our design has been based on an in-depth analysis of the several operation modes of both standards. This should ensure full compatibility of operation: an important feature since the transition from the IEEE 802.11 to the IEEE 802.11 e will take some time making more likely the existence of hybrid scenarios where both standards will have to coexist. In this work, we carry out a comparative performance evaluation when supporting different services, such as, voice, video, best-effort, background and in the presence of traffic generated by legacy 802.11 (DCF)-based stations. Our simulation results show that the proposed mechanism outperforms the EDCA and other QoS-aware schemes recently reported in the literature. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "B-EDCA: A QoS mechanism for multimedia communications over heterogeneous 802.11/802.11e WLANs", "paper_id": "WOS:000261362400003"}