{"auto_keywords": [{"score": 0.043184945760771344, "phrase": "spn_paradigm"}, {"score": 0.00481495049065317, "phrase": "new_step"}, {"score": 0.004742290714667451, "phrase": "pseudorandom_functions"}, {"score": 0.004718324624991633, "phrase": "prf"}, {"score": 0.0043506951029334984, "phrase": "substitution-permutation_network_paradigm"}, {"score": 0.0042203149492677575, "phrase": "prf."}, {"score": 0.004032002950217453, "phrase": "previous_ones"}, {"score": 0.003765113620570665, "phrase": "random_function"}, {"score": 0.003746058943441669, "phrase": "b_bits"}, {"score": 0.003316491983161284, "phrase": "field_inversion"}, {"score": 0.003266370404458313, "phrase": "practical_constructions"}, {"score": 0.0031926001871260524, "phrase": "boolean_circuits"}, {"score": 0.002936039027285032, "phrase": "nonstandard_variant"}, {"score": 0.0025468378555865406, "phrase": "extreme_setting"}, {"score": 0.0025275050635202878, "phrase": "spn_parameters"}, {"score": 0.002260211578368138, "phrase": "parity_tests"}, {"score": 0.002159170788765385, "phrase": "existing_lower_bounds"}, {"score": 0.0021050858585032325, "phrase": "turing"}], "paper_keywords": ["Pseudorandom function", " natural proofs", " Advanced Encryption Standard", " substitution-permutation network"], "paper_abstract": "This article takes a new step towards closing the gap between pseudorandom functions (PRF) and their popular, bounded-input-length counterparts. This gap is both quantitative, because these counterparts are more efficient than PRF in various ways, and methodological, because these counterparts usually fit in the substitution-permutation network paradigm (SPN), which has not been used to construct PRF. We give several candidate PRF F-i that are inspired by the SPN paradigm. Most of our candidates are more efficient than previous ones. Our main candidates are as follows. -F-1 : {0, 1}(n) -> {0, 1}(n) is an SPN whose S-box is a random function on b bits given as part of the seed. We prove that F-1 resists attacks that run in time <= 2(epsilon b). -F-2 : {0, 1}(n) -> {0, 1}(n) is an SPN where the S-box is (patched) field inversion, a common choice in practical constructions. We show that F-2 is computable with boolean circuits of size n.log(O(1))n and that it has exponential security 2(Omega(n)) against linear and differential cryptanalysis. -F-3 : {0, 1}(n) -> {0, 1} is a nonstandard variant on the SPN paradigm, where \"states\" grow in length. We show that F-3 is computable with TC0 circuits of size n(1+epsilon), for any epsilon > 0, and that it is almost 3-wise independent. -F-4 : {0, 1}(n) -> {0, 1} uses an extreme setting of the SPN parameters (one round, one S-box, no diffusion matrix). The S-box is again (patched) field inversion. We show that F-4 is computable by circuits of size n.log(O(1)) n and that it fools all parity tests on <= 2(0.9n) outputs. Assuming the security of our candidates, our work narrows the gap between the Natural Proofs barrier and existing lower bounds in three models: circuits, TC0 circuits, and Turing machines.", "paper_title": "Substitution-Permutation Networks, Pseudorandom Functions, and Natural Proofs", "paper_id": "WOS:000366430000003"}