{"auto_keywords": [{"score": 0.00750680156224015, "phrase": "external_stakeholders"}, {"score": 0.00481495049065317, "phrase": "firm's_reputation_for_information_technology_capability"}, {"score": 0.004733791336312872, "phrase": "senior_it_executives"}, {"score": 0.004560002169647084, "phrase": "firm's_information_technology"}, {"score": 0.004437613070853689, "phrase": "institutional_theory"}, {"score": 0.004289215825521407, "phrase": "external_legitimacy"}, {"score": 0.004174064076143015, "phrase": "superior_it_capability"}, {"score": 0.004048194450210347, "phrase": "top_management_team"}, {"score": 0.004020740863986328, "phrase": "board_members"}, {"score": 0.003939487754302632, "phrase": "internal_legitimacy"}, {"score": 0.0036428866026996707, "phrase": "panel_data"}, {"score": 0.003581412258960711, "phrase": "wide_spectrum"}, {"score": 0.0033229756875116597, "phrase": "greater_structural_power"}, {"score": 0.0029900592229516187, "phrase": "public_recognition"}, {"score": 0.002627000223796678, "phrase": "firm's_ability"}, {"score": 0.002556359086441866, "phrase": "important_practical_implications"}, {"score": 0.0025217522723800204, "phrase": "firm's_it_reputation_strategy"}, {"score": 0.002284444272376043, "phrase": "positive_reciprocity"}, {"score": 0.002155831935645973, "phrase": "firm's_it_organization"}], "paper_keywords": ["external legitimacy", " institutional theory", " internal legitimacy", " IT capability reputation", " IT executives", " IT strategic leadership", " reciprocity", " structural power"], "paper_abstract": "This study investigates the development and sustainability of a firm's information technology (IT) capability reputation from an IT executive's standpoint. Building on institutional theory, we argue that IT executives will try to achieve external legitimacy (i.e., project an image of superior IT capability to external stakeholders) in the hope that the top management team and board members will reciprocate by elevating the internal legitimacy of IT executives. Firms that develop such a culture of reciprocity with their IT executives are more likely to sustain their IT capability reputation. Econometric results based on panel data for 1,326 large U. S. firms from a wide spectrum of industries over a 13-year period (1997-2009) validate these predictions. More specifically, we find that IT executives with greater structural power (e. g., higher job titles) or IT-related expert power (e. g., IT-related education or experience) are more likely to attract public recognition for their firm's IT capability. Firms that build such an IT capability reputation are more likely to promote their IT executives, and IT executives who are promoted are more likely to stay longer with their firms. This continuity in IT strategic leadership is positively associated with the firm's ability to sustain its IT capability reputation. Our findings have important practical implications related to a firm's IT reputation strategy as well as the motivation and career of IT executives. Firms wanting to develop and sustain their IT capability reputation would do well to foster the creation of a cycle of positive reciprocity with their IT executives. IT executives hoping to increase their power within their firm's top management team and improve the legitimacy of the firm's IT organization need to project an image of IT superiority to external stakeholders.", "paper_title": "Sustainability of a Firm's Reputation for Information Technology Capability: The Role of Senior IT Executives", "paper_id": "WOS:000323353200003"}