{"auto_keywords": [{"score": 0.04909697764922772, "phrase": "atmospheric_chemistry_community"}, {"score": 0.04081578574791827, "phrase": "eln_system"}, {"score": 0.00481495049065317, "phrase": "user-orientated_electronic_laboratory_notebook"}, {"score": 0.00435370106706627, "phrase": "eln"}, {"score": 0.004251728624599691, "phrase": "semantic_metadata"}, {"score": 0.004176813329075736, "phrase": "modelling_activities"}, {"score": 0.0039248128268720645, "phrase": "iterative_model_development_process"}, {"score": 0.0038556354709511818, "phrase": "automatic_capture"}, {"score": 0.003798916441627028, "phrase": "modelling_process"}, {"score": 0.0037652847971532976, "phrase": "inline_annotations"}, {"score": 0.0035590664550919854, "phrase": "full_realisation"}, {"score": 0.0033541431225443306, "phrase": "eln_system_architecture"}, {"score": 0.003334309053314909, "phrase": "domain-independent_as_well_as_domain-dependent_elements"}, {"score": 0.003198705576491802, "phrase": "specific_terminology"}, {"score": 0.003123700735336378, "phrase": "provenance_metadata"}, {"score": 0.0029877604856619806, "phrase": "dynamic_graphic_interface"}, {"score": 0.002807297104719042, "phrase": "stored_provenance_metadata"}, {"score": 0.0027741761880779535, "phrase": "specific_simulation_run"}, {"score": 0.0027090988689455735, "phrase": "innovative_mechanism"}, {"score": 0.0026143265665547525, "phrase": "navigation_process"}, {"score": 0.0025758208205978825, "phrase": "different_nodes"}, {"score": 0.0024418251230319435, "phrase": "two-day_summative_evaluation"}, {"score": 0.0022942608418577313, "phrase": "modelling_community"}, {"score": 0.0021620042653528846, "phrase": "domain-independent_elements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Component", " Provenance", " Electronic laboratory notebook", " Atmospheric chemistry community"], "paper_abstract": "Data is particularly valuable to scientists when details of its provenance are known. This research concerned deploying a user-orientated electronic laboratory notebook (ELN) system within a scientific community. The ELN system supported the capture and retrieval of semantic metadata describing the provenance of the modelling activities of scientists within that community. The research was grounded within the atmospheric chemistry community but has applicability to other communities using an iterative model development process. The ELN system involved the automatic capture of metadata concerning the modelling process together with inline annotations added by the modeller explaining the reasoning for modelling decisions at each step of the process. A full realisation of the ELN system was built and evaluated by members of the atmospheric chemistry community. In order to promote reusability the ELN system architecture had domain-independent as well as domain-dependent elements. An ontology (in OWL) was used to ensure that the specific terminology of the community was used within the provenance metadata and also that it was used consistently. Other domain-independent elements of the architecture included a dynamic graphic interface that allowed the modeller to view his/her modelling history. This was recorded as a set of nodes each pointing to the stored provenance metadata associated with a specific simulation run. In addition, there was an innovative mechanism that enabled the modeller to navigate through the various nodes. The navigation process supported making comparisons between different nodes: a facility that users found particularly valuable. Members of the atmospheric chemistry community took part in a two-day summative evaluation of the ELN system. This confirmed its value to the modellers and it is now being introduced more widely across the modelling community. In addition, the research proposes a methodology for transferring this ELN system to other modelling communities making use of the domain-independent elements of the architecture. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Architecture design of a user-orientated electronic laboratory notebook: A case study within an atmospheric chemistry community", "paper_id": "WOS:000326613400027"}