{"auto_keywords": [{"score": 0.0045581828632009795, "phrase": "memory_access_time"}, {"score": 0.0041194351307673556, "phrase": "cluster-based_multicore_platform"}, {"score": 0.003949280009382125, "phrase": "low_average_latency"}, {"score": 0.0038343620353052184, "phrase": "numa"}, {"score": 0.0037543106253910313, "phrase": "low_latency_logarithmic_interconnects"}, {"score": 0.003660452313567116, "phrase": "multiple_identical_memory"}, {"score": 0.0035539019235553897, "phrase": "multiple_outstanding_transactions"}, {"score": 0.0034944094552943, "phrase": "high_clock_frequencies"}, {"score": 0.0032938942910948096, "phrase": "clock_frequency"}, {"score": 0.0031979796189858206, "phrase": "access_time"}, {"score": 0.0031577303835881964, "phrase": "memory_arrays"}, {"score": 0.002889778121878728, "phrase": "memory_density_loss"}, {"score": 0.00284137141260141, "phrase": "benchmark_simulation_results"}, {"score": 0.002735392281320413, "phrase": "multicluster_system"}, {"score": 0.0026782279715171866, "phrase": "average_performance_boost"}, {"score": 0.0023100907305651872, "phrase": "unique_features"}, {"score": 0.002280990744438186, "phrase": "low-cost_manufacturing"}, {"score": 0.0022145052062614514, "phrase": "identical_md_layouts"}], "paper_keywords": ["3-D integration", " nonuniform memory access (NUMA)", " physical implementation", " tightly coupled data memory"], "paper_abstract": "Large required size, and tolerance to latency and variations in memory access time make L2 memory a suitable option for 3-D integration. In this paper, we present a synthesizable 3-D-stackable L2 memory IP component, which can be attached to a cluster-based multicore platform through its network-on-chip interfaces offering high-bandwidth memory access with low average latency. Our design implements a scalable 3-D-nonuniform memory access (NUMA) architecture based on low latency logarithmic interconnects, which allows stacking of multiple identical memory dies (MDs), supports multiple outstanding transactions, and achieves high clock frequencies due to its highly pipelined nature. We implemented our design with STMicroelectronics CMOS-28-nm low-power technology and obtained a clock frequency of 500 MHz (limited by the access time of the memory arrays, whereas its logic components can operate up to 1 GHz), up to eight stacked dies (4 MB) with a memory density loss of 9%. Benchmark simulation results demonstrate that the addition of 3-D-NUMA to a multicluster system can lead to an average performance boost of 34%. Furthermore, experiments and estimations confirm that 3-D-NUMA is energy and power efficient (38% power reduction due to an architectural clock gating scheme), temperature friendly (over 40 degrees C temperature reduction), and has unique features suitable for low-cost manufacturing (2.3x cost reduction due to identical MD layouts). Finally, 22% yield improvement is achievable in 3-D-NUMA compared with its 2-D counterparts, using the state of the art through-silicon-via technologies.", "paper_title": "A Modular Shared L2 Memory Design for 3-D Integration", "paper_id": "WOS:000358511300010"}