{"auto_keywords": [{"score": 0.04744828772449848, "phrase": "signed_networks"}, {"score": 0.00481495049065317, "phrase": "evolutionary_and_memetic_algorithms"}, {"score": 0.004692980391580608, "phrase": "signed_social_networks"}, {"score": 0.00368673793612343, "phrase": "objective_functions"}, {"score": 0.0036303546926971966, "phrase": "improved_measures"}, {"score": 0.0034841647157189985, "phrase": "original_ones"}, {"score": 0.0033096502887394233, "phrase": "negative_links"}, {"score": 0.0031277316566463978, "phrase": "different_resolutions"}, {"score": 0.002910545717767559, "phrase": "benchmark_social_networks"}, {"score": 0.002708399936381754, "phrase": "experimental_results"}, {"score": 0.0026126405272417783, "phrase": "high_efficiency"}, {"score": 0.002309242063033298, "phrase": "solution_quality"}, {"score": 0.0022738775158524793, "phrase": "computational_cost"}, {"score": 0.0021049977753042253, "phrase": "multi-resolution_ability"}], "paper_keywords": ["Signed social networks", " Memetic algorithms", " Evolutionary algorithms", " Community detection problems"], "paper_abstract": "To detect communities in signed networks consisting of both positive and negative links, two new evolutionary algorithms (EAs) and two new memetic algorithms (MAs) are proposed and compared. Furthermore, two measures, namely the improved modularity Q and the improved modularity density D-value, are used as the objective functions. The improved measures not only preserve all properties of the original ones, but also have the ability of dealing with negative links. Moreover, D-value can also control the partition to different resolutions. To fully investigate the performance of these four algorithms and the two objective functions, benchmark social networks and various large-scale randomly generated signed networks are used in the experiments. The experimental results not only show the capability and high efficiency of the four algorithms in successfully detecting communities from signed networks, but also indicate that the two MAs outperform the two EAs in terms of the solution quality and the computational cost. Moreover, by tuning the parameter in D-value, the four algorithms have the multi-resolution ability.", "paper_title": "A comparative analysis of evolutionary and memetic algorithms for community detection from signed social networks", "paper_id": "WOS:000329975000010"}