{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "native-like_and_non-native_hydrogen_bonding_patterns"}, {"score": 0.04779502717396203, "phrase": "staphylococcal_nuclease"}, {"score": 0.04669069115554754, "phrase": "hydrogen-deuterium_exchange"}, {"score": 0.03690683332090251, "phrase": "hydrogen-deuterium_exchange_protection_patterns"}, {"score": 0.035761459630628156, "phrase": "fully_formed_hairpins"}, {"score": 0.026566810399653005, "phrase": "experimental_observations"}, {"score": 0.0039280803011236395, "phrase": "hydrogen-deuterium_exchange_nmr_techniques"}, {"score": 0.003817655499320344, "phrase": "time_scale"}, {"score": 0.003419943984098415, "phrase": "significant_population"}, {"score": 0.0029531640201737384, "phrase": "beta-hairpin_region"}, {"score": 0.0028935680100446583, "phrase": "nvt_conditions"}, {"score": 0.0028467558213723697, "phrase": "unfolded_conformational_states"}, {"score": 0.002777949746964955, "phrase": "hairpin_conformations"}, {"score": 0.002634506575564286, "phrase": "computed_protection_factors"}, {"score": 0.002613103872300205, "phrase": "atom_depth_values"}, {"score": 0.002283984048569816, "phrase": "molecular_picture"}, {"score": 0.0022561982694417116, "phrase": "formed_hairpins"}, {"score": 0.00221063611719246, "phrase": "refolding_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["atom depth", " hydrogen-deuterium exchange", " peptide", " GROMACS", " GROMOS96", " protein folding", " hydrogen bonds"], "paper_abstract": "Refolding of staphylococcal nuclease has been studied recently by hydrogen-deuterium exchange and NMR spectroscopy. These studies infer that beta-hairpin formed by strand 2 and strand 3 connected by reverse turn forms early during the refolding of nuclease. Typically, hydrogen-deuterium exchange NMR techniques are usually carried out on a time scale of milliseconds whereas beta-hairpins are known to fold on a much shorter time scale. It follows that in the experiments, the hydrogen-deuterium exchange protection patterns could be arising from a significant population of fully formed hairpins. In order to demonstrate it is the fully formed hairpins which gives rise to the hydrogen-deuterium exchange protection patterns, we have considered molecular dynamics simulation of the peptide (21)DTVKLMYKGQPMTFR(35) from staphylococcal nuclease corresponding to the beta-hairpin region, using GROMOS96 force field under NVT conditions. Starting from unfolded conformational states, the peptide folds into hairpin conformations with native-like and non-native hydrogen bonding patterns. Subsequent to folding, equilibrium conditions prevail. The computed protection factors and atom depth values, at equilibrium, of the various amide protons agree qualitatively with experimental observations. A collection of molecules following the trajectories observed in the simulations can account for experimental observations. These simulations provide a molecular picture of the formed hairpins and their conformational features during the refolding experiments on nuclease, monitored by hydrogen-deuterium exchange. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "beta-Hairpins with native-like and non-native hydrogen bonding patterns could form during the refolding of staphylococcal nuclease", "paper_id": "WOS:000241275500012"}