{"auto_keywords": [{"score": 0.02708414645751872, "phrase": "estimation_error"}, {"score": 0.00481495049065317, "phrase": "dynamic_heterogeneous_distributed_system"}, {"score": 0.004675768396728975, "phrase": "real-world_dynamic_heterogeneous_distributed_systems"}, {"score": 0.004474468584252318, "phrase": "inefficient_process"}, {"score": 0.004366387782457736, "phrase": "dynamic_nature"}, {"score": 0.003520687960750365, "phrase": "different_objectives"}, {"score": 0.0030847461428168614, "phrase": "real-world_heterogeneous_distributed_system"}, {"score": 0.002937318465594425, "phrase": "real-world_problems"}, {"score": 0.0027969169552385974, "phrase": "biomedical_engineering"}, {"score": 0.0026372419109713923, "phrase": "scheduling_algorithms"}, {"score": 0.002276717177453959, "phrase": "simple_heuristic"}, {"score": 0.0021049977753042253, "phrase": "complicated_well-known_evolutionary_algorithms"}], "paper_keywords": ["Scheduling", " Error estimation", " Heterogeneous", " Distributed computing"], "paper_abstract": "In real-world dynamic heterogeneous distributed systems, allocating tasks to processors can be an inefficient process, due to the dynamic nature of the resources, and the tasks to be processed. The information about these tasks and resources is not known a priori, and thus must be estimated online. We utilize the accuracy of these estimates, and when combined with different objectives, such as minimizing makespan and evenly distributing load, naturally gives rise to a family of four different scheduling algorithms. The algorithms have been implemented on a real-world heterogeneous distributed system with up to 90 processors. A set of real-world problems from the areas of cryptography, bioinformatics, and biomedical engineering were used as a test-set to measure the effectiveness of the scheduling algorithms. We have found that considering estimation error when allocating tasks to processors can provide more efficient solutions, than when estimation error is not considered. We have found that using a simple heuristic, combined with estimation error, can in some cases provide solutions approaching the efficiency of complicated well-known evolutionary algorithms. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Scheduling in a dynamic heterogeneous distributed system using estimation error", "paper_id": "WOS:000260095000005"}