{"auto_keywords": [{"score": 0.049084030038618824, "phrase": "pareto-optimal_frontier"}, {"score": 0.04121746831918884, "phrase": "project_scheduling_problem"}, {"score": 0.00481495049065317, "phrase": "triple-objective_project"}, {"score": 0.0045846424310611745, "phrase": "existing_conflict_objectives"}, {"score": 0.004536735647938243, "phrase": "optimization_problem"}, {"score": 0.004505074966056871, "phrase": "project_scheduling"}, {"score": 0.004457995891964028, "phrase": "well-known_problem"}, {"score": 0.0036382660173943393, "phrase": "total_cost"}, {"score": 0.0034398445347109396, "phrase": "resources_usage"}, {"score": 0.0025352969524471496, "phrase": "benchmark_instances"}, {"score": 0.0024137645015872952, "phrase": "five_performance_metrics"}, {"score": 0.00231423064137482, "phrase": "order_preference"}, {"score": 0.002281971169774711, "phrase": "ideal_solution"}, {"score": 0.002242277042923036, "phrase": "self-adaptive_nrga"}, {"score": 0.0022187920251626257, "phrase": "highest_preference_rank"}, {"score": 0.0021801944769738618, "phrase": "self-adaptive_tpspga"}, {"score": 0.0021649437083408425, "phrase": "mpga"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-objective optimization", " Project scheduling", " Genetic algorithms", " Self-adaptive"], "paper_abstract": "Finding a Pareto-optimal frontier is widely favorable among researchers to model existing conflict objectives in an optimization problem. Project scheduling is a well-known problem in which investigating a combination of goals eventuate in a more real situation. Although there are many different types of objectives based on the situation on hand, three basic objectives are the most common in the literature of the project scheduling problem. These objectives are: (i) the minimization of the makespan, (ii) the minimization of the total cost associated with the resources, and (iii) the minimization of the variability in resources usage. In this paper, three genetic-based algorithms are proposed for approximating the Pareto-optimal frontier in project scheduling problem where the above three objectives are simultaneously considered. For the above problem, three self-adaptive genetic algorithms, namely (i) A two-stage multi-population genetic algorithm (MPGA), (ii) a two-phase subpopulation genetic algorithm (TPSPGA), and (iii) a non-dominated ranked genetic algorithm (NRGA) are developed. The algorithms are tested using a set of instances built from benchmark instances existing in the literature. The performances of the algorithms are evaluated using five performance metrics proposed in the literature. Finally according to the technique for order preference by similarity to ideal solution (TOPSIS) the self-adaptive NRGA gained the highest preference rank, followed by the self-adaptive TPSPGA and MPGA, respectively. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Three self-adaptive multi-objective evolutionary algorithms for a triple-objective project scheduling problem", "paper_id": "WOS:000360772100002"}