{"auto_keywords": [{"score": 0.03522374163287718, "phrase": "maximal_pair"}, {"score": 0.014356614502110603, "phrase": "turing_degree"}, {"score": 0.012421384716028864, "phrase": "maximal_pairs"}, {"score": 0.0047881480263782675, "phrase": "computably_enumerable_sets"}, {"score": 0.004721789694995182, "phrase": "set_a"}, {"score": 0.0046955033643320005, "phrase": "computably_lipschitz"}, {"score": 0.004553510708976456, "phrase": "set_b"}, {"score": 0.004428139418750855, "phrase": "oracle_turing_machine"}, {"score": 0.004403480614319231, "phrase": "use_function_phi"}, {"score": 0.004306205029641728, "phrase": "identity_function"}, {"score": 0.0030967107893195246, "phrase": "weak_truth-table"}, {"score": 0.0030029450762436008, "phrase": "turing"}, {"score": 0.0024828347422508196, "phrase": "minimal_pair"}, {"score": 0.0021049977753042253, "phrase": "maximal_c.e"}], "paper_keywords": ["Computably Lipschitz degrees", " Maximal pairs", " Computably enumerable sets"], "paper_abstract": "A set A is computably Lipschitz or cl-reducible, for short, to a set B if A is Turing reducible to B by an oracle Turing machine with use function phi such that phi is bounded by the identity function up to an additive constant, i.e., phi(n) <= n + O(1). In this paper we study maximal pairs of computably enumerable (c.e.) cl-degrees or maximal pairs, for short, i. e., pairs of c.e. cl-degrees such that there is no c.e. cl-degree that is above both cl-degrees in this pair. Our main results are as follows. (1) A c.e. Turing degree contains a c.e. cl-degree that is half of a maximal pair if and only if this Turing degree contains a maximal pair if and only if this Turing degree is array noncomputable. (2) The cl-degrees of all weak truth-table complete sets are halves of maximal pairs while there is a Turing complete set A such that the cl-degree of A is not half of any maximal pair. In fact, any high c.e. Turing degree contains a c.e. cl-degree that is not half of a maximal pair. (3) Above any c.e. cl-degree there is a maximal pair. (4) There is a maximal pair which at the same time is a minimal pair. (5) There is a pair of c.e. cl-degrees that is not maximal and does not possess a least upper bound. Moreover, we make some observations on the structure of the c.e. cl-degrees in general. For instance, we give a very simple proof of the fact that there are no maximal c.e. cl-degrees.", "paper_title": "Maximal Pairs of Computably Enumerable Sets in the Computably Lipschitz Degrees", "paper_id": "WOS:000316087100002"}