{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scheduling_policies"}, {"score": 0.004299374036140852, "phrase": "shared_event_schedulers"}, {"score": 0.00422781730455246, "phrase": "common_processor"}, {"score": 0.004157446556371582, "phrase": "multiple_users"}, {"score": 0.003953256858638655, "phrase": "scheduling_policy"}, {"score": 0.003838791650587681, "phrase": "scheduling_policy_measures"}, {"score": 0.00377487157059352, "phrase": "usage_pattern"}, {"score": 0.00299632091372281, "phrase": "parametric_nonwork"}, {"score": 0.002885135695263876, "phrase": "improved_privacy"}, {"score": 0.0024081387633065206, "phrase": "first_question"}, {"score": 0.0023187286045879643, "phrase": "fundamental_limit"}, {"score": 0.002289667393538803, "phrase": "privacy_performance"}, {"score": 0.0022609695885550058, "phrase": "work-conserving_scheduling_policy"}, {"score": 0.002158780936704905, "phrase": "second_question"}, {"score": 0.0021049977753042253, "phrase": "round-robin_scheduling_policy"}], "paper_keywords": [""], "paper_abstract": "Traditionally, scheduling policies have been optimized to perform well on metrics, such as throughput, delay, and fairness. In the context of shared event schedulers, where a common processor is shared among multiple users, one also has to consider the privacy offered by the scheduling policy. The privacy offered by a scheduling policy measures how much information about the usage pattern of one user of the system can be learned by another as a consequence of sharing the scheduler. We introduced an estimation error-based metric to quantify this privacy. We showed that the most commonly deployed scheduling policy, the first-come-first-served offers very little privacy to its users. We also proposed a parametric nonwork conserving policy, which traded off delay for improved privacy. In this paper, we ask the question, is a tradeoff between delay and privacy fundamental to the design to scheduling policies? In particular, is there a work conserving, possibly randomized, and scheduling policy that scores high on the privacy metric? Answering the first question, we show that there does exist a fundamental limit on the privacy performance of a work-conserving scheduling policy. We quantify this limit. Furthermore, answering the second question, we demonstrate that the round-robin scheduling policy (deterministic policy) is privacy optimal within the class of work-conserving policies.", "paper_title": "Delay-Privacy Tradeoff in the Design of Scheduling Policies", "paper_id": "WOS:000353515700024"}