{"auto_keywords": [{"score": 0.04556815853514561, "phrase": "self-interested_agents"}, {"score": 0.010612387000973441, "phrase": "dynamic_coalition_formation"}, {"score": 0.00944509837188495, "phrase": "resource_exchange_environment"}, {"score": 0.007904206899384085, "phrase": "partner_switching"}, {"score": 0.0031845067058084613, "phrase": "prior_work"}, {"score": 0.0029753513692467315, "phrase": "positive_synergies"}, {"score": 0.0026953359825383624, "phrase": "novel_dynamic_coalition_formation_mechanism"}, {"score": 0.00230950802983053, "phrase": "agents'_profits"}, {"score": 0.002157697367447098, "phrase": "preferred_behavior"}, {"score": 0.0021311850321045767, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "complex_networks"}], "paper_keywords": ["Algorithms", " Experimentation", " Coalitions", " rewiring", " cooperation", " trading", " learning"], "paper_abstract": "In this article we tackle the problem of maximizing cooperation among self-interested agents in a resource exchange environment. Our main concern is the design of mechanisms for maximizing cooperation among self-interested agents in a way that their profits increase by exchanging or trading with resources. Although dynamic coalition formation and partner switching (rewiring) have been shown to promote the emergence and maintenance of cooperation for self-interested agents, no prior work in the literature has investigated whether merging both mechanisms exhibits positive synergies that lead to increase cooperation even further. Therefore, we introduce and analyze a novel dynamic coalition formation mechanism, that uses partner switching, to help self-interested agents to increase their profits in a resource exchange environment. Our experiments show the effectiveness of our mechanism at increasing the agents' profits, as well as the emergence of trading as the preferred behavior over different types of complex networks.", "paper_title": "Fostering Cooperation through Dynamic Coalition Formation and Partner Switching", "paper_id": "WOS:000333555400001"}