{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "bioinformatics_applications"}, {"score": 0.0047563776685277314, "phrase": "computational_grid_technology"}, {"score": 0.004501453956464956, "phrase": "large-scale_bioinformatics-related_problems"}, {"score": 0.004339108074589304, "phrase": "processing_speed"}, {"score": 0.00428629884026304, "phrase": "multiple_computation_platforms"}, {"score": 0.004234129588974058, "phrase": "distributed_biodata_sets"}, {"score": 0.00405646687267772, "phrase": "gpcr_data_mining_processing"}, {"score": 0.003958299299658418, "phrase": "important_bioinformatics_application"}, {"score": 0.0036107898615445797, "phrase": "grid_computational_resources"}, {"score": 0.0035668128900149814, "phrase": "distributed_gpcr_data_sets"}, {"score": 0.003375429082739004, "phrase": "large-scale_bioinformatics_application"}, {"score": 0.0033139366449568565, "phrase": "high_biodata_accuracy"}, {"score": 0.00327356326590461, "phrase": "reasonable_processing_resources"}, {"score": 0.002913650880082273, "phrase": "data_mining_processing_time"}, {"score": 0.0021309898622781124, "phrase": "great_promise"}, {"score": 0.0021049977753042253, "phrase": "high_performance_processing"}], "paper_keywords": [""], "paper_abstract": "Computational Grid technology has been noticed as an issue to solve large-scale bioinformatics-related problems and improves data accuracy and processing speed on multiple computation platforms with distributed bioDATA sets. This paper focuses on a GPCR data mining processing which is an important bioinformatics application. This paper proposes a Grid-based 3-tier ART1 classifier which operates an ART1 clustering data mining using grid computational resources with distributed GPCR data sets. This Grid-based 3-tier ART1 classifier is able to process a large-scale bioinformatics application in guaranteeing high bioDATA accuracy with reasonable processing resources. This paper evaluates performance of the Grid-based ART1 classifier in comparing to the ART1-based classifier and the ART1 optimum classifier. The data mining processing time of the Grid-based ART1 classifier is 18% data mining processing time of the ART1 optimum classifier and is the 12% data mining processing time of the ART1-based classifier. And we evaluate performance of the Grid-based 3-tier ART1 classifier in comparing to the Grid-based ART1 classifier. As data sets become larger, data mining processing time of the Grid-based 3-tier ART1 classifier more decrease than that of the Grid-based ART1 classifier. Computational Grid in bioinformatics applications gives a great promise of high performance processing with large-scale and geographically distributed bioDATA sets.", "paper_title": "Computational grid-based 3-tier ART1 data mining for bioinformatics applications", "paper_id": "WOS:000241106000060"}