{"auto_keywords": [{"score": 0.04566918275508669, "phrase": "ndr"}, {"score": 0.008948252045609267, "phrase": "web-based_system"}, {"score": 0.008870548577271715, "phrase": "direct_transmission"}, {"score": 0.007345296031105539, "phrase": "reporting_rate"}, {"score": 0.007093086622446838, "phrase": "sweden"}, {"score": 0.005361573623941753, "phrase": "reported_data"}, {"score": 0.00510209962539588, "phrase": "ndr."}, {"score": 0.00481495049065317, "phrase": "primary_healthcare"}, {"score": 0.004772966298144304, "phrase": "swedish_quality_register"}, {"score": 0.00447601516255334, "phrase": "primary_healthcare_centres"}, {"score": 0.004309265406782465, "phrase": "special_attention"}, {"score": 0.004197460986909444, "phrase": "reporting_system"}, {"score": 0.004041046382656947, "phrase": "swedish_primary_healthcare"}, {"score": 0.0036465500284763234, "phrase": "direct_transmission_system"}, {"score": 0.003401035500971973, "phrase": "main_outcome_measures"}, {"score": 0.003152082324187236, "phrase": "lowest_reporting_rate"}, {"score": 0.0031063318586138787, "phrase": "largest_phccs"}, {"score": 0.0030345041068691224, "phrase": "small_phccs"}, {"score": 0.0028370919298236724, "phrase": "personnel_resources"}, {"score": 0.0025760099091886165, "phrase": "direct_transmission_systems"}, {"score": 0.002487133563066256, "phrase": "web-based_systems"}, {"score": 0.0022981869222589058, "phrase": "higher_completeness"}, {"score": 0.002212389814581722, "phrase": "high_reporting_rate"}, {"score": 0.00216118788395907, "phrase": "lower_completeness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Primary healthcare", " Diabetes mellitus", " Registries", " Data quality", " Internet", " Sweden"], "paper_abstract": "Objective: The aims of this paper were to study the reporting rate and completeness of data reported from primary healthcare centres (PHCCs) in Sweden to the Swedish National Diabetes Register (NDR), with a special attention on the relation between these measures and the reporting system used by the PHCCs. Method: A national survey conducted in Swedish primary healthcare covering the year 2006. A questionnaire was used to collect data from 523 PHCCs. Data on 87,099 adult diabetic patients attending these PHCCs and reported to the NDR were obtained from the register. In Sweden, participation in the NDR is voluntary. The data were reported through the Internet, either online using a web-based system or by direct transmission. The main outcome measures were reporting rate and completeness of reported data. Results: Of the 523 PHCCs, almost two-thirds had reported <75% of their diabetic patients to the NDR. The lowest reporting rate was found among the largest PHCCs, while the highest was found among small PHCCs (p < 0.001). Reasons given for not reporting data to the NDR were lack of time and lack of personnel resources. Altogether, 73.1% of the PHCCs reported data to the NDR online using a web-based system, 20.5% used direct transmission and 6.3% used both systems. The PHCCs that reported data through direct transmission systems reported almost 70% of their diabetic patients to the NDR, while PHCCs using web-based systems reported 54% of their diabetic patients to the NDR. Adjusted for other factors, using direct transmission increased the reporting rate by 13.0 percentage points. However, the web-based system contributed to a higher completeness of data than the direct transmission system. Conclusions: A direct transmission system facilitates a high reporting rate to the register at the expense of lower completeness of the reported data. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Reporting systems, reporting rates and completeness of data reported from primary healthcare to a Swedish quality register - The National Diabetes Register", "paper_id": "WOS:000293729900006"}