{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parameterized_complexity"}, {"score": 0.04214205053460079, "phrase": "x_n_binary_matrix"}, {"score": 0.041584008648741164, "phrase": "positive_integer_d"}, {"score": 0.0047707093928203, "phrase": "pooling_design"}, {"score": 0.004472146692254812, "phrase": "dna_library_screening"}, {"score": 0.004370087541308677, "phrase": "key_process"}, {"score": 0.004309968592440261, "phrase": "high-quality_dna_libraries"}, {"score": 0.0032514447965530323, "phrase": "small_integer"}, {"score": 0.0030617935728586006, "phrase": "efficient_algorithms"}, {"score": 0.0028042741141125712, "phrase": "negative_answer"}, {"score": 0.0025329623864528317, "phrase": "parameterized_versions"}, {"score": 0.002429668083484833, "phrase": "immediate_implication"}, {"score": 0.0022355167967736326, "phrase": "running_time"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_computable_function"}], "paper_keywords": ["disjunct matrices", " DNA library screening", " parameterized complexity", " pooling designs", " separable matrices"], "paper_abstract": "Pooling design is a very helpful tool for reducing the number of tests in DNA library screening, which is a key process to obtain high-quality DNA libraries for studying gene functions. Three basic problems in pooling design are, given an m x n binary matrix and a positive integer d, to decide whether the matrix is d-separable ((d) over bar -separable, or d-disjunct). The three problems are all known to be coNP-complete. Since in most applications, d is a small integer compared to n, it is interesting to investigate whether there are efficient algorithms solving the above problems when the value of d is small. In this article, we give a negative answer to the above question by studying the parameterized complexity of these three problems, with d as the parameter. We show that the parameterized versions of all the three problems are co-W[2]-complete. An immediate implication of our results is that, given an m x n binary matrix and a positive integer d, a deterministic algorithm with running time f(d) x (mn)(O(1)) (where f is an arbitrary computable function) to decide whether the matrix is d-separable ((d) over bar -separable, or d-disjunct) should not be expected.", "paper_title": "On the Parameterized Complexity of Pooling Design", "paper_id": "WOS:000272865800003"}