{"auto_keywords": [{"score": 0.03647473080095426, "phrase": "widest_possible_range"}, {"score": 0.004613175917207636, "phrase": "digital_age"}, {"score": 0.0041984140090404985, "phrase": "greater_or_smaller_extent"}, {"score": 0.00409188863874203, "phrase": "interactive_systems"}, {"score": 0.003954030683259778, "phrase": "different_professions"}, {"score": 0.0038868464660354626, "phrase": "interest_groups"}, {"score": 0.003788196352457501, "phrase": "universal_access"}, {"score": 0.003692040748097991, "phrase": "different_names"}, {"score": 0.00350696416714684, "phrase": "interactive_system"}, {"score": 0.0032465423581390625, "phrase": "underlying_philosophy"}, {"score": 0.002553382046204689, "phrase": "target_audience"}, {"score": 0.0025099367332615794, "phrase": "international_standardization"}, {"score": 0.002150659690967412, "phrase": "overall_usability"}, {"score": 0.0021049977753042253, "phrase": "target_users"}], "paper_keywords": ["Accessibility", " Usability", " Disability", " Design for all", " Universal access", " Inclusive design"], "paper_abstract": "Accessibility and equal opportunities for all in the digital age have become increasingly important over the last decade. In one form or another, the concept of accessibility is being considered to a greater or smaller extent in most projects that develop interactive systems. However, the concept varies among different professions, cultures and interest groups. Design for all, universal access and inclusive design are all different names of approaches that largely focus on increasing the accessibility of the interactive system for the widest possible range of use. But, in what way do all these concepts differ and what is the underlying philosophy in all of these concepts? This paper aims at investigating the various concepts used for accessibility, its methodological and historical development and some philosophical aspects of the concept. It can be concluded that there is little or no consensus regarding the definition and use of the concept, and consequently, there is a risk of bringing less accessibility to the target audience. Particularly in international standardization the lack of consensus is striking. Based on this discussion, the authors argue for a much more thorough definition of the concept and discuss what effects it may have on measurability, conformance with standards and the overall usability for the widest possible range of target users.", "paper_title": "Universal design, inclusive design, accessible design, design for all: different concepts-one goal? On the concept of accessibility-historical, methodological and philosophical aspects", "paper_id": "WOS:000361003800004"}