{"auto_keywords": [{"score": 0.043344204212477686, "phrase": "vcg_payments"}, {"score": 0.04272039685896601, "phrase": "agents'_utilities"}, {"score": 0.015626237185549233, "phrase": "multi-unit_auctions"}, {"score": 0.008357061848816898, "phrase": "linear_allocation_mechanisms"}, {"score": 0.008232454355542226, "phrase": "optimization_technique"}, {"score": 0.00481495049065317, "phrase": "inefficient_allocation"}, {"score": 0.0046159158660556985, "phrase": "competing_agents"}, {"score": 0.004425072111844721, "phrase": "vcg_mechanism"}, {"score": 0.003692271726952282, "phrase": "large_fraction"}, {"score": 0.003507567662772987, "phrase": "non-deficit_property"}, {"score": 0.0034550163444256386, "phrase": "even_the_best_vcg_redistribution_mechanism"}, {"score": 0.0034032496750682753, "phrase": "substantial_fraction"}, {"score": 0.003312009953245191, "phrase": "low_total_utility"}, {"score": 0.0031273209718167072, "phrase": "strategy-proof_allocation_mechanisms"}, {"score": 0.0028823939507764238, "phrase": "net_effect"}, {"score": 0.002705199644897355, "phrase": "first-best_mechanism"}, {"score": 0.002664637473997972, "phrase": "agents'_total_utility"}, {"score": 0.0024707470443416793, "phrase": "linear_allocation_mechanism"}, {"score": 0.002448446849997207, "phrase": "payment_redistribution_rule"}, {"score": 0.0022771244331421586, "phrase": "burning_units"}, {"score": 0.002143529653780496, "phrase": "general_multi-unit_auctions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mechanism design", " Vickrey-Clarke-Groves mechanism", " Payment redistribution"], "paper_abstract": "For the problem of allocating one or more items among a group of competing agents, the Vickrey-Clarke-Groves (VCG) mechanism is strategy-proof and efficient. However, the VCG mechanism is not strongly budget balanced: in general, value flows out of the system of agents in the form of VCG payments, which reduces the agents' utilities. In many settings, the objective is to maximize the sum of the agents' utilities (taking payments into account). For this purpose, several VCG redistribution mechanisms have been proposed that redistribute a large fraction of the VCG payments back to the agents, in a way that maintains strategy-proofness and the non-deficit property. Unfortunately, sometimes even the best VCG redistribution mechanism fails to redistribute a substantial fraction of the VCG payments. This results in a low total utility for the agents, even though the items are allocated efficiently. In this paper, we study strategy-proof allocation mechanisms that do not always allocate the items efficiently. It turns out that by allocating inefficiently, more payment can sometimes be redistributed, so that the net effect is an increase in the sum of the agents' utilities. Our objective is to design mechanisms that are competitive against the first-best mechanism in terms of the agents' total utility. We first study multi-unit auctions with unit demand. We characterize the family of linear allocation mechanisms. We propose an optimization technique for simultaneously finding a linear allocation mechanism and a payment redistribution rule, which together are optimal. With the help of this technique, we also analytically characterize several competitive mechanisms, which are based on burning units and partitioning the agents into groups. Finally, we extend the definition of linear allocation mechanisms and the optimization technique to general multi-unit auctions. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Better redistribution with inefficient allocation in multi-unit auctions", "paper_id": "WOS:000342253000012"}