{"auto_keywords": [{"score": 0.03887217598190441, "phrase": "water_molecules"}, {"score": 0.008534233094711019, "phrase": "pyrenetetrasulfonate_anions"}, {"score": 0.006725259972882887, "phrase": "interlayer_distance"}, {"score": 0.00481495049065317, "phrase": "molecular_simulations"}, {"score": 0.004743594110762319, "phrase": "experimental_data"}, {"score": 0.004126349202545883, "phrase": "appropriate_models"}, {"score": 0.0040048667115255, "phrase": "calculated_and_measured_diffraction_patterns"}, {"score": 0.003643185395780667, "phrase": "interlayer_space"}, {"score": 0.0035891316580885665, "phrase": "host_structure"}, {"score": 0.0034834098902271626, "phrase": "large_variability"}, {"score": 0.003380791705551809, "phrase": "guest_species"}, {"score": 0.0025571463140118805, "phrase": "layered_double_hydroxides"}, {"score": 0.0021049977753042253, "phrase": "water_content"}], "paper_keywords": ["Hydrotalcite", " Pyrenetetrasulfonate", " Intercalation", " Structure analysis", " Molecular simulations"], "paper_abstract": "The structure of pyrenetetrasulfonate intercalated with hydrotalcite, having the formula [Zn0.68Al0.32(OH)(2)][(C16H6O12S4)(0.08) center dot x H2O], was proposed based on molecular simulations combined with experimental data (X-ray powder diffraction, thermogravimetry). Calculations were done for samples kept at various relative humidities (0%, 84%, 98%). The appropriate models were selected from comparison of calculated and measured diffraction patterns. Modelling revealed the arrangement of pyrenetetrasulfonate anions, and the positions and the amount of water molecules in the interlayer space of the host structure. The results confirmed a large variability in the arrangement of the guest species. In the sample without water molecules (0% RH), pyrenetetrasulfonate anions formed a layer at the centre of the interlayer distance. For the sample kept at 84% RH, the anions formed two layers at the thirds of the interlayer. For the sample kept at 98% RH, the anions became tilted with respect to the layered double hydroxides (LDH) layers and are less organised. Water molecules were arranged in three distinct planes: one in the middle and two at the quarters of interlayer distance. The number of water molecules obtained by the modelling basically agrees with the water content as measured by thermogravimetry.", "paper_title": "Structure analysis of hydrotalcite intercalated with pyrenetetrasulfonate; experiments and molecular modelling", "paper_id": "WOS:000260376100002"}