{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "sensor_nodes"}, {"score": 0.008091387229479713, "phrase": "end-to-end_security"}, {"score": 0.005090165616711275, "phrase": "key_management"}, {"score": 0.00481495049065317, "phrase": "end-to-end_secure_communication"}, {"score": 0.004567596860086148, "phrase": "evolving_web"}, {"score": 0.004478136197044989, "phrase": "wisdom_web_of"}, {"score": 0.004257360656055417, "phrase": "wireless_sensor_networks"}, {"score": 0.00416478405812793, "phrase": "internet_nodes"}, {"score": 0.003994376267048472, "phrase": "human_users"}, {"score": 0.003625942756259761, "phrase": "data_communication"}, {"score": 0.003610025051433315, "phrase": "internet_user_nodes"}, {"score": 0.0035005338004709787, "phrase": "traditional_security_protocols"}, {"score": 0.0034394597250146717, "phrase": "symmetric_authentication"}, {"score": 0.0034018288705284427, "phrase": "public_key_algorithms"}, {"score": 0.0033131804981786747, "phrase": "resource_constraints"}, {"score": 0.0031565959573536194, "phrase": "heavy_duty"}, {"score": 0.003142732162296465, "phrase": "regular_servers"}, {"score": 0.0030946851522457674, "phrase": "current_security_mechanisms"}, {"score": 0.003007389443770562, "phrase": "neighboring_nodes"}, {"score": 0.002987595484581518, "phrase": "link_layer"}, {"score": 0.00284009509859163, "phrase": "end-to-end_secure_communication_scheme"}, {"score": 0.0027782510491938315, "phrase": "asymmetric_approach"}, {"score": 0.002729744174693491, "phrase": "symmetric_key_encryption"}, {"score": 0.002693919110230191, "phrase": "great_part"}, {"score": 0.0026527154263947814, "phrase": "access_control"}, {"score": 0.002555247330102505, "phrase": "energy_consumption"}, {"score": 0.0024776677004255104, "phrase": "user_identities"}, {"score": 0.0024667783849055634, "phrase": "key_negotiation_materials"}, {"score": 0.0023294867572824147, "phrase": "quantitative_analysis"}, {"score": 0.002142426911242168, "phrase": "similar_schemes"}, {"score": 0.0021189566159807533, "phrase": "secure_sockets"}, {"score": 0.00210499986523677, "phrase": "ssl"}], "paper_keywords": ["Internet of things (IoT)", " web of things (WoT)", " wisdom web of things (W2T)", " wireless sensor networks (WSNs)", " security"], "paper_abstract": "In the paradigms of the Internet of Things (IoT) as well as the evolving Web of Things (WoT) and the emerging Wisdom Web of Things (W2T), not only can the data collected by the sensor nodes (i.e., the things) in the wireless sensor networks (WSNs) be transmitted to and processed at Internet nodes and subsequently transformed into information, knowledge, wisdom and eventually into services to serve humans, but human users can also access, control and manage the sensor nodes in the WSNs through nodes in the Internet. Since data are the basis for enabling applications and services in W2T, it becomes imperative that enabling technologies for end-to-end security be developed to secure data communication between Internet user nodes and sensor server nodes to protect the exchange of data. However, traditional security protocols developed for the Internet rely mostly on symmetric authentication and key management based on public key algorithms, thus are deemed to be unsuitable for WSNs due to resource constraints in the sensor nodes. Specifically, acting as the server nodes in this scenario, sensor nodes cannot take on the heavy duty like regular servers in the Internet. Meanwhile, current security mechanisms developed for WSNs have mainly focused on the establishment of keys between neighboring nodes at the link layer and thus are not considered to be effective for end-to-end security in the W2T scenario. In this paper, we propose an end-to-end secure communication scheme for W2T in WSNs in which we follow an asymmetric approach for authentication and key management using signcryption and symmetric key encryption. In our proposed scheme, a great part of the work for authentication and access control is shifted to a gateway between a WSN and the Internet to reduce the burden and energy consumption in the sensor nodes. In addition, our scheme can ensure the privacy of user identities and key negotiation materials, and denial of service (DoS) attacks targeted at the sensor nodes can be effectively blocked at the gateway. We will also conduct quantitative analysis and an experiment to show that our proposed scheme can enhance the effectiveness of end-to-end security while reducing the cost of sensor nodes in terms of computation, communication and storage overhead as well as the latency of handshaking compared to similar schemes that are based on Secure Sockets Layer (SSL) and Transport Layer Security (TLS) protocols.", "paper_title": "Enabling end-to-end secure communication between wireless sensor networks and the Internet", "paper_id": "WOS:000320330100009"}