{"auto_keywords": [{"score": 0.04341840524677067, "phrase": "halogen_bonds"}, {"score": 0.01213260797345404, "phrase": "halogen_bond"}, {"score": 0.007740489563401459, "phrase": "drug-target_binding_affinity"}, {"score": 0.005847361214000799, "phrase": "heavy_organohalogens"}, {"score": 0.005749300768700681, "phrase": "drug_discovery"}, {"score": 0.005710535945170511, "phrase": "development_process"}, {"score": 0.0046389067165295466, "phrase": "great_deal"}, {"score": 0.004545598514506788, "phrase": "hit-to-lead-to-candidate_optimization"}, {"score": 0.003996536734752314, "phrase": "possible_roles"}, {"score": 0.0039028497942174777, "phrase": "binding_affinity"}, {"score": 0.003837273003552065, "phrase": "detailed_database_survey"}, {"score": 0.0038113506617834087, "phrase": "quantum_chemistry_calculation"}, {"score": 0.0037856027705164817, "phrase": "close_attention"}, {"score": 0.0034079696245884073, "phrase": "nontarget_biopolymers"}, {"score": 0.003006087482938274, "phrase": "heavy_halogens"}, {"score": 0.002895986736522535, "phrase": "lead_optimization"}, {"score": 0.002808904739908364, "phrase": "pdb"}, {"score": 0.0024690950486552653, "phrase": "plasma_transport_proteins"}, {"score": 0.0022452462028184654, "phrase": "valuable_approach"}, {"score": 0.00222249726328354, "phrase": "ligand_bioactivity"}], "paper_keywords": [""], "paper_abstract": "Halogen bond has attracted a great deal of attention in the past years for hit-to-lead-to-candidate optimization aiming at improving drug-target binding affinity. In general, heavy organohalogens (i.e., organochlorines, organobromines, and organoiodines) are capable of forming halogen bonds while organofluorines are not. In order to explore the possible roles that halogen bonds could play beyond improving binding affinity, we performed a detailed database survey and quantum chemistry calculation with close attention paid to (1) the change of the ratio of heavy organohalogens to organofluorines along the drug discovery and development process and (2) the halogen bonds between organohalogens and nonbiopolymers or nontarget biopolymers. Our database survey revealed that (1) an obviously increasing trend of the ratio of heavy organohalogens to organofluorines was observed along the drug discovery and development process, illustrating that more organofluorines are worn and eliminated than heavy organohalogens during the process, suggesting that heavy halogens with the capability of forming halogen bonds should have priority for lead optimization; and (2) more than 16% of the halogen bonds in PDB are formed between organohalogens and water, and nearly 20% of the halogen bonds are formed with the proteins that are involved in the ADME/T process. Our QM/MM calculations validated the contribution of the halogen bond to the binding between organohalogens and plasma transport proteins. Thus, halogen bonds could play roles not only in improving drug-target binding affinity but also in tuning ADME/T property. Therefore, we suggest that albeit halogenation is a valuable approach for improving ligand bioactivity, more attention should be paid in the future to the application of the halogen bond for ligand ADME/T property optimization.", "paper_title": "Halogen Bond: Its Role beyond Drug-Target Binding Affinity for Drug Discovery and Development", "paper_id": "WOS:000330542800008"}