{"auto_keywords": [{"score": 0.040669616419806646, "phrase": "spi_initiative"}, {"score": 0.014746090762170478, "phrase": "human_factors"}, {"score": 0.013396020907000603, "phrase": "organizational_change_management"}, {"score": 0.00481495049065317, "phrase": "disruptive_factor"}, {"score": 0.004619027561771169, "phrase": "software_process_improvement"}, {"score": 0.003929689573550262, "phrase": "essential_knowledge_area"}, {"score": 0.0035994372026264478, "phrase": "high_degree"}, {"score": 0.003517223847512266, "phrase": "spi_initiatives"}, {"score": 0.0033274664434575136, "phrase": "gamification_discipline"}, {"score": 0.0032066653632708965, "phrase": "people's_motivation"}, {"score": 0.0028566300478906916, "phrase": "gamification_framework"}, {"score": 0.0025447065763362984, "phrase": "transverse_nature"}, {"score": 0.002363150587804677, "phrase": "spi._gamification_framework_guidelines"}, {"score": 0.00229844995872581, "phrase": "qualitative_methods"}, {"score": 0.0021049977753042253, "phrase": "software_organization"}], "paper_keywords": ["Gamification", " Software Process Improvement", " Organizational Change Management"], "paper_abstract": "For any Software Process Improvement (SPI) initiative to succeed human factors, in particular, motivation and commitment of the people involved should be kept in mind. In fact, Organizational Change Management (OCM) has been identified as an essential knowledge area for any SPI initiative. However, enough attention is still not given to the human factors and therefore, the high degree of failures in the SPI initiatives is directly linked to a lack of commitment and motivation. Gamification discipline allows us to define mechanisms that drive people's motivation and commitment towards the development of tasks in order to encourage and accelerate the acceptance of an SPI initiative. In this paper, a gamification framework oriented to both organization needs and software practitioners groups involved in an SPI initiative is defined. This framework tries to take advantage of the transverse nature of gamification in order to apply its Critical Success Factors (CSF) to the organizational change management of an SPI. Gamification framework guidelines have been validated by some qualitative methods. Results show some limitations that threaten the reliability of this validation. These require further empirical validation of a software organization.", "paper_title": "Gamification as a Disruptive Factor in Software Process Improvement Initiatives", "paper_id": "WOS:000344576000005"}