{"auto_keywords": [{"score": 0.047547044341195395, "phrase": "medline"}, {"score": 0.041018926689725024, "phrase": "author-ity_model"}, {"score": 0.040427170396335976, "phrase": "author_names"}, {"score": 0.00481495049065317, "phrase": "medline._background"}, {"score": 0.004372002674739612, "phrase": "shared_title_words"}, {"score": 0.004345706062641742, "phrase": "journal_name"}, {"score": 0.00381691770211996, "phrase": "vast_majority"}, {"score": 0.0037258582339644514, "phrase": "first_names"}, {"score": 0.0036811433915589216, "phrase": "email_addresses"}, {"score": 0.003626000977962191, "phrase": "specific_last_names"}, {"score": 0.00360417515510547, "phrase": "affiliation_words"}, {"score": 0.0035609154384221567, "phrase": "large_unbiased_training_sets"}, {"score": 0.003507567662772987, "phrase": "new_methods"}, {"score": 0.003465463460811278, "phrase": "prior_probability"}, {"score": 0.0033220260950896537, "phrase": "computing_clusters"}, {"score": 0.0032722454818973853, "phrase": "inferred_author-individuals"}, {"score": 0.003232956879952914, "phrase": "pairwise_comparisons"}, {"score": 0.00306189690236109, "phrase": "last_name"}, {"score": 0.0028477727736832283, "phrase": "inferred_author-individual_clusters"}, {"score": 0.002404447017429959, "phrase": "author_name_disambiguation"}, {"score": 0.002389956401870098, "phrase": "information_retrieval"}, {"score": 0.0023755529073496394, "phrase": "data_integration"}, {"score": 0.002256567862969091, "phrase": "new_data_mining"}, {"score": 0.0022429664506287577, "phrase": "social_network_tools"}, {"score": 0.0021960024679620886, "phrase": "scholarly_publishing"}, {"score": 0.0021049977753042253, "phrase": "nonprofit_academic_research"}], "paper_keywords": ["Name disambiguation", " bibliographic databases"], "paper_abstract": "Background: We recently described \"Author-ity,\" a model for estimating the probability that two articles in MEDLINE, sharing the same author name, were written by the same individual. Features include shared title words, journal name, coauthors, medical subject headings, language, affiliations, and author name features (middle initial, suffix, and prevalence in MEDLINE). Here we test the hypothesis that the Author-ity model will suffice to disambiguate author names for the vast majority of articles in MEDLINE. Methods: Enhancements include: (a) incorporating first names and their variants, email addresses, and correlations between specific last names and affiliation words; (b) new methods of generating large unbiased training sets; (c) new methods for estimating the prior probability; (d) a weighted least squares algorithm for correcting transitivity violations; and (e) a maximum likelihood based agglomerative algorithm for computing clusters of articles that represent inferred author-individuals. Results: Pairwise comparisons were computed for all author names on all 15.3 million articles in MEDLINE (2006 baseline), that share last name and first initial, to create Author-ity 2006, a database that has each name on each article assigned to one of 6.7 million inferred author-individual clusters. Recall is estimated at similar to 98.8%. Lumping (putting two different individuals into the same cluster) affects similar to 0.5% of clusters, whereas splitting (assigning articles written by the same individual to >1 cluster) affects similar to 2% of articles. Impact: The Author-ity model can be applied generally to other bibliographic databases. Author name disambiguation allows information retrieval and data integration to become person-centered, not just document-centered, setting the stage for new data mining and social network tools that will facilitate the analysis of scholarly publishing and collaboration behavior. Availability: The Author-ity 2006 database is available for nonprofit academic research, and can be freely queried via http://arrowsmith.psych.uic.edu.", "paper_title": "Author Name Disambiguation in MEDLINE", "paper_id": "WOS:000208168000001"}