{"auto_keywords": [{"score": 0.004747429622531595, "phrase": "robust_shape_matching"}, {"score": 0.004300453431933622, "phrase": "existing_systems"}, {"score": 0.004180622964109706, "phrase": "complex_models"}, {"score": 0.003310813458610484, "phrase": "hand_drawings"}, {"score": 0.0029565620771207003, "phrase": "dense_sampling"}, {"score": 0.002833689453299307, "phrase": "high_computational_cost"}, {"score": 0.002735194789581153, "phrase": "critical_acceleration_methods"}, {"score": 0.002677744558540711, "phrase": "interactive_performance"}, {"score": 0.002640114583897493, "phrase": "precomputing_knn_graphs"}, {"score": 0.002548331088496964, "phrase": "neighboring_contour_images"}, {"score": 0.0024947959375982614, "phrase": "fast_online_shape_alignment"}, {"score": 0.0024423826953133844, "phrase": "sampling_and_shape_registration"}, {"score": 0.002275477757478827, "phrase": "multi-core_platforms"}], "paper_keywords": [""], "paper_abstract": "We propose a sketch-based 3D shape retrieval system that is substantially more discriminative and robust than existing systems, especially for complex models. The power of our system comes from a combination of a contour-based 2D shape representation and a robust sampling-based shape matching scheme. They are defined over discriminative local features and applicable for partial sketches; robust to noise and distortions in hand drawings; and consistent when strokes are added progressively. Our robust shape matching, however, requires dense sampling and registration and incurs a high computational cost. We thus devise critical acceleration methods to achieve interactive performance: precomputing kNN graphs that record transformations between neighboring contour images and enable fast online shape alignment; pruning sampling and shape registration strategically and hierarchically; and parallelizing shape matching on multi-core platforms or GPUs. We demonstrate the effectiveness of our system through various experiments, comparisons, and user studies.", "paper_title": "Discriminative Sketch-based 3D Model Retrieval via Robust Shape Matching", "paper_id": "WOS:000296915400016"}