{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "l-fuzzy_left_r-modules"}, {"score": 0.004608730887154718, "phrase": "purpose_-_the_purpose"}, {"score": 0.004435514622798228, "phrase": "free_l-fuzzy_left_r-module"}, {"score": 0.004176321608449849, "phrase": "general_description"}, {"score": 0.003380657894164033, "phrase": "free_l-fuzzy_left_r-modules"}, {"score": 0.003264010423431402, "phrase": "category_theory"}, {"score": 0.0031584367879334114, "phrase": "existent_quality"}, {"score": 0.0031240075437664314, "phrase": "unique_quality"}, {"score": 0.0030899524399043863, "phrase": "material_structure"}, {"score": 0.0027239390917424898, "phrase": "free_object"}, {"score": 0.002454432810862053, "phrase": "fuzzy_free_functor"}, {"score": 0.0023749823753904204, "phrase": "fuzzy_underlying_functor"}, {"score": 0.0021049977753042253, "phrase": "new_class"}], "paper_keywords": ["Fuzzy logic", " Cybernetics", " Systems theory"], "paper_abstract": "Purpose - The purpose of this paper is to study free L-fuzzy left R-module, using the language of categories and functors for the general description of L-fuzzy left R-modules generated by L-fuzzy set. In the language of categories and functors, an L-fuzzy left R-modules generated by L-fuzzy set is called a free object in the category of L-fuzzy left R-modules determined by L-fuzzy set. Design/methodology/approach - Category theory is used to study the existent quality, unique quality and material structure of L-fuzzy left R-modules generated by L-fuzzy set. Findings - The paper gives the uniqueness, structure and existence theorems of free object in the category of L-fuzzy left R-modules determined by L-fuzzy set, and the authors prove that the fuzzy free functor is left adjoint to the fuzzy underlying functor. Research limitations/implications - Some property of free L-fuzzy left R-modules will need to be further researched. Originality/value - The paper defines a new class of L-fuzzy left R-modules, i.e. free L-fuzzy left R-modules, research and explore free L-fuzzy left R-modules in theory.", "paper_title": "Free object in the category of L-fuzzy left R-modules determined by L-fuzzy set", "paper_id": "WOS:000267416500027"}