{"auto_keywords": [{"score": 0.04959718565226427, "phrase": "sociological_discourse"}, {"score": 0.01299478247540378, "phrase": "social_systems"}, {"score": 0.010809267789594207, "phrase": "different_perspectives"}, {"score": 0.010279127216765164, "phrase": "possible_observations"}, {"score": 0.010040614282855236, "phrase": "second-order_observations"}, {"score": 0.007521659147604264, "phrase": "social_systems_theory"}, {"score": 0.00481495049065317, "phrase": "second-order_observer"}, {"score": 0.004639612079116459, "phrase": "spencer_brown's_laws"}, {"score": 0.0045160988337296605, "phrase": "luhmann's_social_systems_theory"}, {"score": 0.0043663006236597975, "phrase": "sociological_design"}, {"score": 0.00384083110935486, "phrase": "\"the_observer"}, {"score": 0.003763827319426842, "phrase": "systems_theory"}, {"score": 0.0037133478610481994, "phrase": "historical_detail"}, {"score": 0.003541923233726252, "phrase": "human_language"}, {"score": 0.0033330581836898032, "phrase": "findings_-_reflexivity"}, {"score": 0.0032772504899699416, "phrase": "participant_observers"}, {"score": 0.0032442139425705578, "phrase": "external_observer"}, {"score": 0.002259883463607508, "phrase": "different_discourses"}, {"score": 0.0021049977753042253, "phrase": "empirical_approach"}], "paper_keywords": ["sociocybernetics", " social systems", " communication", " expectancy theory"], "paper_abstract": "Purpose - In the tradition of Spencer Brown's Laws of Form, observation was defined in Luhmann's social systems theory as the designation of a distinction. In the sociological design, however, the designation specifies only a category for the observation. The distinction between observation and expectation enables the sociologist to appreciate the processing of meaning in social systems. Seeks to address this issue. Design/methodology/approach - The specification of \"the observer\" in the tradition of systems theory is analyzed in historical detail. Inconsistencies and differences in perspectives are explicated, and the specificity of human language is further specified. The processing of meaning in social systems adds another layer to the communication. Findings - Reflexivity about the different perspectives of participant observers and an external observer is fundamental to the sociological discourse. The ranges of possible observations from different perspectives can be considered as second-order observations or, equivalently, as the specification of an uncertainty in the observations. This specification of an uncertainty provides an expectation. The expectation can be provided with (one or more) values by observations. The significance of observations can be tested when the expectations are properly specified. Originality/value - The expectations (second-order observations) are structured and therefore systemic attributes to the discourse. However, the metaphor of a (meta-)biological observer has disturbed the translation of social systems theory into sociological discourse. Different discourses specify other expectations about possible observations. By specifying second-order observations as expectations, social systems theory and sociocybernetics can combine the constructivist with an empirical approach.", "paper_title": "The biological metaphor of a second-order observer and the sociological discourse", "paper_id": "WOS:000238081100020"}