{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_grid"}, {"score": 0.03671575206530073, "phrase": "cost-based_online_scheduling_algorithm"}, {"score": 0.011987005463219342, "phrase": "theoretical_guarantee"}, {"score": 0.010929164544591126, "phrase": "grid_environment"}, {"score": 0.00465944657565638, "phrase": "promising_platform"}, {"score": 0.00441130431691048, "phrase": "computational_grid_environments"}, {"score": 0.004108288481894523, "phrase": "cpu_cycle"}, {"score": 0.0040192915527630995, "phrase": "communication_network"}, {"score": 0.003953806321226277, "phrase": "data_storage"}, {"score": 0.0032107911131811057, "phrase": "scheduling_framework"}, {"score": 0.0030064251340251196, "phrase": "online_job_model"}, {"score": 0.0027691111795848183, "phrase": "exponential_functions"}, {"score": 0.002508867228980776, "phrase": "optimal_offline_algorithm"}, {"score": 0.0023749823753904204, "phrase": "grid_simulation_environment"}, {"score": 0.002273025527678093, "phrase": "presented_algorithm"}, {"score": 0.0021994343316143125, "phrase": "experimental_results"}], "paper_keywords": ["computational grid", " scheduling algorithm", " online scheduling", " cost-based method", " simulation"], "paper_abstract": "The computational grid provides a promising platform for the deployment of various high-performance computing applications. Problem in implementing computational grid environments is how to effectively use various resources in the system, such as CPU cycle, memory, communication network, and data storage. There are many effective heuristic algorithms for scheduling in the computational grid, however most scheduling strategies have no theoretical guarantee at all. In this paper, a cost-based online scheduling algorithm is presented for job assignment in the grid environment with theoretical guarantee. Firstly, a scheduling framework is described, where the grid environment is characterized, and the online job model is defined. Secondly, the cost-based online scheduling algorithm is presented where costs of resources are exponential functions of their loads, and the performance of this algorithm is theoretically analyzed against the performance of the optimal offline algorithm. Finally, we implement the algorithm in the grid simulation environment, and compare the performance of the presented algorithm with the other three algorithms, and experimental results indicate that the cost-based online scheduling algorithm can outperform the other three online algorithms.", "paper_title": "An online scheduling algorithm for assigning jobs in the computational grid", "paper_id": "WOS:000235508800025"}