{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "quantitative_structure-property_relations_models"}, {"score": 0.0039624406239057944, "phrase": "common_understanding"}, {"score": 0.0038833278847237858, "phrase": "necessary_degree"}, {"score": 0.0037549546301384336, "phrase": "molecular_structure"}, {"score": 0.0036064757492752703, "phrase": "reliable_descriptor_evaluation"}, {"score": 0.0035344448639851827, "phrase": "computational_methods"}, {"score": 0.00344062888674746, "phrase": "simplified_molecular_mechanics"}, {"score": 0.0033718991936259038, "phrase": "rigorous_ab_initio_programs"}, {"score": 0.002927626967420519, "phrase": "molecular_structures"}, {"score": 0.002869115451202179, "phrase": "different_computational_methods"}, {"score": 0.002558909812664716, "phrase": "systematically_erroneous_descriptor_values"}, {"score": 0.0024576084154573396, "phrase": "inferred_structure_property_relations"}, {"score": 0.002282166507956957, "phrase": "fundamental_problem"}, {"score": 0.0021049977753042253, "phrase": "generally_accepted_property_prediction_method"}], "paper_keywords": [""], "paper_abstract": "Quantitative structure property relations (QSPR) employing descriptors derived from the three-dimensional (3D) molecular structure are frequently applied for property prediction in various fields of research. However, there is no common understanding of the necessary degree of detail to which molecular structure has to be known for reliable descriptor evaluation, but computational methods used vary from simplified molecular mechanics up to rigorous ab initio programs In order to quantify the yet unknown error due to this heterogeneity, widely used 3D molecular descriptors from diverse fields of application are evaluated for molecular structures computed by different computational methods. The results clearly indicate that the widespread, exclusive use of the most stable molecular conformation as well as too simplistic computational methods yield systematically erroneous descriptor values with misleading information for the inferred structure property relations. Thus, generating an awareness and understanding of this fundamental problem is considered an important first step to make 3D QSPR a generally accepted property prediction method.", "paper_title": "What is Wrong with Quantitative Structure-Property Relations Models Based on Three-Dimensional Descriptors?", "paper_id": "WOS:000308254200009"}