{"auto_keywords": [{"score": 0.043016758318153984, "phrase": "eulerian_grid"}, {"score": 0.04215833196561754, "phrase": "effective_radius"}, {"score": 0.015351724186734288, "phrase": "immersed_boundary_method"}, {"score": 0.015261059098791599, "phrase": "stokes_flow"}, {"score": 0.014728036525067954, "phrase": "single_lagrangian_point"}, {"score": 0.014087488123715486, "phrase": "slender_body"}, {"score": 0.01392136401945069, "phrase": "new_immersed_boundary_method"}, {"score": 0.011614914458774588, "phrase": "lagrangian_points"}, {"score": 0.00977377990327404, "phrase": "particular_radius"}, {"score": 0.00481495049065317, "phrase": "simple_method"}, {"score": 0.004743423032820112, "phrase": "slender_bodies"}, {"score": 0.004631172395820296, "phrase": "unbounded_domain"}, {"score": 0.004401342842183475, "phrase": "one-dimensional_array"}, {"score": 0.004233600580205959, "phrase": "stokes"}, {"score": 0.004182871028054003, "phrase": "numerical_parameter"}, {"score": 0.003987126862293129, "phrase": "immersed_sphere"}, {"score": 0.003813263683669708, "phrase": "lagrangian"}, {"score": 0.003688316529071842, "phrase": "numerical_method"}, {"score": 0.0036443694410100507, "phrase": "discretized_stokes_equations"}, {"score": 0.003611751858608048, "phrase": "unbounded_eulerian_grid"}, {"score": 0.0035687137873965684, "phrase": "arbitrary_configuration"}, {"score": 0.0032716011062067286, "phrase": "rigid_cylinders"}, {"score": 0.002816092821027267, "phrase": "linear_array"}, {"score": 0.0024093494406195386, "phrase": "simple_and_natural_way"}, {"score": 0.002188750508959063, "phrase": "approximate_delta_functions"}, {"score": 0.002124036931047162, "phrase": "higher_order_delta_functions"}], "paper_keywords": ["immersed boundary method", " Stokes equations", " slender-body theory", " numerical methods"], "paper_abstract": "We test the efficacy of using a single Lagrangian point to represent a sphere, and a one-dimensional array of such points to represent a slender body, in a new immersed boundary method for Stokes flow. A numerical parameter, the spacing of the Eulerian grid, is used to determine the effective radius of the immersed sphere or slender body. Such representations are much less expensive computationally than those with two or three-dimensional meshes of Lagrangian points. To perform this test, we develop a numerical method to solve the discretized Stokes equations on an unbounded Eulerian grid which contains an arbitrary configuration of Lagrangian points that apply force to the fluid and that move with the fluid. We compare results computed with this new immersed boundary method to known results for spheres and rigid cylinders in Stokes flow in R-3. We find that, for certain choices of parameters, the interactions with the fluid of a single Lagrangian point accurately replicate those of a sphere of some particular radius, independent of the location of the point with respect to the Eulerian grid. The interactions of a linear array of Lagrangian points, for certain choices of parameters, accurately replicate those of a cylinder of some particular radius, independent of the position and orientation of the array with respect to the Eulerian grid. The effective radius of the sphere and the effective radius of the cylinder turn out to be related in a simple and natural way. Our results suggest recipes for choosing parameters that should be useful to practitioners. One surprising result is that one must not use too many Lagrangian points in an array. Another is that the approximate delta functions traditionally used in the immersed boundary method perform much better than higher order delta functions with the same support. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Validation of a simple method for representing spheres and slender bodies in an immersed boundary method for Stokes flow on an unbounded domain", "paper_id": "WOS:000256501800003"}