{"auto_keywords": [{"score": 0.004752221133109136, "phrase": "relational_database_management_systems"}, {"score": 0.004598933498016774, "phrase": "schema_evolution_issues"}, {"score": 0.004539005582217309, "phrase": "clinical_informatics_and_bioinformatics_communities"}, {"score": 0.00433531459712787, "phrase": "vertical_or_object-attribute-value-based_database_schemas"}, {"score": 0.003802135020791801, "phrase": "biomedical_data"}, {"score": 0.0036553070575015344, "phrase": "conventional_relational_techniques"}, {"score": 0.003356275163203055, "phrase": "relational_database_engine"}, {"score": 0.0030414140732789186, "phrase": "schema-modification_operations"}, {"score": 0.00266693888510356, "phrase": "biomedical_informatics_researchers"}, {"score": 0.002416589459425828, "phrase": "performance_results"}, {"score": 0.002323142666222693, "phrase": "promising_technique"}], "paper_keywords": [""], "paper_abstract": "Data sparsity and schema evolution issues affecting clinical informatics and bioinformatics communities have led to the adoption of vertical or object-attribute-value-based database schemas to overcome limitations posed when using conventional relational database technology. This paper explores these issues and discusses why biomedical data are difficult to model using conventional relational techniques. The authors propose a solution to these obstacles based on a relational database engine using a sparse, column-store architecture. The authors provide benchmarks comparing the performance of queries and schema-modification operations using three different strategies: (1) the standard conventional relational design; (2) past approaches used by biomedical informatics researchers; and (3) their sparse, column-store architecture. The performance results show that their architecture is a promising technique for storing and processing many types of data that are not handled well by the other two semantic data models.", "paper_title": "Dynamic tables: An architecture for managing evolving, heterogeneous biomedical data in relational database management systems", "paper_id": "WOS:000243571400012"}