{"auto_keywords": [{"score": 0.04098185870301805, "phrase": "twitter"}, {"score": 0.00683181494104852, "phrase": "southwest"}, {"score": 0.00481495049065317, "phrase": "friendly_skies"}, {"score": 0.004783607451937166, "phrase": "information_exchange"}, {"score": 0.004752467467173928, "phrase": "twitter_users"}, {"score": 0.004540064673326908, "phrase": "airline_users'_microblog_postings"}, {"score": 0.004322967486451877, "phrase": "airline_products"}, {"score": 0.004023120753104693, "phrase": "airline_services"}, {"score": 0.0037195959056754444, "phrase": "malaysia_airlines"}, {"score": 0.003695356628334569, "phrase": "jet_blue"}, {"score": 0.0034727910226495227, "phrase": "content_analysis"}, {"score": 0.0033282568196683886, "phrase": "communication_exchanges"}, {"score": 0.0029975152932436144, "phrase": "general_information"}, {"score": 0.0029392523663327253, "phrase": "personal_updates"}, {"score": 0.0028633212043378564, "phrase": "high_number"}, {"score": 0.0028446460307503343, "phrase": "attention-seeking_postings"}, {"score": 0.0027984877593293786, "phrase": "user_issues"}, {"score": 0.0026384167183586015, "phrase": "users'_postings"}, {"score": 0.002153799620707991, "phrase": "customer_relationship_management"}], "paper_keywords": ["Microblogs", " Twitter", " Social media", " Information exchange", " User-generated content"], "paper_abstract": "Purpose - The purpose of this study is to investigate airline users' microblog postings pertaining to their travel-related information exchange so as to assess their wants, preferences and feedback about airline products and services. Examining such real-time information exchange is important as users rely on this for various purposes such as seeking help and evaluating the airline services before purchasing. Design/inethodology/approach - This study uses Twitter, a popular microblog service. An analysis of 8,978 postings that mention three specific airlines i.e. Malaysia Airlines, Jet Blue and Southwest as well as 260 airline postings on their official Twitter accounts is undertaken. The types of postings were ascertained via content analysis. Additionally, the postings were also analyzed to uncover types of communication exchanges between airlines and their users. Findings - The findings suggest that microblogs were primarily used to share compliments, while airlines used microblogs mainly for marketing. Other uses such as sharing general information, asking questions and providing personal updates were also uncovered. Additionally, a high number of attention-seeking postings were found that highlighted user issues and concerns. Further, the airlines being studied did not appear to be as responsive to users' postings as expected. Originality/value - The findings broaden the understanding of what users frequently discuss on microblogs when they communicate about airlines. Next, this study indicates that users adopt microblogs to offer recommendations and share their concerns so that their communication can reach airlines in near real-time. Moreover, this study also suggests that airlines could incorporate this medium for customer relationship management to better meet the needs of their customers.", "paper_title": "Tweeting the friendly skies Investigating information exchange among Twitter users about airlines", "paper_id": "WOS:000302485800002"}