{"auto_keywords": [{"score": 0.03777132867708788, "phrase": "matthew_effect"}, {"score": 0.004685855684376706, "phrase": "different_perspectives"}, {"score": 0.0044380306186704195, "phrase": "citations"}, {"score": 0.0037493114715625784, "phrase": "numerous_relations"}, {"score": 0.0034180189629740426, "phrase": "precise_definition"}, {"score": 0.003115908199991072, "phrase": "matthew_phenomenon"}, {"score": 0.0028249975318149468, "phrase": "deserved_citations"}, {"score": 0.0025611773887867255, "phrase": "citation_counts"}, {"score": 0.0024788167298469455, "phrase": "theoretical_facts"}, {"score": 0.0021049977753042253, "phrase": "additional_influencing_factors"}], "paper_keywords": ["Citation analysis", " Matthew effect", " Scholarly communication"], "paper_abstract": "This article defines different perspectives for citations and introduces four concepts: Self-expected Citations, Received Citations, Expected Citations, and Deserved Citations. When comparing permutations of these four classes of perspectives, there are up to 145 kinds of equality/inequality relations. From these numerous relations, we analyze the difference between the Matthew Effect and the Matthew Phenomenon. We provide a precise definition and point out that many previous empirical research studies on the Matthew Effect based on citations belong primarily to the Matthew Phenomenon, and not the true meaning of the Matthew Effect. Due to the difficulty in determining the Deserved Citations, the Matthew Effect is in itself difficult to measure, although it is commonly believed to influence citation counts. Furthermore, from the theoretical facts, we outline four new effects/phenomena: the Self-confidence Effect/Phenomenon, the Narcissus Effect/Phenomenon, the Other-confidence Effect/Phenomenon, and the Flattery Effect/Phenomenon, and we discuss additional influencing factors.", "paper_title": "The influence of effects and phenomena on citations: a comparative analysis of four citation perspectives", "paper_id": "WOS:000294839200012"}