{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large_heterogenous_data"}, {"score": 0.004551883842967241, "phrase": "increasingly_large_data_sources"}, {"score": 0.004374852170791322, "phrase": "massive_potential"}, {"score": 0.004317378385832431, "phrase": "mutual_collaboration"}, {"score": 0.0035755653799043, "phrase": "data_source"}, {"score": 0.0034024277222012597, "phrase": "data_interpretation"}, {"score": 0.0033355353594739707, "phrase": "large_data_sources"}, {"score": 0.002912222095383313, "phrase": "essential_competent"}, {"score": 0.00250073564820402, "phrase": "different_fields"}, {"score": 0.00240328454980006, "phrase": "brief_look"}, {"score": 0.0023795195973873636, "phrase": "edge_research"}, {"score": 0.0023019834179097607, "phrase": "special_issue"}], "paper_keywords": ["Large data", " Dynamic matching", " Meaning", " Ontology matching", " Semantic Web"], "paper_abstract": "The world is increasingly full of data. Organisations, governments and individuals are creating increasingly large data sources, and in many cases making them publicly available. This offers massive potential for interaction and mutual collaboration. But using this data often creates problems. Those creating the data will use their own terminology, structure and formats for the data, meaning that data from one source will be incompatible with data from another source. When presented with a large, unknown data source, it is very difficult to ascribe meaning to the terms of that data source, and to understand what is being conveyed. Much effort has been invested in data interpretation prior to run-time, with large data sources being matched against each other off-line. But data is often used dynamically, and so to maximise the value of the data it is necessary to extract meaning from it dynamically. We therefore postulate that an essential competent of utilising the world of data in which we increasingly live is the development of the ability to discover meaning on the go in large, heterogenous data.This paper provides an overview of the current state-of-the-art, reviewing the aims and achievements in different fields which can be applied to this problem. We take a brief look at cutting edge research in this field, summarising four papers published in the special issue of the AI Review on Discovering Meaning on the go in Large Heterogenous Data, and conclude with our thoughts about where research in this field is going, and what our priorities must be to enable us to move closer to achieving this goal.", "paper_title": "Discovering meaning on the go in large heterogenous data", "paper_id": "WOS:000322271600001"}