{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "in-service_information"}, {"score": 0.014322727675460941, "phrase": "aero_engines"}, {"score": 0.008625173083007955, "phrase": "undesired_physical_actions"}, {"score": 0.007697432954903466, "phrase": "causal_chains"}, {"score": 0.004766683200410046, "phrase": "engineering_redesign_task"}, {"score": 0.0045324756541157574, "phrase": "fundamental_shift"}, {"score": 0.0043533862892678864, "phrase": "commercial_and_defense_purposes"}, {"score": 0.00407042677958844, "phrase": "aerospace_company"}, {"score": 0.003679969180334367, "phrase": "far_more_data"}, {"score": 0.0036430378180975667, "phrase": "in-service_performance"}, {"score": 0.0033045378860812403, "phrase": "existing_engines"}, {"score": 0.0029973957125353306, "phrase": "service_information"}, {"score": 0.0029672941061574375, "phrase": "redesign_task"}, {"score": 0.0028498718992429825, "phrase": "five_case_studies"}, {"score": 0.002764856305713066, "phrase": "existing_engine"}, {"score": 0.0023923066544220277, "phrase": "designers'_actions"}, {"score": 0.0021917966722180132, "phrase": "sound_basis"}], "paper_keywords": [""], "paper_abstract": "This article describes the research stimulated by a fundamental shift that is occurring in the manufacture and marketing of aero engines for commercial and defense purposes, away from the selling of products to the provision of services. This research was undertaken in an aerospace company, which designs and manufactures aero engines and also offers contracts, under which it remains responsible for the maintenance of engines. These contracts allow the company to collect far more data about the in-service performance of their engines than was previously available. This article aims at identifying what parts of this in-service information are required when components or systems of existing engines need to be redesigned because they have not performed as expected in service. In addition, this article aims at understanding how designers use this in-service information in a redesign task. In an attempt to address these aims, we analyzed five case studies involving redesign of components or systems of an existing engine. The findings show that the in-service information accessed by the designers mainly contains the undesired physical actions (e. g., deterioration mechanisms, deterioration effects, etc.) and the causal chains of these undesired physical actions. We identified a pattern in the designers' actions regarding the use of these causal chains. The designers have generated several solutions that utilize these causal chains seen in the in-service information. The findings provide a sound basis for developing tools and methods to support designers in effectively satisfying their in-service information requirements in a redesign task.", "paper_title": "Requirements and Use of In-Service Information in an Engineering Redesign Task: Case Studies From the Aerospace Industry", "paper_id": "WOS:000284231100006"}