{"auto_keywords": [{"score": 0.04044700798588366, "phrase": "randomised_nc_procedure"}, {"score": 0.028214801741057678, "phrase": "input_word"}, {"score": 0.00481495049065317, "phrase": "computational_complexity"}, {"score": 0.004628101576367193, "phrase": "transition_weights"}, {"score": 0.0045599093158915326, "phrase": "ring_q"}, {"score": 0.004515004397496303, "phrase": "rational_numbers"}, {"score": 0.00442651096522781, "phrase": "polynomial_identity_testing"}, {"score": 0.00427578268550103, "phrase": "complexity_bounds"}, {"score": 0.004009288598277725, "phrase": "polylogarithmic_parallel_time"}, {"score": 0.00395017798595193, "phrase": "finite_q-weighted_automata"}, {"score": 0.003472927015404464, "phrase": "nc_procedure"}, {"score": 0.0031297538950335233, "phrase": "probabilistic_automata"}, {"score": 0.003038066486989815, "phrase": "markov_decision_processes"}, {"score": 0.0022675820982741347, "phrase": "q-weighted_automata"}, {"score": 0.0021902063413831545, "phrase": "equivalence_problem"}, {"score": 0.00216858686400722, "phrase": "q-weighted_visibly_pushdown_automata"}, {"score": 0.0021049977753042253, "phrase": "polynomial_identity_testing_problem"}], "paper_keywords": ["weighted automata", " equivalence checking", " polynomial identity testing", " minimisation"], "paper_abstract": "This paper is concerned with the computational complexity of equivalence and minimisation for automata with transition weights in the ring Q of rational numbers. We use polynomial identity testing and the Isolation Lemma to obtain complexity bounds, focussing on the class NC of problems within P solvable in polylogarithmic parallel time. For finite Q-weighted automata, we give a randomised NC procedure that either outputs that two automata are equivalent or returns a word on which they differ. We also give an NC procedure for deciding whether a given automaton is minimal, as well as a randomised NC procedure that minimises an automaton. We consider probabilistic automata with rewards, similar to Markov Decision Processes. For these automata we consider two notions of equivalence: expectation equivalence and distribution equivalence. The former requires that two automata have the same expected reward on each input word, while the latter requires that each input word induce the same distribution on rewards in each automaton. For both notions we give algorithms for deciding equivalence by reduction to equivalence of Q-weighted automata. Finally we show that the equivalence problem for Q-weighted visibly pushdown automata is logspace equivalent to the polynomial identity testing problem.", "paper_title": "ON THE COMPLEXITY OF EQUIVALENCE AND MINIMISATION FOR Q-WEIGHTED AUTOMATA", "paper_id": "WOS:000317894100013"}