{"auto_keywords": [{"score": 0.03282260491043681, "phrase": "chocolato"}, {"score": 0.012133380511276623, "phrase": "novice_teachers"}, {"score": 0.00481495049065317, "phrase": "collaborative_learning_scenarios"}, {"score": 0.004681525814235883, "phrase": "group_activities"}, {"score": 0.00462919213721188, "phrase": "long-term_learning"}, {"score": 0.004551781491498328, "phrase": "well-thought-out_collaborative_learning"}, {"score": 0.004526550730375417, "phrase": "cl"}, {"score": 0.0044630962990919775, "phrase": "important_key"}, {"score": 0.004079090520520216, "phrase": "pedagogically_sound_structures"}, {"score": 0.003932654396285872, "phrase": "main_difficulty"}, {"score": 0.003899612025233852, "phrase": "effective_cl_scenarios"}, {"score": 0.0038559853156801094, "phrase": "teacher's_intentions"}, {"score": 0.003791455200028588, "phrase": "learning_scenario"}, {"score": 0.003584025547693836, "phrase": "collaborative_activities"}, {"score": 0.0035639149949775856, "phrase": "individual_activities"}, {"score": 0.0035439168845104586, "phrase": "careful_planning"}, {"score": 0.003445591238183763, "phrase": "collaborative_scenarios"}, {"score": 0.0033879057307626328, "phrase": "intelligent_authoring_tool"}, {"score": 0.0033311827561285194, "phrase": "semantic_web_technologies"}, {"score": 0.0032296377835432533, "phrase": "different_pedagogies"}, {"score": 0.0030787405733989615, "phrase": "intelligent_guidance"}, {"score": 0.003027178161479457, "phrase": "theory-based_cl_scenarios"}, {"score": 0.002743105561254975, "phrase": "pedagogically_sound_cl_activities"}, {"score": 0.002651960559564796, "phrase": "real_classroom_settings"}, {"score": 0.0026296502381720293, "phrase": "first_experiment"}, {"score": 0.0025137856138000036, "phrase": "second_experiment"}, {"score": 0.002471661547432869, "phrase": "brazilian_public_school"}, {"score": 0.0023166075278110254, "phrase": "cl_scenarios"}, {"score": 0.002258610515906159, "phrase": "continuous_utilization"}, {"score": 0.002245920320149954, "phrase": "well-designed_theory-based_cl_activities"}, {"score": 0.0021408862709571615, "phrase": "school_year"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CSCL", " Authoring tool", " Ontology", " Semantic Web", " Collaborative learning design"], "paper_abstract": "When the goal of group activities is to support long-term learning, the task of designing well-thought-out collaborative learning (CL) scenarios is an important key to success. To help students adequately acquire and develop their knowledge and skills, a teacher can plan a scenario that increases the probability for learning to occur. Such a scenario defines pedagogically sound structures that prevent off-task behavior and engage students in more meaningful interactions. The main difficulty in designing effective CL scenarios is transforming the teacher's intentions into elements that constitute the learning scenario. This problem is frequently observed when novice teachers attempt to improve the quality of learning and instruction by blending collaborative activities with individual activities without careful planning. With the goal of helping teachers in planning collaborative scenarios, we have developed an intelligent authoring tool referred to as CHOCOLATO using Semantic Web technologies (e.g. ontologies) in order to represent knowledge about different pedagogies and practices related to collaboration. Through the use of this knowledge, CHOCOLATO can provide intelligent guidance that helps teachers to create theory-based CL scenarios which has proven to be effective in a variety of situations. We evaluated it by conducting two experiments. We were interested in verifying whether the recommendations given by CHOCOLATO help novice teachers to design pedagogically sound CL activities, and if these activities help students to learn collaboratively in real classroom settings. The first experiment had the participation of 58 pre-service teachers that created CL scenarios with and without our authoring tool and the second experiment was carried out in a Brazilian public school together with 218 students. The results suggest that the guidance provided by CHOCOLATO do help novice teachers plan, understand and share CL scenarios more easily. They also suggest that the continuous utilization of well-designed theory-based CL activities create favorable conditions for students (particularly less knowledgeable ones) to improve their overall performance throughout the school year. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A Semantic Web-based authoring tool to facilitate the planning of collaborative learning scenarios compliant with learning theories", "paper_id": "WOS:000317369900025"}