{"auto_keywords": [{"score": 0.04635910410147262, "phrase": "real_function_class"}, {"score": 0.015423788060513935, "phrase": "real_function_classes"}, {"score": 0.01329632400710415, "phrase": "vc_dimension"}, {"score": 0.012041638174271342, "phrase": "discretized-vc_dimension"}, {"score": 0.007562526792990104, "phrase": "countable_traversal"}, {"score": 0.006924345415312159, "phrase": "function_class"}, {"score": 0.005939304367110442, "phrase": "finite_vc_dimension"}, {"score": 0.005479271509857859, "phrase": "infinite_vc_dimension"}, {"score": 0.00481495049065317, "phrase": "discretized-vapnik-chervonenkis_dimension"}, {"score": 0.00429057323623293, "phrase": "neural_networks"}, {"score": 0.0038674532861321864, "phrase": "output_range"}, {"score": 0.0035536228914319354, "phrase": "rational_numbers"}, {"score": 0.0027992118597278087, "phrase": "obtained_results"}, {"score": 0.002683125911877974, "phrase": "indicator-output_network"}, {"score": 0.002631959004685823, "phrase": "real-output_network"}, {"score": 0.002522791642460087, "phrase": "output_activation_functions"}, {"score": 0.0021961259795489833, "phrase": "overwhelming_probability"}, {"score": 0.0021294699637639564, "phrase": "existing_knowledge"}, {"score": 0.0021049977753042253, "phrase": "erm_learning"}], "paper_keywords": ["Consistency", " empirical risk minimization (ERM)", " neural network", " real function class", " risk bound", " Vapnik-Chervonenkis (VC) dimension"], "paper_abstract": "In this paper, we introduce the discretized-Vapnik-Chervonenkis (VC) dimension for studying the complexity of a real function class, and then analyze properties of real function classes and neural networks. We first prove that a countable traversal set is enough to achieve the VC dimension for a real function class, whereas its classical definition states that the traversal set is the output range of the function class. Based on this result, we propose the discretized-VC dimension defined by using a countable traversal set consisting of rational numbers in the range of a real function class. By using the discretized-VC dimension, we show that if a real function class has a finite VC dimension, only a finite traversal set is needed to achieve the VC dimension. We then point out that the real function classes, which have the infinite VC dimension, can be grouped into two categories: TYPE-A and TYPE-B. Subsequently, based on the obtained results, we discuss the relationship between the VC dimension of an indicator-output network and that of the real-output network, when both networks have the same structure except for the output activation functions. Finally, we present the risk bound based on the discretized-VC dimension for a real function class that has infinite VC dimension and is of TYPE-A. We prove that, with such a function class, the empirical risk minimization (ERM) principle for the function class is still consistent with overwhelming probability. This is a development of the existing knowledge that the ERM learning is consistent if and only if the function class has a finite VC dimension.", "paper_title": "Discretized-Vapnik-Chervonenkis Dimension for Analyzing Complexity of Real Function Classes", "paper_id": "WOS:000308965800011"}