{"auto_keywords": [{"score": 0.04960770684597511, "phrase": "media_streams"}, {"score": 0.04385710888015479, "phrase": "synchronized_media_streams"}, {"score": 0.029325853570600465, "phrase": "atomic_retrieval_units"}, {"score": 0.00481495049065317, "phrase": "information_unit"}, {"score": 0.004697308822154191, "phrase": "retrieval_effectiveness"}, {"score": 0.0043183186953102805, "phrase": "conventional_ir_systems"}, {"score": 0.0042336638794732255, "phrase": "partial_retrieval"}, {"score": 0.004130165601475531, "phrase": "\"atomic_units"}, {"score": 0.00395017798595193, "phrase": "underlying_media_streams"}, {"score": 0.0035424245257172234, "phrase": "extended_retrieval_unit"}, {"score": 0.003472927015404464, "phrase": "dynamically_integrated_media_streams"}, {"score": 0.0028911669203979156, "phrase": "extensive_empirical_results"}, {"score": 0.002605329434787829, "phrase": "retrieval_units"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Synchronized media streams", " Retrieval unit", " Document length", " Context for retrieval"], "paper_abstract": "This paper specifically addresses the effectiveness of our theoretically-based two dimensional retrieval model for searching semantically synchronized media streams. Conventional IR systems, which support partial retrieval of synchronized media streams, retrieve \"atomic units\", for example slides, pages and shots of underlying media streams such as presentations, electronic books, and lecture videos respectively. In contrast, our model is based upon the concept of an extended retrieval unit and thus retrieves dynamically integrated media streams comprising several atomic units both along and across media streams. In this paper, in addition to reviewing our model, we describe its system implementation that we developed for conducting experiments on several real-world datasets built from scratch. We then present extensive empirical results which demonstrate that our system outperforms (a) conventional systems based on atomic retrieval units, (b) single dimensional retrieval systems, which extend retrieval units over several atomic units of the same media and (c) cross-media retrieval systems, which extend atomic retrieval units across several media stream units. The results thus verify our claims regarding the effectiveness of our two dimensional retrieval model for retrieving meaningful units of synchronized media streams. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Extending information unit across media streams for improving retrieval effectiveness", "paper_id": "WOS:000314429900005"}