{"auto_keywords": [{"score": 0.04719470887322781, "phrase": "panel_data"}, {"score": 0.014083690963192652, "phrase": "time_series"}, {"score": 0.013459886435793706, "phrase": "different_times"}, {"score": 0.011671551911215378, "phrase": "agra_model"}, {"score": 0.01052045714064175, "phrase": "new_clustering_method"}, {"score": 0.00481495049065317, "phrase": "enhanced_grey_clustering_analysis_method"}, {"score": 0.004721529233535422, "phrase": "grey_relational_analysis"}, {"score": 0.00469079145638866, "phrase": "agra"}, {"score": 0.004481132747216135, "phrase": "clustering_method"}, {"score": 0.004408537640504066, "phrase": "n_samples"}, {"score": 0.004049501224016734, "phrase": "different_numbers"}, {"score": 0.004023120753104693, "phrase": "data_points"}, {"score": 0.003945001936004421, "phrase": "overall_clustering_approach"}, {"score": 0.0036832960694422765, "phrase": "separate_time_series"}, {"score": 0.0035999631751991385, "phrase": "grey_relational_degree"}, {"score": 0.0034164751616551437, "phrase": "appropriate_combinations"}, {"score": 0.003350096243772218, "phrase": "grey_relational_degrees"}, {"score": 0.002910545717767559, "phrase": "mainland_china"}, {"score": 0.0027894314171898536, "phrase": "china"}, {"score": 0.0026384167183586015, "phrase": "new_method"}, {"score": 0.0026126405272417783, "phrase": "different_lengths"}, {"score": 0.0023298518405721782, "phrase": "limited_degree"}, {"score": 0.0022696277881969896, "phrase": "traditional_method"}, {"score": 0.0021467594103960585, "phrase": "grey_relational_and_clustering_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Clustering", " Panel data", " Grey relational analysis", " Chinese panel data"], "paper_abstract": "An enhanced grey clustering analysis method based on accumulation sequences using grey relational analysis (AGRA) is put forward for specifying hierarchies of clusters in panel data. The clustering method can handle panel data containing N samples, each of which has m time series of indicators for which the observations for a given time series can be measured at different times than other series and contain different numbers of data points compared to other series. The overall clustering approach, which is called the Mean-AGRA clustering method, contains three main parts: a sequence of transformations of each separate time series: appropriate pairwise comparisons of the grey relational degree of an AGRA model for each pair of samples, across all samples as well as appropriate combinations thereafter, for three specific types of grey relational degrees; clustering all samples according to their AGRA degrees. To demonstrate how this new clustering method can be utilized in practice, it is applied to panel data consisting of 12 natural environmental indicators and 8 societal time series (m = 20) for 30 provinces (N = 30) in mainland China. The findings clarify how, for example, the provinces in China can be meaningfully categorized according to topography into two main groups consisting of plateaus and plains. The new method can handle different lengths of time series within a sample and across samples, which is useful when values occur at different times when comparing any two series. Moreover, the new clustering method avoids the problem of combining two samples having a limited degree of similarity, which exists in the traditional method. Consequently, the AGRA model and Mean-AGRA clustering method have expanded the scope of application of grey relational and clustering analysis. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An improved grey relational analysis approach for panel data clustering", "paper_id": "WOS:000362613000003"}