{"auto_keywords": [{"score": 0.05007838052989366, "phrase": "witness_anonymity"}, {"score": 0.035842581035989106, "phrase": "sdt"}, {"score": 0.0148712836828688, "phrase": "peer-to-peer_systems"}, {"score": 0.004779085953614184, "phrase": "peer-to-peer_settings"}, {"score": 0.0043363441738461335, "phrase": "peer_nature"}, {"score": 0.004256005669252138, "phrase": "seemingly_conflicting_requirements"}, {"score": 0.004177149334239669, "phrase": "honest_peers"}, {"score": 0.003978866233891427, "phrase": "malicious_peers"}, {"score": 0.003890540531028228, "phrase": "anonymity_feature"}, {"score": 0.0036507498735369576, "phrase": "malicious_or_selfish_behavior"}, {"score": 0.0032507647824680684, "phrase": "malicious_peer"}, {"score": 0.0032024424195797674, "phrase": "multiple_claims"}, {"score": 0.0028514344213899177, "phrase": "active_mode"}, {"score": 0.0027776422068966867, "phrase": "real-time_requirements"}, {"score": 0.002665511985052972, "phrase": "peer-to-peer_worms"}, {"score": 0.0025578967205807843, "phrase": "strict_real-time_requirements"}, {"score": 0.0021049977753042253, "phrase": "computation_overheads"}], "paper_keywords": ["Peer-to-peer", " privacy", " reputation systems", " trust"], "paper_abstract": "In this paper, we introduce the concept of witness anonymity for peer-to-peer systems, as well as other systems with the peer-to-peer nature. Witness anonymity combines the seemingly conflicting requirements of anonymity (for honest peers who report on the misbehavior of other peers) and accountability (for malicious peers that attempt to misuse the anonymity feature to slander honest peers). We propose the Secure Deep Throat (SDT) protocol to provide anonymity for the witnesses of malicious or selfish behavior to enable such peers to report on this behavior without fear of retaliation. On the other hand, in SDT, the misuse of anonymity is restrained in such a way that any malicious peer attempting to send multiple claims against the same innocent peer for the same reason (i.e., the same misbehavior type) can be identified. We also describe how SDT can be used in two modes. The active mode can be used in scenarios with real-time requirements, e. g., detecting and preventing the propagation of peer-to-peer worms, whereas the passive mode is suitable for scenarios without strict real-time requirements, e. g., query-based reputation systems. We analyze the security and overhead of SDT, and present countermeasures that can be used to mitigate various attacks on the protocol. Moreover, we show how SDT can be easily integrated with existing protocols/mechanisms with a few examples. Our analysis shows that the communication, storage, and computation overheads of SDT are acceptable in peer-to-peer systems.", "paper_title": "Providing Witness Anonymity Under Peer-to-Peer Settings", "paper_id": "WOS:000277777200011"}