{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "important_role"}, {"score": 0.0038314621564116192, "phrase": "widely_accepted_strategy"}, {"score": 0.0033492947290751996, "phrase": "common_sense_reasoning"}, {"score": 0.003260377175139591, "phrase": "front_door"}, {"score": 0.003110396267535251, "phrase": "philosophical_arguments"}, {"score": 0.00300749708357049, "phrase": "formal-computational_models"}, {"score": 0.002755567647101251, "phrase": "intuitive_arguments"}, {"score": 0.0025761937402886954, "phrase": "dynamic_nature"}, {"score": 0.0021770860717929192, "phrase": "terminological_confusion"}], "paper_keywords": ["science", " intuition", " cognition", " action", " knowledge-that", " computational modeling", " animal cognition", " expectation", " belief", " radical constructivism", " knowledge-how"], "paper_abstract": "The notions of knowledge and belief play an important role in philosophy. Unfortunately, the literature is not very consistent about defining these notions. Is belief more fundamental than knowledge or is it the other way around? Many accounts rely on the widely accepted strategy of appealing to the intuition of the reader. Such an argumentative methodology is fundamentally flawed because it lets the problems of common sense reasoning in through the front door. Instead, I suggest that philosophical arguments should be based on formal-computational models to (a) reduce the ambiguities and uncertainties that come with intuitive arguments and reasoning, and (b) capture the dynamic nature of many philosophical concepts. I present a model of knowledge and belief that lends itself to being implemented on computers. Its purpose is to resolve terminological confusion in favor of a more transparent account. The position I defend is an antirealist naturalized one: knowledge is best conceived as arising from experience, and is fundamental to belief.", "paper_title": "Knowledge and Belief: Some Clarifications", "paper_id": "WOS:000357406400007"}