{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hybrid_flowshop"}, {"score": 0.00476323161560059, "phrase": "parallel_batching_machines"}, {"score": 0.004561826854638056, "phrase": "two-stage_hybrid_flowshop_problem"}, {"score": 0.004298666679374568, "phrase": "second_stage"}, {"score": 0.0041840994704406866, "phrase": "discrete_machine"}, {"score": 0.003964007795174772, "phrase": "hatching_machine"}, {"score": 0.0037554497046697432, "phrase": "additional_feature"}, {"score": 0.0035005841368145525, "phrase": "compatibility_relation"}, {"score": 0.0032806521851034766, "phrase": "undirected_compatibility_graph"}, {"score": 0.003124790943886441, "phrase": "interval_graph"}, {"score": 0.003074495313651187, "phrase": "batch_processing_time"}, {"score": 0.002992456421856031, "phrase": "maximal_processing_time"}, {"score": 0.0026280534600940137, "phrase": "batching_and_sequencing_decisions"}, {"score": 0.0024638094275154358, "phrase": "np"}, {"score": 0.0021627595586364724, "phrase": "first_stage"}], "paper_keywords": ["Hybrid flowshop problem", " Batch processing machines", " Task compatibilities"], "paper_abstract": "This paper considers a two-stage hybrid flowshop problem in which the first stage contains Several identical discrete machines, and the second stage contains several identical batching machines. Each discrete machine can process no more than one task at time, and each hatching machine can process several tasks simultaneously in a batch with the additional feature that the tasks of the same batch have to be compatible. A compatibility relation is defined between each pair of tasks, so that an undirected compatibility graph is obtained which turns out to be an interval graph. The batch processing time is equal to the maximal processing time of the tasks in this batch, and all tasks of the same batch start and finish together. The goal is to make batching and sequencing decisions in order to minimize the makespan. Since the problem is NP-hard, we develop several heuristics along with their worst cases analysis. We also consider the case in which tasks have the same processing time on the first stage, for which a polynomial time approximation scheme (PTAS) algorithm is presented. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Scheduling hybrid flowshop with parallel batching machines and compatibilities", "paper_id": "WOS:000262120300027"}