{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "zooming_cameras"}, {"score": 0.04497972432687123, "phrase": "zooming_camera"}, {"score": 0.034939719516717475, "phrase": "principal_plane"}, {"score": 0.004717723626157272, "phrase": "new_method"}, {"score": 0.004452731043379068, "phrase": "realistic_configuration"}, {"score": 0.00437765047900432, "phrase": "surveillance_systems"}, {"score": 0.004216880725292, "phrase": "static_structure"}, {"score": 0.003912768486550741, "phrase": "affine_structure"}, {"score": 0.003873027670786261, "phrase": "observed_scene"}, {"score": 0.003718045060236861, "phrase": "point_correspondences"}, {"score": 0.003532977898022071, "phrase": "mostly_translational_displacement"}, {"score": 0.0034970809586393416, "phrase": "so-called_principal_plane"}, {"score": 0.002850819170139645, "phrase": "parallel_planes"}, {"score": 0.0024124751850872843, "phrase": "camera's_parameters"}, {"score": 0.002245842206945282, "phrase": "nonlinear_least-squares_optimization_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Camera auto/self-calibration", " Zooming cameras", " Plane at infinity", " Parallel planes", " 3D reconstruction"], "paper_abstract": "This paper proposes a new method for self-calibrating a set of stationary non-rotating zooming cameras. This is a realistic configuration, usually encountered in surveillance systems, in which each zooming camera is physically attached to a static structure (wall, ceiling, robot, or tripod). In particular, a linear, yet effective method to recover the affine structure of the observed scene from two or more such stationary zooming cameras is presented. The proposed method solely relies on point correspondences across images and no knowledge about the scene is required. Our method exploits the mostly translational displacement of the so-called principal plane of each zooming camera to estimate the location of the plane at infinity. The principal plane of a camera, at any given setting of its zoom, is encoded in its corresponding perspective projection matrix from which it can be easily extracted. As a displacement of the principal plane of a camera under the effect of zooming allows the identification of a pair of parallel planes, each zooming camera can be used to locate a line on the plane at infinity. Hence, two or more such zooming cameras in general positions allow the obtainment of an estimate of the plane at infinity making it possible, under the assumption of zero-skew and/or known aspect ratio, to linearly calculate the camera's parameters. Finally, the parameters of the camera and the coordinates of the plane at infinity are refined through a nonlinear least-squares optimization procedure. The results of our extensive experiments using both simulated and real data are also reported in this paper. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Self-calibration of stationary non-rotating zooming cameras", "paper_id": "WOS:000333854000005"}