{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "dynamic_optimisation_problems"}, {"score": 0.039990071660303224, "phrase": "electromagnetic_algorithm"}, {"score": 0.011328424034649669, "phrase": "search_space"}, {"score": 0.004112894218792621, "phrase": "global_optima"}, {"score": 0.003988293689448734, "phrase": "research_work"}, {"score": 0.003942544019605881, "phrase": "multi-population_electromagnetic_algorithm"}, {"score": 0.003764713814123286, "phrase": "population_based_meta-heuristic_method"}, {"score": 0.003636605792981828, "phrase": "sample_points"}, {"score": 0.0035399770257915466, "phrase": "dynamic_changes"}, {"score": 0.0034194902384248006, "phrase": "entire_population"}, {"score": 0.003265175268104804, "phrase": "diversity_mechanisms"}, {"score": 0.002931569771634119, "phrase": "different_diversity_mechanisms"}, {"score": 0.0025817653186901175, "phrase": "proposed_approach"}, {"score": 0.0025034338848015166, "phrase": "latest_methodologies"}, {"score": 0.0024842242921857705, "phrase": "reviewed_literature"}, {"score": 0.0024088451312725924, "phrase": "benchmark_problems"}, {"score": 0.0023178219772486868, "phrase": "multi-population_diversity_mechanism"}, {"score": 0.0021961259795489833, "phrase": "best_known_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-population based method", " Electromagnetic algorithm", " Dynamic optimisation problems"], "paper_abstract": "This paper is derived from an interest in the development of approaches to tackle dynamic optimisation problems. This is a very challenging research area due to the fact that any approaches utilised should be able to track the changes and simultaneously seek for global optima as the search progresses. In this research work, a multi-population electromagnetic algorithm for dynamic optimisation problems is proposed. An electromagnetic algorithm is a population based meta-heuristic method which imitates the attraction and repulsion of the sample points. In order to track the dynamic changes and to effectively explore the search space, the entire population is divided into several sub-populations (referred as multi-population that acts as diversity mechanisms) where each sub-population takes charge in exploring or exploiting the search space. In addition, further investigation are also conducted on the combination of the electromagnetic algorithm with different diversity mechanisms (i.e. random immigrants, memory mechanism and memory based immigrant schemes) with the aim of identifying the most appropriate diversity mechanism for maintaining the diversity of the population in solving dynamic optimisation problems. The proposed approach has been applied and evaluated against the latest methodologies in reviewed literature of research works with respect to the benchmark problems. This study demonstrates that the electromagnetic algorithm with a multi-population diversity mechanism performs better compared to other population diversity mechanisms investigated in our research and produces some of the best known results when tested on Moving Peak Benchmark (MPB) problems. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A multi-population electromagnetic algorithm for dynamic optimisation problems", "paper_id": "WOS:000338706600040"}