{"auto_keywords": [{"score": 0.0407832063611011, "phrase": "curricular_materials"}, {"score": 0.014814951563713067, "phrase": "onc"}, {"score": 0.013495148676095659, "phrase": "community_colleges"}, {"score": 0.012989379491398082, "phrase": "five_universities"}, {"score": 0.00481495049065317, "phrase": "onc_health_information_technology_curriculum"}, {"score": 0.004652845998457721, "phrase": "hitech"}, {"score": 0.004344755264641137, "phrase": "health_information_technology"}, {"score": 0.003937126962709418, "phrase": "established_informatics_programs"}, {"score": 0.003232653376857698, "phrase": "ntdc_site"}, {"score": 0.0030705342386533083, "phrase": "use_patterns"}, {"score": 0.003044313656896057, "phrase": "user_characteristics"}, {"score": 0.002954287204671032, "phrase": "mixed_methods"}, {"score": 0.002929056388593134, "phrase": "registered_users"}, {"score": 0.002904040426340639, "phrase": "nearly_half_a_million_units"}, {"score": 0.002842428606954139, "phrase": "ntdc_website"}, {"score": 0.0024566655761509276, "phrase": "survey_responses"}, {"score": 0.002414861891567233, "phrase": "discussion_successful_aspects"}, {"score": 0.002244969789802093, "phrase": "onc_hit_curriculum"}, {"score": 0.0022067604433257814, "phrase": "community_college_programs"}, {"score": 0.0021322775033565805, "phrase": "valuable_resource"}, {"score": 0.0021049977753042253, "phrase": "larger_informatics_community"}], "paper_keywords": [""], "paper_abstract": "Objective As part of the Heath Information Technology for Economic and Clinical Health (HITECH) Act, the Office of the National Coordinator for Health Information Technology (ONC) implemented its Workforce Development Program, which included initiatives to train health information technology (HIT) professionals in 12 workforce roles, half of them in community colleges. To achieve this, the ONC tasked five universities with established informatics programs with creating curricular materials that could be used by community colleges. The five universities created 20 components that were made available for downloading from the National Training and Dissemination Center (NTDC) website. This paper describes an evaluation of the curricular materials by its intended audience of educators. Methods We measured the quantity of downloads from the NTDC site and administered a survey about the curricular materials to its registered users to determine use patterns and user characteristics. The survey was evaluated using mixed methods. Registered users downloaded nearly half a million units or components from the NTDC website. We surveyed these 9835 registered users. Results 1269 individuals completed all or part of the survey, of whom 339 identified themselves as educators (26.7% of all respondents). This paper addresses the survey responses of educators. Discussion Successful aspects of the curriculum included its breadth, convenience, hands-on and course planning capabilities. Several areas were identified for potential improvement. Conclusions The ONC HIT curriculum met its goals for community college programs and will likely continue to be a valuable resource for the larger informatics community in the future.", "paper_title": "Design and evaluation of the ONC health information technology curriculum", "paper_id": "WOS:000334611600017"}