{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "delayed-state-derivative_feedback"}, {"score": 0.008581978929068883, "phrase": "second-order_delayed_multi-agent_systems"}, {"score": 0.0075386836199239785, "phrase": "communication_delay"}, {"score": 0.007368102834372919, "phrase": "convergence_speed"}, {"score": 0.00481495049065317, "phrase": "consensus_performance"}, {"score": 0.004359078118356132, "phrase": "existing_delayed_consensus_protocol"}, {"score": 0.00385658790017119, "phrase": "frequency-domain_analysis"}, {"score": 0.003797978200741566, "phrase": "algebra_graph_theory"}, {"score": 0.0036274201504044685, "phrase": "sufficient_and_necessary_condition"}, {"score": 0.0035179764329354877, "phrase": "delayed_multi-agent_system"}, {"score": 0.0021049977753042253, "phrase": "theoretical_results"}], "paper_keywords": ["multi-agent systems", " delayed-state-derivative feedback", " consensus", " communication delay", " robustness", " convergence speed"], "paper_abstract": "In this article, delayed-state-derivative feedback is introduced into the existing delayed consensus protocol for improving the robustness against communication delay and the convergence speed of reaching the consensus simultaneously. Frequency-domain analysis and algebra graph theory are employed to derive the sufficient and necessary condition guaranteeing the second-order delayed multi-agent system applying the consensus protocol with the delayed-state-derivative feedback to achieve the stationary consensus asymptotically. It is proved that introducing delayed-state-derivative feedback with the proper intensity can improve the robustness against communication delay and that for two particular kinds of second-order delayed multi-agent systems, introducing the delayed-state-derivative feedback can also accelerate the convergence speed, provided that the intensity of the delayed-state-derivative feedback is chosen properly. Simulations are provided to demonstrate the effectiveness of the theoretical results.", "paper_title": "Delayed-state-derivative feedback for improving consensus performance of second-order delayed multi-agent systems", "paper_id": "WOS:000296974800014"}