{"auto_keywords": [{"score": 0.03392375631730589, "phrase": "pedagogical_patterns"}, {"score": 0.015604420328276313, "phrase": "singular_value_decomposition"}, {"score": 0.010320200322895344, "phrase": "rspp"}, {"score": 0.008855363464069064, "phrase": "minable_view"}, {"score": 0.00481495049065317, "phrase": "pedagogical_pattern_recommendations"}, {"score": 0.004755591019552452, "phrase": "variable_data_attributes"}, {"score": 0.004616083078303411, "phrase": "educational_institutions"}, {"score": 0.004458464718551434, "phrase": "formal_training_processes"}, {"score": 0.004381676471452105, "phrase": "doctoral_degrees"}, {"score": 0.004316906895975406, "phrase": "high_costs"}, {"score": 0.004190213818869998, "phrase": "formal_training"}, {"score": 0.0040571383470418085, "phrase": "new_trends"}, {"score": 0.003737934295442975, "phrase": "specific_class"}, {"score": 0.0036553070575015344, "phrase": "specific_characteristics"}, {"score": 0.003583389708046658, "phrase": "specific_objectives"}, {"score": 0.003504166670586406, "phrase": "classroom_session"}, {"score": 0.003334309053314909, "phrase": "classroom_environment"}, {"score": 0.003228327825803928, "phrase": "recommendation_system"}, {"score": 0.0030414140732789186, "phrase": "educational_process"}, {"score": 0.0030038530442832835, "phrase": "web_information_system"}, {"score": 0.002844003266530367, "phrase": "unified_hybrid_model"}, {"score": 0.002808873363864562, "phrase": "collaborative_filtering"}, {"score": 0.0024620842899061614, "phrase": "latent_space"}, {"score": 0.002273737007743764, "phrase": "information_retrieval"}, {"score": 0.0022624544751920317, "phrase": "recommendation_systems"}, {"score": 0.002251227801482381, "phrase": "satisfactory_results"}, {"score": 0.0021741821763405045, "phrase": "general_application"}, {"score": 0.0021154967589989537, "phrase": "recommender_systems"}, {"score": 0.0021049977753042253, "phrase": "educational_teacher_support_processes"}], "paper_keywords": ["Recommender systems", " Pedagogical patterns", " Singular value decomposition", " Cosine similarity", " Collaborative filtering", " Resnick prediction formula"], "paper_abstract": "To carry out effective teaching/learning processes, lecturers in a variety of educational institutions frequently need support. They therefore resort to advice from more experienced lecturers, to formal training processes such as specializations, master or doctoral degrees, or to self-training. High costs in time and money are invariably involved in the processes of formal training, while self-training and advice each bring their own specific risks (e.g. of following new trends that are not fully evaluated or the risk of applying techniques that are inappropriate in specific contexts).This paper presents a system that allows lecturers to define their best teaching strategies for use in the context of a specific class. The context is defined by: the specific characteristics of the subject being treated, the specific objectives that are expected to be achieved in the classroom session, the profile of the students on the course, the dominant characteristics of the teacher, and the classroom environment for each session, among others. The system presented is the Recommendation System of Pedagogical Patterns (RSPP). To construct the RSPP, an ontology representing the pedagogical patterns and their interaction with the fundamentals of the educational process was defined. A web information system was also defined to record information on courses, students, lecturers, etc.; an option based on a unified hybrid model (for content and collaborative filtering) of recommendations for pedagogical patterns was further added to the system. RSPP features a minable view, a tabular structure that summarizes and organizes the information registered in the rest of the system as well as facilitating the task of recommendation. The data recorded in the minable view is taken to a latent space, where noise is reduced and the essence of the information contained in the structure is distilled. This process makes use of Singular Value Decomposition (SVD), commonly used by information retrieval and recommendation systems. Satisfactory results both in the accuracy of the recommendations and in the use of the general application open the door for further research and expand the role of recommender systems in educational teacher support processes. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid system of pedagogical pattern recommendations based on singular value decomposition and variable data attributes", "paper_id": "WOS:000317529900003"}