{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_software"}, {"score": 0.004594951819987416, "phrase": "paper_repository._scientific_and_engineering_research"}, {"score": 0.004506265705673849, "phrase": "effective_development"}, {"score": 0.004436545340717729, "phrase": "software_artifacts"}, {"score": 0.004168240841388958, "phrase": "trained_software_engineers"}, {"score": 0.003993216345115755, "phrase": "research_community"}, {"score": 0.0037516215763875225, "phrase": "research_area"}, {"score": 0.0036363418376496484, "phrase": "sharp_increase"}, {"score": 0.0032472646337850042, "phrase": "systematic_mapping"}, {"score": 0.0032220148724914867, "phrase": "bibliometrics_study"}, {"score": 0.0029224275921964724, "phrase": "mapping_data"}, {"score": 0.0028771413440398614, "phrase": "online_repository"}, {"score": 0.00277778944472107, "phrase": "regular_basis"}, {"score": 0.002422890839801611, "phrase": "specific_software_engineering_techniques"}, {"score": 0.002376027109070317, "phrase": "software_maintenance"}, {"score": 0.00228499525153, "phrase": "project_management"}, {"score": 0.0022495644368875686, "phrase": "scientific_context"}, {"score": 0.0021049977753042253, "phrase": "research_space"}], "paper_keywords": ["Development of scientific software", " systematic mapping", " bibliometrics study", " paper repository"], "paper_abstract": "Scientific and engineering research is heavily dependent on effective development and use of software artifacts. Many of these artifacts are produced by the scientists themselves, rather than by trained software engineers. To address the challenges in this area, a research community often referred to as \"Development of Scientific Software\" has emerged in the last few decades. As this research area has matured, there has been a sharp increase in the number of papers and results made available, and it has thus become important to summarize and provide an overview about those studies. Through a systematic mapping and bibliometrics study, we have reviewed 130 papers in this area. We present the results of our study in this paper. Also we have made the mapping data available on an online repository which is planned to be updated on a regular basis. The results of our study seem to suggest that many software engineering techniques and activities are being used in the development of scientific software. However, there is still a need for further exploration of the usefulness of specific software engineering techniques (e.g., regarding software maintenance, evolution, refactoring, re(v)-engineering, process and project management) in the scientific context. It is hoped that this article will help (new) researchers get an overview of the research space and help them to understand the trends in the area.", "paper_title": "DEVELOPMENT OF SCIENTIFIC SOFTWARE: A SYSTEMATIC MAPPING, A BIBLIOMETRICS STUDY, AND A PAPER REPOSITORY", "paper_id": "WOS:000322397000004"}