{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sparse_pca"}, {"score": 0.004451676867747938, "phrase": "classical_pca_technique"}, {"score": 0.004382364826200616, "phrase": "principal_components"}, {"score": 0.004202741104973709, "phrase": "sparse_non-zero_loadings"}, {"score": 0.003610929883213109, "phrase": "new_sparse_pca_method"}, {"score": 0.003355717283753749, "phrase": "input_data"}, {"score": 0.003303412571939192, "phrase": "conventional_sparse_pca_methods"}, {"score": 0.003251920460276645, "phrase": "new_method"}, {"score": 0.0029131986574478046, "phrase": "simple_algorithm"}, {"score": 0.002651015392318126, "phrase": "local_optimum"}, {"score": 0.0024894376091589244, "phrase": "proposed_method"}, {"score": 0.0022653055209664284, "phrase": "reconstruction_problems"}, {"score": 0.0021951623041245897, "phrase": "classical_pca_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Face recognition", " Noise", " Outlier", " Principal component analysis", " Robust", " Sparsity"], "paper_abstract": "Various sparse principal component analysis (PCA) methods have recently been proposed to enhance the interpretability of the classical PCA technique by extracting principal components (PCs) of the given data with sparse non-zero loadings. However, the performance of these methods is prone to be adversely affected by the presence of outliers and noises. To alleviate this problem, a new sparse PCA method is proposed in this paper. Instead of maximizing the L-2-norm variance of the input data as the conventional sparse PCA methods, the new method attempts to capture the maximal L-1-norm variance of the data, which is intrinsically less sensitive to noises and outliers. A simple algorithm for the method is specifically designed, which is easy to be implemented and converges to a local optimum of the problem. The efficiency and the robustness of the proposed method are theoretically analyzed and empirically verified by a series of experiments implemented on multiple synthetic and face reconstruction problems, as compared with the classical PCA method and other typical sparse PCA methods. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Improve robustness of sparse PCA by L-1-norm maximization", "paper_id": "WOS:000295760700040"}