{"auto_keywords": [{"score": 0.046516772531353, "phrase": "experienced_schedulers"}, {"score": 0.015719716506582538, "phrase": "disruption_management"}, {"score": 0.015620073054784158, "phrase": "urban_distribution"}, {"score": 0.015083046044013093, "phrase": "new_distribution_plan"}, {"score": 0.011035578526629463, "phrase": "real-time_modeling_process"}, {"score": 0.009587537201340833, "phrase": "modeling_process"}, {"score": 0.004486147558765763, "phrase": "real_time"}, {"score": 0.004358169586895055, "phrase": "common_sense"}, {"score": 0.003931879808909078, "phrase": "large_scale"}, {"score": 0.003819652968070514, "phrase": "optimization_techniques"}, {"score": 0.003558573794178866, "phrase": "plan-executing_process"}, {"score": 0.0034905093340212045, "phrase": "real-time_modeling"}, {"score": 0.0032623406075681315, "phrase": "knowledge-based_modeling_method"}, {"score": 0.003019726786531033, "phrase": "proper_knowledge_representation_schemes"}, {"score": 0.0029714924513911897, "phrase": "automated_or_semi-automated_modeling"}, {"score": 0.002831350132465098, "phrase": "different_kinds"}, {"score": 0.002813169398244266, "phrase": "knowledge_representation_schemes"}, {"score": 0.0027065039341671103, "phrase": "knowledge-based_modeling_process"}, {"score": 0.0026207039474589, "phrase": "qualitative_policy"}, {"score": 0.002554021496818708, "phrase": "current_distribution_system's_state"}, {"score": 0.0024571577953004546, "phrase": "corresponding_model"}, {"score": 0.00214610313234565, "phrase": "different_distribution_system's_states"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge-based modeling", " Knowledge representation", " Disruption management", " Local search algorithm", " Vehicle Routing Problem (VRP)"], "paper_abstract": "Disruption management in urban distribution is the process of achieving a new distribution plan in order to respond to a disruption in real time. Experienced schedulers can respond to disruptions quickly with common sense and past experiences, but they often achieve the new distribution plan by a fuzzy, sometimes inconsistent, and not well-understood way. The method is limited when the problem becomes large scale or more complicated. In this case, optimization techniques consisting of models and algorithms may complement it. However, as the distribution system's state changes constantly with the plan-executing process and disruptions are diversified, real-time modeling is very difficult. Hence in order to achieve the real-time modeling process, the research in the paper focuses on a knowledge-based modeling method, which combines the knowledge of experienced schedulers with the OR knowledge concerning models and algorithms. Policies, algorithms and models are represented by proper knowledge representation schemes in order to support automated or semi-automated modeling by computers. The modeling process is demonstrated by a case to show how the different kinds of knowledge representation schemes cooperate with each other to support the modeling process. In the knowledge-based modeling process, based on the knowledge of experienced schedulers, a qualitative policy for handling the disruption based on the current distribution system's state is achieved firstly; and then based on OR knowledge, the corresponding model and algorithm are constructed to quantitatively optimize the policy. The integration of the two kinds of knowledge not only effectively supports the real-time modeling process, but also combines the advantages of both to achieve more practical and scientific solutions to different kinds of disruptions occurring under different distribution system's states. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Knowledge-based modeling for disruption management in urban distribution", "paper_id": "WOS:000296214900095"}