{"auto_keywords": [{"score": 0.048946208597162526, "phrase": "e-commerce_services"}, {"score": 0.04025730781495741, "phrase": "e-commerce_companies"}, {"score": 0.00481495049065317, "phrase": "infra-marginal_analysis_model"}, {"score": 0.004757643419056999, "phrase": "provision_mode_selection"}, {"score": 0.00407161650109722, "phrase": "service_quality"}, {"score": 0.0034016119212097826, "phrase": "key_operational_strategy_issue"}, {"score": 0.0032036590920314725, "phrase": "e-commerce_services'_optimal_supply_modes"}, {"score": 0.003109031770476385, "phrase": "cost_oriented_infra-marginal_model"}, {"score": 0.0028245516301681713, "phrase": "main_impact_factors"}, {"score": 0.0027246967293115343, "phrase": "paper_infers_provision_mode"}, {"score": 0.002373472641477602, "phrase": "decision_trees"}, {"score": 0.0021561514733516676, "phrase": "proposed_model's_feasibility"}], "paper_keywords": ["e-commerce services", " provision mode selection", " e-commerce", " infra-marginal analysis", " cost minimizing"], "paper_abstract": "E-commerce has grown extraordinarily since the emergence of the internet, and many types of services are employed to accelerate this process. Service quality and productivity are two critical indicators to evaluate the competitiveness of e-commerce companies. Deciding which provision mode of e-commerce services (buy, sell, or self-provide) to adopt is a key operational strategy issue. This paper investigates the conditions and limitations of e-commerce services' optimal supply modes, and proposes a cost oriented infra-marginal model where service demand is considered an exogenous variable due to its non-elastic and unprofitable characteristics. By analyzing the main impact factors of this model, this paper infers provision mode selection strategies, which are determined by four factors: transaction cost, service price, service demand, and competitive advantages. Decision trees are derived from these strategies to help e-commerce companies make appropriate decisions. Finally, the proposed model's feasibility is verified by two case studies.", "paper_title": "Infra-Marginal Analysis Model for Provision Mode Selection for E-commerce Services", "paper_id": "WOS:000364486500008"}