{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "mobile_robot"}, {"score": 0.00481495049065317, "phrase": "visuomotor_anticipation"}, {"score": 0.004534136929881113, "phrase": "sensorimotor_anticipation"}, {"score": 0.004122490120202936, "phrase": "grasping_movement"}, {"score": 0.004000396172153709, "phrase": "spatial_arrangements"}, {"score": 0.0030060256866508606, "phrase": "dead_end"}, {"score": 0.002816246391862638, "phrase": "simulated_movement"}, {"score": 0.0027464781499539296, "phrase": "prediction_steps"}, {"score": 0.0026516890043911836, "phrase": "multilayer_perceptron"}, {"score": 0.0026120705848349055, "phrase": "next_image"}, {"score": 0.002158505888557746, "phrase": "training_patches"}, {"score": 0.0021049977753042253, "phrase": "gaussian_functions"}], "paper_keywords": ["sensorimotor anticipation", " vision", " forward model", " mobile robot", " perception", " multilayer perceptron", " image denoising", " Gaussian mixture model"], "paper_abstract": "Several scientists suggested that certain perceptual qualities are based on sensorimotor anticipation: for example, the softness of a sponge is perceived by anticipating the sensations resulting from a grasping movement. For the perception of spatial arrangements, this article demonstrates that this concept can be realized in a mobile robot. The robot first learned to predict how its visual input changes under movement commands. With this ability, two perceptual tasks could be solved: judging the distance to an obstacle in front by 'mentally' simulating a movement toward the obstacle, and recognizing a dead end by simulating either an obstacle-avoidance algorithm or a recursive search for an exit. A simulated movement contained a series of prediction steps. In each step, a multilayer perceptron anticipated the next image, which, however, became increasingly noisy. To denoise an image, it was split into patches, and each patch was projected onto a manifold obtained by modelling the density of the distribution of training patches with a mixture of Gaussian functions. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Perception through visuomotor anticipation in a mobile robot", "paper_id": "WOS:000243841900002"}