{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_actions"}, {"score": 0.00447251540886613, "phrase": "pervasive_patient_monitoring"}, {"score": 0.003820896867623235, "phrase": "important_relations"}, {"score": 0.003531474887552889, "phrase": "motion_encoder"}, {"score": 0.003462599815177726, "phrase": "sensor_level"}, {"score": 0.0032639039638211347, "phrase": "sensor's_trajectory"}, {"score": 0.0030464123943266673, "phrase": "different_encoding_scheme"}, {"score": 0.0030017207229983385, "phrase": "usual_velocity"}, {"score": 0.002680114113899346, "phrase": "temporal_and_spatial_indexing_schemes"}, {"score": 0.0026148807877309417, "phrase": "optimal_filtering_models"}, {"score": 0.0025892330566358503, "phrase": "robust_encoding"}, {"score": 0.0025014259919355453, "phrase": "spatial_indexing"}, {"score": 0.0022890371899188466, "phrase": "complex_motions"}, {"score": 0.0021789194955896124, "phrase": "sensor_encoder_bears"}, {"score": 0.0021049977753042253, "phrase": "complete_action_descriptions"}], "paper_keywords": ["Curvature", " decomposition", " encoding model", " human action", " noise", " sensor level", " speed", " torsion"], "paper_abstract": "Human actions have been widely studied for their potential application in various areas such as sports, pervasive patient monitoring, and rehabilitation. However, challenges still persist pertaining to determining the most useful ways to describe human actions at the sensor, then limb and complete action levels of representation and deriving important relations between these levels each involving their own atomic components. In this paper, we report on a motion encoder developed for the sensor level based on the need to distinguish between the shape of the sensor's trajectory and its temporal characteristics during execution. This distinction is critical as it provides a different encoding scheme than the usual velocity and acceleration measures which confound these two attributes of any motion. At the same time, we eliminate noise from sensors by comparing temporal and spatial indexing schemes and a number of optimal filtering models for robust encoding. Results demonstrate the benefits of spatial indexing and separating the shape and dynamics of a motion, as well as its ability to decompose complex motions into several atomic ones. Finally, we discuss how this specific type of sensor encoder bears on the derivation of limb and complete action descriptions.", "paper_title": "A Syntactic Two-Component Encoding Model for the Trajectories of Human Actions", "paper_id": "WOS:000344993100020"}