{"auto_keywords": [{"score": 0.0037847308929559163, "phrase": "original_cmfb"}, {"score": 0.003694652993546994, "phrase": "recombination_transmultiplexer"}, {"score": 0.0035208552733545463, "phrase": "recombination_structure"}, {"score": 0.0033552055241931346, "phrase": "lower_system_delay"}, {"score": 0.003121183062764093, "phrase": "possible_choices"}, {"score": 0.0030468495296763643, "phrase": "prototype_filters"}, {"score": 0.002974281028713475, "phrase": "different_design_objectives"}, {"score": 0.0029034358982402346, "phrase": "matching_condition"}, {"score": 0.0027667539384678814, "phrase": "spurious_response"}, {"score": 0.002615381301695394, "phrase": "transition_bands"}, {"score": 0.0024922258873137093, "phrase": "complete_factorization"}, {"score": 0.0024524733595572084, "phrase": "biorthgonal_cmfb"}, {"score": 0.0023940274498526213, "phrase": "lifting_scheme"}, {"score": 0.002299689297293321, "phrase": "structurally_pr_biorthogonal_nonuniform_filter_banks"}, {"score": 0.0021391300942881, "phrase": "coefficient_quantization"}], "paper_keywords": [""], "paper_abstract": "This paper studies the theory, design and multiplier-less (ML) realization of a class of perfect reconstruction (PR) low-delay biorthogonal nonuniform cosine-modulated filter banks (CMFBs). It is based on a recombination (or merging) structure previously proposed by the authors. By relaxing the original CMFB and the recombination transmultiplexer (TMUX) in the recombination structure to be biorthogonal, nonuniform CMFBs with lower system delay can be obtained. This also increases the possible choices of the prototype filters to meet different design objectives. A matching condition is introduced to suppress the spurious response resulting from the mismatch in the transition bands of the two biorthogonal CMFBs. A complete factorization of biorthgonal CMFB using the lifting scheme is employed to obtain structurally PR biorthogonal nonuniform filter banks (FBs), which are robust to coefficient quantization. In addition, by approximating the lifting coefficients and the modulation matrices by the sum of powers-of-two (SOPOT) coefficients, ML realization with very low implementation complexity is obtained. Design examples and comparison are given to illustrate the effectiveness of the proposed method.", "paper_title": "Biorthogonal recombination nonuniform cosine-modulated filter banks and their multiplier-less realizations", "paper_id": "WOS:000239323300001"}