{"auto_keywords": [{"score": 0.02499298697367635, "phrase": "new_method"}, {"score": 0.00481495049065317, "phrase": "linear_elasticity_problems"}, {"score": 0.004588158931776543, "phrase": "structural_and_geotechnical_engineering_results"}, {"score": 0.003496994062890991, "phrase": "iterative_approach"}, {"score": 0.003332072426367186, "phrase": "computational_time"}, {"score": 0.003213489259323921, "phrase": "memory_saving"}, {"score": 0.0029351141718104725, "phrase": "full_coefficient_matrix"}, {"score": 0.0028823939507764238, "phrase": "solution_procedure"}, {"score": 0.002813566267090177, "phrase": "iterative_methods"}, {"score": 0.0024932498388507084, "phrase": "established_element-based_preconditioning_methods"}, {"score": 0.0022771244331421586, "phrase": "element_displacement_components"}, {"score": 0.002169607777109063, "phrase": "significant_improvement"}], "paper_keywords": ["finite elements", " iterative solvers", " preconditioning", " elasticity", " geotechnics", " structures"], "paper_abstract": "Finite element analysis of problems in structural and geotechnical engineering results in linear systems where the unknowns are displacements and rotations at nodes. Although the solution of these systems can be carried out using either direct or iterative methods, in practice the matrices involved are usually very large and sparse (particularly for 3D problems) so an iterative approach is often advantageous in terms of both computational time and memory requirements. This memory saving can be further enhanced if the method used does not require assembly of the full coefficient matrix during the solution procedure. One disadvantage of iterative methods is the need to apply preconditioning to improve convergence. In this paper, we review a range of established element-based preconditioning methods for linear elastic problems and compare their performance with a new method based on preconditioning with element displacement components. This new method appears to offer a significant improvement in performance. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "An element-based displacement preconditioner for linear elasticity problems", "paper_id": "WOS:000243267400018"}