{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "probability_evaluation"}, {"score": 0.04958720442967606, "phrase": "end-to-end_dynamic_wdm_networks"}, {"score": 0.0039772848945723435, "phrase": "link_independence_assumption"}, {"score": 0.003835972725191194, "phrase": "recently_proposed_mathematical_procedure"}, {"score": 0.0036996627006622975, "phrase": "non-poisson_traffic"}, {"score": 0.0035681790580031998, "phrase": "so-called_streamline_effect"}, {"score": 0.003168079471049896, "phrase": "second_method"}, {"score": 0.003071274938566466, "phrase": "alternate_routing"}, {"score": 0.0027561106245394015, "phrase": "poisson"}, {"score": 0.002643386043540555, "phrase": "traffic_load"}, {"score": 0.0025892330566358503, "phrase": "network_links"}, {"score": 0.0024971144603069006, "phrase": "different_network_topologies"}, {"score": 0.002251542790734307, "phrase": "proposed_methods"}], "paper_keywords": ["Optical fiber networks", " WDM networks", " Performance evaluation"], "paper_abstract": "Two mathematical methods for blocking probability evaluation of end-to-end dynamic WDM networks are proposed. The first method can be applied to networks operating with static (fixed) routes. By diminishing the impact of the link independence assumption, the method proposed improves a recently proposed mathematical procedure that assumes link blocking independency and non-Poisson traffic. To do so, the so-called streamline effect is taken into account in the equations. As a result, values closer to that of simulation are obtained. The second method applies to networks operating with alternate routing. In this case, the method simultaneously relaxes three non-realistic assumptions of previous works: the link blocking independence, the Poisson traffic arrival and the homogeneity of the traffic load offered to the network links. Both methods were applied to different network topologies, and their results were compared to those of simulation. Results show that the match between simulation and the proposed methods is excellent, and better than assuming link blocking independence, in all the topologies studied.", "paper_title": "Blocking probability evaluation of end-to-end dynamic WDM networks", "paper_id": "WOS:000305533300004"}