{"auto_keywords": [{"score": 0.041530110733372934, "phrase": "unauthorized_sharing"}, {"score": 0.039926489903206734, "phrase": "legal_punishments"}, {"score": 0.03052532215551675, "phrase": "spies"}, {"score": 0.00481495049065317, "phrase": "digital_rights_online"}, {"score": 0.004749824776508639, "phrase": "electronic_content"}, {"score": 0.004559661374976129, "phrase": "website's_resources"}, {"score": 0.004144908086646161, "phrase": "economic_harm"}, {"score": 0.004088807948906792, "phrase": "content's_owner"}, {"score": 0.003925004567341077, "phrase": "digital_content"}, {"score": 0.003257727050827128, "phrase": "economic_incentives"}, {"score": 0.0027407299369891502, "phrase": "limited_extent"}, {"score": 0.002525248554951453, "phrase": "technological_sharing-prevention_techniques"}, {"score": 0.0024460897937643032, "phrase": "trade_secrets"}, {"score": 0.002423931101340771, "phrase": "pre-release_content"}, {"score": 0.002316105585203396, "phrase": "game_theoretic_analysis"}, {"score": 0.0022231606165229235, "phrase": "specific_parameters"}, {"score": 0.0021050078070230173, "phrase": "elsevier"}], "paper_keywords": ["Digital rights management", " Security", " Incentives", " Game theory"], "paper_abstract": "Once electronic content-such as a password to access a website's resources-has been released, it is very difficult to prevent it from being shared. This disclosure often represents economic harm to the content's owner and others. Most attempts to prevent unauthorized sharing of digital content have been based on technology or legal punishments, but these approaches are not always applicable (as with passwords) or fast enough to prevent harm (as with the use of legal punishments). We propose the use of economic incentives to both limit and detect unauthorized sharing. This approach has the advantage of not requiring watermarking, encryption, or other traditional digital rights management techniques. Our protocol, called SPIES, is applicable to content that is shared to a limited extent and that meets several economic conditions. These conditions apply for many forms of content that are currently protected using technological sharing-prevention techniques. Such applications include passwords, trade secrets, pre-release content, and many others. We formalize this protocol using game theoretic analysis, and we show how to set the specific parameters under which SPIES can be useful. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Economic incentives for protecting digital rights online", "paper_id": "WOS:000296534700006"}