{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_integer_linear_programming_approaches"}, {"score": 0.00467855218490191, "phrase": "academic_timetabling_problem"}, {"score": 0.004595263305771512, "phrase": "course_timetabling_problem"}, {"score": 0.004449045430179066, "phrase": "multiple_classes"}, {"score": 0.0031390053628808706, "phrase": "timetabling_aspect"}, {"score": 0.00267931029131157, "phrase": "challenging_problem"}, {"score": 0.0025112011945912327, "phrase": "local_high_school"}, {"score": 0.0024842242921857705, "phrase": "integer_linear_programming_approaches"}, {"score": 0.002387758958649797, "phrase": "key_features"}, {"score": 0.0023033100935570755, "phrase": "identical_subject_selection"}, {"score": 0.0022058958906038466, "phrase": "block_composition"}, {"score": 0.002143247921132179, "phrase": "class_population_aspects"}, {"score": 0.0021049977753042253, "phrase": "strong_integrality_properties"}], "paper_keywords": ["academic timetabling", " blocking", " integer linear programming"], "paper_abstract": "The most complete form of academic timetabling problem is the population and course timetabling problem. In this problem, there may be multiple classes of each subject, and the decision on which students are to constitute each class is made in concert with the decision on the timetable for each class. In order to solve this problem, it is normally simplified or decomposed in some fashion. One simplification commonly used in practice is known as blocking: it is assumed that the classes can be partitioned into sets of classes (or blocks) that will be timetabled in parallel. This restricts clashing to occur only between classes in the same block, and essentially removes the timetabling aspect of the problem, which can be carried out, once the blocks are constituted and the classes populated. The problem of constituting the blocks and populating the classes, known as the course blocking and population problem, is nevertheless a challenging problem, and provides the focus of this paper. We demonstrate, using data provided by a local high school, that integer linear programming approaches can solve the problem in a matter of seconds. Key features include remodelling to remove symmetry caused by students with identical subject selection, and the observation that in practice, only integrality of the block composition variables needs to be enforced; the class population aspects of the model have strong integrality properties. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "New integer linear programming approaches for course timetabling", "paper_id": "WOS:000253025300007"}