{"auto_keywords": [{"score": 0.04984259146309732, "phrase": "convergent_sets"}, {"score": 0.040834622919398475, "phrase": "irreversible_cascade"}, {"score": 0.040254524476117166, "phrase": "active_vertices"}, {"score": 0.03404529157536075, "phrase": "irreversible_dynamic_monopoly"}, {"score": 0.00481495049065317, "phrase": "dynamic_monopolies"}, {"score": 0.004767546015485477, "phrase": "threshold-based_cascades"}, {"score": 0.004685703163787411, "phrase": "simple_directed_graph"}, {"score": 0.004296998284839309, "phrase": "vertex_v"}, {"score": 0.0037500444650556803, "phrase": "threshold_function"}, {"score": 0.0031220090519585592, "phrase": "finitely_many_rounds"}, {"score": 0.002884010773073439, "phrase": "inactive_or_vice_versa"}, {"score": 0.00263129148531588, "phrase": "vertical_bar_v_vertical_bar"}, {"score": 0.0023187577908351867, "phrase": "convergent_set"}, {"score": 0.002261965931783571, "phrase": "right_perpendicular_rho"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Consider the following reversible cascade on a simple directed graph G = (V, E). In round zero, a set of vertices, called the seeds, are active. In round k is an element of Z(+), a vertex v is an element of V is activated (deactivated) if at least (resp., fewer than) phi(v) of its in-neighbors are active in round k - 1, where phi: V -> N. An irreversible cascade is defined similarly except that active vertices cannot be deactivated. Two specific candidates for the threshold function 0 are phi(strict)(maj(v)) inverted right perpendicular(deg(-) (v) + 1)/2inverted left perpendicular and phi(rho)(v) inverted right perpendicular rho . deg(-) (v)inverted left perpendicular, where deg(-) (v) denotes the indegree of v is an element of V and rho is an element of (0, 1]. An irreversible dynamic monopoly is a set of seeds that leads all vertices to activation after finitely many rounds of the irreversible cascade with phi = phi(strict)(maj). A set of vertices, S, is said to be convergent if no vertex will ever change its state, from active to inactive or vice versa, once the set of active vertices equals S. This paper shows that an irreversible dynamic monopoly of size at most inverted right perpendicular vertical bar V vertical bar/2 inverted left perpendicular can be found in polynomial (in vertical bar V vertical bar) time if G is strongly connected. Furthermore, we show that for any constant epsilon > 0, all rho is an element of (0, 1], phi = phi(rho), p is an element of [ (1 + epsilon) (In(e/rho))/n, 1] and with probability 1 - n(-Omega(1)), every convergent set of the Erdos-Renyi random graph G(n, p) has size O(inverted right perpendicular rho ninverted left perpendicular) or n - O(inverted right perpendicular rho ninverted left perpendicular). Our result on convergent sets holds for both the reversible and irreversible cascades. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Bounding the sizes of dynamic monopolies and convergent sets for threshold-based cascades", "paper_id": "WOS:000313917200004"}