{"auto_keywords": [{"score": 0.03905383994125658, "phrase": "listener's_emotional_state"}, {"score": 0.004815166438825052, "phrase": "recommendation"}, {"score": 0.004640079189342692, "phrase": "emotion-based_music_recommendation"}, {"score": 0.00445318311339027, "phrase": "possible_usage_scenario"}, {"score": 0.0039040344230094164, "phrase": "robust_regression_methods"}, {"score": 0.003625347557965931, "phrase": "emotional_state"}, {"score": 0.00338037259057507, "phrase": "conditional_random_fields"}, {"score": 0.00327086925741257, "phrase": "emotion_intensity"}, {"score": 0.0031518989079229714, "phrase": "ranked_list"}, {"score": 0.0030497740719977835, "phrase": "particular_emotional_state"}, {"score": 0.002999955539996569, "phrase": "minimization_iteration_method"}, {"score": 0.0027064605585684696, "phrase": "illustrative_usage_scenario"}, {"score": 0.0022484715639779153, "phrase": "additional_music"}], "paper_keywords": ["Musical emotion", " emotional state", " music emotion recognition", " affective computing", " conditional random fields", " music recommendation"], "paper_abstract": "We present several interrelated technical and empirical contributions to the problem of emotion-based music recommendation and show how they can be applied in a possible usage scenario. The contributions are (1) a new three-dimensional resonance-arousal-valence model for the representation of emotion expressed in music, together with methods for automatically classifying a piece of music in terms of this model, using robust regression methods applied to musical/acoustic features; (2) methods for predicting a listener's emotional state on the assumption that the emotional state has been determined entirely by a sequence of pieces of music recently listened to, using conditional random fields and taking into account the decay of emotion intensity over time; and (3) a method for selecting a ranked list of pieces of music that match a particular emotional state, using a minimization iteration method. A series of experiments yield information about the validity of our operationalizations of these contributions. Throughout the article, we refer to an illustrative usage scenario in which all of these contributions can be exploited, where it is assumed that (1) a listener's emotional state is being determined entirely by the music that he or she has been listening to and (2) the listener wants to hear additional music that matches his or her current emotional state. The contributions are intended to be useful in a variety of other scenarios as well.", "paper_title": "Emotional States Associated with Music: Classification, Prediction of Changes, and Consideration in Recommendation", "paper_id": "WOS:000360088100004"}