{"auto_keywords": [{"score": 0.04210760395174611, "phrase": "se."}, {"score": 0.015719671478245243, "phrase": "social_engineering"}, {"score": 0.013357918350544201, "phrase": "individual_techniques"}, {"score": 0.0047559432344272, "phrase": "information_security_terms"}, {"score": 0.004678633673362615, "phrase": "se"}, {"score": 0.004527024978801684, "phrase": "information_system"}, {"score": 0.004398589723893764, "phrase": "social_methods"}, {"score": 0.0037621210719690594, "phrase": "analytical_concepts"}, {"score": 0.0034935290662899488, "phrase": "victim's_psychological_traits"}, {"score": 0.0030247625535682987, "phrase": "different_techniques"}, {"score": 0.0024116163689723354, "phrase": "different_theory"}, {"score": 0.0023624435546097658, "phrase": "victim's_personal_traits"}], "paper_keywords": ["social engineering", " information security", " intrusion", " fabrication", " persuasion", " data gathering"], "paper_abstract": "In information security terms, social engineering (SE) refers to incidents in which an information system is penetrated through the use of social methods. The literature to date (40 texts), which was reviewed for this article, emphasises individual techniques in its description of SE. This leads to a very scattered, anecdotal, and vague notion of SE. In addition, due to the lack of analytical concepts, research conducted on SE encounters difficulties in explaining the success of SE. In such explanations, the victim's psychological traits are overemphasised, although this kind of explanation can cover only a small portion of SE cases. In this article, we have sought to elaborate the concept of SE through analysis of the functions of different techniques. In this way, we have been able to extrapolate three dimensions of SE: persuasion, fabrication, and data gathering. By utilising these dimensions, SE can be grasped in all its aspects instead of through individual techniques. Furthermore, research can benefit from our multidimensional approach as each of the dimensions pertains to a different theory. Therefore, the victim's personal traits cannot function as the only explanation. All in all, the analysis, understanding, and explanation of the success of SE can be furthered using our new approach.", "paper_title": "Dissecting social engineering", "paper_id": "WOS:000326230600005"}