{"auto_keywords": [{"score": 0.04099449036132971, "phrase": "isp"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_file-sharing_users"}, {"score": 0.004328576620172575, "phrase": "prevailing_use"}, {"score": 0.004219321533320583, "phrase": "significant_implications"}, {"score": 0.0041835168653521, "phrase": "internet_service_providers"}, {"score": 0.003958049372486465, "phrase": "additional_costs"}, {"score": 0.0037928847801943404, "phrase": "satisfactory_service_level"}, {"score": 0.0036191240628152205, "phrase": "major_driving_force"}, {"score": 0.003542786326740931, "phrase": "broadband_access"}, {"score": 0.003468053168607071, "phrase": "significant_source"}, {"score": 0.0033517342967390065, "phrase": "successful_strategy"}, {"score": 0.0031845067058084583, "phrase": "subscriber_perspective"}, {"score": 0.002936577024096783, "phrase": "analytical_studies"}, {"score": 0.0028139168128067343, "phrase": "specific_contexts"}, {"score": 0.0027194778713860715, "phrase": "modeling_framework"}, {"score": 0.0026734504926268442, "phrase": "optimal_strategy"}, {"score": 0.0023221983158528163, "phrase": "sufficiently_large_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["peer-to-peer sharing systems", " analytical modeling", " traffic management", " utility-based modeling"], "paper_abstract": "Recent measurement studies have shown that traffic generated by peer-to-peer (P2P) file-sharing applications has started to dominate the bandwidth consumption on Internet access links. The prevailing use of P2P applications carries with it significant implications for Internet Service Providers (ISPs): on the one hand increased levels of P2P traffic result in additional costs for an ISP, which has to provide a satisfactory service level to its subscribers. On the other hand, P2P applications are a major driving force for the adoption of broadband access, which is a significant source of revenue for the ISPs. A successful strategy to manage P2P traffic must address both the ISP perspective of costs and the subscriber perspective of quality of service. While several practical solutions have been identified to manage P2P traffic in a network, no analytical studies have been proposed so far to evaluate their effectiveness in specific contexts. In this paper we propose a modeling framework that allows the optimal strategy to be identified for an ISP as a function of the several factors that come into play. In particular, our model shows that P2P-friendly solutions become lucrative when the ISP can attract a sufficiently large number of subscribers. Our modeling framework also illustrates several other interesting phenomena that occur in the tussle between the ISP and its subscribers. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A modeling framework to understand the tussle between ISPs and peer-to-peer file-sharing users", "paper_id": "WOS:000249805400002"}