{"auto_keywords": [{"score": 0.025948790611858036, "phrase": "centrality_measures"}, {"score": 0.00481495049065317, "phrase": "co-citation_networks"}, {"score": 0.00458488025289647, "phrase": "pagerank_algorithm_influence"}, {"score": 0.00436575511349828, "phrase": "pagerank_algorithms"}, {"score": 0.0038624981944755813, "phrase": "co-citation_network"}, {"score": 0.003545024951402818, "phrase": "damping_factor"}, {"score": 0.003253560798692431, "phrase": "different_measures"}, {"score": 0.003116913644889395, "phrase": "pagerank_results"}, {"score": 0.0030601162942933665, "phrase": "citation_ranking"}, {"score": 0.002673957615079041, "phrase": "different_damping_factors"}, {"score": 0.0026091594819333654, "phrase": "different_weighted_pagerank_algorithms"}, {"score": 0.0023944552329463035, "phrase": "h-index_rank"}, {"score": 0.002183938718432764, "phrase": "key_factors"}, {"score": 0.0021049977753042253, "phrase": "pagerank_of_authors_in_the_author_co-citation_network"}], "paper_keywords": [""], "paper_abstract": "This paper studies how varied damping factors in the PageRank algorithm influence the ranking of authors and proposes weighted PageRank algorithms. We selected the 108 most highly cited authors in the information retrieval (IR) area from the 1970s to 2008 to form the author co-citation network. We calculated the ranks of these 108 authors based on PageRank with the damping factor ranging from 0.05 to 0.95. In order to test the relationship between different measures, we compared PageRank and weighted PageRank results with the citation ranking, h-index, and centrality measures. We found that in our author co-citation network, citation rank is highly correlated with PageRank with different damping factors and also with different weighted PageRank algorithms; citation rank and PageRank are not significantly correlated with centrality measures; and h-index rank does not significantly correlate with centrality measures but does significantly correlate with other measures. The key factors that have impact on the PageRank of authors in the author co-citation network are being co-cited with important authors.", "paper_title": "PageRank for Ranking Authors in Co-citation Networks", "paper_id": "WOS:000271199600005"}