{"auto_keywords": [{"score": 0.047970577724312555, "phrase": "routing_reconfiguration_problem"}, {"score": 0.013449548965674286, "phrase": "total_number"}, {"score": 0.00481495049065317, "phrase": "process_strategy_games"}, {"score": 0.004738177185041523, "phrase": "wdm_reconfiguration_problem"}, {"score": 0.004662622277282557, "phrase": "variant_of_the_graph_searching_games"}, {"score": 0.004573537724320323, "phrase": "wdm_networks"}, {"score": 0.004515091332353969, "phrase": "digraph_processing_game"}, {"score": 0.003782957707237928, "phrase": "maximum_number"}, {"score": 0.0037586895199831095, "phrase": "simultaneous_connections"}, {"score": 0.0036396555012105365, "phrase": "routing_reconfiguration"}, {"score": 0.0036046832119756528, "phrase": "wdm_network"}, {"score": 0.0035815545681927665, "phrase": "previous_works"}, {"score": 0.00339083755411773, "phrase": "corresponding_minimization_problems"}, {"score": 0.003220596600693125, "phrase": "apx."}, {"score": 0.0031286075376993103, "phrase": "study_tradeoffs"}, {"score": 0.003098530474496842, "phrase": "conflicting_objectives"}, {"score": 0.00291521838495286, "phrase": "np"}, {"score": 0.002554021496818708, "phrase": "basic_class"}, {"score": 0.002433519998239738, "phrase": "good_tradeoffs"}, {"score": 0.0022307321581833918, "phrase": "processing_game"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph searching games", " Process number", " Routing reconfiguration problem"], "paper_abstract": "We consider a variant of the graph searching games that models the routing reconfiguration problem in WDM networks. In the digraph processing game, a team of agents aims at processing, or clearing, the vertices of a digraph D. We are interested in two different measures: (1) the total number of agents used, and (2) the total number of vertices occupied by an agent during the processing of D. These measures, respectively, correspond to the maximum number of simultaneous connections interrupted and to the total number of interruptions during a routing reconfiguration in a WDM network. Previous works have studied the problem of independently minimizing each of these parameters. In particular, the corresponding minimization problems are APX-hard, and the first one is known not to be in APX. In this paper, we give several complexity results and study tradeoffs between these conflicting objectives. In particular, we show that minimizing one of these parameters while the other is constrained is NP-complete. Then, we prove that there exist some digraphs for which minimizing one of these objectives arbitrarily impairs the quality of the solution for the other one. We show that such bad tradeoffs may happen even for a basic class of digraphs. On the other hand, we exhibit classes of graphs for which good tradeoffs can be achieved. We finally detail the relationship between this game and the routing reconfiguration problem. In particular, we prove that any instance of the processing game, i.e. any digraph, corresponds to an instance of the routing reconfiguration problem. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Tradeoffs in process strategy games with application in the WDM reconfiguration problem", "paper_id": "WOS:000294031200021"}