{"auto_keywords": [{"score": 0.048912784012203225, "phrase": "propositional_proof_systems"}, {"score": 0.010123420520744273, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "canonical_disjoint_np-pairs."}, {"score": 0.0041184843463633386, "phrase": "proof_systems"}, {"score": 0.003961908592295743, "phrase": "disjoint_np-complete_sets"}, {"score": 0.0035224030823976186, "phrase": "different_strengths"}, {"score": 0.0032979090806670493, "phrase": "corresponding_propositional_proof_systems"}, {"score": 0.0029509483926257645, "phrase": "canonical_pair"}, {"score": 0.0029147175927233546, "phrase": "propositional_proof_system"}, {"score": 0.002651291854234327, "phrase": "previous_results"}, {"score": 0.00262954010224771, "phrase": "pudlak"}, {"score": 0.002607965660172984, "phrase": "beyersdorff"}, {"score": 0.0025547994452342266, "phrase": "inequivalent_canonical_pairs"}, {"score": 0.0022577559526646904, "phrase": "open_problem"}, {"score": 0.002239225269052105, "phrase": "structural_complexity"}, {"score": 0.0021049977753042253, "phrase": "new_connection"}], "paper_keywords": ["Disjoint NP-pairs", " canonical NP-pairs", " propositional proof systems", " P-inseparable NP-pairs"], "paper_abstract": "We investigate the connection between propositional proof systems and their canonical pairs. It is known that simulations between propositional proof systems translate to reductions between their canonical pairs. We focus on the opposite direction and study the following questions. Q1: For which propositional proof systems f and g does the implication [can(f) <=(P)(m) can(g) double right arrow f <= g] hold, and for which does it fail? Q2: For which propositional proof systems of different strengths are the canonical pairs equivalent? Q3: What do (non-)equivalent canonical pairs tell about the corresponding propositional proof systems? Q4: Is every NP-pair (A, B), where A is NP-complete, strongly many-one equivalent to the canonical pair of some propositional proof system? In short, we show that Q1 and Q2 can be answered with 'for almost all', which generalizes previous results by Pudlak and Beyersdorff. Regarding Q3, inequivalent canonical pairs tell that the propositional proof systems are not \"very similar,\" while equivalent, P-inseparable canonical pairs tell that they are not \"very different.\" We can relate Q4 to the open problem in structural complexity that asks whether unions of disjoint NP-complete sets are NP-complete. This demonstrates a new connection between propositional proof systems, disjoint NP-pairs, and unions of disjoint NP-complete sets.", "paper_title": "THE INFORMATIONAL CONTENT OF CANONICAL DISJOINT NP-PAIRS", "paper_id": "WOS:000266614100009"}