{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "refining_partition"}, {"score": 0.026373727716427306, "phrase": "correlation_loss"}, {"score": 0.011416786986770582, "phrase": "initial_partition"}, {"score": 0.006044761494015834, "phrase": "different_sa_values"}, {"score": 0.005144871795374807, "phrase": "optimizing_model"}, {"score": 0.004607686390487483, "phrase": "privacy_preserving_data_publishing"}, {"score": 0.004452641437293878, "phrase": "sensitive_attribute"}, {"score": 0.004260906498835763, "phrase": "anonymization_methods"}, {"score": 0.003715425273229361, "phrase": "anonymizing_demands"}, {"score": 0.0036792371574197826, "phrase": "l_-diversity"}, {"score": 0.002356173823922118, "phrase": "existing_partitioning_method"}, {"score": 0.0022434880661725493, "phrase": "new_partitioning_method"}, {"score": 0.0021678232353129472, "phrase": "data_utility"}, {"score": 0.0021361800485636823, "phrase": "experimental_evaluation"}], "paper_keywords": ["anonymization", " refining partition", " correlation loss"], "paper_abstract": "In privacy preserving data publishing, to reduce the correlation loss between sensitive attribute (SA) and non-sensitive attributes(NSAs) caused by anonymization methods (such as generalization, anatomy, slicing and randomization, etc.), the records with same NSAs values should be divided into same blocks to meet the anonymizing demands of l -diversity. However, there are often many blocks (of the initial partition), in which there are more than l records with different SA values, and the frequencies of different SA values are uneven. Therefore, anonymization on the initial partition causes more correlation loss. To reduce the correlation loss as far as possible, in this paper, an optimizing model is first proposed. Then according to the optimizing model, the refining partition of the initial partition is generated, and anonymization is applied on the refining partition. Although anonymization on refining partition can be used on top of any existing partitioning method to reduce the correlation loss, we demonstrate that a new partitioning method tailored for refining partition could further improve data utility. An experimental evaluation shows that our approach could efficiently reduce correlation loss.", "paper_title": "Anonymization on Refining Partition: Same Privacy, More Utility", "paper_id": "WOS:000366127000004"}