{"auto_keywords": [{"score": 0.03433982947723256, "phrase": "segmentation_model"}, {"score": 0.00481495049065317, "phrase": "online_learning"}, {"score": 0.004081385289516914, "phrase": "online_framework"}, {"score": 0.003967314311312148, "phrase": "boring_collection_preparation"}, {"score": 0.0033624514778823763, "phrase": "online_multi-class_lpboost"}, {"score": 0.0030881143614111552, "phrase": "weak_learners"}, {"score": 0.0030017207229983385, "phrase": "graph_cuts_optimization"}, {"score": 0.0028495431343111897, "phrase": "optimal_data_term"}, {"score": 0.002519739850807611, "phrase": "segmentation_results"}, {"score": 0.002449208093757498, "phrase": "users'_requirements"}, {"score": 0.0022385926290967263, "phrase": "new_shapes"}, {"score": 0.0022175019341824603, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D shape", " Progressive segmentation", " Online learning", " Shape set"], "paper_abstract": "In this article, we propose a progressive 3D shape segmentation method, which allows users to guide the segmentation with their interactions, and does segmentation gradually driven by their intents. More precisely, we establish an online framework for interactive 3D shape segmentation, without any boring collection preparation or training stages. That is, users can collect the 3D shapes while segment them, and the segmentation will become more and more precise as the accumulation of the shapes. Our framework uses Online Multi-Class LPBoost (OMCLP) to train/update a segmentation model progressively, which includes several Online Random forests (ORFs) as the weak learners. Then, it performs graph cuts optimization to segment the 3D shape by using the trained/updated segmentation model as the optimal data term. There exist three features of our framework. Firstly, the segmentation model can be trained gradually during the collection of the shapes. Secondly, the segmentation results can be refined progressively until users' requirements are met. Thirdly, the segmentation model can be updated incrementally without retraining all shapes when users add new shapes. Experimental results demonstrate the effectiveness of our approach. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Progressive 3D shape segmentation using online learning", "paper_id": "WOS:000343625400002"}