{"auto_keywords": [{"score": 0.048339607507904336, "phrase": "structured_nonlinear_parameter_optimization_method"}, {"score": 0.024951881887220233, "phrase": "proposed_model"}, {"score": 0.00481495049065317, "phrase": "nonlinear_structured_parameter_optimization_method"}, {"score": 0.004697655699119423, "phrase": "local_polynomial_wavelet_neural_network"}, {"score": 0.004344662696228875, "phrase": "hybrid_learning_approach"}, {"score": 0.0041696157492057, "phrase": "mainly_three_differences"}, {"score": 0.004067977399245212, "phrase": "lpwnn-snpom_method"}, {"score": 0.003746673633703251, "phrase": "target_points"}, {"score": 0.0036855132234738736, "phrase": "hidden_neurons"}, {"score": 0.0034506596895901003, "phrase": "overall_performance"}, {"score": 0.003284361433827464, "phrase": "single_parameter_weights"}, {"score": 0.003244050414264445, "phrase": "hidden_layer"}, {"score": 0.0031132086055691214, "phrase": "polynomial_functions"}, {"score": 0.0028086649378423357, "phrase": "wavelet_compartment"}, {"score": 0.002673223453963085, "phrase": "online_optimization_approach"}, {"score": 0.0025865679621853667, "phrase": "offline_optimization_approach"}, {"score": 0.0024215727801940434, "phrase": "online_optimization"}], "paper_keywords": ["wavelet", " wavelet neural network", " modeling", " prediction", " optimization"], "paper_abstract": "This paper presents a Local Polynomial Wavelet Neural Network with a Structured Nonlinear Parameter Optimization Method (LPWNN-SNPOM). The LPWNN-SNPOM is an improvement of the Wavelet Neural Network with a Hybrid Learning Approach (WNN-HLA). These two models have mainly three differences: (i) The LPWNN-SNPOM method contains a bias, whose main contribution is to shift the output by mapping all points to the mean of the target points and leaving the hidden neurons and polynomial weight model the differences from that point. The bias may ameliorate the overall performance of the network to a certain degree; (ii) The single parameter weights connecting the hidden layer with the output in the WNN-HLA are replaced by polynomial functions of the inputs in the LPWNN-SNPOM, allowing the weights to vary with the changes in the input and share the dynamics with the wavelet compartment; (iii) Unlike the WNN-HLA, which uses an online optimization approach, the LPWNN-SNPOM makes usage of an offline optimization approach known as the Structured Nonlinear Parameter Optimization Method (SNPOM) to avoid any failure that may occur during online optimization. The performance and effectiveness of the proposed model are illustrated using several examples, whose results show the feasibility of the proposed model and demonstrate that it improved upon the WNN-HLA and performed better than some other well-known models.", "paper_title": "Local Polynomial Wavelet Neural Network with a Nonlinear Structured Parameter Optimization Method", "paper_id": "WOS:000333657300008"}