{"auto_keywords": [{"score": 0.04476987451361031, "phrase": "cultural_heritage"}, {"score": 0.008490830050496426, "phrase": "user_model"}, {"score": 0.00481495049065317, "phrase": "social_multi-device_adaptive_guides"}, {"score": 0.004610058444728656, "phrase": "user_modeling"}, {"score": 0.004169754607580288, "phrase": "recommender_systems"}, {"score": 0.003952316497572257, "phrase": "adaptive_web-based_systems"}, {"score": 0.003809416146761322, "phrase": "social_navigation"}, {"score": 0.0037336520904376687, "phrase": "bottom-up_perspective"}, {"score": 0.003671663469605366, "phrase": "social_annotation"}, {"score": 0.0036349635956605675, "phrase": "new_and_powerful_kind"}, {"score": 0.0034684722988160637, "phrase": "prototype_implementation"}, {"score": 0.002913941927270944, "phrase": "torino"}, {"score": 0.0027068216332674895, "phrase": "different_stages"}, {"score": 0.0026797398345997114, "phrase": "systems_development"}, {"score": 0.002582731586309754, "phrase": "specific_prototype"}, {"score": 0.0025059724686541263, "phrase": "heuristic_evaluation"}, {"score": 0.0024725918236048632, "phrase": "usability_tests"}, {"score": 0.0023990982005125763, "phrase": "user_interface"}, {"score": 0.0023592142778542055, "phrase": "adaptive_behavior"}], "paper_keywords": ["Web 2.0", " Tag", " Annotation", " User model", " Recommendations", " Cultural events"], "paper_abstract": "This paper aims to demonstrate that the principles of adaptation and user modeling, especially social annotation, can be integrated fruitfully with those of the web 2.0 paradigm and thereby enhance in the domain of cultural heritage. We propose a framework for improving recommender systems through exploiting the users tagging activity. We maintain that web 2.0's participative features can be exploited by adaptive web-based systems in order to enrich and extend the user model, improve social navigation and enrich information from a bottom-up perspective. Thus our approach stresses social annotation as a new and powerful kind of feedback and as a way to infer knowledge about users. The prototype implementation of our framework in the domain of cultural heritage is named iCITY. It is serving to demonstrate the validity of our approach and to highlight the benefits of this approach specifically for cultural heritage. iCITY is an adaptive, social, multi-device recommender guide that provides information about the cultural resources and events promoting the cultural heritage in the city of Torino. Our paper first describes this system and then discusses the results of a set of evaluations that were carried out at different stages of the systems development and aimed at validating the framework and implementation of this specific prototype. In particular, we carried out a heuristic evaluation and two sets of usability tests, aimed at checking the usability of the user interface, specifically of the adaptive behavior of the system. Moreover, we conducted evaluations aimed at investigating the role of tags in the definition of the user model and the impact of tags on the accuracy of recommendations. Our results are encouraging.", "paper_title": "Tag-based user modeling for social multi-device adaptive guides", "paper_id": "WOS:000260379400005"}