{"auto_keywords": [{"score": 0.050077933271407964, "phrase": "xml_documents"}, {"score": 0.04195061461553761, "phrase": "dtd"}, {"score": 0.028029656495340078, "phrase": "xmlppm"}, {"score": 0.004765788394931875, "phrase": "recursive_finite_state_automata"}, {"score": 0.004300830853119242, "phrase": "lossless_adaptive_algorithm"}, {"score": 0.0038217146888983576, "phrase": "arithmetic_compressor"}, {"score": 0.00374399358035391, "phrase": "compressed_version"}, {"score": 0.0035201528214608914, "phrase": "syntactic_specification"}, {"score": 0.0030327408069772293, "phrase": "compressor_generator"}, {"score": 0.0028807718824400697, "phrase": "large_xml_databases"}, {"score": 0.0027223626424366207, "phrase": "average_compression"}, {"score": 0.002546315584783112, "phrase": "line_tool"}, {"score": 0.002393907896783117, "phrase": "massive_documents"}, {"score": 0.0022047613106966745, "phrase": "main_appeal"}, {"score": 0.0021049977753042253, "phrase": "underlying_model"}], "paper_keywords": [""], "paper_abstract": "We propose a scheme for automatically generating compressors for XML documents from Document Type Definition(DTD) specifications. Our algorithm is a lossless adaptive algorithm where the model used for compression and decompression is generated automatically from the DTD, and is used in conjunction with an arithmetic compressor to produce a compressed version of the document. The structure of the model mirrors the syntactic specification of the document. Our compression scheme is on-line, that is, it can compress the document as it is being read. We have implemented the compressor generator, and provide the results of experiments on some large XML databases whose DTD's are specified. We note that the average compression is better than that of XMLPPM, the only other on-line tool we are aware of. The tool is able to compress massive documents where XMLPPM failed to work as it ran out of memory. We believe the main appeal of this technique is the fact that the underlying model is so simple and yet so effective.", "paper_title": "Compressing XML documents using recursive finite state automata", "paper_id": "WOS:000236480300024"}