{"auto_keywords": [{"score": 0.03333707801415392, "phrase": "cooperative_routing"}, {"score": 0.03303780353868204, "phrase": "coded_cooperation"}, {"score": 0.00481495049065317, "phrase": "wireless_systems"}, {"score": 0.004554082077300675, "phrase": "wireless_channels"}, {"score": 0.0044289730051264116, "phrase": "communication_diversity"}, {"score": 0.004367707617503722, "phrase": "cooperative_paradigms"}, {"score": 0.004307286039184164, "phrase": "third-party_nodes"}, {"score": 0.003852939975815287, "phrase": "existing_works"}, {"score": 0.003817306032290766, "phrase": "similar_evaluations"}, {"score": 0.003712362078915926, "phrase": "single_link"}, {"score": 0.0036271080216837286, "phrase": "network-wide_perspective"}, {"score": 0.0032745778756077693, "phrase": "multiple-input_multiple-output_ad_hoc_scenario"}, {"score": 0.0029152570900178956, "phrase": "proper_relay"}, {"score": 0.0027698788736535865, "phrase": "overall_increase"}, {"score": 0.0024772998651215964, "phrase": "advantageous_manner"}, {"score": 0.0023210846870653757, "phrase": "significant_improvement"}, {"score": 0.0022258906408344973, "phrase": "future_evolutions"}, {"score": 0.002195033004022173, "phrase": "cooperation_paradigm"}], "paper_keywords": [""], "paper_abstract": "The impact of fading and other impairments in wireless channels can be counteracted by leveraging communication diversity and introducing cooperative paradigms, where third-party nodes contribute to assist the communication. In this article we describe and evaluate two possible cooperative approaches, cooperative relaying and coded cooperation. Different from existing works where similar evaluations are mainly performed investigating a single link, we take a network-wide perspective to evaluate the effects of cooperation not only where it is performed but also on other links. We focus on a multiple-input multiple-output ad hoc scenario and show that the improvement brought by cooperative routing and coded cooperation is not always sufficient; in certain cases the former can be ineffective if no proper relay can be selected, and the latter leads to an overall increase of interference, thus worsening the quality of surrounding links. However, we suggest that these two features can be combined in an advantageous manner in order to mutually overcome their problems. Such a joint solution is shown to achieve a significant improvement over the two individual approaches. We conclude by discussing future evolutions of the cooperation paradigm, including both cooperative routing and coded cooperation, and their advanced implementation issues.", "paper_title": "COOPERATION TECHNIQUES FOR WIRELESS SYSTEMS FROM A NETWORKING PERSPECTIVE", "paper_id": "WOS:000282380800013"}