{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "amino_acid_groupings"}, {"score": 0.03812022871741232, "phrase": "local_descriptors"}, {"score": 0.004753194996637899, "phrase": "gpcr_classification"}, {"score": 0.0040708542958968605, "phrase": "so-called_reduced_alphabet"}, {"score": 0.003916098498242888, "phrase": "universally_applicable_residue_grouping"}, {"score": 0.003816197777388722, "phrase": "numerous_physiochemical_criteria"}, {"score": 0.0035087260813209593, "phrase": "alignment-free_analysis"}, {"score": 0.003289117944111902, "phrase": "correct_selection"}, {"score": 0.0029089095588612007, "phrase": "optimization_algorithm"}, {"score": 0.00250682585023182, "phrase": "relatively_new_computational_intelligence_paradigm"}, {"score": 0.0021049977753042253, "phrase": "accurate_classification_algorithm"}], "paper_keywords": [""], "paper_abstract": "Motivation: There is much interest in reducing the complexity inherent in the representation of the 20 standard amino acids within bioinformatics algorithms by developing a so-called reduced alphabet. Although there is no universally applicable residue grouping, there are numerous physiochemical criteria upon which one can base groupings. Local descriptors are a form of alignment-free analysis, the efficiency of which is dependent upon the correct selection of amino acid groupings. Results: Within the context of G-protein coupled receptor (GPCR) classification, an optimization algorithm was developed, which was able to identify the most efficient grouping when used to generate local descriptors. The algorithm was inspired by the relatively new computational intelligence paradigm of artificial immune systems. A number of amino acid groupings produced by this algorithm were evaluated with respect to their ability to generate local descriptors capable of providing an accurate classification algorithm for GPCRs.", "paper_title": "Optimizing amino acid groupings for GPCR classification", "paper_id": "WOS:000258959600002"}