{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "-many_feature"}, {"score": 0.004750873844061641, "phrase": "object_recognition"}, {"score": 0.0046046429665581555, "phrase": "current_recognition"}, {"score": 0.004136469845987887, "phrase": "generic_object_recognition_task"}, {"score": 0.0037827603118271757, "phrase": "single_feature"}, {"score": 0.003732368382223596, "phrase": "coarser_scale"}, {"score": 0.003666217992454448, "phrase": "second_image"}, {"score": 0.0036173729405604674, "phrase": "generic_object_recognition"}, {"score": 0.0030794433253250476, "phrase": "many-to-many_matching_problem"}, {"score": 0.002741269087816162, "phrase": "object_exemplars"}, {"score": 0.0024620842899061614, "phrase": "extracted_features"}, {"score": 0.002291905937251069, "phrase": "entire_subgraphs"}, {"score": 0.0021430393104977788, "phrase": "geometric_spaces"}], "paper_keywords": [""], "paper_abstract": "One of the bottlenecks of current recognition (and graph matching) systems is their assumption of one-to-one feature (node) correspondence. This assumption breaks down in the generic object recognition task where, for example, a collection of features at one scale (in one image) may correspond to a single feature at a coarser scale (in the second image). Generic object recognition therefore requires the ability to match features many-to-many. In this paper, we will review our progress on three independent object recognition problems, each formulated as a graph matching problem and each solving the many-to-many matching problem in a different way. First, we explore the problem of learning a 2-D shape class prototype (represented as a graph) from a set of object exemplars (also represented as graphs) belonging to the class, in which there may be no one-to-one correspondence among extracted features. Next, we define a low-dimensional, spectral encoding of graph structure and use it to match entire subgraphs whose size can be different. Finally, in very recent work, we embed graphs into geometric spaces, reducing the many-to-many graph matching problem to a weighted point matching problem, for which efficient many-to-many matching algorithms exist.", "paper_title": "Many-to-many feature matching in object recognition", "paper_id": "WOS:000239148600008"}