{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media_information"}, {"score": 0.008596524107552838, "phrase": "multiple_contexts"}, {"score": 0.0047823219739028325, "phrase": "mobile_devices"}, {"score": 0.004717723626157272, "phrase": "purpose_-_research"}, {"score": 0.004622450915803531, "phrase": "large_amounts"}, {"score": 0.004560002169647084, "phrase": "small_devices"}, {"score": 0.004437613070853689, "phrase": "user_preferences"}, {"score": 0.004294962644653173, "phrase": "context_types"}, {"score": 0.003807684498435389, "phrase": "multiple_context"}, {"score": 0.0037230294691649665, "phrase": "identity_context"}, {"score": 0.003509006038574667, "phrase": "user_evaluation_study"}, {"score": 0.003438058620195309, "phrase": "users'_preferred_ways"}, {"score": 0.003403122817578447, "phrase": "different_types"}, {"score": 0.003327432235564841, "phrase": "users'_needs"}, {"score": 0.0028218336994432864, "phrase": "temporal_context"}, {"score": 0.0027273213556458214, "phrase": "media_elements"}, {"score": 0.002618064695883912, "phrase": "different_sequences"}, {"score": 0.00226892463779702, "phrase": "user_interface"}, {"score": 0.002222994077182071, "phrase": "mobile_applications"}, {"score": 0.0022078909877264884, "phrase": "large_amount"}, {"score": 0.0021411841686226297, "phrase": "new_way"}, {"score": 0.0021049977753042253, "phrase": "multiple_context_types"}], "paper_keywords": ["Social media", " Context", " Information organization", " Mobile application design", " User interface design"], "paper_abstract": "Purpose - Research has shown that when presenting large amounts of social media information on small devices, design should consider multiple contexts which include user preferences, time, location, environment and so on. It should also take into account the purpose of use, for example, the kind of tasks undertaken by users. However, little research has been done on the organization of social media information by multiple context and tasks. The paper aims to discuss these issues. Design/methodology/approach - Using tourism as a domain, the authors conducted a user evaluation study with a prototype to investigate users' preferred ways of organizing different types of social media information based on multiple contexts. Findings - In this paper, the authors present a sequence of context types for organizing four types of social media information (recommendations, events, friends and media elements). The study revealed that users preferred to view recommendations by location and environment context, events by location and temporal context, contacts by location and identity context and finally, list of media elements by environment and identity context. Research limitations/implications - There may be different sequences of context types for organizing social media information in domains other than tourism. Researchers are encouraged to analyze users' needs in other domains so as to find their preferred ways of organizing social media information. Practical implications - This paper includes implications for the design and development of user interface, in particular, for mobile applications presenting large amount of social media information. Originality/value - It presents a new way of organizing social media information using multiple context types and with consideration of users' needs.", "paper_title": "Presenting social media information on mobile devices using multiple contexts", "paper_id": "WOS:000352709900004"}