{"auto_keywords": [{"score": 0.00438399094249306, "phrase": "structural_model"}, {"score": 0.004207734323806386, "phrase": "comparative_modelling"}, {"score": 0.0038309141193444015, "phrase": "alsin_region"}, {"score": 0.0037201996003549246, "phrase": "seven-bladed_beta-propeller_structure"}, {"score": 0.0035496495489801667, "phrase": "double_clasp_arrangement"}, {"score": 0.0028736379396305596, "phrase": "surface_patches"}, {"score": 0.00284009509859163, "phrase": "evolutionary_conservation"}, {"score": 0.0027579362569638945, "phrase": "binding_sites"}, {"score": 0.0023124457559811087, "phrase": "experimental_studies"}, {"score": 0.0022323643840655646, "phrase": "construct_length"}, {"score": 0.0021550502873107654, "phrase": "protein-protein_interactions"}, {"score": 0.0021049977753042253, "phrase": "rational_site-directed_mutagenesis"}], "paper_keywords": ["Alsin", " Beta-propeller", " Comparative modeling", " Fold recognition", " Protein disorder", " RCC1 repeat"], "paper_abstract": "Defects in the human ALS2 gene, which encodes the 1,657-amino-acid residue protein alsin, are linked to several related motor neuron diseases. We created a structural model for the N-terminal 690-residue region of alsin through comparative modelling based on regulator of chromosome condensation 1 (RCC1). We propose that this alsin region contains seven RCC1-like repeats in a seven-bladed beta-propeller structure. The propeller is formed by a double clasp arrangement containing two segments (residues 1-218 and residues 525-690). The 306-residue insert region, predicted to lie within blade 5 and to be largely disordered, is poorly conserved across species. Surface patches of evolutionary conservation probably indicate locations of binding sites. Both disease-causing missense mutations-Cys157Tyr and Gly540Glu-are buried in the propeller and likely to be structurally disruptive. This study aids design of experimental studies by highlighting the importance of construct length, will enhance interpretation of protein-protein interactions, and enable rational site-directed mutagenesis.", "paper_title": "An interrupted beta-propeller and protein disorder: structural bioinformatics insights into the N-terminus of alsin", "paper_id": "WOS:000262435000002"}