{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "energy_efficiency"}, {"score": 0.03577261093889878, "phrase": "game_theory"}, {"score": 0.01560068052155718, "phrase": "wireless_sensor_networks"}, {"score": 0.014624056864324159, "phrase": "network_lifetime"}, {"score": 0.01141523995008441, "phrase": "required_service"}, {"score": 0.004307099985737249, "phrase": "considered_wsns"}, {"score": 0.004208881856146758, "phrase": "limited_resources"}, {"score": 0.0040971095888461045, "phrase": "dual_rule"}, {"score": 0.003202944392720772, "phrase": "limited_information"}, {"score": 0.0030232568024943455, "phrase": "remarkable_amount"}, {"score": 0.0026218430041123164, "phrase": "complete_taxonomy"}, {"score": 0.0025619562094446884, "phrase": "specific_research_problem"}, {"score": 0.002493810638588771, "phrase": "different_published_proposals"}, {"score": 0.002446245096967702, "phrase": "statistical_charts"}, {"score": 0.002282380944889266, "phrase": "clear_view"}, {"score": 0.002256155453630723, "phrase": "newest_trends"}, {"score": 0.0022302306304023602, "phrase": "research_area"}, {"score": 0.002154226045704907, "phrase": "new_research_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wireless sensor networks", " Game theory", " Energy efficiency", " Network lifetime"], "paper_abstract": "In the area of Wireless Sensor Networks (WSNs), improving energy efficiency and network lifetime is one of the most important and challenging issues. Most of the considered WSNs are formed by nodes with limited resources, in which each node plays dual rule of both sensing the environment and relaying traffic to the sink from other nodes. On the one hand, the nodes need to stay alive as long as possible by achieving energy efficiency. On the other hand, they have to provide the required service. This conflict of interest makes game theory very useful in WSNs. Moreover, nodes usually have to make decisions with limited information about the state of the network. Game theory has been used recently in a remarkable amount of research in this area. In this survey, we review the most recent papers about using game theory in WSNs to achieve a trade-off between maximizing the network lifetime and providing the required service. The paper contains a complete taxonomy of games applied to this specific research problem. It summarizes and compares the different published proposals along with tables and statistical charts showing in which domains game theory has been applied recently. Overall, the paper will give to researchers a clear view of the newest trends in this research area, underlining its main challenges and hopefully fostering discussions and new research directions. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Game theory for energy efficiency in Wireless Sensor Networks: Latest trends", "paper_id": "WOS:000356747900004"}