{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "collaborative_learning_activities"}, {"score": 0.00481495049065317, "phrase": "graphical_notation"}, {"score": 0.004291073117901643, "phrase": "graphical_nature"}, {"score": 0.004081385289516914, "phrase": "learning_systems"}, {"score": 0.0038048583022763796, "phrase": "collaborative_tasks"}, {"score": 0.0036370297611938796, "phrase": "main_features"}, {"score": 0.003339886795391701, "phrase": "cian_notation"}, {"score": 0.0024717881264735477, "phrase": "understandability_exercises"}, {"score": 0.0023390219342052623, "phrase": "eye_tracker_device"}, {"score": 0.0022696277881969896, "phrase": "positive_perceptions"}, {"score": 0.0022022878843247257, "phrase": "clan_notation"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Educational modeling", " CSCL", " Notation assessments", " Empirical study", " Eye tracking"], "paper_abstract": "It is increasingly common to use languages and notations, mainly of a graphical nature, to assist in the design and specification of learning systems. There are several proposals, although few of them support the modeling of collaborative tasks. In this paper, we identify the main features to be considered for modeling this kind of activities and we propose the use of the CIAN notation for this purpose. In this work, we also try to empirically analyze the quality (in particular the understandability) of that notation. To this end, three empirical studies have been conducted. In these experiments we used several sources of information: subjective perception of the designers, their profiles and their performance on a set of understandability exercises, as well as the physical evidence provided by an eye tracker device. The results obtained denote positive perceptions about the use of the CLAN notation for modeling collaborative learning activities. (C) 2014 Elsevier BM. All rights reserved.", "paper_title": "Evaluating a graphical notation for modeling collaborative learning activities: A family of experiments", "paper_id": "WOS:000336476900005"}