{"auto_keywords": [{"score": 0.04933167036983738, "phrase": "multiple-interval_graphs"}, {"score": 0.010612387000973441, "phrase": "parameterized_complexity"}, {"score": 0.0105296961632612, "phrase": "multiple-interval_graph_problems"}, {"score": 0.010245267195804857, "phrase": "interval_graphs"}, {"score": 0.00800477130385405, "phrase": "k-independent_set"}, {"score": 0.004684157900507474, "phrase": "natural_generalization"}, {"score": 0.0041625173012740544, "phrase": "specific_application"}, {"score": 0.0040176151419992956, "phrase": "recent_systematic_study"}, {"score": 0.003986103192038901, "phrase": "optimization_problems"}, {"score": 0.003378385493203297, "phrase": "general_graphs"}, {"score": 0.003339144341171253, "phrase": "np"}, {"score": 0.0031845313393485944, "phrase": "fpt"}, {"score": 0.0029781530607129653, "phrase": "k-independent_dominating_set"}, {"score": 0.0026459927476753585, "phrase": "unit_length"}, {"score": 0.0025841336988141235, "phrase": "interesting_byproduct"}, {"score": 0.0025137856138000014, "phrase": "useful_technique"}, {"score": 0.002426137929553722, "phrase": "k-multicolored_clique_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple intervals", " Independent set", " Dominating set", " Clique", " W-hardness", " Parameterized complexity", " Multicolored clique"], "paper_abstract": "Multiple-interval graphs are a natural generalization of interval graphs where each vertex may have more than one interval associated with it. Many applications of interval graphs also generalize to multiple-interval graphs, often allowing for more robustness in the modeling of the specific application. With this motivation in mind, a recent systematic study of optimization problems in multiple-interval graphs was initiated. In this sequel, we Study multiple-interval graph problems from the perspective of parameterized complexity. The problems under consideration are k-INDEPENDENT SET, k-DOMINATING SET, and k-CLIQUE, which are all known to be W[1]-hard for general graphs, and NP-complete for multiple-interval graphs. We prove that k-CLIQUE is in FPT, while k-INDEPENDENT SET and k-DOMINATING SET are both W[1]-hard. We also prove that k-INDEPENDENT DOMINATING SET, a hybrid of the two above problems, is also W[1]-hard. Our hardness results hold even when each vertex is associated with at most two intervals, and all intervals have unit length. Furthermore, as an interesting byproduct of our hardness results, we develop a useful technique for showing W[1]-hardness via a reduction from the k-MULTICOLORED CLIQUE problem, a variant of k-CLIQUE. We believe this technique has interest in its own right, as it should help in simplifying W[1]-hardness results which are notoriously hard to construct and technically tedious. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "On the parameterized complexity of multiple-interval graph problems", "paper_id": "WOS:000262997100005"}