{"auto_keywords": [{"score": 0.0464318478365817, "phrase": "internet_research"}, {"score": 0.015719716506582538, "phrase": "six_words"}, {"score": 0.013336617648708625, "phrase": "six_articles"}, {"score": 0.004777034835192062, "phrase": "lessthe_internet"}, {"score": 0.00453772385360173, "phrase": "six_key_articles"}, {"score": 0.004396426822203258, "phrase": "research_framework"}, {"score": 0.0038431888954930083, "phrase": "core_areas"}, {"score": 0.0032675209435107273, "phrase": "mere_starting-point"}, {"score": 0.003241750934419473, "phrase": "even_the_biologists"}, {"score": 0.003128270147867462, "phrase": "prior_research"}, {"score": 0.003042880174583586, "phrase": "journal"}, {"score": 0.002546002312015341, "phrase": "tremendous_advances"}, {"score": 0.002418185868191525, "phrase": "original_issues"}, {"score": 0.002278639906498682, "phrase": "historic_articles"}, {"score": 0.0022517100995552443, "phrase": "broader_research_context"}, {"score": 0.0021814396743238176, "phrase": "conceptual_framework"}, {"score": 0.0021049977753042253, "phrase": "early_formative_research"}], "paper_keywords": ["Internet", " Research", " Worldwide web"], "paper_abstract": "Purpose - This paper seeks to present six key articles from the archives of Internet Research within a research framework, covering infrastructure, organization, commerce, governance, linking, and interface. Design/methodology/approach - The six articles are introduced, summarized, and used to focus attention on each of the core areas of research that impacted the growth of the Internet. Findings - The prism of time is one of the most powerful tools of observation available to scientists and researchers. Palaeontologists think in terms of aeons, archaeologists consider millennia a mere starting-point, even the biologists, chemists, and physicists have centuries of prior research to consider. Internet Research, the Journal, is only 20 years old - and the field only slightly older than that. Yet what decades those have been. Six articles from the early years of Internet Research epitomize much of the innovation, excitement, challenges and vision that would reshape the world. While tremendous advances in technology have been made in the past 20 years, a number of the original issues and challenges remain unresolved. Practical implications - The paper serves to frame the historic articles within a broader research context. Originality/value - The paper provides a conceptual framework for researchers seeking insights into some of the early formative research on the Internet and web.", "paper_title": "The Internet in six words or lessThe Internet in six words or less", "paper_id": "WOS:000280441700002"}