{"auto_keywords": [{"score": 0.041904013256512336, "phrase": "different_levels"}, {"score": 0.015719716506582538, "phrase": "rna_secondary_structures"}, {"score": 0.004668059458774745, "phrase": "new_data_structure"}, {"score": 0.004549063619065006, "phrase": "'multiple_graph_layer"}, {"score": 0.004231699728933577, "phrase": "new_structure"}, {"score": 0.003531474887552889, "phrase": "stepby-step_comparison"}, {"score": 0.0032176163279340206, "phrase": "next_step"}, {"score": 0.003168079471049896, "phrase": "special_colouring_scheme"}, {"score": 0.00257586859792573, "phrase": "multiple_loops"}, {"score": 0.0024333239726872604, "phrase": "similar_function"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["graph layers", " graph comparison", " edit distance", " RNA", " secondary structure"], "paper_abstract": "We formally introduce a new data structure, called MiGaL for 'Multiple Graph Layer', composed of various graphs linked together by relations of abstraction/refinement. The new structure is useful for representing information that can be described at different levels of abstraction, each level corresponding to a graph. We then propose an algorithm for comparing two MiGaLs. The algorithm performs a stepby-step comparison starting with the most 'abstract' level. The result of the comparison at a given step is communicated to the next step using a special colouring scheme. MiGaLs represent a very natural model for comparing RNA secondary structures that may be seen at different levels of detail, going from the sequence of nucleotides, single or paired with another to participate in a helix, to the network of multiple loops that is believed to represent the most conserved part of RNAs having similar function. We therefore show how one can use MiGaLs to very efficiently compare two RNAs of any size at different levels of detail. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "A multiple layer model to compare RNA secondary structures", "paper_id": "WOS:000257341200001"}