{"auto_keywords": [{"score": 0.04534298842494796, "phrase": "vertex_degrees"}, {"score": 0.044411550678130796, "phrase": "infective_vertices"}, {"score": 0.03681258361949463, "phrase": "large_outbreak"}, {"score": 0.00481495049065317, "phrase": "large_numbers"}, {"score": 0.004752873752686246, "phrase": "sir_epidemic"}, {"score": 0.00469159356595623, "phrase": "random_graph"}, {"score": 0.004049709080817396, "phrase": "constant_rate"}, {"score": 0.0030166226457616616, "phrase": "deterministic_functions"}, {"score": 0.002802373595203129, "phrase": "simple_vaccination_strategy"}, {"score": 0.0027068691342344545, "phrase": "earlier_results"}, {"score": 0.0026146109167103655, "phrase": "basic_regularity_conditions"}, {"score": 0.0025808284847319528, "phrase": "uniformly_bounded_second_moment"}, {"score": 0.0025145641652082164, "phrase": "random_vertex"}, {"score": 0.0024393978073660757, "phrase": "analogous_results"}, {"score": 0.0023767561522363367, "phrase": "configuration_model"}, {"score": 0.0022562464662197867, "phrase": "initial_values"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["SIR epidemic process", " random graph with given degree sequence", " configuration model"], "paper_abstract": "We study the susceptible-infective-recovered (SIR) epidemic on a random graph chosen uniformly subject to having given vertex degrees. In this model infective vertices infect each of their susceptible neighbours, and recover, at a constant rate. Suppose that initially there are only a few infective vertices. We prove there is a threshold for a parameter involving the rates and vertex degrees below which only a small number of infections occur. Above the threshold a large outbreak occurs with probability bounded away from zero. Our main result is that, conditional on a large outbreak, the evolutions of certain quantities of interest, such as the fraction of infective vertices, converge to deterministic functions of time. We also consider more general initial conditions for the epidemic, and derive criteria for a simple vaccination strategy to be successful. In contrast to earlier results for this model, our approach only requires basic regularity conditions and a uniformly bounded second moment of the degree of a random vertex. En route, we prove analogous results for the epidemic on the configuration model multigraph under much weaker conditions. Essentially, our main result requires only that the initial values for our processes converge, i.e. it is the best possible. (c) 2014 Wiley Periodicals, Inc. Random Struct. Alg., 45, 724-761, 2014", "paper_title": "Law of Large Numbers for the SIR Epidemic on a Random Graph with Given Degrees", "paper_id": "WOS:000344463500006"}