{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_sources"}, {"score": 0.045745364372558925, "phrase": "information_elements"}, {"score": 0.015524819350768626, "phrase": "lattice_structure"}, {"score": 0.00469500313566324, "phrase": "different_observations"}, {"score": 0.004435885269134359, "phrase": "different_collections"}, {"score": 0.0034028574973016933, "phrase": "hierarchical_structure"}, {"score": 0.003338992028053874, "phrase": "existing_methods"}, {"score": 0.003297080148944292, "phrase": "data_integration"}, {"score": 0.0022142194702079866, "phrase": "geographic_information"}, {"score": 0.002186395051086251, "phrase": "battlefield_target_identification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["information fusion", " lattice structure", " information conflict", " information complement", " consensus", " aggregation"], "paper_abstract": "Different observations over one and the same natural phenomenon often lead to different collections of information elements describing that phenomenon. Such collections of information elements, which we call information sources, can be heterogeneous, redundant, complementary, or even contradictory. In general, the information elements describing the phenomenon can be unified and related in a hierarchical structure, using existing methods for data integration and ontology merging. In this paper, we consider the problem of redundancy, complementarity, and consistency of information sources, under the assumption that the information elements of each source are related in a lattice structure. We propose various methods for integrating information sources and establish relationships between these methods. Applications of the framework are illustrated through examples in the areas of geographic information and battlefield target identification. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A framework for integrating information sources under lattice structure", "paper_id": "WOS:000255628000013"}