{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scientific_journals"}, {"score": 0.004764220976404241, "phrase": "article_citation"}, {"score": 0.00468912237497774, "phrase": "present_study"}, {"score": 0.004494570360108983, "phrase": "scientific_article_titles"}, {"score": 0.0036167509502276294, "phrase": "psychological_bulletin"}, {"score": 0.003270092550315648, "phrase": "article's_monthly_citation_average"}, {"score": 0.0031176485976102688, "phrase": "pleasantness_rating"}, {"score": 0.0029253546782349875, "phrase": "highly_amusing_titles"}, {"score": 0.002744888626958772, "phrase": "negative_association"}, {"score": 0.0027159094186967247, "phrase": "amusing_titles"}, {"score": 0.002687235334499192, "phrase": "subsequent_citations"}, {"score": 0.002561892963059385, "phrase": "title_length"}, {"score": 0.0021049977753042253, "phrase": "article's_content"}], "paper_keywords": ["citation analysis", " humor", " research evaluation", " writing style"], "paper_abstract": "The present study examines whether the use of humor in scientific article titles is associated with the number of citations an article receives. Four judges rated the degree of amusement and pleasantness of titles of articles published over 10 years (from 1985 to 1994) in two of the most prestigious journals in psychology, Psychological Bulletin and Psychological Review. We then examined the association between the levels of amusement and pleasantness and the article's monthly citation average. The results show that, while the pleasantness rating was weakly associated with the number of citations, articles with highly amusing titles (2 standard deviations above average) received fewer citations. The negative association between amusing titles and subsequent citations cannot be attributed to differences in the title length and pleasantness, number of authors, year of publication, and article type (regular article vs comment). These findings are discussed in the context of the importance of titles for signalling an article's content.", "paper_title": "Amusing titles in scientific journals and article citation", "paper_id": "WOS:000259309200004"}