{"auto_keywords": [{"score": 0.03938794131793315, "phrase": "local_barrier_coverage"}, {"score": 0.03166181073351054, "phrase": "global_barrier_coverage"}, {"score": 0.00643141348749063, "phrase": "localized_algorithms"}, {"score": 0.005569801799830998, "phrase": "belt_region"}, {"score": 0.004706699397060569, "phrase": "full_coverage"}, {"score": 0.004583464412234181, "phrase": "appropriate_model"}, {"score": 0.004514491994233911, "phrase": "movement_detection_applications"}, {"score": 0.0044634416051962545, "phrase": "intrusion_detection"}, {"score": 0.004281125387210667, "phrase": "sensor_deployment"}, {"score": 0.004005389023030447, "phrase": "network_lifetime"}, {"score": 0.0038417104753784587, "phrase": "lbcp"}, {"score": 0.0035147642199945387, "phrase": "shorter_path"}, {"score": 0.0031127970604842375, "phrase": "individual_sensors"}, {"score": 0.0027671619871474764, "phrase": "thin_belt_regions"}, {"score": 0.0025260919226344305, "phrase": "novel_sleep-wakeup_algorithm"}, {"score": 0.002459810433812049, "phrase": "localized_barrier_coverage_protocol"}, {"score": 0.0022972306948217548, "phrase": "optimal_enhancement"}, {"score": 0.0021617392821644005, "phrase": "existing_algorithm"}, {"score": 0.0021453734588569823, "phrase": "randomized_independent_sleeping"}], "paper_keywords": ["Sensor networks", " coverage", " network topology", " algorithms", " theory"], "paper_abstract": "Global barrier coverage, which requires much fewer sensors than full coverage, is known to be an appropriate model of coverage for movement detection applications such as intrusion detection. However, it has been proved that given a sensor deployment, sensors can not locally determine whether the deployment provides global barrier coverage, making it impossible to develop localized algorithms, thus limiting its use in practice. In this paper, we introduce the concept of local barrier coverage to address this limitation. Motivated by the observation that movements are likely to follow a shorter path in crossing a belt region, local barrier coverage guarantees the detection of all movements whose trajectory is confined to a slice of the belt region of deployment. We prove that it is possible for individual sensors to locally determine the existence of local barrier coverage, even when the region of deployment is arbitrarily curved. Although local barrier coverage does not deterministically guarantee global barrier coverage, we show that for thin belt regions, local barrier coverage almost always provides global barrier coverage. To demonstrate that local barrier coverage can be used to design localized algorithms, we develop a novel sleep-wakeup algorithm for maximizing the network lifetime, called Localized Barrier Coverage Protocol (LBCP). We prove that LBCP guarantees local barrier coverage and show that LBCP provides close to optimal enhancement in the network lifetime, while providing global barrier coverage most of the time. They outperform an existing algorithm called Randomized Independent Sleeping (RIS) by up to six times.", "paper_title": "Local Barrier Coverage in Wireless Sensor Networks", "paper_id": "WOS:000274622800003"}