{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "credibility_level"}, {"score": 0.023000104079177238, "phrase": "trustworthy_software_development_process"}, {"score": 0.01702527146124762, "phrase": "grey_cluster"}, {"score": 0.01677451182878938, "phrase": "nonlinear_grey_whitening_weight_function"}, {"score": 0.007050270272592287, "phrase": "isbsg_database"}, {"score": 0.006910776782443785, "phrase": "empirical_analysis"}, {"score": 0.004695900553353526, "phrase": "grey_nonlinear_cluster"}, {"score": 0.004444203710097833, "phrase": "convincing_and_flexible_grey_cluster_method"}, {"score": 0.004101886428528311, "phrase": "software_development_process"}, {"score": 0.0038431888954930083, "phrase": "different_times"}, {"score": 0.003785836059995376, "phrase": "different_project_requirements"}, {"score": 0.0037480753312398754, "phrase": "qualitative_methods"}, {"score": 0.003240895431893266, "phrase": "eight_projects"}, {"score": 0.0023745087648471613, "phrase": "-_eight_projects"}], "paper_keywords": ["Trustworthy software", " Nonlinear grey whitening weight function", " Grey cluster", " Computer software", " Reliability management"], "paper_abstract": "Purpose - This paper attempts to put forward a convincing and flexible grey cluster method that can be used in confirming credibility level of trustworthy software development process. Design/methodology/approach - Determination on credibility level in the software development process is dynamic, as credibility of the results may be different at different times and under different project requirements. Qualitative methods are not entirely convincing, and most quantitative methods are not flexible enough. Grey cluster based on nonlinear grey whitening weight function put forward in this paper is both convincing and flexible. Finally eight projects from the ISBSG database are used for empirical analysis, which confirm that the method put forward in this paper is available and credible. Findings - The results are convincing: not only that grey cluster based on nonlinear grey whitening weight function put forward in this paper is both convincing and flexible, but it can be used in confirming credibility level of trustworthy software development process. Practical implications - Eight projects from the ISBSG database are used for empirical analysis, which confirms that the method put forward in this paper is available and credible. Originality/value - Nonlinear grey whitening weight function is derivable except endpoint. Grey cluster based on nonlinear grey whitening weight function put forward in this paper is both convincing and flexible.", "paper_title": "Study on credibility level of trustworthy software development process based on grey nonlinear cluster", "paper_id": "WOS:000311266900008"}