{"auto_keywords": [{"score": 0.048339607507904336, "phrase": "live_broadcast"}, {"score": 0.03768255196284212, "phrase": "digital_rights_management_system"}, {"score": 0.004001593118269276, "phrase": "live_event"}, {"score": 0.003952513974962462, "phrase": "peak-load_provisioning"}, {"score": 0.003808845109556467, "phrase": "playback_time"}, {"score": 0.0037159680715717056, "phrase": "license_management_load"}, {"score": 0.0034294219963679857, "phrase": "digital_rights"}, {"score": 0.0033251716926666437, "phrase": "client_privacy"}, {"score": 0.0025972447844047515, "phrase": "system's_operation"}, {"score": 0.002518227743688769, "phrase": "threat_models"}, {"score": 0.002323826502178581, "phrase": "network_digital_video_recording"}, {"score": 0.002157697367447098, "phrase": "scalability_results"}], "paper_keywords": ["Digital rights management", " live streaming", " network digital video recorder", " peer-to-peer network", " privacy protection"], "paper_abstract": "Live broadcast over a peer-to-peer (P2P) network imposes a unique set of challenges to a digital rights management (DRM) system. Highly correlated service request arrivals at the start of a live event require peak-load provisioning if clients acquire licenses at playback time. Distributing the license management load across a P2P network requires the digital rights management system to ensure the integrity of both digital rights, the protection of client privacy and, at the same time, system scalability. In this paper we describe the requirements imposed on a digital rights management system in distributing live broadcast over a P2P network and present our design of such a system to meet the above challenges. We discuss the system's operation under a number of threat models and how to extend the system to further improve scalability and support network digital video recording (DVR). We close the paper after presenting some scalability results collected from a production P2P live broadcast network using our DRM design.", "paper_title": "Managing Digital Rights for P2P Live Broadcast and Recording on the Internet", "paper_id": "WOS:000311800400004"}