{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mac"}, {"score": 0.04926353080920115, "phrase": "multihop_wireless_networks"}, {"score": 0.03790936786626903, "phrase": "multihop_wireless_network"}, {"score": 0.004774115617883476, "phrase": "multimedia_support"}, {"score": 0.004347057700479576, "phrase": "commercial_ieee"}, {"score": 0.0041835168653521, "phrase": "novel_software_solution"}, {"score": 0.00397495478332679, "phrase": "ip_layer"}, {"score": 0.0036501160751879784, "phrase": "neighboring_nodes"}, {"score": 0.003527712410706358, "phrase": "acceptable_voip_services"}, {"score": 0.0033232673019931206, "phrase": "appropriate_levels"}, {"score": 0.0031440159350875057, "phrase": "admission_control"}, {"score": 0.0030645676308053444, "phrase": "rt_traffic"}, {"score": 0.002924074850256874, "phrase": "bt_traffic"}, {"score": 0.0027662954811372175, "phrase": "high_priority_service"}, {"score": 0.002742787059497186, "phrase": "voip_traffic"}, {"score": 0.0026282000779095987, "phrase": "extensive_simulations"}, {"score": 0.002572709810193776, "phrase": "network_simulator"}, {"score": 0.002475755804232436, "phrase": "windows_network_driver_interface_specification"}, {"score": 0.0022062235065459274, "phrase": "good_support"}, {"score": 0.002159623311924437, "phrase": "home_networks"}, {"score": 0.0021049977753042253, "phrase": "hybrid_wlan"}], "paper_keywords": ["wireless networks", " media access control (MAC)", " Layer 2.5", " multimedia"], "paper_abstract": "In this paper, we present the challenges in supporting multimedia, in particular, VoIP services over multihop wireless networks using commercial IEEE 802.11 MAC DCF hardware, and propose a novel software solution, called Layer 2.5 SoftMAC. Our proposed SoftMAC resides between the IEEE 802.11 MAC layer and the IP layer to coordinate the real-time (RT) multimedia and best-effort (BE) data packet transmission among neighboring nodes in a multihop wireless network. To effectively ensure acceptable VoIP services, channel busy time and collision rate need to be well controlled below appropriate levels. Targeted at this, our SoftMAC architecture employs three key mechanisms: 1) distributed admission control for regulating the load of RT traffic, 2) rate control for minimizing the impact of BT traffic on RT one, and 3) nonpreemptive priority queuing for providing high priority service to VoIP traffic. To evaluate the efficacy of these mechanisms, extensive simulations are conducted using the network simulator NS2. We also implement our proposed SoftMAC as a Windows Network Driver Interface Specification (NDIS) driver and build a multihop wireless network testbed with 32 wireless nodes equipped with IEEE 802.11 a/b/g combo cards. Our evaluation and testing results demonstrate the effectiveness of our proposed software solution. Our proposed collaborative SoftMAC framework can also provide good support for A/V streaming in home networks where the network consists of hybrid WLAN (wireless LAN) and Ethernet.", "paper_title": "SoftMAC: Layer 2.5 collaborative MAC for multimedia support in multihop wireless networks", "paper_id": "WOS:000242117500002"}