{"auto_keywords": [{"score": 0.027563021111576713, "phrase": "active_objects"}, {"score": 0.00481495049065317, "phrase": "asynchronous_active_objects"}, {"score": 0.004121672175779706, "phrase": "dynamic_and_asynchronous_nature"}, {"score": 0.003414153126809511, "phrase": "object_autonomy"}, {"score": 0.00335867620389808, "phrase": "concurrent_collaborative_entities"}, {"score": 0.003290591812800382, "phrase": "\"caller_contextualization"}, {"score": 0.0031071863712898214, "phrase": "concurrent_exceptions"}, {"score": 0.0028161764476743257, "phrase": "sage_exception"}, {"score": 0.0023610946923597405, "phrase": "application_level"}, {"score": 0.002157433262687853, "phrase": "sage_solution"}, {"score": 0.0021049977753042253, "phrase": "good_compromise"}], "paper_keywords": [""], "paper_abstract": "Asynchronous Active Objects (AAOs), primarily exemplified by actors [1], nowadays exist in many forms (various kinds of actors, agents and components) and axe more and more used because they fit well the dynamic and asynchronous nature of interactions in many distributed systems. They raise various new issues regarding exception handling for which few operational solutions exist. More precisely, a need exists for a generic, simple and expressive, programmer level, exception handling system that appropriately handles the following main exception handling issues or requirements in the context of AAOs: encapsulation, object autonomy, coordination of concurrent collaborative entities [2], \"caller contextualization\" [3], asynchronous signaling and handler execution, resolution of concurrent exceptions [4,5], exception criticality [6] and object reactivity. This paper presents the specification of an evolution of the SaGE exception handling system [7], which provides solutions to those issues in the context of systems developed with active objects using one way asynchronous communications and interacting via the request / response protocol. Such a context, in which synchronizations constraints are, when needed, handled at the application level, allows for a very generic view of what could be done regarding exception handling in all systems that use active objects. The SaGE solution is original and provides a good compromise between expressive-power and simplicity.", "paper_title": "Exception handling and asynchronous active objects: Issues and proposal", "paper_id": "WOS:000241860400005"}