{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "road_intersections"}, {"score": 0.010543705235982487, "phrase": "raster_maps"}, {"score": 0.005978454424795741, "phrase": "road_network"}, {"score": 0.004540064673326908, "phrase": "valuable_resource"}, {"score": 0.004365543827399888, "phrase": "annotate_buildings"}, {"score": 0.003945001936004421, "phrase": "common_features"}, {"score": 0.003906510969606783, "phrase": "different_geospatial_data_sets"}, {"score": 0.003756252137445817, "phrase": "key_information"}, {"score": 0.0036235790056485286, "phrase": "road_junctions"}, {"score": 0.003210652026669616, "phrase": "initial_seed_templates"}, {"score": 0.003179303164775306, "phrase": "road_pixels"}, {"score": 0.0031277316566463978, "phrase": "conflation_system"}, {"score": 0.0028915634293105014, "phrase": "aerial_imagery"}, {"score": 0.0025285202557857323, "phrase": "even_contour_lines"}, {"score": 0.002471248834609488, "phrase": "image_processing_and_graphics_recognition_methods"}, {"score": 0.0024152714799789547, "phrase": "raster_map"}, {"score": 0.002352844633115289, "phrase": "extracted_information"}, {"score": 0.002314647987893668, "phrase": "road_intersection_positions"}, {"score": 0.0022920276083063947, "phrase": "road_connectivity"}, {"score": 0.0022696277881969896, "phrase": "road_orientations"}, {"score": 0.002225481283887324, "phrase": "road_intersection_extraction"}], "paper_keywords": ["Raster map", " Road layer", " Road intersection", " Imagery", " Conflation", " Fusion", " Vector data", " Geospatial data integration"], "paper_abstract": "Since maps are widely available for many areas around the globe, they provide a valuable resource to help understand other geospatial sources such as to identify roads or to annotate buildings in imagery. To utilize the maps for understanding other geospatial sources, one of the most valuable types of information we need from the map is the road network, because the roads are common features used across different geospatial data sets. Specifically, the set of road intersections of the map provides key information about the road network, which includes the location of the road junctions, the number of roads that meet at the intersections (i.e., connectivity), and the orientations of these roads. The set of road intersections helps to identify roads on imagery by serving as initial seed templates to locate road pixels. Moreover, a conflation system can use the road intersections as reference features (i.e., control point set) to align the map with other geospatial sources, such as aerial imagery or vector data. In this paper, we present a framework for automatically and accurately extracting road intersections from raster maps. Identifying the road intersections is difficult because raster maps typically contain much information such as roads, symbols, characters, or even contour lines. We combine a variety of image processing and graphics recognition methods to automatically separate roads from the raster map and then extract the road intersections. The extracted information includes a set of road intersection positions, the road connectivity, and road orientations. For the problem of road intersection extraction, our approach achieves over 95% precision (correctness) with over 75% recall (completeness) on average on a set of 70 raster maps from a variety of sources.", "paper_title": "Automatic and Accurate Extraction of Road Intersections from Raster Maps", "paper_id": "WOS:000263977500001"}