{"auto_keywords": [{"score": 0.0497610204261851, "phrase": "magnetic-geared_motor"}, {"score": 0.021613931915147523, "phrase": "high-speed_rotor"}, {"score": 0.014472353611853771, "phrase": "cogging_torque"}, {"score": 0.010612387000973441, "phrase": "torque_characteristics"}, {"score": 0.009608203887191268, "phrase": "magnetic_gears"}, {"score": 0.008727114686762034, "phrase": "magnetic_gear"}, {"score": 0.007899898587352693, "phrase": "low-speed_rotor"}, {"score": 0.006802747951124345, "phrase": "cogging_torque_characteristics"}, {"score": 0.0042281749832498, "phrase": "mechanical_loss"}, {"score": 0.00420008205995114, "phrase": "maintenance-free_operation"}, {"score": 0.004116913661033223, "phrase": "conventional_mechanical_gears"}, {"score": 0.004035385456773232, "phrase": "inherent_overload_protection"}, {"score": 0.003995226376780718, "phrase": "novel_structure"}, {"score": 0.0038900709793274484, "phrase": "brushless_motor"}, {"score": 0.0037624955853577786, "phrase": "atallah_et_al"}, {"score": 0.003449972561293443, "phrase": "high-torque_density"}, {"score": 0.0033479323773364716, "phrase": "multi-pole_permanent_magnets"}, {"score": 0.002572001496778222, "phrase": "cogging_torque_waveform"}, {"score": 0.0023424328921363585, "phrase": "cogging_torque_reduction_methods"}, {"score": 0.0021620042653528846, "phrase": "electrical_current"}, {"score": 0.0021049977753042253, "phrase": "eddy-current_loss_characteristics"}], "paper_keywords": ["Torque", " Electric motors", " Waveforms", " Magnetic-geared motor", " Magnetic gear", " Cogging torque"], "paper_abstract": "Purpose - The purpose of this paper is to propose a magnetic-geared motor with permanent magnets only on the high-speed rotor as a solution to the problems of magnetic gears. Magnetic gears have some advantages such as no mechanical loss and maintenance-free operation that are not observed in conventional mechanical gears. Furthermore, they have inherent overload protection. A novel structure which the magnetic gear is integrated with the brushless motor (magnetic-geared motor) was proposed by Atallah et al. This magnetic-geared motor is based on the magnetic gear which consists of a high- and low-speed rotor, and a stator. Although this magnetic-geared motor has a high-torque density, problems with manufacturing and cost exist because multi-pole permanent magnets are mounted on the high-speed rotor and stator. Design/methodology/approach - A magnetic-geared motor with permanent magnets only on the high-speed rotor was proposed and its operational principle was described. The cogging torque characteristics were mathematically formulated and the authors ascertained that the cogging torque contains components of multiples of 60th order. In order to verify the order of the cogging torque, the 3-D finite element method analysis was conducted and measurements on a prototype were carried out. Findings - The 60th component and its multiples were observed in the computed and measured cogging torque waveform. However, the cogging torque characteristics, especially the order of the cogging torque on the low-speed rotor, have not been clarified. Originality/value - In the near future, cogging torque reduction methods will be proposed, and verified by conducting 3-D FEM analyses and carrying out measurements on a prototype. Furthermore, the torque characteristics when an electrical current is applied to the coils and the eddy-current loss characteristics will be verified.", "paper_title": "Cogging torque characteristics of magnetic-geared motor", "paper_id": "WOS:000311269800016"}