{"auto_keywords": [{"score": 0.04875986484857526, "phrase": "supply_chains"}, {"score": 0.01553464792979029, "phrase": "co-authorship_network"}, {"score": 0.014641000077659207, "phrase": "simulation_optimization"}, {"score": 0.00481495049065317, "phrase": "scientific_collaboration_patterns"}, {"score": 0.004719816332271661, "phrase": "simulation-optimization"}, {"score": 0.004340263267055143, "phrase": "local_associations"}, {"score": 0.004087910779160781, "phrase": "new_co-authorships"}, {"score": 0.003789137457228946, "phrase": "collaboration_patterns"}, {"score": 0.0034426417353349567, "phrase": "relevant_journals"}, {"score": 0.003361069456060196, "phrase": "science_database"}, {"score": 0.003229374325577207, "phrase": "exploratory_social_network_analysis_technique"}, {"score": 0.0027741761880779535, "phrase": "response_surface_methodology"}, {"score": 0.002730150696072947, "phrase": "gradient_based_search_method"}, {"score": 0.002623111480310373, "phrase": "simulation_optimization_methods"}, {"score": 0.002530359917257626, "phrase": "health_care"}, {"score": 0.0022803854904010347, "phrase": "simulation_community"}, {"score": 0.002244178699939059, "phrase": "key_industries"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Simulation Optimization", " Network analysis", " Scientific collaboration", " Supply chain"], "paper_abstract": "In the 1970s, a co-authorship network in the field of Simulation Optimization of supply chains was established, supported by local associations. Then, the development of this network was favored by the foundation of new co-authorships and the consolidation of already existing. The purpose of this study is to analyze the structure, collaboration patterns and the time-evolution of the co-authorship network of Simulation Optimization of supply chains. Data are based upon 202 peer-reviewed contributions published from 1970 to August 2012 in relevant journals indexed in the ISI/Web of Science database and International Conferences. The analysis is conducted using exploratory social network analysis technique. Results indicate that the development of knowledge in Simulation Optimization of supply chains has been carried out mainly by 353 authors from 35 countries. Also, there have been proposed over forty Simulation Optimization methods by different authors however the most usual is response surface methodology, followed by gradient based search method and genetic algorithms. In addition, applications of Simulation Optimization methods and techniques are found mainly in areas as health care, management, transport, airline, telecommunications, aerospace, and financial. Although research in Simulation Optimization of supply chains has received much attention by the simulation community, its application in key industries continues to be still small, limiting its support in decision-making. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Analysis of scientific collaboration patterns in the co-authorship network of Simulation-Optimization of supply chains", "paper_id": "WOS:000339141800009"}