{"auto_keywords": [{"score": 0.046928439968518115, "phrase": "traditional_jazz"}, {"score": 0.04519174354308181, "phrase": "free_jazz"}, {"score": 0.010196933538082768, "phrase": "automated_music_improvisation_system"}, {"score": 0.00481495049065317, "phrase": "free_jazz_improvisations"}, {"score": 0.004780633011300165, "phrase": "purpose_-_the_purpose"}, {"score": 0.004563427013973105, "phrase": "free_jazz_improvisation"}, {"score": 0.004278807087784626, "phrase": "conceptual_model"}, {"score": 0.004055176557424983, "phrase": "acoustic_signals"}, {"score": 0.0040262522882015175, "phrase": "symbolic_information"}, {"score": 0.003247868216333148, "phrase": "music_improvisation"}, {"score": 0.0028446460307503343, "phrase": "music_ensemble_features"}, {"score": 0.0026384167183586015, "phrase": "strict_rule-based_system"}, {"score": 0.0025003054002226965, "phrase": "machine-adequate_music_representation"}, {"score": 0.0024036292057373803, "phrase": "acoustic_features"}, {"score": 0.0023356699564158426, "phrase": "computer_algorithm"}, {"score": 0.0023189818169615135, "phrase": "practical_implications_-_gained_knowledge"}, {"score": 0.0022696277881969896, "phrase": "automated_music_improvisation_systems"}, {"score": 0.0021662599012740127, "phrase": "intelligent_music_improvisation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "free_jazz_ensemble"}], "paper_keywords": ["Cybernetics", " Automated music improvisation systems", " Informative feedback models", " Artificial creativity", " Cognitive modeling", " Free jazz", " Auditory scene analysis", " Music"], "paper_abstract": "Purpose - The purpose of this paper is to better understand communication between musicians in a free jazz improvisation in comparison to traditional jazz. Design/methodology/approach - A cybernetic informative feedback model was used to study communication between musicians for free jazz. The conceptual model consists of the ears as sensors, an auditory analysis stage to convert the acoustic signals into symbolic information (e.g. notated music), a cognitive processing stage (to make decisions and adapt the performance to what is being heard), and an effector (e.g. muscle movement to control an instrument). It was determined which musical features of the co-players have to be extracted to be able to respond adequately in a music improvisation, and how this knowledge can be used to build an automated music improvisation system for free jazz. Findings - The three major findings of this analysis were: in traditional jazz a soloist only needs to analyze a very limited set of music ensemble features, but in free jazz the performer has to observe each musician individually; unlike traditional jazz, free jazz is not a strict rule-based system. Consequently, the musicians need to develop their personal symbolic representation; which could be a machine-adequate music representation for an automated music improvisation system. The latter could be based on acoustic features that can be extracted robustly by a computer algorithm. Practical implications - Gained knowledge can be applied to build automated music improvisation systems for free jazz. Originality/value - The paper expands our knowledge to create intelligent music improvisation algorithms to algorithms that can improvise with a free jazz ensemble.", "paper_title": "A cybernetic model approach 40, for free jazz improvisations", "paper_id": "WOS:000296214100004"}