{"auto_keywords": [{"score": 0.04909558158843679, "phrase": "reticulation_events"}, {"score": 0.04625542344475717, "phrase": "hybridization_network"}, {"score": 0.015149258001706953, "phrase": "evolutionary_history"}, {"score": 0.014841194868326052, "phrase": "existing_species"}, {"score": 0.012957274384484735, "phrase": "high_confidence"}, {"score": 0.00481495049065317, "phrase": "hybridization_networks"}, {"score": 0.004358240019060018, "phrase": "evolutionary_tree"}, {"score": 0.004077995480957875, "phrase": "phylogenetic_tree"}, {"score": 0.003600022318864217, "phrase": "different_phylogenetic_tree"}, {"score": 0.00313849462329633, "phrase": "tree-like_evolution"}, {"score": 0.0029733203800202303, "phrase": "smallest_number"}, {"score": 0.0027020387992490367, "phrase": "hybridnet"}, {"score": 0.0026135859312619875, "phrase": "minimum_number"}, {"score": 0.002591927716261631, "phrase": "reticulate_vertices"}, {"score": 0.0024656866249273125, "phrase": "whidden_et_al"}, {"score": 0.002231310272815607, "phrase": "optimal_hybridization_network"}, {"score": 0.0021225958499898182, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "optimal_hybridization_networks"}], "paper_keywords": [""], "paper_abstract": "Motivations: When reticulation events occur, the evolutionary history of a set of existing species can be represented by a hybridization network instead of an evolutionary tree. When studying the evolutionary history of a set of existing species, one can obtain a phylogenetic tree of the set of species with high confidence by looking at a segment of sequences or a set of genes. When looking at another segment of sequences, a different phylogenetic tree can be obtained with high confidence too. This indicates that reticulation events may occur. Thus, we have the following problem: given two rooted phylogenetic trees on a set of species that correctly represent the tree-like evolution of different parts of their genomes, what is the hybridization network with the smallest number of reticulation events to explain the evolution of the set of species under consideration? Results: We develop a program, named HybridNet, for constructing a hybridization network with the minimum number of reticulate vertices from two input trees. We first implement the O(3(d) n)-time algorithm by Whidden et al. for computing a maximum (acyclic) agreement forest. Our program can output all the maximum (acyclic) agreement forests. We then augment the program so that it can construct an optimal hybridization network for each given maximum acyclic agreement forest. To our knowledge, this is the first time that optimal hybridization networks can be rapidly constructed.", "paper_title": "HybridNET: a tool for constructing hybridization networks", "paper_id": "WOS:000283919800021"}