{"auto_keywords": [{"score": 0.0498132723791368, "phrase": "wireless_sensor_networks"}, {"score": 0.0440681429215423, "phrase": "link_unreliability"}, {"score": 0.035744371431884255, "phrase": "confidence_level"}, {"score": 0.03182530246001829, "phrase": "success_probability"}, {"score": 0.00481495049065317, "phrase": "lossy_data_aggregation"}, {"score": 0.004656871909510407, "phrase": "network_data_aggregation"}, {"score": 0.004618166136069052, "phrase": "efficient_way"}, {"score": 0.004579780586951551, "phrase": "energy_consumption"}, {"score": 0.0044914449177247545, "phrase": "existing_data_aggregation"}, {"score": 0.0041895834447883374, "phrase": "spatial_and_temporal_data_correlation"}, {"score": 0.004085932261574055, "phrase": "new_scheme"}, {"score": 0.004051952557353597, "phrase": "data_aggregation"}, {"score": 0.004018254297276754, "phrase": "data_loss"}, {"score": 0.003918825152832622, "phrase": "nodes_sample"}, {"score": 0.003525332840272254, "phrase": "sampled_nodes"}, {"score": 0.00347657813672945, "phrase": "detailed_analysis"}, {"score": 0.0028685304140180137, "phrase": "parent_nodes"}, {"score": 0.0027974705482714884, "phrase": "minimum_number"}, {"score": 0.002781919402709524, "phrase": "sampling_leaf_nodes"}, {"score": 0.0027510752634224726, "phrase": "corresponding_confidence_level"}, {"score": 0.002426717832834137, "phrase": "performance_evaluation"}, {"score": 0.0022444508260249588, "phrase": "data_accuracy"}, {"score": 0.0021705796895687864, "phrase": "data_redundancy"}], "paper_keywords": ["Lossy Data Aggregation", " Energy Efficiency", " Data Sampling", " Data Loss", " Wireless Sensor Networks"], "paper_abstract": "In wireless sensor networks (WSNs), in-network data aggregation is an efficient way to reduce energy consumption. However, most of the existing data aggregation scheduling methods try to aggregate data from all the nodes in each time-instance, which is neither energy efficient nor practical because of the link unreliability and spatial and temporal data correlation. In this paper, we propose a new scheme allowing the data aggregation with the data loss. In our scheme, we selectively let some nodes sample and aggregate data, then transmit it to the sink. Two different cases are studied. Firstly, this paper assumes that the links are reliable and the error between the data of all nodes and that of sampled nodes is bounded. The detailed analysis is given on the error bound when the confidence level is given in advance. Secondly, this paper assumes that the links are unreliable with a certain probability. Then we obtain that the error is still hounded under a given confidence level when the probability of link unreliability is not too high or the success probability of retransmission is high enough. We also study how to assign the confidence level among the parent nodes such that each parent node can calculate the minimum number of sampling leaf nodes based on the corresponding confidence level. Through analyzing, we show that it can surely save energy to adopt our method when the link is reliable. When the link is not reliable, the energy still can be saved if the success probability of retransmission is high enough. The performance evaluation by simulation is discussed in the end of this paper. The results of the simulation indicate that it can save energy and does not effect the data accuracy to adopt our scheme if a certain bounded error is acceptable. Since the data redundancy often happens in WSNs, it is feasible to allow certain data error.", "paper_title": "Energy-efficient Lossy Data Aggregation in Wireless Sensor Networks", "paper_id": "WOS:000284392700005"}