{"auto_keywords": [{"score": 0.04829020264991872, "phrase": "relationship_value"}, {"score": 0.004905631258300097, "phrase": "future_research"}, {"score": 0.004266501496765747, "phrase": "literature_review"}, {"score": 0.004190721261733044, "phrase": "quantitative_intervention"}, {"score": 0.004162650522528435, "phrase": "ad_hoc_survey"}, {"score": 0.004134767029046444, "phrase": "structured_questionnaire"}, {"score": 0.004088707281072389, "phrase": "structural_equations_modeling"}, {"score": 0.003935892934907777, "phrase": "confirmatory_factor_analysis"}, {"score": 0.003918292974218606, "phrase": "satisfactory_results"}, {"score": 0.0038659620645797137, "phrase": "direct_effects"}, {"score": 0.0037381607268968577, "phrase": "positive_influence"}, {"score": 0.0035903435194211985, "phrase": "previous_studies"}, {"score": 0.0034716218513589922, "phrase": "loyalty_antecedents"}, {"score": 0.003417565253539315, "phrase": "greater_trust"}, {"score": 0.0029672941061574375, "phrase": "long-term_relationships"}, {"score": 0.0029407902495599543, "phrase": "longitudinal_studies"}, {"score": 0.0027929100418926725, "phrase": "account_dynamics"}, {"score": 0.002761756622014068, "phrase": "customer's_perspective"}, {"score": 0.0026228555939117543, "phrase": "formative_approach"}, {"score": 0.0025474514996697644, "phrase": "detected_importance"}, {"score": 0.002513382718220154, "phrase": "key_factors"}, {"score": 0.0022365262201954643, "phrase": "far_less_research"}, {"score": 0.0021576250754040955, "phrase": "perceived_relationship_value"}, {"score": 0.0021383376682752218, "phrase": "marketing_studies"}, {"score": 0.0021049977753042253, "phrase": "relationship_management"}], "paper_keywords": ["Trust", " Buyer-seller relationships", " Partnership"], "paper_abstract": "Purpose - The purpose of the paper is to contribute to the knowledge of how relationship value, trust, commitment, satisfaction and loyalty intentions are defined and relate to each other. It explores these relationships in the business-to-business (B2B) context by analysing manufacturing companies regarding to their main supplier. Design/methodology/approach - After the literature review and several in-depth interviews, a method of empirical analysis consisting of quantitative intervention with an ad hoc survey using a structured questionnaire has been developed. Structural equations modeling is used to contrast the hypotheses on the links between the constructs analysed. Findings - Confirmatory factor analysis provided satisfactory results. With regard to the direct effects of the relationship value, the three relationships being considered were verified: relationship value has a positive influence on trust, commitment and satisfaction towards the supplier. Also, and as already contrasted in previous studies, trust has a direct, positive effect on commitment. In addition, and regarding to loyalty antecedents, data did not confirm that greater trust would increase loyalty but commitment did, leading to the conclusion that the effect of trust on loyalty is only indirect through the effect it has on commitment. Loyalty was also positively affected by satisfaction with the supplier. Research limitations/implications - Limitations of this paper open lines for future research. First, it considers that future research could include other variables affecting long-term relationships. Second, longitudinal studies could serve to enrich the results and illustrate the complexity of the direction in the links among the variables and take into account dynamics. Third, a customer's perspective in the perception of value has been adopted in this paper. Finally, relationship value has been operationalised as reflective and a formative approach could be adopted. Implications for managers are in line with the detected importance of satisfaction and commitment as key factors because of their impact on intention to continue and expand business with the supplier. Moreover, manufacturers should recognize the role of assessing and building relationship value with their partners as it has an impact - direct or indirect - on intentions to stay in the relationship. Originality/value - In comparison, far less research has been done in the area of relationship value. This paper emphasizes the role of perceived relationship value in relationship B2B marketing studies providing a model and contributing to relationship management.", "paper_title": "The value of B2B relationships", "paper_id": "WOS:000268623900001"}