{"auto_keywords": [{"score": 0.04140047268967764, "phrase": "probability-based_pseudo-scores"}, {"score": 0.015594287181705782, "phrase": "metric_spaces"}, {"score": 0.011447536811132052, "phrase": "pseudo-score_based_scheme"}, {"score": 0.00481495049065317, "phrase": "approximate_indexing"}, {"score": 0.004718431349852634, "phrase": "approximate_indexing_schemes"}, {"score": 0.004078078530972285, "phrase": "response_time"}, {"score": 0.003884479830773329, "phrase": "optimal_trade-off"}, {"score": 0.0035965032173588753, "phrase": "probabilistic_enhancement_scheme"}, {"score": 0.003158776195052182, "phrase": "object-specific_parameters"}, {"score": 0.0029245233860431146, "phrase": "bayes"}, {"score": 0.0022830706430588482, "phrase": "conventional_schemes"}, {"score": 0.0022190974300886467, "phrase": "distance_computations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Metric space indexing", " Approximate indexing", " Pseudo-score", " Probabilistic enhancement", " Logistic regression", " Maximum a posteriori estimation", " Empirical Bayes method", " Similar training object"], "paper_abstract": "Some approximate indexing schemes have been recently proposed in metric spaces which sort the objects in the database according to pseudo-scores. It is known that (1) some of them provide a very good trade-off between response time and accuracy, and (2) probability-based pseudo-scores can provide an optimal trade-off in range queries if the probabilities are correctly estimated. Based on these facts, we propose a probabilistic enhancement scheme which can be applied to any pseudo-score based scheme. Our scheme computes probability-based pseudo-scores using pseudo-scores obtained from a pseudo-score based scheme. In order to estimate the probability-based pseudo-scores, we use the object-specific parameters in logistic regression and learn the parameters using MAP (Maximum a Posteriori) estimation and the empirical Bayes method. We also propose a technique which speeds up learning the parameters using pseudo-scores. We applied our scheme to the two state-of-the-art schemes: the standard pivot-based scheme and the permutation-based scheme, and evaluated them using various kinds of datasets from the Metric Space Library. The results showed that our scheme outperformed the conventional schemes, with regard to both the number of distance computations and the CPU time, in all the datasets. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Probabilistic enhancement of approximate indexing in metric spaces", "paper_id": "WOS:000320152000004"}