{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "patient-centred_portal"}, {"score": 0.036015095269722824, "phrase": "technology_enactment"}, {"score": 0.004157058883925715, "phrase": "case_study"}, {"score": 0.004031723347913859, "phrase": "norway"}, {"score": 0.0039341294012600085, "phrase": "qualitative_data_collection_techniques"}, {"score": 0.0037459885494311217, "phrase": "design_workshops"}, {"score": 0.0035887342563437935, "phrase": "interpretive_analysis"}, {"score": 0.0033139366449568565, "phrase": "case_analysis"}, {"score": 0.0031747618267940155, "phrase": "strong_generative_character"}, {"score": 0.0030043508031729277, "phrase": "technology_continuous_sociotechnical_negotiations"}, {"score": 0.002878140062594849, "phrase": "empirical_data"}, {"score": 0.002723607240517261, "phrase": "existing_understanding"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Standardization", " Generativity", " Information infrastructure", " Enactment", " Patient-provider communication"], "paper_abstract": "Objective: To investigate how the design, development and implementation process of a new patient-centered portal unfolds by focusing on its evolutionary infrastructural development. Design: We conducted a case study on a patient-centred portal in Norway. We used qualitative data collection techniques including observations, interviews and attendance of design workshops with users. We performed an interpretive analysis of the data through the lens of technology enactment. Results: The case analysis reveals that the patient-centred portal has a strong generative character. However, for the enactment of the technology continuous sociotechnical negotiations take place. Grounded in the empirical data and their analysis we complement and expand the existing understanding of generativity. Discussion: We characterize generativity as sociotechnical and resulting from negotiations for technology enactment. We discuss in detail such negotiations and show how they shape the evolution of infrastructures that are generative while standardized. (c) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Infrastructures in healthcare: The interplay between generativity and standardization", "paper_id": "WOS:000318998000010"}