{"auto_keywords": [{"score": 0.0322489313062642, "phrase": "true_positive_rate"}, {"score": 0.00481495049065317, "phrase": "multivariate_analysis_of_full-term_neonatal_polysomnographic_data"}, {"score": 0.004776205983374049, "phrase": "polysomnography"}, {"score": 0.004756959778131843, "phrase": "psg"}, {"score": 0.004643018260327275, "phrase": "child_brain"}, {"score": 0.004468160355984803, "phrase": "computer_analysis"}, {"score": 0.004450139983398756, "phrase": "neonatal_polygraphic_signals"}, {"score": 0.004205322435785875, "phrase": "significant_indicator"}, {"score": 0.004154632247118223, "phrase": "newborn_brain"}, {"score": 0.004137871097440827, "phrase": "clinical_practice"}, {"score": 0.004014308413021973, "phrase": "prague"}, {"score": 0.003965893816772162, "phrase": "similar_postconceptional_age"}, {"score": 0.0038943863194598684, "phrase": "experienced_physician"}, {"score": 0.0037628023660471062, "phrase": "accurate_classification"}, {"score": 0.003643007870297198, "phrase": "power_spectral_density"}, {"score": 0.0035917999514273654, "phrase": "eeg_channel"}, {"score": 0.003305951260346538, "phrase": "png_signal"}, {"score": 0.0032006545815720577, "phrase": "markov_models"}, {"score": 0.0031556449057814112, "phrase": "automatic_detection"}, {"score": 0.003142901279320749, "phrase": "sleep_states"}, {"score": 0.0031112662095610405, "phrase": "\"sleep_profiles"}, {"score": 0.003012151635318418, "phrase": "statistically_significant_agreement"}, {"score": 0.0026036876991534816, "phrase": "final_success_rate"}, {"score": 0.0025515078703311003, "phrase": "false_positive_rate"}, {"score": 0.002500371142383745, "phrase": "whole_process"}, {"score": 0.0024902671358276807, "phrase": "feature_extraction"}, {"score": 0.0024802038580681142, "phrase": "feature_selection"}, {"score": 0.0024255765901264386, "phrase": "additional_tool"}, {"score": 0.0023721496436702955, "phrase": "proper_selection"}, {"score": 0.0023387636040567276, "phrase": "success_rate"}, {"score": 0.0023011817814396407, "phrase": "visual_comparison"}, {"score": 0.002287244458984214, "phrase": "computed_features"}, {"score": 0.0022733913568786642, "phrase": "manual_scoring"}, {"score": 0.0022413921354659016, "phrase": "hidden_markov_model"}, {"score": 0.002169928531489652, "phrase": "future_behavior"}, {"score": 0.0021049977753042253, "phrase": "temporal_development"}], "paper_keywords": ["EEG", " neonatal", " respiration", " sleep"], "paper_abstract": "Introduction. Polysomnography (PSG) is one of the most important noninvasive methods for studying maturation of the child brain. Sleep in infants is significantly different from sleep in adults. This paper addresses the problem of computer analysis of neonatal polygraphic signals. Methods. We applied methods designed for differentiating three important neonatal behavioral states: quiet sleep, active sleep, and wakefulness. The proportion of these states is a significant indicator of the maturity of the newborn brain in clinical practice. In this study, we used data provided by the Institute for Care of Mother and Child, Prague (12 newborn infants of similar postconceptional age). The data were scored by an experienced physician to four states (wake, quiet sleep, active sleep, movement artifact). For accurate classification; it was necessary to determine the most informative features. We used a method based on power spectral density (PSD) applied to each EEG channel. We also used features derived from electrooculogram (EOG), electromyogram (EMG), ECG, and respiration [pneumogram (PNG)] signals. The most informative feature was the measure of regularity of respiration from the PNG signal. We designed an algorithm for interpreting these characteristics. This algorithm was based on Markov models. Results. The results of automatic detection of sleep states were compared to the \"sleep profiles\" determined visually. We evaluated both the success rate and the true positive rate of the classification, and statistically significant agreement of the two scorings was found. Two variants, for learning and for testing, were applied, namely learning from the data of all 12 newborns and tenfold cross-validation, and learning from the data of 11 newborns and testing on the data from the 12th newborn. We utilized information obtained from several biological signals (EEG, ECG, PNG, EMG, EOG) for our final classification. We reached the final success rate of 82.5%. The true positive rate was 81.8% and the false positive rate was 6.1 %. Discussion. The most important step in the whole process is feature extraction and feature selection. In this process, we used visualization as an additional tool that helped us to decide which features to select. Proper selection of features may significantly influence the success rate of the classification. We made a visual comparison of the computed features with the manual scoring provided by the expert. A hidden Markov model was used for classification. The advantage of this model is that it determines the future behavior of the process by its present state. In this way, it preserves information about temporal development.", "paper_title": "Multivariate Analysis of Full-Term Neonatal Polysomnographic Data", "paper_id": "WOS:000262429100013"}