{"auto_keywords": [{"score": 0.0310227113861049, "phrase": "udt"}, {"score": 0.004721529233535422, "phrase": "update_processing"}, {"score": 0.004569819304126685, "phrase": "independently_created_relational_database"}, {"score": 0.004466519142879166, "phrase": "related_data"}, {"score": 0.004394159734054881, "phrase": "heterogeneity_wrt_instances"}, {"score": 0.0042668414931947615, "phrase": "data_vocabulary"}, {"score": 0.004211441113293312, "phrase": "value_correspondences"}, {"score": 0.004102780105064226, "phrase": "overlay_network"}, {"score": 0.0035648266669315943, "phrase": "updates_initiator"}, {"score": 0.0034164751616551437, "phrase": "mapping_tables"}, {"score": 0.003263586288720322, "phrase": "acquainted_peers"}, {"score": 0.003179303164775306, "phrase": "update_translation"}, {"score": 0.002826092315294647, "phrase": "initial_update"}, {"score": 0.0027440826979105533, "phrase": "update_propagation"}, {"score": 0.002391670093694849, "phrase": "returning_peer"}, {"score": 0.002314647987893668, "phrase": "conflict_detection"}], "paper_keywords": ["Information sharing and management", " interoperability issues in distributed heterogeneous information bases", " peer-to-peer", " update processing"], "paper_abstract": "We consider the problem of update processing in a peer-to-peer (P2P) database network where each peer consists of an independently created relational database. We assume that peers store related data, but data has heterogeneity wrt instances and schemas. The differences in schema and data vocabulary are bridged by value correspondences called mapping tables. Peers build an overlay network called acquaintance network, in which each peer may get acquainted with any other peer that stores related data. In this setting, the updates are free to initiate in any peer and are executed over other peers which are acquainted directly or indirectly with the updates initiator. The execution of an update is achieved by translating, through mapping tables, the update into a set of updates that are executed against the acquainted peers. We consider both the soundness and completeness of update translation. When updates are generated and propagated in the network initiated from a peer, a tree is built dynamically called Update Dependency Tree (UDT). The UDT depicts the relationships among the component updates generated from the initial update. We also discuss the issues of the update propagation when a peer is temporarily unavailable or offline. Our propagation mechanism keeps track of a peer when the peer is not available for a certain period of time and once the peer comes back online the system propagates the updates destined to the returning peer to keep it's database synchronized. Moreover, conflict detection and resolution strategies have been proposed for such a dynamic P2P database network. We have implemented and experimentally tested a prototype of our update processing mechanism on a small P2P database network. We show the results of our experiments.", "paper_title": "UPDATE PROCESSING IN INSTANCE-MAPPED P2P DATA SHARING SYSTEMS", "paper_id": "WOS:000273426000001"}