{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linked_data"}, {"score": 0.004374267836149339, "phrase": "highly_structured_and_formalised_data"}, {"score": 0.004266067096140677, "phrase": "unambiguous_description"}, {"score": 0.004040688646993605, "phrase": "software_applications"}, {"score": 0.004007083686875716, "phrase": "visualisation_systems"}, {"score": 0.003795335309109018, "phrase": "significant_gap"}, {"score": 0.0035648266669315943, "phrase": "significant_focus"}, {"score": 0.003306559295382181, "phrase": "user_interfaces"}, {"score": 0.0031186510842824626, "phrase": "linked_data_applications"}, {"score": 0.00300351371036355, "phrase": "formalised_approach"}, {"score": 0.002966084234963723, "phrase": "aesthetically_pleasing_semantic_web_interfaces"}, {"score": 0.0029291198314113608, "phrase": "aesthetic_principles"}, {"score": 0.0027510752634224726, "phrase": "generic_approach"}, {"score": 0.00246765655376112, "phrase": "ontology_structures"}, {"score": 0.0023964590500856887, "phrase": "underlying_data"}, {"score": 0.0023665766694993535, "phrase": "exploratory_activities"}, {"score": 0.002337066031028783, "phrase": "visual_query"}, {"score": 0.00231759652007697, "phrase": "highly_precise_information_needs"}, {"score": 0.0021049977753042253, "phrase": "semantic_web_researchers"}], "paper_keywords": ["Linked Data", " information visualisation", " aesthetics", " Visual Analytics", " Semantic Web"], "paper_abstract": "The essence and value of Linked Data lies in the ability of humans and machines to query, access and reason upon highly structured and formalised data. Ontology structures provide an unambiguous description of the structure and content of data. While a multitude of software applications and visualisation systems have been developed over the past years for Linked Data, there is still a significant gap that exists between applications that consume Linked Data and interfaces that have been designed with significant focus on aesthetics. Though the importance of aesthetics in affecting the usability, effectiveness and acceptability of user interfaces have long been recognised, little or no explicit attention has been paid to the aesthetics of Linked Data applications. In this paper, we introduce a formalised approach to developing aesthetically pleasing Semantic Web interfaces by following aesthetic principles and guidelines identified from literature. We apply such principles to design and develop a generic approach of using visualisations to support exploration of Linked Data, in an interface that is pleasing to users. This provides users with means to browse ontology structures, enriched with statistics of the underlying data, facilitating exploratory activities and enabling visual query for highly precise information needs. We evaluated our approach in three ways: an initial objective evaluation comparing our approach with other well-known interfaces for the Semantic Web and two user evaluations with Semantic Web researchers.", "paper_title": "Affective graphs: The visual appeal of Linked Data", "paper_id": "WOS:000357875500005"}