{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "heterogeneous_social_network"}, {"score": 0.00470983237900705, "phrase": "modern_online_social_platforms"}, {"score": 0.004578030096508602, "phrase": "broad_range"}, {"score": 0.004191007935893067, "phrase": "different_activities"}, {"score": 0.003922283019437895, "phrase": "world-wide_user_base"}, {"score": 0.003776504983530801, "phrase": "review_books"}, {"score": 0.0036823310827576628, "phrase": "fellow_readers"}, {"score": 0.0036246643358397272, "phrase": "heterogeneous_structure"}, {"score": 0.0035231224373946457, "phrase": "user-to-user_interactions"}, {"score": 0.003392129332620609, "phrase": "book_collections"}, {"score": 0.0031845067058084613, "phrase": "complete_snapshot"}, {"score": 0.00264296841319955, "phrase": "experimental_analysis"}, {"score": 0.002585144987720461, "phrase": "information-theory_tools"}, {"score": 0.0025526713533068793, "phrase": "mutual_information"}, {"score": 0.002520604609793834, "phrase": "tag-based_and_group-based_profiles"}, {"score": 0.0024654516678953658, "phrase": "wishlist-based_ones"}, {"score": 0.0022781229833499753, "phrase": "user_profiling"}, {"score": 0.0021317885325570604, "phrase": "multiple_dimensions"}, {"score": 0.0021049977753042253, "phrase": "users'_preferences"}], "paper_keywords": ["Heterogeneous", " multidimensional social networks", " online user behavior", " social web"], "paper_abstract": "Modern online social platforms allow their members to be involved in a broad range of activities including getting friends, joining groups, posting, and commenting resources. In this paper, we investigate whether a correlation emerges across the different activities a user can take part in. For our analysis, we focused on aNobii, a social platform with a world-wide user base of book readers, who post their readings, give ratings, review books, and discuss them with friends and fellow readers. aNobii presents a heterogeneous structure: 1) part social network, with user-to-user interactions; 2) part interest network, with the management of book collections; and 3) part folksonomy, with books that are tagged by the users. We analyzed a complete snapshot of aNobii and we focused on three specific activities a user can perform, namely tagging behavior, tendency to join groups and aptitude to compile a wishlist of the books one is planning to read. For each user, we create a tag-based, a group-based, and a wishlist-based profile. Experimental analysis, which was carried out with information-theory tools like entropy and mutual information, suggests that tag-based and group-based profiles are in general more informative than wishlist-based ones. Furthermore, we discover that the degree of correlation between the three profiles associated with the same user tend to be small. Hence, user profiling cannot be reduced to considering just any one type of user activity (albeit important) but it is crucial to incorporate multiple dimensions to effectively describe users' preferences and behavior.", "paper_title": "Analysis of a Heterogeneous Social Network of Humans and Cultural Objects", "paper_id": "WOS:000351545900002"}