{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "conceptual_graphs"}, {"score": 0.00471700544744796, "phrase": "acceptable_behaviour"}, {"score": 0.0039362878637371574, "phrase": "individual_agent_autonomy"}, {"score": 0.003700709435644458, "phrase": "normative_systems"}, {"score": 0.002728847267539957, "phrase": "effective_or_efficient_systems"}, {"score": 0.002607965563121546, "phrase": "norm_explanation"}, {"score": 0.0025865679621853667, "phrase": "naive_users"}, {"score": 0.0025338369486914364, "phrase": "graphical_norm_representation"}, {"score": 0.0022484715639779153, "phrase": "conceptual_graph"}, {"score": 0.002193559776999383, "phrase": "graphical_representation"}, {"score": 0.0021576973674470997, "phrase": "formal_semantics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Norms", " Conceptual graphs", " Reasoning", " Graph-based reasoning", " Normative violations"], "paper_abstract": "The specification of acceptable behaviour can be achieved via the use of obligations, permissions and prohibitions, collectively known as norms, which identify the states of affairs that should, may, or should not hold. Norms provide the ability to constrain behaviour while preserving individual agent autonomy. While much work has focused on the semantics of norms, the design of normative systems, and in particular understanding the impact of norms on a system, has received little attention. Since norms often interact with each other (for example, a permission may temporarily derogate an obligation, or a prohibition and obligation may conflict), understanding the effects of norms and their interactions becomes increasingly difficult as the number of norms increases. Yet this understanding can be critical in facilitating the design and development of effective or efficient systems. In response, this paper addresses the problem of norm explanation for Naive users by providing of a graphical norm representation that can explicate why a norm is applicable, violated or complied with, and identify the interactions between permissions and other types of norms. We adopt a conceptual graph based semantics to provide this graphical representation while maintaining a formal semantics. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Graphical norms via conceptual graphs", "paper_id": "WOS:000302820800005"}