{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_agents"}, {"score": 0.015491993213262745, "phrase": "micro-scale_geographical_analyses"}, {"score": 0.010283436940826987, "phrase": "person-identifiable_details"}, {"score": 0.004772518445873925, "phrase": "individual_health_data_confidentiality"}, {"score": 0.004620093797504386, "phrase": "disaggregate_data"}, {"score": 0.00443308765153716, "phrase": "geographical_health_analyses"}, {"score": 0.004253618550301311, "phrase": "review_boards"}, {"score": 0.004045391554481355, "phrase": "confidentiality-preserving_solutions"}, {"score": 0.0040097139701644165, "phrase": "fine-level_spatial_analyses"}, {"score": 0.0038930368103015467, "phrase": "confidentiality-preserving_changes"}, {"score": 0.0036914757355166966, "phrase": "simulation_case_study"}, {"score": 0.0035106702438029913, "phrase": "aggregate_data"}, {"score": 0.0034388111429203222, "phrase": "existing_data_confidentiality-preserving_techniques"}, {"score": 0.0029928611380840757, "phrase": "final_results"}, {"score": 0.002897109710213723, "phrase": "post-coordinated_analyses"}, {"score": 0.002581587777482942, "phrase": "rather_limited_set"}, {"score": 0.0025137856138000014, "phrase": "exploratory_discussion"}, {"score": 0.0023277282036119106, "phrase": "virtual_organizations"}, {"score": 0.0023139986108451967, "phrase": "successful_partnerships"}, {"score": 0.0023003498123420237, "phrase": "stakeholder_organizations"}, {"score": 0.002286781334850213, "phrase": "proper_collaboration_agreements"}, {"score": 0.002273292707863821, "phrase": "clear_policies"}, {"score": 0.002253208464566164, "phrase": "unambiguous_interpretations"}, {"score": 0.002142696637011647, "phrase": "technological_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["data confidentiality", " privacy", " data confidentiality-preserving techniques", " intelligent software agents", " distributed cornputer systems security", " Web services", " virtual organizations", " micro-scale geographical analyses", " spatial analyses using disaggregate data", " public health informatics"], "paper_abstract": "Confidentiality constraints often preclude the release of disaggregate data about individuals, which limits the types and accuracy of the results of geographical health analyses that could be done. Access to individually geocoded (disaggregate) data often involves lengthy and cumbersome procedures through review boards and committees for approval (and sometimes is not possible). Moreover, current data confidentiality-preserving solutions compatible with fine-level spatial analyses either lack flexibility or yield less than optimal results (because of confidentiality-preserving changes they introduce to disaggregate data), or both. Ill this paper, we present a simulation case study to illustrate how some analyses cannot be (or will suffer if) done on aggregate data. We then quickly review some existing data confidentiality-preserving techniques, and move on to explore a solution based on software agents with the potential of providing flexible, controlled (software-only) access to unmodified confidential disaggregate data and returning only results that do not expose any person-identifiable details. The solution is thus appropriate for micro-scale geographical analyses where no person-identifiable details are required in the final results (i.e., only aggregate results are needed). Our proposed software agent technique also enables post-coordinated analyses to be designed and carried out on the confidential database(s), as needed, compared to a more conventional solution based on the Web Services model that would only support a rigid, pre-coordinated (pre-determined) and rather limited set of analyses. The paper also provides an exploratory discussion of mobility, security, and trust issues associated with software agents, as well as possible directions/solutions to address these issues, including the use of virtual organizations. Successful partnerships between stakeholder organizations, proper collaboration agreements, clear policies, and unambiguous interpretations of laws and regulations are also much needed to support and ensure the success of any technological solution. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Using software agents to preserve individual health data confidentiality in micro-scale geographical analyses", "paper_id": "WOS:000236420100005"}