{"auto_keywords": [{"score": 0.04976102042618512, "phrase": "artificial_reality_experiences"}, {"score": 0.039145814772338076, "phrase": "third-person_paradigm"}, {"score": 0.03235740424067532, "phrase": "virtual_rehabilitation"}, {"score": 0.00481495049065317, "phrase": "interaction_paradigms"}, {"score": 0.004327981760540394, "phrase": "seminal_videoplace"}, {"score": 0.004299228562179176, "phrase": "myron_krueger"}, {"score": 0.004075946554498088, "phrase": "classic_vr_first-"}, {"score": 0.004048860957751714, "phrase": "third-person_notions"}, {"score": 0.003687960013746783, "phrase": "specific_justification"}, {"score": 0.0035669891404642015, "phrase": "original_videoplace_system"}, {"score": 0.0034614999671904964, "phrase": "commercial_development_tools"}, {"score": 0.003438483411236772, "phrase": "leisure_systems"}, {"score": 0.003314591878914152, "phrase": "vr_systems"}, {"score": 0.0030189426536422577, "phrase": "beneficial_properties"}, {"score": 0.0029492339651639734, "phrase": "first-person_paradigm"}, {"score": 0.002900426826591769, "phrase": "better_adequacy"}, {"score": 0.002842920225545139, "phrase": "potential_differences"}, {"score": 0.0027587851842693725, "phrase": "application_categorization"}, {"score": 0.0023113506171584157, "phrase": "required_goals"}, {"score": 0.00216923754570397, "phrase": "potential_impact"}], "paper_keywords": [""], "paper_abstract": "In Artificial Reality experiences, that is, interactive, unencumbered, full-body, 2D vision-based virtual reality (VR) experiences (heirs of the seminal Videoplace by Myron Krueger), there are two possible interaction paradigms, namely, first-person and third-personwhich differ significantly from the classic VR first- and third-person notions. Up until now, these two paradigms had not been compared or objectively analyzed in such systems. Moreover, most systems are based on the third-person paradigm without a specific justification, most probably due to the influence of the original Videoplace system and because it is the only paradigm available in commercial development tools and leisure systems. For example, many rehabilitation projects have chosen to use these VR systems because of their many advantages. However, most of these projects and research have blindly adopted the third-person paradigm. Hence, the field of virtual rehabilitation has analyzed the beneficial properties of these systems without considering the first-person paradigm that could potentially present better adequacy. To find and understand potential differences between the two paradigms, we have defined an application categorization from which we developed two full-body interactive games and set up an experiment to analyze each game in both paradigms. We studied how 39 participants played these games and we quantitatively and qualitatively analyzed how each paradigm influenced the experience, the activity and the behavior of the users and the efficiency in accomplishing the required goals. We present the results of these experiments and their general implications, and especially for virtual rehabilitation due to the potential impact these systems may have in the well-being of many people.", "paper_title": "Analyzing the Adequacy of Interaction Paradigms in Artificial Reality Experiences", "paper_id": "WOS:000313632500001"}