{"auto_keywords": [{"score": 0.044074479398844894, "phrase": "preferred_orientation_band"}, {"score": 0.015719716506582538, "phrase": "edge_orientations"}, {"score": 0.014878711539752447, "phrase": "recognition_tasks"}, {"score": 0.004761732436126133, "phrase": "important_role"}, {"score": 0.004622662375029505, "phrase": "primitive_visual_feature"}, {"score": 0.00452101969521343, "phrase": "filter-based_schemes"}, {"score": 0.004324361008753555, "phrase": "classical_filter-based_approach"}, {"score": 0.003956234229826621, "phrase": "edge_orientation"}, {"score": 0.0037421829222825964, "phrase": "primitive_feature"}, {"score": 0.0036193316508938795, "phrase": "novel_filtering_scheme"}, {"score": 0.0032987614613108345, "phrase": "computational_model"}, {"score": 0.0032501644753165555, "phrase": "basic_mechanisms"}, {"score": 0.0032261342460565457, "phrase": "cortical_processing"}, {"score": 0.0029185415814209055, "phrase": "psychophysical_and_neuro-physiological_findings"}, {"score": 0.0028542615085879975, "phrase": "feedforward_stage"}, {"score": 0.0028017745468000587, "phrase": "classical_filter-based_method"}, {"score": 0.0024603551979225195, "phrase": "recurrent_processing"}, {"score": 0.0022927343007881846, "phrase": "classical_filter-based_methods"}, {"score": 0.002258944922553699, "phrase": "gabor"}, {"score": 0.002242206465278159, "phrase": "neumann_filtering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Edge orientation estimation", " Image filtering", " Biological-inspired model"], "paper_abstract": "Edge orientations play an important role in recognition due to their function as a primitive visual feature for various kinds of recognition tasks. Filter-based schemes are the most well-known and widely used method for analyzing edge orientation. However, the classical filter-based approach passes not only edges inside the preferred orientation band, but also edges outside the band. This can cause ambiguity in the estimation of edge orientation and can subsequently lead to failure in recognition tasks where edge orientations are used as a primitive feature. In this paper, we propose a novel filtering scheme, referred to as oriented edge-selective band-pass filtering, which passes edges inside the preferred orientation band and prevents edges outside the band from passing through. We present a computational model based on the basic mechanisms of cortical processing, i.e., a recurrent framework integrating the feedforward, lateral, and feedback processes, with the aim of investigating a solution based on the psychophysical and neuro-physiological findings of several decades. In the feedforward stage, our model employs a classical filter-based method to allow as many edges as possible in the preferred orientation band to pass through, while also allowing some edges outside the band to pass. The responses of edges outside the band are then inhibited by recurrent processing, involving two steps: a lateral and a feedback stage. We evaluated the performance of our model against classical filter-based methods, such as Gabor and Neumann filtering, using several artificial and natural images. The results validated the effectiveness of our approach. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Oriented edge-selective band-pass filtering", "paper_id": "WOS:000337647300007"}