{"auto_keywords": [{"score": 0.013848859515029554, "phrase": "reservation_price"}, {"score": 0.01248289411401326, "phrase": "dynamic_multithreaded_negotiations"}, {"score": 0.01178241783099351, "phrase": "single-threaded_negotiation_model"}, {"score": 0.00481495049065317, "phrase": "uncertain_dynamic_outside_options"}, {"score": 0.004622783000449884, "phrase": "bilateral_negotiations"}, {"score": 0.00451642066363115, "phrase": "uncertain_and_dynamic_outside_options"}, {"score": 0.004361428012479218, "phrase": "negotiation_strategies"}, {"score": 0.0038820411362656803, "phrase": "multithreaded_negotiations"}, {"score": 0.003705323407433896, "phrase": "increased_sophistication"}, {"score": 0.0033559647822437298, "phrase": "synchronized_multithreaded_negotiations"}, {"score": 0.0029694040368299624, "phrase": "synchronized_multithreaded_model"}, {"score": 0.0029009722548088306, "phrase": "uncertain_outside_options"}, {"score": 0.002752695791351096, "phrase": "experimental_analysis"}, {"score": 0.002507511169156787, "phrase": "negotiation_strategy"}, {"score": 0.002231441081806766, "phrase": "average_utility"}, {"score": 0.0021049977753042253, "phrase": "future_options"}], "paper_keywords": [""], "paper_abstract": "We present a model for bilateral negotiations that considers the uncertain and dynamic outside options. Outside options affect the negotiation strategies via their impact on the reservation price. The model is composed of three modules: single-threaded negotiations, synchronized multithreaded negotiations, and dynamic multithreaded negotiations. These three modules embody increased sophistication and complexity. The single-threaded negotiation model provides negotiation strategies without specifically considering outside options. The model of synchronized multithreaded negotiations builds on the single-threaded negotiation model and considers the presence of concurrently existing outside options. The model of dynamic multithreaded negotiations expands the synchronized multithreaded model by considering the uncertain outside options that may come dynamically in the future. Experimental analysis is provided to characterize the impact of outside options on the reservation price and thus on the negotiation strategy. The results show that the utility of a negotiator improves significantly if he/she considers outside options, and the average utility is higher when he/she considers both the concurrent outside options and the foresees future options.", "paper_title": "Bilateral negotiation decisions with uncertain dynamic outside options", "paper_id": "WOS:000235899000004"}