{"auto_keywords": [{"score": 0.047582591498013686, "phrase": "abstract_machines"}, {"score": 0.00481495049065317, "phrase": "syntactic_and_functional_correspondence"}, {"score": 0.0033101397746161843, "phrase": "syntactic_correspondence"}, {"score": 0.0031003255054939524, "phrase": "functional_correspondence"}, {"score": 0.002801849371896573, "phrase": "well-formed_continuation_stacks"}, {"score": 0.002593091742792519, "phrase": "substitution-based_normalisers"}, {"score": 0.002399850604120431, "phrase": "complete_strategy"}, {"score": 0.002357337046408753, "phrase": "pure_lambda_calculus"}], "paper_keywords": ["Operational semantics", " Program transformation", " Reduction strategies", " Abstract machines", " Full reduction"], "paper_abstract": "We show how to connect the syntactic and the functional correspondence for normalisers and abstract machines implementing hybrid (or layered) reduction strategies, that is, strategies that depend on subsidiary sub-strategies. Many fundamental strategies in the literature are hybrid, in particular, many full-reducing strategies, and many full-reducing and complete strategies that deliver a fully reduced result when it exists. If we follow the standard program-transformation steps the abstract machines obtained for hybrids after the syntactic correspondence cannot be refunctionalised, and the junction with the functional correspondence is severed. However, a solution is possible based on establishing the shape invariant of well-formed continuation stacks. We illustrate the problem and the solution with the derivation of substitution-based normalisers for normal order, a hybrid, full-reducing, and complete strategy of the pure lambda calculus. The machine we obtain is a substitution-based, eval/apply, open-terms version of Pierre Cregut's full-reducing Krivine machine KN. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the syntactic and functional correspondence between hybrid (or layered) normalisers and abstract machines", "paper_id": "WOS:000344578700003"}