{"auto_keywords": [{"score": 0.03426086753439406, "phrase": "plane_spanner"}, {"score": 0.01501839147499667, "phrase": "complete_euclidean_graph"}, {"score": 0.012048635174302902, "phrase": "stretch_factor"}, {"score": 0.008886516003308585, "phrase": "maximum_degree"}, {"score": 0.00481495049065317, "phrase": "plane_spanners_of_degree"}, {"score": 0.004281372589330329, "phrase": "spanning_subgraph_g"}, {"score": 0.0040882422992520925, "phrase": "simply_a_spanner"}, {"score": 0.0033561632967173856, "phrase": "smallest_maximum_degree"}, {"score": 0.0031512402798625056, "phrase": "planarity_constraint"}, {"score": 0.002813307389456184, "phrase": "planarity_requirement"}, {"score": 0.0026193328696791306, "phrase": "long_sequence"}, {"score": 0.002564862727498502, "phrase": "upper_bound"}, {"score": 0.0023481578019624843, "phrase": "big_step"}, {"score": 0.002158780936704905, "phrase": "efficient_algorithm"}], "paper_keywords": ["Plane spanner", " Bounded degree", " Delaunay triangulation", " Stretch factor"], "paper_abstract": "Let E be the complete Euclidean graph on a set of points embedded in the plane. Given a constant t >= 1, a spanning subgraph G of E is said to be a t-spanner, or simply a spanner, if for any pair of nodes u, v in E the distance between u and v in G is at most t times their distance in E. The constant t is referred to as the stretch factor. A spanner is plane if its edges do not cross. This paper considers the question: \"What is the smallest maximum degree that can always be achieved for a plane spanner of E?\" Without the planarity constraint, it is known that the answer is 3 which is thus the best known lower bound on the degree of any plane spanner. With the planarity requirement, the best known upper bound on the maximum degree is 6, the last in a long sequence of results improving the upper bound. In this paper, we show that the complete Euclidean graph always contains a plane spanner of maximum degree 4 and make a big step toward closing the question. The stretch factor of the spanner is bounded by 156.82. Our construction leads to an efficient algorithm for obtaining the spanner from Chew's L-1-Delaunay triangulation.", "paper_title": "There are Plane Spanners of Degree 4 and Moderate Stretch Factor", "paper_id": "WOS:000353895200003"}