{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "formal_verification"}, {"score": 0.004437349839203418, "phrase": "antecedent_failure"}, {"score": 0.004352876088312741, "phrase": "successful_pass"}, {"score": 0.00429057323623293, "phrase": "verification_procedure"}, {"score": 0.004229158339021651, "phrase": "vacuity_detection"}, {"score": 0.004050116768809519, "phrase": "indeed_vacuity_checks"}, {"score": 0.0039729853486821995, "phrase": "standard_component"}, {"score": 0.0035060903664150115, "phrase": "first_dimension"}, {"score": 0.0031238084716187805, "phrase": "significantly_smaller_effort"}, {"score": 0.003049555059533735, "phrase": "second_dimension"}, {"score": 0.002837188425640173, "phrase": "standard_vacuity_checks"}, {"score": 0.002166711569953301, "phrase": "extra_information"}, {"score": 0.002125371638869951, "phrase": "tighter_specifications"}], "paper_keywords": ["Vacuity", " Model-checking", " Complexity"], "paper_abstract": "In formal verification, we verify that a system is correct with respect to a specification. Cases like antecedent failure can make a successful pass of the verification procedure meaningless. Vacuity detection can signal such \"meaningless\" passes of the specification, and indeed vacuity checks are now a standard component in many commercial model checkers. We address two dimensions of vacuity: the computational effort and the information that is given to the user. As for the first dimension, we present several preliminary vacuity checks that can be done without the design itself, which implies that some information can be found with a significantly smaller effort. As for the second dimension, we present algorithms for deriving two types of information that are not provided by standard vacuity checks, assuming M satisfies phi for a model M and formula phi: (a) behaviors that are possibly missing from M (or wrongly restricted by the environment) (b) the largest subset of occurrences of literals in. that can be replaced with FALSE simultaneously without falsifying. in M. The complexity of each of these problems is proven. Overall this extra information can lead to tighter specifications and more guidance for finding errors.", "paper_title": "Before and after vacuity", "paper_id": "WOS:000263011000002"}