{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "online_geocoding_services"}, {"score": 0.004736666296080189, "phrase": "uncertain_process"}, {"score": 0.00462919213721188, "phrase": "place_name"}, {"score": 0.004598933498016774, "phrase": "geographic_coordinates"}, {"score": 0.004450568197899267, "phrase": "stand-alone_computer"}, {"score": 0.004406994912939125, "phrase": "geocoding_tools"}, {"score": 0.0043495571869907376, "phrase": "gis_software_packages"}, {"score": 0.0042508289538799905, "phrase": "skillful_operators"}, {"score": 0.003802135020791801, "phrase": "online_geocoding"}, {"score": 0.0037402558657576124, "phrase": "internet_users"}, {"score": 0.0035605741849764187, "phrase": "increasing_number"}, {"score": 0.003247868216333148, "phrase": "service_requestors"}, {"score": 0.0031740669025323606, "phrase": "geocoded_results"}, {"score": 0.002982068153662372, "phrase": "geocoded_addresses"}, {"score": 0.0029334961578930054, "phrase": "subsequent_decisions"}, {"score": 0.0027924625350414655, "phrase": "five_online_geocoding_services"}, {"score": 0.002738022493933376, "phrase": "google"}, {"score": 0.0027200305495826797, "phrase": "mappoint"}, {"score": 0.002702217436837276, "phrase": "mapquest"}, {"score": 0.0026321198895843173, "phrase": "geocoding_service"}, {"score": 0.002346160830406661, "phrase": "different_location_characteristics"}, {"score": 0.0021610874773389096, "phrase": "general_guideline"}, {"score": 0.0021328586481696157, "phrase": "suitable_service"}, {"score": 0.0021049977753042253, "phrase": "application's_needs"}], "paper_keywords": ["location-based services", " Internet GIS", " quality issues", " uncertainty", " Web GIS", " geocoding"], "paper_abstract": "Geocoding is an uncertain process that associates an address or a place name with geographic coordinates. Traditionally, geocoding is performed locally on a stand-alone computer with the geocoding tools usually bundled in GIS software packages. The use of such tools requires skillful operators who know about the issues of geocoding, that is, reference databases and complicated geocoding interpolation techniques. These days, with the advancement in the Internet and Web services technologies, online geocoding provides its functionality to the Internet users with ease; thus, they are often unaware of such issues. With an increasing number of online geocoding services, which differ in their reference databases, the geocoding algorithms, and the strategy for dealing with inputs and outputs, it is crucial for the service requestors to realize the quality of the geocoded results of each service before choosing one for their applications. This is primarily because any errors associated with the geocoded addresses will be propagated to subsequent decisions, activities, modeling, and analysis. This article examines the quality of five online geocoding services: Geocoder. us, Google, MapPoint, MapQuest, and Yahoo!. The quality of each geocoding service is evaluated with three metrics: match rate, positional accuracy, and similarity. A set of addresses from the US Environmental Protection Agency (EPA) database were used as a baseline. The results were statistically analyzed with respect to different location characteristics. The outcome of this study reveals the differences among the online geocoding services on the quality of their geocoding results and it can be used as a general guideline for selecting a suitable service that matches an application's needs.", "paper_title": "Comparative evaluation and analysis of online geocoding services", "paper_id": "WOS:000278668800007"}