{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "side_information"}, {"score": 0.0065739195468988865, "phrase": "single-letter_characterization"}, {"score": 0.004672444473700524, "phrase": "memoryless_sources"}, {"score": 0.0044219992735047954, "phrase": "rate-distortion_function"}, {"score": 0.00392100783796804, "phrase": "special_case"}, {"score": 0.003113441660343867, "phrase": "hidden_markov_model"}, {"score": 0.003066945490483524, "phrase": "source_sequences"}, {"score": 0.002858952758523772, "phrase": "side_information_delay"}, {"score": 0.0024842242921857705, "phrase": "zero_or_one_source_symbol"}, {"score": 0.0024105326885334962, "phrase": "rate-distortion_region"}, {"score": 0.0021049977753042253, "phrase": "gaussian_sources"}], "paper_keywords": ["Causal conditioning", " hidden Markov model", " Markov Gaussian process", " multiplexing", " rate-distortion function", " strictly causal side information"], "paper_abstract": "For memoryless sources, delayed side information at the decoder does not improve the rate-distortion function. However, this is not the case for sources with memory, as demonstrated by a number of works focusing on the special case of (delayed) feedforward. In this paper, a setting is studied in which the encoder is potentially uncertain about the delay with which measurements of the side information, which is available at the encoder, are acquired at the decoder. Assuming a hidden Markov model for the source sequences, at first, a single-letter characterization is given for the setup where the side information delay is arbitrary and known at the encoder, and the reconstruction at the destination is required to be asymptotically lossless. Then, with delay equal to zero or one source symbol, a single-letter characterization of the rate-distortion region is given for the case where, unbeknownst to the encoder, the side information may be delayed or not. Finally, examples for binary and Gaussian sources are provided.", "paper_title": "Source Coding When the Side Information May Be Delayed", "paper_id": "WOS:000320709800025"}