{"auto_keywords": [{"score": 0.041197327123663696, "phrase": "group_investigations"}, {"score": 0.03994855929694926, "phrase": "content_analysis"}, {"score": 0.004254467919664946, "phrase": "organise_information"}, {"score": 0.004120694410890683, "phrase": "learning_activity"}, {"score": 0.004007083686875716, "phrase": "undergraduate_students"}, {"score": 0.003850173884725567, "phrase": "information_management"}, {"score": 0.0036993855514735746, "phrase": "presentation-planning_stage"}, {"score": 0.0035973486787314883, "phrase": "findings_-_findings"}, {"score": 0.0034981163169818803, "phrase": "focus_formulation_step"}, {"score": 0.0027741761880779535, "phrase": "-_issues"}, {"score": 0.0025202582748972122, "phrase": "dialogic_interaction"}, {"score": 0.0025001755089445092, "phrase": "collaborative_information"}, {"score": 0.0024408799645640323, "phrase": "-_the_originality"}, {"score": 0.0022085455097790537, "phrase": "educationally-valued_interaction"}, {"score": 0.0021049977753042253, "phrase": "learning_settings"}], "paper_keywords": ["Information research", " Information retrieval", " Content management"], "paper_abstract": "Purpose - The purpose of this research is to identify the organization, functions, and forms of talk that occur as groups collectively review, interpret, and organise information sought and retrieved as part of a learning activity. Design/methodology/approach - Participants in the study were undergraduate students conducting a series of group investigations into the topic of information management. A content analysis of the discourse generated during the presentation-planning stage of the group investigations was conducted. Findings - Findings relate to the discovery of a focus formulation step: speakers' use of structuring, informing. eliciting, and summarizing sequences: and speakers' use of exploratory, coordinating, disputational. and cumulative forms of talk. Variations in the use of the functions and forms of talk across the steps of the task and across the groups are discussed. Research limitations/implications - Issues relating to the reliability and validity of the content analysis are discussed; along with the implications of the study for the support of dialogic interaction during collaborative information seeking and use. Originality/value - The originality of the paper rests in analyzing collaboration in information seeking and use as a discourse; and in hypothesizing as to the nature of educationally-valued interaction when speakers collaborate oil the seeking and use of information in learning settings.", "paper_title": "Understanding interaction in information seeking and use as a discourse: a dialogic approach", "paper_id": "WOS:000263619500005"}