{"auto_keywords": [{"score": 0.04203090498641829, "phrase": "ami"}, {"score": 0.00459990650330792, "phrase": "multidisciplinary_paradigm"}, {"score": 0.004377719094086111, "phrase": "home_environments"}, {"score": 0.004295136518467118, "phrase": "ami_vision"}, {"score": 0.004262539473250432, "phrase": "home_automation"}, {"score": 0.003964896373751171, "phrase": "better_mechanisms"}, {"score": 0.003934795713147731, "phrase": "human-computer_communication"}, {"score": 0.0038900709793274484, "phrase": "natural_human-computer_interaction"}, {"score": 0.003456554957885269, "phrase": "human-like_communication"}, {"score": 0.0034303002275695446, "phrase": "ambient_intelligent_environments"}, {"score": 0.0032396224508754387, "phrase": "fuzzy_logic_based_cwws_framework"}, {"score": 0.003190584226787897, "phrase": "advanced_real-world_application"}, {"score": 0.002922637921202474, "phrase": "transparent_human-computer_communication"}, {"score": 0.0028783840417661694, "phrase": "obtrusive_tablets"}, {"score": 0.0028565082986974602, "phrase": "computing_equipment"}, {"score": 0.0026567830878420347, "phrase": "competent_levels"}, {"score": 0.002616544154458438, "phrase": "energy_efficiency"}, {"score": 0.0025867643733794724, "phrase": "proposed_ambient_intelligent_food_preparation_system"}, {"score": 0.0025282151875392817, "phrase": "user_comfort"}, {"score": 0.002499438189264537, "phrase": "food_preparation"}, {"score": 0.002470987929071079, "phrase": "energy_consumption"}, {"score": 0.0024335561337016174, "phrase": "useful_tool"}, {"score": 0.0023694065215394593, "phrase": "major_disabilities"}, {"score": 0.002351389889948836, "phrase": "vision_impairment"}, {"score": 0.0023069440108381364, "phrase": "real-world_experiments"}, {"score": 0.0022120914337992034, "phrase": "aifps"}], "paper_keywords": [""], "paper_abstract": "Ambient Intelligence (AmI) is a multidisciplinary paradigm, which positively alters the relationship between humans and technology. Concerning home environments, the functions of AmI vision include home automation, communication, entertainment, working and learning. In the area of communication, AmI still needs better mechanisms for human-computer communication. A natural human-computer interaction necessitates having systems capable of modelling words and computing with them. For this purpose, the paradigm of Computing With Words (CWWs) can be employed to mimic human-like communication in Ambient Intelligent Environments (AIEs). This paper demonstrates the extendibility of Linear General Type-2 (LGT2) Fuzzy Logic based CWWs Framework to create an advanced real-world application, which integrates a semi-autonomous, safe and energy efficient electric hob. The motivation of this work is twofold: 1) there is a need to develop transparent human-computer communication rather than embedding obtrusive tablets and computing equipment throughout our surroundings, and 2) one of the most hazardous and energy consuming household devices, the electric hob, does not have competent levels of intelligence and energy efficiency. The proposed Ambient Intelligent Food Preparation System (AIFPS) can increase user comfort, facilitate food preparation, minimize energy consumption and be a useful tool for the elderly and people with major disabilities including vision impairment. The results of real-world experiments with various lay users in the intelligent flat (iSpace) show the success of AIFPS in providing up to 55.43% improved natural interaction (compared to Interval Type-2 based CWWs Framework) while achieving semi-autonomous, safe and energy efficient cooking that can save energy between 11.5% and 35.2%.", "paper_title": "An Ambient Intelligent and Energy Efficient Food Preparation System Using Linear General Type-2 Fuzzy Logic Based Computing with Words Framework", "paper_id": "WOS:000363206100007"}