{"auto_keywords": [{"score": 0.049655608595442394, "phrase": "analogy-based_effort_estimation"}, {"score": 0.043891862951523704, "phrase": "adjustment_methods"}, {"score": 0.00481495049065317, "phrase": "ensemble_adjustment_methods"}, {"score": 0.004688321299229397, "phrase": "effort_adjustment"}, {"score": 0.004626255242038005, "phrase": "essential_part"}, {"score": 0.004444921827311577, "phrase": "nearest_analogies"}, {"score": 0.003299880298525127, "phrase": "large_scale_comparison_study"}, {"score": 0.003073154478201771, "phrase": "eight_datasets"}, {"score": 0.0029263562233195423, "phrase": "standardized_accuracy"}, {"score": 0.002761856557698856, "phrase": "statistical_significance_testing"}, {"score": 0.0027131212233443137, "phrase": "reasonable_significant_improvements"}, {"score": 0.0026771333996253783, "phrase": "predictive_performance"}, {"score": 0.0026534064006291853, "phrase": "ensemble_methods"}, {"score": 0.0024600113832396187, "phrase": "good_performance"}, {"score": 0.002352886041381761, "phrase": "single_methods"}, {"score": 0.00221068461235127, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ensemble learning", " Analogy based estimation", " Adjustment methods"], "paper_abstract": "Context: Effort adjustment is an essential part of analogy-based effort estimation, used to tune and adapt nearest analogies in order to produce more accurate estimations. Currently, there are plenty of adjustment methods proposed in literature, but there is no consensus on which method produces more accurate estimates and under which settings. Objective: This paper investigates the potential of ensemble learning for variants of adjustment methods used in analogy-based effort estimation. The number k of analogies to be used is also investigated. Method: We perform a large scale comparison study where many ensembles constructed from n out of 40 possible valid variants of adjustment methods are applied to eight datasets. The performance of each method was evaluated based on standardized accuracy and effect size. Results: The results have been subjected to statistical significance testing, and show reasonable significant improvements on the predictive performance where ensemble methods are applied. Conclusion: Our conclusions suggest that ensembles of adjustment methods can work well and achieve good performance, even though they are not always superior to single methods. We also recommend constructing ensembles from only linear adjustment methods, as they have shown better performance and were frequently ranked higher. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "An empirical evaluation of ensemble adjustment methods for analogy-based effort estimation", "paper_id": "WOS:000351971500003"}