{"auto_keywords": [{"score": 0.032880713673157154, "phrase": "shapley"}, {"score": 0.00481495049065317, "phrase": "linguistic_hesitant_fuzzy_environment"}, {"score": 0.0046593017130868, "phrase": "new_class"}, {"score": 0.00461575768501871, "phrase": "fuzzy_sets"}, {"score": 0.0045726187330434025, "phrase": "linguistic_hesitant_fuzzy_sets"}, {"score": 0.004342430078306461, "phrase": "qualitative_preferences"}, {"score": 0.004028054020045027, "phrase": "defined_operational_laws"}, {"score": 0.003934540154108188, "phrase": "order_relationship"}, {"score": 0.003807242767474929, "phrase": "generalized_linguistic_hesitant_fuzzy_hybrid"}, {"score": 0.0027139447110929586, "phrase": "glhfhwa_and_glhfhgm_operators"}, {"score": 0.002626034130205569, "phrase": "optimal_fuzzy_measures"}, {"score": 0.0026014425686078993, "phrase": "additive_measures"}, {"score": 0.0025053520095236694, "phrase": "ordered_set"}, {"score": 0.0023678143146455017, "phrase": "linguistic_hesitant_fuzzy_multi-attribute_decision_analysis"}, {"score": 0.0021857667493036786, "phrase": "proposed_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Decision analysis", " Linguistic hesitant fuzzy set", " Hybrid aggregation operator", " Shapley function"], "paper_abstract": "In this paper, a new class of fuzzy sets called linguistic hesitant fuzzy sets (LHFSs) is defined, which can address the qualitative preferences of experts as well as reflect their hesitancy, uncertainty and inconsistency. Based on the defined operational laws of LHFSs and the order relationship, two linguistic hesitant fuzzy hybrid aggregation operators are defined: the generalized linguistic hesitant fuzzy hybrid weighted averaging (GLHFHWA) operator and the generalized linguistic hesitant fuzzy hybrid geometric mean (GLHFHGM) operator. Furthermore, to address the situation in which the elements in a set are interdependent, the generalized linguistic hesitant fuzzy hybrid Shapley weighted averaging (GLHFHSWA) operator and the generalized linguistic hesitant fuzzy hybrid Shapley geometric mean (GLHFHSGM) operator are presented, which are extensions of the GLHFHWA and GLHFHGM operators. Models designed to obtain the optimal fuzzy measures and additive measures on an attribute set and on an ordered set are, respectively, constructed. Then, an approach to linguistic hesitant fuzzy multi-attribute decision analysis is developed. Finally, two numerical examples are provided to demonstrate the practicality and efficiency of the proposed procedure. (C) 2014 Published by Elsevier Inc.", "paper_title": "Multi-attribute decision analysis under a linguistic hesitant fuzzy environment", "paper_id": "WOS:000334136200017"}