{"auto_keywords": [{"score": 0.049517389162701646, "phrase": "cell-vertex_velocities"}, {"score": 0.01191867880134377, "phrase": "flux_polyhedrons"}, {"score": 0.00481495049065317, "phrase": "-fluid_advection_method"}, {"score": 0.0041625173012740544, "phrase": "first-_and_second-order_piecewise_planar_approximations"}, {"score": 0.00384731849108269, "phrase": "lagrangian_trajectories"}, {"score": 0.003459191419478298, "phrase": "advection_equation"}, {"score": 0.003097865379563127, "phrase": "void_regions"}, {"score": 0.0027961342030212353, "phrase": "nonplanar_faces"}, {"score": 0.0026045914281028473, "phrase": "geometric_algorithms"}, {"score": 0.002494039334114861, "phrase": "new_vof_method"}, {"score": 0.002426137929553722, "phrase": "unstructured_meshes"}, {"score": 0.002259883463607508, "phrase": "final_advection_result"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interface-capturing", " Volume-of-Fluid", " 3-D unstructured mesh"], "paper_abstract": "A new geometrical Volume-of-Fluid (VOF) method for capturing interfaces on three-dimensional (3-D) Cartesian and unstructured meshes is introduced. The method reconstructs interfaces as first- and second-order piecewise planar approximations (PLIC), and advects volumes in a single unsplit Lagrangian-Eulerian (LE) geometrical algorithm based on constructing flux polyhedrons by tracing back the Lagrangian trajectories of the cell-vertex velocities. In this way, the situations of overlapping between flux polyhedrons are minimized, consequently, the accuracy in the solution of the advection equation is improved by minimizing the creation of overshoots (volume fractions over one), undershoots (volume fractions below zero) and wisps (fluid in void regions or vice versa). However, if not treated carefully, the use of cell-vertex velocities may result in the construction of flux polyhedrons that contain nonplanar faces and that do not conserve volume. Therefore, this work explains in detail a set of geometric algorithms necessary to overcome these two drawbacks. In addition, the new VOF method is analyzed numerically on 3-D Cartesian and unstructured meshes, first, by reconstructing the interface of spherical geometries and, second, by evaluating the final advection result of a sphere placed in a rotation, shear and deformation field. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A 3-D Volume-of-Fluid advection method based on cell-vertex velocities for unstructured meshes", "paper_id": "WOS:000335487600002"}