{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "iair-carped"}, {"score": 0.004651057147690674, "phrase": "fine-grained_and_layered_semantic_labels"}, {"score": 0.004171259063201874, "phrase": "novel_dataset"}, {"score": 0.004009288598277725, "phrase": "layered_semantic_labels"}, {"score": 0.003911253966141701, "phrase": "fine-grained_subcategories"}, {"score": 0.0037407704200033607, "phrase": "strict_psychophysical_experiments"}, {"score": 0.0035424245257172234, "phrase": "first_time"}, {"score": 0.0034901729647741353, "phrase": "object_recognition_dataset"}, {"score": 0.0033379819706003885, "phrase": "adaptive_and_in-depth_interpretations"}, {"score": 0.0030081030319492343, "phrase": "real_applications"}, {"score": 0.002394719113232821, "phrase": "recognition_systems"}, {"score": 0.0023710856920150574, "phrase": "individual_difficulties"}, {"score": 0.002157857111130435, "phrase": "possible_applications"}, {"score": 0.0021049977753042253, "phrase": "primary_experimental_results"}], "paper_keywords": ["Object recognition", " Image database", " Object detection", " Pedestrian detection", " Psychophysical experiments"], "paper_abstract": "Unlike many other object recognition datasets which provide either category-level or within-category annotations, we introduce a novel dataset called \"IAIR-CarPed\" with layered semantic labels ranging from categories to fine-grained subcategories. These labels are collected from 20 subjects via strict psychophysical experiments. To the best of our knowledge, it is the first time that an object recognition dataset is built in this way to represent the adaptive and in-depth interpretations of objects in human vision. This dataset focuses on \"car\" and \"pedestrian\" which are two representative categories important in real applications. It contains 3132 images collected from pictures taken under various conditions and 8567 objects carefully annotated by all the 20 subjects. Besides fine-grained and layered semantic labels, five types of detailed visual difficulties of these objects are also provided, which can be adopted to evaluate the representation and generalization abilities of the recognition systems against individual difficulties. We present here the details of building this dataset, its statistics and properties, and then discuss possible applications of it with some primary experimental results. (C) 2011 Elsevier BM. All rights reserved.", "paper_title": "IAIR-CarPed: A psychophysically annotated dataset with fine-grained and layered semantic labels for object recognition", "paper_id": "WOS:000298911200014"}