{"auto_keywords": [{"score": 0.049452114640627876, "phrase": "communication_network"}, {"score": 0.00481495049065317, "phrase": "multiclass_intermittent_connections"}, {"score": 0.004689650818647484, "phrase": "markovian_model"}, {"score": 0.004648609688625397, "phrase": "intermittent_connections"}, {"score": 0.003633927813203731, "phrase": "network_nodes"}, {"score": 0.00303398491761013, "phrase": "tcp-like_fashion"}, {"score": 0.002967931416941965, "phrase": "network_congestion"}, {"score": 0.0028778584739756786, "phrase": "feedback_loop"}, {"score": 0.0026585629592360085, "phrase": "markovian_fashion"}, {"score": 0.002434396049547248, "phrase": "nonlinear_markov_process"}, {"score": 0.0023918783117166326, "phrase": "mckean-vlasov_equation"}, {"score": 0.002238930800075706, "phrase": "stationary_distributions"}, {"score": 0.0021049977753042253, "phrase": "finite-dimensional_fixed-point_equation"}], "paper_keywords": ["Flow control algorithm", " Multiclass system", " Mean-field limit", " Chaoticity", " McKean-Vlasov equation", " Nonlinear Markov process", " Stationary distribution"], "paper_abstract": "A Markovian model for intermittent connections of various classes in a communication network is established and investigated. Any connection alternates between being OFF (idle) or ON (active, with data to transmit), and evolves in a way depending only on its class and the state of the network, in particular for the routes it uses among the network nodes to transmit data. The congestion of a given node is a functional of the throughputs of all ON connections going through it, and causes losses to these connections. Any ON connection reacts to its losses by self-adapting its throughput in TCP-like fashion so as to control network congestion. The connections interact through this feedback loop. The system constituted of their states (either OFF, or ON with some throughput) evolves in Markovian fashion, and since the number of connections in each class is potentially huge, a mean-field limit result with an adequate scaling is proved so as to reduce dimensionality. The limit is a nonlinear Markov process given by a McKean-Vlasov equation, of dimension the number of classes. It is then proved that the stationary distributions of the limit can be expressed in terms of the solutions of a finite-dimensional fixed-point equation.", "paper_title": "Self-adaptive congestion control for multiclass intermittent connections in a communication network", "paper_id": "WOS:000298880500004"}