{"auto_keywords": [{"score": 0.025882264464755035, "phrase": "pda"}, {"score": 0.025551752295739076, "phrase": "learning_tool"}, {"score": 0.00481495049065317, "phrase": "students'_attitudes"}, {"score": 0.004710854091689325, "phrase": "nursing_clinicals"}, {"score": 0.004568871736067739, "phrase": "president's_office"}, {"score": 0.004431149592844886, "phrase": "nursing_faculty"}, {"score": 0.0041136473765874815, "phrase": "student's_attitudes"}, {"score": 0.00397217701571219, "phrase": "clinical_setting"}, {"score": 0.0035761913760242697, "phrase": "spring_semesters"}, {"score": 0.002962543869356265, "phrase": "university_library"}, {"score": 0.0029110999689379497, "phrase": "public_point"}, {"score": 0.002835599469639296, "phrase": "technical_support"}, {"score": 0.0026552818091968543, "phrase": "quantitative_and_qualitative_data"}, {"score": 0.002464709648714996, "phrase": "students_attitudes"}, {"score": 0.0023180581939456686, "phrase": "student's_perceptions"}, {"score": 0.0021049977753042253, "phrase": "possible_reasons"}], "paper_keywords": ["diffusion of innovation", " nursing education", " PDA", " student attitudes"], "paper_abstract": "Funding from the University of Massachusetts president's office allowed two campuses of the University of Massachusetts system to offer nursing faculty and students PDAs containing medical/nursing databases for use during their clinical rotations. A study was designed to explore student's attitudes toward the use of PDAs in a clinical setting and to determine if the manner in which the technology was introduced affected the formation of these attitudes. During the fall and spring semesters of 2005 to 2006, both sites used and evaluated the effectiveness of PDAs at the point of care, but the clinical course, faculty experience with PDAs, and method and stage of introduction varied on each campus. The University library acted as the public point of access for borrowing and technical support of the PDAs. All students were asked to complete a 21-question survey that collected quantitative and qualitative data about their attitudes toward the use of PDAs at their clinical agency. Results of questionnaires relating to students attitudes to the PDA as a learning tool showed that there were differences in the student's perceptions and acceptance of the PDA as a learning tool. The results from the analysis of the data and suggestions for the possible reasons for the differences are explored.", "paper_title": "Evaluating students' attitudes to using PDAs in nursing clinicals at two schools", "paper_id": "WOS:000248099800006"}