{"auto_keywords": [{"score": 0.04933401710855323, "phrase": "system_dynamics_model"}, {"score": 0.04553747366998989, "phrase": "classification_system"}, {"score": 0.015719716506582538, "phrase": "agent-based_model"}, {"score": 0.012132095370432134, "phrase": "learning_outcomes"}, {"score": 0.004180809918117248, "phrase": "agent-based_models"}, {"score": 0.004030449969901066, "phrase": "school-aged_students"}, {"score": 0.002750056254309311, "phrase": "actual_model"}, {"score": 0.0026096659285441384, "phrase": "original_study"}, {"score": 0.0025025186963415, "phrase": "training_teachers"}, {"score": 0.002387214876538434, "phrase": "initial_findings"}, {"score": 0.002301211274459965, "phrase": "prior_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Improving classroom teaching", " Secondary education", " Simulations", " Teaching/learning strategies"], "paper_abstract": "A classification system that was developed for the use of agent-based models was applied to strategies used by school-aged students to interrogate an agent-based model and a system dynamics model. These were compared, and relationships between learning outcomes and the strategies used were also analysed. It was found that the classification system could also be applied to the use of the system dynamics model, with the addition of criterion. This means that a classification system exists for both styles of models. The fact that the strategies could be identified, despite differences in the actual model, and the model type. compared to the original study, means that there are implications for training teachers or systems to also identify the strategies. Initial findings of this study identified links between prior knowledge and the strategy chosen, as well as links with learning outcomes. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Patterns of use of an agent-based model and a system dynamics model: The application of patterns of use and the impacts on learning outcomes", "paper_id": "WOS:000273145400009"}