{"auto_keywords": [{"score": 0.030206368109659466, "phrase": "serendipitous_routes"}, {"score": 0.015719716506582538, "phrase": "predictive_task_completion"}, {"score": 0.010435409021063343, "phrase": "proposed_approach"}, {"score": 0.009485926826587703, "phrase": "best_path"}, {"score": 0.004726970265271088, "phrase": "great_deal"}, {"score": 0.004623503587186056, "phrase": "daily_tasks"}, {"score": 0.004456044928556639, "phrase": "personalized_path_planning"}, {"score": 0.004423284899590467, "phrase": "task_management"}, {"score": 0.0036914757355166966, "phrase": "driver's_regular_commute"}, {"score": 0.003623949225126944, "phrase": "regular_paths"}, {"score": 0.0034540850937966336, "phrase": "extra_planning"}, {"score": 0.003316567137142017, "phrase": "serendipity-empowered_path_recommendation"}, {"score": 0.003243871564587106, "phrase": "drivers'_regular_routes"}, {"score": 0.0031146967095233586, "phrase": "diverse_or_serendipitous_paths"}, {"score": 0.0029796206196589115, "phrase": "corresponding_point"}, {"score": 0.0025796799784169196, "phrase": "regular_routes"}, {"score": 0.0024768883044869023, "phrase": "simulation_prototype"}, {"score": 0.0021363670305843403, "phrase": "preferred_ranking_strategy"}, {"score": 0.0021049977753042253, "phrase": "best_route"}], "paper_keywords": ["Task management", " path planning", " personalized route"], "paper_abstract": "People spend a great deal of time driving and performing daily tasks. Although a number of studies have focused on personalized path planning and task management, people tend to miss out on the opportunities to complete some tasks that could be accomplished on their regular drive. We are interested in supporting serendipity: completing other necessary tasks on the way to a destination. As there are a number of places to complete tasks around a driver's regular commute, combining tasks and regular paths gives people opportunities to find places where they can complete tasks without extra planning and time. For this purpose, we propose a serendipity-empowered path recommendation that combines daily tasks with drivers' regular routes for predictive task completion. The proposed approach first generates a number of diverse or serendipitous paths by iteratively extending routes to consider the given tasks of drivers and corresponding point of interests. It then selects the best path by ranking the serendipitous routes with their properties. Using the best path, users are then able to perform their daily tasks on the way to their originally planned destination. We evaluated the proposed approach by modeling regular routes and tasks from 12 local drivers, and simulating serendipitous routes with a simulation prototype. We found that using serendipitous routes reduced the number of trips and time required for completing the tasks. We also found that the drivers tended to do their tasks when they moved from their office to their home and had no preferred ranking strategy for selecting the best route.", "paper_title": "Serendipity-empowered path planning for predictive task completion", "paper_id": "WOS:000361063200003"}