{"auto_keywords": [{"score": 0.04603418765396699, "phrase": "fir"}, {"score": 0.00481495049065317, "phrase": "designing_fir_filters_utilizing_frequency-response_masking_technique"}, {"score": 0.004623224002010226, "phrase": "new_joint_optimization_method"}, {"score": 0.0044692705329574, "phrase": "sharp_linear-phase_finite-impulse_response"}, {"score": 0.0036968421974412522, "phrase": "variable_learning_rate_mode"}, {"score": 0.0033393377529146893, "phrase": "first_step"}, {"score": 0.003272083495778595, "phrase": "initial_frm_filter"}, {"score": 0.003036832649117453, "phrase": "second_step"}, {"score": 0.0028569549040495163, "phrase": "start-up_solution"}, {"score": 0.0021776870246727233, "phrase": "proposed_algorithm"}, {"score": 0.0021337783230121286, "phrase": "better_frm_filters"}], "paper_keywords": ["frequency-response masking", " FIR digital filter", " neural network", " optimal design"], "paper_abstract": "This paper presents a new joint optimization method for the design of sharp linear-phase finite-impulse response (FIR) digital filters which are synthesized by using basic and multistage frequency-response-masking (FRM) techniques. The method is based on a batch back-propagation neural network algorithm with a variable learning rate mode. We propose the following two-step optimization technique in order to reduce the complexity. At the first step, an initial FRM filter is designed by alternately optimizing the subfilters. At the second step, this solution is then used as a start-up solution to further optimization. The further optimization problem is highly nonlinear with respect to the coefficients of all the subfilters. Therefore, it is decomposed into several linear neural network optimization problems. Some examples from the literature are given, and the results show that the proposed algorithm can design better FRM filters than several existing methods.", "paper_title": "Neural Network Algorithm for Designing FIR Filters Utilizing Frequency-Response Masking Technique", "paper_id": "WOS:000266386500005"}