{"auto_keywords": [{"score": 0.04874330526858656, "phrase": "web_applications"}, {"score": 0.003882970272082245, "phrase": "light_weight_visualization_library"}, {"score": 0.003817601762355821, "phrase": "javascript"}, {"score": 0.003648411055689428, "phrase": "rich_api"}, {"score": 0.0035666632046674153, "phrase": "rapid_visualization"}, {"score": 0.003526476304712492, "phrase": "complex_genomic_data"}, {"score": 0.003467040410632942, "phrase": "convenient_standards"}, {"score": 0.003427978253685771, "phrase": "json"}, {"score": 0.0027325449069867222, "phrase": "resulting_genome_visualization"}, {"score": 0.0027017445127206596, "phrase": "png"}, {"score": 0.0026712661074432317, "phrase": "svg"}, {"score": 0.0026262033625248445, "phrase": "easy_inclusion"}, {"score": 0.002318127769195112, "phrase": "genomic_islands"}, {"score": 0.002129020447793464, "phrase": "dynamic_visualization"}, {"score": 0.0021049977753042253, "phrase": "genomic_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: A simple static image of genomes and associated metadata is very limiting, as researchers expect rich, interactive tools similar to the web applications found in the post-Web 2.0 world. GenomeD3Plot is a light weight visualization library written in javascript using the D3 library. GenomeD3Plot provides a rich API to allow the rapid visualization of complex genomic data using a convenient standards based JSON configuration file. When integrated into existing web services GenomeD3Plot allows researchers to interact with data, dynamically alter the view, or even resize or reposition the visualization in their browser window. In addition GenomeD3Plot has built in functionality to export any resulting genome visualization in PNG or SVG format for easy inclusion in manuscripts or presentations. Results: GenomeD3Plot is being utilized in the recently released Islandviewer 3 (www.pathogenomics.sfu.ca/islandviewer/) to visualize predicted genomic islands with other genome annotation data. However, its features enable it to be more widely applicable for dynamic visualization of genomic data in general.", "paper_title": "GenomeD3Plot: a library for rich, interactive visualizations of genomic data in web applications", "paper_id": "WOS:000362846600016"}