{"auto_keywords": [{"score": 0.04812854551814997, "phrase": "software_tools"}, {"score": 0.03902168420537032, "phrase": "social_solutions"}, {"score": 0.029719969306879885, "phrase": "software_users"}, {"score": 0.00481495049065317, "phrase": "users_discover_new_tools"}, {"score": 0.004547438494330851, "phrase": "browser_tab_controls"}, {"score": 0.004500414250942443, "phrase": "spell_checkers"}, {"score": 0.0031762308449055305, "phrase": "interview_study"}, {"score": 0.002968424524565369, "phrase": "tool_discovery"}, {"score": 0.0028325548627901004, "phrase": "wider_group"}, {"score": 0.0027169974137406148, "phrase": "diary_study"}, {"score": 0.002592606058287124, "phrase": "social_learning"}, {"score": 0.0021049977753042253, "phrase": "software_users'_ability"}], "paper_keywords": ["Discovery", " Learning", " Programmers", " Programming tools"], "paper_abstract": "Software users rely on software tools such as browser tab controls and spell checkers to work effectively and efficiently, but it is difficult for users to be aware of all the tools that might be useful to them. While there are several potential technical solutions to this difficulty, we know little about social solutions, such as one user telling a peer about a tool. To explore these social solutions, we conducted two studies, an interview study and a diary study. The interview study describes a series of interviews with 18 programmers in industry to explore how tool discovery takes place. To broaden our findings to a wider group of software users, we then conducted a diary study of 76 software users in their workplaces. One finding was that social learning of software tools, while sometimes effective, is infrequent; software users appear to discover tools from peers only once every few months. We describe several implications of our findings, such as that discovery from peers can be enhanced by improving software users' ability to communicate openly and concisely about tools.", "paper_title": "How Do Users Discover New Tools in Software Development and Beyond?", "paper_id": "WOS:000367199400001"}