{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "unknown_attribute_weights"}, {"score": 0.013359159664429597, "phrase": "decision_maker"}, {"score": 0.013179014602696423, "phrase": "attribute_weights"}, {"score": 0.012313632153855624, "phrase": "robust_solution"}, {"score": 0.00840979948838333, "phrase": "proposed_approach"}, {"score": 0.00474946741204285, "phrase": "multiple_attribute_decision"}, {"score": 0.004642292792558686, "phrase": "different_attribute_weights"}, {"score": 0.004579147045265106, "phrase": "different_solutions"}, {"score": 0.004237138632255772, "phrase": "sufficient_data"}, {"score": 0.003545625043276134, "phrase": "robust_evidential_reasoning"}, {"score": 0.003265591844292821, "phrase": "er_context"}, {"score": 0.0028995712226514746, "phrase": "identified_alternative"}, {"score": 0.0023386327847292805, "phrase": "car_performance_assessment"}, {"score": 0.0021834945657804193, "phrase": "madm_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple attribute decision making", " Evidential reasoning approach", " Robust decision", " Unknown attribute weights", " Incompatibility among alternatives"], "paper_abstract": "In multiple attribute decision making (MADM), different attribute weights may generate different solutions, which means that attribute weights significantly influence solutions. When there is a lack of sufficient data, knowledge, and experience for a decision maker to generate attribute weights, the decision maker may expect to find the most satisfactory solution based on unknown attribute weights called a robust solution in this study. To generate such a solution, this paper proposes a robust evidential reasoning (ER) approach to compare alternatives by measuring their robustness with respect to attribute weights in the ER context. Alternatives that can become the best with the support of one or more sets of attribute weights are firstly identified. The measurement of robustness of each identified alternative from two perspectives, i.e., the optimal situation of the alternative and the insensitivity of the alternative to a variation in attribute weights is then presented. The procedure of the proposed approach is described based on the combination of such identification of alternatives and the measurement of their robustness. A problem of car performance assessment is investigated to show that the proposed approach can effectively produce a robust solution to a MADM problem with unknown attribute weights. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Robust evidential reasoning approach with unknown attribute weights", "paper_id": "WOS:000333946400002"}