{"auto_keywords": [{"score": 0.046406428866983235, "phrase": "markov"}, {"score": 0.00481495049065317, "phrase": "interactive_pomdps"}, {"score": 0.004688823162073856, "phrase": "new_graphical_representations"}, {"score": 0.004611669085594069, "phrase": "sequential_decision"}, {"score": 0.004565984572487962, "phrase": "partially_observable_multiagent_environments"}, {"score": 0.00430118556814906, "phrase": "graphical_models"}, {"score": 0.004272724011826495, "phrase": "interactive_influence_diagrams"}, {"score": 0.0041469500929423595, "phrase": "interactive_dynamic_influence_diagrams"}, {"score": 0.003906357144047631, "phrase": "real-world_problems"}, {"score": 0.003803939387792038, "phrase": "decision_variables"}, {"score": 0.0035594478687904743, "phrase": "graphical_representations"}, {"score": 0.003500812175550438, "phrase": "multiagent_settings"}, {"score": 0.002820675782452964, "phrase": "standard_algorithms"}, {"score": 0.0026656724016739905, "phrase": "possible_models"}, {"score": 0.002535975801308953, "phrase": "time_steps"}, {"score": 0.002126111716875144, "phrase": "approximation_technique"}], "paper_keywords": ["Probabilistic graphical models", " Interactive POMDPs", " Sequential multiagent decision making"], "paper_abstract": "We develop new graphical representations for the problem of sequential decision making in partially observable multiagent environments, as formalized by interactive partially observable Markov decision processes (I-POMDPs). The graphical models called interactive influence diagrams (I-IDs) and their dynamic counterparts, interactive dynamic influence diagrams (I-DIDs), seek to explicitly model the structure that is often present in real-world problems by decomposing the situation into chance and decision variables, and the dependencies between the variables. I-DIDs generalize DIDs, which may be viewed as graphical representations of POMDPs, to multiagent settings in the same way that I-POMDPs generalize POMDPs. I-DIDs may be used to compute the policy of an agent given its belief as the agent acts and observes in a setting that is populated by other interacting agents. Using several examples, we show how I-IDs and I-DIDs may be applied and demonstrate their usefulness. We also show how the models may be solved using the standard algorithms that are applicable to DIDs. Solving I-DIDs exactly involves knowing the solutions of possible models of the other agents. The space of models grows exponentially with the number of time steps. We present a method of solving I-DIDs approximately by limiting the number of other agents' candidate models at each time step to a constant. We do this by clustering models that are likely to be behaviorally equivalent and selecting a representative set from the clusters. We discuss the error bound of the approximation technique and demonstrate its empirical performance.", "paper_title": "Graphical models for interactive POMDPs: representations and solutions", "paper_id": "WOS:000263159400003"}