{"auto_keywords": [{"score": 0.03771465750530587, "phrase": "product_quality"}, {"score": 0.00481495049065317, "phrase": "dynamic_quality_prediction"}, {"score": 0.004709567162738894, "phrase": "plastic_injection_molding_process"}, {"score": 0.004505638402009237, "phrase": "innovative_neural_network-based_quality_prediction_system"}, {"score": 0.004216112320418982, "phrase": "self-organizing_map"}, {"score": 0.003378385493203297, "phrase": "proposed_system"}, {"score": 0.0032558762499901727, "phrase": "taguchi's_parameter_design_method_wits"}, {"score": 0.0031146967095233586, "phrase": "neural_network_performance"}, {"score": 0.002706659627293686, "phrase": "training_and_testing_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["neural network-based prediction systems", " injection molding process", " self-organizing map", " back-propagation neural networks", " dynamic quality predictor", " Taguchi's parameter design method"], "paper_abstract": "This paper presents an innovative neural network-based quality prediction system for a plastic injection molding process. A self-organizing map plus a back-propagation neural network (SOM-BPNN) model is proposed for creating a dynamic quality predictor. Three SOM-based dynamic extraction parameters with Six manufacturing process parameters and one level of product quality were dedicated to training and testing the proposed system. In addition, Taguchi's parameter design method wits also applied to enhance the neural network performance. For comparison, an additional back-propagation neural network (BPNN) model was constructed for which six process parameters were used for training and testing. The training and testing data for the two models respectively consisted of 120 and 40 samples. Experimental results showed that such a SOM-BPNN-based model can accurately predict the product quality (weight) and can likely be used for various practical applications. (D) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A neural network-based approach for dynamic quality prediction in a plastic injection molding process", "paper_id": "WOS:000257993700028"}