{"auto_keywords": [{"score": 0.03519040000566708, "phrase": "heterogeneous_snss"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_social_networks"}, {"score": 0.0047409388179452255, "phrase": "unprecedented_growth"}, {"score": 0.004644014990871423, "phrase": "social_network_sites"}, {"score": 0.004342430078306461, "phrase": "large_amount"}, {"score": 0.004297795905522757, "phrase": "social_and_behavioral_data"}, {"score": 0.004123781267600542, "phrase": "research_innovations"}, {"score": 0.003680587852807675, "phrase": "social_relationship_data"}, {"score": 0.0034771228725942846, "phrase": "peer-to-peer_architecture"}, {"score": 0.0031193467254174148, "phrase": "sns"}, {"score": 0.0029164434911787187, "phrase": "global_relationship_model"}, {"score": 0.0028127163745564777, "phrase": "relationship_strength"}, {"score": 0.0027126684113045756, "phrase": "searching_mechanism"}, {"score": 0.00257586859792573, "phrase": "optimal_social_path"}, {"score": 0.0022168460543913787, "phrase": "integrated_content-sharing"}], "paper_keywords": [""], "paper_abstract": "The unprecedented growth and influence of Social Network Sites (SNSs) have opened the opportunity for researchers to explore a large amount of social and behavioral data. The heterogeneity of SNSs further sparks research innovations to develop methods and applications that integrate resources and offer more seamless services across SNSs. Specifically, aiming at the integration of social relationship data, a much less studied subject, we propose a peer-to-peer architecture, namely P2P-iSN, to integrate the heterogeneous SNSs. The P2P-iSN allows users from heterogeneous SNSs to communicate without involving the SNS they have registered with. Under this architecture, we propose a Global Relationship Model (GRM) to capture the relationship strength between users and then develop a searching mechanism, namely i-Search, to find the optimal social path between any two users who are meaningfully connected in heterogeneous SNSs. We evaluate the performance of P2P-iSN and show that our P2P-iSN can effectively support many future applications such as improved trust/reputation metrics and integrated content-sharing. With the proposed P2P-iSN, SNS developers can design more effective user-centric SNS applications.", "paper_title": "P2P-iSN: A Peer-to-Peer Architecture for Heterogeneous Social Networks", "paper_id": "WOS:000330950800009"}