{"auto_keywords": [{"score": 0.03655825658316862, "phrase": "worst-case_cvar"}, {"score": 0.026866475527234385, "phrase": "scaling_parameters"}, {"score": 0.00481495049065317, "phrase": "robust_joint_chance_constraints"}, {"score": 0.004763565662615503, "phrase": "second-order_moment_information"}, {"score": 0.004662427600500598, "phrase": "tractable_semidefinite_programming_based_approximations"}, {"score": 0.004612662942073808, "phrase": "distributionally_robust_individual_and_joint_chance_constraints"}, {"score": 0.004324985524216987, "phrase": "uncertain_parameters"}, {"score": 0.004143196873246147, "phrase": "robust_chance_constraints"}, {"score": 0.003781772207256374, "phrase": "robust_individual_chance_constraints"}, {"score": 0.003603327452846714, "phrase": "quadratic_constraint_functions"}, {"score": 0.003306559295382181, "phrase": "constraint_functions"}, {"score": 0.0031845067058084583, "phrase": "worst-case_cvar_approximation"}, {"score": 0.003034158379493625, "phrase": "intuitive_dual_interpretations"}, {"score": 0.002969628818856786, "phrase": "tighter_than_two_popular_benchmark_approximations"}, {"score": 0.002695768552609587, "phrase": "sequential_convex_optimization_algorithm"}, {"score": 0.0021857667493036786, "phrase": "dynamic_water_reservoir_control_problem"}], "paper_keywords": [""], "paper_abstract": "We develop tractable semidefinite programming based approximations for distributionally robust individual and joint chance constraints, assuming that only the first- and second-order moments as well as the support of the uncertain parameters are given. It is known that robust chance constraints can be conservatively approximated by Worst-Case Conditional Value-at-Risk (CVaR) constraints. We first prove that this approximation is exact for robust individual chance constraints with concave or (not necessarily concave) quadratic constraint functions, and we demonstrate that the Worst-Case CVaR can be computed efficiently for these classes of constraint functions. Next, we study the Worst-Case CVaR approximation for joint chance constraints. This approximation affords intuitive dual interpretations and is provably tighter than two popular benchmark approximations. The tightness depends on a set of scaling parameters, which can be tuned via a sequential convex optimization algorithm. We show that the approximation becomes essentially exact when the scaling parameters are chosen optimally and that the Worst-Case CVaR can be evaluated efficiently if the scaling parameters are kept constant. We evaluate our joint chance constraint approximation in the context of a dynamic water reservoir control problem and numerically demonstrate its superiority over the two benchmark approximations.", "paper_title": "Distributionally robust joint chance constraints with second-order moment information", "paper_id": "WOS:000313797100008"}