{"auto_keywords": [{"score": 0.040047668742416005, "phrase": "serp"}, {"score": 0.03321098235083829, "phrase": "trustworthy_pages"}, {"score": 0.03250936263061295, "phrase": "search_results"}, {"score": 0.02715582486338949, "phrase": "grid_interface"}, {"score": 0.00481495049065317, "phrase": "search_result_position"}, {"score": 0.004648609688625397, "phrase": "web_search_results"}, {"score": 0.004448705308279165, "phrase": "previous_research"}, {"score": 0.00439041997682389, "phrase": "web_users"}, {"score": 0.00431388720289049, "phrase": "great_extent"}, {"score": 0.004183137595671171, "phrase": "search_engine"}, {"score": 0.003968112038249246, "phrase": "information_sources"}, {"score": 0.003847802030433298, "phrase": "search_engine_results_page"}, {"score": 0.003747575730190958, "phrase": "rather_low_trustworthiness"}, {"score": 0.003633927813203731, "phrase": "biased_or_incomplete_view"}, {"score": 0.00352371416065881, "phrase": "controversial_issues"}, {"score": 0.003255364511414329, "phrase": "unfamiliar_and_controversial_medical_issue"}, {"score": 0.002941913249957503, "phrase": "google-like_serp"}, {"score": 0.002258745901862197, "phrase": "bottom_row"}], "paper_keywords": [""], "paper_abstract": "Previous research indicates that web users rely to a great extent on the ranking provided by the search engine and predominantly access the first few web pages presented. In case that the information sources presented in the top of the search engine results page (SERP) are of rather low trustworthiness, this might lead to a biased or incomplete view of the topicespecially when dealing with controversial issues. Study 1, thus, systematically investigated whether participants who were asked to search for an unfamiliar and controversial medical issue accessed fewer trustworthy information sources and consequently included less information from trustworthy pages in their argumentation when the search results were ranked from least to most trustworthy on a Google-like SERP than when they were ranked from most to least trustworthy. Results from Study 1 confirmed these assumptions. Furthermore, Study 2 showed that when the same materials were presented in a grid interface, the impact of the position of the search results on their selection was substantially reduced. Irrespective of whether the most trustworthy search results were presented in the top or the bottom row of the grid interface, users predominantly selected the most trustworthy search results from the SERP and included the same amount of information from trustworthy pages in their argumentation.", "paper_title": "The Role of Search Result Position and Source Trustworthiness in the Selection of Web Search Results When Using a List or a Grid Interface", "paper_id": "WOS:000330756700001"}