{"auto_keywords": [{"score": 0.043528350819261416, "phrase": "concurrency_property"}, {"score": 0.007740489563401459, "phrase": "runtime_detection"}, {"score": 0.004571269461883144, "phrase": "contextual_properties"}, {"score": 0.004464602028530629, "phrase": "primary_approaches"}, {"score": 0.004360412703519539, "phrase": "pervasive_computing_scenarios"}, {"score": 0.0040049806975968145, "phrase": "contextual_activities"}, {"score": 0.003930000775297499, "phrase": "great_importance"}, {"score": 0.0036958398682001015, "phrase": "context-aware_applications"}, {"score": 0.0034428776029411974, "phrase": "existing_schemes"}, {"score": 0.0033624514778823763, "phrase": "collecting_devices"}, {"score": 0.002987557906013826, "phrase": "pervasive_computing_environments"}, {"score": 0.002890266318361907, "phrase": "asynchronous_coordination"}, {"score": 0.0028630535573013686, "phrase": "heterogeneous_computing_entities"}, {"score": 0.0026293540353514075, "phrase": "logical_time"}, {"score": 0.0026045914281028473, "phrase": "model_behavior"}, {"score": 0.0025678829712650437, "phrase": "asynchronous_pervasive_computing_environment"}, {"score": 0.002196609505859369, "phrase": "experimental_evaluation"}, {"score": 0.0021656387522495085, "phrase": "cada"}, {"score": 0.0021049977753042253, "phrase": "asynchronous_pervasive_computing_scenarios"}], "paper_keywords": ["Concurrency property", " context-awareness", " asynchronous environment"], "paper_abstract": "Runtime detection of contextual properties is one of the primary approaches to enabling context-awareness in pervasive computing scenarios. Among various properties the applications may specify, the concurrency property, i.e., property delineating concurrency among contextual activities, is of great importance. It is because the concurrency property is one of the most frequently specified properties by context-aware applications. Moreover, the concurrency property serves as the basis for specification of many other properties. Existing schemes implicitly assume that context collecting devices share the same notion of time. Thus, the concurrency property can be easily detected. However, this assumption does not necessarily hold in pervasive computing environments, which are characterized by the asynchronous coordination among heterogeneous computing entities. To cope with this challenge, we identify and address three essential issues. First, we introduce logical time to model behavior of the asynchronous pervasive computing environment. Second, we propose the logic for specification of the concurrency property. Third, we propose the Concurrent contextual Activity Detection in Asynchronous environments (CADA) algorithm, which achieves runtime detection of the concurrency property. Performance analysis and experimental evaluation show that CADA effectively detects the concurrency property in asynchronous pervasive computing scenarios.", "paper_title": "Runtime Detection of the Concurrency Property in Asynchronous Pervasive Computing Environments", "paper_id": "WOS:000300981100019"}