{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "process_simulation"}, {"score": 0.04934553301452924, "phrase": "offshore_plants"}, {"score": 0.004596960835906736, "phrase": "multibody_system_dynamics"}, {"score": 0.004544016163767266, "phrase": "conventional_mechanical_systems"}, {"score": 0.004190019394361629, "phrase": "shipbuilding_domains"}, {"score": 0.004094018760244776, "phrase": "specific_items"}, {"score": 0.004015693806064219, "phrase": "naval_architecture"}, {"score": 0.00398478333092707, "phrase": "ocean_engineering"}, {"score": 0.0038485929962942776, "phrase": "mooring_forces"}, {"score": 0.0036884198249734863, "phrase": "multibody_system_dynamics_simulator"}, {"score": 0.0035899674590142653, "phrase": "offshore_structures"}, {"score": 0.0034941337957136013, "phrase": "six_kernels"}, {"score": 0.002728059572916527, "phrase": "geometric_properties"}, {"score": 0.002410363090950055, "phrase": "specific_commercial_cad_system"}, {"score": 0.0021049977753042253, "phrase": "offshore_industries"}], "paper_keywords": ["Multibody system dynamics", " Modeling and simulation", " Ship", " Offshore plant", " Scenario management", " Lifting", " Transporting"], "paper_abstract": "Since various existing simulation tools based on multibody system dynamics focus on conventional mechanical systems, such as machinery, cars, and spacecraft, there are some problems with the application of such simulation tools to shipbuilding domains due to the absence of specific items in the field of naval architecture and ocean engineering, such as hydrostatics, hydrodynamics, and mooring forces. Thus, in this study, we developed a multibody system dynamics simulator for the process simulation of ships and offshore structures. We based the simulator on six kernels: the multibody system dynamics kernel, the force calculation kernel, the numerical analysis kernel, the hybrid simulation kernel, the scenario management kernel, and the collision detection kernel. Based on these kernels, we implemented a simulator that had the following Graphic User Interfaces (GUIs): the modeling, visualization, and report GUIs. In addition, the geometric properties of blocks and facilities in shipyards are needed to configure the simulation for the production of ships and offshore plants, so these are managed in a database and connected to a specific commercial CAD system in shipyards. We used the simulator we developed in various cases of the process simulation of ships and offshore plants. The results show that the simulator is useful for various simulations of operations in shipyards and offshore industries. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Multibody system dynamics simulator for process simulation of ships and offshore plants in shipyards", "paper_id": "WOS:000353734100002"}