{"auto_keywords": [{"score": 0.037253245357488904, "phrase": "intentional_rerouting"}, {"score": 0.012224631511606465, "phrase": "existing_lightpaths"}, {"score": 0.01063334282779827, "phrase": "hybrid_rerouting_scheme"}, {"score": 0.010407431965552494, "phrase": "passive_rerouting"}, {"score": 0.009448221799573697, "phrase": "wavelength_conversion"}, {"score": 0.00481495049065317, "phrase": "wavelength-routed_wdm_networks"}, {"score": 0.004686688155058031, "phrase": "viable_and_cost-effective_approach"}, {"score": 0.00427550604912774, "phrase": "optical_wdm_networks"}, {"score": 0.003675120438902734, "phrase": "new_lightpath_requests"}, {"score": 0.003370565320453525, "phrase": "better_load_balancing"}, {"score": 0.0030911702059432224, "phrase": "extensive_simulation_studies"}, {"score": 0.002714779217561487, "phrase": "hybrid_rerouting"}, {"score": 0.002410058288617039, "phrase": "naive-wavelength-retuning_algorithm"}, {"score": 0.0021049977753042253, "phrase": "blocking_performance"}], "paper_keywords": [""], "paper_abstract": "Rerouting is a viable and cost-effective approach to decrease the blocking probability in legacy circuit- switched networks. We study lightpath rerouting in optical WDM networks in this paper. First, we investigate two different lightpath-rerouting strategies, namely, passive rerouting and intentional rerouting. Passive rerouting means the rerouting of existing lightpaths to accommodate new lightpath requests that will otherwise be blocked. Intentional rerouting is intentionally rerouting existing lightpaths during their life period to achieve better load balancing. Second, we investigate the hybrid rerouting scheme, which combines passive rerouting and intentional rerouting. Through extensive simulation studies, we draw the following conclusions: (1) when there is wavelength conversion, passive rerouting works much better than intentional rerouting, and hybrid rerouting can only improve the performance over passive rerouting slightly, and (2) when there is no wavelength conversion, a naive-wavelength-retuning algorithm can achieve the most benefit of passive rerouting, whereas path adjusting does not help any further; however, the hybrid rerouting scheme can improve the blocking performance significantly. (C) 2008 Optical Society of America.", "paper_title": "Lightpath rerouting in wavelength-routed WDM networks", "paper_id": "WOS:000258360800002"}