{"auto_keywords": [{"score": 0.027676736000468754, "phrase": "sequence_time"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_studies"}, {"score": 0.004774937143916685, "phrase": "background_fields"}, {"score": 0.004618166136069052, "phrase": "time_series"}, {"score": 0.004108742905942481, "phrase": "reparameterizing_time"}, {"score": 0.0037324526526073404, "phrase": "time_parameterizations"}, {"score": 0.0034332736827447654, "phrase": "temporal_separation"}, {"score": 0.003376369479008885, "phrase": "time_points"}, {"score": 0.0032517484445814334, "phrase": "electronic_health_records"}, {"score": 0.002966084234963723, "phrase": "start-produced_more_stationary_time_series"}, {"score": 0.0027741761880779535, "phrase": "recently_proposed_intermediate_parameterization"}, {"score": 0.002682917193736698, "phrase": "single_gaussian_process_model_experiment"}, {"score": 0.0022886952510350416, "phrase": "electronic_health_record_data"}, {"score": 0.0022041312401435346, "phrase": "laboratory_data"}, {"score": 0.0021049977753042253, "phrase": "important_potential_parameterization"}], "paper_keywords": ["time", " time series", " parameterization", " phenotype", " electronic health record", " data mining"], "paper_abstract": "Background Fields like nonlinear physics offer methods for analyzing time series, but many methods require that the time series be stationary-no change in properties over time. Objective Medicine is far from stationary, but the challenge may be able to be ameliorated by reparameterizing time because clinicians tend to measure patients more frequently when they are ill and are more likely to vary. Methods We compared time parameterizations, measuring variability of rate of change and magnitude of change, and looking for homogeneity of bins of temporal separation between pairs of time points. We studied four common laboratory tests drawn from 25 years of electronic health records on 4 million patients. Results We found that sequence time-that is, simply counting the number of measurements from some start-produced more stationary time series, better explained the variation in values, and had more homogeneous bins than either traditional clock time or a recently proposed intermediate parameterization. Sequence time produced more accurate predictions in a single Gaussian process model experiment. Conclusions Of the three parameterizations, sequence time appeared to produce the most stationary series, possibly because clinicians adjust their sampling to the acuity of the patient. Parameterizing by sequence time may be applicable to association and clustering experiments on electronic health record data. A limitation of this study is that laboratory data were derived from only one institution. Sequence time appears to be an important potential parameterization.", "paper_title": "Parameterizing time in electronic health record studies", "paper_id": "WOS:000361282200007"}