{"auto_keywords": [{"score": 0.04202502634922989, "phrase": "k-anonymity_problem"}, {"score": 0.04139184405138662, "phrase": "information_loss"}, {"score": 0.00481495049065317, "phrase": "approximate_data_anonymisation"}, {"score": 0.004739630859016419, "phrase": "today's_information_society"}, {"score": 0.004665483918844599, "phrase": "individual_privacy"}, {"score": 0.0046361494357125355, "phrase": "organisational_confidentiality"}, {"score": 0.004534917050845832, "phrase": "widely_adopted_model"}, {"score": 0.0042576464476131205, "phrase": "released_dataset"}, {"score": 0.003909923690310641, "phrase": "data_modifications"}, {"score": 0.0038365781437074017, "phrase": "top-down_approach"}, {"score": 0.0035904971126313316, "phrase": "edge_weight"}, {"score": 0.003545439507880801, "phrase": "complete_weighted_graph"}, {"score": 0.0034028574973016933, "phrase": "complete_graph"}, {"score": 0.003224992202194877, "phrase": "resulting_component"}, {"score": 0.003194580334752371, "phrase": "vertex_number"}, {"score": 0.003105049327888471, "phrase": "generalisation_operation"}, {"score": 0.002860212113080887, "phrase": "polynomial_running_time"}, {"score": 0.002780025943393764, "phrase": "empirical_experiments"}, {"score": 0.0027278178983579085, "phrase": "substantial_improvements"}, {"score": 0.002702081704660048, "phrase": "baseline_heuristic_algorithms"}, {"score": 0.0025365874386986493, "phrase": "baseline_bottom-up"}, {"score": 0.0024889396846235, "phrase": "required_k"}, {"score": 0.002434477906829832, "phrase": "adopted_top-down_strategy"}, {"score": 0.0023963060279866446, "phrase": "similar_performance"}, {"score": 0.0022781229833499753, "phrase": "best_choice"}, {"score": 0.0021049977753042253, "phrase": "record_set"}], "paper_keywords": ["privacy protection", " data anonymisation", " k-anonymity", " approximate algorithm"], "paper_abstract": "Data sharing in today's information society poses a threat to individual privacy and organisational confidentiality. k-anonymity is a widely adopted model to prevent the owner of a record being re-identified. By generalising and/or suppressing certain portions of the released dataset, it guarantees that no records can be uniquely distinguished from at least other k-1 records. A key requirement for the k-anonymity problem is to minimise the information loss resulting from data modifications. This article proposes a top-down approach to solve this problem. It first considers each record as a vertex and the similarity between two records as the edge weight to construct a complete weighted graph. Then, an edge cutting algorithm is designed to divide the complete graph into multiple trees/components. The Large Components with size bigger than 2k-1 are subsequently split to guarantee that each resulting component has the vertex number between k and 2k-1. Finally, the generalisation operation is applied on the vertices in each component (i.e. equivalence class) to make sure all the records inside have identical quasi-identifier values. We prove that the proposed approach has polynomial running time and theoretical performance guarantee O(k). The empirical experiments show that our approach results in substantial improvements over the baseline heuristic algorithms, as well as the bottom-up approach with the same approximate bound O(k). Comparing to the baseline bottom-up O(logk)-approximation algorithm, when the required k is smaller than 50, the adopted top-down strategy makes our approach achieve similar performance in terms of information loss while spending much less computing time. It demonstrates that our approach would be a best choice for the k-anonymity problem when both the data utility and runtime need to be considered, especially when k is set to certain value smaller than 50 and the record set is big enough to make the runtime have to be taken into account.", "paper_title": "A top-down approach for approximate data anonymisation", "paper_id": "WOS:000322866000002"}