{"auto_keywords": [{"score": 0.03885992635435779, "phrase": "mobile_forensics_tools"}, {"score": 0.00481495049065317, "phrase": "mobile_internal_acquisition_tool"}, {"score": 0.0047662895631964495, "phrase": "smartphone_market"}, {"score": 0.00471811808206897, "phrase": "great_variety"}, {"score": 0.0044844333655153605, "phrase": "smartphone_contents"}, {"score": 0.004439097815805505, "phrase": "forensically_sound_way"}, {"score": 0.004276736877590646, "phrase": "already_overtaxed_police_operators"}, {"score": 0.004233492114255375, "phrase": "possible_increase"}, {"score": 0.004204904449336037, "phrase": "forensics_productivity"}, {"score": 0.004092463367307375, "phrase": "previous_work"}, {"score": 0.0040373708328770306, "phrase": "mobile_equipment"}, {"score": 0.0038242899532391914, "phrase": "practical_problems"}, {"score": 0.0035494788628319903, "phrase": "hardware_equipment"}, {"score": 0.0035016744233366615, "phrase": "me."}, {"score": 0.003036832649117453, "phrase": "fundamental_properties"}, {"score": 0.0029959082125682918, "phrase": "miat"}, {"score": 0.002642489246353574, "phrase": "operational_methodology"}, {"score": 0.0025370474510475628, "phrase": "worst_case"}, {"score": 0.002338588929719847, "phrase": "open_source_license"}, {"score": 0.0022836785412390544, "phrase": "acquisition_source_code"}, {"score": 0.002252880693912436, "phrase": "public_domain"}, {"score": 0.0021337783230121286, "phrase": "digital_forensic_research_workshop"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Symbian", " Forensic acquisition", " Memory card", " TAC", " API"], "paper_abstract": "The smartphone market provides a great variety of manufacturers and models causing a strong (and mandatory) heterogeneity of the hardware tools adopted to retrieve smartphone contents in a forensically sound way. Thus, in order to lighten the burden for already overtaxed police operators, with possible increase of forensics productivity, we already identified, in a previous work, a new Mobile Equipment (ME) acquisition paradigm. In fact, it's possible to avoid the practical problems related to the USB/mobile phone plug heterogeneity, currently used by the mobile forensics tools, through the use of the MMC/SD slot, part of the hardware equipment of the target ME. This solution overcomes the problems related to the acquisition through the cables, simply relying on a piece of software installed stored into the SD/MMC. The contribution of this paper enriches the methodology already presented by the authors and presents some fundamental properties of the Mobile Internal Acquisition Tool (MIAT) in order to assess the performance with respect to the state of the art of the mobile forensics tools. The results of the assessment encourage the adoption of this tool, since integrity, performances and operational methodology mostly overall benefit from this approach, while, in the worst case, remain at the same level of the state of the art COTS. Finally, this tool, intended to be released under an Open Source license, proposes the paradigm where the acquisition source code is in the public domain, while the analysis and presentation are left to self-made/proprietary tools. (c) 2008 Digital Forensic Research Workshop. Published by Elsevier Ltd. All rights reserved.", "paper_title": "An overall assessment of Mobile Internal Acquisition Tool", "paper_id": "WOS:000260872700017"}