{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "open_platforms"}, {"score": 0.03433617150737088, "phrase": "differential_pricing"}, {"score": 0.011904733961946645, "phrase": "android"}, {"score": 0.005564077326821332, "phrase": "consumer_surplus"}, {"score": 0.0047415081747150065, "phrase": "wireless_services"}, {"score": 0.004705206179790976, "phrase": "application-based_pricing"}, {"score": 0.004597951649247307, "phrase": "wireless_carriers"}, {"score": 0.004441616106463486, "phrase": "text_messages"}, {"score": 0.004357061494162031, "phrase": "wireless_surfing"}, {"score": 0.004176640648520877, "phrase": "handset_manufacturers"}, {"score": 0.0038526069752138196, "phrase": "closed_platforms"}, {"score": 0.0038084090886727523, "phrase": "iphone"}, {"score": 0.0035810720634458933, "phrase": "open_source"}, {"score": 0.0035536228914319354, "phrase": "open_application_programming_interfaces"}, {"score": 0.003178384350932103, "phrase": "neutrality_advocates"}, {"score": 0.002326767693352058, "phrase": "social_surplus"}], "paper_keywords": ["net neutrality", " nonlinear pricing", " open platforms", " quasi-bundling", " wireless services"], "paper_abstract": "Application-based pricing is common in telecommunications. Wireless carriers charge consumers more per byte of traffic for text messages than they do for wireless surfing or voice calls. Such pricing is possible because carriers and handset manufacturers have the ability to tag and meter each application. While tagging and metering are possible in the case of closed platforms such as iPhone, they are not in the case of open platforms such as Android. Android is open source with open application programming interfaces, and anyone can develop applications for it. Because the carriers have little control over applications, Android is inherently disruptive of differential pricing across applications. Users and neutrality advocates support Android, believing that it can increase consumer surplus by disrupting differential pricing. However, we show that the equilibrium under differential pricing is different from the equilibrium under open platforms, and it is particularly so with regard to the sets of consumers served and the quantities consumed. With open platforms, certain consumers are either not served or they are served a quantity that is less than what they would be served under differential pricing. Consequently, the consumer surplus and the social surplus are often lower with open platforms. Similarly, firms are expected to prefer differential pricing. We show that this expectation is also not true under certain circumstances in which open platforms and neutral pricing work like a quasi-bundle.", "paper_title": "The Disruptive Effect of Open Platforms on Markets for Wireless Services", "paper_id": "WOS:000288635100005"}