{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "disruption_tolerant_networks"}, {"score": 0.0047407085958145806, "phrase": "communication_networks"}, {"score": 0.004443436195282021, "phrase": "emerging_applications"}, {"score": 0.004409034264881601, "phrase": "emergency_response"}, {"score": 0.004386247089914253, "phrase": "special_operations"}, {"score": 0.0043635771695352986, "phrase": "smart_environments"}, {"score": 0.004274058118188789, "phrase": "node_heterogeneity"}, {"score": 0.004251965560022735, "phrase": "volatile_links"}, {"score": 0.004197230381955294, "phrase": "wireless_propagation_phenomena"}, {"score": 0.004175533280178052, "phrase": "node_mobility"}, {"score": 0.004111109853964732, "phrase": "typical_conditions"}, {"score": 0.003500702800892571, "phrase": "growing_number"}, {"score": 0.003297994194347844, "phrase": "large_diversity"}, {"score": 0.0032809302753757257, "phrase": "emerging_wireless_applications"}, {"score": 0.003066945490483524, "phrase": "routing_solution"}, {"score": 0.002965229277927781, "phrase": "existing_routing_strategies"}, {"score": 0.002942238084470189, "phrase": "small_number"}, {"score": 0.0029270094525230953, "phrase": "common_and_tunable_routing_modules"}, {"score": 0.002714825266745826, "phrase": "network_characteristics"}, {"score": 0.0026867883090447666, "phrase": "wireless_application"}, {"score": 0.0026179528443002185, "phrase": "intermittently_connected_networks"}, {"score": 0.00257749879848061, "phrase": "generic_network_characteristics"}, {"score": 0.002537668280298673, "phrase": "routing_process"}, {"score": 0.0024155441065367078, "phrase": "wireless_networks"}, {"score": 0.0023232862765530473, "phrase": "useful_design_guidelines"}, {"score": 0.00227552825359633, "phrase": "appropriate_routing_protocol"}, {"score": 0.0021491844713925476, "phrase": "case_studies"}, {"score": 0.0021380517771409763, "phrase": "challenged_wireless_networks"}], "paper_keywords": ["DTN routing", " Intermittent connectivity", " Disruption tolerance", " Message replication", " Network coding", " Routing design guidelines"], "paper_abstract": "Communication networks, whether they are wired or wireless, have traditionally been assumed to be connected at least most of the time. However, emerging applications such as emergency response, special operations, smart environments, VANETs, etc. coupled with node heterogeneity and volatile links (e.g. due to wireless propagation phenomena and node mobility) will likely change the typical conditions under which networks operate. In fact, in such scenarios, networks may be mostly disconnected, i.e., most of the time, end-to-end paths connecting every node pair do not exist. To cope with frequent, long-lived disconnections, opportunistic routing techniques have been proposed in which, at every hop, a node decides whether it should forward or store-and-carry a message. Despite a growing number of such proposals, there still exists little consensus on the most suitable routing algorithm(s) in this context. One of the reasons is the large diversity of emerging wireless applications and networks exhibiting such \"episodic\" connectivity. These networks often have very different characteristics and requirements, making it very difficult, if not impossible, to design a routing solution that fits all. In this paper, we first break up existing routing strategies into a small number of common and tunable routing modules (e.g. message replication, coding, etc.), and then show how and when a given routing module should be used, depending on the set of network characteristics exhibited by the wireless application. We further attempt to create a taxonomy for intermittently connected networks. We try to identify generic network characteristics that are relevant to the routing process (e.g., network density, node heterogeneity, mobility patterns) and dissect different \"challenged\" wireless networks or applications based on these characteristics. Our goal is to identify a set of useful design guidelines that will enable one to choose an appropriate routing protocol for the application or network in hand. Finally, to demonstrate the utility of our approach, we take up some case studies of challenged wireless networks, and validate some of our routing design principles using simulations.", "paper_title": "Routing for disruption tolerant networks: taxonomy and design", "paper_id": "WOS:000283584100017"}