{"auto_keywords": [{"score": 0.05007851897071717, "phrase": "alert_fatigue"}, {"score": 0.03351309712344681, "phrase": "ehr."}, {"score": 0.015600124647324673, "phrase": "electronic_health_records"}, {"score": 0.01047554175768894, "phrase": "medication_knowledge_bases"}, {"score": 0.004741167616693272, "phrase": "objective_alert_fatigue"}, {"score": 0.00468656988857138, "phrase": "common_problem"}, {"score": 0.004579244735256393, "phrase": "clinical_decision_support_systems"}, {"score": 0.004355026964936104, "phrase": "drug-drug_interaction"}, {"score": 0.004190019394361629, "phrase": "override_rates"}, {"score": 0.0040002088320302935, "phrase": "consensus-based_recommendations"}, {"score": 0.003954109842050071, "phrase": "expert_panel"}, {"score": 0.003760385494931853, "phrase": "provider's_workflow"}, {"score": 0.003717045200229234, "phrase": "ehr"}, {"score": 0.003534889186471058, "phrase": "expert_panel_process"}, {"score": 0.003246672441842787, "phrase": "academic_institutions"}, {"score": 0.003005039427642664, "phrase": "results_recommendations"}, {"score": 0.0026143990748127253, "phrase": "discussion_development"}, {"score": 0.0025151815237463844, "phrase": "ddi"}, {"score": 0.002476546030310661, "phrase": "resource-intensive_task"}, {"score": 0.002429090371567499, "phrase": "standardized_list"}, {"score": 0.0023278569001363263, "phrase": "ehr._conclusions_future_efforts"}, {"score": 0.002129584983647679, "phrase": "financial_incentives"}], "paper_keywords": [""], "paper_abstract": "Objective Alert fatigue represents a common problem associated with the use of clinical decision support systems in electronic health records (EHR). This problem is particularly profound with drug-drug interaction (DDI) alerts for which studies have reported override rates of approximately 90%. The objective of this study is to report consensus-based recommendations of an expert panel on DDI that can be safely made non-interruptive to the provider's workflow, in EHR, in an attempt to reduce alert fatigue. Methods We utilized an expert panel process to rate the interactions. Panelists had expertise in medicine, pharmacy, pharmacology and clinical informatics, and represented both academic institutions and vendors of medication knowledge bases and EHR. In addition, representatives from the US Food and Drug Administration and the American Society of Health-System Pharmacy contributed to the discussions. Results Recommendations and considerations of the panel resulted in the creation of a list of 33 class-based low-priority DDI that do not warrant being interruptive alerts in EHR. In one institution, these accounted for 36% of the interactions displayed. Discussion Development and customization of the content of medication knowledge bases that drive DDI alerting represents a resource-intensive task. Creation of a standardized list of low-priority DDI may help reduce alert fatigue across EHR. Conclusions Future efforts might include the development of a consortium to maintain this list over time. Such a list could also be used in conjunction with financial incentives tied to its adoption in EHR.", "paper_title": "Drug-drug interactions that should be non-interruptive in order to reduce alert fatigue in electronic health records", "paper_id": "WOS:000317477500014"}