{"auto_keywords": [{"score": 0.04291971448885598, "phrase": "internet_crowd"}, {"score": 0.03234880593169703, "phrase": "multimedia_content"}, {"score": 0.00481495049065317, "phrase": "multimedia_qoe_evaluation"}, {"score": 0.004556901872357751, "phrase": "potential_strategy"}, {"score": 0.004480307124735185, "phrase": "general_public"}, {"score": 0.004404994123834589, "phrase": "wide_variety"}, {"score": 0.004258128672571261, "phrase": "ubiquitous_internet_access"}, {"score": 0.003813669883040509, "phrase": "considerable_size"}, {"score": 0.0036090884921108086, "phrase": "participant_pool"}, {"score": 0.0035634522350563107, "phrase": "relatively_low_economic_cost"}, {"score": 0.003259702394241964, "phrase": "challenging_problem"}, {"score": 0.0031375577552605533, "phrase": "crowdsourceable_framework"}, {"score": 0.002994449398035894, "phrase": "aforementioned_quality_problem"}, {"score": 0.002931569771634119, "phrase": "paired_comparison_method"}, {"score": 0.0027390682208834013, "phrase": "cheat_detection"}, {"score": 0.0025161141188282717, "phrase": "mos"}, {"score": 0.002311192286067765, "phrase": "proposed_framework"}, {"score": 0.0021319959284827896, "phrase": "reliable_qoe_evaluation"}, {"score": 0.0021049977753042253, "phrase": "lower_cost"}], "paper_keywords": ["Crowdsourcing", " mean opinion score", " paired comparison", " probabilistic choice model", " quality of experience", " subjective test"], "paper_abstract": "Crowdsourcing has emerged in recent years as a potential strategy to enlist the general public to solve a wide variety of tasks. With the advent of ubiquitous Internet access, it is now feasible to ask an Internet crowd to conduct QoE (Quality of Experience) experiments on their personal computers in their own residences rather than in a laboratory. The considerable size of the Internet crowd allows researchers to crowdsource their experiments to a more diverse set of participant pool at a relatively low economic cost. However, as participants carry out experiments without supervision, the uncertainty of the quality of their experiment results is a challenging problem. In this paper, we propose a crowdsourceable framework to quantify the QoE of multimedia content. To overcome the aforementioned quality problem, we employ a paired comparison method in our framework. The advantages of our framework are: 1) trustworthiness due to the support for cheat detection; 2) a simpler rating procedure than that of the commonly-used but more difficult mean opinion score (MOS), which places less burden on participants; 3) economic feasibility since reliable QoE measures can be acquired with less effort compared with MOS; and 4) generalizability across a variety of multimedia content. We demonstrate the effectiveness and efficiency of the proposed framework by a comparison with MOS. Moreover, the results of four case studies support our assertion that the framework can provide reliable QoE evaluation at a lower cost.", "paper_title": "Crowdsourcing Multimedia QoE Evaluation: A Trusted Framework", "paper_id": "WOS:000324763600015"}