{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "response_rate"}, {"score": 0.023076505271954883, "phrase": "text_messaging_data_collection"}, {"score": 0.022047382208203306, "phrase": "multiple_interventions"}, {"score": 0.006725259972882887, "phrase": "response_rates"}, {"score": 0.0044759626695474106, "phrase": "text_messaging"}, {"score": 0.004446349752828045, "phrase": "longitudinal_data_collection"}, {"score": 0.004230382915464492, "phrase": "anemia_program"}, {"score": 0.004202387892988509, "phrase": "rural_china"}, {"score": 0.004160740888748725, "phrase": "text_messages"}, {"score": 0.004092240621596351, "phrase": "anemia_medication_adherence"}, {"score": 0.004024863549087511, "phrase": "delayed_randomized_controlled_trial"}, {"score": 0.003643185395780667, "phrase": "baseline_measurement"}, {"score": 0.002527556628744957, "phrase": "younger_participants"}, {"score": 0.0024693979425773993, "phrase": "lower_hemoglobin_concentration"}, {"score": 0.0021980296285911915, "phrase": "increasing_response_rate"}, {"score": 0.0021618163675390612, "phrase": "china"}, {"score": 0.0021474369836979048, "phrase": "conclusions_larger_multi-site_studies"}], "paper_keywords": ["randomized controlled trial", " program evaluation", " nutrition surveys"], "paper_abstract": "Objective To test the effectiveness of multiple interventions on increasing the response rate of text messaging for longitudinal data collection. Methods Our cohort included 283 caregivers of children aged 6-12 months who were participating in an anemia program in rural China. Using text messages to collect data on anemia medication adherence, we conducted a delayed randomized controlled trial to test multiple interventions (an additional four reminders; a (sic)5.0 (US$0.79) credit reward for replying; and a feedback text message). After a 6-week pilot study with week 7 as the baseline measurement, we randomly allocated all participants into two groups: group 1 (n = 142) and group 2 (n = 141). During weeks 8-11, we introduced the interventions to group 1, and in weeks 12-15 the intervention was introduced to both groups. We compared the response rates between groups and explored factors affecting the response rate. Results During weeks 8-11, the response rates in group 1 increased and were significantly higher than in group 2 (p<0.05). During weeks 12-15, the response rate increased significantly in group 2 (p>0.05) and slightly decreased in group 1. Younger participants or participants who had children with lower hemoglobin concentration were more likely to reply (p = 0.02). Sending four reminders on the second day contributed to only 286 (11.7%) extra text messages. Discussion Our study showed that multiple interventions were effective in increasing response rate of text messaging data collection in rural China. Conclusions Larger multi-site studies are needed to find the most effective way of using these interventions to allow usage of text messaging data collection for health research.", "paper_title": "Increasing the response rate of text messaging data collection: a delayed randomized controlled trial", "paper_id": "WOS:000352771100008"}