{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "kalman_filter"}, {"score": 0.028094723888992177, "phrase": "sleep_apnoea"}, {"score": 0.004781777766309739, "phrase": "cusum."}, {"score": 0.004716113134313215, "phrase": "algorithms_acts"}, {"score": 0.004683618147754759, "phrase": "dynamic_environments"}, {"score": 0.004524455848517757, "phrase": "desirable_property"}, {"score": 0.0043706785731816265, "phrase": "new_data"}, {"score": 0.004325568312096711, "phrase": "actual_decision_model"}, {"score": 0.004022515690178811, "phrase": "stationary_distribution"}, {"score": 0.0038323244983352587, "phrase": "detection_system"}, {"score": 0.0037665925842197967, "phrase": "regression_problems"}, {"score": 0.0035147084172295123, "phrase": "regression_predictor"}, {"score": 0.003325343504284345, "phrase": "regression_model"}, {"score": 0.003290986600659723, "phrase": "significant_increase"}, {"score": 0.0030076664326204013, "phrase": "actual_regression_model"}, {"score": 0.0028554143163813947, "phrase": "dskc"}, {"score": 0.0027108496611853083, "phrase": "physiological"}, {"score": 0.0026004698404274483, "phrase": "common_disorder"}, {"score": 0.0025558124513934584, "phrase": "breathing_cessation"}, {"score": 0.0024945743145462144, "phrase": "reduced_breathing"}, {"score": 0.002271773887265199, "phrase": "experimental_results"}, {"score": 0.0021943920257952174, "phrase": "high_probability"}, {"score": 0.0021049977753042253, "phrase": "false_alarms"}], "paper_keywords": [""], "paper_abstract": "In most challenging applications learning algorithms acts in dynamic environments where the data is collected over time. A desirable property of these algorithms is the ability of incremental incorporating new data in the actual decision model. Several incremental learning algorithms have been proposed. However most of them make the assumption that the examples are drawn from a stationary distribution [13]. The aim of this study is to present a detection system (DSKC) for regression problems. The system is modular and works as a post-processor of a regressor. It is composed by a regression predictor, a Kalman filter and a Cumulative Sum of Recursive Residual (CUSUM) change detector. The system continuously monitors the error of the regression model. A significant increase of the error is interpreted as a change in the distribution that generates the examples over time. When a change is detected, the actual regression model is deleted and a new one is constructed. In this paper we tested DSKC with a set of three artificial experiments, and two real-world datasets: a Physiological dataset and a clinic dataset of Sleep Apnoea. Sleep Apnoea is a common disorder characterized by periods of breathing cessation (apnoea) and periods of reduced breathing (hypopnea) [7]. This is a real-application where the goal is to detect changes in the signals that monitor breathing. The experimental results showed that the system detected changes fast and with high probability. The results also showed that the system is robust to false alarms and can be applied with efficiency to problems where the information is available over time.", "paper_title": "Change detection with Kalman filter and CUSUM", "paper_id": "WOS:000241631200025"}