{"auto_keywords": [{"score": 0.047863895213888945, "phrase": "target_image"}, {"score": 0.015193406423750336, "phrase": "source_image_patch"}, {"score": 0.01474714358142531, "phrase": "structure_conflicts"}, {"score": 0.01297646142571212, "phrase": "source_patch"}, {"score": 0.011762581084171091, "phrase": "over-included_region"}, {"score": 0.00481495049065317, "phrase": "gradient_domain_methods"}, {"score": 0.004712463245074863, "phrase": "seamless_cloning"}, {"score": 0.004268293864953256, "phrase": "general_practices"}, {"score": 0.004035946043145475, "phrase": "users'_intent"}, {"score": 0.0038326698261576023, "phrase": "different_appearances"}, {"score": 0.0031166151196841308, "phrase": "new_algorithm"}, {"score": 0.0027503564589458837, "phrase": "composite_result"}, {"score": 0.002668582249630492, "phrase": "interpolation_measure"}, {"score": 0.002622947550220266, "phrase": "final_image"}, {"score": 0.002566997205079849, "phrase": "poisson_equation"}, {"score": 0.00241658945942583, "phrase": "hierarchical_sampling_techniques"}, {"score": 0.0023145690608400425, "phrase": "high-quality_image_cloning"}, {"score": 0.002197801146305747, "phrase": "interested_objects"}], "paper_keywords": ["Intent representation", " Image cloning", " Image composition"], "paper_abstract": "Currently, gradient domain methods are popular for producing seamless cloning of a source image patch into a target image. However, structure conflicts between the source image patch and the target image may generate artifacts, preventing the general practices. In this paper, we tackle the challenge by incorporating the users' intent in outlining the source patch, where the boundary drawn generally has different appearances from the objects of interest. We first reveal that artifacts exist in the over-included region, the region outside the objects of interest in the source patch. Then we use the diversity from the boundary to approximately distinguish the objects from the over-included region, and design a new algorithm to make the target image adaptively take effects in blending. So the structure conflicts can be efficiently suppressed to remove the artifacts around the objects of interest in the composite result. Moreover, we develop an interpolation measure to composite the final image rather than solving a Poisson equation, and speed up the interpolation by treating pixels in clusters and using hierarchical sampling techniques. Our method is simple to use for instant and high-quality image cloning, in which users only need to outline a region of interested objects to process. Our experimental results have demonstrated the effectiveness of our cloning method.", "paper_title": "Intent-aware image cloning", "paper_id": "WOS:000319478400014"}