{"auto_keywords": [{"score": 0.0414279699174715, "phrase": "modeling_constructs"}, {"score": 0.015719716506582538, "phrase": "conceptual_modeling"}, {"score": 0.009989152047765603, "phrase": "model_variations"}, {"score": 0.004669085371587273, "phrase": "conceptual_models"}, {"score": 0.004567596860086148, "phrase": "formal_representations"}, {"score": 0.004201571673071299, "phrase": "information_systems"}, {"score": 0.004092168350316413, "phrase": "large_body"}, {"score": 0.0038141000450978746, "phrase": "better_vehicles"}, {"score": 0.0036020923276404433, "phrase": "different_people"}, {"score": 0.0035705347414368726, "phrase": "different_models"}, {"score": 0.002802825862847951, "phrase": "exploratory_study"}, {"score": 0.0026585629592360085, "phrase": "variation_types"}, {"score": 0.0025892330566358503, "phrase": "identified_variation_types"}, {"score": 0.0022192891418394514, "phrase": "complete_consistency"}, {"score": 0.0021049977753042253, "phrase": "single_framework"}], "paper_keywords": ["conceptual modeling", " empirical study", " UML", " ontology", " variations"], "paper_abstract": "Conceptual models are aimed at providing formal representations of a domain. They are mainly used for the purpose of understanding and communicating about requirements for information systems. Conceptual modeling has acquired a large body of research dealing with the semantics of modeling constructs, with the goal to make models better vehicles for understanding and communication. However, it is commonly known that different people construct different models of a given domain although all may be similarly adequate. The premise of this paper is that variations in models reflect vagueness in the criteria for deciding how to map reality into modeling constructs. Exploring model variations as such can contribute to research that deals with the semantics of modeling constructs. This paper reports an exploratory study in which empirically obtained model variations were qualitatively analyzed and classified into variation types. In light of the identified variation types, we analyzed two ontology-based modeling frameworks in order to evaluate their potential contribution to a reduction in variations. Our analysis suggests that such frameworks may contribute to more conclusive modeling decision making, thus reducing variations. However, since there is no complete consistency between the two frameworks, in order to reduce variations, a single framework should be systematically applied.", "paper_title": "Variations in conceptual modeling: Classification and ontological analysis", "paper_id": "WOS:000246738800004"}