{"auto_keywords": [{"score": 0.0465844154947404, "phrase": "ccm"}, {"score": 0.0087137243806345, "phrase": "simplicial_polytope"}, {"score": 0.00498998845763624, "phrase": "generalized_euler_line"}, {"score": 0.004386887374401584, "phrase": "affine_combination"}, {"score": 0.003904713104101532, "phrase": "inscribed_polytope"}, {"score": 0.0035989687070420977, "phrase": "completely_integrable_discrete_dynamical_systems"}, {"score": 0.0033952989364738353, "phrase": "discrete_bicycle"}, {"score": 0.003021781956684419, "phrase": "archimedes'_lemma"}, {"score": 0.0026272523687965615, "phrase": "previously_studied_euler_line"}, {"score": 0.0023654615987859402, "phrase": "natural_continuity"}, {"score": 0.0023380300046435187, "phrase": "homogeneity_assumptions"}, {"score": 0.002310919058902187, "phrase": "archimedes"}, {"score": 0.0021049977753042253, "phrase": "spherical_and_hyperbolic_settings"}], "paper_keywords": ["Triangulation", " Center of mass", " Circumcenter", " Archimedes Lemma", " Euler line"], "paper_abstract": "We define and study a variant of the center of mass of a polygon and, more generally, of a simplicial polytope which we call the Circumcenter of Mass (CCM). The CCM is an affine combination of the circumcenters of the simplices in a triangulation of a polytope, weighted by their volumes. For an inscribed polytope, CCM coincides with the circumcenter. Our motivation comes from the study of completely integrable discrete dynamical systems, where the CCM is an invariant of the discrete bicycle (Darboux) transformation and of recuttings of polygons. We show that the CCM satisfies an analog of Archimedes' Lemma, a familiar property of the center of mass. We define and study a generalized Euler line associated to any simplicial polytope, extending the previously studied Euler line associated to the quadrilateral. We show that the generalized Euler line for polygons consists of all centers satisfying natural continuity and homogeneity assumptions and Archimedes' Lemma. Finally, we show that CCM can also be defined in the spherical and hyperbolic settings.", "paper_title": "Circumcenter of Mass and Generalized Euler Line", "paper_id": "WOS:000337141000004"}