{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bilateral_facetectomy"}, {"score": 0.00471071771178029, "phrase": "spinal_stability"}, {"score": 0.00465944657565638, "phrase": "spinal_stenosis"}, {"score": 0.004656646049749062, "phrase": "fe_model"}, {"score": 0.004199247711875386, "phrase": "lumbar_and_cervical_areas"}, {"score": 0.004151022438970353, "phrase": "lateral_bending"}, {"score": 0.004105817858984256, "phrase": "axial_rotation"}, {"score": 0.003910740988145338, "phrase": "lumbar_motion_segment"}, {"score": 0.003299977511820374, "phrase": "thoracolumbar_spine"}, {"score": 0.003175792987190496, "phrase": "nonlinear_three-dimensional_finite_element"}, {"score": 0.0027996401456881806, "phrase": "published_experimental_results"}, {"score": 0.0023362245884046176, "phrase": "considerable_increase"}, {"score": 0.0021399277552314067, "phrase": "significant_change"}, {"score": 0.0021049977753042253, "phrase": "sagittal_motion"}], "paper_keywords": ["finite element method", " thoracolumbar spine", " bilateral facetectomy", " spinal stability", " range of motion"], "paper_abstract": "Spinal stenosis can be found in any part of the spine, though it is most commonly located on the lumbar and cervical areas. It has been documented in the literature that bilateral facetectomy in a lumbar motion segment to increase the space induces an increase in flexibility at the level at which the surgery was performed. However, the result of bilateral facetectomy on the stability of the thoracolumbar spine has not been studied. A nonlinear three-dimensional finite element (FE) model of thoracolumbar T11-L1 was built to explore the influence of bilateral facetectomy. The FE model of T11-L1 was validated against published experimental results under various physiological loadings. The FE model with bilateral facetectomy was evaluated under flexion, extension, lateral bending and axial rotation to determine alterations in kinematics. Results show that bilateral facetectomy causes increase in motion, considerable increase in axial rotation and least increase in lateral bending. Removal of facets did not result in significant change in the sagittal motion in flexion and extension.", "paper_title": "Effect of bilateral facetectomy of thoracolumbar spine T11-L1 on spinal stability", "paper_id": "WOS:000240032500002"}