{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "multicast_traffic"}, {"score": 0.015719716506582538, "phrase": "buffered_crossbars"}, {"score": 0.004395985167383825, "phrase": "cicq"}, {"score": 0.004069963083642548, "phrase": "iq_switches"}, {"score": 0.003821215658570578, "phrase": "architectural_scalability"}, {"score": 0.0034640450599342488, "phrase": "switching_fabric"}, {"score": 0.003275093899046286, "phrase": "internal_buffers"}, {"score": 0.0028464607144683247, "phrase": "cicq_switches"}, {"score": 0.0025264171945423254, "phrase": "significant_throughput_degradation"}, {"score": 0.0024912073108138613, "phrase": "\"pathological\"_multicast_traffic_patterns"}, {"score": 0.0021801944769738618, "phrase": "deeper_understanding"}, {"score": 0.0021049977753042253, "phrase": "cicq_architectures"}], "paper_keywords": ["buffered crossbars", " multicast", " packet switching", " scheduling"], "paper_abstract": "Input queued (IQ) switches exploiting buffered crossbars (CICQ switches) are widely considered very promising architectures that outperform IQ switches with bufferless switching fabrics both in terms of architectural scalability and performance. Indeed the problem of scheduling packets for transfer through the switching fabric is significantly simplified by the presence of internal buffers in the crossbar, which makes possible the adoption of efficient, simple and fully distributed scheduling algorithms. This paper studies the throughput performance of CICQ switches supporting multicast traffic, showing that, similarly to IQ architectures, also CICQ switches with arbitrarily large number of ports may suffer of significant throughput degradation under \"pathological\" multicast traffic patterns. Despite the asymptotic nature of these,results, the authors believe that they can contribute to a deeper understanding of the behavior of CICQ architectures supporting multicast traffic.", "paper_title": "Asymptotic performance limits of switches with buffered crossbars supporting multicast traffic", "paper_id": "WOS:000252612200006"}