{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hand-eye_coordination"}, {"score": 0.049299759016574796, "phrase": "brain_activity"}, {"score": 0.038915505278648635, "phrase": "intuitive_operability"}, {"score": 0.03000142475065395, "phrase": "virtual_slave_manipulator"}, {"score": 0.004685012337701536, "phrase": "surgical_robots"}, {"score": 0.003997343989408636, "phrase": "user's_brain_activity"}, {"score": 0.0029412271277166873, "phrase": "hand_controller"}, {"score": 0.0027389142053945246, "phrase": "surgical_simulator"}, {"score": 0.0026357877401570764, "phrase": "brain_imaging_device"}, {"score": 0.00221153232497724, "phrase": "particular_slave_manipulator_configuration"}, {"score": 0.0021049977753042253, "phrase": "body_image"}], "paper_keywords": ["medical robotics", " surgical robot", " intuitive operability", " user interface", " brain activity"], "paper_abstract": "Surgical robots have improved considerably in recent years, but their intuitive operability, and thus their user interoperability, has yet to be quantitatively evaluated. Thus, we propose a method for measuring a user's brain activity while operating such a robot, to better enable the design of a robot with intuitive operability. The objective of this study was to determine the angle and radius between an endoscope and manipulator that best allows the user to perceive the manipulator as being part of their own body. In the experiments, a subject operated a hand controller to position the tip of a virtual slave manipulator onto a target in a surgical simulator while his/her brain activity was measured using a brain imaging device. The experiment was carried out several times with the virtual slave manipulator configured in a variety of ways. The results show that the amount of brain activity is significantly greater with a particular slave manipulator configuration. We concluded that the hand-eye coordination between the body image and the robot should be closely matched in the design of a robot having intuitive operability.", "paper_title": "Evaluation of Hand-Eye Coordination Based on Brain Activity", "paper_id": "WOS:000370188200017"}