{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "artifact-centric_business_process_models"}, {"score": 0.0047292449487169345, "phrase": "artifact-centric_methodology"}, {"score": 0.004645057834614705, "phrase": "new_paradigm"}, {"score": 0.004595263305771512, "phrase": "business_process_management"}, {"score": 0.004481132747216135, "phrase": "business_processes"}, {"score": 0.004125634486868786, "phrase": "research_challenges"}, {"score": 0.003923144245133288, "phrase": "business_process_models"}, {"score": 0.0036247638406450735, "phrase": "fully_automated_approach"}, {"score": 0.003150319576043518, "phrase": "artificial_intelligence"}, {"score": 0.002984794722633428, "phrase": "weak_termination"}, {"score": 0.002942138511829811, "phrase": "novel_verification_algorithms"}, {"score": 0.0028076592725295646, "phrase": "false_positives"}, {"score": 0.00278752137116301, "phrase": "false_negatives"}, {"score": 0.0027181663098561066, "phrase": "algorithms_offer"}, {"score": 0.002708399936381754, "phrase": "precise_diagnosis"}, {"score": 0.00267931029131157, "phrase": "detected_errors"}, {"score": 0.0024399036842105205, "phrase": "first_verification_approach"}, {"score": 0.002286781334850213, "phrase": "numerical_data_verification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Artifact-centric business process model", " Verification", " Constraint programming"], "paper_abstract": "Context: The artifact-centric methodology has emerged as a new paradigm to support business process management over the last few years. This way, business processes are described from the point of view of the artifacts that are manipulated during the process. Objective: One of the research challenges in this area is the verification of the correctness of this kind of business process models where the model is formed of various artifacts that interact among them. Method: In this paper, we propose a fully automated approach for verifying correctness of artifact-centric business process models, taking into account that the state (lifecycle) and the values of each artifact (numerical data described by pre and postconditions) influence in the values and the state of the others. The lifecycles of the artifacts and the numerical data managed are modeled by using the Constraint Programming paradigm, an Artificial Intelligence technique. Results: Two correctness notions for artifact-centric business process models are distinguished (reachability and weak termination), and novel verification algorithms are developed to check them. The algorithms are complete: neither false positives nor false negatives are generated. Moreover, the algorithms offer precise diagnosis of the detected errors, indicating the execution causing the error where the lifecycle gets stuck. Conclusion: To the best of our knowledge, this paper presents the first verification approach for artifact-centric business process models that integrates pre and postconditions, which define the behavior of the services, and numerical data verification when the model is formed of more than one artifact. The approach can detect errors not detectable with other approaches. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Automating correctness verification of artifact-centric business process models", "paper_id": "WOS:000353179000010"}