{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gpu"}, {"score": 0.00466085208934021, "phrase": "bio-inspired_motion_estimation_model"}, {"score": 0.004395742407834023, "phrase": "specific_and_efficient_implementation"}, {"score": 0.004310752197635499, "phrase": "gradient-based_optical_flow_model"}, {"score": 0.004092026656771699, "phrase": "validated_neuromorphic_motion_estimation_system"}, {"score": 0.003935267970727093, "phrase": "image_velocity"}, {"score": 0.0034099718632933027, "phrase": "specific_graphic_processing_units"}, {"score": 0.0033222630615013763, "phrase": "ad_hoc_framework"}, {"score": 0.0026969099161088398, "phrase": "general_cpu"}, {"score": 0.0023213398100616132, "phrase": "motion_estimation_sequences"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["motion estimation", " digital signal processing", " bio-inspired systems", " parallel processing", " graphic processor unit"], "paper_abstract": "In this paper, we describe the specific and efficient implementation of a gradient-based optical flow model. This scheme was particularized using a validated neuromorphic motion estimation system for the robust extraction of image velocity. This model contains many characteristics that enhanced the capability when compared with other optical flow gradient family algorithms. Our implementation was performed using specific graphic processing units designed in an ad hoc framework for this model, which could be reused in several low-level machine-vision approaches. Observed performance results indicate that these accelerators be highly recommended. Furthermore, the throughput obtained in comparison with a general CPU was analyzed for the accurateness of a system built with regard to other optical flow systems. Additionally, several visual examples, commonly used for testing motion estimation sequences, were shown to reveal implementation behavior features. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "GPU-based acceleration of bio-inspired motion estimation model", "paper_id": "WOS:000318042500003"}