{"auto_keywords": [{"score": 0.04070013450398718, "phrase": "accurate_map"}, {"score": 0.0048159226002964465, "phrase": "sensor"}, {"score": 0.004791878972726824, "phrase": "fusion-based_exploration"}, {"score": 0.004352876088312741, "phrase": "mobile_service_robot"}, {"score": 0.004108942392772092, "phrase": "suitable_strategy"}, {"score": 0.0033575566897536906, "phrase": "exploration_process"}, {"score": 0.0032777653153451265, "phrase": "resulting_map"}, {"score": 0.0031845067058084583, "phrase": "driving_gains"}, {"score": 0.003034916887102753, "phrase": "previously_visited_place"}, {"score": 0.0029627701619228527, "phrase": "exploration_distance"}, {"score": 0.0027965187255008647, "phrase": "favorable_path"}, {"score": 0.002716915166374506, "phrase": "localization_gain"}, {"score": 0.00242047093248845, "phrase": "proposed_exploration_method"}, {"score": 0.002166711569953301, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Exploration", " SLAM", " Mobile robot", " Indoor navigation"], "paper_abstract": "Exploration is one of the most important functions for a mobile service robot because a map is required to carry out various tasks. A suitable strategy is needed to efficiently explore an environment and to build an accurate map. This study proposed the use of several gains (information, driving, localization) that, if considered during exploration, can simultaneously improve the efficiency of the exploration process and quality of the resulting map. Considering the information and driving gains reduces behavior that leads a robot to explore a previously visited place, and thus the exploration distance is reduced. In addition, the robot can select a favorable path for localization by considering the localization gain during exploration, and the robot can estimate its pose more robustly than other methods that do not consider localizability during exploration. This proposed exploration method was verified by various experiments, which verified that a robot can build an accurate map fully autonomously and efficiently in various home environments using the proposed method. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Sensor fusion-based exploration in home environments using information, driving and localization gains", "paper_id": "WOS:000360424700006"}