{"auto_keywords": [{"score": 0.041900406463013344, "phrase": "high_price_transparency"}, {"score": 0.01925586148681095, "phrase": "price_transparency"}, {"score": 0.00522625644728091, "phrase": "compensatory_benefits"}, {"score": 0.00481495049065317, "phrase": "electronic_marketplaces"}, {"score": 0.004514714250357749, "phrase": "empirical_studies"}, {"score": 0.004371660146981191, "phrase": "product_prices"}, {"score": 0.003969018740062018, "phrase": "leading_highly_price_transparent_emps"}, {"score": 0.0035648266669315943, "phrase": "buy_side"}, {"score": 0.003342280102112269, "phrase": "lower_prices"}, {"score": 0.0032829570709414736, "phrase": "successful_emps"}, {"score": 0.0030779528295407925, "phrase": "low_price_transparency"}, {"score": 0.0028857130140890787, "phrase": "emp_strategy"}, {"score": 0.002734692147497601, "phrase": "broad_range"}, {"score": 0.0027151607914592552, "phrase": "standard_electronics_components"}, {"score": 0.0026289770980696286, "phrase": "low_cost_strategy"}, {"score": 0.0025273383208209922, "phrase": "well_pursued_strategies"}, {"score": 0.0023189818169615135, "phrase": "greater_depth"}, {"score": 0.002174041708084857, "phrase": "strategic_alignment"}], "paper_keywords": ["electronic marketplaces", " electronic market theory", " electronic commerce", " Internet", " price transparency", " strategic alignment", " electronic components industry"], "paper_abstract": "Electronic marketplaces (EMPs) are widely assumed to increase price transparency and hence lower product prices. Results of empirical studies have been mixed, with several studies showing that product prices have not decreased and others showing that prices have increased in some cases. One explanation is that sellers prefer not to join EMPs with high price transparency, leading highly price transparent EMPs to fail. Therefore, in order to be successful, EMPs might be expected to avoid high price transparency. But that strategy creates a catch-22 for EMPs on the buy side: Why would buyers want to join EMPs in the absence of price transparency and the benefit of lower prices? We argue that successful EMPs must provide compensatory benefits for sellers in the case of high price transparency and for buyers in the case of low price transparency. To understand how EMPs could succeed, regardless of price transparency, we examined the relationships among EMP strategy, price transparency, and performance by analyzing all 19 EMPs that compete by selling a broad range of standard electronics components. We found that all EMPs pursuing a low cost strategy had high price transparency and performed poorly. All EMPs that performed well pursued strategies of differentiation, but, interestingly, not all successful EMPs avoided price transparency: Some EMPs succeeded despite enabling high price transparency. We therefore examined two differentiated EMPs in greater depth-one with high price transparency, the other with low price transparency-to show how they achieved strategic alignment of activities and resources and provided compensatory benefits for their customers.", "paper_title": "Electronic marketplaces and price transparency: Strategy, information technology, and success", "paper_id": "WOS:000240289900008"}