{"auto_keywords": [{"score": 0.04632734223938084, "phrase": "ec"}, {"score": 0.00481495049065317, "phrase": "potential_new_and_experienced_e-customers_-_analysis"}, {"score": 0.004533142516832776, "phrase": "e-customer_purchasing_behaviour"}, {"score": 0.004465294613995602, "phrase": "electronic_commerce"}, {"score": 0.004345706062641742, "phrase": "purchasing_experience"}, {"score": 0.004103611985528699, "phrase": "socio-demographic_characteristics"}, {"score": 0.0040057404099240424, "phrase": "chi-squared_test"}, {"score": 0.0039457680847406204, "phrase": "anova"}, {"score": 0.003922011960904278, "phrase": "post_hoc_analysis"}, {"score": 0.003898411923455267, "phrase": "scheffe"}, {"score": 0.0037371212381934853, "phrase": "findings_-_data_analyses"}, {"score": 0.0034864522257187242, "phrase": "perceived_usefulness"}, {"score": 0.0033020239107199876, "phrase": "perceived_ease"}, {"score": 0.0031462682245392785, "phrase": "evolving_cycle"}, {"score": 0.002656598121865532, "phrase": "new_customers"}, {"score": 0.0025542617599268323, "phrase": "existing_customers"}, {"score": 0.002361236012575149, "phrase": "target_customer"}], "paper_keywords": ["electronic commerce", " consumer behaviour"], "paper_abstract": "Purpose - The purpose of the paper is to analyse the evolution of e-customer purchasing behaviour. Certain perceptions of electronic commerce (EC) may differ according to the purchasing experience of customers. Three groups of e-customers are differentiated: potential, new and experienced. Design/methodology/approach - First of all, the socio-demographic characteristics of each group were analysed using the Chi-squared test. Then, using ANOVA and post hoc analysis (Scheffe's test), the differences that exist in their perceptions were analysed. Findings - Data analyses show that level of experience with Internet and the perceptions about EC differ according to the e-customer. Some variables, like perceived usefulness or attitude, increase significantly as the number of interchanges grows, while others, such as perceived ease of use, tend to stabilise. It can be affirmed that there is an evolving cycle of purchasing that will continue to develop as the individual acquires experience. Practical implications - This research enables the companies that want to compete in the e-market to know the type of customer they are addressing. Moreover, the results obtained show what perceptions must be concentrated on if these companies want to capture new customers (potential e-customers) or if they want to maintain existing customers (new and experienced). The evolution of this behaviour means that the strategies oriented to fomenting EC should stress one or another aspect depending on the target customer. Originality/value - While most research indistinctly analyses the behaviour of any e-customer, this study has considered it necessary to differentiate at least three types of e-customers in function of their purchasing experience. Thus, this is one of the few studies that allows us to know the evolution of the perceptions related to e-commerce.", "paper_title": "Differences between potential new and experienced e-customers - Analysis of e-purchasing behaviour", "paper_id": "WOS:000257816500004"}