{"auto_keywords": [{"score": 0.04888337447246293, "phrase": "molecular_docking"}, {"score": 0.014461504305939371, "phrase": "cml"}, {"score": 0.008823492640074402, "phrase": "virtual_screening"}, {"score": 0.004655285779819366, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004596779715291598, "phrase": "molecularly_targeted_therapy"}, {"score": 0.004463096299091981, "phrase": "chronic_myeloid_leukemia"}, {"score": 0.0043699845927285905, "phrase": "clinical_resistance"}, {"score": 0.004260800171269249, "phrase": "accelerated_or_blast_phase_cml."}, {"score": 0.004050514095922329, "phrase": "bcr-abl_kinase_activity"}, {"score": 0.0035091888798162176, "phrase": "imatinib_resistance"}, {"score": 0.003479692058963528, "phrase": "leukemia_cells"}, {"score": 0.0032938942910948096, "phrase": "novel_strategy"}, {"score": 0.0032115093493071366, "phrase": "imatinib-resistant_cml."}, {"score": 0.003131178497790961, "phrase": "dynamics_simulations"}, {"score": 0.002939007076062123, "phrase": "molecular_level"}, {"score": 0.0029020077365708966, "phrase": "calculated_binding_free_energies"}, {"score": 0.002805597755796506, "phrase": "experimental_affinities"}, {"score": 0.002723862897844177, "phrase": "binding_energy"}, {"score": 0.002633355582628613, "phrase": "molecular_dynamics"}, {"score": 0.002503187934017557, "phrase": "dual_inhibitors"}], "paper_keywords": ["Dual-inhibitor", " MM-GBSA", " Molecular dynamics", " STAT5/STAT3", " Virtual screening"], "paper_abstract": "Although molecularly targeted therapy with imatinib has improved treatments of chronic myeloid leukemia (CML), clinical resistance gradually develops in patients with accelerated or blast phase CML. The inability of imatinib to cure CML suggests that inactivation of BCR-ABL kinase activity alone is not sufficient to control the disease. Aberrant STAT signaling and constitutive STAT5 or STAT3 activation are frequently found in both acute and chronic leukemia. Constitutive activation of STAT5 and STAT3 are associated with imatinib resistance on leukemia cells. Development of drugs targeting SH2 domains of STAT5 and STAT3 provides a novel strategy for the treatment of the imatinib-resistant CML. Here, molecular docking and molecular dynamics simulations were used to investigate the interactions of the drugs targeting STAT3 and STAT5 receptors at molecular level. The calculated binding free energies are consistent with the ranking of the experimental affinities and our simulations also explained their differences in binding energy. Then virtual screening based on molecular docking and molecular dynamics was applied to screen a set of similar to 1500 compounds for dual inhibitors of the SH2 domains of STAT5 and STAT3. Three top score compounds obtained in virtual screening were compound 660, 304, and 561. Results show that the three predicted dual-inhibitors are well fitted within the two binding domains and are predicted to present improved STAT5 and STAT3 SH2 inhibitory activity.", "paper_title": "Dual-inhibitors of STAT5 and STAT3: studies from molecular docking and molecular dynamics simulations", "paper_id": "WOS:000340869400005"}