{"auto_keywords": [{"score": 0.04739845836219197, "phrase": "rough_set"}, {"score": 0.0055966159834635034, "phrase": "fuzzy_set"}, {"score": 0.005319041771089225, "phrase": "fuzzy_entropy"}, {"score": 0.00481495049065317, "phrase": "fuzzy_entropies"}, {"score": 0.004775531918452571, "phrase": "effective_measures"}, {"score": 0.004273782634394231, "phrase": "don-zero_rough_membership_degree"}, {"score": 0.0041696157492057, "phrase": "rough_membership_degree"}, {"score": 0.0037776319581225046, "phrase": "inherent_relations"}, {"score": 0.0033664873319204027, "phrase": "existing_fuzzy_entropies"}, {"score": 0.0030876784650745973, "phrase": "boundary_region"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Fuzzy set", " Roughness", " Fuzzy entropy", " Granular computing"], "paper_abstract": "The roughness of a rough set arises from the existence of its boundary region. In such a boundary region, each object has a Don-zero rough membership degree. When an object's rough membership degree is regarded as its fuzzy membership degree, a rough set can induce a fuzzy set. This relationship motivates us to assert that there may exist some inherent relations between the roughness of a rough set and the fuzziness of the fuzzy set induced from the rough set. This assertion leads us to the question: Can the existing fuzzy entropies be used to evaluate the roughness of a rough set? To answer this question, we first analyze how the boundary region varies when the partition of the universe becomes coarser, and then exploit this analysis in the introduction of a more appropriate definition on the roughness of a rough set. To determine whether a fuzzy entropy can be used to evaluate the roughness of a rough set or not, we develop three methods for estimating the ability of a fuzzy entropy to measure the roughness. The experiments show that these methods are very effective and can be applied to select a fuzzy entropy as a measure of the roughness of a rough set. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Can fuzzy entropies be effective measures for evaluating the roughness of a rough set?", "paper_id": "WOS:000316774700010"}