{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "object_shape_detection"}, {"score": 0.004601508848655033, "phrase": "novel_reconfigurable_part-based_model"}, {"score": 0.0043533862892678864, "phrase": "object_shapes"}, {"score": 0.004056769841308405, "phrase": "local_classifiers"}, {"score": 0.003995876175614403, "phrase": "contour_fragments"}, {"score": 0.0038573081851680656, "phrase": "leaf-nodes_function"}, {"score": 0.003487222504700868, "phrase": "higher_layer_capture_holistic_shape_deformations"}, {"score": 0.003058515297281172, "phrase": "large_global_variations"}, {"score": 0.002878785759716458, "phrase": "novel_structural_optimization_algorithm"}, {"score": 0.0028070431733705735, "phrase": "and-or_model"}, {"score": 0.0027788478707700274, "phrase": "weakly_annotated_data"}, {"score": 0.002682370021834353, "phrase": "model_structures"}, {"score": 0.0025374674652885354, "phrase": "parameter_learning"}, {"score": 0.002400373755068185, "phrase": "robust_shape-based_object_detection"}, {"score": 0.0021697677572213086, "phrase": "new_shape_database"}], "paper_keywords": ["Object detection", " grammar model", " And-Or Graph", " structural optimization"], "paper_abstract": "In this paper, we investigate a novel reconfigurable part-based model, namely And-Or graph model, to recognize object shapes in images. Our proposed model consists of four layers: leaf-nodes at the bottom are local classifiers for detecting contour fragments; or-nodes above the leaf-nodes function as the switches to activate their child leaf-nodes, making the model reconfigurable during inference; and-nodes in a higher layer capture holistic shape deformations; one root-node on the top, which is also an or-node, activates one of its child and-nodes to deal with large global variations (e.g. different poses and views). We propose a novel structural optimization algorithm to discriminatively train the And-Or model from weakly annotated data. This algorithm iteratively determines the model structures (e.g. the nodes and their layouts) along with the parameter learning. On several challenging datasets, our model demonstrates the effectiveness to perform robust shape-based object detection against background clutter and outperforms the other state-of-the-art approaches. We also release a new shape database with annotations, which includes more than 1500 challenging shape instances, for recognition and detection.", "paper_title": "Discriminatively Trained And-Or Graph Models for Object Shape Detection", "paper_id": "WOS:000352533000005"}