{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conservation_laws"}, {"score": 0.04970903037225392, "phrase": "hybrid_meshes"}, {"score": 0.04081086410274991, "phrase": "proposed_schemes"}, {"score": 0.004075053556360943, "phrase": "present_scheme"}, {"score": 0.003996727479807572, "phrase": "high-order_versions"}, {"score": 0.003965818535880531, "phrase": "third_and_fourth_order"}, {"score": 0.003612971658533784, "phrase": "good_conservation"}, {"score": 0.0033690254452595865, "phrase": "solution_node"}, {"score": 0.0030810605918297584, "phrase": "marching_strategy"}, {"score": 0.002963640433319524, "phrase": "cell_centers"}, {"score": 0.002895341091441627, "phrase": "explicit_high-order_schemes"}, {"score": 0.0028729252198422825, "phrase": "second_and_third-order_derivatives"}, {"score": 0.0027102313244646934, "phrase": "first-order_derivatives"}, {"score": 0.0026788122684116224, "phrase": "present_schemes"}, {"score": 0.002617059777997427, "phrase": "wide_variety"}, {"score": 0.0023746766301040974, "phrase": "arbitrary-order_schemes"}, {"score": 0.0023289568500915207, "phrase": "polygonal_elements"}, {"score": 0.002293014162421338, "phrase": "present_methodologies"}, {"score": 0.002248863090203165, "phrase": "common_benchmark_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Space-time conservation element and solution element (CE/SE) method", " High-order accuracy", " Hybrid meshes", " Unstructured meshes"], "paper_abstract": "In this paper, the second-order space-time conservation element and solution element (CE/SE) method proposed by Chang (1995) [3] is implemented on hybrid meshes for solving conservation laws. In addition, the present scheme has been extended to high-order versions including third and fourth order. Most methodologies of proposed schemes are consistent with that of the original CE/SE method, including: (i) a unified treatment of space and time (thereby ensuring good conservation in both space and time); (ii) a highly compact node stencil (the solution node is calculated using only the neighboring mesh nodes) regardless of the order of accuracy at the cost of storing all derivatives. A staggered time marching strategy is adopted and the solutions are updated alternatively between cell centers and vertexes. To construct explicit high-order schemes, second and third-order derivatives are calculated by a modified finite-difference/weighted-average procedure which is different from that used to calculate the first-order derivatives. The present schemes can be implemented on a wide variety of meshes, including triangular, quadrilateral and hybrid (consisting of both triangular and quadrilateral elements). Beyond that, it can be easily extended to arbitrary-order schemes and arbitrary shape of polygonal elements by using the present methodologies. A series of common benchmark examples are used to confirm the accuracy and robustness of the proposed schemes. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Robust high-order space-time conservative schemes for solving conservation laws on hybrid meshes", "paper_id": "WOS:000346429300022"}