{"auto_keywords": [{"score": 0.04919524773018522, "phrase": "new_method"}, {"score": 0.012421384716028864, "phrase": "left-censored_data"}, {"score": 0.010778200162651876, "phrase": "cluster_analysis"}, {"score": 0.007504440240726993, "phrase": "left-censored_datasets"}, {"score": 0.0061924253383310625, "phrase": "new_imputation_method"}, {"score": 0.006135074097705549, "phrase": "subsequent_model-based_cluster_analysis"}, {"score": 0.006003299233262474, "phrase": "stochastic_nature"}, {"score": 0.005819915501148815, "phrase": "multiple_imputed_sets"}, {"score": 0.004712343352939003, "phrase": "strong_imputation_performance"}, {"score": 0.004668635518440514, "phrase": "proposed_method"}, {"score": 0.0045117977845580874, "phrase": "mixture_models"}, {"score": 0.004469042910390712, "phrase": "true_values"}, {"score": 0.004427581692544645, "phrase": "censored_data"}, {"score": 0.003934401172799425, "phrase": "imputed_data"}, {"score": 0.0032953582866530966, "phrase": "smaller_uncertainty"}, {"score": 0.0030582832134483685, "phrase": "group_covariances"}, {"score": 0.0029830992938695007, "phrase": "subsequent_clustering"}, {"score": 0.00288272132056405, "phrase": "simulated_datasets"}, {"score": 0.0027426990589357937, "phrase": "real_datasets"}, {"score": 0.002708766459414734, "phrase": "best_performance"}, {"score": 0.002577171858769087, "phrase": "main_assumption"}, {"score": 0.002498183546874872, "phrase": "john_wiley"}, {"score": 0.0021049977753042253, "phrase": "simulated_and_real_datasets"}], "paper_keywords": ["multiple imputation", " finite mixture models", " left-censored data", " model-based clustering"], "paper_abstract": "A new method of imputation for left-censored datasets is reported. This method is evaluated by examining datasets in which the true values of the censored data are known so that the quality of the imputation can be assessed both visually and by means of cluster analysis. Its performance in retaining certain data structures on imputation is compared with that of three other imputation algorithms by using cluster analysis on the imputed data. It is found that the new imputation method benefits a subsequent model-based cluster analysis performed on the left-censored data. The stochastic nature of the imputations performed in the new method can provide multiple imputed sets from the same incomplete data. The analysis of these provides an estimate of the uncertainty of the cluster analysis. Results from clustering suggest that the imputation is robust, with smaller uncertainty than that obtained from other multiple imputation methods applied to the same data. In addition, the use of the new method avoids problems with ill-conditioning of group covariances during imputation as well as in the subsequent clustering based on expectation-maximization. The strong imputation performance of the proposed method on simulated datasets becomes more apparent as the groups in the mixture models are increasingly overlapped. Results from real datasets suggest that the best performance occurs when the requirement of normality of each group is fulfilled, which is the main assumption of the new method. Copyright (c) 2013 John Wiley & Sons, Ltd. A new method of imputation of left-censored datasets is reported. The new imputation method benefits a subsequent model-based cluster analysis performed on the left-censored data. The stochastic nature of the imputations performed in the new method can provide multiple imputed sets from the same incomplete data so that the uncertainty of clustering can be evaluated. The strong imputation performance of the proposed method on simulated and real datasets becomes more apparent as the groups in the mixture models are closer to normally distributed, even though the groups may be overlapped.", "paper_title": "Imputation of left-censored data for cluster analysis", "paper_id": "WOS:000333021100003"}