{"auto_keywords": [{"score": 0.039640473816026964, "phrase": "n_vertices"}, {"score": 0.015719716506582538, "phrase": "isolated_cliques"}, {"score": 0.009264930526126171, "phrase": "average_degree"}, {"score": 0.004794059969542758, "phrase": "pseudo-cliques"}, {"score": 0.004690952711665194, "phrase": "isolated_dense_subgraphs"}, {"score": 0.004300133642951283, "phrase": "number_c"}, {"score": 0.004162086114221198, "phrase": "isolation_factor"}, {"score": 0.0041170581247889654, "phrase": "main_result"}, {"score": 0.004046020290832207, "phrase": "fixed_constant_c"}, {"score": 0.003993544228876303, "phrase": "c-isolated_maximal_cliques"}, {"score": 0.0038990925273824813, "phrase": "linear_time"}, {"score": 0.003275940081266134, "phrase": "increasing_function"}, {"score": 0.002722288966917744, "phrase": "set_v'_subset"}, {"score": 0.0026175952455594277, "phrase": "minimum_degree"}, {"score": 0.002516917671182532, "phrase": "polynomial_time"}, {"score": 0.002473420909291381, "phrase": "superpolynomial_number"}, {"score": 0.0023679315987170857, "phrase": "isolated_pseudo-cliques"}, {"score": 0.0021607883988873492, "phrase": "polynomial-time_algorithm"}, {"score": 0.0021049977753042253, "phrase": "constant_c."}], "paper_keywords": ["Clique", " enumeration", " isolation"], "paper_abstract": "In this article, we consider isolated cliques and isolated dense subgraphs. For a given graph G, a vertex subset S of size k (and also its induced subgraph G(S)) is said to be c-isolated if G(S) is connected to its outside via less than ck edges. The number c is sometimes called the isolation factor. The subgraph appears more isolated if the isolation factor is smaller. The main result in this work shows that for a fixed constant c, we can enumerate all c-isolated maximal cliques (including a maximum one, if any) in linear time. In more detail, we show that, for a given graph G of n vertices and m edges, and a positive real number c, all c-isolated maximal cliques can be enumerated in time O(c(4)2(2c)m). From this, we can see that: (1) if c is a constant, all c-isolated maximal cliques can be enumerated in linear time, and (2) if c = O( log n), all c-isolated maximal cliques can be enumerated in polynomial time. Moreover, we show that these bounds are tight. That is, if f(n) is an increasing function not bounded by any constant, then there is a graph of n vertices and m edges for which the number of f(n)-isolated maximal cliques is superlinear in n + m. Furthermore, if f (n) = omega(log n), there is a graph of n vertices and m edges for which the number of f(n)-isolated maximal cliques is superpolynomial in n + m. We next introduce the idea of pseudo-cliques. A pseudo-clique having an average degree a and a minimum degree beta, denoted by PC(alpha, beta), is a set V' subset of V such that the subgraph induced by V' has an average degree of at least alpha and a minimum degree of at least beta. This article investigates these, and obtains some cases that can be solved in polynomial time and some other cases that have a superpolynomial number of solutions. Especially, we show the following results, where k is the number of vertices of the isolated pseudo-cliques: (1) For any epsilon > 0 there is a graph of n vertices for which the number of 1-isolated PC(k - (logk)(1+epsilon), k/(log k)(1+epsilon)) is superpolynomial, and (2) there is a polynomial-time algorithm which enumerates all c-isolated PC(k - log k, k/log k), for any constant c.", "paper_title": "Enumeration of Isolated Cliques and Pseudo-Cliques", "paper_id": "WOS:000271945600007"}