{"auto_keywords": [{"score": 0.015214121792561831, "phrase": "reduced_curvature_formulae"}, {"score": 0.012383631719020185, "phrase": "reduced_formulae"}, {"score": 0.00481495049065317, "phrase": "surface_and_surface_intersections"}, {"score": 0.0044435677598780796, "phrase": "reduced_formula"}, {"score": 0.004258644418211771, "phrase": "entity's_representation"}, {"score": 0.003820144626025562, "phrase": "alternative_unreduced_formulae"}, {"score": 0.0031174595932694036, "phrase": "surface_intersection_curves"}, {"score": 0.003030247482854539, "phrase": "intersecting_surfaces"}, {"score": 0.0027437235598539904, "phrase": "known_formulae"}, {"score": 0.0025078454114965147, "phrase": "known_results"}, {"score": 0.002426137929553724, "phrase": "curve_curvature_formula"}, {"score": 0.0023249757987087055, "phrase": "respective_binormal_vector"}, {"score": 0.0022492129111567824, "phrase": "frenet_frame"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Reduced curvature formulae", " Gaussian mean and normal curvature", " Curvature of curves on a surface", " Curvature of intersection curves of surfaces", " Curvature of intersection curves of offset (parallel) surfaces"], "paper_abstract": "We introduce the concept of reduced curvature formulae for 3-D space entities (surfaces, curves). A reduced formula entails only derivatives of the functions involved in the entity's representation and admits no further algebraic simplifications. Although not always the most compact, reduced curvature formulae entail only basic arithmetic operators and are more efficient computationally compared to alternative unreduced formulae. Reduced formulae are presented for the normal, mean and Gaussian curvatures of a surface and the curvature of curves on a surface, where each surface or curve on a surface may be defined parametrically or implicitly. Reduced formulae are also presented for the curvature of surface intersection curves, where each of the intersecting surfaces may be a given surface or an offset of a given surface and each given surface may be defined parametrically or implicitly. Known formulae are cited, without derivation, to form a collection, in one place, of new and of known results scattered in the literature. Each curve curvature formula is presented together with a formula for the respective binormal vector, from which formulae for the Frenet frame and torsion of the curve can be derived. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Reduced curvature formulae for surfaces, offset surfaces, curves on a surface and surface intersections", "paper_id": "WOS:000359329600006"}