{"auto_keywords": [{"score": 0.0497055404009025, "phrase": "networked_systems"}, {"score": 0.044584958941661715, "phrase": "networked_system"}, {"score": 0.03514117689647819, "phrase": "resulting_model"}, {"score": 0.00481495049065317, "phrase": "quantitative_security_analyses"}, {"score": 0.004740126725341152, "phrase": "traditional_security_analyses"}, {"score": 0.004648222388468414, "phrase": "cryptographic_primitives"}, {"score": 0.0044002186469797476, "phrase": "defender's_need"}, {"score": 0.004214637810698362, "phrase": "significant_impact"}, {"score": 0.0034375594065869032, "phrase": "stochastic_model"}, {"score": 0.0031782684007251403, "phrase": "deployed_security_mechanisms"}, {"score": 0.003141093559655865, "phrase": "intrusion_detection_systems"}, {"score": 0.002792375587031108, "phrase": "\"_system_configurations"}, {"score": 0.0025715131759585052, "phrase": "\"_system_parameters"}, {"score": 0.0023680783509308525, "phrase": "steady-state_number"}, {"score": 0.0022680085357731196, "phrase": "high_probability"}, {"score": 0.002250272652754455, "phrase": "simulation_studies"}, {"score": 0.002197891020396052, "phrase": "analytic_results"}], "paper_keywords": ["Security modeling", " quantitative security analysis", " vulnerability graph", " networked systems", " security metric"], "paper_abstract": "Traditional security analyses are often geared toward cryptographic primitives or protocols. Although such analyses are necessary, they cannot address a defender's need for insight into which aspects of a networked system having a significant impact on its security, and how to tune its configurations or parameters so as to improve security. This question is known to be notoriously difficult to answer, and the state of the art is that we know little about it. Toward ultimately addressing this question, this paper presents a stochastic model for quantifying security of networked systems. The resulting model captures two aspects of a networked system: 1) the strength of deployed security mechanisms such as intrusion detection systems and 2) the underlying vulnerability graph, which reflects how attacks may proceed. The resulting model brings the following insights: 1) How should a defender \"tune\" system configurations (e.g., network topology) so as to improve security? 2) How should a defender \"tune\" system parameters (e. g., by upgrading which security mechanisms) so as to improve security? 3) Under what conditions is the steady-state number of compromised entities of interest below a given threshold with a high probability? Simulation studies are conducted to confirm the analytic results, and to show the tightness of the bounds of certain important metric that cannot be resolved analytically.", "paper_title": "A Stochastic Model for Quantitative Security Analyses of Networked Systems", "paper_id": "WOS:000284163400003"}