{"auto_keywords": [{"score": 0.04960202571834177, "phrase": "bci"}, {"score": 0.00481495049065317, "phrase": "brain-computer_interfacing"}, {"score": 0.004625881588444304, "phrase": "brain_activity"}, {"score": 0.004248294537944227, "phrase": "peripheral_neural"}, {"score": 0.0034940519373446335, "phrase": "brain_signals"}, {"score": 0.0034097414623280617, "phrase": "id."}, {"score": 0.003306559295382181, "phrase": "bci's_and_intelligent_devices"}, {"score": 0.0031925019616678217, "phrase": "user's_sense"}, {"score": 0.003129096013910626, "phrase": "particularly_confusing_cases"}, {"score": 0.003051601113971322, "phrase": "behavioral_control_switches"}, {"score": 0.0021049977753042253, "phrase": "'guilty_mind"}], "paper_keywords": ["Brain-computer interfacing", " Intelligent systems", " Agency", " Responsibility", " Mens rea"], "paper_abstract": "Brain-computer interfacing (BCI) aims at directly capturing brain activity in order to enable a user to drive an application such as a wheelchair without using peripheral neural or motor systems. Low signal to noise ratio's, low processing speed, and huge intra- and inter-subject variability currently call for the addition of intelligence to the applications, in order to compensate for errors in the production and/or the decoding of brain signals. However, the combination of minds and machines through BCI's and intelligent devices (IDs) can affect a user's sense of agency. Particularly confusing cases can arise when the behavioral control switches implicitly from user to ID. I will suggest that in such situations users may be insecure about the extent to which the resulting behavior, whether successful or unsuccessful, is genuinely their own. Hence, while performing an action, a user of a BCI-ID may be uncertain about being the agent of the act. Several cases will be examined and some implications for (legal) responsibility (e.g. establishing the presence of a 'guilty mind') are discussed.", "paper_title": "Did I Do That? Brain-Computer Interfacing and the Sense of Agency", "paper_id": "WOS:000322322400007"}