{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "robust_nonparametric_methods"}, {"score": 0.0047555023078686386, "phrase": "italian_data"}, {"score": 0.004413846562278824, "phrase": "external_conditions"}, {"score": 0.0036857412768922827, "phrase": "preliminary_investigation"}, {"score": 0.003617616153730564, "phrase": "italian_system"}, {"score": 0.0033159224502739247, "phrase": "significant_factors"}, {"score": 0.0030017207229983385, "phrase": "trade-off_research"}, {"score": 0.0027857115172243226, "phrase": "industry_oriented_research"}, {"score": 0.0024595996811420566, "phrase": "industry_expectations"}, {"score": 0.002340081450249521, "phrase": "publication_profile"}, {"score": 0.0022825131641434964, "phrase": "efficiency_analysis"}, {"score": 0.002226357953581725, "phrase": "useful_tools"}, {"score": 0.0021049977753042253, "phrase": "public_research_system"}], "paper_keywords": [""], "paper_abstract": "This paper explores scale, scope and trade-off effects in scientific research and education. External conditions may dramatically affect the measurement of performance. We apply the Daraio&Simar's (2005) nonparametric methodology to robustlytake into account these factors and decompose the indicators of productivity accordingly. From a preliminary investigation on the Italian system of universities, we find that economies of scale and scope are not significant factors in explaining research and education productivity. We do not find any evidence of the trade-off research vs teaching. About the trade-off academic publications vs industry oriented research, it seems that, initially, collaboration with industry may improve productivity, but beyond a certain level the compliance with industry expectations may be too demanding and deteriorate the publication profile. Robust nonparametric methods in efficiency analysis are shown as useful tools for measuring and explaining the performance of a public research system of universities.", "paper_title": "Advanced indicators of productivity of universities. An application of robust nonparametric methods to Italian data", "paper_id": "WOS:000234603800012"}