{"auto_keywords": [{"score": 0.049455409376972057, "phrase": "write_amplification"}, {"score": 0.015719716506582538, "phrase": "hot_and_cold_data_identification"}, {"score": 0.015021854922452057, "phrase": "solid_state_drive"}, {"score": 0.014732193806739523, "phrase": "garbage_collection_algorithm"}, {"score": 0.01124754183691213, "phrase": "different_blocks"}, {"score": 0.011101943324618127, "phrase": "hot_and_cold_data"}, {"score": 0.004721162131188487, "phrase": "flash-based_ssds"}, {"score": 0.004674952036988355, "phrase": "write_performance"}, {"score": 0.00464439568459231, "phrase": "life_span"}, {"score": 0.004421471944783611, "phrase": "data_blocks"}, {"score": 0.004264795176205885, "phrase": "new_data"}, {"score": 0.004223032986655664, "phrase": "valid_data"}, {"score": 0.004167982855788402, "phrase": "selected_block"}, {"score": 0.003954837422946628, "phrase": "so-called_write_amplification"}, {"score": 0.003752550907120244, "phrase": "data_identification_techniques"}, {"score": 0.003247868216333148, "phrase": "write_approaches"}, {"score": 0.0031532895341013297, "phrase": "operating_system"}, {"score": 0.0029722900280316216, "phrase": "data_identification_technique"}, {"score": 0.002675715174122091, "phrase": "data_identification"}, {"score": 0.0026063035127641574, "phrase": "main_finding"}, {"score": 0.0025722741181993278, "phrase": "added_gain"}, {"score": 0.002480961181275199, "phrase": "hot_data"}, {"score": 0.002225972846167256, "phrase": "false_positives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Solid state drive", " Garbage collection", " Hot cold data", " Data identification", " Write amplification"], "paper_abstract": "The write performance and life span of a solid state drive is greatly influenced by the garbage collection algorithm. This algorithm selects the data blocks to be erased which can be subsequently used for storing new data. Any valid data left on a selected block needs to be written elsewhere before the block can be erased and contributes to the so-called write amplification. As all of the data on a solid state drive is not accessed equally often, data identification techniques have been proposed that identify the more frequently accessed, called hot, from the less frequently accessed, termed cold, data. These data identification techniques have been shown to be quite effective in reducing the write amplification essentially by using different blocks to store the hot and cold data, but they also contribute to the complexity of the device. Write approaches that use different blocks for writes triggered by the operating system and writes triggered by the garbage collection algorithm have also been proposed. These approaches do not require a data identification technique and thus simplify the design of the device, while also reducing the write amplification. In this paper we compare the performance of such a write approach with write approaches that do rely on data identification using both mean field models and simulation experiments. The main finding is that the added gain of identifying hot and cold data is quite limited, especially as the hot data gets hotter. Moreover, the write approaches relying on hot and cold data identification may even become inferior if either the fraction of data labeled hot is not ideally chosen or if the probability of having false positives or negatives when identifying data is substantial (e.g. 5%). (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the necessity of hot and cold data identification to reduce the write amplification in flash-based SSDs", "paper_id": "WOS:000347495000001"}