{"auto_keywords": [{"score": 0.048992899974696226, "phrase": "human_soft_tissue_sarcoma_samples"}, {"score": 0.010798706095823249, "phrase": "complete_linkage"}, {"score": 0.004268293864953256, "phrase": "best_method"}, {"score": 0.003984357400654665, "phrase": "single"}, {"score": 0.003334309053314909, "phrase": "centriod_linkage"}, {"score": 0.0032028587883593702, "phrase": "clustering_architecture"}, {"score": 0.0031121406603482112, "phrase": "core_unit"}, {"score": 0.0026494723416072316, "phrase": "hierarchical_clustering"}, {"score": 0.0026041635822373265, "phrase": "activated_jnk"}, {"score": 0.002530359917257626, "phrase": "transcription_factors"}, {"score": 0.0025014259919355453, "phrase": "gene_expression"}, {"score": 0.002321234686549485, "phrase": "average_linkage_clustering_method"}], "paper_keywords": [""], "paper_abstract": "The aim of this research is to use and compare clustering technologies and find the best method for establishing theoretical SAPK/JNK signaling pathway in human soft tissue sarcoma samples. Centroid linkage, Single linkage, complete linkage and average linkage hierarchical clustering are used to arrange genes for setup signaling pathways according to similarity in pattern of gene. The results show that centriod linkage, complete linkage, and average linking clustering architecture is consistent with the core unit of the cascade composed of a CDC42, a MEKK1 (map3k1), a MKK4 (map2W), a JNK1(mapk8) to a ATF2 in hierarchical clustering. An activated Jnk phosphorylates a variety of transcription factors regulating gene expression, such as ATF2. This study implies that centroid linkage, complete linkage and average linkage clustering method in uncentered (absolute) correlation similarity measures fits for establishing theoretical SAPK/Jnk signaling pathway in human soft tissue sarcoma samples which is consistent with biological experimental SAPK/Jnk signaling pathway", "paper_title": "Uncentered (absolute) correlation clustering method fit for establishing theoretical SAPK/JNK signaling pathway in human soft tissue sarcoma samples", "paper_id": "WOS:000241790900158"}