{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_application_stores"}, {"score": 0.01056413376622079, "phrase": "user_satisfaction"}, {"score": 0.004152502093643003, "phrase": "seemingly_conflicting_goals"}, {"score": 0.00405127920820053, "phrase": "large_quantity"}, {"score": 0.003880017219275826, "phrase": "specific_applications"}, {"score": 0.0036477941360224435, "phrase": "environmental_psychology"}, {"score": 0.0034506596895901003, "phrase": "quantity-related_facilitators_and_environment-related_facilitators"}, {"score": 0.0031649018957020337, "phrase": "application_store"}, {"score": 0.0022117133940361025, "phrase": "conflicting_goals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile application store", " E-commerce", " M-commerce", " Application discoverability", " Perceived quantity of applications", " Environmental psychology", " Partial Least Squares (PCS)"], "paper_abstract": "In order to appeal to consumers, mobile application stores face the challenge of finding ways to achieve the seemingly conflicting goals of providing a large quantity of applications and simultaneously making the specific applications that users desire easy to discover. Drawing on environmental psychology, this paper reports a study investigating how quantity-related facilitators and environment-related facilitators are related to application discoverability, which in turn impacts user satisfaction with the application store. We find that quantity-related facilitators (perceived quantity-sufficiency, perceived quantity-overload, and information specificity of search) and environment-related facilitators (application store coherence and user-generated reviews) all influence application discoverability, which affects user satisfaction. These facilitators play a role in managing the conflicting goals in mobile application stores. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Application discoverability and user satisfaction in mobile application stores: An environmental psychology perspective", "paper_id": "WOS:000333778800004"}