{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mems_storage_devices"}, {"score": 0.019986686177198336, "phrase": "probe_tips"}, {"score": 0.010185314503510515, "phrase": "magnetic_disks"}, {"score": 0.006583783868244562, "phrase": "data_retrieval_performance"}, {"score": 0.006087555530015177, "phrase": "rs_model"}, {"score": 0.00574586910639955, "phrase": "relational_data"}, {"score": 0.005698639004030998, "phrase": "two-dimensional_spatial_data"}, {"score": 0.004736045157669388, "phrase": "new_non-volatile_secondary_storages"}, {"score": 0.0033883824438527316, "phrase": "data_placements"}, {"score": 0.0031582637043009562, "phrase": "simple_logical_model"}, {"score": 0.0030052718739167696, "phrase": "major_characteristics"}, {"score": 0.0028596699752849682, "phrase": "physical_mems_storage_model"}, {"score": 0.0028010985923790036, "phrase": "heuristic_data_placement_strategies"}, {"score": 0.002621590601574503, "phrase": "new_data_placements"}, {"score": 0.002515272856011004, "phrase": "experimental_results"}, {"score": 0.002473959963690124, "phrase": "proposed_data_placements"}, {"score": 0.0022306602656266545, "phrase": "existing_data_placements"}, {"score": 0.0021049977753042253, "phrase": "database_size"}], "paper_keywords": ["MEMS storage device", " data placement", " logical model"], "paper_abstract": "MEMS storage devices are new non-volatile secondary storages that have outstanding advantages over magnetic disks. MEMS storage devices, however, are much different from magnetic disks in the structure and access characteristics in the following ways. They have thousands of heads called probe tips and provide the following two major access facilities: (1) flexibility: freely selecting a set of probe tips for accessing data, (2) parallelism: simultaneously reading and writing data with the set of probe tips selected. Due to these characteristics, it is nontrivial to find data placements that fully utilize the capability of MEMS storage devices. In this paper., we propose a simple logical model called the Region-Sector (RS) model that abstracts major characteristics affecting data retrieval performance, such as flexibility and parallelism, from the physical MEMS storage model. We also suggest heuristic data placement strategies based on the RS model. To show the usability of the RS model, we derive new data placements for relational data and two-dimensional spatial data by using these strategies. Experimental results show that the proposed data placements improve the data retrieval performance by up to 4.7 times for relational data and by up to 18.7 times for two-dimensional spatial data of approximately 320 Mbytes compared with those of existing data placements. Further, these improvements are expected to be more marked as the database size grows.", "paper_title": "A Logical Model and Data Placement Strategies for MEMS Storage Devices", "paper_id": "WOS:000272773300005"}