{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "zwitterionic_glycine"}, {"score": 0.004293434614435972, "phrase": "proton_donor"}, {"score": 0.004172094622123562, "phrase": "proton_acceptor"}, {"score": 0.004132411680987228, "phrase": "correlated_ab_initio"}, {"score": 0.0036147562669032957, "phrase": "dft_methods"}, {"score": 0.003429544382524185, "phrase": "different_gradient-corrected_correlation_functionals"}, {"score": 0.0029853535424953595, "phrase": "different_dft_methods"}, {"score": 0.002942811795757911, "phrase": "computed_hydrogen_bond_distances"}, {"score": 0.0025737890313763407, "phrase": "single_point"}, {"score": 0.0024771000236931836, "phrase": "interaction_energy"}, {"score": 0.0023954743066925714, "phrase": "superposition_error"}, {"score": 0.002316532084420729, "phrase": "charge_distribution_analysis"}, {"score": 0.0022188370388602813, "phrase": "long_raised_questions"}, {"score": 0.0021354538918029265, "phrase": "significant_contribution"}, {"score": 0.0021049977753042253, "phrase": "total_binding_energy"}], "paper_keywords": ["ab initio", " density functional theory", " microsolvation", " zwitterionic glycine"], "paper_abstract": "The effect of microsolvation on zwitterionic glycine, considering both (-NH3+) as proton donor and (-COO-) as proton acceptor at correlated ab initio (MP2) level and density functional methods (B3LYP, PW91, MPW1PW91 and PBE) using 6-311++G** basis set has been reported. DFT methods have been employed so as to compare the performance/quality of different gradient-corrected correlation functionals (PW91, PBE), hybrid functionals (B3LYP, MPW1PW91) and to predict the near quantitative structural and vibrational properties, at reduced computational cost. B3LYP method outperforms among the different DFT methods for the computed hydrogen bond distances and found closer to the value obtained by correlated MP2 level, whereas MPW1PW91 and PBE methods shows very similar values but similar to 0.03 angstrom less, compared to B3LYP method. MP2 calculation and single point CCSD(T)//MP2 calculation have been considered to decompose the interaction energy, including corrections for basis set superposition error (BSSE). Moreover, charge distribution analysis has also been carried out to understand the long raised questions, how and why the two body energies have significant contribution to the total binding energy.", "paper_title": "Effect of microsolvation on zwitterionic glycine: an ab initio and density functional theory study", "paper_id": "WOS:000254361000006"}