{"auto_keywords": [{"score": 0.04034190794741309, "phrase": "user_profiles"}, {"score": 0.03713212918603798, "phrase": "potential_term_characteristics"}, {"score": 0.015719716506582538, "phrase": "term_characteristics"}, {"score": 0.01106583584242049, "phrase": "information_retrieval_environment"}, {"score": 0.004763565662615503, "phrase": "relevance_feedback"}, {"score": 0.004466519142879166, "phrase": "distinguishing_term_characteristics"}, {"score": 0.004324985524216987, "phrase": "term_appearance_situations"}, {"score": 0.004011867299107537, "phrase": "specific_characteristics"}, {"score": 0.0036422425344358037, "phrase": "information_retrieval"}, {"score": 0.0032536902910768957, "phrase": "information_retrieval_system"}, {"score": 0.0030017207229983385, "phrase": "formal_tests"}, {"score": 0.0029064676523923886, "phrase": "distinguishing_capability"}, {"score": 0.0022696277881969896, "phrase": "ir_community"}, {"score": 0.002209406458446019, "phrase": "feature-extraction_algorithms"}, {"score": 0.0021049977753042253, "phrase": "structured_or_unstructured_documents"}], "paper_keywords": ["Feedback", " Information retrieval"], "paper_abstract": "Purpose - The purpose of this paper is to identify distinguishing term characteristics from among the information of term appearance situations (tas) residing in the relevant/irrelevant documents retrieved for use. Terms with specific characteristics could be used in the distinguishing of user profiles, documents, pages or concepts to assist in information retrieval. Design/methodology/approach - First, a method to apply the potential term characteristics in the distinguishing of user profiles in the information retrieval environment is designed. Then, an information retrieval system is developed to demonstrate the realisation and sustain the study of the method. Formal tests are conducted to examine the distinguishing capability of the potential term characteristics proposed in the method. Findings - The results of the tests show that the potential term characteristics proposed in this study are successfully applied in the distinguishing of user profiles in the information retrieval environment. Originality/value - Identification of distinguishing term characteristics would expand the ground for the IR community in the design of feature-extraction algorithms or systems that try to cull information from structured or unstructured documents.", "paper_title": "The identification of distinguishing term characteristics from relevance feedback", "paper_id": "WOS:000270768100006"}