{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "resource_sharing"}, {"score": 0.049683132952654335, "phrase": "wireless_mesh_networks"}, {"score": 0.009771221733550385, "phrase": "network-wide_collaboration"}, {"score": 0.007532061606111783, "phrase": "present"}, {"score": 0.004599994523941615, "phrase": "multipath_routing"}, {"score": 0.004561950666122737, "phrase": "channel_assignment"}, {"score": 0.004524220016675624, "phrase": "topology_control"}, {"score": 0.00402748353567517, "phrase": "selfish_behaviors"}, {"score": 0.0039446780026489905, "phrase": "free_riding"}, {"score": 0.0030611534228319717, "phrase": "resource_publish_rewards"}, {"score": 0.0025385621498128243, "phrase": "false_accumulations"}, {"score": 0.002486292595645607, "phrase": "selfish_nodes"}, {"score": 0.002424984362388813, "phrase": "underlying_security_model"}, {"score": 0.002297274552621268, "phrase": "random_oracle_model"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["Network architecture and design", " wireless communication", " wireless mesh networks"], "paper_abstract": "Many protocol particulars developed for the wireless mesh networks such as multipath routing, channel assignment, topology control, assume that a network-wide collaboration is available to establish connections to the network outside. However, the collaboration can be easily discouraged in the presence of selfish behaviors, referred to as free riding. In this paper, we propose a framework, PReSENt, to promote and make more secure the practices of collaboration among nodes by securing a compensation to the collaboration. When the PReSENt is enabled in wireless mesh networks, a node accumulates credits, an amount quantifying its resource provision when it provides its resource for other nodes. The nodes consuming the resource publish rewards, an amount quantifying their resource usage. The credits are used to guarantee the resource sharing for the provider from the customers in the future, whose amount is proportional to its relative contribution to the network-wide collaboration. The rewards are used to validate their corresponding credits in order to prevent false accumulations of the credits in selfish nodes. We formally define the underlying security model of the PReSENt and prove that the PReSENt is secure in the random oracle model. We then implement the PReSENt in J-Sim to illustrate its operational behaviors with respect to correct and secure resource sharing. The simulation results indicate that the PReSENt correctly encourages and controls the collaboration on resource sharing in wireless mesh networks.", "paper_title": "PReSENt: A Collaboration Framework for Resource Sharing in Wireless Mesh Networks", "paper_id": "WOS:000265089500001"}