{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "schema_matching"}, {"score": 0.015295517801718426, "phrase": "opaque_column_names"}, {"score": 0.00455585162011571, "phrase": "data_fields"}, {"score": 0.004325568312096711, "phrase": "critical_information_aggregation_tasks"}, {"score": 0.004207527897084009, "phrase": "multiple_tables"}, {"score": 0.0037927494831151553, "phrase": "multiple_semantics"}, {"score": 0.0037665925842197967, "phrase": "data_values"}, {"score": 0.003740615400423586, "phrase": "traditional_research"}, {"score": 0.003663749926218976, "phrase": "value_mapping"}, {"score": 0.0034784018545409193, "phrase": "novel_methods"}, {"score": 0.0031680109156103334, "phrase": "discrete-valued_attribute"}, {"score": 0.0030390745780621503, "phrase": "continuous-valued_attribute"}, {"score": 0.002701474449898187, "phrase": "statistical_distribution"}, {"score": 0.0026367554281038572, "phrase": "suitable_fitness_objectives"}, {"score": 0.0025735828740162223, "phrase": "data_log-likelihood"}, {"score": 0.0024773480858940504, "phrase": "heuristic_local_descent"}, {"score": 0.0024347998826121497, "phrase": "two-opt_switching"}, {"score": 0.0024096216848276094, "phrase": "attribute_matches"}, {"score": 0.002368233914089849, "phrase": "value_mappings"}, {"score": 0.002279660253812632, "phrase": "proposed_techniques"}, {"score": 0.0022560827223539934, "phrase": "continuous_and_discrete-valued_attribute_schemas"}, {"score": 0.0021716944668428865, "phrase": "useful_addition"}, {"score": 0.002119640369431708, "phrase": "automated_tools"}, {"score": 0.0021049977753042253, "phrase": "data_alignment"}], "paper_keywords": ["Experimentation", " Database alignment", " schema matching", " embedded value mapping"], "paper_abstract": "Schema matching and value mapping across two information sources, such as databases, are critical information aggregation tasks. Before data can be integrated from multiple tables, the columns and values within the tables must be matched. The complexities of both these problems grow quickly with the number of attributes to be matched and due to multiple semantics of data values. Traditional research has mostly tackled schema matching and value mapping independently, and for categorical (discrete-valued) attributes. We propose novel methods that leverage value mappings to enhance schema matching in the presence of opaque column names for schemas consisting of both continuous and discrete-valued attributes. An additional source of complexity is that a discrete-valued attribute in one schema could in fact be a quantized, encoded version of a continuous-valued attribute in the other schema. In our approach, which can tackle both \"onto\" and bijective schema matching, the fitness objective for matching a pair of attributes from two schemas exploits the statistical distribution over values within the two attributes. Suitable fitness objectives are based on Euclidean-distance and the data log-likelihood, both of which are applied in our experimental study. A heuristic local descent optimization strategy that uses two-opt switching to optimize attribute matches, while simultaneously embedding value mappings, is applied for our matching methods. Our experiments show that the proposed techniques matched mixed continuous and discrete-valued attribute schemas with high accuracy and, thus, should be a useful addition to a framework of (semi) automated tools for data alignment.", "paper_title": "Schema Matching and Embedded Value Mapping for Databases with Opaque Column Names and Mixed Continuous and Discrete-valued Data Fields", "paper_id": "WOS:000318265000002"}