{"auto_keywords": [{"score": 0.04490871521163666, "phrase": "passage_detection"}, {"score": 0.02050463335037008, "phrase": "passage_retrieval"}, {"score": 0.00827080633011607, "phrase": "individual_passages"}, {"score": 0.007479859913391523, "phrase": "predetermined_categories"}, {"score": 0.00481495049065317, "phrase": "text_classification"}, {"score": 0.004585653726916024, "phrase": "compartmentalized_information"}, {"score": 0.004497008230182996, "phrase": "corporate_and_governmental_organizations"}, {"score": 0.003675198655423198, "phrase": "traditional_information-retrieval_techniques"}, {"score": 0.003615845091983304, "phrase": "user_queries"}, {"score": 0.0035343512834706417, "phrase": "similarity_score"}, {"score": 0.003311458758488674, "phrase": "passage_detection_techniques"}, {"score": 0.003257960296952439, "phrase": "hidden_paragraphs"}, {"score": 0.0031025790996685497, "phrase": "hidden_text"}, {"score": 0.0030326180561817497, "phrase": "query_terms"}, {"score": 0.0029545864975783023, "phrase": "text-mining_techniques"}, {"score": 0.002859856368059419, "phrase": "hidden_passages"}, {"score": 0.002679386232765167, "phrase": "user_query"}, {"score": 0.0024297565926197505, "phrase": "keyword-based_dynamic_passage_approach"}, {"score": 0.0023749327442352474, "phrase": "kdp"}, {"score": 0.0022249936992104822, "phrase": "passage_detection_and_passage_category-prediction_tasks"}, {"score": 0.002153605290802688, "phrase": "feature_selection"}, {"score": 0.0021396042585285946, "phrase": "passage_length"}, {"score": 0.00212569405594774, "phrase": "ambiguous_passages"}, {"score": 0.0021049977753042253, "phrase": "finally_training-data_category_distribution"}], "paper_keywords": [""], "paper_abstract": "Passages can be hidden within a text to circumvent their disallowed transfer. Such release of compartmentalized information is of concern to all corporate and governmental organizations. Passage retrieval is well studied; we posit, however, that passage detection is not. Passage retrieval is the determination of the degree of relevance of blocks of text, namely passages, comprising a document. Rather than determining the relevance of a document in its entirety, passage retrieval determines the relevance of the individual passages. As such, modified traditional information-retrieval techniques compare terms found in user queries with the individual passages to determine a similarity score for passages of interest. In passage detection, passages are classified into predetermined categories. More often than not, passage detection techniques are deployed to detect hidden paragraphs in documents. That is, to hide information, documents are injected with hidden text into passages. Rather than matching query terms against passages to determine their relevance, using text-mining techniques, the passages are classified. Those documents with hidden passages are defined as infected. Thus, simply stated, passage retrieval is the search for passages relevant to a user query, while passage detection is the classification of passages. That is, in passage detection, passages are labeled with one or more categories from a set of predetermined categories. We present a keyword-based dynamic passage approach (KDP) and demonstrate that KDP outperforms statistically significantly (99% confidence) the other document-splitting approaches by 12% to 18% in the passage detection and passage category-prediction tasks. Furthermore, we evaluate the effects of the feature selection, passage length, ambiguous passages, and finally training-data category distribution on passage-detection accuracy.", "paper_title": "Passage Detection Using Text Classification", "paper_id": "WOS:000264413100013"}