{"auto_keywords": [{"score": 0.040029450721471016, "phrase": "initial_spatial_structure"}, {"score": 0.008713768692145006, "phrase": "spatial_structure"}, {"score": 0.008593070499365859, "phrase": "initial_state"}, {"score": 0.008088913877906098, "phrase": "capsis_platform"}, {"score": 0.004616859702338596, "phrase": "forest_growth_model"}, {"score": 0.004426882270402403, "phrase": "spatially_explicit_individual-based_models"}, {"score": 0.004304574865291508, "phrase": "forest_modeling"}, {"score": 0.0034559594248079807, "phrase": "unrealistic_way"}, {"score": 0.003162252895465901, "phrase": "\"mountain\"_model"}, {"score": 0.0030461580449080553, "phrase": "irregular_spruce_stands"}, {"score": 0.0027612315954598085, "phrase": "authors_simulated_different_initial_spatial_structures"}, {"score": 0.002684819249720834, "phrase": "long-term_simulations"}, {"score": 0.002445021071485221, "phrase": "first_cycle"}, {"score": 0.002289993730291138, "phrase": "next_generations"}, {"score": 0.0021649437083408425, "phrase": "periodic_gap_opening"}], "paper_keywords": ["disturbance", " forest", " growth model", " initial state", " Monte Carlo", " simulation", " spatial structure", " spruce", " tree"], "paper_abstract": "Spatially explicit individual-based models are used more often in forest modeling, especially because they take into account the influence of the spatial structure on the dynamics. However, they are potentially very sensitive to the initial spatial structure used for a simulation, which can be problematic if the initial state is not known or is simulated in an unrealistic way. The aim of this article is to study this sensitivity to initial spatial structure in the case of the \"Mountain\" model, an individual-based model of irregular spruce stands implemented in the Capsis platform. To characterize the influence of the initial spatial structure on the dynamics of the model, the authors simulated different initial spatial structures and compared the results of long-term simulations. They showed that the initial spatial structure can highly influence the dynamics of the model, not only during the first cycle of the evolution but also in the very long term in the evolution of the next generations. They also illustrated how some disturbances, such as a periodic gap opening through storms, can modify both the long-term dynamics of the stand and the duration of the influence of the initial spatial structure.", "paper_title": "Long-term influence of the spatial structure of an initial state on the dynamics of a forest growth model: A simulation study using the capsis platform", "paper_id": "WOS:000242172700006"}