{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "prior_empirical_work"}, {"score": 0.004766090327062509, "phrase": "layout_aesthetics"}, {"score": 0.004506048850130758, "phrase": "existing_graph_drawings"}, {"score": 0.004195418010131832, "phrase": "graph_drawings"}, {"score": 0.003986684503518077, "phrase": "adjacency_lists"}, {"score": 0.0032668821950788533, "phrase": "typical_graph_editing_system"}, {"score": 0.0030726480920918097, "phrase": "edge_crossings"}, {"score": 0.0028170314398963704, "phrase": "underlying_grid"}, {"score": 0.0025958582759972315, "phrase": "graph_drawing"}, {"score": 0.0025046245057922557, "phrase": "final_product"}, {"score": 0.002392008392892289, "phrase": "clear_distinction"}, {"score": 0.002249672943553135, "phrase": "graph_drawing_systems"}, {"score": 0.0022154296909169826, "phrase": "automatic_layout"}, {"score": 0.0021817065300196634, "phrase": "user's_manual_editing_process"}, {"score": 0.0021049977753042253, "phrase": "grid-based_graph_creation"}], "paper_keywords": ["Evaluation/methodology", " graphs and networks", " user interfaces"], "paper_abstract": "Prior empirical work on layout aesthetics for graph drawing algorithms has concentrated on the interpretation of existing graph drawings. We report on experiments which focus on the creation and layout of graph drawings: participants were asked to draw graphs based on adjacency lists, and to lay them out \"nicely.\" Two interaction methods were used for creating the drawings: a sketch interface which allows for easy, natural hand movements, and a formal point-and-click interface similar to a typical graph editing system. We find, in common with many other studies, that removing edge crossings is the most significant aesthetic, but also discover that aligning nodes and edges to an underlying grid is important. We observe that the aesthetics favored by participants during creation of a graph drawing are often not evident in the final product and that the participants did not make a clear distinction between the processes of creation and layout. Our results suggest that graph drawing systems should integrate automatic layout with the user's manual editing process, and provide facilities to support grid-based graph creation.", "paper_title": "Graph Drawing Aesthetics-Created by Users, Not Algorithms", "paper_id": "WOS:000296775400011"}