{"auto_keywords": [{"score": 0.004778088905211055, "phrase": "data_availability"}, {"score": 0.0042250952759280225, "phrase": "availability_analysis"}, {"score": 0.003988293689448734, "phrase": "system_cost"}, {"score": 0.003942544019605881, "phrase": "popular_approach"}, {"score": 0.003912335018240945, "phrase": "recent_studies"}, {"score": 0.003882356585452982, "phrase": "simple_random_placement"}, {"score": 0.0038526069752138196, "phrase": "steady-state_model"}, {"score": 0.003485913728272778, "phrase": "different_periods"}, {"score": 0.0033672608231654897, "phrase": "access_patterns"}, {"score": 0.003105824909705158, "phrase": "huge_difference"}, {"score": 0.003082007273423372, "phrase": "nodes'_availability"}, {"score": 0.0029203055813347874, "phrase": "novel_user-experience-based_availability_model"}, {"score": 0.0027992118597278087, "phrase": "user_experience"}, {"score": 0.002735284807307981, "phrase": "traditional_availability_analysis_model"}, {"score": 0.002683125911877974, "phrase": "new_model"}, {"score": 0.002631959004685823, "phrase": "decentralized_data_placement_algorithms"}, {"score": 0.002474674704809152, "phrase": "trace-driven_simulation"}, {"score": 0.0022302306304023602, "phrase": "low_availability"}, {"score": 0.002213112756450354, "phrase": "data-sharing_applications"}, {"score": 0.002154226045704907, "phrase": "different-level_service"}], "paper_keywords": ["P2P storage", " user experience", " availability", " data replacement"], "paper_abstract": "Data availability is one of the most important properties of peer-to-peer (P2P) storage systems. Availability analysis model and data placement are two key design choices. Users in P2P storage system are both providers and customers. This characteristic determines that the availability analysis must be user-centric, and thereby enhance the quality of service and decrease the system cost. The popular approach in recent studies is simple random placement with steady-state model, which has the following drawbacks: 1) It ignores the up/down patterns of nodes, whose availability is over-estimated or under-estimated at different periods of time. 2) It ignores the access patterns of users, so the availability perceived by users is hard to evaluate precisely. 3) It ignores the huge difference of nodes' availability, thus leading to the absence of incentive. This paper proposes a novel user-experience-based availability model, which evaluates the availability of P2P storage system in terms of user experience, which can degenerate to traditional availability analysis model. Based on the new model, this paper proposes decentralized data placement algorithms for two typical P2P storage applications: \"data sharing\" and \"personal backup\". By the trace-driven simulation, we prove that our methods can enhance the availability perceived by users greatly, reduce the variance of the availability dramatically and eliminate the nodes with low availability in data-sharing applications; meanwhile, it can provide different-level service to encourage users according to their contributions.", "paper_title": "User-experience-based availability analysis model and its application in P2P storage systems", "paper_id": "WOS:000293188100004"}