{"auto_keywords": [{"score": 0.049651030276363126, "phrase": "adaptive_help"}, {"score": 0.040490368143968045, "phrase": "user_response"}, {"score": 0.03596176205294269, "phrase": "required_steps"}, {"score": 0.00481495049065317, "phrase": "adaptive_assistance"}, {"score": 0.00408383113155665, "phrase": "intended_user_steps"}, {"score": 0.00374399358035391, "phrase": "different_accuracy_levels"}, {"score": 0.003688316529071842, "phrase": "control_format"}, {"score": 0.0035051129798529, "phrase": "simulated_email_application"}, {"score": 0.0034426417353349567, "phrase": "highlighted_guidance"}, {"score": 0.0033914308417007316, "phrase": "varying_levels"}, {"score": 0.0032036590920314725, "phrase": "highlighted_help"}, {"score": 0.003174973355583627, "phrase": "user_performance_times"}, {"score": 0.0031465436619697385, "phrase": "user_satisfaction"}, {"score": 0.002867227226349298, "phrase": "performance_time"}, {"score": 0.002790867657645595, "phrase": "significant_difference"}, {"score": 0.0025278307267360216, "phrase": "user's_satisfaction_level"}, {"score": 0.0024311346712789553, "phrase": "perceived_intrusiveness"}, {"score": 0.0023033100935570755, "phrase": "minimal_accuracy_level"}, {"score": 0.0021953290937408807, "phrase": "next_steps"}, {"score": 0.0021368250700305002, "phrase": "probability-based_algorithms"}, {"score": 0.0021176715289546798, "phrase": "intention_prediction"}, {"score": 0.0021049977753042253, "phrase": "adaptive_assistance_systems"}], "paper_keywords": ["adaptive assistance", " highlighted help", " accuracy level", " menus and toolbars"], "paper_abstract": "Providing adaptive help during interaction with the system can be used to assist users in accomplishing their tasks. We propose providing guidance by highlighting the steps required for performing a task that the user intends to complete according to the prediction of a system. We present a study aimed at examining whether highlighting intended user steps in menus and toolbars as a means of assisting users in performing tasks is useful in terms of user response and performance. We also examined the effects of different accuracy levels of help and the control format on user response and performance. An experiment was conducted in which 64 participants performed tasks using menus and toolbars of a simulated email application. Participants were offered a highlighted guidance of the required steps in varying levels of accuracy (100%, 80%, 60% and no guidance). Our results support the benefits of highlighted help both in user performance times and in user satisfaction from receiving such assistance. Users found the assistance necessary and helpful and by the same token not unduly intrusive. Additionally, users felt that such assistance generally helped in reducing performance time on tasks. We did not find a significant difference when users receiving help at 80% accuracy was compared to those receiving help at 100% accuracy; however, such a difference does appear for those receiving 60% accuracy. In such cases, we found that the user's satisfaction level, perceived usefulness and trust in the system decreased while their notion of perceived intrusiveness increased. We conclude that assisting users by highlighting the required steps is useful so long as the minimal accuracy level of help is higher than 60%. Our study has implications on the implementation of highlighting next steps as a means of adaptive help and on integrating probability-based algorithms such as intention prediction to adaptive assistance systems.", "paper_title": "Highlighting items as means of adaptive assistance", "paper_id": "WOS:000324361500003"}