{"auto_keywords": [{"score": 0.046629664979394615, "phrase": "autonomic_elements"}, {"score": 0.00981820107446218, "phrase": "semantic_reasoning"}, {"score": 0.00481495049065317, "phrase": "future_network_management"}, {"score": 0.0047385702897315436, "phrase": "ever-increasing_size"}, {"score": 0.00458940888106061, "phrase": "telecommunications_networks"}, {"score": 0.004259293347851015, "phrase": "network's_resources"}, {"score": 0.004147216579100177, "phrase": "increased_complexity"}, {"score": 0.0038900709793274484, "phrase": "management_process"}, {"score": 0.0031760175583084274, "phrase": "communications_bus"}, {"score": 0.00260657976055413, "phrase": "autonomic_element_goals"}, {"score": 0.002578880352208335, "phrase": "management_services"}, {"score": 0.0025514745448798385, "phrase": "semantic_definitions"}, {"score": 0.0022806798371116698, "phrase": "implemented_prototype"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["semantic reasoning", " service matchmaking", " context dissemination", " autonomic network management"], "paper_abstract": "The ever-increasing size, complexity and heterogeneity of telecommunications networks necessitate the introduction of autonomic elements that assist providers in managing and configuring the network's resources. To tackle this increased complexity, it is expected that many specialized autonomic elements will take part in the management process. It becomes necessary for them to collaborate and communicate in order to achieve high-level, human-specified, management goals. Therefore, the need for a scalable mechanism to facilitate the interactions between autonomic elements has arisen. This article presents a communications bus, augmented with semantics through the use of ontologies and semantic reasoning, which governs the communication and collaboration between autonomic elements. It supports filtering of context based on meaning. Additionally, it facilitates matchmaking of autonomic element goals with management services using semantic definitions of their inputs, outputs, preconditions and effects. Furthermore, the delay introduced by semantic reasoning was evaluated through an implemented prototype and was shown to be limited to only a few milliseconds. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "Semantic context dissemination and service matchmaking in future network management", "paper_id": "WOS:000306178800003"}