{"auto_keywords": [{"score": 0.04871565848141454, "phrase": "positive_roots"}, {"score": 0.010894725716452128, "phrase": "sign_variations"}, {"score": 0.004544629724830453, "phrase": "recent_interest"}, {"score": 0.004466519142879166, "phrase": "real_roots"}, {"score": 0.004264697351852424, "phrase": "sharp_upper_bounds"}, {"score": 0.003978866233891427, "phrase": "cauchy's_method"}, {"score": 0.0037336520904376687, "phrase": "stefanescu's_recently_published_theorem"}, {"score": 0.0035442655396704724, "phrase": "limited_applicability"}, {"score": 0.0033644530302903513, "phrase": "even_number"}, {"score": 0.0025631294247072476, "phrase": "corresponding_methods"}, {"score": 0.0025337556000088355, "phrase": "cauchy"}, {"score": 0.0024900588477893993, "phrase": "lagrange"}, {"score": 0.0023228223366301226, "phrase": "experimental_results"}], "paper_keywords": ["upper bounds", " positive roots", " real root isolation"], "paper_abstract": "The recent interest in isolating real roots of polynomials has revived interest in computing sharp upper bounds on the values of the positive roots of polynomials. Until now Cauchy's method was the only one widely used in this process. Stefanescu's recently published theorem offers an alternative, but unfortunately is of limited applicability as it works only when there is an even number of sign variations (or changes) in the sequence of coefficients of the polynomial under consideration. In this paper we present a more general theorem that works for any number of sign variations provided a certain condition is met. We compare the method derived from our theorem with the corresponding methods by Cauchy and by Lagrange for computing bounds on the positive roots of polynomials. From the experimental results we conclude that it would be advantageous to extend our theorem so that it works without any restrictive conditions(1).", "paper_title": "A comparison of various methods for computing bounds for positive roots of polynomials", "paper_id": "WOS:000248034100002"}