{"auto_keywords": [{"score": 0.04798652790106826, "phrase": "mobile_chargers"}, {"score": 0.006651629633506744, "phrase": "covering_utility"}, {"score": 0.00481495049065317, "phrase": "maximizing_coverage"}, {"score": 0.004553510708976456, "phrase": "wireless_rechargeable_sensor_networks"}, {"score": 0.0041642891310893, "phrase": "performance_requirement"}, {"score": 0.0034630606658026595, "phrase": "predetermined_paths"}, {"score": 0.003348838095597268, "phrase": "perfect_priori_information"}, {"score": 0.0030794433253250476, "phrase": "on-demand_way"}, {"score": 0.002800158709933889, "phrase": "mobile_charger"}, {"score": 0.0025604233506352375, "phrase": "event_monitoring"}, {"score": 0.0024897902536499005, "phrase": "scheduling_problem"}, {"score": 0.002189105604712615, "phrase": "multiple_mobile_chargers_case"}, {"score": 0.0021049977753042253, "phrase": "extensive_simulations"}], "paper_keywords": ["Wireless rechargeable sensor networks", " Mobile charger", " Event monitoring", " Scheduling", " Covering utility"], "paper_abstract": "Using mobile chargers in wireless rechargeable sensor networks is an option for charging all the nodes in the network. In order to achieve some performance requirement such as coverage, it is necessary to effectively schedule the mobile chargers to serve every node of the network. We notice that nearly all previous works on mobile charger scheduling assume that mobile chargers move along predetermined paths which are computed based on perfect priori information. In this paper, we consider the problem of scheduling mobile chargers in an on-demand way to maximize the covering utility. On receiving re-charging requests from the nodes, the mobile charger decides how to move itself. The covering utility is defined to quantify the effectiveness of event monitoring. We formulate the scheduling problem as an optimization one. We propose three heuristics for this problem after proving its NP-Completeness. We further generalize our solutions to accommodate the multiple mobile chargers case. Finally we evaluate our solutions through extensive simulations.", "paper_title": "Effective On-Demand Mobile Charger Scheduling for Maximizing Coverage in Wireless Rechargeable Sensor Networks", "paper_id": "WOS:000340595900011"}