{"auto_keywords": [{"score": 0.025475128749481404, "phrase": "roadmapping_process"}, {"score": 0.00481495049065317, "phrase": "technology_roadmapping"}, {"score": 0.004775335634705251, "phrase": "fuzzy_promethee._roadmapping"}, {"score": 0.004677711903652145, "phrase": "strategic_planning"}, {"score": 0.004378469469879815, "phrase": "strategic_programs"}, {"score": 0.004031082737449308, "phrase": "generic_roadmap"}, {"score": 0.0034306925765832633, "phrase": "different_tools"}, {"score": 0.0031845067058084583, "phrase": "upper_or_lower_layer_decisions"}, {"score": 0.003093595537995837, "phrase": "fuzzy_promethee_method"}, {"score": 0.002709862658377861, "phrase": "related_layer"}, {"score": 0.0024232694434408093, "phrase": "promethee_approach"}, {"score": 0.002363806685815014, "phrase": "input_data"}, {"score": 0.002315367926547472, "phrase": "linguistic_terms"}, {"score": 0.0022306602656266545, "phrase": "fuzzy_promethee"}, {"score": 0.002175913488493802, "phrase": "integrated_decision_making"}, {"score": 0.0021490449563443025, "phrase": "wind_turbine"}, {"score": 0.0021049977753042253, "phrase": "real_case"}], "paper_keywords": ["Technology roadmapping", " integrating decisions", " strategic planning", " Fuzzy-PROMETHEE", " decision making method", " wind turbine"], "paper_abstract": "Roadmapping, a tool of strategic planning, visualize where and how an organization will be in the future. Visualization of strategic programs assists people in the organization to understand the strategy which is a key for implementing strategy successfully. A generic roadmap is included of three main layers such as; market, product and technology. Decision making in each layer are done separately because of the nature of each layer. Therefore, decisions in roadmapping can be done with different tools. Whiles, decisions in each layer of the roadmap cannot be done without considering the upper or lower layer decisions. In this study we propose Fuzzy PROMETHEE method for integrating decisions in roadmapping. In this method, alternatives are in terms of ordered triple (technology, product, market) which are determined by analyzing each of related layer by considering other layers. Some criteria have been recognized by analyzing the strategies as well. Decisions across the layers of the roadmap are modeled in PROMETHEE approach during the roadmapping process. The input data are in terms of linguistic terms. So, we have considered a revised Fuzzy PROMETHEE method. This paper addresses integrated decision making applicability for wind turbine in roadmapping process as a real case.", "paper_title": "Developing a model for integrating decisions in technology roadmapping by fuzzy PROMETHEE", "paper_id": "WOS:000329926600009"}