{"auto_keywords": [{"score": 0.04602278391010143, "phrase": "cantilever_beam"}, {"score": 0.015719716506582538, "phrase": "uv-liga_technology"}, {"score": 0.013531915567404797, "phrase": "planar_coils"}, {"score": 0.013363775059018812, "phrase": "permanent_magnets"}, {"score": 0.004724708238414131, "phrase": "fast_switching_electromagnetic_microactuator"}, {"score": 0.003717368939083015, "phrase": "electromagnetic_actuation"}, {"score": 0.003174464741377186, "phrase": "coupled_electromagnetic-mechanical_fem-simulation"}, {"score": 0.003134613420865485, "phrase": "ansys"}, {"score": 0.0030563953060027175, "phrase": "working_mechanism"}, {"score": 0.002481085648977411, "phrase": "current_pulse"}, {"score": 0.0023438664524018634, "phrase": "actuator's_switching"}, {"score": 0.002256619934086924, "phrase": "switching_time"}], "paper_keywords": ["MEMS", " microactuator", " bistable electromagnetic actuation", " UV-LIGA technology", " simulation"], "paper_abstract": "A fast switching electromagnetic microactuator with two stable positions is presented. The actuator consists of a cantilever beam with two free ends, a torsional beam with two fixed ends, planar coils and permanent magnets. The cantilever beam has two stable positions due to the use of the permanent magnets. With electromagnetic actuation arising from the planar coils, the cantilever beam will switch from one stable position to the other. The behaviour of the microactuator is studied using a coupled electromagnetic-mechanical FEM-simulation with ANSYS software. The working mechanism for the bistability of the actuator is analysed. The device with a size of 2.0 mm x 2.2 mm is fabricated by UV-LIGA technology using sacrificial layer. The results of test show that a current pulse with an amplitude of 50 mA is needed for actuator's switching between two stable states, and the switching time is approximately 20 mu s. The displacement of the end of cantilever is about 17 mu m. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A fast switching bistable electromagnetic microactuator fabricated by UV-LIGA technology", "paper_id": "WOS:000244960700008"}