{"auto_keywords": [{"score": 0.026402798964085514, "phrase": "haldane"}, {"score": 0.00481495049065317, "phrase": "coherent_predictive_inference"}, {"score": 0.00475437061368627, "phrase": "imprecise_probabilities"}, {"score": 0.004724365740062236, "phrase": "coherent_reasoning"}, {"score": 0.004577145044601205, "phrase": "coherent_sets"}, {"score": 0.004548253531664032, "phrase": "desirable_gambles"}, {"score": 0.004215397034321004, "phrase": "coherent_conditional_probabilities"}, {"score": 0.0037610536973798113, "phrase": "bernstein_coherent_cones"}, {"score": 0.00373729411492695, "phrase": "multivariate_polynomials"}, {"score": 0.0036553070575015344, "phrase": "category_set"}, {"score": 0.0035978443860856216, "phrase": "powerful_generalisation"}, {"score": 0.0035751121405295026, "phrase": "de_finetti's_representation_theorem"}, {"score": 0.0034526191487098093, "phrase": "inference_system"}, {"score": 0.0033768559933238665, "phrase": "bernstein_coherent_cone"}, {"score": 0.00332375606483146, "phrase": "finite_category_set"}, {"score": 0.0030704837930305745, "phrase": "particular_examples"}, {"score": 0.002965229277927781, "phrase": "walley's_representation_invariance"}, {"score": 0.002845466319548362, "phrase": "inference_systems"}, {"score": 0.0027305272327742642, "phrase": "skeptically_cautious_inference_system"}, {"score": 0.002645275369581765, "phrase": "walley"}, {"score": 0.0026285611181040927, "phrase": "bernard"}, {"score": 0.0022572213326336374, "phrase": "proper_priors"}, {"score": 0.0022146486355422244, "phrase": "haldane's_improper_one"}, {"score": 0.0021659920594094407, "phrase": "additional_inference_principle"}, {"score": 0.0021251363422701446, "phrase": "uniquely_the_immediate_predictions"}, {"score": 0.0021049977753042253, "phrase": "idmm_inference_systems"}], "paper_keywords": [""], "paper_abstract": "Coherent reasoning under uncertainty can be represented in a very general manner by coherent sets of desirable gambles. In a context that does not allow for indecision, this leads to an approach that is mathematically equivalent to working with coherent conditional probabilities. If we do allow for indecision, this leads to a more general foundation for coherent (imprecise-) probabilistic inference. In this framework, and for a given finite category set, coherent predictive inference under exchangeability can be represented using Bernstein coherent cones of multivariate polynomials on the simplex generated by this category set. This is a powerful generalisation of de Finetti's Representation Theorem allowing for both imprecision and indecision. We define an inference system as a map that associates a Bernstein coherent cone of polynomials with every finite category set. Many inference principles encountered in the literature can then be interpreted, and represented mathematically, as restrictions on such maps. We discuss, as particular examples, two important inference principles: representation insensitivity-a strengthened version of Walley's representation invariance-and specificity. We show that there is an infinity of inference systems that satisfy these two principles, amongst which we discuss in particular the skeptically cautious inference system, the inference systems corresponding to (a modified version of) Walley and Bernard's Imprecise Dirichlet Multinomial Models (IDMM), the skeptical IDMM inference systems, and the Haldane inference system. We also prove that the latter produces the same posterior inferences as would be obtained using Haldane's improper prior, implying that there is an infinity of proper priors that produce the same coherent posterior inferences as Haldane's improper one. Finally, we impose an additional inference principle that allows us to characterise uniquely the immediate predictions for the IDMM inference systems.", "paper_title": "Coherent Predictive Inference under Exchangeability with Imprecise Probabilities", "paper_id": "WOS:000350466500001"}