{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computerized_physician_order_entry"}, {"score": 0.0047145329604366395, "phrase": "computerized_physician_order_entry_systems"}, {"score": 0.004067635935640407, "phrase": "computerized_physician_order_entry_system"}, {"score": 0.003949280009382125, "phrase": "exploratory_design"}, {"score": 0.003850566273995209, "phrase": "adult_icu"}, {"score": 0.003568932067237836, "phrase": "computerized_physician_order_entry-based_medication_delivery"}, {"score": 0.0032800186243040663, "phrase": "total_time"}, {"score": 0.003091767402370757, "phrase": "pediatric_unit"}, {"score": 0.00297647673291169, "phrase": "pediatric_patients"}, {"score": 0.0027819985260847577, "phrase": "greater_time"}, {"score": 0.0026895647154863405, "phrase": "frequent_barriers"}, {"score": 0.0025674490885184173, "phrase": "system_issues"}, {"score": 0.0023996317685956213, "phrase": "medication_dosage"}, {"score": 0.00231987280116332, "phrase": "healthcare_team"}, {"score": 0.002261794227418188, "phrase": "informal_communication_modes"}, {"score": 0.0022238834225283594, "phrase": "nursing_workflow_improvement"}], "paper_keywords": ["Computerized physician order entry", " Informatics", " Medication administration"], "paper_abstract": "The benefits of computerized physician order entry systems have been described widely; however, the impact of computerized physician order entry on nursing workflow and its potential for error are unclear. The purpose of this study was to determine the impact of a computerized physician order entry system on nursing workflow. Using an exploratory design, nurses employed on an adult ICU (n = 36) and a general pediatric unit (n = 50) involved in computerized physician order entry-based medication delivery were observed. Nurses were also asked questions regarding the impact of computerized physician order entry on nursing workflow. Observations revealed total time required for administering medications averaged 8.45 minutes in the ICU and 9.93 minutes in the pediatric unit. Several additional steps were required in the process for pediatric patients, including preparing the medications and communicating with patients and family, which resulted in greater time associated with the delivery of medications. Frequent barriers to workflow were noted by nurses across settings, including system issues (ie, inefficient medication reconciliation processes, long order sets requiring more time to determine medication dosage), less frequent interaction between the healthcare team, and greater use of informal communication modes. Areas for nursing workflow improvement include (1) medication reconciliation/order duplication, (2) strategies to improve communication, and (3) evaluation of the impact of computerized physician order entry on practice standards.", "paper_title": "Nursing Medication Administration and Workflow Using Computerized Physician Order Entry", "paper_id": "WOS:000294417300005"}