{"auto_keywords": [{"score": 0.038790358415572296, "phrase": "pst_architecture"}, {"score": 0.00481495049065317, "phrase": "important_issue"}, {"score": 0.004227209809791869, "phrase": "post-silicon_skew"}, {"score": 0.004039995317682942, "phrase": "pvt_variations"}, {"score": 0.003817548980308163, "phrase": "considerable_discussion"}, {"score": 0.0037532257703888315, "phrase": "basic_idea"}, {"score": 0.003313380246267815, "phrase": "performance_issues"}, {"score": 0.0031308163228919773, "phrase": "testing_issues"}, {"score": 0.002975099633631871, "phrase": "variation_tolerance_ability"}, {"score": 0.002843180211561427, "phrase": "clock_skew"}, {"score": 0.0025673005153462707, "phrase": "efficient_fault_model"}, {"score": 0.0025239898026543964, "phrase": "physical_limitation"}, {"score": 0.0023313149689465386, "phrase": "novel_structures"}, {"score": 0.002279011030331704, "phrase": "manufacturing_faults"}], "paper_keywords": ["Post-silicon tuning", " testing", " timing optimization"], "paper_abstract": "Clock skew minimization that is an important issue in very large scale integration design has become difficult due to the presence of process, voltage, and temperature (PVT) variations. The post-silicon skew tuning (PST) technique with the ability to tolerate PVT variations, even after a chip is manufactured has generated considerable discussion. The basic idea of the PST architecture is to minimize the clock skew dynamically. Unlike most previous works that have focused on the implementation and the performance issues of a PST architecture, this paper focuses on the testing issues of a PST architecture. However, testing the variation tolerance ability of the PST architecture is difficult because the clock skew does not directly affect the functionality of a design. In this paper, we propose an efficient fault model considering the physical limitation of the devices for the PST architecture. In addition, we propose some novel structures to detect the manufacturing faults and increase the robustness of a PST architecture. Our experiment shows that with a little increase in overhead, we can achieve robustness.", "paper_title": "A Fault Detection and Tolerance Architecture for Post-Silicon Skew Tuning", "paper_id": "WOS:000356879200003"}