{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "web_page_menu_orientation"}, {"score": 0.004666756595735701, "phrase": "learning_disabilities"}, {"score": 0.004502943680955863, "phrase": "accessible_information"}, {"score": 0.004009074013302036, "phrase": "page_design"}, {"score": 0.003920476803132283, "phrase": "horizontal_or_vertical_contents_arrangement"}, {"score": 0.003601235776892337, "phrase": "one-word_dummy_menu_entries"}, {"score": 0.0034902664176377943, "phrase": "horizontal_or_vertical_grid"}, {"score": 0.0033079039414389833, "phrase": "word-search_type_activity"}, {"score": 0.003220315882881027, "phrase": "mixed_effects_models"}, {"score": 0.0031490944606172152, "phrase": "mean_search_times"}, {"score": 0.0027907771648224273, "phrase": "reading_exercise"}, {"score": 0.0025863375961196005, "phrase": "random_positions"}, {"score": 0.0024953686545818587, "phrase": "horizontal_menu"}, {"score": 0.002418393046947528, "phrase": "vertical_one"}, {"score": 0.0021049977753042253, "phrase": "important_website_design_implications"}], "paper_keywords": [""], "paper_abstract": "The Internet facilitates the provision of accessible information to people with learning disabilities. However, problems with navigation and retrieval represent a barrier for this cohort. This article addresses one aspect of page design, testing whether a horizontal or vertical contents arrangement facilitates faster access to content for people with learning disabilities. Participants were timed as they looked for one-word dummy menu entries appearing in various locations along a horizontal or vertical grid. The words corresponded to images shown at random in a word-search type activity. Results were analyzed using mixed effects models. Results showed that mean search times increased as the position shifted from left to right and from top to bottom. Thus, participants undertook the test as if it were a reading exercise, despite the images appearing in the center of the page and the words appearing at random positions. The research also suggests that a horizontal menu may be more effective than a vertical one, with the most important links placed on the left. The propensity to imbibe information serially (word-for-word) rather than to skim or look globally has important website design implications.", "paper_title": "Effect of Web Page Menu Orientation on Retrieving Information by People With Learning Disabilities", "paper_id": "WOS:000351395800003"}