{"auto_keywords": [{"score": 0.048734215142491696, "phrase": "malicious_activities"}, {"score": 0.00481495049065317, "phrase": "detect_and_report_malicious_domains"}, {"score": 0.00459165923324494, "phrase": "domain_name_service"}, {"score": 0.004175533280178052, "phrase": "dns_queries"}, {"score": 0.00351943459564054, "phrase": "exposure"}, {"score": 0.003355515315708125, "phrase": "real_time"}, {"score": 0.0031693980719538287, "phrase": "controlled_experiment"}, {"score": 0.003051073364818384, "phrase": "dns_requests"}, {"score": 0.0030078460113945136, "phrase": "extremely_positive_results"}, {"score": 0.002683304054823427, "phrase": "exposure_system"}, {"score": 0.0022287497627555895, "phrase": "ip_addresses"}, {"score": 0.0021352776064254195, "phrase": "daily_basis"}, {"score": 0.0021049977753042253, "phrase": "service_web_page"}], "paper_keywords": ["Domain name system", " malicious domains", " machine learning"], "paper_abstract": "A wide range of malicious activities rely on the domain name service (DNS) to manage their large, distributed networks of infected machines. As a consequence, the monitoring and analysis of DNS queries has recently been proposed as one of the most promising techniques to detect and blacklist domains involved in malicious activities (e.g., phishing, spam, botnets command-and-control, etc.). EXPOSURE is a system we designed to detect such domains in real time, by applying 15 unique features grouped in four categories. We conducted a controlled experiment with a large, real-world dataset consisting of billions of DNS requests. The extremely positive results obtained in the tests convinced us to implement our techniques and deploy it as a free, online service. In this article, we present the EXPOSURE system and describe the results and lessons learned from 17 months of its operation. Over this amount of time, the service detected over 100K malicious domains. The statistics about the time of usage, number of queries, and target IP addresses of each domain are also published on a daily basis on the service Web page.", "paper_title": "EXPOSURE: A Passive DNS Analysis Service to Detect and Report Malicious Domains", "paper_id": "WOS:000336007700002"}