{"auto_keywords": [{"score": 0.040940350360074255, "phrase": "intervention_group"}, {"score": 0.02298908865765566, "phrase": "chica_system"}, {"score": 0.02017178335004404, "phrase": "tb"}, {"score": 0.01572887098724889, "phrase": "iron-deficiency_anemia"}, {"score": 0.008086583336151209, "phrase": "control_group"}, {"score": 0.007206730225492083, "phrase": "positive_risk_factors"}, {"score": 0.006911223495486082, "phrase": "ci"}, {"score": 0.00481495049065317, "phrase": "pediatric_conditions"}, {"score": 0.004616859702338596, "phrase": "electronic-medical-record_system"}, {"score": 0.0045208777171271254, "phrase": "disease_management"}, {"score": 0.00436530211426514, "phrase": "chica's_ability"}, {"score": 0.004229847379280629, "phrase": "screening_criteria"}, {"score": 0.004055730085399621, "phrase": "design_children"}, {"score": 0.00379452936798156, "phrase": "iron-deficiency_risk"}, {"score": 0.003715579364728729, "phrase": "tailored_prompt"}, {"score": 0.0035129562812850784, "phrase": "generic_prompt"}, {"score": 0.0030319482153908037, "phrase": "far_fewer_parents"}, {"score": 0.003010757286626405, "phrase": "risk_factors"}, {"score": 0.002896819408461957, "phrase": "significantly_higher_detection_rates"}, {"score": 0.0021049977753042253, "phrase": "time-consuming_process"}], "paper_keywords": [""], "paper_abstract": "Objective The Child Health Improvement through Computer Automation (CHICA) system is a decision-support and electronic-medical-record system for pediatric health maintenance and disease management. The purpose of this study was to explore CHICA's ability to screen patients for disorders that have validated screening criteria specifically tuberculosis (TB) and iron-deficiency anemia. Design Children between 0 and 11 years were randomized by the CHICA system. In the intervention group, parents were asked about TB and iron-deficiency risk, and physicians received a tailored prompt. In the control group, no screens were performed, and the physician received a generic prompt about these disorders. Results 1123 participants were randomized to the control group and 1116 participants to the intervention group. Significantly more people reported positive risk factors for iron-deficiency anemia in the intervention group (17.5% vs 3.1%, OR 6.6, 95% CI 4.5 to 9.5). In general, far fewer parents reported risk factors for TB than for iron-deficiency anemia. Again, there were significantly higher detection rates of positive risk factors in the intervention group (1.8% vs 0.8%, OR 2.3, 95% CI 1.0 to 5.0). Limitations It is possible that there may be more positive screens without improving outcomes. However, the guidelines are based on studies that have evaluated the questions the authors used as sensitive and specific, and there is no reason to believe that parents misunderstood them. Conclusions Many screening tests are risk-based, not universal, leaving physicians to determine who should have a further workup. This can be a time-consuming process. The authors demonstrated that the CHICA system performs well in assessing risk automatically for TB and iron-deficiency anemia.", "paper_title": "Targeted screening for pediatric conditions with the CHICA system", "paper_id": "WOS:000292061700021"}