{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "colour_texture_classification_schemes"}, {"score": 0.03794869647631241, "phrase": "colour_texture_images"}, {"score": 0.004513255056769647, "phrase": "classification_schemes"}, {"score": 0.0043804319008535555, "phrase": "colour_texture_classification"}, {"score": 0.0040449598280454645, "phrase": "colour_texture_image_sets"}, {"score": 0.003716520760680603, "phrase": "classification_results"}, {"score": 0.003380791705551809, "phrase": "higher_rate"}, {"score": 0.003347259612209552, "phrase": "well-classified_images"}, {"score": 0.0032975819773787985, "phrase": "colour_texture_features"}, {"score": 0.003152915289414825, "phrase": "texture_information"}, {"score": 0.0028394925080958205, "phrase": "colour_texture_classification_algorithms"}, {"score": 0.00256993314099902, "phrase": "original_image"}, {"score": 0.002457110101089137, "phrase": "biased_classification_results"}, {"score": 0.0023259039577313294, "phrase": "nearest_neighbour"}, {"score": 0.0022573076362326135, "phrase": "new_relevant_image_test_suite"}, {"score": 0.002136747803494932, "phrase": "validating_sub-images"}, {"score": 0.0021049977753042253, "phrase": "different_original_images"}], "paper_keywords": ["Benchmark colour texture test suite", " Supervised classification", " OuTex", " VisTex"], "paper_abstract": "Several image test suites are available in the literature to evaluate the performance of classification schemes. In the framework of colour texture classification, OuTex-TC-00013 (OuTex) and Contrib-TC-00006 (VisTex) are often used. These colour texture image sets have allowed the accuracies reached by many classification schemes to be compared. However, by analysing the classification results obtained with these two sets of colour texture images, we have noticed that the use of colour histogram yields a higher rate of well-classified images compared to colour texture features. It does not take into account any texture information in the image, this incoherence leads us to question the relevance of these two benchmark colour texture sets for measuring the performances of colour texture classification algorithms. Indeed, the partitioning used to build these two sets consists of extracting training and validating sub-images of an original image. We show that such partitioning leads to biased classification results when it is combined with a classifier such as the nearest neighbour. In this paper a new relevant image test suite is proposed for evaluating colour texture classification schemes. The training and the validating sub-images come from different original images in order to ensure that the correlation of the colour texture images is minimized.", "paper_title": "A new benchmark image test suite for evaluating colour texture classification schemes", "paper_id": "WOS:000336807300025"}