{"auto_keywords": [{"score": 0.0459832803755573, "phrase": "potential_partners"}, {"score": 0.0238553750628882, "phrase": "iasu_model"}, {"score": 0.00481495049065317, "phrase": "alternative_candidate_partners"}, {"score": 0.0046593017130868, "phrase": "appropriate_partners"}, {"score": 0.003916098498242888, "phrase": "reputation_systems"}, {"score": 0.0035648266669315943, "phrase": "hard_optimization_problem"}, {"score": 0.0034657012607680203, "phrase": "statistical_model"}, {"score": 0.003154701855951328, "phrase": "uncertain_world"}, {"score": 0.002675914969626753, "phrase": "expected_gain"}, {"score": 0.002613709503583786, "phrase": "iasu"}, {"score": 0.0024586427394152196, "phrase": "additional_information"}, {"score": 0.0024014759148123736, "phrase": "empirical_studies"}, {"score": 0.0023678143146455017, "phrase": "simulation_domain"}, {"score": 0.0023127544795063263, "phrase": "real-world_domain"}, {"score": 0.0021049977753042253, "phrase": "agents'_overall_utility"}], "paper_keywords": ["Experimentation", " Decision theory", " multi-agent systems", " AI technologies"], "paper_abstract": "Many multi-agent settings require that agents identify appropriate partners or teammates with whom to work on tasks. When selecting potential partners, agents may benefit from obtaining information about the alternatives, for instance, through gossip (i.e., by consulting others) or reputation systems. When information is uncertain and associated with cost, deciding on the amount of information needed is a hard optimization problem. This article defines a statistical model, the Information-Acquisition Source Utility model (IASU), by which agents, operating in an uncertain world, can determine (1) which information sources they should request for information, and (2) the amount of information to collect about potential partners from each source. To maximize the expected gain from the choice, IASU computes the utility of choosing a partner by estimating the benefit of additional information. The article presents empirical studies through a simulation domain as well as a real-world domain of restaurants. We compare the IASU model to other relevant models and show that the use of the IASU model significantly increases agents' overall utility.", "paper_title": "A Framework for Effectively Choosing between Alternative Candidate Partners", "paper_id": "WOS:000335576200009"}