{"auto_keywords": [{"score": 0.04539751403115773, "phrase": "secret_image"}, {"score": 0.004522495102690201, "phrase": "vc"}, {"score": 0.004420472010542188, "phrase": "secret_sharing_scheme"}, {"score": 0.0033811403330431897, "phrase": "dynamic_user_group"}, {"score": 0.0031573626285069157, "phrase": "user_changes"}, {"score": 0.0029483516334882862, "phrase": "probabilistic_model"}, {"score": 0.002898291237210567, "phrase": "proposed_scheme"}, {"score": 0.002753138528582461, "phrase": "new_transparencies"}, {"score": 0.0026604207233593973, "phrase": "original_transparencies"}, {"score": 0.002585539416877115, "phrase": "extended_vc_scheme"}, {"score": 0.0025416235470290286, "phrase": "basis_matrices"}, {"score": 0.002359759876402679, "phrase": "fundamental_definitions"}, {"score": 0.0021049977753042253, "phrase": "derived_equation"}], "paper_keywords": ["Contrast", " random grids (RGs)", " secret sharing", " visual cryptography (VC)"], "paper_abstract": "The (t, n) visual cryptography (VC) is a secret sharing scheme where a secret image is encoded into transparencies, and the stacking of any out of transparencies reveals the secret image. The stacking of t-1 or fewer transparencies is unable to extract any information about the secret. We discuss the additions and deletions of users in a dynamic user group. To reduce the overhead of generating and distributing transparencies in user changes, this paper proposes a (t, n) VC scheme with unlimited based on the probabilistic model. The proposed scheme allows to change dynamically in order to include new transparencies without regenerating and redistributing the original transparencies. Specifically, an extended VC scheme based on basis matrices and a probabilisticmodel is proposed. An equation is derived from the fundamental definitions of the (t, n) VC scheme, and then the (t, infinity) VC scheme achieving maximal contrast can be designed by using the derived equation. The maximal contrasts with t = 2 to are explicitly solved in this paper.", "paper_title": "A Probabilistic Model of (t, n) Visual Cryptography Scheme With Dynamic Group", "paper_id": "WOS:000299440300007"}