{"auto_keywords": [{"score": 0.004417848254181138, "phrase": "ratio_enforcement_schemes"}, {"score": 0.004035946043145475, "phrase": "user-level_perspectives"}, {"score": 0.0038492126993451337, "phrase": "ratio_enforcement_policies"}, {"score": 0.0037834649508375544, "phrase": "system-wide_\"crunches"}, {"score": 0.0034562118159899772, "phrase": "theoretical_model"}, {"score": 0.003324743991757282, "phrase": "system_pathologies"}, {"score": 0.0032538723984338615, "phrase": "adaptive_credit_system"}, {"score": 0.0031982609080278643, "phrase": "credit_policies"}, {"score": 0.0031166151196841308, "phrase": "private_communities"}, {"score": 0.0028963961037320805, "phrase": "excessively_high_seeder-to-leecher_ratios"}, {"score": 0.002822434555587263, "phrase": "user-level_performance"}, {"score": 0.002622947550220266, "phrase": "average_downloading_speed"}, {"score": 0.0025230952890994236, "phrase": "long_seeding_times"}, {"score": 0.0025014259919355453, "phrase": "low_upload_capacity_utilizations"}, {"score": 0.00241658945942583, "phrase": "late_entrants"}, {"score": 0.0022168460543913787, "phrase": "social_sciences"}], "paper_keywords": ["Private community", " sharing ratio enforcement", " credit policy", " systemic risk", " demand and supply"], "paper_abstract": "Many peer-to-peer communities, including private BitTorrent communities that serve hundreds of thousands of users, utilize credit-based or sharing ratio enforcement schemes to incentivize their members to contribute. In this paper, we analyze the performance of such communities from both the system-level and the user-level perspectives. We show that both credit-based and sharing ratio enforcement policies can lead to system-wide \"crunches\" or \"crashes,\" where the system seizes completely due to too little or too much credit, respectively. We present a theoretical model that identifies the conditions that lead to these system pathologies and we design an adaptive credit system that automatically adjusts credit policies to maintain sustainability. Given private communities that are sustainable, it has been demonstrated that they are greatly oversupplied in terms of excessively high seeder-to-leecher ratios. We further analyze the user-level performance by studying the effects of oversupply. We show that although achieving an increase in the average downloading speed, the phenomenon of oversupply has three undesired effects: long seeding times, low upload capacity utilizations, and an unfair playing field for late entrants into swarms. To alleviate these problems, we propose four different strategies, which have been inspired by ideas in social sciences and economics. We evaluate these strategies through simulations and demonstrate their positive effects.", "paper_title": "Systemic Risk and User-Level Performance in Private P2P Communities", "paper_id": "WOS:000326501400019"}