{"auto_keywords": [{"score": 0.041286674428067535, "phrase": "suitable_factories"}, {"score": 0.00481495049065317, "phrase": "perfect_maintenance"}, {"score": 0.0047747348769918, "phrase": "distributed_production_scheduling"}, {"score": 0.004559451202070545, "phrase": "ds_problems"}, {"score": 0.0045213598841171935, "phrase": "multi-factory_production"}, {"score": 0.004408976280483648, "phrase": "classical_scheduling_problems"}, {"score": 0.004122699822340296, "phrase": "higher_level"}, {"score": 0.003589404014552974, "phrase": "corresponding_production_schedules"}, {"score": 0.003456287408801543, "phrase": "system_efficiency"}, {"score": 0.003398714712611042, "phrase": "optimal_plan"}, {"score": 0.0033561632967173856, "phrase": "better_collaboration"}, {"score": 0.00323166859966514, "phrase": "machine_maintenance"}, {"score": 0.003138030910104256, "phrase": "production_scheduling"}, {"score": 0.0029463874016490976, "phrase": "machine's_availability"}, {"score": 0.0027317585060414253, "phrase": "modified_genetic_algorithm_approach"}, {"score": 0.00267495669519805, "phrase": "ds_models"}, {"score": 0.0026525671788921205, "phrase": "maintenance_consideration"}, {"score": 0.002270495425498003, "phrase": "machine_age"}, {"score": 0.002158780936704905, "phrase": "studied_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distributed scheduling", " Multi-factory production", " Production scheduling", " Perfect maintenance", " Genetic algorithms"], "paper_abstract": "Distributed Scheduling (DS) problems have attracted attention by researchers in recent years. DS problems in multi-factory production are much more complicated than classical scheduling problems because they involve not only the scheduling problems in a single factory, but also the problems in the higher level, which is: how to allocate the jobs to suitable factories. It mainly focuses on solving two issues simultaneously: (i) allocation of jobs to suitable factories and (ii) determination of the corresponding production schedules in each factory. Its objective is to maximize system efficiency by finding an optimal plan for a better collaboration among various processes. However, in many papers, machine maintenance has usually been ignored during the production scheduling. In reality, every machine requires maintenance, which will directly influence the machine's availability, and consequently the planned production schedule. The objective of this paper is to propose a modified genetic algorithm approach to deal with those DS models with maintenance consideration, aiming to minimize the makespan of the jobs. Its optimization performance has been compared with other existing approaches to demonstrate its reliability. This paper also tests the influence of the relationship between the maintenance repairing time and the machine age to the performance of scheduling of maintenance during DS in the studied models. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A modified genetic algorithm approach for scheduling of perfect maintenance in distributed production scheduling", "paper_id": "WOS:000271359500004"}