{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "weblog_success"}, {"score": 0.012874019672084874, "phrase": "blogging_tool"}, {"score": 0.00481495049065317, "phrase": "considerable_media_attention"}, {"score": 0.004767826806287385, "phrase": "leading_weblog_sites"}, {"score": 0.00447251540886613, "phrase": "highly_competitive_world"}, {"score": 0.004133940019630129, "phrase": "technology_perspective"}, {"score": 0.003993958025223994, "phrase": "weblog-building_technology"}, {"score": 0.003531474887552889, "phrase": "popularity_rank"}, {"score": 0.003247868216333148, "phrase": "technology_use"}, {"score": 0.0029576827451501956, "phrase": "technology_characteristics"}, {"score": 0.0028574164693918433, "phrase": "weblog_content"}, {"score": 0.0027741761880779535, "phrase": "social_interaction"}, {"score": 0.0026277995163948263, "phrase": "popularity_improvement"}, {"score": 0.0025014259919355474, "phrase": "techno-social_success_model"}, {"score": 0.0023928819778638055, "phrase": "weblog's_success"}], "paper_keywords": ["weblog (blog)", " blogging tool", " weblog success categories", " success model", " value proposition", " techno-social perspective"], "paper_abstract": "Weblogs have recently gained considerable media attention. Leading weblog sites are already attracting millions of visitors. Yet, success in the highly competitive world of weblogs is not easily achieved. This study seeks to explore weblog success from a technology perspective, i.e. from the impact of weblog-building technology (or blogging tool). Based on an examination of 126 highly successful weblogs tracked over a period of 3 months, we categorized weblogs in terms of popularity rank and growth, and evaluated the relationship between weblog success (in terms of popularity) and technology use. Our analysis indicates that weblog success is associated with the type of blogging tool used. We argue that technology characteristics affect the presentation and organization of weblog content, as well as the social interaction between bloggers, and in turn, affect weblog success or popularity improvement. Based on this analysis, we propose a techno-social success model for weblogs. This model postulates that a weblog's success is mainly associated with its ability to provide value for its users and readers at the content, the technology, and the social levels. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Weblog success: Exploring the role of technology", "paper_id": "WOS:000239224700002"}