{"auto_keywords": [{"score": 0.0478346656395465, "phrase": "mobile_bed"}, {"score": 0.00481495049065317, "phrase": "closure-independent_generalized_roe_solver"}, {"score": 0.0038487848937121204, "phrase": "possible_algebraic_closure_relations"}, {"score": 0.003727527379253624, "phrase": "relevant_eigenvalues"}, {"score": 0.003610094002081942, "phrase": "godunov"}, {"score": 0.0032272929113113203, "phrase": "specific_closure"}, {"score": 0.0031255543155487234, "phrase": "complete_closure-independent_way"}, {"score": 0.003010893527930816, "phrase": "quite_general_applicability"}, {"score": 0.002824005136794786, "phrase": "new_method"}, {"score": 0.0027349450784503273, "phrase": "original_one"}, {"score": 0.0023549822490693344, "phrase": "straightforward_determination"}, {"score": 0.0021735890994119757, "phrase": "proposed_numerical_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Two-phase flows", " Mobile-bed", " Nonconservative equations", " Closure equations", " Riemann problem", " Generalized Roe solver", " Well-balancing", " Multiple Averages"], "paper_abstract": "Several different natural phenomena can be studied in the framework of free-surface, two-phase flows over mobile bed. Mathematically, they can be described by the same set of highly nonlinear, hyperbolic nonconservative PDEs but they differ in the possible algebraic closure relations. These affect significantly the relevant eigenvalues and consequently, all finite-volume numerical methods based on upwind Godunov-type fluxes. In this work the Generalized Roe solver, introduced in [29] for the case of a specific closure, is reformulated in a complete closure-independent way. This gives the solver a quite general applicability to the class of problems previously mentioned. Moreover, the new method maintains all the desirable features shown by the original one: full two-dimensionality and exact well-balanceness. This result is made possible thanks to the development of a novel Multiple Averages (MAs) approach that allows a straightforward determination of the matrices required by the solver. Several tests show the capabilities of the proposed numerical strategy. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A closure-independent Generalized Roe solver for free-surface, two-phase flows over mobile bed", "paper_id": "WOS:000325527100018"}