{"auto_keywords": [{"score": 0.049215829826051515, "phrase": "healthcare_standards"}, {"score": 0.03719670841703432, "phrase": "iso's_metamodel"}, {"score": 0.015719716506582538, "phrase": "metadata_registries"}, {"score": 0.004609175313390942, "phrase": "empirical_medical_research"}, {"score": 0.004460609967916904, "phrase": "study_data"}, {"score": 0.004332559296185432, "phrase": "semantic_interoperability"}, {"score": 0.004192872425727907, "phrase": "data_element_collections"}, {"score": 0.0040135756033094225, "phrase": "german_metadata_repository"}, {"score": 0.003984444229875069, "phrase": "empirical_research"}, {"score": 0.003870009704443373, "phrase": "\"information_technology_-_metadata_registries"}, {"score": 0.0036375920152538783, "phrase": "first_step"}, {"score": 0.0034315678891900184, "phrase": "different_healthcare_standards"}, {"score": 0.003381905288924267, "phrase": "second_step"}, {"score": 0.003260860308644701, "phrase": "prototypical_database_implementation"}, {"score": 0.0031903162513050804, "phrase": "flat_structure"}, {"score": 0.0031671412657333364, "phrase": "disease_registries"}, {"score": 0.0031099353574309606, "phrase": "controlled_vocabularies"}, {"score": 0.0029551803384781604, "phrase": "reference_models"}, {"score": 0.00293370839211022, "phrase": "electronic_health_records"}, {"score": 0.0028286597212365504, "phrase": "logical_reconstruction"}, {"score": 0.0026586145364395544, "phrase": "correct_linkage"}, {"score": 0.002264364091368269, "phrase": "obvious_strength"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Controlled vocabularies", " Semantic interoperability", " Metadata registry", " ISO/IEC 11179", " Reference model"], "paper_abstract": "In order to support empirical medical research concerning reuse and improvement of the expressiveness of study data and hence promote syntactic as well as semantic interoperability, services are required for the maintenance of data element collections. As part of the project for the implementation of a German metadata repository for empirical research we assessed the ability of ISO/IEC 11179 \"Information technology - Metadata registries (MDR)\" part 3 edition 3 Final Committee Draft \"Registry metamodel and basic attributes\" to represent healthcare standards. First step of the evaluation was a reformulation of ISO's metamodel with the terms and structures of the different healthcare standards. In a second step, we imported instances of the healthcare standards into a prototypical database implementation representing ISO's metamodel. Whereas the flat structure of disease registries as well as some controlled vocabularies could be easily mapped to the ISO's metamodel, complex structures as used in reference models of electronic health records or classifications could be not exhaustively represented. A logical reconstruction of an application will be needed in order to represent them adequately. Moreover, the correct linkage between elements from ISO/IEC 11179 edition 3 and concepts of classifications remains unclear. We also observed some restrictions of ISO/IEC 11179 edition 3 concerning the representation of items of the Operational Data Model from the Clinical Data Interchange Standards Consortium, which might be outside the scope of a MDR. Thus, despite the obvious strength of the ISO/IEC 11179 edition 3 for metadata registries, some issues should be considered in its further development. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "The ISO/IEC 11179 norm for metadata registries: Does it cover healthcare standards in empirical research?", "paper_id": "WOS:000317322500012"}