{"auto_keywords": [{"score": 0.046273829908275756, "phrase": "grey_linear_regression_model"}, {"score": 0.006815251966040323, "phrase": "parameter_identification"}, {"score": 0.004814959787302543, "phrase": "grey"}, {"score": 0.004665764181113345, "phrase": "purpose_-_the_purpose"}, {"score": 0.004485735417293941, "phrase": "parameter_estimation"}, {"score": 0.004312622975366672, "phrase": "development_coefficient"}, {"score": 0.004195418010131832, "phrase": "sequence_data"}, {"score": 0.004129873531628877, "phrase": "short-term_traffic_flow"}, {"score": 0.0036697319652557363, "phrase": "modelling_mechanism"}, {"score": 0.003541923233726252, "phrase": "original_form"}, {"score": 0.003405109584265324, "phrase": "estimation_method"}, {"score": 0.0031100973266506163, "phrase": "new_method"}, {"score": 0.0025436978068459565, "phrase": "urban_road_short-time_traffic_flow"}, {"score": 0.002455009746748708, "phrase": "complicated_problems"}, {"score": 0.00241658945942583, "phrase": "parameter_estimation_computation"}, {"score": 0.002323142666222693, "phrase": "representation_forms"}, {"score": 0.0021049977753042253, "phrase": "short-term_traffic_flow_prediction"}], "paper_keywords": ["Grey linear regression model", " Parameter estimation", " Development coefficient", " Short-term traffic flow prediction", " Regression analysis", " Forecasting"], "paper_abstract": "Purpose - The purpose of this paper is to simplify the computation of parameter estimation in the grey linear regression model and solve the problem that the development coefficient could not be computed in some sequence data, such as short-term traffic flow. Design/methodology/approach - Starting from the limitation that can be identified in the equation and analyzing the range using the method to estimate parameters, this paper researches the modelling mechanism and the other forms which are equivalent with the original form. At the same time, this paper gives an estimation method and gets the relationship in various forms and the relationship between the model and GM(1,1) model. Findings - For the grey linear regression model, there exists a new method of parameter identification and three other forms as follows: the original form, the Whitenization equation and the connotation form. Practical implications - The method of parameter identification exposed in the paper expanded the scope of the application of the grey linear regression model, and it can be used to model and forecast the urban road short-time traffic flow. Originality/value - This paper has solved some complicated problems such as the parameter estimation computation in the grey linear regression model. In addition, three kinds of representation forms of the model and its relationship between the model and GM(1,1) have also been presented. Finally, its application of the model in a short-term traffic flow prediction has shown its superiority.", "paper_title": "Grey linear regression model and its application", "paper_id": "WOS:000308840600010"}