{"auto_keywords": [{"score": 0.04064451133916651, "phrase": "group_foreground"}, {"score": 0.03311476918642651, "phrase": "camera_viewpoints"}, {"score": 0.015719716506582538, "phrase": "crowded_areas"}, {"score": 0.015583175818709253, "phrase": "local_empirical_templates"}, {"score": 0.013910935507327084, "phrase": "single_pedestrians"}, {"score": 0.011918844471642891, "phrase": "density_ratio"}, {"score": 0.010760641158664559, "phrase": "density_ratios"}, {"score": 0.004083787598482644, "phrase": "similar_features"}, {"score": 0.00396538027397194, "phrase": "unknown_scenes"}, {"score": 0.0035877953744599296, "phrase": "local_scale_normalization"}, {"score": 0.0032460470691682074, "phrase": "different_number"}, {"score": 0.0030156459374311856, "phrase": "typical_occluded-people_patterns"}, {"score": 0.0029715605634810793, "phrase": "human_proximity"}, {"score": 0.002776901769295673, "phrase": "computed_density_ratios"}, {"score": 0.0027282473656358784, "phrase": "density_ratio_bounds"}, {"score": 0.0026646947804608617, "phrase": "offline_learning_phase"}, {"score": 0.002541985129210362, "phrase": "online_settings"}, {"score": 0.0024392472592460004, "phrase": "humans'_proximity"}, {"score": 0.0022593125871715894, "phrase": "good_accuracy"}, {"score": 0.0022460329080075648, "phrase": "frame_rate"}, {"score": 0.002200164358389725, "phrase": "small_amount"}, {"score": 0.0021872315757161644, "phrase": "computing_resources"}, {"score": 0.002142561289952531, "phrase": "competitive_results"}], "paper_keywords": ["local empirical templates", " local density ratios", " density ratio bounds", " people counting"], "paper_abstract": "In this paper, a fast and automated method of counting pedestrians in crowded areas is proposed along with three contributions. We firstly propose Local Empirical Templates (LET), which are able to outline the foregrounds, typically made by single pedestrians in a scene. LET are extracted by clustering foregrounds of single pedestrians with similar features in silhouettes. This process is done automatically for unknown scenes. Secondly, comparing the size of group foreground made by a group of pedestrians to that of appropriate LET captured in the same image patch with the group foreground produces the density ratio. Because of the local scale normalization between sizes, the density ratio appears to have a bound closely related to the number of pedestrians who induce the group foreground. Finally, to extract the bounds of density ratios for groups of different number of pedestrians, we propose a 3D human models based simulation in which camera viewpoints and pedestrians' proximity are easily manipulated. We collect hundreds of typical occluded-people patterns with distinct degrees of human proximity and under a variety of camera viewpoints. Distributions of density ratios with respect to the number of pedestrians are built based on the computed density ratios of these patterns for extracting density ratio bounds. The simulation is performed in the offline learning phase to extract the bounds from the distributions, which are used to count pedestrians in online settings. We reveal that the bounds seem to be invariant to camera viewpoints and humans' proximity. The performance of our proposed method is evaluated with our collected videos and PETS 2009's datasets. For our collected videos with the resolution of 320x240, our method runs in real-time with good accuracy and frame rate of around 30 fps, and consumes a small amount of computing resources. For PETS 2009's datasets, our proposed method achieves competitive results with other methods tested on the same datasets [1], [2].", "paper_title": "Real-Time Counting People in Crowded Areas by Using Local Empirical Templates and Density Ratios", "paper_id": "WOS:000306198700009"}