{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hybrid_method"}, {"score": 0.008937026027400312, "phrase": "inductive_method"}, {"score": 0.005819806620789951, "phrase": "medical_error_case"}, {"score": 0.004545598514506788, "phrase": "negative_impact"}, {"score": 0.00451491283266524, "phrase": "activity_performance"}, {"score": 0.004394218564523274, "phrase": "human_error"}, {"score": 0.00427673687759065, "phrase": "standard_method"}, {"score": 0.004176509019758331, "phrase": "qualitative_data"}, {"score": 0.0038242899532391914, "phrase": "deductive_and_inductive_methods"}, {"score": 0.003684332524184009, "phrase": "ethnographic_study"}, {"score": 0.003585761649472705, "phrase": "level_one_trauma_center"}, {"score": 0.0034311578789991363, "phrase": "informatics_tools"}, {"score": 0.003350679980619693, "phrase": "healthcare_quality"}, {"score": 0.0033280337910399104, "phrase": "patient_safety"}, {"score": 0.003195324728141602, "phrase": "deductive_a_priori_classification_framework"}, {"score": 0.003130961781562624, "phrase": "new_categories"}, {"score": 0.00304715054446383, "phrase": "inductive_process"}, {"score": 0.002905827490766696, "phrase": "grounded_theory"}, {"score": 0.002771040606604632, "phrase": "three-tiered_hierarchy"}, {"score": 0.0024029583021102255, "phrase": "hybrid_model"}, {"score": 0.00222249726328354, "phrase": "methodical_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["interruption", " activity", " qualitative methods", " categorization", " emergency department"], "paper_abstract": "Objective: Interruptions are known to have a negative impact on activity performance. Understanding how an interruption contributes to human error is limited because there is not a standard method for analyzing and classifying interruptions. Qualitative data are typically analyzed by either a deductive or an inductive method. Both methods have limitations. In this paper, a hybrid method was developed that integrates deductive and inductive methods for the categorization of activities and interruptions recorded during an ethnographic study of physicians and registered nurses in a Level One Trauma Center. Understanding the effects of interruptions is important for designing and evaluating informatics tools in particular as well as improving healthcare quality and patient safety in general. Method: The hybrid method was developed using a deductive a priori classification framework with the provision of adding new categories discovered inductively in the data. The inductive process utilized line-by-line coding and constant comparison as stated in Grounded Theory. Results: The categories of activities and interruptions were organized into a three-tiered hierarchy of activity. Validity and reliability of the categories were tested by categorizing a medical error case external to the study. No new categories of interruptions were identified during analysis of the medical error case. Conclusions: Findings from this study provide evidence that the hybrid model of categorization is more complete than either a deductive or an inductive method alone. The hybrid method developed in this study provides the methodical support for understanding, analyzing, and managing interruptions and workflow. (C) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Towards a hybrid method to categorize interruptions and activities in healthcare", "paper_id": "WOS:000251033200005"}