{"auto_keywords": [{"score": 0.04240480223896102, "phrase": "list_m-partitions"}, {"score": 0.012798330663429131, "phrase": "counting_list_m-partitions"}, {"score": 0.005986605270716112, "phrase": "matrix_m"}, {"score": 0.005324410992075842, "phrase": "derectangularizing_sequence"}, {"score": 0.00481495049065317, "phrase": "counting_list_matrix_partitions"}, {"score": 0.004756463788853192, "phrase": "symmetric_d_x_d_matrix_m"}, {"score": 0.004107780140913702, "phrase": "m."}, {"score": 0.0038448988429199086, "phrase": "weak_and_strong_perfect_graph_conjectures"}, {"score": 0.0037796097990025167, "phrase": "quite_a_bit"}, {"score": 0.003715425273229361, "phrase": "matrices_m_computations"}, {"score": 0.0034187896011435245, "phrase": "\"tractable\"_matrices"}, {"score": 0.0034104319298138407, "phrase": "m._we"}, {"score": 0.0033361232750221863, "phrase": "polynomial_time"}, {"score": 0.003239549357111286, "phrase": "data_structures"}, {"score": 0.003215844474909993, "phrase": "sparse-dense_partitions"}, {"score": 0.0031612033120065747, "phrase": "problem_instance"}, {"score": 0.003122741472032058, "phrase": "problem_instances"}, {"score": 0.0028873960943358546, "phrase": "resulting_restricted_instances"}, {"score": 0.002852256089630964, "phrase": "particular_counting_constraint_satisfaction_problems"}, {"score": 0.0027561164046279413, "phrase": "constraint_satisfaction_technique"}, {"score": 0.002573424607574822, "phrase": "explicit_characterization"}, {"score": 0.00255458149409373, "phrase": "dichotomy_theorem"}, {"score": 0.002511191804715511, "phrase": "fp"}, {"score": 0.0022603490477675118, "phrase": "np"}, {"score": 0.0021784745589727246, "phrase": "cardinality_restrictions"}, {"score": 0.0021678232353129472, "phrase": "m-partitions_problems"}, {"score": 0.002120531717855364, "phrase": "polynomial-time_algorithm"}, {"score": 0.0021049977753042253, "phrase": "homogeneous_pairs"}], "paper_keywords": ["counting problems", " complexity dichotomy", " #P-completeness", " graph algorithms", " matrix partitions of graphs"], "paper_abstract": "Given a symmetric D x D matrix M over {0, 1, *}, a list M-partition of a graph G is a partition of the vertices of G into D parts which are associated with the rows of M. The part of each vertex is chosen from a given list in such a way that no edge of G is mapped to a 0 in M and no nonedge of G is mapped to a 1 in M. Many important graph-theoretic structures can be represented as list M-partitions including graph colorings, split graphs, and homogeneous sets and pairs, which arise in the proofs of the weak and strong perfect graph conjectures. Thus, there has been quite a bit of work on determining for which matrices M computations involving list M-partitions are tractable. This paper focuses on the problem of counting list M-partitions, given a graph G and given a list for each vertex of G. We identify a certain set of \"tractable\" matrices M. We give an algorithm that counts list M-partitions in polynomial time for every (fixed) matrix M in this set. The algorithm relies on data structures such as sparse-dense partitions and subcube decompositions to reduce each problem instance to a sequence of problem instances in which the lists have a certain useful structure that restricts access to portions of M in which the interactions of 0s and 1s are controlled. We show how to solve the resulting restricted instances by converting them into particular counting constraint satisfaction problems (#CSPs), which we show how to solve using a constraint satisfaction technique known as arc-consistency. For every matrix M for which our algorithm fails, we show that the problem of counting list M-partitions is #P-complete. Furthermore, we give an explicit characterization of the dichotomy theorem: counting list M-partitions is tractable (in FP) if the matrix M has a structure called a derectangularizing sequence. If M has no derectangularizing sequence, we show that counting list M-partitions is #P-hard. We show that the metaproblem of determining whether a given matrix has a derectangularizing sequence is NP-complete. Finally, we show that list M-partitions can be used to encode cardinality restrictions in M-partitions problems, and we use this to give a polynomial-time algorithm for counting homogeneous pairs in graphs.", "paper_title": "COUNTING LIST MATRIX PARTITIONS OF GRAPHS", "paper_id": "WOS:000360654100007"}