{"auto_keywords": [{"score": 0.02892278386101692, "phrase": "u-i-r_collaborations"}, {"score": 0.00481495049065317, "phrase": "patenting_activities"}, {"score": 0.004731492618963217, "phrase": "industry-university-research_institutes"}, {"score": 0.004669887069870493, "phrase": "chinese"}, {"score": 0.004649499663417705, "phrase": "ict"}, {"score": 0.004470162491471095, "phrase": "china"}, {"score": 0.004373398434399966, "phrase": "china's_national_and_regional_innovation_system"}, {"score": 0.00407781620412982, "phrase": "innovation_performance"}, {"score": 0.004024651422626329, "phrase": "chinese_ict_industry"}, {"score": 0.003937573222812911, "phrase": "bibliometric_techniques"}, {"score": 0.003671338229632309, "phrase": "patent_outputs"}, {"score": 0.003529543381704363, "phrase": "primary_innovators"}, {"score": 0.0031636612155559267, "phrase": "great_importance"}, {"score": 0.0030951536886513567, "phrase": "domestic_enterprises"}, {"score": 0.0030281251520610604, "phrase": "patent_protection"}, {"score": 0.0029886047149545025, "phrase": "significant_improvements"}, {"score": 0.002949598537993663, "phrase": "chinese_ict_sector"}, {"score": 0.002835599469639296, "phrase": "main_body"}, {"score": 0.0028108690791085536, "phrase": "technological_innovation"}, {"score": 0.002228412982799273, "phrase": "research_institutes"}], "paper_keywords": ["Patent", " Collaboration", " Industry-university-research institute", " ICT"], "paper_abstract": "Few comprehensive and long time-span studies have examined the Information and Communication Technologies (ICT) sector in China and its implications for China's national and regional innovation system. Taking advantage of the patents granted by the State Intellectual Property Office of the People's Republic of China from 1985 to 2010, this paper examined innovation performance in the Chinese ICT industry with the help of bibliometric techniques. The analysis has been conducted from several perspectives, including the trend and character of patent outputs, the most prolific Chinese regions and their changes, the primary innovators and their type of institutions, and the collaboration among university (U)-industry (I)-research institutes (R). The results show that the great importance that the government and domestic enterprises attach to technology R&D and patent protection has brought significant improvements in the Chinese ICT sector, and enterprises have thus gradually become the main body of technological innovation in recent years. In terms of U-I-R collaborations, I-I collaborations are the most popular pattern, followed by U-I and I-R collaborations. In the last 20 years or so, U-I-R collaborations have improved, but they are still weak. In the future, U-I-R collaborations should be further reinforced, and more universities and research institutes should be encouraged to become involved in U-I-R collaborations to help enterprises enhance their innovative capabilities.", "paper_title": "An analysis of the patenting activities and collaboration among industry-university-research institutes in the Chinese ICT sector", "paper_id": "WOS:000329319200017"}