{"auto_keywords": [{"score": 0.046002094396147206, "phrase": "cpd"}, {"score": 0.00481495049065317, "phrase": "multisite_study"}, {"score": 0.004717325943509345, "phrase": "objective_clinical_documentation"}, {"score": 0.004637478829869904, "phrase": "medical_record"}, {"score": 0.004527947981009528, "phrase": "healthcare_and_business_processes"}, {"score": 0.00448179813172021, "phrase": "electronic_health_record_adoption"}, {"score": 0.004436116555817464, "phrase": "computerized_provider_documentation"}, {"score": 0.004331320910631647, "phrase": "primary_means"}, {"score": 0.004287166497171827, "phrase": "clinical_documentation"}, {"score": 0.0042579795015449005, "phrase": "previous_cpd_studies"}, {"score": 0.004200197763119297, "phrase": "particular_stakeholder_groups"}, {"score": 0.003976775340098895, "phrase": "multiple_stakeholder_groups"}, {"score": 0.003949693102823493, "phrase": "multiple_sites"}, {"score": 0.003909413809681223, "phrase": "usa._methods"}, {"score": 0.0038431888954930083, "phrase": "five_department_of_veterans_affairs_facilities"}, {"score": 0.0036015684625793775, "phrase": "resultant_transcripts"}, {"score": 0.0034686643139273934, "phrase": "emergent_themes"}, {"score": 0.002963830787280652, "phrase": "clinical_and_administrative_workflow"}, {"score": 0.002815604242104671, "phrase": "conclusions_cpd"}, {"score": 0.002777341265639153, "phrase": "documentation_processes"}, {"score": 0.002748984715897838, "phrase": "clinical_understanding"}, {"score": 0.0026656357767832267, "phrase": "multiple_groups"}, {"score": 0.002480826434008026, "phrase": "highly_reliable_and_retrievable_information"}, {"score": 0.0022083264126633085, "phrase": "outdated_'paper-chart'_paradigm"}, {"score": 0.002148677187261496, "phrase": "cpd_systems"}], "paper_keywords": [""], "paper_abstract": "Objective Clinical documentation is central to the medical record and so to a range of healthcare and business processes. As electronic health record adoption expands, computerized provider documentation (CPD) is increasingly the primary means of capturing clinical documentation. Previous CPD studies have focused on particular stakeholder groups and sites, often limiting their scope and conclusions. To address this, we studied multiple stakeholder groups from multiple sites across the USA. Methods We conducted 14 focus groups at five Department of Veterans Affairs facilities with 129 participants (54 physicians or practitioners, 34 nurses, and 37 administrators). Investigators qualitatively analyzed resultant transcripts, developed categories linked to the data, and identified emergent themes. Results Five major themes related to CPD emerged: communication and coordination; control and limitations in expressivity; information availability and reasoning support; workflow alteration and disruption; and trust and confidence concerns. The results highlight that documentation intertwines tightly with clinical and administrative workflow. Perceptions differed between the three stakeholder groups but remained consistent within groups across facilities. Conclusions CPD has dramatically changed documentation processes, impacting clinical understanding, decision-making, and communication across multiple groups. The need for easy and rapid, yet structured and constrained, documentation often conflicts with the need for highly reliable and retrievable information to support clinical reasoning and workflows. Current CPD systems, while better than paper overall, often do not meet the needs of users, partly because they are based on an outdated 'paper-chart' paradigm. These findings should inform those implementing CPD systems now and future plans for more effective CPD systems.", "paper_title": "Computerized provider documentation: findings and implications of a multisite study of clinicians and administrators", "paper_id": "WOS:000320168600018"}