{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "genomic_databases"}, {"score": 0.015444402691267789, "phrase": "biological_sequences"}, {"score": 0.012600296283853764, "phrase": "biological_community"}, {"score": 0.004364310576600359, "phrase": "biological_data"}, {"score": 0.004306205029641728, "phrase": "large_central_databases"}, {"score": 0.004136469845987887, "phrase": "educational_programs"}, {"score": 0.004027031316965272, "phrase": "bioinformatics_resources"}, {"score": 0.003459191419478298, "phrase": "protein_sequences"}, {"score": 0.003367611042980526, "phrase": "medline_records"}, {"score": 0.0031210475158175406, "phrase": "s-shaped_curve"}, {"score": 0.0030248298759040695, "phrase": "slow_growth"}, {"score": 0.002931569771634119, "phrase": "rapid_linear_growth"}, {"score": 0.0028411768240129585, "phrase": "similar_diffusion_patterns"}, {"score": 0.002741269087816162, "phrase": "biological_sequence_analysis"}, {"score": 0.00269263690712392, "phrase": "strong_relationship"}, {"score": 0.002221192647477371, "phrase": "innovations_approach"}, {"score": 0.0021049977753042253, "phrase": "bioinformatics_applications"}], "paper_keywords": [""], "paper_abstract": "In recent years there has been an explosion of biological data stored in large central databases, tools to handle the data, and educational programs to train scientists in using bioinformatics resources. Still, the diffusion of bioinformatics within the biological community has yet to be extensively studied. In this study, the diffusion of two bioinformatics-related practices-using genomic databases and analyzing DNA and protein sequences-was investigated by analyzing MEDLINE records of 12 journals, representing various fields of biology. The diffusion of these practices between 1970 and 2003 follows an S-shaped curve typical of many innovations, beginning with slow growth, followed by a period of rapid linear growth, and finally reaching saturation. Similar diffusion patterns were found for both the use of genomic databases and biological sequence analysis, indicating the strong relationship between these practices. This study presents the surge in the use of genomic databases and analysis of biological sequences and proposes that these practices are fully diffused within the biological community. Extrapolating from these results, it suggests that taking a diffusion of innovations approach may be useful for researchers as well as for providers of bioinformatics applications and support services.", "paper_title": "Diffusion pattern of the use of genomic databases and analysis of biological sequences from 1970-2003: Bibliographic record analysis of 12 journals", "paper_id": "WOS:000234324300005"}