{"auto_keywords": [{"score": 0.04681962109027257, "phrase": "english"}, {"score": 0.00481495049065317, "phrase": "best_deployment_strategies"}, {"score": 0.00478557489890886, "phrase": "language_tools"}, {"score": 0.004641351004344458, "phrase": "web_user_behaviour"}, {"score": 0.004542976479682312, "phrase": "web_users"}, {"score": 0.004221186370364584, "phrase": "new_challenges"}, {"score": 0.004007083686875716, "phrase": "search_tools"}, {"score": 0.003958299299658418, "phrase": "mono-_and_multilingual_content"}, {"score": 0.0038624981944755813, "phrase": "best_use"}, {"score": 0.0038389110156920926, "phrase": "navigation_and_search_options"}, {"score": 0.003534180765325899, "phrase": "web_search"}, {"score": 0.003501846136829077, "phrase": "large_progress"}, {"score": 0.003427540517249369, "phrase": "hard_problem"}, {"score": 0.003375429082739004, "phrase": "low-cost_but_high-quality_blanket_all-language_coverage"}, {"score": 0.0032436052954996097, "phrase": "user-centric_approach"}, {"score": 0.003097865379563127, "phrase": "linguistic_research"}, {"score": 0.0029586543333524904, "phrase": "first_and_second_languages"}, {"score": 0.0027741761880779535, "phrase": "first-language_content"}, {"score": 0.002731971103291716, "phrase": "user_behaviour"}, {"score": 0.002665770884424872, "phrase": "non-english_languages"}, {"score": 0.002431458888197052, "phrase": "user_satisfaction"}, {"score": 0.0023871221933990192, "phrase": "cognitive_effort"}, {"score": 0.002336414425972225, "phrase": "alternative_information"}, {"score": 0.0021772489804440646, "phrase": "user_groups'_domain_expertise"}, {"score": 0.0021049977753042253, "phrase": "information_quality"}], "paper_keywords": ["Web search", " Information seeking", " Web-site access", " Non-English", " Native language", " Non-native language"], "paper_abstract": "The number of Web users whose first language is not English continues to grow, as does the amount of content provided in languages other than English. This poses new challenges for actors on the Web, such as in which language(s) content should be offered, how search tools should deal with mono- and multilingual content, and how users can make the best use of navigation and search options, suited to their individual linguistic skills. How should these challenges be dealt with? Technological approaches to non-English (or in general, cross-language) Web search have made large progress; however, translation remains a hard problem. This precludes a low-cost but high-quality blanket all-language coverage of the whole Web. In this paper, we propose a user-centric approach to answering questions of where to best concentrate efforts and investments. Drawing on linguistic research, we describe data on the availability of content and access to it in first and second languages across the Web. We then present three studies that investigated the impact of the availability (or not) of first-language content and access forms on user behaviour and attitudes. The results indicate that non-English languages are under-represented on the Web and that this is partly due to content-creation, link-setting and link-following behaviour. They also show that user satisfaction is influenced both by the cognitive effort of searching and the availability of alternative information in that language. These findings suggest that more cross-language tools are desirable. However, they also indicate that context (such as user groups' domain expertise or site type) should be considered when tradeoffs between information quality and multilinguality need to be taken into account.", "paper_title": "A user-centric approach to identifying best deployment strategies for language tools: the impact of content and access language on Web user behaviour and attitudes", "paper_id": "WOS:000265040100008"}