{"auto_keywords": [{"score": 0.026773645925887643, "phrase": "spm"}, {"score": 0.008808142854208202, "phrase": "ipm"}, {"score": 0.00481495049065317, "phrase": "rotor_design"}, {"score": 0.004733625412289433, "phrase": "pm_machines"}, {"score": 0.004693476992528682, "phrase": "heavy-duty_traction_applications"}, {"score": 0.004653667500876187, "phrase": "purpose_-_the_purpose"}, {"score": 0.0041657281535389615, "phrase": "conventional_analytical_methods"}, {"score": 0.004095323392273661, "phrase": "saturation_conditions"}, {"score": 0.004043298628655316, "phrase": "finite_element_model"}, {"score": 0.0036813725040313002, "phrase": "magnet_losses"}, {"score": 0.0035731269727067496, "phrase": "efficiency_map"}, {"score": 0.0033517342967390065, "phrase": "heavy_vehicle_drive_cycle"}, {"score": 0.003104038398386081, "phrase": "considered_drive_cycle"}, {"score": 0.0029617414861784525, "phrase": "performance_advantage"}, {"score": 0.002924074850256874, "phrase": "reluctance_torque"}, {"score": 0.0027194778713860715, "phrase": "iron_losses"}, {"score": 0.002550842302473891, "phrase": "magnet_loss"}, {"score": 0.0023926387830753033, "phrase": "ipm_design"}, {"score": 0.0022926465161639633, "phrase": "magnetic_saturation_conditions"}, {"score": 0.0021049977753042253, "phrase": "assumed_performance_advantage"}], "paper_keywords": ["Automotive", " Fractional slot permanent magnet machine"], "paper_abstract": "Purpose - The purpose of this paper is to study the performance and efficiency of two different permanent magnet (PM) machine rotor configurations under magnetic core saturation conditions. Design/methodology/approach - Since the accuracy of conventional analytical methods is limited under saturation conditions, a finite element model of the machine is built; which is used to predict the various losses over its operating range such as eddy current, hysteresis, copper and magnet losses. Using this model, the efficiency map of the machine is derived which is used to investigate its efficiency corresponding to a heavy vehicle drive cycle. The performance of two different rotor designs are studied and the efficiency of each design is compared under the considered drive cycle. Findings - It has also been proved that the performance advantage due to reluctance torque in the v-shaped interior PM (IPM) machine is offset by its core steel saturation at higher current/torque levels. The magnitude of iron losses in the IPM is higher than that in the surface PM (SPM) machine, however, the magnet loss in the SPM is higher than in the IPM. Originality/value - An investigation of the performance of the IPM design in comparison with the SPM similar to design under magnetic saturation conditions is not known to the authors. Hence, in this paper, it will be determined if the assumed performance advantage of the IPM over the SPM still holds true under these conditions.", "paper_title": "Influence of rotor design on performance of PM machines for heavy-duty traction applications", "paper_id": "WOS:000341713700005"}