{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "web_review"}, {"score": 0.03491016045867914, "phrase": "potential_problems"}, {"score": 0.033438166505496705, "phrase": "health_care"}, {"score": 0.00481495049065317, "phrase": "online_health_information_reliability_debate"}, {"score": 0.004538205894326768, "phrase": "inter-disciplinary_literature_review"}, {"score": 0.0044936464966076894, "phrase": "renewed_concerns"}, {"score": 0.004438559261607655, "phrase": "online_health_information"}, {"score": 0.004384144362375153, "phrase": "increasing_popularity"}, {"score": 0.004362564831572539, "phrase": "web_applications"}, {"score": 0.003827696182521953, "phrase": "new_and_archived_posts"}, {"score": 0.003643293770051351, "phrase": "six_points"}, {"score": 0.003563226632528754, "phrase": "reliability_issues"}, {"score": 0.0032924833510025106, "phrase": "social_scientists"}, {"score": 0.0032520729713287006, "phrase": "new_issues"}, {"score": 0.00314930470785545, "phrase": "specific_points"}, {"score": 0.00313378414402234, "phrase": "renewed_concern"}, {"score": 0.0030800602005597354, "phrase": "information_quality"}, {"score": 0.002852965121474273, "phrase": "new_concern"}, {"score": 0.0028109793314380995, "phrase": "negative-social_networking"}, {"score": 0.0027764622414122656, "phrase": "text-based_information"}, {"score": 0.002728847267539957, "phrase": "interactive_information"}, {"score": 0.0026886831383434633, "phrase": "patient_education"}, {"score": 0.0026425695441776847, "phrase": "diverse_groups"}, {"score": 0.0026036719653504408, "phrase": "interactive_and_collaborative_web_applications"}, {"score": 0.002527581719069596, "phrase": "lay_information_creation"}, {"score": 0.002318088516037056, "phrase": "specific_issues"}, {"score": 0.002289609924110386, "phrase": "newly_popular_web_applications"}, {"score": 0.002157697367447098, "phrase": "positive_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet", " Web 2.0", " Reliability", " Consumer health"], "paper_abstract": "Purpose: The purpose of this inter-disciplinary literature review was to explore renewed concerns about the reliability of online health information in light of the increasing popularity of web applications that enable more end-user-generated content (\"web 2.0\"). Methods: The findings are based on a literature and web review. Literature was collected at four different points between October 2006 and October 2008 and included 56 sources from 10 academic disciplines. The web review consisted of following 6 blogs (including both new and archived posts, with comments) and one wiki for a period of 1.5 months and assessing the content for relevancy on six points, totaling 63 sources altogether. Results: The reliability issues that are identified with respect to \"web 2.0\" reiterate more general concerns expressed about theweb over the last 15 years. The difference, however, lies in the scope and scale of potential problems. Social scientists have also pointed to new issues that can be especially relevant for use of web 2.0 applications in health care. Specific points of renewed concern include: disclosure of authorship and information quality, anonymity and privacy, and the ability of individuals to apply information to their personal situation. Whether or not end-users understand what social scientists call \"negative network externalities\" is a new concern. Finally, not all reliability issues are negative-social networking and the shift from text-based information to symbolic information, images or interactive information, are considered to enhance patient education and to provide opportunities to reach diverse groups of patients. Conclusions: Interactive and collaborative web applications undeniably offer new opportunities for reaching patients and other health care consumers by facilitating lay information creation, sharing and retrieval. However, researchers must be careful and critical when incorporating applications or practices from other fields in health care. We must not easily dismiss concerns about reliability as outdated. Specific issues related to use of newly popular web applications for health purposes must be addressed. Nonetheless, the articles reviewed here also clearly show that potential problems can be addressed and the positive aspects of the technologies embraced. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Revisiting the online health information reliability debate in the wake of \"web 2.0\": An inter-disciplinary literature and website review", "paper_id": "WOS:000278192800002"}