{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "influential_nodes"}, {"score": 0.004769182299692333, "phrase": "sis_models"}, {"score": 0.004723847090183984, "phrase": "social_networks"}, {"score": 0.004460703838987562, "phrase": "social_network"}, {"score": 0.004334657104697421, "phrase": "multiple_activation"}, {"score": 0.00386496062825374, "phrase": "layered_graph"}, {"score": 0.003809932244103758, "phrase": "original_network"}, {"score": 0.0036494864560524735, "phrase": "time_proceeds"}, {"score": 0.003580355398511932, "phrase": "bond_percolation"}, {"score": 0.0033645655483989746, "phrase": "proposed_method"}, {"score": 0.0032850648549389025, "phrase": "conventional_methods"}, {"score": 0.0029569247903654477, "phrase": "single_influential_node"}, {"score": 0.0028187792953857957, "phrase": "multiple_nodes"}, {"score": 0.0026742419973883134, "phrase": "computational_complexity"}, {"score": 0.002598543802992702, "phrase": "naive_probabilistic_simulation"}, {"score": 0.0023840346303791032, "phrase": "centrality_measures"}, {"score": 0.0021049977753042253, "phrase": "right_objective_function"}], "paper_keywords": ["Information diffusion", " SIS model", " Influence maximization", " Pruning method", " Burnout method"], "paper_abstract": "We address the problem of discovering the influential nodes in a social network under the susceptible/infected/susceptible model that allows multiple activation of the same node, by defining two influence maximization problems: final-time and integral-time. We solve this problem by constructing a layered graph from the original network with each layer added on top as the time proceeds and applying the bond percolation with two effective control strategies: pruning and burnout. We experimentally demonstrate that the proposed method gives much better solutions than the conventional methods that are based solely on the notion of centrality using two real-world networks. The pruning is most effective when searching for a single influential node, but burnout is more powerful in searching for multiple nodes which together are influential. We further show that the computational complexity is much smaller than the naive probabilistic simulation both by theory and experiment. The influential nodes discovered are substantially different from those identified by the centrality measures. We further note that the solutions of the two optimization problems are also substantially different, indicating the importance of distinguishing these two problem characteristics and using the right objective function that best suits the task in hand.", "paper_title": "Efficient discovery of influential nodes for SIS models in social networks", "paper_id": "WOS:000300295600006"}