{"auto_keywords": [{"score": 0.04779587312372571, "phrase": "distributed_systems"}, {"score": 0.020639928374274228, "phrase": "network_management_systems"}, {"score": 0.00481495049065317, "phrase": "complex_network_management_systems"}, {"score": 0.004672444473700524, "phrase": "computer_networks"}, {"score": 0.0038144050983900286, "phrase": "main_distributed_systems"}, {"score": 0.003578255090799811, "phrase": "necessary_support"}, {"score": 0.0033315236647127734, "phrase": "development_stage"}, {"score": 0.003232779373179631, "phrase": "serious_consequences"}, {"score": 0.0032085525502105836, "phrase": "even_total_failures"}, {"score": 0.003136952589428254, "phrase": "distributed_system"}, {"score": 0.0028021527740710508, "phrase": "network_management"}, {"score": 0.0027811441123794427, "phrase": "distributed_systems_projects"}, {"score": 0.002550545394070177, "phrase": "formal_modelling_tools"}, {"score": 0.002502995662011305, "phrase": "different_views"}, {"score": 0.0023214774334744713, "phrase": "process_definitions"}, {"score": 0.0022610992177831643, "phrase": "involved_agents"}, {"score": 0.0022022878843247257, "phrase": "distributed_architecture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network management systems", " Frameworks and models", " Conceptual model", " Functional model", " Architectural model", " Business process modelling notation", " Multi-agent system", " Service oriented architecture"], "paper_abstract": "Society today is completely dependent on computer networks, the Internet and distributed systems, which place at our disposal the necessary services to perform our daily tasks. Subconsciously, we rely increasingly on network management systems. These systems allow us to, in general, maintain, manage, configure, scale, adapt, modify, edit, protect, and enhance the main distributed systems. Their role is secondary and is unknown and transparent to the users. They provide the necessary support to maintain the distributed systems whose services we use every day. If we do not consider network management systems during the development stage of distributed systems, then there could be serious consequences or even total failures in the development of the distributed system. It is necessary, therefore, to consider the management of the systems within the design of the distributed systems and to systematise their design to minimise the impact of network management in distributed systems projects. In this paper, we present a framework that allows the design of network management systems systematically. To accomplish this goal, formal modelling tools are used for modelling different views sequentially proposed of the same problem. These views cover all the aspects that are involved in the system; based on process definitions for identifying responsible and defining the involved agents to propose the deployment in a distributed architecture that is both feasible and appropriate. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A formal framework for modelling complex network management systems", "paper_id": "WOS:000334002900023"}