{"auto_keywords": [{"score": 0.03478167905660463, "phrase": "omg"}, {"score": 0.03363889154690726, "phrase": "hssp_service_specification_framework"}, {"score": 0.0047003115977448905, "phrase": "deliverables_for"}, {"score": 0.004652016085325825, "phrase": "semantically_interoperable_service-oriented_architectutre_for_healthcare"}, {"score": 0.0045726187330434025, "phrase": "healthcare_industry"}, {"score": 0.004525629293824217, "phrase": "significant_benefits"}, {"score": 0.00443308765153716, "phrase": "service-oriented_architecture"}, {"score": 0.004283019592801715, "phrase": "standard_software_service_interfaces"}, {"score": 0.003956784357357341, "phrase": "software_services"}, {"score": 0.0037188360359702182, "phrase": "interoperable_service_specifications"}, {"score": 0.003667925754747227, "phrase": "existing_and_ongoing_standardization_efforts"}, {"score": 0.003519324484935703, "phrase": "hssp"}, {"score": 0.0034000828197314264, "phrase": "joint_initiative"}, {"score": 0.0031193028729331667, "phrase": "service_standardization"}, {"score": 0.0030872017736888113, "phrase": "normative_service_functional_models"}, {"score": 0.0029928611380840757, "phrase": "conformance_criteria"}, {"score": 0.0028715299874549245, "phrase": "technical_service_specifications"}, {"score": 0.0026252106881752067, "phrase": "functional_specifications"}, {"score": 0.0023426936553484524, "phrase": "technical_specifications"}, {"score": 0.0023265809733919547, "phrase": "commercial_implementations"}, {"score": 0.002247661329347204, "phrase": "omg."}, {"score": 0.002126907587540404, "phrase": "replicable_and_collaborative_approach"}, {"score": 0.0021049977753042253, "phrase": "'_standardized_service_specifications"}], "paper_keywords": [""], "paper_abstract": "Context: The healthcare industry could achieve significant benefits through the adoption of a service-oriented architecture (SOA). The specification and adoption of standard software service interfaces will be critical to achieving these benefits. Objective: To develop a replicable, collaborative framework for standardizing the interfaces of software services important to healthcare. Design: Iterative, peer-reviewed development of a framework for generating interoperable service specifications that build on existing and ongoing standardization efforts. The framework was created under the auspices of the Healthcare Services Specification Project (HSSP), which was initiated in 2005 as a joint initiative between Health Level7 (HL7) and the Object Management Group (OMG). In this framework, known as the HSSP Service Specification Framework, HL7 identifies candidates for service standardization and defines normative Service Functional Models (SFMs) that specify the capabilities and conformance criteria for these services. OMG then uses these SFMs to generate technical service specifications as well as reference implementations. Measurements: The ability of the framework to support the creation of multiple, interoperable service specifications useful for healthcare. Results: Functional specifications have been defined through HL7 for four services: the Decision Support Service; the Entity Identification Service; the Clinical Research Filtered Query Service; and the Retrieve, Locate, and Update Service. Technical specifications and commercial implementations have been developed for two of these services within OMG. Furthermore, three additional functional specifications are being developed through HL7. Conclusions: The HSSP Service Specification Framework provides a replicable and collaborative approach to defining' standardized service specifications for healthcare. J Am Med Inform Assoc. 2009;16:874-881. DOI 10.1197/jamia.M3123.", "paper_title": "The HL7-OMG Healthcare Services Specification Project: Motivation, Methodology, and Deliverables for Enabling a Semantically Interoperable Service-oriented Architectutre for Healthcare", "paper_id": "WOS:000271730000015"}