{"auto_keywords": [{"score": 0.03172367865312368, "phrase": "false_positive_rate"}, {"score": 0.023227301113361, "phrase": "isotopic_distributions"}, {"score": 0.014728127808861588, "phrase": "true_positive_rate"}, {"score": 0.006789428104316824, "phrase": "perfect_isotopic_distribution_annotations"}, {"score": 0.004793083839686926, "phrase": "metabolically_labeled_samples"}, {"score": 0.00472807509484242, "phrase": "stable_isotopic_labeling"}, {"score": 0.004685224205630963, "phrase": "standard_approach"}, {"score": 0.0046639439335437955, "phrase": "quantitative_proteomic_analyses"}, {"score": 0.004538267573249093, "phrase": "excellent_internal_control"}, {"score": 0.004436116555817464, "phrase": "metabolic_labeling_experiments"}, {"score": 0.0043560464825349275, "phrase": "labeled_and_unlabeled_forms"}, {"score": 0.004013172907446247, "phrase": "automated_fashion"}, {"score": 0.003976775340098895, "phrase": "experimental_situations"}, {"score": 0.003878368569340946, "phrase": "labeled_and_unlabeled_peaks"}, {"score": 0.0038431888954930083, "phrase": "unknown_sequence"}, {"score": 0.0037910145286595386, "phrase": "largely_overlooked_problem"}, {"score": 0.0037480753312398754, "phrase": "quantitative_mass_spectrometry_data"}, {"score": 0.003646987878469433, "phrase": "mass_spectrum"}, {"score": 0.0035892794633115227, "phrase": "natural_abundance_light_isotopic_distributions"}, {"score": 0.0034450303951025704, "phrase": "isotopic_peaks"}, {"score": 0.0034215569542785907, "phrase": "modified_version"}, {"score": 0.0033982429092938764, "phrase": "idm_algorithm"}, {"score": 0.0033368432387977883, "phrase": "probabilistic_classifier"}, {"score": 0.0032990312095323064, "phrase": "dynamic_programming"}, {"score": 0.0032616462517547477, "phrase": "labeled_matched_isotopic_pairs"}, {"score": 0.003152006152091526, "phrase": "primary_result"}, {"score": 0.0031021057355129153, "phrase": "dynamic_programming_approach"}, {"score": 0.002903628734069691, "phrase": "selected_peaks"}, {"score": 0.0027741761880779535, "phrase": "machine_selected_peaks"}, {"score": 0.002724021375143674, "phrase": "dynamic_programming_algorithm"}, {"score": 0.0025730425700096365, "phrase": "exact_annotations"}, {"score": 0.0024582922173761903, "phrase": "even_one_peak"}, {"score": 0.0024359621870898743, "phrase": "extraneous_peak"}, {"score": 0.0023919073374829894, "phrase": "'monoisotopic'_peaks"}, {"score": 0.002343295029663352, "phrase": "positive_rate"}, {"score": 0.0022904365616462146, "phrase": "'machine'_selected_data"}, {"score": 0.002280008490069972, "phrase": "changes_to_the_algorithms_scoring_function_and_training_example_generation"}, {"score": 0.002158505888557746, "phrase": "mass-to-charge_range"}], "paper_keywords": [""], "paper_abstract": "Motivation: In recent years stable isotopic labeling has become a standard approach for quantitative proteomic analyses. Among the many available isotopic labeling strategies, metabolic labeling is attractive for the excellent internal control it provides. However, analysis of data from metabolic labeling experiments can be complicated because the spacing between labeled and unlabeled forms of each peptide depends on its sequence, and is thus variable from analyte to analyte. As a result, one generally needs to know the sequence of a peptide to identify its matching isotopic distributions in an automated fashion. In some experimental situations it would be necessary or desirable to match pairs of labeled and unlabeled peaks from peptides of unknown sequence. This article addresses this largely overlooked problem in the analysis of quantitative mass spectrometry data by presenting an algorithm that not only identifies isotopic distributions within a mass spectrum, but also annotates matches between natural abundance light isotopic distributions and their metabolically labeled counterparts. This algorithm is designed in two stages: first we annotate the isotopic peaks using a modified version of the IDM algorithm described last year; then we use a probabilistic classifier that is supplemented by dynamic programming to find the metabolically labeled matched isotopic pairs. Such a method is needed for high-throughput quantitative proteomic/metabolomic experiments measured via mass spectrometry. Results: The primary result of this article is that the dynamic programming approach performs well given perfect isotopic distribution annotations. Our algorithm achieves a true positive rate of 99% and a false positive rate of 1% using perfect isotopic distribution annotations. When the isotopic distributions are annotated given 'expert' selected peaks, the same algorithm gets a true positive rate of 77% and a false positive rate of 1%. Finally, when annotating using machine selected peaks, which may contain noise, the dynamic programming algorithm gives a true positive rate of 36% and a false positive rate of 1%. It is important to mention that these rates arise from the requirement of exact annotations of both the light and heavy isotopic distributions. In our evaluations, a match is considered 'entirely incorrect' if it is missing even one peak or containing an extraneous peak. If we only require that the 'monoisotopic' peaks exist within the two matched distributions, our algorithm obtains a positive rate of 45% and a false positive rate of 1% on the 'machine' selected data. Changes to the algorithms scoring function and training example generation improves our 'monoisotopic' peak score true positive rate to 65% while obtaining a false positive rate of 2%. All results were obtained within 10-fold cross-validation of 41 mass spectra with a mass-to-charge range of 8004000m/z. There are a total of 713 isotopic distributions and 255 matched isotopic pairs that are hand-annotated for this study.", "paper_title": "Matching isotopic distributions from metabolically labeled samples", "paper_id": "WOS:000257169700061"}