{"auto_keywords": [{"score": 0.04632854095021708, "phrase": "unlabeled_data"}, {"score": 0.007018495713500692, "phrase": "good_generalization_performance"}, {"score": 0.004850247727796194, "phrase": "transfer_learning"}, {"score": 0.00481495049065317, "phrase": "batch_mode_active_sampling"}, {"score": 0.00477945927997702, "phrase": "marginal_probability_distribution_matching"}, {"score": 0.004720440819034, "phrase": "joint_optimization_framework"}, {"score": 0.004709256047377171, "phrase": "machine_learning"}, {"score": 0.00468608379155324, "phrase": "data_mining_technique"}, {"score": 0.004560650258115319, "phrase": "training_data"}, {"score": 0.004460513016577072, "phrase": "large_amount"}, {"score": 0.004438141614604578, "phrase": "active_learning"}, {"score": 0.004041293078458692, "phrase": "batch-mode_active_learning"}, {"score": 0.00397207327140292, "phrase": "informative_samples"}, {"score": 0.003799454283773081, "phrase": "existing_batch-mode_active_learning_methodologies"}, {"score": 0.003634309627136556, "phrase": "novel_criterion"}, {"score": 0.0035195050120372714, "phrase": "query_samples"}, {"score": 0.0033087872890443406, "phrase": "candidate_subsets"}, {"score": 0.0032520729713287006, "phrase": "best_subset"}, {"score": 0.003228064431860277, "phrase": "proposed_objective"}, {"score": 0.003204232566468624, "phrase": "np-hard_integer_programming_optimization_problem"}, {"score": 0.0030272544751529127, "phrase": "convex_quadratic_programming_problem"}, {"score": 0.0029974860223022626, "phrase": "second_method"}, {"score": 0.0029460917964452015, "phrase": "linear_programming_problem"}, {"score": 0.0029171191200905587, "phrase": "publicly_available_uci_datasets"}, {"score": 0.002860023297243716, "phrase": "proposed_approach"}, {"score": 0.002824905683646627, "phrase": "state-of-the-art_batch-mode_active_learning_methods"}, {"score": 0.0027086909625661367, "phrase": "predicted_labels"}, {"score": 0.002655663770724272, "phrase": "proposed_formulation"}, {"score": 0.0025338369486914364, "phrase": "existing_approaches"}, {"score": 0.0024116163689723354, "phrase": "common_objective"}, {"score": 0.0023937976277397972, "phrase": "distribution_difference"}, {"score": 0.002370243452208976, "phrase": "adapted_source"}, {"score": 0.0023009592313451136, "phrase": "unlabeled_target_domain_data"}, {"score": 0.0022392257692119026, "phrase": "newsgroups"}, {"score": 0.0022062516251014257, "phrase": "uncertainty_information"}, {"score": 0.002152368701947456, "phrase": "proposed_active_learning"}, {"score": 0.0021049977753042253, "phrase": "proposed_transfer-active_method"}], "paper_keywords": ["Algorithms", " Active learning", " transfer learning", " marginal probability distribution", " maximum mean discrepancy"], "paper_abstract": "Active Learning is a machine learning and data mining technique that selects the most informative samples for labeling and uses them as training data; it is especially useful when there are large amount of unlabeled data and labeling them is expensive. Recently, batch-mode active learning, where a set of samples are selected concurrently for labeling, based on their collective merit, has attracted a lot of attention. The objective of batch-mode active learning is to select a set of informative samples so that a classifier learned on these samples has good generalization performance on the unlabeled data. Most of the existing batch-mode active learning methodologies try to achieve this by selecting samples based on certain criteria. In this article we propose a novel criterion which achieves good generalization performance of a classifier by specifically selecting a set of query samples that minimize the difference in distribution between the labeled and the unlabeled data, after annotation. We explicitly measure this difference based on all candidate subsets of the unlabeled data and select the best subset. The proposed objective is an NP-hard integer programming optimization problem. We provide two optimization techniques to solve this problem. In the first one, the problem is transformed into a convex quadratic programming problem and in the second method the problem is transformed into a linear programming problem. Our empirical studies using publicly available UCI datasets and two biomedical image databases demonstrate the effectiveness of the proposed approach in comparison with the state-of-the-art batch-mode active learning methods. We also present two extensions of the proposed approach, which incorporate uncertainty of the predicted labels of the unlabeled data and transfer learning in the proposed formulation. In addition, we present a joint optimization framework for performing both transfer and active learning simultaneously unlike the existing approaches of learning in two separate stages, that is, typically, transfer learning followed by active learning. We specifically minimize a common objective of reducing distribution difference between the domain adapted source, the queried and labeled samples and the rest of the unlabeled target domain data. Our empirical studies on two biomedical image databases and on a publicly available 20 Newsgroups dataset show that incorporation of uncertainty information and transfer learning further improves the performance of the proposed active learning based classifier. Our empirical studies also show that the proposed transfer-active method based on the joint optimization framework performs significantly better than a framework which implements transfer and active learning in two separate stages.", "paper_title": "Batch Mode Active Sampling Based on Marginal Probability Distribution Matching", "paper_id": "WOS:000329435400005"}