{"auto_keywords": [{"score": 0.04775586192186013, "phrase": "home_context"}, {"score": 0.015719716506582538, "phrase": "first-person_perspective"}, {"score": 0.015338056542917524, "phrase": "assistive_technology"}, {"score": 0.007973951325755863, "phrase": "daily_lives"}, {"score": 0.00474075475474847, "phrase": "qualitative_personal_evaluation_game"}, {"score": 0.004160792819919432, "phrase": "informal_caregivers"}, {"score": 0.003934401172799425, "phrase": "important_role"}, {"score": 0.003778566972399296, "phrase": "user-centred_research"}, {"score": 0.003606384575869449, "phrase": "first-hand_experiences"}, {"score": 0.0034634973175137486, "phrase": "personal_evaluation_game_method"}, {"score": 0.0028206052780047424, "phrase": "dynamic_lighting_armature"}, {"score": 0.002777055546998579, "phrase": "sleep-wake_cycle"}, {"score": 0.00265038878247831, "phrase": "newly_developed_method"}, {"score": 0.002347378595930709, "phrase": "diverse_types"}, {"score": 0.00231111848128734, "phrase": "personal_evaluation_game"}, {"score": 0.002289631204915149, "phrase": "first_step"}, {"score": 0.0022683432490549064, "phrase": "ecologically_valid_tool"}], "paper_keywords": ["HCI design and evaluation methods", " field studies", " assistive technologies", " user studies", " probe studies", " dementia"], "paper_abstract": "The number of people with dementia is increasing rapidly. As a result, care has to be extended towards the home context. This increases the burden on both informal caregivers and persons affected by dementia. To support these people more effectively, technology could play an important role. However, it proves to be challenging to involve them in user-centred research with this purpose. Therefore, there is a need for more research approaches that gather first-hand experiences with technology from people with dementia directly. This research presents a personal evaluation game method, used in the home context to study assistive technology as experienced by its users. In parallel, a questionnaire was applied to explore the difference in data and experiences between both methods. In the study, 12 households participated, each with a person diagnosed with dementia and a partner still living with them as their informal caregiver. During a period of 3 weeks, participants experienced a dynamic lighting armature designed to improve the sleep-wake cycle and evaluated it through one of these methods. The results show that the newly developed method manages to capture the first-person perspective, and is a more appropriate research tool for people with dementia. The information gathered with the tool allowed the researchers to capture the daily lives of the participants in detail, mainly due to the diverse types of input. The personal evaluation game shows a first step towards an ecologically valid tool that includes people with dementia directly. As such the method proved to be qualitative and explorative, and able to provide insights into both the technology and the daily lives of people living with dementia.", "paper_title": "Seeing the First-Person Perspective in Dementia: A Qualitative Personal Evaluation Game to Evaluate Assistive Technology for People Affected by Dementia in the Home Context", "paper_id": "WOS:000350209700006"}