{"auto_keywords": [{"score": 0.04446054560028882, "phrase": "qsar_models"}, {"score": 0.0338785977565682, "phrase": "prediction_error"}, {"score": 0.00481495049065317, "phrase": "machine_learning_reliability_methods"}, {"score": 0.004745056850725867, "phrase": "applicability_domain"}, {"score": 0.004710489616113198, "phrase": "qsar_regression_models"}, {"score": 0.004625164125506718, "phrase": "chemical_space"}, {"score": 0.004574709094672837, "phrase": "relatively_small_coverage"}, {"score": 0.004541377162789232, "phrase": "experimental_data"}, {"score": 0.004508286991825192, "phrase": "molecular_properties"}, {"score": 0.004054598617367474, "phrase": "potential_subsequent_investigations"}, {"score": 0.0038946650372062783, "phrase": "experimental_values"}, {"score": 0.003824065676045582, "phrase": "qsar"}, {"score": 0.0035671997165370403, "phrase": "denser_experimental_data"}, {"score": 0.003327534497764259, "phrase": "machine_learning_community"}, {"score": 0.0032671775301001513, "phrase": "prediction_confidence"}, {"score": 0.0028847066125323893, "phrase": "new_alternative_approaches"}, {"score": 0.002853183476661506, "phrase": "standard_reliability_scores"}, {"score": 0.002528300562452668, "phrase": "regression_method"}, {"score": 0.002500662348528587, "phrase": "qsar."}, {"score": 0.0024284249875593253, "phrase": "increased_computational_complexity"}, {"score": 0.0022817585639886883, "phrase": "reliability_estimation_techniques"}, {"score": 0.0021996478802839316, "phrase": "open_source"}, {"score": 0.0021049977753042253, "phrase": "orange_data_mining_suite"}], "paper_keywords": [""], "paper_abstract": "The vastness of chemical space and the relatively small coverage by experimental data recording molecular properties require us to identify subspaces, or domains, for which we can confidently apply QSAR models. The prediction of QSAR models in these domains is reliable, and potential subsequent investigations of such compounds would find that the predictions closely match the experimental values. Standard approaches in QSAR assume that predictions are more reliable for compounds that are \"similar\" to those in subspaces with denser experimental data. Here, we report on a study of an alternative set of techniques recently proposed in the machine learning community. These methods quantify prediction confidence through estimation of the prediction error at the point of interest. Our study includes 20 public QSAR data sets with continuous response and assesses the quality of 10 reliability scoring methods by observing their correlation with prediction error. We show that these new alternative approaches can outperform standard reliability scores that rely only on similarity to compounds in the training set. The results also indicate that the quality of reliability scoring methods in sensitive to data set characteristics and to the regression method used in QSAR. We demonstrate that at the cost of increased computational complexity these dependencies can be leveraged by integration of scores from various reliability estimation approaches. The reliability estimation techniques described in this paper have been implemented in an open source add-on package (https://bitbucket.org/biolab/orange-reliability) to the Orange data mining suite.", "paper_title": "Assessment of Machine Learning Reliability Methods for Quantifying the Applicability Domain of QSAR Regression Models", "paper_id": "WOS:000331992000010"}