{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "probing_cost"}, {"score": 0.04890933270671448, "phrase": "probe-based_network_link_monitoring"}, {"score": 0.039493331760101835, "phrase": "probing_paths"}, {"score": 0.033719857443811355, "phrase": "identifiable_link"}, {"score": 0.0037967593942595233, "phrase": "minimum_number"}, {"score": 0.003649277504586372, "phrase": "identifiable_links"}, {"score": 0.003577691211998842, "phrase": "unidentifiable_links"}, {"score": 0.003421697038352743, "phrase": "linear_system_model"}, {"score": 0.0033379819706003885, "phrase": "irreducible_sets"}, {"score": 0.0030988889679192965, "phrase": "bipartite_model"}, {"score": 0.002835565745974332, "phrase": "np"}, {"score": 0.002737745536992088, "phrase": "heuristic-based_algorithm"}, {"score": 0.002605329434787829, "phrase": "redundant_probing_paths"}, {"score": 0.0023245146355917626, "phrase": "real_network_topologies"}, {"score": 0.0021902063413831545, "phrase": "prior_work"}, {"score": 0.0021049977753042253, "phrase": "better_performance"}], "paper_keywords": ["Internet", " network monitoring", " end-to-end probe", " probing cost", " identifiable link"], "paper_abstract": "Continuously monitoring link performance is important to network diagnosis. In this paper, we address the problem of minimizing the probing cost and achieving identifiability in probe-based network link monitoring. Given a set of links to monitor, our objective is to select the minimum number of probing paths that can uniquely determine all identifiable links and cover all unidentifiable links. We propose an algorithm based on a linear system model to find out all irreducible sets of probing paths that can uniquely determine an identifiable link, and we extend the bipartite model to reflect the relationship between a set of probing paths and an identifiable link. Since our optimization problem is NP-hard, we propose a heuristic-based algorithm to greedily select probing paths. Our method eliminates two types of redundant probing paths, i.e., those that can be replaced by others and those without any contribution to achieving identifiability. Simulations based on real network topologies show that our approach can achieve identifiability with very low probing cost. Compared with prior work, our method is more general and has better performance.", "paper_title": "Minimizing Probing Cost and Achieving Identifiability in Probe-Based Network Link Monitoring", "paper_id": "WOS:000314391600008"}