{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_decision-making_mechanism"}, {"score": 0.004732785510739708, "phrase": "trust-based_solutions"}, {"score": 0.004533427352547707, "phrase": "good_behavior"}, {"score": 0.0044369056710423065, "phrase": "trust_management_systems"}, {"score": 0.004342430078306461, "phrase": "prior_knowledge"}, {"score": 0.004001335931796133, "phrase": "correct_knowledge"}, {"score": 0.003916098498242888, "phrase": "trust_management_system"}, {"score": 0.0036553070575015344, "phrase": "best_set"}, {"score": 0.0030898642396380662, "phrase": "single_model"}, {"score": 0.003050166508545763, "phrase": "main_idea"}, {"score": 0.0029722900280316216, "phrase": "utility_function"}, {"score": 0.002738523189244011, "phrase": "expected_utility"}, {"score": 0.0026916956768363158, "phrase": "risk_attitude"}, {"score": 0.0026570998719084153, "phrase": "fully_distributed_fashion"}, {"score": 0.002622947550220266, "phrase": "unique_feature"}, {"score": 0.0024061887405214186, "phrase": "trust-based_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "good_starting_point"}], "paper_keywords": ["Decision model", " risk", " trust", " utility", " wireless peer-to-peer (P2P) network"], "paper_abstract": "Trust-based solutions provide some form of payment to peers to encourage good behavior. The problem with trust management systems is that they require prior knowledge to work. In other words, peers are vulnerable to attack if they do not have knowledge or correct knowledge of other peers in a trust management system. Therefore, considering only trust is inadequate when a decision is made to identify the best set of peers to utilize. In order to solve the problem, we propose a distributed decision-making mechanism for wireless peer-to-peer (P2P) networks based on game theory and relevant trust mechanisms in which we incorporate the element of trust and risk into a single model. The main idea of our mechanism is to use utility function to express the relationship between benefits and costs of peers, and then make the decision based on expected utility as well as risk attitude in a fully distributed fashion. The unique feature of our mechanism is that it not only helps a peer to select its partners, but also mitigates vulnerabilities in trust-based mechanisms. Through analysis and experiments, we believe our approach is useful for peers to make the decision regarding who to interact with. In addition, it is also a good starting point for exploring tradeoffs among risk, trust and utility.", "paper_title": "A Distributed Decision-Making Mechanism for Wireless P2P Networks", "paper_id": "WOS:000269999500005"}