{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_images"}, {"score": 0.004491313367627919, "phrase": "mining_correlations"}, {"score": 0.00428146713705618, "phrase": "associated_text"}, {"score": 0.004225950334493496, "phrase": "corresponding_textual_tags"}, {"score": 0.0038737214010638745, "phrase": "different_contribution"}, {"score": 0.0037903327482565097, "phrase": "image_semantics"}, {"score": 0.0035974243349266894, "phrase": "corresponding_word"}, {"score": 0.0034894451015047875, "phrase": "novel_visibility_model"}, {"score": 0.0029961221584602405, "phrase": "latent_dirichlet_allocation"}, {"score": 0.0029701840435881117, "phrase": "lda"}, {"score": 0.002893505913503472, "phrase": "topic_information"}, {"score": 0.002722288966917744, "phrase": "image_clustering"}, {"score": 0.002652039172817654, "phrase": "latent_topic_information"}, {"score": 0.0026175952455594277, "phrase": "image_clustering_framework"}, {"score": 0.002266931093770838, "phrase": "new_unsupervised_learning_process"}, {"score": 0.0021892345747666977, "phrase": "experimental_results"}, {"score": 0.002151388538895855, "phrase": "smhc_algorithm"}, {"score": 0.002132711053003407, "phrase": "better_clustering_performance"}, {"score": 0.0021049977753042253, "phrase": "proposed_smhc-based_image_clustering_framework"}], "paper_keywords": ["image clustering", " hypergraph", " visibility", " spectral multiple hypergraph clustering"], "paper_abstract": "In this paper, we consider the problem of clustering Web images by mining correlations between images and their corresponding words. Since Web images always come with associated text, the corresponding textual tags of Web images are used as a source to enhance the description of Web images. However, each word has different contribution for the interpretation of image semantics. Therefore, in order to evaluate the importance of each corresponding word of Web images, we propose a novel visibility model to compute the extent to which a word can be perceived visually in images, and then infer the correlation of word to image by the integration of visibility with tf-idf. Furthermore, Latent Dirichlet Allocation (LDA) is used to discover topic information inherent in surrounding text and topic correlations of images could be defined for image clustering. For integrating visibility and latent topic information into an image clustering framework, we first represent textual correlated and latent-topic correlated images by two hypergraph views, and then the proposed Spectral Multiple Hypergraph Clustering (SMHC) algorithm is used to cluster images into categories. The SMHC could be regarded as a new unsupervised learning process with two hypergraphs to classify Web images. Experimental results show that the SMHC algorithm has better clustering performance and the proposed SMHC-based image clustering framework is effective.", "paper_title": "Multiple Hypergraph Clustering of Web Images by MiningWord2Image Correlations", "paper_id": "WOS:000279714400009"}