{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collective_sense"}, {"score": 0.048868122179027106, "phrase": "violent_crises"}, {"score": 0.00334144503360907, "phrase": "u.s._college_campuses"}, {"score": 0.003194736764837261, "phrase": "microblogging_communications"}, {"score": 0.003133844153806967, "phrase": "information-sharing_behaviors"}, {"score": 0.0030741085942960814, "phrase": "early_response_phase"}, {"score": 0.002977061391551631, "phrase": "opinion_sharing"}, {"score": 0.0028281000453392272, "phrase": "recovery_phase"}, {"score": 0.0026865721000905235, "phrase": "individual_microblogging_communications"}, {"score": 0.002601727192945944, "phrase": "conversation_threads"}, {"score": 0.0025195550121331345, "phrase": "individual_contributors"}, {"score": 0.0021322065604537617, "phrase": "vital_role"}, {"score": 0.0021049977753042253, "phrase": "collective_sense-making"}], "paper_keywords": [""], "paper_abstract": "The purpose of this study is to understand how microblogging communications change and contribute to collective sense-making over time during a crisis. Using B. Dervin's (1983) theory of sense-making applied to crises and communications during crises, we examined 7,184 microblogging communications sent in response to three violent crises that occurred on U.S. college campuses. The analysis of patterns of microblogging communications found that information-sharing behaviors dominated the early response phase of violent crises, and opinion sharing increased over time, peaking in the recovery phase of the crises. The analysis of individual microblogging communications identified various themes in the conversation threads that not only helped individual contributors make sense of the situation but also helped others who followed the conversation. The results of this study show that microblogging can play a vital role in collective sense-making during crises.", "paper_title": "Use of Microblogging for Collective Sense-Making During Violent Crises: A Study of Three Campus Shootings", "paper_id": "WOS:000302158800004"}