{"auto_keywords": [{"score": 0.0486868426803837, "phrase": "intracranial_aneurysm"}, {"score": 0.04472882712454684, "phrase": "fuzzy_logic_approach"}, {"score": 0.00481495049065317, "phrase": "fuzzy_logic"}, {"score": 0.003954837422946628, "phrase": "world_federation"}, {"score": 0.003916098498242888, "phrase": "neurological_surgeons_scale"}, {"score": 0.003820896867623235, "phrase": "fisher_scale"}, {"score": 0.003709693561373117, "phrase": "glasgow_outcome_score"}, {"score": 0.003496868378204657, "phrase": "fuzzy_sets"}, {"score": 0.003445591238183763, "phrase": "wfnss"}, {"score": 0.002576503437739865, "phrase": "fuzzy_model"}, {"score": 0.0024768883044869023, "phrase": "observed_outcome_scores"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fisher scale", " Fuzzy logic", " Intracranial aneurysm", " Outcome score", " Prediction"], "paper_abstract": "We aimed to investigate if the outcome of the patients with intracranial aneurysm could be predicted by fuzzy logic approach. Two hundred and forty two patients with the diagnosis of intracranial aneurysm were assessed retrospectively between January, 2001 and December 2005 We recorded World Federation of Neurological Surgeons Scale (WFNSS), Fisher Scale and age at admission and Glasgow Outcome Score (GOS) at discharge from hospitalization for all the patients We developed fuzzy sets by dividing WFNSS into four groups as good, fair, bad and very bad; age into three groups as young, middle and old, Fisher scale into three groups as few. moderate and large; outcome score Into four groups as bad, fair, good and very good. We calculated the Outcome of the patient with these sets by fuzzy model. Predicted Outcome by fuzzy logic approach correlated with observed outcome scores of the patients (p > 0.05), including 95% confidence interval. We showed that outcome of the patients with aneurysm can be predicted by fuzzy logic approach, accurately (C) 2009 Elsevier Ltd. All rights reserved", "paper_title": "A predictive tool by fuzzy logic for outcome of patients with intracranial aneurysm", "paper_id": "WOS:000272432300017"}