{"auto_keywords": [{"score": 0.04152285779003044, "phrase": "role-based_access_control_models"}, {"score": 0.02968845037805117, "phrase": "administrative_scope"}, {"score": 0.00481495049065317, "phrase": "role-based_access_control"}, {"score": 0.004579005794486596, "phrase": "access_rights"}, {"score": 0.004118026552723285, "phrase": "existing_work"}, {"score": 0.0037869901077566526, "phrase": "transfer_delegations"}, {"score": 0.003561205990687285, "phrase": "transfer_delegation_policies"}, {"score": 0.0034630606658026595, "phrase": "grant_delegation_policies"}, {"score": 0.003202361402737197, "phrase": "grant_delegations"}, {"score": 0.0023675132064088803, "phrase": "workflow_systems"}, {"score": 0.0022013916728990564, "phrase": "administrative_domain"}, {"score": 0.0021049977753042253, "phrase": "worklist-based_workflow_systems"}], "paper_keywords": ["authorization", " delegation", " role-based access control", " transfer", " grant", " workflow"], "paper_abstract": "User delegation is a mechanism for assigning access rights available to one user to another user. A delegation can either be a grant or transfer operation. Existing work on delegation in the context of role-based access control models has extensively studied grant delegations, but transfer delegations have largely been ignored. This is largely because enforcing transfer delegation policies is more complex than grant delegation policies. This paper, primarily, studies transfer delegations for role-based access control models. We also include grant delegations in our model for completeness. We present various mechanisms that authorize delegations in our model. In particular, we show that the use of administrative scope for authorizing delegations is more efficient than using relations. We also discuss the enforcement and revocation of delegations. Finally, we study delegation in the context of workflow systems. In particular, we demonstrate the application of the administrative scope and administrative domain concepts to control delegation of tasks in worklist-based workflow systems.", "paper_title": "Delegation in role-based access control", "paper_id": "WOS:000254455200003"}