{"auto_keywords": [{"score": 0.035899520896415925, "phrase": "k-covered_wsns"}, {"score": 0.02321794821036243, "phrase": "network_connectivity"}, {"score": 0.008349056677243007, "phrase": "fault_tolerance"}, {"score": 0.00544033555216923, "phrase": "sensor_spatial_density"}, {"score": 0.00481495049065317, "phrase": "tolerance_measures"}, {"score": 0.004789189493119298, "phrase": "large-scale_wireless_sensor_networks"}, {"score": 0.0045879792359519375, "phrase": "wireless_sensor_networks"}, {"score": 0.004210458358142504, "phrase": "intrinsic_architectural_feature"}, {"score": 0.004154332348800334, "phrase": "important_role"}, {"score": 0.004121015016128205, "phrase": "application-specific_requirements"}, {"score": 0.0040334640350288, "phrase": "relevant_data"}, {"score": 0.004001112159558637, "phrase": "sensed_field"}, {"score": 0.003701401653850141, "phrase": "tighter_connection"}, {"score": 0.0027991418754844347, "phrase": "helly's_theorem"}, {"score": 0.002717594582706144, "phrase": "k_sensors"}, {"score": 0.002688532127821979, "phrase": "deterministic_approach"}, {"score": 0.002603191465943781, "phrase": "convex_field"}, {"score": 0.0025341419804996387, "phrase": "sensing_range"}, {"score": 0.002388596521516224, "phrase": "new_measure"}, {"score": 0.0022880115261460212, "phrase": "conditional_connectivity"}, {"score": 0.0021682027434117095, "phrase": "large_number"}, {"score": 0.002156571716615371, "phrase": "sensor_failures"}, {"score": 0.002133496107977033, "phrase": "faulty_sensor_set"}, {"score": 0.0021049977753042253, "phrase": "forbidden_faulty_sensor_set"}], "paper_keywords": ["Performance", " Reliability", " Theory", " k-covered wireless sensor networks", " coverage", " connectivity", " fault tolerance"], "paper_abstract": "Connectivity, primarily a graph-theoretic concept, helps define the fault tolerance of wireless sensor networks (WSNs) in the sense that it enables the sensors to communicate with each other so their sensed data can reach the sink. On the other hand, sensing coverage, an intrinsic architectural feature of WSNs plays an important role in meeting application-specific requirements, for example, to reliably extract relevant data about a sensed field. Sensing coverage and network connectivity are not quite orthogonal concepts. In fact, it has been proven that connectivity strongly depends on coverage and hence considerable attention has been paid to establish tighter connection between them although only loose lower bound on network connectivity of WSNs is known. In this article, we investigate connectivity based on the degree of sensing coverage by studying k-covered WSNs, where every location in the field is simultaneously covered (or sensed) by at least k sensors (property known as k-coverage, where k is the degree of coverage). We observe that to derive network connectivity of k-covered WSNs, it is necessary to compute the sensor spatial density required to guarantee k-coverage. More precisely, we propose to use a model, called the Reuleaux Triangle, to characterize k-coverage with the help of Helly's Theorem and the analysis of the intersection of sensing disks of k sensors. Using a deterministic approach, we show that the sensor spatial density to guarantee k-coverage of a convex field is proportional to k and inversely proportional to the sensing range of the sensors. We also prove that network connectivity of k-covered WSNs is higher than their sensing coverage k. Furthermore, we propose a new measure of fault tolerance for k-covered WSNs, called conditional fault tolerance, based on the concepts of conditional connectivity and forbidden faulty sensor set that includes all the neighbors of a given sensor. We prove that k-covered WSNs can sustain a large number of sensor failures provided that the faulty sensor set does not include a forbidden faulty sensor set.", "paper_title": "Fault Tolerance Measures for Large-Scale Wireless Sensor Networks", "paper_id": "WOS:000265879600002"}