{"auto_keywords": [{"score": 0.04488170016920939, "phrase": "negative_data"}, {"score": 0.004230382915464492, "phrase": "actual_business_world"}, {"score": 0.0040449598280454645, "phrase": "dea_models"}, {"score": 0.0037350832473790007, "phrase": "negative_and_non-negative_values"}, {"score": 0.0034660938095219846, "phrase": "constant_returns"}, {"score": 0.0031686717525002935, "phrase": "interesting_and_challenge_questions"}, {"score": 0.0029403531729828574, "phrase": "variable_returns"}, {"score": 0.002882290114822706, "phrase": "vrs"}, {"score": 0.002687922713487696, "phrase": "efficiency_measure"}, {"score": 0.0024327171018928458, "phrase": "negative_input"}, {"score": 0.002408565679880478, "phrase": "output_values"}, {"score": 0.0022799458141165587, "phrase": "dea_literature"}, {"score": 0.002223770196464436, "phrase": "main_results"}, {"score": 0.002168975681697056, "phrase": "illustrative_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data envelopment analysis", " Negative data", " Efficiency", " Returns to scale"], "paper_abstract": "The classic Data Envelopment Analysis (DEA) models developed with the assumption that all inputs and outputs are non-negative, whereas, we may face a case with negative data in the actual business world. So, the need to adapt the DEA models so that they are applicable to cases includes inputs and outputs which can take both negative and non-negative values has been an issue. It can be readily demonstrated that the assumption of constant returns to scale (CRS) is not possible in technologies under negative data. So, one of the interesting and challenge questions is how to determine the state of RTS in the presence of negative data under variable returns to scale (VRS) technology. Accordingly, in this contribution, we first address the efficiency measure and then suggest a method to discover the state of returns to scale (RTS) in the presence of negative input and output values which has not been discussed much enough so far in DEA literature. Finally, the main results are elaborated by some illustrative examples. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Negative data in data envelopment analysis: Efficiency analysis and estimating returns to scale", "paper_id": "WOS:000351645500008"}