{"auto_keywords": [{"score": 0.04000712814709777, "phrase": "newspaper_industry"}, {"score": 0.00781698667371814, "phrase": "open_innovation"}, {"score": 0.0047277417909824745, "phrase": "open_practices"}, {"score": 0.004676173016967478, "phrase": "swedish_newspaper_industry"}, {"score": 0.004642105253191792, "phrase": "organizational_practices"}, {"score": 0.004574709094672837, "phrase": "dialogic_relationship"}, {"score": 0.0044104497301196794, "phrase": "inbound_and_outbound_innovation"}, {"score": 0.004236539316738291, "phrase": "media_industries"}, {"score": 0.003981106369547929, "phrase": "varying_degrees"}, {"score": 0.003952082333580496, "phrase": "interactive_capabilities"}, {"score": 0.0037273513742154237, "phrase": "cautious_apprehension"}, {"score": 0.0036198068824262464, "phrase": "journalism_profession's_carefully_guarded_gatekeeping_practices"}, {"score": 0.0034516024325468653, "phrase": "fiercely_defended_cornerstone"}, {"score": 0.003036468052876648, "phrase": "hollow_title"}, {"score": 0.0025562434609873335, "phrase": "ethnographic_interviews"}, {"score": 0.0025098414374397308, "phrase": "industry-wide_content_analysis"}, {"score": 0.002491519218633145, "phrase": "swedish"}, {"score": 0.0024284249875593253, "phrase": "in-depth_view"}, {"score": 0.0022077244919858218, "phrase": "particularly_charged_information_technology"}, {"score": 0.002136087390959268, "phrase": "great_influence"}, {"score": 0.0021049977753042253, "phrase": "open_practice"}], "paper_keywords": ["Industry", " Interpretive", " Organizational", " Empirical", " Organizational Theory", " Interviews"], "paper_abstract": "Organizational practices that foster a dialogic relationship between organizations and their constituent customers have created an arena for inbound and outbound innovation. At the nexus of this development occurring in the media industries, these flows are carried by various forms of digital, social media and an increasing digital presence in the form of dynamic websites with varying degrees of interactive capabilities. In this paper, we posit that the newspaper industry is torn between indifference and cautious apprehension caused by the difficulty in marrying the journalism profession's carefully guarded gatekeeping practices with the revolving doors of open innovation. Gatekeeping has emerged as a fiercely defended cornerstone for the industry and the profession of journalism itself is not enough to distinguish amateurs from professionals; for the segregation between professionals and amateurs to carry weight rather than being reduced to a hollow title, the segregation needs a practice that explicitly enforces gatekeeping-where actions speak louder than titles. Against this backdrop, we pursue the following research question: Why has IT-enabled open innovation become such a contentious issue in the context of the newspaper industry? Combining contextual in-situ ethnographic interviews and observation with an industry-wide content analysis of Swedish newspaper websites, we present an in-depth view of what IT-enabled open innovation means in the context of the newspaper industry. Results show that the process of legitimization inscribed by a particularly charged information technology-the printing press-continues to exert great influence in what constitutes open practice in the newspaper industry.", "paper_title": "Through the Printing Press: An Account of Open Practices in the Swedish Newspaper Industry", "paper_id": "WOS:000349678200004"}