{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "covert_adversaries"}, {"score": 0.01392136401945069, "phrase": "corrupted_parties"}, {"score": 0.012473497961976302, "phrase": "protocol_specification"}, {"score": 0.004743423032820112, "phrase": "realistic_adversaries"}, {"score": 0.0046589847106386605, "phrase": "secure_multiparty_computation"}, {"score": 0.004589763483242731, "phrase": "mutually_distrustful_parties"}, {"score": 0.004508048086020253, "phrase": "joint_function"}, {"score": 0.004348936976349555, "phrase": "secure_way"}, {"score": 0.0035473867669654174, "phrase": "semi-honest_behavior"}, {"score": 0.0034426417353349567, "phrase": "malicious_adversaries"}, {"score": 0.0031940685896742356, "phrase": "adversarial_behavior"}, {"score": 0.002741091312632307, "phrase": "highly_efficient_protocols"}, {"score": 0.0025127084501976745, "phrase": "particular_way"}, {"score": 0.0022486729928886885, "phrase": "ideal_model"}, {"score": 0.002228519136218028, "phrase": "trusted_party"}, {"score": 0.0021561514733516676, "phrase": "honest_parties"}, {"score": 0.0021049977753042253, "phrase": "good_probability"}], "paper_keywords": ["Secure two-party computation", " Simulation paradigm", " Covert adversaries", " Efficient constructions"], "paper_abstract": "In the setting of secure multiparty computation, a set of mutually distrustful parties wish to securely compute some joint function of their private inputs. The computation should be carried out in a secure way, meaning that no coalition of corrupted parties should be able to learn more than specified or somehow cause the result to be \"incorrect.\" Typically, corrupted parties are either assumed to be semi-honest (meaning that they follow the protocol specification) or malicious (meaning that they may deviate arbitrarily from the protocol). However, in many settings, the assumption regarding semi-honest behavior does not suffice and security in the presence of malicious adversaries is excessive and expensive to achieve. In this paper, we introduce the notion of covert adversaries, which we believe faithfully models the adversarial behavior in many commercial, political, and social settings. Covert adversaries have the property that they may deviate arbitrarily from the protocol specification in an attempt to cheat, but do not wish to be \"caught\" doing so. We provide a definition of security for covert adversaries and show that it is possible to obtain highly efficient protocols that are secure against such adversaries. We stress that in our definition, we quantify over all (possibly malicious) adversaries and do not assume that the adversary behaves in any particular way. Rather, we guarantee that if an adversary deviates from the protocol in a way that would enable it to \"cheat\" (meaning that it can achieve something that is impossible in an ideal model where a trusted party is used to compute the function), then the honest parties are guaranteed to detect this cheating with good probability. We argue that this level of security is sufficient in many settings.", "paper_title": "Security Against Covert Adversaries: Efficient Protocols for Realistic Adversaries", "paper_id": "WOS:000273359500004"}