{"auto_keywords": [{"score": 0.03182678736309614, "phrase": "control_group"}, {"score": 0.03106397644758873, "phrase": "intervention_group"}, {"score": 0.015719716506582524, "phrase": "non-interruptive_medication_laboratory_monitoring_alerts"}, {"score": 0.008771914034252312, "phrase": "baseline_labs"}, {"score": 0.004613516457919661, "phrase": "alert_fatigue"}, {"score": 0.003958197744298249, "phrase": "clinics"}, {"score": 0.003902165732101058, "phrase": "existing_system"}, {"score": 0.0037924666577694222, "phrase": "baseline_laboratory_tests"}, {"score": 0.003752126270661821, "phrase": "new_medications"}, {"score": 0.0034444213065548688, "phrase": "medication_request"}, {"score": 0.0033475472608077823, "phrase": "time_providers"}, {"score": 0.0033119237381809617, "phrase": "laboratory_testing"}, {"score": 0.0032533888943254144, "phrase": "new_prescription_order"}, {"score": 0.0031845067058084613, "phrase": "patient_and_provider_characteristics"}, {"score": 0.0031393948330209224, "phrase": "patient_clustering"}, {"score": 0.0028715299874549245, "phrase": "baseline_lab_tests"}, {"score": 0.0023936956017015696, "phrase": "significant_association"}, {"score": 0.002309754152767196, "phrase": "appropriate_baseline_laboratory_tests"}, {"score": 0.0021893168527276105, "phrase": "recommended_baseline_laboratory_test_monitoring"}, {"score": 0.0021049977753042253, "phrase": "non-critical_recommendations"}], "paper_keywords": [""], "paper_abstract": "Objective: Interruptive alerts within electronic applications can cause \"alert fatigue\" if they fire too frequently or are clinically reasonable only some of the time. We assessed the impact of non-interruptive, real-time medication laboratory alerts on provider lab test ordering. Design: We enrolled 22 Outpatient practices into a prospective, randomized, controlled trial. Clinics either used the existing system or received on-screen recommendations for baseline laboratory tests when prescribing new medications. Since the warnings were non-interruptive, providers did not have to act upon or acknowledge the notification to complete a medication request. Measurements: Data were collected each time providers performed suggested laboratory testing within 14 days of a new prescription order. Findings were adjusted for patient and provider characteristics as well as patient clustering within clinics. Results: Among 12 clinics with 191 providers in the control group and 10 clinics with 175 providers in the intervention group, there were 3673 total events where baseline lab tests would have been advised: 1988 events in the control group and 1685 in the intervention group. In the control group, baseline labs were requested for 771 (39%) of the medications. In the intervention group, baseline labs were ordered by clinicians in 689 (41%) of the cases. Overall, no significant association existed between the intervention and the rate of ordering appropriate baseline laboratory tests. Conclusion: We found that non-interruptive medication laboratory monitoring alerts were not effective in improving receipt of recommended baseline laboratory test monitoring for medications. Further work is necessary to optimize compliance with non-critical recommendations.", "paper_title": "Impact of Non-interruptive Medication Laboratory Monitoring Alerts in Ambulatory Care", "paper_id": "WOS:000262615600011"}