{"auto_keywords": [{"score": 0.04954993714748883, "phrase": "general_relay_channel"}, {"score": 0.009819835595869957, "phrase": "alternative_characterizations"}, {"score": 0.007255364139933054, "phrase": "sliding-window_decoding_strategy"}, {"score": 0.00481495049065317, "phrase": "achievable_rates"}, {"score": 0.00452101969521343, "phrase": "coding_strategies"}, {"score": 0.004356535752468849, "phrase": "relay_channel"}, {"score": 0.003985680946956402, "phrase": "mixed_strategy"}, {"score": 0.003941592232278979, "phrase": "irregular_encoding"}, {"score": 0.003461758868675955, "phrase": "regular_encoding_and_backward_decoding"}, {"score": 0.0033981387193790353, "phrase": "termination_problem"}, {"score": 0.003323330859027428, "phrase": "simple_fix"}, {"score": 0.003120171161064748, "phrase": "seqback_decoding"}, {"score": 0.0029621948240346092, "phrase": "feasibility_constraints"}, {"score": 0.0026012779346272848, "phrase": "rate_expression"}, {"score": 0.0025157865918985704, "phrase": "unknown_quantities"}, {"score": 0.00241509422805775, "phrase": "achievable_rate"}, {"score": 0.0023972232771581753, "phrase": "backward_decoding"}, {"score": 0.002361876178411006, "phrase": "successive_decoding"}, {"score": 0.002267329954548889, "phrase": "simultaneous_decoding"}, {"score": 0.0021049977753042253, "phrase": "aforementioned_termination_problem"}], "paper_keywords": ["Backward decoding", " compress-and-forward", " decode-and-forward", " mixed strategy", " relay channel", " sliding-window decoding"], "paper_abstract": "In this paper, we present results on the equivalence of some coding strategies for the general relay channel. Cover & El Gamal described two basic coding strategies for the relay channel, more commonly known as decode-and-forward and compress-and-forward. These two strategies were combined in a mixed strategy that employed irregular encoding and successive forward decoding to give a tighter lower bound for the capacity of the general relay channel. Recently, the authors presented two different mixed strategies, SeqBack decoding and SimBack decoding, that make use of regular encoding and backward decoding. We identify a termination problem in SeqBack/SimBack decoding and present a simple fix. Next, we compare the rates achievable with the various mixed strategies. We first show that SeqBack decoding and SimBack decoding achieve the same rate. We then present alternative characterizations, without feasibility constraints, for the rates achievable with the various mixed strategies. Comparing the alternative characterizations, we note that the rate of SeqBack/SimBack decoding contains the rate of Cover & El Gamal's mixed strategy since there is a more relaxed inequality in the rate expression. We also prove that simultaneously decoding all unknown quantities in each block at the receiver does not increase the achievable rate for backward decoding. Hence, successive decoding in each block proves to be just as effective as simultaneous decoding. Finally, we present a sliding-window decoding strategy that achieves the same rate as SeqBack/SimBack decoding. The sliding-window decoding strategy also avoids the aforementioned termination problem as the receiver commences decoding after three block decoding delay.", "paper_title": "On Achievable Rates for the General Relay Channel", "paper_id": "WOS:000287657200005"}