{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "frequent_closed_itemsets"}, {"score": 0.015479200759850795, "phrase": "large_database"}, {"score": 0.011600590547300756, "phrase": "non-overlapping_clusters"}, {"score": 0.011074000938633992, "phrase": "unique_closed_tidset"}, {"score": 0.008247091233814775, "phrase": "closeminer"}, {"score": 0.004691465925553365, "phrase": "previous_research"}, {"score": 0.004500414250942443, "phrase": "complete_set"}, {"score": 0.004453874101119545, "phrase": "frequent_itemsets"}, {"score": 0.003911010373894104, "phrase": "information_loss"}, {"score": 0.0028771413440398614, "phrase": "closed_itemsets"}, {"score": 0.002206045784326466, "phrase": "real_and_synthetic_databases"}, {"score": 0.002127046102734894, "phrase": "existing_systems_apriori"}, {"score": 0.0021049982455464515, "phrase": "charm."}], "paper_keywords": ["frequent closed itemsets", " closed tidsets", " reduced IT-tree", " lattice"], "paper_abstract": "Previous research revealed that the problem of discovering a complete set of frequent itemsets from a large database can be reduced to the problem of discovering the frequent closed itemsets, and this process results in a much smaller set of itemsets without information loss. This article is based on the observation that the set of all itemsets can be grouped into non-overlapping clusters such that each cluster is identified by a unique closed tidset. It is also found that there is only one closed itemset in each cluster and it is the superset of all itemsets with the same support. Therefore, the problem of discovering closed itemsets can be further considered as the problem of clustering the set of itemsets and then identifying each cluster by a unique closed tidset. This article presents CloseMiner, a new algorithm for discovering all frequent closed itemsets by grouping the set of itemsets into non-overlapping clusters. Experimental evaluation based on a number of real and synthetic databases has proved that CloseMiner outperforms the existing systems APRIORI and CHARM.", "paper_title": "An algorithm for discovering the frequent closed itemsets in a large database", "paper_id": "WOS:000241787300005"}