{"auto_keywords": [{"score": 0.045417031794566444, "phrase": "rank_aggregation"}, {"score": 0.004827390261392999, "phrase": "analysis"}, {"score": 0.004682708592184678, "phrase": "multiple_rankings"}, {"score": 0.004575272950516775, "phrase": "active_research_topic"}, {"score": 0.004491093879657087, "phrase": "database_community"}, {"score": 0.0039252049353279556, "phrase": "original_studies"}, {"score": 0.003888905257972882, "phrase": "different_approaches"}, {"score": 0.003712362078915926, "phrase": "real_applications"}, {"score": 0.002997735656669146, "phrase": "first_large_scale_study"}, {"score": 0.0027698788736535865, "phrase": "aggregation_algorithms"}, {"score": 0.0025592969422491476, "phrase": "first_implementation"}, {"score": 0.0025121156016001864, "phrase": "exact_solution"}, {"score": 0.0024543571925896073, "phrase": "ties_problem"}, {"score": 0.002267708463966758, "phrase": "real_and_carefully_generated_synthetic_datasets"}, {"score": 0.0021049977753042253, "phrase": "dataset_features"}], "paper_keywords": [""], "paper_abstract": "The problem of aggregating multiple rankings into one consensus ranking is an active research topic especially in the database community. Various studies have implemented methods for rank aggregation and may have come up with contradicting conclusions upon which algorithms work best. Comparing such results is cumbersome, as the original studies mixed different approaches and used very different evaluation datasets and metrics. Additionally, in real applications, the rankings to be aggregated may not be permutations where elements are strictly ordered, but they may have ties where some elements are placed at the same position. However, most of the studies have not considered ties. This paper introduces the first large scale study of algorithms for rank aggregation with ties. More precisely, (i) we review rank aggregation algorithms and determine whether or not they can handle ties; (ii) we propose the first implementation to compute the exact solution of the Rank Aggregation with ties problem; (iii) we evaluate algorithms for rank aggregation with ties on a very large panel of both real and carefully generated synthetic datasets; (iv) we provide guidance on the algorithms to be favored depending on dataset features.", "paper_title": "Rank aggregation with ties: Experiments and Analysis", "paper_id": "WOS:000362283300008"}