{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "malaysian_firms"}, {"score": 0.04005920689564767, "phrase": "scm_practices"}, {"score": 0.011997123742466071, "phrase": "organizational_and_innovation_performance"}, {"score": 0.011621076987895246, "phrase": "scm"}, {"score": 0.00444377150105556, "phrase": "supply_chain_management"}, {"score": 0.00437302709192313, "phrase": "operational_performance"}, {"score": 0.004338076511024884, "phrase": "innovation_performance"}, {"score": 0.004303404058571052, "phrase": "malaysian_manufacturing_and_service_firms"}, {"score": 0.003939748053452577, "phrase": "structural_equation_modeling"}, {"score": 0.003635791194756363, "phrase": "malaysian"}, {"score": 0.003592258384936271, "phrase": "innovation_improvement"}, {"score": 0.0034926916198124484, "phrase": "better_organizational_performance"}, {"score": 0.0033958751452139984, "phrase": "manufacturing_and_service_firms"}, {"score": 0.0033687153556728328, "phrase": "malaysia"}, {"score": 0.003301733505307784, "phrase": "significant_difference"}, {"score": 0.003034633345146293, "phrase": "cross-sectional_data"}, {"score": 0.0025224615049571427, "phrase": "multi-dimensional_construct"}, {"score": 0.0024230746206056536, "phrase": "decision_makers"}, {"score": 0.0021738146596180404, "phrase": "organizational_and_innovation_performances"}, {"score": 0.0021049977753042253, "phrase": "developing_country"}], "paper_keywords": ["Supply chain management", " Organizational innovation", " Organizational performance", " Malaysia", " Developing countries"], "paper_abstract": "Purpose - The purpose of this paper is to empirically test a framework which identifies the relationships between supply chain management (SCM) practices, operational performance and innovation performance of Malaysian manufacturing and service firms. Design/methodology/approach - Data for the study were collected from a sample of 163 Malaysian manufacturing and service firms. The research model was tested using structural equation modeling. Findings - The results show that SCM practices in both the upstream and downstream supply chain have a direct and significant impact on organizational and innovation performance of Malaysian firms. Innovation improvement caused by SCM also results in better organizational performance. The findings also reveal that manufacturing and service firms in Malaysia do not have a significant difference in their SCM practices. Research limitations/implications - The time sequence of the association between the variables could not be concluded given that cross-sectional data were used. This study also focuse only on Malaysian firms. Practical implications - This paper shows the importance of SCM practices and how they directly influence organizational and innovation performance. This result will be encouraging to firms in other developing countries. This paper has developed and validated a multi-dimensional construct of SCM practices, and this tool can assist decision makers of Malaysian firms to evaluate the efficiency of their current SCM practices. Originality/value - The paper presents one of the few studies which empirically validates the relationships between SCM practices and organizational and innovation performances. The study also focuses on a developing country which is in transition from being manufacturing focused to service focused.", "paper_title": "Can Malaysian firms improve organizational/innovation performance via SCM?", "paper_id": "WOS:000291136900005"}