{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "human_t_helper_cell_differentiation_process"}, {"score": 0.00481495049065317, "phrase": "gene_coexpression_networks"}, {"score": 0.004513957235071457, "phrase": "novel_holistic_approach"}, {"score": 0.004456044928556639, "phrase": "data_analysis"}, {"score": 0.004342430078306461, "phrase": "appropriate_cutoff_threshold"}, {"score": 0.004249957578636515, "phrase": "gene-gene_interaction"}, {"score": 0.004106063237069123, "phrase": "critical_task"}, {"score": 0.0037834649508375544, "phrase": "traditional_approaches"}, {"score": 0.0036710872046569532, "phrase": "pre-defined_cutoff"}, {"score": 0.0033391018638565715, "phrase": "systematic_procedure"}, {"score": 0.0032820385246266773, "phrase": "cutoff_threshold"}, {"score": 0.0032538723984338615, "phrase": "coexpression_networks"}, {"score": 0.0029467742734417255, "phrase": "robust_estimate"}, {"score": 0.0029214769181390653, "phrase": "individual_degree_distributions"}, {"score": 0.0028715299874549245, "phrase": "multiple_microarray_studies"}, {"score": 0.0028346293790895024, "phrase": "different_array_platforms"}, {"score": 0.002810292047426252, "phrase": "experimental_designs"}, {"score": 0.002703327151461985, "phrase": "corresponding_phenotypes"}, {"score": 0.0023958326775913165, "phrase": "expression_change"}, {"score": 0.0022168460543913787, "phrase": "differentiation_process"}, {"score": 0.0021416404045850224, "phrase": "supplementary_data"}, {"score": 0.0021050918136607407, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Coexpression networks have recently emerged as a novel holistic approach to microarray data analysis and interpretation. Choosing an appropriate cutoff threshold, above which a gene-gene interaction is considered as relevant, is a critical task in most network-centric applications, especially when two or more networks are being compared. Results: We demonstrate that the performance of traditional approaches, which are based on a pre-defined cutoff or significance level, can vary drastically depending on the type of data and application. Therefore, we introduce a systematic procedure for estimating a cutoff threshold of coexpression networks directly from their topological properties. Both synthetic and real datasets show clear benefits of our data-driven approach under various practical circumstances. In particular, the procedure provides a robust estimate of individual degree distributions, even from multiple microarray studies performed with different array platforms or experimental designs, which can be used to discriminate the corresponding phenotypes. Application to human T helper cell differentiation process provides useful insights into the components and interactions controlling this process, many of which would have remained unidentified on the basis of expression change alone. Moreover, several human-mouse orthologs showed conserved topological changes in both systems, suggesting their potential importance in the differentiation process. Contact: laliel@utu.fi Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "Systematic construction of gene coexpression networks with applications to human T helper cell differentiation process", "paper_id": "WOS:000249818300009"}