{"auto_keywords": [{"score": 0.03736108349380211, "phrase": "metrics'_categorization"}, {"score": 0.015719716506582538, "phrase": "object-oriented_software_maintainability"}, {"score": 0.014870257818704501, "phrase": "complementarily"}, {"score": 0.004719359108879602, "phrase": "metrics'_catalogs"}, {"score": 0.004681653551412616, "phrase": "object-oriented_programming"}, {"score": 0.004497576466646301, "phrase": "software_maintainability"}, {"score": 0.004355516897622305, "phrase": "important_role"}, {"score": 0.00432070565627091, "phrase": "quality_level"}, {"score": 0.003971502222405927, "phrase": "large_number"}, {"score": 0.0038152404172111815, "phrase": "decision-making_process"}, {"score": 0.0036651045014561767, "phrase": "oosm"}, {"score": 0.0036212219870826725, "phrase": "hard_task"}, {"score": 0.0032231139180761183, "phrase": "oosm_metrics_adoption"}, {"score": 0.003146360480030653, "phrase": "oosm_metrics_catalog"}, {"score": 0.0029034358982402346, "phrase": "coverage_index"}, {"score": 0.0026577673946415583, "phrase": "confidential_level"}, {"score": 0.0025224615049571427, "phrase": "experts'_opinion"}, {"score": 0.0022721178679337025, "phrase": "first_evidences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software maintainability", " Metrics", " Object-Oriented Software Development"], "paper_abstract": "Object-Oriented Programming is one of the most used paradigms. Complementarily, the software maintainability is considered a software attribute playing an important role in quality level. In this context, Object-Oriented Software Maintainability (OOSM) has been studied through years, and many researchers have proposed a large number of metrics to measure it. Consequently, the decision-making process about which metrics can be adopted in experiments on OOSM is a hard task. Therefore, a metrics' categorization has been proposed to facilitate this process. As result, 7 categories and 17 subcategories were identified. These categories represent the scenarios of OOSM metrics adoption, and a family of OOSM metrics catalog was generated based on the selection of a metrics' categorization. Additionally, a quasi-experiment was conducted to check the coverage index of the catalogs generated using our approach over the catalogs suggested by experts. 90% of coverage was obtained with 99% of confidential level using the Wilcoxon Test. Complementarily, a survey was conducted to check the experts' opinion about the catalog generated by the portal when they were compared by the catalogs suggested by them. Therefore, this evaluation can be the first evidences of the usefulness of the family of the catalogs based on the metrics' categorization. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Classifying metrics for assessing Object-Oriented Software Maintainability: A family of metrics' catalogs", "paper_id": "WOS:000351971500006"}