{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "memory_lifetimes"}, {"score": 0.004663533386096864, "phrase": "perceptron-based_framework"}, {"score": 0.004516856326107826, "phrase": "mean_first_passage_time"}, {"score": 0.004455409162867219, "phrase": "perceptron's_total_input"}, {"score": 0.004356743923470188, "phrase": "perceptron's_firing_threshold"}, {"score": 0.00419861271409079, "phrase": "simplest_memory-related_model"}, {"score": 0.0040479661688863884, "phrase": "exact_results"}, {"score": 0.0039027036493682887, "phrase": "continuum_limit"}, {"score": 0.0037454814403672697, "phrase": "extremely_good_quantitative_agreement"}, {"score": 0.003611034322786669, "phrase": "memory_dynamics"}, {"score": 0.003545625043276134, "phrase": "well-understood_ornstein-uhlenbeck_process"}, {"score": 0.0031627430133087616, "phrase": "standard_results"}, {"score": 0.0031339552246625463, "phrase": "signal-to-noise_ratio_analyses"}, {"score": 0.0028340217672278975, "phrase": "massive_overestimate"}, {"score": 0.002795403543184537, "phrase": "minimum_number"}, {"score": 0.0027322025124213566, "phrase": "successful_memory_encoding"}, {"score": 0.0025627194819793347, "phrase": "remarkable_result"}, {"score": 0.002275299774554847, "phrase": "asymptotic_result"}, {"score": 0.002244277924422011, "phrase": "strict_upper_bound"}, {"score": 0.0021834945657804193, "phrase": "asymptotic_regime"}, {"score": 0.002153721702591034, "phrase": "classic_logarithmic_growth"}], "paper_keywords": [""], "paper_abstract": "We study memory lifetimes in a perceptron-based framework with binary synapses, using the mean first passage time for the perceptron's total input to fall below firing threshold to define memory lifetimes. Working with the simplest memory-related model of synaptic plasticity, we may obtain exact results for memory lifetimes or, working in the continuum limit, good analytical approximations that afford either much qualitative insight or extremely good quantitative agreement. In one particular limit, we find that memory dynamics reduce to the well-understood Ornstein-Uhlenbeck process. We show that asymptotically, the lifetimes of memories grow logarithmically in the number of synapses when the perceptron's firing threshold is zero, reproducing standard results from signal-to-noise ratio analyses. However, this is only an asymptotically valid result, and we show that extending its application outside the range of its validity leads to a massive overestimate of the minimum number of synapses required for successful memory encoding. In the case that the perceptron's firing threshold is positive, we find the remarkable result that memory lifetimes are strictly bounded from above. Asymptotically, the dependence of memory lifetimes on the number of synapses drops out entirely, and this asymptotic result provides a strict upper bound on memory lifetimes away from this asymptotic regime. The classic logarithmic growth of memory lifetimes in the simplest, palimpsest memories is therefore untypical and nongeneric: memory lifetimes are typically strictly bounded from above.", "paper_title": "Memory Nearly on a Spring: A Mean First Passage Time Approach to Memory Lifetimes", "paper_id": "WOS:000340214300003"}