{"auto_keywords": [{"score": 0.043692086897500614, "phrase": "child_machine"}, {"score": 0.015390967307927085, "phrase": "blank_slate"}, {"score": 0.00481495049065317, "phrase": "recent_psychological_studies"}, {"score": 0.0046797114400479135, "phrase": "important_innate_capabilities"}, {"score": 0.004646496622257368, "phrase": "important_part"}, {"score": 0.00452670409375785, "phrase": "three-dimensional_world"}, {"score": 0.004215397034321004, "phrase": "artificial_intelligence"}, {"score": 0.004087207102190335, "phrase": "human_child"}, {"score": 0.003842358763279932, "phrase": "human_baby"}, {"score": 0.0035779458261087486, "phrase": "wishful_thinking"}, {"score": 0.0035525230119401153, "phrase": "innate_mental_structure"}, {"score": 0.0034280837697767976, "phrase": "universal_grammar"}, {"score": 0.0034118234596993836, "phrase": "linguistic_syntax"}, {"score": 0.0033875770020590796, "phrase": "noam_chomsky"}, {"score": 0.0030078460113945136, "phrase": "sensory_inputs"}, {"score": 0.0029024303666003153, "phrase": "intermediate_points"}, {"score": 0.002715412462132954, "phrase": "adequate_mental_structures"}, {"score": 0.002664221051021009, "phrase": "designer_stance"}, {"score": 0.002576941349223576, "phrase": "universal_human_mental_structures"}, {"score": 0.0022500695985527668, "phrase": "static_view"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "This article is inspired by recent psychological studies confirming that a child is not born a blank slate but has important innate capabilities. An important part of the \"learning\" required to deal with the three-dimensional world of objects, processes, and other beings was done by evolution. Each child need not do this learning itself. By the 1950s there were already proposals to advance artificial intelligence by building a child machine that would learn from experience just as a human child does. What innate knowledge the child machine should be equipped with was ignored. I suppose the child machine was supposed to be a blank slate. Whatever innate knowledge a human baby may possess, we are interested in a well-designed that has all we can give it. To some extent, this paper is an exercise in wishful thinking. The innate mental structure that equips a child to interact successfully with the world includes more than the universal grammar of linguistic syntax postulated by Noam Chomsky. The world itself has structures, and nature has evolved brains with ways of recognizing them and representing information about them. For example, objects continue to exist when not being perceived, and children (and dogs) are very likely \"designed\" to interpret sensory inputs in terms of such persistent objects. Moreover, objects usually move continuously, passing through intermediate points, and perceiving motion that way may also be innate. What a child learns about the world is based on its innate mental structure. This article concerns designing adequate mental structures including a language of thought. This designer stance applies to designing robots, but we also hope it will help understand universal human mental structures. We consider what structures would be useful and how the innateness of a few of the structures might be tested experimentally in humans and animals. In the course of its existence we'll want our robot child to change. Some of the changes will be development, others learning. However, this article mainly takes a static view, because we don't know how to treat growth and development and can do only a little with learning. (C) 2008 Published by Elsevier B.V.", "paper_title": "The well-designed child", "paper_id": "WOS:000261858300004"}