{"auto_keywords": [{"score": 0.049258807258834955, "phrase": "electronic_personal_health_record"}, {"score": 0.03369546969126079, "phrase": "electronic_personal_health_records"}, {"score": 0.008030818016001256, "phrase": "electronic_personal_health_record_users"}, {"score": 0.00481495049065317, "phrase": "electronic_personal_health_record_use_among_nurses"}, {"score": 0.004683618147754759, "phrase": "patient-centric_tool"}, {"score": 0.004462308985053246, "phrase": "healthcare_providers"}, {"score": 0.0043706785731816265, "phrase": "nursing_informatics_community"}, {"score": 0.004325568312096711, "phrase": "early_adopters"}, {"score": 0.004135387221172467, "phrase": "personal_adoption"}, {"score": 0.003953534569134559, "phrase": "nurse_members"}, {"score": 0.0038323244983352587, "phrase": "multiple_logistic_regression_analysis"}, {"score": 0.0037148167062767096, "phrase": "electronic_personal_health_record_use"}, {"score": 0.0033484464719654105, "phrase": "clinical_informatics_specialists"}, {"score": 0.003325343504284345, "phrase": "chief_nursing_informatics_officers"}, {"score": 0.0032682787834955856, "phrase": "electronic_health_records"}, {"score": 0.0029356335847783195, "phrase": "health_information"}, {"score": 0.002692132776447632, "phrase": "practice_region"}, {"score": 0.0026735459686033627, "phrase": "informatics_nurses"}, {"score": 0.0025914765323897604, "phrase": "prime_position"}, {"score": 0.0024945743145462144, "phrase": "policy_efforts"}, {"score": 0.0022020103573658035, "phrase": "new_technology"}], "paper_keywords": ["Electronic health record", " Health care provider", " Nursing informatics", " Personal health record", " Privacy"], "paper_abstract": "An electronic personal health record is a patient-centric tool that enables patients to securely access, manage, and share their health information with healthcare providers. It is presumed the nursing informatics community would be early adopters of electronic personal health record, yet no studies have been identified that examine the personal adoption of electronic personal health record's for their own healthcare. For this study, we sampled nurse members of the American Medical Informatics Association and the Healthcare Information and Management Systems Society with 183 responding. Multiple logistic regression analysis was used to identify those factors associated with electronic personal health record use. Overall, 72% were electronic personal health record users. Users tended to be older (aged 950 years), be more highly educated (72% master's or doctoral degrees), and hold positions as clinical informatics specialists or chief nursing informatics officers. Those whose healthcare providers used electronic health records were significantly more likely to use electronic personal health records (odds ratio, 5.99; 95% confidence interval, 1.40-25.61). Electronic personal health record users were significantly less concerned about privacy of health information online than nonusers (odds ratio, 0.32; 95% confidence interval, 0.14-0.70) adjusted for ethnicity, race, and practice region. Informatics nurses, with their patient-centered view of technology, are in prime position to influence development of electronic personal health records. Our findings can inform policy efforts to encourage informatics and other professional nursing groups to become leaders and users of electronic personal health record; such use could help them endorse and engage patients to use electronic personal health records. Having champions with expertise in and enthusiasm for the new technology can promote the adoption of electronic personal health records among healthcare providers as well as their patients.", "paper_title": "Electronic Personal Health Record Use Among Nurses in the Nursing Informatics Community", "paper_id": "WOS:000369628500005"}