{"auto_keywords": [{"score": 0.035499310873517695, "phrase": "icall"}, {"score": 0.012668526499074594, "phrase": "minor_alleles"}, {"score": 0.0074142057175632815, "phrase": "zcall"}, {"score": 0.004697655699119423, "phrase": "illumina_exome_array"}, {"score": 0.004621043537046209, "phrase": "next-generation_genotyping_microarrays"}, {"score": 0.00445318311339027, "phrase": "whole-exome_sequencing_studies"}, {"score": 0.004238775572746022, "phrase": "lower_frequencies"}, {"score": 0.004084744133085742, "phrase": "hybridization_intensities"}, {"score": 0.003824547895167011, "phrase": "allele_counts"}, {"score": 0.0037621210719690594, "phrase": "existing_algorithms"}, {"score": 0.0036703791815812328, "phrase": "common_variants"}, {"score": 0.0035515148917169173, "phrase": "accurate_calls"}, {"score": 0.0034935290662899488, "phrase": "rare_variants"}, {"score": 0.003394314924677555, "phrase": "new_calling_algorithm"}, {"score": 0.003244050414264445, "phrase": "whole_spectrum"}, {"score": 0.0032174507570710835, "phrase": "allele_frequencies"}, {"score": 0.002867098884583832, "phrase": "illumina_humanexome_beadchip"}, {"score": 0.002762774046280398, "phrase": "whole-genome_sequenced"}, {"score": 0.002391825892939338, "phrase": "calling_accuracy"}, {"score": 0.002323826502178581, "phrase": "principal_concern"}, {"score": 0.002304754792740636, "phrase": "rare_and_low-frequency_variants"}, {"score": 0.002166607745253829, "phrase": "marginally_improved_performance"}, {"score": 0.0021049977753042253, "phrase": "gencall"}], "paper_keywords": [""], "paper_abstract": "Motivation: Next-generation genotyping microarrays have been designed with insights from 1000 Genomes Project and whole-exome sequencing studies. These arrays additionally include variants that are typically present at lower frequencies. Determining the genotypes of these variants from hybridization intensities is challenging because there is less support to locate the presence of the minor alleles when the allele counts are low. Existing algorithms are mainly designed for calling common variants and are notorious for failing to generate accurate calls for low-frequency and rare variants. Here, we introduce a new calling algorithm, iCall, to call genotypes for variants across the whole spectrum of allele frequencies. Results: We benchmarked iCall against four of the most commonly used algorithms, GenCall, optiCall, illuminus and GenoSNP, as well as a post-processing caller zCall that adopted a two-stage calling design. Normalized hybridization intensities for 12 370 individuals genotyped on the Illumina HumanExome BeadChip were considered, of which 81 individuals were also whole-genome sequenced. The sequence calls were used to benchmark the accuracy of the genotype calling, and our comparisons indicated that iCall outperforms all four single-stage calling algorithms in terms of call rates and concordance, particularly in the calling accuracy of minor alleles, which is the principal concern for rare and low-frequency variants. The application of zCall to post-process the output from iCall also produced marginally improved performance to the combination of zCall and GenCall.", "paper_title": "iCall: a genotype-calling algorithm for rare, low-frequency and common variants on the Illumina exome array", "paper_id": "WOS:000338109200048"}