{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "slovene_wikipedia"}, {"score": 0.013370475417172687, "phrase": "featured_articles"}, {"score": 0.006818782825201734, "phrase": "random_articles"}, {"score": 0.004776853267973129, "phrase": "purpose_-_the_purpose"}, {"score": 0.004091130285858113, "phrase": "clearer_picture"}, {"score": 0.0031592690527974285, "phrase": "english_wikipedia"}, {"score": 0.002705121052747945, "phrase": "biggest_research_limitation"}, {"score": 0.00267301171407926, "phrase": "ever_changing_nature"}, {"score": 0.00265183888884182, "phrase": "wikipedia"}, {"score": 0.002372103459168231, "phrase": "first_such_research"}, {"score": 0.0022977342663599042, "phrase": "citation_analysis"}, {"score": 0.0022168460543913787, "phrase": "valuable_information"}], "paper_keywords": ["Citation analysis", " Article completeness", " Featured articles", " Slovene Wikipedia"], "paper_abstract": "Purpose - The purpose of this research was to examine the number and type of sources cited by featured articles from the Slovene Wikipedia with the purpose of assessing their quality. A sample of random articles was also procured in order to give a clearer picture of the content of the Slovene Wikipedia. Design/methodology/approach - A research was conducted on 122 featured articles from the Slovene Wikipedia from 2009, 2010 and 2011. The following aspects of the articles were analyzed: topic and originality of the article and number, language and type of sources cited. Findings - The results have shown that most of the featured articles are adapted from the English Wikipedia, the most common topics being science, sports and history. Based on these results the authors have concluded that despite some deficiencies the featured articles on the Slovene Wikipedia are of much higher quality compared to random articles. Research limitations/implications - The biggest research limitation is the ever changing nature of Wikipedia and its articles, which hinders the process of analyzing results and relying on these results to be relevant in the future. Originality/value - This is the first such research of the Slovene Wikipedia that deals specifically with citation analysis of featured articles. Results of this research offer valuable information to both editors of featured articles and users, as they point out certain deficiencies, which can be eliminated.", "paper_title": "The completeness of articles and citation in the Slovene Wikipedia", "paper_id": "WOS:000332050700004"}