{"auto_keywords": [{"score": 0.02457498043477889, "phrase": "co"}, {"score": 0.0059236850927290394, "phrase": "fortran"}, {"score": 0.004716031208088975, "phrase": "basic_analysis"}, {"score": 0.004580933283492972, "phrase": "deep_sedimentary_basin_conditions"}, {"score": 0.0039120325834029355, "phrase": "compressibility_factor"}, {"score": 0.003690927840780375, "phrase": "gaseous_and_supercritical_phases"}, {"score": 0.0030995835539697893, "phrase": "kwong's_original_algorithm"}, {"score": 0.0029121251930855664, "phrase": "span_and_wagner"}, {"score": 0.0027020387992490367, "phrase": "brief_comparison"}, {"score": 0.002646412155387084, "phrase": "source_codes"}, {"score": 0.0024656866249273125, "phrase": "specified_p-t_conditions"}, {"score": 0.0023948981440134478, "phrase": "existing_fortran_multiphase_fluid_simulation_packages"}, {"score": 0.0023261372216194383, "phrase": "fundamental_analyses"}, {"score": 0.0022036216160494925, "phrase": "brine_processes"}, {"score": 0.0021853532419450887, "phrase": "reactive_transport"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["carbon dioxide", " sequestration", " sedimentary basin", " equation of state", " multiphase"], "paper_abstract": "The purpose of the study presented in this manuscript is to describe and make available two equation-of-state (EOS) algorithms assembled for multiphase flow and transport of carbon dioxide (CO(2)). The algorithms presented here calculate solubility, compressibility factor, density, viscosity, fugacity, and enthalpy of CO(2) in gaseous and supercritical phases, and mixtures or solutions of CO(2) in water, as functions of pressure and temperature. Several features distinguish the two algorithms, but the primary distinction concerns treatment of supercritical/gas-phase CO(2): one EOS we assembled is based on Redlich and Kwong's original algorithm developed in 1949, and the other is based on an algorithm developed by Span and Wagner in 1996. Both were modified for application to sedimentary basin studies of multiphase CO(2) flow processes, including carbon sequestration applications. We present a brief comparison of these two EOS algorithms. Source codes for both algorithms are provided, including \"stand-alone\" Matlab (C) scripts for the interactive calculation of fluid properties at specified P-T conditions and FORTRAN subroutines for inclusion in existing FORTRAN multiphase fluid simulation packages. These routines are intended for fundamental analyses of CO, sequestration and the like; more advanced studies, such as brine processes and reactive transport, require more advanced EOS algorithms. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Two equations of state assembled for basic analysis of multiphase CO(2) flow and in deep sedimentary basin conditions", "paper_id": "WOS:000255541200001"}