{"auto_keywords": [{"score": 0.04096982442153626, "phrase": "netcar"}, {"score": 0.00481495049065317, "phrase": "class_association_rule_mining"}, {"score": 0.004744748477093856, "phrase": "microbial_phenotypes"}, {"score": 0.004641351004344458, "phrase": "concerted_action"}, {"score": 0.0046073860169839305, "phrase": "multiple_gene_functions"}, {"score": 0.004392565073466714, "phrase": "observed_phenotype"}, {"score": 0.00373682045166829, "phrase": "orthologous_groups"}, {"score": 0.003615217162972726, "phrase": "cog_phylogenetic_profiles"}, {"score": 0.0035755653799043, "phrase": "phenotype_profile"}, {"score": 0.003484721713676736, "phrase": "phylogenetic_co-occurrence_graph"}, {"score": 0.0034212450542713607, "phrase": "hypothesis_space"}, {"score": 0.0033712944392793195, "phrase": "mutual_information"}, {"score": 0.0033220706785945815, "phrase": "biconditional_relation"}, {"score": 0.0032376465741070274, "phrase": "mining_capability"}, {"score": 0.0030414140732789186, "phrase": "six_microbial_phenotypes"}, {"score": 0.002910092930310001, "phrase": "gram"}, {"score": 0.002763988044737562, "phrase": "false_discovery_rate"}, {"score": 0.0025490525773769063, "phrase": "association_networks"}, {"score": 0.00238565827614317, "phrase": "six_phenotypes"}, {"score": 0.0023507916951658455, "phrase": "well-connected_network"}, {"score": 0.002265833357217618, "phrase": "aerobic_and_intermediate_topologies"}, {"score": 0.002200077887697072, "phrase": "standard_car_mining_algorithm"}, {"score": 0.002183938718432764, "phrase": "carapriori"}], "paper_keywords": [""], "paper_abstract": "Motivation: Microbial phenotypes are typically due to the concerted action of multiple gene functions, yet the presence of each gene may have only a weak correlation with the observed phenotype. Hence, it may be more appropriate to examine co-occurrence between sets of genes and a phenotype (multiple-to-one) instead of pairwise relations between a single gene and the phenotype. Here, we propose an efficient class association rule mining algorithm, NETCAR, in order to extract sets of COGs (clusters of orthologous groups of proteins) associated with a phenotype from COG phylogenetic profiles and a phenotype profile. NETCAR takes into account the phylogenetic co-occurrence graph between COGs to restrict hypothesis space, and uses mutual information to evaluate the biconditional relation. Results: We examined the mining capability of pairwise and multiple-to-one association by using NETCAR to extract COGs relevant to six microbial phenotypes (aerobic, anaerobic, facultative, endospore, motility and Gram negative) from 11 969 unique COG profiles across 155 prokaryotic organisms. With the same level of false discovery rate, multiple-to-one association can extract about 10 times more relevant COGs than one-to-one association. We also reveal various topologies of association networks among COGs (modules) from extracted multiple-to-one correlation rules relevant with the six phenotypes; including a well-connected network for motility, a star-shaped network for aerobic and intermediate topologies for the other phenotypes. NETCAR outperforms a standard CAR mining algorithm, CARAPRIORI, while requiring several orders of magnitude less computational time for extracting 3-COG sets.", "paper_title": "Microbial genotype-phenotype mapping by class association rule mining", "paper_id": "WOS:000257169700008"}