{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "qualitative_and_quantitative_security_obligations"}, {"score": 0.004017989546119125, "phrase": "operational_processes"}, {"score": 0.0036079110889031874, "phrase": "unnecessary_productivity_loss"}, {"score": 0.0031457622320220364, "phrase": "security_obligations"}, {"score": 0.002995427206425849, "phrase": "external_agents"}, {"score": 0.002852256089630964, "phrase": "logic-based_and_graph-based_approaches"}, {"score": 0.0025608471909800076, "phrase": "associated_refinements"}, {"score": 0.002474505516708906, "phrase": "graph-based_model"}, {"score": 0.002414616656410503, "phrase": "associated_quantitative_analysis"}, {"score": 0.0021891781017389783, "phrase": "security_policies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Graphs", " Logics", " Obligations", " Prohibitions", " Refinement", " Security policies"], "paper_abstract": "Security policies in organisations typically take the form of obligations for the employees. However, it is often unclear what the purpose of such obligations is, and how these can be integrated in the operational processes of the organisation. This can result in policies that may be either too strong or too weak, leading to unnecessary productivity loss, or the possibility of becoming victim to attacks that exploit the weaknesses, respectively. In this paper, we propose a framework in which the security obligations of employees are linked directly to prohibitions that prevent external agents (attackers) from reaching their goals. We use logic-based and graph-based approaches to formalise and reason about such policies, and show how the framework can be used to verify correctness of the associated refinements. Finally, we extend the graph-based model with quantitative policies and associated quantitative analysis, based on the time an adversary needs for an attack. The framework can assist organisations in aligning security policies with their threat model. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Effectiveness of qualitative and quantitative security obligations", "paper_id": "WOS:000362220400002"}