{"auto_keywords": [{"score": 0.04066031201468573, "phrase": "informal_documents"}, {"score": 0.010612387000973441, "phrase": "human_information_behavior"}, {"score": 0.0046364836476864325, "phrase": "research_study"}, {"score": 0.004593515204618522, "phrase": "trace"}, {"score": 0.004422632150619634, "phrase": "particular_aspect"}, {"score": 0.004339867166576126, "phrase": "children's_information_creation"}, {"score": 0.003930000775297499, "phrase": "theoretical_frameworks"}, {"score": 0.003820144626025562, "phrase": "information_genre"}, {"score": 0.003766369160795001, "phrase": "previous_studies"}, {"score": 0.0033465923623290034, "phrase": "unofficial_or_vernacular_literacies"}, {"score": 0.0030590445140753213, "phrase": "alternative_economy"}, {"score": 0.00297346171320082, "phrase": "hidden\"via_surreptitious_use"}, {"score": 0.0026169435194789772, "phrase": "particular_relevance"}, {"score": 0.002555761854502478, "phrase": "social_context"}, {"score": 0.002391938519840648, "phrase": "ethnomethodologically_informed_viewpoint"}, {"score": 0.0023694065215394593, "phrase": "information_creation"}, {"score": 0.002259883463607508, "phrase": "individual's_human_information_behavior"}, {"score": 0.00218623706110975, "phrase": "human_ability"}, {"score": 0.0021351033500114753, "phrase": "sanctioned_or_official_information_genres"}], "paper_keywords": [""], "paper_abstract": "This article presents findings from a research study (Trace, 2004) that looked at a particular aspect of human information behavior: children's information creation in a classroom setting. In the portion of the study described here, naturalism and ethnomethodology are used as theoretical frameworks to investigate informal documents as an information genre. Although previous studies have considered the role of informal documents within the classroom, little sustained attention has been paid to pre-adolescents, particularly in terms of how they create unofficial or vernacular literacies both to navigate their growing awareness of the formal (albeit sometimes \"hidden\") curriculum and, on occasion, to subvert it, positing an alternative economy that itself can be \"hidden\"via surreptitious use of informal documents. Making explicit the ties that exist between these objects and the worlds in which they, are embedded demonstrates that informal documents hold a particular relevance for children within this social context (Garfinkel & Bittner, 1999). Furthermore, this article demonstrates that an ethnomethodologically informed viewpoint of information creation brings a level of dignity and determination to an individual's human information behavior, allowing us to appreciate the human ability to recontextualize or reenvisage sanctioned or official information genres to meet our own needs and purposes.", "paper_title": "Resistance and the underlife: Informal written literacies and their relationship to human information behavior", "paper_id": "WOS:000257920900001"}