{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "periodic_trends"}, {"score": 0.038708616681623176, "phrase": "exact_periodicity"}, {"score": 0.00481495049065317, "phrase": "sublinear_samples"}, {"score": 0.004576763709613412, "phrase": "long_data_streams"}, {"score": 0.004494570360108983, "phrase": "computational_constraints"}, {"score": 0.004272164161788242, "phrase": "combinatorial_property_testing_model"}, {"score": 0.004225950334493496, "phrase": "data_stream_s"}, {"score": 0.004002242925856335, "phrase": "property_testing_model"}, {"score": 0.0037087324991876727, "phrase": "different_notions"}, {"score": 0.003642070943285037, "phrase": "input_s"}, {"score": 0.003512308265830794, "phrase": "small_self-distance"}, {"score": 0.003314203895848452, "phrase": "different_definitions"}, {"score": 0.0032310733124059536, "phrase": "resulting_definitions"}, {"score": 0.0031845067058084613, "phrase": "approximate_periodicity"}, {"score": 0.003059869469624301, "phrase": "constant_approximations"}, {"score": 0.0023051296931856265, "phrase": "approximate_periods"}, {"score": 0.00217496508306238, "phrase": "data_item"}], "paper_keywords": ["Algorithms", " Theory", " Combinatorial property testing", " periodicity"], "paper_abstract": "In this work, we are interested in periodic trends in long data streams in the presence of computational constraints. To this end; we present algorithms for discovering periodic trends in the combinatorial property testing model in a data stream S of length n using o(n) samples and space. In accordance with the property testing model, we first explore the notion of being \"close\" to periodic by defining three different notions of self-distance through relaxing different notions of exact periodicity. An input S is then called approximately periodic if it exhibits a small self-distance (with respect to any one self-distance defined). We show that even though the different definitions of exact periodicity are equivalent, the resulting definitions of self-distance and approximate periodicity are not; we also show that these self-distances are constant approximations of each other. Afterwards, we present algorithms which distinguish between the two cases where S is exactly periodic and S is far from periodic with only a constant probability of error. Our algorithms sample only O(root n log(2) n) (or O(root n log(4) n), depending on the self-distance) positions and use as much space. They can also find, using o(n) samples and space, the largest/smallest period, and/or all of the approximate periods of S. These algorithms can also be viewed as working on streaming inputs where each data item is seen once and in order, storing only a sublinear (O(root n log(2) n) or O(root n log(4) n)) size sample from which periodicities are identified.", "paper_title": "Periodicity Testing with Sublinear Samples and Space", "paper_id": "WOS:000276389400020"}