{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "product_search"}, {"score": 0.004646088032529303, "phrase": "user_system_interaction_issues"}, {"score": 0.004529093447865156, "phrase": "recommender_systems"}, {"score": 0.0042819270655224916, "phrase": "large_collection"}, {"score": 0.0040481944502103505, "phrase": "accurate_and_complete_model"}, {"score": 0.003807684498435389, "phrase": "central_subject"}, {"score": 0.0033685408148574846, "phrase": "fundamental_decision_objectives"}, {"score": 0.0032836104153151973, "phrase": "hidden_preferences"}, {"score": 0.0032336801561165113, "phrase": "conflicting_preferences"}, {"score": 0.002718045523483502, "phrase": "common_areas"}, {"score": 0.0025694584194998335, "phrase": "design_guidelines"}, {"score": 0.0021375377706211686, "phrase": "developed_techniques"}, {"score": 0.0021049977753042253, "phrase": "concrete_scenarios"}], "paper_keywords": [""], "paper_abstract": "We address user system interaction issues in product search and recommender systems: how to help users select the most preferential item from a large collection of alternatives. As such systems must crucially rely on an accurate and complete model of user preferences, the acquisition of this model becomes the central subject of this article. Many tools used today do not satisfactorily assist users to establish this model because they to not adequately focus on fundamental decision objectives, help them reveal hidden preferences, revise conflicting preferences, or explicitly reason about trade-offs. As a result, users fail to find the outcomes that best satisfy their needs and perferences. In this article, we provide some analyses of common areas of design pit-falls and derive a set of design guidelines that assist the user in avoiding these problems in three important areas: user preference elicitation, preference revision, and explanation interfaces. For each area, we describe the state of the art of the developed techniques and discuss concrete scenarios where they have been applied and tested.", "paper_title": "User-Involved Preference Elicitation for Product Search and Recommender Systems", "paper_id": "WOS:000265659200009"}