{"auto_keywords": [{"score": 0.04664352394990268, "phrase": "post-menopausal_women"}, {"score": 0.015719716506582538, "phrase": "neural_networks"}, {"score": 0.014732193806739523, "phrase": "bone_mineral_density"}, {"score": 0.009099312787110053, "phrase": "neural_network_model"}, {"score": 0.004354315061804687, "phrase": "low_bone_mineral_density"}, {"score": 0.004186253035932442, "phrase": "high-cost_impact"}, {"score": 0.0041316803676012155, "phrase": "developed_countries"}, {"score": 0.003920384090110374, "phrase": "mathematical_method"}, {"score": 0.003378385493203297, "phrase": "postmenopausal_women"}, {"score": 0.003305243635051068, "phrase": "nutritional_habits"}, {"score": 0.002936709606809639, "phrase": "genetic_algorithms"}, {"score": 0.002835599469639296, "phrase": "input_variables"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Osteoporosis", " Bone mineral density (BMD)", " Genetic algorithms (GA)", " Artificial neural networks (ANN)", " Machine learning"], "paper_abstract": "Osteoporosis is characterized by low bone mineral density (BMD). This illness has a high-cost impact in all developed countries. The aim of this article is the development of a mathematical method able to predict the BMD of post-menopausal women, taking into account only certain nutritional variables. This research applies neural networks for the study of the influence of diet and lifestyle on the value of bone mineral density in postmenopausal women. A questionnaire on nutritional habits and lifestyle was drawn up. The variables obtained from this, together with the BMD of the patients calculated by densitometry, were processed using genetic algorithms in order to reduce the number of input variables. Finally, a neural network model using only those variables considered important was applied. It has been proved to be possible to build a neural network model able to forecast the BMD of post-menopausal women according to their responses to the questionnaire. This model can be used to determine which women should take a densitometry in order to verify their bone quality and thus prevent some risks associated with osteoporosis. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Application of neural networks to the study of the influence of diet and lifestyle on the value of bone mineral density in post-menopausal women", "paper_id": "WOS:000293269200008"}