{"auto_keywords": [{"score": 0.04797130800606528, "phrase": "firefighter_problem"}, {"score": 0.004698229304089357, "phrase": "approximation_algorithms"}, {"score": 0.004565609517511076, "phrase": "general_graphs"}, {"score": 0.0044005599565517875, "phrase": "diffusive_process"}, {"score": 0.004206879557938045, "phrase": "computer_virus"}, {"score": 0.003876226041373242, "phrase": "targeted_vaccinations"}, {"score": 0.0036008372531664726, "phrase": "time_step"}, {"score": 0.002827740707723551, "phrase": "\"non-spreading\"_model"}, {"score": 0.002626645763725465, "phrase": "\"spreading\"_model"}, {"score": 0.0025523518748506347, "phrase": "infectious_process"}, {"score": 0.0024298350266697905, "phrase": "harmful_idea"}, {"score": 0.0023418133729330303, "phrase": "infectious_beneficial_idea"}, {"score": 0.0021049977753042253, "phrase": "fixed_budget"}], "paper_keywords": ["Firefighter", " Approximation algorithms", " Graph cuts", " Submodular", " Vaccination"], "paper_abstract": "We provide approximation algorithms for several variants of the Firefighter problem on general graphs. The Firefighter problem models the case where a diffusive process such as an infection (or an idea, a computer virus, a fire) is spreading through a network, and our goal is to contain this infection by using targeted vaccinations. Specifically, we are allowed to vaccinate at most a fixed number (called the budget) of nodes per time step, with the goal of minimizing the effect of the infection. The difficulty of this problem comes from its temporal component, since we must choose nodes to vaccinate at every time step while the infection is spreading through the network, leading to notions of \"cuts over time\". We consider two versions of the Firefighter problem: a \"non-spreading\" model, where vaccinating a node means only that this node cannot be infected; and a \"spreading\" model where the vaccination itself is an infectious process, such as in the case where the infection is a harmful idea, and the vaccine to it is another infectious beneficial idea. We look at two measures: the MaxSave measure in which we want to maximize the number of nodes which are not infected given a fixed budget, and the MinBudget measure, in which we are given a set of nodes which we have to save and the goal is to minimize the budget. We study the approximability of these problems in both models.", "paper_title": "Approximability of the Firefighter Problem Computing Cuts over Time", "paper_id": "WOS:000298388200023"}