{"auto_keywords": [{"score": 0.04849559522610527, "phrase": "social_media"}, {"score": 0.00481495049065317, "phrase": "rhetorical_practices"}, {"score": 0.004611224230543916, "phrase": "internal_communications"}, {"score": 0.004458722048888919, "phrase": "central_information_hub"}, {"score": 0.0043738432231020885, "phrase": "different_parts"}, {"score": 0.004168618849008299, "phrase": "key_role"}, {"score": 0.004108942392772092, "phrase": "rhetorical_tool"}, {"score": 0.004069631519385246, "phrase": "senior_managers"}, {"score": 0.003714368305523811, "phrase": "organizations'_'rhetorical_practices"}, {"score": 0.0033900126423990823, "phrase": "established_and_emerging_flows"}, {"score": 0.0030203487665054806, "phrase": "strategic_intent"}, {"score": 0.002467536552997677, "phrase": "organizational_rhetorical_practices"}, {"score": 0.002208853811052348, "phrase": "simultaneous_consumption"}, {"score": 0.002166711569953301, "phrase": "rhetorical_content"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rhetorical practices", " Intra-organizational communication", " Social media", " Interpretive", " Multiple case study research"], "paper_abstract": "While intranets have become a central information hub for employees in different parts of an organization, they have also played a key role as a rhetorical tool for senior managers. With the advent of social media, this is increasingly so. How such technologies as these are incorporated into organizations' 'rhetorical practices' is an important, yet under-researched topic. To explore this research agenda, we examine the effects of social media on established and emerging flows of rhetorical practices in organizations, focusing in particular on the expanding, and in some cases switching, roles played by senior management and employees. We conceptualize organizational rhetorical practices as the combination of strategic intent, message and media, and discuss the interplay between rhetors and their audience. Adopting an interpretive, multiple case study approach, we study the use of social media in three multi-national organizations in the telecommunications industry. Our findings reveal that social media enable and facilitate the shaping of organizational rhetorical practices by (i) adding multivocality; (ii) increasing reach and richness in communication, and (iii) enabling simultaneous consumption and co-production of rhetorical content. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Reconceptualizing rhetorical practices in organizations: The impact of social media on internal communications", "paper_id": "WOS:000317811100006"}