{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "climate_data"}, {"score": 0.004784448637292493, "phrase": "pressure_dipoles"}, {"score": 0.00475413908468027, "phrase": "important_long_distance_climate_phenomena"}, {"score": 0.004664352260912174, "phrase": "pressure_anomalies"}, {"score": 0.004081401971551089, "phrase": "pacific"}, {"score": 0.003953639783762917, "phrase": "temperature_anomalies"}, {"score": 0.0038665952212144214, "phrase": "graph-based_approach"}, {"score": 0.0037217945534790903, "phrase": "shared_nearest_neighbor_graph"}, {"score": 0.003537097098008714, "phrase": "careful_treatment"}, {"score": 0.0035146616294377386, "phrase": "negative_correlations"}, {"score": 0.0033084729942065142, "phrase": "time-dependent_patterns"}, {"score": 0.003245900020944865, "phrase": "changing_climate"}, {"score": 0.0031542454984159634, "phrase": "important_climate_phenomena"}, {"score": 0.0028578496983461136, "phrase": "static_indices"}, {"score": 0.002821685815956478, "phrase": "fixed_locations"}, {"score": 0.0027948626965516947, "phrase": "climate_scientists"}, {"score": 0.002733260122876447, "phrase": "global_temperature"}, {"score": 0.002664513608074113, "phrase": "single_snapshot_picture"}, {"score": 0.002508073621696602, "phrase": "dipole_interactions"}, {"score": 0.0024063484128685367, "phrase": "global_climate_system"}, {"score": 0.0023683286031958538, "phrase": "pressing_need"}, {"score": 0.0022940774859444724, "phrase": "atmospheric_processes"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["graph algorithm", " teleconnections", " dipole discovery"], "paper_abstract": "Pressure dipoles are important long distance climate phenomena (teleconnection) characterized by pressure anomalies of the opposite polarity appearing at two different locations at the same time. Such dipoles have been proven important for understanding and explaining the variability in climate in many regions of the world, e.g. the El Nino Southern Oscillation (ENSO) climate phenomenon, which is described by opposite pressure anomalies between the west and east Pacific and is known to be responsible for precipitation and temperature anomalies worldwide. This paper presents a graph-based approach called shared reciprocal nearest neighbor approach that considers only reciprocal positive and negative edges in the shared nearest neighbor graph to find the dipoles. One crucial aspect of our approach to the analysis of such networks is a careful treatment of negative correlations, whose proper consideration is critical for finding the dipoles. Further, our work shows the importance of modeling the time-dependent patterns of the dipoles in a changing climate in order to better capture the impact of important climate phenomena on the globe. To show the utility of finding dipoles using our approach, we show that the data driven dynamic climate indices generated from our algorithm generally perform better than static indices formed from the fixed locations used by climate scientists in terms of capturing impact on global temperature and precipitation. Our approach can generate a single snapshot picture of all the dipole interconnections on the globe in a given dataset and thus makes it possible to study the changes in dipole interactions and movements. As teleconnections are crucial in the understanding of the global climate system, there is a pressing need to better understand the behavior and interactions of these atmospheric processes as well as to capture them precisely. Our systematic graph-based approach to find the teleconnections in climate data is an attempt in that direction. (c) 2013 Wiley Periodicals, Inc.", "paper_title": "A Graph-Based Approach to Find Teleconnections in Climate Data", "paper_id": "WOS:000209525300002"}