{"auto_keywords": [{"score": 0.043038683365025754, "phrase": "japanese_rice_research"}, {"score": 0.011580271757163767, "phrase": "frequency_distribution"}, {"score": 0.00481495049065317, "phrase": "japanese_rice_research_and_technology_development"}, {"score": 0.00450198136261303, "phrase": "interdisciplinary_basis"}, {"score": 0.004361792415184563, "phrase": "natural_sciences"}, {"score": 0.004293492107272017, "phrase": "japan"}, {"score": 0.00395111389294443, "phrase": "relevant_disciplines"}, {"score": 0.0038584250641318057, "phrase": "compiled_bibliography"}, {"score": 0.0037234376132464463, "phrase": "publishing_years"}, {"score": 0.0029595657769783314, "phrase": "smaller_number"}, {"score": 0.0029362173680378624, "phrase": "highly_productive_journal_disciplines"}, {"score": 0.002855934865505357, "phrase": "large_number"}, {"score": 0.0027450280220853137, "phrase": "larger_number"}, {"score": 0.0027126012542151015, "phrase": "least_productive_disciplines"}, {"score": 0.00246657044320953, "phrase": "peripheral_journals"}, {"score": 0.002437425029824563, "phrase": "minimal_number"}, {"score": 0.0023520340492933383, "phrase": "groos"}, {"score": 0.0022876877275935757, "phrase": "bradford's_s-shape_curve"}, {"score": 0.0022250978492127163, "phrase": "least_productive_journals"}, {"score": 0.0021049977753042253, "phrase": "journal_categories"}], "paper_keywords": ["Bradford's scattering law", " The Groos droop", " Interdisciplinarity", " Japan", " Research & Development (R& D)", " Rice"], "paper_abstract": "Research and development of rice, a major crop, has been promoted on an interdisciplinary basis with the involvement of various research fields ranging from natural sciences to socioeconomics in Japan. This paper focuses on the structure of interdisciplinarity in Japanese rice research and technology development by analyzing the relationship among all relevant disciplines with the use of a compiled bibliography of Japanese rice research with 19,389 articles in 1,611 journals in the publishing years of 1990-2000. The relationship among the disciplines was characterized by the frequency distribution of articles among journals classified into 24 categories based on the law of scattering originally identified by Bradford (Engineering 13:785-786, 1934). The 24 journal categories ranked in decreasing order of productivity of articles were divided into 3 zones; the first nuclear zone with a smaller number of highly productive journal disciplines; the second zone with a large number of less productive disciplines; and the last zone with a larger number of the least productive disciplines, which characterized the structure of interdisciplinarity in Japanese rice research and technology development. Other aspects of the interdisciplinarity were further explored with reference to peripheral journals with a minimal number of papers on a certain subject, and the Groos droop phenomenon at the end of Bradford's S-shape curve that is the region of the least productive journals with only one paper on a certain subject, by analyzing the frequency distribution of articles in journal categories.", "paper_title": "A bibliometric approach to interdisciplinarity in Japanese rice research and technology development", "paper_id": "WOS:000329319200007"}