{"auto_keywords": [{"score": 0.03990826686829777, "phrase": "collaborative_learning"}, {"score": 0.01929968978262473, "phrase": "cognitive_process"}, {"score": 0.014145550763912981, "phrase": "sqa_services"}, {"score": 0.010644857006483122, "phrase": "social_dimension"}, {"score": 0.008656131575438784, "phrase": "social_dimensions"}, {"score": 0.00481495049065317, "phrase": "cognitive_processes"}, {"score": 0.004719664411221952, "phrase": "social_question"}, {"score": 0.004657185361669812, "phrase": "social_media_applications"}, {"score": 0.004610866942420572, "phrase": "dedicated_platforms"}, {"score": 0.004021954624114115, "phrase": "educational_domain"}, {"score": 0.003981928669805484, "phrase": "new_ways"}, {"score": 0.003955465362027017, "phrase": "engaging_students"}, {"score": 0.003929177231678094, "phrase": "collaborative_information"}, {"score": 0.0038900709793274484, "phrase": "previous_studies"}, {"score": 0.003614895644619489, "phrase": "on-going_research_efforts"}, {"score": 0.0035079946851603186, "phrase": "overarching_understanding"}, {"score": 0.003163326114997034, "phrase": "sqa_service"}, {"score": 0.0031006245019920826, "phrase": "piazza"}, {"score": 0.0030189426536422577, "phrase": "java_programming"}, {"score": 0.0029988599391845517, "phrase": "bachelor_students"}, {"score": 0.0029492339651639734, "phrase": "integrated_framework"}, {"score": 0.002686085475479125, "phrase": "community_building"}, {"score": 0.0026240423738883704, "phrase": "relational_dynamics"}, {"score": 0.0021476098263617954, "phrase": "physical_as_well_as_digital_space"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge dimension", " Social constructivism", " Cognitive process", " Social presence", " Social question answering", " Micro-collaborations"], "paper_abstract": "Social question answering (SQA) services are social media applications that are dedicated platforms where users ask, answer and rate content interactively, resulting in building a community of users. SQA services are rich in micro-collaborations which are referred to as brief, informal episodes of collaborative information seeking. Micro-collaborations have gathered interest in the educational domain because of new ways of engaging students in collaborative information seeking. Previous studies in the field of computer supported collaborative learning are based on various theoretical and methodological approaches that examined different units of analysis. Yet, amid on-going research efforts, there still persist a lack of an overarching understanding on how micro-collaborations enhance collaborative learning in SQA services. Hence, this study aims to understand the distribution of knowledge, cognitive process and social dimension that learners demonstrate in micro-collaborations in a SQA service. Data was collected from Piazza, a SQA service used for teaching Java programming for bachelor students and analyzed using the integrated framework. Findings suggest that micro-collaborations in SQA services promote all the three dimensions including knowledge, cognitive process and social dimensions. The findings reveal that social dimension in micro-collaborations promote collaborative learning by enhancing community building, developing self-identity, and improving relational dynamics, which in turn support learning in various knowledge levels and improve the cognitive process in learning. This study serves as a foundation for researchers to study social dimension along with knowledge and cognitive process, to understand the dynamics of micro-collaborations involved in collaborative learning. As for practitioners, they can look into creating environments for collaborative learning rich in micro-collaborations in both physical as well as digital space. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Social question answering: Analyzing knowledge, cognitive processes and social dimensions of micro-collaborations", "paper_id": "WOS:000325600400009"}