{"auto_keywords": [{"score": 0.04922082634695279, "phrase": "shallow_water_equations"}, {"score": 0.004191200981137508, "phrase": "source_term_gradients"}, {"score": 0.003232956879952914, "phrase": "local_dg_linear_approximations"}, {"score": 0.003117890043128058, "phrase": "special_treatment"}, {"score": 0.00306189690236109, "phrase": "source_terms"}, {"score": 0.0029707940194245216, "phrase": "well-balanced_numerical_results"}, {"score": 0.002813566267090177, "phrase": "conserved_solutions"}, {"score": 0.0027133856739937133, "phrase": "strongly_irregular_topography"}, {"score": 0.0025083651612064144, "phrase": "different_slope"}, {"score": 0.002478225374613311, "phrase": "procedures_oil"}, {"score": 0.002448446849997207, "phrase": "well-balancing_property"}, {"score": 0.002304824112812496, "phrase": "useful_guidelines"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Saint Venant equations", " Godunov-type scheme", " discontinuous Galerkin finite element method", " slope limiting", " irregular topography", " C-property", " local linear approximations", " source terms"], "paper_abstract": "Discontinuous Galerkin (DG) finite element methods have salient features that are mainly highlighted by their locality, their easiness in balancing the flux and source term gradients and their component-wise structure In the light of this. this paper aims to provide insights into the well-balancing, property of a second-order Runge-Kutta Discontinuous Galerkin (RKDG2) method. For this purpose, a Godunov-type RKDG2 method is presented for solving the shallow water equations The scheme is based on local DG linear approximations and does not entail any special treatment of the source terms in order to achieve well-balanced numerical results. The performance of the present RKDG2 scheme in reproducing conserved solutions for both free surface and discharge over strongly irregular topography is demonstrated by applying to several hydraulic benchmarks. Meanwhile, the effects of different slope limiting procedures oil the well-balancing property are investigated and discussed. This work may provide useful guidelines for developing a well-balanced RKDG2 numerical scheme for shallow water flow simulation Copyright (C) 2009 John Wiley & Sons. Ltd.", "paper_title": "Well-balancing issues related to the RKDG2 scheme for the shallow water equations", "paper_id": "WOS:000274175500004"}