{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "p_systems"}, {"score": 0.0050627473221652505, "phrase": "time-free_systems"}, {"score": 0.004579286075792249, "phrase": "proton"}, {"score": 0.004419703921314433, "phrase": "membrane_systems"}, {"score": 0.0038379074449947067, "phrase": "rewriting_rule"}, {"score": 0.003780286517897356, "phrase": "time-freeness_property"}, {"score": 0.003152531962718477, "phrase": "known_universality_results"}, {"score": 0.002982307044758515, "phrase": "upper_bound"}, {"score": 0.0025761937402886954, "phrase": "port_rules"}, {"score": 0.0024617483174454113, "phrase": "symport_rules"}, {"score": 0.002158836285985314, "phrase": "time-free_p_systems"}], "paper_keywords": [""], "paper_abstract": "Proton pumping P systems are a variant of membrane systems with both rewriting rules and symport/antiport rules, where a set of objects called protons is distinguished, every cooperative symport or antiport rule involves a proton, but no rewriting rule does. Time-freeness property means the result of all computations does not depend on the time it takes to execute the rules. The goal of this article is to improve (showing that two membranes are sufficient) the known universality results on proton pumping P systems, establishing at the same time an upper bound on the number of protons, namely one, or four for time-free systems. All results mentioned hold for proton pumping P systems with noncooperative rewriting and either symport/anti port rules of weight one (classical variant) or symport rules of weight at most two. As a corollary, we obtain the universality of P systems with one membrane and one bi-stable catalyst, or the universality of time-free P systems with one membrane and four bi-stable catalysts. All universality results are stated as generating RE (except the time-free systems without targets generate PsRE).", "paper_title": "Number of protons/bi-stable catalysts and membranes in P systems. Time-freeness", "paper_id": "WOS:000235807300006"}