{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cellular_automata"}, {"score": 0.0045765783794477505, "phrase": "combinatorial_approach"}, {"score": 0.004534517530868195, "phrase": "hyperbolic_geometry"}, {"score": 0.004410629943506433, "phrase": "possible_applications"}, {"score": 0.004370087541308677, "phrase": "computer_simulations"}, {"score": 0.004231089088705995, "phrase": "splitting_method"}, {"score": 0.00398452530840582, "phrase": "second_section"}, {"score": 0.003752275718257509, "phrase": "classical_case"}, {"score": 0.0035828427627676075, "phrase": "hyperbolic_plane"}, {"score": 0.0034528025626422154, "phrase": "regular_rectangular_pentagon"}, {"score": 0.00274017282519193, "phrase": "unique_origin"}, {"score": 0.002429668083484833, "phrase": "new_system"}, {"score": 0.002341384304635523, "phrase": "linear_algorithm"}, {"score": 0.00229844995872581, "phrase": "quasi-geodesic_path"}, {"score": 0.0021049977753042253, "phrase": "cellular_automaton"}], "paper_keywords": ["discrete computations", " cellular automata", " hyperbolic geometry", " universality", " 3D space"], "paper_abstract": "The contribution adopts a combinatorial approach to hyperbolic geometry and it is aimed at possible applications to computer simulations. It is based on the splitting method which was introduced by the author and which is reminded in the second section of the paper. Then we sketchily remind the application to the classical case of the pentagrid, i.e. the tiling of the hyperbolic plane which is generated by reflections of the regular rectangular pentagon in its sides and, recursively, of its images in their sides. From this application, we derived a system of coordinates to locate the tiles, allowing an implementation of cellular automata. In this paper, we give another system of coordinates whose main advantage is to be free of a unique origin of the coordinates. In our new system, changing of coordinates is easier, although restricted to a certain condition. Also, the interest of the new system is to preserve the existence of a linear algorithm to find a quasi-geodesic path between two tiles. We indicate also an algorithm which implements the search of this path in a cellular automaton implemented on the pentagrid.", "paper_title": "A new way to implement cellular automata on the penta- and heptagrids", "paper_id": "WOS:000252003800001"}