{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "particle_swarm_optimization"}, {"score": 0.015489190650234666, "phrase": "pso"}, {"score": 0.014016027272591583, "phrase": "fitness_evaluations"}, {"score": 0.013111710666372373, "phrase": "computational_cost"}, {"score": 0.012728505618155745, "phrase": "fespso"}, {"score": 0.009741693198888022, "phrase": "original_objective_function"}, {"score": 0.0076474439489248895, "phrase": "proposed_algorithm"}, {"score": 0.004673079747693193, "phrase": "global_metaheuristic"}, {"score": 0.004468037801239238, "phrase": "wide_range"}, {"score": 0.004320156581220516, "phrase": "large_number"}, {"score": 0.0040997480534580065, "phrase": "objective_function"}, {"score": 0.003964007795174772, "phrase": "whole_optimization_run"}, {"score": 0.0034643747383816164, "phrase": "approximate_model"}, {"score": 0.003362163770566293, "phrase": "fitness_inheritance"}, {"score": 0.0028514344213899177, "phrase": "proposed_estimation_formula"}, {"score": 0.002655544981260646, "phrase": "estimated_fitness_values"}, {"score": 0.002294507393862231, "phrase": "eight_benchmark_problems"}, {"score": 0.002260367486652148, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Particle swarm optimization", " Fitness evaluation", " Fitness estimation", " Computationally-expensive optimization problem"], "paper_abstract": "Particle swarm optimization (PSO) is a global metaheuristic that has been proved to be very powerful for optimizing a wide range of problems. However, PSO requires a large number of fitness evaluations to find acceptable (optimal or sub-optimal) solutions.' If one single evaluation of the objective function is computationally expensive, the computational cost for the whole optimization run will become prohibitive. FESPSO, a new fitness estimation strategy, is proposed for particle swarm optimization to reduce the number of fitness evaluations, thereby reducing the computational cost. Different from most existing approaches which either construct an approximate model using data or utilize the idea of fitness inheritance, FESPSO estimates the fitness of a particle based on its positional relationship with other particles. More precisely, Once the fitness of a particle is known, either estimated or evaluated using the original objective function, the fitness of its closest neighboring particle will be estimated by the proposed estimation formula. If the fitness of its closest neighboring particle has not been evaluated using the original objective function, the minimum of all estimated fitness values on this position will be adopted. In case of more than one particle is located at the same position, the fitness of only one of them needs to be evaluated or estimated. The performance of the proposed algorithm is examined on eight benchmark problems, and the experimental results show that the proposed algorithm is easy to implement, effective and highly competitive. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A new fitness estimation strategy for particle swarm optimization", "paper_id": "WOS:000313146700026"}