{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "russia"}, {"score": 0.00481495049065317, "phrase": "female_researchers"}, {"score": 0.0043842558719324526, "phrase": "gender_endings"}, {"score": 0.003468053168607071, "phrase": "corresponding_analysis"}, {"score": 0.003423969509052361, "phrase": "major_fields"}, {"score": 0.003038532168038562, "phrase": "possible_colleagues"}, {"score": 0.0028139168128067343, "phrase": "higher_presence"}, {"score": 0.0027781249331615813, "phrase": "biological_sciences"}, {"score": 0.0025947642929906407, "phrase": "fractionated_basis"}, {"score": 0.0024969812322112174, "phrase": "almost_all_fields"}, {"score": 0.002342275950798334, "phrase": "english"}, {"score": 0.0022731540640627307, "phrase": "higher_citations"}, {"score": 0.0021968238865548812, "phrase": "international_collaboration"}], "paper_keywords": ["Women scientists", " Russia", " Bibliometrics", " Surnames", " Citations"], "paper_abstract": "This study is based on the fact that the surnames of many Russian scientists have gender endings, with \"a\" denoting a female, so that the sex of most of them can be readily determined from the listing of authors in the Web of Science (WoS). A comparison was made between the proportion of females in 1985, 1995, and 2005, with a corresponding analysis of the major fields in which they worked, their propensity to co-author papers internationally (which often necessitates having the opportunity to travel to conferences abroad to meet possible colleagues), and their citation records. We found, as expected, that women had a higher presence in the biological sciences and a very low presence in engineering, mathematics, and physics. Their citation scores, on a fractionated basis, were lower than those for men in almost all fields and years, and were not explained by their writing of fewer reviews and papers in English (both of which lead to higher citations), or their lower amount of international collaboration in 1995 and 2005 after Russia had become a more open society.", "paper_title": "Female researchers in Russia: have they become more visible?", "paper_id": "WOS:000294839200007"}