{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "physical_simulation"}, {"score": 0.004717723626157272, "phrase": "increasingly_popular_tools"}, {"score": 0.004669845451682529, "phrase": "interactive_applications"}, {"score": 0.00457553517865013, "phrase": "complex_and_reactive_behaviors"}, {"score": 0.0044150318724093226, "phrase": "initial_implementation"}, {"score": 0.004195418010131832, "phrase": "available_parameters"}, {"score": 0.0041316803676012155, "phrase": "desired_behaviors"}, {"score": 0.003788296551609616, "phrase": "procedural_animation"}, {"score": 0.0037498152007206815, "phrase": "different_parameter_settings"}, {"score": 0.003545024951402821, "phrase": "deep_understanding"}, {"score": 0.0033173234105492895, "phrase": "physics_storyboards"}, {"score": 0.003088384809415812, "phrase": "space-time_snapshots"}, {"score": 0.0030414140732789186, "phrase": "critical_events"}, {"score": 0.0028459677232555176, "phrase": "parameter_changes"}, {"score": 0.002731971103291716, "phrase": "extensive_play-testing"}, {"score": 0.0026494723416072316, "phrase": "designer-provided_evaluation_functionsallow_automatic_parameter_selection"}, {"score": 0.0022382002476510573, "phrase": "changing_parameters"}], "paper_keywords": [""], "paper_abstract": "Physical simulation and other procedural methods are increasingly popular tools in interactive applications because they generate complex and reactive behaviors given only a few parameter settings. This automation accelerates initial implementation, but also introduces a need to tune the available parameters until the desired behaviors emerge. These adjustments are typically performed iteratively, with the designer repeatedly runningand interacting withthe procedural animation with different parameter settings. Such a process is inaccurate, time consuming, and requires deep understanding and intuition, as parameters often have complex, nonlinear effects. Instead, we propose that designers construct physics storyboards to accelerate the process of tuning interactive, procedural animations. Physics storyboards are collections of space-time snapshots that highlight critical events and outcomes. They can be used to summarize the effects of parameter changes (without requiring the designer to perform extensive play-testing); andwhen augmented with designer-provided evaluation functionsallow automatic parameter selection. We describe our implementation of this method, including how we use sampling to ensure that our automatically-selected parameters generalize, and how we time-warp user input to adapt it to changing parameters. We validate our implementation by using it to perform various design tasks in three example games.", "paper_title": "Physics Storyboards", "paper_id": "WOS:000318545900001"}