{"auto_keywords": [{"score": 0.043039693183724595, "phrase": "mathematical_formulation"}, {"score": 0.00481495049065317, "phrase": "mathematical_programming"}, {"score": 0.004717723626157272, "phrase": "computational_time"}, {"score": 0.0038862297330905836, "phrase": "design_space_definition"}, {"score": 0.0036928221419965253, "phrase": "data_collection"}, {"score": 0.003403122817578447, "phrase": "large_problems"}, {"score": 0.0033004240095380623, "phrase": "earlier_work"}, {"score": 0.0032172054825137866, "phrase": "computer-aided_framework"}, {"score": 0.003120099687922751, "phrase": "process_networks"}, {"score": 0.002731971103291716, "phrase": "design_problem"}, {"score": 0.0025694584194998335, "phrase": "process_alternatives"}, {"score": 0.00240426758768164, "phrase": "energy_balance"}, {"score": 0.0021928902836049384, "phrase": "food_processing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Process networks", " Synthesis and design", " Mathematical programming", " Computer-aided process engineering", " Vegetable oil refinery", " Bioethanol"], "paper_abstract": "The developments obtained in recent years in the field of mathematical programming considerably reduced the computational time and resources needed to solve large and complex Mixed Integer Non Linear Programming (MINLP) problems. Nevertheless, the application of these methods in industrial practice is still limited by the complexity associated with the mathematical formulation of some problems. In particular, the tasks of design space definition and representation as superstructure, as well as the data collection, validation and handling may become too complex and cumbersome to execute, especially when large problems are considered. In an earlier work, we proposed a computer-aided framework for synthesis and design of process networks. In this contribution, we expand the framework by including methods and tools developed to structure, automate and simplify the mathematical formulation of the design problem. Furthermore, the models employed for the representation of the process alternatives included in the superstructure are refined, through the inclusion of the energy balance. Finally, the features of the framework are highlighted through the solution of two case studies focusing on food processing and biofuels. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Systematic network synthesis and design: Problem formulation, superstructure generation, data management and solution", "paper_id": "WOS:000346070500006"}