{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "australian_nursing_and_allied_health_professional_journals"}, {"score": 0.004399905285945236, "phrase": "arising_publications"}, {"score": 0.004035630066743877, "phrase": "health_professions"}, {"score": 0.003975416846030462, "phrase": "professional_journal_publications"}, {"score": 0.0039456466422100045, "phrase": "numerous_bibliometric_studies"}, {"score": 0.003673675864705682, "phrase": "growing_health_workforce"}, {"score": 0.0036461569988218267, "phrase": "socioeconomic_pressures"}, {"score": 0.003511613254403125, "phrase": "bibliometric_analyses"}, {"score": 0.003356675879109443, "phrase": "seven_australian_nursing"}, {"score": 0.0033315236647127734, "phrase": "allied_health_professional_journals"}, {"score": 0.0032085525502105836, "phrase": "original_research_articles"}, {"score": 0.003101752151627964, "phrase": "reliable_bibliometric_audit_tool"}, {"score": 0.0028877818105020434, "phrase": "research_methods"}, {"score": 0.0028553693643045795, "phrase": "citation_patterns"}, {"score": 0.0027395968397212053, "phrase": "study_period"}, {"score": 0.0026384167183586015, "phrase": "higher_study_designs"}, {"score": 0.002550545394070177, "phrase": "larger_research_teams"}, {"score": 0.0022022878843247257, "phrase": "strategic_purpose"}, {"score": 0.0021049977753042253, "phrase": "wider_socioeconomic_phenomena"}], "paper_keywords": ["Allied health occupations", " Bibliometrics", " Nursing", " Periodicals as topic", " Research"], "paper_abstract": "The generation of research involves producers (study authors and funders), products (studies and arising publications) and consumption (measured through readership and citation). Bibliometric analyses of research producers, products and consumption over time can be used to describe the evolution of health professions as captured in professional journal publications. Numerous bibliometric studies have been conducted however few have sampled nursing and allied health professional journals. This is despite a growing health workforce and socioeconomic pressures. The aim of this study was to use bibliometric analyses to track change in the producers, products and consumption of seven Australian nursing and allied health professional journals from 1985 through 2010. An analysis of all original research articles published in these journals was performed using a reliable bibliometric audit tool. Articles were sampled every 3 months and at 5 year intervals over a 25 year period. Information relating to authorship, the research methods used and citation patterns was collected. Data were analysed descriptively. Over the study period, all journals shifted towards publishing research that used higher study designs, reported more quantitative data, and were authored by larger research teams. The rate at which this transition occurred (greater evidence base, quantitation and collaboration) differed among the journals sampled. The changes seen in the research published in these journals are likely to be a function of the strategic purpose of each publication (to its professional readership) as well as reflect wider socioeconomic phenomena. Therefore these trends are likely to continue in the future.", "paper_title": "Twenty-five years of Australian nursing and allied health professional journals: bibliometric analysis from 1985 through 2010", "paper_id": "WOS:000313016300021"}