{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_acoustic_sensors"}, {"score": 0.023024560927184485, "phrase": "event_forecasting"}, {"score": 0.008650284475611357, "phrase": "acoustic_signals"}, {"score": 0.0058447582168064385, "phrase": "signal_strength_forecasting"}, {"score": 0.004543352284098364, "phrase": "security_assurance"}, {"score": 0.004502943680955863, "phrase": "application_layer"}, {"score": 0.004081385289516914, "phrase": "acoustic_signal_research"}, {"score": 0.0036335821512795026, "phrase": "event-forecasting_applications"}, {"score": 0.0034283921404628975, "phrase": "xbow_acoustic_sensors"}, {"score": 0.003367611042980526, "phrase": "real-world_acoustic_signals"}, {"score": 0.0031350397225314262, "phrase": "acoustic_signal_prediction_scheme"}, {"score": 0.0025632898741546556, "phrase": "double_sliding_window_scheme"}, {"score": 0.0024842242921857705, "phrase": "forecasted_signals"}, {"score": 0.0024620842899061614, "phrase": "simulation_results"}, {"score": 0.002291905937251069, "phrase": "event_detection"}, {"score": 0.002251227801482381, "phrase": "forecasted_signal"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["security assurance", " acoustic signals", " acoustic sensors", " fuzzy logic systems", " self-similarity", " prediction", " event detection"], "paper_abstract": "In this paper, we study the security assurance in application layer in wireless acoustic sensors via event forecasting and detection. In order to perform event forecasting and detection, we try to answer several challenging questions in acoustic signal research based on wireless acoustic sensors: (i) Are acoustic signals predictable? (ii) How are acoustic signals predicted? (iii) Are there any event-forecasting applications for the security in wireless acoustic sensors? We study these questions based on Xbow acoustic sensors and demonstrate that real-world acoustic signals are self-similar, which means that they are predictable. We propose an acoustic signal prediction scheme using interval type-2 fuzzy logic system (FLS). We show that a type-2 fuzzy membership function (MF); that is, a Gaussian MF with uncertain mean is appropriate to model the acoustic signal strength. Two FLSs, a type-1 FLS, and an interval type-2 FLS are designed for signal strength forecasting. Furthermore, we propose a double sliding window scheme for event detection based on the forecasted signals. Simulation results show that the interval type-2 FLS outperforms the type-1 FLS in signal strength forecasting and the performance of event detection based on the forecasted signal from type-2 FLS is much better than that based on type-1 FLS. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Security assurance in wireless acoustic sensors via event forecasting and detection", "paper_id": "WOS:000363086500006"}