{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "acceptable_use_policies"}, {"score": 0.008477971411319608, "phrase": "positive_effects"}, {"score": 0.007675037740039331, "phrase": "security_policies"}, {"score": 0.004732785510739708, "phrase": "extensive_literature"}, {"score": 0.004652016085325825, "phrase": "institutionalising_ethics"}, {"score": 0.004620093797504386, "phrase": "organisational_culture"}, {"score": 0.004556901872357751, "phrase": "information_security_culture"}, {"score": 0.004327500975159818, "phrase": "formation_security"}, {"score": 0.003889206369317587, "phrase": "deontological_ethics"}, {"score": 0.0038624981944755813, "phrase": "i.e._employees"}, {"score": 0.003822778117250714, "phrase": "right_thing"}, {"score": 0.0036052633308076933, "phrase": "widening_socio-technical_gap"}, {"score": 0.003483120583663528, "phrase": "expected_social_norms"}, {"score": 0.0033883824438527316, "phrase": "moral_behaviour"}, {"score": 0.0032065418360603293, "phrase": "alternative_approach"}, {"score": 0.003044912038752554, "phrase": "consequential_ethics"}, {"score": 0.002544951823639408, "phrase": "employee's_behaviour"}, {"score": 0.0023834640793589435, "phrase": "ethical_judgement"}, {"score": 0.002310578855290687, "phrase": "organisation's_security"}, {"score": 0.0021940118003312397, "phrase": "acceptable_use_policy"}, {"score": 0.0021564750534280863, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Acceptable use policies", " Consequential ethics", " Ethical decision making", " Security policy quality", " Security management"], "paper_abstract": "While there is extensive literature on the positive effects of institutionalising ethics in organisational culture, our extensive research in information security culture has found no evidence of organisations encouraging ethical decision making in situations where in formation security might be at risk. Security policies, in particular acceptable use policies, have traditionally been written with a strategy of deterrence in mind, but in practice they rely mostly on deontological ethics, i.e. employees doing the right thing, to work. As far back as 1990, evidence has been reported of a widening socio-technical gap, where employees no longer always act according to expected social norms in an organisation. This change in moral behaviour is reducing the effectiveness of acceptable use policies in an organisation. In this paper, an alternative approach to the development of security policies is proposed to encourage ethical decision making based on consequential ethics. Acceptable use policies will need to distinguish between guidelines, standards and procedures, and guidelines will need to be written in such a way that the policy continuously acknowledges that employees are no longer expected to blindly follow these guidelines. And, as acceptable use policies can no longer cover all the possible risks related to an employee's behaviour, the policy will need to emphasise both explicitly an implicitly that employees are expected to make an ethical judgement on all their actions that may possibly endanger the organisation's security. This will in turn have positive effects on the usability and suitability of the acceptable use policy to the organisation. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Ethical decision making: Improving the quality of acceptable use policies", "paper_id": "WOS:000282419300002"}