{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deteriorating_jobs"}, {"score": 0.04304590109574224, "phrase": "job_deterioration"}, {"score": 0.03152336819098321, "phrase": "polynomial-time_optimal_solutions"}, {"score": 0.030066192702221616, "phrase": "total_completion_time"}, {"score": 0.004756805752518494, "phrase": "learning_effects"}, {"score": 0.004558748120167778, "phrase": "learning_effect"}, {"score": 0.0037301606780397456, "phrase": "new_scheduling_model"}, {"score": 0.0034887749053459584, "phrase": "actual_processing_time"}, {"score": 0.0033029038236817372, "phrase": "processing_times"}, {"score": 0.003051713660488494, "phrase": "single-machine_case"}, {"score": 0.002636956926079255, "phrase": "total_weighted_completion_time"}, {"score": 0.002406799309495983, "phrase": "m-machine_permutation_flowshop"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["scheduling", " learning effect", " deteriorating jobs", " single machine", " flowshop"], "paper_abstract": "Although scheduling with deteriorating jobs and learning effect has been widely investigated, scheduling research has seldom considered the two phenomena simultaneously. However, job deterioration and learning co-exist in many realistic scheduling situations. In this paper, we introduce a new scheduling model in which both job deterioration and learning exist simultaneously. The actual processing time of a job depends not only on the processing times of the jobs already processed but also on its scheduled position. For the single-machine case, we derive polynomial-time optimal solutions for the problems to minimize makespan and total completion time. In addition, we show that the problems to minimize total weighted completion time and maximum lateness are polynomially solvable under certain agreeable conditions. For the case of an m-machine permutation flowshop, we present polynomial-time optimal solutions for some special cases of the problems to minimize makespan and total completion time. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Some scheduling problems with deteriorating jobs and learning effects", "paper_id": "WOS:000255538000019"}