{"auto_keywords": [{"score": 0.03537587519106173, "phrase": "signaling_attack"}, {"score": 0.00481495049065317, "phrase": "dos_attacks"}, {"score": 0.004394592555435104, "phrase": "relatively_limited_bandwidth"}, {"score": 0.0040949726088047225, "phrase": "new_attacks"}, {"score": 0.0039120325834029355, "phrase": "novel_denial"}, {"score": 0.0036756196381448015, "phrase": "unique_vulnerabilities"}, {"score": 0.0035113478590679133, "phrase": "real_traces"}, {"score": 0.0032446544415922615, "phrase": "well-timed_low-volume_signaling_attack"}, {"score": 0.0030995835539697893, "phrase": "key_elements"}, {"score": 0.0030231983220281836, "phrase": "low-volume_nature"}, {"score": 0.002900037689072025, "phrase": "existing_intrusion_detection_algorithms"}, {"score": 0.002668524425703961, "phrase": "online_early_detection_algorithm"}, {"score": 0.002624482632439123, "phrase": "statistical_cusum_method"}, {"score": 0.002559775585192185, "phrase": "extensive_trace-driven_simulations"}, {"score": 0.0023750478314945303, "phrase": "significant_damage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["3G wireless", " Security", " Dos attacks"], "paper_abstract": "Third generation (3G) wireless networks based on the CDMA2000 and UMTS standards are now increasingly being deployed throughout the world. Because of their complex signaling and relatively limited bandwidth, these 3C networks are generally more vulnerable than their wireline counterparts, thus making them fertile ground for new attacks. In this paper, we identify and study a novel denial of service (DoS) attack, called signaling attack, that exploits the unique vulnerabilities of the signaling/control plane in 3G wireless networks. Using simulations driven by real traces, we are able to demonstrate the impact of a signaling attack. Specifically, we show how a well-timed low-volume signaling attack can potentially overload the control plane and detrimentally affect the key elements in a 3G wireless infrastructure. The low-volume nature of the signaling attack allows it to avoid detection by existing intrusion detection algorithms, which are often signature or volume-based. As a counter-measure, we present and evaluate an online early detection algorithm based on the statistical CUSUM method. Through the use of extensive trace-driven simulations, we demonstrate that the algorithm is robust and can identify an attack in its inception, before significant damage is done. Apart from 3C networks, we also show that many emerging wide-area networks such as 802.16/WiMax share the same vulnerability and our solution can also apply. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "On the detection of signaling DoS attacks on 3G/WiMax wireless networks", "paper_id": "WOS:000270059500001"}