{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "program_comprehension_tasks"}, {"score": 0.004695900553353526, "phrase": "execution_traces"}, {"score": 0.0043560464825349275, "phrase": "systems'_behaviour"}, {"score": 0.003980400251874277, "phrase": "effective_tools"}, {"score": 0.0038048583022763796, "phrase": "trace_abstraction_techniques"}, {"score": 0.003424677513304057, "phrase": "good_understanding"}, {"score": 0.0032571885279065126, "phrase": "trace_complexity"}, {"score": 0.002816246391862638, "phrase": "limited_indication"}, {"score": 0.0024717881264735477, "phrase": "routine_calls"}, {"score": 0.00242266141176955, "phrase": "ultimate_objective"}, {"score": 0.0022810491620483737, "phrase": "lengthy_traces"}], "paper_keywords": [""], "paper_abstract": "The analysis of execution traces has been shown to be useful in many software maintenance activities that require a certain understanding of the systems' behaviour. Traces, however, are extremely large, hence are difficult for humans to analyse without effective tools. These tools usually support some sort of trace abstraction techniques that can help users understand the essence of a trace despite the trace being massive. Designing such tools requires a good understanding of the amount of complexity embedded in traces. Trace complexity has traditionally been measured using the. le size or the number of lines in the trace. In this study, the authors argue that such metrics provide limited indication of the complexity of a trace. The authors address this issue by presenting a catalogue of metrics for assessing the various facets of traces of routine calls, with the ultimate objective being to facilitate the development of tools for the exploration of lengthy traces. The authors show the effectiveness of our metrics by applying them to 35 traces generated from four software systems.", "paper_title": "Understanding the complexity embedded in large routine call traces with a focus on program comprehension tasks", "paper_id": "WOS:000276591800006"}