{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "content_distribution_networks"}, {"score": 0.008250588598006698, "phrase": "synchronous_group"}, {"score": 0.007092082469225104, "phrase": "hcocop"}, {"score": 0.00481495049065317, "phrase": "group-oriented_playbacks"}, {"score": 0.004450568197899267, "phrase": "centralized_servers"}, {"score": 0.004327196832280818, "phrase": "static_content"}, {"score": 0.0041136473765874815, "phrase": "tv_broadcasts"}, {"score": 0.003845154818609644, "phrase": "collaborative_playback_service"}, {"score": 0.0034359094594153304, "phrase": "multimedia_session"}, {"score": 0.002951444412262927, "phrase": "media_streaming_session"}, {"score": 0.0028857130140890787, "phrase": "content_distribution_network"}, {"score": 0.0028373742057129126, "phrase": "analysis_phase"}, {"score": 0.002743105561254975, "phrase": "discrete-event_simulation"}, {"score": 0.0021288561076024844, "phrase": "centralized_architectures"}, {"score": 0.0021049977753042253, "phrase": "collaborative_playbacks"}], "paper_keywords": ["Collaborative control protocols", " Content distribution networks", " Playback services", " Performance evaluation"], "paper_abstract": "Content distribution networks have recently been introduced as a more efficient alternative to centralized servers for the delivery of static content as well as media streaming services ranging from TV broadcasts to video on-demand. Content Distribution Networks can also efficiently provide collaborative playback service, which allows a synchronous group of users to select, simultaneously watch altogether and share the control of a multimedia session. This paper presents the definition and analysis of the Hierarchical Cooperative Control Protocol (HCOCOP), which allows a synchronous group of users to share the control of the media streaming session provided by a Content Distribution Network. The analysis phase, which was supported by discrete-event simulation, was carried out to characterize the efficiency of the protocol on the basis of the following defined performance indices: blocking probability. denial probability. server load and network load. The performances obtained for architectures based on Content Distribution Networks are compared with those obtained for centralized architectures providing collaborative playbacks. The comparison shows that HCOCOP significantly improves performance of media streaming control. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A hierarchical control protocol for group-oriented playbacks supported by content distribution networks", "paper_id": "WOS:000266954000008"}