{"auto_keywords": [{"score": 0.023072044040138937, "phrase": "fuzzy_databases"}, {"score": 0.014448627059633736, "phrase": "evaluation_function"}, {"score": 0.010154211719325706, "phrase": "soft_conditional_preferences"}, {"score": 0.007129132995561293, "phrase": "preference_degree"}, {"score": 0.004157374465795314, "phrase": "primary_condition"}, {"score": 0.003963211180578005, "phrase": "fuzzy_predicates"}, {"score": 0.003909413809681226, "phrase": "soft_constraints"}, {"score": 0.00388278852285898, "phrase": "satisfaction_degrees"}, {"score": 0.0038431888954930083, "phrase": "satisfaction_degree"}, {"score": 0.0038170129089059013, "phrase": "c_tunes"}, {"score": 0.003317883538640966, "phrase": "basic_idea"}, {"score": 0.003284026247389735, "phrase": "proposed_model"}, {"score": 0.0029436264166293317, "phrase": "soft_conditions"}, {"score": 0.0028349323966217386, "phrase": "single_step"}, {"score": 0.002549672862868133, "phrase": "soft_constraint"}, {"score": 0.0023486473525617816, "phrase": "soft_condition"}, {"score": 0.002215897810312801, "phrase": "preferred_the_more_its_evaluation_function"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "In this paper, we model the evaluation of soft conditional preferences in flexibly querying fuzzy databases. We assume that soft conditional preferences are expressed in the form \"If C then Q1 is better than Q2,\" where C is the primary condition, and Q1, Q2 are the conditions with preferences. They are fuzzy predicates, which represent soft constraints admitting satisfaction degrees. The satisfaction degree of C tunes the preference of Q1 over Q2, so that as it increases also the preference of Q1 increases with respect to Q2. When C is not satisfied at all there is no preference between Q1 and Q2. The basic idea of the proposed model is to compute the preference degree of Q1 with respect to Q2 depending on the degree of satisfaction of C, and to use this value to modify the evaluation function of the soft conditions Q1 and Q2. This way we fuse in a single step the evaluations of both the selection conditions and their preference, which are the two subsequent phases necessary for evaluating queries with preferences in fuzzy databases. Specifically, the preference degree is used to relax the soft constraint imposed by the evaluation function of the most preferred condition Q1 as well as to restrict the evaluation function of the less preferred condition Q2. The more a soft condition is preferred, the more its evaluation function becomes tolerant 10 undersatisfaction; similarly, the less a condition is preferred the more its evaluation function is restricted so as to make more difficult its satisfaction. (C) 2008 Wiley Periodicals. Inc.", "paper_title": "A Flexible Model for the Evaluation of Soft Conditional Preferences in Fuzzy Databases", "paper_id": "WOS:000260936500005"}