{"auto_keywords": [{"score": 0.04697189954855942, "phrase": "perceived_discrepancies"}, {"score": 0.00481495049065317, "phrase": "individual_evaluation"}, {"score": 0.004383852039913171, "phrase": "perceived_alignment"}, {"score": 0.004344855841195913, "phrase": "organizational_and_business-unit_strategies"}, {"score": 0.004211069233133584, "phrase": "expected_and_received_service_delivery-many_different_measurement_approaches"}, {"score": 0.0037490909410974166, "phrase": "comparative_survey-based_measures"}, {"score": 0.0036826452656927877, "phrase": "published_research"}, {"score": 0.003569176320452192, "phrase": "information_systems"}, {"score": 0.0035216195857272403, "phrase": "organizational_behavior"}, {"score": 0.0033525843225012918, "phrase": "conceptual_assumptions"}, {"score": 0.003278447235176855, "phrase": "comparative_measurements"}, {"score": 0.0030794433253250476, "phrase": "user_satisfaction"}, {"score": 0.002971182100871581, "phrase": "relative_psychometric_performance"}, {"score": 0.002621297299343551, "phrase": "evaluative_component"}, {"score": 0.00259793885118959, "phrase": "stronger_predictive_validity"}, {"score": 0.0022816681646340518, "phrase": "multiple_new_measurement_approaches"}, {"score": 0.0021720199689914464, "phrase": "conceptual_underpinnings"}, {"score": 0.0021430393104977788, "phrase": "discrepancy_measure"}, {"score": 0.0021049977753042253, "phrase": "model_misspecifications"}], "paper_keywords": ["IS Service Satisfaction", " psychometric measurement", " performance-perception gap"], "paper_abstract": "When researchers are interested in capturing perceived discrepancies-for example, the perceived alignment between organizational and business-unit strategies, or the perceived gap between expected and received service delivery-many different measurement approaches are available. This paper presents a psychometric analysis of the various measures available to capture perceived discrepancies or gaps. More specifically, a set of comparative survey-based measures, drawn from published research across various disciplines, including marketing, information systems, and organizational behavior, are examined for their applicability. We first consider the conceptual assumptions of a set of comparative measurements previously employed by researchers to capture perceived discrepancies. In the context of predicting user satisfaction with a service, we test the relative psychometric performance of those measures along with some novel (modified) versions of those measures. Performance of the measures varies widely, with those that include an evaluative component offering stronger predictive validity than measures that focus exclusively on the size of the discrepancy. This paper contributes to the work on perceived discrepancies by empirically assessing both the current approaches, as well as multiple new measurement approaches. Our findings suggest that neglecting to attend to the conceptual underpinnings of a discrepancy measure can lead to model misspecifications and misinterpretations.", "paper_title": "Don't Mind the Gap: A Conceptual and Psychometric Analysis of the Individual Evaluation of Discrepancies in the Context of IS User Service Satisfaction", "paper_id": "WOS:000332484900001"}