{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "flickr"}, {"score": 0.03225439136091618, "phrase": "lcsh"}, {"score": 0.030494747211877084, "phrase": "preprocessed_set"}, {"score": 0.00481495049065317, "phrase": "historical_photographs"}, {"score": 0.004633429997452688, "phrase": "effective_metadata_creation"}, {"score": 0.0038047474331318974, "phrase": "existing_knowledge_organization_systems"}, {"score": 0.0036611708297251645, "phrase": "flickr_member_discussions"}, {"score": 0.00334144503360907, "phrase": "intrinsic_and_relational_quality"}, {"score": 0.003154012038613403, "phrase": "graphic_materials"}, {"score": 0.0029627701619228527, "phrase": "original_tag"}, {"score": 0.002703869368554536, "phrase": "invalid_or_misspelled_terms"}, {"score": 0.0025892330566358503, "phrase": "complex_terms"}, {"score": 0.002467536552997677, "phrase": "photostream_tags"}, {"score": 0.0023972764635919563, "phrase": "tgm"}, {"score": 0.0022845800828325555, "phrase": "regular_nouns"}, {"score": 0.0022626835039082746, "phrase": "noun_phrases"}, {"score": 0.0021049977753042253, "phrase": "controlled_vocabularies"}], "paper_keywords": [""], "paper_abstract": "To enable and guide effective metadata creation it is essential to understand the structure and patterns of the activities of the community around the photographs, resources used, and scale and quality of the socially created metadata relative to the metadata and knowledge already encoded in existing knowledge organization systems. This article presents an analysis of Flickr member discussions around the photographs of the Library of Congress photostream in Flickr. The article also reports on an analysis of the intrinsic and relational quality of the photostream tags relative to two knowledge organization systems: the Thesaurus for Graphic Materials (TGM) and the Library of Congress Subject Headings (LCSH). Thirty seven percent of the original tag set and 15.3% of the preprocessed set (after the removal of tags with fewer than three characters and URLs) were invalid or misspelled terms. Nouns, named entity terms, and complex terms constituted approximately 77% of the preprocessed set. More than a half of the photostream tags were not found in the TGM and LCSH, and more than a quarter of those terms were regular nouns and noun phrases. This suggests that these terms could be complimentary to more traditional methods of indexing using controlled vocabularies.", "paper_title": "Member Activities and Quality of Tags in a Collection of Historical Photographs in Flickr", "paper_id": "WOS:000284231100008"}