{"auto_keywords": [{"score": 0.039860121328897394, "phrase": "rcrt"}, {"score": 0.0058057129808589125, "phrase": "rate_allocation_decisions"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004776297980616768, "phrase": "emerging_high-rate_applications"}, {"score": 0.004514241562580097, "phrase": "large_volumes"}, {"score": 0.004232232993872917, "phrase": "key_requirement"}, {"score": 0.004032302251481604, "phrase": "sensor_data"}, {"score": 0.003920049436883885, "phrase": "congestion_collapse"}, {"score": 0.00363080961099728, "phrase": "constrained_sensor_nodes"}, {"score": 0.003501322813520807, "phrase": "explicit_loss_recovery"}, {"score": 0.003417565253539315, "phrase": "rate_adaptation_functionality"}, {"score": 0.003114584448820957, "phrase": "greater_efficiency"}, {"score": 0.0030278017562213265, "phrase": "network_behavior"}, {"score": 0.002534906456854208, "phrase": "sensor_code"}, {"score": 0.0023476282545620364, "phrase": "ifrc"}, {"score": 0.002174155795026218, "phrase": "imaging_application"}, {"score": 0.0021049977753042253, "phrase": "real_long-term_deployments"}], "paper_keywords": ["Algorithm", " Design", " Experimentation", " Performance", " Sensor networks", " congestion control", " reliable", " transport protocol", " centralized", " tiered network"], "paper_abstract": "Emerging high-rate applications (imaging, structural monitoring, acoustic localization) will need to transport large volumes of data concurrently from several sensors. These applications are also loss-intolerant. A key requirement for such applications, then, is a protocol that reliably transports sensor data from many sources to one or more sinks without incurring congestion collapse. In this article, we discuss RCRT, a rate-controlled reliable transport protocol suitable for constrained sensor nodes. RCRT uses end-to-end explicit loss recovery, but places all the congestion detection and rate adaptation functionality in the sinks. This has two important advantages: efficiency and flexibility. Because sinks make rate allocation decisions, they are able to achieve greater efficiency since they have a more comprehensive view of network behavior. For the same reason, it is possible to alter the rate allocation decisions (for example, from one that ensures that all nodes get the same rate, to one that ensures that nodes get rates in proportion to their demands), without modifying sensor code at all. We evaluate RCRT extensively on a 40-node wireless sensor network testbed and show that RCRT achieves 1.7 times the rate achieved by IFRC and 1.4 times that of WRCP, two recently proposed interference-aware distributed rate-control protocols. We also present results from a 3-month-long 19-node real world deployment of RCRT in an imaging application and show that RCRT works well in real long-term deployments.", "paper_title": "RCRT: Rate-Controlled Reliable Transport Protocol for Wireless Sensor Networks", "paper_id": "WOS:000285695800001"}