{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hermeneutic_circle"}, {"score": 0.00828531678485333, "phrase": "frequency_dependence"}, {"score": 0.007585569210519578, "phrase": "evolutionary_game_theory"}, {"score": 0.004694700982410345, "phrase": "natural_selection"}, {"score": 0.004539005582217309, "phrase": "frequency-dependent_selection"}, {"score": 0.0043699845927285905, "phrase": "literary_term"}, {"score": 0.00305285084207725, "phrase": "particular_strategy"}, {"score": 0.0028293966058473476, "phrase": "conceptual_and_modeling_tools"}, {"score": 0.002633355582628613, "phrase": "fitness_concept"}, {"score": 0.0023694065215394593, "phrase": "fitness_formulation"}, {"score": 0.0022713722522505592, "phrase": "strategy_frequencies"}, {"score": 0.002242758902593467, "phrase": "fitness_generating_function"}, {"score": 0.0022145072947747347, "phrase": "g-function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Evolution by natural selection may include both frequency and density-dependence. Frequency-dependent selection is a kind of hermeneutic circle. As a literary term (and a school of philosophy), a hermeneutic circle describes how each word of a sentence or paragraph simultaneously draws its meaning from its context (the other words) and contributes towards the context. Frequency dependence is like this. Under frequency dependence, the fitness of an individual is not only influenced by its own heritable phenotype (in evolutionary game theory heritable phenotype = strategy) but by the frequency of strategies found among others in the population. And, the fitness accrued by individuals with a particular strategy will in time influence the frequency of strategies in the population. The challenge is to develop conceptual and modeling tools that allow us to determine the outcome of this hermeneutic circle of evolution. We need a fitness concept that defines the fitness of (or payoff to) to individuals as influenced by both their own strategy and the strategies of others. And, this fitness formulation must describe how these payoffs translate into changes in strategy frequencies. The fitness generating function, or G-function, provides this service for evolutionary game theory. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "G-functions for the hermeneutic circle of evolution", "paper_id": "WOS:000232198700014"}