{"auto_keywords": [{"score": 0.03852645151929372, "phrase": "cluster_concentrations"}, {"score": 0.015719716506582524, "phrase": "location_decisions"}, {"score": 0.006914983752271387, "phrase": "industry_clusters"}, {"score": 0.004780926543714981, "phrase": "purpose_-_location_decisions"}, {"score": 0.004501217435918426, "phrase": "macro_perspective"}, {"score": 0.004298367681427065, "phrase": "-_county"}, {"score": 0.00428314621261913, "phrase": "level_source_information"}, {"score": 0.004104621766670225, "phrase": "bureau_of_economic_analysis"}, {"score": 0.004075598183172911, "phrase": "bea"}, {"score": 0.004032441847334232, "phrase": "national_association_of_counties"}, {"score": 0.003947492797744999, "phrase": "fedstats"}, {"score": 0.003796355951305572, "phrase": "profile_analysis"}, {"score": 0.0037295765964056255, "phrase": "objective_assessment"}, {"score": 0.0035995085881892464, "phrase": "resulting_typology"}, {"score": 0.0035740424892197155, "phrase": "clusters_concentrations"}, {"score": 0.003212906206685004, "phrase": "critical_location_decisions"}, {"score": 0.0031340167205149787, "phrase": "future_research_topics"}, {"score": 0.003013931023579108, "phrase": "exploratory_study"}, {"score": 0.0027577972695911825, "phrase": "cultural_differences"}, {"score": 0.0025686131021181134, "phrase": "geographic_location"}, {"score": 0.002532359001507531, "phrase": "national_differences"}, {"score": 0.002333586381274878, "phrase": "crucial_location_decisions"}, {"score": 0.002135146725817984, "phrase": "specific_industries"}], "paper_keywords": ["Cluster analysis", " Managers", " Decision making"], "paper_abstract": "Purpose - Location decisions are among the most costly decisions that organizations make. This research aims to examine location decisions from a macro perspective and to utilize findings for the development of a typology. Design/methodology/approach - County level source information from the US Census Bureau, the United States (US) Department of Commerce: Bureau of Economic Analysis (BEA), National Association of Counties (NACO), and Fedstats is used in this analysis. Discriminant analysis as a profile analysis is utilized as an objective assessment of differences between the cluster concentrations. Findings - The resulting typology of clusters concentrations is based on four constructs identified in the literature: innovation, specialization, complementariness and transfer of knowledge. This typology can serve as an aid in making these critical location decisions for practitioners as well as identifying future research topics for academia. Research limitations/implications - The research is an exploratory study and limited by its nature; therefore cause and effect cannot be definitively stated. Variables such as politics, environment, geography and cultural differences could have confounding effects on the study. The generalizability of the study could be affected because of the geographic location in relationship to national differences based on these and other variables. Practical implications - This typology of cluster concentrations can be used as a tool for managers when making crucial location decisions. Originality/value - The research is original in that it takes a more holistic approach to developing a typology of cluster concentrations. Rather than looking at specific industries and focusing on industry clusters, the research focuses on concentrations of industry clusters.", "paper_title": "A cluster concentration typology for making location decisions", "paper_id": "WOS:000280935600014"}