{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_indistinguishability"}, {"score": 0.012748535166539164, "phrase": "cryptographic_constructions"}, {"score": 0.004597244847332915, "phrase": "complexity-theoretic_cryptography"}, {"score": 0.004274766964161756, "phrase": "traditional_cryptography"}, {"score": 0.0036958398682001015, "phrase": "formal_proof_system"}, {"score": 0.0035519826240477444, "phrase": "hofmann's_slr_language"}, {"score": 0.0034363735647539267, "phrase": "probabilistic_polynomial-time_computations"}, {"score": 0.002707620139970122, "phrase": "set-theoretic_semantics"}, {"score": 0.0022943822838377456, "phrase": "goldreich"}, {"score": 0.0022641681733279353, "phrase": "micali"}, {"score": 0.0021903801614787423, "phrase": "pseudorandom_generator"}, {"score": 0.0021049977753042253, "phrase": "next-bit_unpredictability"}], "paper_keywords": [""], "paper_abstract": "Computational indistinguishability is a notion in complexity-theoretic cryptography and is used to define many security criteria. However, in traditional cryptography, proving computational indistinguishability is usually informal and becomes error-prone when cryptographic constructions are complex. This paper presents a formal proof system based on an extension of Hofmann's SLR language, which can capture probabilistic polynomial-time computations through typing and is sufficient for expressing cryptographic constructions. In particular, we define rules that directly justify the computational indistinguishability between programs, and then prove that these rules are sound with respect to the set-theoretic semantics, and thus the standard definition of security. We also show that it is applicable in cryptography by verifying, in our proof system, Goldreich and Micali's construction of a pseudorandom generator, and the equivalence between next-bit unpredictability and pseudorandomness.", "paper_title": "The computational SLR: a logic for reasoning about computational indistinguishability", "paper_id": "WOS:000284044600011"}