{"auto_keywords": [{"score": 0.043367051214551706, "phrase": "information_processing"}, {"score": 0.00481495049065317, "phrase": "habitual_use"}, {"score": 0.004739416327250269, "phrase": "ventral_brain_processes"}, {"score": 0.00453772385360173, "phrase": "diverse_methodologies"}, {"score": 0.004396426822203258, "phrase": "dorsal_brain_systems"}, {"score": 0.004225950334493496, "phrase": "recent_meta-analysis"}, {"score": 0.003904495523681369, "phrase": "self-report_test"}, {"score": 0.003359334465113303, "phrase": "previous_meta-analysis"}, {"score": 0.0032934951320964276, "phrase": "factor_analysis"}, {"score": 0.002971309306027602, "phrase": "ventral_items"}, {"score": 0.002855934865505357, "phrase": "standard_tests"}, {"score": 0.0027778413437997635, "phrase": "dorsal_items"}, {"score": 0.0027341763737751467, "phrase": "general_intelligence"}, {"score": 0.002648889316519512, "phrase": "different_patterns"}, {"score": 0.002556109032208553, "phrase": "different_types"}, {"score": 0.002456816881853114, "phrase": "biologically_inspired_cognitive_architectures"}, {"score": 0.0022428042503686053, "phrase": "dorsal_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Functional architecture", " Ventral vs. dorsal systems", " Cognitive neuroscience", " Cognitive testing"], "paper_abstract": "Many studies, using diverse methodologies, converge in identifying distinct ventral versus dorsal brain systems that are used in perception and memory. A recent meta-analysis characterized the types of information processing carried out by the two systems. We build on that work to develop a self-report test that can allow researchers to characterize the degree to which individuals tend to rely on the two sorts of processing. In order to do so, we first developed items that conformed with the results of the previous meta-analysis. Iterative testing and factor analysis allowed us to select items that tapped primarily into one, but not the other, system. Further testing revealed that scores on the ventral items were not correlated with scores on a set of standard tests, and that scores on the dorsal items were correlated with general intelligence and some measures of personality. The different patterns of correlation further attest that the items tap different types of processing. This work can help to develop biologically inspired cognitive architectures by illuminating principles of information processing in the brain; specifically, it provides further evidence of a way of characterizing the ventral and dorsal systems and it demonstrates ways in which individuals differ in their information-processing strategies. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Assessing habitual use of dorsal versus ventral brain processes: The dorsal-ventral questionnaire", "paper_id": "WOS:000209359400006"}