{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "truly-protect"}, {"score": 0.0044398358177815305, "phrase": "software_protection_method"}, {"score": 0.0043506951029334984, "phrase": "protection_methods"}, {"score": 0.004156590395333602, "phrase": "general_approach"}, {"score": 0.0036988415150699945, "phrase": "rolles'_attack"}, {"score": 0.0033759367489122716, "phrase": "virtual_machine"}, {"score": 0.0032746712603464235, "phrase": "encrypted_programs"}, {"score": 0.0031125795874844438, "phrase": "software_piracy"}, {"score": 0.0030655302236416502, "phrase": "unlicensed_copies"}, {"score": 0.002943502888225748, "phrase": "digital_rights_management_system"}, {"score": 0.0027000395818027366, "phrase": "performance_penalty"}, {"score": 0.002632332114727894, "phrase": "preliminary_version"}, {"score": 0.002342048999008582, "phrase": "system's_description"}], "paper_keywords": ["Copy-protection", " DRM", " process virtual machine"], "paper_abstract": "We present Truly-Protect that is a software protection method. Previously published protection methods relied solely on obscurity. Rolles proposed a general approach for breaking systems that are based on obscurity. We show that, under certain assumptions, Truly-Protect is resistant not only to Rolles' attack but also to any other attacks that do not violate the assumptions. Truly-Protect is based on a virtual machine that enables us to execute encrypted programs. Truly-Protect can serve as a platform for preventing software piracy of obtaining unlicensed copies. Truly-Protect by itself is not a digital rights management system but can form a basis for such a system. We discuss several scenarios and implementations and validate the performance penalty of our protection. A preliminary version of this paper appeared in the 5th International Conference on Network and System Security (NSS2011). It was extended by expanding the system's description, adding more efficient parallel implementation, just-in-time decryption, and a comprehensive performance analysis. It also contains all the necessary proofs.", "paper_title": "Truly-Protect: An Efficient VM-Based Software Protection", "paper_id": "WOS:000321641800011"}