{"auto_keywords": [{"score": 0.046465197677401135, "phrase": "provenance_information"}, {"score": 0.010327087937538244, "phrase": "usgcrp"}, {"score": 0.00810988355134179, "phrase": "pilot_systems"}, {"score": 0.007241762029033615, "phrase": "draft_report"}, {"score": 0.005153542841008048, "phrase": "global_change_research"}, {"score": 0.004721602309430702, "phrase": "u.s._global_change_research_program"}, {"score": 0.00454027551702508, "phrase": "climate_change"}, {"score": 0.0043148760739240575, "phrase": "assessment_findings"}, {"score": 0.004264463695140275, "phrase": "great_public_and_academic_concern"}, {"score": 0.004068611852912931, "phrase": "use_case-driven_iterative_methodology"}, {"score": 0.0038969619124903884, "phrase": "content_structure"}, {"score": 0.00385141330111392, "phrase": "recent_national_climate_assessment_draft_report"}, {"score": 0.003561017335579207, "phrase": "scientific_findings"}, {"score": 0.002462867872567125, "phrase": "global_change_information_system"}, {"score": 0.002349561762300369, "phrase": "entire_scope"}, {"score": 0.0021721582450016, "phrase": "scientific_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Provenance", " Ontology engineering", " Use cases", " Global change", " Semantic web"], "paper_abstract": "The National Climate Assessment of the U.S. Global Change Research Program (USGCRP) analyzes and presents the impacts of climate change on the United States. The provenance information in the assessment is important because the assessment findings are of great public and academic concern and are used in policy and decision-making. By applying a use case-driven iterative methodology, we developed information models and ontology to represent the content structure of the recent National Climate Assessment draft report and its associated provenance information. We tested the ontology by using it in pilot systems serving information about instances of chapters, scientific findings, figures, tables, images, datasets, references, people, and organizations, etc. in the draft report, as well as interrelationships among those instances. The results successfully help users trace provenance in the draft report, such as finding all the journal articles from which a figure in the report was derived. The provenance information in our work was maintained in the context of the \"Web of Data\". In addition to the pilot systems we developed, other tools and services are also able to retrieve and utilize the provenance information. Our work is part of a Global Change Information System coordinated by the USGCRP that will eventually cover provenance information for the entire scope of global change research. Such a system will greatly increase understanding, credibility and trust in the global change research and foster reproducibility of scientific results and conclusions. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Ontology engineering in provenance enablement for the National Climate Assessment", "paper_id": "WOS:000343852500016"}