{"auto_keywords": [{"score": 0.03596176205294269, "phrase": "extracted_rain_bands"}, {"score": 0.00481495049065317, "phrase": "gaussian_mixture_model_co-estimation"}, {"score": 0.004760017604908536, "phrase": "precipitation_forecast_verification"}, {"score": 0.0044688500725247726, "phrase": "gaussian_mixture_model"}, {"score": 0.0040767015025213625, "phrase": "concise_view"}, {"score": 0.0032028587883593702, "phrase": "novel_co-estimation_approach"}, {"score": 0.003094306770612843, "phrase": "forecast_and_observation_data"}, {"score": 0.0025892330566358503, "phrase": "novel_visualization"}, {"score": 0.0025596276616952516, "phrase": "exploration_framework"}, {"score": 0.002361632539339945, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "novel_insight"}], "paper_keywords": ["Weather Visualization", " Visual Analytics", " Verification"], "paper_abstract": "Precipitation forecast verification is essential to the quality of a forecast. The Gaussian mixture model (GMM) can be used to approximate the precipitation of several rain bands and provide a concise view of the data, which is especially useful for comparing forecast and observation data. The robustness of such comparison mainly depends on the consistency of and the correspondence between the extracted rain bands in the forecast and observation data. We propose a novel co-estimation approach based on GMM in which forecast and observation data are analysed simultaneously. This approach naturally increases the consistency of and correspondence between the extracted rain bands by exploiting the similarity between both forecast and observation data. Moreover, a novel visualization and exploration framework is implemented to help the meteorologists gain insight from the forecast. The proposed approach was applied to the forecast and observation data provided by the China Meteorological Administration. The results are evaluated by meteorologists and novel insight has been gained.", "paper_title": "Forecast Verification and Visualization based on Gaussian Mixture Model Co-estimation", "paper_id": "WOS:000362978000008"}