{"auto_keywords": [{"score": 0.042150781020745584, "phrase": "different_failure_modes"}, {"score": 0.015719716506582538, "phrase": "rock_wedges"}, {"score": 0.013495148676095659, "phrase": "n-dimensional_equivalent_method"}, {"score": 0.010682549621015051, "phrase": "proposed_approach"}, {"score": 0.004773904938276846, "phrase": "correlated_failure_modes"}, {"score": 0.004652845998457721, "phrase": "system_reliability_approach"}, {"score": 0.004496174406337201, "phrase": "multiple_correlated_failure_modes"}, {"score": 0.00443878620915958, "phrase": "probabilistic_fault_tree"}, {"score": 0.004326188427877999, "phrase": "system_aspects"}, {"score": 0.004216434794603139, "phrase": "system_reliability_analysis"}, {"score": 0.003988055287053139, "phrase": "reliability_sensitivity_analyses"}, {"score": 0.0033454448643854525, "phrase": "example_case"}, {"score": 0.0030837288356760973, "phrase": "proposed_system_reliability_approach"}, {"score": 0.0028060889647071787, "phrase": "monte_carlo_simulation_method"}, {"score": 0.0024461474613359994, "phrase": "relative_importance"}, {"score": 0.0023942269247089277, "phrase": "system_reliability"}, {"score": 0.002216251512062482, "phrase": "sensitivity_results"}, {"score": 0.0021599099979586946, "phrase": "selected_sensitivity_analysis_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Rock wedge", " System reliability", " N-dimensional equivalent method", " Probabilistic fault tree", " Correlated failure modes"], "paper_abstract": "This paper proposes a system reliability approach for evaluating the stabilities of rock wedges considering multiple correlated failure modes. A probabilistic fault tree is employed to model the system aspects of the problem. The system reliability analysis is performed using an N-dimensional equivalent method taking into account correlations between different failure modes. Reliability sensitivity analyses at three different levels, namely, single limit state function level, single failure mode level, and system reliability level, were carried out to study the effect of changes in variables on the stability of the wedge. An example case was analysed to illustrate the proposed approach. The stability of the wedge can be evaluated efficiently using the proposed system reliability approach in a more systematic and quantitative way. The probabilities of failure of the wedge from the N-dimensional equivalent method are fairly consistent with those from the Monte Carlo simulation method. The results demonstrate that the probability of failure will be overestimated if the correlations between different failure modes of the wedge are not taken into account. They also demonstrate that the relative importance of different failure modes to the system reliability of the wedge can differ considerably and be treated systematically and quantitatively by the proposed approach. The sensitivity results are highly dependent on the selected sensitivity analysis level. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A system reliability approach for evaluating stability of rock wedges with correlated failure modes", "paper_id": "WOS:000271136500005"}