{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "point_communication"}, {"score": 0.049496721057450455, "phrase": "distributed_systems"}, {"score": 0.03414229704911109, "phrase": "point-to-point_communication"}, {"score": 0.003958299299658418, "phrase": "growing_gap"}, {"score": 0.0036107898615445797, "phrase": "memory_platforms"}, {"score": 0.003545024951402818, "phrase": "increased_need"}, {"score": 0.003375429082739004, "phrase": "distributed_communication"}, {"score": 0.00327356326590461, "phrase": "general_software-parameterized_model"}, {"score": 0.0025615908073796027, "phrase": "point-to-point_and_broadcast_communication_costs"}, {"score": 0.0023221248824337576, "phrase": "existing_communication_models"}, {"score": 0.0021309898622781124, "phrase": "practical_use"}, {"score": 0.0021049977753042253, "phrase": "real_systems"}], "paper_keywords": ["distributed systems", " middleware", " performance modeling and prediction"], "paper_abstract": "Many existing models of point-to-point communication in distributed systems ignore the impact of memory and middleware. Including such details may make these models impractical. Nonetheless, the growing gap between memory and CPU performance combined with the trend toward large-scale, clustered shared memory platforms implies an increased need to consider the impact of middleware on distributed communication. We present a general software-parameterized model of point-to-point communication for use in performance prediction and evaluation. We illustrate the utility of the model in three ways: 1) to derive a simplified, useful, more accurate model of point-to-point communication in clusters of SMPs, 2) to predict and analyze point-to-point and broadcast communication costs in clusters of SMPs, and 3) to express, compare, and contrast existing communication models. Though our methods are general, we present results on several Linux clusters to illustrate practical use on real systems.", "paper_title": "log(n) P and log(3) P: Accurate analytical models of point-to-point communication in distributed systems", "paper_id": "WOS:000243558500003"}