{"auto_keywords": [{"score": 0.04937387161038601, "phrase": "bioactive_signature"}, {"score": 0.015719716506582538, "phrase": "individual_components"}, {"score": 0.01533975002542286, "phrase": "natural_products"}, {"score": 0.004628101576367193, "phrase": "new_approach"}, {"score": 0.004171259063201874, "phrase": "uniform_design"}, {"score": 0.004009288598277725, "phrase": "synthetic_mixtures"}, {"score": 0.0037407704200033607, "phrase": "ferric_reducing_antioxidant_power"}, {"score": 0.003577691211998842, "phrase": "prepared_mixtures"}, {"score": 0.0033214877574484535, "phrase": "frap"}, {"score": 0.0031453010852936334, "phrase": "independent_external_validation"}, {"score": 0.002993231973906559, "phrase": "multi-component_pls_model"}, {"score": 0.002834409847642238, "phrase": "excellent_prediction_performance"}, {"score": 0.002806449337145999, "phrase": "antioxidant_strength"}, {"score": 0.0026839922027139967, "phrase": "quantitative_pattern-activity_relationship"}, {"score": 0.0024916260764216752, "phrase": "individual_bioactive_strength"}, {"score": 0.0024306105794630246, "phrase": "bioactive_capacity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bioactivity", " Natural products", " Herbal medicine", " Multivariate regression", " Target projection", " Variable selection"], "paper_abstract": "A new approach for assigning bioactivity to individual components in extracts from natural products is presented and validated. 60 mixtures were created according to a uniform design from 12 chemical components of which 7 possessed antioxidant activity. The synthetic mixtures were characterized by chromatographic profiling and their antioxidant power was assessed by use of the Ferric Reducing Antioxidant Power (FRAP) assay. 40 of the prepared mixtures were used as a training set to create a cross validated partial least squares (PLS) regression model with the FRAP measurement as response. The remaining 20 mixtures were used as an independent external validation set. The bioactive signature was singled out from the multi-component PLS model using target projection (TP). In addition to excellent prediction performance of antioxidant strength from the bioactive signature, our approach, called Quantitative Pattern-Activity Relationship (QPAR), was able to rank 6 of the 7 bioactive components according to individual bioactive strength. The ratios of bioactive capacity of the two most active components to the two least active components were close to 100 to 1. This explains why one of the two least bioactive components was not detected. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Chromatographic profiling and multivariate analysis for screening and quantifying the contributions from individual components to the bioactive signature in natural products", "paper_id": "WOS:000291714700012"}