{"auto_keywords": [{"score": 0.0496463517482477, "phrase": "software_information_sites"}, {"score": 0.015301842770090406, "phrase": "software_engineers"}, {"score": 0.014961983575014366, "phrase": "online_media"}, {"score": 0.004815227163765312, "phrase": "contents"}, {"score": 0.004437115547184535, "phrase": "new_and_interesting_technologies"}, {"score": 0.003978866233891427, "phrase": "software_development"}, {"score": 0.0038895008852940323, "phrase": "test_processes"}, {"score": 0.003716724243777879, "phrase": "tagcombine"}, {"score": 0.00330246222643051, "phrase": "tag_recommendation"}, {"score": 0.003257727050827128, "phrase": "multi-label_learning_problem"}, {"score": 0.0030707512751243214, "phrase": "similar_objects"}, {"score": 0.0028682668647074397, "phrase": "different_terms"}, {"score": 0.002559953249728854, "phrase": "ubuntu"}, {"score": 0.002536763634539386, "phrase": "freecode"}, {"score": 0.002502374576203785, "phrase": "stack_overflow"}, {"score": 0.0022537212268979507, "phrase": "al-kofahi_et_al"}, {"score": 0.0021049977753042253, "phrase": "zangerle_et_al"}], "paper_keywords": ["software information site", " online media", " tag recommendation"], "paper_abstract": "Nowadays, software engineers use a variety of online media to search and become informed of new and interesting technologies, and to learn from and help one another. We refer to these kinds of online media which help software engineers improve their performance in software development, maintenance, and test processes as software information sites. In this paper, we propose TagCombine, an automatic tag recommendation method which analyzes objects in software information sites. TagCombine has three different components: 1) multi-label ranking component which considers tag recommendation as a multi-label learning problem; 2) similarity-based ranking component which recommends tags from similar objects; 3) tag-term based ranking component which considers the relationship between different terms and tags, and recommends tags after analyzing the terms in the objects. We evaluate TagCombine on four software information sites, Ask Different, Ask Ubuntu, Freecode, and Stack Overflow. On averaging across the four projects, TagCombine achieves recall@5 and recall@10 to 0.6198 and 0.7625 respectively, which improves TagRec proposed by Al-Kofahi et al. by 14.56% and 10.55% respectively, and the tag recommendation method proposed by Zangerle et al. by 12.08% and 8.16% respectively.", "paper_title": "Tag Combine: Recommending Tags to Contents in Software Information Sites", "paper_id": "WOS:000361416400008"}