{"auto_keywords": [{"score": 0.026566810399653005, "phrase": "ms."}, {"score": 0.010831478277755258, "phrase": "tnt"}, {"score": 0.004859208301080428, "phrase": "bsl"}, {"score": 0.00481495049065317, "phrase": "manufactured_solutions"}, {"score": 0.004445739135694758, "phrase": "well-known_eddy-viscosity_turbulence_models"}, {"score": 0.003966667994579941, "phrase": "two-equation_k-omega_model"}, {"score": 0.0032487508969192293, "phrase": "turbulence_models"}, {"score": 0.0031215289677725693, "phrase": "proposed_mss"}, {"score": 0.003068537223324389, "phrase": "second-order_accurate_numerical_method"}, {"score": 0.0029652292779277782, "phrase": "turbulence_quantities"}, {"score": 0.0028006988338192375, "phrase": "numerical_solutions"}, {"score": 0.0021908807203548345, "phrase": "convergence_properties"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["manufactured solutions", " code verification", " eddy-viscosity", " turbulence models"], "paper_abstract": "This paper presents manufactured solutions (MSs) for some well-known eddy-viscosity turbulence models, viz. the Spalart & Allmaras one-equation model and the TNT and BSL versions of the two-equation k-omega model. The manufactured flow solutions apply to two-dimensional, steady, wall-bounded, incompressible, turbulent flows. The two velocity components and the pressure are identical for all MSs, but various alternatives are considered for specifying the eddy-viscosity and other turbulence quantities in the turbulence models. The results obtained for the proposed MSs with a second-order accurate numerical method show that the MSs for turbulence quantities must be constructed carefully to avoid instabilities in the numerical solutions. This behaviour is model dependent: the performance of the Spalart & Allmaras and k-omega models is significantly affected by the type of MS. In one of the MSs tested, even the two versions of the k-omega model exhibit significant differences in the convergence properties. Copyright (c) 2006 John Wiley & Sons, Ltd.", "paper_title": "On the construction of manufactured solutions for one and two-equation eddy-viscosity models", "paper_id": "WOS:000246192700001"}