{"auto_keywords": [{"score": 0.03854414259453714, "phrase": "network_throughput"}, {"score": 0.010612911327698748, "phrase": "mac"}, {"score": 0.010478444071309894, "phrase": "wireless_mobile_ad_hoc_networks"}, {"score": 0.006487102331573764, "phrase": "relative_directions"}, {"score": 0.005566116778380102, "phrase": "directional_antennas"}, {"score": 0.004536244367689415, "phrase": "transmission_range"}, {"score": 0.004440648141548589, "phrase": "spatial_reuse"}, {"score": 0.004219321533320583, "phrase": "deafness_problem"}, {"score": 0.0041835168653521, "phrase": "hidden_terminal_problem"}, {"score": 0.0040779081518317415, "phrase": "network_performance"}, {"score": 0.003958049372486465, "phrase": "mac_protocol"}, {"score": 0.003858110309630846, "phrase": "sdmac"}, {"score": 0.003512702405367876, "phrase": "first_one"}, {"score": 0.00268488398249084, "phrase": "extensive_simulations"}, {"score": 0.002539978170928796, "phrase": "existing_mac_protocols"}, {"score": 0.0022442249871042026, "phrase": "high_network_throughput"}, {"score": 0.0021049977753042253, "phrase": "side_lobe_gain"}], "paper_keywords": ["Wireless mobile ad hoc networks", " MAC protocol", " Directional antennas"], "paper_abstract": "Using directional antennas in wireless mobile ad hoc networks can greatly improve the transmission range as well as the spatial reuse. However, it will also cause some problems such as deafness problem and hidden terminal problem, which greatly impair the network performance. This paper first proposes a MAC protocol called Selectively Directional MAC (SDMAC) that can effectively address these problems and significantly improve the network throughput. Then two improvements on SDMAC are proposed. The first one is to improve the network throughput by scheduling the packets in the queue (a scheme called Q-SDMAC), thus the head-of-line (HOL) blocking problem can be addressed. The second one is to relax the assumption that each node knows the relative directions of its neighboring nodes and use caches to buffer those relative directions (a scheme named Q-SDMAC using cache). Extensive simulations show that: (1) SDMAC can achieve much better performance than the existing MAC protocols using directional antennas; (2) The network throughput can be significantly improved by scheduling the packets in the queue; (3) Using caches can still achieve high network throughput when nodes are moving; and (4) Network throughput decreases when directional antennas have side lobe gain.", "paper_title": "SDMAC: Selectively Directional MAC protocol for wireless mobile ad hoc networks", "paper_id": "WOS:000265047300008"}