{"auto_keywords": [{"score": 0.041177292345602544, "phrase": "pbr_perspectives"}, {"score": 0.012224236841702386, "phrase": "original_study"}, {"score": 0.00481495049065317, "phrase": "individual_reviewer_effectiveness"}, {"score": 0.0044685410845412745, "phrase": "perspective_based_reading"}, {"score": 0.003984968827278219, "phrase": "complementary_aspects"}, {"score": 0.0037913267098534887, "phrase": "brief_discussion"}, {"score": 0.003500812175550438, "phrase": "detailed_statistical_analysis"}, {"score": 0.003281186608301359, "phrase": "individual_pbr_perspectives"}, {"score": 0.0032004205378150354, "phrase": "interesting_dichotomy"}, {"score": 0.002769568481822277, "phrase": "similar_sets"}, {"score": 0.002469401435042064, "phrase": "pbr"}, {"score": 0.002268598551466928, "phrase": "new_hypothesis"}, {"score": 0.002234893735225432, "phrase": "complementary_aspect"}], "paper_keywords": ["software inspections", " experimental replication", " laboratory package", " software reading techniques", " requirements documents"], "paper_abstract": "This paper describes a replication conducted to compare the effectiveness of inspectors using Perspective Based Reading (PBR) to the effectiveness of inspectors using a checklist. The goal of this replication was to better understand the complementary aspects of the PBR perspectives. To this end, a brief discussion of the original study is provided as well as a more detailed description of the replication. A detailed statistical analysis is then provided along with analysis of the PBR perspectives. For the individual PBR perspectives, we saw an interesting dichotomy: In the original study there was little overlap among the sets of defects found by each of the three perspectives, while in the replication two of the three perspectives found similar sets of defects on one of the two documents used in the study. Interestingly this document was the only case where the users of PBR were not more effective than the users of a checklist. This result leads to a new hypothesis that the complementary aspect of the PBR perspectives is the characteristic that provides the benefit over other defect detection techniques.", "paper_title": "Perspective-based reading: A replicated experiment focused on individual reviewer effectiveness", "paper_id": "WOS:000235443500005"}