{"auto_keywords": [{"score": 0.0485973663751699, "phrase": "offshore_software_development"}, {"score": 0.03277003369205044, "phrase": "particular_locations"}, {"score": 0.029896395013430218, "phrase": "offshore_service_providers"}, {"score": 0.00481495049065317, "phrase": "nearshore_software_development"}, {"score": 0.004461051281091779, "phrase": "contemporary_globalisation"}, {"score": 0.0042650992966174065, "phrase": "information_and_communication_technologies"}, {"score": 0.00415166680936294, "phrase": "research_in_the_international_business_and_information_systems_fields"}, {"score": 0.0036443694410100507, "phrase": "multinational_investment"}, {"score": 0.0032423089921154503, "phrase": "whole_country"}, {"score": 0.003071965703296204, "phrase": "offshoring_destinations"}, {"score": 0.0029767499830258754, "phrase": "track_record"}, {"score": 0.0028715299874549245, "phrase": "nearshore_software_development_centres"}, {"score": 0.002782514825369359, "phrase": "caribbean"}, {"score": 0.0026720866990543744, "phrase": "initial_decision"}, {"score": 0.0021920373388760314, "phrase": "government_agencies"}, {"score": 0.00216263228969761, "phrase": "locational_characteristics"}, {"score": 0.002124036931047162, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["globalisation", " offshore outsourcing", " nearshore outsourcing", " software development", " location", " placelessness"], "paper_abstract": "Offshore software development has been identified as one of the most striking manifestations of contemporary globalisation and as evidence of placelessness, the idea that information and communication technologies have rendered location irrelevant. Research in the International Business and Information Systems fields, in contrast, has suggested that all locations are not equal and has identified a number of characteristics that may influence the attractiveness of a location for multinational investment and offshoring, respectively. These literatures, however, focus almost exclusively on quantitative, economic characteristics that are seen as fixed and applying uniformly throughout a whole country. They therefore offer little guidance on the suitability of particular locations as offshoring destinations, especially in countries without a track record in offshore software development. Drawing on two cases of nearshore software development centres set up by offshore service providers in the Caribbean, this paper illustrates that, while the initial decision to establish the ventures reflected a logic of placelessness, characteristics of these particular locations affected their subsequent success. Through the findings, we therefore develop a typology of espoused, unanticipated and remediable locational characteristics, which illustrates that locational attractiveness may vary significantly within countries and that offshore service providers and government agencies can modify locational characteristics to their advantage. European Journal of Information Systems (2012) 21, 529-551. doi:10.1057/ejis.2012.7; published online 13 March 2012", "paper_title": "Everywhere and nowhere: nearshore software development in the context of globalisation", "paper_id": "WOS:000308448100005"}