{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genetic_heterogeneity"}, {"score": 0.049668773491620556, "phrase": "exome-sequencing_data"}, {"score": 0.03132983077357984, "phrase": "biogranat-ig"}, {"score": 0.004692227830462433, "phrase": "recent_exome-sequencing_studies"}, {"score": 0.004612147352416241, "phrase": "disease-causing_sequence_variants"}, {"score": 0.004305203085016233, "phrase": "current_data_analysis_strategies"}, {"score": 0.004053362743156545, "phrase": "incomplete_penetrance"}, {"score": 0.0036395944934310524, "phrase": "biological_networks"}, {"score": 0.003426556090707852, "phrase": "disease-causing_role"}, {"score": 0.0031845067058084583, "phrase": "sequence_variant"}, {"score": 0.003130077012135034, "phrase": "small_subnetworks"}, {"score": 0.0030239842475439814, "phrase": "simulated_exome-sequencing_data"}, {"score": 0.002738523189244011, "phrase": "underlying_complex"}, {"score": 0.002427035025924384, "phrase": "set-cover-based_approach"}, {"score": 0.002344845055688552, "phrase": "java"}, {"score": 0.0021416404045850224, "phrase": "supplementary_data"}, {"score": 0.002105091813660743, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Recent exome-sequencing studies have successfully identified disease-causing sequence variants for several rare monogenic diseases by examining variants common to a group of patients. However, the current data analysis strategies are only insufficiently able to deal with confounding factors such as genetic heterogeneity, incomplete penetrance, individuals lacking data and involvement of several genes. Results: We introduce BioGranat-IG, an analysis strategy that incorporates the information contained in biological networks to the analysis of exome-sequencing data. To identify genes that may have a disease-causing role, we label all nodes of the network according to the individuals that are carrying a sequence variant and subsequently identify small subnetworks linked to all or most individuals. Using simulated exome-sequencing data, we demonstrate that BioGranat-IG is able to recover the genes responsible for two diseases known to be caused by variants in an underlying complex. We also examine the performance of BioGranat-IG under various conditions likely to be faced by the user, and show that its network-based approach is more powerful than a set-cover-based approach. Availability: We implemented our methods in Java as BioGranat-IG, a bundle within our BioGranat graph analysis and visualization tool (www.biogranat.org). Contact: thomas.schlitt@genetics.kcl.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "BioGranat-IG: a network analysis tool to suggest mechanisms of genetic heterogeneity from exome-sequencing data", "paper_id": "WOS:000316270400009"}