{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dense_matrices"}, {"score": 0.004615202066192795, "phrase": "efficient_implementation"}, {"score": 0.003936910716320182, "phrase": "strassen-winograd_matrix_multiplication"}, {"score": 0.0035408501923902477, "phrase": "good_performance"}, {"score": 0.003466536738232506, "phrase": "amd's_opteron_processor"}, {"score": 0.0034299649219748513, "phrase": "particulary_good_performance"}, {"score": 0.0032527939106509946, "phrase": "stand-alone_package"}, {"score": 0.0031342307827666675, "phrase": "sage_mathematics_system"}, {"score": 0.0030847461428168614, "phrase": "machine_terms"}, {"score": 0.002818692837561076, "phrase": "machine_word"}, {"score": 0.002481588370380518, "phrase": "element-wise_operations"}, {"score": 0.002255431275670053, "phrase": "actual_bottlenecks"}, {"score": 0.0021501863832966966, "phrase": "data_locality"}], "paper_keywords": ["Algorithms", " Experimentation", " GF(2)", " matrix", " linear algebra", " multiplication", " Strassen", " greasing"], "paper_abstract": "We describe an efficient implementation of a hierarchy of algorithms for multiplication of dense matrices over the field with two elements (F(2)). In particular we present our implementation in the M4RI library-of Strassen-Winograd matrix multiplication and the \"Method of the Four Russians for Multiplication\" (M4RM) and compare it against other available implementations. Good performance is demonstrated on AMD's Opteron processor and particulary good performance on Intel's Core 2 Duo processor. The open-source M4RI library is available as a stand-alone package as well as part of the Sage mathematics system. In machine terms, addition in F2 is logical-XOR, and multiplication is logical-AND, thus a machine word of 64 bits allows one to operate on 64 elements of F2 in parallel: at most one CPU cycle for 64 parallel additions or multiplications. As such, element-wise operations over F2 are relatively cheap. In fact, in this paper, we conclude that the actual bottlenecks are memory reads and writes and issues of data locality. We present our empirical findings in relation to minimizing these and give an analysis thereof.", "paper_title": "Algorithm 898: Efficient Multiplication of Dense Matrices over GF(2)", "paper_id": "WOS:000274028800009"}