{"auto_keywords": [{"score": 0.049763552914073306, "phrase": "negative_examples"}, {"score": 0.04540247636200145, "phrase": "positive_examples"}, {"score": 0.04468830753491191, "phrase": "unlabeled_examples"}, {"score": 0.02484399330550375, "phrase": "pnlh"}, {"score": 0.00481495049065317, "phrase": "text_classification"}, {"score": 0.004374852170791322, "phrase": "text_classifier"}, {"score": 0.004081385289516914, "phrase": "negative_example"}, {"score": 0.003948613642680196, "phrase": "reliable_text_classifier"}, {"score": 0.0036714667610391535, "phrase": "poor_approach"}, {"score": 0.003459191419478298, "phrase": "two-step_heuristic"}, {"score": 0.0033465923623290034, "phrase": "u._second"}, {"score": 0.0032483801419536675, "phrase": "n._surprisingly"}, {"score": 0.0031426214970263137, "phrase": "u._intuitively"}, {"score": 0.00273547054239215, "phrase": "u"}, {"score": 0.0025935242726503964, "phrase": "positive_example"}, {"score": 0.0023481972886024347, "phrase": "labeling_heuristic"}, {"score": 0.002256677005409071, "phrase": "high_quality_positive_examples"}, {"score": 0.002154392046210367, "phrase": "existing_classifiers"}], "paper_keywords": ["data mining", " text categorization", " partially supervised learning", " labeling unlabeled data"], "paper_abstract": "Traditionally, building a classifier requires two sets of examples: positive examples and negative examples. This paper studies the problem of building a text classifier using positive examples (P) and unlabeled examples (U). The unlabeled examples are mixed with both positive and negative examples. Since no negative example is given explicitly, the task of building a reliable text classifier becomes far more challenging. Simply treating all of the unlabeled examples as negative examples and building a classifier thereafter is undoubtedly a poor approach to tackling this problem. Generally speaking, most of the studies solved this problem by a two-step heuristic: First, extract negative examples (N) from U. Second, build a classifier based on P and N. Surprisingly, most studies did not try to extract positive examples from U. Intuitively, enlarging P by P' (positive examples extracted from U) and building a classifier thereafter should enhance the effectiveness of the classifier. Throughout our study, we find that extracting P' is very difficult. A document in U that possesses the features exhibited in 1 does not necessarily mean that it is a positive example, and vice versa. The very large size of and very high diversity in U also contribute to the difficulties of extracting P'. In this paper, we propose a labeling heuristic called PNLH to tackle this problem. PNLH aims at extracting high quality positive examples and negative examples from U and can be used on top of any existing classifiers. Extensive experiments based on. several benchmarks are conducted. The results indicated that PNLH is highly feasible, especially in the situation where \\P\\ is extremely small.", "paper_title": "Text classification without negative examples revisit", "paper_id": "WOS:000233938200001"}