{"auto_keywords": [{"score": 0.03068541041116714, "phrase": "mrc"}, {"score": 0.00481495049065317, "phrase": "physical_positions"}, {"score": 0.004661446705304497, "phrase": "fundamental_and_crucial_problem"}, {"score": 0.004611369021812453, "phrase": "wireless_sensor_networks"}, {"score": 0.00441635700580562, "phrase": "inherent_characteristics"}, {"score": 0.004252469672259375, "phrase": "low-_cost"}, {"score": 0.004206767038617782, "phrase": "tiny_sensor_node"}, {"score": 0.003985487777785535, "phrase": "low_overall_system_cost"}, {"score": 0.0038168424095396205, "phrase": "mere_connectivity"}, {"score": 0.0037352048741373816, "phrase": "proximity_information"}, {"score": 0.003407214479510987, "phrase": "heuristic_information"}, {"score": 0.003352388337911934, "phrase": "neighboring_nodes"}, {"score": 0.003158776195052182, "phrase": "distributed_mobile-_beacon-_assisted_localization_scheme"}, {"score": 0.003107935254560724, "phrase": "rss_and_connectivity_observations"}, {"score": 0.0030086877092638945, "phrase": "specific_trajectory"}, {"score": 0.0029763124376934813, "phrase": "static_wsns"}, {"score": 0.0026423134393535265, "phrase": "irregular_radio_scenario"}, {"score": 0.002599763359352916, "phrase": "noisy_environment"}, {"score": 0.0021049977753042253, "phrase": "physical_environments"}], "paper_keywords": [""], "paper_abstract": "Determining the physical positions of sensors has been a fundamental and crucial problem in wireless sensor networks (WSNs). Due to the inherent characteristics of WSNs, extremely limited resources available at each low- cost and tiny sensor node, connectivity- based range- free solutions could be a better choice to feature a low overall system cost. However, localization by means of mere connectivity may underutilize the proximity information available from neighborhood sensing. Although received signal strength (RSS) values are irregular and highly dynamic, it might provide heuristic information about which neighboring nodes are closer and which are further. We propose a distributed Mobile- beacon- assisted localization scheme based on RSS and Connectivity observations (MRC) with a specific trajectory in static WSNs. To ensure that MRC performs as true to reality as possible, we propose two improved approaches based on MRC to consider irregular radio scenario in the noisy environment. Comparing the performance with three typical range- free localization methods in static WSNs, our lightweight MRC algorithm with limited computation and storage overhead is more suitable for very low- computing power sensor nodes that can efficiently outperform better with only basic arithmetic operations in the simulation and physical environments.", "paper_title": "A Mobile-Beacon-Assisted Sensor Network Localization Based on RSS and Connectivity Observations", "paper_id": "WOS:000298492300001"}