{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_neutrality"}, {"score": 0.031676601262660434, "phrase": "public_option_isp"}, {"score": 0.008892518442643098, "phrase": "network-neutral_regulations"}, {"score": 0.004448471107649881, "phrase": "recent_times"}, {"score": 0.003911253966141701, "phrase": "internet_ecosystem"}, {"score": 0.003455765987713262, "phrase": "consumer_and_target_the_desired_system_state"}, {"score": 0.0032724821705972357, "phrase": "isp_market"}, {"score": 0.00320826350799124, "phrase": "different_conclusions"}, {"score": 0.002862648127577722, "phrase": "network-neutral_manner"}, {"score": 0.002737745536992088, "phrase": "monopolistic_scenario"}, {"score": 0.002442693254693416, "phrase": "monopolistic_isp"}, {"score": 0.00240662380079115, "phrase": "consumer_utility"}, {"score": 0.0023245146355917626, "phrase": "oligopolistic_scenario"}, {"score": 0.0021365562685368767, "phrase": "competing_nonneutral_isps"}], "paper_keywords": ["Terms-Internet economics", " Network neutrality", " paid prioritization", " Public Option", " regulatory policy"], "paper_abstract": "Network neutrality and the role of regulation on the Internet have been heavily debated in recent times. Among the various definitions of network neutrality, we focus on the one that prohibits paid prioritization of content. We develop a model of the Internet ecosystem in terms of three primary players: consumers, ISPs, and content providers. We analyze this issue from the point of view of the consumer and target the desired system state that maximizes consumer utility. By analyzing various structures of an ISP market, we obtain different conclusions on the desirability of regulation. We also introduce the notion of a Public Option ISP, an ISP that carries traffic in a network-neutral manner. We find: 1) in a monopolistic scenario, network-neutral regulations might benefit consumers, however the introduction of a Public Option ISP is even better as it aligns the interests of the monopolistic ISP with the consumer utility; and 2) in an oligopolistic scenario, the presence of a Public Option ISP is again preferable to network-neutral regulations, although the presence of competing nonneutral ISPs provides the most desirable situation for the consumers.", "paper_title": "The Public Option: A Nonregulatory Alternative to Network Neutrality", "paper_id": "WOS:000329995700015"}