{"auto_keywords": [{"score": 0.0455466088830923, "phrase": "access_requests"}, {"score": 0.015719716506582538, "phrase": "risk_assessment"}, {"score": 0.014885988331749166, "phrase": "risk-based_access_control_systems"}, {"score": 0.0047797212183363835, "phrase": "access_control_systems"}, {"score": 0.004408729661992651, "phrase": "security_risk"}, {"score": 0.004281053243493438, "phrase": "operational_needs"}, {"score": 0.004234129588974058, "phrase": "situational_conditions"}, {"score": 0.004066416005586085, "phrase": "impact_scores"}, {"score": 0.0039053194919285725, "phrase": "threat_assessment"}, {"score": 0.003549371903680862, "phrase": "object_sensitivity"}, {"score": 0.0035233696341819437, "phrase": "subject_trustworthiness"}, {"score": 0.003109280367693954, "phrase": "approaches_results"}, {"score": 0.003086492169113408, "phrase": "different_threat_orderings"}, {"score": 0.00280496585980086, "phrase": "subject-object_accesses"}, {"score": 0.0024933837962398267, "phrase": "data_objects"}, {"score": 0.0024299678474208023, "phrase": "nist_special_publication"}, {"score": 0.0023594603878391417, "phrase": "risk_estimates"}, {"score": 0.0022909940601580675, "phrase": "threat_assessment_approach"}, {"score": 0.002200077887697072, "phrase": "prudent_judgement"}, {"score": 0.0021679176844660074, "phrase": "threat_assessment_function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Security", " Access control", " Risk", " Threat", " Impact"], "paper_abstract": "We describe a framework for risk assessment specifically within the context of risk-based access control systems, which make authorization decisions by determining the security risk associated with access requests and weighing such security risk against operational needs together with situational conditions. Our framework estimates risk as a product of threat and impact scores. The framework that we describe includes four different approaches for conducting threat assessment: an object sensitivity-based approach, a subject trustworthiness-based approach and two additional approaches which are based on the difference between object sensitivity and subject trustworthiness. We motivate each of the four approaches with a series of examples. We also identify and formally describe the properties that are to be satisfied within each approach. Each of these approaches results in different threat orderings, and can be chosen based on the context of applications or preference of organizations. We also propose formulae to estimate the threat of subject-object accesses within each of the four approaches of our framework. We then demonstrate the application of our threat assessment framework for estimating the risk of access requests, which are initiated by subjects to perform certain actions on data objects, by using the methodology of NIST Special Publication 800-30. We show that risk estimates for access requests actually differ based on the threat assessment approach that has been chosen. Therefore, organizations must make prudent judgement while selecting a threat assessment function for risk-based access control systems. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A framework for risk assessment in access control systems", "paper_id": "WOS:000329078900007"}