{"auto_keywords": [{"score": 0.043626296647104816, "phrase": "online_advertisements"}, {"score": 0.015447115500519876, "phrase": "online_advertising"}, {"score": 0.015179168860189673, "phrase": "digital_artifacts"}, {"score": 0.010986741948094422, "phrase": "design_features"}, {"score": 0.00481495049065317, "phrase": "consumer_behavioral_responses"}, {"score": 0.0047906825490581775, "phrase": "artifact_design_features"}, {"score": 0.004589259240616032, "phrase": "daily_basis"}, {"score": 0.004474736241380646, "phrase": "consumer_online_behaviors"}, {"score": 0.004211356954064138, "phrase": "behavioral_responses"}, {"score": 0.004147960711771847, "phrase": "active_and_passive_behaviors"}, {"score": 0.004075198669927074, "phrase": "behavioral_efforts_consumers"}, {"score": 0.004003707862291159, "phrase": "active_behavioral_responses"}, {"score": 0.003913623633094124, "phrase": "online_ads"}, {"score": 0.00383524523802985, "phrase": "passive_behavioral_responses"}, {"score": 0.003748937184382714, "phrase": "current_status"}, {"score": 0.0036645642553325215, "phrase": "passive_way"}, {"score": 0.003618510678684875, "phrase": "consumers'_behavioral_responses"}, {"score": 0.0033118876181614395, "phrase": "three-facet_framework"}, {"score": 0.0032128364206445406, "phrase": "ad_content"}, {"score": 0.0031088607288523927, "phrase": "ad_form"}, {"score": 0.00306976931257846, "phrase": "presentation_styles"}, {"score": 0.002955411006017351, "phrase": "ad_action"}, {"score": 0.00285974236492375, "phrase": "onset_timing"}, {"score": 0.0027531865976006668, "phrase": "exploratory_study"}, {"score": 0.002718555300512433, "phrase": "empirical_evidence"}, {"score": 0.0026040262154057607, "phrase": "consumer_behaviors"}, {"score": 0.0024442865590979398, "phrase": "design_feature_categorization"}, {"score": 0.0023771343615901185, "phrase": "ad_design_features"}, {"score": 0.002335362675623529, "phrase": "consumers'_judgments"}, {"score": 0.0022711961447468114, "phrase": "ad_design_features'_influence"}, {"score": 0.0021809902552410265, "phrase": "online_advertising_services"}, {"score": 0.0021049977753042253, "phrase": "practical_implications"}], "paper_keywords": ["Consumer online behavior", " Approach-avoidance behavior", " Active-passive behavior", " Online advertising", " Design features of online ads", " Stimulus-Organism-Response (S-O-R) framework"], "paper_abstract": "Many consumers encounter and interact with digital artifacts and services on a daily basis, either willingly or unwillingly. This paper conceptualizes consumer online behaviors into more refined categories in the context of online advertising. Behaviors can be differentiated by their directions and intensities. Approach and avoidance are two directions of behavioral responses when consumers encounter online advertisements. Active and passive behaviors reflect the levels of intensity of behavioral efforts consumers put when dealing with online advertisements. Active behavioral responses mean that consumers make effort to act upon online ads, either approaching or avoiding them. Passive behavioral responses indicate that consumers make little effort to change the current status, and would approach or avoid in a passive way. We posit that consumers' behavioral responses can be generally categorized into four major types across these two dimensions: active approach, passive approach, active avoidance, and passive avoidance. In addition, we categorize the design features of online advertisements with a three-facet framework: ad content, ad form, and ad action. Ad content is concerned with the message or meaning that an ad carries; ad form is about materializing content based on presentation styles such as media, location, color, audio, etc.; and ad action is concerned with the behaviors of an ad such as movement, onset timing, frequency, etc. Due to the novelty of the categorizations, an exploratory study was conducted to provide empirical evidence on the categorizations of the four behavior types and three design feature types. Our findings indicate that all four types of consumer behaviors were present, and all behaviors identified by our study can be classified into one of the four types. The same is true for the design feature categorization. We illustrate that the categorization of the three types of ad design features can also guide the understanding of consumers' judgments of ads, which may function as a bridge of ad design features' influence on consumer behaviors. This study contributes to a stronger, more refined understanding of how consumers react to online advertising services, and how such responses relate to various types of design features. It also has practical implications for the design, delivery, and management of digital artifacts and services in general.", "paper_title": "Categorizing consumer behavioral responses and artifact design features: The case of online advertising", "paper_id": "WOS:000354378300004"}