{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rate-modifying_activity"}, {"score": 0.01040563494760613, "phrase": "due_date"}, {"score": 0.008715504731391993, "phrase": "common_due_date"}, {"score": 0.004361276005140776, "phrase": "single-machine_batch_delivery_scheduling"}, {"score": 0.0038727120021750973, "phrase": "job_delivery"}, {"score": 0.003371220210416809, "phrase": "job-dependent_factor"}, {"score": 0.003176626803985225, "phrase": "capacity_limit"}, {"score": 0.0031297538950335233, "phrase": "delivery_batch"}, {"score": 0.0023476849595393872, "phrase": "delivery_cost"}, {"score": 0.0022563636435096457, "phrase": "optimal_schedule"}, {"score": 0.0022010965931147735, "phrase": "present_polynomial_algorithms"}, {"score": 0.002168586864007222, "phrase": "special_cases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Due date assignment", " Batch delivery", " Rate-modifying activity"], "paper_abstract": "We consider a single-machine batch delivery scheduling and common due date assignment problem. In addition to making decisions on sequencing the jobs, determining the common due date, and scheduling job delivery, we consider the option of performing a rate-modifying activity on the machine. The processing time of a job scheduled after the rate-modifying activity decreases depending on a job-dependent factor. Finished jobs are delivered in batches. There is no capacity limit on each delivery batch, and the cost per batch delivery is fixed and independent of the number of jobs in the batch. The objective is to find a common due date for all the jobs, a location of the rate-modifying activity, and a delivery date for each job to minimize the sum of earliness, tardiness, holding, due date, and delivery cost. We provide some properties of the optimal schedule for the problem and present polynomial algorithms for some special cases. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Common due date assignment and scheduling with a rate-modifying activity to minimize the due date, earliness, tardiness, holding, and batch delivery cost", "paper_id": "WOS:000304687100020"}