{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "e-mail_headers"}, {"score": 0.00462291551375938, "phrase": "low_cost"}, {"score": 0.004585433265422727, "phrase": "e-mail_services"}, {"score": 0.004529776351030488, "phrase": "unsolicited_messages"}, {"score": 0.0044025116437190785, "phrase": "users'_accounts"}, {"score": 0.00434906528856802, "phrase": "valuable_resources"}, {"score": 0.0038803710796509227, "phrase": "entire_message"}, {"score": 0.003725470458263889, "phrase": "users'_privacy"}, {"score": 0.0036207206487324506, "phrase": "novel_spam-filtering_technique"}, {"score": 0.0032833625797814474, "phrase": "dynamic_process"}, {"score": 0.0032040376301815544, "phrase": "observed_characters"}, {"score": 0.003076052206618737, "phrase": "standard_signal_pre-processing_techniques"}, {"score": 0.0029291801502381513, "phrase": "hidden_markov_models"}, {"score": 0.0028351712509358997, "phrase": "spam_detection_system"}, {"score": 0.0026452734009203764, "phrase": "spam_filtering"}, {"score": 0.002613103872300205, "phrase": "experimental_results"}, {"score": 0.0025918745925152423, "phrase": "spamassassin"}, {"score": 0.0024182330686905256, "phrase": "spam_detection"}, {"score": 0.002379092507901856, "phrase": "false_positive_rate"}, {"score": 0.002321563536990284, "phrase": "added_advantages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Spam detection", " Hidden Markov Model", " Mail header", " Histogram"], "paper_abstract": "'Spammers exploit the popularity and low cost of e-mail services to send unsolicited messages (spam), which fill users' accounts and waste valuable resources. To combat this problem, many different spam filtering techniques have been proposed in the literature. Nevertheless, most current anti-spamming filtering schemes are based on detecting relevant terms or tokens in the entire message or in only the body, which implies an invasion of users' privacy. In this paper, a novel spam-filtering technique based solely on the information present in headers is introduced. In this approach, headers are considered as the result of a dynamic process that generates characters. The observed characters are treated as signals and parameterised in accordance with standard signal pre-processing techniques by extracting relevant parameters from the header. From this, Hidden Markov Models (HMMs) are considered for a spam detection system. The performance achieved by our proposal is evaluated and compared with that of other pattern classification paradigms used for spam filtering. The experimental results for SpamAssassin, TREC05 and CEAS 2008 Lab Evaluation improve on those results obtained with other widely used techniques, achieving up to 98.42% of spam detection while keeping the false positive rate below 0.4% and with the added advantages of using only information from the headers and being independent of the language in which the e-mail is written. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Segmental parameterisation and statistical modelling of e-mail headers for spam detection", "paper_id": "WOS:000303092800003"}