{"auto_keywords": [{"score": 0.049477536567807595, "phrase": "chinese_treebank"}, {"score": 0.010176778225247441, "phrase": "semantic_role_labels"}, {"score": 0.00481495049065317, "phrase": "semantic_roles"}, {"score": 0.004425616928975799, "phrase": "phrase_structures"}, {"score": 0.003932654396285872, "phrase": "parse_tree"}, {"score": 0.003802135020791801, "phrase": "different_issues"}, {"score": 0.0033641551050434663, "phrase": "well-defined_syntactic_positions"}, {"score": 0.003266201217790818, "phrase": "syntactic_variations"}, {"score": 0.003091767402370757, "phrase": "dislocated_and_discontinuous_arguments"}, {"score": 0.0029764767329116875, "phrase": "nominalized_predicates"}, {"score": 0.002689564715486338, "phrase": "support_verbs"}, {"score": 0.0025458479274370832, "phrase": "predicate-argument_structure"}, {"score": 0.0023996317685956213, "phrase": "syntactic_structure"}, {"score": 0.0023296961971785357, "phrase": "predicate-argument_structure_annotation"}, {"score": 0.0022145052062614514, "phrase": "lexical_database"}, {"score": 0.002195866991284673, "phrase": "frame_files"}, {"score": 0.00214995338990007, "phrase": "predicate-argument_annotation"}, {"score": 0.0021049977753042253, "phrase": "annotation_consistency_and_inter-annotator_agreement_evaluation_results"}], "paper_keywords": [""], "paper_abstract": "We report work on adding semantic role labels to the Chinese Treebank, a corpus already annotated with phrase structures. The work involves locating all verbs and their nominalizations in the corpus, and semi-automatically adding semantic role labels to their arguments, which are constituents in a parse tree. Although the same procedure is followed, different issues arise in the annotation of verbs and nominalized predicates. For verbs, identifying their arguments is generally straightforward given their syntactic structure in the Chinese Treebank as they tend to occupy well-defined syntactic positions. Our discussion focuses on the syntactic variations in the realization of the arguments as well as our approach to annotating dislocated and discontinuous arguments. In comparison, identifying the arguments for nominalized predicates is more challenging and we discuss criteria and procedures for distinguishing arguments from non-arguments. In particular we focus on the role of support verbs as well as the relevance of event/result distinctions in the annotation of the predicate-argument structure of nominalized predicates. We also present our approach to taking advantage of the syntactic structure in the Chinese Treebank to bootstrap the predicate-argument structure annotation of verbs. Finally, we discuss the creation of a lexical database of frame files and its role in guiding predicate-argument annotation. Procedures for ensuring annotation consistency and inter-annotator agreement evaluation results are also presented.", "paper_title": "Adding semantic roles to the Chinese Treebank", "paper_id": "WOS:000278274100008"}