{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "algebraic_attacks"}, {"score": 0.048231156244864744, "phrase": "linearly_independent_equations"}, {"score": 0.012050444543115303, "phrase": "aes"}, {"score": 0.01052054773352599, "phrase": "block_ciphers"}, {"score": 0.009034970044504398, "phrase": "initial_set"}, {"score": 0.008209616151520884, "phrase": "exact_number"}, {"score": 0.004588891098290524, "phrase": "so-called_algebraic_attacks"}, {"score": 0.004470071518923524, "phrase": "basic_idea"}, {"score": 0.004186253035932442, "phrase": "large_set"}, {"score": 0.00398959232769596, "phrase": "existing_equations"}, {"score": 0.0033489371483830153, "phrase": "block_cipher"}, {"score": 0.00330530033114088, "phrase": "sp"}, {"score": 0.002823207272381655, "phrase": "direct_formula"}, {"score": 0.0026786469998321062, "phrase": "interesting_bounds"}, {"score": 0.002359046870732839, "phrase": "exact_numbers"}, {"score": 0.0021049977753042253, "phrase": "novel_way"}], "paper_keywords": ["Cryptology", " Block ciphers", " Algebraic attacks", " XL", " AES"], "paper_abstract": "This paper is about counting linearly independent equations for so-called algebraic attacks on block ciphers. The basic idea behind many of these approaches, e.g., XL, is to generate a large set of equations from an initial set of equations by multiplication of existing equations by the variables in the system. One of the most difficult tasks is to determine the exact number of linearly independent equations one obtain in the attacks. In this paper, it is shown that by splitting the equations defined over a block cipher (an SP-network) into two sets, one can determine the exact number of linearly independent equations which can be generated in algebraic attacks within each of these sets of a certain degree. While this does not give us a direct formula for the success of algebraic attacks on block ciphers, it gives some interesting bounds on the number of equations one can obtain from a given block cipher. Our results are applied to the AES and to a variant of the AES, and the exact numbers of linearly independent equations in the two sets that one can generate by multiplication of an initial set of equations are given. Our results also indicate, in a novel way, that the AES is not vulnerable to the algebraic attacks as defined here.", "paper_title": "Counting equations in algebraic attacks on block ciphers", "paper_id": "WOS:000275791200003"}