{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "auditory_prominence"}, {"score": 0.02907873267247575, "phrase": "pitch_accents"}, {"score": 0.004701015188740582, "phrase": "acoustic_segment"}, {"score": 0.004481132747216135, "phrase": "prosodic_functions"}, {"score": 0.004305740330804528, "phrase": "facial_movements"}, {"score": 0.004120694410890683, "phrase": "facial_prominence_cues"}, {"score": 0.003959353513286997, "phrase": "animated_talking_heads"}, {"score": 0.0038965930422333035, "phrase": "first_study"}, {"score": 0.003850173884725567, "phrase": "speech_intelligibility_experiment"}, {"score": 0.003789137457228946, "phrase": "speech_quality"}, {"score": 0.0036993855514735746, "phrase": "fundamental_frequency"}, {"score": 0.0031402604946939713, "phrase": "facial_gestures"}, {"score": 0.0031028232755683674, "phrase": "speech_intelligibility"}, {"score": 0.002910545717767559, "phrase": "follow-up_study"}, {"score": 0.0028076592725295646, "phrase": "talking_heads"}, {"score": 0.002708399936381754, "phrase": "eye-gaze_tracking_technology"}, {"score": 0.0026022112631368223, "phrase": "gaze_data"}, {"score": 0.0025001755089445092, "phrase": "similar_fashion"}, {"score": 0.0024311346712789553, "phrase": "natural_face"}, {"score": 0.0021049977753042253, "phrase": "talking_head"}], "paper_keywords": ["Prominence", " Visual prosody", " Gesture", " ECA", " Eye gaze", " Head nod, eyebrows"], "paper_abstract": "Auditory prominence is defined as when an acoustic segment is made salient in its context. Prominence is one of the prosodic functions that has been shown to be strongly correlated with facial movements. In this work, we investigate the effects of facial prominence cues, in terms of gestures, when synthesized on animated talking heads. In the first study, a speech intelligibility experiment is conducted, speech quality is acoustically degraded and the fundamental frequency is removed from the signal, then the speech is presented to 12 subjects through a lip synchronized talking head carrying head-nods and eyebrows raise gestures, which are synchronized with the auditory prominence. The experiment shows that presenting prominence as facial gestures significantly increases speech intelligibility compared to when these gestures are randomly added to speech. We also present a follow-up study examining the perception of the behavior of the talking heads when gestures are added over pitch accents. Using eye-gaze tracking technology and questionnaires on 10 moderately hearing impaired subjects, the results of the gaze data show that users look at the face in a similar fashion to when they look at a natural face when gestures are coupled with pitch accents opposed to when the face carries no gestures. From the questionnaires, the results also show that these gestures significantly increase the naturalness and the understanding of the talking head.", "paper_title": "Auditory visual prominence From intelligibility to behavior", "paper_id": "WOS:000208480400005"}