{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_ecosystems"}, {"score": 0.003944112858235306, "phrase": "important_role"}, {"score": 0.0029483516334882862, "phrase": "semantic_service_retrieval_engine"}, {"score": 0.002881793492919646, "phrase": "novel_semantic_qos_evaluation_methodology"}, {"score": 0.0025127604406208668, "phrase": "subsequent_quantification"}, {"score": 0.002414290278501595, "phrase": "subjective_and_objective_qos_measures"}, {"score": 0.002254357921422124, "phrase": "domain-specific_ranking"}, {"score": 0.0021784009230363627, "phrase": "ail_online_prototype"}], "paper_keywords": ["CCCI metrics", " digital ecosystems", " quality of services", " QoS", " service computing", " service retrieval"], "paper_abstract": "The emergence of the World Wide Web and its influence on the fields of industry, commerce, healthcare and so on, has led to an innovative, dynamic, open, collaborative and interactive environment - the digital ecosystem. Whereas service plays an important role in digital ecosystems, there is no technology available to retrieve heterogeneous and geographically dispersed services. Additionally, no methodology has been proposed in the literature that can distinguish or rank the services based on the Quality of Services (QoS). In order to address these issues, we propose a semantic service retrieval engine which incorporates a novel semantic QoS evaluation methodology. The salient feature of this methodology that sets it apart from any other QoS evaluation methodologies is that the evaluation of the service and the subsequent quantification of QoS is a combination of subjective and objective QoS measures. Another salient feature of our proposed methodology is that it enables the domain-specific ranking of services. Finally, ail online prototype is implemented to evaluate our methodology, the results of which are discussed in this paper.", "paper_title": "A QoS-based service retrieval methodology for digital ecosystems", "paper_id": "WOS:000271838200002"}