{"auto_keywords": [{"score": 0.049648703742940926, "phrase": "discriminant_analysis"}, {"score": 0.04379677900638105, "phrase": "scrda"}, {"score": 0.04032594572525053, "phrase": "variable_selection"}, {"score": 0.015719716506582538, "phrase": "shrunken_centroids"}, {"score": 0.011440744565537784, "phrase": "linear_discriminant_analysis"}, {"score": 0.008520019664688456, "phrase": "promising_strategy"}, {"score": 0.006591602192105102, "phrase": "within-class_covariance_matrix"}, {"score": 0.0063868989297386535, "phrase": "singularity_issue"}, {"score": 0.006216474557744202, "phrase": "shrinkage_estimator"}, {"score": 0.005006218482790014, "phrase": "desirable_abilities"}, {"score": 0.004665162327051461, "phrase": "metabolomics_data_exploration"}, {"score": 0.004623224002010226, "phrase": "metabolomics_datasets"}, {"score": 0.004561019117546361, "phrase": "modern_analytical_instruments"}, {"score": 0.004320421465896323, "phrase": "recent_method"}, {"score": 0.0038764861784138117, "phrase": "supervised_method"}, {"score": 0.003772793879444995, "phrase": "biomarker_screening"}, {"score": 0.003220709449062307, "phrase": "simulated_datasets"}, {"score": 0.0031203609829058587, "phrase": "orthogonal_partial_least_squares"}, {"score": 0.002942196368747418, "phrase": "nearest_shrunken_centroids"}, {"score": 0.0024774888010414206, "phrase": "biochemical_research"}, {"score": 0.0022427071130840647, "phrase": "john_wiley"}, {"score": 0.0021049977753042253, "phrase": "metabolomics_dataset"}], "paper_keywords": ["discriminant analysis", " variable selection", " biomarker screening", " metabolomics", " shrunken centroids regularized discriminant analysis"], "paper_abstract": "Metabolomics datasets generated by modern analytical instruments tend to be increasingly complex. In this study, a recent method named shrunken centroids regularized discriminant analysis (SCRDA) has been introduced and applied in the exploration of metabolomics dataset. It is a supervised method for variable selection, discriminant analysis and biomarker screening. By regularizing the estimate of the within-class covariance matrix, SCRDA can deal with the singularity issue of linear discriminant analysis. Then a shrinkage estimator is applied to perform variable selection. The method presented is illustrated through the simulated datasets and three complex metabolomics datasets. Commonly used orthogonal partial least squares discriminant analysis and two other similar statistical methods, penalized linear discriminant analysis and nearest shrunken centroids, are used for comparisons. The results illustrate that SCRDA has some desirable abilities in variable selection, classification and prediction. Moreover, the biomarkers identified by SCRDA are further demonstrated to be in accordance with the biochemical research. It has been proved that SCRDA can be applied as a promising strategy in metabolomics. Copyright (c) 2014 John Wiley & Sons, Ltd. We applied shrunken centroids regularized discriminant analysis in the exploration of metabolomics dataset. By regularizing the estimate of the within-class covariance matrix, it can deal with the singularity issue in linear discriminant analysis and the shrinkage estimator can be applied to perform variable selection. Shrunken centroids regularized discriminant analysis has some desirable abilities in variable selection, classification, and prediction because it estimates the correlations between variables.", "paper_title": "Shrunken centroids regularized discriminant analysis as a promising strategy for metabolomics data exploration", "paper_id": "WOS:000351534900003"}