{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "untranquil_world"}, {"score": 0.004552648949390462, "phrase": "genome_rearrangement_breakpoints"}, {"score": 0.004468415400599571, "phrase": "dynamic_molecules"}, {"score": 0.004224911726496726, "phrase": "large_scale_changes"}, {"score": 0.004166129325245761, "phrase": "genome_organisation"}, {"score": 0.004069963083642548, "phrase": "evolutionary_and_speciation_process"}, {"score": 0.003920674807745575, "phrase": "inherited_diseases"}, {"score": 0.0036553070575015344, "phrase": "computational_biologists"}, {"score": 0.00329813918116714, "phrase": "underlying_molecular_mechanisms"}, {"score": 0.0031036643805367487, "phrase": "sequence_level"}, {"score": 0.002735522834514124, "phrase": "different_methods"}, {"score": 0.002456486927713543, "phrase": "main_purpose"}], "paper_keywords": ["genome dynamics", " rearrangement", " breakpoint region", " whole genome alignment", " conserved segment", " synteny block"], "paper_abstract": "Genomes are dynamic molecules that are constantly undergoing mutations and rearrangements. The latter are large scale changes in a genome organisation that participate in the evolutionary and speciation process, but may also be involved in inherited diseases and in cancer. They have since long been studied by the biologists whereas computational biologists have more recently only been attracted to the topic. One of the (exciting) objectives for studying rearrangements is to understand the underlying molecular mechanisms of evolution. One possible line of investigation is to analyse, at the sequence level, the regions which have undergone a rearrangement, assuming we are able to very precisely locate them. This paper presents a survey of the different methods that have been developed to identify such regions, in particular the approaches that are based on the alignment of genomes. The main purpose of the paper is then to investigate what is currently known about the characteristics of the regions where a rearrangement took place, and about the mechanism(s) which have led to such large scale changes. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A small trip in the untranquil world of genomes - A survey on the detection and analysis of genome rearrangement breakpoints", "paper_id": "WOS:000257466600004"}