{"auto_keywords": [{"score": 0.02738267227411293, "phrase": "np"}, {"score": 0.015427091984490375, "phrase": "p-center_location_problems"}, {"score": 0.01514440297141928, "phrase": "k_most_vital_edges"}, {"score": 0.004552360432689039, "phrase": "min_edge"}, {"score": 0.004320156581220516, "phrase": "weighted_connected_graph"}, {"score": 0.0038471128411102914, "phrase": "k_edges"}, {"score": 0.003691969158027291, "phrase": "optimal_solution"}, {"score": 0.003516635512391528, "phrase": "largest_total_weighted_distance"}, {"score": 0.0034001358540125303, "phrase": "complementary_problem"}, {"score": 0.0030502854924662837, "phrase": "minimum_cardinality"}, {"score": 0.0028944757265206332, "phrase": "total_weighted_distance"}, {"score": 0.0027466028572379455, "phrase": "specified_threshold"}, {"score": 0.0023466842270226888, "phrase": "k_most_vital_nodes"}, {"score": 0.0021288018260672806, "phrase": "complementary_versions"}], "paper_keywords": ["Most vital edges and nodes", " Min edge and node blocker", " p-median", " p-center", " Complexity", " Approximation"], "paper_abstract": "We consider the k most vital edges (nodes) and min edge (node) blocker versions of the p-median and p-center location problems. Given a weighted connected graph with distances on edges and weights on nodes, the k most vital edges (nodes) p-median (respectively p-center) problem consists of finding a subset of k edges (nodes) whose removal from the graph leads to an optimal solution for the p-median (respectively p-center) problem with the largest total weighted distance (respectively maximum weighted distance). The complementary problem, min edge (node) blocker p-median (respectively p-center), consists of removing a subset of edges (nodes) of minimum cardinality such that an optimal solution for the p-median (respectively p-center) problem has a total weighted distance (respectively a maximum weighted distance) at least as large as a specified threshold. We show that k most vital edges p-median and k most vital edges p-center are NP-hard to approximate within a factor and respectively, for any I mu > 0, while k most vital nodes p-median and k most vital nodes p-center are NP-hard to approximate within a factor , for any I mu > 0. We also show that the complementary versions of these four problems are NP-hard to approximate within a factor 1.36.", "paper_title": "Complexity of determining the most vital elements for the p-median and p-center location problems", "paper_id": "WOS:000315564700003"}