{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_publishing"}, {"score": 0.004693300099911199, "phrase": "information_society"}, {"score": 0.004642105253191792, "phrase": "automatic_collection"}, {"score": 0.004608284537368354, "phrase": "huge_amounts"}, {"score": 0.004394350285140955, "phrase": "secondary_analysis"}, {"score": 0.004175006647851034, "phrase": "policy_makers"}, {"score": 0.00411436400374349, "phrase": "marketing_analysts"}, {"score": 0.0036198068824262464, "phrase": "training_data_mining_models"}, {"score": 0.0031845067058084613, "phrase": "data_sets"}, {"score": 0.0028220038404484196, "phrase": "first_generalization-based_approach"}, {"score": 0.0027809588979112393, "phrase": "privacy_preservation"}, {"score": 0.00276066021951467, "phrase": "discrimination_prevention"}, {"score": 0.0026613618933208467, "phrase": "optimal_algorithm"}, {"score": 0.0025468951021098717, "phrase": "general_and_specific_data_analysis_metrics"}, {"score": 0.002120485727210402, "phrase": "different_privacy_models"}, {"score": 0.0021049977753042253, "phrase": "anti-discrimination_legal_concepts"}], "paper_keywords": ["Data mining", " Anti-discrimination", " Privacy", " Generalization"], "paper_abstract": "Living in the information society facilitates the automatic collection of huge amounts of data on individuals, organizations, etc. Publishing such data for secondary analysis (e.g. learning models and finding patterns) may be extremely useful to policy makers, planners, marketing analysts, researchers and others. Yet, data publishing and mining do not come without dangers, namely privacy invasion and also potential discrimination of the individuals whose data are published. Discrimination may ensue from training data mining models (e.g. classifiers) on data which are biased against certain protected groups (ethnicity, gender, political preferences, etc.). The objective of this paper is to describe how to obtain data sets for publication that are: (i) privacy-preserving; (ii) unbiased regarding discrimination; and (iii) as useful as possible for learning models and finding patterns. We present the first generalization-based approach to simultaneously offer privacy preservation and discrimination prevention. We formally define the problem, give an optimal algorithm to tackle it and evaluate the algorithm in terms of both general and specific data analysis metrics (i.e. various types of classifiers and rule induction algorithms). It turns out that the impact of our transformation on the quality of data is the same or only slightly higher than the impact of achieving just privacy preservation. In addition, we show how to extend our approach to different privacy models and anti-discrimination legal concepts.", "paper_title": "Generalization-based privacy preservation and discrimination prevention in data publishing and mining", "paper_id": "WOS:000341085700003"}