{"auto_keywords": [{"score": 0.04748452463686644, "phrase": "symbolic_execution"}, {"score": 0.013699860740097441, "phrase": "dise"}, {"score": 0.010612387000973441, "phrase": "directed_incremental_symbolic_execution"}, {"score": 0.009622407632814375, "phrase": "program_execution_paths"}, {"score": 0.00636087762577153, "phrase": "program_changes"}, {"score": 0.004496174406337201, "phrase": "program_analysis_technique"}, {"score": 0.004144810537437608, "phrase": "recent_algorithmic_and_technological_advances"}, {"score": 0.0036762529165489644, "phrase": "regression_analysis"}, {"score": 0.0034179225740833055, "phrase": "efficient_and_precise_ways"}, {"score": 0.003374250301861101, "phrase": "program_differences"}, {"score": 0.0027347937102326285, "phrase": "static_analysis_techniques"}, {"score": 0.0026998264237910884, "phrase": "program_difference_information"}, {"score": 0.002575385171755899, "phrase": "path_conditions"}, {"score": 0.002477837342313456, "phrase": "complementary_technique"}, {"score": 0.0024356742694508662, "phrase": "bounding_techniques"}, {"score": 0.0023134312557290043, "phrase": "analysis_results"}, {"score": 0.0022257833099336858, "phrase": "-only_the_source_code"}], "paper_keywords": ["Verification", " Algorithms", " Program Differencing", " Symbolic Execution", " Software Evolution"], "paper_abstract": "The last few years have seen a resurgence of interest in the use of symbolic execution - a program analysis technique developed more than three decades ago to analyze program execution paths. Scaling symbolic execution and other path-sensitive analysis techniques to large systems remains challenging despite recent algorithmic and technological advances. An alternative to solving the problem of scalability is to reduce the scope of the analysis. One approach that is widely studied in the context of regression analysis is to analyze the differences between two related program versions. While such an approach is intuitive in theory, finding efficient and precise ways to identify program differences, and characterize their effects on how the program executes has proved challenging in practice. In this paper, we present Directed Incremental Symbolic Execution (DiSE), a novel technique for detecting and characterizing the effects of program changes. The novelty of DiSE is to combine the efficiencies of static analysis techniques to compute program difference information with the precision of symbolic execution to explore program execution paths and generate path conditions affected by the differences. DiSE is a complementary technique to other reduction or bounding techniques developed to improve symbolic execution. Furthermore, DiSE does not require analysis results to be carried forward as the software evolves-only the source code for two related program versions is required. A case-study of our implementation of DiSE illustrates its effectiveness at detecting and characterizing the effects of program changes.", "paper_title": "Directed Incremental Symbolic Execution", "paper_id": "WOS:000294609500044"}