{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_trade"}, {"score": 0.03861082571014255, "phrase": "economic_measures"}, {"score": 0.03809625607500789, "phrase": "subjective_appraisals"}, {"score": 0.004715702140552199, "phrase": "economic_and_relational_concerns"}, {"score": 0.004308630865024719, "phrase": "trading_mechanisms"}, {"score": 0.004132743580000062, "phrase": "current_experimental_study"}, {"score": 0.003571591012750155, "phrase": "controlled_exchange_episodes"}, {"score": 0.00342568771304873, "phrase": "subtle_relationships"}, {"score": 0.003378385493203297, "phrase": "mechanism_use"}, {"score": 0.0033317342432676385, "phrase": "substantive_outcomes"}, {"score": 0.0030226700832113942, "phrase": "significant_differences"}, {"score": 0.0028195727965553367, "phrase": "gain-or-loss_contingency"}, {"score": 0.0021049977753042253, "phrase": "substantive_measures"}], "paper_keywords": ["auctions", " electronic markets", " experimental studies", " negotiations"], "paper_abstract": "The assessments of business trade often involve economic and relational concerns. They may become more challenging when our understanding of the impacts of trading mechanisms is still limited. The current experimental study compares two generic trading mechanisms, namely, multibilateral multi-issue negotiations and multicriteria auctions. By examining economic measures and subjective appraisals in controlled exchange episodes, the study shows some subtle relationships between mechanism use, substantive outcomes, and subjective appraisals. While use of negotiations versus auctions did not reveal significant differences on economic measures, traders are strongly influenced by the gain-or-loss contingency. When they win a contract, their subjective appraisals are heavily influenced by their achieved substantive outcomes. When they do not win a contract, they feel auctions are better than negotiations. The results confirm the assessments of business trade that rely solely on substantive measures are not sufficient.", "paper_title": "Traders' Subjective Appraisals: Comparison of Negotiations and Auctions", "paper_id": "WOS:000359482900001"}