{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "host_models."}, {"score": 0.00423465514675998, "phrase": "main_goal"}, {"score": 0.003960101604693806, "phrase": "high_robustness"}, {"score": 0.0037869901077566526, "phrase": "high_robust_blind_watermarking_algorithm"}, {"score": 0.003561205990687285, "phrase": "vertices_clustering_scheme"}, {"score": 0.0035216195857272403, "phrase": "discrete_cosine_transform"}, {"score": 0.0034245614958572012, "phrase": "experimental_results"}, {"score": 0.003348838095597268, "phrase": "proposed_algorithm"}, {"score": 0.003311604528903634, "phrase": "high_performance"}, {"score": 0.0030967107893195246, "phrase": "excellent_imperceptibility"}, {"score": 0.00306227185008558, "phrase": "noticeable_degradation"}, {"score": 0.002618366076489732, "phrase": "dct_domain"}, {"score": 0.0021049977753042253, "phrase": "watermark_extraction_process"}], "paper_keywords": ["Watermarking", " 3D model", " Discrete cosine transform (DCT)"], "paper_abstract": "At present, even though there is a robust 3D models watermarking scheme, its robustness against cropping and simplifying attacks is still weak. The main goal of this paper is to configure a blind 3D models watermarking algorithm with high robustness against cropping and simplifying attacks. The high robust blind watermarking algorithm for 3D models is synthesized by combining the 3D model normalization scheme, vertices clustering scheme and discrete cosine transform (DCT). Experimental results show that the proposed algorithm is high performance and has the following advantages: (i) the watermarked 3D model possesses excellent imperceptibility without noticeable degradation; (ii) both the embedding capacity and the extracted watermark's validality are better than other relative schemes; (iii) the security is strong enough because the watermark is embedded in DCT domain; (iv) the robustness against affine transformations is 100%, and the robustness withstanding the cropping, simplifying, reordering, and smoothing attacks is also high; (v) the original 3D model and watermark are not needed during the watermark extraction process.", "paper_title": "A THREE DIMENSIONAL MODEL WATERMARKING ALGORITHM IN FREQUENCY DOMAIN BASED ON THE NORMALIZATION OF HOST MODELS", "paper_id": "WOS:000305161000026"}