{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "acceptance_tests"}, {"score": 0.01366771408811994, "phrase": "fit_tables"}, {"score": 0.004484596684703308, "phrase": "main_reasons"}, {"score": 0.004327981760540394, "phrase": "late_discovery"}, {"score": 0.00421410521089045, "phrase": "customers'_expectations"}, {"score": 0.004048860957751714, "phrase": "delivered_system"}, {"score": 0.0036715973701254823, "phrase": "inconsistent_requirements"}, {"score": 0.0036390887584943723, "phrase": "test_driven_development"}, {"score": 0.003434662174045939, "phrase": "initial_elicitation_phase"}, {"score": 0.003299880298525127, "phrase": "desired_behavior"}, {"score": 0.002641621667026613, "phrase": "executable_test_cases"}, {"score": 0.0025492038831408715, "phrase": "university_of_trento_and_politecnico"}, {"score": 0.0023113506171584157, "phrase": "requirement_understanding"}, {"score": 0.002250415129116109, "phrase": "additional_comprehension_effort"}, {"score": 0.0022304616068189575, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "significant_additional_effort"}], "paper_keywords": ["Empirical studies", " Acceptance testing", " Requirements", " Fit tables"], "paper_abstract": "One of the main reasons for the failure of many software projects is the late discovery of a mismatch between the customers' expectations and the pieces of functionality implemented in the delivered system. At the root of such a mismatch is often a set of poorly defined, incomplete, under-specified, and inconsistent requirements. Test driven development has recently been proposed as a way to clarify requirements during the initial elicitation phase, by means of acceptance tests that specify the desired behavior of the system. The goal of the work reported in this paper is to empirically characterize the contribution of acceptance tests to the clarification of the requirements coming from the customer. We focused on Fit tables, a way to express acceptance tests, which can be automatically translated into executable test cases. We ran two experiments with students from University of Trento and Politecnico of Torino, to assess the impact of Fit tables on the clarity of requirements. We considered whether Fit tables actually improve requirement understanding and whether this requires any additional comprehension effort. Experimental results show that Fit helps in the understanding of requirements without requiring a significant additional effort. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Using acceptance tests as a support for clarifying requirements: A series of experiments", "paper_id": "WOS:000261919900003"}