{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "situ_informants"}, {"score": 0.04353594735474428, "phrase": "emoto"}, {"score": 0.004769269898610148, "phrase": "emotional_mobile_messaging_system"}, {"score": 0.004620093797504386, "phrase": "mobile_emotional_messaging_system"}, {"score": 0.00443308765153716, "phrase": "emotion-signalling_gestures"}, {"score": 0.004349337717774093, "phrase": "message_background"}, {"score": 0.004226657532307611, "phrase": "emotional_content"}, {"score": 0.004186534737631288, "phrase": "design_intent"}, {"score": 0.003817715315140651, "phrase": "affective_loop_experiance"}, {"score": 0.0037217945534790903, "phrase": "user-centered_design_process"}, {"score": 0.003663067281537946, "phrase": "emoto_system"}, {"score": 0.003582397044768098, "phrase": "final_study"}, {"score": 0.003537097098008714, "phrase": "five_friends"}, {"score": 0.003459191419478298, "phrase": "study_method"}, {"score": 0.0033084729942065142, "phrase": "subjective_and_distributed_experiences"}, {"score": 0.0031845067058084583, "phrase": "everyday_practice"}, {"score": 0.0029409171055888804, "phrase": "close_friends"}, {"score": 0.0028944757265206332, "phrase": "user_behaviour"}, {"score": 0.0028761045789798103, "phrase": "design_conclusions"}, {"score": 0.0028127163745564777, "phrase": "sometimes_fragile_communication_rhythm"}, {"score": 0.0027771220289115675, "phrase": "-expressing_memories"}, {"score": 0.0026057765979649785, "phrase": "singular_state"}, {"score": 0.0025240999184904366, "phrase": "total_situation"}, {"score": 0.002166230024967046, "phrase": "closer_connection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["affective interaction", " evaluation method", " user study", " mobile application"], "paper_abstract": "We have designed and built a mobile emotional messaging system named eMoto. With it, users can compose messages through using emotion-signalling gestures as input, rendering a message background of colours, shapes and animations expressing the emotional content. The design intent behind eMoto was that it should be engaging physically, intellectually and socially, and allow users to express themselves emotionally in all those dimensions, involving them in an affective loop experiance. In here, we describe the user-centered design process that lead to the eMoto system, but focus mainly on the final study where we let five friends use eMoto for two weeks. The study method, which we name in situ informants, helped us enter and explore the subjective and distributed experiences of use, as well as how emotional communication unfolds in everyday practice when channelled through a system like eMoto. The in situ informants are on the one hand users of eMoto, but also spectators, that are close friends who observe and document user behaviour. Design conclusions include the need to support the sometimes fragile communication rhythm that friendships require-expressing memories of the past, sharing the present and planning for the future. We saw that emotions are not singular state that exist within one person alone, but permeates the total situation, changing and drifting as a process between the two friends communicating. We also gained insights into the under-estimated but still important physical, sensual aspects of emotional communication. Experiences of the in situ informants method pointed to the need to involve participants in the interpretation of the data obtained, as well as establishing a closer connection with the spectators. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "In situ informants exploring an emotional mobile messaging system in their everyday practice", "paper_id": "WOS:000244805300010"}