{"auto_keywords": [{"score": 0.04970549810409891, "phrase": "online_social_networks"}, {"score": 0.046291195944410904, "phrase": "lukas"}, {"score": 0.00481495049065317, "phrase": "source_camera_identification"}, {"score": 0.004630055463858585, "phrase": "extended_experimental_evaluation"}, {"score": 0.004021065055449586, "phrase": "characteristic_noise"}, {"score": 0.0039122637074546895, "phrase": "digital_picture"}, {"score": 0.003776674472150248, "phrase": "source_camera"}, {"score": 0.0033314049082500794, "phrase": "photo-editing_tools"}, {"score": 0.0031534367609709233, "phrase": "online_photo_sharing"}, {"score": 0.003092200512475624, "phrase": "\"human\"_explicit_modification"}, {"score": 0.0026431267487109543, "phrase": "considered_image-processing_functions"}, {"score": 0.002453221048083196, "phrase": "identification_process"}, {"score": 0.0022769287097263564, "phrase": "online_photo_sharing_services"}, {"score": 0.0021721582450016, "phrase": "uploaded_pictures"}], "paper_keywords": ["Online Social Networks", " Online Photo Sharing", " Image Forensics", " Digital Forensics", " Digital camera identification", " Digital camera model identification", " Digital investigations"], "paper_abstract": "In this paper is presented an extended experimental evaluation of one of the most effective source camera identification techniques proposed so far, by Lukas. et al. (IEEE Trans Inf Forensics Security 1(2): 205-214, 2006). This method uses the characteristic noise left by the sensor on a digital picture as a fingerprint in order to identify the source camera used to take the picture. The aim of the experiments is to assess the effectiveness of this technique when used with pictures that were previously modified using several common image-processing functions coming with photo-editing tools. Moreover, the technique is applied to photos passed through Online Social Networks or Online Photo Sharing websites, without any \"human\" explicit modification but only elaborated by such Web 2.0 tools. The results confirm that, in several cases, the method by Lukas. et al. (IEEE Trans Inf Forensics Security 1(2): 205-214, 2006) is resilient to the modifications introduced by the considered image-processing functions. However, in the experiments it has been possible to identify several cases where the quality of the identification process deteriorated because of the noise introduced by the image-processing. In addition, when dealing with Online Social Networks and Online Photo Sharing services, it has been noted that some of them process and modify the uploaded pictures. These modifications make ineffective, in many cases, the method by Lukas. et al. (IEEE Trans Inf Forensics Security 1(2): 205-214, 2006)", "paper_title": "Experimentations with source camera identification and Online Social Networks", "paper_id": "WOS:000209332000012"}