{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "line_drawings"}, {"score": 0.004601508848655033, "phrase": "sparse_line_drawings"}, {"score": 0.004077272409331917, "phrase": "six_styles"}, {"score": 0.0037423521744765075, "phrase": "object's_surface"}, {"score": 0.0036861605703168397, "phrase": "normal_estimates"}, {"score": 0.003540392285585644, "phrase": "ground_truth_data"}, {"score": 0.003282383509542342, "phrase": "design_decisions"}, {"score": 0.0032006150973842846, "phrase": "large_data_set"}, {"score": 0.0026554236621262515, "phrase": "shaded_image"}, {"score": 0.0026155094974689595, "phrase": "current_computer_graphics_line_drawing_techniques"}, {"score": 0.0024742098091226203, "phrase": "artist's_drawings"}, {"score": 0.0022937210378944457, "phrase": "particular_properties"}, {"score": 0.0021263705039915198, "phrase": "publicly_available_resource"}], "paper_keywords": ["non-photorealism", " line drawings", " shape perception"], "paper_abstract": "This paper investigates the ability of sparse line drawings to depict 3D shape. We perform a study in which people are shown an image of one of twelve 3D objects depicted with one of six styles and asked to orient a gauge to coincide with the surface normal at many positions on the object's surface. The normal estimates are compared with each other and with ground truth data provided by a registered 3D surface model to analyze accuracy and precision. The paper describes the design decisions made in collecting a large data set (275,000 gauge measurements) and provides analysis to answer questions about how well people interpret shapes from drawings. Our findings suggest that people interpret certain shapes almost as well from a line drawing as from a shaded image, that current computer graphics line drawing techniques can effectively depict shape and even match the effectiveness of artist's drawings, and that errors in depiction are often localized and can be traced to particular properties of the lines used. The data collected for this study will become a publicly available resource for further studies of this type.", "paper_title": "How Well Do Line Drawings Depict Shape?", "paper_id": "WOS:000269278000008"}