{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "angiogenesis_bioprocess"}, {"score": 0.004682917599491709, "phrase": "key_biological_processes"}, {"score": 0.004554488671294504, "phrase": "constituent_biological_entities"}, {"score": 0.004518442937844318, "phrase": "pharmaceutical_agents"}, {"score": 0.004447201233380302, "phrase": "drug_design"}, {"score": 0.003947358102140903, "phrase": "textual_expressions"}, {"score": 0.003313741359811683, "phrase": "current_techniques"}, {"score": 0.003248483521309273, "phrase": "specialized_lexicons"}, {"score": 0.003036040409062437, "phrase": "bioprocess_terms"}, {"score": 0.0028944757265206332, "phrase": "gold_standard_corpus"}, {"score": 0.002694375425481759, "phrase": "new_blood_vessels"}, {"score": 0.0026099289298770023, "phrase": "annotated_corpus"}, {"score": 0.002548331088496964, "phrase": "text_expressions"}, {"score": 0.0024488738006005133, "phrase": "proposed_methods"}, {"score": 0.002419798694301991, "phrase": "domain-specific_vocabularies"}, {"score": 0.0022977342663599042, "phrase": "evaluation_results"}, {"score": 0.0022434880661725493, "phrase": "supervised_machine-learning_model"}, {"score": 0.0021218313648947926, "phrase": "reasonable_performance"}], "paper_keywords": [""], "paper_abstract": "Motivation: Understanding key biological processes (bioprocesses) and their relationships with constituent biological entities and pharmaceutical agents is crucial for drug design and discovery. One way to harvest such information is searching the literature. However, bioprocesses are difficult to capture because they may occur in text in a variety of textual expressions. Moreover, a bioprocess is often composed of a series of bioevents, where a bioevent denotes changes to one or a group of cells involved in the bioprocess. Such bioevents are often used to refer to bioprocesses in text, which current techniques, relying solely on specialized lexicons, struggle to find. Results: This article presents a range of methods for finding bioprocess terms and events. To facilitate the study, we built a gold standard corpus in which terms and events related to angiogenesis, a key biological process of the growth of new blood vessels, were annotated. Statistics of the annotated corpus revealed that over 36% of the text expressions that referred to angiogenesis appeared as events. The proposed methods respectively employed domain-specific vocabularies, a manually annotated corpus and unstructured domain-specific documents. Evaluation results showed that, while a supervised machine-learning model yielded the best precision, recall and F1 scores, the other methods achieved reasonable performance and less cost to develop.", "paper_title": "Automatic extraction of angiogenesis bioprocess from text", "paper_id": "WOS:000295412200016"}