{"auto_keywords": [{"score": 0.046411984812010414, "phrase": "sld"}, {"score": 0.044748936069588366, "phrase": "variable_quality"}, {"score": 0.033133740891516154, "phrase": "stroke_pcf"}, {"score": 0.00481495049065317, "phrase": "stroke_and_speech_and_language_difficulty_web_sites"}, {"score": 0.0041211075804202905, "phrase": "poor_information_quality"}, {"score": 0.0038456073694665, "phrase": "communication_disorders"}, {"score": 0.003201088113538101, "phrase": "stroke_tool"}, {"score": 0.003157061070428828, "phrase": "reported_information_needs"}, {"score": 0.0031136524972682385, "phrase": "sld."}, {"score": 0.0029356335847783195, "phrase": "previous_studies"}, {"score": 0.0029052913631676435, "phrase": "information_quality"}, {"score": 0.002875261849352716, "phrase": "selected_web_sites"}, {"score": 0.0027108508715917756, "phrase": "hon"}, {"score": 0.0026735459686033627, "phrase": "discern"}, {"score": 0.002538164420139397, "phrase": "web_sites"}, {"score": 0.002503232182798796, "phrase": "recommended_grade"}, {"score": 0.0023847032316716503, "phrase": "different_domains"}, {"score": 0.0023114798074455453, "phrase": "valuable_resource"}, {"score": 0.002217326282120832, "phrase": "cautious_use"}, {"score": 0.0021049977753042253, "phrase": "web_site_developers"}], "paper_keywords": ["carers", " consumer health information", " families", " patients", " speech and language difficulties", " stroke"], "paper_abstract": "Online healthcare information is used by patients, their carers and families (PCF) experiencing speech and language difficulties (SLD) after a stroke. This information may be of variable quality. Tools have been designed to assess the risk of poor information quality, evaluating both generic and specific concepts, yet none focuses on stroke. The readability of information is also an issue when communication disorders are under consideration. The study investigated the quality and readability of information on 51 web sites pertaining to SLD following a stroke. These were assessed using two generic evaluation tools (DISCERN and the HON Code), readability tests (Flesch Reading Ease and Flesch-Kincaid Grade Level) and a specifically designed Stroke Tool based on the reported information needs of stroke PCF experiencing SLD. The tools themselves were then evaluated for their feasibility, reliability and validity. In common with previous studies, the information quality of the selected web sites was found to be extremely variable with only 59% achieving a score of 50% or more using HON, only 37% using DISCERN, and 49% using the Stroke Tool. Readability is generally very poor with only 6% of web sites scoring below the recommended grade 7. The tools did not correlate well, suggesting that they measure different domains of quality. The Internet may be a valuable resource for stroke PCF; however, the variable quality of information means that cautious use is recommended. The readability of information is a more serious issue that needs addressing by web site developers.", "paper_title": "An assessment of the quality of information on stroke and speech and language difficulty web sites", "paper_id": "WOS:000314207200011"}