{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiobjective_optimization_problems"}, {"score": 0.004761132425263795, "phrase": "aeronautical_and_aerospace_engineering"}, {"score": 0.004655285779819366, "phrase": "standard_practice"}, {"score": 0.0045262653692203815, "phrase": "highly_complex_search_spaces"}, {"score": 0.004183638135671596, "phrase": "alternative_search_techniques"}, {"score": 0.0032115093493071366, "phrase": "comprehensive_review"}, {"score": 0.003104849179057156, "phrase": "aeronautical_and_aerospace_design_problems"}, {"score": 0.0023694065215394593, "phrase": "general_guidelines"}, {"score": 0.0022777800735119405, "phrase": "aeronautical_and_aerospace_engineering_problems"}, {"score": 0.0022270182923887012, "phrase": "final_part"}, {"score": 0.0021288561076024844, "phrase": "potential_paths"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Artificial intelligence", " evolutionary algorithms", " multiobjective optimization", " optimization methods"], "paper_abstract": "Nowadays, the solution of multiobjective optimization problems in aeronautical and aerospace engineering has become a standard practice. These two fields offer highly complex search spaces with different sources of difficulty, which are amenable to the use of alternative search techniques such as metaheuristics, since they require little domain information to operate. From the several metaheuristics available, multiobjective evolutionary algorithms (MOEAs) have become particularly popular, mainly because of their availability, ease of use, and flexibility. This paper presents a taxonomy and a comprehensive review of applications of MOEAs in aeronautical and aerospace design problems. The review includes both the characteristics of the specific MOEA adopted in each case, as well as the features of the problems being solved with them. The advantages and disadvantages of each type of approach are also briefly addressed. We also provide a set of general guidelines for using and designing MOEAs for aeronautical and aerospace engineering problems. In the final part of the paper, we provide some potential paths for future research, which we consider promising within this area.", "paper_title": "Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering", "paper_id": "WOS:000309727300005"}