{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "freedom_region"}, {"score": 0.015551603673996278, "phrase": "mimo_x_channel"}, {"score": 0.004626796109657584, "phrase": "converse_results"}, {"score": 0.004303252595782034, "phrase": "multiple_antennas"}, {"score": 0.004256703909255889, "phrase": "independent_messages"}, {"score": 0.004165105357908494, "phrase": "fixed_channels"}, {"score": 0.004031375102068085, "phrase": "inner_and_outer_bounds"}, {"score": 0.0039019217388438134, "phrase": "integer_degrees"}, {"score": 0.0033262524445013303, "phrase": "channel_matrices"}, {"score": 0.0031500213134140953, "phrase": "noninteger_degrees"}, {"score": 0.0029722900280316216, "phrase": "dirty_paper_encoding"}, {"score": 0.00295078850927459, "phrase": "successive_decoding"}, {"score": 0.002655894070657161, "phrase": "exactly_degrees"}, {"score": 0.00260810691979637, "phrase": "key_idea"}, {"score": 0.002515090164966655, "phrase": "interference_alignment-i.e"}, {"score": 0.002487835869510301, "phrase": "signal_spaces"}, {"score": 0.0021049977753042253, "phrase": "cognitive_radio"}], "paper_keywords": ["capacity", " cognitive radio", " degrees of freedom", " dirty paper coding", " interference alignment", " multiple-input multiple-output (MIMO)", " zero forcing"], "paper_abstract": "We provide achievability as well as converse results for the degrees of freedom region of a multiple-input multiple-output (MIMO) X channel, i.e., a system with two transmitters' two receivers, each equipped with multiple antennas, where independent messages need to be conveyed over fixed channels from each transmitter to each receiver. The inner and outer bounds on the degrees of freedom region are tight whenever integer degrees of freedom are optimal for each message. With M = 1 antennas at each node, we find that the total (sum rate) degrees of freedom are bounded above and below as 1 < eta*x <= 4/3. If M > 1 and channel matrices are nondegenerate then the precise degrees of freedom eta*x = 4/3. Thus, the MIMO X channel has noninteger degrees of freedom when M is not a multiple of 3. Simple zero forcing without dirty paper encoding or successive decoding, suffices to achieve the 4/3M degrees of freedom. If the channels vary with time/frequency then the X channel with single antennas (M = 1) at all nodes has exactly degrees of freedom. The key idea for the achievability of the degrees of freedom is interference alignment-i.e., signal spaces are aligned at receivers where they constitute interference while they are separable at receivers where they are desired. We also explore the increase in degrees of freedom when some of the messages are made available to a transmitter or receiver in the manner of cognitive radio.", "paper_title": "Degrees of freedom region of the MIMO X channel", "paper_id": "WOS:000252256900011"}