{"auto_keywords": [{"score": 0.04934211582254902, "phrase": "gene_regulation"}, {"score": 0.041892279565940715, "phrase": "regulation_effects"}, {"score": 0.03209079983155069, "phrase": "yeast_genes"}, {"score": 0.026965901705955683, "phrase": "cr-sensitive_genes"}, {"score": 0.02596192807512771, "phrase": "tf-sensitive_genes"}, {"score": 0.00481495049065317, "phrase": "chromatin_regulators"}, {"score": 0.004777744121315302, "phrase": "transcription_factors"}, {"score": 0.004543954909503378, "phrase": "cr"}, {"score": 0.004386887374401584, "phrase": "important_trans-acting_factors"}, {"score": 0.0036695284042874395, "phrase": "tf_regulatory_effect"}, {"score": 0.00326594229173048, "phrase": "nucleosome_perspective"}, {"score": 0.0031660031870090434, "phrase": "cr_and_tf_regulatory_effects"}, {"score": 0.0031050953733360825, "phrase": "transcriptional_control"}, {"score": 0.0030810605918297584, "phrase": "saccharomyces_cerevisiae"}, {"score": 0.0024977819584875573, "phrase": "higher_nucleosome_occupancy"}, {"score": 0.002356282242320051, "phrase": "nucleosome_profiles"}, {"score": 0.0022227806435520764, "phrase": "nucleosome_organizations"}, {"score": 0.0021799789348982516, "phrase": "strong_impact"}, {"score": 0.0021049977753042253, "phrase": "differential_regulation_effects"}], "paper_keywords": [""], "paper_abstract": "Motivation: Chromatin regulators (CR) and transcription factors (TF) are important trans-acting factors regulating transcription process, and many efforts have been devoted to understand their underlying mechanisms in gene regulation. However, the influences of CR and TF regulation effects on nucleosomes during transcription are still minimally understood, and it remains to be determined the extent to which CR and TF regulatory effect shape the organization of nucleosomes in the genome. In this article we attempted to address this problem and examine the patterns of CR and TF regulation effects from the nucleosome perspective. Results: Our results show that the CR and TF regulatory effects exhibit different paradigms of transcriptional control in Saccharomyces cerevisiae. We grouped yeast genes into two categories, 'CR-sensitive' genes and 'TF-sensitive' genes, based on how their expression profiles change upon deletion of CRs or TFs. We found that genes in these two groups have very different patterns of nucleosome organization. The promoters of CR-sensitive genes tend to have higher nucleosome occupancy, whereas the promoters of TF-sensitive genes are depleted of nucleosomes. Furthermore, the nucleosome profiles of CR-sensitive genes tend to show more dynamic characteristics than TF-sensitive genes. These results reveal that the nucleosome organizations of yeast genes have a strong impact on their mode of regulation, and there are differential regulation effects on nucleosomes between CRs and TFs.", "paper_title": "Differential effects of chromatin regulators and transcription factors on gene regulation: a nucleosomal perspective", "paper_id": "WOS:000286215200001"}