{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_process"}, {"score": 0.013330768301514905, "phrase": "modeling_quality"}, {"score": 0.0046544071297876695, "phrase": "essential_part"}, {"score": 0.004527024978801684, "phrase": "typical_enterprise"}, {"score": 0.00438955582974973, "phrase": "business_process_model"}, {"score": 0.004349131361255114, "phrase": "significant_impact"}, {"score": 0.003868063865702117, "phrase": "major_aspects"}, {"score": 0.003569831390151506, "phrase": "process_modeling_quality"}, {"score": 0.0033664873319204027, "phrase": "systematic_literature_review"}, {"score": 0.0031357200369281344, "phrase": "formal_concept_analysis_technique"}, {"score": 0.003059206456855218, "phrase": "quality_aspects"}, {"score": 0.0030403706811144, "phrase": "business_process_models"}, {"score": 0.0029753513692467315, "phrase": "different_dimensions"}, {"score": 0.0029479120854134996, "phrase": "model_quality_type"}, {"score": 0.002849442549612025, "phrase": "research_result"}, {"score": 0.002779894844207706, "phrase": "generally_accepted_framework"}, {"score": 0.002762774046280398, "phrase": "model_quality_types"}, {"score": 0.002720430692494596, "phrase": "empirical_and_pragmatic_quality_aspects"}, {"score": 0.0025104591464887535, "phrase": "published_research"}, {"score": 0.002456744238900652, "phrase": "intangible_knowledge"}, {"score": 0.0023527296826339225, "phrase": "generally_accepted_definition"}, {"score": 0.0022531089868518235, "phrase": "broader_quality_framework"}, {"score": 0.0022117133940361025, "phrase": "different_aspects"}, {"score": 0.002198084195030656, "phrase": "business_process_modeling_quality"}, {"score": 0.002164376714559963, "phrase": "business_process_quality"}], "paper_keywords": ["Systematic literature review", " Business process modeling", " Modeling quality"], "paper_abstract": "Context: Business process modeling is an essential part of understanding and redesigning the activities that a typical enterprise uses to achieve its business goals. The quality of a business process model has a significant impact on the development of any enterprise and IT support for that process. Objective: Since the insights on what constitutes modeling quality are constantly evolving, it is unclear whether research on business process modeling quality already covers all major aspects of modeling quality. Therefore, the objective of this research is to determine the state of the art on business process modeling quality: What aspects of process modeling quality have been addressed until now and which gaps remain to be covered? Method: We performed a systematic literature review of peer reviewed articles as published between 2000 and August 2013 on business process modeling quality. To analyze the contributions of the papers we use the Formal Concept Analysis technique. Results: We found 72 studies addressing quality aspects of business process models. These studies were classified into different dimensions: addressed model quality type, research goal, research method, and type of research result. Our findings suggest that there is no generally accepted framework of model quality types. Most research focuses on empirical and pragmatic quality aspects, specifically with respect to improving the understandability or readability of models. Among the various research methods, experimentation is the most popular one. The results from published research most often take the form of intangible knowledge. Conclusion: We believe there is a lack of an encompassing and generally accepted definition of business process modeling quality. This evidences the need for the development of a broader quality framework capable of dealing with the different aspects of business process modeling quality. Different dimensions of business process quality and of the process of modeling still require further research. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A systematic literature review of studies on business process modeling quality", "paper_id": "WOS:000347022800011"}