{"auto_keywords": [{"score": 0.03448840774192338, "phrase": "citation-based_algorithms"}, {"score": 0.016945688806388234, "phrase": "important_articles"}, {"score": 0.0070744094500351335, "phrase": "noncitation-based_algorithms"}, {"score": 0.006854668232955338, "phrase": "simple_citation_count"}, {"score": 0.005626960758357754, "phrase": "citation_lag"}, {"score": 0.00481495049065317, "phrase": "citation_data"}, {"score": 0.004720717782144015, "phrase": "medline._objective"}, {"score": 0.004466519142879166, "phrase": "biomedical_literature"}, {"score": 0.0040943214728975845, "phrase": "eight_algorithms"}, {"score": 0.0035931556794840027, "phrase": "polynomial_support_vector_machines"}, {"score": 0.0033860360186761533, "phrase": "pre-existing_bibliography"}, {"score": 0.003319675107116333, "phrase": "surgical_oncology"}, {"score": 0.0029949359231919307, "phrase": "six_important_articles"}, {"score": 0.00289007009553812, "phrase": "best_noncitation-based_algorithm"}, {"score": 0.0027778413437997635, "phrase": "similar_differences"}, {"score": 0.0027559226203857316, "phrase": "citation-based_and_noncitation-based_algorithms"}, {"score": 0.002505995596728405, "phrase": "pagerank"}, {"score": 0.002207530926563892, "phrase": "biomedical_information_retrieval"}, {"score": 0.002138636271204459, "phrase": "large_sets"}, {"score": 0.00212175050242788, "phrase": "relevant_results"}], "paper_keywords": [""], "paper_abstract": "Objective: To determine whether algorithms developed for the World Wide Web can be applied to the biomedical literature in order to identify articles that are important as well as relevant. Design and Measurements: A direct comparison of eight algorithms: simple PubMed queries, clinical queries (sensitive and specific versions), vector cosine comparison, citation count, journal impact factor, PageRank, and machine learning based on polynomial support vector machines. The objective was to prioritize important articles, defined as being included in a pre-existing bibliography of important literature in surgical oncology. Results: Citation-based algorithms were more effective than noncitation-based algorithms at identifying important articles. The most effective strategies were simple citation count and PageRank, which on average identified over six important articles in the first 100 results compared to 0.85 for the best noncitation-based algorithm (p < 0.001). The authors saw similar differences between citation-based and noncitation-based algorithms at 10, 20, 50, 200, 500, and 1,000 results (p < 0.001). Citation lag affects performance of PageRank more than simple citation count. However, in spite of citation lag, citation-based algorithms remain more effective than noncitation-based algorithms. Conclusion: Algorithms that have proved successful on the World Wide Web can be applied to biomedical information retrieval. Citation-based algorithms can help identify important articles within large sets of relevant results. Further studies are needed to determine whether citation-based algorithms can effectively meet actual user information needs.", "paper_title": "Using citation data to improve retrieval from MEDLINE", "paper_id": "WOS:000234724000014"}