{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "realistic_physical_layer"}, {"score": 0.015541082532247416, "phrase": "energy_efficient_broadcast_protocols"}, {"score": 0.015364446811864463, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004544629724830453, "phrase": "efficient_broadcast_protocols"}, {"score": 0.004389745162172933, "phrase": "commonly_used_physical_layer_model"}, {"score": 0.003403612019748888, "phrase": "eer"}, {"score": 0.0029622717081190667, "phrase": "directional_antennas"}, {"score": 0.0027159094186967247, "phrase": "actual_transmission_radius"}, {"score": 0.0026846436189970446, "phrase": "transmission_nodes"}, {"score": 0.00265373679629359, "phrase": "relay_nodes"}, {"score": 0.0024756080101497086, "phrase": "energy_consumption"}, {"score": 0.0022960713730673494, "phrase": "appropriate_transmission_range"}, {"score": 0.0021049977753042253, "phrase": "broadcast_protocols"}], "paper_keywords": [""], "paper_abstract": "Previous work on energy efficient broadcast protocols for wireless ad hoc networks are based a commonly used physical layer model called \"Pathloss model\" which assume two nodes can communicate if and only if they exist within their transmission radius. In this paper, we analyze the effect of realistic physical layer on energy efficient broadcast protocols. We employ a more realistic log-normal shadowing model for physical layer and consider two link layer operating models: EER (end-to-end retransmission) and HHR (hop-by-hop retransmission). Networks with omni-antennas and directional antennas are dealt with separately. Based on above models, we analyze how to adjust actual transmission radius for transmission nodes and relay nodes to get the trade-off between maximizing probability of delivery and minimizing energy consumption. From our analysis based on shadowing model, we have derived the appropriate transmission range. The results presented in this paper are expected to improve the performance of broadcast protocols under realistic physical layer.", "paper_title": "Effect of realistic physical layer on energy efficient broadcast protocols for wireless ad hoc networks", "paper_id": "WOS:000238120800031"}