{"auto_keywords": [{"score": 0.049445419527232116, "phrase": "mobile_rfid_systems"}, {"score": 0.007926176288534176, "phrase": "reader_coverage_area"}, {"score": 0.00481495049065317, "phrase": "fcfs_feature"}, {"score": 0.004667541072056214, "phrase": "anti-collision_protocols"}, {"score": 0.0040309035566691645, "phrase": "tag_identification"}, {"score": 0.003995226376780718, "phrase": "static_scenarios"}, {"score": 0.003838531755488468, "phrase": "tag_identification_process"}, {"score": 0.0036390887584943723, "phrase": "fixed_path"}, {"score": 0.003465350958971198, "phrase": "coverage_area"}, {"score": 0.003404244237372396, "phrase": "limited_time"}, {"score": 0.0031562971707460802, "phrase": "multiple_tag_identification"}, {"score": 0.0031006232333900055, "phrase": "shared_wireless_channel"}, {"score": 0.0027865506182608263, "phrase": "limited_sojourn_time"}, {"score": 0.002572001496778222, "phrase": "first_served_feature"}, {"score": 0.002470987929071079, "phrase": "rli_phenomenon"}, {"score": 0.002427372728532664, "phrase": "good_initial_qualities"}, {"score": 0.0023424328921363585, "phrase": "simulation_results"}, {"score": 0.0023010815714140467, "phrase": "proposed_protocol"}, {"score": 0.0022304616068189575, "phrase": "lost_tags"}], "paper_keywords": ["RFID", " tag anti-collision", " mobile RFID systems", " EPC C1G2"], "paper_abstract": "In all anti-collision protocols of RFID standards, EPCGlobal Class 1 Generation 2 (C1G2) protocol has been most widely used in RFID systems since it is simply, efficient and safety. Similar to most existing anti-collision protocols, The C1G2 protocol initially aims at tag identification of static scenarios, where all tags keep still during the tag identification process. However, in many real scenarios, tags generally move along a fixed path in the reader coverage area, which implies that tags stay the coverage area only for a limited time (sojourn time). The scenarios are usually called mobile RFID systems. Because the multiple tag identification based on a shared wireless channel is random, tags entering the reader coverage area earlier may be identified later (random later identification phenomenon). The phenomenon and the limited sojourn time may let some tags lost. In this paper, we propose an improved C1G2 protocol with first come first served feature in mobile RFID systems. The protocol can overcome the RLI phenomenon effectively and retains good initial qualities of C1G2 protocol by modifying it slightly. Simulation results show that the proposed protocol can significantly reduce the numbers of lost tags in mobile RFID systems. The idea of the paper is beneficial for redesigning other existing tag anti-collision protocols so as to make these protocols adapt to mobile RFID systems.", "paper_title": "A Improved EPC Class 1 Gen 2 Protocol with FCFS Feature in the Mobile RFID Systems", "paper_id": "WOS:000327050700007"}