{"auto_keywords": [{"score": 0.044354981189573935, "phrase": "dhpm"}, {"score": 0.03669209788771692, "phrase": "metadata_directory"}, {"score": 0.008947001126030312, "phrase": "super_peers"}, {"score": 0.007834036506304405, "phrase": "shared_resources"}, {"score": 0.00481495049065317, "phrase": "duty-oriented_hybrid_peer-"}, {"score": 0.004710854091689325, "phrase": "topology_structure"}, {"score": 0.004680064180207844, "phrase": "peer-to-peer_overlay_network"}, {"score": 0.004588891098290524, "phrase": "resource_discovery"}, {"score": 0.004431149592844886, "phrase": "real_world"}, {"score": 0.004382971323155449, "phrase": "full_advantage"}, {"score": 0.00433531459712787, "phrase": "unstructured_peer-to-peer_network"}, {"score": 0.004149792080414689, "phrase": "tree-structure_hierarchical_overlay_network"}, {"score": 0.004118265632805232, "phrase": "node_departure_algorithm"}, {"score": 0.003928969293303814, "phrase": "semantic_similarity"}, {"score": 0.0038862297330905836, "phrase": "dhpm_overlay_network"}, {"score": 0.003752550907120244, "phrase": "super_peer"}, {"score": 0.003687439449869248, "phrase": "centralized_server"}, {"score": 0.0034155590892606972, "phrase": "real_resource_location"}, {"score": 0.003393206299636482, "phrase": "super-peer_architecture"}, {"score": 0.003312486229143855, "phrase": "additional_responsibilities"}, {"score": 0.003298016824147278, "phrase": "higher-capacity_nodes"}, {"score": 0.0032336801561165113, "phrase": "searching_efficiency"}, {"score": 0.002943147037670826, "phrase": "shared_information"}, {"score": 0.0028920389818271387, "phrase": "tree-like_distributed_infrastructure"}, {"score": 0.002866817775018445, "phrase": "first_layer"}, {"score": 0.002535908872480815, "phrase": "searching_algorithm"}, {"score": 0.002453934333239467, "phrase": "important_factor"}, {"score": 0.002328238264850759, "phrase": "considered_factors"}, {"score": 0.002282776401149436, "phrase": "node_departure_cases"}, {"score": 0.002218668420806254, "phrase": "query_searching"}, {"score": 0.0021188830851544133, "phrase": "gnutella"}, {"score": 0.002104997838003238, "phrase": "freenet"}], "paper_keywords": [""], "paper_abstract": "The topology structure of the peer-to-peer overlay network is a critical factor in dominating performance of resource discovery. In the paper, we consider that nodes have their duty or function in the real world, and we take full advantage of the characteristic of unstructured peer-to-peer network. According to these, a duty-oriented hybrid peer-to-peer network based on metadata (DHPM) is proposed. DHPM organizes nodes into a tree-structure hierarchical overlay network. Its nodes are divided into domains according to the duty or the function of these nodes, and into groups according to the semantic similarity in one domain. The DHPM overlay network consists of two types of nodes, super peers (SPs) and peers. A super peer is a node that acts as a centralized server submitting and answering requests on behalf of peers. A peer submits queries to its super peer, searches for the location of queries according to the metadata directory in the super peers and receives results from the real resource location. The super-peer architecture adopted in DHPM exploits the heterogeneity of nodes by assigning additional responsibilities to higher-capacity nodes. The classification of nodes helps to increase searching efficiency during routing messages in the network. In DHPM, peers query resources via metadata directory which is in the super peers. Metadata directory in the 1st level SPs manages the information of shared resources in their domains, while metadata directory in the 2nd level SPs manages the shared information in their groups. The metadata directory is a tree-like distributed infrastructure. In the first layer of the metadata directory there are all the 1st level SPs and replica directory. 1st level SPs manage all the metadata of shared resources in the domain. The metadata of shared resources include databases, files, monitoring information, and 2nd level SPs in the domain. In order to construct and maintain DHPM, node join algorithm, node departure algorithm, and query searching algorithm are presented to ensure running of the network. Duty or function is the important factor in selecting the super peers. In addition, high bandwidth, sufficient searching process power, longer online time etc. are the considered factors. In node departure algorithm, we describe two kinds of node departure cases: normal departure and abnormal departure. By means of metadata directory, query searching can be gotten in DHPM. Finally, experiments are made to show the performance of query searching with DHPM, Gnutella, and Freenet.", "paper_title": "Duty-Oriented Hybrid Peer-to-Peer Network Based on Metadata", "paper_id": "WOS:000265103800032"}