{"auto_keywords": [{"score": 0.047869525215773305, "phrase": "complex_time_series_data_exploration"}, {"score": 0.04452657881400446, "phrase": "data_characteristics"}, {"score": 0.03797374281850818, "phrase": "nature_determination"}, {"score": 0.03728661882776104, "phrase": "time_series_data"}, {"score": 0.031185443736095782, "phrase": "pattern_importance"}, {"score": 0.00481495049065317, "phrase": "complex_time_series_data_exploration."}, {"score": 0.004680473391946691, "phrase": "integrated_data_characteristic_testing_scheme"}, {"score": 0.004422632150619634, "phrase": "complex_time_series_modeling"}, {"score": 0.004299064805926241, "phrase": "different_data_characteristics"}, {"score": 0.0041987222897385676, "phrase": "series_data"}, {"score": 0.0036610702290043387, "phrase": "proposed_testing_scheme"}, {"score": 0.0033465923623290034, "phrase": "pattern_measurement"}, {"score": 0.0030446120560494155, "phrase": "noise_pattern"}, {"score": 0.0029039692582303904, "phrase": "illustration_purpose"}, {"score": 0.0026169435194789772, "phrase": "proposed_integrated_testing_scheme"}, {"score": 0.0024960069794216977, "phrase": "sample_data"}, {"score": 0.0021656385587456952, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "effective_data_characteristic_testing_tool"}], "paper_keywords": ["Data characteristic", " complex time series", " integrated testing scheme", " data exploration"], "paper_abstract": "In this paper, an integrated data characteristic testing scheme is proposed for complex time series data exploration so as to select the most appropriate research methodology for complex time series modeling. Based on relationships across different data characteristics, data characteristics of time series data are divided into two main categories: nature characteristics and pattern characteristics in this paper. Accordingly, two relevant tasks, nature determination and pattern measurement, are involved in the proposed testing scheme. In nature determination, dynamics system generating the time series data is analyzed via nonstationarity, nonlinearity and complexity tests. In pattern measurement, the characteristics of cyclicity (and seasonality), mutability (or saltation) and randomicity (or noise pattern) are measured in terms of pattern importance. For illustration purpose, four main Chinese economic time series data are used as testing targets, and the data characteristics hidden in these time series data are thoroughly explored by using the proposed integrated testing scheme. Empirical results reveal that the natures of all sample data demonstrate complexity in the phase of nature determination, and in the meantime the main pattern of each time series is captured based on the pattern importance, indicating that the proposed scheme can be used as an effective data characteristic testing tool for complex time series data exploration from a comprehensive perspective.", "paper_title": "AN INTEGRATED DATA CHARACTERISTIC TESTING SCHEME FOR COMPLEX TIME SERIES DATA EXPLORATION", "paper_id": "WOS:000326678200006"}