{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "tabg"}, {"score": 0.00481495049065317, "phrase": "tree_automata_mixing"}, {"score": 0.004548939310612501, "phrase": "ranked_tree_automata"}, {"score": 0.00435431549315231, "phrase": "bogaert"}, {"score": 0.00431639732474394, "phrase": "tison"}, {"score": 0.004204602964512469, "phrase": "global_equality"}, {"score": 0.00406001734835979, "phrase": "filiot_et_al"}, {"score": 0.003219553875143356, "phrase": "key_constraints"}, {"score": 0.003191485583025302, "phrase": "xml_documents"}, {"score": 0.0030547611342112693, "phrase": "different_values"}, {"score": 0.002962543869356265, "phrase": "emptiness_problem"}, {"score": 0.002936709752475125, "phrase": "tabg."}, {"score": 0.002835599469639296, "phrase": "open_question"}, {"score": 0.0027499801534943582, "phrase": "taged."}, {"score": 0.00266693888510356, "phrase": "global_arithmetic_constraints"}, {"score": 0.002508284945907166, "phrase": "different_equivalence_classes"}, {"score": 0.002287783663138828, "phrase": "unranked_ordered_terms"}, {"score": 0.0021049977753042253, "phrase": "monadic_second_order_logic"}], "paper_keywords": ["Logic", " symbolic constraints", " tree automata", " XML processing"], "paper_abstract": "We define a class of ranked tree automata TABG generalizing both the tree automata with local tests between brothers of Bogaert and Tison (1992) and with global equality and disequality constraints (TAGED) of Filiot et al. (2007). TABG can test for equality and disequality modulo a given flat equational theory between brother subterms and between subterms whose positions are defined by the states reached during a computation. In particular, TABG can check that all the subterms reaching a given state are distinct. This constraint is related to monadic key constraints for XML documents, meaning that every two distinct positions of a given type have different values. We prove decidability of the emptiness problem for TABG. This solves, in particular, the open question of the decidability of emptiness for TAGED. We further extend our result by allowing global arithmetic constraints for counting the number of occurrences of some state or the number of different equivalence classes of subterms (modulo a given flat equational theory) reaching some state during a computation. We also adapt the model to unranked ordered terms. As a consequence of our results for TABG, we prove the decidability of a fragment of the monadic second order logic on trees extended with predicates for equality and disequality between subtrees, and cardinality.", "paper_title": "DECIDABLE CLASSES OF TREE AUTOMATA MIXING LOCAL AND GLOBAL CONSTRAINTS MODULO FLAT THEORIES", "paper_id": "WOS:000322537700007"}