{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environmental_factors"}, {"score": 0.004610058444728656, "phrase": "genetic_factors"}, {"score": 0.0044968982227349625, "phrase": "critical_roles"}, {"score": 0.0037087324991876727, "phrase": "strong_effects"}, {"score": 0.003528730431045574, "phrase": "abnormal_phenotypes"}, {"score": 0.003135356056324338, "phrase": "great_value"}, {"score": 0.0029645930408561086, "phrase": "especially_drugs"}, {"score": 0.0027684263985790526, "phrase": "mirenvironment_database"}, {"score": 0.0026835920552084514, "phrase": "comprehensive_collection"}, {"score": 0.0026175952455594277, "phrase": "experimentally_supported_interactions"}, {"score": 0.0021049977753042253, "phrase": "biomedical_resource"}], "paper_keywords": [""], "paper_abstract": "The interaction between genetic factors and environmental factors has critical roles in determining the phenotype of an organism. In recent years, a number of studies have reported that the dysfunctions on microRNA (miRNAs), environmental factors and their interactions have strong effects on phenotypes and even may result in abnormal phenotypes and diseases, whereas there has been no a database linking miRNAs, environmental factors and phenotypes. Such a resource platform is believed to be of great value in the understanding of miRNAs, environmental factors, especially drugs and diseases. In this study, we constructed the miREnvironment database, which contains a comprehensive collection and curation of experimentally supported interactions among miRNAs, environmental factors and phenotypes. The names of miRNAs, phenotypes, environmental factors, conditions of environmental factors, samples, species, evidence and references were further annotated. miREnvironment represents a biomedical resource for researches on miRNAs, environmental factors and diseases.", "paper_title": "miREnvironment Database: providing a bridge for microRNAs, environmental factors and phenotypes", "paper_id": "WOS:000297352100021"}