{"auto_keywords": [{"score": 0.03504889245518114, "phrase": "musical_expression"}, {"score": 0.00481495049065317, "phrase": "individual_difference"}, {"score": 0.004718897469501381, "phrase": "computer-assisted_music_performances"}, {"score": 0.00464343008299973, "phrase": "computational_systems"}, {"score": 0.0045876189888390895, "phrase": "expressive_musical_performances"}, {"score": 0.004283739213556286, "phrase": "actual_performances"}, {"score": 0.00419823857480455, "phrase": "performance_parameter"}, {"score": 0.004147756103284082, "phrase": "subjective_point"}, {"score": 0.0037955672944969287, "phrase": "generated_performances"}, {"score": 0.003417565253539315, "phrase": "audience_judges"}, {"score": 0.0033628392198449134, "phrase": "different_approaches"}, {"score": 0.003269162006886173, "phrase": "preliminary_study"}, {"score": 0.0027260525536580912, "phrase": "music_systemizers"}, {"score": 0.002628747284714371, "phrase": "formal_aspects"}, {"score": 0.0025658094607383646, "phrase": "music_empathizers"}, {"score": 0.0024247382451294255, "phrase": "high_systemizers"}, {"score": 0.0023762535034673017, "phrase": "high_empathizers"}, {"score": 0.0023287359930308864, "phrase": "five_pieces"}, {"score": 0.0022095803687183107, "phrase": "basic_technical_aspects"}, {"score": 0.002165388556451298, "phrase": "computer-assisted_and_computer-generated_performances"}, {"score": 0.0021049977753042253, "phrase": "individual_differences"}], "paper_keywords": ["Human Factors", " Experimentation", " Cognitive styles", " human-centered computing", " music performance"], "paper_abstract": "Computational systems for generating expressive musical performances have been studied for several decades now. These models are generally evaluated by comparing their predictions with actual performances, both from a performance parameter and a subjective point of view, often focusing on very specific aspects of the model. However, little is known about how listeners evaluate the generated performances and what factors influence their judgement and appreciation. In this article, we present two studies, conducted during two dedicated workshops, to start understanding how the audience judges entire performances employing different approaches to generating musical expression. In the preliminary study, 40 participants completed a questionnaire in response to five different computer-generated and computer-assisted performances, rating preference and describing the expressiveness of the performances. In the second, \"GATM\" (Gruppo di Analisi e Teoria Musicale) study, 23 participants also completed the Music Cognitive Style questionnaire. Results indicated that music systemizers tend to describe musical expression in terms of the formal aspects of the music, and music empathizers tend to report expressiveness in terms of emotions and characters. However, high systemizers did not differ from high empathizers in their mean preference score across the five pieces. We also concluded that listeners tend not to focus on the basic technical aspects of playing when judging computer-assisted and computer-generated performances. Implications for the significance of individual differences in judging musical expression are discussed.", "paper_title": "The Role of Individual Difference in Judging Expressiveness of Computer-Assisted Music Performances by Experts", "paper_id": "WOS:000348358400007"}