{"auto_keywords": [{"score": 0.04314074539597285, "phrase": "rsw"}, {"score": 0.010686857492880418, "phrase": "iax"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_clients"}, {"score": 0.0038810583785936505, "phrase": "voice_and_video_services"}, {"score": 0.0037216229812089686, "phrase": "considerable_problems"}, {"score": 0.0035051129798529, "phrase": "different_advantages"}, {"score": 0.0030904433394138963, "phrase": "rsw_interoperability"}, {"score": 0.002841545331522694, "phrase": "current_investments"}, {"score": 0.0025354356862967824, "phrase": "sip"}, {"score": 0.0024311346712789553, "phrase": "simple_and_an_attractive_method"}, {"score": 0.0024021392860034056, "phrase": "voip"}, {"score": 0.0023311233166534214, "phrase": "complex_and_heavy_protocol"}], "paper_keywords": ["InterAsterisk eXchange protocol", " VoIP", " SIP", " H.323", " Real time switching"], "paper_abstract": "The InterAsterisk eXchange (IAX) protocol has been available for a few years. Meanwhile, the popularity of Real time S Witching (RSW) has increased due to its ability to easily combine voice and video services. Incidentally, these two heterogeneous clients pose considerable problems for users who have to choose between two solutions offering different advantages and disadvantages. While RSW is being used in many areas, IAX is being deployed in many VoIP products. Hence, RSW interoperability and coexistence with IAX is considered very important when maximizing the return on current investments and to support, new deployments that could be RSW as an, alternative packet telephony signaling protocol. We used IAX as opposed to SIP, which although started as a simple and an attractive method for VoIP, has become a complex and heavy protocol to implement. Similarly, H.323 is a very complex protocol suite that can result in the transmission of many unnecessary messages across the network.", "paper_title": "CONFERENCE GATEWAY FOR HETEROGENEOUS CLIENTS: REAL TIME SWITCHING CLIENTS AND INTERASTERISK EXCHANGE CLIENTS", "paper_id": "WOS:000287124500031"}