{"auto_keywords": [{"score": 0.04678864793717076, "phrase": "short_bios"}, {"score": 0.00481495049065317, "phrase": "researchers'_international_mobilities"}, {"score": 0.004667541072056214, "phrase": "highly_cited_and_uncited_papers"}, {"score": 0.004444921827311577, "phrase": "published_resources"}, {"score": 0.004232875294230749, "phrase": "researchers'_careers"}, {"score": 0.004048860957751714, "phrase": "researchers'_life_history"}, {"score": 0.003314591878914152, "phrase": "highly_cited_papers"}, {"score": 0.0030189426536422577, "phrase": "identification_rates"}, {"score": 0.002992195343569767, "phrase": "researchers'_origin"}, {"score": 0.0029394074636168435, "phrase": "researchers'_affiliation"}, {"score": 0.0027495914857929584, "phrase": "researchers'_international_movement"}, {"score": 0.002641621667026613, "phrase": "full_landscape"}, {"score": 0.00260657976055413, "phrase": "movement's_influence"}, {"score": 0.00258347644721642, "phrase": "national_publication"}, {"score": 0.002470987929071079, "phrase": "researchers'_countries"}, {"score": 0.00241658945942583, "phrase": "research_experience"}], "paper_keywords": ["Researchers' international migration", " Returnee", " Curriculum vitae", " Short Bios", " Highly cited papers"], "paper_abstract": "Using curriculum vitae (CVs) or Short Bios in published resources such as the Internet enables us to analyze many issues concerning researchers' careers. However, analysis of CVs or Short Bios concerning researchers' life history, such as movement between countries, has rarely been conducted. In this paper, we pursue two purposes: to demonstrate which conditions (citation impact, countries or sectors) are favorable for the analysis, and to show structures of production of highly cited papers. To grasp more obvious tendencies, we compare two ``extreme'' samples: highly cited and uncited papers. First, we assess the identification rates of researchers' origin broken down by researchers' affiliation (countries and sectors). Then, we analyze the influence of these researchers' international movement based on their origin. The results show the full landscape of the movement's influence on national publication, the characteristics of each country in terms of researchers' countries of origin and the research experience of both internationally moved and domestic researchers. Moreover, we analyze the contributions of researchers who returned from abroad to their home countries. Finally, we assess the limitations of our research method and the topic to be addressed concerning this method.", "paper_title": "Influence of researchers' international mobilities on publication: a comparison of highly cited and uncited papers", "paper_id": "WOS:000343609900035"}