{"auto_keywords": [{"score": 0.04424412398007333, "phrase": "cluster_head"}, {"score": 0.01658221464655297, "phrase": "base_station"}, {"score": 0.012991262509537645, "phrase": "secure_communication"}, {"score": 0.006533812984405576, "phrase": "sensor_network"}, {"score": 0.00481495049065317, "phrase": "node_security"}, {"score": 0.004793143777319357, "phrase": "hierarchical_sensor_networks"}, {"score": 0.004728342411723218, "phrase": "keys"}, {"score": 0.004685575787741084, "phrase": "cluster_heads"}, {"score": 0.004570024332569239, "phrase": "data_aggregation"}, {"score": 0.004528712642539063, "phrase": "important_decisions"}, {"score": 0.003987914479119099, "phrase": "fixed_cluster_head"}, {"score": 0.0038983467023052747, "phrase": "dynamic_cluster_heads"}, {"score": 0.003767738552860633, "phrase": "lagrange's_interpolation"}, {"score": 0.0026790983342162887, "phrase": "key_distribution_approach"}, {"score": 0.002423931256002674, "phrase": "tinyos"}, {"score": 0.0024129270125050105, "phrase": "tossim"}, {"score": 0.002238388884010998, "phrase": "reduced_computation"}, {"score": 0.0022282251852637175, "phrase": "bandwidth_requirements"}, {"score": 0.0021049977753042253, "phrase": "updating_parameter"}], "paper_keywords": ["Sensor Networks", " Security", " Key Management", " Lagrange's Interpolation", " Partial Key", " Key Distribution", " Key Recovery"], "paper_abstract": "Secure communication involving cluster heads in a sensor network is vital as they are responsible for data aggregation and for taking important decisions in their groups. In this article, we propose a scheme for secure communication via such nodes in a sensor network. In our approach, the base station provides a function to the cluster head of each group, which is used to compute the key for the secure communication with the base station. The protocol is first elucidated for a fixed cluster head in each group and later it is extended for dynamic cluster heads. Each function is computed using a certain number of points on the curve using Lagrange's interpolation [10]. The curve computed from the function intersects the Y axis at a point which is considered as the key of the cluster head. The advantage of this approach in providing secure communication out of a cluster head is that an adversary will not be able to get hold of the function by attacking the cluster head alone. This is because instead of storing the function in the cluster head, sub-functions are generated and distributed among the sensor nodes in each group. After the distribution of the sub-functions, these functions are discarded from each cluster head. When a cluster head wants to communicate with the base station it accumulates sub-functions to compute the function to compute the key used to encrypt/decrypt messages sent and received to and from the base station. For updating the functions, the sub-functions are updated using the information provided by the base station. The key distribution approach requires that the function is to be kept secret all the time. However, since it is present in the cluster head to compute the key, it is difficult to ensure its security. We have experimentally evaluated our scheme through the simulations using TinyOs and TOSSIM and the results show that latency can be improved by using the sub-functions updating approach rather than re-generating the functions and the sub-functions. Also, updating the sub-functions requires reduced computation and bandwidth requirements than updating the sub-keys because updating of the keys needs to be done from scratch whereas updating of the sub-functions are done using an updating parameter.", "paper_title": "Node Security in Hierarchical Sensor Networks: Distribution of Functions versus Keys", "paper_id": "WOS:000274753200007"}