{"auto_keywords": [{"score": 0.0500731069683608, "phrase": "asymmetric_integration"}, {"score": 0.0487075478765859, "phrase": "india"}, {"score": 0.004638354165775803, "phrase": "information_infrastructures"}, {"score": 0.004543046350523362, "phrase": "incremental_fashion"}, {"score": 0.004486800020569973, "phrase": "partly_planned_and_unplanned_processes"}, {"score": 0.004322186889256224, "phrase": "previously_unconnected_systems"}, {"score": 0.0035113478590679133, "phrase": "different_connotations"}, {"score": 0.003354393040689453, "phrase": "dominant_view"}, {"score": 0.003285380677401785, "phrase": "largely_technical_concern"}, {"score": 0.0032044314332538154, "phrase": "political_and_institutional_interests"}, {"score": 0.0029981559422442693, "phrase": "institutional_integration"}, {"score": 0.002936451109357539, "phrase": "uneven_distribution"}, {"score": 0.0029121251930855664, "phrase": "political_influence"}, {"score": 0.00284034646798833, "phrase": "empirical_material"}, {"score": 0.0027588314610845705, "phrase": "fragmented_information_systems"}, {"score": 0.0027246145918972, "phrase": "health_care_sector"}, {"score": 0.002424984362388813, "phrase": "small_actor"}, {"score": 0.0023948981440134478, "phrase": "asymmetric_power_relations"}, {"score": 0.002249961956629804, "phrase": "bigger_and_more_influential_actors"}, {"score": 0.0021049977753042253, "phrase": "distinct_configurations"}], "paper_keywords": ["integration", " health care information systems", " HISP", " India", " politics"], "paper_abstract": "Information Infrastructures typically evolve in an incremental fashion, through partly planned and unplanned processes. A significant mechanism of growth is when previously unconnected systems are integrated, facilitating the transition from networking to inter-networking. Conversely, failure to integrate systems contributes to the lack of evolution of the infrastructure. Integration seems crucial for evolving infrastructures; however, there is little consensus on what it entails, as can be seen when different connotations of 'integration\" are unpacked. In contrast to the dominant view of integration as a largely technical concern, our focus is on how political and institutional interests are embedded in efforts to achieve integration. More specifically, we explore strategies for institutional integration that take into account uneven distribution of political influence. The paper builds on empirical material from our ongoing (2001 - 2008) involvement with the problem of fragmented information systems in the health care sector in India. The case is seen from the perspective of one small actor offering free, open-source software that is already being used in several other developing countries. Choosing to focus on a small actor highlights the asymmetric power relations among the actors; our actor has no other option than to seek to align with bigger and more influential actors. We analyse the strategies, the configurable politics, and the outcomes of the distinct configurations that emerge from this form of asymmetric integration.", "paper_title": "Configurable Politics and Asymmetric Integration: Health e-Infrastructures in India", "paper_id": "WOS:000267038000003"}