{"auto_keywords": [{"score": 0.04186146148425491, "phrase": "pants_decomposition"}, {"score": 0.010404169416024185, "phrase": "vertex-edge_graph"}, {"score": 0.00481495049065317, "phrase": "orientable_surface"}, {"score": 0.004560568143816105, "phrase": "shortest_cycle"}, {"score": 0.0038054151244558123, "phrase": "disjoint_simple_cycles"}, {"score": 0.003117890043128058, "phrase": "combinatorial_surface"}, {"score": 0.002830617996609902, "phrase": "input_pants_decomposition"}, {"score": 0.002779769492357829, "phrase": "homotopic_pants_decomposition"}, {"score": 0.002448446849997207, "phrase": "shortest_cycle_homotopic"}, {"score": 0.0021960024679620886, "phrase": "resulting_pants_decomposition"}, {"score": 0.0021565293818406554, "phrase": "desired_cycle"}], "paper_keywords": ["algorithms", " theory", " combinatorial optimization", " combinatorial surface", " computational", " topology", " homotopy", " pants decomposition"], "paper_abstract": "We consider the problem of finding a shortest cycle (freely) homotopic to a given simple cycle on a compact, orientable surface. For this purpose, we use a pants decomposition of the surface: a set of disjoint simple cycles that cut the surface into pairs of pants (spheres with three holes). We solve this problem in a framework where the cycles are closed walks on the vertex-edge graph of a combinatorial surface that may overlap but do not cross. We give an algorithm that transforms an input pants decomposition into another homotopic pants decomposition that is optimal: each cycle is as short as possible in its homotopy class. As a consequence, finding a shortest cycle homotopic to a given simple cycle amounts to extending the cycle into a pants decomposition and to optimizing it: the resulting pants decomposition contains the desired cycle. We describe two algorithms for extending a cycle to a pants decomposition. All algorithms in this article are polynomial, assuming uniformity of the weights of the vertex-edge graph of the surface.", "paper_title": "Optimal pants decompositions and shortest homotopic cycles on an orientable surface", "paper_id": "WOS:000248764700003"}