{"auto_keywords": [{"score": 0.031518332094430355, "phrase": "fl"}, {"score": 0.00481495049065317, "phrase": "web_business_models"}, {"score": 0.004042056914551798, "phrase": "intelligent_agents"}, {"score": 0.003418186564522323, "phrase": "zero_knowledge_negotiation"}, {"score": 0.0033177813460815346, "phrase": "basic_characteristics"}, {"score": 0.003232341244892437, "phrase": "decision_support_mechanism"}, {"score": 0.0031490944606172152, "phrase": "bilateral_single_issue_negotiations"}, {"score": 0.0030451958332949735, "phrase": "proposed_decision_making_mechanism"}, {"score": 0.0030001224724395354, "phrase": "fuzzy_logic"}, {"score": 0.0028795712616923462, "phrase": "negotiation_process"}, {"score": 0.0027535633837592597, "phrase": "buyer's_offer"}, {"score": 0.002480520548392772, "phrase": "fuzzy_inference_rules"}, {"score": 0.002234491924392104, "phrase": "increased_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Negotiation", " Fuzzy Logic"], "paper_abstract": "Web business models typically rely on environments where entities, not known in advance, try to negotiate and agree on the purchase of products. Such environments are termed Electronic Markets (EMs). In EMs there are two main groups of entities: the buyers and the sellers. Intelligent agents can play the role of buyers and sellers as delegates of them. Agents, acting autonomously, can guarantee the efficiency in the discovery of items of interest to the buyer. The interaction between buyers and sellers can be modeled as a zero knowledge negotiation. In this paper, we discuss basic characteristics of the negotiation and define a decision support mechanism for sellers. We focus on bilateral single issue negotiations between a buyer and a seller. The proposed decision making mechanism is based on Fuzzy Logic (FL) in order to handle uncertainty in the negotiation process. The seller, at every negotiation round, receives the buyer's offer and decides her course of actions. In this setting, we consider that no knowledge on the strategies that entities follow is available. The seller uses fuzzy inference rules in order to decide if she is going to accept or reject the offer of the buyer at every round. Compared with other relevant schemes, our approach demonstrates increased efficiency by raising the utility that the seller obtains through negotiations. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Sellers in e-marketplaces: A Fuzzy Logic based decision support system", "paper_id": "WOS:000338390100018"}