{"auto_keywords": [{"score": 0.04939422255606209, "phrase": "multi-dimensional_data"}, {"score": 0.00481495049065317, "phrase": "hierarchical_binary_histograms"}, {"score": 0.0047006879240764935, "phrase": "hierarchical_binary_partitions"}, {"score": 0.004437349839203418, "phrase": "effective_histograms"}, {"score": 0.004270003565426343, "phrase": "lossless_compression_techniques"}, {"score": 0.004050116768809519, "phrase": "query_answering"}, {"score": 0.0038600230206554792, "phrase": "hierarchical_partition_scheme"}, {"score": 0.0035570425396761122, "phrase": "bucket_boundaries"}, {"score": 0.003262035294895737, "phrase": "regular_grids"}, {"score": 0.003123808471618783, "phrase": "histogram_construction"}, {"score": 0.0030203487665054806, "phrase": "thorough_experimental_analysis"}, {"score": 0.0028923335491735564, "phrase": "different_heuristics"}, {"score": 0.002864628676257225, "phrase": "different_representation_models"}, {"score": 0.0026395715432958665, "phrase": "best_accuracy"}, {"score": 0.0025034338848015166, "phrase": "new_heuristics"}, {"score": 0.0023857603808363527, "phrase": "state-of-the-art_summarization_techniques"}, {"score": 0.0022956075241520064, "phrase": "lower_error_rates"}, {"score": 0.0021049977753042253, "phrase": "query_estimation"}], "paper_keywords": ["data reduction", " multi-dimensional data", " histograms", " query processing"], "paper_abstract": "Hierarchical binary partitions of multi-dimensional data are investigated as a basis for the construction of effective histograms. Specifically, the impact of adopting lossless compression techniques for representing the histogram on both the accuracy and the efficiency of query answering is investigated. Compression is obtained by exploiting the hierarchical partition scheme underlying the histogram, and then introducing further restrictions on the partitioning which enable a more compact representation of bucket boundaries. Basically, these restrictions consist of constraining the splits of the partition to be laid onto regular grids defined on the buckets. Several heuristics guiding the histogram construction are also proposed, and a thorough experimental analysis comparing the accuracy of histograms resulting from combining different heuristics with different representation models (both the new compression-based and the traditional ones) is provided. The best accuracy turns out from combining our grid-constrained partitioning scheme with one of the new heuristics. Histograms resulting from this combination are compared with state-of-the-art summarization techniques, showing that the proposed approach yields lower error rates and is much less sensitive to dimensionality, and that adopting our compression scheme results in improving the efficiency of query estimation.", "paper_title": "Compressed hierarchical binary histograms for summarizing multi-dimensional data", "paper_id": "WOS:000256324200004"}