{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "manufacturing_processes"}, {"score": 0.00813711467419928, "phrase": "statistical_regression"}, {"score": 0.004506048850130758, "phrase": "material_properties"}, {"score": 0.004303830426772906, "phrase": "inexact_knowledge"}, {"score": 0.004260134699483774, "phrase": "previous_research"}, {"score": 0.003509006038574667, "phrase": "new_form"}, {"score": 0.0034733518170738517, "phrase": "weighted_fuzzy_arithmetic"}, {"score": 0.0033685408148574846, "phrase": "hybrid_fuzzy_least-squares_regression_method"}, {"score": 0.002788388542538351, "phrase": "proposed_approach"}, {"score": 0.0025694584194998335, "phrase": "modeling_results"}, {"score": 0.002453934333239467, "phrase": "fuzzy_linear_regression"}, {"score": 0.0022961534630650347, "phrase": "hflsr"}, {"score": 0.0021049977753042253, "phrase": "peters_fuzzy_regression"}], "paper_keywords": ["fuzzy linear regression", " hybrid fuzzy least-squares regression (HFLSR)", " manufacturing process modeling", " statistical regression"], "paper_abstract": "Uncertainty in manufacturing processes is caused both by randomness, as in material properties, and by fuzziness, as in the inexact knowledge. Previous research has seldom considered these two types of uncertainty when modeling manufacturing processes. In this paper, a hybrid fuzzy least-squares regression (HFLSR) approach to modeling manufacturing processes, which does take into consideration these two types of uncertainty, is proposed and described, and a new form of weighted fuzzy arithmetic is introduced to develop the hybrid fuzzy least-squares regression method. The proposed HFLSR approach not only features the capability of dealing with the two types of uncertainty, but also addresses the consideration of replication of responses in experiments. To investigate the effectiveness of the proposed approach to process modeling, it was applied to the modeling solder paste dispensing process. Modeling results were compared with those based on statistical regression and fuzzy linear regression. It was found that the accuracy of prediction based on the HFLSR is slightly better than that based on statistical regression and much better than that based on the Peters fuzzy regression.", "paper_title": "The hybrid fuzzy least-squares regression approach to modeling manufacturing processes", "paper_id": "WOS:000256670200007"}