{"auto_keywords": [{"score": 0.04970018005584554, "phrase": "vehicle_collision"}, {"score": 0.00481495049065317, "phrase": "rc_columns_subject"}, {"score": 0.004701556483912018, "phrase": "increasing_population"}, {"score": 0.00453643016617164, "phrase": "infrastructure_and_transportation_facilities"}, {"score": 0.004290969772225093, "phrase": "increasing_number"}, {"score": 0.004257000695796238, "phrase": "vehicle_collisions"}, {"score": 0.0037040785566765954, "phrase": "existing_design_guidelines"}, {"score": 0.0034208822062692127, "phrase": "desired_behavior"}, {"score": 0.0033803056981691866, "phrase": "associated_performance_levels"}, {"score": 0.0030119758165837625, "phrase": "performance-based_probabilistic_models"}, {"score": 0.0029762350325031207, "phrase": "dynamic_shear_force_capacity"}, {"score": 0.002952699963284137, "phrase": "rc"}, {"score": 0.0027485326424697095, "phrase": "rc_columns"}, {"score": 0.0026836723685046407, "phrase": "developed_probabilistic_dynamic_shear_force_capacity_models"}, {"score": 0.0026203386550421558, "phrase": "performance-based_design"}, {"score": 0.0025180781216911246, "phrase": "developed_framework"}, {"score": 0.002381566880282456, "phrase": "collision_event"}, {"score": 0.0022977342663599042, "phrase": "proposed_approach"}, {"score": 0.0022434880661725493, "phrase": "similar_cases"}, {"score": 0.0021992603252793995, "phrase": "ship_collision"}, {"score": 0.002130298466581199, "phrase": "concrete_walls"}, {"score": 0.0021049977753042253, "phrase": "adequate_models"}], "paper_keywords": [""], "paper_abstract": "With the increasing population and the demand associated with it, the infrastructure and transportation facilities have increased rapidly over the years. The progress has been accompanied by an increasing number of vehicle collisions with structures. This type of collision might lead to the damage and sometimes collapse of the structures. In reinforced concrete (RC) structures, columns are usually the most vulnerable members exposed to collisions. However, the existing design guidelines and provisions for protection of these members against collision of vehicles are not adequate. In particular, the desired behavior and the associated performance levels of a structure during a vehicle collision are not defined. Therefore, there is a need to assess the vulnerability of structures against such collisions. This article develops performance-based probabilistic models for the dynamic shear force capacity of RC columns in bridges and buildings. A framework is also developed to estimate the fragility of the RC columns subject to vehicle collision. The developed probabilistic dynamic shear force capacity models can be used for a performance-based design of structures such as buildings and bridges. The developed framework can be used to estimate the adequacy of a structure to sustain a collision event and make recommendations for repair and retrofit. Proposed approach can be applied to study similar cases of collision such as ship collision to bridge piers, projectile collision into concrete walls and develop adequate models.", "paper_title": "Performance-Based Probabilistic Capacity Models and Fragility Estimates for RC Columns Subject to Vehicle Collision", "paper_id": "WOS:000356620500005"}