{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_networks"}, {"score": 0.006657156071475314, "phrase": "single-relational_networks"}, {"score": 0.004661446705304497, "phrase": "shortest_path"}, {"score": 0.004537254814246843, "phrase": "connected_network"}, {"score": 0.0030414140732789186, "phrase": "edge_labels"}, {"score": 0.0025717903093338823, "phrase": "rdf"}, {"score": 0.0024628046987344846, "phrase": "discrete_\"walker"}, {"score": 0.002410058288617039, "phrase": "abstract_path_description"}, {"score": 0.002246292543825748, "phrase": "grammar-based_model"}, {"score": 0.0022101055924375725, "phrase": "general_framework"}, {"score": 0.0021745003291048356, "phrase": "geodesic_metrics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Geodesics", " Network analysis", " Centrality", " Ranking", " RDF", " Semantic Web"], "paper_abstract": "A geodesic is the shortest path between two vertices in a connected network. The geodesic is the kernel of various network metrics including radius, diameter, eccentricity, closeness, and betweenness. These metrics are the foundation of much network research and thus, have been studied extensively in the domain of single-relational networks (both in their directed and undirected forms). However, geodesics for single-relational networks do not translate directly to multi-relational, or semantic networks, where vertices are connected to one another by any number of edge labels. Here, a more sophisticated method for calculating a geodesic is necessary. This article presents a technique for calculating geodesics in semantic networks with a focus on semantic networks represented according to the Resource Description Framework (RDF). In this framework, a discrete \"walker\" utilizes an abstract path description called a grammar to determine which paths to include in its geodesic calculation. The grammar-based model forms a general framework for studying geodesic metrics in semantic networks. Published by Elsevier B.V.", "paper_title": "Grammar-based geodesics in semantic networks", "paper_id": "WOS:000282208200012"}