{"auto_keywords": [{"score": 0.050070056218378914, "phrase": "automatic_tweet_generation"}, {"score": 0.04892145033263883, "phrase": "text_summarization_perspective"}, {"score": 0.04843687924734412, "phrase": "journalism_genre"}, {"score": 0.04764745285725158, "phrase": "twitter"}, {"score": 0.004132743580000062, "phrase": "real_time"}, {"score": 0.003571591012750155, "phrase": "multi-lingual_tweets"}, {"score": 0.0035103080903444114, "phrase": "english"}, {"score": 0.0034376160364306637, "phrase": "wide_experimental_framework"}, {"score": 0.0033317342432676385, "phrase": "new_corpus"}, {"score": 0.0032629585038738856, "phrase": "automatic_tweets"}, {"score": 0.0031514627590375354, "phrase": "qualitative_evaluation"}, {"score": 0.003054367741379269, "phrase": "key_criteria"}, {"score": 0.002980916123365584, "phrase": "proposed_context"}, {"score": 0.002849146732780381, "phrase": "original_tweets"}, {"score": 0.0028097829999199596, "phrase": "model_tweets"}, {"score": 0.0026762323224804197, "phrase": "human_viewpoint"}, {"score": 0.0025578967205807843, "phrase": "ideal_way"}, {"score": 0.002344800544183559, "phrase": "recent_text_summarization_techniques"}, {"score": 0.002149418970824546, "phrase": "news_providers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Generation", " Twitter", " Automatic tweet generation", " Text summarization", " Informativeness", " Indicativeness", " Interest"], "paper_abstract": "In recent years, Twitter has become one of the most important microblogging services of the Web 2.0. Among the possible uses it allows, it can be employed for communicating and broadcasting information in real time. The goal of this research is to analyze the task of automatic tweet generation from a text summarization perspective in the context of the journalism genre. To achieve this, different state-of-the-art summarizers are selected and employed for producing multi-lingual tweets in two languages (English and Spanish). A wide experimental framework is proposed, comprising the creation of a new corpus, the generation of the automatic tweets, and their assessment through a quantitative and a qualitative evaluation, where informativeness, indicativeness and interest are key criteria that should be ensured in the proposed context. From the results obtained, it was observed that although the original tweets were considered as model tweets with respect to their informativeness, they were not among the most interesting ones from a human viewpoint. Therefore, relying only on these tweets may not be the ideal way to communicate news through Twitter, especially if a more personalized and catchy way of reporting news wants to be performed. In contrast, we showed that recent text summarization techniques may be more appropriate, reflecting a balance between indicativeness and interest, even if their content was different from the tweets delivered by the news providers. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Towards automatic tweet generation: A comparative study from the text summarization perspective in the journalism genre", "paper_id": "WOS:000322857200036"}