{"auto_keywords": [{"score": 0.04799876771892715, "phrase": "team_member_satisfaction"}, {"score": 0.009573466137495776, "phrase": "original_study"}, {"score": 0.007058686122573932, "phrase": "developed_software"}, {"score": 0.006000101188882783, "phrase": "significant_correlation"}, {"score": 0.0059559264620717535, "phrase": "extroversion_personality_factor"}, {"score": 0.00481495049065317, "phrase": "software_development"}, {"score": 0.004709256047377171, "phrase": "quasi-experimental_study"}, {"score": 0.004663025022394783, "phrase": "team_climate_influence_software_development_team_effectiveness"}, {"score": 0.004482574869071422, "phrase": "original_quasi-experimental_study"}, {"score": 0.004384144362375153, "phrase": "academic_setting"}, {"score": 0.004152502093643003, "phrase": "extreme_programming"}, {"score": 0.004091470081068494, "phrase": "academic_environment"}, {"score": 0.003837156542817238, "phrase": "student_teams"}, {"score": 0.003808845109556467, "phrase": "common_object-oriented_software_development_paradigm"}, {"score": 0.003572035685714202, "phrase": "quasi-experimental_conditions"}, {"score": 0.0035021664178919005, "phrase": "empirical_study"}, {"score": 0.0034336590884097495, "phrase": "original_quasi-experiment"}, {"score": 0.0033664873319204027, "phrase": "personality_factors"}, {"score": 0.0029974860223022626, "phrase": "team_vision"}, {"score": 0.002982711420329541, "phrase": "task_orientation"}, {"score": 0.0026165739557191875, "phrase": "team_satisfaction"}, {"score": 0.002552695435015915, "phrase": "team_climate"}, {"score": 0.002540107619260803, "phrase": "participative_safety"}, {"score": 0.0025027144548626975, "phrase": "better_quality_software"}, {"score": 0.002478091235996559, "phrase": "significant_relationships"}, {"score": 0.0023819914954155905, "phrase": "positive_relationship"}, {"score": 0.002370243452208976, "phrase": "software_quality"}, {"score": 0.00233534501966908, "phrase": "real_climate_perception"}, {"score": 0.00228395623203611, "phrase": "team_members"}, {"score": 0.0022336957123481036, "phrase": "participative_safety_factor"}, {"score": 0.00217914399056098, "phrase": "real_climate"}, {"score": 0.002152368701947456, "phrase": "stated_preferences"}, {"score": 0.0021364613650251786, "phrase": "team_orientation_factor"}, {"score": 0.002120671343314006, "phrase": "direct_and_positive_relationship"}, {"score": 0.0021049977753042253, "phrase": "member_satisfaction"}], "paper_keywords": ["Personality factors", " Team climate", " Software quality", " Team satisfaction", " Team building", " Quasi-experimental replication"], "paper_abstract": "This article reports a replication of a quasi-experimental study analyzing how personality factors and team climate influence software development team effectiveness, product quality and team member satisfaction. The replication was designed on the basis of the original quasi-experimental study, both of which were run in an academic setting. In the original study, data were collected from a sample of 35 three-member developer teams. All these teams used an adaptation of extreme programming (XP) to the academic environment to develop the same software system. In the replication, the data were collected from a sample of 34 three- or four-member developer teams working on the same software project. Student teams used a common object-oriented software development paradigm to solve the set problem and applied the Unified Process. In both studies all teams were formed at random, and their members were blind to the quasi-experimental conditions and hypotheses. The replication of this empirical study aims to verify the results of the original quasi-experiment. It examines, first, whether personality factors (neuroticism, extroversion, agreeableness, openness to experience and conscientiousness) are related to the quality of the developed software and team member satisfaction and, second, whether the preferences, perceptions and preferences-perceptions fit for the four team climate factors (participative safety, support for innovation, team vision and task orientation) are related to the quality of the developed software and team member satisfaction. The results of the replication corroborate some of the findings of the original study. On the one hand, the results revealed that there is a significant correlation between the extroversion personality factor and software quality, but no significant correlation between the extroversion personality factor and team satisfaction. Also, we found that the perception of team climate where participative safety is high is related to better quality software. We observed significant relationships between the perception of the four team climate factors and team member satisfaction. Additionally, the results showed a positive relationship between software quality and teams in which the real climate perception at the end of the project is better than preferences stated by team members at the outset of the project for the participative safety factor. Finally, we found that teams where the real climate is better than the stated preferences for the team orientation factor exhibit a direct and positive relationship to team member satisfaction.", "paper_title": "A replicated quasi-experimental study on the influence of personality and team climate in software development", "paper_id": "WOS:000333013100004"}