{"auto_keywords": [{"score": 0.03774414736521044, "phrase": "ncpro-seq_pipeline"}, {"score": 0.00481495049065317, "phrase": "srna-seq_data"}, {"score": 0.004524348699657099, "phrase": "small_rna"}, {"score": 0.003949508242904001, "phrase": "annotated_non-coding_regions"}, {"score": 0.0038610405980907194, "phrase": "rfam"}, {"score": 0.003817548980308163, "phrase": "repeatmasker"}, {"score": 0.0037109446302945903, "phrase": "specific_regions"}, {"score": 0.003526476304712492, "phrase": "gene-based_and_family-based_analyses"}, {"score": 0.003239114833599948, "phrase": "short_reads"}, {"score": 0.0030955250132409964, "phrase": "known_ncrna_families"}, {"score": 0.0027170943110836425, "phrase": "color_space_format"}, {"score": 0.0025965853546625352, "phrase": "bamformat"}, {"score": 0.0021049977753042253, "phrase": "sequenced_genome"}], "paper_keywords": [""], "paper_abstract": "Non-coding RNA (ncRNA) PROfiling in small RNA (sRNA)-seq (ncPRO-seq) is a stand-alone, comprehensive and flexible ncRNA analysis pipeline. It can interrogate and perform detailed profiling analysis on sRNAs derived from annotated non-coding regions in miRBase, Rfam and RepeatMasker, as well as specific regions defined by users. The ncPRO-seq pipeline performs both gene-based and family-based analyses of sRNAs. It also has a module to identify regions significantly enriched with short reads, which cannot be classified under known ncRNA families, thus enabling the discovery of previously unknown ncRNA-or small interfering RNA (siRNA)-producing regions. The ncPRO-seq pipeline supports input read sequences in fastq, fasta and color space format, as well as alignment results in BAMformat, meaning that sRNA raw data from the three current major platforms (Roche-454, Illumina-Solexa and Life technologies-SOLiD) can be analyzed with this pipeline. The ncPRO-seq pipeline can be used to analyze read and alignment data, based on any sequenced genome, including mammals and plants.", "paper_title": "ncPRO-seq: a tool for annotation and profiling of ncRNAs in sRNA-seq data", "paper_id": "WOS:000311902700022"}