{"auto_keywords": [{"score": 0.02864039936811681, "phrase": "bargaining"}, {"score": 0.00481495049065317, "phrase": "bilateral_contracts"}, {"score": 0.004577869668211548, "phrase": "multi_agent_market"}, {"score": 0.004312622975366676, "phrase": "trading_commodity"}, {"score": 0.004273196830970426, "phrase": "fuzzy_linguistic_terms"}, {"score": 0.004214729542986473, "phrase": "negotiation_process"}, {"score": 0.004025531820226182, "phrase": "new_soft-bargaining_protocol"}, {"score": 0.0037402558657576124, "phrase": "different_attributes"}, {"score": 0.003689053436223376, "phrase": "multi-dimensional_membership_functions"}, {"score": 0.0031845067058084583, "phrase": "maximum_degree"}, {"score": 0.002851790448644913, "phrase": "attribute_space"}, {"score": 0.0026373136897864763, "phrase": "incomplete_information"}, {"score": 0.0026011706232569316, "phrase": "agents'_attitudes"}, {"score": 0.0025071862539276283, "phrase": "maximum_degrees"}, {"score": 0.002427732996314194, "phrase": "double-blind_mediating_software"}, {"score": 0.002276283303864666, "phrase": "best_matching_opponent"}, {"score": 0.0021940118003312397, "phrase": "case_study"}, {"score": 0.002163930783583212, "phrase": "energy_market"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Negotiation", " Bargaining", " Multi-agent systems", " Multi-artribute negotiation", " Fuzzy sets"], "paper_abstract": "In this paper, an agent-based simultaneous negotiation method for bilateral contracts in a multi agent market is proposed. Each agent has a representation of its desired attributes for a trading commodity using fuzzy linguistic terms. The negotiation process begins between every buyer and its potential sellers simultaneously through a new soft-bargaining protocol. This method offers flexibility for the agents to represent their satisfaction for the combinations of different attributes using a multi-dimensional membership functions (MDMFs), taking into account the interdependencies between the attributes. For each pair of buyer and seller at each step of negotiation, a point that has the maximum degree of agreement in the intersection of MDMFs is a candidate for agreement. During the negotiation, the agents adjust their satisfaction membership degrees on the attribute space as well as their acceptance thresholds to increase the chance of agreement, Bargaining is carried out under incomplete information, keeping agents' attitudes private. Every buyer/seller simultaneously receives the maximum degrees of agreement with other opponents through a double-blind mediating software, and then it checks them against its acceptance threshold in order to choose the best matching opponent for signing the contract. Through a case study for an energy market, the capabilities of the proposed method are illustrated. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A simultaneous multi-attribute soft-bargaining design for bilateral contracts", "paper_id": "WOS:000263584100030"}