{"auto_keywords": [{"score": 0.04014571756494075, "phrase": "memetic_reproduction"}, {"score": 0.027084146457518735, "phrase": "meme_populations"}, {"score": 0.00481495049065317, "phrase": "simple_'words"}, {"score": 0.004701556483912018, "phrase": "alarm_calls"}, {"score": 0.004377077848734575, "phrase": "dangerous_or_safe_situations"}, {"score": 0.004206548500039536, "phrase": "different_genetic_strategies"}, {"score": 0.003674738405118697, "phrase": "competing_fitness_criteria"}, {"score": 0.0036167509502276294, "phrase": "faithful_communication"}, {"score": 0.0032614317990293695, "phrase": "alarm-call_context"}, {"score": 0.0030847461428168614, "phrase": "communication_strategies"}, {"score": 0.0030602966787192745, "phrase": "favoured_replication"}, {"score": 0.002694375425481759, "phrase": "selective_memorization"}, {"score": 0.0024488738006005133, "phrase": "parsimonious_proto-language"}, {"score": 0.0023532890136269986, "phrase": "power_law_distribution"}], "paper_keywords": ["Language evolution", " Meme populations", " Communication", " Cooperation", " Agent strategies"], "paper_abstract": "An investigation into the evolution of proto-languages is described, exploring the emergence of the meaning of simple 'words' or alarm calls via the association between memes and four different contexts representing dangerous or safe situations. Agents were given different genetic strategies for interpreting, memorizing and imitating memes. The process of memetic reproduction over 50 generations was simulated with competing fitness criteria rewarding faithful communication by trust, counteracted by the risk of sending messages in an alarm-call context. The results showed that selection for communication strategies favoured replication of more frequently used memes when risk was high or more reliable messages when trust was rewarded. Selective memorization of only dangerous messages was also favoured. Meme populations emerged that provided a parsimonious proto-language for communicating more critical contexts. Power law distribution in meme populations associated only a small number of memes with the contexts, hence naturally creating more reliable communication. The implications for the evolution of memetic reproduction and proto-languages are discussed.", "paper_title": "Memetic evolution in the development of proto-language", "paper_id": "WOS:000343289700002"}