{"auto_keywords": [{"score": 0.048074574415830844, "phrase": "scientific_networks"}, {"score": 0.04413191474762542, "phrase": "sci"}, {"score": 0.023818931353987948, "phrase": "isi_classification_scheme"}, {"score": 0.00481495049065317, "phrase": "scientific_networks_using_aggregated_journal-journal_citation_relations"}, {"score": 0.004536244367689415, "phrase": "aggregated_journal-journal_citation_relations"}, {"score": 0.004421770937919324, "phrase": "affinity_propagation_method"}, {"score": 0.004183521217301052, "phrase": "ssci"}, {"score": 0.004112812699639956, "phrase": "intracategory_journal-journal"}, {"score": 0.0037128955884188773, "phrase": "cutoff_parameter"}, {"score": 0.0036037265181631324, "phrase": "maximal_j-j_distance"}, {"score": 0.0034828730516958807, "phrase": "sci_journals"}, {"score": 0.003394891095032025, "phrase": "different_resolution"}, {"score": 0.0033232673019931206, "phrase": "proper_values"}, {"score": 0.0032950412841674026, "phrase": "t._twenty_journal_categories"}, {"score": 0.0027194778713860715, "phrase": "average_distance"}, {"score": 0.002572709810193776, "phrase": "category_members"}], "paper_keywords": [""], "paper_abstract": "I propose an approach to classifying scientific networks in terms of aggregated journal-journal citation relations of the ISI Journal Citation Reports using the affinity propagation method. This algorithm is applied to obtain the classification of SCI and SSCI journals by minimizing intracategory journal-journal (J-J) distances in the database, where distance between journals is calculated from the similarity of their annual citation patterns with a cutoff parameter, t, to restrain the maximal J-J distance. As demonstrated in the classification of SCI journals, classification of scientific networks with different resolution is possible by choosing proper values of t. Twenty journal categories in SCI are found to be stable despite a difference of an order of magnitude in L In our classifications, the level of specificity of a category can be found by looking at its value Of (D) over bar (RJ) (the average distance of members of a category to its representative journal), and relatedness of category members is implied by the value of (D) over bar (J-J) (the average J-J distance within a category). Our results are consistent with the ISI classification scheme, and the level of relatedness for most categories in our classification is higher than their counterpart in the ISI classification scheme.", "paper_title": "Classification of Scientific Networks Using Aggregated Journal-Journal Citation Relations in the Journal Citation Reports", "paper_id": "WOS:000261392000009"}