{"auto_keywords": [{"score": 0.04971075098097409, "phrase": "community_detection"}, {"score": 0.014124625636223555, "phrase": "prior_information"}, {"score": 0.01318459025999373, "phrase": "running_time"}, {"score": 0.00481495049065317, "phrase": "big_graphs"}, {"score": 0.004722898398399427, "phrase": "common_problem"}, {"score": 0.004650519511749445, "phrase": "complex_networks"}, {"score": 0.004544016163767266, "phrase": "large_scale_real_networks"}, {"score": 0.004422827355213055, "phrase": "new_technology_challenges"}, {"score": 0.004388796812234033, "phrase": "extremely_large_computational_cost"}, {"score": 0.004173865018011237, "phrase": "new_challenges"}, {"score": 0.0032216622984027558, "phrase": "vertex_connection"}, {"score": 0.003087500254099842, "phrase": "novel_parallel_computing_community_detection_algorithm"}, {"score": 0.002993439939273828, "phrase": "true_sense"}, {"score": 0.0028576796380512157, "phrase": "multiple_independent_random_walks"}, {"score": 0.0027813397260607487, "phrase": "community_detecting"}, {"score": 0.0027492483892113, "phrase": "time_complexity"}, {"score": 0.0025054621733192283, "phrase": "novelty_graph_partition_model"}, {"score": 0.002391779843744166, "phrase": "community_structure"}, {"score": 0.002364172626241202, "phrase": "overlapping_parts"}, {"score": 0.0021544587602892466, "phrase": "big_graph_era"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Community detection", " Complex networks", " Social networks", " Random walking", " Parallel computing"], "paper_abstract": "Community detection is a common problem in various types of complex networks. With the emerging of large scale real networks like social networks, community detection meets new technology challenges of extremely large computational cost and lack of prior information. Although several literatures recently try to solve these new challenges, they still have limitations of parallelism and running time. With the scale of data increases sharply, the parallelism is necessary but few codes exist. In this work, we analyze the process of random walking in graphs, and observe that the weight of an edge gotten by processing the vertices visited by the walker could be an indicator to measure the closeness of vertex connection. Based on this finding, we first propose a novel parallel computing community detection algorithm for big unweighted undirected graphs in the true sense. The algorithm consists of three steps, including random walking using multiple independent random walks, weight calculating for edges and community detecting. The time complexity of our algorithm is O (n log n) without prior information. In order to implement our parallel computing algorithm efficiently, we also propose a novelty graph partition model. Experimental results show that our algorithm is capable of detecting the community structure and the overlapping parts of communities in real-world effectively (reduce the running time by 400 times at least), and handling the challenges of community detection in big graph era. (C) 2016 Elsevier Ltd. All rights reserved.", "paper_title": "MIRACLE: A multiple independent random walks community parallel detection algorithm for big graphs", "paper_id": "WOS:000378667000005"}