{"auto_keywords": [{"score": 0.015719716506582524, "phrase": "external_factors"}, {"score": 0.015573597099571257, "phrase": "intention-behaviour_gap"}, {"score": 0.0071132029010433735, "phrase": "entrepreneurs'_use"}, {"score": 0.004658426838467567, "phrase": "intentional_behaviour"}, {"score": 0.0041987222897385676, "phrase": "new_variables"}, {"score": 0.0039114753002009485, "phrase": "actual_behaviour"}, {"score": 0.003820144626025562, "phrase": "entrepreneurship_context"}, {"score": 0.0036958398682001015, "phrase": "promising_factor"}, {"score": 0.003015950477134494, "phrase": "malaysian_industries"}, {"score": 0.0027567336518542858, "phrase": "research_model"}, {"score": 0.0026922926476971453, "phrase": "structural_equation"}, {"score": 0.0025316905609748135, "phrase": "significant_positive_influence"}, {"score": 0.00240328454980006, "phrase": "precipitating_events"}, {"score": 0.002281376328251423, "phrase": "low_or_moderate_level"}, {"score": 0.0021049977753042253, "phrase": "high_level"}], "paper_keywords": ["IT adoption", " technology acceptance", " intention-behaviour gap"], "paper_abstract": "Although many theories explain intentional behaviour, there are some limitations between intention and behaviour that have been labelled the intention-behaviour gap. This study seeks to find new variables to overcome the limitations and understand the mechanics of how behavioural intention leads to actual behaviour. Research on the entrepreneurship context has identified precipitating events as a promising factor to overcome such limitations. Precipitating events are able to capture the effect of external factors that can potentially impede or facilitate the performance of behaviour and influence IT innovation adoption by entrepreneurs. The data used to test the hypothesis are collected from various spectrums of Malaysian industries. A total of 1000 businesses were identified and the authors personally distributed questionnaires with 351 completed questionnaires returned. The research model was applied using the structural equation modelling technique. The results show that intention to use has a significant positive influence on the use of IT innovation. The results show that precipitating events moderate the relationship between intentions and use behaviour. A low or moderate level of precipitating events (positive or negative) will increase entrepreneurs' use of IT innovation, while a high level of precipitating events will decrease entrepreneurs' use of IT innovation.", "paper_title": "Effect of external factors on intention-behaviour gap", "paper_id": "WOS:000363750500005"}