{"auto_keywords": [{"score": 0.04922330296681035, "phrase": "quantum_finite_automata"}, {"score": 0.04376526622401103, "phrase": "trace-preserving_quantum_operation"}, {"score": 0.030652305901470167, "phrase": "bounded_error"}, {"score": 0.00481495049065317, "phrase": "unitary_transformations"}, {"score": 0.0047631192993526465, "phrase": "computational_power"}, {"score": 0.004528488165249491, "phrase": "generalized_model"}, {"score": 0.004228359613476549, "phrase": "input_alphabet"}, {"score": 0.0041079938275505575, "phrase": "unitary_transformation"}, {"score": 0.003367939885018247, "phrase": "similar_measurement"}, {"score": 0.0032601856292942106, "phrase": "input_symbol"}, {"score": 0.002821371992763293, "phrase": "regular_languages"}, {"score": 0.0025682543875086934, "phrase": "non-regular_languages"}, {"score": 0.0023718560142554634, "phrase": "sharp_contrast"}, {"score": 0.002198380879018061, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Formal languages", " Quantum finite automata", " Regular languages", " Equivalence"], "paper_abstract": "Generally, unitary transformations limit the computational power of quantum finite automata (QFA). In this paper, we study a generalized model named one-way general quantum finite automata (1gQFA), in which each symbol in the input alphabet induces a trace-preserving quantum operation, instead of a unitary transformation. Two different kinds of 1gQFA will be studied: measure-once one-way general quantum finite automata (MO-1gQFA) where a measurement deciding to accept or reject is performed at the end of a computation, and measure-many one-way general quantum finite automata (MM-1gQFA) where a similar measurement is performed after each trace-preserving quantum operation on reading each input symbol. We characterize the measure-once model from three aspects: the closure property, the language recognition power, and the equivalence problem. We prove that MO-1gQFA recognize, with bounded error, precisely the set of all regular languages. Our results imply that some models of quantum finite automata proposed in the literature, which were expected to be more powerful, still cannot recognize non-regular languages. We prove that MM-1gQFA also recognize only regular languages with bounded error. Thus, MM-1gQFA and MO-1gQFA have the same language recognition power, in sharp contrast with traditional MO-1QFA and MM-1QFA, the former being strictly less powerful than the latter. Finally, we present a necessary and sufficient condition for two MM-1gQFA to be equivalent. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Characterizations of one-way general quantum finite automata", "paper_id": "WOS:000300534900006"}