{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "k-word_matches"}, {"score": 0.0045726187330434025, "phrase": "alignment-free_sequence_comparison_method"}, {"score": 0.003956784357357341, "phrase": "alignment-based_methods"}, {"score": 0.0037769520261285872, "phrase": "homologous_segments"}, {"score": 0.0032848684681050745, "phrase": "existing_applications"}, {"score": 0.003151736708029235, "phrase": "related_sequences"}, {"score": 0.0031193028729331667, "phrase": "large_est_databases"}, {"score": 0.0030554300179552415, "phrase": "stack_database"}, {"score": 0.0029013950320185573, "phrase": "statistical_basis"}, {"score": 0.0028715299874549245, "phrase": "rigorous_statistical_characterisations"}, {"score": 0.002643386043540555, "phrase": "distribution's_asymptotic_behaviour"}, {"score": 0.0021714122348552747, "phrase": "biological_sequences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Alignment-free sequence comparison", " Biological sequences", " Genomic data"], "paper_abstract": "This study focuses on an alignment-free sequence Comparison method: the number of words of length k shared between two sequences, also known as the D-2 statistic. The advantages of the use of this statistic over alignment-based methods are firstly that it does not assume that homologous segments are contiguous, and secondly that the algorithm is computationally extremely fast, the runtime being proportional to the size of the sequence under scrutiny. Existing applications of the D-2 statistic include the clustering of related sequences in large EST databases such as the STACK database. Such applications have typically relied on heuristics without any statistical basis. Rigorous statistical characterisations of the distribution of D-2 have subsequently been undertaken, but have focussed on the distribution's asymptotic behaviour, leaving the distribution of D-2 uncharacterised for most practical cases. The work presented here bridges these two worlds to give usable approximations of the distribution of D-2 for ranges of parameters most frequently encountered in the study of biological sequences. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Empirical distribution of k-word matches in biological sequences", "paper_id": "WOS:000262917700006"}