{"auto_keywords": [{"score": 0.041612822961875004, "phrase": "minishogi"}, {"score": 0.03751951230806167, "phrase": "intuitive_problems"}, {"score": 0.008162397695875283, "phrase": "possible_moves"}, {"score": 0.00481495049065317, "phrase": "cognitive_processes"}, {"score": 0.004466519142879166, "phrase": "fmri_technology"}, {"score": 0.004278807087784626, "phrase": "gaze_measurements"}, {"score": 0.004143196873246147, "phrase": "cognitive_processing"}, {"score": 0.0038846843242954935, "phrase": "subjects'_performance"}, {"score": 0.0036422425344358037, "phrase": "final_tournament"}, {"score": 0.0035078427258024613, "phrase": "low-scoring_group"}, {"score": 0.003451766520526601, "phrase": "poorer_performance"}, {"score": 0.003342280102112269, "phrase": "caudate_nucleus"}, {"score": 0.003066945490483524, "phrase": "large_caudate_nuclei"}, {"score": 0.002937879003671346, "phrase": "early_stages"}, {"score": 0.0028293966058473476, "phrase": "caudate_nucleus_size"}, {"score": 0.0025962029048520324, "phrase": "better_results"}, {"score": 0.0022941723937662927, "phrase": "good_progress"}], "paper_keywords": [""], "paper_abstract": "In this study, we used fMRI technology, cognitive self-reporting, and gaze measurements to examine the changes in cognitive processing while people develop proficiency at the game Minishogi. We analyzed subjects' performance by placing them in either a high-scoring group that performed relatively well in the final tournament and in answering intuitive problems or a low-scoring group that showed poorer performance. Our results show that the caudate nucleus was activated when subjects proficient at Minishogi answered intuitive problems. In addition, people with large caudate nuclei were better at answering intuitive problems in the early stages of learning; however, the caudate nucleus size did not influence improvements in learning performance. As learning proceeded, the group with better results exhibited less gaze movement and required less time to recognize possible moves and decide on a move. Overall, the results suggested that people with good progress in learning Minishogi tend to require less time to recognize possible moves, show less gaze movement, anticipate more potential moves, and anticipate these moves more accurately.", "paper_title": "CHANGES IN COGNITIVE PROCESSES AND BRAIN ACTIVITY WHILE BECOMING PROFICIENT AT MINISHOGI", "paper_id": "WOS:000375007300003"}