{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "binary_fields"}, {"score": 0.033237329265761506, "phrase": "field_operations"}, {"score": 0.004651057147690674, "phrase": "hyperelliptic_curves"}, {"score": 0.004382913938427474, "phrase": "discrete_logarithm_problem"}, {"score": 0.004339744430169516, "phrase": "recent_developments"}, {"score": 0.004296998284839309, "phrase": "computational_technologies"}, {"score": 0.004254671386496732, "phrase": "scalar_multiplications"}, {"score": 0.004212759658511567, "phrase": "divisor_classes"}, {"score": 0.004069280130346136, "phrase": "hyperelliptic_curve_cryptosystems"}, {"score": 0.0038919354605673104, "phrase": "elliptic_curve_cryptosystems"}, {"score": 0.003778004256546193, "phrase": "short_operand_sizes"}, {"score": 0.0035954555250614197, "phrase": "embedded_processor_architectures"}, {"score": 0.003038066486989815, "phrase": "birational_transformations"}, {"score": 0.0027513507830537165, "phrase": "corresponding_explicit_formulae"}, {"score": 0.0026443691099806003, "phrase": "special_genus"}, {"score": 0.0023593563827190626, "phrase": "ten_field_multiplications"}, {"score": 0.002336071138145897, "phrase": "eleven_field_squarings"}, {"score": 0.002223039450439376, "phrase": "known_results"}], "paper_keywords": [""], "paper_abstract": "The ideal class groups of hyperelliptic curves (HECs) can be used in cryptosystems based on the discrete logarithm problem. Recent developments of computational technologies for scalar multiplications of divisor classes have shown that the performance of hyperelliptic curve cryptosystems (HECC) is compatible to that of elliptic curve cryptosystems. Especially, due to short operand sizes, genus 3 HECC are well suited for all kinds of embedded processor architectures, where resources such as storage, time or power are constrained. In the paper, the acceleration of the divisor class doubling for genus 3 HECs over binary fields is investigated and the number of field operations needed is analysed. By constructing birational transformations of variables, four types of curves which can lead to much faster divisor class doubling are found and the corresponding explicit formulae are given. In particular, for special genus 3 HECs over binary fields with h(X) = 1, the fastest explicit doubling formula published so far which only requires one field inversion, ten field multiplications and eleven field squarings, is obtained. Furthermore, comparisons with the known results in terms of field operations and implementations of genus 3 HECC over three different binary fields on a Pentium-4 processor are provided.", "paper_title": "Efficient explicit formulae for genus 3 hyperelliptic curve cryptosystems over binary fields", "paper_id": "WOS:000258955500004"}