{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "transaction_identification"}, {"score": 0.006728848133112697, "phrase": "use_cases"}, {"score": 0.004673805754655082, "phrase": "use_case_points"}, {"score": 0.004547176629543457, "phrase": "smallest_unit"}, {"score": 0.004323828252137777, "phrase": "ucp_method"}, {"score": 0.004294230219430314, "phrase": "use-case_transaction_identification"}, {"score": 0.00421628472045946, "phrase": "different_approaches"}, {"score": 0.00409261701335223, "phrase": "natural_language"}, {"score": 0.004009123646206068, "phrase": "functional_size_measurement"}, {"score": 0.0034623636688751367, "phrase": "similar_results"}, {"score": 0.00341508285454745, "phrase": "qualitative_analysis"}, {"score": 0.0033916842941333174, "phrase": "experiment_data"}, {"score": 0.003345365412288976, "phrase": "potential_problems"}, {"score": 0.003262078764268653, "phrase": "use-case_benchmark_specification"}, {"score": 0.0032249075614700817, "phrase": "automatic_methods"}, {"score": 0.003059284964048687, "phrase": "on-average_number"}, {"score": 0.0029626516852718572, "phrase": "significant_difference"}, {"score": 0.0029423438208689913, "phrase": "median_number"}, {"score": 0.0028888655097110394, "phrase": "different_methods"}, {"score": 0.0028233785401126136, "phrase": "significance_level"}, {"score": 0.002765706963477273, "phrase": "post-hoc_analysis"}, {"score": 0.002715430414238518, "phrase": "conover"}, {"score": 0.0026906349048881084, "phrase": "large_intra-method_variability"}, {"score": 0.0026417193856773874, "phrase": "maximum_and_minimum_number"}, {"score": 0.0025059724686541263, "phrase": "proposed_automatic_methods"}, {"score": 0.002415665703348571, "phrase": "functional_measurement_experts"}, {"score": 0.0022343995514836888, "phrase": "human-performed_transaction_identification"}, {"score": 0.002134179690164149, "phrase": "natural_language_processing_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Use-case transactions", " Use Case Points", " Functional size measurement", " Natural language processing"], "paper_abstract": "Context: The concept of transactions is used in Use Case Points (UCP), and in many other functional size measurement methods, to capture the smallest unit of functionality that should be considered while measuring the size of a system. Unfortunately, in the case of the UCP method at least four methods for use-case transaction identification have been proposed so far. The different approaches to transaction identification and difficulties related to the analysis of requirements expressed in natural language can lead to problems in the reliability of functional size measurement. Objective: The goal of this study was to evaluate reliability of transaction identification in use cases (with the methods mentioned in the literature), analyze their weaknesses, and propose some means for their improvement. Method: A controlled experiment on a group of 120 students was performed to investigate if the methods for transaction identification, known from the literature, provide similar results. In addition, a qualitative analysis of the experiment data was performed to investigate the potential problems related to transaction identification in use cases. During the experiment a use-case benchmark specification was used. The automatic methods for transaction identification, proposed in the paper have been validated using the same benchmark by comparing the outcomes provided by these methods to on-average number of transactions identified by the participants of the experiment. Results: A significant difference in the median number of transactions was observed between groups using different methods of transaction identification. The Kruskal Wallis test was performed with the significance level alpha set to 0.05 and followed by the post-hoc analysis performed according to the procedure proposed by Conover. Also a large intra-method variability was observed. The ratios between the maximum and minimum number of transactions identified by the participants using the same method were equal to 1.96, 3.83, 2.03, and 2.21. The proposed automatic methods for transaction identification provided results consistent with those provided by the participants of the experiment and functional measurement experts. The relative error between the number of transaction identified by the tool and on-average number of transactions identified by the participants of the experiment ranged from 3% to 7%. Conclusions: Human-performed transaction identification is error prone and quite subjective. Its reliability can be improved by automating the process with the use of natural language processing techniques. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Improving the reliability of transaction identification in use cases", "paper_id": "WOS:000292176300007"}