{"auto_keywords": [{"score": 0.04489709945690732, "phrase": "minkowski_sum"}, {"score": 0.015368814258200454, "phrase": "normal_fans"}, {"score": 0.007363755841758019, "phrase": "normal_cones"}, {"score": 0.00481495049065317, "phrase": "minkowski_sums"}, {"score": 0.004496280772084575, "phrase": "geometric_tolerancing"}, {"score": 0.004103817210338686, "phrase": "intersection_operations"}, {"score": 0.00393852508392789, "phrase": "normal_fan"}, {"score": 0.003832031470970347, "phrase": "common_refinement"}, {"score": 0.0030771609361092164, "phrase": "basic_properties"}, {"score": 0.0028995712226514746, "phrase": "main_properties"}, {"score": 0.0028082176224611542, "phrase": "primal_cones"}, {"score": 0.002163600705898299, "phrase": "opencascade_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Minkowski sum", " Polytope", " Normal fan", " Geometric tolerancing"], "paper_abstract": "Prompted by the development of algorithms for analysing geometric tolerancing, this article describes a method to determine the Minkowski sum for 3-dimensional polytopes. This method is based exclusively on intersection operations on normal cones, using the properties of the normal fan of a Minkowski sum obtained by common refinement of the normal fans of the operands. It can be used to determine from which vertices of the operands the vertices of the Minkowski sum derive. It is also possible to determine to which facets of the operands each facet of the Minkowski sum is oriented. The basic properties of the algorithms can be applied to n-polytopes. First, the main properties of the duality of normal cones and primal cones associated with the vertices of a polytope are described. Next, the properties of normal fans are applied to define the vertices and facets of the Minkowski sum of two polytopes. An algorithm is proposed, which generalises the method. Lastly, there is a discussion of the features of this algorithm, developed using the OpenCascade environment. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Algorithm to calculate the Minkowski sums of 3-polytopes based on normal fans", "paper_id": "WOS:000299134900004"}