{"auto_keywords": [{"score": 0.04876221941883469, "phrase": "saicar_synthetase"}, {"score": 0.00481495049065317, "phrase": "molecular_dynamics_perspective"}, {"score": 0.004553725941602517, "phrase": "cair"}, {"score": 0.00427668019604069, "phrase": "atp."}, {"score": 0.004044534825749132, "phrase": "structural_aspects"}, {"score": 0.003946960862020283, "phrase": "dynamic_aspects"}, {"score": 0.0035795609511543023, "phrase": "saicar_synthetases"}, {"score": 0.003456777366713296, "phrase": "five_functional_dimers"}, {"score": 0.003373334961160647, "phrase": "molecular_dynamics"}, {"score": 0.0032548468579378215, "phrase": "k"}, {"score": 0.0031348622158167195, "phrase": "thermophilic_protein"}, {"score": 0.003102195256794215, "phrase": "basic_features"}, {"score": 0.003080606033950419, "phrase": "root-mean-square_deviations"}, {"score": 0.0030591665967282886, "phrase": "root-mean-square_fluctuations"}, {"score": 0.0027741761880779535, "phrase": "simulations_time"}, {"score": 0.0027166392914444023, "phrase": "long-distance_networks"}, {"score": 0.0026696020591118344, "phrase": "mesophilic_structures"}, {"score": 0.0026051114364288126, "phrase": "comparatively_higher_number"}, {"score": 0.0024721021985994115, "phrase": "hydrophobic_interactions"}, {"score": 0.002387214876538434, "phrase": "higher_percentage_existence_time"}, {"score": 0.0023133055945761235, "phrase": "time-averaged_salt-bridges"}, {"score": 0.0022260654608669593, "phrase": "surface_accessibility"}, {"score": 0.0021421082915443887, "phrase": "mesophilic_protein"}], "paper_keywords": [""], "paper_abstract": "The enzyme SAICAR synthetase ligates aspartate with CAIR (5'-phosphoribosyl-4-carboxy-5-aminoimidazole) forming SAICAR (5-amino-4-imidazole-N-succinocarboxamide ribonucleotide) in the presence of ATP. In continuation with our previous study on the thermostability of this enzyme in hyper-/thermophiles based on the structural aspects, here, we present the dynamic aspects that differentiate the mesophilic (E. coli, E. chaffeensis), thermophilic (G. kaustophilus), and hyperthermophilic (M. jannaschii, P. horikoshii) SAICAR synthetases by carrying out a total of 11 simulations. The five functional dimers from the above organisms were simulated using molecular dynamics for a period of 50 ns each at 300 K, 363 K, and an additional simulation at 333 K for the thermophilic protein. The basic features like root-mean-square deviations, root-mean-square fluctuations, surface accessibility, and radius of gyration revealed the instability of mesophiles at 363 K. Mean square displacements establish the reduced flexibility of hyper-/thermophiles at all temperatures. At the simulations time scale considered here, the long-distance networks are considerably affected in mesophilic structures at 363 K. In mesophiles, a comparatively higher number of short-lived (having less percent existence time) C alpha, hydrogen bonds, hydrophobic interactions are formed, and long-lived (with higher percentage existence time) contacts are lost. The number of time-averaged salt-bridges is at least 2-fold higher in hyperthermophiles at 363 K. The change in surface accessibility of salt-bridges at 363 K from 300 K is nearly doubled in mesophilic protein compared to proteins from other temperature classes.", "paper_title": "Molecular Dynamics Perspective on the Protein Thermal Stability: A Case Study Using SAICAR Synthetase", "paper_id": "WOS:000330097200023"}