{"auto_keywords": [{"score": 0.0494626972976494, "phrase": "unstructured_information"}, {"score": 0.009482338154461116, "phrase": "makes"}, {"score": 0.006377392715318537, "phrase": "knowledge_work"}, {"score": 0.004512814529823301, "phrase": "professional_services"}, {"score": 0.004440277230269978, "phrase": "conventional_way"}, {"score": 0.004298666679374568, "phrase": "associated_tasks"}, {"score": 0.004121275290411653, "phrase": "multiple_concepts"}, {"score": 0.0035732464638415307, "phrase": "multi-faceted_and_automatic_knowledge_elicitation_system"}, {"score": 0.00327356326590461, "phrase": "knowledge_flow"}, {"score": 0.00325238798404366, "phrase": "social_network_analysis"}, {"score": 0.0031485421129798996, "phrase": "connected_process"}, {"score": 0.003038125530190128, "phrase": "specific_search_criteria"}, {"score": 0.002931569771634119, "phrase": "knowledge_workers"}, {"score": 0.0028104345972072534, "phrase": "multi-facet_taxonomy_map"}, {"score": 0.0026768530320943063, "phrase": "incoming_unstructured_information"}, {"score": 0.0026423134393535265, "phrase": "purpose-built_knowledge_elicitation_algorithm"}, {"score": 0.0024601402359002056, "phrase": "successful_trial_implementation"}, {"score": 0.002436289099444074, "phrase": "verification_test"}, {"score": 0.0024048460326284416, "phrase": "electronics_trading_company"}, {"score": 0.002389276641014013, "phrase": "encouraging_results"}, {"score": 0.002327998222143962, "phrase": "potential_advantages"}, {"score": 0.002246292543825748, "phrase": "first_deployment"}, {"score": 0.0022101055924375725, "phrase": "email-intensive_organization"}, {"score": 0.0021886732310288128, "phrase": "proposed_study"}], "paper_keywords": ["Multi-facet", " Taxonomy", " Automatic", " Unstructured information", " Auditing", " Knowledge management", " Professional services", " Self-associated concept mapping", " Knowledge elicitation", " Knowledge mining"], "paper_abstract": "Management of unstructured information, such as emails, is vital for supporting knowledge work in professional services. However, the conventional way for managing unstructured information is inadequate as the knowledge work and associated tasks are becoming more complex, are dynamically changing with time and involve multiple concepts. This paper attempts to address the inadequacy, deficiency and limitations of the methods presently used to elicit knowledge from masses of unstructured information. These methods rely heavily on manpower, are time consuming and costly. With the development of a multi-faceted and automatic knowledge elicitation system (MAKES) manpower, time and cost can be dramatically reduced. The MAKES integrates the processes of collecting data, classifying unstructured information, modelling knowledge flow and social network analysis, and makes all of these actions into a connected process to audit unstructured information automatically. This audit is based on specific search criteria, search keywords, and the user behaviours of the knowledge workers. The unstructured information is automatically organized, classified and presented in a multi-facet taxonomy map. New concepts and knowledge are uncovered, analyzed and updated continuously from the incoming unstructured information, using a purpose-built knowledge elicitation algorithm named self-associated concept mapping (SACM). The capability and advantages of the MAKES are demonstrated through a successful trial implementation and a verification test conducted in an electronics trading company. Encouraging results have been achieved and a number of potential advantages have been realized. The area of application in this first deployment is based on an email-intensive organization and the proposed study will contribute to the advancement of methods and tools for managing other kinds of unstructured information. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A multi-faceted and automatic knowledge elicitation system (MAKES) for managing unstructured information", "paper_id": "WOS:000287419900066"}