{"auto_keywords": [{"score": 0.04228756662661977, "phrase": "error_rate"}, {"score": 0.022082695259271853, "phrase": "alice"}, {"score": 0.021895185828583914, "phrase": "bob"}, {"score": 0.010612387000973441, "phrase": "quantum_key_distribution"}, {"score": 0.010387788137391144, "phrase": "error_correction"}, {"score": 0.00978363258403814, "phrase": "different_keys"}, {"score": 0.009373522379963157, "phrase": "error_correction_protocol"}, {"score": 0.003799796252156605, "phrase": "acceptable_level"}, {"score": 0.003686935223424015, "phrase": "large_number"}, {"score": 0.003441352119167824, "phrase": "good_guess"}, {"score": 0.0029467742734417255, "phrase": "low-density_parity_check_codes"}, {"score": 0.002810292047426252, "phrase": "different_methods"}, {"score": 0.0025014259919355453, "phrase": "block_length"}, {"score": 0.0024061887405214186, "phrase": "idquantique_system"}, {"score": 0.0023245746777044766, "phrase": "key_rate"}, {"score": 0.0021883400011393564, "phrase": "large_fluctuations"}], "paper_keywords": [""], "paper_abstract": "The authors consider error correction in quantum key distribution. To avoid that Alice and Bob unwittingly end up with different keys, precautions must be taken. Before running the error correction protocol, Bob and Alice normally sacrifice some bits to estimate the error rate. To reduce the probability that they end up with different keys to an acceptable level, the authors show that a large number of bits must be sacrificed. Instead, if Alice and Bob can make a good guess about the error rate before the error correction, they can verify that their keys are similar after the error correction protocol. In this study, the authors show that this verification can be done by utilising properties of low-density parity check codes used in the error correction. The authors compare the different methods and show that by verification it is often possible to sacrifice less bits without compromising security. The improvement is heavily dependent on the error rate and the block length, but for a key produced by the IdQuantique system Clavis(2), the increase in the key rate is similar to 5%. The authors also show that for systems with large fluctuations in the error rate, a combination of the two methods is optimal.", "paper_title": "Error estimation, error correction and verification in quantum key distribution", "paper_id": "WOS:000340844700004"}