{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "probabilistic"}, {"score": 0.004570759604335229, "phrase": "discrete_probability_distributions"}, {"score": 0.004338898899247236, "phrase": "timed_randomised_protocols"}, {"score": 0.004282787299993434, "phrase": "fault-tolerant_systems"}, {"score": 0.004172722575842674, "phrase": "symbolic_model-checking_algorithms"}, {"score": 0.003960972732123083, "phrase": "qualitative_temporal_logic_properties"}, {"score": 0.0034999880739789257, "phrase": "arbitrary_probability"}, {"score": 0.003133052778244851, "phrase": "automaton's_clocks"}, {"score": 0.0027681550491613603, "phrase": "symbolic_framework"}, {"score": 0.002413964586947992, "phrase": "prototype_implementation"}, {"score": 0.002336527289457915, "phrase": "difference_bound_matrices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Probabilistic timed automata are timed automata extended with discrete probability distributions, and can be used to model timed randomised protocols or fault-tolerant systems. We present symbolic model-checking algorithms for probabilistic timed automata to verify both qualitative temporal logic properties, corresponding to satisfaction with probability 0 or 1, and quantitative properties, corresponding to satisfaction with arbitrary probability. The algorithms operate on zones, which represent sets of valuations of the probabilistic timed automaton's clocks. Our method considers only those system behaviours which guarantee the divergence of time with probability 1. The paper presents a symbolic framework for the verification of probabilistic timed automata against the probabilistic, timed temporal logic PTCTL. We also report on a prototype implementation of the algorithms using Difference Bound Matrices, and present the results of its application to the CSMA/CD and FireWire root contention protocol case studies. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Symbolic model checking for probabilistic timed automata", "paper_id": "WOS:000248105200004"}