{"auto_keywords": [{"score": 0.04269961316230683, "phrase": "scott_models"}, {"score": 0.00481495049065317, "phrase": "order-theoretic_models"}, {"score": 0.004683409019030069, "phrase": "scott"}, {"score": 0.004309434349688514, "phrase": "natural_completeness_problem"}, {"score": 0.0038998328617557013, "phrase": "analogous_consistency_problem"}, {"score": 0.003588291565092195, "phrase": "scott_model"}, {"score": 0.0034707339811048403, "phrase": "wider_sets"}, {"score": 0.0033945024593626675, "phrase": "wider_classes"}, {"score": 0.0029380909574836587, "phrase": "positive_result"}, {"score": 0.0025570607111118793, "phrase": "consistency_question"}, {"score": 0.0025008468316682036, "phrase": "equational_matrices"}, {"score": 0.00230080652063411, "phrase": "generalized_mal'cev_operators"}, {"score": 0.0021764016111761645, "phrase": "selinger"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["lambda-Calculus", " Domain theory", " Completeness", " Consistency", " Mal'cev operators"], "paper_abstract": "Scott discovered his domain-theoretic models of the lambda-calculus, isomorphic to their function space, in 1969. A natural completeness problem then arises: whether any two terms equal in all Scott models are convertible. There is also an analogous consistency problem: whether every equation between two terms, consistent with the lambda-calculus, has a Scott model. We consider such questions for wider sets of sentences and wider classes of models, the pointed (completely) partially ordered ones. A negative result for a set of sentences shows the impossibility of finding Scott models for that class; a positive result gives evidence that there might be enough Scott models. We find, for example, that the order-extensional pointed omega-cpo models are complete for Pi(1)-sentences with positive matrices, whereas the consistency question for Sigma(1)-sentences with equational matrices depends on the consistency of certain critical sentences asserting the existence of certain functions analogous to the generalized Mal'cev operators first considered in the context of the X-calculus by Selinger. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "On the completeness of order-theoretic models of the lambda-calculus", "paper_id": "WOS:000265648800004"}