{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "beta-saturated_pyrrolic_rings"}, {"score": 0.012592840584649097, "phrase": "lowest_energy_absorption_band"}, {"score": 0.011828956611090924, "phrase": "homo"}, {"score": 0.00964836831870468, "phrase": "mgpor"}, {"score": 0.00469500313566324, "phrase": "magnesium_porphyrin_derivatives"}, {"score": 0.004592491583367684, "phrase": "density_functional_theory"}, {"score": 0.0044922081848067135, "phrase": "molecular_structures"}, {"score": 0.004463958296056236, "phrase": "molecular_orbitals"}, {"score": 0.004435885269134359, "phrase": "electronic_absorption_spectra"}, {"score": 0.00439410494607959, "phrase": "magnetic_properties"}, {"score": 0.004366469287481091, "phrase": "magnesium_porphyrin"}, {"score": 0.0042576464476131205, "phrase": "five_hydrogenated_magnesium_porphyrin_complexes"}, {"score": 0.0037409118365761894, "phrase": "strong_chemical_stability"}, {"score": 0.0036591555008359884, "phrase": "energy_levels"}, {"score": 0.003636125247342626, "phrase": "highest_occupied_molecular_orbitals"}, {"score": 0.003276321257403678, "phrase": "porphyrin_ring"}, {"score": 0.0030854957471873785, "phrase": "homo_energy_increases"}, {"score": 0.00301801991152303, "phrase": "regular_manner"}, {"score": 0.0025526713533068793, "phrase": "natural_hydroporphyrins"}, {"score": 0.002396306027986643, "phrase": "good_accordance"}, {"score": 0.0022212306049833397, "phrase": "relatively_weak_aromaticity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Magnesium porphyrin", " Density functional theory", " beta-Saturated pyrrolic rings", " Electronic structure", " Aromaticity"], "paper_abstract": "Density functional theory (DFT) calculation on the molecular structures, molecular orbitals, electronic absorption spectra, and magnetic properties of magnesium porphyrin (MgPor) and a series of five hydrogenated magnesium porphyrin complexes with different number of beta-saturated pyrrolic rings, namely MgPor-beta-1Hy, MgPor-beta-opp-2Hy, MgPor-beta-adj-2Hy, MgPor-beta-3Hy, and MgPor-beta-4Hy, clarifies the red-shift of the lowest energy absorption band from chlorophyll a to bacteriochlorophyll and reveals the strong chemical stability for both of them. The energy levels of highest occupied molecular orbitals (HOMO) and HOMO-1 for MgPor are reversed upon hydrogenation at beta-positions (2 and 3, 7 and 8, 12 and 13, and 17 and 18) of porphyrin ring. Along with the increase of beta-saturated pyrrolic rings from I, 2, 3, to 4, the HOMO energy increases from -4.78 eV to -3.10 eV in a regular manner. In contrast, the lowest unoccupied molecular orbitals (LUMO) energy levels of MgPor, MgPor-beta-1Hy, and MgPor-beta-opp-2Hy are very similar with each other. As a result, the lowest energy absorption band involving main transition from HOMO to LUMO is red-shifted from MgPor-beta-1Hy to MgPor-beta-opp-2Hy which is representative of chlorophyll a and bacteriochlorophyll, respectively. Natural hydroporphyrins represented by MgPor, MgPor-beta-1 Hy, and MgPor-beta-opp-2Hy have turned out to be aromatic and stable enough, in good accordance with the ubiquity of their derivatives in the nature. In contrast, MgPor-beta-adj-2Hy. MgPor-beta-3Hy, and MgPor-beta-4Hy with relatively weak aromaticity seem to be unstable and therefore were not found in nature. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "The effect of beta-saturated pyrrolic rings on the electronic structures and aromaticity of magnesium porphyrin derivatives: A density functional study", "paper_id": "WOS:000297093600003"}