{"auto_keywords": [{"score": 0.0367698002611785, "phrase": "mobile_node"}, {"score": 0.0074104731551810485, "phrase": "multicast_session"}, {"score": 0.00481495049065317, "phrase": "mobile_multicast"}, {"score": 0.00450933377534525, "phrase": "multicast_data_packets"}, {"score": 0.004421471944783611, "phrase": "mobile_environment"}, {"score": 0.003980875186335867, "phrase": "new_secure_and_efficient_group"}, {"score": 0.003269266730193333, "phrase": "new_domain"}, {"score": 0.0028293966058473476, "phrase": "subsequent_data_packets"}, {"score": 0.00270221723573854, "phrase": "local_one-time_pad"}, {"score": 0.0025638362414466278, "phrase": "fi_sequences"}, {"score": 0.0022041312401435346, "phrase": "proposed_solution"}, {"score": 0.0021049977753042253, "phrase": "key_generations"}], "paper_keywords": ["Multicast", " Group key", " HMIPv6", " FI sequences", " One-time pad key"], "paper_abstract": "In order to securely transmit multicast data packets in a mobile environment where frequent join/leave events are a characteristic of the environment, there is a need for a new secure and efficient group key management solution. We propose a secure group key generation/distribution solution providing scalability and reliability. Using this solution, when a mobile node, which is in a multicast session, enters a new domain, the agent of the domain joins the multicast session and coordinates its data packets with the mobile node. The agent encrypts and transmits subsequent data packets to the mobile node, using a local one-time pad key. This key is generated with FI sequences, enabling the mobile node to regenerate the same data packet, based on the information sent by the agent. Our performance analysis demonstrates that the proposed solution can significantly reduce the number of key generations and distributions, when it is applied to the hierarchical mobile IPv6 network.", "paper_title": "FI-Based Local Group Key Generation/Distribution for Mobile Multicast in a Hierarchical Mobile IPv6 Network", "paper_id": "WOS:000270806600001"}