{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "schema_mappings"}, {"score": 0.007858170330917241, "phrase": "mapping_language"}, {"score": 0.00453531164565523, "phrase": "fundamental_operators"}, {"score": 0.004458426563932486, "phrase": "general_framework"}, {"score": 0.00443308765153716, "phrase": "metadata_management"}, {"score": 0.003559284776569813, "phrase": "fundamental_properties"}, {"score": 0.0030078460113945136, "phrase": "meaningful_mapping_language"}, {"score": 0.002690975370565776, "phrase": "-maximum_recovery"}, {"score": 0.0026604207233593973, "phrase": "query_language"}, {"score": 0.0026077803487003, "phrase": "inverse_mappings"}, {"score": 0.0024700776739384977, "phrase": "conjunctive_queries"}, {"score": 0.0023196699954340437, "phrase": "cq-maximum_recovery"}, {"score": 0.0022802596433757565, "phrase": "chase_procedure"}, {"score": 0.002178400923036365, "phrase": "inverse_notion"}], "paper_keywords": ["Inverses", " Schema mappings", " Metadata management", " Closure properties", " Conjunctive queries", " Data exchange", " Data integration"], "paper_abstract": "The inversion of schema mappings has been identified as one of the fundamental operators for the development of a general framework for metadata management. During the last few years, three alternative notions of inversion for schema mappings have been proposed (Fagin-inverse (Fagin, TODS 32(4), 25:1-25:53, 2007), quasi-inverse (Fagin et al., TODS 33(2), 11:1-11:52, 2008), and maximum recovery (Arenas et al., TODS 34(4), 22:1-22:48, 2009)). However, these notions lack some fundamental properties that limit their practical applicability: most of them are expressed in languages including features that are difficult to use in practice, some of these inverses are not guaranteed to exist for mappings specified with source-to-target tuple-generating dependencies (st-tgds), and it has been futile to search for a meaningful mapping language that is closed under any of these notions of inverse. In this paper, we develop a framework for the inversion of schema mappings that fulfills all of the above requirements. It is based on the notion of -maximum recovery, for a query language , a notion designed to generate inverse mappings that recover back only the information that can be retrieved with queries in . By focusing on the language of conjunctive queries (CQ), we are able to find a mapping language that contains the class of st-tgds, is closed under CQ-maximum recovery, and for which the chase procedure can be used to exchange data efficiently. Furthermore, we show that our choices of inverse notion and mapping language are optimal, in the sense that choosing a more expressive inverse operator or mapping language causes the loss of these properties.", "paper_title": "Query language-based inverses of schema mappings: semantics, computation, and closure properties", "paper_id": "WOS:000311406800004"}