{"auto_keywords": [{"score": 0.03598551497943862, "phrase": "conditional_capacity"}, {"score": 0.015719716506582538, "phrase": "noisy_channels"}, {"score": 0.004659951478263083, "phrase": "anonymity_protocols"}, {"score": 0.0045284072672385975, "phrase": "information-theoretic_sense"}, {"score": 0.0040547457801926425, "phrase": "moskowitz"}, {"score": 0.004021752478034828, "phrase": "newman"}, {"score": 0.003988901168289797, "phrase": "syverson"}, {"score": 0.003892126266260425, "phrase": "covert_channel"}, {"score": 0.003751331782523201, "phrase": "non-perfect_anonymity"}, {"score": 0.003277140908834426, "phrase": "natural_correspondence"}, {"score": 0.0030069962181403487, "phrase": "anonymity_protocol"}, {"score": 0.0027817658627604653, "phrase": "user's_identity"}, {"score": 0.002370794661629904, "phrase": "probabilistic_anonymity"}, {"score": 0.002157433262687853, "phrase": "model_checking"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "We consider a framework in which anonymity protocols are interpreted as noisy channels in the information-theoretic sense, and we explore the idea of using the notion of capacity as a measure of the loss of anonymity. Such idea was already suggested by Moskowitz, Newman and Syverson, in their analysis of the covert channel that can be created as a result of non-perfect anonymity. We consider the case in which some leak of information is intended by design, and we introduce the notion of conditional capacity to rule out this factor, thus retrieving a natural correspondence with the notion of anonymity. Furthermore, we show how to compute the capacity and the conditional capacity when the anonymity protocol satisfies certain symmetries. We also investigate how the adversary can test the system to try to infer the user's identity, and we study how his probability of success depends on the characteristics of the channel. We then illustrate how various notions of anonymity can be expressed in this framework, and show the relation with some definitions of probabilistic anonymity in literature. Finally, we show how to compute the matrix of the channel (and hence the capacity and conditional capacity) using model checking. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Anonymity protocols as noisy channels", "paper_id": "WOS:000255224500011"}