{"auto_keywords": [{"score": 0.043348022820026755, "phrase": "mi_simulation"}, {"score": 0.02468797792938335, "phrase": "eigenvalue_analysis"}, {"score": 0.007347841270446589, "phrase": "feedback_gain"}, {"score": 0.007152368807539886, "phrase": "linearized_error_dynamics"}, {"score": 0.006867254317106828, "phrase": "numerical_experiment"}, {"score": 0.006531512219858415, "phrase": "velocity_components"}, {"score": 0.005750785415413082, "phrase": "general_theory"}, {"score": 0.0047788144470247785, "phrase": "integrated_flow_simulation"}, {"score": 0.004754873823321114, "phrase": "experimental_measurement"}, {"score": 0.0047310525657970615, "phrase": "numerical_simulation"}, {"score": 0.004695543202451537, "phrase": "typical_methods"}, {"score": 0.004660299110035537, "phrase": "flow_analysis"}, {"score": 0.004487989502479992, "phrase": "real_flows"}, {"score": 0.004465499299203836, "phrase": "inherent_uncertainties"}, {"score": 0.004193661469720909, "phrase": "observer_theory"}, {"score": 0.004048696853049227, "phrase": "feedback_law"}, {"score": 0.003918559863308948, "phrase": "physical_considerations"}, {"score": 0.003707751244896586, "phrase": "fundamental_consideration"}, {"score": 0.0036066231834717545, "phrase": "linearized_error_dynamics_equation"}, {"score": 0.0035795229783795062, "phrase": "time_development"}, {"score": 0.003499433771969699, "phrase": "real_flow"}, {"score": 0.0034297437808422965, "phrase": "primary_advantage"}, {"score": 0.0034039681089687193, "phrase": "proposed_method"}, {"score": 0.0032779570262382366, "phrase": "standard_linear_dynamical_system_theory"}, {"score": 0.003085940127280456, "phrase": "low-order_model_problem"}, {"score": 0.0030320774892830878, "phrase": "square_duct"}, {"score": 0.0028544225287799865, "phrase": "error_dynamics"}, {"score": 0.002536027067134901, "phrase": "critical_feedback_gains"}, {"score": 0.0024854751276881535, "phrase": "lower_limit"}, {"score": 0.0024420674564756208, "phrase": "steady_error"}, {"score": 0.002345668721127675, "phrase": "error_norm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Measurement integrated flow simulation", " Eigenvalue analysis", " Error dynamics", " Feedback law"], "paper_abstract": "Experimental measurement and numerical simulation are the typical methods employed in flow analysis. Both methods have advantages and disadvantages and it is difficult to correctly reproduce real flows with inherent uncertainties. In order to overcome this problem, measurement-integrated (MI) simulation has been proposed in which measurement and simulation are integrated based on the observer theory. The validity of MI simulation has been proved in several applications. However the feedback law critical in MI simulation has been designed by trial and error based on physical considerations. Development of a general theory for the design of MI simulation is critical for its widespread use. In this study, as a fundamental consideration to construct a general theory of MI simulation, we formulated a linearized error dynamics equation to express time development of the error between the simulation and the real flow, and an equation for eigenvalue analysis. Primary advantage of the proposed method is to provide a framework to design a feedback gain of MI simulation based on a standard linear dynamical system theory. The validity of the method was investigated by comparison of the results of the eigenvalue analysis and those of the numerical experiment for the low-order model problem of the turbulent flow in a square duct with various feedback gains in the case of feedback with all velocity components and two velocity components. From the eigenvalue analysis in the case without feedback, the error dynamics was unstable and the error increased exponentially. When the feedback gain k(u) > 0.98 with feedback of all velocity components or k(u) > 1.67 with feedback of u(1). u(2) velocity components, all eigenvalues were stable. In the numerical experiment, the critical feedback gains obtained from eigenvalue analysis quantitatively agreed with the lower limit of the feedback gain to reduce the steady error in MI simulation. In the comparison of the time constant for the reduction of the error norm, the time constant obtained from the eigenvalue analysis agreed with those from the numerical experiment. The eigenvalue analysis of the linearized error dynamics formulated in this study was effective in evaluation of the effect of the feedback gain of the MI simulation. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Eigenvalue analysis of linearized error dynamics of measurement integrated flow simulation", "paper_id": "WOS:000282156000004"}