{"auto_keywords": [{"score": 0.04913322770523618, "phrase": "chile"}, {"score": 0.00481495049065317, "phrase": "neural_networks"}, {"score": 0.004663636232080366, "phrase": "new_earthquake_prediction_system"}, {"score": 0.004392565073466714, "phrase": "artificial_neural_networks"}, {"score": 0.004120694410890683, "phrase": "larger_seismic_activity"}, {"score": 0.00407161650109722, "phrase": "input_values"}, {"score": 0.003943569631183138, "phrase": "bath's_law"}, {"score": 0.0036262124965265015, "phrase": "solid_previous_works"}, {"score": 0.003334309053314909, "phrase": "threshold_value"}, {"score": 0.003190878119415192, "phrase": "limited_magnitude_interval"}, {"score": 0.002644179117033107, "phrase": "threshold_values"}, {"score": 0.0024214281919523973, "phrase": "retrospective_experiments"}, {"score": 0.002382987346529592, "phrase": "statistical_tests"}, {"score": 0.0023451553255837317, "phrase": "well-known_machine"}, {"score": 0.0022987068521717765, "phrase": "high_success_rate"}, {"score": 0.0022352169832099153, "phrase": "soft_computing"}, {"score": 0.0021821915946356168, "phrase": "new_challenges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Earthquake prediction", " Artificial neural networks", " Seismic risk", " Time series"], "paper_abstract": "A new earthquake prediction system is presented in this work. This method, based on the application of artificial neural networks, has been used to predict earthquakes in Chile, one of the countries with larger seismic activity. The input values are related to the b-value, the Bath's law, and the Omori-Utsu's law, parameters that are strongly correlated with seismicity, as shown in solid previous works. Two kind of prediction are provided in this study: The probability that an earthquake of magnitude larger than a threshold value happens, and the probability that an earthquake of a limited magnitude interval might occur, both during the next five days in the areas analyzed. For the four Chile's seismic regions examined, with epicenters placed on meshes with dimensions varying from 0.5 degrees x 0.5 degrees to 1 degrees x 1 degrees, a prototype of neuronal network is presented. The prototypes predict an earthquake every time the probability of an earthquake of magnitude larger than a threshold is sufficiently high. The threshold values have been adjusted with the aim of obtaining as few false positives as possible. The accuracy of the method has been assessed in retrospective experiments by means of statistical tests and compared with well-known machine learning classifiers. The high success rate achieved supports the suitability of applying soft computing in this field and poses new challenges to be addressed. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Neural networks to predict earthquakes in Chile", "paper_id": "WOS:000313011600048"}