{"auto_keywords": [{"score": 0.0047224703862074665, "phrase": "first_experimental_results"}, {"score": 0.004578165674080246, "phrase": "french_population"}, {"score": 0.00436989807912238, "phrase": "elderly_people"}, {"score": 0.003996727479807572, "phrase": "international_activities"}, {"score": 0.003965818535880531, "phrase": "daily_living"}, {"score": 0.003874512990986722, "phrase": "french_autonomie_gerontologie_groupes_iso-ressources"}, {"score": 0.003844545552246988, "phrase": "aggir"}, {"score": 0.003726967166630923, "phrase": "different_adl"}, {"score": 0.0035989687070420977, "phrase": "health_smart_home"}, {"score": 0.0029867619862229853, "phrase": "wearable_kinematic_sensor"}, {"score": 0.002952146666681891, "phrase": "postural_transitions"}, {"score": 0.002917931350071647, "phrase": "pattern_recognition"}, {"score": 0.0026788122684116224, "phrase": "temporal_frame"}, {"score": 0.0023380300046435187, "phrase": "support_vector_machines"}, {"score": 0.0022141537427057363, "phrase": "different_activities"}, {"score": 0.002154693685426657, "phrase": "classification_algorithm"}, {"score": 0.0021049977753042253, "phrase": "real_data"}], "paper_keywords": ["Activity of daily living (ADL)", " classification", " health smart home", " machine learning", " support vector machines (SVMs)"], "paper_abstract": "By 2050, about one third of the French population will be over 65. Our laboratory's current research focuses on the monitoring of elderly people at home, to detect a loss of autonomy as early as possible. Our aim is to quantify criteria such as the international activities of daily living (ADL) or the French Autonomie Gerontologie Groupes Iso-Ressources (AGGIR) scales, by automatically classifying the different ADL performed by the subject during the day. A Health Smart Home is used for this. Our Health Smart Home includes, in a real flat, infrared presence sensors (location), door contacts (to control the use of some facilities), temperature and hygrometry sensor in the bathroom, and microphones (sound classification and speech recognition). A wearable kinematic sensor also informs postural transitions (using pattern recognition) and walk periods (frequency analysis). This data collected from the various sensors are then used to classify each temporal frame into one of the ADL that was previously acquired (seven activities: hygiene, toilet use, eating, resting, sleeping, communication, and dressing/undressing). This is done using support vector machines. We performed a 1-h experimentation with 13 young and healthy subjects to determine the models of the different activities, and then we tested the classification algorithm (cross validation) with real data.", "paper_title": "SVM-Based Multimodal Classification of Activities of Daily Living in Health Smart Homes: Sensors, Algorithms, and First Experimental Results", "paper_id": "WOS:000275666100012"}