{"auto_keywords": [{"score": 0.02659249680527887, "phrase": "smart"}, {"score": 0.00481495049065317, "phrase": "bed-load_discharge_formulations"}, {"score": 0.004460703838987562, "phrase": "shallow-water_equations"}, {"score": 0.004397230847865867, "phrase": "exner_equation"}, {"score": 0.004313996835376177, "phrase": "morphological_evolution"}, {"score": 0.004132411680987228, "phrase": "well-proven_capacity_formulae"}, {"score": 0.003632080001489739, "phrase": "numerical_experimentation"}, {"score": 0.0033969001271637934, "phrase": "different_empirical_laws"}, {"score": 0.0033166379485150507, "phrase": "numerical_scheme"}, {"score": 0.003294071986953044, "phrase": "exner"}, {"score": 0.0021976915360493628, "phrase": "empirical_sediment_bed-load_discharge_formula"}, {"score": 0.0021049977753042253, "phrase": "hydrodynamic_situation"}], "paper_keywords": ["bed-load sediment transport", " Exner equation", " finite-volume method", " smart bed-load formulation", " two-dimensional shallow water"], "paper_abstract": "Two-dimensional (2D) transient flow over an erodible bed can be modelled using shallow-water equations and the Exner equation to describe the morphological evolution of the bed. Considering the fact that well-proven capacity formulae are based on one-dimensional (1D) experimental steady flows, the assessment of these empirical relations under unsteady 1D and 2D situations is important. In order to ensure the reliability of the numerical experimentation, the formulation has to be general enough to allow the use of different empirical laws. Moreover, the numerical scheme must handle correctly the coupling between the 2D shallow-water equations and the Exner equation under any condition. In this work, a finite-volume numerical scheme that includes these two main features will be exploited here in 1D and 2D laboratory test cases. The relative performances of Meyer-Peter and Ashida and Michiue, Engelund and Fredsoe, Fernandez Luque and Van Beek, Parker, Smart, Nielsen, Wong and Camenen and Larson formulations are analysed in terms of the root mean square error. A new discretization of the Smart formula is provided, leading to promising predictions of the erosion/deposition rates. The results arising from this work are useful to justify the use of an empirical sediment bed-load discharge formula among the ones studied, regardless of the hydrodynamic situation.", "paper_title": "Numerical assessment of bed-load discharge formulations for transient flow in 1D and 2D situations", "paper_id": "WOS:000326902800014"}