{"auto_keywords": [{"score": 0.046459681772617736, "phrase": "citation_analysis"}, {"score": 0.013388652208363891, "phrase": "evaluative_citation_analysis"}, {"score": 0.00481495049065317, "phrase": "mathematics_articles"}, {"score": 0.004764859786310636, "phrase": "explicit_definition"}, {"score": 0.004569630374630379, "phrase": "additional_tests"}, {"score": 0.0043367547691560175, "phrase": "citation_rankings"}, {"score": 0.00386519448487341, "phrase": "citation_records"}, {"score": 0.003668088762790107, "phrase": "philadelphia"}, {"score": 0.0034628156490003775, "phrase": "journal_citation_reports"}, {"score": 0.0030220049006970317, "phrase": "larger_population"}, {"score": 0.0029284999172756103, "phrase": "high_correlation"}, {"score": 0.002651015392318126, "phrase": "low_correlation"}, {"score": 0.0023997601127552256, "phrase": "perhaps_expected_result"}, {"score": 0.0023133055945761235, "phrase": "glanzel-schubert-schoepflin_stochastic_model"}, {"score": 0.0021049977753042253, "phrase": "interpretative_context"}], "paper_keywords": ["mathematics", " stochastic models", " citation analysis"], "paper_abstract": "Explicit definition of the limits of citation analysis demands additional tests for the validity of citation analysis. The stability of citation rankings over time can be regarded as confirming the validity of evaluative citation analysis. This stability over time was investigated for two sets of citation records from the Web of Science (Thomson Reuters, Philadelphia, PA) for articles published in journals classified in Journal Citation Reports as Mathematics. These sets are of all such articles for the 1960s and for the 1970s. This study employs only descriptive statistics and draws no inferences to any larger population. The study found a high correlation from one decade to the next of rankings among sets of most highly cited articles. However, the study found a low correlation for rankings among articles whose ranks were the 500 directly below those of the 500 most cited. This perhaps expected result is discussed in terms of the Glanzel-Schubert-Schoepflin stochastic model for citation processes and also in connection with an account of the purposes of evaluative citation analysis. This interpretative context suggests why the limitations of citation analysis may be inherent to citation analysis even when it is done well.", "paper_title": "Correlation over time for citations to mathematics articles", "paper_id": "WOS:000323388800004"}