{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "kinetic_parameters"}, {"score": 0.015537276607640774, "phrase": "statistical_model"}, {"score": 0.010968924650360843, "phrase": "stochastic_systems"}, {"score": 0.009869470272799387, "phrase": "measurable_set"}, {"score": 0.00481495049065317, "phrase": "stochastic_models"}, {"score": 0.004786620949516712, "phrase": "biochemical_systems"}, {"score": 0.004661176995136095, "phrase": "stochastic_dynamics"}, {"score": 0.004633747992595526, "phrase": "biochemical_reaction_networks"}, {"score": 0.004525629293824217, "phrase": "succinct_formalisms"}, {"score": 0.00443308765153716, "phrase": "continuous_time_markov_chains"}, {"score": 0.004154332348800334, "phrase": "experimental_data"}, {"score": 0.004105558123159003, "phrase": "ad_hoc"}, {"score": 0.003974349782102708, "phrase": "alternative_strategy"}, {"score": 0.003428665921276366, "phrase": "behavioral_specifications"}, {"score": 0.0033684179374769605, "phrase": "finitely_monitorable_logic"}, {"score": 0.003289725459229119, "phrase": "bounded_fragments"}, {"score": 0.0032510690712452147, "phrase": "metric_temporal_logics"}, {"score": 0.0031563974745349266, "phrase": "novel_combination"}, {"score": 0.0031100973266506163, "phrase": "survey_sampling"}, {"score": 0.003091767402370757, "phrase": "uniform_continuity"}, {"score": 0.0028715299874549245, "phrase": "suitable_technical_condition"}, {"score": 0.0028127163745564777, "phrase": "unbiased_statistical_estimator"}, {"score": 0.002706659627293686, "phrase": "parameter_space"}, {"score": 0.002643386043540555, "phrase": "biochemical_signaling"}, {"score": 0.002573965014439041, "phrase": "parameter_regimes"}, {"score": 0.0023208532782596444, "phrase": "parameter_estimation"}, {"score": 0.0022135695577201616, "phrase": "even_higher_dimensional_spaces"}, {"score": 0.002181069180139225, "phrase": "single_parameter_combination"}], "paper_keywords": ["Systems biology", " Stochastic systems", " Parameter synthesis", " Model infeasibility", " Statistical model checking"], "paper_abstract": "The stochastic dynamics of biochemical reaction networks can be modeled using a number of succinct formalisms all of whose semantics are expressed as Continuous Time Markov Chains (CTMC). While some kinetic parameters for such models can be measured experimentally, most are estimated by either fitting to experimental data or by performing ad hoc, and often manual search procedures. We consider an alternative strategy to the problem, and introduce algorithms for automatically synthesizing the set of all kinetic parameters such that the model satisfies a given high-level behavioral specification. Our algorithms, which integrate statistical model checking and abstraction refinement, can also report the infeasibility of the model if no such combination of parameters exists. Behavioral specifications can be given in any finitely monitorable logic for stochastic systems, including the probabilistic and bounded fragments of linear and metric temporal logics. The correctness of our algorithms is established using a novel combination of arguments based on survey sampling and uniform continuity. We prove that the probability of a measurable set of paths is uniformly and jointly continuous with respect to the kinetic parameters. Under a suitable technical condition, we also show that the unbiased statistical estimator for the probability of a measurable set of paths is monotonic in the parameter space. We apply our algorithms to two benchmark models of biochemical signaling, and demonstrate that they can efficiently find parameter regimes satisfying a given high-level behavioral specification. In particular, we show that our algorithms can synthesize up to 6 parameters, simultaneously, which is more than that reported by any other synthesis algorithm for stochastic systems. Moreover, when parameter estimation is desired, as opposed to synthesis, we show that our approach can scale to even higher dimensional spaces, by identifying the single parameter combination that maximizes the probability of the behavior being true in an 11-dimensional system. (C) 2011 Elsevier BM. All rights reserved.", "paper_title": "Synthesis and infeasibility analysis for stochastic models of biochemical systems using statistical model checking and abstraction refinement", "paper_id": "WOS:000290078000007"}