{"auto_keywords": [{"score": 0.014620019112721446, "phrase": "complex_networks"}, {"score": 0.009962423626705534, "phrase": "different_proportions"}, {"score": 0.00855287292739234, "phrase": "total_output_coupling_strength"}, {"score": 0.00481495049065317, "phrase": "directly_adjusting_node's_impacts_to"}, {"score": 0.004657185361669812, "phrase": "complex_networks."}, {"score": 0.004158290806404304, "phrase": "coupling_strength"}, {"score": 0.003687960013746783, "phrase": "neighbor_nodes"}, {"score": 0.003543273649210823, "phrase": "practical_and_engineering_viewpoints"}, {"score": 0.0031845067058084583, "phrase": "node's_total_output_coupling_strength"}, {"score": 0.0021049977753042253, "phrase": "numerical_simulations"}], "paper_keywords": ["Complex networks", " synchronizability", " node's impact", " direct distribution"], "paper_abstract": "Most previous studies on the synchronization of complex networks were based on that each node managed to adjust its neighbors coupling strength to enhance synchronizability, i.e. each node tried to adjust its total input coupling strength in a proper way and the neighbor nodes were passively adjusted. From practical and engineering viewpoints, each node should manage to adjust its total output coupling strength to realize synchronization. Moreover, each node's total output coupling strength can be distributed to its neighbors with different proportions. In view of the above reasons, in this paper, we study the synchronization of complex networks under the assumptions that the total output coupling strength of each node is voluntarily/directly distributed to its neighbors with different proportions. What is more, we assume that the total output coupling strength of each node can be nonlinear to its degree. Our analysis and numerical simulations show that the synchronizability can be enhanced dramatically when the parameters are properly selected.", "paper_title": "DIRECTLY ADJUSTING NODE'S IMPACTS TO REALIZE THE SYNCHRONIZATION OF COMPLEX NETWORKS", "paper_id": "WOS:000279224200006"}