{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "medline_citations"}, {"score": 0.04822150491313862, "phrase": "duplicate_pairs"}, {"score": 0.004772818068176176, "phrase": "modified_n-grams"}, {"score": 0.004371160978838441, "phrase": "similar_information"}, {"score": 0.004146510711518748, "phrase": "word_n-grams"}, {"score": 0.0033277936960179892, "phrase": "similar_term"}, {"score": 0.0031151864044353245, "phrase": "language_model"}, {"score": 0.0028526276660691525, "phrase": "deja_vu_database"}, {"score": 0.0027660443371695024, "phrase": "duplicate_medline_document_pairs"}, {"score": 0.002658562959236011, "phrase": "word_deletions"}, {"score": 0.0025778546800417808, "phrase": "best_results"}, {"score": 0.0023708980662168547, "phrase": "duplicate_medline_citations"}, {"score": 0.0022787359717772976, "phrase": "high_performance"}, {"score": 0.0021049977753042253, "phrase": "alternative_phrases"}], "paper_keywords": [""], "paper_abstract": "Objective We aim to identify duplicate pairs of Medline citations, particularly when the documents are not identical but contain similar information. Materials and methods Duplicate pairs of citations are identified by comparing word n-grams in pairs of documents. N-grams are modified using two approaches which take account of the fact that the document may have been altered. These are: (1) deletion, an item in the n-gram is removed; and (2) substitution, an item in the n-gram is substituted with a similar term obtained from the Unified Medical Language System Metathesaurus. N-grams are also weighted using a score derived from a language model. Evaluation is carried out using a set of 520 Medline citation pairs, including a set of 260 manually verified duplicate pairs obtained from the Deja Vu database. Results The approach accurately detects duplicate Medline document pairs with an F-1 measure score of 0.99. Allowing for word deletions and substitution improves performance. The best results are obtained by combining scores for n-grams of length 1-5 words. Discussion Results show that the detection of duplicate Medline citations can be improved by modifying n-grams and that high performance can also be obtained using only unigrams (F-1= 0.959), particularly when allowing for substitutions of alternative phrases.", "paper_title": "Comparing Medline citations using modified N-grams", "paper_id": "WOS:000336716000017"}