{"auto_keywords": [{"score": 0.04959522198262252, "phrase": "database_system"}, {"score": 0.00481495049065317, "phrase": "traditional_interaction_mechanism"}, {"score": 0.004654642380553263, "phrase": "query_language"}, {"score": 0.004530250674662973, "phrase": "sql."}, {"score": 0.004276736877590646, "phrase": "minor_modification"}, {"score": 0.004233492114255375, "phrase": "previously_issued_sql_query"}, {"score": 0.004176509019758331, "phrase": "whole_query"}, {"score": 0.0035979378467361762, "phrase": "preceding_interaction"}, {"score": 0.003195324728141602, "phrase": "effective_mechanism"}, {"score": 0.002955533639862811, "phrase": "incomplete_sql_queries"}, {"score": 0.0028569549040495163, "phrase": "identified_parts"}, {"score": 0.0028376361457661415, "phrase": "previously_issued_queries"}, {"score": 0.0027523011981394835, "phrase": "semantic_information"}, {"score": 0.002724428781940696, "phrase": "overall_method"}, {"score": 0.0025717199672018304, "phrase": "database_schema"}, {"score": 0.0023625233416109917, "phrase": "limited_set"}, {"score": 0.002330664671716791, "phrase": "human_subjects"}, {"score": 0.0021776870246727233, "phrase": "potential_foundation"}, {"score": 0.002162951519368368, "phrase": "conversational_querying"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["databases", " SQL", " human computer interaction", " information retrieval"], "paper_abstract": "The traditional interaction mechanism with a database system is through the use of a query language, the most widely used one being SQL. However, when one is facing a situation where he or she has to make a minor modification to a previously issued SQL query, either the whole query has to be written from scratch, or one has to invoke an editor to edit the query. This, however, is not the way we converse with each other as humans. During the course of a conversation, the preceding interaction is used as a context within which many incomplete and/or incremental phrases are uniquely and unambiguously interpreted, sparing the need to repeat the same things again and again. In this paper, we present an effective mechanism that allows a user to interact with a database system in a way similar to the way humans converse. More specifically, incomplete SQL queries are accepted as input which are then matched to identified parts of previously issued queries. Disambiguation is achieved by using various types of semantic information. The overall method works independently of the domain under which it is used (i.e., independently of the database schema). Several algorithms that are variations of the same basic mechanism are proposed. They are mutually compared with respect to efficiency and accuracy through a limited set of experiments on human subjects. The results have been encouraging, especially when semantic knowledge from the schema is exploited, laying a potential foundation for conversational querying in databases. (c) 2004 Elsevier B.V. All rights reserved.", "paper_title": "Conversational querying", "paper_id": "WOS:000232998400002"}