{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_machine"}, {"score": 0.0285945522215814, "phrase": "power_consumption"}, {"score": 0.004484332781147261, "phrase": "construction_cost"}, {"score": 0.00441130431691048, "phrase": "power-supplying_infrastructure"}, {"score": 0.0040192915527630995, "phrase": "software-based_or_hardware-based_power-capping_schemes"}, {"score": 0.003702323283528696, "phrase": "cloud_systems"}, {"score": 0.0036419834462626125, "phrase": "virtual_machines"}, {"score": 0.003429001377800258, "phrase": "key_approaches"}, {"score": 0.002877438939246423, "phrase": "server_power_consumption"}, {"score": 0.002564505790176378, "phrase": "migration_instance"}], "paper_keywords": ["Virtualization", " Live-migration", " Power-aware computing", " Cloud computing", " Distributed systems"], "paper_abstract": "To reduce the construction cost of the power-supplying infrastructure in data centers and to increase the utilization of the existing one, many researchers have introduced software-based or hardware-based power-capping schemes. In servers with consolidated virtual machines, which can be easily found in cloud systems, exporting virtual machines to other light-loaded servers through live-migration is one of the key approaches to impose power-capping on servers. Up until now, most researchers who have tried to achieve power-capping through live-migration assumed that exporting a virtual machine instantly reduces the server power consumption. However, our analysis introduced in this paper reveals that the power consumption remains high or increases for a few seconds during a migration instance. This behavior contradicts the aim of power-capping, and may endanger the stability of servers. Based on this observation, we also propose and evaluate two power-suppressing live-migration schemes to resolve the power overshooting issue. Our evaluation shows that both approaches immediately limit the power consumption after live-migration is initiated.", "paper_title": "Analysis of virtual machine live-migration as a method for power-capping", "paper_id": "WOS:000326805000024"}