{"auto_keywords": [{"score": 0.040984823331088625, "phrase": "lad_problems"}, {"score": 0.00481495049065317, "phrase": "recurrent_neural_networks"}, {"score": 0.0047468516620285525, "phrase": "constrained_least_absolute_deviation_problems"}, {"score": 0.00459165923324494, "phrase": "constrained_least_absolute_deviation"}, {"score": 0.004136044939878838, "phrase": "special_linear_constraints"}, {"score": 0.0037969755088553326, "phrase": "two-sided_inequality"}, {"score": 0.0036207206487324506, "phrase": "special_cases"}, {"score": 0.003371508176308189, "phrase": "simpler_architectures"}, {"score": 0.0031096747349602344, "phrase": "one-sided_inequality_constraints"}, {"score": 0.0027741761880779535, "phrase": "corresponding_problems"}, {"score": 0.0027348611289528583, "phrase": "different_networks"}, {"score": 0.0022181655497912796, "phrase": "numerical_simulations"}, {"score": 0.0021454671611847507, "phrase": "theoretical_results"}, {"score": 0.0021049977753042253, "phrase": "convergence_rates"}], "paper_keywords": ["L(1)-norm optimization", " least absolute deviation (LAD)", " minimax optimization", " recurrent neural network (RNN)", " stability analysis"], "paper_abstract": "Recurrent neural networks for solving constrained least absolute deviation (LAD) problems or L(1)-norm optimization problems have attracted much interest in recent years. But so far most neural networks can only deal with some special linear constraints efficiently. In this paper, two neural networks are proposed for solving LAD problems with various linear constraints including equality, two-sided inequality and bound constraints. When tailored to solve some special cases of LAD problems in which not all types of constraints are present, the two networks can yield simpler architectures than most existing ones in the literature. In particular, for solving problems with both equality and one-sided inequality constraints, another network is invented. All of the networks proposed in this paper are rigorously shown to be capable of solving the corresponding problems. The different networks designed for solving the same types of problems possess the same structural complexity, which is due to the fact these architectures share the same computing blocks and only differ in connections between some blocks. By this means, some flexibility for circuits realization is provided. Numerical simulations are carried out to illustrate the theoretical results and compare the convergence rates of the networks.", "paper_title": "Design of Recurrent Neural Networks for Solving Constrained Least Absolute Deviation Problems", "paper_id": "WOS:000281973300004"}