{"auto_keywords": [{"score": 0.042112809942215015, "phrase": "decentralized_diagnosis"}, {"score": 0.031356084154478756, "phrase": "uniformly_bounded_delay"}, {"score": 0.00481495049065317, "phrase": "discrete_event_systems"}, {"score": 0.004790153050564259, "phrase": "inference-based_ambiguity_management"}, {"score": 0.0047287140918239766, "phrase": "decentralized_decision-making_involves"}, {"score": 0.004656021776251681, "phrase": "local_decision-makers"}, {"score": 0.0045726187330434025, "phrase": "limited_sensing_capabilities"}, {"score": 0.004297795905522757, "phrase": "differing_gradations"}, {"score": 0.004188198923320451, "phrase": "varying_ambiguity_levels"}, {"score": 0.004134448610917521, "phrase": "global_control_decision"}, {"score": 0.004102528738941734, "phrase": "similar_inferencing-based_framework"}, {"score": 0.003916098498242888, "phrase": "earlier_work"}, {"score": 0.0035497797026638033, "phrase": "global_diagnosis_decision"}, {"score": 0.0034951469511975346, "phrase": "\"winning\"_local_diagnosis_decision"}, {"score": 0.0034324668792521697, "phrase": "minimum_ambiguity_level"}, {"score": 0.0033796335027364245, "phrase": "ambiguity_level"}, {"score": 0.003353521531649663, "phrase": "local_decision"}, {"score": 0.0031435968684569112, "phrase": "correspondence_paper"}, {"score": 0.0029089095588612007, "phrase": "decentralized_diagnosability"}, {"score": 0.0026778037719529337, "phrase": "future_observations"}, {"score": 0.0024906610581090223, "phrase": "different_formulation"}, {"score": 0.002280870262831237, "phrase": "n-inference_diagnosability"}, {"score": 0.002165798731600657, "phrase": "maximum_ambiguity_level"}, {"score": 0.0021490449563443025, "phrase": "winning_local_decision"}, {"score": 0.0021049977753042253, "phrase": "n-inference_nf-diagnosability"}], "paper_keywords": ["Ambiguity", " decentralized diagnosis", " discrete event systems (DESs)", " inference diagnosability for nonfailures", " inferencing", " knowledge"], "paper_abstract": "The task of decentralized decision-making involves interaction of a set of local decision-makers, each of which operates under limited sensing capabilities and is thus subjected to ambiguity during the process of decision-making. In our previous work, we made an observation that such ambiguities are of differing gradations and presented a framework for inferencing over various local control decisions of varying ambiguity levels to arrive at a global control decision. A similar inferencing-based framework for the management of ambiguities in the decentralized diagnosis of failures was also reported by us in another earlier work. For each event-trace executed by a system being monitored, each local diagnoser issues its own diagnosis decision (failure or nonfailure or unsure), tagged with a certain ambiguity level (zero being the minimum). A global diagnosis decision is taken to be a \"winning\" local diagnosis decision, i.e., one with a minimum ambiguity level. The computation of an ambiguity level for a local decision requires an assessment of the self-ambiguities as well as the ambiguities of the others, and an inference based up on such knowledge. This correspondence paper extends this to the decentralized diagnosis of nonfailures which requires that any ambiguity about the nonoccurrence of a failure be resolved within a uniformly bounded delay. It is known that the decentralized diagnosability for failures does not imply that for nonfailures, and vice versa. Further, the following difference exists: Once the ambiguity about the occurrence of a failure is resolved, future observations do not cause the ambiguity to reoccur. The same is not true when one is concerned with the diagnosis for nonfailures, and so, a different formulation is needed. In order to characterize the class of systems for which the ambiguity about the nonoccurrence of a failure can be resolved within a uniformly bounded delay, we introduce the notion of N-inference diagnosability for NonFailures (also called N-inference NF-diagnosability), where the index N represents the maximum ambiguity level of any winning local decision. We present a method for verifying N-inference NF-diagnosability and also establish various properties of it.", "paper_title": "Decentralized Diagnosis for Nonfailures of Discrete Event Systems Using Inference-Based Ambiguity Management", "paper_id": "WOS:000274734300016"}