{"auto_keywords": [{"score": 0.04931971121682221, "phrase": "real_time"}, {"score": 0.04499108676167184, "phrase": "target_object"}, {"score": 0.004663396040465122, "phrase": "single_low-budget_camera._motion_tracking"}, {"score": 0.004468684611798047, "phrase": "existing_motion_tracking_techniques"}, {"score": 0.004259293347851015, "phrase": "specific_hardware"}, {"score": 0.0041251561573501455, "phrase": "wide_spread"}, {"score": 0.004081385289516914, "phrase": "commercial_applications"}, {"score": 0.004016594765266821, "phrase": "motion_tracking"}, {"score": 0.00378767277402891, "phrase": "freedom_motion_tracking_system"}, {"score": 0.0035338315037521627, "phrase": "single_low-budget_camera"}, {"score": 0.003108911488613549, "phrase": "nonmodeled_unmarked_object"}, {"score": 0.0022806798371116698, "phrase": "additional_constraints"}, {"score": 0.0022087165619569006, "phrase": "market-wide_implementation"}], "paper_keywords": ["Motion tracking", " markerless", " unsupervised", " human-computer interaction", " low-budget"], "paper_abstract": "Motion tracking is a critical task in many computer vision applications. Existing motion tracking techniques require either a great amount of knowledge on the target object or specific hardware. These requirements discourage the wide spread of commercial applications based on motion tracking. In this paper, we present a novel three degrees of freedom motion tracking system that needs no knowledge on the target object and that only requires a single low-budget camera that can be found installed in most computers and smartphones. Our system estimates, in real time, the three-dimensional position of a nonmodeled unmarked object that may be nonrigid, nonconvex, partially occluded, self-occluded, or motion blurred, given that it is opaque, evenly colored, enough contrasting with the background in each frame, and that it does not rotate. Our system is also able to determine the most relevant object to track in the screen. Our proposal does not impose additional constraints, therefore it allows a market-wide implementation of applications that require the estimation of the three position degrees of freedom of an object.", "paper_title": "UNSUPERVISED MARKERLESS 3-DOF MOTION TRACKING IN REAL TIME USING A SINGLE LOW-BUDGET CAMERA", "paper_id": "WOS:000309359900003"}