{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "encryption_system"}, {"score": 0.004780780407878596, "phrase": "fingerprint_user_authentication"}, {"score": 0.0047468516620285525, "phrase": "purpose_-_cryptography"}, {"score": 0.0046797114400479135, "phrase": "essential_feature"}, {"score": 0.003958194802333944, "phrase": "personal_data"}, {"score": 0.0036727235025069828, "phrase": "up-to-date_symmetric"}, {"score": 0.0035822005511799036, "phrase": "-_first"}, {"score": 0.0035567476133074533, "phrase": "main_issues"}, {"score": 0.003395640013786862, "phrase": "well-known_algorithms"}, {"score": 0.0033475472608077823, "phrase": "data_encryption_standard"}, {"score": 0.00332375606483146, "phrase": "rijndael_methods"}, {"score": 0.0031393948330209255, "phrase": "authenticate_users"}, {"score": 0.003094920033010818, "phrase": "fingerprint_features"}, {"score": 0.002881793492919646, "phrase": "real_authentication_systems"}, {"score": 0.0028511121935559072, "phrase": "high-security_standards"}, {"score": 0.002780783274864117, "phrase": "practical_biometric_system"}, {"score": 0.002751174423568564, "phrase": "-_biometrics"}, {"score": 0.0027121844541913367, "phrase": "attractive_alternative"}, {"score": 0.0026928966146175636, "phrase": "password-based_systems"}, {"score": 0.0024630345285372958, "phrase": "recent_fingerprint_identification_algorithms"}, {"score": 0.002120083747913758, "phrase": "forthcoming_needs"}, {"score": 0.0021049977753042253, "phrase": "cryptographic_systems"}], "paper_keywords": ["Cybernetics", " Cryptography", " Computer hardware", " Pattern recognition", " Biometrics", " Algorithms"], "paper_abstract": "Purpose - Cryptography has become an essential feature for many current technological applications. Cryptographic methods are usually divided into private-key (or symmetric) and public-key (or asymmetric) algorithms. The purpose of this paper is to propose a client/server architecture to efficiently authenticate users by means of their fingerprint biometric feature. To do this, the personal data of each user are acquired at the client and, afterwards, they are conveniently encrypted using a combination of up-to-date symmetric and asymmetric cryptographic algorithms. Design/methodology/approach - First the main issues related to public-key and private-key cryptography, including well-known algorithms, such as data encryption standard and Rijndael methods are reviewed. After that, a proposal for the implementation of a client/server architecture to authenticate users by means of fingerprint features is proposed. Findings - The results of the experiments show that such architecture is optimal for being applied in real authentication systems, provides high-security standards and can be applied to any practical biometric system. Originality/value - Biometrics has become an attractive alternative to password-based systems: using a password is insecure, as they can easily be forgotten or stolen. Fingerprints are the most widely used biometric feature. This paper uses recent fingerprint identification algorithms together with the most advanced cryptographic methods recommended nowadays. This way, the system utilizes state-of-the-art techniques that are also introduced in many practical systems; that is the reason why it will be flexible enough to integrate, any forthcoming needs of cryptographic systems.", "paper_title": "A client/server implementation of an encryption system for fingerprint user authentication", "paper_id": "WOS:000260044400004"}