{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pegasus"}, {"score": 0.046753577044009426, "phrase": "astrophysical_plasma_dynamics"}, {"score": 0.0038810583785936505, "phrase": "energy-conserving_particle_integrator"}, {"score": 0.0035021127041237887, "phrase": "magnetic_field"}, {"score": 0.0034485432592912917, "phrase": "delta_f_scheme"}, {"score": 0.003343841875107018, "phrase": "reduced-noise_study"}, {"score": 0.003209152260950748, "phrase": "initial_distribution_function"}, {"score": 0.002986329509791943, "phrase": "shearing-sheet_formalism"}, {"score": 0.0027223626424366207, "phrase": "popular_astrophysical_magnetohydrodynamics_code"}, {"score": 0.0027084269443386024, "phrase": "athena"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Hybrid", " Particle-in-cell", " Numerical methods", " Plasma"], "paper_abstract": "We describe Pegasus, a new hybrid-kinetic particle-in-cell code tailored for the study of astrophysical plasma dynamics. The code incorporates an energy-conserving particle integrator into a stable, second-order-accurate, three-stage predictor-predictor-corrector integration algorithm. The constrained transport method is used to enforce the divergence-free constraint on the magnetic field. A delta f scheme is included to facilitate a reduced-noise study of systems in which only small departures from an initial distribution function are anticipated. The effects of rotation and shear are implemented through the shearing-sheet formalism with orbital advection. These algorithms are embedded within an architecture similar to that used in the popular astrophysical magnetohydrodynamics code Athena, one that is modular, well-documented, easy to use, and efficiently parallelized for use on thousands of processors. We present a series of tests in one, two, and three spatial dimensions that demonstrate the fidelity and versatility of the code. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Pegasus: A new hybrid-kinetic particle-in-cell code for astrophysical plasma dynamics", "paper_id": "WOS:000329506500010"}