{"auto_keywords": [{"score": 0.04112289743676207, "phrase": "dielectric_permittivity"}, {"score": 0.029850455792006885, "phrase": "dft_data"}, {"score": 0.00481495049065317, "phrase": "improved_dielectric_permittivity"}, {"score": 0.00470862827326028, "phrase": "enhanced_dielectric_permittivity"}, {"score": 0.004625255533545965, "phrase": "related_polymers"}, {"score": 0.004306205029641728, "phrase": "computational_study"}, {"score": 0.004229927464182562, "phrase": "density_functional_theory"}, {"score": 0.0040996651541091575, "phrase": "modified_group_additivity_based_high_throughput_techniques"}, {"score": 0.0038167308978417306, "phrase": "isolated_polyethylene_chains"}, {"score": 0.0031210475158175406, "phrase": "chemically_modified_polyethylene_chains"}, {"score": 0.0030520148188164084, "phrase": "dft_computations"}, {"score": 0.00298450444597311, "phrase": "effective_medium_theory"}, {"score": 0.0029447150254434842, "phrase": "limited_set"}, {"score": 0.0028539179130824786, "phrase": "underlying_chemical_trends"}, {"score": 0.00269263690712392, "phrase": "constituent_atoms"}, {"score": 0.0026095920086044145, "phrase": "modified_group_contribution_expansion"}, {"score": 0.002364865100579589, "phrase": "configurational_and_compositional_space"}, {"score": 0.002291905937251069, "phrase": "simultaneously_large_dielectric_constant_and_band_gap"}, {"score": 0.0021239335561699106, "phrase": "possible_motivation"}, {"score": 0.0021049977753042253, "phrase": "future_experimental_efforts"}], "paper_keywords": [""], "paper_abstract": "An enhanced dielectric permittivity of polyethylene and related polymers, while not overly sacrificing their excellent insulating properties, is highly desirable for various electrical energy storage applications. In this computational study, we use density functional theory (DFT) in combination with modified group additivity based high throughput techniques to identify promising chemical motifs that can increase the dielectric permittivity of polyethylene. We consider isolated polyethylene chains and allow the CH2 units in the backbone to be replaced by a number of Group IV halides (viz., SiF2, SiCl2, GeF2, GeCl2, SnF2, or SnCl2 units) in a systematic, progressive, and exhaustive manner. The dielectric permittivity of the chemically modified polyethylene chains is determined by employing DFT computations in combination with the effective medium theory for a limited set of compositions and configurations. The underlying chemical trends in the DFT data are first rationalized in terms of various tabulated atomic properties of the constituent atoms. Next, by parametrizing a modified group contribution expansion using the DFT data set, we are able to predict the dielectric permittivity and bandgap of nearly 30 000 systems spanning a much larger part of the configurational and compositional space. Promising motifs which lead to simultaneously large dielectric constant and band gap in the modified polyethylene chains have been identified. Our theoretical work is expected to serve as a possible motivation for future experimental efforts.", "paper_title": "New Group IV Chemical Motifs for Improved Dielectric Permittivity of Polyethylene", "paper_id": "WOS:000318060200014"}