{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_leakage"}, {"score": 0.022749251721239212, "phrase": "supply_chains"}, {"score": 0.006476080285984845, "phrase": "supply_chain"}, {"score": 0.005875591874340035, "phrase": "quantitative_approach"}, {"score": 0.0046544807197808095, "phrase": "information_sharing"}, {"score": 0.0044424917428102445, "phrase": "adverse_effect"}, {"score": 0.0037336520904376687, "phrase": "confidential_information"}, {"score": 0.003204841443605308, "phrase": "potential_information_leakage"}, {"score": 0.003071682293903262, "phrase": "conceptual_model"}, {"score": 0.0027274643070540733, "phrase": "proposed_conceptual_model"}, {"score": 0.0022339789476489877, "phrase": "case_study"}, {"score": 0.0021870332034407817, "phrase": "proposed_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information sharing", " Access control", " Inference", " Risk evaluation", " Mitigation"], "paper_abstract": "While information sharing can benefit supply chains significantly, it may also have an adverse effect, namely, information leakage. A limitation common to many existing solutions for preventing information leakage in supply chains is that they rely, either implicitly or explicitly, upon two unrealistic assumptions. First, what information is confidential is well known. Second, confidential information will not be revealed, if only it is not shared, regardless of how much other information is being shared. As we shall show in this paper, those assumptions are not always true due to potential information leakage caused by inferences. Specifically, we propose a conceptual model of such information leakage. The model will enable companies in a supply chain to better understand how their confidential information may be leaked through inferences. On the basis of the proposed conceptual model, we then devise a quantitative approach to evaluating the risk of information leakage caused by inferences when a given amount of information is shared. The quantitative approach will allow companies in a supply chain to measure and consequently mitigate the risk of information leakage. Finally, we discuss a case study to illustrate how the proposed approaches work in practice. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Modeling and evaluating information leakage caused by inferences in supply chains", "paper_id": "WOS:000289183900012"}