{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rfid_reader_collision_problem"}, {"score": 0.03463053417200641, "phrase": "spatial_reuse"}, {"score": 0.029420333683948755, "phrase": "dual-channel_mode"}, {"score": 0.004672953146379813, "phrase": "rfid_reader's_interrogation"}, {"score": 0.004348936976349555, "phrase": "reliable_operation"}, {"score": 0.004220624516321415, "phrase": "wide-spread_deployment"}, {"score": 0.004170410375304943, "phrase": "rfid"}, {"score": 0.003677280504320636, "phrase": "rfid_reader's_and_a_tag's_communication_capabilities"}, {"score": 0.0032423089921154503, "phrase": "rfid_reader_networks"}, {"score": 0.0031654684543975077, "phrase": "concurrent_interrogation_distance"}, {"score": 0.002945669860541221, "phrase": "carrier_sense_threshold"}, {"score": 0.0021953290937408807, "phrase": "interrogation_completion_time"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["RFID", " reader collision", " medium access control"], "paper_abstract": "The RFID reader collision problem, in which an RFID reader's interrogation is interfered by other concurrent readers' transmission, is considered an important issue to reliable operation and thus to the wide-spread deployment of RFID networks. In this paper, we present modeling and analysis of the RFID reader collision problem. We observe asymmetry between an RFID reader's and a tag's communication capabilities and develop an RFID radio model based on the asymmetry. By the model, we characterize the spatial reuse of RFID reader networks, and derive concurrent interrogation distance beyond which readers can transmit simultaneously without causing collision and the carrier sense threshold corresponding to the distance. We also examine the dual-channel mode where available bandwidth is divided into two channels by which reader-to-tag communication and tag-to-reader communication are separated. We analyze and evaluate the performance of the dual-channel mode in terms of spatial reuse and interrogation completion time. Copyright (c) 2010 John Wiley & Sons, Ltd.", "paper_title": "RFID reader collision problem: performance analysis and medium access", "paper_id": "WOS:000301124400004"}