{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lifetime"}, {"score": 0.004701015188740582, "phrase": "two-tiered_wireless_sensor_networks"}, {"score": 0.004535124351828787, "phrase": "two-tiered_wireless_sensor_network"}, {"score": 0.004392565073466714, "phrase": "optimal_cluster_association_algorithm"}, {"score": 0.004288581530198804, "phrase": "overall_network_lifetime"}, {"score": 0.004237512575106522, "phrase": "two-tiered_wsn"}, {"score": 0.004137184278868391, "phrase": "small_sensor_nodes"}, {"score": 0.003669941438286456, "phrase": "relevant_information"}, {"score": 0.0035544816252832375, "phrase": "combined_information"}, {"score": 0.0031528393611136704, "phrase": "network_lifetime"}, {"score": 0.0028643622911111942, "phrase": "optimal_algorithms"}, {"score": 0.0024506642262508735, "phrase": "cluster_association"}, {"score": 0.002382987346529592, "phrase": "numerical_results"}, {"score": 0.0022803854904010347, "phrase": "proposed_approaches"}, {"score": 0.0022531762659857507, "phrase": "simulation_study"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["network lifetime", " two-tiered", " clustering"], "paper_abstract": "In this paper. we Study the two-tiered wireless sensor network (WSN) architecture and propose the optimal cluster association algorithm for it to maximize the overall network lifetime. A two-tiered WSN is formed by number of small sensor nodes (SNs), powerful application nodes (ANs), and base-stations (BSs, or gateways). SNs capture, encode, and transmit relevant information to ANs, which then send the combined information to BSs. Assuming the locations of the SNs, ANs, and BSs are fixed, we consider how to associate the SNs to ANs such that the network lifetime is maximized while every node meets its bandwidth requirement. When the SNs are homogeneous (e.g., same bandwidth requirement), we give optimal algorithms to maximize the lifetime of the WSNs; when the SNs are heterogeneous, we give a 2-approximation algorithm that produces a network whose lifetime is within 1/2 of the optimum. We also present algorithms to dynamically update the cluster association when the network topology changes. Numerical results are given to demonstrate the efficiency and optimality of the proposed approaches. In simulation study, comparing network lifetime, our algorithm outperforms other heuristics almost twice. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "Lifetime-maximized cluster association in two-tiered wireless sensor networks", "paper_id": "WOS:000263848600005"}