{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fair_payment"}, {"score": 0.04121291096178907, "phrase": "development_process"}, {"score": 0.013932875383440032, "phrase": "third_parties"}, {"score": 0.0047341211614980085, "phrase": "case_study"}, {"score": 0.004576491793324233, "phrase": "outsourcing_organization"}, {"score": 0.004454158739805578, "phrase": "ceteris_paribus_situation"}, {"score": 0.004190682785437681, "phrase": "information_technology_development"}, {"score": 0.003983016985197904, "phrase": "supplier_change"}, {"score": 0.003785602770516485, "phrase": "important_software_metrics"}, {"score": 0.00338493754743055, "phrase": "development_process_redesign"}, {"score": 0.003305540152273746, "phrase": "fair_assessment"}, {"score": 0.003006087482938274, "phrase": "important_key_performance_indicators"}, {"score": 0.0029655761366079877, "phrase": "simulation_techniques"}, {"score": 0.0029256091368059446, "phrase": "discrete_event_simulation"}, {"score": 0.0027060037347363987, "phrase": "real-world_situation"}, {"score": 0.0022376375252254987, "phrase": "specific_numbers"}, {"score": 0.0021556211190198703, "phrase": "general_principle"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["outsourcing", " time to market", " simulation", " software development process", " development process redesign", " information technology metrics"], "paper_abstract": "After outsourcing, issues can arise between the outsourcing organization and their third parties about fair payment. In a ceteris paribus situation, fair payment can be determined based on the differences made by the third parties. However, when information technology development is (partly) outsourced to third parties, often, not only does the supplier change, but the development process is also changed. This change of development process alone influences important software metrics, such as time to market, productivity, costs, size, and quality, exactly the metrics that are often used to establish payments. Quantifying the influence of the development process redesign is therefore vital to make a fair assessment of the changes truly caused by the supplier, and thus realistic payment. In this paper, the influence of the change in the development process on important key performance indicators is quantified using simulation techniques. We use discrete event simulation to analyze the effect on time to market. The techniques we use are illustrated and validated by applying them in a real-world situation. The techniques can be used to estimate the influence of the business process change both before outsourcing and after the outsourcing has been decided. Our case study helped the organization in their outsourcing by adapting its proposed development process so that the balance between a more formal process and time to market became more in line with their demands. Although the specific numbers will be different per company, other organizations can apply the general principle. Copyright (c) 2015 John Wiley & Sons, Ltd.", "paper_title": "Quantifying fair payment after outsourcing - a case study", "paper_id": "WOS:000352093300001"}