{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "time-free_p_systems"}, {"score": 0.0464485993141056, "phrase": "living_cells"}, {"score": 0.04558099031824587, "phrase": "p_systems"}, {"score": 0.004611013257082199, "phrase": "parallel_computing_devices"}, {"score": 0.004398331355940011, "phrase": "standard_feature"}, {"score": 0.004228577663320847, "phrase": "exactly_one_time_unit"}, {"score": 0.004129873531628877, "phrase": "different_chemical_reactions"}, {"score": 0.0038624981944755813, "phrase": "precisely_such_time"}, {"score": 0.003073545175760353, "phrase": "preliminary_results"}, {"score": 0.0030494153169181334, "phrase": "time-free_and_clock-free_p_system"}, {"score": 0.0028405715222684183, "phrase": "different_combinations"}, {"score": 0.00281826552772148, "phrase": "possible_ingredients"}, {"score": 0.002688050388891007, "phrase": "bi-stable_catalysts"}, {"score": 0.0025038930574283174, "phrase": "arbitrary_bi-stable_catalytic_p_system"}, {"score": 0.002407078478216306, "phrase": "time-free_evolution-communication_p_systems"}, {"score": 0.0023415390666563177, "phrase": "mixed_application"}, {"score": 0.0021983430142660373, "phrase": "noncooperative_evolution_rules"}], "paper_keywords": [""], "paper_abstract": "Membrane systems (currently called P systems) are parallel computing devices inspired by the structure and the functioning of living cells. A standard feature of P systems is that each rule is executed in exactly one time unit. Actually, in living cells different chemical reactions might take different times to be executed; moreover, it might be hard to know precisely such time of execution. For this reason, in [7] two models of P systems (time-free and clock-free P systems) have been defined and investigated, where the time of execution of the rules is arbitrary and the output produced by the system is always the same, independently of this time. Preliminary results concerning time-free and clock-free P system have been obtained in [6,7,8]. In this paper we continue these investigations by considering different combinations of possible ingredients. In particular, we present the universality of time-free P systems using bi-stable catalysts. Then, we prove that this result implies that is not possible to decide whether an arbitrary bi-stable catalytic P system is time-free. We present several results about time-free evolution-communication P systems, where the computation is a mixed application of evolution and symport/antiport rules. In this case we obtain the universality even by using noncooperative evolution rules and antiports of weight one. Finally, we formulate several open problems.", "paper_title": "Further results on time-free P systems", "paper_id": "WOS:000235344700005"}