{"auto_keywords": [{"score": 0.035852908103896845, "phrase": "autolink"}, {"score": 0.007112060871511693, "phrase": "candidate_algorithms"}, {"score": 0.00481495049065317, "phrase": "link_generation"}, {"score": 0.004769958800452922, "phrase": "sensor-enriched_smartphone_images"}, {"score": 0.004487541157100498, "phrase": "in-situ_content"}, {"score": 0.004424768776701965, "phrase": "well-attended_events"}, {"score": 0.004281678802569817, "phrase": "diverse_views"}, {"score": 0.004123781267600542, "phrase": "abnormal_lighting_effects"}, {"score": 0.003934540154108188, "phrase": "significant_redundancy"}, {"score": 0.0037188360359702182, "phrase": "bad_contrast"}, {"score": 0.00351491577968631, "phrase": "higher_details"}, {"score": 0.0033377940531761985, "phrase": "content-based_links"}, {"score": 0.003306559295382181, "phrase": "sensor-annotated_photos"}, {"score": 0.0032756158688245, "phrase": "unstructured_photo_collections"}, {"score": 0.003110515172439764, "phrase": "high-context_and_high-detail_images"}, {"score": 0.0028446460307503343, "phrase": "user_photography_patterns"}, {"score": 0.002818013056816282, "phrase": "user_taste"}, {"score": 0.0025290375256888883, "phrase": "associated_sensor_logs"}, {"score": 0.002493592357827492, "phrase": "multiple_participants"}, {"score": 0.0021249064184347658, "phrase": "appropriate_hierarchy"}], "paper_keywords": ["Smartphone", " collaboration", " hyperlinking", " images"], "paper_abstract": "The ubiquity of the smartphones makes them ideal platforms for generating in-situ content. In well-attended events, photos captured by attendees have diverse views that could be subjected to occlusion and abnormal lighting effects that could obscure the view. Such unstructured photo collections also have significant redundancy. Thus, a scene that is partially occluded or has bad contrast in one photo may be captured in another photo, possibly with higher details. We propose an application called Autolink that automatically establishes content-based links between sensor-annotated photos in unstructured photo collections captured using smartphones, such that users could navigate between high-context and high-detail images. This hierarchically structured image collection facilitates the design of applications for navigation and discovery, analytics about user photography patterns, user taste, and content/event popularity. Autolink includes a framework that constructs this hierarchy efficiently and with little content-specific training data by combining photo content processing with associated sensor logs obtained from multiple participants. We evaluated the performance of Autolink on two real-world sensor tagged photo datasets. The result shows that Autolink is able to efficiently cluster photos at 20 times faster than candidate algorithms, into the appropriate hierarchy with at least 70% precision and 37% better recall than candidate algorithms.", "paper_title": "Automated Link Generation for Sensor-Enriched Smartphone Images", "paper_id": "WOS:000363654100003"}