{"auto_keywords": [{"score": 0.048811828059843985, "phrase": "model-based_design"}, {"score": 0.010612387000973441, "phrase": "darpa_urban_challenge"}, {"score": 0.004612662942073808, "phrase": "software_engineering_community"}, {"score": 0.004490552331642995, "phrase": "recent_research"}, {"score": 0.0044426140044122545, "phrase": "model_transformations"}, {"score": 0.004371660146981191, "phrase": "elegant_behavioral_specifications"}, {"score": 0.003603327452846714, "phrase": "application-specific_programs"}, {"score": 0.0035648266669315943, "phrase": "general-purpose_programming"}, {"score": 0.0035078427258024613, "phrase": "complex_real-time_systems"}, {"score": 0.003378385493203297, "phrase": "model-driven_approaches"}, {"score": 0.003100085797251317, "phrase": "model-based_design_researchers"}, {"score": 0.003034158379493625, "phrase": "software_experts"}, {"score": 0.002568435291444709, "phrase": "full_promises"}, {"score": 0.0021049977753042253, "phrase": "small-scale_projects"}], "paper_keywords": [""], "paper_abstract": "The impact of model-based design on the software engineering community is impressive, and recent research in model transformations, and elegant behavioral specifications of systems has the potential to revolutionize the way in which systems are designed. Such techniques aim to raise the level of abstraction at which systems are specified, to remove the burden of producing application-specific programs with general-purpose programming. For complex real-time systems, however, the impact of model-driven approaches is not nearly so widespread. In this paper, we present a perspective of model-based design researchers who joined with software experts in robotics to enter the DARPA Urban Challenge, and to what extent model-based design techniques were used. Further, we speculate on why, according to our experience and the testimonies of many teams, the full promises of model-based design were not widely realized for the competition. Finally, we present some thoughts for the future of model-based design in complex systems such as these, and what advancements in modeling are needed to motivate small-scale projects to use model-based design in these domains.", "paper_title": "Model-based design: a report from the trenches of the DARPA Urban Challenge", "paper_id": "WOS:000269218900006"}