{"auto_keywords": [{"score": 0.04945145150798937, "phrase": "data_provenance"}, {"score": 0.007741049748379211, "phrase": "cyber_security_community"}, {"score": 0.00481495049065317, "phrase": "privacy-enhanced_secure_data_provenance"}, {"score": 0.00456734029846796, "phrase": "functional_perspective"}, {"score": 0.004507444389818216, "phrase": "historical_pattern"}, {"score": 0.00447188283696343, "phrase": "new_technologies"}, {"score": 0.004241839797895464, "phrase": "specific_aspects"}, {"score": 0.003970789286139509, "phrase": "recent_report"}, {"score": 0.003836732898536643, "phrase": "tailored_trustworthy_spaces"}, {"score": 0.0037664260266334886, "phrase": "data_trustworthiness"}, {"score": 0.0035725429359577928, "phrase": "privacy_preferences"}, {"score": 0.003534976495993737, "phrase": "relevant_users"}, {"score": 0.0034793636230383367, "phrase": "important_factor"}, {"score": 0.0034610204300474334, "phrase": "access_control"}, {"score": 0.003442773608209831, "phrase": "usage_control_decisions"}, {"score": 0.0033796614187448, "phrase": "data_forensics"}, {"score": 0.0033352884949505537, "phrase": "potential_benefits"}, {"score": 0.002899189972263455, "phrase": "high_assurance"}, {"score": 0.0027425627058001133, "phrase": "voluntary_large-scale_participation"}, {"score": 0.002728093290659738, "phrase": "provenance-aware_applications"}, {"score": 0.002540047443578731, "phrase": "technical_and_scientific_framework"}, {"score": 0.0025133106414591544, "phrase": "security_and_privacy_challenges"}, {"score": 0.002473730894309209, "phrase": "maximum_benefit"}, {"score": 0.0023837794149995533, "phrase": "theoretical_foundations"}, {"score": 0.002243031437658962, "phrase": "modular_fashion"}, {"score": 0.0022135486371828795, "phrase": "main_components"}, {"score": 0.0021729212034657477, "phrase": "provenance_life_cycle"}, {"score": 0.002144357963705675, "phrase": "details_research_questions"}, {"score": 0.0021049977753042253, "phrase": "related_approaches"}], "paper_keywords": ["Data provenance", " Security", " Privacy", " Trustworthy computing", " Cryptography and access control", " Risk management", " Accountability and compliance"], "paper_abstract": "The notion of data provenance was formally introduced a decade ago and has since been investigated, but mainly from a functional perspective, which follows the historical pattern of introducing new technologies with the expectation that security and privacy can be added later. Despite very recent interests from the cyber security community on some specific aspects of data provenance, there is no long-haul, overarching, systematic framework for the security and privacy of provenance. The importance of secure provenance R&D has been emphasized in the recent report on Federal game-changing R&D for cyber security especially with respect to the theme of Tailored Trustworthy Spaces. Secure data provenance can significantly enhance data trustworthiness, which is crucial to various decision-making processes. Moreover, data provenance can facilitate accountability and compliance (including compliance with privacy preferences and policies of relevant users), can be an important factor in access control and usage control decisions, and can be valuable in data forensics. Along with these potential benefits, data provenance also poses a number of security and privacy challenges. For example, sometimes provenance needs to be confidential so it is visible only to properly authorized users, and we also need to protect the identity of entities in the provenance from exposure. We thus need to achieve high assurance of provenance without comprising privacy of those in the chain that produced the data. Moreover, if we expect voluntary large-scale participation in provenance-aware applications, we must assure that the privacy of the individuals or organizations involved will be maintained. It is incumbent on the cyber security community to develop a technical and scientific framework to address the security and privacy challenges so that our society can gain maximum benefit from this technology. In this paper, we discuss a framework of theoretical foundations, models, mechanisms and architectures that allow applications to benefit from privacy-enhanced and secure use of provenance in a modular fashion. After introducing the main components of such a framework and the notion of provenance life cycle, we discuss in details research questions and issues concerning each such component and related approaches.", "paper_title": "A roadmap for privacy-enhanced secure data provenance", "paper_id": "WOS:000345590900005"}