{"auto_keywords": [{"score": 0.04213508080259668, "phrase": "input_document"}, {"score": 0.008637816423396808, "phrase": "sentence-level_features"}, {"score": 0.005745479338235243, "phrase": "similarity_degree"}, {"score": 0.005193510177173596, "phrase": "discriminant_function"}, {"score": 0.00481495049065317, "phrase": "near-duplicate_documents"}, {"score": 0.0046079260641779755, "phrase": "novel_method"}, {"score": 0.004487989502479992, "phrase": "large_collection"}, {"score": 0.0036499505265403377, "phrase": "heavily_weighted_terms"}, {"score": 0.003255364511414329, "phrase": "similarity_measure"}, {"score": 0.002981026404927824, "phrase": "support_vector_machine"}, {"score": 0.0023192835202946005, "phrase": "svm"}, {"score": 0.002288797099841088, "phrase": "trial-and-error_efforts"}, {"score": 0.0022290883852844057, "phrase": "experimental_results"}, {"score": 0.0021613897794439227, "phrase": "near-duplicate_document_detection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Near-duplicate", " Feature selection", " Similarity function", " Training data", " Support vector machine", " Discriminant function"], "paper_abstract": "We present a novel method for detecting near-duplicates from a large collection of documents. Three major parts are involved in our method, feature selection, similarity measure, and discriminant derivation. To find near-duplicates to an input document, each sentence of the input document is fetched and preprocessed, the weight of each term is calculated, and the heavily weighted terms are selected to be the feature of the sentence. As a result, the input document is turned into a set of such features. A similarity measure is then applied and the similarity degree between the input document and each document in the given collection is computed. A support vector machine (SVM) is adopted to learn a discriminant function from a training pattern set, which is then employed to determine whether a document is a near-duplicate to the input document based on the similarity degree between them. The sentence-level features we adopt can better reveal the characteristics of a document. Besides, learning the discriminant function by SVM can avoid trial-and-error efforts required in conventional methods. Experimental results show that our method is effective in near-duplicate document detection. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Detecting near-duplicate documents using sentence-level features and supervised learning", "paper_id": "WOS:000314737600005"}