{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "gpu"}, {"score": 0.022489504177262754, "phrase": "cpu"}, {"score": 0.007052480486064376, "phrase": "asymptotic_profiling"}, {"score": 0.006986727731366909, "phrase": "hybrid_systems"}, {"score": 0.00631417453789442, "phrase": "cap"}, {"score": 0.004551199992546761, "phrase": "new_standard"}, {"score": 0.004508661664944657, "phrase": "high_performance_computing"}, {"score": 0.0035648266669315943, "phrase": "current_dynamic_schedulers"}, {"score": 0.003369322866499541, "phrase": "periodical_balance_operation"}, {"score": 0.0033377940531761985, "phrase": "frequent_synchronizations"}, {"score": 0.0031995142224983094, "phrase": "overall_performance"}, {"score": 0.0026014425686078993, "phrase": "profiling_technique"}, {"score": 0.0023902026696615473, "phrase": "gpu's_performance_characteristics"}, {"score": 0.0021652891317252994, "phrase": "state-of-the-art_co-scheduling_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["GPU", " Hybrid system", " Scheduling", " Data-parallelism"], "paper_abstract": "Hybrid systems with CPU and GPU have become new standard in high performance computing. Workload can be split and distributed to CPU and GPU to utilize them for data-parallelism in hybrid systems. But it is challenging to manually split and distribute the workload between CPU and GPU since the performance of GPU is sensitive to the workload it received. Therefore, current dynamic schedulers balance workload between CPU and GPU periodically and dynamically. The periodical balance operation causes frequent synchronizations between CPU and GPU. It often degrades the overall performance because of the overhead of synchronizations. To solve the problem, we propose a Co-Scheduling Strategy Based on Asymptotic Profiling (CAP). CAP dynamically splits and distributes the workload to CPU and GPU with only a few synchronizations. It adopts the profiling technique to predict performance and partitions the workload according to the performance. It is also optimized for GPU's performance characteristics. We examine our proof-of-concept system with six benchmarks and evaluation result shows that CAP produces up to 42.7% performance improvement on average compared with the state-of-the-art co-scheduling strategies. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "CPU plus GPU scheduling with asymptotic profiling", "paper_id": "WOS:000332751900006"}