{"auto_keywords": [{"score": 0.040449370381867335, "phrase": "executable_mappings"}, {"score": 0.03827193369444666, "phrase": "software_engineers"}, {"score": 0.00481495049065317, "phrase": "semantic-web_ontologies"}, {"score": 0.004766487181100495, "phrase": "semantic-web_ontology"}, {"score": 0.004623990904432388, "phrase": "data_model"}, {"score": 0.00438105507792004, "phrase": "large_amount"}, {"score": 0.004351595642056769, "phrase": "heterogeneous_ontologies"}, {"score": 0.004293267161763508, "phrase": "strong_need"}, {"score": 0.0037133478610481994, "phrase": "trivial_task"}, {"score": 0.00314708280192844, "phrase": "nested-relational_data_models"}, {"score": 0.002685024286204448, "phrase": "incoherent_target_data"}, {"score": 0.0026134084008199933, "phrase": "mostode"}, {"score": 0.002535115422089855, "phrase": "sparql_executable_mappings"}, {"score": 0.0024674880645446312, "phrase": "salient_features"}, {"score": 0.002267536195741775, "phrase": "semantic-web_technologies"}, {"score": 0.0022070310530794097, "phrase": "visual_aids"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data exchange", " Semantic web", " Executable mappings", " SPARQL"], "paper_abstract": "A semantic-web ontology, simply known as ontology, comprises a data model and data that should comply with it. Due to their distributed nature, there exist a large amount of heterogeneous ontologies, and a strong need for exchanging data amongst them, i.e., populating a target ontology using data that come from one or more source ontologies. Data exchange may be implemented using correspondences that are later transformed into executable mappings; however, exchanging data amongst ontologies is not a trivial task, so tools that help software engineers to exchange data amongst ontologies are a must. In the literature, there are a number of tools to automatically generate executable mappings; unfortunately, they have some drawbacks, namely: (1) they were designed to work with nested-relational data models, which prevents them to be applied to ontologies; (2) they require their users to handcraft and maintain their executable mappings, which is not appealing; or (3) they do not attempt to identify groups of correspondences, which may easily lead to incoherent target data. In this article, we present MostoDE, a tool that assists software engineers in generating SPARQL executable mappings and exchanging data amongst ontologies. The salient features of our tool are as follows: it allows to automate the generation of executable mappings using correspondences and constraints; it integrates several systems that implement semantic-web technologies to exchange data; and it provides visual aids for helping software engineers to exchange data amongst ontologies. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "MostoDE: A tool to exchange data amongst semantic-web ontologies", "paper_id": "WOS:000318330100004"}