{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "orfan_genes"}, {"score": 0.014894909179667775, "phrase": "large_number"}, {"score": 0.004685575787741084, "phrase": "sequence_analysis"}, {"score": 0.004240117018527713, "phrase": "orfans"}, {"score": 0.0038895008852940323, "phrase": "simple_measure"}, {"score": 0.0036663981146086103, "phrase": "amino_acid_composition"}, {"score": 0.0035677736570659813, "phrase": "average_composition"}, {"score": 0.003257727050827128, "phrase": "amino_acid_composition_bias"}, {"score": 0.003056819704624705, "phrase": "nucleotide_frequencies"}, {"score": 0.0029209233709517634, "phrase": "intergenic_regions"}, {"score": 0.0027159094186967247, "phrase": "recent_orfan_proteins"}, {"score": 0.0026188490199688013, "phrase": "random_'proteins"}, {"score": 0.0022951216874671516, "phrase": "evolutionary_scenario"}, {"score": 0.002203016940021265, "phrase": "random_mutations"}, {"score": 0.002124247104243502, "phrase": "composition_preference"}], "paper_keywords": [""], "paper_abstract": "Motivation: Intriguingly, sequence analysis of genomes reveals that a large number of genes are unique to each organism. The origin of these genes, termed ORFans, is not known. Here, we explore the origin of ORFan genes by de. ning a simple measure called 'composition bias', based on the deviation of the amino acid composition of a given sequence from the average composition of all proteins of a given genome. Results: For a set of 47 prokaryotic genomes, we show that the amino acid composition bias of real proteins, random 'proteins' (created by using the nucleotide frequencies of each genome) and 'proteins' translated from intergenic regions are distinct. For ORFans, we observed a correlation between their composition bias and their relative evolutionary age. Recent ORFan proteins have compositions more similar to those of random 'proteins', while the compositions of more ancient ORFan proteins are more similar to those of the set of all proteins of the organism. This observation is consistent with an evolutionary scenario wherein ORFan genes emerged and underwent a large number of random mutations and selection, eventually adapting to the composition preference of their organism over time.", "paper_title": "Composition bias and the origin of ORFan genes", "paper_id": "WOS:000276737100003"}