{"auto_keywords": [{"score": 0.03769716586279515, "phrase": "top-k_packages"}, {"score": 0.00481495049065317, "phrase": "classical_recommender_systems"}, {"score": 0.004593787100061613, "phrase": "single_item"}, {"score": 0.004167315942319306, "phrase": "sample_applications"}, {"score": 0.004139401327448803, "phrase": "travel_planning"}, {"score": 0.0040978781692373005, "phrase": "limited_budget"}, {"score": 0.004002596930301241, "phrase": "twitter_users"}, {"score": 0.003949144559926685, "phrase": "worthwhile_tweeters"}, {"score": 0.003406091279580424, "phrase": "composite_recommendations"}, {"score": 0.0030585152972811692, "phrase": "maximum_total_cost"}, {"score": 0.0029973957125353306, "phrase": "recommended_set"}, {"score": 0.002821247621250663, "phrase": "information_sources"}, {"score": 0.002525203082448825, "phrase": "np"}, {"score": 0.0023523750536537102, "phrase": "approximation_quality"}, {"score": 0.0022365262201954643, "phrase": "thorough_experimentation"}, {"score": 0.0022215160785078775, "phrase": "empirical_analysis"}, {"score": 0.0021049977753042253, "phrase": "exact_algorithms"}], "paper_keywords": ["recommendation algorithms", " optimization", " top-k query processing"], "paper_abstract": "Classical recommender systems provide users with a list of recommendations where each recommendation consists of a single item, e.g., a book or DVD. However, several applications can benefit from a system capable of recommending packages of items, in the form of sets. Sample applications include travel planning with a limited budget (price or time) and twitter users wanting to select worthwhile tweeters to follow, given that they can deal with only a bounded number of tweets. In these contexts, there is a need for a system that can recommend the top-k packages for the user to choose from. Motivated by these applications, we consider composite recommendations, where each recommendation comprises a set of items. Each item has both a value (rating) and a cost associated with it, and the user specifies a maximum total cost (budget) for any recommended set of items. Our composite recommender system has access to one or more component recommender systems focusing on different domains, as well as to information sources which can provide the cost associated with each item. Because the problem of decidingwhether there is a recommendation (package)whose cost is under a given budget and whose value exceeds some threshold is NP-complete, we devise several approximation algorithms for generating the top-k packages as recommendations. We analyze the efficiency as well as approximation quality of these algorithms. Finally, using two real and two synthetic datasets, we subject our algorithms to thorough experimentation and empirical analysis. Our findings attest to the efficiency and quality of our approximation algorithms for the top-k packages compared to exact algorithms.", "paper_title": "Composite recommendations: from items to packages", "paper_id": "WOS:000304876500002"}