{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topological_relationships"}, {"score": 0.04741138420449486, "phrase": "spatial_objects"}, {"score": 0.04576865007383599, "phrase": "topological_relations"}, {"score": 0.03656013644559195, "phrase": "mathematical_framework"}, {"score": 0.0045843245695654875, "phrase": "different_relationships"}, {"score": 0.0038603905208013482, "phrase": "small_area"}, {"score": 0.003250403288147613, "phrase": "first_part"}, {"score": 0.0031714880645482496, "phrase": "new_topological_model"}, {"score": 0.002994701080666466, "phrase": "longish_rectangle"}, {"score": 0.002933973181012572, "phrase": "narrow_ribbon"}, {"score": 0.002583931950389087, "phrase": "smaller_scales"}, {"score": 0.0023903140267755576, "phrase": "different_components"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Topological relationships", " Ribbon topology", " Visual acuity", " Ribbon-region relation", " Downscaling"], "paper_abstract": "In a map, there are different relationships between spatial objects, such as topological, projective, distance, etc. Regarding topological relations, if the scale of the map is changed and if some spatial objects are generalized, not only the shapes of those objects will change (for instance, a small area becomes a point and then disappears as the scale diminishes), but also their topological relations can vary according to scale. In addition, a mathematical framework which models the variety of this category of relationships does not exist. In the first part of this paper, a new topological model is presented based on ribbons which are defined through a transformation of a longish rectangle; so, a narrow ribbon will mutate to a line and then will disappear. Suppose a road is running along a lake, at some scales, they both appear disjointed whereas at some smaller scales, they meet. So, the topological relations mutate according to scale. In this paper, the different components of this mathematical framework are discussed. For each situation, some assertions are defined which formulate the mutation of the topological relationships into other ones when downscaling. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Mathematical framework for topological relationships between ribbons and regions", "paper_id": "WOS:000348622100005"}