{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "novice_usability_practitioners"}, {"score": 0.008484015241407164, "phrase": "usability_practitioners"}, {"score": 0.004763565662615503, "phrase": "usability_engineering_tools"}, {"score": 0.0045879792359519375, "phrase": "usability_engineering_processes"}, {"score": 0.0044426140044122545, "phrase": "interaction_designs"}, {"score": 0.0038226070564362697, "phrase": "usability_engineering_process"}, {"score": 0.003584025547693836, "phrase": "critical_usability_data"}, {"score": 0.003451766520526601, "phrase": "usability_data"}, {"score": 0.0031504667809625344, "phrase": "appropriate_usability_engineering_tool_support"}, {"score": 0.003066945490483524, "phrase": "existing_usability_engineering_tools"}, {"score": 0.002969628818856786, "phrase": "experienced_usability_practitioners"}, {"score": 0.002652639568848117, "phrase": "tool_feature"}, {"score": 0.0026242699269026204, "phrase": "usability_problem_instance_records"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Usability evaluation", " Usability problem instances", " Usability engineering tool support"], "paper_abstract": "Although usability practitioners have successfully applied usability engineering processes to increase the usability of interaction designs, the literature suggests that usability practitioners experience a number of difficulties that negatively impact the effectiveness of their work, which in turn affects the effectiveness of the usability engineering process within which they work. These difficulties include identifying and recording critical usability data and understanding and establishing relationships among usability data. These difficulties are particularly pronounced for novice usability practitioners. One approach to addressing these difficulties is through appropriate usability engineering tool support. We argue that existing usability engineering tools offer excellent support for helping experienced usability practitioners more efficiently do their jobs, but they provide little support for helping novice usability practitioners more effectively do their jobs. We introduce a tool feature, usability problem instance records, to better support novice usability practitioners. We describe the results of a study of this feature, which suggest that the feature helps to improve two aspects of the effectiveness of novice usability practitioners; reliability and quality. (c) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Supporting novice usability practitioners with usability engineering tools", "paper_id": "WOS:000265802200005"}