{"auto_keywords": [{"score": 0.049798208892916335, "phrase": "human_interactions"}, {"score": 0.04551066328476993, "phrase": "human_work"}, {"score": 0.010367088161970855, "phrase": "knowledge_intensive_service_processes"}, {"score": 0.00481495049065317, "phrase": "dynamic_changes"}, {"score": 0.004744686475551315, "phrase": "intensive_services"}, {"score": 0.004620773128779254, "phrase": "human-oriented_way"}, {"score": 0.0045399591300830456, "phrase": "complex_operations"}, {"score": 0.004500081299720827, "phrase": "intellectual_nature"}, {"score": 0.004012327233842635, "phrase": "strong_representation"}, {"score": 0.0036949697378821458, "phrase": "clear_representation"}, {"score": 0.0036732826889280487, "phrase": "human_interaction_management"}, {"score": 0.0035042905855674875, "phrase": "role-based_approach"}, {"score": 0.0033332184113249444, "phrase": "collaborative_human_interaction"}, {"score": 0.0031891990067601295, "phrase": "state-driven_modeling_approach"}, {"score": 0.0029281177756193153, "phrase": "previously_defined_sequence"}, {"score": 0.0026334743451638365, "phrase": "dynamic_nature"}, {"score": 0.0024900877185228647, "phrase": "flexible_management"}, {"score": 0.00237539960152304, "phrase": "decentralized_way"}, {"score": 0.002354489734007631, "phrase": "interaction_participants"}, {"score": 0.002320047233050843, "phrase": "involved_interaction"}, {"score": 0.0022928555178098947, "phrase": "continuous_negotiation"}, {"score": 0.002252662984070481, "phrase": "ultimate_goal"}, {"score": 0.0021679744903823793, "phrase": "decentralized_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human Interaction Management", " Knowledge intensive service", " State-driven interaction modeling", " Dynamic change", " Decentralized management", " Ontology engineering"], "paper_abstract": "The knowledge intensive service processes should be managed in a human-oriented way since humans who naturally undertake complex operations of an intellectual nature in the processes are the most valuable resources. The most fundamental nature of human work is collaborative and dynamic. Humans interact and communicate with each other to accomplish their jobs in the process. To help them to work together, a strong representation of the process should be provided to facilitate them to clearly understand who they should interact with and what activities need to be performed. For the clear representation, Human Interaction Management (HIM), which has been suggested to comprehensively support human work, adopts a role-based approach to process modeling. It, however, tends to hide elements of interactions although the collaborative human interaction is one of the most fundamental nature of human work. To remedy this problem, a state-driven modeling approach to human interactions was presented. It clearly visualizes the interactions so that humans can be guided through it. However, they do not just follow the previously defined sequence of activities, but continuously work out how they are going to proceed from now on according to the state of things they encounter throughout the life of the work. To fully support the dynamic nature of human work, human interactions should be flexibly managed. Therefore, this paper presents a framework for the flexible management of human interactions. The framework provides a capability to flexibly manage the interactions in a decentralized way by allowing interaction participants to dynamically change the involved interaction based on the continuous negotiation of how to achieve the ultimate goal of the interaction. It will be a basis for realization of decentralized management of human interactions in knowledge intensive service processes. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A procedural framework for dynamic changes of human interactions in knowledge intensive services", "paper_id": "WOS:000297823300054"}