{"auto_keywords": [{"score": 0.0406718782151503, "phrase": "climate_change"}, {"score": 0.015719716506582538, "phrase": "climate_change_communication"}, {"score": 0.015167551261805043, "phrase": "gender_differences"}, {"score": 0.012844226200953435, "phrase": "climate_change_debate"}, {"score": 0.010844988991986652, "phrase": "female_tweeters"}, {"score": 0.01046223167784141, "phrase": "male_tweeters"}, {"score": 0.007704846854459792, "phrase": "significant_impact"}, {"score": 0.004765482708043842, "phrase": "purpose_-_the_purpose"}, {"score": 0.004320055598195391, "phrase": "authors'_gender"}, {"score": 0.0041666157975446564, "phrase": "common_topics"}, {"score": 0.004145143433523008, "phrase": "specific_contexts"}, {"score": 0.0040186038781533946, "phrase": "male_or_female_tweeters"}, {"score": 0.003956784357357341, "phrase": "usernames'_stance"}, {"score": 0.003767203575060969, "phrase": "unclear_groups"}, {"score": 0.0036616109902631293, "phrase": "user_account"}, {"score": 0.0034951469511975346, "phrase": "overall_male_and_female_tweeters"}, {"score": 0.0034147649270704463, "phrase": "clear_differences"}, {"score": 0.0032933728992965545, "phrase": "significantly_more_campaigns"}, {"score": 0.0032510690712452147, "phrase": "convinced_attitude"}, {"score": 0.003234299589505403, "phrase": "anthropogenic_impact"}, {"score": 0.0031762825024008994, "phrase": "significantly_more_private_persons"}, {"score": 0.0031354779851351287, "phrase": "sceptical_stance"}, {"score": 0.0028641117451272294, "phrase": "theoretical_level"}, {"score": 0.0027267406923803367, "phrase": "practical_implications"}, {"score": 0.002684740763324991, "phrase": "communication_strategies"}, {"score": 0.002650234110910539, "phrase": "female_and_male_audiences"}, {"score": 0.002582542204672381, "phrase": "local_campaigns"}, {"score": 0.0025692121921779935, "phrase": "news_media"}, {"score": 0.0024906610581090223, "phrase": "present_research"}, {"score": 0.002286781334850213, "phrase": "increased_understanding"}, {"score": 0.002234127217914019, "phrase": "social_media_use"}, {"score": 0.0021049977753042253, "phrase": "data_source"}], "paper_keywords": ["Twitter", " Climate change", " Social media", " Communication", " Gender differences"], "paper_abstract": "Purpose - The purpose of this paper is to present a study about gender differences in the climate change communication on Twitter and in the use of affordances on Twitter. Design/methodology/approach - The data set consists of about 250,000 tweets and retweets for which the authors' gender was identified. While content of tweets and hashtags used were analysed for common topics and specific contexts, the usernames that were proportionately more frequently mentioned by either male or female tweeters were coded according to the usernames' stance in the climate change debate into convinced (that climate change is caused by humans), sceptics, neutrals and unclear groups, and according to the type or role of the user account (e. g. campaign, organization, private person). Findings - The results indicate that overall male and female tweeters use very similar language in their tweets, but clear differences were observed in the use of hashtags and usernames, with female tweeters mentioning significantly more campaigns and organizations with a convinced attitude towards anthropogenic impact on climate change, while male tweeters mention significantly more private persons and usernames with a sceptical stance. The differences were even greater when retweets and duplicate tweets by the same author were removed from the data, indicating how retweeting can significantly influence the results. Practical implications - On a theoretical level the results increase the understanding for how women and men view and engage with climate change. This has practical implications for organizations interested in developing communication strategies for reaching and engaging female and male audiences on Twitter. While female tweeters can be targeted via local campaigns and news media, male tweeters seem to follow more political and scientific information. The results from the present research also showed that more research about the meaning of retweeting is needed, as the authors have shown how retweets can have a significant impact on the results. Originality/value - The findings contribute towards increased understanding of both gender differences in the climate change debate and in social media use in general. Beyond that this research showed how retweeting may have a significant impact on research where tweets are used as a data source.", "paper_title": "Gender differences in the climate change communication on Twitter", "paper_id": "WOS:000369699600006"}