{"auto_keywords": [{"score": 0.03406317587446558, "phrase": "data-based_prior_models"}, {"score": 0.009998253522201924, "phrase": "motion_capture_data"}, {"score": 0.009497540799572194, "phrase": "prior_model"}, {"score": 0.00481495049065317, "phrase": "data-free_prior_model"}, {"score": 0.004773692073488661, "phrase": "upper_body_pose_estimation"}, {"score": 0.004494570360108983, "phrase": "human_body"}, {"score": 0.004361163586439822, "phrase": "video_sequence"}, {"score": 0.004053362743156545, "phrase": "pose_prior_model"}, {"score": 0.003816197777388722, "phrase": "image_data"}, {"score": 0.0025892330566358503, "phrase": "different_types"}, {"score": 0.002448061472257196, "phrase": "benchmark_data_sets"}, {"score": 0.002416589459425828, "phrase": "proposed_prior_model"}, {"score": 0.0023145690608400425, "phrase": "body_motions"}, {"score": 0.002255431275670053, "phrase": "training_data"}, {"score": 0.002132420504803564, "phrase": "different_body_motions"}, {"score": 0.0021049977753042253, "phrase": "different_subjects"}], "paper_keywords": ["Body pose estimation", " body pose model", " knowledge-based model"], "paper_abstract": "Video based human body pose estimation seeks to estimate the human body pose from an image or a video sequence, which captures a person exhibiting some activities. To handle noise and occlusion, a pose prior model is often constructed and is subsequently combined with the pose estimated from the image data to achieve a more robust body pose tracking. Various body prior models have been proposed. Most of them are data-driven, typically learned from 3D motion capture data. In addition to being expensive and time-consuming to collect, these data-based prior models cannot generalize well to activities and subjects not present in the motion capture data. To alleviate this problem, we propose to learn the prior model from anatomic, biomechanics, and physical constraints, rather than from the motion capture data. For this, we propose methods that can effectively capture different types of constraints and systematically encode them into the prior model. Experiments on benchmark data sets show the proposed prior model, compared with data-based prior models, achieves comparable performance for body motions that are present in the training data. It, however, significantly outperforms the data-based prior models in generalization to different body motions and to different subjects.", "paper_title": "Data-Free Prior Model for Upper Body Pose Estimation and Tracking", "paper_id": "WOS:000325223300005"}