{"auto_keywords": [{"score": 0.047094807036930655, "phrase": "multiple_web_sites"}, {"score": 0.01263756896219771, "phrase": "distributed_user_interfaces"}, {"score": 0.011642569864543257, "phrase": "different_web_sites"}, {"score": 0.01046720631708511, "phrase": "manual_tasks"}, {"score": 0.010403707303353526, "phrase": "automated_tasks"}, {"score": 0.00481495049065317, "phrase": "distributed_user_interface_orchestration"}, {"score": 0.004446677711302801, "phrase": "web_navigation"}, {"score": 0.00437913966678655, "phrase": "lonely_activity"}, {"score": 0.004299440848047056, "phrase": "large_proportion"}, {"score": 0.004208282550386197, "phrase": "collaborative_activities"}, {"score": 0.003711723285313348, "phrase": "major_role"}, {"score": 0.0036777702949712457, "phrase": "multiple_users"}, {"score": 0.0033241072942139568, "phrase": "user_tasks"}, {"score": 0.0032635467579751423, "phrase": "flexible_process"}, {"score": 0.0029677378488677983, "phrase": "simple_instructions"}, {"score": 0.002869329994644954, "phrase": "web_site"}, {"score": 0.0027741761880779535, "phrase": "web_augmentation"}, {"score": 0.0026011706232569316, "phrase": "manual_and_automated_tasks"}, {"score": 0.0025615908073796027, "phrase": "specific_dom_elements"}, {"score": 0.0024766170166319735, "phrase": "dom_elements"}, {"score": 0.002453934333239467, "phrase": "diverse_web_sites"}, {"score": 0.0023507916951658455, "phrase": "diverse_web_site"}, {"score": 0.002190648965946838, "phrase": "case_study"}, {"score": 0.0021705796895687864, "phrase": "collaborative_trip"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distributed user interfaces", " Task and process modeling", " Web application", " Web augmentation", " Collaborative Web tasks"], "paper_abstract": "Currently, a lot of the tasks engaged by users over the Web involve dealing with multiple Web sites. Moreover, whilst Web navigation was considered as a lonely activity in the past, a large proportion of users are nowadays engaged in collaborative activities over the Web. In this paper we argue that these two aspects of collaboration and tasks spanning over multiple Web sites call for a level of coordination that require Distributed User Interfaces (DUI). In this context, DUIs would play a major role by helping multiple users to coordinate their activities whilst working collaboratively to complete tasks at different Web sites. For that, we propose in this paper an approach to create distributed user interfaces featuring procedures that are aimed to orchestrate user tasks over multiple Web sites. Our approach supports flexible process modeling by allowing users to combine manual tasks and automated tasks from a repertoire of patterns of tasks performed over the Web. In our approach, whilst manual tasks can be regarded as simple instructions that tell users how to perform a task over a Web site, automated tasks correspond to tools built under the concept of Web augmentation (as it augments the repertoire of tasks users can perform over the Web) called Web augmenters. Both manual and automated tasks are usually supported by specific DOM elements available in different Web sites. Thus, by combining tasks and DOM elements distributed in diverse Web sites our approach supports the creation of procedures that allows seamless users interaction with diverse Web site. Moreover, such an approach is aimed at supporting the collaboration between users sharing procedures. The approach is duly illustrated by a case study describing a collaborative trip planning over the Web. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An approach for supporting distributed user interface orchestration over the Web", "paper_id": "WOS:000328710700007"}