{"auto_keywords": [{"score": 0.03556228763437264, "phrase": "independence_model"}, {"score": 0.00481495049065317, "phrase": "compact_minimal_windows"}, {"score": 0.004683540676363745, "phrase": "key_problem"}, {"score": 0.00459186790405058, "phrase": "pattern_mining"}, {"score": 0.004110549138321181, "phrase": "new_quality_measure"}, {"score": 0.003904495523681369, "phrase": "possible_restrictions"}, {"score": 0.003508834578859094, "phrase": "actual_episode_events"}, {"score": 0.0034264854489231148, "phrase": "expected_length"}, {"score": 0.0032546105164772995, "phrase": "post-pruning_step"}, {"score": 0.0032034752726003025, "phrase": "frequent_episodes"}, {"score": 0.0028110458014332187, "phrase": "main_technical_contribution"}, {"score": 0.002546002312015341, "phrase": "intricate_finite_state_machines"}, {"score": 0.0024763626300729575, "phrase": "needed_statistics"}, {"score": 0.0021987994275190314, "phrase": "tens_of_thousands_episodes"}, {"score": 0.0021471293746360026, "phrase": "text_data"}, {"score": 0.0021049977753042253, "phrase": "interpretable_episodes"}], "paper_keywords": ["Episode mining", " Statistical test", " Independence model", " Minimal window"], "paper_abstract": "Discovering the most interesting patterns is the key problem in the field of pattern mining. While ranking or selecting patterns is well-studied for itemsets it is surprisingly under-researched for other, more complex, pattern types. In this paper we propose a new quality measure for episodes. An episode is essentially a set of events with possible restrictions on the order of events. We say that an episode is significant if its occurrence is abnormally compact, that is, only few gap events occur between the actual episode events, when compared to the expected length according to the independence model. We can apply this measure as a post-pruning step by first discovering frequent episodes and then rank them according to this measure. In order to compute the score we will need to compute the mean and the variance according to the independence model. As a main technical contribution we introduce a technique that allows us to compute these values. Such a task is surprisingly complex and in order to solve it we develop intricate finite state machines that allow us to compute the needed statistics. We also show that asymptotically our score can be interpreted as a value. In our experiments we demonstrate that despite its intricacy our ranking is fast: we can rank tens of thousands episodes in seconds. Our experiments with text data demonstrate that our measure ranks interpretable episodes high.", "paper_title": "Discovering episodes with compact minimal windows", "paper_id": "WOS:000332951300006"}