{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_bibliometric_indicator"}, {"score": 0.00444377150105556, "phrase": "widespread_debate"}, {"score": 0.004303404058571052, "phrase": "diverse_applications"}, {"score": 0.004052007312730483, "phrase": "-_the_review"}, {"score": 0.0035635256137029592, "phrase": "h-index's_advantages"}, {"score": 0.0032231139180761183, "phrase": "major_subject"}, {"score": 0.002915125480162171, "phrase": "indexes'_shortcomings"}, {"score": 0.002615381301695394, "phrase": "bibliometric_indicators"}, {"score": 0.0025840347813610815, "phrase": "research_performance"}, {"score": 0.002308953751676031, "phrase": "exploratory_stage"}], "paper_keywords": ["Information studies", " Indexing", " Information research"], "paper_abstract": "Purpose - This review aims to show, broadly, how the h-index has become a subject of widespread debate, how it has spawned many variants and diverse applications since first introduced in 2005 and some of the issues in its use. Design/methodology/approach - The review drew on a range of material published in 1990 or so sources published since 2005. From these sources, a number of themes were identified and discussed ranging from the h-index's advantages to which citation database might be selected for its calculation. Findings - The analysis shows how the h-index has quickly established itself as a major subject of interest in the field of bibliometrics. Study of the index ranges from its mathematical underpinning to a range of variants perceived to address the indexes' shortcomings. The review illustrates how widely the index has been applied but also how care must be taken in its application. Originality/value - The use of bibliometric indicators to measure research performance continues, with the h-index as its latest addition. The use of the h-index, its variants and many applications to which it has been put are still at the exploratory stage. The review shows the breadth and diversity of this research and the need to verify the veracity of the h-index by more studies.", "paper_title": "The h-index: a broad review of a new bibliometric indicator", "paper_id": "WOS:000283524900005"}