{"auto_keywords": [{"score": 0.043007234959413346, "phrase": "switching_costs"}, {"score": 0.015719716506582538, "phrase": "strategic_choice"}, {"score": 0.004278807087784626, "phrase": "in-house_development"}, {"score": 0.003996983218174335, "phrase": "business_relationship"}, {"score": 0.0030707512751243214, "phrase": "personnel-replacement_costs"}, {"score": 0.0028037753646260937, "phrase": "field_survey"}, {"score": 0.0026790983342162887, "phrase": "cost_types"}, {"score": 0.0023694065215394593, "phrase": "customer_organizations"}, {"score": 0.0023479408542211875, "phrase": "outsourcing_continuation"}, {"score": 0.002213065910356615, "phrase": "relative_preference"}, {"score": 0.0021436720821474973, "phrase": "switching_cost_type"}, {"score": 0.0021049977753042253, "phrase": "elsevier_by"}], "paper_keywords": ["Outsourcing", " Switching", " Costs", " Backsourcing", " Customer", " Vendor", " Supplier", " Strategy"], "paper_abstract": "IT outsourcing contracts are often discontinued in favor of other alternatives (returning to in-house development, or switching to another vendor). Switching costs are experienced when terminating a business relationship and securing an alternative. We tried to answer the question: do switching costs matter significantly in the strategic choice to continue outsourcing, switch vendors, or backsource? Switching costs were considered, such as those due to IT operations (sunk investment, lost performance, system upgrades, uncertainty, and induction-retraining-performance), personnel-replacement costs (candidate search, and IT/setup), and in-house learning (cognitive/behavioral learning). A field survey was conducted, and, for each of these cost types, the differences between group means across the three groups (outsourcing continuation, vendor switching, and backsourcing) were determined. The findings suggested that customer organizations preferred outsourcing continuation most and backsourcing least when their switching costs were high. However, the relative preference for vendor switching depended on the switching cost type. Published by Elsevier By.", "paper_title": "The strategic choice to continue outsourcing, switch vendors, or backsource: Do switching costs matter?", "paper_id": "WOS:000276771300005"}