{"auto_keywords": [{"score": 0.019540173040973805, "phrase": "active_site"}, {"score": 0.010140894562204296, "phrase": "protein_pockets"}, {"score": 0.007744584865282426, "phrase": "protein_pocket"}, {"score": 0.006385797703201318, "phrase": "three-way_partial_least_squares"}, {"score": 0.006208967372665109, "phrase": "inhibitory_activity"}, {"score": 0.00481495049065317, "phrase": "binding_pocket"}, {"score": 0.004551563730037998, "phrase": "starting_point"}, {"score": 0.004183137595671171, "phrase": "minimal_requirement"}, {"score": 0.0038989120088094185, "phrase": "direct_display"}, {"score": 0.0038715697646612766, "phrase": "active_sites"}, {"score": 0.003672500644750565, "phrase": "new_mapping_method"}, {"score": 0.0033513085425415545, "phrase": "molecular_surface_points"}, {"score": 0.0033044432971036652, "phrase": "associated_molecular_electrostatic_potential"}, {"score": 0.003101503914610488, "phrase": "generative_topographic_mapping"}, {"score": 0.00304737045343781, "phrase": "mep_values"}, {"score": 0.0026655969705316708, "phrase": "self-organizing_map_studies"}, {"score": 0.0026375718041787, "phrase": "resulting_regression_coefficient_matrix"}, {"score": 0.002609840513713399, "phrase": "three-way_partial_least_squares_model"}, {"score": 0.0025462598594116373, "phrase": "structural_requirements"}, {"score": 0.0024667783849055634, "phrase": "john_wiley"}, {"score": 0.002188219483646592, "phrase": "gtm_map"}, {"score": 0.0021499920551456956, "phrase": "molecular_electrostatic_potential"}], "paper_keywords": ["spherical self-organizing map", " generative topographic mapping", " three-way PLS", " molecular electrostatic potential", " 2 receptor protein"], "paper_abstract": "The visualization and characterization of protein pockets is the starting point for many structure-based drug design projects. The size and shape of protein pockets dictate 3D geometry of ligands that can strongly inhibit the following biological events. Thus, a minimal requirement for inhibition is that a molecule sterically binds the active site with some allowance for induced fit. Methods for direct display of active sites in a protein have become prevalent in recent years. In this study, a new mapping method, generative topographic mapping, is investigated to describe the 3D surface of protein pocket. The 2 receptor protein is used as a benchmark. By mapping the molecular surface points and assigning the associated molecular electrostatic potential (MEP) values, the original 3D structure of the active site is well reproduced by the 2D latent map in generative topographic mapping. The distributions of MEP values of two 2D latent maps derived from the inhibitor and the 2 receptor protein are well complemented. Using three-way partial least squares modeling, a predictive model linking the inhibitory activity and their MEP values can be constructed, which was not feasible in the previous spherical self-organizing map studies. The resulting regression coefficient matrix of the three-way partial least squares model has many insights for understanding the structural requirements for 2 inhibitory activity. Copyright (c) 2014 John Wiley & Sons, Ltd. Generative topographic mapping (GTM) is investigated to describe the 3D surface of a protein pocket. The original 3D structure of the active site of the 2 receptor protein is well reproduced by the GTM map. The distributions of molecular electrostatic potential (MEP) values of two GTM maps derived from the inhibitor and the 2 receptor protein are well complemented. Using three-way partial least squares modeling, a predictive model linking the inhibitory activity and their MEP values can be constructed.", "paper_title": "Generative topographic mapping of binding pocket of beta 2 receptor and three-way partial least squares modeling of inhibitory activities", "paper_id": "WOS:000342346900004"}