{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "easy_word"}, {"score": 0.003541923233726252, "phrase": "work-related_serendipity"}, {"score": 0.0032529910932231924, "phrase": "semi-structured_interviews"}, {"score": 0.003207173639414978, "phrase": "participants'_own_work-related_experiences"}, {"score": 0.002987557906013826, "phrase": "prior_research"}, {"score": 0.0029454679553901613, "phrase": "previous_models"}, {"score": 0.0028766278519176355, "phrase": "single_model"}, {"score": 0.002155412043665635, "phrase": "main_elements"}], "paper_keywords": ["qualitative research", " information models"], "paper_abstract": "Serendipity is not an easy word to define. Its meaning has been stretched to apply to experiences ranging from the mundane to the exceptional. Serendipity, however, is consistently associated with unexpected and positive personal, scholarly, scientific, organizational, and societal events and discoveries. Diverse serendipitous experiences share a conceptual space; therefore, what lessons can we draw from an exploration of how serendipity unfolds and what may influence it? This article describes an investigation of work-related serendipity. Twelve professionals and academics from a variety of fields were interviewed. The core of the semi-structured interviews focused on participants' own work-related experiences that could be recalled and discussed in depth. This research validated and augmented prior research while consolidating previous models of serendipity into a single model of the process of serendipity, consisting of: Trigger, Connection, Follow-up, and Valuable Outcome, and an Unexpected Thread that runs through 1 or more of the first 4 elements. Together, the elements influence the Perception of Serendipity. Furthermore, this research identified what factors relating to the individual and their environment may facilitate the main elements of serendipity and further influence its perception.", "paper_title": "Investigating serendipity: How it unfolds and what may influence it", "paper_id": "WOS:000355858200012"}