{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "variational_geometric_constraint_data"}, {"score": 0.022293845505582065, "phrase": "product_data"}, {"score": 0.010322570942894732, "phrase": "explicit_semantics"}, {"score": 0.009948300262263779, "phrase": "product_development_systems"}, {"score": 0.0044495843279816075, "phrase": "major_problem"}, {"score": 0.004408456735066782, "phrase": "existing_product_data_exchange_standards"}, {"score": 0.003907013105134715, "phrase": "ontology-based_approach"}, {"score": 0.0034947408949397127, "phrase": "variational_geometric_constraint_specifications"}, {"score": 0.0033515736929172644, "phrase": "variational_geometric_constraint_network_theory"}, {"score": 0.0029838294169759663, "phrase": "rigorous_computer-interpretable_semantics"}, {"score": 0.0029288446848334576, "phrase": "mathematic_logic-based_semantics"}, {"score": 0.0027570267191549774, "phrase": "semantic_enrichment_model"}, {"score": 0.0026811531172346676, "phrase": "cad_systems"}, {"score": 0.0024658019116387845, "phrase": "implemented_ontology"}, {"score": 0.002375714262344562, "phrase": "semantic_queries"}, {"score": 0.0021646022201798247, "phrase": "heterogeneous_product_development_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Semantic", " Variational geometric constraint", " Data semantic exchange", " Ontology", " OWL 2 DL", " SWRL"], "paper_abstract": "Lack of explicit semantics in the product data to be exchanged among product development systems is a major problem for existing product data exchange standards. To solve this problem, the semantics of product data should be enriched to form a basis for exchanging them. This paper proposes an ontology-based approach to enrich the semantics of variational geometric constraint data, one of the most important kinds of product data in product development systems. In this approach, an ontology for variational geometric constraint specifications is constructed by formalizing the specifications in the variational geometric constraint network theory in Web Ontology Language 2 Description Logic (OWL 2 DL) and Semantic Web Rule Language (SWRL). This ontology has rigorous computer-interpretable semantics due to the mathematic logic-based semantics of OWL 2 DL and SWRL. It is capable of providing a semantic enrichment model for the variational geometric constraint data extracted from CAD systems. The ontology is implemented with the use of the OWL 2 DL/SWRL ontology based technologies. As the benefits of the implemented ontology, consistency checking, knowledge reasoning and semantic queries can be automatically performed. These benefits will lay a basis for further exchanging the explicit semantics of variational geometric constraint data among heterogeneous product development systems. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Enriching the semantics of variational geometric constraint data with ontology", "paper_id": "WOS:000352332100006"}