{"auto_keywords": [{"score": 0.04215833196561754, "phrase": "italy"}, {"score": 0.004390060342250211, "phrase": "university_faculty"}, {"score": 0.003921129887153952, "phrase": "high_rates"}, {"score": 0.003782655283668953, "phrase": "individual_research_performance"}, {"score": 0.0032423089921154503, "phrase": "non-significant_differences"}, {"score": 0.003143849342926373, "phrase": "career_advancement"}, {"score": 0.0030957429853133147, "phrase": "children's_research_performance"}, {"score": 0.0028659990472580154, "phrase": "study's_findings"}, {"score": 0.0026261108615242557, "phrase": "low_percentage"}, {"score": 0.0023451553255837317, "phrase": "poor_performers"}, {"score": 0.0022390533383717715, "phrase": "better_performers"}, {"score": 0.0021049977753042253, "phrase": "parental_ties"}], "paper_keywords": ["Nepotism", " Research evaluation", " Productivity", " Bibliometrics", " Universities", " Italy"], "paper_abstract": "In many countries culture, practice or regulations inhibit the co-presence of relatives within the university faculty. We test the legitimacy of such attitudes and provisions, investigating the phenomenon of nepotism in Italy, a nation with high rates of favoritism. We compare the individual research performance of \"children\" who have \"parents\" in the same university against that of the \"non-children\" with the same academic rank and seniority, in the same field. The results show non-significant differences in performance. Analyses of career advancement show that children's research performance is on average superior to that of their colleagues who did not advance. The study's findings do not rule out the existence of nepotism, which has been actually recorded in a low percentage of cases, but do not prove either the most serious presumed consequences of nepotism, namely that relatives who are poor performers are getting ahead of non-relatives who are better performers. In light of these results, many attitudes and norms concerning parental ties in academia should be reconsidered.", "paper_title": "Relatives in the same university faculty: nepotism or merit?", "paper_id": "WOS:000342228300034"}