{"auto_keywords": [{"score": 0.04774633807425784, "phrase": "communication_effectiveness"}, {"score": 0.03511835445577153, "phrase": "relative_advantage"}, {"score": 0.03483627387870651, "phrase": "pgx-cds"}, {"score": 0.014880542617156751, "phrase": "clinical_impact"}, {"score": 0.013666266191005375, "phrase": "physician_characteristics"}, {"score": 0.011334665693165784, "phrase": "prototype_pgx-cds_system"}, {"score": 0.010349462287627311, "phrase": "semi-active_alerts"}, {"score": 0.00481495049065317, "phrase": "pharmacogenomic-based_prescribing_alerts"}, {"score": 0.004696295109780416, "phrase": "personalized_drug_dosing"}, {"score": 0.00461881291305897, "phrase": "pilot_study"}, {"score": 0.004273723657275637, "phrase": "conceptual_framework"}, {"score": 0.004250080379144324, "phrase": "measurement_model"}, {"score": 0.004020694957098141, "phrase": "technology_characteristics"}, {"score": 0.003598265291722353, "phrase": "drug_dosing"}, {"score": 0.0035486713647627246, "phrase": "prescribing_tasks"}, {"score": 0.0035290250358997904, "phrase": "five_simulated_clinical_case_scenarios"}, {"score": 0.003490056936165004, "phrase": "random_order"}, {"score": 0.003441949264109265, "phrase": "twenty-two_physicians"}, {"score": 0.003063076422586359, "phrase": "previous_experience"}, {"score": 0.002549965625377498, "phrase": "published_evidence"}, {"score": 0.0025217811081981174, "phrase": "sixty-five_percent"}, {"score": 0.0023072099436781354, "phrase": "pgx_cds_content"}, {"score": 0.0022377394845878268, "phrase": "physician's_confidence"}, {"score": 0.0022068557886223673, "phrase": "greatest_increases"}, {"score": 0.0021285340816566906, "phrase": "continued_focus"}, {"score": 0.0021049977753042253, "phrase": "content_delivery"}], "paper_keywords": ["Electronic health records", " Computerized physician order entry", " Computer-assisted drug therapy", " Clinical decision support systems", " Physician's practice patterns", " Drug safety", " Personalized medicine", " Pharmacogenomics"], "paper_abstract": "To facilitate personalized drug dosing (PDD), this pilot study explored the communication effectiveness and clinical impact of using a prototype clinical decision support (CDS) system embedded in an electronic health record (EHR) to deliver pharmacogenomic (PGx) information to physicians. We employed a conceptual framework and measurement model to access the impact of physician characteristics (previous experience, awareness, relative advantage, perceived usefulness), technology characteristics (methods of implementation-semi-active/active, actionability-low/high) and a task characteristic (drug prescribed) on communication effectiveness (usefulness, confidence in prescribing decision), and clinical impact (uptake, prescribing intent, change in drug dosing). Physicians performed prescribing tasks using five simulated clinical case scenarios, presented in random order within the prototype PGx-CDS system. Twenty-two physicians completed the study. The proportion of physicians that saw a relative advantage to using PGx-CDS was 83% at the start and 94% at the conclusion of our study. Physicians used semi-active alerts 74-88% of the time. There was no association between previous experience with, awareness of, and belief in a relative advantage of using PGx-CDS and improved uptake. The proportion of physicians reporting confidence in their prescribing decisions decreased significantly after using the prototype PGx-CDS system (p = 0.02). Despite decreases in confidence, physicians perceived a relative advantage to using PGx-CDS, viewed semi-active alerts on most occasions, and more frequently changed doses toward doses supported by published evidence. Specifically, sixty-five percent of physicians reduced their dosing, significantly for capecitabirie (p = 0.002) and mercaptopurine/thioguanine (p = 0.03). These findings suggest a need to improve our prototype such that PGx CDS content is more useful and delivered in a way that improves physician's confidence in their prescribing decisions. The greatest increases in communication effectiveness and clinical impact of PGx-CDS are likely to be realized through continued focus on content, content delivery, and tailoring to physician characteristics. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Making pharmacogenomic-based prescribing alerts more effective: A scenario-based pilot study with physicians", "paper_id": "WOS:000356564700024"}