{"auto_keywords": [{"score": 0.04907561130245922, "phrase": "sheet_metal"}, {"score": 0.004300453431933622, "phrase": "classification_techniques"}, {"score": 0.004078502325220629, "phrase": "key_features"}, {"score": 0.003773449694108617, "phrase": "local_geometry_matrices"}, {"score": 0.0036553070575015344, "phrase": "local_binary_patterns"}, {"score": 0.003591272267478512, "phrase": "local_distance_measure"}, {"score": 0.003275879115801376, "phrase": "local_geometries"}, {"score": 0.0029775511937434797, "phrase": "class_labels"}, {"score": 0.0025938179480905783, "phrase": "non-uniform_manner"}, {"score": 0.0023325586335885104, "phrase": "sheet_metal_parts"}, {"score": 0.0021731423856364003, "phrase": "statistical_significance_test"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D surface representation", " Classification", " Springback prediction in sheet metal forming"], "paper_abstract": "The work presented in this papers is directed at mechanisms where by 3D surfaces can be represented to support the generation and application of classification techniques. Three different mechanisms are presented to allow for the representation of 3D surfaces in such a way that key features are retained while at the same time ensuring compatibility with prediction (classification) techniques. The three representation techniques are: (i) Local Geometry Matrices (LGMs) founded on the concept of local binary patterns, (ii) Local Distance Measure (LDM) founded on the idea that distances from edges (critical points) may be significant, and (iii) Point Series (PS) whereby local geometries are represented in terms of a linearisation of space. The representations are designed to capture the nature of 3D surfaces in terms of their local geometry and predict class labels associated with such local geometries. To act as a focus for the work the prediction of \"springback\" within the context of sheet metal forming is considered, where springback is a form of deformation that occurs (in a non-uniform manner) across a manufactured 3D surface as a result of the application of some sheet metal forming process. The evaluation of each of the techniques, and variations thereof, using sheet metal parts that have been manufactured especially for the purpose, is fully described. The paper also reports on a statistical significance test concerning the results. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Predicting \"springback\" using 3D surface representation techniques: A case study in sheet metal forming", "paper_id": "WOS:000344034300006"}