{"auto_keywords": [{"score": 0.03461617249114157, "phrase": "haptic_guidance"}, {"score": 0.02730946473695459, "phrase": "task_execution"}, {"score": 0.00481495049065317, "phrase": "haptic_shared_control"}, {"score": 0.004783483480147339, "phrase": "tele-manipulation"}, {"score": 0.0046903838780456035, "phrase": "guidance"}, {"score": 0.004629193340643127, "phrase": "haptic"}, {"score": 0.004553914287137776, "phrase": "promising_approach"}, {"score": 0.00450933377534525, "phrase": "tele-manipulated_task_execution"}, {"score": 0.004450568197899267, "phrase": "safe_and_effective_control_actions"}, {"score": 0.0043495571869907376, "phrase": "current_research"}, {"score": 0.004306968571854912, "phrase": "guidance_forces"}, {"score": 0.003967835031625103, "phrase": "practical_implementations"}, {"score": 0.0036673238814279286, "phrase": "haptic_guidance_forces"}, {"score": 0.0034118234596993836, "phrase": "realistic_tele-manipulated_assembly_task"}, {"score": 0.0032585499655442404, "phrase": "namely_no_haptic_guidance"}, {"score": 0.003091767402370757, "phrase": "translational_inaccuracies"}, {"score": 0.0029238768315330305, "phrase": "second_smaller_inaccuracy"}, {"score": 0.002866817775018445, "phrase": "natural_haptic_feedback"}, {"score": 0.0027200305495826797, "phrase": "operator's_ability"}, {"score": 0.0022777800735119405, "phrase": "overall_task_performance"}, {"score": 0.002218668420806254, "phrase": "constrained_translational_movement"}, {"score": 0.0021188825171510094, "phrase": "higher_quality"}, {"score": 0.0021049977753042253, "phrase": "haptic_transparency"}], "paper_keywords": ["Tele-manipulation", " remote handling", " haptics", " haptic shared control"], "paper_abstract": "Haptic shared control is a promising approach to improve tele-manipulated task execution, by making safe and effective control actions tangible through guidance forces. In current research, these guidance forces are most often generated based on pre-generated, errorless models of the remote environment. Hence such guidance forces are exempt from the inaccuracies that can be expected in practical implementations. The goal of this research is to quantify the extent to which task execution is degraded by inaccuracies in the model on which haptic guidance forces are based. In a human-in-the-loop experiment, subjects (n = 14) performed a realistic tele-manipulated assembly task in a virtual environment. Operators were provided with various levels of haptic guidance, namely no haptic guidance (conventional tele-manipulation), haptic guidance without inaccuracies, and haptic guidance with translational inaccuracies (one large inaccuracy, in the order of magnitude of the task, and a second smaller inaccuracy). The quality of natural haptic feedback (i.e., haptic transparency) was varied between high and low to identify the operator's ability to detect and cope with inaccuracies in haptic guidance. The results indicate that haptic guidance is beneficial for task execution when no inaccuracies are present in the guidance. When inaccuracies are present, this may degrade task execution, depending on the magnitude and the direction of the inaccuracy. The effect of inaccuracies on overall task performance is dominated by effects found for the Constrained Translational Movement, due to its potential for jamming. No evidence was found that a higher quality of haptic transparency helps operators to detect and cope with inaccuracies in the haptic guidance.", "paper_title": "Haptic Shared Control in Tele-Manipulation: Effects of Inaccuracies in Guidance on Task Execution", "paper_id": "WOS:000356521100005"}