{"auto_keywords": [{"score": 0.04931727328027492, "phrase": "monetary_value"}, {"score": 0.010500147577453321, "phrase": "donation_likelihood"}, {"score": 0.008089323074233894, "phrase": "bernoulli-gaussian_mixture_model"}, {"score": 0.004814951682547962, "phrase": "bernoulli-gaussian"}, {"score": 0.004564219532677855, "phrase": "computational_power"}, {"score": 0.004539872716235899, "phrase": "enterprise_technology"}, {"score": 0.00449156625373873, "phrase": "customer_relationship_management"}, {"score": 0.004280442521885289, "phrase": "large_numbers"}, {"score": 0.004167451906343558, "phrase": "demographic_characteristics"}, {"score": 0.003845994935767022, "phrase": "organization's_ability"}, {"score": 0.0038152404172111815, "phrase": "better_customer_service"}, {"score": 0.0035778632599436024, "phrase": "repeat_transactions"}, {"score": 0.003437036036889996, "phrase": "expectation-maximization_algorithm"}, {"score": 0.0034004242101610556, "phrase": "associated_parameters"}, {"score": 0.003346233959203152, "phrase": "consumer_population"}, {"score": 0.0032753168662834516, "phrase": "extensive_dataset"}, {"score": 0.003087925324399118, "phrase": "individual_traits"}, {"score": 0.0029112237481352084, "phrase": "resource_allocation_decisions"}, {"score": 0.0028418763133526257, "phrase": "alumni-oriented_activities"}, {"score": 0.002751968796076333, "phrase": "increased_donation_likelihood"}, {"score": 0.002553063001454623, "phrase": "systematic_differences"}, {"score": 0.0024263237087568464, "phrase": "proposed_segmentation_approach"}, {"score": 0.0022569431725668106, "phrase": "proposed_model"}, {"score": 0.0022090603669919187, "phrase": "multivariate_normal_mixture_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Market segmentation", " Finite mixture models", " Alumni giving", " Fundraising", " Bernoulli-Gaussian Distribution", " Expectation-Maximization Algorithm"], "paper_abstract": "Advances in computational power and enterprise technology, e.g., Customer Relationship Management (CRM) software and data warehouses, allow many businesses to collect a wealth of information on large numbers of consumers. This includes information on past purchasing behavior, demographic characteristics, as well as how consumers interact with the organization, e.g., in events, on the web. The ability to mine such data sets is crucial to an organization's ability to deliver better customer service, as well as manage its resource allocation decisions. To this end, we formulate a Bernoulli-Gaussian mixture model that jointly describes the likelihood and monetary value of repeat transactions. In addition to presenting the model, we derive an instance of the Expectation-Maximization Algorithm to estimate the associated parameters, and to segment the consumer population. We apply the model to an extensive dataset of donations received at a private, Ph.D.-granting university in the Midwestern United States. We use the model to assess the effect of individual traits on their contribution likelihood and monetary value, discuss insights stemming from the results, and how the model can be used to support resource allocation decisions. For example, we find that participation in alumni-oriented activities, i.e., reunions or travel programs, is associated with increased donation likelihood and value, and that fraternity/sorority membership magnifies this effect. The presence/characterization of unobserved, cross-sectional heterogeneity in the data set, i.e., unobserved/unexplained systematic differences among individuals, is, perhaps, our most important finding. Finally, we argue that the proposed segmentation approach is more appealing than alternatives appearing in the literature that consider donation likelihood and monetary value separately. Among them and as a benchmark, we compare the proposed model to a segmentation that builds on a multivariate Normal mixture model, and conclude that the Bernoulli-Gaussian mixture model provides a more coherent approach to generate segments. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A Bernoulli-Gaussian mixture model of donation likelihood and monetary value: An application to alumni segmentation in a university setting", "paper_id": "WOS:000328234000043"}