{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "negative_publicity"}, {"score": 0.004403480614319231, "phrase": "adverse_effect"}, {"score": 0.004267896572751978, "phrase": "online_environments"}, {"score": 0.004229927464182562, "phrase": "consumers'_word"}, {"score": 0.004063186599879217, "phrase": "appropriate_response_strategy"}, {"score": 0.003973398317120165, "phrase": "consumers'_emotional_reactions"}, {"score": 0.003868257410961701, "phrase": "potential_damage"}, {"score": 0.0037827603118271757, "phrase": "explorative_multiple_case_study"}, {"score": 0.0036991458715587163, "phrase": "eight_negative_publicity_cases"}, {"score": 0.003177392642813126, "phrase": "consumers'_particular_negative_emotions"}, {"score": 0.002364865100579589, "phrase": "strongest_impact"}, {"score": 0.0023437863565921053, "phrase": "consumers'_negative_emotions"}, {"score": 0.002251227801482381, "phrase": "late_response"}, {"score": 0.0021049977753042253, "phrase": "second_response"}], "paper_keywords": ["social media", " crisis management", " consumers' emotional reaction", " negative publicity", " organizational response", " health care industry", " multiple case study"], "paper_abstract": "Negative publicity has an adverse effect on an organization, especially in online environments where consumers' word of mouth travels fast. By implementing an appropriate response strategy and being attentive about consumers' emotional reactions, an organization could minimize potential damage from crises. This explorative multiple case study decomposes each of the eight negative publicity cases into the dimensions of drug/supplement type (Lipitor and Oxyelite Pro), negative publicity source type (organizations and individuals), response execution status (response executed and no response), and defensive response type (attack the accuser and justification) in measuring consumers' particular negative emotions (anger, anxiety, and sadness). Based on the results of the study, the following propositions are derived: (1) higher degrees of anger and sadness are correlated with the negative publicity involving a supplement; (2) a higher degree of anxiety is correlated with the negative publicity caused by individuals; (3) a higher degree of anger is correlated with the response executed; (4) response execution is the dimension that exerts the strongest impact on consumers' negative emotions; (5) a higher degree of sadness is correlated with the late response; and (6) the degrees of anger and anxiety subside after the second response.", "paper_title": "Consumers' Emotional Reactions to Negative Publicity and Crisis Management in the Health Care Industry: A Multiple Case Study of Lipitor and Oxyelite Pro", "paper_id": "WOS:000342807900008"}