{"auto_keywords": [{"score": 0.04560873528240427, "phrase": "voc"}, {"score": 0.042781396607975336, "phrase": "organizational_innovation"}, {"score": 0.017176580080275644, "phrase": "customer_expectations"}, {"score": 0.006939778219361686, "phrase": "community_members"}, {"score": 0.006266992052774913, "phrase": "brand_community"}, {"score": 0.004709193603747991, "phrase": "customers'_voices"}, {"score": 0.00446471538346719, "phrase": "diverse_voices"}, {"score": 0.004289686492089571, "phrase": "customer's_engagement"}, {"score": 0.004158290806404304, "phrase": "brand_communities"}, {"score": 0.003959863717046575, "phrase": "negative_contents"}, {"score": 0.00378767277402891, "phrase": "online_context"}, {"score": 0.0036390887584943723, "phrase": "research_model"}, {"score": 0.0035118972210075633, "phrase": "opinion_leader_engagement"}, {"score": 0.003032405563826263, "phrase": "mystarbucksidea.com"}, {"score": 0.0026771333996253783, "phrase": "voc._opinion_leaders'_engagement"}, {"score": 0.0025492038831408715, "phrase": "negative_valence"}, {"score": 0.0023845255359681143, "phrase": "possible_threat"}, {"score": 0.002352886041381761, "phrase": "online_brand_community"}], "paper_keywords": ["Voice of the customer (VOC)", " Expectancy Disconfirmation Theory", " Online brand community", " Open innovation", " MyStarbucksIdea.com", " Zero-inflated negative binomial model"], "paper_abstract": "In Web 2.0 environment, the influence of customers' voices is increasing. Many companies have built their online brand communities for listening to the diverse voices of the customer (VOC) and promoting customer's engagement. The information obtained from these brand communities is exploited for organizational innovation. However, the VOC with negative contents could possibly present threats to a firm in an online context. In this study, we develop a research model that includes the types of customer expectations, opinion leader engagement, negative valence of VOC, interaction, and innovation. Subsequently, we empirically validate the effects of customer expectations on the interactions among community members and organizational innovation by using a dataset from MyStarbucksIdea.com. The results show that the effects of VOC on the interaction within a brand community and organizational innovation are different depending on the types of expectation in the VOC. Opinion leaders' engagement positively affects the interaction among community members. Moreover, the negative valence of VOC affects the relationships between customer expectations and interactions, and results in a possible threat within an online brand community. The research results give some insight into managing the brand community and analyzing the VOCs so as to achieve organizational innovation. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "Gift or threat? An examination of voice of the customer: The case of MyStarbucksIdea.com", "paper_id": "WOS:000336508600005"}