{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "verbal_shift_handover_report"}, {"score": 0.04458003012492911, "phrase": "shift_handovers"}, {"score": 0.004549524321051407, "phrase": "key_tool"}, {"score": 0.004229556887896042, "phrase": "adverse_events"}, {"score": 0.0041112665381266315, "phrase": "increased_frequency"}, {"score": 0.003947973513495612, "phrase": "technological_support"}, {"score": 0.0037150687722055727, "phrase": "current_practices"}, {"score": 0.0033163269450817716, "phrase": "multi-site_case_study"}, {"score": 0.002900806476592644, "phrase": "healthcare_professional's_ability"}, {"score": 0.0027184540871935284, "phrase": "teaching_and_team_cohesion"}, {"score": 0.0025892330566358503, "phrase": "previous_shift"}, {"score": 0.002246292543825748, "phrase": "flexible_solution"}, {"score": 0.0022190974300886467, "phrase": "handover_participants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Handovers", " Handoffs"], "paper_abstract": "Objective: Shift handover is seen as a key tool in ensuring continuity of care yet a number of studies have highlighted the role of shift handovers in adverse events. This, combined with the increased frequency of shift handovers, has led to interest in providing technological support for handover to enhance safety. The aim of this paper is to describe current practices for the conduct of shift handovers and to use this as a basis for considering the role that technology could play in supporting handover. Methods: A multi-site case study of handover was conducted. Data included observations of 15 medical shift handovers and 33 nursing shift handovers across three case sites. Findings: The findings highlight the way in which the verbal shift handover report is practically focused, displaying the healthcare professional's ability to know what information is required and where further explanation is needed. As well as supporting teaching and team cohesion, shift handover can provide an opportunity to reflect on the previous shift and for discussion with patients and their families. Conclusions: The benefits provided by a face to face handover suggest that technology should focus on supporting rather than replacing the verbal shift handover report, providing a flexible solution that allows handover participants to gather more information as it is required. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The importance of the verbal shift handover report: A multi-site case study", "paper_id": "WOS:000296493000007"}