{"auto_keywords": [{"score": 0.044267980341416414, "phrase": "digital_contents"}, {"score": 0.00481495049065317, "phrase": "ownership_transfer."}, {"score": 0.004585332915477379, "phrase": "information_technologies"}, {"score": 0.003907403442285109, "phrase": "ownership_claim"}, {"score": 0.003737485125097945, "phrase": "buyer-seller_watermarking_schemes"}, {"score": 0.0031006232333900055, "phrase": "digital_content_exchange"}, {"score": 0.002482013330276732, "phrase": "free-rider_situation"}, {"score": 0.00241658945942583, "phrase": "unfair_result"}, {"score": 0.0023845255359681143, "phrase": "content_exchange_process"}, {"score": 0.002152397315548125, "phrase": "watermarked_digital_content"}, {"score": 0.0021049977753042253, "phrase": "exchanging_process"}], "paper_keywords": ["Digital right", " Digital watermark", " Secure fair content exchange", " Mutual authentication", " P2P"], "paper_abstract": "In recent years, due to the maturity of network and information technologies, p2p (peer to peer) networks grow rapidly. Users (called peers) can upload or download files such as digital contents to or from other peers in a p2p network. Usually, the digital contents can contain the watermarks for ownership claim and protection. To date, a lot of buyer-seller watermarking schemes were proposed, but none of them is suitable for peers to exchange their digital contents in a p2p network. By the way, if peers attempt to exchange their digital contents by using these schemes directly, none of them can guarantee that the digital content exchange is efficient and secure between peers. In addition, how to exchange the digital contents fairly in a p2p network is another problem since a peer may not honestly forward her/his digital content to another peer. On the other hand, due to the feature of p2p networks, there may be a free-rider situation happening and it causes the unfair result in the content exchange process among peers. In this paper, we propose an efficient and fair p2p digital content exchange scheme for solving all the above problems. Our proposed scheme can exchange the watermarked digital content securely and keep the exchanging process fair to each other.", "paper_title": "P2P FAIR CONTENT EXCHANGE WITH OWNERSHIP TRANSFER", "paper_id": "WOS:000305161100001"}