{"auto_keywords": [{"score": 0.03531738520573261, "phrase": "iptv"}, {"score": 0.015072935879630829, "phrase": "news-on-demand_packages"}, {"score": 0.011053696526173065, "phrase": "content_personalization"}, {"score": 0.00481495049065317, "phrase": "services_distribution_channel"}, {"score": 0.004288261454002681, "phrase": "distribution_channel"}, {"score": 0.003804234575698981, "phrase": "purchase_process"}, {"score": 0.0034806529881619454, "phrase": "testbed_platform"}, {"score": 0.003246672441842787, "phrase": "factorial_design"}, {"score": 0.003111472132927442, "phrase": "multivariate_analysis"}, {"score": 0.003087500254099842, "phrase": "variance_analyses"}, {"score": 0.0030283730114326014, "phrase": "findings_-_data"}, {"score": 0.002891032998395276, "phrase": "users'_purchase_experience_configuration"}, {"score": 0.0028138046006772567, "phrase": "users'_control"}, {"score": 0.002675797331220082, "phrase": "iptv_platform"}, {"score": 0.0024385083712241988, "phrase": "advantageous_features"}, {"score": 0.002292097733181405, "phrase": "slow_pace"}, {"score": 0.0021461354559957234, "phrase": "new_distribution_channel"}, {"score": 0.0021049977753042253, "phrase": "underdeveloped_perspective"}], "paper_keywords": ["User satisfaction", " User interfaces", " Information media", " IP Television", " IPTV", " Interactivity", " Personalization", " Perceived control"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the adoption of FP Television (IPTV) as a distribution channel. The authors test the effects of its features, such as personalization and interactivity, on users' perceived control and satisfaction with their purchase experience. The authors also analyze the purchase process of news-on-demand packages, in which users can personalize the contents and amount of news and interact with other users. Design/methodology/approach - A testbed platform was designed which integrates the interactivity and content personalization of IPTV and a 2 x 2 between-subjects factorial design was developed, resulting in four experimental scenarios of the platform. Multivariate analysis of variance analyses have been applied. Findings - Data from 119 university students corroborate the importance of content personalization and interactivity in the users' purchase experience configuration, as these variables increase both users' control and satisfaction. The authors also confirm that the users preferred the IPTV platform which combines interactivity and personalization rather than the other designs that only had one of these features. Originality/value - In spite of the advantageous features of IPTV, its adoption has been slower than initially expected. The causes of this slow pace of adoption are still unclear. This paper contributes to the understanding of IPTV as a new distribution channel, which is an underdeveloped perspective in the field. Moreover, it demonstrates the importance of fostering the collaboration of users in designing services through interactivity and personalization.", "paper_title": "IPTV as a services distribution channel The importance of interactivity and personalization in the purchasing of news-on-demand packages", "paper_id": "WOS:000296823100010"}