{"auto_keywords": [{"score": 0.04971075098097409, "phrase": "semantic-web_ontologies"}, {"score": 0.009813579390431244, "phrase": "data_exchange_systems"}, {"score": 0.00481495049065317, "phrase": "benchmarking_data_exchange"}, {"score": 0.004722898398399427, "phrase": "increasing_popularity"}, {"score": 0.0039694170761766226, "phrase": "data_exchange"}, {"score": 0.003833749901796579, "phrase": "uneven_performance"}, {"score": 0.0036600192572132676, "phrase": "empirical_point"}, {"score": 0.0031599739264865554, "phrase": "data_exchange_problems"}, {"score": 0.0030637124954859657, "phrase": "mostobm"}, {"score": 0.0028356575042385156, "phrase": "seven_synthetic_data"}, {"score": 0.0025249264547573943, "phrase": "exchanging_ontologies"}, {"score": 0.002419708657850547, "phrase": "evaluation_methodology"}, {"score": 0.0023099082804523044, "phrase": "informed_and_statistically_sound_decisions"}], "paper_keywords": ["Performance and scalability", " data exchange", " Web of data"], "paper_abstract": "The increasing popularity of the Web of Data is motivating the need to integrate semantic-web ontologies. Data exchange is one integration approach that aims to populate a target ontology using data that come from one or more source ontologies. Currently, there exist a variety of systems that are suitable to perform data exchange among these ontologies; unfortunately, they have uneven performance, which makes it appealing assessing and ranking them from an empirical point of view. In the bibliography, there exist a number of benchmarks, but they cannot be applied to this context because they are not suitable for testing semantic-web ontologies or they do not focus on data exchange problems. In this paper, we present MostoBM, a benchmark for testing data exchange systems in the context of such ontologies. It provides a catalogue of three real-world and seven synthetic data exchange patterns, which can be instantiated into a variety of scenarios using some parameters. These scenarios help to analyze how the performance of data exchange systems evolves as the exchanging ontologies are scaled in structured and/or data. Finally, we provide an evaluation methodology to compare data exchange systems side by side and to make informed and statistically sound decisions regarding: 1) which data exchange system performs better; and 2) how the performance of a system is influenced by the parameters of our benchmark.", "paper_title": "Benchmarking Data Exchange among Semantic-Web Ontologies", "paper_id": "WOS:000322136900005"}