{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_stream_surface_seeding"}, {"score": 0.04397488238643157, "phrase": "stream_surfaces"}, {"score": 0.003916098498242888, "phrase": "integral_surfaces"}, {"score": 0.003802135020791801, "phrase": "previous_research"}, {"score": 0.0037133478610481994, "phrase": "manual_placement"}, {"score": 0.003338690782620756, "phrase": "novel_automatic_stream_surface_seeding_strategy"}, {"score": 0.0030195184114140063, "phrase": "particular_characteristics"}, {"score": 0.0027469703311742647, "phrase": "different_vector_clustering_parameters"}, {"score": 0.0023976048394496446, "phrase": "automatic_stream_surface_approach"}, {"score": 0.0023277282036119106, "phrase": "flow_simulations"}, {"score": 0.002286781334850213, "phrase": "illustrative_visualization_techniques"}, {"score": 0.002259883463607508, "phrase": "domain_expert_evaluation"}, {"score": 0.0021940118003312397, "phrase": "valuable_insight"}, {"score": 0.002155412043665635, "phrase": "users_requirements"}], "paper_keywords": ["I.3.3 [Computer Graphics]: Algorithm Technique", " Automatic Stream Surface Seeding Data Clustering Hierarchy Data Vector Field Data Geometry-based Techniques feature-centered plus overview Techniques Illustrative Visualization Flow Visualization"], "paper_abstract": "The ability to capture and visualize information within the flow poses challenges for visualizing 3D flow fields. Stream surfaces are one of many useful integration based techniques for visualizing 3D flow. However seeding integral surfaces can be challenging. Previous research generally focuses on manual placement of stream surfaces. Little attention has been given to the problem of automatic stream surface seeding. This paper introduces a novel automatic stream surface seeding strategy based on vector field clustering. It is important that the user can define and target particular characteristics of the flow. Our framework provides this ability. The user is able to specify different vector clustering parameters enabling a range of abstraction for the density and placement of seeding curves and their associated stream surfaces. We demonstrate the effectiveness of this automatic stream surface approach on a range of flow simulations and incorporate illustrative visualization techniques. Domain expert evaluation of the results provides valuable insight into the users requirements and effectiveness of our approach.", "paper_title": "Automatic Stream Surface Seeding: A Feature Centered Approach", "paper_id": "WOS:000305603500012"}