{"auto_keywords": [{"score": 0.044454016803517404, "phrase": "systems_theory"}, {"score": 0.00481495049065317, "phrase": "previous_articles"}, {"score": 0.004651346011959237, "phrase": "general_behavior"}, {"score": 0.0041211075804202905, "phrase": "variables'_orbits"}, {"score": 0.003858936100805083, "phrase": "structural_functions"}, {"score": 0.0037148167062767096, "phrase": "invariant_sets"}, {"score": 0.0032457271401035545, "phrase": "particular_characteristics"}, {"score": 0.002692132776447632, "phrase": "real_example"}, {"score": 0.0026643006135750025, "phrase": "ecological_network"}, {"score": 0.0023764543399388658, "phrase": "set_al"}, {"score": 0.0021716947902494185, "phrase": "esteve"}, {"score": 0.0021049977753042253, "phrase": "complete_understanding"}], "paper_keywords": [""], "paper_abstract": "Unlike studies that we have performed in previous articles, with the objective of clarifying which variables determine the general behavior of system-linkage from the viewpoint of the origin or beginning of orbits, this article will study the attractor, a very interesting object in systems theory. This set is found precisely at the end of the variables' orbits, which is where we will focus all our interest. For this purpose, we will utilize the structural functions associated with them, as well as concepts such as invariant sets and coverage, given that they have been the subject of study in our previous publications. We will give a series of definitions of objects that are already known in the field of systems theory, adapting them to the particular characteristics of system-linkages and associated structural functions. The composition of an attractor has been demonstrated, determining what type of objects form attractors. Furthermore, we have looked at the nature of the basins of attraction associated with each attractor, and how they are formed. Finally, we have presented a real example of an ecological network in which attractors exist: the water cycle. This article, in short, has proven the point of interest existing at the end (assuming that this is part of set Al) of the orbits of variables making up the system-linkage; this, together with the study we have conducted on bases and coverage (Esteve and Lloret 2006c), provides us with a complete understanding of the behavior of this type of system as far as what we could call its \"beginning\" and its \"end\" (assuming, as above, that this is part of set M).", "paper_title": "Attractors, structural functions, and the water cycle", "paper_id": "WOS:000246579700004"}