{"auto_keywords": [{"score": 0.04754575606855935, "phrase": "decision_maker"}, {"score": 0.043322976460317734, "phrase": "chosen_path"}, {"score": 0.00481495049065317, "phrase": "partial_monitoring"}, {"score": 0.00475924837336259, "phrase": "on-line_shortest_path_problem"}, {"score": 0.0046859752697029355, "phrase": "partial_monitoring_scenarios"}, {"score": 0.004386887374401584, "phrase": "weighted_directed_acyclic_graph"}, {"score": 0.003874512990986722, "phrase": "multi-armed_bandit_setting"}, {"score": 0.0033690254452595865, "phrase": "best_path"}, {"score": 0.00326594229173048, "phrase": "entire_sequence"}, {"score": 0.003228101865545105, "phrase": "edge_weights"}, {"score": 0.0028729252198422825, "phrase": "linear_complexity"}, {"score": 0.0026892447164623247, "phrase": "earlier_bandit-algorithms"}, {"score": 0.002658068304632523, "phrase": "performance_bounds"}, {"score": 0.0024977819584875573, "phrase": "slower_rate"}, {"score": 0.0024025371556472557, "phrase": "so-called_label"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": [""], "paper_abstract": "The on-line shortest path problem is considered under partial monitoring scenarios. At each round, a decision maker has to choose a path between two distinguished vertices of a weighted directed acyclic graph whose edge weights can change in an arbitrary (adversarial) way such that the loss of the chosen path (defined as the sum of the weights of its composing edges) be small. In the multi-armed bandit setting, after choosing a path, the decision maker learns only the weights of those edges that belong to the chosen path. For this scenario, an algorithm is given whose average cumulative loss in n rounds exceeds that of the best path, matched off-line to the entire sequence of the edge weights, by a quantity that is proportional to 1/root n and depends only polynomially on the number of edges of the graph. The algorithm can be implemented with linear complexity in the number of rounds n and in the number of edges. This result improves earlier bandit-algorithms which have performance bounds that either depend exponentially on the number of edges or converge to zero at a slower rate than O(1/root n). An extension to the so-called label efficient setting is also given, where the decision maker is informed about the weight of the chosen path only with probability epsilon < 1. Applications to routing in packet switched networks along with simulation results are also presented.", "paper_title": "The shortest path problem under partial monitoring", "paper_id": "WOS:000239587900035"}