{"auto_keywords": [{"score": 0.039314746007254174, "phrase": "secret_key"}, {"score": 0.008597214370212162, "phrase": "egg"}, {"score": 0.007127603947978497, "phrase": "grey_model"}, {"score": 0.006264471482538624, "phrase": "ecc"}, {"score": 0.005191538719897902, "phrase": "key_length"}, {"score": 0.00481495049065317, "phrase": "encrypted_documents"}, {"score": 0.004747997855358171, "phrase": "entire_system"}, {"score": 0.004580058268311223, "phrase": "said_problem"}, {"score": 0.004453537795938791, "phrase": "good_cryptosystem"}, {"score": 0.004177262833590537, "phrase": "easy-handling_cryptosystem"}, {"score": 0.004029428762076566, "phrase": "lost_keys"}, {"score": 0.003910222488914763, "phrase": "elliptic_curve_cryptosystem"}, {"score": 0.0038712729010830864, "phrase": "mathematical_grey_model"}, {"score": 0.003786938871408326, "phrase": "grey_model's_mathematical_formula"}, {"score": 0.0037193015068067137, "phrase": "system's_secret_key"}, {"score": 0.0036675278952568832, "phrase": "disabled_system"}, {"score": 0.003630986967415622, "phrase": "public_key_cryptosystems"}, {"score": 0.0035518806310842967, "phrase": "rsa"}, {"score": 0.003398749272199389, "phrase": "elliptic_curve_discrete_logarithm_problem"}, {"score": 0.0032522091171602557, "phrase": "rsa-based_systems"}, {"score": 0.003137010290912022, "phrase": "rsa."}, {"score": 0.0031244635775092493, "phrase": "basic_attack"}, {"score": 0.002977755202857023, "phrase": "corresponding_public_key"}, {"score": 0.002912829157015899, "phrase": "ecdlp"}, {"score": 0.002883785805985795, "phrase": "extremely_difficult_task"}, {"score": 0.0027046257652815074, "phrase": "confidentiality-related_security_problem"}, {"score": 0.0026562677230857084, "phrase": "mathematical_array_hierarchy"}, {"score": 0.0026140072380727176, "phrase": "hierarchy's_original_key"}, {"score": 0.002521356982533238, "phrase": "original_secret_key"}, {"score": 0.0024762676047701275, "phrase": "mathematical_formula"}, {"score": 0.0024125548140693626, "phrase": "confidentiality_security_problem"}, {"score": 0.002393281860183304, "phrase": "different_settings"}, {"score": 0.0023084368358240823, "phrase": "bottom_level"}, {"score": 0.002253547396115728, "phrase": "original_array"}, {"score": 0.0021049977753042253, "phrase": "method's_confidentiality"}], "paper_keywords": ["Public key cryptosystem", " Elliptic curve cryptosystem", " Data generation", " Grey model", " ECDLP"], "paper_abstract": "In a cryptosystem, when the key is lost, the system will not be able to decrypt information or open encrypted documents; as a result, the entire system, ceases to function normally. Therefore, this paper aims to propose a solution to the said problem so that the system can revert back to its normal state. Generally, a good cryptosystem fulfills two basic requirements; they are security and confidentiality. If it is easy to use, it. will then become popular. Thus, we would like to propose an easy-handling cryptosystem in this paper, which corresponds to these two requirements in addition to being able to easily retrieve lost keys and restore the system to its normal state. Mainly, we combine the concepts of Elliptic Curve Cryptosystem (ECC) and mathematical Grey Model into an algorithm to illustrate how we can use the Grey Model's mathematical formula to reconstruct and recover the secret key when the system's secret key is lost, so that the disabled system can resume its normal operations. Public key cryptosystems are quite familiar to most; the more popular ones are either RSA-based or ECC-based. Here, we suggest EGG because its security is based on the difficulty of solving Elliptic Curve Discrete Logarithm Problem, (ECDLP). It has been proven that EGG provides much greater efficiency with order of magnitude roughly 10 times than RSA-based systems according to the key length of 313 bits in EGG giving the same security level as a key length of 4096 bits in RSA. The basic attack on the Internet involves finding or cracking the secret key. But in EGG, an attacker has to derive the secret key from the corresponding public key and therefore he or she inevitably has to face the ECDLP, which is an extremely difficult task. Hence, it is extremely difficult for an attacker to obtain the secret key in our proposed method. OM the other hand, the Grey Model can give us a hand on guarding against confidentiality-related security problem. Basically, we make use of a mathematical array hierarchy to calculate and further to reconstruct the hierarchy's original key, regarded as a secret key here. When the secret key is lost, we can retrieve the original secret key by using its original mathematical array through the derivation of a mathematical formula of the Grey Model. Having the Grey Model, we can avoid the confidentiality security problem due to the different settings for the levels and rounding off of decimals. Therefore, even if the array in the bottom level gets hacked, it is still very difficult to derive the original array from the bottom. In fact, it is very difficult to crack anything mathematically, and the characteristics of the confidentiality can be improved. At the same time, this increases the method's confidentiality, making the system more secure.", "paper_title": "A NOVEL GREY DATA GENERATING TECHNIQUE ON ELLIPTIC CURVE CRYPTOSYSTEMS", "paper_id": "WOS:000287124500030"}