{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_measurement_protocol"}, {"score": 0.004296264970612285, "phrase": "virtualization_technology"}, {"score": 0.0041517954514423625, "phrase": "physical_resources"}, {"score": 0.0037042817107563785, "phrase": "cloud_computing"}, {"score": 0.0036622637391432143, "phrase": "wide-spread_popularity"}, {"score": 0.003419955174477652, "phrase": "iaas"}, {"score": 0.00308610073274614, "phrase": "real-time_security_status"}, {"score": 0.002898291237210567, "phrase": "dynamic_credibility"}, {"score": 0.0028167336373711494, "phrase": "cloud_service_security_provider"}, {"score": 0.0021908807203548345, "phrase": "different_iaas_platforms"}, {"score": 0.0021049977753042253, "phrase": "performance_analysis"}], "paper_keywords": ["Burrow-Abadi-Needham (BAN) logic", " real-time security", " trusted dynamic measurement"], "paper_abstract": "Infrastructure as a Service (IaaS) has brought advantages to users because virtualization technology hides the details of the physical resources, but this leads to the problem of users being unable to perceive their security. This defect has obstructed cloud computing from wide-spread popularity and development. To solve this problem, a dynamic measurement protocol in IaaS is presented in this paper. The protocol makes it possible for the user to get the real-time security status of the resources, thereby solving the problem of guaranteeing dynamic credibility. This changes the cloud service security provider from the operator to the users themselves. This study has verified the security of the protocol by means of Burrow-Abadi-Needham (BAN) logic, and the result shows that it can satisfy requirements for innovation, privacy, and integrity. Finally, based on different IaaS platforms, this study has conducted a performance analysis to demonstrate that this protocol is reliable, secure, and efficient.", "paper_title": "Dynamic Measurement Protocol in Infrastructure as a Service", "paper_id": "WOS:000364489200006"}