{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "credential-based_access_control_framework"}, {"score": 0.04320512154983126, "phrase": "access_control_procedure"}, {"score": 0.033849332343709, "phrase": "known_subjects"}, {"score": 0.004672808182229058, "phrase": "distributed_internet_resources"}, {"score": 0.004515467468684217, "phrase": "web_services"}, {"score": 0.004234532601573088, "phrase": "proposed_approaches"}, {"score": 0.0038868464660354626, "phrase": "execution_time"}, {"score": 0.003837205620832367, "phrase": "access_control_procedures"}, {"score": 0.003788196352457501, "phrase": "challenging_task"}, {"score": 0.0037238193456845124, "phrase": "increased_number"}, {"score": 0.0029797347088361056, "phrase": "update_functions"}, {"score": 0.0028916124463906983, "phrase": "idle_times"}, {"score": 0.0027583557819362034, "phrase": "core_task"}, {"score": 0.0027230880516264685, "phrase": "proposed_update"}, {"score": 0.0024884913795612707, "phrase": "security_policies"}, {"score": 0.0023434058350520763, "phrase": "credential-based_access_control"}, {"score": 0.0021049977753042253, "phrase": "access_request_evaluation_time"}], "paper_keywords": ["access control", " clustering users", " credentials", " XML-based access control", " access request evaluation time"], "paper_abstract": "Currently, access control of distributed Internet resources (such as files, documents and web services) has become extremely demanding. Several new access control models have been introduced. Most of the proposed approaches increase the complexity of the access control procedure and at the same time expressing these models is becoming complicated. Improving the execution time of the access control procedures is a challenging task due to the increased number of resources (available over the Internet) and the size of the audience involved. In this paper, we introduce an approach for speeding up the access control procedure under an environment accessed by known subjects (i.e. subjects whose identity and attributes are known apriori through a subscription phase). This approach is based on some update functions (employed at the background during idle times) over files which are associated with subjects. The core task of the proposed update is its dynamic nature and its clustering of subjects according to their interests and credentials. Moreover, this work associates subjects with security policies that are most likely to be triggered according to (the subjects) interests. Credential-based access control is considered to properly protect frameworks distributing resources to known subjects and here emphasis is given to the complexity involved in order to decrease the access request evaluation time under a credential-based access control framework. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Clustering subjects in a credential-based access control framework", "paper_id": "WOS:000246088700020"}