{"auto_keywords": [{"score": 0.046632243624775235, "phrase": "supply_chain"}, {"score": 0.00481495049065317, "phrase": "highly_visible_supply_chains"}, {"score": 0.004757849078050144, "phrase": "technological_developments"}, {"score": 0.0047014216428514465, "phrase": "radio_frequency_identification"}, {"score": 0.004673467341137269, "phrase": "rfid"}, {"score": 0.004615668156517921, "phrase": "ontological_primitives"}, {"score": 0.004563250218021092, "phrase": "individual_things"}, {"score": 0.004536104856119294, "phrase": "information_sharing"}, {"score": 0.0043505358211043425, "phrase": "highly_visible_supply_chain"}, {"score": 0.004324650333875634, "phrase": "hvsc"}, {"score": 0.004197505250073651, "phrase": "arbitrary_individual_things"}, {"score": 0.004061941280202248, "phrase": "appropriate_supply_chain_partners"}, {"score": 0.003849452105837052, "phrase": "\"supply_chain"}, {"score": 0.0037811124250339335, "phrase": "critical_component"}, {"score": 0.003256657868307919, "phrase": "economic_phenomena"}, {"score": 0.0032276039113189286, "phrase": "multiple_views"}, {"score": 0.0031797536775378327, "phrase": "data_architectures"}, {"score": 0.0029863849319835354, "phrase": "supply_chain_systems"}, {"score": 0.0029421002892899015, "phrase": "increased_visibility"}, {"score": 0.0028640315078411784, "phrase": "collaborative_decision"}, {"score": 0.0028384703537911, "phrase": "supply_chain_activities"}, {"score": 0.0028131366865158302, "phrase": "eaglet_ontology"}, {"score": 0.0025261612008752534, "phrase": "containment_structures"}, {"score": 0.0024153856447655143, "phrase": "independent_view"}, {"score": 0.0023724444453105983, "phrase": "trading-partner_view"}, {"score": 0.0021753930127723386, "phrase": "economic_scripts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["EAGLET ontology", " Individual object identification", " Internet of Things", " Supply Chain of Things", " Traceability"], "paper_abstract": "Recently, technological developments, such as radio frequency identification (RFID), have facilitated the identification of individual things and information sharing regarding their behavior throughout the supply chain. Such developments have generated the capabilities of a highly visible supply chain (HVSC): a supply chain where the location of arbitrary individual things can be determined at any point in time by all appropriate supply chain partners, made possible by an \"Internet of Things\" for the supply chain, referred to as a \"Supply Chain of Things.\" A critical component of a Supply Chain of Things is an ontology to facilitate the visibility and interoperability of things along the supply chain. As a result, the objective of this paper is to define an ontology that leverages the availability of an individual thing's (object) identification information within the context of a standard set of economic phenomena that support multiple views in a range of data architectures. Our design science approach begins with a set of ontological primitives and gradually defines structuring principles that provide guidance for the design of supply chain systems that are characterized by increased visibility and interoperability and which facilitate management of and collaborative decision making about supply chain activities. The EAGLET ontology is named after its five primitives: Event, AGent, Location, Equipment and Thing. The following are some of its unique characteristics: location and equipment are recognized as ontological primitives, and creating and destroying of containment structures is explicitly modeled; the economic phenomena underlying the supply chain are defined from an independent view, as opposed to a trading-partner view; the supply chain is defined from three different perspectives: the physical flow, the chain of custody, and the chain of ownership; event sequences that resemble the economic scripts underlying the supply chain are defined. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A supply chain of things: The EAGLET ontology for highly visible supply chains", "paper_id": "WOS:000338822000002"}