{"auto_keywords": [{"score": 0.028104815143682498, "phrase": "polynomial_optimization"}, {"score": 0.027507999683207576, "phrase": "semidefinite_program"}, {"score": 0.004448705308279165, "phrase": "-monotone_function"}, {"score": 0.004257360656055417, "phrase": "approximation_theory"}, {"score": 0.0038309141193444015, "phrase": "proper_subset"}, {"score": 0.0035705347414368726, "phrase": "ramsey-type_result"}, {"score": 0.0034018288705284427, "phrase": "distinct_-coordinates"}, {"score": 0.0031845067058084583, "phrase": "-monotone_interpolability"}, {"score": 0.0031289290660162145, "phrase": "classical_theorems"}, {"score": 0.003101504376052905, "phrase": "erdas"}, {"score": 0.0030743499646274557, "phrase": "szekeres"}, {"score": 0.002903311792572216, "phrase": "computational_complexity"}, {"score": 0.0027782510491938315, "phrase": "known_characterization"}, {"score": 0.0027417911324611917, "phrase": "decision_problem"}, {"score": 0.0023501014144112443, "phrase": "polynomial_time"}, {"score": 0.002258745901862197, "phrase": "semidefinite_programming"}, {"score": 0.0021709339252206825, "phrase": "first_such_example"}], "paper_keywords": ["k-Monotone interpolation", " 3-Monotonicity", " Semidefinite programming"], "paper_abstract": "A function is called -monotone if it is -times differentiable and its nd derivative is convex. A point set is -monotone interpolable if it lies on a graph of a -monotone function. These notions have been studied in analysis, approximation theory, etc. since the 1940s. We show that 3-monotone interpolability is very nonlocal: we exhibit an arbitrarily large finite for which every proper subset is 3-monotone interpolable but itself is not. On the other hand, we prove a Ramsey-type result: for every there exists such that every -point with distinct -coordinates contains an -point such that or its vertical mirror reflection are 3-monotone interpolable. The analogs for -monotone interpolability with and are classical theorems of ErdAs and Szekeres, while the cases with remain open. We also investigate the computational complexity of deciding 3-monotone interpolability of a given point set. Using a known characterization, this decision problem can be stated as an instance of polynomial optimization and reformulated as a semidefinite program. We exhibit an example for which this semidefinite program has only doubly exponentially large feasible solutions, and thus known algorithms cannot solve it in polynomial time. While such phenomena have been well known for semidefinite programming in general, ours seems to be the first such example in polynomial optimization, and it involves only univariate quadratic polynomials.", "paper_title": "Three-Monotone Interpolation", "paper_id": "WOS:000355340300002"}