{"auto_keywords": [{"score": 0.0416993321607236, "phrase": "aitf"}, {"score": 0.0060454241761827105, "phrase": "bandwidth_flooding"}, {"score": 0.005872468455350256, "phrase": "per-client_cost"}, {"score": 0.00481495049065317, "phrase": "internet_bandwidth-flooding"}, {"score": 0.004716031208088975, "phrase": "bandwidth-flooding_attack"}, {"score": 0.004619134710069517, "phrase": "high-volume_traffic"}, {"score": 0.0042157995925335544, "phrase": "active_internet_traffic_filtering"}, {"score": 0.003895810929926511, "phrase": "contact_misbehaving_sources"}, {"score": 0.0031125001790084936, "phrase": "complaining_receiver"}, {"score": 0.003048449231088915, "phrase": "strong_incentive"}, {"score": 0.00292426293067148, "phrase": "popular_public-access_site"}, {"score": 0.002828556054338357, "phrase": "significant_fraction"}, {"score": 0.0027934768366077397, "phrase": "receiver's_bandwidth"}, {"score": 0.002591927716261631, "phrase": "today's_isps"}, {"score": 0.0024554476124885806, "phrase": "botnet-size_growth"}, {"score": 0.0024149139610228887, "phrase": "moore's_law"}, {"score": 0.00235536166148219, "phrase": "even_the_first_two_networks"}], "paper_keywords": ["Denial-of-service defenses", " network-level security and protection", " traffic filtering"], "paper_abstract": "In a bandwidth-flooding attack, compromised sources send high-volume traffic to the target with the purpose of causing congestion in its tail circuit and disrupting its legitimate communications. In this paper, we present Active Internet Traffic Filtering (AITF), a network-layer defense mechanism against such attacks. AITF enables a receiver to contact misbehaving sources and ask them to stop sending it traffic; each source that has been asked to stop is policed by its own Internet service provider (ISP), which ensures its compliance. An ISP that hosts misbehaving sources either supports AITF ( and accepts to police its misbehaving clients), or risks losing all access to the complaining receiver-this is a strong incentive to cooperate, especially when the receiver is a popular public-access site. We show that AITF preserves a significant fraction of a receiver's bandwidth in the face of bandwidth flooding, and does so at a per-client cost that is already affordable for today's ISPs; this per-client cost is not expected to increase, as long as botnet-size growth does not outpace Moore's law. We also show that even the first two networks that deploy AITF can maintain their connectivity to each other in the face of bandwidth flooding. We conclude that the network-layer of the Internet can provide an effective, scalable, and incrementally deployable solution against bandwidth-flooding attacks.", "paper_title": "Scalable Network-Layer Defense Against Internet Bandwidth-Flooding Attacks", "paper_id": "WOS:000269155300021"}