{"auto_keywords": [{"score": 0.04981936527401867, "phrase": "texture_descriptors"}, {"score": 0.014618750163297304, "phrase": "matrix_descriptor"}, {"score": 0.008713768692145006, "phrase": "amino_acids"}, {"score": 0.004660453113061494, "phrase": "new_feature_extractor"}, {"score": 0.004225950334493496, "phrase": "representation_purposes"}, {"score": 0.004090274535243564, "phrase": "squared_matrix"}, {"score": 0.003958937342925219, "phrase": "partial_ordering"}, {"score": 0.0037493114715625784, "phrase": "texture_image"}, {"score": 0.0036586235677650417, "phrase": "compact_representation"}, {"score": 0.003531474887552889, "phrase": "peptide_protein"}, {"score": 0.003427333246136987, "phrase": "local_binary_patterns"}, {"score": 0.0033444179888963343, "phrase": "dct"}, {"score": 0.003317216759787374, "phrase": "daubechies"}, {"score": 0.0032457641039857128, "phrase": "experimental_section"}, {"score": 0.0030487828775502563, "phrase": "human_leukocyte_antigens"}, {"score": 0.003032228032253871, "phrase": "human_immunodeficiency_virus"}, {"score": 0.00295078850927459, "phrase": "experimental_results"}, {"score": 0.0029029754274913803, "phrase": "novel_descriptors"}, {"score": 0.002771659191307672, "phrase": "proposed_method"}, {"score": 0.0027491084541806823, "phrase": "feasible_system"}, {"score": 0.0026033756286033285, "phrase": "matrix-based_representation"}, {"score": 0.0025611773887867255, "phrase": "support_vector_machine_classifier"}, {"score": 0.0024187847926696493, "phrase": "new_descriptors"}, {"score": 0.0024056425729434634, "phrase": "different_information"}, {"score": 0.002347378595930709, "phrase": "vector-based_descriptors"}, {"score": 0.0023030372772385346, "phrase": "overall_performance"}, {"score": 0.00225338387015834, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Protein classification", " Peptide classification", " Vaccine development", " Locally binary patterns", " Discrete cosine transform", " Support vector machine"], "paper_abstract": "Objective: In this paper we propose a new feature extractor for peptide/protein classification based on the calculation of texture descriptors. Representing a peptide/protein using a matrix descriptor, instead of a vector, allows to deal with the peptide/protein as an image and to use texture descriptors for representation purposes. Methods and materials: A matrix descriptor, which is a squared matrix of the dimension of the peptide/protein, is obtained considering a partial ordering of the amino acids of the peptide/protein according to their value of a given physicochemical property. Each matrix descriptor is considered as a texture image and several texture descriptors are considered to obtain a compact representation which is scale invariant (i.e. independent on the length of the peptide protein). The texture descriptors tested in this work are: local binary patterns (LMP), discrete cosine transform (DCT) and Daubechies wavelets. Results and conclusion: The experimental section reports several tests, aimed at supporting our ideas, performed on the following datasets: vaccine dataset for the predictions of peptides that bind human leukocyte antigens; human immunodeficiency virus (HIV-1) protease cleavage site prediction dataset and membrane proteins type dataset. The experimental results confirm the usefulness of the novel descriptors: the performance obtained by our system on the three difficult datasets is quite high, indicating that the proposed method is a feasible system for extracting information from peptides and proteins. The performance obtained by each of the three texture descriptors calculated from the matrix-based representation, and coupled to a support vector machine classifier, is lower than the performance obtained by other vector-based descriptors based on physicochemical properties proposed in the literature. Anyway the new descriptors bring different information and our tests show that the texture descriptors and the vector-based descriptors can be combined to improve the overall performance of the system. In particular the proposed approach improves the state-of-the-art results in two out of three tested problems (HIV-1 protease cleavage site prediction dataset and membrane proteins type dataset). (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Coding of amino acids by texture descriptors", "paper_id": "WOS:000274527700004"}