{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "shape_families"}, {"score": 0.004303830426772906, "phrase": "shape_parts"}, {"score": 0.003966388754366831, "phrase": "geometric_distributions"}, {"score": 0.003906116922372891, "phrase": "relative_arrangements"}, {"score": 0.0037498152007206815, "phrase": "predefined_priors"}, {"score": 0.0036553070575015344, "phrase": "shape_family"}, {"score": 0.003509006038574667, "phrase": "input_shapes"}, {"score": 0.003334309053314909, "phrase": "co-segmented_shapes"}, {"score": 0.0027600360731762997, "phrase": "shape_repositories"}, {"score": 0.002718045523483502, "phrase": "interesting_shape_configurations"}, {"score": 0.0021595094738887767, "phrase": "proposed_representation"}, {"score": 0.0021049977753042253, "phrase": "shape_collections"}], "paper_keywords": ["shape collections", " consensus relations", " model editing"], "paper_abstract": "We introduce a meta-representation that represents the essence of a family of shapes. The meta-representation learns the configurations of shape parts that are common across the family, and encapsulates this knowledge with a system of geometric distributions that encode relative arrangements of parts. Thus, instead of predefined priors, what characterizes a shape family is directly learned from the set of input shapes. The meta-representation is constructed from a set of co-segmented shapes with known correspondence. It can then be used in several applications where we seek to preserve the identity of the shapes as members of the family. We demonstrate applications of the meta-representation in exploration of shape repositories, where interesting shape configurations can be examined in the set; guided editing, where models can be edited while maintaining their familial traits; and coupled editing, where several shapes can be collectively deformed by directly manipulating the distributions in the meta-representation. We evaluate the efficacy of the proposed representation on a variety of shape collections.", "paper_title": "Meta-representation of Shape Families", "paper_id": "WOS:000340000100001"}