{"auto_keywords": [{"score": 0.04157123421785755, "phrase": "turquois"}, {"score": 0.00481495049065317, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004688321299229397, "phrase": "significant_challenges"}, {"score": 0.004582423717777699, "phrase": "tight_coordination"}, {"score": 0.0044111930537670705, "phrase": "momentary_breakdown"}, {"score": 0.004311527998148399, "phrase": "accidental_or_malicious_nature"}, {"score": 0.004150377643719188, "phrase": "entire_system"}, {"score": 0.004041162401368166, "phrase": "byzantine"}, {"score": 0.0038900709793274484, "phrase": "resource-constrained_wireless_ad_hoc_networks"}, {"score": 0.0037020429480068653, "phrase": "dynamic_message_omissions"}, {"score": 0.0036321600255449613, "phrase": "efficient_utilization"}, {"score": 0.0035908627899097407, "phrase": "wireless_broadcasting_medium"}, {"score": 0.0033019779616246356, "phrase": "arbitrary_failure"}, {"score": 0.0032027739752274, "phrase": "n_nodes"}, {"score": 0.0031663432942179853, "phrase": "unrestricted_message_omissions"}, {"score": 0.0024242894323883895, "phrase": "flp"}, {"score": 0.0023966900120342364, "phrase": "santoro-widmayer_impossibility_results"}, {"score": 0.0022375675189464715, "phrase": "comparative_performance_evaluation"}], "paper_keywords": ["Wireless ad hoc networks", " Byzantine fault tolerance", " consensus", " distributed algorithms"], "paper_abstract": "Wireless ad hoc networks, due to their inherent unreliability, pose significant challenges to the task of achieving tight coordination among nodes. The failure of some nodes and momentary breakdown of communications, either of accidental or malicious nature, should not result in the failure of the entire system. This paper presents an asynchronous Byzantine consensus protocol-called Turquois-specifically designed for resource-constrained wireless ad hoc networks. The key to its efficiency is the fact that it tolerates dynamic message omissions, which allows an efficient utilization of the wireless broadcasting medium. The protocol also refrains from computationally expensive public-key cryptographic during its normal operation. The protocol is safe despite the arbitrary failure of f < n/3 nodes from a total of n nodes, and unrestricted message omissions. Progress is ensured in rounds where the number of omissions is sigma <= inverted right perpendicularn-t/2inverted left perpendicular (n k t) vertical bar k 2, where k is the number of nodes required to terminate and t <= f is the number of nodes that are actually faulty. These characteristics make Turquois the first consensus protocol that simultaneously circumvents the FLP and the Santoro-Widmayer impossibility results, which is achieved through randomization. Finally, the protocol was prototyped and subject to a comparative performance evaluation against two well-known Byzantine fault-tolerant consensus protocols. The results show that, due to its design, Turquois outperforms the other protocols by more than an order of magnitude as the number of nodes in the system increases.", "paper_title": "Byzantine Fault-Tolerant Consensus in Wireless Ad Hoc Networks", "paper_id": "WOS:000329196200011"}