{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_spatial_attention"}, {"score": 0.02483864687737578, "phrase": "audiovisual_integration"}, {"score": 0.008110163177782589, "phrase": "mcgurk_effect"}, {"score": 0.004901697743907618, "phrase": "auditory_perception"}, {"score": 0.0047689174754929195, "phrase": "audiovisual_speech_perception"}, {"score": 0.004723322467153553, "phrase": "auditory_and_visual_information"}, {"score": 0.004270003565426343, "phrase": "auditory_speech_perception"}, {"score": 0.004188702178897384, "phrase": "speech_perception"}, {"score": 0.0039729853486821995, "phrase": "recent_reports"}, {"score": 0.0034392837410790293, "phrase": "central_fixation_point"}, {"score": 0.0033575566897536906, "phrase": "single_auditory_speech_track"}, {"score": 0.0030938932434437178, "phrase": "voice_oil"}, {"score": 0.0030642636185693054, "phrase": "auditory_speech_percept"}, {"score": 0.002837188425640173, "phrase": "oil_auditory_perception"}, {"score": 0.0023066880707738736, "phrase": "visual_speech_perception"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Speech perception", " Multisensory", " Attention", " McGurk effect"], "paper_abstract": "Auditory and visual information is integrated when perceiving speech, as evidenced by the McGurk effect in which viewing an incongruent talking face categorically alters auditory speech perception. Audiovisual integration in speech perception has long been considered automatic and pre-attentive but recent reports have challenged this view. Here we study the effect of visual spatial attention on the McGurk effect. By presenting a movie of two faces symmetrically displaced to each side of a central fixation point and dubbed with a single auditory speech track, we were able to discern the influences front each of the faces and from the voice oil the auditory speech percept. We found that directing visual spatial attention towards a face increased the influence of that face oil auditory perception. However, the influence of the voice on auditory perception did not change suggesting that audiovisual integration did not change. Visual spatial attention was also able to select between the faces when lip reading. This suggests that visual spatial attention acts at the level of visual speech perception prior to audiovisual integration and that the effect propagates through audiovisual integration to influence auditory perception. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "The role of visual spatial attention in audiovisual speech perception", "paper_id": "WOS:000262203800007"}