{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compressive_strength"}, {"score": 0.008623469415472663, "phrase": "ash-based_geopolymers"}, {"score": 0.008534097838544676, "phrase": "gene_expression_programming"}, {"score": 0.0046176782475198085, "phrase": "present_work"}, {"score": 0.004224786847720058, "phrase": "rice_husk_ash"}, {"score": 0.003785115566529808, "phrase": "namely_the_water"}, {"score": 0.0029593432468318745, "phrase": "test_trial_number"}, {"score": 0.002867771524071872, "phrase": "output_layer"}, {"score": 0.002750056254309311, "phrase": "input_parameters"}, {"score": 0.002721388234661538, "phrase": "gene_expression_programming_models"}, {"score": 0.002374735066990346, "phrase": "tiny_error"}, {"score": 0.002301211274459965, "phrase": "gene_expression_programming_model"}, {"score": 0.0022653055209664284, "phrase": "powerful_tool"}, {"score": 0.0021049977753042253, "phrase": "considered_range"}], "paper_keywords": ["Geopolymer", " Compressive strength", " Ash mixture", " Nanoparticles", " Gene expression programming"], "paper_abstract": "In the present work, the effect of SiO2 and Al2O3 nanoparticles on compressive strength of ash-based geopolymers with different mixtures of rice husk ash, fly ash, nanoalumina and nanosilica has been predicted by gene expression programming. The models were constructed by 12 input parameters, namely the water curing time, the rice husk ash content, the fly ash content, the water glass content, NaOH content, the water content, the aggregate content, SiO2 nanoparticle content, Al2O3 nanoparticle content, oven curing temperature, oven curing time and test trial number. The value for the output layer was the compressive strength. According to the input parameters in gene expression programming models, the data were trained and tested, and the effects of SiO2 and Al2O3 nanoparticles on compressive strength of the specimens were predicted with a tiny error. The results indicate that gene expression programming model is a powerful tool for predicting the effect of nanoparticles on compressive strength of the geopolymers in the considered range.", "paper_title": "Predicting the effects of nanoparticles on compressive strength of ash-based geopolymers by gene expression programming", "paper_id": "WOS:000325809300017"}