{"auto_keywords": [{"score": 0.028144631874934323, "phrase": "reactive_system"}, {"score": 0.00481495049065317, "phrase": "reactive_modal_tableaux"}, {"score": 0.004706821999798591, "phrase": "reactive_semantics"}, {"score": 0.004680169643744616, "phrase": "reactive_beth_tableaux"}, {"score": 0.004653667500876187, "phrase": "modal_logic"}, {"score": 0.004549144357293899, "phrase": "reactive_idea"}, {"score": 0.004177578905812264, "phrase": "initial_state"}, {"score": 0.004095323392273661, "phrase": "allowed_transitions"}, {"score": 0.003707623127692214, "phrase": "ordinary_non-reactive_system"}, {"score": 0.0029956288559843235, "phrase": "simple_idea"}, {"score": 0.002970177327299509, "phrase": "existing_systems"}, {"score": 0.0028139168128067343, "phrase": "reactive_tableaux"}, {"score": 0.0026058621464926826, "phrase": "ordinary_system"}, {"score": 0.0024547103576350233, "phrase": "serious_loss"}, {"score": 0.002299180988482364, "phrase": "specific_application"}], "paper_keywords": ["Modal logic", " Other nonclassical logic", " Combined logics", " Logic in computer science", " Beth tableaux"], "paper_abstract": "This paper introduces the idea of reactive semantics and reactive Beth tableaux for modal logic and quotes some of its applications. The reactive idea is very simple. Given a system with states and the possibility of transitions moving from one state to another, we can naturally imagine a path beginning at an initial state and moving along the path following allowed transitions. If our starting point is s (0), and the path is s (0), s (1),..., s (n) , then the system is ordinary non-reactive system if the options available at s (n) (i.e., which states t we can go to from s (n) ) do not depend on the path s (0),..., s (n) (i.e., do not depend on how we got to s (n) ). Otherwise if there is such dependence then the system is reactive. It seems that the simple idea of taking existing systems and turning them reactive in certain ways, has many new applications. The purpose of this paper is to introduce reactive tableaux in particular and illustrate and present some of the applications of reactivity in general. Mathematically one can take a reactive system and turn it into an ordinary system by taking the paths as our new states. This is true but from the point of view of applications there is serious loss of information here as the applicability of the reactive system comes from the way the change occurs along the path. In any specific application, the states have meaning, the transitions have meaning and the paths have meaning. Therefore the changes in the system as we go along a path can have very important meaning in the context, which enhances the usability of the model.", "paper_title": "Introducing reactive modal tableaux", "paper_id": "WOS:000312272700003"}