{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "streaming_applications"}, {"score": 0.03719184306667651, "phrase": "application_stage"}, {"score": 0.033347781412583634, "phrase": "deterministic_case"}, {"score": 0.02773232960656052, "phrase": "long_time"}, {"score": 0.004482129830695465, "phrase": "linear_chain"}, {"score": 0.004291339332420335, "phrase": "fully_heterogeneous_target_platform"}, {"score": 0.003974168112336536, "phrase": "random_variables"}, {"score": 0.003699248271610776, "phrase": "data_sets"}, {"score": 0.0036057249778792388, "phrase": "application_stages"}, {"score": 0.003487658196780032, "phrase": "single_processor"}, {"score": 0.0033907699663068744, "phrase": "critical_hardware_resource"}, {"score": 0.0031319153105988217, "phrase": "optimal_throughput"}, {"score": 0.003084138237955827, "phrase": "smallest_internal_resource_throughput"}, {"score": 0.0030605228723126483, "phrase": "first_contribution"}, {"score": 0.002998426187835658, "phrase": "general_method"}, {"score": 0.002952679447548371, "phrase": "computation_and_communication_times"}, {"score": 0.002870610281308612, "phrase": "i.i.d._exponential_laws"}, {"score": 0.0028486252355914084, "phrase": "second_contribution"}, {"score": 0.0027836724009301776, "phrase": "stage_parameters"}, {"score": 0.002769440203069354, "phrase": "associated_random_sequences"}, {"score": 0.0026786833273475764, "phrase": "different_application_stages"}, {"score": 0.002590892903301456, "phrase": "first_stage"}, {"score": 0.0024995563056109224, "phrase": "next_stages"}, {"score": 0.002380715686515631, "phrase": "remaining_time"}, {"score": 0.002350389897247675, "phrase": "processing_time"}, {"score": 0.0023323797263567533, "phrase": "fresh_operation"}, {"score": 0.0022675124632171055, "phrase": "exponential_case"}, {"score": 0.0022101055924375725, "phrase": "extensive_set"}, {"score": 0.0021158226375248192, "phrase": "actual_behavior"}], "paper_keywords": [""], "paper_abstract": "In this paper, we investigate how to compute the throughput of probabilistic and replicated streaming applications. We are given (i) a streaming application whose dependence graph is a linear chain; (ii) a one-to-many mapping of the application onto a fully heterogeneous target platform, where a processor is assigned at most one application stage, but where a stage can be replicated onto a set of processors; and (iii) a set of random variables modeling the computation and communication times in the mapping. We show how to compute the throughput of the application, i.e., the rate at which data sets can be processed. The problem is easy when application stages are not replicated, i.e., each application stage is assigned to a single processor: in that case the throughput is dictated by the critical hardware resource. However, when stages are replicated, i.e., each application stage may be assigned to several processors, the problem becomes surprisingly complicated: even in the deterministic case, the optimal throughput may be lower than the smallest internal resource throughput. The first contribution of the paper is to provide a general method to compute the throughput when computation and communication times, also called stage parameters, are constant or follow I.I.D. exponential laws. The second contribution is to provide bounds for the throughput when stage parameters form associated random sequences (correlation between communication and processing times of a given data set on the different application stages, i.e., a data set that takes a long time on the first stage is likely to be large, and to take a long time on the next stages), and are N.B.U.E. (New Better than Used in Expectation) variables (if an operation has already been processed for some duration, the remaining time is smaller than the processing time of a fresh operation): the throughput is bounded from below by the exponential case and bounded from above by the deterministic case. An extensive set of simulation allows us to assess the quality of the model, and to observe the actual behavior of several distributions.", "paper_title": "Computing the Throughput of Probabilistic and Replicated Streaming Applications", "paper_id": "WOS:000336426000007"}