{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "robust_capacitated_international_sourcing_problem"}, {"score": 0.004589124394375718, "phrase": "available_set"}, {"score": 0.004545240514015278, "phrase": "potential_suppliers"}, {"score": 0.004437349839203418, "phrase": "selected_suppliers"}, {"score": 0.003934970057482768, "phrase": "macroeconomic_conditions"}, {"score": 0.0033575566897536906, "phrase": "scenario-optimization_approach"}, {"score": 0.0030058503645435455, "phrase": "possible_scenarios"}, {"score": 0.0027830917623582903, "phrase": "constructive_method"}, {"score": 0.0027431953780099826, "phrase": "memory_structures"}, {"score": 0.0025892330566358503, "phrase": "local_search_procedure"}, {"score": 0.0025034338848015166, "phrase": "improved_outcomes"}, {"score": 0.002443890721386284, "phrase": "innovative_mechanism"}, {"score": 0.0023972750359328235, "phrase": "good_balance"}, {"score": 0.0023178219772486868, "phrase": "search_process"}, {"score": 0.002219516542316085, "phrase": "extrapolated_relinking"}, {"score": 0.0021876814398268775, "phrase": "computational_experimentation"}, {"score": 0.0021049977753042253, "phrase": "recent_tabu_search_approach"}], "paper_keywords": ["memory structures", " path relinking"], "paper_abstract": "The International Sourcing Problem consists of selecting a subset from an available set of potential suppliers internationally located. The selected suppliers must meet the demand for items from a set of plants, which are also located worldwide. Since the costs are affected by macroeconomic conditions in the countries where the supplier and the plant are located, the formulation considers the uncertainty associated with changes in these conditions. We formulate the robust capacitated international sourcing problem by means of a scenario-optimization approach. When dealing with uncertainty, one of the most common approaches in the literature is to formulate the problem via a set of possible scenarios, this is the approach we follow here. In this paper we propose a constructive method based on memory structures to solve this problem. The method is coupled with a local search procedure followed by a path relinking for improved outcomes' We propose an innovative mechanism to achieve a good balance between intensification and diversification in the search process. Moreover, our path-relinking implementation uses constructive neighborhoods for extrapolated relinking. The computational experimentation favors this method when compared with a recent tabu search approach. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Adaptive memory programing for the robust capacitated international sourcing problem", "paper_id": "WOS:000250256100011"}