{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_usage"}, {"score": 0.020757599528993073, "phrase": "future_jobs"}, {"score": 0.010025623812828132, "phrase": "student_teachers'_perceptions"}, {"score": 0.006039450210258928, "phrase": "digital_experience"}, {"score": 0.004055511503825102, "phrase": "early_childhood"}, {"score": 0.003829892461605841, "phrase": "greece"}, {"score": 0.0032666255024083983, "phrase": "internet_use"}, {"score": 0.0032253056091816465, "phrase": "university_study"}, {"score": 0.0030071857666598193, "phrase": "internet_skills"}, {"score": 0.0026815368507715, "phrase": "higher_the_frequency"}, {"score": 0.002548331088496964, "phrase": "students'_perceptions"}, {"score": 0.0025160740422447837, "phrase": "internet's_impact"}, {"score": 0.0022434880661725493, "phrase": "teacher_training_education"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Internet", " Perceptions", " University students", " Learning"], "paper_abstract": "This study investigated student teachers' perceptions about the impact of internet usage on their learning and future jobs. The sample consisted of 448 student teachers from the Early Childhood and Primary Education Departments at the National University of Athens, in Greece. Student teachers' perceptions regarding the impact of internet usage on their learning and future jobs were, in general, positive. Most of the students believe that internet use in university study makes learning more interesting and effective, and that possessing internet skills will assist their future job prospects. This study has shown that the more the years of digital experience and the higher the frequency of internet usage, the more positive were students' perceptions regarding internet's impact on their learning and future jobs. More years of digital experience resulted in less perceived complexity. Implications of the findings for teacher training education programmes are also discussed. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Student teachers' perceptions about the impact of internet usage on their learning and jobs", "paper_id": "WOS:000316523100001"}