{"auto_keywords": [{"score": 0.034974622364427145, "phrase": "maximal_capacity"}, {"score": 0.00481495049065317, "phrase": "queueing_networks"}, {"score": 0.004769702911065878, "phrase": "limited_flexibility"}, {"score": 0.004658426838467567, "phrase": "queueing_network"}, {"score": 0.004023947242621452, "phrase": "flexible_servers"}, {"score": 0.003030247482854539, "phrase": "arrival_rates"}, {"score": 0.0024960069794216977, "phrase": "maximal_capacity_objective"}, {"score": 0.002460825108719896, "phrase": "maximum_throughput_allocation_problem"}, {"score": 0.0022492129111567824, "phrase": "tdccp"}, {"score": 0.0022079316670918334, "phrase": "np"}, {"score": 0.002125020720324262, "phrase": "exact_or_approximation_algorithms"}], "paper_keywords": ["queueing networks", " scheduling", " approximation algorithms"], "paper_abstract": "We study a queueing network where customers go through several stages of processing, with the class of a customer used to indicate the stage of processing. The customers are serviced by a set of flexible servers, i.e., a server may be capable of serving more than one class of customer and the sets of classes that the servers are capable of serving may overlap. We would like to choose an assignment of servers that achieves the maximal capacity of the given queueing network, where the maximal capacity is lambda* if the network can be stabilized for all arrival rates lambda < lambda* and cannot possibly be stabilized for all lambda > lambda*. We examine the situation where there is a restriction on the number of servers that are able to serve a class, and reduce the maximal capacity objective to a maximum throughput allocation problem of independent interest: the TOTAL DISCRETE CAPACITY CONSTRAINED PROBLEM (TDCCP). We prove that solving TDCCP is in general NP-complete, but we also give exact or approximation algorithms for several important special cases.", "paper_title": "Maximizing throughput in queueing networks with limited flexibility", "paper_id": "WOS:000236886100038"}