{"auto_keywords": [{"score": 0.04957891638694609, "phrase": "chebyshev_polynomials"}, {"score": 0.02322730111336097, "phrase": "public_key_algorithm"}, {"score": 0.010393062724784548, "phrase": "integer_ring"}, {"score": 0.008058417538728643, "phrase": "finite_fields"}, {"score": 0.007594220588293174, "phrase": "period_distribution"}, {"score": 0.006623283814059955, "phrase": "real_numbers"}, {"score": 0.00463305285796083, "phrase": "kocarev"}, {"score": 0.0046007229963284345, "phrase": "tasev"}, {"score": 0.004334832612029898, "phrase": "semigroup_property"}, {"score": 0.004304574865291508, "phrase": "bergamo_et_al"}, {"score": 0.0039024014688338964, "phrase": "corresponding_plaintext"}, {"score": 0.0036767202303156854, "phrase": "real_number_fields"}, {"score": 0.003625537203803235, "phrase": "finite_rings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Public key algorithm", " Chaos", " Period distribution", " Security analysis", " Periodic orbit", " Dynamical system"], "paper_abstract": "Recently Kocarev and Tasev [20] proposed to use Chebyshev polynomials over real numbers to design a public key algorithm by employing the semigroup property. Bergamo et al. [4] pointed out that the public key algorithm based on Chebyshev polynomials working on real numbers is not secure and devised an attack which permits to recover the corresponding plaintext from a given ciphertext. Later Kocarev et al. [19] generalized the Chebyshev polynomials from real number fields to finite fields and finite rings to make the public key algorithm more secure and practical. However, we analyzed the period distribution of the sequences generated by the Chebyshev polynomials over finite fields [21]. When the modulus N is prime, we found this algorithm was also not secure and proposed an attack on this algorithm over finite fields. We then proposed some schemes to improve the security. In this paper, we further analyze in detail the period distribution of the sequences generated by Chebyshev polynomials over the integer ring Z(N) when N is composite. It turns out that the period distribution is poor if N is not chosen properly and there are many small periods, which are not secure in the sense of cryptology. Based on these findings, we devise an attack on the public key algorithm based on Chebyshev polynomials over the integer ring Z(N). We also propose some suggestions to avoid this attack. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Security analysis of the public key algorithm based on Chebyshev polynomials over the integer ring Z(N)", "paper_id": "WOS:000295500300014"}