{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "selfish_tasks"}, {"score": 0.0047820521205253035, "phrase": "parallel_machines"}, {"score": 0.0046526806928044485, "phrase": "truthful_algorithms"}, {"score": 0.0044498415012873965, "phrase": "selfish_agent"}, {"score": 0.003463944293093155, "phrase": "completion_time"}, {"score": 0.0030402538087882015, "phrase": "different_scheduling_settings"}, {"score": 0.0029680398526914565, "phrase": "release_dates"}, {"score": 0.002947723206640026, "phrase": "unrelated_machines"}, {"score": 0.002799703831407504, "phrase": "best_previously_known_result"}, {"score": 0.002790103629701475, "phrase": "angel_et_al"}, {"score": 0.0026958888229781618, "phrase": "identical_machines"}, {"score": 0.002604847103905297, "phrase": "strong_model"}, {"score": 0.0024996360740525284, "phrase": "christodoulou_et_al"}, {"score": 0.0023416540209862803, "phrase": "polynomial-time_truthful_randomized_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Scheduling", " Algorithmic game theory", " Approximation"], "paper_abstract": "We study the problem of designing truthful algorithms for scheduling a set of tasks, each one owned by a selfish agent, to a set of parallel (identical or unrelated) machines in order to minimize the makespan. We consider the following process: at first the agents declare the length of their tasks, then given these bids, the protocol schedules the tasks on the machines. The aim of the protocol is to minimize the makespan, i.e. the maximum completion time of the tasks, while the objective of each agent is to minimize the completion time of its task and thus an agent may lie if by doing so, his task may finish earlier. In this paper, we show the existence of randomized truthful (non-polynomial-time) algorithms with an expected approximation ratio equal to 3/2 for different scheduling settings (identical machines with and without release dates and unrelated machines) and models of execution (strong or weak). Our result improves the best previously known result Angel et al. (2006) 111 for the problem with identical machines (P parallel to C(max)) in the strong model of execution and reaches, asymptotically, the lower bound of Christodoulou et al. (2007) [5]. In addition, this result can be transformed to a polynomial-time truthful randomized algorithm with an expected approximation ratio 3/2 + epsilon (resp. 11/6 - 1/3m) for Pm parallel to C(max) (resp. P parallel to C(max)). 2011 Elsevier B.V. All rights reserved.", "paper_title": "Randomized truthful algorithms for scheduling selfish tasks on parallel machines", "paper_id": "WOS:000298338100001"}