{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "interval-valued_intuitionistic_fuzzy_information"}, {"score": 0.013972542500758814, "phrase": "construction_project"}, {"score": 0.012590837495352425, "phrase": "interval-valued_intuitionistic_fuzzy_numbers"}, {"score": 0.00481495049065317, "phrase": "einstein_correlated_aggregation_operators"}, {"score": 0.004457995891964028, "phrase": "multiple_attribute_decision"}, {"score": 0.004185632403886255, "phrase": "attribute_values"}, {"score": 0.0039024014688338964, "phrase": "operational_laws"}, {"score": 0.003715579364728729, "phrase": "accuracy_function"}, {"score": 0.0034640450599342488, "phrase": "einstein_operations"}, {"score": 0.002787181295054319, "phrase": "interactions_phenomena"}, {"score": 0.002729133029776093, "phrase": "decision_making"}, {"score": 0.002562123444678208, "phrase": "ivifeca_operator"}, {"score": 0.0022110183535859374, "phrase": "construction_project_selection"}, {"score": 0.0021049977753042253, "phrase": "developed_method"}], "paper_keywords": ["Multiple attribute decision making (MADM)", " Interval-valued intuitionistic fuzzy numbers", " intuitionistic fuzzy Einstein correlated averaging (IVIFECA) operator", " construction project"], "paper_abstract": "In this paper, we investigate the multiple attribute decision making (MADM) problems for selecting the construction project in which attribute values take the form of interval-valued intuitionistic fuzzy information. Firstly, some operational laws of interval-valued intuitionistic fuzzy numbers and score function and accuracy function of interval-valued intuitionistic fuzzy numbers are introduced. Then, we utilize Einstein operations to develop the interval-valued intuitionistic fuzzy Einstein correlated averaging (IVIFECA) operator. The prominent characteristic of this operator is that they can not only consider the importance of the elements or their ordered positions, but also reflect the interactions phenomena among the decision making attributes or their ordered positions. We have applied the IVIFECA operator to multiple attribute decision making problems for selecting the construction project with interval-valued intuitionistic fuzzy information. Finally an illustrative example for involving a construction project selection has been given to show the developed method.", "paper_title": "Models for multiple attribute decision making based on the Einstein correlated aggregation operators with interval-valued intuitionistic fuzzy information", "paper_id": "WOS:000332245500038"}