{"auto_keywords": [{"score": 0.04846792924157254, "phrase": "eda"}, {"score": 0.014690312119703742, "phrase": "revised_dispersion_correction"}, {"score": 0.00481495049065317, "phrase": "noncovalent_interactions"}, {"score": 0.0041579627441997, "phrase": "energy_decomposition_analysis"}, {"score": 0.0034187896011435245, "phrase": "noncovalent_interaction_energies"}, {"score": 0.0027969169552386, "phrase": "dzp"}, {"score": 0.002573424607574822, "phrase": "better_performance"}, {"score": 0.002486659929589854, "phrase": "noncovalent_interaction_energy"}, {"score": 0.002414616656410503, "phrase": "corresponding_energy_components"}, {"score": 0.0021678232353129472, "phrase": "fullerene_aggregates"}, {"score": 0.002125735077004312, "phrase": "better_insight"}, {"score": 0.0021049977753042253, "phrase": "binding_characteristics"}], "paper_keywords": ["Assessment", " DFT-D3", " EDA", " Noncovalent interaction", " STO"], "paper_abstract": "An assessment study is presented about energy decomposition analysis (EDA) in combination with DFT including revised dispersion correction (DFT-D3) with Slater-type orbital (STO) basis set. There has been little knowledge about the performance of the EDA + DFT-D3 concerning STOs. In this assessment such an approach was applied to calculate noncovalent interaction energies and their corresponding components. Complexes in S22 set were used to evaluate the performance of EDA in conjunction with four representative types of GGA-functionals of DFT-D3 (BP86-D3, BLYP-D3, PBE-D3 and SSB-D3) with three STO basis sets ranging in complexity from DZP, TZ2P to QZ4P. The results showed that the approach of EDA + BLYP-D3/TZ2P has a better performance not only in terms of calculating noncovalent interaction energy quantitatively but also in analyzing corresponding energy components qualitatively. This approach (EDA + BLYP-D3/TZ2P) was thus applied further to two representative large-system complexes including porphine dimers and fullerene aggregates to gain a better insight into binding characteristics.", "paper_title": "The assessment and application of an approach to noncovalent interactions: the energy decomposition analysis (EDA) in combination with DFT of revised dispersion correction (DFT-D3) with Slater-type orbital (STO) basis set", "paper_id": "WOS:000309862000002"}