{"auto_keywords": [{"score": 0.03924561015138581, "phrase": "seat-filling_foam"}, {"score": 0.015719716506582538, "phrase": "low-density-foam_material_model"}, {"score": 0.004342430078306461, "phrase": "head_supports"}, {"score": 0.004159446063902181, "phrase": "filling_material"}, {"score": 0.0040186038781533946, "phrase": "polyurethane_foam"}, {"score": 0.0038825121288253435, "phrase": "seat_assembly"}, {"score": 0.0037834649508375544, "phrase": "material_characteristics"}, {"score": 0.003426556090707852, "phrase": "proper_parameter_values"}, {"score": 0.003382547312072468, "phrase": "selected_material_model"}, {"score": 0.0028591768694918, "phrase": "parameter_values"}, {"score": 0.002738523189244011, "phrase": "crash-test_simulations"}, {"score": 0.0025892330566358503, "phrase": "ls-dyna_explicit_simulations"}, {"score": 0.0025449518236394103, "phrase": "material_parameters"}, {"score": 0.0024061887405214186, "phrase": "engineering_applicability"}, {"score": 0.002236055625099805, "phrase": "missing_parameter_values"}, {"score": 0.0022073031056287903, "phrase": "highly_non-linear_material_model"}, {"score": 0.0021049977753042253, "phrase": "experimental_data"}], "paper_keywords": ["Genetic algorithm", " Finite-element method", " Gradient-descent method", " Low-density foam", " LS-DYNA"], "paper_abstract": "Purpose - In the event of a crash involving a car, its seats, together with their backrests and head supports, ensure the safety of the passengers. The filling material used for such a car seat is normally made of polyurethane foam. To simulate the behaviour of the seat assembly during a crash, the material characteristics of the seat-filling foam should be appropriately modelled. The purpose of this paper is to present a method, with which the proper parameter values of the selected material model for the seat-filling foam can be easily determined. Design/methodology/approach - In the study, an experiment with the specimen from seat-filling foam was carried out. The results from this experiment were the basis for the determination of the parameter values of the low-density-foam material model, which is often used in crash-test simulations. Two different numerical optimisation algorithms - a genetic algorithm and a gradient-descent algorithm - were coupled with LS-DYNA explicit simulations to identify the material parameters. Findings - The paper provides comparison of two optimisation algorithms and discusses the engineering applicability of the results. Originality/value - This paper presents an approach for the identification of the missing parameter values of the highly non-linear material model, if these cannot be easily determined directly from experimental data.", "paper_title": "Parameter identification for a low-density-foam material model using numerical optimisation procedures", "paper_id": "WOS:000343322300018"}