{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "higher-affinity_agonists"}, {"score": 0.004706305193222972, "phrase": "tuning_the_binding-site_flexibility"}, {"score": 0.004621148492564008, "phrase": "high-affinity_and_high-selectivity_agonists"}, {"score": 0.0040479661688863884, "phrase": "present_study"}, {"score": 0.003956558420993431, "phrase": "large-scale_molecular_dynamics_simulations"}, {"score": 0.0037454814403672697, "phrase": "flip-packing_events"}, {"score": 0.003449718244515019, "phrase": "agornst-binding_site"}, {"score": 0.0033410898465226417, "phrase": "flip-packing_phenomenon"}, {"score": 0.0032358709481309913, "phrase": "binding_flexibility"}, {"score": 0.003063123420705719, "phrase": "molecular_docking_operations"}, {"score": 0.0030352396244492604, "phrase": "first-principles_calculations"}, {"score": 0.0028731719610706214, "phrase": "computational_predictions"}, {"score": 0.0026949679939994226, "phrase": "affinity_assays"}, {"score": 0.002539379289856756, "phrase": "wet-experimental_measurements"}, {"score": 0.002360132221690264, "phrase": "receptor-binding_affinity"}, {"score": 0.0022962183207691188, "phrase": "agonistic_function"}, {"score": 0.0021049977753042253, "phrase": "dopamine_receptors"}], "paper_keywords": [""], "paper_abstract": "Discovery of high-affinity and high-selectivity agonists of 5-HT1AR. has become very attractive due to their potential therapeutic effects on multiple 5-HT1AR-related psychological and neurological problems. On the basis of our previously designed lead compound FW01 (K-i = 51.9 nM, denoted as 9a in the present study), we performed large-scale molecular dynamics simulations and molecular docking operations on 5-HT1AR-9a binding. We found the flip-packing events for the headgroup of 9a, and we also found that its tail group could bind flexibly at the agornst-binding site of 5-HT1AR. By finely tuning the flip-packing phenomenon of the 9a headgroup and tuning the binding flexibility of 9a tail group, we virtually designed a series of new 9a derivatives through molecular docking operations and first-principles calculations and predicted that these newly designed 9a derivatives should be higher-affinity agonists of 5-HT1AR. The computational predictions on the new 9a derivatives have been confirmed by our wet-experimental studies as chemical synthesis, binding affinity assays, and agonistic-function assays. The consistency between our computational design and wet-experimental measurements has led to our discovery of higher-affinity agonists of 5-HT1AR, with,similar to 50-fold increase in receptor-binding affinity and similar to 25-fold improvements in agonistic function. In addition, our newly designed 5-HT1AR agonists showed very high selectivity of 5-HT1AR over subtype 5-HT2AR and also over three subtypes of dopamine receptors (D-1, D-2, and D-3).", "paper_title": "Higher-Affinity Agonists of 5-HT1AR Discovered through Tuning the Binding-Site Flexibility", "paper_id": "WOS:000360322800012"}