{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_proof_systems"}, {"score": 0.038531650814239815, "phrase": "two-way_probabilistic_finite_automata"}, {"score": 0.03251274839731744, "phrase": "np-complete_language_l-knapsack"}, {"score": 0.02681016029331404, "phrase": "polynomial_expected_running_time"}, {"score": 0.0044219992735047954, "phrase": "theoretical_computing"}, {"score": 0.004291073117901643, "phrase": "key_players"}, {"score": 0.004205940624913343, "phrase": "original_model"}, {"score": 0.004132966320008909, "phrase": "pspace"}, {"score": 0.004020492138367616, "phrase": "randomized_polynomial_time"}, {"score": 0.0039111952811730155, "phrase": "large_interest"}, {"score": 0.0035827424231607784, "phrase": "one-way_quantum_finite_automataas"}, {"score": 0.0034940602515570636, "phrase": "nishimura"}, {"score": 0.0034765791708319398, "phrase": "yamakami"}, {"score": 0.003441891354624516, "phrase": "._ip"}, {"score": 0.0033990174874556833, "phrase": "public_randomization"}, {"score": 0.0033735510803518352, "phrase": "arthur-merlin"}, {"score": 0.00327356326590461, "phrase": "turing_machines"}, {"score": 0.003240895431893266, "phrase": "fixed-size_quantum_register"}, {"score": 0.003176531881913951, "phrase": "yakaryilmaz"}, {"score": 0.0029611289031152856, "phrase": "two-way_finite_automaton"}, {"score": 0.002938931857801796, "phrase": "quantum_mixed_states"}, {"score": 0.0028021527740710508, "phrase": "two-way_finite_automata"}, {"score": 0.0027533992349838272, "phrase": "ambainis"}, {"score": 0.0027396098874397563, "phrase": "watrous"}, {"score": 0.002309854101066247, "phrase": "exponential_expected_running_time"}, {"score": 0.0021476967767071233, "phrase": "quantum_pure_states"}, {"score": 0.0021369416775353107, "phrase": "unitary_operators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Quantum computing", " Quantum finite automata", " Quantum Arthur-Merlin proof systems", " Two-way finite automata with quantum and classical states"], "paper_abstract": "Interactive proof systems (IP) are very powerful - languages they can accept form exactly PSPACE. They represent also one of the very fundamental concepts of theoretical computing and a model of computation by interactions. One of the key players in IP is verifier. In the original model of IP whose power is that of PSPACE, the only restriction on verifiers is that they work in randomized polynomial time. Because of such key importance of IP, it is of large interest to find out how powerful will IP be when verifiers are more restricted. So far this was explored for the case that verifiers are two-way probabilistic finite automata (Dwork and Stockmeyer, 1990) and one-way quantum finite automataas well as two-way quantum finite automata (Nishimura and Yamakami, 2009). IP in which verifiers use public randomization is called Arthur-Merlin proof systems (AM). AM with verifiers modeled by Turing Machines augmented with a fixed-size quantum register (qAM) were studied also by Yakaryilmaz (2012). He proved, for example, that an NP-complete language L-knapsack, representing the 0-1 knapsack problem, can be recognized by a qAM whose verifier is a two-way finite automaton working on quantum mixed states using superoperators. In this paper we explore the power of AM for the case that verifiers are two-way finite automata with quantum and classical states(2QCFA) - introduced by Ambainis and Watrous in 2002 - and the communications are classical. It is of interest to consider AM with such \"semi-quantum\" verifiers because they use only limited quantum resources. Our main result is that such Quantum Arthur-Merlin proof systems (QAM(2QCFA)) with polynomial expected running time are more powerful than the models in which the verifiers are two-way probabilistic finite automata (AM(2PFA)) with polynomial expected running time. Moreover, we prove that there is a language which can be recognized by an exponential expected running time QAM(2QCFA), but cannot be recognized by any AM(2PFA), and that the NP-complete language L-knapsack can also be recognized by a QAM(2QCFA) working only on quantum pure states using unitary operators. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Power of the interactive proof systems with verifiers modeled by semi-quantum two-way finite automata", "paper_id": "WOS:000353352800009"}