{"auto_keywords": [{"score": 0.04797858309448136, "phrase": "functional_domain"}, {"score": 0.015719716506582538, "phrase": "multiplex_pcr_primers"}, {"score": 0.013500476405387384, "phrase": "pcr_products"}, {"score": 0.009575418808432339, "phrase": "proposed_algorithm"}, {"score": 0.009157518833870218, "phrase": "multiplex_pcr_experiments"}, {"score": 0.0047842129415024475, "phrase": "heuristic_algorithm"}, {"score": 0.004753670676591174, "phrase": "sequential_deletion_applications"}, {"score": 0.004708220751321872, "phrase": "sequential_deletion_method"}, {"score": 0.004444462552988661, "phrase": "multiplex_polymerase_chain_reaction"}, {"score": 0.004359853990466236, "phrase": "labor-intensive_task"}, {"score": 0.00396027311392058, "phrase": "multiple_forward_primers"}, {"score": 0.0037864980290391354, "phrase": "cdna_sequence"}, {"score": 0.0036906305674695985, "phrase": "primer_length"}, {"score": 0.0033200826267264383, "phrase": "near-optimal_solution"}, {"score": 0.0030840119435985823, "phrase": "homo"}, {"score": 0.002977061391551631, "phrase": "test_examples"}, {"score": 0.002864628676257225, "phrase": "designed_primers"}, {"score": 0.0028463059289874637, "phrase": "homo_sapiens_ribosomal_protein"}, {"score": 0.0026693851900137953, "phrase": "n-terminal_truncated_mutants"}, {"score": 0.0025603123094624265, "phrase": "eight_tube_groups"}, {"score": 0.00236289633510808, "phrase": "polyacrylamide_gel_electrophoresis"}, {"score": 0.002280916026414715, "phrase": "software_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiplex polymerase chain reaction (PCR)", " Polyacrylamide gel electrophoresis (PAGE)", " Sequential deletion", " N-terminal truncated mutants"], "paper_abstract": "The sequential deletion method is commonly applied to locate the functional domain of a protein. Unfortunately, manually designing primers for multiplex polymerase chain reaction (PCR) is a labor-intensive task. In order to Speed LIP the experimental Procedure and to improve the efficiency of producing PCR products, this paper proposes a Multiplex PCR primers (MPCRPs) designer to design multiple forward primers with a single 3'-UTR reverse primer for extracting various N-terminal truncated mutants to quickly locate the functional domain of a cDNA sequence. Several factors, including melting temperature, primer length, GC content, internal self-complement, cross-dimerization, terminal limitation, and specificity, are used as the criteria for designing primers. This study obtains a near-optimal solution of primer sets that can be placed in as few test tubes as possible for one multiplex PCR experiment. Results: Homo sapiens ribosomal protein L5, Homo sapiens xylosyltransferase 1, and Bacteriophage T4 gene product 11 were used as test examples to verify efficacy of the proposed algorithm. In addition, the designed primers of Homo sapiens ribosomal protein L5 cDNA were applied in multiplex PCR experiments. A total of 48 forward primers and one reverse primer were designed and used to duplicate N-terminal truncated mutants of different lengths from the protein. The primers were classified into eight tube groups (i.e., test tubes) held within the same temperature range (53-57 C), and the validity of the PCR products were verified using polyacrylamide gel electrophoresis (PAGE) with the functional domain correctly located. A software implementation of the proposed algorithm useful in assisting the researcher to design primers for multiplex PCR experiments was developed and available upon request. (c) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Design of multiplex PCR primers using heuristic algorithm for sequential deletion applications", "paper_id": "WOS:000264582700007"}