{"auto_keywords": [{"score": 0.02997165440966494, "phrase": "correct_number"}, {"score": 0.00481495049065317, "phrase": "bayesian_criterion_for_cluster_stability"}, {"score": 0.004238682850598745, "phrase": "point-to-cluster_distances"}, {"score": 0.00395069818358908, "phrase": "existing_perturbation_methods"}, {"score": 0.003847802030433298, "phrase": "five_ways"}, {"score": 0.003633927813203731, "phrase": "prior_distribution"}, {"score": 0.00355485940716082, "phrase": "boundary_regions"}, {"score": 0.00308788133472785, "phrase": "well-chosen_prior_distributions"}, {"score": 0.002994178996584381, "phrase": "rigorous_theoretical_treatment"}, {"score": 0.002717750004930131, "phrase": "detailed_picture"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["clustering", " stability", " Bayesian", " consistency", " heatmap"], "paper_abstract": "We present a technique for evaluating and comparing how clusterings reveal structure inherent in the data set. Our technique is based on a criterion evaluating how much point-to-cluster distances may be perturbed without affecting the membership of the points. Although similar to some existing perturbation methods, our approach distinguishes itself in five ways. First, the strength of the perturbations is indexed by a prior distribution controlling how close to boundary regions a point may be before it is considered unstable. Second, our approach is exact in that we integrate over all the perturbations; in practice, this can be done efficiently for well-chosen prior distributions. Third, we provide a rigorous theoretical treatment of the approach, showing that it is consistent for estimating the correct number of clusters. Fourth, it yields a detailed picture of the behavior and structure of the clustering. Finally, it is computationally tractable and easy to use, requiring only a point-to-cluster distance matrix as input. In a simulation study, we show that it outperforms several existing methods in terms of recovering the correct number of clusters. We also illustrate the technique in three real data sets. (C) 2013 Wiley Periodicals, Inc.", "paper_title": "A Bayesian Criterion for Cluster Stability", "paper_id": "WOS:000209525400007"}