{"auto_keywords": [{"score": 0.048946208597162505, "phrase": "electronic_harassment"}, {"score": 0.04431452575137328, "phrase": "particular_actions"}, {"score": 0.00481495049065317, "phrase": "young_people's_successful_resolution"}, {"score": 0.004645057834614705, "phrase": "pervasive_phenomenon"}, {"score": 0.004608121749000898, "phrase": "young_people"}, {"score": 0.004203803478570494, "phrase": "personal_characteristics"}, {"score": 0.004137184278868391, "phrase": "successful_resolution"}, {"score": 0.0038348235692738783, "phrase": "distressing_electronic_harassment_situations"}, {"score": 0.0034289106230496816, "phrase": "literature_reviews"}, {"score": 0.002910545717767559, "phrase": "multivariate_logistic_regression"}, {"score": 0.002752075650871066, "phrase": "family_support"}, {"score": 0.00240213106042981, "phrase": "successful_resolution_harassment"}, {"score": 0.0022895278869126848, "phrase": "young_people's_confidence"}, {"score": 0.0021561514733516676, "phrase": "effective_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Harassment", " Cyberbullying", " Bullying", " Resiliency", " Protective factors", " Internet safety"], "paper_abstract": "Electronic harassment is a pervasive phenomenon among young people, however relatively little is known about actions that targets of harassment may undertake to manage such abuse, and whether particular actions and personal characteristics are associated with successful resolution of such harassment. This mixed methods research identified whether particular actions or characteristics are associated with the resolution of distressing electronic harassment situations. Study one used focus groups interviews with 36 New Zealand (NZ) students (aged 13-15) to explore strategies used to manage electronic harassment. Study two drew on these findings, in conjunction with literature reviews, to construct a questionnaire delivered to 1673 students (aged 12-19). Over half of participants used more than one strategy to try and resolve the abuse. Ignoring abuse was the most popular strategy, followed by confronting and fighting strategies. However, multivariate logistic regression showed ignoring did not predict resolution, and nor did received adult or family support. However a sense of efficacy in approaching adults did predict resolution. The quality of intervention, rather than the type of intervention per se, seems to be critical in the successful resolution harassment. Reflecting on both studies we suggest the need to increase young people's confidence in actively dealing with harassment as well as supporting adults and peers to provide effective support. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Factors associated with young people's successful resolution of distressing electronic harassment", "paper_id": "WOS:000312517900022"}