{"auto_keywords": [{"score": 0.049071348258906654, "phrase": "transaction_scheduling"}, {"score": 0.04873991091315952, "phrase": "grid_database"}, {"score": 0.04069447365641264, "phrase": "three-level_transaction_scheduling_model"}, {"score": 0.02806136552690869, "phrase": "cdtpn_model"}, {"score": 0.014099146655355868, "phrase": "concurrency_transaction"}, {"score": 0.00481495049065317, "phrase": "petri_net-based"}, {"score": 0.004469400468609653, "phrase": "scheduling_model"}, {"score": 0.004437807397753662, "phrase": "scheduling_algorithms"}, {"score": 0.0043908341845978575, "phrase": "formal_model"}, {"score": 0.00428314621261913, "phrase": "grid_database_environment"}, {"score": 0.004163290958633733, "phrase": "homogeneous_distributed_architecture"}, {"score": 0.004075596668736259, "phrase": "grid_architecture"}, {"score": 0.003975609222669783, "phrase": "new_and_evolving_architecture"}, {"score": 0.003933508945770709, "phrase": "conventional_model"}, {"score": 0.0037295765964056255, "phrase": "transmission_time"}, {"score": 0.0036639675955591065, "phrase": "user's_priority"}, {"score": 0.0035867530188337933, "phrase": "database_sites"}, {"score": 0.0032704647689720326, "phrase": "colored_dynamic_time_petri_nets"}, {"score": 0.0031229055434606003, "phrase": "transaction_scheduling_model"}, {"score": 0.00285753732066807, "phrase": "classical_transaction_scheduling_algorithms"}, {"score": 0.00257775722777195, "phrase": "dynamic_performance"}, {"score": 0.002559501330352064, "phrase": "grid_transaction"}, {"score": 0.002532359001507531, "phrase": "important_results"}, {"score": 0.0021811799507898792, "phrase": "time_interval"}, {"score": 0.0021049977753042253, "phrase": "input_places"}], "paper_keywords": ["Grid database", " Transaction scheduling", " Algorithm", " Modeling"], "paper_abstract": "Purpose - The purpose of this paper is to present a scheduling model, scheduling algorithms, and formal model and analysis techniques for concurrency transaction in grid database environment. Design/methodology/approach - Classical transaction models and scheduling algorithms developed for homogeneous distributed architecture will not work in the grid architecture and should be revisited for this new and evolving architecture. The conventional model is improved by three-level transaction scheduling model and the scheduling algorithms for concurrency transaction is improved by considering transmission time of a transaction, user's priority, and the number of database sites accessed by the transaction as a priority of the transaction. Aiming at the problems of analysis and modeling of the transaction scheduling in grid database, colored dynamic time Petri nets (CDTPN) model are proposed. Then the reachability of the transaction scheduling model is analyzed. Findings - The three-level transaction scheduling model not only supports the autonomy of grid but also lightens the pressure of communication. Compared with classical transaction scheduling algorithms, the algorithms not only support the correctness of the data but also improve the effectiveness of the system. The CDTPN model is convenient for modeling and analyzing dynamic performance of grid transaction. Some important results such as abort-ratio and turnover-time are gotten by analyzing reachability of CDTPN. Originality/value - The three-level transaction scheduling model and improved scheduling algorithms with more complex priority are presented in the paper. The paper gives a CDTPN model for modeling transaction scheduling in grid database. In CDTPN model, the time interval of a transition is a function of tokens in input places of the transition.", "paper_title": "Petri net-based modeling and performance analysis of transaction scheduling in grid database", "paper_id": "WOS:000273285900008"}