{"auto_keywords": [{"score": 0.04662487951120457, "phrase": "biometric_features"}, {"score": 0.03653250522204508, "phrase": "cirf"}, {"score": 0.015719716506582538, "phrase": "cancellable_biometrics"}, {"score": 0.015463615321300136, "phrase": "quotient_polynomial_ring"}, {"score": 0.011593072418672449, "phrase": "practical_accuracy"}, {"score": 0.004696491408936132, "phrase": "biometric_authentication"}, {"score": 0.004198323646273642, "phrase": "biometric_data"}, {"score": 0.003831591603702392, "phrase": "authentication_scheme"}, {"score": 0.003630073540438812, "phrase": "major_challenge"}, {"score": 0.003570218982072853, "phrase": "strong_security"}, {"score": 0.0034967818541774844, "phrase": "correlation_invariant_random_filtering"}, {"score": 0.003354393040689453, "phrase": "provable_security"}, {"score": 0.0032581736321024373, "phrase": "security_proof"}, {"score": 0.0032177835714470027, "phrase": "unrealistically_strong_assumption"}, {"score": 0.0027246145918972, "phrase": "algebraic_point"}, {"score": 0.002517524071220657, "phrase": "new_transformation_algorithm"}, {"score": 0.0021853532419450887, "phrase": "fingerprint_verification"}, {"score": 0.0021049977753042253, "phrase": "matching_accuracy"}], "paper_keywords": [""], "paper_abstract": "Biometric authentication has attracted attention because of its high security and usability. However, biometric features such as fingerprints are unchangeable throughout the life of individuals. Thus, once biometric data have been compromised, they cannot be used for authentication securely ever again. To address this issue, an authentication scheme called cancellable biometrics has been studied. However, there remains a major challenge to achieve both strong security and practical accuracy. The correlation invariant random filtering (CIRF) is an algorithm for cancellable biometrics with provable security and practical accuracy. However, the security proof requires an unrealistically strong assumption with regard to biometric features. The authors examine the security of the CIRF when the assumption is not satisfied, and show that there are vulnerabilities. To address the problems, the authors interpret the CIRF from an algebraic point of view and generalise it based on a quotient polynomial ring. Then several theorems are proved, which derive a new transformation algorithm. The security of the algorithm without any condition on the biometric features is proved. The authors also evaluate the accuracy of the algorithm by applying it to the chip matching algorithm for fingerprint verification and show that it does not degrade the matching accuracy.", "paper_title": "Unconditionally provably secure cancellable biometrics based on a quotient polynomial ring", "paper_id": "WOS:000209166800008"}