{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "anesthetic_records"}, {"score": 0.004645057834614705, "phrase": "high-quality_time-series_physiologic"}, {"score": 0.004441059405327222, "phrase": "easy-to-use_structure"}, {"score": 0.004322967486451877, "phrase": "ethics_committee_approval"}, {"score": 0.0042459818200777846, "phrase": "surgical_operations"}, {"score": 0.004208002469225673, "phrase": "general_anesthesia"}, {"score": 0.004114527599108729, "phrase": "physiologic_data"}, {"score": 0.0040777192615062815, "phrase": "drug_administrations"}, {"score": 0.003987126862293129, "phrase": "clinicians'_comments"}, {"score": 0.003595552309967789, "phrase": "physiologic_time-series_data"}, {"score": 0.003563370084662192, "phrase": "time-stamped_events"}, {"score": 0.003044455555031339, "phrase": "discussion_data"}, {"score": 0.0029901699209266435, "phrase": "significant_time"}, {"score": 0.002963390095037466, "phrase": "financial_costs"}, {"score": 0.0028076592725295646, "phrase": "clinical_interventions"}, {"score": 0.0027825094419000637, "phrase": "surgical_cases"}, {"score": 0.0027575842698911173, "phrase": "de-identifying"}, {"score": 0.0025202582748972122, "phrase": "computing_resources"}, {"score": 0.0024641814990854463, "phrase": "wider_research_community"}, {"score": 0.002398529964696261, "phrase": "additional_high-quality_data"}, {"score": 0.0023451553255837317, "phrase": "future_work"}, {"score": 0.0021920373388760314, "phrase": "quality_control_measures"}, {"score": 0.0021049977753042253, "phrase": "high-quality_datasets"}], "paper_keywords": [""], "paper_abstract": "Objective To provide a set of high-quality time-series physiologic and event data from anesthetic cases formatted in an easy-to-use structure. Materials and methods With ethics committee approval, data from surgical operations under general anesthesia were collected, including physiologic data, drug administrations, events, and clinicians' comments. These data were de-identified, formatted in a combined CSV/XML structure and made publicly available. Results Two separate datasets were collected containing physiologic time-series data and time-stamped events for 34 patients. For 20 patients, the data included 400 physiologic signals collected over 20 h, 274 events, and 597 drug administrations. For 14 patients, the data included 23 physiologic signals collected over 69 h, with 286 time stamped comments. Discussion Data reuse potentially saves significant time and financial costs. However, there are few high-quality repositories for accessible physiologic data and clinical interventions from surgical cases. De-identifying records assists with overcoming problems of privacy and storing the data in a format which is easily manipulated with computing resources facilitates access by the wider research community. It is hoped that additional high-quality data will be added. Future work includes developing tools to explore and visualize the data more efficiently, and establishing quality control measures. Conclusion An approach to collecting and storing high-quality datasets from surgical operations under anesthesia such that they can be easily accessed by others for use in research has been demonstrated.", "paper_title": "Two open access, high-quality datasets from anesthetic records", "paper_id": "WOS:000313512900029"}