{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "signal_strength"}, {"score": 0.012985592663651848, "phrase": "pipeline_transmission"}, {"score": 0.0047822773061914105, "phrase": "localization_algorithm"}, {"score": 0.004760617860507055, "phrase": "wireless_sensor_networks"}, {"score": 0.0047283116134926645, "phrase": "significant_interest"}, {"score": 0.004674952036988355, "phrase": "rssi_approach"}, {"score": 0.0046221918332842995, "phrase": "cheapest_solution"}, {"score": 0.004528712642539063, "phrase": "outdoor_environments"}, {"score": 0.004417012437860011, "phrase": "big_localization_error"}, {"score": 0.004397003926838849, "phrase": "rssi"}, {"score": 0.0041637779492720295, "phrase": "novel_one-dimensional_localization_algorithm"}, {"score": 0.004126123386192962, "phrase": "signal_strength_ratio"}, {"score": 0.0040334640350288, "phrase": "one-dimensional_wireless_sensor_network_applications"}, {"score": 0.003871869188502677, "phrase": "device_costs"}, {"score": 0.0038194503801108324, "phrase": "coordinate_x"}, {"score": 0.003535489842686145, "phrase": "even_the_distance"}, {"score": 0.00334780964309978, "phrase": "received_signal_strength"}, {"score": 0.0032725712584012953, "phrase": "unchanged_distance"}, {"score": 0.003056819704624705, "phrase": "first_phase"}, {"score": 0.0030429511467945525, "phrase": "n_reference_nodes"}, {"score": 0.0027407299369891502, "phrase": "localization_phase"}, {"score": 0.002709739395004337, "phrase": "signal_strength_ratio_r"}, {"score": 0.0026913130726432645, "phrase": "mobile_nodes"}, {"score": 0.002636780522252617, "phrase": "observed_signal_strength_ratio"}, {"score": 0.0025716240685409535, "phrase": "fixed_set"}, {"score": 0.002491015208328868, "phrase": "simulation_and_experiment_results"}, {"score": 0.002474072528297228, "phrase": "localization_precision"}, {"score": 0.0024572448003065423, "phrase": "proposed_algorithm"}, {"score": 0.0024349853033241663, "phrase": "rssi_algorithm"}, {"score": 0.0023856341531435297, "phrase": "proposed_method"}, {"score": 0.002238388884010998, "phrase": "product_lines"}, {"score": 0.0022282251852637175, "phrase": "road_surveillance"}], "paper_keywords": [""], "paper_abstract": "Localization algorithm in wireless sensor networks has attracted significant interest in recent years. The RSSI approach is considered as the cheapest solution allowing coarse-grain, yet effective for many applications in outdoor environments. However, when environments change, there exists a big localization error using RSSI without a reconstructing data set. In order to solve the problem of reestablishing the data set when the environments change, a novel one-dimensional localization algorithm based on received signal strength ratio (1-DIM-RSSR) is proposed for the one-dimensional wireless sensor network applications, such as road surveillance and pipeline transmission. While synthetically considering accuracy, power consumption, localization time, and device costs, we can only use coordinate x to locate the nodes by defining y as 0. Our algorithm is based on the theory as follows: the values of Signal Strength vary from one environment to another. When environments change, even the distance between the transmitter and the receiver remains unchanged, but there is still at least 10dBm's difference. On the contrary, the ratio of the received signal strength from two base stations varies little in the condition of the unchanged distance, and thus it avoids reconstructing the dataset when environments change. 1-DIM-RSSR comprises of two phases: the data set construction phase and the localization phase. In the first phase, N reference nodes are uniformly distributed between the two base stations BS1 and BS2. We collect the signal strength RRi1 and RRi2 from BS1 and BS2 respectively and get signal strength ratio Ri = RRi1/RRi2 at each point, where i [1, N] corresponding to the N references nodes. In the localization phase, we record the signal strength ratio R' of mobile nodes and pick the one that best matches the observed signal strength ratio. Our idea is to compute the distance |Ri - R'| at a fixed set of locations, and then pick the location that minimizes the distance. Simulation and experiment results show that localization precision of the proposed algorithm compared with the RSSI algorithm is improved when the environments change. The proposed method is easy to operate, and need not reconstruct the dataset when the environments change. So this method holds the promise for many applications such as monitoring product lines, road surveillance, and pipeline transmission. Meanwhile, since our algorithm is based on 1-D localization, how to extend this conception to 2-D or even 3-D localization will be our ongoing work.", "paper_title": "One-Dimensional Localization Algorithm Based on Signal Strength Ratio", "paper_id": "WOS:000265103800072"}