{"auto_keywords": [{"score": 0.04686907559167209, "phrase": "nest-site_selection_process"}, {"score": 0.0401247080718564, "phrase": "suitable_nest_sites"}, {"score": 0.02726764469056726, "phrase": "directional_dissent"}, {"score": 0.014603854037923384, "phrase": "cavity-nesting_species"}, {"score": 0.012925996949248826, "phrase": "a._florea"}, {"score": 0.011585355706104349, "phrase": "decision-making_process"}, {"score": 0.00474141437209721, "phrase": "apis"}, {"score": 0.004692980391580608, "phrase": "reproductive_swarming"}, {"score": 0.004668957916795845, "phrase": "seasonal_migration"}, {"score": 0.004633153497593343, "phrase": "honeybee_swarm"}, {"score": 0.004423994518127831, "phrase": "european_honeybee_apis_mellifera"}, {"score": 0.004311885025518322, "phrase": "single_site"}, {"score": 0.00421340730888561, "phrase": "apis_florea"}, {"score": 0.004023120753104693, "phrase": "differing_nest-site_requirements"}, {"score": 0.00391107353999773, "phrase": "almost_any_tree"}, {"score": 0.0038910378507470518, "phrase": "a._mellifera"}, {"score": 0.00347522512377874, "phrase": "nest-site_selection"}, {"score": 0.003387076823718973, "phrase": "search-space_sampling"}, {"score": 0.003275807170434343, "phrase": "general_areas"}, {"score": 0.003250651390184808, "phrase": "potential_nest_sites"}, {"score": 0.00266693888510356, "phrase": "directional_consensus"}, {"score": 0.0025267475600118886, "phrase": "nest_sites"}, {"score": 0.0022738775158524793, "phrase": "guidance_mechanism"}, {"score": 0.002262209824105154, "phrase": "bee_swarms"}, {"score": 0.0021049977753042253, "phrase": "group_movement"}], "paper_keywords": ["Apis florea", " Nest-site selection", " Swarm guidance", " Decision making"], "paper_abstract": "During reproductive swarming and seasonal migration, a honeybee swarm needs to locate and move to a new, suitable nest site. While the nest-site selection process in cavity-nesting species such as the European honeybee Apis mellifera is very precise with the swarm carefully selecting a single site, open-nesting species, such as Apis florea, lack such precision. These differences in precision in the nest-site selection process are thought to arise from the differing nest-site requirements of open- and cavity-nesting species. While A. florea can nest on almost any tree, A. mellifera is constrained by the scarcity of suitable nest sites. Here we show that imprecision in the nest-site selection process allows swarms to quickly reach a decision when many nest sites are available. In contrast, a very precise nest-site selection process slows down the decision-making process when nest sites are abundant. Nest-site selection in A. florea appears to be more similar to search-space sampling than to a decision-making process. Bees appear to scout the environment for general areas in which potential nest sites are abundant. Bees involved in searching the environment for suitable nest sites are also involved in guiding the swarm once the decision to depart has been made. Generally A. florea swarms exhibit a lack of consensus in the direction indicated by dancers prior to take-off. Because of this lack of consensus a swarm of A. florea will need to determine its exact direction of travel while in flight. We show that in the absence of directional consensus a swarm of bees can still be guided towards an area containing suitable nest sites provided directional dissent is not too great and nest sites are abundant. However, if the swarm needs to move to a very specific location (a single point in space), directional dissent should be avoided, resulting in a more lengthy decision-making process prior to departure. We further show that the guidance mechanism of bee swarms, so-called 'streaking', functions both when directional dissent is present and when it is absent, making it a more general mechanism of group movement than previously thought.", "paper_title": "Deciding on the wing: in-flight decision making and search space sampling in the red dwarf honeybee Apis florea", "paper_id": "WOS:000289848000003"}