{"auto_keywords": [{"score": 0.04124782266808205, "phrase": "intervention_group"}, {"score": 0.018809274763291, "phrase": "control_group"}, {"score": 0.008489912000946077, "phrase": "nonspecific_links"}, {"score": 0.00828624074469835, "phrase": "topic_links"}, {"score": 0.00481495049065317, "phrase": "topic-specific_infobuttons"}, {"score": 0.004687584146342977, "phrase": "decision_support_tools"}, {"score": 0.004630804319382122, "phrase": "electronic_medical_record_systems"}, {"score": 0.004574709094672837, "phrase": "online_information_resources"}, {"score": 0.004304219099917458, "phrase": "infobutton_links"}, {"score": 0.004262443682087016, "phrase": "specific_content_topics"}, {"score": 0.00410935022329555, "phrase": "general_overview_content"}, {"score": 0.003913720715019168, "phrase": "clinicians"}, {"score": 0.003664236168480626, "phrase": "infobutton_sessions"}, {"score": 0.003541182515693916, "phrase": "infobutton_session"}, {"score": 0.0035153544006182834, "phrase": "decision_making"}, {"score": 0.0029632328136277968, "phrase": "success_rate"}, {"score": 0.0028014064098604093, "phrase": "high_positive_clinical_impact"}, {"score": 0.0026419338604879404, "phrase": "low_frequency"}, {"score": 0.0026290604866305058, "phrase": "infobutton_use"}, {"score": 0.002597150106740762, "phrase": "medication-related_information_needs"}, {"score": 0.0025344836476094896, "phrase": "session_outcomes_measurement"}, {"score": 0.0025098414374397308, "phrase": "clinicians'_setf-assessment"}, {"score": 0.002315452777999619, "phrase": "statistical_difference"}, {"score": 0.0022817585639886883, "phrase": "clinically_significant_impact"}, {"score": 0.0022540540553063902, "phrase": "overall_results"}, {"score": 0.0022430664560313127, "phrase": "previous_evidence"}, {"score": 0.002141313358342847, "phrase": "modest_incremental_change"}, {"score": 0.0021153104828032267, "phrase": "information_delivery"}, {"score": 0.0021049977753042253, "phrase": "routine_users"}], "paper_keywords": [""], "paper_abstract": "Objective: Infobuttons are decision support tools that provide links within electronic medical record systems to relevant content in online information resources. The aim of infobuttons is to help clinicians promptly meet their information needs. The objective of this Study was to determine whether infobutton links that direct to specific content topics (\"topic links\") are more effective than links that point to general overview content (\"nonspecific links\"). Design: Randomized controlled trial with a control and an intervention group. Clinicians in the control group had access to nonspecific links, while those in the intervention group had access to topic links. Measurements: Infobutton session duration, number of infobutton sessions, session success rate, and the self-reported impact that the infobutton session produced on decision making. Results: The analysis was performed On 90 Subjects and 3,729 infobutton sessions. Subjects in the intervention group spent 17.4% less time seeking for information (35.5 seconds vs. 43 seconds, p = 0.008) than those in the control group. Subjects in the intervention group used infobuttons 20.5% (22 sessions vs. 17.5 sessions, p = 0.21) more often than in the control group, but the difference was not significant. The information seeking success rate was equally high in both groups (89.4%, control vs. 87.2% intervention, p = 0.99). Subjects reported a high positive clinical impact (i.e., decision enhancement or knowledge update) in 62% of the sessions. Limitations: The exclusion Of users with a low frequency of infobutton use and the focus on medication-related information needs may limit the generalization of the results, The session outcomes measurement was based on clinicians' setf-assessment and therefore prone to bias. Conclusion: The results support the hypothesis that topic links are more efficient than nonspecific links regarding the time seeking for information. It is unclear whether the statistical difference demonstrated will result in a clinically significant impact. However, the overall results confirm previous evidence that infobuttons are effective at helping clinicians to answer questions at the point of care and demonstrate a modest incremental change in the efficiency of information delivery for routine users of this tool.", "paper_title": "Effectiveness of Topic-specific Infobuttons: A randomized Controlled Trial", "paper_id": "WOS:000260905500007"}