{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "photographic_volumes"}, {"score": 0.00967392505254847, "phrase": "original_colors"}, {"score": 0.0063347031636133404, "phrase": "color-based_transfer_function"}, {"score": 0.004654779963297256, "phrase": "proposed_method"}, {"score": 0.0042610532651691305, "phrase": "great_opportunities"}, {"score": 0.004162978902905446, "phrase": "rich_set"}, {"score": 0.003973523379376352, "phrase": "wide_variety"}, {"score": 0.003927516959113487, "phrase": "data_analysis"}, {"score": 0.0038820411362656803, "phrase": "visualization_applications"}, {"score": 0.003705323407433896, "phrase": "interactive_and_user-friendly_transfer_function"}, {"score": 0.0035989687070420977, "phrase": "photographic_volume_visualization"}, {"score": 0.002435453488008121, "phrase": "maximum_extent"}, {"score": 0.0022974765563692776, "phrase": "representative_colors"}], "paper_keywords": ["Photographic volume", " Transfer function", " Color mapping"], "paper_abstract": "Photographic volumes have been increasingly used in medical and biological researches in recent years. The original colors kept in photographic volumes present great opportunities to capture a rich set of information within the dataset for a wide variety of data analysis and visualization applications. Despite years of research, an interactive and user-friendly transfer function is still lacking for photographic volume visualization. The difficulty lies in how to map colors to a space that is convenient and intuitive for users to interactively classify features, i.e., specifying opacities for voxels. In this paper, we propose a color-based transfer function for intuitive opacity specification of photographic volumes. The color-based transfer function intelligently maps the colors from 3D to 1D, resulting in 256 representative colors which preserve the original colors to the maximum extent. Users can directly classify voxels based on these representative colors similar to the conventional 1D transfer function. Experiments are performed to evaluate the effectiveness of the proposed method, and also demonstrate the intuitiveness and flexibility of the proposed method.", "paper_title": "Intuitive transfer function design for photographic volumes", "paper_id": "WOS:000362972900002"}