{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clan_control"}, {"score": 0.006062707493212437, "phrase": "complex_it_projects"}, {"score": 0.004810666501127881, "phrase": "social_capital"}, {"score": 0.004663074596384574, "phrase": "information_technology_project_control_literature"}, {"score": 0.004515967518891287, "phrase": "complex_multistakeholder_projects"}, {"score": 0.004483909657713567, "phrase": "project_success"}, {"score": 0.004220406575749275, "phrase": "diverse_skills"}, {"score": 0.004116440453049531, "phrase": "insufficient_time"}, {"score": 0.0036207206487324506, "phrase": "strong_social_capital"}, {"score": 0.003432160899769594, "phrase": "common_values"}, {"score": 0.0033119237381809617, "phrase": "peer_norms"}, {"score": 0.0031731685183735508, "phrase": "dual_process"}, {"score": 0.0028107098861552124, "phrase": "project-facilitating_shared_values"}, {"score": 0.002664221051021009, "phrase": "project_goals"}, {"score": 0.002570817338292482, "phrase": "large_it_project"}, {"score": 0.0025434384320561403, "phrase": "major_logistics_organization"}, {"score": 0.002454258761940649, "phrase": "impending_project_failure"}, {"score": 0.0022851491693940272, "phrase": "single_framework"}, {"score": 0.0021049977753042253, "phrase": "formal_control"}], "paper_keywords": ["Behavioral control theory", " clan control", " formal control", " project management", " project control", " IT projects", " social capital", " enterprise systems"], "paper_abstract": "The information technology project control literature has documented that clan control is often essential in complex multistakeholder projects for project success. However, instituting clan control in such conditions is challenging as people come to a project with diverse skills and backgrounds. There is often insufficient time for clan control to develop naturally This paper investigates the question, \"How can clan control be enacted in complex IT projects?\" Recognizing social capital as a resource, we conceptualize a clan as a group with strong social capital (i.e., where its members have developed their structural, cognitive, and relational ties to the point that they share common values and beliefs and are committed to a set of peer norms). We theorize that the enactment of clan control is a dual process of (1) building the clan by developing its social capital dimensions (structural, cognitive, and relational ties) or reappropriating social capital from elsewhere and (2) leveraging the clan by reinforcing project-facilitating shared values, beliefs, and norms, and inhibiting those that impede the achievement of project goals. We explore how clan control was enacted in a large IT project at a major logistics organization in which clan control was quickly instituted to avoid an impending project failure. Our research contributes to theory in three ways: (1) we reconcile the two differing views of clan control into a single framework, (2) we explain the role of controllers in enacting clan control, and (3) we clarify, how formal control can be employed to develop clan control.", "paper_title": "ENACTING CLAN CONTROL IN COMPLEX IT PROJECTS: A SOCIAL CAPITAL PERSPECTIVE", "paper_id": "WOS:000304296400012"}