{"auto_keywords": [{"score": 0.03740559949860214, "phrase": "semantic_clustering"}, {"score": 0.01445807546828607, "phrase": "digital_library"}, {"score": 0.011859280932277975, "phrase": "generated_thesaurus"}, {"score": 0.00481495049065317, "phrase": "core_journal_collection"}, {"score": 0.004778088905211055, "phrase": "digital_libraries"}, {"score": 0.004192730391924712, "phrase": "local_authors"}, {"score": 0.004034572092608487, "phrase": "digital_library_offer"}, {"score": 0.0039274105882136775, "phrase": "duplicate_references"}, {"score": 0.003808407814695708, "phrase": "syntactically_different_data"}, {"score": 0.003735862292632131, "phrase": "automated_discovery"}, {"score": 0.0036788184374592706, "phrase": "correctly_matched_data"}, {"score": 0.003290403747743492, "phrase": "jaro-winkler_algorithm"}, {"score": 0.003202944392720769, "phrase": "de-duplication_process"}, {"score": 0.0031298260299218684, "phrase": "domain-specific_knowledge"}, {"score": 0.0027777389949155975, "phrase": "large_amounts"}, {"score": 0.0025521085778978042, "phrase": "candidate_matches"}, {"score": 0.0021049977753042253, "phrase": "library_users"}], "paper_keywords": ["Digital libraries", " Data collection", " Semantics", " Databases", " Serbia"], "paper_abstract": "Purpose - This paper aims to address the problem of enhancing the selection of titles offered by a digital library, by analysing the differences in these titles when they are cited by local authors in their publications and when they are listed in the digital library offer. Design/methodology/approach - Text mining techniques were used to identify duplicate references. Moreover, the process of identifying syntactically different data was improved with the automated discovery of thesauri from correctly matched data, and the generated thesaurus was further used in semantic clustering. The results were effectively visually represented. Findings - The paper finds that the function based on the Jaro-Winkler algorithm may be efficiently used in the de-duplication process. A generated thesaurus that utilises domain-specific knowledge can also be used in the semantic clustering of references. It was shown that semantic clustering may be most useful in partitioning data, which is particularly significant when dealing with large amounts of data, which is usually the case. Moreover, those references that have the same or similar scores may be considered as candidate matches in the further de-duplication process. Finally, it proved to be a more efficient way of visually representing the results. Originality/value - This function can be implemented to enhance the selection of titles to be offered by a digital library, in terms of making that offer more compliant with what the library users frequently cite.", "paper_title": "Enhancing a core journal collection for digital libraries", "paper_id": "WOS:000278730000005"}