{"auto_keywords": [{"score": 0.037307389992339395, "phrase": "design_independence"}, {"score": 0.00481495049065317, "phrase": "real-world_databases"}, {"score": 0.004757087682427765, "phrase": "extremely_complex_schemas"}, {"score": 0.0046621835537196754, "phrase": "entity_types"}, {"score": 0.0045324756541157574, "phrase": "hundred_or_so_attributes"}, {"score": 0.004406360418456518, "phrase": "new_users"}, {"score": 0.004249332848326785, "phrase": "schema_free_query_interfaces"}, {"score": 0.003765067028482197, "phrase": "alternative_designs"}, {"score": 0.0033764382987428497, "phrase": "theoretical_framework"}, {"score": 0.0032428780373184207, "phrase": "sfqi."}, {"score": 0.003003452468800793, "phrase": "statistical_properties"}, {"score": 0.0027150658583211746, "phrase": "novel_xml"}, {"score": 0.0025658094607383646, "phrase": "information-theoretic_relationships"}, {"score": 0.002534906456854208, "phrase": "data_items"}, {"score": 0.002347628167175859, "phrase": "average_case_design_independence"}, {"score": 0.0022006705963260433, "phrase": "ranking_quality"}, {"score": 0.0021049977753042253, "phrase": "current_sfqi_methods"}], "paper_keywords": ["Query interface", " design independence"], "paper_abstract": "Real-world databases often have extremely complex schemas. With thousands of entity types and relationships, each with a hundred or so attributes, it is extremely difficult for new users to explore the data and formulate queries. Schema free query interfaces (SFQIs) address this problem by allowing users with no knowledge of the schema to submit queries. We postulate that SFQIs should deliver the same answers when given alternative designs for the same underlying data set. In this paper, we introduce and formally define design independence, which captures this property for SFQIs. We establish a theoretical framework to measure the amount of design independence provided by an SFQI. We show that most current SFQIs provide a very limited degree of design independence. We also show that SFQIs based on the statistical properties of data can provide design independence when the changes in the schema do not introduce or remove redundancy in the data. We propose a novel XML SFQI called Duplication Aware Coherency Ranking (DA-CR) based on information-theoretic relationships among the data items in the database, and prove that DA-CR is design independent. Our extensive empirical study using three real-world data sets shows that the average case design independence of current SFQIs is considerably lower than that of DA-CR. We also show that the ranking quality of DA-CR is better than or equal to that of current SFQI methods.", "paper_title": "Design Independent Query Interfaces", "paper_id": "WOS:000307545200008"}