{"auto_keywords": [{"score": 0.04047129446895856, "phrase": "relay"}, {"score": 0.01097340311389028, "phrase": "gpa"}, {"score": 0.00481495049065317, "phrase": "nat_traversal_server_discovery"}, {"score": 0.004774530554776604, "phrase": "topological_information"}, {"score": 0.004721162131188487, "phrase": "current_internet_picture"}, {"score": 0.0046161999598320486, "phrase": "network_address_translators"}, {"score": 0.004339379163693652, "phrase": "nowadays_the_largest_portion"}, {"score": 0.004022137057452406, "phrase": "direct_communications"}, {"score": 0.003988345858759183, "phrase": "easiest_way"}, {"score": 0.003888659470009222, "phrase": "third_entity"}, {"score": 0.0037701851296383405, "phrase": "nated_hosts"}, {"score": 0.0034944094552943, "phrase": "suitable_relay"}, {"score": 0.0033688919177039863, "phrase": "gradual_proximity_algorithm"}, {"score": 0.0031577303835881964, "phrase": "measurement-based_analysis"}, {"score": 0.003070086433952691, "phrase": "relayed_communication"}, {"score": 0.003044269254752414, "phrase": "transit_traffic"}, {"score": 0.0029764767329116875, "phrase": "qos-aware_and_isp-friendly_solution"}, {"score": 0.002910189469006115, "phrase": "peer-to-peer_nat_traversal_architecture"}, {"score": 0.0027898428590137515, "phrase": "gpa."}, {"score": 0.0027123819773059127, "phrase": "large-scale_simulations"}, {"score": 0.002689564715486338, "phrase": "real_measurements"}, {"score": 0.002556625752785268, "phrase": "reasonably_large_deployments"}, {"score": 0.0024856240785174444, "phrase": "communications_experience"}, {"score": 0.0023428586429492713, "phrase": "extra_transit_traffic"}, {"score": 0.002233301265743633, "phrase": "qos_degradation"}, {"score": 0.0021651504858015364, "phrase": "extra_traffic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["p2p", " Relay", " NAT", " AS", " Simulation", " Measurements"], "paper_abstract": "In the current Internet picture more than 70% of the hosts are located behind Network Address Translators (NATs). This is not a problem for the client/server paradigm. However, the Internet has evolved, and nowadays the largest portion of the traffic is due to peer-to-peer (p2p) applications. This scenario presents an important challenge: two hosts behind NATs (NATed hosts) cannot establish direct communications. The easiest way to solve this problem is by using a third entity, called Relay, that forwards the traffic between the NATed hosts. Although many efforts have been devoted to avoid the use of Relays, they are still needed in many situations. Hence, the selection of a suitable Relay becomes critical to many p2p applications. In this paper, we propose the Gradual Proximity Algorithm (GPA): a simple algorithm that guarantees the selection of a topologically close-by Relay. We present a measurement-based analysis, showing that the GPA minimizes both the delay of the relayed communication and the transit traffic generated by the Relay, being a QoS-aware and ISP-friendly solution. Furthermore, the paper presents the Peer-to-Peer NAT Traversal Architecture (P2P-NTA), which is a global, distributed and collaborative solution, based on the GPA. This architecture addresses the Relay discovery/selection problem. We have performed large-scale simulations based on real measurements, which validate our proposal. The results demonstrate that the P2P-NTA performs similarly to direct communications with reasonably large deployments of p2p applications. In fact, only 5% of the communications experience an extra delay that may degrade the QoS due to the use of Relays. Furthermore, the amount of extra transit traffic generated is only 6%. We also show that the P2P-NTA largely outperforms other proposals, where the QoS degradation affects up to more than 50% of the communications, and the extra traffic generated goes beyond 80%. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A collaborative P2P scheme for NAT Traversal Server discovery based on topological information", "paper_id": "WOS:000280984700011"}