{"auto_keywords": [{"score": 0.043726272486193665, "phrase": "resource-forest_constraint"}, {"score": 0.033561953303600005, "phrase": "hybrid-consistency_algorithm"}, {"score": 0.004658426838467567, "phrase": "undirected_n-vertex"}, {"score": 0.004299064805926241, "phrase": "vertex-disjoint_trees"}, {"score": 0.004043003243656031, "phrase": "subset_r_subset"}, {"score": 0.0039114753002009485, "phrase": "resource_vertices"}, {"score": 0.0035925056609681194, "phrase": "natural_undirected_counterpart"}, {"score": 0.003541923233726252, "phrase": "tree_constraint"}, {"score": 0.003410479630045025, "phrase": "directed_graph"}, {"score": 0.0033308077968426937, "phrase": "directed_trees"}, {"score": 0.0032529910932231924, "phrase": "tree_roots"}, {"score": 0.002822712709335093, "phrase": "directed_case"}, {"score": 0.002782938683493689, "phrase": "second_constraint"}, {"score": 0.00218623706110975, "phrase": "worst_case"}], "paper_keywords": [""], "paper_abstract": "We present two constraints that partition the vertices of an undirected n-vertex, m-edge graph G = (V, E) into a set of vertex-disjoint trees. The first is the resource-forest constraint, where we assume that a subset R subset of V of the vertices are resource vertices. The constraint specifies that each tree in the forest must contain at least one resource vertex. This is the natural undirected counterpart of the tree constraint [1], which partitions a directed graph into a forest of directed trees where only certain vertices can be tree roots. We describe a hybrid-consistency algorithm that runs in O(m + n) time for the resource-forest constraint, a sharp improvement over the O(mn) bound that is known for the directed case. The second constraint is proper-forest. In this variant, we do not have the requirement that each tree contains a resource, but the forest must contain only proper trees, i.e., trees that have at least two vertices each. We develop a hybrid-consistency algorithm for this case whose running time is O(mn) in the worst case, and O(m root n) in many (typical) cases.", "paper_title": "Undirected forest constraints", "paper_id": "WOS:000238117300005"}