{"auto_keywords": [{"score": 0.04304761742706974, "phrase": "basic_model"}, {"score": 0.034242789804987725, "phrase": "standard_deviation"}, {"score": 0.00481495049065317, "phrase": "transaction_ratings"}, {"score": 0.004734175871914184, "phrase": "probabilistic_model"}, {"score": 0.004681076799813777, "phrase": "reputation_scores"}, {"score": 0.003974550062454033, "phrase": "normal_law"}, {"score": 0.00368292623004839, "phrase": "linear_function"}, {"score": 0.0034416557738293947, "phrase": "item_quality"}, {"score": 0.0033269940500921832, "phrase": "equal_quality_level"}, {"score": 0.0032070701272953563, "phrase": "item_quality_generation"}, {"score": 0.0031089681395614654, "phrase": "similar_ratings"}, {"score": 0.00300535676490851, "phrase": "ratings_generation"}, {"score": 0.002905188343381489, "phrase": "model_accounting"}, {"score": 0.002840265821464678, "phrase": "bayesian_model"}, {"score": 0.002816294613779422, "phrase": "prior_distribution"}, {"score": 0.0027767900889698713, "phrase": "expectation-maximization_algorithms"}, {"score": 0.002572822239596127, "phrase": "useful_information"}, {"score": 0.002515308398127586, "phrase": "adverse_behaviors"}, {"score": 0.0024383151463193793, "phrase": "standard_methods"}, {"score": 0.0024040998053958375, "phrase": "suggested_models"}, {"score": 0.0023770727209879885, "phrase": "considerable_improvements"}, {"score": 0.002337099394527396, "phrase": "brockhoff"}, {"score": 0.002323924542900662, "phrase": "skovgaard's_model"}, {"score": 0.0022337522598780985, "phrase": "interesting_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Reputation", " Trust", " Rating prediction", " Ratings aggregation"], "paper_abstract": "This work introduces a probabilistic model allowing to compute reputation scores as close as possible to their intrinsic value, according to the model. It is based on the following, natural, consumer-provider interaction model. Consumers are assumed to order items from providers, who each has some intrinsic, latent, \"quality of service\" score. In the basic model, the providers supply the items with a quality following a normal law, centered on their intrinsic \"quality of service\". The consumers, after the reception and the inspection of the item, rate it according to a linear function of its quality - a standard regression model. This regression model accounts for the bias of the consumer in providing ratings as well as his reactivity towards changes in item quality. Moreover, the constancy of the provider in supplying an equal quality level when delivering the items is estimated by the standard deviation of his normal law of item quality generation. Symmetrically, the consistency of the consumer in providing similar ratings for a given quality is quantified by the standard deviation of his normal law of ratings generation. Two extensions of this basic model are considered as well: a model accounting for truncation of the ratings and a Bayesian model assuming a prior distribution on the parameters. Expectation-maximization algorithms, allowing to estimate the parameters based on the ratings, are developed for all the models. The experiments suggest that these models are able to extract useful information from the ratings, are robust towards adverse behaviors such as cheating, and are competitive in comparison with standard methods. Even if the suggested models do not show considerable improvements over other competing models (such as Brockhoff and Skovgaard's model [12]), they, however, also permit to estimate interesting features over the raters such as their reactivity, bias, consistency, reliability, or expectation. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "A probabilistic reputation model based on transaction ratings", "paper_id": "WOS:000276819200003"}