{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "memory_mechanism"}, {"score": 0.015432071866640192, "phrase": "membrane_algorithms"}, {"score": 0.01453255175694354, "phrase": "living_cells"}, {"score": 0.009665830732706696, "phrase": "knapsack_problem"}, {"score": 0.007877737950335157, "phrase": "memory_cells"}, {"score": 0.004770211811866158, "phrase": "knapsack_problems"}, {"score": 0.004616859702338596, "phrase": "distributed_and_parallel_algorithms"}, {"score": 0.003920674807745575, "phrase": "biological_neuron_cells"}, {"score": 0.003741712498615481, "phrase": "memory_modules"}, {"score": 0.003689628075766217, "phrase": "membrane_algorithm"}, {"score": 0.0032522091171602557, "phrase": "ring_neighborhood_topology"}, {"score": 0.0027741761880779535, "phrase": "optimum_solution"}, {"score": 0.0027483472371835865, "phrase": "feasible_solutions"}, {"score": 0.002514625755809045, "phrase": "communication_rules"}, {"score": 0.0024912073108138613, "phrase": "simulation_results"}, {"score": 0.002185301851004467, "phrase": "premature_convergence"}, {"score": 0.0021049977753042253, "phrase": "global_solution"}], "paper_keywords": ["Membrane algorithm", " Memory mechanism", " Knapsack problem"], "paper_abstract": "Membrane algorithms are a class of distributed and parallel algorithms inspired by the structure and behavior of living cells. Many attractive features of living cells have already been abstracted as operators to improve the performance of algorithms. In this work, inspired by the function of biological neuron cells storing information, we consider a memory mechanism by introducing memory modules into a membrane algorithm. The framework of the algorithm consists of two kinds of modules (computation modules and memory modules), both of which are arranged in a ring neighborhood topology. They can store and process information, and exchange information with each other. We test our method on a knapsack problem to demonstrate its feasibility and effectiveness. During the process of approaching the optimum solution, feasible solutions are evolved by rewriting rules in each module, and the information transfers according to directions defined by communication rules. Simulation results showed that the performance of membrane algorithms with memory cells is superior to that of algorithms without memory cells for solving a knapsack problem. Furthermore, the memory mechanism can prevent premature convergence and increase the possibility of finding a global solution.", "paper_title": "A membrane-inspired algorithm with a memory mechanism for knapsack problems", "paper_id": "WOS:000323204200003"}