{"auto_keywords": [{"score": 0.04139837540407399, "phrase": "indirect_sales"}, {"score": 0.021566653428939608, "phrase": "specific_keywords"}, {"score": 0.021340329086927755, "phrase": "general_keywords"}, {"score": 0.010832346961911805, "phrase": "different_types"}, {"score": 0.00862113638140787, "phrase": "search_engine_advertising"}, {"score": 0.007226375916041422, "phrase": "advertised_products"}, {"score": 0.00481495049065317, "phrase": "keyword_selection"}, {"score": 0.0045879792359519375, "phrase": "product_sales"}, {"score": 0.004539005582217309, "phrase": "sponsored_keyword_advertising"}, {"score": 0.004490552331642995, "phrase": "search_engines"}, {"score": 0.004395185177346749, "phrase": "effective_selection"}, {"score": 0.0043897756571890925, "phrase": "higher_marginal_contribution"}, {"score": 0.003378385493203297, "phrase": "cross-selling_effects"}, {"score": 0.002953711377604328, "phrase": "direct_sales"}, {"score": 0.002568435291444709, "phrase": "product_type"}, {"score": 0.0025273383208209922, "phrase": "main_products"}, {"score": 0.002306543826130521, "phrase": "accessory_products"}, {"score": 0.0021049977753042253, "phrase": "key_implication"}], "paper_keywords": ["cross-selling", " keyword advertising", " keywords selection", " online advertising", " search engines", " sponsored search"], "paper_abstract": "Product sales via sponsored keyword advertising on search engines rely on an effective selection of keywords that describe the offerings. In this study, we consider both the direct sales of the advertised products and indirect sales (i.e., cross-selling) of other products, and examine how specific keywords and general keywords influence these two types of sales differently. We also examine how the cross-selling effects may vary across different types of products (main products and accessories). Our results suggest that the use of specific keywords leans toward improving the direct sales of advertised products, while the use of general keywords leans toward improving the indirect sales of other products. The contribution of keywords to indirect sales is influenced by product type. For main products, the use of specific keywords generates a higher marginal contribution to indirect sales than that of general keywords. For accessory products, the use of general keywords generates a higher marginal contribution to indirect sales than that of specific keywords. The key implication of this study is that sellers focusing on different types of sales (direct or indirect sales) or products (main or accessory products) should consider using different types of keywords in search engine advertising to drive sales.", "paper_title": "Differential Effects of Keyword Selection in Search Engine Advertising on Direct and Indirect Sales", "paper_id": "WOS:000336145300012"}