{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lanfos-h_food_radiation_contamination_detector"}, {"score": 0.004671012181488876, "phrase": "fukushima_power_plant"}, {"score": 0.004623990904432388, "phrase": "growing_concern"}, {"score": 0.004577440795549049, "phrase": "radiation_contamination"}, {"score": 0.004485735417293941, "phrase": "japanese_limits"}, {"score": 0.004440570928903645, "phrase": "permitted_amount"}, {"score": 0.004178935413340453, "phrase": "lanfos"}, {"score": 0.004150829420202823, "phrase": "large_food_non"}, {"score": 0.0038278890186559276, "phrase": "lanfos-h"}, {"score": 0.0035779805381654438, "phrase": "food_samples"}, {"score": 0.0032332756920184177, "phrase": "small_institutions"}, {"score": 0.003032295420569351, "phrase": "radiation_spectrum"}, {"score": 0.0030118779844670353, "phrase": "proper_assessment"}, {"score": 0.002892219926795975, "phrase": "gamma_conversion_factor"}, {"score": 0.002721562843196732, "phrase": "monte_carlo_estimation"}, {"score": 0.0025180372061991206, "phrase": "conversion_factor"}, {"score": 0.002450864311898833, "phrase": "food_types"}, {"score": 0.0023694065215394593, "phrase": "sample_length"}, {"score": 0.002321834168782981, "phrase": "individual_detectors"}, {"score": 0.0022984065518052476, "phrase": "different_inclinations"}, {"score": 0.0021921581733031514, "phrase": "small_uncertainty"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["LANFOS", " Fukushima", " Cs-137", " Food radiation contamination", " Scintillator"], "paper_abstract": "Recent incident in the Fukushima power plant caused a growing concern about the radiation contamination and resulted in lowering the Japanese limits for the permitted amount of Cs-137 in food to 100 Bq/kg. To increase safety and ease the concern we are developing LANFOS (Large Food Non-destructive Area Sampler) a compact, easy to use detector for assessment of radiation in food. Described in this paper LANFOS-H has a 4 pi coverage to assess the amount of Cs-137 present, separating it from the possible K-40 food contamination. Therefore, food samples do not have to be pre-processed prior to a test and can be consumed after measurements. It is designed for use by non-professionals in homes and small institutions such as schools, showing safety of the samples, but can be also utilized by specialists providing radiation spectrum. Proper assessment of radiation in food in the apparatus requires estimation of the gamma conversion factor of the detectors how many gamma photons will produce a signal. In this paper we show results of the Monte Carlo estimation of this factor for various approximated shapes of fish, vegetables and amounts of rice, performed with Geant4 package. We find that the conversion factor combined from all the detectors is similar for all food types and is around 37%, varying maximally by 5% with sample length, much less than for individual detectors. The different inclinations and positions of samples in the detector introduce uncertainty of 1.4%. This small uncertainty validates the concept of a 4 pi non-destructive apparatus. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "The simulation of the LANFOS-H food radiation contamination detector using Geant4 package", "paper_id": "WOS:000346954200006"}