{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_science"}, {"score": 0.007134090124231332, "phrase": "distinct_meanings"}, {"score": 0.005722406337640255, "phrase": "case_study"}, {"score": 0.005675831831070872, "phrase": "cognitive_science"}, {"score": 0.0041555469216463855, "phrase": "inter-_and_multi-disciplinary_efforts"}, {"score": 0.003988901168289797, "phrase": "information_science_research"}, {"score": 0.003908091457759849, "phrase": "semantic_inconsistency"}, {"score": 0.0037667216301666196, "phrase": "philosophic_analysis"}, {"score": 0.0034847851398628546, "phrase": "philosophic_meanings"}, {"score": 0.00342816445816304, "phrase": "findings_-_interdisciplinarity"}, {"score": 0.003250403288147613, "phrase": "interdisciplinary_research"}, {"score": 0.003223883109446599, "phrase": "longer-terns_benefits"}, {"score": 0.003145609726536791, "phrase": "multidisciplinary_research_call"}, {"score": 0.003107186371289819, "phrase": "valid_collaborative_roles"}, {"score": 0.0030193416820392554, "phrase": "brief_technical_discussion"}, {"score": 0.002994701080666466, "phrase": "cognitive_science_theory"}, {"score": 0.002637433799290365, "phrase": "implicit_oil_professional_practice"}, {"score": 0.0024398167078355224, "phrase": "ill_more_interdisciplinary_research"}, {"score": 0.0023418133729330303, "phrase": "common_term"}, {"score": 0.0021223334214910006, "phrase": "clear_distinction"}], "paper_keywords": ["information science", " integration"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the nature of collaboration within information science, to argue for distinct meanings fen interdisciplinary and multidisciplinary research and to answer two questions: What philosophic distinction can be made between inter- and multi-disciplinary efforts? Is one more valuable than the other to information science research? Design/methodology/approach - The semantic inconsistency for describing collaboration is identified in information science. Philosophic analysis of the terms interdisciplinary and multidisciplinary is conducted arguing for distinct meanings. A case study through cognitive science exploring the philosophic meanings is developed. Findings - Interdisciplinarity and multidisciplinarity are very distinct in terms of methods and frameworks. interdisciplinary research has longer-terns benefits for information science. but multidisciplinary research call also fulfil valid collaborative roles in information science. Research limitations/implications - A brief technical discussion of cognitive science theory lends itself to those interested it, cognitive: science. The paper is philosophic in nature. Practical implications - The inconsistencies surrounding the terms interdisciplinary and mutidisciplinary have implicit oil professional practice. The argument for more consistent terminology will introduce more semantic integrity and reduce miscommunication. There is a challenge to engage ill more interdisciplinary research and practice within information science. Originality/value Collaboration is a common term used, but lit-tie research into what it precisely means within information science has been conducted. The paper argues for a clear distinction between various types of collaboration, and provides a case study with cognitive science.", "paper_title": "Information science: an interdisciplinary effort?", "paper_id": "WOS:000258733400002"}