{"auto_keywords": [{"score": 0.03247739629898321, "phrase": "strong_property"}, {"score": 0.018551937876854035, "phrase": "local_diagnosability"}, {"score": 0.014148600469553707, "phrase": "faulty_hypercube"}, {"score": 0.009801213569375388, "phrase": "pmc_model"}, {"score": 0.00481495049065317, "phrase": "multiprocessor_systems"}, {"score": 0.004724158990345732, "phrase": "fault_diagnosis"}, {"score": 0.004361077072629878, "phrase": "new_measure"}, {"score": 0.00356359155432419, "phrase": "system_diagnosis"}, {"score": 0.003314591878914152, "phrase": "strong_local_diagnosability_property"}, {"score": 0.0021049977753042253, "phrase": "faulty_edges"}], "paper_keywords": ["PMC model", " local diagnosability", " strong local diagnosability property"], "paper_abstract": "The problem of fault diagnosis has been discussed widely and the diagnosability of many well-known networks has been explored. Under the PMC model, we introduce a new measure of diagnosability, called local diagnosability, and derive some structures for determining whether a vertex of a system is locally t-diagnosable. For a hypercube, we prove that the local diagnosability of each vertex is equal to its degree under the PMC model. Then, we propose a concept for system diagnosis, called the strong local diagnosability property. A system G(V; E) is said to have a strong local diagnosability property if the local diagnosability of each vertex is equal to its degree. We show that an n-dimensional hypercube Q(n) has this strong property, n >= 3. Next, we study the local diagnosability of a faulty hypercube. We prove that Q(n) keeps this strong property even if it has up to n - 2 faulty edges. Assuming that each vertex of a faulty hypercube Q(n) is incident with at least two fault-free edges, we prove Q(n) keeps this strong property even if it has up to 3(n - 2) - 1 faulty edges. Furthermore, we prove that Q(n) keeps this strong property no matter how many edges are faulty, provided that each vertex of a faulty hypercube Q(n) is incident with at least three fault-free edges. Our bounds on the number of faulty edges are all tight.", "paper_title": "A local diagnosability measure for multiprocessor systems", "paper_id": "WOS:000245136400003"}