{"auto_keywords": [{"score": 0.029091183887516837, "phrase": "proposed_approach"}, {"score": 0.015719716506582538, "phrase": "customer_satisfaction"}, {"score": 0.01512581445950995, "phrase": "new_products"}, {"score": 0.004773476989344654, "phrase": "new_product_development"}, {"score": 0.00471193241675062, "phrase": "pso-based_anfis_approach"}, {"score": 0.004492950096237056, "phrase": "customer_perception"}, {"score": 0.004454237726525018, "phrase": "consumer_products"}, {"score": 0.004192392802008709, "phrase": "associated_customer_satisfaction_level"}, {"score": 0.004049709080817396, "phrase": "new_product"}, {"score": 0.0033471722682967046, "phrase": "modeling_accuracy"}, {"score": 0.003261324328105861, "phrase": "pso"}, {"score": 0.0030960762496815737, "phrase": "better_customer_satisfaction_models"}, {"score": 0.0029519664912853938, "phrase": "notebook_computer_design"}, {"score": 0.0025696647013416863, "phrase": "fuzzy_regression"}, {"score": 0.0023257824499250653, "phrase": "customer_satisfaction_models"}, {"score": 0.0021982976170703884, "phrase": "mean_absolute_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Customer satisfaction models", " New product development", " Particle swarm optimization", " ANFIS"], "paper_abstract": "When developing new products, it is important to understand customer perception towards consumer products. It is because the success of new products is heavily dependent on the associated customer satisfaction level. If customers are satisfied with a new product, the chance of the product being successful in marketplaces would be higher. Various approaches have been attempted to model the relationship between customer satisfaction and design attributes of products. In this paper, a particle swarm optimization (PSO) based ANFIS approach to modeling customer satisfaction is proposed for improving the modeling accuracy. In the approach, PSO is employed to determine the parameters of an ANFIS from which better customer satisfaction models in terms of modeling accuracy can be generated. A notebook computer design is used as an example to illustrate the approach. To evaluate the effectiveness of the proposed approach, modeling results based on the proposed approach are compared with those based on the fuzzy regression (FR), ANFIS and genetic algorithm (GA)-based ANFIS approaches. The comparisons indicate that the proposed approach can effectively generate customer satisfaction models and that their modeling results outperform those based on the other three methods in terms of mean absolute errors and variance of errors. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Modeling customer satisfaction for new product development using a PSO-based ANFIS approach", "paper_id": "WOS:000298631400013"}