{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.041791008124514514, "phrase": "process_state"}, {"score": 0.041382532531526364, "phrase": "rigid_delay_constraints"}, {"score": 0.0382496147087373, "phrase": "delay_constraints"}, {"score": 0.004392565073466714, "phrase": "physical_processes"}, {"score": 0.004238452771031322, "phrase": "future_control_systems"}, {"score": 0.004152818376630929, "phrase": "real-time_control_applications"}, {"score": 0.003711723285313348, "phrase": "network_estimation_approach"}, {"score": 0.0036740168936985314, "phrase": "state_estimation"}, {"score": 0.0035997452281985465, "phrase": "multihop_wsns"}, {"score": 0.0032172054825137866, "phrase": "network_estimation_operations"}, {"score": 0.002949598537993663, "phrase": "different_sensors"}, {"score": 0.002875200380397413, "phrase": "upper_stream_sensors'_estimates"}, {"score": 0.0023435920614377306, "phrase": "in-network_estimation"}, {"score": 0.002126635713519053, "phrase": "significant_estimation_accuracy_gain"}, {"score": 0.0021049977753042253, "phrase": "different_network_settings"}], "paper_keywords": ["Wireless sensor networks", " estimation", " aggregation scheduling", " delay constraint", " cyber-physical systems", " networked control systems"], "paper_abstract": "The use of wireless sensor networks (WSNs) for closing the loops between the cyberspace and the physical processes is more attractive and promising for future control systems. For some real-time control applications, controllers need to accurately estimate the process state within rigid delay constraints. In this paper, we propose a novel in-network estimation approach for state estimation with delay constraints in multihop WSNs. For accurately estimating a process state as well as satisfying rigid delay constraints, we address the problem through jointly designing in-network estimation operations and an aggregation scheduling algorithm. Our in-network estimation operation performed at relays not only optimally fuses the estimates obtained from the different sensors but also predicts the upper stream sensors' estimates which cannot be aggregated to the sink before deadlines. Our estimate aggregation scheduling algorithm, which is interference free, is able to aggregate as much estimate information as possible from the network to the sink within delay constraints. We proved the unbiasedness of in-network estimation, and theoretically analyzed the optimality of our approach. Our simulation results corroborate our theoretical results and show that our in-network estimation approach can obtain significant estimation accuracy gain under different network settings.", "paper_title": "In-Network Estimation with Delay Constraints in Wireless Sensor Networks", "paper_id": "WOS:000312839100013"}