{"auto_keywords": [{"score": 0.04731051870228709, "phrase": "energy_consumption"}, {"score": 0.00481495049065317, "phrase": "cryptographic_techniques"}, {"score": 0.004331675965350876, "phrase": "original_critical_energy_constraint_problem"}, {"score": 0.0037203741725514126, "phrase": "traditional_chaos-based_schemes"}, {"score": 0.003459191419478298, "phrase": "hybrid_security_solution"}, {"score": 0.0033911868693238894, "phrase": "hybrid_security"}, {"score": 0.0032591491777773035, "phrase": "chaos-based_message_authentication_codes"}, {"score": 0.003030247482854539, "phrase": "data_gathering"}, {"score": 0.0028930017387859804, "phrase": "hybrid_security_and_compressive_sensing-based_scheme"}, {"score": 0.002689746491842271, "phrase": "light_security_mechanism"}, {"score": 0.0021049977753042253, "phrase": "compression_efficiency"}], "paper_keywords": ["WSNs", " multimedia data gathering", " chaotic block encryption", " compressive sensing"], "paper_abstract": "The use of cryptographic techniques such as encryption and hashing largely increases the energy consumption of sensors, which aggravates the original critical energy constraint problem of wireless sensor networks (WSNs). To reduce the burden of sensors, compression can be utilized. Since the traditional chaos-based schemes are not directly applicable for WSNs, we present a hybrid security solution. The hybrid security consists of 8-bit integer chaotic block encryption and a chaos-based message authentication codes. It aims to promote the security and performance of data gathering. In this paper, a hybrid security and compressive sensing-based scheme for multimedia sensor data gathering is presented. It has light security mechanism and thus decreases the complexity and energy consumption of system. Performance analysis about security and compression is carried out. The results show that our scheme is more applicable for WSNs multimedia data gathering from security and compression efficiency.", "paper_title": "A Hybrid Security and Compressive Sensing-Based Sensor Data Gathering Scheme", "paper_id": "WOS:000371388200052"}