{"auto_keywords": [{"score": 0.0342380759090535, "phrase": "immediate_or_delayed_activation"}, {"score": 0.030022562215447003, "phrase": "dynamic_anti-windup_compensator"}, {"score": 0.013822772869259183, "phrase": "actuator_saturation"}, {"score": 0.004815376153310976, "phrase": "dynamic"}, {"score": 0.004667149874736771, "phrase": "anticipatory_activation"}, {"score": 0.004453874101119545, "phrase": "traditional_anti-windup_compensators"}, {"score": 0.004141238989360548, "phrase": "anti-windup_compensators"}, {"score": 0.0036743708250589484, "phrase": "static_anti-windup_compensators"}, {"score": 0.0035245918797629804, "phrase": "anti-windup_compensator"}, {"score": 0.0033285306462537884, "phrase": "better_performance"}, {"score": 0.0031270239691197515, "phrase": "transient_performance"}, {"score": 0.002702887319160532, "phrase": "better_transient_performance"}, {"score": 0.002512850690695835, "phrase": "dynamic_anti-windup_compensators"}, {"score": 0.0021049977753042253, "phrase": "larger_domain"}], "paper_keywords": ["actuator saturation", " anti-windup", " anticipatory activation", " domain of attraction", " dynamic compensator"], "paper_abstract": "Traditional anti-windup compensators are designed for activation immediately at the occurrence of actuator saturation. Recently, anti-windup compensators were designed for actuation either after the saturation has reached a certain level or in anticipation of its occurrence. In the case of static anti-windup compensators, it has been shown that an anti-windup compensator designed for activation in anticipation of actuator saturation would lead to better performance than those designed for immediate or delayed activation could, both in terms of transient performance and the size of the domain of attraction. More recently, it has been shown that a dynamic anti-windup compensator designed for anticipatory activation would also result in better transient performance than those designed for immediate or delayed activation could. In this paper, we design dynamic anti-windup compensators for the enlargement of the domain of attraction. These compensators are designed respectively for immediate, delayed and anticipatory activation. We will show by simulation that a dynamic anti-windup compensator designed for anticipatory activation would result in a larger domain of attraction than a dynamic anti-windup compensator designed for immediate or delayed activation could.", "paper_title": "Dynamic anti-windup design for anticipatory activation: enlargement of the domain of attraction", "paper_id": "WOS:000332596000013"}