{"auto_keywords": [{"score": 0.0047310525657970615, "phrase": "particular_documents"}, {"score": 0.004547564208690591, "phrase": "empirical_investigation"}, {"score": 0.00439041997682389, "phrase": "short_history"}, {"score": 0.004294962474996283, "phrase": "citation_motivations"}, {"score": 0.004183137595671171, "phrase": "earlier_surveys"}, {"score": 0.003916098498242888, "phrase": "present_study"}, {"score": 0.0038818006513785977, "phrase": "six_highly_cited_articles"}, {"score": 0.0038309141193444015, "phrase": "topic_area"}, {"score": 0.003698442219929622, "phrase": "locatable_authors"}, {"score": 0.0032697235411641695, "phrase": "heightened_level"}, {"score": 0.0028652153774536967, "phrase": "statistically_significant_ways"}, {"score": 0.0027782510491938315, "phrase": "earlier_samples"}, {"score": 0.002499590390751339, "phrase": "factor_analysis"}, {"score": 0.0024236964502593254, "phrase": "seven_factors"}, {"score": 0.0022192891418394514, "phrase": "recent_debates"}, {"score": 0.0021709339252206825, "phrase": "social_factors"}, {"score": 0.0021330078238529443, "phrase": "alternative_methods"}, {"score": 0.0021049977753042253, "phrase": "citation_behavior"}], "paper_keywords": [""], "paper_abstract": "Why authors cite particular documents has been the subject of both speculation and empirical investigation for decades. This article provides a short history of attempts to understand citation motivations and reports a replication of earlier surveys measuring reasons for citations. Comparisons are made among various types of scholars. The present study identified six highly cited articles in the topic area of bibliometrics and surveyed all of the locatable authors who cited those works (n = 112). It was thought that bibliometricians, given that this is their area of expertise, might have a heightened level of awareness of their own citation practices, and hence a different pattern of responses. Several reasons indicated by the 56% of the sample who identified themselves as bibliometricians differed in statistically significant ways from nonbibliometricians, and also from earlier samples of scholars in Communication and Psychology. By far the most common reason for citing a document is that it represents a genre. A factor analysis shows that 20 motivations, clustered in seven factors, can represent the most common motivations for citation. The implications of these findings are discussed in the light of recent debates about the role of social factors in citation. Alternative methods for investigating citation behavior are discussed.", "paper_title": "Do Bibliometricians Cite Differently From Other Scholars?", "paper_id": "WOS:000288142600001"}