{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_dance_music"}, {"score": 0.0463254570026972, "phrase": "rhythm_similarity"}, {"score": 0.04096369961791015, "phrase": "general_similarity"}, {"score": 0.02576554420465121, "phrase": "general_music_similarity"}, {"score": 0.00475924837336259, "phrase": "music_similarity"}, {"score": 0.0045959609346817535, "phrase": "multi-dimensional_concept"}, {"score": 0.004386887374401584, "phrase": "timbre_similarity"}, {"score": 0.004310949776826717, "phrase": "present_study"}, {"score": 0.003662410853488772, "phrase": "web-based_perceptual_experiments"}, {"score": 0.0033170847930578473, "phrase": "music_pairs"}, {"score": 0.0028506823968539206, "phrase": "fair_agreement"}, {"score": 0.0021799789348982534, "phrase": "novel_hypothesis"}], "paper_keywords": ["music similarity", " rhythm", " timbre", " inter-rater agreement", " perception"], "paper_abstract": "Music similarity is known to be a multi-dimensional concept, depending among others on rhythm similarity and timbre similarity. The present study aims to investigate whether such sub-dimensions of similarity can be assessed independently and how they relate to general similarity. To this end, we performed a series of web-based perceptual experiments on timbre, rhythm and general similarity in electronic dance music. Participants were asked to rate similarities of music pairs on a 4-point Likert scale. The results indicated that the ratings in the three types of similarity did not completely overlap and that participants showed slight to fair agreement in their ratings in all conditions. Together, the results suggest that it is possible to assess sub-dimensions of similarities independently to some extent. Interestingly, general music similarity was not completely explained by the summation of timbre and rhythm similarity. Based on this, a novel hypothesis of how general music similarity follows from its contributing sub-similarities is proposed.", "paper_title": "Perception of Timbre and Rhythm Similarity in Electronic Dance Music", "paper_id": "WOS:000366320300006"}