{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "two-dimensional_steel_coil_cutting_problem"}, {"score": 0.004569630374630379, "phrase": "two-dimensional_cutting"}, {"score": 0.004522080178250592, "phrase": "small_rectangular_items"}, {"score": 0.004246947739596565, "phrase": "large_rectangular_plate"}, {"score": 0.0040094142308666975, "phrase": "trim_loss"}, {"score": 0.0035733198242955634, "phrase": "classical_two-dimensional_cutting_problem"}, {"score": 0.0034628156490003775, "phrase": "distinguishing_features"}, {"score": 0.003251920460276645, "phrase": "non-classical_cutting"}, {"score": 0.0030220049006970317, "phrase": "rectangular_plates"}, {"score": 0.00256895975568914, "phrase": "hybrid_heuristic_algorithm"}, {"score": 0.0022772115643656153, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Non-classical cutting", " Steel coil cutting", " Hybrid heuristic algorithm"], "paper_abstract": "This paper is concerned with the problem of two-dimensional cutting of small rectangular items, each of which has its own deadline and size, from a large rectangular plate, whose length are more than one thousand times its width, so as to minimize the trim loss and the reduction of the times of clamping and changing speed are also concerned. This problem is different with the classical two-dimensional cutting problem. In view of the distinguishing features of the problem proposed, we put forward the definition of non-classical cutting, that is to say, put a series of items on the rectangular plates in their best layout, so as to enhance utility and efficiency at the same time. These objectives may be conflicting and a balance should be necessary, so we present a Hybrid Heuristic Algorithm (HHA), consisting of clustering, ordering, striping and integer programming etc. We demonstrate the efficiency of the proposed algorithm through the comparison with the algorithm we studied before. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Hybrid heuristic algorithm for two-dimensional steel coil cutting problem", "paper_id": "WOS:000302432300019"}