{"auto_keywords": [{"score": 0.04864762431393067, "phrase": "belief_base"}, {"score": 0.007152368807539886, "phrase": "belief_bases"}, {"score": 0.00713996141168938, "phrase": "consistent_subsets"}, {"score": 0.0057949522744286846, "phrase": "normalized_framework"}, {"score": 0.005300227061713217, "phrase": "free_formulas"}, {"score": 0.004623990904432388, "phrase": "important_issue"}, {"score": 0.004440570928903645, "phrase": "sensitive_inconsistency_measures"}, {"score": 0.004322333439660409, "phrase": "natural_way"}, {"score": 0.004235717186207754, "phrase": "current_proposals"}, {"score": 0.004040275465056206, "phrase": "minimal_inconsistent_subset"}, {"score": 0.0039061983019451903, "phrase": "well-known_lottery_paradox"}, {"score": 0.0038149903707018055, "phrase": "minimal_inconsistent_subset_increases"}, {"score": 0.0036759314172445934, "phrase": "current_studies"}, {"score": 0.003042555825368091, "phrase": "sensitive_normalized_measures"}, {"score": 0.0029020077365708966, "phrase": "consistent_subset"}, {"score": 0.002843772431469196, "phrase": "distinctive_plausible_perspective"}, {"score": 0.002767934112798688, "phrase": "minimal_inconsistent_subset_projects"}, {"score": 0.0024674880645446312, "phrase": "minimal_inconsistent_subsets"}, {"score": 0.002361410799860054, "phrase": "common_consent"}, {"score": 0.0023296961971785357, "phrase": "intuitively_satisfactory_measure"}, {"score": 0.002222004614440872, "phrase": "simple_but_explanatory_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Measuring inconsistency", " Minimal inconsistent subsets", " Degree of inconsistency"], "paper_abstract": "Measuring the degree of inconsistency of a belief base is an important issue in many real-world applications. It has been increasingly recognized that deriving syntax sensitive inconsistency measures for a belief base from its minimal inconsistent subsets is a natural way forward. Most of the current proposals along this line do not take the impact of the size of each minimal inconsistent subset into account. However, as illustrated by the well-known Lottery Paradox, as the size of a minimal inconsistent subset increases, the degree of its inconsistency decreases. Another lack in current studies in this area is about the role of free formulas of a belief base in measuring the degree of inconsistency. This has not yet been characterized well. Adding free formulas to a belief base can enlarge the set of consistent subsets of that base. However, consistent subsets of a belief base also have an impact on the syntax sensitive normalized measures of the degree of inconsistency, the reason for this is that each consistent subset can be considered as a distinctive plausible perspective reflected by that belief base, whilst each minimal inconsistent subset projects a distinctive view of the inconsistency. To address these two issues, we propose a normalized framework for measuring the degree of inconsistency of a belief base which unifies the impact of both consistent subsets and minimal inconsistent subsets. We also show that this normalized framework satisfies all the properties deemed necessary by common consent to characterize an intuitively satisfactory measure of the degree of inconsistency for belief bases. Finally, we use a simple but explanatory example in requirements engineering to illustrate the application of the normalized framework. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A syntax-based approach to measuring the degree of inconsistency for belief bases", "paper_id": "WOS:000296306500006"}