{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_power"}, {"score": 0.012320465449213723, "phrase": "opinion_formation"}, {"score": 0.007150569457387121, "phrase": "consensus_time"}, {"score": 0.004768895924073874, "phrase": "scale-free_networks"}, {"score": 0.004736434518535051, "phrase": "complex_networks"}, {"score": 0.004697655699119423, "phrase": "social_networks"}, {"score": 0.004659192888931046, "phrase": "inevitable_parts"}, {"score": 0.004621043537046209, "phrase": "daily_life"}, {"score": 0.0045084510240032535, "phrase": "increasing_interest"}, {"score": 0.00445318311339027, "phrase": "social_phenomena"}, {"score": 0.004416713079266374, "phrase": "networked_structures"}, {"score": 0.0037776319581225046, "phrase": "central_nodes"}, {"score": 0.003746673633703251, "phrase": "specific_properties"}, {"score": 0.0036703791815812328, "phrase": "highest_degree"}, {"score": 0.003177958355586418, "phrase": "connection_structure"}, {"score": 0.002333421318779658, "phrase": "optimal_degree"}, {"score": 0.0021845387990972543, "phrase": "scale-free_topology"}, {"score": 0.0021049977753042253, "phrase": "peripheral_agents"}], "paper_keywords": ["complex networks", " opinion formation", " multi-agent systems", " agent-based simulation", " social power"], "paper_abstract": "Social networks are inevitable parts of daily life and there has been an increasing interest in analyzing social phenomena on networked structures. Evolution of opinion formation is one of the topics that has attracted many scholars in the field. In this work we consider the influence of leaders and social power in the evolution of opinion formation. A number of central nodes with specific properties (e.g. nodes with highest degree, betweenness or vulnerability values) are taken as leaders whose opinions are kept unchanged, that is, not influenced by other agents. The leaders try to coordinate the opinions of other agents where the connection structure is considered to be preferential attachment scale-free, Watts-Strogatz small-world or Erds-Renyi random networks. Numerical simulations show that scale-free networks provide faster consensus compared with other networks. We also study the effects of social power on the consensus time. The social power of a node is considered to be a function of its centrality. Having leaders in the network, we show that the consensus time could be significantly decreased by introducing social power. For scale-free networks, there is an optimal degree of social power in which the consensus time is minimal. These results show the appropriateness of scale-free topology in hierarchal organizations where leaders posit influence on peripheral agents.", "paper_title": "Effects of leaders and social power on opinion formation in complex networks", "paper_id": "WOS:000320578400003"}