{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environmental_camera"}, {"score": 0.04702525708768044, "phrase": "mobile_robot"}, {"score": 0.019336099610844325, "phrase": "robot_system"}, {"score": 0.00853123795835315, "phrase": "external_parameters"}, {"score": 0.004779876533667754, "phrase": "mobile_robot_navigation"}, {"score": 0.004608284537368354, "phrase": "working_environment"}, {"score": 0.004558012799538011, "phrase": "vision_guidance"}, {"score": 0.004362326712297089, "phrase": "relative_position"}, {"score": 0.0031845067058084583, "phrase": "specific_kinds"}, {"score": 0.003161271802988128, "phrase": "motion_patterns"}, {"score": 0.002959617637433, "phrase": "calibration_approach"}, {"score": 0.0025468951021098717, "phrase": "evaluation_index"}, {"score": 0.0024106932919085097, "phrase": "test_motions"}, {"score": 0.0023843376332011936, "phrase": "good_calibration_performance"}, {"score": 0.0022321322970228308, "phrase": "calibration_time"}, {"score": 0.0021518035978153878, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["self-calibration", " environmental camera", " motion design", " test motion", " virtual sensing error"], "paper_abstract": "An environmental camera is a camera embedded in a working environment to provide vision guidance to a mobile robot. In the setup of such robot systems. the relative position and orientation between the mobile robot and the environmental camera are parameters that must unavoidably be calibrated. Traditionally, because the configuration of the robot system is task-driven, these kinds of external parameters of the camera are measured separately and should be measured each time a task is to be performed. In this paper, a method is proposed for the robot system in which calibration of the environmental camera is rendered by the robot system itself on the spot after a system is set up. Specific kinds of motion patterns of the mobile robot, which are called test motions, have been explored for calibration. The calibration approach is based upon executing certain selected test motions on the mobile robot and then using the camera to observe the robot. According to a comparison of odometry and sensing data, the external parameters of the camera can be calibrated. Furthermore, an evaluation index (virtual sensing error) has been developed for the selection and optimization of test motions to obtain good calibration performance. All the test motion patterns are computed offline in advance and saved in a database, which greatly shorten the calibration time. Simulations and experiments verified the effectiveness of the proposed method. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Self-calibration of environmental camera for mobile robot navigation", "paper_id": "WOS:000245345900001"}