{"auto_keywords": [{"score": 0.03918347337434733, "phrase": "predictive_performance"}, {"score": 0.00481495049065317, "phrase": "recent_studies"}, {"score": 0.0046141941030386525, "phrase": "putative_biomarkers"}, {"score": 0.0045556080393342165, "phrase": "experimental_data"}, {"score": 0.0043656173407379895, "phrase": "stable_biomarkers"}, {"score": 0.0041657281535389615, "phrase": "small_perturbations"}, {"score": 0.003958049372486465, "phrase": "useful_objective"}, {"score": 0.003409399407390298, "phrase": "logistic_regression_classifiers"}, {"score": 0.0033517342967390065, "phrase": "elastic_net_penalty"}, {"score": 0.0030908254851076005, "phrase": "synthetic_example"}, {"score": 0.0027662954811372154, "phrase": "false-positive_biomarkers"}, {"score": 0.0026507289852980512, "phrase": "true_positives"}, {"score": 0.002475755804232436, "phrase": "true_positive_rate"}, {"score": 0.0023926387830753033, "phrase": "adverse_effects"}, {"score": 0.0022634699331607615, "phrase": "biomarker_discovery"}, {"score": 0.002187464225869713, "phrase": "proteomics_context"}, {"score": 0.002132135985573126, "phrase": "robust_candidate_biomarkers"}, {"score": 0.0021049977753042253, "phrase": "human_disease"}], "paper_keywords": ["machine learning", " proteins", " reverse engineering", " statistical models", " statistics"], "paper_abstract": "Recent studies have highlighted the importance of assessing the robustness of putative biomarkers identified from experimental data. This has given rise to the concept of stable biomarkers, which are ones that are consistently identified regardless of small perturbations to the data. Since stability is not by itself a useful objective, we present a number of strategies that combine assessments of stability and predictive performance in order to identify biomarkers that are both robust and diagnostically useful. Moreover, by wrapping these strategies around logistic regression classifiers regularized by the elastic net penalty, we are able to assess the effects of correlations between biomarkers upon their perceived stability. We use a synthetic example to illustrate the properties of our proposed strategies. In this example, we find that: (i) assessments of stability can help to reduce the number of false-positive biomarkers, although potentially at the cost of missing some true positives; (ii) combining assessments of stability with assessments of predictive performance can improve the true positive rate; and (iii) correlations between biomarkers can have adverse effects on their stability and hence must be carefully taken into account when undertaking biomarker discovery. We then apply our strategies in a proteomics context to identify a number of robust candidate biomarkers for the human disease HTLV1-associated myelopathy/tropical spastic paraparesis (HAM/TSP).", "paper_title": "Balancing the Robustness and Predictive Performance of Biomarkers", "paper_id": "WOS:000327218500004"}