{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "segmentation_effect"}, {"score": 0.015007791787945646, "phrase": "temporal_cueing"}, {"score": 0.004291848822287492, "phrase": "continuous_stream"}, {"score": 0.004112812699639956, "phrase": "beneficial_effect"}, {"score": 0.0040779081518317415, "phrase": "cognitive_load"}, {"score": 0.0036191240628152205, "phrase": "extra_time"}, {"score": 0.0035731269727067496, "phrase": "necessary_cognitive_processes"}, {"score": 0.0034386016613475335, "phrase": "meaningful_pieces"}, {"score": 0.0032255172568437965, "phrase": "underlying_structure"}, {"score": 0.002924074850256874, "phrase": "secondary_education_students"}, {"score": 0.0028139168128067343, "phrase": "probability_calculation"}, {"score": 0.002159623311924437, "phrase": "different_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Instructional animations", " Segmentation", " Cueing", " Cognitive load"], "paper_abstract": "Segmentation of animations, that is presenting them in pieces rather than as a continuous stream of information, has been shown to have a beneficial effect on cognitive load and learning for novices. Two different explanations of this segmentation effect have been proposed. Firstly, pauses are usually inserted between the segments, which may give learners extra time to perform necessary cognitive processes. Secondly, because segmentation divides animations into meaningful pieces, it provides a form of temporal cueing which may support learners in perceiving the underlying structure of the process or procedure depicted in the animation. This study investigates which of these explanations is the most plausible. Secondary education students (N = 161) studied animations on probability calculation, after having been randomly assigned to one of four conditions: non-segmented animations, animations segmented by pauses only, animations segmented by temporarily darkening the screen only, and animations segmented by both pauses and temporarily darkening the screen. The results suggest that both pauses and cues play a role in the segmentation effect, but in a different way. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Explaining the segmentation effect in learning from animations: The role of pausing and temporal cueing", "paper_id": "WOS:000305036400011"}