{"auto_keywords": [{"score": 0.04971911912939944, "phrase": "intermountain_healthcare"}, {"score": 0.047441903486245926, "phrase": "detailed_clinical_models"}, {"score": 0.040892447903913234, "phrase": "subjective_decisions"}, {"score": 0.025292733885623763, "phrase": "implementation_layer"}, {"score": 0.00481495049065317, "phrase": "detailed_clinical_modeling"}, {"score": 0.00463668357590034, "phrase": "long_history"}, {"score": 0.004584495834677719, "phrase": "coded_terminology"}, {"score": 0.004414723336530117, "phrase": "clinical_data"}, {"score": 0.004365022891478405, "phrase": "decision_support"}, {"score": 0.004332199142914195, "phrase": "semantic_interoperability"}, {"score": 0.004283423748543866, "phrase": "latest_iteration"}, {"score": 0.00421923944095905, "phrase": "intermountain"}, {"score": 0.003014713272570927, "phrase": "clinical_element_modeling_language"}, {"score": 0.0025335509856200433, "phrase": "logical_attributes"}, {"score": 0.002495521662819317, "phrase": "iso-semantic_models"}, {"score": 0.002402921062033032, "phrase": "potential_benefits"}, {"score": 0.0023490143960001675, "phrase": "iso-semantic_modeling_framework"}, {"score": 0.002129020447793464, "phrase": "iso-semantic_framework"}], "paper_keywords": [""], "paper_abstract": "Background and objective Intermountain Healthcare has a long history of using coded terminology and detailed clinical models (DCMs) to govern storage of clinical data to facilitate decision support and semantic interoperability. The latest iteration of DCMs at Intermountain is called the clinical element model (CEM). We describe the lessons learned from our CEM efforts with regard to subjective decisions a modeler frequently needs to make in creating a CEM. We present insights and guidelines, but also describe situations in which use cases conflict with the guidelines. We propose strategies that can help reconcile the conflicts. The hope is that these lessons will be helpful to others who are developing and maintaining DCMs in order to promote sharing and interoperability. Methods We have used the Clinical Element Modeling Language (CEML) to author approximately 5000 CEMs. Results Based on our experience, we have formulated guidelines to lead our modelers through the subjective decisions they need to make when authoring models. Reported here are guidelines regarding precoordination/postcoordination, dividing content between the model and the terminology, modeling logical attributes, and creating iso-semantic models. We place our lessons in context, exploring the potential benefits of an implementation layer, an iso-semantic modeling framework, and ontologic technologies. Conclusions We assert that detailed clinical models can advance interoperability and sharing, and that our guidelines, an implementation layer, and an iso-semantic framework will support our progress toward that goal.", "paper_title": "Lessons learned in detailed clinical modeling at Intermountain Healthcare", "paper_id": "WOS:000343776700020"}