{"auto_keywords": [{"score": 0.02850914211917665, "phrase": "initial_images"}, {"score": 0.00481495049065317, "phrase": "plant_tissues"}, {"score": 0.0047276324024980625, "phrase": "advanced_image_analysis_-_study"}, {"score": 0.004654043854386197, "phrase": "proper_determination"}, {"score": 0.004569630374630379, "phrase": "challenging_problems"}, {"score": 0.004545793387330536, "phrase": "modern_medicine"}, {"score": 0.0043028576671457035, "phrase": "high_percentage"}, {"score": 0.004280406287174573, "phrase": "results_misinterpretation"}, {"score": 0.003946960862020283, "phrase": "simulated_set"}, {"score": 0.0038249462699142733, "phrase": "experimentally_obtained_input_data"}, {"score": 0.0038049789989278463, "phrase": "auto-fluorescence_images"}, {"score": 0.003785115566529808, "phrase": "needle_cross_sections"}, {"score": 0.0037164035697565285, "phrase": "common_centaury"}, {"score": 0.003629882559085245, "phrase": "cell_types"}, {"score": 0.0035920758080335655, "phrase": "inherent_features"}, {"score": 0.0035733198242955634, "phrase": "plant_cells_-_auto-fluorescence"}, {"score": 0.003480993634130542, "phrase": "different_quantities"}, {"score": 0.0033294625614007922, "phrase": "cross_sections"}, {"score": 0.0031595872675010384, "phrase": "standard_equipment"}, {"score": 0.0031103300439834706, "phrase": "transmission_image"}, {"score": 0.0030062165552187086, "phrase": "explicit_feature_maps"}, {"score": 0.002786315148863582, "phrase": "greatest_advantage"}, {"score": 0.0027285271769284503, "phrase": "extracted_components"}, {"score": 0.00256895975568914, "phrase": "john_wiley"}, {"score": 0.0025090849287530575, "phrase": "proper_tissue_determination"}, {"score": 0.0024894376091589244, "phrase": "challenging_task"}, {"score": 0.0022593758100702007, "phrase": "key_advantage"}, {"score": 0.002206700502606511, "phrase": "starting_set"}, {"score": 0.0021049977753042253, "phrase": "tissue_classification"}], "paper_keywords": ["image analysis", " explicit feature maps", " l(0)-norm-constrained nonnegative matrix factorization", " fluorescence microscopy"], "paper_abstract": "Proper determination of tissues is one of the challenging problems in modern medicine and histology. Currently, interpretation of the results mainly depends on the experience of a histologist, leading to high percentage of results misinterpretation. Bearing in mind potential application, we proposed the set of procedures that allow us to obtain precise, mathematically determined parameters for tissue discrimination. First, the method was tested on simulated set of images and compared with several other algorithms. As the set of experimentally obtained input data, auto-fluorescence images of needle cross sections (Piceaomorika) and stamens of common centaury (Centauriumerythraea) were used. Determination of cell types is based on inherent features of plant cells - auto-fluorescence. As each cell type consists of various fluorescent components in different quantities for each type of tissue, its integral emission spectrum can be used as the fingerprint for identification. Cross sections were imaged using four sets of filters for detection of fluorescence (both excitation and emission). Such filter set is standard equipment for most fluorescence microscopes. One additional image was transmission image using the same optics. By applying (0)-norm-constrained nonnegative matrix factorization in a space induced by explicit feature maps, it is possible to identify up to 11 tissues in needles and five in stamens (actual number of tissues). In comparison to other image analysis methods, the greatest advantage is the fact that the number of extracted components significantly exceeds the number of initial images while most other techniques can extract only as much components as the number of initial images. Copyright (c) 2015 John Wiley & Sons, Ltd. Finding the procedure for proper tissue determination is a challenging task in various fields of biology and medicine, unfortunately often affected by subjectivity of the histologist. We have introduced the method based on (0)-norm-constrained nonnegative matrix factorization and compared it with several algorithms on controlled, simulated set of images. The key advantage is the ability to extract much more components from the starting set of images (often small number) in comparison to other methods, providing more versatile set of parameters for tissue classification.", "paper_title": "Complete determination of plant tissues based only on auto-fluorescence and the advanced image analysis - study of needles and stamens", "paper_id": "WOS:000362647100001"}