{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "brazilian_portuguese"}, {"score": 0.04421110906060489, "phrase": "speech_rate"}, {"score": 0.043025239716159284, "phrase": "antepenultimate_stress_words"}, {"score": 0.03795119753784682, "phrase": "word_type"}, {"score": 0.004448169552315403, "phrase": "theoretical_framework"}, {"score": 0.004398094237005956, "phrase": "articulatory_phonology"}, {"score": 0.004062937864702115, "phrase": "penultimate_stress_words"}, {"score": 0.0037320255482878365, "phrase": "different_patterns"}, {"score": 0.003689982350051231, "phrase": "post-stressed_vowel_reduction"}, {"score": 0.0030955250132409964, "phrase": "coarticulation_degree"}, {"score": 0.0027017384809547886, "phrase": "pci"}, {"score": 0.002279011030331704, "phrase": "dynamical_aspects"}, {"score": 0.0022405528759521856, "phrase": "speech_rate_increase"}, {"score": 0.0021778895748464024, "phrase": "lexical_process"}, {"score": 0.0021049977753042253, "phrase": "penultimate_ones"}], "paper_keywords": ["Speech rate", " Dynamical systems", " Articulatory Phonology", " Linguistic change", " Lexical variation"], "paper_abstract": "This work, which is couched in the theoretical framework of Articulatory Phonology, deals with the influence of speech rate on the change/variation from antepenultimate stress words into penultimate stress words in Brazilian Portuguese. Both acoustic and articulatory (EMMA) studies were conducted. Oil the acoustic side, results show different patterns of post-stressed vowel reduction according to the word type. Some words reduced their medial post-stressed vowels more than their final post-stressed vowels, and others reduced their final post-stressed vowels more than their medial post-stressed vowels. On the articulatory side, results show that the coarticulation degree of the post-stressed consonants increases with speech rate. Also, with the use of a measure called proportional consonantal interval (PCI), it was found in measurements of articulation that such measure is influenced by the word type. Three different groups of words were found according to their PCI. These results show how dynamical aspects influenced by speech rate increase are related to the lexical process of change/variation from antepenultimate stress words into penultimate ones. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Lexical reorganization in Brazilian Portuguese: An articulatory study", "paper_id": "WOS:000261284100005"}