{"auto_keywords": [{"score": 0.04920822493417558, "phrase": "clinical_notes"}, {"score": 0.04560010179294977, "phrase": "scale-up_efforts"}, {"score": 0.04150467243926874, "phrase": "indwelling_urinary_catheter"}, {"score": 0.04126073658431364, "phrase": "hospitalized_patients"}, {"score": 0.00481495049065317, "phrase": "nlp_pipelines"}, {"score": 0.004542976479682312, "phrase": "\"big_data"}, {"score": 0.0043258453436258405, "phrase": "va_salt_lake_city_health_care_system"}, {"score": 0.004195418010131832, "phrase": "natural_language_processing"}, {"score": 0.004169883136770322, "phrase": "nlp"}, {"score": 0.00410645614623058, "phrase": "use_case"}, {"score": 0.00405646687267772, "phrase": "current_project"}, {"score": 0.003910106508089187, "phrase": "subsequent_catheter-associated_urinary_tract_infections"}, {"score": 0.0035997452281985465, "phrase": "small_corpus"}, {"score": 0.0032635467579751423, "phrase": "original_algorithm"}, {"score": 0.0031747618267940155, "phrase": "larger_corpus"}, {"score": 0.002985988377995789, "phrase": "national_sample"}, {"score": 0.002723607240517261, "phrase": "annotator_scale-out"}, {"score": 0.002641360377825228, "phrase": "average_time"}, {"score": 0.0023871221933990192, "phrase": "straight_forward_evolution"}, {"score": 0.0023725232579531273, "phrase": "small_scale_nlp_processing"}, {"score": 0.002315012841166354, "phrase": "associated_complexities"}, {"score": 0.0022519745140925475, "phrase": "underlying_uima_framework"}, {"score": 0.002217696306116023, "phrase": "generalizable_and_widely_applicable_techniques"}, {"score": 0.0021049977753042253, "phrase": "big_data"}], "paper_keywords": ["Natural language processing", " big data", " scale-up"], "paper_abstract": "Introduction: This article is part of the Focus Theme of Methods of Information in Medicine on \"Big Data and Analytics in Healthcare\". Objectives: This paper describes the scale-up efforts at the VA Salt Lake City Health Care System to address processing large corpora of clinical notes through a natural language processing (NLP) pipeline. The use case described is a current project focused on detecting the presence of an indwelling urinary catheter in hospitalized patients and subsequent catheter-associated urinary tract infections. Methods: An NLP algorithm using v3NLP was developed to detect the presence of an indwelling urinary catheter in hospitalized patients. The algorithm was tested on a small corpus of notes on patients for whom the presence or absence of a catheter was already known (reference standard). In planning for a scale-up, we estimated that the original algorithm would have taken 2.4 days to run on a larger corpus of notes for this project (550,000 notes), and 27 days for a corpus of 6 million records representative of a national sample of notes. We approached scaling-up NLP pipelines through three techniques: pipeline replication via multi-threading, intra-annotator threading for tasks that can be further decomposed, and remote annotator services which enable annotator scale-out. Results: The scale-up resulted in reducing the average time to process a record from 206 milliseconds to 17 milliseconds or a 12-fold increase in performance when applied to a corpus of 550,000 notes. Conclusions: Purposely simplistic in nature, these scale-up efforts are the straight forward evolution from small scale NLP processing to larger scale extraction without in curring associated complexities that are inherited by the use of the underlying UIMA framework. These efforts represent generalizable and widely applicable techniques that will aid other computationally complex NLP pipelines that are of need to be scaled out for processing and analyzing big data.", "paper_title": "Scaling-up NLP Pipelines to Process Large Corpora of Clinical Notes", "paper_id": "WOS:000366043500011"}