{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_document_classification"}, {"score": 0.004551781491498328, "phrase": "ambiguous_term"}, {"score": 0.004090577229368418, "phrase": "knowledge-based_wsd_method"}, {"score": 0.004022137057452406, "phrase": "semantic_similarity_measures"}, {"score": 0.003910596179654687, "phrase": "umls"}, {"score": 0.003717528595128948, "phrase": "clinical_text_classification"}, {"score": 0.00357395617690842, "phrase": "biomedical_wsd_datasets"}, {"score": 0.003087419032091453, "phrase": "disambiguated_concepts"}, {"score": 0.0028695095228791724, "phrase": "wsd_system"}, {"score": 0.0028214413724451442, "phrase": "high_disambiguation_accuracy"}, {"score": 0.0027898428590137515, "phrase": "standard_biomedical_wsd_datasets"}, {"score": 0.0025783188934190788, "phrase": "metamap"}, {"score": 0.0025208755851561368, "phrase": "text_analysis"}, {"score": 0.0021049977753042253, "phrase": "open_source"}], "paper_keywords": ["Word Sense Disambiguation", " Semantic similarity", " Natural Language Processing"], "paper_abstract": "Background Word sense disambiguation (WSD) methods automatically assign an unambiguous concept to an ambiguous term based on context, and are important to many text-processing tasks. In this study we developed and evaluated a knowledge-based WSD method that uses semantic similarity measures derived from the Unified Medical Language System (UMLS) and evaluated the contribution of WSD to clinical text classification. Methods We evaluated our system on biomedical WSD datasets and determined the contribution of our WSD system to clinical document classification on the 2007 Computational Medicine Challenge corpus. Results Our system compared favorably with other knowledge-based methods. Machine learning classifiers trained on disambiguated concepts significantly outperformed those trained using all concepts. Conclusions We developed a WSD system that achieves high disambiguation accuracy on standard biomedical WSD datasets and showed that our WSD system improves clinical document classification. Data sharing We integrated our WSD system with MetaMap and the clinical Text Analysis and Knowledge Extraction System, two popular biomedical natural language processing systems. All codes required to reproduce our results and all tools developed as part of this study are released as open source, available under .", "paper_title": "Knowledge-based biomedical word sense disambiguation: an evaluation and application to clinical document classification", "paper_id": "WOS:000323168200012"}