{"auto_keywords": [{"score": 0.0475359022069799, "phrase": "inter-element_coupling_effect"}, {"score": 0.0081162749729321, "phrase": "plate_components"}, {"score": 0.007915246102440675, "phrase": "common_boundary"}, {"score": 0.006695695462791769, "phrase": "benchmark_tests"}, {"score": 0.005057055805095309, "phrase": "flat_shell"}, {"score": 0.00481495049065317, "phrase": "triangular_flat_shells"}, {"score": 0.004140036888016244, "phrase": "excellent_membrane_element"}, {"score": 0.004105468006525504, "phrase": "opt"}, {"score": 0.003986581514959951, "phrase": "dkt"}, {"score": 0.003953256858638655, "phrase": "rdktm"}, {"score": 0.0035296217979800463, "phrase": "formulated_flat_shells"}, {"score": 0.0031778255332904487, "phrase": "shell's_performance"}, {"score": 0.003072807453368781, "phrase": "superimposed_membrane"}, {"score": 0.0029463874016490976, "phrase": "order_matching\"_criterion"}, {"score": 0.002564862727498502, "phrase": "high-performance_membrane"}, {"score": 0.0024800509241747013, "phrase": "inter-element_coupling_effect_of_membrane_and_plate_components"}, {"score": 0.0021049977753042253, "phrase": "\"order_matching\"_criterion"}], "paper_keywords": ["Flat shell element", " Inter-element coupling effect", " Membrane element", " Order matching", " Plate bending element", " Shell"], "paper_abstract": "Purpose - The purpose of this paper is to study the inter-element coupling effect of membrane and plate components between two adjacent shells occurring on the common boundary. Design/methodology/approach - In this paper, three triangular flat shells developed by combining an excellent membrane element (OPT) with three outstanding plate bending elements (DKT, RDKTM and DST-BK), respectively, are used to study this phenomenon. Benchmark tests are implemented to evaluate the performance of three selected plate elements and the formulated flat shells. Findings - The inter-element coupling effect of membrane and plate components belonging, respectively, to two adjacent shells deteriorate the performance of shells. Therefore, a shell's performance cannot be guaranteed certainly by the superimposed membrane and plate behaviors. Practical implications - The \"order matching\" criterion is proposed to explain this phenomenon and it is concluded that the flat shell that follows this criterion explicitly may alleviate or even overcome the inter-element coupling effect. Originality/value - Previous studies mainly focus on formulation of high-performance membrane and plate elements. However, the inter-element coupling effect of membrane and plate components between two adjacent shells occurring on the common boundary, has attracted less attention. Thorough benchmark tests for three flat shells are implemented to investigate the phenomenon. The results shows that the inter-element coupling effect deteriorates the performance of shells. And the \"order matching\" criterion is proposed to explain this phenomenon and it is concluded that the flat shell that follows this criterion explicitly may alleviate or even overcome the inter-element coupling effect.", "paper_title": "The inter-element coupling effect of triangular flat shells", "paper_id": "WOS:000368249300005"}