{"auto_keywords": [{"score": 0.03286550094955044, "phrase": "sis"}, {"score": 0.00989061017853281, "phrase": "system_appropriation"}, {"score": 0.00481495049065317, "phrase": "adaptive_swarm_intelligence_technology"}, {"score": 0.004701015188740582, "phrase": "web-based_collaborative_learning"}, {"score": 0.004562362497952548, "phrase": "key_challenges"}, {"score": 0.0044277810648955624, "phrase": "web-based_learning"}, {"score": 0.00429715240295033, "phrase": "effective_collaborative_learning_environments"}, {"score": 0.00414545383888272, "phrase": "structuration_process"}, {"score": 0.003927848423072668, "phrase": "web-based_collaborative_learning_activities"}, {"score": 0.0034220655476652683, "phrase": "effective_collaboration"}, {"score": 0.003321008590273796, "phrase": "dynamic_way"}, {"score": 0.002373472641477602, "phrase": "ascl_environment"}, {"score": 0.0021953290937408807, "phrase": "technological_support"}, {"score": 0.0021049977753042253, "phrase": "web-based_learning_environment"}], "paper_keywords": ["Collaborative learning", " Distributed learning environments", " Computer-mediated communication", " Learning communities"], "paper_abstract": "One of the key challenges in the promotion of web-based learning is the development of effective collaborative learning environments. We posit that the structuration process strongly influences the effectiveness of technology used in web-based collaborative learning activities. in this paper, we propose an ant swarm collaborative learning (ASCL) environment based on a swarm intelligence system (SIS) that structures opportunities for effective collaboration and learning in a dynamic way. The results of our experiments indicate that: (1) the self-organizing behavior of SIS is positively associated with system appropriation: (2) the multi-agent-based mechanism of SIS is positively associated with system appropriation; (3) the cohesive capability of SIS is positively associated with system appropriation; and (4) the learner's tendency toward system appropriation is positively associated with learning effectiveness. Our findings also show that learners in an ASCL environment outperform their counterparts in a general web-based learning (GWL) environment. We conclude that different types of technological support can influence the achievement in a web-based learning environment. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Applying adaptive swarm intelligence technology with structuration in web-based collaborative learning", "paper_id": "WOS:000264617400007"}