{"auto_keywords": [{"score": 0.03344207351445383, "phrase": "rmc"}, {"score": 0.00481495049065317, "phrase": "low-rank_and_sparse_matrices"}, {"score": 0.0046621835537196754, "phrase": "important_problem"}, {"score": 0.003675023529026644, "phrase": "large-scale_problems"}, {"score": 0.0033223686422055834, "phrase": "sparse_matrices"}, {"score": 0.003269162006886173, "phrase": "grossly_corrupted_data"}, {"score": 0.0028155589373385333, "phrase": "cpcp"}, {"score": 0.002737178087553296, "phrase": "svd"}, {"score": 0.0027041233221381756, "phrase": "large-scale_matrix"}, {"score": 0.0025761937402886954, "phrase": "alternating_direction_method"}, {"score": 0.0024742098091226203, "phrase": "rmc_problems"}, {"score": 0.0024052270356036743, "phrase": "convergence_analysis"}, {"score": 0.002319346861878611, "phrase": "general_cpcp_problems"}, {"score": 0.002300681752315682, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Compressive principal component pursuit", " Robust matrix completion", " Robust principal component analysis", " Low-rank matrix recovery and completion"], "paper_abstract": "Recovering low-rank and sparse matrices from incomplete or corrupted observations is an important problem in statistics, machine learning, computer vision, as well as signal and image processing. In theory, this problem can be solved by the natural convex joint/mixed relaxations (i.e., l(1)-norm and trace norm) under certain conditions. However, all current provable algorithms suffer from superlinear per-iteration cost, which severely limits their applicability to large-scale problems. In this paper, we propose a scalable, provable and structured robust bilinear factorization (RBF) method to recover low-rank and sparse matrices from missing and grossly corrupted data, i.e., robust matrix completion (RMC), or incomplete and grossly corrupted measurements, i.e., compressive principal component pursuit (CPCP). Specifically, we first present two small-scale matrix trace norm regularized bilinear factorization models for RMC and CPCP problems, in which repetitively calculating SVD of a large-scale matrix is replaced by updating two much smaller factor matrices. Then, we apply the alternating direction method of multipliers (ADMM) to efficiently solve the RMC problems. Finally, we provide the convergence analysis of our algorithm, and extend it to address general CPCP problems. Experimental results verified both the efficiency and effectiveness of our method compared with the state-of-the-art methods. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Robust bilinear factorization with missing and grossly corrupted observations", "paper_id": "WOS:000351965100004"}