{"auto_keywords": [{"score": 0.04654776991800179, "phrase": "foss_packages"}, {"score": 0.042890021819658786, "phrase": "foss"}, {"score": 0.03091828249135689, "phrase": "iran"}, {"score": 0.028862745337847155, "phrase": "software_packages"}, {"score": 0.028126759841728077, "phrase": "internet_users"}, {"score": 0.00481495049065317, "phrase": "main_characteristics"}, {"score": 0.004758657162039561, "phrase": "anti-filtering_packages"}, {"score": 0.0045399591300830456, "phrase": "digital_communities"}, {"score": 0.004395437013020554, "phrase": "inexpensive_way"}, {"score": 0.004059827743016726, "phrase": "vital_role"}, {"score": 0.00400053884985293, "phrase": "repressed_countries"}, {"score": 0.003953729274556226, "phrase": "state_imposed_internet_content_filtering"}, {"score": 0.003850392835818635, "phrase": "proxy_servers"}, {"score": 0.003651722462180419, "phrase": "main_source"}, {"score": 0.0036196183044671106, "phrase": "foss_anti-filtering_software_packages"}, {"score": 0.003556251226438769, "phrase": "secure_web_surfing"}, {"score": 0.003535375475035123, "phrase": "anonymous_web_access"}, {"score": 0.0033039051001591724, "phrase": "proxy_software_updates"}, {"score": 0.0032652199869725087, "phrase": "domain_name"}, {"score": 0.003226986367585129, "phrase": "main_objectives"}, {"score": 0.0030966491684507646, "phrase": "content_filtering"}, {"score": 0.0030067770042809354, "phrase": "communication_discourse"}, {"score": 0.0029454183793671054, "phrase": "well_known_foss_anti-filtering_packages"}, {"score": 0.0027687330263687126, "phrase": "state_censorship"}, {"score": 0.002564555834629261, "phrase": "slow_internet_connections"}, {"score": 0.0023064113959127288, "phrase": "new_model"}, {"score": 0.0022197067349433897, "phrase": "growing_number"}, {"score": 0.002161593130928687, "phrase": "uncensored_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["ICT", " Censorship", " Filtering", " Communication discourse", " Open Source Software", " P2P", " Software development"], "paper_abstract": "This study critically investigates the main characteristics and features of anti-filtering packages provided by Free and Open Source Software (FOSS). For over a decade, the digital communities around the globe have used FOSS packages not only as an inexpensive way to access to information available on Internet, but also to disseminate thoughts, opinions and concerns about various socio-political and economic matters. Proxy servers and FOSS played a vital role in helping citizens in repressed countries to bypass the state imposed Internet content filtering and censorship practices. On the one hand, proxy servers act as redirectors to websites, and on the other hand, many of these servers are the main source for downloading FOSS anti-filtering software packages. These packages can provide secure web surfing via anonymous web access, data encryption. IP address masking, location concealment, browser history and cookie clean-ups but they also provide proxy software updates as well as domain name updates. The main objectives of this study are to investigate the role of FOSS packages in combating Internet content filtering and censorship and empowering citizens to effectively participate in communication discourse. By evaluating some of the well known FOSS anti-filtering packages used by Iran's digital community, this study found that despite the success of FOSS in combating filtering and state censorship, the majority of these software packages were not designed to meet the needs of Internet users. In particular, they are poorly adapted to the slow Internet connections in many developing countries such as Iran. In addition, these software packages do not meet the level of sophistication used by authorities to filter the content of the Net. Therefore, this study offers a new model that takes into account not only the existing level of the Internet infrastructure but also the growing number of Internet users demanding more effective FOSS packages for faster access to uncensored information while maintaining anonymity. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Free and Open Source Software versus Internet content filtering and censorship: A case study", "paper_id": "WOS:000301630700012"}