{"auto_keywords": [{"score": 0.045800094763709026, "phrase": "sensor_readings"}, {"score": 0.015719716506582538, "phrase": "sensor_networks"}, {"score": 0.014941109455817076, "phrase": "resilient_data_aggregation"}, {"score": 0.004304574865291508, "phrase": "base_station"}, {"score": 0.0038301525703886585, "phrase": "environmental_parameters"}, {"score": 0.003672427620845944, "phrase": "statistical_framework"}, {"score": 0.003407839062159497, "phrase": "aggregation_function"}, {"score": 0.0033603864623013733, "phrase": "main_novelty"}, {"score": 0.0031328221096543823, "phrase": "naturally_existing_correlation"}, {"score": 0.0030461580449080553, "phrase": "different_sensors"}, {"score": 0.0029343128039167185, "phrase": "spatial_correlation"}, {"score": 0.002853124436286834, "phrase": "sensor_network_data_model"}, {"score": 0.002684819249720834, "phrase": "data_aggregation"}, {"score": 0.0024912073108138613, "phrase": "special_assumption"}, {"score": 0.0022161977759646693, "phrase": "typical_attacker_model"}, {"score": 0.0021049977753042253, "phrase": "sophisticated_attacker"}], "paper_keywords": ["Sensor networks", " Resilient aggregation", " Correlation", " Attack detection"], "paper_abstract": "In this paper, we consider the problem of resilient data aggregation in sensor networks, namely, how to aggregate sensor readings collected by the base station when some of those sensor readings may be compromised. Note that an attacker can easily compromise the reading of a sensor by altering the environmental parameters measured by that sensor. We present a statistical framework that is designed to mitigate the effects of the attacker on the output of the aggregation function. The main novelty of our approach compared to most prior work on resilient data aggregation is that we take advantage of the naturally existing correlation between the readings produced by different sensors. in particular, we show how spatial correlation can be represented in the sensor network data model, and how it can be exploited to increase the resilience of data aggregation. The algorithms presented in this paper are flexible enough to be applied without any special assumption on the distribution of the sensor readings or on the strategy of the attacker. The effectiveness of the algorithms is evaluated analytically considering a typical attacker model with various parameters. and by means of simulation considering a sophisticated attacker. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "CORA: Correlation-based resilient aggregation in sensor networks", "paper_id": "WOS:000265858400001"}