{"auto_keywords": [{"score": 0.04160367592541749, "phrase": "communication_resources"}, {"score": 0.0355557666917359, "phrase": "presented_model"}, {"score": 0.00481495049065317, "phrase": "previous_works"}, {"score": 0.004751889650408546, "phrase": "agent_communication"}, {"score": 0.0046079260641779755, "phrase": "whole_agents"}, {"score": 0.0045877173513910055, "phrase": "distributed_area"}, {"score": 0.00439041997682389, "phrase": "communication_process"}, {"score": 0.004294962474996283, "phrase": "real_communication"}, {"score": 0.00355485940716082, "phrase": "related_works"}, {"score": 0.00346223706087128, "phrase": "cluster_partition-based_communication_model"}, {"score": 0.0028652153774536967, "phrase": "communication_costs"}, {"score": 0.0027417911324611917, "phrase": "different_clusters"}, {"score": 0.002693919110230191, "phrase": "closer_distances"}, {"score": 0.0024559368099486647, "phrase": "communication_frequencies"}, {"score": 0.002381365139274329, "phrase": "communication_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiagents", " Communication", " Cluster", " Partition", " Message-passing", " Blackboard communication", " Hub-agent"], "paper_abstract": "In previous works, the agent communication always takes place randomly through the whole agents distributed area, and all agents are treated equally in the communication process. However, the real communication is always imbalanced: communication in some places of the system may be very busy and the communication resources are insufficient, whereas in other places the communication may be very idle and the communication resources are redundant. To make up the shortage of related works, this paper presents a cluster partition-based communication model for multiagents. In the presented model, agents are divided into some clusters according to their communication frequencies: in each cluster, one agent is set to be hub-agent which carries the information of other agents within the cluster. With the presented model, the communication costs within the same cluster is lower than the one among different clusters because agents have closer distances within the same cluster: moreover, many real communication processes may take place within clusters since the clusters are partitioned according to the communication frequencies among agents. Therefore, the communication time and costs can be reduced by adopting our model. Finally, the advantage of our model is proved by a series of experiments. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Cluster partition-based communication of multiagents: The model and analyses", "paper_id": "WOS:000293872100009"}