{"auto_keywords": [{"score": 0.03207133518769957, "phrase": "flap"}, {"score": 0.010194166214381626, "phrase": "wlan"}, {"score": 0.00481495049065317, "phrase": "rapid_increase"}, {"score": 0.004759635663291431, "phrase": "wlan-enabled_mobile_devices"}, {"score": 0.004167218012926657, "phrase": "faster_access_authentication_method"}, {"score": 0.0037989951856280423, "phrase": "authentication_delay"}, {"score": 0.003503497128638102, "phrase": "main_reason"}, {"score": 0.003306559295382181, "phrase": "framework_perspective"}, {"score": 0.003066945490483524, "phrase": "efficient_initial_access_authentication_protocol"}, {"score": 0.002911278281894321, "phrase": "key_distribution"}, {"score": 0.0026846436189970446, "phrase": "four-way_handshake_protocol"}, {"score": 0.002518989593177879, "phrase": "eap-tls"}, {"score": 0.002461313735611462, "phrase": "extensive_simulations"}, {"score": 0.0024049552650867935, "phrase": "different_scenarios"}, {"score": 0.0021049977753042253, "phrase": "simple_and_practical_method"}], "paper_keywords": ["Authentication", " WLAN", " 802.11i"], "paper_abstract": "Nowadays, with the rapid increase of WLAN-enabled mobile devices and the more widespread use of WLAN, it is increasingly important to have a more efficient initial link setup mechanism, and there is a demand for a faster access authentication method faster than the current IEEE 802.11i. In this paper, through experiments we observe that the authentication delay of 802.11i is intolerable under some scenarios, and we point that the main reason resulting in such inefficiency is due to its design from the framework perspective which introduces too many messages. To overcome this drawback, we propose an efficient initial access authentication protocol, FLAP, which realizes the authentications and key distribution through two roundtrip messages. We formally prove that our scheme is more secure than the four-way handshake protocol. Our practical measurement result indicates that FLAP can improve the efficiency of EAP-TLS by 94.7 percent. Extensive simulations are conducted in different scenarios, and the results demonstrate that when a WLAN gets crowded the advantage of FLAP becomes more salient. Furthermore, a simple and practical method is presented to make FLAP compatible with 802.11i.", "paper_title": "FLAP: An Efficient WLAN Initial Access Authentication Protocol", "paper_id": "WOS:000329051500021"}