{"auto_keywords": [{"score": 0.04960298207468315, "phrase": "collaborative_knowledge_construction"}, {"score": 0.008713768692145013, "phrase": "situated_learning_environments"}, {"score": 0.004719664411221952, "phrase": "main_characteristics"}, {"score": 0.004565007074039171, "phrase": "authentic_contexts"}, {"score": 0.00450456611645112, "phrase": "expert_performances"}, {"score": 0.004474645041899596, "phrase": "integrated_assessment"}, {"score": 0.004415395176043526, "phrase": "multiple_roles"}, {"score": 0.004144452614362445, "phrase": "current_sles"}, {"score": 0.003737485125097945, "phrase": "learning_activities"}, {"score": 0.003381607100127276, "phrase": "qr_codes"}, {"score": 0.0032597581672236453, "phrase": "usergenerated_content"}, {"score": 0.0032272929113113203, "phrase": "\"bidirectional_sle"}, {"score": 0.0030799988391729464, "phrase": "equivalent_\"traditional_sle"}, {"score": 0.0030088845918380468, "phrase": "traditional_qr_codes"}, {"score": 0.0028907624732186373, "phrase": "bidirectional_qr_codes"}, {"score": 0.0028145947051539354, "phrase": "indoor_settings"}, {"score": 0.0027680095380207756, "phrase": "students'_learning_outcomes"}, {"score": 0.0027131212233443137, "phrase": "learning_experience"}, {"score": 0.002529421374791293, "phrase": "bidirectional_sle"}, {"score": 0.0024875444192203485, "phrase": "better_scores"}, {"score": 0.0024627509513027923, "phrase": "better_and_more_complete_answers"}, {"score": 0.0022579435307530944, "phrase": "teachers'_opinions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative learning", " Computer-mediated communication", " Improving classroom teaching", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "The main characteristics of situated learning environments (SLEs) are: to provide authentic contexts, activities, expert performances and integrated assessment; to support multiple roles and perspectives, collaborative knowledge construction, coaching and scaffolding; and to promote reflection and articulation. However, current SLEs have two limitations: (1) not all of these characteristics are included, particularly lacking collaborative knowledge construction, in most cases; and (2) most SLEs are designed to support learning activities outdoors, but not indoors. This paper presents the implementation of an SLE that overcomes these two limitations. This SLE is based on bidirectional Quick Response (QR) codes, which are enhanced QR codes that not only provide information when scanned but also collect usergenerated content. This \"Bidirectional SLE\" is evaluated in an experiment in which it is compared with an equivalent \"Traditional SLE\", which is built upon traditional QR codes. The purpose of this comparison is to understand if using bidirectional QR codes as a mechanism to support collaborative knowledge construction in indoor settings has an impact on students' learning outcomes and on their impression of the learning experience. Two hundred fifty-three students participated in this experiment. Data collected from this experiment indicate that the students who worked in the Bidirectional SLE (1) received better scores, providing better and more complete answers, and (2) evaluated their learning experience better than their peers' who worked in the Traditional SLE. Finally, a cross-analysis of these results including teachers' opinions led to a set of lessons learned about the design of SLEs to support collaborative knowledge construction. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Lessons learned from the design of situated learning environments to support collaborative knowledge construction", "paper_id": "WOS:000364253600007"}