{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "institutional_theory"}, {"score": 0.0041625173012740544, "phrase": "research_challenges"}, {"score": 0.004065348865695599, "phrase": "information_systems"}, {"score": 0.0036987521452843987, "phrase": "proposed_research"}, {"score": 0.003640938643675543, "phrase": "systematic_review"}, {"score": 0.0035699363258657212, "phrase": "normative_literature"}, {"score": 0.003378385493203297, "phrase": "pertinent_research_challenges"}, {"score": 0.0032350961776525075, "phrase": "cross-disciplinary_research"}, {"score": 0.00314708280192844, "phrase": "whole_new_research_paradigm"}, {"score": 0.0030254743224136273, "phrase": "bibliometric_analysis"}, {"score": 0.0029899137403982027, "phrase": "comprehensive_and_systematic_review"}, {"score": 0.0028743610212291727, "phrase": "current_'state"}, {"score": 0.002464709648714996, "phrase": "positivist_paradigm"}, {"score": 0.002445347925313158, "phrase": "empirical_and_quantitative_research"}, {"score": 0.00241658945942583, "phrase": "survey_method"}, {"score": 0.0021724831184390192, "phrase": "journal_editors"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": ["institutional theory", " institutionalisation", " institutionalism", " information systems research", " bibliometric analysis", " longitudinal literature review"], "paper_abstract": "There is a plethora of theories to explore the disciplines of business, management and sociology, with institutional theory being widely used to explore a range of research challenges. In the area of Information Systems (IS), the use of institutional theory remains in its infancy, with much potential for adoption. Much of the rationale underpinning the proposed research is that a systematic review and synthesis of the normative literature may support the direction of further research and the use of institutional theory in exploring pertinent research challenges facing the IS community. This study also serves to signpost cross-disciplinary research, and thus opens up a whole new research paradigm. Therefore, this article seeks to provide a bibliometric analysis and a comprehensive and systematic review of the literature pertaining to institutional theory to ascertain the current 'state of play' of the theory. Information on a series of variables was extracted after conducting a review of 511 articles across various disciplines that have utilised institutional theory, published in 210 peer-reviewed journals between 1978 and 2008. The findings suggest that the positivist paradigm, empirical and quantitative research, the survey method and organisation/firm as a unit of analysis was used predominantly in combination with institutional theory. The results of this study may have implications for researchers, journal editors, reviewers and universities. Journal of Information Technology (2009) 24, 354-368. doi: 10.1057/jit.2009.16 Published online 29 September 2009", "paper_title": "The diffusion and use of institutional theory: a cross-disciplinary longitudinal literature survey", "paper_id": "WOS:000271979200007"}