{"auto_keywords": [{"score": 0.048912784012203225, "phrase": "spatial_relations"}, {"score": 0.009031387772413014, "phrase": "robot_navigation"}, {"score": 0.007614632712228927, "phrase": "human_beings"}, {"score": 0.005306616641786362, "phrase": "topological_relations"}, {"score": 0.00481495049065317, "phrase": "topological_spatial_relations"}, {"score": 0.004775531918452571, "phrase": "autonomous_systems"}, {"score": 0.004527024978801684, "phrase": "mobile_robot"}, {"score": 0.004434910775034831, "phrase": "daily_life"}, {"score": 0.00430907756010007, "phrase": "navigation_algorithms"}, {"score": 0.004067977399245212, "phrase": "navigation_problem"}, {"score": 0.003665273232055329, "phrase": "htqs"}, {"score": 0.0030623570435946977, "phrase": "geographical_information_systems"}, {"score": 0.0030123335878664064, "phrase": "spatial_logics"}, {"score": 0.0026953359825383624, "phrase": "decision-making_methods"}, {"score": 0.002629539710839523, "phrase": "main_result"}, {"score": 0.0025972447844047515, "phrase": "new_heuristic"}, {"score": 0.0025338369486914364, "phrase": "topological_qualitative_semantics"}, {"score": 0.0021488235554917128, "phrase": "two-dimensional_virtual_environment"}, {"score": 0.0021049977753042253, "phrase": "new_door"}], "paper_keywords": ["qualitative navigation", " spatial relations", " Heuristic of Topological Qualitative Semantics"], "paper_abstract": "Human beings use spatial relations to describe many daily tasks in their language. For a mobile robot to be useful in daily life, it is necessary to have navigation algorithms capable of identifying and establishing spatial relations. To date in robotics, the navigation problem has been thoroughly researched as a task of guiding a robot from one spatial coordinate to another. Therefore, there is a difference in degree of abstraction between the language of human beings and the algorithms used in robot navigation. This article introduces a piece of research performed on the use of topological relations for the formalisation of spatial relations and navigation. So far, topological relations have been applied widely in geographical information systems and also in spatial logics. There are some proposals in robot navigation which use them for planning but there is no research about making decision in robot navigation. Our research focuses on decision-making methods to establish spatial relations. The main result is a new heuristic, called the Heuristic of Topological Qualitative Semantics (HTQS), which allows the identification and establishment of spatial relations decision-making from a set of actions. To demonstrate its effectiveness, HTQS has been implemented in the form of agents that can move in a two-dimensional virtual environment. HTQS opens a new door to designing algorithms for navigation based on the identification and establishment of spatial relations.", "paper_title": "On the identification and establishment of topological spatial relations by autonomous systems", "paper_id": "WOS:000340245700004"}