{"auto_keywords": [{"score": 0.044981716411280175, "phrase": "payment_protocol"}, {"score": 0.015719716506582538, "phrase": "generic_per-fee-link_framework"}, {"score": 0.01340656409576134, "phrase": "per-fee-link_framework"}, {"score": 0.008583752509094527, "phrase": "uniform_way"}, {"score": 0.008488383827233973, "phrase": "payment_protocols"}, {"score": 0.0046382670208947605, "phrase": "viable_approach"}, {"score": 0.003775803846431323, "phrase": "proposed_framework"}, {"score": 0.0033747739383101095, "phrase": "web_servers"}, {"score": 0.0030732440121850734, "phrase": "api"}, {"score": 0.0028728791908785517, "phrase": "epp"}, {"score": 0.0025198477493173187, "phrase": "end_users"}, {"score": 0.0021367960510499575, "phrase": "content_providers"}, {"score": 0.0021049977753042253, "phrase": "alternative_revenue_source"}], "paper_keywords": ["Payments", " Electronic funds transfer systems", " Internet", " Electronic commerce"], "paper_abstract": "Purpose - This paper aims to present a viable approach for designing and implementing a generic per-fee-link framework. It also aims to design this framework to be used with any payment protocol and test it with two existing ones. Design/methodology/approach - The paper presents a per-fee-link framework based on several generic components. These components have been developed and tested in order to prove the viability of the proposed framework. Findings - The results show that is possible to establish a per-fee-link framework. Four core components are defined: first, the different modules needed for browsers and web servers, second, an extended payment protocol (EPP), which negotiates the payment protocol to use and encapsulates its related messages, third, an API for e-wallets, which is independent of the payment protocol, to incorporate the protocols to use with EPP and finally, the definition of a per-fee-link that associates payment information to a link. Practical implications - The framework presented shows a uniform way of using payment protocols that can increase the trust of end users. Furthermore, it has been developed and tested. Originality/value - The contribution describes the components needed for supporting the framework. Its feasibility has been checked through an implementation and it facilitates the payment for content on the web. Thus, content providers can obtain an alternative revenue source to advertisement or subscription. Furthermore, developers, vendors and customers can see that the incorporation of payment protocols to the system is facilitated. Finally, the users obtain a uniform way to make payments that increases the perception of trust.", "paper_title": "Design and implementation of a generic per-fee-link framework", "paper_id": "WOS:000267790200004"}