{"auto_keywords": [{"score": 0.03609745911044454, "phrase": "identified_concerns"}, {"score": 0.00481495049065317, "phrase": "functional_and_non-functional_requirements"}, {"score": 0.004483272938890684, "phrase": "desired_systems"}, {"score": 0.004446496840860133, "phrase": "common_industrial_approach"}, {"score": 0.004410021079229461, "phrase": "widely_followed_research_topic"}, {"score": 0.004302371600216303, "phrase": "current_research_trend"}, {"score": 0.004162898387323015, "phrase": "existing_efforts"}, {"score": 0.004106121975261152, "phrase": "entire_problem"}, {"score": 0.004050116768809519, "phrase": "real_automation_process"}, {"score": 0.004005860884892539, "phrase": "composition_concerns"}, {"score": 0.003865328900538373, "phrase": "present_composition_concerns"}, {"score": 0.003802135020791801, "phrase": "compositional_approach"}, {"score": 0.0036286201767444922, "phrase": "proposed_approach"}, {"score": 0.0035594871529132195, "phrase": "current_composition_concerns"}, {"score": 0.0034916666462352893, "phrase": "existing_approaches"}, {"score": 0.0033970080655122965, "phrase": "solution_space"}, {"score": 0.003268767497941097, "phrase": "genetic_algorithm"}, {"score": 0.003251230480012547, "phrase": "ga"}, {"score": 0.003154012038613403, "phrase": "proposed_ga-based_approach"}, {"score": 0.0028255087014330683, "phrase": "case_studies"}, {"score": 0.002764021830539386, "phrase": "required_composite_services"}, {"score": 0.0026377570446517004, "phrase": "fitness_function"}, {"score": 0.0025034338848015166, "phrase": "all-inclusive_automatic_composer"}, {"score": 0.002469234247793194, "phrase": "human_intervention"}, {"score": 0.0024355006743908927, "phrase": "composition_process"}, {"score": 0.0023759346019385638, "phrase": "multiple_composition_concerns"}, {"score": 0.0023370335547240727, "phrase": "overall_functionality"}, {"score": 0.002163732292308364, "phrase": "previous_single-concern_composition"}, {"score": 0.002145942273032774, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Service composition", " Semantic web", " Quality of service", " Transaction", " Genetic algorithm"], "paper_abstract": "Context: in recent years, the composition of ready-made and loosely coupled services into desired systems is a common industrial approach and a widely followed research topic in academia. In the field, the current research trend is to automate this composition; however, each of the existing efforts automates only a component of the entire problem. Therefore, a real automation process that addresses all composition concerns is lacking. Objective: The objective is to first identify the present composition concerns and subsequently to devise a compositional approach that covers all concerns. Ultimately, we conduct a number of experiments to investigate the proposed approach. Method: We identify the current composition concerns by surveying and briefly describing the existing approaches. To include all of the identified concerns, the solution space that must be searched is highly dimensioned. Thus, we adopt a genetic algorithm (GA) due to its ability to solve problems with such characteristics. Proposed GA-based approach is designed with four unusual independent fitness functions. Additionally, experiments are carried out and discussions are presented for verification of the design, including the necessity for and correctness of the independence and priority of the four fitness functions. Results: The case studies demonstrate that our approach can automatically generate the required composite services and considers all identified concerns simultaneously. The results confirm the need for the independence of the fitness function and also identify a more efficient priority for these functions. Conclusions: In this study, we present an all-inclusive automatic composer that does not require human intervention and effort during the composition process and is designed for users who must address multiple composition concerns simultaneously, including requirements for overall functionality, internally workable dataflow, and non-functional transaction and quality-of-service considerations. Such multiple and complex composition requirements cannot be satisfied by any of the previous single-concern composition approaches. Crown Copyright (C) 2013 Published by Elsevier B.V. All rights reserved.", "paper_title": "Semantic-based automatic service composition with functional and non-functional requirements in design time: A genetic algorithm approach", "paper_id": "WOS:000331353000006"}