{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_agent_based_software"}, {"score": 0.0047738342278184865, "phrase": "related_decision_support"}, {"score": 0.004706082189342911, "phrase": "enhanced_knowledge"}, {"score": 0.0045734359584500206, "phrase": "facility_management"}, {"score": 0.004495641511172577, "phrase": "software_system"}, {"score": 0.004270074571192451, "phrase": "useful_knowledge"}, {"score": 0.004245717817867575, "phrase": "decision_support"}, {"score": 0.0041378132174467105, "phrase": "expert_users"}, {"score": 0.003841189987243716, "phrase": "multi_agent_society"}, {"score": 0.0037435277798679722, "phrase": "strong_notion"}, {"score": 0.003515087275495129, "phrase": "deliberative_agents"}, {"score": 0.00346513764367632, "phrase": "bdi_model"}, {"score": 0.003338554240844867, "phrase": "stable_way"}, {"score": 0.0033100034226848443, "phrase": "required_behaviour"}, {"score": 0.003107935254560724, "phrase": "agents'_goals"}, {"score": 0.0030462566137964267, "phrase": "distributed_network"}, {"score": 0.003028859354852274, "phrase": "readily_available_wired_and_wireless_sensors"}, {"score": 0.002951789443791314, "phrase": "real_time"}, {"score": 0.0029349301013192734, "phrase": "historical_data"}, {"score": 0.0027715286135219933, "phrase": "non-specialist_users"}, {"score": 0.0027321160319816458, "phrase": "ifc_specification"}, {"score": 0.002693262404213432, "phrase": "sensor_locations"}, {"score": 0.0025578967205807843, "phrase": "appropriate_roles"}, {"score": 0.002450291099666278, "phrase": "arbitrarily_sized_spaces"}, {"score": 0.00238107477384539, "phrase": "fm_decisions"}, {"score": 0.002242004757309484, "phrase": "missing_information"}, {"score": 0.0022101055924375725, "phrase": "practical_application"}, {"score": 0.0021600062298105776, "phrase": "expected_benefit"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi agent system", " BDI", " Ontology", " Sensors", " Semantics"], "paper_abstract": "To automatically deliver enhanced knowledge relating to building use, for tasks such as facility management (FM), a software system has been developed that exploits the combination of a number of technologies. As well as generating useful knowledge for decision support, the software aims to remove reliance on expert users, be self configuring, continually adapt to the environment, and employ learning to evolve its performance. The system is realised centrally by a multi agent society in which the agents are characterised by the strong notion of agency using the BDI (belief, desire, intention) model. In most existing applications in construction agents are task focussed rather than the goal focussed deliberative agents employed here. The BDI model is a 'natural' (human) abstraction for modelling complex systems, and goals are a stable way to define required behaviour. The agents are supported by a range of ontologies describing the semantics of the domain as well as aspects of agents' goals. Furthermore the agents utilise a distributed network of readily available wired and wireless sensors and associated data storage providing access to near real time and historical data, as well as an Industry Foundation Classes (IFC) model describing building geometry and construction. The system produced can be used by non-specialist users, simply requiring an IFC specification of the building and sensor locations. Agents infer the roles of the sensors from an ontology together with context, and assign appropriate roles. The agents individually and cooperatively work towards identifying the usage and dynamics of arbitrarily sized spaces in buildings. Such knowledge can be used to support FM decisions such as the optimisation of the energy consumption/environmental comfort demand trade-off. Negotiation is used to increase robustness as well as to fill in missing information. The limitations of practical application of the technologies that failed to deliver expected benefit are also detailed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Towards intelligent agent based software for building related decision support", "paper_id": "WOS:000290193700017"}