{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "trust_management_scheme"}, {"score": 0.048653361714131045, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.004442032546224076, "phrase": "wireless_transmission"}, {"score": 0.004223708778943785, "phrase": "multi-hop_paths"}, {"score": 0.004160319763461951, "phrase": "source_and_destination_nodes"}, {"score": 0.004036369952624852, "phrase": "physical_link"}, {"score": 0.003704797078215222, "phrase": "different_typologies"}, {"score": 0.003366233863411861, "phrase": "required_countermeasures"}, {"score": 0.0031366648074858555, "phrase": "digital_signatures"}, {"score": 0.003105168935158648, "phrase": "hash_chains"}, {"score": 0.0029672941061574375, "phrase": "fair_node"}, {"score": 0.002524688179363081, "phrase": "trust_value"}, {"score": 0.0023170054862555896, "phrase": "energy_consumption"}, {"score": 0.0022592313766072658, "phrase": "important_issue"}, {"score": 0.0022365262201954643, "phrase": "ad-hoc_networks"}], "paper_keywords": ["MANET", " Ad-hoc", " SAODV", " Security", " Black hole", " Gray hole", " Trust", " Energy", " Power", " Consumption"], "paper_abstract": "Nodes in mobile ad-hoc networks communicate each other using the wireless transmission. Many protocols have been proposed allowing the establishment of multi-hop paths to connect source and destination nodes. The absence of a physical link between the nodes and the multi-hop routing lead to a lack of security. Different typologies of attack effective against MANETs have been investigated thoroughly, and many solutions have been proposed to take the required countermeasures. Many of them are based on the cryptography, protecting data with digital signatures and hash chains, but they are not useful when a fair node is compromised later in time. Using a Trust Management Scheme can help in these situations, allowing to evaluate dynamically if a node is trustworthy or not. The computation of a trust value requires the monitoring of the interactions between nodes, therefore it has an effect on the energy consumption, which is an important issue of ad-hoc networks. Energy availability is limited for the nodes in a MANET, so the security measures that they adopt must not excessively increase the consumption.", "paper_title": "Evaluation of the Energy Consumption Introduced by a Trust Management Scheme on Mobile Ad-hoc Networks", "paper_id": "WOS:000358595600008"}