{"auto_keywords": [{"score": 0.0407565968812209, "phrase": "fixed_point"}, {"score": 0.02090181959157733, "phrase": "finite_metric_space"}, {"score": 0.010368971939210405, "phrase": "banach_fixed-point_theorem"}, {"score": 0.010178224553557255, "phrase": "contraction_mapping"}, {"score": 0.007919041575396212, "phrase": "randomized_algorithm"}, {"score": 0.006332832352050183, "phrase": "caristi-kirk_fixed-point_theorem"}, {"score": 0.00481495049065317, "phrase": "fixed_points"}, {"score": 0.004770211811866158, "phrase": "contraction_mappings"}, {"score": 0.004552648949390462, "phrase": "complete_metric_space"}, {"score": 0.004489327204473076, "phrase": "unique_fixed_point"}, {"score": 0.002410942838102255, "phrase": "m._d"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Contraction mapping principle", " Banach fixed-point theorem", " Caristi-Kirk fixed-point theorem", " Query complexity"], "paper_abstract": "The Banach fixed-point theorem states that a contraction mapping on a complete metric space has a unique fixed point. Given an oracle access to a finite metric space (M, d) and a contraction mapping f : M -> M on it, we show that the fixed point off can be found with an expected O(root vertical bar M vertical bar) oracle queries. We also show that every randomized algorithm for finding a fixed point must make an expected Omega(root vertical bar M vertical bar) oracle queries to (M, d) and f for some finite metric space (M, d) and some contraction mapping f : M -> M on it. As a generalization of the Banach fixed-point theorem, the Caristi-Kirk fixed-point theorem gives weaker conditions on (M. d) and f guaranteeing the existence of a fixed point off. We show that every randomized algorithm that finds a fixed point must make the expected Omega(vertical bar M vertical bar) oracle queries to (M. d) and f for some finite metric space (M, d) and some function f : M -> M satisfying the conditions of the Caristi-Kirk fixed-point theorem. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Optimal bounds on finding fixed points of contraction mappings", "paper_id": "WOS:000276167000007"}