{"auto_keywords": [{"score": 0.0380511703732204, "phrase": "similar_investigations"}, {"score": 0.03501952335331618, "phrase": "application_portfolio_upkeep"}, {"score": 0.00481495049065317, "phrase": "information_systems"}, {"score": 0.004706082189342911, "phrase": "first_sight"}, {"score": 0.00430687080979172, "phrase": "late_projects"}, {"score": 0.00428230507124341, "phrase": "unfulfilled_customer_demands"}, {"score": 0.003918900658052011, "phrase": "important_metrics"}, {"score": 0.003797475087069908, "phrase": "main_results"}, {"score": 0.003586234750004234, "phrase": "norway"}, {"score": 0.0034355943759682007, "phrase": "usa"}, {"score": 0.0032443276816348575, "phrase": "functional_coverage"}, {"score": 0.0032165800743224645, "phrase": "application_system_portfolio"}, {"score": 0.0031347485922104223, "phrase": "replacement_systems"}, {"score": 0.0029857983525658307, "phrase": "application_maintenance"}, {"score": 0.0028357713679488983, "phrase": "significant_increase"}, {"score": 0.002708737287949955, "phrase": "extra_maintenance"}, {"score": 0.002693262404213432, "phrase": "replacement-oriented_work"}, {"score": 0.0024999332729520084, "phrase": "slow_it-market"}, {"score": 0.00238107477384539, "phrase": "application_systems"}, {"score": 0.0023742613449123217, "phrase": "support_efficiency"}, {"score": 0.0023404848520465543, "phrase": "similar_explanation"}, {"score": 0.002254892677810906, "phrase": "last_surveys"}, {"score": 0.0022228105525693214, "phrase": "stable_level"}, {"score": 0.0021292712473618383, "phrase": "underlying_development_technologies"}, {"score": 0.0021049977753042253, "phrase": "large_changes"}], "paper_keywords": ["Application evolution", " Application maintenance", " Survey investigation"], "paper_abstract": "Context: The information systems we see around us today are at first sight very different from those that were developed 15 years ago and more. On the other hand, it seems that we are still struggling with many of the same problems, such as late projects and unfulfilled customer demands. Objective: The paper presents finding relative to the distribution of work between maintenance and development tasks, comparing to the results reported earlier to assess the stability of important metrics within the area. Method: This paper presents the main results of a survey-investigation performed in 2008 in 67 Norwegian organizations comparing the distribution of work to results from similar investigations performed in Norway in 1993, 1998, and 2003. Some comparisons to similar investigations performed in USA before this is also provided. Results: The amount of application portfolio upkeep (work made to keep up the functional coverage of the application system portfolio of the organization, including the development of replacement systems), is at the same level as reported in 1998 and 2003. The level of application maintenance is also on the same level as the similar investigations conducted in 2003 and 1998. There was a significant increase in both maintenance and application portfolio upkeep from 1993 to 1998, which could partly be attributed to be the extra maintenance and replacement-oriented work necessary to deal with the \"year 2000 problem\", but this seemed to be reversed in 2003 and 2008. As for the 2003 investigation, the slow IT-market in general seemed to have influenced the results negatively seen from the point of view of application systems support efficiency in organization. No similar explanation can be used for the 2008 numbers. Conclusion: Based on the last surveys it seems than a stable level of work distribution both on maintenance and application portfolio upkeep have been reached, although the underlying development technologies are still undergoing large changes. This is contrary to others claiming that the amount of maintenance is still increasing. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A longitudinal study of development and maintenance", "paper_id": "WOS:000278342600001"}