{"auto_keywords": [{"score": 0.041584008648741164, "phrase": "pll"}, {"score": 0.004492841495994535, "phrase": "low_power_application"}, {"score": 0.0038577428353448596, "phrase": "system_specifications"}, {"score": 0.0037177622939493084, "phrase": "individual_block"}, {"score": 0.0035994372026264478, "phrase": "dynamic_behavior"}, {"score": 0.003312121699003206, "phrase": "current_and_pole-zero_position"}, {"score": 0.0031918759137610523, "phrase": "supply_noise_suppression"}, {"score": 0.0030759821501544224, "phrase": "frequency_range"}, {"score": 0.002652878591019016, "phrase": "low_frequency_noise_uctuation"}, {"score": 0.0025802660239538353, "phrase": "proposed_structure"}, {"score": 0.0025096359514694523, "phrase": "loop_bandwidth"}, {"score": 0.002429668083484833, "phrase": "phase_margin"}, {"score": 0.002363150587804677, "phrase": "locking_time"}, {"score": 0.0022878396720586044, "phrase": "nominal_case"}, {"score": 0.0022563021343075134, "phrase": "vco"}, {"score": 0.0022355167967736326, "phrase": "better_power_supply_rejection_ratio"}], "paper_keywords": ["PLL", " 60 GHz", " millimeter-wave"], "paper_abstract": "The paper proposes a CMOS 65 nm 24 GHz wide-band frequency synthesizer with programmability on acquisition speed and supply voltage for low power application in 60 GHz millimeter-wave (mmW) wireless transceiver. The role of mmW phase-locked loop (PLL) is significant for supporting 7 GHz bandwidth across the four channels in IEEE 802.15.3c. The PLL is introduced with consideration of system specifications, as well as the design of individual block. In order to maintain the dynamic behavior of a PLL, two control parameters of its loop transfer function are used for programmability, including the charge pump current and pole-zero position. A regulator is also adopted for supply noise suppression. The Voltage-Controlled Oscillator (VCO) covers frequency range from 24.2 to 29.3 GHz, with 19.1% tuning range. On top of the oscillator, a 1.2V LDO (Low-Dropout Regulator) with 0.2V dropout voltage is introduced to increase the immunity against low frequency noise uctuation from supply. With the proposed structure, the PLL provides a loop bandwidth from 0.94 to 2.05 MHz. The phase margin is larger than 54 degrees and the locking time can be adjusted 16% faster than nominal case. The VCO has better power supply rejection ratio (PSRR) of -48 dB, and Phase Noise of -94 dBc/Hz at 1 MHz frequency offset of 24 GHz.", "paper_title": "A PROGRAMMABLE 1-V CMOS 65 nm FREQUENCY SYNTHESIZER DESIGN IN 60 GHz WIRELESS TRANSCEIVER", "paper_id": "WOS:000312458700002"}