{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emotional_responses"}, {"score": 0.022209198575309397, "phrase": "personal_devices"}, {"score": 0.010233978785744394, "phrase": "cultural_heritage_artefacts"}, {"score": 0.004727837281331949, "phrase": "younger_adults"}, {"score": 0.004496280772084575, "phrase": "advanced_software"}, {"score": 0.0038849148160362257, "phrase": "unique_situation"}, {"score": 0.003814563533445401, "phrase": "digital_artefact"}, {"score": 0.0037626342268042997, "phrase": "physical_artefact"}, {"score": 0.0035294580355761506, "phrase": "user's_ability"}, {"score": 0.003310684108128973, "phrase": "young_adults"}, {"score": 0.002610043728801011, "phrase": "digital_modalities"}, {"score": 0.0025047659706737215, "phrase": "physical_artefacts"}, {"score": 0.0024706232839499546, "phrase": "digital_ones"}, {"score": 0.0021049977753042253, "phrase": "older_and_younger_people"}], "paper_keywords": ["augmented reality", " 3D", " elderly people", " young adults", " emotion", " cultural heritage museum artefacts"], "paper_abstract": "The availability of advanced software and less expensive hardware allows museums to preserve and share artefacts digitally. As a result, museums are frequently making their collections accessible online as interactive, 3D models. This could lead to the unique situation of viewing the digital artefact before the physical artefact. Experiencing artefacts digitally outside of the museum on personal devices may affect the user's ability to emotionally connect to the artefacts. This study examines how two target populations of young adults (18-21 years) and the elderly (65 years and older) responded to seeing cultural heritage artefacts in three different modalities: augmented reality on a tablet, 3D models on a laptop, and then physical artefacts. Specifically, the time spent, enjoyment, and emotional responses were analysed. Results revealed that regardless of age, the digital modalities were enjoyable and encouraged emotional responses. Seeing the physical artefacts after the digital ones did not lessen their enjoyment or emotions felt. These findings aim to provide an insight into the effectiveness of 3D artefacts viewed on personal devices and artefacts shown outside of the museum for encouraging emotional responses from older and younger people.", "paper_title": "Comparison of engagement and emotional responses of older and younger adults interacting with 3D cultural heritage artefacts on personal devices", "paper_id": "WOS:000361961100004"}