{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single-relational_network_analysis_algorithms"}, {"score": 0.046866659551594476, "phrase": "single-relational_networks"}, {"score": 0.03689565391010681, "phrase": "multi-relational_network"}, {"score": 0.03528043552464216, "phrase": "edge_labels"}, {"score": 0.03298470971482172, "phrase": "multi-relational_networks"}, {"score": 0.003887894704361635, "phrase": "\"_\"kinship"}, {"score": 0.0037989951856280423, "phrase": "\"_collaboration"}, {"score": 0.0033839745649214548, "phrase": "heterogeneous_set"}, {"score": 0.0031753062090452864, "phrase": "single_data_structure"}, {"score": 0.0027634902834910184, "phrase": "general_framework"}, {"score": 0.0024756080101497086, "phrase": "single-relational_network_analysis_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-relational networks", " Path algebra", " Network analysis"], "paper_abstract": "Many, if not most network analysis algorithms have been designed specifically for single-relational networks; that is, networks in which all edges are of the same type. For example, edges may either represent \"friendship,\" \"kinship,\" or \" collaboration,\" but not all of them together. In contrast, a multi-relational network is a network with a heterogeneous set of edge labels which can represent relationships of various types in a single data structure. While multi-relational networks are more expressive in terms of the variety of relationships they can capture, there is a need for a general framework for transferring the many single-relational network analysis algorithms to the multi-relational domain. It is not sufficient to execute a single-relational network analysis algorithm on a multi-relational network by simply ignoring edge labels. This article presents an algebra for mapping multi-relational networks to single-relational networks, thereby exposing them to single-relational network analysis algorithms. Published by Elsevier Ltd.", "paper_title": "Exposing multi-relational networks to single-relational network analysis algorithms", "paper_id": "WOS:000272631100004"}