{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eddy_and_meridian_fields"}, {"score": 0.03596176205294269, "phrase": "electric_currents"}, {"score": 0.004721162131188487, "phrase": "purpose_-_the_purpose"}, {"score": 0.004539005582217309, "phrase": "general_systemic_yoyo_model"}, {"score": 0.004450568197899267, "phrase": "electric_fields"}, {"score": 0.004406994912939125, "phrase": "magnetic_fields"}, {"score": 0.0037463983616303786, "phrase": "first_law"}, {"score": 0.003496868378204657, "phrase": "systemic_yoyo_models"}, {"score": 0.0033617891884360606, "phrase": "induced_magnetic_fields"}, {"score": 0.0032160319265621285, "phrase": "yoyo_structures"}, {"score": 0.0031845067058084613, "phrase": "permanent_magnets"}, {"score": 0.0031070348334684356, "phrase": "magnetic_field"}, {"score": 0.0025638362414466278, "phrase": "current_technology"}, {"score": 0.0025137856138000014, "phrase": "quark_structures"}, {"score": 0.002357755095722877, "phrase": "positive_electric_fields"}, {"score": 0.0021049977753042253, "phrase": "electric_and_magnetic_fields"}], "paper_keywords": ["Cybernetics", " Systems theory", " Magnetic fields", " Electric field effects"], "paper_abstract": "Purpose - The purpose of this paper is to use the general systemic yoyo model to illustrate why electric fields and magnetic fields can manifest each other and interact with each other. Design/methodology/approach - The coordinated interaction of eddy and meridian fields of spinning yoyos is employed as our methodology for the investigation in this paper. At the end, the First Law on State of Motion is beautifully utilized. Findings - Among many new theoretical discoveries, systemic yoyo models are provided to understand electric currents and the induced magnetic fields, which lead to a distinction between the yoyo structures of permanent magnets and those of the magnetic field induced by electric currents. It is theoretically shown why all fields in nature, such as electric, magnetic, universal, gravitational, and nuclear fields, have to exist in pairs of opposite polarities, even though one polarity might not be visible or recognizable with the current technology. Using the quark structures of spinning yoyos, an explanation is provided for why protons carry positive electric fields, while neutrons are electrically neutral. Originality/value - One of the originalities of this paper is about its unified theory underlying many observed phenomena of electric and magnetic fields.", "paper_title": "Manifestation of eddy and meridian fields of systems", "paper_id": "WOS:000277539100008"}