{"auto_keywords": [{"score": 0.04612486299870857, "phrase": "possible_agreements"}, {"score": 0.004673079747693193, "phrase": "automated_negotiations"}, {"score": 0.004586531354697466, "phrase": "bilateral_negotiations"}, {"score": 0.004552360432689039, "phrase": "linear_utility_functions"}, {"score": 0.004146015717402716, "phrase": "new_family"}, {"score": 0.0041151131903594445, "phrase": "negotiation_algorithms"}, {"score": 0.003964007795174772, "phrase": "intractably_large_space"}, {"score": 0.003905124669323623, "phrase": "non-linear_utility_functions"}, {"score": 0.0038041680562514064, "phrase": "best_proposals"}, {"score": 0.003275197814021, "phrase": "good_proposals"}, {"score": 0.003073216350080926, "phrase": "new_time-based_negotiation_strategy"}, {"score": 0.0028514344213899177, "phrase": "negotiation_protocol"}, {"score": 0.0028195727965553367, "phrase": "almost_no_restrictions"}, {"score": 0.002675516297446243, "phrase": "negotiating_salesmen_problem"}, {"score": 0.0025868090345615197, "phrase": "traveling_salesman_problem"}, {"score": 0.002567498166608835, "phrase": "multiple_negotiating_agents"}, {"score": 0.00252930673503721, "phrase": "test_case"}, {"score": 0.0024363003434401537, "phrase": "nsp"}, {"score": 0.002185394402074883, "phrase": "heuristic_search"}, {"score": 0.0021049977753042253, "phrase": "increasing_complexity"}], "paper_keywords": ["Multilateral", " Negotiation", " Search", " Non-linear utility", " Negotiating Salesmen Problem"], "paper_abstract": "Existing work on automated negotiations has mainly focused on bilateral negotiations with linear utility functions. It is often assumed that all possible agreements and their utility values are given beforehand. Most real-world negotiations however are much more complex. We introduce a new family of negotiation algorithms that is applicable to domains with many agents, an intractably large space of possible agreements, non-linear utility functions and limited time so an exhaustive search for the best proposals is not feasible. We assume that agents are selfish and cannot be blindly trusted, so the algorithm does not rely on any mediator. This family of algorithms is called and applies heuristic Branch & Bound search to find good proposals. Search and negotiation happen simultaneously and therefore strongly influence each other. It applies a new time-based negotiation strategy that considers two utility aspiration levels: one for the agent itself and one for its opponents. Also, we introduce a negotiation protocol that imposes almost no restrictions and is therefore better applicable to negotiations with humans. We present the Negotiating Salesmen Problem (NSP): a variant of the Traveling Salesman Problem with multiple negotiating agents, as a test case. We describe an implementation of designed for the NSP and present the results of experiments with this implementation. We conclude that the algorithm is able to decrease the costs of the agents significantly, that the heuristic search is efficient and that the algorithm scales well with increasing complexity of the problem.", "paper_title": "NB3: a multilateral negotiation algorithm for large, non-linear agreement spaces with limited time", "paper_id": "WOS:000357652000006"}