{"auto_keywords": [{"score": 0.03730261066449261, "phrase": "active_tags"}, {"score": 0.01332656090043207, "phrase": "large_area"}, {"score": 0.011965321767357219, "phrase": "rfid_reader"}, {"score": 0.00481495049065317, "phrase": "rfid_estimation_problem"}, {"score": 0.004777744121315302, "phrase": "radio_frequency_identification"}, {"score": 0.004613825044585923, "phrase": "inventory_control"}, {"score": 0.004154932620016237, "phrase": "rfid"}, {"score": 0.004012271808564447, "phrase": "inventory_management"}, {"score": 0.003981243132108877, "phrase": "theft_detection"}, {"score": 0.003874512990986722, "phrase": "time-efficient_algorithms"}, {"score": 0.0032786537599187125, "phrase": "information_transmission"}, {"score": 0.003228101865545105, "phrase": "recharging_batteries"}, {"score": 0.003010063382882408, "phrase": "prior_works"}, {"score": 0.002940697344380201, "phrase": "energy_expenditure"}, {"score": 0.002861782260525497, "phrase": "tag_ids"}, {"score": 0.002248863090203165, "phrase": "time_efficiency"}, {"score": 0.002188472974132732, "phrase": "contention_probability_parameter_omega"}, {"score": 0.002163089417146551, "phrase": "new_algorithms"}, {"score": 0.0021214346747442363, "phrase": "energy_cost"}, {"score": 0.0021049977753042253, "phrase": "estimation_time"}], "paper_keywords": ["Radio frequency identification (RFID) tags"], "paper_abstract": "Radio frequency identification (RFID) has been gaining popularity for inventory control, object tracking, and supply-chain management in warehouses, retail stores, hospitals, etc. Periodically and automatically estimating the number of RFID tags deployed in a large area has many important applications in inventory management and theft detection. Prior works focus on designing time-efficient algorithms that can estimate tens of thousands of tags in seconds. We observe that for an RFID reader to access tags in a large area, active tags are likely to be used due to their longer operational ranges. These tags are battery-powered and use their own energy for information transmission. However, recharging batteries for tens of thousands of tags is laborious. Hence, conserving energy for active tags becomes critical. Some prior works have studied how to reduce energy expenditure of an RFID reader when it reads tag IDs. We study how to reduce the amount of energy consumed by active tags during the process of estimating the number of tags in a system. We design two energy-efficient probabilistic estimation algorithms that iteratively refine a control parameter to optimize the information carried in transmissions from tags, such that both the number and the size of transmissions are reduced. These algorithms can also take time efficiency into consideration. By tuning a contention probability parameter omega, the new algorithms can make tradeoff between energy cost and estimation time.", "paper_title": "Generalized Energy-Efficient Algorithms for the RFID Estimation Problem", "paper_id": "WOS:000313661000023"}