{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "crop_rotations"}, {"score": 0.015547084727554788, "phrase": "climate_impact_assessments"}, {"score": 0.010669657393163699, "phrase": "continuous_rotations"}, {"score": 0.004579005794486596, "phrase": "canterbury_plains"}, {"score": 0.004528156929805637, "phrase": "new_zealand"}, {"score": 0.004354572391793908, "phrase": "single_crops"}, {"score": 0.004306205029641728, "phrase": "re-initialised_soil_conditions"}, {"score": 0.0041642891310893, "phrase": "multiple_crops"}, {"score": 0.0037869901077566526, "phrase": "multi-crop_systems"}, {"score": 0.0036826452656927877, "phrase": "apsim_model"}, {"score": 0.002784540221128404, "phrase": "impact_variable"}, {"score": 0.0026478260192958924, "phrase": "detailed_simulations"}, {"score": 0.002475898613632249, "phrase": "soil-related_variables"}, {"score": 0.0024346858809238766, "phrase": "growth_conditions"}, {"score": 0.0023021895404322767, "phrase": "large_scale_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["APSIM", " Climate change", " Crop modelling", " Crop rotation"], "paper_abstract": "Most climate impact assessments for food production simulate single crops with re-initialised soil conditions. However, crop rotations with multiple crops are used in many agricultural regions worldwide. This case-study compares methods to aggregate outputs from simulations of multi-crop systems for climate impact assessments. The APSIM model was used to simulate four crops as monocultures (reinitialised or continuous) or as (single or multiple) instances of continuous rotations. We considered two contrasting climates and two soil types, with four production intensification scenarios (high/low water and nitrogen input). Results suggest that differences among the methods depend on the impact variable of interest and the degree of intensification. Detailed simulations (i.e. multiple runs of continuous rotations) were especially valuable for soil-related variables and limiting growth conditions. These results can indicate sources of uncertainty for large scale impact and adaptation assessments where simplifications of crop rotations are often necessary. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating methods to simulate crop rotations for climate impact assessments - A case study on the Canterbury plains of New Zealand", "paper_id": "WOS:000361906400027"}