{"auto_keywords": [{"score": 0.0496208907638229, "phrase": "subject_categorization"}, {"score": 0.04761249774253216, "phrase": "scopus"}, {"score": 0.010945710383657754, "phrase": "rank_normalized_impact_factor"}, {"score": 0.00481495049065317, "phrase": "scientific_impact"}, {"score": 0.004208881856146758, "phrase": "information_science"}, {"score": 0.003992129945230457, "phrase": "web_of_science"}, {"score": 0.003714368305523811, "phrase": "prestige_factor_scores"}, {"score": 0.003262035294895737, "phrase": "congress_classification_system"}, {"score": 0.0031845067058084583, "phrase": "impact_rankings"}, {"score": 0.0030938932434437178, "phrase": "high_degree"}, {"score": 0.0029627701619228527, "phrase": "wos_and_scopus_databases"}, {"score": 0.002716915166374506, "phrase": "normalized_impact_scores"}, {"score": 0.002690886043654469, "phrase": "higher_impact_scores"}, {"score": 0.0023178219772486868, "phrase": "z_subject_headings"}, {"score": 0.002198242191529977, "phrase": "journal_title_rankings"}, {"score": 0.0021049977753042253, "phrase": "journal_titles"}], "paper_keywords": ["Journal studies", " Journal impact", " Journal ranking", " Library and Information Science", " Bibliometrics", " Rank normalized impact factor"], "paper_abstract": "The study compares the coverage, ranking, impact and subject categorization of Library and Information Science journals, specifically, 79 titles based on data from Web of Science (WoS) and 128 titles from Scopus. Comparisons were made based on prestige factor scores reported in 2010 Journal Citation Reports and SCImago Journal Rank 2010 and noting the change in ranking when the differences are calculated. The rank normalized impact factor and the Library of Congress Classification System were used to compare impact rankings and subject categorization. There was high degree of similarity in rank normalized impact factor of titles in both WoS and Scopus databases. The searches found 162 journals, with 45 journals appearing in both databases. The rankings obtained for normalized impact scores confirm higher impact scores for titles covered in Scopus because of its larger coverage of titles. There was mismatch of subject categorization among 34 journal titles in both databases and 22 of the titles were not classified under Z subject headings in the Library of Congress catalogue. The results revealed the changes in journal title rankings when normalized, and the categorization of some journal titles in these databases might be incorrect.", "paper_title": "LIS journals scientific impact and subject categorization: a comparison between Web of Science and Scopus", "paper_id": "WOS:000313711500017"}