{"auto_keywords": [{"score": 0.04335391514101077, "phrase": "credit_risk_assessment"}, {"score": 0.04216963153037969, "phrase": "elm"}, {"score": 0.00481495049065317, "phrase": "extreme_learning_machines'_ensemble_selection"}, {"score": 0.0047842129415024475, "phrase": "grasp._credit"}, {"score": 0.0043181530164057135, "phrase": "greedy_randomized_adaptive_search_procedure"}, {"score": 0.00396027311392058, "phrase": "base_learner"}, {"score": 0.003934970057482768, "phrase": "elmsgraspens"}, {"score": 0.0038600230206554792, "phrase": "extremely_fast_learning_speed"}, {"score": 0.0038353580177342118, "phrase": "good_generalization_performance"}, {"score": 0.003750260412839128, "phrase": "local_minima"}, {"score": 0.0036203204049740575, "phrase": "local_optima_problem"}, {"score": 0.0035856674209019234, "phrase": "classical_greedy_ensemble_selection_methods"}, {"score": 0.0035400096644478303, "phrase": "grasp"}, {"score": 0.0034172979799535386, "phrase": "combinatorial_optimization_problems"}, {"score": 0.003352177553279243, "phrase": "ensemble_selection"}, {"score": 0.003298856341173034, "phrase": "ensemble_selection_algorithm"}, {"score": 0.0031845067058084583, "phrase": "graspens_algorithm"}, {"score": 0.0030741085942960814, "phrase": "random_factor"}, {"score": 0.0029866270401697906, "phrase": "local_optima"}, {"score": 0.0029109517286657486, "phrase": "multi-start_search"}, {"score": 0.0028281000453392272, "phrase": "better_performing_subensemble"}, {"score": 0.0026952068955816266, "phrase": "credit_scoring"}, {"score": 0.002511481545937323, "phrase": "novel_ensemble_selection_algorithm"}, {"score": 0.00241658945942583, "phrase": "inherent_advantages"}, {"score": 0.0023857603808363527, "phrase": "graspens"}, {"score": 0.0023327506323251074, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "relatively_high_efficiency"}], "paper_keywords": ["Credit risk assessment", " Ensemble selection", " Extreme learning machine (ELM)", " Greedy randomized adaptive search procedure (GRASP)", " Ensemble selection algorithm based on GRASP (GraspEnS)", " ELMs' ensemble selection algorithm with GRASP (ELMsGraspEnS)"], "paper_abstract": "Credit scoring, which is also called credit risk assessment has attracted the attention of many financial institutions and much research has been carried out. In this work, a new Extreme Learning Machines' (ELMs) Ensemble Selection algorithm based on the Greedy Randomized Adaptive Search Procedure (GRASP), referred to as ELMsGraspEnS, is proposed for credit risk assessment of enterprises. On the one hand, the ELM is used as the base learner for ELMsGraspEnS owing to its significant advantages including an extremely fast learning speed, good generalization performance, and avoidance of issues like local minima and overfitting. On the other hand, to ameliorate the local optima problem faced by classical greedy ensemble selection methods, we incorporated GRASP, a meta-heuristic multi-start algorithm for combinatorial optimization problems, into the solution of ensemble selection, and proposed an ensemble selection algorithm based on GRASP (GraspEnS) in our previous work. The GraspEnS algorithm has the following three advantages. (1) By incorporating a random factor, a solution is often able to escape local optima. (2) GraspEnS realizes a multi-start search to some degree. (3) A better performing subensemble can usually be found with GraspEnS. Moreover, not much research on applying ensemble selection approaches to credit scoring has been reported in the literature. In this paper, we integrate the ELM with GraspEnS, and propose a novel ensemble selection algorithm based on GRASP (ELMsGraspEnS). ELMsGraspEnS naturally inherits the inherent advantages of both the ELM and GraspEnS, effectively combining their advantages. The experimental results of applying ELMsGraspEnS to three benchmark real world credit datasets show that in most cases ELMsGraspEnS significantly improves the performance of credit risk assessment compared with several state-of-the-art algorithms. Thus, it can be concluded that ELMsGraspEnS simultaneously exhibits relatively high efficiency and effectiveness.", "paper_title": "Extreme learning machines' ensemble selection with GRASP", "paper_id": "WOS:000358314000013"}