{"auto_keywords": [{"score": 0.0489853873227799, "phrase": "chlorophyll"}, {"score": 0.00481495049065317, "phrase": "low-power_spatial_architectures"}, {"score": 0.0034036089823450385, "phrase": "low-level_stack-based_language"}, {"score": 0.0032122679403131568, "phrase": "human_insight"}, {"score": 0.003156984631072011, "phrase": "partial_partitioning"}, {"score": 0.003031650815900696, "phrase": "chlorophyll_compiler"}, {"score": 0.002861160152640875, "phrase": "classical_optimizations"}, {"score": 0.00273167822885383, "phrase": "unusual_architecture"}, {"score": 0.0026384167183586015, "phrase": "real_problems"}, {"score": 0.0025336179740814905, "phrase": "smaller_synthesis"}, {"score": 0.0023228223366301226, "phrase": "synthesized_programs"}, {"score": 0.0022176487309947266, "phrase": "highly_optimized_expert-written_programs"}], "paper_keywords": ["Program Synthesis", " Spatial Architectures"], "paper_abstract": "We developed Chlorophyll, a synthesis-aided programming model and compiler for the GreenArrays GA144, an extremely minimalist low-power spatial architecture that requires partitioning the program into fragments of no more than 256 instructions and 64 words of data. This processor is 100-times more energy efficient than its competitors, but currently can only be programmed using a low-level stack-based language. The Chlorophyll programming model allows programmers to provide human insight by specifying partial partitioning of data and computation. The Chlorophyll compiler relies on synthesis, sidestepping the need to develop classical optimizations, which may be challenging given the unusual architecture. To scale synthesis to real problems, we decompose the compilation into smaller synthesis subproblems-partitioning, layout, and code generation. We show that the synthesized programs are no more than 65% slower than highly optimized expert-written programs and are faster than programs produced by a heuristic, non-synthesizing version of our compiler.", "paper_title": "Chlorophyll: Synthesis-Aided Compiler for Low-Power Spatial Architectures", "paper_id": "WOS:000344455800042"}