{"auto_keywords": [{"score": 0.04939619318571274, "phrase": "multiagent_systems"}, {"score": 0.011739877197915069, "phrase": "malicious_agents"}, {"score": 0.008713768692145006, "phrase": "dynamic_trust_computation_model"}, {"score": 0.008651636822276716, "phrase": "secured_communication"}, {"score": 0.00471228691115201, "phrase": "security_and_privacy_issues"}, {"score": 0.004702757708341231, "phrase": "different_factors"}, {"score": 0.004595263305771512, "phrase": "fast_expansion"}, {"score": 0.004481132747216135, "phrase": "pervasive_computing"}, {"score": 0.004449045430179066, "phrase": "grid_computing"}, {"score": 0.0037845987749316632, "phrase": "interacting_agents"}, {"score": 0.003509317669345521, "phrase": "unpredictable_way"}, {"score": 0.003385336776758738, "phrase": "quick_response"}, {"score": 0.0033490008882413103, "phrase": "malicious_agent's_oscillating_behavior"}, {"score": 0.0032075033252058835, "phrase": "good_service_quality"}, {"score": 0.0031730701021262155, "phrase": "even_distribution"}, {"score": 0.002931569771634119, "phrase": "strategically_altering_behavior"}, {"score": 0.0028076592725295646, "phrase": "service_providers"}, {"score": 0.0026986685585382347, "phrase": "securedtrust"}, {"score": 0.00247529638625566, "phrase": "comprehensive_quantitative_model"}, {"score": 0.002396371892825691, "phrase": "novel_load-balancing_algorithm"}, {"score": 0.0023199580436336163, "phrase": "simulation_results"}, {"score": 0.0022298571016688335, "phrase": "strategic_behavioral_change"}, {"score": 0.0021049977753042253, "phrase": "stable_condition"}], "paper_keywords": ["Multiagent system", " trust management", " reputation model", " load balancing", " malicious behavior"], "paper_abstract": "Security and privacy issues have become critically important with the fast expansion of multiagent systems. Most network applications such as pervasive computing, grid computing, and P2P networks can be viewed as multiagent systems which are open, anonymous, and dynamic in nature. Such characteristics of multiagent systems introduce vulnerabilities and threats to providing secured communication. One feasible way to minimize the threats is to evaluate the trust and reputation of the interacting agents. Many trust/reputation models have done so, but they fail to properly evaluate trust when malicious agents start to behave in an unpredictable way. Moreover, these models are ineffective in providing quick response to a malicious agent's oscillating behavior. Another aspect of multiagent systems which is becoming critical for sustaining good service quality is the even distribution of workload among service providing agents. Most trust/reputation models have not yet addressed this issue. So, to cope with the strategically altering behavior of malicious agents and to distribute workload as evenly as possible among service providers; we present in this paper a dynamic trust computation model called \"SecuredTrust.\" In this paper, we first analyze the different factors related to evaluating the trust of an agent and then propose a comprehensive quantitative model for measuring such trust. We also propose a novel load-balancing algorithm based on the different factors defined in our model. Simulation results indicate that our model compared to other existing models can effectively cope with strategic behavioral change of malicious agents and at the same time efficiently distribute workload among the service providing agents under stable condition.", "paper_title": "SecuredTrust: A Dynamic Trust Computation Model for Secured Communication in Multiagent Systems", "paper_id": "WOS:000299280300010"}