{"auto_keywords": [{"score": 0.04240865937650944, "phrase": "feed_intake"}, {"score": 0.00481495049065317, "phrase": "within-day_cumulative_intake_patterns"}, {"score": 0.0042178318724732005, "phrase": "meal_criteria"}, {"score": 0.003832031470970347, "phrase": "new_method"}, {"score": 0.0035781807623238905, "phrase": "obtained_characteristics"}, {"score": 0.003465521267039616, "phrase": "healthy_animals"}, {"score": 0.003310684108128973, "phrase": "proposed_method"}, {"score": 0.0031917943932454314, "phrase": "segmentation_method"}, {"score": 0.003021392767766593, "phrase": "kinetic_representing_changes"}, {"score": 0.0029802289354540507, "phrase": "feeding_behaviour"}, {"score": 0.0028731719610706214, "phrase": "eight_groups"}, {"score": 0.0028210902750714075, "phrase": "intake_rate"}, {"score": 0.002551022760887132, "phrase": "individual_crates"}, {"score": 0.0024481198073210567, "phrase": "present_analysis"}, {"score": 0.0024147474002390785, "phrase": "ruminal_perturbations"}, {"score": 0.0023386327847292805, "phrase": "feeding_pattern"}], "paper_keywords": ["Intake", " Goats", " Acidosis", " Segmentation", " Clustering"], "paper_abstract": "Studying feeding behaviour of ruminants often implies the definition of eating bouts or the characterisation of meals. However, due to the difficulties encountered to define meal criteria there is a need for other ways of analysing feed intake. The aim of this paper was firstly to develop a new method to analyse feed intake without the need to define meals and secondly to use the obtained characteristics of the kinetic to discriminate between healthy animals and animals suffering from bouts of acidosis. The proposed method is broken down into two steps: a segmentation method is proposed first to detect changes in the slope of the kinetic representing changes in the feeding behaviour. Secondly, all the segments were clustered in eight groups according to the intake rate measured within the segment. This method was applied to the analysis of 15 h intake kinetics automatically recorded every 2 min in 12 goats in individual crates, during a period of 46 days. The present analysis showed that ruminal perturbations (acidosis) could influence the feeding pattern of goats and that it was possible to differentiate animals experiencing or not a bout of acidosis, through their feeding behaviour. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A new segmentation-clustering method to analyse feeding behaviour of ruminants from within-day cumulative intake patterns", "paper_id": "WOS:000303220900013"}