{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "query_expansion"}, {"score": 0.01051092630300886, "phrase": "query-biased_summaries"}, {"score": 0.00456571874088313, "phrase": "search_system"}, {"score": 0.004165105357908494, "phrase": "sentence_ranking_approach"}, {"score": 0.003987755561492638, "phrase": "sentence-level_relevance_assessments"}, {"score": 0.00393032656248792, "phrase": "trec_novelty"}, {"score": 0.0037087324991876727, "phrase": "vocabulary_mismatch_problem"}, {"score": 0.0036730297909962142, "phrase": "informational_requests"}, {"score": 0.0036201167891046046, "phrase": "ranking_methods"}, {"score": 0.003516558537200823, "phrase": "intrinsic_evaluation_show"}, {"score": 0.0033830587647810132, "phrase": "short_relevant_sentences"}, {"score": 0.002954361295811154, "phrase": "separate_crowdsourcing_study"}, {"score": 0.0023644936731468252, "phrase": "unexpanded_query"}, {"score": 0.0023079225317714815, "phrase": "query_expansion_techniques"}, {"score": 0.0021566056345478373, "phrase": "summary_level"}, {"score": 0.0021049977753042253, "phrase": "sentence_ranking_level"}], "paper_keywords": [""], "paper_abstract": "Query-biased summaries help users to identify which items returned by a search system should be read in full. In this article, we study the generation of query-biased summaries as a sentence ranking approach, and methods to evaluate their effectiveness. Using sentence-level relevance assessments from the TREC Novelty track, we gauge the benefits of query expansion to minimize the vocabulary mismatch problem between informational requests and sentence ranking methods. Our results from an intrinsic evaluation show that query expansion significantly improves the selection of short relevant sentences (5-13 words) between 7% and 11%. However, query expansion does not lead to improvements for sentences of medium (14-20 words) and long (21-29 words) lengths. In a separate crowdsourcing study, we analyze whether a summary composed of sentences ranked using query expansion was preferred over summaries not assisted by query expansion, rather than assessing sentences individually. We found that participants chose summaries aided by query expansion around 60% of the time over summaries using an unexpanded query. We conclude that query expansion techniques can benefit the selection of sentences for the construction of query-biased summaries at the summary level rather than at the sentence ranking level.", "paper_title": "Query-Biased Summary Generation Assisted by Query Expansion", "paper_id": "WOS:000353654600008"}