{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bayesian_inference_network"}, {"score": 0.01049445267209216, "phrase": "ligand-based_virtual_screening"}, {"score": 0.010262460591817606, "phrase": "bayesian_inference_networks"}, {"score": 0.004160177106153782, "phrase": "textual_documents"}, {"score": 0.00397714507836836, "phrase": "user-defined_query"}, {"score": 0.0036347979916389467, "phrase": "chemical_similarity"}, {"score": 0.003104849179057156, "phrase": "belief_function"}, {"score": 0.003018668521745676, "phrase": "mddr_and_wombat_databases"}, {"score": 0.002853396755102163, "phrase": "effective_ligand-based_screening"}, {"score": 0.0027741761880779535, "phrase": "active_molecules"}, {"score": 0.0026971491199975083, "phrase": "high_degree"}, {"score": 0.00266693888510356, "phrase": "structural_homogeneity"}, {"score": 0.0022906498741695094, "phrase": "structurally_heterogeneous_sets"}, {"score": 0.0021288561076024844, "phrase": "interesting_alternative"}, {"score": 0.0021049977753042253, "phrase": "existing_tools"}], "paper_keywords": [""], "paper_abstract": "Background: Bayesian inference networks enable the computation of the probability that an event will occur. They have been used previously to rank textual documents in order of decreasing relevance to a user-defined query. Here, we modify the approach to enable a Bayesian inference network to be used for chemical similarity searching, where a database is ranked in order of decreasing probability of bioactivity. Results: Bayesian inference networks were implemented using two different types of network and four different types of belief function. Experiments with the MDDR and WOMBAT databases show that a Bayesian inference network can be used to provide effective ligand-based screening, especially when the active molecules being sought have a high degree of structural homogeneity; in such cases, the network substantially out-performs a conventional, Tanimoto-based similarity searching system. However, the effectiveness of the network is much less when structurally heterogeneous sets of actives are being sought. Conclusion: A Bayesian inference network provides an interesting alternative to existing tools for ligand-based virtual screening.", "paper_title": "Evaluation of a Bayesian inference network for ligand-based virtual screening", "paper_id": "WOS:000208222100005"}