{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "continuous_free-form_sculpting"}, {"score": 0.004661446705304497, "phrase": "self-similar_geometric_details"}, {"score": 0.004139128578531134, "phrase": "stretched_regions"}, {"score": 0.0038375280115736958, "phrase": "temporally_coherent_way"}, {"score": 0.003635600104609725, "phrase": "continuous_deformation_gestures"}, {"score": 0.0032629585038738856, "phrase": "existing_details"}, {"score": 0.003158776195052182, "phrase": "new_ones"}, {"score": 0.002685558057339722, "phrase": "initial_support_surface"}, {"score": 0.002530359917257626, "phrase": "deformed_regions"}, {"score": 0.0024231382864800173, "phrase": "continuous_free-form_deformation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Shape deformation", " Surfaces", " Modeling", " Detail preservation", " Temporal coherence"], "paper_abstract": "We address continuous free-form sculpting of 3D models that carry self-similar geometric details. In addition to being maintained when the model is bent or twisted, repetitive details should be duplicated rather than deformed in stretched regions, so that their distribution and appearance are preserved. Doing so in a temporally coherent way is essential in applications where the user sculpts through continuous deformation gestures. We propose a simple, yet effective solution for achieving such temporal coherence while enabling duplication of details. Our method maintains the set of existing details during stretch but seamlessly grows new ones in between. Similarly, some of the details progressively fade out when a region shrinks. Our solution is example-based: it uses the triangles of the initial support surface as exemplars to be selected and re-used in deformed regions. As our results show, our method achieves continuous free-form deformation of complex models while best preserving, at each time step, the properties and appearance of their initial distribution of details. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Real-time continuous self-replicating details for shape deformation", "paper_id": "WOS:000361074500010"}