{"auto_keywords": [{"score": 0.046591905845561485, "phrase": "shared_resource"}, {"score": 0.00709445513216119, "phrase": "private_resource"}, {"score": 0.006553751731265797, "phrase": "usage_pattern"}, {"score": 0.0052065325658549174, "phrase": "nash_equilibrium"}, {"score": 0.00481495049065317, "phrase": "single_shared_resource"}, {"score": 0.004757917303420435, "phrase": "multiple_contexts"}, {"score": 0.004720269202737973, "phrase": "computing_and_computer_communications"}, {"score": 0.004273951631010383, "phrase": "guaranteed_performance"}, {"score": 0.003931697356115479, "phrase": "user's_decision"}, {"score": 0.0037336520904376687, "phrase": "intrinsic_relation"}, {"score": 0.0034345152879289025, "phrase": "noncooperative_game"}, {"score": 0.0032744315183287024, "phrase": "considered_game"}, {"score": 0.0030119758165837625, "phrase": "worst_nash_equilibrium"}, {"score": 0.0026836723685046407, "phrase": "social_optimum"}, {"score": 0.002468450551616404, "phrase": "admission_control"}, {"score": 0.0022168460543913787, "phrase": "resource_allocation_scheme"}, {"score": 0.0021218313648947926, "phrase": "wide_range"}, {"score": 0.0021049977753042253, "phrase": "user_types"}], "paper_keywords": ["Analytical models", " modeling", " system analysis and design", " system performance", " systems engineering and theory"], "paper_abstract": "Contention among users utilizing a single shared resource arises in multiple contexts of computing and computer communications. We consider a setup in which users can split their work between a shared resource and a private resource. Unlike the private resource, which provides guaranteed performance, the performance of the shared resource is highly dependent on the usage pattern of other users, which in turn influences a user's decision if and to what extent to make use of the shared resource. The intrinsic relation between the utility that a user perceives from the shared resource and the usage pattern followed by other users gives rise to a noncooperative game, which we model and investigate. We show that the considered game admits a Nash equilibrium. Moreover, we show that this equilibrium is unique. We investigate the ratio between the worst Nash equilibrium and the social optimum, known as the \"price of anarchy,\" and show that, while in some cases of interest the Nash equilibrium coincides with a social optimum, in other cases the price of anarchy can be arbitrarily large. We demonstrate that, somewhat counterintuitively, exercising admission control to the shared resource may deteriorate its performance. Furthermore, we demonstrate that certain (heavy) users may \"scare off\" other, potentially large, communities of users. Accordingly, we propose a resource allocation scheme that addresses this problem and opens the shared resource to a wide range of user types.", "paper_title": "Workload Factoring: A Game-Theoretic Perspective", "paper_id": "WOS:000367100900023"}