{"auto_keywords": [{"score": 0.045787798456471546, "phrase": "different_polymer_chains"}, {"score": 0.00481495049065317, "phrase": "polymer_chains"}, {"score": 0.004762202897268383, "phrase": "amine-functionalized_double-walled_carbon_nanotubes"}, {"score": 0.00433645229352341, "phrase": "functionalized_double-walled_carbon_nanotubes"}, {"score": 0.0034975571855450343, "phrase": "polymer_type"}, {"score": 0.003440166097491567, "phrase": "polymer-nanotube_interaction"}, {"score": 0.0032376465741070274, "phrase": "covalent_wfunctionalization"}, {"score": 0.0031669873302916, "phrase": "polymer-dwcnt_interaction"}, {"score": 0.002713604305939145, "phrase": "functionalized_dwcnts"}, {"score": 0.002639740960006001, "phrase": "smallest_radius"}, {"score": 0.0023768935613577985, "phrase": "large_amine"}, {"score": 0.0021520139248317333, "phrase": "small_amine"}, {"score": 0.0021049977753042253, "phrase": "noncovalent_bonding"}], "paper_keywords": ["Functionalized double-walled carbon nanotubes", " Amine", " Polymer chains", " Adsorption"], "paper_abstract": "Molecular dynamics (MD) simulations were used to study the adsorption of different polymer chains on functionalized double-walled carbon nanotubes (DWCNTs). The nanotubes were functionalized with two different amines: NH2 (a small amine) and CH2-NH2 (a large amine). Considering three different polymer chains, all with the same number of atoms, the effect of polymer type on the polymer-nanotube interaction was studied. In general, it was found that covalent wfunctionalization considerably improved the polymer-DWCNT interaction. By comparing the results obtained with different polymer chains, it was observed that, unlike polyethylene and polyketone, poly(styrene sulfonate) only weakly interacts with the functionalized DWCNTs. Accordingly, the smallest radius of gyration was obtained with adsorbed poly(styrene sulfonate). It was also observed that the DWCNTs functionalized with the large amine presented more stable interactions with polyketone and poly(styrene sulfonate) than with polyethylene, whereas the DWCNTs functionalized with the small amine showed better interfacial noncovalent bonding with polyethylene.", "paper_title": "Investigation of the adsorption of polymer chains on amine-functionalized double-walled carbon nanotubes", "paper_id": "WOS:000366629200008"}