{"auto_keywords": [{"score": 0.048529954401590095, "phrase": "psycinfo"}, {"score": 0.04277898557751455, "phrase": "abc-clio"}, {"score": 0.015340868998868279, "phrase": "query_logs"}, {"score": 0.00481495049065317, "phrase": "domain-specific_information_retrieval_systems"}, {"score": 0.004621043537046209, "phrase": "abc-clio's"}, {"score": 0.00405127920820053, "phrase": "historical_abstracts_and_america"}, {"score": 0.003920128102807887, "phrase": "sociological_nature"}, {"score": 0.003479180627368156, "phrase": "individual_query_terms"}, {"score": 0.0034083145672246067, "phrase": "word_pairs"}, {"score": 0.003352658916650986, "phrase": "multiword_terms"}, {"score": 0.0029876282026237207, "phrase": "psychology_databases_aid"}, {"score": 0.002938821840519756, "phrase": "user_search_behavior"}, {"score": 0.0029027394930867902, "phrase": "information_needs"}, {"score": 0.0027514186391258263, "phrase": "user_searching_behavior"}, {"score": 0.002728847267539957, "phrase": "query_categorization"}, {"score": 0.002651291854234327, "phrase": "specific_instances"}, {"score": 0.002629539710839523, "phrase": "historical_events"}, {"score": 0.0024215727801940434, "phrase": "psycinfo's_own_classification_scheme"}, {"score": 0.0021224200236681498, "phrase": "general_web_search_engines"}, {"score": 0.0021049982455464086, "phrase": "excite"}], "paper_keywords": [""], "paper_abstract": "The authors report the findings of a study that analyzes and compares the query logs of PsycINFO for psychology and the two history databases of ABC-Clio: Historical Abstracts and America: History and Life to establish the sociological nature of information need, searching, and seeking in history versus psychology. Two problems are addressed: (a) What level of query log analysis-by individual query terms, by co-occurrence of word pairs, or by multiword terms (MWTs)-best serves as data for categorizing the queries to these two subject-bound databases; and (b) how can the differences in the nature of the queries to history versus psychology databases aid in our understanding of user search behavior and the information needs of their respective users. The authors conclude that MWTs provide the most effective snapshot of user searching behavior for query categorization. The MWTs to ABC-Clio indicate specific instances of historical events, people, and regions, whereas the MWTs to PsycINFO indicate concepts roughly equivalent to descriptors used by PsycINFO's own classification scheme. The average length of queries is 3.16 terms for PsycINFO and 3.42 for ABC-Clio, which breaks from findings for other reference and scholarly search engine studies, bringing query length closer in line to findings for general Web search engines like Excite.", "paper_title": "User search behavior of domain-specific information retrieval systems: An analysis of the query logs from PsycINFO and ABC-Clio's Historical Abstracts/America: History and life", "paper_id": "WOS:000238519600006"}