{"auto_keywords": [{"score": 0.04964156968469261, "phrase": "mobile_malicious_node_attacks"}, {"score": 0.010452184716679124, "phrase": "wireless_sensor_networks"}, {"score": 0.004815072276957652, "phrase": "distributed"}, {"score": 0.004669845451682529, "phrase": "sensor_nodes"}, {"score": 0.004195418010131832, "phrase": "multiple_locations"}, {"score": 0.004081385289516914, "phrase": "simple_robotic_platforms"}, {"score": 0.003769015543033816, "phrase": "ddos"}, {"score": 0.0037459885494311217, "phrase": "false_data_injection_attacks"}, {"score": 0.0036553070575015344, "phrase": "attack_paths"}, {"score": 0.0036329805216306576, "phrase": "mobile_malicious_nodes"}, {"score": 0.0035997452281985465, "phrase": "network-level_defenses"}, {"score": 0.003512591457930393, "phrase": "network_protocols"}, {"score": 0.003427540517249369, "phrase": "misbehaving_nodes"}, {"score": 0.0027403605798830984, "phrase": "distributed_detection"}, {"score": 0.0027069560455629917, "phrase": "static_sensor_networks"}, {"score": 0.00268216942002329, "phrase": "key_idea"}, {"score": 0.0026252106881752067, "phrase": "sequential_hypothesis_testing"}, {"score": 0.0025615908073796027, "phrase": "unusually_many_time_periods"}, {"score": 0.0023798115577749225, "phrase": "energy_consumption_overhead"}, {"score": 0.002315012841166354, "phrase": "false_positives"}, {"score": 0.0021441057555396013, "phrase": "reasonable_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile malicious node", " Intrusion detection", " Sequential hypothesis testing"], "paper_abstract": "In wireless sensor networks, sensor nodes are usually fixed to their locations after deployment. However, an attacker who compromises a subset of the nodes does not need to abide by the same limitation. If the attacker moves his compromised nodes to multiple locations in the network, such as by employing simple robotic platforms or moving the nodes by hand, he can evade schemes that attempt to use location to find the source of attacks. In performing DDoS and false data injection attacks, he takes advantage of diversifying the attack paths with mobile malicious nodes to prevent network-level defenses. For attacks that disrupt or undermine network protocols like routing and clustering, moving the misbehaving nodes prevents them from being easily identified and blocked. Thus, mobile malicious node attacks are very dangerous and need to be detected as soon as possible to minimize the damage they can cause. In this paper, we are the first to identify the problem of mobile malicious node attacks, and we describe the limitations of various naive measures that might be used to stop them. To overcome these limitations, we propose a scheme for distributed detection of mobile malicious node attacks in static sensor networks. The key idea of this scheme is to apply sequential hypothesis testing to discover nodes that are silent for unusually many time periods such nodes are likely to be moving and block them from communicating. By performing all detection and blocking locally, we keep energy consumption overhead to a minimum and keep the cost of false positives low. Through analysis and simulation, we show that our proposed scheme achieves fast, effective, and robust mobile malicious node detection capability with reasonable overhead. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Distributed detection of mobile malicious node attacks in wireless sensor networks", "paper_id": "WOS:000300271800017"}