{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "password_security"}, {"score": 0.004697308822154191, "phrase": "personal_and_organizational_information"}, {"score": 0.004582528208024817, "phrase": "organizational_information"}, {"score": 0.00393066798511457, "phrase": "username-password_combinations"}, {"score": 0.0037967593942595233, "phrase": "weak_method"}, {"score": 0.0034386894664467003, "phrase": "proactive_password_checking"}, {"score": 0.003176626803985225, "phrase": "user-generated_passwords"}, {"score": 0.0031297538950335233, "phrase": "present_study"}, {"score": 0.0029637093924781825, "phrase": "unique_passwords"}, {"score": 0.0029344771385297163, "phrase": "different_restrictions"}, {"score": 0.0029055323737809825, "phrase": "multiple_accounts"}, {"score": 0.0026839922027139967, "phrase": "password_restrictions"}, {"score": 0.002442693254693416, "phrase": "first_letter"}, {"score": 0.0022563636435096457, "phrase": "special_character"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["authentication", " information security", " passwords"], "paper_abstract": "Personal information and organizational information need to be protected, which requires that only authorized users gain access to the information. The most commonly used method for authenticating users who attempt to access such information is through the use of username-password combinations. However, this is a weak method of authentication because users tend to generate passwords that are easy to remember but also easy to crack. Proactive password checking, for which passwords must satisfy certain criteria, is one method for improving the security of user-generated passwords. The present study evaluated the time and number of attempts needed to generate unique passwords satisfying different restrictions for multiple accounts, as well as the login time and accuracy for recalling those passwords. Imposing password restrictions alone did not necessarily lead to more secure passwords. However, the use of a technique for which the first letter of each word of a sentence was used coupled with a requirement to insert a special character and digit yielded more secure passwords that were more memorable. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Improving password security and memorability to protect personal and organizational information", "paper_id": "WOS:000247427900005"}