{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "social_media_texts"}, {"score": 0.0046038458731764926, "phrase": "large-scale_mood_analysis"}, {"score": 0.004050116768809519, "phrase": "feature_selection"}, {"score": 0.0037262941538784094, "phrase": "global_mood_patterns"}, {"score": 0.0036788184374592706, "phrase": "different_level"}, {"score": 0.0032359856233193504, "phrase": "mood_trajectory"}, {"score": 0.0031743093007496736, "phrase": "egocentric_user"}, {"score": 0.002977061391551631, "phrase": "subtle_emotion_signals"}, {"score": 0.0029203055813347874, "phrase": "user-centric_manner"}, {"score": 0.002738797804069541, "phrase": "sentiment_information"}, {"score": 0.0021049977753042253, "phrase": "community_formation"}], "paper_keywords": ["Mood sensing", " Mood classification", " Mood pattern", " Hyper-community"], "paper_abstract": "We present a large-scale mood analysis in social media texts. We organise the paper in three parts: (1) addressing the problem of feature selection and classification of mood in blogosphere, (2) we extract global mood patterns at different level of aggregation from a large-scale data set of approximately 18 millions documents (3) and finally, we extract mood trajectory for an egocentric user and study how it can be used to detect subtle emotion signals in a user-centric manner, supporting discovery of hyper-groups of communities based on sentiment information. For mood classification, two feature sets proposed in psychology are used, showing that these features are efficient, do not require a training phase and yield classification results comparable to state of the art, supervised feature selection schemes; on mood patterns, empirical results for mood organisation in the blogosphere are provided, analogous to the structure of human emotion proposed independently in the psychology literature; and on community structure discovery, sentiment-based approach can yield useful insights into community formation.", "paper_title": "Mood sensing from social media texts and its applications", "paper_id": "WOS:000337034300008"}