{"auto_keywords": [{"score": 0.032061851982485956, "phrase": "kd"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004683540676363745, "phrase": "pansystems-styled_traffics"}, {"score": 0.004610058444728656, "phrase": "knowledge_rediscovery"}, {"score": 0.0045557008859819234, "phrase": "core_logoi"}, {"score": 0.004344577216137524, "phrase": "new_outlook"}, {"score": 0.0034949740315415043, "phrase": "related_mutuality"}, {"score": 0.0032161835102640372, "phrase": "pansystems_methodology"}, {"score": 0.002576442680766742, "phrase": "pansystems_variational_or"}, {"score": 0.00246657044320953, "phrase": "transfield_nature"}, {"score": 0.0023990982005125763, "phrase": "framework_and_concretion_principles"}, {"score": 0.0021901023885734, "phrase": "new_world_outlook"}, {"score": 0.002138636271204459, "phrase": "new_comprehension"}, {"score": 0.0021049977753042253, "phrase": "whf"}], "paper_keywords": ["Systems theory", " Supply chain management", " Traffic", " Innovation"], "paper_abstract": "Purpose - The purpose of this paper is to develop pansystems-styled traffics, logistics and knowledge rediscovery. The core logoi are the generalized resources//F* and their circulatiord/C*. The research presents a new outlook to mathematics, physics, traffic, communication, logistics, KD, internet, computer, translation, simulation, information, life-systems, logic or reasoning, memory or storage, process, transaction, finance, education, inherent, topology, evolution, etc. and then certain mechanism among them and related mutuality can be unveiled. Design/methodology/approach - A flexible combination of philosophy, mathematics and technology is embodied. The paper is an application of pansystems methodology to approach the following topics: pansystems resource, circulation: traffics, logistics and KD; pansystems variational principle and pan-circulation; pansystems logistics; pansystems network, supply chain and bullwhip effect; pansystems innovation and knowledge rediscovery. Findings - All of the topics concerned are reduced to the actualization of pansystems variational OR and classification-repetition-PanOR, which possess a transfield nature. Originality/value This paper provides the framework and concretion principles of pansystems research on traffics, logistics, supply chain, bullwhip effect, innovation and related applications, and presents a new world outlook, which leads to some new comprehension to KD and WHF* < world*history*future*>, SEM* < society*economy*management*>.", "paper_title": "Pansystems traffics, logistics and knowledge rediscovery", "paper_id": "WOS:000264459300021"}