{"auto_keywords": [{"score": 0.027971849151739902, "phrase": "proposed_architecture"}, {"score": 0.00481495049065317, "phrase": "home_agent"}, {"score": 0.00474946741204285, "phrase": "mobile-ip_based_networks"}, {"score": 0.004558289038745564, "phrase": "single_point"}, {"score": 0.004475798524102238, "phrase": "mobile_if-based_networks"}, {"score": 0.004179480763003705, "phrase": "redundant_has"}, {"score": 0.0037798652680135106, "phrase": "large_networks"}, {"score": 0.0033410898465226417, "phrase": "novel_ha_architecture"}, {"score": 0.0032064196784562017, "phrase": "whole_network"}, {"score": 0.003091262582401731, "phrase": "mobile_nodes"}, {"score": 0.0029396242707327986, "phrase": "forwarding_packets"}, {"score": 0.00274472767672686, "phrase": "existing_ones"}, {"score": 0.0026949679939994226, "phrase": "overall_performance"}, {"score": 0.002539379289856756, "phrase": "standard_ha"}, {"score": 0.00243694486220507, "phrase": "different_networks"}, {"score": 0.002349357968054713, "phrase": "architectural_benefits"}], "paper_keywords": ["Mobility", " Home agent", " Flexible Home Agent", " Reliability"], "paper_abstract": "Home Agents (HAS) represent a single point of failure in Mobile IF-based networks. In order to address this issue, researchers have proposed the deployment of redundant HAs on each sub-network. Although these approaches effectively mitigate this problem, they do not take into consideration the requirements of large networks with dozens of sub-networks. Both deploying and managing several HAs on each sub-network could prove to be too expensive. In this paper we present a novel HA architecture that only requires one set of HAs for the whole network. Our basic idea is that the location of mobile nodes can be announced to exit routers. This way, forwarding packets can be done without involving the HA. Our solution provides the same level of reliability as existing ones, while improving overall performance. We validate the proposed architecture by comparing its performance with that of a standard HA, using three network traffic traces collected in different networks. Our results show that, besides the architectural benefits, the proposed architecture would forward roughly 90% less traffic in a Mobile IPv4/NEMO network, and 15% less in a Mobile IPv6 one, when compared to a standard HA. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "fHA: A flexible and distributed Home Agent architecture for Mobile-IP based networks", "paper_id": "WOS:000307326900005"}