{"auto_keywords": [{"score": 0.04091440428687387, "phrase": "allocation_problems"}, {"score": 0.007110922727334154, "phrase": "solution_algorithms"}, {"score": 0.007052161558197704, "phrase": "uncertain_problems"}, {"score": 0.006916920466998221, "phrase": "corresponding_deterministic_problems"}, {"score": 0.00481495049065317, "phrase": "interval_parameters"}, {"score": 0.004297497895759793, "phrase": "precise_criterion"}, {"score": 0.0042148594491580324, "phrase": "uncertain_parameters"}, {"score": 0.004145287175409325, "phrase": "maximum_operator"}, {"score": 0.003751228706861377, "phrase": "independent_and_dependent_structures"}, {"score": 0.00370981613076245, "phrase": "total_execution_time"}, {"score": 0.0035290250358997904, "phrase": "task_allocation"}, {"score": 0.0034803820954524296, "phrase": "independent_operations"}, {"score": 0.0033757067564871494, "phrase": "functional_models"}, {"score": 0.0032470094613727433, "phrase": "known_bounds"}, {"score": 0.003158088307044493, "phrase": "known_solution_algorithms"}, {"score": 0.0030801368010480996, "phrase": "latter_problems"}, {"score": 0.0029957718120653238, "phrase": "main_contribution"}, {"score": 0.002810373366887749, "phrase": "uncertain_allocation_problems"}, {"score": 0.002718231974492536, "phrase": "useful_and_interesting_property"}, {"score": 0.0026956712908896147, "phrase": "solution_algorithm"}, {"score": 0.00251478366610296, "phrase": "simple_routing-scheduling_problem"}, {"score": 0.0024390784088340715, "phrase": "possible_parameter_scenarios"}, {"score": 0.00230080652063411, "phrase": "computer_systems"}, {"score": 0.002281702443163371, "phrase": "manufacturing_systems"}, {"score": 0.0022377394845878268, "phrase": "crisp_values"}, {"score": 0.0021946217240332707, "phrase": "individual_operations"}, {"score": 0.0021344590753878292, "phrase": "previous_results"}, {"score": 0.0021049977753042253, "phrase": "a._complex"}], "paper_keywords": ["cybernetics", " systems and control theory", " optimized production scheduling", " decision making", " optimization techniques"], "paper_abstract": "Purpose-In many decision-making problems under parameter uncertainty, the most popular stochastic approach is not used because of its serious drawbacks. The purpose of this paper is to present another approach, which copes with the uncertainty of parameters. It uses a precise criterion evaluating a decision with respect to uncertain parameters. This precision by the maximum operator is performed on a term based on the criterion and called the relative regret. The approach is applied to the allocation problems in a complex of operations. Design/methodology/approach - The resource allocation problems in a complex of operations of independent and dependent structures to minimize a total execution time of all operations are investigated. Then, the results are extended for the problem of a task allocation in the complex of independent operations. The case is considered when the parameters in the functional models of the operations are uncertain, and their values belong to the intervals of known bounds. The solution algorithms for the uncertain problems are based on known solution algorithms for the corresponding deterministic problems. The solution algorithms for the latter problems are outlined in the paper. Findings - The main contribution of the paper consists in presenting the property that it is possible for the uncertain problems considered to replace the solution of the uncertain allocation problems by solving a number of corresponding deterministic problems. Research limitations/implications - The useful and interesting property of the solution algorithm for the allocation problems, in general, cannot be applied to the other decision-making problems under uncertainty. As an example of such a problem, a simple routing-scheduling problem is presented for which, however, a number of possible parameter scenarios can be substantially limited. Practical implications - The allocation problems addressed in the paper have a variety of applications in computer systems and in manufacturing systems. Moreover, a lack of crisp values for the parameters in models of individual operations is rather common. Originality/value - The paper extends previous results for the allocation problems in a. complex of operations.", "paper_title": "Worst-case allocation algorithms in a complex of operations with interval parameters", "paper_id": "WOS:000257527600007"}