{"auto_keywords": [{"score": 0.038438565521983284, "phrase": "nat"}, {"score": 0.007475174990108765, "phrase": "umls."}, {"score": 0.004608997772926119, "phrase": "umls's_integration"}, {"score": 0.004223033363207986, "phrase": "umls"}, {"score": 0.0037361664435836845, "phrase": "software_tool"}, {"score": 0.0035761913760242697, "phrase": "umls_auditing"}, {"score": 0.003468287913322255, "phrase": "\"neighborhood-based\"_auditing"}, {"score": 0.0032764307492734145, "phrase": "single-focus_concept"}, {"score": 0.0031223774204093713, "phrase": "typical_diagrammatic_displays"}, {"score": 0.0030951536886513567, "phrase": "concept_networks"}, {"score": 0.002898378776839434, "phrase": "stylized_neighborhood_views"}, {"score": 0.002823207272381655, "phrase": "best_features"}, {"score": 0.0024325244760735566, "phrase": "auditing_process"}, {"score": 0.0022777800735119405, "phrase": "case_studies"}, {"score": 0.0021801135036476136, "phrase": "select_group"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Unified Medical Language System", " Auditing of terminologies", " Auditing of ontologies", " Auditing of the UMLS", " Software tool", " Auditing tool", " User interface", " Hybrid diagram/text user interface"], "paper_abstract": "The UMLS's integration of more than 100 source vocabularies, not necessarily consistent with one another, causes some inconsistencies. The purpose of auditing the UMLS is to detect such inconsistencies and to suggest how to resolve them while observing the requirement of fully representing the content of each source in the UMLS. A software tool, called the Neighborhood Auditing Tool (NAT), that facilitates UMLS auditing is presented. The NAT supports \"neighborhood-based\" auditing, where, at any given time, an auditor concentrates on a single-focus concept and one of a variety of neighborhoods of its closely related concepts. Typical diagrammatic displays of concept networks have a number of shortcomings, so the NAT utilizes a hybrid diagram/text interface that features stylized neighborhood views which retain some of the best features of both the diagrammatic layouts and text windows while avoiding the shortcomings. The NAT allows an auditor to display knowledge from both the Metathesaurus (concept) level and the Semantic Network (semantic type) level. Various additional features of the NAT that support the auditing process are described. The usefulness of the NAT is demonstrated through a group of case studies. Its impact is tested with a study involving a select group of auditors. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "The Neighborhood Auditing Tool: A hybrid interface for auditing the UMLS", "paper_id": "WOS:000266682100006"}