{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "speech_translation"}, {"score": 0.0047527118741586055, "phrase": "previous_research"}, {"score": 0.004118751115632515, "phrase": "server_computer"}, {"score": 0.0037844916274672544, "phrase": "portable_stand-alone_devices"}, {"score": 0.0036871853429163953, "phrase": "real-time_performance"}, {"score": 0.0034999880739789257, "phrase": "embedded_system_design"}, {"score": 0.0033006894756949776, "phrase": "small_size"}, {"score": 0.002935393439834135, "phrase": "arm-based_sopc_architecture"}, {"score": 0.0026969099161088398, "phrase": "proposed_sopc."}, {"score": 0.0026619761089539595, "phrase": "entire_design"}, {"score": 0.002543224008253855, "phrase": "english-to-mandarin_translation_process"}, {"score": 0.002336527289457915, "phrase": "maximum_frequency"}, {"score": 0.0022177498761722773, "phrase": "logic_elements"}, {"score": 0.00214659338413584, "phrase": "total_logic_elements"}], "paper_keywords": [""], "paper_abstract": "Previous research shows that there are two architectures for speech-to-speech translation (S2ST) system implementation. One is client-server based systems that should be built on the server computer but not available anytime or anywhere. The other is to build portable stand-alone devices but lacks the real-time performance. Therefore, this work presents an embedded system design for portable S2ST applications. This system is characterized by small size, low cost, real-time operation, and high portability. For realization of the proposed S2ST system, this work designs the ARM-based SoPC architecture, the speech translation intellectual property, and software procedures of the proposed SoPC. The entire design was implemented on ALTERA EPXA10. The English-to-Mandarin translation process can be completed within 0.5 second at a 40 MHz clock frequency with 1,200 translation patterns. The maximum frequency is 46.22 MHz, and the usage of logic elements is 19,318 (50% of the total logic elements of the EPXA10 device).", "paper_title": "An ARM-based embedded system design for speech-to-speech translation", "paper_id": "WOS:000239570300050"}