{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "property_testing"}, {"score": 0.038087442194002515, "phrase": "high_probability"}, {"score": 0.00459165923324494, "phrase": "rapidly_growing_field"}, {"score": 0.004441517985511521, "phrase": "property_testing_algorithm"}, {"score": 0.0035189057079817285, "phrase": "image_detection"}, {"score": 0.003419943984098415, "phrase": "large_objects"}, {"score": 0.0028140548269469934, "phrase": "sought_images"}, {"score": 0.0026452734009203764, "phrase": "binary_image"}, {"score": 0.0025103699913760057, "phrase": "rectangular_grid"}, {"score": 0.0024513404432665153, "phrase": "quick_\"rejector"}, {"score": 0.002337403139264533, "phrase": "input_image"}, {"score": 0.0021049977753042253, "phrase": "input_image_size"}], "paper_keywords": ["Property testing", " image partitioning"], "paper_abstract": "Property testing is a rapidly growing field of research. Typically, a property testing algorithm proceeds by quickly determining whether an input can satisfy some condition, under the assumption that most inputs do not satisfy it. If the input is \"far\" from satisfying the condition, the algorithm is guaranteed to reject it with high probability. Applying this paradigm to image detection is desirable since images are large objects and a lot of time can be saved by quickly rejecting images which are \"far\" from satisfying a certain condition the user is interested in. Further, typically most inputs are, indeed, \"far\" from the sought images. We demonstrate this by analyzing the problem of deciding whether a binary image can be partitioned according to a template represented by a rectangular grid, and introduce a quick \"rejector,\" which tests an image extracted from the input image, but whose size, as well as the time required to construct it, are constants which are independent of the input image size. With high probability, the rejector dismisses the inputs which are \"far\" from the template.", "paper_title": "Applying Property Testing to an Image Partitioning Problem", "paper_id": "WOS:000285313200004"}