{"auto_keywords": [{"score": 0.04480024954324633, "phrase": "proposed_method"}, {"score": 0.022189568191705783, "phrase": "e-learning_system"}, {"score": 0.009786588572645798, "phrase": "acss"}, {"score": 0.008972321510449908, "phrase": "exam_items"}, {"score": 0.00481495049065317, "phrase": "novel_method"}, {"score": 0.004676895436217523, "phrase": "learning_contents"}, {"score": 0.00451642066363115, "phrase": "aided_contents_supporting_service"}, {"score": 0.004162978902905446, "phrase": "examination_subsystem"}, {"score": 0.003996727479807572, "phrase": "main_learning_contents"}, {"score": 0.0034551632687788857, "phrase": "exam_item"}, {"score": 0.0032978134802348433, "phrase": "key_concepts"}, {"score": 0.0030572112793962004, "phrase": "search_engines"}, {"score": 0.002867348342846275, "phrase": "aided_contents"}, {"score": 0.002351705899181029, "phrase": "test_bed"}, {"score": 0.0021049977753042253, "phrase": "grid_computing_technology"}], "paper_keywords": ["Information retrieval", " e-Learning", " Aided contents"], "paper_abstract": "In this paper, we present a novel method for automatically augmenting the learning contents of an e-Learning system, called Aided Contents Supporting Service (or ACSS for short). The proposed method starts off with the examination subsystem of which the exam items are the main learning contents. Then, motivated by the desire to provide the users of such a system with more contents, ACSS will automatically extract concepts associated with each exam item when it is being read. The key concepts associated with the exam items can even be sent as queries to content search engines to get more contents to aid learning. Moreover, the aided contents can be accumulated, ranked, and shared by the users of such a system. Our simulation results indicate that the proposed method can effectively find and integrate many more relevant contents into an e-Learning system. Besides, as a test bed, we not only apply the proposed method to an e-Learning system we develop, but we also use the grid computing technology to speed up the performance of the proposed method.", "paper_title": "AIDED CONTENTS SUPPORTING SERVICE FOR E-LEARNING SYSTEMS", "paper_id": "WOS:000292626800031"}