{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "blend_region"}, {"score": 0.008713768692145013, "phrase": "subdivision_surfaces"}, {"score": 0.00786694776015732, "phrase": "possible_distortion"}, {"score": 0.007494833607291611, "phrase": "blending_surface"}, {"score": 0.005912545774479234, "phrase": "blend_curve"}, {"score": 0.005365364653652655, "phrase": "extraordinary_vertices"}, {"score": 0.004661446705304497, "phrase": "freeform_objects"}, {"score": 0.003519561814102764, "phrase": "boundary_curves"}, {"score": 0.0027295084882654917, "phrase": "blend_vertices"}, {"score": 0.002333044307949414, "phrase": "relatively_flat_region"}, {"score": 0.0021745003291048356, "phrase": "merging_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Boolean operation", " blending", " subdivision", " freeform surface", " geometric modeling"], "paper_abstract": "A technique for merging freeform objects modeled with subdivision surfaces is proposed. The method takes into consideration the possible distortion of the surfaces while the smoothness of the blending surface connecting the objects is maintained. A blend region between the given object surfaces is located. The topology of the surfaces in the vicinity of the blend region is refined and the boundary curves of the blend region are smoothed to reduce possible distortion in the blending surface. A blend curve between the two surfaces is used for connecting the given surfaces. Vertices on the blend curve are regular whereas extraordinary vertices are restricted to locate along the boundary of the blend region. Locations of the blend vertices are adjusted such that the curvature of the surfaces along the boundaries of the blend region is minimized. This ensures extraordinary vertices on the boundaries to lie on a relatively flat region, and hence, minimizes the distortion of the surfaces in the merging process. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Smooth blending of subdivision surfaces", "paper_id": "WOS:000240056300006"}