{"auto_keywords": [{"score": 0.041034036961577, "phrase": "low_level_heuristics"}, {"score": 0.015510536250513648, "phrase": "maximum_clique_problem"}, {"score": 0.011965321767357219, "phrase": "current_clique"}, {"score": 0.010044697312538901, "phrase": "cls"}, {"score": 0.008713768692145006, "phrase": "local_search"}, {"score": 0.004644146045859622, "phrase": "desktop_multi-core_computers"}, {"score": 0.004499647408293102, "phrase": "parallel_algorithms"}, {"score": 0.004320421465896323, "phrase": "specialised_hardware"}, {"score": 0.003947186611084043, "phrase": "cls_utilises"}, {"score": 0.0038070472635126276, "phrase": "iterative_improvement"}, {"score": 0.003738847528809348, "phrase": "suitable_vertices"}, {"score": 0.003036832649117453, "phrase": "guidance_information"}, {"score": 0.0029289191071848403, "phrase": "particular_areas"}, {"score": 0.002889444701599236, "phrase": "search_domain"}, {"score": 0.002389403849342894, "phrase": "instance_dependent_parameters"}, {"score": 0.0021049977753042253, "phrase": "dimacs_benchmark_instances"}], "paper_keywords": ["Local search", " Maximum clique", " Parallel algorithm"], "paper_abstract": "The advent of desktop multi-core computers has dramatically improved the usability of parallel algorithms which, in the past, have required specialised hardware. This paper introduces cooperating local search (CLS), a parallelised hyper-heuristic for the maximum clique problem. CLS utilises cooperating low level heuristics which alternate between sequences of iterative improvement, during which suitable vertices are added to the current clique, and plateau search, where vertices of the current clique are swapped with vertices not in the current clique. These low level heuristics differ primarily in their vertex selection techniques and their approach to dealing with plateaus. To improve the performance of CLS, guidance information is passed between low level heuristics directing them to particular areas of the search domain. In addition, CLS dynamically reconfigures the allocation of low level heuristics to cores, based on information obtained during a trial, to ensure that the mix of low level heuristics is appropriate for the instance being optimised. CLS has no problem instance dependent parameters, improves the state-of-the-art performance for the maximum clique problem over all the BHOSLIB benchmark instances and attains unprecedented consistency over the state-of-the-art on the DIMACS benchmark instances.", "paper_title": "Cooperating local search for the maximum clique problem", "paper_id": "WOS:000288024600004"}