{"auto_keywords": [{"score": 0.048483033890383866, "phrase": "cervical_auscultation"}, {"score": 0.00481495049065317, "phrase": "cervical_auscultation_signals"}, {"score": 0.0044424917428102445, "phrase": "human_body"}, {"score": 0.00422218060227958, "phrase": "trained_clinician"}, {"score": 0.0038461532860146535, "phrase": "eventual_goal"}, {"score": 0.0036864465771943933, "phrase": "screening_algorithms"}, {"score": 0.003578600071301459, "phrase": "swallowing_disorders"}, {"score": 0.003533347967582184, "phrase": "individual_patients'_health"}, {"score": 0.00337224813954299, "phrase": "signal-processing_techniques"}, {"score": 0.0033295966773779174, "phrase": "recent_advances"}, {"score": 0.003287482882222731, "phrase": "digital_transducers"}, {"score": 0.003204841443605308, "phrase": "highly_varied_research"}, {"score": 0.002870006736445581, "phrase": "analog_and_digital_filtering_techniques"}, {"score": 0.0027978304423349246, "phrase": "signal_quality"}, {"score": 0.0027274643070540733, "phrase": "wide_array"}, {"score": 0.0023408288327263316, "phrase": "phase_space_domains"}, {"score": 0.002168531704054597, "phrase": "\"normal\"_and_\"abnormal\"_categories"}, {"score": 0.0021049977753042253, "phrase": "nonlinear_techniques"}], "paper_keywords": ["Cervical auscultation", " signal processing", " swallowing accelerometry signals", " swallowing sounds"], "paper_abstract": "Cervical auscultation is the recording of sounds and vibrations caused by the human body from the throat during swallowing. While traditionally done by a trained clinician with a stethoscope, much work has been put toward developing more sensitive and clinically useful methods to characterize the data obtained with this technique. The eventual goal of the field is to improve the effectiveness of screening algorithms designed to predict the risk that swallowing disorders pose to individual patients' health and safety. This paper provides an overview of these signal-processing techniques and summarizes recent advances made with digital transducers in hopes of organizing the highly varied research on cervical auscultation. It investigates where on the body these transducers are placed in order to record a signal as well as the collection of analog and digital filtering techniques used to further improve the signal quality. It also presents the wide array of methods and features used to characterize these signals, ranging from simply counting the number of swallows that occur over a period of time to calculating various descriptive features in the time, frequency, and phase space domains. Finally, this paper presents the algorithms that have been used to classify these data into \"normal\" and \"abnormal\" categories. Both linear as well as nonlinear techniques are presented in this regard.", "paper_title": "Dysphagia Screening: Contributions of Cervical Auscultation Signals and Modern Signal-Processing Techniques", "paper_id": "WOS:000358301800006"}