{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "requirements_conflicts"}, {"score": 0.049488021144002546, "phrase": "architectural_design"}, {"score": 0.008430817640667512, "phrase": "icrad"}, {"score": 0.0038978806337961565, "phrase": "decision_criterion"}, {"score": 0.003849711329589429, "phrase": "requirements_negotiation"}, {"score": 0.0032953582866530966, "phrase": "integrated_process"}, {"score": 0.0029097582786754444, "phrase": "different_types"}, {"score": 0.0026013505538490223, "phrase": "detailed_iterative_process"}, {"score": 0.0025373711401047772, "phrase": "integrated_conflict_resolution"}, {"score": 0.0022967713922705, "phrase": "nine_types"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["requirements engineering", " requirements conflicts", " requirements negotiation", " requirements decisions", " architectural design", " design decisions"], "paper_abstract": "In order to solve requirements conflicts when developing or enhancing an IT system, it is essential to understand its architecture. Frequently, the costs for the realization of certain requirements are a decision criterion. Requirements negotiation and architectural design must be treated together, as conflicts cannot be solved before the architecture has been designed. So far, no integrated process exists which clearly defines input and output among these activities, and which takes into account a variety of different types of dependencies among requirements and between requirements and architecture. In this paper, we develop a detailed iterative process named ICRAD (Integrated Conflict Resolution and Architectural Design). ICRAD integrates requirements negotiation and architectural design and takes into account nine types of dependencies. We define three types of requirements conflicts. We also present a case study.", "paper_title": "ICRAD: An integrated process for the solution of requirements conflicts and architectural design", "paper_id": "WOS:000244317500006"}