{"auto_keywords": [{"score": 0.03596176205294269, "phrase": "extension-based_argumentation_semantics"}, {"score": 0.015534282528510152, "phrase": "new_logic_programming_semantics"}, {"score": 0.010356088899586186, "phrase": "argumentation_theory"}, {"score": 0.00885489368468698, "phrase": "logic_programming_semantics"}, {"score": 0.005528740910136623, "phrase": "new_argumentation_semantics"}, {"score": 0.00481495049065317, "phrase": "generating_relevant_logic_programming_semantics"}, {"score": 0.004406994912939125, "phrase": "common_sense_reasoning"}, {"score": 0.0036194914688460656, "phrase": "common_behaviours"}, {"score": 0.003479692058963528, "phrase": "close_relationship"}, {"score": 0.003247868216333148, "phrase": "general_recursive_schema"}, {"score": 0.00307657476125683, "phrase": "basic_logic_programming_semantics"}, {"score": 0.0030017207229983385, "phrase": "stable_model_semantics"}, {"score": 0.002843372121209168, "phrase": "desired_properties"}, {"score": 0.0027200305495826797, "phrase": "intended_models"}, {"score": 0.002680114113899346, "phrase": "normal_program"}, {"score": 0.0021896891011033105, "phrase": "similar_behaviour"}, {"score": 0.0021049977753042253, "phrase": "strongly_connected_components"}], "paper_keywords": ["Non-monotonic reasoning", " extension-based argumentation semantics and logic programming", " semantics", " logic programming"], "paper_abstract": "In the literature, there are several approaches which try to perform common sense reasoning. Among them, the approaches which have probably received the most attention the last two decades are the approaches based on logic programming semantics with negation as failure and argumentation theory. Even though both approaches have their own features, it seems that they share some common behaviours which can be studied by considering the close relationship between logic programming semantics and extension-based argumentation semantics. In this paper, we will present a general recursive schema for defining new logic programming semantics. This schema takes as input any basic logic programming semantics, such as the stable model semantics, and gives as output a new logic programming semantics which satisfies some desired properties such as relevance and the existence of the intended models for every normal program. We will see that these new logic programming semantics can define candidate extension-based argumentation semantics. These new argumentation semantics will overcome some of the weakness of the extension-based argumentation semantics based on admissible sets. In fact, we will see that some of these new argumentation semantics have similar behaviour to the extension-based argumentation semantics built in terms of strongly connected components.", "paper_title": "A Schema for Generating Relevant Logic Programming Semantics and its Applications in Argumentation Theory", "paper_id": "WOS:000294728800009"}