{"auto_keywords": [{"score": 0.041904013256512336, "phrase": "doubleplay"}, {"score": 0.009065497979075821, "phrase": "multiple_threads"}, {"score": 0.007768940763186616, "phrase": "additional_execution"}, {"score": 0.007404417998154783, "phrase": "single_processor"}, {"score": 0.004814959548930643, "phrase": "replay"}, {"score": 0.004620093797504386, "phrase": "hardware_or_software_system"}, {"score": 0.004463723624910583, "phrase": "deterministic_replay"}, {"score": 0.004152288616186981, "phrase": "shared_memory_operations"}, {"score": 0.0038624981944755813, "phrase": "commodity_multiprocessors"}, {"score": 0.0037445545584005014, "phrase": "simpler_and_faster_mechanisms"}, {"score": 0.0037188360359702182, "phrase": "single-processor_record"}, {"score": 0.0035804980565263024, "phrase": "multiple_cores"}, {"score": 0.003471135453226184, "phrase": "record_and_replay"}, {"score": 0.0033075957452554368, "phrase": "multiple_time_intervals"}, {"score": 0.0032065418360603293, "phrase": "separate_processors"}, {"score": 0.002851790448644913, "phrase": "different_epochs"}, {"score": 0.002822434555587263, "phrase": "different_copies"}, {"score": 0.0026986685585382347, "phrase": "shared-memory_accesses"}, {"score": 0.0024501740852758505, "phrase": "multiple_processors"}, {"score": 0.002224510044064184, "phrase": "spare_cores"}], "paper_keywords": ["Design", " Performance", " Reliability", " Deterministic Replay", " Uniparallelism"], "paper_abstract": "Deterministic replay systems record and reproduce the execution of a hardware or software system. In contrast to replaying execution on uniprocessors, deterministic replay on multiprocessors is very challenging to implement efficiently because of the need to reproduce the order or values read by shared memory operations performed by multiple threads. In this paper, we present DoublePlay, a new way to efficiently guarantee replay on commodity multiprocessors. Our key insight is that one can use the simpler and faster mechanisms of single-processor record and replay, yet still achieve the scalability offered by multiple cores, by using an additional execution to parallelize the record and replay of an application. DoublePlay timeslices multiple threads on a single processor, then runs multiple time intervals (epochs) of the program concurrently on separate processors. This strategy, which we call uniparallelism, makes logging much easier because each epoch runs on a single processor (so threads in an epoch never simultaneously access the same memory) and different epochs operate on different copies of the memory. Thus, rather than logging the order of shared-memory accesses, we need only log the order in which threads in an epoch are timesliced on the processor. DoublePlay runs an additional execution of the program on multiple processors to generate checkpoints so that epochs run in parallel. We evaluate DoublePlay on a variety of client, server, and scientific parallel benchmarks; with spare cores, DoublePlay reduces logging overhead to an average of 15% with two worker threads and 28% with four threads.", "paper_title": "DoublePlay: Parallelizing Sequential Logging and Replay", "paper_id": "WOS:000290854400003"}