{"auto_keywords": [{"score": 0.033832255826776125, "phrase": "maximum-margin_classifier"}, {"score": 0.0045122922461952805, "phrase": "supervised_learning_technique"}, {"score": 0.00420368356873615, "phrase": "non-target_class"}, {"score": 0.004081385289516914, "phrase": "proposed_target_detection_algorithm"}, {"score": 0.0036052633308076933, "phrase": "image_differencing"}, {"score": 0.0031100973266506163, "phrase": "recently_developed_feature_weighting_technique"}, {"score": 0.0027307746993761035, "phrase": "utilises_multiple_images"}, {"score": 0.0024842242921857705, "phrase": "multi-pass_change_detection"}, {"score": 0.0023554316787703137, "phrase": "proposed_detection_algorithm"}, {"score": 0.0021682027434117095, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "benchmark_algorithm"}], "paper_keywords": [""], "paper_abstract": "A target detection algorithm is developed based on a supervised learning technique that maximises the margin between two classes, that is, the target class and the non-target class. Specifically, the proposed target detection algorithm consists of (i) image differencing, (ii) maximum-margin classifier, and (iii) diversity combining. The image differencing is to enhance and highlight the targets so that the targets are more distinguishable from the background. The maximum-margin classifier is based on a recently developed feature weighting technique called Iterative RELIEF; the objective of the maximum-margin classifier is to achieve robustness against uncertainties and clutter. The diversity combining utilises multiple images to further improve the performance of detection, and hence it is a type of multi-pass change detection. The authors evaluate the performance of the proposed detection algorithm, using the CARABAS-II synthetic aperture radar (SAR) image data and the experimental results demonstrate superior performance of the proposed algorithm, compared to the benchmark algorithm.", "paper_title": "Target detection for very high-frequency synthetic aperture radar ground surveillance", "paper_id": "WOS:000302137600003"}