{"auto_keywords": [{"score": 0.03394464802124141, "phrase": "presence_publications"}, {"score": 0.009554229218181956, "phrase": "presence-based_applications"}, {"score": 0.00481495049065317, "phrase": "presence_service"}, {"score": 0.0044968982227349625, "phrase": "relevant_context"}, {"score": 0.004413846562278824, "phrase": "user_communications"}, {"score": 0.004199766284749713, "phrase": "mobile_world"}, {"score": 0.004071249707923223, "phrase": "er_ubiquitous_userpersonalized_services"}, {"score": 0.00402094658848301, "phrase": "next_generation_networks"}, {"score": 0.0037551444630619015, "phrase": "great_amount"}, {"score": 0.0035728978842974246, "phrase": "traffic_harmfully"}, {"score": 0.0032953582866530966, "phrase": "scarce_processing_resources"}, {"score": 0.0032546105164772995, "phrase": "limited_battery_life"}, {"score": 0.0023694065215394593, "phrase": "pull_approach"}, {"score": 0.0021580985506699105, "phrase": "publication_filtering"}], "paper_keywords": [""], "paper_abstract": "Presence information characterizes all relevant context for handling user communications Currently, presence-based applications are moving towards the mobile world in order to off er ubiquitous userpersonalized services in Next Generation Networks. A barrier to success of this evolution is the great amount of traffic that presence-based applications generate. This traffic harmfully impacts on the network core, access links and mobile devices with scarce processing resources or limited battery life. Presence publications trigger end-to-end communication flows that become unbearable as the number of \"presentities\", watchers and presence changes increase. Thus, we propose controlling the rate of publications for reducing the number of presence publications. For this purpose, we also present a pull approach that allows pausing and un-pausing presence publications. Both strategies are based on publication filtering, which constitutes our third proposal for reducing the number, in addition to the size, of presence publications.", "paper_title": "Publications in Presence Service: Overview and Optimization Techniques", "paper_id": "WOS:000209590300002"}