{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "consummatory_behaviors"}, {"score": 0.004392565073466714, "phrase": "sensorimotor_interaction"}, {"score": 0.004229556887896042, "phrase": "single_architecture"}, {"score": 0.004161553532799662, "phrase": "object_affordances"}, {"score": 0.003900257249255497, "phrase": "grounded_knowledge"}, {"score": 0.0035005841368145525, "phrase": "agent's_internal_dynamics"}, {"score": 0.003245359940011418, "phrase": "simulated_environment"}, {"score": 0.0029602552900111407, "phrase": "learned_affordances"}, {"score": 0.0028348690177346448, "phrase": "object_similarity"}, {"score": 0.0028043588777213533, "phrase": "resource_availability"}, {"score": 0.0027001292153471202, "phrase": "agent's_internal_physiology"}, {"score": 0.002333044307949414, "phrase": "physiological_stability"}, {"score": 0.0023079225317714815, "phrase": "experimental_results"}, {"score": 0.002222102813520549, "phrase": "motivation-driven_and_affordance_learning"}], "paper_keywords": ["sensorimotor interaction", " homeostasis", " affordance", " motivation", " reinforcement", " robotics"], "paper_abstract": "This article introduces a formalization of the dynamics between sensorimotor interaction and homeostasis, integrated in a single architecture to learn object affordances of consummatory behaviors. We also describe the principles necessary to learn grounded knowledge in the context of an agent and its surrounding environment, which we use to investigate the constraints imposed by the agent's internal dynamics and the environment. This is tested with an embodied, situated robot, in a simulated environment, yielding results that support this formalization. Furthermore, we show that this methodology allows learned affordances to be dynamically redefined, depending on object similarity, resource availability, and the rhythms of the agent's internal physiology. For example, if a resource becomes increasingly scarce, the value assigned by the agent to its related effect increases accordingly, encouraging a more active behavioral strategy to maintain physiological stability. Experimental results also suggest that a combination of motivation-driven and affordance learning in a single architecture should simplify its overall complexity while increasing its adaptivity.", "paper_title": "Learning Affordances of Consummatory Behaviors: Motivation-Driven Adaptive Perception", "paper_id": "WOS:000280926600005"}