{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_capital"}, {"score": 0.04954033184026155, "phrase": "knowledge_integration"}, {"score": 0.004575854901681043, "phrase": "collaborative_information_systems_project"}, {"score": 0.004348580182733617, "phrase": "multiple_organizations"}, {"score": 0.004086010164600727, "phrase": "complex_task"}, {"score": 0.0040171817997972335, "phrase": "diverse_knowledge_bases"}, {"score": 0.003882970272082245, "phrase": "distinct_strategic_goals"}, {"score": 0.0038392331564122387, "phrase": "even_conflicting_interests"}, {"score": 0.0035666632046674153, "phrase": "social_relationships"}, {"score": 0.003447451122274614, "phrase": "interorganizational_relationships"}, {"score": 0.003370190834214415, "phrase": "exact_nature"}, {"score": 0.0031665087019813244, "phrase": "in-depth_case_study"}, {"score": 0.0027794243746094905, "phrase": "business_partners"}], "paper_keywords": [""], "paper_abstract": "Information systems (IS) projects involving multiple organizations are very common today. Knowledge integration in such projects is a complex task of integrating diverse knowledge bases across organizations that may possess distinct strategic goals and even conflicting interests. Prior research has indicated that social capital, a resource based on social relationships, positively influences knowledge integration and interorganizational relationships, but the exact nature of the interaction has been unclear. Based on an in-depth case study, this article examines a four-organization (three clients and one IT service provider) collaborative IS project wherein the clients were business partners for 7 years when they embarked on the project. The study explicitly identifies the roles through which social capital can be leveraged for knowledge integration in a collaborative IS project. Findings suggest that social capital can be leveraged as a motivator, an integrator, and a facilitator during the various stages of a collaborative IS project.", "paper_title": "Towards understanding the roles of social capital in knowledge integration: A case study of a collaborative information systems project", "paper_id": "WOS:000246379300011"}