{"auto_keywords": [{"score": 0.044714013273952705, "phrase": "transport_scenario"}, {"score": 0.008713768692145006, "phrase": "risk_factor"}, {"score": 0.008547627068776728, "phrase": "travelling_times"}, {"score": 0.004543708337879809, "phrase": "transport_units"}, {"score": 0.004467500439382719, "phrase": "sustainable_urban_transport"}, {"score": 0.004339807233454581, "phrase": "merging_manoeuvre"}, {"score": 0.004318881178805575, "phrase": "independent_units"}, {"score": 0.004165105357908494, "phrase": "pre-defined_peripheral_trajectory"}, {"score": 0.004055813175040602, "phrase": "inexpensive_computational_cost_algorithm"}, {"score": 0.003978126348084702, "phrase": "optimal_merging_point"}, {"score": 0.003949377440799037, "phrase": "efficient_route"}, {"score": 0.0038924989779389424, "phrase": "optimal_merging_node"}, {"score": 0.003593945790289586, "phrase": "real_urban_setting"}, {"score": 0.003542168007825962, "phrase": "weather_conditions"}, {"score": 0.0034408318840638634, "phrase": "social_services"}, {"score": 0.003424225677958491, "phrase": "cultural_interest"}, {"score": 0.003358595758566157, "phrase": "traffic_density"}, {"score": 0.003056169480391946, "phrase": "novel_\"risk_factor\"_parameter"}, {"score": 0.00293298909180649, "phrase": "merging_node"}, {"score": 0.002828418443899226, "phrase": "travelling_experiences"}, {"score": 0.00269475174341129, "phrase": "expected_travelling_times"}, {"score": 0.0026175952455594277, "phrase": "remote_centre"}, {"score": 0.0025549840900344623, "phrase": "dynamic_updating"}, {"score": 0.0023932958923524234, "phrase": "changing_conditions"}, {"score": 0.002347378595930709, "phrase": "pursuing_unit"}, {"score": 0.0023303871145705954, "phrase": "intermediate_node"}, {"score": 0.002230984431056064, "phrase": "aforementioned_novel_risk_factor"}, {"score": 0.0021881743793875767, "phrase": "simulated_transport_scenario"}, {"score": 0.002105000283232273, "phrase": "elsevier"}], "paper_keywords": ["Risk factor", " Convoy merging manoeuvre", " Timing uncertainty", " Robust and adaptive routing", " Heuristic estimation", " Efficient and optimal routing", " Dynamic programming"], "paper_abstract": "Cooperative guiding, and especially in convoys, for automated, non-contaminating transport units is a line of research for sustainable urban transport. In this paper we propose a strategy for facilitating the merging manoeuvre between independent units travelling in a transport scenario (usually a city) and a convoy following a pre-defined peripheral trajectory in the same scenario. The proposal consists of an inexpensive computational cost algorithm, which is able to calculate the optimal merging point and the efficient route to reach it. An optimal merging node is the one on the periphery which minimises the merging time. In addition to the complexity of the problem is the uncertainty associated to travelling times, as is habitual in a real urban setting. Sources of uncertainty include weather conditions, the effect of the zone (proximity to centres of social services or cultural interest), the day and time on traffic density, etc. All this justifies the variability in the time taken by any vehicle moving along a section in the transport scenario. In order to delimit the randomness inherent to the problem, the authors incorporate a novel \"risk factor\" parameter, which conditions the solution. This risk factor limits the probability of a convoy reaching the merging node before the pursuer (failed merging manoeuvre). The possibility of having the travelling experiences from any unit moving in the transport scenario means that the statistics (mean and variance) associated to the expected travelling times can be updated dynamically. This task is executed in a remote centre which communicates with all the units in the transport scenario. This dynamic updating means that the objectives (optimal merging node and efficient routing) can be re-evaluated, and makes it possible to adapt to the changing conditions of the transport scenario, each time the pursuing unit reaches an intermediate node. In order to validate the algorithm described in this paper and evaluate the effect of the aforementioned novel risk factor, we have tested them on a simulated transport scenario using Player/Stage. The results and conclusions are also shown. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Effect of a risk factor in convoy merging manoeuvres considering uncertainty in travelling times", "paper_id": "WOS:000311506900021"}