{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dfig"}, {"score": 0.007250670480067773, "phrase": "higher_order_air-gap_field_harmonics"}, {"score": 0.0047709540557306284, "phrase": "unbalanced_conditions"}, {"score": 0.004542976479682312, "phrase": "coupled-circuit_model"}, {"score": 0.004501453956464956, "phrase": "doubly-fed_induction_generator"}, {"score": 0.0043258453436258405, "phrase": "versatile_and_powerful_technique"}, {"score": 0.004157058883925715, "phrase": "dfig_operation"}, {"score": 0.0040193730627071135, "phrase": "winding_fault"}, {"score": 0.0039341294012600085, "phrase": "steady-state_current_spectrum"}, {"score": 0.0037921662574137535, "phrase": "presented_model"}, {"score": 0.003711723285313348, "phrase": "harmonic_winding_inductances"}, {"score": 0.0036218682585355895, "phrase": "standard_induction_machine_electromechanical_equations"}, {"score": 0.0033445420167761445, "phrase": "open-_and_short-circuit_stator_and_rotor_winding_faults"}, {"score": 0.003165046673308291, "phrase": "corresponding_experimental_data"}, {"score": 0.0030321057387540963, "phrase": "healthy_and_faulty_operating_scenarios"}, {"score": 0.002949598537993663, "phrase": "employed_model"}, {"score": 0.0028958411976400646, "phrase": "frequency_domain"}, {"score": 0.002825681384008326, "phrase": "dfig_operating_conditions"}, {"score": 0.0027069560455629917, "phrase": "considered_winding_asymmetries"}, {"score": 0.002673957615079041, "phrase": "additional_harmonic_components"}, {"score": 0.0026494723416072316, "phrase": "stator_current_spectrum"}, {"score": 0.00241658945942583, "phrase": "dfig_stator_current_harmonic_content_spectra"}, {"score": 0.002315012841166354, "phrase": "reliable_fault_indicators"}, {"score": 0.002258893331333988, "phrase": "harmonic_conductor_distribution-based_modeling_method"}, {"score": 0.0022041312401435346, "phrase": "dfig_electrical_quantities"}, {"score": 0.0021506938783242215, "phrase": "current_spectrum"}, {"score": 0.002124461969404541, "phrase": "higher_order"}, {"score": 0.0021179540310789446, "phrase": "harmonic_components"}], "paper_keywords": ["Generators", " Windings", " Electric current", " Wind power"], "paper_abstract": "Purpose - The purpose of this paper is to describe the principles of a coupled-circuit model for a doubly-fed induction generator (DFIG) and to present evidence of the validity of this versatile and powerful technique and the advantages it offers when used for modeling and analysis of DFIG operation in unbalanced. conditions. This paper also investigates the winding fault induced changes in the machine stator steady-state current spectrum with a view to DFIG condition monitoring. Design/methodology/approach - The presented model is based on the summation of harmonic winding inductances. It comprises of a set of standard induction machine electromechanical equations where a connection matrix that defines a particular balanced/unbalanced winding configuration of interest is conveniently incorporated in the expressions. This model is therefore capable of representing both open- and short-circuit stator and rotor winding faults while also taking into account higher order air-gap field harmonics. Model predictions are verified in this work through comparison with corresponding experimental data obtained from a purpose built 30 kW DFIG laboratory test rig. The paper involves a number of healthy and faulty operating scenarios. Findings - Advantages and validity of the employed model are illustrated in time and frequency domain for different steady-state balanced/unbalanced winding DFIG operating conditions. It is also shown in both predicted and measured data that the considered winding asymmetries give rise to additional harmonic components in the stator current spectrum. Research limitations/implications - The importance of considering higher order air-gap field harmonics when modeling induction machine behavior is outlined in this work. Practical implications - This paper identifies changes in the DFIG stator current harmonic content spectra that are winding fault induced. These may have the potential to constitute reliable fault indicators. Originality/value - The paper discusses a harmonic conductor distribution-based modeling method aimed predominantly at frequency domain analysis of DFIG electrical quantities. It is shown that DFIG stator current spectrum is rich in higher order harmonic components and that manner in which these are manifested is heavily influenced by the presence of winding unbalance.", "paper_title": "A coupled-circuit model for a DFIG operating under unbalanced conditions", "paper_id": "WOS:000283623400022"}