{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "routing_problem_reoptimization"}, {"score": 0.004781915513030716, "phrase": "activity-based_travel_scenario_analysis"}, {"score": 0.004684157900507474, "phrase": "household_activity_pattern_problem"}, {"score": 0.004588389551682397, "phrase": "significant_computational_cost"}, {"score": 0.0043875257506180865, "phrase": "optimal_solution"}, {"score": 0.004342430078306461, "phrase": "prior_problem"}, {"score": 0.004268293864953256, "phrase": "new_solution"}, {"score": 0.003835972725191194, "phrase": "full_optimization"}, {"score": 0.0036553070575015344, "phrase": "computational_studies"}, {"score": 0.0035804980565263024, "phrase": "scenario_analysis"}, {"score": 0.003555902292752528, "phrase": "generalized_vehicle_routing_problems"}, {"score": 0.003353521531649663, "phrase": "g-sharp"}, {"score": 0.0032510690712452147, "phrase": "happ_model"}, {"score": 0.0031845067058084583, "phrase": "schedule_choice"}, {"score": 0.0029620573986902416, "phrase": "evolutionary_algorithms"}, {"score": 0.0028616432465945097, "phrase": "mitochondrial_eve"}, {"score": 0.0027551040319267446, "phrase": "standard_genetic_algorithm"}, {"score": 0.002726740692380339, "phrase": "computational_experiment"}, {"score": 0.0025981810951165836, "phrase": "single-traveler_household"}, {"score": 0.002571429085596686, "phrase": "five_hundred_households"}, {"score": 0.0025014259919355453, "phrase": "base_scenario"}, {"score": 0.0024501740852758505, "phrase": "office_land_use"}, {"score": 0.002318566141177149, "phrase": "physical_network"}, {"score": 0.002255431275670053, "phrase": "reoptimization_heuristics"}, {"score": 0.0021049977753042253, "phrase": "spatiotemporal_changes"}], "paper_keywords": [""], "paper_abstract": "Activity-based travel scenario analysis and network design using a household activity pattern problem (HAPP) can face significant computational cost and inefficiency. One solution approach, called reoptimization, makes use of an optimal solution of a prior problem instance to find a new solution faster and more accurately. Although the method is generally NP-hard as well, the approximation bound has been shown in the literature to be tighter than a full optimization for several traveling salesman problem variations. To date, however, there have not been any computational studies conducted with the method for scenario analysis with generalized vehicle routing problems, nor has there been any metaheuristics designed with reoptimization in mind. A generalized, selective household activity routing problem (G-SHARP) is presented as an extension of the HAPP model to include both destination and schedule choice for the purpose of testing reoptimization. Two reoptimization algorithms are proposed: a simple swap heuristic and a new class of evolutionary algorithms designed for reoptimization, dubbed a Genetic Algorithm with Mitochondrial Eve (GAME). The two algorithms are tested against a standard genetic algorithm in a computational experiment involving 100 zones that include 400 potential activities (resulting in a total of 802 nodes per single-traveler household). Five hundred households are synthesized and computationally tested with a base scenario, a scenario where an office land use in one zone is dezoned, and a scenario where a freeway is added onto the physical network. The results demonstrate the effectiveness of reoptimization heuristics, particularly GAME, and the capability of G-SHARP to capture reallocations of activities and schedules with respect to spatiotemporal changes.", "paper_title": "Activity-Based Travel Scenario Analysis with Routing Problem Reoptimization", "paper_id": "WOS:000329267600003"}