{"auto_keywords": [{"score": 0.046997141122384276, "phrase": "research_paper"}, {"score": 0.00481495049065317, "phrase": "visualization_research_paper"}, {"score": 0.004358240019060018, "phrase": "useful_starting_point"}, {"score": 0.003660374693346876, "phrase": "virtually_all_good_visualization_research_papers"}, {"score": 0.0034967818541774844, "phrase": "good_research_paper"}, {"score": 0.0032177835714470027, "phrase": "paper_writing"}, {"score": 0.003010651173285521, "phrase": "difficult_starting_point"}, {"score": 0.0028760125558659907, "phrase": "concise_description"}, {"score": 0.002496659907186784, "phrase": "author's_mind"}, {"score": 0.002297274552621268, "phrase": "paper_writing_process"}, {"score": 0.0021944684609599245, "phrase": "research_topic"}, {"score": 0.0021049977753042253, "phrase": "presented_work"}], "paper_keywords": ["visualization research paper", " writing methodology"], "paper_abstract": "This paper attempts to explain the mechanics of writing a research paper in visualization. This serves as a useful starting point for those who have never written a research paper before or have very little previous experience. After all, no one is born knowing how to write one. And yet, there are certain elements, a commonality, that should be found in virtually all good visualization research papers. We give our recommendations as to each section a good research paper consists of as well as what each section contains. This paper itself follows our recommended structure. We believe that paper writing should start with the abstract. The abstract can be approximately 6-12 sentences. It is a difficult starting point, but it forces the author to write down a concise description of what they are researching and what the benefits are. Chances are, if the author cannot start out by writing an abstract, then it is not clear in the author's mind what the paper should be about. Of course, the abstract will be refined and updated during the paper writing process. The abstract should concisely (1) identify the research topic, (2) describe the novelty of the presented work and (3) identify the benefits and advantages that result.", "paper_title": "How to Write a Visualization Research Paper: A Starting Point", "paper_id": "WOS:000284119300007"}