{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "label_dependency"}, {"score": 0.04516267803280923, "phrase": "prediction_model"}, {"score": 0.00481495049065317, "phrase": "iterative_label_propagation"}, {"score": 0.004681226806682058, "phrase": "multi-label_learning"}, {"score": 0.004487541157100498, "phrase": "existing_methods"}, {"score": 0.004143196873246147, "phrase": "original_features"}, {"score": 0.0037363522297378777, "phrase": "significant_imbalance"}, {"score": 0.0034984340449789745, "phrase": "also_the_dynamic_interaction"}, {"score": 0.0032449610741097992, "phrase": "new_framework"}, {"score": 0.003066945490483524, "phrase": "label's_prediction"}, {"score": 0.002995677265350124, "phrase": "iterative_process"}, {"score": 0.002752513434446804, "phrase": "graph_model"}, {"score": 0.0022168460543913787, "phrase": "significant_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-label learning", " Label dependency", " Random walk with restart", " Label propagation"], "paper_abstract": "One key challenge in multi-label learning is how to exploit label dependency effectively, and existing methods mainly address this issue via training a prediction model for each label based on the combination of original features and the labels on which it depends on. However, the influence of label dependency might be depressed due to the significant imbalance in dimensionality of feature set and dependent label set in this way, also the dynamic interaction between labels cannot be utilized effectively. In this paper, we propose a new framework to exploit the dependencies between labels iteratively and interactively. Every label's prediction will be updated through iterative process of propagation, other than being determined directly by a prediction model. Specifically, we utilize a graph model to encode the dependencies between labels, and employ the random-walk with restart (RWR) strategy to propagate the dependency among all labels iteratively until the predictions for all the labels converge. We validate our approach by experiments, and the results demonstrate that it yields significant improvements compared with several state-of-the-art algorithms. (C) 2014 Published by Elsevier B.V.", "paper_title": "Multi-label learning based on iterative label propagation over graph", "paper_id": "WOS:000333451300011"}