{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiobjective_optimization_problem"}, {"score": 0.004519736937243476, "phrase": "continuous_multiobjective_optimization_problem"}, {"score": 0.00443638953122199, "phrase": "evolution_strategies"}, {"score": 0.004370814742381778, "phrase": "particular_interest"}, {"score": 0.004338390136272005, "phrase": "many-objective_optimization_problems"}, {"score": 0.0038798015183611275, "phrase": "pareto_set"}, {"score": 0.0038510053729959074, "phrase": "previous_related_studies"}, {"score": 0.0037658881407605445, "phrase": "nondominated_individuals"}, {"score": 0.0035479614996805383, "phrase": "possible_remedies"}, {"score": 0.0028903278985330117, "phrase": "descent_cones"}, {"score": 0.0027949428646076627, "phrase": "qualitative_considerations"}, {"score": 0.002763850622950247, "phrase": "general_class"}, {"score": 0.0027433143290371293, "phrase": "uni-modal_test_problems"}, {"score": 0.00247128526955136, "phrase": "empirical_studies"}, {"score": 0.0022013916728990564, "phrase": "many-objective_problems"}, {"score": 0.0021049977753042253, "phrase": "recent_advances"}], "paper_keywords": ["Algorithm design", " evolutionary computation", " many-objective optimization", " multiobjective optimization"], "paper_abstract": "In this paper, we study the influence of the number of objectives of a continuous multiobjective optimization problem on its hardness for evolution strategies which is of particular interest for many-objective optimization problems. To be more precise, we measure the hardness in terms of the evolution (or convergence) of the population toward the set of interest, the Pareto set. Previous related studies consider mainly the number of nondominated individuals within a population which greatly improved the understanding of the problem and has led to possible remedies. However, in certain cases this ansatz is not sophisticated enough to understand all phenomena, and can even be misleading. In this paper, we suggest alternatively to consider the probability to improve the situation of the population which can, to a certain extent, be measured by the sizes of the descent cones. As an example, we make some qualitative considerations on a general class of uni-modal test problems and conjecture that these problems get harder by adding an objective, but that this difference is practically not significant, and we support this by some empirical studies. Further, we address the scalability in the number of objectives observed in the literature. That is, we try to extract the challenges for the treatment of many-objective problems for evolution strategies based on our observations and use them to explain recent advances in this field.", "paper_title": "On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem", "paper_id": "WOS:000293740700002"}