{"auto_keywords": [{"score": 0.04517152217184391, "phrase": "intersecting_family"}, {"score": 0.00481495049065317, "phrase": "n-element_set"}, {"score": 0.004504193207111593, "phrase": "non-disjoint_intersection"}, {"score": 0.0036490529923833884, "phrase": "probability_p"}, {"score": 0.0034663083890589235, "phrase": "new_family"}, {"score": 0.003143849342926373, "phrase": "exact_maximum"}, {"score": 0.0030171910207671205, "phrase": "small_i."}, {"score": 0.002986329509791943, "phrase": "analogous_problem"}, {"score": 0.0028807718824400697, "phrase": "k-element_subsets"}, {"score": 0.0028221322455573624, "phrase": "exact_solution"}, {"score": 0.0026532596852754525, "phrase": "maximum_size"}, {"score": 0.0023694065215394593, "phrase": "proper_subset"}, {"score": 0.0022390533383717715, "phrase": "largest_inclusion-free_family"}], "paper_keywords": [""], "paper_abstract": "Let F be a family of subsets of an n-element set. It is called intersecting if every pair of its members has a non-disjoint intersection. It is well known that an intersecting family satisfies the inequality vertical bar F vertical bar <= 2(n-1). Suppose that vertical bar F vertical bar = 2(n-1) + i. Choose the members of F independently with probability p (delete them with probability 1 - p). The new family is intersecting with a certain probability. We try to maximize this probability by choosing F appropriately. The exact maximum is determined in this paper for some small i. The analogous problem is considered for families consisting of k-element subsets, but the exact solution is obtained only when the size of the family exceeds the maximum size of the intersecting family only by one. A family is said to be inclusion-free if no member is a proper subset of another one. It is well known that the largest inclusion-free family is the one consisting of all [n/2]-element subsets. We determine the most probably inclusion-free family too, when the number of members is (n([n/2])) + 1.", "paper_title": "Most Probably Intersecting Families of Subsets", "paper_id": "WOS:000302058500016"}