{"auto_keywords": [{"score": 0.04559872235894848, "phrase": "exhaustive_search"}, {"score": 0.04467661766774399, "phrase": "classification_accuracy"}, {"score": 0.03886254645290036, "phrase": "inherent_nonlinear_data_structures"}, {"score": 0.00481495049065317, "phrase": "optimal_feature_selection"}, {"score": 0.004774115617883476, "phrase": "nonlinear_data"}, {"score": 0.0046141941030386525, "phrase": "kernel_space"}, {"score": 0.004440648141548589, "phrase": "optimal_feature_subsets"}, {"score": 0.003841699919521703, "phrase": "existing_criterion_functions"}, {"score": 0.003776750773624222, "phrase": "optimal_feature_subset"}, {"score": 0.003527712410706358, "phrase": "kernel_hilbert_space"}, {"score": 0.003309152846742708, "phrase": "kullback-leibler"}, {"score": 0.0030515272121489447, "phrase": "rkhs."}, {"score": 0.0028623555849897632, "phrase": "popular_wrapper_approach"}, {"score": 0.002433843373780471, "phrase": "new_criterion_function"}, {"score": 0.0022731540640627307, "phrase": "efficient_algorithm"}, {"score": 0.002178144355363467, "phrase": "data_sets"}, {"score": 0.002159623311924437, "phrase": "inherent_nonlinear_structures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Feature selection", " Kernel methods", " Branch-and-bound"], "paper_abstract": "Branch-and-bound (B&B) feature selection finds optimal feature subsets without perforining an exhaustive search. However, the classification accuracy achievable with optimal B&B feature subsets is often inferior compared to the accuracy achievable with other algorithms that guarantee optimality. We argue this is due to the existing criterion functions that define the optimal feature subset but may not conceive inherent nonlinear data structures. Therefore, we propose B&B feature selection in Reproducing Kernel Hilbert Space (B&B-RKHS). This algorithm employs two existing criterion functions (Bhattacharyya distance, Kullback-Leibler divergence) and one new criterion function (mean class distance), however, all computed in RKHS. This enables B&B-RKHS to conceive inherent nonlinear data structures. The algorithm was experimentally compared to the popular wrapper approach that has to use an exhaustive search to guarantee optimality. The classification accuracy achieved with both methods was comparable. However, runtime of B&B-RKHS was superior using the two existing criterion functions and even completely out of reach using the new criterion function (about 60 times faster on average). Therefore, this paper proposes an efficient algorithm if feature subsets that guarantee optimality have to be selected in data sets with inherent nonlinear structures. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Optimal feature selection for nonlinear data using branch-and-bound in kernel space", "paper_id": "WOS:000365181400009"}