{"auto_keywords": [{"score": 0.048239757080509704, "phrase": "\"emotional\"_robots"}, {"score": 0.00481495049065317, "phrase": "emotional_robots"}, {"score": 0.0047587234712024775, "phrase": "common_objection"}, {"score": 0.004487241576747549, "phrase": "intuitive_response"}, {"score": 0.003732526540522333, "phrase": "emotional_communication"}, {"score": 0.0034510635632071978, "phrase": "ideal_emotional_communication\"_conditions"}, {"score": 0.003279559293934528, "phrase": "good_intention_presupposition"}, {"score": 0.003116551456858777, "phrase": "social_life"}, {"score": 0.002915514089373717, "phrase": "cross-entity_communication"}, {"score": 0.0027814417101979317, "phrase": "appropriate_emotional_responses"}, {"score": 0.002738131487658495, "phrase": "relevant_social_contexts"}, {"score": 0.0023220573674955776, "phrase": "contemporary_robot_designers"}, {"score": 0.002197891020396052, "phrase": "current_concerns"}, {"score": 0.0021049977753042253, "phrase": "three-fold_deception_response"}], "paper_keywords": ["Ethics of robotics", " emotions", " deception", " ideal speech conditions", " authenticity"], "paper_abstract": "A common objection to the use and development of \"emotional\" robots is that they are deceptive. This intuitive response assumes 1) that these robots intend to deceive, 2) that their emotions are not real, and 3) that they pretend to be a kind of entity they are not. We use these criteria to judge if an entity is deceptive in emotional communication (good intention, emotional authenticity, and ontological authenticity). They can also be regarded as \"ideal emotional communication\" conditions that saliently operate as presuppositions in our communications with other entities. While the good intention presupposition might be a bias or illusion we really need for sustaining the social life, in the future we may want to dispense with the other conditions in order to facilitate cross-entity communication. What we need instead are not \"authentic\" but appropriate emotional responses-appropriate to relevant social contexts. Criteria for this cannot be given a priori but must be learned-by humans and by robots. In the future, we may learn to live with \"emotional\" robots, especially if our values would change. However, contemporary robot designers who want their robots to receive trust from humans had better take into account current concerns about deception and create robots that do not evoke the three-fold deception response.", "paper_title": "Are Emotional Robots Deceptive?", "paper_id": "WOS:000323642000002"}