{"auto_keywords": [{"score": 0.004589124394375718, "phrase": "discrete-time_single-server_retrial_queue"}, {"score": 0.004188702178897384, "phrase": "service_area"}, {"score": 0.0036788184374592706, "phrase": "probability_theta"}, {"score": 0.003199864072042816, "phrase": "markov_chain"}, {"score": 0.003154012038613403, "phrase": "queueing_system"}, {"score": 0.003108814986752103, "phrase": "generating_functions"}, {"score": 0.002850875630787708, "phrase": "marginal_distributions"}, {"score": 0.0028100102841877835, "phrase": "orbit_size"}, {"score": 0.002601727192945944, "phrase": "performance_measures"}, {"score": 0.0022956075241520064, "phrase": "numerical_examples"}, {"score": 0.002198242191529977, "phrase": "crucial_performance_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Discrete-time queues", " Retrial queues", " Markov chain", " Bernoulli feedback"], "paper_abstract": "This paper analyzes a discrete-time single-server retrial queue with two classes of customers, where the blocked class-1 customers leave the system forever whereas the blocked class-2 customers leave the service area and enter the orbit and try their luck again some time later. Each class-2 customer after service either immediately returns to the orbit for another service with probability theta or leaves the system forever with probability (theta) over bar = 1 - theta, where 0 <= theta < 1. First, we study the Markov chain underlying the queueing system. The generating functions of the number of customers in the orbit and in the system are obtained along with the marginal distributions of the orbit size when the server is idle, busy with class-1 or busy with class-2. Some performance measures of the system in steady-state are also derived. Second, we investigate the relationship between our discrete-time system and its continuous counterpart. Finally, some numerical examples show the influence of the parameters on some crucial performance characteristics of the system. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Discrete-time Geo(1), Geo(2)(X)/G(1), G(2)/1 retrial queue with two classes of customers and feedback", "paper_id": "WOS:000286458200066"}