{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rssi_differences"}, {"score": 0.028986918779614155, "phrase": "average_localization_error"}, {"score": 0.004771196027464407, "phrase": "directional_antennas"}, {"score": 0.004727837281331949, "phrase": "wireless_sensor_networks"}, {"score": 0.004558289038745564, "phrase": "rssi_values"}, {"score": 0.004496280772084575, "phrase": "parabola_function"}, {"score": 0.004435122155498598, "phrase": "aoa"}, {"score": 0.00429558848734449, "phrase": "quadratic_regression_analysis"}, {"score": 0.004179480763003705, "phrase": "two-directional_antennas"}, {"score": 0.00393852508392789, "phrase": "signal_rssi_values"}, {"score": 0.003832031470970347, "phrase": "linear_function"}, {"score": 0.0036776458116294986, "phrase": "linear_regression_analysis"}, {"score": 0.0035945701438887282, "phrase": "rssi-fitting_functions"}, {"score": 0.0035133644847622383, "phrase": "novel_localization_scheme"}, {"score": 0.003310684108128973, "phrase": "sensor_node"}, {"score": 0.0024258208033731154, "phrase": "localization_errors"}, {"score": 0.0023067494372458427, "phrase": "estimated_locations"}, {"score": 0.0022857351723674004, "phrase": "maximum_density"}], "paper_keywords": [""], "paper_abstract": "In this paper, we fit RSSI values into a parabola function of the AoA between 0 degrees and 90 degrees by applying quadratic regression analysis. We also set up two-directional antennas with perpendicular orientations at the same position and fit the difference of the signal RSSI values of the two antennas into a linear function of the AoA between 0 degrees and 90 degrees by linear regression analysis. Based on the RSSI-fitting functions, we propose a novel localization scheme, called AoA Localization with RSSI Differences (ALRD), for a sensor node to quickly estimate its location with the help of two beacon nodes, each of which consists of two perpendicularly orientated directional antennas. We apply ALRD to a WSN in a 10 x 10m indoor area with two beacon nodes installed at two corners of the area. Our experiments demonstrate that the average localization error is 124 cm. We further propose two methods, named maximum-point minimum-diameter and maximum-point minimum-rectangle, to reduce localization errors by gathering more beacon signals within 1 s for finding the set of estimated locations of maximum density. Our results demonstrate that the two methods can reduce the average localization error by a factor of about 29%, to 89 cm.", "paper_title": "ALRD: AoA Localization with RSSI Differences of Directional Antennas for Wireless Sensor Networks", "paper_id": "WOS:000316481100001"}