{"auto_keywords": [{"score": 0.031315543324394984, "phrase": "explained_variance"}, {"score": 0.02880089396757314, "phrase": "ad_recognition"}, {"score": 0.00481495049065317, "phrase": "online_ad_intrusiveness"}, {"score": 0.004775726266706856, "phrase": "internet_advertising"}, {"score": 0.00467905143301368, "phrase": "continued_healthy_growth"}, {"score": 0.0045843245695654875, "phrase": "burst_internet_bubble"}, {"score": 0.004364696693320128, "phrase": "important_generic_characteristics"}, {"score": 0.003876226041373242, "phrase": "laboratory_study"}, {"score": 0.0036156119373414067, "phrase": "perceived_irritation"}, {"score": 0.0030818310926031024, "phrase": "high_levels"}, {"score": 0.003056682083784002, "phrase": "statistical_significance"}, {"score": 0.0029824560656987855, "phrase": "structural_equation_modeling"}, {"score": 0.002637433799290365, "phrase": "alternative_model"}, {"score": 0.0024398167078355224, "phrase": "user_control"}, {"score": 0.0023322317017275803, "phrase": "interaction_charts"}, {"score": 0.002266246304762945, "phrase": "future_studies"}], "paper_keywords": [""], "paper_abstract": "Internet advertising has shown signs of continued healthy growth in spite of the burst Internet bubble. Several types of ads have been used, and there are important generic characteristics that can be gleaned from these ads: whether they obscure content and whether users have the control to remove them. These factors were tested in a laboratory study with 258 student participants. It was hypothesized that the factors would predict intrusiveness, which would predict perceived irritation. This, in turn, would predict attitudes about the site and, finally, intentions to return. Intrusiveness was also predicted to directly relate to recognition of the ads. All hypotheses were supported at high levels of statistical significance using analysis of variance and structural equation modeling. Explained variance was very high for intrusiveness (42%) and irritation (63%), but very low explained variance for ad recognition (11%) resulted in an alternative model that doubled explained variance by removing intrusiveness as a mediator between the factors and ad recognition. The interaction between user control and obscuring of the content behaved as hypothesized, and interaction charts illustrate the effects as predicted. Future studies should continue to focus on characteristics rather than on types of ads and generalize the results to other types of participants and settings.", "paper_title": "An Experimental Study of Antecedents and Consequences of Online Ad Intrusiveness", "paper_id": "WOS:000260458400004"}