{"auto_keywords": [{"score": 0.044248716487613034, "phrase": "allocated_resources"}, {"score": 0.028546287145197344, "phrase": "k-moea"}, {"score": 0.00481495049065317, "phrase": "stochastic_extended_resource_investment_project_scheduling_problems"}, {"score": 0.004721162131188487, "phrase": "mission_capability_planning"}, {"score": 0.0045903243893123105, "phrase": "resource_investment_project_scheduling_problem"}, {"score": 0.004564593196155079, "phrase": "ripsp"}, {"score": 0.0045262653692203815, "phrase": "unconstrained_resources"}, {"score": 0.004388450908826472, "phrase": "real-world_applications"}, {"score": 0.0041136473765874815, "phrase": "new_version"}, {"score": 0.003802135020791801, "phrase": "resource_proportion_coefficient"}, {"score": 0.0037595947142663997, "phrase": "contribution_degree"}, {"score": 0.0034359094594153304, "phrase": "stochastic_version"}, {"score": 0.00293487292076612, "phrase": "robustness_measure"}, {"score": 0.0028214413724451442, "phrase": "seripsp"}, {"score": 0.0027977092483619896, "phrase": "multiobjective_optimization_model"}, {"score": 0.0027047548540516113, "phrase": "knowledge-based_multiobjective_evolutionary_algorithm"}, {"score": 0.0024856240785174444, "phrase": "useful_information"}, {"score": 0.0024234059612683032, "phrase": "nondominated_solutions"}, {"score": 0.002389514188569084, "phrase": "evolutionary_process"}, {"score": 0.002349467661235186, "phrase": "extracted_knowledge"}, {"score": 0.0022842059306412304, "phrase": "subsequent_search"}, {"score": 0.002233301265743633, "phrase": "synthetic_case_study"}, {"score": 0.0022207529556565854, "phrase": "randomly_generated_benchmark_instances"}, {"score": 0.0021651504858015364, "phrase": "proposed_k-moea."}, {"score": 0.0021529842700733974, "phrase": "experimental_results"}, {"score": 0.0021168934012668755, "phrase": "proposed_algorithm"}], "paper_keywords": ["Combinatorial optimization", " evolutionary application", " knowledge-based evolutionary algorithm", " stochastic extended resource investment project scheduling problems (SERIPSPs)"], "paper_abstract": "Planning problems, such as mission capability planning in defense, can traditionally be modeled as a resource investment project scheduling problem (RIPSP) with unconstrained resources and cost. This formulation is too abstract in some real-world applications. In these applications, the durations of tasks depend on the allocated resources. In this paper, we first propose a new version of RIPSPs, namely extended RIPSPs (ERIPSPs), in which the durations of tasks are a function of allocated resources. Moreover, we introduce a resource proportion coefficient to manifest the contribution degree of various resources to activities. Since the more realistic nature of projects in practice implies that the circumstances under which the plan will be executed are stochastic in nature, we present a stochastic version of ERIPSPs, namely stochastic extended RIPSPs (SERIPSPs). To solve SERIPSPs, we first use scenarios to capture the space of possibilities (i.e., stochastic elements of the problem). We focus on three sources of uncertainty: duration perturbation, resource breakdown, and precedence alteration. We propose a robustness measure for the solutions of SEPIPSPs when uncertainties interact. We then formulate an SERIPSP as a multiobjective optimization model with three optimization objectives: makespan, cost, and robustness. A knowledge-based multiobjective evolutionary algorithm (K-MOEA) is proposed to solve the problem. The mechanism of K-MOEA is simple and time efficient. The algorithm has two main characteristics. The first is that useful information (knowledge) contained in the obtained approximated nondominated solutions is extracted during the evolutionary process. The second is that extracted knowledge is utilized by updating the population periodically to guide subsequent search. The approach is illustrated using a synthetic case study. Randomly generated benchmark instances are used to analyze the performance of the proposed K-MOEA. The experimental results illustrate the effectiveness of the proposed algorithm and its potential for solving SERIPSPs.", "paper_title": "A Knowledge-Based Evolutionary Multiobjective Approach for Stochastic Extended Resource Investment Project Scheduling Problems", "paper_id": "WOS:000343702800009"}