{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_experience"}, {"score": 0.0046340196745259694, "phrase": "central_concern"}, {"score": 0.004583579470330216, "phrase": "human-computer_interaction"}, {"score": 0.004041359131062721, "phrase": "enlivening_potential"}, {"score": 0.003953806321226277, "phrase": "people-technology_relations"}, {"score": 0.003826007045267751, "phrase": "ongoing_project"}, {"score": 0.0035630518377071916, "phrase": "case_study"}, {"score": 0.003175792987190496, "phrase": "personal_transformation"}, {"score": 0.0028305047329728254, "phrase": "particular_medium_facilitate_enchantment"}, {"score": 0.0024276590297034064, "phrase": "personal_narratives"}, {"score": 0.002349073225500705, "phrase": "vast_pool"}, {"score": 0.002223696715077018, "phrase": "single_case"}, {"score": 0.0021049977753042253, "phrase": "in-depth_single-case_analyses"}], "paper_keywords": ["enchantment", " dialogism", " user experience", " case study", " transformative technology", " interpretative phenomenological analysis (IPA)"], "paper_abstract": "Although user experience is now widely accepted as a central concern in human-computer interaction and interaction design, its conceptual and methodological implications are still being worked out. Enchantment has become emblematic in this process by pointing to the enlivening potential of technology in people-technology relations. As part of an ongoing project to deepen our understanding of enchantment in user experience, this paper presents a case study of one person's enchantment with their Internet uses. The analysis suggests three salient aspects of this enchantment: responsive crossing of boundaries; dialogue in personal transformation; and the potential endlessness and depths of enchantment. It also suggests that some characteristics of interaction with the particular medium facilitate enchantment: personal control over self-presentation; the paradox of being able to carefully craft meaning from what is normally chaotic; the possibility of finding and constructing personal narratives online; playing in a vast pool of information. Reflection on the results of this single case analysis points to the value for understanding user experience of in-depth single-case analyses that focus on the personal and particular.", "paper_title": "The enchanting potential of technology: a dialogical case study of enchantment and the Internet", "paper_id": "WOS:000255542000007"}