{"auto_keywords": [{"score": 0.05007554822480519, "phrase": "sram-based_fpgas"}, {"score": 0.04265027099832193, "phrase": "fpga"}, {"score": 0.004732215871738028, "phrase": "new_method"}, {"score": 0.0045709675813472884, "phrase": "configuration_bits"}, {"score": 0.004389745162172933, "phrase": "main_advantages"}, {"score": 0.004339293854115301, "phrase": "previous_methods"}, {"score": 0.003933118499284644, "phrase": "fault_injection_process"}, {"score": 0.0036482665232275583, "phrase": "first_step"}, {"score": 0.0035855066449812273, "phrase": "fault_injection_technique"}, {"score": 0.0033257460346754718, "phrase": "potential_misbehavior"}, {"score": 0.0031937337757356526, "phrase": "second_step"}, {"score": 0.0031026497891826726, "phrase": "whole_system"}, {"score": 0.0026846436189970446, "phrase": "faulty_bitstream"}, {"score": 0.0021049977753042253, "phrase": "new_fault_injection_process"}], "paper_keywords": ["FPGA", " Fault injection techniques", " SEU", " fault tolerance"], "paper_abstract": "A new method for injecting faults in the configuration bits of SRAM-based FPGAs is proposed. The main advantages over previous methods are its ability to simultaneously inject several faults or bit-flips in the FPGA by \"pipelining\" the fault injection process. The design to be tested is divided into modules. The first step in the fault injection technique would be inserting one fault in each of the modules and observing the potential misbehavior of these modules. In the second step the effects on the whole system of the misbehavior of the module are independently evaluated. Using this technique makes possible to inject several faults when reconfiguring the FPGA with the faulty bitstream, while other techniques were able to insert only one fault on each reconfiguration. Thus the speed in which faults are injected is significantly increased and the time needed to conduct the experiment is shortened. A simulation is described to validate the new fault injection process.", "paper_title": "A New Fault Injection Approach to Study the Impact of Bitflips in the Configuration of SRAM-Based FPGAs", "paper_id": "WOS:000289766500007"}