{"auto_keywords": [{"score": 0.04709882593581103, "phrase": "k"}, {"score": 0.00481495049065317, "phrase": "residuated_lattices"}, {"score": 0.004461634909525319, "phrase": "algebraizable_logic"}, {"score": 0.0035778632599436024, "phrase": "lower_bounds"}, {"score": 0.003549245218355768, "phrase": "truth_values"}, {"score": 0.0034508665218929745, "phrase": "second_logic"}, {"score": 0.0033417571465258, "phrase": "abstract_algebraic_logic"}, {"score": 0.003197367018356247, "phrase": "leibniz"}, {"score": 0.0031590250068577867, "phrase": "frege_hierarchies"}, {"score": 0.0027667539384678814, "phrase": "generalized_heyting_algebras"}, {"score": 0.0025840347813610815, "phrase": "new_logic"}, {"score": 0.0025224615049571427, "phrase": "hilbert_style_axiomatic_system"}, {"score": 0.0024822279007111255, "phrase": "gentzen_style_sequent_calculus"}, {"score": 0.0022812715029149216, "phrase": "truth-preserving_logic"}, {"score": 0.002147749117443578, "phrase": "modus_ponens"}, {"score": 0.002105021559854221, "phrase": "adjunction"}], "paper_keywords": ["Substructural logic", " many-valued logic", " degrees of truth", " residuated lattices", " non-protoalgebraic logic", " Gentzen system", " Tarski-style condition"], "paper_abstract": "Let K be a variety of (commutative, integral) residuated lattices. The substructural logic usually associated with K is an algebraizable logic that has K as its equivalent algebraic semantics, and is a logic that preserves truth, i.e. I is the only truth value preserved by the inferences of the logic. In this article, we introduce another logic associated with K, namely the logic that preserves degrees of truth, in the sense that it preserves lower bounds of truth values in inferences. We study this second logic mainly from the point of view of abstract algebraic logic. We determine its algebraic models and we classify it in the Leibniz and the Frege hierarchies: we show that it is always fully selfextensional, that for most varieties K it is non-protoalgebraic, and that it is algebraizable if and only K is a variety of generalized Heyting algebras, in which case it coincides with the logic that preserves truth. We also characterize the new logic in three ways: by a Hilbert style axiomatic system, by a Gentzen style sequent calculus and by a set of conditions on its closure operator. Concerning the relation between the two logics. we prove that the truth-preserving logic is the extension of the one that preserves degrees of truth with either the rule of Modus Ponens or the rule of Adjunction for the fusion connective.", "paper_title": "Logics Preserving Degrees of Truth from Varieties of Residuated Lattices", "paper_id": "WOS:000273177000008"}