{"auto_keywords": [{"score": 0.032052646817335, "phrase": "approximation_ratio"}, {"score": 0.00481495049065317, "phrase": "approximate_stability"}, {"score": 0.004765686919942249, "phrase": "selfish_tasks"}, {"score": 0.0046526806928044485, "phrase": "scheduling_game"}, {"score": 0.004557943646825813, "phrase": "selfish_agents"}, {"score": 0.004140613635632826, "phrase": "social_objective"}, {"score": 0.003987275549870311, "phrase": "last_agent"}, {"score": 0.003761350406092476, "phrase": "obtained_schedule"}, {"score": 0.0033585620455333434, "phrase": "alpha-approximate_nash_equilibria"}, {"score": 0.0032788123043064475, "phrase": "sufficient_incentive"}, {"score": 0.002686643644493607, "phrase": "local_policy"}, {"score": 0.002640889905429026, "phrase": "longest_processing_time"}, {"score": 0.0025429488129788077, "phrase": "slight_modification"}, {"score": 0.0025168721570288295, "phrase": "classical_polynomial_time_approximation_scheme"}, {"score": 0.002499667144091383, "phrase": "ptas"}, {"score": 0.002474031930013516, "phrase": "graham"}, {"score": 0.0023416540209862803, "phrase": "constant_value"}, {"score": 0.002201187194326849, "phrase": "best_possible_value"}, {"score": 0.002141487053045766, "phrase": "local_policies"}, {"score": 0.0021049985590406457, "phrase": "lpt."}], "paper_keywords": [""], "paper_abstract": "We consider a scheduling game, where a set of selfish agents (traffic loads) want to be routed in exactly one of the two parallel links of a system. Every agent aims to minimize her own completion time, while the social objective is the makespan, i.e. the time at which the last agent finishes her execution. We study the problem of optimizing the makespan under the constraint that the obtained schedule is a (pure) Nash equilibrium, i.e. a schedule in which no agent has incentive to unilaterally change her strategy (link). We consider a relaxation of the notion of equilibrium by considering alpha-approximate Nash equilibria where an agent does not have sufficient incentive (w.r.t. the value of alpha) to unilaterally change her strategy. Our main contribution is the study of the tradeoff between the approximation ratio for the makespan and the value of a. We first give an algorithm which provides a solution with an approximation ratio of 8/7 for the makespan and which is a 3-approximate Nash equilibrium, provided that the local policy of each link is Longest Processing Time (LPT). Furthermore, we show that a slight modification of the classical Polynomial Time Approximation Scheme (PTAS) of Graham allows to obtain a schedule whose makespan is arbitrarily close to the optimum while keeping a constant value for alpha. Finally, we give bounds establishing relations between the value of alpha and the best possible value of the approximation ratio, provided that the local policies of the links are LPT.", "paper_title": "The price of approximate stability for scheduling selfish tasks on two links", "paper_id": "WOS:000241469500014"}