{"auto_keywords": [{"score": 0.03485917626028694, "phrase": "detection_systems"}, {"score": 0.0047057084749407485, "phrase": "drive-by-download_web_malware"}, {"score": 0.004556901872357751, "phrase": "explosive_growth"}, {"score": 0.004473982381245469, "phrase": "new_technologies"}, {"score": 0.004195418010131832, "phrase": "web-based_applications"}, {"score": 0.004157058883925715, "phrase": "traditional_desktop_applications"}, {"score": 0.004062682236016889, "phrase": "web_applications"}, {"score": 0.0039341294012600085, "phrase": "desktop_applications"}, {"score": 0.0031845067058084583, "phrase": "new_obfuscation_techniques"}, {"score": 0.00290473242917264, "phrase": "malware_detection_systems"}, {"score": 0.00286493504971388, "phrase": "proposed_techniques"}, {"score": 0.002748775748298028, "phrase": "obfuscated_malware"}, {"score": 0.0025420267431501367, "phrase": "large_number"}, {"score": 0.002276283303864666, "phrase": "existing_malware_detection_systems"}, {"score": 0.0021739117830106365, "phrase": "new_techniques"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["web malware", " detection systems", " obfuscation", " JavaScript", " HTML5"], "paper_abstract": "The Web is experiencing an explosive growth in the last years. New technologies are introduced at a very fast pace with the aim of narrowing the gap between web-based applications and traditional desktop applications. The results are web applications that look and feel almost like desktop applications while retaining the advantages of being originated from the Web. However, these advancements come at a price. The same technologies used to build responsive, pleasant, and fully featured web applications can also be used to write web malware able to escape detection systems. In this article, we present new obfuscation techniques, on the basis of some of the features of the upcoming HTML5 standard, which can be used to deceive malware detection systems. The proposed techniques have been experimented on a reference set of obfuscated malware. Our results show that the malware rewritten using our obfuscation techniques goes undetected while being analyzed by a large number of detection systems. The same detection systems were able to correctly identify the same malware in its original unobfuscated form. We also provide some hints about how the existing malware detection systems can be modified in order to cope with these new techniques. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Using HTML5 to prevent detection of drive-by-download web malware", "paper_id": "WOS:000351878800007"}