{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiple_scattering"}, {"score": 0.03151653932648417, "phrase": "basis_intensities"}, {"score": 0.00471193241675062, "phrase": "natural_scenes"}, {"score": 0.00457138247462329, "phrase": "virtual_reality"}, {"score": 0.004531997388646422, "phrase": "computer_games"}, {"score": 0.004473552224535518, "phrase": "flight_simulators"}, {"score": 0.004247180402119585, "phrase": "outdoor_scenes"}, {"score": 0.0036500346000495317, "phrase": "light_inside_clouds"}, {"score": 0.003602922164562919, "phrase": "important_factor"}, {"score": 0.0035564156572789473, "phrase": "realistic_images"}, {"score": 0.0032191849045822415, "phrase": "fast_method"}, {"score": 0.003069362581661702, "phrase": "proposed_method"}, {"score": 0.002913837945508097, "phrase": "preprocess_step"}, {"score": 0.0026835045963349647, "phrase": "point_light_sources"}, {"score": 0.0024183363693242943, "phrase": "rendering_process"}, {"score": 0.0022857899334246946, "phrase": "weighted_sum"}, {"score": 0.0021511430180912164, "phrase": "wavelet_transformation"}, {"score": 0.0021049977753042253, "phrase": "real-time_rendering"}], "paper_keywords": ["real-time rendering", " clouds", " lightning", " multiple scattering"], "paper_abstract": "Methods for rendering natural scenes are used in many applications such as virtual reality, computer games, and flight simulators. In this paper, we focus on the rendering of outdoor scenes that include clouds and lightning. In such scenes, the intensity at a point in the clouds has to be calculated by taking into account the illumination due to lightning. The multiple scattering of light inside clouds is an important factor when creating realistic images. However, the computation of multiple scattering is very time-consuming. To address this problem, this paper proposes a fast method for rendering clouds that are illuminated by lightning. The proposed method consists of two processes. First, basis intensities are prepared in a preprocess step. The basis intensities are the intensities at points in the clouds that are illuminated by a set of point light sources. In this precomputation, both the direct light and also indirect light (i.e., multiple scattering) are taken into account. In the rendering process, the intensities of clouds are calculated in real-time by using the weighted sum of the basis intensities. A further increase in speed is achieved by using a wavelet transformation. Our method achieves the real-time rendering of realistic clouds illuminated by lightning.", "paper_title": "A fast rendering method for clouds illuminated by lightning taking into account multiple scattering", "paper_id": "WOS:000249207600010"}