{"auto_keywords": [{"score": 0.02608804045956967, "phrase": "skeleton-driven_animation"}, {"score": 0.00481495049065317, "phrase": "consistent_volume_parameterization"}, {"score": 0.00440976345264104, "phrase": "important_but_time-consuming_task"}, {"score": 0.004134372859330047, "phrase": "character's_skeleton"}, {"score": 0.0038085117064624208, "phrase": "animation_transfer_system"}, {"score": 0.0036553070575015344, "phrase": "well-edited_character_animation"}, {"score": 0.003367077034382727, "phrase": "binding_weights"}, {"score": 0.0031938648476635225, "phrase": "static_model"}, {"score": 0.0030833537429977797, "phrase": "transferring_process"}, {"score": 0.0026313840069327713, "phrase": "consistent_surface"}, {"score": 0.002409503258044183, "phrase": "new_character_model"}, {"score": 0.0023674192513753996, "phrase": "prior_setting"}, {"score": 0.0021049977753042253, "phrase": "crowd_animation"}], "paper_keywords": [""], "paper_abstract": "To edit or create the animation of a 3D character model has always been an important but time-consuming task, since the animator usually needs to set up the character's skeleton, paint its binding weights, and adjust its key-poses. Hence, we propose an animation transfer system in this paper to take a well-edited character animation as the input. Then, the system can transfer the skeleton, binding weights, and other attributes of the given character model to another static model with only few corresponding feature points specified. The transferring process is based on a mapping between the space around two character meshes. In this paper, the mapping is called consistent volume parameterization, which inherits consistent surface parameterization. Hence, the animator can start to create a skeleton-driven animation for the new character model without any prior setting. Moreover, our system is also capable of cloning a skeleton-driven animation to several other character models which can be used in a crowd animation.", "paper_title": "Skeleton-driven animation transfer based on consistent volume parameterization", "paper_id": "WOS:000239486600007"}