{"auto_keywords": [{"score": 0.04573228268553137, "phrase": "energy_consumption"}, {"score": 0.00481495049065317, "phrase": "energy-aware_scheduling"}, {"score": 0.004761494044422926, "phrase": "disk_storage_systems"}, {"score": 0.004187614134377688, "phrase": "energy-aware_disk_scheduling_problem"}, {"score": 0.004049590638590415, "phrase": "arrival_pattern"}, {"score": 0.0038510053729959074, "phrase": "corresponding_optimization_problems"}, {"score": 0.0038089855407124062, "phrase": "np"}, {"score": 0.0036826452656927877, "phrase": "optimal_and_heuristic_scheduling_algorithms"}, {"score": 0.0034824716857663114, "phrase": "storage_system"}, {"score": 0.0032747835779400212, "phrase": "energy_model"}, {"score": 0.0026626797255348287, "phrase": "energy_optimized_location"}, {"score": 0.002354302193867031, "phrase": "write_offloading_technique"}, {"score": 0.0021049977753042253, "phrase": "request_response_time"}], "paper_keywords": ["Energy-aware systems", " storage management", " scheduling"], "paper_abstract": "This paper deals with the problem of scheduling requests on disks for minimizing energy consumption. We first analyze several versions of the energy-aware disk scheduling problem based on assumptions on the arrival pattern of the requests. We show that the corresponding optimization problems are NP-complete. Then both optimal and heuristic scheduling algorithms are proposed to maximize the energy saving of a storage system. We evaluate our approach using multiple realistic I/O traces, disk simulator and energy model. The results show that we significantly reduce energy consumption up to 55 percent and achieve fewer disk spin-up/down operations and shorter request response time as compared to other approaches. Since our approach attempts to dynamically assign each request to an energy optimized location, it can also benefit from other traditional static or semi-static solutions that rely on data placement or migration. Finally, we show that a write offloading technique can also be adapted into our solution to minimize the impact from write re quests in terms of energy consumption and request response time.", "paper_title": "Exploiting Replication for Energy-Aware Scheduling in Disk Storage Systems", "paper_id": "WOS:000362791400010"}