{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "menu_navigation"}, {"score": 0.04976102042618512, "phrase": "in-vehicle_technologies"}, {"score": 0.049445419527232116, "phrase": "auditory_menu"}, {"score": 0.033099135191344414, "phrase": "secondary_task"}, {"score": 0.00470396687329822, "phrase": "dual_task_performance"}, {"score": 0.004595529592539951, "phrase": "auditory_display_research"}, {"score": 0.00448958076531243, "phrase": "limited_range"}, {"score": 0.004089556946377719, "phrase": "enhanced_auditory_menu_cues"}, {"score": 0.004048860957751714, "phrase": "simulated_driving_context"}, {"score": 0.004008568312912331, "phrase": "advanced_auditory_cues"}, {"score": 0.0036028592508983402, "phrase": "dual_task_paradigm"}, {"score": 0.0035079946851603186, "phrase": "vehicle's_infotainment_system"}, {"score": 0.0032489004068215407, "phrase": "alphabetized_list"}, {"score": 0.0030391594477173485, "phrase": "typical_visual-only_manner"}, {"score": 0.0028907818309736348, "phrase": "tts"}, {"score": 0.0028334469422586304, "phrase": "additional_auditory_cues"}, {"score": 0.002470987929071079, "phrase": "auditory_menus"}, {"score": 0.002421975107313603, "phrase": "perceived_workload_scores"}, {"score": 0.002389839896897424, "phrase": "user_preferences"}, {"score": 0.002366017944545902, "phrase": "enhanced_auditory_cue_types"}, {"score": 0.002288309252254464, "phrase": "enhanced_auditory_cues"}, {"score": 0.0021049977753042253, "phrase": "multiple_resources_theory"}], "paper_keywords": [""], "paper_abstract": "Auditory display research for driving has mainly examined a limited range of tasks (e.g., collision warnings, cell phone tasks). In contrast, the goal of this project was to evaluate the effectiveness of enhanced auditory menu cues in a simulated driving context. The advanced auditory cues of \"spearcons\" (compressed speech cues) and \"spindex\" (a speech-based index cue) were predicted to improve both menu navigation and driving. Two experiments used a dual task paradigm in which users selected songs on the vehicle's infotainment system. In Experiment 1, 24 undergraduates played a simple, perceptual-motor ball-catching game (the primary task; a surrogate for driving), and navigated through an alphabetized list of 150 song titles-rendered as an auditory menu-as a secondary task. The menu was presented either in the typical visual-only manner, or enhanced with text-to-speech (TTS), or TTS plus one of three types of additional auditory cues. In Experiment 2, 34 undergraduates conducted the same secondary task while driving in a simulator. In both experiments, performance on both the primary task (success rate of the game or driving performance) and the secondary task (menu search time) was better with the auditory menus than with no sound. Perceived workload scores as well as user preferences favored the enhanced auditory cue types. These results show that adding audio, and enhanced auditory cues in particular, can allow a driver to operate the menus of in-vehicle technologies more efficiently while driving more safely. Results are discussed with multiple resources theory.", "paper_title": "Menu Navigation With In-Vehicle Technologies: Auditory Menu Cues Improve Dual Task Performance, Preference, and Workload", "paper_id": "WOS:000346194300001"}