{"auto_keywords": [{"score": 0.047137645870228666, "phrase": "large_image_databases"}, {"score": 0.00481495049065317, "phrase": "image_retrieval"}, {"score": 0.004434491600123024, "phrase": "interactive_fast_browsing"}, {"score": 0.004188779311510202, "phrase": "system's_graphical_user_interface"}, {"score": 0.003894446653225716, "phrase": "mental_picture"}, {"score": 0.003857606273328462, "phrase": "database_content"}, {"score": 0.0034635798581019073, "phrase": "interactive_speed"}, {"score": 0.003109674734960237, "phrase": "integrated_approach"}, {"score": 0.002791829974944666, "phrase": "visual_cues"}, {"score": 0.00267905164093555, "phrase": "image_clusters"}, {"score": 0.0026285439034014904, "phrase": "intuitive_correspondences"}, {"score": 0.002578985917923144, "phrase": "database_contents"}, {"score": 0.0024826484631019167, "phrase": "binary_tree_data_structure"}, {"score": 0.0024591303299708604, "phrase": "sequential_maximal_information_coding_algorithm"}, {"score": 0.0023974961635593135, "phrase": "n-bit_binary_index"}, {"score": 0.002359759876402679, "phrase": "users'_action"}, {"score": 0.0023152577218214804, "phrase": "experimental_results"}, {"score": 0.002242940472941759, "phrase": "pre-filtering_tool"}, {"score": 0.0022006365282969454, "phrase": "fast_image_retrieval"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["image database", " image retrieval", " browsing/navigation", " entropy", " information theory", " color"], "paper_abstract": "In this work, we are interested in technologies that will allow users to actively browse and navigate large image databases and to retrieve images through interactive fast browsing and navigation. The development of a browsing/navigation-based image retrieval system has at least two challenges. The first is that the system's graphical user interface (GUI) should intuitively reflect the distribution of the images in the database in order to provide the users with a mental picture of the database content and a sense of orientation during the course of browsing/ravigation. The second is that it has to be fast and responsive, and be able to respond to users actions at an interactive speed in order to engage the users. We have developed a method that attempts to address these challenges of a browsing/navigation based image retrieval systems. The unique feature of the method is that we take an integrated approach to the design of the browsing/navigation GUI and the indexing and organization of the images in the database. The GUI is tightly coupled with the algorithms that run in the background. The visual cues of the GUI are logically linked with various parts of the repository (image clusters of various particular visual themes) thus providing intuitive correspondences between the GUI and the database contents. In the backend, the images are organized into a binary tree data structure using a sequential maximal information coding algorithm and each image is indexed by an n-bit binary index thus making response to users' action very fast. We present experimental results to demonstrate the usefulness of our method both as a pre-filtering tool and for developing browsing/navigation systems for fast image retrieval from large image databases. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Visual guided navigation for image retrieval", "paper_id": "WOS:000245745000007"}