{"auto_keywords": [{"score": 0.04957944257284285, "phrase": "morphological_similarity"}, {"score": 0.021224162750544597, "phrase": "dt_images"}, {"score": 0.019949296780723245, "phrase": "water_molecules"}, {"score": 0.010447642841853953, "phrase": "diffusion_tensors"}, {"score": 0.00481495049065317, "phrase": "perturbation_theory"}, {"score": 0.004604969434921559, "phrase": "neighboring_voxels"}, {"score": 0.004568871736067739, "phrase": "dt_image"}, {"score": 0.004521179256835894, "phrase": "corresponding_locations"}, {"score": 0.004497519188779653, "phrase": "different_dt_images"}, {"score": 0.004450568197899267, "phrase": "fundamental_and_ubiquitous_operation"}, {"score": 0.0035512365087537476, "phrase": "comparing_tensor_elements"}, {"score": 0.0033961782274326948, "phrase": "individual_elements"}, {"score": 0.0033168393757707164, "phrase": "diffusion_properties"}, {"score": 0.0030897374036550043, "phrase": "noise_levels"}, {"score": 0.0030017207229983385, "phrase": "homogeneous_region"}, {"score": 0.0029547698888028697, "phrase": "random_perturbations"}, {"score": 0.0028705869275170892, "phrase": "similarity_values"}, {"score": 0.0027741761880779535, "phrase": "small_changes"}, {"score": 0.002530359917257626, "phrase": "corresponding_eigenvectors"}, {"score": 0.002253949158637255, "phrase": "favorable_performance_characteristics"}, {"score": 0.0022012352288597074, "phrase": "additional_postprocessing_operations"}, {"score": 0.0021667778225942227, "phrase": "dti_datasets"}, {"score": 0.0021441057555396013, "phrase": "image_segmentation"}, {"score": 0.0021328586481696157, "phrase": "fiber_tracking"}, {"score": 0.002121670413111008, "phrase": "noise_filtering"}, {"score": 0.0021049977753042253, "phrase": "spatial_normalization"}], "paper_keywords": ["diffusion tensor", " euclidean distance", " logarithmic euclidean distance", " perturbation theory", " rician noise", " riemannian distance"], "paper_abstract": "Computing the morphological similarity of diffusion tensors (DTs) at neighboring voxels within a DT image, or at corresponding locations across different DT images, is a fundamental and ubiquitous operation in the postprocessing of DT images. The morphological similarity of DTs typically has been computed using either the principal directions (PDs) of DTs (i.e., the direction along which water molecules diffuse preferentially) or their tensor elements. Although comparing PDs allows the similarity of one morphological feature of DTs to be visualized directly in eigenspace, this method takes into account only a single eigenvector, and it is therefore sensitive to the presence of noise in the images that can introduce error intothe estimation of that vector. Although comparing tensor elements, rather than PDs, is comparatively more robust to the effects of noise, the individual elements of a given tensor do not directly reflect the diffusion properties of water molecules. We propose a measure for computing the morphological similarity of DTs that uses both their eigenvalues and eigenvectors, and that also accounts for the noise levels present in DT images. Our measure presupposes that DTs in a homogeneous region within or across DT images are random perturbations of one another in the presence of noise. The similarity values that are computed using our method are smooth (in the sense that small changes in eigenvalues and eigenvectors cause only small changes in similarity), and they are symmetric when differences in eigenvalues and eigenvectors; are also symmetric. In addition, our method does not presuppose that the corresponding eigenvectors across two DTs have been identified accurately, an assumption that is problematic in the presence of noise. Because we compute the similarity between DTs using their eigenspace components, our similarity measure relates directly to both the magnitude and the direction of the diffusion of water molecules. The favorable performance characteristics of our measure offer the prospect of substantially improving additional postprocessing operations that are commonly performed on DTI datasets, such as image segmentation, fiber tracking, noise filtering, and spatial normalization.", "paper_title": "Using perturbation theory to compute the morphological similarity of diffusion tensors", "paper_id": "WOS:000255433500002"}