{"auto_keywords": [{"score": 0.03420914292086825, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "noisy_response_measurements"}, {"score": 0.004720606036240263, "phrase": "probabilistic_substructure_identification"}, {"score": 0.0046741260449047976, "phrase": "health_monitoring_methodology"}, {"score": 0.004628101576367193, "phrase": "linear_systems"}, {"score": 0.004339744430169516, "phrase": "uncertain_parameters"}, {"score": 0.004089475312474684, "phrase": "entire_structure"}, {"score": 0.0035249212996297332, "phrase": "substructuring_approach"}, {"score": 0.0033050703534275717, "phrase": "critical_substructures"}, {"score": 0.0031609252620168446, "phrase": "interface_measurements"}, {"score": 0.0031297538950335233, "phrase": "excitation_measurements"}, {"score": 0.003038066486989815, "phrase": "stochastic_model"}, {"score": 0.002657511557782467, "phrase": "parametric_form"}, {"score": 0.002618278365749875, "phrase": "spectral_density"}, {"score": 0.002454835845644037, "phrase": "proposed_approach"}, {"score": 0.0022563636435096457, "phrase": "response_data"}, {"score": 0.0021049977753042253, "phrase": "undamaged_and_possibly_damaged_structure"}], "paper_keywords": [""], "paper_abstract": "A probabilistic substructure identification and health monitoring methodology for linear systems is presented using measured response time histories only. A very large number of uncertain parameters have to be identified if one considers the updating of the entire structure. For identifiability, one then would require a very large number of sensors. Furthermore, even when such a large number of sensors are available, processing of vast amount of the corresponding data raises computational difficulties. In this article a substructuring approach is proposed, which allows for the identification and monitoring of some critical substructures only. The proposed method does not require any interface measurements and/or excitation measurements. No information regarding the stochastic model of the input is required. Specifically, the method does not require the response to be stationary and does not assume any knowledge of the parametric form of the spectral density of the input. Therefore, the method has very wide applicability. The proposed approach allows one to obtain not only the most probable values of the updated model parameters but also their associated uncertainties using only one set of response data. The probability of damage can be computed directly using data from the undamaged and possibly damaged structure. A hundred-story building model is used to illustrate the proposed method.", "paper_title": "Substructure identification and health monitoring using noisy response measurements only", "paper_id": "WOS:000235842400006"}