{"auto_keywords": [{"score": 0.030489443458718794, "phrase": "service_requests"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_file_sharing_networks"}, {"score": 0.004092168350316413, "phrase": "system_performance"}, {"score": 0.0039333604469462356, "phrase": "incentive_scheme"}, {"score": 0.0035705347414368726, "phrase": "topology_formation"}, {"score": 0.00304737045343781, "phrase": "reputation_system"}, {"score": 0.002994178996584381, "phrase": "users'_past_contributions"}, {"score": 0.002670296619878048, "phrase": "resource-contributing_users"}, {"score": 0.0023294877978314774, "phrase": "bagla"}, {"score": 0.0023090525096074264, "phrase": "kapalia's_approach"}, {"score": 0.0022192891418394514, "phrase": "iutopform_approach"}, {"score": 0.0021901485584955487, "phrase": "overall_utility"}, {"score": 0.0021330078238529443, "phrase": "utility_function"}, {"score": 0.0021049977753042253, "phrase": "topology_formation_algorithm"}], "paper_keywords": ["incentive scheme", " pricing", " peer-to-peer networks", " simulation", " market-management", " trust", " reputation", " economics", " utility function"], "paper_abstract": "Currently, peer-to-peer (P2P) networks suffer from users that do not contribute any kind of resources to the P2P community. Those users, which are called freeriders, benefit largely from contributions of other users but reduce the system performance for contributing users. This paper proposes an incentive scheme for P2P networks that motivates users to collaborate within the system. The solution that we propose has an impact on the topology formation of a P2P network. Using our market-managed topology formation algorithm (IUTopForm) for P2P networks, contributing users will be clustered within clubs that are different to clubs of freeriders. The differentiation is possible because of a reputation system, which considers users' past contributions. The effect of this approach is that service requests of freeriders will take longer to be answered (if at all) than service requests of resource-contributing users. We illustrate this effect through measurements with our P2P network simulator. We also show that clubs are only interconnected if the difference in their reputation values is not large. The comparison with Bagla and Kapalia's approach, which inspired our work, shows that the IUTopForm approach improves the overall utility of the system. The utility function and the topology formation algorithm are described in detail within this paper.", "paper_title": "A market-managed topology formation algorithm for peer-to-peer file sharing networks", "paper_id": "WOS:000239426900007"}