{"auto_keywords": [{"score": 0.04228088381866382, "phrase": "top_words"}, {"score": 0.032029405199700565, "phrase": "hyperclique_patterns"}, {"score": 0.00481495049065317, "phrase": "pattern_preservation"}, {"score": 0.0047846807459660376, "phrase": "topic_extraction"}, {"score": 0.004534917050845832, "phrase": "document_dataset"}, {"score": 0.003972110690317813, "phrase": "highest_within-cluster_degrees"}, {"score": 0.003467940281748612, "phrase": "single_cluster"}, {"score": 0.0033707740216185815, "phrase": "cluster_topic"}, {"score": 0.002905752244360772, "phrase": "new_bipartite_formulation"}, {"score": 0.0028692628457408025, "phrase": "word_hypercliques"}, {"score": 0.0028511898481970595, "phrase": "document_hypercliques"}, {"score": 0.0028332303659245085, "phrase": "super_vertices"}, {"score": 0.002753798541636975, "phrase": "clustering_process"}, {"score": 0.002719212119462965, "phrase": "real-world_data_sets"}, {"score": 0.0026935568995690947, "phrase": "better_clustering_results"}, {"score": 0.002520604609793834, "phrase": "partitioned_bipartite"}, {"score": 0.0025047222344966678, "phrase": "co-preserved_patterns"}, {"score": 0.0024654516678953658, "phrase": "different_clustering-_related_functions"}, {"score": 0.0023587312574818208, "phrase": "clustered_search_results"}, {"score": 0.0023438664524018634, "phrase": "keyword_queries"}, {"score": 0.0022423971916457684, "phrase": "current_query"}, {"score": 0.002125059113175028, "phrase": "top_ones"}, {"score": 0.0021049977753042253, "phrase": "standard_bipartite_formulation"}], "paper_keywords": ["hyperclique pattern", " pattern preserving", " bipartite partitioning", " co-clustering", " topic extraction"], "paper_abstract": "The duality between document and word clustering naturally leads to the consideration of storing the document dataset in a bipartite. With documents and words modeled as vertices on two sides respectively, partitioning such a graph yields a co-clustering of words and documents. The topic of each cluster can then be represented by the top words and documents that have highest within-cluster degrees. However, such claims may fail if top words and documents are selected simply because they are very general and frequent. In addition, for those words and documents across several topics, it may not be proper to assign them to a single cluster. In other words, to precisely capture the cluster topic, we need to identify those micro-sets of words/documents that are similar among themselves and as a whole, representative of their respective topics. Along this line, in this paper, we use hyperclique patterns, strongly affiliated words/documents, to define such micro-sets. We introduce a new bipartite formulation that incorporates both word hypercliques and document hypercliques as super vertices. By co-preserving hyperclique patterns during the clustering process, our experiments on real-world data sets show that better clustering results can be obtained in terms of various external clustering validation measures and the cluster topic can be more precisely identified. Also, the partitioned bipartite with co-preserved patterns naturally lends itself to different clustering- related functions in search engines. To that end, we illustrate such an application, returning clustered search results for keyword queries. We show that the topic of each cluster with respect to the current query can be identified more accurately with the words and documents from the patterns than with those top ones from the standard bipartite formulation.", "paper_title": "Co-clustering bipartite with pattern preservation for topic extraction", "paper_id": "WOS:000253753000007"}