{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "open_source_software"}, {"score": 0.041105497211575866, "phrase": "oss_institutionalization"}, {"score": 0.0352221792849628, "phrase": "public_discourse"}, {"score": 0.004610715835407973, "phrase": "information_systems"}, {"score": 0.004403158130041613, "phrase": "recent_examples"}, {"score": 0.00405931864967869, "phrase": "closer_look"}, {"score": 0.004004670513560508, "phrase": "oss._objective"}, {"score": 0.003602819853062483, "phrase": "institutional_theory"}, {"score": 0.0030286034168878835, "phrase": "front-end_applications"}, {"score": 0.0029959082125682918, "phrase": "small_and_medium_enterprises"}, {"score": 0.0028764048059439205, "phrase": "public_sectors"}, {"score": 0.002845347968246455, "phrase": "rhetorical_theory"}, {"score": 0.00271704379695679, "phrase": "deep_understanding"}, {"score": 0.0025181767240440417, "phrase": "social_action"}, {"score": 0.002497750121448195, "phrase": "positive_tone"}, {"score": 0.002430847695568245, "phrase": "important_role"}, {"score": 0.0022961149746031652, "phrase": "business_executives"}, {"score": 0.0022713093139061277, "phrase": "key_players"}, {"score": 0.0022406779042098493, "phrase": "future_research_efforts"}, {"score": 0.0021806461242374667, "phrase": "particular_oss_applications"}, {"score": 0.002139581380750111, "phrase": "geographic_regions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open source software", " Diffusion", " Organizing vision", " Institutionalization"], "paper_abstract": "Context: Almost a decade ago, researchers in information systems and analysts of the information technology (IT) industry were predicting a bright future for open source software (OSS). Recent examples appear to lend support to this, but there exist many detractors of OSS and resistance to the transformation it creates. Thus, it is relevant to take a closer look at the institutionalization of OSS. Objective: This paper evaluates the extent of OSS institutionalization in organizations. A practice or innovation is said to be institutionalized when it is taken-for-granted and its use becomes the norm. Method: Drawing on institutional theory, the underlying concept of organizing vision and the rhetorical theory of diffusion of innovations, we analyze OSS institutionalization through the observation of the evolution of the public discourse about OSS and, simultaneously, the observation of the rate of adoption or diffusion of OSS in organizations. Results: OSS has become institutionalized for many back-end applications and is gradually becoming institutionalized for some front-end applications, mainly in small and medium enterprises but also in organizations in the financial, publishing, education, government and public sectors. Using the rhetorical theory of diffusion of innovations in tandem with the concept of organizing vision, we provide a deep understanding of the institutionalization of OSS by showing that it has not only diffused among organizations, but is also taken-for-granted in thought and social action. The positive tone and prominence of the public discourse on OSS have an important role to play in its institutionalization. Conclusion: The institutionalization of OSS in organizations cannot be underestimated by IT and business executives as well as key players in the IT industry. Future research efforts should be pursued and directed toward the institutionalization of particular OSS applications in a variety of industries and geographic regions. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Has open source software been institutionalized in organizations or not?", "paper_id": "WOS:000309436200002"}