{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "slovenia's_scientific_collaboration_network"}, {"score": 0.004531997388646422, "phrase": "yearly_resolution"}, {"score": 0.004358903464536199, "phrase": "publication_records"}, {"score": 0.0043213410601860985, "phrase": "slovene_scientists"}, {"score": 0.003405671497507337, "phrase": "broad_myriad"}, {"score": 0.0033762956164519286, "phrase": "research_fields"}, {"score": 0.0032896745636186824, "phrase": "\"small_worlds"}, {"score": 0.003205268682789165, "phrase": "average_path"}, {"score": 0.0030428787018636147, "phrase": "largest_component"}, {"score": 0.0029012378668247397, "phrase": "network_growth"}, {"score": 0.0028513785049061767, "phrase": "near-liner_preferential_attachment"}, {"score": 0.0027781870000242004, "phrase": "log-normal_distribution"}, {"score": 0.0026718978608934077, "phrase": "average_starting_year"}, {"score": 0.002315719347244451, "phrase": "clustering_coefficient"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scientific collaboration", " Networks", " Preferential attachment", " Small worlds", " Slovenia"], "paper_abstract": "We study the evolution of Slovenia's scientific collaboration network from 1960 till present with a yearly resolution. For each year the network was constructed from publication records of Slovene scientists, whereby two were connected if, up to the given year inclusive, they have coauthored at least one paper together. Starting with no more than 30 scientists with an average of 1.5 collaborators in the year 1960, the network to date consists of 7380 individuals that, on average, have 10.7 collaborators. We show that, in spite of the broad myriad of research fields covered, the networks form \"small worlds\" and that indeed the average path between any pair of scientists scales logarithmically with size after the largest component becomes large enough. Moreover, we show that the network growth is governed by near-liner preferential attachment, giving rise to a log-normal distribution of collaborators per author, and that the average starting year is roughly inversely proportional to the number of collaborators eventually acquired. Understandably, not all that became active early have till now gathered many collaborators. We also give results for the clustering coefficient and the diameter of the network over time, and compare our conclusions with those reported previously. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Growth and structure of Slovenia's scientific collaboration network", "paper_id": "WOS:000281616200003"}