{"auto_keywords": [{"score": 0.04912982131704961, "phrase": "bayesian_learner"}, {"score": 0.010507254962917736, "phrase": "rough_set"}, {"score": 0.00936987331517693, "phrase": "malicious_nodes"}, {"score": 0.006284763874357568, "phrase": "rough"}, {"score": 0.0046491050101721545, "phrase": "new_security_management_model"}, {"score": 0.0037480753312398754, "phrase": "malicious_node_set"}, {"score": 0.0036188435232325337, "phrase": "local_dod"}, {"score": 0.0031606409669063247, "phrase": "dod"}, {"score": 0.002976019715894587, "phrase": "computation_accuracy"}, {"score": 0.0026384167183586015, "phrase": "corresponding_probability_result"}, {"score": 0.0022810491620483737, "phrase": "existing_trust_model"}, {"score": 0.002246955931290095, "phrase": "simulation_results"}, {"score": 0.0021693692831601745, "phrase": "higher_examination_rate"}, {"score": 0.0021049977753042253, "phrase": "higher_transaction_success_rate"}], "paper_keywords": ["Degree of Dissatisfaction", " Rough set", " Bayesian learner", " Information entropy"], "paper_abstract": "A new security management model based on Rough set and Bayesian learner is proposed in the paper. The model focuses on finding out malicious nodes and getting them under control. The degree of dissatisfaction (DoD) is defined as the probability that a node belongs to the malicious node set. Based on transaction history records local DoD (LDoD) is calculated. And recommended DoD (RDoD) is calculated based on feedbacks on recommendations (FBRs). According to the DoD, nodes are classified and controlled. In order to improve computation accuracy and efficiency of the probability, we employ Rough set combined with Bayesian learner. For the reason that in some cases, the corresponding probability result can be determined according to only one or two attribute values, the Rough set module is used; And in other cases, the probability is computed by Bayesian learner. Compared with the existing trust model, the simulation results demonstrate that the model can obtain higher examination rate of malicious nodes and achieve the higher transaction success rate.", "paper_title": "A New Security Model In P2P Network Based On Rough Set And Bayesian Learner", "paper_id": "WOS:000310982100023"}