{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "older_adults"}, {"score": 0.004674952036988355, "phrase": "online_environments"}, {"score": 0.00462919213721188, "phrase": "irresponsible_and_inaccessible_web_design"}, {"score": 0.004406994912939125, "phrase": "web_content_accessibility_guidelines"}, {"score": 0.004257806363128601, "phrase": "possible_users"}, {"score": 0.003877737556673229, "phrase": "disabled_and_older_adult_categories"}, {"score": 0.003445591238183763, "phrase": "web_accessibility_initiative"}, {"score": 0.003091767402370757, "phrase": "selected_sites"}, {"score": 0.0029722900280316216, "phrase": "wai."}, {"score": 0.002416589459425828, "phrase": "time_constraints"}, {"score": 0.0023811153883132536, "phrase": "general_stress"}, {"score": 0.0023003498123420237, "phrase": "new_technologies"}, {"score": 0.002146926767291475, "phrase": "long-term_risk"}, {"score": 0.0021049977753042253, "phrase": "public_image"}], "paper_keywords": ["people with disabilities", " web accessibility", " world wide web", " Online accessibility", " initiative"], "paper_abstract": "Irresponsible and inaccessible web design causes unnecessary problems to certain website users. By applying the web content accessibility guidelines to a website the amount of possible users who can successfully view the content of that site will increase especially for those who are in the disabled and older adult categories of online users. We present the results of assessing the compliance of a selection of websites with guidelines set out by the Web Accessibility Initiative (WAI). It was found that most sites evaluated were inaccessible to those with disabilities. Only one of the selected sites passed all three priority levels set out by the WAI. In many cases, minor modi. cations to sites will make them accessible to people with disabilities. Therefore it can only be speculated that the reasons for lack of conformance may vary from lack of awareness of the issue, time constraints or the general stress of having to keep up with new technologies. Companies who overlook users with disabilities however may be doing so at long-term risk to their legal position, public image and ultimately business success.", "paper_title": "Investigating the problems faced by older adults and people with disabilities in online environments", "paper_id": "WOS:000250361500002"}