{"auto_keywords": [{"score": 0.04888818798303966, "phrase": "network_coding"}, {"score": 0.03166181073351053, "phrase": "traditional_routing"}, {"score": 0.007663121140016606, "phrase": "adversarial_wireless_networks"}, {"score": 0.007071179745997375, "phrase": "pollution_attacks"}, {"score": 0.004601508848655033, "phrase": "wireless_mesh_networks"}, {"score": 0.004331501320993783, "phrase": "network_throughput"}, {"score": 0.0040978781692373005, "phrase": "performance_gain"}, {"score": 0.003955787027818305, "phrase": "adversarial_wireless_mesh_networks"}, {"score": 0.0038573081851680656, "phrase": "critical_issue"}, {"score": 0.003469676666252421, "phrase": "unicast_and_multicast_scenarios"}, {"score": 0.0033492947290751996, "phrase": "numerical_and_simulation_studies"}, {"score": 0.003058515297281172, "phrase": "theoretical_findings"}, {"score": 0.002563219920877287, "phrase": "numerical_solutions"}, {"score": 0.0021697677572213086, "phrase": "hostile_wireless_networks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Network coding", " Pollution attack", " Wireless network", " Performance evaluation"], "paper_abstract": "When network coding is used in wireless mesh networks (WMNs), the epidemic effect of pollution attacks can reduce network throughput dramatically. Nevertheless, little attention has been directed toward the performance gain of network coding versus traditional routing in adversarial wireless mesh networks. To address this critical issue, in this paper, we formally model and analyze the impact of pollution attacks on traditional routing and network coding in both unicast and multicast scenarios. With the combination of both numerical and simulation studies, we evaluate the performance of traditional routing and network coding in adversarial wireless networks. Our data is consistent with the theoretical findings. Our results show that network coding is not absolutely better than traditional routing and its performance gain largely depends on various factors. Most importantly, given a network, the threshold of these factors can be derived from numerical solutions given by our developed closed-form formulae. Thus, we can determine whether network coding should be used in the network. Our results contribute to the foundation, providing guidelines for designing and applying network coding into hostile wireless networks. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Network coding versus traditional routing in adversarial wireless networks", "paper_id": "WOS:000337869200009"}