{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed"}, {"score": 0.004741395005218184, "phrase": "clone_attacks"}, {"score": 0.004692980391580608, "phrase": "mobile_wsns"}, {"score": 0.004621279527317074, "phrase": "security_challenges"}, {"score": 0.004550669123303854, "phrase": "mobile_wireless_sensor_networks"}, {"score": 0.004504193207111593, "phrase": "clone_attack"}, {"score": 0.004002513373645485, "phrase": "previously_compromised_sensors"}, {"score": 0.0035201528214608914, "phrase": "different_compromising_capability"}, {"score": 0.00332670230152448, "phrase": "cooperative_protocols"}, {"score": 0.002546315584783112, "phrase": "introduced_types"}, {"score": 0.0022161333611134806, "phrase": "high_detection_rate"}, {"score": 0.0021709933368474223, "phrase": "limited_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Wireless sensor networks", " Clone attack", " Clone detection"], "paper_abstract": "Among security challenges raised by mobile Wireless Sensor Networks, clone attack is particularly dreadful since it makes an adversary able to subvert the behavior of a network just leveraging a few replicas or some previously compromised sensors. In this work, we provide several contributions: first, we introduce two novel realistic adversary models, the vanishing and the persistent adversary, characterized by different compromising capability. We then propose two distributed, efficient, and cooperative protocols to detect replicas: History Information-exchange Protocol (HIP) and its optimized version (HOP). Both HIP and HOP leverage just local (one-hop) communications and node mobility, and differ for the amount of computation required. We study their behavior against the introduced types of attacker, considering two different mobility models and comparing our solutions against the state of the art. Both analysis and simulation results show that our solutions are effective and efficient, providing high detection rate, while incurring limited overhead. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Clone wars: Distributed detection of clone attacks in mobile WSNs", "paper_id": "WOS:000331158700012"}