{"auto_keywords": [{"score": 0.04516205981123226, "phrase": "software_systems"}, {"score": 0.027694231020328152, "phrase": "automatic_workarounds"}, {"score": 0.015719716506582538, "phrase": "intrinsic_redundancy"}, {"score": 0.015641826257163788, "phrase": "web_applications"}, {"score": 0.004742948310694449, "phrase": "best_intentions"}, {"score": 0.004660299110035537, "phrase": "rigorous_methods"}, {"score": 0.004454296307241825, "phrase": "imperfect_software"}, {"score": 0.004289570608922719, "phrase": "ambitious_goal"}, {"score": 0.004141304435633806, "phrase": "functional_failures"}, {"score": 0.004028399124120671, "phrase": "correct_functionality"}, {"score": 0.003988107217470147, "phrase": "acceptable_degradation"}, {"score": 0.0037546476864907443, "phrase": "faulty_behavior"}, {"score": 0.003726439383466603, "phrase": "correct_behavior"}, {"score": 0.0036066231834717545, "phrase": "software_system"}, {"score": 0.0034906459357402792, "phrase": "redundant_systems"}, {"score": 0.003421130350453309, "phrase": "deliberate_redundancy"}, {"score": 0.0033954191908391147, "phrase": "essential_ingredient"}, {"score": 0.003212663446866794, "phrase": "cost_constraints"}, {"score": 0.0031328666294772323, "phrase": "different_approach"}, {"score": 0.003093712264083982, "phrase": "modern_software_systems"}, {"score": 0.002941913249957503, "phrase": "modern_modular_software_design"}, {"score": 0.0025232937404892366, "phrase": "alternative_operations"}, {"score": 0.002454391898559845, "phrase": "different_code"}, {"score": 0.0022530666572386305, "phrase": "browser_extension"}], "paper_keywords": ["Reliability", " Design", " Automatic workarounds", " Web applications", " Web API"], "paper_abstract": "Despite the best intentions, the competence, and the rigorous methods of designers and developers, software is often delivered and deployed with faults. To cope with imperfect software, researchers have proposed the concept of self-healing for software systems. The ambitious goal is to create software systems capable of detecting and responding \"autonomically\" to functional failures, or perhaps even preempting such failures, to maintain a correct functionality, possibly with acceptable degradation. We believe that self-healing can only be an expression of some form of redundancy, meaning that, to automatically fix a faulty behavior, the correct behavior must be already present somewhere, in some form, within the software system either explicitly or implicitly. One approach is to deliberately design and develop redundant systems, and in fact this kind of deliberate redundancy is the essential ingredient of many fault tolerance techniques. However, this type of redundancy is also generally expensive and does not always satisfy the time and cost constraints of many software projects. With this article we take a different approach. We observe that modern software systems naturally acquire another type of redundancy that is not introduced deliberately but rather arises intrinsically as a by-product of modern modular software design. We formulate this notion of intrinsic redundancy and we propose a technique to exploit it to achieve some level of self-healing. We first demonstrate that software systems are indeed intrinsically redundant. Then we develop a way to express and exploit this redundancy to tolerate faults with automatic workarounds. In essence, a workaround amounts to replacing some failing operations with alternative operations that are semantically equivalent in their intended effect, but that execute different code and ultimately avoid the failure. The technique we propose finds such workarounds automatically. We develop this technique in the context of Web applications. In particular, we implement this technique within a browser extension, which we then use in an evaluation with several known faults and failures of three popular Web libraries. The evaluation demonstrates that automatic workarounds are effective: out of the nearly 150 real faults we analyzed, 100 could be overcome with automatic workarounds, and half of these workarounds found automatically were not publicly known before.", "paper_title": "Automatic Workarounds: Exploiting the Intrinsic Redundancy of Web Applications", "paper_id": "WOS:000354826200004"}