{"auto_keywords": [{"score": 0.04932930879059259, "phrase": "geometric_spanning_tree"}, {"score": 0.013374955532381471, "phrase": "red_points"}, {"score": 0.013030538387937001, "phrase": "blue_points"}, {"score": 0.011495445326671806, "phrase": "crossing_points"}, {"score": 0.005785946494030893, "phrase": "minimum_number"}, {"score": 0.00481495049065317, "phrase": "tree_problem"}, {"score": 0.004288472456976113, "phrase": "non-crossing_straight_line_segments"}, {"score": 0.00415354727422715, "phrase": "geometric_spanning_path"}, {"score": 0.0028886123801902517, "phrase": "convex_hull"}, {"score": 0.002740253546178098, "phrase": "optimal_algorithm"}, {"score": 0.0024789887640568093, "phrase": "collinear_points"}, {"score": 0.002161488929856023, "phrase": "np"}], "paper_keywords": ["Computational geometry", " Spanning tree", " Crossing number"], "paper_abstract": "A geometric spanning tree of a point set S is a tree whose vertex set is S and whose edge set is a set of non-crossing straight line segments with endpoints in S. Given a set of red points and a set of blue points in the plane, the red/blue spanning tree problem is to find a geometric spanning tree for red points and a geometric spanning tree for blue points such that the number of crossing points of the two trees is a minimum. If no three points are collinear, we show that the minimum number of crossing points is completely determined by the number of maximal red (or blue) chains on the convex hull of all red points and blue points. We design an optimal algorithm for constructing a geometric spanning tree of all the red points and a geometric spanning tree of all the blue points with the minimum number of crossing points. If collinear points are allowed, we prove that the problem of deciding whether there exists a geometric spanning path of all the red points and a geometric spanning path of all the blue points without crossing is NP-complete. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "On the red/blue spanning tree problem", "paper_id": "WOS:000290598900002"}