{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "galled_networks"}, {"score": 0.03324601839519243, "phrase": "galled_trees"}, {"score": 0.004781777766309739, "phrase": "real_data"}, {"score": 0.004651346011959237, "phrase": "phylogenetic_networks"}, {"score": 0.004619295212985837, "phrase": "biological_data"}, {"score": 0.004571630734130793, "phrase": "important_problem"}, {"score": 0.004524455848517757, "phrase": "molecular_evolution"}, {"score": 0.004340553321613485, "phrase": "promising_approaches"}, {"score": 0.004092695445765521, "phrase": "rooted_phylogenetic_networks"}, {"score": 0.004064478393319772, "phrase": "real_datasets"}, {"score": 0.003858936100805083, "phrase": "monophyletic_taxa"}, {"score": 0.0037148167062767096, "phrase": "rooted_phylogenetic_tree"}, {"score": 0.0036259093827331725, "phrase": "optimal_rooted_phylogenetic_network"}, {"score": 0.0034424690391411093, "phrase": "even_the_problem"}, {"score": 0.0032121901685844803, "phrase": "topologically_restricted_classes"}, {"score": 0.003124437382827821, "phrase": "level-k_networks"}, {"score": 0.0030180996912267683, "phrase": "practical_draw-back"}, {"score": 0.002538164420139397, "phrase": "galled_network"}, {"score": 0.0023600418563602303, "phrase": "optimal_galled_network"}, {"score": 0.0022250240576349267, "phrase": "large_datasets"}], "paper_keywords": [""], "paper_abstract": "Motivation: Developing methods for computing phylogenetic networks from biological data is an important problem posed by molecular evolution and much work is currently being undertaken in this area. Although promising approaches exist, there are no tools available that biologists could easily and routinely use to compute rooted phylogenetic networks on real datasets containing tens or hundreds of taxa. Biologists are interested in clades, i.e. groups of monophyletic taxa, and these are usually represented by clusters in a rooted phylogenetic tree. The problem of computing an optimal rooted phylogenetic network from a set of clusters, is hard, in general. Indeed, even the problem of just determining whether a given network contains a given cluster is hard. Hence, some researchers have focused on topologically restricted classes of networks, such as galled trees and level-k networks, that are more tractable, but have the practical draw-back that a given set of clusters will usually not possess such a representation. Results: In this article, we argue that galled networks (a generalization of galled trees) provide a good trade-off between level of generality and tractability. Any set of clusters can be represented by some galled network and the question whether a cluster is contained in such a network is easy to solve. Although the computation of an optimal galled network involves successively solving instances of two different NP-complete problems, in practice our algorithm solves this problem exactly on large datasets containing hundreds of taxa and many reticulations in seconds, as illustrated by a dataset containing 279 prokaryotes.", "paper_title": "Computing galled networks from real data", "paper_id": "WOS:000266498300012"}