{"auto_keywords": [{"score": 0.045526138066185134, "phrase": "multiple_alignment"}, {"score": 0.012246955021230186, "phrase": "low_sequence_similarity"}, {"score": 0.00481495049065317, "phrase": "rna_sequences"}, {"score": 0.004675930527604869, "phrase": "apparent_paradox"}, {"score": 0.004621447740470602, "phrase": "computational_rna_structure_prediction"}, {"score": 0.004232475065285966, "phrase": "related_sequences"}, {"score": 0.00408617426304956, "phrase": "common_structure"}, {"score": 0.0033473779327638322, "phrase": "rna_sequence_candidates"}, {"score": 0.00304737045343781, "phrase": "pmcomp_program"}, {"score": 0.0029592333031063156, "phrase": "global_multiple_alignment_program"}, {"score": 0.002924694271730544, "phrase": "foldalignm"}, {"score": 0.002600661525224505, "phrase": "art_programs"}, {"score": 0.002206290313627494, "phrase": "local_datasets"}, {"score": 0.0021049977753042253, "phrase": "post_processing_foldalign_pairwise_scans"}], "paper_keywords": [""], "paper_abstract": "Motivation: An apparent paradox in computational RNA structure prediction is that many methods, in advance, require a multiple alignment of a set of related sequences, when searching for a common structure between them. However, such a multiple alignment is hard to obtain even for few sequences with low sequence similarity without simultaneously folding and aligning them. Furthermore, it is of interest to conduct a multiple alignment of RNA sequence candidates found from searching as few as two genomic sequences. Results: Here, based on the PMcomp program, we present a global multiple alignment program, foldalignM, which performs especially well on few sequences with low sequence similarity, and is comparable in performance with state of the art programs in general. In addition, it can cluster sequences based on sequence and structure similarity and output a multiple alignment for each cluster. Furthermore, preliminary results with local datasets indicate that the program is useful for post processing foldalign pairwise scans.", "paper_title": "Multiple structural alignment and clustering of RNA sequences", "paper_id": "WOS:000246293000002"}