{"auto_keywords": [{"score": 0.04656823846823867, "phrase": "physical_world"}, {"score": 0.008347970832370644, "phrase": "virtual_object"}, {"score": 0.006832913007913859, "phrase": "reaching_movements"}, {"score": 0.006749836280658666, "phrase": "real_force_fields"}, {"score": 0.00481495049065317, "phrase": "virtual_environments"}, {"score": 0.00476796595797636, "phrase": "human_motor_learning"}, {"score": 0.004607084771741802, "phrase": "dynamically_variable_virtual_environment"}, {"score": 0.0041561525381071185, "phrase": "robotic_manipulandum"}, {"score": 0.0040158319222538584, "phrase": "human_cognitive_system"}, {"score": 0.003937008198032781, "phrase": "force_field"}, {"score": 0.003842331669986729, "phrase": "learning_mechanism"}, {"score": 0.0037584024036355877, "phrase": "virtual_world"}, {"score": 0.0036943889039677156, "phrase": "virtual_force_fields"}, {"score": 0.0036672881650363785, "phrase": "limited_number"}, {"score": 0.003517416779934877, "phrase": "quite_a_number"}, {"score": 0.003474509885120876, "phrase": "learning_mechanisms"}, {"score": 0.0032041151405238655, "phrase": "desired_target"}, {"score": 0.0031805993962913163, "phrase": "computer_screen"}, {"score": 0.003073113904142169, "phrase": "viscous_virtual_force_field"}, {"score": 0.0028901040599624995, "phrase": "null-field_condition"}, {"score": 0.002854827460528088, "phrase": "viscous_force_field"}, {"score": 0.002751553148082806, "phrase": "last_group"}, {"score": 0.0027179630907534884, "phrase": "first_and_third_groups"}, {"score": 0.002639006061583283, "phrase": "second_step"}, {"score": 0.0026196268842229036, "phrase": "second_group"}, {"score": 0.0025372773909061717, "phrase": "nondominant_arm"}, {"score": 0.002524839485174388, "phrase": "vice_versa"}, {"score": 0.002494010152215751, "phrase": "third_phase"}, {"score": 0.002380244799271034, "phrase": "reaching_task"}, {"score": 0.0023569619814283044, "phrase": "so-called_aftereffects_phenomenon"}, {"score": 0.002146801124249881, "phrase": "sudden_application"}, {"score": 0.0021310286631673263, "phrase": "virtual_force_field"}, {"score": 0.0021049977753042253, "phrase": "generalization_behavior"}], "paper_keywords": [""], "paper_abstract": "This paper studies learning of reaching movements in a dynamically variable virtual environment specially designed for this purpose. Learning of reaching movements in the physical world has been extensively studied by several researchers. In most of those studies, the subjects are asked to exercise reaching movements while being exposed to real force fields exerted through a robotic manipulandum. Those studies have contributed to our understanding of the mechanisms used by the human cognitive system to learn reaching movements in the physical world. The question that remains to be answered is how the learning mechanism in the physical world relates to its counterpart in the virtual world where the real force fields are replaced by virtual force fields. A limited number of studies have already addressed this question and have shown that there are, actually, quite a number of relationships between the learning mechanisms in these two different environments. In this study, we are focused on gaining a more in-depth understanding of these relationships. In our experiments, the subjects are asked to guide a virtual object to a desired target on a computer screen using a mouse. The movement of the virtual object is affected by a viscous virtual force field that is sensed by the examinees through their visual system. Three groups of examinees are used for the experiments. All the examinees are first trained in the null-field condition. Then, the viscous force field is introduced either suddenly (for the two first groups) or gradually (for the last group). While the first and third groups of the examinees used their dominant arm to guide the virtual object in the second step, the second group used their nondominant arm. Generalization of the learning from the dominant to the nondominant arm and vice versa was studied in the third phase of the experiments. Finally, the force field was removed and the examinees were asked to repeat the reaching task to study the so-called aftereffects phenomenon. The results of the experiments are compared with the studies performed in the physical world. It is shown that the trends of learning and generalization are similar to what is observed in the physical world for a sudden application of the virtual force field. However, the generalization behavior of the examinees is somewhat different from the physical world if the force field is gradually applied.", "paper_title": "Application of Virtual Environments to Assessment of Human Motor Learning During Reaching Movements", "paper_id": "WOS:000265795000002"}