{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "animated_pedagogical_agents"}, {"score": 0.0046797114400479135, "phrase": "well-established_effect"}, {"score": 0.0045971138571344345, "phrase": "educational_and_other_contexts"}, {"score": 0.004436247158342735, "phrase": "increased_motivation"}, {"score": 0.004101797841848363, "phrase": "animated_pedagogical_agent"}, {"score": 0.004058180509184539, "phrase": "intelligent_tutoring_system"}, {"score": 0.0036596534390380287, "phrase": "visual_form"}, {"score": 0.0030402088074201793, "phrase": "key_aspects"}, {"score": 0.002975826686621829, "phrase": "systematic_approach"}, {"score": 0.002954669496511141, "phrase": "future_research"}, {"score": 0.002923214590192792, "phrase": "main_thesis"}, {"score": 0.002861302930564756, "phrase": "users'_visuo-aesthetic_experience"}, {"score": 0.002635850034826311, "phrase": "secondary_issue"}, {"score": 0.0023936956017015696, "phrase": "competence_level"}, {"score": 0.0022851491693940272, "phrase": "animated_agents"}, {"score": 0.0022287497627555895, "phrase": "visual_rendering_issues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["animated pedagogical agents", " motivational issues", " visual experience", " visual form", " design space"], "paper_abstract": "A well-established effect of animated agents in educational and other contexts is their potential to motivate and engage. \"Increased motivation in users\" is also one of the more frequent answers given to the question, \"What is gained by adding an animated pedagogical agent to an intelligent tutoring system?\" To further develop and exploit this potential, there are, however, several issues that need to be resolved. In this article we discuss the visual form and look of animated pedagogical agents. A survey is presented of how the area is approached (and, in particular, not approached) in research on animated pedagogical agents. Two possible reasons are proposed as to why visual form and look are so little addressed are also proposed. We also propose and discuss some key aspects of look that merit a systematic approach in future research. The main thesis of the paper is that users' visuo-aesthetic experience of animated pedagogical agents is too important with respect to the goals to motivate and engage, to be treated as a secondary issue. We do not deny that there are other pressing and fundamental issues that need to be solved, such as those concerning the content of the support and the competence level of agents, as well as various design elements that can contribute to making animated agents lifelike. But we argue that visual rendering issues are pressing and need to be seriously addressed as well. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Design of animated pedagogical agents - A look at their look", "paper_id": "WOS:000236077900003"}