{"auto_keywords": [{"score": 0.04527707426586777, "phrase": "organisational_cybernetics"}, {"score": 0.01017032120958767, "phrase": "strategy_literature"}, {"score": 0.006906825428814983, "phrase": "vsm"}, {"score": 0.006705591378737747, "phrase": "organisational_implications"}, {"score": 0.0064463568307839515, "phrase": "considered_strategies"}, {"score": 0.00481495049065317, "phrase": "cybernetic_lens"}, {"score": 0.004751972849082626, "phrase": "business_strategy"}, {"score": 0.004508155639663496, "phrase": "key_approaches"}, {"score": 0.0044491728131708505, "phrase": "current_interest"}, {"score": 0.004084074821242058, "phrase": "established_approaches"}, {"score": 0.003977858136481356, "phrase": "dominant_themes"}, {"score": 0.003912874578852994, "phrase": "business_strategy_domain"}, {"score": 0.0037985575652591985, "phrase": "strategy-as-practice_approach"}, {"score": 0.0037611961382938964, "phrase": "strategy-structure_debate"}, {"score": 0.0033075503163659055, "phrase": "strategy_domain_conceptualisations"}, {"score": 0.0028608962312791264, "phrase": "different_themes"}, {"score": 0.0027318042427022953, "phrase": "collaborative_ventures"}, {"score": 0.002660662813907647, "phrase": "rich_domain"}, {"score": 0.0025322155884631384, "phrase": "strategy_domain"}, {"score": 0.0024825860713137194, "phrase": "vsm."}, {"score": 0.0024099543488850946, "phrase": "new_stream"}], "paper_keywords": ["Cybernetics", " Corporate strategy", " Organizational processes", " Working practices"], "paper_abstract": "Purpose - The purpose of this paper is to review the strategy literature in such a manner as to identify the key approaches and themes of current interest and thus provide a platform to position organisational cybernetics, in particular, the viable system model (VSM), as a complement to these established approaches. Design/methodology/approach - The paper reviews the dominant themes of three conceptual strands to the business strategy domain (the resource-based view, the strategy-as-practice approach and the strategy-structure debate) to ascertain how they inform about the notion of strategy as the content of the process of strategising. Concepts from organisational cybernetics are examined to reveal how they can enrich our understanding of strategy, and complement the strategy domain conceptualisations. Findings - This analysis presents the view of strategy as discourse for action. The VSM provides a device to support discussions about the organisational implications both of the process of strategising, as well as of considered strategies. Research limitations/implications - The different themes found within the strategy literature (e.g. the process of strategising, internationalisation, collaborative ventures and mergers and acquisitions) offer a rich domain within which organisational cybernetics and the VSM can enrich through its systemic epistemology. Likewise, the strategy domain can inform interpretations of the VSM. Together, this offers the opportunity for a new stream of enquiry. Practical implications - The insights provided suggest that assistance can be given to organisations for them to improve, not only their strategy-related activity, but also how they evaluate the organisational implications of considered strategies. Originality/value - The paper bridges the two conceptual domains of strategy and organisational cybernetics to promote the view that they usefully enrich each other when attempting to understand strategy.", "paper_title": "Can a cybernetic lens contribute to the business strategy domain?", "paper_id": "WOS:000293669700011"}