{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computational_prediction"}, {"score": 0.004787966206092959, "phrase": "human_proteins"}, {"score": 0.00462919213721188, "phrase": "novel_computational_method"}, {"score": 0.004551781491498328, "phrase": "highly_and_abnormally_expressed_genes"}, {"score": 0.004327196832280818, "phrase": "possible_marker_proteins"}, {"score": 0.0043029342321223825, "phrase": "follow-up_serum_proteomic_studies"}, {"score": 0.004125230994378402, "phrase": "downstream_localization"}, {"score": 0.003943730374281591, "phrase": "useful_hints"}, {"score": 0.0037701851296383405, "phrase": "data_mining_approach"}, {"score": 0.003749033935324126, "phrase": "first_collecting"}, {"score": 0.003717528595128948, "phrase": "extensive_literature_searches"}, {"score": 0.0035240305920962766, "phrase": "previous_proteomic_studies"}, {"score": 0.0034166271604770576, "phrase": "secreted_proteins"}, {"score": 0.0032938942910948066, "phrase": "structural_features"}, {"score": 0.0031223774204093713, "phrase": "signal_peptides"}, {"score": 0.003104849179057156, "phrase": "transmembrane_domains"}, {"score": 0.003087419032091453, "phrase": "glycosylation_sites"}, {"score": 0.003070086433952691, "phrase": "disordered_regions"}, {"score": 0.00305285084207725, "phrase": "secondary_structural_content"}, {"score": 0.00287759989638073, "phrase": "support_vector_machine-based_classifier"}, {"score": 0.0027898428590137515, "phrase": "large_test_set"}, {"score": 0.0025208755851561368, "phrase": "abnormally_high_abundance"}, {"score": 0.002506715532901322, "phrase": "human_blood"}, {"score": 0.002443970765041351, "phrase": "blood-secreted_proteins"}, {"score": 0.002403013783293044, "phrase": "abnormally_highly_expressed_genes"}, {"score": 0.0023694065215394593, "phrase": "lung_cancer_tissues"}, {"score": 0.002349467661235186, "phrase": "microarray_gene_expression_studies"}, {"score": 0.0022270182923887012, "phrase": "potential_biomarkers"}, {"score": 0.002146926767291475, "phrase": "highly_useful_information"}, {"score": 0.0021288561076024844, "phrase": "genomic_and_proteomic_studies"}, {"score": 0.0021168934012668755, "phrase": "disease_biomarker_discovery"}], "paper_keywords": [""], "paper_abstract": "We present a novel computational method for predicting which proteins from highly and abnormally expressed genes in diseased human tissues, such as cancers, can be secreted into the bloodstream, suggesting possible marker proteins for follow-up serum proteomic studies. A main challenging issue in tackling this problem is that our understanding about the downstream localization after proteins are secreted outside the cells is very limited and not sufficient to provide useful hints about secretion to the bloodstream. To bypass this difficulty, we have taken a data mining approach by first collecting, through extensive literature searches, human proteins that are known to be secreted into the bloodstream due to various pathological conditions as detected by previous proteomic studies, and then asking the question: what do these secreted proteins have in common in terms of their physical and chemical properties, amino acid sequence and structural features that can be used to predict them? We have identified a list of features, such as signal peptides, transmembrane domains, glycosylation sites, disordered regions, secondary structural content, hydrophobicity and polarity measures that show relevance to protein secretion. Using these features, we have trained a support vector machine-based classifier to predict protein secretion to the bloodstream. On a large test set containing 98 secretory proteins and 6601 non-secretory proteins of human, our classifier achieved 90 prediction sensitivity and 98 prediction specificity. Several additional datasets are used to further assess the performance of our classifier. On a set of 122 proteins that were found to be of abnormally high abundance in human blood due to various cancers, our program predicted 62 as blood-secreted proteins. By applying our program to abnormally highly expressed genes in gastric cancer and lung cancer tissues detected through microarray gene expression studies, we predicted 13 and 31 as blood secreted, respectively, suggesting that they could serve as potential biomarkers for these two cancers, respectively. Our study demonstrated that our method can provide highly useful information to link genomic and proteomic studies for disease biomarker discovery. Our software can be accessed at http://csbl1.bmb.uga.edu/cgi-bin/Secretion/secretion.cgi.", "paper_title": "Computational prediction of human proteins that can be secreted into the bloodstream", "paper_id": "WOS:000259973500015"}