{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "physicochemical_properties"}, {"score": 0.04900275767994014, "phrase": "disease_gene_identification"}, {"score": 0.004778594263962987, "phrase": "amino_acids"}, {"score": 0.0041374874583908535, "phrase": "main_differences"}, {"score": 0.003879138659123195, "phrase": "machine_learning"}, {"score": 0.0037774893672602506, "phrase": "disease_gene_identification_task"}, {"score": 0.0036924762294207633, "phrase": "ml_methods"}, {"score": 0.003650687199498576, "phrase": "binary_classification_problem"}, {"score": 0.0033455764382772754, "phrase": "negative_data"}, {"score": 0.0032332256013507072, "phrase": "major_problem"}, {"score": 0.0028525124381208705, "phrase": "feature_vector"}, {"score": 0.0026640466056415298, "phrase": "amino_acid"}, {"score": 0.0025843206540392184, "phrase": "definite_approach"}, {"score": 0.002555040841339798, "phrase": "non-disease_genes"}, {"score": 0.0024504843466435487, "phrase": "solely_disease_genes"}, {"score": 0.002350196395175188, "phrase": "support_vector_data_description_algorithm"}, {"score": 0.0023235629819760018, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Disease gene identification", " Physicochemical properties of amino acid", " One class classification", " Support Vector Data Description"], "paper_abstract": "Identifying the genes that cause disease is one of the most challenging issues to establish the diagnosis and treatment quickly. Several interesting methods have been introduced for disease gene identification for a decade. In general, the main differences between these methods are the type of data used as a prior-knowledge, as well as machine learning (ML) methods used for identification. The disease gene identification task has been commonly viewed by ML methods as a binary classification problem (whether any gene is disease or not). However, the nature of the data (since there is no negative data available for training or leaners) creates a major problem which affect the results. In this paper, sequence-based, one class classification method is introduced to assign genes to disease class (yes, no). First, to generate feature vector, the sequences of proteins (genes) are initially transformed to numerical vector using physicochemical properties of amino acid. Second, as there is no definite approach to define non-disease genes (negative data); we have attempted to model solely disease genes (positive data) to make a prediction by employing Support Vector Data Description algorithm. The experimental results confirm the efficiency of the method with precision, recall and F-measure of 79.3%, 82.6% and 80.9%, respectively. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A novel method based on physicochemical properties of amino acids and one class classification algorithm for disease gene identification", "paper_id": "WOS:000359752100027"}