{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "mathematical_models"}, {"score": 0.01593033623597039, "phrase": "quantifiable_systems"}, {"score": 0.010612387000973441, "phrase": "model_systems"}, {"score": 0.005271971378756123, "phrase": "environmental_systems"}, {"score": 0.00478579024367007, "phrase": "purpose_-_the_purpose"}, {"score": 0.004656729019170898, "phrase": "theoretical_study"}, {"score": 0.004289966839994858, "phrase": "experimental_data"}, {"score": 0.003988180913997414, "phrase": "theoretical_framework"}, {"score": 0.0035965032173588753, "phrase": "computational_program"}, {"score": 0.0029783256772952073, "phrase": "experimental_data_lead"}, {"score": 0.002933354468864442, "phrase": "sensitive_and_stable_models"}, {"score": 0.002735052488172277, "phrase": "stability_function"}, {"score": 0.0026209522797963447, "phrase": "stable_models"}, {"score": 0.0025892330566358503, "phrase": "defined_theoretical_structure"}, {"score": 0.0024586427394152196, "phrase": "systems_theory_perspective"}, {"score": 0.002399482671479507, "phrase": "mathematical_model_stability"}, {"score": 0.0021049977753042253, "phrase": "numeric_studies"}], "paper_keywords": ["cybernetics", " systems theory", " mathematical modelling", " stability (control theory)"], "paper_abstract": "Purpose - The purpose of this paper is to carry out a theoretical study of the stability of the mathematical models defined in a class of systems. Furthermore, it will be supposed that the models have been obtained from experimental data and by means of the application of a methodology. The studies carried out in this paper are, on one hand, the theoretical framework for an analysis of the sensitivity and stability of a type of systems; on the other hand, they supplement the studies carried out by the authors, in which, using a computational program, the sensitivity of the mathematical models is analyzed with respect to a type of perturbation. Design/methodology/approach - Initially, a class of systems is considered that are denominated quantifiable systems, in which model systems are defined that are determined by a set and a family of relationships. An initial study of the sensitivity of the mathematical models to perturbations in the experimental data lead to a concept of sensitive and stable models that forms the basis of the theory of stability developed in this paper. Furthermore, this permits a definition of the stability function for the set of the perturbations and, consequently, a determination of stable models according to the defined theoretical structure. Findings - An analysis of the sensitivity and stability of mathematical models in quantifiable systems from a systems theory perspective will be fundamental for the determination of mathematical model stability in environmental systems. Originality/value - The studies carried out in this paper supposes an advance in the study and modeling of a type of systems that the authors have denominated as quantifiable systems, applicable to the study of environmental systems and supplementing the numeric studies carried out by the authors.", "paper_title": "A stability theory for model systems", "paper_id": "WOS:000247988900011"}