{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large-and_small-scale_features"}, {"score": 0.02080904048190419, "phrase": "large-scale_features"}, {"score": 0.010477057671767227, "phrase": "face_image"}, {"score": 0.003933000051147382, "phrase": "relevant_existing_methods"}, {"score": 0.0038492126993451337, "phrase": "illumination-invariant_features"}, {"score": 0.0037348894128879082, "phrase": "large-scale_intrinsic_features"}, {"score": 0.0034118234596993836, "phrase": "face_restoration"}, {"score": 0.0032820385246266773, "phrase": "illumination_normalization"}, {"score": 0.00307657476125683, "phrase": "original_face_image"}, {"score": 0.003037047249598515, "phrase": "novel_method"}, {"score": 0.0028346293790895024, "phrase": "single_face_image"}, {"score": 0.0025449518236394103, "phrase": "small-scale_features"}, {"score": 0.0024906610581090223, "phrase": "normalized_face_image"}, {"score": 0.002427035025924384, "phrase": "processed_large-and_small-scale_features"}, {"score": 0.0023650305205893353, "phrase": "optional_visual_compensation_step"}, {"score": 0.002304606411453748, "phrase": "visual_quality"}, {"score": 0.0022749744354271816, "phrase": "normalized_image"}, {"score": 0.002114099359229608, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "significantly_better_recognition_performance"}], "paper_keywords": ["Face recognition", " illumination normalization", " visual compensation"], "paper_abstract": "A face image can be represented by a combination of large-and small-scale features. It is well-known that the variations of illumination mainly affect the large-scale features (low-frequency components), and not so much the small-scale features. Therefore, in relevant existing methods only the small-scale features are extracted as illumination-invariant features for face recognition, while the large-scale intrinsic features are always ignored. In this paper, we argue that both large-and small-scale features of a face image are important for face restoration and recognition. Moreover, we suggest that illumination normalization should be performed mainly on the large-scale features of a face image rather than on the original face image. A novel method of normalizing both the Small-and Large-scale (S&L) features of a face image is proposed. In this method, a single face image is first decomposed into large-and small-scale features. After that, illumination normalization is mainly performed on the large-scale features, and only a minor correction is made on the small-scale features. Finally, a normalized face image is generated by combining the processed large-and small-scale features. In addition, an optional visual compensation step is suggested for improving the visual quality of the normalized image. Experiments on CMU-PIE, Extended Yale B, and FRGC 2.0 face databases show that by using the proposed method significantly better recognition performance and visual results can be obtained as compared to related state-of-the-art methods.", "paper_title": "Normalization of Face Illumination Based on Large-and Small-Scale Features", "paper_id": "WOS:000291823600004"}