{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reciprocal_translocations"}, {"score": 0.008226789726071193, "phrase": "sbt"}, {"score": 0.007822873614146249, "phrase": "shortest_sequence"}, {"score": 0.006371831505197421, "phrase": "different_genes"}, {"score": 0.0062131712811590535, "phrase": "gene_set"}, {"score": 0.005398466479358453, "phrase": "sorting_sequence"}, {"score": 0.005302099136225507, "phrase": "opt"}, {"score": 0.004780381581290328, "phrase": "insertions"}, {"score": 0.0044314880575692175, "phrase": "comparative_genomics"}, {"score": 0.004197942881217177, "phrase": "genome_gamma"}, {"score": 0.0036729522133392175, "phrase": "bergeron's_sbt_algorithm"}, {"score": 0.003178758306417406, "phrase": "approximation_algorithm"}, {"score": 0.0028418430688995247, "phrase": "minimum_number"}, {"score": 0.0022711207841260767, "phrase": "conceptual_level"}, {"score": 0.00216680270402079, "phrase": "el_mabrouk"}, {"score": 0.0021049977753042253, "phrase": "different_gene_contents"}], "paper_keywords": ["Translocation", " insertion", " deletion", " algorithm"], "paper_abstract": "The problem of sorting by reciprocal translocations (abbreviated as SBT) arises from the field of comparative genomics, which is to find a shortest sequence of reciprocal translocations that transforms one genome Pi into another genome Gamma, with the restriction that Pi and Gamma contain the same genes. SBT has been proved to be polynomial-time solvable, and several polynomial algorithms have been developed. In this paper, we show how to extend Bergeron's SBT algorithm to include insertions and deletions, allowing to compare genomes containing different genes. In particular, if the gene set of Pi is a subset (or superset, respectively) of the gene set of Gamma, we present an approximation algorithm for transforming Pi into Gamma by reciprocal translocations and deletions (insertions, respectively), providing a sorting sequence with length at most OPT + 2, where OPT is the minimum number of translocations and deletions (insertions, respectively) needed to transform Pi into Gamma; if Pi and Gamma have different genes but not containing each other, we give a heuristic to transform Pi into Gamma by a shortest sequence of reciprocal translocations, insertions, and deletions, with bounds for the length of the sorting sequence it outputs. At a conceptual level, there is some similarity between our algorithm and the algorithm developed by El Mabrouk which is used to sort two chromosomes with different gene contents by reversals, insertions, and deletions.", "paper_title": "Sorting Genomes by Reciprocal Translocations, Insertions, and Deletions", "paper_id": "WOS:000277502300017"}