{"auto_keywords": [{"score": 0.049428038438509174, "phrase": "rule-based_system"}, {"score": 0.04185340582064192, "phrase": "knowledge_base"}, {"score": 0.00481495049065317, "phrase": "high_quality_knowledge_base"}, {"score": 0.004642292792558686, "phrase": "first_rule-based_systems"}, {"score": 0.004475798524102238, "phrase": "expert_systems"}, {"score": 0.0042178318724732005, "phrase": "medical_applications"}, {"score": 0.004066498558415824, "phrase": "electronic_format"}, {"score": 0.0037284065559949064, "phrase": "difficult_task"}, {"score": 0.0028340217672278975, "phrase": "theoretical_foundations"}, {"score": 0.0025744696954056404, "phrase": "redundant_character"}, {"score": 0.0021340985236583034, "phrase": "medical_treatment"}, {"score": 0.0021049977753042253, "phrase": "bronchial_asthma_disease"}], "paper_keywords": ["rule-based systems", " uncertainty", " knowledge base", " truth maintenance module"], "paper_abstract": "Although the first rule-based systems were created as early as thirty years ago, this methodology of expert systems designing still proves to be useful. It becomes especially important in medical applications, while treating evidence given in an electronic format. Constructing the knowledge base of a rule-based system and, especially, of a system with uncertainty is a difficult task because of the size of this base as well as its heterogeneous character. The base consists of facts, ordinary rules and meta-rules, which differ from each other regarding both the syntax structure and the semantics. Having no tool to aid designing and maintaining the knowledge base of a rule-based system with uncertainty, we propose the algebra of rules with uncertainty which gives us theoretical foundations to build such a tool. Using the tool, it will be possible to indicate the facts and rules of a redundant character, as well as the pairs of facts and the pairs of rules which are contradictory to each other. The above tool is used in designing and maintaining the knowledge base of a system intended to prognosticate the effects of a medical treatment of the bronchial asthma disease.", "paper_title": "HOW TO SECURE A HIGH QUALITY KNOWLEDGE BASE IN A RULE-BASED SYSTEM WITH UNCERTAINTY?", "paper_id": "WOS:000208555300010"}