{"auto_keywords": [{"score": 0.034182875683624124, "phrase": "jupiter_api"}, {"score": 0.01342015096835554, "phrase": "process_models"}, {"score": 0.0046073860169839305, "phrase": "public_domain"}, {"score": 0.0040366412779632085, "phrase": "input_and_output_conventions"}, {"score": 0.003841263262252044, "phrase": "analysis_methods"}, {"score": 0.0030808211830129304, "phrase": "sensitivity_analysis"}, {"score": 0.002947790697936243, "phrase": "uncertainty_analysis"}, {"score": 0.002915437843874821, "phrase": "model_discrimination"}, {"score": 0.0026543514413663893, "phrase": "rapid_programming"}, {"score": 0.0025963890234079333, "phrase": "new_ideas"}, {"score": 0.0025678829712650437, "phrase": "application-specific_coding"}, {"score": 0.00241659305727562, "phrase": "api."}, {"score": 0.0022368274529152342, "phrase": "existing_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["sensitivity", " uncertainty", " calibration", " optimization", " model discrimination"], "paper_abstract": "The open-source, public domain JUPITER (Joint Universal Parameter IdenTification and Evaluation of Reliability) API (Application Programming Interface) provides conventions and Fortran-90 modules to develop applications (computer programs) for analyzing process models. The input and output conventions allow application users to access various applications and the analysis methods they embody with a minimum of time and effort. Process models simulate, for example, physical, chemical, and (or) biological systems of interest using phenomenological, theoretical, or heuristic approaches. The types of model analyses supported by the JUPITER API include, but are not limited to, sensitivity analysis. data needs assessment, calibration, uncertainty analysis, model discrimination, and optimization. The advantages provided by the JUPITER API for users and programmers allow for rapid programming and testing of new ideas. Application-specific coding can be in languages other than the Fortran-90 of the API. This article briefly describes the capabilities and utility of the JUPITER API, lists existing applications, and uses UCODE_2005 as an example. Published by Elsevier Ltd.", "paper_title": "Building model analysis applications with the Joint Universal Parameter IdenTification and Evaluation of Reliability (JUPITER) API", "paper_id": "WOS:000253365200002"}