{"auto_keywords": [{"score": 0.04052739649381097, "phrase": "idle_state"}, {"score": 0.03689565391010681, "phrase": "frame's_backoff_counter"}, {"score": 0.02669102972383632, "phrase": "optimal_pseudo-p-persistent_scheme"}, {"score": 0.00481495049065317, "phrase": "backoff_counter_reservation"}, {"score": 0.004708409154920887, "phrase": "ieee"}, {"score": 0.004655640997424794, "phrase": "wireless_lans"}, {"score": 0.004501578643090429, "phrase": "novel_contention-based_protocol"}, {"score": 0.004146015717402716, "phrase": "proposed_scheme"}, {"score": 0.0036507498735369576, "phrase": "reserved_state"}, {"score": 0.003412887952564431, "phrase": "previous_successfully_transmitted_frame"}, {"score": 0.0032507647824680684, "phrase": "contentious_state"}, {"score": 0.002625866440129899, "phrase": "bcr-cs_protocol"}, {"score": 0.0025388011374541546, "phrase": "contentious_group"}, {"score": 0.0023466842270226888, "phrase": "analytical_analysis"}, {"score": 0.0022688546528208133, "phrase": "proposed_schemes"}, {"score": 0.0022267423703643623, "phrase": "eca"}], "paper_keywords": ["IEEE 802.11", " medium access control", " contention-based", " CSMA/CA"], "paper_abstract": "In this paper, we propose a novel contention-based protocol called backoff counter reservation and classifying stations (BCR-CS) for the IEEE 802.11 distributed coordination function (DCF). In the proposed scheme, each station has three states: idle, reserved, and contentious. A station is in the idle state if it has no frame ready to transmit. A station is in the reserved state if it has a frame ready to transmit and this frame's backoff counter has been successfully announced through the previous successfully transmitted frame so that other stations know this information. A station is in the contentious state if it has a frame ready to transmit, but this frame's backoff counter has not been successfully announced to other stations. All the stations in the idle state, the reserved state, and the contentious state form an idle group, a reserved group, and a contentious group, respectively. Two backoff schemes are proposed in the BCR-CS protocol based on the number of stations in the contentious group including the optimal pseudo-p-persistent scheme. The proposed schemes are compared with the DCF and the Enhanced Collision Avoidance (ECA) scheme in the literature. Extensive simulations and some analytical analysis are carried out. Our results show that all proposed schemes outperform both the DCF and the ECA, and the BCR-CS with optimal pseudo-p-persistent scheme is the best scheme among the four schemes.", "paper_title": "On optimizing backoff counter reservation and classifying stations for the IEEE 802.11 distributed wireless LANs", "paper_id": "WOS:000237786100011"}