{"auto_keywords": [{"score": 0.03067074282923616, "phrase": "interestingness_measures"}, {"score": 0.011930384972289832, "phrase": "medical_expert"}, {"score": 0.00481495049065317, "phrase": "medical_knowledge_discovery"}, {"score": 0.004586531354697466, "phrase": "rule_interestingness_measures"}, {"score": 0.004546174820239776, "phrase": "medical_kdd"}, {"score": 0.004466519142879166, "phrase": "clinical_datasets"}, {"score": 0.0038431888954930083, "phrase": "evaluation_results"}, {"score": 0.00354909279546064, "phrase": "clinical_dataset"}, {"score": 0.003365598242636633, "phrase": "interestingness_measure"}, {"score": 0.003306559295382181, "phrase": "medical_expert's_interest"}, {"score": 0.003149471116658739, "phrase": "similar_experiment"}, {"score": 0.0030264946886983833, "phrase": "comprehensive_results"}, {"score": 0.002592100731070259, "phrase": "real_human_interest"}, {"score": 0.0025578967205807843, "phrase": "medical_domain"}, {"score": 0.0022696277881969896, "phrase": "combinational_use"}, {"score": 0.002200337772403983, "phrase": "medical_experts"}, {"score": 0.0021331586055770447, "phrase": "human-system_interaction"}], "paper_keywords": ["data mining", " knowledge discovery in databases", " interestingness", " postprocessing", " clinical data"], "paper_abstract": "Objective: We discuss the usefulness of rule interestingness measures for medical KDD through experiments using clinical datasets, and, based on the outcomes of these experiments, also consider how to utilize these measures in postprocessing. Methods and materials: We first conducted an experiment to compare the evaluation results derived from a total of 40 various interestingness measures with those supplied by a medical expert for rules discovered in a clinical dataset on meningitis. We calculated and compared the performance of each interestingness measure to estimate a medical expert's interest using f-measure and correlation coefficient. We then conducted a similar experiment for hepatitis. Results and conclusion: The comprehensive results of experiments on meningitis and hepatitis indicate that the interestingness measures, accuracy, chi-square measure for one quadrant, relative risk, uncovered negative, and peculiarity, have a stable, reasonable performance in estimating real human interest in the medical domain. The results also indicate that the performance of interestingness measures is influenced by the certainty of a hypothesis made by the medical expert, and that the combinational use of interestingness measures will contribute to support medical experts to generate and confirm their hypotheses through human-system interaction. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Evaluation of rule interestingness measures in medical knowledge discovery in databases", "paper_id": "WOS:000251323500001"}