{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "differential_evolution"}, {"score": 0.004685855684376706, "phrase": "large-scale_optimisation"}, {"score": 0.00456020621016909, "phrase": "simple_yet_powerful_algorithm"}, {"score": 0.0045108906244892165, "phrase": "continuous_optimisation_problems"}, {"score": 0.004295459433506106, "phrase": "randomly_chosen_vectors"}, {"score": 0.0035701213515857227, "phrase": "proper_selection"}, {"score": 0.0034366728236876047, "phrase": "crossover_and_mutation_operations"}, {"score": 0.0033262524445013303, "phrase": "role_differentiation_mechanism"}, {"score": 0.002934764205541183, "phrase": "similarity_relations"}, {"score": 0.002719325177422626, "phrase": "new_differential_evolution_approach"}, {"score": 0.0024788167298469455, "phrase": "five_dimensions"}, {"score": 0.002128067018576581, "phrase": "representative_methods"}, {"score": 0.0021049977753042253, "phrase": "continuous_optimisation"}], "paper_keywords": ["Differential evolution", " Large-scale optimisation", " Real-parameter optimisation", " Role differentiation", " Malleable mating", " Mutation operation"], "paper_abstract": "Differential Evolution is a simple yet powerful algorithm for continuous optimisation problems. Traditionally, its operators combine the information of randomly chosen vectors of the population. However, four different roles are clearly identified from their formulations: receiving, placing, leading, and correcting vectors. In this work, we propose two mechanisms that emphasise the proper selection of vectors for each role in crossover and mutation operations: (1) the role differentiation mechanism defines the attributes for which vectors are selected for each role; (2) malleable mating allows placing vectors to adapt their mating trends to ensure some similarity relations with the leading and correcting vectors. In addition, we propose a new differential evolution approach that combines these two mechanisms. We have performed experiments on a testbed composed of 19 benchmark functions and five dimensions, ranging from 50 variables to 1,000. Results show that both mechanisms allow differential evolution to statistically improve its results, and that our proposal becomes competitive with regard to representative methods for continuous optimisation.", "paper_title": "Role differentiation and malleable mating for differential evolution: an analysis on large-scale optimisation", "paper_id": "WOS:000297127200003"}