{"auto_keywords": [{"score": 0.04548388910823853, "phrase": "commit_frequency"}, {"score": 0.024885999460535064, "phrase": "daily-committing_developers"}, {"score": 0.00481495049065317, "phrase": "time-based_commit_characteristics"}, {"score": 0.004578783486828809, "phrase": "commit_metadata"}, {"score": 0.004529696178827392, "phrase": "rich_source"}, {"score": 0.004497262692458022, "phrase": "time-based_characteristics"}, {"score": 0.00443308765153716, "phrase": "commit's_time"}, {"score": 0.004125634486868786, "phrase": "critical_property"}, {"score": 0.003909065355459264, "phrase": "commit's_time-based_characteristics"}, {"score": 0.00374399358035391, "phrase": "software_developers"}, {"score": 0.0037171648669537287, "phrase": "software_engineering_researchers"}, {"score": 0.0036247638406450735, "phrase": "code_reviewers"}, {"score": 0.0032774911048411835, "phrase": "commit's_bugginess"}, {"score": 0.003038983069081333, "phrase": "commit_authors"}, {"score": 0.002889672003089062, "phrase": "\"stable\"_commit"}, {"score": 0.002817846297258951, "phrase": "linux"}, {"score": 0.002747676657869163, "phrase": "xorg"}, {"score": 0.0025660347613972573, "phrase": "late-night_commits"}], "paper_keywords": ["Bug detection", " Empirical study", " Source control system"], "paper_abstract": "Modern software is often developed over many years with hundreds of thousands of commits. Commit metadata is a rich source of time-based characteristics, including the commit's time of day and the commit frequency and seniority of its author. The \"bugginess\" of a commit is also a critical property of that commit. In this paper, we investigate the correlation between a commit's time-based characteristics and its \"bugginess\"; such results can be useful for software developers and software engineering researchers. For instance, developers or code reviewers might be well-advised to thoroughly verify commits that are more likely to be buggy. In this paper, we study the correlation between a commit's bugginess and the time of day of the commit, the day of week of the commit, the commit frequency and seniority of the commit authors, and whether or not the developers have marked a commit as a \"stable\" commit. We survey three widely-used open source projects: the Linux kernel, PostgreSQL, and the Xorg server. Our main findings include: (1) commits between midnight and 4 AM (referred to as late-night commits) are significantly buggier and commits between 8 AM and noon are less buggy, implying that developers may want to double-check their own late-night commits; (2) daily-committing developers produce less-buggy commits, indicating that we may want to promote the practice of daily-committing developers reviewing other developers' commits; (3) the bugginess of commits versus day-of-week varies for different software projects; and (4) stable commits are significantly less buggy than commits in general.", "paper_title": "Correlations between bugginess and time-based commit characteristics", "paper_id": "WOS:000336388500007"}