{"auto_keywords": [{"score": 0.03363896917055259, "phrase": "classstruggle"}, {"score": 0.00481495049065317, "phrase": "evolving_thematic_clustering"}, {"score": 0.0047370749839861165, "phrase": "text_segmentation_process"}, {"score": 0.004660453113061494, "phrase": "thematic_text_segmentation_task"}, {"score": 0.004295459433506106, "phrase": "homogeneous_passages"}, {"score": 0.004068087482412997, "phrase": "linear_text_segmentation"}, {"score": 0.004024072318264299, "phrase": "general_corpuses"}, {"score": 0.0038948525410795517, "phrase": "initial_clustering"}, {"score": 0.0037087324991876727, "phrase": "preliminary_partitioning"}, {"score": 0.003648683020392928, "phrase": "global_view"}, {"score": 0.003589602322126282, "phrase": "sentences_relations"}, {"score": 0.0022472527731744974, "phrase": "first_experimental_results"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["text segmentation", " clustering"], "paper_abstract": "The thematic text segmentation task consists in identifying the most important thematic breaks in a document in order to cut it into homogeneous passages. We propose in this paper an algorithm for linear text segmentation on general corpuses. It relies on an initial clustering of the sentences of the text. This preliminary partitioning provides a global view on the sentences relations existing in the text, considering the similarities in a group rather than individually. The method, so-called ClassStruggle, is based on the distribution of the occurrences of the members of each class. During the process, the clusters then evolve, by considering a notion of proximity and of layout in the text, in the aim to create groups that contain only sentences related to a same topic development. Finally, boundaries are created between sentences belonging to two different classes. First experimental results are promising, ClassStruggle appears to be very competitive compared with existing methods.", "paper_title": "Using an evolving thematic clustering in a text segmentation process", "paper_id": "WOS:000254398800002"}