{"auto_keywords": [{"score": 0.04817552345370084, "phrase": "tct"}, {"score": 0.01581158930795114, "phrase": "extant_models"}, {"score": 0.010505966592713972, "phrase": "information_technology_outsourcing"}, {"score": 0.009402873596815067, "phrase": "outsourcing_decisions"}, {"score": 0.0073415178091797186, "phrase": "mixed_results"}, {"score": 0.00481495049065317, "phrase": "transaction_cost_theory"}, {"score": 0.004220314322073171, "phrase": "outsourcing-related_outcomes"}, {"score": 0.004011603024990615, "phrase": "mixed_and_unexpected_results"}, {"score": 0.0036614948691735105, "phrase": "empirical_literature"}, {"score": 0.0036245239349157236, "phrase": "tct-based_ito_models"}, {"score": 0.0031603487697867538, "phrase": "tct._first"}, {"score": 0.002672750634553146, "phrase": "tct_precepts"}, {"score": 0.002592523232809191, "phrase": "normative_nature"}], "paper_keywords": ["Transaction Cost Theory (TCT)", " IT outsourcing", " Literature review", " Normative theory", " Information technology outsourcing decision", " Cost difference", " Performance"], "paper_abstract": "Transaction Cost Theory (TCT) has been widely used in information technology outsourcing (ITO) research to explain and predict outsourcing decisions and outsourcing-related outcomes. This research, however, has led to mixed and unexpected results in terms of the effects of transaction attributes on outsourcing decisions and outcomes. This study assesses the empirical literature employing TCT-based ITO models in terms of its faithfulness to the precepts of TCT, and argues that one possible explanation for the mixed results is that the extant models do not capture all the essential elements of TCT. First, there are core TCT constructs that the extant models do not take into account: second, the linkages among constructs that the IT outsourcing models have hypothesized are not always in line with TCT precepts; and third, the normative nature of the theory is not always captured by the extant models. This paper, therefore, aims to provide one possible answer to the question: \"Why have the appropriations made of TCT to study IT outsourcing produced mixed results?\" (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "An assessment of the use of Transaction Cost Theory in information technology outsourcing", "paper_id": "WOS:000293489000002"}