{"auto_keywords": [{"score": 0.0477818152649793, "phrase": "gis"}, {"score": 0.04042094527442366, "phrase": "sam"}, {"score": 0.00481495049065317, "phrase": "cyberinfrastructure-based_geographic_information_systems"}, {"score": 0.004625255533545965, "phrase": "new_generation"}, {"score": 0.004523103062368843, "phrase": "important_research_direction"}, {"score": 0.0044231966846655394, "phrase": "geographic_information_science"}, {"score": 0.003955679223407243, "phrase": "big_spatial_data"}, {"score": 0.003920476803132283, "phrase": "computationally_intensive_spatial_analysis"}, {"score": 0.0035851703423654432, "phrase": "large_number"}, {"score": 0.003382704886584695, "phrase": "cybergis_challenges"}, {"score": 0.003293142761521422, "phrase": "scientific_perspectives"}, {"score": 0.003065698491529525, "phrase": "cybergis_software_research"}, {"score": 0.00298450444597311, "phrase": "software_integration"}, {"score": 0.002778317177178732, "phrase": "cybergis"}, {"score": 0.002716844480081738, "phrase": "holistic_integration_roadmap"}, {"score": 0.0023437863565921053, "phrase": "major_result"}, {"score": 0.002271476019266231, "phrase": "cybergis_modalities_-_gateway"}, {"score": 0.0022013916728990564, "phrase": "community-driven_and_participatory_approach"}, {"score": 0.0021239335561699106, "phrase": "scientific_breakthroughs"}], "paper_keywords": ["CyberGIS", " cyberinfrastructure", " geographic information science", " spatial analysis and modeling"], "paper_abstract": "CyberGIS - defined as cyberinfrastructure-based geographic information systems (GIS) - has emerged as a new generation of GIS representing an important research direction for both cyberinfrastructure and geographic information science. This study introduces a 5-year effort funded by the US National Science Foundation to advance the science and applications of CyberGIS, particularly for enabling the analysis of big spatial data, computationally intensive spatial analysis and modeling (SAM), and collaborative geospatial problem-solving and decision-making, simultaneously conducted by a large number of users. Several fundamental research questions are raised and addressed while a set of CyberGIS challenges and opportunities are identified from scientific perspectives. The study reviews several key CyberGIS software tools that are used to elucidate a vision and roadmap for CyberGIS software research. The roadmap focuses on software integration and synthesis of cyberinfrastructure, GIS, and SAM by defining several key integration dimensions and strategies. CyberGIS, based on this holistic integration roadmap, exhibits the following key characteristics: high-performance and scalable, open and distributed, collaborative, service-oriented, user-centric, and community-driven. As a major result of the roadmap, two key CyberGIS modalities - gateway and toolkit - combined with a community-driven and participatory approach have laid a solid foundation to achieve scientific breakthroughs across many geospatial communities that would be otherwise impossible.", "paper_title": "CyberGIS software: a synthetic review and integration roadmap", "paper_id": "WOS:000326226300002"}