{"auto_keywords": [{"score": 0.03733542705020162, "phrase": "jth_lptfs"}, {"score": 0.018716992873248576, "phrase": "output_error"}, {"score": 0.009454158888989357, "phrase": "reference_model"}, {"score": 0.009333459971790775, "phrase": "lptfs"}, {"score": 0.00481495049065317, "phrase": "piezo-driven_xy_table_systems"}, {"score": 0.004398872331144531, "phrase": "l_linear_pulse_transfer_function_systems"}, {"score": 0.003592859432554987, "phrase": "weighted_control_input"}, {"score": 0.002934098412396701, "phrase": "external_loads"}, {"score": 0.0029089095588612007, "phrase": "system_performance"}, {"score": 0.002703327151461985, "phrase": "output_disturbance"}, {"score": 0.002555950807368337, "phrase": "nonlinear_control"}, {"score": 0.002427035025924384, "phrase": "robust_performance"}, {"score": 0.0023650305205893353, "phrase": "overall_system"}, {"score": 0.0023145690608400425, "phrase": "lyapunov_stability_criterion"}, {"score": 0.0022651818270925704, "phrase": "piezo-driven_xy_table_system"}, {"score": 0.0021049977753042253, "phrase": "proposed_control"}], "paper_keywords": ["decentralized control", " fuzzy linear model", " mixed H-2/H-infinity", " optimization", " nonlinear control", " piezo-driven XY table system (PD-XY-TS)", " reference model"], "paper_abstract": "In this paper, a decentralized model reference control via fuzzy mixed H-2/H-infinity optimization design was developed. Each subsystem contained L linear pulse transfer function systems (LPTFSs). The reference model for every LPTFS was first designed to shape the response of the ith closed-loop subsystem. Then the H-2-norm of the output error (i.e., the difference between the output of the reference model and the system) and weighted control input of the jth LPTFS was minimized to obtain a control such that smaller energy consumption with bounded tracking error of the jth LPTFS was achieved. However, an output disturbance of the jth LPTFS caused by the interactions among the LPTFSs, the interconnections among the subsystems, modeling errors, and external loads deteriorated system performance or even resulted in instability. In this situation, the H-infinity-norm of weighted sensitivity between output disturbance and output error of the jth LPTFS was minimized to attenuate its effect. A nonlinear control based on output error for every LPTFS was also established to improve robust performance. The stability of the overall system was then verified by Lyapunov stability criterion. The application to piezo-driven XY table system (PD-XY-TS) was carried out to confirm the usefulness of the proposed control.", "paper_title": "Fuzzy mixed H-2/H-infinity optimization-based decentralized model reference control and application to piezo-driven XY table systems", "paper_id": "WOS:000245684800002"}