{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cost-optimal_factored_planning_problems"}, {"score": 0.004530794611704416, "phrase": "predefined_goal"}, {"score": 0.004241771072194993, "phrase": "action_plan"}, {"score": 0.003569763795153386, "phrase": "extra_requirement"}, {"score": 0.00351582806482809, "phrase": "global_plan"}, {"score": 0.003445174898115646, "phrase": "modular_manner"}, {"score": 0.003308085469148074, "phrase": "action_costs"}, {"score": 0.0031125795874844438, "phrase": "classical_message"}, {"score": 0.003019189898170698, "phrase": "belief_propagation"}, {"score": 0.002943502888225748, "phrase": "bayesian_networks"}, {"score": 0.0028551716387011637, "phrase": "complex_information"}, {"score": 0.002260211578368138, "phrase": "new_approaches"}, {"score": 0.0021923400552366756, "phrase": "classical_benchmarks"}, {"score": 0.002126502291103601, "phrase": "valuable_alternative"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Factored planning", " weighted automata", " networks of automata", " concurrency"], "paper_abstract": "This paper proposes an approach to solve cost-optimal factored planning problems. Planning consists in organizing actions in order to reach some predefined goal. In factored planning one considers several interacting planning problems and has to design an action plan for each of them. But one must also guarantee that all these local plans are compatible: actions shared among several problems must be jointly performed or jointly rejected. We enrich the problem with the extra requirement that the global plan computed in this modular manner must also minimize the sum of all action costs. A solution is provided to this problem, based on classical message passing algorithms, known as belief propagation in the setting of Bayesian networks. Here, messages carry complex information under the form of weighted (or (min; +)) automata, and all computations are performed with these objects. At the time our first paper on this topic was published, this method was the only one to solve cost-optimal factored planning problems in a modular way. Since then, new approaches were proposed. Experiments on classical benchmarks show that it is a valuable alternative to existing methods.", "paper_title": "Factored Cost-Optimal Planning Using Message Passing Algorithms", "paper_id": "WOS:000358735200003"}