{"auto_keywords": [{"score": 0.04545470944837335, "phrase": "schlieren"}, {"score": 0.00481495049065317, "phrase": "weno_flux_reconstruction_order"}, {"score": 0.004718431349852634, "phrase": "reshocked_two-dimensional_richtmyer-meshkov_instability"}, {"score": 0.003996271202811961, "phrase": "energy_spectra"}, {"score": 0.003932003833923186, "phrase": "probability_distribution_functions"}, {"score": 0.003900257249255497, "phrase": "numerical_turbulent_kinetic_energy"}, {"score": 0.003822003373331997, "phrase": "numerical_reynolds_numbers"}, {"score": 0.003775803846431323, "phrase": "numerical_viscosity"}, {"score": 0.003640516896245813, "phrase": "long_evolution_times"}, {"score": 0.003524322230452833, "phrase": "implicit_numerical_dissipation"}, {"score": 0.003398015125667192, "phrase": "higher-order_higher-resolution_simulations"}, {"score": 0.003070340620983981, "phrase": "energy_deposition"}, {"score": 0.00303319936111073, "phrase": "second_shock-interface_interaction"}, {"score": 0.0029722900280316216, "phrase": "small-scale_structures"}, {"score": 0.0029482691362918423, "phrase": "lower-order_lower-resolution_simulations"}, {"score": 0.002831037222426215, "phrase": "late_times"}, {"score": 0.002796782643988021, "phrase": "higher-order_higher-resolution_simulations_exhibit_fragmentation"}, {"score": 0.002674681176379472, "phrase": "similar_flow_features"}, {"score": 0.0024761702541879213, "phrase": "computational_scaling"}, {"score": 0.0022830706430588482, "phrase": "present_investigation"}, {"score": 0.002246292543825748, "phrase": "ninth-order_weno_method"}, {"score": 0.002148172508419683, "phrase": "complex_multi-scale_flows"}, {"score": 0.0021049977753042253, "phrase": "shock-induced_hydrodynamic_instabilities"}], "paper_keywords": ["Richtmyer-Meshkov instability", " weighted essentially non-oscillatory (WENO) method", " mixing properties", " reshock", " numerical dissipation"], "paper_abstract": "Weighted essentially non-oscillatory (WENO) simulations of the reshocked two-dimensional single-mode Richtmyer-Meshkov instability using third-, fifth- and ninth-order spatial flux reconstruction and uniform grid resolutions corresponding to 128, 256 and 512 points per initial perturbation wavelength are presented. The dependence of the density, vorticity, simulated density Schlieren and baroclinic production fields, mixing layer width, circulation deposition, mixing profiles, production and mixing fractions, energy spectra, statistics, probability distribution functions, numerical turbulent kinetic energy and enstrophy production/dissipation rates, numerical Reynolds numbers, and numerical viscosity on the order and resolution is investigated to long evolution times. The results are interpreted using the implicit numerical dissipation in the characteristic projection-based, finite-difference WENO method. It is shown that higher-order higher-resolution simulations have lower numerical dissipation. The sensitivity of the quantities considered to the order and resolution is further amplified following reshock, when the energy deposition by the second shock-interface interaction induces the formation of small-scale structures. Lower-order lower-resolution simulations preserve large-scale structures and flow symmetry to late times, while higher-order higher-resolution simulations exhibit fragmentation of the structures, symmetry breaking and increased mixing. Similar flow features are qualitatively and quantitatively captured by either approximately doubling the order or the resolution. Additionally, the computational scaling shows that increasing the order is more advantageous than increasing the resolution for the flow considered here. The present investigation suggests that the ninth-order WENO method is well-suited for the simulation and analysis of complex multi-scale flows and mixing generated by shock-induced hydrodynamic instabilities. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Effects of WENO flux reconstruction order and spatial resolution on reshocked two-dimensional Richtmyer-Meshkov instability", "paper_id": "WOS:000244463800019"}