{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "participant_acceptance"}, {"score": 0.004031082737449308, "phrase": "third_parties"}, {"score": 0.0038678251731669865, "phrase": "initial_phase"}, {"score": 0.003459191419478298, "phrase": "facial_mesh"}, {"score": 0.0033883824438527316, "phrase": "custom_software_pipeline"}, {"score": 0.0032780806856932423, "phrase": "experimental_participants"}, {"score": 0.0032510690712452147, "phrase": "six_more_faces"}, {"score": 0.0031845067058084583, "phrase": "participants'_own_face"}, {"score": 0.002968192753809507, "phrase": "facial_similarities"}, {"score": 0.0029194625087935345, "phrase": "second_phase"}, {"score": 0.0028953973490895746, "phrase": "full-body_avatars"}, {"score": 0.002789528662623221, "phrase": "direct_pipeline_output"}, {"score": 0.002665362204725326, "phrase": "virtual_self-representations"}, {"score": 0.0025999744005191713, "phrase": "perceived_resemblance"}, {"score": 0.002305799666781492, "phrase": "participants'_face"}, {"score": 0.0022679195103377124, "phrase": "ethnically_similar_face"}, {"score": 0.0022214412809055013, "phrase": "high_scores"}, {"score": 0.0021049977753042253, "phrase": "reasonably_physically_similar_avatars"}], "paper_keywords": [""], "paper_abstract": "An experiment was carried out to examine the extent to which an avatar can be perceived by people as similar to themselves, including their face and body. The avatar was judged by the participants themselves rather than by third parties. The experiment was organized in two phases. The initial phase consisted of a forced-choice, paired comparison method used to create a ranking of 10 virtual faces in order of preference. This set of faces included a facial mesh, created by a custom software pipeline to rapidly generate avatars that resembled the experimental participants. Six more faces, derived from the participants' own face, were also shown in order to gain insight into the acceptance of a variety of facial similarities. In the second phase, full-body avatars with the most and least preferred faces were presented along with the direct pipeline output. Participants rated their level of satisfaction with those avatars as virtual self-representations and provided the level of perceived resemblance to themselves. The results show that our avatars are perceived to be similar to the self, rated at 7.5/10. Those avatars with faces derived from the participants' face mixed with an ethnically similar face were also rated with high scores. These results differ significantly from how arbitrary avatars are perceived. Therefore, reasonably physically similar avatars can also be expected to be perceived as similar by participants.", "paper_title": "Achieving Participant Acceptance of their Avatars", "paper_id": "WOS:000343529400007"}