{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mcdm"}, {"score": 0.03866142097114805, "phrase": "cl_concept"}, {"score": 0.004746263721902201, "phrase": "fuzzy_dematel"}, {"score": 0.0046118021635786315, "phrase": "city_logistics_concept_selection"}, {"score": 0.004530267349043752, "phrase": "cl"}, {"score": 0.004385555408850022, "phrase": "negative_effects"}, {"score": 0.004354149483556514, "phrase": "logistics_processes"}, {"score": 0.0042004472903194616, "phrase": "sustainable_development"}, {"score": 0.0041703614123283165, "phrase": "urban_areas"}, {"score": 0.0035858673522839407, "phrase": "different_participants"}, {"score": 0.0034097787109430384, "phrase": "cl_participants"}, {"score": 0.003361069456060196, "phrase": "usually_conflicting_goals"}, {"score": 0.003230665474330377, "phrase": "large_number"}, {"score": 0.0031845067058084583, "phrase": "concepts_evaluation"}, {"score": 0.0030171910207671205, "phrase": "specific_situation"}, {"score": 0.0028076592725295646, "phrase": "best_alternative"}, {"score": 0.0026315183701883437, "phrase": "fuzzy_decision_making_trial_and_evaluation_laboratory_model"}, {"score": 0.0025752890978323873, "phrase": "analytical_network_process"}, {"score": 0.00255681778200072, "phrase": "anp"}, {"score": 0.0025202582748972122, "phrase": "visekriterijumska_optimizacija"}, {"score": 0.002387758958649797, "phrase": "decision_makers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["City logistics concept", " MCDM", " Fuzzy DEMATEL", " Fizzy ANP", " Fuzzy VIKOR"], "paper_abstract": "City logistics (CL) tends to increase efficiency and mitigate the negative effects of logistics processes and activities and at the same time to support the sustainable development of urban areas. Accordingly, various measures and initiatives are applying and various conceptual solutions are defining. The effects vary depending on the characteristics of the city. This paper proposes a framework for the selection of the CL concept which would be most appropriate for different participants, stakeholders, and which would comply with attributes of the surroundings. CL participants have different, usually conflicting goals and interests, so it is necessary to define a large number of criteria for concepts evaluation. On the other hand, the importance of the criteria is dependent on the specific situation, i.e., a large number of factors describing the surroundings. In situations like this, selecting the best alternative is a complex multi-criteria decision-making (MCDM) problem consisting of conflicting and uncertain elements. A novel hybrid MCDM model that combines fuzzy Decision Making Trial and Evaluation Laboratory Model (DEMATEL), fuzzy Analytical Network Process (ANP) and fuzzy Visekriterijumska Optimizacija i kompromisno Resenje (VIKOR) methods is developed in this paper. The model provides support to decision makers (planners, city administration, logistics service providers, users, etc.) when selecting the CL concept, which is successfully performed in this paper for the City of Belgrade. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A novel hybrid MCDM model based on fuzzy DEMATEL, fuzzy ANP and fuzzy VIKOR for city logistics concept selection", "paper_id": "WOS:000342250300008"}