{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_reasoning"}, {"score": 0.04725332734585437, "phrase": "affective_decision_making"}, {"score": 0.004404445045826858, "phrase": "positive_and_negative_pieces"}, {"score": 0.004281284532043714, "phrase": "classical_forms"}, {"score": 0.0037150687722055727, "phrase": "possibilistic_analysis"}, {"score": 0.0029244418026475832, "phrase": "positive_or_negative_pieces"}, {"score": 0.002877361619893651, "phrase": "human_hypothesis_testing"}, {"score": 0.0028081546657056948, "phrase": "puzzling_psychological_results"}, {"score": 0.0025682999078906936, "phrase": "bivariate_bipolarity"}, {"score": 0.0024461989110005447, "phrase": "multivariate_bipolarity"}, {"score": 0.002348883765159185, "phrase": "emotional_reasoning"}, {"score": 0.0023298892270500983, "phrase": "decision_making"}, {"score": 0.0022281257694320433, "phrase": "possible_situations"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "This article explores several facets of bipolarity in human reasoning and affective decision making. First, it examines how positive and negative pieces of information help to discriminate between classical forms of reasoning (deduction, induction, and abduction). It is shown that (1) both positive and negative information can independently account for these distinctions and (2) these same distinctions can be accounted for by a possibilistic analysis of the plausibility of the states of the world ruled out by the premises and the ones compatible with these premises. Second, it is shown that an analysis of the plausibility (\"impossible,\" \"guaranteed possible,\" \"nortimpossible\") of the states of the world ruled out or allowed by positive or negative pieces of information in human hypothesis testing allows us to explain some puzzling psychological results. Next, bipolarity is explored in the domain of affective decision making. It is proposed notably that the combination of the bivariate bipolarity of emotions (negative, neutral, positive) and the multivariate bipolarity of emotions of comparison provide the tools for an emotional reasoning and decision making which might be the way by which we actually evaluate possible situations and take our decisions, instead of maximizing our expected utility. (C) 2008 Wiley Periodicals, Inc.", "paper_title": "Bipolarity in human reasoning and affective decision making", "paper_id": "WOS:000257730200004"}