{"auto_keywords": [{"score": 0.03914346881278065, "phrase": "institutional_constraints"}, {"score": 0.007740489563401459, "phrase": "normative_system"}, {"score": 0.004435363840720883, "phrase": "logical_architecture"}, {"score": 0.004256895619944631, "phrase": "logical_components"}, {"score": 0.004127753467337283, "phrase": "architectural_approach"}, {"score": 0.0031116969916925824, "phrase": "makinson"}, {"score": 0.0030483707596811395, "phrase": "torre"}, {"score": 0.002940626369102927, "phrase": "logical_relations"}, {"score": 0.00266693888510356, "phrase": "combined_system"}, {"score": 0.0023694065215394593, "phrase": "underlying_base_logic"}, {"score": 0.0023451553255837317, "phrase": "counts-as"}, {"score": 0.002250601866422547, "phrase": "pre-processing_step"}, {"score": 0.0022161333611134806, "phrase": "regulative_norms"}], "paper_keywords": [""], "paper_abstract": "Logical architectures combine several logics into a more complex logical system. In this paper we study a logical architecture using input/output operations corresponding to the functionality of logical components. We illustrate how the architectural approach can be used to develop a logic of a normative system based on logics of counts-as conditionals, institutional constraints, obligations and permissions. In this example we adapt for counts-as conditionals and institutional constraints a proposal of Jones and Sergot, and for obligations and permissions we adapt the input/output logic framework of Makinson and van der Torre. We use our architecture to study logical relations among counts-as conditionals, institutional constraints, obligations and permissions. We show that in our logical architecture the combined system of counts-as conditionals and institutional constraints reduces to the logic of institutional constraints, which again reduces to an expression in the underlying base logic. Counts-as conditionals and institutional constraints are defined as a pre-processing step for the regulative norms. Permissions are defined as exceptions to obligations and their interaction is characterized.", "paper_title": "A logical architecture of a normative system", "paper_id": "WOS:000239626400005"}