{"auto_keywords": [{"score": 0.004758457292840376, "phrase": "president_obama's_inaugural_flagship_open_data_program"}, {"score": 0.00443308765153716, "phrase": "governmental_work"}, {"score": 0.004355267258397068, "phrase": "data_analysis"}, {"score": 0.00420368356873615, "phrase": "first_time"}, {"score": 0.0040097139701644165, "phrase": "passive-aggressive_attitude"}, {"score": 0.003479692058963528, "phrase": "tiny_group"}, {"score": 0.003299460925313939, "phrase": "data.gov_web_arena"}, {"score": 0.00314708280192844, "phrase": "open_data's_transparency_goal"}, {"score": 0.0029489527539649737, "phrase": "federal_agencies'_goal"}, {"score": 0.0028293966058473476, "phrase": "data_trade"}, {"score": 0.00266693888510356, "phrase": "open_data"}, {"score": 0.0022070310530794097, "phrase": "alternative_federal_information_marketplace"}, {"score": 0.002142696637011647, "phrase": "incentivize_agencies"}, {"score": 0.0021049977753042253, "phrase": "data_sharing"}], "paper_keywords": [""], "paper_abstract": "President Obama's inaugural flagship Open Data program emphasizes the values of transparency, participation, and collaboration in governmental work. The Open Data performance data analysis, published here for the first time, proposes that most federal agencies have adopted a passive-aggressive attitude toward this program by appearing to cooperate with the program while in fact effectively ignoring it. The analysis further suggests that a tiny group of agencies are the only \"real players\" in the Data.gov web arena. This research highlights the contradiction between Open Data's transparency goal (\"All data must be freed\") and federal agencies' goal of collaborating with each other through data trade. The research also suggests that agencies comprehended that Open Data is likely to exacerbate three critical, back-office data-integration problems: inclusion, confusion, and diffusion. The article concludes with a proposal to develop an alternative Federal Information Marketplace (FIM) to incentivize agencies to improve data sharing.", "paper_title": "When Transparency and Collaboration Collide: The USA Open Data Program", "paper_id": "WOS:000296453900001"}