{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "catalytic_reaction_networks"}, {"score": 0.004590052784169268, "phrase": "key_role"}, {"score": 0.004530552828603269, "phrase": "self-organizing_processes"}, {"score": 0.004375613460102574, "phrase": "existing_models"}, {"score": 0.004262881313926916, "phrase": "protocell_architecture"}, {"score": 0.0037903327482565097, "phrase": "aforementioned_sets"}, {"score": 0.0037087324991876727, "phrase": "random_molecules"}, {"score": 0.003660614912817745, "phrase": "simple_experimental_setting"}, {"score": 0.0030092017034068666, "phrase": "lipid_vesicle"}, {"score": 0.0029443683459283955, "phrase": "simplest_possible_protocell_architecture"}, {"score": 0.002880927789104712, "phrase": "semi-permeable_membrane"}, {"score": 0.002831158147480665, "phrase": "molecular_types"}, {"score": 0.002594880866651459, "phrase": "aqueous_phase"}, {"score": 0.0025611773887867255, "phrase": "internal_compartment"}, {"score": 0.002516917671182532, "phrase": "first_approximation"}, {"score": 0.002462664392109308, "phrase": "protocell_growth"}, {"score": 0.0022967713922705, "phrase": "stochastic_model"}, {"score": 0.0021049977753042253, "phrase": "exhaustive_protocell_model"}], "paper_keywords": ["Autocatalytic sets of molecules", " Catalytic reaction sets", " Origin of life", " Stochastic simulations", " Protocell"], "paper_abstract": "Protocells are supposed to have played a key role in the self-organizing processes leading to the emergence of life. Existing models either (i) describe protocell architecture and dynamics, given the existence of sets of collectively self-replicating molecules for granted, or (ii) describe the emergence of the aforementioned sets from an ensemble of random molecules in a simple experimental setting (e.g. a closed system or a steady-state flow reactor) that does not properly describe a protocell. In this paper we present a model that goes beyond these limitations by describing the dynamics of sets of replicating molecules within a lipid vesicle. We adopt the simplest possible protocell architecture, by considering a semi-permeable membrane that selects the molecular types that are allowed to enter or exit the protocell and by assuming that the reactions take place in the aqueous phase in the internal compartment. As a first approximation, we ignore the protocell growth and division dynamics. The behavior of catalytic reaction networks is then simulated by means of a stochastic model that accounts for the creation and the extinction of species and reactions. While this is not yet an exhaustive protocell model, it already provides clues regarding some processes that are relevant for understanding the conditions that can enable a population of protocells to undergo evolution and selection.", "paper_title": "A stochastic model of catalytic reaction networks in protocells", "paper_id": "WOS:000341089700008"}