{"auto_keywords": [{"score": 0.04868684268038368, "phrase": "atmospheric_perspective_effect"}, {"score": 0.012032267535804265, "phrase": "depth-aware_lightness"}, {"score": 0.011299997495200954, "phrase": "landscape_paintings"}, {"score": 0.00481495049065317, "phrase": "atmospheric_perspective_effect_enhancement_of_landscape_photographs"}, {"score": 0.0046161999598320486, "phrase": "physical_phenomenon"}, {"score": 0.004444317282171449, "phrase": "distant_objects"}, {"score": 0.003738502710504415, "phrase": "landscape_photographs"}, {"score": 0.0036450381529042103, "phrase": "saturation_contrast_values"}, {"score": 0.0032938942910948096, "phrase": "statistical_study"}, {"score": 0.003104849179057156, "phrase": "intra-depth_planes"}, {"score": 0.002939007076062123, "phrase": "contrast_organization"}, {"score": 0.0028775998963807324, "phrase": "existing_contrast_relationships"}, {"score": 0.00284137141260141, "phrase": "natural_scene"}, {"score": 0.002655697256976997, "phrase": "visual_appeal"}, {"score": 0.002349467661235186, "phrase": "contrast_mapping"}, {"score": 0.0023003498123420237, "phrase": "optimization_problem"}, {"score": 0.0022522565004588113, "phrase": "desired_inter-contrast"}, {"score": 0.0021773853011112882, "phrase": "gradient_constraints"}, {"score": 0.0021590588269751816, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Atmospheric perspective", " depth-aware contrast", " image manipulation", " landscape photograph"], "paper_abstract": "The atmospheric perspective effect is a physical phenomenon relating to the effect that atmosphere has on distant objects, causing them to be lighter and less distinct. The exaggeration of this effect by artists in 2D images increases the illusion of depth thereby making the image more interesting. This paper addresses the enhancement of the atmospheric perspective effect in landscape photographs by themanipulation of depth-aware lightness and saturation contrast values. The form of this manipulation follows the organization of such contrasts in landscape paintings. The objective of this manipulation is based on a statistical study which has clearly shown that the saturation and lightness contrasts inter-and intra-depth planes in paintings are more purposefully organized than those in photographs. This contrast organization in paintings respects the existing contrast relationships within a natural scene guided by the atmospheric perspective effect and also exaggerates them sufficiently with a view to improving the visual appeal of the painting and the illusion of depth within it. The depth-aware lightness and saturation contrasts revealed in landscape paintings guide the mapping of such contrasts in photographs. This contrast mapping is formulated as an optimization problem that simultaneously considers the desired inter-contrast, intra-contrast, and specified gradient constraints. Experimental results demonstrate that by using this proposed approach, both the visual appeal and the illusion of depth in the photographs are effectively improved.", "paper_title": "Atmospheric Perspective Effect Enhancement of Landscape Photographs Through Depth-Aware Contrast Manipulation", "paper_id": "WOS:000333111500007"}