{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "synthesis_of_control"}, {"score": 0.004767546015485477, "phrase": "mathematical_model"}, {"score": 0.004582528208024817, "phrase": "longitudinal_plane"}, {"score": 0.0038919354605673104, "phrase": "perfectly_rigid_rods"}, {"score": 0.0037967593942595233, "phrase": "considered_model"}, {"score": 0.003192406091820197, "phrase": "thrust_vector"}, {"score": 0.003038066486989815, "phrase": "steady-state_regimes"}, {"score": 0.0029199689963238726, "phrase": "constant_thrust"}, {"score": 0.0028203950416405563, "phrase": "automatic_thrust_control"}, {"score": 0.0025668646315794947, "phrase": "asymptotic_stability"}, {"score": 0.0025289662786567896, "phrase": "paraglider_motion"}, {"score": 0.0024916260764216752, "phrase": "constant_altitude"}, {"score": 0.0023130151703068444, "phrase": "feedback_coefficients"}, {"score": 0.0021049977753042253, "phrase": "numerical_simulation"}], "paper_keywords": [""], "paper_abstract": "Mathematical model of motion of a paraglider in the longitudinal plane is constructed. The vehicle consists of a sail and a gondola. Both bodies are assumed to be perfectly rigid. They are connected by slings which are assumed to be perfectly rigid rods. Thus, the considered model of the paraglider represents one rigid body with three degrees of freedom. An engine, which develops thrust using a propeller, is mounted rigidly on the gondola of the vehicle. The orientation of the thrust vector with respect to the gondola is constant. The steady-state regimes of motion of the paraglider for the constant thrust are found. The law of automatic thrust control for which the flight of the vehicle is stabilized at the given altitude is designed. The domains of asymptotic stability of the paraglider motion at a constant altitude, including with account of delay, are constructed in the plane of the feedback coefficients. In this plane the domains in which a given stability factor is ensured are constructed. Some results of numerical simulation of the flight of the vehicle are presented.", "paper_title": "Autonomous Longitudinal Motion of a Paraglider. Mathematical Simulation, Synthesis of Control", "paper_id": "WOS:000260122200012"}