{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "vocabulary_creation"}, {"score": 0.00465067040500426, "phrase": "increasing_attention"}, {"score": 0.004491970050862321, "phrase": "statistical_features"}, {"score": 0.003749654338704576, "phrase": "topical_and_distributional_perspectives"}, {"score": 0.003571591012750155, "phrase": "structural_description"}, {"score": 0.0035222812668916736, "phrase": "textual_description"}, {"score": 0.0031079352545607267, "phrase": "graph_model"}, {"score": 0.002879029968532794, "phrase": "data_set"}, {"score": 0.0025937408242280757, "phrase": "cluster_analysis"}, {"score": 0.0024533019565858073, "phrase": "different_perspectives"}, {"score": 0.0022567398334877847, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph analysis", " Ontology", " Relatedness", " Vocabulary"], "paper_abstract": "Given thousands of vocabularies published and used on the Web of data, the sociology of vocabulary creation and application is receiving increasing attention, which studies the statistical features of and the relations between vocabularies from various sources. In this article, we tackle a taxonomy of relatedness between vocabularies, comprising declarative, topical and distributional perspectives, which are derived from the structural description, textual description and context of use of a vocabulary, respectively. We characterize each perspective by using a graph model representing vocabularies and their relatedness, and implement it over a data set containing 2996 vocabularies and 4.1 billion RDF triples, based on which we perform degree, connectivity and cluster analysis. We also discuss the correlation between different perspectives. The results and findings are expected to be useful for future research and development on vocabularies. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Relatedness between vocabularies on the Web of data: A taxonomy and an empirical study", "paper_id": "WOS:000324302000001"}