{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_combinations"}, {"score": 0.04893803343163639, "phrase": "replacement_networks"}, {"score": 0.004242085112539693, "phrase": "interaction_network"}, {"score": 0.0037825134619339537, "phrase": "topological_relationship"}, {"score": 0.0033929894721242367, "phrase": "imitation_process"}, {"score": 0.003252542052430782, "phrase": "agent-based_model"}, {"score": 0.0031941384895530426, "phrase": "evolutionary_prisoner's_dilemma"}, {"score": 0.0025853238923610076, "phrase": "almost_deterministic_selection"}, {"score": 0.0025388705701873075, "phrase": "best_strategy"}, {"score": 0.0024932498388507084, "phrase": "extremely_stochastic_selection"}, {"score": 0.002448446849997207, "phrase": "evolutionary_experiments"}, {"score": 0.0021049977753042253, "phrase": "minimum_scale"}], "paper_keywords": ["evolution of cooperation", " prisoner's dilemma", " interaction and replacement networks", " intensity of selection", " artificial life"], "paper_abstract": "There arc various discussions on the evolution of cooperation on different combinations of interaction network for playing games and the replacement network for imitation of strategies. This paper aims at clarifying the topological relationship between these networks that facilitates the evolution of cooperation by focusing on the intensity of selection for imitation process of strategies. We construct an agent-based model of the evolutionary prisoner's dilemma on different combinations of interaction and replacement networks. The relationship between these networks can be adjusted by the scales of interaction and reproduction, and the intensity of selection can be adjusted from the almost deterministic selection of the best strategy to the extremely stochastic selection. The evolutionary experiments shows that the larger scale of reproduction than the scale of interaction brought about higher level cooperation when the intensity of selection is high, and the minimum scale of interaction and reproduction was the best for the evolution of cooperation when the intensity of selection is low.", "paper_title": "Evolution of cooperation on different combinations of interaction and replacement networks with various intensity of selection", "paper_id": "WOS:000308614400003"}