{"auto_keywords": [{"score": 0.04407953898448545, "phrase": "mobile_healthcare"}, {"score": 0.004565007074039171, "phrase": "wearable_devices"}, {"score": 0.004327981760540394, "phrase": "increasing_feasibility"}, {"score": 0.004048860957751714, "phrase": "healthcare_providers"}, {"score": 0.003995226376780718, "phrase": "policy_makers"}, {"score": 0.00378767277402891, "phrase": "major_challenge"}, {"score": 0.003687960013746783, "phrase": "round-the-clock_healthcare_services"}, {"score": 0.0034963129868796033, "phrase": "wearable_wireless_medical_devices"}, {"score": 0.003359119985242403, "phrase": "privacy_concerns"}, {"score": 0.0031845067058084583, "phrase": "open_wireless_channels"}, {"score": 0.0027680095380207756, "phrase": "personal_information"}, {"score": 0.0023113506171584157, "phrase": "telemedicine_systems"}, {"score": 0.002235433376874495, "phrase": "current_secure_strategies"}, {"score": 0.0021333110194180997, "phrase": "wireless_communications"}, {"score": 0.0021049977753042253, "phrase": "healthcare_systems"}], "paper_keywords": [""], "paper_abstract": "Patient monitoring provides flexible and powerful patient surveillance through wearable devices at any time and anywhere. The increasing feasibility and convenience of mobile healthcare has already introduced several significant challenges for healthcare providers, policy makers, hospitals, and patients. A major challenge is to provide round-the-clock healthcare services to those patients who require it via wearable wireless medical devices. Furthermore, many patients have privacy concerns when it comes to releasing their personal information over open wireless channels. As a consequence, one of the most important and challenging issues that healthcare providers must deal with is how to secure the personal information of patients and to eliminate their privacy concerns. In this article we present several techniques that can be used to monitor patients effectively and enhance the functionality of telemedicine systems, and discuss how current secure strategies can impede the attacks faced by wireless communications in healthcare systems and improve the security of mobile healthcare.", "paper_title": "MONITORING PATIENTS VIA A SECURE AND MOBILE HEALTHCARE SYSTEM", "paper_id": "WOS:000274816900011"}