{"auto_keywords": [{"score": 0.031185327721383667, "phrase": "ttf_construct"}, {"score": 0.030776783540471978, "phrase": "academic_settings"}, {"score": 0.02796610605671444, "phrase": "significant_positive_impact"}, {"score": 0.027146280565839193, "phrase": "ttf"}, {"score": 0.00481495049065317, "phrase": "task-technology_fit_model"}, {"score": 0.004454158739805578, "phrase": "academic_libraries"}, {"score": 0.003956113993518042, "phrase": "smart_readers"}, {"score": 0.0034545033623115634, "phrase": "new_medium"}, {"score": 0.003294350220187021, "phrase": "information_technology"}, {"score": 0.003195324728141602, "phrase": "content_analysis"}, {"score": 0.0031629800646754474, "phrase": "online_survey"}, {"score": 0.003088916151721289, "phrase": "medicine"}, {"score": 0.0028764048059439205, "phrase": "exploratory_factor_analysis"}, {"score": 0.0028569549040495163, "phrase": "preliminary_findings"}, {"score": 0.0027060037347363987, "phrase": "confirmatory_factor_analysis"}, {"score": 0.002687702958515561, "phrase": "partial_least_squares_path_modeling"}, {"score": 0.002660482980203146, "phrase": "overall_ttf_model"}, {"score": 0.0025717199672018304, "phrase": "individual_characteristics"}, {"score": 0.0024440836179156593, "phrase": "individuals'_performance"}, {"score": 0.0023625233416109917, "phrase": "individual_performance"}, {"score": 0.0021556211190198703, "phrase": "ttf_framework"}, {"score": 0.0021337783230121286, "phrase": "perceived_fit"}, {"score": 0.0021049977753042253, "phrase": "academic_tasks"}], "paper_keywords": ["electronic books"], "paper_abstract": "Increasingly, e-books are becoming alternatives to print books in academic libraries, thus providing opportunities to assess how well the use of e-books meets the requirements of academics. This study uses the tasktechnology fit (TTF) model to explore the interrelationships of e-books, the affordances offered by smart readers, the information needs of academics, and the \" fit\" of technology to tasks as well as performance. We propose that the adoption of e-books will be dependent on how academics perceive the fit of this new medium to the tasks they undertake as well as what added-value functionality is delivered by the information technology that delivers the content. The study used content analysis and an online survey, administered to the faculty in Medicine, Science and Engineering at the University of New South Wales, to identify the attributes of a TTF construct of e-books in academic settings. Using exploratory factor analysis, preliminary findings confirmed annotation, navigation, and output as the core dimensions of the TTF construct. The results of confirmatory factor analysis using partial least squares path modeling supported the overall TTF model in reflecting significant positive impact of task, technology, and individual characteristics on TTF for e-books in academic settings; it also confirmed significant positive impact of TTF on individuals' performance and use, and impact of using e-books on individual performance. Our research makes two contributions: the development of an e-book TTF construct and the testing of that construct in a model validating the efficacy of the TTF framework in measuring perceived fit of e-books to academic tasks.", "paper_title": "Application of the Task-Technology Fit Model to Structure and Evaluate the Adoption of E-Books by Academics", "paper_id": "WOS:000323384600005"}