{"auto_keywords": [{"score": 0.046800023565389516, "phrase": "ranking_scores"}, {"score": 0.015398847403043727, "phrase": "representation_parameter"}, {"score": 0.010612387000973441, "phrase": "database_retrieval"}, {"score": 0.0105296961632612, "phrase": "nearest_neighbor_classification_tasks"}, {"score": 0.010125709049937799, "phrase": "database_objects"}, {"score": 0.007818614754766182, "phrase": "unified_way"}, {"score": 0.004228577663320847, "phrase": "representation_learning"}, {"score": 0.004178935413340453, "phrase": "ranking_score_learning_problems"}, {"score": 0.003817137134650275, "phrase": "inner_relationships"}, {"score": 0.0034185505275141077, "phrase": "unified_framework"}, {"score": 0.0028630535573013686, "phrase": "optimization_results"}, {"score": 0.0028405715222684183, "phrase": "iterative_algorithms"}, {"score": 0.002474447780553576, "phrase": "proposed_algorithms"}, {"score": 0.002224510044064184, "phrase": "proposed_unified_framework"}, {"score": 0.0021983430142660373, "phrase": "state-of-the-art_independent_representation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Database retrieval", " Nearest neighbor classification", " Data representation", " Ranking score learning"], "paper_abstract": "In the database retrieval and nearest neighbor classification tasks, the two basic problems are to represent the query and database objects, and to learn the ranking scores of the database objects to the query. Many studies have been conducted for the representation learning and the ranking score learning problems, however, they are always learned independently from each other. In this paper, we argue that there are some inner relationships between the representation and ranking of database objects, and try to investigate their relationships by learning them in a unified way. To this end, we proposed the Unified framework for Representation and Ranking (UR2) of objects for the database retrieval and nearest neighbor classification tasks. The learning of representation parameter and the ranking scores are modeled within one single unified objective function. The objective function is optimized alternately with regard to representation parameter and the ranking scores. Based on the optimization results, iterative algorithms are developed to learn the representation parameter and the ranking scores on a unified way. Moreover, with two different formulas of representation (feature selection and subspace learning), we give two versions of UR2. The proposed algorithms are tested on two challenging tasks - MRI image based brain tumor retrieval and nearest neighbor classification based protein identification. The experiments show the advantage of the proposed unified framework over the state-of-the-art independent representation and ranking methods. (C) 2014 Published by Elsevier Ltd.", "paper_title": "Unified framework for representing and ranking", "paper_id": "WOS:000334004600017"}