{"auto_keywords": [{"score": 0.04502457019127767, "phrase": "n_points"}, {"score": 0.015724462101618184, "phrase": "np"}, {"score": 0.005558253875394413, "phrase": "rectilinear_hyperplane_cover_problem"}, {"score": 0.004884947756139414, "phrase": "rectilinear_minimum_link_traveling_salesman_problem"}, {"score": 0.004714749768410393, "phrase": "rectilinear_covering_problems"}, {"score": 0.004413148455148519, "phrase": "first_problem"}, {"score": 0.004373537527118041, "phrase": "rectilinear_line_cover"}, {"score": 0.003740568332108757, "phrase": "rectilinear_k-links"}, {"score": 0.0036188642400252873, "phrase": "rd"}, {"score": 0.003438441702164516, "phrase": "piecewise_linear_path"}, {"score": 0.0032279194654906028, "phrase": "second_problem"}, {"score": 0.0030947594580569854, "phrase": "third_problem"}, {"score": 0.002940406485632161, "phrase": "k_axis-parallel_hyperplanes"}, {"score": 0.0022289812518790824, "phrase": "fixed-parameter_tractability"}, {"score": 0.002162844717299508, "phrase": "finite_set"}, {"score": 0.002104998559038937, "phrase": "fpt."}], "paper_keywords": ["Computational Geometry", " Restricted Orientations", " Parameterized Complexity"], "paper_abstract": "This paper discusses three rectilinear (that is, axis-parallel) covering problems in d dimensions and their variants. The first problem is the Rectilinear Line Cover where the inputs are n points in R(d) and a positive integer k, and we are asked to answer if we can cover these n points with at most k lines where these lines are restricted to be axis parallel. We show that this problem has efficient fixed-parameter tractable (FPT) algorithms. The second problem is the Rectilinear k-LINKS SPANNING Path Problem where the inputs are also n points in Rd and a positive integer k but here we are asked to answer if there is a piecewise linear path through these n points having at most k line-segments (links) where these line-segments are axis-parallel. We prove that this second problem is FPT under the assumption that no two line-segments share the same line. The third problem is the Rectilinear HYPERPLANE Cover problem and we are asked to cover a set of n points in d dimensions with k axis-parallel hyperplanes of d-1 dimensions. We also demonstrate this has an FPT-algorithm. Previous to the results above, only conjectures were enunciated over several years on the NP-completeness of the Rectilinear Minimum Link TRAVELING Salesman Problem, the Minimum Link Spanning Path Problem and the Rectilinear HYPERPLANE Cover. We provide the proof that the Rectilinear Minimum Link TRAVELING Salesman Problem and the Rectilinear Minimum Link Spanning Path Problem are NP-complete by a reduction from the One-In-Three 3-SAT problem. The NP-completeness of the Rectilinear HYPERPLANE Cover problem is proved by a reduction from 3-SAT. This suggests dealing with the intractability just discovered with fixed-parameter tractability. Moreover, if we extend our problems to a finite set of orientations, our approach proves these problems remain FPT.", "paper_title": "NP-completeness and FPT Results for Rectilinear Covering Problems", "paper_id": "WOS:000277568600004"}