{"auto_keywords": [{"score": 0.04222565054522196, "phrase": "promethee"}, {"score": 0.00481495049065317, "phrase": "single-layer_perceptron"}, {"score": 0.004634799977448855, "phrase": "bankruptcy_prediction._preference_ranking_organization_methods"}, {"score": 0.004349337717774093, "phrase": "outranking_relation_theory"}, {"score": 0.004186534737631288, "phrase": "multi-criteria_decision_aid"}, {"score": 0.003829877278269543, "phrase": "weighted_average_aggregation"}, {"score": 0.0030071857666598193, "phrase": "single-criterion_preference_indices"}, {"score": 0.002821685815956478, "phrase": "novel_promethee-based_perceptron"}, {"score": 0.0027159094186967247, "phrase": "ordinal_sorting_problems"}, {"score": 0.0026140878612307536, "phrase": "proposed_non-additive_promethee-based_single-layer_perceptron"}, {"score": 0.0022292394795878643, "phrase": "proposed_model"}, {"score": 0.0021319959284827896, "phrase": "additive_preference_indices"}], "paper_keywords": ["Fuzzy integral", " PROMETHEE", " ordinal sorting", " bankruptcy prediction", " outranking relation"], "paper_abstract": "Preference Ranking Organization METHods for Enrichment Evaluations (PROMETHEE), based on outranking relation theory, are used extensively in Multi-Criteria Decision Aid (MCDA). In PROMETHEE, an overall preference index based on weighted average aggregation represents the intensity of preference for one pattern over another pattern and can be measured by a given preference function. Unfortunately, as the criteria making up the patterns are not always independent, the assumption of additivity among single-criterion preference indices may not be reasonable. This paper develops a novel PROMETHEE-based perceptron using nonadditive preference indices for ordinal sorting problems. The applicability of the proposed non-additive PROMETHEE-based single-layer perceptron (SLP) to bankruptcy prediction is examined by using a sample of 53 publicly traded, Taiwanese firms that encountered financial failure between 2000 and 2008. The proposed model performs well compared to PROMETHEE with additive preference indices and other additive PROMETHEE-based classification approaches.", "paper_title": "SINGLE-LAYER PERCEPTRON WITH NON-ADDITIVE PREFERENCE INDICES AND ITS APPLICATION TO BANKRUPTCY PREDICTION", "paper_id": "WOS:000295333500006"}