{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mouclas_patterns"}, {"score": 0.004504969093304219, "phrase": "mining_novel_approach"}, {"score": 0.004238307626560739, "phrase": "quantitative_data"}, {"score": 0.003628352506247126, "phrase": "quantitative_attributes"}, {"score": 0.003509487090932835, "phrase": "association_rule"}, {"score": 0.003319939715683536, "phrase": "well_logging_data"}, {"score": 0.003004103583782076, "phrase": "implicit_relationship"}, {"score": 0.002970914475538276, "phrase": "measured_values"}, {"score": 0.002614534850703364, "phrase": "association_rules"}, {"score": 0.002418829014435841, "phrase": "solid_mathematical_foundation"}, {"score": 0.0023920904611571783, "phrase": "compact_mathematical_description"}, {"score": 0.0021285340816566906, "phrase": "noisy_or_incomplete_data"}, {"score": 0.0021049977753042253, "phrase": "high_dimensional_data_space"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a mining novel approach which consists of two new data mining algorithms for the classification over quantitative data, based on two new pattern called MOUCLAS (MOUntain function based CLASsification) Patterns and Jumping MOUCLAS Patterns. The motivation of the study is to develop two classifiers for quantitative attributes by the concepts of the association rule and the clustering. An illustration of using petroleum well logging data for oil/gas formation identification is presented in the paper. MPs and JMPs are ideally suitable to derive the implicit relationship between measured values (well logging data) and properties to be predicted (oil/gas formation or not). As a hybrid of classification and clustering and association rules mining, our approach have several advantages which are (1) it has a solid mathematical foundation and compact mathematical description of classifiers, (2) it does not require discretization, (3) it is robust when handling noisy or incomplete data in high dimensional data space.", "paper_title": "Mining MOUCLAS patterns and jumping MOUCLAS patterns to construct classifiers", "paper_id": "WOS:000236545100010"}