{"auto_keywords": [{"score": 0.032342749358323236, "phrase": "interpolation_variance"}, {"score": 0.010551607557578491, "phrase": "two-space_genetic_algorithm"}, {"score": 0.00481495049065317, "phrase": "additional_drilling_campaign"}, {"score": 0.004415189385015778, "phrase": "drill_data"}, {"score": 0.004389745162172933, "phrase": "open_pit_mines"}, {"score": 0.004227879333383761, "phrase": "entire_orebody"}, {"score": 0.003933118499284644, "phrase": "block_model"}, {"score": 0.0038654774211631564, "phrase": "serious_risk"}, {"score": 0.003766182463933667, "phrase": "multiple_simulations"}, {"score": 0.0037336520904376687, "phrase": "dispersion_variances"}, {"score": 0.0036482665232275583, "phrase": "technical_uncertainties"}, {"score": 0.003595891416028495, "phrase": "dispersion_variance"}, {"score": 0.0033741997276290356, "phrase": "best_additional_drilling_campaign"}, {"score": 0.0032215751881194328, "phrase": "best_drilling_configuration"}, {"score": 0.003166132209407694, "phrase": "grade_uncertainty"}, {"score": 0.0031478633984287235, "phrase": "budget_constraint"}, {"score": 0.0031296996688485617, "phrase": "uncertainty_measure"}, {"score": 0.0031026497891826726, "phrase": "optimization_process"}, {"score": 0.003022890602492506, "phrase": "data_locations"}, {"score": 0.002936664639276662, "phrase": "minmax_problem"}, {"score": 0.002877769867854964, "phrase": "best_worst-case_performance"}, {"score": 0.0028037753646260937, "phrase": "maximum_interpolation_variance"}, {"score": 0.002771500855119101, "phrase": "optimization_model"}, {"score": 0.0027395968397212053, "phrase": "interpolation_variances"}, {"score": 0.0026156018381676407, "phrase": "standard_optimization_tools"}, {"score": 0.002398001586160856, "phrase": "drill_hole_simulations"}, {"score": 0.002309408211203032, "phrase": "minmax_solution"}, {"score": 0.0022828113789751694, "phrase": "case_study"}, {"score": 0.002141898874982106, "phrase": "new_drilling_campaign"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Drill hole location", " Minmax problem", " Two-space genetic algorithms", " Interpolation variance", " Conditional simulation"], "paper_abstract": "Grade and tonnage are the most important technical uncertainties in mining ventures because of the use of estimations/simulations, which are mostly generated from drill data. Open pit mines are planned and designed on the basis of the blocks representing the entire orebody. Each block has different estimation/simulation variance reflecting uncertainty to some extent. The estimation/simulation realizations are submitted to mine production scheduling process. However, the use of a block model with varying estimation/simulation variances will lead to serious risk in the scheduling. In the medium of multiple simulations, the dispersion variances of blocks can be thought to regard technical uncertainties. However, the dispersion variance cannot handle uncertainty associated with varying estimation/simulation variances of blocks. This paper proposes an approach that generates the configuration of the best additional drilling campaign to generate more homogenous estimation/simulation variances of blocks. In other words, the objective is to find the best drilling configuration in such a way as to minimize grade uncertainty under budget constraint. Uncertainty measure of the optimization process in this paper is interpolation variance, which considers data locations and grades. The problem is expressed as a minmax problem, which focuses on finding the best worst-case performance i.e., minimizing interpolation variance of the block generating maximum interpolation variance. Since the optimization model requires computing the interpolation variances of blocks being simulated/estimated in each iteration, the problem cannot be solved by standard optimization tools. This motivates to use two-space genetic algorithm (GA) approach to solve the problem. The technique has two spaces: feasible drill hole configuration with minimization of interpolation variance and drill hole simulations with maximization of interpolation variance. Two-space interacts to find a minmax solution iteratively. A case study was conducted to demonstrate the performance of approach. The findings showed that the approach could be used to plan a new drilling campaign. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Planning additional drilling campaign using two-space genetic algorithm: A game theoretical approach", "paper_id": "WOS:000315558400013"}