{"auto_keywords": [{"score": 0.0413156078402278, "phrase": "social_play"}, {"score": 0.00481495049065317, "phrase": "away_game"}, {"score": 0.004546755482549647, "phrase": "complex_choreography"}, {"score": 0.004503525064934708, "phrase": "somewhat_stereotypical_behaviors"}, {"score": 0.004334657104697421, "phrase": "particular_body_areas"}, {"score": 0.004192078165260057, "phrase": "specific_conditions"}, {"score": 0.0038834787946979863, "phrase": "prevailing_explanatory_theories"}, {"score": 0.0033806943112103397, "phrase": "central_nervous_system"}, {"score": 0.0029569247903654477, "phrase": "available_options"}, {"score": 0.0024652715040303416, "phrase": "agent-based_model"}, {"score": 0.0022401855403251653, "phrase": "behavioral_programs"}, {"score": 0.0021049977753042253, "phrase": "predictive_capacity"}], "paper_keywords": ["Agent-based model", " social play", " mechanisms of behavior", " perceptual control", " distance regulation", " behavior pattern"], "paper_abstract": "Play fighting in many animals consists of a complex choreography of somewhat stereotypical behaviors involving attack and defense-typically of particular body areas-that are differentially generated under specific conditions. In most domains where behavior is considered, including the study of social play, the prevailing explanatory theories rest on the assumptions that: (1) behavior is the result of \"programs'' that can be strictly or loosely specified, located somewhere in the central nervous system, and (2) the behavior an organism produces in a certain circumstance is the result of a choice between all (or many) of the available options, assumed to be arrived at by considering internally generated predictions about the consequences of actions. To test these assumptions, we used sets of parameters generated by our previous work with rats and crickets to create an agent-based model of a game of \"keep-away.'' We demonstrate that the agents need to possess neither behavioral programs (e.g., fixed or modal action patterns), nor any predictive capacity, in order to reproduce the tactics commonly used when organisms protect an object of interest from conspecifics. The results are presented in terms of the evolution of social play, which can be seen as a variation of the game of keep away.", "paper_title": "Evolving the tactics of play fighting: insights from simulating the \"keep away game'' in rats", "paper_id": "WOS:000366508200006"}