{"auto_keywords": [{"score": 0.049568154654955704, "phrase": "searchable_encryption"}, {"score": 0.03346417924469897, "phrase": "bellare_et_al"}, {"score": 0.0317638439001368, "phrase": "chosen_keyword_attacks"}, {"score": 0.029833584253148103, "phrase": "useful_partial_information"}, {"score": 0.00481495049065317, "phrase": "keyword-recoverability"}, {"score": 0.004662427600500598, "phrase": "e-mail_systems"}, {"score": 0.003969018740062018, "phrase": "specific_keyword"}, {"score": 0.0038431888954930083, "phrase": "efficiently-searchable_encryption_scheme"}, {"score": 0.003342280102112269, "phrase": "previous_searchable_encryption_schemes"}, {"score": 0.003100085797251317, "phrase": "efficiently-search_able_encryption_scheme"}, {"score": 0.0022333012657436307, "phrase": "chosen_ciphertext_attacks"}, {"score": 0.0021975548867457606, "phrase": "stronger_attacks"}, {"score": 0.0021049977753042253, "phrase": "sekr_scheme"}], "paper_keywords": ["keyword search", " keyword-testability", " keyword-recoverability", " data-recoverability", " chosen ciphertext attacks"], "paper_abstract": "Searchable encryption has many applications including e-mail systems and storage systems. The usefulness of searchable encryption derives from its support of keyword-testability. Keyword-testability means that a receiver of a ciphertext can test whether the ciphertext contains a specific keyword. Recently, Bellare et al. suggested an efficiently-searchable encryption scheme with keyword-recoverability as well as keyword-testability. Keyword-recoverability means that a receiver can extract the keyword from a ciphertext. All of the previous searchable encryption schemes have provided only keyword-testability. However, as explained by Bellare et al., no efficiently-search able encryption scheme can provide even security against chosen keyword attacks. That is, Bellare et al.'s scheme assumes that no useful partial information about the keyword is known to the adversaries. In this paper, we suggest an SEKR (searchable encryption with keyword-recoverability) scheme which is secure even if the adversaries have any useful partial information about the keyword. Our scheme provides security against chosen ciphertext attacks which are stronger attacks than chosen keyword attacks. We also suggest an SEKR scheme for multi-keywords.", "paper_title": "Searchable Encryption with Keyword-Recoverability", "paper_id": "WOS:000266425700047"}