{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "requirements_engineering_tools"}, {"score": 0.004684157900507474, "phrase": "system_and_software_developers"}, {"score": 0.004176194589991187, "phrase": "existing_re_tool_lists"}, {"score": 0.004081385289516914, "phrase": "detailed_and_precise_information"}, {"score": 0.003809628721278519, "phrase": "current_re_tools"}, {"score": 0.003459191419478298, "phrase": "state-of-practice_re_tools"}, {"score": 0.0033037970113095577, "phrase": "major_tool_vendors"}, {"score": 0.0031121406603482112, "phrase": "extensive_data"}, {"score": 0.002799810685137358, "phrase": "inter-rater_reliability_analysis"}, {"score": 0.0026616868981501006, "phrase": "descriptive_statistics"}, {"score": 0.0026373136897864763, "phrase": "hierarchical_cluster_analysis"}, {"score": 0.002613163083407071, "phrase": "statistical_hypothesis_testing"}, {"score": 0.0025420267431501367, "phrase": "tool_scores"}, {"score": 0.0024501740852758505, "phrase": "total_of_three_clusters"}, {"score": 0.0023944552329463035, "phrase": "significant_differences"}], "paper_keywords": ["clustering", " requirements engineering", " survey", " tools"], "paper_abstract": "System and software developers are concerned to gain insight into how current requirements engineering (RE) tools support processes. There is an important number of RE tools currently available on the market but, unfortunately, existing RE tool lists do not usually provide detailed and precise information about the tools they catalogue. In this paper, we study and compare current RE tools in the quest to answer the following research question: What level of variation, in terms of functionality, is observable in state-of-practice RE tools? A 188-item survey was designed, aimed at major tool vendors worldwide and based principally on the features covered by the ISO/IEC TR 24766:2009. Extensive data obtained from 29 participants was used to classify and group the RE tools, based on their capabilities. First of all, an inter-rater reliability analysis was performed to ensure the trustworthiness of the data. Descriptive statistics, hierarchical cluster analysis and statistical hypothesis testing were then applied. The tool scores for each candidate were calculated. A total of three clusters were identified. Statistically significant differences in coverage of features among these groups came to light. Our findings can help practitioners to decide which tool is the most suitable among several alternatives, according to their particular needs.", "paper_title": "Commonalities and Differences between Requirements Engineering Tools: A Quantitative Approach", "paper_id": "WOS:000352158200012"}