{"auto_keywords": [{"score": 0.04572946919208604, "phrase": "community_structure"}, {"score": 0.02632116306027395, "phrase": "community_detection"}, {"score": 0.00481495049065317, "phrase": "social_tagging"}, {"score": 0.00452670409375785, "phrase": "social_networks"}, {"score": 0.004483909657713567, "phrase": "complex_systems"}, {"score": 0.004195418010131832, "phrase": "previous_studies"}, {"score": 0.0040969285074699, "phrase": "structural_emergence"}, {"score": 0.0036553070575015344, "phrase": "thematic_and_structural_properties"}, {"score": 0.0032456625605347417, "phrase": "girvan-newman_community_detection_algorithm"}, {"score": 0.0031393948330209224, "phrase": "social_tagging_data"}, {"score": 0.0031096802867895262, "phrase": "delicious"}, {"score": 0.0029935730127943466, "phrase": "active_taggers"}, {"score": 0.002657890175649468, "phrase": "data_analysis"}, {"score": 0.00258307991054107, "phrase": "topical_affiliations"}, {"score": 0.0024397017438101726, "phrase": "inference_mechanism"}, {"score": 0.002337403139264533, "phrase": "ttr-lda-community_model"}, {"score": 0.0022715929119140194, "phrase": "tag_prediction"}, {"score": 0.0021049977753042253, "phrase": "recommender_systems"}], "paper_keywords": [""], "paper_abstract": "The presence of social networks in complex systems has made networks and community structure a focal point of study in many domains. Previous studies have focused on the structural emergence and growth of communities and on the topics displayed within the network. However, few scholars have closely examined the relationship between the thematic and structural properties of networks. Therefore, this article proposes the Tagger Tag Resource-Latent Dirichlet Allocation-Community model (TTR-LDA-Community model), which combines the Latent Dirichlet Allocation (LDA) model with the Girvan-Newman community detection algorithm through an inference mechanism. Using social tagging data from Delicious, this article demonstrates the clustering of active taggers into communities, the topic distributions within communities, and the ranking of taggers, tags, and resources within these communities. The data analysis evaluates patterns in community structure and topical affiliations diachronically. The article evaluates the effectiveness of community detection and the inference mechanism embedded in the model and finds that the TTR-LDA-Community model outperforms other traditional models in tag prediction. This has implications for scholars in domains interested in community detection, profiling, and recommender systems.", "paper_title": "Modeling Topic and Community Structure in Social Tagging: the TTR-LDA-Community Model", "paper_id": "WOS:000294255200016"}