{"auto_keywords": [{"score": 0.03125795476937915, "phrase": "time_series"}, {"score": 0.009454776151700555, "phrase": "artificial_neural_networks"}, {"score": 0.00481495049065317, "phrase": "autonomic_computing_systems"}, {"score": 0.004660634721704355, "phrase": "real-world_systems"}, {"score": 0.004340822341073993, "phrase": "human_interference"}, {"score": 0.004315178999089153, "phrase": "autonomic_computing_self-managing_aspects"}, {"score": 0.0031703706626348507, "phrase": "system_components_behavior"}, {"score": 0.002857719256931572, "phrase": "specific_configurations"}, {"score": 0.002832396300207349, "phrase": "series_properties"}, {"score": 0.0027659570272100835, "phrase": "online_systems"}, {"score": 0.00255298944002721, "phrase": "chaos_theory_tools"}, {"score": 0.002493087803216478, "phrase": "multidimensional_vectors"}, {"score": 0.002384539914036544, "phrase": "rbf"}, {"score": 0.0023704114738284667, "phrase": "rrbf"}, {"score": 0.0023563811066697853, "phrase": "tdnn"}, {"score": 0.0023424328921363585, "phrase": "atnn"}, {"score": 0.0022942608418577313, "phrase": "markov_models"}, {"score": 0.0021555948898187944, "phrase": "experimental_results"}, {"score": 0.0021301464301117833, "phrase": "proposed_approach"}, {"score": 0.0021175348478776846, "phrase": "good_accuracy"}], "paper_keywords": ["Autonomic computing", " Time series", " Analysis", " Chaos theory", " Modeling", " Prediction"], "paper_abstract": "The challenges involved in integrating, maintaining and administrating real-world systems have motivated the proposal of the Autonomic Computing area which aims at making systems capable of self-managing their tasks, avoiding or minimizing the human interference. Autonomic Computing self-managing aspects are provided by the Autonomic Manager which relies on a structure called control loop. This loop is responsible for monitoring components, analyzing information and taking decisions to optimize, configure, heal and protect systems. Among such steps, the analysis is probably the most complex of the loop, due to it needs to model data, infer situations, estimate behavior or states, and make prediction. In order to proceed with the analysis, we need to study how systems produce information over time (here called time series) and, by modeling such information, we can understand system components behavior, transitions, relations to other systems, make estimations and predictions. In that sense, many techniques were designed to model such temporal information or time series, most of them involve statistics and artificial neural networks which require specific configurations based on series properties, what may not be bearable for online systems. All this scenario motivated this paper which proposes an approach to simplify and improve the accuracy of modeling, estimating and predicting time series. This approach considers chaos theory tools to unfold time series and organize them into multidimensional vectors which better represent interdependencies among observations. Techniques (such as artificial neural networks, e.g. RBF, RRBF, TDNN and ATNN, and statistical tools, e.g. Markov Models) can take advantage of such reorganization and, therefore, improve the accuracy of modeling, estimating and predicting. Experimental results confirm that the proposed approach provides good accuracy at very low computational costs.", "paper_title": "Improving the performance and accuracy of time series modeling based on autonomic computing systems", "paper_id": "WOS:000209325500002"}