{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unknown_words"}, {"score": 0.016010159110719895, "phrase": "syntax-based_model"}, {"score": 0.006095512714811042, "phrase": "syntactic_properties"}, {"score": 0.005814758619224364, "phrase": "words_models"}, {"score": 0.004766487181100495, "phrase": "recent_studies"}, {"score": 0.004671012181488876, "phrase": "syntax-based_semantic_space_models"}, {"score": 0.004670715990237884, "phrase": "dutch"}, {"score": 0.00430777589162606, "phrase": "syntax-based_models"}, {"score": 0.00413684709497912, "phrase": "computational_grammar"}, {"score": 0.00413657725710166, "phrase": "bag-of-words_approach"}, {"score": 0.004026664041845776, "phrase": "contain_words"}, {"score": 0.0029414903557512663, "phrase": "alpino_parser"}, {"score": 0.002815093247670994, "phrase": "unknown_word"}, {"score": 0.0027492917990724467, "phrase": "cornetto"}, {"score": 0.002426137929553722, "phrase": "appropriate_lexical_acquisition_method"}, {"score": 0.0022145052062614514, "phrase": "bag-of-words_model"}, {"score": 0.0021192805640815817, "phrase": "lexical_acquisition"}, {"score": 0.0021049977753042253, "phrase": "syntax-based_semantic_models"}], "paper_keywords": [""], "paper_abstract": "In recent studies it has been shown that syntax-based semantic space models outperform models in which the context is represented as a bag-of-words in several semantic analysis tasks. This has been generally attributed to the fact that syntax-based models employ corpora that are syntactically annotated by a parser and a computational grammar. However, if the corpora processed contain words which are unknown to the parser and the grammar, a syntax-based model may lose its advantage since the syntactic properties of such words are unavailable. On the other hand, bag-of-words models do not face this issue since they operate on raw, non-annotated corpora and are thus more robust. In this paper, we compare the performance of syntax-based and bag-of-words models when applied to the task of learning the semantics of unknown words. In our experiments, unknown words are considered the words which are not known to the Alpino parser and grammar of Dutch. In our study, the semantics of an unknown word is defined by finding its most similar word in CORNETTO, a Dutch lexico-semantic hierarchy. We show that for unknown words the syntax-based model performs worse than the bag-of-words approach. Furthermore, we show that if we first learn the syntactic properties of unknown words by an appropriate lexical acquisition method, then in fact the syntax-based model does outperform the bag-of-words approach. The conclusion we draw is that, for words unknown to a given grammar, a bag-of-words model is more robust than a syntax-based model. However, the combination of lexical acquisition and syntax-based semantic models is best suited for learning the semantics of unknown words.", "paper_title": "Lexical acquisition and semantic space models: Learning the semantics of unknown words", "paper_id": "WOS:000340772500004"}