{"auto_keywords": [{"score": 0.044191170565718675, "phrase": "hcv_infection"}, {"score": 0.03510902830705974, "phrase": "proposed_method"}, {"score": 0.014783688515847533, "phrase": "multi-agent_simulation"}, {"score": 0.013200958215582925, "phrase": "differential_equations"}, {"score": 0.00481495049065317, "phrase": "hepatitis_c_virus_infection"}, {"score": 0.004569819304126685, "phrase": "hepatitis_c_virus"}, {"score": 0.004184010117063648, "phrase": "multi-agent_system"}, {"score": 0.003635444740897197, "phrase": "inverted_simulation_flow"}, {"score": 0.003611751858608048, "phrase": "genetic_algorithm"}, {"score": 0.0033720784894045544, "phrase": "differential_equation"}, {"score": 0.003263586288720322, "phrase": "important_advantages"}, {"score": 0.0029975152932436144, "phrase": "simulation_framework"}, {"score": 0.002958546790146313, "phrase": "proposed_approach"}, {"score": 0.0027440826979105533, "phrase": "objective_function"}, {"score": 0.0026470650216161577, "phrase": "maximal_differences"}, {"score": 0.0025368092524479615, "phrase": "already_known_models"}, {"score": 0.002407378648209689, "phrase": "hepatocytes_number"}, {"score": 0.0022995431219125536, "phrase": "currently_used_model_types"}, {"score": 0.0022182072857447684, "phrase": "almost_no_modifications"}, {"score": 0.0021467594103960585, "phrase": "viral_infections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent systems", " Multi-agent simulation", " Differential equations", " Genetic algorithm", " HCV infection"], "paper_abstract": "Objectives: The objective of this study is to design a method for modeling hepatitis C virus (HCV) infection using multi-agent simulation and to verify it in practice. Methods and materials: In this paper, first, the modeling of HCV infection using a multi-agent system is compared with the most commonly used model type, which is based on differential equations. Then, the implementation and results of the model using a multi-agent simulation is presented. To find the values of the parameters used in the model, a method using inverted simulation flow and genetic algorithm is proposed. All of the data regarding HCV infection are taken from the paper describing the model based on the differential equation to which the proposed method is compared. Results: Important advantages of the proposed method are noted and demonstrated: these include flexibility, clarity, re-usability and the possibility to model more complex dependencies. Then, the simulation framework that uses the proposed approach is successfully implemented in C++and is verified by comparing it to the approach based on differential equations. The verification proves that an objective function that performs the best is the function that minimizes the maximal differences in the data. Finally, an analysis of one of the already known models is performed, and it is proved that it incorrectly models a decay in the hepatocytes number by 40%. Conclusions: The proposed method has many advantages in comparison to the currently used model types and can be used successfully for analyzing HCV infection. With almost no modifications, it can also be used for other types of viral infections. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Multi-agent model of hepatitis C virus infection", "paper_id": "WOS:000332056000006"}