{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ring_star_problem"}, {"score": 0.0045879792359519375, "phrase": "combinatorial_optimization_problem"}, {"score": 0.00441883624011048, "phrase": "telecommunications_network"}, {"score": 0.004011867299107537, "phrase": "simple_cycle"}, {"score": 0.003066945490483524, "phrase": "new_hybrid_metaheuristic_approach"}, {"score": 0.002937879003671346, "phrase": "hybrid_metaheuristic"}, {"score": 0.002859977408815691, "phrase": "general_variable_neighborhood_search"}, {"score": 0.002652639568848117, "phrase": "greedy_randomized_adaptive_search_procedure"}, {"score": 0.0025409639091476363, "phrase": "extensive_computational_experiments"}, {"score": 0.002473560912156024, "phrase": "classical_tsp_library"}, {"score": 0.0021975548867457606, "phrase": "proposed_hybrid_metaheuristic"}], "paper_keywords": ["ring star problem", " network design", " GRASP", " VNS", " heuristics"], "paper_abstract": "In this paper, we consider a combinatorial optimization problem that arises in the design of telecommunications network. It is known as the Ring Star Problem. In this problem the aim is to locate a simple cycle through a subset of vertices of a graph with the objective of minimizing the sum of two costs: a routing cost proportional to the length of the cycle, and an assignment cost from the vertices not in the cycle to their closest vertex on the cycle. We propose a new hybrid metaheuristic approach to solve the Ring Star Problem. In the hybrid metaheuristic, we use a General Variable Neighborhood Search (GVNS) to improve the quality of the solution obtained with a Greedy Randomized Adaptive Search Procedure (GRASP). A set of extensive computational experiments on instances from the classical TSP library and randomly generated are reported, comparing the GRASP/GVNS heuristic with other heuristic found in the literature. These results indicate that the proposed hybrid metaheuristic is highly efficient and superior to the other available method proposed for the Ring Star Problem.", "paper_title": "An efficient heuristic for the ring star problem", "paper_id": "WOS:000238121700003"}