{"auto_keywords": [{"score": 0.044869792207088706, "phrase": "g-protein"}, {"score": 0.00481495049065317, "phrase": "molecular_dynamics_simulation"}, {"score": 0.004536029676655286, "phrase": "potential_new_target"}, {"score": 0.004494570360108983, "phrase": "psychiatric_conditions"}, {"score": 0.004332471656145115, "phrase": "assessed_concept"}, {"score": 0.0038271712887391015, "phrase": "medicinal_chemists"}, {"score": 0.0037921662574137535, "phrase": "potentially_relevant_novel_molecular_targets"}, {"score": 0.0037060428445111694, "phrase": "therapeutic_conditions"}, {"score": 0.0030695103543472908, "phrase": "explicit_phospholipidic_bilayer"}, {"score": 0.003027462227648001, "phrase": "water_molecules"}, {"score": 0.0029722900280316216, "phrase": "separate_experiment"}, {"score": 0.002427732996314194, "phrase": "binding_pocket"}, {"score": 0.002329258721870127, "phrase": "first_molecular_explanation"}, {"score": 0.002297327670408112, "phrase": "reported_allosteric_effect"}, {"score": 0.0021342613107011624, "phrase": "silico_screening"}, {"score": 0.0021049977753042253, "phrase": "monomeric_protomers"}], "paper_keywords": [""], "paper_abstract": "Homo- and heterodimerization is becoming an assessed concept in G-protein coupled receptor (GPCR) pharmacology, and the notion that GPCRs may dimerize or oligomerize is allowing for a reinterpretation of some inconsistencies or anomalies and is providing medicinal chemists with potentially relevant novel molecular targets for a variety of therapeutic conditions. Recently, it has been reported that two unrelated GPCRs, namely class C metabotropic glutamate receptor type-2 (mGluR2) and class A 5HT(2A) serotoninergic receptor, can heterodimerize at the transmembrane domain level. We performed a 40 ns molecular dynamics simulation of the mGluR2/5HT(2A) heterocomplex constructed around a TM4/TM5 interface and embedded in an explicit phospholipidic bilayer surrounded by water molecules. In a separate experiment, the monomeric 5HT(2A) receptor was simulated for additional 40 ns under the same conditions. The analysis and the comparison of the two simulations allowed us to clearly identify a cross-talk between the two protomers and to put forward an effect of the heterodimerization on the shape of the binding pocket of 5HT(2A). This result provides the first molecular explanation for the reported allosteric effect of mGluR2 on 5HT(2A)-mediated response and suggests that the heterocomplex can be a more suitable target for in silico screening than the monomeric protomers.", "paper_title": "Molecular Dynamics Simulation of the Heterodimeric mGluR2/5HT(2A) Complex. An Atomistic Resolution Study of a Potential New Target in Psychiatric Conditions", "paper_id": "WOS:000267394300026"}