{"auto_keywords": [{"score": 0.03390453824013106, "phrase": "hypervideo_content"}, {"score": 0.00481495049065317, "phrase": "hypervideo_presentation"}, {"score": 0.0047761092701293474, "phrase": "digital_systems_teaching"}, {"score": 0.0046993598473345395, "phrase": "hypervideos"}, {"score": 0.004661446705304497, "phrase": "multimedia_files"}, {"score": 0.004567990533989851, "phrase": "traditional_video_files"}, {"score": 0.003791141540467091, "phrase": "original_video_presentation"}, {"score": 0.0035530197642369464, "phrase": "hypermedia_e-learning_tool"}, {"score": 0.003398015125667192, "phrase": "hypervideo_model"}, {"score": 0.0027854565462509095, "phrase": "engineering_class"}, {"score": 0.0027295084882654917, "phrase": "interactive_experiment"}, {"score": 0.0026638482306228575, "phrase": "digital_systems_course"}, {"score": 0.0024264193359373977, "phrase": "second_group"}, {"score": 0.00233936726307301, "phrase": "conventional_learning"}, {"score": 0.002246292543825748, "phrase": "students'_learning_results"}, {"score": 0.0021049977753042253, "phrase": "comparison_group"}], "paper_keywords": ["Hypervideo", " e-Learning", " Multimedia service", " Navigation", " SMIL"], "paper_abstract": "Hypervideos are multimedia files, which differ from traditional video files in that they can be navigated by using links that are embedded in them. Students can therefore easily access content that explains and clarifies certain points of the lectures that are difficult to understand, while at the same time not interrupting the flow of the original video presentation. In this paper we report on the design, development and evaluation of a hypermedia e-Learning tool for university students. First, the structure of the hypervideo model is presented; once the structure is known, the process of creating hypervideo content is described in detail, as are the various ways in which content can be linked together. Finally, an evaluation is presented, which has been carried out in the context of an engineering class by use of an interactive experiment, involving N=88 students from a digital systems course. In this study the students were randomly assigned to two groups; one group participated in the course as usual, whilst the second group participated in the same course while also combining the conventional learning with the hypervideo content developed for the course. The students' learning results showed that the students who had access to the hypervideo content performed significantly better than the comparison group.", "paper_title": "Modeling, design, development and evaluation of a hypervideo presentation for digital systems teaching and learning", "paper_id": "WOS:000302484500009"}