{"auto_keywords": [{"score": 0.04569647441539398, "phrase": "mechanical_equipment"}, {"score": 0.01011700355735819, "phrase": "smfd"}, {"score": 0.0077406779792172226, "phrase": "china"}, {"score": 0.004766683200410046, "phrase": "wireless_sensor_networks"}, {"score": 0.004555371402128666, "phrase": "state_monitoring"}, {"score": 0.004309725894724034, "phrase": "new_signal_collection"}, {"score": 0.004266501496765747, "phrase": "transmission_technology"}, {"score": 0.0038186039088445524, "phrase": "conventional_wired_monitoring"}, {"score": 0.0033492947290751996, "phrase": "comprehensive_references"}, {"score": 0.002907992115184249, "phrase": "fault_detection"}, {"score": 0.00277884787077003, "phrase": "development_process"}, {"score": 0.0026023381988430666, "phrase": "recent_wsns_applications"}, {"score": 0.0023523750536537102, "phrase": "monitored_parameters"}, {"score": 0.0023287359930308864, "phrase": "monitored_objects"}, {"score": 0.002282166507956957, "phrase": "fusion_methods"}, {"score": 0.0022252591643049744, "phrase": "potential_future_research_directions"}, {"score": 0.0021479597698614373, "phrase": "effective_technology"}, {"score": 0.0021049977753042253, "phrase": "current_bottleneck"}], "paper_keywords": [""], "paper_abstract": "Wireless sensor networks (WSNs) have been used in the state monitoring and fault diagnosis (SMFD) of mechanical equipment as a new signal collection and transmission technology, which have attracted a lot of attention recently. By applying the WSNs to the SMFD, many problems existing in conventional wired monitoring are solved. This paper attempts to summarize and review the recent researches and developments of the SMFD in mechanical equipment based on WSNs, providing comprehensive references for researchers concerned about this topic and helping them identify further research topics. Firstly, constraints in the conventional wired monitoring and the superiority of using WSNs in fault detection and diagnosis of mechanical equipment are illustrated. The development process of the SMFD in mechanical equipment is briefly introduced. Then, the recent WSNs applications to the SMFD of mechanical equipment in China are reviewed and summarized in terms of the classifications, such as monitored parameters, monitored objects, and data fusion methods. Finally, the potential future research directions are identified. WSNs are the effective technology to overcome the current bottleneck of the application in the SMFD of mechanical equipment.", "paper_title": "WSNs-Based Mechanical Equipment State Monitoring and Fault Diagnosis in China", "paper_id": "WOS:000365211600001"}