{"auto_keywords": [{"score": 0.049233068058238634, "phrase": "virtual_learning_communities"}, {"score": 0.010612387000973441, "phrase": "technological_isolation"}, {"score": 0.0046739596755881185, "phrase": "educational_institutions"}, {"score": 0.004404188306112211, "phrase": "online_academic_activities"}, {"score": 0.003933609372601274, "phrase": "learning_resources"}, {"score": 0.0034305205403707567, "phrase": "expertise"}, {"score": 0.0028865314258560214, "phrase": "community_members"}, {"score": 0.002655616553414394, "phrase": "conceptual_framework"}, {"score": 0.0025169965861573185, "phrase": "useful_design_requirements"}, {"score": 0.002472412920623605, "phrase": "learning_services"}, {"score": 0.002142970278347126, "phrase": "alternative_solution"}, {"score": 0.0021049977753042253, "phrase": "current_problems"}], "paper_keywords": ["E-learning", " Grid", " Learning communities", " Learning resources"], "paper_abstract": "Educational institutions may form virtual learning communities by cooperating with others to develop online academic activities. In the cloud, communities make up a grid of expertise, which is built with the learning resources that each organization shares with other pairs. Currently little is known about the problems that prevent the formation of the grid of Expertise in Virtual Learning Communities. Such techniques are not being implemented optimally and efficiently. In this paper we present a description of these problems. This work is important for community members (directors, teachers, researchers and practitioners) because it offers a conceptual framework that helps understand these scenarios and can provide useful design requirements when generating learning services for the community. We also propose an experience implemented at the University of Cartagena (Colombia) in which virtual learning communities have been integrated obtaining an alternative solution to the current problems. We believe that the result of this experience could solve the technological isolation to build communities efficiently and optimally.", "paper_title": "Solving technological isolation to build virtual learning communities", "paper_id": "WOS:000360564600018"}