{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-channel_stimulation_implants"}, {"score": 0.004471530397729526, "phrase": "single-fault_failure"}, {"score": 0.004178198896815672, "phrase": "stimulation_electrodes"}, {"score": 0.00405127920820053, "phrase": "direct_current_flow"}, {"score": 0.0039040344230094164, "phrase": "fault_conditions"}, {"score": 0.0036703791815812328, "phrase": "multiplexed_multi-channel_stimulators"}, {"score": 0.0034935290662899488, "phrase": "test_bench"}, {"score": 0.0033457659530207306, "phrase": "saline_bath"}, {"score": 0.0032240802202623316, "phrase": "direct_current"}, {"score": 0.0029570303644956128, "phrase": "stimulation_pulses"}, {"score": 0.0028848643090508205, "phrase": "particular_condition"}, {"score": 0.0021049977753042253, "phrase": "possible_additional_methods"}], "paper_keywords": ["Blocking capacitor", " Electric stimulation", " Fault current", " Device safety", " Tissue damage", " Electrodes"], "paper_abstract": "One reason given for placing capacitors in series with stimulation electrodes is that they prevent direct current flow and therefore tissue damage under fault conditions. We show that this is not true for multiplexed multi-channel stimulators with one capacitor per channel. A test bench of two stimulation channels, two stimulation tripoles and a saline bath was used to measure the direct current flowing through the electrodes under two different single fault conditions. The electrodes were passively discharged between stimulation pulses. For the particular condition used (16 mA, 1 ms stimulation pulse at 20 Hz with electrodes placed 5 cm apart), the current ranged from 38 to 326 mu A depending on the type of fault. The variation of the fault current with time, stimulation amplitude, stimulation frequency and distance between the electrodes is given. Possible additional methods to improve safety are discussed.", "paper_title": "Safety of multi-channel stimulation implants: a single blocking capacitor per channel is not sufficient after single-fault failure", "paper_id": "WOS:000302264300009"}