{"auto_keywords": [{"score": 0.04643797115779767, "phrase": "human_thought"}, {"score": 0.024949059569851734, "phrase": "sca"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_recent_scientific_observation"}, {"score": 0.004532988904965752, "phrase": "fallacious_arguments"}, {"score": 0.004388035083357706, "phrase": "species-unique_ability"}, {"score": 0.00432733352307636, "phrase": "observable_characteristics"}, {"score": 0.00428733103049275, "phrase": "purely_conceptual_entities"}, {"score": 0.004228016636379321, "phrase": "beautiful_poetry"}, {"score": 0.004036141321779216, "phrase": "\"semantic_intertwine"}, {"score": 0.0031113369425402287, "phrase": "mathematically_related_semantic_intertwine"}, {"score": 0.002488851299416018, "phrase": "ambiguous_intra-category_use"}, {"score": 0.0023646866829474798, "phrase": "semantic_category_analysis"}, {"score": 0.002267708463966758, "phrase": "semantic_categories"}, {"score": 0.0021049977753042253, "phrase": "erroneous_reasoning"}], "paper_keywords": ["Cognition", " Mathematical modelling"], "paper_abstract": "Purpose - The recent scientific observation that human information processing involves four independent data types, has pinpointed a source of fallacious arguments within many domains of human thought. The species-unique ability to assign observable characteristics to purely conceptual entities has created beautiful poetry and literature. However, this ability to generate \"Semantic Intertwine\" has also created the most incomprehensible paradoxes and conundrums. The paper aims to discuss these issues. Design/methodology/approach - Semantic Intertwine can be created between, or within, Semantic Categories; and in either case it then lies at the heart of fallacious, yet often very persuasive, reasoning. Findings - This paper describes how to detect mathematically related Semantic Intertwine in erroneous arguments involving: operands (VIII), mathematical induction (VIIA), orthogonal axiom sets (VIIB), continuous functions (VIIA), exclusive disjunction (VIIA), propositional calculus (VI) and the hitherto thorny problems arising from ambiguous intra-category use of \"infinity\" (VIIB). Originality/value - The applications of Semantic Category Analysis (SCA) are manifold. Determine the Semantic Categories involved in an argument and their modes of combination, and any Semantic Intertwine revealed pinpoints erroneous reasoning. SCA can be applied to any domain of human thought.", "paper_title": "Semantic Category theory and Semantic Intertwine: the anathema of mathematics", "paper_id": "WOS:000343399700006"}