{"auto_keywords": [{"score": 0.04962656673317322, "phrase": "global_transition_model"}, {"score": 0.04678178460605593, "phrase": "particle_filter"}, {"score": 0.010612387000973441, "phrase": "spline_resampling"}, {"score": 0.009610400862675512, "phrase": "sample_impoverishment"}, {"score": 0.004399525320473839, "phrase": "high_accuracy"}, {"score": 0.004175533280178052, "phrase": "linear_transformation"}, {"score": 0.003944112858235306, "phrase": "filtering_accuracy"}, {"score": 0.0036553070575015344, "phrase": "spread_transformation"}, {"score": 0.003485605409687907, "phrase": "spline_transformation"}, {"score": 0.0033395980635636644, "phrase": "highly_accurate_particle_filtering"}, {"score": 0.003199687131875466, "phrase": "point_spread_transformation"}, {"score": 0.002570817338292482, "phrase": "background_variation"}, {"score": 0.002522344964242888, "phrase": "camera_motion"}, {"score": 0.0024513404432665153, "phrase": "real_object_position"}, {"score": 0.0022608057001451414, "phrase": "object-tracking_scenario"}, {"score": 0.0021049977753042253, "phrase": "promising_discriminative_capability"}], "paper_keywords": [""], "paper_abstract": "The authors introduce the concept of a spline resampling in the particle filter to deal with high accuracy and sample impoverishment. The resampling is usually based on a linear transformation on the weights of the particles, so it affects the filtering accuracy. The spline resampling consists of two parts: the spline transformation of weights and the spread transformation of states. The former is based on a spline transformation on the weights of the particles to obtain highly accurate particle filtering, and the latter is based on a point spread transformation on states of particles to prevent sample impoverishment due to a decline in the diversity of hypothesis after resampling. Two transformations are sequentially implemented to incorporate with each other. Then, the authors propose a global transition model in the particle filter, which takes account of the background variation caused by the camera motion, to decrease error from real object position. The authors test the performance of their spline resampling and the global transition model in the particle filter in an object-tracking scenario. Experimental results demonstrate that the particle filter with the spline resampling and the global transition model has promising discriminative capability in comparison with others.", "paper_title": "Particle filter with spline resampling and global transition model", "paper_id": "WOS:000352323900003"}