{"auto_keywords": [{"score": 0.049387234800605376, "phrase": "predicate_dispatch"}, {"score": 0.00918857378658678, "phrase": "prior_languages"}, {"score": 0.005317364308534669, "phrase": "jpred"}, {"score": 0.004914785991838072, "phrase": "practical_utility"}, {"score": 0.00481495049065317, "phrase": "modular_predicate_dispatch"}, {"score": 0.004396120480895021, "phrase": "method_implementation"}, {"score": 0.004348363291608004, "phrase": "predicate_guard"}, {"score": 0.0041473140210277724, "phrase": "logical_implication"}, {"score": 0.00407247625105503, "phrase": "method_overriding_relation"}, {"score": 0.003941141575848601, "phrase": "dynamic_dispatch"}, {"score": 0.003898307690037192, "phrase": "traditional_oo_dispatch"}, {"score": 0.003870009704443373, "phrase": "multimethod_dispatch"}, {"score": 0.0038279459368975965, "phrase": "functional-style_pattern_matching"}, {"score": 0.003611179715045633, "phrase": "language_feature"}, {"score": 0.003456694897064123, "phrase": "java"}, {"score": 0.003132693064568434, "phrase": "traditional_oo_language"}, {"score": 0.0030315735229977927, "phrase": "whole_program"}, {"score": 0.0029123920023263446, "phrase": "java's_modular_typechecking"}, {"score": 0.0027978827655799495, "phrase": "special-purpose_algorithms"}, {"score": 0.0024625698287060586, "phrase": "jpred_language"}, {"score": 0.002391739069644444, "phrase": "featherweight_java"}], "paper_keywords": ["Design", " Languages", " Predicate dispatch", " dynamic dispatch", " modular typechecking"], "paper_abstract": "Predicate dispatch is an object-oriented (OO) language mechanism for determining the method implementation to be invoked upon a message send. With predicate dispatch, each method implementation includes a predicate guard specifying the conditions under which the method should be invoked, and logical implication of predicates determines the method overriding relation. Predicate dispatch naturally unifies and generalizes several common forms of dynamic dispatch, including traditional OO dispatch, multimethod dispatch, and functional-style pattern matching. Unfortunately, prior languages supporting predicate dispatch have had several deficiencies that limit the practical utility of this language feature. We describe JPred, a backward-compatible extension to Java supporting predicate dispatch. While prior languages with predicate dispatch have been extensions to toy or nonmainstream languages, we show how predicate dispatch can be naturally added to a traditional OO language. While prior languages with predicate dispatch have required the whole program to be available for typechecking and compilation, JPred retains Java's modular typechecking and compilation strategies. While prior languages with predicate dispatch have included special-purpose algorithms for reasoning about predicates, JPred employs general-purpose, off-the-shelf decision procedures. As a result, JPred's type system is more flexible, allowing several useful programming idioms that are spuriously rejected by those other languages. After describing the JPred language informally, we present an extension to Featherweight Java that formalizes the language and its modular type system, which we have proven sound. Finally, we discuss two case studies that illustrate the practical utility of JPred, including its use in the detection of several errors.", "paper_title": "Expressive and Modular Predicate Dispatch for Java", "paper_id": "WOS:000264239400003"}