{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stable_marriage_procedures"}, {"score": 0.007625228458037102, "phrase": "np"}, {"score": 0.005792838037115811, "phrase": "gale-shapley_algorithm"}, {"score": 0.004743164872278112, "phrase": "stable_marriage_problem"}, {"score": 0.004672444473700524, "phrase": "well-known_problem"}, {"score": 0.004333111882908801, "phrase": "voting_rules"}, {"score": 0.004081385289516914, "phrase": "wide_variety"}, {"score": 0.004040688646993609, "phrase": "practical_applications"}, {"score": 0.003940706575253453, "phrase": "resident_doctors"}, {"score": 0.003729335910488339, "phrase": "well-known_algorithm"}, {"score": 0.003511613254403125, "phrase": "quadratic_time"}, {"score": 0.0027741761880779535, "phrase": "voting_theory"}, {"score": 0.0022925280840585135, "phrase": "gale-shapley"}, {"score": 0.0021049977753042253, "phrase": "stable_marriage_procedure_gender"}], "paper_keywords": ["Computational social choice", " Stable marriage problems", " Manipulation", " Voting theory"], "paper_abstract": "The stable marriage problem is a well-known problem of matching men to women so that no man and woman who are not married to each other both prefer each other. Such a problem has a wide variety of practical applications, ranging from matching resident doctors, to hospitals to matching students to schools. A well-known algorithm to solve this problem is the Gale-Shapley algorithm, which runs in quadratic time in the number of men/women. It has been proven that stable marriage procedures can always be manipulated. Whilst the Gale-Shapley algorithm is computationally easy to manipulate, we prove that there exist stable marriage procedures which are NP-hard to manipulate. We also consider the relationship between voting theory and stable marriage procedures, showing that voting rules which are NP-hard to manipulate can be used to define stable marriage procedures which are themselves NP-hard to manipulate. Finally, we consider the issue that stable marriage procedures like Gale-Shapley favour one gender over the other, and we show how to use voting rules to make any stable marriage procedure gender neutral.", "paper_title": "Manipulation complexity and gender neutrality in stable marriage procedures", "paper_id": "WOS:000285998200009"}