{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "empirical_results"}, {"score": 0.0046875099587735825, "phrase": "scientific_theories"}, {"score": 0.004539005582217305, "phrase": "overwhelming_complexity"}, {"score": 0.004301834610818624, "phrase": "hidden_variables"}, {"score": 0.0034148795808317555, "phrase": "tentative_models"}, {"score": 0.003100085797251317, "phrase": "global_picture"}, {"score": 0.0029221312451219203, "phrase": "fundamental_structure"}, {"score": 0.0022696277881969896, "phrase": "mathematical_tooling"}, {"score": 0.0022333012657436307, "phrase": "mathematical_theory"}, {"score": 0.0021507795710951384, "phrase": "valid_foundational_framework"}, {"score": 0.002127765807039172, "phrase": "theoretical_modeling"}, {"score": 0.0021049977753042253, "phrase": "brain_sciences"}], "paper_keywords": [""], "paper_abstract": "It goes without saying that in science, experiments are essential; hypothesis need to be contrasted against empirical results in order to build scientific theories. In a system of overwhelming complexity like the brain, it is very likely that hidden variables, unknown by the experimentalist, are interacting with those few elements of which the values are expected and can be validated or rejected in the laboratory. Thus, at the end of the day, the experimentalist is refuting or validating tentative models that are somehow prisoners of the lack of knowledge about the structure of the system. The global picture being missing, a key is to look for the fundamental structure which must be found not in the objects, but in the relationships between the objects-their morphisms. How components at the same level interact (the objects here being neurons) and how superior levels constrain those levels below and emerge from those above is tackled here with a mathematical tooling. The mathematical theory of categories is proposed as a valid foundational framework for theoretical modeling in brain sciences.", "paper_title": "Hippocampal Categories: A Mathematical Foundation for Navigation and Memory", "paper_id": "WOS:000293603200013"}