{"auto_keywords": [{"score": 0.04938622488322166, "phrase": "service_system"}, {"score": 0.007152368807539886, "phrase": "unified_definition"}, {"score": 0.004815860045424549, "phrase": "service_systems"}, {"score": 0.004284755353695709, "phrase": "research_effort"}, {"score": 0.004121275290411653, "phrase": "diverse_definitions"}, {"score": 0.0037669870384994257, "phrase": "new_definition"}, {"score": 0.002751751956416832, "phrase": "human's_status"}, {"score": 0.002608218347502229, "phrase": "human's_request"}, {"score": 0.002389276641014013, "phrase": "manufacturing_system"}, {"score": 0.002366110899738696, "phrase": "agricultural_system"}, {"score": 0.002331781764406665, "phrase": "product_system"}, {"score": 0.0021049977753042253, "phrase": "knowledge_management"}], "paper_keywords": ["Function-behavior-structure", " network", " service system"], "paper_abstract": "In this paper, a unified definition of the service system is proposed. The motivation of this research effort is based on our observation that there are diverse definitions or descriptions of the service system in the literature and they have not provided an identity of the service system. Our goal to define the service system is thus to establish its identity. The most salient feature in our definition is the introduction of three subsystems in a service system: infrastructure, substance, and management. The substance flows over the infrastructure under the constraints of management. A service is established at the moment when the substance interacts with the human to cause a change in the human's status or state under a protocol, which further meets the human's request and need. With this new definition, a service system can be distinguished from other systems, such as manufacturing system, agricultural system, and product system. The new definition will be useful to classification of various service systems and various theories for service systems, which is the key to knowledge management for service systems and to optimization of design and management of service systems.", "paper_title": "On a Unified Definition of the Service System: What is its Identity?", "paper_id": "WOS:000341567800015"}