{"auto_keywords": [{"score": 0.03389774710214817, "phrase": "personal_best_experiences"}, {"score": 0.0048149905375886514, "phrase": "heterogeneous"}, {"score": 0.004640808212832262, "phrase": "enhanced_exploration"}, {"score": 0.004449452743965974, "phrase": "comprehensive_learning_particle_swarm_optimization_algorithm"}, {"score": 0.0042212686864468805, "phrase": "heterogeneous_comprehensive_learning_particle_swarm_optimization"}, {"score": 0.004155113657645735, "phrase": "hclpso"}, {"score": 0.00398370478688858, "phrase": "swarm_population"}, {"score": 0.0036043137580229873, "phrase": "comprehensive_learning"}, {"score": 0.0029346624184926305, "phrase": "entire_swarm_population"}, {"score": 0.0024144659350277954, "phrase": "heterogeneous_comprehensive_learning_particle_swarm_optimization_algorithm"}, {"score": 0.002326938965568362, "phrase": "benchmark_problems"}, {"score": 0.0021957487795963666, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Comprehensive learning (CL)", " Exploration", " Exploitation", " Particle swarm optimization (PSO)", " Heterogeneous"], "paper_abstract": "This paper presents a comprehensive learning particle swarm optimization algorithm with enhanced exploration and exploitation, named as \"heterogeneous comprehensive learning particle swarm optimization\" (HCLPSO). In this algorithm, the swarm population is divided into two subpopulations. Each subpopulation is assigned to focus solely on either exploration or exploitation. Comprehensive learning (CL) strategy is used to generate the exemplars for both subpopulations. In the exploration-subpopulation, the exemplars are generated by using personal best experiences of the particles in the exploration-subpopulation itself. In the exploitation-subpopulation, the personal best experiences of the entire swarm population are used to generate the exemplars. As the exploration-subpopulation does not learn from any particles in the exploitation-subpopulation, the diversity in the exploration-subpopulation can be retained even if the exploitation-subpopulation converges prematurely. The heterogeneous comprehensive learning particle swarm optimization algorithm is tested on shifted and rotated benchmark problems and compared with other recent particle swarm optimization algorithms to demonstrate superior performance of the proposed algorithm over other particle swarm optimization variants. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Heterogeneous comprehensive learning particle swarm optimization with enhanced exploration and exploitation", "paper_id": "WOS:000360416900002"}