{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "active_appearance_models"}, {"score": 0.04954397446159369, "phrase": "augmented_reality"}, {"score": 0.04058108573680189, "phrase": "real-time_ar_applications"}, {"score": 0.004400804926266097, "phrase": "video_objects"}, {"score": 0.004044822781630218, "phrase": "challenging_task"}, {"score": 0.00397714507836836, "phrase": "non-rigid_shape"}, {"score": 0.003738502710504415, "phrase": "novel_two-stage_scheme"}, {"score": 0.0036966717141736355, "phrase": "online_non-rigid_shape_recovery"}, {"score": 0.003378385493203297, "phrase": "aams_offline"}, {"score": 0.003035711716881469, "phrase": "efficient_online_algorithm"}, {"score": 0.002918394200972564, "phrase": "non-rigid_shape_parameters"}, {"score": 0.0027898428590137515, "phrase": "point_correspondences"}, {"score": 0.0027123819773059127, "phrase": "manual_intervention"}, {"score": 0.00257831812581194, "phrase": "real-time_video_sequences"}, {"score": 0.0024234059612683032, "phrase": "ar_registrations"}, {"score": 0.0023560952790080943, "phrase": "facial_feature"}, {"score": 0.0021288561076024844, "phrase": "promising_experimental_results"}], "paper_keywords": [""], "paper_abstract": "One main challenge in Augmented Reality (AR) applications is to keep track of video objects with their movement, orientation, size, and position accurately. This poses a challenging task to recover non-rigid shape and global pose in real-time AR applications. This paper proposes a novel two-stage scheme for online non-rigid shape recovery toward AR applications using Active Appearance Models (AAMs). First, we construct 3D shape models from AAMs offline, which do not involve processing of the 3D scan data. Based on the computed 3D shape models, we propose an efficient online algorithm to estimate both 3D pose and non-rigid shape parameters via local bundle adjustment for building up point correspondences. Our approach, without manual intervention, can recover the 3D non-rigid shape effectively from either real-time video sequences or single image. The recovered 3D pose parameters can be used for AR registrations. Furthermore, the facial feature can be tracked simultaneously, which is critical for many face related applications. We evaluate our algorithms on several video sequences. Promising experimental results demonstrate our proposed scheme is effective and significant for real-time AR applications.", "paper_title": "Real-time non-rigid shape recovery via Active Appearance Models for Augmented Reality", "paper_id": "WOS:000237552900015"}