{"auto_keywords": [{"score": 0.04759842145051192, "phrase": "discrete_intervals"}, {"score": 0.00481495049065317, "phrase": "huge_volume"}, {"score": 0.004722791767189843, "phrase": "rough_set_methods"}, {"score": 0.004610058444728656, "phrase": "continuous_value_attributes"}, {"score": 0.004435230698216773, "phrase": "systematic_study"}, {"score": 0.0043713857434347254, "phrase": "rough_set-based_discretization"}, {"score": 0.0034491650585057754, "phrase": "formal_taxonomy"}, {"score": 0.0033830587647810132, "phrase": "useful_roadmap"}, {"score": 0.003350480663660326, "phrase": "new_researchers"}, {"score": 0.003270396852243212, "phrase": "rsbd."}, {"score": 0.003146212656743413, "phrase": "rsbd"}, {"score": 0.003056169480391946, "phrase": "case_study"}, {"score": 0.002968695624366393, "phrase": "existing_literature"}, {"score": 0.002230984431056064, "phrase": "detailed_analysis"}, {"score": 0.0021987994275190314, "phrase": "existing_discretization_techniques"}, {"score": 0.0021049977753042253, "phrase": "rsbd_applications"}], "paper_keywords": ["Rough set theory (RST)", " Rough set discretization", " Data reduction", " Real values", " Knowledge discovery", " Categorization", " Taxonomy"], "paper_abstract": "The extraction of knowledge from a huge volume of data using rough set methods requires the transformation of continuous value attributes to discrete intervals. This paper presents a systematic study of the rough set-based discretization (RSBD) techniques found in the literature and categorizes them into a taxonomy. In the literature, no review is solely based on RSBD. Only a few rough set discretizers have been studied, while many new developments have been overlooked and need to be highlighted. Therefore, this study presents a formal taxonomy that provides a useful roadmap for new researchers in the area of RSBD. The review also elaborates the process of RSBD with the help of a case study. The study of the existing literature focuses on the techniques adapted in each article, the comparison of these with other similar approaches, the number of discrete intervals they produce as output, their effects on classification and the application of these techniques in a domain. The techniques adopted in each article have been considered as the foundation for the taxonomy. Moreover, a detailed analysis of the existing discretization techniques has been conducted while keeping the concept of RSBD applications in mind. The findings are summarized and presented in this paper.", "paper_title": "Rough set-based approaches for discretization: a compact review", "paper_id": "WOS:000358249300005"}