{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_reward"}, {"score": 0.01013892479902014, "phrase": "human_trainer"}, {"score": 0.004556901872357751, "phrase": "powerful_feedback_signal"}, {"score": 0.004536029676655286, "phrase": "control-learning_algorithms"}, {"score": 0.004332471656145115, "phrase": "model-based_reinforcement"}, {"score": 0.004185795310928821, "phrase": "six_experiments"}, {"score": 0.004119049028319832, "phrase": "reward_positivity"}, {"score": 0.003988719758707836, "phrase": "future_reward"}, {"score": 0.0038713805573219297, "phrase": "discrete_learning_episodes"}, {"score": 0.0035804980565263024, "phrase": "different_learning_objectives"}, {"score": 0.00354774117450731, "phrase": "different_resulting_behaviors"}, {"score": 0.003357377246682711, "phrase": "\"positive_circuits\"_problem"}, {"score": 0.0032287289440915187, "phrase": "observed_bias"}, {"score": 0.0031918349267979467, "phrase": "positive_reward"}, {"score": 0.0030695103543472908, "phrase": "simple_episodic_tasks"}, {"score": 0.002931569771634119, "phrase": "episodic_tasks"}, {"score": 0.0029181203386806683, "phrase": "generally_positive_reward"}, {"score": 0.002851790448644913, "phrase": "non-myopic_valuation"}, {"score": 0.00283870598459543, "phrase": "multiple_user_studies"}, {"score": 0.0028191914473630394, "phrase": "primary_learning_algorithm"}, {"score": 0.002711109302199029, "phrase": "first_algorithm"}, {"score": 0.0025951949939040718, "phrase": "higher-level_understanding"}, {"score": 0.0025420267431501367, "phrase": "real-world_problems"}, {"score": 0.0024899450411323115, "phrase": "failure_state"}, {"score": 0.002405496949144104, "phrase": "local_bias-i.e"}, {"score": 0.002361632539339945, "phrase": "agent's_current_state"}, {"score": 0.0022815262950738814, "phrase": "fully_synchronous_sweeps"}, {"score": 0.002250248116067324, "phrase": "vi-tamer_algorithm"}, {"score": 0.0022296340517805125, "phrase": "locally_biased_updates"}, {"score": 0.0021990657122458643, "phrase": "general_positivity"}, {"score": 0.002163930783583212, "phrase": "continuing_tasks"}, {"score": 0.0021441057555396013, "phrase": "distinct_research_challenge"}, {"score": 0.0021342613107011624, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Reinforcement learning", " Modeling user behavior", " End-user programming", " Human-agent interaction", " Interactive machine learning", " Human teachers"], "paper_abstract": "Several studies have demonstrated that reward from a human trainer can be a powerful feedback signal for control-learning algorithms. However, the space of algorithms for learning from such human reward has hitherto not been explored systematically. Using model-based reinforcement learning from human reward, this article investigates the problem of learning from human reward through six experiments, focusing on the relationships between reward positivity, which is how generally positive a trainer's reward values are; temporal discounting, the extent to which future reward is discounted in value; episodicity, whether task learning occurs in discrete learning episodes instead of one continuing session; and task performance, the agent's performance on the task the trainer intends to teach. This investigation is motivated by the observation that an agent can pursue different learning objectives, leading to different resulting behaviors. We search for learning objectives that lead the agent to behave as the trainer intends. We identify and empirically support a \"positive circuits\" problem with low discounting (i.e., high discount factors) for episodic, goal-based tasks that arises from an observed bias among humans towards giving positive reward, resulting in an endorsement of myopic learning for such domains. We then show that converting simple episodic tasks to be non-episodic (i.e., continuing) reduces and in some cases resolves issues present in episodic tasks with generally positive reward and-relatedly-enables highly successful learning with non-myopic valuation in multiple user studies. The primary learning algorithm introduced in this article, which we call \"VI-TAMER\", is the first algorithm to successfully learn non-myopically from reward generated by a human trainer; we also empirically show that such non-myopic valuation facilitates higher-level understanding of the task. Anticipating the complexity of real-world problems, we perform further studies-one with a failure state added-that compare (1) learning when states are updated asynchronously with local bias-i.e., states quickly reachable from the agent's current state are updated more often than other states-to (2) learning with the fully synchronous sweeps across each state in the VI-TAMER algorithm. With these locally biased updates, we find that the general positivity of human reward creates problems even for continuing tasks, revealing a distinct research challenge for future work. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Framing reinforcement learning from human reward: Reward positivity, temporal discounting, episodicity, and performance", "paper_id": "WOS:000357904700002"}