{"auto_keywords": [{"score": 0.03867302058318076, "phrase": "jpeg-ces"}, {"score": 0.03449747819738694, "phrase": "qdct_coefficient_histogram"}, {"score": 0.00481495049065317, "phrase": "jpeg_steganography"}, {"score": 0.004769702911065878, "phrase": "complementary_embedding_strategy"}, {"score": 0.004658426838467567, "phrase": "new_high-performance_jpeg_steganography"}, {"score": 0.004218602458288531, "phrase": "square_family"}, {"score": 0.0037133478610481994, "phrase": "security_performance"}, {"score": 0.003426640459083931, "phrase": "different_quantised_discrete_cosine_transform"}, {"score": 0.0031619994642255846, "phrase": "secret_message"}, {"score": 0.0030590445140753187, "phrase": "intrinsic_sign"}, {"score": 0.0029594318330247614, "phrase": "intra-block_and_inter-block_qdct_coefficients"}, {"score": 0.002782938683493689, "phrase": "modern_universal_steganalysers"}, {"score": 0.0023470862747075228, "phrase": "inter-block_sense"}], "paper_keywords": [""], "paper_abstract": "Recently, a new high-performance JPEG steganography with a complementary embedding strategy (JPEG-CES) was presented. It can disable many specific steganalysers such as the Chi-square family and S family detectors, which have been used to attack J-Steg, JPHide, F5 and OutGuess successfully. In this work, a study on the security performance of JPEG-CES is reported. Our theoretical analysis demonstrates that in this algorithm, the number of the different quantised discrete cosine transform (qDCT) coefficients and the symmetry of the qDCT coefficient histogram both will be disturbed when the secret message is embedded. Moreover, the intrinsic sign and magnitude dependencies that existed in intra-block and inter-block qDCT coefficients will be disturbed too. Thus it may be detected by some modern universal steganalysers which can catch these disturbances. In this work, the authors have proposed two new steganalytic approaches. Through exploring the distortions that have been introduced into the qDCT coefficient histogram and the dependencies existed in the intra-block and inter-block sense, respectively, these two alternative steganalysers can detect JPEG-CES effectively. In addition, via merging the features of these two steganalysers, a more reliable classifier can be obtained.", "paper_title": "Steganalysis of JPEG steganography with complementary embedding strategy", "paper_id": "WOS:000295122600002"}