{"auto_keywords": [{"score": 0.04258178486815228, "phrase": "dw_views"}, {"score": 0.009951067745158346, "phrase": "source_data"}, {"score": 0.007427424494288285, "phrase": "star_schema"}, {"score": 0.00481495049065317, "phrase": "data_warehouse_views"}, {"score": 0.004767261858417823, "phrase": "generalised_referential_integrity_differential_files"}, {"score": 0.004272724011826495, "phrase": "corresponding_views"}, {"score": 0.0037350832473790007, "phrase": "referential_integrity_differential_files"}, {"score": 0.003029643234751066, "phrase": "snowflake_schema"}, {"score": 0.002984665318717504, "phrase": "galaxy_schema"}, {"score": 0.0027148677103585985, "phrase": "generalised_ridfs"}, {"score": 0.0024693979425773993, "phrase": "non-star_schemas"}, {"score": 0.002408565679880478, "phrase": "new_views"}, {"score": 0.0023028105026714533, "phrase": "truly_relevant_tuples"}, {"score": 0.002168975681697056, "phrase": "underlying_source_data"}, {"score": 0.0021049977753042253, "phrase": "efficient_update"}], "paper_keywords": [""], "paper_abstract": "Data warehouse (DW) views provide an efficient access to information integrated from source data. When changes are made to the source data, the corresponding views may be outdated. Thus, the maintenance of DW views is crucial for the currency of information. Recently, a method was proposed to use referential integrity differential files (RIDFs) to self-maintain DW views that contain select-project-joins over relations modelled in a star schema. However, it is not uncommon for applications to have relations that are modelled in other schemas such as a snowflake schema or a galaxy schema. In this paper, we generalise the concept of RIDFs; we propose a method that uses generalised RIDFs to self-maintain the DW views that contain joins over relations modelled in the star schema as well as non-star schemas. Our method computes new views by using only the old materialised views and files that keep the truly relevant tuples in the \"delta\". Consequently, it avoids accessing the underlying source data, and hence leads to efficient update of DW views.", "paper_title": "Efficient update of data warehouse views with generalised referential integrity differential files", "paper_id": "WOS:000239454500017"}