{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "person-person_interaction"}, {"score": 0.0490494776391455, "phrase": "collective_activity"}, {"score": 0.015057811791245978, "phrase": "atomic_activities"}, {"score": 0.012839033765130303, "phrase": "person-person_interactions"}, {"score": 0.01272875405660457, "phrase": "collective_activity_recognition"}, {"score": 0.00475254914916922, "phrase": "activity_recognition"}, {"score": 0.004337710093279712, "phrase": "atomic_activity"}, {"score": 0.00417115038996633, "phrase": "important_cues"}, {"score": 0.0037903327482565097, "phrase": "hand-craft_description"}, {"score": 0.0034894451015047875, "phrase": "class-specific_person-person_interaction_patterns"}, {"score": 0.0032974089700312423, "phrase": "interaction_matrix"}, {"score": 0.0030754582519753474, "phrase": "collective_activity_instance"}, {"score": 0.0029961221584602405, "phrase": "interaction_response"}, {"score": 0.002855934865505357, "phrase": "ir_class"}, {"score": 0.002652039172817654, "phrase": "different_person-person_interaction_patterns"}, {"score": 0.0025500402081330394, "phrase": "different_person-person_interactions"}, {"score": 0.0023782753249846794, "phrase": "discriminative_low-rank_representation"}, {"score": 0.0021049977753042253, "phrase": "critical_role"}], "paper_keywords": ["Collective activity recognition", " interaction modeling", " action analysis"], "paper_abstract": "Collective activity is a collection of atomic activities (individual person's activity) and can hardly be distinguished by an atomic activity in isolation. The interactions among people are important cues for recognizing collective activity. In this paper, we concentrate on modeling the person-person interactions for collective activity recognition. Rather than relying on hand-craft description of the person-person interaction, we propose a novel learning-based approach that is capable of computing the class-specific person-person interaction patterns. In particular, we model each class of collective activity by an interaction matrix, which is designed to measure the connection between any pair of atomic activities in a collective activity instance. We then formulate an interaction response (IR) model by assembling all these measurements and make the IR class specific and distinct from each other. A multitask IR is further proposed to jointly learn different person-person interaction patterns simultaneously in order to learn the relation between different person-person interactions and keep more distinct activity-specific factor for each interaction at the same time. Our model is able to exploit discriminative low-rank representation of person-person interaction. Experimental results on two challenging data sets demonstrate our proposed model is comparable with the state-of-the-art models and show that learning person-person interactions plays a critical role in collective activity recognition.", "paper_title": "Learning Person-Person Interaction in Collective Activity Recognition", "paper_id": "WOS:000355511400016"}