{"auto_keywords": [{"score": 0.04695992795323345, "phrase": "six_degreess"}, {"score": 0.043608312845799704, "phrase": "sns"}, {"score": 0.025884171501168972, "phrase": "business_world"}, {"score": 0.02488457535589397, "phrase": "facebook"}, {"score": 0.00481495049065317, "phrase": "six-degree-separation_social_networks"}, {"score": 0.004309725894724034, "phrase": "social_networks"}, {"score": 0.0038573081851680656, "phrase": "randomized_control_group"}, {"score": 0.0038443635340052523, "phrase": "pre-test-post-test_experimental_design"}, {"score": 0.00344062888674746, "phrase": "traditional_virtual_communities"}, {"score": 0.0033946556965877873, "phrase": "higher_ratings"}, {"score": 0.003079163348079199, "phrase": "greater_social_involvement"}, {"score": 0.0029973957125353306, "phrase": "postive_attitudes"}, {"score": 0.002927626967420519, "phrase": "significant_differences"}, {"score": 0.002869115451202179, "phrase": "traditional_internet_media"}, {"score": 0.002830757050018908, "phrase": "new_friends"}, {"score": 0.0025332005503938947, "phrase": "language_differences"}, {"score": 0.0023923340786366864, "phrase": "microsoft"}], "paper_keywords": ["Social networks", " Communication technologies", " Experimental design"], "paper_abstract": "Purpose - This research seeks to focus on the benefits of socaial networking services(SNS) based on the principle of six degreess of separation. Since the inception of web 2.0 the popularity of social networks (SNS) has continued to increase. Some SNS are based on six degreess of separation (6SNS), and these have emerged as the most frequently visited WWW sites. Design/methodology/approach - Using a randomized control group pre-test-post-test experimental design, responses to a questionaire to test the differences among 6SNS users and non-users on 12 issues of benefit were analyzed. Findings - The tests show, first, that, compared with traditional virtual communities, SNS evoke higher ratings for \"trust in website,\" \"trust in other members,\" and \"quality of friends.\" Second, SNS can provide users with entertainment and greater social involvement. People who use these sites express postive attitudes about them. Third, no significant differences were found between SNS and traditional internet media on \"meeting new friends,\" \"maintaining relationships,\" \"searching for friends,\" \"searching for information,\" and \"understanding and learning.\" These results can be attributed to language differences. Originality/value - The value of 6SNS is recognized by the business world. In October 2007, Microsoft invested $240 million to buy 1.6 percent shares of Facebook. Today Facebook alone has more than 300 million users. In addition to the perspective from the business world, how the users themselves view 6SNS and what benefits they can get are crucial to its sustainability.", "paper_title": "The perceived benefits of six-degree-separation social networks", "paper_id": "WOS:000303030100002"}