{"auto_keywords": [{"score": 0.036241675507294686, "phrase": "adjoint_equations"}, {"score": 0.015719716506582538, "phrase": "unsteady_viscous_flows"}, {"score": 0.004746065479362881, "phrase": "new_method"}, {"score": 0.004437349839203418, "phrase": "continuous_adjoint_approach"}, {"score": 0.0043738432231020885, "phrase": "time_accurate_method"}, {"score": 0.004229158339021651, "phrase": "inverse_and_direct_objective_functions"}, {"score": 0.003953932197201054, "phrase": "flow_equations"}, {"score": 0.003750260412839128, "phrase": "non-uniform_rational_b-splines"}, {"score": 0.0037143738283295026, "phrase": "nurbs"}, {"score": 0.0033900126423990823, "phrase": "finite_element_method"}, {"score": 0.0033094547380057107, "phrase": "supg"}, {"score": 0.00266510562382701, "phrase": "high_performance_airfoils"}, {"score": 0.002432152706473349, "phrase": "design_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Shape optimization", " Adjoint methods", " Unsteady flows", " Time accurate", " Finite element", " Airfoil"], "paper_abstract": "A new method for shape optimization for unsteady viscous flows is presented. It is based on the continuous adjoint approach using a time accurate method and is capable of handling both inverse and direct objective functions. The objective function is minimized or maximized subject to the satisfaction of flow equations. The shape of the body is parametrized via a Non-Uniform Rational B-Splines (NURBS) curve and is updated by using the gradients obtained from solving the flow and adjoint equations. A finite element method based on streamline-upwind Petrov/Galerkin (SUPG) and pressure stabilized Petrov/Galerkin (PSPG) stabilization techniques is used to solve both the flow and adjoint equations. The method has been implemented and tested for the design of airfoils, based on enhancing its time-averaged aerodynamic coefficients. Interesting shapes are obtained, especially when the objective is to produce high performance airfoils. The effect of the extent of the window of time integration of flow and adjoint equations on the design process is studied. It is found that when the window of time integration is insufficient, the gradients are most likely to be erroneous. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "An adjoint method for shape optimization in unsteady viscous flows", "paper_id": "WOS:000275092000004"}