{"auto_keywords": [{"score": 0.03971153651924658, "phrase": "openpgp"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_barter_relationships"}, {"score": 0.004768012159430855, "phrase": "peer-to-peer_complementary_currency"}, {"score": 0.0044374341132573936, "phrase": "proposed_such_currency"}, {"score": 0.004379828513102091, "phrase": "wat_system"}, {"score": 0.004294813202198633, "phrase": "polycentric_complementary_currency"}, {"score": 0.0042668414931947615, "phrase": "wat_tickets"}, {"score": 0.0035531906001888204, "phrase": "mutual_help"}, {"score": 0.0034276650497743603, "phrase": "additional_\"reduction\"_tickets"}, {"score": 0.0030769941082173314, "phrase": "exchange_media"}, {"score": 0.0029200834042804333, "phrase": "extended_design"}, {"score": 0.002789346122034762, "phrase": "game-theoretical_analysis"}, {"score": 0.002753076401091352, "phrase": "rapid_circulation"}, {"score": 0.002717277008333612, "phrase": "reduction_ticket"}, {"score": 0.0026731799329374768, "phrase": "high_speed"}, {"score": 0.0026297965957221554, "phrase": "scheduled_minimum"}, {"score": 0.002587115505155995, "phrase": "vanishment_equilibrium"}, {"score": 0.0023995115472744376, "phrase": "reference_implementation"}, {"score": 0.002153799620707991, "phrase": "currency_system"}, {"score": 0.002139742163351676, "phrase": "practical_use"}, {"score": 0.0021049977753042253, "phrase": "proposed_feature"}], "paper_keywords": ["P2P", " trust", " currency", " community formation"], "paper_abstract": "A peer-to-peer complementary currency can be a powerful tool for promoting exchanges and building relationships on the Internet. i-WAT [1] is a proposed such currency based on the WAT System [2], a polycentric complementary currency using WAT tickets as its media of exchange: participants spontaneously issue and circulate the tickets as needed, whose values are backed up by chains of trust. i-WAT implements the tickets electronically by exchanging messages signed in OpenPGP [3]. This paper investigates an extension to the design of i-WAT to facilitate mutual help among peers in need. In particular, we investigate additional \"reduction\" tickets whose values are reduced over time. By deferring redemption of such tickets, the participants can contribute to reduce the debts of the issuers, and the issuers help participants by providing exchange media that accelerate spending. This paper describes in detail how incentive-compatibility is achieved by this extended design; we predict that the following properties will hold, which resulted from a game-theoretical analysis. 1. Rapid circulation, or a reduction ticket will typically circulate at high speed until its effective value reaches the scheduled minimum, and 2. Vanishment equilibrium, or the system will be most stable if the values of tickets are to be reduced down to zero. A reference implementation of i-WAT has been developed in the form of a plug-in for an XMPP [4], [5] instant messaging client. We have been putting the currency system into practical use, to which the proposed feature has been added.", "paper_title": "Reduction over time to facilitate peer-to-peer barter relationships", "paper_id": "WOS:000234952100022"}