{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "citees'_names"}, {"score": 0.004685855684376706, "phrase": "qualitative_interview-based_study"}, {"score": 0.0045108906244892165, "phrase": "academic_writers"}, {"score": 0.004462105963334103, "phrase": "computer_science"}, {"score": 0.0037903327482565097, "phrase": "citees'_first_names"}, {"score": 0.003201890266327127, "phrase": "stylistic_elegance"}, {"score": 0.002934764205541183, "phrase": "close_relationship"}, {"score": 0.0026898636962522505, "phrase": "seminal_sources"}, {"score": 0.0022228943786652914, "phrase": "private_and_subjective_process"}, {"score": 0.0021631447601689444, "phrase": "interview-based_studies"}, {"score": 0.002128067018576581, "phrase": "analyst_insights"}, {"score": 0.0021049977753042253, "phrase": "writers'_citing_practices"}], "paper_keywords": [""], "paper_abstract": "This article focuses on why academic writers in computer science and sociology sometimes supply the reader with more details of citees' names than they need to: Why do citers name citees when using the Footnote System, and why do citers include citees' first names when using the Harvard System? These questions were investigated as part of a qualitative, interview-based study of citation behavior. A number of motivations were advanced by informants, including the desire for stylistic elegance, for informality, to make the text accessible to less informed readers, to mark a close relationship between citer and citee, to alert readers to a little known citee, and to acknowledge seminal sources. In a number of cases, however, informants were unable to offer any motivation, reporting that their behavior had been unconscious or accidental. The study underlines B. Cronin's (1984, 2005) argument that citation is a private and subjective process, and shows that interview-based studies afford the analyst insights into writers' citing practices which alternative methodologies cannot.", "paper_title": "Citers' use of citees' names: Findings from a qualitative interview-based study", "paper_id": "WOS:000254363800012"}