{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hobbyist_collectors"}, {"score": 0.004642292792558686, "phrase": "serious_leisure_pursuits"}, {"score": 0.00419861271409079, "phrase": "qualitative_approach"}, {"score": 0.003920573616298175, "phrase": "leisure_activity"}, {"score": 0.0038849148160362257, "phrase": "hobbyist_collecting"}, {"score": 0.0034813964296826973, "phrase": "information_seeking"}, {"score": 0.00325069754015951, "phrase": "information_sources"}, {"score": 0.002993887707344862, "phrase": "particular_domain"}, {"score": 0.0028082176224611542, "phrase": "formal_systems"}, {"score": 0.002682669289913153, "phrase": "social_milieu"}, {"score": 0.002610043728801011, "phrase": "collecting_community"}, {"score": 0.002539379289856756, "phrase": "social_system"}, {"score": 0.0025162511343171, "phrase": "complex_interactions"}, {"score": 0.002493333098814506, "phrase": "specialized_information"}, {"score": 0.00243694486220507, "phrase": "collector_types"}, {"score": 0.0022962183207691188, "phrase": "information_dissemination"}, {"score": 0.002254571365634257, "phrase": "traditional_sense"}, {"score": 0.0021340985236583017, "phrase": "critical_resource"}, {"score": 0.0021049977753042253, "phrase": "individual_and_communal_collecting_activities"}], "paper_keywords": [""], "paper_abstract": "This article marries the study of serious leisure pursuits with library and information science's (LIS) interest in people's everyday use, need, seeking, and sharing of information. Using a qualitative approach, the role of information as a phenomenon was examined in relation to the leisure activity of hobbyist collecting. In the process, a model and a typology for these collectors were developed. We find that the information needs and information seeking of hobbyist collectors is best represented as an interrelationship between information and object needs, information sources, and interactions between collectors and their publics. Our model of the role of information in a particular domain of hobbyist collecting moves away from the idea of one individual seeking information from formal systems and shifts towards a model that takes seriously the social milieu of a community. This collecting community represents a layer of a social system with complex interactions and specialized information needs that vary across collector types. Only the serious collectors habitually engage in information seeking and, occasionally, in information dissemination, in the traditional sense yet information flows through the community and serve's as a critical resource for sustaining individual and communal collecting activities.", "paper_title": "The Role of Information in a Community of Hobbyist Collectors", "paper_id": "WOS:000263935100015"}