{"auto_keywords": [{"score": 0.03969466262067949, "phrase": "critical_value"}, {"score": 0.013812514843233929, "phrase": "random_k-sat_formulae"}, {"score": 0.00481495049065317, "phrase": "random_k-sat_problems"}, {"score": 0.004723322467153553, "phrase": "propositional_formula"}, {"score": 0.004597951649247307, "phrase": "fundamental_task"}, {"score": 0.004562743714811391, "phrase": "automated_reasoning"}, {"score": 0.004407599980762272, "phrase": "efficient_algorithms"}, {"score": 0.004050116768809519, "phrase": "widely_popular_show"}, {"score": 0.0038973170902076707, "phrase": "known_algorithm"}, {"score": 0.0033672608231654897, "phrase": "'phase_transition"}, {"score": 0.003000070450638437, "phrase": "a._e._formula"}, {"score": 0.0028317319086202217, "phrase": "new_and_more_efficient_algorithms"}, {"score": 0.002662541169311738, "phrase": "real-world_problems"}, {"score": 0.0026218430041123164, "phrase": "better_understanding"}, {"score": 0.0025521085778978042, "phrase": "problem_hardness"}, {"score": 0.002474674704809152, "phrase": "solving_heuristic"}, {"score": 0.0023178219772486868, "phrase": "recent_work"}, {"score": 0.00230003335593664, "phrase": "statistical_physics"}, {"score": 0.0021708894366462153, "phrase": "substantial_jump"}, {"score": 0.0021049977753042253, "phrase": "unsatisfiable_random_k-sat_formulae"}], "paper_keywords": ["satisfiability", " solving", " heuristic"], "paper_abstract": "Proving that a propositional formula is contradictory or unsatisfiable is a fundamental task in automated reasoning. This task is coNP-complete. Efficient algorithms are therefore needed when formulae are hard to solve. Random k-SAT formulae provide a test-bed for algorithms because experiments that have become widely popular show clearly that these formulae are consistently difficult for any known algorithm. Moreover, the experiments show a critical value of the ratio of the number of clauses to the number of variables around which the formulae are the hardest on average. This critical value also corresponds to a 'phase transition' from solvability to unsolvability. The question of whether the formulae located around or above this critical value can efficiently be proved unsatisfiable on average ( or even for a. e. formula) remains up to now one of the most challenging questions bearing on the design of new and more efficient algorithms. New insights into this question could indirectly benefit the solving of formulae coming from real-world problems, through a better understanding of some of the causes of problem hardness. In this paper we present a solving heuristic that we have developed, devoted essentially to proving the unsatisfiability of random k-SAT formulae and inspired by recent work in statistical physics. Results of experiments with this heuristic and its evaluation in two recent sat competitions have shown a substantial jump in the efficiency of solving hard, unsatisfiable random k-SAT formulae.", "paper_title": "An efficient approach to solving random k-SAT problems", "paper_id": "WOS:000244309400002"}