{"auto_keywords": [{"score": 0.028084532465513904, "phrase": "soft_constraints"}, {"score": 0.00481495049065317, "phrase": "anesthesia_and_reanimation_department"}, {"score": 0.004668510065740584, "phrase": "graduate_medical_training"}, {"score": 0.00456159659731398, "phrase": "mental_and_physiological_burden"}, {"score": 0.004422827355213055, "phrase": "anesthesia_and_reanimation_departments"}, {"score": 0.004288261454002681, "phrase": "main_providers"}, {"score": 0.004125773078637226, "phrase": "on-call_shifts"}, {"score": 0.003954109842050071, "phrase": "regular_day_shifts"}, {"score": 0.003760385494931853, "phrase": "coverage_requirements"}, {"score": 0.0034140224493254935, "phrase": "goal_programming"}, {"score": 0.0030283730114326014, "phrase": "on-duty_shifts"}, {"score": 0.002993439939273828, "phrase": "block_shifts"}, {"score": 0.0029361086955646625, "phrase": "hard_constraints"}, {"score": 0.0025054621733192283, "phrase": "analytical_hierarchy_process"}, {"score": 0.002391779843744166, "phrase": "realistic_size"}, {"score": 0.002292097733181405, "phrase": "proposed_formulation"}, {"score": 0.002205079358459154, "phrase": "substantial_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Resident physician", " Shift scheduling", " Anesthesia and reanimation", " Goal programming", " Analytical hierarchical process"], "paper_abstract": "Medicine residency is three to seven years of challenging graduate medical training that puts a lot of mental and physiological burden over the residents. Like other surgical branches, anesthesia and reanimation departments provide 24 h continuous service and the residents are the main providers of this service. The residents are assigned for on-call shifts during their training, as well as working during the regular day shifts. These schedules must address several considerations like preferences of the residents and coverage requirements of two different locations: the intensive care unit (ICU) and the surgery room (SR). In this study we develop a goal programming (GP) model for scheduling the shifts of the residents in the Anesthesia and Reanimation Department of Bezmialem Vakif University Medical School (BUMS). The rules that must be strictly met, like the number of on-duty shifts or preventing block shifts, are formulated as hard constraints. The preferences of the residents like increasing the number of weekends without shifts and assigning duties on the same night to the same social groups are formulated as soft constraints. The penalties for the deviation from the soft constraints are determined by the analytical hierarchy process (AHP). We are able to solve problems of realistic size to optimality in a few seconds. We showed that the proposed formulation, which the department uses currently, has yielded substantial improvements and much better schedules are created with less effort. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A goal programming model for scheduling residents in an anesthesia and reanimation department", "paper_id": "WOS:000315607200021"}