{"auto_keywords": [{"score": 0.04261346602453255, "phrase": "fourier"}, {"score": 0.03733985931707274, "phrase": "high_order"}, {"score": 0.010610321225825866, "phrase": "nearly_singular_solutions"}, {"score": 0.010526047299163432, "phrase": "pseudo-spectral_methods"}, {"score": 0.009451137410855046, "phrase": "pseudo-spectral_method"}, {"score": 0.006568808563090039, "phrase": "fourier_smoothing_method"}, {"score": 0.0044795698035664695, "phrase": "fluid_dynamics_equations"}, {"score": 0.004338076511024884, "phrase": "aliasing_errors"}, {"score": 0.004234884779773412, "phrase": "first_one"}, {"score": 0.004134137523409649, "phrase": "second_one"}, {"score": 0.003987474771008829, "phrase": "significant_portion"}, {"score": 0.003939748053452577, "phrase": "fourier_modes"}, {"score": 0.003022465992278672, "phrase": "effective_fourier_codes"}, {"score": 0.0028342734482926677, "phrase": "interesting_observation"}, {"score": 0.0027446057983474994, "phrase": "high_order_fourier_smoothing_method"}, {"score": 0.002502264043067568, "phrase": "entire_domain"}, {"score": 0.0023653276631862958, "phrase": "high_frequency_instability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["pseudo spectral methods", " singular solutions", " incompressible flow", " dealiasing"], "paper_abstract": "In this paper, we investigate the performance of pseudo-spectral methods in computing nearly singular solutions of fluid dynamics equations. We consider two different ways of removing the aliasing errors in a pseudo-spectral method. The first one is the traditional 2/3 dealiasing rule. The second one is a high (36th) order Fourier smoothing which keeps a significant portion of the Fourier modes beyond the 2/3 cut-off point in the Fourier spectrum for the 2/3 dealiasing method. Both the I D Burgers equation and the 3D incompressible Euler equations are considered. We demonstrate that the pseudo-spectral method with the high order Fourier smoothing gives a much better performance than the pseudo-spectral method with the 2/3 dealiasing rule. Moreover, we show that the high order Fourier smoothing method captures about 12-15% more effective Fourier modes in each dimension than the 2/3 dealiasing method. For the 3D Euler equations, the gain in the effective Fourier codes for the high order Fourier smoothing method can be as large as 20% over the 2/3 dealiasing method. Another interesting observation is that the error produced by the high order Fourier smoothing method is highly localized near the region where the solution is most singular, while the 2/3 dealiasing method tends to produce oscillations in the entire domain. The high order Fourier smoothing method is also found be very stable dynamically. No high frequency instability has been observed. In the case of the 3D Euler equations, the energy is conserved up to at least six digits of accuracy throughout the computations. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Computing nearly singular solutions using pseudo-spectral methods", "paper_id": "WOS:000249936500017"}