{"auto_keywords": [{"score": 0.03273261985134449, "phrase": "wired_dc_network"}, {"score": 0.00481495049065317, "phrase": "augmenting_data_center_networks"}, {"score": 0.004773476989344654, "phrase": "multi-gigabit_wireless_links"}, {"score": 0.0045124316982387315, "phrase": "dense_and_extremely_fast_connectivity"}, {"score": 0.004084920064588169, "phrase": "dc_environment"}, {"score": 0.0037623642073222547, "phrase": "directional_antennas"}, {"score": 0.0036500346000495317, "phrase": "multi-gbps_rates"}, {"score": 0.0033909518548844047, "phrase": "production_traces"}, {"score": 0.003361702510958392, "phrase": "dc_traffic"}, {"score": 0.0032331613500559764, "phrase": "small_amount"}, {"score": 0.003205268682789165, "phrase": "network_capacity"}, {"score": 0.0031365819432206004, "phrase": "wireless_flyways"}, {"score": 0.0029647862293448895, "phrase": "significant_value"}, {"score": 0.002790254164160135, "phrase": "dc_traffic_analysis"}, {"score": 0.0026951616152303373, "phrase": "dc_traffic_levels"}, {"score": 0.0025808284847319528, "phrase": "trace-driven_evaluations"}, {"score": 0.0025474814283429213, "phrase": "network-limited_dc_applications"}, {"score": 0.0021049977753042253, "phrase": "non-oversubscribed_network"}], "paper_keywords": ["Design", " Experimentation", " Measurement", " Performance"], "paper_abstract": "The 60 GHz wireless technology that is now emerging has the potential to provide dense and extremely fast connectivity at low cost. In this paper, we explore its use to relieve hotspots in oversubscribed data center (DC) networks. By experimenting with prototype equipment, we show that the DC environment is well suited to a deployment of 60 GHz links contrary to concerns about interference and link reliability. Using directional antennas, many wireless links can run concurrently at multi-Gbps rates on top-of-rack (ToR) switches. The wired DC network can be used to sidestep several common wireless problems. By analyzing production traces of DC traffic for four real applications, we show that adding a small amount of network capacity in the form of wireless flyways to the wired DC network can improve performance. However, to be of significant value, we find that one hop indirect routing is needed. Informed by our 60 GHz experiments and DC traffic analysis, we present a design that uses DC traffic levels to select and adds flyways to the wired DC network. Trace-driven evaluations show that network-limited DC applications with predictable traffic workloads running on a 1: 2 oversubscribed network can be sped up by 45% in 95% of the cases, with just one wireless device per ToR switch. With two devices, in 40% of the cases, the performance is identical to that of a non-oversubscribed network.", "paper_title": "Augmenting Data Center Networks with Multi-Gigabit Wireless Links", "paper_id": "WOS:000302124800004"}