{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "man-made_objects"}, {"score": 0.04888938273281976, "phrase": "upright_orientation"}, {"score": 0.03761646802023329, "phrase": "orientation_candidates"}, {"score": 0.035538092749504986, "phrase": "assessment_function"}, {"score": 0.004281372589330329, "phrase": "open_challenge"}, {"score": 0.003650195070580192, "phrase": "orientation_space"}, {"score": 0.003604506544515226, "phrase": "small_set"}, {"score": 0.0035444736871640147, "phrase": "functionality-related_geometric_properties"}, {"score": 0.0034130176595901104, "phrase": "best_orientation"}, {"score": 0.0030470980812086247, "phrase": "flat_surface"}, {"score": 0.002860992017190221, "phrase": "vast_majority"}, {"score": 0.0026637384761565605, "phrase": "static_equilibrium"}, {"score": 0.002543392353000551, "phrase": "discriminative_attributes"}, {"score": 0.0023284972218506157, "phrase": "random_forest_classifier"}, {"score": 0.002309000874224222, "phrase": "support_vector_machine_classifier"}, {"score": 0.0021049977753042253, "phrase": "independent_test_set"}], "paper_keywords": [""], "paper_abstract": "Humans usually associate an upright orientation with objects, placing them in a way that they are most commonly seen in our surroundings. While it is an open challenge to recover the functionality of a shape from its geometry alone, this paper shows that it is often possible to infer its upright orientation by analyzing its geometry. Our key idea is to reduce the two-dimensional (spherical) orientation space to a small set of orientation candidates using functionality-related geometric properties of the object, and then determine the best orientation using an assessment function of several functional geometric attributes defined with respect to each candidate. Specifically we focus on obtaining the upright orientation for man-made objects that typically stand on some flat surface (ground, floor, table, etc.), which include the vast majority of objects in our everyday surroundings. For these types of models orientation candidates can be defined according to static equilibrium. For each candidate, we introduce a set of discriminative attributes linking shape to function. We learn an assessment function of these attributes from a training set using a combination of Random Forest classifier and Support Vector Machine classifier. Experiments demonstrate that our method generalizes well and achieves about 90% prediction accuracy for both a 10-fold cross-validation over the training set and a validation with an independent test set.", "paper_title": "Upright orientation of man-made objects", "paper_id": "WOS:000258262000031"}