{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-privileged_group_communications"}, {"score": 0.004568871736067739, "phrase": "different_data_streams"}, {"score": 0.004450568197899267, "phrase": "multiple_access_privileges"}, {"score": 0.0044118153390803405, "phrase": "security_issues"}, {"score": 0.004223032986655664, "phrase": "traditional_group_communications"}, {"score": 0.004167982855788402, "phrase": "common_drawback"}, {"score": 0.0041316803676012155, "phrase": "traditional_key_management_schemes"}, {"score": 0.00398959232769596, "phrase": "\"one-affect-many\"_problem"}, {"score": 0.003305243635051068, "phrase": "secure_multi-privileged_group_communications"}, {"score": 0.002936709606809639, "phrase": "collusion-resistant_broadcast_encryption_system"}, {"score": 0.002898378776839434, "phrase": "kp-abe_system"}, {"score": 0.002860546817196148, "phrase": "non-monotone_access_structure"}, {"score": 0.0027985846558073457, "phrase": "scalable_encryption_scheme"}, {"score": 0.0026552818091968543, "phrase": "different_multi-privileged_group_communication_systems"}, {"score": 0.002218668420806254, "phrase": "rekeying_operations"}, {"score": 0.0021049977753042253, "phrase": "dynamic_group"}], "paper_keywords": ["Attribute-based broadcast encryption", " Multi-privileged group communications", " Revocation", " Key-policy attribute-based encryption"], "paper_abstract": "In multi-privileged group communications, since users, who can subscribe to different data streams according to their interests, have multiple access privileges, security issues are more difficult to be solved than those in traditional group communications. The common drawback of traditional key management schemes is that they will result in the \"one-affect-many\" problem, because they use a key graph to manage all the keys in a group, which makes one key being shared by many users. Recently, a key-policy attribute-based encryption (KP-ABE) scheme is proposed to encrypt messages to multiple users efficiently, which has been applied in secure multi-privileged group communications. However, user revocation in KP-ABE is still not resolved when applied to multi-privileged group communications. So, in this paper, by uniquely combining a collusion-resistant broadcast encryption system and a KP-ABE system with a non-monotone access structure, we propose a scalable encryption scheme for multi-privileged group communications (EMGC). Based on the features of different multi-privileged group communication systems, we also propose two constructions for our EMGC scheme. With the two constructions, a system can support a user not only to join/leave a group at will, but also to change his access privilege on demand, and the expenses during rekeying operations are small. Therefore, our scheme, which can accommodate a dynamic group of users, is more applicable to multi-privileged group communications.", "paper_title": "A scalable encryption scheme for multi-privileged group communications", "paper_id": "WOS:000319075500024"}