{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "layered_surfaces"}, {"score": 0.004775918707955445, "phrase": "neural_networks"}, {"score": 0.00462291551375938, "phrase": "texture_boundary_detection"}, {"score": 0.004493045859210086, "phrase": "important_capability"}, {"score": 0.004456611869693865, "phrase": "human_vision"}, {"score": 0.004384623928442369, "phrase": "texture_segmentation"}, {"score": 0.004025258572860201, "phrase": "interesting_hypothesis"}, {"score": 0.003562186600028245, "phrase": "possible_answer"}, {"score": 0.003076052206618737, "phrase": "computational_experiments"}, {"score": 0.0030510733648183813, "phrase": "artificial_neural_networks"}, {"score": 0.0030017207229983385, "phrase": "relative_difficulty"}, {"score": 0.0029531640201737384, "phrase": "segment_textures"}, {"score": 0.0027893011631269873, "phrase": "occluding_surfaces"}, {"score": 0.002699769374493867, "phrase": "observer's_motion"}, {"score": 0.00220163445285539, "phrase": "possible_developmental_origin"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["texture segmentation", " neural networks", " 3D surface representation", " occlusion"], "paper_abstract": "Texture boundary detection (or segmentation) is an important capability in human vision. Usually, texture segmentation is viewed as a 2D problem, as the definition of the problem itself assumes a 2D substrate. However, an interesting hypothesis emerges when we ask a question regarding the nature of textures: What are textures, and why did the ability to discriminate texture evolve or develop? A possible answer to this question is that textures naturally define physically distinct (i.e., occluded) surfaces. Hence, we can hypothesize that 2D texture segmentation may be an outgrowth of the ability to discriminate surfaces in 3D. In this paper, we conducted computational experiments with artificial neural networks to investigate the relative difficulty of learning to segment textures defined on flat 2D surfaces vs. those in 3D configurations where the boundaries are defined by occluding surfaces and their change over time due to the observer's motion. It turns out that learning is faster and more accurate in 313, very much in line with our expectation. Furthermore, our results showed that the neural network's learned ability to segment texture in 3D transfers well into 2D texture segmentation, bolstering our initial hypothesis, and providing insights on the possible developmental origin of 2D texture segmentation function in human vision. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Segmentation of textures defined on flat vs. layered surfaces using neural networks: Comparison of 2D vs. 3D representations", "paper_id": "WOS:000247745000009"}