{"auto_keywords": [{"score": 0.043437461378529205, "phrase": "unknown_environment"}, {"score": 0.004814951205791257, "phrase": "asynchronously"}, {"score": 0.004653815971302021, "phrase": "distinct_labels"}, {"score": 0.00411182818527434, "phrase": "actual_walk"}, {"score": 0.004011221986096511, "phrase": "asynchronous_adversary"}, {"score": 0.0029884576691560642, "phrase": "deterministic_algorithm"}, {"score": 0.002826265478343143, "phrase": "deterministic_rendezvous_algorithms"}, {"score": 0.0027827907725673845, "phrase": "arbitrary_nodes"}, {"score": 0.0027570267191549774, "phrase": "anonymous_connected_graph"}, {"score": 0.002656327554326748, "phrase": "interior_points"}, {"score": 0.0026399046763432906, "phrase": "rational_coordinates"}, {"score": 0.002615460042926181, "phrase": "closed_region"}, {"score": 0.002575219653364536, "phrase": "path-connected_interior"}, {"score": 0.0025434724309942986, "phrase": "geometric_scenario_agents"}, {"score": 0.0025199184718145604, "phrase": "different_compasses"}, {"score": 0.0025043368321347294, "phrase": "different_units"}, {"score": 0.0021848422732893926, "phrase": "arbitrary_interior_points"}, {"score": 0.0021512129013162846, "phrase": "previously_stated_agents"}, {"score": 0.0021049977753042253, "phrase": "arbitrarily_small_positive_distance"}], "paper_keywords": ["Theory", " Design", " Rendezvous", " graph", " asynchronous", " deterministic"], "paper_abstract": "Two mobile agents (robots) with distinct labels have to meet in an arbitrary, possibly infinite, unknown connected graph or in an unknown connected terrain in the plane. Agents are modeled as points, and the route of each of them only depends on its label and on the unknown environment. The actual walk of each agent also depends on an asynchronous adversary that may arbitrarily vary the speed of the agent, stop it, or even move it back and forth, as long as the walk of the agent is continuous, does not leave its route and covers all of it. Meeting in a graph means that both agents must be at the same time in some node or in some point inside an edge of the graph, while meeting in a terrain means that both agents must be at the same time in some point of the terrain. Does there exist a deterministic algorithm that allows any two agents to meet in any unknown environment in spite of this very powerful adversary? We give deterministic rendezvous algorithms for agents starting at arbitrary nodes of any anonymous connected graph (finite or infinite) and for agents starting at any interior points with rational coordinates in any closed region of the plane with path-connected interior. In the geometric scenario agents may have different compasses and different units of length. While our algorithms work in a very general setting - agents can, indeed, meet almost everywhere we show that none of these few limitations imposed on the environment can be removed. On the other hand, our algorithm also guarantees the following approximate rendezvous for agents starting at arbitrary interior points of a terrain as previously stated agents will eventually get to within an arbitrarily small positive distance from each other.", "paper_title": "How to Meet Asynchronously (Almost) Everywhere", "paper_id": "WOS:000309426300005"}