{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "aggregated_data"}, {"score": 0.03081510736012023, "phrase": "cluster_window"}, {"score": 0.004675652357253327, "phrase": "health_data"}, {"score": 0.0045213598841171935, "phrase": "geographical_applications"}, {"score": 0.004483585361583022, "phrase": "often_spatial_data_analysis"}, {"score": 0.004281372589330329, "phrase": "exact_data"}, {"score": 0.004071121244999291, "phrase": "actual_locations"}, {"score": 0.003427380591229386, "phrase": "spatially_aggregated_health_data"}, {"score": 0.0028251537271620996, "phrase": "cluster_function"}, {"score": 0.0026525671788921205, "phrase": "area-based_models"}, {"score": 0.0021049977753042253, "phrase": "simple_functions"}], "paper_keywords": ["Cluster", " Aggregated data", " Algorithm", " Public health"], "paper_abstract": "Spatially aggregated data is frequently used in geographical applications. Often spatial data analysis on aggregated data is performed in the same way as on exact data, which ignores the fact that we do not know the actual locations of the data. We here propose models and methods to take aggregation into account. For this we focus on the problem of locating clusters in aggregated data. More specifically, we study the problem of locating clusters in spatially aggregated health data. The data is given as a subdivision into regions with two values per region, the number of cases and the size of the population at risk. We formulate the problem as finding a placement of a cluster window of a given shape such that a cluster function depending on the population at risk and the cases is maximized. We propose area-based models to calculate the cases (and the population at risk) within a cluster window. These models are based on the areas of intersection of the cluster window with the regions of the subdivision. We show how to compute a subdivision such that within each cell of the subdivision the areas of intersection are simple functions. We evaluate experimentally how taking aggregation into account influences the location of the clusters found.", "paper_title": "Processing aggregated data: the location of clusters in health data", "paper_id": "WOS:000300159500004"}