{"auto_keywords": [{"score": 0.0390108089770287, "phrase": "rectangle_stabbing"}, {"score": 0.01287634561421797, "phrase": "parameter_k"}, {"score": 0.00914563220428795, "phrase": "cochromatic_number"}, {"score": 0.009099312787110061, "phrase": "disjoint_rectangle"}, {"score": 0.004779231222328262, "phrase": "np"}, {"score": 0.004717723626157272, "phrase": "problem_rectangle_stabbing"}, {"score": 0.004622450915803531, "phrase": "set_r"}, {"score": 0.004598933498016774, "phrase": "axis-parallel_rectangles"}, {"score": 0.004529093447865156, "phrase": "set_l"}, {"score": 0.004506048850130758, "phrase": "horizontal_and_vertical_lines"}, {"score": 0.004195418010131832, "phrase": "selected_lines"}, {"score": 0.004058537607526872, "phrase": "polynomial_time"}, {"score": 0.003759398875210585, "phrase": "short_turing_machine_acceptance"}, {"score": 0.003351381374975648, "phrase": "set_cover"}, {"score": 0.0032836104153151973, "phrase": "consecutive-ones_property"}, {"score": 0.003096283272176435, "phrase": "special_case"}, {"score": 0.002934566917795928, "phrase": "non-overlapping_rectangles"}, {"score": 0.0025110337774260773, "phrase": "still_np-hard_case"}, {"score": 0.002422773998743726, "phrase": "disjoint_squares"}, {"score": 0.0023435922359103353, "phrase": "heggernes"}, {"score": 0.0022324858095648338, "phrase": "disjoint_rectangles_case"}, {"score": 0.0021985035933343405, "phrase": "fixed-parameter_tractability"}, {"score": 0.0021157891421445846, "phrase": "horizontal_line"}], "paper_keywords": ["Parameterized complexity", " Fixed-parameter algorithms", " Geometric covering problems", " Whardness"], "paper_abstract": "The NP-complete geometric covering problem Rectangle Stabbing is defined as follows: Given a set R of axis-parallel rectangles in the plane, a set L of horizontal and vertical lines in the plane, and a positive integer k, select at most k of the lines such that every rectangle is intersected by at least one of the selected lines. While it is known that the problem can be approximated in polynomial time within a factor of two, its parameterized complexity with respect to the parameter k was open so far. Giving two fixed-parameter reductions, one from the W[1]-complete problem Multicolored Clique and one to the W[1]-complete problem Short Turing Machine Acceptance, we prove that Rectangle Stabbing is W[1]-complete with respect to the parameter k, which in particular means that there is no hope for an algorithm running in f(k)a <...|Ra(a)L| (O(1)) time. Our reductions also show the W[1]-completeness of the more general problem Set Cover on instances that \"almost have the consecutive-ones property\", that is, on instances whose matrix representation has at most two blocks of 1s per row. We also show that the special case of Rectangle Stabbing where all rectangles are squares of the same size is W[1]-hard. The case where the input consists of non-overlapping rectangles was open for some time and has recently been shown to be fixed-parameter tractable (Heggernes et al., Fixed-parameter algorithms for cochromatic number and disjoint rectangle stabbing, 2009). By giving an algorithm running in (2k) (k) a <...|Ra(a)L| (O(1)) time, we show that Rectangle Stabbing is fixed-parameter tractable in the still NP-hard case where both these restrictions apply, that is, in the case of disjoint squares of the same size. This algorithm is faster than the one in Heggernes et al. (Fixed-parameter algorithms for cochromatic number and disjoint rectangle stabbing, 2009) for the disjoint rectangles case. Moreover, we show fixed-parameter tractability for the restrictions where the rectangles have bounded width or height or where each horizontal line intersects only a bounded number of rectangles.", "paper_title": "The Parameterized Complexity of Stabbing Rectangles", "paper_id": "WOS:000298388200025"}