{"auto_keywords": [{"score": 0.022186611017726822, "phrase": "gpa"}, {"score": 0.018228030144412048, "phrase": "depth_information"}, {"score": 0.017299067892262755, "phrase": "em-gpa"}, {"score": 0.00481495049065317, "phrase": "hidden_variables"}, {"score": 0.004623696669036629, "phrase": "generalized_procrustes_analysis"}, {"score": 0.0043576936014830875, "phrase": "shape_data"}, {"score": 0.0036591119109692545, "phrase": "image_plane"}, {"score": 0.0034484095283984443, "phrase": "covariance_matrix"}, {"score": 0.0033950003609696227, "phrase": "distinctive_characteristic"}, {"score": 0.0032906426750021153, "phrase": "rank_constraint"}, {"score": 0.0032094634756436595, "phrase": "gpa_constraints"}, {"score": 0.0030625949549620475, "phrase": "experimental_results"}, {"score": 0.002959167753690868, "phrase": "noise_level"}, {"score": 0.0028951712636442906, "phrase": "large_number"}, {"score": 0.0028771413440398614, "phrase": "missing_variables"}, {"score": 0.0028061343826918357, "phrase": "frgc_database"}, {"score": 0.0026944563649138713, "phrase": "missing_information"}, {"score": 0.00234834406550549, "phrase": "similar_success_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Shape alignment", " Procrustes analysis", " Non-rigid structure from motion", " Virtual 3D shape model"], "paper_abstract": "Aligning shapes is essential in many computer vision problems and generalized Procrustes analysis (GPA) is one of the most popular algorithms to align shapes. However, if some of the shape data are missing, GPA cannot be applied. In this paper, we propose EM-GPA, which extends GPA to handle shapes with hidden (missing) variables by using the expectation-maximization (EM) algorithm. For example, 2D shapes can be considered as 3D shapes with missing depth information due to the projection of 3D shapes into the image plane. For a set of 2D shapes, EM-GPA finds scales, rotations and 3D shapes along with their mean and covariance matrix for 3D shape modeling. A distinctive characteristic of EM-GPA is that it does not enforce any rank constraint often appeared in other work and instead uses GPA constraints to resolve the ambiguity in finding scales, rotations, and 3D shapes. The experimental results show that EM-GPA can recover depth information accurately even when the noise level is high and there are a large number of missing variables. By using the images from the FRGC database, we show that EM-GPA can successfully align 2D shapes by taking the missing information into consideration. We also demonstrate that the 3D mean shape and its covariance matrix are accurately estimated. As an application of EM-GPA, we construct a 2D + 3D AAM (active appearance model) using the 3D shapes obtained by EM-GPA, and it gives a similar success rate in model fitting compared to the method using real 3D shapes. EM-GPA is not limited to the case of missing depth information, but it can be easily extended to more general cases. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "EM-GPA: Generalized Procrustes analysis with hidden variables for 3D shape modeling", "paper_id": "WOS:000324791400001"}