{"auto_keywords": [{"score": 0.039512882459484054, "phrase": "ler"}, {"score": 0.015563822088740117, "phrase": "application-level_multicast"}, {"score": 0.00481495049065317, "phrase": "media_streaming"}, {"score": 0.0044870272550540415, "phrase": "packet_loss"}, {"score": 0.004288059466938456, "phrase": "timely_manner"}, {"score": 0.003469676666252421, "phrase": "independent_alm_tree"}, {"score": 0.003417565253539315, "phrase": "error_correlation"}, {"score": 0.0031208772639433145, "phrase": "nearby_nodes"}, {"score": 0.002952356518921907, "phrase": "recovery_delay"}, {"score": 0.002709589081384597, "phrase": "effective_error_recovery_mechanism"}, {"score": 0.0026554236621262515, "phrase": "low_overhead"}, {"score": 0.0026023381988430666, "phrase": "delivery_delay"}, {"score": 0.002486734224234698, "phrase": "physical_link_stress"}, {"score": 0.0024247382451294255, "phrase": "traditional_recovery_schemes"}, {"score": 0.0021049977753042253, "phrase": "reliable_proxies"}], "paper_keywords": ["application-level multicast (ALM)", " error recovery", " retransmission deadline", " streaming applications"], "paper_abstract": "We consider media streaming using application-level multicast (ALM) where packet loss has to be recovered via retransmission in a timely manner. Since packets may be lost due to congestion, node failures, and join and leave dynamics, traditional \"vertical\" recovery approach where upstream nodes retransmit the lost packets is no longer effective. We therefore propose lateral error recovery (LER). In LER, hosts are divided into a number of planes, each of which forms an independent ALM tree. Since error correlation across planes is low, a node effectively recovers its error by \"laterally\" requesting retransmission from nearby nodes in other planes. We present analysis on the complexity and recovery delay on LER. Using Internet-like topologies, we show via simulations that LER is an effective error recovery mechanism. It achieves low overhead in terms of delivery delay (i.e., relative delay penalty) and physical link stress. As compared with traditional recovery schemes, LER attains much lower residual loss rate (i.e., loss rate after retransmission) under a certain deadline constraint. The performance can be substantially improved in the presence of some reliable proxies.", "paper_title": "Lateral error recovery for media streaming in application-level multicast", "paper_id": "WOS:000236476300004"}