{"auto_keywords": [{"score": 0.040537135041717604, "phrase": "component_results"}, {"score": 0.015297261702605463, "phrase": "data_fusion"}, {"score": 0.008713768692145006, "phrase": "high_accuracy_retrieval"}, {"score": 0.005904578621781951, "phrase": "uneven_correlation"}, {"score": 0.0047273577269638725, "phrase": "uneven_correlation_effect"}, {"score": 0.004422354534938451, "phrase": "experimental_results"}, {"score": 0.004253618550301311, "phrase": "information_retrieval_community"}, {"score": 0.0035722806911457545, "phrase": "data_fusion_algorithms"}, {"score": 0.003459191419478298, "phrase": "better_performance"}, {"score": 0.0031845067058084583, "phrase": "different_weights"}, {"score": 0.0030554300179552415, "phrase": "linear_combination_method"}, {"score": 0.002931569771634119, "phrase": "extensive_experimentation"}, {"score": 0.0027741761880779535, "phrase": "six_groups"}, {"score": 0.0026494723416072316, "phrase": "text_retrieval_conference"}, {"score": 0.0023944552329463035, "phrase": "eight_data_fusion_methods"}, {"score": 0.0023507916951658455, "phrase": "best_component_system"}, {"score": 0.0022450768409733807, "phrase": "data_fusion_technique"}, {"score": 0.002183938718432764, "phrase": "accurate_retrieval_results"}, {"score": 0.0021049977753042253, "phrase": "six_methods"}], "paper_keywords": [""], "paper_abstract": "The aim of this research is twofold. On the one hand, high accuracy retrieval has been a concern of the information retrieval community for some time. We aim to investigate this issue via data fusion. On the other hand, the correlation among component results has been proven harmful to data fusion, but it has not been taken into account in data fusion algorithms. In the hope of achieving better performance, we propose a group of algorithms to eliminate the effect of uneven correlation among component results by assigning different weights to all component results or their combinations. Then the linear combination method or a variation is used for fusion. Extensive experimentation is carried out to evaluate the performances of these algorithms with six groups of component results, which are the top 10 systems submitted to Text REtrieval Conference (TREC) 6, 7, 8, 9, 2001, and 2002. The experimental results show that all eight data fusion methods involved outperform the best component system on average. Therefore, we demonstrate that the data fusion technique in general is effective with accurate retrieval results. The experimental results also demonstrate that all six methods presented in this article are effective for eliminating the effect of uneven correlation among component results. All of them outperform CombSum and five of them outperform CombMNZ on average.", "paper_title": "Improving high accuracy retrieval by eliminating the uneven correlation effect in data fusion", "paper_id": "WOS:000246285500009"}