{"auto_keywords": [{"score": 0.049347793578485864, "phrase": "optimization_problems"}, {"score": 0.00481495049065317, "phrase": "local_search_techniques"}, {"score": 0.004692980391580608, "phrase": "constraint_programming"}, {"score": 0.00421340730888561, "phrase": "standard_backtracking_procedures"}, {"score": 0.0040438338011467845, "phrase": "relaxation_process"}, {"score": 0.003724810609448597, "phrase": "problem_independent_parameters"}, {"score": 0.0035021127041237887, "phrase": "instance_level"}, {"score": 0.0030798711656591948, "phrase": "explanation-based_neighborhoods"}, {"score": 0.0028659990472580154, "phrase": "solver_event"}, {"score": 0.0028076592725295646, "phrase": "domain_modification"}, {"score": 0.0021267708018655493, "phrase": "new_use"}, {"score": 0.0021049977753042253, "phrase": "explanation-based_approaches"}], "paper_keywords": ["LNS", " Explanations", " Optimization", " Neighborhoods"], "paper_abstract": "One of the most well-known and widely used local search techniques for solving optimization problems in Constraint Programming is the Large Neighborhood Search (LNS) algorithm. Such a technique is, by nature, very flexible and can be easily integrated within standard backtracking procedures. One of its drawbacks is that the relaxation process is quite often problem dependent. Several works have been dedicated to overcome this issue through problem independent parameters. Nevertheless, such generic approaches need to be carefully parameterized at the instance level. In this paper, we demonstrate that the issue of finding a problem independent neighborhood generation technique for LNS can be addressed using explanation-based neighborhoods. An explanation is a subset of constraints and decisions which justifies a solver event such as a domain modification or a conflict. We evaluate our proposal for a set of optimization problems. We show that our approach is at least competitive with or even better than state-of-the-art algorithms and can be easily combined with state-of-the-art neighborhoods. Such results pave the way to a new use of explanation-based approaches for improving search.", "paper_title": "Explanation-based large neighborhood search", "paper_id": "WOS:000340535900001"}