{"auto_keywords": [{"score": 0.04953663923501101, "phrase": "multiagent_workflow_systems"}, {"score": 0.037878248909328095, "phrase": "organizational_structure"}, {"score": 0.03746316896806198, "phrase": "multiagent_workflow_system"}, {"score": 0.00481495049065317, "phrase": "multiagent_workflow_systems."}, {"score": 0.004600389726895716, "phrase": "organizational_structure_viewpoint"}, {"score": 0.0032487508969192293, "phrase": "social_laws"}, {"score": 0.002999274091205852, "phrase": "determined_social_laws"}, {"score": 0.002898291237210567, "phrase": "organization_structures"}, {"score": 0.0026003455833291124, "phrase": "social_law_adjustment_mechanism"}, {"score": 0.002527150892127982, "phrase": "interaction_relations"}, {"score": 0.0024984517279573906, "phrase": "temporal_flows"}, {"score": 0.0022933216359142736, "phrase": "useful_social_laws"}, {"score": 0.0021049977753042253, "phrase": "organization_structure"}], "paper_keywords": ["Multiagents", " .workflows", " coordination", " social laws", " social strategies", " organizational structures"], "paper_abstract": "The multiagent workflow systems can be formalized from an organizational structure viewpoint, which includes three parts: the interaction structure among agents, the temporal flow of activities, and the critical resource sharing relations among activities. While agents execute activities, they should decide their strategies to satisfy the constraints brought by the organizational structure of multiagent workflow system. To avoid collisions in the multiagent workflow system, this paper presents a method to determine social laws in the system to restrict the strategies of agents and activities; the determined social laws can satisfy the characteristics of organization structures so as to minimize the conflicts among agents and activities. Moreover, we also deal with the social law adjustment mechanism for the alternations of interaction relations, temporal flows, and critical resource sharing relations. It is proved that our model can produce useful social laws for organizational structure of multiagent workflow systems, i.e., the conflicts brought by the constraints of organization structure can be minimized.", "paper_title": "ORGANIZATIONAL STRUCTURE-SATISFACTORY SOCIAL LAW DETERMINATION IN MULTIAGENT WORKFLOW SYSTEMS", "paper_id": "WOS:000281993100003"}