{"auto_keywords": [{"score": 0.04418988137253732, "phrase": "np"}, {"score": 0.020575918827196338, "phrase": "identifying_code"}, {"score": 0.010610479517817593, "phrase": "locating-dominating_codes"}, {"score": 0.008056050145964047, "phrase": "random_unit_disk_graphs"}, {"score": 0.004597951649247307, "phrase": "wireless_devices"}, {"score": 0.004441616106463486, "phrase": "unit_disk_graphs"}, {"score": 0.0041446453895708, "phrase": "bipartite_graphs"}, {"score": 0.0038674532861321864, "phrase": "bipartite_planar_unit_disk_graphs"}, {"score": 0.003290403747743492, "phrase": "interesting_ranges"}, {"score": 0.003093893243443715, "phrase": "sharp_contrast"}, {"score": 0.003046621804854539, "phrase": "random_graphs"}, {"score": 0.003011641380351574, "phrase": "erdos-renyi_model"}, {"score": 0.002977061391551628, "phrase": "well-studied_class"}, {"score": 0.002446245096967702, "phrase": "arbitrary_planar_unit_disk_graphs"}, {"score": 0.002381169982803105, "phrase": "minimum_size"}], "paper_keywords": [""], "paper_abstract": "We model a problem about networks built from wireless devices using identifying and locating-dominating codes in unit disk graphs. It is known that minimizing the size of an identifying code is NP-complete even for bipartite graphs. First, we improve this result by showing that the problem remains NP-complete for bipartite planar unit disk graphs. Then, we address the question of the existence of an identifying code for random unit disk graphs. We derive the probability that there exists an identifying code as a function of the radius of the disks, anti we find that for all interesting ranges of r this probability is bounded away from one. The results obtained are in sharp contrast to those concerning random graphs in the Erdos-Renyi model. Another well-studied class of codes is that of locating-dominating codes, which are less demanding than identifying codes. A locating-dominating code always exists, but minimizing its size is still NP-complete in general. We extend this result to our setting by showing that this question remains NP-complete for arbitrary planar unit disk graphs. Finally, we study the minimum size of such a code in random unit disk graphs, and we prove that with probability tending to one, it is of size (n/r)(2/3+o(1)) if r <= root 2/2 - epsilon is chosen such that nr(2) -> infinity, and of size n(1+o(1)) if nr(2) << In n.", "paper_title": "Identifying and Locating-Dominating Codes in (Random) Geometric Networks", "paper_id": "WOS:000271683800005"}