{"auto_keywords": [{"score": 0.04212605833820738, "phrase": "systematic_mapping"}, {"score": 0.013919273609361977, "phrase": "software_engineering"}, {"score": 0.00916269408841909, "phrase": "project_management"}, {"score": 0.00481495049065317, "phrase": "software_engineering_-_a"}, {"score": 0.004740013831424493, "phrase": "gamification"}, {"score": 0.004666228956744244, "phrase": "user's_engagement"}, {"score": 0.004475022550508119, "phrase": "game_mechanics"}, {"score": 0.003610929883213109, "phrase": "primary_studies"}, {"score": 0.00358268558646118, "phrase": "existing_literature"}, {"score": 0.0034628156490003775, "phrase": "software_process_area"}, {"score": 0.003364514629929572, "phrase": "research_method"}, {"score": 0.003234934827553253, "phrase": "subjective_evaluation"}, {"score": 0.002860269306587213, "phrase": "software_development"}, {"score": 0.002823050755743821, "phrase": "lesser_extent"}, {"score": 0.0026440787148665707, "phrase": "empirical_evidence"}, {"score": 0.0024377918036784336, "phrase": "future_research_work"}, {"score": 0.0023809668146961313, "phrase": "basic_ones"}, {"score": 0.0023561372852985625, "phrase": "software_process_areas"}, {"score": 0.0022124922742064947, "phrase": "methodological_support"}, {"score": 0.002127186380459509, "phrase": "organization's_existing_tools"}, {"score": 0.0021049977753042253, "phrase": "important_challenge"}], "paper_keywords": ["Gamification", " Software engineering", " Systematic mapping"], "paper_abstract": "Context: Gamification seeks for improvement of the user's engagement, motivation, and performance when carrying out a certain task, by means of incorporating game mechanics and elements, thus making that task more attractive. Much research work has studied the application of gamification in software engineering for increasing the engagement and results of developers. Objective: The objective of this paper is to carry out a systematic mapping of the field of gamification in software engineering in an attempt to characterize the state of the art of this field identifying gaps and opportunities for further research. Method: We carried out a systematic mapping with a view to finding the primary studies in the existing literature, which were later classified and analyzed according to four criteria: the software process area addressed, the gamification elements used, the type of research method followed, and the type of forum in which they were published. A subjective evaluation of the studies was also carried out to evaluate them in terms of methodology, empirical evidence, integration with the organization, and replicability. Results: As a result of the systematic mapping we found 29 primary studies, published between January 2011 and June 2014. Most of them focus on software development, and to a lesser extent, requirements, project management, and other support areas. In the main, they consider very simple gamification mechanics such as points and badges, and few provide empirical evidence of the impact of gamification. Conclusions: Existing research in the field is quite preliminary, and more research effort analyzing the impact of gamification in SE would be needed. Future research work should look at other game mechanics in addition to the basic ones and should tackle software process areas that have not been fully studied, such as requirements, project management, maintenance, or testing. Most studies share a lack of methodological support that would make their proposals replicable in other settings. The integration of gamification with an organization's existing tools is also an important challenge that needs to be taken up in this field. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Gamification in software engineering - A systematic mapping", "paper_id": "WOS:000345947500010"}