{"auto_keywords": [{"score": 0.028532901827645035, "phrase": "sensor-cloud_infrastructure"}, {"score": 0.0045543011700929096, "phrase": "critical_infrastructure_monitoring"}, {"score": 0.004515467468684217, "phrase": "environment_monitoring"}, {"score": 0.0040223714916651845, "phrase": "efficient_management"}, {"score": 0.003971006689166329, "phrase": "large_number"}, {"score": 0.003937126962709418, "phrase": "wsns_data"}, {"score": 0.003837205620832367, "phrase": "important_issue"}, {"score": 0.003359816816853762, "phrase": "wsn_data"}, {"score": 0.00319134078848996, "phrase": "processed_information"}, {"score": 0.003137074867443131, "phrase": "inherently_complex_models"}, {"score": 0.0029925402963843282, "phrase": "cloud_computing"}, {"score": 0.0029416448256236057, "phrase": "promising_technology"}, {"score": 0.0028916124463906983, "phrase": "flexible_stack"}, {"score": 0.0027702126237754625, "phrase": "low_cost"}, {"score": 0.0024356742694508662, "phrase": "comprehensive_study"}, {"score": 0.0024148618915672353, "phrase": "representative_works"}, {"score": 0.002283839204519042, "phrase": "sensor-cloud_platform"}, {"score": 0.002178529882942255, "phrase": "research_challenges"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": [""], "paper_abstract": "Nowadays, wireless sensor network (WSN) applications have been used in several important areas, such as healthcare, military, critical infrastructure monitoring, environment monitoring, and manufacturing. However, due to the limitations of WSNs in terms of memory, energy, computation, communication, and scalability, efficient management of the large number of WSNs data in these areas is an important issue to deal with. There is a need for a powerful and scalable high-performance computing and massive storage infrastructure for real-time processing and storing of the WSN data as well as analysis (online and offline) of the processed information under context using inherently complex models to extract events of interest. In this scenario, cloud computing is becoming a promising technology to provide a flexible stack of massive computing, storage, and software services in a scalable and virtualized manner at low cost. Therefore, in recent years, Sensor-Cloud infrastructure is becoming popular that can provide an open, flexible, and reconfigurable platform for several monitoring and controlling applications. In this paper, we present a comprehensive study of representative works on Sensor-Cloud infrastructure, which will provide general readers an overview of the Sensor-Cloud platform including its definition, architecture, and applications. The research challenges, existing solutions, and approaches as well as future research directions are also discussed in this paper.", "paper_title": "A Survey on Sensor-Cloud: Architecture, Applications, and Approaches", "paper_id": "WOS:000315877000001"}