{"auto_keywords": [{"score": 0.04808171687412103, "phrase": "ge"}, {"score": 0.00481495049065317, "phrase": "multi-layer_gene_regulatory_modules"}, {"score": 0.004774115617883476, "phrase": "multi-dimensional_genomic_data"}, {"score": 0.004516962628112147, "phrase": "precisely_coordinated_multi-layer_controls"}, {"score": 0.004310173770196077, "phrase": "emerging_multi-dimensional_genomic_dataset"}, {"score": 0.0041657281535389615, "phrase": "cross-layer_regulatory_interplay"}, {"score": 0.0039077616208517026, "phrase": "genomic_activities"}, {"score": 0.0034828730516958807, "phrase": "suitable_analysis_methods"}, {"score": 0.003211788912325178, "phrase": "multi-dimensional_regulatory_modules"}, {"score": 0.0030908254851076005, "phrase": "multi-dimensional_regulatory_module"}, {"score": 0.003038532168038562, "phrase": "regulatory_factors"}, {"score": 0.0030127172247606812, "phrase": "different_layers"}, {"score": 0.0028992294924613327, "phrase": "local_'gene_expression_factory"}, {"score": 0.0027662954811372175, "phrase": "simulated_data"}, {"score": 0.002475755804232436, "phrase": "identified_modules"}, {"score": 0.0024547103576350233, "phrase": "significant_functional_and_transcriptional_enrichment"}, {"score": 0.0022346658207822623, "phrase": "cnv"}, {"score": 0.002123051344001408, "phrase": "important_oncogenes"}, {"score": 0.0021049977753042253, "phrase": "tumor_suppressor_genes"}], "paper_keywords": [""], "paper_abstract": "Motivation: Eukaryotic gene expression (GE) is subjected to precisely coordinated multi-layer controls, across the levels of epigenetic, transcriptional and post-transcriptional regulations. Recently, the emerging multi-dimensional genomic dataset has provided unprecedented opportunities to study the cross-layer regulatory interplay. In these datasets, the same set of samples is profiled on several layers of genomic activities, e. g. copy number variation (CNV), DNA methylation (DM), GE and microRNA expression (ME). However, suitable analysis methods for such data are currently sparse. Results: In this article, we introduced a sparse Multi-Block Partial Least Squares (sMBPLS) regression method to identify multi-dimensional regulatory modules from this new type of data. A multi-dimensional regulatory module contains sets of regulatory factors from different layers that are likely to jointly contribute to a local 'gene expression factory'. We demonstrated the performance of our method on the simulated data as well as on The Cancer Genomic Atlas Ovarian Cancer datasets including the CNV, DM, ME and GE data measured on 230 samples. We showed that majority of identified modules have significant functional and transcriptional enrichment, higher than that observed in modules identified using only a single type of genomic data. Our network analysis of the modules revealed that the CNV, DM and microRNA can have coupled impact on expression of important oncogenes and tumor suppressor genes.", "paper_title": "Identifying multi-layer gene regulatory modules from multi-dimensional genomic data", "paper_id": "WOS:000309687500008"}