{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "flight_control"}, {"score": 0.004678785623021003, "phrase": "autonomous_unmanned_aerial_vehicles"}, {"score": 0.004520438007604407, "phrase": "fuzzy_logic"}, {"score": 0.0040767015025213625, "phrase": "main_navigation_system"}, {"score": 0.0036763623220059933, "phrase": "global_position"}, {"score": 0.003511246498068952, "phrase": "air_vehicle"}, {"score": 0.0032585499655442404, "phrase": "fuzzy_based_controllers"}, {"score": 0.0031845067058084613, "phrase": "time_based_diagrams"}, {"score": 0.0031481164109237636, "phrase": "matlab's_standard_configuration"}, {"score": 0.0030414140732789186, "phrase": "complete_set"}, {"score": 0.0029722900280316216, "phrase": "rapid_development"}, {"score": 0.0025596276616952516, "phrase": "flightgear_flight_simulator_and_gms_aircraft_instruments"}, {"score": 0.0024586427394152196, "phrase": "visual_outputs"}, {"score": 0.002268441347979241, "phrase": "simple_design_procedure"}, {"score": 0.0022296340517805125, "phrase": "simulated_test_flights"}, {"score": 0.0021049977753042253, "phrase": "desired_performance"}], "paper_keywords": ["Fuzzy logic based autonomous flight computer design", " UAV's SID", " TACAN visual simulation"], "paper_abstract": "This paper proposes a fuzzy logic based autonomous navigation controller for UAVs (unmanned aerial vehicles). Three fuzzy logic modules are developed under the main navigation system for the control of the altitude, the speed, and the heading, through which the global position (latitude-longitude) of the air vehicle is controlled. A SID (Standard Instrument Departure) and TACAN (Tactical Air Navigation) approach is used and the performance of the fuzzy based controllers is evaluated with time based diagrams under MATLAB's standard configuration and the Aerosim Aeronautical Simulation Block Set which provides a complete set of tools for rapid development of detailed six-degree-of-freedom nonlinear generic manned/unmanned aerial vehicle models. The Aerosonde UAV model is used in the simulations in order to demonstrate the performance and the potential of the controllers. Additionally, FlightGear Flight Simulator and GMS aircraft instruments are deployed in order to get visual outputs that aid the designer in the evaluation of the controllers. Despite the simple design procedure, the simulated test flights indicate the capability of the approach in achieving the desired performance.", "paper_title": "Fuzzy Logic Based Approach to Design of Flight Control and Navigation Tasks for Autonomous Unmanned Aerial Vehicles", "paper_id": "WOS:000264484900013"}