{"auto_keywords": [{"score": 0.04545470944837335, "phrase": "text_classifiers"}, {"score": 0.015719716506582538, "phrase": "support_vector_machines"}, {"score": 0.00453113241842654, "phrase": "neural_networks"}, {"score": 0.004494580710399511, "phrase": "nns"}, {"score": 0.004212453011596424, "phrase": "best_classifiers"}, {"score": 0.003806541299696042, "phrase": "text_documents"}, {"score": 0.003495855671790616, "phrase": "text_classification"}, {"score": 0.003223494720348768, "phrase": "significantly_reduced_document_size"}, {"score": 0.002796782643988021, "phrase": "successful_use"}, {"score": 0.002740607717745287, "phrase": "reduced_text_documents"}, {"score": 0.002674681176379472, "phrase": "classification_tool"}, {"score": 0.002568299907890696, "phrase": "great_savings"}, {"score": 0.002526938673434697, "phrase": "computation_time"}, {"score": 0.0022371907579775796, "phrase": "best_text_classifiers"}, {"score": 0.002165688807780663, "phrase": "first_step"}, {"score": 0.0021221627745801478, "phrase": "text_mining"}], "paper_keywords": ["Artificial intelligence", " Neural nets", " Knowledge management", " Document management", " Classification"], "paper_abstract": "Purpose - The purpose of this paper is to compare the performance of neural networks (NNs) and support vector machines (SVMs) as text classifiers. SVMs are considered one of the best classifiers. NNs could be adopted as text classifiers if their performance is comparable to that of SVMs. Design/methodology/approach - Several NNs are trained to classify the same set of text documents with SVMs and their effectiveness is measured. The performance of the two tools is then statistically compared. Findings - For text classification (TC), the performance of NNs is statistically comparable to that of the SVMs even when a significantly reduced document size is used. Practical implications - This research finds not only that NNs are very viable TC tools with comparable performance to SVMs, but also that it does so using a much reduced size of document. The successful use of NNs in classifying reduced text documents would be its great advantage as a classification tool, compared to others, as it can bring great savings in terms of computation time and costs. Originality/value - This paper is of value by showing statistically that NNs could be adopted as text classifiers with effectiveness comparable to SVMs, one of the best text classifiers currently used. This research is the first step towards utilizing NNs in text mining and its sub-areas.", "paper_title": "Text classification: neural networks vs support vector machines", "paper_id": "WOS:000268623900007"}