{"auto_keywords": [{"score": 0.04001410485978454, "phrase": "communication_patterns"}, {"score": 0.03378755630941467, "phrase": "ehr_use"}, {"score": 0.011047669334372711, "phrase": "within-practice_communication_patterns"}, {"score": 0.010997946842042132, "phrase": "practice-level_ehr_use_patterns"}, {"score": 0.008052339373852668, "phrase": "standardized_ehr_use"}, {"score": 0.007705535793158818, "phrase": "ehr_use_patterns"}, {"score": 0.007006643447720993, "phrase": "practice_communication_patterns"}, {"score": 0.006757281006284597, "phrase": "six_practices"}, {"score": 0.0060608721293277795, "phrase": "practice-level_ehr_use"}, {"score": 0.00481495049065317, "phrase": "practice_member_communication_patterns"}, {"score": 0.004760617860507055, "phrase": "ambulatory_care"}, {"score": 0.004674952036988355, "phrase": "ambulatory_care_organizations"}, {"score": 0.004611711129049774, "phrase": "electronic_health_records"}, {"score": 0.004371684442911149, "phrase": "respectful_interaction"}, {"score": 0.004070276454809864, "phrase": "direct_observation"}, {"score": 0.003987914479119099, "phrase": "medical_assistants"}, {"score": 0.003969838436551289, "phrase": "practice_managers"}, {"score": 0.003942877273973905, "phrase": "non-clinical_staff"}, {"score": 0.00385431710959668, "phrase": "practice_relationships"}, {"score": 0.0035515951985356374, "phrase": "feature_use"}, {"score": 0.0035194572615570977, "phrase": "ehr-enabled_communication"}, {"score": 0.003424771860049617, "phrase": "interview_and_observation_data"}, {"score": 0.0028293966058473476, "phrase": "additional_analysis"}, {"score": 0.0027407299369891502, "phrase": "high_levels"}, {"score": 0.0026488028346866714, "phrase": "low_levels"}, {"score": 0.0025195105817758454, "phrase": "major_fallacy"}, {"score": 0.002502374576203785, "phrase": "homogeneous_ehr_use"}, {"score": 0.0024460897937643032, "phrase": "uniformly_low_ehr_use"}, {"score": 0.0024074435937463776, "phrase": "uniformly_high_ehr_use"}, {"score": 0.0023319690217532183, "phrase": "current_ehr_adoption"}, {"score": 0.0022691583532333695, "phrase": "practice_members"}, {"score": 0.0021682027434117095, "phrase": "human_element"}, {"score": 0.002138799283553239, "phrase": "key_lessons"}], "paper_keywords": [""], "paper_abstract": "Objective Despite efforts made by ambulatory care organizations to standardize the use of electronic health records (EHRs), practices often incorporate these systems into their work differently from each other. One potential factor contributing to these differences is within-practice communication patterns. The authors explore the linkage between within-practice communication patterns and practice-level EHR use patterns. Design Qualitative study of six practices operating within the same multi-specialty ambulatory care organization using the same EHR system. Semistructured interviews and direct observation were conducted with all physicians, nurses, medical assistants, practice managers, and non-clinical staff from each practice. Measurements An existing model of practice relationships was used to analyze communication patterns within the practices. Practice-level EHR use was defined and analyzed as the ways in which a practice uses an EHR as a collective or a group-including the degree of feature use, level of EHR-enabled communication, and frequency that EHR use changes in a practice. Interview and observation data were analyzed for themes. Based on these themes, within-practice communication patterns were categorized as fragmented or cohesive, and practice-level EHR use patterns were categorized as heterogeneous or homogeneous. Practices where EHR use was uniformly high across all users were further categorized as having standardized EHR use. Communication patterns and EHR use patterns were compared across the six practices. Results Within-practice communication patterns were associated with practice-level EHR use patterns. In practices where communication patterns were fragmented, EHR use was heterogeneous. In practices where communication patterns were cohesive, EHR use was homogeneous. Additional analysis revealed that practices that had achieved standardized EHR use (uniformly high EHR use across all users) exhibited high levels of mindfulness and respectful interaction, whereas practices that were furthest from achieving standardized EHR use exhibited low levels of mindfulness and respectful interaction. Conclusion Within-practice communication patterns provide a unique perspective for exploring the issue of standardization in EHR use. A major fallacy of setting homogeneous EHR use as the goal for practice-level EHR use is that practices with uniformly low EHR use could be considered successful. Achieving uniformly high EHR use across all users in a practice is more consistent with the goals of current EHR adoption and use efforts. It was found that some communication patterns among practice members may enable more standardized EHR use than others. Understanding the linkage between communication patterns and EHR use can inform understanding of the human element in EHR use and may provide key lessons for the implementation of EHRs and other health information technologies.", "paper_title": "Same organization, same electronic health records (EHRs) system, different use: exploring the linkage between practice member communication patterns and EHR use patterns in an ambulatory care setting", "paper_id": "WOS:000302783600010"}