{"auto_keywords": [{"score": 0.04522579410150119, "phrase": "bc"}, {"score": 0.007030103007612012, "phrase": "specific_cybernetics"}, {"score": 0.004787309936374976, "phrase": "basic_guidelines"}, {"score": 0.004691805714620268, "phrase": "business_systems"}, {"score": 0.004403823349864079, "phrase": "general_methodology"}, {"score": 0.004378532515411219, "phrase": "requisitely_holistic_thinking"}, {"score": 0.0043533862892678864, "phrase": "business_cybernetics"}, {"score": 0.00363080961099728, "phrase": "findings_bc"}, {"score": 0.0035685647258810738, "phrase": "specific_cybernetic_dealing"}, {"score": 0.0033979190960152436, "phrase": "previous_cognitions"}, {"score": 0.003378385493203297, "phrase": "possible_approaches"}, {"score": 0.002833479895505502, "phrase": "dialectical_systems_theory"}, {"score": 0.0027929100418926725, "phrase": "requisite_holism"}, {"score": 0.0027608716347791266, "phrase": "dialectical_system"}, {"score": 0.0027370835853738626, "phrase": "synergetic_networks"}, {"score": 0.0027134999393695542, "phrase": "essential_kinds"}, {"score": 0.0026211746739675927, "phrase": "qualitative_analysis"}, {"score": 0.0026060946618700416, "phrase": "desk_research"}, {"score": 0.002591101181961524, "phrase": "practical_experience"}, {"score": 0.002488528581414211, "phrase": "general_approach"}, {"score": 0.0023969131085585602, "phrase": "human_activity"}, {"score": 0.002383120224166142, "phrase": "specific_characteristics"}, {"score": 0.0022365262201954643, "phrase": "available_literature"}, {"score": 0.0021981315377404245, "phrase": "similar_concept"}], "paper_keywords": ["Business analysis", " Cybernetics", " Systems theory", " Research methods"], "paper_abstract": "Purpose - The purpose of this paper is to suggest a more holistic definition and basic guidelines for implementation of specific cybernetics dealing with business systems (BSs) from the viewpoint of managing them. The paper aims to consider three problems: how to develop a general methodology of requisitely holistic thinking for business cybernetics (BC) and its application; how to consider the attributes of BC (e.g. all attributes of BC and their generalization in BSs); and how to recognize and define relations between attributes of BC and their synergies. Design/methodology/approach In this paper, qualitative analysis on the basis of the cybernetics (e.g. especially general cybernetics), BC (different) systems theories, and dialectical systems theory is applied. Findings BC is shown to be a specific cybernetic dealing with BSs from viewpoint of managing/impacting on them. Thus, BC is trying to complete previous cognitions about possible approaches for managing/impacting on BSs. It covers the basic, information, and managerial processes, their interdependences, the resulting interaction and synergies. In addition, BC is also trying to make room for consideration of the general, group-specific, and individual part: of attributes of BSs. BC itself is based an the concept of the Dialectical Systems Theory that the law of requisite holism is met by dialectical system which creates synergetic networks of all essential kinds of cybernetics. Research limitations/implications Research is limited to three hypotheses and qualitative analysis in desk research. Practical experience is considered implicitly. Practical implications - Authors falsifying the practice of prevailing general approach to researching and understanding of management in BSs (as an area of human activity with specific characteristics) from cybernetics, viewpoint. This paper suggests a more specifically created and target-oriented approach for cybernetic understanding and researching of BSs. Originality/value The available literature does not provide for a similar concept and/or model of specific cybernetics dealing with BSs from the viewpoint of managing BSs or their impact.", "paper_title": "Business cybernetics - provocation number two", "paper_id": "WOS:000264459300013"}