{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "proposed_method"}, {"score": 0.00773415121036628, "phrase": "covariance_descriptors"}, {"score": 0.00481495049065317, "phrase": "novel_method"}, {"score": 0.004714023408114857, "phrase": "head_yaw_rotation"}, {"score": 0.004151188559520802, "phrase": "yaw_rotation"}, {"score": 0.0035786000713014625, "phrase": "effective_combination"}, {"score": 0.0035408501923902477, "phrase": "gabor_filters"}, {"score": 0.0033402290755205908, "phrase": "gabor"}, {"score": 0.003270092550315648, "phrase": "input_face_image"}, {"score": 0.0030199761431186434, "phrase": "gabor_representations"}, {"score": 0.002879158342988017, "phrase": "covariance_matrix"}, {"score": 0.0024423826953133844, "phrase": "metric_learning_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Head pose estimation", " Covariance descriptors", " Gabor filters", " Symmetry"], "paper_abstract": "This paper proposes a novel method to estimate the head yaw rotation using the symmetry of regions. We argue that the symmetry of 2D regions located in the same horizontal row is more intrinsically relevant to the yaw rotation of head than the symmetry of 1D signals, while at the same time insensitive to the identity of the face. Specifically, the proposed method relies on the effective combination of Gabor filters and covariance descriptors. We first extract the multi-scale and multi-orientation Gabor representations of the input face image, and then use covariance descriptors to compute the symmetry between two regions in terms of Gabor representations under the same scale and orientation. Since the covariance matrix can alleviate the influence caused by rotations and illumination, the proposed method is robust to such variations. In addition, the proposed method is further improved by combining it with a metric learning method named aa KISS MEtric learning (KISSME). Experiments on four challenging databases demonstrated that the proposed method outperformed the state of the art. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "CovGa: A novel descriptor based on symmetry of regions for head pose estimation", "paper_id": "WOS:000340982800011"}