{"auto_keywords": [{"score": 0.03189593629442219, "phrase": "base_station"}, {"score": 0.00481495049065317, "phrase": "energy-efficient_multiuser_scheduling"}, {"score": 0.004558414405811025, "phrase": "energy-efficient_uplink_scheduling"}, {"score": 0.004424268136268051, "phrase": "multiuser_wireless_system"}, {"score": 0.004189044021270879, "phrase": "markov"}, {"score": 0.0038102613924627647, "phrase": "hard_constraint"}, {"score": 0.0034317185678527672, "phrase": "state-space_explosion"}, {"score": 0.003264872488939969, "phrase": "individual_cmdps"}, {"score": 0.0029111767710750117, "phrase": "unknown_channel"}, {"score": 0.0028822890425197582, "phrase": "arrival_statistics"}, {"score": 0.0028113140998735366, "phrase": "reinforcement_learning_algorithm"}, {"score": 0.0027284410545226306, "phrase": "learning_algorithm"}, {"score": 0.0023609780669713288, "phrase": "highest_rate"}], "paper_keywords": ["Multiuser fading channel", " constrained Markov decision process", " energy-efficient scheduling", " learning algorithm"], "paper_abstract": "In this paper, we consider the problem of energy-efficient uplink scheduling with delay constraint for a multiuser wireless system. We address this problem within the framework of constrained Markov decision processes (CMDPs) wherein one seeks to minimize one cost (average power) subject to a hard constraint on another (average delay). We do not assume the arrival and channel statistics to be known. To handle state-space explosion and informational constraints, we split the problem into individual CMDPs for the users, coupled through their Lagrange multipliers; and a user selection problem at the base station. To address the issue of unknown channel and arrival statistics, we propose a reinforcement learning algorithm. The users use this learning algorithm to determine the rate at which they wish to transmit in a slot and communicate this to the base station. The base station then schedules the user with the highest rate in a slot. We analyze convergence, stability, and optimality properties of the algorithm. We also demonstrate the efficacy of the algorithm through simulations within IEEE 802.16 system.", "paper_title": "A Stable Online Algorithm for Energy-Efficient Multiuser Scheduling", "paper_id": "WOS:000280948900003"}