{"auto_keywords": [{"score": 0.03829167739319402, "phrase": "absolutely_minimal_realizations"}, {"score": 0.015719716506582524, "phrase": "minimal_realizations"}, {"score": 0.004758053266234474, "phrase": "multidimensional_systems"}, {"score": 0.004483450050677258, "phrase": "state-space_realization"}, {"score": 0.004378079133208604, "phrase": "roesser"}, {"score": 0.0037507793596022326, "phrase": "causal_systems"}, {"score": 0.00368442237104581, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0031374619658664843, "phrase": "grobner_basis_approach"}, {"score": 0.002991524908432975, "phrase": "sufficient_condition"}, {"score": 0.0027852126030055305, "phrase": "symbolic_method"}, {"score": 0.0027358910467781155, "phrase": "simple_necessary_conditions"}, {"score": 0.0025776913268808124, "phrase": "two-step_approach"}, {"score": 0.0021049977753042253, "phrase": "realization_methods"}], "paper_keywords": ["Multidimensional systems", " State-space realization", " Minimal realization", " Roesser model", " Symbolic approach", " Grobner basis"], "paper_abstract": "In this paper, we formalize two related but different notions for state-space realization of multidimensional () single-input-single-output discrete systems in Roesser model, namely the \"absolutely minimal realization\" and the \"minimal realization\". We then focus our study mainly on first-degree 2D and 3D causal systems. A necessary and sufficient condition for absolutely minimal realizations is given for first-degree 2D systems. It is then shown that first-degree 2D systems that do not admit absolutely minimal realizations always admit minimal realizations of order 3. A Grobner basis approach is also proposed which leads to a sufficient condition for the absolutely minimal realizations of some higher-degree 2D systems. We then present a symbolic method that gives simple necessary conditions for the existence of absolutely minimal realizations for first-degree 3D systems. A two-step approach to absolutely minimal realizations for first-degree 3D systems is then presented, followed by techniques for minimal realizations of first-degree 3D systems. Throughout the paper, several non-trivial examples are illustrated with the aim of helping the reader to apply the realization methods proposed in this paper.", "paper_title": "Notes on minimal realizations of multidimensional systems", "paper_id": "WOS:000350570900010"}