{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "enterprise_architecture"}, {"score": 0.031017232280373307, "phrase": "enterprise_architecture_components"}, {"score": 0.012064859144111314, "phrase": "communication_problems"}, {"score": 0.009928465580783046, "phrase": "business_terms"}, {"score": 0.004735254735115024, "phrase": "comprehensive_description"}, {"score": 0.004637478829869904, "phrase": "key_elements"}, {"score": 0.004108742905942481, "phrase": "enterprise_integration"}, {"score": 0.004040688646993605, "phrase": "dynamically_changing_business_environment"}, {"score": 0.004007083686875716, "phrase": "existing_enterprise_architectures"}, {"score": 0.0035648266669315943, "phrase": "human_and_system"}, {"score": 0.003265365666305185, "phrase": "ontology-based_enterprise_architecture"}, {"score": 0.0031579997262619758, "phrase": "enterprise_architecture_ontology"}, {"score": 0.002978508766388785, "phrase": "first_level"}, {"score": 0.0028805474861014722, "phrase": "second_level"}, {"score": 0.0027510752634224726, "phrase": "top_level"}, {"score": 0.0026055429935095435, "phrase": "wordnet"}, {"score": 0.00227914162528171, "phrase": "enterprise_architectures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Enterprise Architecture", " Ontology-based Enterprise Architecture", " Enterprise ontology"], "paper_abstract": "The Enterprise Architecture refers to a comprehensive description of all of the key elements and relationships that make up an organization [Harmon, P. (2003) Developing an Enterprise Architecture, Business process trends: Whitepaper]. Through the Enterprise Architecture, enterprises can implement enterprise integration to cope with dynamically changing business environment. Existing Enterprise Architectures, however, lack of semantics for humans and systems to understand them exactly and commonly, which causes communication problems between humans or between systems or between human and system. These communication problems keep enterprises from implementing integration and collaborating with other enterprises In order to solve this problem, the ontology-based Enterprise Architecture is suggested in this paper. The Enterprise Architecture ontology is composed of ontologies in three levels. Ontologies of business terms are in the first level, ontologies of Enterprise Architecture components are in the second level, and ontologies of relationships among Enterprise Architecture components are in the top level. The ontologies of business terms are defined in the approach of the WordNet, and the ontologies of Enterprise Architecture components and relationships of them are defined in the approach of the SBVR. Through these ontologies, it is expected that humans and systems can understand Enterprise Architectures exactly and commonly, which supports integrations in enterprises and collaborations between enterprises. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An ontology-based Enterprise Architecture", "paper_id": "WOS:000272432300065"}