{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_theory"}, {"score": 0.03744282073700833, "phrase": "different_kinds"}, {"score": 0.004569293780076254, "phrase": "mind_claim"}, {"score": 0.003726967166630923, "phrase": "syntactically_structured_mental_representations"}, {"score": 0.003662410853488772, "phrase": "syntactically_structured_representations"}, {"score": 0.0033952989364738353, "phrase": "mental_processes"}, {"score": 0.0030750809317435304, "phrase": "minor_role"}, {"score": 0.003039445153076014, "phrase": "mental_activity"}, {"score": 0.0029694040368299624, "phrase": "contemporary_neuroscience"}, {"score": 0.0029349892964423197, "phrase": "experimental_evidence"}, {"score": 0.002884111441153185, "phrase": "mental_representations"}, {"score": 0.002536926192232391, "phrase": "causal_properties"}, {"score": 0.0024072121760839427, "phrase": "empirical_studies"}, {"score": 0.0021049977753042253, "phrase": "artificial_mind"}], "paper_keywords": ["Consciousness", " Mental representation", " Mental causation", " Computational theory of mind"], "paper_abstract": "Advocates of the computational theory of mind claim that the mind is a computer whose operations can be implemented by various computational systems. According to these philosophers, the mind is multiply realisable because-as they claim-thinking involves the manipulation of syntactically structured mental representations. Since syntactically structured representations can be made of different kinds of material while performing the same calculation, mental processes can also be implemented by different kinds of material. From this perspective, consciousness plays a minor role in mental activity. However, contemporary neuroscience provides experimental evidence suggesting that mental representations necessarily involve consciousness. Consciousness does not only enable individuals to become aware of their own thoughts, it also constantly changes the causal properties of these thoughts. In light of these empirical studies, mental representations appear to be intrinsically dependent on consciousness. This discovery represents an obstacle to any attempt to construct an artificial mind.", "paper_title": "Conscious Representations: An Intractable Problem for the Computational Theory of Mind", "paper_id": "WOS:000289986800003"}