{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "kdd"}, {"score": 0.04930048772453134, "phrase": "description_logic"}, {"score": 0.0419964371035412, "phrase": "kdd_process"}, {"score": 0.0378341644203185, "phrase": "data_preparation_phase"}, {"score": 0.03248053856265788, "phrase": "xml_data_source"}, {"score": 0.0289534638851859, "phrase": "data_mining_techniques"}, {"score": 0.004783483480147339, "phrase": "automatic_reasoning"}, {"score": 0.004690305164360866, "phrase": "data_preparation"}, {"score": 0.00465964893087681, "phrase": "data_mining_algorithms"}, {"score": 0.004539005582217309, "phrase": "knowledge_discovery"}, {"score": 0.00433531459712787, "phrase": "later_kdd_phases"}, {"score": 0.004264795176205885, "phrase": "data_preparation_stage"}, {"score": 0.003703611021999795, "phrase": "general-purpose_mechanism"}, {"score": 0.0036673238814279286, "phrase": "multiple_domains"}, {"score": 0.003468287913322255, "phrase": "input_data"}, {"score": 0.0034342984674830533, "phrase": "suitable_format"}, {"score": 0.003378385493203297, "phrase": "different_data_preparation_techniques"}, {"score": 0.003334309053314909, "phrase": "known_syntax"}, {"score": 0.0028480459059007468, "phrase": "xlst"}, {"score": 0.002640781900605126, "phrase": "preliminary_preparation"}, {"score": 0.0026234862160314397, "phrase": "formatting_stage"}, {"score": 0.0025977542995083624, "phrase": "proposed_mechanism"}, {"score": 0.0025638362414466278, "phrase": "structurally_complex_data"}, {"score": 0.002377206033025253, "phrase": "prepared_data"}, {"score": 0.0023538840032613535, "phrase": "sound_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["KDD", " Data preparation", " Data mining", " Description logic", " Automatic reasoning"], "paper_abstract": "Without data preparation, data mining algorithms cannot operate on data within the knowledge discovery in databases (KDD) process. In fact, the success of later KDD phases largely depends on the data preparation stage. The use of mechanisms for automatically preparing data saves a lot of time and resources within the KDD process. These resources will then be available for use at later, less automatable stages, for example, during results interpretation. We have proposed a general-purpose mechanism applicable to multiple domains in order to improve the data preparation phase in the KDD process. This mechanism processes and automatically converts input data to a suitable format for the application of different data preparation techniques based on a known syntax. It is based on the use of description logic Taking a generic UML2 data model as a reference, this mechanism is able to check whether any XML data source whatsoever can be transformed and modelled as a subsumption or instance of the above UML2 model. Thus it automatically identifies a consistent, non-ambiguous and finite set of XLST transformations which are used to prepare the data for the application of data mining techniques, obviating the need to expend resources on the preliminary preparation and formatting stage. The proposed mechanism was applied on structurally complex data from four different domains. In order to test the validity of the proposal, we have applied data mining techniques to extract knowledge from the prepared data. The sound results of applying our proposal to several different domains confirm that it is applicable to any XML data source, as well as being correct, computationally efficient and saving time during the data preparation phase. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Data preparation for KDD through automatic reasoning based on description logic", "paper_id": "WOS:000336819100004"}