{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor"}, {"score": 0.049558064870310475, "phrase": "actor_networks"}, {"score": 0.04416180976504509, "phrase": "energy_consumption"}, {"score": 0.003826007045267751, "phrase": "sensor_nodes"}, {"score": 0.003466780226380516, "phrase": "simple_mechanism"}, {"score": 0.0033546701239540555, "phrase": "efficient_way"}, {"score": 0.002989991779830814, "phrase": "vice_versa"}, {"score": 0.00294122712771669, "phrase": "energy-efficient_way"}, {"score": 0.0027239390917424898, "phrase": "desired_reliability_level"}, {"score": 0.002664850766529523, "phrase": "quantitative_way"}, {"score": 0.0025786066704445304, "phrase": "n_hops"}, {"score": 0.0021754360937943167, "phrase": "cooja_simulator"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Wireless sensor and actor networks", " Reliable routing", " Fault-tolerance", " Multi-hop", " Clustering"], "paper_abstract": "It is well known that the use of clusters makes wireless sensor and actor networks more scalable, and it also reduces energy consumption and improves their performance. Most hierarchical routing and clustering protocols are designed to be efficient when the data is sent from the sensor nodes to their cluster-head but not when it is sent the opposite way. In this paper, a simple mechanism to form clusters in an efficient way by using meta-data is proposed. And, furthermore, a novelty multi-hop and fault-tolerance routing protocol able to transport data from sensor nodes to their cluster-head and vice versa in an energy-efficient way is also presented. Moreover, this approach allows developers to establish the desired reliability level (in a quantitative way) between two nodes which are N hops far away from each other. The performance and the energy consumption of our approach is studied by means of a set of experiments which have been carried out by using the COOJA simulator. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "HERO: A hierarchical, efficient and reliable routing protocol for wireless sensor and actor networks", "paper_id": "WOS:000307203900011"}