{"auto_keywords": [{"score": 0.04967913398382337, "phrase": "bibliographic_records"}, {"score": 0.019452763875068245, "phrase": "recorded_evidence"}, {"score": 0.00481495049065317, "phrase": "evidence_recording"}, {"score": 0.004636594774238505, "phrase": "valuable_evidence"}, {"score": 0.004578616481036476, "phrase": "recording_evidence"}, {"score": 0.004540365779658683, "phrase": "data_element_values"}, {"score": 0.004317450843594688, "phrase": "descriptive_metadata"}, {"score": 0.003936698872193083, "phrase": "data_values"}, {"score": 0.002813307389456184, "phrase": "proper_content"}, {"score": 0.0023779596230982234, "phrase": "system's_performance"}, {"score": 0.0021049977753042253, "phrase": "flexible_way"}], "paper_keywords": [""], "paper_abstract": "Recording evidence for data element values, in addition to the values themselves, in bibliographic records and descriptive metadata is likely to be useful for improving the expressivity and reliability of such records and metadata. Recorded evidence indicates why and how data values are recorded for elements. This article is Part II of a study to explore a way of assisting catalogers in recording evidence in bibliographic records, with the aim of minimizing the costs and effort of doing so. This article begins with a scenario for utilizing recorded evidence to which a cataloger refers for information and understanding of the ways that have been adopted to record data value(s) in a given element. In line with that scenario, the proper content of evidence to be recorded is first discussed. Second, the functionality of the system developed in Part I is extended and refined to make the system more useful and effective in recording such evidence. Third, the system's performance is experimentally examined, the results of which show its usefulness. And fourth, another system is developed for catalogers to retrieve and display recorded evidence together with bibliographic records in a flexible way.", "paper_title": "A system for supporting evidence recording in bibliographic records, Part II: What is valuable evidence for catalogers?", "paper_id": "WOS:000246379800006"}