{"auto_keywords": [{"score": 0.04908067956118528, "phrase": "tree_networks"}, {"score": 0.00481495049065317, "phrase": "replica_placement"}, {"score": 0.004351595642056769, "phrase": "server_capacity"}, {"score": 0.003916098498242888, "phrase": "standard_approach"}, {"score": 0.0036450381529042103, "phrase": "closest_server"}, {"score": 0.0034504423179340738, "phrase": "first_policy"}, {"score": 0.0030017207229983385, "phrase": "second_policy"}, {"score": 0.0028654728453890426, "phrase": "multiple_servers"}, {"score": 0.0027123819773059127, "phrase": "new_policies"}, {"score": 0.0026782279715171866, "phrase": "total_replication_cost"}, {"score": 0.0026445028886931837, "phrase": "important_goal"}, {"score": 0.0025674490885184173, "phrase": "server_heterogeneity"}, {"score": 0.002482126086922683, "phrase": "practical_perspective"}, {"score": 0.002349467661235186, "phrase": "np-complete_instances"}, {"score": 0.0021408862709571615, "phrase": "optimal_solution"}, {"score": 0.0021049977753042253, "phrase": "integer_linear_program"}], "paper_keywords": ["Replica placement", " tree networks", " access policy", " scheduling", " complexity results", " heuristics", " linear program", " heterogeneous clusters"], "paper_abstract": "In this paper, we discuss and compare several policies to place replicas in tree networks, subject to server capacity and Quality-of-Service (QoS) constraints. The client requests are known beforehand, while the number and location of the servers are to be determined. The standard approach in the literature is to enforce that all requests of a client be served by the closest server in the tree. We introduce and study two new policies. In the first policy, all requests from a given client are still processed by the same server, but this server can be located anywhere in the path from the client to the root. In the second policy, the requests of a given client can be processed by multiple servers. One major contribution of this paper is to assess the impact of these new policies on the total replication cost. Another important goal is to assess the impact of server heterogeneity, both from a theoretical and a practical perspective. In this paper, we establish several new complexity results and provide several efficient polynomial heuristics for NP-complete instances of the problem. These heuristics are compared one to the other, and their absolute performance is assessed by comparison with the optimal solution provided by an integer linear program.", "paper_title": "Replica Placement and Access Policies in Tree Networks", "paper_id": "WOS:000260309000002"}