{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_management"}, {"score": 0.004741845603430361, "phrase": "peer-to-peer_systems"}, {"score": 0.004511799033574768, "phrase": "significant_attention"}, {"score": 0.004477407179841716, "phrase": "distributed_computing"}, {"score": 0.0043258453436258405, "phrase": "powerful_model"}, {"score": 0.0042928648367867835, "phrase": "information_sharing"}, {"score": 0.004163427731140163, "phrase": "exhaustive_reliable_computational_resources"}, {"score": 0.003916098498242888, "phrase": "data_modeling"}, {"score": 0.0037546039916845947, "phrase": "topology_management"}, {"score": 0.003669330508576073, "phrase": "data_management_strategies"}, {"score": 0.003438058620195309, "phrase": "common_model"}, {"score": 0.0031121406603482112, "phrase": "common_layer-based_model"}, {"score": 0.002949598537993663, "phrase": "conceptual_model"}, {"score": 0.002700738055025905, "phrase": "horizontal_layers"}, {"score": 0.0023889533502525527, "phrase": "application_modules"}, {"score": 0.0021789194955896124, "phrase": "comprehensive_list"}], "paper_keywords": ["Peer-to-peer system", " Data management", " Data distribution"], "paper_abstract": "While Peer-to-Peer (P2P) model gains significant attention in distributed computing, it is also expected to be a powerful model for information sharing. P2P systems are expected to provide exhaustive reliable computational resources and scalable accessibility. The data management and distribution in such systems requires storage, replication, data modeling, indexing, querying, retrieval, streaming, and topology management. While a lot of data management strategies have been proposed through the last years, these strategies have not been investigated with respect to a common model for P2P systems. However, since the services provided by the P2P systems are so diverse, it is very challenging to come up with a common layer-based model for all P2P systems. In this paper, we firstly propose a conceptual model for P2P systems, and then provide a classification and summary of data management and distribution strategies by referring to this model. The horizontal layers of the model correspond to modules of a P2P system whereas the columns are related to the services provided. The modules include base P2P service, storage, indexing, logical, service, and application modules. The services include security, querying, publish, join/leave, collaboration, and streaming. The paper concludes by providing a comprehensive list of data management and distribution strategies used in the existing P2P systems.", "paper_title": "A conceptual model for data management and distribution in peer-to-peer systems", "paper_id": "WOS:000284095500005"}