{"auto_keywords": [{"score": 0.04370321428801146, "phrase": "ict_services"}, {"score": 0.03104244392514206, "phrase": "network_architecture"}, {"score": 0.00481495049065317, "phrase": "great_east_japan_earthquake"}, {"score": 0.004687159050154687, "phrase": "ict_resources_-_telecom_switching_offices"}, {"score": 0.004323690117778359, "phrase": "resultant_tsunami"}, {"score": 0.0040190868373730015, "phrase": "affected_areas"}, {"score": 0.0038230844545071303, "phrase": "phenomenal_rise"}, {"score": 0.0037792227071149985, "phrase": "network_traffic"}, {"score": 0.003512841739654183, "phrase": "power_outages"}, {"score": 0.0033543281764294927, "phrase": "fixed-line_telephone_service"}, {"score": 0.003290403747743492, "phrase": "fixed-line_and_mobile_telephone_services"}, {"score": 0.003154012038613403, "phrase": "serious_traffic_congestion"}, {"score": 0.003105824909705158, "phrase": "emergency_ict_networks"}, {"score": 0.002864628676257225, "phrase": "devastating_disasters"}, {"score": 0.002820850247525606, "phrase": "specially_designed_movable"}, {"score": 0.0027992118597278087, "phrase": "deployable_resource_units"}, {"score": 0.002631959004685823, "phrase": "communication_and_information_processing_functions"}, {"score": 0.002542298702137655, "phrase": "disaster_zone"}, {"score": 0.002465161736207254, "phrase": "reasonably_short_time"}, {"score": 0.0023995846112991625, "phrase": "disaster_site"}, {"score": 0.0022648637058989463, "phrase": "mdru"}, {"score": 0.0021792693001152896, "phrase": "preliminary_simulation_results"}], "paper_keywords": [""], "paper_abstract": "During the great east Japan earthquake on March 11, 2011, a lot of ICT resources - telecom switching offices, optical fiber links, and so forth - were completely or partially damaged due to the tremor and the resultant tsunami. As a consequence, the demand for ICT services explosively increased, mainly because the people of the affected areas were trying desperately to communicate with the outside world that led to a phenomenal rise in the network traffic. In the Nippon Telegraph and Telephone (NTT) East Corporation alone, 385 telephone offices stopped operating immediately following the earthquake because of power outages and disruption of facilities. Approximately 1.5 million users were cut off from using fixed-line telephone service. The demand for fixed-line and mobile telephone services jumped up to 10-50 times the usual. This gave rise to serious traffic congestion, and the emergency ICT networks and services could not deal with this issue sufficiently. This article proposes a network architecture that is resilient even through devastating disasters by effectively exploiting specially designed movable and deployable resource units, which we refer to as MDRUs. An MDRU having the ability to accommodate communication and information processing functions can be rapidly transported or moved to the disaster zone, and can be deployed within a reasonably short time to establish the network at the disaster site and launch ICT services. The concept and configuration of the network architecture based on the MDRU and its features are described in this article. Some preliminary simulation results are also reported to evaluate the performance of our adopted MDRU-based disaster resilient network.", "paper_title": "Disaster-Resilient Networking: A New Vision Based on Movable and Deployable Resource Units", "paper_id": "WOS:000322831800008"}