{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "self-organizing_maps"}, {"score": 0.04317179544664411, "phrase": "self-organizing_map"}, {"score": 0.00481495049065317, "phrase": "goat_and_sheep_production_data"}, {"score": 0.004456044928556639, "phrase": "different_small_ruminant_livestock_production_systems"}, {"score": 0.0040186038781533946, "phrase": "high-dimensional_input_spaces"}, {"score": 0.0035497797026638033, "phrase": "visual_extraction"}, {"score": 0.003513264130359459, "phrase": "qualitative_relationships"}, {"score": 0.0029620573986902416, "phrase": "goat_and_sheep_production"}, {"score": 0.0028127163745564777, "phrase": "qualitative_and_quantitative_variables"}, {"score": 0.002740885774408238, "phrase": "greater_milk_incomes"}, {"score": 0.0026161698049580804, "phrase": "greater_number"}, {"score": 0.002420762293555924, "phrase": "elaborated_diets"}, {"score": 0.0021601997088758957, "phrase": "qualitative_conclusions"}, {"score": 0.002126907587540404, "phrase": "guiding_improvements"}, {"score": 0.0021049977753042253, "phrase": "farm_performance"}], "paper_keywords": ["self-organizing map", " neural networks", " dairy science"], "paper_abstract": "The aim of this study was to analyse the relationship between different small ruminant livestock production systems with different levels of specialization. The analysis is carried out by using the self-organizing map. This tool allows high-dimensional input spaces to be mapped into much lower-dimensional spaces, thus making it much more straightforward to understand any set of data. These representations enable the visual extraction of qualitative relationships among variables (visual data mining), converting the data to maps. The data used in this study were obtained from surveys completed by farmers who are principally dedicated to goat and sheep production. With the self-organizing map we found a relationship between qualitative and quantitative variables showing that more specialized farms have greater milk incomes per goat, highlighting farms that have a greater number of animals, better facilities (including milking machines) or animals fed with elaborated diets. The use of self-organizing maps for the analysis of this kind of data has proven to be highly valuable in extracting qualitative conclusions and in guiding improvements in farm performance.", "paper_title": "Qualitative analysis of goat and sheep production data using self-organizing maps", "paper_id": "WOS:000266024200005"}