{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "efficient_sparql_query_processing"}, {"score": 0.04484681558552234, "phrase": "intermediate_results"}, {"score": 0.04184592131486041, "phrase": "triple_filtering_method"}, {"score": 0.0037864980290391354, "phrase": "path-based_index"}, {"score": 0.0035399770257915466, "phrase": "irrelevant_triples"}, {"score": 0.0032777653153451265, "phrase": "rdf_graph"}, {"score": 0.0030790429005600898, "phrase": "graph-structural_information"}, {"score": 0.0030058503645435455, "phrase": "rdf_graph_index"}, {"score": 0.002690886043654469, "phrase": "graph_patterns"}, {"score": 0.002601727192945944, "phrase": "triple_filtering"}, {"score": 0.0025034338848015166, "phrase": "efficient_method"}, {"score": 0.0024088451312725924, "phrase": "frequent_graph_pattern_mining_algorithm"}, {"score": 0.002340250894008014, "phrase": "comprehensive_experiments"}, {"score": 0.0023178219772486868, "phrase": "large-scale_rdf_datasets"}, {"score": 0.0022302306304023602, "phrase": "redundant_intermediate_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["RDF", " SPARQL", " Query optimization", " Triple filtering", " Intermediate results"], "paper_abstract": "As the size of Resource Description Framework (RDF) graphs has grown rapidly, SPARQL query processing on the large-scale RDF graph has become a more challenging problem. For efficient SPARQL query processing, the handling of the intermediate results is the most crucial element because it generally involves many join operators. Recently, a triple filtering method, called the RP-filter, which uses a path-based index, was proposed. It can reduce the intermediate results effectively by filtering out irrelevant triples in advance. However, its filtering power is limited, because it uses only the path information of the RDF graph. In this paper, we extend the triple filtering method to exploit the graph-structural information, and propose the RDF graph index (RG-index). We address the problem of the RG-index, which is caused by the indexing of the graph patterns, by indexing only effective graph patterns for the triple filtering. In addition, we propose an efficient method for building the RG-index in which a frequent graph pattern mining algorithm is adapted. We conducted comprehensive experiments on large-scale RDF datasets and demonstrated that the RG-index can reduce redundant intermediate results more effectively than can the RP-filter. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "RG-index: An RDF graph index for efficient SPARQL query processing", "paper_id": "WOS:000335629500008"}