{"auto_keywords": [{"score": 0.04654596457552869, "phrase": "expert_system"}, {"score": 0.010372983229429906, "phrase": "expert_systems"}, {"score": 0.00481495049065317, "phrase": "manufacturing_domain"}, {"score": 0.004760017604908536, "phrase": "foremost_challenge"}, {"score": 0.004616560363089716, "phrase": "real_world_problems"}, {"score": 0.004309323675697185, "phrase": "whole_structure"}, {"score": 0.004179392391349015, "phrase": "fuzzy_sets"}, {"score": 0.0041316803676012155, "phrase": "even_user-interface-needs"}, {"score": 0.0032710562699144814, "phrase": "self-correcting_knowledge-base"}, {"score": 0.0029158847555394714, "phrase": "dynamic_and_ever-changing_industrial_environments"}, {"score": 0.0025892330566358503, "phrase": "knowledge_engineering_skills"}, {"score": 0.002361632539339945, "phrase": "complete_development"}, {"score": 0.0022640963589007457, "phrase": "proposed_expert_system"}, {"score": 0.0021049977753042253, "phrase": "milling_and_welding_processes"}], "paper_keywords": ["Self-development", " Optimization", " Fuzzy reasoning", " Prediction", " Milling"], "paper_abstract": "The foremost challenge faced by expert systems, for their applicability to real world problems, is their inherent deficiency of dynamism. For an expert system to be more pragmatic and applicable, the whole structure of an expert system-including rule-base, fuzzy sets, and even user-interface-needs to be upgraded continuously. This continuous up gradation demands full-time, repetitive, and cumbersome involvement of knowledge engineers. Machine learning is an answer to this problem, but unfortunately, the solutions that have been provided are limited in scope. For example, most of the researchers put forward techniques of either generating just rules from data, or self-expanding and self-correcting knowledge-base only. The innovative approach presented in this paper is broader in scope. It enhances the efficacy and viability of expert systems to be more capable of coping with dynamic and ever-changing industrial environments. The objective is facilitated by rendering, concurrently, the self-learning, self-correcting, and self-expanding abilities to the expert system, without requiring knowledge engineering skills of the developers. This means that the user needs just to feed data in form of the values of input/output variables and the complete development of expert system is done automatically. The superiority of the proposed expert system, regarding its continuous self-development, has been explained with the help of three examples related to prediction and optimization of milling and welding processes.", "paper_title": "Self-developing fuzzy expert system: a novel learning approach, fitting for manufacturing domain", "paper_id": "WOS:000284509700010"}