{"auto_keywords": [{"score": 0.048152320835937894, "phrase": "imperfect_information"}, {"score": 0.013566109227741254, "phrase": "extended_fuzzy_logic"}, {"score": 0.007680002302010249, "phrase": "p-valid_reasoning"}, {"score": 0.00481495049065317, "phrase": "extended_fuzzy_logic-a_first_step"}, {"score": 0.004741395005218184, "phrase": "bivalent_logic"}, {"score": 0.004717125879761534, "phrase": "important_capability"}, {"score": 0.004356385318931493, "phrase": "fuzzy_logic"}, {"score": 0.004117169392240965, "phrase": "equally_important_capability"}, {"score": 0.003951453722517865, "phrase": "precise_reasoning"}, {"score": 0.0035201528214608914, "phrase": "everyday_human_reasoning"}, {"score": 0.0035021127041237887, "phrase": "f-valid_reasoning"}, {"score": 0.00347522512377874, "phrase": "-valid_reasoning"}, {"score": 0.0032009160232892046, "phrase": "geometric_figures"}, {"score": 0.003143849342926373, "phrase": "spray_pen-a_miniaturized_spray"}, {"score": 0.003112093980212822, "phrase": "euclidean"}, {"score": 0.0030798711656591948, "phrase": "crisp_concept"}, {"score": 0.0030249559524951255, "phrase": "fuzzy_concept"}, {"score": 0.002673804838281251, "phrase": "spray_pen"}, {"score": 0.00250732953434891, "phrase": "higher-level_concepts"}, {"score": 0.002250601866422547, "phrase": "euclidean_geometry"}, {"score": 0.0021821915946356168, "phrase": "realistic_model"}, {"score": 0.0021267708018655493, "phrase": "unrealistic_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy logic", " Fuzzy set theory", " Fuzzy geometry", " Fuzzy theorem"], "paper_abstract": "Fuzzy logic adds to bivalent logic an important capability-a capability to reason precisely with imperfect information. Imperfect information is information which in one or more respects is imprecise, uncertain, incomplete, unreliable, vague or partially true. In fuzzy logic, results of reasoning are expected to be provably valid, or p-valid for short. Extended fuzzy logic adds an equally important capability-a capability to reason imprecisely with imperfect information. This capability comes into play when precise reasoning is infeasible, excessively costly or unneeded. In extended fuzzy logic, p-validity of results is desirable but not required. What is admissible is a mode of reasoning which is fuzzily valid, or f-valid for short. Actually, much of everyday human reasoning is f-valid reasoning. f-Valid reasoning falls within the province of what may be called unprecisiated fuzzy logic, FLu. FLu is the logic which underlies what is referred to as f-geometry. In f-geometry, geometric figures are drawn by hand with a spray pen-a miniaturized spray can. In Euclidean geometry, a crisp concept, C, corresponds to a fuzzy concept,f-C, in f-geometry. f-C is referred to as an f-transform of C, with C serving as the prototype off-C. f-C may be interpreted as the result of execution of the instructions: Draw C by hand with a spray pen. Thus, in f-geometry we have f-points, f-lines, f-triangles, f-circles, etc. in addition, we have f-transforms of higher-level concepts: f-parallel, f-similar, f-axiom, f-definition, f-theorem, etc. In f-geometry, p-valid reasoning does not apply. Basically, f-geometry may be viewed as an f-transform of Euclidean geometry. What is important to note is that f-valid reasoning based on a realistic model may be more useful than p-valid reasoning based on an unrealistic model. Published by Elsevier B.V.", "paper_title": "Toward extended fuzzy logic-A first step", "paper_id": "WOS:000270348100011"}