{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adjusted_p-values"}, {"score": 0.005848721839411202, "phrase": "kde_method"}, {"score": 0.00473477283457869, "phrase": "multiple_testing_procedures"}, {"score": 0.004655924035639928, "phrase": "biomedical_and_genomic_research"}, {"score": 0.00454772672262359, "phrase": "differentially_expressed_genes"}, {"score": 0.004517275498868226, "phrase": "microarray_experiments"}, {"score": 0.0044870272550540415, "phrase": "resampling_methods"}, {"score": 0.004368037394395782, "phrase": "multiple_hypothesis_testing_problems"}, {"score": 0.004295269532032448, "phrase": "resampling-based_multiple_testing_procedures"}, {"score": 0.004125513927068713, "phrase": "minp_adjustment_procedure"}, {"score": 0.0038443635340052523, "phrase": "computational_complexity"}, {"score": 0.0036553070575015344, "phrase": "test_statistics"}, {"score": 0.003498968822873231, "phrase": "kernel_density_estimation"}, {"score": 0.00333804919565419, "phrase": "single-step_minp_adjustment"}, {"score": 0.003163154491827937, "phrase": "minp_adjustment_method"}, {"score": 0.0031419449938286663, "phrase": "independent_and_correlated_models"}, {"score": 0.0030895394261534776, "phrase": "maxt"}, {"score": 0.0030688222386175586, "phrase": "minp"}, {"score": 0.0030380073189727754, "phrase": "kde"}, {"score": 0.002957327365538023, "phrase": "colon_tumor_data"}, {"score": 0.0028023242231187363, "phrase": "leukemia_data"}, {"score": 0.0024576084154573396, "phrase": "step_functions"}, {"score": 0.002155204688099519, "phrase": "similar_adjusted_p-values"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["family-wise error rate (FWER)", " kernel density estimation", " maximal test-statistic", " minimal p-values", " permutation test"], "paper_abstract": "Multiple testing procedures are frequently applied to biomedical and genomic research, for instance, identification of differentially expressed genes in microarray experiments. Resampling methods are commonly used to compute adjusted p-values in multiple hypothesis testing problems. Importantly, the resampling-based multiple testing procedures are sensitive to the number of permutations, especially for the MinP adjustment procedure. The single-step MinP adjusted p-values are derived from the distribution of the minimum of the p-values. Because of computational complexity, the adjusted p-values are often computed using the distribution of the maximum of the test statistics (MaxT). This paper proposes an approach based on the kernel density estimation (KDE) technique to reduce the number of permutations for implementing the single-step MinP adjustment. Simulation studies are conducted to demonstrate that the KDE method is more powerful than the MinP adjustment method under independent and correlated models. The three resampling-based single-step adjustment procedures, MaxT, MinP, and KDE, are applied to two published microarray data sets, the colon tumor data set consisting of 40 tumor and 22 normal colon tissue samples on 2000 human genes (endpoints) and the leukemia data set consisting of 27 acute lymphoblastic leukemia and 11 acute myeloid leukemia samples on 3051 genes. The MaxT adjusted p-values are very robust to the number of permutations. The MaxT adjusted p-values are stable with 10,000 permutations, while the MinP adjusted p-values are step functions. As the number of permutations increases, the number of ties decrease. The adjusted p-values are stable with 500,000 permutations. For the KDE method, the adjusted p-values are stable at 50,000 permutations. At 1000,000 permutations, the three procedures have similar adjusted p-values. (c) Published by Elsevier B.V.", "paper_title": "Kernel estimation for adjusted p-values in multiple testing", "paper_id": "WOS:000246128500020"}