{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wireless_sensor_network"}, {"score": 0.004749824776508639, "phrase": "low-powered_transmissions"}, {"score": 0.004477595431209663, "phrase": "external_sources"}, {"score": 0.004317848984770719, "phrase": "wsn_devices"}, {"score": 0.003802135020791801, "phrase": "signal_strength_traces"}, {"score": 0.003767738552860633, "phrase": "mote-class_synchronized_receivers"}, {"score": 0.003378385493203297, "phrase": "distinct_interference_patterns"}, {"score": 0.00330246222643051, "phrase": "different_potential"}, {"score": 0.0032282396745967504, "phrase": "cognitive_radio_strategies"}, {"score": 0.002816556934231128, "phrase": "succinct_decision_tree_classifiers"}, {"score": 0.0027035833504191233, "phrase": "basic_feature"}, {"score": 0.0026069623057065664, "phrase": "dip_statistic"}, {"score": 0.0025716240685409513, "phrase": "lomb_periodogram"}, {"score": 0.0023479408542211875, "phrase": "overall_classification_performance"}, {"score": 0.0021830553825770097, "phrase": "mote-class_devices"}, {"score": 0.002124247104243502, "phrase": "simplification's_impact"}, {"score": 0.0021049977753042253, "phrase": "classification_performance"}], "paper_keywords": ["Experimentation", " Algorithms", " Classification", " interference", " sampling", " wireless sensor networks"], "paper_abstract": "The low-powered transmissions in a wireless sensor network (WSN) are highly susceptible to interference from external sources. Our work is a step towards enabling WSN devices to better understand the interference in their environment so that they can adapt to it and communicate more efficiently. We extend our previous work in which we collected received signal strength traces using mote-class synchronized receivers at sample rates that are, to the best of our knowledge, higher than previously described in the literature. These traces contain distinct interference patterns, each with a different potential for being exploited by cognitive radio strategies. In order to exploit a pattern, however, a node must first recognize it. Given the energy and space constraints of a node, we explore succinct decision tree classifiers for the two most disruptive patterns. We expand on a basic feature set to incorporate attributes based on the dip statistic and the Lomb periodogram, both of which address specific, empirically observed behaviour, and we show their positive impact on both the decision tree structure and the overall classification performance. Moreover, we present an approximation of the periodogram that makes its construction feasible for mote-class devices, and we describe the simplification's impact on classification performance.", "paper_title": "Sampling and Classifying Interference Patterns in a Wireless Sensor Network", "paper_id": "WOS:000316415300002"}