{"auto_keywords": [{"score": 0.03011345402963935, "phrase": "research_team"}, {"score": 0.015719716506582538, "phrase": "accessibility_levels"}, {"score": 0.015589188592772307, "phrase": "portuguese_enterprise_websites"}, {"score": 0.004463096299091981, "phrase": "increasing_need"}, {"score": 0.004388450908826472, "phrase": "web_resources"}, {"score": 0.0037070855410818986, "phrase": "totally_accessible_resource"}, {"score": 0.0032387402145603412, "phrase": "marketing_and_business_platform"}, {"score": 0.0029639342245188203, "phrase": "theoretical_and_background_considerations"}, {"score": 0.0024926348205500715, "phrase": "specialised_software_tool"}, {"score": 0.002450864311898833, "phrase": "web_content_accessibility_guidelines"}, {"score": 0.0023395610923736595, "phrase": "wcag"}, {"score": 0.0022906498741695094, "phrase": "enterprise_web_accessibility"}, {"score": 0.0022522565004588113, "phrase": "second_study"}, {"score": 0.0021773853011112882, "phrase": "group_interactions"}, {"score": 0.0021049977753042253, "phrase": "greater_accessibility"}], "paper_keywords": ["accessibility", " comparative study", " websites"], "paper_abstract": "Web accessibility is growing in importance. We may also find an increasing need for access to web resources by those with some sort of disability. The Web is very important for spreading information and for promoting interaction between the various elements in society. Given this, it is essential that the Web presents itself as a totally accessible resource, so that it can help citizens with disabilities and their integration in society. This obligation should be even greater for enterprises as primarily the Web is used as a marketing and business platform. With this document, we present indicators regarding the [lack of] accessibility levels of Portuguese enterprise websites. This article contains theoretical and background considerations as well as the results of two different studies that the research team undertook. First of all, the research team made a comparison between the 1000 largest Portuguese enterprises (annual sales volume) and the 1000 best Portuguese small and medium enterprises (sales growth and profit) using a specialised software tool and according to Web Content Accessibility Guidelines (WCAG) 1.0; the research team then also considered WCAG 2.0 and its impact on enterprise Web accessibility. In the second study (qualitative in nature), focus group interactions led to a set of recommendations towards greater accessibility.", "paper_title": "Accessibility levels of Portuguese enterprise websites: equal opportunities for all?", "paper_id": "WOS:000306321400003"}