{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "external_factors"}, {"score": 0.018667396159463636, "phrase": "erp_system"}, {"score": 0.018530065428506052, "phrase": "erp_use"}, {"score": 0.013027292693756926, "phrase": "tam"}, {"score": 0.009875294562391959, "phrase": "operation_phase"}, {"score": 0.009777686724342599, "phrase": "stabilization_stage"}, {"score": 0.0063939329317497925, "phrase": "erp_system_use"}, {"score": 0.006022680262007875, "phrase": "users'_adoption"}, {"score": 0.0059927273450569125, "phrase": "erp_systems"}, {"score": 0.005410310701452321, "phrase": "erp_users"}, {"score": 0.004790975089388177, "phrase": "routine_erp_usage"}, {"score": 0.0046495973908955695, "phrase": "erp_solutions"}, {"score": 0.004401103940931994, "phrase": "routine_stage"}, {"score": 0.004145078729581006, "phrase": "users'_satisfaction"}, {"score": 0.004121573971263225, "phrase": "second-order_factors"}, {"score": 0.00400263757329054, "phrase": "technological_acceptance_model"}, {"score": 0.003594917553567545, "phrase": "erp_lifecycle"}, {"score": 0.0034368000697477794, "phrase": "davis"}, {"score": 0.00310199890835121, "phrase": "present_research"}, {"score": 0.0030634619419916214, "phrase": "mature_use"}, {"score": 0.0029580789738223624, "phrase": "limited_number"}, {"score": 0.0029213247240469677, "phrase": "already_published_papers"}, {"score": 0.0027511447650243846, "phrase": "original_tam."}, {"score": 0.002630030607813334, "phrase": "national_telecom_company"}, {"score": 0.002520532409176914, "phrase": "pls_approach"}, {"score": 0.0024705891356454524, "phrase": "extended_external_factors"}, {"score": 0.0024155819966449267, "phrase": "erp_usefulness"}, {"score": 0.0023500075852114655, "phrase": "strong_influence"}, {"score": 0.002196483866453684, "phrase": "erp_solution_use"}], "paper_keywords": ["Slovenia", " Manufacturing resource planning", " Resource management", " Enterprise resource planning", " ERP", " Technological acceptance model", " TAM", " Partial least squares", " PLS", " Second-order factors"], "paper_abstract": "Purpose - Enterprise resource planning (ERP) systems have been implemented in most organizations for a few years. ERP solutions go through three phases of lifecycle: selection, implementation and operation phase; the operation phase consists of the stabilization stage and the routine stage. To improve the efficiency and effectiveness of ERP system use in the operation phase, organizations need to research the factors that have impact on users' satisfaction. The literature shows that few published studies have examined users' adoption of ERP systems through a technological acceptance model (TAM) or examined external factors that have influence the intention to use an ERP system, or ERP use in the stabilization stage. The purpose of this paper is to expose and research external factors which have influence on ERP users in the operation phase of ERP lifecycle and to investigate the impact of those factors on ERP system use. Design/methodology/approach - The TAM proposed by Davis has been the most widely-used model for researching user acceptance and usage of information technology/information systems. Despite the existence of several additions to TAM connected with ERP use, the authors aim to make further contribution in the area of external factors. Within this context the present research is focused on the mature use of ERP system (more than one year of ERP use in an organization). A limited number of external factors mentioned in already published papers connected with TAM regarding ERP use has also been extended. The authors have researched the effect of external factors through the second-order factors on the original TAM. The model has been empirically tested using the data collected from a survey of 161 ERP users from a national telecom company, which has been using an ERP system since 1999. The model has been analysed using PLS approach. Findings - The study shows that extended external factors observed through the second-order factors have important influence on ERP usefulness and ERP ease of use; they also have a strong influence on the attitude toward using ERP system by ERP users in the routine (maturity) stage. Originality/value - The paper researches the factors which have an impact on ERP solution use in the routine (mature) stage of ERP lifecycle. The paper adds to the literature, in that few previous studies have examined the users' adoption of ERP systems through the TAM or examined external factors that have influence on the intention to use an ERP system or ERP use in the stabilization stage.", "paper_title": "The influence of external factors on routine ERP usage", "paper_id": "WOS:000296823100016"}