{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_type"}, {"score": 0.004586531354697466, "phrase": "output_point"}, {"score": 0.00441635700580562, "phrase": "swimmer's_breast-stroke"}, {"score": 0.004229556887896042, "phrase": "loose_debris"}, {"score": 0.003985487777785535, "phrase": "potential_applications"}, {"score": 0.003879234831701853, "phrase": "controllable_cyclic_motion"}, {"score": 0.0037554497046697432, "phrase": "mechanism_concept"}, {"score": 0.003695040819303525, "phrase": "mathematical_analysis"}, {"score": 0.003407214479510987, "phrase": "mechanism_trajectory"}, {"score": 0.003057910095857785, "phrase": "mechanism_torque_ratio"}, {"score": 0.0028968858148006823, "phrase": "trajectory_variations"}, {"score": 0.0025857324180891526, "phrase": "mathematical_predictions"}, {"score": 0.002489608163017922, "phrase": "predicted_torque_ratios"}, {"score": 0.002410058288617039, "phrase": "experimentally_obtained_torque_output"}, {"score": 0.002320449502337321, "phrase": "proportional-derivative_control"}, {"score": 0.0021510820434023207, "phrase": "motor_travel"}], "paper_keywords": ["Four-bar linkage", " Search and rescue", " Mechanism", " Robot", " 10-Bar"], "paper_abstract": "A new type of mechanism has been designed to move an output point through a motion akin to a swimmer's breast-stroke. The mechanism is designed to clear loose debris from around small mobile search and rescue robots. However, it has potential applications in many other domains that require controllable cyclic motion. This paper describes the mechanism concept and presents mathematical analysis of its design parameters. The properties of the mechanism were examined to understand how the mechanism trajectory can be altered mid-cycle whilst maintaining the condition of continually rotating motors. Furthermore, equations to calculate the mechanism torque ratio were derived. The analysis reveals limitations in the trajectory variations that can be implemented whilst maintaining the condition of continually rotating motors. The mechanism was manufactured to validate the mathematical predictions. It was found that the predicted torque ratios are within 90% of the experimentally obtained torque output. The mechanism was controlled using proportional-derivative control (PD) and demonstrated to track several desired trajectories without reversing the direction of motor travel, with tracking error less than 4 mm. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The sweep-extend mechanism: A 10-bar mechanism to perform biologically inspired burrowing motions", "paper_id": "WOS:000295664900005"}