{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "paper_prototyping"}, {"score": 0.004732215871738028, "phrase": "user_interfaces"}, {"score": 0.004677847043645765, "phrase": "multiple_display_environments"}, {"score": 0.004389745162172933, "phrase": "virtual_workspace"}, {"score": 0.0038654774211631564, "phrase": "effective_interfaces"}, {"score": 0.003523822585025555, "phrase": "alternative_designs"}, {"score": 0.003443219062200627, "phrase": "design_process"}, {"score": 0.0031026497891826726, "phrase": "multiple_displays"}, {"score": 0.002518989593177879, "phrase": "traditional_method"}, {"score": 0.002141898874982106, "phrase": "minor_modifications"}, {"score": 0.0021049977753042253, "phrase": "existing_method"}], "paper_keywords": ["multiple display environments", " paper prototyping", " rapid prototyping", " user interface design"], "paper_abstract": "A multiple display environment (MDE) networks personal and shared devices to form a virtual workspace, and designers are just beginning to grapple with the challenges of developing interfaces tailored for these environments. To develop effective interfaces for MDEs, designers must employ methods that allow them to rapidly generate and test alternative designs early in the design process. Paper prototyping offers one promising method, but needs to be adapted to effectively simulate the use of multiple displays and allow testing with groups of users. In this paper, we share experiences from two projects in which paper prototyping was utilized to explore interfaces for MDEs. We identify problems encountered when applying the traditional method, describe how these problems were overcome, and distill our experiences into recommendations that others can draw upon. By following our recommendations, designers need only make minor modifications to the existing method to better realize benefits of paper prototyping for MDEs.", "paper_title": "Adapting paper prototyping for designing user interfaces for multiple display environments", "paper_id": "WOS:000252694400007"}