{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "classification_schemes"}, {"score": 0.010442835926377668, "phrase": "organizational_taxonomy"}, {"score": 0.0075224799657265164, "phrase": "organizational_community_sources"}, {"score": 0.006808959063411003, "phrase": "main_categories"}, {"score": 0.006699762783609347, "phrase": "stakeholders'_interests"}, {"score": 0.0066100958900418985, "phrase": "domain_taxonomies"}, {"score": 0.004636340567075841, "phrase": "purpose_-_potential_and_benefits"}, {"score": 0.004537254814246843, "phrase": "organizational_taxonomies"}, {"score": 0.004428301038759849, "phrase": "empirical_data"}, {"score": 0.004357116231871565, "phrase": "top-down_approach"}, {"score": 0.004007083686875716, "phrase": "information_studies_domain"}, {"score": 0.003964007795174772, "phrase": "nanyang_technology"}, {"score": 0.003921401693100283, "phrase": "singapore"}, {"score": 0.0038271712887391015, "phrase": "dewey_decimal_classification"}, {"score": 0.0036751506748887663, "phrase": "lisa."}, {"score": 0.0036553070575015344, "phrase": "eric"}, {"score": 0.0036257863613963245, "phrase": "findings_-_classification_schemes"}, {"score": 0.0034629341517018438, "phrase": "subject_facet"}, {"score": 0.003289534854212415, "phrase": "organizational_activities"}, {"score": 0.0029763124376934813, "phrase": "category_terms"}, {"score": 0.0028502479839354637, "phrase": "hierarchical_structures"}, {"score": 0.0027741761880779535, "phrase": "stakeholders'_perspectives"}, {"score": 0.002751751956416832, "phrase": "navigational_role"}, {"score": 0.0026068072806619195, "phrase": "hierarchical_levels"}, {"score": 0.002537216271965659, "phrase": "commonly_used_standard"}, {"score": 0.0025167026017217926, "phrase": "consistency_principle"}, {"score": 0.0024761702541879213, "phrase": "taxonomy_structure"}, {"score": 0.0024231382864800173, "phrase": "draft_taxonomy"}, {"score": 0.002258485755625332, "phrase": "taxonomy_development"}, {"score": 0.002234165013865669, "phrase": "information_studies_taxonomy"}, {"score": 0.0021922308351126746, "phrase": "library_and_information_schools"}, {"score": 0.0021049977753042253, "phrase": "organizational_sites"}], "paper_keywords": ["Classification scheme", " Controlled languages", " Information systems", " Singapore"], "paper_abstract": "Purpose - Potential and benefits of classification schemes and thesauri in building organizational taxonomies cannot be fully utilized by organizations. Empirical data of building -,in organizational taxonomy by the top-down approach of using classification schemes and thesauri appear to be lacking. The paper seeks to make a contribution in this regard. Design/methodology/approach - A case study of building an organizational taxonomy was conducted in the information studies domain for the Division of Information Studies at Nanyang Technology, University, Singapore. The taxonomy was built by using the Dewey Decimal Classification, the Information Science Taxonomy, two information systems taxonomies, and three thesauri (ASIS&T, LISA. and ERIC). Findings - Classification schemes and thesauri were found to be helpful in creating the structure and categories related to the subject facet of the taxonomy, but organizational community sources bad to be consulted and several methods had to be employed. The organizational activities and stakeholders' needs had to be identified to determine the objectives, facets, and the subject coverage of the taxonomy. Main categories were determined by identifying the stakeholders' interests and consulting organizational community sources and domain taxonomies. Category terms were selected from terminologies of classification schemes, domain taxonomies, and thesauri against the stakeholders' interests. Hierarchical structures of the main categories were constructed in line with the stakeholders' perspectives and the navigational role taking advantage of structures/term relationships from classification schemes and thesauri. Categories were determined in line with the concepts and the hierarchical levels. Format of categories were uniformed according to a commonly used standard. The consistency principle was employed to make the taxonomy structure and categories neater. Validation of the draft taxonomy through consultations with the stakeholders further refined the taxonomy. Originality/value - No similar study could be traced in the literature. The steps and methods used in the taxonomy development, and the information studies taxonomy itself, will be helpful for library and information schools and other similar organizations in their effort to develop taxonomies for organizing content and aiding navigation on organizational sites.", "paper_title": "Using classification schemes and thesauri to build an organizational taxonomy for organizing content and aiding navigation", "paper_id": "WOS:000262135600004"}