{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ontology-driven_conceptual_modeling"}, {"score": 0.004769702911065878, "phrase": "odcm"}, {"score": 0.004658426838467567, "phrase": "relatively_new_research_domain"}, {"score": 0.004549734943142138, "phrase": "information_systems"}, {"score": 0.0038746849003761024, "phrase": "existing_literature"}, {"score": 0.0034920505103165403, "phrase": "research_contributions"}, {"score": 0.0032838979278935814, "phrase": "relevant_research"}, {"score": 0.0030590445140753187, "phrase": "research_opportunities"}, {"score": 0.002931569771634119, "phrase": "systematic_review_study"}, {"score": 0.002890266318361907, "phrase": "mapping_study"}, {"score": 0.00266693888510356, "phrase": "general_overview"}, {"score": 0.002507845411496512, "phrase": "review_study"}, {"score": 0.0023249757987087055, "phrase": "found_evidence"}, {"score": 0.002125020720324262, "phrase": "possible_areas"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Ontology-driven conceptual modeling", " ontology", " conceptual model", " systematic literature mapping", " systematic literature study"], "paper_abstract": "Ontology-driven conceptual modeling (ODCM) is still a relatively new research domain in the field of information systems and there is still much discussion on how the research in ODCM should be performed and what the focus of this research should be. Therefore, this article aims to critically survey the existing literature in order to assess the kind of research that has been performed over the years, analyze the nature of the research contributions and establish its current state of the art by positioning, evaluating and interpreting relevant research to date that is related to ODCM. To understand and identify any gaps and research opportunities, our literature study is composed of both a systematic mapping study and a systematic review study. The mapping study aims at structuring and classifying the area that is being investigated in order to give a general overview of the research that has been performed in the field. A review study on the other hand is a more thorough and rigorous inquiry and provides recommendations based on the strength of the found evidence. Our results indicate that there are several research gaps that should be addressed and we further composed several research opportunities that are possible areas for future research.", "paper_title": "Ontology-driven conceptual modeling: A systematic literature mapping and review", "paper_id": "WOS:000368916800003"}