{"auto_keywords": [{"score": 0.03137710218489095, "phrase": "optimization_process"}, {"score": 0.00481495049065317, "phrase": "p-cycle-based_protected_working_capacity_envelope"}, {"score": 0.004457579615095599, "phrase": "network_operations"}, {"score": 0.004096409451697279, "phrase": "pcwe"}, {"score": 0.0040366412779632085, "phrase": "new_design_method"}, {"score": 0.003992385826251404, "phrase": "column_generation"}, {"score": 0.0039053194919285725, "phrase": "survivable_wdm_networks"}, {"score": 0.0038061298318563925, "phrase": "proposed_design_algorithms"}, {"score": 0.003778253716938922, "phrase": "pwce"}, {"score": 0.003510439768484619, "phrase": "second_step"}, {"score": 0.0033465923623290034, "phrase": "combinatorial_optimization_tools"}, {"score": 0.0031786562062819327, "phrase": "large_scale_optimization_tools"}, {"score": 0.002931569771634119, "phrase": "key_advantage"}, {"score": 0.0029100802280971065, "phrase": "cg_techniques"}, {"score": 0.0027437235598539904, "phrase": "relevant_cycles"}, {"score": 0.0025678829712650437, "phrase": "intensive_computational_experiments"}, {"score": 0.0024389277933858054, "phrase": "different_algorithms"}, {"score": 0.002368160970983679, "phrase": "running_time"}, {"score": 0.0022994427535192514, "phrase": "five_different_network_instances"}, {"score": 0.00226583335721762, "phrase": "cg-based_algorithm"}, {"score": 0.00224094835951312, "phrase": "far_all_proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "large_network_instances"}], "paper_keywords": ["p-Cycles", " Survivable WDM networks", " Column generation"], "paper_abstract": "The protected working capacity envelope (PWCE) concept was proposed by Grover (2004) in order to simplify network operations and management in survivable wavelength division multiplexing (WDM) networks. In this paper, we focus on the design of PCWE and investigate a new design method based on column generation (CG) for designing survivable WDM networks based on p-cycle PWCE. Proposed design algorithms for PWCE and p-cycle proceed in two steps: A first step where a large (sometimes huge) number of cycles is enumerated followed by a second step where the selection of the most promising p-cycles is made with the help of combinatorial optimization tools. In this paper, we develop a new (single-step) method based on large scale optimization tools, that is, CG techniques, where the generation of cycles is dynamic and embedded within the optimization process. The key advantage of CG techniques is that no a priori cycle enumeration step is required ahead of the optimization process: The generation of the relevant cycles, only one or few at a time, is embedded in the optimization process. We conducted intensive computational experiments to compare the performances of our CG algorithms with four other algorithms in the literature. The different algorithms were compared with regard to several design metrics and running time. Results obtained in the experiments on five different network instances show that the CG-based algorithm outperforms by far all proposed algorithms in the literature, both with respect to the scalability (much smaller computing times for large network instances) and also with respect to the quality of the solutions.", "paper_title": "An efficient column generation design method of p-cycle-based protected working capacity envelope", "paper_id": "WOS:000310325700001"}