{"auto_keywords": [{"score": 0.049631680892871025, "phrase": "alpha_integration"}, {"score": 0.00481495049065317, "phrase": "detection_context_based"}, {"score": 0.0046593017130868, "phrase": "new_method"}, {"score": 0.004529881123652277, "phrase": "different_detectors"}, {"score": 0.004162703509434786, "phrase": "detection_context"}, {"score": 0.004009175817816061, "phrase": "square_error"}, {"score": 0.003861288537079326, "phrase": "roc_curve"}, {"score": 0.003684048704119722, "phrase": "gradient_algorithms"}, {"score": 0.0035648266669315943, "phrase": "different_experiments"}, {"score": 0.003531474887552889, "phrase": "simulated_and_real_data"}, {"score": 0.0034657012607680203, "phrase": "simulated_data"}, {"score": 0.0034171734618737436, "phrase": "two-detector_case"}, {"score": 0.0032145922365231093, "phrase": "score_fusion"}, {"score": 0.003154701855951328, "phrase": "individual_detector_performance"}, {"score": 0.002688532127821979, "phrase": "false_alarm"}, {"score": 0.002650857539177183, "phrase": "second_case"}, {"score": 0.002613709503583786, "phrase": "automatic_analysis"}, {"score": 0.002470237978694949, "phrase": "medical_expert_detections"}, {"score": 0.0021049977753042253, "phrase": "fusing_parameters"}], "paper_keywords": [""], "paper_abstract": "We present a new method for fusing scores corresponding to different detectors (two-hypotheses case). It is based on alpha integration, which we have adapted to the detection context. Three optimization methods are presented: least mean square error, maximization of the area under the ROC curve, and minimization of the probability of error. Gradient algorithms are proposed for the three methods. Different experiments with simulated and real data are included. Simulated data consider the two-detector case to illustrate the factors influencing alpha integration and demonstrate the improvements obtained by score fusion with respect to individual detector performance. Two real data cases have been considered. In the first, multimodal biometric data have been processed. This case is representative of scenarios in which the probability of detection is to be maximized for a given probability of false alarm. The second case is the automatic analysis of electroencephalogram and electrocardiogram records with the aim of reproducing the medical expert detections of arousal during sleeping. This case is representative of scenarios in which probability of error is to be minimized. The general superior performance of alpha integration verifies the interest of optimizing the fusing parameters.", "paper_title": "Fusion of Scores in a Detection Context Based on Alpha Integration", "paper_id": "WOS:000360091800007"}