{"auto_keywords": [{"score": 0.04919260571078962, "phrase": "knowledge_transfer"}, {"score": 0.007850676846271117, "phrase": "\"knowledge\"_properties"}, {"score": 0.0070199024421039894, "phrase": "\"knowledge-connection\"_structure"}, {"score": 0.005266062542387978, "phrase": "knowledge_diversity"}, {"score": 0.00481495049065317, "phrase": "knowledge-connection_structure"}, {"score": 0.004620957579769604, "phrase": "network_properties"}, {"score": 0.003775803846431323, "phrase": "primitive_attempt"}, {"score": 0.0034385353123700885, "phrase": "knowledge_distribution"}, {"score": 0.0033370841436001597, "phrase": "agent-based_modeling_approach"}, {"score": 0.002949189427671915, "phrase": "network_adjustment"}, {"score": 0.0028728747019026485, "phrase": "directly-connected_agent-pairs"}, {"score": 0.0028090313440881937, "phrase": "overall_performance"}, {"score": 0.0027569106820061707, "phrase": "entire_network"}, {"score": 0.0027261023678401696, "phrase": "short_term"}, {"score": 0.002655544981260646, "phrase": "long-term_performance"}, {"score": 0.002567498166608835, "phrase": "local_knowledge-exchange"}, {"score": 0.0025388011374541546, "phrase": "mutually-advantageous_bidirectional-knowledge-diffusion"}, {"score": 0.002473079487488344, "phrase": "proposed_network_adjustment"}, {"score": 0.002427177130359851, "phrase": "long-term_effectiveness"}, {"score": 0.0022859244876449396, "phrase": "periodical_re-adjustment_mechanism"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge transfer", " Knowledge connection structure", " Network structure adjustment", " Agent-based modeling"], "paper_abstract": "The influences of the network properties on the transfer of knowledge within the network have been extensively studied. However, the \"knowledge\" properties of the network largely less-attended in literature. In this paper we investigate whether the performance of knowledge transfer in a network can be influenced by adjusting the \"knowledge-connection\" structure of that network, as a primitive attempt to study knowledge transfer from the aspect of the \"knowledge\" properties of the network. By the \"knowledge-connection\" structure we mean the network structure that describes the knowledge distribution within the network. Therefore, the agent-based modeling approach is adopted in this paper to compare the performance of knowledge transfer in a series of networks which differ from one another in their \"knowledge-connection\" structures. The results of computational simulations illustrate that the network adjustment to increase the knowledge diversity in the directly-connected agent-pairs is helpful for improving the overall performance of knowledge transfer in the entire network in the short term; but the improvement of the long-term performance is less significant. Especially, if the local knowledge-exchange follows the mutually-advantageous bidirectional-knowledge-diffusion (BKD) model, the proposed network adjustment would instead hamper the long-term effectiveness of knowledge transfer. Further investigations show that the limitations can be overcome by adopting a periodical re-adjustment mechanism, through which the knowledge diversity in the network is maintained and persistent knowledge flow becomes possible. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Adjustment of knowledge-connection structure affects the performance of knowledge transfer", "paper_id": "WOS:000295193400060"}