{"auto_keywords": [{"score": 0.04759132288543124, "phrase": "academic_disciplines"}, {"score": 0.038969930118177225, "phrase": "country's_research_profile"}, {"score": 0.02962492740417451, "phrase": "revealed_comparative_advantage"}, {"score": 0.00481495049065317, "phrase": "sustained_interest"}, {"score": 0.004304963945457799, "phrase": "specific_advantage"}, {"score": 0.003910879154656061, "phrase": "comprehensive_structured_model"}, {"score": 0.003459191419478298, "phrase": "international_business"}, {"score": 0.0030270132320276096, "phrase": "social_sciences"}, {"score": 0.0027495914857929584, "phrase": "competitive_advantage"}, {"score": 0.002578880352208335, "phrase": "five_different_groups"}, {"score": 0.002537880772794665, "phrase": "distinct_combinations"}, {"score": 0.0024842242921857705, "phrase": "five_major_disciplines"}, {"score": 0.0023802825369325354, "phrase": "prior_literature"}, {"score": 0.002317533977770783, "phrase": "academic_diamond"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Revealed comparative advantage", " Academic disciplines", " Essential science indicators", " Scientific productivity"], "paper_abstract": "Within the field of bibliometrics, there is sustained interest in how nations \"compete\" in terms of academic disciplines, and what determinants explain why countries may have a specific advantage in one discipline over another. However, this literature has not, to date, presented a comprehensive structured model that could be used in the interpretation of a country's research profile and academic output. In this paper, we use frameworks from international business and economics to present such a model. Our study makes four major contributions. First, we include a very wide range of countries and disciplines, explicitly including the Social Sciences, which unfortunately are excluded in most bibliometrics studies. Second, we apply theories of revealed comparative advantage and the competitive advantage of nations to academic disciplines. Third, we cluster our 34 countries into five different groups that have distinct combinations of revealed comparative advantage in five major disciplines. Finally, based on our empirical work and prior literature, we present an academic diamond that details factors likely to explain a country's research profile and competitiveness in certain disciplines. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The competitive advantage of nations: An application to academia", "paper_id": "WOS:000331771900004"}