{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "quantitative_model"}, {"score": 0.0047007816199415905, "phrase": "medline._background"}, {"score": 0.004511297689862029, "phrase": "fundamental_and_intuitive_data_mining_strategy"}, {"score": 0.004419426676931621, "phrase": "real_scientific_questions"}, {"score": 0.004374192072307276, "phrase": "-node_search"}, {"score": 0.004344292058151148, "phrase": "title_words"}, {"score": 0.004070206389886153, "phrase": "medline"}, {"score": 0.0039464466517932706, "phrase": "human_assessment"}, {"score": 0.003906034193833338, "phrase": "serious_stumbling-block"}, {"score": 0.0033585620455333434, "phrase": "field_testers"}, {"score": 0.0033014033657620375, "phrase": "two-node_searches"}, {"score": 0.0032788123043064475, "phrase": "real_life_conditions"}, {"score": 0.0030298312658908855, "phrase": "eight_complementary_features"}, {"score": 0.0029376169407844314, "phrase": "logistic_regression_model"}, {"score": 0.0026774300859545826, "phrase": "overall_number"}, {"score": 0.00265909739882579, "phrase": "relevant_b-terms"}, {"score": 0.002482517733720377, "phrase": "two-node_search"}, {"score": 0.00236591959343317, "phrase": "so-called_one-node_search"}, {"score": 0.0022938652373998337, "phrase": "implicit_links"}, {"score": 0.002193634795186667, "phrase": "human_diseases"}, {"score": 0.002141487053045766, "phrase": "text_mining"}, {"score": 0.002126816206925344, "phrase": "implicit_information"}, {"score": 0.0021049977753042253, "phrase": "general_scientific_community"}], "paper_keywords": [""], "paper_abstract": "Background: Identifying information that implicitly links two disparate sets of articles is a fundamental and intuitive data mining strategy that can help investigators address real scientific questions. The Arrowsmith two-node search finds title words and phrases ( so-called B-terms) that are shared across two sets of articles within MEDLINE and displays them in a manner that facilitates human assessment. A serious stumbling-block has been the lack of a quantitative model for predicting which of the hundreds if not thousands of B-terms computed for a given search are most likely to be relevant to the investigator. Methodology/Principal Findings: Using a public two-node search interface, field testers devised a set of two-node searches under real life conditions and a certain number of B-terms were marked relevant. These were employed as `gold standards;' each B-term was characterized according to eight complementary features that were strongly correlated with relevance. A logistic regression model was developed that permits one to estimate the probability of relevance for each B-term, to rank B-terms according to their likely relevance, and to estimate the overall number of relevant B-terms inherent in a given two-node search. Conclusions/Significance: The model greatly simplifies and streamlines the process of carrying out a two-node search, and may be applicable to a number of other literature-based discovery applications, including the so-called one-node search and related gene-centric strategies that incorporate implicit links to predict how genes may be related to each other and to human diseases. This should encourage much wider exploration of text mining for implicit information among the general scientific community.", "paper_title": "A quantitative model for linking two disparate sets of articles in MEDLINE", "paper_id": "WOS:000248620400011"}