{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "evolutionary_optimization"}, {"score": 0.004768104290288521, "phrase": "neural_network_topologies"}, {"score": 0.004585212379675535, "phrase": "major_problems"}, {"score": 0.004474468584252318, "phrase": "crossover_operator"}, {"score": 0.004366387782457736, "phrase": "permutation_problem"}, {"score": 0.004302791070310513, "phrase": "simba_crossover"}, {"score": 0.004178351419209898, "phrase": "local_similarity"}, {"score": 0.003368948014436942, "phrase": "first_individual"}, {"score": 0.0030397596289795143, "phrase": "second_individual"}, {"score": 0.002838319783373086, "phrase": "first_one"}, {"score": 0.002729246328390722, "phrase": "randomly_selected_cut-point"}, {"score": 0.0026115277372906805, "phrase": "selected_individuals"}, {"score": 0.0024503741901918527, "phrase": "six_well-known_benchmark_classification_problems"}, {"score": 0.002265586601922693, "phrase": "new_crossover_operator"}, {"score": 0.0022107428653358715, "phrase": "compact_neural_networks"}, {"score": 0.0021891781017389783, "phrase": "satisfactory_generalization_capability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Artificial Neural Networks", " Evolutionary Algorithms", " Crossover operator"], "paper_abstract": "This work presents the SimBa (for Similarity-Based) crossover, a novel crossover operator specifically designed for the evolutionary optimization of neural network topologies that aims at overcoming one of the major problems generally related to the crossover operator, known as the permutation problem. The SimBa crossover starts by looking for a local similarity between two individuals selected from the population. The contribution of each neuron of the layer selected for the crossover is computed, and the neurons of each layer are reordered according to their contribution. Then, each neuron of the layer in the first individual is associated with the most similar neuron of the layer in the other individual, and the neurons of the layer of the second individual are re-ranked by considering the associations with the neurons of the first one. Finally, the neurons above a randomly selected cut-point are swapped to generate the offspring of the selected individuals. An approach exploiting this operator has been implemented and applied to six well-known benchmark classification problems. The experimental results, compared to those obtained by other techniques, show how this new crossover operator can help to produce compact neural networks with satisfactory generalization capability and accuracy. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "SimBa: A novel similarity-based crossover for neuro-evolution", "paper_id": "WOS:000333233200014"}