{"auto_keywords": [{"score": 0.04596394044716858, "phrase": "protease_inhibitor"}, {"score": 0.03984926174716525, "phrase": "binding_pockets"}, {"score": 0.03889146839064644, "phrase": "crystal_structure"}, {"score": 0.03614889315291277, "phrase": "mutation_patterns"}, {"score": 0.03207410241725965, "phrase": "data_mining_analysis"}, {"score": 0.004591067932677917, "phrase": "difficult_aspect"}, {"score": 0.004527214257206744, "phrase": "hiv._mutations"}, {"score": 0.004489327204473076, "phrase": "binding_pocket"}, {"score": 0.004280520151174946, "phrase": "present_study"}, {"score": 0.0042446888127531945, "phrase": "crystal_structures"}, {"score": 0.004127394241838696, "phrase": "nine_fda_approved_protease_inhibitors"}, {"score": 0.004081405308080498, "phrase": "pdb"}, {"score": 0.003968585341590009, "phrase": "mutational_changes"}, {"score": 0.0039024014688338964, "phrase": "developed_mutation_map"}, {"score": 0.003762750783551285, "phrase": "complexed_inhibitors"}, {"score": 0.0036382660173943393, "phrase": "amino_acid_sequence"}, {"score": 0.003459191419478298, "phrase": "mutation_map"}, {"score": 0.003363529379323618, "phrase": "crystal_structure_mutation_patterns"}, {"score": 0.003215924537673036, "phrase": "vivo_data"}, {"score": 0.003083415089790538, "phrase": "vivo_mutations"}, {"score": 0.0029233560054443483, "phrase": "important_structural_features"}, {"score": 0.002858466611898155, "phrase": "binding_conformation"}, {"score": 0.0027715824373846817, "phrase": "random_forest"}, {"score": 0.002598333022293788, "phrase": "rf-lda"}, {"score": 0.002583788342438538, "phrase": "rf-lr._random_forest"}, {"score": 0.0025477809372958953, "phrase": "feature_selection_proxy"}, {"score": 0.0025193357295530535, "phrase": "descriptor_space"}, {"score": 0.0023158555051565437, "phrase": "selected_descriptors"}, {"score": 0.0022835734354325504, "phrase": "optimal_classification_models"}, {"score": 0.002270786672851054, "phrase": "conformational_similarities"}, {"score": 0.002201725810874862, "phrase": "important_information"}, {"score": 0.0021771357714479946, "phrase": "structural_features"}, {"score": 0.0021049977753042253, "phrase": "vivo_genomic_data_sets"}], "paper_keywords": [""], "paper_abstract": "Mutations that arise in HIV-1 protease after exposure to various HIV-1 protease inhibitors have proved to be a difficult aspect in the treatment of HIV. Mutations in the binding pocket of the protease can prevent the protease inhibitor from binding to the protein effectively. In the present study, the crystal structures of 68 HIV-1 proteases complexed with one of the nine FDA approved protease inhibitors from the Protein Data Bank (PDB) were analyzed by (a) identifying the mutational changes with the aid of a developed mutation map and (b) correlating the structure of the binding pockets with the complexed inhibitors. The mutations of each crystal structure were identified by comparing the amino acid sequence of each structure against the HIV-1 wild-type strain HXB2. These mutations were visually presented in the form of a mutation map to analyze mutation patterns corresponding to each protease inhibitor. The crystal structure mutation patterns of each inhibitor (in vitro) were compared against the mutation patterns observed in in vivo data. The in vitro mutation patterns were found to be representative of most of the major in vivo mutations. We then performed a data mining analysis of the binding pockets from each crystal structure in terms of their chemical descriptors to identify important structural features of the HIV-1 protease protein with respect to the binding conformation of the HIV-1 protease inhibitors. Data mining analysis is performed using several classification techniques: Random Forest (RF), linear discriminant analysis (LDA), and logistic regression (LR). We developed two hybrid models, RF-LDA and RF-LR. Random Forest is used as a feature selection proxy, reducing the descriptor space to a few of the most relevant descriptors determined by the classifier. These descriptors are then used to develop the subsequent LDA, LR, and hierarchical classification models. Clustering analysis of the binding pockets using the selected descriptors used to produce the optimal classification models reveals conformational similarities of the ligands in each cluster. This study provides important information in understanding the structural features of HIV-1 protease which cannot be studied by other existing in vivo genomic data sets.", "paper_title": "Computational Analysis of HIV-1 Protease Protein Binding Pockets", "paper_id": "WOS:000283283100001"}