{"auto_keywords": [{"score": 0.04304998969990581, "phrase": "three-channel_video"}, {"score": 0.01546077573846739, "phrase": "clinical_consultation"}, {"score": 0.013580140601999193, "phrase": "medical_record"}, {"score": 0.00481495049065317, "phrase": "video_methods"}, {"score": 0.004640311812502743, "phrase": "background_single-channel_video"}, {"score": 0.004593787100061613, "phrase": "established_method"}, {"score": 0.004517275498868226, "phrase": "training_general_practitioners"}, {"score": 0.004368037394395782, "phrase": "body_language"}, {"score": 0.004043158538239064, "phrase": "conventional_view"}, {"score": 0.003949144559926685, "phrase": "doctor's_facial_expression"}, {"score": 0.0038964032225585117, "phrase": "video_output"}, {"score": 0.0037423521744765075, "phrase": "camera_angles"}, {"score": 0.003558294449586273, "phrase": "single_and_multi-channel_approaches"}, {"score": 0.00344062888674746, "phrase": "single_channel"}, {"score": 0.0033832583769880576, "phrase": "simulated_consultations"}, {"score": 0.002957327365538023, "phrase": "visual_information"}, {"score": 0.002888488567436329, "phrase": "single_channel_video"}, {"score": 0.0028594775336675897, "phrase": "major_elements"}, {"score": 0.002700485592691974, "phrase": "quantifiable_non-verbal_communication"}, {"score": 0.0023131084326717755, "phrase": "future_development"}, {"score": 0.0022898630573629144, "phrase": "multi-channel_video"}, {"score": 0.002259231376607264, "phrase": "multi-channel_methods"}, {"score": 0.0021049977753042253, "phrase": "doctor's_knowledge"}], "paper_keywords": ["general practice", " family practice", " medical record systems", " computerized", " computers"], "paper_abstract": "Background Single-channel video is an established method for assessing clinical consultation in training general practitioners; however, it is hard to infer the body language of the doctor or how information in the consultation is being integrated into the medical record. A three-channel video was developed combining the conventional view with a camera looking at the doctor's facial expression and copying the video output from the monitor. However, the choice of three channels and camera angles selected has not been critically appraised. Objective. To develop criteria for comparing single and multi-channel approaches to video recording of the consultation. Methods. Single channel and three-channel recordings of simulated consultations were shown to a panel of 12 health professionals and interviews were conducted to gather their opinions on the level of information presented, quality and assessment. The transcripts were analysed thematically. Results. It was found that in providing visual information the three-channel video was superior to the single channel video. The major elements needed for comparison of the two techniques would be the ability of the video to pick up quantifiable non-verbal communication of the doctor and the patient, and the ability to qualitatively and quantitatively reflect the use and impact of the computer on the consultation. The information provided by the three-channel video could be further classified to essential, desirable and redundant to guide the future development of the multi-channel video. Conclusions. Multi-channel methods should be able to capture the following information: body language and facial expression of doctor and patient- and how the doctor's knowledge and information collected in the consultation are synthesized into the medical record.", "paper_title": "A framework for comparing video methods used to assess the clinical consultation: a qualitative study", "paper_id": "WOS:000243492100003"}