{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "literary_texts"}, {"score": 0.009698220274405776, "phrase": "visual_analog_scale"}, {"score": 0.0069588248853542384, "phrase": "fuzzy_sets"}, {"score": 0.006405502605124312, "phrase": "literary_and_nonliterary_texts"}, {"score": 0.004610058444728656, "phrase": "purpose_-_the_purpose"}, {"score": 0.00443133501650381, "phrase": "two-stage_pilot_study"}, {"score": 0.0040943214728975845, "phrase": "subject_description"}, {"score": 0.00316565009987584, "phrase": "nonparametric_statistics"}, {"score": 0.003140680985599885, "phrase": "qualitative_analysis"}, {"score": 0.0030427525339358935, "phrase": "findings_-_participants"}, {"score": 0.0028334016912935165, "phrase": "nonliterary_texts"}, {"score": 0.0026384167183586015, "phrase": "preliminary_support"}, {"score": 0.002546002312015341, "phrase": "useful_theoretical_basis"}, {"score": 0.0023801608396295396, "phrase": "sound_theoretical_guidance"}, {"score": 0.002278639906498682, "phrase": "structured_comparison"}, {"score": 0.002207530926563892, "phrase": "theoretical_base"}, {"score": 0.002164216680934624, "phrase": "practical_decisions"}, {"score": 0.0021049977753042253, "phrase": "subject_analysis"}], "paper_keywords": ["Fuzzy sets", " Visual analogue scales", " Indexing", " Libraries", " Literary forms"], "paper_abstract": "Purpose - The purpose of this paper is to describe a conceptualization and two-stage pilot study that explores ways in which fuzzy sets can be used to measure the indexability of literary texts. Design/methodology/approach - Participants provided a subject description for each in a series of literary and nonliterary texts. Each participant was also randomly assigned to one of three tasks: using a visual analog scale to rate the clarity of each text, using a visual analog scale to rate the confidence each participant felt in describing the subject of each text, or sorting the texts from most to least clear without the use of a visual analog scale. Nonparametric statistics and qualitative analysis were used to analyze the data. Findings - Participants and coders used the visual analog scales successfully. The participants perceived literary texts as less clear than nonliterary texts, and expressed less confidence in their subject description of literary texts than in their descriptions of literary texts. The study found preliminary support for the idea that fuzzy sets can provide a useful theoretical basis for examining the indexability of texts. Originality/value - A measure of the indexability of literary texts could help provide sound theoretical guidance for construction of tools to organize those texts. A structured comparison of literary and nonliterary texts could help to build a theoretical base from which to make practical decisions about whether and how to perform subject analysis on each type of text.", "paper_title": "Fuzzy sets and the organization of literary texts: a conceptualization and two-stage pilot study", "paper_id": "WOS:000294831600003"}