{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "link_metrics"}, {"score": 0.01557276120808942, "phrase": "end-to-end_path_measurements"}, {"score": 0.004483909657713567, "phrase": "individual_link_metrics"}, {"score": 0.004420472010542188, "phrase": "communication_network"}, {"score": 0.003962899903266524, "phrase": "linearly_independent_measurement_paths"}, {"score": 0.0036379729015583975, "phrase": "network_topology"}, {"score": 0.0034526191487098093, "phrase": "measurement_paths"}, {"score": 0.0028274743316389437, "phrase": "necessary_and_sufficient_connectivity_conditions"}, {"score": 0.002696101728474703, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0025103699913760057, "phrase": "efficient_identifiability_tests"}, {"score": 0.0024397017438101726, "phrase": "efficient_algorithm"}, {"score": 0.0023936956017015696, "phrase": "minimum_number"}, {"score": 0.0022500695985527668, "phrase": "random_and_real_topologies"}, {"score": 0.0022076314894741394, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "baseline_solution"}], "paper_keywords": ["Identifiability condition", " linear algebraic model", " monitor placement", " network tomography"], "paper_abstract": "We investigate the problem of identifying individual link metrics in a communication network from end-to-end path measurements, under the assumption that linkmetrics are additive and constant. To uniquely identify the link metrics, the number of linearly independent measurement paths must equal the number of links. Our contribution is to characterize this condition in terms of the network topology and the number/placement of monitors, under the constraint that measurement paths must be cycle-free. Our main results are: 1) it is generally impossible to identify all the link metrics by using two monitors; 2) nevertheless, metrics of all the interior links not incident to any monitor are identifiable by two monitors if the topology satisfies a set of necessary and sufficient connectivity conditions; 3) these conditions naturally extend to a necessary and sufficient condition for identifying all the link metrics using three or more monitors. We show that these conditions not only facilitate efficient identifiability tests, but also enable an efficient algorithm to place the minimum number of monitors in order to identify all link metrics. Our evaluations on both random and real topologies show that the proposed algorithm achieves identifiability using a much smaller number of monitors than a baseline solution.", "paper_title": "Inferring Link Metrics From End-To-End Path Measurements: Identifiability and Monitor Placement", "paper_id": "WOS:000340944200025"}