{"auto_keywords": [{"score": 0.038384850350942364, "phrase": "dynamic_k-taa_scheme"}, {"score": 0.03135914418496128, "phrase": "ap"}, {"score": 0.02810412479022069, "phrase": "signature_scheme"}, {"score": 0.00444377150105556, "phrase": "dynamic_k-taa"}, {"score": 0.004167451906343558, "phrase": "better_control"}, {"score": 0.00401961206251868, "phrase": "space_complexity"}, {"score": 0.003987474771008829, "phrase": "existing_dynamic_k-taa_schemes"}, {"score": 0.0038152404172111815, "phrase": "allowed_number"}, {"score": 0.0033822643082593285, "phrase": "a._constant_proving_effort"}, {"score": 0.0033552055241931346, "phrase": "public_key_size"}, {"score": 0.0031590250068577867, "phrase": "ordinary_k-taa_scheme"}, {"score": 0.0029862549873935496, "phrase": "setup_freeness"}, {"score": 0.0026792166577171476, "phrase": "short_group_signature_scheme"}, {"score": 0.002615381301695394, "phrase": "efficient_protocols"}, {"score": 0.0024133533748653033, "phrase": "committed_block"}, {"score": 0.0022904619303011097, "phrase": "standard_model"}, {"score": 0.0022630008787375435, "phrase": "q-sdh_assumption"}, {"score": 0.0021049977753042253, "phrase": "random_oracle_model"}], "paper_keywords": ["k-TAA", " dynamic k-TAA"], "paper_abstract": "k-times anonymous authentication (k-TAA) schemes allow members of a group to be authenticated anonymously by application providers for a bounded number of times. Dynamic k-TAA allows application providers to independently grant or revoke users from their own access group so as to provide better control over their clients. In terms of time and space complexity, existing dynamic k-TAA schemes are of complexities O(k), where k is the allowed number of authentication. In this paper, we construct a dynamic k-TAA scheme with space and time complexities of 0(log(k)). We also outline how to construct dynamic k-TAA scheme with a. constant proving effort. Public key size of this variant, however, is O(k). We then construct an ordinary k-TAA scheme from the dynamic scheme. We also describe a trade-off between efficiency and setup freeness of AP, in which AP does not need to hold any secret while maintaining control over their clients. To build our system, we modify the short group signature scheme into a signature scheme and provide efficient protocols that allow one to prove in zero-knowledge the knowledge of a signature and to obtain a signature on a committed block of messages. We prove that the signature scheme is secure in the standard model under the q-SDH assumption. Finally, we show that our dynamic k-TAA scheme, constructed from bilinear pairing, is secure in the random oracle model.", "paper_title": "Constant-size dynamic k-TAA", "paper_id": "WOS:000240537600008"}