{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "owl_ontologies"}, {"score": 0.0047722145315845016, "phrase": "important_approach"}, {"score": 0.004632469280786256, "phrase": "input_ontology"}, {"score": 0.0045370785151713396, "phrase": "new_set"}, {"score": 0.004404188306112211, "phrase": "scalable_query_answering_algorithms"}, {"score": 0.004212084623472799, "phrase": "horn-shiq"}, {"score": 0.004052358316137446, "phrase": "resolution-based_algorithms"}, {"score": 0.003933609372601274, "phrase": "ontology_language"}, {"score": 0.0038411109150557504, "phrase": "aforementioned_logics"}, {"score": 0.003619235073669304, "phrase": "performance_prices"}, {"score": 0.003481911583035097, "phrase": "specific_language"}, {"score": 0.003251552926963083, "phrase": "efficient_rewriting_algorithms"}, {"score": 0.0032130703855586685, "phrase": "owl._first"}, {"score": 0.0029124302021905366, "phrase": "main_problems"}, {"score": 0.002895138734813006, "phrase": "typical_resolution_algorithms"}, {"score": 0.002810204880249441, "phrase": "language_elhi"}, {"score": 0.0027277558893834273, "phrase": "difficult_task"}, {"score": 0.0027115578750853673, "phrase": "elhi"}, {"score": 0.0026874405408023956, "phrase": "relatively_expressive_language"}, {"score": 0.0025547615880525745, "phrase": "small_extensions"}, {"score": 0.0024577274522206436, "phrase": "extensive_experimental_evaluation"}, {"score": 0.002371424085814217, "phrase": "first_evaluation"}, {"score": 0.002181626277903721, "phrase": "existing_systems"}, {"score": 0.002142970278347126, "phrase": "additional_backwards_subsumption_checking_step"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Query answering", " Query rewriting", " Ontology", " Description logics", " Resolution"], "paper_abstract": "An important approach to query answering over OWL ontologies is via rewriting the input ontology (and query) into a new set of axioms that are expressed in logics for which scalable query answering algorithms exist. This approach has been studied for many important fragments of OWL like SHIQ, Horn-SHIQ, OWL 2 QL, and OWL 2 EL. An important family of rewriting algorithms is the family of resolution-based algorithms, mostly because of their ability to adapt to any ontology language (such algorithms have been proposed for all aforementioned logics) and the long years of research in resolution theorem-proving. However, this generality comes with performance prices and many approaches that implement algorithms that are tailor-made to a specific language are more efficient than the (usually) general-purposed resolution-based ones. In the current paper we revisit and refine the resolution approaches in order to design efficient rewriting algorithms for many important fragments of OWL. First, we present an algorithm for the language DL-Lite(R,Pi) which is strongly related to OWL 2 QL. Our calculus is optimised in such a way that it avoids performing many unnecessary inferences, one of the main problems of typical resolution algorithms. Subsequently, we extend the algorithm to the language ELHI which is strongly related to OWL 2 EL. This is a difficult task as ELHI is a relatively expressive language, however, we show that the calculus for DL-Lite(R,Pi) requires small extensions. Finally, we have implemented all algorithms and have conducted an extensive experimental evaluation using many well-known large and complex OWL ontologies. On the one hand, this is the first evaluation of rewriting algorithms of this magnitude, while, on the other hand, our results show that our system is in many cases several orders of magnitude faster than the existing systems even though it uses an additional backwards subsumption checking step. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Optimising resolution-based rewriting algorithms for OWL ontologies", "paper_id": "WOS:000366564100003"}