{"auto_keywords": [{"score": 0.049090714218291594, "phrase": "psa"}, {"score": 0.04701209021022985, "phrase": "pca"}, {"score": 0.00481495049065317, "phrase": "high_performance_mass_spectral_serum"}, {"score": 0.004755650013733963, "phrase": "prostate-specific_antigen"}, {"score": 0.0045443671106012405, "phrase": "prostate_cancer"}, {"score": 0.004414806639101985, "phrase": "psa_level"}, {"score": 0.00428892403807229, "phrase": "prostatic_enlargement"}, {"score": 0.004132312946154097, "phrase": "psa_test_specificity"}, {"score": 0.003835972725191194, "phrase": "mass_spectrometry_data"}, {"score": 0.00371115485111022, "phrase": "benign_specimens"}, {"score": 0.003680587852807675, "phrase": "serum_samples"}, {"score": 0.0029805015010906013, "phrase": "new_marker_selection_algorithm"}, {"score": 0.002709862658377861, "phrase": "positive_predictive_value"}, {"score": 0.0026107601878587816, "phrase": "negative_predictive_value"}, {"score": 0.002589241149747789, "phrase": "npv"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Biomarker", " Mass spectrometry", " Preprocessing", " Feature selection"], "paper_abstract": "Prostate-specific antigen (PSA) is the most widely used serum biomarker for early detection of prostate cancer (PCA). Nevertheless, PSA level can be falsely elevated due to prostatic enlargement, inflammation or infection, which limits the PSA test specificity. The objective of this study is to use a machine learning approach for the analysis of mass spectrometry data to discover more reliable biomarkers that distinguish PCA from benign specimens. Serum samples from 179 prostate cancer patients and 74 benign patients were analyzed. These samples were processed using ProXPRESSION (TM) Biomarker Enrichment Kits (PerkinElmer). Mass spectra were acquired using a prOTOF (TM) 2000 matrix-assisted laser desorption/ionization orthogonal time-of-flight (MALDI-O-TOF) mass spectrometer. In this study, we search for potential biomarkers using our feature selection method, the Extended Markov Blanket (EMB). From the new marker selection algorithm, a panel of 26 peaks achieved an accuracy of 80.7%, a sensitivity of 83.5%, a specificity of 74.4%, a positive predictive value (PPV) of 87.9%, and a negative predictive value (NPV) of 68.2%. On the other hand, when PSA alone was used (with a cutoff of 4.0 ng/ml), a sensitivity of 66.7%, a specificity of 53.6%, a PPV of 73.5%, and a NPV of 45.4% were obtained. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Prostate cancer biomarker discovery using high performance mass spectral serum profiling", "paper_id": "WOS:000269109300004"}