{"auto_keywords": [{"score": 0.04982918370230505, "phrase": "paragon"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_datacenters"}, {"score": 0.004641890423057823, "phrase": "diverse_applications"}, {"score": 0.004557696368772907, "phrase": "colocated_workloads"}, {"score": 0.004202741104973709, "phrase": "previous_work"}, {"score": 0.0040942189695983185, "phrase": "existing_solutions"}, {"score": 0.004071618691288019, "phrase": "arq"}, {"score": 0.0036680857629458816, "phrase": "robust_analytical_methods"}, {"score": 0.003417783486028524, "phrase": "collaborative_filtering_techniques"}, {"score": 0.003355717283753749, "phrase": "unknown_incoming_workload"}, {"score": 0.0032861588691414667, "phrase": "multiple_shared_resources"}, {"score": 0.0031513240597392843, "phrase": "schedule_applications"}, {"score": 0.0030779179341450984, "phrase": "server_utilization"}, {"score": 0.00304584255226538, "phrase": "initial_application_placement"}, {"score": 0.0030141004214902373, "phrase": "application_behavior"}, {"score": 0.002982688100421823, "phrase": "scheduling_decisions"}, {"score": 0.0029438813080245544, "phrase": "performance_degradations"}, {"score": 0.002771754731852373, "phrase": "separate_classes"}, {"score": 0.002693018258362651, "phrase": "long_queueing_delays"}, {"score": 0.002630259620763024, "phrase": "highly-loaded_scenarios"}, {"score": 0.0025555322596460036, "phrase": "marginal_scheduling_overheads"}, {"score": 0.002469943756401981, "phrase": "wide_range"}, {"score": 0.0024570325245029286, "phrase": "workload_scenarios"}, {"score": 0.002431411689381161, "phrase": "small_and_large-scale_systems"}, {"score": 0.002343819560536301, "phrase": "performance_guarantees"}, {"score": 0.002116063056604833, "phrase": "oversubscribed_scenarios"}, {"score": 0.0021049977753042253, "phrase": "resource_efficiency"}], "paper_keywords": ["Design", " Performance", " Datacenter", " cloud computing", " resource-efficiency", " heterogeneity", " interference", " scheduling", " QoS"], "paper_abstract": "Large-scale datacenters (DCs) host tens of thousands of diverse applications each day. However, interference between colocated workloads and the difficulty of matching applications to one of the many hardware platforms available can degrade performance, violating the quality of service (QoS) guarantees that many cloud workloads require. While previous work has identified the impact of heterogeneity and interference, existing solutions are computationally intensive, cannot be applied online, and do not scale beyond a few applications. We present Paragon, an online and scalable DC scheduler that is heterogeneity-and interference-aware. Paragon is derived from robust analytical methods, and instead of profiling each application in detail, it leverages information the system already has about applications it has previously seen. It uses collaborative filtering techniques to quickly and accurately classify an unknown incoming workload with respect to heterogeneity and interference in multiple shared resources. It does so by identifying similarities to previously scheduled applications. The classification allows Paragon to greedily schedule applications in a manner that minimizes interference and maximizes server utilization. After the initial application placement, Paragon monitors application behavior and adjusts the scheduling decisions at runtime to avoid performance degradations. Additionally, we design ARQ, a multiclass admission control protocol that constrains application waiting time. ARQ queues applications in separate classes based on the type of resources they need and avoids long queueing delays for easy-to-satisfy workloads in highly-loaded scenarios. Paragon scales to tens of thousands of servers and applications with marginal scheduling overheads in terms of time or state. We evaluate Paragon with a wide range of workload scenarios, on both small and large-scale systems, including 1,000 servers on EC2. For a 2,500-workload scenario, Paragon enforces performance guarantees for 91% of applications, while significantly improving utilization. In comparison, heterogeneity-oblivious, interference-oblivious, and least-loaded schedulers only provide similar guarantees for 14%, 11%, and 3% of workloads. The differences are more striking in oversubscribed scenarios where resource efficiency is more critical.", "paper_title": "QoS-Aware Scheduling in Heterogeneous Datacenters with Paragon", "paper_id": "WOS:000329130800004"}