{"auto_keywords": [{"score": 0.029970178858875544, "phrase": "fpm"}, {"score": 0.00481495049065317, "phrase": "simd_support"}, {"score": 0.004701985831087475, "phrase": "improved_simd_floating-point_performance"}, {"score": 0.004420472010542188, "phrase": "conflicting_demand"}, {"score": 0.004357927940322685, "phrase": "low-power_computing_market"}, {"score": 0.004255639740735269, "phrase": "power_consumption"}, {"score": 0.004077508669922702, "phrase": "absolute_necessity"}, {"score": 0.004038943596016986, "phrase": "backward_compatibility"}, {"score": 0.0031393948330209255, "phrase": "binary_floating-point_arithmetic"}, {"score": 0.0029935730127943496, "phrase": "good_simd_performance"}, {"score": 0.002787406053363446, "phrase": "multiple_precisions"}, {"score": 0.0027479040199262393, "phrase": "iterative_rectangular_multiplier"}, {"score": 0.002304263635960015, "phrase": "five_cycles"}, {"score": 0.0022715929119140194, "phrase": "iterative_fpm"}, {"score": 0.0021557052355026048, "phrase": "similar_functionality"}, {"score": 0.0021251363422701446, "phrase": "proposed_iterative_fpm"}], "paper_keywords": ["Computer arithmetic", " rectangular multiplier", " floating-point arithmetic", " low-power", " multiplying circuits", " multimedia", " very-large-scale integration"], "paper_abstract": "The demand for improved SIMD floating-point performance on general-purpose x86-compatible microprocessors is rising. At the same time, there is a conflicting demand in the low-power computing market for a reduction in power consumption. Along with this, there is the absolute necessity of backward compatibility for x86-compatible microprocessors, which includes the support of x87 scientific floating-point instructions. The combined effect is that there is a need for low-power, low-cost floating-point units that are still capable of delivering good SIMD performance while maintaining full x86 functionality. This paper presents the design of an x86-compatible floating-point multiplier (FPM) that is compliant with the IEEE-754 Standard for Binary Floating-Point Arithmetic [12] and is specifically tailored to provide good SIMD performance in a low-cost, low-power solution while maintaining full x87 backward compatibility. The FPM efficiently supports multiple precisions using an iterative rectangular multiplier. The FPM can perform two parallel single-precision multiplies every cycle with a latency of two cycles, one double-precision multiply every two cycles with a latency of four cycles, or one extended-double-precision multiply every three cycles with a latency of five cycles. The iterative FPM also supports division, square-root, and transcendental functions. Compared to a previous design with similar functionality, the proposed iterative FPM has 60 percent less area and 59 percent less dynamic power dissipation.", "paper_title": "Low-Power Multiple-Precision Iterative Floating-Point Multiplier with SIMD Support", "paper_id": "WOS:000261846600004"}