{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_projects"}, {"score": 0.010023863465989585, "phrase": "software_engineers"}, {"score": 0.009306845976693996, "phrase": "different_characteristics"}, {"score": 0.008542464684484519, "phrase": "model-based_testing"}, {"score": 0.006834231113122935, "phrase": "model-based_testing_approaches"}, {"score": 0.004732785510739708, "phrase": "software_technologies"}, {"score": 0.0036553070575015344, "phrase": "technical_literature"}, {"score": 0.0032398798149196432, "phrase": "software_project"}, {"score": 0.0028715299874549245, "phrase": "porantim"}, {"score": 0.0026041635822373265, "phrase": "secondary_and_primary_experimental_studies"}, {"score": 0.002444544487772349, "phrase": "impact_criteria"}, {"score": 0.0023346234464901978, "phrase": "software_technology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software testing", " Model-based testing", " Software technologies selection", " Experimental studies"], "paper_abstract": "Selecting software technologies for software projects represents a challenge to software engineers. It is known that software projects differ from each other by presenting different characteristics that can complicate the selection of such technologies. This is not different when considering model-based testing. There are many approaches with different characteristics described in the technical literature that can be used in software projects. However, there is no indication as to how they can fit a software project. Therefore, a strategy to select model-based testing approaches for software projects called Porantim is fully described in this paper. Porantim is based on a body of knowledge describing model-based testing approaches and their characterization attributes (identified by secondary and primary experimental studies), and a process to guide by adequacy and impact criteria regarding the use of this sort of software technology that can be used by software engineers to select model-based testing approaches for software projects. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Model-based testing approaches selection for software projects", "paper_id": "WOS:000270619300002"}