{"auto_keywords": [{"score": 0.038112619830095326, "phrase": "dynamic_models"}, {"score": 0.00481495049065317, "phrase": "simulation_model_construction"}, {"score": 0.0035519826240477444, "phrase": "key_simulation_domain_constraints"}, {"score": 0.003482160257566501, "phrase": "dynamic_model_components"}, {"score": 0.0031115683920520773, "phrase": "domain_ontologies"}, {"score": 0.0029903851294825023, "phrase": "human-interface_layer"}, {"score": 0.002602127996667857, "phrase": "accessible_way"}, {"score": 0.0025678829712650437, "phrase": "author_visualizations"}, {"score": 0.0024678216843278806, "phrase": "new_teaching_tools"}, {"score": 0.0024192592458651204, "phrase": "concrete_and_abstract_knowledge"}, {"score": 0.0023716501597131024, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "specifically_cardiovascular_physiology"}], "paper_keywords": ["ontology", " simulation", " visualization", " semantic web"], "paper_abstract": "The purpose of an ontology is to structurally define knowledge about a topic. For the practice of simulation, ontologies have been demonstrated to be useful across a variety of techniques ranging from formally defining the components of dynamic models and capturing key simulation domain constraints to interrelating dynamic model components and geometry in order to visualize a phenomenon. We have created a methodology that requires domain ontologies to be rendered in the human-interface layer in support of the construction of dynamic models and their corresponding visualizations. We hypothesize that this methodology will provide a novel and accessible way to author visualizations and a framework for creating new teaching tools that merge concrete and abstract knowledge. A case study of our methodology is performed by applying our software prototype to simulation and visualization in the domain of healthcare, specifically cardiovascular physiology", "paper_title": "An ontology-enabled user interface for simulation model construction and visualization", "paper_id": "WOS:000208736400003"}