{"auto_keywords": [{"score": 0.015353472932541941, "phrase": "important_role"}, {"score": 0.004627441072541506, "phrase": "full_potential"}, {"score": 0.00450052670755585, "phrase": "rna_splicing"}, {"score": 0.003823791479971016, "phrase": "double-stranded_rna"}, {"score": 0.00374853113087709, "phrase": "adenosine"}, {"score": 0.0034208822062692127, "phrase": "numerous_mrna"}, {"score": 0.0033937776228549557, "phrase": "pre-mrna_transcripts"}, {"score": 0.003097043800165555, "phrase": "specific_sites"}, {"score": 0.0029409171055888804, "phrase": "important_factors"}, {"score": 0.0028601252251285025, "phrase": "specific_deamination"}, {"score": 0.002826181226538412, "phrase": "molecular_dynamic_simulation"}, {"score": 0.002726740692380339, "phrase": "binding_stability"}, {"score": 0.0022977342663599042, "phrase": "rna_duplex"}, {"score": 0.0022524395393089544, "phrase": "detailed_structural_analysis"}, {"score": 0.0022168460543913787, "phrase": "minor_groove_width"}, {"score": 0.002181813794658713, "phrase": "global_shape"}, {"score": 0.0021049977753042253, "phrase": "specific_reading_mechanism"}], "paper_keywords": ["RNA editing", " A-I deamination editing", " Adenosine deaminases acting on RNA (ADARs)", " GluR-2 pre-mRNA", " Mismatch", " MD simulation"], "paper_abstract": "RNA editing plays an important role in realizing the full potential of a given genome. Different from RNA splicing, RNA editing fine-tunes the sequence of RNA by changing only one or two nucleotides. A-I editing [deamination of adenosine (A) to create inosine (I)] is best characterized in mammals and occurs in the regions of double-stranded RNA (dsRNA). Adenosine deaminases acting on RNA (ADARs) are members of a family of enzymes involved in A-I deamination editing in numerous mRNA and pre-mRNA transcripts. Experimental study shows that ADAR2 selectively edits the R/G site, while ADAR1 edits more promiscuously at several other adenosines. How ADAR2 selects specific sites for deamination is poorly understood. Mismatches have been suggested to be important factors that allow the ADAR2 to achieve specific deamination. Using molecular dynamic simulation, we studied the effect of mismatch on binding stability of the dsRNA/ADAR2 complex. By comparison of two binding domains of ADAR2, we found that ADAR2 dsRBM2 (second binding domain of ADAR2) does not bind well with mismatch reversed GluR-2 RNA. When mismatch is reversed, dsRBM2 of ADAR2 slides along the RNA duplex in the simulation. Detailed structural analysis indicates that the minor groove width of dsRNA and global shape of RNA may play an important role in the specific reading mechanism of ADAR2.", "paper_title": "Effect of mismatch on binding of ADAR2/GluR-2 pre-mRNA complex", "paper_id": "WOS:000360850900003"}