{"auto_keywords": [{"score": 0.031750388255257174, "phrase": "bedding_material"}, {"score": 0.013075530403111952, "phrase": "classification_method"}, {"score": 0.011585137836911364, "phrase": "activity_types"}, {"score": 0.00481495049065317, "phrase": "farrowing_house"}, {"score": 0.004785682967399109, "phrase": "acceleration_data"}, {"score": 0.004656154865460475, "phrase": "sows'_activity_types"}, {"score": 0.0045717473871437425, "phrase": "five_types"}, {"score": 0.00448886315956469, "phrase": "multivariate_dynamic_linear_models"}, {"score": 0.0039370647208387234, "phrase": "multi-process_kalman_filter"}, {"score": 0.003749462025612395, "phrase": "test_data_set"}, {"score": 0.003703969862557761, "phrase": "activity_classification"}, {"score": 0.0033286584733612525, "phrase": "second_step"}, {"score": 0.0032983098564490208, "phrase": "suggested_method"}, {"score": 0.0031124046570971398, "phrase": "bedding_materials"}, {"score": 0.0025286424059485745, "phrase": "averaged_time"}, {"score": 0.002407989349089638, "phrase": "ha_and_ma_increases"}, {"score": 0.002386014719597134, "phrase": "behavioural_changes"}, {"score": 0.0022514137676797985, "phrase": "straightforward_perspectives"}, {"score": 0.0022037570028628295, "phrase": "monitoring_activity_types"}, {"score": 0.00218364206035443, "phrase": "e.g._automatic_detection"}, {"score": 0.00214396012113301, "phrase": "health_disorders"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Acceleration", " Body activity", " Dynamic linear models", " Multi-Process Kalman Filter", " Parturition"], "paper_abstract": "This article suggests a method for classifying sows' activity types performed in farrowing house. Five types of activity are modeled using multivariate dynamic linear models: high active (HA), medium active (MA), lying laterally on one side (L1), lying laterally on the other side (L2) and lying sternally (LS). The classification method is based on a Multi-Process Kalman Filter (MPKF) of class I. The performance of the method is validated using a Test data set. Results of activity classification appear satisfying: 75-100% of series are correctly classified within their activity type. When collapsing activity types into active (HA and MA) vs. passive (L1, L2, LS) categories, results range from 96 to 100%. In a second step, the suggested method is applied on series collected for 19 sows around the onset of farrowing, including 9 sows that received bedding materials (57 sow days in total) and 10 sows that received no bedding material (61 sow days in total). Results indicate that there is a marked (i) increase of active behaviours (HA and MA, p < 0.001) and (ii) decrease of lying laterally (L1 and L2) behaviours starting 20-16 h before the onset of farrowing; during the last 24 h before parturition, the averaged time spent lying laterally in a row decreases and the number of changes of activity types for HA and MA increases.These behavioural changes occur for sows both with and without bedding material, but are more marked when bedding material is provided. Straightforward perspectives for applications of this classification method for monitoring activity types are, e.g. automatic detection of farrowing and detection of health disorders. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Modelling and monitoring sows' activity types in farrowing house using acceleration data", "paper_id": "WOS:000292227200019"}