{"auto_keywords": [{"score": 0.031739857749506044, "phrase": "joint_likelihood"}, {"score": 0.012138725433614108, "phrase": "whole-object_segmentor"}, {"score": 0.004815333283697408, "phrase": "multiple"}, {"score": 0.003980531478122155, "phrase": "object_class"}, {"score": 0.0037697665240643066, "phrase": "binary_classification_problem"}, {"score": 0.0035701213515857227, "phrase": "local_shape_feature"}, {"score": 0.0035507457285983268, "phrase": "based_weak_classifiers"}, {"score": 0.0034742854447532678, "phrase": "new_image"}, {"score": 0.002966900048034132, "phrase": "multiple_objects"}, {"score": 0.0026898636962522505, "phrase": "inter-object_occlusion_reasoning"}, {"score": 0.0026033756286033285, "phrase": "object_silhouettes"}, {"score": 0.0023346234464901978, "phrase": "multiple_object_hypotheses"}, {"score": 0.0022967713922705, "phrase": "proposed_approach"}, {"score": 0.00217496508306238, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "previous_ones"}], "paper_keywords": ["Object detection", " Object segmentation"], "paper_abstract": "We propose a method that detects and segments multiple, partially occluded objects in images. A part hierarchy is defined for the object class. Both the segmentation and detection tasks are formulated as binary classification problem. A whole-object segmentor and several part detectors are learned by boosting local shape feature based weak classifiers. Given a new image, the part detectors are applied to obtain a number of part responses. All the edge pixels in the image that positively contribute to the part responses are extracted. A joint likelihood of multiple objects is defined based on the part detection responses and the object edges. Computation of the joint likelihood includes an inter-object occlusion reasoning that is based on the object silhouettes extracted with the whole-object segmentor. By maximizing the joint likelihood, part detection responses are grouped, merged, and assigned to multiple object hypotheses. The proposed approach is demonstrated with the class of pedestrians. The experimental results show that our method outperforms the previous ones.", "paper_title": "Detection and Segmentation of Multiple, Partially Occluded Objects by Grouping, Merging, Assigning Part Detection Responses", "paper_id": "WOS:000263421200004"}