{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weighted_distance-based_models"}, {"score": 0.011686570588253498, "phrase": "modal_ranking"}, {"score": 0.010684639795428413, "phrase": "homogeneous_population"}, {"score": 0.004657542074154025, "phrase": "political_studies"}, {"score": 0.004077508669922702, "phrase": "ranking_data"}, {"score": 0.003925414526537783, "phrase": "distance-based_ranking_models"}, {"score": 0.0036207206487324506, "phrase": "observed_ranking"}, {"score": 0.0033875770020590796, "phrase": "ranking_probability"}, {"score": 0.003199687131875466, "phrase": "single_dispersion_parameter"}, {"score": 0.0028409576481842457, "phrase": "recently_developed_weighted_distance-based_models"}, {"score": 0.0027479040199262393, "phrase": "different_ranks"}, {"score": 0.0022500695985527668, "phrase": "proposed_methodology"}, {"score": 0.0022181655497912796, "phrase": "synthetic_ranking_datasets"}, {"score": 0.002186712881521657, "phrase": "real_world_ranking_dataset"}, {"score": 0.0021659920594094407, "phrase": "political_goals_priority"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ranking data", " Distance-based models", " Mixtures models"], "paper_abstract": "Analysis of ranking data is often required in various fields of study, for example politics, market research and psychology. Over the years, many statistical models for ranking data have been developed. Among them, distance-based ranking models postulate that the probability of observing a ranking of items depends on the distance between the observed ranking and a modal ranking. The closer to the modal ranking, the higher the ranking probability is. However, such a model assumes a homogeneous population, and the single dispersion parameter in the model may not be able to describe the data well. To overcome these limitations, we formulate more flexible models by considering the recently developed weighted distance-based models which can allow different weights for different ranks. The assumption of a homogeneous population can be relaxed by an extension to mixtures of weighted distance-based models. The properties of weighted distance-based models are also discussed. We carry out simulations to test the performance of our parameter estimation and model selection procedures. Finally, we apply the proposed methodology to analyze synthetic ranking datasets and a real world ranking dataset about political goals priority. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Mixtures of weighted distance-based models for ranking data with applications in political studies", "paper_id": "WOS:000303035000010"}