{"auto_keywords": [{"score": 0.045672906527448875, "phrase": "state_variables"}, {"score": 0.041637876149046134, "phrase": "efdes_theory"}, {"score": 0.010612387000973441, "phrase": "generalized_fuzzy_discrete-event_systems"}, {"score": 0.007174792166490919, "phrase": "next_states"}, {"score": 0.0060644363194246355, "phrase": "proposed_gfdes_theory"}, {"score": 0.004719359108879602, "phrase": "large_number"}, {"score": 0.0046256566852302256, "phrase": "continuous_signals"}, {"score": 0.004515655183335171, "phrase": "event-driven_mechanisms"}, {"score": 0.00426900754050533, "phrase": "fuzzy_discrete-event_systems"}, {"score": 0.004117579919425373, "phrase": "fuzzy_discrete-event_system"}, {"score": 0.003876996400581697, "phrase": "event-driven_systems"}, {"score": 0.0038305869305614504, "phrase": "primary_reason"}, {"score": 0.0034508665218929745, "phrase": "fuzzy_set"}, {"score": 0.003034633345146293, "phrase": "multiple_fss"}, {"score": 0.002442634456448208, "phrase": "gfdes_theory"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["Event-driven systems", " fuzzy discrete-event systems (FDESs)", " fuzzy logic"], "paper_abstract": "There exist a large number of systems whose state variables are continuous signals, and transit based on event-driven mechanisms. To model the transitions of these state variables, the theory of extended fuzzy discrete-event systems (EFDESs) was developed by extending the fuzzy discrete-event system (FDES) theory. However, the EFDES theory remains limited in modeling these event-driven systems. A primary reason for this is that the EFDES theory allows every event to be characterized by one variable only, and thus every event can be modeled by a fuzzy set (FS) only. Although the EFDES theory provides the steps for computing the next states of the state variables, how to compute their next states remains unknown when any event is modeled by multiple FSs. To overcome this limitation, this paper will present the theory of generalized fuzzy discrete-event systems (GFDESs) by generalizing the EFDES theory. In the proposed GFDES theory, events are characterized by their multiple attributes which may determine the transitions of the state variables, and are modeled by representing each of their attributes using one FS. To establish the GFDES theory, models for GFDESs will be presented by extending the concepts of EFDESs. Tomake this theory complete, the procedures for computing the next states of the state variables will also be provided. In addition, numerical examples will be presented to further illustrate the proposed GFDES theory.", "paper_title": "Theory of Generalized Fuzzy Discrete-Event Systems", "paper_id": "WOS:000349418100009"}