{"auto_keywords": [{"score": 0.03490036478529984, "phrase": "personal_outcome_expectations"}, {"score": 0.011205750699901535, "phrase": "subjective_norms"}, {"score": 0.00481495049065317, "phrase": "gender_differences"}, {"score": 0.004734448316824488, "phrase": "frequent_blog"}, {"score": 0.004674952036988355, "phrase": "purpose-this_paper"}, {"score": 0.004519908617935935, "phrase": "individual_blog_owners"}, {"score": 0.0037070855410818986, "phrase": "social_cognitive_theory"}, {"score": 0.003660452313567116, "phrase": "empirical_study"}, {"score": 0.003378385493203297, "phrase": "stronger_effect"}, {"score": 0.0032250961348210473, "phrase": "women's_intention"}, {"score": 0.003131178497790961, "phrase": "men's_intention"}, {"score": 0.0027819985260847577, "phrase": "weblog_owners"}, {"score": 0.0026782279715171866, "phrase": "important_determinants"}, {"score": 0.0024097920845706795, "phrase": "research_model"}, {"score": 0.002349467661235186, "phrase": "weblog_service_providers"}, {"score": 0.002233301265743633, "phrase": "people's_intentions"}, {"score": 0.0021049977753042253, "phrase": "deeper_understanding"}], "paper_keywords": ["Worldwide web", " Communication", " Information exchange", " Public opinion", " Gender", " Individual behaviour"], "paper_abstract": "Purpose-This paper aims to improve understanding of what motivates individual blog owners to post information frequently on weblogs, and whether gender affects those motivations. Design/methodology/approach-The authors propose a model incorporating three key determinants of the intention to update weblogs: self-expression; subjective norms; and personal outcome expectations. These were based on Social Cognitive Theory. An empirical study involving 525 subjects was conducted to test this model. Findings-The results indicate that subjective norms have a stronger effect on the intention than personal outcome expectations or self-expression. Additionally, women's intention was strongly influenced by self-expression while men's intention was strongly influenced by personal outcome expectations of using weblogs. Research limitations/implications-The authors verified the effects of subjective norms, personal outcome expectations and self-expression on the intentions of weblog owners. The research found that these factors are important determinants of the intention to update weblogs. Moreover, it was found that gender moderates the relationships between factors and the intention in the research model. Practical implications-For weblog service providers, the results can be used to develop tools to enhance people's intentions to publish according to gender. Originality/value-The paper contributes to a deeper understanding of the factors that promote the use of weblogs.", "paper_title": "Gender differences in reasons for frequent blog posting", "paper_id": "WOS:000264465200009"}