{"auto_keywords": [{"score": 0.04857296666657356, "phrase": "web_accessibility"}, {"score": 0.04765465862267651, "phrase": "european_banks"}, {"score": 0.03741337474183016, "phrase": "wa_adoption"}, {"score": 0.03449630736034214, "phrase": "wa"}, {"score": 0.03292929499027563, "phrase": "csr"}, {"score": 0.00481495049065317, "phrase": "economic_and_financial_factors"}, {"score": 0.0034841647157189985, "phrase": "operational_factors"}, {"score": 0.0031402604946939743, "phrase": "corporate_social_responsibility"}, {"score": 0.0027631038845413393, "phrase": "significant_influence"}, {"score": 0.0026126405272417783, "phrase": "governmental_policies"}, {"score": 0.0024604876113911173, "phrase": "csr_activities"}, {"score": 0.002244178699939059, "phrase": "internet_visibility"}, {"score": 0.0021734768728417977, "phrase": "future_revenues"}, {"score": 0.0021049977753042253, "phrase": "wa-committed_banks"}], "paper_keywords": [""], "paper_abstract": "This article aims at identifying the factors influencing the implementation of Web accessibility (WA) by European banks and its effects on the visibility through the Internet. We studied a database made up of 51 European banks whose shares are included in the Dow Jones EURO STOXX (R) TMI Banks [8300] Index. Regarding the factors for the implementation of WA, we considered two feasible reasons. First, WA adoption can be motivated by operational factors, as WA can contribute to increase the efficiency of the operations. Second, WA can also be understood as a part of the corporate social responsibility (CSR) strategy, so banks that are more committed with CSR should be more prone to implement WA. However, our results indicate that neither operational nor social factors seem to have exerted a significant influence on WA adoption. An implication of these findings is the advisability of orientating governmental policies to firm awareness of the fact that WA should be a part of the CSR activities of banks. Regarding the effects of the implementation of WA, our results indicate that the effort pays dividends in terms of Internet visibility. This could eventually contribute to increase future revenues and, therefore, the performance of WA-committed banks.", "paper_title": "Economic and Financial Factors for the Adoption and Visibility Effects of Web Accessibility: The Case of European Banks", "paper_id": "WOS:000269090000005"}