{"auto_keywords": [{"score": 0.049084030038618824, "phrase": "healthcare_organizations"}, {"score": 0.015719716506582538, "phrase": "integration_approaches"}, {"score": 0.0045208777171271254, "phrase": "large_numbers"}, {"score": 0.004457995891964028, "phrase": "disparate_information_systems"}, {"score": 0.004069963083642548, "phrase": "specific_needs"}, {"score": 0.003821215658570578, "phrase": "heterogeneous_systems"}, {"score": 0.003587616378156851, "phrase": "healthcare_management_professionals"}, {"score": 0.0035129562812850784, "phrase": "non-integrated_it_infrastructure"}, {"score": 0.0033682492486884364, "phrase": "medical_errors"}, {"score": 0.002989714021608139, "phrase": "countless_problems"}, {"score": 0.0029274600162609654, "phrase": "poor_levels"}, {"score": 0.0022739766507258105, "phrase": "marketplace_confusion"}, {"score": 0.0021049977753042253, "phrase": "sufficient_technical_exposure"}], "paper_keywords": ["evaluation", " integration approaches", " healthcare organizations"], "paper_abstract": "Healthcare organizations typically consist of large numbers of disparate Information Systems (IS). These systems have been deployed to support the specific needs of healthcare organizations. The information sharing among these heterogeneous systems has always been one of the most prominent issues facing healthcare management professionals. The non-integrated IT infrastructure is often the cause of medical errors, which often leads to fatalities. Various integration approaches have emerged and been adopted to solve the countless problems associated with poor levels of integration. However, there are still many issues remaining to be solved, such as the level of integration needed, patients' data security and process integration. The multiple integration approaches that exist have resulted in marketplace confusion, especially in those sectors such as healthcare that lack sufficient technical exposure. The authors attempt to overcome much of this confusion by analysing current integration approaches deployed in healthcare. In doing so, the benefits and barriers of these approaches are evaluated. This evaluation will help decision-makers to better understand the complexity and issues surrounding the adoption of integration approaches.", "paper_title": "Evaluating integration approaches adopted by healthcare organizations", "paper_id": "WOS:000244367800003"}