{"auto_keywords": [{"score": 0.04218050418607, "phrase": "degree-reduced_surface"}, {"score": 0.018026000564266342, "phrase": "original_surface"}, {"score": 0.010546308649298489, "phrase": "jacobi_polynomials"}, {"score": 0.00481495049065317, "phrase": "bezier_surfaces"}, {"score": 0.004622271625219495, "phrase": "new_approximation_algorithm"}, {"score": 0.004593317752310294, "phrase": "multi-degree_reduction"}, {"score": 0.004564544414530739, "phrase": "tensor_product_bezier_surfaces"}, {"score": 0.003950103621065539, "phrase": "explicit_expression"}, {"score": 0.003913021620260308, "phrase": "matrix_form"}, {"score": 0.0036860898876135534, "phrase": "precalculated_matrices"}, {"score": 0.0034941851527001146, "phrase": "approximate_error"}, {"score": 0.003461368259695762, "phrase": "degree_reduction_call"}, {"score": 0.0034288585177917066, "phrase": "ill_advance"}, {"score": 0.003260543967539824, "phrase": "useless_degree_reduction"}, {"score": 0.0030044208366869205, "phrase": "first_advantage"}, {"score": 0.0029021941361680637, "phrase": "corners_continuity"}, {"score": 0.0028749210987951677, "phrase": "order_alpha"}, {"score": 0.0024795356895447765, "phrase": "piecewise_continuous"}, {"score": 0.002291827910789624, "phrase": "resulting_piecewise_approximating_surfaces"}, {"score": 0.0022489295919084643, "phrase": "numerical_examples"}, {"score": 0.002234808936443945, "phrase": "theoretical_comparisons"}], "paper_keywords": ["Bezier surfaces", " Multi-degree reduction", " Boundary constraints", " Explicit expression", " Jacobi polynomials", " Partitional matrices"], "paper_abstract": "In this paper, we profoundly research on a new approximation algorithm for multi-degree reduction of tensor product Bezier surfaces with the condition of corners or boundaries constraints, in the norm L(2) by orthogonality and expressions form of Jacobi polynomials. Without the constraints of corners or boundaries interpolation, it has the following three advantages. Firstly, the control points of the degree-reduced surface can be represented by an explicit expression of a matrix form, i.e., the control points of the degree-reduced Surface are decided by both the control net of the original Surface and some precalculated matrices stored in the database, which makes the computation easy and quick. Secondly, the approximate error of the degree reduction call be estimated ill advance so that we call check if it is within the given tolerance in order to avoid useless degree reduction. Thirdly, the precision of the algorithm is optimal. Under the constraints of corners or boundaries interpolation, the degree-reduced surface still has the first advantage. Furthermore, the original Surface and the degree-reduced surface maintain the corners continuity of any order alpha (>= 0) in the two parametric directions respectively. At the same time, the two adjacent degree-reduced Surfaces maintain the boundaries continuity of order 0. In particular, this algorithm is capable of meeting the need for multi-degree-reducing each patch of such a surface which is piecewise Continuous, or formed by combining Some sub-surfaces when the error of degree-reducing the original Surface is beyond the given tolerance, so that the resulting piecewise approximating surfaces are globally CO. Finally, numerical examples and theoretical comparisons suggest that Our method not only possesses more powerful properties, but also is more precise and simpler comparing with any other old methods. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Constrained multi-degree reduction of Bezier surfaces using Jacobi polynomials", "paper_id": "WOS:000263631900001"}