{"auto_keywords": [{"score": 0.02873030201752314, "phrase": "first_scenario"}, {"score": 0.00481495049065317, "phrase": "pedestrian_navigation"}, {"score": 0.004786920391043703, "phrase": "multiple_reinforcement_learning_agents"}, {"score": 0.004690087809770101, "phrase": "new_multi-agent_reinforcement_learning_approach"}, {"score": 0.004595204969378556, "phrase": "pedestrian_groups"}, {"score": 0.0042220541146047825, "phrase": "embodied_agents"}, {"score": 0.003959241745942114, "phrase": "main_contribution"}, {"score": 0.003867768665068189, "phrase": "new_methodology"}, {"score": 0.0038340116517717048, "phrase": "different_iterative_learning_strategies"}, {"score": 0.0037894584172273316, "phrase": "vector_quantization"}, {"score": 0.003701893378341912, "phrase": "q-learning_algorithm"}, {"score": 0.0036803189470937235, "phrase": "vqql"}, {"score": 0.0036269293593361447, "phrase": "iterative_vqql"}, {"score": 0.0032837882028183287, "phrase": "vqql_algorithm"}, {"score": 0.003179854375044433, "phrase": "well-known_problems"}, {"score": 0.0030702085848191953, "phrase": "closed_room"}, {"score": 0.003025642857503457, "phrase": "unique_exit"}, {"score": 0.0026216289509286856, "phrase": "pedestrian_modeling_field"}, {"score": 0.0025760099091886165, "phrase": "helbing's_social_force_model"}, {"score": 0.0025385994743190796, "phrase": "collective_behaviors"}, {"score": 0.002231901054023083, "phrase": "proposed_schemas"}, {"score": 0.0021049977753042253, "phrase": "pedestrians_groups"}], "paper_keywords": ["Pedestrian simulation", " VQQL", " Collective behaviors", " MARL"], "paper_abstract": "In this paper, a new multi-agent reinforcement learning approach is introduced for the simulation of pedestrian groups. Unlike other solutions, where the behaviors of the pedestrians are coded in the system, in our approach the agents learn by interacting with the environment. The embodied agents must learn to control their velocity, avoiding obstacles and the other pedestrians, to reach a goal inside the scenario. The main contribution of this paper is to propose this new methodology that uses different iterative learning strategies, combining a vector quantization (state space generalization) with the Q-learning algorithm (VQQL). Two algorithmic schemas, Iterative VQQL and Incremental, which differ in the way of addressing the problems, have been designed and used with and without transfer of knowledge. These algorithms are tested and compared with the VQQL algorithm as a baseline in two scenarios where agents need to solve well-known problems in pedestrian modeling. In the first, agents in a closed room need to reach the unique exit producing and solving a bottleneck. In in the second, two groups of agents inside a corridor need to reach their goal that is placed in opposite sides (they need to solve the crossing). In the first scenario, we focus on scalability, use metrics from the pedestrian modeling field, and compare with the Helbing's social force model. The emergence of collective behaviors, that is, the shell-shaped clogging in front of the exit in the first scenario, and the lane formation as a solution to the problem of the crossing, have been obtained and analyzed. The results demonstrate that the proposed schemas find policies that carry out the tasks, suggesting that they are applicable and generalizable to the simulation of pedestrians groups.", "paper_title": "Strategies for simulating pedestrian navigation with multiple reinforcement learning agents", "paper_id": "WOS:000347690200004"}