{"auto_keywords": [{"score": 0.04766724089045989, "phrase": "e-prescribing_errors"}, {"score": 0.007152368807539886, "phrase": "community_pharmacies"}, {"score": 0.005650673657957859, "phrase": "pharmacy_staff"}, {"score": 0.004169692306713217, "phrase": "direct_observations"}, {"score": 0.004139028737420222, "phrase": "five_pharmacies"}, {"score": 0.004108589735101849, "phrase": "follow-up_interviews"}, {"score": 0.0039016690475620185, "phrase": "content_analysis"}, {"score": 0.003584025547693836, "phrase": "wrong_dosing_directions"}, {"score": 0.003557653536102669, "phrase": "wrong_duration"}, {"score": 0.0034925663938977715, "phrase": "wrong_dosage_formulation"}, {"score": 0.003196292402522254, "phrase": "topical_agents"}, {"score": 0.003161065111494053, "phrase": "potential_consequences"}, {"score": 0.0030464123943266673, "phrase": "incorrect_drug_therapy"}, {"score": 0.0030239842475439814, "phrase": "poor_disease_management"}, {"score": 0.0029796206196589115, "phrase": "additional_work"}, {"score": 0.0029576827451501956, "phrase": "pharmacy_personnel"}, {"score": 0.0026375303198093764, "phrase": "technology_design_issues"}, {"score": 0.0025892330566358503, "phrase": "auto-populate_features"}, {"score": 0.0025137856138000036, "phrase": "incorrect_information"}, {"score": 0.0024768883044869023, "phrase": "study_findings"}, {"score": 0.0024405312482831646, "phrase": "wide_range"}, {"score": 0.0021682027434117095, "phrase": "prescriber_offices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic prescribing", " Medication errors", " Medication safety", " Contributing factors", " Consequencesa"], "paper_abstract": "Objective: To explore types of e-prescribing errors in community pharmacies and their potential consequences, as well as the factors that contribute to e-prescribing errors. Methods: Data collection involved performing 45 total hours of direct observations in five pharmacies. Follow-up interviews were conducted with 20 study participants. Transcripts from observations and interviews were subjected to content analysis using NVivo 10. Results: Pharmacy staff detected 75 e-prescription errors during the 45 h observation in pharmacies. The most common e-prescribing errors were wrong drug quantity, wrong dosing directions, wrong duration of therapy, and wrong dosage formulation. Participants estimated that 5 in 100 e-prescriptions have errors. Drug classes that were implicated in e-prescribing errors were antiinfectives, inhalers, ophthalmic, and topical agents. The potential consequences of e-prescribing errors included increased likelihood of the patient receiving incorrect drug therapy, poor disease management for patients, additional work for pharmacy personnel, increased cost for pharmacies and patients, and frustrations for patients and pharmacy staff. Factors that contribute to errors included: technology incompatibility between pharmacy and clinic systems, technology design issues such as use of auto-populate features and dropdown menus, and inadvertently entering incorrect information. Conclusion: Study findings suggest that a wide range of e-prescribing errors is encountered in community pharmacies. Pharmacists and technicians perceive that causes of e-prescribing errors are multidisciplinary and multifactorial, that is to say e-prescribing errors can originate from technology used in prescriber offices and pharmacies. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "E-prescribing errors in community pharmacies: Exploring consequences and contributing factors", "paper_id": "WOS:000335903400004"}