{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "domain-specific_knowledge"}, {"score": 0.006137313189240499, "phrase": "argumentation_measure"}, {"score": 0.00478163886605204, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.004570634647887452, "phrase": "domain-specific_knowledge_gains"}, {"score": 0.004539005582217305, "phrase": "computer-supported_collaborative_learning_settings"}, {"score": 0.004460149511985203, "phrase": "studies'_effects"}, {"score": 0.004445419749485783, "phrase": "primary_studies"}, {"score": 0.004308630865024719, "phrase": "meta-regression_approach"}, {"score": 0.004234456398783788, "phrase": "interventions'_effects"}, {"score": 0.003909301559145041, "phrase": "random-effects_model"}, {"score": 0.0037627064621795514, "phrase": "knowledge_test"}, {"score": 0.0035468507553681034, "phrase": "moderate_mean_effect"}, {"score": 0.003285725064532174, "phrase": "mean_effect"}, {"score": 0.00301217724562369, "phrase": "whole_sample"}, {"score": 0.002685558057339722, "phrase": "unequivocal_picture"}, {"score": 0.002320449502337321, "phrase": "broadly_shared_theoretical_assumption"}, {"score": 0.0021871503075921537, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Argumentation", " Learning", " Domain-specific knowledge acquisition", " CSCL", " Meta-analysis"], "paper_abstract": "This meta-analysis investigated the role of the quality of argumentation for domain-specific knowledge gains in computer-supported collaborative learning settings. Given the scarcity of primary studies that report correlations between these two variables, a meta-regression approach was employed that uses interventions' effects on argumentation to predict their effects on domain-specific knowledge. Effect sizes for 17 comparisons extracted from 12 studies were included in the analysis using a random-effects model. Moderator analyses concerning type of argumentation measure, type of knowledge test, and type of intervention were conducted. The interventions had a statistically significant small to moderate mean effect (d = 0.39) on argumentation, which varied as a function of the type of argumentation measure employed. The mean effect of the interventions on domain-specific knowledge (d = 0.22) appeared to be non-existent (d = 0.00) on the basis of the whole sample of studies, and small at best after the exclusion of three outlying effect sizes from one study. With respect to the relation of the studies' effects on argumentation to their effects on domain-specific knowledge, no unequivocal picture emerges: After the exclusion of the three outliers, the regression coefficient for predicting the studies' effects on domain-specific knowledge on the basis of their effects on argumentation was b = -0.08 and statistically not significant. These findings constitute a challenge for the broadly shared theoretical assumption that argumentation mediates the effects of interventions on domain-specific knowledge. A set of recommendations for strengthening future research on the topic is presented. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Where is the evidence? A meta-analysis on the role of argumentation for the acquisition of domain-specific knowledge in computer-supported collaborative learning", "paper_id": "WOS:000335618000019"}