{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "expert_system_development"}, {"score": 0.034975734209725516, "phrase": "expert_system_development_field"}, {"score": 0.030085977154011265, "phrase": "business_rules"}, {"score": 0.00481495049065317, "phrase": "mcrdr"}, {"score": 0.00478740563679966, "phrase": "based_agile_approach"}, {"score": 0.0038271712887391015, "phrase": "alternative_solution"}, {"score": 0.0037188360359702182, "phrase": "computer_software_development_area"}, {"score": 0.0026342827320931937, "phrase": "big_opportunity"}, {"score": 0.0023079225317714815, "phrase": "agile_software_development"}, {"score": 0.0021049977753042253, "phrase": "multiple_classification_ripple_down_rules"}], "paper_keywords": ["MCRDR", " Agile approach", " Expert system"], "paper_abstract": "Various expert system development approaches were proposed but most of them cannot deal with two problems: the difficulty of analysis and maintenance. Rather than to spend time waiting any longer, it is better to find an alternative solution from other research fields. In computer software development area, researchers have been suffering from the difficulty of maintenance and analysis, just as the researchers in the expert system development field. To solve this issue, researchers in the software used both agile software development and business rules approach: agile software development is for overcoming the the difficulty of analysis, and business rules approach is for reducing issues in the maintenance. There is a big opportunity that those two approaches can also be solve the two issues in the expert system development field. The paper describes requirements of the approach based on agile software development and the business rules approach. As a result, we consider and specify why the Multiple Classification Ripple Down Rules is the novel approach for the expert system development.", "paper_title": "Using MCRDR based Agile approach for expert system development", "paper_id": "WOS:000340492900009"}