{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "sequential_rules"}, {"score": 0.015719716506582538, "phrase": "multiple_sequences"}, {"score": 0.008859922943091207, "phrase": "sliding-window_constraint"}, {"score": 0.004778258911940497, "phrase": "sequential_rule_mining"}, {"score": 0.004723742646716804, "phrase": "important_data_mining_problem"}, {"score": 0.004616560363089716, "phrase": "important_limitation"}, {"score": 0.0041001740903338834, "phrase": "similar_rules"}, {"score": 0.002938317647182056, "phrase": "rulegrowth_algorithm"}, {"score": 0.002629238854352447, "phrase": "maximum_amount"}, {"score": 0.002579326836642461, "phrase": "performance_study"}, {"score": 0.0024918548761791435, "phrase": "excellent_performance"}, {"score": 0.002444544487772349, "phrase": "baseline_algorithms"}, {"score": 0.0021956951486095805, "phrase": "real_application"}, {"score": 0.0021705796895687864, "phrase": "posr"}, {"score": 0.0021212055097236527, "phrase": "regular_sequential_rules"}, {"score": 0.0021049977753042253, "phrase": "sequence_prediction"}], "paper_keywords": ["Sequential rules", " sequential patterns", " temporal patterns", " pattern mining", " sequence", " data mining"], "paper_abstract": "Sequential rule mining is an important data mining problem with multiple applications. An important limitation of algorithms for mining sequential rules common to multiple sequences is that rules are very specific and therefore many similar rules may represent the same situation. This can cause three major problems: (1) similar rules can be rated quite differently, (2) rules may not be found because they are individually considered uninteresting, and (3) rules that are too specific are less likely to be used for making predictions. To address these issues, we explore the idea of mining \"partially-ordered sequential rules\" (POSR), a more general form of sequential rules such that items in the antecedent and the consequent of each rule are unordered. To mine POSR, we propose the RuleGrowth algorithm, which is efficient and easily extendable. In particular, we present an extension (TRuleGrowth) that accepts a sliding-window constraint to find rules occurring within a maximum amount of time. A performance study with four real-life datasets show that RuleGrowth and TRuleGrowth have excellent performance and scalability compared to baseline algorithms and that the number of rules discovered can be several orders of magnitude smaller when the sliding-window constraint is applied. Furthermore, we also report results from a real application showing that POSR can provide a much higher prediction accuracy than regular sequential rules for sequence prediction.", "paper_title": "Mining Partially-Ordered Sequential Rules Common to Multiple Sequences", "paper_id": "WOS:000357692600015"}