{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geometric_shapes"}, {"score": 0.004747997855358171, "phrase": "increasing_complexity"}, {"score": 0.00453144352814823, "phrase": "accompanied_increase"}, {"score": 0.00436530211426514, "phrase": "test_data_reduction"}, {"score": 0.004127394241838696, "phrase": "efficient_test-independent_compression_technique"}, {"score": 0.003920674807745575, "phrase": "test_vectors"}, {"score": 0.0037242701420971062, "phrase": "test_data"}, {"score": 0.003672427620845944, "phrase": "test_set"}, {"score": 0.0026474076254702525, "phrase": "original_cost"}, {"score": 0.0023996890513009743, "phrase": "high_compression_ratio"}, {"score": 0.0023442013458139497, "phrase": "largest_full-scanned_versions"}, {"score": 0.0022686625017583387, "phrase": "proposed_technique"}, {"score": 0.0022475295254231714, "phrase": "significantly_higher_compression"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The increasing complexity of systems-on-a-chip with the accompanied increase in their test data size has made the need for test data reduction imperative. In this paper, we introduce a novel and efficient test-independent compression technique based on geometric shapes. The technique exploits reordering of test vectors to minimize the number of shapes needed to encode the test data. The test set is partitioned into blocks and then each block is encoded separately. The encoder has the choice of encoding either the 0's or the 1's in a block. In addition, it encodes a block that contains only 0's (or 1's) and x's with only 3 bits. Furthermore, if the cost of encoding a block using geometric shapes is higher than the original cost of the block, the block is stored as is without encoding. The effectiveness of the technique in achieving high compression ratio is demonstrated on the largest full-scanned versions of ISCAS89 benchmark circuits. The proposed technique achieves significantly higher compression in comparison to other test-independent compression techniques reported in the literature. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Test data compression based on geometric shapes", "paper_id": "WOS:000291765800013"}