{"auto_keywords": [{"score": 0.04156226931091792, "phrase": "project_success"}, {"score": 0.014381415031356454, "phrase": "empirical_studies"}, {"score": 0.014209396327662795, "phrase": "team_building_criteria"}, {"score": 0.012386191491719968, "phrase": "human_factors"}, {"score": 0.004687953792413793, "phrase": "work_team"}, {"score": 0.004653900688892822, "phrase": "important_antecedent"}, {"score": 0.004631335513513859, "phrase": "team_performance"}, {"score": 0.00455321160931221, "phrase": "team_members"}, {"score": 0.004520132822496416, "phrase": "important_role"}, {"score": 0.004487293267622419, "phrase": "team_composition"}, {"score": 0.0043161190928529755, "phrase": "software_industry"}, {"score": 0.004161553532799662, "phrase": "industrial_practice"}, {"score": 0.004101281992566145, "phrase": "software_project_team"}, {"score": 0.0037666309179970876, "phrase": "software_engineering"}, {"score": 0.003685067218455088, "phrase": "iterative_mix-method"}, {"score": 0.003622847388579639, "phrase": "first_iteration"}, {"score": 0.003587764312698665, "phrase": "qualitative_research"}, {"score": 0.0035616743422949766, "phrase": "team-building_criteria"}, {"score": 0.0035443861412929006, "phrase": "software_project_managers"}, {"score": 0.0034676182423067307, "phrase": "cross-sectional_survey"}, {"score": 0.003335210705281633, "phrase": "second_iteration"}, {"score": 0.0032709088591705983, "phrase": "systematic_mapping_study"}, {"score": 0.0031459887611258765, "phrase": "survey_research"}, {"score": 0.003025825034633915, "phrase": "consistent_use_team_building_criteria"}, {"score": 0.002875027551180213, "phrase": "strongest_correlations"}, {"score": 0.002778682854371595, "phrase": "original_survey"}, {"score": 0.0027184540871935284, "phrase": "success_goals"}, {"score": 0.0024481856932959227, "phrase": "team_member"}, {"score": 0.002436289099444074, "phrase": "software_teams"}, {"score": 0.0023091721866305426, "phrase": "development_method"}, {"score": 0.0021940118003312397, "phrase": "sampling_technique"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["People management", " Software teams", " Team effectiveness", " Team building criteria", " Software engineering"], "paper_abstract": "Context: The internal composition of a work team is an important antecedent of team performance and the criteria used to select team members play an important role in determining team composition. However, there are only a handful of empirical studies about the use of team building criteria in the software industry. Objective: The goal of this article is to identify criteria used in industrial practice to select members of a software project team, and to look for relationships between the use of these criteria and project success. In addition, we expect to contribute with findings about the use of replication in empirical studies involving human factors in software engineering. Method: Our research was based on an iterative mix-method, replication strategy. In the first iteration, we used qualitative research to identify team-building criteria interviewing software project managers from industry. Then, we performed a cross-sectional survey to assess the correlations of the use of these criteria and project success. In the second iteration, we used the results of a systematic mapping study to complement the set of team building criteria. Finally, we performed a replication of the survey research with variations to verify and improve the results. Results: Our results showed that the consistent use team building criteria correlated significantly with project success, and the criteria related to human factors, such as personality and behavior, presented the strongest correlations. The results of the replication did not reproduce the results of the original survey with respect to the correlations between criteria and success goals. Nevertheless, the variations in the design and the difference in the sample of projects allowed us to conclude that the two results were compatible, increasing our confidence on the existence of the correlations. Conclusion: Our findings indicated that carefully selecting team member for software teams is likely to positively influence the projects in which these teams participate. Besides, it seems that the type of development method used can moderate (increase or decrease) this influence. In addition, our study showed that the choice of sampling technique is not straightforward given the many interacting factors affecting this type of investigation. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Team building criteria in software projects: A mix-method replicated study", "paper_id": "WOS:000320217900013"}