{"auto_keywords": [{"score": 0.04967298152704187, "phrase": "optimization_problems"}, {"score": 0.030709543522946015, "phrase": "single_front_genetic_algorithms"}, {"score": 0.011797866008077026, "phrase": "dynamic_problems"}, {"score": 0.01000268567945517, "phrase": "nsga"}, {"score": 0.00481495049065317, "phrase": "multiobjective_evolutionary_algorithms"}, {"score": 0.004594582559945568, "phrase": "engineering_field"}, {"score": 0.004148014765950199, "phrase": "optimization_solutions"}, {"score": 0.003891140864902669, "phrase": "optimization_procedure"}, {"score": 0.0038090874465452214, "phrase": "new_solutions"}, {"score": 0.0034828730516958807, "phrase": "optimization_algorithm"}, {"score": 0.0030776686414001964, "phrase": "nondominated_sorting_algorithm"}, {"score": 0.0029744042270542655, "phrase": "pareto_evolutionary_algorithm"}, {"score": 0.0028745946327439656, "phrase": "sfga"}, {"score": 0.0026282000779095987, "phrase": "adequate_quality"}, {"score": 0.0025076619172878945, "phrase": "second_and_more_complex_problem"}, {"score": 0.0024028742248152425, "phrase": "best_hypervolume"}, {"score": 0.002372298201966367, "phrase": "found_set"}, {"score": 0.00235213013487844, "phrase": "nondominated_solutions"}, {"score": 0.0021049977753042253, "phrase": "high_rates"}], "paper_keywords": [""], "paper_abstract": "Many multiobjective optimization problems in the engineering field are required to be solved within more or less severe time restrictions. Because the optimization criteria, the parameters, and/or constraints might change with time, the optimization solutions must be recalculated when a change takes place. The time required by the optimization procedure to arrive at the new solutions should be bounded accordingly with the rate of change observed in these dynamic problems. This way, the faster the optimization algorithm is to obtain solutions, the wider is the set of dynamic problems to which that algorithm can be applied. Here, we analyze the performance of the nondominated sorting algorithm (NSGA-II), strength Pareto evolutionary algorithm (SPEA2), and single front genetic algorithms (SFGA, and SFGA2) on two different multiobjective optimization problems, with two and three objectives, respectively. For these two studied problems, the single front genetic algorithms have obtained adequate quality in the solutions in very little time. Moreover, for the second and more complex problem approached, SFGA2 and NSGA-II obtain the best hypervolume in the found set of nondominated solutions, but SFGA2 employs much less time than NSGA-II. These results may suggest that single front genetic algorithms, especially SFGA2, could be appropiate to deal with optimization problems with high rates of change, and thus stronger time constraints.", "paper_title": "AN ANALYSIS OF MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS FOR OPTIMIZATION PROBLEMS WITH TIME CONSTRAINTS", "paper_id": "WOS:000325512300005"}