{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fuzzy_clusters"}, {"score": 0.030470428105760804, "phrase": "data_objects"}, {"score": 0.00477513738640734, "phrase": "different_sizes"}, {"score": 0.004696491408936132, "phrase": "cluster_validity_indices"}, {"score": 0.004268663239979243, "phrase": "cluster_validation"}, {"score": 0.004233347974930148, "phrase": "difficult_task"}, {"score": 0.003977594755967813, "phrase": "natural_groupings"}, {"score": 0.0035554096354423756, "phrase": "clustering_validity_index"}, {"score": 0.0034106416719768035, "phrase": "compactness_and_overlap_measures"}, {"score": 0.003368367923339975, "phrase": "overlap_measure"}, {"score": 0.003151572886432253, "phrase": "overlap_rate"}, {"score": 0.0029857124153761187, "phrase": "compactness_measure"}, {"score": 0.0027818804382539444, "phrase": "membership_values"}, {"score": 0.002486292595645607, "phrase": "maximal_value"}, {"score": 0.0024350966556966757, "phrase": "optimal_fuzzy_partition"}, {"score": 0.0023651843133643785, "phrase": "high_compactness"}, {"score": 0.002335838283092986, "phrase": "low_degree"}, {"score": 0.0021853532419450887, "phrase": "superior_reliability"}, {"score": 0.0021403407314754637, "phrase": "proposed_index"}], "paper_keywords": ["Unsupervised classification", " Fuzzy clustering", " Cluster validity", " Fuzzy c-means"], "paper_abstract": "Cluster validity indices are used for estimating the quality of partitions produced by clustering algorithms and for determining the number of clusters in data. Cluster validation is difficult task, because for the same data set more partitions exists regarding the level of details that fit natural groupings of a given data set. Even though several cluster validity indices exist, they are inefficient when clusters widely differ in density or size. We propose a clustering validity index that addresses these issues. It is based on compactness and overlap measures. The overlap measure, which indicates the degree of overlap between fuzzy clusters, is obtained by calculating the overlap rate of all data objects that belong strongly enough to two or more clusters. The compactness measure, which indicates the degree of similarity of data objects in a cluster, is calculated from membership values of data objects that are strongly enough associated to one cluster. We propose ratio and summation type of index using the same compactness and overlap measures. The maximal value of index denotes the optimal fuzzy partition that is expected to have a high compactness and a low degree of overlap among clusters. Testing many well-known previously formulated and proposed indices on well-known data sets showed the superior reliability and effectiveness of the proposed index in comparison to other indices especially when evaluating partitions with clusters that widely differ in size or density. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Cluster validity index for estimation of fuzzy clusters of different sizes and densities", "paper_id": "WOS:000280006700018"}