{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hyperfinite_graphs"}, {"score": 0.00418134346679498, "phrase": "planar_graph"}, {"score": 0.00415333528095237, "phrase": "n_vertices"}, {"score": 0.0040978781692373005, "phrase": "constant_maximum_degree_d"}, {"score": 0.003558294449586273, "phrase": "planar_graphs"}, {"score": 0.003522579870903474, "phrase": "hyperfinite_class"}, {"score": 0.003293442130869165, "phrase": "forbidden_minors"}, {"score": 0.003260377175139591, "phrase": "pure_combinatorial_consequence"}, {"score": 0.003152531962718477, "phrase": "degree_graphs"}, {"score": 0.0031208772639433145, "phrase": "similar_frequency_vectors"}, {"score": 0.0026554236621262515, "phrase": "property_testing"}, {"score": 0.00243291444168046, "phrase": "graph_property"}, {"score": 0.0023287359930308864, "phrase": "hyperfinite_graph_property"}, {"score": 0.0022898630573629144, "phrase": "bounded_degree_graph_model"}, {"score": 0.0021770860717929192, "phrase": "partial_explanation"}, {"score": 0.0021049977753042253, "phrase": "complex_networks"}], "paper_keywords": ["property testing", " graph properties"], "paper_abstract": "A k-disc around a vertex v of a graph G = (V, E) is the subgraph induced by all vertices of distance at most k from v. We show that the structure of a planar graph on n vertices, and with constant maximum degree d, is determined, up to the modification (insertion or deletion) of at most epsilon dn edges, by the frequency of k-discs for certain k = k(epsilon, d) that is independent of the size of the graph. We can replace planar graphs by any hyperfinite class of graphs, which includes, for example, every graph class that does not contain a set of forbidden minors. A pure combinatorial consequence of this result is that two d-bounded degree graphs that have similar frequency vectors (that is, the l(1) difference between the frequency vectors is small) are close to isomorphic (where close here means that by inserting or deleting not too many edges in one of them, it becomes isomorphic to the other). We also obtain the following new results in the area of property testing, which are essentially equivalent to the above statement. We prove that (a) graph isomorphism is testable for every class of hyperfinite graphs, (b) every graph property is testable for every class of hyperfinite graphs, (c) every hyperfinite graph property is testable in the bounded degree graph model, (d) A large class of graph parameters is approximable for hyperfinite graphs. Our results also give a partial explanation of the success of motifs in the analysis of complex networks.", "paper_title": "EVERY PROPERTY OF HYPERFINITE GRAPHS IS TESTABLE", "paper_id": "WOS:000323888700012"}