{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "avionic_systems"}, {"score": 0.04296486508114674, "phrase": "false_alarms"}, {"score": 0.041609355713619414, "phrase": "false_positives"}, {"score": 0.004415395176043526, "phrase": "avionic_system_component"}, {"score": 0.003687960013746783, "phrase": "left_generator_shaft"}, {"score": 0.0035197152758635344, "phrase": "goodrich_health"}, {"score": 0.0034730657554172405, "phrase": "usage_management_system"}, {"score": 0.0032272929113113203, "phrase": "first_approaches"}, {"score": 0.0031422859551159506, "phrase": "discriminant_analysis"}, {"score": 0.00260657976055413, "phrase": "typical_helicopter_flight_schedules"}, {"score": 0.0023739321566540682, "phrase": "important_contribution"}, {"score": 0.0023268399760599336, "phrase": "train_components"}, {"score": 0.0021049977753042253, "phrase": "unnecessary_preventive_maintenance"}], "paper_keywords": ["discriminant analysis", " prognostics"], "paper_abstract": "In this paper, a novel discriminant analysis based predictive model for preventing false alarms leading to unnecessary replacement of an avionic system component is presented. The model is validated by prediction of false alarms (also known as false positives, type 1, or alpha errors) in the left generator shaft of a Sikorsky helicopter UH-60, using the Goodrich health and usage management system (HUMS). The paper presents one of the first approaches based on applying discriminant analysis for prognostics of avionic systems, specifically in the context of identifying false positives within the next I or 2 h. In practice, predictions for the next 2 It are sufficient as typical helicopter flight schedules and durations are such that up to 2 h advance notice is most useful. This is an important contribution because drive train components of helicopters are normally very robust with very rare failures; therefore, the cost of unnecessary preventive maintenance based on false alarms is very high.", "paper_title": "Discriminant analysis based prognostics of avionic systems", "paper_id": "WOS:000250395300020"}