{"auto_keywords": [{"score": 0.041233207808256504, "phrase": "reference_dataset"}, {"score": 0.00481495049065317, "phrase": "haplotype_phasing"}, {"score": 0.004755279364266046, "phrase": "sequencing_data"}, {"score": 0.004509780213218666, "phrase": "fundamental_problem"}, {"score": 0.004371306014298804, "phrase": "admixture_mapping"}, {"score": 0.004132635240234246, "phrase": "genotype_data"}, {"score": 0.004043363653396813, "phrase": "population_haplotype_frequencies"}, {"score": 0.0038106195546165574, "phrase": "large_reference_datasets"}, {"score": 0.003786910256691685, "phrase": "modern_approaches"}, {"score": 0.0036591119109692545, "phrase": "imputation_methods"}, {"score": 0.003568875230828415, "phrase": "sequencing_studies"}, {"score": 0.0035356111195810483, "phrase": "straightforward_way"}, {"score": 0.0034162643819889054, "phrase": "sequence_data"}, {"score": 0.0033633514001658086, "phrase": "imputation_method"}, {"score": 0.0031400710087822487, "phrase": "haplotype_assembly_approaches"}, {"score": 0.0028771413440398614, "phrase": "predicted_haplotypes"}, {"score": 0.0028414166961286233, "phrase": "assembly_approaches"}, {"score": 0.0026609940110902666, "phrase": "novel_approach"}, {"score": 0.0026444185820764716, "phrase": "hap-seq"}, {"score": 0.0026115760183617947, "phrase": "simultaneously_an_imputation"}, {"score": 0.002468747242613056, "phrase": "likelihood_framework"}, {"score": 0.002430474136314913, "phrase": "dynamic_programming_algorithm"}, {"score": 0.0024002822777025906, "phrase": "predicted_haplotype"}, {"score": 0.0023630680726174627, "phrase": "joint_likelihood"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_imputation_methods"}], "paper_keywords": ["dynamic programming", " genetic variation", " haplotype phasing", " hidden Markov model", " imputation"], "paper_abstract": "Inference of haplotypes, or the sequence of alleles along each chromosome, is a fundamental problem in genetics and is important for many analyses, including admixture mapping, identifying regions of identity by descent, and imputation. Traditionally, haplotypes are inferred from genotype data obtained from microarrays using information on population haplotype frequencies inferred from either a large sample of genotyped individuals or a reference dataset such as the HapMap. Since the availability of large reference datasets, modern approaches for haplotype phasing along these lines are closely related to imputation methods. When applied to data obtained from sequencing studies, a straightforward way to obtain haplotypes is to first infer genotypes from the sequence data and then apply an imputation method. However, this approach does not take into account that alleles on the same sequence read originate from the same chromosome. Haplotype assembly approaches take advantage of this insight and predict haplotypes by assigning the reads to chromosomes in such a way that minimizes the number of conflicts between the reads and the predicted haplotypes. Unfortunately, assembly approaches require very high sequencing coverage and are usually not able to fully reconstruct the haplotypes. In this work, we present a novel approach, Hap-seq, which is simultaneously an imputation and assembly method that combines information from a reference dataset with the information from the reads using a likelihood framework. Our method applies a dynamic programming algorithm to identify the predicted haplotype, which maximizes the joint likelihood of the haplotype with respect to the reference dataset and the haplotype with respect to the observed reads. We show that our method requires only low sequencing coverage and can reconstruct haplotypes containing both common and rare alleles with higher accuracy compared to the state-of-the-art imputation methods.", "paper_title": "Hap-seq: An Optimal Algorithm for Haplotype Phasing with Imputation Using Sequencing Data", "paper_id": "WOS:000314775400003"}