{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_momentum"}, {"score": 0.01557763786427779, "phrase": "active_contour_models"}, {"score": 0.013716422713538333, "phrase": "gradient_descent_method"}, {"score": 0.012241021415284823, "phrase": "complex_geometries"}, {"score": 0.011695758068235178, "phrase": "adaptive_momentum_term"}, {"score": 0.010199956518581752, "phrase": "defined_acceleration_function"}, {"score": 0.007578076659183345, "phrase": "proposed_method"}, {"score": 0.004473982381245469, "phrase": "original_external_energy"}, {"score": 0.004312622975366676, "phrase": "popular_way"}, {"score": 0.004234129588974058, "phrase": "object_boundary"}, {"score": 0.0037921662574137535, "phrase": "local_minimum"}, {"score": 0.00283870598459543, "phrase": "influence_region"}, {"score": 0.002530359917257626, "phrase": "deep_concavity"}, {"score": 0.0023944552329463035, "phrase": "gradient_vector_field_or_vector_field_convolution_snakes"}, {"score": 0.0021539955106204354, "phrase": "single_object"}, {"score": 0.0021342613107011624, "phrase": "real_images"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "In active contour models (snakes), various vector force fields replacing the gradient of the original external energy in the equations of motion are a popular way to extract the object boundary. Gradient descent method is usually used to obtain the equations of motion by minimising the energy functional. However, it always suffers from local minimum in extracting complex geometries because of non-convex functional. Gradient descent method with adaptive momentum term is proposed in this study. First, an acceleration function of evolution is defined. Then, the adaptive momentum term is obtained by calculating the product between the edge stopping function and the defined acceleration function. Finally, adaptive momentum is compatible with the snakes. The edge stopping function is used to decide the influence region of the momentum, whereas the defined acceleration function determines the magnitude of the momentum. It is used to extract the complex geometries (such as deep concavity) when adding the adaptive momentum into some snakes, such as gradient vector field or vector field convolution snakes. On the other hand, the proposed method also accelerates the rate of convergence. It can be applied to extract a single object in real images. The experimental results show that the proposed method is effective and efficient.", "paper_title": "Gradient descent with adaptive momentum for active contour models", "paper_id": "WOS:000338559500003"}