{"auto_keywords": [{"score": 0.049599133429907766, "phrase": "esol_teacher_candidates"}, {"score": 0.01466108597614253, "phrase": "english"}, {"score": 0.00481495049065317, "phrase": "core_task"}, {"score": 0.00376127170364341, "phrase": "instructional_technology_skills"}, {"score": 0.003704797078215222, "phrase": "english_learners"}, {"score": 0.0036491673002304326, "phrase": "teacher_candidates'_attitudes"}, {"score": 0.003469676666252421, "phrase": "core_assignment"}, {"score": 0.003417565253539315, "phrase": "qualitative_research"}, {"score": 0.0033832583769880576, "phrase": "five_themes"}, {"score": 0.002628747284714371, "phrase": "new_generations"}, {"score": 0.002486734224234698, "phrase": "esol_teacher_candidates'_experiences"}, {"score": 0.0023287359930308864, "phrase": "new_generation"}, {"score": 0.0022937210378944457, "phrase": "highly_proactive_learners"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Authoring tools & methods", " Improving classroom teaching", " Postsecondary education", " Teaching/learning strategies"], "paper_abstract": "Due to innovation and globalization in education, educators of English for Speakers of Other Languages (ESOL) are encouraged to use such instructional technologies as podcasting and blogging, but studies on integrating these technologies into assignments are rare. This project revealed how ESOL teacher candidates implement instructional technology skills to help English learners and the teacher candidates' attitudes and processes toward implementing podcasting and blogging as a core assignment. Using qualitative research, five themes emerged: (a) ESOL teacher candidates' attitudes and self-assessments, (b) their implementation of podcasting and blogging, (c) their challenges and rewards, (d) the impact on their professional development, and (e) their own impact on new generations of students, particularly English learners. This discussion highlights ESOL teacher candidates' experiences while learning podcasting and blogging. ESOL teacher candidates, recognizing their future students as a new generation, are highly proactive learners and want very much to be competent and confident in their own teaching. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Incorporating podcasting and blogging into a core task for ESOL teacher candidates", "paper_id": "WOS:000286682700009"}