{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "voronoi_diagram"}, {"score": 0.010883745740798267, "phrase": "interaction_interface"}, {"score": 0.004550783060775205, "phrase": "linear_sequence"}, {"score": 0.004514241562580097, "phrase": "amino_acids"}, {"score": 0.00445997627516653, "phrase": "peptide_bonds"}, {"score": 0.004064958518350867, "phrase": "important_physiological_phenomena"}, {"score": 0.0038885527668812807, "phrase": "protein_interactions"}, {"score": 0.0038263136898042285, "phrase": "life_science"}, {"score": 0.003473178781851477, "phrase": "geometric_point"}, {"score": 0.003165283275312972, "phrase": "mathematical_definition"}, {"score": 0.0029913511336659327, "phrase": "inter-_and_intra-protein_interactions"}, {"score": 0.002943472241907404, "phrase": "voronoi"}, {"score": 0.002748159131396737, "phrase": "geometric_mid-surface"}, {"score": 0.0024149629835339926, "phrase": "voronoi_face"}, {"score": 0.002357131515622894, "phrase": "different_chains"}, {"score": 0.002218526133566788, "phrase": "worst_case"}, {"score": 0.0021917966722180132, "phrase": "voronoi_faces"}, {"score": 0.0021049977753042253, "phrase": "geometric_and_topological_measures"}], "paper_keywords": ["interaction interface", " protein interaction", " Voronoi diagram"], "paper_abstract": "A protein consists of one or more chains where each chain is a linear sequence of amino acids bonded by peptide bonds. Chains in a protein interact with each other and the interaction is known to be one of the most fundamental factors which determine important physiological phenomena in the body. Hence, biologists have been investigating protein interactions since the early days of life science. While the studies on the interactions by biologists have emphasized the biological, chemical and/or physical aspects of the interactions, we approach the interactions from a geometric point of view. In this paper, we define an interaction interface using the Voronoi diagram of atoms in proteins. Based on a mathematical definition of the interaction interface, we provide a set of measures to characterize the inter- and intra-protein interactions. Given a Voronoi diagram of atoms in a protein consisting of a number of chains, we compute a geometric mid-surface, called an interaction interface, between each pair of chains in the protein. The interface consists of a set of faces where each face in the interface is a Voronoi face defined by two atoms belonging to different chains. Hence, the interface can be found in O(m) time in the worst case for in Voronoi faces in the Voronoi diagram. Then, a number of geometric and topological measures are derived from the interface to characterize the interaction. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Interaction interfaces in proteins via the Voronoi diagram of atoms", "paper_id": "WOS:000241506700005"}