{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soundness_problem"}, {"score": 0.019962855428190082, "phrase": "weak_soundness_problem"}, {"score": 0.01154409119942354, "phrase": "pspace"}, {"score": 0.008635750461184689, "phrase": "workflow_nets"}, {"score": 0.004439097815805505, "phrase": "business_process_management_systems"}, {"score": 0.00439918275666155, "phrase": "composite_web_services"}, {"score": 0.004243064277617193, "phrase": "important_criterion"}, {"score": 0.0038178995533949176, "phrase": "k-soundness_problem"}, {"score": 0.003235305151177897, "phrase": "aalst_et_al"}, {"score": 0.0030783143919343972, "phrase": "free-choice_wf-nets"}, {"score": 0.0030505976034245234, "phrase": "fcwf"}, {"score": 0.0024774888010414206, "phrase": "asymmetric-choice_wf-nets"}, {"score": 0.002455168454109375, "phrase": "acwf"}], "paper_keywords": ["Business process modeling", " workflow net", " soundness", " weak soundness", " complexity"], "paper_abstract": "Workflow nets (WF-nets) are widely used to model and verify the business process management systems and composite web services. The (weak) soundness of WF-nets is an important criterion for the correctness of these systems. This paper focuses on the complexity of solving the (weak) soundness problem. Aalst et al. have proven that the (weak) soundness problem is decidable. Our previous work has proven that the soundness problem for bounded WF-nets is PSPACE-complete. This paper shows that the weak soundness problem for bounded WF-nets is also PSPACE-complete. Aalst et al. has proven that the soundness problem is polynomially solvable for free-choice WF-nets (FCWF-nets). This paper discovers that the weak soundness problem is equivalent to the soundness problem for FCWF-nets. Therefore, the weak soundness problem for FCWF-nets is also polynomially solvable. Unfortunately, many composite web services are not modeled by FCWF-nets. Lots of them can be modeled by asymmetric-choice WF-nets (ACWF-nets). This paper proves that the soundness problem is co-NP-hard for ACWF-nets even when they are three-bounded. Additionally, this paper proves that the k-soundness problem is equivalent to the weak soundness problem for WF-nets, which implies that the k-soundness problem for bounded WF-nets is also PSPACE-complete.", "paper_title": "Some Complexity Results for the Soundness Problem of Workflow Nets", "paper_id": "WOS:000337901500015"}