{"auto_keywords": [{"score": 0.049239058804488534, "phrase": "university_examination_timetabling_problem"}, {"score": 0.00481495049065317, "phrase": "particle_swarm_optimization_techniques"}, {"score": 0.004459334186889869, "phrase": "numerous_educational_organizations"}, {"score": 0.004081385289516914, "phrase": "particular_timeslots"}, {"score": 0.0038708986370431563, "phrase": "np"}, {"score": 0.0036914757355166966, "phrase": "conflicting_constraints"}, {"score": 0.0034388111429203222, "phrase": "common_intelligent_method"}, {"score": 0.002897109710213723, "phrase": "pso_technique"}, {"score": 0.0027796495180095657, "phrase": "overall_techniques"}, {"score": 0.00266693888510356, "phrase": "particle_representation"}, {"score": 0.0024695739265437823, "phrase": "pso_algorithm"}, {"score": 0.0022070310530794097, "phrase": "described_algorithms"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": ["Timetabling", " Scheduling", " Combinatorial optimization", " Particle Swarm Optimization", " NP-complete"], "paper_abstract": "The university Examination Timetabling Problem is one of the most important scheduling problems that numerous educational organizations have to find out a solution to manage their examinations by assigning these events to particular timeslots, rooms and/or invigilators. This problem is NP-complete due to the number of conflicting constraints that must be considered in the resolution. Particle Swarm Optimization (PSO) technique is a common intelligent method that has been successfully applied to many hard combinatorial optimization problems. The purpose of this paper is to expose a number of articles that appeared this last decade and used the PSO technique to solve the University examination timetabling problem. The overall techniques are described, focusing on the particle representation and updating. This research also offers insight into how well the PSO algorithm performs compared with other algorithms used to solve the same problem and datasets. Finally, a summary of the described algorithms and their most distinguishing features is presented in addition to future research directions.", "paper_title": "A survey of Particle Swarm Optimization techniques for solving university Examination Timetabling Problem", "paper_id": "WOS:000363953700004"}