{"auto_keywords": [{"score": 0.041973058972454465, "phrase": "ehr_systems"}, {"score": 0.01155568373700444, "phrase": "ehr_data"}, {"score": 0.00481495049065317, "phrase": "electronic_health_records"}, {"score": 0.004628612093713039, "phrase": "systematic_literature_review"}, {"score": 0.004544127927346964, "phrase": "electronic_health_record"}, {"score": 0.004391435559942488, "phrase": "english"}, {"score": 0.004356745009737705, "phrase": "medline"}, {"score": 0.00433386573276633, "phrase": "acm_digital_library"}, {"score": 0.004311109608629196, "phrase": "wiley_inter-science"}, {"score": 0.004288472456976113, "phrase": "ieee_digital_library"}, {"score": 0.004243552607799184, "phrase": "metapress"}, {"score": 0.0042212686864468805, "phrase": "eric"}, {"score": 0.004199101601918643, "phrase": "cinahl"}, {"score": 0.0038904014540990877, "phrase": "predefined_search_string"}, {"score": 0.0034373884861033446, "phrase": "hipaa"}, {"score": 0.003321642758350516, "phrase": "key_schemes"}, {"score": 0.0032695402272090424, "phrase": "pseudo_anonymity_technique"}, {"score": 0.0031594291695784286, "phrase": "digital_signature_scheme"}, {"score": 0.002989313352047128, "phrase": "digital_certificate"}, {"score": 0.002926936893217662, "phrase": "preferred_access_control_model"}, {"score": 0.0028962370433768267, "phrase": "role-based_access_control"}, {"score": 0.002740253546178098, "phrase": "ehr_systems'_roles"}, {"score": 0.002640947693258573, "phrase": "health_entities"}, {"score": 0.0025452314655691165, "phrase": "defined_access_policies"}, {"score": 0.0024081065242654754, "phrase": "system_users"}, {"score": 0.002395437787820304, "phrase": "health_staff"}, {"score": 0.002326938965568362, "phrase": "recent_years"}, {"score": 0.0021385822825864425, "phrase": "secure_ehr_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Electronic health records", " Systematic review", " Privacy", " Confidentiality", " Security", " Standards"], "paper_abstract": "Objective: To report the results of a systematic literature review concerning the security and privacy of electronic health record (EHR) systems. Data sources: Original articles written in English found in MEDLINE, ACM Digital Library, Wiley Inter-Science, IEEE Digital Library, Science@Direct, MetaPress, ERIC, CINAHL and Trip Database. Study selection: Only those articles dealing with the security and privacy of EHR systems. Data extraction: The extraction of 775 articles using a predefined search string, the outcome of which was reviewed by three authors and checked by a fourth. Results: A total of 49 articles were selected, of which 26 used standards or regulations related to the privacy and security of EHR data. The most widely used regulations are the Health Insurance Portability and Accountability Act (HIPAA) and the European Data Protection Directive 95/46/EC. We found 23 articles that used symmetric key and/or asymmetric key schemes and 13 articles that employed the pseudo anonymity technique in EHR systems. A total of 11 articles propose the use of a digital signature scheme based on PKI (Public Key Infrastructure) and 13 articles propose a login/password (seven of them combined with a digital certificate or PIN) for authentication. The preferred access control model appears to be Role-Based Access Control (RBAC), since it is used in 27 studies. Ten of these studies discuss who should define the EHR systems' roles. Eleven studies discuss who should provide access to EHR data: patients or health entities. Sixteen of the articles reviewed indicate that it is necessary to override defined access policies in the case of an emergency. In 25 articles an audit-log of the system is produced. Only four studies mention that system users and/or health staff should be trained in security and privacy. Conclusions: Recent years have witnessed the design of standards and the promulgation of directives concerning security and privacy in EHR systems. However, more work should be done to adopt these regulations and to deploy secure EHR systems. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Security and privacy in electronic health records: A systematic literature review", "paper_id": "WOS:000319719500015"}