{"auto_keywords": [{"score": 0.033340417945684854, "phrase": "service_capacity_analysis"}, {"score": 0.00481495049065317, "phrase": "vehicular_networks"}, {"score": 0.004214729542986473, "phrase": "resource_sharing"}, {"score": 0.004157058883925715, "phrase": "vehicular_network"}, {"score": 0.004025531820226182, "phrase": "dissemination_process"}, {"score": 0.0036385493850693983, "phrase": "performance_parameter"}, {"score": 0.0035722806911457545, "phrase": "service_capacity"}, {"score": 0.003349670229755675, "phrase": "mobile_networks"}, {"score": 0.0032886455096627324, "phrase": "open_problem"}, {"score": 0.0030414140732789186, "phrase": "traffic_patterns"}, {"score": 0.002999749669403939, "phrase": "realistic_car_interactions"}, {"score": 0.0027361626349903744, "phrase": "resource_dissemination"}, {"score": 0.00257735013358606, "phrase": "impact_of_traffic_correlation_and_node_density"}, {"score": 0.002518746501941657, "phrase": "mobile_vehicles"}, {"score": 0.002329258721870127, "phrase": "link_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vehicular networks", " Resource dissemination", " Vehicular traffic modeling", " Analysis"], "paper_abstract": "The support of peer-to-peer (P2P) resource sharing in dynamic scenarios is one of the most challenging research fields for both its expected commercial and technological impact on everyday life. To this purpose, resource sharing within a vehicular network can facilitate an acceleration in the dissemination process and increase the number of nodes in the network which possess a certain resource and can share it with other devices. This performance parameter, denoted as service capacity, has been recently studied in the context of wired P2P networks but its calculation in mobile networks is still an open problem. In this paper, we perform a service capacity analysis in P2P vehicular networks where nodes move according to traffic patterns which consider realistic car interactions such as acceleration, breaking and inter-car minimum safety distance maintenance and, while moving, perform resource dissemination. More specifically, we will present a service capacity analysis which considers the impact of traffic correlation and node density on the number of mobile vehicles in the network possessing a certain resource. Finally, we will also estimate the impact of link errors on the probability that a resource is propagated up to a certain location, in a given time. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Service capacity in vehicular networks: A resource dissemination analysis", "paper_id": "WOS:000206061400006"}