{"auto_keywords": [{"score": 0.04806279063663182, "phrase": "transmission_failures"}, {"score": 0.03840056312686232, "phrase": "proposed_scheme"}, {"score": 0.011211509198444453, "phrase": "fn_phase"}, {"score": 0.008753543567974002, "phrase": "capture_effect"}, {"score": 0.004245130986749751, "phrase": "transmission_failure"}, {"score": 0.004180403355909392, "phrase": "current_adaptive_schemes"}, {"score": 0.003979807104455635, "phrase": "erroneous_behaviour"}, {"score": 0.003943276844539606, "phrase": "real_world"}, {"score": 0.0038356779275844927, "phrase": "novel_scheme"}, {"score": 0.0036291762280629115, "phrase": "accurate_collision_detection"}, {"score": 0.0035410047967781547, "phrase": "fn"}, {"score": 0.0033297542331358057, "phrase": "failed_transmission"}, {"score": 0.0030738153524707094, "phrase": "received_information"}, {"score": 0.0029171727082441244, "phrase": "cn_phase"}, {"score": 0.0028814877314661054, "phrase": "collision_information"}, {"score": 0.0028200832328369816, "phrase": "collision-involved_stations"}, {"score": 0.0026112423766508543, "phrase": "hidden_stations"}, {"score": 0.0024857542101349808, "phrase": "performance_improvement"}, {"score": 0.002432762217202045, "phrase": "comprehensive_computer_simulation"}, {"score": 0.0023735785441690097, "phrase": "automatic_rate_fallback"}, {"score": 0.002287485527155396, "phrase": "backoff_mechanism"}, {"score": 0.0021842376228111537, "phrase": "system_throughput"}, {"score": 0.0021376596688185605, "phrase": "adaptive_usage"}], "paper_keywords": ["wireless LAN", " 802.11", " collision detection"], "paper_abstract": "Many control schemes proposed for IEEE 802.11 wireless LANs (WLANs) behave adaptively to transmission failures, which occur mostly by two causes: collision and channel noise. However, in generic 802.11 WLANs, a station cannot know the cause of a transmission failure, and thus the current adaptive schemes assume that all transmission failures occur by one of the causes, which may lead to erroneous behaviour in the real world. In this paper, we propose a novel scheme to detect collisions, which can help to differentiate the causes of transmission failures. The proposed scheme conducts accurate collision detection basically in two phases: failure notification (FN) and collision notification (CN). In the FN phase, a station disseminates the information about a failed transmission, i.e., transmission time or RF energy time on the channel, and the rest of the stations judge the cause by checking the received information against their own transmission history. If a station detects a collision through the FN phase, it starts the CN phase by disseminating the collision information so that the rest of the collision-involved stations self-detect the collision. In addition, the proposed scheme can detect the occurence of the capture effect as well as the existence of hidden stations. To demonstrate the effectiveness of the proposed scheme, we present four applications and verify the performance improvement in each of the applications through comprehensive computer simulation, i.e., throughput enhancement of ARF (Automatic Rate Fallback) rate adaptation algorithm in various channel environments, efficiency improvement of the backoff mechanism with a few contending stations, fairness improvement against the capture effect and the improvement of the system throughput as well as fairness by the adaptive usage of the Request-to-Send/Clearto-Send (RTS/CTS) exchange. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Novel collision detection scheme and its applications for IEEE 802.11 wireless LANs", "paper_id": "WOS:000245700600016"}