{"auto_keywords": [{"score": 0.04905613790748982, "phrase": "research_performance"}, {"score": 0.015719716506582538, "phrase": "management_research"}, {"score": 0.015552836069159312, "phrase": "taiwan"}, {"score": 0.004072573194988867, "phrase": "performance_improvement"}, {"score": 0.003900257249255497, "phrase": "malmquist_productivity_index"}, {"score": 0.003675120438902734, "phrase": "journal_publications"}, {"score": 0.0035195641694922195, "phrase": "si-"}, {"score": 0.0034817089485150365, "phrase": "ti-"}, {"score": 0.0030912235505556906, "phrase": "mpi"}, {"score": 0.0030250067691601967, "phrase": "aggregate_performance"}, {"score": 0.0028043588777213533, "phrase": "management_information_systems"}, {"score": 0.0027443174539994925, "phrase": "operations_management"}, {"score": 0.0021049977753042253, "phrase": "higher_levels"}], "paper_keywords": ["Data envelopment analysis", " Malmquist productivity index", " Research performance", " Management"], "paper_abstract": "Research performance is difficult to evaluate because most of the criteria are incommensurable, and assessing its improvement over time is even more difficult. This paper assesses the performance improvement in management research in Taiwan between 2006 and 2010 using the Malmquist productivity index (MPI). The criteria for measuring research performance are journal publications, where the journals are classified as SI-, TI-, other international-, and other local-types. While the number of papers has increased for three types and decreased in one, the MPI indicates that the aggregate performance has improved significantly. The areas of management covered in this study are management information systems, production and operations management, and marketing. For all these areas the performance has improved, although the improvement in marketing is insignificant. The assessment sheds some light on the area and category of journals that contribute to the improvement of research performance, and which are useful for setting goals to reach higher levels.", "paper_title": "Assessing improvement in management research in Taiwan", "paper_id": "WOS:000305686800006"}