{"auto_keywords": [{"score": 0.036958987515004336, "phrase": "quality_degradation_indicators"}, {"score": 0.03649099480837688, "phrase": "perceptual_dimensions"}, {"score": 0.009662611730091126, "phrase": "first_step"}, {"score": 0.00481495049065317, "phrase": "relevant_degradation_indicators"}, {"score": 0.004783358523770212, "phrase": "super_wideband"}, {"score": 0.0047676399834833275, "phrase": "listening_quality_assessment_models"}, {"score": 0.004705278218845159, "phrase": "new_objective_speech_quality_evaluation_methods"}, {"score": 0.004613254605667248, "phrase": "new_high_voice_quality_contexts"}, {"score": 0.004405440436639404, "phrase": "voice_quality_perceptual_dimensions"}, {"score": 0.00433350214927936, "phrase": "frequency_response_distortions"}, {"score": 0.004248718518635191, "phrase": "speech_level_deviations"}, {"score": 0.004057258742593542, "phrase": "diagnostic_information"}, {"score": 0.004030618026002216, "phrase": "specific_aspects"}, {"score": 0.003990983268804689, "phrase": "transmission_systems'_quality"}, {"score": 0.0037119497772861165, "phrase": "polqa"}, {"score": 0.003579809826486388, "phrase": "listening_quality"}, {"score": 0.003384754649268796, "phrase": "main_goal"}, {"score": 0.00309650383642243, "phrase": "underlying_technical_causes"}, {"score": 0.003076152130543236, "phrase": "super_wideband_telephone_communications"}, {"score": 0.002625788054806854, "phrase": "second_step"}, {"score": 0.0025405829212597586, "phrase": "identified_quality_degradation_indicators"}], "paper_keywords": ["Perceptual dimensions", " Super wideband", " Voice quality assessment", " Objective models", " Diagnostic"], "paper_abstract": "Recently, new objective speech quality evaluation methods, designed and adapted to new high voice quality contexts, have been developed. One interest of these methods is that they integrate voice quality perceptual dimensions reflecting the effects of frequency response distortions, discontinuities, noise and/or speech level deviations respectively. This makes it possible to use these methods also to provide diagnostic information about specific aspects of the transmission systems' quality, as perceived by end-users. In this paper, we present and analyze in depth two of these approaches namely POLQA (Perceived Objective Listening Quality Assessment) and DIAL (Diagnostic Instrumental Assessment of Listening quality), in terms of quality degradation indicators related to the perceptual dimensions these models could embed. The main goal of our work is to find and propose the most robust quality degradation indicators to reliably characterize the impact of degradations relative to the perceptual dimensions described above and to identify the underlying technical causes in super wideband telephone communications [50, 14000] Hz. To do so, the first step of our study was to identify in both models the correspondence between perceptual dimensions and quality degradation indicators. Such indicators could be either present in the model itself or derived from our own investigation of the model. In a second step, we analyzed the performance and robustness of the identified quality degradation indicators on speech samples only impaired by one degradation (representative of one perceptual dimension) at a time. This study highlighted the reliability of some of the quality degradation indicators embedded in the two models under study and stood for a first step in the evaluation of performance of these indicators to quantify the degradation for which they were designed. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the identification of relevant degradation indicators in super wideband listening quality assessment models", "paper_id": "WOS:000324227500010"}