{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "goal_plans"}, {"score": 0.004776669953449352, "phrase": "soccer_simulated_matches"}, {"score": 0.004682288586254123, "phrase": "competitive_and_collective_sport"}, {"score": 0.0044990584725586764, "phrase": "basic_actions"}, {"score": 0.003975200317233532, "phrase": "future_matches"}, {"score": 0.00374399358035391, "phrase": "plan_definition_language"}, {"score": 0.0036553070575015344, "phrase": "relevant_behaviors"}, {"score": 0.0034426417353349567, "phrase": "game_log_files"}, {"score": 0.003255295296893174, "phrase": "proposed_approach"}, {"score": 0.002957471572421436, "phrase": "ball_possession"}, {"score": 0.002818909613625567, "phrase": "significant_part"}, {"score": 0.0027852927366010406, "phrase": "total_goals"}, {"score": 0.0024703502756471514, "phrase": "meaningful_guidelines"}, {"score": 0.002373472641477602, "phrase": "possible_extensions"}, {"score": 0.0022352169832099153, "phrase": "goal_opportunities"}, {"score": 0.002199725773957207, "phrase": "opponent's_team_strategy"}, {"score": 0.0021049977753042253, "phrase": "optimization_techniques"}], "paper_keywords": ["Game analysis", " Set-play", " Cooperative behavior", " Plan extraction"], "paper_abstract": "Soccer is a competitive and collective sport in which teammates try to combine the execution of basic actions (cooperative behavior) to lead their team to more advantageous situations. The ability to recognize, extract and reproduce such behaviors can prove useful to improve the performance of a team in future matches. This work describes a methodology for achieving just that makes use of a plan definition language to abstract the representation of relevant behaviors in order to promote their reuse. Experiments were conducted based on a set of game log files generated by the Soccer Server simulator which supports the RoboCup 2D simulated robotic soccer league. The effectiveness of the proposed approach was verified by focusing primarily on the analysis of behaviors which started from set-pieces and led to the scoring of goals while the ball possession was kept. One of the results obtained showed that a significant part of the total goals scored was based on this type of behaviors, demonstrating the potential of conducting this analysis. Other results allowed us to assess the complexity of these behaviors and infer meaningful guidelines to consider when defining plans from scratch. Some possible extensions to this work include assessing which plans have the ability to maximize the creation of goal opportunities by countering the opponent's team strategy and how the effectiveness of plans can be improved using optimization techniques.", "paper_title": "An automatic approach to extract goal plans from soccer simulated matches", "paper_id": "WOS:000317786400009"}