{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "oral_documents"}, {"score": 0.01831705654409273, "phrase": "oral_document"}, {"score": 0.010133725558793388, "phrase": "information_behavior"}, {"score": 0.004456475967147909, "phrase": "oral_information"}, {"score": 0.003961842092184655, "phrase": "social_constructionism"}, {"score": 0.003913067698038614, "phrase": "document_studies"}, {"score": 0.003888905257972882, "phrase": "allied_literatures"}, {"score": 0.003209275810748739, "phrase": "full_understanding"}, {"score": 0.0031501497751403058, "phrase": "subsequent_study"}, {"score": 0.0030634906292640947, "phrase": "oral_document_concept"}, {"score": 0.002879329998649317, "phrase": "single_oral_document"}, {"score": 0.0028438444033180303, "phrase": "small_sample"}, {"score": 0.0027827907725673845, "phrase": "oral_data"}, {"score": 0.002672852325427058, "phrase": "information_science"}, {"score": 0.002405372603197824, "phrase": "major_new_object"}, {"score": 0.002198440442866291, "phrase": "continued_analysis"}, {"score": 0.0021049977753042253, "phrase": "informal_online_communication"}], "paper_keywords": ["Oral documents", " Face-to-face communication", " Information behaviour", " Properties of documentary practice", " Documents", " Document management"], "paper_abstract": "Purpose - Although research indicates the importance of oral information, our understanding of it remains limited. This paper accordingly aims to suggest that some utterances are oral documents and explore how to identify them. Design/methodology/approach - This study analyzes certain oral artifacts through: exploring how research in social constructionism, information behavior, document studies and allied literatures facilitate the articulation of the concept of an oral document; and reporting on an investigation that operationalizes the properties of documents to facilitate empirically observing an oral document. Findings - The results reveal an oral document observed in situ, which further validates the concept. Additionally, the results indicate. that the method used, however systematic, prevents a full understanding of data gathered and that subsequent study of that data would generate further understanding of the oral document concept (presented in Part II). Research limitations/implications - The method utilized limits the research results to identifying a single oral document identified within a small sample of face-to-face oral data. Practical implications - The reification of oral documents broadens the scope of information science and implies a need to understand them better, in order for practitioners to carry out their professional responsibilities to collect, describe, organize and preserve them. Originality/value - This paper conceptualizes a major new object of study for the field - an oral document. This paper also presents recommendations for research that expands on the method used herein, and suggestions for continued analysis. Some of these techniques will likely also prove valuable in analyzing some informal online communication, which shares some characteristics with oral documents.", "paper_title": "Oral documents in concept and in situ, part I Grounding an exploration of orality and information behavior", "paper_id": "WOS:000312362600007"}