{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pilot_concept-based_query_interface"}, {"score": 0.004524348699657099, "phrase": "pilot_query_interface"}, {"score": 0.004275347843870176, "phrase": "\"concept-based\"_approach"}, {"score": 0.00417961150804265, "phrase": "neuroscience_information_framework"}, {"score": 0.004039995317682942, "phrase": "query_interface"}, {"score": 0.003817548980308163, "phrase": "search_terms"}, {"score": 0.003627800727103479, "phrase": "standardized_vocabulary"}, {"score": 0.003294669032149345, "phrase": "nif"}, {"score": 0.003026127736667187, "phrase": "nif_resources"}, {"score": 0.0028111220617485985, "phrase": "single_interface"}, {"score": 0.0024673738215365104, "phrase": "standardized_biomedical_vocabularies"}, {"score": 0.0024395426929046415, "phrase": "biomedical_information_retrieval"}, {"score": 0.0023579143175099324, "phrase": "detailed_example"}, {"score": 0.0021049977753042253, "phrase": "current_version"}], "paper_keywords": ["Data search", " Web search", " Ontologies", " Database mediation", " Data federation", " Text search", " Neuroscience"], "paper_abstract": "This paper describes a pilot query interface that has been constructed to help us explore a \"concept-based\" approach for searching the Neuroscience Information Framework (NIF). The query interface is concept-based in the sense that the search terms submitted through the interface are selected from a standardized vocabulary of terms (concepts) that are structured in the form of an ontology. The NIF contains three primary resources: the NIF Resource Registry, the NIF Document Archive, and the NIF Database Mediator. These NIF resources are very different in their nature and therefore pose challenges when designing a single interface from which searches can be automatically launched against all three resources simultaneously. The paper first discusses briefly several background issues involving the use of standardized biomedical vocabularies in biomedical information retrieval, and then presents a detailed example that illustrates how the pilot concept-based query interface operates. The paper concludes by discussing certain lessons learned in the development of the current version of the interface.", "paper_title": "Issues in the Design of a Pilot Concept-Based Query Interface for the Neuroinformatics Information Framework", "paper_id": "WOS:000260839100007"}