{"auto_keywords": [{"score": 0.04708471221683657, "phrase": "abdalla_et_al"}, {"score": 0.00481495049065317, "phrase": "wildcarded_identity-based"}, {"score": 0.004776297980616768, "phrase": "inner-product_encryption"}, {"score": 0.004406360418456518, "phrase": "identity-based_encryption"}, {"score": 0.003920049436883885, "phrase": "identity_strings"}, {"score": 0.003719773848735395, "phrase": "neven"}, {"score": 0.003616189733352126, "phrase": "key_derivation_process"}, {"score": 0.0035439655241057207, "phrase": "current_constructions"}, {"score": 0.0033223686422055834, "phrase": "maximum_hierarchy_depth"}, {"score": 0.002872979681637667, "phrase": "wibe_scheme"}, {"score": 0.002628747284714371, "phrase": "polynomially_many_levels"}, {"score": 0.0025145109881926143, "phrase": "hierarchical_predicate_encryption"}, {"score": 0.0024345529783611703, "phrase": "key_delegation"}, {"score": 0.0023666732429695908, "phrase": "anonymous_ww-ibe_scheme"}, {"score": 0.002254672021120091, "phrase": "hpe_scheme"}, {"score": 0.0022365262201954643, "phrase": "lewko_et_al"}, {"score": 0.0021306709646058295, "phrase": "standard_model"}, {"score": 0.0021049977753042253, "phrase": "existing_complexity_assumptions"}], "paper_keywords": ["Anonymity", " wildcarded identity-based encryption", " inner-product encryption"], "paper_abstract": "Inspired by the fact that many e-mail addresses correspond to groups of users, Abdalla et al. introduced the notion of identity-based encryption with wildcards (WIBE), which allows a sender to simultaneously encrypt messages to a group of users matching a certain pattern, defined as a sequence of identity strings and wildcards. This notion was later generalized by Abdalla, Kiltz, and Neven, who considered more general delegation patterns during the key derivation process. Despite its many applications, current constructions have two significant limitations: 1) they are only known to be fully secure when the maximum hierarchy depth is a constant; and 2) they do not hide the pattern associated with the ciphertext. To overcome these, this paper offers two new constructions. First, we show how to convert a WIBE scheme of Abdalla et al. into a (nonanonymous) WIBE scheme with generalized key delegation (WW-IBE) that is fully secure even for polynomially many levels. Then, to achieve anonymity, we initially consider hierarchical predicate encryption (HPE) schemes with more generalized forms of key delegation and use them to construct an anonymous WW-IBE scheme. Finally, to instantiate the former, we modify the HPE scheme of Lewko et al. to allow for more general key delegation patterns. Our proofs are in the standard model and use existing complexity assumptions.", "paper_title": "Generalized Key Delegation for Wildcarded Identity-Based and Inner-Product Encryption", "paper_id": "WOS:000311702600003"}