{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "binary_deletion_channel"}, {"score": 0.04960770684597511, "phrase": "small_deletion_probability"}, {"score": 0.02701370546147613, "phrase": "optimal_input_distribution"}, {"score": 0.004628101576367193, "phrase": "simplest_point-to-point_communication_channel"}, {"score": 0.004470539706227421, "phrase": "input_bits"}, {"score": 0.004361276005140776, "phrase": "probability_d"}, {"score": 0.003989487818395848, "phrase": "significant_effort"}, {"score": 0.0037039021744127783, "phrase": "optimal_coding_schemes"}, {"score": 0.0035424245257172234, "phrase": "new_systematic_approach"}, {"score": 0.0033050703534275717, "phrase": "series_expansion"}, {"score": 0.00308357048262018, "phrase": "input_distribution"}, {"score": 0.0029055323737809825, "phrase": "first_optimal_random_coding_result"}, {"score": 0.002806449337145999, "phrase": "key_idea"}, {"score": 0.002670719148310961, "phrase": "deletion_channel"}, {"score": 0.0023710856920150574, "phrase": "small_deletion_probabilities"}], "paper_keywords": ["Capacity achieving code", " channel capacity", " deletion channel", " series expansion"], "paper_abstract": "The binary deletion channel is the simplest point-to-point communication channel that models lack of synchronization. Input bits are deleted independently with probability d, and when they are not deleted, they are not affected by the channel. Despite significant effort, little is known about the capacity of this channel and even less about optimal coding schemes. In this paper, we develop a new systematic approach to this problem, by demonstrating that capacity can be computed in a series expansion for small deletion probability. We compute three leading terms of this expansion, and find an input distribution that achieves capacity up to this order. This constitutes the first optimal random coding result for the deletion channel. The key idea employed is the following: We understand perfectly the deletion channel with deletion probability d=0. It has capacity 1 and the optimal input distribution is iid Bernoulli(1/2). It is natural to expect that the channel with small deletion probabilities has a capacity that varies smoothly with d, and that the optimal input distribution is obtained by smoothly perturbing the iid Bernoulli(1/2) process. Our results show that this is indeed the case.", "paper_title": "Optimal Coding for the Binary Deletion Channel With Small Deletion Probability", "paper_id": "WOS:000324573500003"}