{"auto_keywords": [{"score": 0.029493245104715765, "phrase": "thought_processes"}, {"score": 0.004706206193274572, "phrase": "employee_computer_abuse._recent_academic_investigations"}, {"score": 0.004530371221172796, "phrase": "non-malicious_noncompliance"}, {"score": 0.004478907336898875, "phrase": "poor_training"}, {"score": 0.004444921827311577, "phrase": "low_employee_motivation"}, {"score": 0.004377719094086111, "phrase": "individual_oversight"}, {"score": 0.004327981760540394, "phrase": "theoretical_foundations"}, {"score": 0.004198082549566806, "phrase": "protection_motivation"}, {"score": 0.0037446140218109895, "phrase": "greater_research_emphasis"}, {"score": 0.003659954070354848, "phrase": "computer_security_policy_violation"}, {"score": 0.003378385493203297, "phrase": "greatest_potential"}, {"score": 0.003094716540812336, "phrase": "computer_abuse"}, {"score": 0.0027495914857929584, "phrase": "potential_offender"}, {"score": 0.00266693888510356, "phrase": "organizational_context"}, {"score": 0.0024428607154967806, "phrase": "specifically_deterrence_safeguards"}, {"score": 0.0022981559278396845, "phrase": "empirical_investigation-techniques"}, {"score": 0.0021537671245615286, "phrase": "organizational_injustice"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Computer abuse", " employee computer crime", " information systems security", " deterrence", " neutralization", " motivation", " disgruntlement", " organizational justice", " instrumental crimes", " expressive crimes", " insider"], "paper_abstract": "Recent academic investigations of computer security policy violations have largely focused on non-malicious noncompliance due to poor training, low employee motivation, weak affective commitment, or individual oversight. Established theoretical foundations applied to this domain have related to protection motivation, deterrence, planned behavior, self-efficacy, individual adoption factors, organizational commitment, and other individual cognitive factors. But another class of violation demands greater research emphasis: the intentional commission of computer security policy violation, or insider computer abuse. Whether motivated by greed, disgruntlement, or other psychological processes, this act has the greatest potential for loss and damage to the employer. We argue the focus must include not only the act and its immediate antecedents of intention (to commit computer abuse) and deterrence (of the crime), but also phenomena which temporally precede these areas. Specifically, we assert the need to consider the thought processes of the potential offender and how these are influenced by the organizational context, prior to deterrence. We believe the interplay between thought processes and this context may significantly impact the efficacy of IS security controls, specifically deterrence safeguards. Through this focus, we extend the Straub and Welke (1998) security action cycle framework and propose three areas worthy of empirical investigation-techniques of neutralization (rationalization), expressive/instrumental criminal motivations, and disgruntlement as a result of perceptions of organizational injustice-and propose questions for future research in these areas.", "paper_title": "BEYOND DETERRENCE: AN EXPANDED VIEW OF EMPLOYEE COMPUTER ABUSE", "paper_id": "WOS:000321340500001"}