{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "preceding_vehicle"}, {"score": 0.03520641750999769, "phrase": "unobstructed_view"}, {"score": 0.00481495049065317, "phrase": "cars_transparent"}, {"score": 0.0046593017130868, "phrase": "visual_obstruction"}, {"score": 0.004466519142879166, "phrase": "key_factors"}, {"score": 0.004104456271230213, "phrase": "blocked_field"}, {"score": 0.0038794730876377057, "phrase": "geometric_inconsistency"}, {"score": 0.003807242767474929, "phrase": "camera-eye_discrepancy"}, {"score": 0.0037188360359702182, "phrase": "different_cars"}, {"score": 0.003531474887552889, "phrase": "first-person-perspective_image"}, {"score": 0.003291051334991867, "phrase": "transferred_region"}, {"score": 0.0031995142224983094, "phrase": "local_homography_transformations"}, {"score": 0.003154701855951328, "phrase": "perspective-adaptive_warping"}, {"score": 0.003110515172439764, "phrase": "estimated_transformations"}, {"score": 0.002765490759189057, "phrase": "occluded_region"}, {"score": 0.0027012086158226456, "phrase": "composited_view"}, {"score": 0.0024356148906608025, "phrase": "driver's_visibility"}, {"score": 0.0021049977753042253, "phrase": "real-world_driving_scenarios"}], "paper_keywords": [""], "paper_abstract": "Visual obstruction caused by a preceding vehicle is one of the key factors threatening driving safety. One possible solution is to share the first-person-view of the preceding vehicle to unveil the blocked field-of-view of the following vehicle. However, the geometric inconsistency caused by the camera-eye discrepancy renders view sharing between different cars a very challenging task. In this paper, we present a first-person-perspective image rendering algorithm to solve this problem. Firstly, we contour unobstructed view as the transferred region, then by iteratively estimating local homography transformations and performing perspective-adaptive warping using the estimated transformations, we are able to locally adjust the shape of the unobstructed view so that its perspective and boundary could be matched to that of the occluded region. Thus, the composited view is seamless in both the perceived perspective and photometric appearance, creating an impression as if the preceding vehicle is transparent. Our system improves the driver's visibility and thus relieves the burden on the driver, which in turn increases comfort. We demonstrate the usability and stability of our system by performing its evaluation with several challenging data sets collected from real-world driving scenarios.", "paper_title": "Making in-Front-of Cars Transparent: Sharing First-Person-Views via Dashcam", "paper_id": "WOS:000344369200030"}