{"auto_keywords": [{"score": 0.047438967010745965, "phrase": "mac"}, {"score": 0.015213280163351332, "phrase": "capacity_region"}, {"score": 0.01203965764641165, "phrase": "additive_interference"}, {"score": 0.00481495049065317, "phrase": "gaussian_multiaccess_channel"}, {"score": 0.004592905436175987, "phrase": "two-user_dirty-paper_gaussian_multiaccess_channel"}, {"score": 0.004278807087784626, "phrase": "transmission_block"}, {"score": 0.003948613642680196, "phrase": "error-free_bit_pipes"}, {"score": 0.0038382392088338784, "phrase": "received_signal"}, {"score": 0.0037486121194392564, "phrase": "additive_gaussian_noise"}, {"score": 0.0025436978068459565, "phrase": "degraded_message_sets"}, {"score": 0.0022813860091119953, "phrase": "costa"}, {"score": 0.002125020720324262, "phrase": "dependent_interference"}, {"score": 0.0021049977753042253, "phrase": "not-necessarily_gaussian_noise"}], "paper_keywords": ["Capacity", " coding over spheres", " conferencing encoders", " interference", " multiaccess channel", " writing on dirty paper"], "paper_abstract": "We derive the capacity region of the two-user dirty-paper Gaussian multiaccess channel (MAC) with conferencing encoders. In this MAC, prior to each transmission block, the transmitters can hold a conference in which they can communicate with each other over error-free bit pipes of given capacities. The received signal suffers not only from additive Gaussian noise but also from additive interference, which is known noncausally to the transmitters but not to the receiver. The additive interference is modeled as Gaussian or uniform over a sphere. We show that the interference can be perfectly mitigated, i.e., that the capacity region without interference can also be achieved in its presence. This holds irrespective of whether the transmitters learn the interference before or after the conference. It follows as a corollary that also for the MAC with degraded message sets, the interference can be perfectly mitigated if it is known noncausally to the transmitters. To derive our results, we generalize Costa's single-user writing-on-dirty-paper achievability result to channels with dependent interference and not-necessarily Gaussian noise.", "paper_title": "Dirty-Paper Coding for the Gaussian Multiaccess Channel With Conferencing", "paper_id": "WOS:000307892800002"}