{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "smart_collaborative_mobile_system"}, {"score": 0.004628320711601916, "phrase": "official_statistics"}, {"score": 0.004225950334493496, "phrase": "small_sector"}, {"score": 0.004062057297453209, "phrase": "medical_foundations"}, {"score": 0.003904495523681369, "phrase": "new_technologies"}, {"score": 0.0037087324991876727, "phrase": "cheapest_ways"}, {"score": 0.0034537189001268113, "phrase": "reduced_size_smartphones"}, {"score": 0.003399466007862412, "phrase": "high_processing_capacity"}, {"score": 0.003140680985599885, "phrase": "disabled_and_elderly_people"}, {"score": 0.00303072749758085, "phrase": "smart_collaborative_system"}, {"score": 0.002947868524740683, "phrase": "mobile_devices"}, {"score": 0.002566255769251419, "phrase": "proposed_protocol"}, {"score": 0.0025359354516609795, "phrase": "mobile_ad_hoc_network"}, {"score": 0.0025059724686541263, "phrase": "smart_system_algorithm"}, {"score": 0.0022428042503686053, "phrase": "medium_size_group"}, {"score": 0.0022250978492127163, "phrase": "disabled_or_elderly_people"}], "paper_keywords": ["Disabled and elderly people", " Mobile wireless network", " Collaborative system"], "paper_abstract": "Official statistics data show that in many countries the population is aging. In addition, there are several illnesses and disabilities that also affect a small sector of the population. In recent years, researchers and medical foundations are working in order to develop systems based on new technologies and enhance the quality of life of them. One of the cheapest ways is to take advantage of the features provided by the smartphones. Nowadays, the development of reduced size smartphones, but with high processing capacity, has increased dramatically. We can take profit of the sensors placed in smartphones in order to monitor disabled and elderly people. In this paper, we propose a smart collaborative system based on the sensors embedded in mobile devices, which permit us to monitor the status of a person based on what is happening in the environment, but comparing and taking decisions based on what is happening to its neighbors. The proposed protocol for the mobile ad hoc network and the smart system algorithm are described in detail. We provide some measurements showing the decisions taken for several common cases and we also show the performance of our proposal when there is a medium size group of disabled or elderly people. Our proposal can also be applied to take care of children in several situations.", "paper_title": "Smart Collaborative Mobile System for Taking Care of Disabled and Elderly People", "paper_id": "WOS:000338530300003"}