{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_production"}, {"score": 0.015416809394805333, "phrase": "spanish_public_universities"}, {"score": 0.014495017935366434, "phrase": "impact_factors"}, {"score": 0.004783483480147339, "phrase": "jcr_journals"}, {"score": 0.004140726362519362, "phrase": "simultaneous_issuing"}, {"score": 0.003814632693659797, "phrase": "significant_distortions"}, {"score": 0.0035141291835319682, "phrase": "different_areas"}, {"score": 0.0033016282588376397, "phrase": "varying_presence"}, {"score": 0.0032800186243040663, "phrase": "knowledge_areas"}, {"score": 0.0031845067058084613, "phrase": "jcr."}, {"score": 0.0031532895341013297, "phrase": "traditional_evaluation_method"}, {"score": 0.0031019373572233706, "phrase": "subject_categories"}, {"score": 0.00308163068747474, "phrase": "recent_studies"}, {"score": 0.0030115953761477503, "phrase": "new_possibilities"}, {"score": 0.002982068153662372, "phrase": "inter-area_comparisons"}, {"score": 0.00290473242917264, "phrase": "present_study"}, {"score": 0.0028762499230524812, "phrase": "novel_approach"}, {"score": 0.0028293966058473476, "phrase": "scientific_activity"}, {"score": 0.0027560092576928595, "phrase": "aforementioned_biases"}, {"score": 0.0026581913054027663, "phrase": "new_impact_factor"}, {"score": 0.0025220591847502356, "phrase": "homogeneous_groups"}, {"score": 0.002497319603143104, "phrase": "empirical_application"}, {"score": 0.002346160830406661, "phrase": "multidisciplinary_databases"}, {"score": 0.0022113879114507577, "phrase": "sciences_and_social_sciences_editions"}, {"score": 0.0021896891011033105, "phrase": "journal_citation_report"}], "paper_keywords": ["Research evaluation", " Universities", " Journal impact factor"], "paper_abstract": "Scientific production has been evaluated from very different perspectives, the best known of which are essentially based on the impact factors of the journals included in the Journal Citation Reports (JCR). This has been no impediment to the simultaneous issuing of warnings regarding the dangers of their indiscriminate use when making comparisons. This is because the biases incorporated in the elaboration of these impact factors produce significant distortions, which may invalidate the results obtained. Notable among such biases are those generated by the differences in the propensity to cite of the different areas, journals and/or authors, by variations in the period of materialisation of the impact and by the varying presence of knowledge areas in the sample of reviews contained in the JCR. While the traditional evaluation method consists of standardisation by subject categories, recent studies have criticised this approach and offered new possibilities for making inter-area comparisons. In view of such developments, the present study proposes a novel approach to the measurement of scientific activity, in an attempt to lessen the aforementioned biases. This approach consists of combining the employment of a new impact factor, calculated for each journal, with the grouping of the institutions under evaluation into homogeneous groups. An empirical application is undertaken to evaluate the scientific production of Spanish public universities in the year 2000. This application considers both the articles published in the multidisciplinary databases of the Web of Science (WoS) and the data concerning the journals contained in the Sciences and Social Sciences Editions of the Journal Citation Report (JCR). All this information is provided by the Institute of Scientific Information (ISI), via its Web of Knowledge (WoK).", "paper_title": "A new approach to measuring scientific production in JCR journals and its application to Spanish public universities", "paper_id": "WOS:000280947400020"}