{"auto_keywords": [{"score": 0.049764804068700555, "phrase": "sequential_data"}, {"score": 0.0488347667270834, "phrase": "weather_data"}, {"score": 0.015719716506582538, "phrase": "outlier_detection"}, {"score": 0.015415614158380476, "phrase": "stock_market"}, {"score": 0.004613254605667248, "phrase": "large_variety"}, {"score": 0.004478567563654688, "phrase": "computer_network"}, {"score": 0.004276794599014972, "phrase": "potential_crisis"}, {"score": 0.004248718518635191, "phrase": "stock_market_data"}, {"score": 0.00401736307274363, "phrase": "data_mining_literature"}, {"score": 0.0037364921305658395, "phrase": "peculiar_characteristics"}, {"score": 0.0036997388927095935, "phrase": "specific_type"}, {"score": 0.0034751895536268953, "phrase": "different_types"}, {"score": 0.00327500240690856, "phrase": "new_domain"}, {"score": 0.0031897603004360908, "phrase": "training_data"}, {"score": 0.002879827926178628, "phrase": "graph-based_approach"}, {"score": 0.002832731124016696, "phrase": "contextual_outliers"}, {"score": 0.002786402392182809, "phrase": "developed_algorithm"}, {"score": 0.002758968636750223, "phrase": "higher_degree"}, {"score": 0.002643168068896905, "phrase": "analyzed_data"}, {"score": 0.0026085220231994955, "phrase": "previous_approaches"}, {"score": 0.0021972723598946446, "phrase": "different_domains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Data mining", " Graph-based algorithm", " Outlier detection", " Weather data", " Stock market"], "paper_abstract": "Outlier detection has a large variety of applications ranging from detecting intrusion in a computer network, to forecasting hurricanes and tornados in weather data, to identifying indicators of potential crisis in stock market data, etc. The problem of finding outliers in sequential data has been widely studied in the data mining literature and many techniques have been developed to tackle the problem in various application domains. However, many of these techniques rely on the peculiar characteristics of a specific type of data to detect the outliers. As a result, they cannot be easily applied to different types of data in other application domains; they should at least be tuned and customized to adapt to the new domain. They also may need certain amount of training data to build their models. This makes them hard to apply especially when only a limited amount of data is available. The work described in this paper tackle the problem by proposing a graph-based approach for the discovery of contextual outliers in sequential data. The developed algorithm offers a higher degree of flexibility and requires less amount of information about the nature of the analyzed data compared to the previous approaches described in the literature. In order to validate our approach, we conducted experiments on stock market and weather data; we compared the results with the results from our previous work. Our analysis of the results demonstrate that the algorithm proposed in this paper is successful and effective in detecting outliers in data from different domains, one financial and the other meteorological. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Graph-based approach for outlier detection in sequential data and its application on stock market and weather data", "paper_id": "WOS:000335275700007"}