{"auto_keywords": [{"score": 0.02802513587306942, "phrase": "ltr_doses"}, {"score": 0.0201185695573848, "phrase": "gtr"}, {"score": 0.0099310153204167, "phrase": "iit"}, {"score": 0.008213881235875567, "phrase": "over-ride_doses"}, {"score": 0.006944056579845881, "phrase": "recommended_doses"}, {"score": 0.00481495049065317, "phrase": "computer-based_intensive_insulin_therapy_protocol_performance"}, {"score": 0.004605434064238641, "phrase": "clinical_decision_support_system"}, {"score": 0.004576253583505456, "phrase": "cuss"}, {"score": 0.0045328270272981825, "phrase": "intensive_insulin_therapy"}, {"score": 0.004461359547152617, "phrase": "critical_care_units"}, {"score": 0.00443308765153716, "phrase": "design_retrospective_analysis"}, {"score": 0.004404994123834589, "phrase": "patient_database_records"}, {"score": 0.004377077848734575, "phrase": "ethnographic_study"}, {"score": 0.004321772629297024, "phrase": "iit_cuss._measurements"}, {"score": 0.0036167509502276294, "phrase": "nurse_users"}, {"score": 0.0034372490762640236, "phrase": "ltr"}, {"score": 0.003245900020944865, "phrase": "gtr_doses"}, {"score": 0.00267301171407926, "phrase": "patients'_insulin_requirements"}, {"score": 0.0025892330566358503, "phrase": "iit_cdss"}, {"score": 0.0024606011870678493, "phrase": "iit_cuss_recommendations"}, {"score": 0.0023458049872325214, "phrase": "hyperglycemia_control"}, {"score": 0.0023161220226729285, "phrase": "bg"}, {"score": 0.002222149081895309, "phrase": "recommended_insulin_dose"}, {"score": 0.0021662300249670483, "phrase": "insulin_resistance"}, {"score": 0.0021049977753042253, "phrase": "iit_coss_protocol_performance"}], "paper_keywords": [""], "paper_abstract": "Objective To determine characteristics and effects of nurse dosing over-rides of a clinical decision support system (CUSS) for intensive insulin therapy (IIT) in critical care units. Design Retrospective analysis of patient database records and ethnographic study of nurses using IIT CUSS. Measurements The authors determined the frequency, direction greater than recommended (GTR) and less than recommended (LTR)-and magnitude of overrides, and then compared recommended and over-ride doses' blood glucose (BG) variability and insulin resistance, two measures of IIT CDSS associated with mortality. The authors hypothesized that rates of hypoglycemia and hyperglycemia would be greater for recommended than over-ride doses. Finally, the authors observed and interviewed nurse users. Results 5.1% (9075) of 179 452 IIT CDSS doses were over-rides. 83.4% of over-ride doses were LTR, and 45.5% of these were >= 50% lower than recommended. In contrast, 78.9% of GTR doses were <= 25% higher than recommended. When recommended doses were administered, the rate of hypoglycemia was higher than the rate for GTR (p=0.257) and LTR (p=0.033) doses. When recommended doses were administered, the rate of hyperglycemia was lower than the rate for GTR (p=0.003) and LTR (p<0.001) doses. Estimates of patients' insulin requirements were higher for LTR doses than recommended and GTR doses. Nurses reported trusting IIT CDSS overall but appeared concerned about recommendations when administering LTR doses. Conclusion When over-riding IIT CUSS recommendations, nurses overwhelmingly administered LTR doses, which emphasized prevention of hypoglycemia but interfered with hyperglycemia control, especially when BG was >150 mg/dl. Nurses appeared to consider the amount of a recommended insulin dose, not a patient's trend of insulin resistance, when administering LTR doses overall. Over-rides affected IIT COSS protocol performance.", "paper_title": "Characteristics and effects of nurse dosing over-rides on computer-based intensive insulin therapy protocol performance", "paper_id": "WOS:000289960600007"}