{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "development_practices"}, {"score": 0.04972395969484311, "phrase": "large-scale_it_projects"}, {"score": 0.013688869697581162, "phrase": "large-scale_it_project"}, {"score": 0.0076028232031210615, "phrase": "organizational_control_mechanisms"}, {"score": 0.004726184966910756, "phrase": "trust-mediated_organizational_controls"}, {"score": 0.004502943680955863, "phrase": "multiple_case_studies"}, {"score": 0.004087469540575263, "phrase": "useful_theoretical_constructs"}, {"score": 0.0037658881407605445, "phrase": "contingent_view"}, {"score": 0.0036281710561308377, "phrase": "development_processes"}, {"score": 0.0032083351151314405, "phrase": "unpredictable_nature"}, {"score": 0.003137377828938824, "phrase": "trust_level"}, {"score": 0.00269263690712392, "phrase": "trust-mediated_organizational_control_mechanisms"}, {"score": 0.002603758927691463, "phrase": "development_practice"}, {"score": 0.002443784721651744, "phrase": "agile_is_development_practices"}, {"score": 0.0023807981747706376, "phrase": "research_perspective"}, {"score": 0.002234491924392104, "phrase": "contingency_view"}, {"score": 0.0021049977753042253, "phrase": "underpinning_theoretical_perspective"}], "paper_keywords": ["Project Management", " Organizational Control", " Trust", " Agile ISD practice", " ISD Agility", " Case Study"], "paper_abstract": "This paper is based on multiple case studies on the construction of the Beijing Capital International Airport Terminal 3 in preparation for the 2008 Olympic Games that investigated the processes of instilling agile IS development practices in large-scale IT projects. This study develops useful theoretical constructs that will help researchers and practitioners who wish to learn about agile IS development practices as developed in large-scale IT projects. Adopting a contingent view, we uncover four factors that are critical in this development processes, namely: project uncertainty profile and project completion urgency; IT project team capabilities; organizational control mechanisms; and trust relationships among the IT project team, the vendors, and the users. Depending on the unpredictable nature of the project and the trust level among the IT project team, the vendors, and the users, we have uncovered the IT project team capabilities and the organizational control mechanisms that are needed to assure the success of a large-scale IT project. We posit that the interplay between the IT project team capabilities and the trust-mediated organizational control mechanisms forms the theoretical basis that defines agile IS development practice in large-scale IT projects. We argue that our findings provide insights to practitioners who are attempting to introduce agile IS development practices into any large-scale IT project. From a research perspective, the theory developed in this paper also sheds light on the importance of adopting a contingency view when researching agile IS development practices in a large-scale IT project and the factors to consider. This underpinning theoretical perspective will aid in the design of all future researches.", "paper_title": "Developing the Agile IS Development Practices in Large-Scale IT Projects: The Trust-Mediated Organizational Controls and IT Project Team Capabilities Perspectives", "paper_id": "WOS:000329857700002"}