{"auto_keywords": [{"score": 0.049217710328296, "phrase": "binding_modes"}, {"score": 0.00481495049065317, "phrase": "binding_free_energy_calculations"}, {"score": 0.004539005582217305, "phrase": "molecular_docking"}, {"score": 0.0041827333568982055, "phrase": "considerable_efforts"}, {"score": 0.003907212558276185, "phrase": "protein's_structural_flexibility"}, {"score": 0.0038368442918503072, "phrase": "scoring_functions"}, {"score": 0.0037506567448470163, "phrase": "integrated_approach"}, {"score": 0.003600351201298387, "phrase": "binding_mode"}, {"score": 0.0035677736570659813, "phrase": "affinity_prediction"}, {"score": 0.0034092396400930446, "phrase": "initial_candidate_models"}, {"score": 0.00330246222643051, "phrase": "equilibration_md_simulations"}, {"score": 0.00297454367746853, "phrase": "near-native_ligand_conformation"}, {"score": 0.002934237411711622, "phrase": "calculated_binding_free_energies"}, {"score": 0.0028293966058473476, "phrase": "experimental_measurements"}, {"score": 0.002548331088496964, "phrase": "docking_scores"}, {"score": 0.002391067964886602, "phrase": "lower_flexibility"}, {"score": 0.0022847009758393405, "phrase": "detailed_information"}, {"score": 0.0022537212268979507, "phrase": "different_energetic_contributions"}, {"score": 0.0021731423856364003, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "protein-ligand_interactions"}], "paper_keywords": [""], "paper_abstract": "Molecular docking is widely used to obtain binding modes and binding affinities of a molecule to a given target protein. Despite considerable efforts, however, prediction of both properties by docking remains challenging mainly due to protein's structural flexibility and inaccuracy of scoring functions. Here, an integrated approach has been developed to improve the accuracy of binding mode and affinity prediction and tested for small molecule MDM2 and MDMX antagonists. In this approach, initial candidate models selected from docking are subjected to equilibration MD simulations to further filter the models. Free energy perturbation molecular dynamics (FEP/MD) simulations are then applied to the filtered ligand models to enhance the ability in predicting the near-native ligand conformation. The calculated binding free energies for MDM2 complexes are overestimated compared to experimental measurements mainly due to the difficulties in sampling highly flexible apo-MDM2. Nonetheless, the FEP/MD binding free energy calculations are more promising for discriminating binders from nonbinders than docking scores. In particular, the comparison between the MDM2 and MDMX results suggests that apo-MDMX has lower flexibility than apo-MDM2. In addition, the FEP/MD calculations provide detailed information on the different energetic contributions to ligand binding, leading to a better understanding of the sensitivity and specificity of protein-ligand interactions.", "paper_title": "Application of Binding Free Energy Calculations to Prediction of Binding Modes and Affinities of MDM2 and MDMX Inhibitors", "paper_id": "WOS:000306613900012"}