{"auto_keywords": [{"score": 0.0463254570026972, "phrase": "agricultural_products"}, {"score": 0.01118527927177408, "phrase": "efficient_storage"}, {"score": 0.00481495049065317, "phrase": "agricultural_product_supply_chain_management"}, {"score": 0.004310949776826717, "phrase": "continuous_monitoring"}, {"score": 0.004090901264701185, "phrase": "iot_technologies"}, {"score": 0.003792657064634775, "phrase": "resulting_benefits"}, {"score": 0.0036411406244705557, "phrase": "unique_identification"}, {"score": 0.0034551632687788857, "phrase": "name_service"}, {"score": 0.00278497898719426, "phrase": "five_times_faster_response"}, {"score": 0.0026119782818898193, "phrase": "five_cities"}, {"score": 0.0021049977753042253, "phrase": "cooperation_and_supply_chain_improvements"}], "paper_keywords": [""], "paper_abstract": "Internet of Things (IoT) technologies have a great potential to improve the safety and quality of agricultural products. By providing near continuous monitoring from planting through harvesting and to our homes, IoT technologies are able to provide farm to fork visibility with all of the resulting benefits that accrue from that visibility. Unique identification provides the foundation of these benefits with a name service enabling efficient storage and retrieval of the data associated with each identifier. In this work, we present iotNS, a simple, efficient enterprise-oriented name service designed for agricultural products. The iotNS provides five times faster response than the standard GS1 ONS system. The iotNS has been deployed across five cities to enable the efficient storage and retrieval of information about agricultural products as they are tracked from the farm to the market. The deployment has shown that the visibility provided by iotNS is a mechanism that fosters cooperation and supply chain improvements among the enterprises using the iotNS.", "paper_title": "Enterprise-Oriented IoT Name Service for Agricultural Product Supply Chain Management", "paper_id": "WOS:000361196500001"}