{"auto_keywords": [{"score": 0.04798652790106826, "phrase": "probabilistic_data_propagation_algorithm"}, {"score": 0.015207400249494126, "phrase": "optimal_parameters"}, {"score": 0.01428415192522294, "phrase": "previous_work"}, {"score": 0.008713768692145006, "phrase": "wireless_sensor_networks"}, {"score": 0.007429127282467483, "phrase": "energy_consumption"}, {"score": 0.006974757019826705, "phrase": "energy_balance"}, {"score": 0.006745491745681491, "phrase": "centralized_algorithm"}, {"score": 0.0041642891310893, "phrase": "adequate_parameters"}, {"score": 0.0038798015183611275, "phrase": "general_case"}, {"score": 0.0031490944606172152, "phrase": "formal_definition"}, {"score": 0.0031140747752837826, "phrase": "optimal_data_propagation_algorithm"}, {"score": 0.0029228387900175554, "phrase": "simple_necessary_and_sufficient_condition"}, {"score": 0.0028903278985330117, "phrase": "data_propagation_algorithm"}, {"score": 0.002285075675790214, "phrase": "spreading_technique"}, {"score": 0.0021049977753042253, "phrase": "data_monitoring_task"}], "paper_keywords": ["wireless sensor networks", " ad-hoc networks", " energy-balancing", " data propagation algorithm", " lifespan maximization"], "paper_abstract": "We propose an algorithm to compute the optimal parameters of a probabilistic data propagation algorithm for wireless sensor networks (WSN). The probabilistic data propagation algorithm we consider was introduced in previous work, and it is known that this algorithm, when used with adequate parameters, balances the energy consumption and increases the lifespan of the WSN. However, we show that in the general case achieving energy balance may not be possible. We propose a centralized algorithm to compute the optimal parameters of the probabilistic data propagation algorithm, and prove that these parameters maximize the lifespan of the network even when it is not possible to achieve energy balance. Compared to previous work, our contribution is the following: (a) we give a formal definition of an optimal data propagation algorithm: an algorithm maximizing the lifespan of the network. (b) We find a simple necessary and sufficient condition for the data propagation algorithm to be optimal. (c) We constructively prove that there exists a choice of parameters optimizing the probabilistic data propagation algorithm. (d) We provide a centralized algorithm to compute these optimal parameters, thus enabling their use in a WSN. (e) We extend previous work by considering the energy consumption per sensor, instead of the consumption per slice, and propose a spreading technique to balance the energy among sensors of a same slice. The technique is numerically validated by simulating a WSN accomplishing a data monitoring task and propagating data using the probabilistic data propagation algorithm with optimal parameters. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Energy optimal data propagation in wireless sensor networks", "paper_id": "WOS:000244502700004"}