{"auto_keywords": [{"score": 0.04804050199975016, "phrase": "classical_set_theory"}, {"score": 0.04617751542363486, "phrase": "fuzzy_sets"}, {"score": 0.03300566890749799, "phrase": "natural_world"}, {"score": 0.01317556179674772, "phrase": "zadeh's_fuzzy_set_system"}, {"score": 0.010300920979742731, "phrase": "fuzzy_phenomenon"}, {"score": 0.008368433997890347, "phrase": "set_complement"}, {"score": 0.00481495049065317, "phrase": "new_fuzzy_set_theory"}, {"score": 0.004640229780905613, "phrase": "particular_case"}, {"score": 0.0044718206943536514, "phrase": "c-fuzzy_set_system"}, {"score": 0.004072515283467792, "phrase": "z-fuzzy_set_systems"}, {"score": 0.0031845067058084583, "phrase": "fuzzy_set's_ability"}, {"score": 0.0031568884810273226, "phrase": "different_kinds"}, {"score": 0.0030487828775502563, "phrase": "invent_unnatural_functions"}, {"score": 0.0027822459052173113, "phrase": "inclusive_case"}, {"score": 0.002629026692001082, "phrase": "possible_set_relationships"}, {"score": 0.002462664392109308, "phrase": "zadeh's_fuzzy_set"}, {"score": 0.0023320807262613014, "phrase": "classical_and_normal_thinking"}, {"score": 0.002291770932613859, "phrase": "c-fuzzy_set_theory"}], "paper_keywords": ["fuzzy set", " Zadeh's fuzzy set", " classical set", " C-fuzzy set"], "paper_abstract": "A new fuzzy set theory, C-fuzzy set theory, is introduced in this paper. It is a particular case of the classical set theory and satisfies all formulas of the classical set theory. To add a limitation to C-fuzzy set system, in which all fuzzy sets must be \"non-uniform inclusive\" to each other, then it forms a family of sub-systems, the Z-fuzzy set family. It can be proved that the Z(0)-fuzzy set system, one of Z-fuzzy set systems, is equivalent to Zadeh's fuzzy set system. Analysis shows that 1) Zadeh's fuzzy set system defines the relations A = B and A subset of B between two fuzzy sets A and B as \"for all u is an element of U, (mu(A) is an element of (u) = mu(B)(u))\" and \"for all u is an element of U, (mu(A)(u) <= mu(B)(u))\" respectively is inappropriate, because it makes all fuzzy sets be \"non-uniformly inclusive\"; 2) it is also inappropriate to define two fuzzy sets' union and intersection operations as the max and min of their grades of membership, because this prevents fuzzy set's ability to correctly reflect different kinds of fuzzy phenomenon in the natural world. Then it has to work around the problem by invent unnatural functions that are hard to understand, such as augmenting max and min for union and intersection to min {a + b, 1} and max{a + b - 1, 0}, but these functions are incorrect on inclusive case. If both pairs of definitions are used together, not only are they unnatural, but also they are still unable to cover all possible set relationships in the natural world; and 3) it is incorrect to define the set complement as 1 - mu(A)(u), because it can be proved that set complement cannot exist in Zadeh's fuzzy set, and it causes confusion in logic and thinking. And it is seriously mistaken to believe that logics of fuzzy sets necessarily go against classical and normal thinking, logic, and conception. The C-fuzzy set theory proposed in this paper overcomes all of the above errors and shortcomings, and more reasonably reflects fuzzy phenomenon in the natural world. It satisfies all relations, formulas, and operations of the classical set theory. It is consistent with normal, natural, and classical thinking, logic, and concepts.", "paper_title": "A New Fuzzy Set Theory Satisfying All Classical Set Formulas", "paper_id": "WOS:000268249500017"}