{"auto_keywords": [{"score": 0.029531825333461947, "phrase": "seed-order_selection_rules"}, {"score": 0.013436624465481769, "phrase": "accompanying-order_selection_rules"}, {"score": 0.010612387000973441, "phrase": "order-picking_warehouse"}, {"score": 0.009977239227202913, "phrase": "travel_distance"}, {"score": 0.005919532395475053, "phrase": "route-planning_methods"}, {"score": 0.005873841013806575, "phrase": "aisle-picking-frequency_distributions"}, {"score": 0.004740823885631586, "phrase": "order_batching"}, {"score": 0.004319322238010043, "phrase": "order-batching_methods"}, {"score": 0.003919900973086169, "phrase": "eleven_seed-order_selection_rules"}, {"score": 0.0033170847930578473, "phrase": "comparison_purpose"}, {"score": 0.0032786537599187125, "phrase": "previous_studies"}, {"score": 0.003178326919668771, "phrase": "location-based_rules"}, {"score": 0.002850682396853918, "phrase": "study's_objective"}, {"score": 0.0024592402228499105, "phrase": "newly_proposed_rules"}, {"score": 0.0023471384232499016, "phrase": "accompanying_order_selection_rules"}, {"score": 0.002310915790114425, "phrase": "other's_performance"}, {"score": 0.0022664208122072657, "phrase": "performance_rankings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Order batching", " Order picking", " Seed-order selection", " Accompanying-order selection"], "paper_abstract": "Order batching is one of the methods used in warehouses to minimize the travel distance of pickers. In this paper, we focus on developing order-batching methods for an order-picking warehouse with two cross aisles and ail I/O point at one of its corners. Each of these methods is made up of one seed-order selection rule and one accompanying-order selection rule. Eleven seed-order selection rules and 14 accompanying-order selection rules are studied here. These rules include those newly proposed by us and those by others. Rules proposed by others have been shown to perform well in minimizing the travel distance of pickers. They are included here for the comparison purpose. Unlike previous studies that only focus on developing aisle or location-based rules, this study also develops rules that are distance- or area-based. In addition, two different route-planning methods and two different aisle-picking-frequency distributions are considered in this paper. This study's objective is to investigate not only the performance of seed-order selection rules and accompanying-order selection rules, but also the mutual effects between route-planning methods, aisle-picking-frequency distributions, seed-order selection rules, and accompanying-order selection rules on their performance. The result of this study shows that some of the newly proposed rules outperform those from other studies. It also shows that seed-order selection rules and accompanying order selection rules significantly affect each other's performance. Lastly, the performance rankings of seed-order selection rules and accompanying-order selection rules are affected by aisle-picking-frequency distributions, but not by route-planning methods. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Order-batching methods for an order-picking warehouse with two cross aisles", "paper_id": "WOS:000259898700004"}