{"auto_keywords": [{"score": 0.042009667892340924, "phrase": "gridcast"}, {"score": 0.02995357857002204, "phrase": "mvc"}, {"score": 0.012057809442932287, "phrase": "peer_sharing"}, {"score": 0.007765975146288167, "phrase": "server_load"}, {"score": 0.007654163392546358, "phrase": "lazy_replication"}, {"score": 0.00475924837336259, "phrase": "compelling_application"}, {"score": 0.004556018017257075, "phrase": "video_source_servers"}, {"score": 0.003859500298805362, "phrase": "cernet"}, {"score": 0.0036517603093148884, "phrase": "system_scalability"}, {"score": 0.003505852877805438, "phrase": "first_deployment"}, {"score": 0.0032312384727026747, "phrase": "single_video_caching"}, {"score": 0.003156791656819646, "phrase": "source_servers"}, {"score": 0.003084054767389711, "phrase": "client-server_architecture"}, {"score": 0.003039445153076014, "phrase": "net_effect"}, {"score": 0.003021781956684419, "phrase": "system_resources"}, {"score": 0.0029867619862229853, "phrase": "peer_upload"}, {"score": 0.0028925295982470418, "phrase": "caching_algorithm"}, {"score": 0.002867348342846275, "phrase": "multiple_videos"}, {"score": 0.0028094389072212352, "phrase": "source_load"}, {"score": 0.0026892447164623247, "phrase": "user_load_increases"}, {"score": 0.0026272523687965615, "phrase": "larger_scales"}, {"score": 0.0026043744834099306, "phrase": "detailed_analysis"}, {"score": 0.002536926192232391, "phrase": "major_issue"}, {"score": 0.0025002107252808966, "phrase": "caching_optimization"}, {"score": 0.0023932142697579506, "phrase": "departure_misses"}, {"score": 0.0021991369769963545, "phrase": "working_replication_algorithm"}], "paper_keywords": ["Design", " Measurement", " Performance", " Video-on-demand", " peer-to-peer", " caching", " replication"], "paper_abstract": "Video-on-Demand (VoD) is a compelling application, but costly. VoD is costly due to the load it places on video source servers. Many have proposed using peer-to-peer (P2P) techniques to shift load from servers to peers. Yet, nobody has implemented and deployed a system to openly and systematically evaluate how these techniques work. This article describes the design, implementation and evaluation of GridCast, a real deployed P2P VoD system. GridCast has been live on CERNET since May of 2006. It provides seek, pause, and play operations, and employs peer sharing to improve system scalability. In peak months, GridCast has served videos to 23,000 unique users. From the first deployment, we have gathered information to understand the system and evaluate how to further improve peer sharing through caching and replication. We first show that GridCast with single video caching (SVC) can decrease load on source servers by an average of 22% from a client-server architecture. We analyze the net effect on system resources and determine that peer upload is largely idle. This leads us to changing the caching algorithm to cache multiple videos (MVC). MVC decreases source load by an average of 51% over the client-server. The improvement is greater as user load increases. This bodes well for peer-assistance at larger scales. A detailed analysis of MVC shows that departure misses become a major issue in a P2P VoD system with caching optimization. Motivated by this observation, we examine how to use replication to eliminate departure misses and further reduce server load. A framework for lazy replication is presented and evaluated in this article. In this framework, two predictors are plugged in to create the working replication algorithm. With these two simple predictors, lazy replication can decrease server load by 15% from MVC with only a minor increase in network traffic.", "paper_title": "GridCast: Improving Peer Sharing for P2P VoD", "paper_id": "WOS:000261155300003"}