{"auto_keywords": [{"score": 0.04958309506789283, "phrase": "social_web"}, {"score": 0.010612387000973441, "phrase": "public_libraries"}, {"score": 0.00896009882826478, "phrase": "future_research"}, {"score": 0.004507594400447103, "phrase": "general_tendencies"}, {"score": 0.004278807087784626, "phrase": "new_facet"}, {"score": 0.004249188865832993, "phrase": "public_librarianship"}, {"score": 0.0037107679833206773, "phrase": "open_access_journals"}, {"score": 0.00367228341822469, "phrase": "selection_process"}, {"score": 0.003534544738350291, "phrase": "two-stage_analysis"}, {"score": 0.003401954670986958, "phrase": "stated_aims"}, {"score": 0.003378385493203297, "phrase": "research_questions"}, {"score": 0.003229103141223776, "phrase": "shared_theme"}, {"score": 0.003086396772496527, "phrase": "research_directions"}, {"score": 0.0030226700832113942, "phrase": "wide_range"}, {"score": 0.0028890603352364273, "phrase": "library_and_information_science"}, {"score": 0.00266693888510356, "phrase": "broader_political_economic_conditions"}, {"score": 0.002639251247218711, "phrase": "public_library_institution"}, {"score": 0.0026209522797963447, "phrase": "late_modernity"}, {"score": 0.002505054869094183, "phrase": "professional_expertise"}, {"score": 0.0023043558058824572, "phrase": "library_professionals"}, {"score": 0.0022255425106527727, "phrase": "social_web_calls"}, {"score": 0.002164432930854161, "phrase": "ongoing_development"}, {"score": 0.002149418970824546, "phrase": "public_library_services"}, {"score": 0.0021049977753042253, "phrase": "preliminary_overview"}], "paper_keywords": ["Public libraries", " Librarians", " Social web", " Library 2.0"], "paper_abstract": "Purpose - The purpose of this paper is to sketch out the general tendencies, gaps and opportunities within the body of research studying the social web as a new facet of public librarianship in order to delineate the findings so far and suggest directions for future research. Design/methodology/approach - Literature searches were conducted through the Library, Information Science and Technology Abstract database, The ISI Web of Science database and the Directory of Open Access Journals. A selection process in two steps resulted in 44 articles that were subjected to a two-stage analysis and coding process: a coding analysis based on the stated aims or research questions of each article and analysis of the articles as clusters around a shared theme. Findings - The articles, exhibiting a richness and diversity in research directions, are dispersed in a wide range of journals and the topics addressed cover a variety of segments within Library and Information Science. Despite this diversity, research exploring the consequences of the social web for public libraries in situ and considerations of research on the broader political economic conditions of the public library institution in late modernity is largely lacking. Furthermore, the status of librarianship and the professional expertise of librarians, in light of the social web, need to be further addressed. Originality/value - The rising interest and investment of library professionals into the practices, principles and technologies of the social web calls for further studies into the consequences of this ongoing development for public library services. This paper gives a preliminary overview of the research done 2006-2012 and identifies gaps in the literature that may serve as a point of departure for future research.", "paper_title": "Researching public libraries and the social web, 2006-2012", "paper_id": "WOS:000359056200002"}