{"auto_keywords": [{"score": 0.0047602693158272655, "phrase": "research_and_diagnosis_purposes"}, {"score": 0.004547656324173302, "phrase": "local_applications"}, {"score": 0.004361077072629878, "phrase": "specific_machine"}, {"score": 0.004041155193307942, "phrase": "processing_power"}, {"score": 0.0038166522763373434, "phrase": "web-based_tools"}, {"score": 0.003673930454794753, "phrase": "medical_image_processing_functionalities"}, {"score": 0.0032519989404960073, "phrase": "algorithm_layer"}, {"score": 0.0029789104204803137, "phrase": "current_local_medical_image_processing_software"}, {"score": 0.0028565082986974602, "phrase": "wide_range"}, {"score": 0.0028347983387988847, "phrase": "medical_image_preprocessing"}, {"score": 0.0027812405653371503, "phrase": "segmentation_methods"}, {"score": 0.002739121808942775, "phrase": "open_source_libraries"}, {"score": 0.002718301574682098, "phrase": "desktop-like_user_interaction"}, {"score": 0.00266693888510356, "phrase": "ajax_technology"}, {"score": 0.002596653214530156, "phrase": "visualization_functionality"}, {"score": 0.002537880772794665, "phrase": "vrml_standard"}, {"score": 0.0023157656212149367, "phrase": "powerful_computational_resources"}, {"score": 0.0022894012453842064, "phrase": "client_side"}, {"score": 0.002186904773823281, "phrase": "appropriate_parameters"}, {"score": 0.0021702728407945976, "phrase": "practical_research"}, {"score": 0.002153767124561527, "phrase": "clinical_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Web-based software tools", " 2D and 3D processing and visualization", " Medical imaging and analysis"], "paper_abstract": "There are many medical image processing software tools available for research and diagnosis purposes. However, most of these tools are available only as local applications. This limits the accessibility of the software to a specific machine, and thus the data and processing power of that application are not available to other workstations. Further, there are operating system and processing power limitations which prevent such applications from running on every type of workstation. By developing web-based tools, it is possible for users to access the medical image processing functionalities wherever the internet is available. In this paper, we introduce a pure web-based, interactive, extendable, 2D and 3D medical image processing and visualization application that requires no client installation. Our software uses a four-layered design consisting of an algorithm layer, web-user-interface layer, server communication layer, and wrapper layer. To compete with extendibility of the current local medical image processing software, each layer is highly independent of other layers. A wide range of medical image preprocessing, registration, and segmentation methods are implemented using open source libraries. Desktop-like user interaction is provided by using AJAX technology in the web-user-interface. For the visualization functionality of the software, the VRML standard is used to provide 3D features over the web. Integration of these technologies has allowed implementation of our purely web-based software with high functionality without requiring powerful computational resources in the client side. The user-interface is designed such that the users can select appropriate parameters for practical research and clinical studies. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Web-based interactive 2D/3D medical image processing and visualization software", "paper_id": "WOS:000277863600007"}