{"auto_keywords": [{"score": 0.03291721668032437, "phrase": "informal_learning_activities"}, {"score": 0.009945187315850566, "phrase": "cloud_services"}, {"score": 0.00481495049065317, "phrase": "cloud_ecosystem"}, {"score": 0.00465634671242413, "phrase": "human_activities"}, {"score": 0.0044695432851061525, "phrase": "information_and_communication_technologies"}, {"score": 0.004306205029641728, "phrase": "daily_life"}, {"score": 0.004179824713643488, "phrase": "educational_activities"}, {"score": 0.003865376734263166, "phrase": "formal_certification"}, {"score": 0.003737934295442975, "phrase": "informal_learning"}, {"score": 0.0034566143156030426, "phrase": "present_new_ways"}, {"score": 0.003405472159599445, "phrase": "individual's_learning"}, {"score": 0.0033801845720347118, "phrase": "cloud_technologies"}, {"score": 0.003293142761521425, "phrase": "new_architectures"}, {"score": 0.0031963987773420068, "phrase": "semantic_tagging"}, {"score": 0.0029447150254434842, "phrase": "existing_knowledge"}, {"score": 0.0028903278985330117, "phrase": "trailer_project"}, {"score": 0.002815864555488112, "phrase": "technological_framework"}, {"score": 0.0025366596616434793, "phrase": "social_software"}, {"score": 0.002499094513009327, "phrase": "computer_gaming"}, {"score": 0.00247128526955136, "phrase": "remote_laboratory_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Informal learning recognition", " Cloud-based information systems", " Competence", " Integration", " TRAILER"], "paper_abstract": "Learning and teaching processes, like all human activities, can be mediated through the use of tools. Information and communication technologies are now widespread within education. Their use in the daily life of teachers and learners affords engagement with educational activities at any place and time and not necessarily linked to an institution or a certificate. In the absence of formal certification, learning under these circumstances is known as informal learning. Despite the lack of certification, learning with technology in this way presents opportunities to gather information about and present new ways of exploiting an individual's learning. Cloud technologies provide ways to achieve this through new architectures, methodologies, and workflows that facilitate semantic tagging, recognition, and acknowledgment of informal learning activities. The transparency and accessibility of cloud services mean that institutions and learners can exploit existing knowledge to their mutual benefit. The TRAILER project facilitates this aim by providing a technological framework using cloud services, a workflow, and a methodology. The services facilitate the exchange of information and knowledge associated with informal learning activities ranging from the use of social software through widgets, computer gaming, and remote laboratory experiments. Data from these activities are shared among institutions, learners, and workers. The project demonstrates the possibility of gathering information related to informal learning activities independently of the context or tools used to carry them out. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Informal learning recognition through a cloud ecosystem", "paper_id": "WOS:000331414700026"}