{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "breakout_process"}, {"score": 0.022651886494767133, "phrase": "seabed_surface"}, {"score": 0.008622362017094966, "phrase": "with-gap_stage"}, {"score": 0.00632371117852446, "phrase": "no-gap_stage"}, {"score": 0.004130376386308024, "phrase": "gap_stage"}, {"score": 0.0037287578312533596, "phrase": "numerical_model"}, {"score": 0.003239304090565123, "phrase": "whole_breakout_process"}, {"score": 0.0031440159350875057, "phrase": "present_numerical_model"}, {"score": 0.0030908254851076005, "phrase": "consolidation_problem"}, {"score": 0.0028992294924613327, "phrase": "numerical_solutions"}, {"score": 0.0027662954811372154, "phrase": "good_agreement"}, {"score": 0.0027311076665349657, "phrase": "existing_analytical_solutions"}, {"score": 0.0026282000779095987, "phrase": "fair_agreement"}, {"score": 0.0026058621464926826, "phrase": "available_experimental_results"}, {"score": 0.002572709810193776, "phrase": "parametric_studies"}, {"score": 0.0024863459251358217, "phrase": "breakout_time"}, {"score": 0.0023123057299992587, "phrase": "actual_breakout_time"}, {"score": 0.0022828795331819025, "phrase": "whole_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Breakout", " Numerical model", " Offshore engineering", " Suction"], "paper_abstract": "The breakout process of an object lying on the seabed surface can be separated into three stages in the following sequence: no-gap stage, transition stage and with-gap stage. The solutions reported in the literature presently consider only the no-gap stage or the with-gap stage in isolation but not the complete breakout process. In this paper, a numerical model has been developed to simulate the breakout process of a disk which initially rests on the surface of the porous, elastic saturated seabed. Though the mechanism involved in these three stages are somewhat different, the whole breakout process can be simulated naturally using the present numerical model by solving a consolidation problem of the seabed subjected to various boundary conditions at the seabed surface below the disk. The numerical solutions for the no-gap stage and the with-gap stage are in good agreement with the existing analytical solutions. The solutions for the breakout process are in fair agreement with available experimental results. The parametric studies show that while under many conditions, the breakout time is dominated by the with-gap stage, under certain conditions the with-gap solution will under estimate the actual breakout time for the whole process. There could also be situations where the solution for the no-gap stage dominates. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Numerical modeling of breakout process of objects lying on the seabed surface", "paper_id": "WOS:000260281200004"}