{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "nursing_performance"}, {"score": 0.011596352339810746, "phrase": "communication_technology"}, {"score": 0.004172874316207784, "phrase": "practical_skills"}, {"score": 0.004058826900076531, "phrase": "six-dimension_scale"}, {"score": 0.003966202922235291, "phrase": "cell_phones"}, {"score": 0.0036665842836420223, "phrase": "two-way_analysis"}, {"score": 0.003468796799802612, "phrase": "nursing_experience"}, {"score": 0.003177154457204775, "phrase": "high_technological_skills"}, {"score": 0.0031479142819948007, "phrase": "greater_nursing_ability"}, {"score": 0.0030759821501544224, "phrase": "low_skills"}, {"score": 0.002896535621940078, "phrase": "former_group"}, {"score": 0.0028172726995962173, "phrase": "latter_group"}, {"score": 0.0027784560880013886, "phrase": "information_and_communication_technology_use"}, {"score": 0.0022355167967736326, "phrase": "informatics_education"}, {"score": 0.0021049977753042253, "phrase": "information_use"}], "paper_keywords": ["Information and communication technology", " Nursing informatics", " Nursing performance", " Six-dimension scale of nursing performance"], "paper_abstract": "The aim of this study was to investigate the influence of information and communication technology use and skills on nursing performance. Questionnaires were prepared relating to using the technology, practical skills in utilizing information, the Six-Dimension Scale of Nursing Performance, and demographics. In all, 556 nurses took part (response rate, 72.6%). A two-way analysis of variance was used to determine the influence of years of nursing experience on the relationship between nursing performance and information and communication technology use. The results showed that the group possessing high technological skills had greater nursing ability than the group with low skills; the level of nursing performance improved with years of experience in the former group, but not in the latter group. Regarding information and communication technology use, the results showed that nursing performance improved among participants who used computers for sending and receiving e-mails, but it decreased for those who used cell phones for e-mail. The results suggest that nursing performance may be negatively affected if information and communication technology are inappropriately used. Informatics education should therefore be provided for all nurses, and it should include information use relating to cell phones and computers.", "paper_title": "Effect of Information and Communication Technology on Nursing Performance", "paper_id": "WOS:000319436900007"}