{"auto_keywords": [{"score": 0.0307997635923216, "phrase": "equilibrium_models"}, {"score": 0.015719716506582538, "phrase": "equilibrium_logic"}, {"score": 0.009846178798521742, "phrase": "denotational_semantics"}, {"score": 0.0046621835537196754, "phrase": "alternative_semantics"}, {"score": 0.0038417798012011155, "phrase": "three-valued_logic"}, {"score": 0.003765067028482197, "phrase": "starting_point"}, {"score": 0.003616189733352126, "phrase": "minimal_elements"}, {"score": 0.0034452601929727752, "phrase": "structural_properties"}, {"score": 0.003308986613384597, "phrase": "expressiveness_results"}, {"score": 0.002838387600282891, "phrase": "simple_and_compact_set_expression"}, {"score": 0.0027150658583211746, "phrase": "entailment_relations"}, {"score": 0.0025866199378466754, "phrase": "new_one"}, {"score": 0.0022914054720704546, "phrase": "context_gamma"}, {"score": 0.002218526133566788, "phrase": "strong_entailment"}, {"score": 0.0021049977753042253, "phrase": "sufficient_condition"}], "paper_keywords": ["Answer Set Programming", " Equilibrium Logic"], "paper_abstract": "In this paper we provide an alternative semantics for Equilibrium Logic and its monotonic basis, the logic of Here-and-There (also known as Godel's G(3) logic) that relies on the idea of denotation of a formula, that is, a function that collects the set of models of that formula. Using the three-valued logic G(3) as a starting point and an ordering relation (for which equilibrium/stable models are minimal elements) we provide several elementary operations for sets of interpretations. By analysing structural properties of the denotation of formulas, we show some expressiveness results for G(3) such as, for instance, that conjunction is not expressible in terms of the other connectives. Moreover, the denotational semantics allows us to capture the set of equilibrium models of a formula with a simple and compact set expression. We also use this semantics to provide several formal definitions for entailment relations that are usual in the literature, and further introduce a new one called strong entailment. We say that alpha strongly entails beta when the equilibrium models of alpha boolean AND gamma are also equilibrium models of beta boolean AND gamma for any context gamma. We also provide a characterisation of strong entailment in terms of the denotational semantics, and give an example of a sufficient condition that can be applied in some cases.", "paper_title": "A denotational semantics for equilibrium logic", "paper_id": "WOS:000367692200015"}