{"auto_keywords": [{"score": 0.04925653227018551, "phrase": "suspended_cut-off_walls"}, {"score": 0.04844733919048294, "phrase": "regional_seepage_field"}, {"score": 0.008728127239496987, "phrase": "hydraulic_head_loss"}, {"score": 0.008578732674504654, "phrase": "vertical_flow"}, {"score": 0.007514552551293342, "phrase": "zero-thickness_element"}, {"score": 0.00481495049065317, "phrase": "zero-thickness_elements"}, {"score": 0.004167218012926657, "phrase": "dupuit_assumption"}, {"score": 0.002945175711537758, "phrase": "matrix_equation"}, {"score": 0.0027795345823932406, "phrase": "resistance_coefficient_method"}, {"score": 0.00273167822885383, "phrase": "analytical_solution"}, {"score": 0.0022960713730673494, "phrase": "hydraulic_head"}, {"score": 0.0022176487309947266, "phrase": "effective_way"}, {"score": 0.0021668575137633317, "phrase": "suspended_cutoff_wall"}], "paper_keywords": ["regional groundwater", " seepage", " suspended cut-off walls", " resistance coefficient method", " finite element method"], "paper_abstract": "A regional seepage field is usually simulated by 2D horizontal seepage finite element method (FEM). However, the Dupuit assumption means that it does not take into account hydraulic head loss caused by vertical flow. In order to simulate a regional seepage field containing suspended cut-off walls by 2D horizontal FEM without any loss of accuracy and efficiency, a zero-thickness element is introduced. The zero-thickness element is used to model suspended cut-off walls and take into account the hydraulic head loss caused by vertical flow near the walls. The matrix equation is deduced. The deduction is based on the resistance coefficient method and the analytical solution of flow near suspended cut-off walls under plane condition. The accuracy of the method is assessed by comparing with 3D FEM results. These coincide with each other both in discharge and hydraulic head. The method is an effective way to simulate a suspended cutoff wall in a regional seepage field with 2D horizontal FEM. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Using zero-thickness elements to simulate suspended cut-off walls in a regional seepage field", "paper_id": "WOS:000242756100003"}