{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiagent_simple_temporal_problems"}, {"score": 0.004666756595735701, "phrase": "foundational_algorithms"}, {"score": 0.004287008195370748, "phrase": "people's_cognitive_capacity"}, {"score": 0.00419229472352669, "phrase": "critical_challenge"}, {"score": 0.003902992784453769, "phrase": "scheduling_goals"}, {"score": 0.0038510053729959074, "phrase": "individual_privacy"}, {"score": 0.0036498637283470386, "phrase": "multiagent_simple_temporal_problem"}, {"score": 0.0035216195857272403, "phrase": "distributed_but_interconnected_scheduling_problems"}, {"score": 0.003382704886584695, "phrase": "bottom-up_and_top-down_approaches"}, {"score": 0.002931569771634119, "phrase": "new_local_constraints"}, {"score": 0.0027535633837592597, "phrase": "distributed_algorithms"}, {"score": 0.0026806139086152365, "phrase": "joint_solution_space"}, {"score": 0.0026567282965815823, "phrase": "multiagent_scheduling_problems"}, {"score": 0.0024953686545818587, "phrase": "concurrent_execution"}, {"score": 0.0024620842899061614, "phrase": "significant_speedup"}, {"score": 0.0024292428060702803, "phrase": "current_art"}, {"score": 0.0023125191783901367, "phrase": "individual_agent_reasoning"}, {"score": 0.0021049977753042253, "phrase": "agents'_individual_problems"}], "paper_keywords": [""], "paper_abstract": "This research focuses on building foundational algorithms for scheduling agents that assist people in managing their activities in environments where tempo and complex activity interdependencies outstrip people's cognitive capacity. We address the critical challenge of reasoning over individuals' interacting schedules to efficiently answer queries about how to meet scheduling goals while respecting individual privacy and autonomy to the extent possible. We formally define the Multiagent Simple Temporal Problem for naturally capturing and reasoning over the distributed but interconnected scheduling problems of multiple individuals. Our hypothesis is that combining bottom-up and top-down approaches will lead to effective solution techniques. In our bottom-up phase, an agent externalizes constraints that compactly summarize how its local subproblem affects other agents' subproblems, whereas in our top-down phase an agent proactively constructs and internalizes new local constraints that decouple its subproblem from others'. We confirm this hypothesis by devising distributed algorithms that calculate summaries of the joint solution space for multiagent scheduling problems, without centralizing or otherwise redistributing the problems. The distributed algorithms permit concurrent execution to achieve significant speedup over the current art and also increase the level of privacy and independence in individual agent reasoning. These algorithms are most advantageous for problems where interactions between the agents are sparse compared to the complexity of agents' individual problems.", "paper_title": "Distributed Reasoning for Multiagent Simple Temporal Problems", "paper_id": "WOS:000319496000001"}