{"auto_keywords": [{"score": 0.04796789568919049, "phrase": "clinical_decision_support_system"}, {"score": 0.007740489563401459, "phrase": "critical_review"}, {"score": 0.004654928974748418, "phrase": "clinical_decision_support_systems"}, {"score": 0.004483328889361545, "phrase": "evidence-based_practice"}, {"score": 0.004301834610818624, "phrase": "users'_adoption"}, {"score": 0.004112175423546628, "phrase": "theoretical_or_conceptual_frameworks"}, {"score": 0.0035514484574435574, "phrase": "social_theory"}, {"score": 0.0035248419365839856, "phrase": "longitudinal_theory"}, {"score": 0.003369322866499541, "phrase": "multiple_concepts"}, {"score": 0.0031965070898750912, "phrase": "nine_major_concepts"}, {"score": 0.0026483647033436674, "phrase": "information_system"}, {"score": 0.0025989960809479104, "phrase": "person_concepts"}, {"score": 0.0022696277881969896, "phrase": "different_facets"}, {"score": 0.002218933616777076, "phrase": "pluralistic_framework"}, {"score": 0.002128910637262527, "phrase": "overall_framework"}, {"score": 0.0021049977753042253, "phrase": "future_study"}], "paper_keywords": ["Adoption", " Clinical decision support system", " Concepts", " Framework"], "paper_abstract": "The clinical decision support system is utilized to translate knowledge into evidence-based practice in clinical settings. Many studies have been conducted to understand users' adoption of the clinical decision support system. A critical review was conducted to understand the theoretical or conceptual frameworks used to inform the studies on the adoption of the clinical decision support system. The review identified 15 theoretical and conceptual frameworks using multiple hybrids of theories and concepts. The Technology Acceptance Model was the most frequently used baseline framework combined with frameworks such as the diffusion of innovation, social theory, longitudinal theory, and so on. The results from these articles yielded multiple concepts influencing the adoption of the clinical decision support system. These concepts can be recategorized into nine major concepts, namely, the information system, person (user or patient), social, organization, perceived benefits, emotions, trustability, relevance (fitness), and professionalism. None of the studies found all the nine concepts. That said, most of them have identified the information system, organization, and person concepts as three of its concepts affecting the use of the clinical decision support system. Within each of the concepts, its subconcepts were noted to be very varied. Yet each of these subconcepts has significantly contributed toward the different facets of the concepts. A pluralistic framework was built using the concepts and subconcepts to provide an overall framework construct for future study on the adoption of the clinical decision support system.", "paper_title": "A Critical Review of the Theoretical Frameworks and the Conceptual Factors in the Adoption of Clinical Decision Support Systems", "paper_id": "WOS:000369888400007"}