{"auto_keywords": [{"score": 0.03801964087844912, "phrase": "clear_need"}, {"score": 0.00481495049065317, "phrase": "current_context"}, {"score": 0.004746295787970822, "phrase": "sound"}, {"score": 0.004454691230204595, "phrase": "open_issues"}, {"score": 0.004222707054751191, "phrase": "journal_issue"}, {"score": 0.003925633992809873, "phrase": "broad_smc_challenges"}, {"score": 0.003685067218455088, "phrase": "research_side"}, {"score": 0.0035616743422949766, "phrase": "better_sound_objects"}, {"score": 0.0033271045779740683, "phrase": "human_interaction"}, {"score": 0.003200045185608395, "phrase": "education_domain"}, {"score": 0.003107935254560724, "phrase": "better_training"}, {"score": 0.002931569771634119, "phrase": "multicultural_society"}, {"score": 0.0025578967205807843, "phrase": "smc_field"}, {"score": 0.002400944221804575, "phrase": "current_social_concerns"}, {"score": 0.0021780349459687622, "phrase": "policy_makers"}, {"score": 0.0021569129153653777, "phrase": "specific_actions"}, {"score": 0.0021049977753042253, "phrase": "proposed_smc_roadmap"}], "paper_keywords": [""], "paper_abstract": "Based on the current context of the Sound and Music Computing (SMC) field, the state of the art in research and the open issues that have been identified and described in other articles of this journal issue, in this article we make a step forward and try to identify the broad SMC challenges and we propose strategies with which to tackle them. On the research side we identify a clear need for designing better sound objects and environments and for promoting research to understand, model, and improve human interaction with sound and music. In the education domain we feel the need for better training our multidisciplinary researchers and to make sure that they can contribute to the multicultural society we live in. There is also a clear need for improving the transferring of the knowledge and technologies generated by our community. Finally we claim that the SMC field should be very much concerned with its social context and that a number of current social concerns should be addressed. We accompany each of these challenges with strategies that should help researchers, educators and policy makers take specific actions to advance in the proposed SMC roadmap.", "paper_title": "Sound and music computing: Challenges and strategies", "paper_id": "WOS:000254577900005"}