{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "suitable_tool"}, {"score": 0.004645057834614705, "phrase": "collaborative_learning"}, {"score": 0.004517055580214742, "phrase": "social_support"}, {"score": 0.004322967486451877, "phrase": "internship_activities"}, {"score": 0.003714195746979591, "phrase": "mixed-methods_design"}, {"score": 0.003640730820018083, "phrase": "quantitative_and_qualitative_data"}, {"score": 0.0035687137873965684, "phrase": "blogging_entries"}, {"score": 0.003294566092612857, "phrase": "others'_blog-writing"}, {"score": 0.0030904433394138963, "phrase": "knowledge_construction"}, {"score": 0.002957471572421436, "phrase": "positive_perceptions"}, {"score": 0.002898930717812433, "phrase": "discipline_background"}, {"score": 0.002818909613625567, "phrase": "blogging_platform"}, {"score": 0.0027964537059186893, "phrase": "qualitative_analyses"}, {"score": 0.0027741761880779535, "phrase": "blog_contents"}, {"score": 0.0025202582748972122, "phrase": "-ended_probes"}, {"score": 0.0024901940672239784, "phrase": "pedagogical_factors"}, {"score": 0.002363995836370621, "phrase": "students'_blogging_behaviors"}, {"score": 0.0021909411820497707, "phrase": "computer-based_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative learning", " Blogs", " Teaching/learning strategies", " Professional learning"], "paper_abstract": "Blogging has been recommended as a suitable tool for learning during internship due to its associated usefulness in collaborative learning, reflection, communication, and social support. In this study, blogging was incorporated into the internship activities of two discipline-specific groups of interns: information management (n = 53) and nursing (n = 28). In examining the behavior, perceptions and processes of blogging among interns from the two disciplines, a mixed-methods design was used to obtain quantitative and qualitative data through structured interviews and blogging entries. Results revealed that the interns engaged regularly in the writing and reading of their own blogs, and commented on others' blog-writing. The interns perceived blogs to be useful during internship in providing an avenue for knowledge construction, problem solving, reflection, and communicating their emotions. Positive perceptions were not influenced by discipline background, frequency of use, or blogging platform. Qualitative analyses of blog contents indicated that the students engaged in cognitive, metacognitive-reflective, affective, and social-collaborative learning processes in blogging. Higher engagement was found in cognitive and metacognitive processes. Responses to open-ended probes suggest that pedagogical factors (e.g., grading system, supervision) may also have influenced students' blogging behaviors and perceptions. Overall, this study offers evidence to support the use of blogging during internship as computer-based support for learning. (C) 2011 Published by Elsevier Ltd.", "paper_title": "Using blogs to support learning during internship", "paper_id": "WOS:000299714400012"}