{"auto_keywords": [{"score": 0.04246301635594336, "phrase": "publish"}, {"score": 0.00481495049065317, "phrase": "scientific_research"}, {"score": 0.004606479650820579, "phrase": "scientific_publications"}, {"score": 0.004539005582217309, "phrase": "computer_science"}, {"score": 0.003479692058963528, "phrase": "computer_science_publications"}, {"score": 0.0031377955308198634, "phrase": "computing_conferences"}, {"score": 0.0030464123943266673, "phrase": "dblp_computer_science_bibliography"}, {"score": 0.0023003498123420237, "phrase": "surprising_conclusion"}, {"score": 0.0022665781920241245, "phrase": "real_productivity"}, {"score": 0.0021049977753042253, "phrase": "average_number"}], "paper_keywords": ["Quantitative study", " Research publications", " Computer science"], "paper_abstract": "It is commonly accepted that scientific research or, more precisely, the number of scientific publications, in computer science has greatly increased over the last few years. The reason would appear to be the pressure to publish, coined by the expression \"Publish or perish\", which is, among other things, necessary for promotions and applications for grants or projects. In this paper we have conducted a study that covers computer science publications from 1936 to 2010 in order to quantify this increase in publications regarding computing research. We have considered the computing conferences and journals available in the DBLP computer science bibliography (DBLP 2013) database, including more than 1.5 million papers, and more than 4 million authors (more than 900,000 different people), corresponding to about 1,000 different journals and 3,000 different conferences and workshops. Our study confirms and quantifies these increases with regard to the number of papers, number of authors, number of papers per author, etc. However, it also reaches a surprising conclusion: the real productivity of researchers has decreased throughout history. The reason for this decrease is the average number of authors per paper, which has grown significantly and is currently three.", "paper_title": "Computer science research: more production, less productivity", "paper_id": "WOS:000331559800032"}