{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "choquet"}, {"score": 0.004466519142879166, "phrase": "interval_linguistic_multi-criteria_decision-making_problems"}, {"score": 0.00422177384286051, "phrase": "multi-criteria_group_decision-making_problems"}, {"score": 0.003701401653850141, "phrase": "interval_linguistic_multi-criteria_group_decision-making_problems"}, {"score": 0.0034118234596993836, "phrase": "modified_composite_scale"}, {"score": 0.002447101794397243, "phrase": "multi-criteria_group_decision-making_method"}, {"score": 0.0022696277881969896, "phrase": "proposed_method"}, {"score": 0.0021995257343837547, "phrase": "existing_ones"}], "paper_keywords": ["Multi-criteria group decision-making", " Interval 2-tuple linguistic model", " Choquet integral", " Modified composite scale"], "paper_abstract": "Considering that interval 2-tuple linguistic model can solve the interval linguistic multi-criteria decision-making problems, and Choquet integral can deal with the multi-criteria group decision-making problems with correlated criteria, in the revelation of these two methods, this paper combined them together to cope with the interval linguistic multi-criteria group decision-making problems with correlated criteria. Because of the limitations of 2-tuple linguistic representation model, a modified composite scale based on 2-tuple linguistic model was proposed which can better improve the accuracy of decision-making. First, using Choquet integral and interval 2-tuple linguistic model, two aggregation operators with their properties were introduced to better reflect correlations among criteria, i.e., the interval 2-tuple correlated averaging operator and the interval 2-tuple correlated geometric operator. Then, a multi-criteria group decision-making method based on the above operators was proposed. Finally, the proposed method was compared with the existing ones based on the same illustrative example to confirm its feasibility and rationality.", "paper_title": "Multi-criteria group decision making method based on interval 2-tuple linguistic information and Choquet integral aggregation operators", "paper_id": "WOS:000347836800010"}