{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "text_categorization"}, {"score": 0.012401146077129561, "phrase": "distributional_features"}, {"score": 0.0046432244185370605, "phrase": "predefined_categories"}, {"score": 0.00460125407969429, "phrase": "natural_language_text"}, {"score": 0.00429828390000229, "phrase": "previous_researches"}, {"score": 0.0036167509502276294, "phrase": "abundant_information"}, {"score": 0.0031845067058084583, "phrase": "novel_values"}, {"score": 0.0028422946420821075, "phrase": "first_appearance"}, {"score": 0.0027657766592943844, "phrase": "proposed_distributional_features"}, {"score": 0.0027035833504191233, "phrase": "tfidf_style_equation"}, {"score": 0.00266693888510356, "phrase": "different_features"}, {"score": 0.0026188490199688013, "phrase": "ensemble_learning_techniques"}, {"score": 0.002423931101340771, "phrase": "traditional_term_frequency_values"}, {"score": 0.002305589818994465, "phrase": "categorization_performance"}, {"score": 0.0021049977753042253, "phrase": "writing_style"}], "paper_keywords": ["Text categorization", " text mining", " machine learning", " distributional feature", " tfidf"], "paper_abstract": "Text categorization is the task of assigning predefined categories to natural language text. With the widely used \"bag-of-word\" representation, previous researches usually assign a word with values that express whether this word appears in the document concerned or how frequently this word appears. Although these values are useful for text categorization, they have not fully expressed the abundant information contained in the document. This paper explores the effect of other types of values, which express the distribution of a word in the document. These novel values assigned to a word are called distributional features, which include the compactness of the appearances of the word and the position of the first appearance of the word. The proposed distributional features are exploited by a tfidf style equation, and different features are combined using ensemble learning techniques. Experiments show that the distributional features are useful for text categorization. In contrast to using the traditional term frequency values solely, including the distributional features requires only a little additional cost, while the categorization performance can be significantly improved. Further analysis shows that the distributional features are especially useful when documents are long and the writing style is casual.", "paper_title": "Distributional Features for Text Categorization", "paper_id": "WOS:000262560100009"}