{"auto_keywords": [{"score": 0.03661306378153703, "phrase": "liteworp"}, {"score": 0.02322730111336099, "phrase": "wormhole_attack"}, {"score": 0.017874859805223235, "phrase": "malicious_nodes"}, {"score": 0.004776853267973129, "phrase": "static_multihop_wireless_networks"}, {"score": 0.00446490613141384, "phrase": "wide_range"}, {"score": 0.004429566229017728, "phrase": "security_attacks"}, {"score": 0.004377077848734575, "phrase": "particularly_devastating_attack"}, {"score": 0.003994714109598034, "phrase": "colluding_node"}, {"score": 0.0037935066882208235, "phrase": "route_establishment"}, {"score": 0.003559675269411366, "phrase": "lightweight_countermeasure"}, {"score": 0.0033937776228549557, "phrase": "neighbor_communication"}, {"score": 0.0033005860945173136, "phrase": "resource-constrained_multihop_wireless_networks"}, {"score": 0.003036040409062437, "phrase": "simulation_results"}, {"score": 0.0028487656293168795, "phrase": "large_range"}, {"score": 0.00252812242767189, "phrase": "unprotected_network"}, {"score": 0.0023626775529531486, "phrase": "high_detection_rate"}, {"score": 0.0022886031992739126, "phrase": "low_resource_consumption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["wireless sensor and ad hoc networks", " neighbor watch", " wormhole attack", " malicious node detection", " malicious node isolation"], "paper_abstract": "In multihop wireless systems, such as ad hoc and sensor networks, the need for cooperation among nodes to relay each other's packets exposes them to a wide range of security attacks. A particularly devastating attack is known as the wormhole attack, where a malicious node records control and data traffic at one location and tunnels it to a colluding node far away, which replays it locally. This can either disrupt route establishment or make routes pass through the malicious nodes. In this paper, we present a lightweight countermeasure for the wormhole attack, called LITEWORP, which relies on overhearing neighbor communication. LITEWORP is particularly suitable for resource-constrained multihop wireless networks, such as sensor networks. Our solution allows detection of the wormhole, followed by isolation of the malicious nodes. Simulation results show that every wormhole is detected and isolated within a very short period of time over a large range of scenarios. The results also show that the fraction of packets lost due to the wormhole when LITEWORP is applied is negligible compared to the loss in an unprotected network. Simulation results bring out the configuration where no framing is possible, while still having high detection rate. Analysis is done to show the low resource consumption of LITEWORP, the low detection latency, and the likelihood of framing by malicious nodes. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "LITEWORP: Detection and isolation of the wormhole attack in static multihop wireless networks", "paper_id": "WOS:000248748500005"}