{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conceptual_models"}, {"score": 0.026559860329619777, "phrase": "web_applications"}, {"score": 0.00475924837336259, "phrase": "model_driven_engineering_approach"}, {"score": 0.004667833113864304, "phrase": "public_transport"}, {"score": 0.004560438999891081, "phrase": "information_systems_users"}, {"score": 0.004122781047853192, "phrase": "right_information"}, {"score": 0.004075053556360943, "phrase": "right_time"}, {"score": 0.0032155857567170696, "phrase": "application's_conceptual_models"}, {"score": 0.0031171827624599693, "phrase": "user's_point"}, {"score": 0.0029867619862229853, "phrase": "modeling_method"}, {"score": 0.0027741761880779535, "phrase": "personalized_transport_information"}, {"score": 0.0026477564788515984, "phrase": "decision_trees"}, {"score": 0.002527083139627522, "phrase": "important_information"}, {"score": 0.0023654615987859402, "phrase": "modeling_phase"}, {"score": 0.0023289568500915207, "phrase": "smooth_integration"}, {"score": 0.0021970000365512227, "phrase": "better_user's_experience"}, {"score": 0.0021715177915174375, "phrase": "extended_personalization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business process", " Model-Driven Engineering", " Human Computer Interaction"], "paper_abstract": "Context: In public transport, travelers (considered as information systems users) do not have the same objectives and/or concerns at the same time. For this reason it is not always easy to provide them with the right information at the right time. If personalizing the information to the user allows to do this to some extend it is not enough since the information could also depend on the use of the context and the environment (e.g., place, time, etc.). Objective: This paper proposes a solution allowing the context to be managed inside an application's conceptual models in order to provide more flexible web applications from the user's point of view. Method: Our work is based on a modeling method using the Model Driven Engineering (MDE) approach and on practical field experiences permitting us to validate our solution. Our domain of application is personalized transport information. Results: Introducing the notion of context into rules and decision trees that are used inside conceptual models allowed us to incorporate context as important information for personalizing web applications. Conclusion: The context should be integrated into an application during the modeling phase to allow a smooth integration inside the application and to facilitate the evolution over time. Our solution offers a better user's experience through an extended personalization of web applications. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Taking context into account in conceptual models using a Model Driven Engineering approach", "paper_id": "WOS:000296986900005"}