{"auto_keywords": [{"score": 0.032276199350703326, "phrase": "thesaurus_terms"}, {"score": 0.03104244392514206, "phrase": "postgraduate_students"}, {"score": 0.00481495049065317, "phrase": "thesaurus-enhanced_search_environment"}, {"score": 0.004488946121663966, "phrase": "query_expansion_behavior"}, {"score": 0.0043560464825349275, "phrase": "thesaurus-enhanced_search_system"}, {"score": 0.0037480753312398754, "phrase": "ovid_interface"}, {"score": 0.0036921459703718176, "phrase": "cab"}, {"score": 0.0036188435232325337, "phrase": "data-gathering_techniques"}, {"score": 0.003113441660343867, "phrase": "expanded_queries"}, {"score": 0.0029611289031152856, "phrase": "academic_staff"}, {"score": 0.002858952758523772, "phrase": "key_conclusions"}, {"score": 0.0026252106881752067, "phrase": "related_terms"}, {"score": 0.0024717881264735477, "phrase": "complex_topics"}, {"score": 0.00242266141176955, "phrase": "search_term_selection"}, {"score": 0.002362620540317279, "phrase": "users'_prior_topic-search_experience"}, {"score": 0.0021049977753042253, "phrase": "additional_terms"}], "paper_keywords": [""], "paper_abstract": "The study reported here investigated the query expansion behavior of end-users interacting with a thesaurus-enhanced search system on the Web. Two groups, namely academic staff and postgraduate students, were recruited into this study. Data were collected from 90 searches performed by 30 users using the OVID interface to the CAB abstracts database. Data-gathering techniques included questionnaires, screen capturing software, and interviews. The results presented here relate to issues of search-topic and search-term characteristics, number and types of expanded queries, usefulness of thesaurus terms, and behavioral differences between academic staff and postgraduate students in their interaction. The key conclusions drawn were that (a) academic staff chose more narrow and synonymous terms than did postgraduate students, who generally selected broader and related terms; (b) topic complexity affected users' interaction with the thesaurus in that complex topics required more query expansion and search term selection; (c) users' prior topic-search experience appeared to have a significant effect on their selection and evaluation of thesaurus terms; (d) in 50% of the searches where additional terms were suggested from the thesaurus, users stated that they had not been aware of the terms at the beginning of the search; this observation was particularly noticeable in the case of postgraduate students.", "paper_title": "Query expansion behavior within a thesaurus-enhanced search environment: A user-centered evaluation", "paper_id": "WOS:000235459500003"}