{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rotation_invariant_texture_classification"}, {"score": 0.004419538941706716, "phrase": "image_analysis"}, {"score": 0.0041825926310470616, "phrase": "possible_strategies"}, {"score": 0.0038624981944755813, "phrase": "intrinsically_high_number"}, {"score": 0.0036107898615445797, "phrase": "potential_limit"}, {"score": 0.0034804536625952565, "phrase": "rotation_invariant_versions"}, {"score": 0.003417054482155433, "phrase": "careful_consideration"}, {"score": 0.0030789331635764122, "phrase": "possible_solutions"}, {"score": 0.003022825806274343, "phrase": "dimensionality_problem"}, {"score": 0.0029677378488677983, "phrase": "local_binary_patterns"}, {"score": 0.002860546817196148, "phrase": "features_model"}, {"score": 0.0027572166867780275, "phrase": "potential_advantages"}, {"score": 0.0024389277933858054, "phrase": "classification_accuracy"}, {"score": 0.0021441057555396013, "phrase": "surprising_outcome"}, {"score": 0.0021049977753042253, "phrase": "interesting_explanation"}], "paper_keywords": [""], "paper_abstract": "The use of co-occurrences of patterns in image analysis has been recently suggested as one of the possible strategies to improve on the bag-of-features model. The intrinsically high number of features of the method, however, is a potential limit to its widespread application. Its extension into rotation invariant versions also requires careful consideration. In this paper we present a general, rotation invariant framework for co-occurrences of patterns and investigate possible solutions to the dimensionality problem. Using local binary patterns as bag-of-features model, we experimentally evaluate the potential advantages that co-occurrences can provide in comparison with bag-of-features. The results show that co-occurrences remarkably improve classification accuracy in some datasets, but in others the gain is negligible, or even negative. We found that this surprising outcome has an interesting explanation in terms of the degree of association between pairs of patterns in an image, and, in particular, that the higher the degree of association, the lower the gain provided by co-occurrences in comparison with bag-of-features.", "paper_title": "General Framework for Rotation Invariant Texture Classification Through Co-occurrence of Patterns", "paper_id": "WOS:000342431000008"}