{"auto_keywords": [{"score": 0.032942068144253, "phrase": "approximate_approach"}, {"score": 0.0075090227642425865, "phrase": "proposed_methods"}, {"score": 0.00481495049065317, "phrase": "member_selection"}, {"score": 0.00476334344613564, "phrase": "three-way_decision_method"}, {"score": 0.00467855218490191, "phrase": "new_developed_uncertain_decision_theory"}, {"score": 0.004578783486828809, "phrase": "rough_sets"}, {"score": 0.0038119123317396954, "phrase": "extended_three-way_decision_method"}, {"score": 0.003690527690610707, "phrase": "acceptance_region"}, {"score": 0.0036640806940633373, "phrase": "rejection_region"}, {"score": 0.0035473867669654174, "phrase": "uncertain_region"}, {"score": 0.003361069456060196, "phrase": "human_thinking"}, {"score": 0.00333697550984782, "phrase": "decision_making"}, {"score": 0.00245753647863636, "phrase": "enhanced_approximate_approach"}, {"score": 0.0024311346712789553, "phrase": "possible_bias"}, {"score": 0.002370625627299064, "phrase": "minimal_membership_grades"}, {"score": 0.0023451553255837317, "phrase": "group_evaluation"}, {"score": 0.0022540779997940897, "phrase": "three-way_decisions"}, {"score": 0.002190064650401852, "phrase": "redundant_and_unnecessary_computations"}], "paper_keywords": ["Fuzzy set (FS)", " three-way decision (3WD)", " partial fuzzy set (PFS)", " approximate approach (AA)", " enhanced approximate approach (EAA)"], "paper_abstract": "The three-way decision method is a kind of new developed uncertain decision theory that combines fuzzy sets and rough sets together in recent years. It divides a set of objects into three regions, called the acceptance, rejection and uncertain regions, respectively. However, all the current researches deal with the three regions in the same way and do not provide further analysis on the most important uncertain region. In this paper, we propose an extended three-way decision method, called partial fuzzy sets, which regard acceptance region and rejection region as certain so as to focus on the uncertain region. Both certainty and uncertainty are simultaneously considered, that is more consistent with human thinking in decision making. Then, we establish two operational algorithms, called approximate approach and enhanced approximate approach, respectively. The approximate approach considers that the group accepts the certain information as far as possible. Specially speaking, based on approximate approach, if other members in a group are all uncertain to a judgment except one or two, who accept or reject it surely, then the group would agree with the certain judgment, even that they might be the minority. On the base of approximate approach, enhanced approximate approach reduces the possible bias through removing the maximal and the minimal membership grades in the group evaluation before aggregation. Obviously, the proposed methods provide more effective ways for three-way decisions than the current researches by avoiding some redundant and unnecessary computations, especially for the case with abundant of alternatives. Two numerical examples are provided to illustrate the practicality and validity of the proposed methods.", "paper_title": "An extended three-way decision and its application in member selection", "paper_id": "WOS:000357312800013"}