{"auto_keywords": [{"score": 0.031461310706329015, "phrase": "ha"}, {"score": 0.00481495049065317, "phrase": "mobile_ip-based_community_networks"}, {"score": 0.004417848254181138, "phrase": "ip_communications"}, {"score": 0.004317576641196539, "phrase": "mobile_ip"}, {"score": 0.0042928657936640476, "phrase": "nemo."}, {"score": 0.004256060942428626, "phrase": "mobile_clients"}, {"score": 0.004183393072178239, "phrase": "home_agent"}, {"score": 0.004065015441680357, "phrase": "sub-optimal_route"}, {"score": 0.0040186038781533946, "phrase": "route_optimization"}, {"score": 0.003961330917648707, "phrase": "communications_performance"}, {"score": 0.0038825121288253435, "phrase": "infrastructure_load"}, {"score": 0.0035416325863738326, "phrase": "mobile_node"}, {"score": 0.003372844338742438, "phrase": "closer_ha"}, {"score": 0.0031845067058084613, "phrase": "peer-to-peer_network"}, {"score": 0.0031210959920028357, "phrase": "different_has"}, {"score": 0.003067746780840567, "phrase": "flexible_has"}, {"score": 0.002938317647182056, "phrase": "main_advantages"}, {"score": 0.0028880836335117297, "phrase": "existing_ones"}, {"score": 0.002806256131739047, "phrase": "communications_delay"}, {"score": 0.002711109302199029, "phrase": "main_concerns"}, {"score": 0.002294686545883412, "phrase": "average_reduction"}, {"score": 0.0022749744354271816, "phrase": "communication's_delay"}, {"score": 0.0022168460543913787, "phrase": "minimum_deployment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobility", " Mobile IP", " NEMO", " Route optimization", " P2P", " Community networks"], "paper_abstract": "Wireless technologies are rapidly evolving and the users are demanding the possibility of changing their point of attachment to the Internet (i.e. Access Routers) without breaking the IP communications. This can be achieved by using Mobile IP or NEMO. However, mobile clients must forward their data packets through its Home Agent (HA) to communicate with its peers. This sub-optimal route (lack of route optimization) considerably reduces the communications performance, increases the delay and the infrastructure load. In this paper, we present fP2P-HN, a Peer-to-Peer-based architecture that allows deploying several HAs throughout the Internet. With this architecture, a Mobile Node (MN) or a Mobile Community Network (i.e. a NEMO) can select a closer HA to its topological position in order to reduce the delay of the paths towards its peers. fP2P-HN uses a Peer-to-Peer network to signal the location of the different HAs. Additionally, it uses flexible HAs that significantly reduce the amount of packets processed by the HA itself. The main advantages of the fP2P-HN over the existing ones are that it is scalable, it reduces the communications delay and the load at the HAs. Since one of the main concerns in mobility is security, our solution provides authentication between the HAs and the MNs. We evaluate the performance of the fP2P-HN by simulation. Our results show that the fP2P-HN is scalable since the amount of signalling messages per HA does not increase, even if the number of deployed HAs increases. We also show that the average reduction of the communication's delay compared to Mobile IP/NEMO is 23% (with a minimum deployment) and the reduction of the load at the HA is at least 54%. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "fP2P-HN: A P2P-based route optimization architecture for mobile IP-based community networks", "paper_id": "WOS:000264083300008"}