{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "wap"}, {"score": 0.03256184995690699, "phrase": "wireless_internet_field"}, {"score": 0.004325487452170154, "phrase": "mgi_service"}, {"score": 0.004287008195370748, "phrase": "mobile_geographic_information_service"}, {"score": 0.0031071175640144943, "phrase": "public_services"}, {"score": 0.002918483026678636, "phrase": "private_services"}, {"score": 0.0026567282965815823, "phrase": "tactical_technology"}, {"score": 0.0024401411219526774, "phrase": "new_integrated_architecture"}, {"score": 0.002418393046947528, "phrase": "different_technologies"}, {"score": 0.0021334650920198715, "phrase": "brand-new_direct-connected_way"}], "paper_keywords": ["GIS", " Mobile Geographic Information Service", " WAP", " i-mode", " J2ME"], "paper_abstract": "The concepts of MGIS (Mobile Geographic Information System), LBS (Location Based Service) and MGI Service (Mobile Geographic Information Service) were introduced first. Then the consistency of the three wireless Internet access technology, WAP (Wireless Application Protocol), i-mode and J2ME (Java(TM) 2 Micro Edition) were proposed not only from the surfaces, but also from the architectures. Based on the analysis of the WAP, i-mode and J2ME, the suggested suitable field of each technology was discussed. WAP and i-mode are adapted to fields of public services in wireless Internet field with Browser/Server structures, and J2ME is adapted to the fields of private services in wireless Internet field with Client/Server structure. There are no competitions among these three technologies, and each of the three is a tactical technology. They will coexist for a long period, and now we should focus more on how to use a new integrated architecture of different technologies to solve more complex spatial-related questions in the mobile service field than discussing which one is the best. And maybe all three will be replaced in the future when a brand-new direct-connected way to browse the Internet Geographic Information Web Service is developed.", "paper_title": "Which one should be chosen for the Mobile Geographic Information Service now, WAP vs. i-mode vs. J2ME?", "paper_id": "WOS:000242854400010"}