{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "visual_inspection"}, {"score": 0.004781777766309739, "phrase": "automated_detection_techniques"}, {"score": 0.004571630734130793, "phrase": "appropriate_carrier"}, {"score": 0.004462308985053246, "phrase": "audio_file"}, {"score": 0.004178522455099832, "phrase": "hidden_message"}, {"score": 0.003980984488865867, "phrase": "civil_rights_organisations"}, {"score": 0.003953534569134559, "phrase": "repressive_states"}, {"score": 0.0032121901685844803, "phrase": "first_place"}, {"score": 0.003124437382827821, "phrase": "initial_aim"}, {"score": 0.0029052913631676435, "phrase": "common_methods"}, {"score": 0.0027486699590262343, "phrase": "chosen_methods"}, {"score": 0.0026643006135750025, "phrase": "common_frame"}, {"score": 0.002609494276659916, "phrase": "steganography_methods"}, {"score": 0.002564682311144514, "phrase": "gif_images"}, {"score": 0.00254697318939512, "phrase": "seven_steganography_methods"}, {"score": 0.0024179854244287795, "phrase": "different_types"}, {"score": 0.0021943920257952174, "phrase": "least_significant_bits"}, {"score": 0.002179234170770192, "phrase": "pixel_values"}, {"score": 0.002119640369431708, "phrase": "least_significant_bit"}, {"score": 0.0021049977753042253, "phrase": "parity_patterns"}], "paper_keywords": ["steganography", " steganalysis"], "paper_abstract": "Steganography is a process that involves hiding a message in an appropriate carrier for example an image or an audio file. The carrier can then be sent to a receiver without anyone else knowing that it contains a hidden message. This is a process, which can be used for example by civil rights organisations in repressive states to communicate their message to the outside world without their own government being aware of it. Less virtuously it can be used by terrorists to communicate with one another without anyone else's knowledge. In both cases the objective is not to make it difficult to read the message as cryptography does, it is to hide the existence of the message in the first place possibly to protect the courier. The initial aim of this study was to investigate steganography and how it is implemented. Based on this work a number of common methods of steganography could then be implemented and evaluated. The strengths and weaknesses of the chosen methods can then be analysed. To provide a common frame of reference all of the steganography methods implemented and analysed used GIF images. Seven steganography methods were implemented. The methods were chosen for their different strengths in terms of resistance to different types of steganalysis or their ability to maximise the size of the message they could store. All of the methods used were based on the manipulation of the least significant bits of pixel values or the rearrangement of colours to create least significant bit or parity patterns, which correspond to the message being hidden.", "paper_title": "An evaluation of image based steganography methods using visual inspection and automated detection techniques", "paper_id": "WOS:000240363400003"}