{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cyber_crimes"}, {"score": 0.004630270043271386, "phrase": "information_technology"}, {"score": 0.004585212379675535, "phrase": "cyber_crime"}, {"score": 0.004387793971765289, "phrase": "law_enforcement_organizations"}, {"score": 0.004240116703465252, "phrase": "criminal_activities"}, {"score": 0.0038448988429199086, "phrase": "research_communities"}, {"score": 0.0035902958977673313, "phrase": "attack_models"}, {"score": 0.0032079813320482304, "phrase": "comprehensive_survey"}, {"score": 0.0028944757265206332, "phrase": "digital_world"}, {"score": 0.0027969169552385974, "phrase": "physical_world"}, {"score": 0.0024624103660827695, "phrase": "traditionally_non-cyber_crimes"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["MAC security", " IDS", " forensics"], "paper_abstract": "With the advancement of computer and information technology, cyber crime is now becoming one of the most significant challenges facing law enforcement organizations. Cyber crimes are generally referred as criminal activities that use computers or networks. An understanding of the characteristics and nature of cyber crimes is important in helping research communities find ways to effectively prevent them. Most existing research focuses more on attacks and attack models, including either actual attacks or imaginary/possible attacks over all layers of networks or computers, but there has been less work carried out on a comprehensive survey of cyber crimes. This paper provides a survey of cyber crimes that have actually occurred. First, cyber crimes in the digital world are compared with crimes in the physical world. Then, cyber crimes are categorized according to the roles of computers or networks. Furthermore, we also notice that some cyber crimes are actually traditionally non-cyber crimes that are facilitated by computers or networks. It is surprising that there are so many recurrent cyber crimes. More efforts are needed to protect people from cyber crimes. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "A survey of cyber crimes", "paper_id": "WOS:000301489900008"}