{"auto_keywords": [{"score": 0.038381469407306065, "phrase": "operation_sequences"}, {"score": 0.038040599030405575, "phrase": "data_values"}, {"score": 0.00481495049065317, "phrase": "extended_fsa"}, {"score": 0.0047051051659828275, "phrase": "empirical_assessment"}, {"score": 0.004534517530868195, "phrase": "finite_state_automata"}, {"score": 0.004492841495994535, "phrase": "execution_traces"}, {"score": 0.004329916183121203, "phrase": "analysis_activities"}, {"score": 0.0035663245542174224, "phrase": "unique_model"}, {"score": 0.0032215231177304513, "phrase": "heterogeneous_types"}, {"score": 0.0030476702431093687, "phrase": "higher_quality_models"}, {"score": 0.002896535621940078, "phrase": "empirical_comparative_study"}, {"score": 0.0028303313661029597, "phrase": "simple_automata"}, {"score": 0.0025329623864528317, "phrase": "different_levels"}, {"score": 0.0024636239664210433, "phrase": "different_software_systems"}, {"score": 0.0023522423291484212, "phrase": "first_work"}, {"score": 0.0022772782536385717, "phrase": "data-flow_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["FSA inference", " Empirical validation", " Behavioral models"], "paper_abstract": "A number of techniques that infer finite state automata from execution traces have been used to support test and analysis activities. Some of these techniques can produce automata that integrate information about the data-Flow, that is, they also represent how data values affect the operations executed by programs. The integration of information about operation sequences and data values into a unique model is indeed conceptually useful to accurately represent the behavior of a program. However, it is still unclear whether handling heterogeneous types of information, such as operation sequences and data values, necessarily produces higher quality models or not. In this paper, we present an empirical comparative study between techniques that infer simple automata and techniques that infer automata extended with information about data-Flow. We investigate the effectiveness of these techniques when applied to traces with different levels of sparseness, produced by different software systems. To the best of our knowledge this is the first work that quantifies both the effect of adding data-Flow information within automata and the effectiveness of the techniques when varying sparseness of traces. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Learning extended FSA from software: An empirical assessment", "paper_id": "WOS:000306728500007"}