{"auto_keywords": [{"score": 0.0390216842053703, "phrase": "building_blocks"}, {"score": 0.03637124511862821, "phrase": "funcsion"}, {"score": 0.00481495049065317, "phrase": "automated_synthesis"}, {"score": 0.004765173195920904, "phrase": "design_solutions"}, {"score": 0.0046429592670444945, "phrase": "mechanical_conceptual_design"}, {"score": 0.004250302819248558, "phrase": "alternative_solutions"}, {"score": 0.0038106195546165574, "phrase": "solution_concepts"}, {"score": 0.003771185758226876, "phrase": "mechanical_devices"}, {"score": 0.00331125524068286, "phrase": "functional_requirements"}, {"score": 0.0030625949549620475, "phrase": "distinctive_feature"}, {"score": 0.002968424524565369, "phrase": "automated_generation"}, {"score": 0.0029376803941247084, "phrase": "spatial_configurations"}, {"score": 0.002633425544817301, "phrase": "design_problems"}, {"score": 0.0022175679453857473, "phrase": "detailed_account"}, {"score": 0.0021049977753042253, "phrase": "enhanced_ideation"}], "paper_keywords": ["Combinatorial Synthesis", " Creativity", " Ideation", " Novelty", " Stimuli"], "paper_abstract": "The goal of the work reported in this paper is to use automated, combinatorial synthesis to generate alternative solutions to be used as stimuli by designers for ideation. FuncSION, a computational synthesis tool that can automatically synthesize solution concepts for mechanical devices by combining building blocks from a library, is used for this purpose. The objectives of FuncSION are to help generate a variety of functional requirements for a given problem and a variety of concepts to fulfill these functions. A distinctive feature of FuncSION is its focus on automated generation of spatial configurations, an aspect rarely addressed by other computational synthesis programs. This paper provides an overview of FuncSION in terms of representation of design problems, representation of building blocks, and rules with which building blocks are combined to generate concepts at three levels of abstraction: topological, spatial, and physical. The paper then provides a detailed account of evaluating FuncSION for its effectiveness in providing stimuli for enhanced ideation.", "paper_title": "Evaluating FuncSION: A software for automated synthesis of design solutions for stimulating ideation during mechanical conceptual design", "paper_id": "WOS:000340154200002"}