{"auto_keywords": [{"score": 0.04670675420350503, "phrase": "trust_relationships"}, {"score": 0.04484073541584771, "phrase": "malicious_peers"}, {"score": 0.00481495049065317, "phrase": "-peer_systems"}, {"score": 0.004756805752518494, "phrase": "open_nature"}, {"score": 0.0046993598473345395, "phrase": "peer-to-peer_systems"}, {"score": 0.004161553532799662, "phrase": "distributed_algorithms"}, {"score": 0.003574695610710444, "phrase": "local_information"}, {"score": 0.0034049123167891955, "phrase": "global_trust_information"}, {"score": 0.002636956926079255, "phrase": "recommender's_trustworthiness"}, {"score": 0.002392188222609101, "phrase": "file_sharing_application_show"}, {"score": 0.002348883765159185, "phrase": "proposed_model"}, {"score": 0.0021966859554037174, "phrase": "good_peers"}], "paper_keywords": ["Peer-to-peer systems", " trust management", " reputation", " security"], "paper_abstract": "Open nature of peer-to-peer systems exposes them to malicious activity. Building trust relationships among peers can mitigate attacks of malicious peers. This paper presents distributed algorithms that enable a peer to reason about trustworthiness of other peers based on past interactions and recommendations. Peers create their own trust network in their proximity by using local information available and do not try to learn global trust information. Two contexts of trust, service, and recommendation contexts, are defined to measure trustworthiness in providing services and giving recommendations. Interactions and recommendations are evaluated based on importance, recentness, and peer satisfaction parameters. Additionally, recommender's trustworthiness and confidence about a recommendation are considered while evaluating recommendations. Simulation experiments on a file sharing application show that the proposed model can mitigate attacks on 16 different malicious behavior models. In the experiments, good peers were able to form trust relationships in their proximity and isolate malicious peers.", "paper_title": "SORT: A Self-ORganizing Trust Model for Peer-to-Peer Systems", "paper_id": "WOS:000312779000002"}