{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "support_vector_machines"}, {"score": 0.004760017604908536, "phrase": "well-known_sequential_minimal_optimization"}, {"score": 0.004529093447865156, "phrase": "support_vector_learning_problems"}, {"score": 0.004409404470207072, "phrase": "traditional_smo_algorithm"}, {"score": 0.003613556291453534, "phrase": "new_algorithm"}, {"score": 0.003160200215473349, "phrase": "main_difference"}, {"score": 0.002949598537993663, "phrase": "line_segment"}, {"score": 0.0028496055358577512, "phrase": "two-dimensional_region"}, {"score": 0.0028170314398963704, "phrase": "infinitely_many_line_segments"}, {"score": 0.0026596472456182707, "phrase": "main_updating_formulae"}, {"score": 0.0025991772235338367, "phrase": "support_vector_learning_problem"}, {"score": 0.0022990901047984197, "phrase": "numerical_performances"}, {"score": 0.0022640963589007457, "phrase": "simulation_results"}, {"score": 0.0021705796895687864, "phrase": "executing_time"}, {"score": 0.0021539955106204354, "phrase": "computation_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Support vector machine", " Sequential minimal optimization", " Classification", " Regression"], "paper_abstract": "The well-known sequential minimal optimization (SMO) algorithm is the most commonly used algorithm for numerical solutions of the support vector learning problems. At each iteration in the traditional SMO algorithm, also called 2PSMO algorithm in this paper, it jointly optimizes only two chosen parameters. The two parameters are selected either heuristically or randomly, whilst the optimization with respect to the two chosen parameters is performed analytically. The 2PSMO algorithm is naturally generalized to the three-parameter sequential minimal optimization (3PSMO) algorithm in this paper. At each iteration of this new algorithm, it jointly optimizes three chosen parameters. As in 2PSMO algorithm, the three parameters are selected either heuristically or randomly, whilst the optimization with respect to the three chosen parameters is performed analytically. Consequently, the main difference between these two algorithms is that the optimization is performed at each iteration of the 2PSMO algorithm on a line segment, whilst that of the 3PSMO algorithm on a two-dimensional region consisting of infinitely many line segments. This implies that the maximum can be attained more efficiently by 3PSMO algorithm. Main updating formulae of both algorithms for each support vector learning problem are presented. To assess the efficiency of the 3PSMO algorithm compared with the 2PSMO algorithm, 14 benchmark datasets, 7 for classification and 7 for regression, will be tested and numerical performances are compared. Simulation results demonstrate that the 3PSMO outperforms the 2PSMO algorithm significantly in both executing time and computation complexity. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Three-parameter sequential minimal optimization for support vector machines", "paper_id": "WOS:000296212400078"}