{"auto_keywords": [{"score": 0.0490331333435727, "phrase": "technology_clusters"}, {"score": 0.015719716506582538, "phrase": "multidimensional_scaling"}, {"score": 0.0046683172874085015, "phrase": "empirical_evidence"}, {"score": 0.004546174820239776, "phrase": "related_products"}, {"score": 0.004466519142879166, "phrase": "technology_cluster"}, {"score": 0.0038602215057106917, "phrase": "priori_assumptions"}, {"score": 0.003742554019950264, "phrase": "measure_ownership"}, {"score": 0.003676926952533304, "phrase": "functionally_related_technology"}, {"score": 0.0036124465071873998, "phrase": "systematic_reasoning"}, {"score": 0.003107935254560724, "phrase": "galileo_system"}, {"score": 0.0030399188412691914, "phrase": "associational_diffusion_framework"}, {"score": 0.0028446460307503343, "phrase": "clear_differences"}, {"score": 0.002447101794397243, "phrase": "related_technologies"}, {"score": 0.0023101951336207955, "phrase": "stricter_ascendancy"}, {"score": 0.0022101055924375725, "phrase": "subsequent_innovations"}, {"score": 0.0021426288417854987, "phrase": "measurement_approaches"}, {"score": 0.0021049977753042253, "phrase": "alternative_methodology"}], "paper_keywords": [""], "paper_abstract": "Empirical evidence suggests that the ownership of related products that form a technology cluster is significantly better than the attributes of an innovation at predicting adoption. The treatment of technology clusters, however, has been ad hoc and study specific: Researchers often make a priori assumptions about the relationships between technologies and measure ownership using lists of functionally related technology, without any systematic reasoning. Hence, the authors set out to examine empirically the composition of technology clusters and the differences, if any, in clusters of technologies formed by adopters and nonadopters. Using the Galileo system of multidimensional scaling and the associational diffusion framework, the dissimilarities between 30 technology concepts were scored by adopters and nonadopters. Results indicate clear differences in conceptualization of clusters: Adopters tend to relate technologies based on their functional similarity; here, innovations are perceived to be complementary, and hence, adoption of one technology spurs the adoption of related technologies. On the other hand, nonadopters tend to relate technologies using a stricter ascendancy of association where the adoption of an innovation makes subsequent innovations redundant. The results question the measurement approaches and present an alternative methodology.", "paper_title": "Technology clusters: Using multidimensional scaling to evaluate and structure technology clusters", "paper_id": "WOS:000239672100005"}