{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "ischemic_stroke"}, {"score": 0.02209609351839487, "phrase": "dead_zone"}, {"score": 0.00885289236232529, "phrase": "extracellular_space"}, {"score": 0.00481495049065317, "phrase": "necrotic_area"}, {"score": 0.0039119492240482, "phrase": "large_variations"}, {"score": 0.0038624981944755813, "phrase": "extracellular_concentrations"}, {"score": 0.0035183910023550246, "phrase": "propagation_phenomena"}, {"score": 0.002931569771634119, "phrase": "phenomenological_model"}, {"score": 0.002785978280998868, "phrase": "brain_injury"}, {"score": 0.0024632148715152393, "phrase": "final_size"}, {"score": 0.0024320326084093465, "phrase": "ischemic_core"}, {"score": 0.0023507916951658455, "phrase": "threshold_phenomena"}, {"score": 0.0022530375696567136, "phrase": "spatially_couples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Ischemic stroke", " Spreading depression", " Apoptosis", " Necrosis", " Modelization"], "paper_abstract": "We investigate a very simple model of growth of the dead zone in ischemic stroke, and in particular, the influence of the way cells die: necrosis or apoptosis. In necrosis the cells \"explose'' and release their interiors in extracellular space, which may lead to large variations in the extracellular concentrations of various ions and toxins. These ions may destabilize the cells which border the dead zone, leading in some cases to propagation phenomena (spreading depressions). In apoptosis on the contrary, the cells shrink by expulsing water in the extracellular space, and do not release their various toxins. As a consequence, it is assumed that they do not disturb their neighboring cells. This phenomenological model is aimed at weighting the various major mechanisms known to be involved in brain injury following an ischemic stroke. In this paper, we model the growth of the dead zone during ischemic stroke and discuss the influence of the way cells die on the final size of the ischemic core. We show that the model exhibits threshold phenomena, which is quite surprising, since this model spatially couples ordinary differential equations, therefore more complex behavior is awaited. (C) 2010 Published by Elsevier Ltd", "paper_title": "A phenomenological model of the growth of the necrotic area in ischemic stroke", "paper_id": "WOS:000275746300002"}