{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "groundwater_component"}, {"score": 0.004730158389701481, "phrase": "spatially_distributed_fully_integrated_surface_water-groundwater_flow_models"}, {"score": 0.00446471538346719, "phrase": "fully_integrated_surface_water-groundwater_flow_and_transport_models"}, {"score": 0.004270665568018583, "phrase": "streamflow_generation_mechanisms"}, {"score": 0.004122044458103863, "phrase": "hmc_method"}, {"score": 0.0038728151007982378, "phrase": "particular_point"}, {"score": 0.0036229421570951807, "phrase": "tracer_transport_simulations"}, {"score": 0.003527550673371394, "phrase": "exchange_fluxes"}, {"score": 0.003032405563826263, "phrase": "fully_integrated_surface_water_groundwater_flow_models"}, {"score": 0.002965694277917361, "phrase": "hmc"}, {"score": 0.0025950024597986366, "phrase": "key_advantage"}, {"score": 0.002438203996977464, "phrase": "tracer_transport"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Surface water-groundwater interaction", " HydroGeoSphere", " Streamflow generation"], "paper_abstract": "The complexity of available hydrological models continues to increase, with fully integrated surface water-groundwater flow and transport models now available. Nevertheless, an accurate quantification of streamflow generation mechanisms within these models is not yet possible. For example, such models do not report the groundwater component of streamflow at a particular point along the stream. Instead, the groundwater component of streamflow is approximated either from tracer transport simulations or by the sum of exchange fluxes between the surface and the subsurface along the river. In this study, a hydraulic mixing-cell (HMC) method is developed and tested that allows to accurately determine the groundwater component of streamflow by using only the flow solution from fully integrated surface water groundwater flow models. By using the HMC method, the groundwater component of streamflow can be extracted accurately at any point along a stream provided the subsurface/surface exchanges along the stream are calculated by the model. A key advantage of the HMC method is that only hydraulic information is used, thus the simulation of tracer transport is not required. Two numerical experiments are presented, the first to test the HMC method and the second to demonstrate that it quantifies the groundwater component of streamflow accurately. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A hydraulic mixing-cell method to quantify the groundwater component of streamflow within spatially distributed fully integrated surface water-groundwater flow models", "paper_id": "WOS:000290291100005"}