{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generalized_translocations"}, {"score": 0.03831981757250338, "phrase": "reciprocal_translocations"}, {"score": 0.03255786331031157, "phrase": "non-reciprocal_translocations"}, {"score": 0.0047006879240764935, "phrase": "prevalent_rearrangement_event"}, {"score": 0.004589124394375718, "phrase": "multi-chromosomal_species"}, {"score": 0.004270003565426343, "phrase": "exchanged_ends"}, {"score": 0.003878625406105021, "phrase": "shortest_sequence"}, {"score": 0.0034392837410790293, "phrase": "reciprocal_translocation_sorting"}, {"score": 0.0031845067058084583, "phrase": "chromosome_ends"}, {"score": 0.00266510562382701, "phrase": "different_chromosome_ends"}, {"score": 0.0025034338848015166, "phrase": "polynomial_algorithm"}, {"score": 0.00242047093248845, "phrase": "conceptual_level"}, {"score": 0.002273605832016442, "phrase": "hannenhalli"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithm", " Genome rearrangement", " Translocation"], "paper_abstract": "Translocation is a prevalent rearrangement event in the evolution of multi-chromosomal species which exchanges ends between two chromosomes. A translocation is reciprocal if none of the exchanged ends is empty; otherwise, non-reciprocal. The problem of sorting by translocations asks to find a shortest sequence of translocations transforming one genome into another. The problem of sorting by reciprocal translocations can be solved in polynomial-time. Several algorithms have been developed for reciprocal translocation sorting. They can only be applied to a pair of genomes having the same set of chromosome ends. Such a restriction can be removed if non-reciprocal translocations are also allowed. In this paper, we show how to extend the algorithm for sorting by reciprocal translocations to include non-reciprocal translocations, allowing us to compare genomes containing different chromosome ends. We call this problem sorting by generalized translocations. We present a polynomial algorithm for this problem. At a conceptual level, there is some similarity between our algorithm and the algorithm developed by Hannenhalli which is used to sort genomes by reversals and translocations. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Sorting genomes by generalized translocations", "paper_id": "WOS:000321176800010"}