{"auto_keywords": [{"score": 0.03409675851573747, "phrase": "blast_searches"}, {"score": 0.03249586009305922, "phrase": "blast_execution_time"}, {"score": 0.030412786829967446, "phrase": "grid_environment"}, {"score": 0.00481495049065317, "phrase": "biological_sequence_comparison"}, {"score": 0.004682708592184678, "phrase": "unprecedented_development"}, {"score": 0.004653815971302021, "phrase": "molecular_biology"}, {"score": 0.004610809404212932, "phrase": "extremely_high_number"}, {"score": 0.0045119929871912405, "phrase": "genome_projects"}, {"score": 0.004456475967147909, "phrase": "genomic_databases"}, {"score": 0.004334036641115555, "phrase": "exponential_growth_rate"}, {"score": 0.004023662440623241, "phrase": "direct_experimentation"}, {"score": 0.0035879931522580745, "phrase": "computational_methods"}, {"score": 0.0035548008271253607, "phrase": "biological_information"}, {"score": 0.0034250633972597254, "phrase": "new_sequence"}, {"score": 0.003035135667860725, "phrase": "grid_environments"}, {"score": 0.0029243084850457757, "phrase": "adaptive_task_allocation_framework"}, {"score": 0.0027570267191549774, "phrase": "blast_genomic_database_comparisons"}, {"score": 0.0026317312518257803, "phrase": "new_task_allocation_strategies"}, {"score": 0.002551372449383365, "phrase": "grid_nodes'_execution_weight"}, {"score": 0.0025199184718145604, "phrase": "chosen_allocation_policy"}, {"score": 0.0024965820893532286, "phrase": "observed_computational_power"}, {"score": 0.0024811443887080543, "phrase": "local_load"}, {"score": 0.002212123058024589, "phrase": "adaptive_task_allocation_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Grid computing", " Bioinformatics", " Task allocation"], "paper_abstract": "In the last decade, we have observed an unprecedented development in molecular biology. An extremely high number of organisms have been sequenced in genome projects and included in genomic databases, for further analysis. These databases present an exponential growth rate and they are intensively accessed daily, all over the world. Once a sequence is obtained, its function and/or structure must be determined. Direct experimentation is considered to be the most reliable method to do that. However, the experiments that must be conducted are very complex and time consuming. For this reason, it is far more productive to use computational methods to infer biological information from a sequence. This is usually done by comparing the new sequence with sequences that already had their characteristics determined. BLAST is the most widely used heuristic tool for sequence comparison. Thousands of BLAST searches are made daily, all over the world. In order to further reduce the BLAST execution time, cluster and grid environments can be effectively used. This paper proposes and evaluates an adaptive task allocation framework to perform BLAST searches in a grid environment. The framework, called PackageBLAST provides an infrastructure that executes distributed BLAST genomic database comparisons. In addition, it is flexible since the user can choose or incorporate new task allocation strategies. Furthermore, we propose a mechanism to compute grid nodes' execution weight, adapting the chosen allocation policy to the observed computational power and local load of the nodes. Our results present very good speedups. For instance, in a 16-machine heterogeneous grid testbed, a speedup of 14.59 was achieved, reducing the BLAST execution time from 30.88 min to 2.11 min. Also, we show that the adaptive task allocation strategy was able to handle successfully the complexity of a grid environment. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "An adaptive multi-policy grid service for biological sequence comparison", "paper_id": "WOS:000273835800008"}