{"auto_keywords": [{"score": 0.04935889043076212, "phrase": "bag-set_semantics"}, {"score": 0.009265487891678081, "phrase": "search_space"}, {"score": 0.008149466091367323, "phrase": "optimal_solutions"}, {"score": 0.00481495049065317, "phrase": "view_selection_problem"}, {"score": 0.004548848077202625, "phrase": "view_selection"}, {"score": 0.004480394224548146, "phrase": "conjunctive_queries"}, {"score": 0.004168986485488861, "phrase": "candidate_viewsets"}, {"score": 0.0040444053843446326, "phrase": "query_workloads"}, {"score": 0.0036093693971289754, "phrase": "general_case"}, {"score": 0.003448705829033573, "phrase": "tight_condition"}, {"score": 0.0034226302212225206, "phrase": "candidate_views"}, {"score": 0.0027566738323014, "phrase": "corresponding_equivalent_rewritings"}, {"score": 0.0026438880533289893, "phrase": "chain_query_workloads"}, {"score": 0.002368120987066921, "phrase": "single_binary_relation"}, {"score": 0.002314752262613559, "phrase": "bag_semantics"}, {"score": 0.002153540857619362, "phrase": "path-query_workload"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["View selection", " Query rewriting", " Bag semantics", " Bag-set semantics"], "paper_abstract": "In this paper, we investigate the problem of view selection for workloads of conjunctive queries under bag and bag-set semantics. In particular, for both semantics we aim to limit the search space of candidate viewsets. We also start delineating boundaries between query workloads for which certain even more restricted search spaces suffice. They suffice in the sense that they do not compromise optimality in that they contain at least one of the optimal solutions. We start with the general case for both bag and bag-set semantics, where we give a tight condition that candidate views can satisfy and still the search space (thus limited) does contain at least one optimal solution. We show that these results, for both semantics, reduce the size of the search space significantly. Further on, due to this analysis for both semantics, a delineation of the space of viewsets and the space of the corresponding equivalent rewritings for a certain conjunctive query workload is given. We show that for chain query workloads under both bag and bag-set semantics, taking only chain views may miss optimal solutions, whereas, if we further limit the queries to be path-queries (i.e., chain queries over a single binary relation), then, under bag semantics, path-views suffice. Concentrating to bag-set semantics, we show that the path-viewsets do not suffice for every path-query workload. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "On solving efficiently the view selection problem under bag and bag-set semantics", "paper_id": "WOS:000333785700010"}