{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multi-label_classification"}, {"score": 0.004466519142879166, "phrase": "output_codes"}, {"score": 0.004077005481951783, "phrase": "base_multi-label_classifiers"}, {"score": 0.003990385737207714, "phrase": "noisy_channel"}, {"score": 0.003802135020791801, "phrase": "classification_errors"}, {"score": 0.003741371936431574, "phrase": "individual_classifiers"}, {"score": 0.003603327452846714, "phrase": "exhaustive_studies"}, {"score": 0.0034148795808317555, "phrase": "multi-label_classification_problem"}, {"score": 0.0030178961017306646, "phrase": "multi-label_classifier_results"}, {"score": 0.002875391177926809, "phrase": "binary_relevance_classification_method"}, {"score": 0.0027991418754844347, "phrase": "coding_scheme"}, {"score": 0.002281869883540475, "phrase": "ecoc"}, {"score": 0.0021049977753042253, "phrase": "larger_label_sets"}], "paper_keywords": ["machine learning", " supervised learning", " multi-label classification", " error-correcting output codes", " ECOC", " ensemble methods", " binary relevance", " framework"], "paper_abstract": "A framework for multi-label classification extended by Error Correcting Output Codes (ECOCs) is introduced and empirically examined in the article. The solution assumes the base multi-label classifiers to be a noisy channel and applies ECOCs in order to recover the classification errors made by individual classifiers. The framework was examined through exhaustive studies over combinations of three distinct classification algorithms and four ECOC methods employed in the multi-label classification problem. The experimental results revealed that (i) the Bode-Chaudhuri-Hocquenghem (BCH) code matched with any multi-label classifier results in better classification quality; (ii) the accuracy of the binary relevance classification method strongly depends on the coding scheme; (iii) the label power-set and the RAkEL classifier consume the same time for computation irrespective of the coding utilized; (iv) in general, they are not suitable for ECOCs because they are not capable to benefit from ECOC correcting abilities; (v) the all-pairs code combined with binary relevance is not suitable for datasets with larger label sets.", "paper_title": "MULTI-LABEL CLASSIFICATION USING ERROR CORRECTING OUTPUT CODES", "paper_id": "WOS:000312723300004"}