{"auto_keywords": [{"score": 0.04968510255692421, "phrase": "firm_value"}, {"score": 0.034195866361702, "phrase": "firm_performance"}, {"score": 0.0046392209103157936, "phrase": "information_technology"}, {"score": 0.004014452814186653, "phrase": "longitudinal_study"}, {"score": 0.003820144626025562, "phrase": "adjusted-previous_performance"}, {"score": 0.003264547032549398, "phrase": "long-term_influences"}, {"score": 0.0031845067058084583, "phrase": "short-term_influences"}, {"score": 0.0026875205754965516, "phrase": "long-term_viewpoint"}, {"score": 0.0025892330566358503, "phrase": "long-term_growth"}, {"score": 0.0025257081555100556, "phrase": "greater_competitiveness"}, {"score": 0.0024535580495414783, "phrase": "competitive_advantage"}, {"score": 0.0022679195103377124, "phrase": "empirical_study"}], "paper_keywords": ["Firm performance", " Firm value", " IT capability"], "paper_abstract": "Purpose - The purpose of this paper is to differentiate and define the concepts of firm performance and firm value. Then, the implications of information technology (IT)-enabled firm performance and firm value will be clarified. Finally, the effects of IT capabilities on firm performance and firm value will be compared. Design/methodology/approach - Information Week's IT leader rankings (from 1998 to 2011) are used for analysis in a longitudinal study. Three different test methods (i.e. significant years, significant levels, and adjusted-previous performance) are used. Findings - It is confirmed that no matter which tests are examined, the contributions of IT capabilities to firm value are all greater than those to firm performance. This also shows that IT contributes to long-term influences more than it does to short-term influences. Research limitations/implications - This study confirms that firm performance (accounting-based measures) and firm value (financial market-based measures) are two different variables and IT capabilities affect these two parts differently. Practical implications - Firms should use a long-term viewpoint to deploy their IT strategies. This will create a long-term growth of firm value leading to greater competitiveness, and, ultimately, sustained competitive advantage. Originality/value - The differences between firm performance and firm value in measurements, characteristics, and implications are specified. The empirical study confirms that IT capabilities contribute more to firm value than to firm performance, although IT capabilities influence both at the same time.", "paper_title": "The effects of IT: from performance to value", "paper_id": "WOS:000330079500005"}