{"auto_keywords": [{"score": 0.04281989940407483, "phrase": "keyboard_users"}, {"score": 0.041712156789843864, "phrase": "mouse_users"}, {"score": 0.00481495049065317, "phrase": "mouse-driven_tasks"}, {"score": 0.004699778175535453, "phrase": "performance_change"}, {"score": 0.004518442937844318, "phrase": "spreadsheet_task"}, {"score": 0.004151188559520802, "phrase": "power_law"}, {"score": 0.003942877273973905, "phrase": "last_learning_session"}, {"score": 0.003503497128638099, "phrase": "reliable_differences"}, {"score": 0.003388639163205525, "phrase": "additional_practice"}, {"score": 0.0033579708256295847, "phrase": "mouse_group_users"}, {"score": 0.003160466312198169, "phrase": "paired_keyboard_group"}, {"score": 0.0030383422480050573, "phrase": "mouse-driven_graphical_user_interface"}, {"score": 0.0030017207229983385, "phrase": "keystroke-driven_interface"}, {"score": 0.002938688858078236, "phrase": "mouse-based_menu-driven_interface"}, {"score": 0.0024721971183379867, "phrase": "richer_explanation"}, {"score": 0.0021830553825770097, "phrase": "preliminary_suggestions"}, {"score": 0.0021632743048552536, "phrase": "optimal_training_strategies"}], "paper_keywords": [""], "paper_abstract": "We investigate performance change arising through learning, forgetting, and relearning. Participants learned a spreadsheet task with either keystroke-driven (keyboard, n = 30) or mouse-based menu-driven (mouse, n = 30) commands. Their performance confirmed the power law of practice. The keyboard users learned to complete the task faster than the mouse users on the last learning session (Day 4). At a 6-day retention interval, the mouse users were observed to forget more-they took more time to complete the task than the keyboard users. Of interest, the participants in the two modality groups showed no reliable differences in their forgetting under the retention of 12 and 18 days. With additional practice, the mouse group users with the 6-day retention relearned more-they reliably reduced the time to complete the task in comparison to the paired keyboard group. These results help understand why people may choose to use a mouse-driven graphical user interface rather than a keystroke-driven interface: People choosing to use a mouse-based menu-driven interface may not need to use a knowledge-in-the-head strategy but knowledge-in-the-world, and may be doing so because this strategy provides better relearning, rather than because it is faster or easier initially or because it is better for learning or forgetting. These results provide a richer explanation of why menu-driven interfaces (knowledge-in-the-world) are more ubiquitous and suggests when they can be replaced, for example, where use is infrequent but often enough that forgetting does not substantially occur. Our results provide preliminary suggestions for choosing optimal training strategies and supporting these strategies in terms of the three stages of learning and forgetting.", "paper_title": "Learning, Forgetting, and Relearning for Keystroke- and Mouse-Driven Tasks: Relearning Is Important", "paper_id": "WOS:000342504600001"}