{"auto_keywords": [{"score": 0.039246520904196544, "phrase": "optimization_process"}, {"score": 0.010612387000973441, "phrase": "time-adaptive_topology"}, {"score": 0.010043697336677952, "phrase": "feasible_regions"}, {"score": 0.006856783382030131, "phrase": "latter_stages"}, {"score": 0.0046834372388970405, "phrase": "constrained_optimization_problems"}, {"score": 0.004597754207658615, "phrase": "continuous_space"}, {"score": 0.004431041346291019, "phrase": "optimal_solution"}, {"score": 0.0038577428353448596, "phrase": "objective_value"}, {"score": 0.0036496814103475174, "phrase": "great_significance"}, {"score": 0.0034052594710793664, "phrase": "particle_swarm_optimization"}, {"score": 0.0032665093519968083, "phrase": "early_stages"}, {"score": 0.0030196181347744372, "phrase": "pso_variant"}, {"score": 0.0023305762840188145, "phrase": "hybrid_method"}, {"score": 0.0021344259291927914, "phrase": "standard_benchmark_constraint_optimization_problems"}], "paper_keywords": ["Particle swarm optimization", " Continuous space optimization", " Constrained optimization problems", " Disjoint feasible regions"], "paper_abstract": "For constrained optimization problems set in a continuous space, feasible regions might be disjointed and the optimal solution might be in any of these regions. Thus, locating these feasible regions (ideally all of them) as well as identifying the most promising region (in terms of objective value) at the end of the optimization process would be of a great significance. In this paper a time-adaptive topology is proposed that enables a variant of the particle swarm optimization (PSO) to locate many feasible regions at the early stages of the optimization process and to identify the most promising one at the latter stages of the optimization process. This PSO variant is combined with two local searches which improve the ability of the algorithm in both finding feasible regions and higher quality solutions. This method is further hybridized with covariance matrix adaptation evolutionary strategy (CMA-ES) to enhance its ability to improve the solutions at the latter stages of the optimization process. Results generated by this hybrid method are compared with the results of several other state-of-the-art methods in dealing with standard benchmark constraint optimization problems. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A hybrid particle swarm with a time-adaptive topology for constrained optimization", "paper_id": "WOS:000352743800003"}