{"auto_keywords": [{"score": 0.0423274728946326, "phrase": "serious_possibility"}, {"score": 0.01051190182757591, "phrase": "kyburg"}, {"score": 0.006297162180021723, "phrase": "inductively_accepted_statements"}, {"score": 0.0048333732522854575, "phrase": "inductive_acceptance"}, {"score": 0.00481495049065317, "phrase": "parmenidean"}, {"score": 0.004678681971460014, "phrase": "henry_kyburg"}, {"score": 0.004634117581810466, "phrase": "extralogical_and_extramathematical_propositions"}, {"score": 0.004267859190689581, "phrase": "modal_notions"}, {"score": 0.003838729434721053, "phrase": "unchanging_parmenidean_standard"}, {"score": 0.0037419150096899127, "phrase": "inductive_acceptances"}, {"score": 0.003578307035551443, "phrase": "critical_review"}, {"score": 0.0033461647738159826, "phrase": "henry's_emphasis"}, {"score": 0.0031091037560494806, "phrase": "full_belief"}, {"score": 0.0027012594843567445, "phrase": "teng"}, {"score": 0.002675477598833661, "phrase": "\"risky_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Serious possibility", " Parmenidean epistemology", " Acceptance as evidence", " Inductive acceptance", " Inductive rejection"], "paper_abstract": "According to Henry Kyburg, all extralogical and extramathematical propositions accepted as evidence and all propositions accepted inductively on the basis of such evidence are uncertain. There is a possibility of error. Consequently, neither the corpus of inductively accepted statements nor the corpus of statements accepted as evidence can serve as a standard for serious possibility in the sense I have deployed since the 1970s. The standard for serious possibility remains an unchanging Parmenidean standard. In contrast to other Parmenidean epistemologists that eschew inductive acceptances Kyburg insists that the corpus of evidence and of inductively accepted statements is subject to critical review and change; but the changes have no bearing on the standard for serious possibility. I have always agreed with Henry's emphasis on a distinction between acceptance as evidence and inductive acceptance. But I have insisted that the corpus of evidence or state of full belief is a standard for serious possibility and that the standard is subject to modification. Kyburg does think of acceptance as evidence and inductive acceptance as modal notions and has recently used the expression \"serious possibility\" in this connection. But when Kyburg and Teng speak of \"risky knowledge\", they are speaking of claims that might be false in the sense of serious possibility that they seem to be suggesting is immune to change and seems to correlate with serious possibility as I have used it since the 19705. So acceptance (both inductive and evidential) are modal notions subject to change but are not to be confused with the notion of serious possibility of error or riskiness. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Inductivism and Parmenidean epistemology: Kyburg's way", "paper_id": "WOS:000302980500003"}