{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "medical_image-based_tests"}, {"score": 0.004687305496643216, "phrase": "novel_technique"}, {"score": 0.00454772672262359, "phrase": "integrity_control"}, {"score": 0.0044870272550540415, "phrase": "tampered_areas"}, {"score": 0.004456980650437417, "phrase": "private_captioning"}, {"score": 0.004427134352966977, "phrase": "role-based_access_control"}, {"score": 0.004368037394395782, "phrase": "copyright_protection"}, {"score": 0.0036186222999811802, "phrase": "clinical_content"}, {"score": 0.0034638476252104706, "phrase": "collusion_attacks"}, {"score": 0.003406091279580424, "phrase": "substantial_capacity-robustness_tradeoff"}, {"score": 0.0032494292163722065, "phrase": "different_sizes"}, {"score": 0.003206002589892253, "phrase": "image_modifications"}, {"score": 0.0031419449938286663, "phrase": "medical_context"}, {"score": 0.0029973957125353306, "phrase": "good_scalability"}, {"score": 0.002878785759716458, "phrase": "standard_cryptographic_message_syntax"}, {"score": 0.0028498718992429825, "phrase": "keytagging_process"}, {"score": 0.0026376095791298413, "phrase": "corresponding_tags"}, {"score": 0.0026023381988430666, "phrase": "aforementioned_measures"}, {"score": 0.0023842683755691332, "phrase": "dicom"}, {"score": 0.00232090909020124, "phrase": "image_test"}, {"score": 0.0022744957687536307, "phrase": "secure_architectures"}, {"score": 0.002259231376607264, "phrase": "different_users"}, {"score": 0.0022365262201954643, "phrase": "e.g._physicians"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["DICOM", " Distortion", " Keytagging", " Privacy", " Security"], "paper_abstract": "This paper introduces keytagging, a novel technique to protect medical image-based tests by implementing image authentication, integrity control and location of tampered areas, private captioning with role-based access control, traceability and copyright protection. It relies on the association of tags (binary data strings) to stable, semistable or volatile features of the image, whose access keys (called keytags) depend on both the image and the tag content. Unlike watermarking, this technique can associate information to the most stable features of the image without distortion. Thus, this method preserves the clinical content of the image without the need for assessment, prevents eavesdropping and collusion attacks, and obtains a substantial capacity-robustness tradeoff with simple operations. The evaluation of this technique, involving images of different sizes from various acquisition modalities and image modifications that are typical in the medical context, demonstrates that all the aforementioned security measures can be implemented simultaneously and that the algorithm presents good scalability. In addition to this, keytags can be protected with standard Cryptographic Message Syntax and the keytagging process can be easily combined with JPEG2000 compression since both share the same wavelet transform. This reduces the delays for associating keytags and retrieving the corresponding tags to implement the aforementioned measures to only similar or equal to 230 and similar or equal to 90 ms respectively. As a result, keytags can be seamlessly integrated within DICOM, reducing delays and bandwidth when the image test is updated and shared in secure architectures where different users cooperate, e.g. physicians who interpret the test, clinicians caring for the patient and researchers. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Introducing keytagging, a novel technique for the protection of medical image-based tests", "paper_id": "WOS:000359752100002"}