{"auto_keywords": [{"score": 0.045092164493856016, "phrase": "imia"}, {"score": 0.008568642604425997, "phrase": "biomedical_informatics_education"}, {"score": 0.00481495049065317, "phrase": "imia's_international_activities"}, {"score": 0.004406994912939125, "phrase": "major_thematic_areas"}, {"score": 0.004084829853870028, "phrase": "possible_future_perspectives"}, {"score": 0.004050514095922329, "phrase": "imia's_role"}, {"score": 0.004016485454498076, "phrase": "biomedical_and_health_informatics_education"}, {"score": 0.003738502710504415, "phrase": "wider_discussion"}, {"score": 0.0037070855410818986, "phrase": "possible_future_activities"}, {"score": 0.0033218213825698417, "phrase": "nine_working_conferences"}, {"score": 0.0029890721584351684, "phrase": "high-quality_health_and_biomedical_informatics_education"}, {"score": 0.002914288956035066, "phrase": "health_and_medical_informatics"}, {"score": 0.0027937732927852646, "phrase": "revised_version"}, {"score": 0.0023003498123420237, "phrase": "international_accreditation"}, {"score": 0.002280990744438186, "phrase": "high-level_programs"}, {"score": 0.002261794227418188, "phrase": "health_and_biomedical_informatics"}], "paper_keywords": ["Medical informatics", " health informatics", " biomedical informatics", " education", " history", " IMIA"], "paper_abstract": "Background: Education has long been, and continues to be, one of the major thematic areas of the activities of IMIA, the International Medical Informatics Association. Objective: To report on !MIA's past activities and to discuss possible future perspectives on IMIA's role on biomedical and health informatics education. Methods: Summarizing past activities by searching in reports and publications. Making suggestions for wider discussion on possible future activities. Results: Since its inception, IMIA has been active in the field of education, mainly through its working group on education. Among other activities, nine working conferences have been held, many of which have resulted in publications as outcomes, which have helped to exchange knowledge on the development of high-quality health and biomedical informatics education. Recommendations on education in health and medical informatics were endorsed by IMIA in 1999, and a revised version is currently in preparation. Conclusions: IMIA should continue to stimulate the exchange of knowledge on a range of aspects of health and biomedical informatics education in the countries and regions of the world, with !MIA's academic institutional members playing an increasing role. Establishing procedures for the international accreditation of high-level programs in health and biomedical informatics through IMIA is one of several areas that need to be discussed as IMIA plans and develops its future activities.", "paper_title": "On IMIA's International Activities in Health and Biomedical Informatics Education", "paper_id": "WOS:000278818400013"}