{"auto_keywords": [{"score": 0.037448329479846526, "phrase": "differential_geometry"}, {"score": 0.00481495049065317, "phrase": "geometrical_descriptors"}, {"score": 0.004072573194988867, "phrase": "theoretical_background"}, {"score": 0.003735395342930914, "phrase": "matlab"}, {"score": 0.003370565320453525, "phrase": "geometrical_properties"}, {"score": 0.003334309053314909, "phrase": "facial_shape"}, {"score": 0.0031417377608722, "phrase": "fundamental_forms"}, {"score": 0.0028664427728838982, "phrase": "euclidean"}, {"score": 0.002789226820897593, "phrase": "nose_volume"}, {"score": 0.0027001292153471202, "phrase": "euclidean_distances"}, {"score": 0.0025717770066591076, "phrase": "final_score"}, {"score": 0.0024628046987344846, "phrase": "highest_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Face recognition", " Landmark", " Geometry", " 3D face", " Shape index", " Geodesic distance"], "paper_abstract": "In the last decades, several three-dimensional face recognition algorithms have been thought, designed, and assessed. What they have in common can be hardly said, as they differ in theoretical background, tools, and method. Here we propose a new 3D face recognition algorithm, entirely developed in Matlab (R), whose framework totally comes from differential geometry. First, 17 soft-tissue landmarks are automatically extracted relying on geometrical properties of facial shape. We made use of derivatives, coefficients of the fundamental forms, principal, mean, and Gaussian curvatures, and shape and curvedness indexes. Then, a set of geodesic and Euclidean distances, together with nose volume and ratios between geodesic and Euclidean distances, has been computed and summed in a final score, used to compare faces. The highest contribution of this work, we believe, is that its theoretical substratum is differential geometry with its various descriptors, which is something totally new in the field. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "3D face recognition: An automatic strategy based on geometrical descriptors and landmarks", "paper_id": "WOS:000344131000008"}