{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "expert_judgment"}, {"score": 0.004666598697538815, "phrase": "predict_software_development_effort._expert-based_effort_prediction"}, {"score": 0.004248294537944227, "phrase": "academic_environment"}, {"score": 0.0038431888954930083, "phrase": "major_concern"}, {"score": 0.0033905067962602515, "phrase": "academic_institutions"}, {"score": 0.0031845067058084583, "phrase": "already_tight_schedule"}, {"score": 0.0030097975788892896, "phrase": "personal_software_process"}, {"score": 0.0025409639091476363, "phrase": "graduate_courses"}, {"score": 0.0022273034991008326, "phrase": "original_psp_set"}, {"score": 0.0021049977753042253, "phrase": "expert-based_effort_prediction"}], "paper_keywords": ["Software development effort prediction", " expert judgment technique", " experimental design", " personal software process"], "paper_abstract": "Expert-based effort prediction in software projects can be taught, beginning with the practices learned in an academic environment in courses designed to encourage them. However, the length of such courses is a major concern for both industry and academia. Industry has to work without its employees while they are taking such a course, and academic institutions find it hard to fit the course into an already tight schedule. In this research, the set of Personal Software Process (PSP) practices is reordered and the practices are distributed among fewer assignments, in an attempt to address these concerns. This study involved 148 practitioners taking graduate courses who developed 1,036 software course assignments. The hypothesis on which it is based is the following: When the activities in the original PSP set are reordered into fewer assignments, the result is expert-based effort prediction that is statistically significantly better.", "paper_title": "APPLYING EXPERT JUDGMENT TO IMPROVE AN INDIVIDUAL'S ABILITY TO PREDICT SOFTWARE DEVELOPMENT EFFORT", "paper_id": "WOS:000307521500001"}