{"auto_keywords": [{"score": 0.05003965534696677, "phrase": "fully_proportional_representation"}, {"score": 0.04223675952890245, "phrase": "np"}, {"score": 0.0252530166475445, "phrase": "single-peaked_electorates"}, {"score": 0.004585341086943637, "phrase": "monroe"}, {"score": 0.004176813329075736, "phrase": "winner_determination_problem"}, {"score": 0.003754140294151593, "phrase": "proposed_rules"}, {"score": 0.0032852337992126564, "phrase": "maximal_misrepresentation"}, {"score": 0.0031845067058084583, "phrase": "general_case"}, {"score": 0.0031562971707460802, "phrase": "\"minimax\"_versions"}, {"score": 0.002952516738708181, "phrase": "parameterized_complexity"}, {"score": 0.0029263562233195423, "phrase": "winner_determination"}, {"score": 0.0027010719929751, "phrase": "positive_and_negative_results"}, {"score": 0.0022806798371116698, "phrase": "polynomial-time_algorithms"}, {"score": 0.0022304616068189575, "phrase": "considered_problems"}, {"score": 0.0021049977753042253, "phrase": "classical_monroe_rule"}], "paper_keywords": [""], "paper_abstract": "We investigate two systems of fully proportional representation suggested by Chamberlin & Courant and Monroe. Both systems assign a representative to each voter so that the \"sum of misrepresentations\" is minimized. The winner determination problem for both systems is known to be NP-hard, hence this work aims at investigating whether there are variants of the proposed rules and/or specific electorates for which these problems can be solved efficiently. As a variation of these rules, instead of minimizing the sum of misrepresentations, we considered minimizing the maximal misrepresentation introducing effectively two new rules. In the general case these \"minimax\" versions of classical rules appeared to be still NP-hard. We investigated the parameterized complexity of winner determination of the two classical and two new rules with respect to several parameters. Here we have a mixture of positive and negative results: e.g., we proved fixed-parameter tractability for the parameter the number of candidates but fixed-parameter intractability for the number of winners. For single-peaked electorates our results are overwhelmingly positive: we provide polynomial-time algorithms for most of the considered problems. The only rule that remains NP-hard for single-peaked electorates is the classical Monroe rule.", "paper_title": "On the Computation of Fully Proportional Representation", "paper_id": "WOS:000322107100001"}