{"auto_keywords": [{"score": 0.03776568475420409, "phrase": "six_possible_pairings"}, {"score": 0.0352748175348054, "phrase": "identifiable_errors"}, {"score": 0.00481495049065317, "phrase": "journal_impact_factor"}, {"score": 0.004611959213131437, "phrase": "journal_citation_indices"}, {"score": 0.00454027551702508, "phrase": "average_number"}, {"score": 0.00424779023663186, "phrase": "journal_impact_factor_index"}, {"score": 0.004214642195170688, "phrase": "eigenfactor"}, {"score": 0.0041167185402778425, "phrase": "scimago's_journal"}, {"score": 0.004052701031142039, "phrase": "scopus'_trend_line_index"}, {"score": 0.003491894048789576, "phrase": "spearman's_rho"}, {"score": 0.003279559293934528, "phrase": "random_selection"}, {"score": 0.0029040994533437903, "phrase": "paired_ratings"}, {"score": 0.002792375587031108, "phrase": "spearman's_rho_values"}, {"score": 0.002405549400304955, "phrase": "convergent_validity"}, {"score": 0.002331189621118592, "phrase": "average_citability"}], "paper_keywords": ["Bibliometric analysis", " Citation analysis", " Impact factor"], "paper_abstract": "To determine the degree of correlation among journal citation indices that reflect the average number of citations per article, the most recent journal ratings were downloaded from the websites publishing four journal citation indices: the Institute of Scientific Information's journal impact factor index, Eigenfactor's article influence index, SCImago's journal rank index and Scopus' trend line index. Correlations were determined for each pair of indices, using ratings from all journals that could be identified as having been rated on both indices. Correlations between the six possible pairings of the four indices were tested with Spearman's rho. Within each of the six possible pairings, the prevalence of identifiable errors was examined in a random selection of 10 journals and among the 10 most discordantly ranked journals on the two indices. The number of journals that could be matched within each pair of indices ranged from 1,857 to 6,508. Paired ratings for all journals showed strong to very strong correlations, with Spearman's rho values ranging from 0.61 to 0.89, all p < 0.001. Identifiable errors were more common among scores for journals that had very discordant ranks on a pair of indices. These four journal citation indices were significantly correlated, providing evidence of convergent validity (i.e. they reflect the same underlying construct of average citability per article in a journal). Discordance in the ranking of a journal on two indices was in some cases due to an error in one index.", "paper_title": "Correlation between the Journal Impact Factor and three other journal citation indices", "paper_id": "WOS:000280947400007"}