{"auto_keywords": [{"score": 0.03680499760277767, "phrase": "access_conflicts"}, {"score": 0.034182875683624124, "phrase": "register-._le_access_conflicts"}, {"score": 0.032455581223348254, "phrase": "previous_work"}, {"score": 0.00481495049065317, "phrase": "distributed_register-file_microarchitecture"}, {"score": 0.004790897109577809, "phrase": "distributed"}, {"score": 0.004658426838467567, "phrase": "multiple_uniform_blocks"}, {"score": 0.004553041361314872, "phrase": "dedicated_register"}, {"score": 0.004294381488413906, "phrase": "platform-featured_on-chip_memory_or_register-file_ip_blocks"}, {"score": 0.004154709762804989, "phrase": "drfm"}, {"score": 0.0038494167464062467, "phrase": "drfm_architecture"}, {"score": 0.003771849705803939, "phrase": "high-level_synthesis"}, {"score": 0.0036864465771943933, "phrase": "inter-island_connections"}, {"score": 0.003476846303757408, "phrase": "data_transfers"}, {"score": 0.0034067610079173754, "phrase": "design_complexity"}, {"score": 0.00337224813954299, "phrase": "long_interconnect_delay"}, {"score": 0.003279124049246641, "phrase": "additional_latency"}, {"score": 0.0032130115327855084, "phrase": "inter-island_data_transfers"}, {"score": 0.003156253963939272, "phrase": "novel_solutions"}, {"score": 0.002843329014225061, "phrase": "dfrm-int"}, {"score": 0.0028073483625634292, "phrase": "primary_importance"}, {"score": 0.0024715972867022963, "phrase": "destination_island"}, {"score": 0.0023728591503442476, "phrase": "efficient_technique"}, {"score": 0.0023487957441566624, "phrase": "extensive_design_space"}, {"score": 0.002278056507572604, "phrase": "near-optimal_solution"}, {"score": 0.0022492129111567824, "phrase": "proposed_synthesis_approach"}, {"score": 0.0021049977753042253, "phrase": "conventional_drfm_approach"}], "paper_keywords": [""], "paper_abstract": "Distributed register-file microarchitecture (DRFM), which comprises multiple uniform blocks (called islands), each containing a dedicated register. le, functional unit(s) and data-routing logic, has been known as a very attractive architecture for implementing designs with platform-featured on-chip memory or register-file IP blocks. In comparison with the discrete-register-based architecture, DRFM offers an opportunity of reducing the cost of global (inter-island) connections by con. ning as many of the computations to the inside of the islands as possible. Consequently, for DRFM architecture, two important problems to be solved effectively in high-level synthesis are: (problem 1) scheduling and resource binding for minimising inter-island connections (IICs) and (problem 2) data transfer (i.e. communication) scheduling through the IICs for minimising access conflicts among data transfers. By solving problem 1, the design complexity because of the long interconnect delay is minimised, whereas by solving problem 2, the additional latency required to resolve the register-. le access conflicts among the inter-island data transfers is minimised. This work proposes novel solutions to the two problems. Specifically, for problem 1, previous work solves it in two separate steps: (i) scheduling and (ii) then determining the IICs by resource binding to islands. However, in this algorithm called DFRM-int, the authors place primary importance on the cost of interconnections. Consequently, the authors minimise the cost of interconnections first to fully exploit the effects of scheduling on interconnects and then to schedule the operations later. For problem 2, previous work tries to solve the access conflicts by forwarding data directly to the destination island. However, in this algorithm called DFRM-com, the authors devise an efficient technique of exploring an extensive design space of data forwarding indirectly as well as directly to find a near-optimal solution. By applying this proposed synthesis approach DFRM-int + DFRM-com, the authors are able to further reduce the IICs by 17.9%, compared with that by the conventional DRFM approach, even completely eliminating register-. le access conflicts without any increase of latency.", "paper_title": "Interconnect and communication synthesis for distributed register-file microarchitecture", "paper_id": "WOS:000264048800002"}