{"auto_keywords": [{"score": 0.03202291876752855, "phrase": "fuzzy_statistical_convergence"}, {"score": 0.015599002431466464, "phrase": "statistical_convergence"}, {"score": 0.008713768692145006, "phrase": "fuzzy_statistical_limits"}, {"score": 0.007815975284176081, "phrase": "statistical_limits"}, {"score": 0.007665599689241616, "phrase": "conventional_convergence"}, {"score": 0.005703749523758611, "phrase": "fuzzy_convergence"}, {"score": 0.004630910803911567, "phrase": "series_summation"}, {"score": 0.0043509032299218955, "phrase": "main_statistical_characteristics"}, {"score": 0.004266907250334316, "phrase": "relaxing_conditions"}, {"score": 0.004184526032558792, "phrase": "main_idea"}, {"score": 0.003946766004066276, "phrase": "l_converge"}, {"score": 0.003580032420161922, "phrase": "real_life_sources"}, {"score": 0.003389704997952315, "phrase": "general_case"}, {"score": 0.003234615195382533, "phrase": "strict_mathematical_sense"}, {"score": 0.0030506626796257077, "phrase": "neoclassical_analysis"}, {"score": 0.002357535807803925, "phrase": "different_sequences"}, {"score": 0.002188874450946842, "phrase": "statistical_characteristics"}, {"score": 0.0021049977753042253, "phrase": "standard_deviation"}], "paper_keywords": ["Statistical convergence", " fuzzy sets", " fuzzy limits", " statistics", " mean", " standard deviation", " fuzzy convergence", " fuzzy density"], "paper_abstract": "Statistical convergence was introduced in connection with problems of series summation. Only later it was demonstrated that statistical convergence is closely related to convergence of the main statistical characteristics. Statistical limits are defined relaxing conditions on conventional convergence. The main idea of the statistical convergence of a sequence l is that the majority of elements from l converge and we do not care what is going on with other elements. At the same time, it is known that sequences that come from real life sources, such as measurement and computation, do not allow, in a general case, to test whether they converge or statistically converge in the strict mathematical sense. To overcome these limitations, fuzzy convergence was introduced earlier in the context of neoclassical analysis and fuzzy statistical convergence is introduced and studied in this paper. We find relations between fuzzy statistical convergence of a sequence and fuzzy statistical convergence of its subsequences (Theorem 2.1), as well as between fuzzy statistical convergence of a sequence and conventional convergence of its subsequences (Theorem 2.2). It is demonstrated what operations with fuzzy statistical limits are induced by operations on sequences (Theorem 2.3) and how fuzzy statistical limits of different sequences influence one another (Theorem 2.4). In Section 3, relations between fuzzy statistical convergence and fuzzy convergence of statistical characteristics, such as the mean (average) and standard deviation, are studied (Theorems 3.1 and 3.2).", "paper_title": "Properties of fuzzy statistical limits", "paper_id": "WOS:000261327100001"}