{"auto_keywords": [{"score": 0.04201675310221637, "phrase": "frequency_constraints"}, {"score": 0.00481495049065317, "phrase": "dynamic_constraints"}, {"score": 0.004750873844061641, "phrase": "particle_swarm_algorithm"}, {"score": 0.0046046429665581555, "phrase": "structural_truss_mass_optimization"}, {"score": 0.0044231966846655394, "phrase": "account_frequency_constraints"}, {"score": 0.004267896572751978, "phrase": "structural_optimizations"}, {"score": 0.004154995396099332, "phrase": "highly_non-linear_dynamic_optimization_problems"}, {"score": 0.0038338299812503, "phrase": "vibration_modes"}, {"score": 0.003732368382223596, "phrase": "shape_modifications"}, {"score": 0.0035532533960012298, "phrase": "particle_swarm_optimization"}, {"score": 0.0034437574674180365, "phrase": "optimization_engine"}, {"score": 0.003191636645925296, "phrase": "global_optimizer"}, {"score": 0.0027535633837592597, "phrase": "simple_objective_function_evaluation"}, {"score": 0.002354302193867031, "phrase": "related_literature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Particle swarm optimization", " Truss optimization", " Frequency constraints", " Shape and sizing optimization"], "paper_abstract": "In this paper, a structural truss mass optimization on size and shape is performed taking into account frequency constraints. It is well-known that structural optimizations on shape and size are highly non-linear dynamic optimization problems since this mass reduction conflicts with the frequency constraints especially when they are lower bounded. Besides, vibration modes may switch easily due to shape modifications. This paper intends to investigate the use of a particle swarm optimization (PSO) algorithm as an optimization engine in this type of problem. This choice is based on reported well-behavior of such algorithm as global optimizer in other areas of knowledge. Another feature of the algorithm is taken into account for this choice, like the fact that it is not gradient based, but just based on simple objective function evaluation. The algorithm is briefly revised highlighting its most important features. It is presented four examples regarding the optimization of trusses on shape and size with frequency constraints. The examples are widely reported and used in the related literature as benchmarks. The results show that the algorithm performed similar to other methods and even better in some cases. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Truss optimization with dynamic constraints using a particle swarm algorithm", "paper_id": "WOS:000282607800108"}