{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "simple_external_contextual_languages"}, {"score": 0.007278388085859694, "phrase": "one-one_hypothesis_space"}, {"score": 0.0045464538515249085, "phrase": "parameter_q"}, {"score": 0.0037188360359702182, "phrase": "adequate_choice"}, {"score": 0.0036553070575015344, "phrase": "hypothesis_space"}, {"score": 0.0034911335714333507, "phrase": "additional_constraints"}, {"score": 0.003221316290858497, "phrase": "iterative_learning_limits"}, {"score": 0.0031845067058084613, "phrase": "long_term_memory"}, {"score": 0.00307657476125683, "phrase": "current_hypothesis"}, {"score": 0.0023346234464901978, "phrase": "polynomial_time"}, {"score": 0.0021049977753042253, "phrase": "consistent_and_conservative_iterative_learner"}], "paper_keywords": ["Grammatical inference", " Mildly sontext-sensitive languages", " Simple external contextual grammars", " Iterative learning"], "paper_abstract": "It is investigated for which choice of a parameter q, denoting the number of contexts, the class of simple external contextual languages is iteratively learnable. On the one hand, the class admits, for all values of q, polynomial time learnability provided an adequate choice of the hypothesis space is given. On the other hand, additional constraints like consistency and conservativeness or the use of a one-one hypothesis space changes the picture iterative learning limits the long term memory of the learner to the current hypothesis and these constraints further hinder storage of information via padding of this hypothesis. It is shown that if q > 3, then simple external contextual languages are not iteratively learnable using a class preserving one-one hypothesis space, while for q = 1 it is iteratively learnable, even in polynomial time. It is also investigated for which choice of the parameters the simple external contextual languages can be learnt by a consistent and conservative iterative learner. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Iterative learning of simple external contextual languages", "paper_id": "WOS:000278954800009"}