{"auto_keywords": [{"score": 0.04277739174650543, "phrase": "new_method"}, {"score": 0.025428774804769103, "phrase": "discriminatory_weight"}, {"score": 0.015584544341692182, "phrase": "proposed_method"}, {"score": 0.01325413726569683, "phrase": "information_security_risk_analysis"}, {"score": 0.008122869354939988, "phrase": "total_target"}, {"score": 0.006476333382714445, "phrase": "fuzzy_sets"}, {"score": 0.0056922892037397236, "phrase": "membership_degrees"}, {"score": 0.005002685800847579, "phrase": "weighted-average_method"}, {"score": 0.00481495049065317, "phrase": "membership_degree"}, {"score": 0.004735859812954059, "phrase": "higher_classification_accuracy"}, {"score": 0.004703149944841539, "phrase": "risk_analysis_system"}, {"score": 0.004666460260366703, "phrase": "different_underlying_indices"}, {"score": 0.004611959213131437, "phrase": "different_roles"}, {"score": 0.00454027551702508, "phrase": "risk_scale"}, {"score": 0.003547084456662448, "phrase": "risk_scales"}, {"score": 0.0032539388572032563, "phrase": "discriminatory_weights"}, {"score": 0.00310435218261112, "phrase": "underlying_indices"}, {"score": 0.002727409429089543, "phrase": "comparative_analysis"}, {"score": 0.002340357706078868, "phrase": "membership_functions"}, {"score": 0.0021049977753042253, "phrase": "e-government_information_security_system"}], "paper_keywords": ["Risk analysis", " Information security", " Ecological environment assessment", " Membership degree and discriminatory weights"], "paper_abstract": "Purpose - In a risk analysis system, different underlying indices often play different roles in identifying the risk scale of the total target in a system, so a concept of discriminatory weight is introduced first. With the help of discriminatory weight and membership functions, a new method for information security risk analysis is proposed. The purpose of this paper is to discuss the above issues. Design/methodology/approach - First, a concept of discriminatory weight is introduced. Second, with the help of fuzzy sets, risk scales are captured in terms of fuzzy sets (namely their membership functions). Third, a new risk analysis method involving discriminatory weights is proposed to realize a transformation from the membership degrees of the underlying indices to the membership degrees of the total target. At last, an example of information security risk analysis shows the effectiveness and feasibleness of the new method. Findings - The new method generalizes the weighted-average method. The comparative analysis done with respect to other two methods show that the proposed method exhibits higher classification accuracy. Therefore, the proposed method can be applied to other risk analysis system with a hierarchial. Originality/value - This paper proposes a new method for information security risk analysis with the help of membership functions and the concept of discriminatory weight. The new method generalizes the weighted-average method. Comparative analysis done with respect to other two methods show that the proposed method exhibits higher classification accuracy in E-government information security system. What is more, the proposed method can be applied to other risk analysis system with a hierarchial.", "paper_title": "A new information security risk analysis method based on membership degree", "paper_id": "WOS:000341937600003"}