{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "weather_forecasting"}, {"score": 0.004750873844061641, "phrase": "online_dynamic_weather_forecaster"}, {"score": 0.0046046429665581555, "phrase": "high-school_and_college_instructors"}, {"score": 0.0039380388343479384, "phrase": "professional_weather_forecasters"}, {"score": 0.0038167308978417306, "phrase": "weather_parameters"}, {"score": 0.0035216195857272403, "phrase": "introductory_meteorology_course"}, {"score": 0.0030520148188164084, "phrase": "late_or_complete_a_low_number"}, {"score": 0.0028667159745494933, "phrase": "significant_predictors"}, {"score": 0.0024620949194512423, "phrase": "dwf"}, {"score": 0.002354302193867031, "phrase": "critical_part"}, {"score": 0.0023021895404322767, "phrase": "scientific_studies"}, {"score": 0.002251227801482381, "phrase": "sufficient_interest"}, {"score": 0.0022311596751824416, "phrase": "potential_users"}, {"score": 0.002201447066906397, "phrase": "usa"}, {"score": 0.0021720199689914464, "phrase": "dwf_platform"}, {"score": 0.0021049977753042253, "phrase": "global_weather_data"}], "paper_keywords": ["Weather forecasting", " Collaborative platform", " Education", " Introductory science learning"], "paper_abstract": "The online Dynamic Weather Forecaster is an open, collaborative application available now to high-school and college instructors across the United States who would like to easily incorporate weather forecasting in their instruction. The application consists of a set of 13 questions that allow students to submit forecasts that cover most of the parameters used by professional weather forecasters. Submissions are automatically validated against weather parameters and graded. We tested the impact of the application on the learning of 199 undergraduate students in an introductory meteorology course in spring 2008. Students who begin forecasting early in the semester and continue to do so throughout the semester are statistically significantly more successful in the course than students who start late or complete a low number of forecasts. College, year in school, and gender were not significant predictors of success. Students found the application easy to use, and 92.3% of them found it at least somewhat helpful as they learned about the weather. Through the use of the DWF, students also experience first-hand that uncertainty is a critical part of weather forecasting and of scientific studies in general. With sufficient interest from potential users outside the USA, the DWF platform could easily be expanded to include global weather data.", "paper_title": "Dynamic weather forecaster: results of the testing of a collaborative, on-line educational platform for weather forecasting", "paper_id": "WOS:000298228600003"}