{"auto_keywords": [{"score": 0.04737512004757469, "phrase": "clinicians'_decisions"}, {"score": 0.04182439831204787, "phrase": "picard_dss_engine"}, {"score": 0.030114597309745923, "phrase": "dss"}, {"score": 0.011473536885848032, "phrase": "non-dss_mode"}, {"score": 0.011198395826749677, "phrase": "dss_mode"}, {"score": 0.008415762815717178, "phrase": "redundant_actions"}, {"score": 0.004691556052059608, "phrase": "new_continuous-care_guideline"}, {"score": 0.004648861907086163, "phrase": "picard"}, {"score": 0.004515789121272748, "phrase": "established_clinical_gl"}, {"score": 0.004474589918526394, "phrase": "clinicians'_attitudes"}, {"score": 0.004454130853884631, "phrase": "specific_dss._methods"}, {"score": 0.0044000274998980664, "phrase": "different_training_levels"}, {"score": 0.004164547107930457, "phrase": "electronic_patient_records"}, {"score": 0.004132849719666783, "phrase": "longitudinal_course"}, {"score": 0.004120238139432163, "phrase": "six_different_clinical_scenarios"}, {"score": 0.0038699836459096817, "phrase": "main_measures"}, {"score": 0.003793841250080212, "phrase": "pet_gl._correctness"}, {"score": 0.003764954727546521, "phrase": "necessary_and_redundant_actions"}, {"score": 0.003719191371681396, "phrase": "actual_patient_data"}, {"score": 0.003590685692028408, "phrase": "dss._results"}, {"score": 0.003520019098756272, "phrase": "gl's_recommended_actions"}, {"score": 0.0034454657921835206, "phrase": "guideline's_recommended_actions"}, {"score": 0.0032509447650062888, "phrase": "patient's_data"}, {"score": 0.0031242541288560594, "phrase": "gl"}, {"score": 0.0030720678627958937, "phrase": "definite_errors"}, {"score": 0.0028633038881555697, "phrase": "dss-mode_decisions"}, {"score": 0.0027770076220198737, "phrase": "gl-based_dss"}, {"score": 0.0027181482250492424, "phrase": "particular_clinician"}, {"score": 0.002705698271431272, "phrase": "particular_clinical_scenario"}, {"score": 0.0026933051884209885, "phrase": "particular_decision_point"}, {"score": 0.0026768690967256697, "phrase": "decision_type"}, {"score": 0.002612119040917861, "phrase": "guideline-based_recommendations"}, {"score": 0.0025140604538393713, "phrase": "incorrect_actions"}, {"score": 0.0025025429391744235, "phrase": "redundancy_rate"}, {"score": 0.00248726808469366, "phrase": "similar_recent_findings"}, {"score": 0.0024796655687143168, "phrase": "recent_studies"}, {"score": 0.002472095249238183, "phrase": "clinicians"}, {"score": 0.002415973013765217, "phrase": "continuous-care_gl-based_dss"}, {"score": 0.002353912601736604, "phrase": "uniformly_high_quality"}, {"score": 0.002346716737567414, "phrase": "clinical_decision"}, {"score": 0.002325260554964941, "phrase": "gl-based_norm"}, {"score": 0.002304000094573908, "phrase": "increased_adherence"}, {"score": 0.0022379464329977316, "phrase": "therapy_costs"}, {"score": 0.0021938438473561943, "phrase": "clinical_errors"}, {"score": 0.0021572043329092135, "phrase": "additional_modules"}, {"score": 0.002144032802505012, "phrase": "automated_control"}, {"score": 0.0021244258260581365, "phrase": "physician's_actual_actions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Medical informatics", " Clinical decision support systems", " Therapy", " Computer-assisted", " protocol-directed", " Clinical guidelines", " Quantitative evaluation", " Preeclampsia/eclampsia"], "paper_abstract": "Objectives: To quantify the effect of a new continuous-care guideline (GL)-application engine, the Picard decision support system (DSS) engine, on the correctness and completeness of clinicians' decisions relative to an established clinical GL, and to assess the clinicians' attitudes towards a specific DSS. Methods: Thirty-six clinicians, including residents at different training levels and boardcertified specialists at an academic OB/GYN department that handles around 15,000 deliveries annually, agreed to evaluate our continuous-care guideline-based DSS and to perform a cross-over assessment of the effects of using our guideline-based DSS. We generated electronic patient records that realistically simulated the longitudinal course of six different clinical scenarios of the preeclampsia/eclampsia/toxemia (PET) GL, encompassing 60 different decision points in total. Each clinician managed three scenarios manually without the Picard DSS engine (Non-DSS mode) and three scenarios when assisted by the Picard DSS engine (DSS mode). The main measures in both modes were correctness and completeness of actions relative to the PET GL. Correctness was further decomposed into necessary and redundant actions, relative to the guideline and the actual patient data. At the end of the assessment, a questionnaire was administered to the clinicians to assess their perceptions regarding use of the DSS. Results: With respect to completeness, the clinicians applied approximately 41% of the GL's recommended actions in the non-DSS mode. Completeness increased to the performance of approximately 93% of the guideline's recommended actions, when using the DSS mode. With respect to correctness, approximately 94.5% of the clinicians' decisions in the non-DSS mode were correct. However, these included 68% of the actions that were correct but redundant, given the patient's data (e.g., repeating tests that had been performed), and 27% of the actions, which were necessary in the context of the GL and of the given scenario. Only 5.5% of the decisions were definite errors. In the DSS mode, 94% of the clinicians' decisions were correct, which included 3% that were correct but redundant, and 91% of the actions that were correct and necessary in the context of the GL and of the given scenario. Only 6% of the DSS-mode decisions were erroneous. The DSS was assessed by the clinicians as potentially useful. Discussion: Support from the GL-based DSS led to uniformity in the quality of the decisions, regardless of the particular clinician, any particular clinical scenario, any particular decision point, or any decision type within the scenarios. Using the DSS dramatically enhances completeness (i.e., performance of guideline-based recommendations) and seems to prevent the performance of most of the redundant actions, but does not seem to affect the rate of performance of incorrect actions. The redundancy rate is enhanced by similar recent findings in recent studies. Clinicians mostly find this support to be potentially useful for their daily practice. Conclusion: A continuous-care GL-based DSS, such as the Picard DSS engine, has the potential to prevent most errors of omission by ensuring uniformly high quality of clinical decision making (relative to a GL-based norm), due to the increased adherence (i.e., completeness) to the GL, and most of the errors of commission that increase therapy costs, by reducing the rate of redundant actions. However, to prevent clinical errors of commission, the DSS needs to be accompanied by additional modules, such as automated control of the quality of the physician's actual actions. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A multiple-scenario assessment of the effect of a continuous-care, guideline-based decision support system on clinicians' compliance to clinical guidelines", "paper_id": "WOS:000349471500004"}