{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single_publication_h_index"}, {"score": 0.049460287006492736, "phrase": "related_performance_measures"}, {"score": 0.022641445907242177, "phrase": "web_application"}, {"score": 0.010142569934406025, "phrase": "google_scholar_data"}, {"score": 0.004310795753210459, "phrase": "schubert"}, {"score": 0.004227398267369744, "phrase": "h_index"}, {"score": 0.0027862576750944277, "phrase": "google_scholar"}, {"score": 0.0025266963982350523, "phrase": "citation_performance"}, {"score": 0.002398274973378986, "phrase": "authors'_knowledge"}, {"score": 0.0023213398100616132, "phrase": "first_instrument"}, {"score": 0.0021049977753042253, "phrase": "new_service"}], "paper_keywords": ["Publications", " Indexing", " Computer applications", " Search engines"], "paper_abstract": "Purpose - The single publication h index has been introduced by Schubert as the h index calculated from the list of citing publications of one single publication. This paper aims to look at the calculation of the single publication h index and related performance measures. Design/methodology/approach - In this paper a web application is presented where the single publication h index and related performance measures (the single publication m index, h(2) lower, h(2) centre, and h(2) upper) can be automatically calculated for any publication indexed by Google Scholar. Findings - The use of the application is demonstrated by means of the citation performance of two publications. Originality/value - To the authors' knowledge this web application is the first instrument to automatically calculate the single publication h index and related performance measures based on Google Scholar data. This is a new service especially from the perspective of the related performance measures.", "paper_title": "The calculation of the single publication h index and related performance measures A web application based on Google Scholar data", "paper_id": "WOS:000291177000007"}