{"auto_keywords": [{"score": 0.02322730111336099, "phrase": "supply_chain_digitization"}, {"score": 0.010240040083641513, "phrase": "strategic_risk"}, {"score": 0.009631577334238124, "phrase": "decision_rights"}, {"score": 0.008651718620701705, "phrase": "mediated-moderation_model"}, {"score": 0.0072335096722387915, "phrase": "operational_and_strategic_benefits"}, {"score": 0.004692980391580608, "phrase": "theoretical_lenses"}, {"score": 0.002895620643297197, "phrase": "knowledge_creation_capability"}, {"score": 0.00248167018931442, "phrase": "decision_allocation"}, {"score": 0.002456272788591051, "phrase": "technical_knowledge"}, {"score": 0.002262209824105154, "phrase": "effect_of_governance-knowledge_fit"}, {"score": 0.0021709933368474223, "phrase": "knowledge_type"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Strategic risk taking", " Governance-knowledge fit", " IT governance", " Supply chain digitization"], "paper_abstract": "Drawing upon the theoretical lenses of strategic risk taking and governance-knowledge fit, this study examines how decision rights and knowledge of the IT unit may support the firm to benefit from strategic risk taking in supply chain digitization. We build a mediated-moderation model to theorize that the fit between decision rights and knowledge of the IT unit drives the firm to strategically take risk in digitizing its supply chain, and such strategic risk taking enables the firm to realize both operational and strategic benefits. Our empirical study provides support to the mediated-moderation model. Specifically, we find that when allocated with more decision rights, the IT unit with more business knowledge and knowledge creation capability drives the firm to conduct more strategic risk taking in supply chain digitization, which in turn results in operational and strategic benefits to the firm. However, we also find that the fit between decision allocation and technical knowledge of the IT unit does not significantly lead to strategic risk taking, suggesting that the effect of governance-knowledge fit on strategic risk taking is contingent on knowledge type. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Governance-knowledge fit and strategic risk taking in supply chain digitization", "paper_id": "WOS:000336825900006"}