{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ideal_artificial_moral_agents"}, {"score": 0.04424509811035144, "phrase": "ideal_moral_agent"}, {"score": 0.0426766154078814, "phrase": "recent_account"}, {"score": 0.030270034779874375, "phrase": "moral_behavior"}, {"score": 0.004696598537952219, "phrase": "humans"}, {"score": 0.004637478829869904, "phrase": "growing_field"}, {"score": 0.004598933498016774, "phrase": "machine_morality"}, {"score": 0.004429388453288922, "phrase": "artificial_moral_agents"}, {"score": 0.0038271712887391015, "phrase": "prospective_framework"}, {"score": 0.003376369479008885, "phrase": "artificial_moral_agent"}, {"score": 0.003092690568543981, "phrase": "dynamic_and_interactive_integration"}, {"score": 0.0024883835349005863, "phrase": "dynamic_and_interactive_connectionist_model"}, {"score": 0.00241658945942583, "phrase": "limited_accounts"}, {"score": 0.0023079225317714815, "phrase": "robotic_moral_capacities"}, {"score": 0.0022601535748259785, "phrase": "moral_agent"}, {"score": 0.002158505888557746, "phrase": "exemplar_situations"}, {"score": 0.0021049977753042253, "phrase": "popular_film"}], "paper_keywords": ["Machine morality", " Moral agency", " Heroism", " Connectionism", " Affordances", " Character strengths"], "paper_abstract": "The growing field of machine morality has becoming increasingly concerned with how to develop artificial moral agents. However, there is little consensus on what constitutes an ideal moral agent let alone an artificial one. Leveraging a recent account of heroism in humans, the aim of this paper is to provide a prospective framework for conceptualizing, and in turn designing ideal artificial moral agents, namely those that would be considered heroic robots. First, an overview of what it means to be an artificial moral agent is provided. Then, an overview of a recent account of heroism that seeks to define the construct as the dynamic and interactive integration of character strengths (e.g., bravery and integrity) and situational constraints that afford the opportunity for moral behavior (i.e., moral affordances). With this as a foundation, a discussion is provided for what it might mean for a robot to be an ideal moral agent by proposing a dynamic and interactive connectionist model of robotic heroism. Given the limited accounts of robots engaging in moral behavior, a case for extending robotic moral capacities beyond just being a moral agent to the level of heroism is supported by drawing from exemplar situations where robots demonstrate heroism in popular film and fiction.", "paper_title": "A Prospective Framework for the Design of Ideal Artificial Moral Agents: Insights from the Science of Heroism in Humans", "paper_id": "WOS:000350992600004"}