{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "derivative_cytotoxicity_activity"}, {"score": 0.004518442937844318, "phrase": "wide_range"}, {"score": 0.004461359547152617, "phrase": "significant_pharmacological_activities"}, {"score": 0.004081385289516914, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.0034154440860550564, "phrase": "best_models"}, {"score": 0.0033295966773779174, "phrase": "merely_two_dimensional_descriptors"}, {"score": 0.0030457198309616694, "phrase": "optimal_five_molecular_descriptor_model"}, {"score": 0.002468450551616404, "phrase": "acquired_model"}, {"score": 0.0022578275190855124, "phrase": "chemical_structures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Chalcones", " Anticancer", " Cytotoxicity", " MCF-7 breast cancer cells", " QSAR", " Enhanced Replacement Method"], "paper_abstract": "Chalcones and their derivatives possess a wide range of significant pharmacological activities; among the most important ones is their anticancer activity. For this reason we performed a Quantitative Structure-Activity Relationships (QSAR) study of their anticancer activity against MCF-7 human breast cancer cell lines. In this work, several descriptor options were tested on the dataset containing 93 molecular structures, using ERM (Enhanced Replacement Method). The best models were found using merely two dimensional descriptors. The two dimensional descriptor pool was further expanded using several nonlinear transformations, which resulted in an optimal five molecular descriptor model that showed very good predictive ability. Thus, ERM was capable of finding a simple to interpret and understand model that nonetheless addresses nonlinearities between the descriptors and the activity. Furthermore, the acquired model is very straightforward to use since it does not require the optimization of chemical structures for the calculation of three dimensional descriptors. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Chalcone derivative cytotoxicity activity against MCF-7 human breast cancer cell QSAR study", "paper_id": "WOS:000360595100041"}