{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intensity_classification"}, {"score": 0.004646654984830476, "phrase": "common_linguistic_constructions"}, {"score": 0.0045557008859819234, "phrase": "emotional_meaning"}, {"score": 0.004327429667024575, "phrase": "sentiment_analysis"}, {"score": 0.004192653260742387, "phrase": "polarity_shifter"}, {"score": 0.0037087324991876727, "phrase": "modal_forms"}, {"score": 0.003650488388949457, "phrase": "polarity_blockers"}, {"score": 0.003536720212056521, "phrase": "mere_polarity_modifiers"}, {"score": 0.0034674164050273568, "phrase": "polarity_classification"}, {"score": 0.0027778413437997635, "phrase": "sentiment_analysis_tasks"}, {"score": 0.0026594033724490172, "phrase": "polar_expressions"}, {"score": 0.0025059724686541263, "phrase": "different_classification_tasks"}, {"score": 0.002278639906498682, "phrase": "opinionated_texts"}, {"score": 0.002155656133617155, "phrase": "joint_effect"}, {"score": 0.002138636271204459, "phrase": "emotional_modifiers"}, {"score": 0.0021049977753042253, "phrase": "interesting_synergies"}], "paper_keywords": ["natural language processing", " text mining"], "paper_abstract": "Negation, intensifiers, and modality are common linguistic constructions that may modify the emotional meaning of the text and therefore need to be taken into consideration in sentiment analysis. Negation is usually considered as a polarity shifter, whereas intensifiers are regarded as amplifiers or diminishers of the strength of such polarity. Modality, in turn, has only been addressed in a very naive fashion, so that modal forms are treated as polarity blockers. However, processing these constructions as mere polarity modifiers may be adequate for polarity classification, but it is not enough for more complex tasks (e.g., intensity classification), for which a more fine-grained model based on emotions is needed. In this work, we study the effect of modifiers on the emotions affected by them and propose a model of negation, intensifiers, and modality especially conceived for sentiment analysis tasks. We compare our emotion-based strategy with two traditional approaches based on polar expressions and find that representing the text as a set of emotions increases accuracy in different classification tasks and that this representation allows for a more accurate modeling of modifiers that results in further classification improvements. We also study the most common uses of modifiers in opinionated texts and quantify their impact in polarity and intensity classification. Finally, we analyze the joint effect of emotional modifiers and find that interesting synergies exist between them.", "paper_title": "An emotion-based model of negation, intensifiers, and modality for polarity and intensity classification", "paper_id": "WOS:000321743500008"}