{"auto_keywords": [{"score": 0.03247973049287251, "phrase": "existing_research"}, {"score": 0.014066087408062694, "phrase": "oss"}, {"score": 0.00481495049065317, "phrase": "open_source_software"}, {"score": 0.004789272640417375, "phrase": "software-intensive_organizations"}, {"score": 0.004101088357088207, "phrase": "software_development"}, {"score": 0.003929219628225874, "phrase": "systematic_literature_review_method"}, {"score": 0.0038563012220659827, "phrase": "seven_conference"}, {"score": 0.0038357160878153087, "phrase": "workshop_proceedings"}, {"score": 0.0036749275625321855, "phrase": "empirical_evidence"}, {"score": 0.003616378612191807, "phrase": "oss._results"}, {"score": 0.00350205447167804, "phrase": "oss_products"}, {"score": 0.003446250208907207, "phrase": "classification_framework"}, {"score": 0.003418681280929931, "phrase": "six_distinctly_different_ways"}, {"score": 0.00337322138761553, "phrase": "oss."}, {"score": 0.003129553139991608, "phrase": "different_ways"}, {"score": 0.003014381456564809, "phrase": "oss_adoption"}, {"score": 0.0028648071422593506, "phrase": "related_research_fields"}, {"score": 0.0028191285111793126, "phrase": "large_number"}, {"score": 0.002693611989967953, "phrase": "future_research"}, {"score": 0.002419829872751895, "phrase": "success_stories"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open source software", " Organizations", " Software development", " Systematic literature review"], "paper_abstract": "Context: Open source software (OSS) is changing the way organizations develop, acquire, use, and commercialize software. Objective: This paper seeks to identify how organizations adopt OSS, classify the literature according to these ways of adopting OSS, and with a focus on software development evaluate the research on adoption of OSS in organizations. Method: Based on the systematic literature review method we reviewed publications from 24 journals and seven conference and workshop proceedings, published between 1998 and 2008. From a population of 24,289 papers, we identified 112 papers that provide empirical evidence on how organizations actually adopt OSS. Results: We show that adopting OSS involves more than simply using OSS products. We moreover provide a classification framework consisting of six distinctly different ways in which organizations adopt OSS. This framework is used to illustrate some of the opportunities and challenges organizations meet when approaching OSS, to show that OSS can be adopted successfully in different ways, and to organize and review existing research. We find that existing research on OSS adoption does not sufficiently describe the context of the organizations studied, and it fails to benefit fully from related research fields. While existing research covers a large number of topics, it contains very few closely related studies. To aid this situation, we offer directions for future research. Conclusion: The implications of our findings are twofold. On the one hand, practitioners should embrace the many opportunities OSS offers, but consciously evaluate the consequences of adopting it in their own context. They may use our framework and the success stories provided by the literature in their own evaluations. On the other hand, researchers should align their work, and perform more empirical research on topics that are important to organizations. Our framework may be used to position this research and to describe the context of the organization they are studying. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Adoption of open source software in software-intensive organizations - A systematic literature review", "paper_id": "WOS:000282905700001"}