{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "clock_skew_management"}, {"score": 0.004721893473387288, "phrase": "effective_clock-skew_scheduling_scheme"}, {"score": 0.004630626571109149, "phrase": "high-level_synthesis_process"}, {"score": 0.004310752197635499, "phrase": "proposed_scheme"}, {"score": 0.003986844722309844, "phrase": "clock_phases"}, {"score": 0.0038843558517333327, "phrase": "optimization_goals"}, {"score": 0.003663250792230243, "phrase": "high-level_synthesis"}, {"score": 0.0035458802311188497, "phrase": "previous_studies"}, {"score": 0.0033658327434624457, "phrase": "timing_violation"}, {"score": 0.0026104197983396367, "phrase": "available_skews"}, {"score": 0.0024939618994290016, "phrase": "clock-skew_scheduling"}, {"score": 0.0022468671200629024, "phrase": "proposed_method"}], "paper_keywords": ["Clock-skew scheduling", " high-level synthesis", " low-power design"], "paper_abstract": "An effective clock-skew scheduling scheme in the high-level synthesis process targeted for power and speed optimization is presented. The proposed scheme has the following distinctive features: 1) a clock-skew management algorithm that selects a minimum set of clock phases to achieve the optimization goals is developed; 2) the effect of module binding in high-level synthesis was not considered in previous studies, which may lead to designs with timing violation; a discussion on how to model the effect of module binding is provided; 3) a heuristic low-power module binding algorithm that provides near-optimal results quickly is proposed; and 4) a technique called reallocation is proposed to exploit all available skews and thus maximize the capability of clock-skew scheduling. Experimental results show that, on the average, 48% power reduction is achieved by the proposed method. At most five clock phases are required, while in most cases two to four clock phases are sufficient.", "paper_title": "Power-Aware High-Level Synthesis With Clock Skew Management", "paper_id": "WOS:000299560300017"}