{"auto_keywords": [{"score": 0.03923307184680597, "phrase": "iris_recognition_research"}, {"score": 0.015719716506582538, "phrase": "iris_recognition"}, {"score": 0.0046037124365759215, "phrase": "person_identification"}, {"score": 0.00440170067770959, "phrase": "biometric_recognition"}, {"score": 0.004271953920234395, "phrase": "immutable_and_unique_characteristics"}, {"score": 0.004130535674260505, "phrase": "utmost_importance"}, {"score": 0.0038041680562514064, "phrase": "comprehensive_overview"}, {"score": 0.003691969158027291, "phrase": "bibliometric_approach"}, {"score": 0.0035965032173588753, "phrase": "historical_records"}, {"score": 0.003569681826459428, "phrase": "basic_concepts"}, {"score": 0.003543059748318891, "phrase": "current_progress"}, {"score": 0.003287599002792037, "phrase": "english"}, {"score": 0.0032265235111547217, "phrase": "scopus"}, {"score": 0.003154836091281154, "phrase": "information_retrieval"}, {"score": 0.0030275252142439213, "phrase": "significant_bibliometric_indicators"}, {"score": 0.002916238693326477, "phrase": "particular_field"}, {"score": 0.002788066194685293, "phrase": "temporal_evolution"}, {"score": 0.0025578967205807843, "phrase": "research_topics"}, {"score": 0.0022688546528208133, "phrase": "major_advances"}, {"score": 0.002218404456227325, "phrase": "promising_new_avenues"}, {"score": 0.0021049977753042253, "phrase": "future_investigators"}], "paper_keywords": ["Iris biometrics", " Iris recognition", " Bibliometric study"], "paper_abstract": "Person identification based on iris recognition is getting more and more attention among the modalities used for biometric recognition. This fact is due to the immutable and unique characteristics of the iris. Therefore it is of utmost importance for researchers interested in this discipline to know who and what is relevant in this area. This paper presents a comprehensive overview of the field of iris recognition research using a bibliometric approach. Besides, this article provides historical records, basic concepts, current progress and trends in the field. With this purpose in mind, our bibliometric study is based on 1,354 documents written in English, published between 2000 and 2012. Scopus was used to perform the information retrieval. In the course of this study, we synthesized significant bibliometric indicators on iris recognition research in order to evaluate to what extent this particular field has been explored. Thereby, we focus on foundations, temporal evolution, leading authors, most cited papers, significant conventions, leading journals, outstanding research topics and enterprises and patents. Research topics are classified into three main categories: ongoing, emerging, and decreasing according to their corresponding number of publications over the period under study. An analysis of these indicators suggests there has been major advances in iris recognition research and also reveals promising new avenues worthy of investigation in the future. This study will be useful to future investigators in the field.", "paper_title": "An overview of iris recognition: a bibliometric analysis of the period 2000-2012", "paper_id": "WOS:000345136000023"}