{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_perspectives"}, {"score": 0.004769444094319619, "phrase": "research_methods"}, {"score": 0.004462663711734448, "phrase": "multiple_fields"}, {"score": 0.0036379729015583975, "phrase": "interactive_systems"}, {"score": 0.0034037221513153566, "phrase": "understanding_multitasking"}, {"score": 0.0029793675408245047, "phrase": "integrative_approach"}, {"score": 0.0027741761880779535, "phrase": "special_issue"}, {"score": 0.002326304140277375, "phrase": "different_techniques"}, {"score": 0.0022715929119140194, "phrase": "six-point_research_agenda"}, {"score": 0.0022181655497912796, "phrase": "multi-method_research"}, {"score": 0.002186712881521657, "phrase": "important_and_timely_topic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multitasking", " Interruptions", " Experimental methods", " Meta-analyses", " Interdisciplinary research", " Quantified self", " Individual differences", " Models", " Theory", " Practice"], "paper_abstract": "Multitasking and interruptions have been studied using a variety of methods in multiple fields (e.g., HCI, cognitive science, computer science, and social sciences). This diversity brings many complementary insights. However, it also challenges researchers to understand how seemingly disparate ideas can best be integrated to further theory and to inform the design of interactive systems. There is therefore a need for a platform to discuss how different approaches to understanding multitasking and interruptions can be combined to provide insights that are more than the sum of their parts. In this article we argue for the necessity of an integrative approach. As part of this argument we provide an overview of articles in this special issue on multitasking and interruptions. These articles showcase the variety of methods currently used to study multitasking and interruptions. It is clear that there are many challenges to studying multitasking and interruptions from different perspectives and using different techniques. We advance a six-point research agenda for the future of multi-method research on this important and timely topic. (C) 2015 Published by Elsevier Ltd.", "paper_title": "Integrating knowledge of multitasking and interruptions across different perspectives and research methods", "paper_id": "WOS:000355048100001"}