{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wikipedia"}, {"score": 0.01048159767057184, "phrase": "dbpedia_community_project"}, {"score": 0.008703268709471797, "phrase": "dbpedia_knowledge_bases"}, {"score": 0.004486800020569973, "phrase": "semantic_web"}, {"score": 0.004449688143230257, "phrase": "linked_data_technologies"}, {"score": 0.004233347974930148, "phrase": "largest_dbpedia_knowledge_base"}, {"score": 0.004129138311177554, "phrase": "english_edition"}, {"score": 0.003690932048206039, "phrase": "dbpedia"}, {"score": 0.003645192746918234, "phrase": "wikipedia_infoboxes"}, {"score": 0.003570218982072853, "phrase": "single_shared_ontology"}, {"score": 0.0033824008297657494, "phrase": "world-wide_crowd-sourcing_effort"}, {"score": 0.0032990689963715127, "phrase": "different_wikipedia_editions"}, {"score": 0.0030867203659106727, "phrase": "sparql_query_access"}, {"score": 0.0029733203800202303, "phrase": "global_network"}, {"score": 0.002948689937518561, "phrase": "local_dbpedia_chapters"}, {"score": 0.0028760125558659907, "phrase": "regular_releases"}, {"score": 0.002805121439110729, "phrase": "live_knowledge_base"}, {"score": 0.0027133032795773697, "phrase": "wikipedia_changes"}, {"score": 0.002496659907186784, "phrase": "dbpedia_data"}, {"score": 0.002424984362388813, "phrase": "rdf_links"}, {"score": 0.002316476356455291, "phrase": "central_interlinking_hubs"}, {"score": 0.0021225958499898182, "phrase": "technical_implementation"}], "paper_keywords": ["Knowledge extraction", " Wikipedia", " multilingual knowledge bases", " Linked Data", " RDF"], "paper_abstract": "The DBpedia community project extracts structured, multilingual knowledge from Wikipedia and makes it freely available on the Web using Semantic Web and Linked Data technologies. The project extracts knowledge from 111 different language editions of Wikipedia. The largest DBpedia knowledge base which is extracted from the English edition of Wikipedia consists of over 400 million facts that describe 3.7 million things. The DBpedia knowledge bases that are extracted from the other 110Wikipedia editions together consist of 1.46 billion facts and describe 10 million additional things. The DBpedia project maps Wikipedia infoboxes from 27 different language editions to a single shared ontology consisting of 320 classes and 1,650 properties. The mappings are created via a world-wide crowd-sourcing effort and enable knowledge from the different Wikipedia editions to be combined. The project publishes releases of all DBpedia knowledge bases for download and provides SPARQL query access to 14 out of the 111 language editions via a global network of local DBpedia chapters. In addition to the regular releases, the project maintains a live knowledge base which is updated whenever a page in Wikipedia changes. DBpedia sets 27 million RDF links pointing into over 30 external data sources and thus enables data from these sources to be used together with DBpedia data. Several hundred data sets on the Web publish RDF links pointing to DBpedia themselves and make DBpedia one of the central interlinking hubs in the Linked Open Data (LOD) cloud. In this system report, we give an overview of the DBpedia community project, including its architecture, technical implementation, maintenance, internationalisation, usage statistics and applications.", "paper_title": "DBpedia - A large-scale, multilingual knowledge base extracted from Wikipedia", "paper_id": "WOS:000357874100009"}