{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "peer-to-peer_systems"}, {"score": 0.004676173016967478, "phrase": "distributed_storage"}, {"score": 0.004362326712297089, "phrase": "participating_peers"}, {"score": 0.004175006647851034, "phrase": "huge_savings"}, {"score": 0.003541182515693916, "phrase": "central_authority"}, {"score": 0.003476963781647026, "phrase": "well-defined_structure"}, {"score": 0.0033397385936467204, "phrase": "active_collaboration"}, {"score": 0.0031497178007011666, "phrase": "broader_participation"}, {"score": 0.0030925761790620027, "phrase": "overall_better_service"}, {"score": 0.00291657701018444, "phrase": "particular_class"}, {"score": 0.0028014064098604093, "phrase": "malicious_coordinated_behavior"}, {"score": 0.002710557619357275, "phrase": "undeserved_benefits"}, {"score": 0.0024915167458844914, "phrase": "specific_attention"}, {"score": 0.002175594509651082, "phrase": "full_fledged_services"}, {"score": 0.0021518035978153878, "phrase": "future_internet"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-peer networks", " Security", " Collusion", " Game theory"], "paper_abstract": "P2P systems are used to provide distributed storage, file sharing, video streaming, distributed gaming, and other applications based on the collaboration of participating peers and on the observation that sharing resources used sporadically leads to huge savings. The operation of a P2P system, as well as its sheer survival, however, is open to many kinds of attacks, which are tough to fight due to both the decentralized nature of P2P applications, and the lack, in some of them, of a central authority, or of a well-defined structure, or both. Particularly, as P2P systems require the active collaboration of the participants beyond their selfish interest, many systems include methods designed to lure the most resourceful users into broader participation, to provide an overall better service. The methods devised to attract the contribution of users are unfortunately vulnerable to a particular class of attacks: collusion. Collusion is broadly defined as any malicious coordinated behavior of a group of users aimed at gaining undeserved benefits, or at damaging (some) well behaved users. In this paper, we survey the literature on P2P systems security with specific attention to collusion, to find out how they resist to such attacks and what solutions can be used, e.g., game theory, to further counter this problem and give P2P systems the possibility of developing into full fledged services of the future Internet. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Collusion in peer-to-peer systems", "paper_id": "WOS:000295435500021"}