{"auto_keywords": [{"score": 0.042720840945861746, "phrase": "particular_cases"}, {"score": 0.03517083259120442, "phrase": "linear_compartmental_systems"}, {"score": 0.00481495049065317, "phrase": "multicompartmental_linear_systems"}, {"score": 0.004538045400396629, "phrase": "general_kinetic_equations"}, {"score": 0.004327981760540394, "phrase": "particular_values"}, {"score": 0.00421410521089045, "phrase": "system_matrix"}, {"score": 0.003936461984681817, "phrase": "specific_linear_compartmental_systems"}, {"score": 0.0035066948004186076, "phrase": "remaining_non-null_eigenvalues"}, {"score": 0.0034031532701778375, "phrase": "k"}, {"score": 0.0033641042076609645, "phrase": "special_properties"}, {"score": 0.0031422859551159506, "phrase": "linear_multicompartmental_systems"}, {"score": 0.0030868583963299698, "phrase": "particular_solutions"}, {"score": 0.003032405563826263, "phrase": "biological_interest"}, {"score": 0.002515384834484012, "phrase": "complex_systems"}, {"score": 0.002356380755825062, "phrase": "simple_examples"}, {"score": 0.002314783782656802, "phrase": "matrix_determinant"}, {"score": 0.002253757988526137, "phrase": "determinant_concept"}, {"score": 0.0021049977753042253, "phrase": "well_known_vandermonde's_determinant"}], "paper_keywords": [""], "paper_abstract": "We analyze the simplification of the general kinetic equations in contribution I of this series and their use when the restrictions corresponding to some particular values of the multiplicities of the eigenvalues of the system matrix and/or some properties of this matrix are considered. The particular cases we have studied are the most frequent in the literature about specific linear compartmental systems, namely: (a) all the eigenvalues of the matrix K (see below) are simple; (b) because K is singular there is a null-eigenvalue of any multiplicity, being simple the remaining non-null eigenvalues; (c) as in (b), but K having some special properties frequent in linear compartmental systems that will be analyzed when this case is treated. To any of these particular cases fit most of the linear multicompartmental systems. As example, these particular solutions are applied to three enzymatic systems of biological interest which can be modeled as linear compartmental systems belonging to the cases (a)-(c): 1) autocatalytic activation of a zymogen; 2) non- autocatalytic activation of a zymogen; and 3) reversible, competitive inhibition. Obviously, the power and utility of the equations obtained here for each of the three cases is revealed when they are applied to complex systems. However, and without loss of generality of the procedures, it is easier its illustration when they are applied to simple examples. Finally, we handle matrix determinant (MD) which is a generalization of determinant concept, where the elements of one of its columns are matrix so that the determinant is also a matrix. We generalize the well known Vandermonde's determinant and some other types of determinants.", "paper_title": "A Novel Procedure to Analyse the Kinetics of Multicompartmental Linear Systems. II. Application to the Study of Some Well-known Systems", "paper_id": "WOS:000310398600006"}