{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "differential_evolution"}, {"score": 0.004765482708043842, "phrase": "role_assignment_scheme"}, {"score": 0.004320055598195391, "phrase": "wide_range"}, {"score": 0.004275650416511604, "phrase": "real-world_problems"}, {"score": 0.004060350364088702, "phrase": "chosen_mutation_strategy_and_control_parameter_settings"}, {"score": 0.0039772848945723435, "phrase": "conventional_trial-and-error_procedure"}, {"score": 0.003816197777388722, "phrase": "proper_strategy"}, {"score": 0.0037188360359702182, "phrase": "parameter_values"}, {"score": 0.0033883824438527316, "phrase": "priori_experience"}, {"score": 0.0032176163279340206, "phrase": "novel_role_assignment"}, {"score": 0.003184622764838732, "phrase": "ra"}, {"score": 0.0030239842475439814, "phrase": "ra_scheme"}, {"score": 0.0024842242921857705, "phrase": "different_role"}, {"score": 0.002445950676329976, "phrase": "evolution_process"}], "paper_keywords": ["Differential evolution", " Mutation strategy", " Control parameter settings", " Role assignment scheme"], "paper_abstract": "As one of the most popular evolutionary algorithms, differential evolution (DE) has been used for solving a wide range of real-world problems. The performance of DE highly depends on the chosen mutation strategy and control parameter settings. Although the conventional trial-and-error procedure can be used to elaborately select the proper strategy and to tune the parameter values, this procedure is often very time-consuming and is not suitable for practitioners without a priori experience. To tackle this problem, DE with a novel role assignment (RA) scheme is proposed in this paper. In the RA scheme, both the fitness information and positional information of individuals are utilized to dynamically divide the population into several groups. Each group is considered as a role, which has its own mutation strategy and parameter settings and is expected to play a different role in the evolution process. To verify the performance of our approach, experiments are conducted on 23 well-known benchmark functions. Results show that our approach is better than, or at least comparable to, several state-of-the-art DE variants.", "paper_title": "Enhancing differential evolution with role assignment scheme", "paper_id": "WOS:000343889900011"}