{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_libraries"}, {"score": 0.027025367750998983, "phrase": "social_media"}, {"score": 0.005477631335376442, "phrase": "different_types"}, {"score": 0.005398862440863276, "phrase": "social_media_applications"}, {"score": 0.004630133446223147, "phrase": "digital_librarians"}, {"score": 0.004543708337879809, "phrase": "related_problems"}, {"score": 0.0044524122425287005, "phrase": "ten_institutions"}, {"score": 0.0035714167992018666, "phrase": "selected_digital_libraries"}, {"score": 0.0031431690368229443, "phrase": "two-way_communication_channels"}, {"score": 0.0030888830649190282, "phrase": "education_functions"}, {"score": 0.0028642417249023877, "phrase": "north_america"}, {"score": 0.002847673373183256, "phrase": "europe"}, {"score": 0.0027822459052173113, "phrase": "in-depth_content_analysis"}, {"score": 0.002640507929183363, "phrase": "specific_social_media_tools"}, {"score": 0.0026100308217245514, "phrase": "twitter"}, {"score": 0.0025948946256075336, "phrase": "facebook"}, {"score": 0.0025059724686541263, "phrase": "fully_the_reason"}, {"score": 0.002357632753637638, "phrase": "cultural_institutions"}, {"score": 0.0021860555252905876, "phrase": "current_status"}, {"score": 0.0021607883988873492, "phrase": "social_media_application"}, {"score": 0.0021049977753042253, "phrase": "good_use"}], "paper_keywords": ["Social media", " Twitter", " Digital libraries", " Facebook", " Blogs"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the applications of social media in digital libraries and identify related problems. Design/methodology/approach - A total of ten institutions were selected from the following cultural institution types - public libraries, academic libraries, museums, government, and international organisations - to represent a variety of digital libraries developed or sponsored by different types of organisations. The social media applications were examined with regard to the following aspects: types of social media, placement of social media, updating social media, types of interactions, and types of functions. Findings - This study presents the types of social media applications in the selected digital libraries and further characterises their placements, update frequency, types of interactions between digital librarians and users, as well as various types of roles they played. In the process of analysis the authors also identified problems related to lack of standards, creating two-way communication channels, and the lack of education functions. Research limitations/implications - Further research needs to expand the selection of institutions and digital libraries to have more representative sampling, in particular institutions that are outside North America and Europe. It is also important to perform in-depth content analysis of social media to identify patterns and functions that social media perform. Moreover the authors will compare specific social media tools, such as Twitter, Facebook, etc., across institutions. In order to explore fully the reason why certain social media tools are implemented in digital libraries, it is important to survey or interview digital librarians of digital libraries in different types of cultural institutions. In addition users can be interviewed to solicit their perspectives about their usage of social media in digital libraries. Originality/value - This study not only examines the current status and problems of social media application in digital libraries but also offers suggestions on making good use of social media to connect users and digital libraries.", "paper_title": "Social media application in digital libraries", "paper_id": "WOS:000342001700004"}