{"auto_keywords": [{"score": 0.04271945823526699, "phrase": "complete_system"}, {"score": 0.00481495049065317, "phrase": "general_meta-model"}, {"score": 0.004799906530847408, "phrase": "based_co-simulations"}, {"score": 0.004755054742217193, "phrase": "mechanical_systems"}, {"score": 0.004710620078577185, "phrase": "fully_functional_meta-model_co-simulation_environment"}, {"score": 0.004452558960552103, "phrase": "continuously_increasing_performance"}, {"score": 0.004424768776701965, "phrase": "modern_computer_systems"}, {"score": 0.004383406949799696, "phrase": "large_influence"}, {"score": 0.0043560464825349275, "phrase": "simulation_technologies"}, {"score": 0.004182301599359094, "phrase": "different_parts"}, {"score": 0.0035204268675160257, "phrase": "simulation_models"}, {"score": 0.003401148484767927, "phrase": "different_simulation_models"}, {"score": 0.0032551474344211582, "phrase": "existing_simulation_models"}, {"score": 0.003134986603941304, "phrase": "existing_co-simulation_applications"}, {"score": 0.003047776993499616, "phrase": "unique_interface"}, {"score": 0.0029077697480480013, "phrase": "co-simulation_modelling"}, {"score": 0.0028715299874549245, "phrase": "wider_range"}, {"score": 0.002680114113899346, "phrase": "larger_group"}, {"score": 0.0026384167183586015, "phrase": "presented_approach"}, {"score": 0.00262191949451482, "phrase": "mechanical_system"}, {"score": 0.0025730425700096365, "phrase": "general_framework"}, {"score": 0.0023493172499168763, "phrase": "meta-model_simulator"}, {"score": 0.0022696277881969896, "phrase": "simulation_tools"}, {"score": 0.002172093645267283, "phrase": "numerically_stable_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Co-simulation", " Meta-modelling", " Multibody simulation", " Mechanical system simulation", " Transmission-line modelling", " TLM", " Dynamic simulation", " Transient simulation"], "paper_abstract": "A fully functional meta-model co-simulation environment that supports integration of many different simulation tool specific models into a co-simulation is described in this paper. The continuously increasing performance of modern computer systems has a large influence on simulation technologies. It results in more and more detailed simulation models. Different simulation models typically focus on different parts (sub-systems) of the complete system, e.g., the gearbox of a car, the driveline, or even a single bearing inside the gearbox. To fully understand the complete system it is necessary to investigate several or all parts simultaneously. This is especially true for transient (dynamic) simulation models with several interconnected parts. One solution for a more complete and accurate system analysis is to couple different simulation models into one coherent simulation, also called a co-simulation. This also allows existing simulation models to be reused and preserves the investment in these models. Existing co-simulation applications are often capable of interconnecting two specific simulators where a unique interface between these tools is defined. However, a more general solution is needed to make co-simulation modelling applicable for a wider range of tools. Any such solution must also be numerically stable and easy to use in order to be functional for a larger group of people. The presented approach for mechanical system co-simulations is based upon a general framework for co-simulation and meta-modelling [9]. Several tool specific simulation models can be integrated and connected by means of a meta-model. A platform independent, centralised, meta-model simulator is presented that executes and monitors the co-simulation. All simulation tools that participate in the co-simulation implement a single, well defined, external interface that is based on a numerically stable method for force/moment interaction. (C) 2008 Published by Elsevier B.V.", "paper_title": "General meta-model based co-simulations applied to mechanical systems", "paper_id": "WOS:000265314100004"}