{"auto_keywords": [{"score": 0.0495290999002817, "phrase": "multicluster_grid_systems"}, {"score": 0.015719716506582538, "phrase": "processor_coallocation"}, {"score": 0.0046240999614456605, "phrase": "parallel_applications"}, {"score": 0.004240116703465252, "phrase": "multiple_clusters"}, {"score": 0.003933118499284644, "phrase": "single_cluster"}, {"score": 0.003777088546146369, "phrase": "execution_time"}, {"score": 0.0036482665232275583, "phrase": "relatively_slow_wide-area_communication"}, {"score": 0.0030492472433481764, "phrase": "real_multicluster_grid_environment"}, {"score": 0.0029281780903782284, "phrase": "simulated_environment"}, {"score": 0.002418923027024191, "phrase": "scheduling_policies"}, {"score": 0.0022176487309947266, "phrase": "resource_selection_phase"}, {"score": 0.0021049977753042253, "phrase": "communication-intensive_parallel_applications"}], "paper_keywords": ["Coallocation", " grid", " multicluster", " parallel job scheduling"], "paper_abstract": "In multicluster grid systems, parallel applications may benefit from processor coallocation, that is, the simultaneous allocation of processors in multiple clusters. Although coallocation allows the allocation of more processors than available in a single cluster, it may severely increase the execution time of applications due to the relatively slow wide-area communication. The aim of this paper is to investigate the benefit of coallocation in multicluster grid systems, despite this drawback. To this end, we have conducted experiments in a real multicluster grid environment, as well as in a simulated environment, and we evaluate the performance of coallocation for various applications that range from computation-intensive to communication-intensive and for various system load settings. In addition, we compare the performance of scheduling policies that are specifically designed for coallocation. We demonstrate that considering latency in the resource selection phase improves the performance of coallocation, especially for communication-intensive parallel applications.", "paper_title": "On the Benefit of Processor Coallocation in Multicluster Grid Systems", "paper_id": "WOS:000276899800004"}