{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wikipedia"}, {"score": 0.01970159157633542, "phrase": "academic_publishing"}, {"score": 0.007451328907791726, "phrase": "academic_community"}, {"score": 0.0061668783211679505, "phrase": "open_access_journal_model"}, {"score": 0.0040996651541091575, "phrase": "wikipedia_structures"}, {"score": 0.003920476803132283, "phrase": "peer-reviewed_article"}, {"score": 0.0030520148188164084, "phrase": "wider_variety"}, {"score": 0.0028411768240129585, "phrase": "web_site_structure"}, {"score": 0.0027659126653647712, "phrase": "academic_publications"}, {"score": 0.0026686444508167875, "phrase": "common_academic_search_engines"}, {"score": 0.0026330549554033876, "phrase": "google_scholar"}, {"score": 0.00259793885118959, "phrase": "university_libraries"}, {"score": 0.0024401411219526774, "phrase": "site's_credibility"}, {"score": 0.0023125191783901367, "phrase": "fundamental_idea"}, {"score": 0.0022311596751824416, "phrase": "academic_knowledge"}, {"score": 0.002181766829493483, "phrase": "valuable_resource"}, {"score": 0.0021334650920198715, "phrase": "academic_innovation"}, {"score": 0.0021049977753042253, "phrase": "research_librarians"}], "paper_keywords": ["Wikipedia", " Academic publishing", " Open access", " Peer review", " Electronic publishing", " Open systems"], "paper_abstract": "Purpose - The purpose of this paper is to explore the potential of Wikipedia as a venue for academic publishing. Design/methodology/approach - By looking at other sources and studying Wikipedia structures, the paper compares the processes of publishing a peer-reviewed article in Wikipedia and the open access journal model, discusses the advantages and challenges. of adopting Wikipedia in academic publishing, and provides suggestions on how to address the challenges. Findings - Compared to an open access journal model, Wikipedia has several advantages for academic publishing: it is less expensive, quicker, more widely read, and offers a wider variety of articles. There are also several major challenges in adopting Wikipedia in the academic community: the web site structure is not well suited to academic publications; the site is not integrated with common academic search engines such as Google Scholar or with university libraries; and there are concerns among some members of the academic community about the site's credibility and impact in academia. Originality/value - This paper promotes a fundamental idea for adjusting methods of creating and disseminating academic knowledge. It is a valuable resource for those interested in academic innovation, for research librarians, and for the academic community in general. This topic has not been sufficiently addressed in the literature.", "paper_title": "Wikipedia for academic publishing: advantages and challenges", "paper_id": "WOS:000307202100003"}