{"auto_keywords": [{"score": 0.03240362152223585, "phrase": "csg_users"}, {"score": 0.014718422836311152, "phrase": "radio_resources"}, {"score": 0.013172192314624118, "phrase": "femtocell_subscriber"}, {"score": 0.00481495049065317, "phrase": "radio_resource_sharing_among_users"}, {"score": 0.004781357546476652, "phrase": "hybrid_access_femtocells"}, {"score": 0.004229847379280629, "phrase": "closed_subscriber_group"}, {"score": 0.003929843413153981, "phrase": "closed_access"}, {"score": 0.0037680315431235472, "phrase": "csg"}, {"score": 0.003415812499773905, "phrase": "open_access_mode"}, {"score": 0.0028765701985514294, "phrase": "hybrid_access"}, {"score": 0.002738723329538679, "phrase": "new_approach"}, {"score": 0.0026443135597866924, "phrase": "common_cases"}, {"score": 0.002380120876826732, "phrase": "simulation_results"}, {"score": 0.0023469450817019, "phrase": "proposed_resource_sharing_scheme"}, {"score": 0.0022660100755784057, "phrase": "granted_bitrates"}, {"score": 0.0021801944769738618, "phrase": "non-csg_users"}, {"score": 0.0021049977753042253, "phrase": "conventional_sharing_schemes"}], "paper_keywords": ["Femtocells", " hybrid access", " radio resource sharing", " admission", " closed subscriber group"], "paper_abstract": "A problem related to deployment of femtocells is how to manage access of users to radio resources. On one hand, all resources of the femtocell can be reserved for users belonging to a closed subscriber group (CSG), which is a set of users defined by a femtocell subscriber. This approach, known as closed access, however, increases interference to users not included in the CSG as those users do not have a permission to access this femtocell. Contrary, resources can be shared by all users with no priority in an open access mode. In this case, the femtocell subscriber shares radio as well as backhaul resources with all other users. Thus, throughput and quality of service of the subscriber and the CSG users can be deteriorated. To satisfy both the CSG as well as non-CSG users, a hybrid access is seen as a compromise. In this paper, we propose a new approach for sharing radio resources among all users. As in common cases, the CSG users have a priority for usage of a part of resources while rest of the resources is shared by all users proportionally to their requirements. As the simulation results show, the proposed resource sharing scheme significantly improves throughput of the CSG users and their satisfaction with granted bitrates. At the same time, throughput and satisfaction of the non-CSG users is still guaranteed roughly at the same level as if conventional sharing schemes are applied.", "paper_title": "Radio Resource Sharing Among Users in Hybrid Access Femtocells", "paper_id": "WOS:000345333200001"}