{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_grid"}, {"score": 0.004756233569671719, "phrase": "innovative_energy_network"}, {"score": 0.004659951478263083, "phrase": "conventional_electrical_grid_network"}, {"score": 0.004329124434198367, "phrase": "new_capabilities"}, {"score": 0.004293840838533456, "phrase": "advanced_data"}, {"score": 0.004189698902282913, "phrase": "networking_technology"}, {"score": 0.004121672175779706, "phrase": "significant_role"}, {"score": 0.003892126266260425, "phrase": "flexible_and_efficient_framework"}, {"score": 0.003797690272118125, "phrase": "timely_and_accurate_information"}, {"score": 0.0037207397635410327, "phrase": "power_grid"}, {"score": 0.0036753171449945654, "phrase": "continuous_and_reliable_operation"}, {"score": 0.0035423376631308567, "phrase": "sensor_data_collection"}, {"score": 0.00347054319869429, "phrase": "networking_issues"}, {"score": 0.0030818310926031024, "phrase": "corresponding_sensors"}, {"score": 0.0029100272315053253, "phrase": "communication_technologies"}, {"score": 0.0028744731986533076, "phrase": "data_communication_network_architecture"}, {"score": 0.0027477745788313163, "phrase": "different_emerging_techniques"}, {"score": 0.002370794661629904, "phrase": "standardization_activities"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["smart grid", " sensor data collection and sensing"], "paper_abstract": "The smart grid is an innovative energy network that will improve the conventional electrical grid network to be more reliable, cooperative, responsive, and economical. Within the context of the new capabilities, advanced data sensing, communication, and networking technology will play a significant role in shaping the future of the smart grid. The smart grid will require a flexible and efficient framework to ensure the collection of timely and accurate information from various locations in power grid to provide continuous and reliable operation. This article presents a tutorial on the sensor data collection, communications, and networking issues for the smart grid. First, the applications of data sensing in the smart grid are reviewed. Then, the requirements for data sensing and collection, the corresponding sensors and actuators, and the communication and networking architecture are discussed. The communication technologies and the data communication network architecture and protocols for the smart grid are described. Next, different emerging techniques for data sensing, communications, and sensor data networking are reviewed. The issues related to security of data sensing and communications in the smart grid are then discussed. To this end, the standardization activities and use cases related to data sensing and communications in the smart grid are summarized. Finally, several open issues and challenges are outlined. Copyright (C) 2012 John Wiley & Sons, Ltd.", "paper_title": "Smart grid sensor data collection, communication, and networking: a tutorial", "paper_id": "WOS:000339100100004"}