{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rapid_perception"}, {"score": 0.004767546015485477, "phrase": "low-resolution_image_information"}, {"score": 0.004605258779434384, "phrase": "mobile_robot_exploration"}, {"score": 0.0045599093158915326, "phrase": "unknown_indoor_environments"}, {"score": 0.004254671386496732, "phrase": "downsampled_grayscale_images"}, {"score": 0.004069280130346136, "phrase": "indoor_exploration"}, {"score": 0.004029187256595917, "phrase": "visual_information"}, {"score": 0.003911253966141701, "phrase": "successful_navigation"}, {"score": 0.0037967593942595233, "phrase": "available_data"}, {"score": 0.003114283314285167, "phrase": "five_complementary_measures"}, {"score": 0.003053159610975692, "phrase": "estimated_distance"}, {"score": 0.0026839922027139967, "phrase": "combined_system"}, {"score": 0.0025924443774713473, "phrase": "wide_variety"}, {"score": 0.0024916260764216752, "phrase": "low-resolution_visual_information"}], "paper_keywords": ["Low-resolution vision", " Autonomous exploration", " Computer vision"], "paper_abstract": "We present a technique for mobile robot exploration in unknown indoor environments using only a single forward-facing camera. Rather than processing all the data, the method intermittently examines only small 32x24 downsampled grayscale images. We show that for the task of indoor exploration the visual information is highly redundant, allowing successful navigation even using only a small fraction of the available data. The method keeps the robot centered in the corridor by estimating two state parameters: the orientation within the corridor, and the distance to the end of the corridor. The orientation is determined by combining the results of five complementary measures, while the estimated distance to the end combines the results of three complementary measures. These measures, which are predominantly information-theoretic, are analyzed independently, and the combined system is tested in several unknown corridor buildings exhibiting a wide variety of appearances, showing the sufficiency of low-resolution visual information for mobile robot exploration. Because the algorithm discards such a large percentage of the pixels both spatially and temporally, processing occurs at an average of 1000 frames per second, thus freeing the processor for other concurrent tasks.", "paper_title": "Autonomous exploration using rapid perception of low-resolution image information", "paper_id": "WOS:000299515700002"}