{"auto_keywords": [{"score": 0.04075929340836016, "phrase": "ws_transactions"}, {"score": 0.005936511406403714, "phrase": "proposed_criteria"}, {"score": 0.004888329683321802, "phrase": "test_efforts"}, {"score": 0.00481495049065317, "phrase": "testing_web_services_transactions"}, {"score": 0.00453113241842654, "phrase": "distributed_and_autonomous_services"}, {"score": 0.004494570360108983, "phrase": "composite_web_services"}, {"score": 0.004161553532799662, "phrase": "longer_processing_time"}, {"score": 0.004094639048362357, "phrase": "critical_data"}, {"score": 0.003916098498242888, "phrase": "quality_assessment"}, {"score": 0.003822003373331997, "phrase": "response_time_efficiency"}, {"score": 0.003791141540467091, "phrase": "failure_recovery"}, {"score": 0.0036553070575015344, "phrase": "testing_aspect"}, {"score": 0.003370565320453525, "phrase": "multi-dimensional_criteria"}, {"score": 0.002537216271965659, "phrase": "case_study"}, {"score": 0.002320449502337321, "phrase": "test_cases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Web services", " Transactions", " Software testing", " Test case generation", " Mutation", " Classification-tree"], "paper_abstract": "Web services (WS) transactions are important in order to reliably compose distributed and autonomous services into composite web services and to ensure that their execution is consistent and correct. But such transactions are generally complex and they require longer processing time, and manipulate critical data. Thus various techniques have been developed in order to perform quality assessment of WS transactions in terms of response time efficiency, failure recovery and throughput. This paper focuses on the testing aspect of WS transactions - another key quality issue that has not been examined in the literature. Accordingly it proposes multi-dimensional criteria for testing the WS transactions. The proposed criteria have the potential to capture the behaviour of WS transactions and to analyse and classify the possible (failure) situations that effect the execution of such transactions. These criteria are used to generate various test cases and to provide (WS transactions) tester with flexibility of adjusting the method in terms of test efforts and effectiveness. The proposed criteria have been designed, implemented and evaluated through a case study and a number of experiments have been performed. The evaluation shows that these criteria have the capability to effectively generate test cases for testing WS transactions as well as enable tester to decide on the trade-off between test efforts and the quality. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Multi-dimensional criteria for testing web services transactions", "paper_id": "WOS:000320351400005"}