{"auto_keywords": [{"score": 0.045295231966276564, "phrase": "self-care_technologies"}, {"score": 0.043616210216916376, "phrase": "individual_use"}, {"score": 0.035620716932052585, "phrase": "self-care_technology"}, {"score": 0.00481495049065317, "phrase": "chronic_condition"}, {"score": 0.004721162131188487, "phrase": "collaborative_activity"}, {"score": 0.004007083686875716, "phrase": "case_study"}, {"score": 0.003877737556673229, "phrase": "parkinson's_disease"}, {"score": 0.0028108690791085536, "phrase": "qualitative_study"}, {"score": 0.002480961181275199, "phrase": "parkinson's_collaborate"}, {"score": 0.0023850311572318496, "phrase": "good_life"}, {"score": 0.0022480304016499605, "phrase": "complex_interplay"}, {"score": 0.0021049977753042253, "phrase": "different_self-care_activities"}], "paper_keywords": [""], "paper_abstract": "The self-management of a chronic condition is a collaborative activity, performed by patients and carers. However, to date, self-care technologies have been mostly designed for individual use. This article uses a case study of people living with Parkinson's disease to (a) illustrate how patients and carers collaborate in self-management, (b) discuss the reasons why self-care technology is designed for individual use, and (c) explore the implications of recognizing collaborations for the design of self-care technologies. This work is based on a qualitative study with interviews and observations with people living with Parkinson's. The analysis illustrates how people living with Parkinson's collaborate in self-care to build a good life. In particular, it exemplifies how the complex interplay of actions and of patients and carers enables the different self-care activities to take place. To further integrate self-care technology in everyday life, designers need to consider collaborations when studying the context, conceptualizing a technology, and planning an evaluation.", "paper_title": "Self-Care Technologies and Collaboration", "paper_id": "WOS:000366419600002"}