{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "auditory_temporal_assimilation"}, {"score": 0.004693167092003573, "phrase": "gaussian_na"}, {"score": 0.0046038458731764926, "phrase": "bayes_classifiers"}, {"score": 0.003133844153806967, "phrase": "subjective_equality"}, {"score": 0.0028830690329478465, "phrase": "principal_component_scores"}, {"score": 0.0028463059289874637, "phrase": "individual_average_erp_waveforms"}, {"score": 0.002535779689260244, "phrase": "chernoff_information"}, {"score": 0.0023029886389559122, "phrase": "early_pre-decision_stage"}, {"score": 0.0021876814398268775, "phrase": "simple_and_useful_neural_decoding_scheme"}, {"score": 0.0021049977753042253, "phrase": "temporal_patterns"}], "paper_keywords": ["Naive Bayes classifier", " Principal component analysis", " Chernoff information", " Time perception", " Event related potential"], "paper_abstract": "By constructing Gaussian Na < ve Bayes Classifiers, we have re-analyzed data from an earlier event-related potential (ERP) study of an illusion in time perception known as auditory temporal assimilation. In auditory temporal assimilation, two neighboring physically unequal time intervals marked by three successive tone bursts are illusorily perceived as equal if the two time intervals satisfy a certain relationship. The classifiers could discriminate whether or not the subject was engaged in the task, which was judgment of the subjective equality between the two intervals, at an accuracy of > 79%, and from principal component scores of individual average ERP waveforms, we were able to predict their subjective judgments to each stimulus at an accuracy of > 70%. Chernoff information, unlike accuracy or Kullback-Leibler (KL) distance, suggested brain activation associated with auditory temporal assimilation at an early pre-decision stage. This may provide us with a simple and useful neural decoding scheme in analyzing information processing of temporal patterns in the brain.", "paper_title": "A neural decoding approach to auditory temporal assimilation", "paper_id": "WOS:000294910400006"}