{"auto_keywords": [{"score": 0.04337967727002325, "phrase": "perceived_risk"}, {"score": 0.017895194332051223, "phrase": "web_site_quality"}, {"score": 0.010751135122345197, "phrase": "web_site_brand"}, {"score": 0.00775790743495479, "phrase": "online_retailer"}, {"score": 0.007187186058340693, "phrase": "consumers'_trust"}, {"score": 0.006376460366751398, "phrase": "non-recursive_model"}, {"score": 0.00481495049065317, "phrase": "online_store_environment_cues"}, {"score": 0.004782977628406988, "phrase": "purchase_intention_trust"}, {"score": 0.00448958076531243, "phrase": "online_environment_cues"}, {"score": 0.004327981760540394, "phrase": "customer_purchase_intention"}, {"score": 0.004233586004353442, "phrase": "web_site"}, {"score": 0.0041721750101390825, "phrase": "customer_trust"}, {"score": 0.0038642157757169315, "phrase": "online_shopping_environment"}, {"score": 0.0037624955853577786, "phrase": "research_framework"}, {"score": 0.0036269721030245507, "phrase": "stimulus-organism-response_framework"}, {"score": 0.003449972561293443, "phrase": "measurement_scales"}, {"score": 0.003427032390942116, "phrase": "empirical_analyses"}, {"score": 0.003381607100127276, "phrase": "structural_equation_modelling"}, {"score": 0.003173898798475791, "phrase": "consumer_purchase_intention"}, {"score": 0.0029988599391845517, "phrase": "customers'_purchase_intention"}, {"score": 0.002446359075737738, "phrase": "research_model"}, {"score": 0.002430076037416881, "phrase": "practical_implications"}, {"score": 0.002421975107313603, "phrase": "-_online_retailers"}, {"score": 0.0021049977753042253, "phrase": "purchase_intention"}], "paper_keywords": ["Worldwide web", " Internet", " Trust", " Buying behaviour", " Risk analysis"], "paper_abstract": "Purpose - The purpose of this paper is to investige whether online environment cues (web site quality and web site brand) affect customer purchase intention towards an online retailer and whether this impact is mediated by customer trust and perceived risk. The study also aimed to assess the degree of reciprocity between consumers' trust and perceived risk in the context of an online shopping environment. Design/methodology/approach - The study proposed a research framework for testing the relationships among the constructs based on the stimulus-organism-response framework. In addition, this study developed a non-recursive model. After the validation of measurement scales, empirical analyses were performed using structural equation modelling. Findings - The findings confirm that web site quality and web site brand affect consumers' trust and perceived risk, and in turn, consumer purchase intention. Notably, this study finds that the web site brand is a more important cue than web site quality in influencing customers' purchase intention. Furthermore, the study reveals that the relationship between trust and perceived risk is reciprocal. Research limitations/implications - This study adopted four dimensions - technical adequacy, content quality, specific content and appearance - to measure web site quality. However, there are still many competing concepts regarding the measurement of web site quality. Further studies using other dimensional measures may be needed to verify the research model. Practical implications - Online retailers should focus their marketing strategies more on establishing the brand of the web site rather than improving the functionality of the web site. Originality/value - This study proposed a non-recursive model for empirically analysing the link between web site quality, web site brand, trust, perceived risk and purchase intention towards the online retailer.", "paper_title": "The impact of online store environment cues on purchase intention Trust and perceived risk as a mediator", "paper_id": "WOS:000262140300009"}