{"auto_keywords": [{"score": 0.047677709717395385, "phrase": "belief_base"}, {"score": 0.009973646850986907, "phrase": "minimal_inconsistent_subsets"}, {"score": 0.00481495049065317, "phrase": "minimal_inconsistent_sets"}, {"score": 0.004779727370936752, "phrase": "hunter"}, {"score": 0.004744748594554028, "phrase": "konieczny"}, {"score": 0.004656603045540846, "phrase": "revised_inconsistency_measures"}, {"score": 0.004312622975366676, "phrase": "inconsistency_value"}, {"score": 0.004066416005586085, "phrase": "shapley_inconsistency_value"}, {"score": 0.0038909934410379775, "phrase": "five_simple_axioms"}, {"score": 0.0038624981944755813, "phrase": "mininc"}, {"score": 0.0037921662574137535, "phrase": "five_axioms"}, {"score": 0.0037231102027070724, "phrase": "minimal_inconsistent_set"}, {"score": 0.0034975571855450343, "phrase": "lottery_paradox"}, {"score": 0.0033712944392793195, "phrase": "minimal_inconsistent_belief_base_increases"}, {"score": 0.002953217535105884, "phrase": "minimal_inconsistent_subset"}, {"score": 0.00275383721396097, "phrase": "vectorial_measure"}, {"score": 0.002511803988580901, "phrase": "weighted_inconsistency_measures"}, {"score": 0.00247509835229599, "phrase": "vectorial_inconsistency_measure"}, {"score": 0.0023335495163073544, "phrase": "single_numerical_value"}, {"score": 0.002175913488493802, "phrase": "particular_shapley_inconsistency_value"}, {"score": 0.0021049977753042253, "phrase": "corresponding_revised_axioms"}], "paper_keywords": [""], "paper_abstract": "Hunter and Konieczny explored the relationships between measures of inconsistency for a belief base and the minimal inconsistent subsets of that belief base in several of their papers. In particular, an inconsistency value termed MIV (C) , defined from minimal inconsistent subsets, can be considered as a Shapley Inconsistency Value. Moreover, it can be axiomatized completely in terms of five simple axioms. MinInc, one of the five axioms, states that each minimal inconsistent set has the same amount of conflict. However, it conflicts with the intuition illustrated by the lottery paradox, which states that as the size of a minimal inconsistent belief base increases, the degree of inconsistency of that belief base becomes smaller. To address this, we present two kinds of revised inconsistency measures for a belief base from its minimal inconsistent subsets. Each of these measures considers the size of each minimal inconsistent subset as well as the number of minimal inconsistent subsets of a belief base. More specifically, we first present a vectorial measure to capture the inconsistency for a belief base, which is more discriminative than MIV (C) . Then we present a family of weighted inconsistency measures based on the vectorial inconsistency measure, which allow us to capture the inconsistency for a belief base in terms of a single numerical value as usual. We also show that each of the two kinds of revised inconsistency measures can be considered as a particular Shapley Inconsistency Value, and can be axiomatically characterized by the corresponding revised axioms presented in this paper.", "paper_title": "A general framework for measuring inconsistency through minimal inconsistent sets", "paper_id": "WOS:000288805500004"}