{"auto_keywords": [{"score": 0.047573798606504444, "phrase": "staffing_levels"}, {"score": 0.03948584441918643, "phrase": "single-stage_cost_function"}, {"score": 0.00481495049065317, "phrase": "adaptive_labor_staffing"}, {"score": 0.004786315041142917, "phrase": "service_systems"}, {"score": 0.00461802698572959, "phrase": "service_system"}, {"score": 0.0044423558024348, "phrase": "large_variations"}, {"score": 0.004376575566619566, "phrase": "large_number"}, {"score": 0.0043505358211043425, "phrase": "system_parameters"}, {"score": 0.004273338516164498, "phrase": "brute_force_search"}, {"score": 0.004147695719847984, "phrase": "weekly_basis"}, {"score": 0.003942489281950188, "phrase": "optimum_staffing_levels"}, {"score": 0.003792417854654894, "phrase": "long_run_average"}, {"score": 0.0036589469980321016, "phrase": "queue_stability"}, {"score": 0.003637161400331984, "phrase": "service-level_agreement"}, {"score": 0.003615528700449878, "phrase": "sla"}, {"score": 0.0033453930912354796, "phrase": "constrained_parameterized_markov_cost_process"}, {"score": 0.0032664003336950243, "phrase": "novel_simultaneous_perturbation_stochastic_approximation"}, {"score": 0.0031046598804456366, "phrase": "second-order_methods"}, {"score": 0.00301327406964098, "phrase": "dual_ascent"}, {"score": 0.0029863849319835354, "phrase": "lagrange_multipliers"}, {"score": 0.0028811996609231626, "phrase": "incremental_fashion"}, {"score": 0.0027548981916445904, "phrase": "continuous-valued_worker_parameter"}, {"score": 0.002697862107622459, "phrase": "discrete_set"}, {"score": 0.0024812555102598447, "phrase": "five_real-life_service_systems"}, {"score": 0.0023938189911418373, "phrase": "scatter_search"}, {"score": 0.00238667288163314, "phrase": "based_algorithm"}, {"score": 0.0023724444453105983, "phrase": "state-of-the-art_optimization_tool-kit_optquest"}, {"score": 0.0021753930127723386, "phrase": "computational_advantage"}, {"score": 0.0021049977753042253, "phrase": "real-life_service_systems"}], "paper_keywords": ["Service systems", " labor optimization", " adaptive labor staffing", " simultaneous perturbation stochastic approximation"], "paper_abstract": "We consider the problem of optimizing the workforce of a service system. Adapting the staffing levels in such systems is non-trivial due to large variations in workload and the large number of system parameters do not allow for a brute force search. Further, because these parameters change on a weekly basis, the optimization should not take longer than a few hours. Our aim is to find the optimum staffing levels from a discrete high-dimensional parameter set, that minimizes the long run average of the single-stage cost function, while adhering to the constraints relating to queue stability and service-level agreement (SLA) compliance. The single-stage cost function balances the conflicting objectives of utilizing workers better and attaining the target SLAs. We formulate this problem as a constrained parameterized Markov cost process parameterized by the (discrete) staffing levels. We propose novel simultaneous perturbation stochastic approximation (SPSA)-based algorithms for solving the above problem. The algorithms include both first-order as well as second-order methods and incorporate SPSA-based gradient/Hessian estimates for primal descent, while performing dual ascent for the Lagrange multipliers. Both algorithms are online and update the staffing levels in an incremental fashion. Further, they involve a certain generalized smooth projection operator, which is essential to project the continuous-valued worker parameter tuned by our algorithms onto the discrete set. The smoothness is necessary to ensure that the underlying transition dynamics of the constrained Markov cost process is itself smooth (as a function of the continuous-valued parameter): a critical requirement to prove the convergence of both algorithms. We validate our algorithms via performance simulations based on data from five real-life service systems. For the sake of comparison, we also implement a scatter search based algorithm using state-of-the-art optimization tool-kit OptQuest. From the experiments, we observe that both our algorithms converge empirically and consistently outperform OptQuest in most of the settings considered. This finding coupled with the computational advantage of our algorithms make them amenable for adaptive labor staffing in real-life service systems.", "paper_title": "Simultaneous perturbation methods for adaptive labor staffing in service systems", "paper_id": "WOS:000354483200003"}