{"auto_keywords": [{"score": 0.04939815249833027, "phrase": "privacy_disclosure"}, {"score": 0.048949445942657245, "phrase": "modified_clustering_technique"}, {"score": 0.03580958092226666, "phrase": "personal_information_requests"}, {"score": 0.00481495049065317, "phrase": "user_behavior"}, {"score": 0.00459039896577789, "phrase": "user_behaviors"}, {"score": 0.004503525064934708, "phrase": "important_subject"}, {"score": 0.004034841146538891, "phrase": "information_requests"}, {"score": 0.0037199473428123175, "phrase": "important_role"}, {"score": 0.003580355398511932, "phrase": "new_data_structure"}, {"score": 0.00311669276800628, "phrase": "later_analysis"}, {"score": 0.0030140547908298404, "phrase": "users_privacy_disclosure_change"}, {"score": 0.002611010097359509, "phrase": "users'_answers"}, {"score": 0.0024301229420875155, "phrase": "proposed_clustering_technique"}, {"score": 0.0023613185213421173, "phrase": "interesting_connections"}, {"score": 0.002166349705365602, "phrase": "online_community_owners"}, {"score": 0.0021252533072727707, "phrase": "user-centered_strategies"}, {"score": 0.0021049977753042253, "phrase": "personal-information-requesting_issues"}], "paper_keywords": ["Recommender system", " User behavior", " Privacy disclosure", " Clustering technique"], "paper_abstract": "The analysis of user behaviors has been an important subject in recommending research recently. This paper proposes a modified clustering technique, showing that users privacy disclosure may change when they are answering the information requests, and we argues that their attitudes, including risk, useful, appropriate, played an important role behind those changes. We presented the new data structure in our dataset that would be loaded to experiment, e.g. personal information requests, users' answers to those requests, and most importantly, users cluster and attitude for later analysis. Our modified clustering technique would not only locate users privacy disclosure change by comparing the results from learning their past disclosure behaviors and from learning their current disclosures, but also exploit the relationship between the inconsistence in those two results and their attitudes. The data containing users' answers to a questionnaire with personal information requests was integrated to analyze their disclosure behaviors and attitude with the proposed clustering technique. We indeed find some interesting connections between their privacy disclosure change and attitudes, and the exploration of this paper could benefit to any researchers and online community owners who focusing on user-centered strategies and personal-information-requesting issues.", "paper_title": "Exploiting User Behavior Changes in Privacy Disclosure by Modified Clustering Technique", "paper_id": "WOS:000369374300019"}