{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "least_cognitively_demanding_way"}, {"score": 0.004180234323211199, "phrase": "traditional_keyboard"}, {"score": 0.004135010810625326, "phrase": "mouse_interaction"}, {"score": 0.0038948525410795517, "phrase": "traditional_and_stylus-based_input"}, {"score": 0.003290237137651949, "phrase": "visualizations_results"}, {"score": 0.003201890266327127, "phrase": "syntactic_consistency"}, {"score": 0.0026898636962522505, "phrase": "intelligent_software_system"}, {"score": 0.0025334249463305875, "phrase": "formal_mode"}, {"score": 0.0024519545383399773, "phrase": "concept_tool"}, {"score": 0.0023990982005125763, "phrase": "connected_and_spatial_syntactic_elements"}], "paper_keywords": ["Diagrams", " Sketching", " Intelligent Systems", " Sketching interfaces", " diagram editing", " tools for visual languages"], "paper_abstract": "The least cognitively demanding way to create a diagram is to draw it with a pen. Yet there is also a need for more formal visualizations, that is, diagrams created using both traditional keyboard and mouse interaction. Our objective is to allow the creation of diagrams using traditional and stylus-based input. Having two diagram creation interfaces requires that changes to a diagram should be automatically rendered in the other visualization. Because sketches are imprecise, there is always the possibility that conversion between visualizations results in a lack of syntactic consistency between the two visualizations. We propose methods for converting diagrams between forms, checking them for equivalence, and rectifying inconsistencies. As a result of our theoretical contributions, we present an intelligent software system allowing users to create and edit diagrams in sketch or formal mode. Our proof-of-concept tool supports diagrams with connected and spatial syntactic elements. Two user studies show that this approach is viable and participants found the software easy to use. We conclude that supporting such diagram creation is now possible in practice.", "paper_title": "Combining Sketching and Traditional Diagram Editing Tools", "paper_id": "WOS:000353638800010"}