{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "random_variables"}, {"score": 0.009129616524862197, "phrase": "traditional_probabilistic_models"}, {"score": 0.008467151563266282, "phrase": "language_modeling"}, {"score": 0.0042610532651691305, "phrase": "information_retrieval"}, {"score": 0.003904713104101532, "phrase": "newer_models"}, {"score": 0.003619993477999133, "phrase": "additional_step"}, {"score": 0.003021781956684419, "phrase": "additional_random_variables"}, {"score": 0.0029349892964423197, "phrase": "observed_documents"}, {"score": 0.002817639725689939, "phrase": "important_implications"}, {"score": 0.002736694413701639, "phrase": "parameter_estimation"}, {"score": 0.0027049694095434905, "phrase": "relevance_prediction"}, {"score": 0.002658068304632523, "phrase": "even_test-collection_construction"}, {"score": 0.002154693685426657, "phrase": "theoretical_basis"}], "paper_keywords": [""], "paper_abstract": "The view of documents and/or queries as random variables is gaining importance in the theory of information retrieval. We argue that traditional probabilistic models consider documents and queries as random variables, but that newer models such as language modeling and our unified model take this one step further. The additional step is called error in predictors. Such models consider that we don't observe the document and query random variables that are modeled to predict relevance probabilistically. Rather, there are additional random variables, which are the observed documents and queries. We discuss some important implications of this idea for parameter estimation, relevance prediction, and even test-collection construction. By clarifying the positions of various probabilistic models on this question, and presenting in one place many of its implications, this article aims to deepen our common understanding of the theories behind traditional probabilistic models, and to strengthen the theoretical basis for further development of more recent approaches such as language modeling.", "paper_title": "Documents and queries as random variables: History and implications", "paper_id": "WOS:000238519600001"}