{"auto_keywords": [{"score": 0.04791490314295839, "phrase": "data_points"}, {"score": 0.018086268520751392, "phrase": "brknn_query"}, {"score": 0.017181412224710698, "phrase": "top-n_query"}, {"score": 0.01541478212157203, "phrase": "voronoi_diagram"}, {"score": 0.009378858160772796, "phrase": "rknn_query"}, {"score": 0.006394424101541571, "phrase": "data_point"}, {"score": 0.00481495049065317, "phrase": "spatial_databases"}, {"score": 0.0047872135686404275, "phrase": "bi-chromatic_reverse_k-nearest_neighbors"}, {"score": 0.004544629724830453, "phrase": "query_point"}, {"score": 0.004427966503146096, "phrase": "bi-chromatic_reverse"}, {"score": 0.0041312380622750555, "phrase": "data_g"}, {"score": 0.00402514392911723, "phrase": "data_point_q"}, {"score": 0.0037989951856280423, "phrase": "g._many"}, {"score": 0.0037880260900233064, "phrase": "existing_approaches"}, {"score": 0.0035855066449812273, "phrase": "first_attempt"}, {"score": 0.0034832884999421374, "phrase": "brknn_queries"}, {"score": 0.0033741997276290356, "phrase": "top-n_points"}, {"score": 0.0029794666460666646, "phrase": "upper_bound"}, {"score": 0.0029281780903782284, "phrase": "brknn_answer"}, {"score": 0.002787591531872224, "phrase": "existing_approach"}, {"score": 0.002623184850933423, "phrase": "candidate_region"}, {"score": 0.0025631294247072476, "phrase": "corresponding_search_space"}, {"score": 0.0025117070259621376, "phrase": "triangle_inequality"}, {"score": 0.0024756080101497086, "phrase": "efficient_refinement_algorithm"}, {"score": 0.002447101794397243, "phrase": "exact_brknn_answers"}, {"score": 0.002425937226012825, "phrase": "candidate_regions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spatial databases", " RkNN queries", " BRkNN queries", " Top-n queries"], "paper_abstract": "A reverse k-nearest neighbor (RkNN) query retrieves the data points which regard the query point as one of their respective k nearest neighbors. A bi-chromatic reverse k-nearest neighbor (BRkNN) query is a variant of the RkNN query, considering two types of data. Given two types of data G and C, a BRkNN query regarding a data point q in G retrieves the data points from C that regard q as one of their respective k-nearest neighbors among the data points in G. Many existing approaches answer either the RkNN query or the BRkNN query. Different from these approaches, in this paper, we make the first attempt to propose a top-n query based on the concept of BRkNN queries, which ranks the data points in G and retrieves the top-n points according to the cardinalities of the corresponding BRkNN answer sets. For efficiently answering this top-n query, we construct the Voronoi Diagram of G to index the data points in G and C. From the information associated with the Voronoi Diagram of G, the upper bound of the cardinality of the BRkNN answer sets for each data point in G can be quickly computed. Moreover, based on an existing approach to answering the RkNN query and the characteristics of the Voronoi Diagram of G, we propose a method to find the candidate region regarding a BRkNN query, which tightens the corresponding search space. Finally, based on the triangle inequality, we propose an efficient refinement algorithm for finding the exact BRkNN answers from the candidate regions. To evaluate our approach on answering the top-n query, it is compared with an approach which applies a state-of-the-art algorithm for answering the BRkNN query to each data point in G. The experiment results reveal that our approach has a much better performance. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Top-n query processing in spatial databases considering bi-chromatic reverse k-nearest neighbors", "paper_id": "WOS:000333785700008"}