{"auto_keywords": [{"score": 0.04976825669929274, "phrase": "clinical_decision_support"}, {"score": 0.027103643420844953, "phrase": "ci"}, {"score": 0.00481495049065317, "phrase": "personalized_risk_estimation"}, {"score": 0.00475390577915698, "phrase": "objective_competing_tools"}, {"score": 0.004517334089033334, "phrase": "cardiovascular_disease"}, {"score": 0.0044742996274375404, "phrase": "predictive_models"}, {"score": 0.004347629793717084, "phrase": "cohort_studies"}, {"score": 0.004091820963641547, "phrase": "care_decisions"}, {"score": 0.0039886490182021155, "phrase": "patient-driven_adaptive_prediction_technique"}, {"score": 0.003826492478418294, "phrase": "data-driven_approach"}, {"score": 0.0037658881407605445, "phrase": "individualized_confidence_intervals"}, {"score": 0.003578307035551443, "phrase": "individual_patient's_clinical_condition"}, {"score": 0.003465827053421054, "phrase": "training_dataset"}, {"score": 0.0033568708392230544, "phrase": "best_model"}, {"score": 0.0033248546272754936, "phrase": "ideal_model"}, {"score": 0.0030892986597489485, "phrase": "cross_model"}, {"score": 0.003060585462617076, "phrase": "random"}, {"score": 0.002982597613697966, "phrase": "clinical_datasets"}, {"score": 0.002916618252808186, "phrase": "cross_model_selection_strategy"}, {"score": 0.0027535633837592597, "phrase": "random_model_selection_strategy"}, {"score": 0.0023694065215394593, "phrase": "particular_individual"}, {"score": 0.0023021895404322767, "phrase": "training_set"}, {"score": 0.0022875127203850027, "phrase": "existing_models"}, {"score": 0.0021185060549341974, "phrase": "disease_risk_estimation"}, {"score": 0.0021049977753042253, "phrase": "individual_patients"}], "paper_keywords": [""], "paper_abstract": "Objective Competing tools are available online to assess the risk of developing certain conditions of interest, such as cardiovascular disease. While predictive models have been developed and validated on data from cohort studies, little attention has been paid to ensure the reliability of such predictions for individuals, which is critical for care decisions. The goal was to develop a patient-driven adaptive prediction technique to improve personalized risk estimation for clinical decision support. Material and methods A data-driven approach was proposed that utilizes individualized confidence intervals (CIs) to select the most 'appropriate' model from a pool of candidates to assess the individual patient's clinical condition. The method does not require access to the training dataset. This approach was compared with other strategies: the BEST model (the ideal model, which can only be achieved by access to data or knowledge of which population is most similar to the individual), CROSS model, and RANDOM model selection. Results When evaluated on clinical datasets, the approach significantly outperformed the CROSS model selection strategy in terms of discrimination (p<1e-14) and calibration (p<0.006). The method outperformed the RANDOM model selection strategy in terms of discrimination (p<1e-12), but the improvement did not achieve significance for calibration (p=0.1375). Limitations The CI may not always offer enough information to rank the reliability of predictions, and this evaluation was done using aggregation. If a particular individual is very different from those represented in a training set of existing models, the CI may be somewhat misleading. Conclusion This approach has the potential to offer more reliable predictions than those offered by other heuristics for disease risk estimation of individual patients.", "paper_title": "A patient-driven adaptive prediction technique to improve personalized risk estimation for clinical decision support", "paper_id": "WOS:000314151400023"}