{"auto_keywords": [{"score": 0.049352273134126434, "phrase": "dynamic_analysis"}, {"score": 0.015328167633950597, "phrase": "program_comprehension"}, {"score": 0.00481495049065317, "phrase": "systematic_survey_of_program"}, {"score": 0.004622450915803531, "phrase": "important_activity"}, {"score": 0.00457553517865013, "phrase": "software_maintenance"}, {"score": 0.004152818376630929, "phrase": "program's_execution"}, {"score": 0.003966388754366831, "phrase": "common_technique"}, {"score": 0.0038271712887391015, "phrase": "substantial_attention"}, {"score": 0.003769006950727621, "phrase": "research_community"}, {"score": 0.003545024951402821, "phrase": "large_research_body"}, {"score": 0.00342054627009158, "phrase": "comprehensive_overview"}, {"score": 0.0033004240095380623, "phrase": "systematic_literature_survey"}, {"score": 0.0030414140732789186, "phrase": "research_body"}, {"score": 0.002479150189700726, "phrase": "resulting_overview"}, {"score": 0.002392008392892289, "phrase": "main_contributions"}, {"score": 0.0021375377706211686, "phrase": "additional_consideration"}], "paper_keywords": ["Survey", " program comprehension", " dynamic analysis"], "paper_abstract": "Program comprehension is an important activity in software maintenance, as software must be sufficiently understood before it can be properly modified. The study of a program's execution, known as dynamic analysis, has become a common technique in this respect and has received substantial attention from the research community, particularly over the last decade. These efforts have resulted in a large research body of which currently there exists no comprehensive overview. This paper reports on a systematic literature survey aimed at the identification and structuring of research on program comprehension through dynamic analysis. From a research body consisting of 4,795 articles published in 14 relevant venues between July 1999 and June 2008 and the references therein, we have systematically selected 176 articles and characterized them in terms of four main facets: activity, target, method, and evaluation. The resulting overview offers insight in what constitutes the main contributions of the field, supports the task of identifying gaps and opportunities, and has motivated our discussion of several important research directions that merit additional consideration in the near future.", "paper_title": "A Systematic Survey of Program Comprehension through Dynamic Analysis", "paper_id": "WOS:000270154300007"}