{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "blocking_probability"}, {"score": 0.004715908063787721, "phrase": "wdm_networks"}, {"score": 0.004098397888277889, "phrase": "multicast_requests"}, {"score": 0.003544420175052215, "phrase": "np"}, {"score": 0.0034162643819889054, "phrase": "integer_linear_programming"}, {"score": 0.00338093237582824, "phrase": "ilp"}, {"score": 0.003226209534553224, "phrase": "blocking_model"}, {"score": 0.0031270239691197515, "phrase": "optimal_solution"}, {"score": 0.002702887319160532, "phrase": "sparse_splitting_configurations"}, {"score": 0.002674885993329912, "phrase": "extensive_simulations"}, {"score": 0.0025657442830956017, "phrase": "near-optimal_solutions"}, {"score": 0.002499798127196099, "phrase": "static_approaches"}, {"score": 0.002448260697722081, "phrase": "probability_models"}, {"score": 0.0022879728308318205, "phrase": "multiple_multicast_communications"}, {"score": 0.0021049977753042253, "phrase": "light-tree_solutions"}], "paper_keywords": ["Full/partial blocking probability", " Light-hierarchy", " ulticast routing and wavelength assignment (MCRWA)"], "paper_abstract": "Given a sparse splitting wavelength division multiplexing (WDM) network and a set of available wavelengths, we investigate the problem of provisioning a set of multicast requests simultaneously with the objective of minimizing the blocking probability. Two blocking models are taken into account: full blocking probability and partial blocking probability. As the problem is NP-hard, we propose an integer linear programming (ILP) formulation with two variants (each for a blocking model) to search for the optimal solution and several efficient adaptive heuristic algorithms to compute approximated solutions. In particular, instead of using light-trees, both ILP and heuristics use light-hierarchy, a recently proposed optimal route under sparse splitting configurations. Extensive simulations reveal that our adaptive algorithms are able to compute near-optimal solutions, and they outperform static approaches under both blocking probability models. The results also show that it is more advantageous to provision multiple multicast communications with light-hierarchies, since they are able to accommodate more requests and destinations compared to the light-tree solutions.", "paper_title": "Minimizing Blocking Probability for the Multicast Routing and Wavelength Assignment Problem in WDM Networks: Exact Solutions and Heuristic Algorithms", "paper_id": "WOS:000346864200025"}