{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "leapfrog_computerized_physician_order_entry_evaluation_tool"}, {"score": 0.0047168249426092134, "phrase": "cpoe"}, {"score": 0.004680542234803855, "phrase": "clinical_decision_support"}, {"score": 0.00457335448397295, "phrase": "patient_safety"}, {"score": 0.004538171020165214, "phrase": "leapfrog_tool"}, {"score": 0.004355026964936104, "phrase": "approach's_generalizability"}, {"score": 0.004147078767929973, "phrase": "locally_developed_cpoe_systems"}, {"score": 0.004094018760244776, "phrase": "cross-sectional_study_design"}, {"score": 0.003989918570528528, "phrase": "institutional_review_board"}, {"score": 0.003959205709477521, "phrase": "hospital_site"}, {"score": 0.0039085400187964196, "phrase": "tertiary_and_academic_institutions"}, {"score": 0.0038585201818951225, "phrase": "advanced_cpoe."}, {"score": 0.0037798114668792003, "phrase": "web-based_tests"}, {"score": 0.0035807287211852947, "phrase": "system's_response_rate"}, {"score": 0.0034184246667842105, "phrase": "evaluation_results"}, {"score": 0.003357305136739058, "phrase": "five_us_systems"}, {"score": 0.0032133683327526035, "phrase": "overall_category_completion_rates"}, {"score": 0.0030676643955722884, "phrase": "allowed_test_timeframe"}, {"score": 0.003012797304649309, "phrase": "deception_analysis"}, {"score": 0.002974206574861882, "phrase": "false_positives"}, {"score": 0.002846647336160784, "phrase": "medical_diagnosis"}, {"score": 0.0028320036365874273, "phrase": "documentation_purposes"}, {"score": 0.0027670310491012826, "phrase": "evaluation_stage"}, {"score": 0.0026827075165830193, "phrase": "nine_error_categories"}, {"score": 0.002668904897653294, "phrase": "drug-allergy"}, {"score": 0.00257424957319189, "phrase": "therapeutic_duplication"}, {"score": 0.0025610035410346386, "phrase": "drug-labs"}, {"score": 0.0023580809910580362, "phrase": "cpoe_evaluation_tool"}, {"score": 0.002205079358459154, "phrase": "korean_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Computerized physician order entry", " Medication safety", " Decision support", " Prescribing", " Quality"], "paper_abstract": "Background:Computerized physician order entry (CPOE) with clinical decision support is expected to deliver many benefits in terms of patient safety. The Leapfrog tool was developed to allow hospitals to assess their medication-safety related decision support. To explore the approach's generalizability, we examined its acceptability and feasibility through an evaluation using this tool in four Korean hospital systems. Methods:Four hospitals with locally developed CPOE systems participated, and a cross-sectional study design was used with the approval of the Leapfrog Group and the institutional review board at each hospital site. The hospitals were tertiary and academic institutions with long experience of advanced CPOE. From January 21 to 28, 2014, web-based tests were conducted at each site following the given instructions, and the results were self-reported. We measured each system's response rate, category completion rate, and time to complete the evaluation. Additionally, we compared the evaluation results of the four systems with scores from five US systems, as was reported in another study. Results:The four systems underwent the tests, and the overall category completion rates ranged from 67.9% to 75.5%. The times to finish the tests were tolerable and within the allowed test timeframe. One system did not pass the deception analysis, which checks for false positives, due to a conflict with another type of alert checking for the presence of a medical diagnosis for documentation purposes. The other three systems scored at the completed the evaluation stage, with scores ranging from 21.6% to 36.5%. Of the nine error categories, Drug-Allergy was an area of strength for all systems, whereas the categories of Therapeutic duplication, Drug-Labs, and Drug-Age were areas of weakness for all. In comparison with the US systems, gaps were identified, and further improvement is needed. Conclusions:The acceptability of the CPOE evaluation tool was moderate, but the feasibility was sufficient to operate the test outside the US, and the results revealed many opportunities for improvement in the Korean systems, as was the case when this application was introduced in the US. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Acceptability and feasibility of the Leapfrog computerized physician order entry evaluation tool for hospitals outside the United States", "paper_id": "WOS:000358082400010"}