{"auto_keywords": [{"score": 0.04568107674629595, "phrase": "steady_state"}, {"score": 0.04209543021686619, "phrase": "robust_control_performance"}, {"score": 0.0048161004785750115, "phrase": "pi"}, {"score": 0.004671744927552112, "phrase": "high_levels"}, {"score": 0.004595427853257205, "phrase": "satisfactory_control_performance"}, {"score": 0.004483272938890684, "phrase": "robust_performance"}, {"score": 0.004410021079229461, "phrase": "smoother_control_surface"}, {"score": 0.004314202267170469, "phrase": "transient_state_and_disturbance_rejection_performance"}, {"score": 0.003951217758030637, "phrase": "acceptable_transient"}, {"score": 0.00392956895931878, "phrase": "disturbance_rejection_performance"}, {"score": 0.0037194747200740568, "phrase": "secondary_membership_functions"}, {"score": 0.003608732492631878, "phrase": "online_manner"}, {"score": 0.0035206116787391646, "phrase": "smf"}, {"score": 0.0034916666462352893, "phrase": "closed-system_control_performance"}, {"score": 0.0033598646666126784, "phrase": "conventional_or_self-tuning_fuzzy_controller_design_strategies"}, {"score": 0.0032777653153451265, "phrase": "integral_action"}, {"score": 0.003215295260684715, "phrase": "robust_system_performance"}, {"score": 0.0031801323969554976, "phrase": "parameter_variations"}, {"score": 0.003154012038613403, "phrase": "zslices_approach"}, {"score": 0.0029688865799057814, "phrase": "new_way"}, {"score": 0.0029042887008048717, "phrase": "single_tuning_parameter"}, {"score": 0.0027564303939865476, "phrase": "computational_complexity"}, {"score": 0.0026377570446517004, "phrase": "desired_transient_state_response"}, {"score": 0.002608893678760607, "phrase": "efficient_disturbance_rejection"}, {"score": 0.002545097679559711, "phrase": "benchmark_systems"}, {"score": 0.0025103303020759956, "phrase": "real-world_experiments"}, {"score": 0.0024022268441600794, "phrase": "proposed_systems"}, {"score": 0.0023499294490179788, "phrase": "control_performance"}], "paper_keywords": ["General type-2 fuzzy logic systems", " interval type-2 fuzzy logic systems", " zSlices-based general type-2 fuzzy logic systems"], "paper_abstract": "The interval type-2 fuzzy Proportional-Integral (PI) controller (IT2-FPI) might be able to handle high levels of uncertainties to produce a satisfactory control performance, which could be potentially due to the robust performance as a result of the smoother control surface around the steady state. However, the transient state and disturbance rejection performance of the IT2-FPI may degrade in comparison with the type-1 fuzzy PI (T1-FPI) counterpart. This drawback can be resolved via general type-2 fuzzy PI controllers which can provide a tradeoff between the robust control performance of the IT2-FPI and the acceptable transient and disturbance rejection performance of the type-1 PI controllers. In this paper, we will present a zSlices-based general type-2 fuzzy PI controller (zT2-FPI), where the secondary membership functions (SMFs) of the antecedent general type-2 fuzzy sets are adjusted in an online manner. We will examine the effect of the SMF on the closed-system control performance to investigate their induced performance improvements. This paper will focus on the case followed in conventional or self-tuning fuzzy controller design strategies, where the aim is to decrease the integral action sufficiently around the steady state to have robust system performance against noises and parameter variations. The zSlices approach will give the opportunity to construct the zT2-FPI controller as a collection of IT2-FPI and T1-FPI controllers. We will present a new way to design a zT2-FPI controller based on a single tuning parameter where the features of T1-FPI (speed) and IT2-FPI (robustness) are combined without increasing the computational complexity much when compared with the IT2-FPI structure. This will allow the proposed zT2-FPI controller to achieve the desired transient state response and provide an efficient disturbance rejection and robust control performance. We will present several simulation studies on benchmark systems, in addition to real-world experiments that were performed using the PIONEER 3-DX mobile robot that will act as a platform to evaluate the proposed systems. The results will show that the control performance of the self-tuning zT2-FPI control structure enhances both the transient state and disturbance rejection performances when compared with the type-1 and IT2-FPI counterparts. In addition, the self-tuning zT2-FPI is more robust to disturbances, noise, and uncertainties when compared with the type-1 and interval type-2 fuzzy counterparts.", "paper_title": "A Self-Tuning zSlices-Based General Type-2 Fuzzy PI Controller", "paper_id": "WOS:000359262400021"}