{"auto_keywords": [{"score": 0.043453500997964946, "phrase": "brainexplorer"}, {"score": 0.015719716506582538, "phrase": "future_learning"}, {"score": 0.015456171186625827, "phrase": "tangible_user_interface"}, {"score": 0.004296264970612285, "phrase": "microworld-based_learning_environment"}, {"score": 0.003966667994579941, "phrase": "neural_pathways"}, {"score": 0.003559284776569813, "phrase": "visual_field"}, {"score": 0.0033048445033866795, "phrase": "ecological_evaluation"}, {"score": 0.002982203248352076, "phrase": "traditional_textbook_materials"}, {"score": 0.0028653893877383188, "phrase": "student_performance"}, {"score": 0.0023064582783867645, "phrase": "students'_verbalizations"}, {"score": 0.0021049977753042253, "phrase": "tangible_user_interfaces"}], "paper_keywords": ["Computer-assisted instruction", " education", " input devices and strategies"], "paper_abstract": "In this paper, we describe the development and evaluation of a microworld-based learning environment for neuroscience. Our system, BrainExplorer, allows students to discover the way neural pathways work by interacting with a tangible user interface. By severing and reconfiguring connections, users can observe how the visual field is impaired and, thus, actively learn from their exploration. An ecological evaluation of BrainExplorer revealed that 1) students who engaged in the open-ended exploration outperformed students who used traditional textbook materials and 2) correctly sequencing activities is fundamental for improving student performance. Participants who used the tabletop first and then studied a text significantly outperformed participants who read a text first and then used the tabletop. Additionally, those results were best predicted by the quality of students' verbalizations while using BrainExplorer. The implications of this study for preparing students for future learning with Tangible User Interfaces are discussed.", "paper_title": "Preparing for Future Learning with a Tangible User Interface: The Case of Neuroscience", "paper_id": "WOS:000319877300003"}