{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scalable_hierarchical_clustering"}, {"score": 0.004735519962945449, "phrase": "distributed_memory_parallel_version"}, {"score": 0.004631637679516574, "phrase": "average_hierarchical_agglomerative_clustering_algorithm"}, {"score": 0.004357511171877593, "phrase": "large_collections"}, {"score": 0.004285594361623147, "phrase": "standard_message"}, {"score": 0.004191540451296395, "phrase": "interprocess_communication"}, {"score": 0.004122351497440992, "phrase": "efficient_load_balancing"}, {"score": 0.002779318608820933, "phrase": "nodes_increases"}, {"score": 0.002486987042061596, "phrase": "hierarchical_algorithms"}, {"score": 0.0024594969044952108, "phrase": "significantly_tighter_clusters"}, {"score": 0.002418829014435841, "phrase": "document_clustering_task"}, {"score": 0.0022502133699402018, "phrase": "clustering_subroutine"}, {"score": 0.0022129983153880467, "phrase": "parallel_version"}, {"score": 0.0021763973978248005, "phrase": "buckshot_algorithm"}, {"score": 0.0021285340816566906, "phrase": "complete_trec_collection"}], "paper_keywords": [""], "paper_abstract": "A distributed memory parallel version of the group average hierarchical agglomerative clustering algorithm is proposed to enable scaling the document clustering problem to large collections. Using standard message passing operations reduces interprocess communication while maintaining efficient load balancing. In a series of experiments using a subset of a standard Text REtrieval Conference (TREC) test collection, our parallel hierarchical clustering algorithm is shown to be scalable in terms of processors efficiently used and the collection size. Results show that our algorithm performs close to the expected O(n(2)/p) time on p processors rather than the worst-case O(n(3)/p) time. Furthermore, the O(n(2)/p) memory complexity per node allows larger collections to be clustered as the number of nodes increases. While partitioning algorithms such as k-means are trivially parallelizable, our results confirm those of other studies which showed that hierarchical algorithms produce significantly tighter clusters in the document clustering task. Finally, we show how our parallel hierarchical agglomerative clustering algorithm can be used as the clustering subroutine for a parallel version of the buckshot algorithm to cluster the complete TREC collection at near theoretical runtime expectations.", "paper_title": "Exploiting parallelism to support scalable hierarchical clustering", "paper_id": "WOS:000247078400012"}