{"auto_keywords": [{"score": 0.037827169315573464, "phrase": "user_modeling"}, {"score": 0.015719716506582538, "phrase": "semantic_web"}, {"score": 0.007838935534742133, "phrase": "adaptive_web-based_systems"}, {"score": 0.004673290248999786, "phrase": "important_factors"}, {"score": 0.004490842671590769, "phrase": "important_topics"}, {"score": 0.004461131750106576, "phrase": "web_research"}, {"score": 0.004358676214574977, "phrase": "adaptive_hypermedia"}, {"score": 0.004244449986839909, "phrase": "user-adapted_access"}, {"score": 0.004065156038847781, "phrase": "adaptive_hypermedia_structure"}, {"score": 0.004038249989123055, "phrase": "content_pages"}, {"score": 0.003778755692995768, "phrase": "high_degree"}, {"score": 0.0034431390653713173, "phrase": "right_adaptation"}, {"score": 0.003308557560574077, "phrase": "research_field"}, {"score": 0.003106112985011102, "phrase": "research_fields"}, {"score": 0.003004572722189157, "phrase": "close_harmony"}, {"score": 0.00293547027122617, "phrase": "similar_success"}, {"score": 0.0025784931028501375, "phrase": "extended_distribution"}, {"score": 0.0024286751532861476, "phrase": "web_science"}, {"score": 0.0023336530061840244, "phrase": "user_properties"}, {"score": 0.002287542098172185, "phrase": "user_models"}, {"score": 0.0022573076362326135, "phrase": "vision_paper"}, {"score": 0.0021403049512708494, "phrase": "research_questions"}, {"score": 0.0021049977753042253, "phrase": "relevant_research_fields"}], "paper_keywords": ["User modeling", " adaptation", " personalization", " linked open data", " Web science"], "paper_abstract": "Historically, personalization and adaptation have been important factors for the success of the Web and therefore they have been important topics in Web research. Many research efforts in the field of adaptive hypermedia and adaptive Web-based systems have resulted in solutions for user-adapted access to Web content, often in terms of systems that provide an adaptive hypermedia structure of content pages and hyperlinks. With pages and links that depend on the user, it is feasible to offer a high degree of personalization. Next to research into engineering and realizing adaptation, research into user modeling has been crucial for the success of adaptation. To apply the right adaptation it is necessary to know the user and her relevant properties and the research field of user modeling has focused on theories and techniques for eliciting knowledge about the user. Naturally, the research fields of adaptive Web-based systems and user modeling have always lived in close harmony. In order to create a similar success with personalization and adaptation in relation to the Semantic Web, adaptation and user modeling have to be redefined, with consequences for the research into these topics. In particular, the nature of user modeling changes significantly with the extended distribution and openness that we encounter on the Web of Data, with implications from problems studied in Web science. Promising research shows how Semantic Web-based solutions can aid in the representation of user properties for sharing and linking of user models. In this vision paper we outline the evolution of user modeling and adaptation in connection to the Semantic Web and list research questions and challenges for the relevant research fields.", "paper_title": "User modeling and adaptive Semantic Web", "paper_id": "WOS:000209436300016"}