{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "patient_privacy"}, {"score": 0.004638462976078815, "phrase": "patient_data"}, {"score": 0.004595356579614969, "phrase": "electronic_healthcare_record_systems"}, {"score": 0.00453144352814823, "phrase": "tremendous_benefits"}, {"score": 0.004489327204473076, "phrase": "clinical_research"}, {"score": 0.003812299519486331, "phrase": "holistic_solution"}, {"score": 0.003741712498615481, "phrase": "authors'_experience"}, {"score": 0.0031036643805367487, "phrase": "underlying_technical_platforms"}, {"score": 0.0030461580449080553, "phrase": "security_structure"}, {"score": 0.0027743157238507943, "phrase": "usa"}, {"score": 0.002722758109991685, "phrase": "five_privacy_categories"}, {"score": 0.0025741370320813968, "phrase": "use_cases"}, {"score": 0.002410942838102255, "phrase": "user_privacy_categories"}, {"score": 0.00237733844863506, "phrase": "privacy_categories"}, {"score": 0.002185301851004467, "phrase": "current_institutional_review_boards"}, {"score": 0.0021247934141234988, "phrase": "holistic_approach"}, {"score": 0.0021049977753042253, "phrase": "patient_privacy_solutions"}], "paper_keywords": [""], "paper_abstract": "Background The re-use of patient data from electronic healthcare record systems can provide tremendous benefits for clinical research, but measures to protect patient privacy while utilizing these records have many challenges. Some of these challenges arise from a misperception that the problem should be solved technically when actually the problem needs a holistic solution. Objective The authors' experience with informatics for integrating biology and the bedside (i2b2) use cases indicates that the privacy of the patient should be considered on three fronts: technical de-identification of the data, trust in the researcher and the research, and the security of the underlying technical platforms. Methods The security structure of i2b2 is implemented based on consideration of all three fronts. It has been supported with several use cases across the USA, resulting in five privacy categories of users that serve to protect the data while supporting the use cases. Results The i2b2 architecture is designed to provide consistency and faithfully implement these user privacy categories. These privacy categories help reflect the policy of both the Health Insurance Portability and Accountability Act and the provisions of the National Research Act of 1974, as embodied by current institutional review boards. Conclusion By implementing a holistic approach to patient privacy solutions, i2b2 is able to help close the gap between principle and practice.", "paper_title": "Strategies for maintaining patient privacy in i2b2", "paper_id": "WOS:000299871300017"}