{"auto_keywords": [{"score": 0.004577869668211548, "phrase": "important_aspect"}, {"score": 0.004536029676655286, "phrase": "haptic_perception"}, {"score": 0.004312622975366672, "phrase": "different_buttons"}, {"score": 0.0034751259234824913, "phrase": "different_object"}, {"score": 0.0031699005399973496, "phrase": "handled_objects"}, {"score": 0.0030135741897058844, "phrase": "varying_numbers"}, {"score": 0.0026986685585382347, "phrase": "homogeneous_objects"}, {"score": 0.002361632539339945, "phrase": "numerosity_judgments"}, {"score": 0.002318566141177149, "phrase": "response_times"}, {"score": 0.002297327670408112, "phrase": "error_rates"}, {"score": 0.0021539955106204337, "phrase": "size_and_shape_features"}, {"score": 0.0021049977753042253, "phrase": "object_recognition"}], "paper_keywords": ["Numerosity perception", " object individuation", " psychophysics"], "paper_abstract": "Item individuation, i.e., how we decide which parts belong to one object and which to another, is an important aspect of haptic perception and may be important for design of interfaces in which different buttons have to be distinguished. We daily hold several objects in our hand. Somehow, we decide that we are holding several small objects instead of one large object. We aim to provide insight into how it is decided that some parts belong to the same object and others to a different object, i.e., object individuation. This process may be influenced by heterogeneity of size or shape of the handled objects. To investigate this, subjects were asked to grasp varying numbers of shapes together in the hand and respond fast and accurately the number of shapes. We compared performance for a set of homogeneous objects (Experiment 1) to performance for sets of objects heterogeneous in size (Experiment 2) or shape (Experiment 3). It was found that numerosity judgments in terms of response times, error rates, and object handling were similar in all three experiments. We conclude that size and shape features that are used for object recognition do not play a role in item individuation.", "paper_title": "Haptic Object Individuation", "paper_id": "WOS:000289472100005"}