{"auto_keywords": [{"score": 0.03494541375681486, "phrase": "policy-specific_decryption_blackbox"}, {"score": 0.02078797263974603, "phrase": "key-like_decryption_blackbox"}, {"score": 0.008159469840674751, "phrase": "access_policies"}, {"score": 0.00481495049065317, "phrase": "trace_decryption_devices_found"}, {"score": 0.004354387464909719, "phrase": "eligible_receivers"}, {"score": 0.004259638825837131, "phrase": "multiple_users"}, {"score": 0.004166943227096525, "phrase": "fine-grained_access_control"}, {"score": 0.004025320909035849, "phrase": "practicality_concern"}, {"score": 0.003987535625069556, "phrase": "malicious_user"}, {"score": 0.0038278398921822404, "phrase": "decryption_blackbox"}, {"score": 0.003779996603264111, "phrase": "financial_gain"}, {"score": 0.003594507685403249, "phrase": "decryption_blackboxes"}, {"score": 0.00356075194411181, "phrase": "different_practical_scenarios"}, {"score": 0.003260543967539824, "phrase": "access_policy"}, {"score": 0.002957516535697149, "phrase": "preliminary_version"}, {"score": 0.0028479036246421875, "phrase": "new_cp-abe_scheme"}, {"score": 0.0027509877943131945, "phrase": "sublinear_overhead"}, {"score": 0.0026741446768534824, "phrase": "fully_collusion-resistant_blackbox_traceability"}, {"score": 0.002599442416948628, "phrase": "standard_model"}, {"score": 0.0025588443155279855, "phrase": "monotonic_access_structures"}, {"score": 0.0023429088315910585, "phrase": "general_statement"}, {"score": 0.002313582249239217, "phrase": "cp-abe_scheme"}, {"score": 0.0021049977753042253, "phrase": "cp-abe_schemes"}], "paper_keywords": ["Traceability", " CP-ABE", " blackbox", " key-like", " policy-specific"], "paper_abstract": "In Ciphertext-policy attribute-based encryption (CP-ABE), ciphertexts are associated with access policies, which do not have to contain the identities of eligible receivers, and attributes are shared by multiple users. CP-ABE is useful for providing fine-grained access control on encrypted data. However, it also has a practicality concern that a malicious user, with his attributes shared with other users, might leak his decryption privilege as a decryption blackbox, for some financial gain or other incentives, as there is little risk of getting caught. There are two types of decryption blackboxes that reflect different practical scenarios. A key-like decryption blackbox is associated with an attribute set S-D and can decrypt ciphertexts with access policies satisfied by S-D. A policy-specific decryption blackbox is associated with an access policy A(D) and can decrypt ciphertexts with A(D). Policy-specific decryption blackbox has weaker decryption capacity than key-like decryption blackbox, but tracing it is deemed to be more difficult. In the preliminary version (in CCS 2013) of this paper, we proposed a new CP-ABE scheme which is adaptively traceable against key-like decryption blackbox. The scheme has sublinear overhead, which is the most efficient one to date supporting fully collusion-resistant blackbox traceability. The scheme is fully secure in the standard model, and supports any monotonic access structures. In this paper, we further show that the scheme is also selectively traceable against policy-specific decryption blackbox. Furthermore, and more importantly, we prove a general statement that if a CP-ABE scheme is (selectively) traceable against policy-specific decryption blackbox, it is also (selectively) traceable against key-like decryption blackbox, which implies that we now only need to focus on building CP-ABE schemes which are traceable against policy-specific decryption blackbox.", "paper_title": "Traceable CP-ABE: How to Trace Decryption Devices Found in the Wild", "paper_id": "WOS:000358709700006"}