{"auto_keywords": [{"score": 0.03994932833136189, "phrase": "dmtr"}, {"score": 0.02322730111336099, "phrase": "unused_contacts"}, {"score": 0.004775335634705251, "phrase": "mobile_phones"}, {"score": 0.00446987606516801, "phrase": "unused_contacts-contacts"}, {"score": 0.004324521292490181, "phrase": "long_time"}, {"score": 0.0041666157975446564, "phrase": "future_calls"}, {"score": 0.004047781270412204, "phrase": "users'_attention"}, {"score": 0.003997891221012094, "phrase": "mobile_phone's_limited_screen_capacity"}, {"score": 0.003835972725191194, "phrase": "prototype_contact_list_interface"}, {"score": 0.0036352070472201086, "phrase": "smaller_font"}, {"score": 0.0035461111918923117, "phrase": "contact_list"}, {"score": 0.002931569771634119, "phrase": "phase_ii"}, {"score": 0.0025257081555100556, "phrase": "key_strokes"}, {"score": 0.0021669202726173928, "phrase": "strong_evidence"}, {"score": 0.0021401625519713577, "phrase": "demotion_principle"}, {"score": 0.0021049977753042253, "phrase": "user-subjective_approach"}], "paper_keywords": ["Mobile phone", " Contact list", " Personal information management", " User-subjective approach", " Demotion"], "paper_abstract": "Throughout their lives, people gather contacts on their mobile phones. Some of these are unused contacts-contacts that have not been used for a long time and are less likely to be used in future calls. These contacts compete for the users' attention and the mobile phone's limited screen capacity. To address this problem, we developed a prototype contact list interface called DMTR, which automatically demotes unused contacts by presenting them in a smaller font at the bottom of the contact list. In phase I of this research, we asked 18 participants to assess for how long they had not used each of their mobile phone contacts. Results show that 47% of all their contacts had not been used for over 6 months or had never been used at all. In phase II, we demoted these unused contacts using DMTR and asked our participants to locate contacts that they had recently used, with and without the prototype. Results indicate that the use of DMTR reduced both the number of key strokes and the retrieval time significantly. The majority of participants indicated that it was easier for them to access their contacts using DMTR and that they would like to use it in their next mobile phone. The results provide strong evidence for the demotion principle suggested by the user-subjective approach.", "paper_title": "You never call: Demoting unused contacts on mobile phones using DMTR", "paper_id": "WOS:000306826800015"}