{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "collaborative_attack_detection"}, {"score": 0.004744437370338926, "phrase": "distributed_and_collaborative_attack_detection_systems_decisions"}, {"score": 0.004406994912939125, "phrase": "intrusion_detection_systems"}, {"score": 0.0033617891884360606, "phrase": "situations_trust"}, {"score": 0.003312486229143855, "phrase": "important_role"}, {"score": 0.0028293966058473476, "phrase": "dishonest_behaviours"}, {"score": 0.0027334673433027086, "phrase": "trust_diversity"}, {"score": 0.002404706573379854, "phrase": "adaptive_scheme"}, {"score": 0.002323142666222693, "phrase": "detection_sensors"}, {"score": 0.0022665781920241245, "phrase": "overall_increase"}, {"score": 0.002233301265743633, "phrase": "detection_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Trust diversity", " Reputation", " Adaptive self-configuration", " Detection quality", " Collaborative attack detection"], "paper_abstract": "In distributed and collaborative attack detection systems decisions are made on the basis of the events reported by many sensors, e.g., Intrusion Detection Systems placed across various network locations. In some cases such events originate at locations over which we have little control, for example because they belong to an organisation that shares information with us. Blindly accepting such reports as real encompasses several risks, as sensors might be dishonest, unreliable or simply having been compromised. In these situations trust plays an important role in deciding whether alerts should be believed or not. In this work we present an approach to maximise the quality of the information gathered in such systems and the resilience against dishonest behaviours. We introduce the notion of trust diversity amongst sensors and argue that detection configurations with such a property perform much better in many respects. Using reputation as a proxy for trust, we introduce an adaptive scheme to dynamically reconfigure the network of detection sensors. Experiments confirm an overall increase both in detection quality and resilience against compromise and misbehaviour. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Trustworthy placements: Improving quality and resilience in collaborative attack detection", "paper_id": "WOS:000331781500007"}