{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_color_spaces"}, {"score": 0.0471913809101942, "phrase": "color_space"}, {"score": 0.034983049830724484, "phrase": "texture_features"}, {"score": 0.0046676969718111765, "phrase": "different_properties"}, {"score": 0.004252296935371162, "phrase": "texture_databases"}, {"score": 0.004173743791750695, "phrase": "prior_determination"}, {"score": 0.0036857412768922827, "phrase": "color_spaces"}, {"score": 0.0030204580407008188, "phrase": "highest_classification_accuracy"}, {"score": 0.002444333100610621, "phrase": "benchmark_texture_databases"}, {"score": 0.0022402661832994094, "phrase": "mcsfs_approach"}, {"score": 0.0021715812867126884, "phrase": "well-classified_images"}, {"score": 0.0021049977753042253, "phrase": "decision_processing_times"}], "paper_keywords": ["Texture classification", " Color spaces", " Feature selection", " Co-occurrence matrix"], "paper_abstract": "The color of pixels can be represented in different color spaces which take into account different properties. However, no color space is well-suited to the discrimination of all texture databases and the prior determination of such a space is not easy. In this paper, we compare the performances reached by two texture classification schemes that use color spaces: (a) the single color space selection approach, that defines a set of texture features and then selects the color space with which the texture features allow to reach the highest classification accuracy, (b) the multi-color space feature selection (MCSFS) approach, that selects texture features which have been processed from images coded into different color spaces. Experiments carried out with benchmark texture databases show that taking advantage simultaneously of the properties of several color spaces thanks to the MCSFS approach improves the rates of well-classified images with lower learning and decision processing times.", "paper_title": "Supervised texture classification: color space or texture feature selection?", "paper_id": "WOS:000313659900001"}