{"auto_keywords": [{"score": 0.04018921998628565, "phrase": "nsga"}, {"score": 0.008283499959322248, "phrase": "nsga-ii"}, {"score": 0.00481495049065317, "phrase": "assembly_cell"}, {"score": 0.004773476989344654, "phrase": "non-dominated_sorting_genetic_algorithm-ii."}, {"score": 0.00457138247462329, "phrase": "flexible_assembly_cell"}, {"score": 0.003980191398041843, "phrase": "first_application"}, {"score": 0.0038613835226952117, "phrase": "genetic_algorithm"}, {"score": 0.0035564156572789473, "phrase": "average_salary_function"}, {"score": 0.003405671497507337, "phrase": "non-dominated_solutions"}, {"score": 0.0032331613500559764, "phrase": "optimal_algorithm_parameters"}, {"score": 0.0031230216871739776, "phrase": "crossover_rate"}, {"score": 0.0030960762496815768, "phrase": "mutation_rate"}, {"score": 0.002913837945508097, "phrase": "experiment_results"}, {"score": 0.0028267701593809877, "phrase": "mopso._computational_study"}, {"score": 0.0026259694526633037, "phrase": "computational_experiments"}, {"score": 0.0023460397258997525, "phrase": "average_satisfaction_degree"}, {"score": 0.0023257824499250653, "phrase": "balanced_preference_structure"}, {"score": 0.0021049977753042253, "phrase": "right_direction"}], "paper_keywords": ["cross-training", " assembly cell", " labour satisfaction", " multi-objective", " NSAG-II"], "paper_abstract": "This research addresses cross-training policies for a flexible assembly cell from the point of view of humanisation and finance. This policy is to determine which labours should be cross-trained and to assign which labours to which tasks. The first application of improved non-dominated sorting genetic algorithm (NSGA-II) to the bi-objective 0-1 integer programming model with an average satisfaction degree and an average salary function is presented. Three performance metrics, including the number of non-dominated solutions, convergence and diversity are used to evaluate the NSGA-II. The optimal algorithm parameters, including the number of iteration, crossover rate and mutation rate are discussed and derived based on a series of experiments. And the experiment results gained by NSGA-II are compared to MOPSO. Computational study shows that the algorithm NSGA-II is convergent and practical to this problem. A series of computational experiments are conducted to get some insights about how the effects of cross-training are influenced by the factors. The results indicate that with regard to Average Satisfaction Degree, balanced preference structure is better than extreme, and with regard to Average Paid Salary, non-uniform salary structure is better than uniform salary structure. Those insights will provide the right direction for practitioners.", "paper_title": "Multi-objective optimal cross-training configuration models for an assembly cell using non-dominated sorting genetic algorithm-II", "paper_id": "WOS:000209144400001"}