{"auto_keywords": [{"score": 0.03734218400951657, "phrase": "communication_performance"}, {"score": 0.034429992434369436, "phrase": "work_interruption"}, {"score": 0.00481495049065317, "phrase": "instant_messaging"}, {"score": 0.00374399358035391, "phrase": "im_tools"}, {"score": 0.0035051129798529, "phrase": "social_networks"}, {"score": 0.0031277316566463978, "phrase": "improved_communication_quality"}, {"score": 0.0028586409810976367, "phrase": "influence_group_outcomes"}, {"score": 0.0025815140309676248, "phrase": "im"}, {"score": 0.0023592715993204796, "phrase": "negative_effects"}, {"score": 0.0022758279600841014, "phrase": "theoretical_and_practical_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Instant messaging (IM)", " Work interruption", " Communication performance", " Communication quality", " Trust", " Group outcomes"], "paper_abstract": "The use of instant messaging (IM) technology at work is controversial, due to the interruptions it may cause and the difficulties associated with quantifying its benefits for individuals, teams and organizations. In this study, we investigate the use and impact of IM tools in the workplace. Based on theories of communication performance and social networks, we propose that while the use of IM will cause work interruption, it will also lead to improved communication quality and the establishment of trust between colleagues. These mediating variables will in turn influence group outcomes. We validate our research model with data collected through a survey of 253 working professionals. The data suggests IM can significantly contribute to communication performance in the workplace, where the benefits overwhelm the negative effects associated with work interruption. The theoretical and practical contribution and implications of the research are discussed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Interactive or interruptive? Instant messaging at work", "paper_id": "WOS:000297889400007"}