{"auto_keywords": [{"score": 0.04768187184530004, "phrase": "arctic"}, {"score": 0.031605404425112275, "phrase": "north_america"}, {"score": 0.00481495049065317, "phrase": "arctic_related_articles"}, {"score": 0.004741395005218184, "phrase": "humanities_and_social_sciences_appearing_in_the_world_core_journals"}, {"score": 0.004256900048174731, "phrase": "ssci"}, {"score": 0.003861175855298779, "phrase": "major_journals"}, {"score": 0.00374399358035391, "phrase": "major_languages"}, {"score": 0.003275807170434343, "phrase": "worldwide_scholars"}, {"score": 0.002546315584783112, "phrase": "largest_amount"}, {"score": 0.002468938912850425, "phrase": "western_european_countries"}, {"score": 0.0024312761724994783, "phrase": "germany"}, {"score": 0.002406448769925337, "phrase": "france"}, {"score": 0.002357249810661667, "phrase": "great_enthusiasm_research"}, {"score": 0.002309242063033298, "phrase": "north_pole_expeditions"}, {"score": 0.0022856052476424344, "phrase": "arctic_research"}, {"score": 0.0022275639370573264, "phrase": "social_sciences"}], "paper_keywords": ["Arctic studies", " Bibliometric study", " Humanities and social sciences"], "paper_abstract": "To demonstrate the importance of Arctic studies in the humanities and social sciences, we collected data from the SSCI and A&HCI covering a period of over 100 years and focused on the number of papers published each year, the major journals, types of documents, major languages represented, authors and their countries publishing the most articles, author's affiliations, collaboration and the major research subjects covered. The results indicate that worldwide scholars had never been absent in this field for more than one century. Countries near the Arctic, particularly in North America and the Nordic, show the most interest and have the most research results. Universities and colleges are the most important research institutions in this field. North America is the area that has conducted the largest amount of research, while some Western European countries such as Germany and France, performed with great enthusiasm research in relation with North Pole expeditions. Arctic research in the humanities and social sciences has gradually expanded from the historical, archaeological, and anthropological fields to the realm of political, social, educational sciences including international relations, music, art, etc.", "paper_title": "A quantitative analysis of Arctic related articles in the humanities and social sciences appearing in the world core journals", "paper_id": "WOS:000303533600004"}