{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "health_informatics"}, {"score": 0.04158629056780342, "phrase": "health_informatics_education"}, {"score": 0.004483120978156604, "phrase": "health_informatics_training"}, {"score": 0.004452731043379068, "phrase": "health_care_professionals"}, {"score": 0.004392565073466714, "phrase": "educational_opportunities"}, {"score": 0.004188287972391714, "phrase": "new_initiative"}, {"score": 0.0038862297330905836, "phrase": "summer_school"}, {"score": 0.003807684498435389, "phrase": "advanced_medical_students"}, {"score": 0.0034497831301482144, "phrase": "international_guidelines"}, {"score": 0.003414728597255129, "phrase": "international_medical_informatics_association-imia._students"}, {"score": 0.0033004240095380623, "phrase": "formative_evaluations"}, {"score": 0.0026995881394357504, "phrase": "course_content"}, {"score": 0.0026091594819333654, "phrase": "decision_support"}, {"score": 0.0025826247025542213, "phrase": "processing_computer_practicums"}, {"score": 0.002479150189700726, "phrase": "competence_requirements"}, {"score": 0.0024623110626032364, "phrase": "medical_doctors"}, {"score": 0.0024289743270061157, "phrase": "imia."}, {"score": 0.0023879358679564527, "phrase": "summer_school_event"}, {"score": 0.0023158019935841235, "phrase": "true_need"}, {"score": 0.002284444272376043, "phrase": "medical_students"}, {"score": 0.002230584233627327, "phrase": "health_informatics_educational_needs"}, {"score": 0.0022078909877264884, "phrase": "future_physicians"}, {"score": 0.002177991273791155, "phrase": "health_informatics_courses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["health informatics", " medical informatics", " education", " international educational exchange"], "paper_abstract": "Purpose: Today, the need for health informatics training for health care professionals is acknowledged and educational opportunities for these professionals are increasing. To contribute to these efforts, a new initiative was undertaken by the Medical Informatics Program of the University of Amsterdam-Academic Medical Center and IPHIE (I Phi E)-the International Partnership for Health Informatics Education. In the year 2004, a summer school on health informatics was organized for advanced medical students from all over the world. Methods: We elaborate on the goals and the program for this summer school. In developing the course, we followed the international guidelines of the international Medical Informatics Association-IMIA. Students provided feedback for the course through both summative and formative evaluations. As a result of these evaluations, we outline the lessons we have learned and what consequences these results have had in revising the course. Results: Overall the results of both the summative and formative evaluation of the summer school showed that we succeeded in the goals we set at the beginning of the course. Students highly appreciated the course content and indicated that the course fulfilled their educational needs. The decision support and image processing computer practicums however proved too high level. We therefore will redesign these practicums to competence requirements of medical doctors as defined by IMIA. All participants recommended the summer school event to other students. Conclusions: Our experiences demonstrated a true need for health informatics education among medical students and that even a 2 weeks course can fulfill health informatics educational needs of these future physicians. Further establishment of health informatics courses for other health professions is recommended. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An international summer school on health informatics: A collaborative effort of the Amsterdam Medical Informatics Program and I Phi E - the International Partnership for Health Informatics Education", "paper_id": "WOS:000247331000005"}