{"auto_keywords": [{"score": 0.04850161465082996, "phrase": "it-based_systems"}, {"score": 0.03768558784871471, "phrase": "final_designs"}, {"score": 0.015461469888833047, "phrase": "judges'_backgrounds"}, {"score": 0.013062049186925015, "phrase": "designers'_activities"}, {"score": 0.012918220492815604, "phrase": "first_phase"}, {"score": 0.012530702296602305, "phrase": "different_tools"}, {"score": 0.012256101540840954, "phrase": "second_phase"}, {"score": 0.010818696298145525, "phrase": "cad_system"}, {"score": 0.00481495049065317, "phrase": "everyday_objects"}, {"score": 0.004761494044422926, "phrase": "externalisation_tools"}, {"score": 0.00470862827326028, "phrase": "professional_designers"}, {"score": 0.004366748508739625, "phrase": "final_design"}, {"score": 0.00428222231579898, "phrase": "manual_design_methods"}, {"score": 0.003916098498242888, "phrase": "two-phase_study"}, {"score": 0.0037869901077566526, "phrase": "design_process"}, {"score": 0.003247435909361318, "phrase": "manual_modelling"}, {"score": 0.003175616603746162, "phrase": "significant_differences"}, {"score": 0.0030197596397721566, "phrase": "design_method"}, {"score": 0.0027923385761972424, "phrase": "specific_assessment_criteria"}, {"score": 0.0026552425134383963, "phrase": "significant_preference"}, {"score": 0.0025604233506352375, "phrase": "different_levels"}, {"score": 0.002510773624196377, "phrase": "assessment_criteria"}, {"score": 0.0024620842899061614, "phrase": "last_result"}, {"score": 0.0024143368618449114, "phrase": "different_groups"}, {"score": 0.0023807981747706376, "phrase": "product_development"}, {"score": 0.002164738347530832, "phrase": "design_assessment"}, {"score": 0.0021406417439887907, "phrase": "cad_environments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Externalising tool", " Computer-aided design", " Manual modelling", " Assessing design", " Judge's background", " Critiquing systems"], "paper_abstract": "Professional designers increasingly rely on IT-based systems in the course of their work. It is therefore crucial to know how such systems, especially computer-aided design (CAD) systems, influence both the design process and the final design, compared with the use of manual design methods. The objective of this paper is twofold: to address this issue and to suggest ways of improving IT-based systems specifically developed to support designers' activities. In the first phase of a two-phase study, we investigated how the use of different tools can affect the design process. In the second phase, we conducted two complementary analyses to determine how the use of different tools affects the assessment of final designs, as well as the effect of the judges' backgrounds on their assessments. We began by comparing the activities of two groups of designers: one group working with a CAD system, the other carrying out manual modelling. The results of this first phase revealed significant differences in the designers' activities (changing the viewpoint, switching tools, correcting errors) according to the design method they used. We then asked judges from four different backgrounds (professional designers, design teachers, retailers and users), to assess the final designs according to specific assessment criteria (aesthetics, originality, functionality, marketability). The results of this second phase revealed a significant preference for objects designed with a CAD system. Furthermore, the judges attributed different levels of importance to each of the assessment criteria, depending on their background. This last result underscored differences in he mental models constructed by different groups of audiences involved in product development and marketing. In addition, it allowed us to identify their specific expectations about final designs. Based on the results of our analyses, we suggest ways of improving IT-based systems with a view to integrating design assessment more fully into CAD environments. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Designing and assessing everyday objects: Impact of externalisation tools and judges' backgrounds", "paper_id": "WOS:000293320200007"}