{"auto_keywords": [{"score": 0.03225203218189473, "phrase": "scientific_community"}, {"score": 0.00481495049065317, "phrase": "research_collaboration"}, {"score": 0.004650896226390719, "phrase": "collnet_network"}, {"score": 0.004389745162172933, "phrase": "social_network"}, {"score": 0.004191377834552202, "phrase": "relevant_publications"}, {"score": 0.004071957673937727, "phrase": "international_collaboration_network"}, {"score": 0.00402514392911723, "phrase": "collnet"}, {"score": 0.003910441483033426, "phrase": "structural_mechanisms"}, {"score": 0.003755307753574745, "phrase": "social_system"}, {"score": 0.0032122679403131537, "phrase": "overall_flow"}, {"score": 0.002461313735611462, "phrase": "major_figures"}, {"score": 0.0021049977753042253, "phrase": "closed_and_isolated_\"core"}], "paper_keywords": ["social network analysis", " cooperation network", " topological structure", " scale-free"], "paper_abstract": "Co-authorship among scientists represents a prototype of a social network. By mapping the graph containing all relevant publications of members in an international collaboration network: COLLNET, we infer the structural mechanisms that govern the topology of this social system. The structure of the network affects the information available to individuals, and their opportunities to collaborate. The structure of the network also affects the overall flow of information, and the nature of the scientific community. We present a number of measures of both the macro- (whole-network) and micro(actor-centered) structure of collaboration, and apply these to COLLNET. We find that this scientific community displays many aspects of a \"small-world,\" and is somewhat vulnerable to disruption should major figures become inactive. We also find inequality in the roles played by individuals in the network. The inequalities, however, do not create a closed and isolated \"core\" or elite. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Connection and stratification in research collaboration: An analysis of the COLLNET network", "paper_id": "WOS:000238967100017"}