{"auto_keywords": [{"score": 0.0492906961612157, "phrase": "explicit_legitimate_states"}, {"score": 0.020975257384025094, "phrase": "legitimate_states"}, {"score": 0.018629801718656212, "phrase": "model_repair"}, {"score": 0.010612387000973441, "phrase": "automated_addition"}, {"score": 0.010267650130679925, "phrase": "automated_model_repair"}, {"score": 0.009453548513587703, "phrase": "original_model"}, {"score": 0.004696491408936132, "phrase": "existing_algorithms"}, {"score": 0.004561950666122737, "phrase": "fault-intolerant_models"}, {"score": 0.003191134522157061, "phrase": "model_repair_increases"}, {"score": 0.0031129231057148775, "phrase": "np"}, {"score": 0.0026135859312619875, "phrase": "explicit_identification"}, {"score": 0.0023750478314945303, "phrase": "increased_cost"}, {"score": 0.0021225958499898182, "phrase": "explicit_knowledge"}, {"score": 0.0021049977753042253, "phrase": "legitimate_state"}], "paper_keywords": ["Model repair", " Program synthesis", " Fault-tolerance", " Automated formal methods"], "paper_abstract": "Existing algorithms for automated model repair for adding fault-tolerance to fault-intolerant models incur an impediment that designers have to identify the set of legitimate states of the original model. This set determines states from where the original model meets its specification in the absence of faults. Experience suggests that of the inputs required for model repair, identifying such legitimate states is the most difficult. In this paper, we consider the problem of automated model repair for adding fault-tolerance where legitimate states are not explicitly given as input. We show that without this input, in some instances, the complexity of model repair increases substantially (from polynomial-time to NP-complete). In spite of this increase, we find that this formulation is relatively complete; i.e., if it was possible to perform model repair with explicit legitimate states, then it is also possible to do so without the explicit identification of the legitimate states. Finally, we show that if the problem of model repair can be solved with explicit legitimate states, then the increased cost of solving it without explicit legitimate states is very small. In summary, the results in this paper identify instances of automated addition of fault-tolerance, where the explicit knowledge of legitimate state is beneficial and where it is not very crucial.", "paper_title": "The complexity of automated addition of fault-tolerance without explicit legitimate states", "paper_id": "WOS:000354708400004"}