{"auto_keywords": [{"score": 0.04681962109027255, "phrase": "lcsh"}, {"score": 0.00481495049065317, "phrase": "library_of_congress"}, {"score": 0.004800240332328532, "phrase": "subject_headings"}, {"score": 0.0047563776685277314, "phrase": "exploratory_study"}, {"score": 0.0047273577269638725, "phrase": "purpose_-_the_purpose"}, {"score": 0.00436575511349828, "phrase": "word_matching"}, {"score": 0.004312622975366672, "phrase": "potential_use"}, {"score": 0.004119049028319832, "phrase": "popular_collaborative_tagging_system"}, {"score": 0.004007083686875716, "phrase": "lcsh._lcsh"}, {"score": 0.003946195919158241, "phrase": "tree_structure"}, {"score": 0.0038271712887391015, "phrase": "close_examination"}, {"score": 0.0035668128900149814, "phrase": "lcsh_tree"}, {"score": 0.003512591457930393, "phrase": "experimental_results"}, {"score": 0.0033961782274326948, "phrase": "lc_subject_headings"}, {"score": 0.0032635467579751423, "phrase": "remaining_tags"}, {"score": 0.0032436052954996097, "phrase": "potential_matches"}, {"score": 0.002878140062594849, "phrase": "zipfian-pattern"}, {"score": 0.002731971103291716, "phrase": "innovative_methods"}, {"score": 0.002633273185094898, "phrase": "effective_access"}, {"score": 0.0026011706232569316, "phrase": "tagged_web_resources"}, {"score": 0.0025537472239953807, "phrase": "multiple_information_repositories"}, {"score": 0.0025071862539276283, "phrase": "practical_implications"}, {"score": 0.002469032978674379, "phrase": "controlled_vocabularies"}, {"score": 0.002424012799998538, "phrase": "information_retrieval_capability"}, {"score": 0.002409188797323273, "phrase": "collaborative_tagging_systems"}, {"score": 0.0022041312401435346, "phrase": "collaborative_tagging_system"}, {"score": 0.0021506938783242215, "phrase": "heading_system"}, {"score": 0.002124461969404541, "phrase": "exploratory_data"}], "paper_keywords": ["Tagging", " Internet", " Subject heading lists"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the linking of a folksonomy (user vocabulary) and LCSH (controlled vocabulary) on the basis of word matching, for the potential use of LCSH in bringing order to folksonomies. Design/methodology/approach - A selected sample of a folksonomy from a popular collaborative tagging system, Delicious, was word-matched with LCSH. LCSH was transformed into a tree structure called an LCSH tree for the matching. A close examination was conducted on the characteristics of folksonomies, the overlap of folksonomies with LCSH, and the distribution of folksonomies over the LCSH tree. Findings - The experimental results showed that the total proportion of tags being matched with LC subject headings constituted approximately two-thirds of all tags involved, with an additional 10 percent of the remaining tags having potential matches. A number of barriers for the linking as well as two areas in need of improving the matching are identified and described. Three important tag distribution patterns over the LCSH tree were identified and supported: skewedness, multifacet, and Zipfian-pattern. Research limitations/implications - The results of the study can be adopted for the development of innovative methods of mapping between folksonomy and LCSH, which directly contributes to effective access and retrieval of tagged web resources and to the integration of multiple information repositories based on the two vocabularies. Practical implications - The linking of controlled vocabularies can be applicable to enhance information retrieval capability within collaborative tagging systems as well as across various tagging system information depositories and bibliographic databases. Originality/value - This is among frontier works that examines the potential of linking a folksonomy, extracted from a collaborative tagging system, to an authority-maintained subject heading system. It provides exploratory data to support further advanced mapping methods for linking the two vocabularies.", "paper_title": "Linking folksonomy to Library of Congress subject headings: an exploratory study", "paper_id": "WOS:000273363800002"}