{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tissue_prolapse"}, {"score": 0.018119288102698448, "phrase": "stenosis_severity"}, {"score": 0.013105560932238917, "phrase": "necrotic_core"}, {"score": 0.01048635253820846, "phrase": "stented_coronary_arteries"}, {"score": 0.009529989879028096, "phrase": "arterial_wall"}, {"score": 0.007455899710158644, "phrase": "atherosclerotic_plaques"}, {"score": 0.006613465139221474, "phrase": "plaque_layers"}, {"score": 0.004672444473700524, "phrase": "multi-layer_atherosclerotic_plaque"}, {"score": 0.004547782274166457, "phrase": "cardiovascular_stents"}, {"score": 0.003972429785872538, "phrase": "vessel_wall"}, {"score": 0.0037972380063356972, "phrase": "current_study"}, {"score": 0.0037181370924317834, "phrase": "plaque_morphology"}, {"score": 0.0036406779213379154, "phrase": "finite_element_method"}, {"score": 0.003448801009772625, "phrase": "corresponding_stresses"}, {"score": 0.0034281134042005654, "phrase": "stenosed_coronary_arteries"}, {"score": 0.003397313647699294, "phrase": "variable_size"}, {"score": 0.003276848046269042, "phrase": "multi-layered_medium"}, {"score": 0.0032085525502105836, "phrase": "single_layer"}, {"score": 0.002870449780891857, "phrase": "arterial_wall_tissue"}, {"score": 0.0028532214778379597, "phrase": "higher_stresses"}, {"score": 0.002819073586200239, "phrase": "fibrosis_layer"}, {"score": 0.0027272537812174365, "phrase": "lower_stresses"}, {"score": 0.0024693083555454133, "phrase": "fibrous_cap"}, {"score": 0.0021433882705962034, "phrase": "coronary_stents"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-layered plaque", " Stenting", " Restenosis", " Atherosclerosis", " Finite element simulations"], "paper_abstract": "Among the many factors influencing the effectiveness of cardiovascular stents, tissue prolapse indicates the potential of a stent to cause restenosis. The deflection of the arterial wall between the struts of the stent and the tissue is known as a prolapse or draping. The prolapse is associated with injury and damage to the vessel wall due to the high stresses generated around the stent when it expands. The current study investigates the impact of stenosis severity and plaque morphology on prolapse in stented coronary arteries. A finite element method is applied for the stent, plaque, and artery set to quantify the tissue prolapse and the corresponding stresses in stenosed coronary arteries. The variable size of atherosclerotic plaques is considered. A plaque is modelled as a multi-layered medium with different thicknesses attached to the single layer of an arterial wall. The results reveal that the tissue prolapse is influenced by the degree of stenosis severity and the thickness of the plaque layers. Stresses are observed to be significantly different between the plaque layers and the arterial wall tissue. Higher stresses are concentrated in fibrosis layer of the plaque (the harder core), while lower stresses are observed in necrotic core (the softer core) and the arterial wall layer. Moreover, the morphology of the plaque regulates the magnitude and distribution of the stress. The fibrous cap between the necrotic core and the endothelium constitutes the most influential layer to alter the stresses. In addition, the thickness of the necrotic core and the stenosis severity affect the stresses. This study reveals that the morphology of atherosclerotic plaques needs to be considered a key parameter in designing coronary stents. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Tissue prolapse and stresses in stented coronary arteries: A computer model for multi-layer atherosclerotic plaque", "paper_id": "WOS:000365367400005"}