{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "electric_and_hybrid_propulsion_systems"}, {"score": 0.004342430078306461, "phrase": "commercial_hybrid_electric_vehicles"}, {"score": 0.004236074477264556, "phrase": "high-torque_density"}, {"score": 0.004132312946154097, "phrase": "good_flux-weakening"}, {"score": 0.004098291340525772, "phrase": "fault-tolerance_performance"}, {"score": 0.0039323225960857956, "phrase": "recent_development"}, {"score": 0.00389994107619882, "phrase": "research_challenges"}, {"score": 0.0036202043425301042, "phrase": "fractional_slot_pm_brushless_machines"}, {"score": 0.0029194625087935345, "phrase": "flux-weakening_capability"}, {"score": 0.0028953973490895746, "phrase": "fault-tolerant_performance"}, {"score": 0.0028010985923790036, "phrase": "iron_loss"}, {"score": 0.00276653157720066, "phrase": "eddy_current_loss"}, {"score": 0.0027437235598539904, "phrase": "unbalanced_magnetic_force"}, {"score": 0.0027211030647461324, "phrase": "acoustic_noise"}, {"score": 0.0025999744005191713, "phrase": "rich_mmf_harmonics"}, {"score": 0.002373615081691254, "phrase": "reluctance_torque_component"}, {"score": 0.002286781334850213, "phrase": "interior_pm_rotor"}, {"score": 0.002203117204010397, "phrase": "first_overview_paper"}, {"score": 0.0021579641460002523, "phrase": "recent_development_and_research_challenges"}, {"score": 0.0021401625519713577, "phrase": "fractional-slot_pm_machines"}], "paper_keywords": ["Acoustics", " Torque", " Fault tolerance", " Flux", " Inductance", " Electromagnetism"], "paper_abstract": "Purpose - Fractional slot permanent magnet (PM) brushless machines having concentrated non-overlapping windings have been the subject of research over last few years. They have already been employed in the commercial hybrid electric vehicles (HEVs) due to high-torque density, high efficiency, low-torque ripple, good flux-weakening and fault-tolerance performance. The purpose of this paper is to overview recent development and research challenges in such machines in terms of various structural and design features for electric vehicle (EV)/HEV applications. Design/methodology/approach - In the paper, fractional slot PM brushless machines are overviewed according to the following main and sub-topics: first, machine topologies: slot and pole number combinations, all and alternate teeth wound (double- and single-layer windings), unequal tooth structure, modular stator, interior magnet rotor; second, machine parameters and control performance: winding inductances, flux-weakening capability, fault-tolerant performance; and third, parasitic effects: cogging torque, iron loss, rotor eddy current loss, unbalanced magnetic force, acoustic noise and vibration. Findings - Many fractional slot PM machine topologies exist. Owing to rich mmf harmonics, fractional slot PM brushless machines exhibit relatively high rotor eddy current loss, potentially high unbalanced magnetic force and acoustic noise and vibration, while the reluctance torque component is relatively low or even negligible when an interior PM rotor is employed. Originality/value - This is the first overview paper which systematically reviews the recent development and research challenges in fractional-slot PM machines. It summarizes their various structural and design features for EV/FIEV applications.", "paper_title": "Fractional slot permanent magnet brushless machines and drives for electric and hybrid propulsion systems", "paper_id": "WOS:000288567800002"}