{"auto_keywords": [{"score": 0.03607193718580959, "phrase": "unlabeled_examples"}, {"score": 0.00481495049065317, "phrase": "unlabeled_data"}, {"score": 0.004760518730536645, "phrase": "peer-to-peer_traffic_classification"}, {"score": 0.004618342952383313, "phrase": "unlabeled_training_examples"}, {"score": 0.004480394224548146, "phrase": "labeled_examples"}, {"score": 0.003923532450854754, "phrase": "port-based_heuristic_rule"}, {"score": 0.0038352452380298464, "phrase": "even_fewer_examples"}, {"score": 0.0033455764382772754, "phrase": "internet_data"}, {"score": 0.0032951702142329357, "phrase": "large_volumes"}, {"score": 0.0031845067058084583, "phrase": "new_communities"}, {"score": 0.0031127970604842375, "phrase": "old_communities"}, {"score": 0.002874257080906824, "phrase": "concept_drift"}, {"score": 0.0027566738323014, "phrase": "incremental_tritraining"}, {"score": 0.002643888053328987, "phrase": "real_data_stream"}, {"score": 0.0025260919226344305, "phrase": "itt_algorithm"}, {"score": 0.0023591417077156555, "phrase": "dynamic_nature"}, {"score": 0.0021948455916770233, "phrase": "ip_layer"}, {"score": 0.0021617392821644005, "phrase": "privacy_concern"}, {"score": 0.0021049977753042253, "phrase": "deep_packet_inspection"}], "paper_keywords": ["Stream data mining", " Concept drift", " Windowing technique", " Tri-training", " Unlabeled data", " Peer-to-peer traffic", " IP traffic identification"], "paper_abstract": "Unlabeled training examples are readily available in many applications, but labeled examples are fairly expensive to obtain. For instance, in our previous works on classification of peer-to-peer (P2P) Internet traffics, we observed that only about 25% of examples can be labeled as \"P2P\" or \"NonP2P\" using a port-based heuristic rule. We also expect that even fewer examples can be labeled in the future as more and more P2P applications use dynamic ports. This fact motivates us to investigate the techniques which enhance the accuracy of P2P traffic classification by exploiting the unlabeled examples. In addition, the Internet data flows dynamically in large volumes ( streaming data). In P2P applications, new communities of peers often join and old communities of peers often leave, requiring the classifiers to be capable of updating the model incrementally, and dealing with concept drift. Based on these requirements, this paper proposes an incremental TriTraining (iTT) algorithm. We tested our approach on a real data stream with 7.2 Mega labeled examples and 20.4 Mega unlabeled examples. The results show that iTT algorithm can enhance accuracy of P2P traffic classification by exploiting unlabeled examples. In addition, it can effectively deal with dynamic nature of streaming data to detect the changes in communities of peers. We extracted attributes only from the IP layer, eliminating the privacy concern associated with the techniques that use deep packet inspection.", "paper_title": "Exploiting unlabeled data to improve peer-to-peer traffic classification using incremental tri-training method", "paper_id": "WOS:000284090800002"}