{"auto_keywords": [{"score": 0.037900362700049935, "phrase": "web_architecture"}, {"score": 0.00481495049065317, "phrase": "human_names"}, {"score": 0.004268780663872836, "phrase": "non-accessible_thing"}, {"score": 0.004199247711875386, "phrase": "similar_manner"}, {"score": 0.004063547375196532, "phrase": "natural_language"}, {"score": 0.0036419834462626125, "phrase": "underlying_problems"}, {"score": 0.0030899524399043863, "phrase": "popular_belief"}, {"score": 0.0028150302583265655, "phrase": "kriple"}, {"score": 0.0027389142053945246, "phrase": "eternal_and_unique_identification"}, {"score": 0.002550481822137976, "phrase": "unambiguous_resolution"}, {"score": 0.0021049977753042253, "phrase": "practical_ways"}], "paper_keywords": ["metadata", " ontologies", " semiotics", " under data resource management-Web architecture", " under software-data semantics"], "paper_abstract": "URIs, a universal identification scheme, are different from human names insofar as they can provide the ability to reliably access the thing identified. URIs also can function to reference a non-accessible thing in a similar manner to how names function in natural language. There are two distinctly different relationships between names and things: access and reference. To confuse the two relations leads to underlying problems with Web architecture. References is by nature ambiguous in any language. So any attempts by Web architecture to make reference completely unambiguous will fail on the Web. Despite popular belief otherwise, making further ontological distinctions often leads to more ambiguity, not less. contrary to appeals to Kriple for some sort of eternal and unique identification, reference on the Web uses descriptions and therefore there is no unambiguous resolution of reference. On the Web, what is needed is not just a simple redirection, but a uniform and logically consistent manner of associating descriptions with URIs that can be done in a number of practical ways that should be made consistent.", "paper_title": "In defense of ambiguity", "paper_id": "WOS:000255851700002"}