{"auto_keywords": [{"score": 0.04880638758905066, "phrase": "introductory_educational_technology_course"}, {"score": 0.04289311160718139, "phrase": "preservice_teachers"}, {"score": 0.03653968772289337, "phrase": "technology-using_teachers"}, {"score": 0.00481495049065317, "phrase": "preservice_teacher_beliefs"}, {"score": 0.004562362497952548, "phrase": "preservice_teachers'_initial_beliefs"}, {"score": 0.004208002469225673, "phrase": "specific_technology-integrated_pedagogical_strategies"}, {"score": 0.004005083535629333, "phrase": "traditional_teacher-centered_beliefs"}, {"score": 0.003660788124282824, "phrase": "mid-atlantic_university"}, {"score": 0.003595552309967789, "phrase": "data_sources"}, {"score": 0.003563370084662192, "phrase": "pre-_and_post-course_drawings"}, {"score": 0.003376216135716632, "phrase": "weekly_reflective_entries"}, {"score": 0.0032863459256972896, "phrase": "blogging_assignment"}, {"score": 0.002936849401568391, "phrase": "post-course_drawings"}, {"score": 0.0028586409810976367, "phrase": "participants'_beliefs"}, {"score": 0.0026362590493392785, "phrase": "reflective_blog_entries"}, {"score": 0.002366361492754389, "phrase": "lesser_extent"}, {"score": 0.002124036931047162, "phrase": "technology_courses"}, {"score": 0.0021049977753042253, "phrase": "teacher_education_programs"}], "paper_keywords": ["Elementary education", " Improving classroom teaching", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "This study investigated entering preservice teachers' initial beliefs and ideas with regard to the role of technology in teaching and learning. It also examined specific technology-integrated pedagogical strategies and their potential to help preservice teachers begin to shift from traditional teacher-centered beliefs to a more student-centered mindset. The work was conducted in the context of an introductory educational technology course for preservice teachers in a Mid-Atlantic University in the United States. Data sources included pre- and post-course drawings where participants depicted themselves as technology-using teachers, drawing reflections, and weekly reflective entries submitted in response to a blogging assignment. Findings indicated that preservice teachers enter their training programs with traditional, teacher-centered beliefs about the use of technology and the roles of technology-using teachers and students. Analysis of post-course drawings, however, indicated that participants' beliefs began to shift from largely teacher-centered to more mixed teacher- and student-centered. Analysis of reflective blog entries also demonstrated that participants reflected predominantly on how technology can provide opportunities for students, teachers and parents to collaborate. To a lesser extent, participants reflected on how technology can enhance teaching and learning. Based on these findings, implications specifically related to stand alone technology courses and teacher education programs are discussed. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Drawing on technology: An investigation of preservice teacher beliefs in the context of an introductory educational technology course", "paper_id": "WOS:000316523100026"}