{"auto_keywords": [{"score": 0.03724793858998928, "phrase": "individual_songs"}, {"score": 0.004366970206156021, "phrase": "portable_devices"}, {"score": 0.004174451361776433, "phrase": "individual_music_collections"}, {"score": 0.0038144050983900286, "phrase": "recommendation_systems"}, {"score": 0.003659890662429693, "phrase": "music_recommendation_system"}, {"score": 0.0036324746826127997, "phrase": "special_challenges"}, {"score": 0.0034722233102219466, "phrase": "entire_albums"}, {"score": 0.003232779373179631, "phrase": "information_extraction_and_generation_techniques"}, {"score": 0.003125175084962886, "phrase": "album_reviews"}, {"score": 0.002953711377604328, "phrase": "extraction_components"}, {"score": 0.0027499252661633525, "phrase": "song_review_summaries"}, {"score": 0.002729307099580315, "phrase": "users'_decision-making_processes"}, {"score": 0.0025989960809479104, "phrase": "quicker_decisions"}, {"score": 0.002502995662011305, "phrase": "smaller_size"}, {"score": 0.0023127544795063263, "phrase": "specific_recommendation"}, {"score": 0.0021530945641993152, "phrase": "natural_language_processing"}, {"score": 0.0021049977753042253, "phrase": "effective_end-to-end_system"}], "paper_keywords": [""], "paper_abstract": "In recent years, the availability of too much information has become a fact of life for anybody connected with the Internet. The same is true for music: because of the penetration of portable devices and the availability of millions of tracks on the web, individual music collections have become unwieldy. Users need tools to help search their own song collections, and to recommend songs they may be interested in. Whereas recommendation systems have been developed for a variety of products, a music recommendation system presents special challenges, including the ability to recommend individual songs, as opposed to entire albums, even if only full album reviews are available on-line. SongRecommend, our music recommendation system, combines information extraction and generation techniques to produce summaries of reviews of individual songs from album reviews. We present a number of evaluations for SongRecommend: intrinsic evaluations of the extraction components, and of the informativeness of the summaries; and a user study of the impact of the song review summaries on users' decision-making processes. When presented with the summary, users were able to make quicker decisions, and their choices were more varied. Whereas the smaller size of the summary has an impact on time-on-task, users do not appear to choose a specific recommendation only based on number of words. Our work demonstrates that state-of-the-art techniques in Natural Language Processing can be integrated into an effective end-to-end system.", "paper_title": "SongRecommend: From summarization to recommendation", "paper_id": "WOS:000332383400002"}