{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimal_design"}, {"score": 0.019516017566354064, "phrase": "cchp_systems"}, {"score": 0.01841314268134317, "phrase": "constant_efficiency_assumption"}, {"score": 0.0047026237903774895, "phrase": "combined_cooling"}, {"score": 0.003626626504149897, "phrase": "design_characteristics"}, {"score": 0.00314708280192844, "phrase": "total_annual_cost"}, {"score": 0.002914288956035066, "phrase": "off-design_characteristics"}, {"score": 0.0027961342030212353, "phrase": "comparative_studies"}, {"score": 0.002763261749602258, "phrase": "different_models"}, {"score": 0.0023694065215394593, "phrase": "thermal_storage_facilities"}, {"score": 0.0023139986108451967, "phrase": "power_grid"}, {"score": 0.002286781334850213, "phrase": "well_designed_operation_strategies"}, {"score": 0.002233301265743633, "phrase": "negative_impacts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CCHP", " Off-design characteristics", " Internal combustion engine", " Absorption chiller"], "paper_abstract": "Optimal design and operation of combined cooling, heating and power (CCHP) systems are complicated due to the fluctuating energy demands. Many mathematical models for the design and/or operation of CCHP systems have been developed. Most of them adopt a constant efficiency assumption, whilst others take equipment off-design characteristics into account. In this paper, we present two mathematical models for the optimal design and operation of CCHP systems with the target of minimising the total annual cost. One model is formulated using the constant efficiency assumption. In the other model, off-design characteristics of all equipments are considered. Comparative studies using different models were performed to examine the impacts of equipment off-design characteristics on the accuracy of the optimal design of CCHP systems. Results show that introduction of thermal storage facilities, connection to power grid and well designed operation strategies can diminish the negative impacts of adopting the constant efficiency assumption. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Impacts of equipment off-design characteristics on the optimal design and operation of combined cooling, heating and power systems", "paper_id": "WOS:000311887300005"}