{"auto_keywords": [{"score": 0.04445718982496923, "phrase": "probability_distribution"}, {"score": 0.00481495049065317, "phrase": "directed_graph"}, {"score": 0.004688321299229397, "phrase": "link-based_covariance_measure"}, {"score": 0.004565007074039171, "phrase": "weighted_directed_graph"}, {"score": 0.003995226376780718, "phrase": "total_expected_cost"}, {"score": 0.0038385317554884713, "phrase": "total_relative_entropy_spread"}, {"score": 0.003687960013746783, "phrase": "boltzmann_distribution"}, {"score": 0.002965684305115369, "phrase": "same-preferably_short-paths"}, {"score": 0.0027495914857929584, "phrase": "gram_matrix"}, {"score": 0.002689076130099546, "phrase": "valid_kernel"}, {"score": 0.0025605773834404253, "phrase": "n_x"}, {"score": 0.0025492038831408715, "phrase": "n_matrix"}, {"score": 0.0023845255359681143, "phrase": "betweenness_score"}, {"score": 0.0023113506171584157, "phrase": "expected_number"}, {"score": 0.002200861826643147, "phrase": "proposed_measures"}, {"score": 0.0021143936116203594, "phrase": "betweenness_centrality"}], "paper_keywords": ["Graph mining", " kernel on a graph", " shortest path", " correlation measure", " betweenness measure", " resistance distance", " commute time distance", " biased random walk", " semi-supervised classification"], "paper_abstract": "This work introduces a link-based covariance measure between the nodes of a weighted directed graph, where a cost is associated with each arc. To this end, a probability distribution on the (usually infinite) countable set of paths through the graph is defined by minimizing the total expected cost between all pairs of nodes while fixing the total relative entropy spread in the graph. This results in a Boltzmann distribution on the set of paths such that long (high-cost) paths occur with a low probability while short (low-cost) paths occur with a high probability. The sum-over-paths (SoP) covariance measure between nodes is then defined according to this probability distribution: two nodes are considered as highly correlated if they often co-occur together on the same-preferably short-paths. The resulting covariance matrix between nodes (say n nodes in total) is a Gram matrix and therefore defines a valid kernel on the graph. It is obtained by inverting an n x n matrix depending on the costs assigned to the arcs. In the same spirit, a betweenness score is also defined, measuring the expected number of times a node occurs on a path. The proposed measures could be used for various graph mining tasks such as computing betweenness centrality, semi-supervised classification of nodes, visualization, etc., as shown in Section 7.", "paper_title": "The Sum-over-Paths Covariance Kernel: A Novel Covariance Measure between Nodes of a Directed Graph", "paper_id": "WOS:000276671900012"}