{"auto_keywords": [{"score": 0.03902269339461907, "phrase": "fuzzy_extractors"}, {"score": 0.004653667500876187, "phrase": "strong_link"}, {"score": 0.004594582559945568, "phrase": "paper_medium"}, {"score": 0.004421770937919324, "phrase": "interesting_alternative"}, {"score": 0.0043656173407379895, "phrase": "unauthorised_copy"}, {"score": 0.004328576620172575, "phrase": "content_modification_attempts"}, {"score": 0.004148014765950199, "phrase": "show_tickets"}, {"score": 0.004043298628655316, "phrase": "medical_prescripts"}, {"score": 0.00387459052649752, "phrase": "low-cost_solution"}, {"score": 0.003776750773624222, "phrase": "digital_signatures"}, {"score": 0.0037446875860947916, "phrase": "physically_unclonable_functions"}, {"score": 0.0036657110980445416, "phrase": "proposed_protocol"}, {"score": 0.0033232673019931206, "phrase": "paper_holder"}, {"score": 0.003211788912325178, "phrase": "ultra-violet_fibres"}, {"score": 0.003130633384437765, "phrase": "paper_mixture"}, {"score": 0.002924074850256874, "phrase": "digital_signature"}, {"score": 0.0026282000779095987, "phrase": "careful_statistical_analysis"}, {"score": 0.0022926465161639633, "phrase": "proposed_application"}, {"score": 0.0021049977753042253, "phrase": "exactly_the_same_methodology"}], "paper_keywords": [""], "paper_abstract": "Establishing a strong link between the paper medium and the data represented on it is an interesting alternative to defeat unauthorised copy and content modification attempts. Many applications would benefit from it, such as show tickets, contracts, banknotes or medical prescripts. In this study, the authors present a low-cost solution that establishes such a link by combining digital signatures, physically unclonable functions and fuzzy extractors. The proposed protocol provides two levels of security that can be used according to the time available for verifying the signature and the trust in the paper holder. In practice, this solution uses ultra-violet fibres that are poured into the paper mixture. Fuzzy extractors are then used to build identifiers for each sheet of paper and a digital signature is applied to the combination of these identifiers and the data to be protected from copy and modification. The authors additionally provide a careful statistical analysis of the robustness and amount of randomness reached by the extractors. The authors conclude that identifiers of 72 bits can be derived, which is assumed to be sufficient for the proposed application. However, more randomness, robustness and unclonability could be obtained at the cost of a more expensive process, keeping exactly the same methodology.", "paper_title": "How to strongly link data and its medium: the paper case", "paper_id": "WOS:000284134100002"}