{"auto_keywords": [{"score": 0.04138004346476481, "phrase": "product_derivation"}, {"score": 0.00481495049065317, "phrase": "product_line"}, {"score": 0.004782587436296574, "phrase": "software_assets"}, {"score": 0.004671012181488876, "phrase": "effective_product_derivation_process"}, {"score": 0.004455575231721042, "phrase": "shared_assets"}, {"score": 0.004264395507931215, "phrase": "relatively_little_work"}, {"score": 0.004178935413340453, "phrase": "product_derivation_process"}, {"score": 0.003972673543700013, "phrase": "empirical_reports"}, {"score": 0.003919404114585274, "phrase": "industrial_settings"}, {"score": 0.0036883616416213206, "phrase": "informal_studies"}, {"score": 0.0034475308539463323, "phrase": "multi-case_study_design"}, {"score": 0.0030017207229983385, "phrase": "cross-case_analysis_approach"}, {"score": 0.002951444412262927, "phrase": "research_approach"}, {"score": 0.002892219926795975, "phrase": "case_study_outcomes"}, {"score": 0.002872742947035998, "phrase": "different_perspectives"}, {"score": 0.0027492917990724467, "phrase": "context_specific_strategies"}, {"score": 0.00257831812581194, "phrase": "method-in-action_insights"}, {"score": 0.0024842242921857705, "phrase": "iterative_and_incremental_product_derivation"}, {"score": 0.0024343522820859578, "phrase": "platform_components"}, {"score": 0.0024016604071771556, "phrase": "product_databases"}, {"score": 0.002199582070223336, "phrase": "starting_point"}, {"score": 0.00218475927820919, "phrase": "new_industrial_reports"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Case study", " Multiple case study", " Constant comparison analysis", " Cross-case analysis", " Product derivation", " Software product lines"], "paper_abstract": "Context: The process of constructing a product from a product line of software assets is known product derivation. An effective product derivation process is important in order to ensure that the efforts required to develop these shared assets is lower than the benefits achieved through their use. Despite its importance, relatively little work has been dedicated to the product derivation process and the strategies applied in practice. Additionally, there is a lack of empirical reports describing product derivation in industrial settings, and, in general, where these reports are available, they have been conducted as informal studies. Objective: Our aim is to investigate how product derivation is performed in practice. Method: We apply a multi-case study design to two different industrial software product line projects with the goal of investigating how they derive their products in practice. The findings from our studies were individually analyzed using the Constant Comparison technique. In order to identify patterns across these studies, the findings were compared using a Cross-case analysis approach. Results: The research approach allowed us to examine the case study outcomes from different perspectives, capturing similarities and differences. From the cases, we identified context specific strategies for product derivation which are easier for practitioners to contextualise and implement. Conclusions: The case studies provide method-in-action insights into concepts explored in the literature, such as: iterative and incremental product derivation, instantiation and integration of platform components and derivation of product databases. Practitioners can use this work as a basis for defining, adapting or evaluating their own product derivation approaches. While researchers can use this work as a starting point for new industrial reports, presenting their experiences with product derivation. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Product derivation in practice", "paper_id": "WOS:000347022800019"}