{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "itemset_support_distribution"}, {"score": 0.004511373893354558, "phrase": "power-law_relationship"}, {"score": 0.004456611869693865, "phrase": "self-similar_phenomenon"}, {"score": 0.004025258572860201, "phrase": "natural_phenomena"}, {"score": 0.003771282384646587, "phrase": "frequent-itemset_mining"}, {"score": 0.0036652492107503956, "phrase": "explosive_number"}, {"score": 0.00335095982979018, "phrase": "targeted_data"}, {"score": 0.0032302647179383915, "phrase": "valid_and_cost-effective_algorithm"}, {"score": 0.0029053904956617043, "phrase": "novel_mechanisms"}, {"score": 0.0027330029055210926, "phrase": "subtle_parameter"}, {"score": 0.002699769374493867, "phrase": "approximate_frequent_itemsets"}, {"score": 0.002677837900473396, "phrase": "data_streams"}, {"score": 0.0025918745925152423, "phrase": "sufficient_sample_size"}, {"score": 0.002570817338292482, "phrase": "mining_frequent_patterns"}, {"score": 0.002498452620621318, "phrase": "ppl"}, {"score": 0.002331054401198527, "phrase": "empirical_studies"}, {"score": 0.0021926693625590006, "phrase": "previous_works"}, {"score": 0.0021571717917276724, "phrase": "prominent_advantage"}, {"score": 0.0021049977753042253, "phrase": "important_pre-processing_means"}], "paper_keywords": [""], "paper_abstract": "In this paper, we identify and explore that the power-law relationship and the self-similar phenomenon appear in the itemset support distribution. The itemset support distribution refers to the distribution of the count of itemsets versus their supports. Exploring the characteristics of these natural phenomena is useful to many applications such as providing the direction of tuning the performance of the frequent-itemset mining. However, due to the explosive number of itemsets, it is prohibitively expensive to retrieve lots of itemsets before we identify the characteristics of the itemset support distribution in targeted data. As such, we also propose a valid and cost-effective algorithm, called algorithm PPL, to extract characteristics of the itemset support distribution. Furthermore, to fully explore the advantages of our discovery, we also propose novel mechanisms with the help of PPL to solve two important problems: (1) determining a subtle parameter for mining approximate frequent itemsets over data streams; and (2) determining the sufficient sample size for mining frequent patterns. As validated in our experimental results, PPL can efficiently and precisely identify the characteristics of the itemset support distribution in various real data. In addition, empirical studies also demonstrate that our mechanisms for those two challenging problems are in orders of magnitude better than previous works, showing the prominent advantage of PPL to be an important pre-processing means for mining applications.", "paper_title": "Power-law relationship and self-similarity in the itemset support distribution: analysis and applications", "paper_id": "WOS:000257396700008"}