{"auto_keywords": [{"score": 0.04204224612471484, "phrase": "bsc"}, {"score": 0.013454778029116198, "phrase": "dea"}, {"score": 0.008453717418226814, "phrase": "operational_efficiency"}, {"score": 0.00789646322104652, "phrase": "cross-sectional_research_design"}, {"score": 0.006871584638360013, "phrase": "efficiency_frontiers"}, {"score": 0.00481495049065317, "phrase": "airlines'_performance"}, {"score": 0.004718314112245913, "phrase": "integrated_dea-bsc_model"}, {"score": 0.00441738161338662, "phrase": "empirical_study"}, {"score": 0.004328689762198895, "phrase": "operational_and_financial_data"}, {"score": 0.004263336444795021, "phrase": "annual_reports"}, {"score": 0.004241771072194993, "phrase": "business_reports"}, {"score": 0.003981195726151431, "phrase": "dea._findings"}, {"score": 0.0036522170598450865, "phrase": "leading_indicators"}, {"score": 0.00348916549487384, "phrase": "excellent_performance"}, {"score": 0.003462704420080129, "phrase": "efficient_frontiers"}, {"score": 0.003291336101694653, "phrase": "dea-bsc_model"}, {"score": 0.0032088487124106936, "phrase": "empirical_results"}, {"score": 0.0031125795874844438, "phrase": "individual_dea"}, {"score": 0.0030968180587027105, "phrase": "bsc."}, {"score": 0.002943502888225748, "phrase": "future_research"}, {"score": 0.0029137604783116065, "phrase": "longitudinal_study"}, {"score": 0.002884317729022721, "phrase": "time_series"}, {"score": 0.002847931120161109, "phrase": "leading_factors"}, {"score": 0.002833504964489131, "phrase": "lagging_factors"}, {"score": 0.002769483748975581, "phrase": "integrated_model"}, {"score": 0.002713788481577828, "phrase": "dea."}, {"score": 0.002618995204424126, "phrase": "operational_performance"}, {"score": 0.002501955525421155, "phrase": "dea-bsc_results"}, {"score": 0.002420685428036557, "phrase": "benchmark_learning_partners"}, {"score": 0.002408418252301989, "phrase": "business_executives"}, {"score": 0.002348006402273998, "phrase": "previous_studies"}, {"score": 0.002277504520722408, "phrase": "airline_industry"}, {"score": 0.002131912585982578, "phrase": "airline_companies"}], "paper_keywords": ["Balanced scorecard", " Data envelopment analysis", " Airline performance", " Bench marking"], "paper_abstract": "Purpose - This study purposed an integrated DEA-BSC model to evaluate the operational efficiency of airlines. To adapt this model, 38 major airlines in the world were selected to assess their relative performance. Design/methodology/approach - An empirical study is employed using a cross-sectional research design. The operational and financial data of 38 leading airlines companies were collected from annual reports and business reports. Specifically, this study integrated the concepts of balanced scorecard (BSC) and data envelopment analysis (DEA) and incorporated seven leading variables and four lagging variables from BSC to implement DEA. Findings - By using the leading and lagging variables to implement DEA, this study not only assessed the efficiency frontiers, input slack, output slacks, and benchmarking learning partners of 38 airlines, but also illustrated how leading indicators are related and influence lagging indicators. In particular, the study results indicated that airlines with excellent performance in the efficient frontiers tended to perform better in energy, capital, and other operating costs. Research limitations/implications - This study presented a DEA-BSC model to integrate the concepts of BSC into DEA. The empirical results showed that the model is more advanced than the capabilities of individual DEA and BSC. This model could also eliminate the faults of each one. Due to the cross-sectional research design of this research, future research should develop the longitudinal study to identify the time series of the influences of leading factors on lagging factors. Practical implications - This study offered an integrated model that incorporated the concepts of BSC and DEA. The leading and lagging factors of BSC were adopted to the evaluation of operational performance of airlines along with DEA. Therefore, BSC has served as the compliment of DEA. Using the DEA-BSC results, such as the efficiency frontiers, the amount of slacks, and benchmark learning partners, business executives could develop their improvement strategies. Originality/value - Since none of previous studies have integrated BSC and DEA to assess the operational efficiency of the airline industry, the results of this study could serve as a baseline for further academic validations, the results could also be very useful for the executives of airline companies to allocate their resources for further improvement.", "paper_title": "A balanced scorecard envelopment approach to assess airlines' performance", "paper_id": "WOS:000330079500008"}