{"auto_keywords": [{"score": 0.004554082077300675, "phrase": "considerable_attention"}, {"score": 0.004408456735066782, "phrase": "fuzzy_dls"}, {"score": 0.004247696749118451, "phrase": "fuzzy_owl"}, {"score": 0.00411182818527434, "phrase": "highly_inexpressive_ones"}, {"score": 0.0034785371344994197, "phrase": "adequate_expressive_power"}, {"score": 0.003414467360488913, "phrase": "efficient_reasoning_algorithms"}, {"score": 0.003244275497488318, "phrase": "previous_fuzzy_extensions"}, {"score": 0.003199345207727474, "phrase": "fuzzy_extension"}, {"score": 0.003111336942540226, "phrase": "straightforward_task"}, {"score": 0.0030257422786589723, "phrase": "main_motivation"}, {"score": 0.002874870266177579, "phrase": "datalog_rules"}, {"score": 0.002693717881878714, "phrase": "rl"}, {"score": 0.0026195184143518713, "phrase": "fuzzy_setting"}, {"score": 0.0025592969422491476, "phrase": "equivalent_fuzzy_datalog_rules"}, {"score": 0.002267708463966758, "phrase": "large_extent"}, {"score": 0.002164602220179823, "phrase": "experimental_evaluation"}], "paper_keywords": ["fuzzy ontologies", " fuzzy description logics", " fuzzy OWL 2 RL", " fuzzy datalog"], "paper_abstract": "Fuzzy extensions to description logics (DLs) have gained considerable attention the last decade. So far most works on fuzzy DLs have focused on either very expressive languages, like fuzzy OWL and OWL 2, or on highly inexpressive ones, like fuzzy OWL 2 QL and fuzzy OWL 2 EL. To the best of our knowledge, a fuzzy extension to the language OWL 2 RL has not been thoroughly studied so far. This language is very relevant since it combines both adequate expressive power as well as efficient reasoning algorithms which can be realized using rule-based (Datalog) technologies. In contrast to previous fuzzy extensions, a fuzzy extension of OWL 2 RL is not a straightforward task for the following reason. The main motivation of OWL 2 RL is that its axioms can be equivalently represented as Datalog rules. Hence, to achieve our goal we need to investigate which OWL 2 RL axioms when interpreted under the fuzzy setting can be transformed to equivalent fuzzy Datalog rules. We show that this is not, in general, possible for all axioms but we show that this 'issue' can to a large extent be alleviated. Moreover, we have performed an experimental evaluation with many well-known ontologies which showed that such axioms are not used so often in practice.", "paper_title": "A Fuzzy Extension to the OWL 2 RL Ontology Language", "paper_id": "WOS:000365157000013"}