{"auto_keywords": [{"score": 0.04933518495635902, "phrase": "eeg"}, {"score": 0.01061224842216404, "phrase": "powerline_interference"}, {"score": 0.010530015382902498, "phrase": "ecg"}, {"score": 0.004575977644865379, "phrase": "precise_information"}, {"score": 0.004469700997700534, "phrase": "measured_electrophysiological_data"}, {"score": 0.004036852178449883, "phrase": "bioelectric_signals"}, {"score": 0.0036315039559860654, "phrase": "abnormal_physiological_activity"}, {"score": 0.0036031440110534853, "phrase": "electromagnetic_contamination"}, {"score": 0.0035750047462243836, "phrase": "recorded_signals"}, {"score": 0.0035332058983966424, "phrase": "major_source"}, {"score": 0.0032667240408191015, "phrase": "effective_method"}, {"score": 0.0029384777371425862, "phrase": "rbf_filter"}, {"score": 0.0029040994533437903, "phrase": "wiener_filter"}, {"score": 0.0028701222153940283, "phrase": "full_use"}, {"score": 0.0025715131759585052, "phrase": "proposed_method"}, {"score": 0.002462867872567125, "phrase": "noisy_ecg"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electromagnetic interference", " Powerline", " Biomedical signals", " Radial basic function", " Wiener filter"], "paper_abstract": "Advanced medical diagnosing and research requires precise information which can be obtained from measured electrophysiological data, e.g., electroencephalogram (EEG) and electrocardiograph (ECG). However, they are often contaminated with noise and a variety of bioelectric signals called artefacts, e.g., electromyography (EMG). These noise and artefacts which need to be reduced make it difficult to distinguish normal from abnormal physiological activity. Electromagnetic contamination of recorded signals represents a major source of noise in electrophysiology and impairs the use of recordings for research. In this paper we present an effective method for cancelling 50 Hz (or 60 Hz) interference using a radial basis function (RBF) Wiener hybrid filter. One of the main points of this paper is the hybridization of the RBF filter and a Wiener filter to make full use of both merits. The effectiveness and validity of those filters are verified by applying them to ECG and EEG recordings. The results show that the proposed method is able to reduce powerline interference (PLI) from the noisy ECG and EEG signals more accurately and consistently in comparison to some of the state of-the-art methods and this method can be efficiently used with very low signal-to-noise ratios, while preserving original signal waveform. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A new method for removal of powerline interference in ECG and EEG recordings", "paper_id": "WOS:000362606700022"}