{"auto_keywords": [{"score": 0.035784028098209755, "phrase": "statistical_dependence"}, {"score": 0.01267708986137068, "phrase": "iris_images"}, {"score": 0.008077306386669888, "phrase": "application-specific_iriscodes"}, {"score": 0.00481495049065317, "phrase": "statistical_analysis"}, {"score": 0.004506968388996092, "phrase": "iris_data"}, {"score": 0.004360412703519539, "phrase": "huge_impact"}, {"score": 0.0043194180167921165, "phrase": "iriscode"}, {"score": 0.003967314311312148, "phrase": "bit_probabilities"}, {"score": 0.0036958398682001015, "phrase": "independent_iris_images"}, {"score": 0.0031619994642255846, "phrase": "sparse_and_structural_adjacency_matrix"}, {"score": 0.0029454679553901613, "phrase": "inner_product"}, {"score": 0.0029039692582303904, "phrase": "gabor_filters"}, {"score": 0.002822712709335093, "phrase": "partial_statistical_dependence"}, {"score": 0.002641823250595624, "phrase": "statistical_information"}, {"score": 0.0026045914281028473, "phrase": "security_risk"}, {"score": 0.0024960069794216977, "phrase": "commercial_systems"}, {"score": 0.002391938519840648, "phrase": "high_identification_speed"}, {"score": 0.0021049977753042253, "phrase": "iriscodes"}], "paper_keywords": ["Biometrics", " iris recognition", " statistical dependence", " Daugman algorithm", " template protection"], "paper_abstract": "IrisCode has been used to gather iris data for 430 million people. Because of the huge impact of IrisCode, it is vital that it is completely understood. This paper first studies the relationship between bit probabilities and a mean of iris images (The mean of iris images is defined as the average of independent iris images.) and then uses the Chi-square statistic, the correlation coefficient and a resampling algorithm to detect statistical dependence between bits. The results show that the statistical dependence forms a graph with a sparse and structural adjacency matrix. A comparison of this graph with a graph whose edges are defined by the inner product of the Gabor filters that produce IrisCodes shows that partial statistical dependence is induced by the filters and propagates through the graph. Using this statistical information, the security risk associated with two patented template protection schemes that have been deployed in commercial systems for producing application-specific IrisCodes is analyzed. To retain high identification speed, they use the same key to lock all IrisCodes in a database. The belief has been that if the key is not compromised, the IrisCodes are secure. This study shows that even without the key, application-specific IrisCodes can be unlocked and that the key can be obtained through the statistical dependence detected.", "paper_title": "A Statistical Analysis of IrisCode and Its Security Implications", "paper_id": "WOS:000349626200003"}