{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_cross-language_information_retrieval"}, {"score": 0.003303177222901723, "phrase": "user-assisted_query_translation"}, {"score": 0.003175556211659149, "phrase": "system's_operation"}, {"score": 0.003140004304719746, "phrase": "supporting_interaction_and_interface_designs"}, {"score": 0.0028857130140890787, "phrase": "experienced_searchers"}, {"score": 0.0028214413724451442, "phrase": "new_system"}, {"score": 0.0027898428590137515, "phrase": "new_search_strategies"}, {"score": 0.002743105561254975, "phrase": "effective_use"}, {"score": 0.0026971491199975083, "phrase": "new_capabilities"}, {"score": 0.0026222551419772867, "phrase": "retrieval_effectiveness"}, {"score": 0.002535115422089855, "phrase": "fully_automatic_techniques"}, {"score": 0.0024097920845706795, "phrase": "cross-language_searching"}, {"score": 0.002264982416465872, "phrase": "freely_available_interactive_clir_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["cross-language information retrieval", " user studies", " machine translation"], "paper_abstract": "Interactive Cross-Language Information Retrieval (CLIR), a process in which searcher and system collaborate to find documents that satisfy an information need regardless of the language in which those documents are written, calls for designs in which synergies between searcher and system can be leveraged so that the strengths of one can cover weaknesses of the other. This paper describes an approach that employs user-assisted query translation to help searchers better understand the system's operation. Supporting interaction and interface designs are introduced, and results from three user studies are presented. The results indicate that experienced searchers presented with this new system evolve new search strategies that make effective use of the new capabilities, that they achieve retrieval effectiveness comparable to results obtained using fully automatic techniques, and that reported satisfaction with support for cross-language searching increased. The paper concludes with a description of a freely available interactive CLIR system that incorporates lessons learned from this research. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "User-assisted query translation for interactive cross-language information retrieval", "paper_id": "WOS:000251441600012"}