{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "trust_annotations"}, {"score": 0.004706453355638515, "phrase": "annotated_logic_programs"}, {"score": 0.004458426563932486, "phrase": "scalable_subset"}, {"score": 0.004058180509184539, "phrase": "referent_data"}, {"score": 0.003746779951069909, "phrase": "linked_data-"}, {"score": 0.003641433168173135, "phrase": "rdf_documents"}, {"score": 0.0034889212590758865, "phrase": "linked_data_principles"}, {"score": 0.0034102016621879927, "phrase": "terminological_information"}, {"score": 0.003333252253488408, "phrase": "logical_framework"}, {"score": 0.0031393948330209224, "phrase": "desirable_properties"}, {"score": 0.0030949200330108156, "phrase": "annotated_logic_programming"}, {"score": 0.0028572222845671723, "phrase": "formal_results"}, {"score": 0.0028167336373711494, "phrase": "scalable_and_efficient_implementation"}, {"score": 0.002706383680762465, "phrase": "implementation_strategies"}, {"score": 0.0026452734009203764, "phrase": "commodity_hardware"}, {"score": 0.002570817338292482, "phrase": "data_quadruples"}, {"score": 0.002339629270626007, "phrase": "simple_repair"}, {"score": 0.0022479284902217006, "phrase": "\"marginal_view"}, {"score": 0.00218463192980675, "phrase": "empirical_\"consistency_threshold"}], "paper_keywords": ["Annotated programs", " Linked Data", " OWL 2 RL", " Scalable reasoning", " PageRank", " Provenance"], "paper_abstract": "In this paper, we leverage annotated logic programs for tracking indicators of provenance and trust during reasoning, specifically focussing on the use-case of applying a scalable subset of OWL 2 RL/RDF rules over static corpora of arbitrary Linked Data (Web data). Our annotations encode three facets of information: (i) blacklist: a (possibly manually generated) boolean annotation which indicates that the referent data are known to be harmful and should be ignored during reasoning; (ii) ranking: a numeric value derived by a PageRank-inspired technique-adapted for Linked Data-which determines the centrality of certain data artefacts (such as RDF documents and statements); (iii) authority: a boolean value which uses Linked Data principles to conservatively determine whether or not some terminological information can be trusted. We formalise a logical framework which annotates inferences with the strength of derivation along these dimensions of trust and provenance; we formally demonstrate some desirable properties of the deployment of annotated logic programming in our setting, which guarantees (i) a unique minimal model (least fixpoint); (ii) monotonicity; (iii) finitariness; and (iv) finally decidability. In so doing, we also give some formal results which reveal strategies for scalable and efficient implementation of various reasoning tasks one might consider. Thereafter, we discuss scalable and distributed implementation strategies for applying our ranking and reasoning methods over a cluster of commodity hardware; throughout, we provide evaluation of our methods over 1 billion Linked Data quadruples crawled from approximately 4 million individual Web documents, empirically demonstrating the scalability of our approach, and how our annotation values help ensure a more robust form of reasoning. We finally sketch, discuss and evaluate a use-case for a simple repair of inconsistencies detectable within OWL 2 RL/RDF constraint rules using ranking annotations to detect and defeat the \"marginal view'', and in so doing, infer an empirical \"consistency threshold'' for the Web of Data in our setting. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Robust and scalable Linked Data reasoning incorporating provenance and trust annotations", "paper_id": "WOS:000300169300008"}