{"auto_keywords": [{"score": 0.030385526539102568, "phrase": "connect"}, {"score": 0.00481495049065317, "phrase": "router_microarchitecture"}, {"score": 0.004764859786310636, "phrase": "request_masking_technique"}, {"score": 0.004405348628112645, "phrase": "on-chip_communication_alternative"}, {"score": 0.0040094142308666975, "phrase": "high_performance_low_latency_noc"}, {"score": 0.0036680857629458816, "phrase": "two-clock-cycle_latency_noc_microarchitecture"}, {"score": 0.0034628156490003775, "phrase": "virtual_channel"}, {"score": 0.002823050755743821, "phrase": "open_source"}, {"score": 0.002721388234661538, "phrase": "field-programmable_gate_array"}, {"score": 0.002637160140011997, "phrase": "experimental_results"}, {"score": 0.0024894376091589244, "phrase": "logic_cells"}, {"score": 0.0022653055209664284, "phrase": "one-and_two-clock-cycle_latency_connect_noc_routers"}, {"score": 0.002172276216173034, "phrase": "noc"}, {"score": 0.0021049977753042253, "phrase": "connect."}], "paper_keywords": [""], "paper_abstract": "Network-on-Chip (NoC) is fast emerging as an on-chip communication alternative for many-core System-on-Chips (SoCs). However, designing a high performance low latency NoC with low area overhead has remained a challenge. In this paper, we present a two-clock-cycle latency NoC microarchitecture. An efficient request masking technique is proposed to combine virtual channel (VC) allocation with switch allocation nonspeculatively. Our proposed NoC architecture is optimized in terms of area overhead, operating frequency, and quality-of-service (QoS). We evaluate our NoC against CONNECT, an open source low latency NoC design targeted for field-programmable gate array (FPGA). The experimental results on several FPGA devices show that our NoC router outperforms CONNECT with 50% reduction of logic cells (LCs) utilization, while it works with 100% and 35%similar to 20% higher operating frequency compared to the one-and two-clock-cycle latency CONNECT NoC routers, respectively. Moreover, the proposed NoC router achieves 2.3 times better performance compared to CONNECT.", "paper_title": "Low Latency Network-on-Chip Router Microarchitecture Using Request Masking Technique", "paper_id": "WOS:000362017400001"}