{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "citation_counts"}, {"score": 0.008262651563854488, "phrase": "ac-ie"}, {"score": 0.007362169183014305, "phrase": "reviewers'_ratings"}, {"score": 0.004626553103375699, "phrase": "bibliometric_studies"}, {"score": 0.0044277810648955624, "phrase": "scientific_quality"}, {"score": 0.00407161650109722, "phrase": "extensive_data"}, {"score": 0.0037740295668681014, "phrase": "angewandte_chemie_international_edition"}, {"score": 0.0036993855514735746, "phrase": "short_communications"}, {"score": 0.003640730820018083, "phrase": "external_reviewers"}, {"score": 0.003255295296893174, "phrase": "manuscripts'_results"}, {"score": 0.003053598205821532, "phrase": "previous_studies"}, {"score": 0.002644179117033107, "phrase": "statistical_analysis"}, {"score": 0.0024604876113911173, "phrase": "citation_performance"}, {"score": 0.0024311346712789553, "phrase": "cited_references"}, {"score": 0.002373472641477602, "phrase": "publishing_journal"}, {"score": 0.0023451553255837317, "phrase": "chemical_subfield"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Chemistry", " Citation counts", " Scientific quality", " Single publication h index"], "paper_abstract": "A number of bibliometric studies point out that citation counts are a function of many variables besides scientific quality. In this paper our aim is to investigate these factors that usually impact the number of citation counts, using an extensive data set from the field of chemistry. The data set contains roughly 2000 manuscripts that were submitted to the journal Angewandte Chemie International Edition (AC-IE) as short communications, reviewed by external reviewers, and either published in AC-IE or, if not accepted for publication by AC-IE, published elsewhere. As the reviewers' ratings of the importance of the manuscripts' results are also available to us, we can examine the extent to which certain factors that previous studies demonstrated to be generally correlated with citation counts increase the impact of papers, controlling for the quality of the manuscripts (as measured by reviewers' ratings of the importance of the findings) in the statistical analysis. As the results show, besides being associated with quality, citation counts are correlated with the citation performance of the cited references, the language of the publishing journal, the chemical subfield, and the reputation of the authors. In this study no statistically significant correlation was found between citation counts and number of authors. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "What factors determine citation counts of publications in chemistry besides their quality?", "paper_id": "WOS:000298325300002"}