{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "repetitive_elements"}, {"score": 0.008012424790410855, "phrase": "human_genome"}, {"score": 0.004618893461411858, "phrase": "recent_studies"}, {"score": 0.004547438494330851, "phrase": "living_organisms"}, {"score": 0.004453874101119545, "phrase": "coding_sequences"}, {"score": 0.004283576270012874, "phrase": "significant_role"}, {"score": 0.004250302819248558, "phrase": "scattered_studies"}, {"score": 0.004184526032558792, "phrase": "regulatory_regions"}, {"score": 0.004152018764100109, "phrase": "gene_control_gene_expression"}, {"score": 0.004119762981892093, "phrase": "systematic_survey"}, {"score": 0.0037516215763875225, "phrase": "ensembl_database"}, {"score": 0.0035063024767122684, "phrase": "distinct_classes"}, {"score": 0.0034609916645637288, "phrase": "individual_gene"}, {"score": 0.003380897678672156, "phrase": "different_types"}, {"score": 0.003345895878114341, "phrase": "systems_biology_program"}, {"score": 0.0029761605501582343, "phrase": "major_function"}, {"score": 0.0029224275921964724, "phrase": "developmental_processes"}, {"score": 0.002810520668490478, "phrase": "distal_region"}, {"score": 0.0027886599792352595, "phrase": "tss"}, {"score": 0.002752594862770681, "phrase": "interspersed_repeat-containing_genes"}, {"score": 0.002681859084438076, "phrase": "distribution_analysis"}, {"score": 0.0026265780539030106, "phrase": "gene-based_repetitive_element_database"}, {"score": 0.002612936300948578, "phrase": "gbred"}, {"score": 0.0025724335893708627, "phrase": "user-friendly_web_interface"}, {"score": 0.0024546444592621207, "phrase": "first_study"}, {"score": 0.0024292086113369624, "phrase": "gene-associated_repetitive_elements"}, {"score": 0.0023791230291982557, "phrase": "distinct_genes"}, {"score": 0.002360607691114015, "phrase": "different_kinds"}, {"score": 0.00234834406550549, "phrase": "repetitive_element"}, {"score": 0.0022583704173318123, "phrase": "conventional_view"}, {"score": 0.0022291501521610737, "phrase": "genome_evolution"}, {"score": 0.0021831803612759855, "phrase": "systemic_review"}, {"score": 0.0021381565332182773, "phrase": "genome_function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Tandem repeats", " Interspersed repeats", " Genome evolution", " Gene regulation"], "paper_abstract": "Repetitive elements constitute more than 50% of the human genome. Recent studies implied that the complexity of living organisms is not just a direct outcome of a number of coding sequences; the repetitive elements, which do not encode proteins, may also play a significant role. Though scattered studies showed that repetitive elements in the regulatory regions of a gene control gene expression, no systematic survey has been done to report the characterization and distribution of various types of these repetitive elements in the human genome. Sequences from 5' and 3' untranslated regions and upstream and downstream of a gene were downloaded from the Ensembl database. The repetitive elements in the neighboring of each gene were identified and classified using cross-matching implemented in the RepeatMasker. The annotation and distribution of distinct classes of repetitive elements associated with individual gene were collected to characterize genes in association with different types of repetitive elements using systems biology program. We identified a total of 1,068,400 repetitive elements which belong to 37-class families and 1235 subclasses that are associated with 33,761 genes and 57,365 transcripts. In addition, we found that the tandem repeats preferentially locate proximal to the transcription start site (TSS) of genes and the major function of these genes are involved in developmental processes. On the other hand, interspersed repetitive elements showed a tendency to be accumulated at distal region from the TSS and the function of interspersed repeat-containing genes took part in the catabolic/metabolic processes. Results from the distribution analysis were collected and used to construct a gene-based repetitive element database (GBRED; http://www.binfo.ncku.edu.tw/GBRED/index.html). A user-friendly web interface was designed to provide the information of repetitive elements associated with any particular gene(s). This is the first study focusing on the gene-associated repetitive elements in the human genome. Our data showed distinct genes associated with different kinds of repetitive element and implied such combination may shape the function of these genes. Aside from the conventional view of these elements in genome evolution, results from this study offer a systemic review to facilitate exploitation of these elements in genome function. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Characterization and distribution of repetitive elements in association with genes in the human genome", "paper_id": "WOS:000356111900005"}