{"auto_keywords": [{"score": 0.03793044352294926, "phrase": "face_mode"}, {"score": 0.02322730111336098, "phrase": "virtual_spanner"}, {"score": 0.004775335634705251, "phrase": "geographic_routing_protocols"}, {"score": 0.0041666157975446564, "phrase": "current_node"}, {"score": 0.004132312946154097, "phrase": "face_routing"}, {"score": 0.003773049633656302, "phrase": "crossing_links"}, {"score": 0.003726533059542558, "phrase": "original_network"}, {"score": 0.0034879261743468574, "phrase": "new_localized_scheme"}, {"score": 0.0032376465741070274, "phrase": "underlying_network"}, {"score": 0.0031452231581533814, "phrase": "previous_works"}, {"score": 0.0029928611380840757, "phrase": "energy_consumption"}, {"score": 0.0028715299874549245, "phrase": "original_links"}, {"score": 0.0024637379406427878, "phrase": "large-scale_networks"}, {"score": 0.0024435103056265014, "phrase": "routing"}, {"score": 0.002393353846080347, "phrase": "real_nodes"}, {"score": 0.002373615081691254, "phrase": "virtual_nodes"}, {"score": 0.0023249757987087055, "phrase": "routing_anchors"}, {"score": 0.002184943946549964, "phrase": "proposed_scheme"}, {"score": 0.0021579641460002523, "phrase": "best_energy-efficient_geographic_routing_protocol"}, {"score": 0.0021049977753042253, "phrase": "energy_models"}], "paper_keywords": [""], "paper_abstract": "Geographic routing protocols are one of the most common routing schemes for sensor networks. These protocols consist of two different modes of operation: greedy routing to forward data to the destination using neighbors which are closer to the destination than current node and face routing to avoid voids in the network. Face routing requires the graph to be planar, which usually means that some crossing links of the original network cannot be considered when routing in face mode. In this paper we introduce a new localized scheme to build a virtual spanner which is planar by construction and is guaranteed to be connected if the underlying network is connected as well. Unlike previous works, by performing face routing over this spanner we can reduce energy consumption in face mode because the elimination of any of the original links in the network is not required. Thus, the most energy-efficient paths can be selected when the protocol enters face mode. The virtual spanner is easy-to-build and uses only local information, making it scalable to large-scale networks. Routing is always performed in real nodes; virtual nodes are used only as routing anchors when the agent is in face mode. In addition, our simulation results show that the proposed scheme outperforms the best energy-efficient geographic routing protocol for different network densities and energy models.", "paper_title": "Energy-efficient face routing on the virtual spanner", "paper_id": "WOS:000240073200010"}