{"auto_keywords": [{"score": 0.035050648308006416, "phrase": "activity_components"}, {"score": 0.00481495049065317, "phrase": "activity_recognition"}, {"score": 0.004764220976404241, "phrase": "local_spatio-temporal_features"}, {"score": 0.004447201233380302, "phrase": "simple_actions"}, {"score": 0.004330941610682453, "phrase": "high_level_human_activities"}, {"score": 0.004285289574869884, "phrase": "long-range_motion"}, {"score": 0.004240116703465252, "phrase": "multiple_interactive_body_parts"}, {"score": 0.004085713541752114, "phrase": "low-level_features"}, {"score": 0.0037139103792217143, "phrase": "mid-level_features"}, {"score": 0.003503497128638102, "phrase": "human_activities"}, {"score": 0.0034118234596993836, "phrase": "mid-level_components"}, {"score": 0.0031676593724896075, "phrase": "spatial_and_temporal_domain"}, {"score": 0.002548331088496964, "phrase": "spatio-temporal_context_kernel"}, {"score": 0.002429451930463481, "phrase": "local_properties"}, {"score": 0.0022434880661725493, "phrase": "proposed_approach"}, {"score": 0.002219790619936024, "phrase": "standard_spatio-temporal_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Activity recognition", " Mid-level features", " Activity components", " Spatio-temporal context kernels"], "paper_abstract": "Local spatio-temporal features have been shown to be effective and robust in order to represent simple actions. However, for high level human activities with long-range motion or multiple interactive body parts and persons, the limitation of low-level features blows up because of their localness. This paper addresses the problem by suggesting a framework that computes mid-level features and takes into account their contextual information. First, we represent human activities by a set of mid-level components, referred to as activity components, which have consistent structure and motion in spatial and temporal domain respectively. These activity components are extracted hierarchically from videos, i.e., extracting key-points, grouping them into trajectories and finally clustering trajectories into components. Second, to further exploit the interdependencies of the activity components, we introduce a spatio-temporal context kernel (STCK), which not only captures local properties of features but also considers their spatial and temporal context information. Experiments conducted on two challenging activity recognition datasets show that the proposed approach outperforms standard spatio-temporal features and our STCK context kernel improves further the performance. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Mid-level features and spatio-temporal context for activity recognition", "paper_id": "WOS:000308271000010"}