{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "support_reminding"}, {"score": 0.004483909657713567, "phrase": "pertinent_information_and_mark_locations"}, {"score": 0.004399525320473839, "phrase": "future_investigation"}, {"score": 0.003944112858235306, "phrase": "tool_support"}, {"score": 0.003906804492585634, "phrase": "modern_development_environments"}, {"score": 0.0032766780632972363, "phrase": "new_approach"}, {"score": 0.0032456625605347417, "phrase": "software_navigation"}, {"score": 0.0032149396890830575, "phrase": "tags_for_software_engineering_activities"}, {"score": 0.0031393948330209224, "phrase": "tagsea"}, {"score": 0.0029511579080222137, "phrase": "spatial_navigation"}, {"score": 0.002909342017421165, "phrase": "social_tagging"}, {"score": 0.0028274743316389437, "phrase": "semantically_rich_annotations"}, {"score": 0.0028006988338192375, "phrase": "source_code_comments"}, {"score": 0.0024051153560799335, "phrase": "professional_programmers"}, {"score": 0.002382329940096419, "phrase": "source_code_annotations"}, {"score": 0.0022393843660697484, "phrase": "semantic_information"}, {"score": 0.0021049977753042253, "phrase": "annotation_tools"}], "paper_keywords": ["Annotations", " software navigation", " software tagging", " tags", " software development tools"], "paper_abstract": "Developers frequently add annotations to source code to help them remember pertinent information and mark locations of interest for future investigation. Finding and refinding these notes is a form of navigation that is integral to software maintenance. Although there is some tool support in modern development environments for authoring and navigating these comments, we have observed that these annotations often fail to remind and are sometimes difficult to find by the programmer. To address these shortcomings, we have designed a new approach for software navigation called Tags for Software Engineering Activities (TagSEA). TagSEA combines the notion of waypointing (a mechanism for marking locations in spatial navigation) with social tagging to support programmers in defining semantically rich annotations to source code comments. The tool provides support for creating, editing, navigating, and managing these annotations. We present the results from two empirical studies, where we observed and then analyzed how professional programmers used source code annotations to support their development activities over 24 months. Our findings indicate that the addition of semantic information to annotations can improve their value. We also provide suggestions on how annotation tools in general may be improved.", "paper_title": "How Software Developers Use Tagging to Support Reminding and Refinding", "paper_id": "WOS:000268305800004"}