{"auto_keywords": [{"score": 0.027773607799187222, "phrase": "appearance_features"}, {"score": 0.00481495049065317, "phrase": "affordance_and_appearance_features"}, {"score": 0.004299910946753963, "phrase": "icub_humanoid_robot"}, {"score": 0.004073359218158693, "phrase": "manipulation_behaviors"}, {"score": 0.003016544840824688, "phrase": "cross-validated_training"}, {"score": 0.002914288956035066, "phrase": "novel_objects"}, {"score": 0.0028293966058473476, "phrase": "shape-related_adjectives"}, {"score": 0.002551231163230566, "phrase": "feature_relevancy"}, {"score": 0.0025137856138000014, "phrase": "affordance_features"}, {"score": 0.0023003498123420237, "phrase": "adjective_predictions"}, {"score": 0.0022223176391038785, "phrase": "odd-one-out_task"}], "paper_keywords": ["Affordances", " nouns", " adjectives"], "paper_abstract": "We study how a robot can link concepts represented by adjectives and nouns in language with its own sensorimotor interactions. Specifically, an iCub humanoid robot interacts with a group of objects using a repertoire of manipulation behaviors. The objects are labeled using a set of adjectives and nouns. The effects induced on the objects are labeled as affordances, and classifiers are learned to predict the affordances from the appearance of an object. We evaluate three different models for learning adjectives and nouns using features obtained from the appearance and affordances of an object, through cross-validated training as well as through testing on novel objects. The results indicate that shape-related adjectives are best learned using features related to affordances, whereas nouns are best learned using appearance features. Analysis of the feature relevancy shows that affordance features are more relevant for adjectives, and appearance features are more relevant for nouns. We show that adjective predictions can be used to solve the odd-one-out task on a number of examples. Finally, we link our results with studies from psychology, neuroscience and linguistics that point to the differences between the development and representation of adjectives and nouns in humans.", "paper_title": "The learning of adjectives and nouns from affordance and appearance features", "paper_id": "WOS:000329666400002"}