{"auto_keywords": [{"score": 0.034388262628228236, "phrase": "saas_network"}, {"score": 0.010205260054638308, "phrase": "software_vendors"}, {"score": 0.009902638683169315, "phrase": "software_users"}, {"score": 0.009813596950330747, "phrase": "software_services"}, {"score": 0.00972534799126678, "phrase": "new_services"}, {"score": 0.0096089039682355, "phrase": "existing_software_services"}, {"score": 0.009156776674936097, "phrase": "collective_intelligence"}, {"score": 0.0069377688085989295, "phrase": "open_interfaces"}, {"score": 0.005414979996860463, "phrase": "saas_innovation"}, {"score": 0.0051904691505592435, "phrase": "saas_services"}, {"score": 0.00481495049065317, "phrase": "software-as-a-service_innovation_system_through"}, {"score": 0.004671416117092309, "phrase": "software_industry"}, {"score": 0.004176405358988595, "phrase": "open_innovation_system"}, {"score": 0.0041136473765874815, "phrase": "underlying_mechanism"}, {"score": 0.0038252396052150354, "phrase": "successfully_working_software_services_system"}, {"score": 0.0028857130140890787, "phrase": "scale-free_network"}, {"score": 0.0028595832692215766, "phrase": "slight_concavity"}, {"score": 0.0027741761880779535, "phrase": "topology_characteristics"}, {"score": 0.002707685828465434, "phrase": "early_time_periods"}, {"score": 0.0024202575033591867, "phrase": "platform_providers"}, {"score": 0.0022571426190350157, "phrase": "potential_combinations"}, {"score": 0.002117811223107415, "phrase": "actual_structure"}, {"score": 0.0021049977753042253, "phrase": "open_innovation_systems"}], "paper_keywords": ["Software-as-a-service (SaaS)", " service composition", " composite services", " mashup", " network evolution", " scale-free network", " openness", " collective intelligence", " software industry", " software platforms"], "paper_abstract": "One of the notable trends in the software industry is that software vendors provide their software on a platform as a service. Software users consume those software services or compose new services by combining those existing software services. The software vendors, their services, software users, and the platform represent an open innovation system. Collective intelligence is the underlying mechanism for the cooperation between the users of the system, i.e. their continuous reuse of existing software services for the creation of new services. A successfully working software services system (i.e. collective intelligence system) is a system that is continuously adapted by its users to meet their needs. The evolution of this software-as-a-service (SaaS) innovation system and the behavior of SaaS users within this system are still unknown. In this paper, we describe the evolution of a SaaS network. The SaaS network consists of nodes (i.e. software services with open interfaces) and links (i.e. the co-development relationships of software services with open interfaces). The results suggest that the SaaS network has gradually grown into a scale-free network with a slight concavity in its cumulative degree distribution. The results also suggest that the topology characteristics are invariant over time except for the early time periods. Furthermore, the results suggest that the SaaS network is not as open (i.e. inter-operable) as its technology let us expect. Considering these results, we imply that SaaS innovation is achieved by platform providers striving to capture users with a few, leading SaaS services. That means, SaaS innovation is not achieved through the possibilities of potential combinations between any kind of SaaS services as could be expected theoretically. These findings are expected to stir further research on the actual structure of open innovation systems that are driven by collective intelligence.", "paper_title": "EVOLUTION OF THE SOFTWARE-AS-A-SERVICE INNOVATION SYSTEM THROUGH COLLECTIVE INTELLIGENCE", "paper_id": "WOS:000329056000007"}