{"auto_keywords": [{"score": 0.048380691889578505, "phrase": "compression_strength"}, {"score": 0.047690514645440114, "phrase": "fiber_buckling"}, {"score": 0.04660802533264657, "phrase": "rosen"}, {"score": 0.03550056697330034, "phrase": "new_formulation"}, {"score": 0.03428090644100819, "phrase": "fiber_buckling_phenomenon"}, {"score": 0.03113175875391024, "phrase": "mechanical_performance"}, {"score": 0.022467294134598897, "phrase": "tomblin"}, {"score": 0.00481495049065317, "phrase": "numerical_simulation_of_matrix_reinforced_composite_materials_subjected"}, {"score": 0.004786107405332454, "phrase": "compression_loads"}, {"score": 0.004616624583337195, "phrase": "long_fiber_composites"}, {"score": 0.004534136929881113, "phrase": "failure_mode"}, {"score": 0.004439753960631346, "phrase": "fibre_composite_materials"}, {"score": 0.004193316635088688, "phrase": "first_model"}, {"score": 0.00396050388346298, "phrase": "different_approach"}, {"score": 0.003522192233486405, "phrase": "different_approaches"}, {"score": 0.003141675970409644, "phrase": "rastellini_et_al"}, {"score": 0.0029139757013408926, "phrase": "composite_constituents"}, {"score": 0.002819073586200239, "phrase": "homogenization_procedure"}, {"score": 0.0026304851706393413, "phrase": "account_fiber_initial_misalignments"}, {"score": 0.0025911827307616136, "phrase": "mechanical_properties"}, {"score": 0.0024992301032831983, "phrase": "finite_element_code"}, {"score": 0.0024324082074887858, "phrase": "different_misalignment_levels"}, {"score": 0.0023460767171603054, "phrase": "tensile_or_compression_forces"}, {"score": 0.0021563397322290445, "phrase": "numerical_results"}, {"score": 0.0021369416775353107, "phrase": "experimental_tests"}, {"score": 0.002117725953765503, "phrase": "barbero"}], "paper_keywords": [""], "paper_abstract": "This paper reviews the most common formulations to obtain the compression strength of long fiber composites due to fiber buckling. This failure mode was first studied by Rosen (Fibre Composite Materials, pp. 37-45, 1965) who defined two different fiber buckling modes, extensional and transverse. Further studies improved the first model proposed by Rosen by defining with more accuracy the mechanics of the problem. Although each formulation use a different approach to solve the problem, all of them agree in the dependence of fiber buckling on three main parameters: matrix shear strength, fiber initial misalignments and volumetric participation of the fibers in the composite. Once having described the different approaches used, and the parameters on which they depend, this paper describes a new formulation capable of obtaining the compression strength of composites taking into account the fiber buckling phenomenon. This formulation uses the serial/parallel mixing theory developed by Rastellini et al. (Comput. Struct. 86(9):879-896, 2008) to simulate the composite, and takes advantage of knowing the mechanical performance of the composite constituents to simulate the fiber buckling phenomenon. This is done with an homogenization procedure. It consists in introducing the interaction between fibers and matrix into their respective constitutive equations. The interaction between fiber and matrix takes into account fiber initial misalignments, its volumetric participation and the mechanical properties of both constituents. The new formulation proposed is implemented in a finite element code, taking into account that fibers can have different misalignment levels, and that the composite behaves differently if it is under tensile or compression forces. The mechanical performance of the formulation proposed is studied with several finite element simulations of compressed composites. Finally, the correctness of the formulation is proved by comparing the numerical results with the experimental tests provided by Barbero and Tomblin (Int. J. Solids Struct. 33(29):4379-4393, 1996), Tomblin et al. (Int. J. Solids Struct. 34(13):1667-1679, 1997).", "paper_title": "Numerical Simulation of Matrix Reinforced Composite Materials Subjected to Compression Loads", "paper_id": "WOS:000272629400001"}