{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "knowledge-sharing_service"}, {"score": 0.04764245501005148, "phrase": "superior_search_engine"}, {"score": 0.015122747851992014, "phrase": "inferior_search_engine"}, {"score": 0.013696734480036058, "phrase": "inferior_and_superior_search_engines"}, {"score": 0.004300133642951283, "phrase": "pure_strategy"}, {"score": 0.00428146713705618, "phrase": "nash_equilibrium"}, {"score": 0.004081385289516914, "phrase": "market_shares"}, {"score": 0.0037411604449359794, "phrase": "compatibility_decision"}, {"score": 0.0036926236934657864, "phrase": "search_engine"}, {"score": 0.0034894451015047875, "phrase": "market_share"}, {"score": 0.0024412911465483225, "phrase": "equilibrium_strategies"}, {"score": 0.002257070536352418, "phrase": "searchers'_patience"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Compatibility", " Economics of information systems", " Knowledge sharing", " Search engine competition", " Two-sided markets"], "paper_abstract": "This study considers the competition between an inferior search engine and a superior search engine with the option to introduce a knowledge-sharing service. This study focuses on the pure strategy Nash equilibrium of the competition between inferior and superior search engines attempting to maximize their either profits or market shares. If one search engine introduces a knowledge-sharing service, it decides whether to make its answer database accessible by the other competing search engine. This compatibility decision of each search engine is shown to be significantly influenced by whether it maximizes its profit or market share. The superior search engine should keep its answer database closed to maximize its market share, but may make its answer database open to maximize its profit unless the amount of information available on the Internet is small. The inferior search engine should keep its answer database open to maximize its market share if its search technology is far behind that of the superior search engine, Both the inferior and superior search engines should make their answer databases open to maximize their profits if the amount of information available on the Internet is large. This study also shows that equilibrium strategies for inferior and superior search engines depend primarily on the amount of information available on the Internet, the degree of searchers' patience to wait for answers, and the search quality difference. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Search engine competition with a knowledge-sharing service", "paper_id": "WOS:000344204800017"}