{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml_class_diagrams"}, {"score": 0.01985534908343213, "phrase": "data_models"}, {"score": 0.01049283509105519, "phrase": "er_diagrams"}, {"score": 0.00790152709845388, "phrase": "modification_activities"}, {"score": 0.004706453355638515, "phrase": "data_model_maintenance"}, {"score": 0.00447115003744675, "phrase": "empirical_study"}, {"score": 0.004223430418065375, "phrase": "uml"}, {"score": 0.004199406257273994, "phrase": "class_diagrams"}, {"score": 0.003877211065759289, "phrase": "comprehension_activities"}, {"score": 0.003725470458263889, "phrase": "maintenance_process"}, {"score": 0.0032860401904845522, "phrase": "fine-grained_level"}, {"score": 0.0031215289677725693, "phrase": "single_building_block"}, {"score": 0.0025561788724870974, "phrase": "data_modeling"}, {"score": 0.0024005409468262203, "phrase": "better_support"}], "paper_keywords": [""], "paper_abstract": "This paper presents the results of an empirical study aiming at comparing the support provided by ER and UML class diagrams during maintenance of data models. We performed one controlled experiment and two replications that focused on comprehension activities (the first activity in the maintenance process) and another controlled experiment on modification activities related to the implementation of given change requests. The results achieved were analyzed at a fine-grained level aiming at comparing the support given by each single building block of the two notations. Such an analysis is used to identify weaknesses (i.e., building blocks not easy to comprehend) in a notation and/or can justify the need of preferring ER or UML for data modeling. The analysis revealed that the UML class diagrams generally provided a better support for both comprehension and modification activities performed on data models as compared to ER diagrams. Nevertheless, the former has some weaknesses related to three building blocks, i.e., multi-value attribute, composite attribute, and weak entity. These findings suggest that an extension of UML class diagrams should be considered to overcome these weaknesses and improve the support provided by UML class diagrams during maintenance of data models.", "paper_title": "A fine-grained analysis of the support provided by UML class diagrams and ER diagrams during data model maintenance", "paper_id": "WOS:000349026100017"}