{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_entropy"}, {"score": 0.04201282685244248, "phrase": "computational_min-entropy"}, {"score": 0.028044048869574997, "phrase": "computational_learning_theory"}, {"score": 0.004338530593157634, "phrase": "conditional_distribution"}, {"score": 0.0035346515636097533, "phrase": "seedless_extractor"}, {"score": 0.0031164983132321417, "phrase": "statistical_min-entropy"}, {"score": 0.0030830390264125923, "phrase": "even_a_seed"}, {"score": 0.0028279422436488116, "phrase": "multisource_extractors"}, {"score": 0.0027675275077806744, "phrase": "computational_setting"}, {"score": 0.002612640527241776, "phrase": "linear_functions"}, {"score": 0.0025938977569302177, "phrase": "arbitrary_distribution"}, {"score": 0.0025752890978323873, "phrase": "adversarial_noise"}, {"score": 0.0025202582748972122, "phrase": "learning_algorithm"}, {"score": 0.0024136908511423875, "phrase": "well-recognized_one"}, {"score": 0.0021979660485319523, "phrase": "independent_interest"}, {"score": 0.0021049977753042253, "phrase": "main_technical_contribution"}], "paper_keywords": ["Computational min-entropy", " randomness extractors", " learning linear functions", " computational complexity"], "paper_abstract": "We study the task of deterministically extracting randomness from sources containing computational entropy. The sources we consider have the form of a conditional distribution (f(X)vertical bar X), for some function f and some distribution X, and we say that such a source has computational min-entropy if any circuit of size 2(k) can only predict f(x) correctly with probability at most 2(-k) given input sampled from X. We first show that it is impossible to have a seedless extractor to extract from one single source of this kind. Then we show that it becomes possible if we are allowed a seed which is weakly random (instead of perfectly random) but contains some statistical min-entropy, or even a seed which is not random at all but contains some computational min-entropy. This can be seen as a step toward extending the study of multisource extractors from the traditional, statistical setting to a computational setting. We reduce the task of constructing such extractors to a problem in computational learning theory: learning linear functions under arbitrary distribution with adversarial noise, and we provide a learning algorithm for this problem. In fact, this problem is a well-recognized one in computational learning theory and variants of this problem have been studied intensively before. Thus, in addition to its application to extractors, our learning algorithm also has independent interest of its own, and it can be considered as the main technical contribution of this paper.", "paper_title": "Extracting Computational Entropy and Learning Noisy Linear Functions", "paper_id": "WOS:000295738500038"}