{"auto_keywords": [{"score": 0.03720561877948967, "phrase": "controller_conflict-resolution_taskload"}, {"score": 0.007417399352947774, "phrase": "conflict-resolution_taskload"}, {"score": 0.00721238216081022, "phrase": "aircraft_maneuvers"}, {"score": 0.00481495049065317, "phrase": "reduced-taskload_optimization_models"}, {"score": 0.004475659507646842, "phrase": "controller_taskload"}, {"score": 0.004425616928975799, "phrase": "conflict-resolution_programs"}, {"score": 0.004351595642056769, "phrase": "parametric_approach"}, {"score": 0.0041136473765874815, "phrase": "conflict-resolution_decision-support_tools"}, {"score": 0.003999578057088828, "phrase": "human-in-the-loop_control_architecture"}, {"score": 0.0034166271604770576, "phrase": "separate_air_traffic"}, {"score": 0.003175556211659149, "phrase": "cost_function"}], "paper_keywords": ["Air traffic control", " conflict resolution", " controller taskload"], "paper_abstract": "This paper explores methods to include aspects of controller taskload into conflict-resolution programs through a parametric approach. We are motivated by the desire to create conflict-resolution decision-support tools that operate within a human-in-the-loop control architecture by actively accounting for, and moderating, controller taskload. Specifically, we introduce two conflict-resolution programs with the objective of managing controller conflict-resolution taskload, i.e., the number of maneuvers used to separate air traffic. Managing conflict-resolution taskload is accomplished by penalizing aircraft maneuvers through their L-1 norm in the cost function or constraining the number of maneuvers directly. Analysis of the programs reveals that both approaches are successful at managing controller conflict-resolution taskload and minimizing fuel burn. Directly constraining conflict-resolution taskload is more successful at minimizing the variation in the number of aircraft maneuvers issued and returning the aircraft to their desired exit point. Penalizing maneuvers through L-1 norm costs is more successful at reducing controller conflict-resolution taskload at lower traffic volumes. Ultimately, results demonstrate that the inclusion of such parametric models can successfully regulate controller conflict-resolution taskload.", "paper_title": "Formulation of Reduced-Taskload Optimization Models for Conflict Resolution", "paper_id": "WOS:000310147000021"}