{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computerized_decision_support_system"}, {"score": 0.005167020145270307, "phrase": "first_phase"}, {"score": 0.004981240965941028, "phrase": "assignment_process"}, {"score": 0.004604136423327813, "phrase": "to-patient_assignment"}, {"score": 0.0044025116437190785, "phrase": "complex_process"}, {"score": 0.004192571571622019, "phrase": "high-quality_assignments"}, {"score": 0.004108066884382925, "phrase": "patient_safety"}, {"score": 0.00399260264462941, "phrase": "job_satisfaction"}, {"score": 0.0037866774001097596, "phrase": "nurse-to-patient_assignment_process"}, {"score": 0.003725470458263889, "phrase": "two-phase_multimethod_study"}, {"score": 0.0032302647179383915, "phrase": "literature_review"}, {"score": 0.0031910037920846817, "phrase": "group_sessions"}, {"score": 0.0029053904956617043, "phrase": "integer_linear_program"}, {"score": 0.0028583875909257766, "phrase": "second_phase"}, {"score": 0.0028236336891860592, "phrase": "before-and-after_study"}, {"score": 0.0025499307228648883, "phrase": "thirty-six_measurements"}, {"score": 0.002379092507901856, "phrase": "nurse-to-patient_assignments"}, {"score": 0.002274684393868218, "phrase": "lower_workload"}, {"score": 0.0021049977753042253, "phrase": "nurses'_job_satisfaction"}], "paper_keywords": ["Computerized decision support system", " Multimethod research", " Nurse-to-patient assignment", " Nursing workload", " Quality of care"], "paper_abstract": "Nurse-to-patient assignment is a frequently recurring, time-consuming, and complex process owing to the many considerations involved. Creating well-balanced, high-quality assignments is crucial to ensuring patient safety, quality of care, and job satisfaction for nurses. A computerized decision support system can assist (charge) nurses in the nurse-to-patient assignment process. In this two-phase multimethod study, a computerized decision support system was developed and evaluated. Three nursing wards in a 1000-bed Dutch university hospital participated. In the first phase of this study, considerations relevant to the assignment process-and their relative importance-were investigated in a literature review, focus group sessions with nurses, and a survey among nurses. Using information from the first phase, the computerized decision support system was developed based on an integer linear program. In the second phase, a before-and-after study was conducted to test and evaluate the computerized decision support system both quantitatively (duration of the assignment process) and qualitatively (survey on workload). Thirty-six measurements were performed to test the computerized decision support system. After implementation, a 30% time reduction was achieved in the nurse-to-patient assignments, and nurses (N = 138) experienced a lower workload. Therefore, the implementation of computerized decision support system would increase both the quality and safety of care as well as the nurses' job satisfaction and should be investigated rigorously in the coming years.", "paper_title": "Developing and Testing a Computerized Decision Support System for Nurse-to-Patient Assignment", "paper_id": "WOS:000338987000004"}