{"auto_keywords": [{"score": 0.041353891869186754, "phrase": "jittered_sampling"}, {"score": 0.037960951511755436, "phrase": "convergence_rate"}, {"score": 0.020943085981043674, "phrase": "importance_sampling"}, {"score": 0.01049602706501035, "phrase": "direct_illumination"}, {"score": 0.009451713525995767, "phrase": "multiple_importance_sampling"}, {"score": 0.00481495049065317, "phrase": "stochastic_sampling_strategies"}, {"score": 0.004631637679516574, "phrase": "theoretical_analysis"}, {"score": 0.0044800522651664695, "phrase": "monte_carlo"}, {"score": 0.004381749459671914, "phrase": "image_synthesis"}, {"score": 0.004238307626560739, "phrase": "popular_variance-reduction_strategies"}, {"score": 0.003987367359722647, "phrase": "monte_carlo_integration"}, {"score": 0.0038354405231002323, "phrase": "stratified_sampling"}, {"score": 0.003283272764794988, "phrase": "exact_error"}, {"score": 0.0029709144755382787, "phrase": "negative_correlations"}, {"score": 0.0027333769432036905, "phrase": "antithetic_sampling"}, {"score": 0.0021885300925245516, "phrase": "convergence_rates"}], "paper_keywords": [""], "paper_abstract": "We present a theoretical analysis of error of combinations of Monte Carlo estimators used in image synthesis. Importance sampling and multiple importance sampling are popular variance-reduction strategies. Unfortunately, neither strategy improves the rate of convergence of Monte Carlo integration. Jittered sampling (a type of stratified sampling), on the other hand is known to improve the convergence rate. Most rendering software optimistically combine importance sampling with jittered sampling, hoping to achieve both. We derive the exact error of the combination of multiple importance sampling with jittered sampling. In addition, we demonstrate a further benefit of introducing negative correlations (antithetic sampling) between estimates to the convergence rate. As with importance sampling, antithetic sampling is known to reduce error for certain classes of integrands without affecting the convergence rate. In this paper, our analysis and experiments reveal that importance and antithetic sampling, if used judiciously and in conjunction with jittered sampling, may improve convergence rates. We show the impact of such combinations of strategies on the convergence rate of estimators for direct illumination.", "paper_title": "Error analysis of estimators that use combinations of stochastic sampling strategies for direct illumination", "paper_id": "WOS:000340598800010"}