{"auto_keywords": [{"score": 0.04683590293207772, "phrase": "policy_statements"}, {"score": 0.023227301113361, "phrase": "trust_management"}, {"score": 0.006759696313067137, "phrase": "intensional_policies"}, {"score": 0.00466016686289196, "phrase": "access_control"}, {"score": 0.004616859702338596, "phrase": "distributed_systems"}, {"score": 0.004573953147933065, "phrase": "access_decisions"}, {"score": 0.004426882270402403, "phrase": "multiple_principals"}, {"score": 0.004324723240308028, "phrase": "distributed_manner"}, {"score": 0.0039024014688338964, "phrase": "access_request"}, {"score": 0.0035376693476114733, "phrase": "requested_resource"}, {"score": 0.0033761303704612734, "phrase": "centralized_evaluation_strategy"}, {"score": 0.002562123444678208, "phrase": "trust_management_systems"}, {"score": 0.002514625755809045, "phrase": "function-free_logic_programming"}, {"score": 0.002433636498174059, "phrase": "gem"}, {"score": 0.00237733844863506, "phrase": "completely_distributed_way"}, {"score": 0.0021247934141234988, "phrase": "standard_semantics"}, {"score": 0.0021049977753042253, "phrase": "logic_programs"}], "paper_keywords": ["trust management", " distributed goal evaluation", " policy confidentiality"], "paper_abstract": "Trust management is an approach to access control in distributed systems where access decisions are based on policy statements issued by multiple principals and stored in a distributed manner. In trust management, the policy statements of a principal can refer to other principals' statements; thus, the process of evaluating an access request (i.e., a goal) consists of finding a \"chain\" of policy statements that allows the access to the requested resource. Most existing goal evaluation algorithms for trust management either rely on a centralized evaluation strategy, which consists of collecting all the relevant policy statements in a single location (and therefore they do not guarantee the confidentiality of intensional policies), or do not detect the termination of the computation (i.e., when all the answers of a goal are computed). In this paper, we present GEM, a distributed goal evaluation algorithm for trust management systems that relies on function-free logic programming for the specification of policy statements. GEM detects termination in a completely distributed way without disclosing intensional policies, thereby preserving their confidentiality. We demonstrate that the algorithm terminates and is sound and complete with respect to the standard semantics for logic programs.", "paper_title": "GEM: A distributed goal evaluation algorithm for trust management", "paper_id": "WOS:000338293500002"}