{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web-based_self-management_intervention"}, {"score": 0.048658242994016845, "phrase": "spinal_cord_injury"}, {"score": 0.003501175642882274, "phrase": "new_web-based_technology"}, {"score": 0.003441352119167824, "phrase": "interactive_urinary_diary"}, {"score": 0.003310447652300423, "phrase": "extensive_catheter_products_information"}, {"score": 0.0030898642396380662, "phrase": "study_participants"}, {"score": 0.003050166508545763, "phrase": "online_survey"}, {"score": 0.00295950473406239, "phrase": "enrollment_process"}, {"score": 0.0027982016314450717, "phrase": "pretesting_participants"}, {"score": 0.002726740692380339, "phrase": "web_site_applications"}, {"score": 0.002680114113899346, "phrase": "next_stage"}, {"score": 0.0025780912201045555, "phrase": "numerous_recommendations"}, {"score": 0.0023245746777044766, "phrase": "web_sites"}, {"score": 0.0022651818270925704, "phrase": "technology_and_software_programs"}, {"score": 0.0021049977753042253, "phrase": "web-based_intervention"}], "paper_keywords": ["Intermittent urethral catheterization", " Intervention studies", " Nursing informatics", " Nursing interventions", " Self-management"], "paper_abstract": "While Web-based interventions have proliferated recently, information in the literature is often lacking about how the intervention was developed. In response to that gap, this is a report of the development of a Web-based self-management intervention for intermittent urinary catheter users and pretesting with four adults with spinal cord injury living in the community. Two Web sites were created, one for recruitment and the other for the intervention itself. The intervention involved developing new Web-based technology, including an interactive urinary diary (with fluid intake/urine output and a journal), extensive catheter products information, three intervention nurse phone call consultations, and user-community discussion forums. Study participants completed an online survey and were interviewed twice about the enrollment process and their perceptions of their involvement in the intervention. Suggestions from the pretesting participants were used to revise the Web site applications prior to the next stage of research (a feasibility study). Numerous recommendations and comments were received related to content, interactivity of components, and usability. This article provides a description of how the Web sites were developed (including the technology and software programs used), issues encountered and what was done to address them, and how the Web-based intervention was modified for improvements.", "paper_title": "Development of a Web-Based Self-management Intervention for Intermittent Urinary Catheter Users With Spinal Cord Injury", "paper_id": "WOS:000369246700002"}