{"auto_keywords": [{"score": 0.04194974024773208, "phrase": "behavioral_targeting"}, {"score": 0.010417339382987858, "phrase": "publisher's_revenue"}, {"score": 0.006644451443863472, "phrase": "online_publisher"}, {"score": 0.005641590997935212, "phrase": "social_welfare"}, {"score": 0.00481495049065317, "phrase": "economic_analysis"}, {"score": 0.004781498797706604, "phrase": "online_advertising_using_behavioral_targeting._online_publishers"}, {"score": 0.004682525167261325, "phrase": "increasing_interest"}, {"score": 0.0043976740574978085, "phrase": "better_match"}, {"score": 0.004115697805448384, "phrase": "web_site"}, {"score": 0.003905864553426306, "phrase": "new_\"holy_grail"}, {"score": 0.0038651944848734133, "phrase": "online_advertising"}, {"score": 0.0037066895459425824, "phrase": "economic_implications"}, {"score": 0.003542276457435362, "phrase": "advertising_slot"}, {"score": 0.003468864442215017, "phrase": "cost-perclick_basis"}, {"score": 0.0034207673889407003, "phrase": "horizontal_differentiation_model"}, {"score": 0.0031458272260508637, "phrase": "advertisers'_payoffs"}, {"score": 0.0025960262223338293, "phrase": "advertisers'_valuations"}, {"score": 0.0024377918036784336, "phrase": "relative_strength"}, {"score": 0.002241679436497571, "phrase": "small_advertisers"}, {"score": 0.00217987162651941, "phrase": "dominant_advertiser"}, {"score": 0.0021049977753042253, "phrase": "traditional_advertising"}], "paper_keywords": ["Behavioral targeting", " targeted advertising", " online advertising", " pricing", " competition", " auctions", " analytical modeling", " economic modeling"], "paper_abstract": "Online publishers and advertisers have recently shown increasing interest in using targeted advertising online. Such targeting allows them to present users with advertisements that are a better match, based on their past browsing and search behavior and other available information (e.g., hobbies registered on a web site). This technique, known as behavioral targeting, has been hailed as the new \"Holy Grail\" in online advertising because of its potential effectiveness. In this paper, we study the economic implications when an online publisher engages in behavioral targeting. The publisher auctions off an advertising slot and is paid on a cost-perclick basis. Using a horizontal differentiation model to capture the fit between a user and an advertisement being displayed, we identify the factors that affect the publisher's revenue, the advertisers' payoffs, and social welfare. We show that revenue for the online publisher in some circumstances can double when behavioral targeting is used. However, increased revenue for the publisher is not guaranteed: in some cases, the prices of advertising and hence the publisher's revenue can be lower, depending on the degree of competition and the advertisers' valuations. We identify two effects associated with behavioral targeting: a competitive effect and a propensity effect. The relative strength of the two effects determines whether the publisher's revenue is positively or negatively affected. We also demonstrate that, although social welfare is increased and small advertisers are better off under behavioral targeting, the dominant advertiser might be worse off and reluctant to switch from traditional advertising.", "paper_title": "AN ECONOMIC ANALYSIS OF ONLINE ADVERTISING USING BEHAVIORAL TARGETING", "paper_id": "WOS:000344971000006"}