{"auto_keywords": [{"score": 0.04707486262861141, "phrase": "cancer_genomes"}, {"score": 0.03496401466222773, "phrase": "functional_analysis"}, {"score": 0.03220622087721257, "phrase": "improved_performances"}, {"score": 0.029088965435398996, "phrase": "driver_mutations"}, {"score": 0.00481495049065317, "phrase": "functional_consequences"}, {"score": 0.004767261858417823, "phrase": "cancer-associated_amino_acid_substitutions"}, {"score": 0.004604023526673226, "phrase": "missense_mutations"}, {"score": 0.004337028108577593, "phrase": "technological_advances"}, {"score": 0.004272724011826495, "phrase": "reduced_cost"}, {"score": 0.0040449598280454645, "phrase": "amino_acid_substitutions"}, {"score": 0.0037350832473790007, "phrase": "accurate_automated_methods"}, {"score": 0.0035183010916001664, "phrase": "passenger_mutations"}, {"score": 0.003281186608301359, "phrase": "hidden_markov_models"}, {"score": 0.0030906666356950887, "phrase": "inherited_disease_mutations"}, {"score": 0.003014576010931602, "phrase": "alternative_computational_prediction_algorithms"}, {"score": 0.0028253682745674608, "phrase": "cancer-specific_model"}, {"score": 0.002223770196464436, "phrase": "somatic_driver"}, {"score": 0.0021049977753042253, "phrase": "leading_computational_prediction_algorithms"}], "paper_keywords": [""], "paper_abstract": "Motivation: The number of missense mutations being identified in cancer genomes has greatly increased as a consequence of technological advances and the reduced cost of whole-genome/whole-exome sequencing methods. However, a high proportion of the amino acid substitutions detected in cancer genomes have little or no effect on tumour progression (passenger mutations). Therefore, accurate automated methods capable of discriminating between driver (cancer-promoting) and passenger mutations are becoming increasingly important. In our previous work, we developed the Functional Analysis through Hidden Markov Models (FATHMM) software and, using a model weighted for inherited disease mutations, observed improved performances over alternative computational prediction algorithms. Here, we describe an adaptation of our original algorithm that incorporates a cancer-specific model to potentiate the functional analysis of driver mutations. Results: The performance of our algorithm was evaluated using two separate benchmarks. In our analysis, we observed improved performances when distinguishing between driver mutations and other germ line variants (both disease-causing and putatively neutral mutations). In addition, when discriminating between somatic driver and passenger mutations, we observed performances comparable with the leading computational prediction algorithms: SPF-Cancer and TransFIC.", "paper_title": "Predicting the functional consequences of cancer-associated amino acid substitutions", "paper_id": "WOS:000320065400005"}