{"auto_keywords": [{"score": 0.03028931643253859, "phrase": "ram"}, {"score": 0.004815265801628945, "phrase": "digital"}, {"score": 0.004657808551825796, "phrase": "wireless_sensor_networks"}, {"score": 0.004446349752828045, "phrase": "sensor_devices"}, {"score": 0.003998223112665124, "phrase": "new_security_vulnerabilities"}, {"score": 0.003958591403140206, "phrase": "sensor_deployments"}, {"score": 0.003893406207928709, "phrase": "compromised_internet_host"}, {"score": 0.003854809457075099, "phrase": "malicious_information"}, {"score": 0.003778755692995768, "phrase": "incorrect_actions"}, {"score": 0.00367967106192446, "phrase": "post-incident_analysis"}, {"score": 0.003319569552937513, "phrase": "attackr's_identity"}, {"score": 0.0031372369299648203, "phrase": "lot_networking"}, {"score": 0.002994602527726632, "phrase": "security_breach"}, {"score": 0.002801983400946225, "phrase": "sensor_node"}, {"score": 0.002746644177161797, "phrase": "extracted_network_connectivity_information"}, {"score": 0.0026480044868438875, "phrase": "multiple_devices"}, {"score": 0.002595698433525986, "phrase": "network_topology"}, {"score": 0.0024776238724770524, "phrase": "different_scenarios"}, {"score": 0.002364907617070299, "phrase": "forensic_data"}, {"score": 0.002227551818920742, "phrase": "os"}, {"score": 0.002133196554995389, "phrase": "digital_forensics_research_workshop"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Internet of Things", " Wireless Sensor Networks", " RAM and flash memory extraction", " RAM content analysis", " Contiki Operating System", " Wireless sensor forensics"], "paper_abstract": "Developments in the field of Wireless Sensor Networks (WSNs) and the Internet of Things (loT) mean that sensor devices can now be uniquely identified using an IPv6 address and, if suitably connected, can be directly reached from the Internet. This has a series of advantages but also introduces new security vulnerabilities and exposes sensor deployments to attack. A compromised Internet host can send malicious information to the system and trigger incorrect actions. Should an attack take place, post-incident analysis can reveal information about the state of the network at the time of the attack and ultimately provide clues about the tools used to implement it, or about the attackr's identity. In this paper we critically assess and analyse information retrieved from a device used for loT networking, in order to identify the factors which may have contributed to a security breach. To achieve this, we present an approach for the extraction of RAM and flash contents from a sensor node. Subsequently, we analyse extracted network connectivity information and we investigate the possibility of correlating information gathered from multiple devices in order to reconstruct the network topology. Further, we discuss experiments and analyse how much information can be retrieved in different scenarios. Our major contribution is a mechanism for the extraction, analysis and correlation of forensic data for IPv6-based WSN deployments, accompanied by a tool which can analyse RAM dumps from devices running the Contiki Operating System (OS) and powered by 8051-based, 8-bit micro-controllers. (C) 2014 Digital Forensics Research Workshop. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Digital investigations for IPv6-based Wireless Sensor Networks", "paper_id": "WOS:000340301000009"}