{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "motor-impaired_and_able-bodied_users"}, {"score": 0.03059549745669102, "phrase": "motor-impaired_users"}, {"score": 0.004598027492787762, "phrase": "inclusive_user_interfaces"}, {"score": 0.004501217435918426, "phrase": "broader_audience"}, {"score": 0.004359794046948005, "phrase": "new_generation"}, {"score": 0.0043289723873340255, "phrase": "user_interfaces"}, {"score": 0.004133852714087407, "phrase": "mobile_touchscreen_interfaces"}, {"score": 0.004061160863655662, "phrase": "informed_design"}, {"score": 0.0037428381813152532, "phrase": "interaction_techniques"}, {"score": 0.003167587258150065, "phrase": "good_compromise"}, {"score": 0.0031451673059794236, "phrase": "target_size"}, {"score": 0.0030462191741660346, "phrase": "similar_level"}, {"score": 0.002827243416398972, "phrase": "least_inclusive_technique"}, {"score": 0.002642681666526916, "phrase": "tapping_precision"}, {"score": 0.002623967178291655, "phrase": "disabled_users"}, {"score": 0.0025869338215971536, "phrase": "able-bodied_users'_accuracy"}, {"score": 0.0024439412207268355, "phrase": "expected_error_rate_disparity"}, {"score": 0.0024094425220967273, "phrase": "clear_resemblances"}, {"score": 0.002392375784707278, "phrase": "user_groups"}, {"score": 0.002333586381274878, "phrase": "inclusive_touch_interfaces"}, {"score": 0.0022924784914292026, "phrase": "traditional_interaction_technique"}, {"score": 0.002220296517089146, "phrase": "target_populations"}, {"score": 0.0021657265492371976, "phrase": "main_difference"}], "paper_keywords": ["Mobile", " Touch", " Tetraplegic", " Motor-impaired", " Able-bodied", " Interaction techniques"], "paper_abstract": "Touchscreen mobile devices are highly customizable, allowing designers to create inclusive user interfaces that are accessible to a broader audience. However, the knowledge to provide this new generation of user interfaces is yet to be uncovered. The goal was to thoroughly study mobile touchscreen interfaces and provide guidelines for informed design. The paper presents an evaluation performed with 15 tetraplegic and 18 able-bodied users that allowed to identify their main similarities and differences within a set of interaction techniques (Tapping, Crossing, and Directional Gesturing) and parameterizations. Results show that Tapping and Crossing are the most similar and easy to use techniques for both motor-impaired and able-bodied users. Regarding Tapping, error rates start to converge at 12 mm, showing to be a good compromise for target size. As for Crossing, it offered a similar level of accuracy; however, larger targets (17 mm) are significantly easier to cross for motor-impaired users. Directional Gesturing was the least inclusive technique. Regarding position, edges showed to be troublesome. For instance, they have shown to increase Tapping precision for disabled users, while decreasing able-bodied users' accuracy when targets are too small (7 mm). It is argued that despite the expected error rate disparity, there are clear resemblances between user groups, thus enabling the development of inclusive touch interfaces. Tapping, a traditional interaction technique, was among the most effective for both target populations, along with Crossing. The main difference concerns Directional Gesturing that in spite of its unconstrained nature shows to be inaccurate for motor-impaired users.", "paper_title": "Mobile touchscreen user interfaces: bridging the gap between motor-impaired and able-bodied users", "paper_id": "WOS:000339891000005"}