{"auto_keywords": [{"score": 0.04702287152380103, "phrase": "different_online_stores"}, {"score": 0.03888571701763212, "phrase": "market_basket_analysis"}, {"score": 0.00481495049065317, "phrase": "discovery_of_online_shopping_patterns_across_websites"}, {"score": 0.004701015188740582, "phrase": "online_world"}, {"score": 0.00414545383888272, "phrase": "product_purchases"}, {"score": 0.003975200317233532, "phrase": "hotel_reservation"}, {"score": 0.003857871979942733, "phrase": "car_rental"}, {"score": 0.0034841647157189985, "phrase": "brick-and-mortar_stores"}, {"score": 0.003321008590273796, "phrase": "online_setting"}, {"score": 0.0030904433394138963, "phrase": "online_shopping_patterns"}, {"score": 0.0028076592725295646, "phrase": "online_shopping_applications"}, {"score": 0.0022486729928886885, "phrase": "different_dimensions"}, {"score": 0.002169132543304096, "phrase": "real_online_shopping_data"}], "paper_keywords": ["data mining", " e-commerce", " analysis of algorithms"], "paper_abstract": "In the online world, customers can easily navigate to different online stores to make purchases. The products purchased on one site are often associated with product purchases on other sites (e.g., a hotel reservation on one site and a car rental on another site). Whereas market basket analysis is often used to discover associations among products for brick-and-mortar stores, it is rarely applied in the online setting where consumers navigate among different online stores to buy products. We define online shopping patterns and develop two novel methods to perform market basket analysis across websites. While this research is motivated by online shopping applications, our contribution is mainly methodological. The two methods we develop in this paper can not only be used to identify various online shopping patterns across sites and products but can also be applied to settings where patterns exist across different dimensions. Experiments on both synthetic data and real online shopping data demonstrate the effectiveness of our methods.", "paper_title": "Discovery of Online Shopping Patterns Across Websites", "paper_id": "WOS:000315322400013"}