{"auto_keywords": [{"score": 0.004624751696958501, "phrase": "protein_feature_annotations"}, {"score": 0.0044644734709113985, "phrase": "sequencing_and_structural_genomics_projects"}, {"score": 0.0043753813457279404, "phrase": "dramatic_boost"}, {"score": 0.004266501496765747, "phrase": "uncharacterized_protein_structures"}, {"score": 0.003995876175614403, "phrase": "protein_function"}, {"score": 0.0037423521744765075, "phrase": "standalone_web_pages"}, {"score": 0.0033832583769880576, "phrase": "common_vocabulary"}, {"score": 0.0032494292163722065, "phrase": "standard_language"}, {"score": 0.003073988343893906, "phrase": "structured_controlled_vocabulary"}, {"score": 0.0029973957125353306, "phrase": "protein_sequence"}, {"score": 0.0028070431733705735, "phrase": "sequence_ontology"}, {"score": 0.0026420518944303716, "phrase": "whole-protein_sequence"}, {"score": 0.002437012847684331, "phrase": "pre-existing_ontology"}, {"score": 0.00210512409545923, "phrase": "europe"}], "paper_keywords": [""], "paper_abstract": "Motivation: The advent of sequencing and structural genomics projects has provided a dramatic boost in the number of uncharacterized protein structures and sequences. Consequently, many computational tools have been developed to help elucidate protein function. However, such services are spread throughout the world, often with standalone web pages. Integration of these methods is needed and so far this has not been possible as there was no common vocabulary available that could be used as a standard language. Results: The Protein Feature Ontology has been developed to provide a structured controlled vocabulary for features on a protein sequence or structure and comprises similar to 100 positional terms, now integrated into the Sequence Ontology (SO) and 40 non-positional terms which describe features relating to the whole-protein sequence. In addition, post-translational modi. cations are described by using a pre-existing ontology, the Protein Modi. cation Ontology (MOD). This ontology is being used to integrate over 150 distinct annotations provided by the BioSapiens Network of Excellence, a consortium comprising 19 partner sites in Europe.", "paper_title": "The Protein Feature Ontology: a tool for the unification of protein feature annotations", "paper_id": "WOS:000261168600016"}