{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_logic"}, {"score": 0.008777866397459679, "phrase": "product_family_development_process"}, {"score": 0.008635750461184689, "phrase": "product_family_development"}, {"score": 0.004499647408293102, "phrase": "key_issues"}, {"score": 0.00441909542037375, "phrase": "product_family_design"}, {"score": 0.004281568920264999, "phrase": "great_deal"}, {"score": 0.00391167729353583, "phrase": "mass_customization"}, {"score": 0.0037219886365287085, "phrase": "product_families"}, {"score": 0.003294350220187021, "phrase": "entire_process"}, {"score": 0.003148709618042979, "phrase": "binary_variables"}, {"score": 0.0029025435402480326, "phrase": "vague_parameters"}, {"score": 0.0028505007899807446, "phrase": "human_character"}, {"score": 0.0028248293967214947, "phrase": "different_processes"}, {"score": 0.002639502113350897, "phrase": "essential_applications"}, {"score": 0.0025804616931593897, "phrase": "extended_overview"}, {"score": 0.002367875199095903, "phrase": "fourteen_fuzzy_logic_tools"}], "paper_keywords": ["Literature review", " Product family development", " Fuzzy logic", " Shortcomings", " Opportunities"], "paper_abstract": "Over the past few years, a number of key issues related to the product family design have been addressed, and a great deal of work has been done to improve it. Many different tools have been employed in this effort, such as mass customization, modularity, delayed differentiation, commonality, platforms, product families, and so on. The purpose of this paper is to analyze how fuzzy logic has been applied and how it can help to improve the entire process of product family development. Given its powerful capability to represent aspects that binary variables cannot, we show how fuzzy logic has been used to take advantage by considering the vague parameters related to the human character in different processes. Our aim is to contribute to the understanding and improvement of product family development process by identifying essential applications of fuzzy logic. An extended overview of the product family development process is provided, and also this work highlights the role of fuzzy logic in it. Fourteen fuzzy logic tools and thirteen topics into the product family development process are identified and summarized as a framework to analyze the role of fuzzy logic and at the same time to identify further application opportunities.", "paper_title": "The use of fuzzy logic in product family development: literature review and opportunities", "paper_id": "WOS:000308820200001"}