{"auto_keywords": [{"score": 0.04602747321407116, "phrase": "business_processes"}, {"score": 0.0450143627548408, "phrase": "work_practices"}, {"score": 0.00481495049065317, "phrase": "communication_patterns"}, {"score": 0.0046394362688524475, "phrase": "service_encounters"}, {"score": 0.004267468074128779, "phrase": "recurrent_patterns"}, {"score": 0.003852939975815287, "phrase": "communication_resources"}, {"score": 0.003712362078915926, "phrase": "service_transaction"}, {"score": 0.0033515736929172644, "phrase": "structural_and_functional_arrangement"}, {"score": 0.003199345207727474, "phrase": "business_process"}, {"score": 0.0029288446848334576, "phrase": "contextually-an_important_consideration"}, {"score": 0.00269365253474335, "phrase": "directed_graphs"}, {"score": 0.0025474193855847074, "phrase": "existing_services"}, {"score": 0.002488851299416018, "phrase": "new_ones"}, {"score": 0.0024658019116387845, "phrase": "structural_and_functional_change"}, {"score": 0.0023537101705489957, "phrase": "specific_service"}, {"score": 0.0022155569675462333, "phrase": "business_demands"}, {"score": 0.0021049977753042253, "phrase": "conventional_service_engineering_approaches"}], "paper_keywords": [""], "paper_abstract": "in this paper, we describe an approach to business processes and services which views work practices as recurrent patterns of communication called genres. Although defining work practices in this way is unorthodox, it provides two major advantages. First, the communication resources employed by the parties engaging in a service transaction can be clearly described, understood, and communicated. Business processes and services can be differentiated on the basis of the structural and functional arrangement of their constituent genres. This provides a view of a business process or service that is technology-independent. Second, using this approach means that work practices are defined contextually-an important consideration when trying to understand how business processes and services will influence organizations. Because genres are represented using directed graphs, prototypes can be developed to assist during the analysis of existing services and the design of new ones. Structural and functional change of genres can be used to reveal how a specific service is evolving within an organization. This enables us to determine if business demands have changed, something that is difficult to achieve using conventional service engineering approaches.", "paper_title": "Business services as communication patterns: A work practice approach for analyzing service encounters", "paper_id": "WOS:000253658800012"}