{"auto_keywords": [{"score": 0.036954893243603605, "phrase": "cloud_computing"}, {"score": 0.0345903359351965, "phrase": "market-oriented_resource_allocation"}, {"score": 0.02955806095529616, "phrase": "global_cloud_exchanges"}, {"score": 0.004481132747216135, "phrase": "increasingly_perceived_vision"}, {"score": 0.0039942998891989955, "phrase": "basic_level"}, {"score": 0.003965684670332574, "phrase": "computing_service"}, {"score": 0.003853251284913932, "phrase": "everyday_needs"}, {"score": 0.0038119123317396954, "phrase": "general_community"}, {"score": 0.003677280504320636, "phrase": "computing_paradigms"}, {"score": 0.0032075033252058835, "phrase": "virtual_machines"}, {"score": 0.0030941521409613417, "phrase": "market-based_resource_management_strategies"}, {"score": 0.0030499378654797143, "phrase": "customer-drive_service_management"}, {"score": 0.0029740732099993706, "phrase": "service_level_agreement"}, {"score": 0.0026986685585382347, "phrase": "representative_cloud_platforms"}, {"score": 0.0025202582748972122, "phrase": "aneka_enterprise_cloud_technology"}, {"score": 0.0024399036842105205, "phrase": "high_performance_computing"}, {"score": 0.002387758958649797, "phrase": "internet-based_services_workload"}, {"score": 0.0023367260405565814, "phrase": "meta-negotiation_infrastructure"}, {"score": 0.0022540779997940897, "phrase": "case_study_of_harnessing_'storage_clouds'"}, {"score": 0.0022379017425216917, "phrase": "high_performance_content_delivery"}], "paper_keywords": ["Cloud computing", " Data Centers", " Utility computing", " Virtualization", " Market-oriented resource allocation"], "paper_abstract": "With the significant advances in Information and Communications Technology (ICT) over the last half century, there is an increasingly perceived vision that computing will one day be the 5th utility (after water, electricity, gas, and telephony). This Computing utility, like all other four existing utilities. will provide the basic level of computing service that is considered essential to meet the everyday needs of the general Community. To deliver this vision, a number Of Computing paradigms have been proposed, of which the latest one is known as Cloud Computing. Hence, in this paper, we define Cloud computing and provide the architecture for creating Clouds with market-oriented resource allocation by leveraging technologies such as Virtual Machines (VMs). We also provide insights on market-based resource management strategies that encompass both customer-drive service management and computational risk management to sustain Service Level Agreement (SLA)-oriented resource allocation. In addition, we reveal our early thoughts on interconnecting Clouds for dynamically creating global Cloud exchanges and markets. Then, we present some representative Cloud platforms, especially those developed in industries, along with our Current work towards realizing market-oriented resource allocation of Clouds as realized in Aneka enterprise Cloud technology. Furthermore, we highlight the difference between High Performance Computing (HPC) workload and Internet-based services workload. We also describe a meta-negotiation infrastructure to establish global Cloud exchanges and markets, and illustrate a case Study of harnessing 'Storage Clouds' for high performance content delivery. Finally, we conclude with the need for convergence of competing IT paradigms to deliver our 21st century vision. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Cloud computing and emerging IT platforms: Vision, hype, and reality for delivering computing as the 5th utility", "paper_id": "WOS:000266306300001"}