{"auto_keywords": [{"score": 0.03618870164102205, "phrase": "iebp"}, {"score": 0.006694655194727365, "phrase": "firm_performance"}, {"score": 0.00481495049065317, "phrase": "business_impact"}, {"score": 0.004571133708117498, "phrase": "relative_strategic_value"}, {"score": 0.004362226376603478, "phrase": "knowledge-based_view"}, {"score": 0.003931402465972151, "phrase": "it-enabled_business_processes"}, {"score": 0.0037516215763875225, "phrase": "superior_firm_performance"}, {"score": 0.0036174746598098863, "phrase": "information-week"}, {"score": 0.003580032420161922, "phrase": "compustat"}, {"score": 0.003062594954962045, "phrase": "significant_influence"}, {"score": 0.002448260697722081, "phrase": "integral_part"}, {"score": 0.002299921909935613, "phrase": "internal_development"}, {"score": 0.0022175679453857473, "phrase": "managerial_implications"}, {"score": 0.002171836484200008, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IT insourcing", " IT outsourcing", " IT-enabled business processes", " Types I and III innovations"], "paper_abstract": "Although research on the business impact of IT outsourcing abounds, little is known about the relative strategic value of IT outsourcing and IT insourcing. Drawing upon the knowledge-based view of the firm, this study postulates that, compared with IT outsourcing, IT insourcing is more effective for developing IT-enabled business processes (IEBP), which subsequently lead to superior firm performance. Our analysis of the data from Information-Week and Compustat shows that IT insourcing is positively associated with IEBP, while the relationship between IT outsourcing and IEBP is not statistically significant. We also find that IEBP have a significant influence on firm performance. Finally, the effect of IT sourcing mechanisms on IEBP and the effect of IEBP on firm performance are both moderated by the type of innovation related to IEBP. The results suggest that in order to improve their performance firms should consider IT an integral part of their strategic core and should be pro-actively involved in the internal development of IT resources. We conclude with managerial implications and directions for future research. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The strategic value of IT insourcing: An IT-enabled business process perspective", "paper_id": "WOS:000280042500004"}