{"auto_keywords": [{"score": 0.04504125061239473, "phrase": "multiple_users"}, {"score": 0.00481495049065317, "phrase": "white-box_traceable"}, {"score": 0.004597754207658615, "phrase": "access_structures"}, {"score": 0.004231089088705995, "phrase": "decryption_key"}, {"score": 0.004002972723329302, "phrase": "original_key_owner"}, {"score": 0.003929689573550262, "phrase": "decryption_privilege"}, {"score": 0.0037006243674469657, "phrase": "malicious_users"}, {"score": 0.0035498822293046884, "phrase": "third_parties"}, {"score": 0.0035010071030752883, "phrase": "financial_gain"}, {"score": 0.0027528751037412128, "phrase": "new_t-cp-abe_system"}, {"score": 0.0026651772919894534, "phrase": "monotone_access_structures"}, {"score": 0.0026042472337367015, "phrase": "proposed_system"}, {"score": 0.002418453525649304, "phrase": "cp-abe_systems"}, {"score": 0.0021049977753042253, "phrase": "particular_trade-off"}], "paper_keywords": ["Attribute-based encryption", " ciphertext-policy", " traceability"], "paper_abstract": "In a ciphertext-policy attribute-based encryption (CP-ABE) system, decryption keys are defined over attributes shared by multiple users. Given a decryption key, it may not be always possible to trace to the original key owner. As a decryption privilege could be possessed by multiple users who own the same set of attributes, malicious users might be tempted to leak their decryption privileges to some third parties, for financial gain as an example, without the risk of being caught. This problem severely limits the applications of CP-ABE. Several traceable CP-ABE (T-CP-ABE) systems have been proposed to address this problem, but the expressiveness of policies in those systems is limited where only AND gate with wildcard is currently supported. In this paper we propose a new T-CP-ABE system that supports policies expressed in any monotone access structures. Also, the proposed system is as efficient and secure as one of the best (non-traceable) CP-ABE systems currently available, that is, this work adds traceability to an existing expressive, efficient, and secure CP-ABE scheme without weakening its security or setting any particular trade-off on its performance.", "paper_title": "White-Box Traceable Ciphertext-Policy Attribute-Based Encryption Supporting Any Monotone Access Structures", "paper_id": "WOS:000318595000007"}