{"auto_keywords": [{"score": 0.03862495247285584, "phrase": "numerical_variables"}, {"score": 0.00481495049065317, "phrase": "critical_benchmarking_problem"}, {"score": 0.004690025569165577, "phrase": "widespread_technique"}, {"score": 0.004253618550301311, "phrase": "best_alternative"}, {"score": 0.004174451361776433, "phrase": "numerous_attempts"}, {"score": 0.004112175423546628, "phrase": "rigorous_benchmarking_process"}, {"score": 0.003511613254403125, "phrase": "binary_and_linguistic_variables"}, {"score": 0.003078504229140364, "phrase": "new_method"}, {"score": 0.003021141590548526, "phrase": "fuzzy_logic"}, {"score": 0.002976019715894587, "phrase": "key_methodological_error"}, {"score": 0.0028553693643045795, "phrase": "new_division_operator"}, {"score": 0.002833962854197749, "phrase": "fuzzy_numbers"}, {"score": 0.0028127163745564777, "phrase": "conjugated_variables"}, {"score": 0.0024748913336907923, "phrase": "final_fuzzy_rating"}, {"score": 0.002447101794397243, "phrase": "linguistic_variable"}, {"score": 0.002365587018070219, "phrase": "resulting_method"}, {"score": 0.0021289106372625252, "phrase": "sizeable_variations"}, {"score": 0.0021049977753042253, "phrase": "benchmarking_result"}], "paper_keywords": ["Benchmarking", " Fuzzy logic", " Method of calculation", " Multiple criteria comparison"], "paper_abstract": "Nowadays, benchmarking is a widespread technique for evaluating an aspect-process, product, service, etc.-by comparing it against the best in class with the aim of improving this aspect or identifying the best alternative. There have been numerous attempts at defining a rigorous benchmarking process by specifying steps that should be taken to put benchmarking into practice. All these proposals use a method of calculation that treats the weights and ratings of each criterion as numerical variables, even if they are not. This means that the binary and linguistic variables have to be artificially translated to numerical variables, misleading us into thinking that the concepts we are dealing with are quantitative when they really are not. In this paper, we propose a new method of calculation based on fuzzy logic to rectify this key methodological error. Its definition is based on: (i) a new division operator for fuzzy numbers representing conjugated variables, as in the case outlined here; (ii) a new aggregation operator that can integrate binary, numerical and/or linguistic variables; and, finally, (iii) an operator that can translate the final fuzzy rating into the linguistic variable that best represents it. Therefore, the resulting method is: (i) closer to the user since it manages more human-understandable values and (ii) not dependent on the above artificial translation process, which could lead to sizeable variations in the benchmarking result.", "paper_title": "A fuzzy approach for solving a critical benchmarking problem", "paper_id": "WOS:000278931800003"}