{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_embeddedness"}, {"score": 0.012574945339095409, "phrase": "blogger_creativity"}, {"score": 0.011623288022112203, "phrase": "integration_ability"}, {"score": 0.007723886473079915, "phrase": "competitive_advantage"}, {"score": 0.006041483212918896, "phrase": "structural_embeddedness"}, {"score": 0.005991338460768127, "phrase": "relational_embeddedness"}, {"score": 0.004774937143916685, "phrase": "bloggers'_creativity"}, {"score": 0.004735254735115024, "phrase": "purpose_-_blogs"}, {"score": 0.004447915226010682, "phrase": "commercial_success"}, {"score": 0.004410938507689426, "phrase": "blog_service_providers"}, {"score": 0.004125934074896249, "phrase": "creative_content"}, {"score": 0.003924284136338428, "phrase": "creativity_theory"}, {"score": 0.003763763153640936, "phrase": "online_embeddedness_system"}, {"score": 0.0035204268675160257, "phrase": "structural_and_relational_embeddedness"}, {"score": 0.0034620831765465425, "phrase": "hierarchical_regression"}, {"score": 0.003404703106153948, "phrase": "statistical_analysis"}, {"score": 0.003376369479008885, "phrase": "findings_-_analytical_results"}, {"score": 0.0027741761880779535, "phrase": "professional_knowledge"}, {"score": 0.002671722386856879, "phrase": "moderating_effect"}, {"score": 0.002530359917257626, "phrase": "practical_implications_-_creative_articles"}, {"score": 0.00246765655376112, "phrase": "blog_platform"}, {"score": 0.0023764959294052964, "phrase": "new_bloggers"}, {"score": 0.002298288831092204, "phrase": "creative_performance"}, {"score": 0.0021049977753042253, "phrase": "blog_web_sites"}], "paper_keywords": ["Blog", " Creativity", " Motivation", " Social embeddedness", " Integration ability"], "paper_abstract": "Purpose - Blogs provide opportunities for bloggers to create. This creativity can attract audiences and generate commercial success for blog service providers (BSPs). Thus to obtain competitive advantage, such providers should stimulate their bloggers to produce creative content. The purpose of this paper is to adopt social embeddedness and creativity theory to explore factors influencing blogger creativity. Design/methodology/approach - An online questionnaire and an online embeddedness system are used to collect data from 353 bloggers, including data on their motivation, integration ability, structural and relational embeddedness and creativity. Hierarchical regression is applied for statistical analysis. Findings - Analytical results show that structural embeddedness and relational embeddedness affect blogger creativity. Additionally motivation negatively moderates the relationship between structural embeddedness and creativity, and integration ability negatively moderates the relationship between relational embeddedness and creativity. Research limitations/implications - This study applies social embeddedness to elucidate the relationships among quantity and quality of professional knowledge and creativity. This study also discusses the moderating effect of motivation and integration ability on the relationship between social embeddedness and creativity. Practical implications - Creative articles by bloggers can popularise a blog platform, as they can retain bloggers and attract new bloggers. Therefore, for BSPs enhancing the creative performance of bloggers is one way to obtain competitive advantage. Originality/value - The study contributes to knowledge of social embeddedness and creativity on blog web sites, and importantly, this study develops a model that explains how antecedents influence blogger creativity.", "paper_title": "The effect of social embeddedness on bloggers' creativity", "paper_id": "WOS:000342001500006"}