{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "subcellular_localization"}, {"score": 0.004492406361795448, "phrase": "structural_class"}, {"score": 0.004339293854115301, "phrase": "classification_problem"}, {"score": 0.004119313626110943, "phrase": "feature_vector_x"}, {"score": 0.003777088546146369, "phrase": "primary_sequence"}, {"score": 0.0037336520904376687, "phrase": "derived_properties"}, {"score": 0.003138768436081888, "phrase": "specific_environmental_conditions"}, {"score": 0.002911278281894321, "phrase": "specific_subcellular_localizations"}, {"score": 0.0027634902834910184, "phrase": "strong_correlation"}, {"score": 0.0021049977753042253, "phrase": "structural_classification"}], "paper_keywords": ["bioinformatics", " protein subcellular localization", " protein fold prediction"], "paper_abstract": "When considering the prediction of a structural class for a protein as a classification problem, usually a classifier is based on a feature vector x is an element of R(n), where the features represent certain attributes of the primary sequence or derived properties (e.g., the predicted secondary structure) of a given protein. Since the structure of a protein (i.e., its native conformation) is stable only under specific environmental conditions, it is commonly accepted to assume proteins being evolutionarily adapted to specific subcellular localizations and according to their physicochemical environment. Our statistical evaluation shows a strong correlation between the subcellular localization of proteins and their structural class. The correlation is strong enough to allow for a classification of proteins into their structural class solely based on information regarding the subcellular localization. We conclude that knowledge regarding the subcellular localization of proteins can be useful as a feature for the structural classification of proteins.", "paper_title": "Investigating a Correlation between Subcellular Localization and Fold of Proteins", "paper_id": "WOS:000277568600003"}