{"auto_keywords": [{"score": 0.0039114753002009485, "phrase": "localized_prostate_cancer"}, {"score": 0.003820144626025562, "phrase": "brachytherapy_treatment"}, {"score": 0.003626626504149897, "phrase": "radial_basis_function_interpolation"}, {"score": 0.003426640459083931, "phrase": "modified_principal_axis_transformation"}, {"score": 0.0033624514778823763, "phrase": "rigid_registration"}, {"score": 0.0030881143614111552, "phrase": "statistical_shape_models"}, {"score": 0.0029594318330247614, "phrase": "subsequent_cross-modality_comparison"}, {"score": 0.002822712709335093, "phrase": "geometric_comparisons"}, {"score": 0.002769805263310232, "phrase": "prostate_volumes"}, {"score": 0.0025678829712650437, "phrase": "automatic_contour_segmentation"}, {"score": 0.0025316905609748135, "phrase": "pre-implant_planning_stage"}, {"score": 0.002426137929553722, "phrase": "new_scheme"}, {"score": 0.002259883463607508, "phrase": "first_step"}, {"score": 0.0022175019341824603, "phrase": "coupled_us-mr_segmentation_strategies"}, {"score": 0.002196609505859369, "phrase": "prostate_brachytherapy_pre-implant_planning"}], "paper_keywords": ["Prostate brachytherapy", " radial basis function", " rigid registration", " segmentation", " statistic shape model"], "paper_abstract": "This paper presents a comparison of three-dimensional (3-D) segmentations of the prostate, based on two-dimensional (2-D) manually segmented contours, obtained using ultrasound (US) and magnetic resonance (MR) imaging data collected from 40 patients diagnosed with localized prostate cancer and scheduled to receive brachytherapy treatment. The approach we propose here for 3-D prostate segmentation first uses radial basis function interpolation to construct a 3-D point distribution model for each prostate. Next, a modified principal axis transformation is utilized for rigid registration of the US and MR images of the same prostate in preparation for the following shape comparison. Then, statistical shape models are used to capture the segmented 3-D prostate geometries for the subsequent cross-modality comparison. Our study includes not only cross-modality geometric comparisons in terms of prostate volumes and dimensions, but also an investigation of interchangeability of the two imaging modalities in terms of automatic contour segmentation at the pre-implant planning stage of prostate brachytherapy treatment. By developing a new scheme to compare the two imaging modalities in terms of the segmented 3-D shapes, we have taken a first step necessary for building coupled US-MR segmentation strategies for prostate brachytherapy pre-implant planning, which at present is predominantly informed by US images only.", "paper_title": "A Comparison of US- Versus MR-Based 3-D Prostate Shapes Using Radial Basis Function Interpolation and Statistical Shape Models", "paper_id": "WOS:000351091200025"}