{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "imbalanced_text_classification"}, {"score": 0.04645838146569139, "phrase": "imbalanced_classification"}, {"score": 0.03447806482501646, "phrase": "proposed_strategies"}, {"score": 0.004077616905584829, "phrase": "text_domain"}, {"score": 0.003911578552479064, "phrase": "comparative_study"}, {"score": 0.003683565150278339, "phrase": "support_vector_machines"}, {"score": 0.0035830670369543867, "phrase": "svm"}, {"score": 0.003177154457204775, "phrase": "test_phases"}, {"score": 0.0031479142819948007, "phrase": "text_classification_tasks"}, {"score": 0.0026042472337367015, "phrase": "precision-recall_curve"}, {"score": 0.0025683581446365165, "phrase": "performance_measure"}, {"score": 0.00249805321224923, "phrase": "best_decision_surface"}, {"score": 0.002429668083484833, "phrase": "standard_svm"}, {"score": 0.0022458849724980904, "phrase": "application_developers"}, {"score": 0.002164264600379492, "phrase": "thresholding_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Imbalanced text classification", " Support Vector Machines", " SVM", " Resampling", " Instance weighting"], "paper_abstract": "Many real-world text classification tasks involve imbalanced training examples. The strategies proposed to address the imbalanced classification (e.g., resampling, instance weighting), however, have not been systematically evaluated in the text domain. In this paper, we conduct a comparative study on the effectiveness of these strategies in the context of imbalanced text classification using Support Vector Machines (SVM) classifier. SVM is the interest in this study for its good classification accuracy reported in many text classification tasks. We propose a taxonomy to organize all proposed strategies following the training and the test phases in text classification tasks. Based on the taxonomy, we survey the methods proposed to address the imbalanced classification. Among them, 10 commonly-used methods were evaluated in our experiments on three benchmark datasets, i.e., Reuters-21578, 20-Newsgroups, and WebKB. Using the area under the Precision-Recall Curve as the performance measure, our experimental results showed that the best decision surface was often learned by the standard SVM, not coupled with any of the proposed strategies. We believe such a negative finding will benefit both researchers and application developers in the area by focusing more on thresholding strategies. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "On strategies for imbalanced text classification using SVM: A comparative study", "paper_id": "WOS:000272366100020"}