{"auto_keywords": [{"score": 0.03954948965131843, "phrase": "class_time"}, {"score": 0.03880550409822826, "phrase": "computer_simulations"}, {"score": 0.03783439259839164, "phrase": "group_c"}, {"score": 0.015719716506582538, "phrase": "circular_motions"}, {"score": 0.011138167297464184, "phrase": "group_d"}, {"score": 0.004767826806287385, "phrase": "computer_simulation_program"}, {"score": 0.004479855062309818, "phrase": "moving_particle"}, {"score": 0.004278807087784626, "phrase": "angular_position-time_figure"}, {"score": 0.003903269701018361, "phrase": "d._group_a"}, {"score": 0.003814632693659797, "phrase": "group_b"}, {"score": 0.0034911335714333507, "phrase": "simulation_programs"}, {"score": 0.003423042581201533, "phrase": "individual_student"}, {"score": 0.0032266093099550955, "phrase": "in-class_handout"}, {"score": 0.0030715271045670504, "phrase": "groups_b"}, {"score": 0.0027833043858224078, "phrase": "best_test_scores"}, {"score": 0.002424543908235379, "phrase": "learning_result"}, {"score": 0.0021398811716327273, "phrase": "closely_related_handout"}], "paper_keywords": ["simulations", " circular motions", " constant angular acceleration", " mechanics"], "paper_abstract": "A computer simulation program has been developed and is used in teaching and learning for circular motions. The program can illustrate a moving particle with its position, velocity, and acceleration. It can also draw the angular position-time figure, angular velocity-time figure, and angular acceleration-time figure. Students were divided into 4 groups: A, B, C, and D. Group A used only traditional teaching methods without computer simulations. Group B used 20% of class time to see demos of the computer simulations that were controlled by instructors only. Group C used 20% of the class time in using the simulation programs which were controlled by the individual student. Group D used 20% of the class time to see demos controlled by the instructors and complete an in-class handout that was closely related to the simulations. The results showed that Students in Groups B, C, and D did better on the examination. This suggested that the computer simulations helped students understand the motions more clearly. Students in group D had the best test scores and the most positive responses to the teaching and learning. This suggested that a handout closely related to the computer simulations would greatly help students understand the topic more precisely. Only students in Group C could control the simulation by themselves, but the learning result of Group C was not the best. This suggested that many students did not know how to learn through interaction with computers. Most of the students learn more from the demos controlled by the instructors and a closely related handout. (c) 2015 Wiley Periodicals, Inc. Comput Appl Eng Educ 23:865-871, 2015; View this article online at ; DOI", "paper_title": "A computer simulation in mechanics teaching and learning: A case study in circular motions", "paper_id": "WOS:000365597100007"}