{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recognition_algorithms"}, {"score": 0.004760017604908536, "phrase": "challenging_tasks"}, {"score": 0.004533427352547707, "phrase": "uncontrolled_illumination_conditions"}, {"score": 0.004494570360108983, "phrase": "indoor_and_outdoor_settings"}, {"score": 0.004417848254181138, "phrase": "person's_day-to-day_appearance"}, {"score": 0.003916098498242888, "phrase": "frontal_view_face_images"}, {"score": 0.0038052556098065694, "phrase": "appearance-based_variability"}, {"score": 0.003751011827704279, "phrase": "face_recognition_algorithm"}, {"score": 0.0036763623220059933, "phrase": "recent_international_competition"}, {"score": 0.003623949225126944, "phrase": "similarity_scores"}, {"score": 0.003592859432554987, "phrase": "constant_set"}, {"score": 0.0035722806911457545, "phrase": "same-identity_and_different-identity_pairings"}, {"score": 0.0032398798149196432, "phrase": "photometric_variables"}, {"score": 0.003166259444961177, "phrase": "particular_identities"}, {"score": 0.0031481164109237636, "phrase": "algorithm_performance"}, {"score": 0.0031210959920028357, "phrase": "constant_identity_pairings"}, {"score": 0.00298942278888105, "phrase": "image_pairs"}, {"score": 0.002711109302199029, "phrase": "good_and_moderate_conditions"}, {"score": 0.0026418666490652873, "phrase": "poor_accuracy_condition"}, {"score": 0.0025596276616952516, "phrase": "appearance-based_recognition_conditions"}, {"score": 0.002402731767209114, "phrase": "challenging_frontal_images"}, {"score": 0.002382093728856282, "phrase": "face_recognition_systems"}, {"score": 0.0023346234464901978, "phrase": "comparable_difficulty"}, {"score": 0.0022104795254900746, "phrase": "algorithms'_use"}, {"score": 0.0021171419388153786, "phrase": "robust_generalization"}, {"score": 0.0021049977753042253, "phrase": "suboptimal_viewing_conditions"}], "paper_keywords": ["Algorithms", " Human Factors", " Verification", " Experimentation", " Face recognition", " human-machine comparisons"], "paper_abstract": "We compared face identification by humans and machines using images taken under a variety of uncontrolled illumination conditions in both indoor and outdoor settings. Natural variations in a person's day-to-day appearance (e.g., hair style, facial expression, hats, glasses, etc.) contributed to the difficulty of the task. Both humans and machines matched the identity of people (same or different) in pairs of frontal view face images. The degree of difficulty introduced by photometric and appearance-based variability was estimated using a face recognition algorithm created by fusing three top-performing algorithms from a recent international competition. The algorithm computed similarity scores for a constant set of same-identity and different-identity pairings from multiple images. Image pairs were assigned to good, moderate, and poor accuracy groups by ranking the similarity scores for each identity pairing, and dividing these rankings into three strata. This procedure isolated the role of photometric variables from the effects of the distinctiveness of particular identities. Algorithm performance for these constant identity pairings varied dramatically across the groups. In a series of experiments, humans matched image pairs from the good, moderate, and poor conditions, rating the likelihood that the images were of the same person (1: sure same -5: sure different). Algorithms were more accurate than humans in the good and moderate conditions, but were comparable to humans in the poor accuracy condition. To date, these are the most variable illumination-and appearance-based recognition conditions on which humans and machines have been compared. The finding that machines were never less accurate than humans on these challenging frontal images suggests that face recognition systems may be ready for applications with comparable difficulty. We speculate that the superiority of algorithms over humans in the less challenging conditions may be due to the algorithms' use of detailed, view-specific identity information. Humans may consider this information less important due to its limited potential for robust generalization in suboptimal viewing conditions.", "paper_title": "Comparing Face Recognition Algorithms to Humans on Challenging Tasks", "paper_id": "WOS:000310164900001"}