{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "recommender_system"}, {"score": 0.015181147387483176, "phrase": "user's_ratings"}, {"score": 0.011980835536596818, "phrase": "similar_preference"}, {"score": 0.011704603944158547, "phrase": "existing_approaches"}, {"score": 0.004777392826700429, "phrase": "item_clustering"}, {"score": 0.00452252857066346, "phrase": "highly-predicted_items"}, {"score": 0.00440042095210079, "phrase": "rs"}, {"score": 0.004281202319048493, "phrase": "agent_research_field"}, {"score": 0.004181743040532619, "phrase": "great_deal"}, {"score": 0.004084584884062157, "phrase": "agent_technology"}, {"score": 0.004052701031142039, "phrase": "rs._collaborative_filtering"}, {"score": 0.0038363485899400285, "phrase": "user's_rating"}, {"score": 0.003547084456662448, "phrase": "user_similarity"}, {"score": 0.0034646205853140558, "phrase": "whole_set"}, {"score": 0.0030680392468327147, "phrase": "totally_different_judgement"}, {"score": 0.0026327757304477665, "phrase": "item_clustering_phase"}, {"score": 0.0024340403320192807, "phrase": "similarity_preference"}, {"score": 0.002259123228671651, "phrase": "real_dataset"}, {"score": 0.0022326811387454364, "phrase": "movielens"}, {"score": 0.0021049977753042253, "phrase": "prediction_accuracy"}], "paper_keywords": ["recommender system", " collaborative filtering", " item clustering"], "paper_abstract": "Recommender System (RS) predicts user's ratings towards items, and then recommends highly-predicted items to user. In recent years, RS has been playing more and more important role in the agent research field. There have been a great deal of researches trying to apply agent technology to RS. Collaborative Filtering, one of the most widely used approach to predict user's ratings in Recommender System, predicts a user's rating towards an item by aggregating ratings given by users who have similar preference to that user. In existing approaches, user similarity is often computed on the whole set of items. However, because the number of items is often very large and so is the diversity among items, users who have similar preference in one category may have totally different judgement on items of another kind. In order to deal with this problem, we propose a method to cluster items, so that inside a cluster, similarity between users does not change significantly from item to item. After the item clustering phase, when predicting rating of a user towards an item, we only aggregate ratings of users who have similarity preference to that user inside the cluster of that item. Experiments evaluating our approach are carried out on the real dataset taken from MovieLens, a movies recommendation web site. Experiment results suggest that our approach can improve prediction accuracy compared to existing approaches.", "paper_title": "Improving accuracy of recommender system by item clustering", "paper_id": "WOS:000250094600005"}