{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "decentralized_environment"}, {"score": 0.004618720776729413, "phrase": "emerging_challenge"}, {"score": 0.0045641317216991205, "phrase": "ai_research"}, {"score": 0.004149922666541166, "phrase": "multi-agent_planning"}, {"score": 0.003980687255880282, "phrase": "common_means"}, {"score": 0.003795677450778112, "phrase": "robust_distributed_systems"}, {"score": 0.0036625643243684827, "phrase": "potential_miscoordination"}, {"score": 0.0031750418391373035, "phrase": "decision-theoretic_context"}, {"score": 0.0030819219279832224, "phrase": "formal_framework"}, {"score": 0.002903771635043968, "phrase": "necessary_and_sufficient_properties"}, {"score": 0.0027522340188241446, "phrase": "probabilistic_updating_schemes"}, {"score": 0.002357337046408753, "phrase": "different_languages"}, {"score": 0.0021049977753042253, "phrase": "varying_complexity"}], "paper_keywords": ["multi-agent systems", " learning", " communication", " probabilistic methods"], "paper_abstract": "Learning to communicate is an emerging challenge in AI research. It is known that agents interacting in decentralized, stochastic environments can benefit from exchanging information. Multi-agent planning generally assumes that agents share a common means of communication; however, in building robust distributed systems it is important to address potential miscoordination resulting from misinterpretation of messages exchanged. This paper lays foundations for studying this problem, examining its properties analytically and empirically in a decision-theoretic context. We establish a formal framework for the problem, and identify a collection of necessary and sufficient properties for decision problems that allow agents to employ probabilistic updating schemes in order to learn how to interpret what others are communicating. Solving the problem optimally is often intractable, but our approach enables agents using different languages to converge upon coordination over time. Our experimental work establishes how these methods perform when applied to problems of varying complexity.", "paper_title": "Learning to communicate in a decentralized environment", "paper_id": "WOS:000246765000004"}