{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "molecular_basis_of"}, {"score": 0.004610058444728656, "phrase": "potential_effects"}, {"score": 0.004527269879990066, "phrase": "clinical_drug_drug_interactions"}, {"score": 0.004445961412092278, "phrase": "molecular_property"}, {"score": 0.004165105357908494, "phrase": "entropy-based_index"}, {"score": 0.003990624773638892, "phrase": "new_chemicals"}, {"score": 0.003973320429450603, "phrase": "comprehensive_data_set"}, {"score": 0.003537886893587656, "phrase": "moderate_correlation"}, {"score": 0.003512308265830794, "phrase": "molecular_aromaticity"}, {"score": 0.0034366728236876047, "phrase": "molecular_lipophilicity"}, {"score": 0.003362660648932244, "phrase": "molecular_complexity"}, {"score": 0.0033383446480705894, "phrase": "hydrogen_bonding_ability"}, {"score": 0.0033021988455635403, "phrase": "topopsa."}, {"score": 0.002993947751499058, "phrase": "surprising_level"}, {"score": 0.0027143926774929957, "phrase": "essentially_no_correlation"}, {"score": 0.002655894070657161, "phrase": "minor_negative_trade-offs"}, {"score": 0.002598652897946253, "phrase": "catalytic_promiscuity"}, {"score": 0.0025518930446603335, "phrase": "classification_models"}, {"score": 0.002460876181416983, "phrase": "support_vector_machine_algorithm"}, {"score": 0.0023730978395564116, "phrase": "operating_characteristic_curve"}, {"score": 0.002347378595930709, "phrase": "best_model"}, {"score": 0.0021049977753042253, "phrase": "drug_discovery"}], "paper_keywords": [""], "paper_abstract": "Cytochrome P450 inhibitory promiscuity of a drug has potential effects on the occurrence of clinical drug drug interactions. Understanding how a molecular property is related, to the P450 inhibitory promiscuity could help to avoid such adverse effects. In this study, an entropy-based index was defined to quantify the P450 inhibitory promiscuity of a compound based on a comprehensive data set, containing more than 11,500 drug-like compounds with inhibition against five major P450 isoforms, 1A2, 2C9, 2C19, 2D6, and 3A4. The results indicated that the P450 inhibitory promiscuity of a compound would have a moderate correlation with molecular aromaticity, a minor correlation with molecular lipophilicity, and no relations with molecular complexity, hydrogen bonding ability, and TopoPSA. We also applied an index to quantify the susceptibilities of different P450 isoforms to inhibition based on the same data set. The results showed that there was a surprising level of P450 inhibitory promiscuity even for substrate specific P450, susceptibility to inhfpition follows the rank-order: 1A2 > 2C19 > 3A4 > 2C9 > 2D6. There was essentially no correlation between P450 inhibitory potency and specificity and minor negative trade-offs between P450 inhibitory promiscuity and catalytic promiscuity. In addition, classification models were built to predict the P450 inhibitory promiscuity of new chemicals using support vector machine algorithm with different fingerprints. The area under the receiver operating characteristic curve of the best model was about 0.9, evaluated by 5-fold cross-validation. These findings would be helpful for understanding the mechanism of P450 inhibitory promiscuity and improving the P450 inhibitory selectivity of new chemicals in drug discovery.", "paper_title": "Insights into Molecular Basis of Cytochrome P450 Inhibitory Promiscuity of Compounds", "paper_id": "WOS:000296044200005"}