{"auto_keywords": [{"score": 0.0495133738546852, "phrase": "target_representation"}, {"score": 0.04494806290970924, "phrase": "accumulated_errors"}, {"score": 0.03393139807622968, "phrase": "locally_mutual_relations"}, {"score": 0.03334897348832244, "phrase": "feature_observations"}, {"score": 0.00481495049065317, "phrase": "sparsity-induced_subspace_learning"}, {"score": 0.0046739596755881185, "phrase": "necessary_component"}, {"score": 0.004591345494188032, "phrase": "robust_tracker"}, {"score": 0.002991524908432975, "phrase": "subspace_representation"}, {"score": 0.0029561107046138136, "phrase": "visual_tracking"}, {"score": 0.0028354207806133153, "phrase": "novel_subspace_learning_algorithm"}, {"score": 0.002719644855867468, "phrase": "joint_row-wise_sparsity_structure"}, {"score": 0.002593091742792519, "phrase": "distractive_information"}, {"score": 0.002234252028553481, "phrase": "subspace_sparsity_inducing_problem"}, {"score": 0.0021946656099592608, "phrase": "large_number"}], "paper_keywords": ["Visual tracking", " subspace learning", " sparse representation", " sparsity inducing"], "paper_abstract": "Target representation is a necessary component for a robust tracker. However, during tracking, many complicated factors may make the accumulated errors in the representation significantly large, leading to tracking drift. This paper aims to improve the robustness of target representation to avoid the influence of the accumulated errors, such that the tracker only acquires the information that facilitates tracking and ignores the distractions. We observe that the locally mutual relations between the feature observations of temporally obtained targets are beneficial to the subspace representation in visual tracking. Thus, we propose a novel subspace learning algorithm for visual tracking, which imposes joint row-wise sparsity structure on the target subspace to adaptively exclude distractive information. The sparsity is induced by exploiting the locally mutual relations between the feature observations during learning. To this end, we formulate tracking as a subspace sparsity inducing problem. A large number of experiments on various challenging video sequences demonstrate that our tracker outperforms many other state-of-the-art trackers.", "paper_title": "Robust Visual Tracking via Sparsity-Induced Subspace Learning", "paper_id": "WOS:000361685100002"}