{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cartacom"}, {"score": 0.01533710918073171, "phrase": "communicating_agents"}, {"score": 0.010631048408991579, "phrase": "cartacom_model"}, {"score": 0.00947019166096844, "phrase": "cartacom_agents"}, {"score": 0.004735651915966323, "phrase": "cartographic_features"}, {"score": 0.004657653216262924, "phrase": "cartographic_generalisation"}, {"score": 0.004543046350523362, "phrase": "automated_generalisation"}, {"score": 0.004505471345843642, "phrase": "topographic_vector_databases"}, {"score": 0.004010785080336424, "phrase": "low_density"}, {"score": 0.00396110232316167, "phrase": "rubber_sheeting_techniques"}, {"score": 0.003660374693346876, "phrase": "initial_database"}, {"score": 0.003482276061796395, "phrase": "generalisation_algorithms"}, {"score": 0.003151572886432253, "phrase": "relational_constraints"}, {"score": 0.0027473784878300133, "phrase": "good_generalisation_decisions"}, {"score": 0.002602734354498382, "phrase": "predefined_dialogue_protocols"}, {"score": 0.002517524071220657, "phrase": "agent-based_generalisation_model"}, {"score": 0.002507384943259947, "phrase": "agent"}, {"score": 0.0021049977753042253, "phrase": "real_data"}], "paper_keywords": ["cartographic generalisation", " constraints modelling", " spatial environment", " multi-agent", " communicative agents", " topographic data"], "paper_abstract": "Our research is concerned with automated generalisation of topographic vector databases in order to produce maps. This article presents a new, agent-based generalisation model called CARTACOM (Cartographic generalisation with Communicating Agents), dedicated to the treatment of areas of low density but where rubber sheeting techniques are not sufficient because some eliminations or aggregations are needed. In CARTACOM, the objects of the initial database are modelled as agents, that is, autonomous entities, that choose and apply generalisation algorithms to themselves in order to increase the satisfaction of their constraints as much as possible. The CARTACOM model focuses on modelling and treating the relational constraints, defined as constraints that concern a relation between two objects. In order to detect and assess their relational constraints, the CARTACOM agents are able to perceive their spatial surroundings. Moreover, to make the good generalisation decisions to satisfy their relational constraints, they are able to communicate with their neighbours using predefined dialogue protocols. Finally, a hook to another agent-based generalisation model AGENT is provided, so that the CARTACOM agents can handle not only their relational constraints but also their internal constraints. The CARTACOM model has been applied to the generalisation of low-density, heterogeneous areas like rural areas, where the space is not hierarchically organised. Examples of results obtained on real data show that it is well adapted for this application.", "paper_title": "The CARTACOM model: transforming cartographic features into communicating agents for cartographic generalisation", "paper_id": "WOS:000309045700001"}