{"auto_keywords": [{"score": 0.038826374424210316, "phrase": "positive_affect"}, {"score": 0.0038106195546165574, "phrase": "strong_relation"}, {"score": 0.0037321585095070483, "phrase": "need_fulfillment"}, {"score": 0.0036174746598098863, "phrase": "different_activities"}, {"score": 0.003580032420161922, "phrase": "different_need_profiles"}, {"score": 0.0034700069041302003, "phrase": "relatedness_experience"}, {"score": 0.0033633514001658086, "phrase": "meaning_experience"}, {"score": 0.0032769720645483102, "phrase": "competence_experience"}, {"score": 0.0030946423142739813, "phrase": "hedonic_quality"}, {"score": 0.002803213985198645, "phrase": "pragmatic_quality"}, {"score": 0.0027311809666295565, "phrase": "experiential_measures"}, {"score": 0.0026888503045081505, "phrase": "present_study"}, {"score": 0.002473895542219933, "phrase": "product-oriented_evaluation"}, {"score": 0.002360607691114015, "phrase": "possible_measurement_instruments"}, {"score": 0.0021493248730171132, "phrase": "positive_experience"}, {"score": 0.0021049977753042253, "phrase": "positive_product_perceptions"}], "paper_keywords": [""], "paper_abstract": "We collected over a thousand technology-mediated positive experiences with media and obtained measures describing aspects of the experience itself (affect, psychological need fulfillment) and of the product (i.e., content and technology) integral to the experience (pragmatic quality, hedonic quality). We found a strong relation between intensity of need fulfillment and positive affect. Furthermore, different activities had different need profiles. Watching was foremost a relatedness experience, listening a stimulation and meaning experience, and playing a competence experience. Need fulfillment and positive affect was related to perceptions of hedonic quality, however moderated through attribution, that is, the belief that the product played a role in creating the experience. Pragmatic quality was not linked to experiential measures. The present study (a) demonstrates the merits of distinguishing between an experience-oriented and a product-oriented evaluation, (b) suggests a set of possible measurement instruments for experience-oriented and a product-oriented evaluation, and (c) details the process of how positive experience is transformed into positive product perceptions and judgments of appeal.", "paper_title": "Experience-Oriented and Product-Oriented Evaluation: Psychological Need Fulfillment, Positive Affect, and Product Perception", "paper_id": "WOS:000359008400006"}