{"auto_keywords": [{"score": 0.041579187248500495, "phrase": "people's_decisions"}, {"score": 0.035691633403631795, "phrase": "virtual_humans"}, {"score": 0.00481495049065317, "phrase": "emotion_expressions"}, {"score": 0.0047804843375940835, "phrase": "people's_decision_making"}, {"score": 0.004546000131069232, "phrase": "different_behavior"}, {"score": 0.004513450434595191, "phrase": "lower_activation"}, {"score": 0.004481132747216135, "phrase": "brain_regions"}, {"score": 0.004322967486451877, "phrase": "other's_mental_states"}, {"score": 0.004023120753104693, "phrase": "affective_computing"}, {"score": 0.0038256426589560774, "phrase": "emotional_expressions"}, {"score": 0.0035346515636097533, "phrase": "social_dilemma"}, {"score": 0.0030171910207671205, "phrase": "deep_impact"}, {"score": 0.0028689475587958917, "phrase": "cooperative_facial_displays"}, {"score": 0.0028076592725295646, "phrase": "mutual_cooperation"}, {"score": 0.0027775064989253575, "phrase": "competitive_displays"}, {"score": 0.0023791769068748194, "phrase": "neutral_virtual_humans"}], "paper_keywords": ["Human versus computers", " emotion expression", " decision making"], "paper_abstract": "Recent research in perception and theory of mind reveals that people show different behavior and lower activation of brain regions associated with mentalizing (i.e., the inference of other's mental states) when engaged in decision making with computers, when compared to humans. These findings are important for affective computing because they suggest people's decisions might be influenced differently according to whether they believe emotional expressions shown in computers are being generated by algorithms or humans. To test this, we had people engage in a social dilemma (Experiment 1) or negotiation (Experiment 2) with virtual humans that were either perceived to be agents (i.e., controlled by computers) or avatars (i.e., controlled by humans). The results showed that such perceptions have a deep impact on people's decisions: in Experiment 1, people cooperated more with virtual humans that showed cooperative facial displays (e.g., joy after mutual cooperation) than competitive displays (e.g., joy when the participant was exploited) but, the effect was stronger with avatars (d = .601) than with agents (d = .360); in Experiment 2, people conceded more to angry than neutral virtual humans but, again, the effect was much stronger with avatars (d = 1.162) than with agents (d = .066). Participants also showed less anger towards avatars and formed more positive impressions of avatars when compared to agents.", "paper_title": "Humans versus Computers: Impact of Emotion Expressions on People's Decision Making", "paper_id": "WOS:000356172600006"}