{"auto_keywords": [{"score": 0.040068893161497525, "phrase": "robdd-"}, {"score": 0.02322730111336098, "phrase": "implied_literals"}, {"score": 0.014635236891642714, "phrase": "robdd"}, {"score": 0.008898365939516699, "phrase": "querying_requirements"}, {"score": 0.006069643545122475, "phrase": "robdd-_compilation_algorithm"}, {"score": 0.004674952036988355, "phrase": "reduced_ordered_binary_decision_diagram"}, {"score": 0.004294625285753825, "phrase": "new_language"}, {"score": 0.003974349782102708, "phrase": "knowledge_compilation_map"}, {"score": 0.0037602557461171478, "phrase": "precisely_implied_literals"}, {"score": 0.003664315990489347, "phrase": "robdd._robdd-"}, {"score": 0.003353521531649663, "phrase": "canonical_representation"}, {"score": 0.0030239842475439814, "phrase": "logical_operation"}, {"score": 0.0028189599390180536, "phrase": "equivalent_robdds"}, {"score": 0.0026277995163948263, "phrase": "robdd-_package"}, {"score": 0.0022834017104377525, "phrase": "relatively_efficient_logical_operations"}, {"score": 0.002192389791199368, "phrase": "knowledge_base"}, {"score": 0.0021049977753042253, "phrase": "efficient_robdd_compiler"}], "paper_keywords": ["Knowledge compilation", " Target language", " Reduced ordered binary decision diagram", " Implied literal"], "paper_abstract": "Reduced ordered binary decision diagram (ROBDD) is one of the most influential knowledge compilation languages. We generalize it by associating some implied literals with each node to propose a new language called ROBDD with implied literals (ROBDD-) and show that ROBDD- can meet most of the querying requirements involved in the knowledge compilation map. Then, we discuss a kind of subsets of ROBDD- called ROBDD- with precisely implied literals , where ROBDD- is isomorphic to ROBDD. ROBDD- has uniqueness over any given linear order of variables. We mainly focus on ROBDD- and demonstrate that: (a) it is a canonical representation on any given variable order; (b) it is the most succinct subset in ROBDD- and thus also meets most of the querying requirements; (c) given any logical operation ROBDD supports in polytime, ROBDD- can also support it in time polynomial in the sizes of the equivalent ROBDDs. Moreover, we propose an ROBDD- compilation algorithm for any and an ROBDD- compilation algorithm, and then we implement an ROBDD- package called BDDjLu. Our preliminary experimental results indicate that: (a) the compilation results of ROBDD- are significantly smaller than those of ROBDD; (b) the standard d-DNNF compiler c2d and our ROBDD- compiler do not dominate the other, yet ROBDD- has canonicity and supports more querying requirements and relatively efficient logical operations; and (c) the method that first compiles knowledge base into ROBDD- and then converts ROBDD- into ROBDD provides an efficient ROBDD compiler.", "paper_title": "Reduced ordered binary decision diagram with implied literals: a new knowledge compilation approach", "paper_id": "WOS:000318374200007"}