{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "top-k_dominating_queries"}, {"score": 0.033077973189424986, "phrase": "input_objects"}, {"score": 0.004515004397496303, "phrase": "k_best_items"}, {"score": 0.004448471107649881, "phrase": "comprehensive_\"goodness\"_criterion"}, {"score": 0.003834548373258131, "phrase": "existing_works"}, {"score": 0.0037039021744127783, "phrase": "data_objects"}, {"score": 0.0036673959568781734, "phrase": "multidimensional_points"}, {"score": 0.0029490571526071016, "phrase": "prior_works"}, {"score": 0.0027513507830537165, "phrase": "dominance_relation"}, {"score": 0.002516457934208144, "phrase": "first_study"}, {"score": 0.00240662380079115, "phrase": "distance-based_dynamic_attribute_vectors"}, {"score": 0.0023476849595393872, "phrase": "metric_space"}, {"score": 0.002223039450439376, "phrase": "underlying_metric_space"}], "paper_keywords": ["Algorithms", " Performance", " Dominating queries", " metric spaces", " distance computation"], "paper_abstract": "Top-k dominating queries combine the natural idea of selecting the k best items with a comprehensive \"goodness\" criterion based on dominance. A point p(1) dominates p(2) if p(1) is as good as P-2 in all attributes and is strictly better in at least one. Existing works address the problem in settings where data objects are multidimensional points. However, there are domains where we only have access to the distance between two. objects. In cases like these, attributes reflect distances from a set of input objects and are dynamically generated as the input objects change. Consequently, prior works from the literature cannot be applied, despite the fact that the dominance relation is still meaningful and valid. For this reason, in this work, we present the first study for processing top-k dominating queries over distance-based dynamic attribute vectors, defined over a metric space. We propose four progressive algorithms that utilize the properties of the underlying metric space to efficiently solve the problem and present an extensive, comparative evaluation on both synthetic and real-world datasets.", "paper_title": "Processing Top-k Dominating Queries in Metric Spaces", "paper_id": "WOS:000371198500003"}