{"auto_keywords": [{"score": 0.040172527689925776, "phrase": "response_time"}, {"score": 0.008713768692145006, "phrase": "multitier_applications"}, {"score": 0.008120314354827728, "phrase": "fairness_status"}, {"score": 0.006318817262049134, "phrase": "traditional_methods"}, {"score": 0.004733123544564746, "phrase": "significant_trend"}, {"score": 0.0046846932351254636, "phrase": "cloud_computing"}, {"score": 0.004434608130268514, "phrase": "fair_resources"}, {"score": 0.004197817125707719, "phrase": "best-effort_manner"}, {"score": 0.004028525144566374, "phrase": "fair_bandwidth"}, {"score": 0.003932929770322298, "phrase": "network_fairness"}, {"score": 0.003852791434660505, "phrase": "interactive_applications"}, {"score": 0.0036846952802928, "phrase": "fair_response_time"}, {"score": 0.0032009501549788576, "phrase": "adjusting_bandwidth"}, {"score": 0.002613811544872659, "phrase": "multiple_transactions"}, {"score": 0.002448631085132444, "phrase": "network_sharing"}, {"score": 0.0024069209350505933, "phrase": "applications'_characteristics"}, {"score": 0.002231657123365799, "phrase": "evaluation_results"}, {"score": 0.002201187194326849, "phrase": "authors'_mechanism"}, {"score": 0.0021341390503944358, "phrase": "performance_degradation"}, {"score": 0.0021049977753042253, "phrase": "practical_mechanisms"}], "paper_keywords": ["Cloud Computing", " Fairness", " Multitier Application", " Network", " Performance", " Response Time"], "paper_abstract": "A significant trend caused by cloud computing is to aggregate applications for sharing resources. Thus, it is necessary to provide fair resources and performance among applications, especially for the network, which is provided in the best-effort manner in current clouds. Although many studies have made efforts for provisioning fair bandwidth, they are not sufficient for network fairness. In fact, for interactive applications, response time is more sensitive than bandwidth, and users expect a fair response time not just bandwidth. In this study, the authors want to investigate whether the traditional methods of sharing bandwidth can help the fairness of response time. They show that: (1) bandwidth has little relationship to response time, and adjusting bandwidth hardly affects response time in most cases. Thus, the traditional methods cannot help the fairness of response time much; and (2) the fairness between components is different from the one between transactions, and many prior studies only consider the former while ignoring the latter. Thus, the authors cannot help much for multitier applications consisting of multiple transactions either. As a result, they construct a model with two metrics to evaluate the fairness status of the network sharing, while considering the applications' characteristics on both the response time and throughput. Based on the model, they also propose a mechanism to improve the fairness status. The evaluation results show that the authors' mechanism improves the fairness status by 26.5%-52.8%, and avoids performance degradation compared to some practical mechanisms.", "paper_title": "Fairly Sharing the Network for Multitier Applications in Clouds", "paper_id": "WOS:000370844500003"}