{"auto_keywords": [{"score": 0.02484849065787826, "phrase": "query_processing_strategies"}, {"score": 0.004668957916795845, "phrase": "high-speed_networks"}, {"score": 0.004550669123303854, "phrase": "network_technologies"}, {"score": 0.004367581653370531, "phrase": "information_exchange"}, {"score": 0.003982011128052839, "phrase": "important_problem"}, {"score": 0.003361069456060196, "phrase": "exchanged_data"}, {"score": 0.003160049822855747, "phrase": "database_technologies"}, {"score": 0.0030017207229983385, "phrase": "autonomous_peers"}, {"score": 0.0026532596852754525, "phrase": "obtained_data"}, {"score": 0.0026126405272417783, "phrase": "tracing_query"}, {"score": 0.002494466951433885, "phrase": "recursive_query"}, {"score": 0.0022047613106966745, "phrase": "ad_hoc_queries"}, {"score": 0.0021821915946356168, "phrase": "continual_queries"}], "paper_keywords": ["information exchange", " peer-to-peer networks", " traceability", " data provenance", " query processing"], "paper_abstract": "As the spread of high-speed networks and the development of network technologies. P2P technologies are actively used today for information exchange in the network. While information exchange in a P2P network is quite flexible, there is an important problem lack of reliability. Since we cannot know the details of how the data was obtained, it is hard to fully rely on it. To ensure the reliability of exchanged data, we have proposed the framework of a traceable P2P record exchange based on database technologies. In this framework, records are exchanged among autonomous peers, and each peer stores its exchange and modification histories in it. The framework supports the function of tracing queries to query the details of the obtained data. A tracing query is described in datalog and executed as a recursive query in the P2P network. In this paper, we focus on the query processing strategies for the framework. We consider two types of queries, ad hoc queries and continual queries, and present the query processing strategies for their executions.", "paper_title": "Query Processing in a Traceable P2P Record Exchange Framework", "paper_id": "WOS:000279250600013"}