{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computing_exact_confidence_intervals"}, {"score": 0.004462105963334103, "phrase": "basic_problem"}, {"score": 0.004203030435498069, "phrase": "newcombe"}, {"score": 0.0038948525410795517, "phrase": "approximate_intervals"}, {"score": 0.003831801113154043, "phrase": "asymptotic_infimum_coverage_probability"}, {"score": 0.003728966994353039, "phrase": "nominal_level"}, {"score": 0.0036288825833675127, "phrase": "large_sample"}, {"score": 0.0034742854447532678, "phrase": "exact_optimal_confidence_intervals"}, {"score": 0.0033810134162565843, "phrase": "valid_statistical_inference"}, {"score": 0.002631892325004253, "phrase": "r_package_exactcidiff"}, {"score": 0.0025334249463305875, "phrase": "sample_size"}, {"score": 0.002412204754253618, "phrase": "first_available_package"}, {"score": 0.0023346234464901978, "phrase": "exact_confidence_intervals"}], "paper_keywords": [""], "paper_abstract": "Comparing two proportions through the difference is a basic problem in statistics and has applications in many fields. More than twenty confidence intervals (Newcombe, 1998a,b) have been proposed. Most of them are approximate intervals with an asymptotic infimum coverage probability much less than the nominal level. In addition, large sample may be costly in practice. So exact optimal confidence intervals become critical for drawing valid statistical inference with accuracy and precision. Recently, Wang (2010, 2012) derived the exact smallest (optimal) one-sided 1 - alpha confidence intervals for the difference of two paired or independent proportions. His intervals, however, are computer-intensive by nature. In this article, we provide an R package ExactCIdiff to implement the intervals when the sample size is not large. This would be the first available package in R to calculate the exact confidence intervals for the difference of proportions. Exact two-sided 1 - alpha interval can be easily obtained by taking the intersection of the lower and upper one-sided 1 - alpha/2 intervals. Readers may jump to Examples 1 and 2 to obtain these intervals.", "paper_title": "ExactCIdiff: An R Package for Computing Exact Confidence Intervals for the Difference of Two Proportions", "paper_id": "WOS:000330193300007"}