{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "milp"}, {"score": 0.010487380565730755, "phrase": "resource-constrained_project_scheduling_problems"}, {"score": 0.008918479050950353, "phrase": "time_horizon"}, {"score": 0.008778474316227716, "phrase": "milp_formulations"}, {"score": 0.00867490405927002, "phrase": "rcpsp"}, {"score": 0.004609094651134046, "phrase": "comparative_study"}, {"score": 0.004091130285858113, "phrase": "traditional_discretization"}, {"score": 0.0032355864829403413, "phrase": "better_capacity"}, {"score": 0.0027594936602962075, "phrase": "recent_rcpsp-specific_exact_method"}, {"score": 0.002662393295121998, "phrase": "exact_solving"}, {"score": 0.0026307897899760383, "phrase": "milp_formulation_class"}, {"score": 0.002429451930463481, "phrase": "hard_instances"}, {"score": 0.0023532890136269986, "phrase": "hard_\"highly_cumulative\"_rcpsp_instances"}, {"score": 0.0021559025985688255, "phrase": "specialized_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Resource-constrained project scheduling", " Mixed integer linear programming", " Project management"], "paper_abstract": "In this paper we make a comparative study of several mixed integer linear programming (MILP) formulations for resource-constrained project scheduling problems (RCPSPs). First, we present three discrete and continuous time MILP formulations issued from the literature. Second, instead of relying on the traditional discretization of the time horizon, we propose MILP formulations for the RCPSP based on the concept of event: the Start/End formulation and the On/Off formulation. These formulations present the advantage of involving fewer variables than the formulations indexed by time. Because the variables of this type of formulations are not function of the time horizon, we have a better capacity to deal with instances of very large scheduling horizon. Finally, we illustrate our contribution with a series of tests on various types of instance with the MILP formulations issued from the literature, together with our new formulations. We also compare our results with a recent RCPSP-specific exact method. We show that, in terms of exact solving, no MILP formulation class dominates the other ones and that a state-of-the art specialized (non-MILP) method for the RCPSP is even outperformed by MILP on a set of hard instances. Furthermore, on another set of hard \"highly cumulative\" RCPSP instances with a high processing time range, our On/Off formulation outperforms all the others MILP formulations and obtains results close to the ones of the specialized method. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Event-based MILP models for resource-constrained project scheduling problems", "paper_id": "WOS:000282529100002"}