{"auto_keywords": [{"score": 0.03773458804053222, "phrase": "project_objectives"}, {"score": 0.00481495049065317, "phrase": "health_care_costs"}, {"score": 0.0042928648367867835, "phrase": "multidisciplinary_team"}, {"score": 0.004068907083697369, "phrase": "pragmatic_and_actionable_analytics_framework"}, {"score": 0.003991774582021095, "phrase": "healthcare_value"}, {"score": 0.0038862297330905836, "phrase": "relevant_prior_work"}, {"score": 0.0038418515481939463, "phrase": "value_analytics_framework"}, {"score": 0.003797978200741566, "phrase": "value_driven_outcomes"}, {"score": 0.003683407561208816, "phrase": "agile_methodology"}, {"score": 0.003545024951402821, "phrase": "implementation_timeliness"}, {"score": 0.0035179764329354877, "phrase": "system_performance"}, {"score": 0.003296212583539166, "phrase": "value_improvement"}, {"score": 0.0031845067058084583, "phrase": "clinical_care_costs"}, {"score": 0.003160200215473349, "phrase": "individual_patient_encounters"}, {"score": 0.0031002400518251936, "phrase": "labor_costs"}, {"score": 0.0030648097361278856, "phrase": "hospital_unit"}, {"score": 0.0028936226331006563, "phrase": "actual_medication_acquisition_costs"}, {"score": 0.002784828661426853, "phrase": "radiology_costs"}, {"score": 0.002690406375639144, "phrase": "study_performance"}, {"score": 0.0026698611202305715, "phrase": "relevant_process_and_outcome_measures"}, {"score": 0.0026091594819333654, "phrase": "visualization_layer"}, {"score": 0.0025596276616952516, "phrase": "value_improvement_opportunities"}, {"score": 0.002435190484324197, "phrase": "initial_implementation"}, {"score": 0.0022382002476510573, "phrase": "foundational_tool"}, {"score": 0.0022125996721544514, "phrase": "high-value_care"}], "paper_keywords": ["care value", " care quality", " care outcomes", " care costs", " activity-based cost accounting"], "paper_abstract": "Objective To develop expeditiously a pragmatic, modular, and extensible software framework for understanding and improving healthcare value (costs relative to outcomes). Materials and methods In 2012, a multidisciplinary team was assembled by the leadership of the University of Utah Health Sciences Center and charged with rapidly developing a pragmatic and actionable analytics framework for understanding and enhancing healthcare value. Based on an analysis of relevant prior work, a value analytics framework known as Value Driven Outcomes (VDO) was developed using an agile methodology. Evaluation consisted of measurement against project objectives, including implementation timeliness, system performance, completeness, accuracy, extensibility, adoption, satisfaction, and the ability to support value improvement. Results A modular, extensible framework was developed to allocate clinical care costs to individual patient encounters. For example, labor costs in a hospital unit are allocated to patients based on the hours they spent in the unit; actual medication acquisition costs are allocated to patients based on utilization; and radiology costs are allocated based on the minutes required for study performance. Relevant process and outcome measures are also available. A visualization layer facilitates the identification of value improvement opportunities, such as high-volume, high-cost case types with high variability in costs across providers. Initial implementation was completed within 6 months, and all project objectives were fulfilled. The framework has been improved iteratively and is now a foundational tool for delivering high-value care. Conclusions The framework described can be expeditiously implemented to provide a pragmatic, modular, and extensible approach to understanding and improving healthcare value.", "paper_title": "Value Driven Outcomes (VDO): a pragmatic, modular, and extensible software framework for understanding and improving health care costs and outcomes", "paper_id": "WOS:000352771100024"}