{"auto_keywords": [{"score": 0.04355159126538614, "phrase": "open_knowledge"}, {"score": 0.012553606918841415, "phrase": "teaching_staff"}, {"score": 0.006520587336288332, "phrase": "global_strategic_gamble"}, {"score": 0.005604933479067528, "phrase": "ocw-ua"}, {"score": 0.004801206061152243, "phrase": "institutional_strategy"}, {"score": 0.004746617697932655, "phrase": "open_dissemination"}, {"score": 0.004692647062494403, "phrase": "purpose_-_information"}, {"score": 0.004665891225930908, "phrase": "communication_technologies"}, {"score": 0.004599664074521038, "phrase": "people's_lives"}, {"score": 0.004547356716604537, "phrase": "changing_world_education"}, {"score": 0.004470003886903606, "phrase": "old-fashioned_models"}, {"score": 0.0041024553904726955, "phrase": "educational_environment"}, {"score": 0.003918900658052011, "phrase": "basically_passive_role"}, {"score": 0.0038965391824276594, "phrase": "standardised_teaching"}, {"score": 0.003819270233027538, "phrase": "fast_and_decisive_transformation"}, {"score": 0.003690344014465526, "phrase": "new_challenge"}, {"score": 0.0034061309156482407, "phrase": "institutional_repository"}, {"score": 0.003386685386000115, "phrase": "rua"}, {"score": 0.0032258028932822228, "phrase": "related_projects"}, {"score": 0.003189069023374276, "phrase": "consecutive_phases"}, {"score": 0.003161792525012037, "phrase": "open_publication"}, {"score": 0.0029857983525658307, "phrase": "discrete_projects"}, {"score": 0.002724300844023273, "phrase": "online_provider"}, {"score": 0.0026247093410046445, "phrase": "storage_place"}, {"score": 0.0024856483031965118, "phrase": "organisational_model"}, {"score": 0.0024085241033716736, "phrase": "rua."}, {"score": 0.002229190333606617, "phrase": "greater_acceptance"}, {"score": 0.0021415125224387914, "phrase": "successful_experience"}], "paper_keywords": ["Open systems", " Knowledge management", " Higher education", " Database management systems", " Spain"], "paper_abstract": "Purpose - Information and communication technologies have became pervasive in people's lives and in this changing world education cannot remain anchored in old-fashioned models which ignore the evolution through which society is going. This paper seeks to present the gamble made by the University of Alicante (Spain) on the promotion of open knowledge. Design/methodology/approach - The educational environment cannot continue to be fixed, closed and isolated, where students assuming a basically passive role receive standardised teaching. It must consequently experience a fast and decisive transformation which allows it, amongst other things, to respond to the new challenge posed by society: the need for all of us to share the knowledge we generate, so that further progress can be made. Findings - The Institutional Repository (RUA) and the OpenCourseWare of the University of Alicante (OCW-UA) were conceived from the very beginning as related projects that could constitute consecutive phases in the open publication of knowledge. In this way the aim of presenting the promotion of open knowledge not as a series of discrete projects but as a global strategic gamble of the institution was achieved. In addition to the most visible educational benefits, this policy has had the virtue of favouring the assumption by the University of its role as an online provider of quality (scientific and teaching) content. Originality/value - RUA is the storage place of all the teaching materials published by the University of Alicante's teaching staff, which are retrieved from OCW-UA, while OCW-UA serves as an organisational model of teaching content self-archived by the teaching staff in RUA. The connection between the projects has allowed the presentation of the promotion of open knowledge as a global strategic gamble of the University, which has contributed to a greater acceptance by the teaching staff. This work is original in that it shows a successful experience of involvement by one university and its members in the promotion of open knowledge.", "paper_title": "The University of Alicante's institutional strategy to promote the open dissemination of knowledge", "paper_id": "WOS:000282456600004"}