{"auto_keywords": [{"score": 0.02438397330041336, "phrase": "qc"}, {"score": 0.00481495049065317, "phrase": "polyconjugated_protein-binding_ligand"}, {"score": 0.004706699397060569, "phrase": "polarizable_molecular_mechanics"}, {"score": 0.004480394224548146, "phrase": "multipole_transferability"}, {"score": 0.004396267325338022, "phrase": "conformational_properties"}, {"score": 0.004346547997061901, "phrase": "potent_inhibitor"}, {"score": 0.00421668332357505, "phrase": "cancer_processes"}, {"score": 0.004184825434585617, "phrase": "macular_degeneration"}, {"score": 0.0037065115435101887, "phrase": "conjugated_bonds"}, {"score": 0.00362308996613223, "phrase": "sibfa_polarizable_molecular_mechanics_procedure"}, {"score": 0.0035685175471526823, "phrase": "docking_simulations"}, {"score": 0.0034226302212225206, "phrase": "ligand_conformational_energy"}, {"score": 0.0032209766681045365, "phrase": "initio_quantum_chemistry"}, {"score": 0.002951673109860487, "phrase": "independent_stepwise_variations"}, {"score": 0.002896167001212006, "phrase": "six_main-chain_torsion_angles"}, {"score": 0.0027254466299651936, "phrase": "single-point_qc_calculations"}, {"score": 0.002613935123129054, "phrase": "delta_e-conf"}, {"score": 0.0025843206540392184, "phrase": "sibfa_ones"}, {"score": 0.002305974875400655, "phrase": "best_agreement"}, {"score": 0.002203200914130907, "phrase": "mutual_polarization_energy_e-pol"}, {"score": 0.0021049977753042253, "phrase": "critical_role"}], "paper_keywords": ["Polarizable force fields", " Multipoles", " Conjugation"], "paper_abstract": "We investigate the conformational properties of a potent inhibitor of neuropilin-1, a protein involved in cancer processes and macular degeneration. This inhibitor consists of four aromatic/conjugated fragments: a benzimidazole, a methylbenzene, a carboxythiourea, and a benzene-linker dioxane, and these fragments are all linked together by conjugated bonds. The calculations use the SIBFA polarizable molecular mechanics procedure. Prior to docking simulations, it is essential to ensure that variations in the ligand conformational energy upon rotations around its six main-chain torsional bonds are correctly represented (as compared to high-level ab initio quantum chemistry, QC). This is done in two successive calibration stages and one validation stage. In the latter, the minima identified following independent stepwise variations of each of the six main-chain torsion angles are used as starting points for energy minimization of all the torsion angles simultaneously. Single-point QC calculations of the minimized structures are then done to compare their relative energies Delta E-conf to the SIBFA ones. We compare three different methods of deriving the multipoles and polarizabilities of the central, most critical moiety of the inhibitor: carboxythiourea (CTU). The representation that gives the best agreement with QC is the one that includes the effects of the mutual polarization energy E-pol between the amide and thioamide moieties. This again highlights the critical role of this contribution. The implications and perspectives of these findings are discussed.", "paper_title": "Conformational analysis of a polyconjugated protein-binding ligand by joint quantum chemistry and polarizable molecular mechanics. Addressing the issues of anisotropy, conjugation, polarization, and multipole transferability", "paper_id": "WOS:000349080300001"}