{"auto_keywords": [{"score": 0.03698689032046005, "phrase": "context-aware_systems"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_sensor-cloudlets"}, {"score": 0.004751470337792407, "phrase": "programming_compositions_of_context-aware_systems"}, {"score": 0.004657808551825796, "phrase": "widespread_use"}, {"score": 0.0046269981365987915, "phrase": "sensor_and_networking_technologies"}, {"score": 0.004581162468419365, "phrase": "ubiquitous_sensors"}, {"score": 0.004505771917193233, "phrase": "daily_life"}, {"score": 0.0044169318855693356, "phrase": "context-aware_pervasive_computing"}, {"score": 0.00430118556814906, "phrase": "context_modelling"}, {"score": 0.0041469500929423595, "phrase": "cloud_computing_model"}, {"score": 0.003728885511755734, "phrase": "use_model"}, {"score": 0.003595097948724078, "phrase": "available_resources"}, {"score": 0.003308557560574077, "phrase": "current_trends"}, {"score": 0.003286642683771891, "phrase": "key_issues"}, {"score": 0.0031581587465429593, "phrase": "key_contribution"}, {"score": 0.0030447855364295015, "phrase": "abstract_model"}, {"score": 0.002801983400946225, "phrase": "programming_language"}, {"score": 0.002710358243468008, "phrase": "logic_programming_language"}, {"score": 0.0026480044868438875, "phrase": "numerous_examples"}, {"score": 0.0023886223145816376, "phrase": "well-defined_semantics"}, {"score": 0.00234142781099973, "phrase": "meta-level_control_operators"}, {"score": 0.0022423402528961144, "phrase": "service-based_interface"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Composition operators", " Context-aware pervasive systems", " Sensor-cloudlets", " Context-cloudlets"], "paper_abstract": "Increasing widespread use of sensor and networking technologies are yielding ubiquitous sensors and applications that pervade daily life. At the same time, context-aware pervasive computing has experienced tremendous developments in terms of context modelling and reasoning, and applications. Such developments coupled with a cloud computing model are yielding sensor-cloudlets and context-cloudlets based on sensors and applications deployed as services that can be harnessed in applications on-demand, ad-hoc and on a pay-per-use model. Sensor-cloudlets and context-cloudlets depend on and adapt to the available resources at the time, and involve context-aware systems (including sensors) that need to be dynamically composed as needed. This paper first outlines current trends and key issues and challenges in sensor-cloudlets and context-cloudlets. We then present a key contribution of this paper, which is an application of an abstract model of context-aware systems for specifying compositions of context-aware systems used in sensor-cloudlets and context-cloudlets. We show how expressions in our formalism can be embedded into a programming language (which we show via an example extending the logic programming language Prolog). We then present numerous examples illustrating applications expressed in our extended Prolog language. We also show how compositions specified in our formalism supports estimating the reliability and cost of using such compositions of resources in computations, in a well-defined semantics. Finally, we describe meta-level control operators on evaluation of queries posed to compositions of resources and specify a service-based interface on context-aware systems. We conclude with issues to be tackled in the future. (C) 2011 Elsevier By. All rights reserved.", "paper_title": "Supporting ubiquitous sensor-cloudlets and context-cloudlets: Programming compositions of context-aware systems for mobile users", "paper_id": "WOS:000300761700001"}