{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cost-sensitive_neural_network_classifiers"}, {"score": 0.0042734067085669885, "phrase": "reasonable_setting"}, {"score": 0.0035806300393050926, "phrase": "class_imbalance_problem"}, {"score": 0.00354909279546064, "phrase": "postcode_recognition"}, {"score": 0.0032342101452939977, "phrase": "training_neural_networks"}, {"score": 0.003121719509312159, "phrase": "training_data"}, {"score": 0.002807118943000936, "phrase": "training_phase"}, {"score": 0.002733539375462443, "phrase": "training_algorithms"}, {"score": 0.002697474061842142, "phrase": "neural_network"}, {"score": 0.002592100731070259, "phrase": "probability_estimations"}, {"score": 0.0025692477422626678, "phrase": "expensive_classes"}, {"score": 0.0025018875576502606, "phrase": "higher_costs"}, {"score": 0.002404136142279618, "phrase": "five_cost_matrices"}, {"score": 0.0022595974985992664, "phrase": "cost-sensitive_learning"}, {"score": 0.0022101055924375725, "phrase": "class_imbalanced_postcode_analysis"}, {"score": 0.0021049977753042253, "phrase": "proper_cost_matrix"}], "paper_keywords": ["Cost-sensitive", " class imbalance", " cost-sampling", " cost-convergence", " rate-adapting", " threshold-moving", " neural network classifiers", " postcode recognition"], "paper_abstract": "Most traditional postcode recognition systems implicitly assumed that the distribution of the 10 numerals (0 - 9) is balanced. However it is far from a reasonable setting because the distribution of 0 - 9 in postcodes of a country or a city is generally imbalanced. Some numerals appear in more postcodes, while some others do not. In this paper, we study cost-sensitive neural network classifiers to address the class imbalance problem in postcode recognition. Four methods, namely: cost-sampling, cost-convergence, rate-adapting and threshold-moving are considered in training neural networks. Cost-sampling adjusts the distribution of the training data such that the costs of classes are conveyed explicitly by the appearances of their instances. Cost-convergence and rate-adapting are carried out in training phase by modifying the architecture of training algorithms of the neural network. Threshold-moving tries to increase the probability estimations of expensive classes to avoid the samples with higher costs to be misclassified. 10,702 postcode images are experimented using five cost matrices based on the distribution of numerals in postcodes. The results suggest that cost-sensitive learning is indeed effective on class imbalanced postcode analysis and recognition. It also reveals that cost-sampling on a proper cost matrix outperforms others in this application.", "paper_title": "COST-SENSITIVE NEURAL NETWORK CLASSIFIERS FOR POSTCODE RECOGNITION", "paper_id": "WOS:000314402300006"}