{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_impairments"}, {"score": 0.008561767440538534, "phrase": "different_environmental_characteristics"}, {"score": 0.004764542405129454, "phrase": "haptically_enhanced_virtual_environments"}, {"score": 0.004665296491645837, "phrase": "powerful_interaction_technology"}, {"score": 0.004568108391981922, "phrase": "virtual_environments"}, {"score": 0.0040047396607954325, "phrase": "empirical_experiment"}, {"score": 0.0035477930970463432, "phrase": "task_performance"}, {"score": 0.0029657683623403085, "phrase": "wayfinding_task"}, {"score": 0.00291923164591297, "phrase": "desktop-based_haptically_enhanced_ve."}, {"score": 0.0026270572353632297, "phrase": "significant_role"}, {"score": 0.0025722202862084186, "phrase": "completion_time"}, {"score": 0.0025052769325080255, "phrase": "layout_type"}, {"score": 0.002440071551819324, "phrase": "user's_behavioral_pattern"}, {"score": 0.0023025177990160487, "phrase": "task_difficulty"}, {"score": 0.0021498955164659145, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "haptically_enhanced_ves"}], "paper_keywords": [""], "paper_abstract": "As a powerful interaction technology, haptically enhanced virtual environments (VEs) have found many useful applications. However, few studies have examined how wayfinding of users with visual impairments is affected by VE characteristics. An empirical experiment was conducted to investigate how different environmental characteristics (number of objects inside the environment, layout of the objects and density) affect task performance (completion time, completion ratio, and travel distance), perceived task difficulty, and behavior pattern (short and long pause) of users with visual impairments when they perform a wayfinding task in a desktop-based haptically enhanced VE. The present study found that the number of objects inside the environment and layout of the objects play a significant role in determining the completion time and distance traveled. Layout type also greatly affected the user's behavioral pattern in terms of frequency of pauses. Finally, perceived task difficulty varied with different environmental characteristics. The study results should provide insight into the future research and development of haptically enhanced VEs for people with visual impairments.", "paper_title": "Wayfinding of Users With Visual Impairments in Haptically Enhanced Virtual Environments", "paper_id": "WOS:000352320200005"}