{"auto_keywords": [{"score": 0.04251153857508317, "phrase": "suffix_trees"}, {"score": 0.0370524624129902, "phrase": "geometric_suffix_tree"}, {"score": 0.004775918707955445, "phrase": "protein_structure_analysis"}, {"score": 0.00462291551375938, "phrase": "post-genomic_era"}, {"score": 0.004566805735863274, "phrase": "faster_and_more_accurate_query_data_structures"}, {"score": 0.004261419841494814, "phrase": "new_data_structure"}, {"score": 0.003447932289587852, "phrase": "protein_structures"}, {"score": 0.0032700071110068323, "phrase": "square_deviations"}, {"score": 0.0031780228058373235, "phrase": "vector_root"}, {"score": 0.0026452734009203764, "phrase": "construction_algorithm"}, {"score": 0.002581324549141829, "phrase": "naive_algorithm"}, {"score": 0.0024480094603893175, "phrase": "efficient_search_algorithm"}, {"score": 0.002398583143633569, "phrase": "computational_experiments"}, {"score": 0.002274684393868218, "phrase": "construction_time"}, {"score": 0.0021049977753042253, "phrase": "protein_structure_database"}], "paper_keywords": [""], "paper_abstract": "Protein structure analysis is one of the most important research issues in the post-genomic era, and faster and more accurate query data structures for such 3-D structures are highly desired for research on proteins. This paper proposes a new data structure for indexing protein 3-D structures. For strings, there are many efficient indexing structures such as suffix trees, but it has been considered very difficult to design such sophisticated data structures against 3-D structures like proteins. Our index structure is based on the suffix trees and is called the geometric suffix tree. By using the geometric suffix tree for a set of protein structures, we can search for all of their substructures whose RMSDs (root mean square deviations) or URMSDs (unit-vector root mean square deviations) to a given query 3-D structure are not larger than a given bound. Though there are O(N-2) substructures, our data structure requires only O(N) space where N is the sum of lengths of the set of proteins. We propose an O(N-2) construction algorithm for it, while a naive algorithm would require O(N-3) time to construct it. Moreover we propose an efficient search algorithm. We also show computational experiments to demonstrate the practicality of our data structure. The experiments show that the construction time of the geometric suffix tree is practically almost linear to the size of the database, when applied to a protein structure database.", "paper_title": "Geometric suffix tree: A new index structure for protein 3-D structures", "paper_id": "WOS:000239421700009"}