{"auto_keywords": [{"score": 0.0481491129380686, "phrase": "descriptive_sensory_analysis"}, {"score": 0.047635279485009674, "phrase": "three-way_data"}, {"score": 0.041862561203419274, "phrase": "sensory_characteristics"}, {"score": 0.03867062669566473, "phrase": "multiplicative_assessor_model"}, {"score": 0.03784144720028532, "phrase": "different_usage"}, {"score": 0.03716353637439735, "phrase": "multivariate_generalization"}, {"score": 0.00481495049065317, "phrase": "three-way_factor_analysis_methods"}, {"score": 0.004725787037228084, "phrase": "multiplicative_effects"}, {"score": 0.004690583510896564, "phrase": "sensory_panel_data"}, {"score": 0.003876010646939676, "phrase": "individual_differences"}, {"score": 0.003226513431715486, "phrase": "existing_structure"}, {"score": 0.003178550413662537, "phrase": "sensory_descriptors"}, {"score": 0.0031430451507177388, "phrase": "multivariate_assessor_model"}, {"score": 0.002982511360424684, "phrase": "proposed_model"}, {"score": 0.0029381648092259064, "phrase": "parallel_factor_analysis"}, {"score": 0.002788066194685293, "phrase": "john_wiley"}, {"score": 0.0021208409200030396, "phrase": "parafac"}, {"score": 0.002105011882358329, "phrase": "anova"}], "paper_keywords": ["descriptive sensory analysis", " scaling effects", " assessor model", " three-way analysis"], "paper_abstract": "Data from descriptive sensory analysis are essentially three-way data with assessors, samples and attributes as the three ways in the data set. Because of this, there are several ways that the data can be analysed. The paper focuses on the analysis of sensory characteristics of products while taking into account the individual differences among assessors. In particular, we will be interested in considering the multiplicative assessor model, which explicitly models the different usage of scale. A multivariate generalization of the model will be proposed, which allows to analyse the differences in the use of the scale with reference to the existing structure of relationships between sensory descriptors. The multivariate assessor model will be tested on a data set from milk. Relations between the proposed model and other multiplicative models like parallel factor analysis and analysis of variance will be clarified. Copyright (c) 2014 John Wiley & Sons, Ltd. Data from descriptive sensory analysis are essentially three-way data with assessors, samples and attributes as the three ways. The paper focuses on the analysis of sensory characteristics of products while taking into account the differences among assessors. In particular, we will be interested in considering the multiplicative assessor model, which explicitly models the different usage of scale. A multivariate generalization of the model will be proposed and its relations with other multiplicative models like PARAFAC and ANOVA will be clarified.", "paper_title": "Combining analysis of variance and three-way factor analysis methods for studying additive and multiplicative effects in sensory panel data", "paper_id": "WOS:000348517300005"}