{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "security_protocols"}, {"score": 0.005584430049878185, "phrase": "privacy_properties"}, {"score": 0.004469731505377507, "phrase": "formal_definitions"}, {"score": 0.0043855558432784065, "phrase": "proverif"}, {"score": 0.004338530700605384, "phrase": "avispa."}, {"score": 0.0042459818200777846, "phrase": "intruder's_ability"}, {"score": 0.003853251284913932, "phrase": "existing_tools"}, {"score": 0.0038119123317396954, "phrase": "secrecy_and_authentication_properties"}, {"score": 0.0037614138648679996, "phrase": "seve_module"}, {"score": 0.0037038224217016817, "phrase": "receipt_freeness"}, {"score": 0.0036640806940633373, "phrase": "coercion_resistance"}, {"score": 0.0035346515636097533, "phrase": "electronic_voting_systems"}, {"score": 0.003509317669345521, "phrase": "anonymous_online_transactions"}, {"score": 0.0033249931673591457, "phrase": "labeled_transition_system"}, {"score": 0.0032774911048411804, "phrase": "semantics_model"}, {"score": 0.002931569771634119, "phrase": "trace_equivalence"}, {"score": 0.002910545717767559, "phrase": "knowledge_reasoning"}, {"score": 0.0026889720516076205, "phrase": "verification_algorithms"}, {"score": 0.002387758958649797, "phrase": "experimental_results"}, {"score": 0.002262209824105154, "phrase": "state-of-the-art_security_verifiers"}, {"score": 0.002143247921132179, "phrase": "automatic_verifier"}, {"score": 0.0021049977753042253, "phrase": "privacy_type"}], "paper_keywords": ["security protocols", " model checking", " process analysis toolkit (PAT)", " authentication", " secrecy", " privacy"], "paper_abstract": "Security protocols play more and more important roles with wide use in many applications nowadays. Currently, there are many tools for specifying and verifying security protocols such as Casper/FDR, ProVerif, or AVISPA. In these tools, the intruder's ability, which either needs to be specified explicitly or set by default, is not flexible in some circumstances. Moreover, whereas most of the existing tools focus on secrecy and authentication properties, few supports privacy properties like anonymity, receipt freeness, and coercion resistance, which are crucial in many applications such as in electronic voting systems or anonymous online transactions. In this paper, we introduce a framework for specifying security protocols in the labeled transition system (LTS) semantics model, which embeds the knowledge of the participants and parameterizes the ability of an attacker. Using this model, we give the formal definitions for three types of privacy properties based on trace equivalence and knowledge reasoning. The formal definitions for some other security properties, such as secrecy and authentication, are introduced under this framework, and the verification algorithms are also given. The results of this paper are embodied in the implementation of a SeVe module in a process analysis toolkit (PAT) model checker, which supports specifying, simulating, and verifying security protocols. The experimental results show that a SeVe module is capable of verifying many types of security protocols and complements the state-of-the-art security verifiers in several aspects. Moreover, it also proves the ability in building an automatic verifier for security protocols related to privacy type, which are mostly verified by hand now.", "paper_title": "SeVe: automatic tool for verification of security protocols", "paper_id": "WOS:000299768800005"}