{"auto_keywords": [{"score": 0.049165088273860263, "phrase": "health_it"}, {"score": 0.00481495049065317, "phrase": "atlantic_cooperation"}, {"score": 0.004775335634705251, "phrase": "international_challenges"}, {"score": 0.004749107514876029, "phrase": "ehealth"}, {"score": 0.004658426838467567, "phrase": "common_goal"}, {"score": 0.004494570360108983, "phrase": "health_information"}, {"score": 0.004420891955499197, "phrase": "ehealth_challenges"}, {"score": 0.004372442291178139, "phrase": "european_union-united_states_of_america_conference"}, {"score": 0.004207071538245039, "phrase": "paris"}, {"score": 0.004184043125046785, "phrase": "france"}, {"score": 0.0036251983768532925, "phrase": "plenary_sessions"}, {"score": 0.0035657203308982065, "phrase": "key_findings"}, {"score": 0.0033465923623290034, "phrase": "key_elements"}, {"score": 0.0033190180867511605, "phrase": "patient_identification_management_framework"}, {"score": 0.003132236287543072, "phrase": "common_or_compatible_standards"}, {"score": 0.003021899371820458, "phrase": "shared_certification_criteria"}, {"score": 0.0029559346879594254, "phrase": "greater_awareness"}, {"score": 0.002318566141177149, "phrase": "highest_priority"}, {"score": 0.002218376741764432, "phrase": "effective_strategies"}, {"score": 0.002200077887697072, "phrase": "healthcare_professionals'_acceptance"}, {"score": 0.0021879624017959493, "phrase": "health_it_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["International cooperation", " Information systems"], "paper_abstract": "Purpose: Countries on both sides of the Atlantic Ocean have invested in health information and communication technologies. Since eHealth challenges cross borders a European Union-United States of America conference on public policies relating to health IT and eHealth was held October 20-21, 2008 in Paris, France. Process: The conference was organized around the four themes: ( 1) privacy and security, ( 2) health IT interoperability, ( 3) deployment and adoption of health IT, and ( 4) Public Private Collaborative Governance. The four key themes framed the discussion over the two days of plenary sessions and workshops. Results: Key findings of the conference were organized along the four themes. ( 1) Privacy and security: Patients' access to their own data and key elements of a patient identification management framework were discussed. ( 2) Health IT interoperability: Three significant and common interoperability challenges emerged: ( a) the need to establish common or compatible standards and clear guidelines for their implementation, (b) the desirability for shared certification criteria and ( c) the need for greater awareness of the importance of interoperability. ( 3) Deployment and adoption of health IT: Three major areas of need emerged: ( a) a shared knowledge base and assessment framework, ( b) public-private collaboration and ( c) and effective organizational change strategies. ( 4) Public Private Collaborative Governance: Sharing and communication are central to success in this area. Nations can learn from one another about ways to develop harmonious, effective partnerships. Conclusions: Three areas that were identified as highest priority for collaboration included: ( 1) health data security, ( 2) developing effective strategies to ensure healthcare professionals' acceptance of health IT tools, and ( 3) interoperability. (C) 2009 Published by Elsevier Ireland Ltd.", "paper_title": "Across the Atlantic cooperation to address international challenges in eHealth and health IT: Managing toward a common goal", "paper_id": "WOS:000272036000007"}