{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "context-aware_flowable_services"}, {"score": 0.04129099571761686, "phrase": "circumjacent_services"}, {"score": 0.004573842508130535, "phrase": "promising_way"}, {"score": 0.004216434794603139, "phrase": "metaphoric_concept"}, {"score": 0.0040223714916651845, "phrase": "logical_stream"}, {"score": 0.0033026956021014204, "phrase": "flowable_services"}, {"score": 0.003218823621926739, "phrase": "seamless_integration"}, {"score": 0.00319134078848996, "phrase": "diverse_services"}, {"score": 0.0030837288356760973, "phrase": "maximum_satisfaction"}, {"score": 0.003044313656896057, "phrase": "service_providers"}, {"score": 0.00296698375549856, "phrase": "delivery_cost"}, {"score": 0.0028060889647071787, "phrase": "individual's_context"}, {"score": 0.0027702126237754625, "phrase": "smooth_and_accurate_provision"}, {"score": 0.0026767629720554397, "phrase": "human-centric_framework"}, {"score": 0.002597577409911978, "phrase": "users'_contexts"}, {"score": 0.002553382046204689, "phrase": "pro-active_support"}, {"score": 0.0024884913795612707, "phrase": "flexible_and_natural_way"}, {"score": 0.002244969789802093, "phrase": "ambient_service_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Flowable services", " Context-aware", " Human-centric", " Service integration"], "paper_abstract": "Services are expected to be a promising way for people to use information and computing resources in our emerging ubiquitous network society and cloud computing environments. In this study, we propose a metaphoric concept called a flowable service. It is defined as a logical stream that organizes and provides circumjacent services in such a way that they are perceived by individuals to be naturally embedded in their surrounding environments. We present our view on how some of these problems, such as the flexibility, portability and interoperability of services, can be solved using flowable services in order to provide a seamless integration of diverse services in the most intuitive \"flowable\" way possible, thus achieving maximum satisfaction for both service providers and consumers while decreasing the delivery cost of the services. Recognizing the importance of the awareness of each individual's context for a smooth and accurate provision of services, we further propose a human-centric framework for context-aware flowable services, which harnesses the users' contexts to enable a pro-active support of human activities in a flexible and natural way. Owing to context-awareness, this framework can find and integrate circumjacent services that are considered needed by each individual and can create an ambient service environment that is tailored to his/her specific needs, proclivities and characteristics. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A human-centric framework for context-aware flowable services in cloud computing environments", "paper_id": "WOS:000329003200017"}