{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "assisted_living_facilities"}, {"score": 0.004544629724830453, "phrase": "research_activities"}, {"score": 0.004466519142879166, "phrase": "healthcare_support_systems"}, {"score": 0.0034832884999421374, "phrase": "specific_systems"}, {"score": 0.00265373679629359, "phrase": "alf_inhabitants"}, {"score": 0.0025631294247072476, "phrase": "managing_notes"}, {"score": 0.0025044454602720597, "phrase": "daily_activities"}, {"score": 0.002461313735611462, "phrase": "design_guidelines"}, {"score": 0.0024049552650867935, "phrase": "qualitative_analysis"}, {"score": 0.002363532907211947, "phrase": "comprehensive_user_study"}, {"score": 0.0022960713730673494, "phrase": "northern_italy"}, {"score": 0.0021049977753042253, "phrase": "physical_and_cognitive_disabilities"}], "paper_keywords": ["Assisted living facilities", " Healthcare support system", " Design guidelines", " Focus groups", " Caregivers", " Persons with disabilities"], "paper_abstract": "Research activities on designing healthcare support systems in the field of ambient assisted living are mainly focused on addressing two problems: improving the quality of life for people in their own homes, especially the elderly; and supporting nurses and physicians in hospitals. However, few papers focus on designing specific systems for supporting caregivers that work with persons with disabilities in the context of assisted living facilities (ALFs). This paper intends to contribute to filling this gap and presents a series of guidelines for designing systems that could effectively support caregivers in tasks such as monitoring ALF inhabitants, attending to their assistance requests and managing notes and reminders regarding daily activities. These design guidelines derive from the qualitative analysis of a comprehensive user study, carried out in Northern Italy, of three focus groups conducted with a total of 30 caregivers in three different ALFs for persons with physical and cognitive disabilities.", "paper_title": "Supporting caregivers in assisted living facilities for persons with disabilities: a user study", "paper_id": "WOS:000350366500011"}