{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_context"}, {"score": 0.0045726187330434025, "phrase": "software_system"}, {"score": 0.0037381083634085424, "phrase": "software_engineering"}, {"score": 0.003405948098114941, "phrase": "analytical_tools"}, {"score": 0.0032176163279340206, "phrase": "collaborative_work"}, {"score": 0.0031845067058084583, "phrase": "requirements_engineers"}, {"score": 0.0030554300179552415, "phrase": "social_practitioners"}, {"score": 0.0025230952890994236, "phrase": "socio-psychological_activity_theory"}, {"score": 0.0024586427394152196, "phrase": "human_contexts"}, {"score": 0.0023711591828229736, "phrase": "social_properties"}, {"score": 0.0021714122348552747, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "new_system"}], "paper_keywords": ["Software psychology", " Elicitation methods", " Human context", " Activity Theory", " Activity Checklist", " Conflicts"], "paper_abstract": "The human context within which a software system will operate is fundamental for its requirements. It may not appear to be very much related to the system, but it is very relevant in achieving its successful adoption. However, requirements engineers have usually a background in Software Engineering and are not trained to elicit this kind of information. This situation raises the need for analytical tools to deal with these features. These tools should enable collaborative work between requirements engineers, who use them in development, social practitioners, who provide the knowledge and processes underlying these tools, and the customers, who know the domain and intended application of the projects. The framework presented in this paper is based on the socio-psychological Activity Theory and its analysis of human contexts. It includes a repository of social properties and a process to perform this elicitation using it. The paper illustrates its application through a case study on the impact of a new system in the organization of a firm.", "paper_title": "Understanding the human context in requirements elicitation", "paper_id": "WOS:000281734700001"}