{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mass_spectrometry"}, {"score": 0.004329630571352367, "phrase": "large_numbers"}, {"score": 0.004228577663320847, "phrase": "complex_biological_samples"}, {"score": 0.003562912424153324, "phrase": "data_analysis"}, {"score": 0.0033190180867511605, "phrase": "uni-_and_multivariate_statistical_analyses"}, {"score": 0.0031100973266506163, "phrase": "mass_spectra"}, {"score": 0.0027796495180095657, "phrase": "bioanalytical_community"}, {"score": 0.0026355812883224203, "phrase": "extensive_manually_well-annotated_database"}, {"score": 0.0026045914281028473, "phrase": "currently_known_small_molecule_contaminants"}, {"score": 0.0023415390666563177, "phrase": "major_browsers"}, {"score": 0.002273292707863821, "phrase": "maconda_web_service"}, {"score": 0.002155412043665635, "phrase": "supplementary_data"}, {"score": 0.0021050918136607407, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Mass spectrometry is widely used in bioanalysis, including the fields of metabolomics and proteomics, to simultaneously measure large numbers of molecules in complex biological samples. Contaminants routinely occur within these samples, for example, originating from the solvents or plasticware. Identification of these contaminants is crucial to enable their removal before data analysis, in particular to maintain the validity of conclusions drawn from uni- and multivariate statistical analyses. Although efforts have been made to report contaminants within mass spectra, this information is fragmented and its accessibility is relatively limited. In response to the needs of the bioanalytical community, here we report the creation of an extensive manually well-annotated database of currently known small molecule contaminants. Availability: The Mass spectrometry Contaminants Database (MaConDa) is freely available and accessible through all major browsers or by using the MaConDa web service http://www.maconda.bham.ac.uk. Contact: m.viant@bham.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "MaConDa: a publicly accessible mass spectrometry contaminants database", "paper_id": "WOS:000310155300024"}