{"auto_keywords": [{"score": 0.03274021863411849, "phrase": "remus"}, {"score": 0.011113705182684277, "phrase": "resource_sharing"}, {"score": 0.00481495049065317, "phrase": "grid_connectivity"}, {"score": 0.004695191134024754, "phrase": "grid"}, {"score": 0.004647105813224402, "phrase": "unique_opportunities"}, {"score": 0.004600228893803583, "phrase": "high-performance_computing"}, {"score": 0.0044398358177815305, "phrase": "multiple_remote_resources"}, {"score": 0.004395040468458808, "phrase": "participating_institutions"}, {"score": 0.004306795240631196, "phrase": "virtual_organization"}, {"score": 0.004177724522109952, "phrase": "collective_resources"}, {"score": 0.0040525061916685924, "phrase": "collaborative_projects"}, {"score": 0.0038913443732432468, "phrase": "distributed_environments"}, {"score": 0.003019189898170698, "phrase": "multiplexing_system"}, {"score": 0.0025663181430010686, "phrase": "new_openings"}, {"score": 0.0023539789234610763, "phrase": "grid_applications"}, {"score": 0.0021049977753042253, "phrase": "globus_toolkit"}], "paper_keywords": ["Grids", " Grid connectivity", " Firewalls", " Networks", " Network security", " Wrappers"], "paper_abstract": "The Grid provides unique opportunities for high-performance computing through distributed applications that execute over multiple remote resources. Participating institutions can form a virtual organization to maximize the utilization of collective resources as well as to facilitate collaborative projects. However, there are two design aspects in distributed environments like the Grid that can easily clash: security and resource sharing. It may be that resources are secure but are not entirely conducive to resource sharing, or networks are wide open for resource sharing but sacrifice security as a result. We developed REMUS, a rerouting and multiplexing system that provides a compromise through connection rerouting and wrappers. REMUS reroutes connections using proxies, ports and protocols that are already authorized across firewalls, avoiding the need to make new openings through the firewalls. We also encapsulate applications within wrappers, transparently rerouting the connections among Grid applications without modifying their programs. In this paper, we describe REMUS and the tests we conducted across firewalls using two Grid middleware case studies: Globus Toolkit 2.4 and Nimrod/G 3.0.", "paper_title": "REMUS: A Rerouting and Multiplexing System for Grid Connectivity Across Firewalls", "paper_id": "WOS:000272244100002"}