{"auto_keywords": [{"score": 0.004464326432401002, "phrase": "research_development"}, {"score": 0.004298666679374568, "phrase": "total_nonlinear_dynamic_systems"}, {"score": 0.004139128578531134, "phrase": "model_parameters"}, {"score": 0.0036159990127332315, "phrase": "rational_models"}, {"score": 0.003370565320453525, "phrase": "nonlinear_autoregressive"}, {"score": 0.0031759067385562553, "phrase": "well-known_polynomial_narmax_model"}, {"score": 0.003057910095857785, "phrase": "rational_model"}, {"score": 0.002928399649340438, "phrase": "highly_complex_nonlinear_dynamic_systems"}, {"score": 0.0028348690177346448, "phrase": "extrapolatory_properties"}, {"score": 0.0027741761880779535, "phrase": "model_identification"}, {"score": 0.002613870237087035, "phrase": "polynomial_models"}, {"score": 0.002530359917257626, "phrase": "new_and_fascinating_research_trend"}, {"score": 0.0024628046987344846, "phrase": "mathematical_modelling"}, {"score": 0.002320449502337321, "phrase": "limited_research_community"}, {"score": 0.0021049977753042253, "phrase": "easily_referenced_archive"}], "paper_keywords": ["validation", " identification", " U-model and U-control", " rational (total) nonlinear dynamic systems", " nonlinear rational model set"], "paper_abstract": "This paper is a summary of the research development in the rational (total) nonlinear dynamic modelling over the last two decades. Total nonlinear dynamic systems are defined as those where the model parameters and input (controller outputs) are subject to nonlinear to the output. Previously, this class of models has been known as rational models, which is amodel that can be considered to belong to the nonlinear autoregressive moving average with exogenous input (NARMAX) model subset and is an extension of the well-known polynomial NARMAX model. The justification for using the rational model is that it provides a very concise and parsimonious representation for highly complex nonlinear dynamic systems and has excellent interpolatory and extrapolatory properties. However, model identification and controller design are much more challenging compared to the polynomial models. This has been a new and fascinating research trend in the area of mathematical modelling, control, and applications, but still within a limited research community. This paper brings several representative algorithms together, developed by the authors and their colleagues, to form an easily referenced archive for promotion of the awareness, tutorial, applications, and even further research expansion.", "paper_title": "Review of rational (total) nonlinear dynamic system modelling, identification, and control", "paper_id": "WOS:000353705500003"}