{"auto_keywords": [{"score": 0.026597672683514845, "phrase": "metamorphic_testing"}, {"score": 0.010183341095066571, "phrase": "oracle_problem"}, {"score": 0.00874971912968442, "phrase": "phylogenetic_inference_programs"}, {"score": 0.00751639142520868, "phrase": "test_inputs"}, {"score": 0.00481495049065317, "phrase": "phylogenetic_inference_programs_using_metamorphic_testing._many_phylogenetic_inference_programs"}, {"score": 0.004583878086896926, "phrase": "aligned_sequences"}, {"score": 0.004494570360108983, "phrase": "typically_dna_or_amino_acids"}, {"score": 0.004278807087784626, "phrase": "evolutionary_history"}, {"score": 0.00376488621224566, "phrase": "correct_evolutionary_history"}, {"score": 0.003445591238183763, "phrase": "non-trivial_tree"}, {"score": 0.0032800186243040663, "phrase": "often_complicated_search"}, {"score": 0.00307657476125683, "phrase": "software_testing"}, {"score": 0.002843372121209168, "phrase": "returned_tree"}, {"score": 0.002538687900036229, "phrase": "simple_software_testing_technique"}, {"score": 0.0021049977753042253, "phrase": "faulty_phylogenetic_inference_programs"}], "paper_keywords": ["Software testing", " metamorphic testing", " PHYLIP", " bioinformatics"], "paper_abstract": "Many phylogenetic inference programs are available to infer evolutionary relationships among taxa using aligned sequences of characters, typically DNA or amino acids. These programs are often used to infer the evolutionary history of species. However, in most cases it is impossible to systematically verify the correctness of the tree returned by these programs, as the correct evolutionary history is generally unknown and unknowable. In addition, it is nearly impossible to verify whether any non-trivial tree is correct in accordance to the specification of the often complicated search and scoring algorithms. This difficulty is known as the oracle problem of software testing: there is no oracle that we can use to verify the correctness of the returned tree. This makes it very challenging to test the correctness of any phylogenetic inference programs. Here, we demonstrate how to apply a simple software testing technique, called Metamorphic Testing, to alleviate the oracle problem in testing phylogenetic inference programs. We have used both real and randomly generated test inputs to evaluate the effectiveness of metamorphic testing, and found that metamorphic testing can detect failures effectively in faulty phylogenetic inference programs with both types of test inputs.", "paper_title": "VERIFICATION OF PHYLOGENETIC INFERENCE PROGRAMS USING METAMORPHIC TESTING", "paper_id": "WOS:000297096300006"}