{"auto_keywords": [{"score": 0.048566997341190715, "phrase": "cpoe"}, {"score": 0.01571971515956129, "phrase": "unintended_consequences"}, {"score": 0.009046812915793559, "phrase": "unintended_adverse_consequences"}, {"score": 0.005095342389656311, "phrase": "eight_types"}, {"score": 0.004776484866276242, "phrase": "computerized_provider_order_entry"}, {"score": 0.0045764416357655735, "phrase": "health_care_quality"}, {"score": 0.00449156625373873, "phrase": "new_problems"}, {"score": 0.004223570987311188, "phrase": "prior_research"}, {"score": 0.004068302313449334, "phrase": "cpoe_implementation"}, {"score": 0.0040465901036133975, "phrase": "u.s._hospitals"}, {"score": 0.003918719228049752, "phrase": "prior_qualitative_study"}, {"score": 0.003876996400581697, "phrase": "five_hospitals"}, {"score": 0.0037948736326503534, "phrase": "telephone_survey"}, {"score": 0.0037244390953401533, "phrase": "cpoe-related_unintended_adverse_consequences"}, {"score": 0.0036455479042507124, "phrase": "u.s."}, {"score": 0.003616378612191807, "phrase": "cpoe._measurements"}, {"score": 0.0035682984566721915, "phrase": "key_informants"}, {"score": 0.003474040683217655, "phrase": "overall_function"}, {"score": 0.003364201061591832, "phrase": "inpatient_cpoe._results"}, {"score": 0.0031045097974912138, "phrase": "system_demands"}, {"score": 0.0028724916772193535, "phrase": "hospital_representatives"}, {"score": 0.0028115863316685937, "phrase": "power_structure"}, {"score": 0.0027741761880779535, "phrase": "new_source"}, {"score": 0.0026083827931787846, "phrase": "relatively_short_length"}, {"score": 0.00245905458142094, "phrase": "work_practice"}, {"score": 0.0022268964676199292, "phrase": "one's_perspective"}, {"score": 0.0021506298189636363, "phrase": "aggressive_detection"}, {"score": 0.002127691729166987, "phrase": "adverse_unintended_consequences"}, {"score": 0.0021049977753042253, "phrase": "cpoe_success"}], "paper_keywords": [""], "paper_abstract": "Background: Computerized provider order entry (CPOE) systems can help hospitals improve health care quality, but they can also introduce new problems. The extent to which hospitals experience unintended consequences of CPOE, which include more than errors, has not been quantified in prior research. Objective: To discover the extent and importance of unintended adverse consequences related to CPOE implementation in U.S. hospitals. Design, Setting, and Participants: Building on a prior qualitative study involving fieldwork at five hospitals, we developed and then administered a telephone Survey concerning the extent and importance of CPOE-related unintended adverse consequences to representatives from 176 hospitals in the U.S. that have CPOE. Measurements: Self report by key informants of the extent and level of importance to the overall function of the hospital of eight types of unintended adverse consequences experienced by sites with inpatient CPOE. Results: We found that hospitals experienced all eight types of unintended adverse consequences, although respondents identified several they considered more important than others. Those related to new work/more work, workflow, system demands, communication, emotions, and dependence on the technology were ranked as most severe, with at least 72% of respondents ranking them as moderately to very important. Hospital representatives are less sure about shifts in the power structure and CPOE as a new source of errors. There is no relation between kinds of unintended consequences and number of years CPOE has been used. Despite the relatively short length of time most hospitals have had CPOE (median five years), it is highly infused, or embedded, within work practice at most of these sites. Conclusions: The unintended consequences of CPOE are widespread and important to those knowledgeable about CPOE in hospitals. They can be positive, negative, or both, depending on one's perspective, and they continue to exist over the duration of use. Aggressive detection and management of adverse unintended consequences is vital for CPOE success.", "paper_title": "The extent and importance of unintended consequences related to computerized provider order entry", "paper_id": "WOS:000248103000006"}