{"auto_keywords": [{"score": 0.050078337933173706, "phrase": "intentional_and_behavioral_loyalty"}, {"score": 0.04015555003324516, "phrase": "wom"}, {"score": 0.039719382461572604, "phrase": "repurchase_intention"}, {"score": 0.029637468496513764, "phrase": "purchase_frequency"}, {"score": 0.02942021862193264, "phrase": "monetary_value"}, {"score": 0.01313901133873845, "phrase": "research_model"}, {"score": 0.010415834817986254, "phrase": "switching_cost"}, {"score": 0.010222283964727767, "phrase": "intentional_loyalty"}, {"score": 0.004481868017991508, "phrase": "customers'_behavioral_loyalty"}, {"score": 0.004156012879026324, "phrase": "reasoned_action"}, {"score": 0.004109212945115815, "phrase": "recency-frequency-monetary_value_model"}, {"score": 0.003363830908814182, "phrase": "partial_least_squares"}, {"score": 0.0027428939498108746, "phrase": "relatively_small_portion"}, {"score": 0.0024487847651989128, "phrase": "low_predictability"}, {"score": 0.002340147988348115, "phrase": "e-tailing_context"}, {"score": 0.002279011030331704, "phrase": "empirical_evidence"}, {"score": 0.0022447938263410023, "phrase": "weak_relationship"}, {"score": 0.0022278779300543548, "phrase": "intentional_and_behavioral_customer_loyalty"}, {"score": 0.0021049977753042253, "phrase": "customer_relationship_management"}], "paper_keywords": ["Behavioural loyalty", " Recency-frequency-monetary value (RFM) model", " Intentional loyalty", " E-tailing"], "paper_abstract": "Purpose - The purpose of this paper is to understand what drives customers' behavioral loyalty and explore the relationship between intentional and behavioral loyalty in the context of e-tailing. Design/methodology/approach - Based on the theory of reasoned action and the recency-frequency-monetary value model, this study proposes a research model to explore the relationships among satisfaction, switching cost, intentional loyalty (i.e. word of mouth (WOM) and repurchase intention), and behavioral loyalty (i.e. purchase frequency and monetary value). Data collected from 266 respondents in the context of e-tailing are tested against the research model using a partial least squares (PLS) approach. Findings - The results indicate that both satisfaction and switching cost are positively related to intentional loyalty (i.e. WOM and repurchase intention), and that the relationship of satisfaction with intentional loyalty outweighs that of switching cost. Additionally, while repurchase intention significantly associates with purchase frequency and monetary value, a relatively small portion of the variance in both purchase frequency and monetary value are explained. More importantly, WOM is unrelated to both purchase frequency and monetary value. The insignificance of WOM and the low predictability of repurchase intention indicate that the relationship between intentional and behavioral loyalty is weak in e-tailing context. Originality/value - This study provided empirical evidence to support the weak relationship between intentional and behavioral customer loyalty in the context of e-tailing. The findings provide several important theoretical and practical implications for e-tailing customer relationship management.", "paper_title": "Exploring the relationship between intentional and behavioral loyalty in the context of e-tailing", "paper_id": "WOS:000346112300007"}