{"auto_keywords": [{"score": 0.03595291334773675, "phrase": "invisible_marker-tracking_system"}, {"score": 0.015252721767049674, "phrase": "small_animals"}, {"score": 0.013681932204244605, "phrase": "visible_markers"}, {"score": 0.011273662080060757, "phrase": "visible_marker-tracking_system"}, {"score": 0.00481495049065317, "phrase": "invisible_marker"}, {"score": 0.004771115666493521, "phrase": "marker_augmented_reality_system"}, {"score": 0.00448886315956469, "phrase": "virtual_reality"}, {"score": 0.004434439786037454, "phrase": "augmented_reality"}, {"score": 0.004301238254323321, "phrase": "suitable_tool"}, {"score": 0.004262060185430346, "phrase": "first_ar_system"}, {"score": 0.00410886951639144, "phrase": "first_system"}, {"score": 0.0038187460155038383, "phrase": "second_version"}, {"score": 0.0036926830072270076, "phrase": "technical_characteristics"}, {"score": 0.0035816821786791722, "phrase": "comparative_study"}, {"score": 0.003474006363785606, "phrase": "non-phobic_population"}, {"score": 0.0033695566513755096, "phrase": "twenty-four_participants"}, {"score": 0.0030840216056619895, "phrase": "sus_questionnaire"}, {"score": 0.0029459306440711443, "phrase": "similar_or_higher_sense"}, {"score": 0.002839910527809489, "phrase": "similar_or_higher_level"}, {"score": 0.002805422862625723, "phrase": "important_steps"}, {"score": 0.002386014719597134, "phrase": "higher_fear_levels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Augmented reality", " Invisible markers", " Phobia towards small animals"], "paper_abstract": "Phobia towards small animals has been treated using exposure in vivo and virtual reality. Recently, augmented reality (AR) has also been presented as a suitable tool. The first AR system developed for this purpose used visible markers for tracking. In this first system, the presence of visible markers warns the user of the appearance of animals. To avoid this warning, this paper presents a second version in which the markers are invisible. First, the technical characteristics of a prototype are described. Second, a comparative study of the sense of presence and anxiety in a non-phobic population using the visible marker-tracking system and the invisible marker-tracking system is presented. Twenty-four participants used the two systems. The participants were asked to rate their anxiety level (from 0 to 10) at 8 different moments. Immediately after their experience, the participants were given the SUS questionnaire to assess their subjective sense of presence. The results indicate that the invisible marker-tracking system induces a similar or higher sense of presence than the visible marker-tracking system, and it also provokes a similar or higher level of anxiety in important steps for therapy. Moreover, 83.33% of the participants reported that they did not have the same sensations/surprise using the two systems, and they scored the advantage of using the invisible marker-tracking system (IMARS) at 5.19 +/- 2.25 (on a scale from 1 to 10). However, if only the group with higher fear levels is considered, 100% of the participants reported that they did not have the same sensations/surprise with the two systems, scoring the advantage of using IMARS at 6.38 +/- 1.60 (on a scale from 1 to 10). (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study of the sense of presence and anxiety in an invisible marker versus a marker augmented reality system for the treatment of phobia towards small animals", "paper_id": "WOS:000291455100008"}