{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "constrained_mixture_models"}, {"score": 0.004722791767189843, "phrase": "relevant_subtask_learning"}, {"score": 0.004478308876320956, "phrase": "multi-task_learning"}, {"score": 0.003949377440799037, "phrase": "supplementary_data"}, {"score": 0.0033021988455635403, "phrase": "research_problem"}, {"score": 0.00320770578058916, "phrase": "\"supplementary_data"}, {"score": 0.0027741761880779535, "phrase": "logistic_regression_classifiers"}, {"score": 0.0027341763737751467, "phrase": "key_idea"}, {"score": 0.0026175952455594277, "phrase": "relevant_and_irrelevant_samples"}, {"score": 0.0025549840900344596, "phrase": "irrelevant_part"}, {"score": 0.0025181367444581993, "phrase": "sufficiently_flexible_model"}, {"score": 0.0023990982005125763, "phrase": "relevant_data"}, {"score": 0.002285674008055581, "phrase": "simple_maximum_likelihood_optimization_algorithm"}, {"score": 0.0021049977753042253, "phrase": "comparable_multi-task_learning_model"}], "paper_keywords": ["Multi-task learning", " relevant subtask learning"], "paper_abstract": "We introduce relevant subtask learning, a new learning problem which is a variant of multi-task learning. The goal is to build a classifier for a task-of-interest for which we have too few training samples. We additionally have \"supplementary data\" collected from other tasks, but it is uncertain which of these other samples are relevant, that is, which samples are classified in the same way as in the task-of-interest. The research problem is how to use the \"supplementary data\" from the other tasks to improve the classifier in the task-of-interest. We show how to solve the problem, and demonstrate the solution with logistic regression classifiers. The key idea is to model all tasks as mixtures of relevant and irrelevant samples, and model the irrelevant part with a sufficiently flexible model such that it does not distort the model of relevant data. We give two learning algorithms for the method - a simple maximum likelihood optimization algorithm and a more advanced variational Bayes inference algorithm; in both cases we show that the method works better than a comparable multi-task learning model and naive methods.", "paper_title": "Relevant subtask learning by constrained mixture models", "paper_id": "WOS:000284213700004"}