{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elementary_siphons"}, {"score": 0.0066435680116187935, "phrase": "generalized_petri_nets"}, {"score": 0.0065976892000937145, "phrase": "graph_theory"}, {"score": 0.004745645106004309, "phrase": "initial_resource"}, {"score": 0.00466684417181804, "phrase": "purpose_-_siphon-based_deadlock_control"}, {"score": 0.004445419749485783, "phrase": "computational_and_structural_complexity"}, {"score": 0.004217186136456178, "phrase": "proposed_method"}, {"score": 0.004147123642915346, "phrase": "structural_complexity"}, {"score": 0.0039778030796649416, "phrase": "strict_minimal_siphons"}, {"score": 0.003534544738350291, "phrase": "compact_set"}, {"score": 0.0033317342432676385, "phrase": "restricted_subgraphs"}, {"score": 0.003229103141223776, "phrase": "augmented_siphons"}, {"score": 0.003140524241432171, "phrase": "elementary_siphons_theory"}, {"score": 0.0028293966058473476, "phrase": "fms_example"}, {"score": 0.0026028575174452066, "phrase": "li"}, {"score": 0.0025578967205807843, "phrase": "presented_method"}, {"score": 0.0024963543716522087, "phrase": "structural_simple_liveness-enforcing_supervisor"}, {"score": 0.0024026156525362684, "phrase": "effective_method"}, {"score": 0.002241087008892355, "phrase": "dependent_siphon"}, {"score": 0.0021049977753042253, "phrase": "isomorphic_structures"}], "paper_keywords": ["Deadlock prevention", " Elementary siphon", " Flexible manufacturing system", " Petri net"], "paper_abstract": "Purpose - Siphon-based deadlock control in a flexible manufacturing system (FMS) suffers from the problems of computational and structural complexity since the number of siphons grows exponentially with respect to the size of its Petri net model. In order to reduce structural complexity of a supervisor, a set of elementary siphons derived from all strict minimal siphons (SMS) is explicitly controlled. The purpose of this paper is through fully investigating the structure of a class of generalized Petri nets, (WSPR)-P-3, to compute all SMS and a compact set of elementary siphons. Design/methodology/approach - Based on graph theory, the concepts of initial resource weighted digraphs and restricted subgraphs are proposed. Moreover, the concept of augmented siphons is proposed to extend the application of elementary siphons theory for (WSPR)-P-3. Consequently, the set of elementary siphons obtained by the proposed method is more compact and well suits for (WSPR)-P-3. Findings - In order to demonstrate the proposed method, an FMS example is presented. All SMS and elementary siphons can be derived from initial resource weighted digraphs. Compared with those obtained by the method in Li and Thou, the presented method is more effective to design a structural simple liveness-enforcing supervisor for (WSPR)-P-3. Originality/value - This work presents an effective method of computing SMS and elementary siphons for WS3PR. Monitors are added for the elementary siphons only, and the controllability of every dependent siphon is ensured by properly supervising its elementary ones. A same set of elementary siphons can be admitted by different (WSPR)-P-3 with isomorphic structures.", "paper_title": "Extraction of elementary siphons in a class of generalized Petri nets using graph theory", "paper_id": "WOS:000333868900014"}