{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_fusion"}, {"score": 0.017162480197818367, "phrase": "euclidean_distance"}, {"score": 0.010528502443614753, "phrase": "information_retrieval"}, {"score": 0.009959401532263535, "phrase": "data_fusion_methods"}, {"score": 0.006880318439460446, "phrase": "score-based_data_fusion"}, {"score": 0.006277894185079911, "phrase": "ranking-based_measures"}, {"score": 0.004237512575106522, "phrase": "favorable_conditions"}, {"score": 0.0038810583785936505, "phrase": "geometric_framework"}, {"score": 0.0038043055953253047, "phrase": "component_result"}, {"score": 0.00374399358035391, "phrase": "information_retrieval_system"}, {"score": 0.003583002730249742, "phrase": "multi-dimensional_space"}, {"score": 0.0033745298175222056, "phrase": "search_results"}, {"score": 0.0032423089921154503, "phrase": "component_results"}, {"score": 0.003178147973814818, "phrase": "geometrical_principles"}, {"score": 0.003005151718290603, "phrase": "centroid-based_data_fusion_method"}, {"score": 0.0028643622911111942, "phrase": "retrieval_evaluation"}, {"score": 0.002326464619238653, "phrase": "proposed_framework"}, {"score": 0.0022712795176156536, "phrase": "better_understanding"}, {"score": 0.0022262909736042212, "phrase": "score-based_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Database searching", " Geometric modeling", " Information retrieval", " Data fusion"], "paper_abstract": "Data fusion in information retrieval has been investigated by many researchers and a number of data fusion methods have been proposed. However, problems such as why data fusion can increase effectiveness and favorable conditions for the use of data fusion methods are poorly resolved at best. In this paper, we formally describe data fusion under a geometric framework, in which each component result returned from an information retrieval system for a given query is represented as a point in a multi-dimensional space. The Euclidean distance is the measure by. which the effectiveness and similarity of search results are judged. This allows us to explain all component results and fused results using geometrical principles. In such a framework, score-based data fusion becomes a deterministic problem. Several interesting features of the centroid-based data fusion method and the linear combination method are discussed. Nevertheless, in retrieval evaluation, ranking-based measures are the most popular. Therefore, this paper investigates the relation and correlation between the Euclidean distance and several typical ranking-based measures. We indeed find that a very strong correlation exists between these. It means that the theorems and observations obtained using the Euclidean distance remain valid when ranking-based measures are used. The proposed framework enables us to have a better understanding of score-based data fusion and use score-based data fusion methods more precisely and effectively in various ways. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A geometric framework for data fusion in information retrieval", "paper_id": "WOS:000351971000002"}