{"auto_keywords": [{"score": 0.044492641516457515, "phrase": "lo"}, {"score": 0.03143669145421792, "phrase": "adaptive_learning_object"}, {"score": 0.02342130795332013, "phrase": "learning_objects"}, {"score": 0.00481495049065317, "phrase": "adaptive_learning_object_recommendation"}, {"score": 0.004704699244406775, "phrase": "personal_understanding"}, {"score": 0.004650519511749445, "phrase": "\"good_teaching"}, {"score": 0.004109865377936045, "phrase": "study_use"}, {"score": 0.0036178264212372497, "phrase": "e-learning_systems"}, {"score": 0.0035899674590142653, "phrase": "personalized_learning_mechanisms"}, {"score": 0.0035076666315744525, "phrase": "web-based_learning"}, {"score": 0.0034405207528624983, "phrase": "learning_paths"}, {"score": 0.003284550970221379, "phrase": "learner_attributes"}, {"score": 0.0028798723050615788, "phrase": "object_attributes"}, {"score": 0.0027599042621376624, "phrase": "ant_colony"}, {"score": 0.002382541887825168, "phrase": "attribute-based_search_mechanism"}, {"score": 0.0023550410480905727, "phrase": "adaptive_learning_objects"}, {"score": 0.0022222152430170254, "phrase": "different_attributes"}, {"score": 0.0021628142746829187, "phrase": "higher_probability"}], "paper_keywords": ["Adaptive learning", " Ant colony optimization", " Learning style"], "paper_abstract": "Teachers usually have a personal understanding of what \"good teaching\" means, and as a result of their experience and educationally related domain knowledge, many of them create learning objects (LO) and put them oil the web for study use. In fact, most students cannot find the most suitable LO (e.g. learning materials, learning assets, or learning packages) from webs. Consequently, many researchers have focused on developing e-learning systems with personalized learning mechanisms to assist on-line web-based learning and to adaptively provide learning paths. However, although most personalized learning mechanism systems neglect to consider the relationship between learner attributes (e.g. learning style, domain knowledge) and LO's attributes. Thus, it is not easy for a learner to find all adaptive learning object that reflects his own attributes in relationship to learning object attributes. Therefore, in this paper, based on an ant colony optimization (ACO) algorithm, we proposed an attributes-based ant colony system (AACS) to help learners find an adaptive learning object more effectively. Our paper makes three critical contributions: (1) It presents an attribute-based search mechanism to find adaptive learning objects effectively; (2) An attributes-ant algorithm was proposed; (3) An adaptive learning rule was developed to identify how learners with different attributes may locate learning objects which have a higher probability of being useful and suitable; (4) A web-based learning portal was created for learners to find the learning objects more effectively. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An attribute-based ant colony system for adaptive learning object recommendation", "paper_id": "WOS:000262178100047"}