{"auto_keywords": [{"score": 0.0481212980650811, "phrase": "measurement_errors"}, {"score": 0.010052868556278627, "phrase": "process_performance"}, {"score": 0.007439997479172523, "phrase": "gauge_measurement_errors"}, {"score": 0.00481495049065317, "phrase": "taguchi_capability_index"}, {"score": 0.004429388453288922, "phrase": "process_capability_analysis"}, {"score": 0.004150455625072198, "phrase": "proposed_method"}, {"score": 0.0038112201846057445, "phrase": "real-world_situations"}, {"score": 0.003505749731180509, "phrase": "process_capability"}, {"score": 0.0032790397247488925, "phrase": "unreliable_decisions"}, {"score": 0.0028685304140180137, "phrase": "critical_and_essential_task"}, {"score": 0.002682917193736698, "phrase": "generalised_confidence_intervals"}, {"score": 0.002551612225562499, "phrase": "taguchi_capability_index_c-pm"}, {"score": 0.0021049977753042253, "phrase": "sensitivity_study"}], "paper_keywords": ["coverage rate", " gauge measurement errors", " loss function", " process performance evaluation"], "paper_abstract": "Most research works related to process capability analysis are carried out under the assumption of no gauge measurement errors. Unfortunately, such an assumption does not adequately accommodate real-world situations even with modern, highly sophisticated measuring instruments and devices. Estimating and testing process capability without considering gauge measurement errors may often lead to unreliable decisions. Thus, how to accurately measure process performance in the presence of measurement errors becomes a critical and essential task. This article applies the concept of generalised confidence intervals to evaluate process performance based on Taguchi capability index C-pm with the consideration of measurement errors. To investigate the performance of the proposed method, a series of simulations was undertaken. A sensitivity study on the effects of ignoring measurement errors was also carried out. The results reveal that the proposed method performs very well for evaluating process performance when measurement errors are present or not.", "paper_title": "Process performance evaluation based on Taguchi capability index with the consideration of measurement errors", "paper_id": "WOS:000319503200002"}