{"auto_keywords": [{"score": 0.04909128134124432, "phrase": "cannabinoid_receptor"}, {"score": 0.00481495049065317, "phrase": "molecular_dynamics_simulation"}, {"score": 0.00466669084568269, "phrase": "known_crystal_structures_of_gpcrs"}, {"score": 0.004546618461570898, "phrase": "important_role"}, {"score": 0.004511200093569568, "phrase": "immune_system"}, {"score": 0.00444118525702523, "phrase": "gpcrs_crystallographic_structures"}, {"score": 0.004315622626764739, "phrase": "functional_transmembrane_proteins"}, {"score": 0.004293175778663009, "phrase": "high_resolution_x-ray_crystal_structures"}, {"score": 0.004182673425754283, "phrase": "present_work"}, {"score": 0.004117736306037743, "phrase": "crystal_structures"}, {"score": 0.0040643896878014485, "phrase": "high_sequence_identities"}, {"score": 0.003748672462913286, "phrase": "nci"}, {"score": 0.0034304239921461536, "phrase": "known_experimental_data"}, {"score": 0.0033859514549584497, "phrase": "defined_binding_pocket"}, {"score": 0.003307343959522875, "phrase": "training_and_testing_data_studies"}, {"score": 0.0032474645462195265, "phrase": "potential_allosteric_binding_pocket"}, {"score": 0.003213734178137277, "phrase": "orthosteric_ligand-binding_site"}, {"score": 0.0031555442027622095, "phrase": "reported_allosteric_pocket"}, {"score": 0.003090326414654403, "phrase": "delta-opioid_receptor"}, {"score": 0.0029638947417413705, "phrase": "binding_affinities"}, {"score": 0.0029484578162327, "phrase": "endogenous_agonists"}, {"score": 0.002864976610774951, "phrase": "docking_studies"}, {"score": 0.0028352077213099204, "phrase": "important_residues"}, {"score": 0.002813083646853756, "phrase": "binding_pockets"}, {"score": 0.0027838893249878456, "phrase": "cbi"}, {"score": 0.002475155824246357, "phrase": "conformational_changes"}, {"score": 0.002417641863173041, "phrase": "recent_reports"}, {"score": 0.0021550902258886512, "phrase": "site-directed_mutation_experimental_study"}, {"score": 0.0021049977753042253, "phrase": "radiometric_binding_affinity_assay"}], "paper_keywords": [""], "paper_abstract": "The cannabinoid receptor 2 (CB2) plays an important role in the immune system. Although a few of GPCRs crystallographic structures have been reported, it is still challenging to obtain functional transmembrane proteins and high resolution X-ray crystal structures, such as for the CB2 receptor. In the present work, we used 10 reported crystal structures of GPCRs which had high sequence identities with CB2 to construct homology-based comparative CB2 models. We applied these 10 models to perform a prescreen by using a training set consisting of 20 CB2 active compounds and 980 compounds randomly selected from the National Cancer Institute (NCI) database. We then utilized the known 170 cannabinoid receptor 1 (CB1) or CB2 selective compounds for further validation. Based on the docking results, we selected one CB2 model (constructed by beta 1AR) that was most consistent with the known experimental data, revealing that the defined binding pocket in our CB2 model was well-correlated with the training and testing data studies. Importantly, we identified a potential allosteric binding pocket adjacent to the orthosteric ligand-binding site, which is similar to the reported allosteric pocket for sodium ion Na+ in the A(2A)AR and the delta-opioid receptor. Our studies in correlation of our data with others suggested that sodium may reduce the binding affinities of endogenous agonists or its analogs to CB2. We performed a series of docking studies to compare the important residues in the binding pockets of CB2 with CBI, including antagonist, agonist, and our CB2 neutral compound (neutral antagonist) XIE35-1001. Then, we carried out 50 ns molecular dynamics (MD) simulations for the CB2 docked with SR144528 and CP55940, respectively. We found that the conformational changes of CB2 upon antagonist/agonist binding were congruent with recent reports of those for other GPCRs. Based on these results, we further examined one known residue, Val113(3.32), and predicted two new residues, Phe183 in ECL2 and Phe281(7.35), that were important for SR144528 and CP55940 binding to CB2. We then performed site-directed mutation experimental study for these residues and validated the predictions by radiometric binding affinity assay.", "paper_title": "Modeling, Molecular Dynamics Simulation, and Mutation Validation for Structure of Cannabinoid Receptor 2 Based on Known Crystal Structures of GPCRs", "paper_id": "WOS:000342180400008"}