{"auto_keywords": [{"score": 0.04435870485847808, "phrase": "unique_ip_addresses"}, {"score": 0.012776426662151511, "phrase": "new_services"}, {"score": 0.012030925001319175, "phrase": "existing_internet_infrastructure"}, {"score": 0.004658433758407976, "phrase": "ietf"}, {"score": 0.004195418010131832, "phrase": "significant_challenges"}, {"score": 0.004081385289516914, "phrase": "new_devices"}, {"score": 0.00373682045166829, "phrase": "interconnected_uniquely_identifiable_devices"}, {"score": 0.00327356326590461, "phrase": "new_device"}, {"score": 0.003219835797056762, "phrase": "uniquely_identified_ip_address"}, {"score": 0.00268383956231096, "phrase": "iot"}, {"score": 0.002539689093411356, "phrase": "latest_version"}, {"score": 0.002511803988580901, "phrase": "internet_protocol"}, {"score": 0.0022994427535192492, "phrase": "new_features"}], "paper_keywords": ["Internet of Things", " M2M", " IPv6", " IPSec", " Security", " Mobility"], "paper_abstract": "The IPv4 addressing scheme, which was proposed by IETF in 1981, provides 4.3 billion unique 32-bit IP addresses but has been fully exhausted in Feb, 2011. This exhaustion of unique IP addresses poses significant challenges to the addition of new devices to the Internet as well as offering new services. Internet of Things, which provides interconnected uniquely identifiable devices in the existing Internet infrastructure, will be greatly affected by the lack of unique IP addresses. In order to connect to the existing Internet infrastructure, every new device needs a uniquely identified IP address for communication. It has been estimated that by the year 2020 more than 30 billion devices would be connected to the Internet. In order to meet the challenge of such vast requirement of unique IP addresses, the devices in IoT will have to adopt IPv6, which is the latest version of Internet Protocol. IPv6 uses 128-bit IP addresses and offers 2(128) unique IP addresses. Therefore, it expands IPv4 and provides new features of end to end connections as well as new services. In this paper, the various challenges with respect to providing connectivity, security, mobility, etc., have been discussed and how IPv6 helps in meeting those challenges.", "paper_title": "Challenges and solutions for Internet of Things Driven by IPv6", "paper_id": "WOS:000370180200001"}