{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "outlier_detection"}, {"score": 0.01054554858715057, "phrase": "categorical_data"}, {"score": 0.008084847240283563, "phrase": "limited_information"}, {"score": 0.00683483311942005, "phrase": "relative_patterns"}, {"score": 0.004754169447498132, "phrase": "outlier"}, {"score": 0.004649552749844436, "phrase": "detection_technology"}, {"score": 0.004294381488413906, "phrase": "frequent_itemset_mining"}, {"score": 0.003571018150056717, "phrase": "high_efficiency"}, {"score": 0.0033937776228549557, "phrase": "low_level"}, {"score": 0.0033190180867511605, "phrase": "contrary_judgment"}, {"score": 0.003204841443605308, "phrase": "concept_relative_patterns_discovery"}, {"score": 0.0031743876179636476, "phrase": "new_perspective"}, {"score": 0.0031542454984159634, "phrase": "association_analysis"}, {"score": 0.0030457198309616694, "phrase": "hash-index-based_intersecting_approach"}, {"score": 0.002885275573483437, "phrase": "unsupervised_approach"}, {"score": 0.002848768455610759, "phrase": "ua"}, {"score": 0.0025810006125483835, "phrase": "empirical_investigation"}, {"score": 0.002548331088496964, "phrase": "eight_real-world_datasets"}, {"score": 0.002468450551616404, "phrase": "previous_studies"}, {"score": 0.002360796860462937, "phrase": "execution_complexity"}, {"score": 0.0022940774859444724, "phrase": "high-dimensional_data"}, {"score": 0.002236352450500035, "phrase": "natural_panorama"}, {"score": 0.0021800767552049402, "phrase": "controlled_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Association analysis", " Categorical data", " Frequent itemsets mining", " Outlier detection", " Unsupervised method"], "paper_abstract": "Outlier (also known as anomaly) detection technology is widely applied to many areas, such as diagnosing diseases, evaluating credit, and investigating cybercrime. Recently, several studies, based on frequent itemset mining (FIM), have been proposed to detect outliers in categorical data. For efficiency, these FIM-based studies pruned (ignored) the majority of data by either imposing a threshold or restricting the length of the pattern or both, and they further adopted the limited information to evaluate observations. In spite of high efficiency, such a pruning approach encounters the problem of distortion, i.e., the accuracy decreases to a low level of discernment or even causes the contrary judgment in certain cases. In this paper, we introduce the concept relative patterns discovery from a new perspective on association analysis. To efficiently explore the relative patterns, we devise a hash-index-based intersecting approach (called the HA). Based on the knowledge of relative patterns, we propose an unsupervised approach (called the UA) to evaluate which observations are anomalous. Instead of using the limited information, our method can differentiate the features of observations without the problem of distortion. The results of the empirical investigation, conducted with eight real-world datasets on the UCI Machine Learning Repository, demonstrate that our method generally outperforms the previous studies not only in accuracy but also inefficiency. We also demonstrate that the execution complexity of our method is significantly efficient, especially in high-dimensional data. Furthermore, our method can represent a natural panorama of data, which is appropriate in controlled experiments for discovering more decisive factors in outlier detection. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A relative patterns discovery for enhancing outlier detection in categorical data", "paper_id": "WOS:000345724700009"}