{"auto_keywords": [{"score": 0.03690556387890809, "phrase": "file_sharing"}, {"score": 0.00481495049065317, "phrase": "determining_ethical"}, {"score": 0.004728874038094706, "phrase": "unauthorized_file_sharing"}, {"score": 0.004644329185633612, "phrase": "different_types"}, {"score": 0.004610934029355486, "phrase": "information_goods"}, {"score": 0.004544859094594241, "phrase": "free_download"}, {"score": 0.004512175937946914, "phrase": "illegal_file_sharing_sites"}, {"score": 0.004122850924351265, "phrase": "policy_makers"}, {"score": 0.003948043391567917, "phrase": "consumers'_file_sharing_behavior"}, {"score": 0.0033076455392068095, "phrase": "music_files"}, {"score": 0.0029146651796243704, "phrase": "five_studies"}, {"score": 0.002790940765338191, "phrase": "consumers'_perceptions"}, {"score": 0.0025868936783877035, "phrase": "different_levels"}, {"score": 0.002558985036330194, "phrase": "still_transfers"}, {"score": 0.002549749054599413, "phrase": "intellectual_property"}, {"score": 0.0024950272594582673, "phrase": "increased_restrictiveness_results"}, {"score": 0.002320943211698446, "phrase": "great_impact"}, {"score": 0.002279349794239273, "phrase": "unauthorized_file_sharing_activities"}, {"score": 0.0021049977753042253, "phrase": "prior_knowledge"}], "paper_keywords": ["MP3", " File Sharing Downloading", " Ethics", " Public Policy", " Intellectual Property", " Restrictiveness", " Property Rights", " Marketing", " Copyright", " Deviance"], "paper_abstract": "A host of different types of information goods are available for free download from illegal file sharing sites. As far as price is concerned, no company can compete against \"free.\" Hence, managers, researchers, and policy makers are interested in determining factors other than price that might influence consumers' file sharing behavior. Moral consideration is one factor that might sway individuals to pay for files they could otherwise obtain for free. To help better understand how moral consideration works in the context of file sharing, this research examines how people form perceptions of the legality and ethicalness of downloading music files through file sharing. We propose that when people receive files in a more restrictive manner (e.g. streaming vs. downloading) they are less likely to recognize file sharing as being unethical or illegal. We conduct five studies to test our theory of restrictiveness. The results consistently indicate that consumers' perceptions of legality and ethicalness of file sharing are associated with restrictiveness of use. In particular, while file sharing with different levels of restrictiveness still transfers intellectual property from one individual to another, increased restrictiveness results in consumers being less likely to identify file sharing as being illegal or unethical. This in turn has a great impact on their actual engagement in the unauthorized file sharing activities. We find the relationships are significant even when controlling for several other elements such as gender, age, income, and prior knowledge about how and where to go on the internet to participate in file sharing.", "paper_title": "The Role of Restrictiveness of Use in Determining Ethical and Legal Awareness of Unauthorized File Sharing", "paper_id": "WOS:000327545300002"}