{"auto_keywords": [{"score": 0.043386623096297906, "phrase": "pubmed"}, {"score": 0.0157196922603849, "phrase": "internet_references"}, {"score": 0.012296890551483312, "phrase": "internet_citations"}, {"score": 0.0047409388179452255, "phrase": "biomedical_literature"}, {"score": 0.004253618550301311, "phrase": "biomedical_publications"}, {"score": 0.003956784357357341, "phrase": "one-month_observational_study_period"}, {"score": 0.0038758440586222267, "phrase": "mar"}, {"score": 0.0036427316134070007, "phrase": "forthcoming_publications"}, {"score": 0.003405948098114941, "phrase": "referenced_internet_citations"}, {"score": 0.00330189927527898, "phrase": "inaccessible_internet_citations"}, {"score": 0.0026986685585382347, "phrase": "article's_release"}, {"score": 0.002358917661465133, "phrase": "inaccessibility_rate"}, {"score": 0.0021049977753042253, "phrase": "accurate_and_accessible_internet_references"}], "paper_keywords": [""], "paper_abstract": "Objectives: To determine the prevalence and inaccessibility of Internet references in the bibliography of biomedical publications when first released in PubMed (R). Methods: During a one-month observational study period (Feb 21 to Mar 21, 2006) the Internet citations from a 20% random sample of all forthcoming publications released in PubMed during the previous day were identified. Attempts to access the referenced Internet citations were completed within one day and inaccessible Internet citations were recorded. Results: The study included 4,699 publications from 844 different journals. Among the 141,845 references there were 840 (0.6%) Internet citations. One or more Internet references were cited in 403 (8.6%) articles. From the 840 Internet references, 11.9% were already inaccessible within two days after an article's release to the public. Conclusion: The prevalence of Internet citations in journals included in PubMed is small (< 1%); however, the inaccessibility rate at the time of publication is considered substantial. Authors, editors, and publishers need to take responsibility for providing accurate and accessible Internet references.", "paper_title": "The prevalence and inaccessibility of Internet references in the biomedical literature at the time of publication", "paper_id": "WOS:000245562600012"}