{"auto_keywords": [{"score": 0.048552394862534626, "phrase": "wireless_sensor_networks"}, {"score": 0.032854255577662896, "phrase": "third_party"}, {"score": 0.00481495049065317, "phrase": "semihonest_third_party"}, {"score": 0.004712065638657606, "phrase": "privacy_protection"}, {"score": 0.003879234831701853, "phrase": "private_information"}, {"score": 0.003519561814102764, "phrase": "passive_attacker"}, {"score": 0.003407214479510987, "phrase": "present_work"}, {"score": 0.0030086877092638945, "phrase": "randomization_technique"}, {"score": 0.002865710140187219, "phrase": "calculated_value"}, {"score": 0.0028195727965553367, "phrase": "real_number_field"}, {"score": 0.0027295084882654917, "phrase": "distance_computation"}, {"score": 0.002685558057339722, "phrase": "intermediate_values"}, {"score": 0.0026423134393535265, "phrase": "proposed_protocols"}], "paper_keywords": [""], "paper_abstract": "Scenarios in which two nodes who distrust each other in wireless sensor networks (WSNs) would like to know the distance between them are considered. The scenario is designed to protect the private information of WSNs, in this case each node's location, from the other nodes and from a passive attacker. The goal of the present work is to provide two novel and secure two-party distance computation protocols based on a semihonest model, the first with aid of a third party and the second based on randomization technique. Both of these protocols can extend the calculated value into a real number field. The output of the distance computation and the intermediate values in the proposed protocols are also private and not accessible to a third party or any other attackers. When executing these two protocols, security is guaranteed, and the performances of communication and computation of them are found to be satisfactory when compared to those of other similar protocols.", "paper_title": "Secure Two-Party Distance Computation Protocols with a Semihonest Third Party and Randomization for Privacy Protection in Wireless Sensor Networks", "paper_id": "WOS:000358508600001"}