{"auto_keywords": [{"score": 0.041207280547490115, "phrase": "empirical_study"}, {"score": 0.03328754160505471, "phrase": "actual_process"}, {"score": 0.026508735323781275, "phrase": "actual_process_activities"}, {"score": 0.00481495049065317, "phrase": "software_process_patterns"}, {"score": 0.004631099806015235, "phrase": "student_teams"}, {"score": 0.004591202593942391, "phrase": "traditional_software_engineering_processes"}, {"score": 0.004340081802944066, "phrase": "software_developers"}, {"score": 0.00403221710768334, "phrase": "software_development_practices"}, {"score": 0.0038781372962808894, "phrase": "six_teams"}, {"score": 0.0038447018470115146, "phrase": "five_students"}, {"score": 0.0036817833826578395, "phrase": "time_slips"}, {"score": 0.0034204548167213545, "phrase": "process_patterns"}, {"score": 0.00319141242685261, "phrase": "activity_patterns"}, {"score": 0.003029722317983915, "phrase": "process_performance"}, {"score": 0.002637377202509382, "phrase": "wide_variability"}, {"score": 0.002558549084795168, "phrase": "process_assessments"}, {"score": 0.0023460397258997525, "phrase": "process_activities"}, {"score": 0.0022464835515931592, "phrase": "causal_information"}, {"score": 0.0021604924928015283, "phrase": "implemented_components"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Traditional software engineering processes are composed of practices defined by roles, activities and artifacts. Software developers have their own understanding of practices and their own ways of implementing them, which could result in variations in software development practices. This paper presents an empirical study based on six teams of five students each, involving three different projects. Their process practices are monitored by time slips based on the effort expended on various process-related activities. This study introduces a new 3-pole graphical representation to represent the process patterns of effort expended on the various discipline activities. The purpose of this study is to quantify activity patterns in the actual process, which in turn demonstrates the variability of process performance. This empirical study provides three examples of patterns based on three empirical axes (engineering, coding and V&V). The idea behind this research is to make developers aware that there is wide variability in the actual process, and that process assessments might be weakly related to actual process activities. This study suggests that in-process monitoring is required to control the process activities. In-process monitoring is likely to provide causal information between the actual process activities and the quality of the implemented components. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Towards software process patterns: An empirical analysis of the behavior of student teams", "paper_id": "WOS:000259709200003"}