{"auto_keywords": [{"score": 0.04058473010662897, "phrase": "secrecy_capacity"}, {"score": 0.00481495049065317, "phrase": "secrecy_capacity_of_fast"}, {"score": 0.004771196027464407, "phrase": "multiple-input_wiretap_channels"}, {"score": 0.004621148492564008, "phrase": "secure_transmission"}, {"score": 0.004579147045265106, "phrase": "ergodic_fast_rayleigh"}, {"score": 0.004537525607322823, "phrase": "multiple-input_single-output_single-antenna-eavesdropper"}, {"score": 0.0040111533608228195, "phrase": "new_secrecy_capacity"}, {"score": 0.0037798652680135106, "phrase": "gaussian_input"}, {"score": 0.0035781807623238905, "phrase": "misose_channel"}, {"score": 0.003449718244515019, "phrase": "equivocation_constraint"}, {"score": 0.003265591844292821, "phrase": "legitimate_and_eavesdropper_channel_gains"}, {"score": 0.003221111762383486, "phrase": "resulting_upper_bound"}, {"score": 0.002926212333939311, "phrase": "legitimate_receiver"}, {"score": 0.0027322025124213566, "phrase": "optimal_channel_input_covariance_matrix"}, {"score": 0.0026949679939994226, "phrase": "scaled_identity_matrix"}, {"score": 0.0025627194819793347, "phrase": "completely_monotone_property"}, {"score": 0.0023173287402646577, "phrase": "signal-to-noise_ratio"}, {"score": 0.002296433669356094, "phrase": "snr"}, {"score": 0.0021049977753042253, "phrase": "legitimate_csit"}], "paper_keywords": ["Secrecy capacity", " fast fading", " Rayleigh", " partial CSI", " CSIT"], "paper_abstract": "We consider the secure transmission in ergodic fast Rayleigh fading multiple-input single-output single-antenna-eavesdropper (MISOSE) wiretap channels. We assume that the statistics of both the legitimate and eavesdropper channels are the only available channel state information at the transmitter (CSIT). By introducing a new secrecy capacity upper bound, we prove that the secrecy capacity is achieved by the Gaussian input without prefixing. To attain this result, we form another MISOSE channel for upper-bounding by relaxing the equivocation constraint, and tighten the bound by carefully selecting correlations between the legitimate and eavesdropper channel gains. The resulting upper bound is tighter than the others in the literature which are based on modifying the correlation between the noises at the legitimate receiver and eavesdropper. Next, we fully characterize the secrecy capacity by showing that the optimal channel input covariance matrix is a scaled identity matrix. The key to solve such a stochastic optimization problem is by exploiting the completely monotone property of the secrecy capacity. Finally, we prove that with only statistical CSIT of both channels, the capacity will neither scale with signal-to-noise ratio (SNR) nor the number of antenna. Our numerical results also match these observations and further confirm that having the legitimate CSIT (realizations) is very beneficial to increase the secrecy capacity.", "paper_title": "On Secrecy Capacity of Fast Fading Multiple-Input Wiretap Channels With Statistical CSIT", "paper_id": "WOS:000318596100013"}