{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_phones"}, {"score": 0.011982551435369027, "phrase": "school-related_work"}, {"score": 0.004590052784169268, "phrase": "digital_native-digital_immigrant_dichotomy"}, {"score": 0.004318881178805575, "phrase": "southeastern_united_states"}, {"score": 0.004010960493946656, "phrase": "mobile_phone"}, {"score": 0.0036926236934657864, "phrase": "specific_mobile_features"}, {"score": 0.003581797255879607, "phrase": "instructional_barriers"}, {"score": 0.0032974089700312423, "phrase": "prensky"}, {"score": 0.0031845067058084613, "phrase": "significant_differences"}, {"score": 0.002818850283787242, "phrase": "mobile_phone_ownership"}, {"score": 0.0024519545383399773, "phrase": "older_teachers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["21st Century skills", " Mobile phones", " Mobile learning", " Digital natives", " Digital immigrants"], "paper_abstract": "This study examined the digital native-digital immigrant dichotomy based on the results of a study involving 1095 teachers from two states in the southeastern United States. The study focused on age as it relates to the relationship between the type of mobile phone they owned, their support for the use of mobile phones in the classroom, their perceptions of the benefits of specific mobile features for school-related work, and their perceptions of instructional barriers. The results indicated that the age of the teacher matters, however, not as suggested by Prensky (2001). There were no significant differences in the findings for the teachers who were less than 32 and the ones who were 33-49; however, they both significantly differed from those over 50 in mobile phone ownership and support for the use of mobile phones in the classroom as well as in their perceptions regarding the useful mobile features for school-related work and instructional barriers. In each instance, the older teachers were less likely to own smartphones, were less supportive on all items, were less enthusiastic about the features, and found the barriers to be more problematic. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Teacher perceptions of using mobile phones in the classroom: Age matters!", "paper_id": "WOS:000334131800002"}