{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "industrial_aspects"}, {"score": 0.04935889043076212, "phrase": "combined_inventory_management"}, {"score": 0.004600870784042767, "phrase": "maritime_and_road-based_transportation"}, {"score": 0.004363058588000252, "phrase": "comprehensive_literature_review"}, {"score": 0.004264923517966271, "phrase": "current_state"}, {"score": 0.0038938807148174975, "phrase": "industrial_applications"}, {"score": 0.0034749794034364197, "phrase": "future_research"}, {"score": 0.003245520963944678, "phrase": "research_area"}, {"score": 0.0031966173935538992, "phrase": "industrial_needs"}, {"score": 0.0028525124381208705, "phrase": "advanced_decision_support_systems"}, {"score": 0.002254003531073337, "phrase": "inventory_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Inventory management", " Inventory routing", " Vehicle routing"], "paper_abstract": "This paper describes industrial aspects of combined inventory management and routing in maritime and road-based transportation, and gives a classification and comprehensive literature review of the current state of the research. The literature is contrasted with aspects of industrial applications from a constructive, but critical, viewpoint. Based on the status and trends within the field, future research is suggested with regard to both further development of the research area and industrial needs. By highlighting the industrial aspects, practitioners will hopefully see the benefit of using advanced decision support systems in complex situations related to combined inventory management and routing in their business. In addition, a classification and presentation of the research should help and motivate researchers to further focus on inventory management and routing challenges. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Industrial aspects and literature survey: Combined inventory management and routing", "paper_id": "WOS:000275588400001"}