{"auto_keywords": [{"score": 0.024586093495145706, "phrase": "svm"}, {"score": 0.00481495049065317, "phrase": "gene_expression_profile_analysis"}, {"score": 0.004669845451682529, "phrase": "gene_expression_profiles"}, {"score": 0.00461302961851157, "phrase": "distinct_disease_phenotypes"}, {"score": 0.004208282550386197, "phrase": "biological_interpretation"}, {"score": 0.0038389110156920926, "phrase": "protein_interaction_information"}, {"score": 0.0037459885494311217, "phrase": "expression_profiles"}, {"score": 0.0031747618267940155, "phrase": "co-expressed_genes"}, {"score": 0.002860546817196148, "phrase": "improved_performance"}, {"score": 0.002641360377825228, "phrase": "biological_information"}, {"score": 0.002336414425972225, "phrase": "new_kernel_method-called_nick-that_integrates_network_and_expression_data"}, {"score": 0.0021441057555396013, "phrase": "extant_methods"}], "paper_keywords": ["algorithms"], "paper_abstract": "Computational classification of gene expression profiles into distinct disease phenotypes has been highly successful to date. Still, robustness, accuracy, and biological interpretation of the results have been limited, and it was suggested that use of protein interaction information jointly with the expression profiles can improve the results. Here, we study three aspects of this problem. First, we show that interactions are indeed relevant by showing that co-expressed genes tend to be closer in the network of interactions. Second, we show that the improved performance of one extant method utilizing expression and interactions is not really due to the biological information in the network, while in another method this is not the case. Finally, we develop a new kernel method-called NICK-that integrates network and expression data for SVM classification, and demonstrate that overall it achieves better results than extant methods while running two orders of magnitude faster.", "paper_title": "Network-Induced Classification Kernels for Gene Expression Profile Analysis", "paper_id": "WOS:000305335100010"}