{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neighbor_discovery"}, {"score": 0.005688273193270135, "phrase": "fast_algorithm"}, {"score": 0.005617840175290389, "phrase": "neighbor_discovery_problem"}, {"score": 0.004785022360244881, "phrase": "cognitive_radio_networks"}, {"score": 0.004740476936977635, "phrase": "cognitive_radio_node"}, {"score": 0.004696344245532423, "phrase": "radio_device"}, {"score": 0.004623696669036629, "phrase": "multiple_channels"}, {"score": 0.004426180319550746, "phrase": "varying_channel_availability"}, {"score": 0.004094138129176259, "phrase": "fast_deterministic_algorithm"}, {"score": 0.0040307683311441534, "phrase": "undirected_network"}, {"score": 0.003906944616017869, "phrase": "different_subsets"}, {"score": 0.0037516215763875225, "phrase": "neighbor_discovery_algorithm"}, {"score": 0.0036591119109692545, "phrase": "actual_network-size"}, {"score": 0.0031107911390188055, "phrase": "actual_number"}, {"score": 0.0027626452333204144, "phrase": "desirable_property"}, {"score": 0.002507621527279442, "phrase": "gossiping_algorithm"}, {"score": 0.0024842242921857705, "phrase": "single-channel_network"}, {"score": 0.0024002822777025906, "phrase": "fast_adaptive_algorithm"}, {"score": 0.0021922980151500037, "phrase": "collision-aware_and_channel_availability_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cognitive radio network", " Multiple channels", " Neighbor discovery", " Adaptive algorithm", " Termination detection", " Collision-awareness"], "paper_abstract": "A cognitive radio node is a radio device capable of operating over multiple channels. As a result, a network consisting of one or more cognitive radio nodes can adapt to varying channel availability in its geographical region by dynamically changing the channel (or channels) nodes are using for communication. We investigate the problem of designing a fast deterministic algorithm for neighbor discovery in an undirected network consisting of one or more cognitive radio nodes when different nodes may have different subsets of channels available for communication at their location. We say that a neighbor discovery algorithm is fast if its time-complexity is polynomial in actual network-size. We prove that it is impossible to devise a fast algorithm to solve the neighbor discovery problem if nodes are neither size-aware nor collision-aware. When nodes are collision-aware, we present a fast algorithm for neighbor discovery with time-complexity of O(p m log n), where p denotes the actual number of nodes present in the network, n denotes the size of space used for assigning labels to the nodes, and m denotes the number of channels over which nodes can operate. Our algorithm has the desirable property that every node knows when the neighbor discovery has completed and, moreover, all nodes terminate at the same time. When nodes are size-aware, we use a gossiping algorithm for a single-channel network with large labels that was proposed recently to derive a fast adaptive algorithm for neighbor discovery. We also investigate the neighbor discovery problem when the network may be directed. Finally, we describe a way to speed up neighbor discovery when nodes are collision-aware and channel availability sets of neighboring nodes do not vary significantly. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "On neighbor discovery in cognitive radio networks", "paper_id": "WOS:000266945000004"}