{"auto_keywords": [{"score": 0.043733065812188825, "phrase": "protein_functional_domain_composition"}, {"score": 0.00481495049065317, "phrase": "functional_domain_composition"}, {"score": 0.004423061344624088, "phrase": "automatic_enzyme_identifier"}, {"score": 0.004348580182733617, "phrase": "support_vector_machine"}, {"score": 0.004299890102368103, "phrase": "svm"}, {"score": 0.004227209809791869, "phrase": "feature_vectors"}, {"score": 0.0038610400240820307, "phrase": "six_different_classes"}, {"score": 0.0035666632046674153, "phrase": "jackknife_cross-validation_test"}, {"score": 0.0032208091960514128, "phrase": "enzyme_classification"}, {"score": 0.0030434289758788998, "phrase": "blast"}, {"score": 0.003009022147559257, "phrase": "psi-blast_based_method"}, {"score": 0.0027480831196871093, "phrase": "major_features"}, {"score": 0.0024120247307686084, "phrase": "web-based_software"}], "paper_keywords": ["enzyme", " classification", " functional domain composition", " support vector machine"], "paper_abstract": "Classification for enzymes is a prerequisite for understanding their function. Here, an automatic enzyme identifier based on support vector machine (SVM) with feature vectors from protein functional domain composition was built to identify enzymes and further a classifier to classify enzymes into six different classes: oxidoreductase, transferase, hydrolase, lyase, isomerase and ligase. Jackknife cross-validation test was adopted to evaluate the performance of our classifier. The 86.03% success rate achieved for enzyme/non-enzyme identification and 91.32% for enzyme classification, which is much better than that of the BLAST and PSI-BLAST based method, also outperforms several existed works. The results indicate that protein functional domain composition is able to capture the major features which facilitate the identification/classification of proteins, thus demonstrating that our predictor could be a more effective and promising high-throughput method in enzyme research. Moreover, a web-based software Enzyme Classification System (ECS) for identification as well as classification of enzymes can be accessed at: http://pcal.biosino.org/. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "ECS: An automatic enzyme classifier based on functional domain composition", "paper_id": "WOS:000247289900010"}