{"auto_keywords": [{"score": 0.0500784160271924, "phrase": "zigzag_maneuvers"}, {"score": 0.04711362560073776, "phrase": "kcs"}, {"score": 0.03303095582310308, "phrase": "propeller_rotational_speed"}, {"score": 0.004761010795871555, "phrase": "container_ship"}, {"score": 0.004253618550301311, "phrase": "considerable_challenges"}, {"score": 0.00419016653753787, "phrase": "moving_semi-balanced_horn_rudder"}, {"score": 0.004081385289516914, "phrase": "rudder_root"}, {"score": 0.00396050388346298, "phrase": "dynamic_overset_technique"}, {"score": 0.003771631577951067, "phrase": "delayed_detached_eddy_simulation_turbulence_model"}, {"score": 0.003446208270665051, "phrase": "model_scale"}, {"score": 0.0033190180867511605, "phrase": "froude_number"}, {"score": 0.0032449610741097992, "phrase": "approach_speed"}, {"score": 0.0031845067058084613, "phrase": "proportional-integral_speed_controller"}, {"score": 0.0025795066118838067, "phrase": "moving_rudder"}, {"score": 0.002560162916190598, "phrase": "rotating_propeller"}, {"score": 0.0023834640793589435, "phrase": "computational_cost"}, {"score": 0.002295406551990453, "phrase": "flow_physics"}, {"score": 0.002218933616777076, "phrase": "asymmetric_behavior"}, {"score": 0.0021530945641993152, "phrase": "single_rotating_propeller"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ship maneuvering", " Dynamic overset", " Containership", " Ship hydrodynamics"], "paper_abstract": "Simulations of zigzag maneuvers of the Postdam Model Basin (SVA) Korean container ship (KCS) model with moving rudder and rotating propeller are presented. Free running KCS presents considerable challenges to simulate the moving semi-balanced horn rudder which presents tight gaps with the rudder root. These difficulties are overcome using a dynamic overset technique with a hierarchy of bodies. To better resolve propeller/rudder interaction a Delayed Detached Eddy Simulation turbulence model based on Menter's SST is used. Two types of maneuvers are simulated, the standard 10/10 zigzag maneuver and the modified 15/1 zigzag maneuver. Both simulations are performed at model scale in deep, calm water, for approach velocities corresponding to a Froude number 0.26. The self-propulsion at approach speed is achieved using a proportional-integral speed controller which acts on the propeller rotational speed with the ship free to surge, heave, roll and pitch. Once the ship achieves self-propulsion the propeller rotational speed is frozen and the ship is free to move in six degrees of freedom (6DOF) while the maneuver starts. The results show that direct Computational Fluid Dynamics (CFD) simulations of maneuvers with a moving rudder and rotating propeller are feasible and the comparisons between computations and experiments are highly satisfactory in both cases, but the computational cost is still high for many applications. In analyzing the flow physics, it is found that the rudder has asymmetric behavior caused by the asymmetry introduced by the single rotating propeller. (c) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Simulations of zigzag maneuvers for a container ship with direct moving rudder and propeller", "paper_id": "WOS:000336775700016"}