{"auto_keywords": [{"score": 0.03468287728054992, "phrase": "organizational_schemes"}, {"score": 0.01053449915958766, "phrase": "rhetorical_arguments"}, {"score": 0.00481495049065317, "phrase": "information_systems"}, {"score": 0.004471035765089235, "phrase": "particular_interpretation"}, {"score": 0.0043083624695326745, "phrase": "conceptual_framework"}, {"score": 0.004105666842002734, "phrase": "existing_organizational_schemes"}, {"score": 0.003912469968653304, "phrase": "findings_-_organizational_schemes"}, {"score": 0.0038691879515317267, "phrase": "logical_arguments"}, {"score": 0.0036870776660851007, "phrase": "relationship_evidence"}, {"score": 0.0036462799422150834, "phrase": "category_structure"}, {"score": 0.0036193316508938795, "phrase": "resource_evidence"}, {"score": 0.0031786037839399055, "phrase": "additional_forms"}, {"score": 0.0031317713853981064, "phrase": "argumentative_structures"}, {"score": 0.002951220859491642, "phrase": "persuasive_argumentation"}, {"score": 0.0027097117582440687, "phrase": "collection_development"}, {"score": 0.002630414143385786, "phrase": "overall_design"}, {"score": 0.0026012779346272848, "phrase": "organizational_scheme"}, {"score": 0.0021365087453258263, "phrase": "rhetorical_communication"}, {"score": 0.0021049977753042253, "phrase": "particular_ideas"}], "paper_keywords": ["Knowledge organizations", " Classification", " Information systems", " Design"], "paper_abstract": "Purpose - This paper aims to examine how systems for organizing information construct rhetorical arguments for a particular interpretation of their subject matter. Design/methodology/approach - The paper synthesizes a conceptual framework from the field of rhetoric and uses that framework to analyze how existing organizational schemes present evidence in support of arguments regarding the material being organized. Findings - Organizational schemes can present logical arguments as posed in rhetoric, using two forms of evidence for their claims: relationship evidence from the category structure and resource evidence from the ways that items are assigned to categories. Research limitations/implications - This study does not attempt to identify all types of evidence that organizational schemes might use in argumentation. Further research may describe additional forms of evidence and argumentative structures. Practical implications - When creating organizational schemes, designers might develop a strategy to facilitate persuasive argumentation. Moreover, because arguments may be either strengthened or undermined through the assignment of resources to categories, both indexing and collection development may be seen as contributing to the overall design of an organizational scheme. Originality/value - While many researchers have asserted that organizational schemes form arguments, and while various studies have described what information systems might be said to communicate, this study focuses on how such communication may take place more or less effectively. This analysis foregrounds the potential for organizational schemes to be systematically and purposefully designed as rhetorical communication, to express particular ideas.", "paper_title": "Two kinds of evidence: how information systems form rhetorical arguments", "paper_id": "WOS:000282033200003"}