{"auto_keywords": [{"score": 0.040043316347254894, "phrase": "different_species"}, {"score": 0.035533772426587416, "phrase": "topology-function_relationships"}, {"score": 0.00481495049065317, "phrase": "protein-protein_interaction_networks"}, {"score": 0.004534428070512318, "phrase": "protein-protein_interaction_network"}, {"score": 0.004502558050342737, "phrase": "pin"}, {"score": 0.004377077848734575, "phrase": "similar_wiring"}, {"score": 0.004165879874212301, "phrase": "similar_functions"}, {"score": 0.004021267064832957, "phrase": "protein_functions"}, {"score": 0.003992950134435965, "phrase": "topological_similarity"}, {"score": 0.003909185474360582, "phrase": "network_alignment_algorithms"}, {"score": 0.0038679618585498597, "phrase": "similarly_wired_proteins"}, {"score": 0.003629557750546267, "phrase": "model_organisms"}, {"score": 0.0035408501923902477, "phrase": "functional_predictions"}, {"score": 0.0035159043158639633, "phrase": "annotation_transfers"}, {"score": 0.003229870860371533, "phrase": "specific_topologies"}, {"score": 0.002833689453299307, "phrase": "statistical_framework"}, {"score": 0.002784007794229784, "phrase": "canonical_correlation_analysis"}, {"score": 0.002744888626958772, "phrase": "graphlet_degrees"}, {"score": 0.0026494723416072316, "phrase": "gene_ontology"}, {"score": 0.0025214217930287003, "phrase": "statistically_significant_topology-function_relationships"}, {"score": 0.0023079225317714815, "phrase": "topologically_orthologous_functions"}, {"score": 0.0022041312401435346, "phrase": "seven_biological_process"}], "paper_keywords": [""], "paper_abstract": "Motivation: Proteins underlay the functioning of a cell and the wiring of proteins in protein-protein interaction network (PIN) relates to their biological functions. Proteins with similar wiring in the PIN (topology around them) have been shown to have similar functions. This property has been successfully exploited for predicting protein functions. Topological similarity is also used to guide network alignment algorithms that find similarly wired proteins between PINs of different species; these similarities are used to transfer annotation across PINs, e.g. from model organisms to human. To refine these functional predictions and annotation transfers, we need to gain insight into the variability of the topology-function relationships. For example, a function may be significantly associated with specific topologies, while another function may be weakly associated with several different topologies. Also, the topology-function relationships may differ between different species. Results: To improve our understanding of topology-function relationships and of their conservation among species, we develop a statistical framework that is built upon canonical correlation analysis. Using the graphlet degrees to represent the wiring around proteins in PINs and gene ontology (GO) annotations to describe their functions, our framework: (i) characterizes statistically significant topology-function relationships in a given species, and (ii) uncovers the functions that have conserved topology in PINs of different species, which we term topologically orthologous functions. We apply our framework to PINs of yeast and human, identifying seven biological process and two cellular component GO terms to be topologically orthologous for the two organisms.", "paper_title": "Topology-function conservation in protein-protein interaction networks", "paper_id": "WOS:000355672500015"}