{"auto_keywords": [{"score": 0.04924054324953065, "phrase": "recurrent_cortical_networks"}, {"score": 0.03488739830592305, "phrase": "initial_conditions"}, {"score": 0.00481495049065317, "phrase": "precise_spike_timing"}, {"score": 0.004566308708871429, "phrase": "precise_timing"}, {"score": 0.0044863018460183784, "phrase": "cortical_computation"}, {"score": 0.004388252997694986, "phrase": "growing_experimental_evidence"}, {"score": 0.004124920849728372, "phrase": "remarkable_temporal_precision"}, {"score": 0.003999217176949845, "phrase": "spike_timing"}, {"score": 0.003660700128133065, "phrase": "independently_initializable_internal_state"}, {"score": 0.0034868462688262864, "phrase": "critical_constraint"}, {"score": 0.0032057142600527, "phrase": "abstract_dynamical_system"}, {"score": 0.002986575805559931, "phrase": "stationary_dynamics"}, {"score": 0.002661883310629088, "phrase": "orientation_selectivity_literature"}, {"score": 0.0024917436734273927, "phrase": "poisson"}, {"score": 0.0023935128386292966, "phrase": "moderate_levels"}, {"score": 0.0023724065150232897, "phrase": "internal_activity"}, {"score": 0.002219916677664081, "phrase": "precise_spike_trajectories"}, {"score": 0.0021049977753042253, "phrase": "millisecond_timescale"}], "paper_keywords": [""], "paper_abstract": "Several recent models have proposed the use of precise timing of spikes for cortical computation. Such models rely on growing experimental evidence that neurons in the thalamus as well as many primary sensory cortical areas respond to stimuli with remarkable temporal precision. Models of computation based on spike timing, where the output of the network is a function not only of the input but also of an independently initializable internal state of the network, must, however, satisfy a critical constraint: the dynamics of the network should not be sensitive to initial conditions. We have previously developed an abstract dynamical system for networks of spiking neurons that has allowed us to identify the criterion for the stationary dynamics of a network to be sensitive to initial conditions. Guided by this criterion, we analyzed the dynamics of several recurrent cortical architectures, including one from the orientation selectivity literature. Based on the results, we conclude that under conditions of sustained, Poisson-like, weakly correlated, low to moderate levels of internal activity as found in the cortex, it is unlikely that recurrent cortical networks can robustly generate precise spike trajectories, that is, spatiotemporal patterns of spikes precise to the millisecond timescale.", "paper_title": "Dynamical constraints on using precise spike timing to compute in recurrent cortical networks", "paper_id": "WOS:000253808800004"}