{"auto_keywords": [{"score": 0.035828087534129485, "phrase": "lod"}, {"score": 0.00481495049065317, "phrase": "-core_simplification"}, {"score": 0.004636594774238505, "phrase": "irregular_grids"}, {"score": 0.004071121244999291, "phrase": "space_decomposition"}, {"score": 0.003759057920801288, "phrase": "edge_collapses"}, {"score": 0.0032181231788427655, "phrase": "negative_volumes"}, {"score": 0.0030216031606457214, "phrase": "elusive_goal"}, {"score": 0.00299632091372281, "phrase": "out-of-core_progressive_meshes"}, {"score": 0.00284899583294417, "phrase": "theoretical_guarantee"}, {"score": 0.002766415324343602, "phrase": "tetrahedral_meshes"}, {"score": 0.0026975346834867335, "phrase": "desirable_lod_mesh"}, {"score": 0.00267495669519805, "phrase": "volume_rendering"}, {"score": 0.002630364569659531, "phrase": "selective_refinement_lods"}, {"score": 0.0025974077149412, "phrase": "different_places"}, {"score": 0.002564862727498502, "phrase": "different_error_bounds"}, {"score": 0.0024904974828343033, "phrase": "basic_uniform_lods"}, {"score": 0.002338306897057454, "phrase": "proposed_scalar-value_range"}, {"score": 0.0023187286045879643, "phrase": "view-dependent_selection_queries"}, {"score": 0.002204646157481869, "phrase": "highest_quality"}], "paper_keywords": [""], "paper_abstract": "We propose a novel out-of-core simplification and level-of-detail (LOD) volume rendering algorithm for large irregular grids represented as tetrahedral meshes. One important feature of our algorithm is that it creates a space decomposition as required by I/O-efficient simplification and volume rendering, and simplifies both the internal and boundary portions of the sub-volumes progressively by edge collapses using the (extended) quadric error metric, while ensuring any selected LOD mesh to be crack-free (i.e., any neighboring sub-volumes in the LOD have consistent boundaries, and all the cells in the LOD do not have negative volumes), with all computations performed I/O-efficiently. This has been an elusive goal for out-of-core progressive meshes and LOD visualization, and our novel solution achieves this goal with a theoretical guarantee to be crack-free for tetrahedral meshes. As for selecting a desirable LOD mesh for volume rendering, our technique supports selective refinement LODs (where different places can have different error bounds), in addition to the basic uniform LODs (where the error bound is the same in all places). The proposed scalar-value range and view-dependent selection queries for selective refinement are especially effective in producing images of the highest quality with a much faster rendering speed. The experiments demonstrate the efficacy of our new technique.", "paper_title": "Out-of-Core Simplification and Crack-Free LOD Volume Rendering for Irregular Grids", "paper_id": "WOS:000280991300011"}