{"auto_keywords": [{"score": 0.04120210347957594, "phrase": "justification_shift"}, {"score": 0.006477676059641041, "phrase": "existing_routines"}, {"score": 0.004449688143230257, "phrase": "organizational_routines"}, {"score": 0.004376378707877484, "phrase": "accident_prevention"}, {"score": 0.0037527984559873745, "phrase": "vis-a_-vis_overestimation"}, {"score": 0.003600022318864217, "phrase": "\"close_calls"}, {"score": 0.0027246145918972025, "phrase": "agent-based_model"}, {"score": 0.002668524425703961, "phrase": "organizational_studies"}, {"score": 0.002602734354498382, "phrase": "space_shuttle_challenger_accident"}, {"score": 0.0021049977753042253, "phrase": "organizational_decisions"}], "paper_keywords": ["Organizational routine", " Risk", " Near miss", " Uncertainty", " Burden of proof", " Justification shift"], "paper_abstract": "Knowledge of near misses is helpful in preventing accidents, but it does not always lead to changes in organizational routines or contribute to accident prevention. In this article, the authors argue that low-probability near misses reinforce beliefs of experts and professionals in existing routines, proposing a concept of justification shift. Justification shift is underestimation of risks of known near misses vis-A -vis overestimation of reliabilities of existing routines. Consequently, signals of \"close calls\" tend to be disregarded, and accidents become more likely. When justification shift occurs, experts and professionals who want changes in routines face burden of proof about risks of those routines. Uncertainty in requirements and data may increase the burden and make justification shift more likely. To explore how justification shift occurs and how uncertainty influences the shift, the authors have developed an agent-based model based on theories in organizational studies and the case of the space shuttle Challenger accident in 1986. From the simulation using the model, it becomes clear that uncertainty does not make a difference in frequencies and degrees of justification shift. The authors also discuss implications of this finding to efforts to utilize knowledge of near misses and to further research on the efforts and organizational decisions.", "paper_title": "Justification shift and uncertainty: why are low-probability near misses underrated against organizational routines?", "paper_id": "WOS:000315359700004"}