{"auto_keywords": [{"score": 0.04354213151544684, "phrase": "dilworth_k_graphs"}, {"score": 0.015719716506582538, "phrase": "pairwise_compatibility_graphs"}, {"score": 0.008537045130238882, "phrase": "k_stars"}, {"score": 0.004778088905211055, "phrase": "dilworth_number_k."}, {"score": 0.0047415081747150065, "phrase": "dilworth_number"}, {"score": 0.004580314008293946, "phrase": "largest_subset"}, {"score": 0.004475893575036647, "phrase": "close_neighborhood"}, {"score": 0.004192730391924712, "phrase": "new_characterization"}, {"score": 0.003608732492631878, "phrase": "edge-weighted_tree_t"}, {"score": 0.003485913728272778, "phrase": "different_node"}, {"score": 0.0032777653153451265, "phrase": "weighted_distance"}, {"score": 0.003240139593712436, "phrase": "corresponding_leaves"}, {"score": 0.0029203055813347874, "phrase": "minimum_leaf_power"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graphs with Dilworth number k", " Leaf power graphs", " Minimum leaf power graphs", " Pairwise compatibility graphs"], "paper_abstract": "The Dilworth number of a graph is the size of the largest subset of its nodes in which the close neighborhood of no node contains the neighborhood of another one. In this paper we give a new characterization of Dilworth k graphs, for each value of k, exactly defining their structure. Moreover, we put these graphs in relation with pairwise compatibility graphs (PCGs), i.e. graphs on n nodes that can be generated from an edge-weighted tree T that has n leaves, each representing a different node of the graph; two nodes are adjacent in the graph if and only if the weighted distance between the corresponding leaves in T is contained between two given non-negative real numbers, m and M. When either m or M are not used to eliminate edges from G, the two subclasses leaf power and minimum leaf power graphs (LPGs and mLPGs, respectively) are defined. Here we prove that graphs that are either LPGs or mLPGs of trees obtained connecting the centers of k stars with a path are Dilworth k graphs, and the opposite is true when k = 1,2, but not when k >= 3. Finally, we show that the relations we proved between Dilworth k graphs and chains of k stars hold only for LPGs and mLPGs, but not for PCGs. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On pairwise compatibility graphs having Dilworth number k", "paper_id": "WOS:000340694000006"}