{"auto_keywords": [{"score": 0.04971747610320425, "phrase": "graph-based_analysis"}, {"score": 0.04330964116308674, "phrase": "core_document"}, {"score": 0.015719716506582538, "phrase": "document_sets"}, {"score": 0.014099373831952113, "phrase": "core_documents"}, {"score": 0.012835478062953432, "phrase": "graph_structure"}, {"score": 0.004671156704912419, "phrase": "novel_text_mining_method"}, {"score": 0.00444655284354007, "phrase": "similarity_links"}, {"score": 0.00421668332357505, "phrase": "highest_level"}, {"score": 0.004090682761004765, "phrase": "different_topic"}, {"score": 0.004013843843250455, "phrase": "centrality_scores"}, {"score": 0.0036784938661226104, "phrase": "predetermined_number"}, {"score": 0.003448705829033573, "phrase": "three-layer_structure"}, {"score": 0.0030542703032534766, "phrase": "supplemental_documents"}, {"score": 0.0026945722090537397, "phrase": "subtopic_documents"}, {"score": 0.002459810433812049, "phrase": "newspaper_articles"}, {"score": 0.0023952639120005193, "phrase": "topic_identification"}, {"score": 0.002153540857619362, "phrase": "centrality_score"}, {"score": 0.0021049977753042253, "phrase": "method's_usefulness"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a novel text mining method for a document set based on graph-based analysis. Graph-based analysis first identifies the similarity links in the document set and then determines core documents, those that have the highest level of centrality. Each core document represents a different topic. Next, the centrality scores are used together with the graph structure to identify those documents that are associated with the core documents. This process results in a predetermined number of topics. For each topic the user is presented with a set of documents in three-layer structure: core document, supplemental documents (those that are strongly associated with the core document), and subtopic documents (those that are only slightly associated with the core document and supplemental documents). The user can select any the topics and browse the documents related to that topic. Furthermore, the user can select documents according to the level; for example, subtopic documents are assumed to contain information that differs from the topic indicated and so might be interesting. In analyses of a set of newspaper articles, we evaluate \"accuracy of topic identification\" and \"accuracy of document collecting related to the topics\". Furthermore, we show an example of document set visualization based on graph structure and centrality score; the results indicate the method's usefulness for browsing and analyzing document sets.", "paper_title": "Topic structure mining for document sets using graph-based analysis", "paper_id": "WOS:000241155300032"}