{"auto_keywords": [{"score": 0.04971075098097412, "phrase": "differentially-private_mechanisms"}, {"score": 0.046342356261545876, "phrase": "differential_privacy"}, {"score": 0.04177183488565657, "phrase": "data_analyst"}, {"score": 0.027768620387285302, "phrase": "graph_symmetries"}, {"score": 0.02663955105866823, "phrase": "min-entropy_leakage"}, {"score": 0.00481495049065317, "phrase": "information_leakage"}, {"score": 0.00456159659731398, "phrase": "statistical_databases"}, {"score": 0.004304856672196293, "phrase": "single_individual"}, {"score": 0.004046843083499649, "phrase": "statistical_query"}, {"score": 0.0037170399498025215, "phrase": "true_answer"}, {"score": 0.0032592499906265882, "phrase": "individuals'_data"}, {"score": 0.003087500254099842, "phrase": "true_ones"}, {"score": 0.0027706013216537042, "phrase": "quantitative_information_flow_principles"}, {"score": 0.0026965813247045427, "phrase": "oblivious_differentially-private_mechanisms"}, {"score": 0.0025842289219860795, "phrase": "adjacency_relation"}, {"score": 0.002382541887825168, "phrase": "identity_gain_functions"}, {"score": 0.0021049977753042253, "phrase": "required_level"}], "paper_keywords": ["Differential privacy", " information flow", " min-entropy leakage", " gain functions", " optimal mechanisms"], "paper_abstract": "Differential privacy aims at protecting the privacy of participants in statistical databases. Roughly, a mechanism satisfies differential privacy if the presence or value of a single individual in the database does not significantly change the likelihood of obtaining a certain answer to any statistical query posed by a data analyst. Differentially-private mechanisms are often oblivious: first the query is processed on the database to produce a true answer, and then this answer is adequately randomized before being reported to the data analyst. Ideally, a mechanism should minimize leakage i.e., obfuscate as much as possible the link between reported answers and individuals' data while maximizing utility i.e., report answers as similar as possible to the true ones. These two goals, however, are in conflict with each other, thus imposing a trade-off between privacy and utility. In this paper we use quantitative information flow principles to analyze leakage and utility in oblivious differentially-private mechanisms. We introduce a technique that exploits graph symmetries of the adjacency relation on databases to derive bounds on the min-entropy leakage of the mechanism. We consider a notion of utility based on identity gain functions, which is closely related to min-entropy leakage, and we derive bounds for it. Finally, given some graph symmetries, we provide a mechanism that maximizes utility while preserving the required level of differential privacy.", "paper_title": "On the information leakage of differentially-private mechanisms", "paper_id": "WOS:000364176400001"}