{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_location_tasks"}, {"score": 0.011328424034649658, "phrase": "feature_location_process"}, {"score": 0.004404994123834589, "phrase": "source_code"}, {"score": 0.004312622975366676, "phrase": "specific_feature"}, {"score": 0.004276216827737399, "phrase": "software_maintenance_tasks"}, {"score": 0.004133627071344356, "phrase": "feature_location"}, {"score": 0.004098725744818192, "phrase": "software_engineering"}, {"score": 0.0040298010803060495, "phrase": "human-intensive_and_knowledge-intensive_process"}, {"score": 0.0036864465771943933, "phrase": "better_understanding"}, {"score": 0.0034886660821793576, "phrase": "exploratory_study"}, {"score": 0.003315499339103866, "phrase": "unfamiliar_systems"}, {"score": 0.003245900020944865, "phrase": "six_feature_location_tasks"}, {"score": 0.002870006736445581, "phrase": "feature_location_phases"}, {"score": 0.0027390682208834013, "phrase": "junior_developers"}, {"score": 0.0025810006125483835, "phrase": "external_factors"}, {"score": 0.0023408288327263316, "phrase": "different_feature_location_patterns"}, {"score": 0.00227225841515826, "phrase": "new_opportunities"}, {"score": 0.0022434880661725493, "phrase": "location_research"}, {"score": 0.0021870332034407817, "phrase": "better_tool_support"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["feature location", " human study", " cognitive process", " conceptual framework"], "paper_abstract": "Developers often have to locate the parts of source code that contribute to a specific feature during software maintenance tasks. This activity, referred to as feature location in software engineering, is a human-intensive and knowledge-intensive process. Researchers have investigated (semi-)automatic analysis-based techniques to assist developers in such feature location activities. However, little work has been carried out on better understanding how developers perform feature location tasks. In this paper, we report an exploratory study of feature location process, consisting of three experiments in which developers were given unfamiliar systems and asked to complete six feature location tasks. Our study suggests that feature location process can be understood hierarchically at three levels of granularity: phase, pattern, and action. Furthermore, our statistical analysis shows that these feature location phases, patterns, and actions can be effectively imparted to junior developers and consequently improve their performance on feature location tasks. Our qualitative observations and interviews also suggest that external factors, for example, human factors, task properties, and in-process feedbacks, affect the choices and usage of different feature location patterns and actions. Our results open up new opportunities to feature location research, which could lead to better tool support and more rigorous feature location process. Copyright (C) 2013 John Wiley & Sons, Ltd.", "paper_title": "How developers perform feature location tasks: a human-centric and process-oriented exploratory study", "paper_id": "WOS:000328453100004"}