{"auto_keywords": [{"score": 0.032984709714821696, "phrase": "epistemic_expectation_models"}, {"score": 0.02898150287642892, "phrase": "epistemic_protocols"}, {"score": 0.004732215871738028, "phrase": "evolving_world"}, {"score": 0.004339293854115301, "phrase": "future_observations"}, {"score": 0.004071957673937727, "phrase": "expected_ones"}, {"score": 0.0034233569308012982, "phrase": "semantics-driven_logical_framework"}, {"score": 0.003066945490483524, "phrase": "propositional_dynamic_logic-style_epistemic_logic"}, {"score": 0.002945175711537758, "phrase": "agents'_expectations"}, {"score": 0.0025780134737796085, "phrase": "effective_equivalence"}, {"score": 0.0024756080101497086, "phrase": "new_logic"}, {"score": 0.0021543421286324945, "phrase": "fact-changing_actions"}, {"score": 0.0021049977753042253, "phrase": "worked-out_example"}], "paper_keywords": ["Protocols", " Dynamic epistemic logic", " Guarded automata"], "paper_abstract": "When agents know a protocol, this leads them to have expectations about future observations. Agents can update their knowledge by matching their actual observations with the expected ones. They eliminate states where they do not match. In this paper, we study how agents perceive protocols that are not commonly known, and propose a semantics-driven logical framework to reason about knowledge in such scenarios. In particular, we introduce the notion of epistemic expectation models and a propositional dynamic logic-style epistemic logic for reasoning about knowledge via matching agents' expectations to their observations. It is shown how epistemic expectation models can be obtained from epistemic protocols. Furthermore, a characterization is presented of the effective equivalence of epistemic protocols. We introduce a new logic that incorporates updates of protocols and that can model reasoning about knowledge and observations. Finally, the framework is extended to incorporate fact-changing actions, and a worked-out example is given. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Hidden protocols: Modifying our expectations in an evolving world", "paper_id": "WOS:000332055000002"}