{"auto_keywords": [{"score": 0.03787125599650899, "phrase": "rbf-neat"}, {"score": 0.03267271007380886, "phrase": "reactive_control"}, {"score": 0.00481495049065317, "phrase": "reactive_control_and_high-level_strategy"}, {"score": 0.004390312150344245, "phrase": "resource_optimization"}, {"score": 0.004349955692802962, "phrase": "robot_control"}, {"score": 0.004270347498153512, "phrase": "state-of-the-art_neuroevolution_algorithms"}, {"score": 0.004077616905584829, "phrase": "surprising_difficulty"}, {"score": 0.0038756055612167942, "phrase": "desired_actions"}, {"score": 0.0037696519417841287, "phrase": "previous_work"}, {"score": 0.0035663245542174224, "phrase": "cascade-neat_algorithms"}, {"score": 0.0032968474833776906, "phrase": "relatively_unrestricted_algorithms"}, {"score": 0.0031479142819948007, "phrase": "best_performance"}, {"score": 0.0030196181347744372, "phrase": "single_algorithm"}, {"score": 0.0028172726995962173, "phrase": "snap-neat"}, {"score": 0.0027784560880013886, "phrase": "adaptive_operator_selection"}, {"score": 0.0024409345168575833, "phrase": "high-level_strategy"}, {"score": 0.0021049977753042253, "phrase": "wide_variety"}], "paper_keywords": ["Control", " fracture", " NEAT", " neuroevolution", " strategy"], "paper_abstract": "One promising approach to general-purpose artificial intelligence is neuroevolution, which has worked well on a number of problems from resource optimization to robot control. However, state-of-the-art neuroevolution algorithms like neuroevolution of augmenting topologies (NEAT) have surprising difficulty on problems that are fractured, i.e., where the desired actions change abruptly and frequently. Previous work demonstrated that bias and constraint (e. g., RBF-NEAT and Cascade-NEAT algorithms) can improve learning significantly on such problems. However, experiments in this paper show that relatively unrestricted algorithms (e. g., NEAT) still yield the best performance on problems requiring reactive control. Ideally, a single algorithm would be able to perform well on both fractured and unfractured problems. This paper introduces such an algorithm called SNAP-NEAT that uses adaptive operator selection to integrate strengths of NEAT, RBF-NEAT, and Cascade-NEAT. SNAP-NEAT is evaluated empirically on a set of problems ranging from reactive control to high-level strategy. The results show that SNAP-NEAT can adapt intelligently to the type of problem that it faces, thus laying the groundwork for learning algorithms that can be applied to a wide variety of problems.", "paper_title": "An Integrated Neuroevolutionary Approach to Reactive Control and High-Level Strategy", "paper_id": "WOS:000307334400002"}