{"auto_keywords": [{"score": 0.02963516792870055, "phrase": "wctl"}, {"score": 0.02945927612118461, "phrase": "external_cost_variables"}, {"score": 0.022406833231488028, "phrase": "lncs"}, {"score": 0.021875874469107947, "phrase": "berlin"}, {"score": 0.018192713386613987, "phrase": "bouyer_et_al"}, {"score": 0.007815846025250362, "phrase": "sci"}, {"score": 0.006933435252341466, "phrase": "model_checking_problem"}, {"score": 0.006200543828529758, "phrase": "single_clock"}, {"score": 0.0051218927218725984, "phrase": "wirta"}, {"score": 0.00481495049065317, "phrase": "weighted_integer_reset_timed_automata"}, {"score": 0.0047083693020511805, "phrase": "alur_et_al"}, {"score": 0.004548295422372749, "phrase": "springer"}, {"score": 0.004209683890405042, "phrase": "alur"}, {"score": 0.004192572610101846, "phrase": "dill"}, {"score": 0.003944112858235306, "phrase": "real_time_systems"}, {"score": 0.003928140049720516, "phrase": "weighted"}, {"score": 0.0037037351634663686, "phrase": "lett"}, {"score": 0.003126623133221065, "phrase": "weighted_timed_automata"}, {"score": 0.0024882810071079797, "phrase": "wirta."}, {"score": 0.0022287497627555895, "phrase": "restricted_version"}, {"score": 0.0021222484134796986, "phrase": "wta"}], "paper_keywords": ["Weighted timed automata", " Weighted CTL", " Model checking", " Integer resets", " Clock reduction"], "paper_abstract": "Weighted timed automata (WTA), introduced in Alur et al. (Proceedings of HSCC'01, LNCS, vol. 2034, pp. 49-62, Springer, Berlin, 2001), Behrmann et al. (Proceedings of HSCC'01, LNCS, vol. 2034, pp. 147-161, Springer, Berlin, 2001) are an extension of Alur and Dill (Theor. Comput. Sci. 126(2): 183-235, 1994) timed automata, a widely accepted formalism for the modelling and verification of real time systems. Weighted timed automata extend timed automata by allowing costs on the locations and edges. There has been a lot of interest Bouyer et al. (Inf. Process. Lett. 98(5): 188-194, 2006), Bouyer et al. (Log. Methods Comput. Sci. 4(2): 9, 2008), Brihaye et al. (Proceedings of FORMATS/FTRTFT'04, LNCS, vol. 3253, pp. 277-292, Springer, Berlin, 2004), Brihaye et al. (Inf. Comput. 204(3): 408-433, 2006) in studying the model checking problem of weighted timed automata. The properties of interest are written using logic weighted CTL (WCTL), an extension of CTL with costs. It has been shown Bouyer et al. (Log. Methods Comput. Sci. 4(2): 9, 2008) that the problem of model checking WTAs with a single clock using WCTL with no external cost variables is decidable, while 3 clocks render the problem undecidable Bouyer et al. (Inf. Process. Lett. 98(5): 188-194, 2006). The question of 2 clocks is open. In this paper, we introduce a subclass of weighted timed automata called weighted integer reset timed automata (WIRTA) and study the model checking problem. We give a clock reduction technique for WIRTA. Given a WIRTA A with n >= 1 clocks, we show that a single clock WIRTA A' preserving the paths and costs of A can be obtained. This gives us the decidability of model checking WIRTA with n >= 1 clocks and m >= 1 costs using WCTL with no external cost variables. We then show that for a restricted version of WCTL with external cost variables, the model checking problem is undecidable for WIRTA with 3 stopwatch costs and 1 clock. Finally, we show that model checking WTA with 2 clocks and 1 stopwatch cost against WCTL with no external cost variables is undecidable, thereby answering a question that has remained long open.", "paper_title": "Model Checking Weighted Integer Reset Timed Automata", "paper_id": "WOS:000287199100011"}