{"auto_keywords": [{"score": 0.04693585881980029, "phrase": "bayes_estimation"}, {"score": 0.011472359439069825, "phrase": "ml_estimation"}, {"score": 0.00985833351699506, "phrase": "vb_approach"}, {"score": 0.008871872788579722, "phrase": "generalization_error"}, {"score": 0.00481495049065317, "phrase": "variational_bayes"}, {"score": 0.00475413908468027, "phrase": "linear_neural_networks"}, {"score": 0.004556901872357751, "phrase": "unidentifiable_models"}, {"score": 0.004404994123834589, "phrase": "maximum_likelihood"}, {"score": 0.00422218060227958, "phrase": "markov_chain_monte_carlo_methods"}, {"score": 0.004186534737631288, "phrase": "huge_computational_costs"}, {"score": 0.004064117897000019, "phrase": "tractable_approximation_method"}, {"score": 0.003670843919846253, "phrase": "expectation_maximization"}, {"score": 0.0031242709509664837, "phrase": "simplest_unidentifiable_models"}, {"score": 0.0029191527226078286, "phrase": "three-layer_linear_neural_networks"}, {"score": 0.0027978304423349246, "phrase": "positive-part_james-stein_type_shrinkage_estimation"}, {"score": 0.0026701760128830573, "phrase": "training_error"}, {"score": 0.0023408288327263316, "phrase": "free_energy"}, {"score": 0.002205692205167157, "phrase": "typical_cases"}, {"score": 0.002177762848946681, "phrase": "vb_free_energy_well"}, {"score": 0.0021049977753042253, "phrase": "vb_generalization_error"}], "paper_keywords": [""], "paper_abstract": "It is well known that in unidentifiable models, the Bayes estimation provides much better generalization performance than the maximum likelihood (ML) estimation. However, its accurate approximation by Markov chain Monte Carlo methods requires huge computational costs. As an alternative, a tractable approximation method, called the variational Bayes (VB) approach, has recently been proposed and has been attracting attention. Its advantage over the expectation maximization (EM) algorithm, often used for realizing the ML estimation, has been experimentally shown in many applications; nevertheless, it has not yet been theoretically shown. In this letter, through analysis of the simplest unidentifiable models, we theoretically show some properties of the VB approach. We first prove that in three-layer linear neural networks, the VB approach is asymptotically equivalent to a positive-part James-Stein type shrinkage estimation. Then we theoretically clarify its free energy, generalization error, and training error. Comparing them with those of the ML estimation and the Bayes estimation, we discuss the advantage of the VB approach. We also show that unlike in the Bayes estimation, the free energy and the generalization error are less simply related with each other and that in typical cases, the VB free energy well approximates the Bayes one, while the VB generalization error significantly differs from the Bayes one.", "paper_title": "Variational Bayes solution of linear neural networks and its generalization performance", "paper_id": "WOS:000245244200012"}