{"auto_keywords": [{"score": 0.0486868426803837, "phrase": "knuth"}, {"score": 0.010958091421510125, "phrase": "bassetti"}, {"score": 0.01088709488772812, "phrase": "diaconis"}, {"score": 0.010034893716769529, "phrase": "relative_variance"}, {"score": 0.008749623996006012, "phrase": "average_length"}, {"score": 0.004392565073466714, "phrase": "side_k."}, {"score": 0.003607630811220324, "phrase": "analogous_rosenbluth_algorithm"}, {"score": 0.0035605741849764187, "phrase": "unconfined_self-avoiding_walks"}, {"score": 0.0034569210133272845, "phrase": "corresponding_estimator"}, {"score": 0.003091767402370757, "phrase": "north_and_east_steps"}, {"score": 0.0028294913294680227, "phrase": "east"}, {"score": 0.002547043222086858, "phrase": "partial_results"}, {"score": 0.0022928018832993387, "phrase": "knuth's_algorithm"}, {"score": 0.0022703060319871713, "phrase": "basic_example"}, {"score": 0.0022480304016499605, "phrase": "widely_used_technique"}, {"score": 0.0021968983291791784, "phrase": "present_paper"}], "paper_keywords": [""], "paper_abstract": "In a 1976 paper published in Science, Knuth presented an algorithm to sample (non-uniform) self-avoiding walks crossing a square of side k. From this sample, he constructed an estimator for the number of such walks. The quality of this estimator is directly related to the (relative) variance of a certain random variable X-k. From his experiments, Knuth suspected that this variance was extremely large (so that the estimator would not be very efficient). But how large? For the analogous Rosenbluth algorithm, which samples unconfined self-avoiding walks of length n, the variance of the corresponding estimator is believed to be exponential in n. A few years ago, Bassetti and Diaconis showed that, for a sampler a la Knuth that generates walks crossing a k x k square and consisting of North and East steps, the relative variance is only O(root k). In this note we take one step further and show that, for walks consisting of North, South and East steps, the relative variance jumps to 2(k(k+1))/(k + 1)(2k). This is exponential in the average length of the walks, which is of order k(2). We also obtain partial results for general self-avoiding walks crossing a square, suggesting that the relative variance could be exponential in k(2) (which is again the average length of these walks). Knuth's algorithm is a basic example of a widely used technique called sequential importance sampling. The present paper, following the paper by Bassetti and Diaconis, is one of very few examples where the variance of the estimator can be found.", "paper_title": "On the Importance Sampling of Self-Avoiding Walks", "paper_id": "WOS:000343754700006"}