{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "leakage_power_reduction"}, {"score": 0.004783105609960904, "phrase": "process-induced_mechanical_stress"}, {"score": 0.004704407458864224, "phrase": "carrier_transport"}, {"score": 0.004596390584582711, "phrase": "current_complementary_metal-oxide-semiconductor_technologies"}, {"score": 0.004446349752828045, "phrase": "layout_dependence"}, {"score": 0.0044169318855693356, "phrase": "stress_enhancement"}, {"score": 0.0041469500929423595, "phrase": "stress-optimized_layouts"}, {"score": 0.004024863549087511, "phrase": "optimal_power-performance_tradeoffs"}, {"score": 0.0039323878878973284, "phrase": "channel_stress"}, {"score": 0.003854809457075099, "phrase": "layout_parameters"}, {"score": 0.003816593863814444, "phrase": "active_area_length"}, {"score": 0.0037913267098534887, "phrase": "contact_placement"}, {"score": 0.003728885511755734, "phrase": "layout-dependent_sources"}, {"score": 0.003547642961654828, "phrase": "mechanical_stress"}, {"score": 0.0034431390653713173, "phrase": "stress-based_performance_enhancement"}, {"score": 0.003341703245432554, "phrase": "stress-altering_layout_properties"}, {"score": 0.003286642683771891, "phrase": "standard_cells"}, {"score": 0.0032004205378150354, "phrase": "\"dual-stress\"_standard_cell_layouts"}, {"score": 0.0030246125031350903, "phrase": "current_differences"}, {"score": 0.002792683583705368, "phrase": "\"dual-stress\"_assignment"}, {"score": 0.002461199256106623, "phrase": "exponential_leakage_penalty"}, {"score": 0.002287542098172185, "phrase": "higher_performance_circuits"}, {"score": 0.002133196554995389, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "small_area_penalty"}], "paper_keywords": ["Layout", " leakage", " mobility", " performance", " stress"], "paper_abstract": "Process-induced mechanical stress is used to enhance carrier transport and achieve higher drive currents in current complementary metal-oxide-semiconductor technologies. This paper explores how to fully exploit the layout dependence of stress enhancement and proposes a circuit-level, block-based, stress-enhanced optimization algorithm that uses stress-optimized layouts in conjunction with dual-V(th) assignment to achieve optimal power-performance tradeoffs. We begin by studying how channel stress and drive current depend on layout parameters such as active area length and contact placement, while considering all layout-dependent sources of mechanical stress in a 65 nm industrial process. We then investigate the three main layout properties that impact mechanical stress in this process and discuss how to improve stress-based performance enhancement in standard cell libraries. While varying the stress-altering layout properties of a number of standard cells in a 65 nm industrial library, we show that \"dual-stress\" standard cell layouts (analogous to \"dual-V(th)\") can be designed to achieve drive current differences up to similar to 14% while incurring less than half the leakage penalty of dual-V(th). Therefore, when the flexibility of \"dual-stress\" assignment is combined with dual-V(th) assignment (within the proposed joint optimization framework), simulation results for a set of benchmark circuits show that leakage is reduced by similar to 24% on average, for iso-delay, when compared to dual-V(th) assignment. Since mobility enhancement does not incur the exponential leakage penalty associated with V(th) assignment, our optimization technique is ideal for leakage power reduction. However, our framework can also be used to achieve higher performance circuits for iso-leakage and our joint optimization framework can be used to reduce delay on average by similar to 5%. In both cases, the proposed method only incurs a small area penalty (<0.5%).", "paper_title": "Mechanical Stress Aware Optimization for Leakage Power Reduction", "paper_id": "WOS:000278502500006"}