{"auto_keywords": [{"score": 0.04054883484719913, "phrase": "postcoordinated_systems"}, {"score": 0.03498419501791243, "phrase": "information_providers"}, {"score": 0.00481495049065317, "phrase": "old_question"}, {"score": 0.004603525341738782, "phrase": "long-standing_issues"}, {"score": 0.0035794251590584563, "phrase": "highly_skilled_intellectual_work"}, {"score": 0.003071965703296204, "phrase": "known_information_retrieval_models"}, {"score": 0.002820319063320601, "phrase": "exact_manner"}, {"score": 0.0026720866990543744, "phrase": "information_retrieval_systems"}, {"score": 0.0024641814990854463, "phrase": "postcoordinated_system"}, {"score": 0.0023557346035701096, "phrase": "subject_authority_file"}, {"score": 0.002292965705677312, "phrase": "information_retrieval_system"}, {"score": 0.0021049977753042253, "phrase": "literature_review"}], "paper_keywords": ["Information retrieval", " Classification schemes", " Indexing"], "paper_abstract": "Purpose - This paper aims to discuss some long-standing issues of the development of a subject heading language as pre- or postcoordinated. Design/methodology/approach - In a review of literature on pre- and postcoordination and user behaviour, 20 criteria originally discussed by Svenonius are considered. Findings - The advantages and disadvantages of pre- and postcoordinated systems are on a very similar level. Most subject heading languages developed recently are precoordinated. They all require investments in highly skilled intellectual work, and are therefore expensive and difficult to maintain. Postcoordinated systems seem to have more advantages for information providers, but less for users. However, most of these disadvantages could be overcome by known information retrieval models and techniques. Research limitations/implications - The criteria originally discussed by Svenonius are difficult to evaluate in an exact manner. Some of them are also irrelevant because of changes in information retrieval systems. Practical implications - It was found that the decision on whether to use a pre- or postcoordinated system cannot be taken independent of consideration of the subject authority file and the functions of an information retrieval system, which should support users on one hand and information providers and indexers on the other. Originality/value - This literature review brings together some findings that have not been considered together previously.", "paper_title": "Precoordination or not? A new view of the old question", "paper_id": "WOS:000271117900006"}