{"auto_keywords": [{"score": 0.033196982587530136, "phrase": "brute-force_attacks"}, {"score": 0.024128454305129176, "phrase": "proposed_model"}, {"score": 0.011166111391324255, "phrase": "biometric_systems"}, {"score": 0.007778865015028015, "phrase": "palmprint_system"}, {"score": 0.00481495049065317, "phrase": "brute-force_break-ins"}, {"score": 0.004518442937844318, "phrase": "biometric_authentication_systems"}, {"score": 0.004240116703465252, "phrase": "inherent_advantages"}, {"score": 0.0041637779492720295, "phrase": "classical_knowledge-based_and_token-based_personal-identification_approaches"}, {"score": 0.0036998728605395384, "phrase": "biometric_traits"}, {"score": 0.002816556934231128, "phrase": "security_systems"}, {"score": 0.00266693888510356, "phrase": "projected_multinomial_distribution"}], "paper_keywords": ["brute-force attack", " palmprint", " passwords", " secure authentication"], "paper_abstract": "Biometric authentication systems are widely applied because they offer inherent advantages over classical knowledge-based and token-based personal-identification approaches. This has led to the development of products using palmprints as biometric traits and their use in several real applications. However, as biometric systems are vulnerable to replay, database, and brute-force attacks, such potential attacks must be analyzed before biometric systems are massively deployed in security systems. This correspondence proposes a projected multinomial distribution for studying the probability of successfully using brute-force attacks to break into a palmprint system. To validate the proposed model, we have conducted a simulation. Its results demonstrate that the proposed model can accurately estimate the probability. The proposed model indicates that it is computationally infeasible to break into the palmprint system using brute-force attacks.", "paper_title": "Analysis of brute-force break-ins of a palmprint authentication system", "paper_id": "WOS:000240756700020"}