{"auto_keywords": [{"score": 0.027120551825161217, "phrase": "performance_assessment"}, {"score": 0.00481495049065317, "phrase": "dependence-based_interval-valued_evidential_reasoning_approach"}, {"score": 0.004625255533545965, "phrase": "evidential_reasoning"}, {"score": 0.004482873744893272, "phrase": "multiple_attribute_decision_analysis_problems"}, {"score": 0.004306205029641728, "phrase": "real_situations"}, {"score": 0.003278447235176858, "phrase": "denoeux"}, {"score": 0.0031210475158175432, "phrase": "belief_functions"}, {"score": 0.0030932495918679285, "phrase": "dependent_sources"}, {"score": 0.0030248298759040695, "phrase": "nonlinear_optimization_problems"}, {"score": 0.002984504445973107, "phrase": "relative_weights"}, {"score": 0.0028795712616923462, "phrase": "cautious_rule"}, {"score": 0.002841176824012961, "phrase": "dependent_attributes"}, {"score": 0.0027047434737824463, "phrase": "bsc"}, {"score": 0.0025178072071268534, "phrase": "uncertain_environment"}, {"score": 0.0024292428060702803, "phrase": "sensors_department"}, {"score": 0.0023968383387667404, "phrase": "manufacturing_company"}, {"score": 0.0021526564019119466, "phrase": "dier-bsc."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evidential reasoning approach", " Dependent attributes", " Non-dogmatic interval-valued belief structure", " Balanced scorecard", " Performance assessment"], "paper_abstract": "The evidential reasoning (ER) approach can model multiple attribute decision analysis problems with both quantitative and qualitative attributes under the uncertain environment. In real situations, however, giving precise (crisp) assessments for alternatives is often too restrictive and difficult for experts, due to the incompleteness or the lack of information, knowledge and data. And there may be dependence among attributes which is difficult to mathematically model or ill known. To deal with these situations, this paper develops a dependence-based interval-valued ER (shortly called DIER) approach based on Denoeux's cautious conjunctive rule which is an operator to combine belief functions from dependent sources. A pair of nonlinear optimization problems considering the relative weights of attributes is constructed based on the cautious rule to aggregate dependent attributes. Furthermore, due to the dependence of balanced scorecard (BSC) perspectives, the combination of DIER approach with BSC, called the DIER-BSC, is formed to implement the performance assessment under the uncertain environment. Finally, the performance assessment of the sensors department in a manufacturing company, which provides oxygen supplying and cooling devices for aviation, is demonstrated as an example to verify the validity and usefulness of DIER-BSC. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The combination of dependence-based interval-valued evidential reasoning approach with balanced scorecard for performance assessment", "paper_id": "WOS:000297823300156"}