{"auto_keywords": [{"score": 0.0346221056629987, "phrase": "minimal_query"}, {"score": 0.018799319997692365, "phrase": "original_query"}, {"score": 0.01270182266907353, "phrase": "linear_path_query"}, {"score": 0.008439060527793127, "phrase": "xpath_queries"}, {"score": 0.006338727809222011, "phrase": "xml_data"}, {"score": 0.004926286978401495, "phrase": "schema_label_sequence"}, {"score": 0.00481495049065317, "phrase": "minimality_guarantee"}, {"score": 0.004767546015485477, "phrase": "wide_use"}, {"score": 0.00474402317914951, "phrase": "xpath"}, {"score": 0.004573948958114746, "phrase": "iterative_subsequence_generation"}, {"score": 0.004515004397496303, "phrase": "considerable_effort"}, {"score": 0.004393772952058521, "phrase": "query_processing"}, {"score": 0.004286377415760952, "phrase": "research_work"}, {"score": 0.003999376003434231, "phrase": "integrity_constraints"}, {"score": 0.003834548373258131, "phrase": "xpath_query"}, {"score": 0.0037873702600771286, "phrase": "existing_constraint-independent_minimization_methods"}, {"score": 0.0035600143547053287, "phrase": "dataguide"}, {"score": 0.003421697038352743, "phrase": "linear_path_queries"}, {"score": 0.0033963651718225784, "phrase": "top-down_fashion"}, {"score": 0.00301556616039134, "phrase": "bottom-up_approach"}, {"score": 0.0024793019587009035, "phrase": "shortest_schema_label_sequence"}, {"score": 0.002442693254693416, "phrase": "bottom-up_fashion"}, {"score": 0.0022901862321082407, "phrase": "extended_algorithm"}, {"score": 0.0022507751993132543, "phrase": "tree_pattern_query"}, {"score": 0.002157857111130435, "phrase": "full-fledged_object-relational_dbms."}, {"score": 0.0021312639231739175, "phrase": "real_and_synthetic_data_sets"}], "paper_keywords": ["XML query minimization", " structural summary", " minimality guarantee"], "paper_abstract": "Due to wide use of XPath, the problem of efficiently processing XPath queries has recently received a lot of attention. In particular, a considerable effort has been devoted to minimizing XPath queries since the efficiency of query processing greatly depends on the size of the query. Research work in this area can be classified into two categories: constraint-independent minimization and constraint-dependent minimization. The former minimizes queries in the absence of integrity constraints while the latter in the presence of them. For a linear path query, which is an XPath query without branching predicates, existing constraint-independent minimization methods are generally known to be unable to minimize the query without processing the query itself. Most recently, however, by using the DataGuide, a representative structural summary of XML data, a constraint-independent method that minimizes linear path queries in a top-down fashion has been proposed. Nevertheless, this method can fail to find a minimal query since it minimizes a query by merely erasing labels from the original query whereas a minimal query could include labels that are not present in the original query. In this paper, we propose a bottom-up approach called XMin that guarantees finding a minimal query for a given tree pattern query by using the DataGuide without processing the query itself. For the linear path query, we first show that the sequence of labels occurring in the minimal query is a subsequence of every schema label sequence that matches the original query. Here, the schema label sequence for a node is the sequence of labels from the root of XML data to the node. We then propose iterative subsequence generation that iteratively generates subsequences from the shortest schema label sequence matching the original query in a bottom-up fashion and tests query equivalence. Using iterative subsequence generation, we can always find a minimal query and we formally prove this guarantee. We also propose an extended algorithm that guarantees the minimality for the tree pattern query, which is a linear path query with branching predicates. These methods have been prototyped in a full-fledged object-relational DBMS. The experimental results using real and synthetic data sets show the practicality of our method.", "paper_title": "XMin: Minimizing Tree Pattern Queries with Minimality Guarantee", "paper_id": "WOS:000278585500005"}