{"auto_keywords": [{"score": 0.048540508174724384, "phrase": "image_quality"}, {"score": 0.015719716506582538, "phrase": "ultrasound_imaging"}, {"score": 0.01556813651977489, "phrase": "carotid_artery"}, {"score": 0.01531869387692547, "phrase": "speckle_reduction_filtering"}, {"score": 0.012213501346098677, "phrase": "visual_perception_evaluation"}, {"score": 0.01062342049553075, "phrase": "speckle_reduction"}, {"score": 0.004584769330512473, "phrase": "ultrasound_images"}, {"score": 0.004422962383171667, "phrase": "atherosclerotic_disease"}, {"score": 0.004308867448768012, "phrase": "telemedicine_channel"}, {"score": 0.0040760539694352236, "phrase": "image_quality_evaluation"}, {"score": 0.004036289523702633, "phrase": "image_quality_metrics"}, {"score": 0.0040099947738626495, "phrase": "visual_perception"}, {"score": 0.0037932682371685433, "phrase": "statistical_and_texture_features"}, {"score": 0.003768550679591666, "phrase": "image_quality_evaluation_metrics"}, {"score": 0.0035882128312414046, "phrase": "carotid_bifurcation"}, {"score": 0.003472792830360684, "phrase": "hdi"}, {"score": 0.0030769984573533844, "phrase": "nds"}, {"score": 0.0029392523663327253, "phrase": "nds_images"}, {"score": 0.0029200834042804333, "phrase": "better_statistical_and_texture_analysis_results"}, {"score": 0.002844646030750337, "phrase": "better_image_quality_evaluation_results"}, {"score": 0.0026731799329374768, "phrase": "nf-ds_images"}, {"score": 0.0025120232221781825, "phrase": "considerable_higher_entropy"}, {"score": 0.002391670093694849, "phrase": "visual_evaluation"}, {"score": 0.002139742163351676, "phrase": "ultrasound_image_normalization"}, {"score": 0.0021049977753042253, "phrase": "important_preprocessing_steps"}], "paper_keywords": ["image quality", " speckle reduction filtering", " ultrasound imaging", " texture analysis", " carotid artery"], "paper_abstract": "Image quality is important when evaluating ultrasound images of the carotid for the assessment of the degree of atherosclerotic disease, or when transferring images through a telemedicine channel, and/or in other image processing tasks. The objective of this study was to investigate the usefulness of image quality evaluation based on image quality metrics and visual perception, in ultrasound imaging of the carotid artery after normalization and speckle reduction filtering. Image quality was evaluated based on statistical and texture features, image quality evaluation metrics, and visual perception evaluation made by two experts. These were computed on 80 longitudinal ultrasound images of the carotid bifurcation recorded from two different ultrasound scanners, the HDI ATL-3000 and the HDI ATL-5000 scanner, before (NF) and after (DS) speckle reduction filtering, after normalization (N), and after normalization and speckle reduction filtering (NDS). The results of this study showed that: (1) the normalized speckle reduction, NDS, images were rated visually better on both scanners; (2) the NDS images showed better statistical and texture analysis results on both scanners; (3) better image quality evaluation results were obtained between the original (NF) and normalized (N) images, i.e. NF-N, for both scanners, followed by the NF-DS images for the ATL HDI-5000 scanner and the NF-DS on the HDI ATL-3000 scanner; (4) the ATL HDI-5000 scanner images have considerable higher entropy than the ATL HDI-3000 scanner and thus more information content. However, based on the visual evaluation by the two experts, both scanners were rated similarly. The above findings are also in agreement with the visual perception evaluation, carried out by the two vascular experts. The results of this study showed that ultrasound image normalization and speckle reduction filtering are important preprocessing steps favoring image quality, and should be further investigated.", "paper_title": "Quality evaluation of ultrasound imaging in the carotid artery based on normalization and speckle reduction filtering", "paper_id": "WOS:000240032500007"}