{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "parent-child_communication"}, {"score": 0.004644146045859622, "phrase": "significant_number"}, {"score": 0.00441909542037375, "phrase": "five_children"}, {"score": 0.004339979174946844, "phrase": "qualitative_understanding"}, {"score": 0.00389404213807752, "phrase": "strong_need"}, {"score": 0.0037052054802048707, "phrase": "residential_parent"}, {"score": 0.0027867539356701302, "phrase": "audio-only_communication"}, {"score": 0.002687702958515561, "phrase": "phone_conversation"}, {"score": 0.0025341792091114184, "phrase": "shared_activities"}, {"score": 0.0021826210858934933, "phrase": "young_children"}, {"score": 0.002162951519368368, "phrase": "divorced_families"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Divorce", " Parents", " Children"], "paper_abstract": "Divorce affects a significant number of children and parents worldwide. We interviewed 10 parents and five children to get a qualitative understanding of the challenges faced by these families and the role of technology in maintaining contact. We found that both parents had a strong need to maintain autonomy in raising the child, though the residential parent had more opportunities to be instrumentally involved. Both parents and children sought to manage tensions between the two households-parents by reducing interruption of the other household, children by trying to keep contact with the other parent as private as possible. Our participants used the telephone as the primary means to stay in touch while apart but expressed dissatisfaction with the limits of audio-only communication. It was difficult to keep a phone conversation engaging-both parents and children instead sought ways to maintain contact through shared activities and routines but found little technological support to do so white separated. Situated in these results, we present implications for design that may aid in creating technologies for communication between parents and young children in divorced families. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Supporting parent-child communication in divorced families", "paper_id": "WOS:000262152900007"}