{"auto_keywords": [{"score": 0.043088061205824806, "phrase": "system_support"}, {"score": 0.010612387000973441, "phrase": "adaptable_and_adaptive_approaches"}, {"score": 0.006138979317913172, "phrase": "collaborative_menus"}, {"score": 0.005862409609102019, "phrase": "user_control"}, {"score": 0.0047051051659828275, "phrase": "collaborative_menu"}, {"score": 0.004597754207658615, "phrase": "different_user-system_collaboration_models"}, {"score": 0.004472146692254812, "phrase": "menu_interface"}, {"score": 0.004290112502811656, "phrase": "mobile_phone_menu"}, {"score": 0.004058826900076531, "phrase": "user_adaptation"}, {"score": 0.003911578552479064, "phrase": "system_adaptation"}, {"score": 0.0034368818187904744, "phrase": "prototype_mobile_phone_menu"}, {"score": 0.003281643474564305, "phrase": "menu_items"}, {"score": 0.0028303313661029597, "phrase": "controlled_experiment"}, {"score": 0.0028042741141125712, "phrase": "different_types"}, {"score": 0.0026284507395498897, "phrase": "twenty_participants"}, {"score": 0.0026042472337367015, "phrase": "menu_selection_tasks"}, {"score": 0.002498053212249228, "phrase": "subjective_measures"}, {"score": 0.0022772782536385717, "phrase": "user_performance"}, {"score": 0.0021049977753042253, "phrase": "selection_frequency_distribution"}], "paper_keywords": [""], "paper_abstract": "This article examines different user-system collaboration models in the adaptation of a menu interface. Four collaboration models were implemented on a prototype of mobile phone menu: (a) basic collaboration with no system support (for user adaptation) and no user control (over system adaptation), (b) system support only, (c) user control only, and (d) system support plus user control. The prototype mobile phone menu includes a hotlist (a quickly accessible collection of menu items) as well as a hierarchical menu. The hotlist is collaborative, because it combines adaptable and adaptive approaches by allowing both the user and the system to manage the items in it. A controlled experiment compared different types of collaborative menus in order to investigate the effects of system support and user control. Twenty participants performed menu selection tasks in the experiment, and both performance and subjective measures were taken. The results showed that, in a certain condition, the system support and the user control improved the user performance when applied independently, but their effects were not additive. Although the effects disappeared when the selection frequency distribution changed, the system support was preferred by most of the users. The advantages and disadvantages of the collaborative menus and implications for the adaptation of menus are discussed.", "paper_title": "Integration of Adaptable and Adaptive Approaches for Interface Personalization Through Collaborative Menu", "paper_id": "WOS:000306831300005"}