{"auto_keywords": [{"score": 0.03619307934432558, "phrase": "path_computation"}, {"score": 0.03509567096438672, "phrase": "lid_assignment"}, {"score": 0.013537610286689736, "phrase": "intermediate_switches"}, {"score": 0.00481495049065317, "phrase": "infiniband_networks"}, {"score": 0.004664352260912174, "phrase": "infiniband_network"}, {"score": 0.00453643016617164, "phrase": "local_identifier"}, {"score": 0.004429566229017728, "phrase": "infiniband_specification"}, {"score": 0.004173244935967375, "phrase": "forwarding_tables"}, {"score": 0.003931700862929775, "phrase": "infiniband"}, {"score": 0.0034619440946558186, "phrase": "computing_paths"}, {"score": 0.0032355864829403413, "phrase": "lid_assignment_component"}, {"score": 0.0028601252251285, "phrase": "minimum_number"}, {"score": 0.0028155300012587207, "phrase": "np"}, {"score": 0.0027485326424697095, "phrase": "integer_linear_programming_formulation"}, {"score": 0.002578946584040053, "phrase": "practical_cases"}, {"score": 0.0024488738006005133, "phrase": "experimental_results"}, {"score": 0.002164505365535068, "phrase": "good_performance"}], "paper_keywords": ["InfiniBand", " LID assignment", " NP-complete"], "paper_abstract": "To realize a path in an InfiniBand network, an address, known as local identifier (LID) in the InfiniBand specification, must be assigned to the destination of the path and used in the forwarding tables of intermediate switches to direct the traffic following the path. Hence, routing in InfiniBand has two components: 1) computing all paths and 2) assigning LIDs to destinations and using them in intermediate switches to realize the paths. We refer to the task of computing paths as path computation and the task of assigning LIDs as LID assignment. This paper focuses on the LID assignment component, whose major issue is to minimize the number of LIDs required to support a given set of paths. We prove that the problem of realizing a given set of paths with a minimum number of LIDs is NP-complete, develop an integer linear programming formulation for this problem, design a number of heuristics that are effective and efficient in practical cases, and evaluate the performance of the heuristics through simulation. The experimental results indicate that the performance of our best performing heuristic is very close to optimal. We further demonstrate that by separating path computation from LID assignment and using the schemes that are known to achieve good performance for path computation and LID assignment separately, more effective routing schemes than existing ones can be developed.", "paper_title": "LID Assignment in InfiniBand Networks", "paper_id": "WOS:000263762400005"}