{"auto_keywords": [{"score": 0.04265347421798511, "phrase": "literature_reviews"}, {"score": 0.012421384716028864, "phrase": "macro-level_discourse_structure"}, {"score": 0.007028405050044433, "phrase": "literature_review_writing"}, {"score": 0.0059685034923864, "phrase": "coding_scheme"}, {"score": 0.004726184966910756, "phrase": "purpose_-_the_purpose"}, {"score": 0.004486212539464774, "phrase": "information_science_journal_papers"}, {"score": 0.004403480614319231, "phrase": "different_styles"}, {"score": 0.004242546312843817, "phrase": "human_abstracting"}, {"score": 0.003808209866576388, "phrase": "summarization_system"}, {"score": 0.0036281710561308377, "phrase": "high-level_organization"}, {"score": 0.0033801845720347118, "phrase": "inter-coder_reliability"}, {"score": 0.0031963987773420068, "phrase": "different_discourse_structures"}, {"score": 0.0031726587374218277, "phrase": "descriptive_literature_reviews"}, {"score": 0.0030338645940033875, "phrase": "research_methods"}, {"score": 0.00296675450822924, "phrase": "integrative_literature_reviews"}, {"score": 0.002763850622950247, "phrase": "critical_summaries"}, {"score": 0.0026232532659260033, "phrase": "reviewer's_voice"}, {"score": 0.0023368018449680295, "phrase": "basic_characteristics"}, {"score": 0.0021687806803474367, "phrase": "discourse_relations"}, {"score": 0.0021526564019119466, "phrase": "rhetorical_functions"}], "paper_keywords": ["Information science", " Literature", " Information management"], "paper_abstract": "Purpose - The purpose of this study is to analyze the macro-level discourse structure of literature reviews found in information science journal papers, and to identify different styles of literature review writing. Although there have been several studies of human abstracting, there are hardly any studies of how authors construct literature reviews. Design/methodology/approach - This study is carried out in the context of a project to develop a summarization system to generate literature reviews automatically. A coding scheme was developed to annotate the high-level organization of literature reviews, focusing on the types of information. Two sets of annotations were used to check inter-coder reliability. Findings - It was found that literature reviews are written in two distinctive styles, with different discourse structures. Descriptive literature reviews summarize individual papers/studies and provide more information on each study, such as research methods, results and interpretation. Integrative literature reviews provide fewer details of individual papers/studies, but focus on ideas and results extracted from these papers. They provide critical summaries of topics, and have a more complex structure of topics and sub-topics. The reviewer's voice is also more dominant. Originality/value - The coding scheme is useful for annotating the macro-level discourse structure of literature reviews, and can be used for studying literature reviews in other fields. The basic characteristics of two styles of literature review writing are identified. The results have provided a foundation for further studies of literature reviews to identify discourse relations and rhetorical functions employed in literature reviews, and their linguistic expressions.", "paper_title": "Analysis of the macro-level discourse structure of literature reviews", "paper_id": "WOS:000291177000005"}