{"auto_keywords": [{"score": 0.03572270209581423, "phrase": "snp_data"}, {"score": 0.008702702858987298, "phrase": "novel_insights"}, {"score": 0.007305586020006128, "phrase": "complex_relationships"}, {"score": 0.00481495049065317, "phrase": "complementary_bipartite_visual_analytical_representations"}, {"score": 0.004636027593561925, "phrase": "ancestral_informative_markers"}, {"score": 0.004604214511792668, "phrase": "objective_several_studies"}, {"score": 0.004510073211984104, "phrase": "single-nucleotide_polymorphisms"}, {"score": 0.004238993477742183, "phrase": "case-control_studies"}, {"score": 0.004067349981835669, "phrase": "dimensionality-reduction_methods"}, {"score": 0.004011687811047391, "phrase": "principal_component_analysis"}, {"score": 0.0037445545584005014, "phrase": "important_bipartite_relationships"}, {"score": 0.0036553070575015344, "phrase": "snp_clusters"}, {"score": 0.0034236045013591437, "phrase": "current_methods"}, {"score": 0.003140888248194296, "phrase": "simultaneous_visualization"}, {"score": 0.003044912038752554, "phrase": "subject_attributes"}, {"score": 0.0029620734858647425, "phrase": "snp"}, {"score": 0.002881450787481037, "phrase": "purely_unipartite_views"}, {"score": 0.0025014259919355453, "phrase": "genomic_studies"}, {"score": 0.00241658945942583, "phrase": "bipartite_representations"}, {"score": 0.0023917027133236813, "phrase": "new_patterns"}, {"score": 0.0023507916951658455, "phrase": "existing_unipartite_representations"}, {"score": 0.002294686545883412, "phrase": "multiple_representations"}, {"score": 0.0021490449563443025, "phrase": "complementary_visual_analytical_framework"}, {"score": 0.0021049977753042253, "phrase": "multiple_bipartite_representations"}], "paper_keywords": [""], "paper_abstract": "Objective Several studies have shown how sets of single-nucleotide polymorphisms (SNPs) can help to classify subjects on the basis of their continental origins, with applications to case-control studies and population genetics. However, most of these studies use dimensionality-reduction methods, such as principal component analysis, or clustering methods that result in unipartite (either subjects or SNPs) representations of the data. Such analyses conceal important bipartite relationships, such as how subject and SNP clusters relate to each other, and the genotypes that determine their cluster memberships. Methods To overcome the limitations of current methods of analyzing SNP data, the authors used three bipartite analytical representations (bipartite network, heat map with dendrograms, and Circos ideogram) that enable the simultaneous visualization and analysis of subjects, SNPs, and subject attributes. Results The results demonstrate (1) novel insights into SNP data that are difficult to derive from purely unipartite views of the data, (2) the strengths and limitations of each method, revealing the role that each play in revealing novel insights, and (3) implications for how the methods can be used for the analysis of SNPs in genomic studies associated with disease. Conclusion The results suggest that bipartite representations can reveal new patterns in SNP data compared with existing unipartite representations. However, the novel insights require multiple representations to discover, verify, and comprehend the complex relationships. The results therefore motivate the need for a complementary visual analytical framework that guides the use of multiple bipartite representations to analyze complex relationships in SNP data.", "paper_title": "The role of complementary bipartite visual analytical representations in the analysis of SNPs: a case study in ancestral informative markers", "paper_id": "WOS:000314151400003"}