{"auto_keywords": [{"score": 0.048749297367557266, "phrase": "categorized_data"}, {"score": 0.015719716506582538, "phrase": "euler_diagrams"}, {"score": 0.014192306395463924, "phrase": "euler_diagram"}, {"score": 0.009328951181848942, "phrase": "diagram_descriptions"}, {"score": 0.004397151276300207, "phrase": "succinct_diagram_description"}, {"score": 0.004274981117736524, "phrase": "closed_curves"}, {"score": 0.00389164348807591, "phrase": "automated_euler_diagram_drawing_methods"}, {"score": 0.003401148484767927, "phrase": "aesthetically_pleasing_euler_diagrams"}, {"score": 0.0032756158688245, "phrase": "polynomial_time_complexity"}, {"score": 0.002765490759189057, "phrase": "previous_work"}, {"score": 0.002548945980967458, "phrase": "circles'_class"}, {"score": 0.002327310963701377, "phrase": "particular_choices"}, {"score": 0.002305510336172049, "phrase": "desirable_properties"}, {"score": 0.0022767594422780004, "phrase": "curve_containment"}, {"score": 0.0022133711375320244, "phrase": "software_implementation"}, {"score": 0.0021926354732269846, "phrase": "drawing_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Euler diagrams", " Information visualization", " Non-hierarchical data visualization", " Venn diagrams"], "paper_abstract": "Euler diagrams are used for visualizing categorized data. These categories, together with information about when categories share some datum, can be turned into a succinct diagram description from which an Euler diagram can be generated. Closed curves represent the categories and the relationships between the curves (such as containment) correspond to relationships between the categories (such as subset). A range of automated Euler diagram drawing methods have been proposed but they often produce diagrams that are aesthetically unpleasing, can be computationally complex and most of them cannot draw a diagram for some (often many) given collections of categories. One such method is capable of drawing aesthetically pleasing Euler diagrams, using only circles, and is computationally efficient (being of polynomial time complexity) but it applies to a very restricted subset of collections of categorized data. This paper substantially extends that method so it can always draw an Euler diagram, that is it applies to all collections of categorized data. In particular, we identify a class of diagram descriptions that can be drawn with circles, generalizing previous work. For diagram descriptions outside of this class, we define transformations that can be used to turn them into descriptions inside the 'drawable with circles' class. We demonstrate how such transformations can be done in a general, a process during which many choices must be made. Further, we provide strategies for making particular choices which ensure desirable properties, such as curve containment, are preserved. We have provided a software implementation of the drawing method, which is freely available from www.eulerdiagrams.com/inductivecircles.htm. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Automatically drawing Euler diagrams with circles", "paper_id": "WOS:000304577900004"}