{"auto_keywords": [{"score": 0.04546141472053551, "phrase": "quantum_chaos"}, {"score": 0.015134559017280788, "phrase": "quantum_information"}, {"score": 0.013835391023018435, "phrase": "quantum_computer"}, {"score": 0.00938799242417057, "phrase": "quantum_computers"}, {"score": 0.008850102754740968, "phrase": "quantum_algorithms"}, {"score": 0.00481495049065317, "phrase": "quantum_computation"}, {"score": 0.004731754442072492, "phrase": "recent_work"}, {"score": 0.004522080178250592, "phrase": "classical_and_quantum_chaos"}, {"score": 0.004144510906908392, "phrase": "information_extraction"}, {"score": 0.0038517317559294962, "phrase": "classical_computation"}, {"score": 0.0037326500020622715, "phrase": "classical_chaos"}, {"score": 0.003505378950567746, "phrase": "final_wave_function"}, {"score": 0.003468864442215017, "phrase": "total_gain"}, {"score": 0.003091381857342703, "phrase": "present-day_quantum_computers"}, {"score": 0.002803398730609738, "phrase": "quantum_chaos_algorithms"}, {"score": 0.0026602925366283952, "phrase": "random_unitary_errors"}, {"score": 0.002641770514171764, "phrase": "dissipative_errors"}, {"score": 0.0025510720021028107, "phrase": "direct_analysis"}, {"score": 0.002506894277338543, "phrase": "static_errors"}, {"score": 0.0024292886883655693, "phrase": "different_resources"}, {"score": 0.002337684811187166, "phrase": "precise_consequences"}, {"score": 0.0023214036848949876, "phrase": "entanglement_generation"}, {"score": 0.0021049977753042253, "phrase": "interference_generation"}], "paper_keywords": [""], "paper_abstract": "This paper reviews recent work related to the interplay between quantum information and Computation on the one hand and classical and quantum chaos on the other. First, we present several models of quantum chaos that can be simulated efficiently on a quantum computer. Then a discussion of information extraction shows that such models can give rise to complete algorithms including measurements that can achieve an increase in speed compared with classical Computation. It is also shown that models of classical chaos can be simulated efficiently on a quantum computer, and again information can be extracted efficiently from the final wave function. The total gain can be exponential or polynomial, depending on the model chosen and the observable measured. The simulation of such systems is also economical in the number of qubits, allowing implementation on present-day quantum Computers, some of these algorithms having been already experimentally implemented. The second topic considered concerns the analysis of errors on quantum computers. It is shown that quantum chaos algorithms can be used to explore the effect of errors on quantum algorithms, such as random unitary errors or dissipative errors. Furthermore, the tools of quantum chaos allows a direct analysis of the effects of static errors on quantum computers. Finally, we consider the different resources used by quantum information, and show that quantum chaos has some precise consequences on entanglement generation, which becomes close to maximal. For another resource, interference, a proposal is presented for quantifying it, enabling a discussion on entanglement and interference generation in quantum algorithms.", "paper_title": "Complexity of chaos and quantum computation", "paper_id": "WOS:000252166100006"}