{"auto_keywords": [{"score": 0.034008900641227656, "phrase": "gossip"}, {"score": 0.013149656443034112, "phrase": "similar_structures"}, {"score": 0.00481495049065317, "phrase": "fast_and_accurate_global_alignment"}, {"score": 0.004637478829869904, "phrase": "known_protein_structures"}, {"score": 0.00443308765153716, "phrase": "growing_need"}, {"score": 0.004301834610818624, "phrase": "vast_amount"}, {"score": 0.004269630481719451, "phrase": "structural_data"}, {"score": 0.00419016653753787, "phrase": "accumulating_data"}, {"score": 0.004066076430818046, "phrase": "fast_tool"}, {"score": 0.0039456466422100045, "phrase": "structural_resemblance"}, {"score": 0.003800093834008562, "phrase": "protein_structures"}, {"score": 0.003687512797620773, "phrase": "local_structure_alignment"}, {"score": 0.003407549468745519, "phrase": "large_number"}, {"score": 0.003306559295382181, "phrase": "reasonable_time"}, {"score": 0.003136952589428254, "phrase": "global_all-against-all_alignment"}, {"score": 0.0027395968397212053, "phrase": "local_structure_alignment_methods"}, {"score": 0.0025989960809479104, "phrase": "well-known_available_structure_alignment_servers"}, {"score": 0.0025124343366192954, "phrase": "database_scanning_method"}, {"score": 0.0024196235355517827, "phrase": "short_structural_fragments"}, {"score": 0.0021049977753042253, "phrase": "detected_global_similarities"}], "paper_keywords": [""], "paper_abstract": "Motivation: The database of known protein structures (PDB) is increasing rapidly. This results in a growing need for methods that can cope with the vast amount of structural data. To analyze the accumulating data, it is important to have a fast tool for identifying similar structures and clustering them by structural resemblance. Several excellent tools have been developed for the comparison of protein structures. These usually address the task of local structure alignment, an important yet computationally intensive problem due to its complexity. It is difficult to use such tools for comparing a large number of structures to each other at a reasonable time. Results: Here we present GOSSIP, a novel method for a global all-against-all alignment of any set of protein structures. The method detects similarities between structures down to a certain cutoff (a parameter of the program), hence allowing it to detect similar structures at a much higher speed than local structure alignment methods. GOSSIP compares many structures in times which are several orders of magnitude faster than well-known available structure alignment servers, and it is also faster than a database scanning method. We evaluate GOSSIP both on a dataset of short structural fragments and on two large sequence-diverse structural benchmarks. Our conclusions are that for a threshold of 0.6 and above, the speed of GOSSIP is obtained with no compromise of the accuracy of the alignments or of the number of detected global similarities.", "paper_title": "GOSSIP: a method for fast and accurate global alignment of protein structures", "paper_id": "WOS:000289162000006"}