{"auto_keywords": [{"score": 0.0412825255374171, "phrase": "checksum_relationship"}, {"score": 0.04079492774910282, "phrase": "input_checksum_matrices"}, {"score": 0.021951030286063357, "phrase": "message_logging"}, {"score": 0.010526008536215381, "phrase": "fail-stop_failures"}, {"score": 0.00481495049065317, "phrase": "algorithm-based_fault_tolerance"}, {"score": 0.004344662696228875, "phrase": "process_failures"}, {"score": 0.00430907756010007, "phrase": "scalapack_matrix-matrix_multiplication_kernel"}, {"score": 0.00405127920820053, "phrase": "previous_algorithm-based_fault_tolerance_research"}, {"score": 0.003985166330358716, "phrase": "matrix-matrix_multiplication"}, {"score": 0.0035808664384880213, "phrase": "final_computation_results"}, {"score": 0.0035515148917169173, "phrase": "processor_miscalculations"}, {"score": 0.002607965563121546, "phrase": "outer_product_version_matrix-matrix_multiplication_algorithm"}, {"score": 0.002276439636865258, "phrase": "fail-stop_process_failures"}, {"score": 0.0022577559526646904, "phrase": "scalapack_matrix-matrix_multiplication"}, {"score": 0.0021049977753042253, "phrase": "fault_tolerance_overhead"}], "paper_keywords": ["Algorithm-based fault tolerance", " checkpointing", " fail-stop failures", " parallel matrix-matrix multiplication", " ScaLAPACK"], "paper_abstract": "Fail-stop failures in distributed environments are often tolerated by checkpointing or message logging. In this paper, we show that fail-stop process failures in ScaLAPACK matrix-matrix multiplication kernel can be tolerated without checkpointing or message logging. It has been proved in the previous algorithm-based fault tolerance research that, for matrix-matrix multiplication, the checksum relationship in the input checksum matrices is preserved at the end of the computation no matter which algorithm is chosen. From this checksum relationship in the final computation results, processor miscalculations can be detected, located, and corrected at the end of the computation. However, whether this checksum relationship in the input checksum matrices can be maintained in the middle of the computation or not remains open. In this paper, we first demonstrate that, for many matrix-matrix multiplication algorithms, the checksum relationship in the input checksum matrices is not maintained in the middle of the computation. We then prove that, however, for the outer product version matrix-matrix multiplication algorithm, the checksum relationship in the input checksum matrices can be maintained in the middle of the computation. Based on this checksum relationship maintained in the middle of the computation, we demonstrate that fail-stop process failures in ScaLAPACK matrix-matrix multiplication can be tolerated without checkpointing or message logging. Because no periodical checkpointing is involved, the fault tolerance overhead for this approach is surprisingly low.", "paper_title": "Algorithm-Based Fault Tolerance for Fail-Stop Failures", "paper_id": "WOS:000260309000003"}