{"auto_keywords": [{"score": 0.0335610639427145, "phrase": "online_health_information"}, {"score": 0.015719716506582538, "phrase": "online_health_information_search"}, {"score": 0.014506174382166821, "phrase": "health_information"}, {"score": 0.008326205671011595, "phrase": "perceived_health_status"}, {"score": 0.004656647251517823, "phrase": "national_cancer-related_survey"}, {"score": 0.004054169947971483, "phrase": "health_motivators"}, {"score": 0.00401560412621627, "phrase": "peoples'_online_health_information_search_behavior"}, {"score": 0.003939565240409143, "phrase": "users'_online_health_information_search_behavior"}, {"score": 0.003702206069379459, "phrase": "online_health_information_usage"}, {"score": 0.0035462807506718578, "phrase": "initial_search"}, {"score": 0.0032382660477699695, "phrase": "internet_services"}, {"score": 0.003043031131345537, "phrase": "perceived_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online health information", " Internet", " Trust", " Health status", " Digital divide"], "paper_abstract": "People are increasingly using the Internet to access health information and the information obtained has an impact on their healthcare outcomes. This paper examines the impacts of IT enablers and health motivators on peoples' online health information search behavior. We characterize users' online health information search behavior along three dimensions: the frequency of online health information search, the diversity of online health information usage, and the preference of the Internet for initial search. Using the 2003 Health Information National Trends Survey (HINTS) data on cancer, we find that ease of access to Internet services and trust in online health information could affect the three dimensional search behavior listed above. While perceived quality of communication with doctors has an impact on diversity of use and preference of use, we surprisingly do not find an impact on the frequency of search for online health information. In addition, our results find that perceived health status could affect both frequency and diversity of search for online health information. But we do not find evidence that perceived health status could lead to a preference for using the Internet as a source for health information. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Factors influencing online health information search: An empirical analysis of a national cancer-related survey", "paper_id": "WOS:000330909700038"}