{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "exponential_growth"}, {"score": 0.0047026237903774895, "phrase": "scientific_papers"}, {"score": 0.004178935413340453, "phrase": "individual_papers"}, {"score": 0.0038382392088338784, "phrase": "thorough_study"}, {"score": 0.0037133478610481994, "phrase": "different_disciplines"}, {"score": 0.003626626504149897, "phrase": "citation_rate"}, {"score": 0.0031619994642255846, "phrase": "power_law_behavior"}, {"score": 0.003102752392819577, "phrase": "ultradiffusive_processes"}, {"score": 0.0030590445140753187, "phrase": "exponential_fitting"}, {"score": 0.003015950477134494, "phrase": "power_law"}, {"score": 0.0025316905609748135, "phrase": "published_papers"}, {"score": 0.0022175019341824603, "phrase": "published_items"}, {"score": 0.0021656385587456952, "phrase": "real_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decay of attention", " Citation count", " Time evolution"], "paper_abstract": "The exponential growth in the number of scientific papers makes it increasingly difficult for researchers to keep track of all the publications relevant to their work. Consequently, the attention that can be devoted to individual papers, measured by their citation counts, is bound to decay rapidly. In this work we make a thorough study of the life-cycle of papers in different disciplines. Typically, the citation rate of a paper increases up to a few years after its publication, reaches a peak and then decreases rapidly. This decay can be described by an exponential or a power law behavior, as in ultradiffusive processes, with exponential fitting better than power law for the majority of cases. The decay is also becoming faster over the years, signaling that nowadays papers are forgotten more quickly. However, when time is counted in terms of the number of published papers, the rate of decay of citations is fairly independent of the period considered. This indicates that the attention of scholars depends on the number of published items, and not on real time. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Attention decay in science", "paper_id": "WOS:000367612600005"}