{"auto_keywords": [{"score": 0.0490756113024592, "phrase": "potential_adverse_drug_events"}, {"score": 0.04809176147872217, "phrase": "multiple_medications"}, {"score": 0.03863573199265333, "phrase": "information_visualization"}, {"score": 0.00481495049065317, "phrase": "data_visualization"}, {"score": 0.004447201233380302, "phrase": "increased_risk"}, {"score": 0.004400329132129292, "phrase": "adverse_drug_events"}, {"score": 0.004129248271757936, "phrase": "side-effect_profiles"}, {"score": 0.003813669883040509, "phrase": "decision_support_system"}, {"score": 0.0037139103792217143, "phrase": "potential_adverse_reactions"}, {"score": 0.003375826910838081, "phrase": "numeric_score"}, {"score": 0.0029722900280316216, "phrase": "graphical_adverse_reaction_maps"}, {"score": 0.0029253546782349875, "phrase": "user-selected_combination"}, {"score": 0.002744888626958772, "phrase": "side-effect_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Adverse drug events", " Side-effects", " Information visualization", " Polypharmacy"], "paper_abstract": "Patients on multiple medications are at increased risk for adverse drug events. While physicians can reduce this risk by regularly reviewing the side-effect profiles of their patients' medications, this process can be time-consuming. We created a decision support system designed to expedite reviewing potential adverse reactions through information visualization. The system includes a database containing 16,340 unique drug and side-effect pairs, representing 250 common medications. A numeric score is assigned to each pair reflecting the strength of association between drug and effect. Based on these scores, the system generates graphical adverse reaction maps for any user-selected combination of drugs. A study comparing speed and accuracy of retrieving side-effect data using this tool versus UpToDate (R) demonstrated a 60% reduction in time to complete a query (61 s vs. 155 s, p <0.0001) with no decrease in accuracy. These findings suggest that information visualization can significantly expedite review of potential adverse drug events. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Data visualization speeds review of potential adverse drug events in patients on multiple medications", "paper_id": "WOS:000276012800016"}