{"auto_keywords": [{"score": 0.03267960289300996, "phrase": "optimal_number"}, {"score": 0.013828351597702826, "phrase": "smallest_number"}, {"score": 0.012161740148956945, "phrase": "distributed_setting"}, {"score": 0.0048149508482222, "phrase": "blin"}, {"score": 0.00479007551581724, "phrase": "p._fraigniaud"}, {"score": 0.004765328434610262, "phrase": "n._nisse"}, {"score": 0.0047407085958145806, "phrase": "s._vial"}, {"score": 0.0046797114400479135, "phrase": "network_intruders"}, {"score": 0.004607545146600368, "phrase": "structural_information_and_communication_complexity"}, {"score": 0.00458373707354532, "phrase": "sirocco"}, {"score": 0.004536491045161081, "phrase": "lncs"}, {"score": 0.004466529428861963, "phrase": "springer-verlag"}, {"score": 0.004352285992815604, "phrase": "new_measure"}, {"score": 0.004296264970612285, "phrase": "distributed_task"}, {"score": 0.004153947871210216, "phrase": "distributed_problem"}, {"score": 0.0035648266669315943, "phrase": "particular_node"}, {"score": 0.003419943984098415, "phrase": "contaminated_graph"}, {"score": 0.0033323878473928317, "phrase": "cleared_part"}, {"score": 0.0032218966066768022, "phrase": "search_strategy"}, {"score": 0.0029194246334886334, "phrase": "centralized_setting"}, {"score": 0.002874325505148923, "phrase": "minimum_number"}, {"score": 0.00281527215297199, "phrase": "connected_and_optimal_clearing"}, {"score": 0.0025641531534356826, "phrase": "graph_g"}, {"score": 0.0022637425880437803, "phrase": "distributed_protocol"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph searching", " monotonicity", " Bits of advice"], "paper_abstract": "Fraigniaud er al. [L, Blin, P. Fraigniaud, N. Nisse, S. Vial, Distributing chasing of network intruders, in: 13th colloquium on Structural Information and Communication Complexity, SIROCCO, in: LNCS, vol. 4056, Springer-Verlag, 2006, pp. 70-84] introduced a new measure of difficulty for a distributed task in a network. The smallest number of bits of advice of a distributed problem is the smallest number of bits of information that has to be available to nodes in order to accomplish the task efficiently. Our paper deals with the number of bits of advice required to perform efficiently the graph searching problem in a distributed setting. In this variant of the problem, all searchers are initially placed at a particular node of the network. The aim of the team of searchers is to clear a contaminated graph in a monotone connected way, i.e., the cleared part of the graph is permanently connected, and never decreases while the search strategy is executed. Moreover, the clearing of the graph must he performed using the optimal number of searchers, i.e. the minimum number of searchers sufficient to clear the graph in a monotone connected way in a centralized setting. We show that the minimum number of bits of advice permitting the monotone connected and optimal clearing of a network in a distributed setting is Theta(n log n), where n is the number of nodes of the network. More precisely, we first provide a labelling of the vertices of any graph G, using a total of O(n log n) bits, and a protocol using this labelling that enables the optimal number of searchers to clear G in a monotone connected distributed way. Then, we show that this number of bits of advice is optimal: any distributed protocol requires Omega(n log n) bits of advice to clear a network in a monotone connected way, using an optimal number of searchers. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Graph searching with advice", "paper_id": "WOS:000264537200002"}