{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimum_variance_model"}, {"score": 0.014110364056376676, "phrase": "alternative_view"}, {"score": 0.004436545340717729, "phrase": "target_object"}, {"score": 0.003781005930058317, "phrase": "human_movement"}, {"score": 0.00373701482510911, "phrase": "optimal_control_scheme"}, {"score": 0.0036505565334886227, "phrase": "robot_arm"}, {"score": 0.00337650257503995, "phrase": "arm_model"}, {"score": 0.0032855095476183372, "phrase": "signal-dependent_noise"}, {"score": 0.0032220148724914867, "phrase": "motor_commands"}, {"score": 0.0029453365339797933, "phrase": "classical_view"}, {"score": 0.002681859084438076, "phrase": "key_characteristics"}, {"score": 0.0026609940110902666, "phrase": "human_grasping_movements"}, {"score": 0.002549096826249, "phrase": "object_size"}, {"score": 0.00243237365704391, "phrase": "maximum_grip"}, {"score": 0.002376027109070317, "phrase": "movement_time"}, {"score": 0.0022760856906838814, "phrase": "digit_end-point_variance"}], "paper_keywords": [""], "paper_abstract": "Reaching-to-grasp has generally been classified as the coordination of two separate visuomotor processes: transporting the hand to the target object and performing the grip. An alternative view has recently been formed that grasping can be explained as pointing movements performed by the digits of the hand to target positions on the object. We have previously implemented the minimum variance model of human movement as an optimal control scheme suitable for control of a robot arm reaching to a target. Here, we extend that scheme to perform grasping movements with a hand and arm model. Since the minimum variance model requires that signal-dependent noise be present on the motor commands to the actuators of the movement, our approach is to plan the reach and the grasp separately, in line with the classical view, but using the same computational model for pointing, in line with the alternative view. We show that our model successfully captures some of the key characteristics of human grasping movements, including the observations that maximum grip size increases with object size (with a slope of approximately 0.8) and that this maximum grip occurs at 60-80% of the movement time. We then use our model to analyse contributions to the digit end-point variance from the two components of the grasp (the transport and the grip). We also briefly discuss further areas of investigation that are prompted by our model.", "paper_title": "Object grasping using the minimum variance model", "paper_id": "WOS:000236961200005"}