{"auto_keywords": [{"score": 0.04288547451594283, "phrase": "muscle_attachment_sites"}, {"score": 0.01956286100054051, "phrase": "reference_scapula"}, {"score": 0.00854951445858469, "phrase": "proposed_methods"}, {"score": 0.005221884634987751, "phrase": "muscle_force_predictions"}, {"score": 0.00481495049065317, "phrase": "subject-specific_scapular_muscle_attachment_sites"}, {"score": 0.004673530058379246, "phrase": "soft_tissue_structures"}, {"score": 0.0045556080393342165, "phrase": "subject-specific_biomechanical_modelling"}, {"score": 0.004347057700479576, "phrase": "soft_tissue_parameters"}, {"score": 0.003634587156159668, "phrase": "seven_other_scapulae"}, {"score": 0.0035883942463601688, "phrase": "transformation_errors"}, {"score": 0.0030127172247606812, "phrase": "seven_different_scapulae"}, {"score": 0.0028259493298659288, "phrase": "considered_statistical_population"}, {"score": 0.002754516260621121, "phrase": "ideal_scapula"}, {"score": 0.002332133125576037, "phrase": "musculoskeletal_model"}, {"score": 0.0023123057299992587, "phrase": "perturbed_and_non-perturbed_versions"}, {"score": 0.0022062235065459274, "phrase": "muscle_attachments"}], "paper_keywords": ["muscle attachment", " scapula", " patient-specific", " musculoskeletal model"], "paper_abstract": "The parameters that describe the soft tissue structures are among the most important anatomical parameters for subject-specific biomechanical modelling. In this paper, we study one of the soft tissue parameters, namely muscle attachment sites. Two new methods are proposed for transformation of the muscle attachment sites of any reference scapula to any destination scapula based on four palpable bony landmarks. The proposed methods as well as one previously proposed method have been applied for transformation of muscle attachment sites of one reference scapula to seven other scapulae. The transformation errors are compared among the three methods. Both proposed methods yield significantly less (p < 0.05) prediction error as compared to the currently available method. Furthermore, we investigate whether there exists a reference scapula that performs significantly better than other scapulae when used for transformation of muscle attachment sites. Seven different scapulae were used as reference scapula and their resulting transformation errors were compared with each other. In the considered statistical population, no such a thing as an ideal scapula was found. There was, however, one outlier scapula that performed significantly worse than the other scapulae when used as a reference. The effect of perturbations in both muscle attachment sites and other muscle properties is studied by comparing muscle force predictions of a musculoskeletal model between perturbed and non-perturbed versions of the model. It is found that 10mm variations in muscle attachments have more significant effect on muscle force predictions than 10% variations in any of the other four analysed muscle properties.", "paper_title": "Transformation methods for estimation of subject-specific scapular muscle attachment sites", "paper_id": "WOS:000337184800008"}