{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "whole_set"}, {"score": 0.04860000689752459, "phrase": "dual_arc_costs"}, {"score": 0.004764859786310636, "phrase": "minimal_cost_pairs"}, {"score": 0.0047152877145889656, "phrase": "disjoint_paths"}, {"score": 0.004593591780245872, "phrase": "telecommunication_networks"}, {"score": 0.0034642269266820925, "phrase": "np"}, {"score": 0.003102195256794215, "phrase": "dual_arc_cost_networks"}, {"score": 0.002974886152979993, "phrase": "exact_algorithm"}, {"score": 0.0028828348726682965, "phrase": "arc-disjoint_path_pairs"}, {"score": 0.0025288869172313674, "phrase": "optimal_path_pair_cost"}, {"score": 0.002241679436497569, "phrase": "optimality_condition"}, {"score": 0.002160907646736523, "phrase": "upper_and_lower_bounds"}, {"score": 0.002127186380459509, "phrase": "optimal_cost"}, {"score": 0.0021049977753042253, "phrase": "extensive_experimentation"}], "paper_keywords": ["OR in telecommunications", " Paths with minimal cost sum", " Dual arc costs"], "paper_abstract": "In telecommunication networks design the problem of obtaining optimal (arc or node) disjoint paths, for increasing network reliability, is extremely important. The problem of calculating k (c) disjoint paths from s to t (two distinct nodes), in a network with k (c) different (arbitrary) costs on every arc such that the total cost of the paths is minimised, is NP-complete even for k (c) =2. When k (c) =2 these networks are usually designated as dual arc cost networks. In this paper we propose an exact algorithm for finding the whole set of arc-disjoint path pairs, with minimal cost in a network with dual arc costs. The correctness of the algorithm is based on a condition which guarantees that the optimal path pair cost has been obtained and on a proposition which guarantees that at the end of the algorithm all the optimal pairs have been obtained. The optimality condition is based on the calculation of upper and lower bounds on the optimal cost. Extensive experimentation is presented to show the effectiveness of the algorithm.", "paper_title": "An effective algorithm for obtaining the whole set of minimal cost pairs of disjoint paths with dual arc costs", "paper_id": "WOS:000275781900008"}