{"auto_keywords": [{"score": 0.0390108089770287, "phrase": "dht-based_routing_protocol"}, {"score": 0.00481495049065317, "phrase": "routing_protocol"}, {"score": 0.004622473575980523, "phrase": "dht"}, {"score": 0.004460309246062286, "phrase": "useful_addition"}, {"score": 0.004068907083697369, "phrase": "network_layer"}, {"score": 0.003966388754366831, "phrase": "scalable_routing_protocols"}, {"score": 0.003926105480202798, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.0035269696779744266, "phrase": "logical_network"}, {"score": 0.0033857878144822906, "phrase": "dht-based_routing_protocols"}, {"score": 0.0030569913145731408, "phrase": "physical_intra-neighbor_relationships"}, {"score": 0.002831462722290752, "phrase": "proposed_scheme"}, {"score": 0.0027459678326877744, "phrase": "distributed_algorithm"}, {"score": 0.002690406375639144, "phrase": "consecutive_logical_identifier"}, {"score": 0.0023435920614377306, "phrase": "scalability_problem"}, {"score": 0.002249672943553135, "phrase": "simulation_results"}, {"score": 0.0022041312401435346, "phrase": "proposed_approach"}, {"score": 0.0021705796895687864, "phrase": "existing_dht-based_routing_protocol"}], "paper_keywords": ["distributed hash tables", " routing", " MANETs", " distributed systems"], "paper_abstract": "In the last few years, distributed hash table (DHT) has come forth as a useful addition to the design and specification of spontaneous, self-organizing networks. Researchers have exploited its advantages by implementing it at the network layer in order to design scalable routing protocols for mobile ad hoc networks. We identify two correlated issues that must be considered when designing DHT-based routing protocol, namely the mismatch problem and resilience of the logical network, which degrades the efficiency of the DHT-based routing protocols. To address these problems, we propose a DHT-based routing protocol that exploits a 3D logical space that takes into account the physical intra-neighbor relationships of a node and exploits a 3D structure to interpret that relationship. In the proposed scheme, each node runs a distributed algorithm to obtain a consecutive logical identifier that reflects its physical proximity in the 3D logical space. Moreover, the protocol utilizes the 3D-structure to maintain multi-paths to a destination node in order to address the scalability problem and gain resilience against a node/link failure. Simulation results show that the proposed approach outperforms the existing DHT-based routing protocol in terms routing overhead, end-to-end delay, path-stretch values and packet-delivery ratio.", "paper_title": "3D-RP: A DHT-Based Routing Protocol for MANETs", "paper_id": "WOS:000350220200007"}