{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_services"}, {"score": 0.04424101318485822, "phrase": "librarians'_perceptions"}, {"score": 0.03106546540489402, "phrase": "librarians'_behavioral_intention"}, {"score": 0.0047784273577245505, "phrase": "purpose_-_the_purpose"}, {"score": 0.004565007074039171, "phrase": "technological_innovations"}, {"score": 0.004278827434757312, "phrase": "tam"}, {"score": 0.0038605361756636667, "phrase": "smart_phone_use"}, {"score": 0.0036740173106219183, "phrase": "israel"}, {"score": 0.0036321600255449613, "phrase": "first_semester"}, {"score": 0.0035096666710980108, "phrase": "israeli_librarians"}, {"score": 0.0026771333996253783, "phrase": "practical_implications"}, {"score": 0.0026567830878420347, "phrase": "library_directors"}], "paper_keywords": ["Librarians", " Mobile technology", " Israel", " Mobile services", " Librarians' attitudes", " Technology acceptance model", " Personal innovativeness", " Smart phone usage", " Mobile communication systems"], "paper_abstract": "Purpose - The purpose of this paper is to explore whether librarians are familiar with technological innovations and are ready to accept them. The objectives are: to what extent does the Technology Acceptance Model (TAM) explain librarians' perceptions of mobile services (m-services); and to what extent do differences in gender, age, workplace, role, and smart phone use explain librarians' perceptions of m-services? Design/methodology/approach - The research was conducted in Israel during the first semester of the 2012 academic year. It encompassed three groups of Israeli librarians: academic, public, and special. Researchers used two questionnaires to gather data: a personal details questionnaire, and a mobile technology questionnaire. Findings - This study supported the two core variables model (perceived ease of use and usefulness) of TAM that may predict librarians' behavioral intention to use m-services in the library. However, it added two more components to the model: personal innovativeness and smart phone usage. Practical implications - Library directors may try to implement more m-services on their web sites. These services should be simple, attractive, and efficient. They should also try to expose librarians to the benefits and ease of use of m-services. Originality/value - The findings emphasize the importance of the TAM that may predict librarians' behavioral intention to use m-services in the library and may lead to further research in this field.", "paper_title": "Librarians' attitudes towards mobile services", "paper_id": "WOS:000323237900002"}