{"auto_keywords": [{"score": 0.03190812938259865, "phrase": "arbitrary_number"}, {"score": 0.00456020621016909, "phrase": "formal_modelling"}, {"score": 0.0045108906244892165, "phrase": "medium_access_control"}, {"score": 0.004462105963334103, "phrase": "nonbeacon-enabled_ieee"}, {"score": 0.004295459433506106, "phrase": "probabilistic_timed_automata"}, {"score": 0.004203030435498069, "phrase": "prism_probabilistic_model_checker"}, {"score": 0.0038737214010638745, "phrase": "unslotted_carrier_sense"}, {"score": 0.0037903327482565097, "phrase": "collision_avoidance_algorithm"}, {"score": 0.002779217021776702, "phrase": "valid_representations"}, {"score": 0.0027341763737751467, "phrase": "star-shaped_network"}, {"score": 0.0023990982005125763, "phrase": "sending_stations"}, {"score": 0.002347378595930709, "phrase": "radio_range"}, {"score": 0.0021049977753042253, "phrase": "probabilistic_model_checking"}], "paper_keywords": ["Wireless personal area networks", " medium access control", " hidden stations", " formal specification", " probabilistic model checking"], "paper_abstract": "This paper concerns the formal modelling of medium access control in nonbeacon-enabled IEEE 802.15.4 wireless personal area networks with probabilistic timed automata supported by the PRISM probabilistic model checker. In these networks, the devices contend for the medium by executing an unslotted carrier sense multiple access with collision avoidance algorithm. In the literature, a model of a network which consists of two stations sending data to two different destination stations is introduced. We have improved this model and, based on it, we propose two ways of modelling a network with an arbitrary number of sending stations, each having its own destination. We show that the same models are valid representations of a star-shaped network with an arbitrary number of stations which send data to the same destination station. We also propose how to model such a network if some of the sending stations are not within radio range of the others, i.e. if they are hidden. We present some results obtained for these models by probabilistic model checking using PRISM.", "paper_title": "Modelling medium access control in IEEE 802.15.4 nonbeacon-enabled networks with probabilistic timed automata", "paper_id": "WOS:000319368300004"}