{"auto_keywords": [{"score": 0.048636009815037934, "phrase": "internet_anxiety"}, {"score": 0.015719716506582538, "phrase": "social_support"}, {"score": 0.004506048850130758, "phrase": "broad_dispositional_traits"}, {"score": 0.004068907083697369, "phrase": "work_environment"}, {"score": 0.003545024951402821, "phrase": "individuals'_anxiety"}, {"score": 0.0034911335714333507, "phrase": "internet_applications"}, {"score": 0.0033173234105492895, "phrase": "virtual_teams"}, {"score": 0.003088384809415812, "phrase": "users'_personality"}, {"score": 0.002934566917795928, "phrase": "adequate_resources"}, {"score": 0.002479150189700726, "phrase": "appropriate_resources"}, {"score": 0.0024289743270061157, "phrase": "supportive_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["computer anxiety", " computer self-efficacy", " Internet anxiety", " personal innovativeness in information technology", " perceived resources", " social support", " trust in technology", " virtual teams"], "paper_abstract": "We examined sources of Internet anxiety; specifically modeling the ties from broad dispositional traits (computer anxiety, computer self-efficacy, and personal innovativeness with IT), beliefs about the work environment (about the adequacy of resources and trust in technology), and two forms of social support for IT (leader and peer support) to individuals' anxiety about using Internet applications. We tested our model using respondents who participated in virtual teams during a 16-week period. Our findings suggested that Internet anxiety was affected both by the users' personality and by beliefs that can be influenced by providing adequate resources to support the technology, encourage trust in technology, and working to assure users that leaders and peers are supportive of their using the technology. Our findings suggest that by providing appropriate resources and fostering a supportive environment, leaders could reduce Internet anxiety and thus influence the use of technology in the workplace in ways that benefit organizations. (c) 2007 Published by Elsevier B.V.", "paper_title": "Internet anxiety: An empirical study of the effects of personality, beliefs, and social support", "paper_id": "WOS:000248432300001"}