{"auto_keywords": [{"score": 0.03565024895550413, "phrase": "database_applications"}, {"score": 0.02322730111336097, "phrase": "open-source_database_applications"}, {"score": 0.0047391424424865, "phrase": "proposed_approach"}, {"score": 0.00407161650109722, "phrase": "additional_data_maintenance"}, {"score": 0.0038119123317396954, "phrase": "important_concern"}, {"score": 0.003677280504320636, "phrase": "key_factor"}, {"score": 0.0033409791799749434, "phrase": "complete_functionalities"}, {"score": 0.0031465436619697385, "phrase": "common_patterns"}, {"score": 0.0030353401945270755, "phrase": "data_lifecycles"}, {"score": 0.002981216610222911, "phrase": "good_indicator"}, {"score": 0.002741091312632307, "phrase": "novel_approach"}, {"score": 0.002581477142020187, "phrase": "source_code"}, {"score": 0.0025202582748972122, "phrase": "inter-procedural_static_program_analysis"}, {"score": 0.0021176766800359505, "phrase": "php"}], "paper_keywords": [""], "paper_abstract": "The adaptation of open-source database applications is common in the industry. Most open-source database applications are incomplete. During adaptation, users usually have to implement additional data maintenance. Hence, the completeness of an application is an important concern for the adaptation as a key factor to indicate how much additional effort is required before using a system. From our study of database applications with complete functionalities, we observe that data in a database has common patterns of lifecycles. Anomaly in data lifecycles provides a good indicator on the completeness of database applications. In this paper, we propose a novel approach to automatically extract the data lifecycles out of the source code of database applications through inter-procedural static program analysis. This representative information can benefit the adaptation of database applications specifically for selection, maintenance and extension. We have developed a tool to implement the proposed approach for PHP (Hypertext Preprocessor)-based database applications. Case studies have shown that the proposed approach is useful in assisting adaptation and detecting faults of open-source database applications.", "paper_title": "Supporting the adaptation of open-source database applications through extracting data lifecycles", "paper_id": "WOS:000321895600004"}