{"auto_keywords": [{"score": 0.04631729097053213, "phrase": "coded_data"}, {"score": 0.00481495049065317, "phrase": "coded_entry"}, {"score": 0.004525259757290933, "phrase": "key_trade-off"}, {"score": 0.0044957939485759995, "phrase": "computerized_clinical_documentation"}, {"score": 0.004211441113293312, "phrase": "different_contexts"}, {"score": 0.004156757045329242, "phrase": "clinical_information"}, {"score": 0.0040760539694352236, "phrase": "commonly_available_terminologies"}, {"score": 0.003945001936004421, "phrase": "alert_override_reasons"}, {"score": 0.003518508991483203, "phrase": "natural_experiment"}, {"score": 0.0034841647157189985, "phrase": "coded_and_uncoded_reasons"}, {"score": 0.003461454328850212, "phrase": "drug-drug_interaction"}, {"score": 0.0033391587367741166, "phrase": "identical_ddi_database"}, {"score": 0.003285002755070214, "phrase": "coded_reasons"}, {"score": 0.0030270771166811296, "phrase": "one-year_study_period"}, {"score": 0.002901039092967117, "phrase": "coded_approach"}, {"score": 0.0028727045847620957, "phrase": "free-text_site"}, {"score": 0.0027440826979105533, "phrase": "coded_options"}, {"score": 0.00245512454195783, "phrase": "different_ways"}, {"score": 0.002232779081720735, "phrase": "data_entry_type"}, {"score": 0.002196527318006187, "phrase": "data_entry_choice"}, {"score": 0.002167949230651206, "phrase": "substantial_distortion"}, {"score": 0.0021467594103960585, "phrase": "underlying_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support", " Documentation", " Alerts", " Drug-drug interactions"], "paper_abstract": "Purpose: A key trade-off in computerized clinical documentation exists between collecting coded data versus free-text. Coded data are more readily computer-readable and easier to reuse in different contexts. However, clinical information often exceeds the scope of commonly available terminologies, and coding may be resisted by providers. Alert override reasons are one domain for which agreed-upon terminologies are rarely used. Few data are available on how the collection of information affects the responses of providers. Methods: We took advantage of a natural experiment and compared coded and uncoded reasons for drug-drug interaction (DDI) alert overrides entered in two inpatient prescribing systems with an identical DDI database but with one system offering coded reasons and the other free-text entry. We only included alerts which were issued in both sites and which physicians had to acknowledge. Results: Over a one-year study period, 15,636 alerts were issued. The reasons for override entered in the coded approach matched the free-text site in only 46%. When using free-text, physicians provided many reasons not among the coded options, and often reported that they considered the alert inappropriate, including their rationale regarding this. However, the information entered as free-text included many typing and spelling errors, and the same concept was often represented in different ways, e.g. 209 different ways in which \"will monitor as recommended\" was noted. Conclusions: The reasons for alert override vary substantially according to the data entry type, which implies that data entry choice may lead to substantial distortion of the underlying data. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Coded entry versus free-text and alert overrides: What you get depends on how you ask", "paper_id": "WOS:000283647700005"}