{"auto_keywords": [{"score": 0.036169083715739785, "phrase": "resygen"}, {"score": 0.006884334447589459, "phrase": "recommendation_systems"}, {"score": 0.00481495049065317, "phrase": "recommendation_system_generator"}, {"score": 0.004780780407878596, "phrase": "domain-based_heuristics"}, {"score": 0.004696407360309416, "phrase": "personalized_recommendations"}, {"score": 0.0042354707960660706, "phrase": "difficult_task"}, {"score": 0.004145882022189891, "phrase": "complex_algorithms"}, {"score": 0.003944112858235306, "phrase": "preliminary_design_decisions"}, {"score": 0.0037924666577694222, "phrase": "proactive_recommendations"}, {"score": 0.003531474887552889, "phrase": "user's_satisfaction"}, {"score": 0.003218764138744059, "phrase": "easy_and_friendly_way"}, {"score": 0.0031170783606525856, "phrase": "multi-domain_systems"}, {"score": 0.0028006988338192375, "phrase": "best_distance_metrics"}, {"score": 0.0026928966146175636, "phrase": "non-expert_users"}, {"score": 0.0025525322651112365, "phrase": "data_type"}, {"score": 0.002419466507425567, "phrase": "cloud_tag"}, {"score": 0.0023513512089705325, "phrase": "qualitative_evaluation"}, {"score": 0.0022608057001451414, "phrase": "resygen."}, {"score": 0.002220806891955454, "phrase": "generated_systems"}, {"score": 0.002173739308244513, "phrase": "basic_elements"}, {"score": 0.002150580119047236, "phrase": "recommendation_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative filtering", " Generator system", " Recommendation system"], "paper_abstract": "Recommender systems provide personalized recommendations on products or services to user. The amount information handled by this type of systems is steadily growing. Furthermore, the development of recommendation systems is a difficult task due to the implementation of complex algorithms and metrics. For this reason, the success of recommendation systems depends on preliminary design decisions such as the most adequate similarity metric, the right process to infer proactive recommendations, for mentioning a few. This decision determines the process for generating recommendations and also impacts quality and user's satisfaction. In this paper, we propose RESYGEN, a Recommendation System Generator. RESYGEN allows the user to generate such kind of systems in an easy and friendly way. Furthermore, RESYGEN allows the generation of multi-domain systems such as music, video, books, travel, hardware, software, and food to mention a few. RESYGEN is based in the selection of the best distance metrics for nominal, ordinal, numeric and binary attributes, with the aim to reduce complexity for non-expert users and also to facilitate the selection of the metric which best fits to the data type. A system generated through RESYGEN has several interesting elements such as ratings, recommendations, cloud tag, among others. We performed a qualitative evaluation with the aim of comparing other recommender systems against systems generated by RESYGEN. The results shows that generated systems by RESYGEN, comprise the basic elements of a recommendation system. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "RESYGEN: A Recommendation System Generator using domain-based heuristics", "paper_id": "WOS:000309378200023"}