{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_checking"}, {"score": 0.037874385387497184, "phrase": "student's_solution"}, {"score": 0.015067414594741611, "phrase": "e-learning_environments"}, {"score": 0.01189284370699676, "phrase": "geometric_objects"}, {"score": 0.011678002041562672, "phrase": "template's_solution"}, {"score": 0.00786065043071161, "phrase": "igeom"}, {"score": 0.004741845603430361, "phrase": "dynamic_geometry_system"}, {"score": 0.004641351004344458, "phrase": "key_issues"}, {"score": 0.00428629884026304, "phrase": "specifics_topics"}, {"score": 0.004081385289516914, "phrase": "larger_scale"}, {"score": 0.004007129845611937, "phrase": "brazil"}, {"score": 0.0037459885494311217, "phrase": "geometry_exercises"}, {"score": 0.003417054482155433, "phrase": "geometric_construction"}, {"score": 0.0026171728120512037, "phrase": "correct_solution"}, {"score": 0.002469032978674379, "phrase": "management_systems"}, {"score": 0.002409188797323273, "phrase": "dynamic_geometry_software"}, {"score": 0.002336414425972225, "phrase": "geometry_course"}, {"score": 0.0022938068444116827, "phrase": "successful_track_record"}, {"score": 0.0022382002476510573, "phrase": "new_features"}, {"score": 0.002210903392596343, "phrase": "teachers'_tasks"}, {"score": 0.002190648965946838, "phrase": "non-trivial_problems"}, {"score": 0.002137537770621167, "phrase": "student_motivation"}, {"score": 0.0021049977753042253, "phrase": "real_time"}], "paper_keywords": ["dynamic geometry", " automatically checking exercises", " distance education", " geometry", " iGeom"], "paper_abstract": "One of the key issues in e-learning environments is the possibility of creating and evaluating exercises. However, the lack of tools supporting the authoring and automatic checking of exercises for specifics topics (e.g., geometry) drastically reduces advantages in the use of e-learning environments on a larger scale, as usually happens in Brazil. This paper describes an algorithm, and a tool based on it, designed for the authoring and automatic checking of geometry exercises. The algorithm dynamically compares the distances between the geometric objects of the student's solution and the template's solution, provided by the author of the exercise. Each solution is a geometric construction which is considered a function receiving geometric objects (input) and returning other geometric objects (output). Thus, for a given problem, if we know one function (construction) that solves the problem, we can compare it to any other function to check whether they are equivalent or not. Two functions are equivalent if, and only if, they have the same output when the same input is applied. If the student's solution is equivalent to the template's solution, then we consider the student's solution as a correct solution. Our software utility provides both authoring and checking tools to work directly on the Internet, together with learning management systems. These tools are implemented using the dynamic geometry software, iGeom, which has been used in a geometry course since 2004 and has a successful track record in the classroom. Empowered with these new features, iGeom simplifies teachers' tasks, solves non-trivial problems in student solutions and helps to increase student motivation by providing feedback in real time. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An algorithm for automatic checking of exercises in a dynamic geometry system: iGeom", "paper_id": "WOS:000258024000021"}