{"auto_keywords": [{"score": 0.0302777558645151, "phrase": "concept_space"}, {"score": 0.007954782804631763, "phrase": "design_process"}, {"score": 0.007395119377956903, "phrase": "sapphire_model"}, {"score": 0.00481495049065317, "phrase": "novelty-outcome_relationships"}, {"score": 0.004742113322179817, "phrase": "design_creativity"}, {"score": 0.004698938469311569, "phrase": "novel_and_useful_solutions"}, {"score": 0.0039011907503957075, "phrase": "previous_research"}, {"score": 0.0037724164140125137, "phrase": "seven_basic_constructs"}, {"score": 0.0036926830072270076, "phrase": "causal_connection"}, {"score": 0.003516684084316783, "phrase": "state_change"}, {"score": 0.002754472887620181, "phrase": "eight_existing_observational_studies"}, {"score": 0.002655324730688008, "phrase": "designing_session"}, {"score": 0.002631098941504841, "phrase": "individual_designer"}, {"score": 0.002567569159450693, "phrase": "design_problem"}, {"score": 0.0025132370375220213, "phrase": "think-aloud_protocol"}, {"score": 0.0023426638248794643, "phrase": "idea_space"}, {"score": 0.002265217884758413, "phrase": "strong_correlation"}, {"score": 0.00221726957085921, "phrase": "correlation_value"}, {"score": 0.002190326602897302, "phrase": "abstraction_level"}, {"score": 0.0021049977753042253, "phrase": "higher_abstraction_levels"}], "paper_keywords": ["Concept, Idea", " Novelty, Novelty Assessment Method, Variety", " Variety Assessment Method"], "paper_abstract": "Design creativity involves developing novel and useful solutions to design problems The research in this article is an attempt to understand how novelty of a design resulting from a design process is related to the kind of outcomes. described here as constructs, involved in the design process A model of causality, the SAPPhIRE model, is used as the basis of the analysis The analysis is based on previous research that shows that designing involves development and exploration of the seven basic constructs of the SAPPhIRE model that constitute the causal connection between the various levels of abstraction at which a design can be described The constructs am state change, action, parts. phenomenon. input. organs. and effect The following two questions are asked. Is there a relationship between novelty and the constructs? If them is a relationship, what is the degree of this relationship? A hypothesis is developed to answer the questions an increase in the number and variety of ideas explored while designing should enhance the variety of concept space. leading to an increase in the novelty of the concept space Eight existing observational studies of designing sessions are used to empirically validate the hypothesis Each designing session involves an individual designer. experienced or novice. solving a design problem by producing concepts and following a think-aloud protocol. The results indicate dependence of novelty of concept space on variety of concept space and dependence of variety of concept space on variety of idea space. thereby validating the hypothesis The Jesuits also reveal a strong correlation between novelty and the constructs, correlation value decreases as the abstraction level of the constructs reduces. signifying the importance of using constructs at higher abstraction levels for enhancing novelty", "paper_title": "Investigating novelty-outcome relationships in engineering design", "paper_id": "WOS:000277188000003"}