{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "medical_records"}, {"score": 0.004759635663291431, "phrase": "healthcare_outcomes"}, {"score": 0.004492406361795448, "phrase": "systematic_review"}, {"score": 0.00402514392911723, "phrase": "healthcare_quality"}, {"score": 0.0035855066449812273, "phrase": "methods_articles"}, {"score": 0.0035238299217327626, "phrase": "pubmed"}, {"score": 0.0033644530302903513, "phrase": "twenty-seven_english-language_controlled_studies"}, {"score": 0.00273167822885383, "phrase": "results_outcomes"}, {"score": 0.002548331088496964, "phrase": "efficiency_outcomes"}, {"score": 0.002461313735611462, "phrase": "in-person_and_telephone_encounters"}, {"score": 0.002377260665147444, "phrase": "health_records"}, {"score": 0.0023228223366301226, "phrase": "patients'_perceptions"}, {"score": 0.0021921063460682293, "phrase": "patient_anxiety"}, {"score": 0.0021049977753042253, "phrase": "patient_access"}], "paper_keywords": [""], "paper_abstract": "Objectives We conducted a systematic review to determine the effect of providing patients access to their medical records (electronic or paper-based) on healthcare quality, as defined by measures of safety, effectiveness, patient-centeredness, timeliness, efficiency, and equity. Methods Articles indexed in PubMed from January 1970 to January 2012 were reviewed. Twenty-seven English-language controlled studies were included. Outcomes were categorized as measures of effectiveness (n=19), patient-centeredness (n=16), and efficiency (n=2); no study addressed safety, timeliness, or equity. Results Outcomes were equivocal with respect to several aspects of effectiveness and patient-centeredness. Efficiency outcomes in terms of frequency of in-person and telephone encounters were mixed. Access to health records appeared to enhance patients' perceptions of control and reduced or had no effect on patient anxiety. Conclusion Although few positive findings generally favored patient access, the literature is unclear on whether providing patients access to their medical records improves quality.", "paper_title": "Patient access to medical records and healthcare outcomes: a systematic review", "paper_id": "WOS:000337660600030"}