{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "source_independence"}, {"score": 0.049636680610423214, "phrase": "blind_source_separation"}, {"score": 0.028718348224453127, "phrase": "filtered_sources"}, {"score": 0.004682708592184678, "phrase": "independent_component_analysis"}, {"score": 0.00415019999222481, "phrase": "latent_sources"}, {"score": 0.00383508177668219, "phrase": "natural_signals"}, {"score": 0.003678023470672862, "phrase": "frequency_band"}, {"score": 0.003244275497488318, "phrase": "optimal_filter"}, {"score": 0.00290173234777844, "phrase": "de-mixing_matrix"}, {"score": 0.0028350413546400703, "phrase": "mutual_information"}, {"score": 0.0026195184143518713, "phrase": "learned_de-mixing_matrix"}, {"score": 0.002523828967909659, "phrase": "source_signals"}, {"score": 0.002134592410214824, "phrase": "ica._experiments"}, {"score": 0.0021049977753042253, "phrase": "speech_signals"}], "paper_keywords": [""], "paper_abstract": "When exploiting independent component analysis (ICA) to perform blind source separation (BSS), it is assumed that sources are mutually independent. However, in practice, the latent sources are usually dependent to some extent. Fortunately, if the sources are the same type of natural signals, they may be mutually independent in some frequency band, and dependent in other band. It is possible to make them mutually independent by temporal-filtering. In this paper we investigate ways to find the optimal filter for enhancing source independence in two scenarios. If none of the sources is known, we propose to adaptively estimate the filter and the de-mixing matrix simultaneously by minimizing the mutual information between outputs. Consequently the learned filter makes the filtered sources as independent as possible and the learned de-mixing matrix successfully separates the mixtures. If some source signals are available, we can estimate the filter more reliably by making the filtered sources as independent as possible. After that, with temporal-filtering as preprocessing, we can successfully perform BSS using ICA. Experiments on separating speech signals and images are presented.", "paper_title": "Enhancement of source independence for blind source separation", "paper_id": "WOS:000236486300091"}