{"auto_keywords": [{"score": 0.032219105140299784, "phrase": "ontology-based_applications"}, {"score": 0.027923966936676203, "phrase": "proposed_tool"}, {"score": 0.00481495049065317, "phrase": "java_ontology"}, {"score": 0.004073027900718392, "phrase": "complex_ontology-based_applications"}, {"score": 0.003936220951530383, "phrase": "existing_tools"}, {"score": 0.0038695436922618876, "phrase": "simple_and_unified_environment"}, {"score": 0.0037395458116642306, "phrase": "data_manipulation"}, {"score": 0.0037140731069193896, "phrase": "rdf_triples"}, {"score": 0.0035526625882388936, "phrase": "object_orientation_paradigm"}, {"score": 0.0034332736827447654, "phrase": "object_orientation"}, {"score": 0.003239424058430806, "phrase": "sparql."}, {"score": 0.003066945490483524, "phrase": "efficient_development"}, {"score": 0.002994396880146532, "phrase": "existing_technologies"}, {"score": 0.002748984715897838, "phrase": "controlled_experiment"}, {"score": 0.002730240935688002, "phrase": "eight_developers"}, {"score": 0.0024387423375226507, "phrase": "novice_developers"}, {"score": 0.002308800317961002, "phrase": "real_educational_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Integrated development environment", " Ontology-based software", " Ontology manipulation tool", " Ontology-driven software development"], "paper_abstract": "In the past few years, the use of ontologies for creating more intelligent and effective application has increased considerably. This growth is due to the fact that ontologies attempt to provide semantics to the data consumed by machines so that they can reason about this data. However, developing complex ontology-based applications is still difficult and time-consuming because the existing tools do not provide a simple and unified environment for developers. Most of these tools only provide data manipulation using RDF triples, complicating the development of applications that need to work with the object orientation paradigm. Furthermore, tools that provide instances manipulation via object orientation do not support features such as manipulating ontologies, reasoning over rules or querying data with SPARQL. In this context, this work proposes a framework and a tool for supporting the efficient development of ontology-based applications through the integration of existing technologies. Furthermore, we also define a methodology to use this tool efficiently. In order to evaluate the benefits of our work, a controlled experiment with eight developers (unfamiliar with ontologies) was performed to compare the proposed tool, JOINT, with another one, Jastor/Jena, frequently used by the community. The results suggest that our tool helps novice developers to create ontology-based applications faster and with few errors in the code. In addition, a real educational application with 10 ontologies, more than 200 ontology concepts (classes) and more than a million triples is already using the proposed tool successfully. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "JOINT: Java ontology integrated toolkit", "paper_id": "WOS:000322857200024"}