{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-agent_systems"}, {"score": 0.006107902560205769, "phrase": "behavioral_economics"}, {"score": 0.004671156704912419, "phrase": "multiple_autonomous_entities"}, {"score": 0.004480394224548146, "phrase": "common_or_personal_goal"}, {"score": 0.004379631619412168, "phrase": "computer_software"}, {"score": 0.0037774893672602506, "phrase": "classical_game_theory"}, {"score": 0.003501452436803395, "phrase": "human_behavior"}, {"score": 0.002929344511491418, "phrase": "human_expectations"}, {"score": 0.002874257080906824, "phrase": "intended_goals"}, {"score": 0.0025843206540392184, "phrase": "classical_agent_model"}, {"score": 0.0024411935317269705, "phrase": "descriptive_models"}, {"score": 0.00233240715947344, "phrase": "fair_decisions"}, {"score": 0.0022115879730677, "phrase": "adaptive_multi-agent_systems"}, {"score": 0.0021049977753042253, "phrase": "experimental_and_analytical_results"}], "paper_keywords": [""], "paper_abstract": "Multi-agent systems are complex systems in which multiple autonomous entities, called agents, cooperate in order to achieve a common or personal goal. These entities may be computer software, robots, and also humans. In fact, many multi-agent systems are intended to operate in cooperation with or as a service for humans. Typically, multi-agent systems are designed assuming perfectly rational, self-interested agents, according to the principles of classical game theory. Recently, such strong assumptions have been relaxed in various ways. One such way is explicitly including principles derived from human behavior. For instance, research in the field of behavioral economics shows that humans are not purely self-interested. In addition, they strongly care about fairness. Therefore, multi-agent systems that fail to take fairness into account, may not be sufficiently aligned with human expectations and may not reach intended goals. In this paper, we present an overview of work in the area of fairness in multi-agent systems. More precisely, we first look at the classical agent model, that is, rational decision making. We then provide an outline of descriptive models of fairness, that is, models that explain how and why humans reach fair decisions. Then, we look at. prescriptive, computational models for achieving fairness in adaptive multi-agent systems. We show that results obtained by these models are compatible with experimental and analytical results obtained in the field of behavioral economics.", "paper_title": "Fairness in multi-agent systems", "paper_id": "WOS:000257182500002"}