{"auto_keywords": [{"score": 0.023422732188122044, "phrase": "model_journal_data_sharing_policy"}, {"score": 0.00481495049065317, "phrase": "stakeholder-driven_model"}, {"score": 0.004639712384096822, "phrase": "research_articles"}, {"score": 0.0034849681064606543, "phrase": "joint_information_systems"}, {"score": 0.003322540556404882, "phrase": "central_service"}, {"score": 0.003287482882222731, "phrase": "journal_research_data_policies"}, {"score": 0.0031176485976102688, "phrase": "current_state"}, {"score": 0.0030847461428168614, "phrase": "journal_data"}, {"score": 0.0030039966201398966, "phrase": "stakeholders'_views"}, {"score": 0.002863921785266393, "phrase": "large_percentage"}, {"score": 0.0027889366191837504, "phrase": "data_sharing_policy"}, {"score": 0.002468450551616404, "phrase": "related_data"}, {"score": 0.002279508335630797, "phrase": "consolidated_infrastructure"}, {"score": 0.0021387992835532367, "phrase": "quantitative_information"}, {"score": 0.0021049977753042253, "phrase": "existing_journal_data_policies"}], "paper_keywords": ["collaboration", " resource sharing", " journals"], "paper_abstract": "Conclusions of research articles depend on bodies of data that cannot be included in articles themselves. To share this data is important for reasons of both transparency and reuse. Science, Technology, and Medicine journals have a role in facilitating sharing, but by what mechanism is not yet clear. The Journal Research Data (JoRD) Project was a JISC (Joint Information Systems Committee)-funded feasibility study on the potential for a central service on journal research data policies. The objectives of the study included identifying the current state of journal data sharing policies and investigating stakeholders' views and practices. The project confirmed that a large percentage of journals have no data sharing policy and that there are inconsistencies between those that are traceable. This state leaves authors unsure of whether they should share article related data and where and how to deposit those data. In the absence of a consolidated infrastructure to share data easily, a model journal data sharing policy was developed by comparing quantitative information from analyzing existing journal data policies with qualitative data collected from stakeholders. This article summarizes and outlines the process by which the model was developed and presents the model journal data sharing policy.", "paper_title": "Research data sharing: Developing a stakeholder-driven model for journal policies", "paper_id": "WOS:000368338400005"}