{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "alphabetical_authorship"}, {"score": 0.0076687773631207296, "phrase": "scientific_publishing"}, {"score": 0.004681971826924847, "phrase": "different_ways"}, {"score": 0.00453144352814823, "phrase": "scientific_publication"}, {"score": 0.00428451995524549, "phrase": "author_names"}, {"score": 0.004108161406159407, "phrase": "authorship_order"}, {"score": 0.003994624397219346, "phrase": "contribution_authors"}, {"score": 0.0038661089070527424, "phrase": "contribution-_based_authorship"}, {"score": 0.003812299519486331, "phrase": "proper_credit_assignment"}, {"score": 0.0036553070575015344, "phrase": "first_author"}, {"score": 0.0034238045290210534, "phrase": "relative_contribution"}, {"score": 0.0033603864623013733, "phrase": "different_authors"}, {"score": 0.0031770714776989282, "phrase": "empirical_analysis"}, {"score": 0.00237733844863506, "phrase": "high_energy_physics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authorship order", " Alphabetical authorship", " Credit assignment", " Scientific publishing"], "paper_abstract": "There are different ways in which the authors of a scientific publication can determine the order in which their names are listed. Sometimes author names are simply listed alphabetically. In other cases, authorship order is determined based on the contribution authors have made to a publication. Contribution- based authorship can facilitate proper credit assignment, for instance by giving most credits to the first author. In the case of alphabetical authorship, nothing can be inferred about the relative contribution made by the different authors of a publication. In this paper, we present an empirical analysis of the use of alphabetical authorship in scientific publishing. Our analysis covers all fields of science. We find that the use of alphabetical authorship is declining over time. In 2011, the authors of less than 4% of all publications intentionally chose to list their names alphabetically. The use of alphabetical authorship is most common in mathematics, economics (including finance), and high energy physics. Also, the use of alphabetical authorship is relatively more common in the case of publications with either a small or a large number of authors. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An empirical analysis of the use of alphabetical authorship in scientific publishing", "paper_id": "WOS:000308581700029"}