{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-user_interfaces"}, {"score": 0.004597244847332915, "phrase": "\"natural\"_interaction"}, {"score": 0.004389339243427964, "phrase": "individual_and_noncolocated_technologies"}, {"score": 0.0039748192550806815, "phrase": "others'_actions"}, {"score": 0.003871024872459116, "phrase": "high_control"}, {"score": 0.0037203741725514126, "phrase": "high_availability"}, {"score": 0.0036714667610391535, "phrase": "background_information"}, {"score": 0.0032591491777773035, "phrase": "everyday_interaction"}, {"score": 0.0028173769301594745, "phrase": "social_developmental_psychology"}, {"score": 0.0021903801614787423, "phrase": "existing_designs"}], "paper_keywords": ["Collaboration", " constraints", " multi-user interfaces"], "paper_abstract": "Multi-user interfaces are said to provide \"natural\" interaction in supporting collaboration, compared to individual and noncolocated technologies. We identify three mechanisms accounting for the success of such interfaces: high awareness of others' actions and intentions, high control over the interface, and high availability of background information. We challenge the idea that interaction over such interfaces is necessarily \"natural\" and argue that everyday interaction involves constraints on awareness, control, and availability. These constraints help people interact more smoothly. We draw from social developmental psychology to characterize the design of multi-user interfaces in terms of how constraints on these mechanisms can be best used to promote collaboration. We use this framework of mechanisms and constraints to explain the successes and failures of existing designs, then apply it to three case studies of design, and finally derive from them a set of questions to consider when designing and analysing multi-user interfaces for collaboration.", "paper_title": "Mechanisms for Collaboration: A Design and Evaluation Framework for Multi-User Interfaces", "paper_id": "WOS:000302784500001"}