{"auto_keywords": [{"score": 0.029975003529628383, "phrase": "objective_measures"}, {"score": 0.015225090764745612, "phrase": "england"}, {"score": 0.009509573563227411, "phrase": "journey_time_accessibility"}, {"score": 0.00481495049065317, "phrase": "gis-based_journey_time_accessibility"}, {"score": 0.004628400269774981, "phrase": "accessibility_measures"}, {"score": 0.004529696178827392, "phrase": "objective_representations"}, {"score": 0.004481132747216135, "phrase": "'real'_conditions"}, {"score": 0.004230749292148046, "phrase": "wide_range"}, {"score": 0.004023120753104693, "phrase": "quantifiable_factors"}, {"score": 0.00397996666534913, "phrase": "journey_time"}, {"score": 0.0037710151976096985, "phrase": "nearest_destination"}, {"score": 0.0037305551963210523, "phrase": "origin_point"}, {"score": 0.0034716556902775037, "phrase": "people's_perceptions"}, {"score": 0.003397535839387366, "phrase": "objectively_measured_conditions"}, {"score": 0.0031730701021262155, "phrase": "subjective_measures"}, {"score": 0.002984794722633428, "phrase": "policy_decisions"}, {"score": 0.002767549954887752, "phrase": "gis"}, {"score": 0.002747676657869163, "phrase": "individuals'_self"}, {"score": 0.0026889720516076205, "phrase": "travel_survey_data"}, {"score": 0.0023451553255837317, "phrase": "urban_areas"}, {"score": 0.0023033100935570755, "phrase": "rural_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["journey time", " Accessibility", " Objective", " Subjective"], "paper_abstract": "Accessibility measures are usually designed to be objective representations of the 'real' conditions to provide a baseline for planning decisions and to track change over time. A wide range of approaches to measuring accessibility have been developed, usually based largely on quantifiable factors such as journey time. The simplest of these are based on the time taken to reach the nearest destination from an origin point. Destinations might include healthcare, education, employment or supermarkets, amongst others. This paper posits that people's perceptions and experiences may differ from objectively measured conditions and crucially may be more important for understanding behaviour. An understanding of the difference between objective and subjective measures, and how they relate to each other is therefore vital before using either measure to inform policy decisions. This paper compares two approaches to measuring journey time accessibility to a range of destinations using objective measures of accessibility, calculated using GIS and individuals' self reported values, based on travel survey data. Using two publically available datasets for England this paper explores the two approaches to measuring journey time accessibility to a range of destinations. Discordance between the two is found. Survey reported measures are found to be greater than objective measures in urban areas, but less in rural areas. This can be understood partly due to differences both between objective measures and reality and between perceptions and reality. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Same question, different answer: A comparison of GIS-based journey time accessibility with self-reported measures from the National Travel Survey in England", "paper_id": "WOS:000345805300008"}