{"auto_keywords": [{"score": 0.03690949231872686, "phrase": "information_sources"}, {"score": 0.015332884300205385, "phrase": "corporate_finance_professionals"}, {"score": 0.00481495049065317, "phrase": "corporate_finance"}, {"score": 0.00418134346679498, "phrase": "present_study"}, {"score": 0.004139401327448807, "phrase": "perceived_success"}, {"score": 0.003995876175614403, "phrase": "corporate_finance_professionals'_information_source_use_behavior"}, {"score": 0.0037235274565193665, "phrase": "statistical_analysis"}, {"score": 0.003576286811853861, "phrase": "work_success"}, {"score": 0.003540392285585644, "phrase": "specific_types"}, {"score": 0.0031845067058084583, "phrase": "individual_types"}, {"score": 0.0028642924503126154, "phrase": "instrumental_purpose"}, {"score": 0.002821247621250663, "phrase": "functional_relations"}, {"score": 0.002682370021834353, "phrase": "information_source_use"}, {"score": 0.002524688179363081, "phrase": "existing_perceptions"}, {"score": 0.002388283252319309, "phrase": "preferred_information_sources"}, {"score": 0.0022937210378944457, "phrase": "personal_and_organizational_perceptions"}, {"score": 0.0021807544600219216, "phrase": "information_services"}, {"score": 0.002158836285985314, "phrase": "information_literacy_education"}], "paper_keywords": [""], "paper_abstract": "The work of corporate finance professionals is information-intensive, despite the fact that the practices and motivations of their information preferences have been researched very little. The present study investigates perceived success and how it is related to corporate finance professionals' information source use behavior based on a Web survey of 92 Finnish corporate finance professionals. The principal finding of the statistical analysis of the data is that perceptions of work success and specific types of information sources contributing to the success are related. The correlations are complex, and very different types of information sources contribute to individual types of success, and vice versa. The findings indicate that information sources function as measures of success and serve an instrumental purpose. Besides functional relations, the correlation of the variables suggests more comprehensive success and information source use related dependencies and preferences. The findings imply that by studying existing perceptions of success, it is possible to make inferences about preferred information sources. The study also suggests that both personal and organizational perceptions of success should be taken into account when planning information services and information literacy education for corporate finance professionals to increase their effectiveness and relevance for the professionals.", "paper_title": "Information Sources and Perceived Success in Corporate Finance", "paper_id": "WOS:000283565500004"}