{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "phenome-wide_associations"}, {"score": 0.01468445477815343, "phrase": "entire_taiwanese_population"}, {"score": 0.010820461895738522, "phrase": "correlation_analysis"}, {"score": 0.0043512358455892, "phrase": "study_design"}, {"score": 0.004298666679374568, "phrase": "population-based_observational_study"}, {"score": 0.003964007795174772, "phrase": "taiwan's_national_health_insurance_research_database"}, {"score": 0.003685067218455088, "phrase": "male_and_female_subpopulations"}, {"score": 0.003370565320453525, "phrase": "association_estimates"}, {"score": 0.003171615440419782, "phrase": "strongest_positive_association_estimates"}, {"score": 0.003120568497402472, "phrase": "essential_hypertension"}, {"score": 0.0030455297429878873, "phrase": "association_patterns"}, {"score": 0.002984373546099842, "phrase": "strong_positive_correlation"}, {"score": 0.0029602552900111407, "phrase": "adjacent_age_groups"}, {"score": 0.0029244418026475832, "phrase": "correlation_estimates"}, {"score": 0.0027184540871935284, "phrase": "gender_groups"}, {"score": 0.0026530590435527527, "phrase": "pairwise_disease_association_patterns"}, {"score": 0.0023680327896318915, "phrase": "presented_database"}, {"score": 0.0022190974300886467, "phrase": "personalized_care"}, {"score": 0.0021221627745801478, "phrase": "early_management"}, {"score": 0.0021049977753042253, "phrase": "concomitant_diseases"}], "paper_keywords": ["phenotype", " association", " electronic health records", " disease complications"], "paper_abstract": "Objectives To objectively characterize phenome-wide associations observed in the entire Taiwanese population and represent them in a meaningful, interpretable way. Study Design In this population-based observational study, we analyzed 782 million outpatient visits and 15 394 unique phenotypes that were observed in the entire Taiwanese population of over 22 million individuals. Our data was obtained from Taiwan's National Health Insurance Research Database. Results We stratified the population into 20 gender-age groups and generated 28.8 million and 31.8 million pairwise odds ratios from male and female subpopulations, respectively. These associations can be accessed online at http://associations.phr.tmu.edu. tw. To demonstrate the database and validate the association estimates obtained, we used correlation analysis to analyze 100 phenotypes that were observed to have the strongest positive association estimates with respect to essential hypertension. The results indicated that association patterns tended to have a strong positive correlation between adjacent age groups, while correlation estimates tended to decline as groups became more distant in age, and they diverged when assessed across gender groups. Conclusions The correlation analysis of pairwise disease association patterns across different age and gender groups led to outcomes that were broadly predicted before the analysis, thus confirming the validity of the information contained in the presented database. More diverse individual disease-specific analyses would lead to a better understanding of phenome-wide associations and empower physicians to provide personalized care in terms of predicting, preventing, or initiating an early management of concomitant diseases.", "paper_title": "Profiling phenome-wide associations: a population-based observational study", "paper_id": "WOS:000361282200019"}