{"auto_keywords": [{"score": 0.04158910772275422, "phrase": "relative_position"}, {"score": 0.014858029475795361, "phrase": "personal_exposition"}, {"score": 0.014691359257821203, "phrase": "radio_frequency_electromagnetic_fields"}, {"score": 0.00481495049065317, "phrase": "multiple_exposimeters"}, {"score": 0.0043703658695579085, "phrase": "first_small_personal_exposimeters"}, {"score": 0.003193606324727067, "phrase": "controlled_experiment"}, {"score": 0.003068537223324389, "phrase": "statistically_significance_differences"}, {"score": 0.0022933216359142736, "phrase": "personal_exposimeters"}, {"score": 0.0021291870676682406, "phrase": "personal_exposimeters_limitations"}, {"score": 0.0021049977753042253, "phrase": "real_conditions"}], "paper_keywords": ["Electromagnetic fields", " Personal exposimeters", " Radio frequency"], "paper_abstract": "Purpose - Since first small personal exposimeters became available, some studies have characterized personal exposition to radio frequency electromagnetic fields. The effect of body and relative position of the exposimeter have been also analyzed but some questions are still unanswered. The paper aims to discuss these issues. Design/methodology/approach - Using three personal exposimeters in four different subjects, the authors characterized and compared measurements in a controlled experiment. Findings - The authors found statistically significance differences between exposimeters and subjects due to relative position (right and left) and a control position far from the body (center). It should indicate that body and relative position of the exposimeter affect directly to the measurement, conditioning final and average results. Research limitations/implications - Measurements using personal exposimeters have to be reconsidered and controlled. Originality/value - The authors test personal exposimeters limitations in real conditions.", "paper_title": "Using multiple exposimeters to evaluate the influence of the body when measuring personal exposition to radio frequency electromagnetic fields", "paper_id": "WOS:000359046300006"}