{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "normal_science_advancement"}, {"score": 0.0043786774510943625, "phrase": "scientific_impact"}, {"score": 0.0042354707960660706, "phrase": "web_survey"}, {"score": 0.003906804492585634, "phrase": "water_resources"}, {"score": 0.0036207206487324506, "phrase": "publishing_norms"}, {"score": 0.003199687131875466, "phrase": "twice_the_h-index"}, {"score": 0.003007846011394511, "phrase": "higher_expectations"}, {"score": 0.0028006988338192375, "phrase": "interdisciplinary_publishing"}, {"score": 0.0027479040199262393, "phrase": "cutting_edge"}, {"score": 0.0025954008219792337, "phrase": "author_credit_assignment"}, {"score": 0.0024984517279573906, "phrase": "lower_relationship"}, {"score": 0.002337403139264533, "phrase": "attitudinal_differences"}, {"score": 0.0022181655497912796, "phrase": "scientific_findings"}, {"score": 0.0021659920594094407, "phrase": "normal_science"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Credit assignment", " Multi-authorship", " H-index", " Survey"], "paper_abstract": "The objective of this work was to examine the relationship between attitudes about publishing across disciplines and the scientific impact of authors. We conducted a web survey of 1066 authors randomly selected from four disciplines in the Web of Knowledge: economics, anthropology, water resources and biochemistry (approximately 250 from each discipline). Authors were asked questions about publishing norms within their discipline. The h-index of authors was subsequently calculated from data available from the Web of Knowledge. Authors in biochemistry had on average twice the h-index of those in economics, anthropology and water resources. Biochemists had higher expectations about the number of articles published for hire and promotion, more strongly valued interdisciplinary publishing, felt the cutting edge of their science was clearer, and had more defined patterns of author credit assignment than the other disciplines. Anthropologists exhibited a lower relationship between h-index and the number of years since their first publication. We conclude that attitudinal differences between disciplines may lead to differences in the recognition of scientific findings and the therefore the establishment of normal science. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Attitudes about publishing and normal science advancement", "paper_id": "WOS:000327920400009"}