{"auto_keywords": [{"score": 0.046211774964878174, "phrase": "library_catalogues"}, {"score": 0.00481495049065317, "phrase": "purpose_-_library_online_public_access_catalogues"}, {"score": 0.004616859702338596, "phrase": "popular_internet_sites"}, {"score": 0.003929843607886348, "phrase": "opacs"}, {"score": 0.0034519236629123903, "phrase": "\"google_attack"}, {"score": 0.003415812499773905, "phrase": "findings_-_changes"}, {"score": 0.0033564619316337634, "phrase": "information_services"}, {"score": 0.00330972235893118, "phrase": "seven-year_period"}, {"score": 0.003286596407873823, "phrase": "least_development"}, {"score": 0.0030747771905143273, "phrase": "library_catalogue"}, {"score": 0.003042599375218838, "phrase": "web_search_engine"}, {"score": 0.003010757286626405, "phrase": "internet_bookstore"}, {"score": 0.0024824815904738685, "phrase": "knowledge_librarians"}, {"score": 0.002388487669097511, "phrase": "better_opacs"}, {"score": 0.002330530593384484, "phrase": "lost_ground"}, {"score": 0.0022660100755784057, "phrase": "information_needs"}, {"score": 0.0022110186828352752, "phrase": "opac"}, {"score": 0.0021049977753042253, "phrase": "panoramic_view"}], "paper_keywords": ["Online catalogues", " Internet", " Library users", " Librarians"], "paper_abstract": "Purpose - Library online public access catalogues (OPACs) are considered to be unattractive in comparison with Popular internet sites. In 2000, the authors presented some suggestions on how library catalogues should change. Have librarians actually made their OPACs more user-friendly by adopting techniques and technologies already present in other information resources? This paper aims to address these issues. Design/methodology/approach - The characteristics of four OPACS, one online bookstore and two internet search engines are analyzed. The paper reviews some of the changes and directions suggested by researchers and adds some of authors own. All this is in the hope that library catalogues will survive \"Google attack.\" Findings - Changes are identified in the information services studied over a seven-year period. Least development is found in library catalogues. Suggestions are made for library catalogues of the future. Research limitations/implications - A library catalogue, a web search engine and an internet bookstore cannot be compared directly because of differences in scope. But features from each could be fruitfully used in others. Practical implications - OPACs must be both attractive and useful. They should be at least as easy to use as their competitors. With the results of research as well as the knowledge librarians have many years, the profession should be able to develop better OPACs than we have today and regain lost ground in the \"competition\" for those with information needs. Originality/value - A comparison of OPAC features in 2000 and 2007, even if subjective, can provide a panoramic view of the development of the field.", "paper_title": "Have we made any progress? Catalogues of the future revisited", "paper_id": "WOS:000266464900008"}