{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "if-then_rules"}, {"score": 0.004732785510739708, "phrase": "fuzzy_sets"}, {"score": 0.004692227830462433, "phrase": "linguistic_summarization"}, {"score": 0.00465234082438284, "phrase": "ls"}, {"score": 0.0045726187330434025, "phrase": "data_mining_or_knowledge_discovery_approach"}, {"score": 0.004213519983188574, "phrase": "high_salary"}, {"score": 0.0031166151196841308, "phrase": "causal_databases"}, {"score": 0.0029980260560551982, "phrase": "five_quality_measures-the_degrees"}, {"score": 0.0025014259919355453, "phrase": "outlier_rules"}, {"score": 0.0024586427394152196, "phrase": "close-up_investigation"}, {"score": 0.002427035025924384, "phrase": "improved_parallel_coordinates"}, {"score": 0.002255431275670053, "phrase": "visualization_approaches"}, {"score": 0.0021049977753042253, "phrase": "granular_computing"}], "paper_keywords": ["Data mining", " fuzzy set (FS)", " granular computing", " IF-THEN rules", " interval type-2 (IT2) FS", " knowledge discovery", " linguistic summarization (LS)", " parallel coordinates", " perceptual reasoning", " rule visualization", " Wang-Mendel (WM) method"], "paper_abstract": "Linguistic summarization (LS) is a data mining or knowledge discovery approach to extract patterns from databases. Many authors have used this technique to generate summaries like \"Most senior workers have high salary,\" which can be used to better understand and communicate about data; however, few of them have used it to generate IF-THEN rules like \"IF X is large and Y is medium, THEN Z is small,\" which not only facilitate understanding and communication of data but can also be used in decision-making. In this paper, an LS approach to generate IF-THEN rules for causal databases is proposed. Both type-1 and interval type-2 fuzzy sets are considered. Five quality measures-the degrees of truth, sufficient coverage, reliability, outlier, and simplicity-are defined. Among them, the degree of reliability is especially valuable for finding the most reliable and representative rules, and the degree of outlier can be used to identify outlier rules and data for close-up investigation. An improved parallel coordinates approach for visualizing the IF-THEN rules is also proposed. Experiments on two datasets demonstrate our LS and rule visualization approaches. Finally, the relationships between our LS approach and the Wang-Mendel (WM) method, perceptual reasoning, and granular computing are pointed out.", "paper_title": "Linguistic Summarization Using IF-THEN Rules and Interval Type-2 Fuzzy Sets", "paper_id": "WOS:000286932000011"}