{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multichannel_applications"}, {"score": 0.012778608220156626, "phrase": "different_channels"}, {"score": 0.008876044129205153, "phrase": "idm"}, {"score": 0.004716520738331953, "phrase": "\"similar_interactive_experience"}, {"score": 0.004680128117194689, "phrase": "different_devices"}, {"score": 0.004656021776251681, "phrase": "different_technologies"}, {"score": 0.0035497797026638033, "phrase": "\"different_applications"}, {"score": 0.0034771228725942846, "phrase": "interactive_dialogue_model"}, {"score": 0.0033448623007224596, "phrase": "background_research"}, {"score": 0.003310447652300423, "phrase": "linguistic_theories"}, {"score": 0.003209306891991172, "phrase": "\"channel-independent\"_design_model"}, {"score": 0.003079228090561592, "phrase": "\"_channel-independent_fashion"}, {"score": 0.0029467742734417255, "phrase": "interactive_application"}, {"score": 0.0027622407190589326, "phrase": "overall_design_process"}, {"score": 0.0026916956768363158, "phrase": "additional_distinctive_features"}, {"score": 0.0025959411981464962, "phrase": "simple_graphic_notation"}, {"score": 0.0024586427394152196, "phrase": "early_stage"}, {"score": 0.002121408892446135, "phrase": "academic_and_industry_environments"}, {"score": 0.0021049977753042253, "phrase": "excellent_results"}], "paper_keywords": ["design methodology", " interactive systems", " user centered design", " user interfaces"], "paper_abstract": "Multichannel applications deliver the same content and a \"similar interactive experience\" using different devices and different technologies (e.g., web sites, palm held devices, car navigators, or interactive TVs). Various channels imply a number of differences, including screen (size), keyboard (size), pointing devices, output devices, performances, and the context of use (standing, sitting, walking, etc.). In most cases, today, applications for different channels are designed and implemented almost \"independently,\" with ineffectiveness for the developers (high costs) and ineffectiveness for the users (loss of consistency across the different channels and the perception that they are \"different applications\"). This paper presents an interactive dialogue model (IDM), a novel design model specifically tailored for multichannel applications. The background research, moving from linguistic theories and practices, has led us to the development of a \"channel-independent\" design model (based on dialogue primitives). Design can start in a \"conceptual,\" channel-independent fashion, and then proceed into a further \"logical\" design oriented toward specific channels of communication. Designing an interactive application in two steps (channel-independent first, and channel-dependent later) allows a number of advantages without making more cumbersome the overall design process. Beside the emphasis on multichannel, IDM has additional distinctive features: it is lightweight, providing a few set of primitives (and a simple graphic notation) which are easy to learn and teach. Moreover, it is suitable for brainstorming and generating ideas at early stage during design (or during the shift from requirements to design); finally, it is cost-effective (it requires little effort from designers) and modular (designers can take the part they wish, not being forced to \"all or nothing\"). IDM has been validated both in the academic and industry environments, providing excellent results so far.", "paper_title": "Interactive dialogue model: A design technique for multichannel applications", "paper_id": "WOS:000237822000010"}