{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_partitions"}, {"score": 0.027953388396833444, "phrase": "image_segmentation"}, {"score": 0.004584422792551236, "phrase": "blocks"}, {"score": 0.004523103062368843, "phrase": "refinement_order"}, {"score": 0.004136469845987887, "phrase": "filtering_methods"}, {"score": 0.0037490909410974166, "phrase": "new_blocks"}, {"score": 0.0036991458715587163, "phrase": "existing_ones"}, {"score": 0.0035532533960012298, "phrase": "filtering_techniques"}, {"score": 0.0030932495918679285, "phrase": "standard_order"}, {"score": 0.0029978863469038914, "phrase": "merging-inflating_and_inclusion-inflating_orders"}, {"score": 0.002778317177178732, "phrase": "height_functions"}, {"score": 0.0025518429503461736, "phrase": "connected_blocks"}, {"score": 0.0024620842899061614, "phrase": "lattice-theoretical_interpretation"}, {"score": 0.0022613292987262177, "phrase": "image_filtering"}, {"score": 0.0022112700457629494, "phrase": "component_trees"}], "paper_keywords": ["Mathematical morphology", " Image segmentation", " Connected image filtering", " Partial partition", " Connection", " Order", " Hierarchy"], "paper_abstract": "The refinement order on partitions corresponds to the operation of merging blocks in a partition, which is relevant to image segmentation and filtering methods. Its mathematical extension to partial partitions, that we call standard order, involves several operations, not only merging, but also creating new blocks or inflating existing ones, which are equally relevant to image segmentation and filtering techniques. These three operations correspond to three basic partial orders on partial partitions, the merging, inclusion and inflating orders. There are three possible combinations of these three basic orders, one of them is the standard order, the other two are the merging-inflating and inclusion-inflating orders. We study these orders in detail, giving in particular their minimal and maximal elements, covering relations and height functions. We interpret hierarchies of partitions and partial partitions in terms of an adjunction between (partial) partitions (possibly with connected blocks) and scalars. This gives a lattice-theoretical interpretation of edge saliency, hence a typology for the edges in partial partitions. The use of hierarchies in image filtering, in particular with component trees, is also discussed. Finally, we briefly mention further orders on partial partitions that can be useful for image segmentation.", "paper_title": "Ordering Partial Partitions for Image Segmentation and Filtering: Merging, Creating and Inflating Blocks", "paper_id": "WOS:000333339000012"}