{"auto_keywords": [{"score": 0.047026895004119516, "phrase": "total_size"}, {"score": 0.009122252488927014, "phrase": "last_item"}, {"score": 0.00481495049065317, "phrase": "open-end_bin_packing"}, {"score": 0.004678384952779725, "phrase": "open-end_bin_packing_problem"}, {"score": 0.0038403151693333017, "phrase": "first_variant"}, {"score": 0.003746673633703251, "phrase": "minimum_sized_item"}, {"score": 0.00327086925741257, "phrase": "next_variant"}, {"score": 0.003177958355586418, "phrase": "lazy_bin"}, {"score": 0.002999955539996569, "phrase": "first_condition"}, {"score": 0.0029147175927233546, "phrase": "possibly_one_bin"}, {"score": 0.0026953359825383646, "phrase": "asymptotic_fully_polynomial_time_approximation_schemes"}, {"score": 0.0025027144548626975, "phrase": "third_variant"}, {"score": 0.002461810159687652, "phrase": "input_items"}, {"score": 0.0023624435546097658, "phrase": "maximum_indexed_item"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Approximation algorithms", " Bin packing"], "paper_abstract": "We consider three variants of the open-end bin packing problem. Such variants of bin packing allow the total size of items packed into a bin to exceed the capacity of a bin, provided that a removal of the last item assigned to a bill would bring the contents of the bin below the capacity. In the first variant. this last item is the minimum sized item in the bin, that is, each bin must satisfy the property that the removal of any item should bring the total size of items in the bin below 1. The next variant (which is also known as lazy bin covering is similar to the first one, but in addition to the first condition, all bins (expect for possibly one bin) must contain a total size of items of at least 1. We show that these two problems admit asymptotic fully polynomial time approximation schemes (AFPTAS). Moreover, they turn Out to be equivalent. We briefly discuss a third variant, where the input items are totally ordered, and the removal of the Maximum indexed item should bring the total size of items in the bin below 1, and show that this variant is strongly NP-hard. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Asymptotic fully polynomial approximation schemes for variants of open-end bin packing", "paper_id": "WOS:000261357200006"}