{"auto_keywords": [{"score": 0.041935896024695225, "phrase": "fuzzy_rules"}, {"score": 0.010517549960534058, "phrase": "high-dimensional_space"}, {"score": 0.009832506348858095, "phrase": "parsimonious_fuzzy_classifiers"}, {"score": 0.004728780808284175, "phrase": "automatic_model_selection"}, {"score": 0.00468627326602559, "phrase": "fuzzy_rule"}, {"score": 0.0045200127552893704, "phrase": "new_scheme"}, {"score": 0.004223941453664225, "phrase": "model_selection"}, {"score": 0.004074016501033133, "phrase": "integrated_manner"}, {"score": 0.003671865026158296, "phrase": "svm_learning"}, {"score": 0.003249966782844541, "phrase": "lagrangian_multipliers"}, {"score": 0.0031203609829058587, "phrase": "output_contribution"}, {"score": 0.0028376361457661415, "phrase": "prototype-based_classifier"}, {"score": 0.0026157259734105, "phrase": "support_vectors"}, {"score": 0.0025341792091114184, "phrase": "induced_fuzzy_rules"}, {"score": 0.002433048706565187, "phrase": "experimental_results"}, {"score": 0.0024111277643627154, "phrase": "high-dimensional_benchmark_problems"}, {"score": 0.00233594452829104, "phrase": "proposed_scheme"}, {"score": 0.0021337783230121286, "phrase": "better_generalization_performance"}, {"score": 0.0021049977753042253, "phrase": "well-known_algorithms"}], "paper_keywords": ["feature ranking", " fuzzy classifier", " L2-support vector machine (L2-SVM)", " prototype-based classifier", " rule induction", " rule ranking"], "paper_abstract": "In this paper, a new scheme for constructing parsimonious fuzzy classifiers is proposed based on the L2-support vector machine (L2-SVM) technique with model selection and feature ranking performed simultaneously in an integrated manner, in which fuzzy rules are optimally generated from data by L2-SVM learning. In order to identify the most influential fuzzy rules induced from the SVM learning, two novel indexes for fuzzy rule ranking are proposed and named as alpha-values and omega-values of fuzzy rules in this paper. The ce-values are defined as the Lagrangian multipliers of the L2-SVM and adopted to evaluate the output contribution of fuzzy rules, while the w-values are developed by considering both the rule base structure and the output contribution of fuzzy rules. As a prototype-based classifier, the L2-SVM-based fuzzy classifier evades the curse of dimensionality in high-dimensional space in the sense that the number of support vectors, which equals the number of induced fuzzy rules, is not related to the dimensionality. Experimental results on high-dimensional benchmark problems have shown that by using the proposed scheme the most influential fuzzy rules can be effectively induced and selected, and at the same time feature ranking results can also be obtained to construct parsimonious fuzzy classifiers with better generalization performance than the well-known algorithms in literature.", "paper_title": "Constructing L2-SVM-based fuzzy classifiers in high-dimensional space with automatic model selection and fuzzy rule ranking", "paper_id": "WOS:000247285300007"}