{"auto_keywords": [{"score": 0.047293169449964985, "phrase": "visual_feedback"}, {"score": 0.010528502443614753, "phrase": "virtual_environments"}, {"score": 0.00481495049065317, "phrase": "vision_for_performance"}, {"score": 0.004682288586254123, "phrase": "feedback_timing"}, {"score": 0.004481132747216135, "phrase": "simple_reach"}, {"score": 0.004340263267055143, "phrase": "tabletop_virtual_environment"}, {"score": 0.004137184278868391, "phrase": "entire_reach"}, {"score": 0.004087910779160781, "phrase": "minimal_feedback"}, {"score": 0.003991110291836103, "phrase": "twelve_participants"}, {"score": 0.00374399358035391, "phrase": "index_finger"}, {"score": 0.0034702685641070283, "phrase": "wrist_velocity"}, {"score": 0.0034016119212097826, "phrase": "movement_initiation"}, {"score": 0.0032036590920314725, "phrase": "movement_onset"}, {"score": 0.00288736193515505, "phrase": "movement_time"}, {"score": 0.002686821995335494, "phrase": "deceleration_time_and_peak_aperture_measures"}, {"score": 0.002382987346529592, "phrase": "one's_hand"}, {"score": 0.0022531762659857507, "phrase": "detailed_rendering"}, {"score": 0.0022085455097790537, "phrase": "environmental_layout"}, {"score": 0.0021561514733516676, "phrase": "motion_lag"}], "paper_keywords": [""], "paper_abstract": "This work explores how people use visual feedback when performing simple reach-to-grasp movements in a tabletop virtual environment. In particular we investigated whether visual feedback is required for the entire reach or whether minimal feedback can be effectively used. Twelve participants performed reach-to-grasp movements toward targets at two locations. Visual feedback about the index finger and thumb was provided in four conditions: vision available throughout the movement, vision available up to peak wrist velocity, vision available until movement initiation, or vision absent throughout the movement. It was hypothesized that vision available until movement onset would be an advantage over a no vision situation yet not attain the performance observed when vision was available up to peak velocity. Results indicated that movement time was longest in the no vision condition but similar for the three conditions where vision was available. However, deceleration time and peak aperture measures suggest grasping is more difficult when vision is not available for at least the first third of the movement. These results suggest that designers of virtual environments can manipulate the availability of visual feedback of one's hand without compromising interactivity. This may be applied, for example, when detailed rendering of other aspects of the environmental layout is more important, when motion lag is a problem or when hand/object concealment is an issue.", "paper_title": "Vision for Performance in Virtual Environments: The Role of Feedback Timing", "paper_id": "WOS:000272798500004"}