{"auto_keywords": [{"score": 0.049378038061471514, "phrase": "never-cited_papers"}, {"score": 0.007152368807539886, "phrase": "time-dependent_distribution"}, {"score": 0.006803209072891911, "phrase": "non-citation_rate"}, {"score": 0.004620093797504386, "phrase": "six_journals"}, {"score": 0.004203715009643498, "phrase": "google"}, {"score": 0.004166620132202757, "phrase": "scopus"}, {"score": 0.004093453936415085, "phrase": "current_literature"}, {"score": 0.004069352078974872, "phrase": "citation_distribution"}, {"score": 0.0038133810870635844, "phrase": "time-dependent_patterns"}, {"score": 0.0037133478610481994, "phrase": "distribution_model"}, {"score": 0.003500313767208306, "phrase": "empirical_pilot_analysis"}, {"score": 0.0032510690712452147, "phrase": "paper_length"}, {"score": 0.0030374213037172803, "phrase": "three-parameter_negative_exponential_model"}, {"score": 0.0030017207229983385, "phrase": "timedependent_distribution_curve"}, {"score": 0.002897109710213723, "phrase": "initial_citation_time_window"}, {"score": 0.002755104031926742, "phrase": "citation_time_window"}, {"score": 0.0025587867729949037, "phrase": "total_degree"}, {"score": 0.0024333239726872604, "phrase": "wider_citation_time_windows"}, {"score": 0.0023415390666563177, "phrase": "stable_value"}, {"score": 0.002253208464566164, "phrase": "stable_percentages"}, {"score": 0.0022135695577201594, "phrase": "large_amount"}, {"score": 0.0022005118194652704, "phrase": "\"sleeping_beauties"}, {"score": 0.0021049977753042253, "phrase": "great_influence"}], "paper_keywords": ["Percentage of uncited papers", " Citation distribution", " Regularity in time-dependent distribution", " Influencing factors", " Negative exponential model", " Journal"], "paper_abstract": "The non-citation rate refers to the proportion of papers that do not attract any citation over a period of time following their publication. After reviewing all the related papers in Web of Science, Google Scholar and Scopus database, we find the current literature on citation distribution gives more focus on the distribution of the percentages and citations of papers receiving at least one citation, while there are fewer studies on the time-dependent patterns of the percentage of never-cited papers, on what distribution model can fit their time-dependent patterns, as well as on the factors influencing the non-citation rate. Here, we perform an empirical pilot analysis to the time-dependent distribution of the percentages of never-cited papers in a series of different, consecutive citation time windows following their publication in our selected six sample journals, and study the influence of paper length on the chance of papers' getting cited. Through the above analysis, the following general conclusions are drawn: (1) a three-parameter negative exponential model can well fit timedependent distribution curve of the percentages of never-cited papers; (2) in the initial citation time window, the percentage of never-cited papers in each journal is very high. However, as the citation time window becomes wider and wider, the percentage of never-cited papers begins to drop rapidly at first, and then drop more slowly, and the total degree of decline for most of journals is very large; (3) when applying the wider citation time windows, the percentage of never-cited papers for each journal begins to approach a stable value, and after that value, there will be very few changes in these stable percentages, unless we meet a large amount of \"Sleeping Beauties\" type papers; (4) the length of an paper has a great influence on whether it will be cited or not. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Regularity in the time-dependent distribution of the percentage of never-cited papers: An empirical pilot study based on the six journals", "paper_id": "WOS:000331771900013"}