{"auto_keywords": [{"score": 0.0433953933253375, "phrase": "online_algorithm"}, {"score": 0.02829755926317681, "phrase": "positive_constant_epsilon"}, {"score": 0.00481495049065317, "phrase": "restricted_graphs"}, {"score": 0.004708152527097594, "phrase": "online_graph_exploration_problem"}, {"score": 0.00448477700778838, "phrase": "starting_node"}, {"score": 0.004434745755769201, "phrase": "minimum_total_traverse_cost"}, {"score": 0.0043363441738461335, "phrase": "classical_traveling_salesperson_problem"}, {"score": 0.004023775199194536, "phrase": "node_v"}, {"score": 0.0036781781340563748, "phrase": "partial_and_incomplete_information"}, {"score": 0.003412887952564431, "phrase": "competitive_analysis"}, {"score": 0.0032629585038738856, "phrase": "depth-first_search"}, {"score": 0.003214455466823939, "phrase": "optimal_tour"}, {"score": 0.0028728747019026485, "phrase": "simple_cycles"}, {"score": 0.0025771355599741915, "phrase": "optimal_online_algorithm"}, {"score": 0.002260367486652148, "phrase": "unweighted_graphs"}, {"score": 0.0022101055924375725, "phrase": "optimal_result"}], "paper_keywords": ["the graph exploration problem", " online algorithm", " competitive analysis"], "paper_abstract": "The purpose of the online graph exploration problem is to visit all the nodes of a given graph and come back to the starting node with the minimum total traverse cost. However, unlike the classical Traveling Salesperson Problem, information of the graph is given online. When an online algorithm (called a searcher) visits a node v, then it learns information on nodes and edges adjacent to v. The searcher must decide which node to visit next depending on partial and incomplete information of the graph that it has gained in its searching process. The goodness of the algorithm is evaluated by the competitive analysis. If input graphs to be explored are restricted to trees, the depth-first search always returns an optimal tour. However, if graphs have cycles, the problem is non-trivial. In this paper we consider two simple cases. First, we treat the problem on simple cycles. Recently, Asahiro et al. proved that there is a 1.5-competitive online algorithm, while no online algorithm can be (1.25 - epsilon)-competitive for any positive constant epsilon. In this paper, we give an optimal online algorithm for this problem: namely, we give a 1+root 3/2 (approximate to 1.366)-competitive algorithm, and prove that there is no (1+root 3/2 - epsilon)-competitive algorithm for any positive constant epsilon. Furthermore, we consider the problem on unweighted graphs. We also give an optimal result; namely we give a 2-competitive algorithm and prove that there is no (2 - epsilon)-competitive online algorithm for any positive constant epsilon.", "paper_title": "The Online Graph Exploration Problem on Restricted Graphs", "paper_id": "WOS:000272392700002"}