{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "heat_transfer"}, {"score": 0.03111317431124807, "phrase": "cooling_channel"}, {"score": 0.03084231763794703, "phrase": "liquid_rocket_engine_thrust_chamber"}, {"score": 0.019701226448051095, "phrase": "fluid_flow"}, {"score": 0.0073027823648439604, "phrase": "optimal_number"}, {"score": 0.007173112898172773, "phrase": "rocket_engine_thrust_chamber"}, {"score": 0.005010766607647079, "phrase": "throat_region"}, {"score": 0.004322967486451877, "phrase": "optimal_channel_number"}, {"score": 0.0041891398413899435, "phrase": "cooling_effect"}, {"score": 0.004133055661437163, "phrase": "thrust_chamber"}, {"score": 0.003660788124282824, "phrase": "standard_k-epsilon"}, {"score": 0.0035936028827003217, "phrase": "acceptable_pressure_drop"}, {"score": 0.003531474887552889, "phrase": "cfd_method"}, {"score": 0.0034822754692298754, "phrase": "present_study"}, {"score": 0.0034356221356295277, "phrase": "useful_information"}, {"score": 0.0034220655476652683, "phrase": "available_experimental_data"}, {"score": 0.0033895917080039367, "phrase": "thermal_design"}, {"score": 0.003256922225995089, "phrase": "maximal_heat_flux"}, {"score": 0.0031702173541386888, "phrase": "hot-gas_side"}, {"score": 0.003071965703296204, "phrase": "symmetrical_center"}, {"score": 0.002963390095037466, "phrase": "strong_curvature"}, {"score": 0.0029236680654022664, "phrase": "cooling_channel_geometry"}, {"score": 0.0028844769395018595, "phrase": "secondary_flow"}, {"score": 0.0027825094419000637, "phrase": "typical_values"}, {"score": 0.0027575842698911173, "phrase": "pressure_drop"}, {"score": 0.0027328817607818207, "phrase": "temperature_difference"}], "paper_keywords": ["liquids", " rocket engines", " heat transfer", " gases", " optimization techniques"], "paper_abstract": "Purpose - To find the optimal number of channels of rocket engine thrust chamber, it was found that the optimal channel number is 335, at which the cooling effect of the thrust chamber cooling channel reaches the best, which can be helpful to design rocket engine thrust chamber. Design/methodology/approach - The commercial computational fluid dynamics (CFD) software FLUENT with standard k-epsilon; turbulent model was used. The CFD method was validated via comparing with the available experimental data. Findings - It was found that both the highest temperature and the maximal heat flux through the wall on the hot-gas side occurs about the throat region at the symmetrical center of the cooling channel. Owing to the strong curvature of the cooling channel geometry, the secondary flow reached its strongest level around the throat region. The typical values of pressure drop and temperature difference between the inlet and exit of cooling channel were 2.7 MPa and 67.38 K (standard case), respectively. Besides an optimal number of channels exist, and it is approximately 335, which can make the effect of heat transfer of cooling channels best with acceptable pressure drop. As a whole, the present study gives some useful information to the thermal design of liquid rocket engine thrust chamber. Research limitations/implications - More detailed computation and optimization should be performed for the fluid flow and heat transfer of cooling channel. Practical implications - A very useful optimization on heat transfer and fluid flow in cooling channel of liquid rocket engine thrust chamber. Originality/value - This paper provides the performance of optimization on heat transfer and fluid flow in cooling channel of liquid rocket engine thrust chamber, which can make the effect of heat transfer of cooling channels best with acceptable pressure drop. As a whole, the present study gives some useful information to the thermal design of liquid rocket engine thrust chamber.", "paper_title": "Numerical simulation and optimization on heat transfer and fluid flow in cooling channel of liquid rocket engine thrust chamber", "paper_id": "WOS:000242808500011"}