{"auto_keywords": [{"score": 0.044435149165965256, "phrase": "dwl"}, {"score": 0.00481495049065317, "phrase": "pervasive_systems"}, {"score": 0.004769969781576518, "phrase": "overview"}, {"score": 0.004611224230543916, "phrase": "distributed_w-learning"}, {"score": 0.004352876088312741, "phrase": "collaborative_agent-based_optimization"}, {"score": 0.004168618849008299, "phrase": "multiple_heterogeneous_policies"}, {"score": 0.0035741900278634616, "phrase": "overall_system_performance"}, {"score": 0.0034558655164987134, "phrase": "locally-best_action"}, {"score": 0.0032463805170627686, "phrase": "neighboring_agents"}, {"score": 0.003169222811082848, "phrase": "local_action's_importance"}, {"score": 0.003093893243443715, "phrase": "predefined_or_learned_collaboration_coefficient"}, {"score": 0.002837188425640173, "phrase": "large-scale_pervasive_systems"}, {"score": 0.002690886043654469, "phrase": "widely_deployed_fixed-time_and_simple_adaptive_utc_controllers"}, {"score": 0.002145942273032774, "phrase": "suitable_basis"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Autonomic computing", " reinforcement learning", " decentralized systems"], "paper_abstract": "This article describes Distributed W-Learning (DWL), a reinforcement learning-based algorithm for collaborative agent-based optimization of pervasive systems. DWL supports optimization towards multiple heterogeneous policies and addresses the challenges arising from the heterogeneity of the agents that are charged with implementing them. DWL learns and exploits the dependencies between agents and between policies to improve overall system performance. Instead of always executing the locally-best action, agents learn how their actions affect their immediate neighbors and execute actions suggested by neighboring agents if their importance exceeds the local action's importance when scaled using a predefined or learned collaboration coefficient. We have evaluated DWL in a simulation of an Urban Traffic Control (UTC) system, a canonical example of the large-scale pervasive systems that we are addressing. We show that DWL outperforms widely deployed fixed-time and simple adaptive UTC controllers under a variety of traffic loads and patterns. Our results also confirm that enabling collaboration between agents is beneficial as is the ability for agents to learn the degree to which it is appropriate for them to collaborate. These results suggest that DWL is a suitable basis for optimization in other large-scale systems with similar characteristics.", "paper_title": "Autonomic Multi-Policy Optimization in Pervasive Systems: Overview and Evaluation", "paper_id": "WOS:000304692500011"}