{"auto_keywords": [{"score": 0.026787666355514442, "phrase": "spt-rewa"}, {"score": 0.011014095376751498, "phrase": "erp"}, {"score": 0.008001649120266418, "phrase": "rewa"}, {"score": 0.007852759176579533, "phrase": "warp"}, {"score": 0.004724878518219719, "phrase": "optical_networks"}, {"score": 0.004592905436175987, "phrase": "point-to-multipoint_connection"}, {"score": 0.004401794742140806, "phrase": "internet_protocol_television"}, {"score": 0.004360417238963066, "phrase": "iptv"}, {"score": 0.003986103192038901, "phrase": "wavelength_continuity_constraint"}, {"score": 0.003948613642680196, "phrase": "physical_impairments"}, {"score": 0.0031920445513574907, "phrase": "multicast_tree"}, {"score": 0.0030881143614111552, "phrase": "minimum_number"}, {"score": 0.0025436978068459565, "phrase": "approximation_algorithm"}, {"score": 0.002281376328251423, "phrase": "optimal_solution"}, {"score": 0.002196609505859369, "phrase": "approximation_ratio"}], "paper_keywords": ["Light-tree", " Multicast", " 3R regenerator placement", " Wavelength assignment"], "paper_abstract": "Light-trees can efficiently guarantee point-to-multipoint connection in optical networks for many widely used multicast applications, such as Internet protocol television (IPTV). The establishment of a light-tree requires the placement of 3R regenerators along the tree due to the wavelength continuity constraint and physical impairments. Thus, the problem is to establish a light-tree and to assign wavelengths such that the number of regenerators is minimized. We call this problem the efficient 3R regenerator placement (ERP) problem. If we fix the routing of the multicast tree, then how to place a minimum number of regenerators and assign wavelengths to links becomes a subproblem of ERP, which is named the wavelength assignment and regenerator placement (WARP) problem. We find that ERP is NP-hard, and then provide an approximation algorithm named SPT-ReWa, which has a subroutine named ReWa which can solve WARP optimally. We prove that ReWa can find an optimal solution for WARP, and we analyze the approximation ratio of SPT-ReWa for ERP. Finally, we illustrate several simulation scenarios to show the efficiency of SPT-ReWa.", "paper_title": "Efficient Impairment-Constrained 3R Regenerator Placement for Light-Trees in Optical Networks", "paper_id": "WOS:000291439500010"}