{"auto_keywords": [{"score": 0.03489905603081331, "phrase": "raw_meshes"}, {"score": 0.00481495049065317, "phrase": "broken_mesh"}, {"score": 0.004653485665080485, "phrase": "intrinsic_distances"}, {"score": 0.004618342952383313, "phrase": "geodesic_paths"}, {"score": 0.004497410940849537, "phrase": "surface_representations"}, {"score": 0.0035147642199945387, "phrase": "tedious_manual_efforts"}, {"score": 0.003448705829033573, "phrase": "computational_framework"}, {"score": 0.003371066990851953, "phrase": "meaningful_approximate_intrinsic_distances"}, {"score": 0.0030892533800837463, "phrase": "user-specified_tolerance_threshold"}, {"score": 0.002974171397771052, "phrase": "multiple_connected_components"}, {"score": 0.002951673109860487, "phrase": "inconsistent_meshes"}, {"score": 0.002798865807872575, "phrase": "geodesic_distance_fields"}, {"score": 0.0025357050267224715, "phrase": "costly_additional_efforts"}, {"score": 0.0024785689583828796, "phrase": "broad_applicability"}, {"score": 0.0023412849215629986, "phrase": "memory_efficiency"}, {"score": 0.002305974875400655, "phrase": "presented_framework"}, {"score": 0.0022284577808744316, "phrase": "imperfect_meshes"}, {"score": 0.002169968849836984, "phrase": "input_applicability"}], "paper_keywords": [""], "paper_abstract": "Efficient methods to compute intrinsic distances and geodesic paths have been presented for various types of surface representations, most importantly polygon meshes. These meshes are usually assumed to be well-structured and manifold. In practice, however, they often contain defects like holes, gaps, degeneracies, non-manifold configurations - or they might even be just a soup of polygons. The task of repairing these defects is computationally complex and in many cases exhibits various ambiguities demanding tedious manual efforts. We present a computational framework that enables the computation of meaningful approximate intrinsic distances and geodesic paths on raw meshes in a way which is tolerant to such defects. Holes and gaps are bridged up to a user-specified tolerance threshold such that distances can be computed plausibly even across multiple connected components of inconsistent meshes. Further, we show ways to locally parameterize a surface based on geodesic distance fields, easily facilitating the application of textures and decals on raw meshes. We do all this without explicitly repairing the input, thereby avoiding the costly additional efforts. In order to enable broad applicability we provide details on two implementation variants, one optimized for performance, the other optimized for memory efficiency. Using the presented framework many applications can readily be extended to deal with imperfect meshes. Since we abstract from the input applicability is not even limited to meshes, other representations can be handled as well.", "paper_title": "Walking On Broken Mesh: Defect-Tolerant Geodesic Distances and Parameterizations", "paper_id": "WOS:000289996100040"}