{"auto_keywords": [{"score": 0.0316727896939775, "phrase": "zcz_length"}, {"score": 0.007905737065788131, "phrase": "igc_codes"}, {"score": 0.00481495049065317, "phrase": "inter-group_complementary_codes"}, {"score": 0.004644014990871423, "phrase": "general_construction"}, {"score": 0.004188198923320451, "phrase": "correlation_properties"}, {"score": 0.004123781267600542, "phrase": "newly_constructed_igc_codes"}, {"score": 0.0038959121068990517, "phrase": "autocorrelation_sidelobes"}, {"score": 0.0037381083634085424, "phrase": "zero_correlation_zone"}, {"score": 0.003201018846103988, "phrase": "different_groups"}, {"score": 0.0031032109441552287, "phrase": "key_point"}, {"score": 0.0029467742734417255, "phrase": "generated_igc_codes"}, {"score": 0.0024842254016803596, "phrase": "zcz"}], "paper_keywords": ["Z-complementary codes", " Perfect complementary codes", " Zero correlation zone"], "paper_abstract": "A general construction of inter-group complementary (IGC) codes is proposed based on perfect complementary (PC) codes, interleaving operation, and the orthogonal matrix. The correlation properties of the newly constructed IGC codes can be described as follows: (1) the autocorrelation sidelobes of the codes are zeros in the zero correlation zone (ZCZ); (2) the cross-correlation functions (CCFs) between any two different codes of the same group are zeros in the ZCZ; (3) the CCFs between any two codes of different groups are zeros everywhere. The key point of this construction is that the ZCZ length of the generated IGC codes can be chosen flexibly. It is well known that there is a limitation between the ZCZ length and the number of mates; that is, the smaller is the length of ZCZ, the more are the IGC codes that can be generated. Therefore, if we can choose the ZCZ length of the IGC codes flexibly according to the requirement of the system, more users can be accommodated in the system.", "paper_title": "A construction of inter-group complementary codes with flexible ZCZ length", "paper_id": "WOS:000296253000007"}