{"auto_keywords": [{"score": 0.048498986794460006, "phrase": "consumer_health_terms"}, {"score": 0.04439563634541902, "phrase": "new_concepts"}, {"score": 0.04162155390733082, "phrase": "existing_umls_concepts"}, {"score": 0.004540366791470228, "phrase": "umls"}, {"score": 0.004122699822340296, "phrase": "consumer_health_vocabulary"}, {"score": 0.00403709306806495, "phrase": "unmapped_consumer_health_concepts"}, {"score": 0.0038066979615349822, "phrase": "professional_medical_discourse"}, {"score": 0.003574364535717202, "phrase": "open_access_collaboratory_consumer_health_vocabulary"}, {"score": 0.0033141428467975795, "phrase": "manual_methods"}, {"score": 0.0030343239259424497, "phrase": "specified_criteria"}, {"score": 0.0027317585060414253, "phrase": "professional_health_terminologies"}, {"score": 0.0026975346834867313, "phrase": "remaining_terms"}, {"score": 0.00267495669519805, "phrase": "potential_candidates"}, {"score": 0.002630364569659529, "phrase": "professional_vocabularies"}, {"score": 0.0025541050375256992, "phrase": "post-coordinating_existing_umls_terms"}, {"score": 0.002500987934534128, "phrase": "new_and_existing_concepts"}, {"score": 0.002358050109031317, "phrase": "non-mapping_concepts"}, {"score": 0.0023284972218506157, "phrase": "small_proportion"}, {"score": 0.0021861845339709533, "phrase": "consumer_health_vocabulary_building"}, {"score": 0.002131720106846481, "phrase": "novel_approach"}], "paper_keywords": [""], "paper_abstract": "Objective: This study has two objectives: first, to identify and characterize consumer health terms not found in the Unified Medical Language System (UMLS) Metathesaurus (2007 AB); second, to describe the procedure for creating new concepts in the process of building a consumer health vocabulary. How do the unmapped consumer health concepts relate to the existing UMLS concepts? What is the place of these new concepts in professional medical discourse? Design: The consumer health terms were extracted from two large corpora derived in the process of Open Access Collaboratory Consumer Health Vocabulary (OAC CHV) building. Terms that could not be mapped to existing UMLS concepts via machine and manual methods prompted creation of new concepts, which were then ascribed semantic types, related to existing UMLS concepts, and coded according to specified criteria. Results: This approach identified 64 unmapped concepts, 17 of which were labeled as uniquely \"lay\" and not feasible for inclusion in professional health terminologies. The remaining terms constituted potential candidates for inclusion in professional vocabularies, or could be constructed by post-coordinating existing UMLS terms. The relationship between new and existing concepts differed depending on the corpora from which they were extracted. Conclusion: Non-mapping concepts constitute a small proportion of consumer health terms, but a proportion that is likely to affect the process of consumer health vocabulary building. We have identified a novel approach for identifying such concepts.", "paper_title": "Consumer health concepts that do not map to the UMLS: Where do they fit?", "paper_id": "WOS:000257794700013"}