{"auto_keywords": [{"score": 0.040633623956958555, "phrase": "naive_bayes"}, {"score": 0.00481495049065317, "phrase": "naive_bayes_classifier"}, {"score": 0.004659192888931046, "phrase": "machine_learning_task"}, {"score": 0.004527024978801684, "phrase": "simplest_methods"}, {"score": 0.004453245133130101, "phrase": "bayes"}, {"score": 0.004291393968030603, "phrase": "good_performance"}, {"score": 0.004101579688745222, "phrase": "normal_distribution"}, {"score": 0.0039362878637371574, "phrase": "previous_work"}, {"score": 0.003793206550770237, "phrase": "breast_cancer_database"}, {"score": 0.0037621210719690594, "phrase": "nottingham_city_hospital"}, {"score": 0.0029876282026237207, "phrase": "alternative_method"}, {"score": 0.002740109776120878, "phrase": "essential_structure"}, {"score": 0.002544296663333569, "phrase": "strong_violations"}, {"score": 0.0024017007954518065, "phrase": "multinomial_logistic_regression"}, {"score": 0.002276439636865258, "phrase": "competitive_alternative"}, {"score": 0.002202617924488607, "phrase": "data_sets"}, {"score": 0.0021755548389283856, "phrase": "non-normal_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Supervised learning", " Naive Bayes", " Logistic regression", " Breast cancer", " UCI data sets"], "paper_abstract": "Many algorithms have been proposed for the machine learning task of classification. One of the simplest methods, the naive Bayes classifier, has often been found to give good performance despite the fact that its underlying assumptions (of independence and a normal distribution of the variables) are perhaps violated. In previous work, we applied naive Bayes and other standard algorithms to a breast cancer database from Nottingham City Hospital in which the variables are highly non-normal and found that the algorithm performed well when predicting a class that had been derived from the same data. However, when we then applied naive Bayes to predict an alternative clinical variable, it performed much worse than other techniques. This motivated us to propose an alternative method, based on naive Bayes, which removes the requirement for the variables to be normally distributed, but retains the essential structure and other underlying assumptions of the method. we tested our novel algorithm on our breast cancer data and on three UCI datasets which also exhibited strong violations of normality. We found our algorithm outperformed naive Bayes in all four cases and outperformed multinomial logistic regression (MLR) in two cases. We conclude that our method offers a competitive alternative to MLR and naive Bayes when dealing with data sets in which non-normal distributions are observed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A 'non-parametric' version of the naive Bayes classifier", "paper_id": "WOS:000292224800005"}