{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_scan_statistic"}, {"score": 0.004674952036988355, "phrase": "spatial_data"}, {"score": 0.003599182629885611, "phrase": "non-technical_introduction"}, {"score": 0.0034504423179340738, "phrase": "associated_research"}, {"score": 0.0033078284621762817, "phrase": "information_school"}, {"score": 0.0029890721584351684, "phrase": "false_alerts"}, {"score": 0.0027123819773059127, "phrase": "definitive_way"}, {"score": 0.00266693888510356, "phrase": "spatial_accuracy"}, {"score": 0.0023996317685956213, "phrase": "detection_capability"}, {"score": 0.0023296961971785357, "phrase": "realistic_constraint"}, {"score": 0.0021049977753042253, "phrase": "potential_future_research_directions"}], "paper_keywords": ["case-control study", " geospatial data", " spatial epidemiology", " spatial scan statistic"], "paper_abstract": "The quantity and variety of spatial data have increased over recent years, and the variety and sophistication of tools for analysing this type of data have also increased. One such tool is the spatial scan statistic, which is freely available (www.satscan.org) and has been the subject of much scholarly research since its introduction in 1995 owing to its numerous applications in epidemiology, criminology and other fields. This paper provides readers with a non-technical introduction to the spatial scan statistic, together with an overview of associated research, which focuses particularly on work conducted at the University of Sheffield's Information School, in collaboration with the School of Health and Related Research. This work falls into three main areas. First, we provide an examination of the probability of obtaining false alerts when using the statistic, and ways in which this can be managed. Second, we describe the development of a definitive way of measuring the spatial accuracy of the statistic. Third, and potentially the most important in terms of impact, we discuss a means of substantially increasing the detection capability of the statistic by placing a realistic constraint on the strength of any cluster that is likely to be present in the data. The paper also provides a discussion of potential future research directions.", "paper_title": "New developments in the spatial scan statistic", "paper_id": "WOS:000314207200005"}