{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weight-flooding_aggregation"}, {"score": 0.04256473394973715, "phrase": "support_region"}, {"score": 0.004784795480627637, "phrase": "canny_edge_constraint"}, {"score": 0.004680725471654037, "phrase": "computation_efficiency"}, {"score": 0.004521720473366683, "phrase": "global_based_methods"}, {"score": 0.004327104321558231, "phrase": "local_region"}, {"score": 0.004166943227096525, "phrase": "cost_aggregation"}, {"score": 0.00373274905589689, "phrase": "significant_computing_power"}, {"score": 0.003594507685403249, "phrase": "novel_local_based_method"}, {"score": 0.00343966114729942, "phrase": "global_way"}, {"score": 0.003312238122534935, "phrase": "weight_map"}, {"score": 0.003229914287184765, "phrase": "edge_based_restriction"}, {"score": 0.0031895204047028554, "phrase": "cost_influences"}, {"score": 0.0029389598856744436, "phrase": "gradual_collection"}, {"score": 0.0028839835971201846, "phrase": "flooding_propagation"}, {"score": 0.0028034359621434486, "phrase": "neighboring_pixels"}, {"score": 0.002777088408582301, "phrase": "integral_computing"}, {"score": 0.0026910337912859268, "phrase": "pixel_optimization"}, {"score": 0.0026158609712563737, "phrase": "high_accuracy"}, {"score": 0.0024178580026395276, "phrase": "time_complexity"}, {"score": 0.0023651468875880628, "phrase": "l-r_check"}, {"score": 0.002328199473006809, "phrase": "post_processing"}, {"score": 0.0022068324655021396, "phrase": "experimental_results"}, {"score": 0.0021723527926629234, "phrase": "cross-based_local_method"}, {"score": 0.0021249824741421306, "phrase": "one-third_computing_cost"}, {"score": 0.0021049977753042253, "phrase": "comparable_estimation_accuracy"}], "paper_keywords": ["stereo matching", " 3D depth estimation", " weight-flooding cost aggregation", " local based method", " edge-constraint cost propagation"], "paper_abstract": "Considering the computation efficiency, local based 3D depth estimation has been considered of higher potential compared with global based methods. The most well recognized local based 3D depth estimation is the cross-based approach, which computes a local region for each pixel, called the support region, and the cost aggregation for the pixel is conducted within the support region. However, due to the optimization is conducted only within the support region, it also has less accuracy performance. Furthermore, obtaining the support region requires a significant computing power. In view of these problems, this paper proposes a novel local based method using weight-flooding aggregation for cost optimization in 3D depth estimation. The weight-flooding aggregation performs in a global way, such that every pixel transfers its cost to its neighboring pixels through a weight map. Accompanied with the weight-flooding aggregation is an edge based restriction to reduce the cost influences from other objects during the propagation. Any propagation passing through the edge will be stopped. The propagation in the flooding is performed from a gradual collection. Thus part of the flooding propagation to a pixel can be reused by the neighboring pixels and an integral computing can be applied. By so designed, the pixel optimization is allowed to receive costs globally, achieving high accuracy. Also, the lift of the requirement of obtaining support region for each pixel and the feasibility of applying integral computing significantly reduces the time complexity. In this paper, the L-R check is adopted as a post processing to rectify the errors which may result from mismatch due to occlusion or noise. The experimental results show that compared to cross-based local method, the system requires only half to one-third computing cost while achieves comparable estimation accuracy.", "paper_title": "Weight-Flooding Aggregation with Canny Edge Constraint for 3D Depth Estimation", "paper_id": "WOS:000362464100002"}