{"auto_keywords": [{"score": 0.04013373565369004, "phrase": "fuzzy_databases"}, {"score": 0.00481495049065317, "phrase": "human_machine_interaction"}, {"score": 0.0040334640350288, "phrase": "natural_way"}, {"score": 0.003990385737207714, "phrase": "user_expression"}, {"score": 0.003926626018798576, "phrase": "fuzzy_sets_theory"}, {"score": 0.0037615180375561805, "phrase": "consolidated_advance"}, {"score": 0.002724909017963099, "phrase": "fuzzy_database_applications"}, {"score": 0.0023694065215394593, "phrase": "oracle_ordbms."}, {"score": 0.002306543826130521, "phrase": "real_application"}, {"score": 0.0022696277881969896, "phrase": "medical_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Context aware applications", " Intelligent database systems", " Fuzzy databases", " Object relational DBMS"], "paper_abstract": "The development of mechanisms to ease human machine interaction is an issue about which there is increasing interest within both the software world in general, and database systems in particular. A way to tackle this problem is to try to approach the natural way of user expression. The Fuzzy Sets Theory and its application to build Fuzzy Databases constitute a consolidated advance in the literature. Another way is to adapt the interaction of the system to the context where it is running. In this sense, this paper presents an approach to build a model of Fuzzy Databases that dynamically adapts to user context. In order to do this, we have studied the management of the context in Fuzzy Database applications and we propose an architecture for the development of intelligent, flexible and customized context-aware database systems. We also present a proof of concept implementation to be used with SQL:99 standard in Oracle ORDBMS. Finally, through a real application in the medical area, we demonstrate the feasibility of the proposal. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Context-Aware Fuzzy Databases", "paper_id": "WOS:000344460600018"}