{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "authentication_methods"}, {"score": 0.004777215034749924, "phrase": "ebanking"}, {"score": 0.004647442352794694, "phrase": "multi-factor_authentication"}, {"score": 0.004312622975366676, "phrase": "fixed_password"}, {"score": 0.003817137134650275, "phrase": "one-time-passcodes"}, {"score": 0.0035981701736904495, "phrase": "mobile_phone"}, {"score": 0.00348655247465418, "phrase": "repeated-measures_experiment"}, {"score": 0.0029547698888028697, "phrase": "quality_ratings"}, {"score": 0.0028743610212291727, "phrase": "convenience_and_security_issues"}, {"score": 0.0027415611720084006, "phrase": "authentication_usability_metrics"}, {"score": 0.0026986685585382347, "phrase": "experienced_users"}, {"score": 0.0026774738852854427, "phrase": "higher_scores"}, {"score": 0.002594342451017824, "phrase": "overall_preferences"}, {"score": 0.002455009746748708, "phrase": "participant_sample"}, {"score": 0.002286781334850213, "phrase": "customer_attitudes"}, {"score": 0.002242127152093798, "phrase": "authentication_options"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Usability engineering", " Internet banking", " Authentication", " Usable security", " Empirical evaluation", " Experience"], "paper_abstract": "Multi-factor authentication involves the use of more than one mode in authentication processes and is typically employed to increase security compared to a fixed password (knowledge-based mode). This research compared three different eBanking authentication processes, a two-layer password (1-factor) method and two alternative 2-factor solutions. The 2-factor processes used One-Time-Passcodes (OTPs) delivered either via a small, single-use device or by text message to a mobile phone. The three authentication methods were compared in a repeated-measures experiment with 141 participants. Three user groups were balanced in the experiment to investigate the effect of experience (current users of the service) on perceptions of usability and security. Attitudes toward usability and observations were taken for each process. Other data gathered quality ratings, preferences and ranked comparisons regarding convenience and security issues. Both 2-factor methods scored significantly higher than the 1-factor method for eBanking authentication usability metrics overall, but experienced users gave higher scores to the 1-factor method they currently use. Overall preferences were spread evenly between the three methods. However, the majority of the participant sample perceived the 1-factor method they had most experience with as being the most secure and most convenient option. The results offer insight into customer attitudes important in their selection of authentication options: convenience, personal ownership and habitual experience of processes. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Usable security: User preferences for authentication methods in eBanking and the effects of experience", "paper_id": "WOS:000276328600001"}