{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "design_rationale_information"}, {"score": 0.004582722012454012, "phrase": "impact_analysis"}, {"score": 0.004534428070512318, "phrase": "major_redesign"}, {"score": 0.004377077848734575, "phrase": "systematic_industrial_use"}, {"score": 0.004136548839735555, "phrase": "key_idea"}, {"score": 0.003760137090849196, "phrase": "significant_improvement"}, {"score": 0.003720479367430766, "phrase": "particular_context"}, {"score": 0.003346119094502001, "phrase": "customization_strategy"}, {"score": 0.003229870860371533, "phrase": "specific_drd_information_item"}, {"score": 0.0028236828952575735, "phrase": "experimental_subjects"}, {"score": 0.002735194789581153, "phrase": "drd_information_item"}, {"score": 0.002316105585203396, "phrase": "customized_drd"}, {"score": 0.002275477757478827, "phrase": "full_documentation"}, {"score": 0.0022197909504890504, "phrase": "drd"}, {"score": 0.0021049977753042253, "phrase": "design_decision_rationale"}], "paper_keywords": ["Design", " Documentation", " Experimentation", " Empirical software engineering", " software architecture", " design decisions", " value-based software engineering", " software maintenance"], "paper_abstract": "A complete and detailed (full) Design Rationale Documentation (DRD) could support many software development activities, such as an impact analysis or a major redesign. However, this is typically too onerous for systematic industrial use as it is not cost effective to write, maintain, or read. The key idea investigated in this article is that DRD should be developed only to the extent required to support activities particularly difficult to execute or in need of significant improvement in a particular context. The aim of this article is to empirically investigate the customization of the DRD by documenting only the information items that will probably be required for executing an activity. This customization strategy relies on the hypothesis that the value of a specific DRD information item depends on its category (e. g., assumptions, related requirements, etc.) and on the activity it is meant to support. We investigate this hypothesis through two controlled experiments involving a total of 75 master students as experimental subjects. Results show that the value of a DRD information item significantly depends on its category and, within a given category, on the activity it supports. Furthermore, on average among activities, documenting only the information items that have been required at least half of the time (i.e., the information that will probably be required in the future) leads to a customized DRD containing about half the information items of a full documentation. We expect that such a significant reduction in DRD information should mitigate the effects of some inhibitors that currently prevent practitioners from documenting design decision rationale.", "paper_title": "The Value of Design Rationale Information", "paper_id": "WOS:000322480900006"}