{"auto_keywords": [{"score": 0.04930231023249967, "phrase": "erroneous_constraints"}, {"score": 0.00481495049065317, "phrase": "constrained_clustering_effectiveness"}, {"score": 0.004546970518808189, "phrase": "clustering_algorithms"}, {"score": 0.004382591802405206, "phrase": "new_algorithms"}, {"score": 0.004258843584164121, "phrase": "clustering_process"}, {"score": 0.0040713749949601915, "phrase": "vast_majority"}, {"score": 0.0036008372531664726, "phrase": "ideal_case"}, {"score": 0.003386301445203071, "phrase": "constraint_creation_process"}, {"score": 0.003290591812800382, "phrase": "inconsistent_information"}, {"score": 0.003158522476399068, "phrase": "constrained_clustering_algorithms"}, {"score": 0.0030317376771013703, "phrase": "important_role"}, {"score": 0.002659142621852998, "phrase": "imposed_constraints"}, {"score": 0.002500571634075998, "phrase": "numeric_datasets"}, {"score": 0.002256973121326987, "phrase": "positive_and_negative_constraints"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Algorithms", " Clustering", " Constrained clustering", " Erroneous constraints", " Experimentation"], "paper_abstract": "Recently a new fashion of semi-supervised clustering algorithms, coined as constrained clustering, has emerged. These new algorithms can incorporate some a priori domain knowledge to the clustering process, allowing the user to guide the method. The vast majority of studies about the effectiveness of these approaches have been performed using information, in the form of constraints, which was totally accurate. This would be the ideal case, but such a situation will be impossible in most realistic settings, due to errors in the constraint creation process, misjudgements of the user, inconsistent information, etc. Hence, the robustness of the constrained clustering algorithms when dealing with erroneous constraints is bound to play an important role in their final effectiveness. In this paper we study the behaviour of four constrained clustering algorithms (Constrained k-Means, Soft Constrained k-Means, Constrained Normalised Cut and Normalised Cut with Imposed Constraints) when not all the information supplied to them is accurate. The experimentation over text and numeric datasets using two different noise models, one of them an original approach based on similarities, highlighted the strengths and weaknesses of each method when working with positive and negative constraints, indicating the scenarios in which each algorithm is more appropriate. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An experimental study of constrained clustering effectiveness in presence of erroneous constraints", "paper_id": "WOS:000303223600013"}