{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "range_queries"}, {"score": 0.01799700860106103, "phrase": "aggregate_cubetree"}, {"score": 0.012297809261685222, "phrase": "data_warehouse_environments"}, {"score": 0.00739832598279783, "phrase": "range-aggregate_queries"}, {"score": 0.0044728217117695965, "phrase": "aggregate_operations"}, {"score": 0.0044644734709113985, "phrase": "data_cubes"}, {"score": 0.004016072233242585, "phrase": "aggregate_values"}, {"score": 0.0036125439380579626, "phrase": "query_range"}, {"score": 0.003417565253539315, "phrase": "partial_dimensions"}, {"score": 0.0033492947290751996, "phrase": "aggregation_operations"}, {"score": 0.002952356518921907, "phrase": "partially-dimensional_range_queries"}, {"score": 0.002524688179363081, "phrase": "novel_index_structure"}, {"score": 0.0023170054862555896, "phrase": "above-mentioned_weaknesses"}, {"score": 0.0022478501955483007, "phrase": "side_effects"}, {"score": 0.0021049977753042253, "phrase": "new_proposal"}], "paper_keywords": [""], "paper_abstract": "In order to efficiently evaluate range-aggregate queries in data warehouse environments, several works on data cubes (such as the aggregate cubetree) are proposed. In the aggregate cubetree, each entry in every node stores the aggregate values of its corresponding subtree. Therefore, range-aggregate queries can be processed without visiting the child nodes whose parent nodes are fully included in the query range. However, the aggregate cubetree does not take range queries using partial dimensions and range queries without aggregation operations into account. That is, 1) a great deal of information that is irrelevant to the queries also has to be read from the disk for partially-dimensional range queries and 2) while it improves the performance of range queries with aggregate operations, it degrades the performance of the range queries without aggregate operations. In this paper, we proposed a novel index structure, called Aggregate-Tree (denoted as Ag-Tree), which gets rid of the above-mentioned weaknesses of the aggregate cubetree without any side effects. The experiments and discussions presented in this paper indicate that the new proposal is significant for range queries in data warehouse environments.", "paper_title": "Ag-Tree: A novel structure for range queries in data warehouse environments", "paper_id": "WOS:000238093200035"}