{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vehicle_routing_problem"}, {"score": 0.04966229511350135, "phrase": "simultaneous_pick-up"}, {"score": 0.004354315061804687, "phrase": "classical_vehicle"}, {"score": 0.004095692768056685, "phrase": "delivery_service"}, {"score": 0.00397217701571219, "phrase": "single_depot"}, {"score": 0.0038692638652494697, "phrase": "vehicle's_service"}, {"score": 0.003818807671883534, "phrase": "pick-up_loads"}, {"score": 0.003498782065781398, "phrase": "vehicle's_load"}, {"score": 0.0033197446406648626, "phrase": "delivery_loads"}, {"score": 0.0032054891061528896, "phrase": "tabu_search_algorithm"}, {"score": 0.0031636612155559267, "phrase": "vrp-spd."}, {"score": 0.0030414140732789186, "phrase": "inter-route_adjacent_solutions"}, {"score": 0.002835599469639296, "phrase": "alternative_intra-route_solutions"}, {"score": 0.0025977542995083646, "phrase": "single_inter-route_movements"}, {"score": 0.0024007585788965655, "phrase": "next_movement"}, {"score": 0.0022089663761854657, "phrase": "frequency_penalization"}, {"score": 0.0021896891011033105, "phrase": "computational_results"}], "paper_keywords": ["vehicle routing", " pick-up and delivery service", " tabu search"], "paper_abstract": "The vehicle routing problem with simultaneous pick-up and delivery (VRP-SPD) is a variant of the classical vehicle routing problem (VRP) where clients require simultaneous pick-up and delivery service. Deliveries are supplied from a single depot at the beginning of the vehicle's service, while pick-up loads are taken to the same depot at the conclusion of the service. One important characteristic of this problem is that a vehicle's load in any given route is a mix of pick-up and delivery loads. In this paper we develop a tabu search algorithm to solve VRP-SPD. This algorithm uses three types of movements to obtain inter-route adjacent solutions: the relocation, interchange and crossover movements. A 2-opt procedure is used to obtain alternative intra-route solutions. Four types of neighbourhoods were implemented, three of them defined by the use of each of the single inter-route movements and the fourth by using a combination of these movements. Two different search strategies were implemented for selecting the next movement: first admissible movement and best admissible movement. Intensification and diversification of the search were achieved through frequency penalization. Computational results are reported for a set of 87 test problems with between 50 and 400 clients. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "A tabu search algorithm for the vehicle routing problem with simultaneous pick-up and delivery service", "paper_id": "WOS:000232326600003"}