{"auto_keywords": [{"score": 0.03847472140812669, "phrase": "intelligent_authoring_systems"}, {"score": 0.00481495049065317, "phrase": "theory-aware_authoring_tool"}, {"score": 0.0047869445645834, "phrase": "cscl"}, {"score": 0.004372655124839401, "phrase": "well-thought-out_collaborative_learning_scenarios"}, {"score": 0.004209739667710983, "phrase": "group_learning"}, {"score": 0.004148701869050005, "phrase": "learners'_interactions"}, {"score": 0.00412453424255527, "phrase": "learning_processes"}, {"score": 0.004052869371697375, "phrase": "learning_outcome"}, {"score": 0.003913238988370179, "phrase": "collaborative_learning_scenarios"}, {"score": 0.0037563823007675766, "phrase": "current_designing_methods"}, {"score": 0.003512173182208377, "phrase": "main_difficulties"}, {"score": 0.003381208502323146, "phrase": "better_ways"}, {"score": 0.0033418994267186202, "phrase": "group_learning_processes"}, {"score": 0.003255111384162138, "phrase": "innovative_approach"}, {"score": 0.003115428684709861, "phrase": "collaborative_learning"}, {"score": 0.003052304299267279, "phrase": "necessary_formalization"}, {"score": 0.0029992135990155374, "phrase": "learning_theories"}, {"score": 0.002904260480085368, "phrase": "effective_learning_scenarios"}, {"score": 0.0027959005260730827, "phrase": "next_generation"}, {"score": 0.0027472573325469144, "phrase": "theory-aware_systems"}, {"score": 0.002637013652072109, "phrase": "systematic_design"}, {"score": 0.0025760099091886165, "phrase": "intelligent_authoring_tool"}, {"score": 0.002560980198416571, "phrase": "cscl_design"}, {"score": 0.0024154111611296215, "phrase": "theory-compliant_collaborative_learning_scenarios"}, {"score": 0.002345752181173428, "phrase": "geometry_drawing_course"}, {"score": 0.0021994769642365714, "phrase": "important_pedagogical_strategies"}, {"score": 0.0021422934905256956, "phrase": "group_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontology", " Intelligent authoring system", " CSCL", " Collaborative learning design"], "paper_abstract": "One of the most useful ways to enhance collaboration is to create scenarios where learners are able to interact more effectively. Nevertheless, the design of pedagogically sound and well-thought-out collaborative learning scenarios is a complex issue. This is due to the context of group learning where the synergy among learners' interactions affects learning processes and, hence, the learning outcome. Although many advances have been made to support the designing of collaborative learning scenarios through technology, a more systematic approach is lacking. With the limitations of the current designing methods and tools, it is difficult to develop intelligent authoring systems that can guide users in order to produce more effective collaboration. One of the main difficulties with creating a more consistent (computer-understandable) approach to designing collaboration is the necessity of proposing better ways to formalize the group learning processes. In this paper, we present an innovative approach that uses ontologies and concepts from learning theories to create a framework that represents collaborative learning and its processes. Ontologies provide the necessary formalization to represent collaboration, while learning theories provide the concepts to justify and support the development of effective learning scenarios. Such an approach contributes to establish the foundations for the development of the next generation of intelligent authoring systems referred to as theory-aware systems. To verify the viability and usefulness of our proposed ontological framework in the context of systematic design, the development and use of an intelligent authoring tool for CSCL design is presented. This system is able to reason on ontologies to give suggestions that help users to create theory-compliant collaborative learning scenarios. We carried out several experiments with teachers in a geometry drawing course and the results indicate that the system helps teachers to create and interchange their scenarios more easily and facilitates the selection of important pedagogical strategies that influence positively the designing and effectiveness of group activities. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "The foundations of a theory-aware authoring tool for CSCL design", "paper_id": "WOS:000276114300001"}