{"auto_keywords": [{"score": 0.004766683200410046, "phrase": "amino_groups"}, {"score": 0.004695183699894267, "phrase": "density_functional_theory_calculations"}, {"score": 0.004309725894724034, "phrase": "hydrogen_atoms"}, {"score": 0.0036491673002304326, "phrase": "boron_atom"}, {"score": 0.003594369823549604, "phrase": "adsorption_energy"}, {"score": 0.003417565253539315, "phrase": "adsorption-energy_change"}, {"score": 0.003282383509542342, "phrase": "relative_electron-withdrawing"}, {"score": 0.0031845067058084583, "phrase": "functional_groups"}, {"score": 0.0031366648074858555, "phrase": "adsorption_energies"}, {"score": 0.0024742098091226203, "phrase": "amino_groups_results"}, {"score": 0.0023642842046859274, "phrase": "electronic_properties"}, {"score": 0.002202894673025544, "phrase": "amino_functional_groups"}], "paper_keywords": ["Amine", " B3LYP", " DFT", " Functionalization", " Nanostructures"], "paper_abstract": "Using density functional theory calculations, we investigated properties of a functionalized BC2N nanotube with NH3 and five other NH2-X molecules in which one of the hydrogen atoms of NH3 is substituted by X = -CH3, -CH2CH3, -COOH, -CH2COOH and -CH2CN functional groups. It was found that NH3 can be preferentially adsorbed on top of the boron atom, with adsorption energy of -12.0 kcal mol(-1). The trend of adsorption-energy change can be correlated with the trend of relative electron-withdrawing or -donating capability of the functional groups. The adsorption energies are calculated to be in the range of -1.8 to -14.2 kcal mol(-1), and their relative magnitude order is found as follows: H2N(CH2CH3) > H2N(CH3) > NH3 > H2N(CH2COOH) > H2N(CH2CN) > H2N(COOH). Overall, the functionalization of BC2N nanotube with the amino groups results in little change in its electronic properties. The preservation of electronic properties of BC2N coupled with the enhancement of solubility renders their chemical modification with either NH3 or amino functional groups to be a way for the purification of BC2N nanotubes.", "paper_title": "Theoretical study on the functionalization of BC2N nanotube with amino groups", "paper_id": "WOS:000319362500005"}