{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_objects"}, {"score": 0.014205635846322884, "phrase": "meccano"}, {"score": 0.004618342952383313, "phrase": "mobile_devices"}, {"score": 0.004232702713825967, "phrase": "interaction_method"}, {"score": 0.0041374874583908535, "phrase": "physical_discovery"}, {"score": 0.004106225442735525, "phrase": "versatile_configuration"}, {"score": 0.0038352452380298464, "phrase": "new_augmented_objects"}, {"score": 0.0037918465913284478, "phrase": "smart_ecosystem"}, {"score": 0.00373474182086791, "phrase": "rule-based_micro-services"}, {"score": 0.0033582976109650608, "phrase": "software_module"}, {"score": 0.0031365196064043494, "phrase": "smart_object"}, {"score": 0.0030542703032534766, "phrase": "specific_object"}, {"score": 0.002907184330345933, "phrase": "user's_mobile_device"}, {"score": 0.0027671619871474764, "phrase": "user's_needs"}, {"score": 0.00265394824073552, "phrase": "mobile_device"}, {"score": 0.002564763827975352, "phrase": "involved_objects"}, {"score": 0.002169968849836984, "phrase": "proposed_interaction_method"}, {"score": 0.0021049977753042253, "phrase": "developer's_and_the_end-user's_points"}], "paper_keywords": ["Ubiquitous computing", " smart objects", " interaction", " reasoning", " mobile technologies", " recommendation", " user generated services"], "paper_abstract": "In this paper, we exploit the capabilities of mobile devices as instruments to facilitate interaction in spaces populated with smart objects. We do this through MECCANO, a framework that supports an interaction method for a user to perform physical discovery and versatile configuration of behaviors involving a network of smart objects. Additionally, MECCANO guides the developer to easily integrate new augmented objects in the smart ecosystem. Behaviors are rule-based micro-services composed by a combination of events, conditions and actions that one or more smart objects can trigger, detect or perform. Each object owns and publishes its capabilities in a software module; this module becomes available when a user physically lies in the area of influence of the smart object. The capabilities provided by a specific object can be merged with those in other objects ( including those in the user's mobile device itself) to configure a behavior involving several objects, adapted to the user's needs. On operation, the behavior is run within the mobile device, serving the device as orchestrator of the involved objects. The framework also facilitates sharing micro-services in such a way that users can act as prosumers by generating their self-made behaviors. New behaviors are associated to the classes of objects that are needed to execute them, becoming ready for other users to download. The proposed interaction method and its tools are demonstrated both from the developer's and the end-user's points of view, through practical implementations.", "paper_title": "MECCANO: a Mobile-Enabled Configuration Framework to Coordinate and Augment Networks of Smart Objects", "paper_id": "WOS:000331434400003"}