{"auto_keywords": [{"score": 0.03922232778675158, "phrase": "medication_errors"}, {"score": 0.031763843900136826, "phrase": "computerized_prescribing_system"}, {"score": 0.00481495049065317, "phrase": "outpatient_computerized_prescribing_systems"}, {"score": 0.004539005582217309, "phrase": "outpatient_computer-generated_prescriptions"}, {"score": 0.004294625285753825, "phrase": "greatest_potential"}, {"score": 0.004123781267600542, "phrase": "retrospective_cohort_study"}, {"score": 0.0040334640350288, "phrase": "commercial_outpatient_pharmacy_chain"}, {"score": 0.00388729255686046, "phrase": "clinician_panel"}, {"score": 0.003802135020791801, "phrase": "previously_described_method"}, {"score": 0.003705130724701598, "phrase": "primary_outcomes"}, {"score": 0.0034034331737042363, "phrase": "prescribing_errors"}, {"score": 0.003378385493203297, "phrase": "error_type"}, {"score": 0.002551231163230566, "phrase": "manual_handwritten_prescription_error_rates"}, {"score": 0.002258212866482022, "phrase": "comprehensive_functionality"}, {"score": 0.0022005118194652704, "phrase": "meaningful_system_use"}, {"score": 0.0021284812539167112, "phrase": "targeted_recommendations"}, {"score": 0.0021049977753042253, "phrase": "computerized_prescribing_systems"}], "paper_keywords": [""], "paper_abstract": "Objective To report the frequency, types, and causes of errors associated with outpatient computer-generated prescriptions, and to develop a framework to classify these errors to determine which strategies have greatest potential for preventing them. Materials and methods This is a retrospective cohort study of 3850 computer-generated prescriptions received by a commercial outpatient pharmacy chain across three states over 4 weeks in 2008. A clinician panel reviewed the prescriptions using a previously described method to identify and classify medication errors. Primary outcomes were the incidence of medication errors; potential adverse drug events, defined as errors with potential for harm; and rate of prescribing errors by error type and by prescribing system. Results Of 3850 prescriptions, 452 (11.7%) contained 466 total errors, of which 163 (35.0%) were considered potential adverse drug events. Error rates varied by computerized prescribing system, from 5.1% to 37.5%. The most common error was omitted information (60.7% of all errors). Discussion About one in 10 computer-generated prescriptions included at least one error, of which a third had potential for harm. This is consistent with the literature on manual handwritten prescription error rates. The number, type, and severity of errors varied by computerized prescribing system, suggesting that some systems may be better at preventing errors than others. Conclusions Implementing a computerized prescribing system without comprehensive functionality and processes in place to ensure meaningful system use does not decrease medication errors. The authors offer targeted recommendations on improving computerized prescribing systems to prevent errors.", "paper_title": "Errors associated with outpatient computerized prescribing systems", "paper_id": "WOS:000296491600008"}