{"auto_keywords": [{"score": 0.048880968765446134, "phrase": "scopus"}, {"score": 0.00481495049065317, "phrase": "science_bibliometric_statistics_obtained"}, {"score": 0.004600228893803583, "phrase": "thomson_reuters"}, {"score": 0.00437281181878921, "phrase": "large-scale_bibliometric_indicators"}, {"score": 0.004328689762198895, "phrase": "isi's_citation_indexes"}, {"score": 0.004011603024990615, "phrase": "major_sources"}, {"score": 0.003971111060168551, "phrase": "bibliometric_data"}, {"score": 0.0037746771370555546, "phrase": "publisher_reed_elsevier"}, {"score": 0.0036614948691735105, "phrase": "bibliometric_analyses"}, {"score": 0.003393115177189967, "phrase": "important_question"}, {"score": 0.0032251796659158696, "phrase": "different_data_sources"}, {"score": 0.003144345057121367, "phrase": "macrolevel_bibliometric_indicators"}, {"score": 0.0023301793939902015, "phrase": "countries'_papers"}, {"score": 0.0021591707887653865, "phrase": "scientific_production"}, {"score": 0.0021049977753042253, "phrase": "country_level"}], "paper_keywords": [""], "paper_abstract": "For more than 40 years, the Institute for Scientific Information (ISI, now part of Thomson Reuters) produced the only available bibliographic databases from which bibliometricians could compile large-scale bibliometric indicators. ISI's citation indexes, now regrouped under the Web of Science (WoS), were the major sources of bibliometric data until 2004, when Scopus was launched by the publisher Reed Elsevier. For those who perform bibliometric analyses and comparisons of countries or institutions, the existence of these two major databases raises the important question of the comparability and stability of statistics obtained from different data sources. This paper uses macrolevel bibliometric indicators to compare results obtained from theWoS and Scopus. It shows that the correlations between the measures obtained with both databases for the number of papers and the number of citations received by countries, as well as for their ranks, are extremely high (R(2) approximate to .99). There is also a very high correlation when countries' papers are broken down by field. The paper thus provides evidence that indicators of scientific production and citations at the country level are stable and largely independent of the database.", "paper_title": "Comparing of Science Bibliometric Statistics Obtained From the Web and Scopus", "paper_id": "WOS:000266892700002"}