{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "structured_objects"}, {"score": 0.004721162131188487, "phrase": "decision_making"}, {"score": 0.004674952036988355, "phrase": "decision_support_systems"}, {"score": 0.004583878086896926, "phrase": "preferred_subset"}, {"score": 0.004278807087784626, "phrase": "individual_items"}, {"score": 0.0040334640350288, "phrase": "generic_preference_specification"}, {"score": 0.003802135020791801, "phrase": "arbitrary_set"}, {"score": 0.003566422652043389, "phrase": "online_newspaper"}, {"score": 0.002843372121209168, "phrase": "currently_available_set"}, {"score": 0.0026538282523433684, "phrase": "general_approach"}, {"score": 0.0025262061502713683, "phrase": "multiple_attributes"}, {"score": 0.0023003498123420237, "phrase": "optimal_subset"}, {"score": 0.0022443390559699974, "phrase": "relatively_efficient_manner"}, {"score": 0.0021896891011033105, "phrase": "empirical_evaluation"}, {"score": 0.0021049977753042253, "phrase": "worst-case_complexity_results"}], "paper_keywords": [""], "paper_abstract": "Various tasks in decision making and decision support systems require selecting a preferred subset of a given set of items. Here we focus on problems where the individual items are described using a set of characterizing attributes, and a generic preference specification is required, that is, a specification that can work with an arbitrary set of items. For example, preferences over the content of an online newspaper should have this form: At each viewing, the newspaper contains a subset of the set of articles currently available. Our preference specification over this subset should be provided offline, but we should be able to use it to select a subset of any currently available set of articles, e. g., based on their tags. We present a general approach for lifting formalisms for specifying preferences over objects with multiple attributes into ones that specify preferences over subsets of such objects. We also show how we can compute an optimal subset given such a specification in a relatively efficient manner. We provide an empirical evaluation of the approach as well as some worst-case complexity results.", "paper_title": "Generic Preferences over Subsets of Structured Objects", "paper_id": "WOS:000264231600001"}