{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pathway_axis"}, {"score": 0.041964847120006615, "phrase": "boolean_or_b"}, {"score": 0.013889213838308621, "phrase": "persistence_diagrams"}, {"score": 0.009379899874743153, "phrase": "boolean_or_b."}, {"score": 0.008377679099223094, "phrase": "pathway_graph"}, {"score": 0.007805990222533245, "phrase": "approximation_scheme"}, {"score": 0.004598027492787762, "phrase": "collection_b"}, {"score": 0.004517210371632577, "phrase": "three-dimensional_space"}, {"score": 0.00428314621261913, "phrase": "complement_space"}, {"score": 0.004119211418949265, "phrase": "useful_subset"}, {"score": 0.004075596668736259, "phrase": "medial_axis"}, {"score": 0.003486316700608598, "phrase": "collection_kappa"}, {"score": 0.00346164863873186, "phrase": "same-size_balls"}, {"score": 0.0033766722372180003, "phrase": "hausdorff_distance"}, {"score": 0.003247319029344241, "phrase": "prescribed_parameter"}, {"score": 0.0027577972695911825, "phrase": "major_topological_features"}, {"score": 0.0027188802510720775, "phrase": "large_voids"}, {"score": 0.0026333078412549807, "phrase": "b._we"}, {"score": 0.0025233755103976317, "phrase": "standard_point-sample_approaches"}, {"score": 0.002308834230545883, "phrase": "companion_paper"}, {"score": 0.0021049977753042253, "phrase": "plausible_pathways"}], "paper_keywords": [""], "paper_abstract": "Given a collection B of balls in a three-dimensional space, we wish to explore the cavities, voids, and tunnels in the complement space of boolean OR B. We introduce the pathway axis of B as a useful subset of the medial axis of the complement of boolean OR B and prove that it satisfies several desirable geometric properties. We present an algorithm that constructs the pathway graph of boolean OR B, a piecewise-linear approximation of the pathway axis. At the heart of our approach is an approximation scheme that constructs a collection kappa of same-size balls that approximate B so that the Hausdorff distance between boolean OR B and boolean OR kappa is bounded by a prescribed parameter. We prove a bound on the ratio between the number of balls in kappa and the number of balls in B. We employ this bound and the approximation scheme to show how to approximate the persistence diagrams for boolean OR B, which can be used to extract major topological features such as the large voids and tunnels in the complement of boolean OR B. We show that our approach is superior in terms of complexity to the standard point-sample approaches for the two problems that we address in this paper: approximating the pathway axis of B and approximating the persistence diagrams for boolean OR B. In a companion paper we introduce MolAxis, a tool for the identification of channels in macromolecules that demonstrates how the pathway graph and the persistence diagrams are used to identify plausible pathways in the complement of molecules.", "paper_title": "Approximating the Pathway Axis and the Persistence Diagrams for a Collection of Balls in 3-Space", "paper_id": "WOS:000280905600013"}