{"auto_keywords": [{"score": 0.04691383034029242, "phrase": "complex_networks"}, {"score": 0.00478218760286811, "phrase": "large_number"}, {"score": 0.0044209926093642235, "phrase": "fundamental_questions"}, {"score": 0.004331320910631647, "phrase": "information_exchange"}, {"score": 0.004243460284890507, "phrase": "biological_networks"}, {"score": 0.004214569581360156, "phrase": "functional_spatio-temporal_brain_activations"}, {"score": 0.004129067429043414, "phrase": "neuropsychiatric_pathologies"}, {"score": 0.004031495920060339, "phrase": "so-called_complex_networks"}, {"score": 0.003963211180578005, "phrase": "meaningful_measures"}, {"score": 0.003626272370749206, "phrase": "numerous_investigations"}, {"score": 0.003577032245103867, "phrase": "huge_but_sparsely_connected_network_structures"}, {"score": 0.003152006152091526, "phrase": "smaller_and_conceivably_dense_networks"}, {"score": 0.0030985717040741875, "phrase": "brain_activation"}, {"score": 0.002903628734069691, "phrase": "standard_hardware"}, {"score": 0.002786858120570499, "phrase": "dense_graph_characteristics"}, {"score": 0.002730240935688002, "phrase": "new_library"}, {"score": 0.0026565317818265394, "phrase": "dense_complex_networks"}, {"score": 0.002447101794397243, "phrase": "-unweighted_networks"}, {"score": 0.0024055884143050037, "phrase": "multi-core_approach"}, {"score": 0.0023728841359713106, "phrase": "comprehensive_code"}, {"score": 0.0023566987138026285, "phrase": "hardware_optimizations"}, {"score": 0.0023167153974120083, "phrase": "alternative_massively_parallel_gpu_implementation"}, {"score": 0.002238767763626708, "phrase": "comparing_benchmark"}, {"score": 0.002148677187261496, "phrase": "particular_network_issue"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Complex network", " Brain network", " OpenCL", " GPGPU", " Code optimization", " SSE"], "paper_abstract": "A large number of topics in biology, medicine, neuroscience, psychology and sociology can be generally described via complex networks in order to investigate fundamental questions of structure, connectivity, information exchange and causality. Especially, research on biological networks like functional spatio-temporal brain activations and changes, caused by neuropsychiatric pathologies, is promising. Analyzing those so-called complex networks, the calculation of meaningful measures can be very long-winded depending on their size and structure. Even worse, in many labs only standard desktop computers are accessible to perform those calculations. Numerous investigations on complex networks regard huge but sparsely connected network structures, where most network nodes are connected to only a few others. Currently, there are several libraries available to tackle this kind of networks. A problem arises when not only a few big and sparse networks have to be analyzed, but hundreds or thousands of smaller and conceivably dense networks (e.g. in measuring brain activation over time). Then every minute per network is crucial. For these cases there several possibilities to use standard hardware more efficiently. It is not sufficient to apply just standard algorithms for dense graph characteristics. This article introduces the new library FALCON developed especially for the exploration of dense complex networks. Currently, it offers 12 different measures (like clustering coefficients), each for undirected-unweighted, undirected-weighted and directed-unweighted networks. It uses a multi-core approach in combination with comprehensive code and hardware optimizations. There is an alternative massively parallel GPU implementation for the most time-consuming measures, too. Finally, a comparing benchmark is integrated to support the choice of the most suitable library for a particular network issue. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "FALCON or how to compute measures time efficiently on dynamically evolving dense complex networks?", "paper_id": "WOS:000333004500007"}