{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "combinatorial_double_auctions"}, {"score": 0.048465841392702935, "phrase": "combinatorial_double_auction_model"}, {"score": 0.0041345962781234435, "phrase": "high_complexity"}, {"score": 0.004087609837102023, "phrase": "winning_bids"}, {"score": 0.003831224748279043, "phrase": "relevant_challenging_research_issue"}, {"score": 0.0037161794591176033, "phrase": "business_model"}, {"score": 0.003659954070354848, "phrase": "real_world"}, {"score": 0.00356359155432419, "phrase": "existing_studies"}, {"score": 0.003264422557779251, "phrase": "surplus_optimization"}, {"score": 0.003013191092393344, "phrase": "computationally_efficient_approximate_algorithm"}, {"score": 0.0029675701595142656, "phrase": "complexity_issue"}, {"score": 0.002557322657104706, "phrase": "surplus_optimization_problem_formulation"}, {"score": 0.0025282151875392817, "phrase": "transaction_cost"}, {"score": 0.002360381056508368, "phrase": "optimization_problem"}], "paper_keywords": ["Double auction", " Integer programming", " Combinatorial auction"], "paper_abstract": "Although the combinatorial double auction model has been proposed for buyers and sellers to trade goods conveniently for over a decade, it is still not widely adopted. Several factors that hinder the adoption of combinatorial double auction model include the high complexity to determine winning bids and the lack of studies on the schemes to benefit winners in an auction. A relevant challenging research issue is to study how to make this business model acceptable in the real world. Motivated by the deficiency of existing studies on these factors, we will study how to take advantage of the surplus of combinatorial double auctions to benefit the winners based on surplus optimization and schemes to reward winners. The contributions of this study are threefold: (1) we propose a computationally efficient approximate algorithm to tackle the complexity issue in combinatorial double auctions, (2) we propose schemes to reward winners based on the surplus of auctions and (3) our study paves the way for the promotion of combinatorial double auction model. Our main results include (i) a surplus optimization problem formulation that takes transaction cost and supply/demand constraints into account (ii) a divide-and-conquer approach to decomposing the optimization problem into subproblems and a subgradient method to determine shadow price (iii) several schemes to reward winners and (iv) numerical results that indicate that the winners can be better off by applying our schemes. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Schemes to reward winners in combinatorial double auctions based on optimization of surplus", "paper_id": "WOS:000366161800002"}