{"auto_keywords": [{"score": 0.04523828542897125, "phrase": "network_coding"}, {"score": 0.03166181073351054, "phrase": "wifi_hotspot"}, {"score": 0.004633747992595526, "phrase": "residential_buildings"}, {"score": 0.004606479650820579, "phrase": "wifi_networks"}, {"score": 0.004552421225766146, "phrase": "primary_means"}, {"score": 0.0045122922461952805, "phrase": "internet_access"}, {"score": 0.004485735417293941, "phrase": "wireless_devices"}, {"score": 0.004278807087784626, "phrase": "great_promises"}, {"score": 0.004267715509749307, "phrase": "opportunistic_routing"}, {"score": 0.004228577663320847, "phrase": "communication_networks"}, {"score": 0.00420368356873615, "phrase": "intermediate_nodes"}, {"score": 0.004142084961822865, "phrase": "independent_incoming_information_flows"}, {"score": 0.003881556746152146, "phrase": "multicast_scenarios"}, {"score": 0.0036697319652557363, "phrase": "communication_benefits"}, {"score": 0.0036373553416391823, "phrase": "throughput_gain"}, {"score": 0.0035210572541244664, "phrase": "five_representative_scenarios"}, {"score": 0.00297522010445508, "phrase": "practical_system"}, {"score": 0.0029489527539649737, "phrase": "multi-channel_multi-radio_repeaters"}, {"score": 0.002821044196775531, "phrase": "access_point"}, {"score": 0.0027878797103973313, "phrase": "weak_signals"}, {"score": 0.0026277995163948263, "phrase": "interface_management"}, {"score": 0.0026045914281028473, "phrase": "idle_wireless_interfaces"}, {"score": 0.002142696637011647, "phrase": "promising_gains"}], "paper_keywords": ["IEEE 802.11", " WiFi hotspot", " Network coding", " Intra-flow and inter-flow network coding", " Unicast applications", " Opportunistic routing"], "paper_abstract": "In offices and residential buildings. WiFi networks have become a primary means for providing Internet access to wireless devices whose dominant traffic pattern is unicast. In the meantime, the emergence of network coding has brought about great promises for multicast in communication networks where intermediate nodes are allowed to process independent incoming information flows. Little is known about network coding for unicast, however. The objective of this paper is thus to depart from multicast scenarios and shed light on several possible unicast scenarios to which network coding may be applied in a WiFi hotspot in order to obtain communication benefits such as throughput gain, fairness, and reduced protocol complexity. We identify five representative scenarios in which network coding may be used to benefit unicasting in a WiFi hotspot. Several open research issues and practical challenges related to each scenario are discussed individually. To illustrate the benefits of network coding for unicast in a WiFi hotspot, we propose and implement iCORE: The interface COoperation Repeater-aided network coding Engine. iCORE is a practical system in which multi-channel multi-radio repeaters are used to relay unicast traffic for those terminals sitting far away from an access point and suffering from weak signals at a WiFi hotspot. It is based on our last scenario which illustrates the synergy among network coding, opportunistic routing, and interface management. Utilizing idle wireless interfaces and listening to traffic opportunistically, iCORE allows packets to move across the interfaces and to be coded across flows whenever it sees more transmission opportunities. We evaluate iCORE on a four-node chain-like topology testbed implemented using IEEE 802.11b/g radios and compare it to MORE - the state-of-art intra-flow network coding implementation based on opportunistic routing. Our experimental results reveal promising gains in terms of throughput over MORE. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Network coding for unicast in a WiFi hotspot: Promises, challenges, and testbed implementation", "paper_id": "WOS:000306879700012"}