{"auto_keywords": [{"score": 0.0466857719938336, "phrase": "expert_knowledge"}, {"score": 0.04555775691202158, "phrase": "software_design_patterns"}, {"score": 0.004738765336344627, "phrase": "software_engineering"}, {"score": 0.00458997570994803, "phrase": "software_development"}, {"score": 0.004389451298343287, "phrase": "objective_empirical_evidence"}, {"score": 0.004238035283883863, "phrase": "successful_design_structures"}, {"score": 0.004027031316965272, "phrase": "empirical_study"}, {"score": 0.0038633204164544802, "phrase": "effective_mechanism"}, {"score": 0.003838729434721053, "phrase": "knowledge_transfer"}, {"score": 0.0037299855191553, "phrase": "systematic_literature_review"}, {"score": 0.0036592001010420667, "phrase": "mapping_study"}, {"score": 0.0035103899379658006, "phrase": "relevant_primary_studies"}, {"score": 0.0034000375671935953, "phrase": "widely_referenced_book"}, {"score": 0.0029259540174253426, "phrase": "final_set"}, {"score": 0.002861224098631869, "phrase": "\"formal\"_experimental_studies"}, {"score": 0.0028429935010577975, "phrase": "object-oriented_design_patterns"}, {"score": 0.0027800937731919276, "phrase": "seven_\"experience\"_reports"}, {"score": 0.0026330549554033876, "phrase": "empirical_evidence"}, {"score": 0.0025830324526904427, "phrase": "multiple_studies"}, {"score": 0.002509770427841966, "phrase": "firm_support"}, {"score": 0.002180371753380285, "phrase": "future_studies"}, {"score": 0.00213893083537587, "phrase": "case_studies"}, {"score": 0.0021049977753042253, "phrase": "key_patterns"}], "paper_keywords": ["Design patterns", " systematic literature review", " empirical software engineering"], "paper_abstract": "Context. Although research in software engineering largely seeks to improve the practices and products of software development, many practices are based upon codification of expert knowledge, often with little or no underpinning from objective empirical evidence. Software design patterns seek to codify expert knowledge to share experience about successful design structures. Objectives. To investigate how extensively the use of software design patterns has been subjected to empirical study and what evidence is available about how and when their use can provide an effective mechanism for knowledge transfer about design. Method. We conducted a systematic literature review in the form of a mapping study, searching the literature up to the end of 2009 to identify relevant primary studies about the use of the 23 patterns catalogued in the widely referenced book by the \"Gang of Four.\" These studies were then categorized according to the forms of study employed, the patterns that were studied, as well as the context within which the study took place. Results. Our searches identified 611 candidate papers. Applying our inclusion/exclusion criteria resulted in a final set of 10 papers that described 11 instances of \"formal\" experimental studies of object-oriented design patterns. We augmented our analysis by including seven \"experience\" reports that described application of patterns using less rigorous observational forms. We report and review the profiles of the empirical evidence for those patterns for which multiple studies exist. Conclusions. We could not identify firm support for any of the claims made for patterns in general, although there was some support for the usefulness of patterns in providing a framework for maintenance, and some qualitative indication that they do not help novices learn about design. For future studies we recommend that researchers use case studies that focus upon some key patterns, and seek to identify the impact that their use can have upon maintenance.", "paper_title": "What Do We Know about the Effectiveness of Software Design Patterns?", "paper_id": "WOS:000308999100014"}