{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "humor_-_a_dialogue_system"}, {"score": 0.004550669123303854, "phrase": "human_computer_interaction"}, {"score": 0.004023120753104693, "phrase": "person's_commitment"}, {"score": 0.0036678472439508484, "phrase": "humor-equipped_casual_conversational_system"}, {"score": 0.0034485432592912917, "phrase": "user's_engagement"}, {"score": 0.003048370487544551, "phrase": "chat_logs"}, {"score": 0.002955782731675529, "phrase": "emotive_analysis_system"}, {"score": 0.002910545717767559, "phrase": "user_reactions"}, {"score": 0.0027505037762786087, "phrase": "russell's_two-dimensional_emotiveness_space"}, {"score": 0.00250732953434891, "phrase": "humor-equipped_system"}, {"score": 0.0022973933270056743, "phrase": "implications_of_results_and_relation"}, {"score": 0.002250601866422547, "phrase": "user_engagement"}, {"score": 0.0021049977753042253, "phrase": "positive_and_negative_engagement"}], "paper_keywords": ["Human-Computer Interaction", " dialogue", " AI and social sciences", " psycholinguistics"], "paper_abstract": "The topic of Human Computer Interaction (HCI) has been gathering more and more scientific attention of late. A very important, but often undervalued area in this field is human engagement. That is, a person's commitment to take part in and continue the interaction. In this paper we describe work on a humor-equipped casual conversational system (chatterbot) and investigate the effect of humor on a user's engagement in the conversation. A group of users was made to converse with two systems: one with and one without humor. The chat logs were then analyzed using an emotive analysis system to check user reactions and attitudes towards each system. Results were projected on Russell's two-dimensional emotiveness space to evaluate the positivity/negativity and activation/deactivation of these emotions. This analysis indicated emotions elicited by the humor-equipped system were more positively active and less negatively active than by the system without humor. The implications of results and relation between them and user engagement in the conversation are discussed. We also propose a distinction between positive and negative engagement.", "paper_title": "Activating Humans with Humor - A Dialogue System That Users Want to Interact with", "paper_id": "WOS:000273190800013"}