{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "longitudinal_research"}, {"score": 0.010564521518750706, "phrase": "longitudinal_data"}, {"score": 0.004492717291734985, "phrase": "longitudinal_research_designs"}, {"score": 0.004029187256595917, "phrase": "cross-sectional_research_designs"}, {"score": 0.0037039021744127783, "phrase": "temporal_relationships"}, {"score": 0.00308357048262018, "phrase": "cross-sectional_data"}, {"score": 0.002862648127577722, "phrase": "new_opportunities"}, {"score": 0.002806449337145999, "phrase": "information_systems"}, {"score": 0.0024916260764216752, "phrase": "new_light"}, {"score": 0.002467038647952607, "phrase": "prior_research"}, {"score": 0.0023828731731474306, "phrase": "cross-sectional_designs"}, {"score": 0.0021154652470551137, "phrase": "newer_data"}, {"score": 0.0021049977753042253, "phrase": "analytic_techniques"}], "paper_keywords": ["Longitudinal methods", " Latent growth models", " Random coefficients models"], "paper_abstract": "Recently, scholars in various disciplines have called for the use of longitudinal research designs to test and build theory. Their argument is that key phenomena in virtually. every theory change over time. As such, cross-sectional research designs used to test and extend theories do not provide insights that help understand the nature of temporal relationships between variables that are central to theory. Evidence is emerging that in some cases the strength and the direction of the relationship between variables found using longitudinal data is quite different relative to that found using cross-sectional data. The view expressed in this paper is that longitudinal research brings with it both new opportunities and challenges for information systems (IS) researchers. Opportunities will come in the form of explicitly incorporating time in testing and applying IS theories to cast new light on prior research that has been predominantly based on cross-sectional designs. At the same time, challenges will come in the form of proposing hypotheses on interrelationships between variables over time, and using newer data analytic techniques that are better suited to analyzing longitudinal data. We provide illustrations that highlight both advantages and challenges associated with longitudinal research in the field of IS.", "paper_title": "Changing the Way We Study Change: Advocating Longitudinal Research in MIS", "paper_id": "WOS:000336562300003"}