{"auto_keywords": [{"score": 0.04748801430076137, "phrase": "tactile_feedback"}, {"score": 0.00481495049065317, "phrase": "current_state-of-the-art_haptic_interfaces"}, {"score": 0.004487635647709636, "phrase": "kinesthetic_information"}, {"score": 0.0044052452943364314, "phrase": "person's_ability"}, {"score": 0.004292422863834094, "phrase": "virtual_environments"}, {"score": 0.004060256280654948, "phrase": "contact_location_display"}, {"score": 0.003784049616066444, "phrase": "chief_goal"}, {"score": 0.0037421829222825964, "phrase": "present_work"}, {"score": 0.003566028957296066, "phrase": "polygonal_geometric_models"}, {"score": 0.003461758868675955, "phrase": "resulting_contact_location_feedback"}, {"score": 0.0033730181385496186, "phrase": "polygonal_edges"}, {"score": 0.0030176779201170306, "phrase": "haptic_shading_algorithms"}, {"score": 0.0029185415814209055, "phrase": "faceted_objects"}, {"score": 0.0028969560940141233, "phrase": "smooth_objects"}, {"score": 0.0028017745468000587, "phrase": "contact_location_feedback"}, {"score": 0.002770745509774383, "phrase": "user_sensitivity"}, {"score": 0.002689666606553487, "phrase": "shading_algorithms"}, {"score": 0.0025157865918985682, "phrase": "second_experiment"}, {"score": 0.0024879169065840493, "phrase": "cld_device's_ability"}, {"score": 0.0024603551979225195, "phrase": "exploration_and_shape_recognition"}, {"score": 0.0022757667100089243, "phrase": "rendered_objects"}, {"score": 0.002258924405138231, "phrase": "reasonable_accuracy"}, {"score": 0.0021684903968454267, "phrase": "cld_device_design"}], "paper_keywords": [""], "paper_abstract": "Current state-of-the-art haptic interfaces only provide kinesthetic (force) feedback, yet studies have shown that providing tactile feedback in concert with kinesthetic information can dramatically improve a person's ability to dexterously interact with and explore virtual environments. In this research, tactile feedback was provided by a device, called a contact location display (CLD), which is capable of rendering the center of contact to a user. The chief goal of the present work was to develop algorithms that allow the CLD to be used with polygonal geometric models, and to do this without the resulting contact location feedback being overwhelmed by the perception of polygonal edges and vertices. Two haptic shading algorithms were developed to address this issue and successfully extend the use of the CLD to 2D and 3D polygonal environments. Two experiments were run to evaluate these haptic shading algorithms. The first measured perception thresholds for rendering faceted objects as smooth objects. It was found that the addition of contact location feedback significantly increased user sensitivity to edges and that the use of shading algorithms was able to significantly reduce the number of polygons needed for objects to feel smooth. The second experiment explored the CLD device's ability to facilitate exploration and shape recognition within a 3D environment. While this study provided a validation of our 3D algorithm, as people were able to identify the rendered objects with reasonable accuracy, this study underscored the need for improvements in the CLD device design in order to be effectively used in general 3D environments.", "paper_title": "Force and Contact Location Shading Methods for Use Within Two- and Three-Dimensional Polygonal Environments", "paper_id": "WOS:000302790800001"}