{"auto_keywords": [{"score": 0.03253253627295768, "phrase": "user_profile"}, {"score": 0.014436314223471193, "phrase": "geolocation_information"}, {"score": 0.004732785510739708, "phrase": "geolocation_prediction_for_social_images"}, {"score": 0.004692227830462433, "phrase": "social_image-sharing_websites"}, {"score": 0.004612147352416241, "phrase": "large_number"}, {"score": 0.0040186038781533946, "phrase": "automated_tool"}, {"score": 0.0035162927451540065, "phrase": "first_time"}, {"score": 0.0034562118159899772, "phrase": "user_uploading_patterns"}, {"score": 0.003426556090707852, "phrase": "user_geotagging_behaviors"}, {"score": 0.003324743991757282, "phrase": "taken-time_gap"}, {"score": 0.0032820385246266773, "phrase": "geographical_distance"}, {"score": 0.003050166508545763, "phrase": "historical_tags"}, {"score": 0.00295950473406239, "phrase": "multinomial_model"}, {"score": 0.002822434555587263, "phrase": "unified_framework"}, {"score": 0.002668582249630492, "phrase": "image_tags"}, {"score": 0.0026116610153271943, "phrase": "experimental_results"}, {"score": 0.002150900082318562, "phrase": "simple_method"}], "paper_keywords": [""], "paper_abstract": "Social image-sharing websites have attracted a large number of users. These systems allow users to associate geolocation information with their images, which is essential for many interesting applications. However, only a small fraction of social images have geolocation information. Thus, an automated tool for suggesting geolocation is essential to help users geotag their images. In this article, we use a large data set consisting of 221 million Flickr images uploaded by 2.2 million users. For the first time, we analyze user uploading patterns, user geotagging behaviors, and the relationship between the taken-time gap and the geographical distance between two images from the same user. Based on the findings, we represent a user profile by historical tags for the user and build a multinomial model on the user profile for geotagging. We further propose a unified framework to suggest geolocations for images, which combines the information from both image tags and the user profile. Experimental results show that for images uploaded by users who have never done geotagging, our method outperforms the state-of-the-art method by 10.6 to 34.2%, depending on the granularity of the prediction. For images from users who have done geotagging, a simple method is able to achieve very high accuracy.", "paper_title": "Where your photo is taken: Geolocation Prediction for Social Images", "paper_id": "WOS:000335583900011"}