{"auto_keywords": [{"score": 0.04933401710855323, "phrase": "cutting-stock_problem"}, {"score": 0.010612387000973441, "phrase": "global_search_strategy"}, {"score": 0.008708440537460067, "phrase": "optimization_problem"}, {"score": 0.004405348628112645, "phrase": "component_profiles"}, {"score": 0.004180809918117248, "phrase": "utility_rate"}, {"score": 0.004115697805448384, "phrase": "sheet_stock"}, {"score": 0.0037261429556468217, "phrase": "specific_orientations"}, {"score": 0.003251920460276645, "phrase": "global_search_strategies"}, {"score": 0.002897977113538355, "phrase": "cooling_rate"}, {"score": 0.002808298910480358, "phrase": "mutation_rate"}, {"score": 0.002678944072162297, "phrase": "different_settings"}, {"score": 0.002374735066990346, "phrase": "sqp_method"}, {"score": 0.002337684811187166, "phrase": "proposed_method"}, {"score": 0.002253461585851626, "phrase": "different_orientations"}, {"score": 0.0021049977753042253, "phrase": "parameter_setting"}], "paper_keywords": ["Cutting-stock problem", " Material saving", " Rotatable", " Sequential quadratic programming", " Global optimization"], "paper_abstract": "The cutting-stock problem, which considers how to arrange the component profiles on the material without overlaps, can increase the utility rate of the sheet stock. It is thus a standard constrained optimization problem. In some applications the components should be placed with specific orientations, but in others the components may be placed with any orientation. In general, the methods used to solve the cutting-stock problem usually have global search strategies to improve the solution, such as the Genetic Algorithm and the Simulated Annealing Algorithm. Unfortunately, many parameters, such as the temperature and the cooling rate of the Simulated Annealing method and the mutation rate of the Genetic Algorithm, have to be set and different settings of these parameters will strongly affect the result. This study formulates the cutting-stock problem as an optimization problem and solves it by the SQP method. The proposed method will make it easy to consider different orientations of components. This study also presents a global search strategy for which the parameter setting is easy.", "paper_title": "Sequential quadratic programming method with a global search strategy on the cutting-stock problem with rotatable polygons", "paper_id": "WOS:000304160600033"}