{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bacterial_virulent_proteins"}, {"score": 0.0473181943391754, "phrase": "evolutionary_information"}, {"score": 0.00459568664065473, "phrase": "chou's_pseudo_amino_acid_composition"}, {"score": 0.0044237033788643715, "phrase": "reliable_prediction_method"}, {"score": 0.004276216827737399, "phrase": "research_efforts"}, {"score": 0.004186534737631288, "phrase": "novel_drug_targets"}, {"score": 0.004151188559520802, "phrase": "vaccine_candidates"}, {"score": 0.004081385289516914, "phrase": "virulence_mechanisms"}, {"score": 0.0038789122930433305, "phrase": "feature_extraction"}, {"score": 0.0037495207047193034, "phrase": "novel_bacterial_virulent_protein_prediction_method"}, {"score": 0.003503497128638099, "phrase": "amino_acid_sequence"}, {"score": 0.003245900020944865, "phrase": "six_feature_extraction_methods"}, {"score": 0.0031242709509664837, "phrase": "support_vector_machine"}, {"score": 0.0029191527226078286, "phrase": "extensive_evaluation"}, {"score": 0.0028457440091791226, "phrase": "blind_testing_protocol"}, {"score": 0.0024736973328071026, "phrase": "proposed_method"}, {"score": 0.002380934815435267, "phrase": "blind_test_protocol"}, {"score": 0.0022626276288355432, "phrase": "independent_data"}, {"score": 0.0021410718792612173, "phrase": "different_methods"}, {"score": 0.0021229583685841405, "phrase": "prediction_efficiency"}], "paper_keywords": ["Virulent proteins", " machine learning", " ensemble of classifiers", " support vector machines"], "paper_abstract": "The availability of a reliable prediction method for prediction of bacterial virulent proteins has several important applications in research efforts targeted aimed at finding novel drug targets, vaccine candidates, and understanding virulence mechanisms in pathogens. In this work, we have studied several feature extraction approaches for representing proteins and propose a novel bacterial virulent protein prediction method, based on an ensemble of classifiers where the features are extracted directly from the amino acid sequence and from the evolutionary information of a given protein. We have evaluated and compared several ensembles obtained by combining six feature extraction methods and several classification approaches based on two general purpose classifiers (i.e., Support Vector Machine and a variant of input decimated ensemble) and their random subspace version. An extensive evaluation was performed according to a blind testing protocol, where the parameters of the system are optimized using the training set and the system is validated in three different independent data sets, allowing selection of the most performing system and demonstrating the validity of the proposed method. Based on the results obtained using the blind test protocol, it is interesting to note that even if in each independent data set the most performing stand-alone method is not always the same, the fusion of different methods enhances prediction efficiency in all the tested independent data sets.", "paper_title": "Identifying Bacterial Virulent Proteins by Fusing a Set of Classifiers Based on Variants of Chou's Pseudo Amino Acid Composition and on Evolutionary Information", "paper_id": "WOS:000299560500013"}