{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "manufacturing_operations"}, {"score": 0.04126073658431364, "phrase": "manufacturing-oriented_services"}, {"score": 0.013428294865978085, "phrase": "service_units"}, {"score": 0.013266339354068712, "phrase": "autonomous_work_systems"}, {"score": 0.0085092509208951, "phrase": "case_study"}, {"score": 0.004669845451682529, "phrase": "service-based_manufacturing_operations"}, {"score": 0.004392565073466714, "phrase": "manufacturing-oriented_service_network"}, {"score": 0.0041825926310470616, "phrase": "mosen"}, {"score": 0.0035887342563437935, "phrase": "manufacturing_systems"}, {"score": 0.0033139366449568565, "phrase": "product_quality"}, {"score": 0.0031942814007173254, "phrase": "mosen_concept"}, {"score": 0.0025615908073796027, "phrase": "service-based_quality_monitoring"}, {"score": 0.002453934333239467, "phrase": "web_service"}, {"score": 0.0021049977753042253, "phrase": "networked_manufacturing_environment"}], "paper_keywords": ["manufacturing networks", " work system", " manufacturing operations support", " manufacturing-oriented service"], "paper_abstract": "This article discusses service-based manufacturing operations support in manufacturing networks. The concept of a manufacturing-oriented service network (MOSeN) is introduced. A MOSeN consists of service units and autonomous work systems; the service units provide manufacturing-oriented services and the autonomous work systems consume manufacturing-oriented services. This approach aims to improve the performance of manufacturing systems by increasing their productivity, availability, responsiveness and agility, while maintaining product quality, all of which increase competitiveness. The MOSeN concept is adopted in a framework for manufacturing operations support (FMOS), which includes all of the elements necessary for its appropriate development and implementation. The use of the approach is illustrated in a case study of service-based quality monitoring. It is implemented as a web service, and its use in two different manufacturing plants is examined. The case study clearly demonstrates how manufacturing-oriented services can be effectively employed and integrated into manufacturing operations within a networked manufacturing environment.", "paper_title": "A service network for the support of manufacturing operations", "paper_id": "WOS:000308107500003"}