{"auto_keywords": [{"score": 0.04430670955456613, "phrase": "iphone_game"}, {"score": 0.010539695698707026, "phrase": "traditional_game"}, {"score": 0.008340978415472454, "phrase": "second_study"}, {"score": 0.00528974722217766, "phrase": "learning_process"}, {"score": 0.00481495049065317, "phrase": "educational_iphone_game"}, {"score": 0.0046352930395962685, "phrase": "initial_study"}, {"score": 0.004571630734130793, "phrase": "subject_preferences"}, {"score": 0.004540126719762935, "phrase": "educational_computer_games"}, {"score": 0.004325568312096711, "phrase": "first_study"}, {"score": 0.004050442607427367, "phrase": "established_learning_theories"}, {"score": 0.003899199029692063, "phrase": "spanish_law"}, {"score": 0.003872310849448784, "phrase": "primary_education"}, {"score": 0.0036891952845575036, "phrase": "better_learning_outcomes"}, {"score": 0.0033951334049808733, "phrase": "computer_games"}, {"score": 0.0032569835069392924, "phrase": "worldwide_trend"}, {"score": 0.003234509549830177, "phrase": "previous_studies"}, {"score": 0.0030814613175385672, "phrase": "significant_differences"}, {"score": 0.002720254890261961, "phrase": "traditional_one"}, {"score": 0.0026004698404274483, "phrase": "similar_knowledge_improvements"}, {"score": 0.002368233914089849, "phrase": "learning_activity"}, {"score": 0.002217326282120832, "phrase": "useful_tool"}, {"score": 0.002149231173009159, "phrase": "students'_training_needs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Game-based learning", " M-learning", " Augmented reality", " iPhone game", " Learning outcomes"], "paper_abstract": "In this paper, we present an initial study to determine the subject preferences for educational computer games for children, in which 150 education professionals participated. From the results of this first study, we have developed an iPhone game for transmitting knowledge as part of multiculturalism, solidarity and tolerance following established learning theories, several design principles, and the objectives and competences of the Spanish law for primary education. We also report on a second study to determine whether the iPhone game has better learning outcomes than a traditional game by analyzing the participation of 84 children ranging in age from 8 to 10 years old. The frequency of playing with consoles or computer games was also taken into account in this second study, and the worldwide trend of previous studies has been corroborated. For learning outcomes, the results did not show significant differences between the two groups. However, 96% of the children indicated that they would like to play with the iPhone game again, and 90% indicated that they preferred the experience with the iPhone game over the traditional one. From these results, we can conclude that the children achieved similar knowledge improvements using both the autonomous game (iPhone game) and the custom, guided game (traditional game). This could facilitate versatility in the learning process since the learning activity could be performed at any place and time without requiring supervision. Therefore, it could be a useful tool in the learning process and help teachers to fulfill students' training needs. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluation of learning outcomes using an educational iPhone game vs. traditional game", "paper_id": "WOS:000317027500001"}