{"auto_keywords": [{"score": 0.047805405209597675, "phrase": "angewandte_chemie_international_edition"}, {"score": 0.04634516381165268, "phrase": "google_scholar"}, {"score": 0.0456315961504987, "phrase": "scopus"}, {"score": 0.04510235343506707, "phrase": "chemical_abstracts"}, {"score": 0.03024433984581481, "phrase": "gs_data"}, {"score": 0.026650075423891518, "phrase": "fee-based_databases"}, {"score": 0.025412258167637362, "phrase": "convergent_validity"}, {"score": 0.00481495049065317, "phrase": "bibliometric_google_scholar_data"}, {"score": 0.004718431349852634, "phrase": "chemistry-citation_counts"}, {"score": 0.004404445045826858, "phrase": "science_citation_index"}, {"score": 0.004246729915110547, "phrase": "comprehensive_set"}, {"score": 0.003900257249255497, "phrase": "prime_chemistry_journals"}, {"score": 0.0026103363762901423, "phrase": "gs_citation_data"}, {"score": 0.0023680327896318915, "phrase": "citation_analyses"}, {"score": 0.0021922308351126746, "phrase": "citation_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web of Science", " Science Citation Index", " Scopus", " Chemical Abstracts", " Google Scholar", " Citation analysis"], "paper_abstract": "Examining a comprehensive set of papers (n = 1837) that were accepted for publication by the journal Angewandte Chemie International Edition (one of the prime chemistry journals in the world) or rejected by the journal but then published elsewhere, this study tested the extent to which the use of the freely available database Google Scholar (GS) can be expected to yield valid citation counts in the field of chemistry. Analyses of citations for the set of papers returned by three fee-based databases - Science Citation Index, Scopus, and Chemical Abstracts - were compared to the analysis of citations found using GS data. Whereas the analyses using citations returned by the three fee-based databases show very similar results, the results of the analysis using GS citation data differed greatly from the findings using citations from the fee-based databases. Our study therefore supports, on the one hand, the convergent validity of citation analyses based on data from the fee-based databases and, on the other hand, the lack of convergent validity of the citation analysis based on the GS data. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Convergent validity of bibliometric Google Scholar data in the field of chemistry-Citation counts for papers that were accepted by Angewandte Chemie International Edition or rejected but published elsewhere, using Google Scholar, Science Citation Index, Scopus, and Chemical Abstracts", "paper_id": "WOS:000262496700003"}