{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local_directional_moves"}, {"score": 0.007853188904343666, "phrase": "bb-bc_algorithm"}, {"score": 0.0072962611359588736, "phrase": "crunching_phase"}, {"score": 0.004761968711051715, "phrase": "big_bang-big_crunch"}, {"score": 0.004727025962385698, "phrase": "bb"}, {"score": 0.004555781299332848, "phrase": "novel_optimization_method"}, {"score": 0.004310501708408856, "phrase": "namely_the_big_bang"}, {"score": 0.004278807087784626, "phrase": "big_crunch_theory"}, {"score": 0.004093453936415085, "phrase": "quick_convergence"}, {"score": 0.003844478919573134, "phrase": "bb-bc_optimization_algorithm"}, {"score": 0.0037881238886444332, "phrase": "local_search_moves"}, {"score": 0.0036778708850237814, "phrase": "\"crunching\"_phases"}, {"score": 0.003479692058963528, "phrase": "representative_point"}, {"score": 0.003161065111494053, "phrase": "previous_representative_points"}, {"score": 0.0030464123943266673, "phrase": "better_representative_point"}, {"score": 0.0028293966058473476, "phrase": "enhanced_bb-bc_algorithm"}, {"score": 0.0026472970609754095, "phrase": "simplex-based_local_search_routine"}, {"score": 0.0025892330566358503, "phrase": "new_hybridized_algorithm"}, {"score": 0.0024677487011556427, "phrase": "widely_used_evolutionary_computation_methods"}, {"score": 0.0022834017104377525, "phrase": "benchmark_test_functions"}, {"score": 0.0021049977753042253, "phrase": "function_evaluations"}], "paper_keywords": ["Big bang-big crunch optimization algorithm", " evolutionary computation", " hybrid local search"], "paper_abstract": "The big bang-big crunch (BB-BC) algorithm has been proposed as a novel optimization method that relies on one of the theories of the evolution of the universe, namely the big bang and big crunch theory. It has been shown that this algorithm is capable of quick convergence, even in long, narrow parabolic-shaped flat valleys or in the existence of several local extremes. In this work, the BB-BC optimization algorithm is hybridized with local search moves in between the \"banging\" and \"crunching\" phases of the algorithm. These 2 original phases of the BB-BC algorithm are preserved, but the representative point (\"best\" or \"fittest\" point) attained after the crunching phase of the iteration is modified with some local directional moves, using the previous representative points so far attained, with the hope that a better representative point would be obtained. The effect of imposing local directional moves is inspected by comparing the results of the original and enhanced BB-BC algorithm on various benchmark test functions. Moreover, the crunching phase of the algorithm is improved with the addition of a simplex-based local search routine. The results of the new hybridized algorithm are compared with the state-of-the-art variants of widely used evolutionary computation methods, namely genetic algorithms, covariance matrix adaptation evolutionary strategies, and particle swarm optimization. The results over the benchmark test functions have proven that the BB-BC algorithm, enhanced with local directional moves, has provided more accuracy with the same computation time or for the same number of function evaluations.", "paper_title": "Big bang-big crunch optimization algorithm with local directional moves", "paper_id": "WOS:000323310900011"}