{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automation_bias"}, {"score": 0.005404138869001841, "phrase": "decision_switching"}, {"score": 0.004657808551825796, "phrase": "automated_advice"}, {"score": 0.0045357787854931894, "phrase": "tested_factors"}, {"score": 0.004133204817078675, "phrase": "simulated_decision_support_advice"}, {"score": 0.004092240621596351, "phrase": "prescribing_context"}, {"score": 0.003816593863814444, "phrase": "prevalidated_correct_and_incorrect_answers"}, {"score": 0.0035594478687904743, "phrase": "simulated_advice"}, {"score": 0.003386412845243943, "phrase": "post-advice_prescription"}, {"score": 0.0032975819773787985, "phrase": "overall_decision_switching"}, {"score": 0.0032110737733503807, "phrase": "negative_consultations"}, {"score": 0.0031686717525002935, "phrase": "incorrect_prescription_switching"}, {"score": 0.003034682308336483, "phrase": "pre-advice_accuracy_rate"}, {"score": 0.002877502286766111, "phrase": "decision_accuracy"}, {"score": 0.0028394925080958205, "phrase": "prescribing_cases"}, {"score": 0.002746644177161797, "phrase": "decision_switches"}, {"score": 0.0027284410545226306, "phrase": "correct_pre-advice"}, {"score": 0.0024286751532861476, "phrase": "lower_clinical_experience"}, {"score": 0.002364907617070299, "phrase": "dss_experience"}, {"score": 0.0023336539327648404, "phrase": "cdss"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support systems", " Clinical decision making", " Prescribing"], "paper_abstract": "Objective: To investigate the rate of automation bias - the propensity of people to over rely on automated advice and the factors associated with it. Tested factors were attitudinal - trust and confidence, non-attitudinal - decision support experience and clinical experience, and environmental - task difficulty. The paradigm of simulated decision support advice within a prescribing context was used. Design: The study employed within participant before-after design, whereby 26 UK NHS General Practitioners were shown 20 hypothetical prescribing scenarios with prevalidated correct and incorrect answers - advice was incorrect in 6 scenarios. They were asked to prescribe for each case, followed by being shown simulated advice. Participants were then asked whether they wished to change their prescription, and the post-advice prescription was recorded. Measurements: Rate of overall decision switching was captured. Automation bias was measured by negative consultations - correct to incorrect prescription switching. Results: Participants changed prescriptions in 22.5% of scenarios. The pre-advice accuracy rate of the clinicians was 50.38%, which improved to 58.27% post-advice. The CDSS improved the decision accuracy in 13.1% of prescribing cases. The rate of automation bias, as measured by decision switches from correct pre-advice, to incorrect post-advice was 5.2% of all cases - a net improvement of 8%. More immediate factors such as trust in the specific CDSS, decision confidence, and task difficulty influenced rate of decision switching. Lower clinical experience was associated with more decision switching. Age, DSS experience and trust in CDSS generally were not significantly associated with decision switching. Conclusions: This study adds to the literature surrounding automation bias in terms of its potential frequency and influencing factors. (c) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Automation bias: Empirical results assessing influencing factors", "paper_id": "WOS:000333801500007"}