{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "erp_life-cycle"}, {"score": 0.047115587792884404, "phrase": "previous_research"}, {"score": 0.04459207714587108, "phrase": "additional_empirical_observation"}, {"score": 0.03742492801557294, "phrase": "erp_project"}, {"score": 0.00446004569562802, "phrase": "comprehensive_success_model"}, {"score": 0.004431673309295777, "phrase": "enterprise_resource_planning"}, {"score": 0.0044035008972484755, "phrase": "erp"}, {"score": 0.004347629793717084, "phrase": "small_to_medium-sized_enterprises"}, {"score": 0.00396326346313272, "phrase": "principal_component"}, {"score": 0.0038510053729959074, "phrase": "stakeholder_perspective"}, {"score": 0.0036127549845584, "phrase": "different_categories"}, {"score": 0.003589753165698119, "phrase": "different_sub-factors"}, {"score": 0.0034880375790382586, "phrase": "life_cycle"}, {"score": 0.0033461647738159826, "phrase": "different_success_factors"}, {"score": 0.0033248546272754936, "phrase": "executive_attention"}, {"score": 0.0032617323680009217, "phrase": "relevant_categories"}, {"score": 0.0031794236141757, "phrase": "small_and_medium-sized_enterprises"}, {"score": 0.0028980357312095835, "phrase": "different_levels"}, {"score": 0.0028795712616923462, "phrase": "erp_system_usage"}, {"score": 0.002815864555488112, "phrase": "practical_guidelines"}, {"score": 0.002485813299166851, "phrase": "summarized_and_informative_manner"}, {"score": 0.0024230370118191267, "phrase": "potential_failures"}, {"score": 0.0023846075213405284, "phrase": "planning_phase"}, {"score": 0.0022802093550930245, "phrase": "preventive_and_corrective_measures"}, {"score": 0.002173409712988074, "phrase": "larger_enterprise_implementation"}, {"score": 0.0021049977753042253, "phrase": "empirical_study"}], "paper_keywords": ["Small to medium-sized enterprises", " Resource management", " Critical success factors", " Enterprise resource planning", " Life cycle", " Field study", " Perspectives on IT"], "paper_abstract": "Purpose The purpose of this paper is to construct a consensus from previous research and develop a comprehensive success model for enterprise resource planning (ERP) implementation in small to medium-sized enterprises (SMEs) that incorporates additional empirical observation. Design/methodology/approach This study clusters 94 critical success factors (CSFs), already identified by other researchers, into 15 categories using validity, reliability, principal component and multicollinearity analyses. This study applies a stakeholder perspective, taking into consideration both users, developers, managers, suppliers and consultants. Findings It seems that different categories and different sub-factors affect an ERP project according to its phase in the life cycle and that each category and each phase of an ERP project focuses on different success factors. Executive attention should be focused on the relevant categories and sub-factors accordingly. Research limitations/implications Respondents' experience relates to small and medium-sized enterprises operating in the local market. Differences in the scope of implementation, organizational, technological and environmental characteristics were not taken into consideration. Finally, this study did not distinguish between different levels of ERP system usage. Practical implications The paper provides practical guidelines as to which categories and sub-factors need to be considered and how one should manage them along the ERP life-cycle. The paper elaborates, strengthens and illustrates insights, delivered within the research, for readers in a summarized and informative manner. The authors describe several major potential failures and these potential failures are discussed for the planning phase, widely cited as a very important phase that is often unacknowledged, along with preventive and corrective measures executed by organizations. In addition, it compares and contrasts the results with larger enterprise implementation reported by literature. Originality/value The paper presents an empirical study that delivers an additional empirical observation through the construction of consensus from previous research.", "paper_title": "CSFs along ERP life-cycle in SMEs: a field study", "paper_id": "WOS:000305369400002"}