{"auto_keywords": [{"score": 0.048653361714131045, "phrase": "information_systems"}, {"score": 0.029759469482311618, "phrase": "igohcaps"}, {"score": 0.00481495049065317, "phrase": "healthcare_actors"}, {"score": 0.003955787027818305, "phrase": "adoption_process"}, {"score": 0.003469676666252421, "phrase": "investigatory_work"}, {"score": 0.003233075944817365, "phrase": "structured_method"}, {"score": 0.002750934994181092, "phrase": "static_and_then_a_dynamic_step"}, {"score": 0.0025503112711036994, "phrase": "critical_actors"}, {"score": 0.0024617483174454113, "phrase": "individual_actors'_differing_views"}, {"score": 0.0022592313766072658, "phrase": "appropriate_views"}, {"score": 0.0021479597698614373, "phrase": "hospital_case_study"}, {"score": 0.0021049977753042253, "phrase": "single_case_study"}], "paper_keywords": ["information systems (IS)", " adoption", " IGOHcaps method", " actors", " identification", " healthcare"], "paper_abstract": "The adoption of information systems in healthcare is no less significant than in any other commercial or caring organisation. The literature on IS adoption in healthcare, makes it clear that the actors involved in the adoption process are almost universally seen as crucial, which matches our research results too. However, how such actors should be identified remains a topic for investigatory work since these are early days in achieving this. We derive and propose a structured method to model how actors might be identified: structured because such a rationale is explicable and such a method is more readily usable when transferred to others. Our structured method, named IGOHcaps, uses a static and then a dynamic step to pull out the individual, group, organisational and human determinants of the critical actors. In this process, the individual actors' differing views emerge which could enable decision- making bodies to produce more robust proposals if they incorporated some of the appropriate views. We discuss the application of IGOHcaps through a hospital case study. While a single case study cannot be a proof, the engagement of the actors was encouraging.", "paper_title": "Identifying healthcare actors involved in the adoption of information systems", "paper_id": "WOS:000245650500009"}