{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "rearrangement_clustering"}, {"score": 0.04253339085581911, "phrase": "clustering_technique"}, {"score": 0.004364919932563366, "phrase": "adjacent_rows"}, {"score": 0.0035681790580031998, "phrase": "first_pitfall"}, {"score": 0.003370907075333389, "phrase": "natural_clusters"}, {"score": 0.003267925215811654, "phrase": "similarity_metric"}, {"score": 0.0028864239961184338, "phrase": "traveling_salesman_problem"}, {"score": 0.0028127163745564777, "phrase": "extra_benefit"}, {"score": 0.002740885774408238, "phrase": "cluster_boundaries"}, {"score": 0.0024842242921857705, "phrase": "better_clusters"}, {"score": 0.002420762293555924, "phrase": "previous_approaches"}, {"score": 0.0023834640793589414, "phrase": "five_cases"}], "paper_keywords": ["clustering", " visualization of patterns in data", " bond energy algorithm", " traveling salesman problem", " asymmetric clustering"], "paper_abstract": "Given a matrix of values in which the rows correspond to objects and the columns correspond to features of the objects, rearrangement clustering is the problem of rearranging the rows of the matrix such that the sum of the similarities between adjacent rows is maximized. Referred to by various names and reinvented several times, this clustering technique has been extensively used in many fields over the last three decades. In this paper, we point out two critical pitfalls that have been previously overlooked. The first pitfall is deleterious when rearrangement clustering is applied to objects that form natural clusters. The second concerns a similarity metric that is commonly used. We present an algorithm that overcomes these pitfalls. This algorithm is based on a variation of the Traveling Salesman Problem. It offers an extra benefit as it automatically determines cluster boundaries. Using this algorithm, we optimally solve four benchmark problems and a 2,467-gene expression data clustering problem. As expected, our new algorithm identifies better clusters than those found by previous approaches in all five cases. Overall, our results demonstrate the benefits of rectifying the pitfalls and exemplify the usefulness of this clustering technique. Our code is available at our websites.", "paper_title": "Rearrangement clustering: Pitfalls, remedies, and applications", "paper_id": "WOS:000245388400001"}