{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "organizational_simulation"}, {"score": 0.03705913838294768, "phrase": "health_advisor"}, {"score": 0.004712065638657606, "phrase": "affordable_healthcare"}, {"score": 0.003921393143378986, "phrase": "alternative_means"}, {"score": 0.003193129886123359, "phrase": "healthcare_system"}, {"score": 0.0030250067691601967, "phrase": "care_trade-offs"}, {"score": 0.002944284514509205, "phrase": "health_outcomes"}, {"score": 0.0025167026017217926, "phrase": "people's_perceptions"}, {"score": 0.0024231382864800173, "phrase": "information_sources"}, {"score": 0.0023841092222805253, "phrase": "strong_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Healthcare management", " Organizational simulation", " Serious games", " Health Advisor", " Information complexity", " Decision-making"], "paper_abstract": "Quality, affordable healthcare remains a contentious, complex and urgent societal problem. Given the scale and complexity of healthcare, systemic changes addressing emergent cost escalation and quality deficiencies are difficult to study, evaluate, and implement. In particular, it is difficult to empirically study alternative means of delivery that do not yet exist. To enable the study of such issues, we designed and developed Health Advisor, a web-based game using organizational simulation. Players are tasked to manage people through the healthcare system by making various information, cost, and quality of care trade-offs with score based on health outcomes and costs incurred. This paper reports on a series of evaluations of Health Advisor and the insights gained from these studies. In particular, results show that people's perceptions of the usability and usefulness of information sources have a strong impact on the use of these sources, and a significant impact on their subsequent performance in diagnoses and referrals. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Healthcare management through organizational simulation", "paper_id": "WOS:000320687700012"}