{"auto_keywords": [{"score": 0.04963913874714364, "phrase": "pattern_databases"}, {"score": 0.04366536734234886, "phrase": "non-consistent_heuristic_functions"}, {"score": 0.00481495049065317, "phrase": "vectorial_pattern_databases"}, {"score": 0.004619027561771169, "phrase": "hard_combinatorial_problems"}, {"score": 0.004410629943506433, "phrase": "different_directions"}, {"score": 0.00398452530840582, "phrase": "heuristic_functions"}, {"score": 0.0034210342328868017, "phrase": "heuristic_estimates"}, {"score": 0.0032066653632708965, "phrase": "infeasible_values"}, {"score": 0.00288317238346065, "phrase": "new_approach"}, {"score": 0.0025565050791036973, "phrase": "even_further_the_bidirectional_pathmax_propagation_rules"}, {"score": 0.0023305762840188145, "phrase": "different_benchmarks"}, {"score": 0.00229844995872581, "phrase": "noticeable_improvement"}, {"score": 0.0022458849724980904, "phrase": "generated_nodes"}, {"score": 0.002225196379204285, "phrase": "classical_pattern_databases"}, {"score": 0.0021049977753042253, "phrase": "running_time"}], "paper_keywords": ["Heuristic search", " Pattern Databases", " inconsistent heuristics"], "paper_abstract": "Pattern Databases are among the most capable means for solving hard combinatorial problems. Since their conception, they have been enhanced along different directions. Recently, it has been shown that Pattern Databases can induce non-consistent heuristic functions and it has been conjectured that this sort of heuristic functions can be better informed than others. As a matter of fact, non-consistent heuristic functions allow specific rules to take place in order to propagate these inconsistencies with the hope of improving the heuristic estimates at some nodes. Also, it has been studied how to recognize infeasible values in Pattern Databases with the hope of being able to introduce corrections that would allow for more prunes. In this work, a new approach is suggested that fulfills both ideas simultaneously: inducing naturally non-consistent heuristic functions just by recognizing feasible, yet admissible, heuristic values which serve to improve even further the bidirectional pathmax propagation rules. Appealing as it might seem, this idea has various pros and cons which are examined. Experiments on different benchmarks show a noticeable improvement in the number of generated nodes over classical Pattern Databases when applicable, though the difference does not necessarily payoff in running time.", "paper_title": "Vectorial Pattern Databases", "paper_id": "WOS:000358733300005"}