{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "small_mobile_robots"}, {"score": 0.03767407563899196, "phrase": "sensor_information"}, {"score": 0.00481495049065317, "phrase": "novel_localization_method"}, {"score": 0.004691465925553365, "phrase": "proposed_technique"}, {"score": 0.004317119978040352, "phrase": "lisbon"}, {"score": 0.004055998173160551, "phrase": "low-cost_infra-red_sensors"}, {"score": 0.003693533648584145, "phrase": "pose_tracking_system"}, {"score": 0.003380897678672156, "phrase": "expected_motion"}, {"score": 0.0031597433845085092, "phrase": "map-matching_optimization"}, {"score": 0.002832604181113109, "phrase": "pso"}, {"score": 0.0027311809666295565, "phrase": "map-matching_error"}, {"score": 0.00234834406550549, "phrase": "presented_technique"}, {"score": 0.0022524959504997303, "phrase": "extensive_results"}, {"score": 0.002206045784326466, "phrase": "proposed_method"}, {"score": 0.002171836484200008, "phrase": "interesting_localization_capability"}, {"score": 0.0021049977753042253, "phrase": "limited_amount"}], "paper_keywords": ["Localization", " Navigation", " Mobile robot", " Robot@Factory"], "paper_abstract": "This paper presents a novel localization method for small mobile robots. The proposed technique is especially designed for the Robot@Factory, a new robotic competition which is started in Lisbon in 2011. The real-time localization technique resorts to low-cost infra-red sensors, a map-matching method and an Extended Kalman Filter (EKF) to create a pose tracking system that performs well. The sensor information is continuously updated in time and space according to the expected motion of the robot. Then, the information is incorporated into the map-matching optimization in order to increase the amount of sensor information that is available at each moment. In addition, the Particle Swarm Optimization (PSO) relocates the robot when the map-matching error is high, meaning that the map-matching is unreliable and the robot gets lost. The experiments presented in this paper prove the ability and accuracy of the presented technique to locate small mobile robots for this competition. Extensive results show that the proposed method presents an interesting localization capability for robots equipped with a limited amount of sensors, but also less reliable sensors.", "paper_title": "A Localization Method Based on Map-Matching and Particle Swarm Optimization", "paper_id": "WOS:000347893100007"}