{"auto_keywords": [{"score": 0.04487382599575289, "phrase": "descartes_configurations"}, {"score": 0.040978700692412814, "phrase": "apollonian_group"}, {"score": 0.040318064574209334, "phrase": "parameter_space"}, {"score": 0.03550450580616907, "phrase": "integral_structure"}, {"score": 0.033255588523354467, "phrase": "super-apollonian_group"}, {"score": 0.00481497623529809, "phrase": "apollonian"}, {"score": 0.004686791459644141, "phrase": "ii._super-apollonian"}, {"score": 0.004592905436175987, "phrase": "apollonian_circle_packings"}, {"score": 0.004207230913063179, "phrase": "descartes_configuration"}, {"score": 0.0040951809276235495, "phrase": "riemann_sphere"}, {"score": 0.004053932711987671, "phrase": "disjoint_interiors"}, {"score": 0.003945949295597681, "phrase": "discrete_group"}, {"score": 0.003751161013665126, "phrase": "descartes"}, {"score": 0.0035062280202127136, "phrase": "infinitely_many_types"}, {"score": 0.00348263058839775, "phrase": "integral_apollonian_packings"}, {"score": 0.003412783661090541, "phrase": "integer_curvatures"}, {"score": 0.0033106223384515546, "phrase": "integral_nature"}, {"score": 0.0031791333962016507, "phrase": "larger_discrete_group"}, {"score": 0.003042555825368091, "phrase": "descartes_quadruples"}, {"score": 0.0030118779844670353, "phrase": "geometric_object"}, {"score": 0.0027773024878187656, "phrase": "arbitrary_depth"}, {"score": 0.0025870463897472943, "phrase": "curvature_x_centers"}, {"score": 0.002361410799860054, "phrase": "integral_apollonian_circle_packing"}, {"score": 0.002112127122259064, "phrase": "lorentz_group"}], "paper_keywords": [""], "paper_abstract": "Apollonian circle packings arise by repeatedly filling the interstices between four mutually tangent circles with further tangent circles. Such packings can be described in terms of the Descartes configurations they contain, where a Descartes configuration is a set of four mutually tangent circles in the Riemann sphere, having disjoint interiors. Part I showed there exists a discrete group, the Apollonian group, acting on a parameter space of (ordered, oriented) Descartes configurations, such that the Descartes configurations in a packing formed an orbit under the action of this group. It is observed there exist infinitely many types of integral Apollonian packings in which all circles had integer curvatures, with the integral structure being related to the integral nature of the Apollonian group. Here we consider the action of a larger discrete group, the super-Apollonian group, also having an integral structure, whose orbits describe the Descartes quadruples of a geometric object we call a super-packing. The circles in a super-packing never cross each other but are nested to an arbitrary depth. Certain Apollonian packings and super-packings are strongly integral in the sense that the curvatures of all circles are integral and the curvature x centers of all circles are integral. We show that (up to scale) there are exactly eight different (geometric) strongly integral super-packings, and that each contains a copy of every integral Apollonian circle packing (also up to scale). We show that the super-Apollonian group has finite volume in the group of all automorphisms of the parameter space of Descartes configurations, which is isomorphic to the Lorentz group O(3, 1).", "paper_title": "Apollonian circle packings: Geometry and group theory II. Super-Apollonian group and integral packings", "paper_id": "WOS:000233601200001"}