{"auto_keywords": [{"score": 0.03596176205294269, "phrase": "different_organizations"}, {"score": 0.00481495049065317, "phrase": "knowledge_sharing"}, {"score": 0.004417848254181138, "phrase": "voluntary_initiative"}, {"score": 0.003835972725191194, "phrase": "knowledge_development"}, {"score": 0.003592859432554987, "phrase": "research_network"}, {"score": 0.0034951469511975346, "phrase": "common_interests"}, {"score": 0.0033075957452554368, "phrase": "different_types"}, {"score": 0.002851790448644913, "phrase": "different_priorities"}, {"score": 0.002518746501941657, "phrase": "university_actors"}, {"score": 0.002467140591777737, "phrase": "individuals'_different_work_affiliations"}], "paper_keywords": ["community of practice", " collaborative research", " cooperation", " knowledge sharing", " time", " trust"], "paper_abstract": "According to some literature, communities of practice should normally stem from a voluntary initiative within an organization, whose members share some knowledge or expertise they wish to improve. However, over time, we have seen that communities tend to be created within organizations, in order to attain objectives of learning and knowledge development. This represents a challenge in the context of a community of practice taking the form of a research network in partnership that brings together members with common interests certainly, but spread out in different organizations and even several countries in which they perform different types of work. Also, the community does not exist in a vacuum and the explanation for what happens within it does not lie solely within the way the group interacts; indeed the individuals are part of different organizations and thus have different priorities, in relation with these affiliations. In this context, our research objective was to determine the factors that facilitate or hinder cooperation within a community of practice composed by two groups of actors, community and university actors. We thus found that individuals' different work affiliations might not facilitate the work within the CoP and that ICT/web 2.0 tools are not always a solution to increase participation in a CoP. Although participants are somewhat familiar with the tools, they mostly seem content with receiving and accessing information, not searching for a more active participation. Some explications and solutions will be proposed.", "paper_title": "Analysis of processes of cooperation and knowledge sharing in a community of practice with a diversity of actors", "paper_id": "WOS:000306542400020"}