{"auto_keywords": [{"score": 0.02967301683452493, "phrase": "target_ontology"}, {"score": 0.015719716506582538, "phrase": "fuzzy_conceptual_graphs"}, {"score": 0.004592214823540993, "phrase": "new_ontology_mapping_method"}, {"score": 0.004356741449157895, "phrase": "non-structured_ontology"}, {"score": 0.004199101289890982, "phrase": "structured_one"}, {"score": 0.003383475802364289, "phrase": "proposed_method"}, {"score": 0.002613239644974825, "phrase": "original_way"}, {"score": 0.0024789887640568093, "phrase": "source_ontology"}, {"score": 0.002266364679369248, "phrase": "fuzzy_conceptual_graph"}, {"score": 0.002207363758847308, "phrase": "new_projection_operation"}, {"score": 0.0021273284545701896, "phrase": "translated_objects"}, {"score": 0.0021049977753042253, "phrase": "actual_objects"}], "paper_keywords": [""], "paper_abstract": "This paper presents a new ontology mapping method. This method addresses the case in which a non-structured ontology is to be mapped with a structured one. Both ontologies are composed of triplets of the form (object, characteristic, value). Structured means that the values describing the objects according to a given characteristic are hierarchically organized using the a kind of relation. The proposed method uses fuzzy conceptual graphs [8] to represent and map objects from a source ontology to a target one. First, we establish a correspondence between characteristics of the source ontology and characteristics of the target ontology based on the comparison of their associated values. Then, we propose an original way of translating the description of an object of the source ontology using characteristics and values of the target ontology. The description thus translated is represented as a fuzzy conceptual graph. Finally, a new projection operation is used to find mappings between translated objects and actual objects of the target ontology. This method has been implemented and the results of an experimentation concerning the mapping of ontologies in the field of risk in food are presented.", "paper_title": "Using fuzzy conceptual graphs to map ontologies", "paper_id": "WOS:000243131600055"}