{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chronic_disease_care"}, {"score": 0.04645652226343977, "phrase": "information_flow"}, {"score": 0.004586531354697466, "phrase": "in-depth_understanding"}, {"score": 0.004320156581220516, "phrase": "context-appropriate_informatics_tools"}, {"score": 0.003978866233891427, "phrase": "direct_observation"}, {"score": 0.003949204622915113, "phrase": "semi-structured_interviews"}, {"score": 0.0034904076588243315, "phrase": "observation_data"}, {"score": 0.00342568771304873, "phrase": "open_coding_approach"}, {"score": 0.003262958503873883, "phrase": "hierarchical_task_analysis"}, {"score": 0.003238616481108356, "phrase": "soft_systems_methodology"}, {"score": 0.0031666711243198992, "phrase": "nine_semi-structured_interviews"}, {"score": 0.00276725708403607, "phrase": "work_practices"}, {"score": 0.0027159094186967247, "phrase": "health_information_technology"}, {"score": 0.0025771355599741915, "phrase": "existing_hit_functionality"}, {"score": 0.00252930673503721, "phrase": "chronic_disease_providers"}, {"score": 0.002373214852820709, "phrase": "ten_guidelines"}, {"score": 0.002260367486652148, "phrase": "modular_approaches"}, {"score": 0.0022101055924375725, "phrase": "disease-specific_needs"}, {"score": 0.0021049977753042253, "phrase": "hit_design"}], "paper_keywords": [""], "paper_abstract": "Objectives: The goal of the study was to develop an in-depth understanding of work practices, workflow, and information flow in chronic disease care, to facilitate development of context-appropriate informatics tools. Design: The study was conducted over a 10-month period in three ambulatory clinics providing chronic disease care. The authors iteratively collected data using direct observation and semi-structured interviews. Measurements: The authors observed all aspects of care in three different chronic disease clinics for over 150 hours, including 157 patient-provider interactions. Observation focused on interactions among people, processes, and technology. Observation data were analyzed through an open coding approach. The authors then developed models of workflow and information flow using Hierarchical Task Analysis and Soft Systems Methodology. The authors also conducted nine semi-structured interviews to confirm and refine the models. Results: The study had three primary outcomes: models of workflow for each clinic, models of information flow for each clinic, and an in-depth description of work practices and the role of health information technology (HIT) in the clinics. The authors identified gaps between the existing HIT functionality and the needs of chronic disease providers. Conclusions: In response to the analysis of workflow and information flow, the authors developed ten guidelines for design of HIT to support chronic disease care, including recommendations to pursue modular approaches to design that would support disease-specific needs. The study demonstrates the importance of evaluating workflow and information flow in HIT design and implementation. J Am Med Inform Assoc. 2009;16:826-836. DOI 10.1197/jamia.M3000.", "paper_title": "Describing and Modeling Workflow and Information Flow in Chronic Disease Care", "paper_id": "WOS:000271730000009"}