{"auto_keywords": [{"score": 0.041811532811043675, "phrase": "gcr"}, {"score": 0.00481495049065317, "phrase": "advance_channel_reservation_architectures"}, {"score": 0.004684157900507474, "phrase": "perceived_limitations"}, {"score": 0.004577869668211548, "phrase": "high-throughput_applications"}, {"score": 0.004372442291178139, "phrase": "alternative_architectures"}, {"score": 0.004253618550301311, "phrase": "advance_channel_reservation"}, {"score": 0.004081385289516914, "phrase": "polynomial-time_algorithmic_framework"}, {"score": 0.004025531820226182, "phrase": "graded_channel_reservation"}, {"score": 0.0037060428445111664, "phrase": "minimum_bandwidth_and_duration_requirements"}, {"score": 0.0034911335714333507, "phrase": "highest_graded_path"}, {"score": 0.0032287289440915187, "phrase": "optimization_criterion"}, {"score": 0.0026373136897864763, "phrase": "practical_methods"}, {"score": 0.0025420267431501367, "phrase": "path_switches"}, {"score": 0.0025071862539276283, "phrase": "extensive_simulations"}, {"score": 0.002214297250267208, "phrase": "average_delay"}, {"score": 0.0021049977753042253, "phrase": "maximum_sustainable_load"}], "paper_keywords": ["Algorithms", " performance evaluation", " reservation", " routing", " scheduling", " switching"], "paper_abstract": "As a result of perceived limitations of TCP/IP in supporting high-throughput applications, significant efforts have recently been devoted to develop alternative architectures based on the concept of advance channel reservation. In this paper, we develop a polynomial-time algorithmic framework, called graded channel reservation (GCR), to support the implementation of such architectures. This framework enables users to specify minimum bandwidth and duration requirements for their connections. Upon receiving a request, GCR returns the highest graded path, selected according to a general, multicriteria optimization objective. In particular, if the optimization criterion is delay, we prove that GCR returns the earliest time available to establish the connection. Thereafter, we present a generalization of GCR, called GCR(SWitch), that is capable of supporting path switching throughout a connection. We present practical methods for minimizing or limiting the number of path switches. Through extensive simulations, we evaluate the performance of GCR and its variants under various topological settings and applications workload. Our results show that, for certain traffic parameters, optimized path selection combined with path switching can reduce the average delay of requests by an order of magnitude and increase the maximum sustainable load by as much as 50%.", "paper_title": "Path Switching and Grading Algorithms for Advance Channel Reservation Architectures", "paper_id": "WOS:000270747600025"}