{"auto_keywords": [{"score": 0.048200883265473914, "phrase": "chou"}, {"score": 0.04779402660657814, "phrase": "gao"}, {"score": 0.004751216062917875, "phrase": "area_method"}, {"score": 0.004709193603747991, "phrase": "euclidean_constructive_geometry"}, {"score": 0.004545150298955624, "phrase": "zhang"}, {"score": 0.003737485125097945, "phrase": "first_complete_presentation"}, {"score": 0.003606866938661143, "phrase": "algorithmic_and_implementation_details"}, {"score": 0.0035118972210075633, "phrase": "original_presentations"}, {"score": 0.003329368827624161, "phrase": "zhang's_axiom_system"}, {"score": 0.0032561349010603734, "phrase": "axiom_system"}, {"score": 0.0030595112110658675, "phrase": "coq_proof_assistant"}, {"score": 0.002952516738708181, "phrase": "original_implementation"}, {"score": 0.0027252240573281163, "phrase": "basic_idea"}, {"score": 0.002220551141101661, "phrase": "straightforward_task"}], "paper_keywords": ["Area method", " Geometry", " Automated theorem proving", " Formalisation"], "paper_abstract": "The area method for Euclidean constructive geometry was proposed by Chou, Gao and Zhang in the early 1990's. The method can efficiently prove many non-trivial geometry theorems and is one of the most interesting and most successful methods for automated theorem proving in geometry. The method produces proofs that are often very concise and human-readable. In this paper, we provide a first complete presentation of the method. We provide both algorithmic and implementation details that were omitted in the original presentations. We also give a variant of Chou, Gao and Zhang's axiom system. Based on this axiom system, we proved formally all the lemmas needed by the method and its soundness using the Coq proof assistant. To our knowledge, apart from the original implementation by the authors who first proposed the method, there are only three implementations more. Although the basic idea of the method is simple, implementing it is a very challenging task because of a number of details that has to be dealt with. With the description of the method given in this paper, implementing the method should be still complex, but a straightforward task. In the paper we describe all these implementations and also some of their applications.", "paper_title": "The Area Method A Recapitulation", "paper_id": "WOS:000301980200003"}