{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local_properties"}, {"score": 0.0047113960612140335, "phrase": "global_object_orientation"}, {"score": 0.004650330504968421, "phrase": "previous_studies"}, {"score": 0.0045108906244892165, "phrase": "individual_features"}, {"score": 0.004318881178805575, "phrase": "specifically_designed_stimuli"}, {"score": 0.004081385289516914, "phrase": "global_object"}, {"score": 0.0038401488612789963, "phrase": "elliptical_cross_section"}, {"score": 0.003806866174028117, "phrase": "rectangular_blocks"}, {"score": 0.0032263862712733934, "phrase": "global_property"}, {"score": 0.0021049977753042253, "phrase": "whole_shape"}], "paper_keywords": ["Psychophysics", " haptic perception", " touch"], "paper_abstract": "In previous studies, the effect on perception of individual features such as curvature and edges have been studied with specifically designed stimuli. However, the effect of local properties on the perception of the global object has so far received little attention. In this study, cylinders with an elliptical cross section and rectangular blocks were used to investigate the effect and relative importance of curvature, change in curvature and edges, as local properties, on the ability of subjects to determine the orientation of the stimuli, which is a global property. We found that when curvature was present the threshold to determine the orientation was 43 percent lower than when curvature was absent. When, in addition, the change in curvature could be felt, the threshold was 37 percent lower than when only curvature could be felt. Finally, when edges were felt during exploration, the threshold increased by 46 percent compared to when the subjects were instructed to avoid the edges in the blocks. We conclude that the perception of curvature and change in curvature improve the performance of humans in perception of the whole shape, whereas edges, when not directly contributing to the task, disrupt performance.", "paper_title": "Influence of Local Properties on the Perception of Global Object Orientation", "paper_id": "WOS:000300980500009"}