{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "delay-tolerant_networks"}, {"score": 0.004692980391580608, "phrase": "delay-tolerant_network"}, {"score": 0.004481132747216135, "phrase": "data_transportation"}, {"score": 0.004106612344123407, "phrase": "data_transmission"}, {"score": 0.003782655283668953, "phrase": "system's_performance"}, {"score": 0.003611751858608048, "phrase": "significant_amount"}, {"score": 0.0034485432592912917, "phrase": "actual_node_transmission"}, {"score": 0.0024062532032402533, "phrase": "optimal_energy_management_strategies"}, {"score": 0.0023211517663846346, "phrase": "optimal_control"}, {"score": 0.002159852420283463, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "contact_traces"}], "paper_keywords": ["Delay-tolerant networks (DTNs)", " fluid models", " optimal control", " threshold policies"], "paper_abstract": "Performance of a delay-tolerant network has strong dependence on the nodes participating in data transportation. Such networks often face several resource constraints especially related to energy. Energy is consumed not only in data transmission, but also in listening and in several signaling activities. On one hand these activities enhance the system's performance while on the other hand, they consume a significant amount of energy even when they do not involve actual node transmission. Accordingly, in order to use energy efficiently, one may have to limit not only the amount of transmissions, but also the amount of nodes that are active at each time. Therefore, we study two coupled problems: 1) the activation problem that determines when a mobile will turn on in order to receive packets; and 2) the problem of regulating the beaconing. We derive optimal energy management strategies by formulating the problem as an optimal control one, which we then explicitly solve. We also validate our findings through extensive simulations that are based on contact traces.", "paper_title": "Combined Optimal Control of Activation and Transmission in Delay-Tolerant Networks", "paper_id": "WOS:000317925300011"}