{"auto_keywords": [{"score": 0.034151863292422834, "phrase": "research_community"}, {"score": 0.03363896917055258, "phrase": "hierarchy-based_classifier"}, {"score": 0.03325918553268762, "phrase": "flat_classifier"}, {"score": 0.028250826287237456, "phrase": "gold-standard_codes"}, {"score": 0.00481495049065317, "phrase": "healthcare_data"}, {"score": 0.004667149874736771, "phrase": "health_information_technology"}, {"score": 0.0045415338200109345, "phrase": "discharge_summary_content"}, {"score": 0.004333973355873714, "phrase": "discharge_summaries"}, {"score": 0.0038404642251010797, "phrase": "hierarchical_nature"}, {"score": 0.0036363418376496484, "phrase": "novel_evaluation_metrics"}, {"score": 0.0034029588672379926, "phrase": "experimental_setup"}, {"score": 0.00331125524068286, "phrase": "evaluation_scripts"}, {"score": 0.002681859084438076, "phrase": "correct_sub-tree"}, {"score": 0.0025892330566358503, "phrase": "error_analysis"}, {"score": 0.0024134449026937586, "phrase": "hierarchy-based_classification_yields"}, {"score": 0.002366763442497185, "phrase": "flat_classification"}, {"score": 0.00234834406550549, "phrase": "mimic_patients"}, {"score": 0.0021049977753042253, "phrase": "shared_models"}], "paper_keywords": ["Machine Learning", " Electronic Health Records", " Clinical Coding", " ICD Codes", " Medical Informatics"], "paper_abstract": "Background and objective The volume of healthcare data is growing rapidly with the adoption of health information technology. We focus on automated ICD9 code assignment from discharge summary content and methods for evaluating such assignments. Methods We study ICD9 diagnosis codes and discharge summaries from the publicly available Multiparameter Intelligent Monitoring in Intensive Care II (MIMIC II) repository. We experiment with two coding approaches: one that treats each ICD9 code independently of each other (flat classifier), and one that leverages the hierarchical nature of ICD9 codes into its modeling (hierarchy-based classifier). We propose novel evaluation metrics, which reflect the distances among gold-standard and predicted codes and their locations in the ICD9 tree. Experimental setup, code for modeling, and evaluation scripts are made available to the research community. Results The hierarchy-based classifier outperforms the flat classifier with F-measures of 39.5% and 27.6%, respectively, when trained on 20533 documents and tested on 2282 documents. While recall is improved at the expense of precision, our novel evaluation metrics show a more refined assessment: for instance, the hierarchy-based classifier identifies the correct sub-tree of gold-standard codes more often than the flat classifier. Error analysis reveals that gold-standard codes are not perfect, and as such the recall and precision are likely underestimated. Conclusions Hierarchy-based classification yields better ICD9 coding than flat classification for MIMIC patients. Automated ICD9 coding is an example of a task for which data and tools can be shared and for which the research community can work together to build on shared models and advance the state of the art.", "paper_title": "Diagnosis code assignment: models and evaluation metrics", "paper_id": "WOS:000331263600008"}