{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "citation_distributions"}, {"score": 0.014780326756070425, "phrase": "research_units"}, {"score": 0.004638354165775803, "phrase": "novel_methodology"}, {"score": 0.004322186889256224, "phrase": "critical_citation_level"}, {"score": 0.0036756196381448015, "phrase": "ccl."}, {"score": 0.0035113478590679133, "phrase": "citation_distribution"}, {"score": 0.0034678302347682694, "phrase": "income_distribution"}, {"score": 0.0031254704616199614, "phrase": "economic_poverty"}, {"score": 0.0028521858876446654, "phrase": "economic_affluence"}, {"score": 0.0026354246446771324, "phrase": "low-impact_measures"}, {"score": 0.002549146857303602, "phrase": "desirable_axioms"}, {"score": 0.0024149139610228887, "phrase": "equally_convenient_class"}, {"score": 0.0023948981440134478, "phrase": "decomposable_high-impact_measures"}, {"score": 0.00224061675049049, "phrase": "empirical_applications"}, {"score": 0.002158233639156017, "phrase": "different_fields"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Research performance", " Citation distribution", " Poverty measurement", " Impact indicators"], "paper_abstract": "This paper introduces a novel methodology for comparing the citation distributions of research units of a certain size working in the same homogeneous field. Given a critical citation level (CCL), we suggest using two real valued indicators to describe the shape of any distribution: a high-impact and a low-impact measure defined over the set of articles with citations above or below the CCL. The key to this methodology is the identification of a citation distribution with an income distribution. Once this step is taken, it is easy to realize that the measurement of low-impact coincides with the measurement of economic poverty. In turn, it is equally natural to identify the measurement of high-impact with the measurement of a certain notion of economic affluence. On the other hand, it is seen that the ranking of citation distributions according to a family of low-impact measures is essentially characterized by a number of desirable axioms. Appropriately redefined, these same axioms lead to the selection of an equally convenient class of decomposable high-impact measures. These two families are shown to satisfy other interesting properties that make them potentially useful in empirical applications, including the comparison of research units working in different fields. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The measurement of low- and high-impact in citation distributions: Technical results", "paper_id": "WOS:000285626000005"}