{"auto_keywords": [{"score": 0.049479057100967866, "phrase": "text_categorization"}, {"score": 0.015719716506582538, "phrase": "hyperclique_patterns"}, {"score": 0.0073535265273314875, "phrase": "pattern-based_text_categorization"}, {"score": 0.0046069985410261746, "phrase": "association_patterns"}, {"score": 0.004463958296056236, "phrase": "great_interest"}, {"score": 0.004325339932975582, "phrase": "useful_methods"}, {"score": 0.004112411350177274, "phrase": "key_characteristics"}, {"score": 0.0038124354878360032, "phrase": "concrete_answers"}, {"score": 0.0036018503805251424, "phrase": "association_pattern"}, {"score": 0.00353426342004404, "phrase": "best_candidate"}, {"score": 0.002780025943393764, "phrase": "frequent_patterns"}, {"score": 0.002186395051086251, "phrase": "classification_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["association rules", " hyperclique patterns", " text categorization"], "paper_abstract": "The use of association patterns for text categorization has attracted great interest and a variety of useful methods have been developed. However, the key characteristics of pattern-based text categorization remain unclear. Indeed, there are still no concrete answers for the following two questions: Firstly, what kind of association pattern is the best candidate for pattern-based text categorization? Secondly, what is the most desirable way to use patterns for text categorization? In this paper, we focus on answering the above two questions. More specifically, we show that hyperclique patterns are more desirable than frequent patterns for text categorization. Along this line, we develop an algorithm for text categorization using hyperclique patterns. As demonstrated by our experimental results on various real-world text documents, our method provides much better computational performance than state-of-the-art methods while retaining classification accuracy. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "On the strength of hyperclique patterns for text categorization", "paper_id": "WOS:000248936300008"}