{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "prefix_orders"}, {"score": 0.04896221231267542, "phrase": "open_maps"}, {"score": 0.009758873604826008, "phrase": "functional_bisimulations"}, {"score": 0.00481495049065317, "phrase": "concrete_categories"}, {"score": 0.004623990904432388, "phrase": "concurrency_theory"}, {"score": 0.004592913396361154, "phrase": "joyal"}, {"score": 0.004562065260292992, "phrase": "nielsen"}, {"score": 0.004531357850404452, "phrase": "winskel"}, {"score": 0.0044706300051082035, "phrase": "abstract_way"}, {"score": 0.00438105507792004, "phrase": "wide_variety"}, {"score": 0.004278807087784626, "phrase": "labelled_transition_systems"}, {"score": 0.0042500322609733574, "phrase": "event_structures"}, {"score": 0.004067635935640407, "phrase": "open_maps_characterises"}, {"score": 0.0035779805381654438, "phrase": "arbitrary_dynamical_systems"}, {"score": 0.0032006810120751524, "phrase": "mere_generalizations"}, {"score": 0.0031258948882273057, "phrase": "open_map_approach"}, {"score": 0.003032295420569351, "phrase": "closer_look"}, {"score": 0.0029815085406590426, "phrase": "open_map"}, {"score": 0.002805597755796506, "phrase": "concrete_category"}, {"score": 0.00252656192077797, "phrase": "natural_one"}, {"score": 0.0021700361584578633, "phrase": "van_glabbeek"}, {"score": 0.002155412043665635, "phrase": "weijland"}], "paper_keywords": ["Open maps", " Prefix orders", " Branching bisimulation", " Concrete categories"], "paper_abstract": "Open maps, as introduced in concurrency theory by Joyal, Nielsen and Winskel, provide an abstract way to define functional bisimulations across a wide variety of models of computation (like labelled transition systems, event structures, etcetera). Furthermore, the existence of a span of open maps characterises the well-known relational definition of bisimulations found in the literature associated with these models of computation. However, in our working category of prefix orders (in which the objects represent the sets of executions generated by arbitrary dynamical systems) the open maps do not immediately result in functional bisimulations and the existence of a span of open maps does not result in an equivalence. This is rather surprising, since prefix orders are mere generalizations of (discrete) execution trees, for which the open map approach is known to work. After taking a closer look at the definition of open map, we show in this paper that the issue can be remedied by considering prefix orders as a concrete category and reinterpreting the definition of open-map in this light. As a bonus, the choice of a path-category on which the notion of open-map relies becomes a natural one, namely the subcategory of embeddings. While the existence of spans still does not result in an equivalence, it is shown that the existence of cospans does. In fact, we present a characterisation of the notion of branching bisimulation by van Glabbeek and Weijland which, to the best of our knowledge, was not studied in the framework of open maps before.", "paper_title": "Open Maps in Concrete Categories and Branching Bisimulation for Prefix Orders", "paper_id": "WOS:000372714600005"}