{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "process-solution_analysis"}, {"score": 0.00477924690801092, "phrase": "collaborative_learning_environments"}, {"score": 0.00465634671242413, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.004486212539464774, "phrase": "interaction_analysis"}, {"score": 0.004354572391793908, "phrase": "learning_processes"}, {"score": 0.0041642891310893, "phrase": "joint_analysis"}, {"score": 0.004118026552723285, "phrase": "collaborative_process"}, {"score": 0.003923398381490749, "phrase": "comprehensive_analysis"}, {"score": 0.00389427992231721, "phrase": "cscl_synchronous_environments"}, {"score": 0.0038510053729959074, "phrase": "problem-solving_approach"}, {"score": 0.0037101871762082153, "phrase": "observation-abstraction-intervention_analysis_life-cycle"}, {"score": 0.003405472159599442, "phrase": "analysis_indicators"}, {"score": 0.0033054391731615618, "phrase": "knowledge_building_process"}, {"score": 0.003280891942617853, "phrase": "different_levels"}, {"score": 0.0031140747752837826, "phrase": "application_domain"}, {"score": 0.0029889584492584073, "phrase": "analysis_procedures"}, {"score": 0.0023807981747706376, "phrase": "analysis_subsystems"}, {"score": 0.002234491924392106, "phrase": "framework's_approach"}, {"score": 0.0021049977753042253, "phrase": "vice_versa"}], "paper_keywords": ["CSCL", " Collaboration and interaction analysis", " Solution analysis", " User and group modelling"], "paper_abstract": "One of the most challenging aspects of computer-supported collaborative learning (CSCL) research is automation of collaboration and interaction analysis in order to understand and improve the learning processes. It is particularly necessary to look in more depth at the joint analysis of the collaborative process and its resulting product. In this article, we present a framework for comprehensive analysis in CSCL synchronous environments supporting a problem-solving approach to learning. This framework is based on an observation-abstraction-intervention analysis life-cycle and consists of a suite of analysis indicators, procedures for calculating indicators and a model of intervention based on indicators. Analysis indicators are used to represent the collaboration and knowledge building process at different levels of abstraction, and to characterize the solution built using models of the application domain, the problems to solve and their solutions. The analysis procedures combine analysis of actions and dialogue with analysis of the solution. In this way, the process and the solution are studied independently as well as together, enabling the detection of correlations between them. In order to exemplify and test the framework, the methodological process underlying the framework was followed to guide the implementation of the analysis subsystems of two existing CSCL environments. In addition, a number of studies have been conducted to evaluate the framework's approach, demonstrating that certain modes of collaborating and working imply particular types of solutions and vice versa. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A framework for process-solution analysis in collaborative learning environments", "paper_id": "WOS:000260548000004"}