{"auto_keywords": [{"score": 0.023943832061353094, "phrase": "toss"}, {"score": 0.00481495049065317, "phrase": "wireless_ad-hoc_networks"}, {"score": 0.004686688155058031, "phrase": "token-passing_based_multi-point_relays"}, {"score": 0.003985487777785535, "phrase": "toss_model"}, {"score": 0.00394264312173188, "phrase": "location-based_scheduling_technique"}, {"score": 0.0031417377608722, "phrase": "efficient_scheduling_approach"}, {"score": 0.0029763124376934813, "phrase": "location-based_scheduling_schemes"}, {"score": 0.002685558057339722, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mobile P2P", " Wireless P2P", " Efficient data dissemination", " Efficient scheduling.", " Location-aware scheduling"], "paper_abstract": "This paper introduces token-passing based multi-point relays (TOSS) data dissemination scheme in mobile Peer-to-Peer (P2P) environments. TOSS is designed to support reliability and efficiency of the peers to disseminate messages to other peers in mobile P2P networks. The TOSS model incorporates location-based scheduling technique as a means to determine the most optimal scheduling for the peers to receive messages whilst taking into account the location and mobility of the peers. The novelties of this paper are summarized as follows; (i) it presents an efficient scheduling approach to disseminate messages; (ii) it formulates location-based scheduling schemes for constructing the order of the delivery; (iii) it experimentally evaluates the performance of the proposed approach and compares them against the most closely relevant prior arts (e.g. pure flooding and Trustworthiness -based Broadcast (TBB) scheme) in respect to the transmission cost, computational cost and message deliverable performance. The experiments yield a promising result for TOSS based on the metrics of studies. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Mobile Peer-to-Peer data dissemination in wireless ad-hoc networks", "paper_id": "WOS:000316042900002"}