{"auto_keywords": [{"score": 0.05007350434242922, "phrase": "artificial_stock_market"}, {"score": 0.049609184850255575, "phrase": "multi-agent_systems"}, {"score": 0.04764390543865616, "phrase": "multi-fractal_time_series"}, {"score": 0.042986545468841085, "phrase": "gp"}, {"score": 0.03767695259599919, "phrase": "forecast_equations"}, {"score": 0.026015961100721147, "phrase": "artificial_stock_prices"}, {"score": 0.004706558938775242, "phrase": "genetic_programming"}, {"score": 0.004296747096249343, "phrase": "multi-fractality_analysis"}, {"score": 0.003999843765164458, "phrase": "cognitive_behaviors"}, {"score": 0.0037233796053514918, "phrase": "five_types"}, {"score": 0.0035574466515880337, "phrase": "forecast_rules"}, {"score": 0.0030524448705134283, "phrase": "extended_method"}, {"score": 0.003012919635505122, "phrase": "continuous_time"}, {"score": 0.0030031183143298316, "phrase": "wavelet_transform"}, {"score": 0.0029163246959273605, "phrase": "time_series"}, {"score": 0.0028879529188983524, "phrase": "artificial_stock_price"}, {"score": 0.002850551552945005, "phrase": "multi-fractal_signal"}, {"score": 0.0026104197983396367, "phrase": "six_cases"}, {"score": 0.0024616504443079512, "phrase": "strict_multi-fractality"}, {"score": 0.002313783044225099, "phrase": "system_parameters"}, {"score": 0.0022763657774198184, "phrase": "prediction_method"}, {"score": 0.0022615684627308283, "phrase": "mono-fractal_time_series"}, {"score": 0.0021049977753042253, "phrase": "multi-fractal_processes"}], "paper_keywords": ["multi-fractal", " artificial stock market", " multi-agent-based modeling", " genetic programming"], "paper_abstract": "There are several methods for generating multi-fractal time series, but the origin of the multi-fractality is not discussed so far. This paper deals with the multi-fractality analysis of time series in an artificial stock market generated by multi-agent systems based on the Genetic Programming (GP) and its applications to feature extractions. Cognitive behaviors of agents are modeled by using the GP to introduce the co-evolutionary (social) learning as well as the individual learning. We assume five types of agents, in which a part of the agents prefer forecast equations or forecast rules to support their decision making, and another type of the agents select decisions at random like a speculator. The agents using forecast equations and rules usually use their own knowledge base, but some of them utilize their public (common) knowledge base to improve trading decisions. For checking the multi-fractality we use an extended method based on the continuous time wavelet transform. Then, it is shown that the time series of the artificial stock price reveals as a multi-fractal signal. We mainly focus on the proportion of the agents of each type. To examine the role of agents of each type, we classify six cases by changing the composition of agents of types. As a result, in several cases we find strict multi-fractality in artificial stock prices, and we see the relationship between the realizability (reproducibility) of multi-fractality and the system parameters. By applying a prediction method for mono-fractal time series as counterparts, features of the multi-fractal time series are extracted. As a result, we examine and find the origin of multi-fractal processes in artificial stock prices.", "paper_title": "Multi-fractality analysis of time series in artificial stock market generated by multi-agent systems based on the genetic programming and its applications", "paper_id": "WOS:000250093800021"}