{"auto_keywords": [{"score": 0.04140693296811694, "phrase": "potential_consumers"}, {"score": 0.009507307419461626, "phrase": "service_personalization"}, {"score": 0.007889476399340893, "phrase": "perceived_benefits"}, {"score": 0.00481495049065317, "phrase": "consumer-based_service_brand_equity"}, {"score": 0.004441236717408874, "phrase": "service_brands"}, {"score": 0.004081385289516914, "phrase": "high_information_costs"}, {"score": 0.0036553070575015344, "phrase": "personalized_offerings"}, {"score": 0.0033220706785945815, "phrase": "new_features"}, {"score": 0.00322576184471691, "phrase": "important_implications"}, {"score": 0.002975024676463106, "phrase": "service_brand"}, {"score": 0.00280496585980086, "phrase": "internet_banking_service"}, {"score": 0.002673957615079041, "phrase": "laboratory_experiment"}, {"score": 0.0025963890234079333, "phrase": "significant_positive_influences"}, {"score": 0.002511803988580901, "phrase": "internet_banking_service_brand"}, {"score": 0.0024389277933858054, "phrase": "csbe_development"}, {"score": 0.0022492129111567824, "phrase": "brand's_csbe"}, {"score": 0.002183938718432764, "phrase": "cost_savings"}, {"score": 0.002128376306688074, "phrase": "brand_implications"}, {"score": 0.0021049977753042253, "phrase": "study's_results"}], "paper_keywords": ["consumer-based brand equity", " Internet banking", " personalization", " service brand equity", " technology adoption", " trialability"], "paper_abstract": "The commercialization of the Internet has provided opportunities for building service brands in the minds of consumers. Services are characterized as intangible, heterogeneous, inseparable, and perishable features that often engender high information costs and, hence, low perceived value to potential consumers. When a service is available via the Internet - a medium that can subdivide and rebuild the service into personalized offerings-potential consumers become better informed in advance of what the service provides. The Internet also permits most services to be trialable before consumption. These new features, empowered by the Internet, have important implications for what we call consumer-based service brand equity (CSBE), the value that potential consumers assign to a service brand This article investigates the effects of service personalization and trialability on the development of CSBE of Internet banking service, a typical service available via the Internet. Results from a laboratory experiment indicate that both service personalization and trialability have significant positive influences on the development of the CSBE of an Internet banking service brand While personalization was found to indirectly influence CSBE development by mediating the perceived benefits of the brand, trialability exerted both a direct and an indirect effect. Trialability developed the brand's CSBE by first mediating the information through gathering cost savings and then the perceived benefits of the brand Implications of the study's results are discussed.", "paper_title": "Developing consumer-based service brand equity via the Internet: The role of personalization and trialability", "paper_id": "WOS:000258584400002"}