{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "rough_sets"}, {"score": 0.043083320582523656, "phrase": "analogous_form"}, {"score": 0.030857258337452512, "phrase": "rough_mereology"}, {"score": 0.004543436145505023, "phrase": "particular_points"}, {"score": 0.004316552692395911, "phrase": "formal_approaches"}, {"score": 0.003778081566896723, "phrase": "rough_set_decision_rules"}, {"score": 0.003626272370749206, "phrase": "fuzzy_decision_rules"}, {"score": 0.0034215569542785907, "phrase": "graded_notion"}, {"score": 0.003375087185182269, "phrase": "decision_rules"}, {"score": 0.003284026247389735, "phrase": "new_context"}, {"score": 0.0031198362555601377, "phrase": "rough_mereological_granular_logics"}, {"score": 0.003066945490483524, "phrase": "rough_decision_rules"}, {"score": 0.002815608851377745, "phrase": "prologue"}, {"score": 0.002777341265639153, "phrase": "basic_ideas"}, {"score": 0.002702363975375762, "phrase": "fuzzy_sets"}, {"score": 0.002602555367635598, "phrase": "rough_and_fuzzy_decision_rules"}, {"score": 0.0025409639091476363, "phrase": "main_protagonists"}, {"score": 0.0024055884143050037, "phrase": "partial_truth"}, {"score": 0.0022083264126633085, "phrase": "basic_information"}], "paper_keywords": [""], "paper_abstract": "The title of this note announces an attempt at pointing to particular points where rough set and fuzzy set approaches to decision making are close to each other, the closeness meaning that formal approaches to behaviour of the two at those points can be given in an analogous form. This by no means implies that the two can be unified as theories dealing with uncertainty. As the notion of truth for rough set decision rules is well established, we propose a notion of truth for fuzzy decision rules and we seek an analogy between the two. In order to introduce an analogous form of graded notion of truth for decision rules in both theories, we introduce a new context in which to set this notion. This context is based on our earlier results concerning rough mereological granular logics and their relevance for rough decision rules. To make our exposition satisfactorily complete, we recall our approach to granularity based on rough mereology. This note is partitioned into two parts. In Prologue, four sections present basic ideas on vagueness and ambiguity, rough sets, fuzzy sets and mereology along with rough mereology. Here also notions of truth for rough and fuzzy decision rules are presented. In Episode, main protagonists enter an analysis aimed at pointing to further close analogies between them, notably concerning notions of partial truth and dependency among attributes. To this end in four sections on similarity, granulation of knowledge, granular logics and dependencies, we give basic information on similarity, granulation and dependency and we point to analogies between the two theories with respect to those notions. We sum up the content of the note in Conclusions.", "paper_title": "Where Rough Sets and Fuzzy Sets Meet", "paper_id": "WOS:000367316400014"}