{"auto_keywords": [{"score": 0.04971414456915432, "phrase": "bibliographic_records"}, {"score": 0.015483621666231859, "phrase": "recording_evidence"}, {"score": 0.015366886500071997, "phrase": "data_values"}, {"score": 0.010595356934717652, "phrase": "data_value"}, {"score": 0.00481495049065317, "phrase": "evidence_recording"}, {"score": 0.004494570360108983, "phrase": "descriptive_metadata"}, {"score": 0.004392565073466714, "phrase": "previous_study"}, {"score": 0.004359078118356132, "phrase": "recorded_evidence"}, {"score": 0.0034777887763821425, "phrase": "prototype_system_development"}, {"score": 0.0031240868074933078, "phrase": "machine_readable_cataloging"}, {"score": 0.0030297830963114483, "phrase": "scanned_and_optical_character_recognition"}, {"score": 0.0029270797740550973, "phrase": "title_page"}, {"score": 0.002255431275670053, "phrase": "system's_performance"}, {"score": 0.0021049977753042253, "phrase": "proposed_scenario"}], "paper_keywords": [""], "paper_abstract": "Recording evidence for data values, in addition to the values themselves, in bibliographic records and descriptive metadata has been proposed in a previous study. Recorded evidence indicates why and how data values are recorded for elements. As a continuation of that study, this article first proposes a scenario in which a cataloger and a system interact with each other in recording evidence in bibliographic records for books, with the aim of minimizing costs and effort in recording evidence. Second, it reports on prototype system development in accordance with the scenario. The system (1) searches a string, corresponding to the data value entered by a cataloger or extracted from the Machine Readable Cataloging (MARC) record, within the scanned and optical character recognition (OCR)-converted title page and verso of the title page of an item being cataloged; (2) identifies the place where the string appears within the source of information; (3) identifies the procedure being used to form the value entered or recorded; and finally (4) displays the place and procedure identified for the data value as its candidate evidence. Third, this study reports on an experiment conducted to examine the system's performance. The results of the experiment show the usefulness of the system and the validity of the proposed scenario.", "paper_title": "A system for supporting evidence recording in bibliographic records", "paper_id": "WOS:000238519600010"}