{"auto_keywords": [{"score": 0.03669884834098149, "phrase": "information_changes"}, {"score": 0.00481495049065317, "phrase": "online_information_reliability_a_case_study"}, {"score": 0.004794651432412489, "phrase": "israeli"}, {"score": 0.0047442583539153696, "phrase": "purpose_-_the_purpose"}, {"score": 0.004615702262248962, "phrase": "websites'_content"}, {"score": 0.004304729100043155, "phrase": "-_the_israeli_real_estate_market"}, {"score": 0.004014622594864188, "phrase": "real_estate_properties"}, {"score": 0.0035813187237362415, "phrase": "anticipated_market_trends"}, {"score": 0.003513775171925978, "phrase": "statistical_measures"}, {"score": 0.0034989387309057817, "phrase": "comparatively_analyse_trends"}, {"score": 0.0034040118925461557, "phrase": "actual_market_data"}, {"score": 0.0033539650591984933, "phrase": "primary_results"}, {"score": 0.003332741541547911, "phrase": "information_change"}, {"score": 0.0030817342199597622, "phrase": "future_price_increases"}, {"score": 0.003055753392622163, "phrase": "recurring_trends"}, {"score": 0.0029980921611127884, "phrase": "real_market"}, {"score": 0.002837537664196412, "phrase": "content_quality"}, {"score": 0.002691250452058646, "phrase": "limited_time_period"}, {"score": 0.002640511562495634, "phrase": "israel"}, {"score": 0.00246222522291692, "phrase": "practical_contribution"}, {"score": 0.0024157365672954085, "phrase": "real_estate_world"}, {"score": 0.002395356999961208, "phrase": "real_estate_websites"}, {"score": 0.0023551109772219658, "phrase": "user_services"}, {"score": 0.00232536980572987, "phrase": "ad_sharing"}, {"score": 0.002296003351860598, "phrase": "efficient_searches"}, {"score": 0.0022862969905421, "phrase": "search_engines"}, {"score": 0.0022194892065026356, "phrase": "continued_monitoring"}, {"score": 0.0022007615631561075, "phrase": "user_information_change_patterns"}, {"score": 0.0021409788357513735, "phrase": "first_study"}, {"score": 0.0021184194106771146, "phrase": "real_estate_websites'_quality"}], "paper_keywords": ["Ontology", " Online information reliability", " Real estate websites", " Website quality", " Wisdom of the crowds"], "paper_abstract": "Purpose - The purpose of this paper is to determine whether the quality and reliability of websites' content can be assessed through the lens of \"wisdom of the crowds\". In particular as a case study the authors examine the information supplied over time on several prominent Israeli real estate websites. Design/methodology/approach - The Israeli real estate market was selected for the study, since there are many large, popular and dynamic real estate websites that feature hundreds of thousands of ads, representing most of the supply of real estate properties in the country. The authors built an automatic, ontology-based system that downloaded advertisements from three selected websites every two weeks for a number of months and checked for changes in these advertisements over time. The authors conjecture that wisdom of the crowds is mostly reflected by the information changes on the websites, since they indicate the anticipated market trends. Hence the authors developed a number of statistical measures to comparatively analyse trends of information changes on these websites, and assess their reliability compared to the actual market data and tendencies. Findings - The primary results suggest similar information change trends amongst all the websites. Surprisingly, although some properties did not sell over time, sellers generally did not lower their asking price and were willing to wait. Sellers even raised their asking price, apparently in anticipation of future price increases. Comparison of recurring trends among the websites with the trends of the real market during the same time period and a few months after reveals that wisdom of the crowds is only partially effective as an indicator and predictor of website content quality: it correctly reflects the fluctuation in demand, but not in the prices. Research limitations/implications - This study was conducted over a limited time period of five months, and only in several cities in Israel. Additionally, since buyers are not explicitly represented in these sites, their information behaviour was not analysed, although it undoubtedly influences information changes performed by the sellers. Practical implications - The practical contribution of this study is the ontology of the real estate world. Its assimilation by real estate websites would promote the development of their sites and user services. It would also enable ad sharing amongst the various websites and enable efficient searches by search engines. In addition the tools and measures that the authors developed will allow continued monitoring and analysis of user information change patterns. Originality/value - To the best of the knowledge this is the first study to examine and compare real estate websites' quality and evaluate their information reliability as wisdom of the crowds.", "paper_title": "Wisdom of the crowds and online information reliability A case study of Israeli real estate websites", "paper_id": "WOS:000342001500007"}