{"auto_keywords": [{"score": 0.0360445530776084, "phrase": "perceived_usefulness"}, {"score": 0.01557276120808942, "phrase": "electronic_knowledge_repository"}, {"score": 0.01109570959600637, "phrase": "perceived_ease"}, {"score": 0.004316722156877335, "phrase": "technology_acceptance_model"}, {"score": 0.004136044939878838, "phrase": "extrinsic_and_intrinsic_motivations"}, {"score": 0.003962899903266524, "phrase": "empirical_data"}, {"score": 0.0036727401586301328, "phrase": "taiwan"}, {"score": 0.0032149396890830575, "phrase": "important_antecedent"}, {"score": 0.0029793675408245047, "phrase": "influential_factor"}, {"score": 0.0026202187680903063, "phrase": "relative_importance"}, {"score": 0.0025586128304269616, "phrase": "important_role"}, {"score": 0.0025103699913760057, "phrase": "ekr_usage_intentions"}, {"score": 0.0021454671611847507, "phrase": "ekr_usage_research"}, {"score": 0.0021049977753042253, "phrase": "practical_implications"}], "paper_keywords": ["knowledge sharing", " knowledge-sharing motivations", " electronic knowledge repositories", " knowledge management", " information system acceptance"], "paper_abstract": "Why would R&D employees be willing to use an electronic knowledge repository (EKR) for knowledge-sharing? This study integrates a technology acceptance model (TAM) to investigate the influence of extrinsic and intrinsic motivations on R&D employees' acceptance of an EKR for knowledge-sharing. Empirical data were collected through a survey, which gathered data from 225 employees working in 10 organisations in Taiwan. The results indicated that (1) reputation and reciprocity were found to be two important antecedents to perceived usefulness and perceived ease of use; (2) altruism was also found to be an important antecedent to perceived ease of use; (3) reputation was the most influential factor of perceived usefulness, and another influential factor of perceived usefulness was reciprocity. Three knowledge-sharing motivations that significantly affect the perceived ease of use were listed as reciprocity, altruism, and reputation, according to the relative importance; (4) altruism plays an important role in explaining the EKR usage intentions for knowledge-sharing both directly and indirectly; and (5) the results were consistent with the propositions of TAM. This study contributes theoretically and empirically to the body of EKR usage research and also has practical implications.", "paper_title": "Knowledge-sharing motivations affecting R&D employees' acceptance of electronic knowledge repository", "paper_id": "WOS:000287603600006"}