{"auto_keywords": [{"score": 0.048186916426953504, "phrase": "tablet-based_interactive_classrooms"}, {"score": 0.008713768692145006, "phrase": "students'_beliefs"}, {"score": 0.005378091427181966, "phrase": "tablet_use"}, {"score": 0.004056769841308405, "phrase": "technologically_enhanced_learning_environments"}, {"score": 0.00376127170364341, "phrase": "young_students'_perceptions"}, {"score": 0.0035048567587934254, "phrase": "rural_areas"}, {"score": 0.003469688921449904, "phrase": "korea"}, {"score": 0.0032494292163722065, "phrase": "theoretical_framework"}, {"score": 0.0031684791285366315, "phrase": "structural_research_model"}, {"score": 0.002563219920877287, "phrase": "tablet-based_instructions"}, {"score": 0.002437012847684331, "phrase": "deeper_learning_experiences"}, {"score": 0.0022252591643049744, "phrase": "relevant_implications"}, {"score": 0.0021697677572213086, "phrase": "learning_activities"}, {"score": 0.0021263705039915198, "phrase": "rural_schools"}, {"score": 0.0021049977753042253, "phrase": "tablet-based_interactive_classroom_environments"}], "paper_keywords": ["Tablet-based instruction", " Beliefs about the future", " Self-efficacy", " Desire for learning", " Technology integration"], "paper_abstract": "With the distribution of easy-to-use tablet computers, tablet-based interactive classrooms have become popular environments for innovative learning activities in recent years. However, little research has investigated the relationship between technologically enhanced learning environments and students' beliefs about the future and self-efficacy for learning. In this study, young students' perceptions of tablet-based interactive classrooms, beliefs about the future, and self-efficacy for learning in rural areas of Korea were examined after the students engaged in tablet-based interactive classrooms. To develop the theoretical framework, we created a structural research model of ease of use, usefulness, satisfaction, deepened experiences through tablet use, beliefs about the future, and self-efficacy in tablet-based interactive classrooms based on a partial least squares (PLS) method. The results indicate that (1) students in tablet-based interactive classrooms perceive frequent experiences with tablet-based instructions as easy and useful and (2) student satisfaction is significantly influenced by their perceptions of deeper learning experiences through tablet use, which are significantly influenced by their future expectations and self-efficacy for learning. This study provides relevant implications for educators who design learning activities for students in rural schools in tablet-based interactive classroom environments. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Factors influencing students' beliefs about the future in the context of tablet-based interactive classrooms", "paper_id": "WOS:000364893300001"}