{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multi-radio_wireless_mesh_networks"}, {"score": 0.013010114704574582, "phrase": "network_throughput"}, {"score": 0.00459039896577789, "phrase": "increasing_attention"}, {"score": 0.004439445472040688, "phrase": "isp's_wireless_last_mile_access"}, {"score": 0.003939565240409143, "phrase": "multiple_radios"}, {"score": 0.003791763445590174, "phrase": "cost-effective_wireless_devices"}, {"score": 0.00349577373145384, "phrase": "non-overlapped_frequency_channels"}, {"score": 0.0032074366230426727, "phrase": "network_links"}, {"score": 0.003131637033429892, "phrase": "achievable_throughput"}, {"score": 0.0029569247903654477, "phrase": "radio_interfaces"}, {"score": 0.0029147869733574844, "phrase": "proper_channel_assignment_scheme"}, {"score": 0.0027259252868643926, "phrase": "key_requirements"}, {"score": 0.002687070469080394, "phrase": "channel_assignment_scheme"}, {"score": 0.002598543802992702, "phrase": "channel_assignment"}, {"score": 0.0025614999929672, "phrase": "routing_problems"}, {"score": 0.002500927169609655, "phrase": "centralized_channel_assignment"}, {"score": 0.0024771000236931836, "phrase": "routing_algorithm"}, {"score": 0.0021976915360493628, "phrase": "performance_study"}], "paper_keywords": ["wireless mesh networks", " multi-radio", " channel assignment and routing"], "paper_abstract": "Wireless mesh networks (WMNs) are receiving increasing attention as an effective means to deploy ISP's wireless last mile access, wireless enterprise backbone networks and several other applications. The focus of this paper is on multi-radio wireless mesh networks, given the considerable improvement in network throughput that multiple radios allow to achieve and the availability of cost-effective wireless devices. Interesting research problems are still unsolved in this field. Due to the scarcity of non-overlapped frequency channels and available radios per node, interference is still present, which limits the bandwidth available on network links and eventually cuts the achievable throughput down. As interference depends on how channels are bound to radio interfaces, a proper channel assignment scheme is needed to reduce the interference. In this paper we identify some key requirements of a channel assignment scheme and show the interdependence between the channel assignment and the routing problems. Accordingly, a centralized channel assignment and routing algorithm is developed for multi-radio wireless mesh networks aiming to maximize the network throughput. An integer linear programming (ILP) model is presented to evaluate the performance of our heuristic. Finally, a performance study is carried out to assess the effectiveness of our proposed algorithm. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A channel assignment algorithm for multi-radio wireless mesh networks", "paper_id": "WOS:000256581700008"}