{"auto_keywords": [{"score": 0.03998042467305197, "phrase": "joint_probability"}, {"score": 0.015643895327554377, "phrase": "forensic_identification"}, {"score": 0.00481495049065317, "phrase": "likelihood_ratio_estimation"}, {"score": 0.004607686390487483, "phrase": "known_source"}, {"score": 0.004387793971765289, "phrase": "discriminative_power"}, {"score": 0.004240116703465252, "phrase": "dna_evidence"}, {"score": 0.004127565348326288, "phrase": "necessary_probability_distributions"}, {"score": 0.004067432889457786, "phrase": "reasonable_accuracy"}, {"score": 0.004027830092522303, "phrase": "probabilistic_approach"}, {"score": 0.0038922205435184174, "phrase": "likelihood_ratio"}, {"score": 0.0037336520904376687, "phrase": "identification_hypothesis"}, {"score": 0.0036167509502276294, "phrase": "exclusion_hypothesis"}, {"score": 0.003168952160907741, "phrase": "approximate_method"}, {"score": 0.0028175425351455643, "phrase": "third_method"}, {"score": 0.0026243534128245886, "phrase": "univariate_gaussian_case"}, {"score": 0.002598764579760562, "phrase": "intuitive_appeal_-_forensic_examiners"}, {"score": 0.002567128216371822, "phrase": "rare_feature_values"}, {"score": 0.002535876002754739, "phrase": "low_importance"}, {"score": 0.002523481637809674, "phrase": "common_feature_values"}, {"score": 0.0024264776194357993, "phrase": "lr_estimation"}, {"score": 0.0024028135317872, "phrase": "empirical_evaluations"}, {"score": 0.002265586601922693, "phrase": "binary_features"}, {"score": 0.0022434880661725493, "phrase": "multinomial_features"}, {"score": 0.002232519579957707, "phrase": "footwear_impressions"}, {"score": 0.0022216045996270974, "phrase": "continuous_features"}, {"score": 0.0021784745589727246, "phrase": "rarity_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Likelihood ratio", " Distance measure", " Rarity", " Forensic science", " Impression evidence", " Approximate inference"], "paper_abstract": "Forensic identification is the task of determining whether or not observed evidence arose from a known source. It is useful to associate probabilities with identification/exclusion opinions, either for presentation in court or to evaluate the discriminative power of a given set of attributes. At present, in most forensic domains outside of DNA evidence, it is not possible to make such a statement since the necessary probability distributions cannot be computed with reasonable accuracy, although the probabilistic approach itself is well-understood. In principle, it involves determining a likelihood ratio (LR) - the ratio of the joint probability of the evidence and source under the identification hypothesis (that the evidence came from the source) and under the exclusion hypothesis (that the evidence did not arise from the source). Evaluating the joint probability is computationally intractable when the number of variables is even moderately large. It is also statistically infeasible since the number of parameters to be determined from the data is exponential with the number of variables. An approximate method is to replace the joint probability by another probability: that of distance (or similarity) between evidence and object under the two hypotheses. While this reduces to linear complexity with the number of variables, it is an oversimplification leading to errors. We consider a third method which decomposes the LR into a product of two factors, one based on distance and the other on rarity. This result, which is exact for the univariate Gaussian case, has an intuitive appeal - forensic examiners assign higher importance to rare feature values in the evidence and low importance to common feature values. We generalize this approach to more complex data such as vectors and graphs, which makes LR estimation computationally tractable. Empirical evaluations of the three methods, done with several data types (continuous features, binary features, multinomial and graph) and several modalities (handwriting with binary features, handwriting with multinomial features and footwear impressions with continuous features), show that the distance and rarity method is significantly better than the distance only method. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Likelihood ratio estimation in forensic identification using similarity and rarity", "paper_id": "WOS:000329888800004"}