{"auto_keywords": [{"score": 0.049631680892871025, "phrase": "conceptual_modeling_grammars"}, {"score": 0.01482592756880199, "phrase": "grammar_performance"}, {"score": 0.00481495049065317, "phrase": "empirical_evaluations"}, {"score": 0.004551199992546761, "phrase": "someone's_perception"}, {"score": 0.004466519142879166, "phrase": "group's_negotiated_perception"}, {"score": 0.00440403952059725, "phrase": "domain_semantics"}, {"score": 0.0034171734618737436, "phrase": "empirical_research"}, {"score": 0.002688532127821979, "phrase": "grammar_characteristics"}, {"score": 0.0026014425686078993, "phrase": "conceptual_modeling_research"}, {"score": 0.002323663295811215, "phrase": "ontological_perspective"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Conceptual modeling grammars", " Grammar quality", " Grammar performance", " Script creation", " Script interpretation", " Ontology", " Experimental design"], "paper_abstract": "Conceptual modeling grammars are used to create scripts that represent someone's perception, or some group's negotiated perception, of domain semantics. For many years, researchers have evaluated conceptual modeling grammars to determine ways that they can be improved. One way to evaluate them is to empirically evaluate the strengths and weaknesses of the grammars in terms of their effectiveness and efficiency in generating scripts. A number of researchers have proposed guidelines for the design of empirical research to conduct such evaluations. Although these guidelines have proved useful, further clarification is needed in relation to (1) criteria for evaluating grammar performance, (2) characteristics of grammars that can influence grammar performance, and (3) factors that must be considered when testing the effect of grammar characteristics on grammar performance. We review past conceptual modeling research and provide guidelines for addressing these three issues. We also illustrate how the guidelines would apply to studies that evaluate conceptual modeling grammars from an ontological perspective. Finally, we discuss how the guidelines extend those offered in past research and the implications of our work for future research.", "paper_title": "Guidelines for Empirical Evaluations of Conceptual Modeling Grammars", "paper_id": "WOS:000269971600002"}