{"auto_keywords": [{"score": 0.038725271259795684, "phrase": "duplicate_papers"}, {"score": 0.02322730111336099, "phrase": "scientific_impact"}, {"score": 0.02301779518163284, "phrase": "duplicate_publications"}, {"score": 0.0047268728636719725, "phrase": "different_scientific_fields"}, {"score": 0.004329916183121203, "phrase": "medical_literature"}, {"score": 0.004192190072470619, "phrase": "information_science_community"}, {"score": 0.0037177622939493084, "phrase": "bibliometric_analysis"}, {"score": 0.0034368818187904744, "phrase": "exact_same_title"}, {"score": 0.0032514447965530323, "phrase": "cited_references"}, {"score": 0.002950608985750058, "phrase": "natural_and_medical_sciences"}, {"score": 0.002896535621940078, "phrase": "social_sciences"}, {"score": 0.0024409345168575833, "phrase": "impact_factors"}, {"score": 0.0023522423291484212, "phrase": "lower_citations"}, {"score": 0.0022772782536385717, "phrase": "clear_evidence"}], "paper_keywords": ["Ethics", " Medical sciences", " Intellectual property", " Publications", " Information science"], "paper_abstract": "Purpose - The issue of duplicate publications has received a lot of attention in the medical literature, but much less in the information science community. This paper aims to analyze the prevalence and scientific impact of duplicate publications across all fields of research between 1980 and 2007. Design/methodology/approach - The approach is a bibliometric analysis of duplicate papers based on their metadata. Duplicate papers are defined as papers published in two different journals having the exact same title; the same first author; and the same number of cited references. Findings - In all fields combined, the prevalence of duplicates is one out of 2,000 papers, but is higher in the natural and medical sciences than in the social sciences and humanities. A very high proportion (>85 percent) of these papers are published the same year or one year apart, which suggest that most duplicate papers were submitted simultaneously. Furthermore, duplicate papers are generally published in journals with impact factors below the average of their field and obtain lower citations. Originality/value - The paper provides clear evidence that the prevalence of duplicate papers is low and, more importantly, that the scientific impact of such papers is below average.", "paper_title": "On the prevalence and scientific impact of duplicate publications in different scientific fields (1980-2007)", "paper_id": "WOS:000276504800002"}