{"auto_keywords": [{"score": 0.048522326887293465, "phrase": "target_variable"}, {"score": 0.04010882425349306, "phrase": "rare_extreme_values"}, {"score": 0.013727122295839058, "phrase": "regression_tasks"}, {"score": 0.012325750117281651, "phrase": "continuous_target_variable"}, {"score": 0.00438105507792004, "phrase": "class_imbalance"}, {"score": 0.004258644418211771, "phrase": "machine_learning"}, {"score": 0.0038746849003761024, "phrase": "important_applications"}, {"score": 0.003132236287543072, "phrase": "rare_target_cases"}, {"score": 0.0030017207229983385, "phrase": "well-known_resampling_strategies"}, {"score": 0.002426137929553724, "phrase": "extensive_set"}, {"score": 0.002358220053411644, "phrase": "empirical_evidence"}, {"score": 0.0022706045233150795, "phrase": "particular_regression_tasks"}, {"score": 0.0022385926290967263, "phrase": "proposed_resampling_methods"}, {"score": 0.002175913488493802, "phrase": "existing_regression_algorithm"}, {"score": 0.0021049977753042253, "phrase": "general_tools"}], "paper_keywords": ["artificial intelligence", " software engineering", " business and finance"], "paper_abstract": "Several real world prediction problems involve forecasting rare values of a target variable. When this variable is nominal, we have a problem of class imbalance that was thoroughly studied within machine learning. For regression tasks, where the target variable is continuous, few works exist addressing this type of problem. Still, important applications involve forecasting rare extreme values of a continuous target variable. This paper describes a contribution to this type of tasks. Namely, we propose to address such tasks by resampling approaches that change the distribution of the given data set to decrease the problem of imbalance between the rare target cases and the most frequent ones. We present two modifications of well-known resampling strategies for classification tasks: the under-sampling and the synthetic minority over-sampling technique (SMOTE) methods. These modifications allow the use of these strategies on regression tasks where the goal is to forecast rare extreme values of the target variable. In an extensive set of experiments, we provide empirical evidence for the superiority of our proposals for these particular regression tasks. The proposed resampling methods can be used with any existing regression algorithm, which means that they are general tools for addressing problems of forecasting rare extreme values of a continuous target variable.", "paper_title": "Resampling strategies for regression", "paper_id": "WOS:000355958900011"}