{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "treaty_systems"}, {"score": 0.026799446604476664, "phrase": "treaty_operations"}, {"score": 0.0256460237418678, "phrase": "duplication_problem"}, {"score": 0.003738502710504415, "phrase": "distributed_environments"}, {"score": 0.0036759314172445934, "phrase": "dynamic_populations"}, {"score": 0.0034944094552943, "phrase": "capability_approach"}, {"score": 0.0031577303835881964, "phrase": "finer_control"}, {"score": 0.003018668521745676, "phrase": "new_problem"}, {"score": 0.002951444412262927, "phrase": "behaviour_modeling"}, {"score": 0.0027123819773059127, "phrase": "unauthorized_behaviour"}, {"score": 0.0025494354909453847, "phrase": "formal_definitions"}], "paper_keywords": ["Behaviour Control", " Access Control", " Duplication Problem", " Treaties", " Distributed Computing"], "paper_abstract": "Capabilities are a more scalable and adaptive access control approach compared with the conventional approaches such as ACLs, due to their being held and managed by users or agents in systems, but not the middleware. This feature makes capabilities more suitable in distributed environments that have dynamic populations. Treaties have been proposed to enhance the capability approach by introducing sequences of actions, such that treaties can capture characteristics of behaviours, and provide finer control over accesses. However there is a new problem brought by the behaviour modeling of treaties which is called duplication problem, which concerns preventing users from gaining unauthorized behaviour by duplicating treaties. In this paper we provide the formal definitions of treaty operations, and discuss the causes of the duplication problem, and how treaty operations can affect this. We also propose three models of treaty systems that aim to solve the duplication problem, and evaluating their performance and scalability.", "paper_title": "Duplication Problem in Treaty Systems: Causes and Solutions", "paper_id": "WOS:000331779200020"}