{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "concurrent_learning"}, {"score": 0.004444921827311577, "phrase": "svm-based_ranking_algorithm"}, {"score": 0.004259293347851015, "phrase": "different_activity_profiles"}, {"score": 0.004059673618719782, "phrase": "specific_labeling"}, {"score": 0.0038487848937121204, "phrase": "virtual_screening_models"}, {"score": 0.0038079353103469865, "phrase": "multiple_targets"}, {"score": 0.0035527409334589317, "phrase": "multi-target_screening_models"}, {"score": 0.0030595112110658675, "phrase": "ranking-based_algorithms"}, {"score": 0.003010893527930816, "phrase": "increased_performance"}, {"score": 0.002947266048104005, "phrase": "multi-target_virtual_screening"}, {"score": 0.0027791193706247267, "phrase": "desired_activity_profile"}, {"score": 0.0026205405415623525, "phrase": "entirely_undesired_profile"}, {"score": 0.002418742283474052, "phrase": "valuable_approach"}, {"score": 0.002393034183276193, "phrase": "virtual_screening"}, {"score": 0.0023675986784123656, "phrase": "multi-target_drug_design"}, {"score": 0.0021049977753042253, "phrase": "already_perfectly_matching_activity_profile"}], "paper_keywords": ["Machine learning", " Support vector machine", " Ranking", " Virtual screening", " Multi-target"], "paper_abstract": "Background: In this study, we present a SVM-based ranking algorithm for the concurrent learning of compounds with different activity profiles and their varying prioritization. To this end, a specific labeling of each compound was elaborated in order to infer virtual screening models against multiple targets. We compared the method with several state-of-the-art SVM classification techniques that are capable of inferring multi-target screening models on three chemical data sets (cytochrome P450s, dehydrogenases, and a trypsin-like protease data set) containing three different biological targets each. Results: The experiments show that ranking-based algorithms show an increased performance for single- and multi-target virtual screening. Moreover, compounds that do not completely fulfill the desired activity profile are still ranked higher than decoys or compounds with an entirely undesired profile, compared to other multi-target SVM methods. Conclusions: SVM-based ranking methods constitute a valuable approach for virtual screening in multi-target drug design. The utilization of such methods is most helpful when dealing with compounds with various activity profiles and the finding of many ligands with an already perfectly matching activity profile is not to be expected.", "paper_title": "A ranking method for the concurrent learning of compounds with various activity profiles", "paper_id": "WOS:000350438700002"}