{"auto_keywords": [{"score": 0.029007308479638578, "phrase": "drain-to-source_voltage"}, {"score": 0.00481495049065317, "phrase": "single-electron_transistor_mixer"}, {"score": 0.004638788604042707, "phrase": "improved_mathematical_model"}, {"score": 0.004553128404612054, "phrase": "current-voltage_characteristics"}, {"score": 0.0035951877427580006, "phrase": "multisinusoidal_signal"}, {"score": 0.003135356056324338, "phrase": "homodyne_detector"}, {"score": 0.0030967972831536243, "phrase": "dc"}, {"score": 0.0029462012558267863, "phrase": "particular_value"}, {"score": 0.0028917056916949744, "phrase": "input_amplitude"}, {"score": 0.0027857115172243226, "phrase": "strong_dependence"}, {"score": 0.0025691622090542304, "phrase": "heterodyne_mixer"}, {"score": 0.0024595996811420566, "phrase": "drain-to-source_intermediate-frequency"}, {"score": 0.0021049977753042253, "phrase": "input_voltages_amplitude"}], "paper_keywords": ["Single-electron-transistor", " Mixers"], "paper_abstract": "In this paper an improved mathematical model for the current-voltage characteristics of the single-electron-transistor (SET) is presented. The model, basically, a Fourier-cosine series, can be used for predicting the performance of the SET when the input is formed of a multisinusoidal signal. Two special cases are considered in detail; the homodyne detector and the heterodyne mixer. The results show that for the homodyne detector the DC drain current exhibits a maximum at a particular value of the input amplitude. This maximum shows a strong dependence on the drain-to-source voltage and less dependence on the temperature. For the heterodyne mixer, the results show that the drain-to-source intermediate-frequency (IF) current exhibits a maximum and a minimum for any scenario of the drain-to-source voltage and the temperature. The value of the input voltages amplitude at which these maxima and minima occur is strongly dependent on the drain-to-source voltage and less dependent of the temperature.", "paper_title": "Improved analysis of the single-electron transistor mixer", "paper_id": "WOS:000271392800002"}