{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_networks"}, {"score": 0.015404416953417363, "phrase": "smartphone_logs"}, {"score": 0.014108563426512904, "phrase": "spatial_aspects"}, {"score": 0.004621671570727774, "phrase": "interactive_visualisation_techniques"}, {"score": 0.004073027900718392, "phrase": "smartphone_devices"}, {"score": 0.0040040425282442125, "phrase": "co-ordinated_views"}, {"score": 0.00388278852285898, "phrase": "demographic_and_attitudinal_variables"}, {"score": 0.003626272370749206, "phrase": "spatial_and_temporal_aspects"}, {"score": 0.0036015684625793775, "phrase": "participants'_social_networks"}, {"score": 0.003409880074659807, "phrase": "unexpected_deficiencies"}, {"score": 0.003141246279336443, "phrase": "significant_gaps"}, {"score": 0.0031198362555601377, "phrase": "participant_records"}, {"score": 0.0029436264166293317, "phrase": "reciprocal_call_logs"}, {"score": 0.0028641729745364952, "phrase": "high_quality"}, {"score": 0.0027395968397212053, "phrase": "significant_impact"}, {"score": 0.0026656357767832267, "phrase": "social_network"}, {"score": 0.0025848074189353397, "phrase": "visualisation_techniques"}, {"score": 0.002480826434008026, "phrase": "data_inconsistencies"}, {"score": 0.0023728841359713106, "phrase": "visual_approaches"}, {"score": 0.002332626862738603, "phrase": "data_problems"}, {"score": 0.002148677187261496, "phrase": "larger_smartphone_datasets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Big data", " Human behaviour", " Spatiotemporal", " Social networks", " Visual analysis"], "paper_abstract": "We designed and applied interactive visualisation techniques for investigating how social networks are embedded in time and space, using data collected from smartphone logs. Our interest in spatial aspects of social networks is that they may reveal associations between participants missed by simply making contact through smartphone devices. Four linked and co-ordinated views of spatial, temporal, individual and social network aspects of the data, along with demographic and attitudinal variables, helped add context to the behaviours we observed. Using these techniques, we were able to characterise spatial and temporal aspects of participants' social networks and suggest explanations for some of them. This provides some validation of our techniques. Unexpected deficiencies in the data that became apparent prompted us to evaluate the dataset in more detail. Contrary to what we expected, we found significant gaps in participant records, particularly in terms of location, a poorly connected sample of participants and asymmetries in reciprocal call logs. Although the data captured are of high quality, deficiencies such as these remain and are likely to have a significant impact on interpretations relating to spatial aspects of the social network. We argue that appropriately-designed interactive visualisation techniques - afforded by our flexible prototyping approach - are effective in identifying and characterising data inconsistencies. Such deficiencies are likely to exist in other similar datasets, and although the visual approaches we discuss for identifying data problems may not be scalable, the categories of problems we identify may be used to inform attempts to systematically account for errors in larger smartphone datasets. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Visual analysis of social networks in space and time using smartphone logs", "paper_id": "WOS:000327782000009"}