{"auto_keywords": [{"score": 0.004330941610682453, "phrase": "exceptionally_high_fidelity"}, {"score": 0.003916098498242888, "phrase": "material_costs"}, {"score": 0.0036553070575015344, "phrase": "printed_model"}, {"score": 0.0035408501923902477, "phrase": "printed_product"}, {"score": 0.0030199761431186434, "phrase": "automatic_detection"}, {"score": 0.0029409171055888804, "phrase": "problematic_cases"}, {"score": 0.0028944757265206332, "phrase": "structural_problems"}, {"score": 0.0028037753646260937, "phrase": "lightweight_structural_analysis_solver"}, {"score": 0.0027015344365793016, "phrase": "high_structural_stress"}, {"score": 0.00241658945942583, "phrase": "detection_and_correction_steps"}, {"score": 0.0021387992835532367, "phrase": "original_model"}, {"score": 0.0021049977753042253, "phrase": "greater_structural_integrity"}], "paper_keywords": ["3D printing", " structural analysis", " physics-based modeling"], "paper_abstract": "The use of 3D printing has rapidly expanded in the past couple of years. It is now possible to produce 3D-printed objects with exceptionally high fidelity and precision. However, although the quality of 3D printing has improved, both the time to print and the material costs have remained high. Moreover, there is no guarantee that a printed model is structurally sound. The printed product often does not survive cleaning, transportation, or handling, or it may even collapse under its own weight. We present a system that addresses this issue by providing automatic detection and correction of the problematic cases. The structural problems are detected by combining a lightweight structural analysis solver with 3D medial axis approximations. After areas with high structural stress are found, the model is corrected by combining three approaches: hollowing, thickening, and strut insertion. Both detection and correction steps are repeated until the problems have been eliminated. Our process is designed to create a model that is visually similar to the original model but possessing greater structural integrity.", "paper_title": "Stress Relief: Improving Structural Strength of 3D Printable Objects", "paper_id": "WOS:000308250300024"}