{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "real-time_character_control"}, {"score": 0.004485735417293941, "phrase": "human_body"}, {"score": 0.00443308765153716, "phrase": "consumer_hardware"}, {"score": 0.004304144138805271, "phrase": "real_time_skeleton-based_virtual_characters"}, {"score": 0.004081385289516914, "phrase": "humanoid_skeletons"}, {"score": 0.0034388111429203222, "phrase": "motion_transformations"}, {"score": 0.0030554300179552415, "phrase": "rigging-skinning_pipeline_source"}, {"score": 0.0028293966058473476, "phrase": "interactively-defined_sparse_pose_correspondences"}, {"score": 0.0025587867729949037, "phrase": "target_character"}, {"score": 0.0025286975935774245, "phrase": "real_time"}, {"score": 0.0023694065215394593, "phrase": "diverse_virtual_characters"}, {"score": 0.0023415390666563177, "phrase": "different_input_motion_controllers"}, {"score": 0.0021682027434117095, "phrase": "new_ways"}, {"score": 0.0021049977753042253, "phrase": "real-time_animation"}], "paper_keywords": [""], "paper_abstract": "It is now possible to capture the 3D motion of the human body on consumer hardware and to puppet in real time skeleton-based virtual characters. However, many characters do not have humanoid skeletons. Characters such as spiders and caterpillars do not have boned skeletons at all, and these characters have very different shapes and motions. In general, character control under arbitrary shape and motion transformations is unsolved - how might these motions be mapped? We control characters with a method which avoids the rigging-skinning pipeline source and target characters do not have skeletons or rigs. We use interactively-defined sparse pose correspondences to learn a mapping between arbitrary 3D point source sequences and mesh target sequences. Then, we puppet the target character in real time. We demonstrate the versatility of our method through results on diverse virtual characters with different input motion controllers. Our method provides a fast, flexible, and intuitive interface for arbitrary motion mapping which provides new ways to control characters for real-time animation.", "paper_title": "Interactive motion mapping for real-time character control", "paper_id": "WOS:000337543000028"}