{"auto_keywords": [{"score": 0.04292353398075803, "phrase": "optimal_subsets"}, {"score": 0.03730575590231708, "phrase": "rsr"}, {"score": 0.015719695724103148, "phrase": "reshaped_sequential_replacement"}, {"score": 0.008877751275908554, "phrase": "variables_space"}, {"score": 0.0047852458513833315, "phrase": "variable_selection"}, {"score": 0.004755725004531142, "phrase": "qspr"}, {"score": 0.004610809404212932, "phrase": "present_work"}, {"score": 0.004442703298710073, "phrase": "quantitative_structure-property_relationship"}, {"score": 0.004360952651269854, "phrase": "rsr_algorithm"}, {"score": 0.004293972451176702, "phrase": "simple_sequential_replacement_procedure"}, {"score": 0.004124579368997962, "phrase": "faster_convergence"}, {"score": 0.003961842092184655, "phrase": "chance_correlation"}, {"score": 0.0034039039924579437, "phrase": "different_physical-chemical_properties"}, {"score": 0.003310287367847261, "phrase": "ordinary_least_squares_models"}, {"score": 0.003209275810748739, "phrase": "y-scrambling"}, {"score": 0.003044558129699335, "phrase": "good_capability"}, {"score": 0.002960795132939529, "phrase": "qspr_modelling"}, {"score": 0.0027570267191549774, "phrase": "analysed_variable_selection_techniques"}, {"score": 0.0026481034178437958, "phrase": "john_wiley"}, {"score": 0.0025043368321347294, "phrase": "reference_variable_selection_techniques"}, {"score": 0.0023103100997344072, "phrase": "extensive_exploration"}, {"score": 0.002267708463966758, "phrase": "reasonable_computational_time"}, {"score": 0.002164602220179823, "phrase": "rsr_models"}], "paper_keywords": ["variable selection", " Reshaped Sequential Replacement", " QSPR", " QSAR"], "paper_abstract": "The objective of the present work was to compare the Reshaped Sequential Replacement (RSR) algorithm with other well-known variable selection techniques in the field of Quantitative Structure-Property Relationship (QSPR) modelling. RSR algorithm is based on a simple sequential replacement procedure with the addition of several reshaping' functions that aimed to (i) ensure a faster convergence upon optimal subsets of variables and (ii) reject models affected by chance correlation, overfitting and other pathologies. In particular, three reference variable selection methods were chosen for the comparison (stepwise forward selection, genetic algorithms and particle swarm optimization), aiming to identify benefits and drawbacks of RSR with respect to these methods. To this end, several QSPR datasets regarding different physical-chemical properties and characterized by different objects/variables ratios were used to build ordinary least squares models; in addition, some well-known (Y-scrambling) and more recent (R-based functions) statistical tools were used to analyse and compare the results. The study highlighted the good capability of RSR to find optimal subsets of variables in QSPR modelling, comparable or better than those found by the other reference variable selection methods. Moreover, RSR resulted to be faster than some of the analysed variable selection techniques, despite its extensive exploration of the variables space. Copyright (c) 2014 John Wiley & Sons, Ltd. This work aimed to compare the Reshaped Sequential Replacement (RSR) method with some reference variable selection techniques for quantitative structure-property relationship modelling in regression. Results highlighted the capability of RSR to select optimal subsets of variables and to perform an extensive exploration of the variables space with a reasonable computational time. In the majority of cases, despite the simplicity of the method, RSR models were comparable or better than those of the other variable selection techniques considered.", "paper_title": "Reshaped Sequential Replacement for variable selection in QSPR: comparison with other reference methods", "paper_id": "WOS:000333753400004"}