{"auto_keywords": [{"score": 0.03856581696447045, "phrase": "qml"}, {"score": 0.008930817556509582, "phrase": "nls"}, {"score": 0.00481495049065317, "phrase": "temporally_aggregated_multivariate_garch_models"}, {"score": 0.004621279527317074, "phrase": "quasi_maximum_likelihood"}, {"score": 0.004504193207111593, "phrase": "non-linear_least_squares"}, {"score": 0.0043452175611323335, "phrase": "temporally_aggregated_garch_models"}, {"score": 0.004023120753104693, "phrase": "aggregated_process"}, {"score": 0.0035382855372646164, "phrase": "first_two_moments"}, {"score": 0.0032423089921154503, "phrase": "substantial_bias"}, {"score": 0.0031116963435584982, "phrase": "aggregation_level"}, {"score": 0.0027505037762786087, "phrase": "univariate_garch_models"}, {"score": 0.0025726416100664853, "phrase": "weak_garch_models"}, {"score": 0.002393907896783117, "phrase": "considerably_large_samples"}, {"score": 0.0021049977753042253, "phrase": "empirical_example"}], "paper_keywords": ["Multivariate GARCH", " temporal aggregation", " weak GARCH"], "paper_abstract": "This paper investigates the performance of quasi maximum likelihood (QML) and non-linear least squares (NLS) estimation applied to temporally aggregated GARCH models. As these are known to be only weak GARCH, the conditional variance of the aggregated process is in general not known. Thus, one major condition, often used in proving the consistency of QML, the correct specification of the first two moments, is absent. Indeed, our results suggest that QML is not consistent, with a substantial bias if both the initial degree of persistence and the aggregation level are high. In other cases, QML might be taken as an approximation with only a small bias. On the basis of the results for univariate GARCH models, NLS is likely to be consistent, although inefficient, for weak GARCH models. Our simulation study reveals that NLS does not reduce the bias of QML in considerably large samples. As the variation of NLS estimates is much higher than that of QML, one would obviously prefer QML in most practical situations. An empirical example illustrates some of the results.", "paper_title": "Estimation of temporally aggregated multivariate GARCH models", "paper_id": "WOS:000249549200001"}