{"auto_keywords": [{"score": 0.050078387629161586, "phrase": "hierarchical_co-clustering"}, {"score": 0.04676262895053792, "phrase": "mood_labels"}, {"score": 0.030069569642770536, "phrase": "hcc"}, {"score": 0.029678294790741185, "phrase": "music_data"}, {"score": 0.004708343335530363, "phrase": "music_information_retrieval"}, {"score": 0.004687469105788703, "phrase": "mir"}, {"score": 0.004655924035639928, "phrase": "important_research_topic"}, {"score": 0.0045324756541157574, "phrase": "user-assigned_tags"}, {"score": 0.004512220065386271, "phrase": "artist-related_style"}, {"score": 0.004412285905508977, "phrase": "music_listening_web_sites"}, {"score": 0.004247429472272524, "phrase": "fundamental_research_problem"}, {"score": 0.00411628144680842, "phrase": "different_pieces"}, {"score": 0.0035344448639851827, "phrase": "co-existing_clusters"}, {"score": 0.0030414140732789186, "phrase": "hierarchical_clusters"}, {"score": 0.003000759072185226, "phrase": "andmood_labels"}, {"score": 0.002862686580513984, "phrase": "hierarchical_co"}, {"score": 0.002761756622014068, "phrase": "hierarchical_clustering"}, {"score": 0.002730949750233485, "phrase": "divisive_strategy"}, {"score": 0.0026763584713471534, "phrase": "input_data"}, {"score": 0.0026584043201634496, "phrase": "smaller_groups"}, {"score": 0.0026111116934081284, "phrase": "agglomerative_strategy"}, {"score": 0.0025646582321414858, "phrase": "initially_individually_separated_data_points"}, {"score": 0.002430185991522955, "phrase": "previously_known_divisive_hierarchical_co-clustering_method"}, {"score": 0.002413879273009396, "phrase": "novel_agglomerative_hierarchical_co-clustering"}, {"score": 0.0023339685523621903, "phrase": "instance-level_constraints"}, {"score": 0.002318305959212027, "phrase": "better_performance"}, {"score": 0.002211565200915999, "phrase": "reasonable_clustering_performance"}, {"score": 0.0021770860717929192, "phrase": "case_study"}, {"score": 0.0021239851029066087, "phrase": "new_method"}, {"score": 0.0021049977753042253, "phrase": "artist_similarity"}], "paper_keywords": ["Co-clustering", " hierarchical clustering", " user tags"], "paper_abstract": "In music information retrieval (MIR) an important research topic, which has attracted much attention recently, is the utilization of user-assigned tags, artist-related style, and mood labels, which can be extracted from music listening web sites, such as Last. fm (http:www.last.fm/) and All Music Guide (http:www.allmusic.com/). A fundamental research problem in the area is how to understand the relationships among artists/songs and these different pieces of information. Co-clustering is the problem of simultaneously clustering two types of data (e.g., documents and words, and webpages and urls). We can naturally bring this idea to the situation at hand and consider clustering artists and tags together, artists and styles together, or artists and mood labels together. Once such co-clustering has been successfully completed, one can identify co-existing clusters of artists and tags, styles, or mood labels (T/S/M). For simplicity, we use the acronym T/S/M to refer to tag(s), style(s), or mood(s) for the rest of the paper. When dealing with tags it is worth noticing that some tags are more specific versions of others. This naturally suggests that the tags could be organized in hierarchical clusters. Such hierarchical organizations exist for styles andmood labels, so we will consider hierarchical co-clustering of artists and T/S/M. In this paper, we systematically study the application of hierarchical co-clustering (HCC) methods for organizing the music data. There are two standard strategies for hierarchical clustering. One is the divisive strategy, in which we attempt to divide the input data set into smaller groups recursively, and the other is the agglomerative strategy, in which we attempt to combine initially individually separated data points into larger groups by finding the most closely related pair at each iteration. We will compare these two strategies against each other. We apply a previously known divisive hierarchical co-clustering method and a novel agglomerative hierarchical co-clustering. In addition, we demonstrate that these two methods have the capability of incorporating instance-level constraints to achieve better performance. We perform experiments to show that these two hierarchical co-clustering methods can be effectively deployed for organizing the music data and they present reasonable clustering performance comparing with the other clustering methods. A case study is also conducted to show that HCC provides us a new method to quantify the artist similarity.", "paper_title": "Hierarchical Co-Clustering: A New Way to Organize the Music Data", "paper_id": "WOS:000302702500019"}