{"auto_keywords": [{"score": 0.046469323589718704, "phrase": "teaching_blogs"}, {"score": 0.00481495049065317, "phrase": "secondary_school_teachers'_adoption"}, {"score": 0.004562847483469705, "phrase": "significant_proliferation"}, {"score": 0.003863758357292741, "phrase": "teacher_decisions"}, {"score": 0.003770373393393271, "phrase": "relative_importance"}, {"score": 0.0034020946201397057, "phrase": "individual_it_adoption_literature"}, {"score": 0.0033361232750221863, "phrase": "blog_research_literature"}, {"score": 0.003303617297414837, "phrase": "knowledge_sharing_motivation"}, {"score": 0.002966230968271199, "phrase": "discriminant_analysis"}, {"score": 0.0027969169552385974, "phrase": "secondary_school_teachers'_decisions"}, {"score": 0.0026762874092443197, "phrase": "eight_factors"}, {"score": 0.0026115277372906805, "phrase": "codification_effort"}, {"score": 0.002276717177453959, "phrase": "research_results"}, {"score": 0.0022434880661725493, "phrase": "important_implications"}, {"score": 0.0021999341184897217, "phrase": "secondary_school_managers"}, {"score": 0.0021784745589727246, "phrase": "blog_services"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blog", " Secondary education", " Information technology adoption", " Innovation diffusion theory"], "paper_abstract": "Recently, there has been a significant proliferation in the number of teaching blogs: however, little has been explored about what motivates teachers to adopt teaching blogs. The purpose of this study is to find out which factors can significantly influence teacher decisions regarding their teaching blog adoption and the relative importance of these influences. This study extended Rogers' (1995) Innovation Diffusion Theory (IDT) that incorporates relevant factors from two sources: from within individual IT adoption literature and from within blog research literature emphasizing knowledge sharing motivation. The model includes four dimensions (which are individual, innovation technology, school and environmental characteristics) and 14 factors. A total of 325 valid questionnaires were obtained. Discriminant analysis was employed to test the hypotheses. The results revealed that secondary school teachers' decisions to adopt teaching blogs are strongly associated with eight factors: perceived enjoyment, codification effort, compatibility, perceived ease of use, personal innovativeness, enjoyment in helping others, school support and perceived usefulness, ordered by their relative importance. The research results also have important implications for researchers, secondary school managers and blog services providers. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Factors influencing secondary school teachers' adoption of teaching blogs", "paper_id": "WOS:000287343900003"}