{"auto_keywords": [{"score": 0.038715940575402084, "phrase": "faulty_peers"}, {"score": 0.0037658881407605445, "phrase": "reliable_protocol"}, {"score": 0.0035374012552316573, "phrase": "traditional_ba_protocols"}, {"score": 0.003474694300991964, "phrase": "fault_detection"}, {"score": 0.002905454531687249, "phrase": "previous_protocols"}, {"score": 0.00269263690712392, "phrase": "mobility_issue"}, {"score": 0.0026330549554033876, "phrase": "large_number"}, {"score": 0.0026095920086044145, "phrase": "message_results"}, {"score": 0.002574788013427524, "phrase": "large_protocol_overhead"}, {"score": 0.002473129577319634, "phrase": "new_fault_detection_protocol"}, {"score": 0.0023861329619604666, "phrase": "message_exchange"}], "paper_keywords": ["Peer-to-Peer", " P2P", " Fault Diagnosis", " Byzantine Agreement", " Fault-tolerance"], "paper_abstract": "To improve the performance of mobile P2P network systems, all the faulty-free peers must be able to function collaboratively. Regrettably, some peers may be untrustworthy and unwilling to cooperate with others. Some peers may even attack the network resulting in the performance degrades. For this reason, it is very important to provide a reliable protocol to detect and remove faulty peers. In the past, there have some traditional BA protocols been proposed for fault detection, in which all peers require to exchange 2 * (left perpendicular(n-1)/3right perpendicular + 1) rounds of message to collect messages; and the complexity of messages is O(n(left perpendicular(n-1)/3right perpendicular*left perpendicular(n-1)/3right perpendicular)). However, the previous protocols are inefficient and unsuitable for the mobile P2P network because most of the protocols do not concern the mobility issue, and can cause large number of message results in a large protocol overhead. In this study, we proposed a new fault detection protocol to detect/locate faulty peers by using only three rounds of message exchange. Furthermore, the complexity of protocol we proposed can be reduced to O(n(2)) even if some peers move around the network. Since, our proposed protocol is more suitable and efficient for mobile P2P network.", "paper_title": "A New Approach to the Fault Detection Problem for Mobile P2P Network", "paper_id": "WOS:000305933000006"}