{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chromatic_adaptation"}, {"score": 0.004762893197005439, "phrase": "rendered_images"}, {"score": 0.00456020621016909, "phrase": "automatic_colour_correction_operations"}, {"score": 0.004318881178805575, "phrase": "robust_technique"}, {"score": 0.004225950334493496, "phrase": "visible_and_pertinent_illumination"}, {"score": 0.003728966994353039, "phrase": "image_synthesis_process"}, {"score": 0.0036886073959526396, "phrase": "conventional_illuminant_estimations"}, {"score": 0.0034366728236876016, "phrase": "pure_image_analysis"}, {"score": 0.003032228032253871, "phrase": "light_sources"}, {"score": 0.002575167114383286, "phrase": "incident_light"}, {"score": 0.002284290601837099, "phrase": "difficult_cases"}, {"score": 0.002210814150677161, "phrase": "mixed_illuminants"}, {"score": 0.002128067018576581, "phrase": "varying_colour"}, {"score": 0.0021049977753042253, "phrase": "strongly_coloured_indirect_illumination"}], "paper_keywords": [""], "paper_abstract": "We propose a method that improves automatic colour correction operations for rendered images. In particular we propose a robust technique for estimating the visible and pertinent illumination in a given scene. We do this at very low computational cost by mostly re-using information that is already being computed during the image synthesis process. Conventional illuminant estimations either operate only on 2D image data, or if they do go beyond pure image analysis, only use information on the luminaires found in the scene. The latter is usually done with little or no regard for how the light sources actually affect the part of the scene that is being viewed. Our technique goes beyond that, and also takes object reflectance into account, as well as the incident light that is actually responsible for the colour of the objects that one sees. It is therefore able to cope with difficult cases, such as scenes with mixed illuminants, complex scenes with many light sources of varying colour or strongly coloured indirect illumination.", "paper_title": "A Robust Illumination Estimate for Chromatic Adaptation in Rendered Images", "paper_id": "WOS:000268218400009"}