{"auto_keywords": [{"score": 0.033577969716370615, "phrase": "hotlink_enhancement_problem"}, {"score": 0.011345264521914237, "phrase": "expected_number"}, {"score": 0.00481495049065317, "phrase": "human_interactions"}, {"score": 0.004779085953614184, "phrase": "web_directory_searches"}, {"score": 0.004518465090149296, "phrase": "yahoo"}, {"score": 0.0040997480534580065, "phrase": "tree_hierarchy_representation"}, {"score": 0.003761700847771486, "phrase": "index_tree"}, {"score": 0.0037336520904376687, "phrase": "additional_edges"}, {"score": 0.0036235254023315798, "phrase": "access_cost"}, {"score": 0.0033747739383101095, "phrase": "leaf_page"}, {"score": 0.0033370841436001597, "phrase": "tree_root"}, {"score": 0.0030049342542235466, "phrase": "first_exact_algorithm"}, {"score": 0.0029053368919259985, "phrase": "polynomial_time"}, {"score": 0.00286213454317036, "phrase": "logarithmic_depth"}, {"score": 0.0028090313440881937, "phrase": "real_data"}, {"score": 0.0027776422068966867, "phrase": "significant_improvement"}, {"score": 0.002473079487488344, "phrase": "czyzowicz_et_al"}, {"score": 0.002218404456227325, "phrase": "weight_distribution"}, {"score": 0.0021049977753042253, "phrase": "polynomial-time_algorithm"}], "paper_keywords": ["hotlink", " hotlist", " hyperlink", " directory tree", " algorithms"], "paper_abstract": "Consider a website containing a collection of webpages with data such as in Yahoo or the Open Directory project. Each page is associated with a weight representing the frequency with which that page is accessed by users. In the tree hierarchy representation, accessing each page requires the user to travel along the path leading to it from the root. By enhancing the index tree with additional edges (hotlinks) one may reduce the access cost of the system. In other words, the hotlinks reduce the expected number of steps needed to reach a leaf page from the tree root, assuming that the user knows which hotlinks to take. The hotlink enhancement problem involves finding a set of hotlinks minimizing this cost. This article proposes the first exact algorithm for the hotlink enhancement problem. This algorithm runs in polynomial time for trees with logarithmic depth. Experiments conducted with real data show that significant improvement in the expected number of accesses per search can be achieved in websites using this algorithm. These experiments also suggest that the simple and much faster heuristic proposed previously by Czyzowicz et al. [2003] creates hotlinks that are nearly optimal in the time savings they provide to the user. The version of the hotlink enhancement problem in which the weight distribution on the leaves is unknown is discussed as well. We present a polynomial-time algorithm that is optimal for any tree for any depth.", "paper_title": "Reducing human interactions in web directory searches", "paper_id": "WOS:000250408100005"}