{"auto_keywords": [{"score": 0.04242004746775429, "phrase": "dynamic_protection"}, {"score": 0.00481495049065317, "phrase": "survivable_network_design"}, {"score": 0.0047631192993526465, "phrase": "pre-cross-connected_trails"}, {"score": 0.0046276016230633495, "phrase": "\"pre-cross-connected_trails"}, {"score": 0.004495922204117959, "phrase": "fully_pre-connected_linear_structures"}, {"score": 0.0041677440361312604, "phrase": "pxt-based_restorable_networks"}, {"score": 0.003794297119656863, "phrase": "\"green_fields\"_planning_algorithm"}, {"score": 0.0034792431564692997, "phrase": "recent_work"}, {"score": 0.003416963042033614, "phrase": "resulting_pxt_structures"}, {"score": 0.0032484270911235526, "phrase": "capacity_efficiency"}, {"score": 0.003088178133049113, "phrase": "real_network"}, {"score": 0.0029785631356166594, "phrase": "semi-heuristic_approach"}, {"score": 0.0029464414592923196, "phrase": "integer_linear_programming_methods"}, {"score": 0.0029146651796243704, "phrase": "important_properties"}, {"score": 0.00260566789186855, "phrase": "incrementally_arriving_random_demands"}, {"score": 0.0023977287074829798, "phrase": "capacity_efficiencies"}, {"score": 0.002354762471810519, "phrase": "original_pxt_design_heuristic"}, {"score": 0.00232935232323113, "phrase": "notable_extra_finding"}, {"score": 0.002279349794239275, "phrase": "efficient_pxt_network_design"}, {"score": 0.0021050062395917817, "phrase": "america"}], "paper_keywords": [""], "paper_abstract": "Previous work developed the concept of \"pre-cross-connected trails\" (PXTs), which are fully pre-connected linear structures of spare capacity used to protect one or more paths end-to-end. To date, the only approach for designing PXT-based restorable networks is a heuristic algorithm suited for the dynamic protection of demands as they arrive in a network. The heuristic can also be used as a \"green fields\" planning algorithm for a known set of demands by running through the set and protecting them in order. In both cases, however, recent work has shown that the resulting PXT structures can be looping, as well as long and complex. While the capacity efficiency of the designs was high, the practicality of using such convoluted structures in any real network is doubtful. In this work we propose a semi-heuristic approach based on integer linear programming methods that allows important properties of the PXTs ( such as length and degree of looping) to be tightly controlled. We also show how this method may be adapted to the dynamic protection of incrementally arriving random demands. Results show that even when PXTs are restricted to be totally non-looping and of much lower maximum length, we still attain capacity efficiencies near those of the original PXT design heuristic. A notable extra finding is that, in an efficient PXT network design in general, many PXTs are equivalent to standalone 1+ 1 APS arrangements for certain demand flows. (c) 2007 Optical Society of America.", "paper_title": "Improved method for survivable network design based on pre-cross-connected trails", "paper_id": "WOS:000249043800012"}