{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multi-agent_systems"}, {"score": 0.047905977291456965, "phrase": "second-order_consensus"}, {"score": 0.04210105346727629, "phrase": "sampling_period"}, {"score": 0.015576048676418864, "phrase": "second-order_dynamics"}, {"score": 0.013383974224122564, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.012664754261604181, "phrase": "laplacian_matrix"}, {"score": 0.004367707617503722, "phrase": "distributed_linear_consensus_protocol"}, {"score": 0.00418892838079239, "phrase": "sampled_position_and_velocity_data"}, {"score": 0.003125835572347772, "phrase": "sufficiently_large_sampling_period"}, {"score": 0.002874870266177579, "phrase": "coupling_gains"}, {"score": 0.00269365253474335, "phrase": "consensus_regions"}, {"score": 0.002500456462028735, "phrase": "delayed_undirected_networks"}, {"score": 0.0024772998651215964, "phrase": "sampled_position"}, {"score": 0.0024543571925896073, "phrase": "velocity_data"}, {"score": 0.0023103100997344072, "phrase": "appropriate_sampling_period"}, {"score": 0.0021848422732893926, "phrase": "simulation_examples"}, {"score": 0.0021049977753042253, "phrase": "theoretical_analysis"}], "paper_keywords": ["Algebraic graph theory", " coupling gain", " consensus region", " multi-agent system", " second-order consensus", " sampling period"], "paper_abstract": "This paper studies second-order consensus in multi-agent systems with sampled position and velocity data. A distributed linear consensus protocol with second-order dynamics is first designed, where both sampled position and velocity data are utilized. A necessary and sufficient condition based on the sampling period, the coupling gains, and the spectra of the Laplacian matrix, is established for reaching consensus of the system in this setting. It is found that second-order consensus in such a multi-agent system can be achieved by appropriately choosing the sampling period determined by a polynomial with order three. In particular, second-order consensus cannot be reached for a sufficiently large sampling period while it can be reached for a sufficiently small one under some conditions. Then, the coupling gains are carefully designed under the given network structure and the sampling period. Furthermore, the consensus regions are characterized for the spectra of the Laplacian matrix. On the other hand, second-order consensus in delayed undirected networks with sampled position and velocity data is then discussed. A necessary and sufficient condition is also given, by which appropriate sampling period can be chosen to achieve consensus in multi-agent systems. Finally, simulation examples are given to verify and illustrate the theoretical analysis.", "paper_title": "Consensus in Multi-Agent Systems With Second-Order Dynamics and Sampled Data", "paper_id": "WOS:000326113700032"}