{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "electronic_systems"}, {"score": 0.004628101576367193, "phrase": "discrete-time_equations"}, {"score": 0.003421697038352743, "phrase": "discontinuous_pieewise-linear_discrete-time_dynamics"}, {"score": 0.003023047748772801, "phrase": "representative_electronic_systems"}, {"score": 0.0029055323737809825, "phrase": "important_electronic_circuit"}, {"score": 0.002834409847642238, "phrase": "central_example"}, {"score": 0.0027650234530228923, "phrase": "dynamical_behaviour"}, {"score": 0.0026839922027139967, "phrase": "related_circuits"}, {"score": 0.0025668646315794947, "phrase": "complex_forms"}, {"score": 0.00240662380079115, "phrase": "nonlinear_discrete-time_dynamics"}, {"score": 0.002278856202878812, "phrase": "brief_introduction"}, {"score": 0.002147180332779021, "phrase": "nonlinear_discrete-time_circuits"}, {"score": 0.0021049977753042253, "phrase": "discontinuous_piecewise-linear_nonlinearities"}], "paper_keywords": ["Circuits", " Dynamics"], "paper_abstract": "Purpose - Many important electronic systems are modelled by discrete-time equations with nonlinearities that are discontinuous and piecewise-linear, often arising as a result of quantization. Approximations based on linearization - the standard engineering response to nonlinearity are often quite unhelpful in these systems, because of the form of the nonlinearity. Certain methods and results have been developed over a number of years for the analysis of discontinuous pieewise-linear discrete-time dynamics. The aim of this tutorial paper is to review that body of knowledge, and to show how it can be applied to representative electronic systems. Design/methodology/approach - The paper uses an important electronic circuit the Sigma Delta modulator as a central example, and considers the dynamical behaviour exhibited by this circuit and related circuits. Findings - The circuits under investigation exhibit complex forms of behaviour that can be explained by the application of methods of nonlinear discrete-time dynamics. Originality/value - This paper is intended to provide a brief introduction to the body of research that exists into the behaviour of nonlinear discrete-time circuits and systems with discontinuous piecewise-linear nonlinearities.", "paper_title": "Discontinuous piecewise-linear discrete-time dynamics - maps with gaps in electronic systems", "paper_id": "WOS:000295345200014"}