{"auto_keywords": [{"score": 0.050078458624386674, "phrase": "internal_audit_department"}, {"score": 0.04847718921458406, "phrase": "taiwanese_firms"}, {"score": 0.025191786369706204, "phrase": "iad"}, {"score": 0.004768378525561471, "phrase": "erp_systems"}, {"score": 0.004222707054751191, "phrase": "enterprise_resource_planning"}, {"score": 0.0037392451233558234, "phrase": "company's_effectiveness"}, {"score": 0.003685067218455088, "phrase": "theoretical_framework"}, {"score": 0.003527181559366122, "phrase": "taiwanese_companies"}, {"score": 0.0034760655218366, "phrase": "mail_survey_procedures"}, {"score": 0.003376037544631762, "phrase": "key_internal_auditors"}, {"score": 0.0033271045779740683, "phrase": "erp_system"}, {"score": 0.003294875957676514, "phrase": "auditing_software"}, {"score": 0.0031690434364310435, "phrase": "iad's_effectiveness"}, {"score": 0.0021886732310288128, "phrase": "computer-assisted_auditing_techniques"}], "paper_keywords": ["internal audit", " enterprise resource planning (ERP)", " computer-assisted auditing techniques (CAATs)"], "paper_abstract": "In this study, the performance of the internal audit department (IAD) and its contribution to a company under enterprise resource planning (ERP) systems was examined. It is anticipated that this will provide insight into the factors perceived to be crucial to a company's effectiveness. A theoretical framework was developed and tested using the sample of Taiwanese companies. Using mail survey procedures, we elicited perceptions from key internal auditors about the ERP system and auditing software, as well as their opinions concerning the IAD's effectiveness and its contribution within a company. Data were analysed using the partial least square (PLS) regression to test the hypotheses. Drawing upon a sample of Taiwanese firms, the study suggests that a firm can improve the performance of the IAD through an enterprise-wide integrated, effective ERP system and appropriate auditing software. At the same time, the performance of the IAD can also contribute significantly to the company. The results also show that investments in computer-assisted auditing techniques (CAATs) are crucial due to their tremendous effectiveness in regard to the performance of the IAD and for the contributions CAATs can make to a company.", "paper_title": "Performance of the internal audit department under ERP systems: empirical evidence from Taiwanese firms", "paper_id": "WOS:000353775200004"}