{"auto_keywords": [{"score": 0.04707046420780691, "phrase": "constraint_satisfaction_techniques"}, {"score": 0.004636340567075841, "phrase": "important_advances"}, {"score": 0.004116823963855969, "phrase": "competing_goal_activities"}, {"score": 0.003964007795174772, "phrase": "complex_state-dependent_constraints"}, {"score": 0.003775803846431323, "phrase": "resource_allocation"}, {"score": 0.0037352048741373816, "phrase": "plan_synthesis_capabilities"}, {"score": 0.003407214479510987, "phrase": "special_issue"}, {"score": 0.003370565320453525, "phrase": "constraint_satisfaction_for_planning_and_scheduling_problems"}, {"score": 0.0030250067691601967, "phrase": "submitted_papers"}, {"score": 0.002944284514509205, "phrase": "extended_versions"}, {"score": 0.0028043588777213533, "phrase": "constraint_satisfaction_techniques_for_planning_and_scheduling_problems"}, {"score": 0.0027295084882654917, "phrase": "novel_advances"}, {"score": 0.0023712394008737958, "phrase": "complex_problems"}, {"score": 0.002295463032589125, "phrase": "constraint_satisfaction"}, {"score": 0.0021510820434023207, "phrase": "enormous_potential"}, {"score": 0.002127915423138391, "phrase": "practical_applications"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Planning", " Scheduling", " Constraint programming", " Search"], "paper_abstract": "The areas of planning and scheduling (from the Artificial Intelligence point of view) have seen important advances thanks to application of constraint satisfaction techniques. Currently, many important real-world problems require efficient constraint handling for planning, scheduling and resource allocation to competing goal activities over time in the presence of complex state-dependent constraints. Solutions to these problems require integration of resource allocation and plan synthesis capabilities. Hence to manage such complex problems planning, scheduling and constraint satisfaction must be interrelated. This special issue on Constraint Satisfaction for Planning and Scheduling Problems compiles a selection of papers dealing with various aspects of applying constraint satisfaction techniques in planning and scheduling. The core of submitted papers was formed by the extended versions of papers presented at COPLAS'2009: ICAPS 2009 Workshop on Constraint Satisfaction Techniques for Planning and Scheduling Problems. This issue presents novel advances on planning, scheduling, constraint programming/constraint satisfaction problems (CSPs) and many other common areas that exist among them. On the whole, this issue mainly focus on managing complex problems where planning, scheduling, constraint satisfaction and search must be combined and/or interrelated, which entails an enormous potential for practical applications and future research.", "paper_title": "Constraint satisfaction for planning and scheduling problems", "paper_id": "WOS:000291037200001"}