{"auto_keywords": [{"score": 0.04800762202716539, "phrase": "electronic_banking_services"}, {"score": 0.04769632635828977, "phrase": "virtual_travel_communities"}, {"score": 0.045422024392825375, "phrase": "online_services"}, {"score": 0.00481495049065317, "phrase": "ego_involvement"}, {"score": 0.004274650638302117, "phrase": "affective_commitment"}, {"score": 0.0041598882840506385, "phrase": "utilitarian_services"}, {"score": 0.0040619911719900976, "phrase": "partial_least_squares"}, {"score": 0.003966388754366831, "phrase": "research_model"}, {"score": 0.003807684498435389, "phrase": "visual_aesthetics"}, {"score": 0.003743439610143464, "phrase": "significant_effect"}, {"score": 0.0035571129372263532, "phrase": "important_quasi-moderator"}, {"score": 0.003509006038574667, "phrase": "web-based_relationships"}, {"score": 0.003334309053314909, "phrase": "highly-involved_users'_commitment"}, {"score": 0.003051790083321992, "phrase": "information_systems"}, {"score": 0.003031076391114969, "phrase": "wis"}, {"score": 0.0027273213556458214, "phrase": "aesthetics-usability-commitment_framework"}, {"score": 0.002690406375639144, "phrase": "long-term_viability"}, {"score": 0.0026002844796442818, "phrase": "utilitarian_and_hedonic_services"}, {"score": 0.0025131738347596586, "phrase": "account_ego-involvement"}, {"score": 0.002487612781045517, "phrase": "site's_intended_purpose"}, {"score": 0.0023717148226629105, "phrase": "web_atmosphere"}, {"score": 0.002339601774631419, "phrase": "utilitarian_online_services"}, {"score": 0.0021049977753042253, "phrase": "utilitarian_and_hedonic_benefits"}], "paper_keywords": ["Worldwide web", " Information systems", " Services", " Design and development"], "paper_abstract": "Purpose - This study aims to investigate how ego-involvement and the design of online services may be associated with affective commitment, making the distinction between hedonic and utilitarian services. Design/methodology/approach - This research uses partial least squares to estimate the parameters of the research model. Findings - This research reaches four conclusions. First, that visual aesthetics and usability have a significant effect on the desire to continue using online services. Second, that ego-involvement becomes an important quasi-moderator when engaging in web-based relationships. Third, that perceptions of aesthetics (and usability) more significantly influence highly-involved users' commitment to hedonic (utilitarian) online services than their commitment to instrumental (hedonic) services. Fourth, the influences of aesthetics on usability reflect the benefits that web information systems (WIS) offer. Research limitations/implications - The model does not include all the relevant variables. Additional studies are required to validate these results. Practical implications - This study serves to enhance the aesthetics-usability-commitment framework to assess the long-term viability of online services, and to appraise its validity via utilitarian and hedonic services. Designers could customise the WIS by taking into account ego-involvement and the site's intended purpose. Originality/value - A review of the relationships between commitment, involvement and web atmosphere concerning hedonic and utilitarian online services reveals that there are still very few studies that analyse their quasi-moderating effects. This research will help to fill this gap, by analysing the examples of electronic banking services and virtual travel communities to represent the utilitarian and hedonic benefits respectively.", "paper_title": "The interaction effects of ego involvement on the relationships between aesthetics, usability and commitment An application to electronic banking services and virtual travel communities", "paper_id": "WOS:000291177000002"}