{"auto_keywords": [{"score": 0.028818583867887944, "phrase": "context-aware_functionality"}, {"score": 0.00481495049065317, "phrase": "tourist_guides"}, {"score": 0.004664352260912174, "phrase": "aware_feedback"}, {"score": 0.004377077848734575, "phrase": "potential_importance"}, {"score": 0.0041827333568982055, "phrase": "usability_perspective"}, {"score": 0.004088807948906792, "phrase": "brunel_university"}, {"score": 0.004015182362035361, "phrase": "context-aware_user_feedback"}, {"score": 0.0038895008852940323, "phrase": "empirical_study"}, {"score": 0.0034560481756572632, "phrase": "participant_feedback"}, {"score": 0.003141364320497748, "phrase": "real-time_feedback"}, {"score": 0.0030847461428168614, "phrase": "user_location"}, {"score": 0.0025833500717948343, "phrase": "participant_assimilated_front"}, {"score": 0.002423931101340771, "phrase": "context-aware_feedback"}, {"score": 0.0023802126605244438, "phrase": "average_experiment_duration"}, {"score": 0.0022434880661725493, "phrase": "participants'_subjective_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "non-context_aware_application"}], "paper_keywords": ["Context-aware", " Tour Guide", " user", " perception"], "paper_abstract": "Although examples of tourist guides abound, the role of context aware feedback in such systems is an issue that has been insufficiently explored. Given the potential importance of such feedback, this paper investigates, from a usability perspective, two tour guide systems developed for Brunel University: one with context-aware user feedback and the other without. An empirical study was undertaken in which each of the applications was assessed through the prism of three usability measurements: efficiency, effectiveness, and satisfaction. Incorporating the participant feedback gathered as a result, the paper compares the use of the two applications in order to determine the impact of real-time feedback with respect to user location. Efficiency, understood as the time taken by a participant to successfully complete a task, was found to be significantly affected by the use of context-aware functionality. Effectiveness, understood as the amount of information a Participant assimilated front the application, was shown not to be impacted by the provision of context-aware Feedback, even though average experiment duration was found to be significantly shorter in this case. Lastly, participants' subjective satisfaction when using context-aware functionality was shown to be significantly higher than when using the non-context aware application.", "paper_title": "A context-aware Tour Guide: User implications", "paper_id": "WOS:000205769600002"}