{"auto_keywords": [{"score": 0.009033890043216364, "phrase": "different_performance"}, {"score": 0.008588801233516477, "phrase": "dynamic_programming_algorithm"}, {"score": 0.00481495049065317, "phrase": "highly-threaded_many-core_architectures"}, {"score": 0.004660453113061494, "phrase": "many-core_architectures"}, {"score": 0.004626796109657584, "phrase": "memory-access_latency"}, {"score": 0.0045933810497156705, "phrase": "low-overhead_context_switching"}, {"score": 0.003916098498242888, "phrase": "pram_analysis"}, {"score": 0.003589602322126282, "phrase": "algorithmic_limits"}, {"score": 0.0034742854447532678, "phrase": "threaded_many-core_memory"}, {"score": 0.003338344648070587, "phrase": "important_characteristics"}, {"score": 0.0032310733124059536, "phrase": "important_machine_parameters"}, {"score": 0.003037738818185027, "phrase": "pram"}, {"score": 0.0029294420752976947, "phrase": "pairs_shortest_paths_problem"}, {"score": 0.002704554429386671, "phrase": "machine_parameters"}, {"score": 0.002646267286675984, "phrase": "dense_graphs"}, {"score": 0.002598652897946253, "phrase": "johnson's_algorithm"}, {"score": 0.002542642270762272, "phrase": "pram_model"}, {"score": 0.002469830206270585, "phrase": "large_enough_memory-access_latency"}, {"score": 0.0022884433286785165, "phrase": "empirical_measurements"}, {"score": 0.0022068108547826063, "phrase": "nvidia"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["PRAM", " TMM", " All Pairs Shortest Paths (APSP)", " Highly-threaded many-core", " Memory access model"], "paper_abstract": "A number of highly-threaded, many-core architectures hide memory-access latency by low-overhead context switching among a large number of threads. The speedup of a program on these machines depends on how well the latency is hidden. If the number of threads were infinite, theoretically, these machines could provide the performance predicted by the PRAM analysis of these programs. However, the number of threads per processor is not infinite, and is constrained by both hardware and algorithmic limits. In this paper, we introduce the Threaded Many-core Memory (TMM) model which is meant to capture the important characteristics of these highly-threaded, many-core machines. Since we model some important machine parameters of these machines, we expect analysis under this model to provide a more fine-grained and accurate performance prediction than the PRAM analysis. We analyze 4 algorithms for the classic all pairs shortest paths problem under this model. We find that even when two algorithms have the same PRAM performance, our model predicts different performance for some settings of machine parameters. For example, for dense graphs, the dynamic programming algorithm and Johnson's algorithm have the same performance in the PRAM model. However, our model predicts different performance for large enough memory-access latency and validates the intuition that the dynamic programming algorithm performs better on these machines. We validate several predictions made by our model using empirical measurements on an instantiation of a highly-threaded, many-core machine, namely the NVIDIA GTX 480. (C) 2013 The Authors. Published by Elsevier B.V. All rights reserved.", "paper_title": "A memory access model for highly-threaded many-core architectures", "paper_id": "WOS:000329007500024"}