{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "limited_information"}, {"score": 0.004779117185951807, "phrase": "mpp"}, {"score": 0.004468037801239238, "phrase": "different_authorities"}, {"score": 0.004287961675700099, "phrase": "different_geographical_areas"}, {"score": 0.004084440052083978, "phrase": "path_computation_element_concept"}, {"score": 0.003949204622915113, "phrase": "controlled_optical_borne_networks"}, {"score": 0.003905124669323623, "phrase": "routing_decisions"}, {"score": 0.003876010646939676, "phrase": "interdomain_connections"}, {"score": 0.0038327445210488355, "phrase": "account_traffic_engineering"}, {"score": 0.003637112258469488, "phrase": "protection_shareability"}, {"score": 0.003583067515485422, "phrase": "dedicated_protection"}, {"score": 0.0033747739383101095, "phrase": "disjoint_paths"}, {"score": 0.003299813878412728, "phrase": "network_resource_usage"}, {"score": 0.0032507647824680684, "phrase": "protection_resources"}, {"score": 0.0030162086479223506, "phrase": "exact_working_and_protection_path_pairs"}, {"score": 0.0028301536956600137, "phrase": "full_topology"}, {"score": 0.0028090313440881937, "phrase": "link-state_information"}, {"score": 0.0027466028572379455, "phrase": "working_and_protection_paths"}, {"score": 0.0026357223464279983, "phrase": "domain_boundaries"}, {"score": 0.0022688546528208133, "phrase": "multidomain_p-cycles"}, {"score": 0.0022434880661725493, "phrase": "multidomain_multipath_routing"}, {"score": 0.0021049977753042253, "phrase": "resource_requirement"}], "paper_keywords": [""], "paper_abstract": "The Internet consists of a collection of more than 21,000 domains called autonomous systems operated mostly under different authorities ( operators providers) that, although they cooperate over different geographical areas, compete in a country or other area. Recently, the path computation element concept has been proposed to generalized multiprotocol label switching controlled optical borne networks to make routing decisions for interdomain connections taking into account traffic engineering, quality of service, and resilience considerations. Still the question of protection shareability emerges. For dedicated protection it is enough to know the topology of the network to be able to calculate disjoint paths. However, to reduce network resource usage by sharing of protection resources ( e. g., end-to-end shared protection) it is also mandatory to know the exact working and protection path pairs for all the demands. This can be checked within a domain where not only the full topology and link-state information is flooded but also the working and protection paths are known for each connection; however; over the domain boundaries for security and scalability reasons no such information is being spread. We propose using two techniques that do not require flooding the information on working and protection paths while still allowing the sharing of resources. These two techniques are the multidomain p-cycles and the multidomain multipath routing with protection. After explaining the principles of these methods we evaluate the trade-off between the resource requirement and availability of these techniques by simulations. (C) 2008 Optical Society of America.", "paper_title": "Multidomain shared protection with limited information via MPP and p-cycles", "paper_id": "WOS:000255731300003"}