{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-server_architecture"}, {"score": 0.011257899798082912, "phrase": "user's_anonymity"}, {"score": 0.011157903228650607, "phrase": "mutual_authentication"}, {"score": 0.010069208369916614, "phrase": "'s_protocol"}, {"score": 0.004541918674719973, "phrase": "numerous_different_network_services"}, {"score": 0.004133055661437163, "phrase": "different_identities"}, {"score": 0.0037272031155266556, "phrase": "hsiang_and_shih's_multi-server_authentication_protocol"}, {"score": 0.003361069456060196, "phrase": "session_key_agreement"}, {"score": 0.003198860258228543, "phrase": "careful_analysis"}, {"score": 0.002820319063320601, "phrase": "control_server"}, {"score": 0.0027575842698911173, "phrase": "real_identity"}, {"score": 0.002600911496042859, "phrase": "sood"}, {"score": 0.00247529638625566, "phrase": "efficient_and_security_dynamic_identity"}, {"score": 0.0023770362063833903, "phrase": "aforementioned_weaknesses"}, {"score": 0.0023451553255837317, "phrase": "proposed_protocol"}, {"score": 0.002272415777234064, "phrase": "distributed_multi-server_architecture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authentication", " Dynamic identity", " Smart card", " Password", " Multi-server architecture"], "paper_abstract": "Generally, if a user wants to use numerous different network services, he/she must register himself/herself to every service providing server. It is extremely hard for users to remember these different identities and passwords. In order to resolve this problem, various multi-server authentication protocols have been proposed. Recently, Sood et al. analyzed Hsiang and Shih's multi-server authentication protocol and proposed an improved dynamic identity based authentication protocol for multi-server architecture. They claimed that their protocol provides user's anonymity, mutual authentication, the session key agreement and can resist several kinds of attacks. However, through careful analysis, we find that Sood et al.'s protocol is still vulnerable to leak-of-verifier attack, stolen smart card attack and impersonation attack. Besides, since there is no way for the control server CS to know the real identity of the user, the authentication and session key agreement phase of Sood et al.'s protocol is incorrect. We propose an efficient and security dynamic identity based authentication protocol for multi-server architecture that removes the aforementioned weaknesses. The proposed protocol is extremely suitable for use in distributed multi-server architecture since it provides user's anonymity, mutual authentication, efficient, and security. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An efficient and security dynamic identity based authentication protocol for multi-server architecture using smart cards", "paper_id": "WOS:000300862900023"}