{"auto_keywords": [{"score": 0.029075000270154094, "phrase": "choquet"}, {"score": 0.00481495049065317, "phrase": "fuzzy_measures"}, {"score": 0.004771435352180973, "phrase": "multi-criteria_aggregation"}, {"score": 0.0046221918332842995, "phrase": "monotonic_set_measures"}, {"score": 0.0046063609652095714, "phrase": "sugeno"}, {"score": 0.003942877273973905, "phrase": "complex_importance_relationships"}, {"score": 0.003907212558276185, "phrase": "multi-criteria_decision-making"}, {"score": 0.003584025547693833, "phrase": "considerable_detail"}, {"score": 0.003503497128638099, "phrase": "quasi-additive_measures"}, {"score": 0.0031556799865964974, "phrase": "individual_criteria"}, {"score": 0.0031129269142224194, "phrase": "decision_alternative"}, {"score": 0.0030429511467945525, "phrase": "required_properties"}, {"score": 0.0028813415821988156, "phrase": "criteria_satisfaction"}, {"score": 0.0023694065215394593, "phrase": "greater_aggregated_satisfaction"}, {"score": 0.0021632743048552536, "phrase": "attitudinal_character"}], "paper_keywords": ["Multi-criteria decision", " Measure", " Importance", " Aggregation", " Monotonicity"], "paper_abstract": "We introduce the concept of monotonic set measures, and provide an ordering over these measures which allows us to describe one measure as being bigger or more generous than another. We discuss the use of these measures for the representation of complex importance relationships in multi-criteria decision-making and consider the use of additive, possibilistic and cardinality-based measures. We then look in considerable detail at the use of quasi-additive measures for representing criteria importance relationships. We discuss the problem of using the information about criteria importance to aggregate the satisfaction to individual criteria by a decision alternative. We note some required properties of such an aggregation, including a property on monotonicity with respect to criteria satisfaction. We introduce three approaches for performing this aggregation, the Choquet integral, the Sugeno integral and the median. We next consider another requirement of this aggregation, consistency with respect to measure monotonicity, which requires that bigger, more generous measures, have greater aggregated satisfaction. We look at the three methods of aggregation with regard to this property. We introduce the idea of attitudinal character of a measure and show its relationship to the ordering of measures.", "paper_title": "On the consistency of fuzzy measures in multi-criteria aggregation", "paper_id": "WOS:000354288600001"}