{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "contextual_information"}, {"score": 0.0076477397850320565, "phrase": "text_clustering"}, {"score": 0.004147756103284082, "phrase": "relevant_data"}, {"score": 0.0040978781692373005, "phrase": "non_relevant_one"}, {"score": 0.003999907278478564, "phrase": "textual_information"}, {"score": 0.003749908582313067, "phrase": "subject_matter"}, {"score": 0.003473178781851477, "phrase": "non-relevant_words"}, {"score": 0.0033764382987428497, "phrase": "relevant_ones"}, {"score": 0.0031020367403802773, "phrase": "relevant_information"}, {"score": 0.002838387600282891, "phrase": "textual_data"}, {"score": 0.0027704444816096484, "phrase": "compression_scenario"}, {"score": 0.002682370021834353, "phrase": "distortion_technique"}, {"score": 0.0025761937402886954, "phrase": "main_characteristics"}, {"score": 0.0023287359930308864, "phrase": "different_ways"}, {"score": 0.002300681752315682, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Contextual information", " Word removal", " Compression-based text clustering"], "paper_abstract": "Usually, when analyzing data that have not been processed or filtered yet, it can be observed that not all the data have equal importance. Thus, it is common to find relevant data surrounded by non relevant one. This occurs when analyzing textual information due to its intrinsic nature: texts contain words that provide a lot of information about the subject matter, whereas they contain other words with a little meaning or relevance. We believe that although in principle the non-relevant words are not as important as the relevant ones, the former constitute the substrate that supports the last. Since this substrate is the context that surrounds the relevant information, we call it the contextual information. In this paper, we analyze the relevance that the contextual information has in textual data, in a clustering by compression scenario. We generate the contextual information applying a distortion technique previously developed by the authors. One of the main characteristics of this technique is that it maintains the contextual information. In this paper we compare this technique with three new distortion techniques that destroy the contextual information in different ways. The experimental results support our hypothesis that the contextual information is relevant at least in the area of text clustering by compression. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Is the contextual information relevant in text clustering by compression?", "paper_id": "WOS:000303281800004"}