{"auto_keywords": [{"score": 0.048398179269243564, "phrase": "state_machines"}, {"score": 0.00481495049065317, "phrase": "state-based_software_models"}, {"score": 0.00458412183693466, "phrase": "sequential_behavior"}, {"score": 0.004543352284098364, "phrase": "software_systems"}, {"score": 0.004364310576600359, "phrase": "powerful_verification"}, {"score": 0.004229927464182562, "phrase": "important_part"}, {"score": 0.004173603566828364, "phrase": "model-driven_software_engineering_process"}, {"score": 0.0037157201349604222, "phrase": "state_machine_inference_techniques"}, {"score": 0.0035851703423654432, "phrase": "reverse-engineered_model"}, {"score": 0.003293142761521425, "phrase": "-_the_externally_observable_sequences"}, {"score": 0.0030248298759040695, "phrase": "actual_states"}, {"score": 0.0026095920086044145, "phrase": "existing_binary_classification_performance_measures"}, {"score": 0.002322895056238477, "phrase": "case_study"}, {"score": 0.0021239335561699106, "phrase": "large_collection"}, {"score": 0.0021049977753042253, "phrase": "randomly_synthesized_models"}], "paper_keywords": ["Documentation", " Algorithms", " Measurement", " Labeled transition systems", " accuracy", " comparison"], "paper_abstract": "State machines capture the sequential behavior of software systems. Their intuitive visual notation, along with a range of powerful verification and testing techniques render them an important part of the model-driven software engineering process. There are several situations that require the ability to identify and quantify the differences between two state machines (e. g. to evaluate the accuracy of state machine inference techniques is measured by the similarity of a reverse-engineered model to its reference model). State machines can be compared from two complementary perspectives: (1) In terms of their language - the externally observable sequences of events that are permitted or not, and (2) in terms of their structure - the actual states and transitions that govern the behavior. This article describes two techniques to compare models in terms of these two perspectives. It shows how the difference can be quantified and measured by adapting existing binary classification performance measures for the purpose. The approaches have been implemented by the authors, and the implementation is openly available. Feasibility is demonstrated via a case study to compare two real state machine inference approaches. Scalability and accuracy are assessed experimentally with respect to a large collection of randomly synthesized models.", "paper_title": "Automated Comparison of State-Based Software Models in Terms of Their Language and Structure", "paper_id": "WOS:000322480600004"}