{"auto_keywords": [{"score": 0.0034630606658026595, "phrase": "ieee_ices_emf_database"}, {"score": 0.0031315358193567708, "phrase": "greatest_number"}, {"score": 0.003028215198111833, "phrase": "bioelectromagnetics"}, {"score": 0.0029447150254434842, "phrase": "cited_articles"}, {"score": 0.0028795712616923462, "phrase": "radiation_risk"}, {"score": 0.002847540262784593, "phrase": "biological_effects"}, {"score": 0.002707741309851526, "phrase": "highest_number"}, {"score": 0.0026478260192958924, "phrase": "epidemiology_journals"}, {"score": 0.0023941575109692336, "phrase": "co-authored_publications"}, {"score": 0.0023151088048303705, "phrase": "collaborative_network"}, {"score": 0.002189105604712615, "phrase": "international_collaboration"}], "paper_keywords": ["Electromagnetic fields (EMF)", " Research performance", " Bibliometrics", " Authorship pattern"], "paper_abstract": "This paper describes a study investigating the performance of Electromagnetic Fields (EMF) research work using bibliometric analysis covering the period 2003-2013. The study focuses on the distribution and growth of publications across journals, titles, and fields over the period, and collaboration network patterns among scholars and scientists. A total of 1737 articles were gathered from the IEEE ICES EMF Database. Among these, a 29,047 citation count was reported from 432 journal titles. The most cited journal title and the one with greatest number of publications was the journal Bioelectromagnetics. Most of the cited articles focused mainly on radiation risk and biological effects of EMF. The fields of Engineering & Physics produced the highest number of articles while Epidemiology journals showed the most outstanding performance across all fields. 95 % (1651) of the articles were identified as co-authored publications, indicating involvement in a collaborative network. Only 20 % (341) of the publications involved international collaboration, the majority of these among European-European and Europe-North American countries/regions.", "paper_title": "Evaluating the performance of electromagnetic fields (EMF) research work (2003-2013)", "paper_id": "WOS:000361992800017"}