{"auto_keywords": [{"score": 0.030311084376533765, "phrase": "user_experience"}, {"score": 0.00481495049065317, "phrase": "bibliographic_records"}, {"score": 0.004529093447865156, "phrase": "functional_requirements"}, {"score": 0.003946195919158241, "phrase": "existing_prototypes"}, {"score": 0.0037259623657693794, "phrase": "librarylabs"}, {"score": 0.003613556291453534, "phrase": "findings_-_fictionfinder"}, {"score": 0.0034512514926836667, "phrase": "librarylabs_prototype"}, {"score": 0.0034118234596993836, "phrase": "frbr-like_structure"}, {"score": 0.003334309053314909, "phrase": "larger_group"}, {"score": 0.0032090000236091707, "phrase": "frbr"}, {"score": 0.0031240868074933078, "phrase": "current_cataloguing_practice"}, {"score": 0.0029951555610569225, "phrase": "practical_shortcomings"}, {"score": 0.0027215202678634517, "phrase": "whole_population"}, {"score": 0.002700738055025905, "phrase": "frbr-based_implementations"}, {"score": 0.0026596472456182707, "phrase": "technical_aspects"}, {"score": 0.002520678372430923, "phrase": "full_priority"}, {"score": 0.0024633601573822114, "phrase": "identified_problems"}, {"score": 0.0022125996721544514, "phrase": "rare_published_independent_evaluation"}, {"score": 0.0021049977753042253, "phrase": "current_frbr_implementation"}], "paper_keywords": ["bibliographic standards", " cataloguing", " prototypes", " function evaluation"], "paper_abstract": "Purpose - This paper aims to establish how the Functional Requirements for Bibliographic Records (FRBR) conceptual model, which holds a lot of potential in theory, works in practice. It also aims to identify, and if possible, give solutions to problems found in two of the existing prototypes. Design/methodology/approach - An independent evaluation and comparison of two of the most recent FRBR-based prototypes, OCLC FictionFinder and the LibraryLabs, was carried out in January 2007. Findings - FictionFinder focuses almost exclusively on the concept of work, while the LibraryLabs prototype applies an FRBR-like structure only as part of a larger group of experiments. Neither of the prototypes fully follows FRBR, owing to issues associated with current cataloguing practice and the model itself. These barriers also cause some practical shortcomings for these prototypes, however new results displays clearly enhance the user experience. Research limitations/implications - The prototypes may not be representative of the whole population of FRBR-based implementations. Also, technical aspects of the implementations were not taken into account, as user experience was given full priority. Practical implications - The identified problems and any given solutions should help not only the authors of the two prototypes, but also other researches in the field. Originality/value - This paper offers a rare published independent evaluation of two FRBR-based prototypes, giving pointers towards improvement and establishing the position of current FRBR implementation relative to what is expected in the future.", "paper_title": "Functional requirements for bibliographic records: An investigation of two prototypes", "paper_id": "WOS:000250603000006"}