{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "anaphoric_ambiguity"}, {"score": 0.01027668536686688, "phrase": "natural_language"}, {"score": 0.010203709003803059, "phrase": "nl"}, {"score": 0.0047804843375940835, "phrase": "natural_language_requirements"}, {"score": 0.004385555408850022, "phrase": "unwanted_ambiguities"}, {"score": 0.004140490129683107, "phrase": "automated_approach"}, {"score": 0.004096082254543022, "phrase": "potentially_nocuous_ambiguity"}, {"score": 0.003951453722517865, "phrase": "different_readers"}, {"score": 0.0034220655476652683, "phrase": "particular_interpretation"}, {"score": 0.003161674440750158, "phrase": "particular_interpretations"}, {"score": 0.0030941521409613417, "phrase": "multiple_human_judgements"}, {"score": 0.00284837132359445, "phrase": "particular_instance"}, {"score": 0.0027675275077806744, "phrase": "requirements_document"}, {"score": 0.0025752890978323873, "phrase": "requirements_writer"}, {"score": 0.0023451553255837317, "phrase": "automated_system"}, {"score": 0.0022298571016688335, "phrase": "high_recall"}, {"score": 0.0022058958906038466, "phrase": "consistent_improvement"}, {"score": 0.002190064650401852, "phrase": "baseline_precision_subject"}, {"score": 0.002166530105679438, "phrase": "ambiguity_tolerance_levels"}, {"score": 0.0021049977753042253, "phrase": "realistic_and_potentially_problematic_ambiguities"}], "paper_keywords": ["Nocuous ambiguity", " Natural language requirements", " Anaphoric ambiguity", " Noun-phrase coreference resolution", " Antecedent preference heuristics", " Human judgements", " Machine learning"], "paper_abstract": "Many requirements documents are written in natural language (NL). However, with the flexibility of NL comes the risk of introducing unwanted ambiguities in the requirements and misunderstandings between stakeholders. In this paper, we describe an automated approach to identify potentially nocuous ambiguity, which occurs when text is interpreted differently by different readers. We concentrate on anaphoric ambiguity, which occurs when readers may disagree on how pronouns should be interpreted. We describe a number of heuristics, each of which captures information that may lead a reader to favor a particular interpretation of the text. We use these heuristics to build a classifier, which in turn predicts the degree to which particular interpretations are preferred. We collected multiple human judgements on the interpretation of requirements exhibiting anaphoric ambiguity and showed how the distribution of these judgements can be used to assess whether a particular instance of ambiguity is nocuous. Given a requirements document written in natural language, our approach can identify sentences that contain anaphoric ambiguity, and use the classifier to alert the requirements writer of text that runs the risk of misinterpretation. We report on a series of experiments that we conducted to evaluate the performance of the automated system we developed to support our approach. The results show that the system achieves high recall with a consistent improvement on baseline precision subject to some ambiguity tolerance levels, allowing us to explore and highlight realistic and potentially problematic ambiguities in actual requirements documents.", "paper_title": "Analysing anaphoric ambiguity in natural language requirements", "paper_id": "WOS:000293858900002"}