{"auto_keywords": [{"score": 0.03447491429759028, "phrase": "cads"}, {"score": 0.015589162827009694, "phrase": "collaborative_information_systems"}, {"score": 0.014401180676414984, "phrase": "insider_threats"}, {"score": 0.012184231060160514, "phrase": "access_logs"}, {"score": 0.011395008911380462, "phrase": "community_structures"}, {"score": 0.00481495049065317, "phrase": "anomalous_insiders"}, {"score": 0.004577440795549049, "phrase": "diverse_array"}, {"score": 0.004481954307639453, "phrase": "sensitive_information"}, {"score": 0.004444317282171449, "phrase": "current_security_mechanisms"}, {"score": 0.0041194351307673556, "phrase": "dynamic_teams"}, {"score": 0.003965975628742746, "phrase": "community_anomaly_detection_system"}, {"score": 0.0036914757355166966, "phrase": "collaborative_environments"}, {"score": 0.0035389348527719404, "phrase": "typical_cis_users"}, {"score": 0.0033078284621762817, "phrase": "healthcare_providers"}, {"score": 0.0030399874838260886, "phrase": "anomaly_prediction"}, {"score": 0.0029764767329116875, "phrase": "statistical_model"}, {"score": 0.0023003498123420237, "phrase": "significant_performance_gains"}, {"score": 0.0021682027434117095, "phrase": "illicit_users"}, {"score": 0.0021049977753042253, "phrase": "best_model"}], "paper_keywords": ["Privacy", " social network analysis", " data mining", " insider threat detection"], "paper_abstract": "Collaborative information systems (CISs) are deployed within a diverse array of environments that manage sensitive information. Current security mechanisms detect insider threats, but they are ill-suited to monitor systems in which users function in dynamic teams. In this paper, we introduce the community anomaly detection system (CADS), an unsupervised learning framework to detect insider threats based on the access logs of collaborative environments. The framework is based on the observation that typical CIS users tend to form community structures based on the subjects accessed (e. g., patients' records viewed by healthcare providers). CADS consists of two components: 1) relational pattern extraction, which derives community structures and 2) anomaly prediction, which leverages a statistical model to determine when users have sufficiently deviated from communities. We further extend CADS into MetaCADS to account for the semantics of subjects (e. g., patients' diagnoses). To empirically evaluate the framework, we perform an assessment with three months of access logs from a real electronic health record (EHR) system in a large medical center. The results illustrate our models exhibit significant performance gains over state-of-the-art competitors. When the number of illicit users is low, MetaCADS is the best model, but as the number grows, commonly accessed semantics lead to hiding in a crowd, such that CADS is more prudent.", "paper_title": "Detecting Anomalous Insiders in Collaborative Information Systems", "paper_id": "WOS:000301233900003"}