{"auto_keywords": [{"score": 0.04159267344622788, "phrase": "communication_range"}, {"score": 0.025934223809664796, "phrase": "network_connection_probability"}, {"score": 0.024551554878824565, "phrase": "distribution_parameters"}, {"score": 0.004753194996637899, "phrase": "probabilistic_approach"}, {"score": 0.004712463245074863, "phrase": "wireless_sensor_networks"}, {"score": 0.004123781267600542, "phrase": "limited_communication_range"}, {"score": 0.003486123304074186, "phrase": "random_variable"}, {"score": 0.003426556090707852, "phrase": "former_case"}, {"score": 0.002555950807368337, "phrase": "nodes_failure"}, {"score": 0.0025122373359090454, "phrase": "latter_case"}, {"score": 0.0023958326775913165, "phrase": "cox_process"}, {"score": 0.0022848092812445533, "phrase": "resilience_performance"}, {"score": 0.0021601997088758957, "phrase": "node_communication_range"}], "paper_keywords": [""], "paper_abstract": "Wireless sensor networks (WSNs) consist of thousands of nodes that need to communicate with each other. However, it is possible that some nodes are isolated from other nodes due to limited communication range. This paper focuses on the influence of communication range on the probability that all nodes are connected under two conditions, respectively: (1) all nodes have the same communication range, and (2) communication range of each node is a random variable. In the former case, this work proves that, for 0 < epsilon < e (1), if the probability of the network being connected is 0.36 epsilon, by means of increasing communication range by constant C(epsilon), the probability of network being connected is at least 1-epsilon. Explicit function C(epsilon) is given. It turns out that, once the network is connected, it also makes the WSNs resilient against nodes failure. In the latter case, this paper proposes that the network connection probability is modeled as Cox process. The change of network connection probability with respect to distribution parameters and resilience performance is presented. Finally, a method to decide the distribution parameters of node communication range in order to satisfy a given network connection probability is developed.", "paper_title": "The Influence of Communication Range on Connectivity for Resilient Wireless Sensor Networks Using a Probabilistic Approach", "paper_id": "WOS:000324700400001"}