{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service-oriented_systems"}, {"score": 0.004490552331642995, "phrase": "service-oriented_architecture_style"}, {"score": 0.004301834610818624, "phrase": "loosely_coupled_systems"}, {"score": 0.004255902303152008, "phrase": "organizational_boundaries"}, {"score": 0.0039055990919333082, "phrase": "improved_understanding"}, {"score": 0.0037213333316218522, "phrase": "autonomic_runtime_configuration"}, {"score": 0.0036815763368083197, "phrase": "application_deployment"}, {"score": 0.003451766520526601, "phrase": "service_systems"}, {"score": 0.003342280102112269, "phrase": "literature_survey"}, {"score": 0.003306559295382181, "phrase": "simulation_frameworks"}, {"score": 0.0032189132350239013, "phrase": "simulation_software"}, {"score": 0.0025822818714499795, "phrase": "services-aware_simulation_framework"}, {"score": 0.0022818671653408278, "phrase": "unique_features"}], "paper_keywords": ["Simulation", " web services", " SOA", " survey"], "paper_abstract": "The service-oriented architecture style supports desirable qualities, including distributed, loosely coupled systems spanning organizational boundaries. Such systems and their configurations are challenging to understand, reason about, and test. Improved understanding of these systems will support activities such as autonomic runtime configuration, application deployment, and development/testing. Simulation is one way to understand and test service systems. This paper describes a literature survey of simulation frameworks for service-oriented systems, examining simulation software, systems, approaches, and frameworks used to simulate service-oriented systems. We identify a set of dimensions for describing the various approaches, considering their modeling methodology, their functionalities, their underlying infrastructure, and their evaluation. We then introduce the services-aware simulation framework (SASF), a simulation framework for predicting the behavior of service-oriented systems under different configurations and loads, and discuss the unique features that distinguish it from other systems in the literature. We demonstrate its use in simulating two service-oriented systems.", "paper_title": "Simulating Service-Oriented Systems: A Survey and the Services-Aware Simulation Framework", "paper_id": "WOS:000330615100002"}