{"auto_keywords": [{"score": 0.040179907029343674, "phrase": "user_privacy"}, {"score": 0.00481495049065317, "phrase": "vehicular_networks"}, {"score": 0.0047709540557306284, "phrase": "anonymous_beaconing"}, {"score": 0.004662705558154439, "phrase": "vehicular_networking_applications"}, {"score": 0.004620093797504386, "phrase": "continuous_knowledge"}, {"score": 0.0035072146967082083, "phrase": "positioning_information"}, {"score": 0.003349670229755675, "phrase": "potentially_misbehaving_cars"}, {"score": 0.0032585499655442404, "phrase": "public_disclosure"}, {"score": 0.0027361626349903744, "phrase": "continuous_tracking"}, {"score": 0.0026494723416072316, "phrase": "anonymous_position_beacons"}, {"score": 0.0025537472239953807, "phrase": "nearby_cars"}, {"score": 0.00241658945942583, "phrase": "location_authority"}, {"score": 0.002276283303864666, "phrase": "actual_ones"}, {"score": 0.0022041312401435346, "phrase": "computationally_expensive_asymmetric_cryptography"}, {"score": 0.0021049977753042253, "phrase": "realistic_simulation_and_experimental_testbeds"}], "paper_keywords": ["Vehicular networks", " position verification", " privacy"], "paper_abstract": "A number of vehicular networking applications require continuous knowledge of the location of vehicles and tracking of the routes they follow, including, e.g., real-time traffic monitoring, e-tolling, and liability attribution in case of accidents. Locating and tracking vehicles has however strong implications in terms of security and user privacy. On the one hand, there should be a mean for an authority to verify the correctness of positioning information announced by a vehicle, so as to identify potentially misbehaving cars. On the other, public disclosure of identity and position of drivers should be avoided, so as not to jeopardize user privacy. In this paper, we address such issues by introducing A-VIP, a secure, privacy-preserving framework for continuous tracking of vehicles. A-VIP leverages anonymous position beacons from vehicles, and the cooperation of nearby cars collecting and reporting the beacons they hear. Such information allows a location authority to verify the positions announced by vehicles, or to infer the actual ones if needed, without resorting to computationally expensive asymmetric cryptography. We assess the effectiveness of A-VIP via realistic simulation and experimental testbeds.", "paper_title": "Verification and Inference of Positions in Vehicular Networks through Anonymous Beaconing", "paper_id": "WOS:000342162600020"}