{"auto_keywords": [{"score": 0.04931358686155013, "phrase": "next-generation_opacs"}, {"score": 0.00481495049065317, "phrase": "academic_librarians"}, {"score": 0.004406360418456518, "phrase": "next-generation_online_public_access_catalogue"}, {"score": 0.00418134346679498, "phrase": "different_levels"}, {"score": 0.004147756103284082, "phrase": "searching_ability"}, {"score": 0.0038263136898042285, "phrase": "specific_features"}, {"score": 0.0035439655241057207, "phrase": "library_users"}, {"score": 0.003459191419478298, "phrase": "master_of_arts_librarianship"}, {"score": 0.0032038465090068646, "phrase": "next-generation_catalogue_interfaces"}, {"score": 0.00301560261110296, "phrase": "previous_studies"}, {"score": 0.002907992115184249, "phrase": "searching_and_browsing_options"}, {"score": 0.0027929100418926725, "phrase": "similar_opinions"}, {"score": 0.0027370835853738626, "phrase": "next-generation_opac_features"}, {"score": 0.002534906456854208, "phrase": "disciplinary_background"}, {"score": 0.002504374718975704, "phrase": "post-graduate_students"}, {"score": 0.0024247382451294255, "phrase": "next_generation_opacs"}, {"score": 0.002254672021120091, "phrase": "users'_preferences"}, {"score": 0.0021566565951738658, "phrase": "current_findings"}, {"score": 0.0021049977753042253, "phrase": "previous_literature"}], "paper_keywords": ["OPAC", " Web scale discovery", " User studies", " Next generation OPAC", " Web 2.0"], "paper_abstract": "Purpose - The purpose of this paper is to determine whether features of next-generation Online Public Access Catalogue (OPAC) interfaces are useful and intuitive to users who have different levels of searching ability. In addition, it investigates whether there is a difference between librarians' and students' preferences for specific features. Design/methodology/approach - The research is based on 18 semi-structured interviews conducted in July 2012 with three groups of library users from The University of Sheffield: librarians; Master of Arts Librarianship students; and a group of other post-graduate students. Findings - Overall, this study suggests that while the next-generation catalogue interfaces and features are useful, they are not as \"intuitive\" as some previous studies have claimed. Interviewees appeared to prefer the searching and browsing options over the Web 2.0 features. Both librarians and students have similar opinions regarding the usefulness of next-generation OPAC features, but preferences are complex. Research limitations/implications - The study is based on one institution, and the disciplinary background of the post-graduate students was limited. Practical implications - Promoting next generation OPACs and explaining their features to users is essential. Originality/value - The paper adds to the understanding of users' preferences in relation to next-generation OPACs, locating the findings of the current findings firmly in the context of previous literature.", "paper_title": "An investigation into the perceptions of academic librarians and students towards next-generation OPACs and their features", "paper_id": "WOS:000350590000002"}