{"auto_keywords": [{"score": 0.043965416920295264, "phrase": "technology_transfer"}, {"score": 0.04237409427898173, "phrase": "transfer_phase"}, {"score": 0.03191809642000448, "phrase": "technology_transfer_phase"}, {"score": 0.00481495049065317, "phrase": "technology_innovation_-_turning_research_results"}, {"score": 0.0046176782475198085, "phrase": "software_engineering_technologies"}, {"score": 0.004459445258869177, "phrase": "software_development"}, {"score": 0.004232160987948483, "phrase": "technology_creation"}, {"score": 0.003974597387549594, "phrase": "mutual_interest"}, {"score": 0.0037456980766939836, "phrase": "industrial_relevance"}, {"score": 0.0035670895401691536, "phrase": "industrial_applicability"}, {"score": 0.003542276457435362, "phrase": "research_results"}, {"score": 0.0033381913087533457, "phrase": "research_funding_bodies"}, {"score": 0.0031239353051539347, "phrase": "competitive_edge"}, {"score": 0.002842840150239715, "phrase": "technology_evaluation_activity"}, {"score": 0.0027936239349923464, "phrase": "main_gate"}, {"score": 0.0027645030021576926, "phrase": "technology_creation_phase"}, {"score": 0.0026602925366283952, "phrase": "dutch_high-tech_systems_industry"}, {"score": 0.0024721021985994115, "phrase": "main_roles"}, {"score": 0.00244632460902489, "phrase": "software_engineering_technology_innovation"}, {"score": 0.0024039564563674673, "phrase": "technology_provider"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Technology transfer", " Process", " Technology engineering", " Technology embedding"], "paper_abstract": "This paper deals with the innovation of software engineering technologies. These technologies are methods and tools for conducting software development and maintenance. We consider innovation as a process consisting of two phases, being technology creation and technology transfer. In this paper, we focus mainly on the transfer phase. Technology transfer is of mutual interest to both academia and industry. Transfer is important for academia, because it shows the industrial relevance of their research results to, for example, their sponsoring authorities. Showing the industrial applicability of research results is sometimes referred to as valorization of research. Nowadays, valorization is often required by research funding bodies. The transfer is important for industries, because innovating their development processes and their products is supportive in gaining a competitive edge or remaining competitive in their business. We describe the technology transfer phase by means of three activities: technology evaluation, technology engineering, and technology embedding. The technology evaluation activity is perceived as the main gate between the technology creation phase and the technology transfer phase. With two case studies. originating from the Dutch high-tech systems industry, we will illustrate the activities in the transfer phase. In addition to the process we will also define the main roles in a software engineering technology innovation, namely: the technology provider (academic research, industrial research and technology vendor) and the technology receiver (industrial development). With those roles we also address the issues concerning the ownership of technologies. (c) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Software engineering technology innovation - Turning research results into industrial success", "paper_id": "WOS:000266217500007"}