{"auto_keywords": [{"score": 0.0428614620458835, "phrase": "privacy_statement"}, {"score": 0.007490178134076993, "phrase": "actual_reading"}, {"score": 0.006479245147455166, "phrase": "web_site's_privacy_statement"}, {"score": 0.004647911247507267, "phrase": "purpose_-_the_purpose"}, {"score": 0.004364061700500524, "phrase": "positive_influence"}, {"score": 0.004333341383664351, "phrase": "perceived_control"}, {"score": 0.004270178957872099, "phrase": "cyber_merchant"}, {"score": 0.00422516469733364, "phrase": "-_two_experiments"}, {"score": 0.003950846696972114, "phrase": "self-reported_claims"}, {"score": 0.0038023227467143183, "phrase": "opt-out_format"}, {"score": 0.0036553070575015344, "phrase": "control_condition"}, {"score": 0.003417859963947459, "phrase": "dependent_variables"}, {"score": 0.003310813458610484, "phrase": "mere_presence"}, {"score": 0.002998688867384969, "phrase": "commonly_held_assumptions"}, {"score": 0.0029357204796552653, "phrase": "opt-in_format"}, {"score": 0.0029150253706493852, "phrase": "significantly_more_control"}, {"score": 0.002575526825728026, "phrase": "sample_size"}, {"score": 0.002433754579432554, "phrase": "practical_implications"}, {"score": 0.0023826206937008257, "phrase": "particular_attention"}, {"score": 0.002357457094026928, "phrase": "strategic_role"}, {"score": 0.0021049977753042253, "phrase": "experimental_approach"}], "paper_keywords": ["electronic commerce", " privacy", " trust", " online operations", " Internet"], "paper_abstract": "Purpose - The purpose of this research is to study the impact of reading a web site's privacy statement on the perceptions of control over privacy and trust in a cyber merchant. Design/methodology/approach - Two experiments were designed to monitor the actual reading of the privacy statement. Study one compares the influence of actual reading with self-reported claims. Study two manipulated the format of the privacy statement (opt-in or opt-out) and included a control condition to assess the influence of the presence of a privacy statement and the influence of the format on the dependent variables. Findings - The findings show that the mere presence of a privacy statement has a positive influence on perceived control. However, reading the privacy statement does not necessarily have a positive influence on perceived control and trust, contrary to commonly held assumptions. Participants who read the opt-in format felt significantly more control and trust than the participants who read the opt-out format. The opt-out format decreases perceived control compared with the group that did not read the privacy statement when it was available. Research limitations/implications - The sample size for both experiments was relatively modest, which limits the generalisability of the findings. Practical implications - Cyber merchants should devote particular attention to the strategic role of the format of the privacy statement. Originality/value - In contrast to other studies that relied on surveys, this paper assesses the impact of the actual reading of the privacy statement via an experimental approach. Moreover, the impact of the format of the privacy statement has been empirically tested.", "paper_title": "The impact of reading a web site's privacy statement on perceived control over privacy and perceived trust", "paper_id": "WOS:000250991700006"}