{"auto_keywords": [{"score": 0.033096240026277673, "phrase": "uncontrolled_virality"}, {"score": 0.015504219142952556, "phrase": "minimum_regret"}, {"score": 0.00481495049065317, "phrase": "viral_marketing_meets_social_advertising"}, {"score": 0.004721789694995182, "phrase": "social_advertisement"}, {"score": 0.00465634671242413, "phrase": "fastest_growing_sectors"}, {"score": 0.004617515080028721, "phrase": "digital_advertisement_landscape"}, {"score": 0.004528156929805637, "phrase": "promoted_posts"}, {"score": 0.004403480614319231, "phrase": "social_networking_platform"}, {"score": 0.004354572391793908, "phrase": "normal_social_posts"}, {"score": 0.004258372598568333, "phrase": "promoted_post"}, {"score": 0.004118026552723285, "phrase": "fixed_amount"}, {"score": 0.0036826452656927877, "phrase": "simple_strategy"}, {"score": 0.0033301694494391643, "phrase": "viral-marketing_lenses"}, {"score": 0.0031934216158787344, "phrase": "viral_propagation"}, {"score": 0.003166751241099304, "phrase": "significantly_better_performance"}, {"score": 0.002903830052664078, "phrase": "lower_budget"}, {"score": 0.002823750388759926, "phrase": "smaller_cost"}, {"score": 0.002784540221128404, "phrase": "challenging_trade-off"}, {"score": 0.002677616534005393, "phrase": "network_effect"}, {"score": 0.0026552425134383963, "phrase": "advertising_efficacy"}, {"score": 0.0025604233506352375, "phrase": "free_service"}, {"score": 0.002475898613632249, "phrase": "ad_allocation"}, {"score": 0.0024211009463218484, "phrase": "np-hard_and_inapproximable_w.r.t"}, {"score": 0.0023346234464901978, "phrase": "approximation_guarantees"}, {"score": 0.002251227801482381, "phrase": "scalable_version"}, {"score": 0.0021526564019119466, "phrase": "high_quality_solutions"}], "paper_keywords": [""], "paper_abstract": "Social advertisement is one of the fastest growing sectors in the digital advertisement landscape: ads in the form of promoted posts are shown in the feed of users of a social networking platform, along with normal social posts; if a user clicks on a promoted post, the host (social network owner) is paid a fixed amount from the advertiser. In this context, allocating ads to users is typically performed by maximizing click-through-rate, i.e., the likelihood that the user will click on the ad. However, this simple strategy fails to leverage the fact the ads can propagate virally through the network, from endorsing users to their followers. In this paper, we study the problem of allocating ads to users through the viral-marketing lenses. We show that allocation that takes into account the propensity of ads for viral propagation can achieve significantly better performance. However, uncontrolled virality could be undesirable for the host as it creates room for exploitation by the advertisers: hoping to tap uncontrolled virality, an advertiser might declare a lower budget for its marketing campaign, aiming at the same large outcome with a smaller cost. This creates a challenging trade-off: on the one hand, the host aims at leveraging virality and the network effect to improve advertising efficacy, while on the other hand the host wants to avoid giving away free service due to uncontrolled virality. We formalize this as the problem of ad allocation with minimum regret, which we show is NP-hard and inapproximable w.r.t. any factor. However, we devise an algorithm that provides approximation guarantees w.r.t. the total budget of all advertisers. We develop a scalable version of our approximation algorithm, which we extensively test on four real-world data sets, confirming that our algorithm delivers high quality solutions, is scalable, and significantly outperforms several natural baselines.", "paper_title": "Viral Marketing Meets Social Advertising: Ad Allocation with Minimum Regret", "paper_id": "WOS:000362281700011"}