{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_rule-based_classifiers"}, {"score": 0.030067796377200032, "phrase": "furia"}, {"score": 0.004726184966910756, "phrase": "multi-objective_evolutionary_algorithms"}, {"score": 0.004553510708976456, "phrase": "fuzzy_rule-based_systems"}, {"score": 0.004502943680955863, "phrase": "different_trade-offs"}, {"score": 0.004290201740122912, "phrase": "moea-based_approach"}, {"score": 0.004179824713643488, "phrase": "data_bases"}, {"score": 0.004012061349250865, "phrase": "rule_bases"}, {"score": 0.0037658881407605445, "phrase": "heuristically_generated_set"}, {"score": 0.003737934295442975, "phrase": "candidate_rules"}, {"score": 0.003696390664266446, "phrase": "reduced_number"}, {"score": 0.0036281710561308377, "phrase": "selected_rule"}, {"score": 0.003587842947046177, "phrase": "evolutionary_process"}, {"score": 0.0034309482755326016, "phrase": "constrained_search_space"}, {"score": 0.003367611042980526, "phrase": "data_base_learning"}, {"score": 0.0033301694494391643, "phrase": "membership_function_parameters"}, {"score": 0.003293142761521425, "phrase": "linguistic_term"}, {"score": 0.003149098208612385, "phrase": "rcs."}, {"score": 0.0030909442697163356, "phrase": "twenty-four_classification_benchmarks"}, {"score": 0.002784540221128404, "phrase": "non-parametric_statistical_tests"}, {"score": 0.0024075916292945715, "phrase": "fitness_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-objective evolutionary fuzzy system", " Fuzzy rule-based classifier", " Evolutionary rule selection", " Evolutionary condition selection"], "paper_abstract": "During the last years, multi-objective evolutionary algorithms (MOEAs) have been extensively used to generate fuzzy rule-based systems characterized by different trade-offs between accuracy and complexity. In this paper, we propose an MOEA-based approach to learn concurrently the rule and data bases of fuzzy rule-based classifiers (FRBCs). In particular, the rule bases are generated by exploiting a rule and condition selection (RCS) strategy, which selects a reduced number of rules from a heuristically generated set of candidate rules and a reduced number of conditions for each selected rule during the evolutionary process. RCS can be considered as a rule learning in a constrained search space. As regards the data base learning, the membership function parameters of each linguistic term used in the rules are learned concurrently to the application of RCS. We tested our approach on twenty-four classification benchmarks and compared our results with the ones obtained by two similar state-of-the-art MOEA-based approaches and by two well-known non-evolutionary classification algorithms, namely FURIA and C4.5. Using non-parametric statistical tests, we show that our approach generates FRBCs with accuracy and complexity statistically comparable to, and sometimes better than, the ones generated by the two MOEA-based approaches, exploiting, however, only the 5% of the number of fitness evaluations used by these approaches. Further, the classifiers generated by our approach result to be more interpretable than the ones generated by the FURIA and C4.5 algorithms, while achieving the same accuracy level. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A fast and efficient multi-objective evolutionary learning scheme for fuzzy rule-based classifiers", "paper_id": "WOS:000341548200003"}