{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ligand_prediction"}, {"score": 0.04967088836874542, "phrase": "protein_sequence"}, {"score": 0.04538980158905762, "phrase": "ligand_information"}, {"score": 0.0328783823409279, "phrase": "individual_proteases"}, {"score": 0.00473320761888448, "phrase": "small_molecule_information_using_support_vector_machines"}, {"score": 0.00445783412174435, "phrase": "small_molecule_ligands"}, {"score": 0.003954030683259778, "phrase": "orphan_targets"}, {"score": 0.003920295222165263, "phrase": "newly_identified_members"}, {"score": 0.0038868464660354626, "phrase": "protein_families"}, {"score": 0.003788196352457501, "phrase": "de_novo_ligand_identification"}, {"score": 0.0037078961288626185, "phrase": "known_three-dimensional_target_structures"}, {"score": 0.003477029725200912, "phrase": "closely_and_distantly_related_proteins"}, {"score": 0.003218823621926739, "phrase": "different_families"}, {"score": 0.0029416448256236057, "phrase": "different_ways"}, {"score": 0.002879237498994052, "phrase": "ligand_descriptors"}, {"score": 0.0025207284405252914, "phrase": "linear_combination"}, {"score": 0.00249919111154604, "phrase": "multiple_target-directed_svms"}, {"score": 0.0024461474613359994, "phrase": "high_accuracy"}, {"score": 0.0024252458095689847, "phrase": "test_cases"}, {"score": 0.0023434058350520763, "phrase": "data_fusion"}, {"score": 0.002235356010935877, "phrase": "svm_linear_combination"}, {"score": 0.002216251512062482, "phrase": "target-ligand_kernel_methods"}], "paper_keywords": [""], "paper_abstract": "Support vector machine (SVM) database search strategies are presented that aim at the identification of small molecule ligands for targets for which no ligand information is currently available. In pharmaceutical research and chemical biology, this situation is faced, for example, when studying orphan targets or newly identified members of protein families. To investigate methods for de novo ligand identification in the absence of known three-dimensional target structures or active molecules, we have focused on combining sequence and ligand information for closely and distantly related proteins. To provide a basis for these investigatiors, a set of I I protease targets from different families was assembled together with more than 2000 inhibitors directed against individual proteases. We have compared SVM approaches that combine protein sequence and ligand information in different ways and utilize 2D fingerprints as ligand descriptors. These methodologies were applied to search for inhibitors of individual proteases not taken into account during learning. A target sequence-ligand kernel and, in particular, a linear combination of multiple target-directed SVMs consistently identified inhibitors with high accuracy including test cases where homology-based similarity searching using data fusion and conventional SVM ranking nearly or completely failed. The SVM linear combination and target-ligand kernel methods described herein are intuitive and straightforward to adopt for ligand prediction against other targets.", "paper_title": "Ligand Prediction from Protein Sequence and Small Molecule Information Using Support Vector Machines and Fingerprint Descriptors", "paper_id": "WOS:000265528400003"}