{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "chinese"}, {"score": 0.010129144247374431, "phrase": "delay_space"}, {"score": 0.009831974740079378, "phrase": "relay_node"}, {"score": 0.004220624516321415, "phrase": "current_best-effort_internet"}, {"score": 0.003999089046152065, "phrase": "meet_the_quality_standards_achieved_in_the_public_switched_telephone_network"}, {"score": 0.0036553070575015344, "phrase": "path_diversity"}, {"score": 0.0035901685646972585, "phrase": "promising_approach"}, {"score": 0.0035051129798529, "phrase": "multi-homing_and_overlay_routing"}, {"score": 0.0033011569787033297, "phrase": "overlay_scenario"}, {"score": 0.0032036590920314725, "phrase": "previously_unexplored_approach"}, {"score": 0.0027741761880779535, "phrase": "intensive_internet_measurements"}, {"score": 0.002628362641980801, "phrase": "chinese_internet"}, {"score": 0.0022758279600841014, "phrase": "efficient_relay_node_selection_scheme"}, {"score": 0.0021049977753042253, "phrase": "trace-driven_simulation"}], "paper_keywords": ["Delay space", " Relay node selection", " P2P", " VoIP"], "paper_abstract": "Peer-to-peer (P2P) systems have been widely deployed and used to provide voice-over-IP (VoIP) service in the Internet. However, the current best-effort Internet cannot readily provide the service guarantees that meet the quality standards achieved in the public switched telephone network (PSTN). To address this problem, many studies have demonstrated that exploiting path diversity is a promising approach, such as multi-homing and overlay routing. In this paper, we focus on the overlay scenario and bring forward a previously unexplored approach that exploits the properties of delay space of Internet to select relay node to enhance the performance of P2P-based VoIP applications in Chinese Internet. By conducting intensive Internet measurements, we analyze the properties of delay space of Chinese Internet and show these properties can be readily exploited to select relay node with as small a cost as possible. Exploiting these properties we bring forward an efficient relay node selection scheme to improve the performance of P2P-based VoIP applications in Chinese Internet. Our intensive evaluation by trace-driven simulation shows our scheme is highly efficient and easy to be implemented.", "paper_title": "An efficient relay node selection scheme to improve the performance of P2P-based VoIP applications in Chinese internet", "paper_id": "WOS:000317608600005"}