{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "chiral_eft_three-nucleon_interaction"}, {"score": 0.040537135041717604, "phrase": "one-body_density_matrix"}, {"score": 0.01156332243324302, "phrase": "html"}, {"score": 0.010651909766877654, "phrase": "distributed_program"}, {"score": 0.010543109604462537, "phrase": "test_data"}, {"score": 0.008209810333055989, "phrase": "i-if_energy"}, {"score": 0.00481495049065317, "phrase": "hartree-fock_energy"}, {"score": 0.004181139755028501, "phrase": "hf"}, {"score": 0.003997891221012094, "phrase": "hf_energy"}, {"score": 0.003483120583663528, "phrase": "cpc_program_library"}, {"score": 0.003459191419478298, "phrase": "queen's_university"}, {"score": 0.003435426338252987, "phrase": "belfast"}, {"score": 0.0034118234596993836, "phrase": "n_ireland_licensing"}, {"score": 0.0033883824438527316, "phrase": "standard_cpc_licence"}, {"score": 0.0030031998605136788, "phrase": "gz_programming"}, {"score": 0.002911524185502519, "phrase": "windows"}, {"score": 0.0026342827320931937, "phrase": "tremendous_spin-isospin_algebra"}, {"score": 0.002527451565708784, "phrase": "quasi-local_approximation"}, {"score": 0.002302619021497886, "phrase": "latter_issue_solution_method"}, {"score": 0.0021639307835832136, "phrase": "automatic_simplification"}, {"score": 0.0021416404045850224, "phrase": "spin-isospin_traces"}, {"score": 0.0021049977753042253, "phrase": "symbolic_manipulation_techniques"}], "paper_keywords": ["Three-nucleon interaction", " Symbolic Hartree-Fock", " Symbolic density matrix expansion"], "paper_abstract": "We present the first of a two-part Mathematica notebook collection that implements a symbolic approach for the application of the density matrix expansion (DME) to the Hartree-Fock (HF) energy from a chiral effective field theory (EFT) three-nucleon interaction at (NLO)-L-2 The final output from the notebooks is a Skyrme-like energy density functional that provides a quasi-local approximation to the non-local HF energy. In this paper, we discuss the derivation of the HF energy and its simplification in terms of the scalar/vector-isoscalarhsovector parts of the one-body density matrix. Furthermore, a set of steps is described and illustrated on how to extend the approach to other three-nucleon interactions Program summary Program title SymbHFNNN Catalogue identifier AEGC_v 1_0 Program summary URL http.//cpc cs club ac uk/summanes/AEGC_v1_0 html Program obtainable from CPC Program Library, Queen's University. Belfast, N Ireland Licensing provisions Standard CPC licence. http //cpc cs club ac.ukhicencehicence html No of lures in distributed program, Including test data, etc 96 666 No of bytes in distributed program, including test data, etc 378 083 Distribution format tar gz Programming language Mathematica 7 1 Computer Any computer running Mathematica 60 and later versions Operating system. Windows Xp Linux/Unix RAM 256 Mb Classification 5.17 16. 1722 Nature of problem: The calculation of the HF: energy from the chiral EFT three-nucleon interaction at (NLO)-L-2 involves tremendous spin-isospin algebra The problem is compounded by the need to eventually obtain a quasi-local approximation to the I-IF energy, which requires the I-IF energy to be expressed in terms of scalar/vector-isoscalar/isovector parts of the one-body density matrix The Mathematica notebooks discussed in this paper solve the latter issue Solution method The HF energy from the chiral EFT three-nucleon interaction at (NLO)-L-2 is cast into a form suitable for an automatic simplification of the spin-isospin traces Several Mathematica functions and symbolic manipulation techniques are used to obtain the result in terms of the scalar/vector-isoscalar/isovector parts of the one-body density matrix Running time Several hours (C) 2010 Elsevier BV All rights reserved", "paper_title": "Symbolic computation of the Hartree-Fock energy from a chiral EFT three-nucleon interaction at (NLO)-L-2", "paper_id": "WOS:000277954400021"}