{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "classical_capacity"}, {"score": 0.015528209518813424, "phrase": "pure-loss_bosonic_channel"}, {"score": 0.004115267130977749, "phrase": "communication_rate"}, {"score": 0.004081385289516914, "phrase": "error_probability"}, {"score": 0.0037886833451021723, "phrase": "mean_number"}, {"score": 0.00371115485111022, "phrase": "channel_input"}, {"score": 0.003590383760209319, "phrase": "positive_number"}, {"score": 0.0032376465741070274, "phrase": "code_error_probability"}, {"score": 0.003171358146412577, "phrase": "channel_transmissivity"}, {"score": 0.003042812778470762, "phrase": "bosonic_thermal_state"}, {"score": 0.002907405102646616, "phrase": "strong_converse_theorem"}, {"score": 0.002665362204725326, "phrase": "maximum_photon_number_constraint"}, {"score": 0.0025257081555100556, "phrase": "average_density_operator"}, {"score": 0.00240328454980006, "phrase": "photon_number"}, {"score": 0.0022214412809055013, "phrase": "channel_uses"}, {"score": 0.00213131678182067, "phrase": "small_modification"}, {"score": 0.0021049977753042253, "phrase": "well-known_coherent-state_coding_scheme"}], "paper_keywords": [""], "paper_abstract": "This paper strengthens the interpretation and understanding of the classical capacity of the pure-loss bosonic channel, first established in [1]. In particular, we first prove that there exists a trade-off between communication rate and error probability if one imposes only a mean photon number constraint on the channel inputs. That is, if we demand that the mean number of photons at the channel input cannot be any larger than some positive number NS, then it is possible to respect this constraint with a code that operates at a rate g(eta NS/(1-p)) where p is the code error probability, eta is the channel transmissivity, and g(x) is the entropy of a bosonic thermal state with mean photon number x. Then we prove that a strong converse theorem holds for the classical capacity of this channel (that such a rate-error trade-off cannot occur) if one instead demands for a maximum photon number constraint, in such a way that mostly all of the \"shadow\" of the average density operator for a given code is required to be on a subspace with photon number no larger than nNS, so that the shadow outside this subspace vanishes as the number n of channel uses becomes large. Finally, we prove that a small modification of the well-known coherent-state coding scheme meets this more demanding constraint.", "paper_title": "Strong converse for the classical capacity of the pure-loss bosonic channel", "paper_id": "WOS:000339384800001"}