{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complex_architecture"}, {"score": 0.004637478829869904, "phrase": "thumbprinting_method"}, {"score": 0.004551199992546761, "phrase": "efficient_way"}, {"score": 0.0038673406001234535, "phrase": "best_time_interval"}, {"score": 0.0034118234596993836, "phrase": "time_interval"}, {"score": 0.0032246835734680377, "phrase": "special_properties"}, {"score": 0.0031646057802503526, "phrase": "thumbprinting_function"}, {"score": 0.0028625406368744995, "phrase": "timestamping_approach"}, {"score": 0.00262191949451482, "phrase": "potentially_suspicious_source"}, {"score": 0.00247799842715255, "phrase": "error_probability"}, {"score": 0.0023127544795063263, "phrase": "observation_time"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["nonintrusive", " tracing", " Internet"], "paper_abstract": "Intruders that log in through a series of machines when conducting an attack are hard to trace because of the complex architecture of the Internet. The thumbprinting method provides an efficient way of tracing such intruders by determining whether two connections are part of the same connection chain. Because many connections are transient and therefore short in length, choosing the best time interval to thumbprint over can be an issue. In this paper, we provide a way to shorten the time interval used for thumbprinting. We then study some special properties of the thumbprinting function. We also study another mechanism for tracing intruders in the Internet based on a timestamping approach, which passively monitors flows between source and destination pairs. Given a potentially suspicious source, we identify its true destination. We compute the error probability of our algorithm and show that its value decreases exponentially as the observation time increases. Our simulation results show that our approach performs well. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Nonintrusive tracing in the Internet", "paper_id": "WOS:000320776500004"}