{"auto_keywords": [{"score": 0.049110723211527096, "phrase": "semantic_classes"}, {"score": 0.02614889491902764, "phrase": "previous_step"}, {"score": 0.00481495049065317, "phrase": "relation_recognition"}, {"score": 0.0042344044308802445, "phrase": "corresponding_entities"}, {"score": 0.004185217969203, "phrase": "important_task"}, {"score": 0.00412453424255527, "phrase": "information_extraction"}, {"score": 0.0036588697886897757, "phrase": "accumulative_effect"}, {"score": 0.0034410377627900274, "phrase": "first_argument"}, {"score": 0.003361702166118828, "phrase": "china"}, {"score": 0.002990455094600558, "phrase": "novel_method"}, {"score": 0.0026216289509286856, "phrase": "semantic_class"}, {"score": 0.0024083533974377, "phrase": "special_model"}, {"score": 0.0021049977753042253, "phrase": "entity_recognition"}], "paper_keywords": ["entity and relation recognition", " knowledge representation", " information extraction"], "paper_abstract": "The entity and relation recognition, i.e. (1) assigning semantic classes (e.g., person, organization and location) to entities in a sentence, and (2) determining the relations (e.g., born-in and employee-of) held between the corresponding entities, is an important task in areas such as information extraction and question answering. Subtasks (1) and (2) are typically carried out sequentially, and this procedure is problematic: errors made during subtask (1) are propagated to subtask (2) with an accumulative effect; and in many cases information that becomes available only during subtask (2) (e.g., the class of an entity corresponds to the first argument of relation born-in (X, China)) would be helpful for subtask (1) (e.g., the class of the entity cannot be a location but a person). To address problems of this kind, this paper develops a novel method, which allows subtasks (1) and (2) to be linked more closely together. The procedure is separated to three stages. Firstly, employ two classifiers to perform subtasks (1) and (2) independently. Secondly, the semantic class of each entity is determined by taking into account the classes of all the entities in the sentence, as computed during the previous step. This is achieved using a special model dubbed \"entity relation propagation diagram\" and \"entity relation propagation tree\". Thirdly, each relation is then assigned a class by considering the semantic classes of the entities produced at the previous step. Our experimental results show that the method improves not only relation recognition but also entity recognition in some degree.", "paper_title": "Knowledge representation and reasoning based on entity and relation propagation diagram/tree", "paper_id": "WOS:000241758200006"}