{"auto_keywords": [{"score": 0.012152233686040615, "phrase": "crystal_structure"}, {"score": 0.00481495049065317, "phrase": "docking_and_md_study"}, {"score": 0.004563613939245774, "phrase": "histamine_receptor_family"}, {"score": 0.0044922081848067135, "phrase": "class_a"}, {"score": 0.004463958296056236, "phrase": "g-protein_coupled_receptors"}, {"score": 0.00431171604706364, "phrase": "critical_role"}, {"score": 0.004284596323560538, "phrase": "histamine-induced_chemotaxis"}, {"score": 0.004009894739765119, "phrase": "structure-based_drug_discovery"}, {"score": 0.003909923690310641, "phrase": "current_work"}, {"score": 0.0038730779753083787, "phrase": "homology_models"}, {"score": 0.0036476222647061243, "phrase": "binding_pocket"}, {"score": 0.0034899090274046014, "phrase": "reasonable_binding_mode"}, {"score": 0.0028421959620622355, "phrase": "molecular_dynamics"}, {"score": 0.0027364508381415866, "phrase": "md_results"}, {"score": 0.002702081704660048, "phrase": "preferable_docking_mode"}, {"score": 0.002626317051411829, "phrase": "agonist_histamine"}, {"score": 0.002457671567833087, "phrase": "strong_conformational_changes"}, {"score": 0.002396306027986643, "phrase": "outward_movement"}, {"score": 0.00238120499061399, "phrase": "intracellular_part"}, {"score": 0.0023438664524018634, "phrase": "conformational_change"}, {"score": 0.0022709326810964386, "phrase": "recent_crystal_structures"}, {"score": 0.002256619934086924, "phrase": "active_gpcrs"}, {"score": 0.0021317885325570604, "phrase": "selective_antagonists"}], "paper_keywords": ["Histamine", " GPCR", " Docking", " Molecular dynamics", " Drug design"], "paper_abstract": "Histamine H4 receptor (H4R), a member of histamine receptor family, which belongs to class A of G-protein coupled receptors (GPCRs), has been reported to play a critical role in histamine-induced chemotaxis in mast cells and eosinophils. Recently, the crystal structure of human histamine H1 receptor (H1R) was reported, which facilitates structure-based drug discovery of histamine receptor significantly. In the current work, the homology models of H4R and H3R are first constructed based on the crystal structure of H1R Clobenpropit is then docked into the binding pocket of H4R and two different binding modes can be identified. In order to select a reasonable binding mode, several other ligands including agonists and antagonists are docked into H4R, and the results reveal that all ligands share one preferable binding mode: the protonated -NH tightly interacts with Asp(3.32) and the imidazole -NH interacts with Glu(5.46). By comparing H3R and H4R, we find that Glu(5.20) and Thr(6.55) in H4R involve in the selectivity of H4R. Then, we perform molecular dynamics (MD) simulations for H4R in complex with its compounds. MD results indicate that the preferable docking mode is more stable. Finally, we dock agonist histamine into H1R and H4R, and then perform 20 ns MD simulations for the complexes. H1R or H4R bound with histamine show strong conformational changes from TM5, TM6 and TM7, outward movement of intracellular part of TM6, and conformational change of Tyr(7.53), which is consistent with the recent crystal structures of active GPCRs. Our results reveal the mechanism of selectivity and activation for H4R, which is important for developing selective antagonists and agonists for H4R. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Docking and MD study of histamine H4R based on the crystal structure of H1R", "paper_id": "WOS:000315839400001"}