{"auto_keywords": [{"score": 0.04953663923501101, "phrase": "simulations"}, {"score": 0.00481495049065317, "phrase": "parameter_uncertainty"}, {"score": 0.0044967055264893184, "phrase": "complex_systems"}, {"score": 0.0043703658695579085, "phrase": "computer_simulation"}, {"score": 0.004175533280178052, "phrase": "great_deal"}, {"score": 0.003944112858235306, "phrase": "software_tools"}, {"score": 0.003899385109646589, "phrase": "aid_researchers"}, {"score": 0.0038114397487574838, "phrase": "similar_focus"}, {"score": 0.0035390378585554547, "phrase": "rigorous_statistical_analysis"}, {"score": 0.003193606324727067, "phrase": "captured_system"}, {"score": 0.002982203248352076, "phrase": "statistical_techniques"}, {"score": 0.0027689017918347755, "phrase": "real_system"}, {"score": 0.0025416235470290286, "phrase": "accompanying_immunology_case_study"}, {"score": 0.0024700776739384977, "phrase": "lymphoid_tissue"}, {"score": 0.002386869729952315, "phrase": "practical_introduction"}], "paper_keywords": [""], "paper_abstract": "In attempts to further understand the dynamics of complex systems, the application of computer simulation is becoming increasingly prevalent. Whereas a great deal of focus has been placed in the development of software tools that aid researchers develop simulations, similar focus has not been applied in the creation of tools that perform a rigorous statistical analysis of results generated through simulation: vital in understanding how these results offer an insight into the captured system. This encouraged us to develop spartan, a package of statistical techniques designed to assist researchers in understanding the relationship between their simulation and the real system. Previously we have described each technique within spartan in detail, with an accompanying immunology case study examining the development of lymphoid tissue. Here we provide a practical introduction to the package, demonstrating how each technique is run in R, to assist researchers in integrating this package alongside their chosen simulation platform.", "paper_title": "Applying spartan to Understand Parameter Uncertainty in Simulations", "paper_id": "WOS:000348651700007"}