{"auto_keywords": [{"score": 0.044308460471387805, "phrase": "data-fidelity_term"}, {"score": 0.007553342509366238, "phrase": "rival_terms"}, {"score": 0.00481495049065317, "phrase": "data-fidelity_and_regularization_terms"}, {"score": 0.004428728205625129, "phrase": "sr_problem"}, {"score": 0.004174824849669107, "phrase": "regularization_term"}, {"score": 0.0041136473765874815, "phrase": "present_work"}, {"score": 0.003877737556673229, "phrase": "sr_reconstruction_result"}, {"score": 0.003445606611587296, "phrase": "huber"}, {"score": 0.0034119672903820905, "phrase": "lorentzian"}, {"score": 0.002986969236641105, "phrase": "effective_sr_method"}, {"score": 0.002914288956035066, "phrase": "lr_frames"}, {"score": 0.0026148807877309417, "phrase": "experimental_conclusions"}, {"score": 0.0024405312482831646, "phrase": "noise_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Super-resolution", " Data-fidelity", " Regularization", " Noisy frames", " Method selection"], "paper_abstract": "Stochastic regularized methods are quite advantageous in super-resolution (SR) image reconstruction problems. In the particular techniques, the SR problem is formulated by means of two terms, the data-fidelity term and the regularization term. The present work examines the effect of each one of these terms on the SR reconstruction result with respect to the presence or absence of noise in the low-resolution (LR) frames. Experimentation is carried out with the widely employed L-2, L-1, Huber and Lorentzian estimators for the data-fidelity term. The Tikhonov and Bilateral (B) Total Variation (TV) techniques are employed for the regularization term. The extracted conclusions can, in practice, help to select an effective SR method for a given sequence of LR frames. Thus, in case that the potential methods present common data-fidelity or regularization term, and frames are noiseless, the method which employs the most robust regularization or data-fidelity term should be used. Otherwise, experimental conclusions regarding performance ranking vary with the presence of noise in frames, the noise model as well as the difference in robustness of efficiency between the rival terms. Estimators employed for the data-fidelity term or regularizations stand for the rival terms. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Super-resolution image reconstruction techniques: Trade-offs between the data-fidelity and regularization terms", "paper_id": "WOS:000302762000002"}