{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "dynamic_web_content"}, {"score": 0.007294858896635692, "phrase": "content_middlewares"}, {"score": 0.004729856080441582, "phrase": "structured_survey"}, {"score": 0.004125314447335291, "phrase": "specialized_cooperating_component_systems"}, {"score": 0.003957078581524691, "phrase": "static_content"}, {"score": 0.0037507793596022326, "phrase": "heavy_a_workload"}, {"score": 0.0035551969986263553, "phrase": "numerous_research_approaches"}, {"score": 0.003290494847464381, "phrase": "driving_force"}, {"score": 0.003251552926963083, "phrase": "popular_commercial_systems"}, {"score": 0.0030273620861817055, "phrase": "research_area"}, {"score": 0.0026241684260044414, "phrase": "proposed_approaches"}, {"score": 0.002315574871863272, "phrase": "research-charting_semi-formal_framework"}, {"score": 0.0022610394922069283, "phrase": "cfp"}, {"score": 0.002142970278347126, "phrase": "surveyed_approaches"}], "paper_keywords": [""], "paper_abstract": "The shift from static to dynamic Web content has been dramatic. Dynamic Web content is facilitated by specialized cooperating component systems better known as content middlewares. Unlike static content, the generation and delivery of dynamic Web content introduce heavy a workload on content middlewares. To address this problem, numerous research approaches have been proposed in the literature, some of which are the driving force behind popular commercial systems, a fact that stresses the importance and applicability of this research area. This article surveys the literature during the period of 1995-2005 on accelerating the generation and delivery of dynamic Web content. It classifies the proposed approaches into taxonomies based on their underlying methodologies and practices. In order to illustrate the evolution of research, we introduce a research-charting semi-formal framework called the Caching Fragmentation Polymorphism (CFP) framework, within which we relate the surveyed approaches and depict their relationships.", "paper_title": "A DECADE OF DYNAMIC WEB CONTENT: A STRUCTURED SURVEY ON PAST AND PRESENT PRACTICES AND FUTURE TRENDS", "paper_id": "WOS:000208213300004"}