{"auto_keywords": [{"score": 0.010157160739916508, "phrase": "consumer_it"}, {"score": 0.004762893197005439, "phrase": "individual_it_innovation_behavior"}, {"score": 0.004342430078306461, "phrase": "consumer_it_tools"}, {"score": 0.004112582094962078, "phrase": "social_media"}, {"score": 0.0036091892088392775, "phrase": "term_it_consumerization"}, {"score": 0.0030654278282822027, "phrase": "enterprise_it"}, {"score": 0.002966900048034132, "phrase": "individual_it_innovation_behaviors"}, {"score": 0.0028249975318149468, "phrase": "large-sized_companies"}, {"score": 0.002631892325004253, "phrase": "privately_owned_it"}, {"score": 0.0026033756286033285, "phrase": "positive_effects"}, {"score": 0.002575167114383286, "phrase": "employees'_innovation_behaviors"}, {"score": 0.0023730978395564116, "phrase": "byod_strategies"}, {"score": 0.0021631447601689444, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "innovative_power"}], "paper_keywords": ["IT consumerization", " BYOD", " CYOD", " Individual innovation", " Employee", " driven innovation", " Smartphones", " Tablets"], "paper_abstract": "Leveraging the IT innovation capabilities of employees is becoming increasingly feasible in the era of IT consumerization. Consumer IT tools, in form of tablets, smartphones, or social media, are entering organizations and are changing the way employees use technology for work. In this article, the authors decipher the term IT consumerization in more detail by providing a framework that illustrates the various perspectives of the phenomenon. They then apply the various perspectives in order to propose an IT consumerization framework that juxtaposes consumer IT with enterprise IT in its ability to lead to individual IT innovation behaviors. Using data from 486 European employees that work for large-sized companies, they are able to infer that consumer IT and the permission to use privately owned IT exert positive effects on employees' innovation behaviors. An examination of the various perspectives supports the assumption of science and practice that BYOD strategies and the diffusion of consumer IT within organizations are beneficial for innovation. The results provide a first step in theorizing about the innovative power of IT consumerization.", "paper_title": "Innovation Through BYOD? The Influence of IT Consumerization on Individual IT Innovation Behavior", "paper_id": "WOS:000365498600003"}