{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "parameterized_linear_constraints"}, {"score": 0.011160618723657444, "phrase": "polyhedral_sets"}, {"score": 0.00896422739856268, "phrase": "entailment_problem"}, {"score": 0.004743164872278112, "phrase": "linear_constraints"}, {"score": 0.0038048583022763796, "phrase": "basic_theoretical_tools"}, {"score": 0.0031765314093444956, "phrase": "computational_complexities"}, {"score": 0.0030060256866508606, "phrase": "quantified_linear_implications"}, {"score": 0.0023040642263522505, "phrase": "strengthening_extension"}, {"score": 0.00223570488212345, "phrase": "weak_entailment_problem"}, {"score": 0.0021049977753042253, "phrase": "strong_entailment_problem"}], "paper_keywords": ["Entailment", " Parameterized linear constraint", " Quantified linear program", " Quantified linear implication", " Computational complexity", " Polynomial algorithm"], "paper_abstract": "Extending linear constraints by admitting parameters allows for more abstract problem modeling and reasoning. A lot of focus has been given to conducting research that demonstrates the usefulness of parameterized linear constraints and implementing tools that utilize their modeling strength. However, there is no approach that considers basic theoretical tools related to such constraints that allow for reasoning over them. Hence, in this paper we introduce satisfiability with respect to polyhedral sets and entailment for the class of parameterized linear constraints. In order to study the computational complexities of these problems, we relate them to classes of quantified linear implications. The problem of satisfiability with respect to polyhedral sets is then shown to be co- hard. The entailment problem is also shown to be co- hard in its general form. Nevertheless, we characterize some subclasses for which this problem is in a\"(TM). Furthermore, we examine a weakening and a strengthening extension of the entailment problem. The weak entailment problem is proved to be complete. On the other hand, the strong entailment problem is shown to be co- hard.", "paper_title": "A complexity perspective on entailment of parameterized linear constraints", "paper_id": "WOS:000309171000004"}