{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_collections"}, {"score": 0.004618720776729413, "phrase": "semisupervised_optimization_model"}, {"score": 0.004510184935928004, "phrase": "efficient_segmentation"}, {"score": 0.003063627258654102, "phrase": "model_parameters"}, {"score": 0.003009390313137981, "phrase": "initial_stage"}, {"score": 0.0029561107046138136, "phrase": "initial_tuning"}, {"score": 0.0027358910467781155, "phrase": "large_collection"}, {"score": 0.002608583927848071, "phrase": "similar_features"}, {"score": 0.0025169965861573185, "phrase": "mathematical_properties"}, {"score": 0.0022077827041801193, "phrase": "extensive_experiments"}, {"score": 0.002155779067056877, "phrase": "biological_images"}, {"score": 0.0021049977753042253, "phrase": "proposed_model"}], "paper_keywords": ["Biological image segmentation", " image segmentation", " interactive", " microscopy images", " multiple images"], "paper_abstract": "In this paper, we consider the problem of segmentation of large collections of images. We propose a semisupervised optimization model that determines an efficient segmentation of many input images. The advantages of the model are twofold. First, the segmentation is highly controllable by the user so that the user can easily specify what he/she wants. This is done by allowing the user to provide, either offline or interactively, some (fully or partially) labeled pixels in images as strong priors for the model. Second, the model requires only minimal tuning of model parameters during the initial stage. Once initial tuning is done, the setup can be used to automatically segment a large collection of images that are distinct but share similar features. We will show the mathematical properties of the model such as existence and uniqueness of solution and establish a maximum/minimum principle for the solution of the model. Extensive experiments on various collections of biological images suggest that the proposed model is effective for segmentation and is computationally efficient.", "paper_title": "A Semisupervised Segmentation Model for Collections of Images", "paper_id": "WOS:000304159800004"}