{"auto_keywords": [{"score": 0.015530559745360033, "phrase": "multiple_applications"}, {"score": 0.010403707303353526, "phrase": "regular_mesh"}, {"score": 0.00481495049065317, "phrase": "efficient_noc_multicasting_scheme"}, {"score": 0.004712913906047687, "phrase": "irregular_sub-networks"}, {"score": 0.004312622975366676, "phrase": "on-chip_traffic"}, {"score": 0.004044064541716598, "phrase": "noc_architecture"}, {"score": 0.0040193730627071135, "phrase": "applicable_traffic_isolation_constraints"}, {"score": 0.003982617095636925, "phrase": "corresponding_sub-networks"}, {"score": 0.003757480190200645, "phrase": "irregular_topologies"}, {"score": 0.003700371064796848, "phrase": "multiple_unicasting"}, {"score": 0.0035887342563437935, "phrase": "overly_high_power_consumption"}, {"score": 0.0035668128900149814, "phrase": "long_network_latency"}, {"score": 0.0033548062793973144, "phrase": "irregular_oriented_multicast_strategy"}, {"score": 0.0032436052954996097, "phrase": "irregular_oriented_multicast_routing_algorithm"}, {"score": 0.003165046673308291, "phrase": "based_multicast_routing_algorithm"}, {"score": 0.002976861128324196, "phrase": "rpm"}, {"score": 0.002878140062594849, "phrase": "basic_idea"}, {"score": 0.0028170314398963704, "phrase": "output_directions"}, {"score": 0.002791239714439304, "phrase": "basic_rpm_algorithm"}, {"score": 0.0027069560455629917, "phrase": "original_output_directions"}, {"score": 0.0026011706232569316, "phrase": "experiment_results"}, {"score": 0.0022382002476510573, "phrase": "baseline_router"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network-on-chips (NoCs)", " Chip multiprocessor (CMP)", " Multicast", " Routing"], "paper_abstract": "When a number of applications simultaneously running on a many-core chip multiprocessor (CMP) chip connected through network-on-chip (NoC), significant amount of on-chip traffic is one-to-many (multicast) in nature. As a matter of fact, when multiple applications are mapped onto an NoC architecture with applicable traffic isolation constraints, the corresponding sub-networks of these applications are mapped onto actually tend to be irregular. In the literature, multicasting for irregular topologies is supported through either multiple unicasting or broadcasting, which, unfortunately, results in overly high power consumption and/or long network latency. To address this problem, a simple, yet efficient hardware-based multicasting scheme is proposed in this paper. First, an irregular oriented multicast strategy is proposed. Literally, following this strategy, an irregular oriented multicast routing algorithm can be designed based on any regular mesh based multicast routing algorithm. One such algorithm, namely, Alternative Recursive Partitioning Multicasting (AL + RPM), is proposed based on RPM, which was designed for regular mesh topology originally. The basic idea of AL + RPM is to find the output directions following the basic RPM algorithm and then decide to replicate the packets to the original output directions or the alternative (AL) output directions based on the shape of the sub-network. The experiment results show that the proposed multicast AL + RPM algorithm can consume, on average, 14% and 20% less power than bLBDR (a broadcasting-based routing algorithm) and the multiple unicast scheme, respectively. In addition, AL + RPM has much lower network latency than the above two approaches. To incorporate AL + RPM into a baseline router to support multicasting, the area overhead is fairly modest, less than 5.5%. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "On an efficient NoC multicasting scheme in support of multiple applications running on irregular sub-networks", "paper_id": "WOS:000288729800005"}