{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "artificial_immune_systems"}, {"score": 0.048929739366992464, "phrase": "diversity_operator"}, {"score": 0.0037988336463795963, "phrase": "biologically_inspired_paradigms"}, {"score": 0.0037301606780397456, "phrase": "key_feature"}, {"score": 0.0032629585038738856, "phrase": "diversity_introduction"}, {"score": 0.0031845067058084613, "phrase": "simple_random_number_generation"}, {"score": 0.00303319936111073, "phrase": "application_area"}, {"score": 0.0029783256772952073, "phrase": "function_optimisation"}, {"score": 0.0029244418026475832, "phrase": "case_study"}, {"score": 0.0028367868542874737, "phrase": "simple_immune_inspired_mutation_operator"}, {"score": 0.0025735173163957993, "phrase": "well_known_immune_inspired_algorithm"}, {"score": 0.002320449502337321, "phrase": "search_capability"}], "paper_keywords": [""], "paper_abstract": "When constructing biologically inspired algorithms, important properties to consider are openness, diversity, interaction, structure and scale. In this paper, we focus on the property of diversity. Introducing diversity into biologically inspired paradigms is a key feature of their success. Within the field of Artificial Immune Systems, little attention has been paid to this issue. Typically, techniques of diversity introduction, such as simple random number generation, are employed with little or no consideration to the application area. Using function optimisation as a case study, we propose a simple immune inspired mutation operator that is tailored to the problem at hand. We incorporate this diversity operator into a well known immune inspired algorithm, aiNet. Through this approach, we show that it is possible to improve the search capability of aiNet on hard to locate optima. We further illustrate that by incorporating the same mutation operator into aiNet when applied to clustering, it is observed that performance is neither improved nor sacrificed.", "paper_title": "Diversity and artificial immune systems: Incorporating a diversity operator into aiNet", "paper_id": "WOS:000237451800037"}