{"auto_keywords": [{"score": 0.045529220460039106, "phrase": "sequence_differences"}, {"score": 0.022979075648615312, "phrase": "falsely_reported_expression_differences"}, {"score": 0.00481495049065317, "phrase": "gene_expression_measurements"}, {"score": 0.0045357787854931894, "phrase": "gene_expression_levels"}, {"score": 0.004230382915464492, "phrase": "false_identification"}, {"score": 0.004188459638572375, "phrase": "expression_differences"}, {"score": 0.004065156038847781, "phrase": "sequence_divergence"}, {"score": 0.0037724857647796813, "phrase": "similar_levels"}, {"score": 0.0035891316580885665, "phrase": "human_and_chimpanzee_expression"}, {"score": 0.003281186608301359, "phrase": "problematic_probes"}, {"score": 0.0027557911038816256, "phrase": "human_and_chimpanzee_data"}, {"score": 0.002234893735225432, "phrase": "simulated_dataset"}, {"score": 0.0021049977753042253, "phrase": "sequence_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: When comparing gene expression levels between species or strains using microarrays, sequence differences between the groups can cause false identification of expression differences. Our simulated dataset shows that a sequence divergence of only 1% between species can lead to falsely reported expression differences for >50% of the transcripts-similar levels of effect have been reported previously in comparisons of human and chimpanzee expression. We propose a method for identifying probes that cause such false readings, using only the microarray data, so that problematic probes can be excluded from analysis. We then test the power of the method to detect sequence differences and to correct for falsely reported expression differences. Our method can detect 70% of the probes with sequence differences using human and chimpanzee data, while removing only 18% of probes with no sequence differences. Although only 70% of the probes with sequence differences are detected, the effect of removing probes on falsely reported expression differences is more dramatic: the method can remove 98% of the falsely reported expression differences from a simulated dataset. We argue that the method should be used even when sequence data are available.", "paper_title": "The effects of probe binding affinity differences on gene expression measurements and how to deal with them", "paper_id": "WOS:000271106800006"}