{"auto_keywords": [{"score": 0.03434801369547198, "phrase": "optimum_mosfet_selection"}, {"score": 0.00481495049065317, "phrase": "nanometer_mosfet"}, {"score": 0.004723847090183984, "phrase": "minimum-energy_point"}, {"score": 0.004656647251517823, "phrase": "subthreshold_logic-mitigation"}, {"score": 0.004503525064934708, "phrase": "subthreshold_operation"}, {"score": 0.004460703838987562, "phrase": "digital_circuits"}, {"score": 0.004418287966422041, "phrase": "minimum_energy_consumption"}, {"score": 0.004232331639807526, "phrase": "minimum_energy_e-min"}, {"score": 0.003977403701783668, "phrase": "circuit_simulation"}, {"score": 0.003939565240409143, "phrase": "analytical_modeling"}, {"score": 0.003632122667714372, "phrase": "mosfet"}, {"score": 0.0031921317979928406, "phrase": "low-v-t_mid-l-g_devices"}, {"score": 0.002942811795757911, "phrase": "good_speed_performances"}, {"score": 0.0029147869733574844, "phrase": "negligible_area"}, {"score": 0.00276534038425712, "phrase": "standard_eda_tool_flow"}, {"score": 0.002687070469080394, "phrase": "standard_cell_library"}, {"score": 0.0024652715040303416, "phrase": "strong_mitigation"}, {"score": 0.0022401855403251653, "phrase": "gate_leakage_constraints"}, {"score": 0.002187194307878705, "phrase": "short-channel_effects"}], "paper_keywords": ["Design", " Performance"], "paper_abstract": "Subthreshold operation of digital circuits enables minimum energy consumption. In this article, we observe that minimum energy E-min of subthreshold logic dramatically increases when reaching 45nm CMOS node. We demonstrate by circuit simulation and analytical modeling that this increase comes from the combined effects of variability, gate leakage, and Drain-Induced Barrier Lowering (DIBL) effect. We then investigate the new impact of individual MOSFET parameters L-g, V-t, and T-ox on E-min in sub-45nm technologies. We further propose an optimum MOSFET selection, which favors low-V-t mid-L-g devices in 45nm CMOS technology. The use of such optimum MOSFETs yields 35% E-min reduction for a benchmark multiplier with good speed performances and negligible area overhead. This optimum MOSFET selection can easily be integrated into a standard EDA tool flow by appropriate selection of the standard cell library. We finally demonstrate that undoped-channel fully-depleted Silicon-On-Insulator (SOI) technology brings 60% E-min reduction with baseline MOSFETs thanks to strong mitigation of variability and short-channel effects. This study reveals a new (a priori counterintuitive) paradigm in device optimization for subthreshold logic: relaxing gate leakage constraints to improve robustness against short-channel effects and variability. Additionally, we propose pre-Silicon BSIM4 MOSFET model cards for realistic subthreshold circuit simulations including variability in bulk and fully depleted SOI technologies, which are made available online.", "paper_title": "Nanometer MOSFET Effects on the Minimum-Energy Point of Sub-45nm Subthreshold Logic-Mitigation at Technology and Circuit Levels", "paper_id": "WOS:000284931600002"}