{"auto_keywords": [{"score": 0.048725000406690595, "phrase": "function_structure_graphs"}, {"score": 0.00481495049065317, "phrase": "conceptual_design"}, {"score": 0.004732785510739708, "phrase": "formal_representation"}, {"score": 0.004494570360108983, "phrase": "previously_published_formal_representation"}, {"score": 0.004195418010131832, "phrase": "first_place"}, {"score": 0.0036553070575015344, "phrase": "software_implementation"}, {"score": 0.0031845067058084583, "phrase": "grammar-controlled_manner"}, {"score": 0.003130077012135034, "phrase": "logical_and_physics-based_inconsistencies"}, {"score": 0.00298942278888105, "phrase": "logically_consistent_models"}, {"score": 0.002790170184447136, "phrase": "post-modeling_reasoning"}, {"score": 0.002726740692380339, "phrase": "modeled_concepts"}, {"score": 0.0021049977753042253, "phrase": "intended_reasoning"}], "paper_keywords": ["function structure", " concept modeling", " formal representation", " reasoning", " ConMod"], "paper_abstract": "This paper validates that a previously published formal representation of function structure graphs actually supports the reasoning that motivated its development in the first place. In doing so, it presents the algorithms to perform those reasoning, provides justification for the reasoning, and presents a software implementation called Concept Modeler (ConMod) to demonstrate the reasoning. Specifically, the representation is shown to support constructing function structure graphs in a grammar-controlled manner so that logical and physics-based inconsistencies are prevented in real-time, thus ensuring logically consistent models. Further, it is demonstrated that the representation can support post-modeling reasoning to check the modeled concepts against two universal principles of physics: the balance laws of mass and energy, and the principle of irreversibility. The representation in question is recently published and its internal ontological and logical consistency has been already demonstrated. However, its ability to support the intended reasoning was not validated so far, which is accomplished in this paper.", "paper_title": "Physics-Based Reasoning in Conceptual Design Using a Formal Representation of Function Structure Graphs", "paper_id": "WOS:000326185000008"}