{"auto_keywords": [{"score": 0.046491955921886964, "phrase": "digital_disc"}, {"score": 0.007070794307121891, "phrase": "ideal_regular_polygon"}, {"score": 0.00571748404620854, "phrase": "regular_polygon"}, {"score": 0.005647823452437817, "phrase": "real_plane"}, {"score": 0.005579611408032363, "phrase": "approximate_polygon"}, {"score": 0.00481495049065317, "phrase": "digital_discs_-_some_theories"}, {"score": 0.004329124434198367, "phrase": "real_disc"}, {"score": 0.003828912548622257, "phrase": "related_experiments"}, {"score": 0.003107186371289819, "phrase": "digital_discs"}, {"score": 0.0030193416820392554, "phrase": "smaller_radii"}, {"score": 0.002770389097966904, "phrase": "ideal_one"}, {"score": 0.0023903140267755576, "phrase": "pattern_matching"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["digital disc", " digital circle", " polygonal approximation", " digital geometry"], "paper_abstract": "There are several algorithms for digitization of a real disc (circle) to derive a digital disc, and also for finding the real disc corresponding to a digital disc. However, the correspondence of a digital disc with a regular polygon in the real plane is not well studied. This paper presents some theories and related experiments on setting the correspondence from a digital disc to its polygonal cover in the real plane. For an ideal regular polygon covering a digital disc, all the grid points of the digital disc should lie on and inside the polygon, and vice versa. That an ideal regular polygon corresponding to a digital disc is possible for some of the digital discs, especially for the ones having smaller radii, is shown. Further, for a disc whose ideal regular polygon is not possible, an approximate polygon, tending to the ideal one, is possible, in which the error of approximation can be controlled by the number of vertices of the approximate polygon. These ( ideal or approximate) polygonal covers of digital discs have several applications in many problems of point set pattern matching. We have reported the conditions under which an ideal regular polygon always exists corresponding to a digital disc, and the conditions under which the existence of an ideal regular polygon becomes uncertain. Experimental results have been given to demonstrate the possibilities of approximation and the trade-off in terms of error versus the number of vertices in the approximate polygon.", "paper_title": "Real Polygonal Covers of Digital Discs - Some Theories and Experiments", "paper_id": "WOS:000266583700003"}