{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_motion"}, {"score": 0.049445419527232116, "phrase": "treadmill-based_virtual_environment"}, {"score": 0.028665242444643153, "phrase": "optic_flow"}, {"score": 0.004195418010131832, "phrase": "computer-controlled_treadmill"}, {"score": 0.004121490798711703, "phrase": "wide_field"}, {"score": 0.00408501512749186, "phrase": "view_computer_graphics_display"}, {"score": 0.0038728151007982378, "phrase": "previous_work"}, {"score": 0.0036229421570951807, "phrase": "treadmill_ve"}, {"score": 0.003434662174045939, "phrase": "real_world"}, {"score": 0.0032852337992126564, "phrase": "visual_indication"}, {"score": 0.003198705576491802, "phrase": "computer_graphics"}, {"score": 0.0031422859551159506, "phrase": "biomechanical_speed"}, {"score": 0.0025605773834404253, "phrase": "essentially_the_same_magnitude"}, {"score": 0.0023845255359681143, "phrase": "forward_motion"}, {"score": 0.002200861826643147, "phrase": "recalibration_effect"}, {"score": 0.0021049977753042253, "phrase": "visual_perception"}], "paper_keywords": ["Experimentation", " Human Factors", " Treadmill virtual environments", " locomotion", " visual self-motion"], "paper_abstract": "This paper describes the use of a treadmill-based virtual environment (VE) to investigate the influence of visual motion on locomotion. First, we establish that a computer-controlled treadmill coupled with a wide field of view computer graphics display can be used to study interactions between perception and action. Previous work has demonstrated that humans recalibrate their visually directed actions to changing circumstances in their environment. Using a treadmill VE, we show that recalibration of action is reflected in the real world as a result of manipulating the relation between the visual indication of speed, presented using computer graphics, and the biomechanical speed of walking on a treadmill. We then extend this methodology to investigate whether the recalibration is based on perception of the speed of movement through the world or on the magnitude of optic flow itself. This was done by utilizing two different visual displays, which had essentially the same magnitude of optic flow, but which differed in the information present for the speed of forward motion. These results indicate that changes in optic flow are not necessary for recalibration to occur. The recalibration effect is dependent, at least in part, on visual perception of the speed of self-movement.", "paper_title": "Calibration of Locomotion Resulting from Visual Motion in a Treadmill-Based Virtual Environment", "paper_id": "WOS:000207052000004"}