{"auto_keywords": [{"score": 0.031618278413001126, "phrase": "design_knowledge"}, {"score": 0.029646929800025177, "phrase": "software_engineers"}, {"score": 0.00481495049065317, "phrase": "object-oriented_design_knowledge"}, {"score": 0.004658426838467567, "phrase": "object-oriented_design"}, {"score": 0.004506968388996092, "phrase": "great_deal"}, {"score": 0.0043194180167921165, "phrase": "object-oriented_systems"}, {"score": 0.003820144626025562, "phrase": "resultant_major_improvements"}, {"score": 0.003784209997115174, "phrase": "software_development"}, {"score": 0.0036958398682001015, "phrase": "large_body"}, {"score": 0.0033624514778823763, "phrase": "practical_use"}, {"score": 0.002931569771634119, "phrase": "good_understanding"}, {"score": 0.0028495431343111897, "phrase": "practical_work"}, {"score": 0.0021049977753042253, "phrase": "design_rationale_issues"}], "paper_keywords": ["ontology", " design knowledge", " patterns", " principles", " heuristic", " refactoring"], "paper_abstract": "After years of experience in object-oriented design, software engineers have accumulated a great deal of knowledge in the design and construction of object-oriented systems: important contribution to this field including principles, heuristics, lessons learned, bad smells, refactorings, and so on, with the resultant major improvements in software development. However, this large body of knowledge is still not well organized, its terminology is ambiguous, and it is very difficult to make practical use of the contributions made. In this regard, we believe it is important to define an ontology in order to structure and unify design knowledge, since a good understanding of the experience derived from practical work is critical for software engineers. This ontology could be used to improve communication between software engineers, inter-operability among designs, design re-usability, design knowledge searching and specification, software maintenance, knowledge acquistion, etc. In the ontology we incorporate knowledge specific to both domain and technology. such an organized body of knowledge could also be used for registering and documenting design rationale issues.", "paper_title": "An ontology for understanding and applying object-oriented design knowledge", "paper_id": "WOS:000251175700006"}