{"auto_keywords": [{"score": 0.01341557216710025, "phrase": "resource-constrained_wireless_mobile_devices"}, {"score": 0.01006696008767776, "phrase": "secret_key"}, {"score": 0.00481495049065317, "phrase": "hierarchical_secret_sharing"}, {"score": 0.004765482708043842, "phrase": "ecc_based_signcryption"}, {"score": 0.004644014990871423, "phrase": "existing_hierarchical_secret-sharing_schemes"}, {"score": 0.0038959121068990517, "phrase": "different_levels"}, {"score": 0.0036996627006622975, "phrase": "hierarchy-based_secret-sharing_scheme"}, {"score": 0.0035681790580031998, "phrase": "delegated_secret_keys"}, {"score": 0.0033883824438527316, "phrase": "computational_cost"}, {"score": 0.003201018846103988, "phrase": "signcrypted_shares"}, {"score": 0.003151736708029235, "phrase": "trusted_dealer"}, {"score": 0.0030239842475439814, "phrase": "proposed_scheme"}, {"score": 0.002841971477743441, "phrase": "active_or_passive_adversary"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["elliptic curve cryptography", " threshold secret sharing", " trusted dealer", " participant", " signcryption", " unsigncryption", " adversary"], "paper_abstract": "Most of the existing hierarchical secret-sharing schemes are unconditionally (non-cryptographically) secured, and they cannot survive from various types of attacks especially when the participants use resource-constrained wireless mobile devices. In our proposed secured hierarchical secret-sharing scheme, the participants are partitioned into different levels according to their ranks in any organization. In this hierarchy-based secret-sharing scheme, the trusted dealer distributes the delegated secret keys as shares to the participants through our proposed signcryption scheme that reduces computational cost and communication overhead. Again, the participants submit the signcrypted shares to the trusted dealer for reconstruction of the secret key. The proposed scheme distinguishes each level of hierarchy qualitatively, and any type of active or passive adversary or colluding participants cannot reconstruct the secret key. The novelty of our scheme is that it is conditionally (cryptographically) as well as unconditionally secured, and the participants may use resource-constrained wireless mobile devices. The access structure chosen for our scheme increases the resilience of our scheme. Our proposed scheme is perfect and ideal. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Secured hierarchical secret sharing using ECC based signcryption", "paper_id": "WOS:000305397100004"}