{"auto_keywords": [{"score": 0.04895586541793085, "phrase": "online_searching"}, {"score": 0.0389710828765986, "phrase": "mental_effort"}, {"score": 0.015719716506582538, "phrase": "invested_mental_effort"}, {"score": 0.015572763496023368, "phrase": "aime"}, {"score": 0.004357927940322685, "phrase": "search_tasks"}, {"score": 0.004255639740735269, "phrase": "self-efficacy_influence"}, {"score": 0.0036553070575015344, "phrase": "end_user's_search_experience"}, {"score": 0.0032456625605347417, "phrase": "dual-task_technique"}, {"score": 0.003022186855664124, "phrase": "pre-search_background_questionnaire"}, {"score": 0.0029793675408245047, "phrase": "post-search_questionnaire"}, {"score": 0.002909342017421165, "phrase": "important_findings"}, {"score": 0.002787406053363446, "phrase": "greater_mental_effort"}, {"score": 0.0027479040199262393, "phrase": "library_system"}, {"score": 0.0021971473452127126, "phrase": "search_results"}, {"score": 0.0021049977753042253, "phrase": "multiple_sources"}], "paper_keywords": ["Amount of invested mental effort", " Search effort", " Search self-efficacy", " Web searching behavior", " Search system perception"], "paper_abstract": "This research investigates how people's perceptions of information retrieval (IR) systems, their perceptions of search tasks, and their perceptions of self-efficacy influence the amount of invested mental effort (AIME) they put into using two different IR systems: a Web search engine and a library system. It also explores the impact of mental effort on an end user's search experience. To assess AIME in online searching, two experiments were conducted using these methods: Experiment 1 relied on self-reports and Experiment 2 employed the dual-task technique. In both experiments, data were collected through search transaction logs, a pre-search background questionnaire, a post-search questionnaire and an interview. Important findings are these: (1) subjects invested greater mental effort searching a library system than searching the Web; (2) subjects put little effort into Web searching because of their high sense of self-efficacy in their searching ability and their perception of the easiness of the Web; (3) subjects did not recognize that putting mental effort into searching was something needed to improve the search results; and (4) data collected from multiple sources proved to be effective for assessing mental effort in online searching. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Amount of invested mental effort (AIME) in online searching", "paper_id": "WOS:000309794000009"}