{"auto_keywords": [{"score": 0.04352789046383636, "phrase": "age-related_differences"}, {"score": 0.013114656754654975, "phrase": "older_adults"}, {"score": 0.007315181369457822, "phrase": "dynamic_formation"}, {"score": 0.007152368807539886, "phrase": "virtual_agent_facial_expressions"}, {"score": 0.00474133828958182, "phrase": "virtual_agents"}, {"score": 0.004668846211015051, "phrase": "healthcare_settings"}, {"score": 0.0045709675813472884, "phrase": "everyday_living_tasks"}, {"score": 0.004509747431318706, "phrase": "agent's_social_cues"}, {"score": 0.004481314352452142, "phrase": "emotion_recognition"}, {"score": 0.004449343553644731, "phrase": "social_interactions"}, {"score": 0.0044322337175117955, "phrase": "facial_expression"}, {"score": 0.0044298153228913666, "phrase": "virtual_agent"}, {"score": 0.004289419884432487, "phrase": "on-screen_agents"}, {"score": 0.004119313626110943, "phrase": "human_facial_expression"}, {"score": 0.004079812512034311, "phrase": "ruffman"}, {"score": 0.003955926499405168, "phrase": "negative_facial_expressions"}, {"score": 0.003940706575253453, "phrase": "previous_work"}, {"score": 0.003910441483033426, "phrase": "younger_adults"}, {"score": 0.003880407924770013, "phrase": "facial_emotions"}, {"score": 0.0037989951856280423, "phrase": "courgeon"}, {"score": 0.0037336520904376687, "phrase": "breazeal"}, {"score": 0.0035855066449812273, "phrase": "virtual_agent's_facial_emotions"}, {"score": 0.0035442655396704724, "phrase": "social_agents"}, {"score": 0.0034832884999421374, "phrase": "varying_ages"}, {"score": 0.0031691872698467118, "phrase": "virtual_character"}, {"score": 0.0030258078659594328, "phrase": "emotion_intensity"}, {"score": 0.0029967610945411593, "phrase": "facial_expressions"}, {"score": 0.0028944757265206332, "phrase": "virtual_characters"}, {"score": 0.0027902823537197356, "phrase": "configural_and_featural_processing"}, {"score": 0.0027741761880779535, "phrase": "possible_explanation"}, {"score": 0.002643513584803759, "phrase": "lower_recognition"}, {"score": 0.002548331088496964, "phrase": "age-related_difference"}, {"score": 0.0024947959375982614, "phrase": "configural_arrangement"}, {"score": 0.002485183501499, "phrase": "facial_features"}, {"score": 0.002432971714608409, "phrase": "similar_emotions"}, {"score": 0.00229164285862567, "phrase": "older_and_younger_adults"}, {"score": 0.002274013856301582, "phrase": "character_type"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Older adults", " Younger adults", " Aging", " Virtual agents", " Emotion recognition", " Emotion expression"], "paper_abstract": "As technology advances, robots and virtual agents will be introduced into the home and healthcare settings to assist individuals, both young and old, with everyday living tasks. Understanding how users recognize an agent's social cues is therefore imperative, especially in social interactions. Facial expression, in particular, is one of the most common non-verbal cues used to display and communicate emotion in on-screen agents (Cassell et al., 2000). Age is important to consider because age-related differences in emotion recognition of human facial expression have been supported (Ruffman et al., 2008), with older adults showing a deficit for recognition of negative facial expressions. Previous work has shown that younger adults can effectively recognize facial emotions displayed by agents (Bartneck and Reichenbach, 2005; Courgeon et al., 2009, 2011; Breazeal, 2003); however, little research has compared in-depth younger and older adults' ability to label a virtual agent's facial emotions, an import consideration because social agents will be required to interact with users of varying ages. If such age-related differences exist for recognition of virtual agent facial expressions, we aim to understand if those age-related differences are influenced by the intensity of the emotion, dynamic formation of emotion (i.e., a neutral expression developing into an expression of emotion through motion), or the type of virtual character differing by human-likeness. Study 1 investigated the relationship between age-related differences, the implication of dynamic formation of emotion, and the role of emotion intensity in emotion recognition of the facial expressions of a virtual agent (iCat). Study 2 examined age-related differences in recognition expressed by three types of virtual characters differing by human-likeness (non-humanoid iCat, synthetic human, and human). Study 2 also investigated the role of configural and featural processing as a possible explanation for age-related differences in emotion recognition. First, our findings show age-related differences in the recognition of emotions expressed by a virtual agent, with older adults showing lower recognition for the emotions of anger, disgust, fear, happiness, sadness, and neutral. These age-related difference might be explained by older adults having difficulty discriminating similarity in configural arrangement of facial features for certain emotions; for example, older adults often mislabeled the similar emotions of fear as surprise. Second, our results did not provide evidence for the dynamic formation improving emotion recognition; but, in general, the intensity of the emotion improved recognition. Lastly, we learned that emotion recognition, for older and younger adults, differed by character type, from best to worst: human, synthetic human, and then iCat. Our findings provide guidance for design, as well as the development of a framework of age-related differences in emotion recognition. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Younger and older users' recognition of virtual agent facial expressions", "paper_id": "WOS:000348953200001"}