{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004556901872357751, "phrase": "number_theory"}, {"score": 0.004253618550301311, "phrase": "deductive_inference"}, {"score": 0.0038802832668554457, "phrase": "higher_powers"}, {"score": 0.0034433297275344877, "phrase": "even_powers"}, {"score": 0.003334309053314909, "phrase": "odd_powers"}, {"score": 0.0030414140732789186, "phrase": "findings_-_linear_relationships"}, {"score": 0.00290473242917264, "phrase": "disorderly_chaotic_and_inconsistent_results"}, {"score": 0.0026252106881752067, "phrase": "unexplained_order"}, {"score": 0.0023400004981080818, "phrase": "random_number_generation"}, {"score": 0.002286781334850213, "phrase": "encryption_algorithms"}, {"score": 0.00226583335721762, "phrase": "routers_security"}, {"score": 0.0021049977753042253, "phrase": "findings_chaos"}], "paper_keywords": ["Cybernetics", " Chaos theory", " Number theory", " Arithmetic"], "paper_abstract": "Purpose - The purpose of this paper is to advance research that portrays chaos in number theory. Classical and quantum physics, and lately pure mathematics and system that exhibit deductive inference produced randomness and unpredictability over time. Design/methodology/approach - This paper discusses the fact that in raising numbers to higher powers, it is noticed that the scale of intensities of order and tidiness is very poor and chaos occurs mainly when numbers are raised to even powers. When numbers are raised to odd powers, the chaos is obtained still, but was able to extract order from this chaos strangely enough. Findings - Linear relationships if left to themselves long enough will eventually produce disorderly chaotic and inconsistent results. Chaos are being found where the order was thought to be found. But then, looking more closely, unexplained order is being found in what looked like chaos. Practical implications - The results of this research may be applied to develop algorithms for random number generation and also for developing encryption algorithms for routers security and privacy. Originality/value - The paper tackles one of the most unexplained phenomena where scientists are findings chaos where they thought they would find order.", "paper_title": "Extracting order from chaos", "paper_id": "WOS:000268835500011"}