{"auto_keywords": [{"score": 0.04525702858275571, "phrase": "stepper_motor"}, {"score": 0.01556384438336407, "phrase": "nonlinear_mimo_system"}, {"score": 0.012432899994376896, "phrase": "multirate_output_feedback"}, {"score": 0.00481495049065317, "phrase": "mode_control"}, {"score": 0.004509694461067052, "phrase": "discrete_sliding_mode_control_algorithm"}, {"score": 0.003916098498242888, "phrase": "physical_variable"}, {"score": 0.003576286811853861, "phrase": "differentially_flat_system"}, {"score": 0.0032989853590079153, "phrase": "endogenous_feedback"}, {"score": 0.0032006150973842846, "phrase": "linear_model"}, {"score": 0.0031366648074858555, "phrase": "multirate_output_feedback-based_discrete_sliding_mode_control"}, {"score": 0.0030431198971423937, "phrase": "discrete_sliding_mode_control"}, {"score": 0.0027788478707700274, "phrase": "proposed_algorithm"}, {"score": 0.0025374674652885354, "phrase": "second_output"}, {"score": 0.0024247382451294255, "phrase": "tau_sampling_interval"}, {"score": 0.0023642842046859274, "phrase": "acceptable_performance"}, {"score": 0.0023287359930308864, "phrase": "system_parameter_variation"}], "paper_keywords": ["quasi sliding mode", " output feedback sliding mode", " switching function", " nonlinear", " motion control", " stepper motor"], "paper_abstract": "This article, presents discrete sliding mode control algorithm using multirate output feedback for control of stepper motor. The algorithm developed by the authors uses past output samples and past control inputs. When all the states of the system are neither physical variable nor available for measurement, multirate output feedback can be used. The stepper motor is known to be a differentially flat system. The dynamics of the stepper motor are highly nonlinear, hence feedback linearization based on endogenous feedback has been used. The linear model is obtained and multirate output feedback-based discrete sliding mode control has been designed. The discrete sliding mode control with multirate output feedback has been applied for regulator as well as tracking case for the motor. The proposed algorithm uses only two outputs. It is essentially shown that first output needs to be sampled only once and second output must be sampled at least thrice in every tau sampling interval in order to achieve acceptable performance. The system parameter variation has been considered and the results obtained are found to be satisfactory. Thus, it has been shown that discrete sliding mode control algorithm using multirate output feed back can be extended to a class of nonlinear MIMO system.", "paper_title": "Discrete time output feedback sliding mode control for nonlinear MIMO system: a stepper motor case", "paper_id": "WOS:000251516400009"}