{"auto_keywords": [{"score": 0.012079642592598517, "phrase": "qos_metrics"}, {"score": 0.011739877197915059, "phrase": "causal_relationships"}, {"score": 0.011614914458774588, "phrase": "qos_metric"}, {"score": 0.010661422975679562, "phrase": "qos_metric_node"}, {"score": 0.00934108864579603, "phrase": "bn_inference"}, {"score": 0.00481495049065317, "phrase": "bayesian_network"}, {"score": 0.004746263721902201, "phrase": "quality_of_service"}, {"score": 0.004645057834614705, "phrase": "current_internet"}, {"score": 0.004595263305771512, "phrase": "best_effort"}, {"score": 0.004513450434595191, "phrase": "systematic_approach"}, {"score": 0.004481132747216135, "phrase": "end-to-end_qos_qualitative_diagnosis"}, {"score": 0.004230749292148046, "phrase": "comprehensive_manner"}, {"score": 0.003909065355459264, "phrase": "fuzzy_set"}, {"score": 0.0037845987749316632, "phrase": "continuous_numeric-value"}, {"score": 0.003611751858608048, "phrase": "qos_qualitative_diagnosis"}, {"score": 0.0032893028281789287, "phrase": "bn_nodes"}, {"score": 0.0031164983132321417, "phrase": "ordering_method"}, {"score": 0.0028689475587958917, "phrase": "bn_parameter"}, {"score": 0.0026410082462069596, "phrase": "specific_value"}, {"score": 0.0025476254812544135, "phrase": "suitable_values"}, {"score": 0.00247529638625566, "phrase": "qos_quantitative_guarantee"}, {"score": 0.002166530105679438, "phrase": "polynomial_time_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Context", " Context discretization", " QoS qualitative diagnosis", " QoS quantitative guarantee", " Bayesian network"], "paper_abstract": "To support Quality of Service (QoS) management on current Internet working with best effort, we propose a systematic approach for end-to-end QoS qualitative diagnosis and quantitative guarantee Both QoS metrics and contexts of a service are considered in a comprehensive manner in our approach, which consists of three sequential stages: context discretization. QoS qualitative diagnosis and QoS quantitative guarantee. Based on Fuzzy set, an automatic unwatched discretization algorithm for discretizing continuous numeric-value is brought forth to reshape these QoS metrics and contexts Into their discrete forms For QoS qualitative diagnosis, causal relationships between a QoS metric and its contexts are exploited with the help of K2 Bayesian network (BN) structure learning by treating QoS metrics and contexts as BN nodes. A QoS metric node is qualitatively diagnosed to be causally related to its parent context nodes An ordering method is proposed to arrange orders for nodes involved in K2 algorithm To guarantee QoS quantitatively, those causal relationships are next modeled quantitatively by BN parameter learning BN inference is referred to calculate the marginal on a QoS metric node given its tunable parent context nodes. Then, the QoS metric is guaranteed to a specific value a user demands with certain probability by tuning its causal contexts to suitable values suggested by BN inference, that is. QoS quantitative guarantee is reached by now Simulations, on a peer-to-peer (P2P) network, about the above three sequential stages are discussed and our approach is validated to be soundable and effective We also argue that our approach can be reached in a polynomial time complexity in practice. (C) 2010 Elsevier B.V. All rights reserved", "paper_title": "Context-aware end-to-end QoS qualitative diagnosis and quantitative guarantee based on Bayesian network", "paper_id": "WOS:000283643000014"}