{"auto_keywords": [{"score": 0.03626957050213274, "phrase": "ir"}, {"score": 0.010610370514248913, "phrase": "information_retrieval"}, {"score": 0.007644762949728113, "phrase": "central_concepts"}, {"score": 0.00474075475474847, "phrase": "purpose_-_the_purpose"}, {"score": 0.004122179528285764, "phrase": "conceptual_analysis"}, {"score": 0.004096635798793164, "phrase": "literature_review"}, {"score": 0.0037318666008429014, "phrase": "productive_relationship"}, {"score": 0.0035951877427580006, "phrase": "new_theoretical_insights"}, {"score": 0.003561804646511146, "phrase": "philosophical_context"}, {"score": 0.0028917056916949718, "phrase": "respective_disciplines"}, {"score": 0.0027943943921568456, "phrase": "particular_reference"}, {"score": 0.002414082940963702, "phrase": "information_science"}, {"score": 0.002289631204915149, "phrase": "similar_dilemmas"}, {"score": 0.0022194361800930516, "phrase": "conceptual_understanding"}, {"score": 0.002118149468085762, "phrase": "intractable_dilemmas"}, {"score": 0.0021050156389633068, "phrase": "ir."}], "paper_keywords": ["Philosophy", " Information theory", " Meaning", " Information retrieval"], "paper_abstract": "Purpose - The purpose of this paper is to explore the question of whether the differences between meaning in philosophy and meaning in information retrieval (IR) have implications for the use of philosophy in supporting research in IR. Design/methodology/approach - The approach takes the form of a conceptual analysis and literature review. Findings - There are some differences in the role of meaning in terms of purpose, content and use which should be clarified in order to assist a productive relationship between the philosophy of language and IR. Research limitations/implications - This provides some new theoretical insights into the philosophical context of IR. It suggests that further productive work on the central concepts within IR could be achieved through the use of a methodology which analyses how exactly these concepts are discussed in other disciplines and the implications of and, differences in the way in which they may operate in IR. Originality/value - The paper suggests a new perspective on the relationship between philosophy and IR by exploring the role of meaning in these respective disciplines and highlighting differences, as well as similarities, with particular reference to the role of information as well as meaning in IR. This contributes to an understanding of two of the central concepts in IR, meaning and information, and the ways in which they are related. There is a history of work in IR and information science (IS) examining dilemmas and the paper builds on this work by relating it to some similar dilemmas in philosophy. Thus it develops the theory and conceptual understanding of IR by suggesting that philosophy could be used as a way of exploring intractable dilemmas in IR.", "paper_title": "Meaning in philosophy and meaning in information retrieval (IR)", "paper_id": "WOS:000263619500007"}