{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personalized_government"}, {"score": 0.004764004403553372, "phrase": "-business_e-services"}, {"score": 0.004549366134876482, "phrase": "existing_e-government_services"}, {"score": 0.0044535760439663235, "phrase": "small-to-medium_businesses"}, {"score": 0.004267978415344142, "phrase": "\"_e-services"}, {"score": 0.004207840198934805, "phrase": "current_highly_competitive_markets"}, {"score": 0.004119211418949265, "phrase": "imperative_need"}, {"score": 0.004075596668736259, "phrase": "web_personalization_techniques"}, {"score": 0.004032441847334232, "phrase": "business_users"}, {"score": 0.0035740424892197155, "phrase": "trustworthy_business_partner"}, {"score": 0.003536179562674877, "phrase": "reliable_business_transactions"}, {"score": 0.003486316700608598, "phrase": "business_partner_selection_process"}, {"score": 0.0033647036658823798, "phrase": "significant_influence"}, {"score": 0.003329051037399227, "phrase": "business_user's_decision"}, {"score": 0.0028881548838751684, "phrase": "business_partner_recommendation_e-services"}, {"score": 0.0027092368768921542, "phrase": "implicit_trust_filtering_recommendation_approach"}, {"score": 0.002671230251610134, "phrase": "cf"}, {"score": 0.0024877583128884457, "phrase": "hybrid_trust-enhanced_cf_recommendation_approach"}, {"score": 0.0024094425220967273, "phrase": "enhanced_user-based_cf_recommendation"}, {"score": 0.002325306388085057, "phrase": "proposed_approaches"}, {"score": 0.0021503823972534096, "phrase": "cold-start_users"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "The information overload on the World Wide Web results in the underuse of some existing e-government services within the business domain. Small-to-medium businesses (SMBs), in particular, are seeking \"one-to-one\" e-services from government in current highly competitive markets, and there is an imperative need to develop Web personalization techniques to provide business users with information and services specific to their needs, rather than an undifferentiated mass of information. This paper focuses on how e-governments can support businesses on the problem of selecting a trustworthy business partner to perform reliable business transactions. In the business partner selection process, trust or reputation information is crucial and has significant influence on a business user's decision regarding whether or not to do business with other business entities. For this purpose, an intelligent trust-enhanced recommendation approach to provide personalized government-to-business (G2B) e-services, and in particular, business partner recommendation e-services for SMBs is proposed. Accordingly, in this paper, we develop (1) an implicit trust filtering recommendation approach and (2) an enhanced user-based collaborative filtering (CF) recommendation approach. To further exploit the advantages of the two proposed approaches, we develop (3) a hybrid trust-enhanced CF recommendation approach (TeCF) that integrates both the proposed implicit trust filtering and the enhanced user-based CF recommendation approaches. Empirical results demonstrate the effectiveness of the proposed approaches, especially the hybrid TeCF recommendation approach in terms of improving accuracy, as well as in dealing with very sparse data sets and cold-start users. (C) 2011 Wiley Periodicals, Inc.", "paper_title": "A Hybrid Trust-Enhanced Collaborative Filtering Recommendation Approach for Personalized Government-to-Business e-Services", "paper_id": "WOS:000294549800002"}