{"auto_keywords": [{"score": 0.04380528596779502, "phrase": "ic"}, {"score": 0.039667250522165014, "phrase": "ec"}, {"score": 0.00481495049065317, "phrase": "sensor_location_algorithms"}, {"score": 0.004602085616330634, "phrase": "art_gallery_problem"}, {"score": 0.004256243266481051, "phrase": "minimum_number"}, {"score": 0.0038720442355114045, "phrase": "based_rendering"}, {"score": 0.0037481999244393166, "phrase": "np"}, {"score": 0.0036553070575015344, "phrase": "finite_algorithm"}, {"score": 0.0031649018957020337, "phrase": "optimal_ec_solution"}, {"score": 0.0029509483926257645, "phrase": "approximate_ec_sensor_location_algorithms"}, {"score": 0.002607965563121546, "phrase": "reasonable_time"}, {"score": 0.002431570196486513, "phrase": "recent_incremental_ec_algorithm_show"}, {"score": 0.002276439636865258, "phrase": "new_lower_bound"}, {"score": 0.002157697367447098, "phrase": "previous_one"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Art Gallery", " Visual sensor positioning", " Visibility", " Edge Covering", " Inspection", " Surveillance"], "paper_abstract": "Locating sensors in 2D can be modelled as an Art Gallery problem. Tasks such as surveillance require observing or \"covering\" the interior of a polygon with a minimum number of sensors (IC, Interior Covering). Edge Covering (EC) is sufficient for tasks such as inspection or image based rendering. As IC, also EC is NP-hard, and no finite algorithm is known for its exact solution. A number of heuristics have been proposed for EC, but their performances with respect to optimality are unknown. Recently, a lower bound for the cardinality of the optimal EC solution, specific of a given polygon, has been proposed. It allows assessing the performances of approximate EC sensor location algorithms. In this paper, we propose a new lower bound. It is always greater than, or equal to the previous, and can be computed in reasonable time for environments with up to a few hundreds of edges. Tests over hundreds of polygons using a recent incremental EC algorithm show that the gap between the cardinality of the solution provided by the algorithm and the new lower bound is substantially reduced, and then the new lower bound outperforms the previous one. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A new lower bound for evaluating the performances of sensor location algorithms", "paper_id": "WOS:000269943800003"}