{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "turing_machines"}, {"score": 0.047106468403371696, "phrase": "turing_machine"}, {"score": 0.03851065497794083, "phrase": "mathematical_languages"}, {"score": 0.004386887374401584, "phrase": "simple_abstract_computational_devices"}, {"score": 0.003516079377293321, "phrase": "deep_investigation"}, {"score": 0.003375574760845742, "phrase": "mechanical_computations"}, {"score": 0.0029349892964423197, "phrase": "different_mathematical_languages"}, {"score": 0.0027687904688616983, "phrase": "traditional_mathematical_languages"}, {"score": 0.0027049694095434905, "phrase": "'enumerable_sets"}, {"score": 0.0026119782818898193, "phrase": "new_computational_methodology"}, {"score": 0.0024640253074497114, "phrase": "different_infinite_sets"}, {"score": 0.0021049977753042253, "phrase": "observable_deterministic_and_non-deterministic_turing_machines"}], "paper_keywords": ["theory of automatic computations", " observability of Turing machines", " relativity of mathematical languages", " infinite sets", " Sapir-Whorf thesis"], "paper_abstract": "The Turing machine is one of the simple abstract computational devices that can be used to investigate the limits of computability. In this paper, they are considered from several points of view that emphasize the importance and the relativity of mathematical languages used to describe the Turing machines A deep investigation is performed on the interrelations between mechanical computations and their mathematical descriptions emerging when a human (the researcher) starts to describe a Turing machine (the object of the study) by different mathematical languages (the instruments of investigation). Together with traditional mathematical languages using such concepts as 'enumerable sets' and 'continuum' a new computational methodology allowing one to measure the number of elements of different infinite sets is used in this paper It is shown how mathematical languages used to describe the machines limit our possibilities to observe them. In particular, notions of observable deterministic and non-deterministic Turing machines are introduced and conditions ensuring that the latter can be simulated by the former are established.", "paper_title": "Observability of Turing Machines: A Refinement of the Theory of Computation", "paper_id": "WOS:000283389700009"}