{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "integrated_leapfrogging_mode"}, {"score": 0.028360368290286656, "phrase": "integrated_leapfrogging_innovation"}, {"score": 0.019738497079095, "phrase": "technological_innovation"}, {"score": 0.0066292472835677895, "phrase": "risk_map"}, {"score": 0.004747429622531595, "phrase": "purpose_-_the_purpose"}, {"score": 0.004550469496119256, "phrase": "developing_countries"}, {"score": 0.004518442937844318, "phrase": "latecomer_enterprises"}, {"score": 0.004346266306175988, "phrase": "basic_paradigm"}, {"score": 0.00388165472334023, "phrase": "china_high-speed_railway"}, {"score": 0.0037868092509097404, "phrase": "simulation_analysis"}, {"score": 0.003746871277361436, "phrase": "system_dynamics_model"}, {"score": 0.003591272267478512, "phrase": "integrated_leapfrogging_innovation_risk"}, {"score": 0.00352835528598178, "phrase": "main_risk_variables"}, {"score": 0.003346119094502001, "phrase": "system_simulation"}, {"score": 0.0032991276152705934, "phrase": "different_variables"}, {"score": 0.003241312187060814, "phrase": "innovative_achievements"}, {"score": 0.0030306762103395842, "phrase": "first_thing"}, {"score": 0.0029565620771207003, "phrase": "contractual_relationship"}, {"score": 0.0028236828952575735, "phrase": "symmetry_principles"}, {"score": 0.0026967596578196325, "phrase": "revenue_sharing"}, {"score": 0.002521421793028698, "phrase": "reasonable_position"}, {"score": 0.0024947959375982614, "phrase": "government's_behavior"}, {"score": 0.0021654633404434623, "phrase": "risk_identification"}, {"score": 0.0021425882815624803, "phrase": "early_warning"}, {"score": 0.002127472359795555, "phrase": "risk_pre-control"}], "paper_keywords": ["China", " Railways", " Technology led strategy", " Innovation", " Developing countries", " Industrial technological innovation", " Integrated leapfrogging innovation", " Risk map", " Risk simulation"], "paper_abstract": "Purpose - The purpose of this paper is to present an integrated leapfrogging mode of technological innovation for developing countries or latecomer enterprises in a certain industrial innovation field. Furthermore, this paper discusses the basic paradigm of the integrated leapfrogging innovation, analyzes the risk in the integrated leapfrogging mode, and describes the risk map of the integrated leapfrogging mode. Finally, taking the example of the integrated leapfrogging mode of technological innovation in developing China High-speed Railway, this paper carries out the simulation analysis by employing system dynamics model. Design/methodology/approach - In order to examine the impact of the integrated leapfrogging innovation risk on innovative achievements, main risk variables need to be extracted from the process of the integrated leapfrogging innovation, based on the system simulation, relationships among different variables and the impact on innovative achievements can be obtained. Findings - To prevent the risk of the integrated leapfrogging innovation across the innovation, the first thing we need to improve is the contractual relationship, which is to be fair and reasonable, according to the symmetry principles of risks and benefits, and to achieve risk-sharing and revenue sharing, in addition, all parties must be clear about their responsibilities and interests. The second is the reasonable position of the government's behavior, and it hints that the government cannot interfere too much, and its function is to provide service and support instead of ordering. The third is that enterprises should effectively prevent the risk of the integrated leapfrogging innovation through risk identification and risk early warning and risk pre-control approach. Originality/value - A new concept of integrated leapfrogging mode of technological innovation has been put forward, and the risk map of the integrated leapfrogging mode has been described. In addition, this paper proposes some suggestions to prevent the risks of the integrated leapfrogging innovation for enterprises as a reference.", "paper_title": "Risk in integrated leapfrogging mode of technological innovation", "paper_id": "WOS:000312434100005"}