{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "correspondence_field_estimation"}, {"score": 0.004260134699483774, "phrase": "solution_space"}, {"score": 0.004089725258435817, "phrase": "spatial_neighbourhood"}, {"score": 0.003769006950727621, "phrase": "specific_form"}, {"score": 0.0037307208089736835, "phrase": "belief_propagation"}, {"score": 0.0036181717017041387, "phrase": "continuous_space"}, {"score": 0.003250238918180901, "phrase": "complex_state_spaces"}, {"score": 0.003088384809415812, "phrase": "common_state_space"}, {"score": 0.0029951555610569225, "phrase": "equal_values"}, {"score": 0.0028459677232555176, "phrase": "new_algorithm"}, {"score": 0.0028170314398963704, "phrase": "pmbp"}, {"score": 0.002479150189700726, "phrase": "new_stereo_matching_algorithm"}, {"score": 0.002367676766637248, "phrase": "recent_pm_stereo_work_and_novel_realistic_pairwise_terms"}, {"score": 0.0021049977753042253, "phrase": "sub-pixel_accuracy_level"}], "paper_keywords": ["Correspondence fields", " Belief propagation", " PatchMatch"], "paper_abstract": "PatchMatch (PM) is a simple, yet very powerful and successful method for optimizing continuous labelling problems. The algorithm has two main ingredients: the update of the solution space by sampling and the use of the spatial neighbourhood to propagate samples. We show how these ingredients are related to steps in a specific form of belief propagation (BP) in the continuous space, called max-product particle BP (MP-PBP). However, MP-PBP has thus far been too slow to allow complex state spaces. In the case where all nodes share a common state space and the smoothness prior favours equal values, we show that unifying the two approaches yields a new algorithm, PMBP, which is more accurate than PM and orders of magnitude faster than MP-PBP. To illustrate the benefits of our PMBP method we have built a new stereo matching algorithm with unary terms which are borrowed from the recent PM Stereo work and novel realistic pairwise terms that provide smoothness. We have experimentally verified that our method is an improvement over state-of-the-art techniques at sub-pixel accuracy level.", "paper_title": "PMBP: PatchMatch Belief Propagation for Correspondence Field Estimation", "paper_id": "WOS:000342448000002"}