{"auto_keywords": [{"score": 0.04278612684998393, "phrase": "support_networks"}, {"score": 0.008391617604943502, "phrase": "scientists'_advice"}, {"score": 0.00481495049065317, "phrase": "stem_networks"}, {"score": 0.004513255056769647, "phrase": "women's_science_careers"}, {"score": 0.004272724011826495, "phrase": "science_funders"}, {"score": 0.004126349202545883, "phrase": "professional_advice"}, {"score": 0.00392586404888927, "phrase": "scientific_careers"}, {"score": 0.003281186608301359, "phrase": "academic_scientists"}, {"score": 0.0032486392192981944, "phrase": "nonmedical_biology"}, {"score": 0.0031845067058084583, "phrase": "computer_science"}, {"score": 0.003121636289442593, "phrase": "atmospheric_sciences"}, {"score": 0.0030906666356950887, "phrase": "electrical_engineering"}, {"score": 0.0026480044868438875, "phrase": "primary_predictor"}, {"score": 0.0022573076362326135, "phrase": "women's_networks"}, {"score": 0.0021049977753042253, "phrase": "men's_networks"}], "paper_keywords": ["Women", " Networks", " Advice", " Support", " Field of science"], "paper_abstract": "Supporting and advancing women's science careers continues to be of interest to researchers, scientists, science funders, and universities. Similarly, professional advice and support networks are important to understanding the advancement of scientific careers. This research aims to marry these two lines of research to investigate and compare the ways in which men and women scientists seek advice and support from women in their networks. Using a sample of academic scientists in nonmedical biology, chemistry, computer science, earth and atmospheric sciences, electrical engineering, and physics we assess the extent to which women and men scientists seek advice and support from women in their networks. We find that field of science is the primary predictor for the presence of women in scientists' advice and support networks. We also find that citizenship, rank, age, and friendship are significantly related to the proportion of women in women's networks, but are not consistently significantly related to the proportion of women in men's networks. We conclude with a discussion of the findings and the distinctions between men and women scientists' advice and support networks.", "paper_title": "Women in STEM networks: who seeks advice and support from women scientists?", "paper_id": "WOS:000283090300010"}