{"auto_keywords": [{"score": 0.048842413716933694, "phrase": "weber's_law"}, {"score": 0.010111734487628529, "phrase": "timing_errors"}, {"score": 0.005695553724806439, "phrase": "temporal_information"}, {"score": 0.00481495049065317, "phrase": "prominent_finding"}, {"score": 0.004779085953614184, "phrase": "psychophysical_experiments"}, {"score": 0.004256005669252138, "phrase": "neurocomputational_models"}, {"score": 0.003861534816807933, "phrase": "information-theoretical_framework"}, {"score": 0.0038041680562514064, "phrase": "neuronal_mechanisms"}, {"score": 0.0037336520904376687, "phrase": "stochastic_processes"}, {"score": 0.0036781781340563748, "phrase": "statistical_origin"}, {"score": 0.0036235254023315798, "phrase": "time_perception"}, {"score": 0.003387431241133385, "phrase": "optimal_estimates"}, {"score": 0.003178550413662537, "phrase": "temporal_changes"}, {"score": 0.0029602552900111407, "phrase": "systematic_changes"}, {"score": 0.002665511985052972, "phrase": "temporal_correlations"}, {"score": 0.002625866440129899, "phrase": "superlinear_scaling"}, {"score": 0.002418099158357658, "phrase": "multiple_stochastic_processes"}, {"score": 0.0023554947277883535, "phrase": "covariance-based_model"}, {"score": 0.0023031224517224757, "phrase": "synfire_chains"}, {"score": 0.002251911996999611, "phrase": "existing_neurocomputational_models"}, {"score": 0.0021049977753042253, "phrase": "resulting_timing_errors"}], "paper_keywords": [""], "paper_abstract": "A prominent finding in psychophysical experiments on time perception is Weber's law, the linear scaling of timing errors with duration. The ability to reproduce this scaling has been taken as a criterion for the validity of neurocomputational models of time perception. However, the origin of Weber's law remains unknown, and currently only a few models generically reproduce it. Here, we use an information-theoretical framework that considers the neuronal mechanisms of time perception as stochastic processes to investigate the statistical origin of Weber's law in time perception and also its frequently observed deviations. Under the assumption that the brain is able to compute optimal estimates of time, we find that Weber's law only holds exactly if the estimate is based on temporal changes in the variance of the process. In contrast, the timing errors scale sublinearly with time if the systematic changes in the mean of a process are used for estimation, as is the case in the majority of time perception models, while estimates based on temporal correlations result in a superlinear scaling. This hierarchy of temporal information is preserved if several sources of temporal information are available. Furthermore, we consider the case of multiple stochastic processes and study the examples of a covariance-based model and a model based on synfire chains. This approach reveals that existing neurocomputational models of time perception can be classified as mean-, variance-and correlation-based processes and allows predictions about the scaling of the resulting timing errors.", "paper_title": "The Neural Representation of Time: An Information-Theoretic Perspective", "paper_id": "WOS:000303381000006"}