{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "camera-equipped_mobile_telephone"}, {"score": 0.004606023493393774, "phrase": "color_image_enhancement_algorithm"}, {"score": 0.0044800522651664695, "phrase": "high_quality"}, {"score": 0.004406121974246201, "phrase": "low_memory_usage"}, {"score": 0.004099542199088835, "phrase": "propagation_scheme"}, {"score": 0.00396530196547293, "phrase": "statistical_characteristics"}, {"score": 0.0037721073763702486, "phrase": "piecewise_nonlinear_transformation"}, {"score": 0.002987463078971627, "phrase": "exponent_function"}, {"score": 0.0028260302580927856, "phrase": "pixel_values"}, {"score": 0.0026584843838039166, "phrase": "optimal_strategies"}, {"score": 0.00262910358108176, "phrase": "fast_processing"}, {"score": 0.002585638506308606, "phrase": "code_style"}, {"score": 0.0021285340816566906, "phrase": "traditional_contrast_enhancement_methods"}, {"score": 0.0021049977753042253, "phrase": "higher_image_quality"}], "paper_keywords": [""], "paper_abstract": "We present in this paper a color image enhancement algorithm with high speed, high quality, and low memory usage for the camera-equipped mobile telephone. To achieve this, we first introduce a propagation scheme that estimates and computes the statistical characteristics of an image, then we apply a piecewise nonlinear transformation in the R/G/B channels separately. If the value of a pixel is below minimum or above maximum, it can be ignored by using range stretching, then a narrow intensity range between minimum and maximum may be expanded to a much broader range defined by an exponent function, which consists of mean and variance of the pixel values, and its power is chosen by the trials. The optimal strategies for fast processing in the code style are also discussed. We demonstrate our color image enhancement system and compare it with other feasible techniques on the camera-equipped mobile telephone. ne proposed algorithm can be carried out in about 2 seconds using the ARM7 processor and generally performs much better than traditional contrast enhancement methods with higher image quality.", "paper_title": "A new color image enhancement algorithm for camera-equipped mobile telephone", "paper_id": "WOS:000242122000076"}