{"auto_keywords": [{"score": 0.043300202446082514, "phrase": "wikipedia"}, {"score": 0.015073973913199248, "phrase": "medi"}, {"score": 0.013668093479358157, "phrase": "medlineplus"}, {"score": 0.007821769723936957, "phrase": "medi-hps"}, {"score": 0.00481495049065317, "phrase": "ensemble_resource"}, {"score": 0.004647911247507267, "phrase": "computable_medication_indication_resource"}, {"score": 0.004550469496119256, "phrase": "primary_and_secondary_use"}, {"score": 0.004518442937844318, "phrase": "electronic_medical_records"}, {"score": 0.004078502325220629, "phrase": "medi."}, {"score": 0.004035500442527029, "phrase": "natural_language_processing_and_ontology_relationships"}, {"score": 0.003773449694108617, "phrase": "unified_medical_language_system"}, {"score": 0.0034543031591181546, "phrase": "manual_review"}, {"score": 0.0034057975804778293, "phrase": "dual-physician_review"}, {"score": 0.003322540556404882, "phrase": "medication-indication_pairs"}, {"score": 0.0032527939106509946, "phrase": "high_precision"}, {"score": 0.003229870860371533, "phrase": "results_medi"}, {"score": 0.0031286936417685178, "phrase": "largest_resource"}, {"score": 0.0026967596578196325, "phrase": "medi_high-precision_subset"}, {"score": 0.0023325586335885104, "phrase": "estimated_precision"}, {"score": 0.0022835460368487233, "phrase": "conclusions_medi"}, {"score": 0.0021731423856364003, "phrase": "billing_codes"}, {"score": 0.0021350169717509714, "phrase": "clinical_emr_applications"}, {"score": 0.0021049977753042253, "phrase": "emr_data"}], "paper_keywords": ["medication indications", " electronic medical records", " Terminology", " International Classification of Diseases", " Unified Medical Language System", " Ontology"], "paper_abstract": "Objective To create a computable MEDication Indication resource (MEDI) to support primary and secondary use of electronic medical records (EMRs). Materials and methods We processed four public medication resources, RxNorm, Side Effect Resource (SIDER) 2, MedlinePlus, and Wikipedia, to create MEDI. We applied natural language processing and ontology relationships to extract indications for prescribable, single-ingredient medication concepts and all ingredient concepts as defined by RxNorm. Indications were coded as Unified Medical Language System (UMLS) concepts and International Classification of Diseases, 9th edition (ICD9) codes. A total of 689 extracted indications were randomly selected for manual review for accuracy using dual-physician review. We identified a subset of medication-indication pairs that optimizes recall while maintaining high precision. Results MEDI contains 3112 medications and 63343 medication-indication pairs. Wikipedia was the largest resource, with 2608 medications and 34911 pairs. For each resource, estimated precision and recall, respectively, were 94% and 20% for RxNorm, 75% and 33% for MedlinePlus, 67% and 31% for SIDER 2, and 56% and 51% for Wikipedia. The MEDI high-precision subset (MEDI-HPS) includes indications found within either RxNorm or at least two of the three other resources. MEDI-HPS contains 13304 unique indication pairs regarding 2136 medications. The mean +/- SD number of indications for each medication in MEDI-HPS is 6.22 +/- 6.09. The estimated precision of MEDI-HPS is 92%. Conclusions MEDI is a publicly available, computable resource that links medications with their indications as represented by concepts and billing codes. MEDI may benefit clinical EMR applications and reuse of EMR data for research.", "paper_title": "Development and evaluation of an ensemble resource linking medications to their indications", "paper_id": "WOS:000323168200022"}