{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wireless_broadcasting"}, {"score": 0.00465944657565638, "phrase": "wireless_broadcasting_algorithm"}, {"score": 0.004153520149706423, "phrase": "comparative_analysis"}, {"score": 0.004063547375196532, "phrase": "existing_algorithms"}, {"score": 0.003910740988145338, "phrase": "simulation_experiments"}, {"score": 0.003622088701900472, "phrase": "specific_strategies"}, {"score": 0.0032819448594643853, "phrase": "routing_protocols"}, {"score": 0.0031584367879334114, "phrase": "path_discovery"}, {"score": 0.002877438939246423, "phrase": "second_part"}, {"score": 0.002536534348967786, "phrase": "vehicular_broadcasting_applications"}, {"score": 0.0024679299547216956, "phrase": "strip_broadcasting_retransmission_strategy"}, {"score": 0.0023749823753904204, "phrase": "one-dimensional_problem"}, {"score": 0.002260591903283384, "phrase": "analysis_and_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Broadcasting", " Flooding"], "paper_abstract": "This article defines a wireless broadcasting algorithm as having two components: a retransmission strategy and a backoff strategy. Several strategies are proposed in this article and a comparative analysis is presented between existing algorithms and the strategies proposed herein. Simulation experiments and analysis are used to study or demonstrate the properties and performance of specific strategies or to obtain results of a more general nature. Strategies are also evaluated with respect to their impact on routing protocols that rely on broadcasting to perform path discovery. The purpose of this evaluation is to determine which strategies result in more stable routes. The second part of this article analyzes the problem of broadcasting when nodes are assumed to be arranged on a strip. Such arrangement occurs in vehicular broadcasting applications. We present the Strip Broadcasting retransmission strategy that can be modeled as a one-dimensional problem to significantly reduce the number of retransmissions. Analysis and simulation results are presented to analyze the properties of the algorithm. Published by Elsevier B.V.", "paper_title": "Retransmission and backoff strategies for wireless broadcasting", "paper_id": "WOS:000270318600006"}