{"auto_keywords": [{"score": 0.04052239468631479, "phrase": "power_consumption"}, {"score": 0.00481495049065317, "phrase": "fault-tolerant_distributed_embedded_computing"}, {"score": 0.004654210559456924, "phrase": "efficient_technique"}, {"score": 0.004448169552315403, "phrase": "processing_units"}, {"score": 0.004373267443572639, "phrase": "grid_network"}, {"score": 0.004299621153829837, "phrase": "driver_application"}, {"score": 0.004156012879026324, "phrase": "medical_jacket"}, {"score": 0.004039995317682942, "phrase": "extremely_high_level"}, {"score": 0.0037532257703888315, "phrase": "key_technological_constraint"}, {"score": 0.0033511469200347907, "phrase": "accidental_damage"}, {"score": 0.0027480831196871093, "phrase": "sensor_networks"}, {"score": 0.0026864540069792275, "phrase": "fault_tolerance"}], "paper_keywords": ["Algorithms", " Management", " Performance", " Design", " Reliability", " Distributed embedded system", " fault tolerance", " placement", " routing", " sensor networks"], "paper_abstract": "This article presents an efficient technique for placement and routing of sensors/actuators and processing units in a grid network. The driver application that we present is a medical jacket, which requires an extremely high level of robustness and fault tolerance. The power consumption of such jacket is another key technological constraint. Our proposed interconnection network is a mesh of wires. A jacket made of fabric and wires would be susceptible to accidental damage via tears. By modeling the tears, we evaluate the probability of having failures on every segment of wires in our mesh interconnection network. Then, we study two problems of placement and routing in the sensor networks such that the fault tolerance is maximized while the power consumption is minimized. We develop efficient integer linear programming (ILP) formulations to address these problems and perform both placement and routing, simultaneously. This ensures that the solution is a lower bound for both problems. We evaluate the effectiveness of our proposed techniques on a variety of benchmarks.", "paper_title": "An Efficient Placement and Routing Technique for Fault-Tolerant Distributed Embedded Computing", "paper_id": "WOS:000269273800004"}