{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "programmable_ecosystem"}, {"score": 0.01198888986305041, "phrase": "mashups"}, {"score": 0.008611198629853746, "phrase": "social_tags"}, {"score": 0.0045370785151713396, "phrase": "web_sites"}, {"score": 0.004483450050677258, "phrase": "online_social_networks"}, {"score": 0.004404188306112211, "phrase": "important_forms"}, {"score": 0.004352123742308589, "phrase": "web-based_applications"}, {"score": 0.0034101316738399203, "phrase": "complete_analysis"}, {"score": 0.0033497809969621267, "phrase": "integration_patterns"}, {"score": 0.003009390313137981, "phrase": "crucial_components"}, {"score": 0.002903771635043968, "phrase": "usage_patterns"}, {"score": 0.002852356597632014, "phrase": "api_and_mashup_applications"}, {"score": 0.002801849371896573, "phrase": "network_analysis"}, {"score": 0.002719644855867468, "phrase": "comprehensive_analysis"}, {"score": 0.002371424085814217, "phrase": "hybrid_integration_patterns"}], "paper_keywords": ["Programmable ecosystem", " API", " Mashup", " Network analysis", " Social tags", " Semantic cohesive"], "paper_abstract": "During recent years, APIs provided by Web sites and online social networks have become important forms for Web-based applications due to their popularity, availability, programmability and composability. While many efforts have been made to investigate, analyze, and navigate the programmable ecosystem consisting of APIs and Mashups (i.e., composite services derived from APIs), a complete analysis of the integration patterns of APIs/Mashups is still lacking. To address such an issue, we introduce various network models by considering social tags as crucial components in exploiting the integration or usage patterns for both API and Mashup applications. With network analysis, we present a comprehensive analysis of the programmable ecosystem in which all the Web APIs and Mashups can be covered. In particular, we explore Mashups in the programmable ecosystem exhibiting hybrid integration patterns, where they not only compose APIs but also largely integrate other real-life applications. Our experiments and analysis highlight a more comprehensive analysis of the programmable ecosystem than do the current state-of-the-art studies.", "paper_title": "Mining Integration Patterns of Programmable Ecosystem with Social Tags", "paper_id": "WOS:000339887600005"}