{"auto_keywords": [{"score": 0.04619510703749344, "phrase": "mobile_device"}, {"score": 0.00481495049065317, "phrase": "mobile_devices"}, {"score": 0.004772367030970874, "phrase": "hand_gesture_recognition"}, {"score": 0.004646852519870358, "phrase": "innovative_biometric_technique"}, {"score": 0.004386063799793622, "phrase": "gesture_recognition"}, {"score": 0.003543273649210823, "phrase": "sequence_alignment"}, {"score": 0.003465350958971198, "phrase": "slight_differences"}, {"score": 0.003299880298525127, "phrase": "biometric_technique"}, {"score": 0.003128336741911927, "phrase": "real_falsifications"}, {"score": 0.0031006232333900055, "phrase": "equal_error_rates"}, {"score": 0.002952516738708181, "phrase": "active_impostor_attack"}, {"score": 0.0028875481626754696, "phrase": "permanence_evaluation"}, {"score": 0.0021620042653528846, "phrase": "published_studies"}], "paper_keywords": ["Biometrics", " Hand gesture recognition", " Mobile", " Security", " Sequence alignment", " Accelerometer"], "paper_abstract": "This article proposes an innovative biometric technique based on the idea of authenticating a person on a mobile device by gesture recognition. To accomplish this aim, a user is prompted to be recognized by a gesture he/she performs moving his/her hand while holding a mobile device with an accelerometer embedded. As users are not able to repeat a gesture exactly in the air, an algorithm based on sequence alignment is developed to correct slight differences between repetitions of the same gesture. The robustness of this biometric technique has been studied within 2 different tests analyzing a database of 100 users with real falsifications. Equal Error Rates of 2.01 and 4.82% have been obtained in a zero-effort and an active impostor attack, respectively. A permanence evaluation is also presented from the analysis of the repetition of the gestures of 25 users in 10 sessions over a month. Furthermore, two different gesture databases have been developed: one made up of 100 genuine identifying 3-D hand gestures and 3 impostors trying to falsify each of them and another with 25 volunteers repeating their identifying 3-D hand gesture in 10 sessions over a month. These databases are the most extensive in published studies, to the best of our knowledge.", "paper_title": "Authentication in mobile devices through hand gesture recognition", "paper_id": "WOS:000303880600001"}