{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ssrn"}, {"score": 0.004781116882224352, "phrase": "pmc"}, {"score": 0.004747429622531595, "phrase": "formal_scholarly_communication"}, {"score": 0.0044237033788643715, "phrase": "social_science_research_network"}, {"score": 0.004195418010131832, "phrase": "previous_study"}, {"score": 0.004049783994776266, "phrase": "academic_publications"}, {"score": 0.003773449694108617, "phrase": "scopus_publications"}, {"score": 0.0035159043158639633, "phrase": "random_sample"}, {"score": 0.0031845067058084583, "phrase": "substantial_citations"}, {"score": 0.0030738557655525913, "phrase": "interdisciplinary_uses"}, {"score": 0.0028437313714204087, "phrase": "substantial_numbers"}, {"score": 0.002575526825728026, "phrase": "published_version"}, {"score": 0.0024947959375982614, "phrase": "repository_version"}, {"score": 0.0024772013657695896, "phrase": "practical_implications"}, {"score": 0.0023491282852109757, "phrase": "institutional_repositories"}, {"score": 0.00232431758517087, "phrase": "research_managers"}, {"score": 0.0021425882815624803, "phrase": "first_simultaneous_analysis"}, {"score": 0.002127472359795555, "phrase": "scopus_citations"}], "paper_keywords": ["Open access", " Citations", " Scholarly communication", " ArXiv", " RePEc", " SSRN", " PMC", " Scopus", " Subject repositories"], "paper_abstract": "Purpose - The four major Subject Repositories (SRs), arXiv, Research Papers in Economics (RePEc), Social Science Research Network (SSRN) and PubMed Central (PMC), are all important within their disciplines but no previous study has systematically compared how often they are cited in academic publications. In response, the purpose of this paper is to report an analysis of citations to SRs from Scopus publications, 2000-2013. Design/methodology/approach - Scopus searches were used to count the number of documents citing the four SRs in each year. A random sample of 384 documents citing the four SRs was then visited to investigate the nature of the citations. Findings - Each SR was most cited within its own subject area but attracted substantial citations from other subject areas, suggesting that they are open to interdisciplinary uses. The proportion of documents citing each SR is continuing to increase rapidly, and the SRs all seem to attract substantial numbers of citations from more than one discipline. Research limitations/implications - Scopus does not cover all publications, and most citations to documents found in the four SRs presumably cite the published version, when one exists, rather than the repository version. Practical implications - SRs are continuing to grow and do not seem to be threatened by institutional repositories and so research managers should encourage their continued use within their core disciplines, including for research that aims at an audience in other disciplines. Originality/value - This is the first simultaneous analysis of Scopus citations to the four most popular SRs.", "paper_title": "The role of arXiv, RePEc, SSRN and PMC in formal scholarly communication", "paper_id": "WOS:000366468500001"}