{"auto_keywords": [{"score": 0.03275741841320617, "phrase": "green_ir_systems"}, {"score": 0.00791457251324997, "phrase": "environmental_impact"}, {"score": 0.007118446737305758, "phrase": "key_role"}, {"score": 0.00481495049065317, "phrase": "green_information_retrieval_research"}, {"score": 0.004742379087286591, "phrase": "information_retrieval_systems"}, {"score": 0.004303023184313407, "phrase": "extensive_use"}, {"score": 0.004174220694700258, "phrase": "increasing_use"}, {"score": 0.0040987896316698495, "phrase": "greenhouse_gas"}, {"score": 0.004073950045744969, "phrase": "ghg"}, {"score": 0.003964007795174772, "phrase": "harmful_gases"}, {"score": 0.0038805454197432337, "phrase": "sustainable_development"}, {"score": 0.0037873013080596137, "phrase": "major_area"}, {"score": 0.0034361227353612456, "phrase": "appropriate_use"}, {"score": 0.0034153027271375627, "phrase": "ict"}, {"score": 0.003373984423727724, "phrase": "overall_ghg_emissions"}, {"score": 0.0032828706086018133, "phrase": "green_it"}, {"score": 0.0032629585038738856, "phrase": "cloud_computing"}, {"score": 0.0029965060407413898, "phrase": "overall_environmental_impact"}, {"score": 0.0027769919995947676, "phrase": "digital_information"}, {"score": 0.002685558057339722, "phrase": "systematic_research"}, {"score": 0.0025892330566358503, "phrase": "major_challenges"}, {"score": 0.002481200970201421, "phrase": "energy_consumption"}, {"score": 0.002406799309495983, "phrase": "ir_system"}, {"score": 0.002320449502337321, "phrase": "green_ir_viz"}, {"score": 0.0022647616831306563, "phrase": "green"}, {"score": 0.0021503542912161243, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Green IR", " Cloud computing", " Information retrieval", " Green IT", " Environmental sustainability", " Sustainable development"], "paper_abstract": "Nowadays we use information retrieval systems and services as part of our many day-to-day activities ranging from a web and database search to searching for various digital libraries, audio and video collections/services, and so on. However, IR systems and services make extensive use of ICT (information and communication technologies) and increasing use of ICT can significantly increase greenhouse gas (GHG, a term used to denote emission of harmful gases in the atmosphere) emissions. Sustainable development, and more importantly environmental sustainability, has become a major area of concern of various national and international bodies and as a result various initiatives and measures are being proposed for reducing the environmental impact of industries, businesses, governments and institutions. Research also shows that appropriate use of ICT can reduce the overall GHG emissions of a business, product or service. Green IT and cloud computing can play a key role in reducing the environmental impact of ICT. This paper proposes the concept of Green IR systems and services that can play a key role in reducing the overall environmental impact of various ICT-based services in education and research, business, government, etc., that are increasingly being reliant on access and use of digital information. However, to date there has not been any systematic research towards building Green IR systems and services. This paper points out the major challenges in building Green IR systems and services, and two different methods are proposed for estimating the energy consumption, and the corresponding GHG emissions, of an IR system or service. This paper also proposes the four key enablers of a Green IR viz. Standardize, Share, Reuse and Green behavior. Further research required to achieve these for building Green IR systems and services are also mentioned. Crown Copyright (C) 2012 Published by Elsevier Ltd. All rights reserved.", "paper_title": "An agenda for green information retrieval research", "paper_id": "WOS:000309794000004"}