{"auto_keywords": [{"score": 0.031069160228338562, "phrase": "information_technology"}, {"score": 0.011620455120000067, "phrase": "high_school_students"}, {"score": 0.011418269413288152, "phrase": "guidance_counselors"}, {"score": 0.00481495049065317, "phrase": "high_school_level"}, {"score": 0.0044272138900038095, "phrase": "computing_majors"}, {"score": 0.004311352359122141, "phrase": "prior_experience"}, {"score": 0.004143196873246147, "phrase": "field-based_job_opportunities"}, {"score": 0.003894512634265439, "phrase": "new_subjects"}, {"score": 0.003660700128133065, "phrase": "summer_program"}, {"score": 0.003365598242636633, "phrase": "related_fields"}, {"score": 0.003335948601271999, "phrase": "specifically_information_technology"}, {"score": 0.0032919615578986816, "phrase": "summer_enrichment_experience"}, {"score": 0.003080548510001051, "phrase": "professional_development"}, {"score": 0.0028446460307503343, "phrase": "students'_attitudes"}, {"score": 0.002361923085067681, "phrase": "teachers'_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information technology", " Summer workshop", " STEM assessment", " K-12"], "paper_abstract": "Research indicates that students often opt out of computing majors due to a lack of prior experience in computing and a lack of knowledge of field-based job opportunities. In addition, it has been found that students respond positively to new subjects when teachers and counselors are enthusiastic and knowledgeable about the area. The summer program described here is designed to improve high school students, teachers and guidance counselors understanding of the opportunities available in computing related fields, specifically information technology through a summer enrichment experience. The hypothesis of this work is that by exposing teachers and counselors to professional development in this field, their attitudes, beliefs and knowledge regarding information technology will be enhanced, thus impacting students' attitudes (both attending the program and beyond) with respect to information technology and their desire to pursue degrees in this area. Results indicate that the design of this summer program enhanced the knowledge and interest of high school students with respect to information technology. Teachers' knowledge was also positively influenced. Further refinements are necessary in the design of this program to improve the experiences of guidance counselors. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Computing at the high school level: Changing what teachers and students know and believe", "paper_id": "WOS:000292437400034"}