{"auto_keywords": [{"score": 0.04964476939947721, "phrase": "integrated_care"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_information"}, {"score": 0.004614483128885678, "phrase": "diabetes_disease_registers"}, {"score": 0.00453113241842654, "phrase": "electronic_health_records"}, {"score": 0.004395532072377065, "phrase": "clinical_decision_support"}, {"score": 0.00436890075128947, "phrase": "patient_registers"}, {"score": 0.004199670318539555, "phrase": "translational_research"}, {"score": 0.004136333933790974, "phrase": "ehr-derived_data_product_creators"}, {"score": 0.004073948834684065, "phrase": "patient_data"}, {"score": 0.004000322474812552, "phrase": "diverse_sources"}, {"score": 0.003857022173615399, "phrase": "ontological_multi-attribute_approach"}, {"score": 0.0036627245728600073, "phrase": "australian_best_practice_guidelines"}, {"score": 0.003333182329983738, "phrase": "domain_ontology"}, {"score": 0.0033129660760880383, "phrase": "snomed_ct-au._accuracy"}, {"score": 0.003223494720348768, "phrase": "varying_sizes"}, {"score": 0.00291555613737437, "phrase": "reason_for_visit"}, {"score": 0.0027101925966844117, "phrase": "improved_accuracy"}, {"score": 0.002677396270783542, "phrase": "sample_size"}, {"score": 0.0026209522797963447, "phrase": "manual_validation"}, {"score": 0.002534642970039115, "phrase": "multiple_data_elements"}, {"score": 0.0024963543716522087, "phrase": "ontology-based_case-finding_algorithms"}, {"score": 0.002414138203828421, "phrase": "suboptimal_data_quality"}, {"score": 0.0022923586577645143, "phrase": "clinical_and_pragmatic_application"}, {"score": 0.002264607102799332, "phrase": "ehr_data"}, {"score": 0.0021966859554037174, "phrase": "better_use"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Case finding", " Integration", " Patient register", " EHR", " Ontology", " Knowledge engineering"], "paper_abstract": "Background: Information in Electronic Health Records (EHRs) are being promoted for use in clinical decision support, patient registers, measurement and improvement of integration and quality of care, and translational research. To do this EHR-derived data product creators need to logically integrate patient data with information and knowledge from diverse sources and contexts. Objective: To examine the accuracy of an ontological multi-attribute approach to create a Type 2 Diabetes Mellitus (T2DM) register to support integrated care. Methods: Guided by Australian best practice guidelines, the T2DM diagnosis and management ontology was conceptualized, contextualized and validated by clinicians; it was then specified, formalized and implemented. The algorithm was standardized against the domain ontology in SNOMED CT-AU. Accuracy of the implementation was measured in 4 datasets of varying sizes (927-12,057 patients) and an integrated dataset (23,793 patients). Results were cross-checked with sensitivity and specificity calculated with 95% confidence intervals. Results: Incrementally integrating Reason for Visit (RFV), medication (Rx), and pathology in the algorithm identified nearly100% of T2DM cases. Incrementally integrating the four datasets improved accuracy; controlling for sample size, data incompleteness and duplicates. Manual validation confirmed the accuracy of the algorithm. Conclusion: Integrating multiple data elements within an EHR using ontology-based case-finding algorithms can improve the accuracy of the diagnosis and compensate for suboptimal data quality, and hence creating a dataset that is more fit-for-purpose. This clinical and pragmatic application of ontologies to EHR data improves the integration of data and the potential for better use of data to improve the quality of care. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Integrating electronic health record information to support integrated care: Practical application of ontologies to improve the accuracy of diabetes disease registers", "paper_id": "WOS:000347277000037"}