{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "magics"}, {"score": 0.00416478405812793, "phrase": "wireless_application_protocol"}, {"score": 0.003968112038249246, "phrase": "mobile_agents"}, {"score": 0.0035082436540296406, "phrase": "mobile_commerce"}, {"score": 0.0034168317227203206, "phrase": "mobile_agent"}, {"score": 0.003284145698220425, "phrase": "digital_marketspace"}, {"score": 0.0031845067058084583, "phrase": "physical_marketplace"}, {"score": 0.0029161225023394363, "phrase": "mathematical_model"}, {"score": 0.0028778584739756786, "phrase": "multiple_decision_factors"}, {"score": 0.0028151944356239952, "phrase": "basic_functions"}, {"score": 0.0027782510491938315, "phrase": "mobile_agent-based_internet_commerce_system"}, {"score": 0.002670296619878048, "phrase": "prototype_system"}, {"score": 0.0026121403051734744, "phrase": "average_cost"}, {"score": 0.0024130437638400404, "phrase": "analytical_model"}, {"score": 0.002258745901862197, "phrase": "real_price_information"}, {"score": 0.0021518875024104244, "phrase": "valuable_insights"}, {"score": 0.0021049977753042253, "phrase": "mobile_agent-based_shopping_applications"}], "paper_keywords": ["e-commerce", " internet", " mobile agents"], "paper_abstract": "We present MAGICS, a mobile agent-based system for supporting business-to-consumer electronic commerce (e-commerce) or mobile commerce (m-commerce) applications. To use the system, consumers first provide their buying requirements to a proxy/agent server through a Web browser or a wireless application protocol (WAP) terminal. Having obtained the requirements, mobile agents are generated to carry out tasks for the consumers including getting offers from merchants, evaluating offers, and even completing purchases. In the case of mobile commerce, consumers can generate a mobile agent to conduct a search and evaluation in the digital marketspace before making a purchase in the physical marketplace. To make it possible to choose an offer that best satisfies the consumer's requirement(s), we present a mathematical model for evaluating multiple decision factors. To test the basic functions of the mobile agent-based Internet commerce system (MAGICS), we have built a prototype system. To minimize the average cost of a product (including the cost of sending agents), we have also developed an analytical model that can determine how many agents should be sent to compare prices. Four different price distributions and some real price information are analyzed based on the model. The analysis provides valuable insights into the design of mobile agent-based shopping applications for m-commerce, in particular, and for e-commerce, in general.", "paper_title": "Business-to-consumer mobile agent-based Internet commerce system (MAGICS)", "paper_id": "WOS:000250395300009"}