{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information_systems_strategy"}, {"score": 0.004759399712278451, "phrase": "measurement"}, {"score": 0.004088807948906792, "phrase": "perspective_paradigm"}, {"score": 0.004039576329942698, "phrase": "strategic_management_literature"}, {"score": 0.003954837422946628, "phrase": "organizational_perspective"}, {"score": 0.003767738552860633, "phrase": "systematic_literature_search"}, {"score": 0.0033681627448832996, "phrase": "business_strategy"}, {"score": 0.0032775342939895358, "phrase": "master_plan"}, {"score": 0.003150900886669123, "phrase": "shared_view"}, {"score": 0.0030475670155080247, "phrase": "third_conception"}, {"score": 0.002816556934231128, "phrase": "shared_perspective"}, {"score": 0.002724157916806019, "phrase": "strategic_typology"}, {"score": 0.0026994870713082063, "phrase": "organization's_is_strategy"}, {"score": 0.002487240194265389, "phrase": "new_typology"}, {"score": 0.0024423826953133844, "phrase": "proposed_instrument"}, {"score": 0.002376605162340897, "phrase": "chief_information_officers"}, {"score": 0.0023622296334998324, "phrase": "senior_business_executives"}, {"score": 0.002298605785178457, "phrase": "diagnostic_tool"}, {"score": 0.002169848044716866, "phrase": "theoretical_and_practical_implications"}, {"score": 0.0021436720821474973, "phrase": "current_level"}, {"score": 0.0021049977753042253, "phrase": "extant_studies"}], "paper_keywords": ["IS strategy", " IS strategic alignment", " strategic IS planning", " competitive advantage"], "paper_abstract": "Information systems strategy is of central importance to IS practice and research. Our extensive review of the literature suggests that the concept of IS strategy is a term that is used readily; however, it is also a term that is not fully understood. In this study, we fallow a perspective paradigm based on the strategic management literature to define IS strategy as an organizational perspective on the investment in, deployment, use, and management of IS. Through a systematic literature search, we identify the following three conceptions of IS strategy employed implicitly in 48 articles published in leading IS journals that focus on the construct of IS strategy: (1) IS strategy as the use of IS to support business strategy; (2) IS strategy as the master plan of the IS function; and (3) IS strategy as the shared view of the IS role within the organization. We find the third conception best fits our definition of IS strategy. As such, we consequently propose to operationalize IS strategy as the degree to which the organization has a shared perspective to seek innovation through IS. Specifically, our proposed IS strategic typology suggests an organization's IS strategy falls into one of the two defined categories (i.e., IS innovator or IS conservative) or is simply undefined. We also develop measures for this new typology. We argue that the proposed instrument, which was cross-validated across both chief information officers and senior business executives, has the potential to serve as a diagnostic tool through which the organization can directly assess its IS strategy. We contend that our reconceptualization and operationalization of IS strategy provides theoretical and practical implications that advance the current level of understanding of IS strategy from extant studies within three predominant literature streams: strategic IS planning, IS/business strategic alignment, and competitive use of IS.", "paper_title": "INFORMATION SYSTEMS STRATEGY: RECONCEPTUALIZATION, MEASUREMENT, AND IMPLICATIONS", "paper_id": "WOS:000278200600003"}