{"auto_keywords": [{"score": 0.038899833657713954, "phrase": "standard-setting_events"}, {"score": 0.015719716506582538, "phrase": "standard-setting_initiative"}, {"score": 0.004779406424192843, "phrase": "shareholder's_risk_and_return._firms"}, {"score": 0.004639822587124109, "phrase": "information_technology_standards"}, {"score": 0.004537804310268607, "phrase": "firm's_individual_risk"}, {"score": 0.004324361008753555, "phrase": "capital_market"}, {"score": 0.004136221184894985, "phrase": "total_risk"}, {"score": 0.00407533728096378, "phrase": "individual_firm's_shareholders"}, {"score": 0.0038263829059336564, "phrase": "risk_profiles"}, {"score": 0.003784049616066444, "phrase": "group_members"}, {"score": 0.003360527337581911, "phrase": "firm_size"}, {"score": 0.003074197032561992, "phrase": "risk-adjusted_abnormal_return"}, {"score": 0.002875529792120695, "phrase": "idiosyncratic_risk"}, {"score": 0.002791393223133408, "phrase": "firm_returns"}, {"score": 0.0026697693423477727, "phrase": "large_standardization_group"}, {"score": 0.002620666087191234, "phrase": "abnormal_returns"}, {"score": 0.0024879169065840493, "phrase": "market_risks"}, {"score": 0.0024603551979225195, "phrase": "idiosyncratic_risks"}, {"score": 0.002335707508067455, "phrase": "smaller_group"}, {"score": 0.0021206948586186903, "phrase": "standardization_strategy"}, {"score": 0.0021049977753042253, "phrase": "shareholder_risks"}], "paper_keywords": ["Standard", " standardization", " standard-setting", " event study", " returns on IT investment", " risk of IT investment"], "paper_abstract": "Firms often collaborate with other firms to set information technology standards in order to decrease each firm's individual risk. But does this work? We propose that, in a capital market setting, establishing standards in a group does not decrease the total risk laced by an individual firm's shareholders. However, the market risky its investors lace decrease and idiosyncratic risks increase, changing the risk profiles of the group members. We collected data on standard-setting events from 1996 to 2005. In our dataset, a firm obtained a 4.07 percent, three-day cumulative risk-adjusted return on stock price when engaging in a standard-setting initiative, after controlling event year, firm size, and group size. More importantly, we found that an increase in the number of firms in the group decreased the risk-adjusted abnormal return and the market risk (as measured by beta) of each firm, but increased the idiosyncratic risk (as measured by the variance of firm returns). Our findings suggest that firms electing to participate in a large standardization group obtain a reduction in abnormal returns on stocks on the days of the standard-setting events. They also expect to reduce market risks but increase idiosyncratic risks after the standard-setting events, as compared to firms choosing to participate in a smaller group or attempting to standardize their products unilaterally. This study contributes to the literature on IT standards and standardization, and expands our understanding of the implications of standardization strategy on shareholder risks.", "paper_title": "THE MORE, THE MERRIER? HOW THE NUMBER OF PARTNERS IN A STANDARD-SETTING INITIATIVE AFFECTS SHAREHOLDER'S RISK AND RETURN", "paper_id": "WOS:000290842900010"}