{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "profit_maximization"}, {"score": 0.014828130951591412, "phrase": "purchasing_options"}, {"score": 0.011491051467988962, "phrase": "ramp"}, {"score": 0.004774530554776608, "phrase": "iaas_cloud_providers"}, {"score": 0.004616199959832044, "phrase": "diverse_set"}, {"score": 0.004577440795549049, "phrase": "instance_types"}, {"score": 0.00305285084207725, "phrase": "expected_profit"}, {"score": 0.002939007076062123, "phrase": "novel_strategies"}, {"score": 0.002770273247998903, "phrase": "different_instances"}, {"score": 0.00266693888510356, "phrase": "minimum_reliability_guarantees"}, {"score": 0.0026112013707473938, "phrase": "amazons_spot_price_history"}, {"score": 0.00257831812581194, "phrase": "four-month_period"}, {"score": 0.0025137856138000014, "phrase": "early_termination_rates"}, {"score": 0.0023996317685956213, "phrase": "total_cost"}, {"score": 0.0023296961971785357, "phrase": "on-demand_price"}, {"score": 0.002233301265743633, "phrase": "relatively_small_additional_charges"}, {"score": 0.0021049977753042253, "phrase": "baseline_resource_provisioning"}], "paper_keywords": ["Cloud computing", " Resource provisioning", " Reliability", " Spot instances", " Profit maximization", " Bidding"], "paper_abstract": "IaaS cloud providers such as Amazon EC2 provide access to a diverse set of instance types and purchasing options with various pricing and performance characteristics. Two pay-as-you-go purchasing options offered by Amazon EC2 are reliable on-demand and \"opportunistic\" spot instances. In this paper, we address the problem of profit maximization in the cloud via elastic, reliable provisioning of a mixture of instances in these options. To this end, we develop RAMP, a reliability-aware profit-maximizing resource provisioner that acts as middleware between applications/end users and Amazon EC2. Requests are fulfilled by acquiring and allocating instances through a comparison of the expected profit and reliability dynamics among various spot markets. RAMP employs novel strategies designed to evaluate the reliability, expected cost, and expected profit of different instances, and to intelligently determine bids that meet minimum reliability guarantees. Simulations run using Amazons spot price history over a four-month period demonstrate that, while achieving early termination rates as low as 2.2 %, our approach can completely offset the total cost when charging the user just 17.5 % of on-demand price. Further, the increases in profit resulting from relatively small additional charges to users are notably high, i.e., 100 % profit compared to the baseline resource provisioning cost with 35 % of the equivalent on-demand price.", "paper_title": "RAMP: reliability-aware elastic instance provisioning for profit maximization", "paper_id": "WOS:000365185400010"}