{"auto_keywords": [{"score": 0.04744942451594311, "phrase": "successful_deployment"}, {"score": 0.00481495049065317, "phrase": "offshore_oscillating_water_column"}, {"score": 0.004776297980616768, "phrase": "purpose_-_the_purpose"}, {"score": 0.004496080495247288, "phrase": "wave_energy_converter"}, {"score": 0.0044599948292411715, "phrase": "wec"}, {"score": 0.004301046274139699, "phrase": "ocean_energy"}, {"score": 0.003749908582313067, "phrase": "comprehensive_project_plan"}, {"score": 0.0032038465090068646, "phrase": "research_implications"}, {"score": 0.0029553380263320195, "phrase": "long-term_viability"}, {"score": 0.002759279370360986, "phrase": "similar_areas"}, {"score": 0.0026932247685847246, "phrase": "practical_implications"}, {"score": 0.0026500668745484957, "phrase": "wec_deployments"}, {"score": 0.0024742098091226203, "phrase": "practical_data"}, {"score": 0.002272964710550345, "phrase": "future_projects"}, {"score": 0.0021049977753042253, "phrase": "rare_accomplishment"}], "paper_keywords": ["Commissioning", " Deployment", " Ocean energy", " Operation and maintenance", " Oscillating water columns", " Wave energy converters"], "paper_abstract": "Purpose - The purpose of this paper is to disseminate the lessons learned from the successful deployment of a wave energy converter (WEC) and accelerate growth in the field of ocean energy. Design/methodology/approach - A thorough, well structured, documented, industrial approach was taken to the deployment because of the depth and scale of the task required. This approach is shown throughout the paper, which reflects the importance of a comprehensive project plan in success as well as failure. Findings - The findings demonstrate the viability of the use of off shore WEC to generate electricity and that such a project can be completed on time and on budget. Research limitations/implications - The research implications of the paper include the importance of an enhanced, integrated supervisory system control in terms of efficiency, operation and maintenance, and long-term viability of WECs. This paper can be used to help guide the direction of further research in similar areas. Practical implications - The practical implications include proof that WEC deployments can be carried out both on time and under budget. It highlights much of the practical data collected throughout the course of the project and presents it so that it might be used as a guide for future projects. Originality/value - At the time of this paper, successful deployment of off shore WECs has been a rare accomplishment. Because the project was publicly funded, the data collected during this project, both technical and practical, is freely available.", "paper_title": "Challenges and lessons learned in the deployment of an offshore oscillating water column", "paper_id": "WOS:000341713700015"}