{"auto_keywords": [{"score": 0.04833105858108298, "phrase": "petroleum_system"}, {"score": 0.015591788668102596, "phrase": "petroleum_digital_ecosystem"}, {"score": 0.00481495049065317, "phrase": "new_emerging_concepts"}, {"score": 0.004736045157669388, "phrase": "petroleum-bearing_sedimentary_basin"}, {"score": 0.004677711903652145, "phrase": "emerging_digital_ecosystem"}, {"score": 0.004218602458288531, "phrase": "generic_petroleum_system"}, {"score": 0.0039649719120779066, "phrase": "petroleum_subsystems"}, {"score": 0.0038838500580958744, "phrase": "albertine_graben"}, {"score": 0.0038359772875346558, "phrase": "uganda"}, {"score": 0.0034306925765832633, "phrase": "digital_representation"}, {"score": 0.0032109670662222416, "phrase": "local_and_global_scales"}, {"score": 0.0028953973490895746, "phrase": "petroleum_accumulations"}, {"score": 0.0027437235598539904, "phrase": "ontology-based_data_warehousing"}, {"score": 0.002621590601574503, "phrase": "multiple_data_dimensions"}, {"score": 0.0024535580495414783, "phrase": "data_warehouse_environment"}, {"score": 0.0024232694434408093, "phrase": "data_mining"}, {"score": 0.002363806685815014, "phrase": "multidimensional_data_warehousing"}, {"score": 0.002315367926547472, "phrase": "effective_interpretation"}, {"score": 0.0022962708568492734, "phrase": "petroleum_ecosystems"}, {"score": 0.0022122603123901114, "phrase": "reservoir_qualifications"}, {"score": 0.0021579641460002523, "phrase": "reserve_computations"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Petroleum-bearing sedimentary basin is an emerging digital ecosystem. Petroleum system and its elements are narrated for each and every oil and gas field in each and every petroleum-bearing sedimentary basin. A new concept of ecosystem and its digitization are emerging within the generic petroleum system. The Significance of this concept comes with an ability to establish connectivity among petroleum subsystems, for example, Albertine Graben (Western Uganda), through attributes of their components and their contextualization and specifications. Unless the phenomenon of integration of elements and processes among subbasins in the context of digital representation, visualization, and interpretation are understood, the existence of petroleum system (both at local and global scales) and its survival, the phenomenon of interconnectivity among ecosystems cannot be well explained. Its value cannot be added in terms of petroleum accumulations and volumes, unless these phenomena are made explicit. Authors propose ontology-based data warehousing and data mining technologies in which conceptualization and contextualization of multiple data dimensions' are modeled (elements and processes of petroleum system), besides their integration (within data warehouse environment) and data mining of interpretable emerging petroleum digital ecosystem. Multidimensional data warehousing and mining facilitate an effective interpretation of petroleum ecosystems, minimizing the ambiguities involved during structure and reservoir qualifications and quantifications, especially during reserve computations. (c) 2012 Wiley Periodicals, Inc.", "paper_title": "On new emerging concepts of petroleum digital ecosystem", "paper_id": "WOS:000310030500002"}