{"auto_keywords": [{"score": 0.029324128019230056, "phrase": "approximation_operators"}, {"score": 0.015256649921624293, "phrase": "complementary_neighborhood"}, {"score": 0.013400506514235654, "phrase": "upper_approximation_operators"}, {"score": 0.012747515886420143, "phrase": "x_subset"}, {"score": 0.012207066456518818, "phrase": "equivalence_classes"}, {"score": 0.00481495049065317, "phrase": "finite_approximation_spaces"}, {"score": 0.004517275498868226, "phrase": "covering_rough_set_theory"}, {"score": 0.004442032546224076, "phrase": "classification_rule"}, {"score": 0.003935892934907777, "phrase": "lower_and_upper_approximations"}, {"score": 0.0038702962539127867, "phrase": "u._we"}, {"score": 0.0031845067058084583, "phrase": "illustrative_example"}, {"score": 0.002821247621250663, "phrase": "dual_class"}, {"score": 0.0027370835853738626, "phrase": "dual_pair"}, {"score": 0.0026823700218343506, "phrase": "finite_universe"}, {"score": 0.002441118140830714, "phrase": "sufficient_condition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Covering rough set", " Neighborhood", " Complementary neighborhood", " Topology"], "paper_abstract": "Based on the notions of neighborhood and complementary neighborhood, we consider the classification of coverings in the covering rough set theory. We present a classification rule under which the coverings on a universe U are classified such that for any given pair of neighborhood (or complementary neighborhood)-based lower and upper approximation operators on U, all the different coverings in the same class generate the same pair of lower and upper approximations of each X subset of U. We show that there is a one to one correspondence between the equivalence classes of coverings and the topologies of the universe. Thus the number of the equivalence classes of coverings is equal to the number of topologies of the universe, and therefore, this number is much smaller than that of the coverings. We also give an illustrative example to show how we can classify some given coverings by calculating the topologies. Moreover, based on the relationship between the neighborhood and the complementary neighborhood, we find that each class of coverings has a dual class, and each pair of approximation operators has a dual pair of approximation operators. For a finite universe, considering one pair of approximation operators under one equivalence class of coverings is equivalent to considering its dual approximation operator pair under the dual class of coverings. Finally, we also present a sufficient condition under which, for any given pair of neighborhood-based lower and upper approximation operators, two coverings of the universe U generate the same pair of approximations of each X subset of U if and only if they belong to the same equivalence class. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Classification of coverings in the finite approximation spaces", "paper_id": "WOS:000337647300004"}