{"auto_keywords": [{"score": 0.044144996857399005, "phrase": "wide_niches"}, {"score": 0.04297550497093587, "phrase": "large_organizations"}, {"score": 0.00481495049065317, "phrase": "organizational_competition"}, {"score": 0.004663636232080366, "phrase": "organizational_applications"}, {"score": 0.004305763364577231, "phrase": "poa"}, {"score": 0.004007083686875716, "phrase": "scale_efficiencies"}, {"score": 0.0037740295668681014, "phrase": "theoretical_mechanisms"}, {"score": 0.003729065012001506, "phrase": "possible_trade-off"}, {"score": 0.003321008590273796, "phrase": "dual_market_structure"}, {"score": 0.0032164910932827168, "phrase": "resource_partitioning"}, {"score": 0.0031402604946939743, "phrase": "computational_model"}, {"score": 0.0029931603112397084, "phrase": "organizational_populations"}, {"score": 0.0027741761880779535, "phrase": "strong_sa_setting"}, {"score": 0.002730150696072947, "phrase": "narrow-niche_organizations"}, {"score": 0.0026975894491357176, "phrase": "strong_poa_setting"}, {"score": 0.0022712795176156536, "phrase": "resource_distributions"}, {"score": 0.0022174005294867604, "phrase": "partitioned_or_bifurcated_populations"}, {"score": 0.0021049977753042253, "phrase": "unordered_positions"}], "paper_keywords": ["Niche theory", " Principle of allocation", " Scale advantage", " Size distribution", " Simulation"], "paper_abstract": "In some organizational applications, the principle of allocation (PoA) and scale advantage (SA) oppose each other. While PoA implies that organizations with wide niches get punished, SA holds that large organizations gain an advantage because of scale efficiencies. The opposition occurs because many large organizations also possess wide niches. However, analyzing these theoretical mechanisms implies a possible trade-off between niche width and size: if both PoA and SA are strong, then organizations must be either focused or large to survive, resulting in a dual market structure, as proposed by the theory of resource partitioning. This article develops a computational model used to study this trade-off, and investigates the properties of organizational populations with low/high SA and low/high PoA. The model generates three expected core \"corner\" solutions: (1) the dominance of large organizations in the strong SA setting; (2) the proliferation of narrow-niche organizations in the strong PoA setting; and (3) a bifurcated or dual market structure if both SA and PoA are present. The model also allows us to identify circumstances under which narrow-niche (specialists) or wide-niche (generalists) organizations thrive. We also use the model to examine the claim that concentrated resource distributions are more likely to generate partitioned or bifurcated populations. We also investigate the consequences of environments comprised of ordered versus unordered positions.", "paper_title": "Niche width and scale in organizational competition: A computational approach", "paper_id": "WOS:000280647000002"}