{"auto_keywords": [{"score": 0.046633245390760206, "phrase": "people's_attention"}, {"score": 0.042136420762164964, "phrase": "peripheral_interaction"}, {"score": 0.004726052718910578, "phrase": "physical_world"}, {"score": 0.004305481798183612, "phrase": "computing_technologies"}, {"score": 0.004225950334493496, "phrase": "focused_attention"}, {"score": 0.003640183972131238, "phrase": "peripheral_interaction_design"}, {"score": 0.0034634973175137486, "phrase": "primary_school_teachers"}, {"score": 0.003378385493203297, "phrase": "open-ended_light-objects"}, {"score": 0.0030204580407008214, "phrase": "video_analysis"}, {"score": 0.002803104254950008, "phrase": "fireflies_interactive_artifact"}, {"score": 0.002700348931172875, "phrase": "ongoing_tasks"}, {"score": 0.002340081450249521, "phrase": "interactive_system"}, {"score": 0.0021049977753042253, "phrase": "longitudinal_approach"}], "paper_keywords": [""], "paper_abstract": "Many actions in the physical world take place in the background or periphery of people's attention. However, interactions with computing technologies usually require focused attention. This article explores the concept of peripheral interaction: physical interaction with technology that takes place outside the focus of attention. A peripheral interaction design (called FireFlies), which supports primary school teachers in their everyday routine through open-ended light-objects on the children's desks, was deployed in 4 classrooms for 6 weeks. Results of interviews and video analysis indicate that the 6 participating teachers were able to physically interact with the FireFlies interactive artifact quickly and frequently without disturbing ongoing tasks. In the final weeks of the study, the teachers seemed able to easily shift their focus of attention between their main task and the interactive system. We therefore conclude that, even though it is difficult to measure people's attention, a longitudinal approach seemed effective to find indicators for peripheral interaction.", "paper_title": "Evaluating Peripheral Interaction Design", "paper_id": "WOS:000359703400001"}