{"auto_keywords": [{"score": 0.04652122652620528, "phrase": "optimization_procedure"}, {"score": 0.04446701440821604, "phrase": "boundary_conditions"}, {"score": 0.004672808182229058, "phrase": "automatic_generation"}, {"score": 0.00440093312826378, "phrase": "model_generation_process"}, {"score": 0.003788196352457501, "phrase": "initial_structure"}, {"score": 0.0037238193456845124, "phrase": "objective_function"}, {"score": 0.003629291866667764, "phrase": "specified_constraints"}, {"score": 0.0031102878400698143, "phrase": "functional_chairs"}, {"score": 0.002842428606954139, "phrase": "simplicial_complex"}, {"score": 0.0027821202902740846, "phrase": "surface_vertices"}, {"score": 0.0026882700311968025, "phrase": "well-formed_tetrahedral_mesh"}, {"score": 0.0021599099979586946, "phrase": "original_shape"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Topology optimization", " Shape optimization", " Deformable simplicial complex method", " Structural design"], "paper_abstract": "We present a method for automatic generation of 3D models based on shape and topology optimization. The optimization procedure, or model generation process, is initialized by a set of boundary conditions, an objective function, constraints and an initial structure. Using this input, the method will automatically deform and change the topology of the initial structure such that the objective function is optimized subject to the specified constraints and boundary conditions. For example, this tool can be used to improve the stiffness of a structure before printing, reduce the amount of material needed to construct a bridge, or to design functional chairs, tables, etc. which at the same time are visually pleasing. The structure is represented explicitly by a simplicial complex and deformed by moving surface vertices and relabeling tetrahedra. To ensure a well-formed tetrahedral mesh during these deformations, the Deformable Simplicial Complex method is used. The deformations are based on optimizing the objective, which in this paper will be maximizing stiffness. Furthermore, the optimization procedure will be subject to constraints such as a limit on the amount of material and the difference from the original shape. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Combined shape and topology optimization of 3D structures", "paper_id": "WOS:000348748700004"}