{"auto_keywords": [{"score": 0.04493752827345705, "phrase": "h-colouring_problem"}, {"score": 0.009323607665504443, "phrase": "algebraic_approach"}, {"score": 0.007152805212424481, "phrase": "weak_near-unanimity_functions"}, {"score": 0.00481495049065317, "phrase": "fixed_digraph_h"}, {"score": 0.00447341965028879, "phrase": "input_digraph_g"}, {"score": 0.004062937864702115, "phrase": "jeavons_et_al"}, {"score": 0.003817549926252883, "phrase": "larose"}, {"score": 0.0037745459666402915, "phrase": "zadori"}, {"score": 0.0037109451820717216, "phrase": "maroti"}, {"score": 0.003669140590911533, "phrase": "mckenzie"}, {"score": 0.0029920129598858545, "phrase": "non-existence_results"}, {"score": 0.0027794243746094905, "phrase": "well_known_polynomial_cases"}, {"score": 0.0025819015229390663, "phrase": "wnuf_analogs"}, {"score": 0.0024395445088775712, "phrase": "nesetril"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "For a fixed digraph H, the problem of deciding whether there exists a homomorphism from an input digraph G to H is known as the H-colouring problem. An algebraic approach to this problem was pioneered by Jeavons et al. in the context of the more general constraint satisfaction problem. Results by Larose and Zadori and by Maroti and McKenzie allow one to interpret the algebraic approach in terms of so called weak near-unanimity functions (WNUFs). In this paper, we focus on weak near-unanimity functions and how they apply to the H-colouring problem in particular. Our results range from non-existence results of WNUFs for certain digraphs H, to the existence of WNUFs for the well known polynomial cases of the H-colouring problem treated by Gutjahr, Woeginger and Welzl. Along the way we develop WNUF analogs of the indicator and sub-indicator constructions of Hell and Nesetril. These results provide evidence to the conjecture that weak near-unanimity functions are the right measure for the complexity of the H-colouring problem. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Weak near-unanimity functions and digraph homomorphism problems", "paper_id": "WOS:000316424700003"}