{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "total_cost"}, {"score": 0.02288107085661794, "phrase": "order_constraints"}, {"score": 0.01053198450020763, "phrase": "total_minimum_commitments"}, {"score": 0.009947874957454111, "phrase": "optimal_procurement_policy"}, {"score": 0.009253843311761885, "phrase": "multi-supplier_setting"}, {"score": 0.00481495049065317, "phrase": "multiple_suppliers"}, {"score": 0.004007083686875716, "phrase": "long-term_supply_contracts"}, {"score": 0.003613556291453534, "phrase": "selected_supplier"}, {"score": 0.0035722806911457545, "phrase": "predetermined_plan_horizon"}, {"score": 0.003347105144425849, "phrase": "optimization_model"}, {"score": 0.0031481164109237636, "phrase": "storage_cost"}, {"score": 0.002983700956478823, "phrase": "two-phase_solution"}, {"score": 0.002938317647182056, "phrase": "multidimensional_dynamic_programming"}, {"score": 0.0029158847555394714, "phrase": "heuristic_method"}, {"score": 0.002860546817196148, "phrase": "optimal_procurement_policies"}, {"score": 0.0026494723416072316, "phrase": "multiple_optimal_procurement_strategies"}, {"score": 0.0023889533502525527, "phrase": "-_sensitivity_analysis"}, {"score": 0.0022041312401435346, "phrase": "optimal_procurement_strategy"}, {"score": 0.0021705796895687864, "phrase": "project_owners"}, {"score": 0.0021049977753042253, "phrase": "total_minimum_commitment"}], "paper_keywords": ["Cybernetics", " Supply chain management", " Resources", " Order systems"], "paper_abstract": "Purpose - The purpose of this paper is to derive the optimal procurement policy of an item for a buyer and reduce the total cost to the buyer. Design/methodology/approach - In a multi-supplier setting and from the perspective of the buyer, the paper addresses long-term supply contracts for a single item with total minimum commitments and order constraints each period. Under the conditions, the buyer agrees to procure at least a certain quantity of an item from every selected supplier over the predetermined plan horizon and the order constraints specify the minimum and maximum of the quantity purchased each period. An optimization model is developed minimizing the total cost to the buyer, including purchase, transportation, and storage cost of all periods. To derive the optimal procurement policy for the buyer, a two-phase solution is proposed integrating multidimensional dynamic programming with heuristic method. Findings - The optimal procurement policies can be computed easily and result in a certain decrease on the total cost to the buyer. There may be multiple optimal procurement strategies resulting in the same total cost to the buyer. The commitments to the suppliers result in an increase on the total cost to the buyer. Research limitations/implications - Sensitivity analysis should be provided and uncertain demands should be considered. Practical implications - This paper presents a very useful approach to derive optimal procurement strategy for such buyers as project owners. Originality/value - The paper extends the total minimum commitment to a multi-supplier setting.", "paper_title": "Optimal procurement strategies from multiple suppliers with total minimum commitments and order constraints", "paper_id": "WOS:000280732800017"}