{"auto_keywords": [{"score": 0.03983066441083217, "phrase": "distributed_setting"}, {"score": 0.004490212943845175, "phrase": "activity_awareness"}, {"score": 0.004438250823243621, "phrase": "distributed_emergency_management_planning"}, {"score": 0.003996727479807572, "phrase": "collocated_work"}, {"score": 0.0032596049901888724, "phrase": "knowledge_sharing"}, {"score": 0.0031660031870090434, "phrase": "complex_cooperative_work"}, {"score": 0.0030750809317435304, "phrase": "new_tools"}, {"score": 0.0029009722548088306, "phrase": "design_rationale"}, {"score": 0.002566685388128598, "phrase": "prototyping_phase"}, {"score": 0.0022841153001549193, "phrase": "process_knowledge"}, {"score": 0.002205560249972527, "phrase": "distributed_group_performance"}, {"score": 0.0021049977753042253, "phrase": "comparable_face-to-face_groups"}], "paper_keywords": ["Activity awareness", " common ground", " CSCW", " design", " colocated and distributed geo-collaboration", " emergency management planning"], "paper_abstract": "We present a design research project on knowledge sharing and activity awareness in distributed emergency management planning. In three experiments we studied groups using three different prototypes, respectively: a paper-prototype in a collocated work setting, a first software prototype in a distributed setting, and a second, enhanced software prototype in a distributed setting. In this series of studies we tried to better understand the processes of knowledge sharing and activity awareness in complex cooperative work by developing and investigating new tools that can support these processes. We explicate the design rationale behind each prototype and report the results of each experiment investigating it. We discuss how the results from each prototyping phase brought us closer to defining properties of a system that facilitate the sharing and awareness of both content and process knowledge. Our designs enhanced aspects of distributed group performance, in some respects beyond that of comparable face-to-face groups.", "paper_title": "Supporting Common Ground and Awareness in Emergency Management Planning: A Design Research Project", "paper_id": "WOS:000298660600005"}