{"auto_keywords": [{"score": 0.04889532068804287, "phrase": "spain"}, {"score": 0.027539157096455318, "phrase": "contaminated_product"}, {"score": 0.00481495049065317, "phrase": "food_crises"}, {"score": 0.004280338430265144, "phrase": "individual_level"}, {"score": 0.004205940624913343, "phrase": "coping_strategies"}, {"score": 0.004020492138367616, "phrase": "stressful_experiences"}, {"score": 0.00396050388346298, "phrase": "microblogging_channels"}, {"score": 0.003931193681041093, "phrase": "twitter"}, {"score": 0.00389164348807591, "phrase": "valuable_resource"}, {"score": 0.0038624981944755813, "phrase": "individuals'_expressions"}, {"score": 0.0038048583022763796, "phrase": "twitter_expressions"}, {"score": 0.0036279252881180678, "phrase": "social_media"}, {"score": 0.0035381202759091784, "phrase": "social_media_channel"}, {"score": 0.003416102793021287, "phrase": "social_level"}, {"score": 0.003249031799973021, "phrase": "twitter_messages"}, {"score": 0.003176721819672523, "phrase": "europe"}, {"score": 0.0031448288291084, "phrase": "contaminated_food_products"}, {"score": 0.003097865379563127, "phrase": "bloody_diarrhoea"}, {"score": 0.003066945490483524, "phrase": "haemolytic_uraemic_syndrome"}, {"score": 0.002830410693265704, "phrase": "initial_quantitative_analysis"}, {"score": 0.0027395968397212053, "phrase": "qualitative_content_analysis"}, {"score": 0.002560162916190598, "phrase": "hazard_notifications"}, {"score": 0.002163930783583212, "phrase": "food_crisis_communication"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Food crisis", " Coping", " Qualitative social media analysis", " Crisis communication"], "paper_abstract": "Food crises imply responses that are not what people and organisations would normally do, if one or more threats (health, economic, etc.) were not present. At an individual level, this motivates individuals to implement coping strategies aimed at adaptation to the threat that has been presented, as well as the reduction of stressful experiences. In this regard, microblogging channels such as Twitter emerge as a valuable resource to access individuals' expressions of coping. Accordingly, Twitter expressions are generally more natural, spontaneous and heterogeneous - in cognitive, affective and behavioural dimensions - than expressions found on other types of social media (e.g. blogs). Moreover, as a social media channel, it provides access not only to an individual but also to a social level of analysis, i.e. a psychosocial media analysis. To show the potential in this regard, our study analysed Twitter messages produced by individuals during the 2011 EHEC/Escherichia coli bacteria outbreak in Europe, due to contaminated food products. This involved more than 3100 cases of bloody diarrhoea and 850 of haemolytic uraemic syndrome (HUS), and 53 confirmed deaths across the EU. Based on data collected in Spain, the country initially thought to be the source of the outbreak, an initial quantitative analysis considered 11,411 tweets, of which 2099 were further analysed through a qualitative content analysis. This aimed at identifying (1) the ways of coping expressed during the crisis; and (2) how uncertainty about the contaminated product, expressed,through hazard notifications, influenced the former. Results revealed coping expressions as being dynamic, flexible and social, with a predominance of accommodation, information seeking and opposition (e.g. anger) strategies. The latter were more likely during a period of uncertainty, with the opposite being true for strategies relying on the identification of the contaminated product (e.g. avoid consumption/purchase). Implications for food crisis communication and monitoring systems are discussed. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Tweeting during food crises: A psychosocial analysis of threat coping expressions in Spain, during the 2011 European EHEC outbreak", "paper_id": "WOS:000328710100008"}