{"auto_keywords": [{"score": 0.044940433424255424, "phrase": "patent_quality"}, {"score": 0.004807201388274224, "phrase": "forward_citations"}, {"score": 0.004767826806287385, "phrase": "important_intellectual_assets"}, {"score": 0.004599064507497769, "phrase": "analytical_results"}, {"score": 0.0043783070225129495, "phrase": "brokerage_position"}, {"score": 0.004250950089281392, "phrase": "closure_position"}, {"score": 0.004188661776593748, "phrase": "early_and_mature_stages"}, {"score": 0.004053362743156545, "phrase": "factual_information"}, {"score": 0.003445591238183763, "phrase": "patent_citations"}, {"score": 0.0034118234596993836, "phrase": "social_network_analysis"}, {"score": 0.00307657476125683, "phrase": "good_predictor"}, {"score": 0.003016544840824688, "phrase": "patent_renewal_decisions"}, {"score": 0.0024405312482831646, "phrase": "early_stage"}, {"score": 0.002357755095722877, "phrase": "renewal_decision"}, {"score": 0.002323142666222693, "phrase": "different_way"}, {"score": 0.002125859121671523, "phrase": "different_technologies"}], "paper_keywords": ["Patent citation network", " Social network analysis", " Brokerage", " Closure"], "paper_abstract": "Patents are important intellectual assets for companies to defend or to claim their technological rights. To control R&D cost, companies should carefully examine their patents by patent quality. Approaches to evaluating patent quality are mostly a posteriori uses of factual information of patent quality. This paper examined whether patent quality can be predicted a priori, i.e., during the early years after a patent is granted, by analyzing information embedded in a network of patent citations. Social network analysis was applied to analyze two network positions occupied by a patent, brokerage and closure to determine whether either position is a good predictor of patent quality. Patent renewal decisions and forward citations were adopted as surrogates of patent quality. The analytical results showed that forward citations can be positively predicted by the brokerage position and negatively predicted by the closure position in the early and mature stages. Renewal decisions can be negatively predicted by the brokerage position in the early stage, and the closure position influences the renewal decision in a different way in the early and mature stages. These analytical results imply that a company should focus on developing patents that bridge different technologies as its technological developments reach maturity.", "paper_title": "Network structure of innovation: can brokerage or closure predict patent quality?", "paper_id": "WOS:000280274400012"}