{"auto_keywords": [{"score": 0.03204306368628066, "phrase": "genome_data_privacy"}, {"score": 0.00949936489863407, "phrase": "public_policy"}, {"score": 0.008922035649748283, "phrase": "genomic_data"}, {"score": 0.00481495049065317, "phrase": "genomic_era"}, {"score": 0.004779406424192843, "phrase": "genome_sequencing_technology"}, {"score": 0.004691684576246597, "phrase": "rapid_pace"}, {"score": 0.004554650954322244, "phrase": "highly-detailed_genotypes"}, {"score": 0.004276541976450121, "phrase": "personalized_medical_services"}, {"score": 0.004167001961564886, "phrase": "genomics_revolution"}, {"score": 0.0040904740665330805, "phrase": "biomedical_community"}, {"score": 0.004045230861702083, "phrase": "increased_availability"}, {"score": 0.003985680946956402, "phrase": "major_implications"}, {"score": 0.003956234229826621, "phrase": "personal_privacy"}, {"score": 0.0033981387193790353, "phrase": "family_relationships"}, {"score": 0.0033480826365657303, "phrase": "direct-to-consumer_dna"}, {"score": 0.0032743731084995515, "phrase": "genome_data"}, {"score": 0.002951220859491642, "phrase": "computer_science"}, {"score": 0.0028542615085879975, "phrase": "computer_scientists"}, {"score": 0.002822652835367827, "phrase": "data_privacy"}, {"score": 0.002543967677678384, "phrase": "computer_science_community"}, {"score": 0.002309828105129336, "phrase": "biomedical_specialists"}, {"score": 0.002250549946875429, "phrase": "genome_privacy_problem"}], "paper_keywords": ["Management", " Genomics privacy", " security", " health care", " biomedical research", " recreational genomics"], "paper_abstract": "Genome sequencing technology has advanced at a rapid pace and it is now possible to generate highly-detailed genotypes inexpensively. The collection and analysis of such data has the potential to support various applications, including personalized medical services. While the benefits of the genomics revolution are trumpeted by the biomedical community, the increased availability of such data has major implications for personal privacy; notably because the genome has certain essential features, which include (but are not limited to) (i) an association with traits and certain diseases, (ii) identification capability (e.g., forensics), and (iii) revelation of family relationships. Moreover, direct-to-consumer DNA testing increases the likelihood that genome data will be made available in less regulated environments, such as the Internet and for-profit companies. The problem of genome data privacy thus resides at the crossroads of computer science, medicine, and public policy. While the computer scientists have addressed data privacy for various data types, there has been less attention dedicated to genomic data. Thus, the goal of this paper is to provide a systematization of knowledge for the computer science community. In doing so, we address some of the (sometimes erroneous) beliefs of this field and we report on a survey we conducted about genome data privacy with biomedical specialists. Then, after characterizing the genome privacy problem, we review the state-of-the-art regarding privacy attacks on genomic data and strategies for mitigating such attacks, as well as contextualizing these attacks from the perspective of medicine and public policy. This paper concludes with an enumeration of the challenges for genome data privacy and presents a framework to systematize the analysis of threats and the design of countermeasures as the field moves forward.", "paper_title": "Privacy in the Genomic Era", "paper_id": "WOS:000363733200006"}