{"auto_keywords": [{"score": 0.04807157020342475, "phrase": "free-flying_satellite"}, {"score": 0.00481495049065317, "phrase": "space_robotics"}, {"score": 0.004712988631183401, "phrase": "space_robotic_system"}, {"score": 0.004515467468684217, "phrase": "on-orbit_satellite_servicing"}, {"score": 0.004289291421348352, "phrase": "discrete-event_scripted_controllers"}, {"score": 0.0040223714916651845, "phrase": "scripted_approach"}, {"score": 0.00385368199735867, "phrase": "substantial_interest"}, {"score": 0.0033026956021014204, "phrase": "uncooperative_satellite"}, {"score": 0.0032465423581390625, "phrase": "visual_perception"}, {"score": 0.0030969799559421806, "phrase": "high-level_reasoning"}, {"score": 0.0030183163057929687, "phrase": "reasoning_module"}, {"score": 0.0028302635493019867, "phrase": "perception_pipeline"}, {"score": 0.0027702126237754625, "phrase": "vision_system"}, {"score": 0.002553382046204689, "phrase": "behavioral_controller"}, {"score": 0.002467228805628948, "phrase": "related_elements"}, {"score": 0.002283839204519042, "phrase": "overall_system"}, {"score": 0.002216251512062482, "phrase": "robotic_arm"}, {"score": 0.0021414489155042885, "phrase": "realistic_laboratory_setting"}, {"score": 0.0021049977753042253, "phrase": "on-orbit_conditions"}], "paper_keywords": [""], "paper_abstract": "We present a space robotic system capable of capturing a free-flying satellite for the purposes of on-orbit satellite servicing. Currently such operations are carried out either manually or through discrete-event scripted controllers. The manual approach is costly and exposes astronauts to danger, while the scripted approach is tedious and brittle. Consequently, there is substantial interest in performing these operations autonomously, and the work presented here is a step in this direction. To our knowledge, ours is the only satellite-capturing system that relies on vision and cognition to deal with an uncooperative satellite. Our innovative system combines visual perception (object identification, recognition, and tracking) with high-level reasoning in a hybrid deliberative/reactive computational framework. The reasoning module, which encodes a model of the environment, performs deliberation to control the perception pipeline-it guides the vision system, validates its performance, and suggests corrections when vision is performing poorly. Furthermore, it advises the behavioral controller to carry out its tasks. Reasoning and related elements, among them intention, context, and memory, are responsible for the robustness and reliability of the overall system. We demonstrate our prototype system controlling a robotic arm that autonomously captures a free-flying satellite in a realistic laboratory setting that faithfully mimics on-orbit conditions.", "paper_title": "Intelligent perception and control for space robotics", "paper_id": "WOS:000253528600001"}