{"auto_keywords": [{"score": 0.03620728805533268, "phrase": "web_pages"}, {"score": 0.020683558380936988, "phrase": "web_site"}, {"score": 0.017810629230488137, "phrase": "relevant_information"}, {"score": 0.00481495049065317, "phrase": "web_sites"}, {"score": 0.004774530554776604, "phrase": "self-organizing_maps"}, {"score": 0.004655285779819366, "phrase": "ever_increasing_amount"}, {"score": 0.004463096299091981, "phrase": "information_increases"}, {"score": 0.0036296886647898094, "phrase": "clustering_methods"}, {"score": 0.003266201217790818, "phrase": "kohonen's_self-organizing_map"}, {"score": 0.0031710903727066313, "phrase": "content_and_context_mining_clustering_techniques"}, {"score": 0.003014422649429416, "phrase": "content_mining"}, {"score": 0.00284137141260141, "phrase": "context_mining"}, {"score": 0.002655697256976997, "phrase": "web_sessions"}, {"score": 0.002633355582628613, "phrase": "similar_context"}, {"score": 0.002556625752785268, "phrase": "similar_content"}, {"score": 0.0023296961971785357, "phrase": "two-level_clustering"}], "paper_keywords": ["access-logs", " clustering", " content mining", " context mining", " data mining", " neural networks", " self-organizing map (SOM)", " text mining", " web-logs", " web mining"], "paper_abstract": "Web sites contain an ever increasing amount of information within their pages. As the amount of information increases so does the complexity of the structure of the web site. Consequently it has become difficult for visitors to find the information relevant to their needs. To overcome this problem various clustering methods have been proposed to cluster data in an effort to help visitors find the relevant information. These clustering methods have typically focused either on the content or the context of the web pages. In this paper we are proposing a method based on Kohonen's self-organizing map (SOM) that utilizes both content and context mining clustering techniques to help visitors identify relevant information quicker. The input of the content mining is the set of web pages of the web site whereas the source of the context mining is the access-logs of the web site. SOM can be used to identify clusters of web sessions with similar context and also clusters of web pages with similar content. It can also provide means of visualizing the outcome of this processing. In this paper we show how this two-level clustering can help visitors identify the relevant information faster. This procedure has been tested to the access-logs and web pages of the Department of Informatics and Telecommunications of the University of Athens.", "paper_title": "Two-level clustering of web sites using self-organizing maps", "paper_id": "WOS:000251828600007"}