{"auto_keywords": [{"score": 0.01091746772127147, "phrase": "sufficient_funds"}, {"score": 0.010668143241671492, "phrase": "key_stakeholder"}, {"score": 0.01062342049553076, "phrase": "major_hospital_decisions"}, {"score": 0.00481495049065317, "phrase": "delphi_study"}, {"score": 0.004794724775684452, "phrase": "canada"}, {"score": 0.00472425099550141, "phrase": "authoritative_list"}, {"score": 0.004635252054180315, "phrase": "public_hospitals"}, {"score": 0.004500115147222707, "phrase": "iterative_controlled_feedback"}, {"score": 0.004424662497930444, "phrase": "data_collection"}, {"score": 0.004332120338566347, "phrase": "ontario"}, {"score": 0.004277515074890063, "phrase": "rural_hospitals"}, {"score": 0.004223599884418183, "phrase": "community_hospitals"}, {"score": 0.0041703614123283165, "phrase": "academic_hospitals"}, {"score": 0.004117791236072498, "phrase": "key_it_management_issues"}, {"score": 0.0040658810361445166, "phrase": "attrition_rate"}, {"score": 0.0038565123793269213, "phrase": "brainstorming_phase"}, {"score": 0.0035889029688641835, "phrase": "rural_panel"}, {"score": 0.0035436363801319578, "phrase": "community_panel"}, {"score": 0.003491543936409515, "phrase": "academic_panel"}, {"score": 0.003469452865548442, "phrase": "top_issues"}, {"score": 0.0034184471990563303, "phrase": "managing_demand"}, {"score": 0.003107935254560724, "phrase": "ranking_phase"}, {"score": 0.003088263761993566, "phrase": "moderate_level"}, {"score": 0.002737224935038552, "phrase": "top_it_management_issues"}, {"score": 0.0027141406157150647, "phrase": "strategic_positioning"}, {"score": 0.00260711396953901, "phrase": "scarce_resources"}, {"score": 0.002472676627823966, "phrase": "critical_it_management_issues"}, {"score": 0.002425991121756382, "phrase": "similar_environments"}, {"score": 0.002400435755771578, "phrase": "prioritized_lists"}, {"score": 0.0023501278920397372, "phrase": "diagnostic_tool"}, {"score": 0.0021319264406486124, "phrase": "appropriate_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["IT management issues", " Ranking-type Delphi", " Chief information officers", " Hospitals"], "paper_abstract": "Purpose: To develop an authoritative list of IT management issues faced by CIOs and IT directors in public hospitals. Methods: The ranking-type Delphi method, which elicits the opinion of a panel of experts through iterative controlled feedback, was used in this study. Data collection involved three main steps during which three panels of experts in Ontario (n = 13 in rural hospitals; n = 9 in community hospitals; n = 8 in academic hospitals) provided their input about the key IT management issues in hospitals and their relative importance. Attrition rate was minimal; 28 out of the 30 experts who participated in the study completed all three phases of the survey. Results: During the brainstorming phase, the responses from the three panels were consolidated resulting in a list of 36 IT management issues; eleven were overlapping between the three panels. In the narrowing down phase, 18 issues were retained in the rural panel; 20 issues in the community panel; and 17 issues in the academic panel. The top issues retained in this phase included: managing demand and expectations for IT services (76% of participants); having sufficient funds (69% of participants); recognizing IT as a key stakeholder in major hospital decisions (65% of participants); and implementation of an EMR (62% of participants). In the ranking phase, a moderate level of consensus was obtained for all three panels: W = 0.41 (rural panel); W = 0.54 (community panel); and W = 0.43 (academic panel). Despite the differences in the preoccupations between the three groups, there were similarities on certain IT management issues. Besides having sufficient funds, three of the top IT management issues relate to the strategic positioning of IT within the hospital: managing demands and expectations for IT services; IT competing with other clinical priorities for scarce resources; and recognizing IT as a key stakeholder in major hospital decisions. Conclusions: This study is the first to systematically and rigorously identify and prioritize critical IT management issues in hospitals, which may be generalizable to similar environments in other industrialized countries. The prioritized lists of IT management issues may be used as a benchmark and diagnostic tool to support internal strategic decision making related to IT. The broadening of understanding of the challenges faced by IT executives in hospitals would support a more systematic evaluation of these issues over time, and allow management, educational, and research resources to be invested in the appropriate areas. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Key IT management issues in hospitals: Results of a Delphi study in Canada", "paper_id": "WOS:000298081500008"}