{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environment_lights"}, {"score": 0.005475359704147633, "phrase": "proposed_method"}, {"score": 0.004714023408114857, "phrase": "efficient_all-frequency_relighting"}, {"score": 0.004550469496119256, "phrase": "novel_precomputed_radiance_transfer_method"}, {"score": 0.004361644989356558, "phrase": "-frequency_environment_illumination"}, {"score": 0.003681238363808568, "phrase": "preprocessing_step"}, {"score": 0.0028740705307540317, "phrase": "environment_illumination"}, {"score": 0.0027741761880779535, "phrase": "environment_map"}, {"score": 0.0027159094186967247, "phrase": "efficient_relighting"}, {"score": 0.002530359917257626, "phrase": "precomputed_clusters"}, {"score": 0.0023079225317714793, "phrase": "previous_approaches"}], "paper_keywords": ["precomputed radiance transfer", " all-frequency relighting", " clustering environment lights"], "paper_abstract": "We present a novel precomputed radiance transfer method for efficient relighting under all-frequency environment illumination. Environment illumination is represented as a set of environment lights. Each environment light comprises a direction and an intensity. In a preprocessing step, the environment lights are clustered into several clusters, taking into account only the light directions. By experiment, we confirmed that the environment lights can be clustered into a much smaller number of clusters than their original number. Given any environment illumination, sampled as an environment map, an efficient relighting is then achieved by computing the radiance using the precomputed clusters. The proposed method enables relighting under Very high-resolution environment illumination. In addition, unlike previous approaches, the proposed method can efficiently perform relighting when some regions of the given, environment illumination change.", "paper_title": "Clustering environment lights for an efficient all-frequency relighting", "paper_id": "WOS:000240524000010"}