{"auto_keywords": [{"score": 0.028287035706395014, "phrase": "polarization_effects"}, {"score": 0.027168216733908748, "phrase": "diffuse_functions"}, {"score": 0.00481495049065317, "phrase": "rotational_barriers"}, {"score": 0.004769269898610148, "phrase": "organic_compounds"}, {"score": 0.00443308765153716, "phrase": "cep_methods"}, {"score": 0.0038789122930433305, "phrase": "cep_calculations"}, {"score": 0.003571018150056717, "phrase": "cpu_time"}, {"score": 0.00337224813954299, "phrase": "atom_type"}, {"score": 0.0032666255024083983, "phrase": "energy_components"}, {"score": 0.0031845067058084583, "phrase": "molecular_environment"}, {"score": 0.002997628439369723, "phrase": "specific_effect"}, {"score": 0.0029691377785333872, "phrase": "distinct_pattern"}, {"score": 0.0024063484128685367, "phrase": "similar_behavior"}, {"score": 0.0021940118003312397, "phrase": "large_basis_sets"}, {"score": 0.0021524710523453464, "phrase": "delta_e-qci_correction"}, {"score": 0.0021252141682683123, "phrase": "significant_effects"}], "paper_keywords": ["Rotational barrier", " G3 theory", " G3CEP theory", " Electronic effects", " Pseudopotential", " Compound methods"], "paper_abstract": "The G3, G3CEP, MP4, MP4CEP, QCISD(T), and QCISD(T) CEP methods were applied to study 43 internal rotational barriers of different molecules. The calculated G3 and G3CEP barriers were accurate with respect to those obtained experimentally, typically showing deviations of <0.50 kcal mol(-1). The results for the MP4CEP, MP4, QCISD(T), and QCISD(T) CEP calculations were less accurate, and larger deviations of approximately +/-1 kcal mol-1 were observed. The accuracy of G3CEP was comparable to that of G3, but a reduction in CPU time of between 5 and 35% was observed when the dependence of the pseudopotentials on the size of the molecule and atom type was taken into account. The behaviors of the energy components show that these corrections depend on the molecular environment and whether the calculations are performed with all electrons or pseudopotentials. Usually, the predominance of a specific effect follows a distinct pattern when the G3 and G3CEP results are compared. For the G3 calculations, the most important component of the corrected MP4/6-31G(d) rotational energy is Delta E-2df,E-p. Among the 43 molecules, 29 were dependent on polarization effects, Delta E-2df,E-p; 19 were dependent on diffuse functions, Delta E+; and 13 depended on the effects of more elaborate basis functions (Delta E-G3large). Similar behavior was observed for the G3CEP calculations: polarization effects were more important for 25 molecules, followed closely by the effect of diffuse functions for 23 molecules, and finally the effect of large basis sets (19 molecules). Delta E-QCI correction seldom resulted in significant effects on the G3 and G3CEP calculations.", "paper_title": "A study of the rotational barriers for some organic compounds using the G3 and G3CEP theories", "paper_id": "WOS:000334934900016"}