{"auto_keywords": [{"score": 0.04857498973208302, "phrase": "vcg"}, {"score": 0.00481495049065317, "phrase": "efficient_task_allocation"}, {"score": 0.004730338746443662, "phrase": "execution_uncertainty"}, {"score": 0.004696914754526551, "phrase": "vickrey-clarke-groves"}, {"score": 0.004501217435918426, "phrase": "selfish_and_rational_agents"}, {"score": 0.003975609222669783, "phrase": "important_assumption"}, {"score": 0.003329051037399227, "phrase": "different_agents"}, {"score": 0.0032704647689720326, "phrase": "agent's_probability"}, {"score": 0.002939912751271152, "phrase": "novel_mechanisms"}, {"score": 0.0027577972695911825, "phrase": "new_class"}, {"score": 0.0026146595609362715, "phrase": "multiple_subjective_measures"}, {"score": 0.0024701382170046462, "phrase": "social_utility"}, {"score": 0.002392375784707278, "phrase": "negative_utility"}, {"score": 0.002317055705600351, "phrase": "challenging_new_combinatorial_optimisation_problem"}, {"score": 0.0022852761100071355, "phrase": "np"}, {"score": 0.002228203424338522, "phrase": "novel_representation"}, {"score": 0.0021580408652391767, "phrase": "effective_integer_programming_solution"}], "paper_keywords": [""], "paper_abstract": "Vickrey-Clarke-Groves (VCG) mechanisms are often used to allocate tasks to selfish and rational agents. VCG mechanisms are incentive compatible, direct mechanisms that are efficient (i.e., maximise social utility) and individually rational (i.e., agents prefer to join rather than opt out). However, an important assumption of these mechanisms is that the agents will always successfully complete their allocated tasks. Clearly, this assumption is unrealistic in many real-world applications, where agents can, and often do, fail in their endeavours. Moreover, whether an agent is deemed to have failed may be perceived differently by different agents. Such subjective perceptions about an agent's probability of succeeding at a given task are often captured and reasoned about using the notion of trust. Given this background, in this paper we investigate the design of novel mechanisms that take into account the trust between agents when allocating tasks. Specifically, we develop a new class of mechanisms, called trust-based mechanisms, that can take into account multiple subjective measures of the probability of an agent succeeding at a given task and produce allocations that maximise social utility, whilst ensuring that no agent obtains a negative utility. We then show that such mechanisms pose a challenging new combinatorial optimisation problem (that is NP-complete), devise a novel representation for solving the problem, and develop an effective integer programming solution (that can solve instances with about 2 x 105 possible allocations in 40 seconds).", "paper_title": "Trust-Based Mechanisms for Robust and Efficient Task Allocation in the Presence of Execution Uncertainty", "paper_id": "WOS:000267044200001"}