{"auto_keywords": [{"score": 0.04946824888397643, "phrase": "zachman_framework"}, {"score": 0.040448007601905894, "phrase": "product_traceability"}, {"score": 0.004712988631183401, "phrase": "analysing_products_information_traceability"}, {"score": 0.004515467468684217, "phrase": "new_regulation_directives"}, {"score": 0.004109454074072009, "phrase": "entire_lifecycle"}, {"score": 0.0038044630943383497, "phrase": "product_lifecycle"}, {"score": 0.0036762529165489644, "phrase": "information_system"}, {"score": 0.003359816816853762, "phrase": "generic_logical_models"}, {"score": 0.003316884515934182, "phrase": "product_and_process_information"}, {"score": 0.003288567185099276, "phrase": "business_and_manufacturing_levels"}, {"score": 0.0031102878400698143, "phrase": "product_information_traceability"}, {"score": 0.00296698375549856, "phrase": "conceptual_and_implementation_details"}, {"score": 0.0024252458095689847, "phrase": "particular_view"}, {"score": 0.002216251512062482, "phrase": "key_players"}, {"score": 0.0021973099304606076, "phrase": "information_systems"}, {"score": 0.0021049977753042253, "phrase": "traceability_purposes"}], "paper_keywords": ["Zachman framework", " IEC 62264", " traceability", " products modelling"], "paper_abstract": "In order to face new regulation directives regarding the environment and also for improving their customer relationship, enterprises have to increasingly be more able to manage their product information during the entire lifecycle. One of the objectives among others in this paper is to deal with product traceability along the product lifecycle. To meet this objective, the information system has to be designed and, further built in such a way all information regarding products is recorded. The IEC 62264 standards define generic logical models for exchanging product and process information between business and manufacturing levels of enterprise applications. Thus, it can be a base for product information traceability. However, its complexity comes from the fact it mixes conceptual and implementation details while no methodology exists that defines how to instantiate it. Product traceability is then needed to increase its abstraction level in order to concentrate on its concepts and managing its application by providing a methodology for its instantiation. In this paper, we propose to map the IEC 62264 standard models to a particular view of Zachman framework in order to make the framework concrete as a guideline for applying the standard and for providing the key players in information systems design with a methodology to use the standard for traceability purposes.", "paper_title": "Mapping the IEC 62264 models onto the Zachman framework for analysing products information traceability: a case study", "paper_id": "WOS:000251095700005"}