{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adaptive_carrier"}, {"score": 0.004615202066192795, "phrase": "comprehensive_review"}, {"score": 0.004576253356889219, "phrase": "existing_physical_carrier_sensing_enhancements"}, {"score": 0.004480307124735185, "phrase": "original_physical_carrier"}, {"score": 0.0043678116213858, "phrase": "wireless_stations"}, {"score": 0.0038624981944755813, "phrase": "system_performance"}, {"score": 0.003797530813314321, "phrase": "collision_rate"}, {"score": 0.0037336520904376687, "phrase": "channel_spatial_reuse"}, {"score": 0.003639835714755229, "phrase": "physical_carrier"}, {"score": 0.0035634522350563107, "phrase": "key_factor"}, {"score": 0.003400984514637656, "phrase": "wireless_network"}, {"score": 0.0031110402375026016, "phrase": "limited_carrier"}, {"score": 0.002994449398035894, "phrase": "optimum_carrier"}, {"score": 0.002785978280998868, "phrase": "optimum_value"}, {"score": 0.0026140878612307536, "phrase": "varying_network_conditions"}, {"score": 0.002548331088496964, "phrase": "in-depth_survey"}, {"score": 0.0025160740422447837, "phrase": "existing_literature"}, {"score": 0.0021049977753042253, "phrase": "performance_gains"}], "paper_keywords": ["Wireless LAN", " IP Networks", " Wireless Communication", " Wireless Networks", " Ad Hoc Networks", " Adaptive Algorithm", " Analytical Models"], "paper_abstract": "This survey provides a comprehensive review of existing physical carrier sensing enhancements for IEEE 802.11 wireless networks. The original physical carrier sensing mechanism, used by wireless stations to gain access to the medium, is limited. Consequently, IEEE 802.11 networks are vulnerable to the presence of hidden and exposed nodes. Such nodes can significantly decrease system performance by increasing the collision rate and decreasing the channel spatial reuse. The value of the physical carrier sensing threshold is a key factor influencing the presence of hidden and exposed nodes in a wireless network. Several enhancements have been proposed in the literature, which attempt to mitigate the loss in performance caused by the limited carrier sensing. Firstly, the notion of an optimum carrier sensing threshold has been studied, and results indicate that it can be tuned to an optimum value. Building on the positive early results, further work was performed to develop mechanisms that dynamically adjust the threshold according to varying network conditions. This article presents an in-depth survey of the existing literature in the area, detailing the various approaches and their efficacy in addressing the problem of hidden and exposed nodes (and consequently increasing performance). It offers a comparison of the techniques, by evaluating the models, limitations, assumptions, and performance gains.", "paper_title": "A Survey of Adaptive Carrier Sensing Mechanisms for IEEE 802.11 Wireless Networks", "paper_id": "WOS:000343072200006"}