{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autonomous_synthetic_characters"}, {"score": 0.0072565163578002575, "phrase": "autonomous_characters"}, {"score": 0.00676285861343908, "phrase": "social_skills"}, {"score": 0.004664352260912174, "phrase": "social_engagement"}, {"score": 0.004598933498016774, "phrase": "virtual_environments"}, {"score": 0.004377077848734575, "phrase": "gaming_experience"}, {"score": 0.004151188559520802, "phrase": "role_playing_games"}, {"score": 0.0036682498811430623, "phrase": "group_scenarios"}, {"score": 0.0033817999428800457, "phrase": "human_members"}, {"score": 0.0031397776924946526, "phrase": "coherent_manner"}, {"score": 0.00310664242361199, "phrase": "individual_perspective"}, {"score": 0.0030093137393901355, "phrase": "group_task"}, {"score": 0.002833689453299307, "phrase": "group's_composition"}, {"score": 0.0026682872124177233, "phrase": "group_dynamics"}, {"score": 0.0025573643582417573, "phrase": "human_social_psychological_sciences"}, {"score": 0.0022835460368487233, "phrase": "collaborative_computer_game"}, {"score": 0.0021654633404434623, "phrase": "positive_effect"}, {"score": 0.0021425882815624803, "phrase": "users'_social_engagement"}], "paper_keywords": ["Group dynamics", " Teamwork", " Social intelligence", " Autonomous synthetic characters", " Believability", " Computer-human interaction"], "paper_abstract": "Autonomous synthetic characters have the potential to promote the social engagement of users in virtual environments, enhancing their interaction experience. In computer games, for example, poor interaction with game characters can drastically detract from the gaming experience, making the design of autonomous synthetic characters an important issue. In particular, in Role Playing Games (RPGs), for example, users and autonomous characters often perform in a group. Usually, the role of such characters is very limited since they lack the social skills to perform coherently in group scenarios. The goal of the work presented here is to endow autonomous synthetic characters with social skills that allow them to perform in groups with human members. However, to successfully achieve this, it is not enough to assure that the characters behave in a coherent manner from an individual perspective or that they are able to perform the group task optimally. It is also necessary that the autonomous characters exhibit behaviours that are coherent with the group's composition, context and structure. For this reason, we have developed a model to support group dynamics of autonomous synthetic characters (SGD model) inspired by theories developed in human social psychological sciences. This model defines the knowledge that each individual should build about the others and the group, and how this knowledge drives their interactions. The model was used in a collaborative computer game that was tested with users. The results showed that the model had a positive effect on the users' social engagement, namely. on their trust and identification with the group. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Teaming up humans with autonomous synthetic characters", "paper_id": "WOS:000261931400003"}