{"auto_keywords": [{"score": 0.049764804068700534, "phrase": "semantic_web_technology"}, {"score": 0.00481495049065317, "phrase": "industry_perspective"}, {"score": 0.004674402456361649, "phrase": "large_spectrum"}, {"score": 0.00459809245936039, "phrase": "domain_knowledge"}, {"score": 0.00433350214927936, "phrase": "diversified_and_automated_knowledge_processing"}, {"score": 0.004124630249202334, "phrase": "optimal_combination"}, {"score": 0.00390000531646629, "phrase": "complementary_tasks"}, {"score": 0.0037119497772861165, "phrase": "corporate_portals"}, {"score": 0.003116989767430614, "phrase": "social_and_economic_perspective"}, {"score": 0.003086311260099341, "phrase": "emerging_technology"}, {"score": 0.003025854378927907, "phrase": "economic_wealth"}, {"score": 0.00295681206994471, "phrase": "clear_cut_value"}, {"score": 0.0029373757799982356, "phrase": "everyday_activities"}, {"score": 0.00291806687851358, "phrase": "technological_transparency"}, {"score": 0.0027408292745619233, "phrase": "new_success_stories"}, {"score": 0.002643168068896905, "phrase": "ongoing_work"}, {"score": 0.0024990202385797252, "phrase": "application_fields"}, {"score": 0.0023705236064200893, "phrase": "use_cases"}, {"score": 0.002316399538424667, "phrase": "key_knowledge"}, {"score": 0.0022191333270475087, "phrase": "selected_application_field"}, {"score": 0.0021470954708827125, "phrase": "current_technology_roadmap"}, {"score": 0.0021049977753042253, "phrase": "academic_and_industry_researchers"}], "paper_keywords": [""], "paper_abstract": "Semantic Web technology is being increasingly applied in a large spectrum of applications in which domain knowledge is conceptualized and formalized (e.g., by means of an ontology) in order to support diversified and automated knowledge processing (e.g., reasoning) performed by a machine. Moreover, through an optimal combination of (cognitive) human reasoning and (automated) machine reasoning and processing, it is possible for humans and machines to share complementary tasks. The spectrum of applications is extremely large and to name a few: corporate portals and knowledge management, e-commerce, e-work, e-business, healthcare, e-government, natural language understanding and automated translation, information search, data and services integration, social networks and collaborative filtering, knowledge mining, business intelligence and so on. From a social and economic perspective, this emerging technology should contribute to growth in economic wealth, but it must also show clear cut value for everyday activities through technological transparency and efficiency. The penetration of Semantic Web technology in industry and in services is progressing slowly but accelerating as new success stories are reported. In this paper and lecture we present ongoing work in the cross-fertilization between industry and academia. In particular, we present a collection of application fields and use cases from enterprises which are interested in the promises of Semantic Web technology. The use cases are detailed and focused on the key knowledge processing components that will unlock the deployment of the technology in the selected application field. The paper ends with the presentation of the current technology roadmap designed by a team of Academic and Industry researchers.", "paper_title": "The semantic web from an industry perspective", "paper_id": "WOS:000240539300010"}