{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "protective_measures"}, {"score": 0.0296346382211672, "phrase": "dangerous_activity"}, {"score": 0.02399529183645048, "phrase": "design_stage"}, {"score": 0.00481495049065317, "phrase": "automated_monitoring"}, {"score": 0.004743806810821005, "phrase": "fall_hazards"}, {"score": 0.00443638953122199, "phrase": "safety_control"}, {"score": 0.004306205029641728, "phrase": "real-time_data_collection"}, {"score": 0.004211069233133584, "phrase": "accident_prevention"}, {"score": 0.0041642891310893, "phrase": "automated_model"}, {"score": 0.004087469540575263, "phrase": "fall_hazard"}, {"score": 0.003587842947046177, "phrase": "present_case"}, {"score": 0.0034566143156030426, "phrase": "existing_guardrails"}, {"score": 0.0033426036530090205, "phrase": "planned_ones"}, {"score": 0.0032444113660668743, "phrase": "model_issues_warnings"}, {"score": 0.0027331033178323145, "phrase": "appropriate_protective_measures"}, {"score": 0.0025844090835070986, "phrase": "model's_main_algorithm"}, {"score": 0.002416589459425828, "phrase": "proposed_model"}, {"score": 0.002345535736297701, "phrase": "construction_stage"}, {"score": 0.002276566401216226, "phrase": "useful_tool"}, {"score": 0.0021049977753042253, "phrase": "actual_construction"}], "paper_keywords": [""], "paper_abstract": "Most lethal accidents in construction are caused by falling from heights. Researchers point out the importance of safety control, carried out systematically and based on real-time data collection, as the most important element of accident prevention. An automated model to monitor and control fall hazard was developed. The model identifies the activities associated with risk of fall from heights and the areas where these activities are scheduled to be performed and plans the protective measures-guardrails in the present case. The model is designed to follow up the existing guardrails and constantly compare their locations and lengths to the planned ones. Based on this comparison, the model issues warnings whenever guardrails are missing, or temporarily removed. The model provides reports and warnings-the reports are used for planning the materials, or workers, needed to erect the protective measures. Warnings are given when a dangerous activity is per-formed without appropriate protective measures, or when the latter were removed before the dangerous activity was completed. The model's main algorithm s-dangerous activities and areas identification-were implemented and evaluated on site. Whereas the proposed model was developed to improve safety during the construction stage, it can be used as a useful tool during the design stage too. Including safety in the design stage, typically absent, can meaningfully improve safety during the actual construction.", "paper_title": "Algorithms for automated monitoring and control of fall hazards", "paper_id": "WOS:000243054300003"}