{"auto_keywords": [{"score": 0.048992899974696226, "phrase": "thin_sheets"}, {"score": 0.00481495049065317, "phrase": "adaptive_tearing"}, {"score": 0.004494570360108983, "phrase": "adaptive_fracture_propagation"}, {"score": 0.00436742595270452, "phrase": "high-quality_triangle_mesh"}, {"score": 0.003592859432554987, "phrase": "stress_distribution"}, {"score": 0.003531474887552889, "phrase": "crack_tip"}, {"score": 0.002938317647182056, "phrase": "efficient_simulation"}, {"score": 0.0028715299874549245, "phrase": "total_number"}, {"score": 0.00283870598459543, "phrase": "active_nodes"}, {"score": 0.002726740692380339, "phrase": "thin_slivers"}, {"score": 0.002680114113899346, "phrase": "crack_path"}, {"score": 0.002268441347979241, "phrase": "plasticity_models"}, {"score": 0.0021539955106204354, "phrase": "large_range"}], "paper_keywords": ["Fracture simulation", " cracking", " tearing", " thin sheets", " shells", " plastic deformation", " bending"], "paper_abstract": "This paper presents a method for adaptive fracture propagation in thin sheets. A high-quality triangle mesh is dynamically restructured to adaptively maintain detail wherever it is required by the simulation. These requirements include refining where cracks are likely to either start or advance. Refinement ensures that the stress distribution around the crack tip is well resolved, which is vital for creating highly detailed, realistic crack paths. The dynamic meshing framework allows subsequent coarsening once areas are no longer likely to produce cracking. This coarsening allows efficient simulation by reducing the total number of active nodes and by preventing the formation of thin slivers around the crack path. A local reprojection scheme and a substepping fracture process help to ensure stability and prevent a loss of plasticity during remeshing. By including bending and stretching plasticity models, the method is able to simulate a large range of materials with very different fracture behaviors.", "paper_title": "Adaptive Tearing and Cracking of Thin Sheets", "paper_id": "WOS:000340000100077"}