{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recent_keyword_search_schemes"}, {"score": 0.047667240890459914, "phrase": "encrypted_documents"}, {"score": 0.04057078069986388, "phrase": "storage_system"}, {"score": 0.026992278395501307, "phrase": "off-line_keyword_guessing_attack"}, {"score": 0.004632039024076267, "phrase": "keyword_search_scheme"}, {"score": 0.004484908028307205, "phrase": "remote_keyword_search"}, {"score": 0.0040186038781533946, "phrase": "data_supplier"}, {"score": 0.0031845067058084583, "phrase": "serious_vulnerability"}, {"score": 0.0027801631944598206, "phrase": "well-known_keywords"}, {"score": 0.002411383506019635, "phrase": "recent_public_key-based_keyword_search_schemes"}, {"score": 0.0021049977753042253, "phrase": "captured_query_messages"}], "paper_keywords": ["keyword search on encrypted data", " off-line keyword guessing attack", " database security and privacy"], "paper_abstract": "A keyword search scheme over encrypted documents allows for remote keyword search of documents by a user in possession of a trapdoor (secret key). A data supplier first uploads encrypted documents on a storage system, and then a user of the storage system searches documents containing keywords while insider (such as administrators of the storage system) and outsider attackers do not learn anything else about the documents. In this paper, we firstly raise a serious vulnerability of recent keyword search schemes, which lies in the fact that keywords are chosen from much smaller space than passwords and users usually use well-known keywords for search of document. Hence this fact sufficiently gives rise to an off-line keyword guessing attack. Unfortunately, we observe that the recent public key-based keyword search schemes are susceptible to an off-line keyword guessing attack. We demonstrated that anyone (insider/outsider) can retrieve information of certain keyword from any captured query messages.", "paper_title": "Off-line keyword guessing attacks on recent keyword search schemes over encrypted data", "paper_id": "WOS:000241476800006"}