{"auto_keywords": [{"score": 0.03904472370294909, "phrase": "smart_spaces"}, {"score": 0.00481495049065317, "phrase": "interactive_smart_spaces"}, {"score": 0.004537254814246843, "phrase": "networking_services"}, {"score": 0.004252469672259375, "phrase": "social_interaction"}, {"score": 0.003985487777785535, "phrase": "smart_space"}, {"score": 0.003879234831701853, "phrase": "passive_mediators"}, {"score": 0.0036553070575015344, "phrase": "active_actor"}, {"score": 0.0035965032173588753, "phrase": "interaction_process"}, {"score": 0.003407214479510987, "phrase": "knowledge-based_technologies"}, {"score": 0.0025031188149336257, "phrase": "participants'_perspective"}, {"score": 0.0021627595586364724, "phrase": "concept_prototype_applications"}, {"score": 0.0021394674440767124, "phrase": "different_architectures"}], "paper_keywords": ["Social interaction", " smart spaces", " context-awareness", " knowledge-based systems"], "paper_abstract": "Recently, we have been witnessing how various social applications and networking services are being integrated more deeply into our daily lives. Until now, social interaction has been attributed exclusively to humans, while resources and the smart space have supported interaction as passive mediators only. However, the involvement of smart spaces as an active actor in the interaction process facilitates more flexible and user-centered applications for users. This article explores how knowledge-based technologies enable smart spaces to actively take part in the interaction. We argue that smart spaces should be able not only to adapt their behaviour according to the actions of humans and other participants, but also initiate interaction when it is necessary. In order to support this statement, we categorise the types of interaction from the participants' perspective, and review and evaluate the technologies enabling interaction in smart spaces. Furthermore, we present our constructive research on interaction in smart spaces: proof-of-concept prototype applications realizing different architectures and supporting various types of interaction in smart spaces.", "paper_title": "Towards interactive smart spaces", "paper_id": "WOS:000313294000003"}