{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "contractual_agreements"}, {"score": 0.004554488671294504, "phrase": "interoperating_providers"}, {"score": 0.0044826811976193485, "phrase": "usable_services"}, {"score": 0.004377077848734575, "phrase": "payment_methods"}, {"score": 0.0037935066882208235, "phrase": "human_involvement"}, {"score": 0.0036456298076415652, "phrase": "small_content"}, {"score": 0.003503497128638099, "phrase": "interoperation_partners"}, {"score": 0.0034619440946558186, "phrase": "large_operators"}, {"score": 0.0033668870709083884, "phrase": "general_lack_flexibility"}, {"score": 0.0031342307827666675, "phrase": "service_conditions"}, {"score": 0.003036040409062437, "phrase": "automated_and_dynamic_negotiation"}, {"score": 0.002826181226538412, "phrase": "compensation_systems"}, {"score": 0.0028037753646260937, "phrase": "future_mobile_networks"}, {"score": 0.0027159094186967247, "phrase": "functional_compensation_architecture"}, {"score": 0.00267301171407926, "phrase": "key_requirements"}, {"score": 0.00252812242767189, "phrase": "current_compensation_systems"}, {"score": 0.0024586427394152196, "phrase": "prior_investments"}, {"score": 0.0023532890136269986, "phrase": "different_legacy_and_non-legacy_compensation-related_components"}, {"score": 0.0022524395393089544, "phrase": "conceptual_architecture"}, {"score": 0.0021559025985688255, "phrase": "first_performance_indicators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Compensation", " Billing", " Charging", " Accounting", " Dynamicity"], "paper_abstract": "As of today, contractual agreements govern the terms of interaction between users and providers as well as between interoperating providers. Such contracts indicate usable services and resources, tariffs, payment methods, etc. Typically, these terms are negotiated once before the contract is signed and are seldom changed thereafter, such that contracts are rather static and inflexible. Furthermore, establishing such a contract requires human involvement. As a consequence, it is difficult for small content or access providers to reach users and to find interoperation partners amongst the large operators. In addition, providers in general lack flexibility with respect to charging according to demand, and users are unable to easily change their preferred access and service conditions depending on their current life situation and location. Supporting automated and dynamic negotiation of contractual agreements as well as implementing these agreements in an automated, ad hoc fashion are therefore key requirements for compensation systems in future mobile networks. In this paper we propose a functional compensation architecture that meets these key requirements. The architecture is furthermore designed to be able to operate atop of current compensation systems and thus protects and even leverages prior investments. Finally, the architecture allows for the integration of different legacy and non-legacy compensation-related components and thus supports heterogeneous systems. The description of the conceptual architecture in this work is complemented by presenting a prototype including first performance indicators. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Compensation: Architecture for supporting dynamicity and negotiation in accounting, charging and billing", "paper_id": "WOS:000281892800007"}