{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "robinsonian"}, {"score": 0.004435514622798228, "phrase": "basic_data_mining_techniques"}, {"score": 0.003975515793563275, "phrase": "prepyramidal_clustering_structures"}, {"score": 0.0039322149318145845, "phrase": "cluster_collections"}, {"score": 0.003682100144121148, "phrase": "compatible_orders"}, {"score": 0.003299977511820374, "phrase": "dissimilarity_measures"}, {"score": 0.0030064251340251196, "phrase": "compatible_order"}, {"score": 0.002709045632654716, "phrase": "weakly_indexed_pyramids"}, {"score": 0.0026357877401570764, "phrase": "robinsonian_dissimilarities"}, {"score": 0.002536534348967786, "phrase": "general_setting"}, {"score": 0.002508867228980776, "phrase": "undistinguishable_objects"}, {"score": 0.0021994343316143125, "phrase": "arbitrary_intersections"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Cluster analysis and seriation are basic data mining techniques. We consider here clustering structures that enable us to achieve both a clustering and a seriation, namely the hierarchical, pyramidal, and prepyramidal clustering structures. Cluster collections of these types determine seriations of any data set by providing compatible orders, i.e., total rankings of the whole data set for which the objects within each cluster are consecutive. Moreover, the dissimilarity measures induced from such cluster collections are Robinsonian; in other words, the more distant the objects in a compatible order, the higher the induced dissimilarity value. It results in a one-to-one correspondence between weakly indexed pyramids and the class of Robinsonian dissimilarities, which holds still in a general setting where undistinguishable objects can be detected, and, as shown in this paper, extends, to prepyramids, which are not required to contain arbitrary intersections of clusters. (C) 2013 Wiley Periodicals, Inc.", "paper_title": "Prepyramidal clustering and Robinsonian dissimilarities: one-to-one correspondences", "paper_id": "WOS:000321490800005"}