{"auto_keywords": [{"score": 0.029559271850767333, "phrase": "structured_overlay"}, {"score": 0.00481495049065317, "phrase": "peer_system"}, {"score": 0.004125027493339274, "phrase": "target_objects"}, {"score": 0.00408533915260546, "phrase": "popular"}, {"score": 0.0038179283509963695, "phrase": "overlay_topology"}, {"score": 0.0037087324991876727, "phrase": "efficient_routing_path"}, {"score": 0.0035679633126097115, "phrase": "hybrid_use"}, {"score": 0.003100865267124765, "phrase": "fully_decentralized_algorithm"}, {"score": 0.0030121159909273897, "phrase": "existing_methods"}, {"score": 0.002968695624366393, "phrase": "human_intervention"}, {"score": 0.002925899335792914, "phrase": "centralized_gateway"}, {"score": 0.0025673856614952854, "phrase": "global_knowledge"}, {"score": 0.0021670777282518424, "phrase": "highly_dynamic_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["P2P", " Unstructured overlay", " Structured overlay", " Hybrid overlay", " Overlay construction"], "paper_abstract": "Decentralized peer-to-peer (P2P) systems can be classified into unstructured and structured. The former is easy to implement, and often simply uses flooding for search, which can be effective only when target objects are Popular or nearby. The latter requires peers to cooperate closely to maintain an overlay topology so as to ensure an efficient routing path between any two nodes. Recently, a hybrid use of both paradigms has gained its Popularity in several Popular file sharing tools to take advantage of each. What is lacking, and thus the purpose of the paper, is a fully decentralized algorithm to build such hybrid systems, as existing methods often require human intervention and some centralized gateway to select peers and guide them to build the structured overlay. The challenges include how to ensure that only one connected overlay is constructed in the lack of any global knowledge, and that only stable peers are selected for the structured overlay so as to reduce its maintenance cost. In addition, the construction must be efficient, scalable, robust, and easy to implement in a highly dynamic environment. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "On the self-organization of a hybrid peer-to-peer system", "paper_id": "WOS:000275132700010"}