{"auto_keywords": [{"score": 0.04308132877909892, "phrase": "kernel_function"}, {"score": 0.04165826455732131, "phrase": "inner_product"}, {"score": 0.027901681011988116, "phrase": "optimal_kernel"}, {"score": 0.00481495049065317, "phrase": "machine_learning_community"}, {"score": 0.004704187604192605, "phrase": "tremendous_growth"}, {"score": 0.004569293780076254, "phrase": "kernel-based_learning_algorithms"}, {"score": 0.003726967166630926, "phrase": "higher_dimensional_space"}, {"score": 0.0034551632687788857, "phrase": "solid_foundation"}, {"score": 0.003415137969569376, "phrase": "nonlinear_analysis"}, {"score": 0.0032031180198375283, "phrase": "kernel-based_learning"}, {"score": 0.003093054709625219, "phrase": "appropriate_kernel"}, {"score": 0.0026892447164623247, "phrase": "learning_algorithm"}, {"score": 0.0021799789348982516, "phrase": "pivotal_issues"}, {"score": 0.002129701089817251, "phrase": "efficient_design"}], "paper_keywords": ["Machine learning", " Kernel methods", " Learning the kernels"], "paper_abstract": "In recent years, the machine learning community has witnessed a tremendous growth in the development of kernel-based learning algorithms. However, the performance of this class of algorithms greatly depends on the choice of the kernel function. Kernel function implicitly represents the inner product between a pair of points of a dataset in a higher dimensional space. This inner product amounts to the similarity between points and provides a solid foundation for nonlinear analysis in kernel-based learning algorithms. The most important challenge in kernel-based learning is the selection of an appropriate kernel for a given dataset. To remedy this problem, algorithms to learn the kernel have recently been proposed. These methods formulate a learning algorithm that finds an optimal kernel for a given dataset. In this paper, we present an overview of these algorithms and provide a comparison of various approaches to find an optimal kernel. Furthermore, a list of pivotal issues that lead to efficient design of such algorithms will be presented.", "paper_title": "A survey of the state of the art in learning the kernels", "paper_id": "WOS:000303129200001"}