{"auto_keywords": [{"score": 0.04283466066833852, "phrase": "query_terms"}, {"score": 0.015385260603799224, "phrase": "focused_information_retrieval"}, {"score": 0.012880631330203644, "phrase": "retrieval_effectiveness"}, {"score": 0.00481495049065317, "phrase": "focused_retrieval"}, {"score": 0.004762893197005439, "phrase": "structured_documents"}, {"score": 0.004535481695403089, "phrase": "small_units"}, {"score": 0.0033262524445013303, "phrase": "browse_method"}, {"score": 0.003272375502853897, "phrase": "fetch_step"}, {"score": 0.0031500213134140953, "phrase": "browse_step"}, {"score": 0.0030821633718368206, "phrase": "enhanced_proximity_model"}, {"score": 0.0022228943786652914, "phrase": "large_xml_structured_collection"}, {"score": 0.0021049977753042253, "phrase": "term_proximity"}], "paper_keywords": ["Focused information retrieval", " Structured information retrieval", " Proximity", " XML", " Tags"], "paper_abstract": "Focused information retrieval is concerned with the retrieval of small units of information. In this context, the structure of the documents as well as the proximity among query terms have been found useful for improving retrieval effectiveness. In this article, we propose an approach combining the proximity of the terms and the tags which mark these terms. Our approach is based on a Fetch and Browse method where the fetch step is performed with BM25 and the browse step with a structure enhanced proximity model. In this way, the ranking of a document depends not only upon the existence of the query terms within the document but also upon the tags which mark these terms. Thus, the document tends to be highly relevant when query terms are close together and are emphasized by tags. The evaluation of this model on a large XML structured collection provided by the INEX 2010 XML IR evaluation campaign shows that the use of term proximity and structure improves the retrieval effectiveness of BM25 in the context of focused information retrieval.", "paper_title": "Using proximity and tag weights for focused retrieval in structured documents", "paper_id": "WOS:000356297500003"}