{"auto_keywords": [{"score": 0.04741892958012685, "phrase": "personality_variables"}, {"score": 0.008540083311507728, "phrase": "mobile_shopping_adoption"}, {"score": 0.00481495049065317, "phrase": "individual_personality_factors"}, {"score": 0.00475070135279933, "phrase": "m-shopping_acceptance"}, {"score": 0.004309725894724034, "phrase": "classical_technology_acceptance_model"}, {"score": 0.004280868238224526, "phrase": "tam"}, {"score": 0.004223708778943785, "phrase": "behavioural_adoption_intention"}, {"score": 0.004195418010131832, "phrase": "mobile_shopping"}, {"score": 0.004016072233242585, "phrase": "tam_beliefs"}, {"score": 0.0038186039088445524, "phrase": "structural_equation_modelling_techniques"}, {"score": 0.0036430378180975667, "phrase": "findings_-_data_analysis"}, {"score": 0.0035702793079311896, "phrase": "perceived_usefulness"}, {"score": 0.003417565253539315, "phrase": "intention_formation"}, {"score": 0.003238517900104576, "phrase": "mobile_telephones"}, {"score": 0.003152531962718477, "phrase": "direct_and_positive_influence"}, {"score": 0.0029973957125353306, "phrase": "mobile_shopping_agents"}, {"score": 0.002888488567436329, "phrase": "m-services_adoption_rate"}, {"score": 0.002664375650349975, "phrase": "distance_shopping_systems"}, {"score": 0.002646501671714952, "phrase": "mobile_services"}, {"score": 0.00251620434048784, "phrase": "enjoyable_experience"}, {"score": 0.0024493494346360415, "phrase": "personality_factors"}, {"score": 0.0023682672729645714, "phrase": "unified_theory"}, {"score": 0.002206606452557159, "phrase": "tam_model"}, {"score": 0.0021407391538313786, "phrase": "explicit_rejection"}], "paper_keywords": ["Mobile communication systems", " Electronic commerce", " Innovation", " Consumer behaviour", " Spain"], "paper_abstract": "Purpose - The purpose of this paper is to evaluate how personality variables related to technology (innovativeness, compatibility and affinity) can modify the influence of classical technology acceptance model (TAM) variables on behavioural adoption intention of mobile shopping. Design/methodology/approach - The impact of innovativeness, compatibility, affinity, TAM beliefs (ease of use and usefulness) and attitude on mobile shopping adoption is tested through structural equation modelling techniques. The sample consisted of 470 Spanish mobile telephone users selected on the basis of convenience. Findings - Data analysis shows that the effect of perceived usefulness and, in a minor degree, perceived ease of use are over dimensioned if personality variables are omitted making intention formation to be perceived as more rational than it really is. Personality variables (affinity to mobile telephones, compatibility and innovativeness) have a direct and positive influence on the intention to engage in M-shopping. Practical implications - This research enables mobile shopping agents to know what aspects to highlight in their communication strategies to increase the M-services adoption rate. The complementary use of the mobile and the internet is recommended since the similarities between both methods may favour the acceptance of distance shopping systems. Mobile services should not be simply designed as easy to use, but also as an enjoyable experience. Originality/value - Despite the importance of personality factors on mobile shopping adoption, they were explicitly ignored when the unified theory of acceptance and use of technology was formulated. This research does not try to propose an extension of the TAM model, but analyses the degree in which the explicit rejection of personality variables could impoverish its performance.", "paper_title": "Exploring individual personality factors as drivers of M-shopping acceptance", "paper_id": "WOS:000268623900009"}