{"auto_keywords": [{"score": 0.04924496525218245, "phrase": "failure_modes"}, {"score": 0.010308505400235118, "phrase": "individual_judgments"}, {"score": 0.007900543882460484, "phrase": "proposed_approach"}, {"score": 0.004519665344659923, "phrase": "risk_assessment_process"}, {"score": 0.003659597920882104, "phrase": "new_fuzzy_fmea_approach"}, {"score": 0.0035082436540296406, "phrase": "intra-personal_and_inter-personal_uncertainty"}, {"score": 0.003223995503078124, "phrase": "aggregated_data"}, {"score": 0.0031234247639701134, "phrase": "new_aggregation_method"}, {"score": 0.002983652306921617, "phrase": "group_judgment"}, {"score": 0.002880393760798211, "phrase": "optimal_weights"}, {"score": 0.002850116748762153, "phrase": "risk_factors"}, {"score": 0.002732149335827768, "phrase": "weighted_averaging_operator"}, {"score": 0.002628295539850913, "phrase": "continuous_scale"}, {"score": 0.002600661525224505, "phrase": "subtle_differences"}, {"score": 0.002537303919584199, "phrase": "ranking_method"}, {"score": 0.0023646398663605493, "phrase": "illustrative_example"}, {"score": 0.0022908146376201194, "phrase": "fuzzy-based_methods"}, {"score": 0.002242879896352752, "phrase": "additional_flexibility"}, {"score": 0.0021652024032375833, "phrase": "better_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Failure Mode and Effects Analysis", " Interval type-2 fuzzy sets", " Uncertainty"], "paper_abstract": "The analysis of failure modes and their effects generally requires dealing with uncertainty and subjectivity inherent in the risk assessment process. A review of the literature reveals that although a number of studies have examined these issues, none of them have explicitly studied the variation in one expert's understanding (intra-personal uncertainty) and the variations in the understanding among experts (inter-personal uncertainty) together. To address this problem, this paper proposes a new fuzzy FMEA approach based on IT2 fuzzy sets, which has the ability to capture both intra-personal and inter-personal uncertainty. The approach introduces three methods that are new for the analysis of failure modes. First, to provide a more accurate representation of the aggregated data by preserving the variations among the individual judgments a new aggregation method is suggested. It transforms individual judgments in form of intervals into a group judgment in form of an IT2 FN. Second, to allow considering optimal weights for the risk factors and thereby developing more flexible structures for their synthesis, an a-cut based ordered weighted averaging operator is adapted. Finally, to rank failure modes on a continuous scale and reflect subtle differences in the assessments properly, a ranking method for IT2 FNs based on a-cuts is adopted. The applicability and effectiveness of the proposed approach is demonstrated by an illustrative example. Comparisons with the results of crisp- and fuzzy-based methods demonstrate that the proposed approach offers additional flexibility to the experts in making judgments and provides a better modeling of uncertainty. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Risk prioritization in Failure Mode and Effects Analysis using interval type-2 fuzzy sets", "paper_id": "WOS:000356904100017"}