{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wordnet"}, {"score": 0.042669878017920625, "phrase": "small_set"}, {"score": 0.04230080921207108, "phrase": "atomic_words"}, {"score": 0.004728780808284175, "phrase": "good_definitions"}, {"score": 0.0045200127552893704, "phrase": "defined_word"}, {"score": 0.003400274964240732, "phrase": "larger_set"}, {"score": 0.003148709618042979, "phrase": "next_hierarchically_higher_set"}, {"score": 0.0029289191071848403, "phrase": "possible_organizations"}, {"score": 0.0025804616931593897, "phrase": "simple_model"}, {"score": 0.0025456716198597627, "phrase": "optimal_set"}, {"score": 0.0024440836179156593, "phrase": "seven_hierarchical_levels"}, {"score": 0.002162951519368368, "phrase": "economical_dictionary"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["vocabulary", " hierarchy", " optimality", " WordNet", " definition", " dictionary", " number of levels"], "paper_abstract": "Good definitions consist of words that are more basic than the defined word. There are, however, many ways of satisfying this desideratum. For example, at one extreme, there could be a small set of atomic words that are used to de. ne all other words; i.e., there would be just two hierarchical levels. Alternatively, there could be many hierarchical levels, where a small set of atomic words is used to de. ne a larger set of words, and these are, in turn, used to de. ne the next hierarchically higher set of words, and so on to the top-level of very specific, complex words. Importantly, some possible organizations are more economical than others in the amount of space required to record all the definitions. Here I ask, How economical are dictionaries? I present a simple model for an optimal set of definitions, predicting on the order of seven hierarchical levels. I test the model via measurements from WordNet and the Oxford English Dictionary, and find that the organization of each possesses the signature features expected for an economical dictionary. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Economically organized hierarchies in WordNet and the Oxford English Dictionary", "paper_id": "WOS:000255728400004"}