{"auto_keywords": [{"score": 0.004559661374976129, "phrase": "human_intelligence"}, {"score": 0.004317848984770719, "phrase": "human_computation_games"}, {"score": 0.003907212558276185, "phrase": "competitive_versions"}, {"score": 0.0035515951985356374, "phrase": "collaborative_hcgs"}, {"score": 0.003257727050827128, "phrase": "different_hcg_genres"}, {"score": 0.0032282396745967504, "phrase": "computational_performance"}, {"score": 0.0026307897899760383, "phrase": "manual_tagging"}, {"score": 0.002491015208328868, "phrase": "image_tags"}, {"score": 0.0024349853033241663, "phrase": "users'_perceptions"}, {"score": 0.002305589818994465, "phrase": "tag_quality"}, {"score": 0.002233301265743633, "phrase": "collaborative_and_competitive_image_tagging_hcgs"}, {"score": 0.0021049977753042253, "phrase": "better_quality_tags"}], "paper_keywords": [""], "paper_abstract": "Applications that use games to harness human intelligence to perform various computational tasks are increasing in popularity and may be termed human computation games (HCGs). Most HCGs are collaborative in nature, requiring players to cooperate within a game to score points. Competitive versions, where players work against each other, are a more recent entrant, and have been claimed to address shortcomings of collaborative HCGs such as quality of computation. To date, however, little work has been conducted in understanding how different HCG genres influence computational performance and players' perceptions of such. In this paper we study these issues using image tagging HCGs in which users play games to generate keywords for images. Three versions were created: collaborative HCG, competitive HCG, and a control application for manual tagging. The applications were evaluated to uncover the quality of the image tags generated as well as users' perceptions. Results suggest that there is a tension between entertainment and tag quality. While participants reported liking the collaborative and competitive image tagging HCGs over the control application, those using the latter seemed to generate better quality tags. Implications of the work are discussed.", "paper_title": "Fight or Unite: Investigating Game Genres for Image Tagging", "paper_id": "WOS:000291953800009"}