{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_preparation_language"}, {"score": 0.04297094890897633, "phrase": "large-scale_msr_studies"}, {"score": 0.004771196027464407, "phrase": "large-scale_mining_software_repositories_studies"}, {"score": 0.004516856326107826, "phrase": "software_repository_data"}, {"score": 0.004276016541197123, "phrase": "existing_approaches"}, {"score": 0.00419861271409079, "phrase": "msr_analysis"}, {"score": 0.0037626342268042997, "phrase": "custom_scaling_tricks"}, {"score": 0.0034027387694902287, "phrase": "web_community"}, {"score": 0.0032064196784562017, "phrase": "web_analyses"}, {"score": 0.003119659433566212, "phrase": "enormous_growth"}, {"score": 0.003091262582401731, "phrase": "web_data"}, {"score": 0.0029128614098881253, "phrase": "web-scale_platform"}, {"score": 0.0026220103561723066, "phrase": "web_platform"}, {"score": 0.002370955769074803, "phrase": "msr_researchers"}, {"score": 0.0022857351723674004, "phrase": "pig's_scalability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software engineering", " Mining Software Repositories", " Pig", " MapReduce"], "paper_abstract": "The Mining Software Repositories (MSR) field analyzes software repository data to uncover knowledge and assist development of ever growing, complex systems. However, existing approaches and platforms for MSR analysis face many challenges when performing large-scale MSR studies. Such approaches and platforms rarely scale easily out of the box. Instead, they often require custom scaling tricks and designs that are costly to maintain and that are not reusable for other types of analysis. We believe that the web community has faced many of these software engineering scaling challenges before, as web analyses have to cope with the enormous growth of web data. In this paper, we report on our experience in using a web-scale platform (i.e., Pig) as a data preparation language to aid large-scale MSR studies. Through three case studies, we carefully validate the use of this web platform to prepare (i.e., Extract, Transform, and Load, ETL) data for further analysis. Despite several limitations, we still encourage MSR researchers to leverage Pig in their large-scale studies because of Pig's scalability and flexibility. Our experience report will help other researchers who want to scale their analyses. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Using Pig as a data preparation language for large-scale mining software repositories studies: An experience report", "paper_id": "WOS:000307793600002"}