{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "number_field_sieve"}, {"score": 0.004771196027464407, "phrase": "polynomial_selection"}, {"score": 0.003867206750827, "phrase": "good_polynomials"}, {"score": 0.0036441884295335502, "phrase": "polynomial_coefficients"}, {"score": 0.003418327319110734, "phrase": "zero_roots"}, {"score": 0.003265591844292821, "phrase": "ending_coefficient"}, {"score": 0.0028995712226514746, "phrase": "complete_discrimination_system"}, {"score": 0.0026461080202599694, "phrase": "necessary_condition"}, {"score": 0.0025862736445290088, "phrase": "degree_d"}, {"score": 0.002203570941628287, "phrase": "nonlinear_method"}, {"score": 0.0021049977753042253, "phrase": "practical_purpose"}], "paper_keywords": ["cryptography", " integer factorization", " number field sieve", " polynomial selection", " coefficients", " zero roots", " complete discrimination system"], "paper_abstract": "Polynomial selection is very important in the number field sieve. If the number of relations a pair of polynomials can generate is closely correlated with the coefficients of the polynomials, we can select polynomials by checking the coefficients first, which can speed up the selection of good polynomials. In this paper, we aim to study the correlation between polynomial coefficients and the number of relations the polynomials can generate. By analyzing the zero roots, it is found that a polynomial with the ending coefficient containing more small primes usually can generate more relations than the one whose ending coefficient contains less. As a polynomial with more real roots usually can generate more relations, using the complete discrimination system, the requirements on the coefficients of a polynomial to obtain more real roots are analyzed. For instance, a necessary condition for a polynomial of degree d to have d distinct real roots is that the coefficient of degree d-2 should be negative or small enough. The result in the case d = 3 can be used directly in selecting polynomials generated by the nonlinear method, where d = 3 is already enough for practical purpose.", "paper_title": "On the coefficients of the polynomial in the number field sieve", "paper_id": "WOS:000365129500014"}