{"auto_keywords": [{"score": 0.03510210731999267, "phrase": "success_probability"}, {"score": 0.013411296656780257, "phrase": "mutually_unbiased_bases"}, {"score": 0.00481495049065317, "phrase": "post-measurement_information"}, {"score": 0.004742642920057203, "phrase": "new_state_discrimination_problem"}, {"score": 0.004657299036322549, "phrase": "additional_information"}, {"score": 0.004464061452094005, "phrase": "quantum_memory"}, {"score": 0.004357245559948974, "phrase": "important_role"}, {"score": 0.004330941610682453, "phrase": "quantum_cryptographic_protocols"}, {"score": 0.004291781840734823, "phrase": "bounded_storage_model"}, {"score": 0.004176405358988595, "phrase": "unknown_basis"}, {"score": 0.0038953958723049287, "phrase": "quantum_information"}, {"score": 0.003813669883040509, "phrase": "classical_information"}, {"score": 0.003535489842686145, "phrase": "initial_measurement_outcome"}, {"score": 0.003297461568377559, "phrase": "balanced_function"}, {"score": 0.0031990183472675377, "phrase": "naive_strategy"}, {"score": 0.0028857130140890787, "phrase": "possible_input_strings"}, {"score": 0.0026188490199688013, "phrase": "additional_basis_information"}, {"score": 0.0025794354905140527, "phrase": "boolean_function"}, {"score": 0.002517600815544647, "phrase": "optimal_bounds"}, {"score": 0.002449823293233138, "phrase": "xor"}, {"score": 0.0023125950237602518, "phrase": "basis_information"}, {"score": 0.0021049977753042253, "phrase": "extra_information"}], "paper_keywords": ["bounded quantum storage", " quantum cryptography", " state discrimination"], "paper_abstract": "We introduce a new state discrimination problem in which we are given additional information about the state after the measurement, or more generally, after a quantum memory bound applies. The following special case plays an important role in quantum cryptographic protocols in the bounded storage model: Given a string x encoded in an unknown basis chosen from a set of mutually unbiased bases (MUBs), you may perform any measurement, but then store at most q qubits of quantum information, and an unlimited amount of classical information. Later on, you learn which basis was used. How well can you compute a function f(x) of x, given the initial measurement outcome, the q qubits, and the additional basis information? We first show a lower bound on the success probability for any balanced function, and any number of mutually unbiased bases, beating the naive strategy of simply guessing the basis. We then show that for two bases, any Boolean function f(x) can be computed perfectly if you are allowed to store just a single qubit, independent of the number of possible input strings x. However, we show how to construct three bases, such that you need to store all qubits in order to compute f(x) perfectly. We then investigate how much advantage the additional basis information can give for a Boolean function. To this end, we prove optimal bounds for the success probability for the AND and the XOR function for up to three mutually unbiased bases. Our result shows that the gap in success probability can be maximal: without the basis information, you can never do better than guessing the basis, but with this information, you can compute f(x) perfectly. We also give an example where the extra information does not give any advantage at all.", "paper_title": "State discrimination with post-measurement information", "paper_id": "WOS:000258913400020"}