{"auto_keywords": [{"score": 0.015466891927975911, "phrase": "academic_community"}, {"score": 0.015218070728750142, "phrase": "digital_libraries"}, {"score": 0.010993968886849857, "phrase": "supervised_classification"}, {"score": 0.010922563515440072, "phrase": "web_correlations"}, {"score": 0.010851616830300337, "phrase": "authorship_correlations"}, {"score": 0.00481495049065317, "phrase": "web_and_authorship_correlations"}, {"score": 0.004583878086896926, "phrase": "latest_work"}, {"score": 0.003903269701018361, "phrase": "\"name_ambiguity_problem"}, {"score": 0.003814632693659797, "phrase": "multiple_authors"}, {"score": 0.003548905904860611, "phrase": "last_name"}, {"score": 0.003378385493203297, "phrase": "disambiguate_names"}, {"score": 0.0031326477464204768, "phrase": "publication_lists"}, {"score": 0.0027833043858224078, "phrase": "e-mail_addresses"}, {"score": 0.002640781900605126, "phrase": "pair-wise_similarity_metrics"}, {"score": 0.0025892330566358503, "phrase": "binary_classifier"}, {"score": 0.0024566237485691383, "phrase": "pair-wise_similarity"}, {"score": 0.002377206033025253, "phrase": "group_citations"}, {"score": 0.002361632539339945, "phrase": "different_clusters"}, {"score": 0.0023079225317714815, "phrase": "individual_author"}, {"score": 0.0022406537579986842, "phrase": "name_disambiguation_accuracy"}, {"score": 0.0021753413850499467, "phrase": "name_clusters"}, {"score": 0.0021610874773389096, "phrase": "high_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Author name disambiguation", " Citation analysis", " Web correlation", " Authorship correlation"], "paper_abstract": "Members of the academic community have increasingly turned to digital libraries to search for the latest work of their peers. On account of their role in the academic community, it is very important that these digital libraries collect citations in a consistent, accurate, and up-to-date manner, yet they do not correctly compile citations for myriads of authors for various reasons including authors with the same name, a problem known as the \"name ambiguity problem.\" This problem occurs when multiple authors share the same name and particularly when names are simplified as in cases where names merely contain the first initial and the last name. This paper proposes a reliable and accurate pair-wise similarities approach to disambiguate names using supervised classification on Web correlations and authorship correlations. This approach makes use of Web correlations among citations assuming citations that co-refer on publication lists on the Web should to refer to the same author. This approach also makes use of authorship correlations assuming citations with the same rare author name refer to the same author, and furthermore, citations with the same full names of authors or e-mail addresses likely refer to the same author. These two types of correlations are measured in our approach using pair-wise similarity metrics. In addition, a binary classifier, as part of supervised classification, is applied to label matching pairs of citations using pair-wise similarity metrics, and these labels are then used to group citations into different clusters such that each cluster represents an individual author. Results show our approach greatly improves upon the name disambiguation accuracy and performance of other proposed approaches, especially in some name clusters with high degree of ambiguity. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Disambiguating authors in citations on the web and authorship correlations", "paper_id": "WOS:000305863300020"}