{"auto_keywords": [{"score": 0.04953787572055814, "phrase": "resource_selection_games"}, {"score": 0.01679872929969293, "phrase": "strong_equilibrium"}, {"score": 0.005028337756875734, "phrase": "increasing_cost_functions"}, {"score": 0.00484137110567931, "phrase": "super_strong_equilibrium"}, {"score": 0.004814966079953497, "phrase": "structured"}, {"score": 0.004653485665080485, "phrase": "coalitional_deviations"}, {"score": 0.004248782702870078, "phrase": "prescribed_coalitions"}, {"score": 0.004090682761004765, "phrase": "classical_concept"}, {"score": 0.003320277992107974, "phrase": "closer_look"}, {"score": 0.0032951702142329357, "phrase": "severe_limitations"}, {"score": 0.0032209766681045365, "phrase": "existence_result"}, {"score": 0.0031724417545242315, "phrase": "simplest_case"}, {"score": 0.002574523719093119, "phrase": "identical_resources"}, {"score": 0.002488001663771768, "phrase": "similar_existence_results"}, {"score": 0.002368120987066921, "phrase": "repeated_games"}, {"score": 0.0022115879730677, "phrase": "natural_concept"}, {"score": 0.0021453734588569823, "phrase": "positive_and_applicable_results"}, {"score": 0.0021049977753042253, "phrase": "basic_domains"}], "paper_keywords": ["Coalitions", " partition", " resource selection games", " strong equilibrium", " repeated games"], "paper_abstract": "We study stability against coalitional deviations in resource selection games where the coalitions have a certain structure. In particular, the agents are partitioned into coalitions, and only deviations by the prescribed coalitions are considered. This is in contrast to the classical concept of strong equilibrium according to which any subset of the agents may deviate. In resource selection games, each agent selects a resource from a set of resources, and its payoff is an increasing (or nondecreasing) function of the number of agents selecting its resource. While it has been shown that a strong equilibrium always exists in resource selection games, a closer look reveals severe limitations to the applicability of the existence result even in the simplest case of two identical resources with increasing cost functions. First, these games do not possess a super strong equilibrium in which a fruitful deviation benefits at least one deviator without hurting any other deviator. Second, a strong equilibrium may not exist when the game is played repeatedly. We prove that for any given partition, there exists a super strong equilibrium for resource selection games of identical resources with increasing cost functions. In addition, we show similar existence results for a variety of other classes of resource selection games. For the case of repeated games, we characterize partitions that guarantee the existence of a strong equilibrium. Together, our work introduces a natural concept, which turns out to lead to positive and applicable results in one of the basic domains studied in the literature.", "paper_title": "Structured Coalitions in Resource Selection Games", "paper_id": "WOS:000208994200004"}