{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "document_restoration"}, {"score": 0.00447115003744675, "phrase": "restoration_framework"}, {"score": 0.0043953478557600565, "phrase": "undesirable_distortions"}, {"score": 0.004345525254560329, "phrase": "imaged_documents"}, {"score": 0.0039216854691927865, "phrase": "non-uniform_illumination"}, {"score": 0.003789763907758991, "phrase": "printed_content"}, {"score": 0.0024700776739384977, "phrase": "different_real-world_applications"}, {"score": 0.002386869729952315, "phrase": "synthetic_and_real_documents"}, {"score": 0.0022933216359142736, "phrase": "ocr_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Document image restoration", " Shading distortion", " Perspective distortion", " Geometric warping", " Digital inpainting", " RBF-based smoothing", " Shape-from-shading", " Physically based flattening"], "paper_abstract": "We present a restoration framework to reduce undesirable distortions in imaged documents. Our framework is based on two components: (1) an image inpainting procedure that can separate non-uniform illumination (and other) artifacts from the printed content and (2) a shape-from-shading (SfS) formulation that can reconstruct the 3D shape of the document's Surface. Used either piecewise or in its entirety, this framework can correct a variety of distortions including shading, shadow, ink-bleed, show-through, perspective and geometric distortions, for both camera-imaged and flatbed-imaged documents. Our overall framework is described in detail. In addition, our SfS formulation can be easily modified to target various illumination conditions to suit different real-world applications. Results on images of synthetic and real documents demonstrate the effectiveness of our approach. OCR results are also used to gauge the performance of our approach. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A unified framework for document restoration using inpainting and shape-from-shading", "paper_id": "WOS:000268453800052"}