{"auto_keywords": [{"score": 0.04719839762621183, "phrase": "competition_layer"}, {"score": 0.02722386537508232, "phrase": "ascpn"}, {"score": 0.007152368807539886, "phrase": "soft_competition"}, {"score": 0.006044049674368069, "phrase": "hard_competition_mechanism"}, {"score": 0.004716520738331953, "phrase": "traditional_cpn-like_network"}, {"score": 0.004417848254181138, "phrase": "over-many_neurons"}, {"score": 0.0038758293658651237, "phrase": "adaptive_counter_propagation_network"}, {"score": 0.003680587852807675, "phrase": "adaptive_parameter"}, {"score": 0.003543667617024855, "phrase": "learning_process"}, {"score": 0.003483120583663528, "phrase": "dead_neurons\"_problem"}, {"score": 0.0034472883424839346, "phrase": "initial_weights"}, {"score": 0.0034000828197314264, "phrase": "soft_competition_mechanism"}, {"score": 0.0032065418360603293, "phrase": "deferent_signal"}, {"score": 0.0031626225189867354, "phrase": "soft_competitive_function"}, {"score": 0.003097865379563127, "phrase": "new_mapping_function"}, {"score": 0.0030135741897058844, "phrase": "fast_convergence"}, {"score": 0.002982557900944478, "phrase": "mapping_functions"}, {"score": 0.002793380001054064, "phrase": "least_amount"}, {"score": 0.002571429085596686, "phrase": "proposed_ascpn_model"}, {"score": 0.0023670716500937667, "phrase": "continuous_data"}, {"score": 0.002310578855290687, "phrase": "categorical_attributes"}, {"score": 0.002294686545883412, "phrase": "cpn_and_cpnbsm_models"}, {"score": 0.00226322835801988, "phrase": "existing_models"}, {"score": 0.0021789194955896124, "phrase": "improved_model"}], "paper_keywords": ["counter propagation network", " soft competition", " neural network", " adaptive"], "paper_abstract": "Two defects are existed in traditional CPN-like network and its learning method. One is that the number in competition layer is difficult to be decided. Over-many neurons in competition layer will create many \"dead neurons\", whereas fewer neurons in competition one will make the competition layer unstable. The other is that hard competition mechanism is adopted which weakens generalization of network. In this paper, an adaptive counter propagation network based on soft competition named ASCPN and its approach are proposed. In ASCPN, an adaptive parameter is used to generate the nodes of competition layer automatically in learning process. It overcomes \"dead neurons\" problem and improves initial weights in competition layer. Soft competition mechanism is also employed instead of hard competition mechanism in the competition layer, which makes more than one neurons in competition layer have deferent signal. Other than soft competitive function proposed by other researchers, a new mapping function is employed in ASCPN, which has fast convergence than existed mapping functions. Because the efficiency of neurons in competition layer is improved sufficiently, ASCPN can work well with the least amount of neurons and come true the required capability of network. A number of experiments are performed to study the performance of the proposed ASCPN model and algorithm. In order to illustrate the performance of ASCPN, two different kinds of datasets were used. One is a set of continuous data, the other is datasets with categorical attributes. CPN and CPNBSM models are chosen as existing models to be compared with. The experiment reveals that the improved model ASCPN runs faster and better efficiency and prediction than other CPN-like networks. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "An adaptive counter propagation network based on soft competition", "paper_id": "WOS:000255436100012"}