{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "optimal_resource_allocation"}, {"score": 0.004668957916795845, "phrase": "orthogonal_multi-access_relay_channels"}, {"score": 0.00421340730888561, "phrase": "half-duplex_relay"}, {"score": 0.004085579055228594, "phrase": "orthogonal_channels"}, {"score": 0.003941319912895672, "phrase": "instantaneous_fading_state_information"}, {"score": 0.003782655283668953, "phrase": "maximum_sum-rate"}, {"score": 0.003724810609448597, "phrase": "optimal_user_and_relay_power_allocations"}, {"score": 0.0033096502887394264, "phrase": "df_sum-rate"}, {"score": 0.00325901518290063, "phrase": "optimal_user"}, {"score": 0.0022856052476424344, "phrase": "first_two_types"}, {"score": 0.002262209824105154, "phrase": "cutset_outer_bounds"}, {"score": 0.002159852420283463, "phrase": "capacity_region"}, {"score": 0.0021049977753042253, "phrase": "clustered_orthogonal_marcs"}], "paper_keywords": ["Decode-and-forward", " ergodic capacity", " fading", " multiple-access relay channel (MARC)", " resource allocation"], "paper_abstract": "The problem of optimal resource allocation is studied for ergodic fading orthogonal multi-access relay channels (MARCs) in which the users (sources) communicate with a destination with the aid of a half-duplex relay that transmits and receives on orthogonal channels. Under the assumption that the instantaneous fading state information is available at all nodes, the maximum sum-rate and the optimal user and relay power allocations (policies) are developed for a decode-and-forward (DF) relay. A known lemma on the sum-rate of two intersecting poly-matroids is used to determine the DF sum-rate and the optimal user and relay policies, and to classify fading MARCs into one of three types: (i) partially clustered MARCs in which a user is clustered either with the relay or with the destination, (ii) clustered MARCs in which all users are either proximal to the relay or to the destination, and (iii) arbitrarily clustered MARCs which are a combination of the first two types. Cutset outer bounds are used to show that DF achieves the capacity region for a sub-class of clustered orthogonal MARCs.", "paper_title": "Fading Multiple Access Relay Channels: Achievable Rates and Opportunistic Scheduling", "paper_id": "WOS:000288459100006"}