{"auto_keywords": [{"score": 0.04722612682563672, "phrase": "grid_convergence_studies"}, {"score": 0.027895402021148232, "phrase": "grid_densities"}, {"score": 0.00481495049065317, "phrase": "low-order_three-dimensional_potential-based_panel_codes"}, {"score": 0.004603115982404017, "phrase": "three-dimensional_potential_flow"}, {"score": 0.004364696693320128, "phrase": "low-order_potential-based_panel_methods"}, {"score": 0.0040713749949601915, "phrase": "benchmark_problem"}, {"score": 0.004021689117050817, "phrase": "non-lifting_potential_flow"}, {"score": 0.003908091457759849, "phrase": "conventional_non-orthogonal_grids"}, {"score": 0.003736004578001584, "phrase": "grid_orthogonality"}, {"score": 0.0036903962975894634, "phrase": "grid_singularity"}, {"score": 0.0036156119373414067, "phrase": "oscillating_behaviour"}, {"score": 0.0034847851398628546, "phrase": "extreme_deviations"}, {"score": 0.003372460634140967, "phrase": "conventional_grids"}, {"score": 0.003145609726536791, "phrase": "error_norms"}, {"score": 0.0030818310926031024, "phrase": "metric_components"}, {"score": 0.0026920404458807444, "phrase": "metric_errors"}, {"score": 0.0024398167078355224, "phrase": "surface_velocity_components"}, {"score": 0.002303720729387236, "phrase": "properly_chosen_grid_densities"}, {"score": 0.002157433262687853, "phrase": "practical_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "A verification study of two different panel codes for three-dimensional potential flow is performed by grid convergence studies. The two codes used in this study implement low-order potential-based panel methods and were conceived for propeller applications. The results of the grid convergence studies are presented for the benchmark problem of the non-lifting potential flow past an ellipsoid with three unequal axes. Conventional non-orthogonal grids and orthogonal grids are used. The effect of the grid orthogonality near the grid singularity is investigated. An oscillating behaviour of the solution is observed in grids with extreme deviations from orthogonality, which are typical of conventional grids used on lifting surfaces. The oscillations disappear as the grid approaches orthogonality. Results of error norms are presented for the metric components, perturbation potential, surface velocity components and pressure. Near second-order convergence is achieved for the potential for the two grid types. The error in the pressure appears to be strongly related to the metric errors. For the range of grid densities used in this study, which goes beyond the grid densities used in practice for lifting surfaces, the results for the surface velocity components and pressure may be still far from reaching their asymptotic behaviour. However, for properly chosen grid densities, error levels can be found for the velocities and pressure which are acceptable for practical applications. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "A verification study on low-order three-dimensional potential-based panel codes", "paper_id": "WOS:000232943700004"}