{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "supplementary_materials"}, {"score": 0.0033388871136347704, "phrase": "findings_-_large_publishers"}, {"score": 0.0029147175927233546, "phrase": "even_journals"}, {"score": 0.0027514186391258263, "phrase": "lis_articles"}, {"score": 0.0027176309244222, "phrase": "methodological_explanations"}, {"score": 0.0026953359825383624, "phrase": "additional_results"}, {"score": 0.0026403934420630155, "phrase": "textual_information"}, {"score": 0.002618730478351454, "phrase": "pdf_or_word_files"}, {"score": 0.0025865679621853667, "phrase": "toll-access_journals"}, {"score": 0.0024215727801940434, "phrase": "new_insights"}, {"score": 0.002276439636865258, "phrase": "journal_publishers"}, {"score": 0.0021224200236681498, "phrase": "data_sharing_initiatives"}, {"score": 0.0021049977753042253, "phrase": "academic_settings"}], "paper_keywords": ["Library and information science", " Journals", " Bibliometrics", " Scholarly publishing", " Supplementary materials", " Data sharing", " Publishing"], "paper_abstract": "Purpose - This study seeks to analyse the policies of library and information science (US) journals regarding the publication of supplementary materials, the number of journals and articles that include this feature, the kind of supplementary materials published with regard to their function in the article, the formats employed and the access provided to readers. Design/methodology/approach - The study analysed the instructions for authors of US journals indexed in the ISI Journal Citation Reports, as well as the supplementary materials attached to the articles published in their 2011 online volumes. Findings - Large publishers are more likely to have a policy regarding the publication of supplementary materials, and policies are usually homogeneous across all the journals of a given publisher. Most policies state the acceptance of supplementary materials, and even journals without a policy also publish supplementary materials. The majority of supplementary materials provided in LIS articles are extended methodological explanations and additional results in the form of textual information in PDF or Word files. Some toll-access journals provide open access to any reader to these files. Originality/value - This study provides new insights into the characteristics of supplementary materials in US journals. The results may be used by journal publishers to establish a policy on the publication of supplementary materials and, more broadly, to develop data sharing initiatives in academic settings.", "paper_title": "Provision of supplementary materials in library and information science scholarly journals", "paper_id": "WOS:000325953900003"}