{"auto_keywords": [{"score": 0.04854250213020111, "phrase": "utility_networks"}, {"score": 0.00852708142148034, "phrase": "case_study"}, {"score": 0.006260374481744949, "phrase": "netherlands"}, {"score": 0.0045850648862091085, "phrase": "increasing_complexity"}, {"score": 0.004486432283770142, "phrase": "modern_land_use"}, {"score": 0.004068087482412997, "phrase": "legal_space"}, {"score": 0.003512316100836984, "phrase": "turkey"}, {"score": 0.0034180197255306117, "phrase": "queensland"}, {"score": 0.0033810457232837316, "phrase": "australia"}, {"score": 0.0026033756286033285, "phrase": "obligatory_registration"}, {"score": 0.0024253827365474734, "phrase": "separate_temporal_attributes"}, {"score": 0.00230932021677234, "phrase": "temporal_changes"}, {"score": 0.002151388538895855, "phrase": "current_practice"}], "paper_keywords": ["cadastre", " land administration", " 4D cadastre", " spatio-temporal data models", " utility networks"], "paper_abstract": "The increasing complexity and flexibility of modern land use requires that cadastres need to manage information on the third and temporal (fourth) dimension. This article considers the registration of legal space of utility networks in cadastre in this 3D + time (=4D) context. A requirement analysis in three countries that have methods to register utility networks complying with their legal, organizational and technical structure (Turkey, the Netherlands and Queensland, Australia) is the basis for three alternatives for 4D cadastre to register utility networks. The three alternatives are analysed with respect to legal, organizational and technical cadastral requirements. This article presents a case study and a prototype from the Netherlands. In this country by law utilities are considered to be real estate objects with obligatory registration of ownership and geometry. This study shows that the 3D space and separate temporal attributes approach (state-based model) is a very promising solution to maintain temporal changes of utility networks and that this approach is to be preferred above the current practice, where the 3D and temporal aspects are not considered when registering a network.", "paper_title": "Solutions for 4D cadastre - with a case study on utility networks", "paper_id": "WOS:000295467600007"}