{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "flexibility_investment"}, {"score": 0.04903863882355194, "phrase": "multi-objective_decision_making_method"}, {"score": 0.034955040547302, "phrase": "optimal_flexibility_investment_strategy"}, {"score": 0.004772818068176176, "phrase": "manufacturing_system"}, {"score": 0.00431388720289049, "phrase": "ever-changing_environment"}, {"score": 0.003586278948128509, "phrase": "flexibility_investment_strategy"}, {"score": 0.0031151864044353245, "phrase": "flexibility_investment_decisions"}, {"score": 0.00307431840409833, "phrase": "proposed_method"}, {"score": 0.00303398491761013, "phrase": "hierarchical_method"}, {"score": 0.002981026404927824, "phrase": "two-level_models"}, {"score": 0.0025778546800417808, "phrase": "proposed_models"}, {"score": 0.0024451427672857458, "phrase": "flexibility_configuration"}, {"score": 0.0023192471808039746, "phrase": "total_flexibility_configuration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Flexibility investment", " Multi-objective decision making", " Weight determination", " Flexible manufacturing system"], "paper_abstract": "In today's market, flexibility has received much concern of companies because of its important role in responding to the ever-changing environment. Most of the research in the literature on flexibility investment is focused on one objective, i.e. profit maximization. However, more and more company managers and customers pay much attention to another objective, i.e. production efficiency maximization. There is a need to develop flexibility investment strategy by considering these two objectives simultaneously. In this paper, we propose a multi-objective decision making method to derive the optimal flexibility investment strategy. Both efficiency and profit are taken into account as objectives when making flexibility investment decisions. The proposed method is a hierarchical method which composes of two-level models. Based on the characteristics of the models, a guideline is presented to help managers conveniently find out the optimal flexibility investment strategy. Simulation experiments are performed to verify the validity of the proposed models and guideline. The results of the simulation illustrate that the flexibility configuration obtained by following the guideline leads to benefit very close to total flexibility configuration, and much higher than 2-Skill Chain configuration; while the cost much less than total flexibility configuration, and even less than 2- Skill Chain configuration. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "On flexibility investment in manufacturing system: A multi-objective decision making method", "paper_id": "WOS:000291118500124"}