{"auto_keywords": [{"score": 0.009543629985088224, "phrase": "traditional_paper_maps"}, {"score": 0.00481495049065317, "phrase": "geographical_information_system"}, {"score": 0.004617328272121826, "phrase": "command_and_control_organization"}, {"score": 0.004454377387615279, "phrase": "claimed_benefits"}, {"score": 0.004375061788023814, "phrase": "geographical_information_systems"}, {"score": 0.0042459818200777846, "phrase": "emergency_response"}, {"score": 0.003951453722517865, "phrase": "gis-functionality"}, {"score": 0.0034016119212097826, "phrase": "eleven_teams"}, {"score": 0.0031845067058084583, "phrase": "real-time_data"}, {"score": 0.003071965703296204, "phrase": "firefighting_units"}, {"score": 0.0030171910207671205, "phrase": "fire_outbreak"}, {"score": 0.00247529638625566, "phrase": "saved_area"}, {"score": 0.002445767214680791, "phrase": "communication_volume"}, {"score": 0.0021953290937408807, "phrase": "exchanged_messages"}], "paper_keywords": [""], "paper_abstract": "This article tests the claimed benefits of using geographical information systems (GIS) in emergency response. An experimental study, which compares command and control (C2) teams using (a) a C2 tool with GIS-functionality and (b) traditional paper maps in a forest firefighting scenario, is presented. A total of 132 persons, forming 22 teams, participated in the study. Eleven teams had access to a C2 tool with GIS-functionality, which provided real-time data about the position of the firefighting units and the fire outbreak. The other 11 teams were using traditional paper maps. The result shows that the teams with access to the C2 tool with GIS-functionality performed significantly better than the teams using the traditional paper maps in terms of saved area. Communication volume was reduced in the case of the C2 teams using the C2 tool with GIS-functionality. The content of exchanged messages was also significantly different in the two settings.", "paper_title": "The Effect of a Geographical Information System on Performance and Communication of a Command and Control Organization", "paper_id": "WOS:000275222600009"}