{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "lifted_inference"}, {"score": 0.010518201916160912, "phrase": "jaeger"}, {"score": 0.008429312638804419, "phrase": "earlier_results"}, {"score": 0.004720269202737973, "phrase": "big_challenges"}, {"score": 0.0044826811976193485, "phrase": "inference_techniques"}, {"score": 0.004342430078306461, "phrase": "abstract_model_representation_language"}, {"score": 0.0041074234667687875, "phrase": "numerous_approaches"}, {"score": 0.0037935066882208235, "phrase": "significantly_more_efficient_inference"}, {"score": 0.0037485269508155516, "phrase": "specific_models"}, {"score": 0.0034208822062692127, "phrase": "lower_complexity_bounds"}, {"score": 0.0030239842475439814, "phrase": "probabilistic_relational_models"}, {"score": 0.002726740692380339, "phrase": "modeling_languages"}, {"score": 0.002478297575597511, "phrase": "netime"}, {"score": 0.0024488741651828446, "phrase": "etime"}, {"score": 0.0024006068621542642, "phrase": "polynomial_lifted_inference_algorithm"}, {"score": 0.0021645053655350703, "phrase": "approximate_inference"}, {"score": 0.0021387992835532367, "phrase": "knowledge_bases"}, {"score": 0.0021049977753042253, "phrase": "equality_predicate"}], "paper_keywords": ["Probabilistic-logic models", " lifted inference"], "paper_abstract": "One of the big challenges in the development of probabilistic relational (or probabilistic logical) modeling and learning frameworks is the design of inference techniques that operate on the level of the abstract model representation language, rather than on the level of ground, propositional instances of the model. Numerous approaches for such \"lifted inference\" techniques have been proposed. While it has been demonstrated that these techniques will lead to significantly more efficient inference on some specific models, there are only very recent and still quite restricted results that show the feasibility of lifted inference on certain syntactically defined classes of models. Lower complexity bounds that imply some limitations for the feasibility of lifted inference on more expressive model classes were established earlier in Jaeger (2000; Jaeger, M. 2000. On the complexity of inference about probabilistic relational models. Artificial Intelligence 117, 297-308). However, it is not immediate that these results also apply to the type of modeling languages that currently receive the most attention, i.e., weighted, quantifier-free formulas. In this paper we extend these earlier results, and show that under the assumption that NETIME not equal ETIME, there is no polynomial lifted inference algorithm for knowledge bases of weighted, quantifier-, and function-free formulas. Further strengthening earlier results, this is also shown to hold for approximate inference and for knowledge bases not containing the equality predicate.", "paper_title": "Lower complexity bounds for lifted inference", "paper_id": "WOS:000349668800005"}