{"auto_keywords": [{"score": 0.04960938517223395, "phrase": "indoor_localization"}, {"score": 0.02522607067724401, "phrase": "rfid"}, {"score": 0.00481495049065317, "phrase": "technological_assessment_of_radio_frequency_identification_technology"}, {"score": 0.00462919213721188, "phrase": "guiding_people"}, {"score": 0.004093453936415085, "phrase": "immediate_attention"}, {"score": 0.003974349782102708, "phrase": "inexperienced_facility_worker"}, {"score": 0.003858697684681798, "phrase": "building_component"}, {"score": 0.0032160319265621285, "phrase": "specific_location"}, {"score": 0.0026277995163948263, "phrase": "research_study"}, {"score": 0.0025638362414466278, "phrase": "technological_viability"}, {"score": 0.0025262061502713683, "phrase": "radio_frequency_identification"}, {"score": 0.0022890371899188466, "phrase": "multiple_field_tests"}, {"score": 0.0022665781920241245, "phrase": "real_operating_conditions"}, {"score": 0.0022113879114507577, "phrase": "carnegie_mellon_university"}, {"score": 0.0021896891011033105, "phrase": "hypothesis_tests"}, {"score": 0.0021682027434117095, "phrase": "k-nearest_neighborhood_algorithm"}, {"score": 0.0021049977753042253, "phrase": "technological_feasibility"}], "paper_keywords": [""], "paper_abstract": "Indoor localization is needed for guiding people who are not familiar with a facility. This need is more critical when guidance is needed to locate people or objects that need immediate attention. For example, an inexperienced facility worker might need to locate a building component (e.g., leaking pipe) for repair to prevent any damage to a facility or its residents. In such situations, an approach that can help the user to reach his/her destination point (i.e., a component of interest or a specific location in a facility) based on his/her current location is desired. To provide such guidance, the location of a person needs to be determined at a given point in time. This process is known as localization. The objective of this research study is to determine the technological viability of using radio frequency identification (RFID) to support localization. To assess the capability of RFID for localization, the writers conducted multiple field tests under real operating conditions within a facility at Carnegie Mellon University. Hypothesis tests and K-nearest neighborhood algorithm were used to determine the technological feasibility of RFID to support localization. The results showed that it is possible to identify the location of a user using this approach; however, some improvements in accuracy are needed.", "paper_title": "Technological Assessment of Radio Frequency Identification Technology for Indoor Localization", "paper_id": "WOS:000267053700004"}