{"auto_keywords": [{"score": 0.04720712072096041, "phrase": "firing_rate"}, {"score": 0.010370771206630863, "phrase": "bifurcation_transitions"}, {"score": 0.007773178095210002, "phrase": "firing_rate_curve"}, {"score": 0.006027997025544029, "phrase": "external_input_current"}, {"score": 0.00481495049065317, "phrase": "firing_rate_induced"}, {"score": 0.004741167616693272, "phrase": "phase_response_curve"}, {"score": 0.004632597963417253, "phrase": "dynamical_mechanisms"}, {"score": 0.0043215158337835706, "phrase": "invariant_circle"}, {"score": 0.004206236029936448, "phrase": "supercritical_andronov-hopf"}, {"score": 0.004094020585746358, "phrase": "snic"}, {"score": 0.004031238480458909, "phrase": "saddle-separatrix_loop"}, {"score": 0.0038634933357842302, "phrase": "subcritical_ah"}, {"score": 0.00374588874214601, "phrase": "ssl"}, {"score": 0.0031968441980848436, "phrase": "phase_response_curves"}, {"score": 0.00297037471252423, "phrase": "one-dimensional_space"}, {"score": 0.002925163163583017, "phrase": "si"}, {"score": 0.002554406040896888, "phrase": "calculated_slope"}, {"score": 0.002391779843744166, "phrase": "prc_size"}, {"score": 0.0021544587602892466, "phrase": "possible_increase"}, {"score": 0.0021049977753042253, "phrase": "ssl-to-ah_bifurcation_transition"}], "paper_keywords": [""], "paper_abstract": "We study dynamical mechanisms responsible for changes of the firing rate during four different bifurcation transitions in the two-dimensional Hindmarsh-Rose (2DHR) neuron model: the saddle node on an invariant circle (SNIC) bifurcation to the supercritical Andronov-Hopf (AH) one, the SNIC bifurcation to the saddle-separatrix loop (SSL) one, the AH bifurcation to the subcritical AH (SAH) one, and the SSL bifurcation to the AH one. For this purpose, we study slopes of the firing rate curve with respect to not only an external input current but also temperature that can be interpreted as a timescale in the 2DHR neuron model. These slopes are mathematically formulated with phase response curves (PRCs), expanding the firing rate with perturbations of the temperature and external input current on the one-dimensional space of the phase SI in the 2DHR oscillator. By analyzing the two different slopes of the firing rate curve with respect to the temperature and external input current, we find that during changes of the firing rate in all of the bifurcation transitions, the calculated slope with respect to the temperature also changes. This is largely dependent on changes in the PRC size that is also related to the slope with respect to the external input current. Furthermore, we find phase transition like switches of the firing rate with a possible increase of the temperature during the SSL-to-AH bifurcation transition.", "paper_title": "Changes of Firing Rate Induced by Changes of Phase Response Curve in Bifurcation Transitions", "paper_id": "WOS:000343186700002"}