{"auto_keywords": [{"score": 0.045592770462398936, "phrase": "lagged_co-cluster"}, {"score": 0.03189734652770148, "phrase": "optimal_lagged_co-cluster"}, {"score": 0.00481495049065317, "phrase": "lagged_data"}, {"score": 0.004707188147442449, "phrase": "mining_clusters"}, {"score": 0.0046018264570209765, "phrase": "lagged_relationship"}, {"score": 0.004550029253278477, "phrase": "data_objects"}, {"score": 0.003956971099850658, "phrase": "underlying_governing_regulatory_mechanism"}, {"score": 0.003853757393357659, "phrase": "real-life_settings"}, {"score": 0.0029920129598858545, "phrase": "np-complete_problem"}, {"score": 0.0029360049890445944, "phrase": "polynomial-time_monte-carlo_algorithm"}, {"score": 0.0028164399450837465, "phrase": "fixed_probability"}, {"score": 0.002366847878952636, "phrase": "artificial_and_real-world_test_environments"}, {"score": 0.0021049977753042253, "phrase": "relevant_and_coherent_lagged_co-clusters"}], "paper_keywords": ["Clustering", " Co-clustering", " Lagged clustering", " Time-lagged", " Data mining"], "paper_abstract": "The paper focuses on mining clusters that are characterized by a lagged relationship between the data objects. We call such clusters lagged co-clusters. A lagged co-cluster of a matrix is a submatrix determined by a subset of rows and their corresponding lag over a subset of columns. Extracting such subsets may reveal an underlying governing regulatory mechanism. Such a regulatory mechanism is quite common in real-life settings. It appears in a variety of fields: meteorology, seismic activity, stock market behavior, neuronal brain activity, river flow, and navigation, but a limited list of examples. Mining such lagged co-clusters not only helps in understanding the relationship between objects in the domain, but assists in forecasting their future behavior. For most interesting variants of this problem, finding an optimal lagged co-cluster is NP-complete problem. We present a polynomial-time Monte-Carlo algorithm for mining lagged co-clusters. We prove that, with fixed probability, the algorithm mines a lagged co-cluster which encompasses the optimal lagged co-cluster by a maximum 2 ratio columns overhead and completely no rows overhead. Moreover, the algorithm handles noise, anti-correlations, missing values, and overlapping patterns. The algorithm is extensively evaluated using both artificial and real-world test environments. The first enable the evaluation of specific, isolated properties of the algorithm. The latter (river flow and topographic data) enable the evaluation of the algorithm to efficiently mine relevant and coherent lagged co-clusters in environments that are temporal, i.e., time reading data and non-temporal.", "paper_title": "Sleeved co-clustering of lagged data", "paper_id": "WOS:000303129200003"}