{"auto_keywords": [{"score": 0.04765491130400518, "phrase": "knowledge_acquisition"}, {"score": 0.015719716506582538, "phrase": "small_and_medium_enterprises"}, {"score": 0.014805472696055434, "phrase": "knowledge_absorptive_capacity"}, {"score": 0.014616484926513813, "phrase": "innovation_performance"}, {"score": 0.01318776154063642, "phrase": "bicycle_industry"}, {"score": 0.004773476989344654, "phrase": "purpose_-_the_purpose"}, {"score": 0.003997476709625927, "phrase": "taiwan"}, {"score": 0.0037299231609021783, "phrase": "technical_and_industrial_experiences"}, {"score": 0.0032471982781283374, "phrase": "absorptive_capacity"}, {"score": 0.003205268682789165, "phrase": "knowledge_acquisition_activities"}, {"score": 0.0029776614744264724, "phrase": "sme_owners'_technical_and_industrial_experiences"}, {"score": 0.0028145455182562807, "phrase": "sme_personnel's_scientific_knowledge_collection"}, {"score": 0.0025808284847319528, "phrase": "future_studies"}, {"score": 0.0023257824499250653, "phrase": "sme_owner's_and_its_personnel's_contributions"}, {"score": 0.002236762786982225, "phrase": "concomitant_effects"}, {"score": 0.0021982976170703884, "phrase": "knowledge_absorption_capacity"}, {"score": 0.002169882514603539, "phrase": "firm's_innovation_performance"}, {"score": 0.0021049977753042253, "phrase": "previous_studies"}], "paper_keywords": ["Knowledge management", " Small to medium-sized enterprises", " Innovation", " Learning", " Bicycles", " Taiwan"], "paper_abstract": "Purpose - The purpose of this paper is to examine the relationship between knowledge acquisition, knowledge absorptive capacity, and innovation performance in small and medium enterprises (SMEs). Design/methodology/approach - Questionnaire data were collected from research and development (R&D) managers or owners of 49 SMEs of the bicycle industry in Taiwan. The questionnaire was designed to measure variables including knowledge absorptive capacity, knowledge acquisition of company, technical and industrial experiences of owner's and the R&D staff, innovation performance measures, and control variables. Findings - The results show that the depth and the breadth of its owner's technical and industrial experiences best explained absorptive capacity of an SME. In turn, the absorptive capacity and the knowledge acquisition activities of an SME affect its innovation performance. Research limitations/implications - The findings show that, first, SME owners' technical and industrial experiences are contributing factors to their companies' knowledge absorptive capacity; second, instead of R&D investment, SME personnel's scientific knowledge collection and diversity of knowledge sources contribute to innovation performance of companies. Because the data were limited to bicycle industry, future studies need to validate these findings in the SMEs of other industries. Originality/value - The value of the paper lies in the fact that SME owner's and its personnel's contributions to company's knowledge absorptive capacity and the concomitant effects of knowledge acquisition and knowledge absorption capacity on a firm's innovation performance are two issues seldom addressed in previous studies.", "paper_title": "Learning and innovation in small and medium enterprises", "paper_id": "WOS:000276515900010"}