{"auto_keywords": [{"score": 0.03403226359024741, "phrase": "bootstrap_percolation"}, {"score": 0.00481495049065317, "phrase": "monotone_cellular_automata"}, {"score": 0.00477190623242136, "phrase": "random_environment"}, {"score": 0.0046589847106386605, "phrase": "complete_generality"}, {"score": 0.004233284262727897, "phrase": "finite_subsets"}, {"score": 0.003987126862293129, "phrase": "'infected'_sites"}, {"score": 0.003857871979942733, "phrase": "product_measure"}, {"score": 0.0038348235692738783, "phrase": "density_p."}, {"score": 0.003688316529071842, "phrase": "infected_sites"}, {"score": 0.003174973355583627, "phrase": "arbitrary_update_rules"}, {"score": 0.0029722900280316216, "phrase": "u-bootstrap_percolation_models"}, {"score": 0.002833035775182696, "phrase": "phase_transitions"}, {"score": 0.0026680819883265574, "phrase": "critical_probability"}, {"score": 0.002543043781904587, "phrase": "critical_class"}, {"score": 0.0024384399939984163, "phrase": "supercritical_class"}], "paper_keywords": [""], "paper_abstract": "In this paper we study in complete generality the family of two-state, deterministic, monotone, local, homogeneous cellular automata in Z(d) with random initial configurations. Formally, we are given a set U = {X-1,...,X-m} of finite subsets of Z(d) \\ {0}, and an initial set A(0) subset of Z(d) of 'infected' sites, which we take to be random according to the product measure with density p. At time t is an element of N, the set of infected sites A(t) is the union of A(t-1) and the set of all x is an element of Z(d) such that x + X is an element of A(t-1) for some X is an element of U. Our model may alternatively be thought of as bootstrap percolation on Z(d) with arbitrary update rules, and for this reason we call it U-bootstrap percolation. In two dimensions, we give a classification of U-bootstrap percolation models into three classes -supercritical, critical and subcritical - and we prove results about the phase transitions of all models belonging to the first two of these classes. More precisely, we show that the critical probability for percolation on (Z/nZ)(2) is (log n)(-Theta(1)) for all models in the critical class, and that it is n(-Theta(1)) for all models in the supercritical class. The results in this paper are the first of any kind on bootstrap percolation considered in this level of generality, and in particular they are the first that make no assumptions of symmetry. It is the hope of the authors that this work will initiate a new, unified theory of bootstrap percolation on Z(d).", "paper_title": "Monotone Cellular Automata in a Random Environment", "paper_id": "WOS:000358452900008"}