{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_library"}, {"score": 0.015596097945024362, "phrase": "emblem_books"}, {"score": 0.0047386923107107645, "phrase": "antique_documents"}, {"score": 0.004288581530198804, "phrase": "historical_archives"}, {"score": 0.003611751858608048, "phrase": "broader_access"}, {"score": 0.0034016119212097826, "phrase": "digitalized_pages"}, {"score": 0.0033745298175222056, "phrase": "historic_spanish_documents"}, {"score": 0.0031028232755683674, "phrase": "powerful_user_interface"}, {"score": 0.0029931603112397084, "phrase": "bulletin_board"}, {"score": 0.002922207118572208, "phrase": "mail_boxes"}, {"score": 0.0028302049070944944, "phrase": "meeting_place"}, {"score": 0.0021647968783414504, "phrase": "intuitive_and_powerful_user_interface"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["documental databases", " Web interfaces", " virtual libraries", " emblem literature"], "paper_abstract": "Antique documents, which undoubtedly represent our cultural heritage and can be considered a very rich source of information, are kept in many countries only on libraries with historical archives. The antiquity and fragility of such documents makes their access very restricted. Considering that nowadays the Internet is one of the most interesting places to publish any kind of information, it seems logical to use it to both preserve our cultural heritage and provide a broader access to these documents. This work presents a virtual library that stores data, transcribed texts and digitalized pages of historic Spanish documents from the 16th-18th centuries. This virtual library has two main objectives: first, by offering a set of services, including a powerful user interface to search and browse the documents, a bulletin board, a chat, or mail boxes, the virtual library is transformed into a meeting place for researchers that use emblem books as sources of information for their studies. Second, the virtual library contributes to the preservation of emblem books. We shall describe in this work the project that led to the development of the Virtual Library of Emblem Books, showing its evolution from the beginning (simple search forms and answer pages) to its current state as a virtual library, focusing on the techniques used to build an intuitive and powerful user interface. Copyright (C) 2006 John Wiley & Sons, Ltd.", "paper_title": "The design of a Virtual Library of Emblem Books", "paper_id": "WOS:000237410500002"}