{"auto_keywords": [{"score": 0.03382952605284525, "phrase": "supply_chain_formation"}, {"score": 0.00481495049065317, "phrase": "dynamic_supply_chain_formation"}, {"score": 0.004542780650208743, "phrase": "downstream_services"}, {"score": 0.00445550467119693, "phrase": "complex_problem"}, {"score": 0.004219912413995784, "phrase": "large_number"}, {"score": 0.004187284711626886, "phrase": "service_resources"}, {"score": 0.004090901264701185, "phrase": "existing_approaches"}, {"score": 0.003981243132108877, "phrase": "complete_information"}, {"score": 0.003950453462399077, "phrase": "service_requirements"}, {"score": 0.0037125240439927114, "phrase": "real-world_situations"}, {"score": 0.003435092524339692, "phrase": "service_providers"}, {"score": 0.0031537270875516108, "phrase": "agent-mediated_coordination_approach"}, {"score": 0.0024784363584530976, "phrase": "tactical_level"}, {"score": 0.0022841153001549193, "phrase": "operational_level"}, {"score": 0.0022664208122072657, "phrase": "different_strategies"}, {"score": 0.0021049977753042253, "phrase": "simulated_experiments"}], "paper_keywords": ["Software agent", " Supply chain management", " Coordination", " Negotiation", " Distributed decision making", " Constraint satisfaction", " Quality of service (QoS)"], "paper_abstract": "Modern businesses are facing the challenge of effectively coordinating their supply chains from upstream to downstream services. It is a complex problem to search, schedule, and coordinate a set of services from a large number of service resources under various constraints and uncertainties. Existing approaches to this problem have relied on complete information regarding service requirements and resources, without adequately addressing the dynamics and uncertainties of the environments. The real-world situations are complicated as a result of ambiguity in the requirements of the services, the uncertainty of solutions from service providers, and the interdependencies among the services to be composed. This paper investigates the complexity of supply chain formation and proposes an agent-mediated coordination approach. Each agent works as a broker for each service type, dedicated to selecting solutions for each service as well as interacting with other agents in refining the decision making to achieve compatibility among the solutions. The coordination among agents concerns decision making at strategic, tactical, and operational level. At the strategic level, agents communicate and negotiate for supply chain formation; at the tactical level, argumentation is used by agents to communicate and understand the preferences and constraints of each other: at the operational level, different strategies are used for selecting the preferences. Based on this approach, a prototype has been implemented with simulated experiments highlighting the effectiveness of the approach. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Agent-based negotiation and decision making for dynamic supply chain formation", "paper_id": "WOS:000271359500008"}