{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_effort_estimation"}, {"score": 0.049509300669177574, "phrase": "learning_machines"}, {"score": 0.0447839370319534, "phrase": "single_learning_machines"}, {"score": 0.004617328272121826, "phrase": "next_research_frontier"}, {"score": 0.004388182727039715, "phrase": "existing_automated_ensembles"}, {"score": 0.00407161650109722, "phrase": "different_locality_approaches"}, {"score": 0.0037778009042360758, "phrase": "experimental_framework"}, {"score": 0.0035473867669654174, "phrase": "comprehensive_experimental_study"}, {"score": 0.0034841647157189985, "phrase": "locality_approaches"}, {"score": 0.003311067956326299, "phrase": "feature_selection"}, {"score": 0.0032912755695190163, "phrase": "regression_trees"}, {"score": 0.003081190713096043, "phrase": "see._results"}, {"score": 0.0030627682280971328, "phrase": "bagging_ensembles"}, {"score": 0.002919287408226361, "phrase": "different_data_sets"}, {"score": 0.002867227226349298, "phrase": "best_approaches"}, {"score": 0.002765867822046626, "phrase": "best_approach"}, {"score": 0.0023033100935570755, "phrase": "automated_ensembles"}, {"score": 0.002262209824105154, "phrase": "competitive_results"}, {"score": 0.002248674332264274, "phrase": "see."}, {"score": 0.00216263228969761, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software effort estimation", " Ensembles of learning machines", " Locality", " Empirical validation"], "paper_abstract": "Context: Ensembles of learning machines and locality are considered two important topics for the next research frontier on Software Effort Estimation (SEE). Objectives: We aim at (1) evaluating whether existing automated ensembles of learning machines generally improve SEEs given by single learning machines and which of them would be more useful; (2) analysing the adequacy of different locality approaches; and getting insight on (3) how to improve SEE and (4) how to evaluate/choose machine learning (ML) models for SEE. Method: A principled experimental framework is used for the analysis and to provide insights that are not based simply on intuition or speculation. A comprehensive experimental study of several automated ensembles, single learning machines and locality approaches, which present features potentially beneficial for SEE, is performed. Additionally, an analysis of feature selection and regression trees (RTs), and an investigation of two tailored forms of combining ensembles and locality are performed to provide further insight on improving SEE. Results: Bagging ensembles of RTs show to perform well, being highly ranked in terms of performance across different data sets, being frequently among the best approaches for each data set and rarely performing considerably worse than the best approach for any data set. They are recommended over other learning machines should an organisation have no resources to perform experiments to chose a model. Even though RTs have been shown to be more reliable locality approaches, other approaches such as k-Means and k-Nearest Neighbours can also perform well, in particular for more heterogeneous data sets. Conclusion: Combining the power of automated ensembles and locality can lead to competitive results in SEE. By analysing such approaches, we provide several insights that can be used by future research in the area. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Ensembles and locality: Insight on improving software effort estimation", "paper_id": "WOS:000320685200011"}