{"auto_keywords": [{"score": 0.03160565108409031, "phrase": "confident_partial_learning"}, {"score": 0.015719716506582538, "phrase": "recursive_functions"}, {"score": 0.015560954417193747, "phrase": "partial_learning"}, {"score": 0.009350636197241314, "phrase": "behaviourally_correct_learning"}, {"score": 0.009068371710147344, "phrase": "essentially_class-consistent_partial_learning"}, {"score": 0.004085579055228594, "phrase": "inductive_inference"}, {"score": 0.0036678472439508484, "phrase": "exactly_one_hypothesis"}, {"score": 0.00325901518290063, "phrase": "almost_all_hypotheses"}, {"score": 0.0030327408069772293, "phrase": "present_work"}, {"score": 0.002910545717767559, "phrase": "explanatory_learning"}, {"score": 0.0023694065215394593, "phrase": "non-high_oracles"}, {"score": 0.002193447487477984, "phrase": "hyperimmune_turing_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Consistent learning", " Confident learning", " Partial learning", " Essentially class-consistent partial learning", " Inductive inference", " Function learning"], "paper_abstract": "Partial learning is a criterion where the learner infinitely often outputs one correct conjecture while every other hypothesis is issued only finitely often. This paper addresses two variants of partial learning in the setting of inductive inference of functions: first, confident partial learning requires that the learner also on those functions which it does not learn, singles out exactly one hypothesis which is output infinitely often; second, essentially class-consistent partial learning is partial learning with the additional constraint that on the functions to be learnt, almost all hypotheses issued are consistent with all the data seen so far. The results of the present work are that confident partial learning is more general than explanatory learning, incomparable with behaviourally correct learning and closed under union; essentially class-consistent partial learning is more general than behaviourally correct learning and incomparable with confident partial learning. Furthermore, it is investigated which oracles permit to learn all recursive functions under these criteria: for confident partial learning, some non-high oracles are omniscient; for essentially class-consistent partial learning, all PA-complete and all oracles of hyperimmune Turing degree are omniscient. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Confident and consistent partial learning of recursive functions", "paper_id": "WOS:000345181900002"}