{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "case_study"}, {"score": 0.004602483094756597, "phrase": "personal_experience"}, {"score": 0.00436890075128947, "phrase": "professional_practice"}, {"score": 0.004205172001372399, "phrase": "hci"}, {"score": 0.004161553532799662, "phrase": "new_ways_technology"}, {"score": 0.003909301559145041, "phrase": "existing_literature"}, {"score": 0.003621588555525458, "phrase": "'levels_of_reflection'_framework"}, {"score": 0.003534544738350291, "phrase": "wearable_digital_camera"}, {"score": 0.0034615969985956866, "phrase": "teachers'_and_tutors'_reflective_practice"}, {"score": 0.003285725064532174, "phrase": "different_situations"}, {"score": 0.002980916123365584, "phrase": "future_sensecam_use"}, {"score": 0.0029602552900111433, "phrase": "better_support_teachers"}, {"score": 0.0029295314433077134, "phrase": "tutors'_reflection"}, {"score": 0.0027903049766389433, "phrase": "methodological_approach"}, {"score": 0.0027709616040210686, "phrase": "rating_reflection"}, {"score": 0.00269491620131611, "phrase": "hci_community"}, {"score": 0.0025490131630603757, "phrase": "new_tools"}, {"score": 0.002436289099444074, "phrase": "similar_situations"}, {"score": 0.002248899833549883, "phrase": "future_technologies"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Rating framework", " Reflection on experience", " Reflective practice", " Teacher training", " SenseCam"], "paper_abstract": "Reflection on personal experience is described as a means to learn from experience, enable self-development and improve professional practice amongst other things. Recently there has been a move in HCI to explore new ways technology may support us in doing this. However, within this community there is little use made of existing literature to evaluate how well such tools support this reflection. In this paper we present a case study of the development of a 'levels of reflection' framework for the purposes of evaluating a wearable digital camera (SenseCam) to support teachers' and tutors' reflective practice. The framework enabled us to rate and compare reflection achieved by participants in different situations, and to explore the relationship between the ways images were used by participants and the level of reflection this led to, with implications for designing future SenseCam use to better support teachers' and tutors' reflection on experience. Beyond our particular case study, we suggest that the framework and associated methodological approach for rating reflection is of value to those within the HCI community interested in designing for reflection on experience. Rating reflection in this way can enable new tools or techniques for supporting reflection to be explored over time, across similar situations or with adaptations, and to build understandings of how reflection is being most effectively supported - ultimately inspiring the design of future technologies by building up an understanding of the most effective ways of supporting reflection on experience. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "Rating reflection on experience: A case study of teachers' and tutors' reflection around images", "paper_id": "WOS:000313135500001"}