{"auto_keywords": [{"score": 0.04357543409900946, "phrase": "conjunctive_queries"}, {"score": 0.00481495049065317, "phrase": "efficient_approximations"}, {"score": 0.0047839735747931605, "phrase": "conjunctive_queries."}, {"score": 0.004737879690862494, "phrase": "exact_answers"}, {"score": 0.004647013794908825, "phrase": "large_database"}, {"score": 0.004356472679444647, "phrase": "good_bounds"}, {"score": 0.004286708921931472, "phrase": "query_evaluation"}, {"score": 0.004084022274429013, "phrase": "special_importance"}, {"score": 0.00390346982868576, "phrase": "fast_query_evaluation"}, {"score": 0.0034081501761600067, "phrase": "correct_answers"}, {"score": 0.003310447652300423, "phrase": "tractable_conjunctive_queries"}, {"score": 0.003153774948631967, "phrase": "original_query"}, {"score": 0.0031032109441552287, "phrase": "general_results"}, {"score": 0.0030534551416161637, "phrase": "closure_properties"}, {"score": 0.0026830048370777315, "phrase": "combinatorial_properties"}, {"score": 0.002450702522633428, "phrase": "technical_toolkit"}, {"score": 0.002380381895973937, "phrase": "graph_homomorphisms"}, {"score": 0.0021049977753042253, "phrase": "directed_graphs"}], "paper_keywords": ["conjunctive queries", " approximation", " graphs", " homomorphisms", " hypergraphs"], "paper_abstract": "When finding exact answers to a query over a large database is infeasible, it is natural to approximate the query by a more efficient one that comes from a class with good bounds on the complexity of query evaluation. In this paper we study such approximations for conjunctive queries. These queries are of special importance in databases, and we have a very good understanding of the classes that admit fast query evaluation, such as acyclic, or bounded (hyper)treewidth queries. We define approximations of a given query Q as queries from one of those classes that disagree with Q as little as possible. We concentrate on approximations that are guaranteed to return correct answers. We prove that for the above classes of tractable conjunctive queries, approximations always exist and are at most polynomial in the size of the original query. This follows from general results we establish that relate closure properties of classes of conjunctive queries to the existence of approximations. We also show that in many cases the size of approximations is bounded by the size of the query they approximate. We establish a number of results showing how combinatorial properties of queries affect properties of their approximations, study bounds on the number of approximations, as well as the complexity of finding and identifying approximations. The technical toolkit of the paper comes from the theory of graph homomorphisms, as we mainly work with tableaux of queries and characterize approximations via preorders based on the existence of homomorphisms. In particular, most of our results can also be interpreted as approximation or complexity results for directed graphs.", "paper_title": "EFFICIENT APPROXIMATIONS OF CONJUNCTIVE QUERIES", "paper_id": "WOS:000338833100005"}