{"auto_keywords": [{"score": 0.04653621931999408, "phrase": "quality_checklist"}, {"score": 0.008666102970720764, "phrase": "quality_assessments"}, {"score": 0.0074590916733035485, "phrase": "individual_assessments"}, {"score": 0.006288088359107845, "phrase": "inter-rater_reliability"}, {"score": 0.00481495049065317, "phrase": "software_engineering_experiments"}, {"score": 0.004592905436175987, "phrase": "empirical_papers"}, {"score": 0.004565876339189493, "phrase": "current_guidelines"}, {"score": 0.003757480190200645, "phrase": "evaluation_criteria"}, {"score": 0.003500313767208306, "phrase": "eight_reviewers"}, {"score": 0.0034489862797891847, "phrase": "nine_questions"}, {"score": 0.0034185505275141077, "phrase": "first_study"}, {"score": 0.003348570667660301, "phrase": "second_study"}, {"score": 0.0033288399506044763, "phrase": "joint_assessments"}, {"score": 0.0032800186243040663, "phrase": "inter-rater_discussion"}, {"score": 0.0032510690712452147, "phrase": "third_more_formal_randomised_block_experiment"}, {"score": 0.0030284566685355456, "phrase": "different_size"}, {"score": 0.0027714435547214183, "phrase": "joint_evaluations"}, {"score": 0.002706659627293686, "phrase": "third_study"}, {"score": 0.0024768883044869023, "phrase": "systematic_literature_reviews"}, {"score": 0.0024118292918742967, "phrase": "median_assessment"}, {"score": 0.0022399174232611853, "phrase": "future_experiments"}, {"score": 0.002142696637011647, "phrase": "research_papers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Quality evaluation", " Empirical studies", " Human-intensive experiments", " Experimentation", " Software engineering"], "paper_abstract": "Context: During systematic literature reviews it is necessary to assess the quality of empirical papers. Current guidelines suggest that two researchers should independently apply a quality checklist and any disagreements must be resolved. However, there is little empirical evidence concerning the effectiveness of these guidelines. Aims: This paper investigates the three techniques that can be used to improve the reliability (i.e. the consensus among reviewers) of quality assessments, specifically, the number of reviewers, the use of a set of evaluation criteria and consultation among reviewers. We undertook a series of studies to investigate these factors. Method: Two studies involved four research papers and eight reviewers using a quality checklist with nine questions. The first study was based on individual assessments, the second study on joint assessments with a period of inter-rater discussion. A third more formal randomised block experiment involved 48 reviewers assessing two of the papers used previously in teams of one, two and three persons to assess the impact of discussion among teams of different size using the evaluations of the \"teams\" of one person as a control. Results: For the first two studies, the inter-rater reliability was poor for individual assessments, but better for joint evaluations. However, the results of the third study contradicted the results of Study 2. Inter-rater reliability was poor for all groups but worse for teams of two or three than for individuals. Conclusions: When performing quality assessments for systematic literature reviews, we recommend using three independent reviewers and adopting the median assessment. A quality checklist seems useful but it is difficult to ensure that the checklist is both appropriate and understood by reviewers. Furthermore, future experiments should ensure participants are given more time to understand the quality checklist and to evaluate the research papers. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Three empirical studies on the agreement of reviewers about the quality of software engineering experiments", "paper_id": "WOS:000305599200002"}