{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "spatial_data_infrastructures"}, {"score": 0.034000637458557234, "phrase": "assessment_view"}, {"score": 0.029262716579216672, "phrase": "proposed_view"}, {"score": 0.004126623209579942, "phrase": "widely_articulated_but_rarely_proven_benefits"}, {"score": 0.003716273882758735, "phrase": "limited_number"}, {"score": 0.003440166097491567, "phrase": "intended_goals"}, {"score": 0.0028993944292191433, "phrase": "multi-view_sdi_assessment_framework"}, {"score": 0.002713604305939145, "phrase": "dutch_sdi"}, {"score": 0.002511803988580901, "phrase": "potential_users"}, {"score": 0.0022994427535192514, "phrase": "assessment_indicators"}, {"score": 0.002200077887697072, "phrase": "sdi_goals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spatial Data Infrastructure (SDI) assessment", " Goals assessment", " Assessment method", " Assessment framework", " Evaluation"], "paper_abstract": "The motives for constructing Spatial Data Infrastructures (SDIs) are often based on their anticipated benefits for society, economy, and environment. According to those widely articulated but rarely proven benefits, SDI coordinators have been defining more specific objectives to be achieved by their SDIs. However, there is a limited number of assessment approaches that are able to demonstrate whether SDIs indeed realize the intended goals. In this article we develop, apply and evaluate an assessment view for evaluating the extent to which SDIs realize their goals. The assessment view has been developed stepwise using the Multi-view SDI assessment framework as a guideline. The application of the proposed view in the Dutch SDI demonstrates its potential. In addition, the evaluation of the proposed view by the potential users confirms to a certain extent its usability. The results also show that the ease of determining assessment indicators depends on the precision with which the SDI goals are formulated. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An assessment view to evaluate whether Spatial Data Infrastructures meet their goals", "paper_id": "WOS:000290067500004"}