{"auto_keywords": [{"score": 0.03401790463741915, "phrase": "sticklet"}, {"score": 0.02275850629207174, "phrase": "web_augmentation"}, {"score": 0.005930368528677289, "phrase": "sticklet_expressions"}, {"score": 0.00481495049065317, "phrase": "end-user_web_augmentation"}, {"score": 0.00465112142785941, "phrase": "augmented_reality"}, {"score": 0.0046083786662148955, "phrase": "physical_world"}, {"score": 0.004544996529763863, "phrase": "existing_web"}, {"score": 0.004503224619750312, "phrase": "user_experience"}, {"score": 0.004441302740498856, "phrase": "javascript"}, {"score": 0.004390312150344245, "phrase": "browser_weavers"}, {"score": 0.004349955692802962, "phrase": "greasemonkey"}, {"score": 0.004240869869878681, "phrase": "greasemonkey_scripts"}, {"score": 0.0037696519417841287, "phrase": "end-user_participation"}, {"score": 0.0035010071030752883, "phrase": "encouraging_production"}, {"score": 0.0034368818187904744, "phrase": "augmentation_scripts"}, {"score": 0.0032665093519968083, "phrase": "domain-specific_languages"}, {"score": 0.0031845067058084613, "phrase": "internal_dsl"}, {"score": 0.0031479142819948007, "phrase": "js_generality"}, {"score": 0.0030126454230895647, "phrase": "existing_web_sites"}, {"score": 0.0029642913558007183, "phrase": "html"}, {"score": 0.0029166963619404723, "phrase": "web_services"}, {"score": 0.002850032622120692, "phrase": "hobby_programmers"}, {"score": 0.0027720387041418877, "phrase": "producer_perspective"}, {"score": 0.0027212289181856035, "phrase": "restricted_grammar"}, {"score": 0.002696177808817168, "phrase": "js"}, {"score": 0.002586240597537455, "phrase": "syntactically_correct_js_expressions"}, {"score": 0.002538827707857368, "phrase": "traditional_scripts"}, {"score": 0.00249228185466943, "phrase": "existing_js_tools"}, {"score": 0.0024750474634399797, "phrase": "declarative_expressions"}, {"score": 0.0023906425293067075, "phrase": "consumer_perspective"}, {"score": 0.002379607671058636, "phrase": "domain_specificity"}, {"score": 0.002174303033371867, "phrase": "target_audience"}, {"score": 0.0021592627393724577, "phrase": "preliminary_evaluations"}, {"score": 0.0021049977753042253, "phrase": "new_sticklet_scripts"}], "paper_keywords": ["Standardization", " Design", " Web augmentation", " domain-specific language", " end-user programming", " Greasemonkey", " JavaScript"], "paper_abstract": "Web augmentation is to the Web what augmented reality is to the physical world: layering relevant content/layout/navigation over the existing Web to customize the user experience. This is achieved through JavaScript (JS) using browser weavers (e.g., Greasemonkey). To date, over 43 million of downloads of Greasemonkey scripts ground the vitality of this movement. However, Web augmentation is hindered by being programming intensive and prone to malware. This prevents end-users from participating as both producers and consumers of scripts: producers need to know JS, consumers need to trust JS. This article aims at promoting end-user participation in both roles. The vision is for end-users to prosume (the act of simultaneously caring for producing and consuming) scripts as easily as they currently prosume their pictures or videos. Encouraging production requires more \"natural\" and abstract constructs. Promoting consumption calls for augmentation scripts to be easier to understand, share, and trust upon. To this end, we explore the use of Domain-Specific Languages (DSLs) by introducing Sticklet. Sticklet is an internal DSL on JS, where JS generality is reduced for the sake of learnability and reliability. Specifically, Web augmentation is conceived as fixing in existing web sites (i.e., the wall) HTML fragments extracted from either other sites or Web services (i.e., the stickers). Sticklet targets hobby programmers as producers, and computer literates as consumers. From a producer perspective, benefits are threefold. As a restricted grammar on top of JS, Sticklet expressions are domain oriented and more declarative than their JS counterparts, hence speeding up development. As syntactically correct JS expressions, Sticklet scripts can be installed as traditional scripts and hence, programmers can continue using existing JS tools. As declarative expressions, they are easier to maintain, and amenable for optimization. From a consumer perspective, domain specificity brings understandability (due to declarativeness), reliability (due to built-in security), and \"consumability\" (i.e., installation/enactment/sharing of Sticklet expressions are tuned to the shortage of time and skills of the target audience). Preliminary evaluations indicate that 77% of the subjects were able to develop new Sticklet scripts in less than thirty minutes while 84% were able to consume these scripts in less than ten minutes. Sticklet is available to download as a Mozilla add-on.", "paper_title": "A Language for End-User Web Augmentation: Caring for Producers and Consumers Alike", "paper_id": "WOS:000323705500005"}