{"auto_keywords": [{"score": 0.04466418483879831, "phrase": "correct_behaviour"}, {"score": 0.00481495049065317, "phrase": "right_way"}, {"score": 0.004681413843223496, "phrase": "organisational_abstractions"}, {"score": 0.004567596860086148, "phrase": "common_solutions"}, {"score": 0.004519665344659923, "phrase": "open_multiagent_systems"}, {"score": 0.004332894955218135, "phrase": "design_time"}, {"score": 0.0038579703525471985, "phrase": "imposed_norms"}, {"score": 0.003633927813203731, "phrase": "novel_mechanism"}, {"score": 0.0035082436540296406, "phrase": "system's_preferences"}, {"score": 0.003434922209075514, "phrase": "incentive_policies"}, {"score": 0.0032013710938940424, "phrase": "system's_point"}, {"score": 0.0029212625534156063, "phrase": "global_utility"}, {"score": 0.00284009509859163, "phrase": "positive_incentive"}, {"score": 0.0025194861926779223, "phrase": "\"good\"_action"}, {"score": 0.0024236964502593254, "phrase": "individual_agent"}, {"score": 0.002258745901862197, "phrase": "learning_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Open Multi Agent Systems", " Incentives", " Regulation", " Adaptation", " Organisation", " Norms"], "paper_abstract": "Organisational abstractions have been presented during the last years as common solutions to regulate Open MultiAgent Systems. In particular, the concept of norm is defined at design time to assure the correct behaviour of agents in such systems. However, in many cases, the performance of a system does not only depend on the correct behaviour of the agents according to the imposed norms but also on some other efficiency measures. To tackle this issue, this paper puts forward a novel mechanism that attempts to persuade agents to act according to system's preferences. This mechanism relies on incentive policies that aim to induce (not enforce) agents to perform those actions that are more appropriated from the system's point of view. In particular, two different policies have been presented. On the one hand, a policy that tries to promote the most appropriate action regarding the global utility of the system, by assigning a positive incentive to it. On the other hand, a policy that assigns incentives to all actions an agent can choose in a given state, with the aim of persuading the former to choose a \"good\" action. Besides, incentives are adapted and defined for each individual agent and contextualised by taking into account the state of the system. This task is carried out through a learning process based on Q-learning. Finally, a p2p file sharing scenario has been chosen to validate our approach. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Persuading agents to act in the right way: An incentive-based approach", "paper_id": "WOS:000313855000016"}