{"auto_keywords": [{"score": 0.041724670724731176, "phrase": "indirect-greedy_routing"}, {"score": 0.01240611867834559, "phrase": "topological_awareness"}, {"score": 0.00481495049065317, "phrase": "even_small_worlds"}, {"score": 0.004737579882204798, "phrase": "small_world_graphs"}, {"score": 0.00466145674552922, "phrase": "kleinberg"}, {"score": 0.00445830200258645, "phrase": "d-dimensional_mesh"}, {"score": 0.004281284532043714, "phrase": "d-harmonic_distribution"}, {"score": 0.0041784516085055035, "phrase": "greedy_routing"}, {"score": 0.002696479050724966, "phrase": "\"world's_dimension"}, {"score": 0.0026209522797963447, "phrase": "high_dimensional_worlds"}, {"score": 0.0025578967205807843, "phrase": "low_dimensional_ones"}, {"score": 0.0024761702541879213, "phrase": "kleinberg's_routing"}, {"score": 0.00241658945942583, "phrase": "new_light"}, {"score": 0.0023970487263732737, "phrase": "milgram's_experiment"}, {"score": 0.0022190974300886467, "phrase": "header_modification"}, {"score": 0.0021049977753042253, "phrase": "routing_decision"}], "paper_keywords": ["small world graphs", " routing", " Milgram's experiment"], "paper_abstract": "We consider small world graphs as defined by Kleinberg (2000), i.e., graphs obtained from a d-dimensional mesh by adding links chosen at random according to the d-harmonic distribution. In these graphs, greedy routing performs in O(log(2) n) expected number of steps. We introduce indirect-greedy routing. We show that giving O(log 2 n) bits of topological awareness per node enables indirect-greedy routing to perform in O(log(1+1)/(d) n) expected number of steps in d-dimensional augmented meshes. We also show that, independently of the amount of topological awareness given to the nodes, indirect-greedy routing performs in Omega(log(1+1/d) n) expected number of steps. In particular, augmenting the topological awareness above this optimum of O(log(2) n) bits would drastically decrease the perforinance of indirect-greedy routing. Our model demonstrates that the efficiency of indirect-greedy routing is sensitive to the \"world's dimension,\" in the sense that high dimensional worlds enjoy faster greedy routing than low dimensional ones. This could not be observed in Kleinberg's routing. In addition to bringing new light to Milgram's experiment, our protocol presents several desirable properties. In particular, it is totally oblivious, i.e., there is no header modification along the path from the source to the target, and the routing decision depends only on the target, and on information stored locally at each node.", "paper_title": "Eclecticism shrinks even small worlds", "paper_id": "WOS:000236108700005"}