{"auto_keywords": [{"score": 0.04900136041045406, "phrase": "makeover_recommendation"}, {"score": 0.022684825462306143, "phrase": "proposed_system"}, {"score": 0.004424441580112395, "phrase": "makeover_items"}, {"score": 0.004310752197635499, "phrase": "user-provided_frontal_face_image"}, {"score": 0.004025968624066142, "phrase": "virtual_hairdo"}, {"score": 0.0039097293657870584, "phrase": "beauty_modeling"}, {"score": 0.0037112756920669593, "phrase": "different_discrete_values"}, {"score": 0.0033878306639271963, "phrase": "makeover_process"}, {"score": 0.0032685906228558706, "phrase": "beauty-related_attributes"}, {"score": 0.0031535341431377837, "phrase": "makeup_process"}, {"score": 0.0030227528484104756, "phrase": "beauty_e-experts_dataset"}, {"score": 0.0029449743792479433, "phrase": "beauty_e-experts_system"}, {"score": 0.002813633198636833, "phrase": "similar_process"}, {"score": 0.0027501697136375555, "phrase": "daily_life"}, {"score": 0.0026274936167233515, "phrase": "multiple_tree-structured_supergraph_model"}, {"score": 0.002568217828414509, "phrase": "high-level_beauty_attributes"}, {"score": 0.0025515282069418286, "phrase": "mid-level_beauty-related_attributes"}, {"score": 0.0025266963982350523, "phrase": "low-level_image_features"}, {"score": 0.0023062508214156123, "phrase": "effective_and_efficient_facial_image_synthesis_module"}, {"score": 0.0022542058337152913, "phrase": "recommended_makeovers"}, {"score": 0.002232261129770455, "phrase": "user_facial_image"}, {"score": 0.0021961592899628615, "phrase": "extensive_experiments"}, {"score": 0.002181882210287102, "phrase": "testing_images"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Algorithms", " Experimentation", " Performance", " Beauty recommendation", " beauty synthesis", " multiple tree-structured super-graphs model"], "paper_abstract": "Beauty e-Experts, a fully automatic system for makeover recommendation and synthesis, is developed in this work. The makeover recommendation and synthesis system simultaneously considers many kinds of makeover items on hairstyle and makeup. Given a user-provided frontal face image with short/bound hair and no/light makeup, the Beauty e-Experts system not only recommends the most suitable hairdo and makeup, but also synthesizes the virtual hairdo and makeup effects. To acquire enough knowledge for beauty modeling, we built the Beauty e-Experts Database, which contains 1,505 female photos with a variety of attributes annotated with different discrete values. We organize these attributes into two different categories, beauty attributes and beauty-related attributes. Beauty attributes refer to those values that are changeable during the makeover process and thus need to be recommended by the system. Beauty-related attributes are those values that cannot be changed during the makeup process but can help the system to perform recommendation. Based on this Beauty e-Experts Dataset, two problems are addressed for the Beauty e-Experts system: what to recommend and how to wear it, which describes a similar process of selecting hairstyle and cosmetics in daily life. For the what-to-recommend problem, we propose a multiple tree-structured supergraph model to explore the complex relationships among high-level beauty attributes, mid-level beauty-related attributes, and low-level image features. Based on this model, the most compatible beauty attributes for a given facial image can be efficiently inferred. For the how-to-wear-it problem, an effective and efficient facial image synthesis module is designed to seamlessly synthesize the recommended makeovers into the user facial image. We have conducted extensive experiments on testing images of various conditions to evaluate and analyze the proposed system. The experimental results well demonstrate the effectiveness and efficiency of the proposed system.", "paper_title": "Wow! You Are So Beautiful Today!", "paper_id": "WOS:000343984800012"}