{"auto_keywords": [{"score": 0.05007833083333683, "phrase": "relational_dependency_networks"}, {"score": 0.048163992431376076, "phrase": "srl"}, {"score": 0.004766090327062509, "phrase": "hybrid_domains"}, {"score": 0.0038271712887391015, "phrase": "discrete_variables"}, {"score": 0.0036181717017041387, "phrase": "continuous_and_discrete_variables"}, {"score": 0.003509006038574667, "phrase": "growing_interest"}, {"score": 0.0034556603183020407, "phrase": "hybrid_srl_formalisms"}, {"score": 0.0032836104153151973, "phrase": "representational_issues"}, {"score": 0.002964706925144123, "phrase": "hybrid_srl_model"}, {"score": 0.0026630475331025955, "phrase": "hybrid_relational_dependency_networks"}, {"score": 0.002479150189700726, "phrase": "continuous_variables"}, {"score": 0.0021928902836049384, "phrase": "empirical_evaluation"}, {"score": 0.002126635713519053, "phrase": "continuous_variables_results"}], "paper_keywords": ["Statistical relational learning", " Hybrid domains", " Structure learning"], "paper_abstract": "Statistical relational learning (SRL) is concerned with developing formalisms for representing and learning from data that exhibit both uncertainty and complex, relational structure. Most of the work in SRL has focused on modeling and learning from data that only contain discrete variables. As many important problems are characterized by the presence of both continuous and discrete variables, there has been a growing interest in developing hybrid SRL formalisms. Most of these formalisms focus on reasoning and representational issues and, in some cases, parameter learning. What has received little attention is learning the structure of a hybrid SRL model from data. In this paper, we fill that gap and make the following contributions. First, we propose hybrid relational dependency networks (HRDNs), an extension to relational dependency networks that are able to model continuous variables. Second, we propose an algorithm for learning both the structure and parameters of an HRDN from data. Third, we provide an empirical evaluation that demonstrates that explicitly modeling continuous variables results in more accurate learned models than discretizing them prior to learning.", "paper_title": "Learning relational dependency networks in hybrid domains", "paper_id": "WOS:000359747100004"}