{"auto_keywords": [{"score": 0.03906470541487411, "phrase": "search_tasks"}, {"score": 0.004815315858763141, "phrase": "distributed"}, {"score": 0.004579244735256393, "phrase": "integrated_approach"}, {"score": 0.004544016163767266, "phrase": "multirobot_exploration"}, {"score": 0.004422827355213055, "phrase": "large_teams"}, {"score": 0.004338239182984759, "phrase": "unknown_areas"}, {"score": 0.004288261454002681, "phrase": "existing_supporting_communications_infrastructure"}, {"score": 0.0038934666267504596, "phrase": "centibots"}, {"score": 0.0036178264212372497, "phrase": "mapping_stage"}, {"score": 0.0035076666315744525, "phrase": "large_unknown_area"}, {"score": 0.0034140224493254935, "phrase": "consistent_map"}, {"score": 0.002902236818129282, "phrase": "search_area"}, {"score": 0.0028576796380512157, "phrase": "first_stage"}, {"score": 0.002665465323614577, "phrase": "shared_maps"}, {"score": 0.002486147565139633, "phrase": "second_and_third_stages"}, {"score": 0.002292097733181405, "phrase": "topological_graph"}, {"score": 0.0021628142746829187, "phrase": "spatial_and_communication_constraints"}, {"score": 0.0021049977753042253, "phrase": "extremely_realistic_real-world_conditions"}], "paper_keywords": ["Distributed Exploration", " Distributed Mapping", " Task allocation", " Robots"], "paper_abstract": "We present an integrated approach to multirobot exploration, mapping and searching suitable for large teams of robots operating in unknown areas lacking an existing supporting communications infrastructure. We present a set of algorithms that have been both implemented and experimentally verified on teams-of what we refer to as Centibots-consisting of as many as 100 robots. The results that we present involve search tasks that can be divided into a mapping stage in which robots must jointly explore a large unknown area with the goal of generating a consistent map from the fragment, a search stage in which robots are deployed within the environment in order to systematically search for an object of interest, and a protection phase in which robots are distributed to track any intruders in the search area. During the first stage, the robots actively seek to verify their relative locations in order to ensure consistency when combining data into shared maps; they must also coordinate their exploration strategies so as to maximize the efficiency of exploration. In the second and third stages, robots allocate search tasks among themselves; since tasks are not defined a priori, the robots first produce a topological graph of the area of interest and then generate a set of tasks that reflect spatial and communication constraints. Our system was evaluated under extremely realistic real-world conditions. An outside evaluation team found the system to be highly efficient and robust.", "paper_title": "Distributed multirobot exploration, mapping, and task allocation", "paper_id": "WOS:000265035800006"}