{"auto_keywords": [{"score": 0.04876404494641554, "phrase": "quality_metrics"}, {"score": 0.015719716506582538, "phrase": "detailed_clinical_models"}, {"score": 0.013200477971152197, "phrase": "content_validity"}, {"score": 0.004388035083357706, "phrase": "existing_quality_criteria"}, {"score": 0.00428733103049275, "phrase": "formal_metrics"}, {"score": 0.00398028819691605, "phrase": "initial_quality_metrics"}, {"score": 0.0034303736977646135, "phrase": "valid_quality_metrics"}, {"score": 0.0031697368057340895, "phrase": "kappa_coefficient"}, {"score": 0.0030257422786589723, "phrase": "final_dcm_quality_metrics"}, {"score": 0.0028615323526689582, "phrase": "reliability_test"}, {"score": 0.0024429654627197393, "phrase": "international_dcm_experts"}, {"score": 0.0023103100997344072, "phrase": "essential_qualitative_and_quantitative_quality_requirements"}, {"score": 0.0022155569675462333, "phrase": "rational_decision-making"}, {"score": 0.002195038560814237, "phrase": "dcm"}, {"score": 0.0021646022201798247, "phrase": "clinical_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health record", " Detailed clinical models", " Quality metrics"], "paper_abstract": "Objective: To develop quality metrics for detailed clinical models (DCMs) and test their validity. Methods: Based on existing quality criteria which did not include formal metrics, we developed quality metrics by applying the ISO/IEC 9126 software quality evaluation model. The face and content validity of the initial quality metrics were assessed by 9 international experts. Content validity was defined as agreement by over 70% of the panelists. For eliciting opinions and achieving consensus of the panelists, a two round Delphi survey was conducted. Valid quality metrics were considered reliable if agreement between two evaluators' assessments of two example DCMs was over 0.60 in terms of the kappa coefficient. After reliability and validity were tested, the final DCM quality metrics were selected. Results: According to the results of the reliability test, the degree of agreement was high (a kappa coefficient of 0.73). Based on the results of the reliability test, 8 quality evaluation domains and 29 quality metrics were finalized as DCM quality metrics. Conclusion: Quality metrics were validated by a panel of international DCM experts. Therefore, we expect that the metrics, which constitute essential qualitative and quantitative quality requirements for DCMs, can be used to support rational decision-making by DCM developers and clinical users. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Quality metrics for detailed clinical models", "paper_id": "WOS:000318998000026"}