{"auto_keywords": [{"score": 0.03419569965162811, "phrase": "bounded_model"}, {"score": 0.00888304404142055, "phrase": "upper_bound"}, {"score": 0.008067754913725998, "phrase": "unbounded_model"}, {"score": 0.00481495049065317, "phrase": "online_coloring"}, {"score": 0.00456571874088313, "phrase": "variable_capacities"}, {"score": 0.004413846562278824, "phrase": "new_color"}, {"score": 0.003855034057431947, "phrase": "capacity_c"}, {"score": 0.0033667304423940893, "phrase": "total_capacity"}, {"score": 0.002828418443899226, "phrase": "positive_capacity"}, {"score": 0.0027741761880779535, "phrase": "absolute_competitive_ratio"}, {"score": 0.002387507583705495, "phrase": "offline_version"}, {"score": 0.0021461840368981475, "phrase": "strong_sense"}], "paper_keywords": ["Competitive analysis", " Interval coloring", " Lower bound", " Approximation algorithm"], "paper_abstract": "We consider online coloring of intervals with bandwidth in a setting where colors have variable capacities. Whenever the algorithm opens a new color, it must choose the capacity for that color and cannot change it later. A set of intervals can be assigned the same color a of capacity C (a) if the sum of bandwidths of intervals at each point does not exceed C (a) . The goal is to minimize the total capacity of all the colors used. We consider the bounded model, where all capacities must be chosen in the range (0,1], and the unbounded model, where the algorithm may use colors of any positive capacity. For the absolute competitive ratio, we give an upper bound of 14 and a lower bound of 4.59 for the bounded model, and an upper bound of 4 and a matching lower bound of 4 for the unbounded model. We also consider the offline version of these problems and show that whereas the unbounded model is polynomially solvable, the bounded model is NP-hard in the strong sense and admits a 3.6-approximation algorithm.", "paper_title": "Variable Sized Online Interval Coloring with Bandwidth", "paper_id": "WOS:000263681500007"}