{"auto_keywords": [{"score": 0.04898861972432922, "phrase": "mer"}, {"score": 0.015719687064822692, "phrase": "automated_music_emotion_recognition"}, {"score": 0.0047676399834833275, "phrase": "systematic_evaluation"}, {"score": 0.0046437283535486545, "phrase": "challenging_task"}, {"score": 0.004613254605667248, "phrase": "music_information_retrieval"}, {"score": 0.00458297991625839, "phrase": "wide-ranging_applications"}, {"score": 0.004537938301016805, "phrase": "recent_studies"}, {"score": 0.00446384610114756, "phrase": "continuous_regression_problem"}, {"score": 0.004248718518635191, "phrase": "common_architecture"}, {"score": 0.004206948146882303, "phrase": "universal_model"}, {"score": 0.004179328666330398, "phrase": "emotional_response"}, {"score": 0.0040975489787831955, "phrase": "low-level_audio_features"}, {"score": 0.003964775996909873, "phrase": "audio_analysis"}, {"score": 0.003687568028560351, "phrase": "current_technology"}, {"score": 0.003242773742700232, "phrase": "systematic_study"}, {"score": 0.003158367829177805, "phrase": "prediction_performance"}, {"score": 0.0031272833420309685, "phrase": "automated_mer_system"}, {"score": 0.0027408292745619233, "phrase": "training_process"}, {"score": 0.0026694534457234933, "phrase": "model_selection"}, {"score": 0.0025999315182615823, "phrase": "extensive_testing"}, {"score": 0.002474408907166139, "phrase": "substantial_improvement"}, {"score": 0.0022860268828044134, "phrase": "small_data_sets"}, {"score": 0.0022338277339064155, "phrase": "mer_literature"}, {"score": 0.0021049977753042253, "phrase": "subset_selection_bias"}], "paper_keywords": [""], "paper_abstract": "Automated music emotion recognition (MER) is a challenging task in Music Information Retrieval with wide-ranging applications. Some recent studies pose MER as a continuous regression problem in the Arousal-Valence (AV) plane. These consist of variations on a common architecture having a universal model of emotional response, a common repertoire of low-level audio features, a bag-of-frames approach to audio analysis, and relatively small data sets. These approaches achieve some success at MER and suggest that further improvements are possible with current technology. Our contribution to the state of the art is to examine just how far one can go within this framework, and to investigate what the limitations of this framework are. We present the results of a systematic study conducted in an attempt to maximize the prediction performance of an automated MER system using the architecture described. We begin with a carefully constructed data set, emphasizing quality over quantity. We address affect induction rather than affect attribution. We consider a variety of algorithms at each stage of the training process, from preprocessing to feature selection and model selection, and we report the results of extensive testing. We found that: (1) none of the variations we considered leads to a substantial improvement in performance, which we present as evidence of a limit on what is achievable under this architecture, and (2) the size of the small data sets that are commonly used in the MER literature limits the possibility of improving the set of features used in MER due to the phenomenon of Subset Selection Bias. We conclude with some proposals for advancing the state of the art.", "paper_title": "Automated Music Emotion Recognition: A Systematic Evaluation", "paper_id": "WOS:000284114500005"}