{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mobile_museum_context"}, {"score": 0.004771196027464407, "phrase": "ubiquitous_computing_environments"}, {"score": 0.004600100053651545, "phrase": "context_aware_services"}, {"score": 0.004103817210338686, "phrase": "current_task"}, {"score": 0.0039928721865882, "phrase": "wrong_context"}, {"score": 0.0037454814403672697, "phrase": "relevant_services"}, {"score": 0.0034813964296826973, "phrase": "subjective_perception"}, {"score": 0.0029396242707327986, "phrase": "special_leisure_scenario"}, {"score": 0.0028995712226514746, "phrase": "museum_visit"}, {"score": 0.0027322025124213566, "phrase": "context-aware_mobile_museum_guide"}, {"score": 0.002551022760887132, "phrase": "user's_activity"}, {"score": 0.00243694486220507, "phrase": "message_content"}, {"score": 0.002403724423251419, "phrase": "perceived_level"}, {"score": 0.002254571365634257, "phrase": "existing_work"}, {"score": 0.0022238315004700607, "phrase": "desktop_and_mobile_domains"}, {"score": 0.0021049977753042253, "phrase": "mobile_museum_guide_system"}], "paper_keywords": [""], "paper_abstract": "Ubiquitous computing environments continuously infer our context and proactively offer us context aware services and information, suggested by notifications on our mobile devices. However, notifications come with a cost. They may interrupt the user in the current task and be annoying in the wrong context. The challenge becomes how to notify the user about the availability of relevant services while minimizing the level of disruptiveness. Thus, an understanding of what affects the subjective perception of the disruptiveness of the notification is needed. As yet, most of the research on disruptiveness of notifications focused on stationary, task-oriented environments. In this study, we examine the effect of notifications in a special leisure scenario-a museum visit. In two user studies conducted in a museum setting, participants used a context-aware mobile museum guide to receive information on various museum exhibits while periodically receiving notifications. We examined how the user's activity, the modality of the notification, and the message content affected the perceived level of disruption that the notifications created. We discuss our results in light of existing work in the desktop and mobile domains and provide a framework and recommendations for designing notifications for a mobile museum guide system.", "paper_title": "Examining Factors Influencing the Disruptiveness of Notifications in a Mobile Museum Context", "paper_id": "WOS:000356372200002"}