{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "upper_bound"}, {"score": 0.028857704877682192, "phrase": "k-set_agreement_problem"}, {"score": 0.00481495049065317, "phrase": "consensus_problem"}, {"score": 0.004790153050564259, "phrase": "asynchronous_systems"}, {"score": 0.004199032198782628, "phrase": "failure_detector"}, {"score": 0.0039465735912396355, "phrase": "nonanonymous_system"}, {"score": 0.003835972725191194, "phrase": "perfect_failure_detectors"}, {"score": 0.0037284597940314404, "phrase": "simple_psi-based_consensus_algorithm"}, {"score": 0.0035681790580031998, "phrase": "faulty_processes"}, {"score": 0.003370907075333389, "phrase": "anonymous_systems"}, {"score": 0.0033190180867511605, "phrase": "second_contribution"}, {"score": 0.0032259472087775138, "phrase": "early-deciding_algorithm"}, {"score": 0.0030475381446620716, "phrase": "actual_number"}, {"score": 0.003031815311399173, "phrase": "process_failures"}, {"score": 0.0029013950320185573, "phrase": "synchronous_systems"}, {"score": 0.002769395841379498, "phrase": "corresponding_lower_bound"}, {"score": 0.002650234110910539, "phrase": "previous_psi-based_consensus_algorithm"}, {"score": 0.0025230952890994236, "phrase": "failure_detector_classes"}, {"score": 0.0023834640793589414, "phrase": "k-set_agreement"}, {"score": 0.0021049977753042253, "phrase": "underlying_failure_detector"}], "paper_keywords": ["Algorithms", " Theory", " Anonymity", " asynchronous systems", " consensus", " failure detector", " message passing system"], "paper_abstract": "This article addresses the consensus problem in asynchronous systems prone to process crashes, where additionally the processes are anonymous (they cannot be distinguished one from the other: they have no name and execute the same code). To circumvent the three computational adversaries (asynchrony, failures, and anonymity) each process is provided with a failure detector of a class denoted psi, that gives it an upper bound on the number of processes that are currently alive (in a nonanonymous system, the classes psi and P-the class of perfect failure detectors-are equivalent). The article first presents a simple psi-based consensus algorithm where the processes decide in 2t + 1 asynchronous rounds (where t is an upper bound on the number of faulty processes). It then shows one of its main results, namely 2t + 1 is a lower bound for consensus in the anonymous systems equipped with psi. The second contribution addresses early-decision. The article presents and proves correct an early-deciding algorithm where the processes decide in min(2 f + 2, 2t + 1) asynchronous rounds (where f is the actual number of process failures). This leads us to think that anonymity doubles the cost (with respect to synchronous systems) and it is conjectured that min(2 f + 2, 2t + 1) is the corresponding lower bound. The article finally considers the k-set agreement problem in anonymous systems. It first shows that the previous psi-based consensus algorithm solves the k-set agreement problem in R-t = 2left perpendiculart/kright perpendicular + 1 asynchronous rounds. Then, considering a family of failure detector classes {psi(l)}0 <= l<k that generalizes the class psi(= psi(0)), the article presents an algorithm that solves the k-set agreement in R-t,R-l = 2left perpendiculart/k-lright perpendicular + 1 asynchronous rounds. This last formula relates the cost (R-t,R-l), the coordination degree of the problem (k), the maximum number of failures (t), and the the strength (l) of the underlying failure detector. Finally the article concludes by presenting problems that remain open.", "paper_title": "The Price of Anonymity: Optimal Consensus Despite Asynchrony, Crash, and Anonymity", "paper_id": "WOS:000297634800001"}