{"auto_keywords": [{"score": 0.04760245961521714, "phrase": "fuzzy_logical_operators"}, {"score": 0.015527744506241364, "phrase": "generalized_interval-valued_fuzzy_rough_sets"}, {"score": 0.007740489563401459, "phrase": "interval-valued_fuzzy_logical_operators"}, {"score": 0.0061692105301906506, "phrase": "rough_sets"}, {"score": 0.004688894532233354, "phrase": "generalized_fuzzy_rough_sets"}, {"score": 0.004497410940849537, "phrase": "real-valued_data"}, {"score": 0.004337395415829378, "phrase": "interval-valued_fuzzy_rough_sets"}, {"score": 0.004313713204732449, "phrase": "triangular_norm"}, {"score": 0.0038644521996539466, "phrase": "generalization_models"}, {"score": 0.0037774893672602506, "phrase": "recent_researches"}, {"score": 0.0031010029460927864, "phrase": "new_approach"}, {"score": 0.003042697264766327, "phrase": "interval-valued_fuzzy_sets"}, {"score": 0.002907184330345933, "phrase": "interval_representations"}, {"score": 0.0028851913035322415, "phrase": "interval-valued_fuzzy_t-norm"}, {"score": 0.002798865807872575, "phrase": "interval-valued_fuzzy_r-implicator"}, {"score": 0.0027151161550531206, "phrase": "theoretical_basis"}, {"score": 0.002254003531073337, "phrase": "existing_models"}, {"score": 0.0021291312714904957, "phrase": "special_cases"}, {"score": 0.0021049977753042253, "phrase": "proposed_models"}], "paper_keywords": ["Interval-valued fuzzy sets", " interval-valued fuzzy logical operators", " interval-valued fuzzy triangular norms", " interval-valued fuzzy residual implicators", " interval-valued fuzzy rough sets"], "paper_abstract": "The fuzzy rough sets and generalized fuzzy rough sets have been extended by three pairs of fuzzy logical operators to deal with real-valued data for a variety of models. Three pairs of fuzzy logical operators are triangular norm or t-norm and its dual (t-conorm), residual implicator or R-implicator and its dual, fuzzy implicator and t-norm, which are frequently discussed in generalization models of rough sets. There are recent researches into generalized interval-valued fuzzy rough sets for interval-valued fuzzy datasets. However, only fuzzy implicator and t-norm are used in generalized interval-valued fuzzy rough sets and another two pairs of fuzzy logical operators, t-norm and t-conorm, R-implicator and its dual, have not been considered in generalized interval-valued fuzzy rough sets. In this paper, these models are generalized to a new approach that not only considers interval-valued fuzzy sets but also two pairs of fuzzy logical operators. First, we study the interval representations of interval-valued fuzzy t-norm, interval-valued fuzzy negator, interval-valued fuzzy R-implicator and their duals, which provide a theoretical basis for interval-valued fuzzy rough sets based on interval-valued fuzzy logical operators. Second, we propose generalized interval-valued fuzzy rough sets based on two pairs of fuzzy logical operators: interval-valued fuzzy t-norms and t-conorm, and interval-valued fuzzy R-implicators and its dual. Finally, we confirm that some existing models, including rough sets, interval-valued fuzzy rough sets and generalized fuzzy rough sets based on fuzzy logical operators are special cases of the proposed models.", "paper_title": "Generalized Interval-Valued Fuzzy Rough Sets Based on Interval-Valued Fuzzy Logical Operators", "paper_id": "WOS:000330156000002"}