{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "feedforward_neural_networks"}, {"score": 0.04909435677365326, "phrase": "similar_hidden-layer_weights"}, {"score": 0.046021034139586615, "phrase": "support_vectors"}, {"score": 0.00481495049065317, "phrase": "support_vector_machines"}, {"score": 0.004453874101119545, "phrase": "large_number"}, {"score": 0.004034962424068988, "phrase": "small_number"}, {"score": 0.003993216345115755, "phrase": "basis_functions"}, {"score": 0.0032430426853131346, "phrase": "sparse_models"}, {"score": 0.0031597433845085092, "phrase": "hidden_units"}, {"score": 0.0030466955629231047, "phrase": "experimental_study"}, {"score": 0.0029224275921964724, "phrase": "aforementioned_sequential_fnns"}, {"score": 0.0022407927161620855, "phrase": "sequential_fnns"}, {"score": 0.002171836484200008, "phrase": "standard_svms"}, {"score": 0.0021049977753042253, "phrase": "\"sparse\"_svms"}], "paper_keywords": ["feedforward neural networks (FNNs)", " sparse models", " support vector machines (SVMs)"], "paper_abstract": "Support vector machines (SVMs) usually need a large number of support vectors to form their output. Recently, several models have been proposed. to build SVMs with a small number of basis functions, maintaining the property that their hidden-layer weights are a subset of the data (the support vectors). This property is also present in some algorithms for feedforward neural networks (FNNs) that construct the network sequentially, leading to sparse models where the number of hidden units can be explicitly controlled. An experimental study on several benchmark data sets, comparing SVMs and the aforementioned sequential FNNs, was carried out. The experiments were performed in the same conditions for all the models, and they can be seen as a comparison of SVMs and FNNs when both models are restricted to use similar hidden-layer weights. Accuracies were found to be very similar. Regarding the number of support vectors, sequential FNNs constructed models with less hidden units than standard SVMs and in the same range as \"sparse\" SVMs. Computational times were lower for SVMs.", "paper_title": "Comparing support vector machines and feedforward neural networks with similar hidden-layer weights", "paper_id": "WOS:000246423400037"}