{"auto_keywords": [{"score": 0.04400697946998438, "phrase": "vendor_selection_criteria"}, {"score": 0.015467388594408032, "phrase": "vendor_selection"}, {"score": 0.011981527206331404, "phrase": "crucial_items"}, {"score": 0.00481495049065317, "phrase": "ann_pruning_algorithm"}, {"score": 0.004698229304089357, "phrase": "purpose_-_the_purpose"}, {"score": 0.004138575034269399, "phrase": "diverse_business_environment"}, {"score": 0.0036304470230058413, "phrase": "selection_criteria"}, {"score": 0.003428164458163043, "phrase": "mw-obs"}, {"score": 0.003386301445203071, "phrase": "importance_weights"}, {"score": 0.003290591812800382, "phrase": "data_training"}, {"score": 0.003145609726536791, "phrase": "diverse_enterprises"}, {"score": 0.0030818310926031024, "phrase": "enterprise's_mutative_business_conditions"}, {"score": 0.0029824560656987855, "phrase": "cooperation_relationships"}, {"score": 0.002827740707723551, "phrase": "different_enterprises"}, {"score": 0.0027477745788313163, "phrase": "business_environment"}, {"score": 0.0027030963394733916, "phrase": "new_data"}, {"score": 0.0024700078414481297, "phrase": "neural_network_pruning_algorithm"}, {"score": 0.0023903140267755576, "phrase": "reserved_criteria"}, {"score": 0.0023418133729330303, "phrase": "trained_network"}, {"score": 0.002322689143237591, "phrase": "extra_optimization"}, {"score": 0.002229380111189829, "phrase": "dynamic_criteria"}, {"score": 0.002202123699556382, "phrase": "enterprise's_circumstance"}], "paper_keywords": ["Vendor relations", " Neural nets", " Cybernetics", " Systems analysis"], "paper_abstract": "Purpose - The purpose of this paper is to help enterprises to define and refresh their specific vendor selection criteria according to changing situations. Design/methodology/approach - This paper firstly analyzes the variety of vendor selection criteria according to the diverse business environment. Furthermore, an approach of vendor selection based on MW-OBS (an artificial neural network pruning algorithm) is put forward. MW-OBS contributes a lot in distinguishing the crucial items of selection criteria based on certain enterprise's operational data, instead of assuming the criteria set subjectively. Meanwhile MW-OBS evaluates the importance weights of these crucial items in criteria by data training. Findings - The vendor selection criteria is believed to change for diverse enterprises and even for an enterprise's mutative business conditions because of the attribute of materials, cooperation relationships, and supplier's performance. The approach establishes the vendor selection criteria for different enterprises based on their own conditions, and once business environment changes, with new data being generated, the set can be refreshed dynamically and timely. Research limitations/implications - This approach extends the research of neural network pruning algorithm, for example the importance of all reserved criteria can be achieved from trained network without extra optimization, Originality/value - This approach put emphasis on distinguishing dynamic criteria consistent with enterprise's circumstance. Enterprises are capable of constructing their various criteria collections conveniently according to their own specific situations with the application of approach.", "paper_title": "An ANN pruning algorithm based approach to vendor selection", "paper_id": "WOS:000267416500004"}