{"auto_keywords": [{"score": 0.04829088285990108, "phrase": "gene_assembly"}, {"score": 0.015302747087719202, "phrase": "breakpoint_graph"}, {"score": 0.00481495049065317, "phrase": "gene_patterns"}, {"score": 0.004068087482412997, "phrase": "functionally_different_nucleus"}, {"score": 0.003811010743703935, "phrase": "theoretical_models"}, {"score": 0.003362660648932247, "phrase": "dna_transformation_research"}, {"score": 0.003167217223469026, "phrase": "intermediate_gene_patterns"}, {"score": 0.002779217021776702, "phrase": "loop_recombination_operation"}, {"score": 0.0024653491388223546, "phrase": "previous_results"}, {"score": 0.0024122047542536203, "phrase": "elegant_alternatives"}, {"score": 0.0022967713922705, "phrase": "micronuclear_gene_patterns"}, {"score": 0.002210814150677161, "phrase": "specific_subset"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Gene assembly in ciliates is one of the most involved DNA processings going on in any organism. This process transforms one nucleus (the micronucleus) into another functionally different nucleus (the macronucleus). We continue the development of the theoretical models of gene assembly, and in particular we demonstrate the use of the concept of the breakpoint graph, known from another branch of DNA transformation research. More specifically: (1) we characterize the intermediate gene patterns that can occur during the transformation of a given micronuclear gene pattern to its macronuclear form; (2) we determine the number of applications of the loop recombination operation (the most basic of the three molecular operations that accomplish gene assembly) needed in this transformation; (3) we generalize previous results (and give elegant alternatives for some proofs) concerning characterizations of the micronuclear gene patterns that can be assembled using a specific subset of the three molecular operations. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Reducibility of gene patterns in ciliates using the breakpoint graph", "paper_id": "WOS:000237197900004"}