{"auto_keywords": [{"score": 0.04907561130245922, "phrase": "grid_services"}, {"score": 0.015719716506582538, "phrase": "bottom-up_ontology_evolution"}, {"score": 0.0067390708193794105, "phrase": "shared_ontology"}, {"score": 0.005750440013353959, "phrase": "ontology_evolution"}, {"score": 0.004631527916092452, "phrase": "service_sharing"}, {"score": 0.004582722012454012, "phrase": "grid_environment"}, {"score": 0.004315670715009727, "phrase": "heterogeneous_ontologies"}, {"score": 0.003992950134435965, "phrase": "domain-specific_ontology"}, {"score": 0.003923023699005215, "phrase": "concerned_parties"}, {"score": 0.0034543031591181546, "phrase": "flexible_infrastructure"}, {"score": 0.003264316172836322, "phrase": "flexible_ontology_management_approach"}, {"score": 0.003195787852087248, "phrase": "grid_service_capabilities"}, {"score": 0.0027546167254869493, "phrase": "real-time_evaluations"}, {"score": 0.0025846562485378247, "phrase": "ontology_users"}, {"score": 0.0025573643582417573, "phrase": "impact_factors"}, {"score": 0.0022997683233147125, "phrase": "ontology_management_framework"}, {"score": 0.002259426425685765, "phrase": "semantic_discovery"}, {"score": 0.002219790619936024, "phrase": "grid_service_capability"}, {"score": 0.0021501863832966966, "phrase": "users'_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["semantic discovery and description of Grid services", " ontology evolution", " ontology management framework"], "paper_abstract": "The problem of service sharing in a Grid environment arises from the heterogeneity of ontologies. The discovery and description of Grid services based on the heterogeneous ontologies might give rise to misunderstanding of the contents. In order to reduce and ultimately to remove the misunderstanding, a domain-specific ontology should be shared among concerned parties, and the abilities of Grid services should be discovered and described based on that shared ontology. However, since the ontology evolves as time goes by, the shared ontology for the Grid services should have a flexible infrastructure that has an ability to reflect the changes in ontologies. This paper proposes a flexible ontology management approach for discovery and description of Grid service capabilities supporting ontology evolution whose goal is to enhance the interoperability among Grid services. In this approach, concepts and descriptions in an ontology are defined independently, and they are connected by relationships. In addition, the relationships are updated based on real-time evaluations of ontology users in order to flexibly support ontology evolution. A bottom-up ontology evolution means such environment that allows ontology users to evaluate impact factors of concepts in an ontology and that results of the evaluation are reflected to the modification of the ontology. The contribution of this paper is to suggest the ontology management framework that not only enables semantic discovery and description of a Grid service capability but also supports a bottom-up ontology evolution based on the users' evaluations. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "A framework for supporting bottom-up ontology evolution for discovery and description of Grid services", "paper_id": "WOS:000242979100012"}