{"auto_keywords": [{"score": 0.047610746948366554, "phrase": "monoidal_categories"}, {"score": 0.00481495049065317, "phrase": "new_model"}, {"score": 0.004190796368475121, "phrase": "standard_models"}, {"score": 0.004054479957160662, "phrase": "succinct_categorical_interface"}, {"score": 0.0033245147666408157, "phrase": "salient_feature"}, {"score": 0.003050376875258722, "phrase": "sound_and_complete_graphical_formalism"}, {"score": 0.0028930017387859804, "phrase": "concrete_and_intuitive_interface"}, {"score": 0.0027437235598539904, "phrase": "original_motivation"}, {"score": 0.002689746491842271, "phrase": "ultimate_goal"}, {"score": 0.0025509294021449254, "phrase": "convenient_high_level_programming_language"}, {"score": 0.0024678216843278806, "phrase": "computational_resources"}, {"score": 0.00240328454980006, "phrase": "one-way_functions"}, {"score": 0.0022049428043454966, "phrase": "low_level_implementation_details"}], "paper_keywords": [""], "paper_abstract": "We present a new model of computation, described in terms of monoidal categories. It conforms to the Church-Turing Thesis, and captures the same computable functions as the standard models. It provides a succinct categorical interface to most of them, free of their diverse implementation details, using the ideas and structures that in the meantime emerged from research in semantics of computation and programming. The salient feature of the language of monoidal categories is that it is supported by a sound and complete graphical formalism, string diagrams, which provide a concrete and intuitive interface for abstract reasoning about computation. The original motivation and the ultimate goal of this effort is to provide a convenient high level programming language for a theory of computational resources, such as one-way functions, and trapdoor functions, by adopting the methods for hiding the low level implementation details that emerged from practice. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Monoidal computer I: Basic computability by string diagrams", "paper_id": "WOS:000318263000007"}