{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge-based_systems"}, {"score": 0.010083914766706793, "phrase": "product_knowledge"}, {"score": 0.0067242301810809205, "phrase": "kbs"}, {"score": 0.004515467468684217, "phrase": "increasingly_significant_roles"}, {"score": 0.004476963405985556, "phrase": "new_product_development_process"}, {"score": 0.004039639718055365, "phrase": "product_development_activities"}, {"score": 0.004005176784823524, "phrase": "new_knowledge_modelling_methodologies"}, {"score": 0.0031102878400698143, "phrase": "comprehensive_review"}, {"score": 0.0030705342386533083, "phrase": "recent_development"}, {"score": 0.002954287204671029, "phrase": "rapid_product_development"}, {"score": 0.0028669153591624696, "phrase": "relevant_technologies"}, {"score": 0.002564360070426064, "phrase": "product_development"}, {"score": 0.0023333715029833007, "phrase": "-kind_product_development"}, {"score": 0.002274059352027922, "phrase": "future_trend"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge management", " Product knowledge modelling", " Customised production", " One-of-a-Kind Production (OKP)", " Knowledge-based systems (KBSs)"], "paper_abstract": "In recent years, product knowledge has played increasingly significant roles in new product development process especially in the development of One-of-a-Kind products. Although knowledge-based systems (KBSs) have been proposed to support product development activities and new knowledge modelling methodologies have been developed, they are still far from complete. This area has become attractive to many researchers and as a result, many new knowledge-based systems, methods and tools have been developed. However, to the best of our knowledge, knowledge-based systems for product development have not been systematically reviewed, compared and summarized. This paper provides a comprehensive review on the recent development of KBS, methods and tools in supporting rapid product development. In the paper, the relevant technologies for modelling, managing and representing knowledge are investigated and reviewed systematically for better understanding their characteristics. The focus is placed on knowledge-based systems that support product development, and how product knowledge is identified, captured, represented and reused during the processes of One-of-a-Kind product development. The limitations and the future trend of KBS are presented in terms of how they can help One-of-a-Kind Production (OKP) companies. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Recent development of knowledge-based systems, methods and tools for One-of-a-Kind Production", "paper_id": "WOS:000293683500016"}