{"auto_keywords": [{"score": 0.032979728088330336, "phrase": "nam"}, {"score": 0.01053193097258252, "phrase": "allosteric_modulator"}, {"score": 0.00481495049065317, "phrase": "computational_analysis_of_negative"}, {"score": 0.004372712391262538, "phrase": "drug_targets"}, {"score": 0.0038691879515317267, "phrase": "chronic_pain"}, {"score": 0.00370077772049505, "phrase": "positive_and_negative_allosteric_modulators"}, {"score": 0.0034875380341306468, "phrase": "experimental_information"}, {"score": 0.003436169600453596, "phrase": "specialized_protocol"}, {"score": 0.003360527337581911, "phrase": "docking_accuracy"}, {"score": 0.003323330859027428, "phrase": "receptor_relaxation"}, {"score": 0.0030971167963527303, "phrase": "pam"}, {"score": 0.003006499028632742, "phrase": "receptor_inactivation"}, {"score": 0.002582032847722892, "phrase": "allosteric_site"}, {"score": 0.002553431170229379, "phrase": "potentially_the_receptor_state"}, {"score": 0.002344398099179438, "phrase": "similar_binding_modes"}, {"score": 0.002309828105129336, "phrase": "distinct_effects"}, {"score": 0.002176560171729638, "phrase": "possible_activation_mechanism"}, {"score": 0.0021206948586186903, "phrase": "rational_design"}, {"score": 0.0021049977753042253, "phrase": "new_allosteric_modulators"}], "paper_keywords": [""], "paper_abstract": "Metabotropic glutamate receptors (mGluRs) are high-profile G-protein coupled receptors drug targets because of their involvement in several neurological disease states, and mGluR5 in particular is a subtype whose controlled allosteric modulation, both positive and negative, can potentially be useful for the treatment of schizophrenia and relief of chronic pain, respectively. Here we model mGluR5 with a collection of positive and negative allosteric modulators (PAMs and NAMs) in both active and inactive receptor states, in a manner that is consistent with experimental information, using a specialized protocol that includes homology to increase docking accuracy, and receptor relaxation to generate an individual induced fit with each allosteric modulator. Results implicate two residues in particular for NAM and PAM function: NAM interaction with W785 for receptor inactivation, and NAM/PAM H-bonding with S809 for receptor (in)activation. Models suggest the orientation of the H-bond between allosteric modulator and S809, controlled by PAM/NAM chemistry, influences the position of TM7, which in turn influences the shape of the allosteric site, and potentially the receptor state. NAM-bound and PAM-bound mGluR5 models also reveal that although PAMs and NAMs bind in the same pocket and share similar binding modes, they have distinct effects on the conformation of the receptor. Our models, together with the identification of a possible activation mechanism, may be useful in the rational design of new allosteric modulators for mGluR5.", "paper_title": "Computational Analysis of Negative and Positive Allosteric Modulator Binding and Function in Metabotropic Glutamate Receptor 5 (In)Activation", "paper_id": "WOS:000336637400018"}