{"auto_keywords": [{"score": 0.04892132379047202, "phrase": "expression_measurement_uncertainty"}, {"score": 0.010989194200508375, "phrase": "de_genes"}, {"score": 0.006461536460323038, "phrase": "de_detection"}, {"score": 0.00481495049065317, "phrase": "differential_expression"}, {"score": 0.0047563776685277314, "phrase": "rna-seq_data"}, {"score": 0.004641351004344458, "phrase": "high-throughput_rna_sequencing"}, {"score": 0.00436575511349828, "phrase": "revolutionary_and_powerful_technology"}, {"score": 0.0038624981944755813, "phrase": "normalized_read_counts"}, {"score": 0.0031942814007173254, "phrase": "de_isoforms"}, {"score": 0.0030601162942933665, "phrase": "bayesian_framework"}, {"score": 0.002723607240517261, "phrase": "useful_information"}, {"score": 0.0021049977753042253, "phrase": "gamseq-bdseq_rna-seq_analysis_pipeline"}], "paper_keywords": ["RNA-seq", " Bayesian method", " differentially expressed genes/isoforms", " expression measurement uncertainty", " analysis pipeline"], "paper_abstract": "High-throughput RNA sequencing (RNA-seq) has emerged as a revolutionary and powerful technology for expression profiling. Most proposed methods for detecting differentially expressed (DE) genes from RNA-seq are based on statistics that compare normalized read counts between conditions. However, there are few methods considering the expression measurement uncertainty into DE detection. Moreover, most methods are only capable of detecting DE genes, and few methods are available for detecting DE isoforms. In this paper, a Bayesian framework (BDSeq) is proposed to detect DE genes and isoforms with consideration of expression measurement uncertainty. This expression measurement uncertainty provides useful information which can help to improve the performance of DE detection. Three real RAN-seq data sets are used to evaluate the performance of BDSeq and results show that the inclusion of expression measurement uncertainty improves accuracy in detection of DE genes and isoforms. Finally, we develop a GamSeq-BDSeq RNA-seq analysis pipeline to facilitate users.", "paper_title": "Detecting differential expression from RNA-seq data with expression measurement uncertainty", "paper_id": "WOS:000358611800013"}