{"auto_keywords": [{"score": 0.04807157020342475, "phrase": "image_analysis"}, {"score": 0.04767944569251897, "phrase": "pattern_recognition_methods"}, {"score": 0.03499287706783537, "phrase": "amino_silica_plates"}, {"score": 0.03441652477229552, "phrase": "propolis_samples"}, {"score": 0.0318016607543288, "phrase": "european_propolis"}, {"score": 0.03127616605838268, "phrase": "specific_r-f_values"}, {"score": 0.030631105965802197, "phrase": "studied_extracts"}, {"score": 0.00481495049065317, "phrase": "hptlc_fingerprinting"}, {"score": 0.004773904938276846, "phrase": "propolis_extracts"}, {"score": 0.00473320761888448, "phrase": "high-performance_thin-layer_chromatography"}, {"score": 0.004363412458227717, "phrase": "serbia"}, {"score": 0.004289299070133963, "phrase": "croatia"}, {"score": 0.004252707756312684, "phrase": "modern_thin-layer_chromatography_equipment"}, {"score": 0.004144810537437608, "phrase": "image_processing"}, {"score": 0.004005176784823524, "phrase": "data_acquisition"}, {"score": 0.0038868464660354626, "phrase": "principal_component_analysis"}, {"score": 0.00385368199735867, "phrase": "cluster_analysis"}, {"score": 0.0038207994186834015, "phrase": "partial_least_square-discriminant_analysis"}, {"score": 0.0037398106866046972, "phrase": "simple_and_fast_hptlc_method"}, {"score": 0.003477029725200912, "phrase": "planar_chromatography"}, {"score": 0.003447349911141396, "phrase": "hptlc_fingerprint_analysis"}, {"score": 0.003359816816853762, "phrase": "first_time"}, {"score": 0.0026882700311968025, "phrase": "john_wiley"}, {"score": 0.002404522326122611, "phrase": "high-performance_thin-layer_chromatography_analysis"}], "paper_keywords": ["pattern recognition methods", " image processing", " dynamic time warping", " HPTLC", " propolis"], "paper_abstract": "High-performance thin-layer chromatography (HPTLC) combined with image analysis and pattern recognition methods were used for fingerprinting and classification of 52 propolis samples collected from Serbia and one sample from Croatia. Modern thin-layer chromatography equipment in combination with software for image processing and warping was applied for fingerprinting and data acquisition. The three mostly used chemometric techniques for classification, principal component analysis, cluster analysis and partial least square-discriminant analysis, in combination with simple and fast HPTLC method for fingerprint analysis of propolis, were performed in order to favor and encourage their use in planar chromatography. HPTLC fingerprint analysis of propolis was for the first time performed on amino silica plates. All studied propolis samples have been classified in two major types, orange and blue, supporting the idea of existence of two types of European propolis. Signals at specific R-F values responsible for classification of studied extracts have also been isolated and underlying compounds targeted for further investigation. Copyright (c) 2014 John Wiley & Sons, Ltd. High-performance thin-layer chromatography combined with image analysis and pattern recognition methods were used for fingerprinting and classification of 53 propolis samples. High-performance thin-layer chromatography analysis of propolis was for the first time performed on amino silica plates. All studied propolis samples have been classified in two major types, orange and blue, supporting the idea of existence of two varieties of European propolis. Signals at specific R-F values responsible for classification of studied extracts have also been isolated and underlying compounds targeted for further investigation.", "paper_title": "Pattern recognition methods and multivariate image analysis in HPTLC fingerprinting of propolis extracts", "paper_id": "WOS:000333753400010"}