{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "appropriate_feedback"}, {"score": 0.004625255533545965, "phrase": "crucial_form"}, {"score": 0.0044231966846655394, "phrase": "new_educational_technologies"}, {"score": 0.004173603566828364, "phrase": "existing_research"}, {"score": 0.004118026552723285, "phrase": "learning_outcomes"}, {"score": 0.003991196463806465, "phrase": "computer_mediated_feedback"}, {"score": 0.0038338299812503, "phrase": "educational_data-mining_technology"}, {"score": 0.0036826452656927877, "phrase": "elaborate_feedback"}, {"score": 0.0035216195857272403, "phrase": "nature_dimensions"}, {"score": 0.002931569771634119, "phrase": "content_analysis_method"}, {"score": 0.002716844480081738, "phrase": "feedback_messages"}, {"score": 0.002506562885555113, "phrase": "motivational_and_summative_feedback"}, {"score": 0.002322895056238477, "phrase": "summative_and_formative_feedback_students"}, {"score": 0.002181766829493483, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feedback", " Content", " Nature", " Educational technologies", " Content analysis"], "paper_abstract": "Feedback is a crucial form of information for learners. With the availability of new educational technologies, the manner in which feedback is delivered has changed tremendously. Existing research on the learning outcomes of the content and nature of computer mediated feedback is limited and contradictory. Signals is an educational data-mining technology for student success where instructors can send students elaborate feedback. Hence, this paper examines the content and nature dimensions of feedback in Signals with two studies. Study one identifies how the instructors who used this technology define its feedback function. Study two identifies the types of feedback that were included in the messages sent to students. Both studies employ content analysis method; study one examines the transcripts of interviews with instructors, and study two examines the feedback messages composed by instructors. Results indicate that while instructors perceive Signals as a tool to primarily provide motivational and summative feedback, student success was related to the type, and performance or outcome orientation of both summative and formative feedback students received. The results and implications of both studies are further discussed and future directions are proposed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Using Signals for appropriate feedback: Perceptions and practices", "paper_id": "WOS:000295860100020"}