{"auto_keywords": [{"score": 0.029798932888724827, "phrase": "td_memory_size"}, {"score": 0.00481495049065317, "phrase": "distributed_traffic_monitoring"}, {"score": 0.004789760466836797, "phrase": "traffic_digest_splitting"}, {"score": 0.004346704947011699, "phrase": "distributed_traffic_measurement"}, {"score": 0.004267593898646735, "phrase": "highspeed_packet_networks"}, {"score": 0.004223032986655664, "phrase": "network-wide_origination-destination-pair-based_flow_measurement_estimation"}, {"score": 0.0040387608245932086, "phrase": "single_traffic_digest"}, {"score": 0.003923815926819606, "phrase": "monitoring_point"}, {"score": 0.003842271807385085, "phrase": "relative_estimation_error"}, {"score": 0.003772306776343196, "phrase": "low-volume_flows"}, {"score": 0.003441069696100277, "phrase": "traffic_monitoring_schemes"}, {"score": 0.003405109584265324, "phrase": "localized_optimal_td_splitting_strategy"}, {"score": 0.0033081387767897445, "phrase": "different_sub-tds"}, {"score": 0.0031553611552558986, "phrase": "single_td"}, {"score": 0.003097865379563127, "phrase": "\"noise-to-signal\"_ratio"}, {"score": 0.0028480459059007468, "phrase": "negative_effect"}, {"score": 0.0027596331277401766, "phrase": "total_memory_size"}, {"score": 0.0026529564991826966, "phrase": "single-td_approach"}, {"score": 0.0025977542995083624, "phrase": "analytical_expressions"}, {"score": 0.00257735013358606, "phrase": "optimal_splitting_threshold"}, {"score": 0.0025503930258942062, "phrase": "resultant_maximum_relative_error"}, {"score": 0.002471197479601348, "phrase": "empirical_traffic_traces"}, {"score": 0.0024389277933858054, "phrase": "single-level_td-splitting"}, {"score": 0.0023139986108451967, "phrase": "baseline_tma_scheme"}, {"score": 0.0021667778225942227, "phrase": "localized_multi-level_td-splitting"}, {"score": 0.0021049977753042253, "phrase": "additional_implementation_complexity"}], "paper_keywords": ["Traffic measurement and analysis", " Set cardinality estimation", " Traffic digest"], "paper_abstract": "Recently, several Traffic Digest-based Network Monitoring schemes including, DATALITE [24], Proportional Union (Pu) [9] and the Quasi Maximum Likelihood approach (QMLE) [8] have been proposed to support distributed traffic measurement and analysis (TMA) for highspeed packet networks in general and network-wide Origination-Destination-pair-based Flow measurement estimation in particular. In these schemes, traffic flows defined by their O-D pair are mapped into a single traffic digest (TD) for measurement as they traverse through a monitoring point. It has been observed that the relative estimation error caused by such single-TD approach is significant for low-volume flows (mice) when they share the link with other large volume ones (elephants), which is quite common in practice. In this paper, we propose to enhance existing TD-based distributed traffic monitoring schemes by taking a localized optimal TD splitting strategy: flows sharing the same link are partitioned and mapped into different sub-TDs according to their previously estimated flow volume. By avoiding the mixing of \"mice\" and \"elephant\" flows in a single TD, we can significantly reduce the \"noise-to-signal\" ratio experienced by the former. Moreover, it can be shown that the reduction in such \"noise-to-signal\" ratio is more than enough to offset the negative effect caused by reduction in TD memory size for each sub-group (since the total memory size required across all sub-TDs is kept to be the same as that of the single-TD approach without splitting). We have derived analytical expressions of the optimal splitting threshold by minimizing the resultant maximum relative error of the flows sharing a link under various traffic distributions. Our simulation results using empirical traffic traces show that, with single-level TD-splitting, we can reduce the r.m.s. relative estimation error of all flows by 8-76%, depending on the baseline TMA scheme. More importantly, this can be translated to 15-94% savings in TD memory size while maintaining the same estimation error requirement. We also show that, by applying localized multi-level TD-splitting, further savings can be realized at the expense of additional implementation complexity. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Enhancing distributed traffic monitoring via traffic digest splitting", "paper_id": "WOS:000290066300011"}