{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "two-tree_mixtures"}, {"score": 0.004764220976404241, "phrase": "group-based_models"}, {"score": 0.0044237033788643715, "phrase": "incomplete_lineage"}, {"score": 0.004195418010131832, "phrase": "different_topologies"}, {"score": 0.00385431710959668, "phrase": "recent_work"}, {"score": 0.003753498345597498, "phrase": "character_change"}, {"score": 0.002879158342988017, "phrase": "dna_sequence_data"}, {"score": 0.002833689453299307, "phrase": "algebraic_techniques"}, {"score": 0.002744888626958772, "phrase": "tree_parameters"}, {"score": 0.0025892330566358503, "phrase": "generic_substitution_parameters"}, {"score": 0.002548331088496964, "phrase": "jc_mixture_models"}, {"score": 0.002429451930463481, "phrase": "generic_identifiability_results"}, {"score": 0.00229164285862567, "phrase": "full_phylogenetic_signal"}, {"score": 0.0021616339773325704, "phrase": "misleading_guide"}], "paper_keywords": ["Phylogenetic mixture", " group-based model", " identifiability of phylogenetic models"], "paper_abstract": "Phylogenetic data arising on two possibly different tree topologies might be mixed through several biological mechanisms, including incomplete lineage sorting or horizontal gene transfer in the case of different topologies, or simply different substitution processes on characters in the case of the same topology. Recent work on a 2-state symmetric model of character change showed that for 4 taxa, such a mixture model has nonidentifiable parameters, and thus, it is theoretically impossible to determine the two tree topologies from any amount of data under such circumstances. Here, the question of identifiability is investigated for two-tree mixtures of the 4-state group-based models, which are more relevant to DNA sequence data. Using algebraic techniques, we show that the tree parameters are identifiable for the JC and K2P models. We also prove that generic substitution parameters for the JC mixture models are identifiable, and for the K2P and K3P models obtain generic identifiability results for mixtures on the same tree. This indicates that the full phylogenetic signal remains in such mixtures, and the 2-state symmetric result is thus a misleading guide to the behavior of other models.", "paper_title": "Identifiability of Two-Tree Mixtures for Group-Based Models", "paper_id": "WOS:000288225000011"}