{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computing_capabilities"}, {"score": 0.004730458558634266, "phrase": "potentially_every_object"}, {"score": 0.004304144138805271, "phrase": "data_generation"}, {"score": 0.003802135020791801, "phrase": "constant_need"}, {"score": 0.0036697319652557363, "phrase": "incredible_amount"}, {"score": 0.002984027623988469, "phrase": "information_users"}, {"score": 0.0028630535573013686, "phrase": "data_controllers"}, {"score": 0.0024842242921857705, "phrase": "present-day_privacy_legislation"}, {"score": 0.0023694065215394593, "phrase": "ami_environment"}, {"score": 0.002259883463607508, "phrase": "new_principles"}, {"score": 0.002194011800331242, "phrase": "new_regulations"}, {"score": 0.0021049977753042253, "phrase": "changed_context"}], "paper_keywords": ["ambient intelligence", " privacy", " profiling", " surveillance", " transparency"], "paper_abstract": "In an ambient intelligent (AmI) environment with computing capabilities embedded in potentially every object it will be difficult (if not impossible) for users to maintain control over data generation, transfer, and use and to achieve unobservability and anonymity. Obtaining consent might not be feasible for the constant need for collection and exchange of incredible amount of data. In most cases, individuals are not aware that profiling is done, what profiles are being compiled, and what decisions may result from these profiles. Due to the overflow of information users cannot maintain knowledge of all data controllers that have some of their data or exercise their right to correct, rectify, block, or erase information collected about them. The present-day privacy legislation has several weaknesses if confronted with the AmI environment that could lead to the need for new principles on which to base new regulations, to take account of the changed context.", "paper_title": "Privacy in the age of transparency - The new vulnerability of the individual", "paper_id": "WOS:000252534100006"}