{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grammar_rules"}, {"score": 0.049561472167574526, "phrase": "programming_language_dialects"}, {"score": 0.04489580559834048, "phrase": "programming_language"}, {"score": 0.0045108906244892165, "phrase": "grammatical_inference"}, {"score": 0.004437910956996051, "phrase": "programming_language_domain"}, {"score": 0.004225950334493496, "phrase": "important_asset"}, {"score": 0.0037087324991876727, "phrase": "source_code"}, {"score": 0.003290237137651949, "phrase": "incomplete_grammar"}, {"score": 0.0031845067058084613, "phrase": "correct_programs"}, {"score": 0.0025611773887867255, "phrase": "rule_evaluation_order"}, {"score": 0.0021631447601689444, "phrase": "proposed_rule_evaluation_order"}, {"score": 0.0021049977753042253, "phrase": "grammar_inference"}], "paper_keywords": ["programming language grammars", " dialects", " Minimum Description Length Principle"], "paper_abstract": "In this paper we address the problem of grammatical inference in the programming language domain. The grammar of a programming language is an important asset because it is used in developing many software engineering tools. Sometimes, grammars of languages are not available and have to be inferred from the source code; especially in the case of programming language dialects. We propose an approach for inferring the grammar of a programming language when an incomplete grammar along with a set of correct programs is given as input. The approach infers a set of grammar rules such that the addition of these rules makes the initial grammar complete. A grammar is complete if it parses all the input programs successfully. We also proposes a rule evaluation order, i.e. an order in which the rules are evaluated for correctness. A set of rules are correct if their addition makes the grammar complete. Experiments show that the proposed rule evaluation order improves the process of grammar inference.", "paper_title": "Inferring grammar rules of programming language dialects", "paper_id": "WOS:000242124200017"}