{"auto_keywords": [{"score": 0.028092254170072706, "phrase": "real_time"}, {"score": 0.004632039024076267, "phrase": "moving_rigid_object"}, {"score": 0.0045726187330434025, "phrase": "vision_data"}, {"score": 0.004106063237069123, "phrase": "fast_algorithm"}, {"score": 0.004001335931796133, "phrase": "optimal_force_closure_grasp_points"}, {"score": 0.003949974260471287, "phrase": "slowly_moving_and_deforming_object"}, {"score": 0.003799796252156605, "phrase": "best_grasp_points"}, {"score": 0.003751011827704279, "phrase": "object_deforms"}, {"score": 0.0036553070575015344, "phrase": "future_instant"}, {"score": 0.003471135453226184, "phrase": "potential_grasping_configurations"}, {"score": 0.003441352119167824, "phrase": "force_closure"}, {"score": 0.0033680032592969633, "phrase": "objective_function"}, {"score": 0.003310447652300423, "phrase": "grasping_span"}, {"score": 0.003212074324593725, "phrase": "object_centroid"}, {"score": 0.00307657476125683, "phrase": "population_based_stochastic_search_strategy"}, {"score": 0.0029980260560551982, "phrase": "optimal_configurations"}, {"score": 0.0026116610153271943, "phrase": "optimal_grasp_points"}, {"score": 0.00241658945942583, "phrase": "great_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Regrasp planning", " Force closure", " Stochastic search", " Object tracking"], "paper_abstract": "In the last two decades several researchers have studied the problem of grasping of a moving rigid object based on vision data. However the problem of grasping a moving and deforming object still remains unsolved. In this paper we present the development of a fast algorithm for the computation of the optimal force closure grasp points on a slowly moving and deforming object. The main focus is to find the best grasp points as the object deforms, track its position at a future instant and then transfer grasp at that location. At first the potential grasping configurations satisfying force closure are evaluated through an objective function that maximizes the grasping span while minimizing the distance between the object centroid and the intersection of the fingertip normal. A population based stochastic search strategy is adopted for computing the optimal configurations and re-localizing them as the shape undergoes translations, rotations and scaling. Experiments have been conducted to prove that the object can be tracked in real time and the optimal grasp points determined so that a three finger robot can capture it. This method works in real time so it has great potential for application in industries for grasping objects whose shapes are not clearly defined (e.g. cloth), deforming objects, or objects that are partially occluded. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Stochastic re-grasp planning for vision aided capture of deforming and moving object", "paper_id": "WOS:000266223700011"}