{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "top-down_and_bottom-up_processes"}, {"score": 0.045419410555604965, "phrase": "prior_knowledge"}, {"score": 0.04117496958825152, "phrase": "mental_model"}, {"score": 0.00386876598761639, "phrase": "mechanical_system"}, {"score": 0.003775803846431323, "phrase": "interactive_controls"}, {"score": 0.003409057326528229, "phrase": "design_features"}, {"score": 0.002931569771634119, "phrase": "domain_knowledge"}, {"score": 0.0028333356794133053, "phrase": "even_some_learners"}, {"score": 0.0028058765785670546, "phrase": "high_domain_knowledge"}, {"score": 0.002751751956416832, "phrase": "incorrect_mental_model"}, {"score": 0.002711842889248926, "phrase": "multiple_exposures"}, {"score": 0.0026337482179592422, "phrase": "high_knowledge_learners"}, {"score": 0.0025085435314540837, "phrase": "low-knowledge_learners"}, {"score": 0.0023546121947302877, "phrase": "complex_interplay"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["animations", " mental models", " interactivity", " learning"], "paper_abstract": "To evaluate how top-down and bottom-up processes contribute to learning from animated displays, we conducted four experiments that varied either in the design of animations or the prior knowledge of the learners. Experiments 1-3 examined whether adding interactivity and signaling to an animation benefits learners in developing a mental model of a mechanical system. Although learners utilized interactive controls and signaling devices, their comprehension of the system was no better than that of learners who saw animations without these design features. Furthermore, the majority of participants developed a mental model of the system that was incorrect and inconsistent with information displayed in the animation. Experiment 4 tested effects of domain knowledge and found, surprisingly, that even some learners with high domain knowledge initially constructed the incorrect mental model. After multiple exposures to the materials, the high knowledge learners revised their mental models to the correct one, while the low-knowledge learners maintained their erroneous models. These results suggest that learning from animations involves a complex interplay between top-down and bottom-up processes and that more emphasis should be placed on how prior knowledge is applied to interpreting animations. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Top-down and bottom-up influences on learning from animations", "paper_id": "WOS:000249997800002"}