{"auto_keywords": [{"score": 0.03227078104988101, "phrase": "online_product_reviews"}, {"score": 0.00481495049065317, "phrase": "useful_product_reviews"}, {"score": 0.004600392118852447, "phrase": "amazon.com"}, {"score": 0.0038551626276406175, "phrase": "different_product_reviews"}, {"score": 0.0036207206487324506, "phrase": "immense_number"}, {"score": 0.0035796471115594553, "phrase": "lengthy_reviews"}, {"score": 0.0034988876789164235, "phrase": "large_amount"}, {"score": 0.003459191419478298, "phrase": "available_online_product_reviews"}, {"score": 0.0033619033669956317, "phrase": "impossible_task"}, {"score": 0.0031754329320561317, "phrase": "vital_importance"}, {"score": 0.0031215289677725693, "phrase": "recommender_systems"}, {"score": 0.0028328599839713866, "phrase": "information_gain-based_model"}], "paper_keywords": ["Recommender systems", " Product reviews", " Information gain", " Ranking", " Scoring"], "paper_abstract": "Recently, many e-commerce Web sites, such as Amazon.com, provide platforms for users to review products and share their opinions, in order to help consumers make their best purchase decisions. However, the quality and the level of helpfulness of different product reviews are not disclosed to consumers unless they carefully analyze an immense number of lengthy reviews. Considering the large amount of available online product reviews, this is an impossible task for any consumer. Therefore, it is of vital importance to develop recommender systems that can evaluate online product reviews effectively to recommend the most useful ones to consumers. This paper proposes an information gain-based model to predict the helpfulness of online product reviews, with the aim of suggesting the most suitable products and vendors to consumers. Reviews are analyzed and ranked by our scoring model and reviews that help consumers better than others will be found. In addition, we also compare our model with several machine learning algorithms. Our experimental results show that our approach is effective in ranking and classifying online product reviews.", "paper_title": "An information gain-based approach for recommending useful product reviews", "paper_id": "WOS:000287251500003"}