{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "preference_relations"}, {"score": 0.03761469424672232, "phrase": "intuitionistic_fuzzy_preference_relation"}, {"score": 0.032406186422145544, "phrase": "symmetrical_scale"}, {"score": 0.004746065479362881, "phrase": "intuitionistic_multiplicative_information"}, {"score": 0.004655742198075387, "phrase": "powerful_techniques"}, {"score": 0.0038600230206554792, "phrase": "fuzzy_preference_relation"}, {"score": 0.003108814986752103, "phrase": "intuitionistic_fuzzy_preference"}, {"score": 0.0030058503645435455, "phrase": "decision_makers'_preference_relations"}, {"score": 0.0027965187255008647, "phrase": "unsymmetrical_scale"}, {"score": 0.0025892330566358503, "phrase": "new_concept"}, {"score": 0.0022845800828325577, "phrase": "intuitionistic_multiplicative_preference_information"}, {"score": 0.0022409963215568565, "phrase": "aggregation_techniques"}, {"score": 0.0021049977753042253, "phrase": "intuitionistic_multiplicative_preference_relations"}], "paper_keywords": ["Aggregation operator", " decision making", " intuitionistic fuzzy set", " preference relation"], "paper_abstract": "Preference relations are powerful techniques to express the preferences over alternatives (or criteria) and mainly fall into two categories: fuzzy preference relations (also called reciprocal preference relations) and multiplicative preference relations. For a pair of alternatives, a fuzzy preference relation only gives the degree that an alternative is prior to another; thus, the intuitionistic fuzzy preference relation is introduced by adding the degree that an alternative is not prior to another, which can describe the preferences over two alternatives more comprehensively. However, the intuitionistic fuzzy preference uses the symmetrical scale to express the decision makers' preference relations, which are inconsistent with our intuition in some situations. If we use the unsymmetrical scale to express the preferences about two alternatives instead of the symmetrical scale in intuitionistic fuzzy preference relation, then a new concept is introduced, which we call the intuitionistic multiplicative preference relation reflecting our intuition more objectively. In this paper, we study the aggregation of intuitionistic multiplicative preference information, propose some aggregation techniques, investigate their properties, and apply them to decision making based on intuitionistic multiplicative preference relations.", "paper_title": "Preference Relations Based on Intuitionistic Multiplicative Information", "paper_id": "WOS:000314724900008"}