{"auto_keywords": [{"score": 0.037656011773009854, "phrase": "eda"}, {"score": 0.01520275034874914, "phrase": "mobile_users"}, {"score": 0.011328372636124554, "phrase": "proposed_eda"}, {"score": 0.004602773636967002, "phrase": "location-based_services"}, {"score": 0.004383406949799696, "phrase": "centralized_architecture"}, {"score": 0.004285702427563952, "phrase": "trustworthy_third_party"}, {"score": 0.0036052633308076933, "phrase": "enhanced_dual-active_spatial_cloaking_algorithm"}, {"score": 0.0035248419365839856, "phrase": "location_privacy"}, {"score": 0.003232779373179631, "phrase": "challenging_characteristics"}, {"score": 0.003021141590548526, "phrase": "negotiation_process"}, {"score": 0.002953711377604328, "phrase": "duplicate_locations"}, {"score": 0.0028446460307503343, "phrase": "communication_overhead"}, {"score": 0.0027499252661633525, "phrase": "user_locations"}, {"score": 0.002708843102301451, "phrase": "latest_available_information"}, {"score": 0.0026483647033436674, "phrase": "inaccuracy_problem"}, {"score": 0.0025989960809479104, "phrase": "out-of-date_locations"}, {"score": 0.0024105326885334962, "phrase": "extensive_simulations"}, {"score": 0.002252602622785975, "phrase": "existing_solutions"}, {"score": 0.00223570488212345, "phrase": "experimental_results"}, {"score": 0.0021209097150420896, "phrase": "service_time"}, {"score": 0.0021049977753042253, "phrase": "minimized_communication_overhead"}], "paper_keywords": ["Location-based service", " Privacy preservation", " Spatial cloaking", " Mobile peer-to-peer networks"], "paper_abstract": "Various solutions have been proposed to enable mobile users to access location-based services while preserving their location privacy. Some of these solutions are based on a centralized architecture with the participation of a trustworthy third party, whereas some other approaches are based on a mobile peer-to-peer (P2P) architecture. The former approaches suffer from the scalability problem when networks grow large, while the latter have to endure either low anonymization success rates or high communication overheads. To address these issues, this paper deals with an enhanced dual-active spatial cloaking algorithm (EDA) for preserving location privacy in mobile P2P networks. The proposed EDA allows mobile users to collect and actively disseminate their location information to other users. Moreover, to deal with the challenging characteristics of mobile P2P networks, e.g., constrained network resources and user mobility, EDA enables users (1) to perform a negotiation process to minimize the number of duplicate locations to be shared so as to significantly reduce the communication overhead among users, (2) to predict user locations based on the latest available information so as to eliminate the inaccuracy problem introduced by using some out-of-date locations, and (3) to use a latest-record-highest-priority (LRHP) strategy to reduce the probability of broadcasting fewer useful locations. Extensive simulations are conducted for a range of P2P network scenarios to evaluate the performance of EDA in comparison with the existing solutions. Experimental results demonstrate that the proposed EDA can improve the performance in terms of anonymity and service time with minimized communication overhead.", "paper_title": "EDA: an enhanced dual-active algorithm for location privacy preservation inmobile P2P networks", "paper_id": "WOS:000318558100004"}