{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hilbert_transform"}, {"score": 0.007662170785349807, "phrase": "bounded_bandlimited_signals"}, {"score": 0.007357543681566558, "phrase": "hilbert"}, {"score": 0.007027438568196087, "phrase": "space_b"}, {"score": 0.004437613070853689, "phrase": "analytical_signal"}, {"score": 0.004195418010131832, "phrase": "bandlimited_signals"}, {"score": 0.004068907083697369, "phrase": "real_axis"}, {"score": 0.0036928221419965253, "phrase": "larger_signal_spaces"}, {"score": 0.0035269696779744266, "phrase": "common_integral_representation"}, {"score": 0.003120099687922751, "phrase": "bounded_operator"}, {"score": 0.002479150189700726, "phrase": "abstract_definition"}, {"score": 0.002392008392892289, "phrase": "general_bounded_signals"}, {"score": 0.0023435920614377306, "phrase": "constructive_procedure"}, {"score": 0.0022267859286766553, "phrase": "practically_important_special_case"}, {"score": 0.0021049977753042253, "phrase": "closed-form_expression"}], "paper_keywords": [""], "paper_abstract": "In this paper we analyze the Hilbert transform and existence of the analytical signal for the space B (pi) (a) of bandlimited signals that are bounded on the real axis. Originally, the theory was developed for signals in L (2)(a\"e) and then extended to larger signal spaces. While it is well known that the common integral representation of the Hilbert transform may diverge for some signals in B (pi) (a) and that the Hilbert transform is not a bounded operator on B (pi) (a) , it is nevertheless possible to define the Hilbert transform for the space B (pi) (a) . We use a definition that is based on the H (1)-BMO(a\"e) duality. This abstract definition, which can be used for general bounded signals, gives no constructive procedure to compute the Hilbert transform. However, for the practically important special case of bounded bandlimited signals, we can provide such an explicit procedure by giving a closed-form expression for the Hilbert transform. Further, it is shown that the Hilbert transform of a signal in B (pi) (a) is still bandlimited but not necessarily bounded. With these results we continue the work of [1, 2].", "paper_title": "On the hilbert transform of bounded bandlimited signals", "paper_id": "WOS:000310208200002"}