{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single_still_image"}, {"score": 0.004490842671590769, "phrase": "unstructured_environment"}, {"score": 0.004065156038847781, "phrase": "small_homogeneous_patch"}, {"score": 0.003906357144047631, "phrase": "markov_random_field"}, {"score": 0.003716520760680603, "phrase": "plane_parameters"}, {"score": 0.003483451334156705, "phrase": "mrf"}, {"score": 0.0034146585649631692, "phrase": "supervised_learning"}, {"score": 0.0032004205378150354, "phrase": "different_parts"}, {"score": 0.002925728709297618, "phrase": "small_planes"}, {"score": 0.0028536871476905847, "phrase": "explicit_assumptions"}, {"score": 0.0024693979425773993, "phrase": "image-based_rendering"}, {"score": 0.00239657981537094, "phrase": "significant_nonvertical_structure"}], "paper_keywords": ["Machine learning", " monocular vision", " learning depth", " vision and scene understanding", " scene analysis", " depth cues"], "paper_abstract": "We consider the problem of estimating detailed 3D structure from a single still image of an unstructured environment. Our goal is to create 3D models that are both quantitatively accurate as well as visually pleasing. For each small homogeneous patch in the image, we use a Markov Random Field (MRF) to infer a set of \"plane parameters\" that capture both the 3D location and 3D orientation of the patch. The MRF, trained via supervised learning, models both image depth cues as well as the relationships between different parts of the image. Other than assuming that the environment is made up of a number of small planes, our model makes no explicit assumptions about the structure of the scene; this enables the algorithm to capture much more detailed 3D structure than does prior art and also give a much richer experience in the 3D flythroughs created using image-based rendering, even for scenes with significant nonvertical structure. Using this approach, we have created qualitatively correct 3D models for 64.9 percent of 588 images downloaded from the Internet. We have also extended our model to produce large-scale 3D models from a few images.", "paper_title": "Make3D: Learning 3D Scene Structure from a Single Still Image", "paper_id": "WOS:000264144500005"}