{"auto_keywords": [{"score": 0.040784220002628414, "phrase": "test_sample"}, {"score": 0.021479595256619483, "phrase": "proposed_method"}, {"score": 0.008705162429000414, "phrase": "approximate_representation"}, {"score": 0.007152368807539886, "phrase": "bimodal_biometrics"}, {"score": 0.004767261858417823, "phrase": "palmprint_recognition_experiments"}, {"score": 0.004558414405811025, "phrase": "sparse_representation_method"}, {"score": 0.004358676214574977, "phrase": "feature_level_fusion"}, {"score": 0.0041469500929423595, "phrase": "real_vector"}, {"score": 0.0035183010916001664, "phrase": "weighted_sum"}, {"score": 0.0034938640424838257, "phrase": "conventional_appearance-based_methods"}, {"score": 0.003380791705551809, "phrase": "training_samples"}, {"score": 0.002955050521440921, "phrase": "proposed_approximate_representation"}, {"score": 0.00286795254228461, "phrase": "higher_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sparse representation", " Biometrics", " Bimodal biometrics", " Principal component analysis", " Linear discriminant analysis"], "paper_abstract": "In this paper, we propose a sparse representation method for bimodal biometrics. The proposed method first accomplishes the feature level fusion by combining the samples of the two biometric traits into a real vector in advance. This method then considers that an approximate representation of the test sample might be more useful for classification and uses the approximate representation to classify the test sample. The proposed method exploits a weighted sum of the neighbors from the set of training samples of the test sample to produce the approximate representation of the test sample and bases on this representation to perform classification. A variety of experiments demonstrate that the proposed approximate representation enables us to achieve a higher accuracy. The proposed method has the following reasonable assumption: the test sample is probably from one of the classes which the neighbors of the test sample are from. In this paper, we also formally show the difference between the proposed method and conventional appearance-based methods, and demonstrate that the proposed method is able to more accurately represent the test sample than conventional appearance-based methods. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A sparse representation method of bimodal biometrics and palmprint recognition experiments", "paper_id": "WOS:000313374500018"}