{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "active_site"}, {"score": 0.0043506951029334984, "phrase": "anti-inflammatory_complex"}, {"score": 0.003911135156992, "phrase": "novel_metallotherapeutic_molecules"}, {"score": 0.003551694229680741, "phrase": "silico_docking_experiments"}, {"score": 0.0032746712603464235, "phrase": "high_affinity"}, {"score": 0.0031926001871260524, "phrase": "docking_experiments"}, {"score": 0.0031603487697867538, "phrase": "molecular_dynamics"}, {"score": 0.003034558550137019, "phrase": "hydrogen_bonding"}, {"score": 0.002928594036918225, "phrase": "allosteric_site"}, {"score": 0.0023780209525032688, "phrase": "cu_complex"}, {"score": 0.002271725588755076, "phrase": "copper_complex"}, {"score": 0.002181227522730908, "phrase": "acid-base_reaction"}, {"score": 0.002148226022654619, "phrase": "lox_enzyme"}], "paper_keywords": [""], "paper_abstract": "H-1 NMR Saturation Transfer Difference (STD) experiments were applied to study the binding of aspirin and of an anti-inflammatory complex of Cu(I), namely [Cu(tpp)(pmt)](2) [pmt = 2-mercaptopyrimidine), synthesized in an attempt to develop novel metallotherapeutic molecules. While aspirin showed only very weak binding, the complex [Cu(tpp)(pmt)](2) clearly favored binding to LOX-1. In silico docking experiments in LOX-1 showed that aspirin does only weakly bind to LOX-1, while the complex binds with high affinity. In addition, docking experiments and molecular dynamics (MD) simulations showed that the complex binds via hydrogen bonding (HB), to an allosteric site of LOX-1, revealing that this enzyme has more than one accessible site for complex metallotherapeutic molecules. When aspirin was added in the solution containing LOX and the complex [Cu(tpp)(pmt)](2), the former was shown to hinder the binding of the Cu complex significantly. This may be interpreted as the copper complex aiding the transfer of aspirin through an acid-base reaction at the LOX enzyme which subsequently blocks its binding.", "paper_title": "Comparative Binding Effects of Aspirin and Anti-Inflammatory Cu Complex in the Active Site of LOX-1", "paper_id": "WOS:000312563800019"}