{"auto_keywords": [{"score": 0.04840510140756549, "phrase": "thematic_content"}, {"score": 0.02744628810612922, "phrase": "user_profiles"}, {"score": 0.013494326759030964, "phrase": "base_map"}, {"score": 0.008713768692145006, "phrase": "on-demand_base_maps"}, {"score": 0.006612669941785728, "phrase": "user_requirements"}, {"score": 0.0040300463421312225, "phrase": "topographic_databases"}, {"score": 0.0038737214010638745, "phrase": "automated_generalization"}, {"score": 0.0034674164050273568, "phrase": "web-based_architecture"}, {"score": 0.0032161835102640372, "phrase": "generalization_process"}, {"score": 0.0031782087629067686, "phrase": "base_maps"}, {"score": 0.00289007009553812, "phrase": "technological_environment"}, {"score": 0.0027778413437997613, "phrase": "user_profile"}, {"score": 0.0023150468182777813, "phrase": "new_techniques"}, {"score": 0.0021386451090091834, "phrase": "netherlands"}, {"score": 0.0021049977753042253, "phrase": "physical_planning_maps"}], "paper_keywords": ["automated generalization", " user profiles", " web mapping", " on-demand base maps"], "paper_abstract": "Thematic content in the form of geodata is becoming increasingly available on the web. However, adequate base map information to support appropriate communication of the thematic content is not available in many cases. This base map information might be served through topographic databases available on the web and optimized by means of automated generalization. This article describes an approach based on user profiles, which formally captures the user requirements (preferences) towards the base map and deploys those profiles in a web-based architecture to generate on-demand maps. Those user profiles, which may differ per user, drive the generalization process and produce base maps on demand by taking into account the user requirements as well as the thematic content. The research in this article specifically focuses on the technological environment that generates on-demand base maps incorporating four basic concepts in the user profile: (1) topology awareness between the base map and the thematic content, (2) user-specific base map information at a non-uniform scale to improve the communication of the thematic content, (3) the map specification and (4) inheritance of user profiles. Both existing and new techniques are explored to realize the environment. The approach is evaluated by applying it to a project in the Netherlands dedicated to disseminating physical planning maps through the web.", "paper_title": "On-demand base maps on the web generalized according to user profiles", "paper_id": "WOS:000300521200006"}