{"auto_keywords": [{"score": 0.0407769748728513, "phrase": "time_constraints"}, {"score": 0.022690903796468914, "phrase": "regression_testing"}, {"score": 0.02187235262894374, "phrase": "prioritization_techniques"}, {"score": 0.00481495049065317, "phrase": "test_case_prioritization"}, {"score": 0.004733791336312872, "phrase": "controlled_experiments"}, {"score": 0.004653993775422955, "phrase": "expensive_process"}, {"score": 0.004591120854640081, "phrase": "modified_software"}, {"score": 0.004407530256797396, "phrase": "test_cases"}, {"score": 0.004216880725292, "phrase": "testing_process"}, {"score": 0.003593623872399777, "phrase": "better_understanding"}, {"score": 0.003485196263406553, "phrase": "improved_prioritization_techniques"}, {"score": 0.0031360786664165093, "phrase": "time_constraint_levels"}, {"score": 0.003051790083321992, "phrase": "significant_role"}, {"score": 0.0029697601808164435, "phrase": "relative_cost-benefit_trade-offs"}, {"score": 0.0028801015154977885, "phrase": "first_experiment"}, {"score": 0.002681255756642227, "phrase": "wider_context"}, {"score": 0.002538996868327341, "phrase": "faultiness_levels"}, {"score": 0.002487612781045517, "phrase": "faultiness_level"}, {"score": 0.0024623110626032364, "phrase": "relative_cost-effectiveness"}, {"score": 0.00235560370536971, "phrase": "test_engineers"}, {"score": 0.0021338975690903014, "phrase": "testing_processes"}, {"score": 0.0021049977753042253, "phrase": "prioritization_cost-effectiveness"}], "paper_keywords": ["Regression testing", " test case prioritization", " cost-benefits", " Bayesian networks", " empirical studies"], "paper_abstract": "Regression testing is an expensive process used to validate modified software. Test case prioritization techniques improve the cost-effectiveness of regression testing by ordering test cases such that those that are more important are run earlier in the testing process. Many prioritization techniques have been proposed and evidence shows that they can be beneficial. It has been suggested, however, that the time constraints that can be imposed on regression testing by various software development processes can strongly affect the behavior of prioritization techniques. If this is correct, a better understanding of the effects of time constraints could lead to improved prioritization techniques and improved maintenance and testing processes. We therefore conducted a series of experiments to assess the effects of time constraints on the costs and benefits of prioritization techniques. Our first experiment manipulates time constraint levels and shows that time constraints do play a significant role in determining both the cost-effectiveness of prioritization and the relative cost-benefit trade-offs among techniques. Our second experiment replicates the first experiment, controlling for several threats to validity including numbers of faults present, and shows that the results generalize to this wider context. Our third experiment manipulates the number of faults present in programs to examine the effects of faultiness levels on prioritization and shows that faultiness level affects the relative cost-effectiveness of prioritization techniques. Taken together, these results have several implications for test engineers wishing to cost-effectively regression test their software systems. These include suggestions about when and when not to prioritize, what techniques to employ, and how differences in testing processes may relate to prioritization cost-effectiveness.", "paper_title": "The Effects of Time Constraints on Test Case Prioritization: A Series of Controlled Experiments", "paper_id": "WOS:000282135000002"}