{"auto_keywords": [{"score": 0.04065935824185746, "phrase": "new_technologies"}, {"score": 0.00481495049065317, "phrase": "transition_cards"}, {"score": 0.0046141941030386525, "phrase": "participatory_design"}, {"score": 0.0043656173407379895, "phrase": "future_users"}, {"score": 0.004310173770196077, "phrase": "design_process"}, {"score": 0.00397495478332679, "phrase": "design_activities"}, {"score": 0.0038253590626087237, "phrase": "well-researched_field"}, {"score": 0.0037446875860947916, "phrase": "user_participation"}, {"score": 0.0035731269727067496, "phrase": "card-based_method"}, {"score": 0.003423969509052361, "phrase": "young_patients"}, {"score": 0.003239304090565123, "phrase": "adult_healthcare"}, {"score": 0.002936577024096783, "phrase": "participating_young_patients"}, {"score": 0.002372298201966367, "phrase": "participatory_design_processes"}, {"score": 0.0021504218042734677, "phrase": "mutual_learning"}, {"score": 0.0021049977753042253, "phrase": "better_methods"}], "paper_keywords": ["Participatory Design", " young patients", " transition", " card sorting", " appropriation", " cool"], "paper_abstract": "Participatory Design (PD) is a methodology concerned with bringing the voices of future users into the design process, as well as with the design of tools and methods that enable the participants to engage in design activities. While user participation in design of new technologies is a well-researched field, this paper presents user participation in the design, implementation, and appropriation of a card-based method. The purpose of the method was to support young patients in organizing and explaining their experiences and expectations surrounding their transition from pediatrics to adult healthcare. Application of PD and the concept of cool in the process of designing the method resulted in a method that the participating young patients could redesign and appropriate to better fit their particular situation. Hence, the paper argues in favor of not only including users in the design of new technologies, but also in the design of methods. Our results indicate that user participation in the design of methods, for use in Participatory Design processes, enable the appropriation of the methods, rather than mastery of the methods. This appropriation may increase the space for mutual learning and may result in better methods and participant-empowerment.", "paper_title": "TRANSITION CARDS: DESIGNING A METHOD WITH AND FOR YOUNG PATIENTS", "paper_id": "WOS:000366817800007"}