{"auto_keywords": [{"score": 0.04959913342990779, "phrase": "elliptic_curve_cryptosystem"}, {"score": 0.049124089120586564, "phrase": "global_mobility_networks"}, {"score": 0.03708984644671889, "phrase": "mutual_authentication"}, {"score": 0.00481495049065317, "phrase": "key_agreement_scheme"}, {"score": 0.0045324756541157574, "phrase": "rhee_et_al"}, {"score": 0.004309725894724034, "phrase": "smart_cards"}, {"score": 0.004056769841308405, "phrase": "user_impersonation_attack"}, {"score": 0.003995876175614403, "phrase": "security_flaw"}, {"score": 0.003916098498242888, "phrase": "mathematical_homomorphism"}, {"score": 0.0038573081851680656, "phrase": "registration_information"}, {"score": 0.0037235274565193665, "phrase": "key_agreement_procedures"}, {"score": 0.003558294449586273, "phrase": "communication_messages"}, {"score": 0.0028070431733705735, "phrase": "portable_devices"}, {"score": 0.0024617483174454113, "phrase": "proposed_scheme"}, {"score": 0.0023170054862555896, "phrase": "key_agreement"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "In this paper, we cryptanalyze Rhee et al.'s 'Remote user authentication scheme without using smart cards', and prove that their scheme is not completely secure against user impersonation attack. The security flaw is caused by mathematical homomorphism of the registration information. In addition, their scheme lacks key agreement procedures for generating the session key to encrypt the communication messages after mutual authentication. Furthermore, a modification is proposed to improve the security, practicability and robustness of such scheme. Firstly, we introduce elliptic curve cryptosystem to enhance the security. Secondly, in order to improve the practicability, our improvement is much more easily implemented using portable devices in global mobility networks; moreover, a synchronized clock system, traditional password table or ancillary equipment are not required in our improvement. Finally, the proposed scheme not only achieves mutual authentication, but also provides the procedure for key agreement and update of secrets for users and servers to increase the robustness. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "An improved authentication with key agreement scheme on elliptic curve cryptosystem for global mobility networks", "paper_id": "WOS:000324330900001"}