{"auto_keywords": [{"score": 0.03410735276717894, "phrase": "finger_cover"}, {"score": 0.007685718254226004, "phrase": "braille_learners"}, {"score": 0.007287220658945803, "phrase": "japan"}, {"score": 0.005483024763190176, "phrase": "base_material"}, {"score": 0.005052044296658976, "phrase": "braille"}, {"score": 0.00481495049065317, "phrase": "assistance_tool"}, {"score": 0.0047468516620285525, "phrase": "transparent_resinous_ultraviolet-curing_type"}, {"score": 0.004389089062127892, "phrase": "visual_characters"}, {"score": 0.004319287061762222, "phrase": "truct_braille"}, {"score": 0.0042809854543795255, "phrase": "screen_printing"}, {"score": 0.003986509098918949, "phrase": "truct_braille_signs"}, {"score": 0.00388828234270598, "phrase": "public_facilities"}, {"score": 0.003819599991449801, "phrase": "tactile_maps"}, {"score": 0.0036727235025069828, "phrase": "braille_beginners"}, {"score": 0.002912803994461996, "phrase": "acquired_visual_impairment"}, {"score": 0.002516350372379076, "phrase": "dot_height"}, {"score": 0.002309754152767196, "phrase": "braille_reading_assistance_tool"}, {"score": 0.0021049977753042253, "phrase": "practical_use"}], "paper_keywords": ["TRUCT Braille", " finger cover", " polyester non-woven fabric", " Braille learner", " Braille reading assistance tool"], "paper_abstract": "Transparent resinous ultraviolet-curing type (TRUCT) Braille signs are becoming more and more popular in Japan, especially when they are printed together with visual characters. These signs are made by screen printing, a technique that can be applied to various base materials, such as paper, metal, and plastic. TRUCT Braille signs have begun to be used in public facilities, such as on tactile maps and on handrails. Naturally, it is expected that Braille beginners will utilize these signs. However, it has been pointed out that the friction between the forefinger and the base material may affect reading accuracy and speed. In this study, we developed a finger cover made of soft, thin polyester non-woven fabric to reduce friction during Braille reading. We also carried out a study to investigate the effect of its use. The subjects were 12 Braille learners with acquired visual impairment, who were asked to read randomly selected characters with and without the finger cover. The results showed that most participants could read TRUCT Braille significantly faster and more accurately with a finger cover than without it, regardless of the base material and dot height. This result suggests that wearing the finger cover enables Braille learners to read TRUCT Braille more efficiently. The finger cover can be used as a Braille reading assistance tool for Braille learners. An additional, health-related advantage of the finger cover is that the forefinger remains clean. We expect that the finger cover will be in practical use in Japan within 1 or 2 years.", "paper_title": "Polyester non-woven fabric finger cover as a TRUCT Braille reading assistance tool for Braille learners", "paper_id": "WOS:000251097800020"}