{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "workflow_mining"}, {"score": 0.014685280182214622, "phrase": "workflow_discovery"}, {"score": 0.010292918781493724, "phrase": "workflow_management_systems"}, {"score": 0.009212635493330202, "phrase": "workflow_event_log"}, {"score": 0.004705206179790976, "phrase": "business_process_management"}, {"score": 0.004580314008293946, "phrase": "work_transactions"}, {"score": 0.004441616106463486, "phrase": "useful_artifact"}, {"score": 0.0041287394089001405, "phrase": "control_flow"}, {"score": 0.003912335018240945, "phrase": "workflow_model"}, {"score": 0.0035536228914319354, "phrase": "precedence_relations"}, {"score": 0.003445906915464945, "phrase": "hidden_assumption"}, {"score": 0.0031906408161077766, "phrase": "position_paper"}, {"score": 0.0029885438439583075, "phrase": "precedence_rediscovery"}, {"score": 0.0028979065012624044, "phrase": "even_activities"}, {"score": 0.0027777389949155975, "phrase": "wholistic_perspective"}, {"score": 0.0027143009946473937, "phrase": "people_systems"}, {"score": 0.0023903596069939953, "phrase": "behavioral_perspective"}, {"score": 0.002221655243524476, "phrase": "general_framework"}, {"score": 0.0021049977753042253, "phrase": "multidimensional_perspective"}], "paper_keywords": [""], "paper_abstract": "In the domain of Business Process Management and Workflow Management Systems, the log of work transactions executed has been found to be a useful artifact. The ideas, work, and literature on workflow mining have been primarily concerned with examining the workflow event log to rediscover control flow. Workflow mining has generally been defined as \"the process of extracting a workflow model from a log of executions of activities\". In fact, most of the literature specifically and narrowly is concerned with rediscovering the precedence relations amongst activities. It is generally a hidden assumption that all activities are known a priori because they are listed by label in the workflow event log. In this position paper, we explore the possibility of removing this assumption, and thus performing workflow discovery rather than precedence rediscovery. Workflow discovery does not assume that process structure or even activities are known a priori and is concerned with discovering a wholistic perspective of workflow. Workflow management systems are people systems that must be designed, deployed, and understood within their social and organizational contexts. Thus, we argue in this document that there is a need to expand the concept of workflow mining beyond the behavioral perspective to encompass the social, organizational, and activity assignment perspectives; as well as other perspectives. To this end, we introduce a general framework and meta-model for workflow discovery, and show one approach to workflow discovery in a multidimensional perspective.", "paper_title": "Beyond workflow mining", "paper_id": "WOS:000241137100005"}