{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_services"}, {"score": 0.004447766706144458, "phrase": "diverse_services"}, {"score": 0.004360412703519539, "phrase": "heterogeneous_platforms"}, {"score": 0.004163172790791119, "phrase": "integrated_and_seamless_manner"}, {"score": 0.0039748192550806815, "phrase": "large_numbers"}, {"score": 0.0035519826240477444, "phrase": "different_workflows"}, {"score": 0.0035052810710060893, "phrase": "operational_support_systems"}, {"score": 0.003091036449708673, "phrase": "new_framework"}, {"score": 0.002798780784517325, "phrase": "multi-agent_e-service_system"}, {"score": 0.0025678829712650437, "phrase": "customer-centric_viewpoint"}, {"score": 0.002175913488493802, "phrase": "model's_feasibility"}], "paper_keywords": ["Intelligent multi-agent method", " e-Services", " Telecommunication services", " Operation support systems", " Agility"], "paper_abstract": "The online services of B2B e-commerce have had to face a challenge resulting from the diverse services built on heterogeneous platforms that must work together in an integrated and seamless manner. Today, businesses have accumulated large numbers of online services that run and reside on a variety of environments. Furthermore, they have different workflows and operational support systems that need to interact with their legacy systems. The result has been chaotic and disruptive. We developed a new framework, artifact, and performance model with which to address this problem. A multi-agent e-service system was developed to cope with dynamics and upheaval. We used a customer-centric viewpoint with supply chains both upstream and downstream. An implementation was performed to determine problems in its development. Two simple live case studies were conducted to illustrate the model's feasibility and validity. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An intelligent multi-agent e-services method-An international telecommunication example", "paper_id": "WOS:000269717900004"}