{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "braid_groups"}, {"score": 0.020923669426273262, "phrase": "affine_braid_groups"}, {"score": 0.004581505405526037, "phrase": "infinite_non-commutative_groups"}, {"score": 0.004278807087784626, "phrase": "experimental_and_theoretical_evidence"}, {"score": 0.0038737214010638745, "phrase": "good_choice"}, {"score": 0.0030017207229983385, "phrase": "cryptographic_purposes"}, {"score": 0.0028382152567141784, "phrase": "essential_differences"}, {"score": 0.0026175952455594277, "phrase": "garside_structure"}, {"score": 0.0025373711401047772, "phrase": "conjugacy_problem"}, {"score": 0.002131383155056741, "phrase": "promising_alternative_platform"}, {"score": 0.0021049977753042253, "phrase": "group-based_cryptography"}], "paper_keywords": ["Affine braid group", " Braid group", " Conjugacy problem", " Normal form", " Public key cryptosystem", " Word problem"], "paper_abstract": "In recent years, various cryptographic protocols using infinite non-commutative groups, notably braid groups, have been proposed. Both experimental and theoretical evidence collected so far, however, makes it appear likely that braid groups are not a good choice for the platform. In this paper, we thus consider to use affine braid groups, a natural generalization of braid groups, as a platform. Like braid groups, affine braid groups have a very nice geometrical interpretation and have several properties that make them acceptable for cryptographic purposes. On the other hand, there are also essential differences between their structures; for example, unlike braid groups, affine braid groups have no Garside structure, which makes the conjugacy problem in these groups more difficult. We examine the feature that makes affine braid groups useful to cryptography and then conclude that this class of groups could provide a promising alternative platform for group-based cryptography.", "paper_title": "Affine braid groups: a better platform than braid groups for cryptology?", "paper_id": "WOS:000297864100005"}