{"auto_keywords": [{"score": 0.04298722796533143, "phrase": "user_query"}, {"score": 0.00481495049065317, "phrase": "dblp_dataset"}, {"score": 0.004695303774351139, "phrase": "information_retrieval_task"}, {"score": 0.0044275118637330975, "phrase": "specific_topic"}, {"score": 0.00422781730455246, "phrase": "people's_activities"}, {"score": 0.003727628340195049, "phrase": "recent_interest"}, {"score": 0.003485437176235259, "phrase": "principled_approaches"}, {"score": 0.003427380591229386, "phrase": "different_sources"}, {"score": 0.003286420941205958, "phrase": "multiple_estimators"}, {"score": 0.0031645050772280033, "phrase": "textual_contents"}, {"score": 0.0030857431184193765, "phrase": "citation_patterns"}, {"score": 0.0029837589912490026, "phrase": "profile_information"}, {"score": 0.002813307389456184, "phrase": "supervised_learning"}, {"score": 0.0021861845339709533, "phrase": "academic_publications"}, {"score": 0.0021049977753042253, "phrase": "proposed_approaches"}], "paper_keywords": ["Learning to Rank", " Rank Aggregation", " Expert Finding", " Information Retrieval", " Data Fusion"], "paper_abstract": "Expert finding is an information retrieval task that is concerned with the search for the most knowledgeable people with respect to a specific topic, and the search is based on documents that describe people's activities. The task involves taking a user query as input and returning a list of people who are sorted by their level of expertise with respect to the user query. Despite recent interest in the area, the current state-of-the-art techniques lack in principled approaches for optimally combining different sources of evidence. This article proposes two frameworks for combining multiple estimators of expertise. These estimators are derived from textual contents, from graph-structure of the citation patterns for the community of experts and from profile information about the experts. More specifically, this article explores the use of supervised learning to rank methods, as well as rank aggregation approaches, for combining all of the estimators of expertise. Several supervised learning algorithms, which are representative of the pointwise, pairwise and listwise approaches, were tested, and various state-of-the-art data fusion techniques were also explored for the rank aggregation framework. Experiments that were performed on a dataset of academic publications from the Computer Science domain attest the adequacy of the proposed approaches.", "paper_title": "Learning to rank academic experts in the DBLP dataset", "paper_id": "WOS:000360070500001"}