{"auto_keywords": [{"score": 0.048923016754706936, "phrase": "good_cover"}, {"score": 0.02322730111336097, "phrase": "good_covers"}, {"score": 0.01698645464988059, "phrase": "simplicial_complex"}, {"score": 0.00895112315171967, "phrase": "intersection_patterns"}, {"score": 0.0062707924346571, "phrase": "topologically_d-representable"}, {"score": 0.004540591176992658, "phrase": "open_contractible_sets"}, {"score": 0.004097389262726735, "phrase": "convex_sets"}, {"score": 0.003661275004971829, "phrase": "intersection_pattern"}, {"score": 0.0027969169552385974, "phrase": "fixed_d"}, {"score": 0.0026115277372906805, "phrase": "acyclic_covers"}, {"score": 0.002548331088496964, "phrase": "open_d-balls"}, {"score": 0.002498873893632724, "phrase": "auxiliary_result"}, {"score": 0.002157223877108711, "phrase": "\"sufficiently_fine\"_subdivision"}, {"score": 0.002125735077004312, "phrase": "k-dimensional_complex"}], "paper_keywords": ["good cover", " algorithmic undecidability", " intersection pattern", " nerve", " piecewise-linear embedding"], "paper_abstract": "A good cover in R-d is a collection of open contractible sets in R-d such that the intersection of any subcollection is either contractible or empty. Motivated by an analogy with convex sets, intersection patterns of good covers were studied intensively. Our main result is that intersection patterns of good covers are algorithmically unrecognizable. More precisely, the intersection pattern of a good cover can be stored in a simplicial complex called a nerve which records which subfamilies of the good cover intersect. A simplicial complex is topologically d-representable if it is isomorphic to the nerve of a good cover in R-d. We prove that it is undecidable whether a given simplicial complex is topologically d-representable for any fixed d >= 5. The result remains valid if we replace good covers with acyclic covers or with covers by open d-balls. As an auxiliary result we prove that if a simplicial complex is piecewise-linearly embeddable into R-d, then it is topologically d-representable. We also supply this result with showing that if a \"sufficiently fine\" subdivision of a k-dimensional complex is d-representable and k <= 2d-3/3, then the complex is piecewise-linearly embeddable into R-d.", "paper_title": "NERVES OF GOOD COVERS ARE ALGORITHMICALLY UNRECOGNIZABLE", "paper_id": "WOS:000323889100011"}