{"auto_keywords": [{"score": 0.048027271228811924, "phrase": "mobile_technology"}, {"score": 0.010612387000973441, "phrase": "mobile_work"}, {"score": 0.005636830362187417, "phrase": "activity_theory"}, {"score": 0.0054251842251734125, "phrase": "mobile_technology-mediated_work"}, {"score": 0.00465944657565638, "phrase": "activity_systems"}, {"score": 0.003953806321226277, "phrase": "new_challenges"}, {"score": 0.0038893838564184107, "phrase": "information_systems"}, {"score": 0.0036419834462626125, "phrase": "inherently_mobile_and_information-intensive_work_activity"}, {"score": 0.002861708609922034, "phrase": "dialectic_interaction"}, {"score": 0.002664850766529523, "phrase": "mobile_work_activity"}, {"score": 0.0024011766029754006, "phrase": "traditional_use"}, {"score": 0.0022980978400845144, "phrase": "analytical_lens"}], "paper_keywords": ["mobile IS", " mobile", " activity theory", " organisation change"], "paper_abstract": "Mobile technology and the information and communication services supported by it have become increasingly embedded in, and in some cases transformed, work and social activity and created new challenges for studying information systems. This paper focuses on the experience with mobile technology in an inherently mobile and information-intensive work activity policing. Drawing upon data from this context this paper makes two key sets of contributions. Empirically, we illuminate the congruencies and contradictions between mobile technology and mobile working, and the relationship between the two, revealing a state of change based upon dialectic interaction. We highlight several ways in which mobile technology has changed the nature of mobile work activity. Theoretically we advance the use of activity theory to better understand the changes of mobile technology-mediated work. We extend traditional use of activity theory by adopting congruencies as an analytical lens, in addition to the approach of examining contradictions. The findings are applicable to other areas of mobile work and contribute to the body of knowledge concerning mobile technology-mediated work.", "paper_title": "Mobile technology in mobile work: contradictions and congruencies in activity systems", "paper_id": "WOS:000341070600003"}