{"auto_keywords": [{"score": 0.0338590543999653, "phrase": "path_diversity"}, {"score": 0.007934369568769683, "phrase": "overlay_networks"}, {"score": 0.007104166167987608, "phrase": "redundant_paths"}, {"score": 0.00481495049065317, "phrase": "internet_path_diversity"}, {"score": 0.00454772672262359, "phrase": "redundant_communication_paths"}, {"score": 0.004517275498868226, "phrase": "end_points"}, {"score": 0.004487028255031471, "phrase": "multihoming"}, {"score": 0.004427134352966977, "phrase": "intelligent_route_control"}, {"score": 0.004209539728590977, "phrase": "redundant_connections"}, {"score": 0.004139401327448803, "phrase": "increased_reliability"}, {"score": 0.003949144559926685, "phrase": "natural_diversity"}, {"score": 0.0038443635340052523, "phrase": "physical_links"}, {"score": 0.003780286517897356, "phrase": "administrative_control"}, {"score": 0.003510754567808717, "phrase": "completely_disjoint_paths"}, {"score": 0.0034290777464571864, "phrase": "single_shared_link"}, {"score": 0.0033492947290751996, "phrase": "end-to-end_performance"}, {"score": 0.003227643104496149, "phrase": "experimental_study"}, {"score": 0.0029672941061574375, "phrase": "table_data"}, {"score": 0.0028023242231187363, "phrase": "routeviews_servers"}, {"score": 0.0025935941070969575, "phrase": "multihoming_and_overlay_networks"}, {"score": 0.0023762535034673017, "phrase": "multihoming_route_control"}, {"score": 0.0023603078194781965, "phrase": "current_overlay_networks"}, {"score": 0.0022440691950725614, "phrase": "high-availability_services"}, {"score": 0.0021049977753042253, "phrase": "future_systems"}], "paper_keywords": ["network topology", " reliability", " Internet measurements", " multihoming and overlay networks"], "paper_abstract": "Several research studies have been devoted to improving the reliability and performance of the Internet by utilizing redundant communication paths between end points. Multihoming, coupled with intelligent route control, and overlay networks are two main streams in this area of research which attempt to leverage redundant connections of the Internet for increased reliability and performance. However, the effectiveness of these approaches depends on the natural diversity of redundant paths between two endhosts in terms of physical links, routing infrastructure, administrative control, and geographical distribution. Even in the case of redundant paths, if traffic between two hosts is not actually routed along completely disjoint paths, congestion or failure of a single shared link or router can adversely affect the end-to-end performance or availability of all paths. This paper presents an experimental study of path diversity on the Internet, focusing on the impact of path diversity on multihomed and overlay networks. We base our analysis on traceroutes and routing table data collected from several vantage points in the Internet including: looking glasses at 10 major Internet Service Providers (ISPs), RouteViews servers from 20 ISPs, and more than 50 PlanetLab nodes globally distributed across the Internet. Using this data, we quantify the extent of path diversity in multihoming and overlay networks, highlighting the limitations, and also identifying the source of the limitations in these architectures. From the analysis, we learn that both multihoming route control and current overlay networks are not able to ensure path diversity, which makes it very difficult to provide high-availability services even with the use of these systems. We believe that this work provides the insight into building future systems based on understanding path diversity.", "paper_title": "An experimental study of Internet path diversity", "paper_id": "WOS:000241721300001"}