{"auto_keywords": [{"score": 0.03447310109738999, "phrase": "competitive_ratio"}, {"score": 0.015719716506582538, "phrase": "hard_real-time_guarantees"}, {"score": 0.011044990699785968, "phrase": "single_processor"}, {"score": 0.010616104262621221, "phrase": "online_algorithm"}, {"score": 0.0047262415242538105, "phrase": "online_dynamic_power_management"}, {"score": 0.004663875663629251, "phrase": "multi-processor_systems"}, {"score": 0.004481650497729742, "phrase": "arrival_time"}, {"score": 0.004295083912947681, "phrase": "online_fashion"}, {"score": 0.004204721229305113, "phrase": "non-migrative_preemptive_schedule"}, {"score": 0.0039976255140341446, "phrase": "total_energy_consumption"}, {"score": 0.003661793580361212, "phrase": "online_strategies"}, {"score": 0.00362304576537247, "phrase": "practical_energy-efficient_solutions"}, {"score": 0.0036038253289170288, "phrase": "real-time_multi-processor_systems"}, {"score": 0.003063979184187375, "phrase": "unit_execution_times"}, {"score": 0.0029051619541187595, "phrase": "multiple_streams"}, {"score": 0.002625676655887138, "phrase": "k_given_job_streams"}, {"score": 0.0025431173776207885, "phrase": "scheduling_strategy"}, {"score": 0.0025161771071797274, "phrase": "energy_usage"}, {"score": 0.0023604100222616668, "phrase": "k_streams"}, {"score": 0.002341628146530332, "phrase": "separate_processor"}, {"score": 0.002280092127862092, "phrase": "input_set"}, {"score": 0.002161818518113509, "phrase": "unit_job_execution_times"}], "paper_keywords": ["Online energy-efficient scheduling", " Dynamic power management"], "paper_abstract": "We consider the problem of online dynamic power management that provides hard real-time guarantees for multi-processor systems. In this problem, a set of jobs, each associated with an arrival time, a deadline, and an execution time, arrives to the system in an online fashion. The objective is to compute a non-migrative preemptive schedule of the jobs and a sequence of power on/off operations of the processors so as to minimize the total energy consumption while ensuring that all the deadlines of the jobs are met. We assume that we can use as many processors as necessary. In this paper we examine the complexity of this problem and provide online strategies that lead to practical energy-efficient solutions for real-time multi-processor systems. First, we consider the case for which we know in advance that the set of jobs can be scheduled feasibly on a single processor. We show that, even in this case, the competitive ratio of any online algorithm is at least 2.06. On the other hand, we give a 4-competitive online algorithm that uses at most two processors. For jobs with unit execution times, the competitive ratio of this algorithm improves to 3.59. Second, we relax our assumption by considering as input multiple streams of jobs, each of which can be scheduled feasibly on a single processor. We present a trade-off between the energy-efficiency of the schedule and the number of processors to be used. More specifically, for k given job streams and h processors with h > k, we give a scheduling strategy such that the energy usage is at most 4. inverted right perpendicular k/h-k inverted left perpendicular times that used by any schedule which schedules each of the k streams on a separate processor. Finally, we drop the assumptions on the input set of jobs. We show that the competitive ratio of any online algorithm is at least 2.28, even for the case of unit job execution times for which we further derive an O(1)-competitive algorithm. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Online dynamic power management with hard real-time guarantees", "paper_id": "WOS:000358460200004"}