{"auto_keywords": [{"score": 0.04358406117033228, "phrase": "security_services"}, {"score": 0.0045877173513910055, "phrase": "big_distributed_infrastructures"}, {"score": 0.004507760907425495, "phrase": "internet_scale"}, {"score": 0.004429191773525288, "phrase": "research_community"}, {"score": 0.004056334733843591, "phrase": "reputation_systems"}, {"score": 0.003968112038249246, "phrase": "secure_routing"}, {"score": 0.0038818006513785977, "phrase": "proper_management"}, {"score": 0.00376409764683147, "phrase": "important_prerequisite"}, {"score": 0.0033131804981786747, "phrase": "secure_way"}, {"score": 0.002941913249957503, "phrase": "users'_anonymity"}, {"score": 0.002753891109273246, "phrase": "real-world_digital_certificates"}, {"score": 0.002555247330102505, "phrase": "internal_certificate"}, {"score": 0.0024236964502593254, "phrase": "sybil_attacks"}, {"score": 0.0024024377855956136, "phrase": "eclipse_attacks"}, {"score": 0.0023090525096074264, "phrase": "detailed_protocol_description"}, {"score": 0.0022290883852844057, "phrase": "security_analysis"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["P2P overlay", " DHT", " Sybil attack", " eclipse attack", " identity assignment"], "paper_abstract": "Peer-to-peer (P2P) overlay networks have been proposed to solve routing problems of big distributed infrastructures, even for Internet scale. But the research community has been questioning the security of these networks for years. Most prior work in security services was focused on trust and reputation systems, anonymity, and secure routing. However, the proper management of identities in overlays is an important prerequisite to provide most of these security services. In this paper, we propose a protocol to control the access to a P2P overlay and to assign identities in a secure way; all this preserving the anonymity of users. This protocol involves two trusted third parties (TTPs), thanks to which it is possible to preserve the users' anonymity within the network without losing traceability. Users are authenticated by a TTP using real-world digital certificates, they select their network identifier jointly with the other TTP, and finally, the two TTPs issue the internal certificate to them. The protocol also provides revocability and protection against Sybil attacks, Eclipse attacks, whitewashers, and so on. A detailed protocol description is presented, and a performance and security analysis of the protocol is also provided. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "RIAPPA: a Robust Identity Assignment Protocol for P2P overlays", "paper_id": "WOS:000345633500042"}