{"auto_keywords": [{"score": 0.04363401610716803, "phrase": "computerized_strategies"}, {"score": 0.00481495049065317, "phrase": "effective_computerized_strategies"}, {"score": 0.004766877640444116, "phrase": "drug-drug_interactions"}, {"score": 0.004443482801729777, "phrase": "important_and_preventable_cause"}, {"score": 0.004340614094598847, "phrase": "recent_developments"}, {"score": 0.004268591456106124, "phrase": "new_strategies"}, {"score": 0.0035746075891407224, "phrase": "eight_drug_safety_experts"}, {"score": 0.0034917831997090328, "phrase": "semi-structured_interviews"}, {"score": 0.003343007152920687, "phrase": "potential_computerized_strategies"}, {"score": 0.0032328778271536454, "phrase": "complete_confidence"}, {"score": 0.0032005497177523025, "phrase": "dangerous_ddis"}, {"score": 0.003168543855125077, "phrase": "junior_prescribers"}, {"score": 0.003115908199991072, "phrase": "senior_prescribers"}, {"score": 0.00306414423737093, "phrase": "computerized_alerts"}, {"score": 0.0027341763737751467, "phrase": "appropriate_strategy"}, {"score": 0.0025740882809779913, "phrase": "large_number"}, {"score": 0.002522830979240594, "phrase": "alert_implementation"}, {"score": 0.0022061853706148945, "phrase": "ddi_strategy_design"}, {"score": 0.002184101477091303, "phrase": "greater_use"}, {"score": 0.0021477840826122853, "phrase": "adopted_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Drug-drug interaction", " Alerts", " Alert fatigue", " Interviews"], "paper_abstract": "Background: Drug-drug interactions (DDIs) are an important and preventable cause of medication errors in hospitals. Recent developments in technology have seen new strategies emerge for preventing DDIs but these computerized strategies are rarely evaluated and are typically implemented with little input from the individuals using them. Aim: To determine the opinions of both experts and users (prescribers) on computerized strategies available to assist in the identification and prevention of DDIs in hospitals. Method: Eight drug safety experts and 18 prescribers took part in semi-structured interviews. Participants were asked about their confidence in identifying DDIs and their views on potential computerized strategies to prevent DDIs. Results: No prescribers reported complete confidence in identifying dangerous DDIs, with junior prescribers appearing less confident than senior prescribers. Most prescribers believed that computerized alerts would be the most effective strategy for preventing DDIs, while experts were more critical of alerts. Conclusion: The lack of confidence displayed by prescribers in their ability to identify DDIs suggests that an appropriate strategy would be one that does not rely on individuals seeking out the information themselves. While a large number of problems related to DDI alert implementation have been reported in the literature (e.g. alert overload), prescribers appeared to be receptive to the idea of being alerted. By ensuring users are aware of the limitations of the system and involving them in DDI strategy design we expect greater use and satisfaction with the adopted strategy. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Identifying effective computerized strategies to prevent drug-drug interactions in hospital: A user-centered approach", "paper_id": "WOS:000355796900006"}