{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "external_web_content"}, {"score": 0.020833451230928543, "phrase": "firm_performance"}, {"score": 0.010787515453105814, "phrase": "e-_transaction"}, {"score": 0.00481495049065317, "phrase": "external_web"}, {"score": 0.004695900553353526, "phrase": "organizational_performance"}, {"score": 0.004522796947899013, "phrase": "tremendous_growth"}, {"score": 0.004429388453288922, "phrase": "information_systems"}, {"score": 0.004301834610818624, "phrase": "recent_literature"}, {"score": 0.003940706575253453, "phrase": "external_web_site"}, {"score": 0.0036248955128033084, "phrase": "business_web_sites"}, {"score": 0.003334309053314909, "phrase": "e-_communication"}, {"score": 0.0028327783069076883, "phrase": "positive_relationship"}, {"score": 0.0026384167183586015, "phrase": "web_orientations"}, {"score": 0.002594652434287807, "phrase": "existing_e-_information"}, {"score": 0.002436888552432559, "phrase": "e-_information"}, {"score": 0.002149494537191303, "phrase": "business_size"}, {"score": 0.0021049977753042253, "phrase": "business_industry"}], "paper_keywords": ["web sites", " web content", " web development", " e-business", " firm performance"], "paper_abstract": "Research into the Internet has experienced a tremendous growth within the field of information systems. In this sense, the recent literature focuses on more complex research topics. However, there is a need to further investigate into the more basic and primary use of Internet, the external Web site to interact with stakeholders. By external, we mean publicly accessible contents. This paper develops a framework that allows evaluation of external Web content of business Web sites and examines the influence on firm performance. Here, external Web content is studied according to three Web orientations: e- information, e- communication, and e- transaction. In addition, differences in external Web content are analysed according to two contingency factors: business size and business industry. To achieve these goals, a sample comprising 288 Spanish SMEs firms was employed. The results show a positive relationship between external Web content and firm performance. Furthermore, this research indicates the existence of complementarities among the Web orientations. Thus, existing e- information was found as critical for enabling e- transaction to impact upon firm performance. Additionally, e- information and e- communication ( jointly considered) were found to mutually reinforce the impact of e- transaction on firm performance. The results also confirm that external Web content is not related to business size and differs slightly by business industry.", "paper_title": "External Web content and its influence on organizational performance", "paper_id": "WOS:000245650500007"}