{"auto_keywords": [{"score": 0.0370524624129902, "phrase": "haldane_effect"}, {"score": 0.004548253531664032, "phrase": "cardiac_output"}, {"score": 0.004175533280178052, "phrase": "non-invasive_cardiac_output_estimation"}, {"score": 0.004136044939878838, "phrase": "ficks"}, {"score": 0.0036207206487324506, "phrase": "lung_capillaries"}, {"score": 0.0031693980719538287, "phrase": "current_literature"}, {"score": 0.0031393948330209224, "phrase": "cardiac_output_estimation"}, {"score": 0.002909342017421165, "phrase": "compartmental_tidal_breathing_lung_model"}, {"score": 0.002854505078275351, "phrase": "physiological_mechanisms"}, {"score": 0.0027610089418453614, "phrase": "model_simulations"}, {"score": 0.002708960273193547, "phrase": "previous_studies"}, {"score": 0.002632716358833918, "phrase": "arterial_differences"}, {"score": 0.002337403139264533, "phrase": "end-tidal_measurements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Rebreathing", " Tidal breathing model", " Carbon dioxide", " Bohr&Haldane", " End-tidal CO2"], "paper_abstract": "Thermodilution is the current standard for determination of cardiac output. The method is invasive and constitutes a risk for the patient. As an alternative CO2 rebreathing allows non-invasive cardiac output estimation using Ficks principle. The method relies on estimation of arterial CO2 partial pressure from end-tidal CO2 pressure and estimation of mixed venous CO2 partial pressure from end-tidal CO2 during rebreathing. Presumably the oxygenation of blood in the lung capillaries increases lung capillary CO2 pressure due to the Haldane effect, which during rebreathing may result in overestimation of the mixed venous CO2 pressure. However, the Haldane effect is not discussed in the current literature describing cardiac output estimation using CO2 rebreathing. The purpose of this study is to construct and verify a compartmental tidal breathing lung model to investigate the physiological mechanisms that influence the CO2 rebreathing technique. The model simulations show agreement with previous studies describing end-tidal to arterial differences in CO2 pressure and rebreathing with high and low O-2 fractions in the rebreathing bag. In conclusion the simulations show that caution has to be taken when using end-tidal measurements to estimate CO2 pressures, especially during rebreathing where the Haldane effect causes mixed venous CO2 partial pressure to be substantially overestimated. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Tidal breathing model describing end-tidal, alveolar, arterial and mixed venous CO2 and O-2", "paper_id": "WOS:000288642700008"}