{"auto_keywords": [{"score": 0.026708578185615145, "phrase": "arxiv_versions"}, {"score": 0.011603281348989915, "phrase": "arxiv_submission"}, {"score": 0.011496795583877227, "phrase": "journal_publication"}, {"score": 0.010483678433575765, "phrase": "wos_papers"}, {"score": 0.0037820003983334476, "phrase": "arxiv_papers"}, {"score": 0.003695164023476307, "phrase": "wos"}, {"score": 0.003414467360488913, "phrase": "aging_characteristics"}, {"score": 0.0033828748627992193, "phrase": "scientific_impact"}, {"score": 0.0033515736929172644, "phrase": "arxiv_e-prints"}, {"score": 0.002874870266177579, "phrase": "elapsed_time"}, {"score": 0.002267708463966758, "phrase": "lower_citation_rates"}, {"score": 0.0021848422732893926, "phrase": "almost_no_difference"}, {"score": 0.0021049977753042253, "phrase": "published_and_unpublished_papers"}], "paper_keywords": [""], "paper_abstract": "Since its creation in 1991, arXiv has become central to the diffusion of research in a number of fields. Combining data from the entirety of arXiv and the Web of Science (WoS), this article investigates (a) the proportion of papers across all disciplines that are on arXiv and the proportion of arXiv papers that are in the WoS, (b) the elapsed time between arXiv submission and journal publication, and (c) the aging characteristics and scientific impact of arXiv e-prints and their published version. It shows that the proportion of WoS papers found on arXiv varies across the specialties of physics and mathematics, and that only a few specialties make extensive use of the repository. Elapsed time between arXiv submission and journal publication has shortened but remains longer in mathematics than in physics. In physics, mathematics, as well as in astronomy and astrophysics, arXiv versions are cited more promptly and decay faster than WoS papers. The arXiv versions of papers-both published and unpublished-have lower citation rates than published papers, although there is almost no difference in the impact of the arXiv versions of published and unpublished papers.", "paper_title": "arXiv E-Prints and the Journal of Record: An Analysis of Roles and Relationships", "paper_id": "WOS:000335583900006"}