{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_multilevel_splitting_algorithms"}, {"score": 0.03656616829869208, "phrase": "reactive_trajectories"}, {"score": 0.004604214511792668, "phrase": "tail_distributions"}, {"score": 0.004556901872357751, "phrase": "fast_and_efficient_way"}, {"score": 0.004372442291178139, "phrase": "so-called_reactive_trajectories"}, {"score": 0.004152288616186981, "phrase": "successive_selection-mutation_steps"}, {"score": 0.004053362743156545, "phrase": "controlled_way"}, {"score": 0.003822778117250714, "phrase": "good_or_bad_trajectories"}, {"score": 0.0034951469511975346, "phrase": "average_duration"}, {"score": 0.0034236045013591437, "phrase": "theoretical_predictions"}, {"score": 0.003097865379563127, "phrase": "asymptotic_regime"}, {"score": 0.0029518598926717332, "phrase": "phase_transitions"}, {"score": 0.002851790448644913, "phrase": "known_theoretical_results"}, {"score": 0.002822434555587263, "phrase": "non-optimal_reaction_coordinates"}, {"score": 0.0025625729433234623, "phrase": "usual_expected_central_limit_behaviour"}, {"score": 0.002224510044064184, "phrase": "three-state_markov_chain"}, {"score": 0.0021714122348552747, "phrase": "logarithmic_convergence"}, {"score": 0.0021490449563443025, "phrase": "trajectory_durations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multilevel splitting", " Stochastic processes", " Numerical methods", " Phase transition"], "paper_abstract": "Adaptive multilevel splitting algorithms have been introduced rather recently for estimating tail distributions in a fast and efficient way. In particular, they can be used for computing the so-called reactive trajectories corresponding to direct transitions from one metastable state to another. The algorithm is based on successive selection-mutation steps performed on the system in a controlled way. It has two intrinsic parameters, the number of particles/trajectories and the reaction coordinate used for discriminating good or bad trajectories. We investigate first the convergence in law of the algorithm as a function of the timestep for several simple stochastic models. Second, we consider the average duration of reactive trajectories for which no theoretical predictions exist. The most important aspect of this work concerns some systems with two degrees of freedom. They are studied in detailas a function of the reaction coordinate in the asymptotic regime where the number of trajectories goes to infinity. We show that during phase transitions, the statistics of the algorithm deviate significatively from known theoretical results when using non-optimal reaction coordinates. In this case, the variance of the algorithm is peaking at the transition and the convergence of the algorithm can be much slower than the usual expected central limit behaviour. The duration of trajectories is affected as well. Moreover, reactive trajectories do not correspond to the most probable ones. Such behaviour disappears when using the optimal reaction coordinate called committor as predicted by the theory. We finally investigate a three-state Markov chain which reproduces this phenomenon and show logarithmic convergence of the trajectory durations. (C) 2014 Elsevier Inc. Allrightsreserved.", "paper_title": "Statistical behaviour of adaptive multilevel splitting algorithms in simple models", "paper_id": "WOS:000347407300029"}