{"auto_keywords": [{"score": 0.04651409477955238, "phrase": "local_features"}, {"score": 0.029605508546808802, "phrase": "pre-learned_codebooks"}, {"score": 0.0071313860082871956, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "explicit_codebook_generation"}, {"score": 0.004722898398399427, "phrase": "implicitly_transferred_codebooks"}, {"score": 0.004491678520807451, "phrase": "visual_applications"}, {"score": 0.004288261454002681, "phrase": "histogram-based_image_representation"}, {"score": 0.004173865018011237, "phrase": "proper_codebook"}, {"score": 0.0036178264212372497, "phrase": "limited_number"}, {"score": 0.0035899674590142653, "phrase": "training_images"}, {"score": 0.003284550970221379, "phrase": "online_visual_applications"}, {"score": 0.0030166837276747816, "phrase": "visual_representation"}, {"score": 0.0027706013216537042, "phrase": "non-linear_transfer"}, {"score": 0.002665465323614577, "phrase": "non-linear_transformation"}, {"score": 0.0025842289219860795, "phrase": "sparsity_constraints"}, {"score": 0.00230098581403254, "phrase": "new_visual_applications"}, {"score": 0.0022308329460335985, "phrase": "corresponding_encoding_parameters"}, {"score": 0.0022136307563123256, "phrase": "image_representation"}, {"score": 0.0021544587602892466, "phrase": "image_classification"}], "paper_keywords": ["Codebook transfer", " image representation", " classification", " reconstruction", " sparse constraint"], "paper_abstract": "The bag-of-visual-words model plays a very important role for visual applications. Local features are first extracted and then encoded to get the histogram-based image representation. To encode local features, a proper codebook is needed. Usually, the codebook has to be generated for each data set which means the codebook is data set dependent. Besides, the codebook may be biased when we only have a limited number of training images. Moreover, the codebook has to be pre-learned which cannot be updated quickly, especially when applied for online visual applications. To solve the problems mentioned above, in this paper, we propose a novel implicit codebook transfer method for visual representation. Instead of explicitly generating the codebook for the new data set, we try to make use of pre-learned codebooks using non-linear transfer. This is achieved by transferring the pre-learned codebooks with non-linear transformation and use them to reconstruct local features with sparsity constraints. The codebook does not need to be explicitly generated but can be implicitly transferred. In this way, we are able to make use of pre-learned codebooks for new visual applications by implicitly learning the codebook and the corresponding encoding parameters for image representation. We apply the proposed method for image classification and evaluate the performance on several public image data sets. Experimental results demonstrate the effectiveness and efficiency of the proposed method.", "paper_title": "Beyond Explicit Codebook Generation: Visual Representation Using Implicitly Transferred Codebooks", "paper_id": "WOS:000369538200002"}