{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "print_books"}, {"score": 0.004499334809770281, "phrase": "historical_research"}, {"score": 0.004240116703465252, "phrase": "academic_historians"}, {"score": 0.003945266418163835, "phrase": "perceived_characteristics"}, {"score": 0.0038953958723049287, "phrase": "evolving_research_tool"}, {"score": 0.003797530813314321, "phrase": "rogers's_model"}, {"score": 0.0037495207047193034, "phrase": "innovation-decision_process"}, {"score": 0.003639835714755229, "phrase": "interview_guide"}, {"score": 0.0036090884921108086, "phrase": "ten_semistructured_interviews"}, {"score": 0.003548368289666932, "phrase": "history_faculty"}, {"score": 0.0034886660821793576, "phrase": "grounded_theory_approach"}, {"score": 0.003259702394241964, "phrase": "teaching_innovations"}, {"score": 0.003204841443605308, "phrase": "historical_research_process"}, {"score": 0.003071682293903262, "phrase": "professional_development"}, {"score": 0.0030071857666598193, "phrase": "academic_librarians"}, {"score": 0.002704403349815203, "phrase": "digital_environments"}, {"score": 0.0026252106881752067, "phrase": "key_resources"}, {"score": 0.0025591748412278174, "phrase": "technological_transparency"}, {"score": 0.0024947959375982614, "phrase": "rogers's_knowledge"}, {"score": 0.0022434880661725493, "phrase": "five_characteristics"}, {"score": 0.002215081186105616, "phrase": "persuasion_stage"}, {"score": 0.0021410718792612173, "phrase": "study_findings"}], "paper_keywords": [""], "paper_abstract": "This article aims to understand the adoption of e-books by academic historians for the purpose of teaching and research. This includes an investigation into their knowledge about and perceived characteristics of this evolving research tool. The study relied on Rogers's model of the innovation-decision process to guide the development of an interview guide. Ten semistructured interviews were conducted with history faculty between October 2010 and December 2011. A grounded theory approach was employed to code and analyze the data. Findings about tradition, cost, teaching innovations, and the historical research process provide the background for designing learning opportunities for the professional development of historians and the academic librarians who work with them. While historians are open to experimenting with e-books, they are also concerned about the loss of serendipity in digital environments, the lack of availability of key resources, and the need for technological transparency. The findings show that Rogers's knowledge and persuasion stages are cyclical in nature, with scholars moving back and forth between these two stages. Participants interviewed were already weighing the five characteristics of the persuasion stage without having much knowledge about e-books. The study findings have implications for our understanding of the diffusion of innovations in academia: both print and digital collections are being used in parallel without one replacing the other.", "paper_title": "Are e-books replacing print books? tradition, serendipity, and opportunity in the adoption and use of e-books for historical research and teaching", "paper_id": "WOS:000325930600011"}