{"auto_keywords": [{"score": 0.04835645688467941, "phrase": "land_use_change"}, {"score": 0.010612387000973441, "phrase": "agent-based_modeling"}, {"score": 0.004226856126282259, "phrase": "'top-down'_or_'bottom-up'_approaches"}, {"score": 0.003755949722774176, "phrase": "top-down_and_bottom-up_approaches"}, {"score": 0.0036207206487324506, "phrase": "minimal_attention"}, {"score": 0.0033646448121751574, "phrase": "bottom-up_simulation"}, {"score": 0.0032967724149749853, "phrase": "top-down_analytical_capabilities"}, {"score": 0.0032700071110068323, "phrase": "multi-objective_decision-making"}, {"score": 0.0032040376301815544, "phrase": "heuristic_modeling_approach"}, {"score": 0.0031394202083691756, "phrase": "rl"}, {"score": 0.0030262967460085366, "phrase": "computer_agents"}, {"score": 0.0029773436815290215, "phrase": "commercial_enterprises"}, {"score": 0.0028935680100446583, "phrase": "population_densities"}, {"score": 0.002870066750788841, "phrase": "attractivity_preferences"}, {"score": 0.002688781336915723, "phrase": "different_stakeholders"}, {"score": 0.002634506575564286, "phrase": "rl_algorithms"}, {"score": 0.002560352786969071, "phrase": "land_use_change_process"}, {"score": 0.0024480094603893175, "phrase": "bridging_bottom-up_and_top-down_models"}, {"score": 0.0021571717917276724, "phrase": "'modeling-in-the-middle'_approach"}, {"score": 0.0021049977753042253, "phrase": "real_yet_conflicting_forces"}], "paper_keywords": ["agent-based modeling", " multi-objective decision-making", " reinforcement learning", " land use change"], "paper_abstract": "A spectrum of methods exists for investigating and providing solutions for land use change. These methods can be broadly categorized as either 'top-down' or 'bottom-up' approaches according to how land use change is modeled and analyzed. Although there has been much research in recent years advancing the use of these techniques for both theoretical and practical applications, integrating top-down and bottom-up approaches for enhancing land use change modeling has received minimal attention. The objective of this study is to address this gap in the literature by bridging the bottom-up simulation of agent-based modeling and the top-down analytical capabilities of multi-objective decision-making by means of a heuristic modeling approach called reinforcement learning (RL). A model is developed in which computer agents representing households and commercial enterprises select locations to inhabit based on population densities and attractivity preferences. The land use change resulting from these dynamics is evaluated by a set of agents representing different stakeholders who are embedded with RL algorithms that allow them to influence the land use change process so that their objectives are addressed. The results demonstrate that bridging bottom-up and top-down models leads to negotiated land use patterns in which the desires and objectives of all individuals are constrained by behaviors of others. This study suggests that a movement toward a 'modeling-in-the-middle' approach is desirable to incorporate the real yet conflicting forces that shape land use change and that are rarely considered in unison.", "paper_title": "Modeling-in-the-middle: bridging the gap between agent-based modeling and multi-objective decision-making for land use change", "paper_id": "WOS:000295465900002"}