{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_games"}, {"score": 0.025115743464724408, "phrase": "sd_meta-csps"}, {"score": 0.0047587234712024775, "phrase": "constraint_satisfaction_problem"}, {"score": 0.004504850679320975, "phrase": "possible_values"}, {"score": 0.003974071684351861, "phrase": "original_problem"}, {"score": 0.0034646205853140558, "phrase": "manufacturing_process"}, {"score": 0.0033708244679086265, "phrase": "common_activity"}, {"score": 0.003228517923065361, "phrase": "sequentially_dependent_meta-csp"}, {"score": 0.00238674051726235, "phrase": "formal_definition"}], "paper_keywords": ["Video-games", " artificial intelligence", " constraint satisfaction problem"], "paper_abstract": "A Constraint Satisfaction Problem (CSP) consists in a sequence of variables holding a domain of possible values and relations among these variables called constraints. A meta-CSP can be seen as a metaproblem whose decomposition leads to a set of CSPs. The meta-variables correspond to sub-problems of the original problem, and a meta-constraint is a relation among those meta-variables. Meta-CSPs find many applications in industry, usually in processes that involve time and actions such as the control of a robot, a manufacturing process, or the scheduling of any common activity. In this paper, we introduce the notion of Sequentially Dependent Meta-CSP (SD Meta-CSP), which extends the meta-CSP in order to support applications where a dependency between sub-problems is mandatory. In this case, the meta-CSP is decomposed into a set of sub-problems {P-i, Pi+1,..., P-n}, but the instance of the sub-problem Pi+1 sequentially depends on the solution of the sub-problem P-i. In this work we provide a formal definition for the SD Meta-CSPs, a framework to handle it, and we illustrate its applicability to video games. In particular, we model and implement agents as SD Meta-CSPs able to autonomously play two classic games: Ms. Pac-Man and Super Mario Bros.", "paper_title": "Sequentially Dependent Meta-Constraint Satisfaction Problem: An Application to Video Games", "paper_id": "WOS:000350281600006"}