{"auto_keywords": [{"score": 0.05007850122175858, "phrase": "capacitated_arc_routing_problem"}, {"score": 0.04912868039243805, "phrase": "carp"}, {"score": 0.004644247838681628, "phrase": "important_and_practical_problem"}, {"score": 0.004101088357088207, "phrase": "total_cost"}, {"score": 0.003923965929636472, "phrase": "single_route"}, {"score": 0.003845994935767022, "phrase": "entire_demand"}, {"score": 0.0037999551521987426, "phrase": "capacity_constraints"}, {"score": 0.003635790924434452, "phrase": "np-hard_problems"}, {"score": 0.0033822643082593285, "phrase": "carp."}, {"score": 0.00328849874768242, "phrase": "path-scanning_heuristic"}, {"score": 0.0028342734482926677, "phrase": "new_approach"}, {"score": 0.002209060366991921, "phrase": "average_distance"}, {"score": 0.002147749117443578, "phrase": "test_problems"}], "paper_keywords": ["Vehicle routing", " Capacitated arc routing problem", " Heuristics"], "paper_abstract": "The capacitated arc routing problem (CARP) is an important and practical problem in the OR literature. in short, the problem is to identify routes to service (e.g.. pickup or deliver) demand located along the edges of a network such that the total cost of the routes is minimized. In general, a single route cannot satisfy the entire demand due to capacity constraints on the vehicles. CARP belongs to the set of NP-hard problems; consequently numerous heuristic and metaheuristic solution approaches have been developed to solve it. In this paper an \"ellipse rule\" based heuristic is proposed for the CARP. This approach is based on the path-scanning heuristic. one of the mostly used greedy-add heuristics for this problem. The innovation consists basically of selecting edges only inside ellipses when the vehicle is near the end of each route. This new approach was implemented and tested on three standard datasets and the solutions are compared against: (i) the original path-scanning heuristic; (ii) two other path-scanning heuristics and (iii) the three best known metaheuristics. The results indicate that the \"ellipse rule\" approach lead to improvements over the three path-scanning heuristics, reducing the average distance to the lower bound in the test problems by about 44%. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An improved heuristic for the capacitated arc routing problem", "paper_id": "WOS:000264631300012"}