{"auto_keywords": [{"score": 0.04324409553509609, "phrase": "structural_model"}, {"score": 0.014143452956060803, "phrase": "hydro_model"}, {"score": 0.007152368807539886, "phrase": "seamless_interface"}, {"score": 0.0070211089626587946, "phrase": "structural_analyses"}, {"score": 0.006519564954343733, "phrase": "pressure_distribution"}, {"score": 0.004267468074128779, "phrase": "seakeeping_analysis"}, {"score": 0.004073809704022463, "phrase": "structural_strength"}, {"score": 0.0039868690208433605, "phrase": "nodal_forces"}, {"score": 0.0034303736977646135, "phrase": "different_load_distribution"}, {"score": 0.0033051623473192814, "phrase": "unbalanced_force"}, {"score": 0.0025832180231667853, "phrase": "viscous_force_distribution"}, {"score": 0.0023427844897844093, "phrase": "minimum_distance_measure"}, {"score": 0.002278284823857861, "phrase": "moment_imbalance"}, {"score": 0.0021646022201798247, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pressure", " Hydrodynamic analysis", " Panel", " Seakeeping", " Structural analysis", " Mapping"], "paper_abstract": "This paper addresses the problem of a seamless interface between hydrodynamics and structural analyses. A pressure distribution on a hydro model computed from seakeeping analysis needs to be transferred to a structural model for evaluating structural strength and its integrity. However, due to the differences in the computation and representation methods for both analyses, the load on the hydro model may not be correctly transferred to the structural model, leading to a different load distribution on the structural model and resulting in some unbalanced force and moment components. In this paper, a method is proposed to solve this problem. A pressure distribution on the hydro model is mapped on the structural model through projection, and force and moment imbalances on the structural model are eliminated through optimization of the nodal forces on the structural model. Moreover, a viscous force distribution along the center of each member of the hydro model is transferred to the nodal forces on the structural model based on the minimum distance measure with resolving any force and moment imbalance. Examples are presented to demonstrate the validity of the proposed method. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Load mapping for seamless interface between hydrodynamics and structural analyses", "paper_id": "WOS:000335287100002"}