{"auto_keywords": [{"score": 0.04745358435978179, "phrase": "planning_instances"}, {"score": 0.02819827616624647, "phrase": "acyclic_causal_graphs"}, {"score": 0.006755064351069672, "phrase": "causal_graph"}, {"score": 0.006036548963433499, "phrase": "pspace"}, {"score": 0.004743164872278112, "phrase": "causal_graphs"}, {"score": 0.0045855181084455444, "phrase": "internal_structure"}, {"score": 0.004466519142879166, "phrase": "special_attention"}, {"score": 0.004174451361776433, "phrase": "hierarchical_plans"}, {"score": 0.0034332736827447654, "phrase": "worst_case"}, {"score": 0.003032528228056611, "phrase": "strips_planning"}, {"score": 0.0030097975788892896, "phrase": "negative_preconditions"}, {"score": 0.0026087958216676676, "phrase": "propositional_variables"}, {"score": 0.0024563302149829, "phrase": "strongly_connected_domain_transition_graphs"}, {"score": 0.0023214774334744713, "phrase": "latter_case"}, {"score": 0.0022781884538102264, "phrase": "bounded_plan_existence"}, {"score": 0.0022273034991008326, "phrase": "optimal_planning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Planning", " Computational complexity"], "paper_abstract": "Causal graphs are widely used in planning to capture the internal structure of planning instances. Researchers have paid special attention to the subclass of planning instances with acyclic causal graphs, which in the past have been exploited to generate hierarchical plans, to compute heuristics, and to identify classes of planning instances that are easy to solve. This naturally raises the question of whether planning is easier when the causal graph is acyclic. In this article we show that the answer to this question is no, proving that in the worst case, the problem of plan existence is PSPACE-complete even when the causal graph is acyclic. Since the variables of the planning instances in our reduction are propositional, this result applies to STRIPS planning with negative preconditions. We show that the reduction still holds if we restrict actions to have at most two preconditions. Having established that planning is hard for acyclic causal graphs, we study two subclasses of planning instances with acyclic causal graphs. One such subclass is described by propositional variables that are either irreversible or symmetrically reversible. Another subclass is described by variables with strongly connected domain transition graphs. In both cases, plan existence is bounded away from PSPACE, but in the latter case, the problem of bounded plan existence is hard, implying that optimal planning is significantly harder than satisficing planning for this class. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Limitations of acyclic causal graphs for planning", "paper_id": "WOS:000334974800002"}