{"auto_keywords": [{"score": 0.02275816112896352, "phrase": "frgc"}, {"score": 0.00481495049065317, "phrase": "stabilized_iris_encoding"}, {"score": 0.0047732596509542135, "phrase": "zernike_moments"}, {"score": 0.004690952711665194, "phrase": "accurate_iris_recognition"}, {"score": 0.004630150894006861, "phrase": "distantly_acquired_face"}, {"score": 0.004590052784169268, "phrase": "eye_images"}, {"score": 0.0045108906244892165, "phrase": "effective_strategies"}, {"score": 0.004394688617163029, "phrase": "significant_variations"}, {"score": 0.004337710093279712, "phrase": "segmented_iris_image_quality"}, {"score": 0.0041170581247889654, "phrase": "encoded_iris_features"}, {"score": 0.0038737214010638745, "phrase": "nonlinear_approach_to_simultaneously_account"}, {"score": 0.0038234714417849495, "phrase": "local_consistency"}, {"score": 0.0037903327482565097, "phrase": "iris_bit"}, {"score": 0.003757480190200645, "phrase": "also_the_overall_quality"}, {"score": 0.0037087324991876727, "phrase": "weight_map"}, {"score": 0.0035507457285983268, "phrase": "fragile_bits"}, {"score": 0.0033699898113395328, "phrase": "local_iris_features"}, {"score": 0.0033262524445013303, "phrase": "zernike_moment-based_phase_encoding"}, {"score": 0.00321236577162671, "phrase": "-based_phase_features"}, {"score": 0.0031431690368229443, "phrase": "partially_overlapping_regions"}, {"score": 0.0030754582519753474, "phrase": "local_pixel_region_variations"}, {"score": 0.00303553181618577, "phrase": "normalized_iris_images"}, {"score": 0.0029961221584602405, "phrase": "joint_strategy"}, {"score": 0.002818850283787242, "phrase": "proposed_iris_matching_strategy"}, {"score": 0.0024519545383399773, "phrase": "proposed_strategy"}, {"score": 0.0024201029474586007, "phrase": "significant_improvement"}, {"score": 0.0023990982005125763, "phrase": "iris_matching_accuracy"}, {"score": 0.0023679315987170857, "phrase": "competing_approaches"}, {"score": 0.0021987994275190314, "phrase": "equal_error_rates"}], "paper_keywords": ["Biometrics", " iris recognition", " less-constrained iris recognition", " at-a-distance iris recognition"], "paper_abstract": "Accurate iris recognition from the distantly acquired face or eye images requires development of effective strategies, which can account for significant variations in the segmented iris image quality. Such variations can be highly correlated with the consistency of encoded iris features and knowledge that such fragile bits can be exploited to improve matching accuracy. A nonlinear approach to simultaneously account for both local consistency of iris bit and also the overall quality of the weight map is proposed. Our approach therefore more effectively penalizes the fragile bits while simultaneously rewarding more consistent bits. In order to achieve more stable characterization of local iris features, a Zernike moment-based phase encoding of iris features is proposed. Such Zernike moments-based phase features are computed from the partially overlapping regions to more effectively accommodate local pixel region variations in the normalized iris images. A joint strategy is adopted to simultaneously extract and combine both the global and localized iris features. The superiority of the proposed iris matching strategy is ascertained by providing comparison with several state-of-the-art iris matching algorithms on three publicly available databases: 1) UBIRIS. v2; 2) FRGC; and 3) CASIA. v4-distance. Our experimental results suggest that proposed strategy can achieve significant improvement in iris matching accuracy over those competing approaches in the literature, i.e., average improvement of 54.3%, 32.7%, and 42.6% in equal error rates, respectively, for UBIRIS. v2, FRGC, and CASIA. v4-distance.", "paper_title": "Accurate Iris Recognition at a Distance Using Stabilized Iris Encoding and Zernike Moments Phase Features", "paper_id": "WOS:000341572400002"}