{"auto_keywords": [{"score": 0.02953506307707683, "phrase": "virtual_child"}, {"score": 0.022955906981394554, "phrase": "vulnerable_populations"}, {"score": 0.009724923580712691, "phrase": "standardized_patients"}, {"score": 0.00481495049065317, "phrase": "mixed_reality"}, {"score": 0.004719816332271661, "phrase": "practicing_clinical_communication_skills"}, {"score": 0.004481132747216135, "phrase": "exam_skills"}, {"score": 0.0036993855514735746, "phrase": "working_professionals"}, {"score": 0.0034702685641070283, "phrase": "virtual_humans"}, {"score": 0.003334309053314909, "phrase": "mixed_reality_pediatric_patient"}, {"score": 0.003255295296893174, "phrase": "pediatric_developmental_exams"}, {"score": 0.002922207118572208, "phrase": "student's_confidence"}, {"score": 0.0028529310661977577, "phrase": "effective_practice"}, {"score": 0.00240213106042981, "phrase": "complete_mixed_reality_exam"}, {"score": 0.002326464619238653, "phrase": "within-subjects_user_study"}, {"score": 0.0021049977753042253, "phrase": "natural_interface"}], "paper_keywords": ["Virtual humans", " medical education", " social presence", " presence"], "paper_abstract": "Health sciences students often practice and are evaluated on interview and exam skills by working with standardized patients (people that role play having a disease or condition). However, standardized patients do not exist for certain vulnerable populations such as children and the intellectually disabled. As a result, students receive little to no exposure to vulnerable populations before becoming working professionals. To address this problem and thereby increase exposure to vulnerable populations, we propose using virtual humans to simulate members of vulnerable populations. We created a mixed reality pediatric patient that allowed students to practice pediatric developmental exams. Practicing several exams is necessary for students to understand how to properly interact with and correctly assess a variety of children. Practice also increases a student's confidence in performing the exam. Effective practice requires students to treat the virtual child realistically. Treating the child realistically might be affected by how the student and virtual child physically interact, so we created two object interaction interfaces - a natural interface and a mouse-based interface. We tested the complete mixed reality exam and also compared the two object interaction interfaces in a within-subjects user study with 22 participants. Our results showed that the participants accepted the virtual child as a child and treated it realistically. Participants also preferred the natural interface, but the interface did not affect how realistically participants treated the virtual child.", "paper_title": "Applying Mixed Reality to Simulate Vulnerable Populations for Practicing Clinical Communication Skills", "paper_id": "WOS:000316409700007"}