{"auto_keywords": [{"score": 0.012851818874105105, "phrase": "nascent_entrepreneurs"}, {"score": 0.012181114686073746, "phrase": "image_theory"}, {"score": 0.010635099271600348, "phrase": "conceptual_framework"}, {"score": 0.004576253356889219, "phrase": "comprehensive_model"}, {"score": 0.004447201233380302, "phrase": "turnover_behaviour"}, {"score": 0.004173244935967375, "phrase": "voluntary_turnover"}, {"score": 0.004133627071344356, "phrase": "six_stages"}, {"score": 0.004094383764612506, "phrase": "process_model"}, {"score": 0.004068427912211707, "phrase": "employee_turnover"}, {"score": 0.0040042529959108605, "phrase": "entrepreneurship_literature"}, {"score": 0.003204841443605308, "phrase": "rtq_change"}, {"score": 0.0030847461428168614, "phrase": "specific_events"}, {"score": 0.0029409171055888804, "phrase": "compatibility_test"}, {"score": 0.002750721367040336, "phrase": "nascent_entrepreneur"}, {"score": 0.0026475981474045414, "phrase": "sample_vignette"}, {"score": 0.0026224255640133758, "phrase": "former_it_employee"}, {"score": 0.002330908268655666, "phrase": "rtq"}, {"score": 0.0023161093786553412, "phrase": "ncq"}, {"score": 0.002208035721125305, "phrase": "voluntary_it_turnover"}, {"score": 0.0021184539346572953, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["turnover", " IT entrepreneurial turnover", " unfolding model of voluntary turnover", " necessary configuration to quit", " readiness to quit"], "paper_abstract": "This paper addresses an untapped, though important, type of information technology (IT) personnel turnover: IT entrepreneurship. We develop a comprehensive model to understand the factors and processes that influence turnover behaviour for prospective (nascent) IT entrepreneurs. To do this, we review three streams of research: first, the unfolding model of voluntary turnover that specifies six stages in a process model of employee turnover; second, the entrepreneurship literature (focusing on differences between nascent entrepreneurs and non-entrepreneurs), and third, attributes of the IT personnel and IT industry. We use Image Theory as the 'glue' to merge these streams of research together. We do so by proposing two new constructs readiness to quit (to start a business) (RTQ) and necessary configuration to quit (NCQ), which we incorporate into a conceptual framework describing how specific dimensions of RTQ change over time, either gradually or suddenly, in response to specific events. Based on Image Theory, we describe the process by which nascent entrepreneurs conduct a compatibility test to assess the fit between their current RTQ and the set of NCQs. If there is a fit, then the nascent entrepreneur is ready to quit his or her current job. We illustrate our model using a sample vignette involving a former IT employee who became an entrepreneur, and we provide suggestions for researchers and practitioners, based on our model and the constructs that we introduce. Although we develop our model in the context of IT turnover and entrepreneurship, RTQ and NCQ, as well as the conceptual framework, can also be applied to other types of voluntary IT turnover (e. g., accepting a position in another company). European Journal of Information Systems (2009) 18, 498-521. doi: 10.1057/ejis.2009.37", "paper_title": "Another road to IT turnover: the entrepreneurial path", "paper_id": "WOS:000272248400009"}