{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "business_and_management_journal_quality"}, {"score": 0.004631684772248772, "phrase": "uk"}, {"score": 0.004582722012454012, "phrase": "peer_review"}, {"score": 0.004518722156453858, "phrase": "business"}, {"score": 0.0044237033788643715, "phrase": "journal_articles"}, {"score": 0.004121960535174029, "phrase": "fifth_point"}, {"score": 0.003923023699005215, "phrase": "overall_quality_profile"}, {"score": 0.003720479367430766, "phrase": "individual_papers"}, {"score": 0.0034911335714333507, "phrase": "major_opportunity"}, {"score": 0.003310813458610484, "phrase": "journal_rankings"}, {"score": 0.003150966510956472, "phrase": "panel"}, {"score": 0.0031286936417685178, "phrase": "journal_quality"}, {"score": 0.0030847461428168614, "phrase": "submission_details"}, {"score": 0.0030521898646210413, "phrase": "resulting_grade_profile"}, {"score": 0.0029670381308395505, "phrase": "linear_programming"}, {"score": 0.0029253546782349875, "phrase": "best_estimate"}, {"score": 0.0026967596578196325, "phrase": "single_quality_estimate"}, {"score": 0.0026214978443388653, "phrase": "good_validity"}, {"score": 0.0024772013657695896, "phrase": "rae_results"}, {"score": 0.0023079225317714815, "phrase": "abs_ranking"}, {"score": 0.0021501863832966966, "phrase": "different_subject_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Journal rankings", " Linear programming (LP)", " Research Assessment Exercise (RAE)", " Research evaluation"], "paper_abstract": "The 2008 Research Assessment Exercise in the UK involved the peer review of over 12,500 research outputs in Business and Management, of which 92% were journal articles. Each output was graded on a 4-point scale from \"world leading\" to \"national\" with a fifth point being unclassified. These grades were accumulated for each department to provide an overall quality profile in terms of the proportions of its outputs in each category. The assessments of individual papers were not made public but the papers submitted by each department were. This data provides a major opportunity for addressing issues of concern about the evaluation of research and the effects of journal rankings, as well as the possibility of reconstructing the judgements made by the Panel about journal quality. Given the submission details and the resulting grade profile for each department, we have used linear programming to produce the best estimate of the grades awarded to papers from each journal that had more than three entries. This provides both a grade profile for each journal and a single quality estimate. The results are shown to have good validity in comparison with other journal rankings. Apart from providing a ranking of 700 journals based on the RAE results, the paper is also able to shed light on issues such as the accuracy and coverage of the ABS ranking; the degree of selectivity of submissions; the dispersion of grades for a journal; and differences between different subject areas. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Estimating Business and Management journal quality from the 2008 Research Assessment Exercise in the UK", "paper_id": "WOS:000309794000005"}