{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "communication_complexity"}, {"score": 0.022440712059008706, "phrase": "p_systems"}, {"score": 0.008579113943605766, "phrase": "communication_rules"}, {"score": 0.004784331242964228, "phrase": "evolution-communication_p_systems"}, {"score": 0.004575354958479747, "phrase": "so-called_evolution-communication"}, {"score": 0.0045463102412849725, "phrase": "ec"}, {"score": 0.004333777641701335, "phrase": "target_commands"}, {"score": 0.004091820963641547, "phrase": "communication_costs"}, {"score": 0.003950631096355195, "phrase": "evolution_rules"}, {"score": 0.0038633204164544802, "phrase": "ec_p_systems"}, {"score": 0.0037779846285649356, "phrase": "turing"}, {"score": 0.0036475333460338397, "phrase": "evolution_and_communication_operations"}, {"score": 0.0033142503315912986, "phrase": "universality_proofs"}, {"score": 0.0031998046354547705, "phrase": "dynamical_parameters"}, {"score": 0.0031591719975282073, "phrase": "communication_steps"}, {"score": 0.002574788013427524, "phrase": "standard_complexity_measures"}, {"score": 0.0024542249391904256, "phrase": "bounded_complexity"}, {"score": 0.0023999058090187985, "phrase": "evolution_steps"}, {"score": 0.0023021895404322767, "phrase": "finite_complexity_thresholds"}, {"score": 0.0022584385508256566, "phrase": "preliminary_results"}, {"score": 0.0021049977753042253, "phrase": "research_issues"}], "paper_keywords": [""], "paper_abstract": "Looking for a theory of communication complexity for P systems, we consider here so-called evolution-communication (EC for short) P systems, where objects evolve by multiset rewriting rules without target commands and pass through membranes by means of symport/antiport rules. We first propose a way to measure the communication costs by means of \"quanta of energy\" (produced by evolution rules and) consumed by communication rules. EC P systems with such costs are proved to be Turing complete in all three cases with respect to the relation between evolution and communication operations: priority of communication, mixing the rules without priority for any type, priority of evolution (with the cost of communication increasing in this ordering in the universality proofs). More appropriate measures of communication complexity are then defined, as dynamical parameters, counting the communication steps or the number (and the weight) of communication rules used during a computation. Such parameters can be used in three ways: as properties of P systems (considering the families of sets of numbers generated by systems with a given communication complexity), as conditions to be imposed on computations (accepting only those computations with a communication complexity bounded by a given threshold), and as standard complexity measures (defining the class of problems which can be solved by P systems with a bounded complexity). Because we ignore the evolution steps, in all three cases it makes sense to consider hierarchies starting with finite complexity thresholds. We only give some preliminary results about these hierarchies (for instance, proving that already their lower levels contain complex e.g., non-semilinear sets), and we leave open many problems and research issues.", "paper_title": "On Communication Complexity in Evolution-Communication P Systems", "paper_id": "WOS:000291700300002"}