{"auto_keywords": [{"score": 0.04443809788762847, "phrase": "lu_et_al"}, {"score": 0.015719716506582538, "phrase": "waters_signatures"}, {"score": 0.015536074385669861, "phrase": "waters"}, {"score": 0.008211836739334948, "phrase": "chosen-key_model"}, {"score": 0.0046739596755881185, "phrase": "first_efficient_signature_scheme"}, {"score": 0.004378078970574258, "phrase": "standard_computational_diffie-hellman_assumption"}, {"score": 0.003910278811774747, "phrase": "security_proofs"}, {"score": 0.0036625643243684827, "phrase": "certified-key_model"}, {"score": 0.0035551969986263553, "phrase": "key_pair"}, {"score": 0.0033101397746161843, "phrase": "signature_forger"}, {"score": 0.0029737652463012318, "phrase": "real_world"}, {"score": 0.0024431289979171505, "phrase": "rogue_key_attack"}, {"score": 0.002357337046408753, "phrase": "first_ves_scheme"}], "paper_keywords": [""], "paper_abstract": "Waters proposed the first efficient signature scheme that is known to be existentially unforgeable based on the standard computational Diffie-Hellman assumption without random oracles. Lu et al. then proposed the first verifiably encrypted signature (VES) scheme based on Waters signatures. However, the security proofs of Lu et al. and some other VES schemes are built on the certified-key model, in which the key pair of the adjudicator is chosen by the simulator rather than the signature forger. It demands that the adjudicator must be honest enough never to forge signatures. In the real world, it is hard for users to choose such trusted third party. In this study, the authors first show that Lu et al.'s VES is not secure in the chosen-key model by presenting a rogue key attack. Then they present the first VES scheme based on Waters signatures secure in the chosen-key model, where two inside adversaries, malicious adjudicator and malicious verifier, have more powers than ever.", "paper_title": "Practical verifiably encrypted signature based on Waters signatures", "paper_id": "WOS:000353550300005"}