{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "laplacian_svms"}, {"score": 0.012423034535302451, "phrase": "unlabeled_notes"}, {"score": 0.010905470187530776, "phrase": "training_reference_standard"}, {"score": 0.009174575439464613, "phrase": "laplacian_svm"}, {"score": 0.004730338746443662, "phrase": "cancer_case_management"}, {"score": 0.004549366134876482, "phrase": "clinical_text_classification_task"}, {"score": 0.004437807397753662, "phrase": "unlabeled_training_data"}, {"score": 0.004406436661912347, "phrase": "laplacian_svm_performance"}, {"score": 0.004252864101987588, "phrase": "based_clinical_text_classifiers"}, {"score": 0.0041780882724537, "phrase": "labeled_training_data"}, {"score": 0.004119211418949265, "phrase": "manual_review"}, {"score": 0.0037163618245226755, "phrase": "supervised_machine_learning_approaches"}, {"score": 0.0035995085881892464, "phrase": "labeled_and_unlabeled_data"}, {"score": 0.003437154518139677, "phrase": "support_vector_machines"}, {"score": 0.0033771189169159626, "phrase": "laplacian"}, {"score": 0.003167587258150065, "phrase": "potentially_malignant_liver_lesions"}, {"score": 0.0028677070439412427, "phrase": "test_set"}, {"score": 0.002767613012044169, "phrase": "labeled_and_unlabeled_radiology_reports"}, {"score": 0.0024789326485851666, "phrase": "labeled_and_unlabeled_notes"}, {"score": 0.002268161377269513, "phrase": "practical_semi-supervised_methods"}, {"score": 0.0021503823972534096, "phrase": "clinical_text_classification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Semi-supervised learning", " Support vector machine", " Graph Laplacian", " Natural language processing"], "paper_abstract": "Objective: To compare linear and Laplacian SVMs on a clinical text classification task; to evaluate the effect of unlabeled training data on Laplacian SVM performance. Background: The development of machine-learning based clinical text classifiers requires the creation of labeled training data, obtained via manual review by clinicians. Due to the effort and expense involved in labeling data, training data sets in the clinical domain are of limited size. In contrast, electronic medical record (EMR) systems contain hundreds of thousands of unlabeled notes that are not used by supervised machine learning approaches. Semi-supervised learning algorithms use both labeled and unlabeled data to train classifiers, and can outperform their supervised counterparts. Methods We trained support vector machines (SVMs) and Laplacian SVMs on a training reference standard of 820 abdominal CT, MRI, and ultrasound reports labeled for the presence of potentially malignant liver lesions that require follow up (positive class prevalence 77%). The Laplacian SVM used 19,845 randomly sampled unlabeled notes in addition to the training reference standard. We evaluated SVMs and Laplacian SVMs on a test set of 520 labeled reports. Results: The Laplacian SVM trained on labeled and unlabeled radiology reports significantly outperformed supervised SVMs (Macro-F1 0.773 vs. 0.741, Sensitivity 0.943 vs. 0.911, Positive Predictive value 0.877 vs. 0.883). Performance improved with the number of labeled and unlabeled notes used to train the Laplacian SVM (pearson's p = 0.529 for correlation between number of unlabeled notes and macro-F1 score). These results suggest that practical semi-supervised methods such as the Laplacian SVM can leverage the large, unlabeled corpora that reside within EMRs to improve clinical text classification. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Semi-supervised clinical text classification with Laplacian SVMs: An application to cancer case management", "paper_id": "WOS:000324848600012"}