{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minutiae_patterns"}, {"score": 0.023035893296092902, "phrase": "finger_knuckle_images"}, {"score": 0.010305569106827976, "phrase": "finger_knuckle_patterns"}, {"score": 0.006547319082956913, "phrase": "minutiae_recovery"}, {"score": 0.004734448316824488, "phrase": "personal_identification"}, {"score": 0.0046161999598320486, "phrase": "increasing_attention"}, {"score": 0.0045581828632009795, "phrase": "biometrics_literature"}, {"score": 0.0043699845927285905, "phrase": "knuckle_patterns"}, {"score": 0.004189523950071494, "phrase": "promising_results"}, {"score": 0.004084829853870028, "phrase": "law-enforcement_and_forensic_analysis"}, {"score": 0.003335873298309004, "phrase": "high_resolution_finger_dorsal_images"}, {"score": 0.0032938942910948096, "phrase": "recreational_or_covert_imaging"}, {"score": 0.0032524418285459324, "phrase": "important_cues"}, {"score": 0.0032250961348210473, "phrase": "forensic_investigation"}, {"score": 0.003144426503333397, "phrase": "finger_dorsal_patterns"}, {"score": 0.0026445028886931837, "phrase": "effective_use"}, {"score": 0.0026222551419772867, "phrase": "minutiae_quality"}, {"score": 0.002556625752785268, "phrase": "knuckle_pattern_matching"}, {"score": 0.002461241017147324, "phrase": "comparative_evaluation"}, {"score": 0.0023694065215394593, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Finger knuckle matching", " Image forensics", " Emerging biometric modalities", " Human identification"], "paper_abstract": "Personal identification approaches using finger knuckle patterns are receiving increasing attention in the biometrics literature. Several approaches have been explored and these methods consider knuckle patterns as textured-like patterns, similar to the iris, and illustrate promising results. However much of the law-enforcement and forensic analysis for hand biometrics still relies on recovery and matching of minutiae patterns which has matured in last several decades. This is largely due to the fact that the identification of minutiae patterns is believed to be more scientific and pervasive in connecting with the anatomy/uniqueness of individuals. Availability of high resolution finger dorsal images acquired for recreational or covert imaging can provide important cues for forensic investigation and analysis, especially when finger dorsal patterns are only the piece of evidence available for the identification. Identification of finger knuckle patterns using minutiae recovery and matching is expected to significantly help in prosecution of such suspects. This paper therefore investigates recovery and matching of minutiae patterns using finger knuckle images. We investigate effective use of minutiae quality in improving performance for the knuckle pattern matching. Our study detailed in this paper also presents comparative evaluation of performance using three popular minutiae matching approaches. The experimental results presented in this paper from a database from 120 different subjects are highly encouraging and validate such first attempt to study minutiae recovery and matching from finger knuckle images. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Recovering and matching minutiae patterns from finger knuckle images", "paper_id": "WOS:000365181900017"}