{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "mobile_phone"}, {"score": 0.012330193047140163, "phrase": "mobile_phone_users"}, {"score": 0.00481495049065317, "phrase": "dangers_using_mobile_phone_sensors"}, {"score": 0.004144908086646161, "phrase": "manhole_cover"}, {"score": 0.003960831041259951, "phrase": "rushing_car"}, {"score": 0.0038895008852940323, "phrase": "traffic_light"}, {"score": 0.0034403745992576808, "phrase": "danger_spying"}, {"score": 0.003056819704624705, "phrase": "mobile_phones"}, {"score": 0.0028422946420821075, "phrase": "mobile_phone_sensors"}, {"score": 0.0027910516355928983, "phrase": "walk_pattern_recognition_system"}, {"score": 0.0027282915297520624, "phrase": "embedded_sensor"}, {"score": 0.0026188490199688013, "phrase": "movement_pattern"}, {"score": 0.002491015208328868, "phrase": "headsup"}, {"score": 0.0021049977753042253, "phrase": "false_negative_rate"}], "paper_keywords": [""], "paper_abstract": "Walking while staring at the mobile phone is dangerous, and the dangermainly arises from distraction. While watching the mobile phone, one could fall into a deep well without noticing the manhole cover was missing, one could be hit by a rushing car without observing the traffic light, and so forth. Some mobile phone users are already aware of the crisis, and they keep looking up and down to allocate some focus to danger spying; however, the statistics data revealed by US government make such efforts frustrating: about 1,152 pedestrians are injured in US in the year 2010, while they were using mobile phones, and the number doubled in the year 2012. This paper identified the possibility of using mobile phone sensors to develop a walk pattern recognition system. By sampling from embedded sensor, such as accelerometer and gyroscope, the movement pattern of mobile phone users can be computed. We design and implement HeadsUp, a system that warns pedestrian and locks the screen when one looks at the mobile phone while walking. Evaluation results from experiments of 20 testers in real life situation show that, on average, the false negative rate is less than 3%.", "paper_title": "HeadsUp: Keeping Pedestrian Phone Addicts from Dangers Using Mobile Phone Sensors", "paper_id": "WOS:000355826600001"}