{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hypergraph_clustering"}, {"score": 0.04926889079413175, "phrase": "image_segmentation"}, {"score": 0.004653339900995785, "phrase": "hypergraph-based_methods"}, {"score": 0.004605917942709477, "phrase": "considerable_attention"}, {"score": 0.004527947981009528, "phrase": "real-world_clustering_problems"}, {"score": 0.004405919996432158, "phrase": "higher-order_relationships"}, {"score": 0.004316552692395911, "phrase": "standard_graph_theory"}, {"score": 0.004157374465795314, "phrase": "spectral_hypergraph_theory"}, {"score": 0.0040040425282442125, "phrase": "hypergraph_cut_problem"}, {"score": 0.003963211180578005, "phrase": "appropriate_objective_function"}, {"score": 0.0038695436922618876, "phrase": "spectral_relaxation"}, {"score": 0.0038300786263543835, "phrase": "optimization_problem"}, {"score": 0.003540539868937462, "phrase": "real-world_problems"}, {"score": 0.0033635683594830158, "phrase": "natural_way"}, {"score": 0.003195414285736136, "phrase": "spectral_clustering"}, {"score": 0.0031091858573262265, "phrase": "smaller_size"}, {"score": 0.002953711377604328, "phrase": "hypergraph_structure"}, {"score": 0.002825251837733693, "phrase": "new_approach"}, {"score": 0.002748984715897838, "phrase": "multilevel_paradigm"}, {"score": 0.002472352057126189, "phrase": "extensive_experiments"}, {"score": 0.002332626862738603, "phrase": "appropriate_hypergraph-based_model"}, {"score": 0.002285216591220303, "phrase": "low_running_times"}, {"score": 0.0021932609696277937, "phrase": "standard_spectral_clustering_approach"}, {"score": 0.002148677187261496, "phrase": "considerable_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hypergraph clustering", " Spectral clustering", " Hypergraph reduction", " Image segmentation"], "paper_abstract": "In the last few years, hypergraph-based methods have gained considerable attention in the resolution of real-world clustering problems, since such a mode of representation can handle higher-order relationships between elements compared to the standard graph theory. The most popular and promising approach to hypergraph clustering arises from concepts in spectral hypergraph theory [53], and clustering is configured as a hypergraph cut problem where an appropriate objective function has to be optimized. The spectral relaxation of this optimization problem allows to get a clustering that is close to the optimum, but this approach generally suffers from its high computational demands, especially in real-world problems where the size of the data involved in their resolution becomes too large. A natural way to overcome this limitation is to operate a reduction of the hypergraph, where spectral clustering should be applied over a hypergraph of smaller size. In this paper, we introduce two novel hypergraph reduction algorithms that are able to maintain the hypergraph structure as accurate as possible. These algorithms allowed us to design a new approach devoted to hypergraph clustering, based on the multilevel paradigm that operates in three steps: (i) hypergraph reduction; (ii) initial spectral clustering of the reduced hypergraph and (iii) clustering refinement. The accuracy of our hypergraph clustering framework has been demonstrated by extensive experiments with comparison to other hypergraph clustering algorithms, and have been successfully applied to image segmentation, for which an appropriate hypergraph-based model have been designed. The low running times displayed by our algorithm also demonstrates that the latter, unlike the standard spectral clustering approach, can handle datasets of considerable size. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A reductive approach to hypergraph clustering: An application to image segmentation", "paper_id": "WOS:000302451000028"}