{"auto_keywords": [{"score": 0.04485011034828449, "phrase": "inventory_records"}, {"score": 0.02631726630594663, "phrase": "misplacement_errors"}, {"score": 0.00481495049065317, "phrase": "retail_supply_chains"}, {"score": 0.004705278218845159, "phrase": "misplaced_products"}, {"score": 0.0045679168155893304, "phrase": "supply_chain"}, {"score": 0.00446384610114756, "phrase": "retail_store"}, {"score": 0.004347795623597379, "phrase": "consumer_demand"}, {"score": 0.004248718518635191, "phrase": "execution_errors"}, {"score": 0.004138237651024009, "phrase": "undetected_supplier_unreliabilities"}, {"score": 0.00401736307274363, "phrase": "receiving_process"}, {"score": 0.00390000531646629, "phrase": "damaged_products"}, {"score": 0.0037242008128962104, "phrase": "misplacement-type_errors"}, {"score": 0.0036392821787269727, "phrase": "i.e._the_whole_quantity"}, {"score": 0.003452357563167821, "phrase": "consumers'_demand"}, {"score": 0.0033625148111740984, "phrase": "replenishment_process"}, {"score": 0.0030059656149799122, "phrase": "wrong_shelves"}, {"score": 0.0027408292745619233, "phrase": "misplaced_products_issue"}, {"score": 0.002713842991944533, "phrase": "decentralised_newsvendor_model"}], "paper_keywords": ["newsvendor model", " inventory inaccuracy", " stochastic misplacement errors", " decentralised retail supply chain", " coordination"], "paper_abstract": "This article considers the situation of a supply chain consisting of a manufacturer and a retail store which faces an uncertainty not only in consumer demand but also in inventory records. Among execution errors that induce an uncertainty in inventory records are undetected supplier unreliabilities, unrecorded item movements (either during the receiving process or within the store), theft, damaged products, etc. In our work, we assume that such inventory inaccuracies are introduced by misplacement-type errors that occur within the store, i.e. the whole quantity of products that is received from the manufacturer is not available on shelf to satisfy consumers' demand either because within the store, the replenishment process from the backroom to shelves is prone to errors (e.g. products are lost during this transfer, some of the products are forbidden in the backroom, other products are put on the wrong shelves, etc...) or products are moved and put on other shelves by consumers during their visit to the store. The framework we consider to model the misplaced products issue is a decentralised Newsvendor model. Within this setting, we analyse four scenarii. Each scenario can be characterised by (i) whether the manufacturer and the retailer are aware of misplacement errors that occur in the store or not (they are not aware of misplacement errors or even that they know the existence of errors, they choose to ignore them) (ii) whether there is a coordination between actors or not. Based on these scenarii, our aim is to evaluate the benefit of having information on errors and optimising the system by taking this information into account as well as the benefit of coordinating the channel.", "paper_title": "Execution errors in retail supply chains: analysis of the case of misplaced products", "paper_id": "WOS:000256799900007"}