{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interactive_domestic_robot_setup"}, {"score": 0.00420368356873615, "phrase": "robot_setup"}, {"score": 0.003916098498242888, "phrase": "audio-visual_data"}, {"score": 0.003735349093835257, "phrase": "evolving_human-robot_relationship"}, {"score": 0.003479692058963528, "phrase": "human-robot_interaction"}, {"score": 0.0032414759269196493, "phrase": "robot's_function"}, {"score": 0.002966438503447793, "phrase": "user's_home"}, {"score": 0.0026986685585382347, "phrase": "exercise_monitor"}, {"score": 0.002651213849567608, "phrase": "older_people"}, {"score": 0.0025892330566358503, "phrase": "healthy_lifestyle"}, {"score": 0.0024842242921857705, "phrase": "increased_engagement"}, {"score": 0.0023694065215394593, "phrase": "increased_use"}, {"score": 0.0022201273900989416, "phrase": "sera_robot_setup"}, {"score": 0.0021049977753042253, "phrase": "particular_reference"}], "paper_keywords": [""], "paper_abstract": "The Social Engagement with Robots and Agents (SERA) project conducts research into making robots and agents more sociable. A robot setup was deployed for ten days in the homes of users to generate audio-visual data for analysis on the nature of the evolving human-robot relationship. This paper details the setup developed to provide opportunities for human-robot interaction and yield the quantity of data required for analysis. The robot's function was not to exist as part of an experiment but to exist in the user's home, fulfilling a role in his/her existing routine to ensure interaction. The system acted as an exercise monitor to encourage older people to lead a healthy lifestyle. The assumption made was that increased engagement and usefulness of the system leads to increased use, providing more data for analysis. This paper describes the SERA robot setup for each of three iterations of deployment, with particular reference to maximizing the amount of data collected.", "paper_title": "DESCRIBING THE INTERACTIVE DOMESTIC ROBOT SETUP FOR THE SERA PROJECT", "paper_id": "WOS:000292640300002"}