{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "kecsa"}, {"score": 0.010612387000973441, "phrase": "knowledge-based_and_empirical_combined_scoring_algorithm"}, {"score": 0.00751908741633109, "phrase": "kecsa."}, {"score": 0.00469159356595623, "phrase": "protein-ligand_interactions"}, {"score": 0.004591202593942391, "phrase": "novel_knowledge-based_protein-ligand_scoring_function"}, {"score": 0.004435006247087171, "phrase": "reference_state"}, {"score": 0.004302680891412643, "phrase": "statistical_potential"}, {"score": 0.004120435930514554, "phrase": "lj_potential_parameters"}, {"score": 0.004049709080817396, "phrase": "protein-ligand_complex_structural_data"}, {"score": 0.0033762956164519286, "phrase": "first_validation"}, {"score": 0.003177615880037735, "phrase": "second_validation_benchmark_suite"}, {"score": 0.0027068691342344545, "phrase": "improved_performance"}, {"score": 0.0026718978608934077, "phrase": "test_sets"}, {"score": 0.0025364615261136655, "phrase": "root_mean_square_error"}, {"score": 0.0024821378044678297, "phrase": "lisa"}, {"score": 0.0024393978073660757, "phrase": "similar_performance"}, {"score": 0.0024078737745407614, "phrase": "correlation_coefficient"}, {"score": 0.002387083859537412, "phrase": "kendall_tau"}, {"score": 0.0022857899334246946, "phrase": "small_test_sets"}, {"score": 0.0021233361369222344, "phrase": "subtle_changes"}, {"score": 0.0021049977753042253, "phrase": "ligand_structure"}], "paper_keywords": [""], "paper_abstract": "We describe a novel knowledge-based protein-ligand scoring function that employs a new definition for the reference state, allowing us to relate a statistical potential to a Lennard-Jones (LJ) potential. In this way, the LJ potential parameters were generated from protein-ligand complex structural data contained in the Protein Databank (PDB). Forty-nine (49) types of atomic pairwise interactions were derived using this method, which we call the knowledge-based and empirical combined scoring algorithm (KECSA). Two validation benchmarks were introduced to test the performance of KECSA. The first validation benchmark included two test sets that address the training set and enthalpy/entropy of KECSA. The second validation benchmark suite included two large-scale and five small-scale test sets, to compare the reproducibility of KECSA, with respect to two empirical score functions previously developed in our laboratory (LISA and LISA+), as well as to other well-known scoring methods. Validation results illustrate that KECSA shows improved performance in all test sets when compared with other scoring methods, especially in its ability to minimize the root mean square error (RMSE). LISA and LISA+ displayed similar performance using the correlation coefficient and Kendall tau as the metric of quality for some of the small test sets. Further pathways for improvement are discussed for which would allow KECSA to be more sensitive to subtle changes in ligand structure.", "paper_title": "Development of the Knowledge-Based and Empirical Combined Scoring Algorithm (KECSA) To Score Protein-Ligand Interactions", "paper_id": "WOS:000319650800007"}