{"auto_keywords": [{"score": 0.03690455333353583, "phrase": "meaningful_sentences"}, {"score": 0.03264800298277409, "phrase": "chinese_characters"}, {"score": 0.013433087670939075, "phrase": "educational_learning"}, {"score": 0.013092282854886261, "phrase": "psychological_cognition"}, {"score": 0.00481495049065317, "phrase": "information_mass"}, {"score": 0.004737579882204798, "phrase": "chinese_word_strings"}, {"score": 0.004661446705304497, "phrase": "cognitive_information_difficulty"}, {"score": 0.004512814529823301, "phrase": "psychological_level"}, {"score": 0.004298666679374568, "phrase": "chinese_sentences"}, {"score": 0.004175066536037121, "phrase": "information_difficulty"}, {"score": 0.004041879818641576, "phrase": "essential_issue"}, {"score": 0.0034704317267505035, "phrase": "information_quantity"}, {"score": 0.002941100683384888, "phrase": "significant_linear_relation"}, {"score": 0.002420516633871837, "phrase": "qualitative_regression_model"}, {"score": 0.0023054252458274823, "phrase": "reasonable_explanation"}, {"score": 0.00221729614713299, "phrase": "linear_regression"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Chinese word strings", " Information Mass", " index of cognitive information difficulty"], "paper_abstract": "The index of cognitive information difficulty (D-info) are measured at the psychological level for the application of learning and design when people are reading and recognizing the Chinese sentences; thus, how to effectively monitor the information difficulty for the purpose of educational learning and design becomes an essential issue. The psychological cognition of the difficulty of sentences experiment is planning to test and verify which one is better of Information Mass (M-info) and Information Quantity. There has been proof that it is suitable for using the concept Of Minfo in meaningful sentences instead of Information Quantity. We can also measure psychological cognition of the difficulty of sentences from subjects. From our study, we have found that the concept of M-info not only can be use to measure the D-info of Chinese characters but also can be use to measure the D-info of meaningful sentences. There is significant linear relation between D-info of sentences and logarithm of M-info. In other words, we can infer that the D-info of subjects by applying the concept of M-info. The concept of M-info not only can be use to measure the D-info of Chinese characters but also can be use to measure the D-info of meaningful sentences. The authors also establish the qualitative regression model \"D-info = a + b*log(2)(M-info)\". The concept to apply M-info gives reasonable explanation to the difficulty of Chinese characters and sentences and the model of linear regression serves the function for the reference of educational learning and design. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Applying the concept of Information Mass in cognizing difficulty of Chinese word strings", "paper_id": "WOS:000255806000006"}