{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "threshold_circuits"}, {"score": 0.005503990714572497, "phrase": "circuit_states"}, {"score": 0.004719816332271661, "phrase": "threshold_gates"}, {"score": 0.004654779963297256, "phrase": "polynomial_size_threshold_circuit"}, {"score": 0.004517055580214742, "phrase": "simplified_models"}, {"score": 0.004481132747216135, "phrase": "neural_circuits"}, {"score": 0.004104269996872886, "phrase": "specific_computational_task"}, {"score": 0.0038043055953253047, "phrase": "second_threshold_gate_fires"}, {"score": 0.003255295296893174, "phrase": "neuronal_circuits"}, {"score": 0.003190878119415192, "phrase": "particular_complexity_measures"}, {"score": 0.0030292784088033838, "phrase": "previous_threshold_circuit_constructions"}, {"score": 0.0029339151044984134, "phrase": "new_complexity_measure"}, {"score": 0.00288736193515505, "phrase": "energy_complexity"}, {"score": 0.0028076592725295646, "phrase": "sparse_activity"}, {"score": 0.0026975894491357176, "phrase": "polynomial_size"}, {"score": 0.0024117603727471654, "phrase": "novel_circuit_complexity_measure"}, {"score": 0.002262209824105154, "phrase": "circuit_complexity"}], "paper_keywords": [""], "paper_abstract": "Circuits composed of threshold gates (McCulloch-Pitts neurons, or perceptrons) are simplified models of neural circuits with the advantage that they are theoretically more tractable than their biological counterparts. However, when such threshold circuits are designed to perform a specific computational task they usually differ in one important respect from computations in the brain: they require very high activity. On average every second threshold gate fires (sets a \"I\" as output) during a computation. By contrast, the activity of neurons in the brain is much more sparse, with only about 1% of neurons firing. This mismatch between threshold and neuronal circuits is due to the particular complexity measures (circuit size and circuit depth) that have been minimized in previous threshold circuit constructions. In this article we investigate a new complexity measure for threshold circuits, energy complexity, whose minimization yields computations with sparse activity. We prove that all computations by threshold circuits of polynomial size with entropy O(log n) can be restructured so that their energy complexity is reduced to a level near the entropy of circuit states. This entropy of circuit states is a novel circuit complexity measure, which is of interest not only in the context of threshold circuits, but for circuit complexity in general. As an example of how this measure can be applied we show that any polynomial size threshold circuit with entropy O(log n) can be simulated by a polynomial size threshold circuit of depth 3.", "paper_title": "Energy complexity and entropy of threshold circuits", "paper_id": "WOS:000239474500055"}