{"auto_keywords": [{"score": 0.0475596004207704, "phrase": "thermodynamic_data"}, {"score": 0.04113215009933039, "phrase": "unmeasured_reactions"}, {"score": 0.004686688155058031, "phrase": "reaction_directionality"}, {"score": 0.004611369021812453, "phrase": "great_efforts"}, {"score": 0.004488505301335364, "phrase": "limited_coverage"}, {"score": 0.004116823963855969, "phrase": "multiple_sources"}, {"score": 0.003964007795174772, "phrase": "gibbs_energies"}, {"score": 0.003675120438902734, "phrase": "cellular_conditions"}, {"score": 0.0034442607586033657, "phrase": "linear_regression"}, {"score": 0.0031759067385562553, "phrase": "compound_formation_energies"}, {"score": 0.0030414140732789186, "phrase": "group_contribution_method"}, {"score": 0.0029763124376934787, "phrase": "high_coverage"}, {"score": 0.002865710140187219, "phrase": "continuous_index"}, {"score": 0.002656650588033728, "phrase": "characteristic_physiological_range"}, {"score": 0.0024761702541879213, "phrase": "escherichia_coli's_metabolism"}, {"score": 0.002410058288617039, "phrase": "new_tools"}, {"score": 0.002333044307949414, "phrase": "thermodynamic-based_models"}, {"score": 0.0022830706430588482, "phrase": "non-standard_ph"}, {"score": 0.0022101055924375725, "phrase": "reversibility_index"}, {"score": 0.0021049977753042253, "phrase": "physiological_conditions"}], "paper_keywords": [""], "paper_abstract": "Motivation: The laws of thermodynamics describe a direct, quantitative relationship between metabolite concentrations and reaction directionality. Despite great efforts, thermodynamic data suffers from limited coverage, scattered accessibility and nonstandard annotations. We present a framework for unifying thermodynamic data from multiple sources and demonstrate two new techniques for extrapolating the Gibbs energies of unmeasured reactions and conditions. Results: Both methods account for changes in cellular conditions (pH, ionic strength, etc.) by using linear regression over the delta G(degrees) of pseudoisomers and reactions. The Pseudoisomeric Reactant Contribution method systematically infers compound formation energies using measured K' and pK(a) data. The Pseudoisomeric Group Contribution method extends the group contribution method and achieves a high coverage of unmeasured reactions. We define a continuous index that predicts the reversibility of a reaction under a given physiological concentration range. In the characteristic physiological range 3 mu M-3mM, we find that roughly half of the reactions in Escherichia coli's metabolism are reversible. These new tools can increase the accuracy of thermodynamic-based models, especially in non-standard pH and ionic strengths. The reversibility index can help modelers decide which reactions are reversible in physiological conditions.", "paper_title": "An integrated open framework for thermodynamics of reactions that combines accuracy and coverage", "paper_id": "WOS:000306686400013"}