{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "regression_test_case_prioritization"}, {"score": 0.04580340075872882, "phrase": "test_cases"}, {"score": 0.04541485776191827, "phrase": "regression_testing"}, {"score": 0.039271912623931836, "phrase": "greedy_algorithms"}, {"score": 0.004544770921520536, "phrase": "insufficient_resources"}, {"score": 0.004232875294230749, "phrase": "test_case"}, {"score": 0.00421410521089045, "phrase": "prioritization_techniques"}, {"score": 0.003838531755488468, "phrase": "previous_work"}, {"score": 0.003543273649210823, "phrase": "suboptimal_results"}, {"score": 0.003374094774912924, "phrase": "search_space"}, {"score": 0.003073154478201771, "phrase": "empirical_study"}, {"score": 0.0026771333996253783, "phrase": "fitness_metric"}, {"score": 0.002629889135655667, "phrase": "landscape_modality"}, {"score": 0.0025042115651986332, "phrase": "empirical_results"}, {"score": 0.002482013330276732, "phrase": "previous_results"}, {"score": 0.002352886041381761, "phrase": "regression_testing_search_space"}, {"score": 0.002220551141101661, "phrase": "genetic_algorithms"}, {"score": 0.0021716540012278744, "phrase": "greedy_approaches"}, {"score": 0.0021049977753042253, "phrase": "multimodal_nature"}], "paper_keywords": ["search techniques", " test case prioritization", " regression testing"], "paper_abstract": "Regression testing is an expensive, but important, process. Unfortunately, there may be insufficient resources to allow for the reexecution of all test cases during regression testing. In this situation, test case prioritization techniques aim to improve the effectiveness of regression testing by ordering the test cases so that the most beneficial are executed first. Previous work on regression test case prioritization has focused on Greedy Algorithms. However, it is known that these algorithms may produce suboptimal results because they may construct results that denote only local minima within the search space. By contrast, metaheuristic and evolutionary search algorithms aim to avoid such problems. This paper presents results from an empirical study of the application of several greedy, metaheuristic, and evolutionary search algorithms to six programs, ranging from 374 to 11,148 lines of code for three choices of fitness metric. The paper addresses the problems of choice of fitness metric, characterization of landscape modality, and determination of the most suitable search technique to apply. The empirical results replicate previous results concerning Greedy Algorithms. They shed light on the nature of the regression testing search space, indicating that it is multimodal. The results also show that Genetic Algorithms perform well, although Greedy approaches are surprisingly effective, given the multimodal nature of the landscape.", "paper_title": "Search algorithms for regression test case prioritization", "paper_id": "WOS:000244530000002"}