{"auto_keywords": [{"score": 0.03947447987613366, "phrase": "ss"}, {"score": 0.010612148859191073, "phrase": "simulator_sickness"}, {"score": 0.006555543325069431, "phrase": "intersession_intervals"}, {"score": 0.004669845451682529, "phrase": "head-mounted_display"}, {"score": 0.004247112325475329, "phrase": "hmd._an_object_search_task"}, {"score": 0.0037231102027070724, "phrase": "duration_exposure"}, {"score": 0.0035668128900149814, "phrase": "first_experimental_session"}, {"score": 0.0032336801561165113, "phrase": "repeated_exposure"}, {"score": 0.0032040860021574193, "phrase": "sickening_stimulus"}, {"score": 0.003126481516783286, "phrase": "delay_effects"}, {"score": 0.0030321057387540963, "phrase": "second_experiment"}, {"score": 0.0030043508031729277, "phrase": "increased_intersession_interval"}, {"score": 0.002585266023089103, "phrase": "exposure_duration"}, {"score": 0.002538131851615233, "phrase": "repetitive_head_movements"}, {"score": 0.0024842251551010055, "phrase": "ss."}, {"score": 0.0023871221933990192, "phrase": "motion_sickness_stimuli"}, {"score": 0.002293806844411685, "phrase": "hmd_ves"}, {"score": 0.002163930783583212, "phrase": "causal_factor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Simulator sickness", " Delay", " Lag", " Virtual environments", " Head mounted displays"], "paper_abstract": "The experience of simulator sickness (SS) during head-mounted display (HMD) exposure continues to be a problem. The aim of these two experiments was to examine the effect of delay on SS while viewing a real, live video scene via an HMD. An object search task was performed in both experiments. Experiment 1 examined 0 and 200 ms of delay and Experiment 2 examined 0,145, and 300 ms of delay. SS did not differ as a function of delay. However, SS increased as duration exposure increased in both experiments. In Experiment 1, SS was greater during the first experimental session than the second. SS did not differ between those who donned an HMD and a No HMD control condition in Experiment 2. It is possible that this is due to adaptation to repeated exposure to the sickening stimulus. This adaptation could have confounded the delay effects from Experiment 1. For this reason, a second experiment with an increased intersession interval was conducted. Intersession intervals for Experiment 2 were increased to 11-14 days from 7 days in Experiment 1. However, no effect of delay or session was found in Experiment 2. These results suggested that SS does not increase as a function of delay, but exposure duration increases SS. Also, performing repetitive head movements alone may have elicited symptoms of SS. As reported by other researchers, it appears that adaptation can occur to motion sickness stimuli with intersession intervals of up to 7 days, but not with 11-14 days. Other characteristics of HMD VEs need to be examined because SS occurs and delay does not appear to be as strong of a causal factor as once thought. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "The effects of display delay on simulator sickness", "paper_id": "WOS:000296311900003"}