{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "open_problem"}, {"score": 0.048231156244864744, "phrase": "hyperplane_arrangements"}, {"score": 0.033382910966113025, "phrase": "center_transversal_theorem"}, {"score": 0.004777214679969785, "phrase": "graph_drawing"}, {"score": 0.004539005582217305, "phrase": "ham-sandwich_cut_theorem"}, {"score": 0.00414616342377235, "phrase": "line_sets"}, {"score": 0.0037133478610481994, "phrase": "centerpoint_theorem"}, {"score": 0.00320970209394799, "phrase": "higher_dimension"}, {"score": 0.002426137929553722, "phrase": "n_labeled_lines"}, {"score": 0.0023694065215394593, "phrase": "n-vertex_labeled_planar_graphs"}, {"score": 0.0023139986108451946, "phrase": "main_result"}, {"score": 0.0022070310530794097, "phrase": "easy_consequence"}], "paper_keywords": [""], "paper_abstract": "Motivated by an open problem from graph drawing, we study several partitioning problems for line and hyperplane arrangements. We prove a ham-sandwich cut theorem: given two sets of n lines in a\"e(2), there is a line a\"\" such that in both line sets, for both halfplanes delimited by a\"\", there are lines which pairwise intersect in that halfplane, and this bound is tight; a centerpoint theorem: for any set of n lines there is a point such that for any halfplane containing that point there are of the lines which pairwise intersect in that halfplane. We generalize those results in higher dimension and obtain a center transversal theorem, a same-type lemma, and a positive portion ErdAs-Szekeres theorem for hyperplane arrangements. This is done by formulating a generalization of the center transversal theorem which applies to set functions that are much more general than measures. Back to graph drawing (and in the plane), we completely solve the open problem that motivated our search: there is no set of n labeled lines that are universal for all n-vertex labeled planar graphs. In contrast, the main result by Pach and Toth (J. Graph Theory 46(1):39-47, 2004), has, as an easy consequence, that every set of n (unlabeled) lines is universal for all n-vertex (unlabeled) planar graphs.", "paper_title": "A Center Transversal Theorem for Hyperplanes and Applications to Graph Drawing", "paper_id": "WOS:000313438500005"}