{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_differential_equations"}, {"score": 0.00477513738640734, "phrase": "current_trends"}, {"score": 0.004735651915966323, "phrase": "massively_parallel_computing_systems"}, {"score": 0.004619134710069517, "phrase": "processing_elements"}, {"score": 0.0043401761815767, "phrase": "known_problem"}, {"score": 0.00402748353567517, "phrase": "load_imbalances"}, {"score": 0.00396110232316167, "phrase": "extreme_levels"}, {"score": 0.003585089792133518, "phrase": "common_finite_difference_schemes"}, {"score": 0.0032717489668326275, "phrase": "messages_status"}, {"score": 0.002948689937518561, "phrase": "message_arrivals"}, {"score": 0.00288800021194675, "phrase": "random_processes"}, {"score": 0.0027473784878300133, "phrase": "statistical_framework"}, {"score": 0.0027020387992490367, "phrase": "average_errors"}, {"score": 0.002591927716261631, "phrase": "original_scheme"}, {"score": 0.0023948981440134478, "phrase": "computing_system"}, {"score": 0.002268769196700254, "phrase": "new_schemes"}, {"score": 0.0021944684609599245, "phrase": "analytical_results"}, {"score": 0.002158233639156017, "phrase": "numerical_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Asynchronous schemes", " Partial differential equations", " Massive computations"], "paper_abstract": "Current trends in massively parallel computing systems suggest that the number of processing elements (PEs) used in simulations will continue to grow over time. A known problem in this context is the overhead associated with communication and/or synchronization between PEs as well as idling due to load imbalances. Simulation at extreme levels of parallelism will then require an elimination, or at least a tight control of these overheads. In this work, we present an analysis of common finite difference schemes for partial differential equations (PDEs) when no synchronization between PEs is enforced. PEs are allowed to continue computations regardless of messages status and are thus asynchronous. We show that while stability is conserved when these schemes are used asynchronously, accuracy is greatly degraded. Since message arrivals at PEs are essentially random processes, so is the behavior of the error. Within a statistical framework we show that average errors drop always to first-order regardless of the original scheme. The value of the error is found to depend on both grid spacing as well as characteristics of the computing system including number of processors and statistics of the delays. We propose new schemes that are robust to asynchrony. The analytical results are compared against numerical simulations. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Asynchronous finite-difference schemes for partial differential equations", "paper_id": "WOS:000340335800020"}