{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "road_networks"}, {"score": 0.03772836659635984, "phrase": "safe_region"}, {"score": 0.008428164573242016, "phrase": "safe_exit_points"}, {"score": 0.007014244134709397, "phrase": "safe_exit_point"}, {"score": 0.005281256270562715, "phrase": "communication_costs"}, {"score": 0.004764542405129454, "phrase": "query_processing"}, {"score": 0.004068510313497539, "phrase": "new_algorithm"}, {"score": 0.0037594599958631404, "phrase": "moving_nearest_neighbor"}, {"score": 0.0034193226278107346, "phrase": "query_result"}, {"score": 0.0024272350606639147, "phrase": "server_processing_costs"}, {"score": 0.0022904032758108775, "phrase": "extensive_experimental_results"}, {"score": 0.002219040041886641, "phrase": "conventional_algorithm"}, {"score": 0.0021049977753042253, "phrase": "computation_costs"}], "paper_keywords": ["Continuous monitoring", " nearest neighbor query", " safe exit algorithm", " road network"], "paper_abstract": "Query processing in road networks has been studied extensively in recent years. However, the processing of moving queries in road networks has received little attention. In this paper, we introduce a new algorithm called the Safe Exit Algorithm (SEA), which can efficiently compute the safe exit points of a moving nearest neighbor (NN) query on road networks. The safe region of a query is an area where the query result remains unchanged, provided that the query remains inside the safe region At each safe exit point, the safe region of a query and its non-safe region meet so that a set of safe exit points represents the border of the safe region. Before reaching a safe exit point, the client (query object) does not have to request the server to re-evaluate the query This significantly reduces the server processing costs and the communication costs between the server and moving clients. Extensive experimental results show that SEA outperforms a conventional algorithm by up to two orders of magnitude in terms of communication costs and computation costs", "paper_title": "A safe exit algorithm for continuous nearest neighbor monitoring in road networks", "paper_id": "WOS:000315831500003"}