{"auto_keywords": [{"score": 0.012113242854921052, "phrase": "distance_constraint"}, {"score": 0.00481495049065317, "phrase": "frequently_occurring_situation"}, {"score": 0.004610809404212932, "phrase": "classical_notion"}, {"score": 0.004568198442824687, "phrase": "functional_dependency"}, {"score": 0.0045119929871912405, "phrase": "integrity_constraint"}, {"score": 0.004293972451176702, "phrase": "differential_dependency"}, {"score": 0.00418892838079239, "phrase": "recent_article"}, {"score": 0.004124613390448671, "phrase": "song"}, {"score": 0.004099281028267531, "phrase": "chen"}, {"score": 0.0028704174214048937, "phrase": "consistency_problem"}, {"score": 0.0028087949095629955, "phrase": "relation_instance"}, {"score": 0.0027230443042630882, "phrase": "implication_problem"}, {"score": 0.0024429654627197393, "phrase": "detailed_analysis"}, {"score": 0.0023246873451701995, "phrase": "almost_every_claimed_result"}, {"score": 0.0022747539135765204, "phrase": "fundamental_errors"}, {"score": 0.002178074693316872, "phrase": "claimed_results"}, {"score": 0.0021379062257004698, "phrase": "corrected_proofs"}], "paper_keywords": ["Design", " Management", " Theory", " Database", " integrity constraint", " consistency", " logical implication"], "paper_abstract": "To address the frequently occurring situation where data is inexact or imprecise, a number of extensions to the classical notion of a functional dependency (FD) integrity constraint have been proposed in recent years. One of these extensions is the notion of a differential dependency (DD), introduced in the recent article \"Differential Dependencies: Reasoning and Discovery\" by Song and Chen in the March 2011 edition of this journal. A DD generalises the notion of an FD by requiring only that the values of the attribute from the RHS of the DD satisfy a distance constraint whenever the values of attributes from the LHS of the DD satisfy a distance constraint. In contrast, an FD requires that the values from the attributes in the RHS of an FD be equal whenever the values of the attributes from the LHS of the FD are equal. The article \"Differential Dependencies: Reasoning and Discovery\" investigated a number of aspects of DDs, the most important of which, since they form the basis for the other topics investigated, were the consistency problem (determining whether there exists a relation instance that satisfies a set of DDs) and the implication problem (determining whether a set of DDs logically implies another DD). Concerning these problems, a number of results were claimed in \"Differential Dependencies: Reasoning and Discovery\". In this article we conduct a detailed analysis of the correctness of these results. The outcomes of our analysis are that, for almost every claimed result, we show there are either fundamental errors in the proof or the result is false. For some of the claimed results we are able to provide corrected proofs, but for other results their correctness remains open.", "paper_title": "Differential Dependencies: Reasoning and Discovery Revisited", "paper_id": "WOS:000357269900008"}