{"auto_keywords": [{"score": 0.049210350820054226, "phrase": "boundary_estimation"}, {"score": 0.014328830632743561, "phrase": "field_value"}, {"score": 0.00481495049065317, "phrase": "sensory_data_boundary_estimation"}, {"score": 0.0047468516620285525, "phrase": "collaborating_sensors"}, {"score": 0.004689244718732108, "phrase": "important_applications"}, {"score": 0.004641770842098217, "phrase": "environmental_monitoring"}, {"score": 0.00462291551375938, "phrase": "disaster_management"}, {"score": 0.0044114827274376305, "phrase": "sharp_change"}, {"score": 0.004218258903946393, "phrase": "field_values"}, {"score": 0.004108066884382925, "phrase": "hazardous_concentration"}, {"score": 0.004083047821338868, "phrase": "pollutant_spill"}, {"score": 0.004066452808488727, "phrase": "frontal_boundary"}, {"score": 0.004041686156098498, "phrase": "forest_fire"}, {"score": 0.003984479976118357, "phrase": "recent_advances"}, {"score": 0.003944112858235306, "phrase": "embedded_sensor_devices"}, {"score": 0.0037027728311825156, "phrase": "physical_phenomena"}, {"score": 0.003584025547693836, "phrase": "spatial_spread"}, {"score": 0.0033852767910317032, "phrase": "main_challenge"}, {"score": 0.0031522185379771056, "phrase": "sensory_data"}, {"score": 0.003082328706337005, "phrase": "sensor_network"}, {"score": 0.0029591905182252557, "phrase": "comprehensive_survey"}, {"score": 0.002661505979247721, "phrase": "entire_boundary"}, {"score": 0.002398583143633569, "phrase": "localized_estimation"}, {"score": 0.002316832571794284, "phrase": "mobile_sensors"}, {"score": 0.0022378620428620782, "phrase": "current_state"}, {"score": 0.00220163445285539, "phrase": "open_research_problems"}, {"score": 0.0021527751070437914, "phrase": "promising_solutions"}, {"score": 0.0021440085452713057, "phrase": "real-world_boundary_estimation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Boundary estimation", " Boundary tracking", " Boundary covering", " Wireless sensor networks", " Mobile sensors", " Contour covering", " Contour estimation"], "paper_abstract": "Boundary estimation and tracking have important applications in the areas of environmental monitoring and disaster management. A boundary separates two regions of interest in a phenomenon. It can be visualized as an edge if there is a sharp change in the field value between the two regions or alternatively, as a contour with a field value f = tau separating two regions with field values f > tau and f < tau. Examples include contours/boundaries of hazardous concentration in a pollutant spill, frontal boundary of a forest fire, isotherms, isohalines etc. Recent advances in the area of embedded sensor devices and robotics have led to deployments of networks of sensors capable of sensing, computing, communication and mobility. They are used to estimate the boundaries of interest in physical phenomena, monitor or track them over time and also in some cases, mitigate the spatial spread of the phenomena. Since these sensors work autonomously in the environment, minimizing the energy consumed while maximizing the accuracy of estimation or tracking is the main challenge for algorithms for boundary estimation and tracking. Several algorithms with these objectives have been proposed in the literature. In this work, we focus on the algorithms that estimate and cover boundaries found in the sensory data in a field and not the topological boundary of the sensor network per se, which is beyond the scope of this paper. Here, our objective is to provide a comprehensive survey of the algorithms for boundary estimation and tracking by providing a taxonomy based on two broad categories (i) Boundary estimation and tracking, where the sensors estimate the boundary without physically covering the boundary and (ii) Boundary covering - where the sensors not only predict the location and estimate the entire boundary but also physically cover the boundary by surrounding and bounding it. We further classify the techniques based on (a) sensing capabilities - in situ, range or remote sensing (b) movement capabilities - static or mobile sensors and (c) boundary type - static or dynamic and (d) type of estimation - field estimation where the entire field is sampled to search for contours and localized estimation where sampling is done near the boundary and (e) different types of mobility models in the case of mobile sensors. We believe that such a survey has not been performed before. By capturing and classifying the current state-of-the-art and identifying open research problems, we hope to ignite interest and stimulate efforts towards promising solutions for real-world boundary estimation and tracking problems. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A survey of sensory data boundary estimation, covering and tracking techniques using collaborating sensors", "paper_id": "WOS:000304062600004"}