{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "content-based_search"}, {"score": 0.044191680091296315, "phrase": "global_knowledge"}, {"score": 0.035159327245075936, "phrase": "chord_ring"}, {"score": 0.012657895387285553, "phrase": "bottleneck_problem"}, {"score": 0.01021708865712065, "phrase": "index_terms"}, {"score": 0.0046993598473345395, "phrase": "major_challenges"}, {"score": 0.0046004861111734185, "phrase": "file_sharing_systems"}, {"score": 0.004073948834684065, "phrase": "popular_terms"}, {"score": 0.004049257973730703, "phrase": "query_processing"}, {"score": 0.0037873013080596137, "phrase": "high_visiting_load"}, {"score": 0.0037529131348732715, "phrase": "global_knowledge_maintainers"}, {"score": 0.0036074566790283633, "phrase": "novel_adaptive_indexing_approach"}, {"score": 0.003373984423727724, "phrase": "adaptive_indexing_structure"}, {"score": 0.0033029038236817372, "phrase": "balanced_tree"}, {"score": 0.0028802818629647614, "phrase": "important_terms"}, {"score": 0.002644995764097807, "phrase": "higher_level_nodes"}, {"score": 0.0024288830311280573, "phrase": "term_aggregation"}, {"score": 0.002406799309495983, "phrase": "indexing_cost"}, {"score": 0.0023560464785206095, "phrase": "tree_structure"}, {"score": 0.0023133947578541977, "phrase": "efficient_search_algorithm"}, {"score": 0.0022101055924375725, "phrase": "wikipedia_datasets"}, {"score": 0.0021569129153653777, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-Peer computing", " Adaptive indexing", " Term aggregation and classification", " Information retrieval", " Content-based search"], "paper_abstract": "One of the major challenges in Peer-to-Peer (P2P) file sharing systems is to support content-based search. Although there have been some proposals to address this challenge, they share the same weakness of using either servers or super-peers to keep global knowledge, which is required to identify importance of terms to avoid popular terms in query processing. As a result, they are not scalable and are prone to the bottleneck problem, which is caused by the high visiting load at the global knowledge maintainers. To that end, in this paper, we propose a novel adaptive indexing approach for content-based search in P2P systems, which can identify importance of terms without keeping global knowledge. Our method is based on an adaptive indexing structure that combines a Chord ring and a balanced tree. The tree is used to aggregate and classify terms adaptively, while the Chord ring is used to index terms of nodes in the tree. Specifically, at each node of the tree, the system classifies terms as either important or unimportant. Important terms, which can distinguish the node from its neighbor nodes, are indexed in the Chord ring. On the other hand, unimportant terms, which are either popular or rare terms, are aggregated to higher level nodes. Such classification enables the system to process queries on the fly without the need for global knowledge. Besides, compared to the methods that index terms separately, term aggregation reduces the indexing cost significantly. Taking advantage of the tree structure, we also develop an efficient search algorithm to tackle the bottleneck problem near the root. Finally, our extensive experiments on both benchmark and Wikipedia datasets validated the effectiveness and efficiency of the proposed method. (c) 2008 Published by Elsevier B.V.", "paper_title": "Adaptive indexing for content-based search in P2P systems", "paper_id": "WOS:000261259000003"}