{"auto_keywords": [{"score": 0.009581365015205977, "phrase": "malicious_node"}, {"score": 0.007820581072908252, "phrase": "bcn-sec"}, {"score": 0.004662427600500598, "phrase": "time-critical_applications"}, {"score": 0.004612662942073808, "phrase": "wireless_sensor_networks"}, {"score": 0.004278807087784626, "phrase": "gts_management_scheme's_security_mechanisms"}, {"score": 0.004011867299107537, "phrase": "existing_techniques"}, {"score": 0.0036815763368083197, "phrase": "insider_attacks"}, {"score": 0.003034158379493625, "phrase": "tmote_sky"}, {"score": 0.002985631781749091, "phrase": "wireless_sensor_nodes"}, {"score": 0.0026384167183586015, "phrase": "beacon_frames"}, {"score": 0.0022453451864218477, "phrase": "control_frames"}], "paper_keywords": ["Beacon-enabled 802.15.4", " Insider attacks", " Media access control", " MAC misbehavior", " Time-critical applications", " Wireless sensor networks"], "paper_abstract": "The IEEE 802.15.4 standard has attracted time-critical applications in wireless sensor networks because of its beacon-enabled mode and guaranteed timeslots (GTSs). However, the GTS management scheme's security mechanisms still leave the 802.15.4 medium access control vulnerable to attacks. Further, the existing techniques in the literature for securing 802.15.4 networks either focus on nonbeacon-enabled 802.15.4 networks or cannot defend against insider attacks for beacon-enabled 802.15.4 networks. In this paper, we illustrate this by demonstrating attacks on the availability and integrity of the beacon-enabled 802.15.4 network. To confirm the validity of the attacks, we implement the attacks using Tmote Sky motes for wireless sensor nodes, where the malicious node is deployed as an inside attacker. We show that the malicious node can freely exploit information retrieved from the beacon frames to compromise the integrity and availability of the network. To defend against these attacks, we present BCN-Sec, a protocol that ensures the integrity of data and control frames in beacon-enabled 802.15.4 networks. We implement BCN-Sec, and show its efficacy during various attacks.", "paper_title": "Attacking and securing beacon-enabled 802.15.4 networks", "paper_id": "WOS:000356096800007"}