{"auto_keywords": [{"score": 0.03856348556738523, "phrase": "historical_training_samples"}, {"score": 0.00481495049065317, "phrase": "automatic_anatomy_detection"}, {"score": 0.004671588539217021, "phrase": "novel_online_learning_method"}, {"score": 0.004578382275810468, "phrase": "anatomic_structures"}, {"score": 0.0045324756541157574, "phrase": "medical_images"}, {"score": 0.0044870272550540415, "phrase": "conventional_off-line_learning_methods"}, {"score": 0.004331501320993783, "phrase": "representative_samples"}, {"score": 0.003366233863411861, "phrase": "new_samples"}, {"score": 0.003105168935158648, "phrase": "off-line_approach"}, {"score": 0.0028933521924166287, "phrase": "online_learning_method"}, {"score": 0.0028498740197978006, "phrase": "grabner"}, {"score": 0.0028212480411144904, "phrase": "bischof"}, {"score": 0.0027929100418926725, "phrase": "ieee_computer_society_conference_on_computer_vision_and_pattern"}, {"score": 0.0023170054862555896, "phrase": "\"catastrophic_forgetting"}, {"score": 0.0022365262201954643, "phrase": "satisfactory_level"}, {"score": 0.0021807544600219216, "phrase": "enhanced_performance"}], "paper_keywords": ["Anatomy detection", " Online boosting", " Histogram", " Kalman filter"], "paper_abstract": "This paper presents a novel online learning method for automatically detecting anatomic structures in medical images. Conventional off-line learning methods require collecting a complete set of representative samples prior to training a detector. Once the detector is trained, its performance is fixed. To improve the performance, the detector must be completely retrained, demanding the maintenance of historical training samples. Our proposed online approach eliminates the need for storing historical training samples and is capable of continually improving performance with new samples. We evaluate our approach with three distinct thoracic structures, demonstrating that our approach yields performance competitive with the off-line approach. Furthermore, we investigate the properties of our proposed method in comparison with an online learning method suggested by Grabner and Bischof (IEEE Computer Society Conference on Computer Vision and Pattern Recognition 2006, vol. 1, pp. 260-267, 2006), which is the state of the art, indicating that our proposed method runs faster, offers more stability, improves handling of \"catastrophic forgetting\", and simultaneously achieves a satisfactory level of adaptability. The enhanced performance is attributed to our novel online learning structure coupled with more accurate weaker learners based on histograms.", "paper_title": "A novel online boosting algorithm for automatic anatomy detection", "paper_id": "WOS:000324499000004"}