{"auto_keywords": [{"score": 0.04360247103779728, "phrase": "global_trace"}, {"score": 0.00481495049065317, "phrase": "finite_state_machines_for_systems"}, {"score": 0.004596295252559861, "phrase": "state-based_systems"}, {"score": 0.004456044928556639, "phrase": "physically_distributed_interfaces"}, {"score": 0.0037769520261285872, "phrase": "observational_power"}, {"score": 0.003680587852807675, "phrase": "local_traces"}, {"score": 0.003441352119167824, "phrase": "previously_defined_implementation_relation"}, {"score": 0.0024971144603069006, "phrase": "input_sequences"}, {"score": 0.002471400498582011, "phrase": "length_k"}, {"score": 0.0021714122348552747, "phrase": "polynomial_time"}, {"score": 0.002105856840893994, "phrase": "np"}], "paper_keywords": ["D2.4: software engineering/software/program verification", " D2.5: software engineering/testing and debugging", " distributed systems", " finite state machine", " distributed test architecture"], "paper_abstract": "This paper concerns state-based systems that interact with their environment at physically distributed interfaces, called ports. When such a system is used a projection of the global trace, a local trace, is observed at each port. As a result the environment has reduced observational power: the set of local traces observed need not define the global trace that occurred. We consider the previously defined implementation relation (sic)s and prove that it is undecidable whether N (sic)s M and so it is also undecidable whether testing can distinguishing two states or FSMs. We also prove that a form of model-checking is undecidable when we have distributed observations and give conditions under which N (sic) M is decidable. We then consider implementation relation subset of(k)(s) that concerns input sequences of length k or less. If we place bounds on k and the number of ports then we can decide N (sic)(s)(k) M in polynomial time but otherwise this problem is NP-hard.", "paper_title": "Verifying and Comparing Finite State Machines for Systems that Have Distributed Interfaces", "paper_id": "WOS:000321221000015"}