{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "uncertain_knowledge"}, {"score": 0.004776297980616768, "phrase": "classical_supervised_learning"}, {"score": 0.00464343008299973, "phrase": "true_known_labels"}, {"score": 0.0045324756541157574, "phrase": "modeled_dataset"}, {"score": 0.004496080495247288, "phrase": "real_life"}, {"score": 0.0038728990904778678, "phrase": "knowledge_source"}, {"score": 0.003780286517897356, "phrase": "experimental_assessment"}, {"score": 0.003616189733352126, "phrase": "measurement_errors"}, {"score": 0.0035726811019151984, "phrase": "expert_knowledge"}, {"score": 0.003487222504700868, "phrase": "specialized_area"}, {"score": 0.003390092184270794, "phrase": "trustworthy_labels"}, {"score": 0.003282383509542342, "phrase": "partially_supervised_mixture_modeling"}, {"score": 0.0031271827534050493, "phrase": "r_package"}, {"score": 0.0027260525536580912, "phrase": "mixture_modeling"}, {"score": 0.0026932247685847246, "phrase": "real_data"}, {"score": 0.002545165985686468, "phrase": "modeling_variants"}, {"score": 0.0023381630439887184, "phrase": "different_component_numbers"}, {"score": 0.002227508035618043, "phrase": "artificial_dataset"}], "paper_keywords": ["mixture modeling", " semi-supervised modeling", " belief-based modeling", " soft-label modeling", " R"], "paper_abstract": "Classical supervised learning enjoys the luxury of accessing the true known labels for the observations in a modeled dataset. Real life, however, poses an abundance of problems, where the labels are only partially defined, i.e., are uncertain and given only for a subset of observations. Such partial labels can occur regardless of the knowledge source. For example, an experimental assessment of labels may have limited capacity and is prone to measurement errors. Also expert knowledge is often restricted to a specialized area and is thus unlikely to provide trustworthy labels for all observations in the dataset. Partially supervised mixture modeling is able to process such sparse and imprecise input. Here, we present an R package called bgmm, which implements two partially supervised mixture modeling methods: soft-label and belief-based modeling. For completeness, we equipped the package also with the functionality of unsupervised, semi-and fully supervised mixture modeling. On real data we present the usage of bgmm for basic model-fitting in all modeling variants. The package can be applied also to selection of the best-fitting from a set of models with different component numbers or constraints on their structures. This functionality is presented on an artificial dataset, which can be simulated in bgmm from a distribution defined by a given model.", "paper_title": "The R Package bgmm: Mixture Modeling with Uncertain Knowledge", "paper_id": "WOS:000303803800001"}