{"auto_keywords": [{"score": 0.03001331790039661, "phrase": "new_model"}, {"score": 0.00481495049065317, "phrase": "lecture_recording"}, {"score": 0.004604660067579427, "phrase": "ucf"}, {"score": 0.004428139418750855, "phrase": "distance_learning"}, {"score": 0.004211069233133584, "phrase": "florida_legislature"}, {"score": 0.0038725824361608243, "phrase": "engineering_education"}, {"score": 0.0037658881407605445, "phrase": "early_delivery_system"}, {"score": 0.0037449033166879874, "phrase": "utilized_video_tape"}, {"score": 0.003405472159599445, "phrase": "based_lecture_recording"}, {"score": 0.003367611042980526, "phrase": "delivery_system"}, {"score": 0.0031140747752837826, "phrase": "existing_recording_hardware"}, {"score": 0.0030282147475402736, "phrase": "system_launch"}, {"score": 0.0027535633837592597, "phrase": "engineering_lectures"}, {"score": 0.0025037596405075866, "phrase": "distance_education"}, {"score": 0.0023941575109692336, "phrase": "implementation_requirements"}, {"score": 0.0021049977753042253, "phrase": "new_system"}], "paper_keywords": ["distance learning", " lecture recording", " education"], "paper_abstract": "The College of Engineering and Computer Science at the University of Central Florida (UCF) has been a leader in distance learning for the last 25 years. This was initiated by the Florida legislature by the creation of the Florida Engineering Education Delivery System. The goal of this system was to promote engineering education in the State of Florida. The early delivery system utilized video tape's and transitioned to the internet in 2000. In spring 2007, the College of Engineering And Computer Science purchased a software based lecture recording and delivery system, Tegrity Campus 2.0. This system was used to completely replace all existing recording hardware and software. The system launch included 90 faculty delivering 100 courses to 2300 engineering students. This paper addresses a new model for recording and distributing engineering lectures on the internet. First, we describe our transition from the old to the new model for distance education. Second, a comparison of the implementation requirements, the advantages and disadvantages of both models are presented. Finally, in addition to any difficulties encountered while launching the new system and how they were solved.", "paper_title": "Distance education technology: New model for lecture recording and distribution", "paper_id": "WOS:000257602500001"}