{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "candidate_selection_algorithms"}, {"score": 0.015568434073667505, "phrase": "opportunistic_routing"}, {"score": 0.004323886831151445, "phrase": "multihop_wireless_networks"}, {"score": 0.0041579627441997, "phrase": "traditional_routing"}, {"score": 0.004017989546119125, "phrase": "pre-determined_paths"}, {"score": 0.003920891569777894, "phrase": "ordered_set"}, {"score": 0.00311510526624626, "phrase": "discrete_time_markov_chain"}, {"score": 0.002852256089630964, "phrase": "selected_group"}, {"score": 0.002598764579760562, "phrase": "high_computational_cost"}, {"score": 0.0024264776194357993, "phrase": "non-optimal_algorithms"}, {"score": 0.002344655708000408, "phrase": "fast_and_simple_or_candidate_selection_algorithms"}, {"score": 0.002276717177453959, "phrase": "dynamic_networks"}, {"score": 0.002232519579957707, "phrase": "candidates_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Wireless networks", " Opportunistic routing", " Performance modeling", " Markov chain", " Candidate selection algorithms"], "paper_abstract": "Opportunistic Routing (OR) has been investigated in recent years as a way to increase the performance of multihop wireless networks by exploiting its broadcast nature. In contrast to traditional routing, where traffic is sent along pre-determined paths, in OR an ordered set of candidates is selected for each next-hop. Upon each transmission, the candidates coordinate such that the most priority one receiving the packet actually forwards it. Most of the research in OR has been addressed to investigate candidate selection algorithms. In this paper we propose a discrete time Markov chain to assess the improvement that may be achieved using opportunistic routing. We use our model to compare a selected group of candidate selection algorithms that have been proposed in the literature. Our main conclusion is that optimality is obtained at a high computational cost, with a performance gain very similar to that of much simpler but non-optimal algorithms. Therefore, we conclude that fast and simple OR candidate selection algorithms may be preferable. in dynamic networks, where the candidates sets are likely to be updated frequently. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Modeling and comparison of candidate selection algorithms in opportunistic routing", "paper_id": "WOS:000294083900006"}