{"auto_keywords": [{"score": 0.04407953898448545, "phrase": "mel-frequency"}, {"score": 0.00481495049065317, "phrase": "mfcc-vq_approachfor"}, {"score": 0.004444921827311577, "phrase": "speech_recognition_system"}, {"score": 0.004386063799793622, "phrase": "tajweed_rule_checking_tool"}, {"score": 0.003737485125097945, "phrase": "proper_al-quran_recitation"}, {"score": 0.0030189426536422577, "phrase": "computationally_efficient_characteristics"}, {"score": 0.002861961643289598, "phrase": "mfcc-vq_proceduretodevelop"}, {"score": 0.0024545413637350765, "phrase": "tajweed_rule_checkingtoolperformance"}, {"score": 0.002265497060260791, "phrase": "speed_performance"}, {"score": 0.0021049977753042253, "phrase": "themel-frequencycepstral_coefficient"}], "paper_keywords": ["Speech Recognition", " Tajweed Recognition", " MFCC", " VQ"], "paper_abstract": "In this paper, we investigate the speech recognition system for Tajweed Rule Checking Tool. We propose a novel Mel-Frequency Cepstral Coefficient andVector Quantization (MFCC-VQ) hybridalgorithm to help students to learn and revise proper Al-Quran recitation by themselves. We describe a hybridMFCC-VQ architecture toautomatically point out the mismatch between the students'recitationsandthecorrect recitationverified by the expert. The vectoralgorithm is chosen due to its data reduction capabilities and computationally efficient characteristics. We illustrate our component model and describe the MFCC-VQ proceduretodevelop theTajweed Rule CheckingTool. Two features, i.e., a hybrid algorithm and solely Mel-Frequency Cepstral Coefficientare compared to investigate their effect on the Tajweed Rule CheckingToolperformance. Experiments arecarried out on a dataset to demonstrate that the speed performance of a hybrid MFCC-VQis86.928%, 94.495% and 64.683% faster than theMel-FrequencyCepstral Coefficient for male, female and children respectively.", "paper_title": "MFCC-VQ APPROACHFOR QALQALAH TAJWEED RULE CHECKING", "paper_id": "WOS:000346851800003"}