{"auto_keywords": [{"score": 0.043928859497319256, "phrase": "gwas"}, {"score": 0.00481495049065317, "phrase": "variant_effects"}, {"score": 0.004764542405129454, "phrase": "transcription_factor"}, {"score": 0.0047395356621991935, "phrase": "binding_sites"}, {"score": 0.0046164478775379105, "phrase": "functional_annotation"}, {"score": 0.004544127927346964, "phrase": "key_step"}, {"score": 0.00433386573276633, "phrase": "somatic_variation"}, {"score": 0.004243552607799184, "phrase": "genome-wide_association_studies"}, {"score": 0.00392125815948488, "phrase": "numerous_genetic_risk_variants"}, {"score": 0.0038597866217852353, "phrase": "non-coding_dna"}, {"score": 0.003799275066001196, "phrase": "complex_diseases"}, {"score": 0.0033480035183418642, "phrase": "likely_transcription_factor"}, {"score": 0.0029346624184926305, "phrase": "good_match"}, {"score": 0.002640947693258573, "phrase": "motifbreakr"}, {"score": 0.0022544399432457164, "phrase": "previously_described_variants"}, {"score": 0.0022307779508260205, "phrase": "public_databases"}], "paper_keywords": [""], "paper_abstract": "The Summary: Functional annotation represents a key step toward the understanding and interpretation of germline and somatic variation as revealed by genome-wide association studies (GWAS) and The Cancer Genome Atlas (TCGA), respectively. GWAS have revealed numerous genetic risk variants residing in non-coding DNA associated with complex diseases. For sequences that lie within enhancers or promoters of transcription, it is not straightforward to assess the effects of variants on likely transcription factor binding sites. Consequently we introduce motifbreakR, which allows the biologist to judge whether the sequence surrounding a polymorphism or mutation is a good match, and how much information is gained or lost in one allele of the polymorphism or mutation relative to the other. MotifbreakR is flexible, giving a choice of algorithms for interrogation of genomes with motifs from many public sources that users can choose from. MotifbreakR can predict effects for novel or previously described variants in public databases, making it suitable for tasks beyond the scope of its original design. Lastly, it can be used to interrogate any genome curated within bioconductor.", "paper_title": "motifbreakR: an R/Bioconductor package for predicting variant effects at transcription factor binding sites", "paper_id": "WOS:000366378400022"}