{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "readership_data"}, {"score": 0.004555217581874574, "phrase": "sciencedirect"}, {"score": 0.004455281901595837, "phrase": "scopus"}, {"score": 0.004333406378146173, "phrase": "social_reference_management_system"}, {"score": 0.004309440113061739, "phrase": "mendeley"}, {"score": 0.003814212645832246, "phrase": "high_correlation"}, {"score": 0.002763919794139171, "phrase": "citation_impact"}, {"score": 0.002718231974492536, "phrase": "analysed_information_systems_articles"}, {"score": 0.002585638506308606, "phrase": "different_obsolescence_characteristics"}, {"score": 0.0025287979714720423, "phrase": "highest_number"}, {"score": 0.002418829014435841, "phrase": "publication_year"}, {"score": 0.0021049977753042253, "phrase": "later_years"}], "paper_keywords": ["Downloads", " Citations", " Readership", " Mendeley", " Information systems journals"], "paper_abstract": "In our article we compare downloads from ScienceDirect, citations from Scopus and readership data from the social reference management system Mendeley for articles from two information systems journals (\"Journal of Strategic Information Systems\" and \"Information and Management\") published between 2002 and 2011. Our study shows a medium to high correlation between downloads and citations (Spearman r = 0.77/0.76) and between downloads and readership data (Spearman r = 0.73/0.66). The correlation between readership data and citations, however, was only medium-sized (Spearman r = 0.51/0.59). These results suggest that there is at least \"some\" difference between the two usage measures and the citation impact of the analysed information systems articles. As expected, downloads and citations have different obsolescence characteristics. While the highest number of downloads are usually made in the publication year and immediately afterwards, it takes several years until the citation maximum is reached. Furthermore, there was a re-increase in the downloads in later years which might be an indication that citations also have an effect on downloads to some degree.", "paper_title": "Comparison of downloads, citations and readership data for two information systems journals", "paper_id": "WOS:000343609900013"}