{"auto_keywords": [{"score": 0.04968510255692421, "phrase": "cscw_research"}, {"score": 0.010439480610314838, "phrase": "cscw"}, {"score": 0.010060541761719832, "phrase": "collaborative_work"}, {"score": 0.00795782400894167, "phrase": "cscw_researcher"}, {"score": 0.007763609968087822, "phrase": "multiple_sites"}, {"score": 0.007419686407922182, "phrase": "different_types"}, {"score": 0.007149575639691041, "phrase": "multiple_intersecting_sites"}, {"score": 0.004658426838467567, "phrase": "interdisciplinary_research_endeavour"}, {"score": 0.004601045179623499, "phrase": "basic_nature"}, {"score": 0.0044514440242754815, "phrase": "collaborative_technologies"}, {"score": 0.004253618550301311, "phrase": "cscw_design"}, {"score": 0.003264547032549398, "phrase": "complex_interplay"}, {"score": 0.002883439044844259, "phrase": "longitudinal_study"}, {"score": 0.002789528662623221, "phrase": "healthcare_systems"}, {"score": 0.002755104031926742, "phrase": "paediatric_emergency_department"}, {"score": 0.0025785359740308337, "phrase": "different_analytical_sensibilities"}, {"score": 0.002473959963690124, "phrase": "classic_cscw_discussion"}, {"score": 0.0023346234464901978, "phrase": "contemporary_cscw_researcher"}, {"score": 0.002194011800331242, "phrase": "interdisciplinary_manner"}, {"score": 0.0021049977753042253, "phrase": "field_site"}], "paper_keywords": ["Contemporary CSCW", " Ethnography", " Design", " Analytical sensibility", " Healthcare", " Design workshop", " Reflexivity", " Multi-sited design"], "paper_abstract": "CSCW is fundamentally an interdisciplinary research endeavour investigating the basic nature of collaborative work with the aim of designing collaborative technologies. Yet, it is not pre-given where CSCW design takes place. This leads to the simple, yet important, question: Where can we find the sites of design in CSCW research? In other words, where does CSCW design actually take place? To answer this question, we follow a CSCW researcher as she creates various connections across multiple sites of design, takes on various roles, and engages with different types of interventions. We unpack the complex interplay between multiple intersecting sites of design and the transformation processes that result from the connections created. We explore the different types of interventions that were enacted by the CSCW researcher during a longitudinal study of the collaborative work and the design of healthcare systems within a paediatric emergency department. We further unpack the multiple intersecting sites of design, and show how the researcher exercises different analytical sensibilities, transforming the various design sites. We argue that the classic CSCW discussion about the relationship between ethnography and design no longer fully captures what a contemporary CSCW researcher does when she engages in various types of interventions across multiple sites of design in an interdisciplinary manner. Thus, we suggest distributing what constitutes a field site in CSCW research, including changing how we characterize roles and interventions in CSCW research.", "paper_title": "The Multiple Intersecting Sites of Design in CSCW Research", "paper_id": "WOS:000358250000004"}