{"auto_keywords": [{"score": 0.04696022234609238, "phrase": "perceptual_effects"}, {"score": 0.017656216285751574, "phrase": "hearing_ability"}, {"score": 0.010612387000973441, "phrase": "sensorineural_hearing_impairment"}, {"score": 0.010361979175839964, "phrase": "subjective_evaluations"}, {"score": 0.004633429997452688, "phrase": "noise-reduction_algorithm"}, {"score": 0.004437349839203418, "phrase": "specific_noise-reduction"}, {"score": 0.004311241567238011, "phrase": "hearing-support_devices"}, {"score": 0.0038047474331318974, "phrase": "subjective_evaluation"}, {"score": 0.0033900126423990823, "phrase": "different_degrees"}, {"score": 0.0027697290872182477, "phrase": "moderate_hearing_loss"}, {"score": 0.002703869368554536, "phrase": "moderately-severe_hearing_loss"}, {"score": 0.0022956075241520064, "phrase": "speech_intelligibility"}, {"score": 0.002166711569953301, "phrase": "speech_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hearing aid", " Sensorineural hearing impairment", " Noise reduction", " Preference"], "paper_abstract": "Subjective evaluations of the perceptual effects of a specific noise-reduction (NR) algorithm for hearing-support devices have frequently been performed using normal-hearing (NH) participants because of financial, time, and ethical constraints. However, the perceptual effects of the same NR algorithm in a subjective evaluation may differ in accordance with the degree of hearing ability of the subjects. In this study, we performed subjective evaluations using 45 participants with different degrees of sensorineural hearing impairment to assess whether the perceptual effects of a certain NR algorithm in aspects of preference, quality, and intelligibility are affected by the degree of hearing ability. We recruited 15 NH subjects, 15 sensorineural hearing-impaired (SNHI) subjects with moderate hearing loss, and 15 SNHI subjects with moderately-severe hearing loss, and performed preference, intelligibility, and quality tests using three NR algorithms. Experimental results demonstrated that the perceptual effects of a certain NR algorithm were not significantly affected by the degree of hearing ability in regards to preference and improvement of speech intelligibility, but were significantly affected in regards to the improvement of speech quality. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Effect of the degree of sensorineural hearing impairment on the results of subjective evaluations of a noise-reduction algorithm", "paper_id": "WOS:000352245800001"}