{"auto_keywords": [{"score": 0.033002348931367075, "phrase": "pdf"}, {"score": 0.00481495049065317, "phrase": "multihop_cooperative_diversity_networks"}, {"score": 0.004450568197899267, "phrase": "detection_performance"}, {"score": 0.004392565073466714, "phrase": "energy_detector"}, {"score": 0.00433531459712787, "phrase": "relay-based_multihop_cooperative_diversity_networks"}, {"score": 0.0040334640350288, "phrase": "upper_bound_average_detection_probability_expressions"}, {"score": 0.0030614565460256897, "phrase": "received_signal-to-noise_ratio"}, {"score": 0.002866817775018445, "phrase": "alternative_series_form_representation"}, {"score": 0.0028293966058473476, "phrase": "generalized_marcum-q_function"}, {"score": 0.00268452026617243, "phrase": "ensuing_mathematical_derivations"}, {"score": 0.0026148807877309417, "phrase": "obtained_detection_probability_expressions"}, {"score": 0.0025137856138000014, "phrase": "infinite_summation_series"}, {"score": 0.0021328586481696157, "phrase": "different_parameters"}, {"score": 0.0021049977753042253, "phrase": "detector's_performance"}], "paper_keywords": [""], "paper_abstract": "This work presents a study of detection performance of energy detector in relay-based multihop cooperative diversity networks operating over independent Rayleigh fading channels. In particular, upper bound average detection probability expressions are obtained for three scenarios: (i) multihop cooperative relay communication; (ii) multi-hop cooperative relay communication with direct link and maximum ratio combiner (MRC) at destination; and (iii) multi-hop cooperative relay communication with direct link and selection combiner (SC) at destination. Classical method of performance evaluation based on probability density function (PDF) of received signal-to-noise ratio (SNR) is used. Furthermore, an alternative series form representation of generalized Marcum-Q function is employed in order to simplify the ensuing mathematical derivations. Because the obtained detection probability expressions are in the form of infinite summation series, their respective truncation error bounds are also derived. In the end, analyses are validated with the help of simulations and several observations regarding the impact of different parameters on detector's performance are outlined.", "paper_title": "Energy Detection in Multihop Cooperative Diversity Networks: An Analytical Study", "paper_id": "WOS:000330860300001"}