{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.0043464021636703066, "phrase": "e-mail_accounts"}, {"score": 0.00385214804128572, "phrase": "broad_headings"}, {"score": 0.0038240605592708083, "phrase": "findings_-_financial_spam"}, {"score": 0.0037823114064881357, "phrase": "biggest_single_type"}, {"score": 0.003700170452390401, "phrase": "health-related_spam"}, {"score": 0.0034264254358037653, "phrase": "different_internet_service_providers"}, {"score": 0.003351987298847214, "phrase": "\"obvious\"_names"}, {"score": 0.003279160988534828, "phrase": "e-mail_address"}, {"score": 0.0031728680535262083, "phrase": "spam-filtering_software"}, {"score": 0.0031267359296488118, "phrase": "former_case"}, {"score": 0.0030925761790620027, "phrase": "significant_differences"}, {"score": 0.003036468052876648, "phrase": "filtering_software"}, {"score": 0.00291657701018444, "phrase": "active_involvement"}, {"score": 0.0028847066125323893, "phrase": "pornographic_site"}, {"score": 0.002730488910300527, "phrase": "biggest_single_factors"}, {"score": 0.0026035011274172753, "phrase": "e-mail_account"}, {"score": 0.0023756164484983874, "phrase": "spam_increases"}, {"score": 0.00224032791638295, "phrase": "relatively_small_time_period"}, {"score": 0.0021676351850669017, "phrase": "practical_implications"}, {"score": 0.0021049977753042253, "phrase": "urban_myths"}], "paper_keywords": ["electronic mail", " advertising control", " computers"], "paper_abstract": "Purpose - The purpose of this research is to show how spam is generated and what methods have been proposed to combat it. Design/methodology/approach - An experiment whereby a number of e-mail accounts using different ISPs were set up and then checked for spam over a period of nine weeks. The results were compared to two pre-existing e-mail accounts. The types of spam received were classified into broad headings. Findings - Financial spam was the biggest single type of spam received, with health-related spam. second. The growth in spam over time was noted, as was the volumes of spam received by different Internet Service Providers. The effects of using \"obvious\" names versus unusual ones in the e-mail address were measured, as were those of using spam-filtering software. In the former case, no significant differences were found, but filtering software certainly helped to reduce the volume of spam received. Active involvement in a pornographic site did not, surprisingly, greatly influence the amount of spam received. The biggest single factors affecting the volume of spam received are the length of time the e-mail account has been active and the use, or non-use of filtering software. It is by no means certain that responding to spam increases the volume of spam received. Research limitations/implications - The research was conducted over a relatively small time period and small number of accounts were examined. Practical implications - Methods of combating spam and some urban myths about it are examined. Originality/value - To those tasked with dealing with spam, the paper provides some ideas on the scale of the problem and how to address it.", "paper_title": "Experiments to identify the causes of spam", "paper_id": "WOS:000239130800001"}