{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cause_identification"}, {"score": 0.039626448526133604, "phrase": "shaping_factors"}, {"score": 0.03347678520709377, "phrase": "semantic_lexicon"}, {"score": 0.004767261858417823, "phrase": "aviation_safety_incident"}, {"score": 0.004696608876994947, "phrase": "weakly_supervised_semantic_lexicon_construction"}, {"score": 0.004513255056769647, "phrase": "aviation_safety_incidents"}, {"score": 0.004446349752828045, "phrase": "research_work"}, {"score": 0.003829290275367182, "phrase": "possible_causes"}, {"score": 0.0030600032877646263, "phrase": "thelen"}, {"score": 0.003029643234751066, "phrase": "riloff's_basilisk_framework"}, {"score": 0.0028394925080958205, "phrase": "simple_heuristic"}, {"score": 0.00256993314099902, "phrase": "second_approach"}, {"score": 0.0024941578231560055, "phrase": "text_classification_problem"}, {"score": 0.002457110101089137, "phrase": "supervised_and_transductive_text_classification_algorithms"}, {"score": 0.00239657981537094, "phrase": "incident_reports"}, {"score": 0.0022799458141165587, "phrase": "unseen_reports"}, {"score": 0.0021907299375981356, "phrase": "learning-based_approach"}, {"score": 0.0021474369836979048, "phrase": "sufficient_training_data"}, {"score": 0.0021049977753042253, "phrase": "baseline_system"}], "paper_keywords": [""], "paper_abstract": "The Aviation Safety Reporting System collects voluntarily submitted reports on aviation safety incidents to facilitate research work aiming to reduce such incidents. To effectively reduce these incidents, it is vital to accurately identify why these incidents occurred. More precisely, given a set of possible causes, or shaping factors, this task of cause identification involves identifying all and only those shaping factors that are responsible for the incidents described in a report. We investigate two approaches to cause identification. Both approaches exploit information provided by a semantic lexicon, which is automatically constructed via Thelen and Riloff's Basilisk framework augmented with our linguistic and algorithmic modifications. The first approach labels a report using a simple heuristic, which looks for the words and phrases acquired during the semantic lexicon learning process in the report. The second approach recasts cause identification as a text classification problem, employing supervised and transductive text classification algorithms to learn models from incident reports labeled with shaping factors and using the models to label unseen reports. Our experiments show that both the heuristic-based approach and the learning-based approach (when given sufficient training data) outperform the baseline system significantly.", "paper_title": "Cause Identification from Aviation Safety Incident Reports via Weakly Supervised Semantic Lexicon Construction", "paper_id": "WOS:000281512300001"}