{"auto_keywords": [{"score": 0.04663433360680689, "phrase": "fits_standard"}, {"score": 0.00481495049065317, "phrase": "modern_astronomical_research"}, {"score": 0.004722254884093624, "phrase": "great_boon"}, {"score": 0.004527462929045081, "phrase": "astronomical_information"}, {"score": 0.004284755353695709, "phrase": "fits_authors"}, {"score": 0.004215868268050613, "phrase": "implementation_choices"}, {"score": 0.0040027552011993005, "phrase": "modern_data"}, {"score": 0.003775803846431323, "phrase": "astronomical_computing"}, {"score": 0.0035386420095120706, "phrase": "expanded_range"}, {"score": 0.003515758094739175, "phrase": "specialized_data_product_types"}, {"score": 0.003392507399258166, "phrase": "networked_exchange"}, {"score": 0.00327356326590461, "phrase": "significantly_more_complex_metadata"}, {"score": 0.002828740624702789, "phrase": "broad_interoperability"}, {"score": 0.0028013259314454407, "phrase": "ready_archivability"}, {"score": 0.0027651847105654363, "phrase": "fits_format"}, {"score": 0.0026681761480139067, "phrase": "selected_important_problems"}, {"score": 0.002549604441640963, "phrase": "deeper_underlying_issues"}, {"score": 0.002366110899738696, "phrase": "specific_remedies"}, {"score": 0.00226126030506079, "phrase": "fits"}, {"score": 0.002246292543825748, "phrase": "greater_astronomical_computing_communities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["FITS", " File formats", " Standards"], "paper_abstract": "The Flexible Image Transport System (FITS) standard has been a great boon to astronomy, allowing observatories, scientists and the public to exchange astronomical information easily. The FITS standard, however, is showing its age. Developed in the late 1970s, the FITS authors made a number of implementation choices that, while common at the time, are now seen to limit its utility with modern data. The authors of the FITS standard could not anticipate the challenges which we are facing today in astronomical computing. Difficulties we now face include, but are not limited to, addressing the need to handle an expanded range of specialized data product types (data models), being more conducive to the networked exchange and storage of data, handling very large datasets, and capturing significantly more complex metadata and data relationships. There are members of the community today who find some or all of these limitations unworkable, and have decided to move ahead with storing data in other formats. If this fragmentation continues, we risk abandoning the advantages of broad interoperability, and ready archivability, that the FITS format provides for astronomy. In this paper we detail some selected important problems which exist within the FITS standard today. These problems may provide insight into deeper underlying issues which reside in the format and we provide a discussion of some lessons learned. It is not our intention here to prescribe specific remedies to these issues; rather, it is to call attention of the FITS and greater astronomical computing communities to these problems in the hope that it will spur action to address them. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Learning from FITS: Limitations in use in modern astronomical research", "paper_id": "WOS:000362859800014"}