{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "source_port"}, {"score": 0.0046731372191528234, "phrase": "unprecedented_increase"}, {"score": 0.004330639691601812, "phrase": "multifaceted_approach"}, {"score": 0.004180234323211199, "phrase": "daily_basis"}, {"score": 0.0038737214010638745, "phrase": "significant_insights"}, {"score": 0.0037800357023007065, "phrase": "inner_details"}, {"score": 0.003638769383031312, "phrase": "received_darknet_data"}, {"score": 0.0035993824903045976, "phrase": "unsupervised_machine"}, {"score": 0.0035507457285983268, "phrase": "extracted_traffic"}, {"score": 0.0034648440057044104, "phrase": "similar_machinery"}, {"score": 0.0033810134162565843, "phrase": "statistical-based_behavioral_analytics"}, {"score": 0.003175850236547856, "phrase": "passive_dns"}, {"score": 0.002999386721353559, "phrase": "correlation_mechanism"}, {"score": 0.002974988677965825, "phrase": "darknet_data"}, {"score": 0.0028096544129939277, "phrase": "tcp_header_length"}, {"score": 0.002771659191307672, "phrase": "odd_flag_combinations"}, {"score": 0.0025403348084746835, "phrase": "probing_sources"}, {"score": 0.0023030372772385346, "phrase": "first_attempt"}, {"score": 0.002186849855560281, "phrase": "building_block"}, {"score": 0.00217496508306238, "phrase": "auxiliary_analysis"}, {"score": 0.002128067018576581, "phrase": "digital_forensics_research_workshop"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Port 0 probing", " Darknet", " Malware", " Passive DNS", " Data correlation"], "paper_abstract": "During November 2013, the operational cyber/network security community reported an unprecedented increase of traffic originating from source port 0. This event was deemed as malicious although its core aim and mechanism were obscured. This paper investigates that event using a multifaceted approach that leverages three real network security feeds that we receive on a daily basis, namely, darknet, passive DNS and malware data. The goal is to analyze such event from the perspectives of those feeds in order to generate significant insights and inferences that could contribute to disclosing the inner details of that incident. The approach extracts and subsequently fingerprints such malicious traffic from the received darknet data. By executing unsupervised machine learning techniques on the extracted traffic, we disclose clusters of activities that share similar machinery. Further, by employing a set of statistical-based behavioral analytics, we capture the mechanisms of those clusters, including their strategies, techniques and nature. We consequently correlate the sources with passive DNS in order to investigate their maliciousness. Moreover, to examine if the sources are malware contaminated, we execute a correlation mechanism between the darknet data and the malware feeds. The outcome reveals that such traffic indeed is reconnaissance/probing activities originating from three different horizontal scans utilizing packets with a TCP header length of 0 or packets with odd flag combinations. The results as well demonstrate that 28% of the scanning sources host malicious/blacklisted domains as they are often used for spamming, phishing and other fraud activities. Additionally, the outcome portrays that the bot probing sources are infected by 'Virus.Win32.Sality'. By correlating various evidence, we confirm that such malware specimen is in fact responsible for part of the source port 0 probing event. We concur that this work is a first attempt ever to comprehend the machinery of such unique event and we hope that the community could consider it as a building block for auxiliary analysis and investigation. (C) 2014 Digital Forensics Research Workshop. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Multidimensional investigation of source port 0 probing", "paper_id": "WOS:000340301000014"}