{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "volume_fractions"}, {"score": 0.011459661531164298, "phrase": "grid_cells"}, {"score": 0.007362132294112172, "phrase": "grid_cell"}, {"score": 0.004768649568826951, "phrase": "multi-material_cell_complexes"}, {"score": 0.004478308876320956, "phrase": "based_method"}, {"score": 0.004350308086118336, "phrase": "multi-material_solids"}, {"score": 0.003949377440799037, "phrase": "geoscience_applications"}, {"score": 0.0038924989779389424, "phrase": "said_computation"}, {"score": 0.0038179283509963695, "phrase": "property_estimation_problems"}, {"score": 0.0037811784409635023, "phrase": "iterative_forward_modeling"}, {"score": 0.003100865267124765, "phrase": "simple_axis-oriented_disposition"}, {"score": 0.0029830992938695007, "phrase": "novel_intermediate_space_enumeration_representation"}, {"score": 0.0026687841359431127, "phrase": "cartesian_and_cylindrical_grids"}, {"score": 0.0026430660986106955, "phrase": "uniform_and_non-uniform_spacings"}, {"score": 0.0024578987081792405, "phrase": "polygonal_facets"}, {"score": 0.0024224481033945943, "phrase": "potential_elliptical_edges"}, {"score": 0.002274630121183437, "phrase": "different_materials"}, {"score": 0.0021670777282518424, "phrase": "material_interfaces"}, {"score": 0.0021049977753042253, "phrase": "volume_contributions"}], "paper_keywords": ["forward modeling", " volume fraction", " slicing", " non-manifold solids", " voxelization"], "paper_abstract": "The paper presents a novel slicing based method for computation of volume fractions in multi-material solids given as a B-rep whose faces are triangulated and shared by either one or two materials. Such objects occur naturally in geoscience applications and the said computation is necessary for property estimation problems and iterative forward modeling. Each facet in the model is cut by the planes delineating the given grid structure or grid cells. The method, instead of classifying the points or cells with respect to the solid, exploits the convexity of triangles and the simple axis-oriented disposition of the cutting surfaces to construct a novel intermediate space enumeration representation called slice-representation, front which both the cell containment test and the volume-fraction computation are done easily. Cartesian and cylindrical grids with uniform and non-uniform spacings have been dealt with in this paper. After slicing, each triangle contributes polygonal facets, with potential elliptical edges, to the grid cells through which it passes. The volume fractions of different materials in a grid cell that is in interaction with the material interfaces are obtained by accumulating the volume contributions computed from each facet in the grid cell. The method is fast, accurate, robust and memory efficient. Examples illustrating the method and performance are included in the paper. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient computation of volume fractions for multi-material cell complexes in a grid by slicing", "paper_id": "WOS:000256135100003"}