{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unified_framework"}, {"score": 0.00476697427418509, "phrase": "opinion_retrieval"}, {"score": 0.004602773636967002, "phrase": "exponential_increase"}, {"score": 0.0044219992735047954, "phrase": "social_web"}, {"score": 0.004227064760262924, "phrase": "automatic_text_processing_systems"}, {"score": 0.004081385289516914, "phrase": "present_relevant_knowledge"}, {"score": 0.003306559295382181, "phrase": "subjective_information"}, {"score": 0.0032571885279065126, "phrase": "extensive_analysis"}, {"score": 0.0031765314093444956, "phrase": "different_configurations"}, {"score": 0.0026516890043911836, "phrase": "individual_components"}, {"score": 0.0022022878843247257, "phrase": "subjective_text"}], "paper_keywords": ["Intelligent system", " Opinion retrieval mining and summarization framework Information retrieval", " Opinion mining", " Text summarization"], "paper_abstract": "The exponential increase of subjective, user-generated content since the birth of the Social Web, has led to the necessity of developing automatic text processing systems able to extract, process and present relevant knowledge. In this paper, we tackle the Opinion Retrieval, Mining and Summarization task, by proposing a unified framework, composed of three crucial components (information retrieval, opinion mining and text summarization) that allow the retrieval, classification and summarization of subjective information. An extensive analysis is conducted, where different configurations of the framework are suggested and analyzed, in order to determine which is the best one, and under which conditions. The evaluation carried out and the results obtained show the appropriateness of the individual components, as well as the framework as a whole. By achieving an improvement over 10% compared to the state-of-the-art approaches in the context of blogs, we can conclude that subjective text can be efficiently dealt with by means of our proposed framework.", "paper_title": "Towards a unified framework for opinion retrieval, mining and summarization", "paper_id": "WOS:000311029800007"}