{"auto_keywords": [{"score": 0.048966142809584, "phrase": "decision_trees"}, {"score": 0.005806051797634043, "phrase": "decision_tree"}, {"score": 0.00481495049065317, "phrase": "medical_decision_trees"}, {"score": 0.004772668787820885, "phrase": "relevant_health-care_criteria"}, {"score": 0.004553329756664763, "phrase": "decision_processes"}, {"score": 0.004421368738303273, "phrase": "supervised_learning_algorithms"}, {"score": 0.004205715668397308, "phrase": "medical_setting"}, {"score": 0.004168761451497153, "phrase": "induction_process"}, {"score": 0.004119991676351513, "phrase": "background_knowledge"}, {"score": 0.004083787598482644, "phrase": "health-care_professionals"}, {"score": 0.0038390783879368585, "phrase": "medical_coherence"}, {"score": 0.003705861051897777, "phrase": "correctness_rates"}, {"score": 0.00357724980284755, "phrase": "medical_or_clinical_point"}, {"score": 0.003463267330414914, "phrase": "alternative_objectives"}, {"score": 0.0034227226677308337, "phrase": "economic_cost"}, {"score": 0.0033529044784726477, "phrase": "decision_process"}, {"score": 0.0033332184113249444, "phrase": "medical_standards"}, {"score": 0.0032748487318980846, "phrase": "clinical_point"}, {"score": 0.003114942418729772, "phrase": "real_medical_decisions"}, {"score": 0.002785094545598041, "phrase": "different_purposes"}, {"score": 0.0023337634986506234, "phrase": "medical_point"}, {"score": 0.002174374647551399, "phrase": "previous_approaches"}, {"score": 0.002142561289952531, "phrase": "equivalent_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Medical decision making", " Decision trees", " Background knowledge"], "paper_abstract": "Through the years, decision trees have been widely used both to represent and to conduct decision processes. They can be automatically induced from databases using supervised learning algorithms which usually aim at minimizing the size of the tree. When inducing decision trees in a medical setting, the induction process should consider the background knowledge used by health-care professionals to make decisions in order to produce decision trees that are medically and clinically comprehensible and correct. Comprehensibility measures the medical coherence of the sequence of questions represented in the tree, and correctness rates how much irrelevant are the errors of the decision tree from a medical or clinical point of view. Some algorithms partially solve these problems pursuing alternative objectives as reducing the economic cost or improving the adherence of the decision process to medical standards. However, from a clinical point of view, none of these criteria is valid when it is considered alone, because real medical decisions are taken attending to a combination of them, and also other health-care criteria, simultaneously. Moreover, this combination of criteria is not static and may vary if the decision tree is made for different purposes as screening, diagnosing, prognosing or drug and therapy prescription. In this paper, a decision tree induction algorithm that uses combinations of health-care criteria is presented and used to generate decision trees for screening and diagnosing in four medical domains. The mechanisms to formalize and to combine these criteria are also presented. The results have been analyzed from both a statistical and a medical point of view, and they suggest that our algorithm obtains decision trees that physicians evaluated as more comprehensible and correct than the decision trees obtained by previous approaches as they keep an equivalent accuracy. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Improving medical decision trees by combining relevant health-care criteria", "paper_id": "WOS:000305597700029"}