{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rationally_related_clock_domains"}, {"score": 0.004565876339189493, "phrase": "source-synchronous_adaptive_interface"}, {"score": 0.0031285355811105915, "phrase": "average_latency"}, {"score": 0.0030195184114140063, "phrase": "state-of-the-art_asynchronous_first-input"}, {"score": 0.002573965014439041, "phrase": "low_area"}, {"score": 0.0023415390666563177, "phrase": "clock_jitters"}, {"score": 0.0023139986108451967, "phrase": "propagation_delay_misalignments"}, {"score": 0.002259883463607508, "phrase": "realistic_link"}, {"score": 0.0021049977753042253, "phrase": "least_common_multiple"}], "paper_keywords": ["Application specific integrated circuits", " asynchronous circuits", " circuits", " circuits and systems", " system-on-a-chip"], "paper_abstract": "In this paper, we introduce a source-synchronous adaptive interface for the globally ratiochronous, locally synchronous design style, a subset of the globally asynchronous, locally synchronous (GALS) design style in which the frequencies of all clocks are not phase-aligned but are constrained to be rationally related, i.e., they are all submultiple of the same physical or virtual frequency. The interface can be designed using only standard cells and guarantees maximal throughput in addition to an average latency four times lower compared with state-of-the-art asynchronous first-input, first-output GALS interfaces. Several properties of the interface are formally stated and proved. We also demonstrate that the interface has a low area overhead, with only four flip-flops per data line, and is robust against nonidealities such as clock jitters and propagation delay misalignments. For a realistic link in 90-nm application-specific integrated circuit technology, we derive a 1-GHz upper bound for the least common multiple among the frequencies.", "paper_title": "Low-Latency Maximal-Throughput Communication Interfaces for Rationally Related Clock Domains", "paper_id": "WOS:000332124200018"}