{"auto_keywords": [{"score": 0.04612142010063672, "phrase": "fuzzy_clustering"}, {"score": 0.00481495049065317, "phrase": "enhanced_fuzzy_partitions"}, {"score": 0.00478740563679966, "phrase": "vs_data_randomness"}, {"score": 0.004732785510739708, "phrase": "fcm._ifp-fim"}, {"score": 0.004123781267600542, "phrase": "maximal_fuzzy_membership"}, {"score": 0.0033922781038328844, "phrase": "new_finding"}, {"score": 0.00307657476125683, "phrase": "random_noise"}, {"score": 0.00298942278888105, "phrase": "proposed_noise-resistant_fuzzy_clustering_algorithm_nr-fcm"}, {"score": 0.002822434555587263, "phrase": "nr-fcm"}, {"score": 0.0027424619603260837, "phrase": "intermediate_step"}, {"score": 0.002402731767209114, "phrase": "alternative_perspective"}, {"score": 0.0023480892503414596, "phrase": "fuzzy_partitions"}, {"score": 0.002294686545883412, "phrase": "data_randomness"}], "paper_keywords": ["Fuzzy clustering algorithm", " noise-resistant penalty term", " fuzzy partitions", " equivalence"], "paper_abstract": "IFP-FIM and GIFP-FCM are two typical enhanced fuzzy clustering algorithms in which the rationale of fuzzy clustering and its robustness to noise and/or outliers are enhanced by making the maximal fuzzy membership of each data point belonging to a cluster become as big as possible and other fuzzy memberships of this point belonging to all other clusters become as small as possible. In this study, a new finding will be revealed that their enhanced fuzzy partitions can be equivalently achieved by factitiously disturbing the given dataset using a random noise and then applying the proposed noise-resistant fuzzy clustering algorithm NR-FCM to the dataset with factitiously added random noise. NR-FCM is designed as an intermediate step for us to observe this finding. The virtue of this finding exists in that it indeed helps us witness from an alternative perspective that fuzziness of fuzzy partitions in fuzzy clustering and data randomness can be collaborative and even mutually transformable rather than competitive. Our several experimental results verify the above claim.", "paper_title": "Enhanced fuzzy partitions vs data randomness in FCM", "paper_id": "WOS:000343424500004"}