{"auto_keywords": [{"score": 0.04448558694741615, "phrase": "eol"}, {"score": 0.015719709290413487, "phrase": "content_curation_communities"}, {"score": 0.004388252997694986, "phrase": "large-scale_content_curation_communities"}, {"score": 0.004330450801016359, "phrase": "in-depth_case_study"}, {"score": 0.004161553532799662, "phrase": "large-scale_crowdsourcing_endeavors"}, {"score": 0.004070573090297285, "phrase": "existing_content"}, {"score": 0.004016938499717623, "phrase": "single_repository"}, {"score": 0.003894512634265439, "phrase": "content_creation_communities"}, {"score": 0.003843228600756309, "phrase": "wikipedia"}, {"score": 0.0036124465071873998, "phrase": "increasingly_important_genre"}, {"score": 0.0033955105098235345, "phrase": "content_curation_community"}, {"score": 0.0033212215487678854, "phrase": "case_study"}, {"score": 0.003191560305761507, "phrase": "online_discussions"}, {"score": 0.0029471818883482688, "phrase": "information_integration_challenges"}, {"score": 0.00278237555651743, "phrase": "multiple_sources"}, {"score": 0.0027094427948305515, "phrase": "traditional_peer"}, {"score": 0.0024579623598183355, "phrase": "open-access_resources"}, {"score": 0.002425524064992056, "phrase": "scientific_community"}, {"score": 0.002219916677664081, "phrase": "potential_strategies"}], "paper_keywords": ["collaboration", " computer mediated communications", " human computer interaction"], "paper_abstract": "This article explores the opportunities and challenges of creating and sustaining large-scale content curation communities through an in-depth case study of the Encyclopedia of Life (EOL). Content curation communities are large-scale crowdsourcing endeavors that aim to curate existing content into a single repository, making these communities different from content creation communities such as Wikipedia. In this article, we define content curation communities and provide examples of this increasingly important genre. We then follow by presenting EOL, a compelling example of a content curation community, and describe a case study of EOL based on analysis of interviews, online discussions, and survey data. Our findings are characterized into two broad categories: information integration and social integration. Information integration challenges at EOL include the need to (a) accommodate and validate multiple sources and (b) integrate traditional peer reviewed sources with user-generated, nonpeer-reviewed content. Social integration challenges at EOL include the need to (a) establish the credibility of open-access resources within the scientific community and (b) facilitate collaboration between experts and novices. After identifying the challenges, we discuss the potential strategies EOL and other content curation communities can use to address them, and provide technical, content, and social design recommendations for overcoming them.", "paper_title": "Supporting content curation communities: The case of the Encyclopedia of Life", "paper_id": "WOS:000304133900003"}