{"auto_keywords": [{"score": 0.03636886875497387, "phrase": "mean_length"}, {"score": 0.031763843900136826, "phrase": "discontinuity_network"}, {"score": 0.016329951934801804, "phrase": "random_discontinuity_network"}, {"score": 0.010612387000973441, "phrase": "random_discontinuities"}, {"score": 0.007813041206478107, "phrase": "ddof"}, {"score": 0.005747819779632313, "phrase": "rev_size"}, {"score": 0.0045471315699087385, "phrase": "comprehensive_parameter"}, {"score": 0.004294145092032327, "phrase": "main_objectives"}, {"score": 0.0041283957965834875, "phrase": "statistical_geometrical_parameters"}, {"score": 0.00398325070540449, "phrase": "hydraulic_properties"}, {"score": 0.0038708031633013086, "phrase": "analytical_method"}, {"score": 0.003616252896285766, "phrase": "analytically_estimated_ddof"}, {"score": 0.0035648266669315943, "phrase": "numerical_analysis"}, {"score": 0.0034271313706984658, "phrase": "relative_orientation"}, {"score": 0.0032246835734680377, "phrase": "ddof."}, {"score": 0.0022615046141708987, "phrase": "good_indicator"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Discontinuity", " Fracture", " Cracks", " Connectivity", " Flow", " Permeability", " Seepage"], "paper_abstract": "Discontinuities such as fractures or cracks are common in geo-materials. Connectivity is a comprehensive parameter that includes the influence of length, orientation and density of the discontinuities. The main objectives of this paper are to define connectivity based on the statistical geometrical parameters of a network of random discontinuities and to quantify the hydraulic properties of the network using connectivity. An analytical method is first proposed to evaluate connectivity through the density of degree of freedom (DDOF). The analytically estimated DDOF is verified using numerical analysis. DDOF increases with the increases in the mean length, relative orientation and density of the random discontinuity network. Connectivity becomes better and the permeability becomes larger with increasing DDOF. The representative element volume (REV) of a random discontinuity network can be estimated based on connectivity. When a discontinuity network is poorly connected, a REV does not exist when the size of the discontinuity network is smaller than 10 times of the mean length of the discontinuities. When a discontinuity network is normally connected, a REV exists when the REV size is smaller than 10 times of the mean length of the discontinuities. When the discontinuity network is highly connected, the REV size is only 2-4 times of the mean length of the discontinuities. The results indicate that DDOF is a good indicator to quantify the connectivity of a random discontinuity network and the relationship between connectivity and permeability. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Connectivity of a network of random discontinuities", "paper_id": "WOS:000287633700011"}