{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "registration_methods"}, {"score": 0.004774324145784758, "phrase": "thoracic_ct"}, {"score": 0.004537631845923196, "phrase": "pulmonary_image_registration"}, {"score": 0.0044424917428102445, "phrase": "public_platform"}, {"score": 0.004404994123834589, "phrase": "fair_and_meaningful_comparison"}, {"score": 0.004204320052179726, "phrase": "intrapatient_thoracic_ct_image_pairs"}, {"score": 0.004133627071344356, "phrase": "nonrigid_registration_techniques"}, {"score": 0.004081385289516914, "phrase": "nontrivial_task"}, {"score": 0.003639835714755229, "phrase": "different_registration_algorithms"}, {"score": 0.00337224813954299, "phrase": "launch_phase"}, {"score": 0.00327356326590461, "phrase": "comprehensive_evaluation"}, {"score": 0.0031912706211861324, "phrase": "leading_academic_and_industrial_research_groups"}, {"score": 0.002505412457777352, "phrase": "new_participants"}, {"score": 0.0024842242921857705, "phrase": "full_results"}, {"score": 0.0022434880661725493, "phrase": "evaluation_methods"}, {"score": 0.0021870332034407817, "phrase": "initial_launch"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["Chest", " computed tomography", " evaluation", " registration"], "paper_abstract": "EMPIRE10 (Evaluation of Methods for Pulmonary Image REgistration 2010) is a public platform for fair and meaningful comparison of registration algorithms which are applied to a database of intrapatient thoracic CT image pairs. Evaluation of nonrigid registration techniques is a nontrivial task. This is compounded by the fact that researchers typically test only on their own data, which varies widely. For this reason, reliable assessment and comparison of different registration algorithms has been virtually impossible in the past. In this work we present the results of the launch phase of EMPIRE10, which comprised the comprehensive evaluation and comparison of 20 individual algorithms from leading academic and industrial research groups. All algorithms are applied to the same set of 30 thoracic CT pairs. Algorithm settings and parameters are chosen by researchers expert in the configuration of their own method and the evaluation is independent, using the same criteria for all participants. All results are published on the EMPIRE10 website (http://empire10.isi.uu.nl). The challenge remains ongoing and open to new participants. Full results from 24 algorithms have been published at the time of writing. This paper details the organization of the challenge, the data and evaluation methods and the outcome of the initial launch with 20 algorithms. The gain in knowledge and future work are discussed.", "paper_title": "Evaluation of Registration Methods on Thoracic CT: The EMPIRE10 Challenge", "paper_id": "WOS:000296455500003"}