{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "sequential_patterns"}, {"score": 0.004615202066192795, "phrase": "data_streams"}, {"score": 0.004016310318056464, "phrase": "decay_rate"}, {"score": 0.003287482882222731, "phrase": "adaptive_model"}, {"score": 0.003036040409062437, "phrase": "current_and_cumulative_mining_results"}, {"score": 0.002863921785266393, "phrase": "significant_change_patterns"}, {"score": 0.002833689453299307, "phrase": "corresponding_degree"}, {"score": 0.002658863179011018, "phrase": "current_sequential_patterns"}, {"score": 0.0025892330566358503, "phrase": "next_mining_round"}, {"score": 0.0024423826953133844, "phrase": "experimental_results"}, {"score": 0.002365815362517737, "phrase": "proposed_model"}, {"score": 0.0022434880661725493, "phrase": "present_state"}, {"score": 0.002219790619936024, "phrase": "data_stream"}, {"score": 0.0021847119298612264, "phrase": "predicted_degree"}], "paper_keywords": ["data streams", " sequential pattern mining", " prediction", " change handling", " change mining"], "paper_abstract": "Many techniques have been proposed for mining sequential patterns in data streams. Nevertheless, the characteristics of these sequential patterns may change over time. For example, the sequential patterns may appear frequently in one time period, but rarely in others. However, most existing mining techniques ignore the changes which take place in sequential patterns over time, or use only a simple static decay function to assign a greater importance to the more recent data in streams. Accordingly, this study proposes an adaptive model for mining the changes in sequential patterns of streams. In this model, the current and cumulative mining results for sequential patterns within streams are found, and the significant change patterns and corresponding degree of change are identified. The degree of change between the current sequential patterns and those in the next mining round is then predicted, and the decay rate modified accordingly The experimental results confirm the ability of the proposed model to automatically tune the decay rate in accordance with the present state of data stream and the predicted degree of change of sequential patterns in the following mining round.", "paper_title": "Mining Sequential Pattern Changes", "paper_id": "WOS:000339464800003"}