{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "linguistic_features"}, {"score": 0.0042459818200777846, "phrase": "protein-protein_interactions"}, {"score": 0.004096082254543022, "phrase": "key_aims"}, {"score": 0.004059438255358923, "phrase": "biological_research"}, {"score": 0.004005083535629333, "phrase": "previous_research"}, {"score": 0.003969250376327401, "phrase": "text_mining"}, {"score": 0.003916098498242888, "phrase": "substantial_progress"}, {"score": 0.0038810583785936505, "phrase": "automatic_ppi_detection"}, {"score": 0.0034685354330506605, "phrase": "experimental_data"}, {"score": 0.003376216135716629, "phrase": "multiple_evidence"}, {"score": 0.0032277611129050234, "phrase": "interaction_detection_method"}, {"score": 0.002910545717767559, "phrase": "aimed_dataset"}, {"score": 0.0028076592725295646, "phrase": "better_precision"}, {"score": 0.0027825094419000637, "phrase": "reduced_recall"}, {"score": 0.0027328817607818207, "phrase": "possible_approaches"}, {"score": 0.0025316254589087973, "phrase": "five_human-curated_databases-bind"}, {"score": 0.0024864612830452254, "phrase": "hprd"}, {"score": 0.002464181865941283, "phrase": "intact"}, {"score": 0.002442106316638198, "phrase": "mint"}, {"score": 0.0022419349154472806, "phrase": "pubmed_abstract"}], "paper_keywords": [""], "paper_abstract": "Motivation: Identification and characterization of protein-protein interactions (PPIs) is one of the key aims in biological research. While previous research in text mining has made substantial progress in automatic PPI detection from literature, the need to improve the precision and recall of the process remains. More accurate PPI detection will also improve the ability to extract experimental data related to PPIs and provide multiple evidence for each interaction. Results: We developed an interaction detection method and explored the usefulness of various features in automatically identifying PPIs in text. The results show that our approach outperforms other systems using the AImed dataset. In the tests where our system achieves better precision with reduced recall, we discuss possible approaches for improvement. In addition to test datasets, we evaluated the performance on interactions from five human-curated databases-BIND, DIP, HPRD, IntAct and MINT-where our system consistently identified evidence for similar to 60% of interactions when both proteins appear in at least one sentence in the PubMed abstract. We then applied the system to extract articles from PubMed to annotate known, high-throughput and interologous interactions in (ID)-D-2.", "paper_title": "Evaluation of linguistic features useful in extraction of interactions from PubMed; Application to annotating known, high-throughput and predicted interactions in (ID)-D-2", "paper_id": "WOS:000273116100016"}