{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "class_clustering"}, {"score": 0.04810827982024645, "phrase": "different_classes"}, {"score": 0.025952742303605128, "phrase": "system_content"}, {"score": 0.004764648644792333, "phrase": "multiclass_fcfs_queue"}, {"score": 0.0047314049780079765, "phrase": "order-dependent_service_times"}, {"score": 0.004681971826924847, "phrase": "multi-class_queueing_systems"}, {"score": 0.004229847379280629, "phrase": "arrival_stream"}, {"score": 0.004027412633636142, "phrase": "actual_situation"}, {"score": 0.003929843413153981, "phrase": "multi-class_system"}, {"score": 0.0039024014688338964, "phrase": "so-called_class_clustering"}, {"score": 0.003861596041315646, "phrase": "customer_arrival_stream"}, {"score": 0.003754847652236926, "phrase": "consecutive_customers"}, {"score": 0.00347620887265168, "phrase": "service-time_distribution"}, {"score": 0.003275093899046286, "phrase": "previous_customer"}, {"score": 0.003240826566478551, "phrase": "latter_feature"}, {"score": 0.003021334228842501, "phrase": "slower_processing_times"}, {"score": 0.002989714021608139, "phrase": "first_case"}, {"score": 0.0029069972482610403, "phrase": "different_task"}, {"score": 0.002826562521633885, "phrase": "new_data"}, {"score": 0.0022110183535859374, "phrase": "tremendous_impact"}, {"score": 0.0021878600131802453, "phrase": "system_performance"}, {"score": 0.0021049977753042253, "phrase": "performance_assessment"}], "paper_keywords": ["Queueing", " Order-dependent service times", " Class clustering"], "paper_abstract": "In multi-class queueing systems, customers of different classes can enter the system. When studying such systems, it is traditionally assumed that the different classes of customers occur randomly and independently in the arrival stream of customers in the system. This is often in contrast to the actual situation. Therefore, we study a multi-class system with so-called class clustering in the customer arrival stream, i.e., (Markovian) correlation occurs in the classes of consecutive customers. The system under investigation consists of one server that is able to serve two classes of customers. In addition, the service-time distribution of a customer depends on the equality or non-equality of its class with the class of the previous customer. This latter feature occurs frequently in practice. For instance, execution of the same task again can lead to both faster or slower processing times. The first case can occur when the execution of a different task entails resetting a machine, or loading new data, et cetera. The opposite situation appears, for instance, when execution of the same task requires postprocessing (such as cooling down or reinitialization of a machine). We deduce the probability generating function (pgf) of the system content, from which we can extract various performance measures, among which the mean values of the system content and the customer delay. We demonstrate that class clustering has a tremendous impact on the system performance, which highlights the necessity to include it in the performance assessment of any system in which it occurs. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Impact of class clustering in a multiclass FCFS queue with order-dependent service times", "paper_id": "WOS:000341473200008"}