{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "healthy_living"}, {"score": 0.008748885327649319, "phrase": "practitioner-patient_interaction"}, {"score": 0.006117568424053278, "phrase": "visual_language"}, {"score": 0.0057855813089324306, "phrase": "human_movement"}, {"score": 0.004434391660327048, "phrase": "efficient_and_effective_healthcare_services"}, {"score": 0.0043185468826678185, "phrase": "contemporary_models"}, {"score": 0.0042429960722503305, "phrase": "deeper_involvement"}, {"score": 0.004071790119305426, "phrase": "health_journey"}, {"score": 0.00390746526080583, "phrase": "successful_processes"}, {"score": 0.0038845358652982286, "phrase": "patient_participation"}, {"score": 0.003749747076821239, "phrase": "medical_practitioners"}, {"score": 0.0036196183044671106, "phrase": "design_strategies"}, {"score": 0.0032652199869725087, "phrase": "broad_and_diverse_communication_training"}, {"score": 0.0031057823670329193, "phrase": "captured_information"}, {"score": 0.0030156459374311856, "phrase": "computer_reasoning"}, {"score": 0.0028768215428376185, "phrase": "quick_interpretation"}, {"score": 0.0028599227029302353, "phrase": "respective_sides"}, {"score": 0.0027524673604095787, "phrase": "analysis_system"}, {"score": 0.0027362969892763926, "phrase": "visual_reasoning"}, {"score": 0.0026725573963372533, "phrase": "visual_knowledge_representation"}, {"score": 0.0025345056783823206, "phrase": "implicit_knowledge"}, {"score": 0.002417776723734214, "phrase": "respective_visual_analysis_method"}, {"score": 0.0024035679947366387, "phrase": "kia"}, {"score": 0.0022328311088272877, "phrase": "kia_approach"}, {"score": 0.0021488865854453073, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Collaborative technologies", " Patient centered healthcare", " Embodied interaction", " Interaction analytics"], "paper_abstract": "The design of an efficient and effective healthcare services is part of the design for healthy living. Contemporary models of health rely on a deeper involvement of the patient in the decision-making through the steps of the health journey. In these methods, the quality of practitioner-patient interaction is central to the successful processes and patient participation. The quality of these interactions and the ability of both medical practitioners and patients to reflect on each session is part of the design strategies for healthy living. Interactions rely on extensive, effective and empowering communication between practitioner and patient. The purpose of this work is to address the recognition of this importance, evidenced from the broad and diverse communication training for practitioners, by enabling the capture of information about the quality of these interactions. Captured information has to be encoded in a way that enables computer reasoning with it, as well as delivered to patients and practitioners in ways that allow quick interpretation from respective sides. We present the mechanics of the development of a visual language and analysis system enabling visual reasoning about the quality of interactions. The visual knowledge representation is designed based on aspects of human movement. Such design is justified from the fact that human possess implicit knowledge about human movement. The paper presents KIA ( Kinetic Inter-Acting) encoding system that is the foundation of the visual language and respective visual analysis method. KIA enables both humans and machines to utilise information about how interactions unfold, which is necessary for practitioner-patient interaction. The paper concludes with discussion of KIA approach and technology in terms of the implications for designing for healthy living. Crown Copyright (C) 2011 Published by Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Designing for healthy living: Supporting reflectivity on interactions in healthcare (Retracted article. See vol. 82, pg. 276, 2013)", "paper_id": "WOS:000298081500004"}