{"auto_keywords": [{"score": 0.03216292580559967, "phrase": "emr_system"}, {"score": 0.01666730386857453, "phrase": "private_medical_practices"}, {"score": 0.015943350432085914, "phrase": "medical_practices"}, {"score": 0.010559850352838105, "phrase": "emr_systems"}, {"score": 0.010507571025357905, "phrase": "family_physician_practices"}, {"score": 0.010301225482285879, "phrase": "canada"}, {"score": 0.008054426062913565, "phrase": "delphi_study"}, {"score": 0.00481495049065317, "phrase": "organizational_adoption"}, {"score": 0.0044898971618201255, "phrase": "logistical_organization_problems"}, {"score": 0.0044563926211018704, "phrase": "paper_systems"}, {"score": 0.004368259086148672, "phrase": "professionals'_clinical_decisions"}, {"score": 0.004303299727138449, "phrase": "physicians'_return"}, {"score": 0.004207659796983607, "phrase": "clinical_information"}, {"score": 0.004042830127694523, "phrase": "family_physicians'_adoption"}, {"score": 0.0037229034839372675, "phrase": "mixed-methods_study"}, {"score": 0.0035680675987902, "phrase": "general_practitioners"}, {"score": 0.003550278734717757, "phrase": "extensive_professional_experience"}, {"score": 0.003454008016586962, "phrase": "health_it"}, {"score": 0.003402597807993192, "phrase": "second_step"}, {"score": 0.0033269089027090056, "phrase": "large_questionnaire_survey"}, {"score": 0.003310318358799954, "phrase": "family_physicians"}, {"score": 0.0030788191208126307, "phrase": "initial_decision"}, {"score": 0.0029140286967542913, "phrase": "survey_findings"}, {"score": 0.0028778201936562452, "phrase": "key_challenges"}, {"score": 0.002792739683423163, "phrase": "economic_and_knowledge_barriers"}, {"score": 0.002584379962895876, "phrase": "thorough_understanding"}, {"score": 0.002403525074878782, "phrase": "all\"_approach"}, {"score": 0.002338277198570774, "phrase": "study's_findings"}, {"score": 0.002314991387596956, "phrase": "practically_no_barriers"}, {"score": 0.002303435385569474, "phrase": "emr_adoption"}, {"score": 0.0021746070312182995, "phrase": "knowledge_barriers"}, {"score": 0.0021368444454600093, "phrase": "economic_barriers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic medical records", " Medical practices", " Family physicians", " Adoption", " Barriers"], "paper_abstract": "Background: EMR system can provide three main types of benefits: it can solve the logistical organization problems associated with paper systems; it can improve the quality of professionals' clinical decisions; and it can improve physicians' return on their practices by reducing the cost of managing clinical information. According to the 2012 Commonwealth Fund International Health Policy Survey, Canada ranked 10th out of 11 countries in terms of family physicians' adoption of EMR systems. Our main purpose is to investigate the reasons why so many primary care medical practices in this country have not decided to invest in these systems yet. Methods: To achieve our main objective, a mixed-methods study was performed. We first conducted a Delphi study with a panel of 21 experts made up of general practitioners with extensive professional experience and a very good understanding of the issues surrounding the introduction of health IT in private medical practices. As a second step, we collected and analyzed data from a large questionnaire survey of family physicians working in medical practices without EMR systems (n = 431). Results: The Delphi study reveals that private medical practices are hindered by four types of barriers when faced with the initial decision to invest in an EMR system, namely, behavioral, cognitive or knowledge-based, economic, and technological. Survey findings then indicate that the key challenges preventing private medical practices from investing in an EMR system are mainly related to economic and knowledge barriers. Surprisingly, we also found a cluster of medical practices which, although they have not invested in an EMR system, perceive no such barriers to adoption. Conclusions: A thorough understanding of the barriers faced by family physician practices in adopting an EMR system would help governments and other key stakeholders target policies and measures in support of medical practices. The \"one size fits all\" approach to such policies and measures is clearly inappropriate, given this study's findings that many medical practices face practically no barriers to EMR adoption, and that others differ markedly as to the type of barriers faced, be they mostly \"soft\" such as knowledge barriers or \"hard\" such as economic barriers. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Barriers to organizational adoption of EMR systems in family physician practices: A mixed-methods study in Canada", "paper_id": "WOS:000340262200002"}