{"auto_keywords": [{"score": 0.046429977017780094, "phrase": "initial_registration"}, {"score": 0.03421787969149637, "phrase": "inter-subject_registration"}, {"score": 0.00481495049065317, "phrase": "pedobarographic_image_data"}, {"score": 0.004257360656055417, "phrase": "selected_image"}, {"score": 0.004020813632357377, "phrase": "image_contour_matching"}, {"score": 0.0039333604469462356, "phrase": "image_cross-correlation"}, {"score": 0.0038647641000798135, "phrase": "final_registration"}, {"score": 0.0038141000450978746, "phrase": "multidimensional_optimization_algorithm"}, {"score": 0.002941913249957503, "phrase": "normal_pc_notebook"}, {"score": 0.0028778584739756786, "phrase": "superior_xor"}, {"score": 0.0028526276660691525, "phrase": "identical_mse_values"}, {"score": 0.002802825862847951, "phrase": "best_values"}, {"score": 0.0027660443371695024, "phrase": "previous_studies"}, {"score": 0.0021236300589450143, "phrase": "essential_features"}, {"score": 0.0021049977753042253, "phrase": "near-real-time_applications"}], "paper_keywords": ["Biomechanics", " Plantar pressure data", " Image registration", " Optimization"], "paper_abstract": "This article presents a framework to register (or align) plantar pressure images based on a hybrid registration approach, which first establishes an initial registration that is subsequently improved by the optimization of a selected image (dis)similarity measure. The initial registration has two different solutions: one based on image contour matching and the other on image cross-correlation. In the final registration, a multidimensional optimization algorithm is applied to one of the following (dis)similarity measures: the mean squared error (MSE), the mutual information, and the exclusive or (XOR). The framework has been applied to intra- and inter-subject registration. In the former, the framework has proven to be extremely accurate and fast (< 70 ms on a normal PC notebook), and obtained superior XOR and identical MSE values compared to the best values reported in previous studies. Regarding the inter-subject registration, by using rigid, similarity, affine, projective, and polynomial (up to the fourth degree) transformations, the framework significantly optimized the image (dis)similarity measures. Thus, it is considered to be very accurate, fast, and robust in terms of noise, as well as being extremely versatile, all of which are regarded as essential features for near-real-time applications.", "paper_title": "Novel framework for registration of pedobarographic image data", "paper_id": "WOS:000287855600007"}