{"auto_keywords": [{"score": 0.02322730111336099, "phrase": "ordered_semigroups"}, {"score": 0.004684157900507474, "phrase": "ordered_semigroup"}, {"score": 0.004536029676655286, "phrase": "partial_order"}, {"score": 0.004412780054037622, "phrase": "semigroup_operation"}, {"score": 0.004234129588974058, "phrase": "sequential_machines"}, {"score": 0.004195418010131832, "phrase": "formal_languages"}, {"score": 0.004157058883925715, "phrase": "computer_arithmetics"}, {"score": 0.00410017409033388, "phrase": "error-correcting_codes"}, {"score": 0.0036553070575015344, "phrase": "boolean_or_q"}, {"score": 0.0023507916951658455, "phrase": "implication_operators"}, {"score": 0.002297327670408112, "phrase": "implication-based_interval"}], "paper_keywords": ["semigroup", " filter", " ordered semigroup", " fuzzy set", " interval valued fuzzy set"], "paper_abstract": "In mathematics, an ordered semigroup is a semigroup together with a partial order that is compatible with the semigroup operation. Ordered semigroups have many applications in the theory of sequential machines, formal languages, computer arithmetics, and error-correcting codes. In this article, we try to obtain a more general form than interval valued (is an element of, is an element of boolean OR q) -fuzzy left (right) filters in ordered semigroups. The notion of an interval valued (is an element of, is an element of boolean OR q((k) over tilde))-fuzzy left (right) filter is introduced, and several properties are investigated. Characterizations of an interval valued (is an element of, is an element of boolean OR q((k) over tilde))-fuzzy left (right) filter are established. A condition for an interval valued (is an element of, is an element of boolean OR q((k) over tilde))-fuzzy left (right) filter to be an interval valued fuzzy left (right) filter is provided. Using implication operators and the notion of implication-based interval valued fuzzy left (resp. right) filters, characterizations of an interval valued fuzzy left (resp. right) filter and an interval valued (is an element of, is an element of boolean OR q((k) over tilde))-fuzzy left (resp. right) filter are considered.", "paper_title": "More General Forms of Interval Valued Fuzzy Filters of Ordered Semigroups", "paper_id": "WOS:000322925500002"}