{"auto_keywords": [{"score": 0.004339293854115301, "phrase": "cognitive_deficiencies"}, {"score": 0.003910441483033426, "phrase": "interactive_media"}, {"score": 0.0038654774211631564, "phrase": "virtual_reality_technology"}, {"score": 0.003755307753574745, "phrase": "art_therapy"}, {"score": 0.0037121208432871118, "phrase": "relevant_pedagogical_techniques"}, {"score": 0.0036694287631595995, "phrase": "inspal"}, {"score": 0.0035855066449812273, "phrase": "sid_students'_pre-learning_abilities"}, {"score": 0.0034036089823450385, "phrase": "behavioral_interferences"}, {"score": 0.003287482882222731, "phrase": "social_interaction"}, {"score": 0.002548331088496964, "phrase": "marked_improvement"}, {"score": 0.002309408211203032, "phrase": "therapeutic_interventions"}, {"score": 0.0022696277881969896, "phrase": "better_control"}, {"score": 0.002129527338875116, "phrase": "greater_performance"}, {"score": 0.0021049977753042253, "phrase": "better_participation"}], "paper_keywords": ["Interactive media", " virtual reality", " severely intellectually disabled", " psychoeducational learning scenarios", " attachment theory", " triangular relationship", " sensitization"], "paper_abstract": "In this paper we introduce The Interactive Sensory Program for Affective Learning (InSPAL) a pioneering virtual learning programme designed for the severely intellectually disabled (SID) students, who are having cognitive deficiencies and other sensory-motor handicaps, and thus need more help and attention in overcoming their learning difficulties. Through combining and integrating interactive media and virtual reality technology with the principles of art therapy and relevant pedagogical techniques, InSPAL aims to strengthen SID students' pre-learning abilities, promote their self-awareness, decrease behavioral interferences with learning as well as social interaction, enhance their communication and thus promote their quality of life. Results of our study show that students who went through our programme were more focused, and the ability to do things more independently increased by 15%. Moreover, 50% of the students showed a marked improvement in the ability to raise their hands in response, thus increasing their communication skills. The use of therapeutic interventions enabled a better control to the body, mind and emotions, resulting a greater performance and better participation.", "paper_title": "InSPAL: A Novel Immersive Virtual Learning Programme", "paper_id": "WOS:000375005900024"}