{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "block_insertion"}, {"score": 0.012379191120219771, "phrase": "new_operations"}, {"score": 0.009255820318013936, "phrase": "second_one"}, {"score": 0.004610058444728656, "phrase": "new_framework"}, {"score": 0.0045198174374297285, "phrase": "language_operations"}, {"score": 0.004448892453489832, "phrase": "parallel_syntactical_constraint"}, {"score": 0.0035648266669315943, "phrase": "regular_and_context-free_languages"}, {"score": 0.003372658906684677, "phrase": "language_equation_problems"}, {"score": 0.0032804824152243106, "phrase": "first_one"}, {"score": 0.00246657044320953, "phrase": "trajectory_set"}, {"score": 0.0023990982005125763, "phrase": "third_problem"}, {"score": 0.002164216680934624, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Block insertion on trajectories", " Block deletion on trajectories", " Closure properties", " Language equations", " Decidability"], "paper_abstract": "In this paper, we introduce block insertion and deletion on trajectories, which provide us with a new framework to study properties of language operations. With the parallel syntactical constraint provided by trajectories, these operations properly generalize several sequential as well as parallel binary language operations such as catenation, sequential insertion, k-insertion, parallel insertion, quotient, sequential deletion, k-deletion, etc. We establish some relationships between the new operations and shuffle and deletion on trajectories, and obtain several closure properties of the families of regular and context-free languages under the new operations. Moreover, we obtain several decidability results of three types of language equation problems which involve the new operations. The first one is to answer, given languages L-1, L-2, L-3 and a trajectory set T. whether the result of an operation between L-1 and L-2 on the trajectory set T is equal to L-3. The second one is to answer, for three given languages L-1, L-2, L-3, whether there exists a set of trajectories such that the block insertion or deletion between L-1 and L-2 on this trajectory set is equal to L-3. The third problem is similar to the second one, but the language L-1 is unknown while languages L-2, L-3 as well as a trajectory set T are given. Crown Copyright (C) 2010 Published by Elsevier B.V. All rights reserved.", "paper_title": "Block insertion and deletion on trajectories", "paper_id": "WOS:000287295000009"}