{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "singular_intersections"}, {"score": 0.004672808182229058, "phrase": "third_part"}, {"score": 0.004476963405985556, "phrase": "exact_and_proper_parameterization"}, {"score": 0.004326188427877999, "phrase": "coordinate_functions"}, {"score": 0.004234532601573088, "phrase": "projective_space"}, {"score": 0.00385368199735867, "phrase": "distinct_square_roots"}, {"score": 0.0036448787596988423, "phrase": "small_number"}, {"score": 0.003537155405923517, "phrase": "real_type"}, {"score": 0.003388745581055085, "phrase": "extra_square_root"}, {"score": 0.0030573959252626695, "phrase": "type-detection_algorithm"}, {"score": 0.0027347937102326285, "phrase": "non-singular_quartic"}, {"score": 0.0025315664299815537, "phrase": "possible_real_types"}, {"score": 0.0024356742694508662, "phrase": "optimal_rational_parameterizations"}, {"score": 0.0022257833099336858, "phrase": "square_roots"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["intersection of surfaces", " pencils of quadrics", " curve parameterization", " singular intersections"], "paper_abstract": "We conclude, in this third part, the presentation of an algorithm for computing an exact and proper parameterization of the intersection of two quadrics. The coordinate functions of the parameterizations in projective space are polynomial, whenever it is possible. They are also near-optimal in the sense that the number of distinct square roots appearing in the coefficients of these functions is minimal except in a small number of cases (characterized by the real type of the intersection) where there may be an extra square root. Our algorithm builds on the classification of pencils of quadrics of P-3 (R) over the reals presented in Part II and the type-detection algorithm that we deduced from this classification. Moreover, since the algorithm presented in Part I is near-optimal when the intersection is a non-singular quartic, we focus here on the case where the intersection is singular and present, for all possible real types of intersection, algorithms for computing near-optimal rational parameterizations. We also give examples covering all the possible situations, in terms of both the real type of intersection and the number and depth of square roots appearing in the coefficients of the parameterizations. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Near-optimal parameterization of the intersection of quadrics: III. Parameterizing singular intersections", "paper_id": "WOS:000254366500004"}