{"auto_keywords": [{"score": 0.035620716932052585, "phrase": "external_q-measure"}, {"score": 0.00481495049065317, "phrase": "network_indicators"}, {"score": 0.004690305164360866, "phrase": "node's_brokerage_role"}, {"score": 0.004450568197899267, "phrase": "previous_studies"}, {"score": 0.004278807087784626, "phrase": "different_network_types"}, {"score": 0.003728000957725218, "phrase": "better_understanding"}, {"score": 0.003312486229143855, "phrase": "previously_defined_local_and_global_q-measure"}, {"score": 0.0027200305495826797, "phrase": "global_q-measure"}, {"score": 0.0026148807877309417, "phrase": "convex_decomposition"}, {"score": 0.0025638362414466278, "phrase": "local_and_external_q-measures"}, {"score": 0.002218668420806254, "phrase": "limited_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network theory", " Q-measures", " Betweenness centrality"], "paper_abstract": "Q-measures are network indicators that gauge a node's brokerage role between different groups in the network. Previous studies have focused on their definition for different network types and their practical application. Little attention has, however, been paid to their theoretical and mathematical characterization. In this article we contribute to a better understanding of Q-measures by studying some of their mathematical properties in the context of unweighted, undirected networks. An external Q-measure complementing the previously defined local and global Q-measure is introduced. We prove a number of relations between the values of the global, the local and the external Q-measure and betweenness centrality, and show how the global Q-measure can be rewritten as a convex decomposition of the local and external Q-measures. Furthermore, we formally characterize when Q-measures obtain their maximal value. It turns out that this is only possible in a limited number of very specific circumstances. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Mathematical properties of Q-measures", "paper_id": "WOS:000323859700019"}