{"auto_keywords": [{"score": 0.04896221231267542, "phrase": "machine_learning"}, {"score": 0.00481495049065317, "phrase": "physical_security"}, {"score": 0.004658426838467567, "phrase": "modern_surveillance_systems"}, {"score": 0.004614643339546038, "phrase": "practical_applications"}, {"score": 0.004571269461883144, "phrase": "diverse_and_mobile_sensors"}, {"score": 0.004299064805926241, "phrase": "unexpected_behaviors"}, {"score": 0.0040049806975968145, "phrase": "surveillance_system"}, {"score": 0.0033943947596098583, "phrase": "testing_process"}, {"score": 0.0033624514778823763, "phrase": "multiagent_systems"}, {"score": 0.003102752392819577, "phrase": "subject_system"}, {"score": 0.003015950477134494, "phrase": "high-dimensional_problem"}, {"score": 0.0027050595279115015, "phrase": "viable_testing_method"}, {"score": 0.002519739850807611, "phrase": "small-scale_model_system"}, {"score": 0.002449208093757498, "phrase": "real_physical_surveillance_systems"}, {"score": 0.002281376328251423, "phrase": "physical_system"}], "paper_keywords": ["testing multiagent systems", " surveillance"], "paper_abstract": "Modern surveillance systems for practical applications with diverse and mobile sensors are large, complex, and expensive. It is known that unexpected behaviors can emerge from such systems, and when these behaviors correspond to weaknesses in a surveillance system, we call them emergent vulnerabilities. Given their cost and importance to security, it is essential to test these systems for such vulnerabilities prior to deployment. To that end, we automate the testing process with multiagent systems and machine learning. However, the conventionaland most intuitive-approach is to focus the machine learning on the subject system, which leads to a high-dimensional problem that is intractable. Instead, we demonstrate in this paper that learning attacks on the system is tractable and provides a viable testing method. We demonstrate this with a series of studies in simulation and with a small-scale model system featuring elements typically found in real physical surveillance systems. Our machine learning method finds successful attacks in simulation, which we can duplicate with the physical system. The method is scalable, with the implication that it could be used to test larger, real surveillance installations.", "paper_title": "Automated Testing of Physical Security: Red Teaming Through Machine Learning", "paper_id": "WOS:000358608900004"}