{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "simple_programs"}, {"score": 0.00465944657565638, "phrase": "existing_systems"}, {"score": 0.004459857205489101, "phrase": "specific_set"}, {"score": 0.00441130431691048, "phrase": "data_types"}, {"score": 0.004363277689798392, "phrase": "domain-specific_language"}, {"score": 0.004176321608449849, "phrase": "program_synthesizer"}, {"score": 0.0040192915527630995, "phrase": "arbitrary_dsl"}, {"score": 0.0033363396054797044, "phrase": "expert-written_dsl_definition"}, {"score": 0.0030730639262332698, "phrase": "arbitrary_domains"}, {"score": 0.0029573932605287947, "phrase": "novel_iterative_synthesis_technique"}, {"score": 0.0029091587159002503, "phrase": "test-driven_development"}, {"score": 0.0027539714188091866, "phrase": "test-driven_synthesis"}, {"score": 0.002467957509922233, "phrase": "dsl"}, {"score": 0.002388043660169452, "phrase": "efficient_component-based_approach"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_dsl-specific_synthesizers"}], "paper_keywords": ["Languages", " Experimentation", " program synthesis", " end-user programming", " test driven development"], "paper_abstract": "Programming-by-example technologies empower end-users to create simple programs merely by providing input/output examples. Existing systems are designed around solvers specialized for a specific set of data types or domain-specific language (DSL). We present a program synthesizer which can be parameterized by an arbitrary DSL that may contain conditionals and loops and therefore is able to synthesize programs in any domain. In order to use our synthesizer, the user provides a sequence of increasingly sophisticated input/output examples along with an expert-written DSL definition. These two inputs correspond to the two key ideas that allow our synthesizer to work in arbitrary domains. First, we developed a novel iterative synthesis technique inspired by test-driven development-which also gives our technique the name of test-driven synthesis-where the input/output examples are consumed one at a time as the program is refined. Second, the DSL allows our system to take an efficient component-based approach to enumerating possible programs. We present applications of our synthesis methodology to end-user programming for transformations over strings, XML, and table layouts. We compare our synthesizer on these applications to state-of-the-art DSL-specific synthesizers as well to the general purpose synthesizer Sketch.", "paper_title": "Test-Driven Synthesis", "paper_id": "WOS:000344455800043"}