{"auto_keywords": [{"score": 0.029265192379839308, "phrase": "best_practices"}, {"score": 0.014226641348679205, "phrase": "beginning_set"}, {"score": 0.013686978219457127, "phrase": "health_it_implementation_body"}, {"score": 0.00481495049065317, "phrase": "health_it-knowledge_gaps"}, {"score": 0.004497008230182996, "phrase": "-_the_barriers"}, {"score": 0.004424441580112395, "phrase": "successful_implementation"}, {"score": 0.004092026656771699, "phrase": "future_study"}, {"score": 0.003999843765164458, "phrase": "literature_review"}, {"score": 0.00392247796545626, "phrase": "six_health_it_related_implementation"}, {"score": 0.0037233873559427847, "phrase": "montreal"}, {"score": 0.0036276389022283427, "phrase": "implementation_research"}, {"score": 0.0035228596881051763, "phrase": "six_best_practices"}, {"score": 0.003257960296952439, "phrase": "standardized_implementation_processes"}, {"score": 0.0030425153622841822, "phrase": "health_it_implementation"}, {"score": 0.002973904674745238, "phrase": "global_diversity"}, {"score": 0.0026619761089539595, "phrase": "health_it_innovations"}, {"score": 0.0026189428303175664, "phrase": "implementation_setting"}, {"score": 0.002585016334273749, "phrase": "close_assessment"}, {"score": 0.0022838006190016263, "phrase": "health_it_implementation_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Implementation science", " Complexity Implementation of health", " information technology", " Consolidated framework for implementation research"], "paper_abstract": "Objectives: The intent of this paper is in the examination of health IT implementation processes - the barriers to and facilitators of successful implementation, identification of a beginning set of implementation best practices, the identification of gaps in the health IT implementation body of knowledge, and recommendations for future study and application. Methods: A literature review resulted in the identification of six health IT related implementation best practices which were subsequently debated and clarified by participants attending the NI2012 Research Post Conference held in Montreal in the summer of 2012. Using the framework for implementation research (CFIR) to guide their application, the six best practices were applied to two distinct health IT implementation studies to assess their applicability. Results: Assessing the implementation processes from two markedly diverse settings illustrated both the challenges and potentials of using standardized implementation processes. In support of what was discovered in the review of the literature, \"one size fits all\" in health IT implementation is a fallacy, particularly when global diversity is added into the mix. At the same time, several frameworks show promise for use as \"scaffolding\" to begin to assess best practices, their distinct dimensions, and their applicability for use. Conclusions: Health IT innovations, regardless of the implementation setting, requires a close assessment of many dimensions. While there is no \"one size fits all\", there are commonalities and best practices that can be blended, adapted, and utilized to improve the process of implementation. This paper examines health IT implementation processes and identifies a beginning set of implementation best practices, which could begin to address gaps in the health IT implementation body of knowledge. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Complexity and the science of implementation in health IT-Knowledge gaps and future visions", "paper_id": "WOS:000339735700002"}