{"auto_keywords": [{"score": 0.03394009994668228, "phrase": "recurrent_elements"}, {"score": 0.031885643417955634, "phrase": "candidate_patterns"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record-driven_phenotype_extraction_algorithms"}, {"score": 0.004577869668211548, "phrase": "software_development"}, {"score": 0.004473982381245469, "phrase": "generalized_approaches"}, {"score": 0.004253618550301311, "phrase": "common_situations"}, {"score": 0.004025531820226182, "phrase": "biomedical_literature"}, {"score": 0.003988719758707836, "phrase": "broad_coverage"}, {"score": 0.0039522429946090174, "phrase": "specific_phenotype_algorithm_implementations"}, {"score": 0.0037747835341722636, "phrase": "common_approaches"}, {"score": 0.0037402558657576124, "phrase": "design_patterns"}, {"score": 0.0035887342563437935, "phrase": "informatics_community"}, {"score": 0.0034433297275344877, "phrase": "phenotyping_algorithms"}, {"score": 0.00338060449446278, "phrase": "phenotype_knowledgebase"}, {"score": 0.0032585499655442404, "phrase": "independent_iterative_review"}, {"score": 0.0031699005399973496, "phrase": "algorithm_definitions"}, {"score": 0.00286493504971388, "phrase": "group_consensus"}, {"score": 0.0025892330566358503, "phrase": "phekb"}, {"score": 0.002318566141177149, "phrase": "online_data_supplement"}, {"score": 0.0021049977753042253, "phrase": "experienced_and_novice_algorithm_developers"}], "paper_keywords": ["Electronic health record", " Phenotype", " Algorithms", " Software design", " Design patterns"], "paper_abstract": "Background: Design patterns, in the context of software development and ontologies, provide generalized approaches and guidance to solving commonly occurring problems, or addressing common situations typically informed by intuition, heuristics and experience. While the biomedical literature contains broad coverage of specific phenotype algorithm implementations, no work to date has attempted to generalize common approaches into design patterns, which may then be distributed to the informatics community to efficiently develop more accurate phenotype algorithms. Methods: Using phenotyping algorithms stored in the Phenotype KnowledgeBase (PheKB), we conducted an independent iterative review to identify recurrent elements within the algorithm definitions. We extracted and generalized recurrent elements in these algorithms into candidate patterns. The authors then assessed the candidate patterns for validity by group consensus, and annotated them with attributes. Results: A total of 24 electronic Medical Records and Genomics (eMERGE) phenotypes available in PheKB as of 1/25/2013 were downloaded and reviewed. From these, a total of 21 phenotyping patterns were identified, which are available as an online data supplement. Conclusions: Repeatable patterns within phenotyping algorithms exist, and when codified and cataloged may help to educate both experienced and novice algorithm developers. The dissemination and application of these patterns has the potential to decrease the time to develop algorithms, while improving portability and accuracy. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Design patterns for the development of electronic health record-driven phenotype extraction algorithms", "paper_id": "WOS:000343362800027"}