{"auto_keywords": [{"score": 0.04682254053814276, "phrase": "eii"}, {"score": 0.015719707847180738, "phrase": "enterprise_information"}, {"score": 0.009046376602167264, "phrase": "basic_integration_principles"}, {"score": 0.004282393209585869, "phrase": "sgii"}, {"score": 0.004183137595671171, "phrase": "first_system_undertaking_research"}, {"score": 0.0040622852274783275, "phrase": "semantic_grid"}, {"score": 0.0038761135052054765, "phrase": "common_framework"}, {"score": 0.003676811616723809, "phrase": "eii."}, {"score": 0.0035082436540296406, "phrase": "semantic_grid_technologies"}, {"score": 0.003447035529485425, "phrase": "current_eii_systems"}, {"score": 0.002941913249957503, "phrase": "fundamental_formal_architecture"}, {"score": 0.0026781477395106993, "phrase": "semantic_grid_perspectives"}, {"score": 0.0026313840069327713, "phrase": "key_contributions"}, {"score": 0.0021677478798910565, "phrase": "ogsa-dai_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "added_value"}], "paper_keywords": [""], "paper_abstract": "To overcome the challenges of EII (Enterprise Information integration), we propose SGII which is the first system undertaking research at the intersection of semantic grid and P2P data integration, exploiting their strengths in a common framework, and expanding their applicability in the area of EII. We first discuss how the P2P and semantic grid technologies can drive current EII systems to a new decentralized, flexible, scalable system based on a short survey of the state of the art of EII and its current challenges. Then, through a discussion of the fundamental formal architecture in general and its components in particular, we depict the basic integration principles from both P2P and semantic grid perspectives. The key contributions of this paper are a P2P semantic grid service oriented framework for EII, which mainly consists of three semantic grid services (data peer, semantic peer and application peer services); basic integration principles, which is compatible with OGSA-DAI infrastructure and P2P data integration paradigm; and added value over the state of the art of EII.", "paper_title": "Semantic integration of enterprise information: Challenges and basic principles", "paper_id": "WOS:000241446800023"}