{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "analytical_structure"}, {"score": 0.008565261303245406, "phrase": "fuzzy_controllers"}, {"score": 0.007289553582273042, "phrase": "conventional_controller"}, {"score": 0.004783892955268842, "phrase": "broad_class"}, {"score": 0.004763298772005349, "phrase": "typical_interval"}, {"score": 0.004455143595587971, "phrase": "black-box_function_generator"}, {"score": 0.0044168553307007774, "phrase": "desired_nonlinear_mapping"}, {"score": 0.004280832663687551, "phrase": "pd"}, {"score": 0.004239412819784417, "phrase": "mathematical_expression"}, {"score": 0.004122112628377632, "phrase": "controller_designer"}, {"score": 0.004077862777903554, "phrase": "sharp_contrast"}, {"score": 0.0039055443384042156, "phrase": "starting_point"}, {"score": 0.003888716583847811, "phrase": "system_analysis"}, {"score": 0.003559243803680866, "phrase": "pid"}, {"score": 0.0034681690067096043, "phrase": "safety-critical_fields"}, {"score": 0.0033867360132849183, "phrase": "well-developed_nonlinear_control_theory"}, {"score": 0.003343124103221387, "phrase": "design_methods"}, {"score": 0.003215618372787532, "phrase": "rigorous_comparative_exploration"}, {"score": 0.0030203108210358704, "phrase": "innovative_technique"}, {"score": 0.00295574305768785, "phrase": "wide_class"}, {"score": 0.002824595867926253, "phrase": "related_efforts"}, {"score": 0.002676013568713519, "phrase": "zadeh_and_operator"}, {"score": 0.0026644693023365348, "phrase": "karnik-mendel"}, {"score": 0.002630133669333306, "phrase": "type_reducer"}, {"score": 0.0025572462249276885, "phrase": "derivation_method"}, {"score": 0.002535227277382615, "phrase": "general_setting"}, {"score": 0.002315142631088735, "phrase": "variable_proportional_gain"}, {"score": 0.0023001721617535408, "phrase": "variable_integral_gain"}, {"score": 0.002285298274629352, "phrase": "derivative_gain"}, {"score": 0.002231577021972267, "phrase": "input_fuzzy_sets"}, {"score": 0.002221945773986061, "phrase": "piecewise_linear"}, {"score": 0.002123288049106791, "phrase": "new_discovery"}, {"score": 0.0021049977753042253, "phrase": "current_literature"}], "paper_keywords": ["Fuzzy control", " input-output relation", " structure derivation", " type-2 (T2) fuzzy logic"], "paper_abstract": "Type-2 (T2) fuzzy controllers are emerging as the related T2 fuzzy logic, and algorithms have recently been advancing rapidly. At present, a T2 fuzzy controller is viewed and used as a black-box function generator that produces a desired nonlinear mapping between the input and output of the controller (we call the mapping analytical structure). The mathematical expression of the analytical structure, however, is not explicitly known to the controller designer. This is in sharp contrast with the analytical structure of a conventional controller, which is not only always explicitly known, but serves as a starting point for system analysis and design. Obviously, the knowledge of a T2 fuzzy controller's analytical structure can have significant benefits. They include 1) understanding more precisely how the controller works in the same sense as we understand how a conventional controller (e. g., the PID controller) functions; 2) making T2 fuzzy control more acceptable to safety-critical fields such as biomedicine; 3) taking advantage of the well-developed nonlinear control theory to develop better analysis and design methods for T2 control systems (e. g., less conservative system stability criteria); and 4) permitting rigorous comparative exploration on differences between the T2 and type-1 (T1) fuzzy controllers and their relative merits and pitfalls (e. g., performance and structural complexity). In this paper, we develop an innovative technique which is capable of deriving the analytical structure for a wide class of interval T2 Mamdani fuzzy controllers. The configuration of the controllers is typical and is substantially more general than the related efforts in the literature. It uses any number and types of interval T2 input fuzzy sets, any number and types of general or interval T2 output fuzzy sets, arbitrary fuzzy rules, Zadeh AND operator, Karnik-Mendel center-of-sets type reducer, and the centroid defuzzifier. We show in detail how the derivation method works in a general setting and provide the analytical structure of an example T2 controller as well. In addition, we utilize the method to prove that a subset of the T2 fuzzy controllers are the sum of two nonlinear PI (or PD) controllers, each of which has a variable proportional gain and a variable integral gain (or derivative gain) plus a variable offset if and only if the input fuzzy sets are piecewise linear (e. g., triangular and/or trapezoidal). The sum of the two nonlinear PI (or PD) controllers is a new discovery relative to the current literature.", "paper_title": "A Method for Deriving the Analytical Structure of a Broad Class of Typical Interval Type-2 Mamdani Fuzzy Controllers", "paper_id": "WOS:000319930000005"}