{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "review"}, {"score": 0.004657542074154025, "phrase": "multiple_instance_learning"}, {"score": 0.0045052562941109734, "phrase": "important_topic"}, {"score": 0.004441517985511521, "phrase": "pattern_recognition_community"}, {"score": 0.004000741805312148, "phrase": "comparative_studies"}, {"score": 0.0037969755088553326, "phrase": "different_methods"}, {"score": 0.003603549914861701, "phrase": "classification_task"}, {"score": 0.0032766780632972363, "phrase": "fourteen_methods"}, {"score": 0.003036595866130994, "phrase": "well-known_databases"}, {"score": 0.002923214590192792, "phrase": "synthetic_scenarios"}, {"score": 0.002570817338292482, "phrase": "clearly_superior_performance"}, {"score": 0.0021659920594094407, "phrase": "new_mil_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-instance learning", " Codebook", " Bag-of-Words"], "paper_abstract": "Multiple Instance Learning (MIL) has become an important topic in the pattern recognition community, and many solutions to this problem have been proposed until now. Despite this fact, there is a lack of comparative studies that shed light into the characteristics and behavior of the different methods. In this work we provide such an analysis focused on the classification task (i.e., leaving out other learning tasks such as regression). In order to perform our study, we implemented fourteen methods grouped into three different families. We analyze the performance of the approaches across a variety of well-known databases, and we also study their behavior in synthetic scenarios in order to highlight their characteristics. As a result of this analysis, we conclude that methods that extract global bag-level information show a clearly superior performance in general. In this sense, the analysis permits us to understand why some types of methods are more successful than others, and it permits us to establish guidelines in the design of new MIL methods. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Multiple instance classification: Review, taxonomy and comparative study", "paper_id": "WOS:000322856100004"}