{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fine-grained_access_control"}, {"score": 0.004597244847332915, "phrase": "virtual_organization_environment"}, {"score": 0.004218602458288531, "phrase": "different_administrative_domains"}, {"score": 0.0041084684278314305, "phrase": "dissimilar_security_policies"}, {"score": 0.003845500924733243, "phrase": "flexible_authentication_framework"}, {"score": 0.0035755653799043, "phrase": "authentication_strengths"}, {"score": 0.003482160257566501, "phrase": "authentication_methods"}, {"score": 0.0033025823350563087, "phrase": "access-control_decision-making_process"}, {"score": 0.003010250522930773, "phrase": "stronger_methods"}, {"score": 0.002707620139970122, "phrase": "adaptive_authentication_and_authentication_strength"}, {"score": 0.0024192592458651204, "phrase": "shibboleth_and_permis_infrastructures"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["authentication", " authorization", " virtual organization", " Shibboleth", " PERMIS", " smart tokens"], "paper_abstract": "In a virtual organization environment, where services and data are provided and shared among organizations from different administrative domains and protected with dissimilar security policies and measures, there is a need for a flexible authentication framework that supports the use of various authentication methods and tokens. The authentication strengths derived from the authentication methods and tokens should be incorporated into an access-control decision-making process, so that more sensitive resources are available only to users authenticated with stronger methods. This paper reports our ongoing efforts in designing and implementing such a framework to facilitate multi-level and multi-factor adaptive authentication and authentication strength linked fine-grained access control. The proof-of-concept prototype is designed and implemented in the Shibboleth and PERMIS infrastructures, which specifies protocols to federate authentication and authorization information and provides a policy-driven, role-based, access-control decision-making capability. Copyright (c) 2006 John Wiley & Sons, Ltd.", "paper_title": "Achieving fine-grained access control in virtual organizations", "paper_id": "WOS:000248371000007"}