{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer-aided_design"}, {"score": 0.042309036047671555, "phrase": "design_fixation"}, {"score": 0.04166278199109337, "phrase": "idea_generation"}, {"score": 0.03056279068001877, "phrase": "cad_representations"}, {"score": 0.0035150223642728437, "phrase": "effective_example"}, {"score": 0.0032793933580835574, "phrase": "photograph_representations"}, {"score": 0.0028543298631502107, "phrase": "engineering_designers"}, {"score": 0.0027643161113894018, "phrase": "key_effective_features"}, {"score": 0.0026914710445743693, "phrase": "cad_and_photo_representations"}, {"score": 0.0026345758986796703, "phrase": "higher_quality"}, {"score": 0.00260657976055413, "phrase": "design_concepts"}, {"score": 0.0022806798371116698, "phrase": "greatest_advantages"}, {"score": 0.0022444104439449737, "phrase": "idea_generation_process"}, {"score": 0.0021276181317652163, "phrase": "analogical_databases"}, {"score": 0.0021049977753042253, "phrase": "effective_design_examples"}], "paper_keywords": ["Analogy", " Design Fixation", " Design Representation", " Sketching"], "paper_abstract": "Many tools are being developed to assist designers in retrieving analogies. One critical question these designers face is how these analogues should be represented in order to minimize design fixation and maximize idea generation. To address this question, an experiment is presented that compares various representations' influence on creativity and design fixation. This experiment presents an effective example (analogue) as computer-aided design (CAD), sketch, or photograph representations. We found that all representations induced fixation, and the degree of fixation did not vary significantly. We also found that CAD representations encourage engineering designers to identify and copy the key effective features of the example. CAD and photo representations also produced a higher quality of design concepts. Results from this experiment offer insights into how these various representations may be used in examples during idea generation; CAD representations appear to offer the greatest advantages during the idea generation process. The results from this experiment also indicate that analogical databases of effective design examples should include CAD and photolike images of the analogue rather than sketches.", "paper_title": "Representing analogies to influence fixation and creativity: A study comparing computer-aided design, photographs, and sketches", "paper_id": "WOS:000354032400004"}