{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mental_health_problems"}, {"score": 0.004294052530714228, "phrase": "available_treatments"}, {"score": 0.004230382915464492, "phrase": "best_chance"}, {"score": 0.0040854526743211396, "phrase": "difficult_decision"}, {"score": 0.0037350832473790007, "phrase": "patient's_diagnosis"}, {"score": 0.003661382948704217, "phrase": "social_environment"}, {"score": 0.0035358770665604657, "phrase": "successful_treatment"}, {"score": 0.0033306180744375616, "phrase": "case-based_reasoning_approach"}, {"score": 0.0031686717525002935, "phrase": "anxiety_disorders"}, {"score": 0.0029698211157405618, "phrase": "high_level"}, {"score": 0.002797329638474873, "phrase": "professional_mental_healthcare_centre"}, {"score": 0.002701361707441567, "phrase": "success_factor"}, {"score": 0.0022460727898764216, "phrase": "success_rate"}], "paper_keywords": ["case-based reasoning", " prediction", " forecasting-by-analogy", " weighted voting", " information gain", " nearest neighbour method", " accuracy", " mental health care", " treatment outcome", " anxiety disorders"], "paper_abstract": "For patients with mental health problems, various treatments exist. Before a treatment is assigned to a patient, a team of clinicians must decide which of the available treatments has the best chance of succeeding. This is a difficult decision to make, as the effectiveness of a treatment might depend on various factors, such as the patient's diagnosis, background and social environment. Which factors are the predictors for successful treatment is mostly unknown. In this article, we present a case-based reasoning approach for predicting the effect of treatments for patients with anxiety disorders. We investigated which techniques are suitable for implementing such a system to achieve a high level of accuracy. For our evaluation, we used data from a professional mental healthcare centre. Our application correctly predicted the success factor of 65% of the cases, which is significantly higher than the prediction of the baseline of 55%. Under the condition that the prediction was based on only cases with a similarity of at least 0.62, the success rate of 80% of the cases was predicted correctly. These results warrant further development of the system.", "paper_title": "Case-based reasoning for predicting the success of therapy", "paper_id": "WOS:000352546200001"}