{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "programming_assignments"}, {"score": 0.010323801747646492, "phrase": "oto"}, {"score": 0.00471193241675062, "phrase": "programming_courses"}, {"score": 0.004435006247087171, "phrase": "source_code"}, {"score": 0.004228839109569368, "phrase": "large_classes"}, {"score": 0.003665874747419775, "phrase": "administrative_aspects"}, {"score": 0.003602922164562919, "phrase": "program_testing"}, {"score": 0.0035410467987580484, "phrase": "source_code_evaluation"}, {"score": 0.003029722317983915, "phrase": "marking_task"}, {"score": 0.0029392020223716966, "phrase": "timely_feedback"}, {"score": 0.0028267701593809877, "phrase": "final_submission"}, {"score": 0.0026146109167103655, "phrase": "marking_process"}, {"score": 0.0025808284847319528, "phrase": "specific_assignment"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["educational software", " automated marking", " unit testing"], "paper_abstract": "Marking programming assignments in programming courses involves a lot of work: each program must he tested, the source code must be read and evaluated, etc. With the large classes encountered nowadays, the feedback provided to students through marking is thus rather limited, and often late. Tools providing support for marking programming assignments do exist, ranging from support for administrative aspects through automation of program testing or support for source code evaluation based on metrics. In this paper, we introduce a tool, called Oto, that provides support for submission and marking of assignments. Oto aims at reducing the workload associated with the marking task. Oto also aims at providing timely feedback to the students, including feedback before the final submission. Furthermore, the tool has been designed to be generic and extensible, so that the marking process for a specific assignment can easily be customized and the tool can be extended with various marking components (modules) that allows it to deal with various aspects of marking (testing, style, structure, etc.) and with programs written in various programming languages. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "Oto, a generic and extensible tool for marking programming assignments", "paper_id": "WOS:000254679000003"}