{"auto_keywords": [{"score": 0.04682254053814278, "phrase": "mss"}, {"score": 0.0183583679675196, "phrase": "multiple_pscs"}, {"score": 0.009259284594168297, "phrase": "psc"}, {"score": 0.00481495049065317, "phrase": "managing_power_saving_classes"}, {"score": 0.004551563730037998, "phrase": "power_management"}, {"score": 0.004394281902031765, "phrase": "important_issue"}, {"score": 0.004287415750101536, "phrase": "power_saving_classes"}, {"score": 0.004081385289516914, "phrase": "multiple_flows"}, {"score": 0.0037508743235608872, "phrase": "better_energy_efficiency"}, {"score": 0.0032812562034088646, "phrase": "unavailability_intervals"}, {"score": 0.0030153435879168634, "phrase": "novel_fold-and-demultiplex_method"}, {"score": 0.002850116748762153, "phrase": "earliest-next-bandwidth-first_packet_scheduler"}, {"score": 0.0027225413530200505, "phrase": "fold-and-demultiplex_method"}, {"score": 0.0025106241866273897, "phrase": "total_bandwidth_requirement"}, {"score": 0.0023480317852018133, "phrase": "high_energy_efficiency"}, {"score": 0.0023070189467375374, "phrase": "flows'_bandwidth_requirements"}, {"score": 0.0022507989506447413, "phrase": "real-time_flows'_delay_constraints"}, {"score": 0.002142426911242168, "phrase": "first_result"}, {"score": 0.0021198904828154657, "phrase": "packet_delays"}, {"score": 0.0021049977753042253, "phrase": "mss's_sleep-and-listen_behaviors"}], "paper_keywords": ["IEEE 802.16", " link protocol", " MAC protocol", " packet schedule", " power management", " WiMAX", " wireless network"], "paper_abstract": "In IEEE 802.16, power management at the Mobile Subscriber Station (MSS) side is always an important issue. The standard defines three types of power saving classes (PSCs). A PSC can bind one or multiple traffic flows. However, given multiple flows in an MSS, the standard does not define how to form PSCs, how to organize the cooperation of multiple PSCs to obtain better energy efficiency, and how to guarantee QoS of these flows. Given a set of flows and their QoS parameters, the objective of this paper is to define multiple PSCs and their listen-and-sleep-related parameters and packet-scheduling policy such that the unavailability intervals of the MSS can be maximized and the QoS of each flow can be guaranteed. To achieve this, we propose a novel fold-and-demultiplex method for an IEEE 802.16 network with PSCs of types I and II together with an earliest-next-bandwidth-first packet scheduler. Given a set of traffic flows in an MSS, the fold-and-demultiplex method first gives each flow a tentative PSC satisfying its bandwidth requirement. Then we fold them together into one long series so as to calculate the total bandwidth requirement. Finally, we demultiplex the series into multiple PSCs, each supporting one or multiple flows. It ends up with high energy efficiency of MSSs while meets flows' bandwidth requirements. Furthermore, our packet scheduler ensures that real-time flows' delay constraints can be met. To the best of our knowledge, this is the first result offering bounded packet delays under MSS's sleep-and-listen behaviors.", "paper_title": "Managing Power Saving Classes in IEEE 802.16 Wireless MANs: A Fold-and-Demultiplex Method", "paper_id": "WOS:000292881600004"}