{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "community_mining"}, {"score": 0.004780030485538593, "phrase": "distributed_and_dynamic_networks"}, {"score": 0.004728122501822142, "phrase": "network_community"}, {"score": 0.0046597835420572825, "phrase": "special_type"}, {"score": 0.004625983640628956, "phrase": "network_structure"}, {"score": 0.004428248351415723, "phrase": "similar_properties"}, {"score": 0.0037179893149669845, "phrase": "centralized_manner"}, {"score": 0.0035459819741057836, "phrase": "real_world"}, {"score": 0.0031787077057214086, "phrase": "existing_methods"}, {"score": 0.00289123004877327, "phrase": "dynamic_updates"}, {"score": 0.0027674397462322435, "phrase": "mining_communities"}, {"score": 0.002737327060030586, "phrase": "distributed_and_dynamic_network"}, {"score": 0.002678078466226442, "phrase": "previous_ones"}, {"score": 0.002591595184168144, "phrase": "self-organizing_agent_networks"}, {"score": 0.0025447584328314754, "phrase": "autonomy-oriented_computing"}, {"score": 0.0024715695446993107, "phrase": "network_communities"}, {"score": 0.002444668348634501, "phrase": "aoc-based_method"}, {"score": 0.0023570895666021664, "phrase": "community_structures"}, {"score": 0.0023314314877152494, "phrase": "distributed_and_dynamically_evolving_network"}, {"score": 0.0022397131088479514, "phrase": "detailed_formulations"}, {"score": 0.002167355210897559, "phrase": "real-world_benchmark_networks"}, {"score": 0.0021359494324422997, "phrase": "synthetic_networks"}], "paper_keywords": ["Social networks", " Distributed networks", " Community mining", " Autonomy-oriented computing", " Self-organization", " Agent networks", " Multi-agent systems"], "paper_abstract": "A network community refers to a special type of network structure that contains a group of nodes connected based on certain relationships or similar properties. Our ability to mine communities hidden inside networks will readily enable us to effectively understand and exploit such networks. So far, various methods and algorithms have been developed to perform the task of community mining, where it is often required that the networks are processed in a centralized manner, and their structures will not dynamically change. However, in the real world, many applications involve distributed and dynamically evolving networks, in which resources and controls are not only decentralized but also updated frequently. It would be difficult for the existing methods to deal with these types of networks since their global topological representations are either not available or too hard to obtain due to their huge size, decentralization, and/or dynamic updates. The aim of our work is to address the problem of mining communities from a distributed and dynamic network. It differs from the previous ones in that here we introduce the notion of self-organizing agent networks, and provide an autonomy-oriented computing (AOC) approach to distributed and incremental mining of network communities. The AOC-based method utilizes reactive agents that can collectively detect and update community structures in a distributed and dynamically evolving network, based only on their local views and interactions. While providing detailed formulations, we present the results of our systematic validations using real-world benchmark networks as well as synthetic networks that include a distributed intelligent Portable Digital Assistant (iPDA) network example.", "paper_title": "An autonomy-oriented computing approach to community mining in distributed and dynamic networks", "paper_id": "WOS:000273978500002"}