{"auto_keywords": [{"score": 0.04046992388012361, "phrase": "query_name"}, {"score": 0.00481495049065317, "phrase": "person_queries"}, {"score": 0.004765482708043842, "phrase": "large_news_video_collections"}, {"score": 0.004596295252559861, "phrase": "mufti-modal_structure"}, {"score": 0.0039772848945723435, "phrase": "speech_transcript_text"}, {"score": 0.0037188360359702182, "phrase": "similarity_graph"}, {"score": 0.003513264130359459, "phrase": "search_space"}, {"score": 0.0028567126120064546, "phrase": "densest_component"}, {"score": 0.0024842242921857705, "phrase": "unsupervised_way"}, {"score": 0.002358932061089357, "phrase": "nist"}, {"score": 0.00226322835801988, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "large_scale"}], "paper_keywords": [""], "paper_abstract": "We propose a graph based method to improve the performance of person queries in large news video collections. The method benefits from the mufti-modal structure of videos and integrates text and face information. Using the idea that a person appears more frequently when his/her name is mentioned, we first use the speech transcript text to limit our search space for a query name. Then, we construct a similarity graph with nodes corresponding to all of the faces in the search space, and the edges corresponding to similarity of the faces. With the assumption that the images of the query name will be more similar to each other than to other images, the problem is then transformed into finding the densest component in the graph corresponding to the images of the query name. The same graph algorithm is applied for detecting and removing the faces of the anchorpeople in an unsupervised way. The experiments are conducted on 229 news videos provided by NIST for TRECVID 2004. The results show that proposed method outperforms the text only based methods and provides cues for recognition of faces on the large scale.", "paper_title": "Finding people frequently appearing in news", "paper_id": "WOS:000239566500018"}