{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "diagnostic_fault_simulation"}, {"score": 0.02790993171214505, "phrase": "test_generation"}, {"score": 0.01798798180656692, "phrase": "fault_detection_test"}, {"score": 0.007563265138233502, "phrase": "diagnostic_test_generation"}, {"score": 0.0038597866217852353, "phrase": "test_sets"}, {"score": 0.003819339842998955, "phrase": "test_sequences"}, {"score": 0.0034013521529056715, "phrase": "structural_circuit_characteristics"}, {"score": 0.0027258422018680453, "phrase": "experimental_results"}, {"score": 0.002613239644974825, "phrase": "full-scan_benchmark_circuits"}, {"score": 0.0021385822825864425, "phrase": "conventional_fault_simulation"}, {"score": 0.0021049977753042253, "phrase": "additional_fault_pairs"}], "paper_keywords": ["defect diagnosis", " diagnostic fault simulation", " diagnostic test generation", " scan circuits"], "paper_abstract": "Diagnostic fault simulation is used to determine the pairs of faults distinguished by a given test set or test sequence. Diagnostic test generation is used to generate tests that distinguish pairs of faults. Typically, the test sets or test sequences contain tests that detect all the detectable target faults. In this paper, a framework for diagnostic fault simulation and test generation is described, based on structural circuit characteristics called z-sets. These characteristics are used to show that certain fault pairs are guaranteed to be distinguished by a fault detection test set. Such fault pairs do not need to be considered during diagnostic fault simulation or test generation that starts from a fault detection test set. Experimental results for single stuck-at faults in full-scan benchmark circuits demonstrate that only small percentages of fault pairs need to be considered during diagnostic fault simulation or test generation once a fault detection test set is available. The concept of z-sets is extended to define z-detections. This concept uses the results of conventional fault simulation to determine additional fault pairs that are guaranteed to be distinguished by a fault detection test set. The concept of z-sets is also extended to define difference-sets (or d-sets) that provide even. fewer targets for diagnostic test generation.", "paper_title": "z-diagnosis: a framework for diagnostic fault simulation and test generation utilizing subsets of outputs", "paper_id": "WOS:000249309200014"}