{"auto_keywords": [{"score": 0.03050708679163187, "phrase": "cms"}, {"score": 0.010611606064748237, "phrase": "collaboration_moderator_services"}, {"score": 0.010150694530980366, "phrase": "collaborative_networks"}, {"score": 0.009356570925870045, "phrase": "effective_knowledge_sharing"}, {"score": 0.004691136491297242, "phrase": "knowledge_sharing"}, {"score": 0.0046390482426405324, "phrase": "major_challenge"}, {"score": 0.004274257668843717, "phrase": "critical_aspect"}, {"score": 0.004211069233133584, "phrase": "virtual_organizations"}, {"score": 0.0039674831861175935, "phrase": "particular_context"}, {"score": 0.00389427992231721, "phrase": "efficient_tools"}, {"score": 0.0030338645940033875, "phrase": "possible_consequences"}, {"score": 0.0029889584492584073, "phrase": "increased_awareness"}, {"score": 0.0026626797255348287, "phrase": "users'_awareness"}, {"score": 0.0026232532659260033, "phrase": "problem_areas"}, {"score": 0.002499094513009327, "phrase": "system_architecture"}, {"score": 0.002398627220761343, "phrase": "synergy_system"}, {"score": 0.002345535736297701, "phrase": "interoperable_service_utilities"}, {"score": 0.002268088741853586, "phrase": "complex_knowledge_collaborations"}, {"score": 0.002193193339812606, "phrase": "individual_organizations"}, {"score": 0.002128694000627911, "phrase": "vo_lifecycle"}, {"score": 0.0021049977753042253, "phrase": "different_functionalities"}], "paper_keywords": ["Knowledge sharing", " Moderator", " Mediator", " Virtual organization", " Collaboration pool", " Collaboration moderator service (CMS)", " SYNERGY", " Collaborative networked organization"], "paper_abstract": "Knowledge sharing is a major challenge for collaborative networks and is essential to improve the productivity and quality of decisions taken by both collaborative networks and their member organisations. A critical aspect of effective knowledge sharing within virtual organizations (VOs) is the identification of the most appropriate knowledge for reuse or exploitation in a particular context, as this requires efficient tools and mechanisms for its identification, sharing or transfer. Additionally, partners need to be aware of when knowledge needs to be shared, the implications of doing so and when their decisions are likely to affect other partners within the collaboration. Therefore, tools and methods are needed for identification, acquisition, maintenance and evolution of knowledge and to support effective knowledge sharing which includes awareness of possible consequences of actions and increased awareness of other partner's needs during the collaboration. The Collaboration Moderator Services (CMS) are designed to address these issues relating to knowledge based collaboration by providing a set of functionalities to raise users' awareness of opportunities, problem areas and lessons learnt from and during collaborations. This paper presents the system architecture and specifications of the CMS within the context of the SYNERGY system, whose purpose is to offer interoperable service utilities to help enterprises plan, setup and run complex knowledge collaborations. The CMS are designed to support both individual organizations and collaborations as a whole throughout the VO lifecycle and the different functionalities provided by CMS to achieve this are discussed in this paper.", "paper_title": "A framework for collaboration moderator services to support knowledge based collaboration", "paper_id": "WOS:000308820200041"}