{"auto_keywords": [{"score": 0.0313052017630271, "phrase": "adoption_behaviour"}, {"score": 0.015719716506582538, "phrase": "consumer_adoption"}, {"score": 0.00908842421627242, "phrase": "uk_households"}, {"score": 0.004447509888681154, "phrase": "successful_strategy"}, {"score": 0.004213123914295882, "phrase": "sustainable_business_model"}, {"score": 0.004122850924351265, "phrase": "detailed_understanding"}, {"score": 0.003976656675903324, "phrase": "future_customers"}, {"score": 0.0036597104126905437, "phrase": "survey_research_approach"}, {"score": 0.0032957163929772716, "phrase": "conditions_resources"}, {"score": 0.003088178133049113, "phrase": "uk._findings_-_results"}, {"score": 0.003011033940247791, "phrase": "hedonic_outcomes"}, {"score": 0.002558985036330194, "phrase": "longitudinal_study"}, {"score": 0.0024503217593801587, "phrase": "obtained_results"}, {"score": 0.002238500096284007, "phrase": "future_research_activity"}, {"score": 0.002151183757599893, "phrase": "doctoral_research"}, {"score": 0.0021049977753042253, "phrase": "initial_efforts"}], "paper_keywords": ["Consumer behaviour", " Broadband networks", " Internet", " United Kingdom"], "paper_abstract": "Purpose - The commonly used internet service provider's (ISP) business models based on price comparison may prove to be a successful strategy for organisations in the short-term. However, it may be argued that a sustainable business model for the long-term requires a detailed understanding of the various factors that may help ISPs in attracting future customers. The purpose of this paper is to examine the drivers and barriers of consumer adoption of broadband in the UK. Design/methodology/approach - A survey research approach was utilised to examine the effect of a number of constructs from attitudinal (utilitarian outcomes and hedonic outcomes), normative (social influence), control (self-efficacy and facilitating conditions resources) and demographic (age) categories on the behaviour of consumers when adopting broadband in the UK. Findings - Results indicate that all the constructs, apart from hedonic outcomes, significantly influenced the adoption behaviour of consumers. Research limitations/implications - This study provides a snapshot of the adoption behaviour of broadband within UK households. The findings may therefore change as technology becomes established and consumers become more experienced in its use. By undertaking a longitudinal study, the elimination of any variables could achieve anomalies in the obtained results. In addition to a discussion of the findings, the paper outlines the contributions and limitations of the study and provides suggestions for future research activity. Originality/value - The research presented in this paper is a part of doctoral research which forms one of the initial efforts towards understanding the adoption behaviour of broadband within UK households.", "paper_title": "Managing consumer adoption of broadband: examining drivers and barriers", "paper_id": "WOS:000266141200004"}