{"auto_keywords": [{"score": 0.042227535632149676, "phrase": "class_tree"}, {"score": 0.015719716506582538, "phrase": "protein_function"}, {"score": 0.0154409167879073, "phrase": "particle_swarm_optimisation"}, {"score": 0.00950882915044125, "phrase": "different_levels"}, {"score": 0.008663801761886879, "phrase": "rule_weights"}, {"score": 0.00858608610351805, "phrase": "hehrs"}, {"score": 0.004643839937761046, "phrase": "hierarchical_classification_problems"}, {"score": 0.0037597491055035895, "phrase": "test_examples"}, {"score": 0.0034550163444256386, "phrase": "next_level"}, {"score": 0.0033421490374576763, "phrase": "test_example"}, {"score": 0.003223208419566199, "phrase": "deeper_levels"}, {"score": 0.0031462682245392785, "phrase": "hierarchical_classification_methods"}, {"score": 0.0029887957779347394, "phrase": "hierarchical_rule_sets"}, {"score": 0.0029351141718104725, "phrase": "different_ensembles"}, {"score": 0.0028220792894598236, "phrase": "different_rule_sets"}, {"score": 0.002796616969627065, "phrase": "training_examples"}, {"score": 0.0025697460140513932, "phrase": "different_rules"}, {"score": 0.002389956401870098, "phrase": "aforementioned_drawback"}, {"score": 0.0023755529073496394, "phrase": "top-down_classification"}, {"score": 0.002304824112812496, "phrase": "standard_top-down_hierarchical_classification_method"}, {"score": 0.002163058716517137, "phrase": "pso_algorithm"}, {"score": 0.002143529653780496, "phrase": "best_predictive_accuracy"}, {"score": 0.0021049977753042253, "phrase": "hierarchical_classification_method"}], "paper_keywords": ["Particle swarm optimisation", " Hierarchical classification", " Protein function prediction"], "paper_abstract": "This paper focuses on hierarchical classification problems where the classes to be predicted are organized in the form of a tree. The standard top-down divide and conquer approach for hierarchical classification consists of building a hierarchy of classifiers where a classifier is built for each internal (non-leaf) node in the class tree. Each classifier discriminates only between its child classes. After the tree of classifiers is built, the system uses them to classify test examples one class level at a time, so that when the example is assigned a class at a given level, only the child classes need to be considered at the next level. This approach has the drawback that, if a test example is misclassified at a certain class level, it will be misclassified at deeper levels too. In this paper we propose hierarchical classification methods to mitigate this drawback. More precisely, we propose a method called hierarchical ensemble of hierarchical rule sets (HEHRS), where different ensembles are built at different levels in the class tree and each ensemble consists of different rule sets built from training examples at different levels of the class tree. We also use a particle swarm optimisation (PSO) algorithm to optimise the rule weights used by HEHRS to combine the predictions of different rules into a class to be assigned to a given test example. In addition, we propose a variant of a method to mitigate the aforementioned drawback of top-down classification. These three types of methods are compared against the standard top-down hierarchical classification method in six challenging bioinformatics datasets, involving the prediction of protein function. Overall HEHRS with the rule weights optimised by the PSO algorithm obtains the best predictive accuracy out of the four types of hierarchical classification method.", "paper_title": "Hierarchical classification of protein function with ensembles of rules and particle swarm optimisation", "paper_id": "WOS:000260518500005"}