{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "avian_flu"}, {"score": 0.01552915658292207, "phrase": "international_tourist_arrivals"}, {"score": 0.009739344801982353, "phrase": "human_deaths"}, {"score": 0.006978561487814853, "phrase": "asia"}, {"score": 0.0036477941360224435, "phrase": "short_run"}, {"score": 0.0036030386046805598, "phrase": "long_run_relationship"}, {"score": 0.0034506596895901003, "phrase": "static_line_fixed_effect_model"}, {"score": 0.0033457659530207306, "phrase": "dynamic_model"}, {"score": 0.0032641439000713306, "phrase": "empirical_results"}, {"score": 0.003204232566468624, "phrase": "static_fixed_effect_and_difference_transformation_dynamic_models"}, {"score": 0.0029937855454238507, "phrase": "sars_effect"}, {"score": 0.0021576975816645495, "phrase": "sars."}], "paper_keywords": ["SARS", " Avian Flu", " International tourism", " Static fixed effects model", " Dynamic panel", " Data model"], "paper_abstract": "This paper compares the impacts of SARS and human deaths arising from Avian Flu on international tourist arrivals to Asia. The effects of SARS and human deaths from Avian Flu are compared directly according to the number of human deaths. The nature of the short run and long run relationship is examined empirically by estimating a static line fixed effect model and a difference transformation dynamic model, respectively. Empirical results from the static fixed effect and difference transformation dynamic models are consistent, and indicate that both the short run and long run SARS effect have a more significant impact on international tourist arrivals than does Avian Flu. In addition, the effects of deaths arising from both SARS and Avian Flu suggest that SARS is more important to international tourist arrivals than is Avian Flu. Thus, while Avian Flu is here to stay, its effect is currently not as significant as that of SARS. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An econometric analysis of SARS and Avian Flu on international tourist arrivals to Asia", "paper_id": "WOS:000273063100010"}