{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_quality"}, {"score": 0.04938419617030255, "phrase": "ventilator_settings"}, {"score": 0.014835798366928568, "phrase": "respiratory_therapists"}, {"score": 0.01425668807072591, "phrase": "incorrect_data"}, {"score": 0.014153815025024205, "phrase": "computerized_ventilator_management_protocols"}, {"score": 0.004779876533667754, "phrase": "manual_entry"}, {"score": 0.004010342699414496, "phrase": "tertiary_care_hospital"}, {"score": 0.003952082333580496, "phrase": "ten_ventilator_settings"}, {"score": 0.00385214804128572, "phrase": "inspired_oxygen"}, {"score": 0.0037823114064881357, "phrase": "positive_end-expiratory_pressure"}, {"score": 0.0034516024325468653, "phrase": "approximately_every_two_hours"}, {"score": 0.00336428077531883, "phrase": "manually_entered_values"}, {"score": 0.0029813748433158032, "phrase": "charting_delay"}, {"score": 0.002905914725757534, "phrase": "data_observation"}, {"score": 0.0028847066125323893, "phrase": "data_entry"}, {"score": 0.002565626044684815, "phrase": "average_charting_delay"}, {"score": 0.00253758084385033, "phrase": "charting_event"}, {"score": 0.0024106932919085097, "phrase": "charting_application"}, {"score": 0.002265095354846931, "phrase": "setting_values"}, {"score": 0.0022239665922395104, "phrase": "mib_data"}, {"score": 0.0021597049163247476, "phrase": "manual_charting"}, {"score": 0.0021049977753042253, "phrase": "automatic_data_collection"}], "paper_keywords": [""], "paper_abstract": "Objective: To evaluate the data quality of ventilator settings recorded by respiratory therapists using a computer charting application and assess the impact of incorrect data on computerized ventilator management protocols. Design: An analysis of 29,054 charting events gathered over 12 months from 678 ventilated patients (1,736 ventilator days) in four intensive care units at a tertiary care hospital. Measurements: Ten ventilator settings were examined, including fraction of inspired oxygen (FIO2), positive end-expiratory pressure (PEEP), tidal volume, respiratory rate, peak inspiratory flow, and pressure support. Respiratory therapists entered values for each setting approximately every two hours using a computer charting application. Manually entered values were compared with data acquired automatically from ventilators using an implementation of the ISO/IEEE 11073 Medical Information Bus (MIB). Data quality was assessed by measuring the percentage of time that the two sources matched. Charting delay, defined as the interval between data observation and data entry, also was measured. Results: The percentage of time that settings matched ranged from 99.0% (PEEP) to 75.9% (low tidal volume alarm setting). The average charting delay for each charting event was 6.1 minutes, including an average of 1.8 minutes spent entering data in the charting application. In 559 (3.9%) of 14,263 suggestions generated by computerized ventilator management protocols, one or more manually charted setting values did not match the MIB data. Conclusion: Even at institutions where manual charting of ventilator settings is performed well, automatic data collection can eliminate delays, improve charting efficiency, and reduce errors caused by incorrect data.", "paper_title": "Assessing data quality in manual entry of ventilator settings", "paper_id": "WOS:000246670800006"}