{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "polyploid_genomes"}, {"score": 0.03929618561133174, "phrase": "haplotype_assembly"}, {"score": 0.004728874038094706, "phrase": "shared_tracts"}, {"score": 0.0045612889352793584, "phrase": "sequence_data"}, {"score": 0.004383766516923386, "phrase": "major_challenges"}, {"score": 0.004352236750212992, "phrase": "molecular_biology"}, {"score": 0.004258995791471342, "phrase": "complex_eukaryotic_organisms"}, {"score": 0.0041079938275505575, "phrase": "population_samples"}, {"score": 0.003991040678278726, "phrase": "high-throughput_sequencing_data"}, {"score": 0.003849502288990788, "phrase": "computational_efficiency"}, {"score": 0.003794297119656863, "phrase": "current_models"}, {"score": 0.0034918342672996066, "phrase": "assembled_haplotypes"}, {"score": 0.00333163309034114, "phrase": "homologous_chromosomes"}, {"score": 0.003271986590873581, "phrase": "polyploid_organisms"}, {"score": 0.0029358111718032704, "phrase": "polyploid_haplotype_reconstruction"}, {"score": 0.0027409477035216195, "phrase": "compass_graphs"}, {"score": 0.002672454243212711, "phrase": "theoretical_complexity"}, {"score": 0.0025313767218525965, "phrase": "graph_theory-based_algorithms"}, {"score": 0.0022629214153694504, "phrase": "haplotype_tract"}, {"score": 0.0021202820950055193, "phrase": "pacific_biosciences"}, {"score": 0.0021049977753042253, "phrase": "simulated_sequence_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genome-wide haplotype reconstruction from sequence data, or haplotype assembly, is at the center of major challenges in molecular biology and life sciences. For complex eukaryotic organisms like humans, the genome is vast and the population samples are growing so rapidly that algorithms processing high-throughput sequencing data must scale favorably in terms of both accuracy and computational efficiency. Furthermore, current models and methodologies for haplotype assembly (i) do not consider individuals sharing haplotypes jointly, which reduces the size and accuracy of assembled haplotypes, and (ii) are unable to model genomes having more than two sets of homologous chromosomes (polyploidy). Polyploid organisms are increasingly becoming the target of many research groups interested in the genomics of disease, phylogenetics, botany and evolution but there is an absence of theory and methods for polyploid haplotype reconstruction. Results: In this work, we present a number of results, extensions and generalizations of compass graphs and our HapCompass framework. We prove the theoretical complexity of two haplotype assembly optimizations, thereby motivating the use of heuristics. Furthermore, we present graph theory-based algorithms for the problem of haplotype assembly using our previously developed HapCompass framework for (i) novel implementations of haplotype assembly optimizations (minimum error correction), (ii) assembly of a pair of individuals sharing a haplotype tract identical by descent and (iii) assembly of polyploid genomes. We evaluate our methods on 1000 Genomes Project, Pacific Biosciences and simulated sequence data.", "paper_title": "Haplotype assembly in polyploid genomes and identical by descent shared tracts", "paper_id": "WOS:000321746100039"}