{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "expectancy-value_model"}, {"score": 0.004719359108879602, "phrase": "work-task_based_information"}, {"score": 0.004662913362513954, "phrase": "purpose_-_the_purpose"}, {"score": 0.0044795698035664695, "phrase": "cognitive_motivation_model"}, {"score": 0.004303404058571052, "phrase": "original_model"}, {"score": 0.0036212219870826725, "phrase": "seven_informants"}, {"score": 0.003549245218355768, "phrase": "danish_municipalities"}, {"score": 0.0033958751452139984, "phrase": "log_book"}, {"score": 0.003301733505307784, "phrase": "subsequent_interview"}, {"score": 0.003171740347925348, "phrase": "findings_-_motivation"}, {"score": 0.003146360480030653, "phrase": "source_use"}, {"score": 0.002857143106182505, "phrase": "interpersonal_and_internal_sources"}, {"score": 0.0027890803075309926, "phrase": "high-value_motivation"}, {"score": 0.0027667539384678814, "phrase": "low-expectancy_motivation"}, {"score": 0.002625914195439153, "phrase": "relatively_small_sample"}, {"score": 0.0025224615049571427, "phrase": "future_research"}, {"score": 0.0024524733595572084, "phrase": "studied_group"}, {"score": 0.0024036710362692042, "phrase": "municipality_consultants"}, {"score": 0.002156402793481102, "phrase": "theoretical_adaptation"}, {"score": 0.0021049977753042253, "phrase": "savolainen"}], "paper_keywords": ["User studies", " Cognitive motivation", " Expectancy value theory", " Information seeking", " Source choice", " Task"], "paper_abstract": "Purpose - The purpose of this paper is to operationalise and verify a cognitive motivation model that has been adapted to information seeking. The original model was presented within the field of psychology. Design/methodology/approach - An operationalisation of the model is presented based on the theory of expectancy-value and on the operationalisation used when the model was first developed. Data for the analysis were collected from a sample of seven informants working as consultants in Danish municipalities. Each participant filled out a questionnaire, kept a log book for a week and participated in a subsequent interview to elicit data regarding their information source behaviour and task motivation. Findings - Motivation affected source use when the informants search for information as part of their professional life. This meant that the number of sources used and the preference for interpersonal and internal sources increased when the task had high-value motivation or low-expectancy motivation or both. Research limitations/implications - The study is based on a relatively small sample and considers only one motivation theory. This should be addressed in future research along with a broadening of the studied group to involve other professions than municipality consultants. Originality/value - Motivational theories from the field of psychology have been used sparsely in studies of information seeking. This study operationalises and verifies such a theory based on a theoretical adaptation of this model made by Savolainen (2012c).", "paper_title": "Applying an expectancy-value model to study motivators for work-task based information seeking", "paper_id": "WOS:000359056200006"}