{"auto_keywords": [{"score": 0.04379099763831793, "phrase": "proposed_method"}, {"score": 0.025919123401740726, "phrase": "waveform_distortions"}, {"score": 0.015719716506582538, "phrase": "power_quality_disturbances"}, {"score": 0.004595263305771512, "phrase": "new_method"}, {"score": 0.004052148727852149, "phrase": "different_algorithms"}, {"score": 0.0037305551963210523, "phrase": "digital_high-pass_filter"}, {"score": 0.003690527690610707, "phrase": "mathematical_morphology_closing"}, {"score": 0.003598786417573615, "phrase": "rms_value"}, {"score": 0.0033490008882413103, "phrase": "pc-based_measuring_setup"}, {"score": 0.0032423089921154503, "phrase": "seven-months-long_monitoring"}, {"score": 0.0032075033252058835, "phrase": "single-phase_power_system"}, {"score": 0.0029210388852074208, "phrase": "classification_stage"}, {"score": 0.0028381384547894865, "phrase": "individual_types"}, {"score": 0.0026889720516076205, "phrase": "described_approach"}, {"score": 0.0025476254812544135, "phrase": "wavelet_transform"}, {"score": 0.0024842242921857705, "phrase": "real-time_monitoring"}, {"score": 0.002387758958649797, "phrase": "new_and_efficient_way"}, {"score": 0.0022379017425216917, "phrase": "mathematical_morphology_operations"}, {"score": 0.0021821915946356168, "phrase": "image_processing"}, {"score": 0.0021509807762081145, "phrase": "useful_tool"}, {"score": 0.0021049977753042253, "phrase": "power_quality_measurements"}], "paper_keywords": ["Power quality", " Disturbance detection and classification", " Power system monitoring", " Transient voltages"], "paper_abstract": "Purpose - The purpose of this paper is to develop a new method for detection and classification of power quality disturbances such as transients, waveform distortions, sags, Swells and interruptions. Design/methodology/approach - For the purposes of the proposed method, the power quality disturbances are divided into two groups. Different algorithms are applied to detect and classify the disturbances from each of the two groups. For the processing of transients and waveform distortions, digital high-pass filter and the mathematical morphology closing are used. Calculation of the RMS value is used for detection of sags, swells and interruptions. Findings - The proposed method was implemented in a PC-based measuring setup. The measuring setup was used in a seven-months-long monitoring of a single-phase power system. In the course of the monitoring, the proposed method was verified on over 19,000 transients, 3,500 waveform distortions, 77 sags and 18 interruptions. Research limitations/implications - The classification stage of the proposed method does not differentiate between individual types of waveform distortions (harmonics, interharmonics, noise...). Practical implications - The described approach is simpler and more reliable than, for example, methods based solely on wavelet transform. The proposed method is suitable for real-time monitoring of power systems. Originality/value - The paper describes a new and efficient way of detection and classification of disturbances (especially of transients and waveform distortions). It shows that mathematical morphology operations, which are normally used in image processing, represent a useful tool also in the field of power quality measurements.", "paper_title": "An efficient approach to detect and classify power quality disturbances", "paper_id": "WOS:000260567100015"}