{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.04485182771002568, "phrase": "sensor_deployment"}, {"score": 0.0421318407050913, "phrase": "sensing_regions"}, {"score": 0.03557137056973309, "phrase": "smallest_k-covered_line_segment"}, {"score": 0.03505719359718502, "phrase": "k_sensors"}, {"score": 0.031653507648654204, "phrase": "longest_k-uncovered_line_segment"}, {"score": 0.004778923541463994, "phrase": "coverage_problem"}, {"score": 0.004195418010131832, "phrase": "straight_line"}, {"score": 0.003502821629168212, "phrase": "line_coverage"}, {"score": 0.0031765314093444956, "phrase": "straight_line_path"}, {"score": 0.002931569771634119, "phrase": "n_sensors"}, {"score": 0.002902304851882577, "phrase": "deterministic_algorithms"}, {"score": 0.002631805441886608, "phrase": "line_segments"}, {"score": 0.0024717881264735477, "phrase": "arbitrary_line_segment_case"}, {"score": 0.0024532502238727278, "phrase": "smallest_k-covered_segment"}, {"score": 0.002344899447554067, "phrase": "longest_k-uncovered_segment"}, {"score": 0.002158505888557746, "phrase": "small_value"}, {"score": 0.0021049977753042253, "phrase": "linear_space"}], "paper_keywords": ["Wireless sensor network", " Coverage measures", " Line coverage", " Geometry"], "paper_abstract": "The coverage problem in wireless sensor networks addresses the problem of covering a region with sensors. Many different definitions of coverage are there in the literature depending on the goal of the coverage. In this paper, we address the problem of determining the quality of a sensor deployment against an intruder who can walk along a straight line. A line segment l is said to be k-covered if it intersects the sensing regions of at least k sensors distributed in R. Similarly, it is said to be k-uncovered if it intersects the sensing regions, that is assumed to be circular, of at most k - 1 sensors. We introduce two new metrics, smallest k-covered line segment and longest k-uncovered line segment, for measuring the quality of line coverage achieved by a sensor deployment. The intruder can walk a distance less than the smallest k-covered line segment without ever being detected by k sensors. So, this metric gives an estimate on the distance an intruder can walk in a straight line path before being detected by k sensors. On the other side, the defender would want to deploy sensors so that the length of the longest k-uncovered line segment is minimized. Given a deployment of n sensors, we propose deterministic algorithms to determine the smallest k-covered line segment and longest k-uncovered line segment where the line segments can be of the following types: (i) axis-parallel (horizontal and vertical) line segments, (ii) line segments whose one endpoint is fixed and is of arbitrary orientation and (iii) arbitrary line segments. The time complexities for the first and second types of line segments are O((n + x) log n) for both smallest k-covered line segment and longest k-uncovered line segment, where x is the number of intersections among n circles. For the arbitrary line segment case, the smallest k-covered segment can be determined in O(chi(2) log n+ n(11/3+is an element of))In time, whereas, the longest k-uncovered segment can be determined in O(chi(2) log n + n(2+beta+is an element of)) time, where beta = log(2)(1+,root 5) - 1 and is an element of is a small value greater than or equal to O. All our algorithms take linear space. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Line coverage measures in wireless sensor networks", "paper_id": "WOS:000337261000007"}