{"auto_keywords": [{"score": 0.03441536269816771, "phrase": "architecture-based_software_development"}, {"score": 0.015719716506582538, "phrase": "quality_achievement"}, {"score": 0.015409493645635382, "phrase": "architectural_level"}, {"score": 0.011495933816263697, "phrase": "architectural_evaluation"}, {"score": 0.010898286391747676, "phrase": "quality_attributes"}, {"score": 0.004655924035639928, "phrase": "aqua._architecture-based_software_development"}, {"score": 0.0043533862892678864, "phrase": "large_and_complex_software_systems"}, {"score": 0.00344062888674746, "phrase": "architectural_transformation"}, {"score": 0.00300749708357049, "phrase": "consistently_quality_attributes"}, {"score": 0.0023131084326717755, "phrase": "relevant_artifacts"}, {"score": 0.002251637552201872, "phrase": "design_decisions"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": [""], "paper_abstract": "Architecture-based software development plays an important role in successfully developing and managing large and complex software systems. Recently, there have been a number of studies for designing, evaluating, or transforming architectures. However, there is not much work being done for closely connecting an architectural evaluation with an architectural transformation in order to achieve quality attributes during the architecture-based software development. For this reason, it is still difficult to achieve consistently quality attributes at the architectural level. This paper presents an approach to quality achievement in architecture-based software development, which is called AQUA. The AQUA involves two distinctive activities, which are architectural evaluation and transformation, but these activities can be seamlessly combined through producing relevant artifacts based on the design decisions that led to the architecture. Due to the proposed approach, we can expect to achieve quality attributes in architecture-based software development.", "paper_title": "An approach to quality achievement at the architectural level: AQUA", "paper_id": "WOS:000239478000004"}