{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "parallel_scheduling"}, {"score": 0.0047689174754929195, "phrase": "non-uniform_tasks"}, {"score": 0.004458722048888919, "phrase": "different_execution_times"}, {"score": 0.003643607569483598, "phrase": "fault-free_environment"}, {"score": 0.0035914198812657897, "phrase": "simple_longest-in-system_scheduling_policy"}, {"score": 0.0035060903664150115, "phrase": "redundancy-avoidance_mechanism"}, {"score": 0.0034063576796640603, "phrase": "long-term_execution"}, {"score": 0.003049555059533735, "phrase": "offline_optimal_solution"}, {"score": 0.002850875630787708, "phrase": "additional_energy"}, {"score": 0.002716915166374506, "phrase": "processing_speedup"}, {"score": 0.00242047093248845, "phrase": "deterministic_algorithm"}, {"score": 0.0022409963215568565, "phrase": "small_bounded_competitive_ratios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Scheduling", " Non-uniform tasks", " Failures", " Competitiveness", " Online algorithms", " Energy efficiency"], "paper_abstract": "Consider a system in which tasks of different execution times arrive continuously and have to be executed by a set of machines that are prone to crashes and restarts. In this paper we model and study the impact of parallelism and failures on the competitiveness of such an online system. In a fault-free environment, a simple Longest-In-System scheduling policy, enhanced by a redundancy-avoidance mechanism, guarantees optimality in a long-term execution. In the presence of failures though, scheduling becomes a much more challenging task. In particular, no parallel deterministic algorithm can be competitive against an offline optimal solution, even with one single machine and tasks of only two different execution times. We find that when additional energy is provided to the system in the form of processing speedup, the situation. changes. Specifically, we identify thresholds on the speedup under which such competitiveness cannot be achieved by any deterministic algorithm, and above which competitive algorithms exist. Finally, we propose algorithms that achieve small bounded competitive ratios when the speedup is over the threshold. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Online parallel scheduling of non-uniform tasks: Trading failures for energy", "paper_id": "WOS:000357222600012"}