{"auto_keywords": [{"score": 0.04780597585803098, "phrase": "rna-rna_interactions"}, {"score": 0.024292100616973438, "phrase": "petcofold"}, {"score": 0.015312872265491051, "phrase": "rna_sequences"}, {"score": 0.009620561273254205, "phrase": "carefully_curated_dataset"}, {"score": 0.008849281280003599, "phrase": "rna-rna_interaction"}, {"score": 0.007355116134553253, "phrase": "controlled_data"}, {"score": 0.007290577457772909, "phrase": "phylogenetically_simulated_sequences"}, {"score": 0.007194822025316942, "phrase": "covariance_patterns"}, {"score": 0.007100315262290605, "phrase": "interaction_sites"}, {"score": 0.006976220911012406, "phrase": "increased_performance"}, {"score": 0.006914983752271393, "phrase": "increased_amounts"}, {"score": 0.00481495049065317, "phrase": "conserved_interactions"}, {"score": 0.0044272138900038095, "phrase": "putative_non-coding_rnas"}, {"score": 0.004179991181159956, "phrase": "single_sequences"}, {"score": 0.004124920849728372, "phrase": "comparative_methods"}, {"score": 0.004016938499717623, "phrase": "rna_structure_determination"}, {"score": 0.003709595902020469, "phrase": "non-negligible_amount"}, {"score": 0.003660700128133065, "phrase": "existing_rna-rna_interactions"}, {"score": 0.0035806300393050926, "phrase": "base_changes"}, {"score": 0.003365598242636633, "phrase": "covariance_information"}, {"score": 0.003149471116658739, "phrase": "secondary_structures"}, {"score": 0.0030399188412691914, "phrase": "petcofold's_ability"}], "paper_keywords": [""], "paper_abstract": "Motivation: Predicting RNA-RNA interactions is essential for determining the function of putative non-coding RNAs. Existing methods for the prediction of interactions are all based on single sequences. Since comparative methods have already been useful in RNA structure determination, we assume that conserved RNA-RNA interactions also imply conserved function. Of these, we further assume that a non-negligible amount of the existing RNA-RNA interactions have also acquired compensating base changes throughout evolution. We implement a method, PETcofold, that can take covariance information in intra-molecular and intermolecular base pairs into account to predict interactions and secondary structures of two multiple alignments of RNA sequences. Results: PETcofold's ability to predict RNA-RNA interactions was evaluated on a carefully curated dataset of 32 bacterial small RNAs and their targets, which was manually extracted from the literature. For evaluation of both RNA-RNA interaction and structure prediction, we were able to extract only a few high-quality examples: one vertebrate small nucleolar RNA and four bacterial small RNAs. For these we show that the prediction can be improved by our comparative approach. Furthermore, PETcofold was evaluated on controlled data with phylogenetically simulated sequences enriched for covariance patterns at the interaction sites. We observed increased performance with increased amounts of covariance. Results: PETcofold's ability to predict RNA-RNA interactions was evaluated on a carefully curated dataset of 32 bacterial small RNAs and their targets, which was manually extracted from the literature. For evaluation of both RNA-RNA interaction and structure prediction, we were able to extract only a few high-quality examples: one vertebrate small nucleolar RNA and four bacterial small RNAs. For these we show that the prediction can be improved by our comparative approach. Furthermore, PETcofold was evaluated on controlled data with phylogenetically simulated sequences enriched for covariance patterns at the interaction sites. We observed increased performance with increased amounts of covariance.", "paper_title": "PETcofold: predicting conserved interactions and structures of two multiple alignments of RNA sequences", "paper_id": "WOS:000286215200010"}