{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "land_use"}, {"score": 0.04888938273281976, "phrase": "mediterranean_landscape"}, {"score": 0.041959030741870164, "phrase": "polygon_fragmentation"}, {"score": 0.004502433187097914, "phrase": "great_deal"}, {"score": 0.00422781730455246, "phrase": "human-driven_changes"}, {"score": 0.003936698872193083, "phrase": "cover_vector_maps"}, {"score": 0.0038227112550093863, "phrase": "novel_regression_methodology"}, {"score": 0.003759057920801288, "phrase": "multivariate_fractional_data"}, {"score": 0.0031778255332904487, "phrase": "papke"}, {"score": 0.0030089355635315005, "phrase": "multivariate_response_variables"}, {"score": 0.0027088948471991454, "phrase": "representative_set"}, {"score": 0.0026862220320327613, "phrase": "vector_maps"}, {"score": 0.0026525671788921205, "phrase": "barcelona_province"}, {"score": 0.0026304874965269185, "phrase": "spain"}, {"score": 0.002299313860419974, "phrase": "geographical_and_environmental_variables"}, {"score": 0.0022514836269627186, "phrase": "neighboring_landscape"}, {"score": 0.002158780936704905, "phrase": "landscape_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multivariate bounded data regression", " Landscape dynamics", " Mediterranean landscape", " Landscape modeling", " Vector-based land-use maps"], "paper_abstract": "The way landscapes change in time reveal a great deal of information about the interplay between the forces of nature and the impact of human-driven changes in a Mediterranean landscape. To understand the dynamics behind the process of polygon fragmentation in land use and cover vector maps we illustrate the potential of a novel regression methodology to cope with multivariate fractional data. An overlay of two vector-based land cover maps separated by a time interval of several years (1956 and 1993) show polygons that have become fragmented. Those fragments thus form a multivariate fractional bounded data set. An extension of the Papke and Wooldridge (1996) fractional regression estimation to the case of multivariate response variables has been subsequently developed to study the processes of polygon fragmentation between the two land use and cover maps. The methodology has been applied to a representative set of vector maps from the Barcelona province, Spain. Several explanatory variables have been used, among them the land cover type of the most important adjacent 1956 polygon. The results of our study indicate that the dynamics of fragmentation are determined not only by geographical and environmental variables but also by the neighboring landscape. We discuss its potential use when employed with techniques of landscape modeling. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A multivariate fractional regression approach to modeling land use and cover dynamics in a Mediterranean landscape", "paper_id": "WOS:000368306700005"}