{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "purpose_-_outsourcing"}, {"score": 0.004649474569983707, "phrase": "unstoppable_growth"}, {"score": 0.004373398434399966, "phrase": "main_reasons"}, {"score": 0.004186253035932442, "phrase": "information_systems"}, {"score": 0.00398959232769596, "phrase": "potential_risks"}, {"score": 0.0038355531523269217, "phrase": "additional_objective"}, {"score": 0.0036393456309815166, "phrase": "large_spanish_firms"}, {"score": 0.003453140302583322, "phrase": "outsourcing_reasons"}, {"score": 0.0033197446406648626, "phrase": "client's_perspective"}, {"score": 0.0030414140732789186, "phrase": "largest_spanish_firms"}, {"score": 0.0030148941188459987, "phrase": "findings_-_outsourcing"}, {"score": 0.0028108690791085536, "phrase": "technological_improvements"}, {"score": 0.0027620516806198354, "phrase": "cost_savings"}, {"score": 0.0025638362414466278, "phrase": "priority_reasons"}, {"score": 0.002508284945907166, "phrase": "present_study"}, {"score": 0.0023694065215394593, "phrase": "great_concern"}, {"score": 0.0022480304016499605, "phrase": "potential_lack"}, {"score": 0.002123531043641047, "phrase": "new_technologies"}], "paper_keywords": ["Information systems", " Outsourcing", " Spain", " Management strategy"], "paper_abstract": "Purpose - Outsourcing is currently going through a stage of unstoppable growth. The purpose of this paper is to make a proposal about the main reasons, which may lead firms to adopt outsourcing in information systems (IS) services. It will equally analyse the potential risks that IS clients are likely to face. An additional objective is to assess these reasons and risks in the case of large Spanish firms, while simultaneously examining their evolution over time. This study of outsourcing reasons and risks has been carried out from the client's perspective. Design/methodology/approach - In order to achieve these aims, a questionnaire was administered to the IS managers of the largest Spanish firms. Findings - Outsourcing gives the organisations the opportunity to have better IS services and the possibility to achieve technological improvements and, although cost savings in staff and technology are generally seen as very important, they do not emerge as priority reasons for outsourcing in the present study. Regarding risks, they are mainly associated with providers, with great concern being expressed about the lack of qualification among their providers' staff, the potential lack of compliance with contracts, and the inability to adapt to the new technologies. Originality/value - An important contribution made by this paper is not only the specification of those reasons and risks but also the fact that they are considered important by the firms interviewed.", "paper_title": "Information systems outsourcing reasons and risks: a new assessment", "paper_id": "WOS:000276515900016"}