{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "perceiving_causality"}, {"score": 0.004763895422211728, "phrase": "virtual_interactions"}, {"score": 0.004688321299229397, "phrase": "recent_advances"}, {"score": 0.004638602678192715, "phrase": "real-time_graphics_technology"}, {"score": 0.00439777299939725, "phrase": "player-controlled_avatars"}, {"score": 0.0043511221096418475, "phrase": "non-player_characters"}, {"score": 0.003931798194574009, "phrase": "physical_contacts"}, {"score": 0.0038283058265876713, "phrase": "appropriate_reactions"}, {"score": 0.00378767277402891, "phrase": "specific_actions"}, {"score": 0.003727527379253624, "phrase": "highly_complex_problem"}, {"score": 0.003668333531296882, "phrase": "timing_errors"}, {"score": 0.003629392214109574, "phrase": "force_mismatches"}, {"score": 0.0035908627899097407, "phrase": "angular_distortions"}, {"score": 0.0033680968918579717, "phrase": "perceived_realism"}, {"score": 0.003332332086930163, "phrase": "two-character_interactions"}, {"score": 0.003244567402785763, "phrase": "motion_corpus"}, {"score": 0.003159106878239524, "phrase": "corresponding_reactions"}, {"score": 0.003043218974273827, "phrase": "perceptual_experiments"}, {"score": 0.0021390191069313945, "phrase": "motion_editing_strategies"}, {"score": 0.0021049977753042253, "phrase": "animation_budgets"}], "paper_keywords": ["perception", " interaction", " motion capture"], "paper_abstract": "With recent advances in real-time graphics technology, more realistic, believable and appealing virtual characters are needed than ever before. Both player-controlled avatars and non-player characters are now starting to interact with the environment, other virtual humans and crowds. However, simulating physical contacts between characters and matching appropriate reactions to specific actions is a highly complex problem, and timing errors, force mismatches and angular distortions are common. To investigate the effect of such anomalies on the perceived realism of two-character interactions, we captured a motion corpus of pushing animations and corresponding reactions and then conducted a series of perceptual experiments. We found that participants could easily distinguish between five different interaction forces, even when only one of the characters was visible. Furthermore, they were sensitive to all three types of anomalous interactions: timing errors of over 150ms were acceptable less than 50% of the time, with early or late reactions being equally perceptible; participants could perceive force mismatches, though over-reactions were more acceptable than under-reactions; finally, angular distortions when a character reacts to a pushing force reduce the acceptability of the interactions, but there is some evidence for a preference of expansion away from the pushing character's body. Our results provide insights to aid in designing motion capture sessions, motion editing strategies and balancing animation budgets.", "paper_title": "Push it Real: Perceiving Causality in Virtual Interactions", "paper_id": "WOS:000308250300066"}