{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "context-free_grammars"}, {"score": 0.0396600464562225, "phrase": "new_formalism"}, {"score": 0.004737579882204798, "phrase": "expression_grammars"}, {"score": 0.00394264312173188, "phrase": "proper_comparison"}, {"score": 0.0033163269450817716, "phrase": "recognition-based_semantics"}, {"score": 0.0028502479839354637, "phrase": "new_formalisms"}, {"score": 0.0024896081630179194, "phrase": "ll-regular_grammars"}, {"score": 0.0024628046987344846, "phrase": "simple_language-preserving_translations"}, {"score": 0.002258485755625332, "phrase": "equivalent_pegs"}, {"score": 0.002198173002125909, "phrase": "classic_top-down_grammars"}, {"score": 0.0021745003291048356, "phrase": "peg-based_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Context-free grammars", " Parsing expression grammars", " LL(1)", " LL(k)", " Natural semantics"], "paper_abstract": "Context-Free Grammars (CFGs) and Parsing Expression Grammars (PEGs) have several similarities and a few differences in both their syntax and semantics, but they are usually presented through formalisms that hinder a proper comparison. In this paper we present a new formalism for CFGs that highlights the similarities and differences between them. The new formalism borrows from PEGs the use of parsing expressions and the recognition-based semantics. We show how one way of removing non-determinism from this formalism yields a formalism with the semantics of PEGs. We also prove, based on these new formalisms, how LL(1) grammars define the same language whether interpreted as CFGs or as PEGs, and also show how strong-LL(k), right-linear, and LL-regular grammars have simple language-preserving translations from CFGs to PEGs. Once these classes of CFGs can be automatically translated to equivalent PEGs, we can reuse classic top-down grammars in PEG-based tools. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the relation between context-free grammars and parsing expression grammars", "paper_id": "WOS:000337929200002"}