{"auto_keywords": [{"score": 0.03835049443893983, "phrase": "podcred_framework"}, {"score": 0.00481495049065317, "phrase": "podcast_preference"}, {"score": 0.004763785973620115, "phrase": "analysis_framework"}, {"score": 0.004663074596384574, "phrase": "worthwhile_podcasts"}, {"score": 0.004483909657713567, "phrase": "large_numbers"}, {"score": 0.004205395707787349, "phrase": "listening_material"}, {"score": 0.004043744293248725, "phrase": "podcred"}, {"score": 0.003765525342866404, "phrase": "listening_preferences"}, {"score": 0.0035063811070537233, "phrase": "user_perceptions"}, {"score": 0.00332375606483146, "phrase": "automatic_prediction"}, {"score": 0.0032533888943254144, "phrase": "particular_podcast"}, {"score": 0.003218764138744059, "phrase": "listener_preference"}, {"score": 0.003094920033010818, "phrase": "podcast_content"}, {"score": 0.0027610089418453614, "phrase": "prescriptive_guidelines"}, {"score": 0.0026077803487003, "phrase": "validation_exercise"}, {"score": 0.002525347599743456, "phrase": "real-world_podcast_preference_prediction_task"}, {"score": 0.0024718415971488627, "phrase": "select_framework_indicators"}, {"score": 0.0023015232625177755, "phrase": "easily_extractable_\"surface\"_features"}, {"score": 0.0022447206386952126, "phrase": "basic_classification_system"}, {"score": 0.0021659920594094407, "phrase": "popularity_levels"}, {"score": 0.0021352776064254195, "phrase": "ground_truth"}, {"score": 0.0021049977753042253, "phrase": "simple_surface_features"}], "paper_keywords": [""], "paper_abstract": "Finding worthwhile podcasts can be difficult for listeners since podcasts are published in large numbers and vary widely with respect to quality and repute. Independently of their informational content, certain podcasts provide satisfying listening material while other podcasts have little or no appeal. In this paper we present PodCred, a framework for analyzing listener appeal, and we demonstrate its application to the task of automatically predicting the listening preferences of users. First, we describe the PodCred framework, which consists of an inventory of factors contributing to user perceptions of the credibility and quality of podcasts. The framework is designed to support automatic prediction of whether or not a particular podcast will enjoy listener preference. It consists of four categories of indicators related to the Podcast Content, the Podcaster, the Podcast Context, and the Technical Execution of the podcast. Three studies contributed to the development of the PodCred framework: a review of the literature on credibility for other media, a survey of prescriptive guidelines for podcasting, and a detailed data analysis. Next, we report on a validation exercise in which the PodCred framework is applied to a real-world podcast preference prediction task. Our validation focuses on select framework indicators that show promise of being both discriminative and readily accessible. We translate these indicators into a set of easily extractable \"surface\" features and use them to implement a basic classification system. The experiments carried out to evaluate system use popularity levels in iTunes as ground truth and demonstrate that simple surface features derived from the PodCred framework are indeed useful for classifying podcasts.", "paper_title": "Predicting Podcast Preference: An Analysis Framework and its Application", "paper_id": "WOS:000274038400013"}