{"auto_keywords": [{"score": 0.04956979837493762, "phrase": "multi-agent_systems"}, {"score": 0.00481495049065317, "phrase": "temporal_knowledge"}, {"score": 0.004189809878977535, "phrase": "social_commitments"}, {"score": 0.004003511299646736, "phrase": "verification_perspective"}, {"score": 0.003908246778916674, "phrase": "new_technique"}, {"score": 0.0037544644262310525, "phrase": "proposed_technique"}, {"score": 0.00350205447167804, "phrase": "existing_logic"}, {"score": 0.0033913321452667708, "phrase": "transformation_rules"}, {"score": 0.0033194624649804183, "phrase": "arctl_model"}, {"score": 0.003284098922460191, "phrase": "arctl_formulae"}, {"score": 0.0032317564571381656, "phrase": "extended_version"}, {"score": 0.0032144982424091605, "phrase": "nusmv"}, {"score": 0.0031379455926018826, "phrase": "recent_approach"}, {"score": 0.002974281028713475, "phrase": "better_scalability"}, {"score": 0.0028879224619717714, "phrase": "proposed_model_checking_technique"}, {"score": 0.0027817097763591365, "phrase": "pspace"}, {"score": 0.002751968796076333, "phrase": "local_concurrent_programs"}, {"score": 0.0026083827931787846, "phrase": "time_perspective"}, {"score": 0.0025462308249913643, "phrase": "proposed_approach"}, {"score": 0.0023244773286506203, "phrase": "extended_nusmv"}, {"score": 0.0022630008787375435, "phrase": "netbill_protocol"}, {"score": 0.002238866955912704, "phrase": "business_domain"}, {"score": 0.002214989839524726, "phrase": "desirable_properties"}, {"score": 0.002197248893814575, "phrase": "obtained_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent systems", " Model checking", " Knowledge", " Social commitments", " Verification"], "paper_abstract": "Though modeling and verifying Multi-Agent Systems (MASs) have long been under study, there are still challenges when many different aspects need to be considered simultaneously. In fact, various frameworks have been carried out for modeling and verifying MASs with respect to knowledge and social commitments independently. However, considering them under the same framework still needs further investigation, particularly from the verification perspective. In this article, we present a new technique for model checking the logic of knowledge and commitments (CTLKC+). The proposed technique is fully-automatic and reduction-based in which we transform the problem of model checking CTLKC+ into the problem of model checking an existing logic of action called ARCTL. Concretely, we construct a set of transformation rules to formally reduce the CTLKC+ model into an ARCTL model and CTLKC+ formulae into ARCTL formulae to get benefit from the extended version of NuSMV symbolic model checker of ARCTL. Compared to a recent approach that reduces the problem of model checking CTLKC+ to another logic of action called GCTL*, our technique has better scalability and efficiency. We also analyze the complexity of the proposed model checking technique. The results of this analysis reveal that the complexity of our reduction-based procedure is PSPACE-complete for local concurrent programs with respect to the size of these programs and the length of the formula being checked. From the time perspective, we prove that the complexity of the proposed approach is P-complete with regard to the size of the model and length of the formula, which makes it efficient. Finally, we implement our model checking approach on top of extended NuSMV and report verification results for the verification of the NetBill protocol, taken from business domain, against some desirable properties. The obtained results show the effectiveness of our model checking approach when the system scales up. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Model checking temporal knowledge and commitments in multi-agent systems using reduction", "paper_id": "WOS:000349575900004"}