{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "consumer_behavior_selectivity_model"}, {"score": 0.004741845603430361, "phrase": "web_environment"}, {"score": 0.004669845451682529, "phrase": "paper's_key_contribution"}, {"score": 0.004529093447865156, "phrase": "self-concept_orientation_model"}, {"score": 0.003946195919158241, "phrase": "gender-related_self-concept_traits"}, {"score": 0.003807684498435389, "phrase": "regression_analyses"}, {"score": 0.0034911335714333507, "phrase": "identical_subject_domain"}, {"score": 0.0025174594088331853, "phrase": "comprehensive_processing_strategy"}, {"score": 0.0023798115577749225, "phrase": "effort_minimization_strategy"}, {"score": 0.002331641523873951, "phrase": "lowest_search_frequencies"}, {"score": 0.0022961534630650347, "phrase": "interaction_pattern"}, {"score": 0.0022267859286766553, "phrase": "other-relevant_information"}, {"score": 0.0021595094738887767, "phrase": "sex_differences"}, {"score": 0.0021375377706211686, "phrase": "search_frequency"}, {"score": 0.0021049977753042253, "phrase": "self-relevant_or_other-relevant_information"}], "paper_keywords": [""], "paper_abstract": "Adapting the consumer behavior selectivity model to the Web environment, this paper's key contribution is the introduction of a self-concept orientation model of Web information seeking. This model, which addresses gender, effort, and information content factors, questions the commonly assumed equivalence of sex and gender by specifying the measurement of gender-related self-concept traits known as self- and other-orientation. Regression analyses identified associations between self-orientation, other-orientation, and self-reported search frequencies for content with identical subject domain (e.g., medical information, government information) and differing relevance (i.e., important to the individual personally versus important to someone close to him or her). Self- and other-orientation interacted such that when individuals were highly self-oriented, their frequency of search for both self- and other-relevant information depended on their level of other-orientation. Specifically, high-self/high-other individuals, with a comprehensive processing strategy, searched most often, whereas high-self/low-other respondents, with an effort minimization strategy, reported the lowest search frequencies. This interaction pattern was even more pronounced for other-relevant information seeking. We found no sex differences in search frequency for either self-relevant or other-relevant information.", "paper_title": "Gender and web information seeking: A self-concept orientation model", "paper_id": "WOS:000238005200011"}