{"auto_keywords": [{"score": 0.04409377902504345, "phrase": "saas"}, {"score": 0.00481495049065317, "phrase": "purpose_-_software"}, {"score": 0.0046424265003082, "phrase": "substantial_opportunities"}, {"score": 0.004395110768083201, "phrase": "desired_level"}, {"score": 0.004182673425754283, "phrase": "high-tech_method"}, {"score": 0.003709751172350134, "phrase": "good_insight"}, {"score": 0.003690443963288746, "phrase": "saas_technology_adoption"}, {"score": 0.003493665137212979, "phrase": "saas_adoption"}, {"score": 0.003307343959522875, "phrase": "fuzzy_analytic_hierarchy_process"}, {"score": 0.0032559521297271165, "phrase": "linguistic_preference_relations"}, {"score": 0.0031803530386665313, "phrase": "submitted_criteria"}, {"score": 0.0027334248520330803, "phrase": "top_five_influential_factors"}, {"score": 0.0026979638547387345, "phrase": "competitive_pressure"}, {"score": 0.0026215563658729757, "phrase": "social_influence"}, {"score": 0.0026010951355694375, "phrase": "adopter's_opinions"}, {"score": 0.00252083079100971, "phrase": "useful_literature"}, {"score": 0.002475155824246357, "phrase": "related_subject"}, {"score": 0.002423965893808737, "phrase": "adoption_theories"}, {"score": 0.0024113342918001945, "phrase": "saas_context"}, {"score": 0.002373832128444394, "phrase": "future_studies"}, {"score": 0.002276646782260818, "phrase": "strong_decisions"}, {"score": 0.0022179323958360564, "phrase": "saas_technology"}, {"score": 0.002206372086556654, "phrase": "well-known_it_adoption_theories"}, {"score": 0.002177733667053078, "phrase": "fuzzy_ahp"}, {"score": 0.0021049977753042253, "phrase": "previous_methodologies"}], "paper_keywords": ["Fuzzy AHP", " Cloud computing", " DOI theory", " Fuzzy LinPreRa", " Software-as-a-Service (SaaS)", " TOE framework"], "paper_abstract": "Purpose - Software-as-a-Service (SaaS) has the potential to provide substantial opportunities for organizations to improve their information technology without cost and management concerns. However, organizations have not utilized it to the desired level because it is very challenging for them to completely transform their basic conventional methods of running software into SaaS as a high-tech method. On the other hand, organizations have doubt which factors should be mostly considered if they want to move to SaaS. Therefore, investigating the adoption of SaaS can contribute organizations to benefit from this technology. The purpose of this paper is to provide a good insight into SaaS technology adoption. Design/methodology/approach - Considering Technology, Organization and Environment (TOE) framework and diffusion of innovation (DOI) theory as the basis, 22 university experts expressed their idea about the proposed model of SaaS adoption. Then, 30 IT professional in 15 IT enterprises that had adopted SaaS were asked to fill the questionnaire related to fuzzy Analytic Hierarchy Process (AHP) based on linguistic preference relations (LinPreRa) in order to rank the submitted criteria. Findings - The findings demonstrate that all attributes of Technology (relative advantage, compatibility, complexity, trialability, observability and security and privacy), Organization (IT resource, sharing and collaboration culture) and environment (competitive pressure, social influence) are influential in the adoption of SaaS. Moreover, the top five influential factors are relative advantage, competitive pressure, security and privacy, sharing and collaboration culture and social influence based on adopter's opinions. Research limitations/implications - For researchers, this study provides a useful literature, which can help them in related subject. In addition, it applies IT adoption theories in SaaS context that can be extended in future studies. For organizations, this study derives priority of factors by which they can make strong decisions about adoption of SaaS. Originality/value - This study contributes to the adoption of SaaS technology using well-known IT adoption theories. A version of Fuzzy AHP based on LinPreRa was used in order to cover the limitations of previous methodologies of ranking the criteria.", "paper_title": "The adoption of software-as-a-service (SaaS): ranking the determinants", "paper_id": "WOS:000355689600005"}