{"auto_keywords": [{"score": 0.04938113070956768, "phrase": "continuance_intention"}, {"score": 0.015325074276747785, "phrase": "online_games"}, {"score": 0.01425049496070008, "phrase": "integrated_model"}, {"score": 0.01399381632228464, "phrase": "sct"}, {"score": 0.0047797212183363835, "phrase": "social_influence"}, {"score": 0.004424953471635011, "phrase": "online_multiplayer_games"}, {"score": 0.004312622975366676, "phrase": "social_cognitive_theory"}, {"score": 0.004007083686875716, "phrase": "flow_theory"}, {"score": 0.00396315099839886, "phrase": "affective_feeling"}, {"score": 0.0036553070575015344, "phrase": "wide_spectrum"}, {"score": 0.0036285315458900284, "phrase": "social_influences"}, {"score": 0.00327356326590461, "phrase": "commonly_accepted_guidelines"}, {"score": 0.002996992362027833, "phrase": "larger_amount"}, {"score": 0.002931569771634119, "phrase": "competing_models"}, {"score": 0.0029100802280971065, "phrase": "existing_studies"}, {"score": 0.002846549461929597, "phrase": "popular_trend"}, {"score": 0.002763988044737562, "phrase": "cognitive_or_affect_angle"}, {"score": 0.0025678829712650437, "phrase": "important_improvement"}, {"score": 0.0025490525773769063, "phrase": "cognitive_expectations"}, {"score": 0.0024933837962398267, "phrase": "pre-use_experience"}, {"score": 0.0021441057555396013, "phrase": "pre-use_expectations"}, {"score": 0.0021049977753042253, "phrase": "one's_own_experience"}], "paper_keywords": ["Online game", " Flow theory", " Social cognitive theory"], "paper_abstract": "Purpose - The focus in this study is a model that predicts continuance intention of online multiplayer games. In this integrated model, the social cognitive theory (SCT) lays out the foundation of two types of pre-use (pre-play) expectations, the flow theory captures the affective feeling with the game as a moderator for the effect from the two pre-use expectations, and subjective norm together with its associated antecedents cover a wide spectrum of social influences. Design/methodology/approach - A questionnaire was designed and pre-tested before distributing to target respondents. The reliability and validity of the instrument both met the commonly accepted guidelines. The integrated model was assessed first by examining its measurement model and then the structural model. Findings - The integration of cognitive, affective and social influence in this model explains a larger amount of variance compared to the competing models and existing studies. Originality/value - Unlike a popular trend that studies predictors of online games from either cognitive or affect angle, the work looks at both together to study how their joint effect is related to continuance intention. This marks an important improvement as cognitive expectations derived from SCT captures the pre-use experience that may be influenced or swayed by sources including those that are inflated or incorrect. By studying flow as a moderator in conjunction with other sources of influence, the authors are able to further the understanding of how the pre-use expectations may be shaped by one's own experience.", "paper_title": "The effects of hedonic/utilitarian expectations and social influence on continuance intention to play online games", "paper_id": "WOS:000329948100002"}