{"auto_keywords": [{"score": 0.02363669222305869, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "ad-hoc_networks"}, {"score": 0.0047057084749407485, "phrase": "confidant_protocol"}, {"score": 0.004678785623021003, "phrase": "buchegger"}, {"score": 0.004652016085325825, "phrase": "boudec"}, {"score": 0.004559517609828423, "phrase": "mobile_ad_hoc_networking"}, {"score": 0.0043299856054821355, "phrase": "basic_reputation-based_protocol"}, {"score": 0.004256060942428626, "phrase": "selfish_nodes"}, {"score": 0.0037402558657576124, "phrase": "main_question"}, {"score": 0.003613556291453534, "phrase": "initial_conditions"}, {"score": 0.0035416325863738326, "phrase": "equilibrium_state"}, {"score": 0.003511246498068952, "phrase": "non-zero_amount"}, {"score": 0.00340203679323172, "phrase": "emergency_situations"}, {"score": 0.003267925215811654, "phrase": "small_bandwidth"}, {"score": 0.003230584762460845, "phrase": "standard_approach"}, {"score": 0.0030414140732789186, "phrase": "non-trivial_nash_equilibria"}, {"score": 0.0029722900280316216, "phrase": "extra_conditions"}, {"score": 0.0029214769181390653, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.002879794950644701, "phrase": "connected_nash_equilibria"}, {"score": 0.0026418666490652873, "phrase": "unsuccessful_flow"}, {"score": 0.0025817998420057105, "phrase": "distant_part"}, {"score": 0.002444544487772349, "phrase": "polynomial_time"}, {"score": 0.0022619269791898378, "phrase": "negative_side"}, {"score": 0.0021726616502636305, "phrase": "connected_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "unsuccessful_flows"}], "paper_keywords": [""], "paper_abstract": "Inspired by the CONFIDANT protocol (Buchegger and Boudec in Proceedings of the 3rd ACM International Symposium on Mobile Ad Hoc Networking & Computing, pp. 226-236, 2002), we define and study a basic reputation-based protocol in multihop wireless networks with selfish nodes. Its reputation mechanism is implemented through the ability of any node to define a threshold of tolerance for any of its neighbors, and to cut the connection to any of these neighbors that refuse to forward an amount of flow above that threshold. The main question we would like to address is whether one can set the initial conditions so that the system reaches an equilibrium state where a non-zero amount of every commodity is routed. This is important in emergency situations, where all nodes need to be able to communicate even with a small bandwidth. Following a standard approach, we model this protocol as a game, and we give necessary and sufficient conditions for the existence of non-trivial Nash equilibria. Then we enhance these conditions with extra conditions that give a set of necessary and sufficient conditions for the existence of connected Nash equilibria. We note that it is not always necessary for all the flow originating at a node to reach its destination at equilibrium. For example, a node may be using unsuccessful flow in order to effect changes in a distant part of the network that will prove quite beneficial to it. We show that we can decide in polynomial time whether there exists a (connected) equilibrium without unsuccessful flows. In that case we calculate (in polynomial time) initial values that impose such an equilibrium on the network. On the negative side, we prove that it is NP-hard to decide whether a connected equilibrium exists in general (i.e., with some nodes using unsuccessful flows at equilibrium).", "paper_title": "Emergency Connectivity in Ad-hoc Networks with Selfish Nodes", "paper_id": "WOS:000330032200004"}