{"auto_keywords": [{"score": 0.04482751316807671, "phrase": "approximate_repeats"}, {"score": 0.00481495049065317, "phrase": "long_conserved_regions"}, {"score": 0.0046776367107079315, "phrase": "approximate_non-tandem_repeat"}, {"score": 0.004400419843791404, "phrase": "thresholds_l"}, {"score": 0.0043302273768286905, "phrase": "finite_alphabet"}, {"score": 0.0036396555012105365, "phrase": "relatively_large_d."}, {"score": 0.0035357399513289904, "phrase": "long_approximate_repeats"}, {"score": 0.0035130521069092493, "phrase": "large_d"}, {"score": 0.0034347810592224096, "phrase": "previous_works"}, {"score": 0.0031896375499832694, "phrase": "input_string"}, {"score": 0.0029714924513911897, "phrase": "s._one_useful_application"}, {"score": 0.0028680638354014183, "phrase": "longest_possible_substrings_beta"}, {"score": 0.002554021496818708, "phrase": "multiple_input_strings"}, {"score": 0.002449253189963288, "phrase": "input_strings"}, {"score": 0.002296381861149051, "phrase": "running_time_complexity"}, {"score": 0.0021049977753042253, "phrase": "vertical_bar"}], "paper_keywords": [""], "paper_abstract": "We study the problem of approximate non-tandem repeat (conserved regions) extraction among strings (genes). Basically, given a string S and thresholds L and D over a finite alphabet, extracting approximate repeats is to find pairs (beta, beta') of substrings of S under some constraints such that beta and beta' have edit-distance at most D and their respective lengths are at least L. Previous works mainly focus on the case that D is small, so they are not appropriate for extracting approximate repeats with relatively large D. In contrast, this paper focuses on extracting long approximate repeats with large D and it is more efficient than previous works. We also show that our algorithm is optimal in time when D is a constant. In this paper, given an input string S and thresholds L and D, we would like to extract all (D, L)-supermaximal approximate repeats (beta, beta') of S. One useful application of extracting all (D, L)-supermaximal approximate repeats is to find all longest possible substrings beta of S such that there exist some other substring beta of S where beta and beta' have edit-distance at most D and their respective lengths are at least L. This algorithm can be easily applied to the case where there are multiple input strings S-1, S-2,...,S-n if we first concatenate the input strings into one long subject string S with a special symbol \"#\" for separation: S-1#S-2#...#S-n. The running time complexity of our algorithm is O(DN2) where N =vertical bar S-1 vertical bar + vertical bar S2 vertical bar + center dot center dot center dot + vertical bar S-1 vertical bar.", "paper_title": "An efficient algorithm for finding long conserved regions between genes", "paper_id": "WOS:000242127600005"}