{"auto_keywords": [{"score": 0.037338252544750976, "phrase": "information_competencies"}, {"score": 0.015719716506582538, "phrase": "information-related_competencies"}, {"score": 0.004534136929881113, "phrase": "large_number"}, {"score": 0.004488946121663966, "phrase": "different_contexts"}, {"score": 0.0043560464825349275, "phrase": "different_information-related_competencies"}, {"score": 0.004122490120202936, "phrase": "information-related_competent"}, {"score": 0.0035827424231607784, "phrase": "basic_level"}, {"score": 0.003356675879109443, "phrase": "e-learning_students"}, {"score": 0.0027602925235474317, "phrase": "key_factor"}, {"score": 0.0027054473441439422, "phrase": "internet_use"}, {"score": 0.002665027876903161, "phrase": "critical_factor"}, {"score": 0.0025219085140220773, "phrase": "canned_content"}, {"score": 0.0024842242921857705, "phrase": "learning_strategies"}, {"score": 0.0024348510123716424, "phrase": "proactive_attitude"}, {"score": 0.0022022878843247257, "phrase": "common_patterns"}, {"score": 0.0021049977753042253, "phrase": "better_information_systems"}], "paper_keywords": [""], "paper_abstract": "Personal information behavior has been studied within a large number of different contexts; however, individuals show different information-related competencies in their professional, academic or daily life contexts. Literature suggests that if a person is information-related competent in one context, then he or she will be competent in the rest of the contexts of action. But this is only true for a basic level of information competencies. This article reports results from 24 interviews performed to mature e-learning students and suggests that in a more advanced level of information competencies, some competencies that appear in one context are not manifested in another context. Several factors have been found to be related with information competencies transfer between contexts. Attitude is a key factor and feelings regarding Internet use is another critical factor. Specifically in learning environments, the results suggest that canned content and planned learning strategies can discourage a proactive attitude and enthusiasm for information and communication technologies, and therefore the acquisition of information-related competencies. Understanding the differences and common patterns between these contexts may be useful for designing better information systems, services and instruction.", "paper_title": "Key factors in the transfer of information-related competencies between academic, workplace, and daily life contexts", "paper_id": "WOS:000323377600004"}