{"auto_keywords": [{"score": 0.045146009142429014, "phrase": "logistic_regression"}, {"score": 0.015719716506582538, "phrase": "classifier_combination_methods"}, {"score": 0.004499647408293102, "phrase": "modified_random_subspace_method"}, {"score": 0.004204904449336037, "phrase": "input_data"}, {"score": 0.004074016501033133, "phrase": "logistic_model"}, {"score": 0.003841610436545169, "phrase": "input_variables"}, {"score": 0.0034937647771945803, "phrase": "typically_unknown_combination_function"}, {"score": 0.003369669078274226, "phrase": "taguchi_design"}, {"score": 0.003191714656606822, "phrase": "uncontrollable_factor"}, {"score": 0.002639502113350897, "phrase": "training_data"}, {"score": 0.0025000115574335693, "phrase": "random_subspace_method"}, {"score": 0.0022940375532231145, "phrase": "parametric_fusion_and_classifier_selection_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["bagging", " random subspace method", " classifier selection", " parametric fusion"], "paper_abstract": "In this paper, we compare the performances of classifier combination methods (bagging, modified random subspace method, classifier selection, parametric fusion) to logistic regression in consideration of various characteristics of input data. Four factors used to simulate the logistic model are: (a) combination function among input variables, (b) correlation between input variables, (c) variance of observation, and (d) training data set size. In view of typically unknown combination function among input variables, we use a Taguchi design to improve the practicality of our study results by letting it as an uncontrollable factor. Our experimental study results indicate the following: when training set size is large, performances of logistic regression and bagging are not significantly different. However, when training set size is small, the performance of logistic regression is worse than bagging. When training data set size is small and correlation is strong, both modified random subspace method and bagging perform better than the other three methods. When correlation is weak and variance is small, both parametric fusion and classifier selection algorithm appear to be the worst at our disappointment. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Experimental study for the comparison of classifier combination methods", "paper_id": "WOS:000241837300003"}