{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "logical_structure"}, {"score": 0.015556930206334117, "phrase": "xml_documents"}, {"score": 0.012303333224662658, "phrase": "user's_attention"}, {"score": 0.004496542293425754, "phrase": "textual_contents"}, {"score": 0.0042212686864468805, "phrase": "summarisation_methods"}, {"score": 0.00398370478688858, "phrase": "structure_summarisation"}, {"score": 0.0034555479218891638, "phrase": "particular_interest"}, {"score": 0.0034193226278107346, "phrase": "structure_summaries"}, {"score": 0.003312901888725435, "phrase": "hierarchical_tables"}, {"score": 0.003061072337623773, "phrase": "xml_elements"}, {"score": 0.0029814443878969973, "phrase": "document_portions"}, {"score": 0.002828331235643921, "phrase": "evaluation_methodology"}, {"score": 0.002711506442590442, "phrase": "summarisation_results"}, {"score": 0.002518525107994039, "phrase": "data_sets"}, {"score": 0.0024789887640568093, "phrase": "information_retrieval_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Structure summarisation", " XML retrieval"], "paper_abstract": "Summarisation is traditionally used to produce summaries of the textual contents of documents. In this paper, it is argued that summarisation methods can also be applied to the logical structure of XML documents. Structure summarisation selects the most important elements of the logical structure and ensures that the user's attention is focused towards sections, subsections, etc. that are believed to be of particular interest. Structure summaries are shown to users as hierarchical tables of contents. This paper discusses methods for structure summarisation that use various features of XML elements in order to select document portions that a user's attention should be focused to. An evaluation methodology for structure summarisation is also introduced and summarisation results using various summariser versions are presented and compared to one another. We show that data sets used in information retrieval evaluation can be used effectively in order to produce high quality (query independent) structure summaries. We also discuss the choice and effectiveness of particular summariser features with respect to several evaluation measures. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Summarisation of the logical structure of XML documents", "paper_id": "WOS:000307682100011"}