{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "goal-oriented_communication"}, {"score": 0.04221360547527579, "phrase": "initial_misunderstanding"}, {"score": 0.004745866089203346, "phrase": "general_theory"}, {"score": 0.004490060573956286, "phrase": "communicating_parties"}, {"score": 0.004351595642056769, "phrase": "potential_\"misunderstanding"}, {"score": 0.004227558710151181, "phrase": "initial_agreement"}, {"score": 0.0040774521865588565, "phrase": "\"reliable_communication"}, {"score": 0.003932654396285872, "phrase": "enormous_diversity"}, {"score": 0.0038389795739979713, "phrase": "simple_model"}, {"score": 0.0037656427459541787, "phrase": "simplest_form"}, {"score": 0.003378385493203297, "phrase": "third_party"}, {"score": 0.0031425305156614763, "phrase": "potential_misunderstanding"}, {"score": 0.0028602911504721986, "phrase": "main_concept"}, {"score": 0.0027123819773059127, "phrase": "user's_ability"}, {"score": 0.002634945181031141, "phrase": "referee's_assessment"}, {"score": 0.0023184728364226267, "phrase": "juba"}, {"score": 0.002307316474299739, "phrase": "sudan"}, {"score": 0.0022686315518300293, "phrase": "foregoing_phenomenon"}, {"score": 0.0022359993798189513, "phrase": "single_specific_goal"}, {"score": 0.0021049977753042253, "phrase": "full_generality"}], "paper_keywords": ["Theory", " Semantic communication", " interoperability"], "paper_abstract": "We put forward a general theory of goal-oriented communication, where communication is not an end in itself, but rather a means to achieving some goals of the communicating parties. Focusing on goals provides a framework for addressing the problem of potential \"misunderstanding\" during communication, where the misunderstanding arises from lack of initial agreement on what protocol and/or language is being used in communication. In this context, \"reliable communication\" means overcoming any initial misunderstanding between parties towards achieving a given goal. Despite the enormous diversity among the goals of communication, we propose a simple model that captures all goals. In the simplest form of communication we consider, two parties, a user and a server, attempt to communicate with each other in order to achieve some goal of the user. We show that any goal of communication can be modeled mathematically by introducing a third party, which we call the referee, who hypothetically monitors the conversation between the user and the server and determines whether or not the goal has been achieved. Potential misunderstanding between the players is captured by allowing each player (the user/server) to come from a (potentially infinite) class of players such that each player is unaware which instantiation of the other it is talking to. We identify a main concept, which we call sensing, that allows goals to be achieved even under misunderstanding. Informally, sensing captures the user's ability (potentially using help from the server) to simulate the referee's assessment on whether the communication is achieving the goal. We show that when the user can sense progress, the goal of communication can be achieved despite initial misunderstanding. We also show that in certain settings sensing is necessary for overcoming such initial misunderstanding. Our results significantly extend the scope of the investigation started by Juba and Sudan (STOC 2008) who studied the foregoing phenomenon in the case of a single specific goal. Our study shows that their main suggestion, that misunderstanding can be detected and possibly corrected by focusing on the goal, can be proved in full generality.", "paper_title": "A Theory of Goal-Oriented Communication", "paper_id": "WOS:000303445000003"}