{"auto_keywords": [{"score": 0.038876151391192805, "phrase": "internet_topology"}, {"score": 0.00481495049065317, "phrase": "impressive_growth"}, {"score": 0.0038647641000798135, "phrase": "networking_research_community"}, {"score": 0.0037973594873521596, "phrase": "growing_interest"}, {"score": 0.00355485940716082, "phrase": "network_topology_data"}, {"score": 0.0034018288705284427, "phrase": "internet's_properties"}, {"score": 0.0032697235411641695, "phrase": "crucial_juncture"}, {"score": 0.0032410683344688625, "phrase": "toplogy_measurement_infrastructures"}, {"score": 0.0030206579994328975, "phrase": "measurement_points"}, {"score": 0.0028526276660691525, "phrase": "large-scale_distributed_systems"}, {"score": 0.002693919110230191, "phrase": "next_generation"}, {"score": 0.002434396049547248, "phrase": "current_mechanisms"}, {"score": 0.002339771435910601, "phrase": "ip_interface"}, {"score": 0.002238930800075706, "phrase": "pop_level"}, {"score": 0.0021901485584955487, "phrase": "discovery_techniques"}, {"score": 0.0021049977753042253, "phrase": "well-known_properties"}], "paper_keywords": [""], "paper_abstract": "Since the beginning of the nineties, the internet has undergone impressive growth. This growth can be appreciated in terms of the equipment, such as routers and links, that has been added, as well as in the numbers of users and the value of commerce that it supports. In parallel to this expansion, over the past decade the networking research community has shown a growing interest in discovering and analyzing the internet topology. Some researchers have developed tools for gathering network topology data while others have tried to understand and model the internet's properties. These efforts have brought us to a crucial juncture for toplogy measurement infrastructures: while, previously, these were both small (in terms of number of measurement points) and monolithic, we are starting to see the deployment of large-scale distributed systems composed of hundreds or thousands of monitors. As we look forward to this next generation of systems, we take stock of what has been achieved so far. In this survey, we discuss past and current mechanisms for discovering the internet topology at various levels: the IP interface, the router, the AS, and the PoP level. In addition to discovery techniques, we provide insights into some of the well-known properties of the internet topology.", "paper_title": "INTERNET TOPOLOGY DISCOVERY: A SURVEY", "paper_id": "WOS:000208213900003"}