{"auto_keywords": [{"score": 0.049212993617288335, "phrase": "incomplete_information"}, {"score": 0.04857317035991675, "phrase": "automated_agent"}, {"score": 0.015719716506582538, "phrase": "bounded_rational_agents"}, {"score": 0.004579147045265106, "phrase": "day-to-day_life"}, {"score": 0.004276016541197123, "phrase": "desired_outcome"}, {"score": 0.004085115444878828, "phrase": "easy_task"}, {"score": 0.0036776458116294986, "phrase": "exact_tradeoff"}, {"score": 0.003611034322786669, "phrase": "different_outcomes"}, {"score": 0.003371773890338284, "phrase": "negotiation_process"}, {"score": 0.0031917943932454314, "phrase": "automated_negotiation_agent"}, {"score": 0.0026461080202599694, "phrase": "negotiators'_preferences"}, {"score": 0.0025862736445290088, "phrase": "additive_utilities"}, {"score": 0.0022857351723674004, "phrase": "significantly_better_agreements"}, {"score": 0.002234031373581961, "phrase": "individual_utility"}, {"score": 0.002193509835371438, "phrase": "human_counterparts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["bilateral negotiation", " bounded rationality", " incomplete information", " automated agent"], "paper_abstract": "Many tasks in day-to-day life involve interactions among several people. Many of these interactions involve negotiating over a desired outcome. Negotiation in and of itself is not an easy task, and it becomes more complex under conditions of incomplete information. For example, the parties do not know in advance the exact tradeoff of their counterparts between different outcomes. Furthermore information regarding the preferences of counterparts might only be elicited during the negotiation process itself. In this paper we propose a model for an automated negotiation agent capable of negotiating with bounded rational agents under conditions of incomplete information. We test this agent against people in two distinct domains, in order to verify that its model is generic, and thus can be adapted to any domain as long as the negotiators' preferences can be expressed in additive utilities. Our results indicate that the automated agent reaches more agreements and plays more effectively than its human counterparts. Moreover, in most of the cases, the automated agent achieves significantly better agreements, in terms of individual utility, than the human counterparts playing the same role. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Negotiating with bounded rational agents in environments with incomplete information using an automated agent", "paper_id": "WOS:000253604800008"}