{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "community-supporting_public_display_deployments"}, {"score": 0.03918347337434733, "phrase": "diverse_range"}, {"score": 0.00481495049065317, "phrase": "multifaceted_issues"}, {"score": 0.004673530058379246, "phrase": "digital_signage_systems"}, {"score": 0.004459605573798577, "phrase": "public_displays"}, {"score": 0.004347057700479576, "phrase": "transport_schedules"}, {"score": 0.004095323392273661, "phrase": "display_systems"}, {"score": 0.0038253590626087237, "phrase": "authors'_experiences"}, {"score": 0.0036191240628152205, "phrase": "large_set"}, {"score": 0.0033374705499418377, "phrase": "five_distinct_layers"}, {"score": 0.0028992294924613327, "phrase": "p-layers_framework"}, {"score": 0.002561752783323717, "phrase": "illustrative_examples"}, {"score": 0.002475755804232436, "phrase": "individual_layer"}, {"score": 0.0023024551893939403, "phrase": "valuable_aid"}], "paper_keywords": ["Community interaction", " public displays", " pervasive displays", " community needs"], "paper_abstract": "The proliferation of digital signage systems has prompted a wealth of research that attempts to use public displays for more than just advertisement or transport schedules, such as their use for supporting communities. However, deploying and maintaining display systems \"in the wild\" that can support communities is challenging. Based on the authors' experiences in designing and fielding a diverse range of community-supporting public display deployments, we identify a large set of challenges and issues that researchers working in this area are likely to encounter. Grouping them into five distinct layers -(1) hardware, (2) system architecture, (3) content, (4) system interaction, and (5) community interaction design we draw up the P-LAYERS framework to enable a more systematic appreciation of the diverse range of issues associated with the development, the deployment, and the maintenance of such systems. Using three of our own deployments as illustrative examples, we will describe both our experiences within each individual layer, as well as point out interactions between the layers. We believe our framework provides a valuable aid for researchers looking to work in this space, alerting them to the issues they are likely to encounter during their deployments, and help them plan accordingly.", "paper_title": "P-LAYERS - A Layered Framework Addressing the Multifaceted Issues Facing Community-Supporting Public Display Deployments", "paper_id": "WOS:000322361800005"}