{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coastal_environments"}, {"score": 0.04063631856968557, "phrase": "polygon_borders"}, {"score": 0.004699837689671504, "phrase": "adjacent_borderlines"}, {"score": 0.004571630734130793, "phrase": "environmental_research"}, {"score": 0.004540126719762935, "phrase": "geographical_information_systems"}, {"score": 0.004050442607427367, "phrase": "efficient_algorithm"}, {"score": 0.003967235882351874, "phrase": "multiple_predetermined_directions"}, {"score": 0.003926273177600597, "phrase": "large_number"}, {"score": 0.0035884582625234297, "phrase": "interval_tree"}, {"score": 0.0035025644647418983, "phrase": "line_segments"}, {"score": 0.003466382911409222, "phrase": "coastal_lines"}, {"score": 0.003190024306903021, "phrase": "meaningful_results"}, {"score": 0.0029356335847783195, "phrase": "straight-line_distance"}, {"score": 0.002875261849352716, "phrase": "nearest_shoreline"}, {"score": 0.002845541839157798, "phrase": "open_water_surface"}, {"score": 0.0027582072733520475, "phrase": "fetch_lengths"}, {"score": 0.002739165532192527, "phrase": "multiple_directions"}, {"score": 0.002720254890261961, "phrase": "general_openness"}, {"score": 0.002692132776447632, "phrase": "studied_point"}, {"score": 0.0025914765323897604, "phrase": "wave_power_calculations"}, {"score": 0.0024432508011008563, "phrase": "sw-finnish_coast"}, {"score": 0.002401286805515306, "phrase": "map_data"}, {"score": 0.0022327484973125936, "phrase": "complex_archipelago_environment"}, {"score": 0.0022096550791379033, "phrase": "high_spatial_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["efficient algorithms", " GIS", " fetch length", " exposure", " computational geometry"], "paper_abstract": "Distance from a point to adjacent borderlines is a variable that has many applications in environmental research. Geographical information systems (GIS) include tools for measuring such distances, but these tools are inefficient if there are multiple, i.e. millions of distances to be calculated. In this paper we propose an efficient algorithm which calculates the distances in multiple predetermined directions from a large number of points to polygon borders. The problem is significantly simplified by the fact that the distances are calculated in some directions, only. An interval tree is utilized for efficiently retrieving those line segments describing the coastal lines and the borders of the islands that are relevant in determining these distances. The algorithm is also robust so that it gives meaningful results in the presence of rounding errors regardless of the positions of the study points with respect to the polygon borders. In coastal environments the straight-line distance from a point to the nearest shoreline over an open water surface is referred to as fetch length. The fetch lengths in multiple directions indicate general openness around a studied point and it may also be used as a variable in wave power calculations. An implementation of the algorithm was used for calculating fetch data for the archipelago of SW-Finnish coast in the Baltic Sea. The map data contained 3 million vertices and fetch lengths were calculated for 2.5 million points in 48 directions. The algorithm enabled determining fetch lengths in the complex archipelago environment quickly in high spatial accuracy and it may have applications also in other geographical research and image processing. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Quantifying distances from points to polygons-applications in determining fetch in coastal environments", "paper_id": "WOS:000247900100001"}