{"auto_keywords": [{"score": 0.049178471674397164, "phrase": "oil_and_gas_domain"}, {"score": 0.034902004555957454, "phrase": "risk_picture"}, {"score": 0.029694022556377757, "phrase": "risk_model"}, {"score": 0.00481495049065317, "phrase": "system_changes"}, {"score": 0.00452670409375785, "phrase": "new_technology"}, {"score": 0.004441517985511521, "phrase": "considerable_impact"}, {"score": 0.003944112858235306, "phrase": "offshore_installations"}, {"score": 0.0038515000499988673, "phrase": "onshore_means"}, {"score": 0.0035864603175592854, "phrase": "new_risks"}, {"score": 0.003485605409687907, "phrase": "suitable_methods"}, {"score": 0.0031693980719538287, "phrase": "specialized_support"}, {"score": 0.0028409576481842457, "phrase": "related_parts"}, {"score": 0.002696101728474703, "phrase": "tool_support"}, {"score": 0.002371018116266096, "phrase": "language_constructs"}, {"score": 0.0021659920594094407, "phrase": "new_software_technology"}, {"score": 0.0021049977753042253, "phrase": "petroleum_installations"}], "paper_keywords": ["Security", " Risk analysis", " Change", " Oil and gas"], "paper_abstract": "Changes, such as the introduction of new technology, may have considerable impact on the risk to which a system or organization is exposed. For example, in the oil and gas domain, introduction of technology that allows offshore installations to be operated from onshore means that fewer people are exposed to risk on the installation, but it also introduces new risks and vulnerabilities. We need suitable methods and techniques to understand how a change will affect the risk picture. This paper presents an approach that offers specialized support for analysis of risk with respect to change. The approach allows links between elements of the target of analyses and the related parts of the risk model to be explicitly captured, which facilitates tool support for identifying the parts of a risk model that need to be reconsidered when a change is made to the target. Moreover, the approach offers language constructs for capturing the risk picture before and after a change. The approach is demonstrated on a case concerning new software technology to support decision making on petroleum installations.", "paper_title": "Security risk analysis of system changes exemplified within the oil and gas domain", "paper_id": "WOS:000355682600002"}