{"auto_keywords": [{"score": 0.04777654308122868, "phrase": "basic_whistleblowing_model"}, {"score": 0.014810931564621963, "phrase": "whistleblowing_theory"}, {"score": 0.007545986912441273, "phrase": "partial_mediation_model"}, {"score": 0.00481495049065317, "phrase": "troubled_it_projects"}, {"score": 0.00471071771178029, "phrase": "mediating_role"}, {"score": 0.004387225575447685, "phrase": "information_systems_literature"}, {"score": 0.004222299135545249, "phrase": "bad_news"}, {"score": 0.004176321608449849, "phrase": "troubled_projects"}, {"score": 0.0035826234811610316, "phrase": "personal_responsibility"}, {"score": 0.0032819448594643853, "phrase": "information_systems"}, {"score": 0.0028305047329728254, "phrase": "prior_research"}, {"score": 0.0023362245884046176, "phrase": "theoretical_justification"}, {"score": 0.00221153232497724, "phrase": "empirical_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Whistleblowing model", " Bad news reporting", " Partial mediation", " IT project management"], "paper_abstract": "Whistleblowing theory has been used in the information systems literature to help explain willingness to report bad news on troubled projects. According to whistleblowing theory, an individual first assesses the situation to determine if any action needs to be taken, then considers whether there is any personal responsibility to act, and this, in turn, shapes his/her choice of action. Information systems researchers have interpreted and used the basic whistleblowing model in a way that suggests that responsibility fully mediates the relationship between assessment and choice of action. While prior research has shown support for the basic whistleblowing model, the question of whether responsibility partially or fully mediates the relationship between the assessment and choice of action has not been tested empirically. This research provides theoretical justification for a partial mediation model. Using three different datasets, we provide empirical support for the partial mediation model. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Bad news reporting on troubled IT projects: Reassessing the mediating role of responsibility in the basic whistleblowing model", "paper_id": "WOS:000283641600024"}