{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "attention_resources"}, {"score": 0.004666228956744244, "phrase": "personal_information_management_research"}, {"score": 0.004569630374630379, "phrase": "navigation_preference"}, {"score": 0.0040942189695983185, "phrase": "dual-task_paradigm"}, {"score": 0.0036680857629458816, "phrase": "target_file"}, {"score": 0.003373334961160647, "phrase": "significantly_more_words"}, {"score": 0.003085989256759819, "phrase": "secondary_task"}, {"score": 0.0024377918036784336, "phrase": "retrieval_failures"}, {"score": 0.0023254633298356894, "phrase": "subjective_evaluation"}, {"score": 0.002253461585851626, "phrase": "folk_belief"}, {"score": 0.0021496083700137305, "phrase": "younger_people"}, {"score": 0.0021049977753042253, "phrase": "older_ones"}], "paper_keywords": ["Personal information management", " File retrieval", " Attention", " Dual-task paradigm"], "paper_abstract": "Personal information management research has consistently shown navigation preference over search. One possible explanation for this is that search requires more cognitive attention than navigation. We tested this hypothesis using the dual-task paradigm. We read a list of words to each of our 62 participants, asked them to navigate or search to a target file, and then compared the number of words recalled in each condition. Participants remembered significantly more words when retrieving by navigation than by search. The fact that they performed better at the secondary task when navigating indicates that it required less cognitive attention than search. Our results also cast doubt on the assumption that search is more efficient and easier to use than navigation: Search took nearly three times longer than navigation, was more vulnerable to mistakes and retrieval failures and was perceived as more difficult on a subjective evaluation. Our results also support the folk belief that women are better than men and that younger people are better than older ones, at multitasking.", "paper_title": "The use of attention resources in navigation versus search", "paper_id": "WOS:000315445100014"}