{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "local_binary_descriptors"}, {"score": 0.0045249263666466005, "phrase": "image_matching_tasks"}, {"score": 0.0038737214010638745, "phrase": "original_image"}, {"score": 0.0035951877427580006, "phrase": "inverse_problem_approach"}, {"score": 0.003357435261066107, "phrase": "image_content"}, {"score": 0.0029097582786754444, "phrase": "previous_results"}, {"score": 0.00265038878247831, "phrase": "different_local_binary_descriptors"}, {"score": 0.002585206414738808, "phrase": "image_information"}, {"score": 0.0025059724686541263, "phrase": "potential_applications"}, {"score": 0.002384206251320424, "phrase": "privacy_issues"}, {"score": 0.002325554982412043, "phrase": "image_keypoints"}, {"score": 0.0022825131641434964, "phrase": "mobile_devices"}, {"score": 0.002212535878761148, "phrase": "better_descriptors"}], "paper_keywords": ["Computer vision", " inverse problems", " image reconstruction", " BRIEF", " FREAK", " privacy"], "paper_abstract": "Local Binary Descriptors are becoming more and more popular for image matching tasks, especially when going mobile. While they are extensively studied in this context, their ability to carry enough information in order to infer the original image is seldom addressed. In this work, we leverage an inverse problem approach to show that it is possible to directly reconstruct the image content from Local Binary Descriptors. This process relies on very broad assumptions besides the knowledge of the pattern of the descriptor at hand. This generalizes previous results that required either a prior learning database or non-binarized features. Furthermore, our reconstruction scheme reveals differences in the way different Local Binary Descriptors capture and encode image information. Hence, the potential applications of our work are multiple, ranging from privacy issues caused by eavesdropping image keypoints streamed by mobile devices to the design of better descriptors through the visualization and the analysis of their geometric content.", "paper_title": "From Bits to Images: Inversion of Local Binary Descriptors", "paper_id": "WOS:000336054200004"}