{"auto_keywords": [{"score": 0.03983685074486537, "phrase": "average_download_time"}, {"score": 0.006346495242068633, "phrase": "system_utilization"}, {"score": 0.0048566395809159744, "phrase": "parallel_connections"}, {"score": 0.00481495049065317, "phrase": "content_delivery"}, {"score": 0.004736973212570135, "phrase": "stochastic_unstructured_peer-to-peer_network"}, {"score": 0.004554917803750564, "phrase": "large_files"}, {"score": 0.004510502900568775, "phrase": "measurement_results"}, {"score": 0.004394159734054881, "phrase": "average_download_session"}, {"score": 0.004184010117063648, "phrase": "dedicated_server"}, {"score": 0.00411620854480626, "phrase": "existing_results"}, {"score": 0.004023120753104693, "phrase": "stochastic_fluctuation"}, {"score": 0.003945001936004421, "phrase": "service_capacity"}, {"score": 0.0038431888954930083, "phrase": "major_reasons"}, {"score": 0.0030769941082173314, "phrase": "single_downloading_peer"}, {"score": 0.002948883844627217, "phrase": "multiple_competing_downloading_peers"}, {"score": 0.0026731799329374768, "phrase": "downloading_peers"}, {"score": 0.00247935055073462, "phrase": "minimum_average_download_time"}, {"score": 0.0024152714799789547, "phrase": "download_performance"}, {"score": 0.002391670093694849, "phrase": "earlier_results"}, {"score": 0.0023222375006409675, "phrase": "different_algorithms"}, {"score": 0.0022548160498101558, "phrase": "theoretical_explanation"}, {"score": 0.0022182072857447684, "phrase": "performance_improvement"}, {"score": 0.002139742163351676, "phrase": "single_connection"}, {"score": 0.0021049977753042253, "phrase": "measurement_studies"}], "paper_keywords": ["Computer network performance", " P2P networks"], "paper_abstract": "Peer-to-peer (P2P) network is widely used for transferring large files nowadays. Measurement results show that most downloading peers are patient as the average download session is usually very long. It is sometimes even longer than downloading from a dedicated server using a modem. Existing results in the literature indicate that the stochastic fluctuation and the heterogeneity in the service capacity of each peer are two of the major reasons that make the average download time far longer than expected. In those studies, it has been often assumed that there is only one downloading peer in the network, ignoring the interaction and competition among peers. In this paper, we investigate the impact of the interaction and competition among peers on downloading performance under stochastic, heterogeneous, and unstructured P2P settings, thereby greatly extending the existing results on stochastic P2P networks made only under a single downloading peer in the network. To analyze the average download time in a P2P network with multiple competing downloading peers, we first introduce the notion of system utilization tailored to a P2P network. We investigate the relationship among the average download time, system utilization, and the level of competition among downloading peers in a stochastic P2P network. We then derive an achievable lower bound on the average download time and propose algorithms to give the peers the minimum average download time. Our result can much improve the download performance compared to earlier results in the literature. The performance of the different algorithms is compared under NS-2 simulations. Our results also provide theoretical explanation to the inconsistency of performance improvement by using parallel connections (parallel connections sometimes do not outperform a single connection) observed in some measurement studies.", "paper_title": "On the Performance of Content Delivery under Competition in a Stochastic Unstructured Peer-to-Peer Network", "paper_id": "WOS:000281030200008"}