{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_inference_rules"}, {"score": 0.03822605865858222, "phrase": "visual_features"}, {"score": 0.01451856522145858, "phrase": "semantic_information"}, {"score": 0.011367229334453588, "phrase": "semi-concept_values"}, {"score": 0.010985018032136334, "phrase": "visual_and_animal_ontology"}, {"score": 0.004678785623021003, "phrase": "big_issues"}, {"score": 0.0046253989970108985, "phrase": "current_content-based_image_retrieval"}, {"score": 0.004171402455813099, "phrase": "efficient_method"}, {"score": 0.003221316290858497, "phrase": "semantic_gap"}, {"score": 0.003166259444961177, "phrase": "visual_ontology"}, {"score": 0.0027741761880779535, "phrase": "animal_ontology"}, {"score": 0.002726740692380339, "phrase": "animal_taxonomy"}, {"score": 0.002375253757224999, "phrase": "high-level_concepts"}, {"score": 0.0021416404045850224, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": [""], "paper_abstract": "One of the big issues facing current content-based image retrieval is how to automatically extract the semantic information from images. In this paper, we propose an efficient method that automatically extracts the semantic information from images by using ontologies and the semantic inference rules. In our method, MPEG-7 visual descriptors are used to extract the visual features of image which are mapped to the semi-concept values. We also introduce the visual and animal ontology which are built to bridge the semantic gap. The visual ontology facilitates the mapping between visual features and semi-concept values, and allows the definition of relationships between the classes describing the visual features. The animal ontology representing the animal taxonomy can be exploited to identify the object in an image. We also propose the semantic inference rules that can be used to automatically extract high-level concepts from images by applying them to the visual and animal ontology. Finally, we discuss the limitations of the proposed method and the future work.", "paper_title": "Full-automatic high-level concept extraction from images using ontologies and semantic inference rules", "paper_id": "WOS:000241446800031"}