{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mimo_networks"}, {"score": 0.049747721549480595, "phrase": "full-duplex_receiver_cooperation"}, {"score": 0.013795662170764701, "phrase": "csit"}, {"score": 0.004523272849033429, "phrase": "multiuser_networks"}, {"score": 0.003855347387268162, "phrase": "full-duplex_radios"}, {"score": 0.003815369123984481, "phrase": "full-duplex_feature"}, {"score": 0.003775803846431323, "phrase": "receiver_cooperation"}, {"score": 0.0033201720993656734, "phrase": "full-duplex_receivers"}, {"score": 0.003054367741379269, "phrase": "even_the_dof_region"}, {"score": 0.002980916123365584, "phrase": "important_classes"}, {"score": 0.0029602552900111433, "phrase": "two-user_mimo_broadcast"}, {"score": 0.0028293966058473476, "phrase": "different_terminals"}, {"score": 0.0028000270988465486, "phrase": "exact_dof_regions"}, {"score": 0.002723186210025975, "phrase": "dof-optimal_performance"}, {"score": 0.0026762323224804197, "phrase": "new_retro-cooperative_interference_alignment_schemes"}, {"score": 0.0026027798552168344, "phrase": "dof_analysis"}, {"score": 0.0023694599612252582, "phrase": "dof"}, {"score": 0.002320461594765317, "phrase": "csit."}, {"score": 0.002134508934917511, "phrase": "delayed_csit"}, {"score": 0.002105056860265915, "phrase": "shannon"}], "paper_keywords": ["Broadcast channel", " channel state information", " degrees of freedom", " full-duplex", " interference alignment", " interference channel", " MIMO", " receiver cooperation"], "paper_abstract": "The question of whether the degrees of freedom (DoF) of multiuser networks can be enhanced even under isotropic fading and no channel state information or output feedback at the transmitters (CSIT) is investigated. Toward this end, the two-user multiple-input multiple-output (MIMO) broadcast and interference channels are studied with no side-information at the transmitters and with receivers equipped with full-duplex radios. The full-duplex feature allows for receiver cooperation because each receiver, in addition to receiving the signals sent by the transmitters, can also simultaneously transmit a signal in the same band to the other receiver. Unlike the case of MIMO networks with CSIT and full-duplex receivers, for which DoF are known, it is shown that for MIMO networks with no CSIT, full-duplex receiver cooperation is beneficial to such an extent that even the DoF region is enhanced. Indeed, for important classes of two-user MIMO broadcast and interference channels, defined by certain relationships on numbers of antennas at different terminals, the exact DoF regions are established. The key to achieving DoF-optimal performance for such networks are new retro-cooperative interference alignment schemes. Their optimality is established via the DoF analysis of certain genie-aided or enhanced version of those networks. Taken together, the results of this paper show that full-duplex receiver cooperation can recover the DoF lost due to lack of CSIT. In particular, even without CSI and/or output feedback, it has the potential of yielding most, if not all, the gains promised by delayed CSIT, or even Shannon, feedback.", "paper_title": "The Degrees of Freedom of MIMO Networks With Full-Duplex Receiver Cooperation but no CSIT", "paper_id": "WOS:000342415600033"}