{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "approximate_symmetries"}, {"score": 0.004768649568826951, "phrase": "discrete_point_subsets"}, {"score": 0.004413846562278824, "phrase": "geometrical_design_intent"}, {"score": 0.0043713857434347254, "phrase": "approximate_boundary-representation"}, {"score": 0.0041450181887917135, "phrase": "reverse_engineering_systems"}, {"score": 0.003516558537200823, "phrase": "local_approximate_symmetries"}, {"score": 0.00346589179059467, "phrase": "discrete_point"}, {"score": 0.0033830587647810132, "phrase": "b-rep_model"}, {"score": 0.00328625950643742, "phrase": "model's_potential_local_symmetries"}, {"score": 0.0032232653428491435, "phrase": "non-trivial_symmetries"}, {"score": 0.003070996252787868, "phrase": "unambiguous_permutation_cycles"}, {"score": 0.0029830992938695007, "phrase": "approximately_regular_polygon"}, {"score": 0.002469830206270585, "phrase": "inter-point_distances"}, {"score": 0.0022967713922705, "phrase": "input_points"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["local approximate symmetry", " design intent", " reverse engineering"], "paper_abstract": "Detecting approximate symmetries of parts of a model is important when attempting to determine the geometrical design intent of approximate boundary-representation (B-rep) solid models produced e.g. by reverse engineering systems. For example, such detected symmetries may be enforced exactly on the model to improve its shape, to simplify its analysis, or to constrain it during editing. We give an algorithm to detect local approximate symmetries in a discrete point set derived from a B-rep model: the output comprises the model's potential local symmetries at various automatically detected tolerance levels. Non-trivial symmetries of subsets of the point set are found as unambiguous permutation cycles, i.e. vertices of an approximately regular polygon or an anti-prism, which are sufficiently separate from other points in the point set. The symmetries are detected using a rigorous, tolerance-controlled, incremental approach, which expands symmetry seed sets by one point at a time. Our symmetry cycle detection approach only depends on inter-point distances. The algorithm takes time O(n(4)) where n is the number of input points. Results produced by our algorithm are demonstrated using a variety of examples. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Detecting approximate symmetries of discrete point subsets", "paper_id": "WOS:000253669800009"}