{"auto_keywords": [{"score": 0.04581502828053674, "phrase": "functional_operation_conditions"}, {"score": 0.015466559729388697, "phrase": "reachable_states"}, {"score": 0.014972226276242992, "phrase": "new_characterization"}, {"score": 0.01395394027910343, "phrase": "delay_faults"}, {"score": 0.00481495049065317, "phrase": "piecewise-functional_broadside_tests"}, {"score": 0.004533685795068016, "phrase": "broadside_tests"}, {"score": 0.0033916328188225843, "phrase": "reachable_state"}, {"score": 0.0032107911131811057, "phrase": "functional_operation"}, {"score": 0.0029736479837154843, "phrase": "fault_coverage"}, {"score": 0.0028460640294160383, "phrase": "piecewise-functional_broadside_test"}, {"score": 0.002454432810862053, "phrase": "broadside_test"}, {"score": 0.0021994343316143125, "phrase": "broadside_test_sets"}, {"score": 0.0021049977753042253, "phrase": "closer-to-functional_operation_conditions"}], "paper_keywords": ["Broadside tests", " functional broadside tests", " overtesting", " transition faults"], "paper_abstract": "This paper describes a new characterization of broadside tests that measures the proximity to functional operation conditions during their functional clock cycles, where delay faults are detected. Proximity to functional operation conditions is important for avoiding overtesting of delay faults. The new characterization considers a test as piecewise-functional based on its scan-in state. For functional operation conditions, the scan-in state must be a reachable state (a state that the circuit can enter during functional operation). However, using only reachable states as scan-in states limits the fault coverage that can be achieved. In a piecewise-functional broadside test, the scan-in state can be partitioned into substates that are also substates of reachable states. The paper presents a definition that allows every broadside test to be characterized as piecewise-functional. It also describes procedures for characterization, and for modification of broadside test sets so as to ensure that they create closer-to-functional operation conditions.", "paper_title": "Piecewise-Functional Broadside Tests Based on Reachable States", "paper_id": "WOS:000357929500024"}