{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative_information_behavior"}, {"score": 0.04440305142854002, "phrase": "collaborative_aspects"}, {"score": 0.04141908209413028, "phrase": "collaborative_information"}, {"score": 0.02717735173206073, "phrase": "constitutive_activities"}, {"score": 0.004377719094086111, "phrase": "organizational_settings"}, {"score": 0.004295136518467118, "phrase": "key_insights"}, {"score": 0.0039049725966089455, "phrase": "cis"}, {"score": 0.0038167129895523466, "phrase": "cir"}, {"score": 0.00377326532920359, "phrase": "collaborative_search"}, {"score": 0.0037446140218109895, "phrase": "collaborative_sensemaking"}, {"score": 0.0035772012773052065, "phrase": "conceptual_clarity"}, {"score": 0.0033019779616246356, "phrase": "different_issues"}, {"score": 0.0031542917620807093, "phrase": "umbrella_term"}, {"score": 0.002626596189994921, "phrase": "cib"}, {"score": 0.002405853977978678, "phrase": "particular_phase"}, {"score": 0.0021049977753042253, "phrase": "cib_research"}], "paper_keywords": ["collaboration", " information seeking"], "paper_abstract": "There is increasing interest in topics at the nexus of collaboration and information behavior. A variety of studies conducted in organizational settings have provided us with key insights about the collaborative aspects of seeking, retrieving, and using information. Researchers have used a range of terms, including collaborative information seeking (CIS), collaborative information retrieval (CIR), collaborative search, collaborative sensemaking, and others to describe various pertinent activities. Consequently, we lack conceptual clarity concerning these activities, leading to a tendency to use terms interchangeably when in fact they may be referring to different issues. Here, we offer collaborative information behavior (CIB) as an umbrella term to connote the collaborative aspects of information seeking, retrieval, and use. We provide the contours of a model of CIB synthesized from findings of past studies conducted by our research team as well as other researchers. By reanalyzing and synthesizing the data from those studies, we conceptualize CIB as comprised of a set of constitutive activities, organized into three broad phasesproblem formulation, collaborative information seeking, and information use. Some of the activities are specific to a particular phase, whereas others are common to all phases. We explain how those constitutive activities are related to one another. Finally, we discuss the limitations of our model as well as its potential usefulness in advancing CIB research.", "paper_title": "Toward a Model of Collaborative Information Behavior in Organizations", "paper_id": "WOS:000330129200003"}