{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "structural_alerts"}, {"score": 0.00936882102665632, "phrase": "ochem"}, {"score": 0.004784795480627637, "phrase": "toxfic_chemicals"}, {"score": 0.004725048156646577, "phrase": "potential_adverse_reactions"}, {"score": 0.0046368166127362925, "phrase": "web-based_platform"}, {"score": 0.004564544414530739, "phrase": "toxicological_structural_alerts"}, {"score": 0.004493393608763752, "phrase": "virtual_screening"}, {"score": 0.004465243405240743, "phrase": "chemical_libraries"}, {"score": 0.004423346952963429, "phrase": "potentially_toxic_chemicals"}, {"score": 0.004340724551091173, "phrase": "adverse_side_effects"}, {"score": 0.004219663341808313, "phrase": "smarts_template"}, {"score": 0.003950103621065539, "phrase": "complementary_information"}, {"score": 0.0036285822640427525, "phrase": "fast_virtual_screening"}, {"score": 0.0036058303048537837, "phrase": "large_chemical_datasets"}, {"score": 0.003483211883149014, "phrase": "toxicological_alerts"}, {"score": 0.003439661147299417, "phrase": "detailed_profile"}, {"score": 0.003149630099034765, "phrase": "available_qsar_models"}, {"score": 0.0030616859252873235, "phrase": "alert-based_screening"}, {"score": 0.002994981018629787, "phrase": "easier_interpretation"}, {"score": 0.0027423420665298646, "phrase": "registered_ochem_user"}, {"score": 0.002716567128011818, "phrase": "new_alerts"}, {"score": 0.002542782716137888, "phrase": "user_sets"}, {"score": 0.002410256695500994, "phrase": "wide_variety"}, {"score": 0.0023651468875880628, "phrase": "qsar_models"}, {"score": 0.002350298241921987, "phrase": "additional_filtering"}, {"score": 0.0021723527926629234, "phrase": "reactive_metabolites"}, {"score": 0.0021249824741421306, "phrase": "adverse_reactions"}, {"score": 0.0021049977753042253, "phrase": "toxalerts_platform"}], "paper_keywords": [""], "paper_abstract": "The article presents a Web-based platform for collecting and storing toxicological structural alerts from literature and for virtual screening of chemical libraries to flag potentially toxic chemicals and compounds that can cause adverse side effects. An alert is uniquely identified by a SMARTS template, a toxicological endpoint, and a publication where the alert was described. Additionally, the system allows storing complementary information such as name, comments, and mechanism of action, as well as other data. Most importantly, the platform can be easily used for fast virtual screening of large chemical datasets, focused libraries, or newly designed compounds against the toxicological alerts, providing a detailed profile of the chemicals grouped by structural alerts and endpoints. Such a facility can be used for decision making regarding whether a compound should be tested experimentally, validated with available QSAR models, or eliminated from consideration altogether. The alert-based screening can also be helpful for an easier interpretation of more complex QSAR models. The system is publicly accessible and tightly integrated with the Online Chemical Modeling Environment (OCHEM, http://ochem.eu). The system is open and expandable: any registered OCHEM user can introduce new alerts, browse, edit alerts introduced by other users, and virtually screen his/her data sets against all or selected alerts. The user sets being passed through the structural alerts can be used at OCHEM for other typical tasks: exporting in a wide variety of formats, development of QSAR models, additional filtering by other criteria, etc. The database already contains almost 600 structural alerts for such endpoints as mutagenicity, carcinogenicity, skin sensitization, compounds that undergo metabolic activation, and compounds that form reactive metabolites and, thus, can cause adverse reactions. The ToxAlerts platform is accessible on the Web at http://ochem.eu/alerts, and it is constantly growing.", "paper_title": "ToxAlerts: A Web Server of Structural Alerts for Toxfic Chemicals and Compounds with Potential Adverse Reactions", "paper_id": "WOS:000308254200039"}