{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "idle-time-based_filtering_scheme"}, {"score": 0.042389058155836386, "phrase": "solution_space"}, {"score": 0.03997447142565907, "phrase": "partial_solution"}, {"score": 0.004650330504968421, "phrase": "open_shop_scheduling_problems"}, {"score": 0.004610058444728656, "phrase": "ossp"}, {"score": 0.00428146713705618, "phrase": "problem-solving_time"}, {"score": 0.004225950334493496, "phrase": "acceptable_time_range"}, {"score": 0.0031568884810273226, "phrase": "unnecessary_partial_solutions"}, {"score": 0.002906138793910919, "phrase": "new_bee_colony_optimization_algorithm"}, {"score": 0.0027461155463816772, "phrase": "smaller_the_idle-time"}, {"score": 0.002462664392109308, "phrase": "insufficient_profitability"}, {"score": 0.0023782753249846794, "phrase": "new_scheduling_solution"}, {"score": 0.002286781334850213, "phrase": "remaining_partial_solution"}, {"score": 0.0022084059770026416, "phrase": "bee_colony_optimization_heuristic_rule"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bee colony optimization", " Open shop scheduling"], "paper_abstract": "Open shop scheduling problems (OSSP) are one of the most time-consuming works in scheduling problems. Currently, many artificial intelligence algorithms can reduce the problem-solving time to an acceptable time range, and even can further downsize the range of solution space. Although the range of solution space is technically downsized, in most scheduling algorithms every partial solution still needs to be completely solved before this solution can be evaluated. For example, if there is a schedule with 100 operations, then all 100 operations must be scheduled before the scheduler can evaluate its fitness. Therefore, the time-cost of unnecessary partial solutions is no longer saved. In order to improve the weakness stated above, this paper proposes a new bee colony optimization algorithm, with an idle-time-based filtering scheme, according to the inference of \"the smaller the idle-time, the smaller the partial solution\", and \"the smaller the makespan (Cmax) will be\". It can automatically stop searching a partial solution with insufficient profitability, while the scheduler is creating a new scheduling solution, and therefore, save time-cost for the remaining partial solution. The architecture and details of the bee colony optimization heuristic rule is detailed in this paper. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A new bee colony optimization algorithm with idle-time-based filtering scheme for open shop-scheduling problems", "paper_id": "WOS:000287419900087"}