{"auto_keywords": [{"score": 0.03843856552198325, "phrase": "real_ones"}, {"score": 0.03438698453735681, "phrase": "noise_requests"}, {"score": 0.012690123404918633, "phrase": "noise_injection"}, {"score": 0.012301164536820475, "phrase": "service_providers"}, {"score": 0.00481495049065317, "phrase": "privacy_protection"}, {"score": 0.004781498797706604, "phrase": "cloud_computing"}, {"score": 0.004682525167261325, "phrase": "open_environment"}, {"score": 0.004537875262684779, "phrase": "as-you-go_fashion"}, {"score": 0.004217425501814589, "phrase": "service_requests"}, {"score": 0.004087084193780308, "phrase": "customer_private_information"}, {"score": 0.0038249462699142733, "phrase": "noise_service_requests"}, {"score": 0.003798346343693706, "phrase": "real_customer_service_requests"}, {"score": 0.0036046342610557497, "phrase": "effective_approach"}, {"score": 0.0035299344877334385, "phrase": "request_occurrence_probabilities"}, {"score": 0.0034327289845581693, "phrase": "current_obfuscation"}, {"score": 0.0033851312604425516, "phrase": "random_noise_requests"}, {"score": 0.003280427617955518, "phrase": "large_number"}, {"score": 0.003091381857342703, "phrase": "i.e._service_providers"}, {"score": 0.003027286031578399, "phrase": "pay-as-you-go_cloud_environment"}, {"score": 0.0029131986574478072, "phrase": "real_request"}, {"score": 0.002586972610351776, "phrase": "novel_historical_probability_based_noise_generation_strategy"}, {"score": 0.002202847728425357, "phrase": "random_strategy"}, {"score": 0.0021496083700137305, "phrase": "simulation_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cloud computing", " Privacy protection", " Noise generation strategy", " Historical probability"], "paper_abstract": "Cloud computing promises an open environment where customers can deploy IT services in pay-as-you-go fashion while saving huge capital investment in their own IT infrastructure. Due to the openness, various malicious service providers can exist. Such service providers may record service requests from a customer and then collectively deduce the customer private information. Therefore, customers need to take certain actions to protect their privacy. Obfuscation with noise injection, that mixes noise service requests with real customer service requests so that service providers will be confused about which requests are real ones, is an effective approach in this regard if those request occurrence probabilities are about the same. However, current obfuscation with noise injection uses random noise requests. Due to the randomness it needs a large number of noise requests to hide the real ones so that all of their occurrence probabilities are about the same, i.e. service providers would be confused. In pay-as-you-go cloud environment, a noise request will cost the same as a real request. Hence, with the same level of confusion, i.e. customer privacy protection, the number of noise requests should be kept as few as possible. Therefore in this paper we develop a novel historical probability based noise generation strategy. Our strategy generates noise requests based on their historical occurrence probability so that all requests including noise and real ones can reach about the same occurrence probability, and then service providers would not be able to distinguish in between. Our strategy can significantly reduce the number of noise requests over the random strategy, by more than 90% as demonstrated by simulation evaluation. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A historical probability based noise generation strategy for privacy protection in cloud computing", "paper_id": "WOS:000305312300008"}