{"auto_keywords": [{"score": 0.01523167046253376, "phrase": "experimental_results"}, {"score": 0.010612387000973441, "phrase": "inconsistent_decision_tables"}, {"score": 0.00922630856701608, "phrase": "distribution_reduct"}, {"score": 0.008140326463659524, "phrase": "quick_distribution_reduction_algorithm"}, {"score": 0.006056696587236599, "phrase": "cebarknc"}, {"score": 0.004701015188740582, "phrase": "attribute_reducts"}, {"score": 0.004258717300328513, "phrase": "judgment_theorems"}, {"score": 0.004220624516321415, "phrase": "assignment_reduct"}, {"score": 0.00414545383888272, "phrase": "maximum_distribution_reduct"}, {"score": 0.00384633057714983, "phrase": "significance_measures"}, {"score": 0.003777800904236079, "phrase": "quick_assignment_reduction_algorithm"}, {"score": 0.0035901685646972585, "phrase": "quick_maximum_distribution_reduction_algorithm"}, {"score": 0.0034118234596993836, "phrase": "comparative_experiments"}, {"score": 0.0032036590920314725, "phrase": "relevant_algorithm"}, {"score": 0.003109031770476385, "phrase": "quickreduct"}, {"score": 0.0030904433394138963, "phrase": "weak_robustness"}, {"score": 0.0029991500396912923, "phrase": "consistent_data_sets"}, {"score": 0.0026362590493392785, "phrase": "computing_core"}, {"score": 0.0025354258731826148, "phrase": "heuristic_search"}, {"score": 0.0024311346712789553, "phrase": "distribution_function"}, {"score": 0.0023949342544966916, "phrase": "lower_calculation_cost"}, {"score": 0.002380605108907738, "phrase": "instructive_conclusions"}, {"score": 0.0023592715993204796, "phrase": "reduction_algorithms"}, {"score": 0.002310232205403468, "phrase": "classification_performance"}, {"score": 0.002228519136218028, "phrase": "discernibility_matrix-based_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Attribute reduction", " Inconsistent decision table", " Assignment reduct", " Distribution reduct", " Maximum distribution reduct"], "paper_abstract": "This paper focuses on three types of attribute reducts in inconsistent decision tables: assignment reduct, distribution reduct, and maximum distribution reduct. It is quite inconvenient to judge these three types of reduct directly according to their definitions. This paper proposes judgment theorems for the assignment reduct, the distribution reduct and the maximum distribution reduct, which are expected to greatly simplify the judging of these three types of reducts. On this basis, we derive three new types of attribute significance measures and construct the Q-ARA (Quick Assignment Reduction Algorithm), the Q-DRA (Quick Distribution Reduction Algorithm), and the Q-MDRA (Quick Maximum Distribution Reduction Algorithm). These three algorithms correspond to the three types of reducts. We conduct a series of comparative experiments with twelve UCI (machine learning data repository, University of California at Irvine) data sets (including consistent and inconsistent decision tables) to evaluate the performance of the three reduction algorithms proposed with the relevant algorithm QuickReduct [9,34]. The experimental results show that QuickReduct possesses weak robustness because it cannot find the reduct even for consistent data sets, whereas our proposed three algorithms show strong robustness because they can find the reduct for each data set. In addition, we compare the Q-DRA (Quick Distribution Reduction Algorithm) with the CEBARKNC (conditional entropy-based algorithm for reduction of knowledge without a computing core) [43] because both find the distribution reduct by using a heuristic search. The experimental results demonstrate that Q-DRA runs faster than CEBARKNC does because the distribution function of Q-DRA has a lower calculation cost. Instructive conclusions for these reduction algorithms are drawn from the perspective of classification performance for the C4.5 and RBF-SVM classifiers. Last, we make a comparison between discernibility matrix-based methods and our algorithms. The experimental results indicate that our algorithms are efficient and feasible. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Quick attribute reduction in inconsistent decision tables", "paper_id": "WOS:000326210400010"}