{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "shape_differences"}, {"score": 0.00481495049065317, "phrase": "intrinsic_shape_differences"}, {"score": 0.00467207889925365, "phrase": "novel_formulation"}, {"score": 0.004475266375001531, "phrase": "detailed_information"}, {"score": 0.0040708542958968605, "phrase": "shape_map"}, {"score": 0.003934753707639395, "phrase": "shape_collections"}, {"score": 0.0035620354052144656, "phrase": "linear_algebraic_framework"}, {"score": 0.0034118528891815113, "phrase": "svd"}, {"score": 0.0033826401081013947, "phrase": "pca"}, {"score": 0.003310447652300423, "phrase": "matrix_representation"}, {"score": 0.002822434555587263, "phrase": "entire_shape"}, {"score": 0.002566997205079849, "phrase": "shape_difference"}, {"score": 0.002544951823639408, "phrase": "consistent_correspondences"}, {"score": 0.002226430168622392, "phrase": "intrinsic_variability"}, {"score": 0.002197801146305747, "phrase": "shape_collection"}, {"score": 0.002150900082318562, "phrase": "local_variability"}, {"score": 0.002132420504803564, "phrase": "different_scales"}, {"score": 0.0021049977753042253, "phrase": "shape_analogies"}], "paper_keywords": ["Shape comparison", " shape matching", " shape variability", " data-driven methods"], "paper_abstract": "We develop a novel formulation for the notion of shape differences, aimed at providing detailed information about the location and nature of the differences or distortions between the two shapes being compared. Our difference operator, derived from a shape map, is much more informative than just a scalar global shape similarity score, rendering it useful in a variety of applications where more refined shape comparisons are necessary. The approach is intrinsic and is based on a linear algebraic framework, allowing the use of many common linear algebra tools (e.g, SVD, PCA) for studying a matrix representation of the operator. Remarkably, the formulation allows us not only to localize shape differences on the shapes involved, but also to compare shape differences across pairs of shapes, and to analyze the variability in entire shape collections based on the differences between the shapes. Moreover, while we use a map or correspondence to define each shape difference, consistent correspondences between the shapes are not necessary for comparing shape differences, although they can be exploited if available. We give a number of applications of shape differences, including parameterizing the intrinsic variability in a shape collection, exploring shape collections using local variability at different scales, performing shape analogies, and aligning shape collections.", "paper_title": "Map-Based Exploration of Intrinsic Shape Differences and Variability", "paper_id": "WOS:000321840100041"}