{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_flow_recording"}, {"score": 0.0097330575841497, "phrase": "network_operators"}, {"score": 0.009613474158994953, "phrase": "privacy_policy"}, {"score": 0.0055215960642167276, "phrase": "recorded_data"}, {"score": 0.00474075475474847, "phrase": "important_tool"}, {"score": 0.004653220443592979, "phrase": "legal_compliance"}, {"score": 0.004624401316503576, "phrase": "security_auditing"}, {"score": 0.004595759852879717, "phrase": "network_forensics"}, {"score": 0.004469042910390712, "phrase": "current_network_flow_recording_technologies"}, {"score": 0.004008467832216946, "phrase": "public_key_infrastructure"}, {"score": 0.0037903327482565097, "phrase": "network_flow_recording_technology"}, {"score": 0.0037087324991876727, "phrase": "identity_based_encryption"}, {"score": 0.003662892058072211, "phrase": "privacy-preserving_semantics"}, {"score": 0.003506851152129303, "phrase": "wide_range"}, {"score": 0.0032749212355657215, "phrase": "encryption_and_statistics"}, {"score": 0.003145125312514813, "phrase": "commodity_systems"}, {"score": 0.0030582832134483685, "phrase": "interesting_caveats"}, {"score": 0.0028737647829311587, "phrase": "implementation_details"}, {"score": 0.0028293966058473476, "phrase": "privacy-preserving_network_flow_recording"}, {"score": 0.002474961375646351, "phrase": "important_first_step"}, {"score": 0.0024595996811420566, "phrase": "policy_makers"}, {"score": 0.002362041061180632, "phrase": "network_flow_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["NetFlow", " Network forensics", " Identity based encryption", " Privacy preserving semantics", " Statistical database"], "paper_abstract": "Network flow recording is an important tool with applications that range from legal compliance and security auditing to network forensics, troubleshooting, and marketing. Unfortunately, current network flow recording technologies do not allow network operators to enforce a privacy policy on the data that is recorded, in particular how this data is stored and used within the organization. Challenges to building such a technology include the public key infrastructure, scalability, and gathering statistics about the data while still preserving privacy. We present a network flow recording technology that addresses these challenges by using Identity Based Encryption in combination with privacy-preserving semantics for on-the-fly statistics. We argue that our implementation supports a wide range of policies that cover many current applications of network flow recording. We also characterize the performance and scalability of our implementation and find that the encryption and statistics scale well and can easily keep up with the rate at which commodity systems can capture traffic, with a couple of interesting caveats about the size of the subnet that data is being recorded for and how statistics generation is affected by implementation details. We conclude that privacy-preserving network flow recording is possible at 10 gigabit rates for subnets as large as a /20 (4096 hosts). Because network flow recording is one of the most serious threats to web privacy today, we believe that developing technology to enforce a privacy policy on the recorded data is an important first step before policy makers can make decisions about how network operators can and should store and use network flow data. Our goal in this paper is to explore the tradeoffs of performance and scalability vs. privacy, and the usefulness of the recorded data in forensics vs. privacy. (C) 2011 Shebaro & Crandall. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Privacy-preserving network flow recording", "paper_id": "WOS:000293273800011"}