{"auto_keywords": [{"score": 0.04968114352851346, "phrase": "neoadjuvant_chemotherapy"}, {"score": 0.03812983798224722, "phrase": "feature_selection"}, {"score": 0.00481495049065317, "phrase": "breast_cancer"}, {"score": 0.004676345706416371, "phrase": "machine_learning_methods"}, {"score": 0.004598933498016774, "phrase": "eventual_therapeutic_response"}, {"score": 0.0045607070754363245, "phrase": "breast_cancer_patients"}, {"score": 0.004503959683578956, "phrase": "single_cycle"}, {"score": 0.004319944434326221, "phrase": "quantitative"}, {"score": 0.0039571974661570695, "phrase": "nac."}, {"score": 0.003685972800046028, "phrase": "bayesian_logistic_regression"}, {"score": 0.0035204268675160257, "phrase": "predictive_model_building"}, {"score": 0.0034620831765465425, "phrase": "best_predictive_models"}, {"score": 0.0030414140732789186, "phrase": "numerous_options"}, {"score": 0.0030161008373809643, "phrase": "nac"}, {"score": 0.0023764959294052964, "phrase": "treatment_regimen"}, {"score": 0.00227914162528171, "phrase": "important_clinical_problem"}, {"score": 0.0022413233627905696, "phrase": "modeling_approaches"}, {"score": 0.0022133711375320244, "phrase": "machine_learning"}, {"score": 0.002194929830604162, "phrase": "readily_available_clinical_and_quantitative_mri_data"}, {"score": 0.002149494537191303, "phrase": "breast_cancer_responders"}, {"score": 0.0021049977753042253, "phrase": "first_cycle"}], "paper_keywords": [""], "paper_abstract": "Objective To employ machine learning methods to predict the eventual therapeutic response of breast cancer patients after a single cycle of neoadjuvant chemotherapy (NAC). Materials and methods Quantitative dynamic contrast-enhanced MRI and diffusion-weighted MRI data were acquired on 28 patients before and after one cycle of NAC. A total of 118 semiquantitative and quantitative parameters were derived from these data and combined with 11 clinical variables. We used Bayesian logistic regression in combination with feature selection using a machine learning framework for predictive model building. Results The best predictive models using feature selection obtained an area under the curve of 0.86 and an accuracy of 0.86, with a sensitivity of 0.88 and a specificity of 0.82. Discussion With the numerous options for NAC available, development of a method to predict response early in the course of therapy is needed. Unfortunately, by the time most patients are found not to be responding, their disease may no longer be surgically resectable, and this situation could be avoided by the development of techniques to assess response earlier in the treatment regimen. The method outlined here is one possible solution to this important clinical problem. Conclusions Predictive modeling approaches based on machine learning using readily available clinical and quantitative MRI data show promise in distinguishing breast cancer responders from non-responders after the first cycle of NAC.", "paper_title": "Machine learning for predicting the response of breast cancer to neoadjuvant chemotherapy", "paper_id": "WOS:000320168600013"}