{"auto_keywords": [{"score": 0.040432498526378265, "phrase": "pairwise_comparison"}, {"score": 0.0388936759851193, "phrase": "multiple_binding_sites"}, {"score": 0.00481495049065317, "phrase": "site_recognition"}, {"score": 0.004591466267316524, "phrase": "binding_site_recognition"}, {"score": 0.004459101239560164, "phrase": "protein_structures"}, {"score": 0.004298974960001275, "phrase": "cavity_detection"}, {"score": 0.00411436400374349, "phrase": "similar_regions"}, {"score": 0.0035671997165370403, "phrase": "large_collections"}, {"score": 0.0033890026927890058, "phrase": "preliminary_step"}, {"score": 0.003291188255149539, "phrase": "binding_sites"}, {"score": 0.0030587884803931964, "phrase": "common_functional_structure"}, {"score": 0.0030032915123993837, "phrase": "binding_site"}, {"score": 0.002191600750693037, "phrase": "different_databases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Protein surfaces comparison", " Spin-images", " Binding sites", " Cavity detection", " Drug design"], "paper_abstract": "We developed a suite of methods for the problem of protein binding site recognition, based on a representation of the protein structures by a collection of spin-images. A procedure for cavity detection is coupled with a method previously developed for the recognition of similar regions in two proteins, and applied to the comparison of two protein's cavities, the all-to-all pairwise comparison of a set of cavities, and the recognition of multiple binding sites in one cavity. All the presented methods can be used to screen large collections of proteins. The detection of cavities in a given protein is often the preliminary step in protein binding site recognition, since binding sites usually lie in cavities. The comparison of two cavities identifies two similar regions in the two cavities, and hints at a common functional structure when one or both regions include a binding site. The all-to-all pairwise comparison of a set of cavities is clustered according to the measure of similarity of the cavities, obtaining a Clustering that groups together cavities with the same binding sites, when their structures are similar enough. Recognition of multiple binding sites in one cavity is performed by the comparison of a cavity, called background cavity, with a dataset of cavities, and clustering its residues that match the residues of other cavities in the data set. The four methods are benchmarked on different databases, and their effectiveness is discussed. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Cavity detection and matching for binding site recognition", "paper_id": "WOS:000261416700007"}