{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "minority_discipline"}, {"score": 0.004611108249179507, "phrase": "user-centered_design_practice"}, {"score": 0.004102639724186862, "phrase": "broad_range"}, {"score": 0.004014800383343256, "phrase": "respondents'_profiles"}, {"score": 0.003980191398041843, "phrase": "current_development_environment"}, {"score": 0.003911862375084159, "phrase": "user-centered_design"}, {"score": 0.0038447018470115146, "phrase": "korean_it_development_environments"}, {"score": 0.003450213580299164, "phrase": "development_practitioners"}, {"score": 0.0032191849045822415, "phrase": "customer_requirements"}, {"score": 0.0030560920414081645, "phrase": "project_schedule"}, {"score": 0.002990592465417758, "phrase": "project_budgets"}, {"score": 0.0025585490847951703, "phrase": "relatively_weak_position"}, {"score": 0.0025364615261136655, "phrase": "short_hci_tradition"}, {"score": 0.0025036862991477437, "phrase": "korean_it_industry"}, {"score": 0.0023767561522363367, "phrase": "ucd_planning"}, {"score": 0.002256262424170166, "phrase": "korea"}, {"score": 0.002227083991228041, "phrase": "important_information_source"}, {"score": 0.002188850568133948, "phrase": "europe"}], "paper_keywords": [""], "paper_abstract": "This article reports the results of a survey conducted in 2003 of 184 information technology (IT) development practitioners and 90 user interface (UI)/usability practitioners. The survey covered a broad range of issues including the respondents' profiles, current development environment, usability and user-centered design (UCD) adoption issues in Korean IT development environments, overall assessment of UCD/usability, and the most widely used methods and techniques. The results reveal various UCD/usability practices and problems in the IT industry. For both development practitioners and UI/usability practitioners, the most serious problems encountered in a project are the differences between output and customer requirements, as well as further requirements from customer, delays in a project schedule, and overages on project budgets. The degree of recognition of usability/UCD is higher than expected, but UCD/usability is not yet fully employed in the project, because 42% of respondents used usability/UCD. Profiles from UI/usability practitioners and projects show a relatively weak position and short HCI tradition in the Korean IT industry This study is expected to provide both an empirical basis for usability and UCD planning, training, adoption, and execution in the IT industry of Korea and an important information source for many HCI practitioners outside Europe and the United States who struggle to introduce usability into their IT industries.", "paper_title": "Enhancing the minority discipline in the IT industry: A survey of usability and user-centered design practice", "paper_id": "WOS:000236067800003"}