{"auto_keywords": [{"score": 0.03524916520447615, "phrase": "itfu"}, {"score": 0.004860218511356111, "phrase": "time"}, {"score": 0.004773319428859789, "phrase": "impact"}, {"score": 0.004732785510739708, "phrase": "individual_task_performance"}, {"score": 0.004684157900507474, "phrase": "anecdotal_evidence"}, {"score": 0.004620093797504386, "phrase": "research_studies"}, {"score": 0.004556901872357751, "phrase": "functional_potential"}, {"score": 0.004525629293824217, "phrase": "installed_it_applications"}, {"score": 0.004053362743156545, "phrase": "technology_capability"}, {"score": 0.003667925754747227, "phrase": "continual_and_distal_task_performance"}, {"score": 0.0033651019362620866, "phrase": "task_accomplishment"}, {"score": 0.0032510690712452147, "phrase": "diminishing_growth_rates"}, {"score": 0.0032176163279340206, "phrase": "early_stages"}, {"score": 0.00319550533852219, "phrase": "system_use"}, {"score": 0.0030659842174709656, "phrase": "system's_feature_potential"}, {"score": 0.0030135741897058844, "phrase": "later_stages"}, {"score": 0.0028715299874549245, "phrase": "work_task"}, {"score": 0.0027551040319267446, "phrase": "stable_subset"}, {"score": 0.0026986685585382347, "phrase": "task_completion"}, {"score": 0.002302619021497886, "phrase": "study_results"}, {"score": 0.002286781334850213, "phrase": "better_understanding"}, {"score": 0.002255431275670053, "phrase": "individual_itfu"}, {"score": 0.0021049977753042253, "phrase": "experience-based_feature_upgrades"}], "paper_keywords": ["IT Feature Use", " Technology Capability Broadening and Deepening", " IT Skill Acquisition", " Task Performance", " Longitudinal Research", " Latent Growth Modeling"], "paper_abstract": "Although anecdotal evidence in organizations and research studies suggest that the functional potential of installed IT applications is underutilized and that most users apply just a narrow band of features, there is still little understanding about the nature and implications of change in IT feature use (ITFU) over time. Drawing on technology capability broadening-deepening and IT skill acquisition literatures, this study investigates how IT use-conceptualized at the IT feature level-evolves over time and how it affects continual and distal task performance during the initial usage of an IT application. The results of two longitudinal panel studies of 330 and 314 IT users show that, when users start using an IT application for task accomplishment, ITFU increases non-linearly over time with diminishing growth rates. At early stages of system use, users predominantly extend their ITFU to become more familiar with the system's feature potential, while, at later stages, when users have increasingly recognized a match between the requirements of a work task and system features, they focus more heavily on leveraging a stable subset of IT features to benefit from task completion. As such, the magnitude in broadening and deepening capabilities in using IT features decreases over time. Moreover, both studies reveal that growth in ITFU has, in and of itself, significant impacts not only on immediate performance perceptions but also on more delayed, objective task performance. Researchers will benefit from the study results by better understanding the dynamics of individual ITFU and their performance implications. Managers striving to encourage users to expand their IT feature repertoire may use the results to conduct experience-based feature upgrades or training programs.", "paper_title": "IT Feature Use over Time and its Impact on Individual Task Performance", "paper_id": "WOS:000355274300001"}