{"auto_keywords": [{"score": 0.0497377294589231, "phrase": "ehealth_applications"}, {"score": 0.00481495049065317, "phrase": "screening_instruments"}, {"score": 0.004596192494271827, "phrase": "current_health_literacy"}, {"score": 0.004466519142879166, "phrase": "consumer-facing_and_mobile_health_information_technology_screening"}, {"score": 0.004309546805133142, "phrase": "pubmed"}, {"score": 0.004278807723634654, "phrase": "ovid"}, {"score": 0.004248485180368517, "phrase": "google"}, {"score": 0.004055176557424983, "phrase": "health_literacy_assessment_instruments"}, {"score": 0.0035015674744573377, "phrase": "eleven_different_health_literacy_instruments"}, {"score": 0.003451766520526601, "phrase": "screening_questions"}, {"score": 0.0032947371184395237, "phrase": "health_information"}, {"score": 0.00323625520042892, "phrase": "seven_different_studies"}, {"score": 0.002764252199256058, "phrase": "psychometric_properties"}, {"score": 0.002744510304340939, "phrase": "computer-based_health_literacy_instruments"}, {"score": 0.0025730425700096365, "phrase": "varying_benefits"}, {"score": 0.0024383449794706477, "phrase": "single_screening_question"}, {"score": 0.0022941723937662927, "phrase": "health_literacy"}, {"score": 0.0022777800735119405, "phrase": "technological_literacy"}, {"score": 0.002229300966775032, "phrase": "user_needs"}, {"score": 0.0021507795710951384, "phrase": "best_synthesis"}, {"score": 0.0021049977753042253, "phrase": "computer-based_health_literacy_screening"}], "paper_keywords": ["Health literacy", " Systematic review"], "paper_abstract": "Objective: To systematically review current health literacy (HL) instruments for use in consumer-facing and mobile health information technology screening and evaluation tools. Design: The databases, PubMed, OVID, Google Scholar, Cochrane Library and Science Citation Index, were searched for health literacy assessment instruments using the terms \"health\", \"literacy\", \"computer-based,\" and \"psychometrics\". All instruments identified by this method were critically appraised according to their reported psychometric properties and clinical feasibility. Results: Eleven different health literacy instruments were found. Screening questions, such as asking a patient about his/her need for assistance in navigating health information, were evaluated in seven different studies and are promising for use as a valid, reliable, and feasible computer-based approach to identify patients that struggle with low health literacy. However, there was a lack of consistency in the types of screening questions proposed. There is also a lack of information regarding the psychometric properties of computer-based health literacy instruments. Limitations: Only English language health literacy assessment instruments were reviewed and analyzed. Conclusions: Current health literacy screening tools demonstrate varying benefits depending on the context of their use. In many cases, it seems that a single screening question may be a reliable, valid, and feasible means for establishing health literacy. A combination of screening questions that assess health literacy and technological literacy may enable tailoring eHealth applications to user needs. Further research should determine the best screening question(s) and the best synthesis of various instruments' content and methodologies for computer-based health literacy screening and assessment. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Health literacy screening instruments for eHealth applications: A systematic review", "paper_id": "WOS:000305495500020"}