{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multipurpose_public_displays"}, {"score": 0.004732785510739708, "phrase": "automated_grouping"}, {"score": 0.0044688500725247726, "phrase": "bespoke_single-purpose_displays"}, {"score": 0.004392565073466714, "phrase": "public_interactive_displays"}, {"score": 0.0041001740903338834, "phrase": "usable_mechanisms"}, {"score": 0.0037188360359702182, "phrase": "field_trial"}, {"score": 0.003531474887552889, "phrase": "semantic_similarity"}, {"score": 0.003353521531649663, "phrase": "available_applications"}, {"score": 0.003296212583539166, "phrase": "public_interactive_display"}, {"score": 0.0031845067058084583, "phrase": "developer-provided_descriptions"}, {"score": 0.0028715299874549245, "phrase": "self-reported_usability_measures"}, {"score": 0.002822434555587263, "phrase": "practitioners'_existing_grouping"}, {"score": 0.002321234686549485, "phrase": "multipurpose_interactive_display"}, {"score": 0.0021539955106204354, "phrase": "public_displays"}], "paper_keywords": [""], "paper_abstract": "Transitioning from bespoke single-purpose displays to multipurpose public interactive displays entails a number of challenges. One challenge is the development of usable mechanisms that allow users to explore the functionality and services on such displays. This article presents a field trial that employs AutoCardSorter, a tool that uses semantic similarity and clustering algorithms, to automatically group the available applications of a public interactive display into categories based on the developer-provided descriptions of each application. The results demonstrate that the grouping generated by AutoCardSorter improved both performance and self-reported usability measures compared to practitioners' existing grouping. In addition, the study investigated the interplay between grouping and interaction modality (i.e., public display vs. desktop). Results tend to support that grouping affects more the user experience with a multipurpose interactive display, but findings were insignificant. This work provides a way for public displays to dynamically update their offered services without sacrificing usability.", "paper_title": "Multipurpose Public Displays: Can Automated Grouping of Applications and Services Enhance User Experience?", "paper_id": "WOS:000330756700005"}