{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "present_study"}, {"score": 0.0486868426803837, "phrase": "binding_modes"}, {"score": 0.03303103209185277, "phrase": "docking-based_alignment"}, {"score": 0.00441883624011048, "phrase": "related_amide"}, {"score": 0.004244495734923587, "phrase": "homology_models"}, {"score": 0.004087963788286157, "phrase": "x-ray_crystal_structure"}, {"score": 0.0037213333316218522, "phrase": "foamy_virus_structure"}, {"score": 0.0036717033873979125, "phrase": "inhibitor-in_binding"}, {"score": 0.003603327452846714, "phrase": "structural_requirement"}, {"score": 0.0035552656899783793, "phrase": "three-dimensional_quantitative_structure_activity_relationship"}, {"score": 0.0032449610741097992, "phrase": "first_part"}, {"score": 0.0031845067058084583, "phrase": "atom-fit_alignments"}, {"score": 0.0027991418754844347, "phrase": "initial_analysis"}, {"score": 0.002610198789888055, "phrase": "statistical_significance"}, {"score": 0.0025137856138000014, "phrase": "expanded_data_set"}, {"score": 0.0023189818169615135, "phrase": "good_predictive_performance"}, {"score": 0.0023003498123420237, "phrase": "external_validation_test"}, {"score": 0.0021798963627236915, "phrase": "biological_relevance"}, {"score": 0.002116351238579227, "phrase": "new_predictive_tools"}, {"score": 0.0021049977753042253, "phrase": "structure-based_design"}], "paper_keywords": [""], "paper_abstract": "In the present study, we report the exploration of binding modes of potent HIV-1 integrase (IN) inhibitors MK-0518 (raltegravir) and GS-9137 (elvitegravir) as well as chalcone and related amide IN inhibitors we recently synthesized and the development of 3D-QSAR models for integrase inhibition. Homology models of DNA-bound HIV-1 IN were constructed on the basis of the X-ray crystal structure of the foamy virus IN-DNA complex (PDB ID: 3L2T) and used for docking: The binding modes of raltegravir and elvitegravir in our homology models are in accordance with those in the foamy virus structure revealing interactions important for inhibitor-IN binding. To gain further insights into the structural requirement; for IN inhibition, three-dimensional quantitative structure activity relationship (3D-QSAR) studies were conducted using raltegravir, elvitegravir, and their analogs; our synthesized 3-keto salicylic acid IN inhibitor series; as well as other structurally related HIV-1 IN inhibitors. In the first part of the study with 103 compounds, atom-fit alignments, I and II, and docking-based alignment, III, were used to develop 3D-QSAR models 1, 2, and 3, respectively, each comprising comparative molecular field analysis (CoMFA) and comparative molecular similarity indices analysis (CoMSIA) 3D-QSARs. This initial analysis indicated that the docking-based (structure-based) model 3 performed better than the atom-fit (ligand-based) models 1 and 2, in terms of statistical significance and robustness. Thus, the docking-based alignment was then subsequently used with an expanded data set of 296 compounds for building a more comprehensive 3D-QSAR, model 4. Model 4 afforded good q(2) values of 0.70 and 0.75 for CoMFA and CoMSIA 3D-QSARs, respectively, and showed good predictive performance on an external validation test set of 9 compounds with predictive r(2) values up to 0.71. The HIV IN-DNA homology model of biological relevance and the comprehensive 3D-QSAR models developed in the present study provide insights and new predictive tools for structure-based design, and optimization of IN inhibitors.", "paper_title": "Homology Model-Guided 3D-QSAR Studies of HIV-1 Integrase Inhibitors", "paper_id": "WOS:000300650400026"}