{"auto_keywords": [{"score": 0.03602807175061379, "phrase": "iloc_attack"}, {"score": 0.011345051836055662, "phrase": "itm_systems"}, {"score": 0.006480940006263562, "phrase": "itm_system"}, {"score": 0.00481495049065317, "phrase": "internet_threat_monitors"}, {"score": 0.004796373368272829, "phrase": "targeted_networks"}, {"score": 0.004642292792558686, "phrase": "widespread_attacks"}, {"score": 0.004085115444878828, "phrase": "monitor_locations"}, {"score": 0.003832031470970347, "phrase": "uncovered_ip_address_space"}, {"score": 0.0036275736378775757, "phrase": "new_class"}, {"score": 0.0031627430133087616, "phrase": "low-rate_port-scan_traffic"}, {"score": 0.003091262582401731, "phrase": "selected_pseudonoise_code"}, {"score": 0.002926212333939311, "phrase": "secret_pn-code"}, {"score": 0.0025862736445290088, "phrase": "report_data"}, {"score": 0.002539379289856756, "phrase": "data_center"}, {"score": 0.0023927516438886445, "phrase": "attack_effectiveness"}, {"score": 0.0022962183207691188, "phrase": "performance_evaluation"}, {"score": 0.0022649119108225564, "phrase": "real-world_itm_system"}, {"score": 0.0021537217025910356, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "real-world_traces"}], "paper_keywords": ["Internet threat monitoring systems", " invisible localization attack", " PN-code", " security"], "paper_abstract": "Internet threat monitoring (ITM) systems have been deployed to detect widespread attacks on the Internet in recent years. However, the effectiveness of ITM systems critically depends on the confidentiality of the location of their monitors. If adversaries learn the monitor locations of an ITM system, they can bypass the monitors and focus on the uncovered IP address space without being detected. In this paper, we study a new class of attacks, the invisible LOCalization (iLOC) attack. The iLOC attack can accurately and invisibly localize monitors of ITM systems. In the iLOC attack, the attacker launches low-rate port-scan traffic, encoded with a selected pseudonoise code (PN-code), to targeted networks. While the secret PN-code is invisible to others, the attacker can accurately determine the existence of monitors in the targeted networks based on whether the PN-code is embedded in the report data queried from the data center of the ITM system. We formally analyze the impact of various parameters on attack effectiveness. We implement the iLOC attack and conduct the performance evaluation on a real-world ITM system to demonstrate the possibility of such attacks. We also conduct extensive simulations on the iLOC attack using real-world traces. Our data show that the iLOC attack can accurately identify monitors while being invisible to ITM systems. Finally, we present a set of guidelines to counteract the iLOC attack.", "paper_title": "An Invisible Localization Attack to Internet Threat Monitors", "paper_id": "WOS:000270095700005"}