{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "integer_points"}, {"score": 0.00996464960413273, "phrase": "input_size"}, {"score": 0.009782287458967002, "phrase": "fixed_dimensions"}, {"score": 0.004770461993586338, "phrase": "parametric_polytopes"}, {"score": 0.004726382602809228, "phrase": "barvinok's_rational_functions"}, {"score": 0.004228016636379321, "phrase": "linear_constraints"}, {"score": 0.003678023470672862, "phrase": "explicit_function"}, {"score": 0.0034303736977646135, "phrase": "parameter_space"}, {"score": 0.0031113369425402287, "phrase": "single_quasi-polynomial"}, {"score": 0.002942495422585405, "phrase": "worst-case_size"}, {"score": 0.0024658019116387845, "phrase": "novel_method"}, {"score": 0.002420339995088838, "phrase": "required_quasi-polynomials"}, {"score": 0.0023537101705489957, "phrase": "existing_method"}, {"score": 0.0023103100997344072, "phrase": "barvinok's_decomposition"}, {"score": 0.0022052711621931144, "phrase": "non-parametric_polytope"}, {"score": 0.0021049977753042253, "phrase": "polynomially-sized_enumerators"}], "paper_keywords": ["Barvinok's decomposition", " compiler analysis", " Ehrhart quasi-polynomial", " parametric polytope", " polyhedral model", " vector partition function", " signed unimodular decomposition"], "paper_abstract": "Many compiler optimization techniques depend on the ability to calculate the number of elements that satisfy certain conditions. If these conditions can be represented by linear constraints, then such problems are equivalent to counting the number of integer points in (possibly) parametric polytopes. It is well known that the enumerator of such a set can be represented by an explicit function consisting of a set of quasi-polynomials, each associated with a chamber in the parameter space. Previously, interpolation was used to obtain these quasi-polynomials, but this technique has several disadvantages. Its worst-case computation time for a single quasi-polynomial is exponential in the input size, even for fixed dimensions. The worst-case size of such a quasi-polynomial (measured in bits needed to represent the quasi-polynomial) is also exponential in the input size. Under certain conditions this technique even fails to produce a solution. Our main contribution is a novel method for calculating the required quasi-polynomials analytically. It extends an existing method, based on Barvinok's decomposition, for counting the number of integer points in a non-parametric polytope. Our technique always produces a solution and computes polynomially-sized enumerators in polynomial time (for fixed dimensions).", "paper_title": "Counting integer points in parametric polytopes using Barvinok's rational functions", "paper_id": "WOS:000246152800003"}