{"auto_keywords": [{"score": 0.04136818576092414, "phrase": "concurrent_computation"}, {"score": 0.040982617279480285, "phrase": "coerced_coordination"}, {"score": 0.03731166778906187, "phrase": "coordination_constraints"}, {"score": 0.00481495049065317, "phrase": "coordination_model"}, {"score": 0.004476399615305783, "phrase": "pervasive_open_distributed"}, {"score": 0.004041879818641576, "phrase": "pervasive_ode_system"}, {"score": 0.003631671435460452, "phrase": "system's_qos_requirements"}, {"score": 0.003376037544631762, "phrase": "message_manipulations"}, {"score": 0.002917331114260319, "phrase": "coordinated_behaviors"}, {"score": 0.0028333356794133053, "phrase": "multiple_actors"}, {"score": 0.002778682854371595, "phrase": "local_coordination_responsibilities"}, {"score": 0.002659527314613792, "phrase": "role's_behavior_abstraction"}, {"score": 0.0026209522797963447, "phrase": "syntactic_dependencies"}, {"score": 0.0024842242921857705, "phrase": "coordinator_layer"}, {"score": 0.002424450174817922, "phrase": "underlying_actors"}, {"score": 0.002389276641014013, "phrase": "ode_systems"}, {"score": 0.0022756672722130424, "phrase": "coordinator_behaviors"}, {"score": 0.0022101055924375725, "phrase": "actor_computation_model"}, {"score": 0.0021780349459687622, "phrase": "proposed_coerced_coordination_model"}, {"score": 0.0021049977753042253, "phrase": "arc_system"}], "paper_keywords": [""], "paper_abstract": "This paper presents a coordination model, the Actor, Role and Coordinator (ARC) model, to address three main concerns inherent in a pervasive Open Distributed and Embedded (ODE) system: dynamicity, scalability, and stringent QoS requirements. The model treats a pervasive ODE system as a composition of concurrent computation and coerced coordination. In particular, concurrent computation is modeled as Actors, while coerced coordination specifies the system's QoS requirements by mapping them to coordination constraints. The coordination constraints are transparently imposed on actors through message manipulations, which are carried out by the roles and coordinators. The coordinators are responsible for the coordination among roles, while the roles in our model provide abstractions for coordinated behaviors that may be shared by multiple actors and further assume local coordination responsibilities for the actors playing the roles. The role's behavior abstraction decouples the syntactic dependencies between the coordinators and the actors, thus shielding the coordinator layer from the dynamicity of underlying actors inherent in ODE systems. This paper also formally defines the role and coordinator behaviors and the composition of the actor computation model with the proposed coerced coordination model. Our formal study has shown that the ARC system is closed under composition and recursion.", "paper_title": "Actors, roles and coordinators - A coordination model for open distributed and embedded systems", "paper_id": "WOS:000239479100016"}