{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "concurrent_systems"}, {"score": 0.006611541765112357, "phrase": "concurrent_system"}, {"score": 0.004772137871562584, "phrase": "substantial_research_efforts"}, {"score": 0.004365646162342994, "phrase": "representative_untanglings"}, {"score": 0.004306205029641728, "phrase": "well-known_state_space_explosion_problem"}, {"score": 0.0037658881407605445, "phrase": "analysis_time"}, {"score": 0.0035216195857272403, "phrase": "behavioral_characteristics"}, {"score": 0.003107117564014497, "phrase": "particular_representation"}, {"score": 0.002905454531687249, "phrase": "representative_untangling"}, {"score": 0.0028667159745494933, "phrase": "bounded_concurrent_system"}, {"score": 0.0026806139086152365, "phrase": "unique_balance"}, {"score": 0.002574788013427524, "phrase": "single_model"}, {"score": 0.0025404470150468387, "phrase": "convenient_extraction"}, {"score": 0.0024953686545818587, "phrase": "performance_measurements"}, {"score": 0.002451088210833819, "phrase": "construction_time"}, {"score": 0.002354302193867031, "phrase": "original_specifications"}, {"score": 0.0021049977753042253, "phrase": "practical_benefits"}], "paper_keywords": ["Concurrency", " Concurrent systems", " Analysis", " Untanglings", " Representative untanglings"], "paper_abstract": "Substantial research efforts have been expended to deal with the complexity of concurrent systems that is inherent to their analysis, e.g., works that tackle the well-known state space explosion problem. Approaches differ in the classes of properties that they are able to suitably check and this is largely a result of the way they balance the trade-off between analysis time and space employed to describe a concurrent system. One interesting class of properties is concerned with behavioral characteristics. These properties are conveniently expressed in terms of computations, or runs, in concurrent systems. This article introduces the theory of untanglings that exploits a particular representation of a collection of runs in a concurrent system. It is shown that a representative untangling of a bounded concurrent system can be constructed that captures all and only the behavior of the system. Representative untanglings strike a unique balance between time and space, yet provide a single model for the convenient extraction of various behavioral properties. Performance measurements in terms of construction time and size of representative untanglings with respect to the original specifications of concurrent systems, conducted on a collection of models from practice, confirm the scalability of the approach. Finally, this article demonstrates practical benefits of using representative untanglings when checking various behavioral properties of concurrent systems.", "paper_title": "Untanglings: a novel approach to analyzing concurrent systems", "paper_id": "WOS:000365426000002"}