{"auto_keywords": [{"score": 0.004650896226390719, "phrase": "user-artifact_relationships"}, {"score": 0.0045709675813472884, "phrase": "information_systems"}, {"score": 0.0044536312768349, "phrase": "information_technology"}, {"score": 0.004402448972861048, "phrase": "ample_research_attention"}, {"score": 0.004339293854115301, "phrase": "recent_adoption_research"}, {"score": 0.004240116703465252, "phrase": "relational_and_experiential_aspects"}, {"score": 0.003955926499405168, "phrase": "traditional_models"}, {"score": 0.003933123176680365, "phrase": "tam"}, {"score": 0.003910444970945073, "phrase": "tpb"}, {"score": 0.0038431888954930083, "phrase": "utilitarian_benefits"}, {"score": 0.0037228709592978556, "phrase": "recent_research"}, {"score": 0.0036907133026806327, "phrase": "much-needed_attention"}, {"score": 0.0034933782525914682, "phrase": "theoretical_model"}, {"score": 0.0033547343924455486, "phrase": "social_interactions"}, {"score": 0.003240270399284566, "phrase": "social_actors"}, {"score": 0.0031296996688485617, "phrase": "proposed_interaction-centric_model"}, {"score": 0.003022890602492506, "phrase": "user's_internal_system"}, {"score": 0.0029794666460666646, "phrase": "users'_choices"}, {"score": 0.0028119023819663472, "phrase": "beliefs_users"}, {"score": 0.0024972048358485, "phrase": "single_interaction"}, {"score": 0.0023295585212850154, "phrase": "user-artifact_interactions"}, {"score": 0.0022630645070078554, "phrase": "future_ones"}, {"score": 0.0021731423856364003, "phrase": "subsequent_interaction"}, {"score": 0.002135704168014609, "phrase": "relationship_development"}, {"score": 0.0021049977753042253, "phrase": "already_held_beliefs"}], "paper_keywords": ["Electronic Commerce", " IT Adoption Models", " Online Relationships", " IT Airfacts"], "paper_abstract": "Journal the Association for Information Systems The question of why a user adopts an information technology (IT) artifact has received ample research attention in the past few decades. Although recent adoption research has focused on investigating some of the relational and experiential aspects associated with adopting and using IT artifacts, the theories utilized have been static in nature. Furthermore, many have been based on traditional models like TAM and TPB, which focus on the utilitarian benefits that users accrue from their interactions with IT artifacts. Independently, recent research has paid much-needed attention to factors surrounding the use of IT artifacts. In this paper, we offer an overview of a theoretical model that connects these two interrelated processes. Starting with a survey of concepts related to social interactions, we present an argument in support of viewing IT artifacts as social actors, whose characteristics are manifested within the context of interactions. The proposed interaction-centric model highlights how the characteristics of an IT artifact, together with the user's internal system and other structuring factors, affect users' choices in terms of how to utilize the artifact. The nature of that utilization, subsequently, affects the beliefs users form about the artifact and the outcomes from using it. Furthermore, the model proposes that users will also form beliefs about their bond or relationship with the IT artifact. These beliefs do not refer to observations made in a single interaction, but rather concern users' mental representations of past interactions and outcomes. To facilitate the study of the relationship that develops from user-artifact interactions over time, the model describes how past interactions affect future ones. Specifically, it proposes that deciding how to utilize an IT artifact in subsequent interaction, consistent with theories of relationship development, is influenced by already held beliefs about the artifact and the relationship with it.", "paper_title": "The Adoption and Use of IT Artifacts: A New Interaction-Centric Model for the Study of User-Artifact Relationships", "paper_id": "WOS:000273383400001"}