{"auto_keywords": [{"score": 0.04547624598453918, "phrase": "ios"}, {"score": 0.006714830144853964, "phrase": "asymmetric_characteristics"}, {"score": 0.00481495049065317, "phrase": "ideal_data_synchronization"}, {"score": 0.004776297980616768, "phrase": "hybrid_forms_of_interconnections"}, {"score": 0.0045324756541157574, "phrase": "new_technologies"}, {"score": 0.004388631450145507, "phrase": "hybrid_interorganizational_information_systems"}, {"score": 0.004232232993872917, "phrase": "new_analytical_framework"}, {"score": 0.0039677715255034595, "phrase": "connected_firms"}, {"score": 0.003810909603178837, "phrase": "internal_databases"}, {"score": 0.003780286517897356, "phrase": "data_synchronization"}, {"score": 0.0029913511336659327, "phrase": "field_study"}, {"score": 0.002607598760956807, "phrase": "different_forms"}, {"score": 0.0025866199378466754, "phrase": "ios._interconnections"}, {"score": 0.002263799931018574, "phrase": "hybrid_forms"}, {"score": 0.0022095803687183107, "phrase": "extreme_forms"}, {"score": 0.0021049977753042253, "phrase": "symmetric_characteristics"}], "paper_keywords": ["Interorganizational Information Systems", " Analytical Framework", " Sending Systems", " Receiving Systems", " Interconnections", " Structural Linkages", " Shared Data", " Message Interdependencies", " Product Information Management"], "paper_abstract": "With the emergence of new technologies, companies can organize their electronic data exchanges by implementing hybrid interorganizational information systems (IOS). This paper presents a new analytical framework by considering IOS as the product of interconnections between the parts of IS developed by connected firms to support a given interorganizational process. We focus on updating internal databases through data synchronization between a set of suppliers and a set of clients. From the literature, we built types of sending and receiving systems based on three variables; namely, shared data, structural linkages, and message interdependency. Analytically, we derived possibilities of interconnections between these sending and receiving systems with asymmetric characteristics. In a field study, we empirically investigated IOS built to support product information flows from suppliers' to retailers' internal, databases by considering how suppliers built their sending systems, how retailers built their receiving systems, and how their interconnections led to different forms of IOS. Interconnections occurring between systems with asymmetric characteristics show the existence of several hybrid forms of IOS, both in design and use. We finally explain that, even if companies can benefit from their use, hybrid forms are less efficient than are extreme forms, those that are the result of interconnections between systems with symmetric characteristics.", "paper_title": "From Ideal Data Synchronization to Hybrid Forms of Interconnections: Architectures, Processes, and Data", "paper_id": "WOS:000327545500001"}