{"auto_keywords": [{"score": 0.03886924150595011, "phrase": "ancient_vertebrate_genomes"}, {"score": 0.031782944881882304, "phrase": "amniote_ancestral_genome"}, {"score": 0.00481495049065317, "phrase": "ancestral_amniote_genome"}, {"score": 0.004396790930873782, "phrase": "differentiated_evolution"}, {"score": 0.00403221710768334, "phrase": "molecular_evolution"}, {"score": 0.003962998498942111, "phrase": "mammals_lineages"}, {"score": 0.0037299231609021783, "phrase": "ancestral_genomic_features"}, {"score": 0.0036029221645629225, "phrase": "contiguous_segments"}, {"score": 0.0035410467987580484, "phrase": "double_syntenies"}, {"score": 0.003450213580299164, "phrase": "whole_genome_duplication"}, {"score": 0.0030428787018636147, "phrase": "high-resolution_genome_organization"}, {"score": 0.0026259694526633037, "phrase": "support_value"}, {"score": 0.0024606422183102382, "phrase": "maximum_support"}, {"score": 0.0024183363693242943, "phrase": "single_methodological_principle"}, {"score": 0.0021604924928015283, "phrase": "computational_paleogenomics_pipeline"}, {"score": 0.0021049977753042253, "phrase": "solid_methodological_base"}], "paper_keywords": [""], "paper_abstract": "Motivation: The ancestor of birds and mammals lived approximately 300 million years ago. Inferring its genome organization is key to understanding the differentiated evolution of these two lineages. However, detecting traces of its chromosomal organization in its extant descendants is difficult due to the accumulation of molecular evolution since birds and mammals lineages diverged. Results: We address several methodological issues for the detection and assembly of ancestral genomic features of ancient vertebrate genomes, which encompass adjacencies, contiguous segments, syntenies and double syntenies in the context of a whole genome duplication. Using generic, but stringent, methods for all these problems, some of them new, we analyze 15 vertebrate genomes, including 12 amniotes and 3 teleost fishes, and infer a high-resolution genome organization of the amniote ancestral genome, composed of 39 ancestral linkage groups at a resolution of 100 kb. We extensively discuss the validity and robustness of the method to variations of data and parameters. We introduce a support value for each of the groups, and show that 36 out of 39 have maximum support. Conclusions: Single methodological principle cannot currently be used to infer the organization of the amniote ancestral genome, and we demonstrate that it is possible to gather several principles into a computational paleogenomics pipeline. This strategy offers a solid methodological base for the reconstruction of ancient vertebrate genomes.", "paper_title": "Reconstructing the architecture of the ancestral amniote genome", "paper_id": "WOS:000295412200007"}