{"auto_keywords": [{"score": 0.03853655602966393, "phrase": "diffusion_curves"}, {"score": 0.010612387000973441, "phrase": "smooth-shaded_images"}, {"score": 0.004448892453489832, "phrase": "diffusion_curve"}, {"score": 0.00425951071471662, "phrase": "different_colors"}, {"score": 0.003919973783578995, "phrase": "color_transition"}, {"score": 0.0036217089991592275, "phrase": "final_image"}, {"score": 0.003536720212056521, "phrase": "poisson_equation"}, {"score": 0.0033328427701162368, "phrase": "vector-based_primitives"}, {"score": 0.0031782087629067686, "phrase": "geometry-based_editing"}, {"score": 0.0031035949505887083, "phrase": "ready_stylization"}, {"score": 0.002913052619634697, "phrase": "gpu-based_implementation"}, {"score": 0.0027233675070644026, "phrase": "interactive_drawing_system"}, {"score": 0.002546002312015341, "phrase": "freehand_style"}, {"score": 0.0024960634897058394, "phrase": "existing_imagery"}, {"score": 0.0022606512324475584, "phrase": "completely_automatic_conversion_process"}, {"score": 0.0021049977753042253, "phrase": "original_image_content"}], "paper_keywords": ["vector graphics", " vectorization", " gradient mesh", " color diffusion", " image creation", " image reconstruction"], "paper_abstract": "We describe a new vector-based primitive for creating smooth-shaded images, called the diffusion curve. A diffusion curve partitions the space through which it is drawn, defining different colors on either side. These colors may vary smoothly along the curve. In addition, the sharpness of the color transition from one side of the curve to the other can be controlled. Given a set of diffusion curves, the final image is constructed by solving a Poisson equation whose constraints are specified by the set of gradients across all diffusion curves. Like all vector-based primitives, diffusion curves conveniently support a variety of operations, including geometry-based editing, keyframe animation, and ready stylization. Moreover, their representation is compact and inherently resolution-independent. We describe a GPU-based implementation for rendering images defined by a set of diffusion curves in realtime. We then demonstrate an interactive drawing system for allowing artists to create artworks using diffusion curves, either by drawing the curves in a freehand style, or by tracing existing imagery. The system is simple and intuitive: we show results created by artists after just a few minutes of instruction. Furthermore, we describe a completely automatic conversion process for taking an image and turning it into a set of diffusion curves that closely approximate the original image content.", "paper_title": "Diffusion curves: A vector representation for smooth-shaded images", "paper_id": "WOS:000258262000081"}