{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "heritage_site_regeneration"}, {"score": 0.0047797212183363835, "phrase": "heritage_sites"}, {"score": 0.0047273577269638725, "phrase": "important_part"}, {"score": 0.004473982381245469, "phrase": "important_lessons"}, {"score": 0.004007083686875716, "phrase": "hafod-morfa_copperworks"}, {"score": 0.0039053194919285725, "phrase": "lower_swansea_valley"}, {"score": 0.003297728079517964, "phrase": "finished_piece"}, {"score": 0.00327356326590461, "phrase": "curated_heritage"}, {"score": 0.0027844017803674444, "phrase": "local_community"}, {"score": 0.0026641365405034355, "phrase": "previous_uses"}, {"score": 0.0026446021865907197, "phrase": "mobile_guides"}, {"score": 0.0025868521085189843, "phrase": "tourist_aids"}, {"score": 0.0023249757987087055, "phrase": "performative_technologies"}, {"score": 0.002175913488493802, "phrase": "expressive_performative_technologies"}, {"score": 0.002136226584784576, "phrase": "spectators'_attention"}, {"score": 0.0021049977753042253, "phrase": "active_engagement"}], "paper_keywords": ["Performance", " Heritage", " Regeneration", " Pico projection", " Situated audio"], "paper_abstract": "Heritage sites are an important part of understanding our role in history. They have the potential to teach us important lessons, such as where we came from and subsequently, the people it has made us today. As members of a large, heritage-led, regeneration project, we are working with the Hafod-Morfa Copperworks, a heritage site in the Lower Swansea Valley where there is not much to see or hear. The few ruins at the site make it difficult to imagine what the site would have been like back in its heyday. Our goal at the site is to draw people together, not to view a finished piece of curated heritage, but rather, to start conversations about their memories and the significance of the site to them and to discover what they would like to see at the site in the future. The technology we are producing is about engaging with the local community and stakeholders as groups to provoke discussion. This contrasts with previous uses of mobile guides which only attempt to be tourist aids. In this article, we report on two prototype technologies we have developed to help accomplish this task. Throughout the article, we discuss how and why designing performative technologies could help encourage people to visit, socialise and communicate within the area. Our early results suggest that expressive performative technologies are good at gaining spectators' attention and encouraging an active engagement between performer and spectator.", "paper_title": "Performative technologies for heritage site regeneration", "paper_id": "WOS:000342454500007"}