{"auto_keywords": [{"score": 0.04476152971906731, "phrase": "dv-hop"}, {"score": 0.01126859663075822, "phrase": "dv-hop_algorithm"}, {"score": 0.00481495049065317, "phrase": "dv-loc"}, {"score": 0.004663396040465122, "phrase": "using_voronoi_diagrams_for_wireless_sensor_networks._localization_systems"}, {"score": 0.004327981760540394, "phrase": "wireless_ssensor_networks"}, {"score": 0.003767517649628532, "phrase": "beacon_nodes"}, {"score": 0.0036100762867678415, "phrase": "computed_average_size"}, {"score": 0.0031255543155487234, "phrase": "small_or_medium-sized_sensor_networks"}, {"score": 0.0029789104204803137, "phrase": "challenging_problem"}, {"score": 0.0027791193706247267, "phrase": "novel_localization-based_protocol"}, {"score": 0.002720376476146181, "phrase": "voronoi_diagrams"}, {"score": 0.002220551141101661, "phrase": "extensive_set"}, {"score": 0.002196944917134202, "phrase": "simulation_experiments"}], "paper_keywords": [""], "paper_abstract": "Localization systems have been identified as a key issue in the development and operation of wireless ssensor networks. DV-Hop, a well-known localization algorithm, has recently been proposed for WSNs. Its basic idea relies on transforming the distance to all beacon nodes from hops to meters by using the computed average size of a hop. Despite its advantages, the DV-Hop algorithm has some limitations, mainly due to its high communication cost and energy consumption, which unfortunately limit its applicability to small or medium-sized sensor networks. The scalability issue of DV-Hop is a challenging problem that needs to be addressed. In this article we propose a novel localization-based protocol and show how Voronoi diagrams can be used efficiently to scale a DV-Hop algorithm while maintaining and/or reducing further DV-Hop's localization error. In our localization scheme, nodes can also be localized by their Voronoi cells. In order to evaluate the performance Of Our scheme, we present an extensive set of simulation experiments using ns-2. Our results clearly indicate that our proposed algorithm performs and scales better than DV-Hop.", "paper_title": "DV-LOC: A SCALABLE LOCALIZATION PROTOCOL USING VORONOI DIAGRAMS FOR WIRELESS SENSOR NETWORKS", "paper_id": "WOS:000265487000008"}