{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "viewpoints_framework"}, {"score": 0.040484668400291746, "phrase": "different_viewpoints"}, {"score": 0.035903313117901146, "phrase": "global_priority_levels"}, {"score": 0.004703075081891693, "phrase": "effective_inconsistency_management"}, {"score": 0.004671588539217021, "phrase": "software_development"}, {"score": 0.004624751696958501, "phrase": "complete_measurement"}, {"score": 0.0037549546301384336, "phrase": "individual_set"}, {"score": 0.0034638476252104706, "phrase": "combined_requirements_collection"}, {"score": 0.003260377175139591, "phrase": "global_priority_level"}, {"score": 0.003227643104496149, "phrase": "individual_requirement"}, {"score": 0.003195236629209403, "phrase": "relative_importance"}, {"score": 0.003079163348079199, "phrase": "local_priority_level"}, {"score": 0.002888488567436329, "phrase": "combined_collection"}, {"score": 0.0027463101082160915, "phrase": "scoring_matrix_function"}, {"score": 0.002664375650349975, "phrase": "inconsistent_combined_requirements_collection"}, {"score": 0.002558909812664716, "phrase": "requirements_collection"}, {"score": 0.00243291444168046, "phrase": "ordering_relationship"}, {"score": 0.0022290085428279846, "phrase": "prototype_tool"}, {"score": 0.002214048743052355, "phrase": "incmeasurer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Requirements", " Measure of inconsistency", " Significance of inconsistency", " Viewpoints"], "paper_abstract": "Measuring inconsistency is crucial to effective inconsistency management in software development. A complete measurement of inconsistency should focus on not only the degree but also the significance of inconsistency. However, most of the approaches available only take the degree of inconsistency into account. The significance of inconsistency has not yet been given much needed consideration. This paper presents an approach for measuring the significance of inconsistency arising from different viewpoints in the Viewpoints framework. We call an individual set of requirements belonging to different viewpoints a combined requirements collection in this paper. We argue that the significance of inconsistency arising in a combined requirements collection is closely associated with global priority levels of requirements involved in the inconsistency. Here we assume that the global priority level of an individual requirement captures the relative importance of every viewpoint including this requirement as well as the local priority level of the requirement within the viewpoint. Then we use the synthesis of global priority levels of all the requirements in a combined collection to measure the significance of the collection. Following this, we present a scoring matrix function to measure the significance of inconsistency in an inconsistent combined requirements collection, which describes the contribution made by each subset of the requirements collection to the significance of the set of requirements involved in the inconsistency. An ordering relationship between inconsistencies of two combined requirements collections, termed more significant than, is also presented by comparing their significance scoring matrix functions. Finally, these techniques were implemented in a prototype tool called IncMeasurer, which we developed as a proof of concept. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Measuring the significance of inconsistency in the Viewpoints framework", "paper_id": "WOS:000321536100019"}