{"auto_keywords": [{"score": 0.021627937702213395, "phrase": "users'_disorientation_problems"}, {"score": 0.010612387000973441, "phrase": "multiple-strategy_evolutionary_neural_fuzzy_network"}, {"score": 0.004417012437860011, "phrase": "web-based_systems"}, {"score": 0.004317848984770719, "phrase": "important_issue"}, {"score": 0.003925004567341077, "phrase": "users'_characteristics"}, {"score": 0.003600351201298387, "phrase": "important_factors"}, {"score": 0.003287482882222731, "phrase": "automatic_architecture"}, {"score": 0.002947611960613497, "phrase": "efficiency_way"}, {"score": 0.0027282915297520624, "phrase": "users'_experience"}, {"score": 0.0026307897899760383, "phrase": "navigation_tools"}, {"score": 0.0026069623057065664, "phrase": "different_levels"}, {"score": 0.0025833500717948343, "phrase": "prior_knowledge"}, {"score": 0.002559951153813876, "phrase": "influential_factors"}, {"score": 0.002423931101340771, "phrase": "proposed_architecture"}, {"score": 0.0021049977753042253, "phrase": "personalized_web-based_systems"}], "paper_keywords": ["Fuzzy model", " control", " group-based symbiotic evolution", " FP-growth", " identification"], "paper_abstract": "For solving users' disorientation problems when using Web-based systems, there is an important issue to understand why they cause such problems. To this end, there is a need to investigate the relationship between users' characteristics and their disorientation problems. However, when facing this challenge, it is difficult to identify which users' characteristics may play important factors or how their characteristics interact with each other to influence their disorientation problems. Thus, this paper tends to propose an automatic architecture for solving this issue. More specifically, this study proposes a multiple-strategy evolutionary neural fuzzy network (MSE-NFN) to not only provides an efficiency way to automatically identify users' disorientation problems but also investigate which users' characteristics greatly influence their disorientation problems. The results indicate that users' experience of using Internet, experience of using navigation tools and different levels of prior knowledge are influential factors to affect their disorientation problems. Moreover, it also demonstrates that the proposed architecture (MSE-NFN) outperform than other existing evolutionary methods. Based on the results, a framework is conducted, which can be used to automatically identify users' disorientation problems when developing the personalized Web-based systems.", "paper_title": "Using multiple-strategy evolutionary neural fuzzy network to automatically identify disorientation problems: A Web-based system application", "paper_id": "WOS:000318157000013"}