{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_database"}, {"score": 0.004285289574869884, "phrase": "multiple_distortions"}, {"score": 0.003978866233891427, "phrase": "real_photographic_images"}, {"score": 0.003916098498242888, "phrase": "different_digital_cameras"}, {"score": 0.0037935066882208235, "phrase": "six_image_sets"}, {"score": 0.003597625122515975, "phrase": "eight_different_scenes"}, {"score": 0.003287482882222731, "phrase": "subjective_evaluation_method"}, {"score": 0.0032355864829403413, "phrase": "hybrid_absolute_category_rating-pair_comparison"}, {"score": 0.002833689453299307, "phrase": "test_images"}, {"score": 0.0026447893350441502, "phrase": "opinion_score_value"}, {"score": 0.0024423826953133844, "phrase": "color_saturation"}, {"score": 0.002279508335630797, "phrase": "full_subjective_data"}, {"score": 0.002255431275670053, "phrase": "extensive_background_information"}, {"score": 0.0021049977753042253, "phrase": "research_community"}], "paper_keywords": ["No-reference image quality assessment algorithms", " subjective image quality evaluation", " test image databases"], "paper_abstract": "This paper presents a new database, CID2013, to address the issue of using no-reference (NR) image quality assessment algorithms on images with multiple distortions. Current NR algorithms struggle to handle images with many concurrent distortion types, such as real photographic images captured by different digital cameras. The database consists of six image sets; on average, 30 subjects have evaluated 12-14 devices depicting eight different scenes for a total of 79 different cameras, 480 images, and 188 subjects (67% female). The subjective evaluation method was a hybrid absolute category rating-pair comparison developed for the study and presented in this paper. This method utilizes a slideshow of all images within a scene to allow the test images to work as references to each other. In addition to mean opinion score value, the images are also rated using sharpness, graininess, lightness, and color saturation scales. The CID2013 database contains images used in the experiments with the full subjective data plus extensive background information from the subjects. The database is made freely available for the research community.", "paper_title": "CID2013: A Database for Evaluating No-Reference Image Quality Assessment Algorithms", "paper_id": "WOS:000347096100004"}