{"auto_keywords": [{"score": 0.04962396550254858, "phrase": "mission-driven_camera_sensor_networks"}, {"score": 0.04872654495804916, "phrase": "camera_sensor_network"}, {"score": 0.00481495049065317, "phrase": "coverage_problem"}, {"score": 0.004612376827433774, "phrase": "huge_amount"}, {"score": 0.004482063543727601, "phrase": "growing_popularity"}, {"score": 0.004439445472040688, "phrase": "multimedia_applications"}, {"score": 0.004313996835376177, "phrase": "new_scheduling_problem"}, {"score": 0.003809932244103758, "phrase": "desperate_situation"}, {"score": 0.0031018195951638882, "phrase": "mission_period"}, {"score": 0.002791932344920906, "phrase": "time_period"}, {"score": 0.0026235360404084137, "phrase": "desperate_coverage_problem"}, {"score": 0.002488985155689794, "phrase": "new_heuristic_algorithm"}, {"score": 0.0024534993283766332, "phrase": "np-hard_problem"}, {"score": 0.0023613185213421173, "phrase": "proposed_algorithm"}, {"score": 0.002145703330831668, "phrase": "upper_bound"}, {"score": 0.0021049977753042253, "phrase": "existing_alternative"}], "paper_keywords": [""], "paper_abstract": "Recently, camera sensor network is attracting huge amount of attention due to the growing popularity of multimedia applications. This paper investigates a new scheduling problem in camera sensor network whose goal is to cover a set of targets as efficiently as possible during a given mission period. In particular, we consider a desperate situation in which we may not have enough camera sensors to cover all of the targets of interest during the mission. The goal of our problem of interest is to schedule the sensors such that (a) the number of the most important targets which are fully covered during the mission period is maximized, and (b) the overall target-temporal coverage which is defined as the gross sum of the weight of each target multiplied by the time period when the target is covered is maximized. We formally introduce the desperate coverage problem in mission-driven camera sensor networks (DCP-MCSN) and propose a new heuristic algorithm for this NP-hard problem. To evaluate the performance of the proposed algorithm, we compare it with a theoretical upper bound. Our simulation result shows that our algorithm performs very close to the upper bound and outperforms the existing alternative.", "paper_title": "Desperate Coverage Problem in Mission-Driven Camera Sensor Networks", "paper_id": "WOS:000335299200001"}