{"auto_keywords": [{"score": 0.04648527967633243, "phrase": "modelling_process"}, {"score": 0.00481495049065317, "phrase": "environmental_modelling_process_-_a_framework"}, {"score": 0.004358903464536199, "phrase": "broader_water_management_process"}, {"score": 0.004228839109569368, "phrase": "different_stages"}, {"score": 0.004174287115855492, "phrase": "modelling_processes"}, {"score": 0.004138309011478741, "phrase": "brief_reviews"}, {"score": 0.0033909518548844047, "phrase": "monte_carlo"}, {"score": 0.003289675052964781, "phrase": "nusap"}, {"score": 0.0026835045963349647, "phrase": "uncertainty_assessment"}, {"score": 0.0025474814283429213, "phrase": "modelling_work"}, {"score": 0.002449997042686432, "phrase": "red_thread"}, {"score": 0.0024183363693242943, "phrase": "modelling_study"}, {"score": 0.0022857899334246946, "phrase": "uncertainty_sources"}, {"score": 0.002188784900536406, "phrase": "water_manager"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["integrated water resources management", " water framework directive", " catchment modelling", " uncertainty"], "paper_abstract": "A terminology and typology of uncertainty is presented together with a framework for the modelling process, its interaction with the broader water management process and the role of uncertainty at different stages in the modelling processes. Brief reviews have been made of 14 different (partly complementary) methods commonly used in uncertainty assessment and characterisation: data uncertainty engine (DUE), error propagation equations, expert elicitation, extended peer review, inverse modelling (parameter estimation), inverse modelling (predictive uncertainty), Monte Carlo analysis, multiple model simulation, NUSAP, quality assurance, scenario analysis, sensitivity analysis, stakeholder involvement and uncertainty matrix. The applicability of these methods has been mapped according to purpose of application, stage of the modelling process and source and type of uncertainty addressed. It is concluded that uncertainty assessment is not just something to be added after the completion of the modelling work. Instead uncertainty should be seen as a red thread throughout the modelling study starting from the very beginning, where the identification and characterisation of all uncertainty sources should be performed jointly by the modeller, the water manager and the stakeholders. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Uncertainty in the environmental modelling process - A framework and guidance", "paper_id": "WOS:000248233200001"}