{"auto_keywords": [{"score": 0.04827337430415872, "phrase": "traditional_impact_test_method"}, {"score": 0.04568107674629595, "phrase": "entire_structure"}, {"score": 0.034808694084095974, "phrase": "mode_shapes"}, {"score": 0.030734237518816238, "phrase": "structural_flexibility_identification"}, {"score": 0.02960464465828457, "phrase": "proposed_method"}, {"score": 0.00429057323623293, "phrase": "mobile_impact_test_method"}, {"score": 0.004050116768809519, "phrase": "related_data_processing_strategy"}, {"score": 0.003608732492631878, "phrase": "flexibility_characteristic"}, {"score": 0.0030938932434437178, "phrase": "phase_angle_concept"}, {"score": 0.002977061391551628, "phrase": "coherent_signs"}, {"score": 0.0025195550121331367, "phrase": "single_reference"}, {"score": 0.002273605493468005, "phrase": "impact_test"}, {"score": 0.0021876814398268775, "phrase": "ideal_approach"}, {"score": 0.0021597662797996843, "phrase": "rapid_testing"}, {"score": 0.0021049977753042253, "phrase": "numerical_and_experiment_examples"}], "paper_keywords": [""], "paper_abstract": "In contrast to the traditional impact test method requiring a number of sensors to measure the entire structure, a mobile impact test method sequentially measuring segments of the structure and the related data processing strategy is proposed. Especially, only a single reference node is required when integrating measurements of the segments to identify the flexibility characteristic of the entire structure. Equations are first derived to adjust the magnitudes of mode shapes of the substructure to a same scaling level. Then the phase angle concept is utilized to determine the coherent signs of mode shapes for structural flexibility identification. The advantage of the proposed method is that it outputs the same flexibility identification results as the traditional impact test method, whereas it only requires a single reference no matter how many segments of the structure are divided, thus it significantly speeds up the impact test and makes it be an ideal approach for rapid testing of short/middle span bridges. Numerical and experiment examples investigated successfully verify the effectiveness of the proposed method for structural flexibility identification.", "paper_title": "Mobile Impact Testing for Structural Flexibility Identification with only a Single Reference", "paper_id": "WOS:000358692800003"}