{"auto_keywords": [{"score": 0.04684814051146254, "phrase": "numerical_model"}, {"score": 0.04636908096817835, "phrase": "thermal_damage"}, {"score": 0.03751951230806167, "phrase": "hyperthermic_damage"}, {"score": 0.00481495049065317, "phrase": "hyperthermia_injury"}, {"score": 0.004763565662615503, "phrase": "blood-perfused_skin"}, {"score": 0.003034158379493625, "phrase": "arrhenius'_law"}, {"score": 0.0027991418754844347, "phrase": "first_treatment"}, {"score": 0.002724909017963099, "phrase": "burned_zone"}, {"score": 0.002652639568848117, "phrase": "cool_water"}, {"score": 0.0025546627686955656, "phrase": "second_solution"}, {"score": 0.0022453451864218477, "phrase": "second_treatment"}, {"score": 0.0021049977753042253, "phrase": "interesting_prospects"}], "paper_keywords": ["thermal damage", " skin", " burn limitation", " finite element"], "paper_abstract": "The objective of this study is to propose a numerical model of thermal damage to the skin. This model simulates the propagation of a burn and suggests treatments to prevent it from spreading. In order to achieve this goal, we developed a 3D multi-layer finite element model of the skin coupled with a model presenting hyperthermic damage. The numerical model of the skin takes account of not only the thermal properties of various layers, but also blood perfusion and veins. The model of thermal damage is based on the Arrhenius' law. We tested two various quick intervention treatments so as to prevent the burn from spreading. The first treatment consists of cooling the burned zone with a flow of cool water at 10 degrees C, whereas the second solution simulates the apposition of ice on the burn. The results show that, according to the severity of the burn, the second treatment seems to be the most appropriate. Moreover, our model opens interesting prospects in the analysis of hyperthermic damage.", "paper_title": "A 3D finite element model for hyperthermia injury of blood-perfused skin", "paper_id": "WOS:000343814400002"}