{"auto_keywords": [{"score": 0.040356373997819224, "phrase": "full-text_viewing"}, {"score": 0.00481495049065317, "phrase": "virtual_environment"}, {"score": 0.004382591802405206, "phrase": "usage_data"}, {"score": 0.0043114466990006334, "phrase": "full-text_downloads"}, {"score": 0.0035278613436978933, "phrase": "e-journal_databases"}, {"score": 0.00347054319869429, "phrase": "virtual_scholar_research_programme"}, {"score": 0.00335867620389808, "phrase": "web_logs"}, {"score": 0.003290591812800382, "phrase": "electronic_journal_libraries"}, {"score": 0.0032637448078885016, "phrase": "ohiolink"}, {"score": 0.00323711628920035, "phrase": "sciencedirect"}, {"score": 0.003210704011271791, "phrase": "deep_log_analysis"}, {"score": 0.0031199418866663543, "phrase": "transactional_log_analysis"}, {"score": 0.0028161764476743257, "phrase": "full-text_articles"}, {"score": 0.0027477745788313163, "phrase": "clearer_understanding"}, {"score": 0.002573362191631126, "phrase": "main_findings"}, {"score": 0.002510843167476253, "phrase": "great_deal"}, {"score": 0.0022849068677290836, "phrase": "survey_evidence"}, {"score": 0.002157433262687853, "phrase": "first_time"}, {"score": 0.0021398115287338693, "phrase": "full-text_viewing_evidence"}], "paper_keywords": ["transactional analysis", " electronic journals", " information retrieval", " reading"], "paper_abstract": "Purpose - This article aims to focus on usage data in respect to full-text downloads of journal articles, which is considered an important usage (satisfaction) metric by librarians and publishers. The purpose is to evaluate the evidence regarding full-text viewing by pooling together data on the full-text viewing of tens of thousands of users studied as part of a number of investigations of e-journal databases conducted during the Virtual Scholar research programme. Design/methodology/approach - The paper reviews the web logs of a number of electronic journal libraries including OhioLINK and ScienceDirect using Deep Log Analysis, which is a more sophisticated form of transactional log analysis. The frequency, characteristics and diversity of full-text viewing are examined. The article also features an investigation into the time spent online viewing full-text articles in order to get a clearer understanding of the significance of full-text viewing, especially in regard to reading. Findings - The main findings are that there is a great deal of variety amongst scholars in their full-text viewing habits and that a large proportion of views are very cursory in nature, although there is survey evidence to suggest that reading goes on offline. Originality/value - This is the first time that full-text viewing evidence is studied on such a large scale.", "paper_title": "Viewing and reading behaviour in a virtual environment - The full-text download and what can be read into it", "paper_id": "WOS:000258536800001"}