{"auto_keywords": [{"score": 0.004719473826242326, "phrase": "periodic_debates"}, {"score": 0.004602773636967002, "phrase": "important_informatics_issues"}, {"score": 0.004556901872357751, "phrase": "broad_interest"}, {"score": 0.004184921610672245, "phrase": "sustainable_health_information_infrastructure"}, {"score": 0.00396050388346298, "phrase": "consumer-controlled_community_repositories"}, {"score": 0.0036921366375716005, "phrase": "stakeholder_cooperation"}, {"score": 0.003459191419478298, "phrase": "current_healthcare_environment"}, {"score": 0.003339886795391701, "phrase": "consumer_control"}, {"score": 0.003021141590548526, "phrase": "privately_each_discussant"}, {"score": 0.002902304851882577, "phrase": "complex_issue"}, {"score": 0.002830410693265704, "phrase": "debater's_tradition"}, {"score": 0.0027741761880779535, "phrase": "extreme_position"}, {"score": 0.002678433668156676, "phrase": "polarizing_aspects"}, {"score": 0.0026384167183586015, "phrase": "short_time"}, {"score": 0.0023745087648471613, "phrase": "printed_form"}, {"score": 0.002315658491366464, "phrase": "actual_debate"}, {"score": 0.00223570488212345, "phrase": "appropriate_supporting_citations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Health information exchange", " Personal health record"], "paper_abstract": "The American College of Medical Informatics (ACMI) sponsors periodic debates during the American Medical Informatics Fall Symposium to highlight important informatics issues of broad interest. In 2012, a panel debated the following topic: \"Resolved: Health Information Exchange Organizations Should Shift Their Principal Focus to Consumer-Mediated Exchange in Order to Facilitate the Rapid Development of Effective, Scalable, and Sustainable Health Information Infrastructure.\" Those supporting the proposition emphasized the need for consumer-controlled community repositories of electronic health records (health record banks) to address privacy, stakeholder cooperation, scalability, and sustainability. Those opposing the proposition emphasized that the current healthcare environment is so complex that development of consumer control will take time and that even then, consumers may not be able to mediate their information effectively. While privately each discussant recognizes that there are many sides to this complex issue, each followed the debater's tradition of taking an extreme position in order emphasize some of the polarizing aspects in the short time allotted them. In preparing this summary, we sought to convey the substance and spirit of the debate in printed form. Transcripts of the actual debate were edited for clarity, and appropriate supporting citations were added for the further edification of the reader. Published by Elsevier Inc.", "paper_title": "Consumer-mediated health information exchanges: The 2012 ACMI debate", "paper_id": "WOS:000335429200002"}