{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.006863117581299753, "phrase": "interval-valued_fuzzy_sets"}, {"score": 0.005426491118093615, "phrase": "cut_sets"}, {"score": 0.005361476442383218, "phrase": "eight_mappings"}, {"score": 0.004505881071218599, "phrase": "\"the_cut_sets"}, {"score": 0.004372002674739612, "phrase": "representation_theorems"}, {"score": 0.004191200981137508, "phrase": "x.h._yuan"}, {"score": 0.004140924670517666, "phrase": "h.x._li"}, {"score": 0.004091248980678087, "phrase": "k._b._sun"}, {"score": 0.003714629047818465, "phrase": "fuzzy_sets"}, {"score": 0.0025542617599268323, "phrase": "different_cut_sets"}, {"score": 0.0022633993976138387, "phrase": "corresponding_conclusions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intuitionistic fuzzy set", " Interval-valued fuzzy set", " Cut set", " Decomposition theorem", " Representation theorem"], "paper_abstract": "In the paper \"The cut sets, decomposition theorems and representation theorems on intuitionistic fuzzy sets and interval-valued fuzzy sets'' [X.H. Yuan, H.X. Li, K. B. Sun, The cut sets, decomposition theorems and representation theorems on intuitionistic fuzzy sets and interval valued fuzzy sets, Science China (Information Sciences), 54(1) (2011) 91-110.], four kinds of cut sets and eight mappings on intuitionistic fuzzy sets are introduced, based on which four decomposition theorems and four representation theorems on intuitionistic fuzzy sets are obtained. This paper first discusses the relations among the four kinds of cut sets and the relations among the eight mappings. Then, the equivalence of the four decomposition theorems based on different cut sets for intuitionistic fuzzy sets is proved, as well as the equivalence of the four representation theorems. In the end, the corresponding conclusions about interval-valued fuzzy sets can be obtained similarly. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Equivalence of the cut sets-based decomposition theorems and representation theorems on intuitionistic fuzzy sets and interval-valued fuzzy sets", "paper_id": "WOS:000314102400034"}