{"auto_keywords": [{"score": 0.04533323425324413, "phrase": "two-copy_probes"}, {"score": 0.03275097241605011, "phrase": "real_data_analysis"}, {"score": 0.03141450123619505, "phrase": "proposed_algorithm"}, {"score": 0.02889812183092541, "phrase": "current_methods"}, {"score": 0.027221589086464767, "phrase": "dominant_two-copy_states"}, {"score": 0.024586093495145706, "phrase": "copy-neutral_loss"}, {"score": 0.02246846748295755, "phrase": "computational_time"}, {"score": 0.00481495049065317, "phrase": "snp-cgh_arrays"}, {"score": 0.00458488025289647, "phrase": "dna_copy_number_analysis"}, {"score": 0.004446677711302801, "phrase": "new_method"}, {"score": 0.0041825926310470616, "phrase": "representative_references"}, {"score": 0.004081385289516914, "phrase": "single_nucleotide_polymorphism_arrays"}, {"score": 0.0038862297330905836, "phrase": "two-state_hidden_markov_model"}, {"score": 0.0036777702949712457, "phrase": "proposed_method"}, {"score": 0.003459191419478298, "phrase": "two-copy_state_probes"}], "paper_keywords": [""], "paper_abstract": "Motivation: Normalization is critical in DNA copy number analysis. We propose a new method to correctly identify two-copy probes from the genome to obtain representative references for normalization in single nucleotide polymorphism arrays. The method is based on a two-state Hidden Markov Model. Unlike most currently available methods in the literature, the proposed method does not need to assume that the percentage of two-copy state probes is dominant in the genome, as long as there do exist two-copy probes. Results: The real data analysis and simulation study show that the proposed algorithm is successful in that (i) it performs as well as the current methods (e.g. CGHnormaliter and popLowess) for samples with dominant two-copy states and outperforms these methods for samples with less dominant two-copy states; (ii) it can identify the copy-neutral loss of heterozygosity; and (iii) it is efficient in terms of the computational time used. Results: The real data analysis and simulation study show that the proposed algorithm is successful in that (i) it performs as well as the current methods (e. g. CGHnormaliter and popLowess) for samples with dominant two-copy states and outperforms these methods for samples with less dominant two-copy states; (ii) it can identify the copy-neutral loss of heterozygosity; and (iii) it is efficient in terms of the computational time used.", "paper_title": "PAIR: paired allelic log-intensity-ratio-based normalization method for SNP-CGH arrays", "paper_id": "WOS:000314892000001"}