{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative_tasks"}, {"score": 0.015599567027237258, "phrase": "virtual_environments"}, {"score": 0.008488139741682627, "phrase": "vw"}, {"score": 0.0047224703862074665, "phrase": "confusing_set"}, {"score": 0.004438250823243621, "phrase": "virtual_worlds"}, {"score": 0.003996727479807572, "phrase": "james_gibson"}, {"score": 0.0033952989364738353, "phrase": "vw_influence_learning"}, {"score": 0.003178326919668771, "phrase": "social_facilitation"}, {"score": 0.0031171827624599693, "phrase": "vw_artifacts"}, {"score": 0.002817639725689939, "phrase": "user's_mental_state"}, {"score": 0.002763415176377921, "phrase": "perceived_learning"}, {"score": 0.0026997176829763746, "phrase": "task_participation"}, {"score": 0.0026272523687965615, "phrase": "lab_experiment"}], "paper_keywords": ["Affordance theory", " Social facilitation", " Context facilitation", " Cognitive absorption", " Learning satisfaction", " Task participation", " Perceived learning", " Virtual worlds"], "paper_abstract": "What we know about learning outcomes for collaborative tasks in virtual environments is a confusing set of results. Many organizations have been hesitant about their use of virtual environments for this reason. Virtual worlds (VWs) have received attention as environments for learning, yet little is known about their attributes, or how they affect learning in collaborative tasks. James Gibson proposed a theory of affordance to explain how cues in an environment are perceived and lead to some course of action. Based on his theory, we developed a model to describe how cues of what can be done in a VW influence learning. In doing so, we focused on the situativity afforded by VWs through context and social facilitation. We showed how VW artifacts and cues make it easier for users to understand the conditions and interactions in a VW. We used this as a basis for predicting a user's mental state and its impact on perceived learning, learning satisfaction, and task participation. We tested our model in a lab experiment set in a VW, using a task that required collaboration between subjects. Our results supported our proposed model. Our work contributed by showing relationships between factors that are unique to a VW, but were not previously recognized. These factors suggest what can be done to influence learning in collaborative tasks in a VW. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "How cues of what can be done in a virtual world influence learning: An affordance perspective", "paper_id": "WOS:000321232400001"}