{"auto_keywords": [{"score": 0.03104244392514206, "phrase": "ens"}, {"score": 0.00481495049065317, "phrase": "evolutionary_multiobjective_optimization"}, {"score": 0.004760394308239882, "phrase": "evolutionary_algorithms"}, {"score": 0.004522406417999492, "phrase": "multiobjective_optimization_problems"}, {"score": 0.004420472010542188, "phrase": "nondominated_sorting"}, {"score": 0.004345525254560329, "phrase": "widely_adopted_technique"}, {"score": 0.0030337085953063125, "phrase": "efficient_nondominated_sort"}, {"score": 0.0024281181691350085, "phrase": "new_approach"}, {"score": 0.0022802596433757565, "phrase": "theoretical_analysis"}, {"score": 0.0021908807203548345, "phrase": "ens-based_sorting_algorithms"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_nondominated_sorting_methods"}], "paper_keywords": ["Computational complexity", " evolutionary multiobjective optimization", " nondominated sorting", " Pareto-optimality"], "paper_abstract": "Evolutionary algorithms have been shown to be powerful for solving multiobjective optimization problems, in which nondominated sorting is a widely adopted technique in selection. This technique, however, can be computationally expensive, especially when the number of individuals in the population becomes large. This is mainly because in most existing nondominated sorting algorithms, a solution needs to be compared with all other solutions before it can be assigned to a front. In this paper we propose a novel, computationally efficient approach to nondominated sorting, termed efficient nondominated sort (ENS). In ENS, a solution to be assigned to a front needs to be compared only with those that have already been assigned to a front, thereby avoiding many unnecessary dominance comparisons. Based on this new approach, two nondominated sorting algorithms have been suggested. Both theoretical analysis and empirical results show that the ENS-based sorting algorithms are computationally more efficient than the state-of-the-art nondominated sorting methods.", "paper_title": "An Efficient Approach to Nondominated Sorting for Evolutionary Multiobjective Optimization", "paper_id": "WOS:000352277900004"}