{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_information"}, {"score": 0.04879655533384408, "phrase": "protein_remote_homology_detection"}, {"score": 0.015539831657690257, "phrase": "frequency_profiles"}, {"score": 0.0047224703862074665, "phrase": "sequence-based_kernels"}, {"score": 0.004525190364108967, "phrase": "basic_research"}, {"score": 0.00445550467119693, "phrase": "molecular_evolution"}, {"score": 0.004336115760817672, "phrase": "practical_application"}, {"score": 0.004138813595009761, "phrase": "drug_development"}, {"score": 0.004027876348834879, "phrase": "great_deal"}, {"score": 0.003859500298805362, "phrase": "profile-based_approach"}, {"score": 0.0037853015963603682, "phrase": "high_potential"}, {"score": 0.003627028894710926, "phrase": "key_step"}, {"score": 0.0033170847930578473, "phrase": "novel_approach"}, {"score": 0.0029867619862229853, "phrase": "multiple_sequence_alignments"}, {"score": 0.002952146666681891, "phrase": "psi-blast._three_top_performing_sequence-based_kernels"}, {"score": 0.002752695791351096, "phrase": "profile-based_protein_representation"}, {"score": 0.002668420182908979, "phrase": "scop_benchmark_dataset"}, {"score": 0.0025468074858862964, "phrase": "new_approach"}, {"score": 0.002356282242320051, "phrase": "useful_insights"}, {"score": 0.002205560249972527, "phrase": "current_approach"}, {"score": 0.0021463304704817873, "phrase": "existing_sequence-based_methods"}], "paper_keywords": [""], "paper_abstract": "Motivation: Owing to its importance in both basic research (such as molecular evolution and protein attribute prediction) and practical application (such as timely modeling the 3D structures of proteins targeted for drug development), protein remote homology detection has attracted a great deal of interest. It is intriguing to note that the profile-based approach is promising and holds high potential in this regard. To further improve protein remote homology detection, a key step is how to find an optimal means to extract the evolutionary information into the profiles. Results: Here, we propose a novel approach, the so-called profile-based protein representation, to extract the evolutionary information via the frequency profiles. The latter can be calculated from the multiple sequence alignments generated by PSI-BLAST. Three top performing sequence-based kernels (SVM-Ngram, SVM-pairwise and SVM-LA) were combined with the profile-based protein representation. Various tests were conducted on a SCOP benchmark dataset that contains 54 families and 23 superfamilies. The results showed that the new approach is promising, and can obviously improve the performance of the three kernels. Furthermore, our approach can also provide useful insights for studying the features of proteins in various families. It has not escaped our notice that the current approach can be easily combined with the existing sequence-based methods so as to improve their performance as well.", "paper_title": "Combining evolutionary information extracted from frequency profiles with sequence-based kernels for protein remote homology detection", "paper_id": "WOS:000332032100004"}