{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "relative_absence"}, {"score": 0.00477190623242136, "phrase": "empirical_studies"}, {"score": 0.004708056866527125, "phrase": "driven_engineering"}, {"score": 0.004401342842183475, "phrase": "large_online_survey"}, {"score": 0.0043619799095455415, "phrase": "mde_deployment"}, {"score": 0.0042459818200777846, "phrase": "rough_quantitative_measures"}, {"score": 0.004208002469225673, "phrase": "mde_practices"}, {"score": 0.004005083535629333, "phrase": "qualitative_data"}, {"score": 0.003777800904236079, "phrase": "mde_practitioners"}, {"score": 0.003499864176875713, "phrase": "model_driven_engineering_approach"}, {"score": 0.0034220655476652683, "phrase": "in-depth_semi-structured_interviewing"}, {"score": 0.0031702173541386888, "phrase": "case_studies"}, {"score": 0.0030307927228223883, "phrase": "model_driven_practices"}, {"score": 0.00277001889871322, "phrase": "simple_technical_factors"}, {"score": 0.0026841368358805407, "phrase": "relative_success"}, {"score": 0.002543043781904587, "phrase": "case_study_companies"}, {"score": 0.0025202582748972122, "phrase": "genuine_success"}, {"score": 0.0024641814990854463, "phrase": "driven_development"}, {"score": 0.0022118619998034742, "phrase": "existing_organizational_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Model driven engineering", " Empirical software engineering", " Industry practice"], "paper_abstract": "In this article, we attempt to address the relative absence of empirical studies of model driven engineering (MDE) in two different but complementary ways. First, we present an analysis of a large online survey of MDE deployment and experience that provides some rough quantitative measures of MDE practices in industry. Second, we supplement these figures with qualitative data obtained from some semi-structured, in-depth interviews with MDE practitioners, and, in particular, through describing the practices of four commercial organizations as they adopted a model driven engineering approach to their software development practices. Using in-depth semi-structured interviewing, we invited practitioners to reflect on their experiences and selected four to use as exemplars or case studies. In documenting some details of their attempts to deploy model driven practices, we identify a number of factors, in particular the importance of complex organizational, managerial and social factors - as,opposed to simple technical factors - that appear to influence the relative success, or failure, of the endeavor. Three of the case study companies describe genuine success in their use of model driven development, but explain that as examples of organizational change management, the successful deployment of model driven engineering appears to require: a progressive and iterative approach; transparent organizational commitment and motivation; integration with existing organizational processes and a clear business focus. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Model-driven engineering practices in industry: Social, organizational and managerial factors that lead to success or failure", "paper_id": "WOS:000337929100006"}