{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_architecture"}, {"score": 0.004076157223660074, "phrase": "generic_model"}, {"score": 0.003922378980031565, "phrase": "significant_addition"}, {"score": 0.0037024804835018373, "phrase": "fundamental_invariance"}, {"score": 0.0035399770257915466, "phrase": "behavioral_inclinations"}, {"score": 0.0034282732966589478, "phrase": "inevitable_variability"}, {"score": 0.002864628676257225, "phrase": "person-situation_interactions"}, {"score": 0.0027741761880779535, "phrase": "major_personality_traits"}, {"score": 0.0024714996534331668, "phrase": "empirical_data"}, {"score": 0.0023029886389559122, "phrase": "personality_modeling"}, {"score": 0.002273605493468005, "phrase": "generic_computational_cognitive_modeling"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Personality", " Cognitive architecture", " Cognitive modeling"], "paper_abstract": "This paper describes how personality may be explained by a generic, comprehensive computational cognitive architecture. We show that a cognitive architecture by itself can serve as a generic model of personality, without any significant addition or modification. A cognitive architecture can capture the fundamental invariance within an individual in terms of behavioral inclinations as well as the inevitable variability of behaviors. Various tests and simulations have been conducted within the cognitive architecture that show that such a model is reasonably stable, is relatively flexible (in terms of person-situation interactions), captures some major personality traits (e. g., the Five-Factor Model), and accounts for a variety of empirical data. The work shows the feasibility and usefulness of integrating personality modeling with generic computational cognitive modeling (i.e., cognitive architectures). (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "A model of personality should be a cognitive architecture itself", "paper_id": "WOS:000333797800001"}