{"auto_keywords": [{"score": 0.03955132086427279, "phrase": "hidden_terminals"}, {"score": 0.025197636573095997, "phrase": "larger_transmission_range"}, {"score": 0.00481495049065317, "phrase": "htc_algorithm"}, {"score": 0.0043358695338488445, "phrase": "hidden_terminal_problems"}, {"score": 0.00421520166010848, "phrase": "exact_multi-hop_characters"}, {"score": 0.004064958518350867, "phrase": "novel_analysis_model"}, {"score": 0.003704797078215222, "phrase": "exact_multi-hop_behaviors"}, {"score": 0.0034452601929727752, "phrase": "parallel_access_scheme"}, {"score": 0.002896274285996145, "phrase": "n_modified_semi-markov_chains"}, {"score": 0.0027370835853738626, "phrase": "circle_plane"}, {"score": 0.0027041233221381756, "phrase": "poisson_distribution"}, {"score": 0.00266079124891013, "phrase": "performance_comparisons"}, {"score": 0.0024742098091226203, "phrase": "analysis_results"}, {"score": 0.0024052270356036743, "phrase": "simulation_results"}, {"score": 0.002347628167175859, "phrase": "relatively_higher_node_density"}, {"score": 0.002300681752315682, "phrase": "analysis_and_comparison_results"}, {"score": 0.0022455871864723274, "phrase": "htc"}, {"score": 0.002165388556451298, "phrase": "throughput_performance"}], "paper_keywords": [""], "paper_abstract": "Most of analyses for the IEEE 802.15.4 Carrier SenseMultiple Access with Collision Avoidance (CSMA/CA) scheme for multi-hop wireless sensor networks (WSNs) focus on how to avoid the impacts of hidden terminal problems rather than how to derive the exact multi-hop characters. In this paper, we propose a novel analysis model to analyze and improve the behaviors of multi-hop WSNs touching upon both avoiding the impacts of hidden terminals and acquiring the exact multi-hop behaviors. At first, a novel Hidden Terminal Couple (HTC) algorithm is proposed to avoid the impacts of hidden terminals, and a parallel access scheme is proposed to dispense with taking the routing overhead into account. Along with these two strategies, the accurate statistical performance metrics of throughput and delay of unsaturated, unacknowledged IEEE 802.15.4 beacon-enabled networks for 1-hop and 2-hop scenarios are then predicted based on the models which contains n modified semi-Markov chains and one macro-Markov chain, in which nodes are assumed to locate randomly over a circle plane according to Poisson distribution. Moreover, performance comparisons between our scheme (called HTC scheme) and other multi-hop CSMA/CA schemes which involve hidden terminal avoiding are also proposed. Comprehensive NS-2 simulations demonstrate that the analysis results of these models match well the simulation results, especially for larger transmission range and relatively higher node density. Besides, the analysis and comparison results show that delay behavior of HTC is improved largely relatively to other schemes, while throughput performance is improved in some cases of more node density and larger transmission range.", "paper_title": "Performance Analyses and Improvements for IEEE 802.15.4 CSMA/CA Scheme in Wireless Multihop Sensor Networks Based on HTC Algorithm", "paper_id": "WOS:000328057900001"}