{"auto_keywords": [{"score": 0.049378038061471535, "phrase": "synteny_blocks"}, {"score": 0.00481495049065317, "phrase": "chromosomal_rearrangements"}, {"score": 0.004698000536608171, "phrase": "synteny_packs"}, {"score": 0.004406994912939125, "phrase": "ancestral_genomes"}, {"score": 0.003548905904860611, "phrase": "richer_and_more_complete_output"}, {"score": 0.002986969236641105, "phrase": "multiple_genomes"}, {"score": 0.002899965889623787, "phrase": "pairwise_comparisons"}, {"score": 0.0027334673433027086, "phrase": "novel_solutions"}, {"score": 0.0023694065215394593, "phrase": "new_notion"}, {"score": 0.002346160830406661, "phrase": "synteny_pack"}, {"score": 0.0022665781920241245, "phrase": "local_hypothetical_intermediate_ancestral_genomes"}, {"score": 0.0021682027434117095, "phrase": "yeast_genomes"}], "paper_keywords": ["Synteny block", " combinatorics of genome rearrangements", " ancestral genome", " pairwise comparison"], "paper_abstract": "The reconstruction of the history of rearrangements and the reconstruction of ancestral genomes are some of the challenges of bioinformatics today. Many algorithms already exist, treating one or the other question but none treating both. These reconstructions are interdependent and we argue on the interest of treating both problems in parallel to lead to a richer and more complete output. We also argue on the importance of redefining several steps of these algorithms to improve both reconstructions: the identification of synteny blocks has to be as precise as possible, and the treatment of multiple genomes has to be based on pairwise comparisons to ensure the most detailed reconstructions. In this article, we highlight novel solutions to these points and focus on the need of explicitly treating overlapping, included, duplicated and unsigned synteny blocks. To do so, we introduce the new notion of synteny pack, which is a representation of local hypothetical intermediate ancestral genomes. We discuss a number of examples on yeast genomes to illustrate the importance of such a definition.", "paper_title": "Combinatorics of chromosomal rearrangements based on synteny blocks and synteny packs", "paper_id": "WOS:000322402200006"}