{"auto_keywords": [{"score": 0.04652122652620528, "phrase": "execution_times"}, {"score": 0.00481495049065317, "phrase": "scheduling_metrics"}, {"score": 0.004672808182229058, "phrase": "list_schedulers"}, {"score": 0.004344755264641137, "phrase": "dynamic_scheduling"}, {"score": 0.0039035351575463103, "phrase": "key_qos_requirement"}, {"score": 0.0037398106866046972, "phrase": "wide_range"}, {"score": 0.0036137713873827374, "phrase": "transient_periods"}, {"score": 0.00350696416714684, "phrase": "schedule_qos_metrics"}, {"score": 0.0031640918630415566, "phrase": "undesirable_features"}, {"score": 0.0027940789980683, "phrase": "novel_list"}, {"score": 0.002665305036900055, "phrase": "good_responsiveness"}, {"score": 0.002597577409911978, "phrase": "slr_metric"}, {"score": 0.002254624822004988, "phrase": "synthetic_workloads"}, {"score": 0.0022257833099336858, "phrase": "industrial_trace"}, {"score": 0.0021231452870210965, "phrase": "starvation-free_behaviour"}], "paper_keywords": ["Scheduling", " Metrics", " Responsiveness", " Fairness", " Utilisation", " List scheduling", " Dependencies", " Network delays", " Heterogeneity"], "paper_abstract": "This paper considers the dynamic scheduling of parallel, dependent tasks onto a static, distributed computing platform, with the intention of delivering fairness and quality of service (QoS) to users. The key QoS requirement is that responsiveness is maintained for workloads with a wide range of execution times (minutes to months) even under transient periods of overload. A survey of schedule QoS metrics is presented, classified into those dealing with responsiveness, fairness and utilisation. These metrics are evaluated as to their ability to detect undesirable features of schedules. The Schedule Length Ratio (SLR) metric is shown to be the most helpful for measuring responsiveness in the presence of dependencies. A novel list scheduling policy called Projected-SLR is presented that delivers good responsiveness and fairness by using the SLR metric in its scheduling decisions. Projected-SLR is found to perform equally as well in responsiveness, fairness and utilisation as the best of the other scheduling policies evaluated (Shortest Remaining Time First/SRTF), using synthetic workloads and an industrial trace. However, Projected-SLR does this with a guarantee of starvation-free behaviour, unlike SRTF. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A survey of scheduling metrics and an improved ordering policy for list schedulers operating on workloads with dependencies and a wide variation in execution times", "paper_id": "WOS:000326613400013"}