{"auto_keywords": [{"score": 0.04964635174824772, "phrase": "google"}, {"score": 0.007134653292035158, "phrase": "relative_effectiveness"}, {"score": 0.00697490530494721, "phrase": "search_tools"}, {"score": 0.0065462613726896025, "phrase": "world_wide_web"}, {"score": 0.005560478747252379, "phrase": "opendoar"}, {"score": 0.0053866886865654015, "phrase": "oa_versions"}, {"score": 0.00481495049065317, "phrase": "open_access_articles"}, {"score": 0.0046221918332842995, "phrase": "opendoar._purpose_-_the"}, {"score": 0.004278807087784626, "phrase": "open_access"}, {"score": 0.004126123386192962, "phrase": "academic_articles"}, {"score": 0.003287482882222731, "phrase": "journal_articles"}, {"score": 0.0028944757265206332, "phrase": "google_and_google_scholar"}, {"score": 0.0027532250588485742, "phrase": "mister"}, {"score": 0.0022434880661725493, "phrase": "oa_articles"}, {"score": 0.0021049977753042253, "phrase": "general_search_engines"}], "paper_keywords": ["Retrieval performance evalution", " Internet", " Information searches"], "paper_abstract": "Purpose - The purpose of this paper is to demonstrate the relative effectiveness of a range of search tools in finding open access (OA) versions of peer reviewed academic articles oil the world wide web. Design/rnethodology/approach - Some background is given oil why and how academics may make their articles OA and how they may be found by others searching for them. Google, Google Scholar, OAIster and OpenDOAR were used to try to locate OA versions of peer reviewed journal articles drawn from three subjects (ecology, economics and sociology). Findings - Of the 2,519 articles, 967 were found to have OA versions on the world wide web. Google and Google Scholar found 76.84 per cent of them. The results from OpenDOAR and Mister were disappointing, but some,improvements are noted. Only in economics could OAIster and OpenDOAR be considered relative successes. Originality/value - The paper shows the relative effectiveness of the search tools in these three subjects. The results indicate that those wanting to find OA articles, in these subjects, for the moment at least should use the general search engines Google and Google Scholar first rather than OpenDOAR or OAIster.", "paper_title": "Finding open access articles using Google, Google Scholar, OAIster and OpenDOAR", "paper_id": "WOS:000262140300002"}