{"auto_keywords": [{"score": 0.0471475170295506, "phrase": "response_variable"}, {"score": 0.010897228242351955, "phrase": "f_method"}, {"score": 0.010296062959699499, "phrase": "proposed_methods"}, {"score": 0.006516314508668405, "phrase": "poisson_distribution"}, {"score": 0.00521862354253597, "phrase": "lrt_method"}, {"score": 0.00481495049065317, "phrase": "generalized_linear_model-based_regression_profiles"}, {"score": 0.004334280585565239, "phrase": "different_types"}, {"score": 0.004155670607078649, "phrase": "normal_distribution"}, {"score": 0.003889693671417058, "phrase": "generalized_linear_models"}, {"score": 0.003522192233486405, "phrase": "misleading_results"}, {"score": 0.0032085525502105836, "phrase": "glm_regression_profiles"}, {"score": 0.0031893014610230985, "phrase": "phase_i."}, {"score": 0.003076189012372961, "phrase": "special_case"}, {"score": 0.0030030115662983956, "phrase": "simulation_study"}, {"score": 0.002931569771634119, "phrase": "signal_criterion"}, {"score": 0.0024842242921857705, "phrase": "real_case"}, {"score": 0.0023745087648471613, "phrase": "successive_days"}, {"score": 0.002353152728035836, "phrase": "glm_profile"}, {"score": 0.0022089311733832985, "phrase": "statistical_control"}, {"score": 0.002130514432266586, "phrase": "mentioned_situation"}, {"score": 0.0021049977753042253, "phrase": "out-of-control_conditions"}], "paper_keywords": ["Phase I", " Poisson regression profiles", " profile monitoring", " statistical process control", " likelihood ratio test"], "paper_abstract": "In some industrial applications, the quality of a process or product is characterized by a relationship between the response variable and one or more independent variables which is called as profile. There are many approaches for monitoring different types of profiles in the literature. Most researchers assume that the response variable follows a normal distribution. However, this assumption may be violated in many cases. The most likely situation is when the response variable follows a distribution from generalized linear models (GLMs). For example, when the response variable is the number of defects in a certain area of a product, the observations follow Poisson distribution and ignoring this fact will cause misleading results. In this paper, three methods including a T-2-based method, likelihood ratio test (LRT) method and F method are developed and modified in order to be applied in monitoring GLM regression profiles in Phase I. The performance of the proposed methods is analysed and compared for the special case that the response variable follows Poisson distribution. A simulation study is done regarding the probability of the signal criterion. Results show that the LRT method performs better than two other methods and the F method performs better than the T-2-based method in detecting either small or large step shifts as well as drifts. Moreover, the F method performs better than the other two methods, and the LRT method performs poor in comparison with the F and T-2-based methods in detecting outliers. A real case, in which the size and number of agglomerates ejected from a volcano in successive days form the GLM profile, is illustrated and the proposed methods are applied to determine whether the number of agglomerates of each size is under statistical control or not. Results showed that the proposed methods could handle the mentioned situation and distinguish the out-of-control conditions.", "paper_title": "Phase I monitoring of generalized linear model-based regression profiles", "paper_id": "WOS:000356429100006"}