{"auto_keywords": [{"score": 0.039123809615100015, "phrase": "mhealth_technology"}, {"score": 0.004759635663291431, "phrase": "mobile_health"}, {"score": 0.004544629724830453, "phrase": "mobile_devices"}, {"score": 0.004518442937844318, "phrase": "health_related_behaviors"}, {"score": 0.004179280538985628, "phrase": "technology_proliferates"}, {"score": 0.004083745587982289, "phrase": "mobile_technology_increase"}, {"score": 0.003967379852781603, "phrase": "rigorous_usability_evaluation_framework"}, {"score": 0.003680055701720573, "phrase": "first_exemplar"}, {"score": 0.0036063061558261546, "phrase": "adolescents'_use"}, {"score": 0.0035855066449812273, "phrase": "mobile_technology"}, {"score": 0.0035442655396704724, "phrase": "health_information"}, {"score": 0.0034933782525914682, "phrase": "second_exemplar"}, {"score": 0.0034233569308012982, "phrase": "ecological_momentary_assessment_study"}, {"score": 0.0033353809745319857, "phrase": "pre-installed_health-related_applications"}, {"score": 0.0032309093154028663, "phrase": "focus_group_data"}, {"score": 0.00311409797887295, "phrase": "information"}, {"score": 0.0030581104475018487, "phrase": "learnability"}, {"score": 0.003014161904711726, "phrase": "competency"}, {"score": 0.002945175711537758, "phrase": "finer_granularity"}, {"score": 0.0029028648824177715, "phrase": "nine_concepts"}, {"score": 0.0026924262536607915, "phrase": "third_rater"}, {"score": 0.00265373679629359, "phrase": "coding_discordance"}, {"score": 0.0025336179740814905, "phrase": "exemplar_i."}, {"score": 0.002432971714608409, "phrase": "performance_speed"}, {"score": 0.002276210060619432, "phrase": "mobile_health_technology"}, {"score": 0.0022048426029968, "phrase": "memorability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Usability", " Evaluation framework", " Mobile health", " Health-ITUEM"], "paper_abstract": "Background: Over two decades of research has been conducted using mobile devices for health related behaviors yet many of these studies lack rigor. There are few evaluation frameworks for assessing the usability of mHealth, which is critical as the use of this technology proliferates. As the development of interventions using mobile technology increase, future work in this domain necessitates the use of a rigorous usability evaluation framework. Methods: We used two exemplars to assess the appropriateness of the Health IT Usability Evaluation Model (Health-ITUEM) for evaluating the usability of mHealth technology. In the first exemplar, we conducted 6 focus group sessions to explore adolescents' use of mobile technology for meeting their health Information needs. In the second exemplar, we conducted 4 focus group sessions following an Ecological Momentary Assessment study in which 60 adolescents were given a smartphone with pre-installed health-related applications (apps). Data analysis: We coded the focus group data using the 9 concepts of the Health-ITUEM: Error prevention, Completeness, Memorability, Information needs, Flexibility/Customizability, Learnability, Performance speed, Competency, Other outcomes. To develop a finer granularity of analysis, the nine concepts were broken into positive, negative, and neutral codes. A total of 27 codes were created. Two raters (R1 and R2) initially coded all text and a third rater (R3) reconciled coding discordance between raters R1 and R2. Results: A total of 133 codes were applied to Exemplar I. In Exemplar 2 there were a total of 286 codes applied to 195 excerpts. Performance speed, Other outcomes, and Information needs were among the most frequently occurring codes. Conclusion: Our two exemplars demonstrated the appropriateness and usefulness of the Health-ITUEM in evaluating mobile health technology. Further assessment of this framework with other study populations should consider whether Memorability and Error prevention are necessary to include when evaluating mHealth technology. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Assessment of the Health IT Usability Evaluation Model (Health-ITUEM) for evaluating mobile health (mHealth) technology", "paper_id": "WOS:000328012900012"}