{"auto_keywords": [{"score": 0.04482363560040257, "phrase": "srlg_failures"}, {"score": 0.020261289461561836, "phrase": "backup_reprovisioning"}, {"score": 0.01681294228194038, "phrase": "recovery_ratio"}, {"score": 0.010018518493910614, "phrase": "srlg"}, {"score": 0.008825355895140692, "phrase": "single-link_failures"}, {"score": 0.007863450185862212, "phrase": "srlg-disjoint_backup_paths"}, {"score": 0.006740887986802887, "phrase": "backup_paths"}, {"score": 0.005602091385469775, "phrase": "random_reprovisioning"}, {"score": 0.004777917315737992, "phrase": "wdm_mesh_networks"}, {"score": 0.004579244735256393, "phrase": "shared_risk_link_group"}, {"score": 0.004474366340935036, "phrase": "shared-path_protection"}, {"score": 0.004094018760244776, "phrase": "different_policies"}, {"score": 0.003833749901796579, "phrase": "next_failures"}, {"score": 0.0036884198249734863, "phrase": "major_challenge"}, {"score": 0.0033616344666486725, "phrase": "reasonable_computational_complexity"}, {"score": 0.0032341432727280707, "phrase": "different_sequences"}, {"score": 0.0031356295480964927, "phrase": "srlg_constraints"}, {"score": 0.0030994630902300133, "phrase": "first_policy"}, {"score": 0.002891032998395276, "phrase": "second_policy"}, {"score": 0.002707033618304716, "phrase": "third_policy"}, {"score": 0.0025643086619242814, "phrase": "unprotected_working_path"}, {"score": 0.0025054621733192283, "phrase": "extensive_simulation_results"}, {"score": 0.0022568866348667547, "phrase": "srlg_size"}, {"score": 0.002171202123281881, "phrase": "first_reprovisioning_policy"}], "paper_keywords": ["Shared-path protection", " Backup reprovisioning", " Shared risk link group (SRLG)", " Survivability", " WDM networks"], "paper_abstract": "In this paper, we study the impact of shared risk link group (SRLG) failures on shared-path protection by examining the percentage of connections that are vulnerable after SRLG failures, investigate the benefits of backup reprovisioning after SRLG failures, and evaluate different policies for backup reprovisioning. Compared with single-link failures, SRLG failures leave many more connections unprotected and vulnerable to the next failures and make the network topology much sparser. The major challenge of backup reprovisioning after SRLG failures is how to find SRLG-disjoint backup paths for those unprotected connections with a recovery ratio that is as high as possible within reasonable computational complexity. We are motivated to consider three reprovisioning policies by considering different sequences of reprovisioning according to the degree of SRLG constraints. The first policy is to reprovision backup paths for connections whose working paths traverse more SRLGs first (Policy I), and the second policy is to reprovision backup paths for connections whose working paths traverse fewer SRLGs first (Policy II). The third policy is to do backup reprovisioning randomly, i.e., we pick up an unprotected working path randomly (random reprovisioning). Extensive simulation results show that 1) SRLG failures will leave more connections unprotected compared with single-link failures, and the percentage of connections left vulnerable tends to be proportional to the SRLG size; 2) the network performance based on the first reprovisioning policy always performs best in recovery ratio; and 3) the network performance based on Policy II even underperforms the random reprovisioning. These results can be explained by the fact that connections whose working paths traverse fewer SRLGs are more flexible in finding SRLG-disjoint backup paths, and thus priority given to connections whose working paths traverse more SRLGs in Policy I can significantly improve the recovery ratio.", "paper_title": "Backup Reprovisioning After Shared Risk Link Group (SRLG) Failures in WDM Mesh Networks", "paper_id": "WOS:000284849700009"}