{"auto_keywords": [{"score": 0.045934685709724456, "phrase": "chat"}, {"score": 0.013624654414782174, "phrase": "information_behavior"}, {"score": 0.00481495049065317, "phrase": "activity_theory"}, {"score": 0.004774609708848914, "phrase": "context"}, {"score": 0.004439097815805505, "phrase": "cultural-historical_activity_theory"}, {"score": 0.004414171813953476, "phrase": "information_behavior_research"}, {"score": 0.004262273304740847, "phrase": "research_activities"}, {"score": 0.004129607015893271, "phrase": "information_systems"}, {"score": 0.003947186611084043, "phrase": "theoretical_challenges"}, {"score": 0.0033393377529146893, "phrase": "identified_openings"}, {"score": 0.0028505007899807446, "phrase": "theoretical_lens"}, {"score": 0.0024111277643627154, "phrase": "information_science"}, {"score": 0.0022940375532231145, "phrase": "detailed_description"}], "paper_keywords": [""], "paper_abstract": "Over the last 7 years, the AIMTech Research Group in the University of Leeds has used cultural-historical activity theory (CHAT) to inform a range of research activities in the fields of information behavior and information systems. In this article, we identify certain openings and theoretical challenges in the field of information behavior, which sparked our initial interest in CHAT: context, technology, and the link between practice and policy. We demonstrate the relevance of CHAT in studying information behavior and addressing the identified openings and argue that by providing a framework and hierarchy of activity-action-operation and semantic tools, CHAT is able to overcome many of the uncertainties concerning information behavior research. In particular, CHAT provides researchers a theoretical lens to account for context and activity mediation and, by doing so, can increase the significance of information behavior research to practice. In undertaking this endeavour, we have relied on literature from the fields of information science and others where CHAT is employed. We provide a detailed description of how CHAT may be applied to information behavior and account for the concepts we see as relevant to its study.", "paper_title": "Working With Activity Theory: Context, Technology, and Information Behavior", "paper_id": "WOS:000288525000013"}