{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service-based_applications"}, {"score": 0.031098289909574556, "phrase": "query_execution"}, {"score": 0.004431041346291019, "phrase": "important_issue"}, {"score": 0.004192190072470619, "phrase": "runtime_service_discovery"}, {"score": 0.004077616905584829, "phrase": "service_discovery_queries"}, {"score": 0.003929689573550262, "phrase": "pull_mode"}, {"score": 0.003734979290204709, "phrase": "replacement_service"}, {"score": 0.0036665842836420223, "phrase": "push_mode"}, {"score": 0.0032665093519968083, "phrase": "adequate_services"}, {"score": 0.0024750474634399797, "phrase": "distance-based_matching"}, {"score": 0.0021049977753042253, "phrase": "positive_results"}], "paper_keywords": ["Web-services discovery", " composite web services", " context-aware QoS model", " application development in services"], "paper_abstract": "The identification of services during the execution of service-based applications to replace services in them that are no longer available and/or fail to satisfy certain requirements is an important issue. In this paper, we present a framework to support runtime service discovery. This framework can execute service discovery queries in pull and push mode. In pull mode, it executes queries when a need for finding a replacement service arises. In push mode, queries are subscribed to the framework to be executed proactively and, in parallel with the operation of the application, to identify adequate services that could be used if the need for replacing a service arises. Hence, the proactive (push) mode of query execution makes it more likely to avoid interruptions in the operation of service-based applications when a service in them needs to be replaced at runtime. In both modes of query execution, the identification of services relies on distance-based matching of structural, behavioral, quality, and contextual characteristics of services and applications. A prototype implementation of the framework has been developed and an evaluation was carried out to assess the performance of the framework. This evaluation has shown positive results, which are discussed in the paper.", "paper_title": "Proactive and Reactive Runtime Service Discovery: A Framework and Its Evaluation", "paper_id": "WOS:000321125200005"}