{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "formal_specifications"}, {"score": 0.009910094830746874, "phrase": "autonomous_components"}, {"score": 0.0067932000863704925, "phrase": "large_scale_systems"}, {"score": 0.0047057084749407485, "phrase": "running_programs"}, {"score": 0.004392565073466714, "phrase": "independently_developed_software"}, {"score": 0.004268293864953256, "phrase": "environmental_conditions"}, {"score": 0.0041001740903338834, "phrase": "design_time"}, {"score": 0.004053362743156545, "phrase": "software_engineering_tasks"}, {"score": 0.003634371940842838, "phrase": "future_use"}, {"score": 0.003006654007926993, "phrase": "correct_execution"}, {"score": 0.0027424619603260837, "phrase": "different_perspectives"}], "paper_keywords": [""], "paper_abstract": "Issues related to large scale systems made of autonomous components encompass interoperability among independently developed software and adaptability to changing environmental conditions. Formal specifications are traditionally used at design time for software engineering tasks. However, recently, several attempts of using formal specifications at run-time have been realised that let envisage a future use of formal specifications at run-time that will enhance interoperability and adaptability of autonomous components. This paper intends to highlight the potentialities of the use of formal specifications at run-time as a support for the correct execution of such components. This paper reviews and discusses the use of formal specifications at run-time from different perspectives: software engineering, run-time code evolution, adaptive middleware, trust and security, or business applications. It highlights the potentialities of the use of formal specifications at run-time as a support for interoperability and adaptability of interacting autonomous components. It identifies as well application domains and open issues related to the combination of specifications and code in the framework of large scale systems.", "paper_title": "On the use of formal specifications as part of running programs", "paper_id": "WOS:000238283600014"}