{"auto_keywords": [{"score": 0.04939971186552105, "phrase": "swarming_period"}, {"score": 0.012391463257289625, "phrase": "honey_loss"}, {"score": 0.00481495049065317, "phrase": "bee_hives"}, {"score": 0.004787500676821839, "phrase": "early_detection"}, {"score": 0.004626041906722018, "phrase": "oldest_forms"}, {"score": 0.004508515162768118, "phrase": "honey_production"}, {"score": 0.004431823727596458, "phrase": "honey"}, {"score": 0.004381413067286347, "phrase": "animal_production"}, {"score": 0.004294570451240907, "phrase": "big_productions"}, {"score": 0.004245717817867575, "phrase": "best_blooming_time"}, {"score": 0.0038965391824276594, "phrase": "last_fact"}, {"score": 0.003863235056582662, "phrase": "big_economic_interest"}, {"score": 0.0034158953664461663, "phrase": "acoustic_method"}, {"score": 0.003125785288138378, "phrase": "humidity_sensor"}, {"score": 0.0030549925653548826, "phrase": "sample_rate"}, {"score": 0.002994437846055261, "phrase": "matlab"}, {"score": 0.0028276605157505977, "phrase": "power_spectral_density"}, {"score": 0.002693262404213432, "phrase": "occasionally_a_rapid_change"}, {"score": 0.0024927805810990686, "phrase": "actual_time"}, {"score": 0.0023879077085067137, "phrase": "bee_wings"}, {"score": 0.002229190333606617, "phrase": "external_conditions"}, {"score": 0.0022101055924375725, "phrase": "significant_variation"}, {"score": 0.0021049977753042253, "phrase": "acoustical_features"}], "paper_keywords": ["bee", " frequency", " hive", " honey loss", " sounds", " swarming", " temperature"], "paper_abstract": "Beekeeping, known as one of the oldest forms of agriculture, in its complexity requires control for honey production with what modern technology can offer. Honey is included in animal production implying that farmers have interest in big productions according to the best blooming time, the presence of parasites, the genetic strain of his bees and the swarming periods of the honeybees (queen and her workers leaving the hive). This last fact has a big economic interest for the beekeeper as swarming means honey loss since bees start collecting the honey to migrate. Here for a method that enables the prediction of the swarming is required to prevent the queen from leaving the hives. In this experiment an acoustic method based on labelling of sounds is proposed to predict the swarming period. Three hives were monitored during 270h. The microphones were sited inside the hives together with a temperature and humidity sensor. The sounds were recorded with a sample rate of 2 kHz, and analyzed via Matlab and Cool Edit Pro. During this period 9 swarming activities occurred. Swarming is indicated by an increase in the power spectral density at about 110Hz; approaching to swarm the sound augmented in amplitude and frequency to 300 Hz, occasionally a rapid change occurred from 150 Hz to 500 Hz. Another finding indicating the initiation of a swarming period is the raise in temperature from 33 degrees C to 35 C until the actual time of swarming when the temperature starts dropping to 32 degrees C. With more activity, ventilation from bee wings causes drop of temperature. Less information comes from the correlation between sound and humidity since this parameter is too much influenced by the external conditions and no significant variation occurred according to a swarm. This increase of temperature, together with the changes in acoustical features of the sound recorded in the hive, may be used as a predictor for swarming of the bees to reduce honey loss. (C) 2008 Elsevier BY. All rights reserved.", "paper_title": "Monitoring of swarming sounds in bee hives for early detection of the swarming period", "paper_id": "WOS:000259462800012"}