{"auto_keywords": [{"score": 0.004553510708976456, "phrase": "family_homes"}, {"score": 0.004370814742381778, "phrase": "selected_materials"}, {"score": 0.004322267755421529, "phrase": "ethnographically_informed_study"}, {"score": 0.004290201740122912, "phrase": "home_life"}, {"score": 0.0038224221344037236, "phrase": "heterogeneous_collection"}, {"score": 0.003641713874009232, "phrase": "ambiguous_status"}, {"score": 0.0034566143156030426, "phrase": "\"safe\"_site"}, {"score": 0.003102488033561956, "phrase": "shared_but_idiosyncratic_practices"}, {"score": 0.002363101338529545, "phrase": "idiosyncratic_systems"}, {"score": 0.002345535736297701, "phrase": "household_organization"}, {"score": 0.002234491924392104, "phrase": "people's_ideas"}, {"score": 0.0021049977753042253, "phrase": "physical_as_well_as_digital_things"}], "paper_keywords": ["clutter", " home life", " sacred", " domestic technology", " ethnography"], "paper_abstract": "In this article, we examine the containment of clutter in family homes and, from this, outline considerations for design. Selected materials from an ethnographically informed study of home life are used to detail the ways in which families contain their clutter in bowls and drawers. Clutter, within these containers, is found to be made up of a heterogeneous collection of things that, for all manner of reasons, hold an ambiguous status in the home. It is shown that bowls and drawers provide a \"safe\" site of containment for clutter, giving the miscellany of content the \"space\" to be properly dealt with and classified, or to be left unresolved. The shared but idiosyncratic practices families use to contain their clutter are seen to be one of the ways in which the home, or at least the idea of home, is collectively produced. It is also part of the means by which families come to make their homes distinct and unique. These findings are used to consider what it might mean to design for the home, and to do so in ways that are sensitive to the idiosyncratic systems of household organization. In conclusion, thought is given to how we design for people's ideas of home, and how we might build sites of uncertainty into homes, where physical as well as digital things might coalesce.", "paper_title": "Making place for clutter and other ideas of home", "paper_id": "WOS:000257527300003"}