{"auto_keywords": [{"score": 0.046301804206836855, "phrase": "minimal_congestion"}, {"score": 0.013788045673593714, "phrase": "minimal_vehicle_emissions"}, {"score": 0.012952388174342274, "phrase": "emissions_network_design_problem"}, {"score": 0.00481495049065317, "phrase": "delay_minimization"}, {"score": 0.004549242970806199, "phrase": "transportation_road_networks"}, {"score": 0.00408654006336477, "phrase": "apparent_gap"}, {"score": 0.004035282762331904, "phrase": "network_design_research"}, {"score": 0.003579179502431823, "phrase": "traditional_network_design_results"}, {"score": 0.003276321257403678, "phrase": "bi-level_optimization_problem"}, {"score": 0.0031148723927633955, "phrase": "genetic_algorithm"}, {"score": 0.00301801991152303, "phrase": "demand_uncertainty"}, {"score": 0.0027278178983579085, "phrase": "criteria_air_pollutants"}, {"score": 0.002576988153314685, "phrase": "road_network"}, {"score": 0.002419136901298873, "phrase": "optimization_problem"}, {"score": 0.0021453112313233554, "phrase": "capacity_additions"}, {"score": 0.0021049977753042253, "phrase": "vehicle_emissions"}], "paper_keywords": [""], "paper_abstract": "Traditionally, transportation road networks are designed for minimal congestion. Unfortunately, such approaches do not guarantee minimal vehicle emissions. To fill this apparent gap in network design research, an emissions network design problem and solution method is proposed in this article for the purposes of comparing to the traditional network design results. Three air pollutants are considered on two road networks. The model is formulated as a bi-level optimization problem and a solution is approximated using a genetic algorithm. The influence of demand uncertainty is also incorporated into the model. Designing for minimal congestion tends to increase emissions of criteria air pollutants. However, not adding capacity to a road network also increases emissions of pollutants. Therefore, an optimization problem and solution method, such as the emissions network design problem and solution method presented here, is useful for identifying capacity additions that reduce vehicle emissions. It is also useful for understanding the tradeoffs between designing a network for minimal congestion versus minimal vehicle emissions.", "paper_title": "Comparing Delay Minimization and Emissions Minimization in the Network Design Problem", "paper_id": "WOS:000301234800005"}