{"auto_keywords": [{"score": 0.04383078644467654, "phrase": "security_and_audit_measures"}, {"score": 0.043284735713932605, "phrase": "early_stages"}, {"score": 0.00481495049065317, "phrase": "secure_data_warehouses"}, {"score": 0.0038906171474520756, "phrase": "standard_framework"}, {"score": 0.0038568987435766014, "phrase": "software_development"}, {"score": 0.003340768341189764, "phrase": "platform_independent_models"}, {"score": 0.003115908199991072, "phrase": "new_framework"}, {"score": 0.003048782877550259, "phrase": "secure_dws"}, {"score": 0.0029830992938695007, "phrase": "qvt"}, {"score": 0.002806595775343074, "phrase": "security_measures"}, {"score": 0.0026062133750675894, "phrase": "conceptual_and_logical_levels"}, {"score": 0.002357632753637638, "phrase": "security_rules"}, {"score": 0.0022768346311104735, "phrase": "final_implementation"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["Data Warehousing", " Security", " MDA", " QVT"], "paper_abstract": "The Data Warehouse (DW) design is based on multidimensional ( MD) modeling which structures information into facts and dimensions. Due to the confidentiality of the data that it stores, it is crucial to specify security and audit measures from the early stages of design and to enforce them throughout the lifecycle. Moreover, the standard framework for software development, Model Driven Architecture (MDA), allows us to de. ne transformations between models by proposing Query/View/Transformations (QVT). This proposal permits the definition of formal, elegant and unequivocal transformations between Platform Independent Models (PIM) and Platform Specific Models (PSM). This paper introduces a new framework for the design of secure DWs based on MDA and QVT, which covers all the design phases (conceptual, logical and physical) and specifies security measures in all of them. We first define two metamodels with which to represent security and audit measures at the conceptual and logical levels. We then go on to de. ne a transformation between these models through which to obtain the traceability of the security rules from the early stages of development to the final implementation. Finally, in order to show the benefits of our proposal, it is applied to a case study.", "paper_title": "Designing Secure Data Warehouses by Using MDA and QVT", "paper_id": "WOS:000269283600004"}