{"auto_keywords": [{"score": 0.028002123242753744, "phrase": "gene_family"}, {"score": 0.00481495049065317, "phrase": "computational_complexity_point"}, {"score": 0.004628522534620679, "phrase": "computational_complexity"}, {"score": 0.004449280529563265, "phrase": "duplicated_genes"}, {"score": 0.004422325007817267, "phrase": "genomic_markers"}, {"score": 0.004303023184313407, "phrase": "whole_nuclear_genomes"}, {"score": 0.003384262486955773, "phrase": "classical_measures"}, {"score": 0.0031555744873774686, "phrase": "one-to-one_correspondence"}, {"score": 0.0028715299874549245, "phrase": "optimal_permutation"}, {"score": 0.0025578967205807843, "phrase": "maximal_correspondence"}, {"score": 0.0023849158959156026, "phrase": "common_intervals"}, {"score": 0.0023346456932139517, "phrase": "mad"}, {"score": 0.002203385580030364, "phrase": "optimal_correspondence"}, {"score": 0.002190900339168183, "phrase": "np"}, {"score": 0.002124318196932935, "phrase": "mad_number"}, {"score": 0.0021049977753042253, "phrase": "sad_number"}], "paper_keywords": ["comparative genomics", " computational complexity", " common intervals", " maximum adjacency disruption number", " summed adjacency disruption number"], "paper_abstract": "In this paper, we are interested in the computational complexity of computing (dis) similarity measures between two genomes when they contain duplicated genes or genomic markers, a problem that happens frequently when comparing whole nuclear genomes. Recently, several methods [1], [2] have been proposed that are based on two steps to compute a given (dis) similarity measure M between two genomes G(1) and G(2): First, one establishes a one-to-one correspondence between the genes of G1 and the genes of G2; second, once this correspondence is established, it explicitly defines a permutation and it is then possible to quantify their similarity using classical measures defined for permutations like the number of breakpoints. Hence, these methods rely on two elements: a way to establish a one-to-one correspondence between genes of a pair of genomes and a (dis) similarity measure for permutations. The problem is then, given a (dis) imilarity measure for permutations, compute a correspondence that defines an optimal permutation for this measure. We are interested here in two models to compute a one-to-one correspondence: the exemplar model, where all but one copy is deleted in both genomes for each gene family, and the matching model, which computes a maximal correspondence for each gene family. We show that, for these two models and for three (dis) similarity measures on permutations, namely, the number of common intervals, the maximum adjacency disruption (MAD) number, and the summed adjacency disruption (SAD) number, the problem of computing an optimal correspondence is NP-complete and even APX-hard for the MAD number and the SAD number.", "paper_title": "Comparing Genomes with duplications: A computational complexity point of view", "paper_id": "WOS:000250516700003"}