{"auto_keywords": [{"score": 0.04938419617030255, "phrase": "structurally_diverse_compounds"}, {"score": 0.0414419381400303, "phrase": "molecular_size"}, {"score": 0.004642105253191792, "phrase": "quantitative_structure-activity_relationship_analysis"}, {"score": 0.004190305872545087, "phrase": "bilinear_approach"}, {"score": 0.003866268750750096, "phrase": "indicator_variable"}, {"score": 0.0033890026927890058, "phrase": "inhibitory_activity"}, {"score": 0.0032671775301001513, "phrase": "clear_evidence"}, {"score": 0.00284275228258112, "phrase": "optimal_size"}, {"score": 0.002622647280008795, "phrase": "activity-limiting_role"}, {"score": 0.002473325513637559, "phrase": "large_dataset"}, {"score": 0.002136087390959268, "phrase": "starting_point"}], "paper_keywords": ["Cytochromes", " Metabolism", " Molecular modeling", " Structure-activity relationships"], "paper_abstract": "A quantitative structure-activity relationship analysis of the inhibitory activity of structurally diverse compounds on recombinant human CYP3A4 is presented using a bilinear approach based on our previously developed Lin-BiExp model. Using only two main descriptors, molecular size and an indicator variable for the presence of triazole/imidazole moieties, this approach can account for close to 65% of the variability in the inhibitory activity of more than 70 compounds and provides clear evidence that molecular size plays an important, but nonlinear role. Strongest inhibitory activity is likely to occur for compounds close to an optimal size, which is roughly that of the well-know CYP3A4-inhibitor ketoconazole. The activity-limiting role of size was also confirmed on a large dataset of 3438 compounds (PubChem Bioassay AID 884). This model provides a simple, intuitive interpretation and can serve as the starting point for more complex descriptions of the CYP3A4 inhibitory activity.", "paper_title": "Bilinear Model for the Size-Dependency of the CYP3A4 Inhibitory Activity of Structurally Diverse Compounds", "paper_id": "WOS:000346768100002"}