{"auto_keywords": [{"score": 0.03982569637126584, "phrase": "ide_users"}, {"score": 0.00481495049065317, "phrase": "tool_integration"}, {"score": 0.004744748477093856, "phrase": "integrating_tools"}, {"score": 0.004641351004344458, "phrase": "complex_and_time-consuming_activity"}, {"score": 0.004506968388996092, "phrase": "deep_understanding"}, {"score": 0.004360412703519539, "phrase": "successful_completion"}, {"score": 0.0038624981944755813, "phrase": "automated_tool_integration"}, {"score": 0.003371300958051179, "phrase": "mash"}, {"score": 0.00327356326590461, "phrase": "task-based_plug-ins"}, {"score": 0.003019121766552419, "phrase": "executable_tasks"}, {"score": 0.0028675712105299496, "phrase": "multiple_tools"}, {"score": 0.0027844017803674444, "phrase": "regular_plug-ins"}, {"score": 0.0023507916951658455, "phrase": "plug-ins_api"}, {"score": 0.0023249757987087055, "phrase": "significant_effort"}, {"score": 0.0022825763382627443, "phrase": "additional_plug-ins"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["software engineering", " tool integration", " plug-in architecture", " visual languages", " workflow", " MASH"], "paper_abstract": "Integrating tools implemented as plug-ins is a complex and time-consuming activity that requires good programming skills and a deep understanding of the underlying plug-in architecture for successful completion. Even when tools are implemented as plug-ins for a same integrated development environment (IDE), users frequently prefer to manually perform the same inefficient operations every time they use the tools rather than implementing automated tool integration.In our vision, IDE users must be able to flexibly execute plug-ins and easily integrate their results by designing workflows that can be persisted, automatically executed, and reused in other workflows.This paper therefore presents MASH, a framework that extends IDEs with task-based plug-ins (TB-plug-ins) and workflows. A TB-plug-in is a plug-in that exposes its functionalities as executable tasks in a workflow. TB-plug-in workflows are processes that automatically execute multiple tools and integrate their results. IDE users can turn regular plug-ins into TB-plug-ins by writing simple scripts or using the GUI capturing feature that MASH offers.We validated our idea with two case studies examining the design of two data-driven analyses as tool integration. We discovered that workflows can be easily designed by knowing little about the IDE or plug-ins API, saving significant effort otherwise devoted to implementing additional plug-ins and glue code, and they produce analyses that can be quickly modified and reused. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "MASH: tool integration made easy", "paper_id": "WOS:000316619200004"}