{"auto_keywords": [{"score": 0.008713768692145013, "phrase": "web_services"}, {"score": 0.007842856012835618, "phrase": "protection_objects"}, {"score": 0.007792940365423467, "phrase": "negotiation_capabilities"}, {"score": 0.0067280350627658215, "phrase": "service_class"}, {"score": 0.00599656672646745, "phrase": "identity_attributes"}, {"score": 0.004723322467153553, "phrase": "innovative_access_control_model"}, {"score": 0.004648292940755605, "phrase": "web_service_access_control_version"}, {"score": 0.004359853990466236, "phrase": "flexible_granularity"}, {"score": 0.0041419901614217275, "phrase": "single_service"}, {"score": 0.0038973170902076707, "phrase": "fine_access_control_granularity"}, {"score": 0.0038353580177342118, "phrase": "coarse_granularities"}, {"score": 0.0032777653153451265, "phrase": "service_parameters"}, {"score": 0.003025197043767572, "phrase": "access_control_policy_model"}, {"score": 0.002703869368554536, "phrase": "context_parameters"}, {"score": 0.0025933911051831456, "phrase": "actual_submission"}, {"score": 0.002527654365712841, "phrase": "negotiation_process"}, {"score": 0.002244596395352896, "phrase": "formal_definitions"}, {"score": 0.002208853811052348, "phrase": "relevant_algorithms"}, {"score": 0.002173679145840769, "phrase": "access_control_algorithm"}], "paper_keywords": ["access control", " authorization", " security", " trust negotiation", " WSDL"], "paper_abstract": "This paper presents an innovative access control model, referred to as Web service Access Control Version 1 (Ws-AC1), specifically tailored to Web services. The most distinguishing features of this model are the flexible granularity in protection objects and negotiation capabilities. Under Ws-AC1, an authorization can be associated with a single service and can speck for which parameter values the service can be authorized for use, thus providing a fine access control granularity. Ws-AC1 also supports coarse granularities in protection objects in that it provides the notion of service class under which several services can be grouped. Authorizations can then be associated with a service class and automatically propagated to each element in the class. The negotiation capabilities of Ws-AC1 are related to the negotiation of identity attributes and the service parameters. Identity attributes refer to information that a party requesting a service may need to submit in order to obtain the service. The access control policy model of Ws-AC1 supports the specification of policies in which conditions are stated, specifying the identity attributes to be provided and constraints on their values. In addition, conditions may also be specified against context parameters, such as time. To enhance privacy and security, the actual submission of these identity attributes is executed through a negotiation process. Parameters may also be negotiated when a subject requires use of a service with certain parameters values that, however, are not authorized under the policies in place. In this paper, we provide the formal definitions underlying our model and the relevant algorithms, such as the access control algorithm. We also present an encoding of our model in the Web Services Description Language (WSDL) standard for which we develop an extension, required to support Ws-AC1.", "paper_title": "An adaptive access control model for Web services", "paper_id": "WOS:000240952000003"}