{"auto_keywords": [{"score": 0.04514885700357803, "phrase": "wireless_mesh_networks"}, {"score": 0.03222741375320347, "phrase": "routing_metrics"}, {"score": 0.004814963363059512, "phrase": "cross-layer"}, {"score": 0.004738325072560588, "phrase": "mesh_networks"}, {"score": 0.00440825801245188, "phrase": "physical_layer"}, {"score": 0.004234884779773412, "phrase": "routing_process"}, {"score": 0.0041842092128678105, "phrase": "correct_selection"}, {"score": 0.003923965929636472, "phrase": "wireless_multi-hop_mesh_routing"}, {"score": 0.0038152404172111815, "phrase": "new_taxonomy"}, {"score": 0.003478694092089197, "phrase": "cross-layer_routing_metrics"}, {"score": 0.0033822643082593285, "phrase": "simulation_study"}, {"score": 0.00313381509703092, "phrase": "voice"}, {"score": 0.0028342734482926677, "phrase": "simulation_results"}, {"score": 0.0026577673946415583, "phrase": "stability_evaluation_parameters"}, {"score": 0.002615381301695394, "phrase": "user-perception_parameters"}, {"score": 0.0024230746206056536, "phrase": "application_performance"}, {"score": 0.0022904619303011097, "phrase": "future_research"}, {"score": 0.0022268964676199292, "phrase": "open_issues"}, {"score": 0.0021050078070343043, "phrase": "elsevier"}], "paper_keywords": ["Wireless mesh networks", " Cross-layer routing metrics", " Performance evaluation", " VoIP application"], "paper_abstract": "Despite efforts to improve the current IEEE 802.11 standard to fully optimize the physical layer, the performance of wireless mesh networks still depends on the routing process for a correct selection of routes. With regard to this question, several cross-layer routing metrics have been developed to improve wireless multi-hop mesh routing. This paper sets out a new taxonomy that can be used to help understand, classify and compare the state-of-the-art situation with regard to cross-layer routing metrics for wireless mesh networks. A simulation study has been carried out to evaluate the capability of the most recent and promising cross-layer routing metrics to support multimedia applications, such as Voice over IP. The evaluation of the routing metrics has been undertaken from three main perspectives: user perception, network performance, and routing stability. The simulation results show that the impact of routing metrics is more noticeable on the network and routing stability evaluation parameters than on the user-perception parameters. Furthermore, the results show that the routing metrics, the level of stability attained, and the application performance are interdependent. Finally, there is a discussion of the direction that future research might take with regard to some open issues in the design of routing metrics for wireless mesh networks. (C) 2010 Elsevier By. All rights reserved.", "paper_title": "Cross-layer routing metrics for mesh networks: Current status and research directions", "paper_id": "WOS:000288926000001"}