{"auto_keywords": [{"score": 0.04784874064207587, "phrase": "numerical_ratings"}, {"score": 0.009991671634630862, "phrase": "sentiment_analysis"}, {"score": 0.006898227111794687, "phrase": "actual_ratings"}, {"score": 0.00481495049065317, "phrase": "sentiment_analysis_services"}, {"score": 0.004776853267973129, "phrase": "purpose_-_the_purpose"}, {"score": 0.004325208730208653, "phrase": "seven_cities"}, {"score": 0.004223299391912042, "phrase": "tripadvisor_web_site"}, {"score": 0.003978866233891427, "phrase": "positive_reviews"}, {"score": 0.0033937776228549557, "phrase": "reasonable_agreement"}, {"score": 0.0029762350325031207, "phrase": "unstructured_qualitative_data"}, {"score": 0.00295264307195965, "phrase": "user_opinion"}, {"score": 0.0029292375702719494, "phrase": "quantitative_ratings"}, {"score": 0.0029060170624404242, "phrase": "current_tools"}, {"score": 0.002814956065949522, "phrase": "user_reviews"}, {"score": 0.0027485326424697095, "phrase": "web_sites"}, {"score": 0.0026307897899760383, "phrase": "traveler_forums"}, {"score": 0.00252812242767189, "phrase": "potential_users"}, {"score": 0.002372103459168231, "phrase": "future_improvement"}, {"score": 0.0023532890136269986, "phrase": "opinion_mining_and_prediction_techniques"}, {"score": 0.0022434880661725493, "phrase": "hotels'_reviews"}], "paper_keywords": ["Sentiment analysis", " Consumer-generated content", " Intra-class correlation", " Opinion mining", " TripAdvisor reviews"], "paper_abstract": "Purpose - The purpose of this paper is to assess the reliability of numerical ratings of hotels calculated by three sentiment analysis algorithms. Design/methodology/approach - More than one million reviews and numerical ratings of hotels in seven cities in four countries were extracted from TripAdvisor web site. Reviews were classified as positive or negative using three sentiment analysis tools. The percentage of positive reviews was used to predict numerical ratings that were then compared with actual ratings. Findings - All tools classified reviews as positive or negative in a way that correlated positively with numerical ratings. More complex algorithms worked better, yet predicted ratings showed reasonable agreement with actual ratings for most cities. Predictions for hotels were less reliable if based on less than 50-60 percent of available reviews. Practical implications - These results validate that sentiment analysis can be used to transform unstructured qualitative data on user opinion into quantitative ratings. Current tools may be useful for summarizing opinions of user reviews of products and services on web sites that do not require users to post numerical ratings such as traveler forums. This summarizing may be valuable not just to potential users, but also to the service and product providers and offers validation and benchmarking for future improvement of opinion mining and prediction techniques. Originality/value - This work assesses the correlation between sentiment analysis of hotels' reviews and their actual ratings. The authors also evaluated the reliability of results of sentiment analysis calculated by three different algorithms.", "paper_title": "Evaluating hotels rating prediction based on sentiment analysis services", "paper_id": "WOS:000359044400002"}