{"auto_keywords": [{"score": 0.04964317542118527, "phrase": "counting_constraint_satisfaction_problem"}, {"score": 0.03904697734309423, "phrase": "graph_homomorphisms"}, {"score": 0.0326089490948244, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "dichotomy_theorem"}, {"score": 0.0038538647865057757, "phrase": "general_framework"}, {"score": 0.003830416706816913, "phrase": "numerous_counting_combinatorial_problems"}, {"score": 0.003749462025612395, "phrase": "propositional_formula"}, {"score": 0.003379859206640552, "phrase": "systematic_study"}, {"score": 0.0032483404695661296, "phrase": "ultimate_goal"}, {"score": 0.003169954314343514, "phrase": "restricted_subclasses"}, {"score": 0.0029279904732574438, "phrase": "finite_domain"}, {"score": 0.0028312491793328043, "phrase": "allowed_constraints"}, {"score": 0.002771352849127134, "phrase": "decision_constraint_satisfaction_problem"}, {"score": 0.002505569496201773, "phrase": "mal'tsev_polymorphism"}, {"score": 0.0024675803902400916, "phrase": "ternary_operation"}, {"score": 0.0021970315630373493, "phrase": "dichotomy_results"}, {"score": 0.0021049977753042253, "phrase": "new_results"}], "paper_keywords": ["constraint satisfaction problem", " counting problems", " complexity"], "paper_abstract": "The counting constraint satisfaction problem (#CSP) can be expressed as follows: given a set or variables, a set of values that can be taken by the variables, and a set of constraints specifying some restrictions on the values that can be taken simultaneously by some variables, determine the number of assignments of values to variables that satisfy all the constraints. The #CSP provides a general framework for numerous counting combinatorial problems including counting satisfying assignments to a propositional formula, counting graph homomorphisms, graph reliability and many others. This problem can be parametrized by the set of relations that may appear in a constraint. In this paper we start a systematic Study of subclasses of the #CSP restricted in this way. The ultimate goal of this investigation is to distinguish those restricted subclasses of the #CSP which are solvable in polynomial time from those which are not. We show that the complexity of any restricted #CSP class on a finite domain can be deduced from the properties of polymorphisms of the allowed constraints, similar to that for the decision constraint satisfaction problem. Then we prove that if a subclass of the #CSP is solvable in polynomial time, then constraints allowed by the class satisfy some very restrictive condition: they need to have a Mal'tsev polymorphism, that is a ternary operation m(x,y,z) such that m(x, y, y) = m(y, y,x) = x. This condition uniformly explains many existing complexity results for particular cases of the #CSP, including the dichotomy results for the problem of counting graph homomorphisms, and it allows us to obtain new results. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Towards a dichotomy theorem for the counting constraint satisfaction problem", "paper_id": "WOS:000246240500001"}