{"auto_keywords": [{"score": 0.0488492843865137, "phrase": "follow-up_providers"}, {"score": 0.010612387000973441, "phrase": "existing_emr_data"}, {"score": 0.0042550030421781605, "phrase": "retrospective_analysis"}, {"score": 0.004039094712469991, "phrase": "inpatient_and_ed_encounters"}, {"score": 0.003859146369720225, "phrase": "related_outpatient_data"}, {"score": 0.0037599278182081056, "phrase": "positive_predictive_value"}, {"score": 0.0035458802311188497, "phrase": "eight_predictors"}, {"score": 0.0032157824854214313, "phrase": "longitudinal_patient_care_records"}, {"score": 0.002878556952876824, "phrase": "primary_care_provider_data"}, {"score": 0.002679386232765167, "phrase": "patient's_past_appointment_history"}, {"score": 0.002413964586947992, "phrase": "inpatient_visits"}, {"score": 0.002336527289457915, "phrase": "emergency_department_visits"}, {"score": 0.0022615684627308283, "phrase": "even_the_best_performing_predictors"}], "paper_keywords": [""], "paper_abstract": "In order to evaluate the accuracy of existing EMR data in predicting follow-up providers, a retrospective analysis was performed on six months of data for inpatient and ED encounters occurring at two hospitals, and on related outpatient data. Sensitivity and Positive Predictive Value (PPV) were calculated for each of eight predictors, to determine their effectiveness in predicting follow-up providers. Our findings indicate that access to longitudinal patient care records can improve prediction of which providers a patient is likely to see post-discharge compared to simply using Primary Care Provider data from admissions records. Of the predictors evaluated, a patient's past appointment history was the best predictor of which providers they would see in the future (PPV = 48%, following inpatient visits, 35%, following emergency department visits). However, even the best performing predictors failed to predict more than half of the follow-up providers and might generate many \"false\" alerts.", "paper_title": "Evaluating the Accuracy of Existing EMR Data as Predictors of Follow-up Providers", "paper_id": "WOS:000260905500013"}