{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multivariate_volumetric_data"}, {"score": 0.0047283116134926645, "phrase": "multivariate_data"}, {"score": 0.004664352260912174, "phrase": "great_importance"}, {"score": 0.0041827333568982055, "phrase": "simultaneous_real-time_visualization"}, {"score": 0.0037848978618663684, "phrase": "regular_transfer_function"}, {"score": 0.0034093015000258163, "phrase": "gabor"}, {"score": 0.0033175095965171674, "phrase": "high-frequency_redistribution_pattern"}, {"score": 0.003257727050827128, "phrase": "opacity_mapping_function"}, {"score": 0.0031556799865964974, "phrase": "available_space"}, {"score": 0.0031129269142224194, "phrase": "displayed_data_attributes"}, {"score": 0.0030707512751243214, "phrase": "mapping_function"}, {"score": 0.002934237411711622, "phrase": "transparent_regions"}, {"score": 0.002778385486855157, "phrase": "different_example_applications"}, {"score": 0.0026069623057065664, "phrase": "controlled_user_study"}, {"score": 0.0024129269611844794, "phrase": "exact_data_values"}, {"score": 0.002305589818994465, "phrase": "data_values"}, {"score": 0.0022847009758393405, "phrase": "high_subjective_ranking"}, {"score": 0.002203016940021265, "phrase": "high_chance"}], "paper_keywords": ["Volume rendering", " multi-variate data visualization", " multi-volume rendering", " scientific visualization"], "paper_abstract": "Analysis of multivariate data is of great importance in many scientific disciplines. However, visualization of 3D spatially-fixed multivariate volumetric data is a very challenging task. In this paper we present a method that allows simultaneous real-time visualization of multivariate data. We redistribute the opacity within a voxel to improve the readability of the color defined by a regular transfer function, and to maintain the see-through capabilities of volume rendering. We use predictable procedural noise - random-phase Gabor noise - to generate a high-frequency redistribution pattern and construct an opacity mapping function, which allows to partition the available space among the displayed data attributes. This mapping function is appropriately filtered to avoid aliasing, while maintaining transparent regions. We show the usefulness of our approach on various data sets and with different example applications. Furthermore, we evaluate our method by comparing it to other visualization techniques in a controlled user study. Overall, the results of our study indicate that users are much more accurate in determining exact data values with our novel 3D volume visualization method. Significantly lower error rates for reading data values and high subjective ranking of our method imply that it has a high chance of being adopted for the purpose of visualization of multivariate 3D data.", "paper_title": "Noise-Based Volume Rendering for the Visualization of Multivariate Volumetric Data", "paper_id": "WOS:000325991600098"}