{"auto_keywords": [{"score": 0.04961049691122093, "phrase": "orthogonal_components"}, {"score": 0.015719716506582538, "phrase": "generalized_regression"}, {"score": 0.004698000536608171, "phrase": "r_package_groc"}, {"score": 0.004450568197899267, "phrase": "q_responses"}, {"score": 0.004342430078306461, "phrase": "p_predictors"}, {"score": 0.004278807087784626, "phrase": "primary_building_block"}, {"score": 0.004216112320418982, "phrase": "grid_algorithm"}, {"score": 0.0036914757355166966, "phrase": "dependence_measure"}, {"score": 0.003445591238183763, "phrase": "first_component"}, {"score": 0.0033617891884360606, "phrase": "smooth_fit"}, {"score": 0.003247868216333148, "phrase": "second_component"}, {"score": 0.0027334673433027086, "phrase": "package_groc"}, {"score": 0.002323142666222693, "phrase": "model_selection"}, {"score": 0.0021682027434117095, "phrase": "predicted_residual_error_sum"}, {"score": 0.0021154027872650727, "phrase": "predicted_residual_error"}, {"score": 0.0021049977753042253, "phrase": "median_absolute_deviation"}], "paper_keywords": ["C plus", " correlation", " dependence", " nonparametric", " partial least squares", " R", " regression"], "paper_abstract": "The R package groc for generalized regression on orthogonal components contains functions for the prediction of q responses using a set of p predictors. The primary building block is the grid algorithm used to search for components(projections of the data) which are most dependent on the response. The package offers flexibility in the choice of the dependence measure which can be user-de fined. The components are found sequentially. A first component is obtained and a smooth fit produces residuals. Then, a second component orthogonal to the first is found which is most dependent on the residuals, and so on. The package can handle models with more than one response. A panoply of models can be achieved through package groc : robust multiple or multivariate linear regression, nonparametric regression on orthogonal components, and classical or robust partial least squares models. Functions for predictions and cross-validation are available and helpful in model selection. The merit of a fit through cross-validation can be assessed with the predicted residual error sum of squares or the predicted residual error median absolute deviation which is more appropriate in the presence of outliers.", "paper_title": "The R Package groc for Generalized Regression on Orthogonal Components", "paper_id": "WOS:000365973600001"}