{"auto_keywords": [{"score": 0.049324540543845156, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.00815897872368481, "phrase": "similarity_measures"}, {"score": 0.0045545270053234275, "phrase": "upper"}, {"score": 0.0044826811976193485, "phrase": "middle_fuzzy"}, {"score": 0.004206548500039536, "phrase": "important_measure"}, {"score": 0.004074901471704325, "phrase": "similarity_degree"}, {"score": 0.003373513029006116, "phrase": "original_similarity_measures"}, {"score": 0.003313741359811683, "phrase": "proposed_construction_method"}, {"score": 0.00252812242767189, "phrase": "better_similarities"}, {"score": 0.002429451930463481, "phrase": "construction_efficiency"}, {"score": 0.002316105585203396, "phrase": "reconstructed_measures"}, {"score": 0.0021559025985688255, "phrase": "comparison_results"}], "paper_keywords": ["Fuzzy set", " intuitionistic fuzzy set", " similarity measure", " lower", " upper and middle fuzzy sets"], "paper_abstract": "Similarity of intuitionistic fuzzy sets is an important measure to indicate the similarity degree between intuitionistic fuzzy sets. Based on the information carried by transforming intuitionistic fuzzy sets into their lower, upper and middle fuzzy sets, we propose a new construction for similarity measures between intuitionistic fuzzy sets. The proposed construction method on similarity measures between intuitionistic fuzzy sets satisfies the definition of a similarity between intuitionistic fuzzy sets. Moreover, we can reconstruct most existing similarity measures between intuitionistic fuzzy sets based on our new construction technique so that they can improve these original similarity measures to be better similarities. To demonstrate this construction efficiency, the comparisons of these reconstructed measures with original similarity measures between intuitionistic fuzzy sets are made. The comparison results show that our construction methods actually improve most existing similarity measures between intuitionistic fuzzy sets.", "paper_title": "New Construction for Similarity Measures between Intuitionistic Fuzzy Sets Based on Lower, Upper and Middle Fuzzy Sets", "paper_id": "WOS:000326065100010"}