{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genomic_predictors"}, {"score": 0.004781215097314411, "phrase": "anticancer_drug_sensitivity"}, {"score": 0.004747714939490445, "phrase": "background_an_enduring_challenge"}, {"score": 0.004616034337089482, "phrase": "right_drug"}, {"score": 0.004567596860086148, "phrase": "individual_patient"}, {"score": 0.004425299304063172, "phrase": "large_trials"}, {"score": 0.0040102178375662914, "phrase": "preclinical_model_systems"}, {"score": 0.00376409764683147, "phrase": "multiple_cell_lines"}, {"score": 0.00371148138781691, "phrase": "methods_two_large-scale_pharmacogenomic_studies"}, {"score": 0.003434922209075514, "phrase": "drug_response"}, {"score": 0.0033868916699805224, "phrase": "five_different_approaches"}, {"score": 0.0033277936960179892, "phrase": "increasing_complexity"}, {"score": 0.00304737045343781, "phrase": "cell_lines"}, {"score": 0.0029627094945653427, "phrase": "training_phase"}, {"score": 0.002931569771634119, "phrase": "sixteen_drugs"}, {"score": 0.002790511479398411, "phrase": "multivariate_predictors"}, {"score": 0.0024581013157048926, "phrase": "expression_level"}, {"score": 0.00243225236680506, "phrase": "single_gene"}, {"score": 0.0023070189467375374, "phrase": "specific_drugs"}, {"score": 0.002258745901862197, "phrase": "patients'_tumor_cells"}, {"score": 0.0022192891418394514, "phrase": "clinical_trials"}, {"score": 0.00217284779477444, "phrase": "companion_tests"}, {"score": 0.0021499920551456956, "phrase": "corresponding_drugs"}, {"score": 0.0021198904828154657, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "personalized_medicine"}], "paper_keywords": [""], "paper_abstract": "Background An enduring challenge in personalized medicine lies in selecting the right drug for each individual patient. While testing of drugs on patients in large trials is the only way to assess their clinical efficacy and toxicity, we dramatically lack resources to test the hundreds of drugs currently under development. Therefore the use of preclinical model systems has been intensively investigated as this approach enables response to hundreds of drugs to be tested in multiple cell lines in parallel. Methods Two large-scale pharmacogenomic studies recently screened multiple anticancer drugs on over 1000 cell lines. We propose to combine these datasets to build and robustly validate genomic predictors of drug response. We compared five different approaches for building predictors of increasing complexity. We assessed their performance in cross-validation and in two large validation sets, one containing the same cell lines present in the training set and another dataset composed of cell lines that have never been used during the training phase. Results Sixteen drugs were found in common between the datasets. We were able to validate multivariate predictors for three out of the 16 tested drugs, namely irinotecan, PD-0325901, and PLX4720. Moreover, we observed that response to 17-AAG, an inhibitor of Hsp90, could be efficiently predicted by the expression level of a single gene, NQO1. Conclusion These results suggest that genomic predictors could be robustly validated for specific drugs. If successfully validated in patients' tumor cells, and subsequently in clinical trials, they could act as companion tests for the corresponding drugs and play an important role in personalized medicine.", "paper_title": "Comparison and validation of genomic predictors for anticancer drug sensitivity", "paper_id": "WOS:000320168600002"}