{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "encryption_and_secret_sharing"}, {"score": 0.004567596860086148, "phrase": "secret_sharing"}, {"score": 0.004358368398332723, "phrase": "perfect_randomness"}, {"score": 0.0040622852274783275, "phrase": "weaker_assumptions"}, {"score": 0.0038085117064624208, "phrase": "secure_cryptographic_primitives"}, {"score": 0.00376409764683147, "phrase": "imperfect_random_sources"}, {"score": 0.0036984471692451198, "phrase": "dodis"}, {"score": 0.0036553532565937307, "phrase": "spencer"}, {"score": 0.0033277936960179892, "phrase": "perfect_encryption"}, {"score": 0.0030833537429977797, "phrase": "even_a_single_weakly_random_bit"}, {"score": 0.0027417911324611917, "phrase": "cornputational_settings"}, {"score": 0.002570296816631395, "phrase": "one-bit_encryption"}, {"score": 0.0023124457559811087, "phrase": "high-entropy_sources"}], "paper_keywords": [""], "paper_abstract": "Most cryptographic primitives such as encryption, authentication or secret sharing require randomness. Usually one assumes that perfect randomness is available, but those primitives might also be realized under weaker assumptions. In this work we continue the study of building secure cryptographic primitives from imperfect random sources initiated by Dodis and Spencer (FOCS'02). Their main result shows that there exists a (high-entropy) source of randomness allowing for perfect encryption of a bit, and yet from which one cannot extract even a single weakly random bit, separating encryption from extraction. Our main result separates encryption from 2-out-2 secret sharing (both in the information-theoretic and in the cornputational settings): any source which can be used to achieve one-bit encryption also can be used for 2-out-2 secret sharing of one bit, but the converse is false, even for high-entropy sources. Therefore, possibility of extraction strictly implies encryption, which in turn strictly implies 2-out-2 secret shaxing.", "paper_title": "Separating sources for encryption and secret sharing", "paper_id": "WOS:000236909300031"}