{"auto_keywords": [{"score": 0.04976102042618512, "phrase": "disaster_monitoring"}, {"score": 0.00481495049065317, "phrase": "grid_structure"}, {"score": 0.004610887833416857, "phrase": "taiwan"}, {"score": 0.00448958076531243, "phrase": "overall_monitoring"}, {"score": 0.004342430078306461, "phrase": "different_organizations"}, {"score": 0.003981928669805484, "phrase": "site_investigation"}, {"score": 0.003687960013746783, "phrase": "heterogeneous_data"}, {"score": 0.0036028592508983402, "phrase": "consistent_communication_interface"}, {"score": 0.0030189426536422577, "phrase": "valuable_information"}, {"score": 0.0029988599391845517, "phrase": "value-added_applications"}, {"score": 0.0027587851842693725, "phrase": "international_standards"}, {"score": 0.002704079288159013, "phrase": "grid_computing"}, {"score": 0.002668211079063252, "phrase": "large-scale_modifications"}, {"score": 0.0025978919678702793, "phrase": "different_purposes"}, {"score": 0.002529421374791293, "phrase": "emerging_grid_technology"}, {"score": 0.0024958641143547856, "phrase": "grid-based_disaster_management_mechanism"}, {"score": 0.002389839896897424, "phrase": "stockpile_distribution"}, {"score": 0.0023739321566540682, "phrase": "delivery_routes"}, {"score": 0.0023502683992739845, "phrase": "sensor_grid"}, {"score": 0.0023346234464901978, "phrase": "application_grid"}, {"score": 0.0022730758011263318, "phrase": "real-time_traffic_information_systems"}, {"score": 0.002220551141101661, "phrase": "government's_abilities"}, {"score": 0.0021049977753042253, "phrase": "academic_units"}], "paper_keywords": ["Grid", " Disaster monitoring", " Remote sensing"], "paper_abstract": "Nowadays, the administration and execution of disaster monitoring in Taiwan are able to achieve the goal of overall monitoring with the assistance of various tools and technology distributed in different organizations. Examples of information and technology include the data collected by monitoring stations, existing database and spatial data warehouse, precipitation information provided by the Central Weather Bureau (CWB), results of site investigation, Remotely Piloted Vehicle (RPV) airscape images, aerial photos. satellite images, and etc. Therefore, in order to facilitate tasks of disaster monitoring, heterogeneous data needs to be integrated via a consistent communication interface. The use of grids was proposed to solve the problems in heterogeneity, distribution, and efficiency triggered by networking. Information worth sharing is uploaded to a platform which can publish and register data and control the flow of information; users then access the platform to search and fetch valuable information and Value-added applications. On the platform, all of the heterogeneous and distributed data is encrypted, decrypted, monitored, and hence interchangeable according to international standards. Because the employment of grid computing does not require large-scale modifications of existing systems, grids designed for different purposes are being developed. Our research adopts the emerging grid technology to create a grid-based disaster management mechanism. Taking disaster relief distribution as an example, we optimize the stockpile distribution and delivery routes by utilizing Sensor GRID and Application GRID and by combining the interpretation given by real-time traffic information systems. Our study will further the government's abilities to manage disasters, and substantially strengthen the cooperation and communication between the government and academic units. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The implementation of SOA within grid structure for disaster monitoring", "paper_id": "WOS:000263817100006"}