{"auto_keywords": [{"score": 0.04862271607252209, "phrase": "public_library"}, {"score": 0.01589860613769674, "phrase": "internet_access"}, {"score": 0.00481495049065317, "phrase": "youth's_use"}, {"score": 0.004388796812234033, "phrase": "impact_youth's_use"}, {"score": 0.003427246079774314, "phrase": "least_used_alternate_source"}, {"score": 0.0024957862318504753, "phrase": "diminished_youth's_need"}, {"score": 0.002410363090950055, "phrase": "personal_information"}, {"score": 0.0022481685132781626, "phrase": "school_work"}, {"score": 0.0021049977753042253, "phrase": "complementary_activities"}], "paper_keywords": [""], "paper_abstract": "A survey of 4,032 youth in grades 5 through 12 was conducted to determine the impact youth's use of the Internet was having on their use of the public library. Results indicated that 100% of the youth had access to the Internet from one or more locations, and that although one quarter of the youth accessed the Internet at the public library, the public library was the least frequently used source of Internet access. For youth without Internet access at home, the public library was also the least used alternate source of access. Approximately 69% of the youth reported that they had visited a public library during the school year. Having Internet access at home did not affect whether or not youth visited the library; however, Internet access at home appears to have affected the frequency with which youth visit the library. Youth without Internet access at home visited the library more frequently, whereas youth with Internet access at home visited the library less frequently. Use of the Internet also appeared to have diminished youth's need to use the public library as a source of personal information; however, use of the Internet appeared not to have affected their use of the public library for school work or for recreation. Among youth, use of both the Internet and the public library appear to be complementary activities.", "paper_title": "The impact of youth's use of the internet on their use of the public library", "paper_id": "WOS:000251377600003"}