{"auto_keywords": [{"score": 0.0450220742132993, "phrase": "gms"}, {"score": 0.010612372375642934, "phrase": "greedy_maximal_scheduling"}, {"score": 0.01052888964973598, "phrase": "local_pooling"}, {"score": 0.004682917599491709, "phrase": "efficient_operation"}, {"score": 0.004645860180714466, "phrase": "wireless_networks"}, {"score": 0.004156691746581458, "phrase": "maximum_possible_throughput"}, {"score": 0.003808619097554076, "phrase": "local_pooling_conditions"}, {"score": 0.003588100032858716, "phrase": "sigma-local_pooling_conditions"}, {"score": 0.0033668870709083884, "phrase": "specific_network_topologies"}, {"score": 0.0032099453192629976, "phrase": "first_characterization"}, {"score": 0.003109390330476147, "phrase": "primary_interference_constraints"}, {"score": 0.002917604283241353, "phrase": "linear-time_algorithm"}, {"score": 0.002882980094838904, "phrase": "local-pooling-satisfying_graphs"}, {"score": 0.002814956065949522, "phrase": "similar_graph-theoretical_methods"}, {"score": 0.002737615043512257, "phrase": "bipartite_graphs"}, {"score": 0.0023439376937579204, "phrase": "interference_graphs"}, {"score": 0.0021645053655350703, "phrase": "graph-theoretical_techniques"}, {"score": 0.0021049977753042253, "phrase": "greedy_scheduling_algorithms"}], "paper_keywords": ["Graph theory", " Local Pooling (LoP)", " scheduling", " switches", " throughput maximization", " wireless networks"], "paper_abstract": "Efficient operation of wireless networks and switches requires using simple (and in some cases distributed) scheduling algorithms. In general, simple greedy algorithms (known as Greedy Maximal Scheduling, or GMS) are guaranteed to achieve only a fraction of the maximum possible throughput (e. g., 50% throughput in switches). However, it was recently shown that in networks in which the Local Pooling conditions are satisfied, GMS achieves 100% throughput. Moreover, in networks in which the sigma-Local Pooling conditions hold, GMS achieves sigma% throughput. In this paper, we focus on identifying the specific network topologies that satisfy these conditions. In particular, we provide the first characterization of all the network graphs in which Local Pooling holds under primary interference constraints (in these networks, GMS achieves 100% throughput). This leads to a linear-time algorithm for identifying Local-Pooling-satisfying graphs. Moreover, by using similar graph-theoretical methods, we show that in all bipartite graphs (i.e., input-queued switches) of size up to 7 x n, GMS is guaranteed to achieve 66% throughput, thereby improving upon the previously known 50% lower bound. Finally, we study the performance of GMS in interference graphs and show that in certain specific topologies, its performance could be very bad. Overall, the paper demonstrates that using graph-theoretical techniques can significantly contribute to our understanding of greedy scheduling algorithms.", "paper_title": "Analyzing the Performance of Greedy Maximal Scheduling via Local Pooling and Graph Theory", "paper_id": "WOS:000300425000013"}