{"auto_keywords": [{"score": 0.030570347867177793, "phrase": "trustworthy_nodes"}, {"score": 0.02322730111336097, "phrase": "malicious_nodes"}, {"score": 0.010073016341361358, "phrase": "peer-based_monitoring"}, {"score": 0.00406001734835979, "phrase": "open_environment"}, {"score": 0.003468287913322255, "phrase": "malicious_actions"}, {"score": 0.002982068153662372, "phrase": "monitoring_messages"}, {"score": 0.0027200305495826797, "phrase": "multiple_trustworthy_nodes"}, {"score": 0.0025977542995083624, "phrase": "threaded_binary_tree"}, {"score": 0.0024007585788965655, "phrase": "load_balancing"}, {"score": 0.002218668420806254, "phrase": "high_accuracy"}, {"score": 0.002146926767291475, "phrase": "dynamic_redistribution_method"}, {"score": 0.0021049977753042253, "phrase": "good_load_balancing"}], "paper_keywords": ["Performance", " Design", " Malicious nodes", " peer monitoring", " peer-to-peer streaming"], "paper_abstract": "Current peer-to-peer (P2P) streaming systems often assume that nodes cooperate to upload and download data. However, in the open environment of the Internet, this is not necessarily true and there exist malicious nodes in the system. In this article, we study malicious actions of nodes that can be detected through peer-based monitoring. We require each node to monitor the data received and to periodically send monitoring messages about its neighbors to some trustworthy nodes. To efficiently store and search messages among multiple trustworthy nodes, we organize trustworthy nodes into a threaded binary tree. Trustworthy nodes also dynamically redistribute monitoring messages among themselves to achieve load balancing. Our simulation results show that this scheme can efficiently detect malicious nodes with high accuracy, and that the dynamic redistribution method can achieve good load balancing among trustworthy nodes.", "paper_title": "Detecting Malicious Nodes in Peer-to-Peer Streaming by Peer-Based Monitoring", "paper_id": "WOS:000276382700003"}