{"auto_keywords": [{"score": 0.020474702623274096, "phrase": "packet_loss"}, {"score": 0.01017042895820368, "phrase": "network_traffic_volatility"}, {"score": 0.008646444518435218, "phrase": "flc"}, {"score": 0.007271112526378386, "phrase": "superior_delivered_video_quality"}, {"score": 0.006261883463541377, "phrase": "congestion_control"}, {"score": 0.00481495049065317, "phrase": "video_streaming_across_ip_networks"}, {"score": 0.0047130539259566465, "phrase": "encoded_video_streaming"}, {"score": 0.0045764416357655735, "phrase": "associated_uncertainties"}, {"score": 0.00455202992136173, "phrase": "constant_adjustment"}, {"score": 0.004515655183335171, "phrase": "bit_rate"}, {"score": 0.00449156625373873, "phrase": "existing_solutions"}, {"score": 0.004145212745333947, "phrase": "major_problem"}, {"score": 0.003971502222405927, "phrase": "delivered_video"}, {"score": 0.003866635019383855, "phrase": "video_display_rates"}, {"score": 0.0035970695725014218, "phrase": "fuzzy_sets"}, {"score": 0.0034004242101610556, "phrase": "improved_performance"}, {"score": 0.003266558217364143, "phrase": "existing_traditional_controllers"}, {"score": 0.0031887735306340118, "phrase": "different_network_scenarios"}, {"score": 0.0030962064913500164, "phrase": "typical_internet_cross-traffic"}, {"score": 0.0030063184802762775, "phrase": "all-internet_protocol"}, {"score": 0.0029425839831784765, "phrase": "-ip_networks"}, {"score": 0.0029112237481352084, "phrase": "multimedia_traffic"}, {"score": 0.0027741761880779535, "phrase": "mixed_traffic_environment"}, {"score": 0.00264356311704594, "phrase": "internet_conditions"}, {"score": 0.002587499140336252, "phrase": "network_conditions"}, {"score": 0.0025667822592523267, "phrase": "all-ip_network"}, {"score": 0.002539416885365687, "phrase": "control_inputs"}, {"score": 0.0024524733595572084, "phrase": "magnitude_performance_improvement"}, {"score": 0.0023876198449811325, "phrase": "reduced_packet_loss"}, {"score": 0.0022935336076118696, "phrase": "established_criteria"}, {"score": 0.002238866955912704, "phrase": "fuzzy_logic_congestion_control"}, {"score": 0.002220935192287471, "phrase": "flexible_solution"}, {"score": 0.0021049977753042253, "phrase": "packet-switched_ip_networks"}], "paper_keywords": ["All-internet protocol (IP) network", " congestion control", " interval type-2 (IT2) fuzzy logic control", " video streaming"], "paper_abstract": "Intelligent congestion control is vital for encoded video streaming of a clip or film, as network traffic volatility and the associated uncertainties require constant adjustment of the bit rate. Existing solutions, including the standard Transmission Control Protocol (TCP) friendly rate control equation-based congestion controller, are prone to fluctuations in their sending rate and may respond only when packet loss has already occurred. This is a major problem, because both fluctuations and packet loss affect the end-user's perception of the delivered video. A type-1 (T1) fuzzy logic congestion controller (FLC) can operate at video display rates and can reduce packet loss and rate fluctuations, despite uncertainties in measurements of delay arising from congestion and network traffic volatility. However, a T1 FLC employing precise T1 fuzzy sets cannot fully cope with the uncertainties associated with such dynamic network environments. A type-2 FLC using type-2 fuzzy sets can handle such uncertainties to produce improved performance. This paper proposes an interval type-2 FLC that achieves a superior delivered video quality compared with existing traditional controllers and a T1 FLC. To show the response in different network scenarios, tests demonstrate the response both in the presence of typical Internet cross-traffic as well as when other video streams occupy a bottleneck on an All-internet protocol (IP) network. As All-IP networks are intended for multimedia traffic, it is important to develop a form of congestion control that can transfer to them from the mixed traffic environment of the Internet. It was found that the proposed type-2 FLC, although it is specifically designed for Internet conditions, can also successfully react to the network conditions of an All-IP network. When the control inputs were subject to noise, the type-2 FLC resulted in an order of magnitude performance improvement in comparison with the T1 FLC. The type-2 FLC also showed reduced packet loss when compared with the other controllers, again resulting in superior delivered video quality. When judged by established criteria, such as TCP-friendliness and delayed feedback, fuzzy logic congestion control offers a flexible solution to network bottlenecks. These findings offer the type-2 FLC as a way forward for congestion control of video streaming across packet-switched IP networks.", "paper_title": "Interval Type-2 Fuzzy Logic Congestion Control for Video Streaming Across IP Networks", "paper_id": "WOS:000270591900011"}