{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "incomplete_reciprocal_preference_relation"}, {"score": 0.012240848402994775, "phrase": "ordinal_consistency"}, {"score": 0.005737736353141594, "phrase": "proposed_algorithm"}, {"score": 0.004674952036988355, "phrase": "usual_weak_transitivity_condition"}, {"score": 0.004606479650820579, "phrase": "logical_and_consistent_person"}, {"score": 0.004385367803204002, "phrase": "inconsistent_opinions"}, {"score": 0.004257806363128601, "phrase": "minimum_requirement_condition"}, {"score": 0.004195418010131832, "phrase": "consistent_reciprocal_preference_relation"}, {"score": 0.004007197904248011, "phrase": "proposed_method"}, {"score": 0.0033452741392850523, "phrase": "incomplete_digraph"}, {"score": 0.0030464123943266673, "phrase": "inconsistent_incomplete_reciprocal_preference_relation"}, {"score": 0.0026020254041372723, "phrase": "initial_preference_information"}, {"score": 0.002357755095722877, "phrase": "non-strict_comparison_information"}, {"score": 0.0021789194955896124, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ordinal consistency", " Incomplete reciprocal preference relation", " Cycles"], "paper_abstract": "The ordinal consistency is the usual weak transitivity condition that a logical and consistent person should use if he/she does not want to express inconsistent opinions, and therefore becomes the minimum requirement condition that a consistent reciprocal preference relation should verify. In this paper, we define and study the ordinal consistency of an incomplete reciprocal preference relation. We then develop an algorithm to judge whether an incomplete reciprocal preference relation is ordinally consistent. This proposed algorithm can also find all cycles of length 3 to n in the incomplete digraph of the incomplete reciprocal preference relation. Based on this proposed algorithm and two rules, we develop another algorithm to repair an inconsistent incomplete reciprocal preference relation and to convert it to one with ordinal consistency. Our algorithm eliminates the cycles of length 3 to n in the digraph of an incomplete reciprocal preference relation most effectively. Our proposed method can preserve the initial preference information as much as possible. Furthermore, the proposed method can be used for an incomplete reciprocal preference relation with strict comparison and non-strict comparison information. Finally, the effectiveness and validity of the proposed method are illustrated with examples. Crown Copyright (c) 2013 Published by Elsevier B.V. All rights reserved.", "paper_title": "The ordinal consistency of an incomplete reciprocal preference relation", "paper_id": "WOS:000336946000005"}