{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "individual_driver_characteristics"}, {"score": 0.04454153022265076, "phrase": "traffic_flow"}, {"score": 0.03496276480056338, "phrase": "model_parameters"}, {"score": 0.029773546685011323, "phrase": "unstable_traffic_flow"}, {"score": 0.0047273577269638725, "phrase": "formation._previous_works"}, {"score": 0.00436575511349828, "phrase": "traffic_congestion"}, {"score": 0.0039341294012600085, "phrase": "individual_drivers"}, {"score": 0.0036329805216306576, "phrase": "optimal_velocity_model"}, {"score": 0.00327356326590461, "phrase": "driver_characteristics"}, {"score": 0.0031553611552558986, "phrase": "linear_stability_analysis"}, {"score": 0.0026252106881752067, "phrase": "unstable_flow_densities"}, {"score": 0.0024842242921857705, "phrase": "langevin_approach"}, {"score": 0.0023507916951658455, "phrase": "macroscopic_characteristics"}, {"score": 0.0022382002476510573, "phrase": "free_flows"}], "paper_keywords": ["Stability analysis", " car following", " driver behaviour", " traffic congestion"], "paper_abstract": "Previous works have pointed out that one of the reasons for the formation of traffic congestion is instability in traffic flow. In this study, we investigate theoretically how the characteristics of individual drivers influence the instability of traffic flow. The discussions are based on the optimal velocity model, which has three parameters related to individual driver characteristics. We specify the mappings between the model parameters and driver characteristics in this study. With linear stability analysis, we obtain a condition for when instability occurs and a constraint about how the model parameters influence the unstable traffic flow. Meanwhile, we also determine how the region of unstable flow densities depends on these parameters. Additionally, the Langevin approach theoretically validates that under the constraint, the macroscopic characteristics of the unstable traffic flow becomes a mixture of free flows and congestions. All of these results imply that both overly aggressive and overly conservative drivers are capable of triggering traffic congestion.", "paper_title": "THE INFLUENCE OF INDIVIDUAL DRIVER CHARACTERISTICS ON CONGESTION FORMATION", "paper_id": "WOS:000289467600008"}