{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "incomplete_relevance_judgment"}, {"score": 0.010612387000973441, "phrase": "system_measures"}, {"score": 0.009811449813378547, "phrase": "trec"}, {"score": 0.008822306310268209, "phrase": "average_precision"}, {"score": 0.007750687395605638, "phrase": "normalized_average_precision"}, {"score": 0.004726382602809228, "phrase": "ir._incomplete_relevance_judgment"}, {"score": 0.0045119929871912405, "phrase": "major_information_retrieval_evaluation_events"}, {"score": 0.003244275497488318, "phrase": "graded_relevance_judgment"}, {"score": 0.0031550351923674337, "phrase": "common_characteristic"}, {"score": 0.003125835572347772, "phrase": "complete_relevance_judgment"}, {"score": 0.0029152570900178956, "phrase": "extensive_experimentation"}, {"score": 0.0028882701690741467, "phrase": "trec_data"}, {"score": 0.0025474193855847074, "phrase": "pooling_method"}, {"score": 0.0021049977753042253, "phrase": "least_sensitive_measures"}], "paper_keywords": [""], "paper_abstract": "Incomplete relevance judgment has become a norm for the evaluation of some major information retrieval evaluation events such as TREC, but its effect on some system measures has not been well understood. In this paper, we evaluate four system measures, namely mean average precision, R-precision, normalized average precision over all documents, and normalized discount cumulative gain, under incomplete relevance judgment. Among them, the measure of normalized average precision over all documents is introduced, and both mean average precision and R-precision are generalized for graded relevance judgment. These four measures have a common characteristic: complete relevance judgment is required for the calculation of their accurate values. We empirically investigate these measures through extensive experimentation of TREC data and aim to find the effect of incomplete relevance judgment on them. From these experiments, we conclude that incomplete relevance judgment affects all these four measures' values significantly. When using the pooling method in TREC, the more incomplete the relevance judgment is, the higher the values of all these measures usually become. We also conclude that mean average precision is the most sensitive but least reliable measure, normalized discount cumulative gain and normalized average precision over all documents are the most reliable but least sensitive measures, while R-precision is in the middle.", "paper_title": "Evaluation of system measures for incomplete relevance judgment in IR", "paper_id": "WOS:000238575000021"}