{"auto_keywords": [{"score": 0.0490219456339607, "phrase": "road_networks"}, {"score": 0.04147823462135006, "phrase": "moving_objects"}, {"score": 0.00481495049065317, "phrase": "continuous_location-based_range_queries"}, {"score": 0.00458412183693466, "phrase": "mobile_devices"}, {"score": 0.004523103062368843, "phrase": "increasing_number"}, {"score": 0.004482873744893272, "phrase": "urban_users"}, {"score": 0.0044231966846655394, "phrase": "location-based_services"}, {"score": 0.004287008195370748, "phrase": "significant_research_interest"}, {"score": 0.0035374012552316573, "phrase": "novel_approach"}, {"score": 0.0034902664176377943, "phrase": "continuous_range_queries"}, {"score": 0.0033227310662785293, "phrase": "location-based_snapshot_queries"}, {"score": 0.0031071175640144943, "phrase": "continuous_queries"}, {"score": 0.003065698491529525, "phrase": "dual_index_structure"}, {"score": 0.0026806139086152365, "phrase": "query_processing"}, {"score": 0.0025632898741546556, "phrase": "frequent_object_updates"}, {"score": 0.0024292428060702803, "phrase": "network_connectivity"}, {"score": 0.0022816681646340518, "phrase": "query_point_location"}, {"score": 0.0022013916728990564, "phrase": "continuous_query_update_cost"}, {"score": 0.0021334650920198715, "phrase": "excellent_performance"}], "paper_keywords": ["Spatial databases and GIS", " location-dependent and sensitive"], "paper_abstract": "With the proliferation of mobile devices, an increasing number of urban users subscribe to location-based services. This trend has led to significant research interest in techniques that address two fundamental requirements: road network-based distance computation and the capability to process moving objects as points of interests. However, there exist few techniques that support both requirements simultaneously. To address these challenges, we propose a novel approach to process continuous range queries. We build on our previous work of an infrastructure that supports location-based snapshot queries on MOVing objects in road Networks (MOVNet). We introduce several significant features to enable continuous queries. The dual index structure that we proposed for MOVNet has been appropriately modified. We further appoint a number of connecting vertices in each cell and precompute the distances among them to expedite query processing. Most importantly, to alleviate the effects of frequent object updates, we introduce a Shortest-Distance-based Tree (SD-Tree). We illustrate that the network connectivity and distance information can be preserved and reused by the SD-Tree when the query point location is updated; hence, reducing the continuous query update cost. Our experimental results demonstrate that our method yields excellent performance with a very large number of moving objects.", "paper_title": "Processing of Continuous Location-Based Range Queries on Moving Objects in Road Networks", "paper_id": "WOS:000290681400008"}