{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vertex"}, {"score": 0.004555499634179394, "phrase": "ad_hoc_networks"}, {"score": 0.004431041346291019, "phrase": "critical_connectivity_properties"}, {"score": 0.004349955692802962, "phrase": "timely_partition_prediction"}, {"score": 0.0042506731642425275, "phrase": "fault_tolerance"}, {"score": 0.003822263046602146, "phrase": "existing_prediction_concepts"}, {"score": 0.0036328561748082138, "phrase": "communication_overhead"}, {"score": 0.0035498822293046884, "phrase": "existing_centralized_algorithms"}, {"score": 0.0031625006830124512, "phrase": "removable_nodes"}, {"score": 0.002936997013291548, "phrase": "p-hop_neighbors"}, {"score": 0.0026775328564629577, "phrase": "common_p-hop_neighbors"}, {"score": 0.0024750474634399797, "phrase": "local_k-connectivity"}, {"score": 0.0024409345168575833, "phrase": "false_positives"}, {"score": 0.002396179086883189, "phrase": "alternative_routes"}, {"score": 0.002266765479420981, "phrase": "satisfactory_service"}, {"score": 0.002204697943520258, "phrase": "localized_protocols"}, {"score": 0.0021843879253500894, "phrase": "faster_and_often_more_reliable_partition_warnings"}, {"score": 0.0021049977753042253, "phrase": "conceptual_advance"}], "paper_keywords": [""], "paper_abstract": "Ad hoc networks are expected to have some critical connectivity properties before partitioning. Timely partition prediction signals action for improving fault tolerance and performing some data or service replication so that the network can continue functioning after partition does occur. This article surveys existing prediction concepts and discusses their scalability, simplicity, correctness, speed, communication overhead, and applications. Existing centralized algorithms declare an edge or a node as critical if its removal will separate the network into several components. Several localized definitions of critical (or cut) nodes and links, and removable nodes, are demonstrated to be simple, useful, and scalable. A node is critical if the subgraph of p-hop neighbors of node (without the node itself) is disconnected. A link is critical if its endpoints have no common p-hop neighbors (assuming that the link between them does not exist). Definitions are extended toward local k-connectivity. The false positives mostly occur when alternative routes exist but are relatively long, and therefore may not provide satisfactory service in applications. Therefore, localized protocols provide faster and often more reliable partition warnings for possible timely replication decisions. This conceptual advance provides ingredients for establishing and restoring biconnectivity.", "paper_title": "Toward Scalable Cut Vertex and Link Detection with Applications in Wireless Ad Hoc Networks", "paper_id": "WOS:000286385400007"}