{"auto_keywords": [{"score": 0.04484681558552234, "phrase": "noise_filters"}, {"score": 0.023009307966263902, "phrase": "data_complexity_measures"}, {"score": 0.010612387000973441, "phrase": "noise_filtering_efficacy"}, {"score": 0.004723322467153553, "phrase": "nearest_neighbor_classification"}, {"score": 0.004567129988306349, "phrase": "instance-based_learners"}, {"score": 0.004501774379030109, "phrase": "k-nearest_neighbors"}, {"score": 0.00433200902751133, "phrase": "noisy_data"}, {"score": 0.004148631410346188, "phrase": "corrupted_data"}, {"score": 0.004069631519385246, "phrase": "classification_performance"}, {"score": 0.0035060903664150115, "phrase": "complexity_metrics"}, {"score": 0.003262035294895737, "phrase": "nearest_neighbor_classifier"}, {"score": 0.002690886043654469, "phrase": "great_extent"}, {"score": 0.0025155150482635688, "phrase": "validation_process"}, {"score": 0.002443890721386284, "phrase": "final_rule"}, {"score": 0.0021876814398268775, "phrase": "indiscriminate_usage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Classification", " Noisy data", " Noise filtering", " Data complexity measures", " Nearest neighbor"], "paper_abstract": "Classifier performance, particularly of instance-based learners such as k-nearest neighbors, is affected by the presence of noisy data. Noise filters are traditionally employed to remove these corrupted data and improve the classification performance. However, their efficacy depends on the properties of the data, which can be analyzed by what are known as data complexity measures. This paper studies the relation between the complexity metrics of a dataset and the efficacy of several noise filters to improve the performance of the nearest neighbor classifier. A methodology is proposed to extract a rule set based on data complexity measures that enables one to predict in advance whether the use of noise filters will be statistically profitable. The results obtained show that noise filtering efficacy is to a great extent dependent on the characteristics of the data analyzed by the measures. The validation process carried out shows that the final rule set provided is fairly accurate in predicting the efficacy of noise filters before their application and it produces an improvement with respect to the indiscriminate usage of noise filters. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Predicting noise filtering efficacy with data complexity measures for nearest neighbor classification", "paper_id": "WOS:000309785000031"}