{"auto_keywords": [{"score": 0.049038638823551965, "phrase": "atmostseqcard_constraint"}, {"score": 0.013265911201062314, "phrase": "car-sequencing_and_crew-rostering_problems"}, {"score": 0.009232986971310503, "phrase": "arc_consistency"}, {"score": 0.00481495049065317, "phrase": "particular_case"}, {"score": 0.004772818068176176, "phrase": "sequence_constraint"}, {"score": 0.0045877173513910055, "phrase": "cardinality_constraint"}, {"score": 0.004487989502479992, "phrase": "n_variables"}, {"score": 0.00440976345264104, "phrase": "-aeuro_parts"}, {"score": 0.004371160978838441, "phrase": "thousand_q"}, {"score": 0.0037311260623089436, "phrase": "amongseq_constraint"}, {"score": 0.003298631258267805, "phrase": "maher_et_al"}, {"score": 0.00307431840409833, "phrase": "time_complexity"}, {"score": 0.0022787359717772976, "phrase": "atmostseqcard_constraints"}], "paper_keywords": ["Sequencing constraints", " Filtering algorithm", " Arc consistency", " Car sequencing"], "paper_abstract": "The AtMostSeqCard constraint is the conjunction of a cardinality constraint on a sequence of n variables and of n -aEuro parts per thousand q + 1 constraints AtMost u on each subsequence of size q. This constraint is useful in car-sequencing and crew-rostering problems. In van Hoeve et al. (Constraints 14(2):273-292, 2009), two algorithms designed for the AmongSeq constraint were adapted to this constraint with an O(2 (q) n) and O(n (3)) worst case time complexity, respectively. In Maher et al. (2008), another algorithm similarly adaptable to filter the AtMostSeqCard constraint with a time complexity of O(n (2)) was proposed. In this paper, we introduce an algorithm for achieving arc consistency on the AtMostSeqCard constraint with an O(n) (hence optimal) worst case time complexity. Next, we show that this algorithm can be easily modified to achieve arc consistency on some extensions of this constraint. In particular, the conjunction of a set of m AtMostSeqCard constraints sharing the same scope can be filtered in O(nm). We then empirically study the efficiency of our propagator on instances of the car-sequencing and crew-rostering problems.", "paper_title": "An optimal arc consistency algorithm for a particular case of sequence constraint", "paper_id": "WOS:000329319300002"}