{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "agent_platforms"}, {"score": 0.00481495049065317, "phrase": "environment_interface_standard"}, {"score": 0.004437349839203418, "phrase": "generic_functionality"}, {"score": 0.004229158339021651, "phrase": "agent's_environment"}, {"score": 0.0036261282565554507, "phrase": "interface_implementation"}, {"score": 0.003215295260684715, "phrase": "agent_and_environment_programmers"}, {"score": 0.003169222811082848, "phrase": "environment_code"}, {"score": 0.0025892330566358503, "phrase": "careful_study"}, {"score": 0.0025155150482635688, "phrase": "different_agent_programming_languages"}, {"score": 0.00247944491239733, "phrase": "agent_programs"}, {"score": 0.0021049977753042253, "phrase": "unreal_tournament"}], "paper_keywords": ["Agent", " Environment", " Interface"], "paper_abstract": "We introduce an interface for connecting agent platforms to environments. This interface provides generic functionality for executing actions and for perceiving changes in an agent's environment. It also provides support for managing an environment, e.g., for starting, pausing and terminating it. Among the benefits of such an interface are (1) standard functionality is provided by the interface implementation itself, and (2) agent platforms that support the interface can connect to any environment that implements the interface. This significantly reduces effort required from agent and environment programmers as the environment code needed to implement the interface needs to be written only once. We propose that the interface presented may be used as a standard that enables agents to control entities in environments. Our starting point for designing such a generic interface is based on a careful study of the various interfaces used by different agent programming languages to connect agent programs to environments. We discuss several case studies that use our interface (an elevator simulator, the well-known agent contest, and an implementation of the interface to connect agents to bots in Unreal Tournament 2004).", "paper_title": "Towards an environment interface standard for agent platforms", "paper_id": "WOS:000297588400002"}