{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bbn"}, {"score": 0.004615202066192795, "phrase": "industrial_standards"}, {"score": 0.004353948887538618, "phrase": "particular_project"}, {"score": 0.004217708394188058, "phrase": "bayesian_belief_network"}, {"score": 0.0035408501923902477, "phrase": "causal_inference_diagrams"}, {"score": 0.0032355864829403413, "phrase": "first_problem"}, {"score": 0.003101153870424188, "phrase": "different_activities"}, {"score": 0.0029722900280316216, "phrase": "software_standards"}, {"score": 0.002863921785266393, "phrase": "unified_modeling_language"}, {"score": 0.0026168641536413978, "phrase": "inheritance_relations"}, {"score": 0.002378408229095287, "phrase": "particular_standard"}, {"score": 0.0023408288327263316, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "risk_management"}], "paper_keywords": ["software process tailoring", " UML", " BBN"], "paper_abstract": "Tailoring industrial standards is done to reduce costs and improve quality for a particular project. This paper proposes using Bayesian Belief Network (BBN) analysis to support tailoring decision-making under uncertainties. However, there are two major problems associated with the objectivity of BBNs; that is, the construction of the causal inference diagrams and the assignment of probabilities of their dependency relations. We have developed a method to solve the first problem. In general, the relations among different activities, resources, and products addressed in software standards can be expressed more directly in Unified Modeling Language (UML) diagrams than in BBN's. Such relations include association, aggregation, or inheritance relations. We have developed a schema to construct BBNs for process tailoring from given UML diagrams that model a particular standard. The proposed approach systematically constructing BBNs can also be used to assist decision-making in other software project management activities, such as planning and risk management.", "paper_title": "BBN construction for software process tailoring", "paper_id": "WOS:000245194600004"}