{"auto_keywords": [{"score": 0.008551346512164801, "phrase": "phi_gating"}, {"score": 0.00715076617223513, "phrase": "binding_residues"}, {"score": 0.004579780586951551, "phrase": "severe_salt-losing_renal_tubular_disorder"}, {"score": 0.004248294537944227, "phrase": "intracellular_ph"}, {"score": 0.004125934074896249, "phrase": "physiological_conditions"}, {"score": 0.003795335309109018, "phrase": "giant_patch_clamp"}, {"score": 0.003763763153640936, "phrase": "xenopus_oocytes"}, {"score": 0.0037014036718428698, "phrase": "pka"}, {"score": 0.003505749731180509, "phrase": "homology_model"}, {"score": 0.003418958653159371, "phrase": "pka_phosphorylation_site"}, {"score": 0.0031056437850836326, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003066945490483524, "phrase": "stable_transition_state"}, {"score": 0.002477998427152547, "phrase": "acidification-induced_rundown_channels"}, {"score": 0.0023864566654035924, "phrase": "pka."}, {"score": 0.002346861891137455, "phrase": "sequence_regulatory_episode"}, {"score": 0.00223196703759329, "phrase": "pka-mediated_phosphorylation"}, {"score": 0.0021857667493036786, "phrase": "new_insights"}, {"score": 0.002158505888557746, "phrase": "molecular_mechanisms"}], "paper_keywords": ["HPS/aBS", " Homology model", " Molecular dynamics simulations", " pH(i)", " PKA", " ROMK1 channels"], "paper_abstract": "Hyperprostaglandin E syndrome/antenatal Bartter syndrome (HPS/aBS) is a severe salt-losing renal tubular disorder and results from the mutation of renal outer medullary K+ (ROMK1) channels. The aberrant ROMK1 function induces alterations in intracellular pH (pH(i)) gating under physiological conditions. We investigate the role of protein kinase A (PKA) in the pHi gating of ROMK1 channels. Using giant patch clamp with Xenopus oocytes expressing wild-type and mutant ROMK1 channels, PKA-mediated phosphorylation decreased the sensitivity of ROMK1 channels to pHi. A homology model of ROMK1 reveals that a PKA phosphorylation site (S219) is spatially juxtaposed to the phosphatidylinositol 4,5-bisphosphate (PIP2) binding residues (R188, R217, and K218). Molecular dynamics simulations suggest a stable transition state, in which the shortening of distance between S219 and R217 and the movement of K218 towards the membrane after the PKA-phosphorylation can be observed. Such conformational change may bring the PIP2 binding residues (K218) more accessible to the membrane-bound PIP2. In addition, PIP2 dose-dependently reactivates the acidification-induced rundown channels only when ROMK1 channels have been phosphorylated by PKA. This implies a sequence regulatory episode reflecting the role Of PIP2 in the pHi gating of ROMK1 channels by PKA-mediated phosphorylation. Our results provide new insights into the molecular mechanisms underlying the ROMK1 channel regulation associated with HPS/aBS. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Functional and structural characterization of PKA-mediated pH(i) gating of ROMK1 channels", "paper_id": "WOS:000261013400011"}