{"auto_keywords": [{"score": 0.03240618642214553, "phrase": "input_space"}, {"score": 0.013629638440756637, "phrase": "high_dimensional_feature_spaces"}, {"score": 0.013500476405387384, "phrase": "inner_product_kernels"}, {"score": 0.009901187418897034, "phrase": "feature_spaces"}, {"score": 0.00481495049065317, "phrase": "multi-class_support_vector_machine"}, {"score": 0.003878625406105021, "phrase": "quadratic_programming_model"}, {"score": 0.0035741900278634616, "phrase": "discriminant_functions"}, {"score": 0.0034558655164987134, "phrase": "dual_solution"}, {"score": 0.003262035294895737, "phrase": "nonlinear_discriminant_functions"}, {"score": 0.0024914105981393127, "phrase": "feature_space"}, {"score": 0.002208853811052348, "phrase": "dual_formulation"}, {"score": 0.0021049977753042253, "phrase": "benchmark_test_problems"}], "paper_keywords": ["Machine learning", " support vector machine", " multi-class classification", " quadratic programming", " dual formulation"], "paper_abstract": "A multi-class support vector machine (M-SVM) is developed, its dual is derived, its dual is mapped to high dimensional feature spaces using inner product kernels, and its performance is tested. The M-SVM is formulated as a quadratic programming model. Its dual, also a quadratic programming model, is very elegant and is easier to solve than the primal. The discriminant functions can be directly constructed from the dual solution. By using inner product kernels, the M-SVM can be built and nonlinear discriminant functions can be constructed in high dimensional feature spaces without carrying out the mappings from the input space to the feature spaces. The size of the dual, measured by the number of variables and constraints, is independent of the dimension of the input space and stays the same whether the M-SVM is built in the input space or in a feature space. Compared to other models published in the literature, this M-SVM is equally or more effective. An example is presented to demonstrate the dual formulation and solution in feature spaces. Very good results were obtained on benchmark test problems from the literature.", "paper_title": "A MULTI-CLASS SUPPORT VECTOR MACHINE: THEORY AND MODEL", "paper_id": "WOS:000329048600006"}