{"auto_keywords": [{"score": 0.012687770158694265, "phrase": "potential_benefits"}, {"score": 0.009617243072916651, "phrase": "aps"}, {"score": 0.0076924255298394814, "phrase": "aps_experts"}, {"score": 0.007652549906848935, "phrase": "aps_users"}, {"score": 0.0068788481213347945, "phrase": "aps_systems"}, {"score": 0.006719697067846704, "phrase": "planning_efficiency"}, {"score": 0.00481495049065317, "phrase": "advanced_planning"}, {"score": 0.00472790536079734, "phrase": "operations_planning"}, {"score": 0.0041177539005782, "phrase": "delphi"}, {"score": 0.003990858854249981, "phrase": "chemical_industry"}, {"score": 0.003959752657656169, "phrase": "aps_system_support"}, {"score": 0.0038982628940954405, "phrase": "-_three_types"}, {"score": 0.003729159012409839, "phrase": "decision_support"}, {"score": 0.0036331209562640164, "phrase": "decision_support_benefits"}, {"score": 0.003530323168993377, "phrase": "case_company"}, {"score": 0.0033507875035075465, "phrase": "delivery_plans"}, {"score": 0.003197000180225272, "phrase": "production_plan"}, {"score": 0.0030264524348640218, "phrase": "different_results"}, {"score": 0.0028724674034965115, "phrase": "user_characteristics"}, {"score": 0.00252083079100971, "phrase": "statistical_analysis"}, {"score": 0.002481629924770927, "phrase": "empirical_analysis"}, {"score": 0.002430306426446819, "phrase": "single_case_study"}, {"score": 0.002361461161578124, "phrase": "aps_potential"}, {"score": 0.0022529771934744927, "phrase": "case_study_analysis"}, {"score": 0.0021834315230252047, "phrase": "different_aps_user_categories"}, {"score": 0.0021326817214241747, "phrase": "appropriate_way"}, {"score": 0.0021160280592526764, "phrase": "-_the_knowledge"}], "paper_keywords": ["Sales management", " Operations management", " Production scheduling", " Decision support systems", " Process planning"], "paper_abstract": "Purpose - The purpose of this paper is to explore what potential benefits may be achieved by using advanced planning and scheduling (APS) systems in the sales and operations planning (S&OP) process. Design/methodology/approach - The paper investigates benefits at the S&OP process level by interviewing APS experts and APS users. Several methods have been used; literature review, Delphi study, and a case study at a company in the chemical industry which uses APS system support in the S&OP process. Findings - Three types of potential benefits were found to be achieved when using APS systems in the S&OP process; benefits concerning decision support, planning efficiency and learning effects. The most common type was decision support benefits according to APS users and APS experts. The results from the case company showed that the benefits perceived in the different S&OP activities differed. In the activities concerning the preparation and generation of delivery plans, the perceived benefits mainly concerned learning effects. In the activities concerning the generation of a production plan, the benefits were foremost found in planning efficiency. In the S&OP meeting decision support benefits were highest valued. The reason for the different results can be explained by the aim of the activity, how APS was used in the activity, the user characteristics and the design of the model and access and quality of planning data. Research limitations/implications - The focus of this paper is on potential benefits of APS systems in the S&OP process only, not the costs. It has established a typology of potential benefits. No validation in form of statistical analysis has been done. The empirical analysis is mainly based on findings from a single case study. Practical implications - The findings about the types of APS potential will assist companies in understanding the benefits they can expect from its use in the S&OP process. The case study analysis gives further insight into how APS can be employed and what benefits different APS user categories can expect when it is used in an appropriate way. Originality/value - The knowledge about which benefits that can be achieved when using APS in the S&OP process is quite unexplored. This paper fills some of these gaps.", "paper_title": "The potential benefits of advanced planning and scheduling systems in sales and operations planning", "paper_id": "WOS:000280935600002"}