{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "kanban_approach"}, {"score": 0.00462677286273791, "phrase": "primary_studies"}, {"score": 0.004563880494020726, "phrase": "lean_product_development"}, {"score": 0.004243862930012258, "phrase": "software_development_field"}, {"score": 0.004195418010131832, "phrase": "significant_challenges"}, {"score": 0.004053362743156545, "phrase": "clear_definition"}, {"score": 0.003347105144425849, "phrase": "systematic_review_method"}, {"score": 0.003296212583539166, "phrase": "available_literature"}, {"score": 0.0029158847555394714, "phrase": "agile_approach"}, {"score": 0.00288255520607591, "phrase": "lean_principle"}, {"score": 0.0028170314398963704, "phrase": "great_benefits"}, {"score": 0.0027635643494432365, "phrase": "software_development_teams"}, {"score": 0.0025596276616952516, "phrase": "organization_types"}, {"score": 0.0025110337774260773, "phrase": "project_sizes"}, {"score": 0.002290291401956985, "phrase": "different_elements"}, {"score": 0.0022125996721544514, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "software_development_organizations"}], "paper_keywords": ["Kanban", " Lean", " Agile", " Software development", " Software engineering", " Process improvement", " Systematic review"], "paper_abstract": "The interest in lean product development in general and the Kanban approach in particular has increased over the years. However, practitioners, in the software development field, have significant challenges in implementing the Kanban approach as it lacks a clear definition of its principles, practices, techniques and tools. This study aims to provide insight into the Kanban approach and its elements (concepts, principles, practices, techniques, and tools) that have been empirically reported by scholars and practitioners. This insight is produced by using the systematic review method to analyze the available literature. A total of 37 primary studies were selected from more than 3,000 unique studies. Our findings show that the primary studies have considered and reported 20 different elements as part of the Kanban approach based upon considerations of being an agile approach or a lean principle; these elements have realized great benefits and improvements to the software development teams. These benefits along with the challenges have been reported in this study. Due to the variety of organization types, contexts, and project sizes reported in the primary studies, it is expected that the results in this study would help in establishing knowledge on what are the different elements of the Kanban approach as well as offering a first step towards developing guidelines for practitioners to help in introducing the Kanban approach to software development organizations.", "paper_title": "The kanban approach, between agility and leanness: a systematic review", "paper_id": "WOS:000363032900013"}