{"auto_keywords": [{"score": 0.029070079914963482, "phrase": "circularity_approach"}, {"score": 0.00481495049065317, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004356741449157895, "phrase": "exhibit_problems"}, {"score": 0.004288472456976113, "phrase": "masked_nodes"}, {"score": 0.004155113657645735, "phrase": "interference_range"}, {"score": 0.004089991141220082, "phrase": "communication_range"}, {"score": 0.0037594599958631404, "phrase": "parallel_transmissions"}, {"score": 0.003330406613112555, "phrase": "rts_and_cts_packets"}, {"score": 0.0032437952431945724, "phrase": "circularity-satisfied_rts"}, {"score": 0.003028969851366049, "phrase": "non-zero_risk"}, {"score": 0.00291923164591297, "phrase": "circularity-satisfied_cts"}, {"score": 0.0028432828877281388, "phrase": "neighboring_parallel_transmission"}, {"score": 0.002326938965568362, "phrase": "significant_improvement"}, {"score": 0.0022904032758108775, "phrase": "throughput_and_end-to-end_delay"}], "paper_keywords": [""], "paper_abstract": "The RTS/CTS access scheme, designed to reduce the number of collisions in a IEEE 802.11 network, is known to exhibit problems due to masked nodes, the imbalance between the interference range and the communication range of the nodes, and scenarios in which nodes are unnecessarily silenced, thus preventing parallel transmissions to take place. We present an approach for enhancing the performance of the IEEE 802.11 MAC protocol by selectively discarding or delaying specifically marked RTS and CTS packets. By dropping the circularity-satisfied RTS, we allow certain parallel transmissions to proceed, even if there is a non-zero risk of collision. By delaying the circularity-satisfied CTS, we allow a neighboring parallel transmission to continue. One important feature of the circularity approach is that it is fully compatible with the IEEE 802.11 standard. We implemented the circularity approach in ns-2 simulator. Through a series of experiments, we show that the circularity approach provides a significant improvement in the throughput and end-to-end delay of the network, and contributes to a reduction of the number of collisions in most scenarios.", "paper_title": "Circularity-based medium access control in mobile ad hoc networks", "paper_id": "WOS:000240073200027"}