{"auto_keywords": [{"score": 0.049188612914091503, "phrase": "subjects'_visual_performance"}, {"score": 0.04681806191061653, "phrase": "simulated_e-paper"}, {"score": 0.012171513864330536, "phrase": "bending_curvature"}, {"score": 0.012058614165644539, "phrase": "ambient_illuminance"}, {"score": 0.010582545500745888, "phrase": "yellow-like_condition"}, {"score": 0.009549447094407871, "phrase": "subjective_preferences"}, {"score": 0.007995018610268667, "phrase": "simulated_e-paper_set"}, {"score": 0.003990385737207714, "phrase": "e-paper_affect_subjects'_visual_performance"}, {"score": 0.003789395499639015, "phrase": "analysis_results"}, {"score": 0.00351491577968631, "phrase": "visual_performance"}, {"score": 0.0033377940531761985, "phrase": "background_color"}, {"score": 0.0025409639091476363, "phrase": "best_preference"}, {"score": 0.002301896758256575, "phrase": "low_text_luminance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["e-paper", " bending curvature", " visual performance", " subjective preference"], "paper_abstract": "The study used the simulated e-paper to investigate how the bending radius of curvature (-10 cm, plane, and 10 cm) and 12 text/background color-combinations of e-paper affect subjects' visual performance and subjective preference under various ambient illuminance conditions (200 and 500 lx). Analysis results indicated that the bending curvature and ambient illuminance did not significantly affect subjects' visual performance. However, subjects visual performance differed significantly for different text/background color combinations of the simulated e-paper. When the background color of the simulated e-paper was set to yellow-like condition and the luminance of the text was low (2.2 and 4.6 cd/m(2)), subjects' visual performance was best. Regarding the subjective preferences of subjects, the results of this research also demonstrated that the bending curvature, text/background color combinations and ambient illuminance all significantly affected the subjective preferences of subjects. Subjects exhibited the best preference under the following settings: bending curvature of the simulated e-paper set to plane; background color of the simulated e-paper set to yellow-like condition and low text luminance (2.2 or 4.6 cd/m(2)); high ambient illuminance (500 lx). (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Effects of bending curvature and text/background color-combinations of e-paper on subjects' visual performance and subjective preferences under various ambient illuminance conditions", "paper_id": "WOS:000251880500002"}