{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "virtualized_environments"}, {"score": 0.004774324145784758, "phrase": "modern_scientific_research"}, {"score": 0.004615202066192795, "phrase": "powerful_and_flexible_computational_infrastructure"}, {"score": 0.0044424917428102445, "phrase": "computational_resources"}, {"score": 0.003670843919846253, "phrase": "infrastructure_acceptance"}, {"score": 0.0031643005824589917, "phrase": "reference_model"}, {"score": 0.002994449398035894, "phrase": "low-level_components"}, {"score": 0.002821685815956478, "phrase": "otherwise_dispersed_components"}, {"score": 0.002785978280998868, "phrase": "coherent_unit"}, {"score": 0.0026363807171515255, "phrase": "new_environment"}, {"score": 0.0025591748412278174, "phrase": "minimal_overhead"}, {"score": 0.002380934815435267, "phrase": "higher-level_services"}, {"score": 0.0023210293050850276, "phrase": "component_organization"}, {"score": 0.00229164285862567, "phrase": "underlying_infrastructure"}, {"score": 0.0022434880661725493, "phrase": "fully_functional_sample_application_deployment"}, {"score": 0.002168531704054597, "phrase": "overall_application_deployment"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["application deployment", " cloud computing", " referencemodel"], "paper_abstract": "Modern scientific research has been revolutionized by the availability of powerful and flexible computational infrastructure. Virtualization has made it possible to acquire computational resources on demand. Establishing and enabling use of these environments is essential, but their widespread adoption will only succeed if they are transparently usable. Requiring changes to applications being deployed or requiring users to change how they utilize those applications represent barriers to the infrastructure acceptance. The problem lies in the process of deploying applications so that they can take advantage of the elasticity of the environment and deliver it transparently to users. Here, we describe a reference model for deploying applications into virtualized environments. The model is rooted in the low-level components common to a range of virtualized environments and it describes how to compose those otherwise dispersed components into a coherent unit. Use of the model enables applications to be deployed into the new environment without any modifications, it imposes minimal overhead on management of the infrastructure required to run the application, and yields a set of higher-level services as a byproduct of the component organization and the underlying infrastructure. We provide a fully functional sample application deployment and implement a framework for managing the overall application deployment. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "A reference model for deploying applications in virtualized environments", "paper_id": "WOS:000307117700005"}