{"auto_keywords": [{"score": 0.0497377294589231, "phrase": "digital_microfluidic_biochips"}, {"score": 0.03843856552198327, "phrase": "virtual_device"}, {"score": 0.02901263621919025, "phrase": "biochemical_application"}, {"score": 0.025137854709369193, "phrase": "completion_time"}, {"score": 0.00481495049065317, "phrase": "search-based_synthesis"}, {"score": 0.004746558955503364, "phrase": "dynamically_reconfigurable_non-rectangular_devices"}, {"score": 0.00462919213721188, "phrase": "conventional_biochemical_analyzers"}, {"score": 0.0043560464825349275, "phrase": "digital\"_microfluidic_biochips"}, {"score": 0.004248294537944227, "phrase": "continuous_flow"}, {"score": 0.004187917910692495, "phrase": "discrete_droplets"}, {"score": 0.004011867299107537, "phrase": "digital_biochip"}, {"score": 0.003940706575253453, "phrase": "two-dimensional_array"}, {"score": 0.0033542722986970265, "phrase": "rectangular_virtual_device"}, {"score": 0.0030889995517870525, "phrase": "different_group"}, {"score": 0.0028548578165712643, "phrase": "tabu_search_metaheuristic"}, {"score": 0.002647890142618442, "phrase": "resource_binding"}, {"score": 0.0022777800735119405, "phrase": "analytical_method"}, {"score": 0.0021507795710951384, "phrase": "proposed_heuristic"}, {"score": 0.0021049977753042253, "phrase": "real-life_case_study"}], "paper_keywords": ["Microfluidics", " Biochips", " Reconfigurability", " Synthesis"], "paper_abstract": "Microfluidic biochips are replacing the conventional biochemical analyzers, and are able to integrate on-chip all the necessary functions for biochemical analysis. The \"digital\" microfluidic biochips are manipulating liquids not as a continuous flow, but as discrete droplets, and hence they are highly reconfigurable and scalable. A digital biochip is composed of a two-dimensional array of cells, together with reservoirs for storing the samples and reagents. Several adjacent cells are dynamically grouped to form a virtual device, on which operations are performed. So far, researchers have assumed that throughout its execution, an operation is performed on a rectangular virtual device, whose position remains fixed. However, during the execution of an operation, the virtual device can be reconfigured to occupy a different group of cells on the array, forming any shape, not necessarily rectangular. In this paper, we present a Tabu Search metaheuristic for the synthesis of digital microfluidic biochips, which, starting from a biochemical application and a given biochip architecture, determines the allocation, resource binding, scheduling and placement of the operations in the application. In our approach, we consider changing the device to which an operation is bound during its execution, to improve the completion time of the biochemical application. Moreover, we devise an analytical method for determining the completion time of an operation on a device of any given shape. The proposed heuristic has been evaluated using a real-life case study and ten synthetic benchmarks.", "paper_title": "Tabu search-based synthesis of digital microfluidic biochips with dynamically reconfigurable non-rectangular devices", "paper_id": "WOS:000282825000009"}