{"auto_keywords": [{"score": 0.03786866964655596, "phrase": "pathology_report"}, {"score": 0.02322730111336097, "phrase": "lung_cancer_pathologic_staging_diagnosis"}, {"score": 0.01984284710346511, "phrase": "lung_cancer"}, {"score": 0.005417320007739674, "phrase": "clinical_information"}, {"score": 0.004734448316824488, "phrase": "clinical_and_pathology_information"}, {"score": 0.004577440795549049, "phrase": "leading_cancers"}, {"score": 0.004315048553208003, "phrase": "cancer_death"}, {"score": 0.003770185129638344, "phrase": "cancer_diagnosis"}, {"score": 0.0034504423179340738, "phrase": "original_tumour"}, {"score": 0.0032250961348210473, "phrase": "pathologic_staging"}, {"score": 0.003078740573398959, "phrase": "patient's_prognosis"}, {"score": 0.0029764767329116875, "phrase": "suitable_treatment"}, {"score": 0.00287759989638073, "phrase": "patient's_lung"}, {"score": 0.00266693888510356, "phrase": "surgery_biopsy"}, {"score": 0.00257831812581194, "phrase": "patient's_health"}, {"score": 0.00231987280116332, "phrase": "data_mining_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Lung cancer", " Cancer staging diagnosis", " Data mining", " Association rule mining"], "paper_abstract": "Lung cancer is one of the leading cancers for both genders all over the world. It is the most common cause of cancer death and almost reaches 20% of the total. The incidence of lung cancer has significantly increased from the early 19th century. In this manuscript we have discussed various data mining techniques that have been utilised for cancer diagnosis. The lung cancer pathologic staging is set based on the pathology report to describe the size and/or the extent of the original tumour and whether the cancer has spread (metastasis). Being aware of the lung cancer pathologic staging is important because it can be used to estimate a patient's prognosis and also can help physicians plan a suitable treatment. A sample of tissue from the patient's lung is required in order to complete the pathology report for the lung cancer pathologic staging diagnosis. In this procedure, a surgery biopsy is necessary but it may put the patient's health in jeopardy. Therefore, this study focuses on taking the clinical information which can be obtained without surgery to replace the pathology report. The data mining techniques are used to find the correlation between the clinical information and the pathology report in order to support lung cancer pathologic staging diagnosis. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Data mining in lung cancer pathologic staging diagnosis: Correlation between clinical and pathology information", "paper_id": "WOS:000355063700014"}