{"auto_keywords": [{"score": 0.04597142052282097, "phrase": "dimensionality_reduction"}, {"score": 0.041549881369567554, "phrase": "traditional_genetic_operators"}, {"score": 0.03939436573396754, "phrase": "available_problem-specific_information"}, {"score": 0.0383084906782155, "phrase": "near-infrared_spectral_data"}, {"score": 0.026844043274672616, "phrase": "wavebands_selection"}, {"score": 0.02663762911934969, "phrase": "better-quality_solutions"}, {"score": 0.00481495049065317, "phrase": "enhanced_genetic_operators"}, {"score": 0.0047770949736194585, "phrase": "waveband_selection"}, {"score": 0.004752022662995341, "phrase": "multivariate_calibration"}, {"score": 0.00471465954562773, "phrase": "nir_spectroscopy"}, {"score": 0.0046164478775379105, "phrase": "data_acquisition"}, {"score": 0.004592214823540993, "phrase": "huge_amounts"}, {"score": 0.004155113657645735, "phrase": "ensuing_data_mining_technique"}, {"score": 0.003789282090309032, "phrase": "designed_genetic_operators"}, {"score": 0.003235258563557806, "phrase": "pseudo-random_two-point_crossover"}, {"score": 0.0031098631445657158, "phrase": "second_point"}, {"score": 0.0030772505522663612, "phrase": "problem-specific_information"}, {"score": 0.002926936893217662, "phrase": "new_genetic_algorithm-based_variable_selection_designs"}, {"score": 0.0028734230458881903, "phrase": "fuzzy_systems"}, {"score": 0.002865858270439691, "phrase": "based_calibration"}, {"score": 0.0026689487424251907, "phrase": "resin_production"}, {"score": 0.002640947693258573, "phrase": "chilling_point"}, {"score": 0.0025385285106790403, "phrase": "designed_operators"}, {"score": 0.00237029943579966, "phrase": "john_wiley"}, {"score": 0.002339246282204109, "phrase": "current_data_acquisition_techniques"}, {"score": 0.0022783523466965187, "phrase": "genetic_algorithms"}, {"score": 0.0021049977753042253, "phrase": "near-infrared_calibration"}], "paper_keywords": ["dimensionality reduction", " waveband selection", " genetic algorithms", " genetic operators design", " NIR spectra", " chemometric modeling"], "paper_abstract": "Nowadays, the techniques employed in data acquisition provide huge amounts of data. Some parts of the information are related to the others, making dimensionality reduction desirable, and losing less information as much as possible, in order to decrease computational times and complexity when applying any ensuing data mining technique. Genetic algorithms offer the possibility of selecting which variables contain the most relevant information to represent all the original ones. The traditional genetic operators seem to be too general, leading to results that could be improved by means of designed genetic operators that employ some available problem-specific information. Especially, when dealing with calibration by means of near-infrared spectral data, which use to contain thousands of variables, it is known that not isolated wavelengths but wavebands allow a more robust model design. This aspect should be taken into account when crossing individuals. We propose three crossover operators specifically designed for calibration with near-infrared spectral data, based on a pseudo-random two-point crossover, where the first point is chosen randomly, and the selection of the second point is guided by problem-specific information. We compare their performance with that of state-of-the-art operators. We combine these new genetic algorithm-based variable selection designs with partial least squares regression and fuzzy systems based calibration.Our benchmark consists of two real-world high-dimensional data sets, corresponding to polyetheracrylat, where hydroxyl number, viscosity, and acidity are on-line monitored; and melamine resin production, where the chilling point (CP) is considered in order to regulate the condensation. We show that designed operators promote wavebands selection, achieve better-quality solutions, and converge faster and smoother than state-of-the-art operators. Copyright (c) 2014 John Wiley & Sons, Ltd. Current data acquisition techniques provide huge amounts of data making dimensionality reduction desirable. Genetic algorithms allow selecting which variables contain the most relevant information to represent all the original ones. Traditional genetic operators seem to be too general, leading to results that could be improved by employing available problem-specific information. In near-infrared calibration, wavebands allow a more robust model design. We design three crossover operators, which promote wavebands selection, achieve better-quality solutions, and converge faster and smoother than state-of-the-art operators.", "paper_title": "Enhanced genetic operators design for waveband selection in multivariate calibration based on NIR spectroscopy", "paper_id": "WOS:000331385400007"}