{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_cancer_support_groups"}, {"score": 0.009034695048021847, "phrase": "cancer_patients'_use"}, {"score": 0.0072174737439012525, "phrase": "new_instrument"}, {"score": 0.0046240999614456605, "phrase": "computer_technologies"}, {"score": 0.003681593399219782, "phrase": "pilot_study"}, {"score": 0.0036272258853286433, "phrase": "virtually_no_instrument"}, {"score": 0.0034036089823450385, "phrase": "multiple_data-bases"}, {"score": 0.0028446460307503343, "phrase": "convenience_sampling_method"}, {"score": 0.0027634902834910184, "phrase": "development_process"}, {"score": 0.002447101794397243, "phrase": "psychometric_properties"}, {"score": 0.0022960713730673494, "phrase": "internal_consistency_reliability_testing"}, {"score": 0.0022696277881969896, "phrase": "split-half_reliability_testing"}, {"score": 0.002129527338875116, "phrase": "criterion_validity"}, {"score": 0.0021049977753042253, "phrase": "convergent_validity"}], "paper_keywords": ["Construct validity", " Convergent validity", " Instrument", " Internal consistency", " Internet cancer support groups", " Measurement scale"], "paper_abstract": "Recently, with advances in computer technologies, Internet cancer support groups became more popular than ever among people living with cancer. However, there is little information available on cancer patients' use of Internet cancer support groups, which may be partially due to a lack of instruments measuring cancer patients' use of Internet cancer support groups. Indeed, virtually no instrument measuring cancer patients' use of Internet cancer support groups can be identified through searches using multiple data-bases. In this study, a new instrument measuring the use of Internet cancer support groups was developed, and its psychometric properties were tested among 117 people living with cancer recruited through the Internet using a convenience sampling method. First, the development process of the new instrument, the Questions on the Use of Internet Cancer Support Groups, is described. Then, the pilot study on psychometric properties of the instrument is presented. Reliability was evaluated using internal consistency reliability testing, split-half reliability testing, and item analysis. Validity was assessed by using criterion validity, convergent validity, and face validity. The findings of the pilot study supported the reliability and validity of this new instrument. Based on the findings,", "paper_title": "The Questions on the Use of Internet Cancer Support Groups", "paper_id": "WOS:000291927300004"}