{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "active_contours"}, {"score": 0.018022872028437893, "phrase": "empirical_distributions"}, {"score": 0.00949018139101883, "phrase": "bhattacharyya_distance"}, {"score": 0.009183078481228653, "phrase": "photometric_variable"}, {"score": 0.007340630496116726, "phrase": "proposed_methodology"}, {"score": 0.005712767360417811, "phrase": "smoothness_properties"}, {"score": 0.0047517225918491226, "phrase": "bhattacharyya_gradient_flow"}, {"score": 0.00462773520532301, "phrase": "image_segmentation"}, {"score": 0.004462494148878735, "phrase": "gradient_flow"}, {"score": 0.003935575440750755, "phrase": "image_pixels"}, {"score": 0.003757480190200645, "phrase": "maximal_discrepancy"}, {"score": 0.0034250209479036392, "phrase": "extremely_useful_tool"}, {"score": 0.0032269483581856737, "phrase": "segmentation_methods"}, {"score": 0.0031218852898830755, "phrase": "finite_number"}, {"score": 0.0031012854824177772, "phrase": "empirical_moments"}, {"score": 0.003030247482854539, "phrase": "\"outside\"_distributions"}, {"score": 0.002636828502928141, "phrase": "additional_contribution"}, {"score": 0.002451527111936163, "phrase": "data_samples"}, {"score": 0.0023249757987087055, "phrase": "active_contour"}, {"score": 0.0021401625519713577, "phrase": "relevant_segmentation_results"}], "paper_keywords": ["active contours", " Bhattacharyya distance", " image segmentation", " kernel density estimation"], "paper_abstract": "This paper addresses the problem of image segmentation by means of active contours, whose evolution is driven by the gradient flow derived from an energy functional that is based on the Bhattacharyya distance. In particular, given the values of a photometric variable (or of a set thereof), which is to be used for classifying the image pixels, the active contours are designed to converge to the shape that results in maximal discrepancy between the empirical distributions of the photometric variable inside and outside of the contours. The above discrepancy is measured by means of the Bhattacharyya distance that proves to be an extremely useful tool for solving the problem at hand. The proposed methodology can be viewed as a generalization of the segmentation methods, in which active contours maximize the difference between a finite number of empirical moments of the \"inside\" and \"outside\" distributions. Furthermore, it is shown that the proposed methodology is very versatile and flexible in the sense that it allows one to easily accommodate a diversity of the image features based on which the segmentation should be performed. As an additional contribution, a method for automatically adjusting the smoothness properties of the empirical distributions is proposed. Such a procedure is crucial in situations when the number of data samples (supporting a certain segmentation class) varies considerably in the course of the evolution of the active contour. In this case, the smoothness properties of the empirical distributions have to be properly adjusted to avoid either over- or underestimation artifacts. Finally, a number of relevant segmentation results are demonstrated and some further research directions are discussed.", "paper_title": "Image segmentation using active contours driven by the Bhattacharyya gradient flow", "paper_id": "WOS:000250241500015"}