{"auto_keywords": [{"score": 0.03748443929333412, "phrase": "rule_support"}, {"score": 0.01620825952192367, "phrase": "desirable_properties"}, {"score": 0.010612387000973441, "phrase": "pareto-optimal_rules"}, {"score": 0.009086592671497104, "phrase": "bayesian_confirmation_measures"}, {"score": 0.00805829686542656, "phrase": "monotone_link"}, {"score": 0.006136793796706508, "phrase": "confirmation_measure"}, {"score": 0.004565529359523792, "phrase": "knowledge_discovery"}, {"score": 0.0045332598718792515, "phrase": "data_mining_many_measures"}, {"score": 0.00428314621261913, "phrase": "discovered_patterns"}, {"score": 0.0041780882724537, "phrase": "important_role"}, {"score": 0.0038506359988314787, "phrase": "knowledge_patterns"}, {"score": 0.0035867530188337933, "phrase": "classic_dimensions"}, {"score": 0.003400736815046841, "phrase": "monotone_dependence"}, {"score": 0.003247319029344241, "phrase": "confidence_measure"}, {"score": 0.003167587258150065, "phrase": "noninteresting_rules"}, {"score": 0.0029294877178473017, "phrase": "considered_confirmation_measures"}, {"score": 0.002837305633114947, "phrase": "general_conclusions"}, {"score": 0.0021427510493208864, "phrase": "pareto-optimal_set"}, {"score": 0.0021049977753042253, "phrase": "previously_considered_pareto-optimal_borders"}], "paper_keywords": ["knowledge discovery", " association rules", " decision rules", " Bayesian confirmation measures", " monotonicity in rule support", " confidence and confirmation", " pareto-optimal rules"], "paper_abstract": "in knowledge discovery and data mining many measures of interestingness have been proposed in order to measure the relevance and utility of the discovered patterns. Among these measures, an important role is played by Bayesian confirmation measures, which express in what degree a premise confirms a conclusion. In this paper, we are considering knowledge patterns in a form of \"if..., then...\" rules with a fixed conclusion. We investigate a monotone link between Bayesian confirmation measures, and classic dimensions being rule support and confidence. In particular, we formulate and prove conditions for monotone dependence of two confirmation measures enjoying some desirable properties on rule support and confidence. As the confidence measure is unable to identify and eliminate noninteresting rules, for which a premise does not confirm a conclusion, we propose to substitute the confidence for one of the considered confirmation measures in mining the Pareto-optimal rules. We also provide general conclusions for the monotone link between any confirmation measure enjoying the desirable properties and rule support and confidence. Finally, we propose to mine rules maximizing rule support and minimizing rule anti-support, which is the number of examples, which satisfy the premise of the rule but not its conclusion (called counter-examples of the considered rule). We prove that in this way we are able to mine all the rules maximizing any confirmation measure enjoying the desirable properties. We also prove that this Pareto-optimal set includes all the rules from the previously considered Pareto-optimal borders. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Mining Pareto-optimal rules with respect to support and confirmation or support and anti-support", "paper_id": "WOS:000247826200004"}