{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "controlled_vocabularies"}, {"score": 0.040437138629194604, "phrase": "text_corpus"}, {"score": 0.03726682411720791, "phrase": "controlled_vocabulary"}, {"score": 0.014741253268083477, "phrase": "candidate_terms"}, {"score": 0.004778088905211055, "phrase": "analysing_query"}, {"score": 0.0047415081747150065, "phrase": "purpose_-_controlled_vocabularies"}, {"score": 0.0047268853060532835, "phrase": "proposed_model"}, {"score": 0.004687159050154687, "phrase": "important_role"}, {"score": 0.004651271219032404, "phrase": "information_retrieval"}, {"score": 0.004615656893404919, "phrase": "numerous_studies"}, {"score": 0.004545240514015278, "phrase": "conceptual_searches"}, {"score": 0.004407599980762272, "phrase": "keyword_searches"}, {"score": 0.004257708925521277, "phrase": "new_ways"}, {"score": 0.003988293689448734, "phrase": "semi-automatic_model"}, {"score": 0.0037792227071149985, "phrase": "query_logs"}, {"score": 0.0037072310568610723, "phrase": "experimental_development"}, {"score": 0.0027777389949155975, "phrase": "online_academic_journal"}, {"score": 0.002542298702137655, "phrase": "search_engine"}, {"score": 0.0025130941721410558, "phrase": "relevant_document"}, {"score": 0.002256155453630723, "phrase": "controlled_web_environments"}, {"score": 0.0021876814398268775, "phrase": "academic_journals"}, {"score": 0.0021049977753042253, "phrase": "indexing_process"}], "paper_keywords": ["Information retrieval", " Controlled vocabularies", " Indexing languages", " Keywords", " Query logs"], "paper_abstract": "Purpose - Controlled vocabularies play an important role in information retrieval. Numerous studies have shown that conceptual searches based on vocabularies are more effective than keyword searches, at least in certain contexts. Consequently, new ways must be found to improve controlled vocabularies. The purpose of this paper is to present a semi-automatic model for updating controlled vocabularies through the use of a text corpus and the analysis of query logs. Design/methodology/approach - An experimental development is presented in which, first, the suitability of a controlled vocabulary to a text corpus is examined. The keywords entered by users to access the text corpus are then compared with the descriptors used to index it. Finally, both the query logs and text corpus are processed to obtain a set of candidate terms to update the controlled vocabulary. Findings - This paper describes a model applicable both in the context of the text corpus of an online academic journal and to repositories and intranets. The model is able to: first, identify the queries that led users from a search engine to a relevant document; and second, process these queries to identify candidate terms for inclusion in a controlled vocabulary. Research limitations/implications - Ideally, the model should be used in controlled web environments, such as repositories, intranets or academic journals. Social implications - The proposed model directly improves the indexing process by facilitating the maintenance and updating of controlled vocabularies. It so doing, it helps to optimise access to information. Originality/value - The proposed model takes into account the perspective of users by mining queries in order to propose candidate terms for inclusion in a controlled vocabulary.", "paper_title": "Updating controlled vocabularies by analysing query", "paper_id": "WOS:000369388300002"}