{"auto_keywords": [{"score": 0.004648609688625397, "phrase": "real-time_vision-based_localization_approach"}, {"score": 0.00431388720289049, "phrase": "accurate_localization"}, {"score": 0.004020813632357377, "phrase": "map_computation_process"}, {"score": 0.00395069818358908, "phrase": "stereo_visual_slam_techniques"}, {"score": 0.002981026404927824, "phrase": "learned_visibility_prediction"}, {"score": 0.0029548937818509656, "phrase": "monocular_vision-based_localization"}, {"score": 0.0027417911324611917, "phrase": "existing_approaches"}, {"score": 0.002682081928174866, "phrase": "visibility_prediction"}, {"score": 0.0025106241866273897, "phrase": "data_association"}, {"score": 0.002248816575548875, "phrase": "robust_and_fast_vision-based_localization"}], "paper_keywords": ["Vision-based localization", " Visibility prediction", " Humanoid robots", " Locally weighted learning", " Bundle adjustment"], "paper_abstract": "In this paper, we propose a real-time vision-based localization approach for humanoid robots using a single camera as the only sensor. In order to obtain an accurate localization of the robot, we first build an accurate 3D map of the environment. In the map computation process, we use stereo visual SLAM techniques based on non-linear least squares optimization methods (bundle adjustment). Once we have computed a 3D reconstruction of the environment, which comprises of a set of camera poses (keyframes) and a list of 3D points, we learn the visibility of the 3D points by exploiting all the geometric relationships between the camera poses and 3D map points involved in the reconstruction. Finally, we use the prior 3D map and the learned visibility prediction for monocular vision-based localization. Our algorithm is very efficient, easy to implement and more robust and accurate than existing approaches. By means of visibility prediction we predict for a query pose only the highly visible 3D points, thus, speeding up tremendously the data association between 3D map points and perceived 2D features in the image. In this way, we can solve very efficiently the Perspective-n-Point (PnP) problem providing robust and fast vision-based localization. We demonstrate the robustness and accuracy of our approach by showing several vision-based localization experiments with the HRP-2 humanoid robot.", "paper_title": "How to localize humanoids with a single camera?", "paper_id": "WOS:000314021200004"}