{"auto_keywords": [{"score": 0.048675858514910963, "phrase": "instance_selection"}, {"score": 0.01942845234471304, "phrase": "feature_selection"}, {"score": 0.012421384716028864, "phrase": "genetic_algorithms"}, {"score": 0.007367167158518539, "phrase": "data_mining"}, {"score": 0.00428892403807229, "phrase": "faulty_data"}, {"score": 0.0041357305373417455, "phrase": "related_studies"}, {"score": 0.004054479957160662, "phrase": "preprocessing_tasks"}, {"score": 0.0038838500580958744, "phrase": "performance_differences"}, {"score": 0.003482160257566501, "phrase": "different_priorities"}, {"score": 0.0034024277222012597, "phrase": "different_domain_datasets"}, {"score": 0.003368816076401138, "phrase": "experimental_results"}, {"score": 0.002845502417672334, "phrase": "significant_difference"}, {"score": 0.0028267211555015295, "phrase": "classification_accuracy"}, {"score": 0.002798780784517325, "phrase": "different_data_preprocessing_methods"}, {"score": 0.002689746491842271, "phrase": "computational_effort"}, {"score": 0.0025424945305785374, "phrase": "classification_effectiveness"}, {"score": 0.0024112587007106535, "phrase": "optimal_solution"}, {"score": 0.0023326907270271153, "phrase": "k-nn_classifiers"}, {"score": 0.0023172863267744703, "phrase": "similar_classification_accuracy"}, {"score": 0.002168715943767454, "phrase": "different_dataset_scales"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Genetic algorithms", " Feature selection", " Instance selection", " Data mining", " Data preprocessing"], "paper_abstract": "Feature selection and instance selection are two important data preprocessing steps in data mining, where the former is aimed at removing some irrelevant and/or redundant features from a given dataset and the latter at discarding the faulty data. Genetic algorithms have been widely used for these tasks in related studies. However, these two data preprocessing tasks are generally considered separately in literature. It is unknown what the performance differences would be when feature and instance selection and feature or instance selection are performed individually. Therefore, the aim of this study is to perform feature selection and instance selection based on genetic algorithms using different priorities to examine the classification performances over different domain datasets. The experimental results obtained from four small and large scale datasets containing various numbers of features and data samples show that performing both feature and instance selection usually make the classifiers (i.e., support vector machines and k-nearest neighbor) perform slightly poorer than feature selection or instance selection individually. However, while there is not a significant difference in classification accuracy between these different data preprocessing methods, the combination of feature and instance selection largely reduces the computational effort of training the classifiers, as opposed to performing feature and instance selection individually. Considering both classification effectiveness and efficiency, we demonstrate that performing feature selection first and instance selection second is the optimal solution for data preprocessing in data mining. Both SVM and k-NN classifiers provide similar classification accuracy to the baselines (i.e., those without data preprocessing). The decisions regarding which data preprocessing task to perform for different dataset scales are also discussed. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Genetic algorithms in feature and instance selection", "paper_id": "WOS:000315325700023"}