{"auto_keywords": [{"score": 0.03271521283089865, "phrase": "proposed_method"}, {"score": 0.015719716506582538, "phrase": "payload_attribution"}, {"score": 0.015615208559724942, "phrase": "character_dependent_multi-bloom_filters"}, {"score": 0.01384690440785531, "phrase": "specific_string"}, {"score": 0.01286505206473654, "phrase": "previously_proposed_techniques"}, {"score": 0.012651669586934658, "phrase": "wildcard_queries"}, {"score": 0.004734448316824488, "phrase": "forensic_analysts"}, {"score": 0.0047026237903774895, "phrase": "payload_attribution_systems"}, {"score": 0.004608422081389008, "phrase": "investigative_tool"}, {"score": 0.0044706300051082035, "phrase": "large_amounts"}, {"score": 0.004440570928903645, "phrase": "network_traffic"}, {"score": 0.004395859169800476, "phrase": "full_packet_payload"}, {"score": 0.003802135020791801, "phrase": "important_type"}, {"score": 0.00348263058839775, "phrase": "new_data_structure"}, {"score": 0.0031258948882273057, "phrase": "theoretical_study"}, {"score": 0.002921682548018944, "phrase": "theoretical_analysis"}, {"score": 0.0027400176498756823, "phrase": "state-of-the-art_attribution_techniques"}, {"score": 0.00257831812581194, "phrase": "data_reduction_ratio"}, {"score": 0.0023694065215394593, "phrase": "similar_false-positive_rate"}, {"score": 0.0022906498741695094, "phrase": "wildcard_query"}, {"score": 0.002275214783528274, "phrase": "seven_unknown_characters"}, {"score": 0.0021700361584578633, "phrase": "previous_techniques"}, {"score": 0.0021408862709571615, "phrase": "exhaustive_search"}], "paper_keywords": ["Bloom filter", " network forensics", " payload attribution system", " wildcard search"], "paper_abstract": "Network forensic analysts employ payload attribution systems (PAS) as an investigative tool, which enables them to store and summarize large amounts of network traffic, including full packet payload. Hence an investigator could query the system for a specific string and check whether any of the packets transmitted previously in the network contained that specific string. As a shortcoming, the previously proposed techniques are unable to support wildcard queries. Wildcards are an important type of query that allow the investigator to locate strings in the payload when only part of the string is known. In this paper, a new data structure for payload attribution, named Character Dependent Multi-Bloom Filters, will be presented which, in addition to improving the previously proposed techniques, is able to support wildcard queries as well. To this end, a theoretical study of the proposed method was conducted in order to evaluate its false positive when responding to queries and subsequently the theoretical analysis is verified through a number of experiments. Furthermore, comparisons are made between the proposed method and the state-of-the-art attribution techniques presented in the literature. The results suggest that, using the Character Dependent Multi-Bloom Filters, one can obtain a data reduction ratio of about 265 : 1 opposed to 210 : 1 as obtained by the previously proposed state-of-the-art techniques assuming a similar false-positive rate. More importantly, the results indicate that a wildcard query with seven unknown characters would take approximately less than 1 second to process, using the proposed method; while given the previous techniques, as an exhaustive search is required, the same query takes about 4500 years to process.", "paper_title": "Payload Attribution via Character Dependent Multi-Bloom Filters", "paper_id": "WOS:000319723800001"}