{"auto_keywords": [{"score": 0.03163537021432405, "phrase": "shape_collection"}, {"score": 0.00481495049065317, "phrase": "qualitative_organization_of_collections_of"}, {"score": 0.004745260932479212, "phrase": "quartet_analysis"}, {"score": 0.004542158659382197, "phrase": "heterogeneous_collection"}, {"score": 0.004284755353695709, "phrase": "quantitative_distances"}, {"score": 0.004141365648080381, "phrase": "dissimilar_shapes"}, {"score": 0.004041879818641576, "phrase": "qualitative_analysis"}, {"score": 0.003983334573043943, "phrase": "multiple_distance_measures"}, {"score": 0.0028890603352364273, "phrase": "hierarchical_structure"}, {"score": 0.0026209522797963447, "phrase": "effective_organization"}, {"score": 0.0025331002386232014, "phrase": "categorization_trees"}, {"score": 0.002400944221804575, "phrase": "truth_data"}, {"score": 0.0023776656246300063, "phrase": "human_categorization"}, {"score": 0.002264607102799332, "phrase": "separation_chart"}, {"score": 0.0021049977753042253, "phrase": "interactive_shapes"}], "paper_keywords": ["shape collections", " clustering", " organization"], "paper_abstract": "We present a method for organizing a heterogeneous collection of 3D shapes for overview and exploration. Instead of relying on quantitative distances, which may become unreliable between dissimilar shapes, we introduce a qualitative analysis which utilizes multiple distance measures but only in cases where the measures can be reliably compared. Our analysis is based on the notion of quartets, each defined by two pairs of shapes, where the shapes in each pair are close to each other, but far apart from the shapes in the other pair. Combining the information from many quartets computed across a shape collection using several distance measures, we create a hierarchical structure we call categorization tree of the shape collection. This tree satisfies the topological (qualitative) constraints imposed by the quartets creating an effective organization of the shapes. We present categorization trees computed on various collections of shapes and compare them to ground truth data from human categorization. We further introduce the concept of degree of separation chart for every shape in the collection and show the effectiveness of using it for interactive shapes exploration.", "paper_title": "Qualitative Organization of Collections of Shapes via Quartet Analysis", "paper_id": "WOS:000321840100040"}