{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "critical_infrastructures"}, {"score": 0.011645000733894162, "phrase": "new_method"}, {"score": 0.0044922081848067135, "phrase": "general_population"}, {"score": 0.003693973656103879, "phrase": "previous_studies"}, {"score": 0.003338992028053874, "phrase": "different_types"}, {"score": 0.0032148229832850215, "phrase": "hybrid_model"}, {"score": 0.0029613581079886227, "phrase": "anp"}, {"score": 0.002887450071878095, "phrase": "danp"}, {"score": 0.002815383690003621, "phrase": "proposed_model"}, {"score": 0.002676587673012276, "phrase": "original_anp_method"}, {"score": 0.0024810969143761216, "phrase": "taiwan"}, {"score": 0.0022142194702079866, "phrase": "critical_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Critical infrastructure", " Interdependency", " DANP", " DEMATEL", " ANP"], "paper_abstract": "The failure of critical infrastructures may be hazardous to the general population, the economy, even national security. Disruptions in one type of infrastructure often transverse to other dependent infrastructures and possibly even back to the infrastructure where the failure originated. Unlike previous studies, this paper proposes a new method which addresses this interdependency and the feedback effects between different types of critical infrastructures by using a hybrid model which is a combination of both the Decision-Making Trial and Evaluation Laboratory (DEMATEL) and the Analytic Network Process (ANP) (called DANP). The proposed model not only remedies the shortcomings in the original ANP method but is also more reasonable. Data related to infrastructure in Taiwan are used to demonstrate this method. The new method can effectively capture the interdependency and prioritizes the critical types of infrastructure. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A method for exploring the interdependencies and importance of critical infrastructures", "paper_id": "WOS:000329560700007"}