{"auto_keywords": [{"score": 0.03900835666784652, "phrase": "hc_surfaces"}, {"score": 0.005426700233898443, "phrase": "parameter_domain"}, {"score": 0.00481495049065317, "phrase": "intrinsic_feature_extraction"}, {"score": 0.004781215097314411, "phrase": "hippocampal_surfaces"}, {"score": 0.00463229351153731, "phrase": "novel_approach"}, {"score": 0.004394281902031765, "phrase": "key_target"}, {"score": 0.004332894955218135, "phrase": "medical_imaging"}, {"score": 0.003968112038249246, "phrase": "hc_morphometry"}, {"score": 0.003737697279708501, "phrase": "thickness_changes"}, {"score": 0.003595779240933435, "phrase": "hc"}, {"score": 0.0035206159394281745, "phrase": "ad."}, {"score": 0.003447035529485425, "phrase": "upper_and_lower_surface_patches"}, {"score": 0.0033749889869455407, "phrase": "conformal_modules"}, {"score": 0.0030259817489390302, "phrase": "hc_surface"}, {"score": 0.0028301085867789076, "phrase": "level_sets"}, {"score": 0.002761176640988626, "phrase": "tubular_domain"}, {"score": 0.0026750045328382717, "phrase": "individual_hc_surface"}, {"score": 0.002582400033640049, "phrase": "spherical_parameterization"}, {"score": 0.0025552481859513684, "phrase": "ehp"}, {"score": 0.0024842242921857705, "phrase": "intrinsic_feature_curves"}, {"score": 0.0024066745849759706, "phrase": "shape_analysis"}, {"score": 0.002298902547676131, "phrase": "geometric_changes"}, {"score": 0.0022192891418394514, "phrase": "normal_subjects"}, {"score": 0.002142426911242168, "phrase": "significantly_different_shape_changes"}], "paper_keywords": ["hippocampus", " intrinsic feature curve", " Laplace-Beltrami eigenfunction", " shape analysis"], "paper_abstract": "This paper proposes a novel approach for extracting two intrinsic feature curves on hippocampal (HC) surfaces. The hippocampus is a key target of study in medical imaging, as it degenerates in conditions such as epilepsy and Alzheimer's disease (AD), but its structure is complex. To facilitate HC morphometry, we generate two intrinsic feature curves that describe their global geometries. For example, the separation of them captures thickness changes in HC surfaces, which can be used to effectively measure HC atrophy found in patients with AD. They also separate HC surfaces into upper and lower surface patches where intrinsic shape analysis using conformal modules can be carried out. Based on these curves, we further propose a parameterization of HC surfaces called the eigen-harmonic parameterization (EHP). EHP maps each HC surface onto a parameter domain and imposes longitudinal and azimuthal coordinates on each surface, which follow the gradient and level sets of its first nontrivial Laplace-Beltrami eigenfunction, respectively. Each tubular domain is constructed according to the geometry of an individual HC surface. This gives a parameter domain with much less geometric distortion compared to spherical parameterization. With EHP, all HC surfaces are automatically registered with intrinsic feature curves preserved and geometric distortions minimized. This allows shape analysis on any number of HC surfaces to be performed consistently. We studied geometric changes over time in 138 HC surfaces of patients with AD and normal subjects scanned at two different times. We successfully located areas with significantly different shape changes over time between the two groups.", "paper_title": "Intrinsic Feature Extraction on Hippocampal Surfaces and Its Applications", "paper_id": "WOS:000306100200010"}