{"auto_keywords": [{"score": 0.04377588693056619, "phrase": "computational_complexity"}, {"score": 0.00481495049065317, "phrase": "distributed_computing"}, {"score": 0.004755650013733963, "phrase": "complete_complexity_classification"}, {"score": 0.004378469469879815, "phrase": "seven_local_computations_models"}, {"score": 0.004132312946154097, "phrase": "decision_problems"}, {"score": 0.003997891221012094, "phrase": "naming_problem"}, {"score": 0.00371115485111022, "phrase": "polynomial_time"}, {"score": 0.0033465923623290034, "phrase": "remaining_eight_models"}, {"score": 0.0030680994147125364, "phrase": "graph_labeling_problem"}, {"score": 0.002931569771634119, "phrase": "alternative_proof"}, {"score": 0.0028953973490895746, "phrase": "already_known_co-np-completeness_result"}, {"score": 0.0026543514413663893, "phrase": "fixed_integer"}, {"score": 0.002373615081691254, "phrase": "close_relationship"}, {"score": 0.002203117204010397, "phrase": "\"constrained\"_graph"}, {"score": 0.0021579641460002523, "phrase": "already_known_locally_constrained_graph_homomorphisms"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["graph labeling", " graph homomorphism", " computational complexity", " message-passing", " local computation", " leader election", " naming"], "paper_abstract": "We discuss 11 known basic models of distributed computing: four message-passing models that differ by the (non) existence of port-numbers and a hierarchy of seven local computations models. In each of these models, we study the computational complexity of the decision problems if the leader election and if the naming problem can be solved on a given network. It is already known that these two decision problems are solvable in polynomial time for two models and are co-NP-complete for another one. Here, we settle the computational complexity for both problems in the remaining eight models by showing that they are co-NP-complete. We do this by translating each problem into a graph labeling problem. By using this technique, we also obtain an alternative proof for the already known co-NP-completeness result. In the second part of our article, we completely classify the computational complexity of all the corresponding graph labeling problems, i.e., for every fixed integer k >= 1 we determine the complexity of the problem that asks whether a given graph allows a certain graph labeling that uses at most k labels. We also explain the close relationship of these labelings to graph homomorphisms that satisfy some further (global or local) constraints. This yields a new class of \"constrained\" graph homomorphisms that include the already known locally constrained graph homomorphisms. (C) 2011 Wiley Periodicals, Inc. NETWORKS, Vol. 58(3), 207-231 2011", "paper_title": "Graph Labelings Derived from Models in Distributed Computing: A Complete Complexity Classification", "paper_id": "WOS:000295292400005"}