{"auto_keywords": [{"score": 0.04747135426005355, "phrase": "data_points"}, {"score": 0.015719716506582538, "phrase": "spectral_clustering"}, {"score": 0.013312955586593891, "phrase": "leading_eigenvectors"}, {"score": 0.011126834770142648, "phrase": "latent_tree_models"}, {"score": 0.007632463176503662, "phrase": "ideal_case"}, {"score": 0.004652016085325825, "phrase": "similarity_matrix"}, {"score": 0.004398872331144531, "phrase": "so-called_laplacian_matrix"}, {"score": 0.004268293864953256, "phrase": "laplacian_matrix"}, {"score": 0.0040186038781533946, "phrase": "last_step"}, {"score": 0.003426556090707852, "phrase": "novel_method"}, {"score": 0.0032820385246266773, "phrase": "previous_rounding_methods"}, {"score": 0.002668582249630492, "phrase": "subsequent_eigenvectors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Spectral clustering", " Rounding", " Latent tree models"], "paper_abstract": "In spectral clustering, one defines a similarity matrix for a collection of data points, transforms the matrix to get the so-called Laplacian matrix, finds the eigenvectors of the Laplacian matrix, and obtains a partition of the data points using the leading eigenvectors. The last step is sometimes referred to as rounding, where one needs to decide how many leading eigenvectors to use, to determine the number of clusters, and to partition the data points. In this paper, we propose a novel method using latent tree models for rounding. The method differs from previous rounding methods in three ways. First, we relax the assumption that the number of clusters equals the number of eigenvectors used. Second, when deciding how many leading eigenvectors to use, we not only rely on information contained in the leading eigenvectors themselves, but also make use of the subsequent eigenvectors. Third, our method is model-based and solves all the three subproblems of rounding using latent tree models. We evaluate our method on both synthetic and real-world data. The results show that our method works correctly in the ideal case where between-clusters similarity is 0, and degrades gracefully as one moves away from the ideal case. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Latent tree models for rounding in spectral clustering", "paper_id": "WOS:000341677800041"}