{"auto_keywords": [{"score": 0.04758670800815224, "phrase": "information_ethics"}, {"score": 0.00481495049065317, "phrase": "\"a_brief_history_of_information_ethics"}, {"score": 0.004769788530328504, "phrase": "thomas_froehlich"}, {"score": 0.004193220779864395, "phrase": "information_science"}, {"score": 0.004153868479262447, "phrase": "froehlich"}, {"score": 0.003950103621065539, "phrase": "computer_ethics"}, {"score": 0.003925343598987006, "phrase": "intellectual_property"}, {"score": 0.0038762863757919237, "phrase": "fair_representation"}, {"score": 0.0038278398921822404, "phrase": "computer_crime"}, {"score": 0.0038038433163457754, "phrase": "software_reliability"}, {"score": 0.003779996603264111, "phrase": "artificial_intelligence"}, {"score": 0.0034504976926879424, "phrase": "media_ethics"}, {"score": 0.0033966530720227796, "phrase": "journalistic_ethics"}, {"score": 0.003179500862953224, "phrase": "intercultural_information_ethics"}, {"score": 0.0031595558075901164, "phrase": "digital_divide"}, {"score": 0.0031200390864992407, "phrase": "ethical_role"}, {"score": 0.0029021941361680637, "phrase": "specific_kinds"}, {"score": 0.00281227375628713, "phrase": "familiar_figure"}, {"score": 0.0027683608802260636, "phrase": "ethical_subject"}, {"score": 0.0027423420665298646, "phrase": "moral_deliberation"}, {"score": 0.0026741446768534824, "phrase": "moral_rights"}, {"score": 0.0024485031231407522, "phrase": "ethical_principles"}, {"score": 0.002335542599406245, "phrase": "unfettered_access"}, {"score": 0.0022846219120101112, "phrase": "information_offensive"}, {"score": 0.0021049977753042253, "phrase": "ethical_reflection"}], "paper_keywords": [""], "paper_abstract": "In \"A Brief History of Information Ethics,\" Thomas Froehlich (2004) quickly surveyed under several broad categories some of the many issues that constitute information ethics: under the category of librarianship-censorship, privacy, access, balance in collections, copyright, fair use, and codes of ethics; under information science, which Froehlich sees as closely related to libraiwanship-confidentiality, bias, and quality of information; under computer ethics-intellectual property, privacy, fair representation, nonmaleficence, computer crime, software reliability, artificial intelligence, and e-commerce; under cyberethics (issues related to the Internet, or \"cyberspace\")-expert systems, artificial intelligence (again), and robotics; under media ethics-news, impartiality, journalistic ethics, deceit, lies, sexuality, censorship (again), and violence in the press; and under intercultural information ethics-digital divide, and the ethical role of the Internet for social, political, cultural, and economic development. Many of the debates in information ethics, on these and other issues, have to do with specific kinds of relationships between subjects. The most important subject and a familiar figure in information ethics is the ethical subject engaged in moral deliberation, whether appearing as the bearer of moral rights and obligations to other subjects, or as an agent whose actions are judged, whether by others or by oneself, according to the standards of various moral codes and ethical principles. Many debates in information ethics revolve around conflicts between those acting according to principles of unfettered access to information and those finding some information offensive or harmful. Subjectivity is at the heart of information ethics. But how is subjectivity understood? Can it be understood in ways that broaden ethical reflection to include problems that remain invisible when subjectivity is taken for granted and when how it is created remains unquestioned? This article proposes some answers by investigating the meaning and role of subjectivity in information ethics.", "paper_title": "Subjectivity and information ethics", "paper_id": "WOS:000252161000009"}