{"auto_keywords": [{"score": 0.03550179179289911, "phrase": "ces"}, {"score": 0.010922827836646849, "phrase": "ses"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_dam-break_flow_simulation"}, {"score": 0.004125027493339274, "phrase": "well-established_traditional_numerical_methods"}, {"score": 0.004007083686875716, "phrase": "finite_difference"}, {"score": 0.0039685202936462815, "phrase": "finite_element"}, {"score": 0.003911367220315185, "phrase": "finite-volume_methods"}, {"score": 0.0035507457285983268, "phrase": "unified_way"}, {"score": 0.003254610516477302, "phrase": "local_and_global_flux_conservations"}, {"score": 0.003056169480391946, "phrase": "explicit_scheme"}, {"score": 0.0030121159909273897, "phrase": "stagger_grid"}, {"score": 0.0026175952455594277, "phrase": "source_terms"}, {"score": 0.002542642270762272, "phrase": "critical_role"}, {"score": 0.0025181367444581993, "phrase": "dam-break_flows"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["dam-break flow", " shallow water equations", " CE", " SE scheme", " free-surface flow", " numerical method", " conservation laws"], "paper_abstract": "A new numerical scheme, namely spacetime conservation element and solution element (CE/SE) method, has been used for the solution of the two-dimensional (2D) dam-break problem. Distinguishing from the well-established traditional numerical methods (such as characteristics, finite difference, finite element, and finite-volume methods), the CE/SE scheme has many non-traditional features in both concept and methodology: space and time are treated in a unified way, which is the most important characteristic for the CE/SE method; the CEs and SEs are introduced, both local and global flux conservations in space and time rather than space only are enforced; an explicit scheme with a stagger grid is adopted. Furthermore, this scheme is robust and easy to implement. In this paper, an improved CE/SE scheme is extended to solve the 2D shallow water equations with the source terms, which usually plays a critical role in dam-break flows. To demonstrate the accuracy, robustness and efficiency of the improved CE/SE method, both 1D and 2D dam-break problems are simulated numerically, and the results are consistent with either the analytical solutions or experimental results. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "The improved space-time conservation element and solution element scheme for two-dimensional dam-break flow simulation", "paper_id": "WOS:000299258200005"}