{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interesting_positive_and_negative_quantitative_association_rules"}, {"score": 0.004683540676363745, "phrase": "mining_quantitative_association_rules"}, {"score": 0.004628320711601916, "phrase": "positive_dependencies"}, {"score": 0.004573748810476845, "phrase": "particular_attention"}, {"score": 0.00453772385360173, "phrase": "negative_dependencies"}, {"score": 0.0038737214010638745, "phrase": "generated_rules"}, {"score": 0.0036940852452587093, "phrase": "association_rules"}, {"score": 0.003650488388949457, "phrase": "multiobjective_problem"}, {"score": 0.0034949740315415043, "phrase": "different_degrees"}, {"score": 0.0032934951320964276, "phrase": "mopnar"}, {"score": 0.003128270147867462, "phrase": "reduced_set"}, {"score": 0.0031035949505887083, "phrase": "positive_and_negative_quantitative_association_rules"}, {"score": 0.002947868524740683, "phrase": "recent_multiobjective_evolutionary_algorithm"}, {"score": 0.002867268370615848, "phrase": "evolutionary_learning"}, {"score": 0.0027668603377225564, "phrase": "condition_selection"}, {"score": 0.002680556511196791, "phrase": "external_population"}, {"score": 0.002648889316519512, "phrase": "restarting_process"}, {"score": 0.0022162970216404927, "phrase": "good_coverage"}, {"score": 0.002138636271204459, "phrase": "proposed_approach"}], "paper_keywords": ["Data mining", " MOEA/D-DE", " multiobjective evolutionary algorithms", " negative association rules", " quantitative association rules"], "paper_abstract": "Most of the algorithms for mining quantitative association rules focus on positive dependencies without paying particular attention to negative dependencies. The latter may be worth taking into account, however, as they relate the presence of certain items to the absence of others. The algorithms used to extract such rules usually consider only one evaluation criterion in measuring the quality of generated rules. Recently, some researchers have framed the process of extracting association rules as a multiobjective problem, allowing us to jointly optimize several measures that can present different degrees of trade-off depending on the dataset used. In this paper, we propose MOPNAR, a new multiobjective evolutionary algorithm, in order to mine a reduced set of positive and negative quantitative association rules with low computational cost. To accomplish this, our proposal extends a recent multiobjective evolutionary algorithm based on decomposition to perform an evolutionary learning of the intervals of the attributes and a condition selection for each rule, while introducing an external population and a restarting process to store all the nondominated rules found and to improve the diversity of the rule set obtained. Moreover, this proposal maximizes three objectives-comprehensibility, interestingness, and performance-in order to obtain rules that are interesting, easy to understand, and provide good coverage of the dataset. The effectiveness of the proposed approach is validated over several real-world datasets.", "paper_title": "A New Multiobjective Evolutionary Algorithm for Mining a Reduced Set of Interesting Positive and Negative Quantitative Association Rules", "paper_id": "WOS:000330890700005"}