{"auto_keywords": [{"score": 0.041390252700290016, "phrase": "nis"}, {"score": 0.010612354964977023, "phrase": "information_quality"}, {"score": 0.010502589419307058, "phrase": "nursing_information_system"}, {"score": 0.006780434096642553, "phrase": "information_needs"}, {"score": 0.004475022550508119, "phrase": "patient_information"}, {"score": 0.004428452434981208, "phrase": "key_factor"}, {"score": 0.0043976740574978085, "phrase": "nurses'_adoption"}, {"score": 0.004144510906908392, "phrase": "perceived_quality"}, {"score": 0.004044534825749132, "phrase": "teaching_hospital"}, {"score": 0.004002448657626936, "phrase": "netherlands"}, {"score": 0.0037719307016238998, "phrase": "six_wards"}, {"score": 0.0036172364609815487, "phrase": "paper_questionnaire"}, {"score": 0.003373334961160647, "phrase": "twelve_nis-users"}, {"score": 0.003303412571939192, "phrase": "use_it-model"}, {"score": 0.0032236602306747637, "phrase": "broad_need"}, {"score": 0.0027838831266525773, "phrase": "achieved_quality"}, {"score": 0.002614228362365338, "phrase": "required_information_quality"}, {"score": 0.002395571076685383, "phrase": "information_quality-literature"}, {"score": 0.0021496083700137305, "phrase": "accurate_data-entry"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Evaluation research", " Computerized medical records systems", " Hospital Information Systems", " Data quality"], "paper_abstract": "Purpose: Providing access to patient information is the key factor in nurses' adoption of a Nursing Information System (NIS). In this study the requirements for information quality and the perceived quality of information are investigated. A teaching hospital in the Netherlands has developed a NIS as a module of the Hospital Information System. After the NIS was implemented in six wards in March 2009, the NIS was evaluated. Methods: A paper questionnaire was distributed among all 195 nurses, who used the system. Included in the research were 93 (48%) respondents. Also twelve NIS-users were interviewed, using the USE IT-model. Results: Nurses express a broad need for information of each patient. Although the history is essential, the information needs are not very specified. They expect complete, correct, up-to-date and accessible information of each patient. The information quality of the NIS is satisfactory, but needs improvement. Since the achieved quality of information depends largely on the data-entry by the nurses themselves, a controversy exists between the required information quality and the effort needed to accomplish this. Conclusions: The aspect of data-entry by the user of the information is not included in Information Quality-literature. To further increase the quality of information, a redesign of both process and system seems necessary, which reduces the information needs of nurses and rewards the nurse for accurate data-entry. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Information Quality of a Nursing Information System depends on the nurses: A combined quantitative and qualitative evaluation", "paper_id": "WOS:000308976000013"}