{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_emotion"}, {"score": 0.003606866938661143, "phrase": "theoretical_and_methodological_richness"}, {"score": 0.0032272929113113203, "phrase": "diverse_accounts"}, {"score": 0.0031422859551159506, "phrase": "underlying_epistemology"}, {"score": 0.003114449258490062, "phrase": "theoretical_perspective"}, {"score": 0.0028492532869274743, "phrase": "diverse_outcomes"}, {"score": 0.002824005136794786, "phrase": "published_papers"}, {"score": 0.0025605773834404253, "phrase": "researcher_motivation"}, {"score": 0.00233202607446404, "phrase": "background_assumptions"}, {"score": 0.00221068461235127, "phrase": "research_production"}], "paper_keywords": ["Epistemology", " Design research", " Emotion"], "paper_abstract": "Recently researchers from a range of disciplines have begun inquiring into the place of emotion in the design and use of technology to ask how, and in what ways, products and systems evoke emotions in people and how these emotions can be understood, measured, or more generally assessed? This diversity of perspectives has brought theoretical and methodological richness to the field, yet has made it increasing challenging to make sense of the literature. This paper argues that by organizing these diverse accounts of design according to the underlying epistemology and theoretical perspective, it is possible to accommodate a variety of approaches and provide a way to give meaning to the diverse outcomes. Published papers representing a range of the approaches to research on human emotion were identified in the literature, and assessed in terms of researcher motivation, the way \"emotion'' is conceptualized and operationalized, the nature of the knowledge claims, and the background assumptions of the authors, both implicit and explicit. By mapping research production to more fundamental assumptions and values, a space is opened for more constructive and nuanced dialog on the validity, meaning, and significance of diversity for advancing the field overall.", "paper_title": "Designing for human emotion: ways of knowing", "paper_id": "WOS:000279056300003"}