{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "developer's_knowledge"}, {"score": 0.008770951863001086, "phrase": "knowledge_transfer"}, {"score": 0.004693476992528682, "phrase": "software_system"}, {"score": 0.004255431326383001, "phrase": "particular_parts"}, {"score": 0.003891140864902669, "phrase": "externalized_model"}, {"score": 0.003841699919521703, "phrase": "developer's_individual_knowledge"}, {"score": 0.003527712410706358, "phrase": "knowledge_model"}, {"score": 0.003409399407390298, "phrase": "-code_element"}, {"score": 0.003157455511069507, "phrase": "developer's_authorship"}, {"score": 0.003130633384437765, "phrase": "interaction_data"}, {"score": 0.0027194778713860715, "phrase": "case_studies"}, {"score": 0.0026963662375234124, "phrase": "expert_finding"}, {"score": 0.0025076619172878945, "phrase": "existing_expertise-finding_approach"}, {"score": 0.0022828795331819025, "phrase": "starting_point"}, {"score": 0.0021049977753042253, "phrase": "multiple_development_sites"}], "paper_keywords": ["Human Factors", " Authorship", " degree-of-interest", " degree-of-knowledge", " expertise", " onboarding", " recommendation", " development environment"], "paper_abstract": "As a software system evolves, the system's codebase constantly changes, making it difficult for developers to answer such questions as who is knowledgeable about particular parts of the code or who needs to know about changes made. In this article, we show that an externalized model of a developer's individual knowledge of code can make it easier for developers to answer such questions. We introduce a degree-of-knowledge model that computes automatically, for each source-code element in a codebase, a real value that represents a developer's knowledge of that element based on a developer's authorship and interaction data. We present evidence that shows that both authorship and interaction data of the code are important in characterizing a developer's knowledge of code. We report on the usage of our model in case studies on expert finding, knowledge transfer, and identifying changes of interest. We show that our model improves upon an existing expertise-finding approach and can accurately identify changes for which a developer should likely be aware. We discuss how our model may provide a starting point for knowledge transfer but that more refinement is needed. Finally, we discuss the robustness of the model across multiple development sites.", "paper_title": "Degree-of-Knowledge: Modeling a Developer's Knowledge of Code", "paper_id": "WOS:000334997700004"}