{"auto_keywords": [{"score": 0.04326084560820555, "phrase": "optimal_solution_path"}, {"score": 0.015289399245255084, "phrase": "solution_paths"}, {"score": 0.014329920399745908, "phrase": "limited_enforcement"}, {"score": 0.008713768692145006, "phrase": "limited-enforcement_intelligent_tutoring_system"}, {"score": 0.004344123393283444, "phrase": "medical_tutoring_system"}, {"score": 0.004250302819248558, "phrase": "optimal_and_most_efficient_solution_path"}, {"score": 0.003557752688779838, "phrase": "slidetutor-a_medical_intelligent_tutoring_system"}, {"score": 0.0034269461127992688, "phrase": "commonly_used_diagnostic_algorithms"}, {"score": 0.003300932921856956, "phrase": "different_sizes"}, {"score": 0.0032295691829911538, "phrase": "tutoring_system"}, {"score": 0.0032094634756436595, "phrase": "student_errors"}, {"score": 0.0031894825360137694, "phrase": "goat_states"}, {"score": 0.003015143226706584, "phrase": "tutoring_system's_expectation"}, {"score": 0.0028861422653675283, "phrase": "error_significance"}, {"score": 0.002868168412858044, "phrase": "student_performance"}, {"score": 0.0028237205895435733, "phrase": "tutor-defined_optimal_path"}, {"score": 0.00260342914245402, "phrase": "goal_differences"}, {"score": 0.0024457118327295456, "phrase": "superficial_perivascular_dermatitis"}, {"score": 0.002422890839801611, "phrase": "larger_and_more_complex_domain"}, {"score": 0.002385326947545194, "phrase": "slower_rate"}, {"score": 0.0022903576812801432, "phrase": "limited-enforcement_tutoring_system"}, {"score": 0.0022268288922192704, "phrase": "alternative_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intelligent tutoring systems", " Diagnostic reasoning", " Clinical competence", " Cognition", " Diagnostic errors", " Education", " Medical", " Educational technology", " Dermatology", " Pathology", " Problem solving"], "paper_abstract": "Objectives: Determine effects of a limited-enforcement intelligent tutoring system in dermatopathology on student errors, goals and solution paths. Determine if limited enforcement in a medical tutoring system inhibits students from (earning the optimal and most efficient solution path. Describe the type of deviations from the optimal solution path that occur during tutoring, and how these deviations change over time. Determine if the size of the problem-space (domain scope), has an effect on (earning gains when using a tutor with limited enforcement. Methods: Analyzed data mined from 44 pathology residents using SlideTutor-a Medical Intelligent Tutoring System in Dermatopathology that teaches histopathologic diagnosis and reporting skills based on commonly used diagnostic algorithms. Two subdomains were included in the study representing sub-algorithms of different sizes and complexities. Effects of the tutoring system on student errors, goat states and solution paths were determined. Results: Students gradually increase the frequency of steps that match the tutoring system's expectation of expert performance. Frequency of errors gradually declines in all categories of error significance. Student performance frequently differs from the tutor-defined optimal path. However, as students continue to be tutored, they approach the optimal solution path. Performance in both subdomains was similar for both errors and goal differences. However, the rate at which students progress toward the optimal solution path differs between the two domains. Tutoring in superficial perivascular dermatitis, the larger and more complex domain was associated with a slower rate of approximation towards the optimal solution path. Conclusions: Students benefit from a limited-enforcement tutoring system that leverages diagnostic algorithms but does not prevent alternative strategies. Even with limited enforcement, students converge toward the optimal solution path. (C) 2009 Published by Elsevier B.V.", "paper_title": "Effect of a limited-enforcement intelligent tutoring system in dermatopathology on student errors, goals and solution paths", "paper_id": "WOS:000272405100001"}