{"auto_keywords": [{"score": 0.03718034097391595, "phrase": "re-identification_risk"}, {"score": 0.024311105544860597, "phrase": "hypothesis_testing_approach"}, {"score": 0.02246846748295755, "phrase": "baseline_k-anonymity"}, {"score": 0.00481495049065317, "phrase": "health_information"}, {"score": 0.004494570360108983, "phrase": "personal_health_information"}, {"score": 0.004443276312972159, "phrase": "serious_privacy_concerns"}, {"score": 0.0038052556098065694, "phrase": "actual_re-identification_probability"}, {"score": 0.0037617986040878342, "phrase": "k-anonymized_data_sets"}, {"score": 0.003334309053314909, "phrase": "re-identification_probability"}, {"score": 0.0031121406603482112, "phrase": "commonly_used_discernability_metric"}, {"score": 0.0029722900280316216, "phrase": "re-identification_scenarios"}, {"score": 0.0026955672787561742, "phrase": "small_sampling_fractions"}, {"score": 0.002664749302333897, "phrase": "over-anonymization_results"}, {"score": 0.002361632539339945, "phrase": "subsequent_analysis"}, {"score": 0.0022424956516376073, "phrase": "best_control"}, {"score": 0.0021416404045850224, "phrase": "information_loss"}], "paper_keywords": [""], "paper_abstract": "Objective: There is increasing pressure to share health information and even make it publicly available. However, such disclosures of personal health information raise serious privacy concerns. To alleviate such concerns, it is possible to anonymize the data before disclosure. One popular anonymization approach is k-anonymity. There have been no evaluations of the actual re-identification probability of k-anonymized data sets. Design: Through a simulation, we evaluated the re-identification risk of k-anonymization and three different improvements on three large data sets. Measurement: Re-identification probability is measured under two different re-identification scenarios. Information loss is measured by the commonly used discernability metric. Results: For one of the re-identification scenarios, k-Anonymity consistently over-anonymizes data sets, with this over-anonymization being most pronounced with small sampling fractions. Over-anonymization results in excessive distortions to the data (i.e., high information loss), making the data less useful for subsequent analysis. We found that a hypothesis testing approach provided the best control over re-identification risk and reduces the extent of information loss compared to baseline k-anonymity. Conclusion: Guidelines are provided on when to use the hypothesis testing approach instead of baseline k-anonymity.", "paper_title": "Protecting privacy using k-anonymity", "paper_id": "WOS:000259503800008"}