{"auto_keywords": [{"score": 0.047980353816681115, "phrase": "fb"}, {"score": 0.02190535231578448, "phrase": "twitter"}, {"score": 0.004696608876994947, "phrase": "facebook_plus_twitter"}, {"score": 0.0046501524708155275, "phrase": "facebook"}, {"score": 0.004490842671590769, "phrase": "popular_social_networking_sites"}, {"score": 0.0034660938095219846, "phrase": "significantly_lower_loneliness"}, {"score": 0.0034317185678527672, "phrase": "higher_number"}, {"score": 0.003397683082821229, "phrase": "fb_friends"}, {"score": 0.003347259612209552, "phrase": "lower_number"}, {"score": 0.0026086775334428617, "phrase": "online_interactions"}, {"score": 0.0023028105026714533, "phrase": "increased_feelings"}, {"score": 0.0022460727898764216, "phrase": "current_study_findings"}, {"score": 0.002223770196464436, "phrase": "additional_insights"}, {"score": 0.002126111716875144, "phrase": "excessive_use"}, {"score": 0.0021049977753042253, "phrase": "social_networking_sites"}], "paper_keywords": [""], "paper_abstract": "Facebook (FB) and Twitter are popular social networking sites. This study examined differences between those who use both sites versus only FB, to test the hypothesis that mono-users differ in their personality characteristics from users active in both websites. Participants were 205 undergraduate students: 96 only used FB, 109 used FB and Twitter. Participants who used both sites reported significantly lower loneliness, higher number of FB friends, and lower number of minutes spent online, as compared to those who used only FB. Loneliness was positively associated with FB use only in those who used FB alone but was negatively associated with and negatively predicted both FB and Twitter use in those who used both websites. Findings suggest that more intense use of online interactions is more frequently found in mono-users (people using only Facebook) as compared to those using both websites, and it is predicted by increased feelings of loneliness. The current study findings provide additional insights on what personality factors may make some people prone to excessive use of social networking sites.", "paper_title": "Differences Between People Who Use Only Facebook and Those Who Use Facebook Plus Twitter", "paper_id": "WOS:000349841800008"}