{"auto_keywords": [{"score": 0.04286314458219275, "phrase": "social_psychology"}, {"score": 0.00481495049065317, "phrase": "online_social_networks"}, {"score": 0.0047920120174595555, "phrase": "influence_maximization"}, {"score": 0.004667780781335814, "phrase": "small_subset"}, {"score": 0.004568525347438891, "phrase": "social_network"}, {"score": 0.004112711391952791, "phrase": "extensive_research"}, {"score": 0.003930161782367799, "phrase": "existing_im_techniques"}, {"score": 0.003809932244103758, "phrase": "individual's_ability"}, {"score": 0.0037288497164934334, "phrase": "person's_inclination"}, {"score": 0.0034790978593553794, "phrase": "influence_probabilities"}, {"score": 0.0034459835582278746, "phrase": "underlying_data"}, {"score": 0.003421354125907445, "phrase": "influence_spreads"}, {"score": 0.003308716433852877, "phrase": "context-specific_influence"}, {"score": 0.003253791343615811, "phrase": "salient_feature"}, {"score": 0.0031693109468450644, "phrase": "popular_social_forces"}, {"score": 0.003072285184441679, "phrase": "novel_greedy_algorithm"}, {"score": 0.0029853535424953595, "phrase": "im_problem"}, {"score": 0.00290087451159631, "phrase": "non-overlapping_subnetworks"}, {"score": 0.0028187792953857957, "phrase": "conformity_indices"}, {"score": 0.0026742419973883134, "phrase": "marginal_gains"}, {"score": 0.0026235360404084137, "phrase": "descending_order"}, {"score": 0.0025923329357122296, "phrase": "maximum_marginal_gain"}, {"score": 0.002543176085553453, "phrase": "data_structure"}, {"score": 0.0024476342860461865, "phrase": "seed_set"}, {"score": 0.0024301229420875155, "phrase": "key_feature"}, {"score": 0.0023954743066925714, "phrase": "node's_influence_computation"}, {"score": 0.002316532084420729, "phrase": "entire_network"}, {"score": 0.0022834993174767016, "phrase": "seamless_adoption"}, {"score": 0.002256331300616345, "phrase": "distributed_platform"}, {"score": 0.0022348292780554847, "phrase": "real-world_social_networks"}, {"score": 0.002145703330831668, "phrase": "distributed_variants"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_im_approaches"}], "paper_keywords": ["Social networks", " Influence maximization", " Conformity", " Network partitioning", " Greedy algorithm"], "paper_abstract": "Influence maximization (im) is the problem of finding a small subset of nodes (seed nodes) in a social network that could maximize the spread of influence. Despite the progress achieved by state-of-the-art greedy im techniques, they suffer from two key limitations. Firstly, they are inefficient as they can take days to find seeds in very large real-world networks. Secondly, although extensive research in social psychology suggests that humans will readily conform to the wishes or beliefs of others, surprisingly, existing im techniques are conformity-unaware. That is, they only utilize an individual's ability to influence another but ignores conformity (a person's inclination to be influenced) of the individuals. In this paper, we propose a novel conformity-aware cascade () model which leverages on the interplay between influence and conformity in obtaining the influence probabilities of nodes from underlying data for estimating influence spreads. We also propose a variant of this model called model that supports context-specific influence and conformity of nodes. A salient feature of these models is that they are aligned to the popular social forces principle in social psychology. Based on these models, we propose a novel greedy algorithm called cinema that generates high-quality seed set for the im problem. It first partitions, the network into a set of non-overlapping subnetworks and for each of these subnetworks it computes the influence and conformity indices of nodes by analyzing the sentiments expressed by individuals. Each subnetwork is then associated with a cog-sublist which stores the marginal gains of the nodes in the subnetwork in descending order. The node with maximum marginal gain in each cog-sublist is stored in a data structure called mag-list. These structures are manipulated by cinema to efficiently find the seed set. A key feature of such partitioning-based strategy is that each node's influence computation and updates can be limited to the subnetwork it resides instead of the entire network. This paves way for seamless adoption of cinema on a distributed platform. Our empirical study with real-world social networks comprising of millions of nodes demonstrates that cinema as well as its context-aware and distributed variants generate superior quality seed set compared to state-of-the-art im approaches.", "paper_title": "Conformity-aware influence maximization in online social networks", "paper_id": "WOS:000348123500006"}