{"auto_keywords": [{"score": 0.03563851070044171, "phrase": "impact_factors"}, {"score": 0.023063380806384016, "phrase": "machine_learning_filters"}, {"score": 0.022025106562256144, "phrase": "discriminatory_performance"}, {"score": 0.019590476465229226, "phrase": "citation_count"}, {"score": 0.010612387000973441, "phrase": "citation_metrics"}, {"score": 0.009393353883209237, "phrase": "retrieval_task"}, {"score": 0.009292698049183562, "phrase": "gold_standard"}, {"score": 0.00828334144056963, "phrase": "different_gold_standard"}, {"score": 0.007905055495868493, "phrase": "acpj"}, {"score": 0.007516821624709885, "phrase": "citation_counts"}, {"score": 0.004694873827535293, "phrase": "high_quality_medline_documents"}, {"score": 0.004610934029355486, "phrase": "present_study"}, {"score": 0.004528488165249491, "phrase": "existing_and_novel_gold-standard-specific_machine_learning"}, {"score": 0.0037806195039533355, "phrase": "different_task"}, {"score": 0.0036202697222281373, "phrase": "ssoab_bibliography"}, {"score": 0.0032957163929772716, "phrase": "support_vector_machine_models"}, {"score": 0.0029358111718032704, "phrase": "characteristic_curve"}, {"score": 0.002760836859397696, "phrase": "gss-ml_filters"}, {"score": 0.0026918477311176376, "phrase": "ns-ml_filters"}, {"score": 0.002634084319025334, "phrase": "impact_factor"}, {"score": 0.002558985036330194, "phrase": "gss_machine_learning_filters"}, {"score": 0.0024591984725764954, "phrase": "information_retrieval_filters"}, {"score": 0.002406415352892016, "phrase": "corresponding_gold_standard"}, {"score": 0.0023804491500749106, "phrase": "filter_models"}, {"score": 0.002230418233881411, "phrase": "standard_citation_metrics"}, {"score": 0.00216680270402079, "phrase": "marginal_value"}, {"score": 0.0021049977753042253, "phrase": "better_performance"}], "paper_keywords": [""], "paper_abstract": "Objective: The present study explores the discriminatory performance of existing and novel gold-standard-specific machine learning (GSS-ML) focused filter models (i.e., models built specifically for a retrieval task and a gold standard against which they ate evaluated) and compares their performance to citation count and impact factors, and non-specific machine learning (NS-ML) models (i.e., models built for a different task and/or different gold standard). Design: Three gold standard corpora were constructed using the SSOAB bibliography, the ACPJ-cited treatment articles, and the ACPJ-cited etiology articles. Citation counts and impact factors were obtained for each article. Support vector machine models were used to classify the articles using combinations of content, impact factors, and citation counts as predictors. Measurements: Discriminatory performance was estimated using the area under the receiver operating characteristic curve and n-fold cross-validation. Results: For all three gold standards and tasks, GSS-ML filters outperformed citation count, impact factors, and NS-ML filters. Combinations of content with impact factor or citation count produced no or negligible improvements to the GSS machine learning filters. Conclusions: These experiments provide evidence that when building information retrieval filters focused on a retrieval task and corresponding gold standard, the filter models have to be built specifically for this task and gold standard. Under those conditions, machine learning filters outperform standard citation metrics. Furthermore, citation counts and impact factors add marginal value to discriminatory performance. Previous research that claimed better performance of citation metrics than machine learning in one of the corpora examined here is attributed to using machine learning filters built for a different gold standard and task.", "paper_title": "A comparison of citation metrics to machine learning filters for the identification of high quality MEDLINE documents", "paper_id": "WOS:000239072800013"}