{"auto_keywords": [{"score": 0.049618672169140725, "phrase": "multiple_files"}, {"score": 0.007651484159121885, "phrase": "single-file_scenario"}, {"score": 0.00481495049065317, "phrase": "distribution_time"}, {"score": 0.0036553070575015344, "phrase": "file_distribution_time"}, {"score": 0.0036201167891046046, "phrase": "different_situation"}, {"score": 0.0032546105164772995, "phrase": "file_sharing_application"}, {"score": 0.002997572637726648, "phrase": "minimum_time"}, {"score": 0.002869793011316547, "phrase": "explicit_expression"}, {"score": 0.002828418443899226, "phrase": "minimum_amount"}, {"score": 0.0024342079318127423, "phrase": "comprehensive_consideration"}, {"score": 0.002319127685733821, "phrase": "bandwidth_capacities"}, {"score": 0.002230984431056064, "phrase": "particular_file"}, {"score": 0.0021881743793875767, "phrase": "finish_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-Peer", " File distribution", " Multiple files", " Distribution time"], "paper_abstract": "Peer-to-Peer (P2P) file sharing attracts much attention due to its salability and robustness. One important metric in measuring the performance of a P2P file sharing system is the amount of time required for all peers to get the files. We refer this time as the file distribudon time. Researchers have proposed protocols to minimize the file distribution time under different situation. However, most works are based on the single-file scenario. On the other hand, there are studies showing that in a file sharing application, users may download multiple files at the same time. In this paper, we analyze the minimum time needed to distribute multiple files. We develop an explicit expression for the minimum amount of time needed to distribute multiple files in a heterogeneous P2P fluid model. Unlike the single-file scenario, we demonstrate that the theoretical lower bound in multi-file is not always achievable. With a comprehensive consideration of all the configurations, we elaborate how to partition the bandwidth capacities of both seeds and leechers for a particular file such that the finish time is optimal. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Analysis of distribution time of multiple files in a P2P network", "paper_id": "WOS:000324974400003"}