{"auto_keywords": [{"score": 0.04785710122151868, "phrase": "recommender_systems"}, {"score": 0.009210205262010968, "phrase": "data_sparsity"}, {"score": 0.008539098108314049, "phrase": "trust_relations"}, {"score": 0.008067795309504043, "phrase": "trust_information"}, {"score": 0.007201236062716024, "phrase": "distrust_relations"}, {"score": 0.004817808823052164, "phrase": "matrix"}, {"score": 0.004769444094319619, "phrase": "explicit_trust"}, {"score": 0.004739344544832536, "phrase": "distrust_side_information"}, {"score": 0.004709434052130218, "phrase": "improved_social_recommendation"}, {"score": 0.004620825188916713, "phrase": "online_social_networks"}, {"score": 0.004351033214640434, "phrase": "user-specific_needs"}, {"score": 0.004149166224411185, "phrase": "cold-start_problems"}, {"score": 0.003906804492585634, "phrase": "social_information"}, {"score": 0.0037969755088553326, "phrase": "rating_data"}, {"score": 0.00369022262431101, "phrase": "main_motivation"}, {"score": 0.0036207206487324506, "phrase": "recommendation_process"}, {"score": 0.003334309053314909, "phrase": "large_user_communities"}, {"score": 0.0031593674040458295, "phrase": "epinions"}, {"score": 0.0031096747349602344, "phrase": "personal_\"web"}, {"score": 0.003060763239325022, "phrase": "personal_\"block_list"}, {"score": 0.002782989122345306, "phrase": "new_source"}, {"score": 0.0024669449102126518, "phrase": "matrix_factorization-based_model"}, {"score": 0.002435834440131485, "phrase": "social_rating_networks"}, {"score": 0.002382329940096419, "phrase": "distrust_relationships"}, {"score": 0.0022860557844373943, "phrase": "cold-start_users_issues"}, {"score": 0.002242940472941759, "phrase": "epinions_dataset"}, {"score": 0.0021318918306931474, "phrase": "positive_effect"}, {"score": 0.0021049977753042253, "phrase": "explicit_distrust_information"}], "paper_keywords": ["Design", " Algorithms", " Matrix factorization", " recommender systems", " social relationships"], "paper_abstract": "With the advent of online social networks, recommender systems have became crucial for the success of many online applications/services due to their significance role in tailoring these applications to user-specific needs or preferences. Despite their increasing popularity, in general, recommender systems suffer from data sparsity and cold-start problems. To alleviate these issues, in recent years, there has been an upsurge of interest in exploiting social information such as trust relations among users along with the rating data to improve the performance of recommender systems. The main motivation for exploiting trust information in the recommendation process stems from the observation that the ideas we are exposed to and the choices we make are significantly influenced by our social context. However, in large user communities, in addition to trust relations, distrust relations also exist between users. For instance, in Epinions, the concepts of personal \"web of trust\" and personal \"block list\" allow users to categorize their friends based on the quality of reviews into trusted and distrusted friends, respectively. Hence, it will be interesting to incorporate this new source of information in recommendation as well. In contrast to the incorporation of trust information in recommendation which is thriving, the potential of explicitly incorporating distrust relations is almost unexplored. In this article, we propose a matrix factorization-based model for recommendation in social rating networks that properly incorporates both trust and distrust relationships aiming to improve the quality of recommendations and mitigate the data sparsity and cold-start users issues. Through experiments on the Epinions dataset, we show that our new algorithm outperforms its standard trust-enhanced or distrust-enhanced counterparts with respect to accuracy, thereby demonstrating the positive effect that incorporation of explicit distrust information can have on recommender systems.", "paper_title": "Matrix Factorization with Explicit Trust and Distrust Side Information for Improved Social Recommendation", "paper_id": "WOS:000344623800002"}