{"auto_keywords": [{"score": 0.039885842863603214, "phrase": "computation_time"}, {"score": 0.03726371824137731, "phrase": "tree_search"}, {"score": 0.015604935489293377, "phrase": "phylogenomic_inference"}, {"score": 0.015098546672609585, "phrase": "identical_score"}, {"score": 0.011007790629343846, "phrase": "species_tree"}, {"score": 0.01011367088126955, "phrase": "induced_partition_trees"}, {"score": 0.00481495049065317, "phrase": "common_topological_rearrangements_for_partition_trees"}, {"score": 0.004726579360618152, "phrase": "phylogenomic_analysis"}, {"score": 0.004454497011118188, "phrase": "tree_search_algorithms"}, {"score": 0.004372712391262538, "phrase": "phylogenetic_terraces"}, {"score": 0.004324361008753555, "phrase": "sparse_supermatrices"}, {"score": 0.004244955499652296, "phrase": "missing_data"}, {"score": 0.0030176779201170306, "phrase": "partition_trees"}, {"score": 0.0024512358145634358, "phrase": "newly_encountered_trees"}, {"score": 0.002379484250348599, "phrase": "partial_terraces"}, {"score": 0.0022927343007881846, "phrase": "original_full_terrace"}, {"score": 0.002258924405138231, "phrase": "partial_terrace"}, {"score": 0.0021927897271015657, "phrase": "full_terrace"}, {"score": 0.0021049977753042253, "phrase": "partial_terrace_concept"}], "paper_keywords": ["nearest neighbor interchange", " partial terraces", " phylogenetic terraces", " subtree pruning and regrafting", " tree bisection and reconnection"], "paper_abstract": "In phylogenomic analysis the collection of trees with identical score (maximum likelihood or parsimony score) may hamper tree search algorithms. Such collections are coined phylogenetic terraces. For sparse supermatrices with a lot of missing data, the number of terraces and the number of trees on the terraces can be very large. If terraces are not taken into account, a lot of computation time might be unnecessarily spent to evaluate many trees that in fact have identical score. To save computation time during the tree search, it is worthwhile to quickly identify such cases. The score of a species tree is the sum of scores for all the so-called induced partition trees. Therefore, if the topological rearrangement applied to a species tree does not change the induced partition trees, the score of these partition trees is unchanged. Here, we provide the conditions under which the three most widely used topological rearrangements (nearest neighbor interchange, subtree pruning and regrafting, and tree bisection and reconnection) change the topologies of induced partition trees. During the tree search, these conditions allow us to quickly identify whether we can save computation time on the evaluation of newly encountered trees. We also introduce the concept of partial terraces and demonstrate that they occur more frequently than the original full terrace. Hence, partial terrace is the more important factor of timesaving compared to full terrace. Therefore, taking into account the above conditions and the partial terrace concept will help to speed up the tree search in phylogenomic inference.", "paper_title": "Consequences of Common Topological Rearrangements for Partition Trees in Phylogenomic Inference", "paper_id": "WOS:000365646800007"}