{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "runtime_configuration_management"}, {"score": 0.004779085953614184, "phrase": "do-it-yourself_content_delivery_network_applications"}, {"score": 0.004620957579769604, "phrase": "new_paradigm_shift"}, {"score": 0.004224286804379592, "phrase": "on-demand_manner"}, {"score": 0.00399378014373321, "phrase": "expensive_computing_and_storage_infrastructures"}, {"score": 0.003964007795174772, "phrase": "interactive_multimedia_content-driven_applications"}, {"score": 0.003719705944877787, "phrase": "new_classes"}, {"score": 0.003691969158027291, "phrase": "big_data_applications"}, {"score": 0.0036507498735369576, "phrase": "new_generation"}, {"score": 0.003569681826459428, "phrase": "complex_content_operations"}, {"score": 0.003287482882222731, "phrase": "cloud_data_centres"}, {"score": 0.0029602552900111407, "phrase": "end-user_service_level_agreements"}, {"score": 0.0027776422068966867, "phrase": "cloud_vm"}, {"score": 0.0023554947277883535, "phrase": "performance_evaluation_methodology"}, {"score": 0.0023031224517224757, "phrase": "runtime_configuration"}, {"score": 0.002152874480615438, "phrase": "proposed_methodology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Application runtime configuration", " Cloud services evaluation", " Content delivery network", " Experimental design and analysis", " Evaluation methodology", " Mediawise cloud content orchestrator", " Public clouds"], "paper_abstract": "Cloud computing is a new paradigm shift which enables applications and related content (audio, video, text, images, etc.) to be provisioned in an on-demand manner and being accessible to anyone anywhere in the world without the need for owning expensive computing and storage infrastructures. Interactive multimedia content-driven applications in the domains of healthcare, aged-care, and education have emerged as one of the new classes of big data applications. This new generation of applications need to support complex content operations including production, deployment, consumption, personalization, and distribution. However, to efficiently provision these applications on the Cloud data centres, there is a need to understand their runtime resource configurations. For example: (i) where to store and distribute the content to and from driven by end-user Service Level Agreements (SLAs)? (ii) How many content distribution servers to provision? And (iii) what Cloud VM configuration (number of instances, types, speed, etc.) to provision? In this paper, we present concepts and factors related to engineering such content-driven applications over public Clouds. Based on these concepts and factors, we propose a performance evaluation methodology for quantifying and understanding the runtime configuration of these classes of applications. Finally, we conduct several benchmark driven experiments for validating the feasibility of the proposed methodology. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Towards understanding the runtime configuration management of do-it-yourself content delivery network applications over public clouds", "paper_id": "WOS:000337931200029"}