{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_tagging"}, {"score": 0.042457032177558765, "phrase": "resource_discovery"}, {"score": 0.004664983066310498, "phrase": "purpose_-_social_tagging_systems"}, {"score": 0.0045037997020733415, "phrase": "useful_resources"}, {"score": 0.00440976345264104, "phrase": "tag_creator"}, {"score": 0.004081385289516914, "phrase": "effective_means"}, {"score": 0.0039264465913491356, "phrase": "text_categorisation"}, {"score": 0.00376409764683147, "phrase": "support_vector_machine"}, {"score": 0.0033513085425415545, "phrase": "second_experiment"}, {"score": 0.0032013710938940424, "phrase": "performance_metrics"}, {"score": 0.0030689098754563982, "phrase": "content_analysis"}, {"score": 0.002983652306921617, "phrase": "effective_and_ineffective_tags"}, {"score": 0.002931569771634119, "phrase": "findings_-_results"}, {"score": 0.0027034263575471352, "phrase": "statistically_significant_improvement"}, {"score": 0.002609840513713399, "phrase": "svm_classifiers"}, {"score": 0.002501793273494325, "phrase": "public_users"}, {"score": 0.00247548600804924, "phrase": "earlier_work"}, {"score": 0.002290814637620121, "phrase": "social_classification"}, {"score": 0.002134888329742086, "phrase": "social_tagging_systems"}, {"score": 0.0021049977753042253, "phrase": "social_tagging_practices"}], "paper_keywords": ["Social roles", " Resources", " Resource management"], "paper_abstract": "Purpose - Social tagging systems allow users to assign keywords (tags) to useful resources, facilitating their future access by the tag creator and possibly by other users. Social tagging has both proponents and critics, and this paper aims to investigate if tags are an effective means of resource discovery. Design/methodology/approach - The paper adopts techniques from text categorisation in which webpages and their associated tags from del.icio.us and trained Support Vector Machine (SVM) classifiers are downloaded to determine if the documents could be assigned to their associated tags. Two text categorisation experiments were conducted. The first used only the terms from the documents as features while the second experiment included tags in addition to terms as part of its feature set. Performance metrics used were precision, recall, accuracy and F1 score. A content analysis was also conducted to uncover characteristics of effective and ineffective tags for resource discovery. Findings - Results from the classifiers were mixed, and the inclusion of tags as part of the feature set did not result in a statistically significant improvement (or degradation) of the performance of the SVM classifiers. This suggests that not all tags can be used for resource discovery by public users, confirming earlier work that there are many dynamic reasons for tagging documents that may not be apparent to others. Originality/value - The authors extend their understanding of social classification and its utility in sharing and accessing resources. Results of this work may be used to guide development in social tagging systems as well as social tagging practices.", "paper_title": "Resource discovery through social tagging: a classification and content analytic approach", "paper_id": "WOS:000268705700011"}