{"auto_keywords": [{"score": 0.05007797586658863, "phrase": "bittorrent's_incentives"}, {"score": 0.04867268826532295, "phrase": "bittorrent"}, {"score": 0.0047135086583390585, "phrase": "crucial_role"}, {"score": 0.0044786435725543685, "phrase": "fast_download_times"}, {"score": 0.004255431326383001, "phrase": "strategic_manipulation"}, {"score": 0.004219321533320583, "phrase": "recent_work"}, {"score": 0.0039077616208517026, "phrase": "auction-based_model"}, {"score": 0.0029617414861784525, "phrase": "bittorrent_peers"}, {"score": 0.002583713580625699, "phrase": "proportional_shares"}, {"score": 0.002465210678474529, "phrase": "proportional-share_client"}, {"score": 0.002392645551376543, "phrase": "planetlab"}, {"score": 0.0023221983158528163, "phrase": "live_downloads"}, {"score": 0.002215663255682209, "phrase": "faster_downloads"}, {"score": 0.0021049977753042253, "phrase": "pieces_yields"}], "paper_keywords": ["algorithms", " design", " economics", " theory", " incentive systems", " BitTorrent", " tit-for-tat", " auctions", " proportional share"], "paper_abstract": "Incentives play a crucial role in BitTorrent, motivating users to upload to others to achieve fast download times for all peers. Though long believed to be robust to strategic manipulation, recent work has empirically shown that BitTorrent does not provide its users incentive to follow the protocol. We propose an auction-based model to study and improve upon BitTorrent's incentives. The insight behind our model is that BitTorrent uses, not tit-for-tat as widely believed, but an auction to decide which peers to serve. Our model not only captures known, performance-improving strategies, it shapes our thinking toward new, effective strategies. For example, our analysis demonstrates, counter-intuitively, that BitTorrent peers have incentive to intelligently under-report what pieces of the file they have to their neighbors. We implement and evaluate a modification to BitTorrent in which peers reward one another with proportional shares of bandwidth. Within our game-theoretic model, we prove that a proportional-share client is strategy-proof. With experiments on PlanetLab, a local cluster, and live downloads, we show that a proportional-share unchoker yields faster downloads against BitTorrent and BitTyrant clients, and that under-reporting pieces yields prolonged neighbor interest.", "paper_title": "BitTorrent is an auction: Analyzing and improving BitTorrent's incentives", "paper_id": "WOS:000259435500022"}