{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "test_selection"}, {"score": 0.008518449617129815, "phrase": "query-based_approach"}, {"score": 0.003610929883213109, "phrase": "faster_test_selection_algorithms"}, {"score": 0.003480993634130542, "phrase": "lower_test_execution_cost"}, {"score": 0.0032861588691414667, "phrase": "test_selection_procedure"}, {"score": 0.0027936239349923464, "phrase": "different_position"}, {"score": 0.002750056254309311, "phrase": "tradeoff_computation_time"}, {"score": 0.002721388234661538, "phrase": "test_execution_cost"}, {"score": 0.0024634797027967203, "phrase": "user's_specific_query"}, {"score": 0.0023997601127552256, "phrase": "different_strategies"}, {"score": 0.002218299213266519, "phrase": "operating_system_discovery"}, {"score": 0.0021049977753042253, "phrase": "diagnosis_framework"}], "paper_keywords": ["Diagnosis", " Queries", " Tests", " Operating system discovery"], "paper_abstract": "Test selection in diagnosis is a procedure suggesting tests to be executed when trying to answer the query \"What is the diagnosis for this problem?\". However, other queries, such as \"Is h the diagnosis for this problem?\", are relevant as they can involve faster test selection algorithms and they can result in a lower test execution cost. Usually, a one step lookahead entropy minimization strategy is adopted to implement the test selection procedure. However, we show that this strategy can be arbitrarily bad and therefore, it is important to consider several strategies to solve a query. Each strategy taking a different position in the tradeoff computation time vs test execution cost. In this paper, we consider a query-based approach where test selection is justified and driven by a user's specific query. We also study different strategies, optimal and approximate, for test selection. Finally, we illustrate how the operating system discovery (OSD) problem can be solved using a diagnosis framework and how it benefits from a query-based approach.", "paper_title": "A query-based approach for test selection in diagnosis", "paper_id": "WOS:000271748200005"}