{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "look-compute-move_model"}, {"score": 0.004645057834614705, "phrase": "different_nodes"}, {"score": 0.004589763483242731, "phrase": "anonymous_ring"}, {"score": 0.004120694410890683, "phrase": "look-compute-move_cycles"}, {"score": 0.003912189642066724, "phrase": "current_configuration"}, {"score": 0.0035544816252832375, "phrase": "latter_case"}, {"score": 0.003512123587588346, "phrase": "computed_move"}, {"score": 0.002910545717767559, "phrase": "undefined_number"}, {"score": 0.002818909613625567, "phrase": "described_problem"}, {"score": 0.0026975894491357176, "phrase": "known_solutions"}, {"score": 0.0026547761341670505, "phrase": "specific_initial_configurations"}, {"score": 0.0026126405272417783, "phrase": "open_cases"}, {"score": 0.0024802523752944536, "phrase": "general_problem"}, {"score": 0.0022712795176156536, "phrase": "previous_techniques"}, {"score": 0.0022262909736042212, "phrase": "new_strategies"}, {"score": 0.0021647968783414504, "phrase": "initial_configuration"}, {"score": 0.0021049977753042253, "phrase": "previous_works"}], "paper_keywords": ["Distributed algorithm", " Asynchronous system", " Gathering", " Oblivious robots"], "paper_abstract": "A set of robots arbitrarily placed on different nodes of an anonymous ring have to meet at one common node and there remain. This problem is known in the literature as the gathering. Anonymous and oblivious robots operate in Look-Compute-Move cycles; in one cycle, a robot takes a snapshot of the current configuration (Look), decides whether to stay idle or to move to one of its neighbors (Compute), and in the latter case makes the computed move instantaneously (Move). Cycles are asynchronous among robots. Moreover, each robot is empowered by the so called multiplicity detection capability, that is, it is able to detect during its Look operation whether a node is empty, or occupied by one robot, or occupied by an undefined number of robots greater than one. The described problem has been extensively studied during the last years. However, the known solutions work only for specific initial configurations and leave some open cases. In this paper, we provide an algorithm which solves the general problem but for few marginal and specific cases, and is able to detect all the ungatherable configurations. It is worth noting that our new algorithm makes use of some previous techniques and unifies them with new strategies in order to deal with any initial configuration, even those left open by previous works.", "paper_title": "Gathering on rings under the Look-Compute-Move model", "paper_id": "WOS:000339719700002"}