{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-_agent_interactions"}, {"score": 0.00427578268550103, "phrase": "institutional_norms"}, {"score": 0.004171259063201874, "phrase": "new_norms"}, {"score": 0.003815607281455725, "phrase": "electronic_institution"}, {"score": 0.003649277504586372, "phrase": "evolving_normative_framework"}, {"score": 0.0034901729647741353, "phrase": "existing_environment"}, {"score": 0.003371220210416809, "phrase": "agents'_commitments"}, {"score": 0.003192406091820197, "phrase": "virtual_organizations"}, {"score": 0.003053159610975692, "phrase": "appropriate_norms"}, {"score": 0.0029784342137867776, "phrase": "norm_fulfillment"}, {"score": 0.0028768722873689432, "phrase": "institutional_reality"}, {"score": 0.002724207384182295, "phrase": "institutional_roles"}, {"score": 0.0026973310437053573, "phrase": "constitutive_rules"}, {"score": 0.0025541693207036167, "phrase": "institutional_facts"}, {"score": 0.0024793019587009035, "phrase": "associated_external_transactions"}, {"score": 0.002454835845644037, "phrase": "contract_specification"}, {"score": 0.00240662380079115, "phrase": "conditional_prescription"}, {"score": 0.0021049977753042253, "phrase": "rule-_based_inference_engine"}], "paper_keywords": ["electronic institution", " norm", " contract", " virtual organization"], "paper_abstract": "Norms and institutions have been proposed to regulate multi- agent interactions. However, agents are intrinsically autonomous, and may thus decide whether to comply with norms. On the other hand, besides institutional norms, agents may adopt new norms by establishing commitments with other agents. In this paper, we address these issues by considering an electronic institution that monitors the compliance to norms in an evolving normative framework: norms are used both to regulate an existing environment and to define contracts that make agents' commitments explicit. In particular, we consider the creation of virtual organizations in which agents commit to certain cooperation efforts regulated by appropriate norms. The supervision of norm fulfillment is based on the notion of institutional reality, which is constructed by assigning powers to agents enacting institutional roles. Constitutive rules make a connection between the illocutions of those agents and institutional facts, certifying the occurrence of associated external transactions. Contract specification is based on conditional prescription of obligations. Contract monitoring relies on rules for detecting the fulfillment and violation of those obligations. The implementation of our normative institutional environment is supported by a rule- based inference engine.", "paper_title": "Institutional reality and norms: Specifying and monitoring agent organizations", "paper_id": "WOS:000250860400005"}