{"auto_keywords": [{"score": 0.04411287777932202, "phrase": "statistical_testing"}, {"score": 0.014076387871836762, "phrase": "stages_theory"}, {"score": 0.007919141023108284, "phrase": "five_stages_model"}, {"score": 0.004144510906908392, "phrase": "managerial_implications"}, {"score": 0.0038517317559294962, "phrase": "empirically_and_repeatedly_the_once-defined_maturity_model"}, {"score": 0.0036553070575015344, "phrase": "maturity_stages"}, {"score": 0.0035795609511543023, "phrase": "evaluation_fields"}, {"score": 0.0033969686698961743, "phrase": "questionnaire_survey"}, {"score": 0.003303412571939195, "phrase": "south_korea"}, {"score": 0.0032012284065895537, "phrase": "significant_benchmarks"}, {"score": 0.003123945762279429, "phrase": "anova"}, {"score": 0.003091381857342703, "phrase": "hoc_comparison_methods"}, {"score": 0.00293361812353423, "phrase": "newly_defined_five_stages"}, {"score": 0.002641770514171764, "phrase": "advanced_methodology"}, {"score": 0.002498150733439951, "phrase": "practical_guidelines"}, {"score": 0.002345868044122465, "phrase": "previous_stages_theories"}, {"score": 0.0023133055945761235, "phrase": "well-combined_and_comprehensive_evaluation_factors"}, {"score": 0.0022574026832458344, "phrase": "evolutionistic_characteristic"}, {"score": 0.0021049977753042253, "phrase": "sufficient_sample_size"}], "paper_keywords": ["Communication technologies", " Statistical testing"], "paper_abstract": "Purpose - Recently, many enterprises are using a variety of methods and techniques to examine and improve their current maturity level of information technology (IT). Although IT evaluation studies based on IT maturity stages have been conducted widely, the stages theory has not been confirmed through statistical testing. IT evaluation activities can present managerial implications to an enterprise by determining where it stands within the stages theory. The purpose of this paper is to test empirically and repeatedly the once-defined maturity model in order to make its validity more powerful. Design/methodology/approach - To define IT maturity stages and benchmarks with statistical testing, evaluation fields and factors of the L&K Model are referred to. Data were gathered by a questionnaire survey and interviews, in which 312 enterprises in South Korea participated. Consequently, IT maturity stages are defined and significant benchmarks of each stage are validated through ANOVA and post hoc comparison methods. Findings - The results of the study indicate the meanings and benchmarks of newly defined five stages of IT maturity: initiation, recognition, diffusion, control, and integration. Practical implications - The aim of this study is not only to apply an advanced methodology to study empirically how IT maturity level of an enterprise is improved, but also to suggest practical guidelines for actions to improve it. Originality/value - The five stages model is totally enhanced and reformulated from the previous stages theories. First, well-combined and comprehensive evaluation factors are used to critically appraise the evolutionistic characteristic of IT in enterprises. Second, the definition and benchmarks of the five stages model are confirmed through statistical testing with sufficient sample size (n = 312).", "paper_title": "Information technology maturity stages and enterprise benchmarking: an empirical study", "paper_id": "WOS:000261792500004"}