{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weighted_euclidean_one-center_problem"}, {"score": 0.009775258806855279, "phrase": "minimum_enclosing_ball_problem"}, {"score": 0.004654928974748418, "phrase": "n-dimensional_space"}, {"score": 0.004620093797504386, "phrase": "corresponding_positive_weights"}, {"score": 0.004127657126534723, "phrase": "maximum_weighted_euclidean_distance"}, {"score": 0.003591733916159209, "phrase": "small_subset_l_subset"}, {"score": 0.003382017342396959, "phrase": "optimal_solution"}, {"score": 0.003344076203780408, "phrase": "corresponding_weighted_euclidean_one-center_problem"}, {"score": 0.0031606404966938568, "phrase": "vertical_bar_l_vertical_bar"}, {"score": 0.003032528228056611, "phrase": "smallest_and_largest_weights"}, {"score": 0.0024842242921857705, "phrase": "epsilon-core_set"}, {"score": 0.0023566987138026285, "phrase": "theoretical_worst-case_estimate"}, {"score": 0.0022441378838655712, "phrase": "large-scale_instances"}, {"score": 0.0021775526153883355, "phrase": "possible_reasons"}, {"score": 0.002128910637262527, "phrase": "theoretical_estimate"}, {"score": 0.0021049977753042253, "phrase": "practical_performance"}], "paper_keywords": ["weighted Euclidean one-center problem", " minimum enclosing balls", " core sets", " approximation algorithms"], "paper_abstract": "Given a set A of m points in n-dimensional space with corresponding positive weights, the weighted Euclidean one-center problem, which is a generalization of the minimum enclosing ball problem, involves the computation of a point c(A) is an element of R(n) that minimizes the maximum weighted Euclidean distance from c(A) to each point in A. In this paper, given epsilon > 0, we propose and analyze an algorithm that computes a (1 + epsilon)-approximate solution to the weighted Euclidean one-center problem. Our algorithm explicitly constructs a small subset L subset of A, called an epsilon-core set of A, for which the optimal solution of the corresponding weighted Euclidean one-center problem is a close approximation to that of A. In addition, we establish that vertical bar L vertical bar depends only on epsilon and on the ratio of the smallest and largest weights, but is independent of the number of points m and the dimension n. This result subsumes and generalizes the previously known core set results for the minimum enclosing ball problem. Our algorithm computes a (1 + epsilon)-approximate solution to the weighted Euclidean one-center problem for A in O(mn vertical bar L vertical bar) arithmetic operations. Our computational results indicate that the size of the epsilon-core set computed by the algorithm is, in general, significantly smaller than the theoretical worst-case estimate, which contributes to the efficiency of the algorithm, especially for large-scale instances. We shed some light on the possible reasons for this discrepancy between the theoretical estimate and the practical performance.", "paper_title": "An Algorithm and a Core Set Result for the Weighted Euclidean One-Center Problem", "paper_id": "WOS:000271524200007"}