{"auto_keywords": [{"score": 0.04931580298467549, "phrase": "part-in-whole_matching"}, {"score": 0.040730207215564446, "phrase": "partial_queries"}, {"score": 0.02991625764875777, "phrase": "shape_thesaurus"}, {"score": 0.004814974089936643, "phrase": "thesaurus"}, {"score": 0.004486147558765763, "phrase": "different_manner"}, {"score": 0.004457388497044933, "phrase": "similarity_assessment"}, {"score": 0.003982806921493165, "phrase": "major_drawback"}, {"score": 0.0036749658368075027, "phrase": "whole_query_shape"}, {"score": 0.0032623406075681315, "phrase": "partial_shape_matching"}, {"score": 0.002914624187933378, "phrase": "novel_approach"}, {"score": 0.002858841145587906, "phrase": "collection-aware_shape_decomposition"}, {"score": 0.0028041227333229883, "phrase": "inverted_indexes"}, {"score": 0.0026461551175041608, "phrase": "multilevel_decomposition"}, {"score": 0.002410109046803846, "phrase": "large_set"}, {"score": 0.002371589020876307, "phrase": "partial_matching"}, {"score": 0.0022596753843232755, "phrase": "fast_global_matching"}, {"score": 0.002139197034966045, "phrase": "time_complexity_problems"}, {"score": 0.0021049977753042253, "phrase": "large_collections"}], "paper_keywords": ["3D shape retrieval", " Part-in-whole matching", " Thesaurus", " Segmentation"], "paper_abstract": "Research in content-based 3D retrieval has already started, and several approaches have been proposed which use in different manner a similarity assessment to match the shape of the query against the shape of the objects in the database. However, the success of these solutions are far from the success obtained by their textual counterparts. A major drawback of most existing 3D retrieval solutions is their inability to support partial queries, that is, a query which does not need to be formulated by specifying a whole query shape, but just a part of it, for example a detail of its overall shape, just like documents are retrieved by specifying words and not whole texts. Recently, researchers have focused their investigation on 3D retrieval which is solved by partial shape matching. However, at the extent of our knowledge, there is still no 3D search engine that provides an indexing of the 3D models based on all the interesting subparts of the models. In this paper we present a novel approach to 3D shape retrieval that uses a collection-aware shape decomposition combined with a shape thesaurus and inverted indexes to describe and retrieve 3D models using part-in-whole matching. The proposed method clusters similar segments obtained trough a multilevel decomposition of models, constructing from such partition the shape thesaurus. Then, to retrieve a model containing a sub-part similar to a given query, instead of looking on a large set of subparts or executing partial matching between the query and all models in the collection, we just perform a fast global matching between the query and the few entries in the thesaurus. With this technique we overcame the time complexity problems associated with partial queries in large collections.", "paper_title": "Thesaurus-based 3D Object Retrieval with Part-in-Whole Matching", "paper_id": "WOS:000277547600012"}