{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "parallel_implementation"}, {"score": 0.004762202897268383, "phrase": "sequential_monte_carlo_methods"}, {"score": 0.004482206282876944, "phrase": "feynman-kac_semigroups"}, {"score": 0.004384504920139083, "phrase": "interacting_particles"}, {"score": 0.0038838500580958744, "phrase": "total_population"}, {"score": 0.0032021226849872054, "phrase": "feynman-kac_semigroup"}, {"score": 0.0029641011108505785, "phrase": "original_problem"}, {"score": 0.0028360962841331634, "phrase": "feynman-kac_semi-group"}, {"score": 0.0027437235598539904, "phrase": "island_level"}, {"score": 0.002539689093411356, "phrase": "population_size"}, {"score": 0.0023768935613577985, "phrase": "different_type"}, {"score": 0.002163930783583212, "phrase": "theoretical_results"}, {"score": 0.0021049977753042253, "phrase": "monte_carlo_experiments"}], "paper_keywords": ["Particle approximation of Feynman-Kac flow", " Island models", " Parallel implementation"], "paper_abstract": "The approximation of the Feynman-Kac semigroups by systems of interacting particles is a very active research field, with applications in many different areas. In this paper, we study the parallelization of such approximations. The total population of particles is divided into sub-populations, referred to as islands. The particles within each island follow the usual selection/mutation dynamics. We show that the evolution of each island is also driven by a Feynman-Kac semigroup, whose transition and potential can be explicitly related to ones of the original problem. Therefore, the same genetic type approximation of the Feynman-Kac semi-group may be used at the island level; each island might undergo selection/mutation algorithm. We investigate the impact of the population size within each island and the number of islands, and study different type of interactions. We find conditions under which introducing interactions between islands is beneficial. The theoretical results are supported by some Monte Carlo experiments.", "paper_title": "On parallel implementation of sequential Monte Carlo methods: the island particle model", "paper_id": "WOS:000349551100006"}