{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "chat_messages"}, {"score": 0.015719716506582538, "phrase": "user_and_message_attributes"}, {"score": 0.004748556604045108, "phrase": "computer-mediated_communication"}, {"score": 0.003378385493203297, "phrase": "chat_mining_problem"}, {"score": 0.003308649946463136, "phrase": "term-based_approach"}, {"score": 0.0030650070965891653, "phrase": "vocabulary_use"}, {"score": 0.0030017207229983385, "phrase": "style-based_approach"}, {"score": 0.002742196991950893, "phrase": "authors'_writing_styles"}, {"score": 0.0024026156525362684, "phrase": "reverse_problem"}, {"score": 0.0022255425106527727, "phrase": "computer-mediated_communications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["authorship analysis", " chat mining", " computer-mediated communication", " machine learning", " stylistics", " text classification"], "paper_abstract": "The focus of this paper is to investigate the possibility of predicting several user and message attributes in text-based, real-time, online messaging services. For this purpose, a large collection of chat messages is examined. The applicability of various supervised classification techniques for extracting information from the chat messages is evaluated. Two competing models are used for defining the chat mining problem. A term-based approach is used to investigate the user and message attributes in the context of vocabulary use while a style-based approach is used to examine the chat messages according to the variations in the authors' writing styles. Among 100 authors, the identity of an author is correctly predicted with 99.7% accuracy. Moreover, the reverse problem is exploited, and the effect of author attributes on computer-mediated communications is discussed. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Chat mining: Predicting user and message attributes in computer-mediated communication", "paper_id": "WOS:000257276800004"}