{"auto_keywords": [{"score": 0.04015076015860894, "phrase": "game_characters"}, {"score": 0.004530229810569157, "phrase": "pathfinding_problems"}, {"score": 0.004233492114255375, "phrase": "larger_game_worlds"}, {"score": 0.0040648241451154525, "phrase": "game_play"}, {"score": 0.003983016985197904, "phrase": "new_games"}, {"score": 0.00357362651129581, "phrase": "dumb_movements"}, {"score": 0.0035016702571862165, "phrase": "inappropriate_paths"}, {"score": 0.0028764048059439205, "phrase": "ant_colony_algorithm"}, {"score": 0.0024774888010414206, "phrase": "augmented-reality_educational_game"}, {"score": 0.002330664671716791, "phrase": "cpu_processor"}, {"score": 0.002252880693912436, "phrase": "large_problem_sizes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ant colony optimization", " Pathfinding", " Affective interaction", " Augmented reality", " Edutainment"], "paper_abstract": "Pathfinding is one of the tasks, apart from graphics rendering, requiring most CPU resources. Although there are many approaches to effectively solve pathfinding problems, they are becoming less suitable as more and more games have larger game worlds that dynamically change during the game play. These new games have more visually realistic graphics that increase the game characters realism but all these efforts may be useless if game characters perform dumb movements or follow inappropriate paths such as repeatedly walking close to an enemy or a predator while moving from one location to another. To tackle this problem we present in this paper an ant colony algorithm for path finding that takes into account the emotions of the game characters and we show how our approach is used in an augmented-reality educational game. The proposed algorithm is implemented on a CPU processor to demonstrate its scalability with large problem sizes when compared to its corresponding CPU version. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An emotionally biased ant colony algorithm for pathfinding in games", "paper_id": "WOS:000277726300023"}