{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "diagnostic_decision_support_systems"}, {"score": 0.004274396662662802, "phrase": "medical_education"}, {"score": 0.0038634281440398355, "phrase": "students'_clinical_experiences"}, {"score": 0.0034792431564692997, "phrase": "educational_resource"}, {"score": 0.0032601856292942136, "phrase": "established_part"}, {"score": 0.0031558679589831287, "phrase": "critical_analysis"}, {"score": 0.0029893477597041493, "phrase": "diagnostic_decision_support_programs"}, {"score": 0.0029041492019217033, "phrase": "basic_knowledge"}, {"score": 0.002682133505994396, "phrase": "clinical_information"}, {"score": 0.002577557228072987, "phrase": "specific_skills"}, {"score": 0.0025313767218525965, "phrase": "appropriate_system_vocabulary"}, {"score": 0.0024503217593801587, "phrase": "diagnostic_system's_suggestions"}, {"score": 0.0023890733439136586, "phrase": "computer-based_decision_support_systems"}, {"score": 0.0022629214153694504, "phrase": "traditional_medical_curriculum"}, {"score": 0.002151183757599893, "phrase": "students'_knowledge"}, {"score": 0.0021049977753042253, "phrase": "information-seeking_skills"}], "paper_keywords": ["Clinical competence", " computer simulation", " computer-assisted diagnosis", " medical education", " expert systems"], "paper_abstract": "Background: Diagnostic decision support systems are designed to assist physicians with making diagnoses. This article illustrates some of the issues that will be faced as diagnostic decision support systems become used in medical education. Objectives: The objectives of this article are to examine 1) the skills that are needed to properly use these programs as part of the students' clinical experiences; 2) the changes that will be necessary in our curricula once these programs are more extensively utilized, including the implications of using these systems as an educational resource or simulation tool, and 3) the research issues that arise when these systems become an established part of our educational programs. Methods: This is a critical analysis of the literature on diagnostic decision support systems and medical education. Results: To optimally use diagnostic decision support programs, students will need grounding in the basic knowledge and skills that have always been necessary to become a physician, such as the ability to accurately gather and interpret clinical information from the patient. In addition, students will need specific skills in 1) selecting appropriate system vocabulary and functions, and 2) applying the diagnostic system's suggestions to their particular patient. Conclusions: When computer-based decision support systems are incorporated in medical education, they will likely lead to changes in the traditional medical curriculum. Research will be needed on how use of these programs changes the students' knowledge, problem-solving and information-seeking skills.", "paper_title": "Use of Diagnostic Decision Support Systems in Medical Education", "paper_id": "WOS:000281697000012"}