{"auto_keywords": [{"score": 0.04747663842253329, "phrase": "product_differentiation"}, {"score": 0.027961740081157135, "phrase": "product_quality"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_product_differentiation_model"}, {"score": 0.004726184966910756, "phrase": "game-theoretic_model"}, {"score": 0.004587535692463736, "phrase": "different_dimensions"}, {"score": 0.004274257668843717, "phrase": "different_importance"}, {"score": 0.0040571383470418085, "phrase": "\"quality-fit\"_ratio"}, {"score": 0.0039822874870125095, "phrase": "relative_strength"}, {"score": 0.003641713874009232, "phrase": "product_misfit"}, {"score": 0.0034437574674180365, "phrase": "horizontal_dimension"}, {"score": 0.003367611042980526, "phrase": "different_equilibriums"}, {"score": 0.0031963987773420068, "phrase": "higher_profits"}, {"score": 0.003137377828938824, "phrase": "product_quality_and_misfit_costs"}, {"score": 0.0030565692640988585, "phrase": "similar_products"}, {"score": 0.002933756577145939, "phrase": "differentiated_products"}, {"score": 0.002815864555488112, "phrase": "personalization_technology"}, {"score": 0.0024346858809238766, "phrase": "competitor's_personalization"}, {"score": 0.0022096205841489786, "phrase": "personalization_technologies"}], "paper_keywords": ["game theory", " horizontal and vertical differentiation", " market structure", " personalization", " quality-fit ratio"], "paper_abstract": "We use a game-theoretic model to examine how information personalization by firms interacts with different dimensions of product differentiation (namely, horizontal and vertical differentiation). We consider the possibility that consumers attach different importance to various types of product differentiation, and report the equilibrium in terms of the \"quality-fit\" ratio, which measures the relative strength of preference for quality compared to preference for product fit and is a function of the cost of quality and the cost of product misfit. We also consider how different market structures (whether firms are similar or differentiated on the horizontal dimension ex ante) lead to different equilibriums when firms adopt personalization. We show that personalization by one firm leads to higher profits for both firms if product quality and misfit costs are high and the firms offer similar products ex ante. On the other hand, if firms offer differentiated products, personalization is profitable only if the effectiveness of the personalization technology is high or if both product quality and misfit costs are low. We also highlight conditions under which investments in personalization and product quality can be complements or Substitutes to each other. Finally, we show that a firm can respond to a competitor's personalization by either increasing (aggressive response) or decreasing (defensive response) investments in its own quality. Our results provide insights to managers on when to invest in personalization technologies and how to adjust their investments in product quality after the firm (or its competitor) adopts personalization.", "paper_title": "Information Personalization in a Two-Dimensional Product Differentiation Model", "paper_id": "WOS:000271112800005"}