{"auto_keywords": [{"score": 0.042148418405646954, "phrase": "traditional_method"}, {"score": 0.015719716506582538, "phrase": "traditional_methods"}, {"score": 0.008873018776275983, "phrase": "st_error"}, {"score": 0.004787966206092959, "phrase": "mexico_city"}, {"score": 0.004734448316824488, "phrase": "unam_faculty"}, {"score": 0.004171891198117434, "phrase": "bachelor's_degree"}, {"score": 0.003999578354349824, "phrase": "orthodontics"}, {"score": 0.0038996120252338556, "phrase": "course_topics"}, {"score": 0.0037070855410818986, "phrase": "stereoscopic_third_dimension"}, {"score": 0.0036245864938417964, "phrase": "digital_stereo_projection"}, {"score": 0.0035141291835319682, "phrase": "supernumerary_teeth"}, {"score": 0.003312486229143855, "phrase": "expert_judgment"}, {"score": 0.0032938942910948096, "phrase": "orthodontics_teaching"}, {"score": 0.003175556211659149, "phrase": "determined_effectiveness"}, {"score": 0.003087419032091453, "phrase": "statistical_package"}, {"score": 0.0030787453830549076, "phrase": "spss"}, {"score": 0.0024234059612683032, "phrase": "bartlett's_test"}, {"score": 0.0024097920845706795, "phrase": "equal_variances"}, {"score": 0.0023296961971785357, "phrase": "student's_learning"}, {"score": 0.002297111954768114, "phrase": "significant_improvement"}, {"score": 0.002264982416465872, "phrase": "traditional_teaching_method"}, {"score": 0.0022396019251440724, "phrase": "strong_association"}, {"score": 0.0021049977753042253, "phrase": "traditional_teaching"}], "paper_keywords": ["Teaching-learning", " stereoscopic 3D", " traditional"], "paper_abstract": "In the UNAM Faculty of Odontology, we use a stereoscopic 3D teaching method that has grown more common in the last year, which makes it important to know whether students can learn better with this strategy. The objective of the study is to know, if the 4th year students of the bachelor's degree in dentistry learn more effectively with the use of stereoscopic 3D than the traditional method in Orthodontics. Methods: first, we selected the course topics, to be used for both methods; the traditional method using projection of slides and for the stereoscopic third dimension, with the use of videos in digital stereo projection (seen through \"passive\" polarized 3D glasses). The main topic was supernumerary teeth, including and diverted from their guide eruption. Afterwards we performed an exam on students, containing 24 items, validated by expert judgment in Orthodontics teaching. The results of the data were compared between the two educational methods for determined effectiveness using the model before and after measurement with the statistical package SPSS 20 version. The results presented for the 9 groups of undergraduates in dentistry, were collected with a total of 218 students for 3D and traditional methods, we found in a traditional method a mean 4.91, SD 1.4752 in the pretest and X=6.96, SD 1.26622, St Error 0.12318 for the posttest. The 3D method had a mean 5.21, SD 1.996779 St Error 0.193036 for the pretest X=7.82, SD =0.963963, St Error 0.09319 posttest; the analysis of Variance between groups F=5.60 Prob> 0.0000 and Bartlett's test for equal variances 21.0640 Prob>chi(2) = 0.007. These results show that the student's learning in 3D means a significant improvement as compared to the traditional teaching method and having a strong association between the two methods. Conclusion: The findings suggest that the stereoscopic 3D method lead to improved student learning compared to traditional teaching.", "paper_title": "Teaching-learning: stereoscopic 3D versus Traditional methods in Mexico City", "paper_id": "WOS:000375005900008"}