{"auto_keywords": [{"score": 0.047510470298773616, "phrase": "finite_time"}, {"score": 0.015719716506582538, "phrase": "mobile_sensors"}, {"score": 0.010992536265581327, "phrase": "exact_self-deployment"}, {"score": 0.009326626619327897, "phrase": "desired_final_distance_d"}, {"score": 0.004658426838467567, "phrase": "purely_decentralized_and_distributed_fashion"}, {"score": 0.004506968388996092, "phrase": "static_equilibrium"}, {"score": 0.004025531820226182, "phrase": "identical_sensors"}, {"score": 0.003992385826251404, "phrase": "global_coordinate_system"}, {"score": 0.003809628721278519, "phrase": "fixed_distance"}, {"score": 0.003264547032549398, "phrase": "common_orientation"}, {"score": 0.0032109670662222416, "phrase": "impossibility_result"}, {"score": 0.0031495640320537252, "phrase": "unlimited_memory"}, {"score": 0.0029234927133380503, "phrase": "oriented_ring"}, {"score": 0.002713604305939145, "phrase": "c-approximate_self-deployment"}, {"score": 0.002539689093411356, "phrase": "simple_protocol"}, {"score": 0.0024842242921857705, "phrase": "claimed_level"}, {"score": 0.0024501740852758505, "phrase": "positive_results"}, {"score": 0.0022679195103377124, "phrase": "unpredictable_times"}, {"score": 0.002194011800331242, "phrase": "limited_visibility_radius"}, {"score": 0.0021049977753042253, "phrase": "convex_region"}], "paper_keywords": ["self-deployment", " mobile sensors", " scattering", " ring"], "paper_abstract": "Mobile sensors can setf-deploy in a purely decentralized and distributed fashion, so as to reach in a finite time a state of static equilibrium in which they uniformly cover the environment. We consider the self-deployment problem in a ring (e.g., a circular rim); in particular we investigate under what conditions the problem is solvable by a collection of identical sensors without a global coordinate system, however capable of determining the location (in their local coordinate system) of the other sensors within a fixed distance (called visibihty radius). A self-deployment is exact if within finite time the distance between any two consecutive sensors along the ring is the same, d; it is c-approximate if within finite time the distance between two consecutive sensors is between d - 6 and d + c. We prove that exact self-deployment is impossible if the sensors do not share a common orientation of the ring. This impossibility result holds even if the sensors have unlimited memory of the past, their visibility radius is unlimited, and all their actions, when active, are instantaneous. We thus consider the problem in an oriented ring. We prove that if the sensors know the desired final distance d, then exact self-deployment is possible. If the desired final distance d is not known, we prove that c-approximate self-deployment is possible for any chosen 6 > 0. The proofs of these results are constructive. In each case we present a simple protocol that allows the sensors to achieve the claimed level of self-deployment. These positive results hold even if sensors are oblivious (i.e., have no memory of past actions and computations), asynchronous (i.e., a sensor becomes active at unpredictable times and the duration of its actions is unpredictable), and have limited visibility radius. Our protocols can be employed, without modifications, on the perimeter of any convex region. (c) 2008 Elsevier BX All rights reserved.", "paper_title": "Self-deployment of mobile sensors on a ring", "paper_id": "WOS:000258273700007"}