{"auto_keywords": [{"score": 0.04189227956594073, "phrase": "mexico"}, {"score": 0.00481495049065317, "phrase": "electronic_health_records"}, {"score": 0.004731638279336065, "phrase": "statewide_public_health_system"}, {"score": 0.004438250823243621, "phrase": "case_study"}, {"score": 0.004236321075918639, "phrase": "electronic_health_record"}, {"score": 0.00422115898751026, "phrase": "colima"}, {"score": 0.004090901264701185, "phrase": "public_health_system"}, {"score": 0.0037487368769596814, "phrase": "implementation_process"}, {"score": 0.00357806560856829, "phrase": "focus_group_discussions"}, {"score": 0.003093054709625219, "phrase": "main_driving_force"}, {"score": 0.0028341130433482565, "phrase": "main_government_health_and_social_development_programs"}, {"score": 0.0024784363584530976, "phrase": "recurrent_resources"}, {"score": 0.0023380300046435187, "phrase": "federal_programs"}, {"score": 0.0022974765563692776, "phrase": "parallel_information_systems"}, {"score": 0.0021049977753042253, "phrase": "colimaima"}], "paper_keywords": [""], "paper_abstract": "The findings of a case study assessing the design and implementation of an electronic health record (EHR) in the public health system of Colima, Mexico, its perceived benefits and limitations, and recommendations for improving the implementation process are presented. In-depth interviews and focus group discussions were used to examine the experience of the actors and stakeholders participating in the design and implementation of EHRs. Results indicate that the main driving force behind the use of EHRs was to improve reporting to the two of the main government health and social development programs. Significant challenges to the success of the EHR include resistance by physicians to use the ICD-10 to code diagnoses, insufficient attention to recurrent resources needed to maintain the system, and pressure from federal programs to establish parallel information systems. Operating funds and more importantly political commitment are required to ensure sustainability of the EHRs in Colimaima.", "paper_title": "Assessing the process of designing and implementing electronic health records in a statewide public health system: the case of Colima, Mexico", "paper_id": "WOS:000314875100006"}