{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "semantic_peer-to-peer_networks"}, {"score": 0.004229158339021651, "phrase": "peers'_ontologies"}, {"score": 0.0037683358267785435, "phrase": "resulting_alignments"}, {"score": 0.0034892684482068347, "phrase": "unsatisfactory_answers"}, {"score": 0.0029343925814926787, "phrase": "specific_query"}, {"score": 0.0028100102841877835, "phrase": "latter_peer"}, {"score": 0.0027564303939865476, "phrase": "satisfactory_answer"}, {"score": 0.0025892330566358503, "phrase": "bayesian_inference"}, {"score": 0.0025034338848015166, "phrase": "user_feedback"}, {"score": 0.0023743009016047424, "phrase": "experimental_results"}, {"score": 0.002340250894008014, "phrase": "trust_values"}, {"score": 0.002198242191529979, "phrase": "query_answering"}, {"score": 0.0021049977753042253, "phrase": "peers'_answers"}], "paper_keywords": ["Ontology", " Populated ontology", " Alignment", " Trust", " Provenance"], "paper_abstract": "In this paper, we introduce a mechanism of trust adapted to semantic peer-to-peer networks in which every peer is free to organize its local resources as instances of classes of its own ontology. Peers use their ontologies to query other peers, and alignments between peers' ontologies make it possible to reformulate queries from one local peer's vocabulary to another. Alignments are typically the result of manual or (semi)automatic ontology matching. However, resulting alignments may be unsound and/or incomplete, and therefore, query reformulation based on alignments may lead to unsatisfactory answers. Trust can assist peers to select the peers in the network that are better suited to answer their queries. In our model, the trust that a peer has toward another peer depends on a specific query, and it represents the probability that the latter peer will provide a satisfactory answer to the query. In order to compute trust, we perform Bayesian inference that exploits ontologies, alignments and user feedback. We have implemented our method and conducted an evaluation. Experimental results show that trust values converge as more queries are sent and answers received. Furthermore, when query answering is guided by trust, the quality of peers' answers, measured with precision and recall, is improved.", "paper_title": "Trust in networks of ontologies and alignments", "paper_id": "WOS:000347776300004"}