{"auto_keywords": [{"score": 0.022674408086591227, "phrase": "preventive_transshipment"}, {"score": 0.005757384442963081, "phrase": "transshipment_quantities"}, {"score": 0.005176961944706273, "phrase": "ordering_quantities"}, {"score": 0.00481495049065317, "phrase": "preventive_lateral_transshipment"}, {"score": 0.004258843584164121, "phrase": "time_horizon"}, {"score": 0.003988901168289797, "phrase": "ordering_stage"}, {"score": 0.003797690272118125, "phrase": "replenishment_lead-time"}, {"score": 0.003751331782523201, "phrase": "demand_signals"}, {"score": 0.0036753171449945654, "phrase": "realized_demand"}, {"score": 0.0036304470230058413, "phrase": "complementary_product"}, {"score": 0.003428164458163043, "phrase": "preventively_transship"}, {"score": 0.0033449479263613848, "phrase": "shipping_stage"}, {"score": 0.003237116128682586, "phrase": "transshipping_decisions"}, {"score": 0.0031327496009959464, "phrase": "incentive_problems"}, {"score": 0.002921975748248106, "phrase": "transshipped_units"}, {"score": 0.002510843167476253, "phrase": "bidirectional_revenue_sharing_contract"}, {"score": 0.002370794661629904, "phrase": "proposed_contract"}, {"score": 0.002266246304762945, "phrase": "transportation_cost"}, {"score": 0.002157433262687853, "phrase": "coordinating_bidirectional_revenue_sharing_contract"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Preventive transshipment", " Demand updating", " Coordination", " Revenue sharing"], "paper_abstract": "We analyze preventive transshipment between two locations in anticipation of the mismatch between demands and inventories, and the effects of the preventive transshipment on ordering quantities. The time horizon for preventive transshipment includes two stages: the ordering stage and the shipping stage. At the ordering stage, the two locations order products from their supplier. During the replenishment lead-time, some demand signals (e.g., the realized demand for a complementary product) may be observed. Therefore, the locations may update their demand distributions and preventively transship to each other at the shipping stage. When the two locations make their ordering and transshipping decisions individually to maximize their own profits, there are incentive problems that prevent coordination. These problems arise even between the locations that pay each other for transshipped units. We examine two commonly used linear transfer price contracts: the ex ante transfer price contract and the ex post transfer price contract. However, neither of these contracts coordinates the transshipment quantities between the two locations. We then present a bidirectional revenue sharing contract that can coordinate the transshipment quantities. We find the conditions under which this proposed contract coordinates the ordering quantities. Finally, we investigate how the transportation cost and the amount of information updating affect the ordering quantities with the coordinating bidirectional revenue sharing contract. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Coordinating preventive lateral transshipment between two locations", "paper_id": "WOS:000328234000030"}