{"auto_keywords": [{"score": 0.03326470358782364, "phrase": "appliance_power_consumption_patterns"}, {"score": 0.015719716506582538, "phrase": "bi-directional_transformation"}, {"score": 0.010694690352424024, "phrase": "personal_living_activities"}, {"score": 0.009381894825290806, "phrase": "living_activities"}, {"score": 0.008656818228847027, "phrase": "human_living_activities"}, {"score": 0.008187402196148623, "phrase": "power_consumption_patterns"}, {"score": 0.007617215799714862, "phrase": "electric_energy"}, {"score": 0.0072750706373447315, "phrase": "electricity_use"}, {"score": 0.004613254605667248, "phrase": "novel_method"}, {"score": 0.00436213603647063, "phrase": "demand-side_energy_management_system"}, {"score": 0.004262733542795058, "phrase": "peak_power_consumption"}, {"score": 0.004124630249202334, "phrase": "user's_quality"}, {"score": 0.003977858136481356, "phrase": "dynamic_priorities"}, {"score": 0.0037736090925144807, "phrase": "appliance_power_consumption"}, {"score": 0.0036153760112398485, "phrase": "user's_daily_living_activities"}, {"score": 0.003463754811167655, "phrase": "real-time_appliance_priorities"}, {"score": 0.0034409976875396596, "phrase": "real-time_living_activity_estimation"}, {"score": 0.003076152130543236, "phrase": "personal_appliance_usage_patterns"}, {"score": 0.00295681206994471, "phrase": "living_activity_-_power_consumption_model"}, {"score": 0.0027228088474257426, "phrase": "bidirectional_transformation"}, {"score": 0.0025913692304671675, "phrase": "measured_appliance_power_consumption_patterns"}, {"score": 0.002482585701725093, "phrase": "real_daily_life"}, {"score": 0.002378357925871225, "phrase": "real_ones"}, {"score": 0.0023317365065820554, "phrase": "case_study"}, {"score": 0.0021189380172266454, "phrase": "daily_living"}, {"score": 0.0021049977753042253, "phrase": "older_people"}], "paper_keywords": ["pattern transformation", " i-Energy", " human living activity"], "paper_abstract": "This paper describes a novel method for the bi-directional transformation between the power consumption patterns of appliances and human living activities. We have been proposing a demand-side energy management system that aims to cut down the peak power consumption and save the electric energy in a household while keeping user's quality of life based on the plan of electricity use and the dynamic priorities of the appliances. The plan of electricity use could be established in advance by predicting appliance power consumption. Regarding the priority of each appliance, it changes according to user's daily living activities, such as cooking, bathing, or entertainment. To evaluate real-time appliance priorities, real-time living activity estimation is needed. In this paper, we address the problem of the bi-directional transformation between personal living activities and power consumption patterns of appliances. We assume that personal living activities and appliance power consumption patterns are related via the following two elements: personal appliance usage patterns, and the location of people. We first propose a Living Activity - Power Consumption Model as a generative model to represent the relationship between living activities and appliance power consumption patterns, via the two elements. We then propose a method for the bidirectional transformation between living activities and appliance power consumption patterns on the model, including the estimation of personal living activities from measured appliance power consumption patterns, and the generation of appliance power consumption patterns from given living activities. Experiments conducted on real daily life demonstrate that our method can estimate living activities that are almost consistent with the real ones. We also confirm through case study that our method is applicable for simulating appliance power consumption patterns. Our contributions in this paper would be effective in saving electric energy, and may be applied to remotely monitor the daily living of older people.", "paper_title": "A Novel Method for the Bi-directional Transformation between Human Living Activities and Appliance Power Consumption Patterns", "paper_id": "WOS:000331344100010"}