{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "automated_monitoring"}, {"score": 0.049725544371589284, "phrase": "dairy_cows"}, {"score": 0.02854734054944412, "phrase": "fuzzy_logic"}, {"score": 0.004276541976450121, "phrase": "dairy_farm"}, {"score": 0.0041515831652973794, "phrase": "different_commercial_systems"}, {"score": 0.004045230861702083, "phrase": "group_a"}, {"score": 0.003970930401776528, "phrase": "traditional_parlour"}, {"score": 0.003897989308486044, "phrase": "milk_production"}, {"score": 0.003840598580753804, "phrase": "animal_activity"}, {"score": 0.0038122196479548425, "phrase": "group_b"}, {"score": 0.0036327808996444904, "phrase": "milk_electrical_conductivity"}, {"score": 0.00328654473734697, "phrase": "dedicated_software"}, {"score": 0.0032501644753165555, "phrase": "acquired_parameters"}, {"score": 0.003120171161064748, "phrase": "pre-determined_threshold"}, {"score": 0.003006499028632742, "phrase": "farm_personnel"}, {"score": 0.002791393223133408, "phrase": "animals'_abnormalities"}, {"score": 0.002740059168271987, "phrase": "linear_discriminant_analysis"}, {"score": 0.0025916375737852506, "phrase": "relevant_animal_conditions"}, {"score": 0.0024421501497321027, "phrase": "farm_observations"}, {"score": 0.002353120949568249, "phrase": "specific_abnormalities"}, {"score": 0.002242206465278159, "phrase": "general_abnormal_statuses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dairy cows", " Monitoring", " Automation"], "paper_abstract": "The study analyses the possibility of improving the automated monitoring of dairy cows by combining the data given by various measurement systems already existing on farms. On a dairy farm where two groups of cows were monitored by different commercial systems, all the measured parameters were collected over 5 months: group A was milked in a traditional parlour equipped with instruments measuring milk production, flow and animal activity; group B was milked by an AMS (automatic milking system) measuring milk production and flow, milk electrical conductivity (per quarter), and animal activity. For each group all the monitoring systems were connected in a network and their data managed by means of a dedicated software. The acquired parameters were first treated to obtain alarms when their standard deviation exceeded a pre-determined threshold. All the animals giving such alarms were then inspected by the farm personnel and the respective normal or not normal (oestrus or pathology) conditions ascertained. Afterwards two models were developed aimed at detecting the animals' abnormalities: one based on linear discriminant analysis, one based on fuzzy logic. The reliability of these models in detecting the relevant animal conditions was verified by comparing the alarms given by each method with the results of the farm observations. Both models were not very accurate in detecting specific abnormalities, but the model based on fuzzy logic was very effective in detecting general abnormal statuses and was also capable of producing warnings on so far undetected abnormalities in advance. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Improving the automated monitoring of dairy cows by integrating various data acquisition systems", "paper_id": "WOS:000268110600008"}