{"auto_keywords": [{"score": 0.04887471080843015, "phrase": "new_unlabelled_dataset"}, {"score": 0.033579580662129224, "phrase": "output_variable"}, {"score": 0.00481495049065317, "phrase": "class_distribution"}, {"score": 0.004625983640628956, "phrase": "possibly_different_distribution"}, {"score": 0.004223521213460728, "phrase": "new_task"}, {"score": 0.004192872425727907, "phrase": "data_mining"}, {"score": 0.003984444229875069, "phrase": "possible_adjustment"}, {"score": 0.0039268117782861696, "phrase": "single-instance_supervised_model"}, {"score": 0.003213660268958121, "phrase": "aggregated_indicator"}, {"score": 0.0030426463790590445, "phrase": "comprehensive_new_taxonomy"}, {"score": 0.0030205408413942272, "phrase": "quantification_tasks"}, {"score": 0.00293370839211022, "phrase": "whole_distribution"}, {"score": 0.0026586145364395544, "phrase": "numerical_values"}, {"score": 0.0025633909553815556, "phrase": "multi-dimensional_hierarchical_data_warehouses"}, {"score": 0.0025170626402362633, "phrase": "aggregative_quantification"}, {"score": 0.002289285767792039, "phrase": "accurate_estimations"}, {"score": 0.002264364091368269, "phrase": "expected_value"}, {"score": 0.0021204172495922513, "phrase": "relevant_scenarios"}, {"score": 0.0021049977753042253, "phrase": "training_and_test_distributions"}], "paper_keywords": ["Quantification", " Regression quantification", " Probability estimation", " Segmentation", " Distribution", " Aggregation"], "paper_abstract": "The problem of estimating the class distribution (or prevalence) for a new unlabelled dataset (from a possibly different distribution) is a very common problem which has been addressed in one way or another in the past decades. This problem has been recently reconsidered as a new task in data mining, renamed quantification when the estimation is performed as an aggregation (and possible adjustment) of a single-instance supervised model (e.g., a classifier). However, the study of quantification has been limited to classification, while it is clear that this problem also appears, perhaps even more frequently, with other predictive problems, such as regression. In this case, the goal is to determine a distribution or an aggregated indicator of the output variable for a new unlabelled dataset. In this paper, we introduce a comprehensive new taxonomy of quantification tasks, distinguishing between the estimation of the whole distribution and the estimation of some indicators (summary statistics), for both classification and regression. This distinction is especially useful for regression, since predictions are numerical values that can be aggregated in many different ways, as in multi-dimensional hierarchical data warehouses. We focus on aggregative quantification for regression and see that the approaches borrowed from classification do not work. We present several techniques based on segmentation which are able to produce accurate estimations of the expected value and the distribution of the output variable. We show experimentally that these methods especially excel for the relevant scenarios where training and test distributions dramatically differ.", "paper_title": "Aggregative quantification for regression", "paper_id": "WOS:000329366300007"}