{"auto_keywords": [{"score": 0.04959124618297068, "phrase": "virtual_environments"}, {"score": 0.03330604039232812, "phrase": "self-propelled_mode"}, {"score": 0.031794000108525684, "phrase": "independently_moving_scene"}, {"score": 0.027923966936676203, "phrase": "feedback-controlled_mode"}, {"score": 0.026649528249335416, "phrase": "feedback-controlled_treadmill"}, {"score": 0.00481495049065317, "phrase": "feedback-controlled"}, {"score": 0.004798541219863296, "phrase": "interface_for_treadmill_locomotion"}, {"score": 0.004497129150551236, "phrase": "visual_impairments"}, {"score": 0.004466519142879166, "phrase": "visual_aids"}, {"score": 0.004436116555817464, "phrase": "proper_simulation"}, {"score": 0.00417160036938041, "phrase": "conventional_treadmills"}, {"score": 0.003778081566896723, "phrase": "feedback-controlled_locomotion_interface"}, {"score": 0.0033982429092938764, "phrase": "automated_safety_measures"}, {"score": 0.0032616462517547477, "phrase": "erratic_behavior"}, {"score": 0.0031198362555601377, "phrase": "speed-matching_tasks"}, {"score": 0.003077451642616653, "phrase": "moving_object"}, {"score": 0.0028937142757436683, "phrase": "constant_subject_position"}, {"score": 0.002805989498127897, "phrase": "subject_pulse_rates"}, {"score": 0.002549672862868133, "phrase": "average_position"}, {"score": 0.0024387423375226507, "phrase": "desired_position"}, {"score": 0.0023973704289918726, "phrase": "smaller_standard_deviation"}, {"score": 0.0023810183846557486, "phrase": "subject_position"}, {"score": 0.0022083264126633085, "phrase": "constant_speed"}, {"score": 0.0021194582289403925, "phrase": "higher_speeds"}], "paper_keywords": ["Experimentation", " Human Factors", " Measurement", " Locomotion", " low-vision", " speed-matching", " treadmill"], "paper_abstract": "Virtual environments (VEs) allow safe, repeatable, and controlled evaluations of obstacle avoidance and navigation performance of people with visual impairments using visual aids. Proper simulation of mobility in a VE requires an interface, which allows subjects to set their walking pace. Using conventional treadmills, the subject can change their walking speed by pushing the tread with their feet, while leveraging handrails or ropes (self-propelled mode). We developed a feedback-controlled locomotion interface that allows the VE workstation to control the speed of the treadmill, based on the position of the user. The position and speed information is also used to implement automated safety measures, so that the treadmill can be halted in case of erratic behavior. We compared the feedback-controlled to the self-propelled mode by using speed-matching tasks (follow a moving object or match the speed of an independently moving scene) to measure the efficacy of each mode in maintaining constant subject position, subject control of the treadmill, and subject pulse rates. In addition, we measured the perception of speed in the VE on each mode. The feedback-controlled mode required less physical exertion than self-propelled. The average position of subjects on the feedback-controlled treadmill was always within a centimeter of the desired position. There was a smaller standard deviation in subject position when using the self-propelled mode than when using the feedback-controlled mode, but the difference averaged less than 6 cm across all subjects walking at a constant speed. Although all subjects underestimated the speed of an independently moving scene at higher speeds, their estimates were more accurate when using the feedback-controlled treadmill than the self-propelled.", "paper_title": "A Feedback-Controlled Interface for Treadmill Locomotion in Virtual Environments", "paper_id": "WOS:000207052000007"}