{"auto_keywords": [{"score": 0.04835764792705378, "phrase": "space-filling_curves"}, {"score": 0.00481495049065317, "phrase": "spatial_orders"}, {"score": 0.004451676867747938, "phrase": "diverse_fields"}, {"score": 0.004382364826200616, "phrase": "space-filling_curve"}, {"score": 0.003905864553426306, "phrase": "mathematical_terms"}, {"score": 0.0036489343475053187, "phrase": "integer_line"}, {"score": 0.0034628156490003775, "phrase": "large_number"}, {"score": 0.0030538300202383106, "phrase": "location_code"}, {"score": 0.002693018258362651, "phrase": "desired_domain"}, {"score": 0.0025824576209656676, "phrase": "underlying_theory"}, {"score": 0.0022299587520401747, "phrase": "incongruent_curves"}, {"score": 0.0021049977753042253, "phrase": "associated_congruent_curves"}], "paper_keywords": ["Spatial order", " space-filling curve", " location code", " Z-order", " U-order", " X-order", " Gray-order"], "paper_abstract": "Space-filling curves have been found useful for many applications in diverse fields. A space-filling curve is a path in a 2(r) x 2(r) raster domain, which visits each location exactly once. In mathematical terms, space-filling curves linearize a 2D integer space, bijectively mapping the space to the integer line. An algorithm is presented, which generates a large number of space-filling curves/spatial orders. Functions are derived such that the code of each location can be calculated from its coordinates and, conversely, a location code can be decoded to yield the coordinates. The algorithm first generates generate 4x4 spatial orders; they subsequently may be scaled up to any desired domain of size 2r x 2r. The underlying theory of the algorithm, the processes for scaling up, encoding, and decoding are described in detail. The curves are generated as a set of incongruent curves, followed, if required, by the sets of associated congruent curves. A number of space-filling curves are illustrated.", "paper_title": "Generation of Spatial Orders and Space-Filling Curves", "paper_id": "WOS:000355511400007"}