{"auto_keywords": [{"score": 0.04749929116391282, "phrase": "electronic_voting_system"}, {"score": 0.011563235440146268, "phrase": "legal_signature"}, {"score": 0.010985018032136324, "phrase": "practical_applications"}, {"score": 0.009555822243264617, "phrase": "wu_et_al"}, {"score": 0.00481495049065317, "phrase": "secure_intelligent_universal_designated_verifier_signature_scheme"}, {"score": 0.004657739551687038, "phrase": "paramount_concern"}, {"score": 0.004522291357556591, "phrase": "sensitive_data"}, {"score": 0.004310606423012634, "phrase": "wu"}, {"score": 0.004278883064647061, "phrase": "lin"}, {"score": 0.00424734451992536, "phrase": "inf_technol_control"}, {"score": 0.004108589735101849, "phrase": "new_probabilistic_signature_scheme"}, {"score": 0.0038729688332870865, "phrase": "bilinear_inverse_diffie-hellman_assumption"}, {"score": 0.003161065111494053, "phrase": "random_oracles"}, {"score": 0.0024677487011556427, "phrase": "real-time_packet_analyzer"}, {"score": 0.002431525473795068, "phrase": "invalid_signature"}, {"score": 0.0023346234464901978, "phrase": "existing_scheme"}, {"score": 0.002176235362654451, "phrase": "designed_scheme"}, {"score": 0.0021442819603609835, "phrase": "regular_intervals"}, {"score": 0.0021049977753042253, "phrase": "adequate_measures"}], "paper_keywords": ["Probabilistic signature", " Universal designated verifier signature", " Bilinear inverse Diffie-Hellman problem", " Privacy-preserving", " Random oracle"], "paper_abstract": "Security is a paramount concern for various applications, such as electronic voting system as sensitive data is to be transmitted among the nodes during transmission. Recently, Wu and Lin (Inf Technol Control 42:231-237, 2013) proposed a new probabilistic signature scheme and used it to construct two universal designated verifier signature schemes. They demonstrated that their scheme was secure under the bilinear inverse Diffie-Hellman assumption. However, in this paper, we will show that their scheme cannot provide unforgeability, i.e., the adversary could forge a legal signature of any message. The analysis shows that their schemes are not suitable for practical applications. To overcome these weaknesses, we proposed three improved schemes which are provably secure in the random oracles. In summary, our contributions in this paper was listed in following three folds: (1) we have shown that Wu et al. schemes cannot provide unforgeability, i.e., the adversary could forge a legal signature of any message. (2) We have proposed three improved schemes which overcomes the drawbacks of Wu et al. scheme and finally, (3) we have implemented the real-time packet analyzer for detection of invalid signature in electronic voting system using Snort. The analysis shows that the existing scheme is not suitable for practical applications and our implemented scheme is able to detect the vulnerability in the electronic voting system. The designed scheme generated alerts at regular intervals so that administrator takes adequate measures to mitigate the intrusion presented in the system.", "paper_title": "Detection and analysis of secure intelligent universal designated verifier signature scheme for electronic voting system", "paper_id": "WOS:000342468200012"}