{"auto_keywords": [{"score": 0.04379011383419586, "phrase": "cl_process"}, {"score": 0.015348533997859674, "phrase": "competitive_intelligence"}, {"score": 0.015203471658330506, "phrase": "ci"}, {"score": 0.00481495049065317, "phrase": "purpose_-_little_empirical_research"}, {"score": 0.004435230698216773, "phrase": "quantitative_strand"}, {"score": 0.0043713857434347254, "phrase": "cl_literature"}, {"score": 0.004246428036409373, "phrase": "theoretical_constructs"}, {"score": 0.004026505114417176, "phrase": "south_african_and_flemish_exporters"}, {"score": 0.003949377440799037, "phrase": "exploratory_factor_analysis"}, {"score": 0.0038924989779389424, "phrase": "equivalence_analysis"}, {"score": 0.0029117710453690827, "phrase": "bias_analysis"}, {"score": 0.0025181367444581993, "phrase": "large_extent"}, {"score": 0.0024224481033945943, "phrase": "important_influencing_factor"}, {"score": 0.002387507583705495, "phrase": "business'_ci_process"}], "paper_keywords": ["competitive strategy", " intelligence", " South Africa", " Belgium"], "paper_abstract": "Purpose - Little empirical research has been conducted on competitive intelligence (CI). This paper aims to contribute to the quantitative strand of the Cl literature by exploring and validating the theoretical constructs of the Cl process. Design/methodology/approach - Data from 601 questionnaires filled out by South African and Flemish exporters were subjected to exploratory factor analysis and construct equivalence analysis between the sub-samples. Findings - The results showed that the Cl process consists of three constructs, while the context in which Cl takes place consists of four constructs. This agrees to some extent with the literature. When verifying the constructs for both cultures it was found that all but one Cl context construct can be viewed as equivalent in both groups. Bias analysis identified one item in the questionnaire that was biased. Via regression analysis it was also indicated that the context in which Cl takes place influences the Cl process to a large extent. The research identified size as an important influencing factor in a business' CI process. Practical implications - Businesses involved in CI should take note that an improvement in their formal infrastructure, employee involvement and internal information processes could enhance their CI capability. Originality/value - This paper contributes towards the formalising of the constructs of competitive intelligence.", "paper_title": "Competitive intelligence: construct exploration, validation and equivalence", "paper_id": "WOS:000259203400007"}