{"auto_keywords": [{"score": 0.030245997979212593, "phrase": "scanpath_entropy"}, {"score": 0.028191170410868913, "phrase": "meaningful_perception"}, {"score": 0.0277143692986528, "phrase": "scr"}, {"score": 0.00481495049065317, "phrase": "eye_scanpath_entropy"}, {"score": 0.004783483480147339, "phrase": "progressively_forming_virtual_environment"}, {"score": 0.004710854091689325, "phrase": "virtual_environments"}, {"score": 0.004460309246062286, "phrase": "unconscious_physiological_responses"}, {"score": 0.004431149592844886, "phrase": "overt_behavior"}, {"score": 0.004288173818239941, "phrase": "different_indications"}, {"score": 0.004213807942260972, "phrase": "gradually_forming_environment"}, {"score": 0.004122654053110448, "phrase": "immersive_virtual_environment"}, {"score": 0.0038608086188975494, "phrase": "increasing_number"}, {"score": 0.0038271712887391015, "phrase": "random_order"}, {"score": 0.003802135020791801, "phrase": "head-tracked_head-mounted_display"}, {"score": 0.003752550907120244, "phrase": "experimental_participants"}, {"score": 0.0035527910918846397, "phrase": "second_group"}, {"score": 0.0033197446406648626, "phrase": "normal_ground_level"}, {"score": 0.00329080576226637, "phrase": "third_group"}, {"score": 0.003191485583025302, "phrase": "meaningful_environment"}, {"score": 0.0031223774204093713, "phrase": "tall_column"}, {"score": 0.0031019373572233706, "phrase": "significant_decrease"}, {"score": 0.003068166587650604, "phrase": "eye_scanpath"}, {"score": 0.0028857130140890787, "phrase": "ground_level_participants"}, {"score": 0.002866817775018445, "phrase": "similar_decrease"}, {"score": 0.0028108699157482877, "phrase": "scr."}, {"score": 0.0027985846558073457, "phrase": "random_scenario"}, {"score": 0.0025750928944698673, "phrase": "aversive_stimulus"}, {"score": 0.0024272011911916917, "phrase": "virtual_environment"}, {"score": 0.0023694065215394593, "phrase": "entire_scenario"}, {"score": 0.002323142666222693, "phrase": "minimal_cues"}, {"score": 0.002218668420806254, "phrase": "sympathetic_nervous_system"}, {"score": 0.0021049977753042253, "phrase": "important_practical_aspect"}], "paper_keywords": [""], "paper_abstract": "A sign of presence in virtual environments is that people respond to situations and events as if they were real, where response may be considered at many different levels, ranging from unconscious physiological responses through to overt behavior, emotions, and thoughts. In this paper we consider two responses that gave different indications of the onset of presence in a gradually forming environment. Two aspects of the response of people to an immersive virtual environment were recorded: their eye scanpath, and their skin conductance response (SCR). The scenario was formed over a period of 2 min, by introducing an increasing number of its polygons in random order in a head-tracked head-mounted display. For one group of experimental participants (n = 8) the environment formed into one in which they found themselves standing on top of a 3 m high column. For a second group of participants (n = 6) the environment was otherwise the same except that the column was only 1 cm high, so that they would be standing at normal ground level. For a third group of participants (n = 14) the polygons never formed into a meaningful environment. The participants who stood on top of the tall column exhibited a significant decrease in entropy of the eye scanpath and an increase in the number of SCR by 99 s into the scenario, at a time when only 65% of the polygons had been displayed. The ground level participants exhibited a similar decrease in scanpath entropy, but not the increase in SCR. The random scenario grouping did not exhibit this decrease in eye scanpath entropy. A drop in scanpath entropy indicates that the environment had cohered into a meaningful perception. An increase in the rate of SCR indicates the perception of an aversive stimulus. These results suggest that on these two dimensions (scanpath entropy and rate of SCR) participants were responding realistically to the scenario shown in the virtual environment. In addition, the response occurred well before the entire scenario had been displayed, suggesting that once a set of minimal cues exists within a scenario, it is enough to form a meaningful perception. Moreover, at the level of the sympathetic nervous system, the participants who were standing on top of the column exhibited arousal as if their experience might be real. This is an important practical aspect of the concept of presence.", "paper_title": "An Analysis of Eye Scanpath Entropy in a Progressively Forming Virtual Environment", "paper_id": "WOS:000267410300002"}