{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "clinical_information"}, {"score": 0.006833935421447016, "phrase": "acquisition-cognition-application_model"}, {"score": 0.006827532775058603, "phrase": "specific_patient"}, {"score": 0.006153979103478473, "phrase": "primary_healthcare"}, {"score": 0.004706305193222972, "phrase": "theoretical_model"}, {"score": 0.0040479661688863884, "phrase": "naturalistic_and_longitudinal_study"}, {"score": 0.0039027036493682887, "phrase": "family_physicians"}, {"score": 0.003849579089885659, "phrase": "handheld_computer"}, {"score": 0.0034027387694902287, "phrase": "clinical_question"}, {"score": 0.0032805541677236325, "phrase": "relevant_clinical_information"}, {"score": 0.0028470123663391126, "phrase": "significant_associations"}, {"score": 0.0028210902750714075, "phrase": "specific_types"}, {"score": 0.0027954035431845344, "phrase": "cognitive_impact"}, {"score": 0.002769950045729965, "phrase": "information_use"}, {"score": 0.0023173287402646577, "phrase": "empirical_data"}, {"score": 0.0021049977753042253, "phrase": "research-based_information"}], "paper_keywords": [""], "paper_abstract": "Inspired by the acquisition-cognition-application model (T. Saracevic & K. B. Kantor, 1997), we developed a tool called the Information Assessment Method to more clearly understand how physicians use clinical information. In primary healthcare, we conducted a naturalistic and longitudinal study of searches for clinical information. Forty-one family physicians received a handheld computer with the Information Assessment Method linked to one commercial electronic knowledge resource. Over an average of 320 days, 83% of 2,131 searches for clinical information were rated using the Information Assessment Method. Searches to address a clinical question, as well as the retrieval of relevant clinical information, were positively associated with the use of that information for a specific patient. Searches done out of curiosity were negatively associated with the use of clinical information. We found significant associations between specific types of cognitive impact and information use for a specific patient. For example, when the physician reported \"My practice was changed and improved\" as a result of this clinical information, the odds that information was used for a specific patient increased threefold. Our findings provide empirical data to support the applicability of the acquisition-cognition-application model, as operationalized through the Information Assessment Method, in primary healthcare. Capturing the use of research-based information in medicine opens the door to further study of the relationships between clinical information and health outcomes.", "paper_title": "Physicians' Assessment of the Value of Clinical Information: Operationalization of a Theoretical Model", "paper_id": "WOS:000295458700003"}