{"auto_keywords": [{"score": 0.03854580309155757, "phrase": "sparse_coding"}, {"score": 0.02322730111336098, "phrase": "laplacian_sparse_coding"}, {"score": 0.010521505315558373, "phrase": "hypergraph_laplacian_sparse_coding"}, {"score": 0.01016561578467957, "phrase": "good_performance"}, {"score": 0.007816688370725359, "phrase": "sparse_codes"}, {"score": 0.004435006247087171, "phrase": "overcomplete_codebook"}, {"score": 0.004377806391261418, "phrase": "independent_coding_process"}, {"score": 0.004014800383343256, "phrase": "similarity_information"}, {"score": 0.0027304365438083874, "phrase": "hypergraph_laplacian"}, {"score": 0.0025922694078836794, "phrase": "laplacian"}, {"score": 0.0025145641652082164, "phrase": "bag-of"}, {"score": 0.0024928553725344933, "phrase": "image_representation"}, {"score": 0.0023664730217196252, "phrase": "image_classification_problem"}, {"score": 0.0022562464662197867, "phrase": "semi-auto_image_tagging_problem"}, {"score": 0.0021049977753042253, "phrase": "similarity_preservation"}], "paper_keywords": ["Laplacian sparse coding", " hypergraph Laplacian sparse coding", " image classification", " semi-auto image tagging", " locality preserving"], "paper_abstract": "Sparse coding exhibits good performance in many computer vision applications. However, due to the overcomplete codebook and the independent coding process, the locality and the similarity among the instances to be encoded are lost. To preserve such locality and similarity information, we propose a Laplacian sparse coding (LSc) framework. By incorporating the similarity preserving term into the objective of sparse coding, our proposed Laplacian sparse coding can alleviate the instability of sparse codes. Furthermore, we propose a Hypergraph Laplacian sparse coding (HLSc), which extends our Laplacian sparse coding to the case where the similarity among the instances defined by a hypergraph. Specifically, this HLSc captures the similarity among the instances within the same hyperedge simultaneously, and also makes the sparse codes of them be similar to each other. Both Laplacian sparse coding and Hypergraph Laplacian sparse coding enhance the robustness of sparse coding. We apply the Laplacian sparse coding to feature quantization in Bag-of-Words image representation, and it outperforms sparse coding and achieves good performance in solving the image classification problem. The Hypergraph Laplacian sparse coding is also successfully used to solve the semi-auto image tagging problem. The good performance of these applications demonstrates the effectiveness of our proposed formulations in locality and similarity preservation.", "paper_title": "Laplacian Sparse Coding, Hypergraph Laplacian Sparse Coding, and Applications", "paper_id": "WOS:000311127700010"}