{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elastic_parameters"}, {"score": 0.03137538591643984, "phrase": "indenting_regions"}, {"score": 0.004694700982410345, "phrase": "conventional_methods"}, {"score": 0.004481954307639453, "phrase": "investigated_specimen"}, {"score": 0.004351595642056769, "phrase": "elastic_modulus"}, {"score": 0.003916098498242888, "phrase": "investigated_object"}, {"score": 0.0036296886647898094, "phrase": "applied_force"}, {"score": 0.0031710903727066313, "phrase": "alternative_method"}, {"score": 0.002914288956035066, "phrase": "force_sensors"}, {"score": 0.0024926348205500715, "phrase": "soft_sample"}, {"score": 0.002450864311898833, "phrase": "greater_extent"}, {"score": 0.0023395610923736595, "phrase": "geometric_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elastic_properties"}], "paper_keywords": ["palpation sensor", " haptic sensor", " elastic modulus"], "paper_abstract": "Conventional methods for the measurement of elastic parameters demand the anchoring of the investigated specimen. In order to determine the elastic modulus, one needs to measure the force acting on the specimen, as well as the deformation caused by the force. If the investigated object is not anchored, it does not only deform, but will also shift due to the applied force, and the measurement cannot be performed. Several medical and robotic applications require the investigation of tissues and objects that cannot be fixed. In order to overcome this problem, an alternative method for the measurement of the elastic parameters has been elaborated. A device with offsetting and indenting regions was constructed. Force sensors are built into the offsetting, and distance measuring sensors built into the indenting regions of the device. If the instrument is pressed to the sample, the sample will deform according to its elastic parameters. A soft sample will fold with greater extent into the indenting regions as a hard one. Knowing the geometric characteristics of the device, and the values of the signals supplied by the force and distance sensors, it is possible to determine the elastic properties of the sample. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Measuring the elastic parameters of samples without anchoring", "paper_id": "WOS:000249163100002"}