{"auto_keywords": [{"score": 0.04956147216757455, "phrase": "fuzzy_time_series"}, {"score": 0.009549945345771464, "phrase": "existing_fuzzy_forecasting_methods"}, {"score": 0.007601913282218312, "phrase": "automatic_clustering_techniques"}, {"score": 0.005816906767737039, "phrase": "static_length"}, {"score": 0.005371548182211529, "phrase": "historical_data"}, {"score": 0.0049601173714474735, "phrase": "forecasting_accuracy_rates"}, {"score": 0.00481495049065317, "phrase": "fuzzy_forecasting"}, {"score": 0.004366106816225457, "phrase": "stock_price"}, {"score": 0.0043345662747335065, "phrase": "university_enrollments"}, {"score": 0.004290764658893965, "phrase": "taiex"}, {"score": 0.0037903327482565097, "phrase": "forecasting_accuracy_rate"}, {"score": 0.002918826667294298, "phrase": "new_fuzzy_forecasting_method"}, {"score": 0.0027143926774929957, "phrase": "multivariate_fuzzy_forecasting_method"}, {"score": 0.002542642270762272, "phrase": "existing_methods"}, {"score": 0.0024788167298469455, "phrase": "new_automatic_clustering_algorithm"}, {"score": 0.0024519545383399773, "phrase": "different_lengths"}, {"score": 0.0023303871145705954, "phrase": "new_multivariate_fuzzy_forecasting_method"}, {"score": 0.0022472527731744974, "phrase": "proposed_automatic_clustering_algorithm"}, {"score": 0.0022228943786652914, "phrase": "proposed_multivariate_fuzzy_forecasting_method"}, {"score": 0.002206801982145622, "phrase": "higher_average_forecasting_accuracy_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Automatic clustering techniques", " Fuzzy forecasting", " Fuzzy time series", " Multivariate fuzzy forecasting model"], "paper_abstract": "In recent years, some methods have been presented based on fuzzy time series to make predictions in many areas, such as forecasting stock price, university enrollments, the weather, etc. When using fuzzy time series for forecasting, it is obvious that the length of intervals in the universe of discourse is important due to the fact that it can affect the forecasting accuracy rate. However, most of the existing fuzzy forecasting methods based on fuzzy time series used the static length of intervals, i.e., the same length of intervals. The drawback of the static length of intervals is that the historical data are roughly put into the intervals, even if the variance of the historical data is not high. Moreover, the forecasting accuracy rates of the existing fuzzy forecasting methods are not good enough. Therefore, we must develop a new fuzzy forecasting method to overcome the drawbacks of the existing fuzzy forecasting methods to increase the forecasting accuracy rates. In this paper, we propose a multivariate fuzzy forecasting method to forecast the Taiwan Stock Exchange Capitalization Weighted Stock Index (TAIEX) based on fuzzy time series and automatic clustering techniques to overcome the drawbacks of the existing methods. First, we propose a new automatic clustering algorithm to generate different lengths of intervals in the universe of discourse. Then, we propose a new multivariate fuzzy forecasting method to forecast the TAIEX based on fuzzy time series and the proposed automatic clustering algorithm. The proposed multivariate fuzzy forecasting method gets higher average forecasting accuracy rates than the existing methods for forecasting the TAIEX. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Multivariate fuzzy forecasting based on fuzzy time series and automatic clustering techniques", "paper_id": "WOS:000290237500176"}