{"auto_keywords": [{"score": 0.030434991077904632, "phrase": "key_bundles"}, {"score": 0.01767839191772056, "phrase": "elementary_group"}, {"score": 0.011231005583504107, "phrase": "elementary_groups"}, {"score": 0.006451166036278755, "phrase": "system_server"}, {"score": 0.004583403452794034, "phrase": "arbitrary_groups"}, {"score": 0.004583375816926526, "phrase": "key_parcels"}, {"score": 0.004177204158688879, "phrase": "security_key"}, {"score": 0.003941746077126688, "phrase": "user_u"}, {"score": 0.003884977091580757, "phrase": "data_item_d"}, {"score": 0.0038179283509963695, "phrase": "arbitrary_group_g"}, {"score": 0.0035507457285983268, "phrase": "encrypted_d"}, {"score": 0.0034995881411519925, "phrase": "g._every_elementary_group"}, {"score": 0.0034391676583422257, "phrase": "key_tree"}, {"score": 0.003189133102243104, "phrase": "e._jung"}, {"score": 0.003170667618004276, "phrase": "a.x._liu"}, {"score": 0.0031523087131407205, "phrase": "m.g._gouda"}, {"score": 0.0030004756968716917, "phrase": "group_communications_and_charges"}, {"score": 0.002906138793910919, "phrase": "key_trees"}, {"score": 0.0026713696264706287, "phrase": "data_item"}, {"score": 0.002535265741041731, "phrase": "total_number"}, {"score": 0.002192418237185872, "phrase": "different_elementary_groups"}, {"score": 0.0021420294823879292, "phrase": "multiple_servers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["security", " network security", " group communication", " multicast", " key tree"], "paper_abstract": "We consider a system where each user is in one or more elementary groups. In this system, arbitrary groups of users can be specified using the operations of union, intersection, and complement over the elementary groups in the system. Each elementary group in the system is provided with a security key that is known only to the users in the elementary group and to the system server. Thus, for any user u to securely multicast a data item d to every user in an arbitrary group G, it first for-wards d to the system server which encrypts it using the keys of the elementary groups that comprise G before multicasting the encrypted d to every user in G. Every elementary group is also provided with a key tree to ensure that the cost of changing the key of the elementary group, when a user leaves the group, is small. In [E. Jung, A.X. Liu, M.G. Gouda, Key bundles and parcels: secure communication in many groups, in: LNCS 2816, Group Communications and Charges, 2003], we introduced two methods for packing the key trees of elementary groups into key bundles and into key parcels. We also showed that packing into key bundles has the advantage of reducing the number of encryptions needed to multicast a data item to the complement of an elementary group, while packing into key parcels has the advantage of reducing the total number of keys in the system. In this paper, we present more details of key bundles and parcels: the algorithms that construct key bundles and parcels, and more simulation results comparing key bundles and parcels. We also discuss how to reconfigure key bundles and parcels when the. user joins or leaves different elementary groups and how to balance the load among multiple servers. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Key bundles and parcels: Secure communication in many groups", "paper_id": "WOS:000238635900008"}