{"auto_keywords": [{"score": 0.046626403599350386, "phrase": "search_time"}, {"score": 0.014964009605789523, "phrase": "indexed_text"}, {"score": 0.004750002000045893, "phrase": "size_sigma"}, {"score": 0.004717855468042875, "phrase": "full-text_search_problem"}, {"score": 0.004664758386159831, "phrase": "occ_occurrences"}, {"score": 0.004418056660305108, "phrase": "space_requirement"}, {"score": 0.004388146725795544, "phrase": "current_trend"}, {"score": 0.004319138558590907, "phrase": "compressed_full-text_self-indices"}, {"score": 0.004165436366506785, "phrase": "indexed_access"}, {"score": 0.004072151173652378, "phrase": "efficient_access"}, {"score": 0.004053745316167863, "phrase": "compressed_space"}, {"score": 0.004026291769609849, "phrase": "lempel-ziv_index"}, {"score": 0.003962980067082999, "phrase": "navarro"}, {"score": 0.003936110411380233, "phrase": "compressed_full-text_self-index"}, {"score": 0.0037447313222555415, "phrase": "k-th_order"}, {"score": 0.003522482515043419, "phrase": "pattern_p"}, {"score": 0.003298392625440108, "phrase": "long_patterns"}, {"score": 0.0031166519226210696, "phrase": "stronger_lempel-ziv_based_indices"}, {"score": 0.0030536985507307046, "phrase": "overall_performance"}, {"score": 0.0030329970862470732, "phrase": "original_lz-index"}, {"score": 0.0021049977753042253, "phrase": "space-efficient_indexed_text_searching"}], "paper_keywords": ["Text compression", " Compressed data structures", " Compressed full-text indices", " Lempel-Ziv compression"], "paper_abstract": "Given a text T[1..u] over an alphabet of size sigma, the full-text search problem consists in finding the occ occurrences of a given pattern P[1..m] in T. In indexed text searching we build an index on T to improve the search time, yet increasing the space requirement. The current trend in indexed text searching is that of compressed full-text self-indices, which replace the text with a more space-efficient representation of it, at the same time providing indexed access to the text. Thus, we can provide efficient access within compressed space. The Lempel-Ziv index (LZ-index) of Navarro is a compressed full-text self-index able to represent T using 4uH (k) (T)+o(ulog sigma) bits of space, where H (k) (T) denotes the k-th order empirical entropy of T, for any k=o(log (sigma) u). This space is about four times the compressed text size. The index can locate all the occ occurrences of a pattern P in T in O(m (3)log sigma+(m+occ)log u) worst-case time. Although this index has proven very competitive in practice, the O(m (3)log sigma) term can be excessive for long patterns. Also, the factor 4 in its space complexity makes it larger than other state-of-the-art alternatives. In this paper we present stronger Lempel-Ziv based indices (LZ-indices), improving the overall performance of the original LZ-index. We achieve indices requiring (2+epsilon)uH (k) (T)+o(ulog sigma) bits of space, for any constant epsilon > 0, which makes them the smallest existing LZ-indices. We simultaneously improve the search time to O(m (2)+(m+occ)log u), which makes our indices very competitive with state-of-the-art alternatives. Our indices support displaying any text substring of length a\"\" in optimal O(a\"\"/log (sigma) u) time. In addition, we show how the space can be squeezed to (1+epsilon)uH (k) (T)+o(ulog sigma) to obtain a structure with O(m (2)) average search time for ma parts per thousand yen2log (sigma) u. Alternatively, the search time of LZ-indices can be improved to O((m+occ)log u) with (3+epsilon)uH (k) (T)+o(ulog sigma) bits of space, which is much less than the space needed by other Lempel-Ziv-based indices achieving the same search time. Overall our indices stand out as a very attractive alternative for space-efficient indexed text searching.", "paper_title": "Stronger Lempel-Ziv Based Compressed Text Indexing", "paper_id": "WOS:000298388200004"}