{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_networks"}, {"score": 0.00730580532224891, "phrase": "multiagent_systems"}, {"score": 0.004768739216860887, "phrase": "multiagent_perspective"}, {"score": 0.004486147558765763, "phrase": "autonomous_social_actors"}, {"score": 0.004443077867798955, "phrase": "interaction_relations"}, {"score": 0.004386291308906104, "phrase": "multiagent_computing"}, {"score": 0.0042611497796259026, "phrase": "powerful_paradigm"}, {"score": 0.004220231044214606, "phrase": "autonomous_multientity_systems"}, {"score": 0.0036868116297599255, "phrase": "actor-oriented_view"}, {"score": 0.0034237422623525937, "phrase": "network_structures"}, {"score": 0.003220596121589591, "phrase": "last_two_views"}, {"score": 0.002914624187933378, "phrase": "coordination_mechanisms"}, {"score": 0.0028187847843325216, "phrase": "multiagent_coordination_perspective"}, {"score": 0.002813169398244266, "phrase": "typical_types"}, {"score": 0.0027951050793612025, "phrase": "coordination_situations"}, {"score": 0.0027416032255956585, "phrase": "previous_studies"}, {"score": 0.0025051226957195634, "phrase": "existing_studies"}, {"score": 0.0024730434312323296, "phrase": "challenge_issues"}], "paper_keywords": ["Social networks", " multiagent systems", " coordination", " cooperative", " noncooperative", " multiplexity"], "paper_abstract": "Social networks have recently been widely explored in many fields; these networks are composed of a set of autonomous social actors and the interaction relations among them. Multiagent computing has already been widely envisioned to be a powerful paradigm for modeling autonomous multientity systems; therefore, it is promising to connect the research on social networks and multiagent systems. In general, there are three views for research on social networks: the structure-oriented view, in which only the network structure characteristics among actors are considered, the actor-oriented view, in which only the behavior characteristics of actors are considered, and the actor-structure crossing view, in which both actors and network structures are considered and their crossing effects are explored. This survey paper mainly concerns studies on social networks that have the last two views and discusses the relationship between social networks and multiagent systems. Because coordination is critical for both multiagent systems and social networks, this paper classifies studies on social networks that are based on the coordination mechanisms among the actors in the social networks. By referring to typical types of coordination situations in multiagent systems, social networks in previous studies can be classified into three classes: cooperative social networks, noncooperative social networks, and multiple social networks; for each class, this paper reviews the existing studies and discusses the challenge issues and possible future research directions. From this survey, we find that social networks can be understood well via a multiagent coordination perspective and also that many multiagent coordination techniques can be cogently applied in research on social networks. Moreover, this paper discusses the advantages and disadvantages of the multiagent coordination perspective by comparing with other perspectives on studying social networks.", "paper_title": "Understanding Social Networks From a Multiagent Perspective", "paper_id": "WOS:000342179600024"}