{"auto_keywords": [{"score": 0.036590546733605435, "phrase": "individual_product"}, {"score": 0.004658426838467567, "phrase": "different_kinds"}, {"score": 0.0043066860455264, "phrase": "online_comments"}, {"score": 0.0038838500580958744, "phrase": "different_products"}, {"score": 0.0033465923623290034, "phrase": "novel_approach"}, {"score": 0.0033053159828082095, "phrase": "review_summaries"}, {"score": 0.0032510690712452147, "phrase": "description_snippets"}, {"score": 0.003132236287543072, "phrase": "large_number"}, {"score": 0.0028243822059448266, "phrase": "consumer_opinions"}, {"score": 0.0025257081555100556, "phrase": "generic_framework"}, {"score": 0.002413256359147736, "phrase": "new_snippet_selection_algorithm"}, {"score": 0.002363806685815014, "phrase": "returned_results"}, {"score": 0.0023346234464901978, "phrase": "opinion-aspect_statistical_properties"}, {"score": 0.002305799666781492, "phrase": "-aspect_coverage"}, {"score": 0.0022679195103377124, "phrase": "standard_seat_allocation_algorithm"}], "paper_keywords": ["online transaction", " diversification", " review summarization", " review scoring"], "paper_abstract": "Currently, there are many online review web sites where consumers can freely write comments about different kinds of products and services. These comments are quite useful for other potential consumers. However, the number of online comments is often large and the number continues to grow as more and more consumers contribute. In addition, one comment may mention more than one product and contain opinions about different products, mentioning something good and something bad. However, they share only a single overall score. Therefore, it is not easy to know the quality of an individual product from these comments. This paper presents a novel approach to generate review summaries including scores and description snippets with respect to each individual product. From the large number of comments, we first extract the context (snippet) that includes a description of the products and choose those snippets that express consumer opinions on them. We then propose several methods to predict the rating (from 1 to 5 stars) of the snippets. Finally, we derive a generic framework for generating summaries from the snippets. We design a new snippet selection algorithm to ensure that the returned results preserve the opinion-aspect statistical properties and attribute-aspect coverage based on a standard seat allocation algorithm. Through experimentswe demonstrate empirically that our methods are effective. We also quantitatively evaluate each step of our approach.", "paper_title": "Product-oriented review summarization and scoring", "paper_id": "WOS:000351519500004"}