{"auto_keywords": [{"score": 0.04923220525049615, "phrase": "thermal_images"}, {"score": 0.015719716506582538, "phrase": "characteristic_areas"}, {"score": 0.004790458415602282, "phrase": "thermal_face_images"}, {"score": 0.0046937237797352515, "phrase": "selected_area"}, {"score": 0.004634254474150777, "phrase": "screening_systems"}, {"score": 0.004563880494020726, "phrase": "accurate_analysis"}, {"score": 0.004529093447865156, "phrase": "temperature_distribution"}, {"score": 0.004506048850130758, "phrase": "individual_areas"}, {"score": 0.004437613070853689, "phrase": "profiled_image_analysis_methods"}, {"score": 0.00437021209960886, "phrase": "automated_face_analysis"}, {"score": 0.0042928648367867835, "phrase": "train_stations"}, {"score": 0.004121151577754209, "phrase": "automatic_separation"}, {"score": 0.0041001740903338834, "phrase": "specific_areas"}, {"score": 0.003986684503518077, "phrase": "image_analysis"}, {"score": 0.0038174155069599864, "phrase": "subjects'_variability"}, {"score": 0.00342054627009158, "phrase": "prevailing_room_conditions"}, {"score": 0.0033857878144822906, "phrase": "previous_studies"}, {"score": 0.0033685408148574846, "phrase": "marzec"}, {"score": 0.0031521392193570846, "phrase": "research_material"}, {"score": 0.0030726483206730388, "phrase": "katowice"}, {"score": 0.003057013146071458, "phrase": "poland"}, {"score": 0.0025826247025542213, "phrase": "medical_thermography"}, {"score": 0.0025433263646920364, "phrase": "marzec_et_al"}, {"score": 0.002261204313587616, "phrase": "approximate_areas"}, {"score": 0.002249672943553135, "phrase": "selected_parts"}, {"score": 0.0021705796895687864, "phrase": "better_results"}, {"score": 0.002137537770621167, "phrase": "localization_accuracy"}, {"score": 0.0021049977753042253, "phrase": "eye_sockets"}], "paper_keywords": ["Facial features", " Image analysis", " Segmentation", " Thermograms", " Thermovision"], "paper_abstract": "The use of thermal images of a selected area of the head in screening systems, which perform fast and accurate analysis of the temperature distribution of individual areas, requires the use of profiled image analysis methods. There exist methods for automated face analysis which are used at airports or train stations and are designed to detect people with fever. However, they do not enable automatic separation of specific areas of the face. This paper presents an algorithm for image analysis which enables localization of characteristic areas of the face in thermograms. The algorithm is resistant to subjects' variability and also to changes in the position and orientation of the head. In addition, an attempt was made to eliminate the impact of background and interference caused by hair and hairline. The algorithm automatically adjusts its operation parameters to suit the prevailing room conditions. Compared to previous studies (Marzec et al., J Med Inform Tech 16:151-159, 2010), the set of thermal images was expanded by 34 images. As a result, the research material was a total of 125 patients' thermograms performed in the Department of Pediatrics and Child and Adolescent Neurology in Katowice, Poland. The images were taken interchangeably with several thermal cameras: AGEMA 590 PAL (sensitivity of 0.1 A degrees C), ThermaCam S65 (sensitivity of 0.08 A degrees C), A310 (sensitivity of 0.05 A degrees C), T335 (sensitivity of 0.05 A degrees C) with a 320 x 240 pixel optical resolution of detectors, maintaining the principles related to taking thermal images for medical thermography. In comparison to (Marzec et al., J Med Inform Tech 16:151-159, 2010), the approach presented there has been extended and modified. Based on the comparison with other methods presented in the literature, it was demonstrated that this method is more complex as it enables to determine the approximate areas of selected parts of the face including anthropometry. As a result of this comparison, better results were obtained in terms of localization accuracy of the center of the eye sockets and nostrils, giving an accuracy of 87 % for the eyes and 93 % for the nostrils.", "paper_title": "Automatic method for detection of characteristic areas in thermal face images", "paper_id": "WOS:000356168600010"}