{"auto_keywords": [{"score": 0.03933093432923548, "phrase": "meaningful_learning"}, {"score": 0.012353335347729326, "phrase": "meaningful_learning_paradigm"}, {"score": 0.00481495049065317, "phrase": "meaningful_learning-based_evaluation_method"}, {"score": 0.004695303774351139, "phrase": "ubiquitous_learning"}, {"score": 0.004174929128880472, "phrase": "sound_evaluation"}, {"score": 0.004122699822340296, "phrase": "particular_paradigm"}, {"score": 0.004003348169928476, "phrase": "problem_domain"}, {"score": 0.003650195070580192, "phrase": "ultimate_learning_status"}, {"score": 0.0035296217979800463, "phrase": "learning_environment"}, {"score": 0.0031248767378106663, "phrase": "learning_activity"}, {"score": 0.002564862727498502, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ubiquitous learning", " Evaluation methodologies", " Pedagogical issues", " Elementary education"], "paper_abstract": "If ubiquitous learning (u-learning) is to be effectively developed and feasibly applied to education, it is necessary to evaluate its effectiveness. Yet to achieve a sound evaluation, a particular paradigm must be employed to fit the problem domain. Toward this end, the authors of this study have adopted a meaningful learning paradigm. Meaningful learning is often regarded as the ultimate learning status for a learner, regardless of the learning environment. Interestingly, several characteristics of u-learning are also linked to attributes of meaningful learning. For example, both u-learning and meaningful learning emphasize the authentic and active of the learning activity. Therefore, it is important to investigate the applicability of a meaningful learning paradigm for evaluating the efficacy of u-learning. The method proposed here evaluates u-learning along both macro and micro aspects, and in an effort to make u-learning more sustainable. By employing a case study, we demonstrate the feasibility of our approach by showing the advantages and disadvantages that are common to both u-learning and meaningful learning. Moreover, we also provide suggestions for instructors and designers so that they can promote the quality of u-learning. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The design and implementation of a meaningful learning-based evaluation method for ubiquitous learning", "paper_id": "WOS:000295860100010"}