{"auto_keywords": [{"score": 0.04920547630637111, "phrase": "image_analysis"}, {"score": 0.019620361801860466, "phrase": "total_porosity"}, {"score": 0.0056430407834857045, "phrase": "pore_sizes"}, {"score": 0.00481495049065317, "phrase": "carbonate_texture"}, {"score": 0.0046449953493736314, "phrase": "pore_phase"}, {"score": 0.004496542293425754, "phrase": "quantitative_pore_system_information"}, {"score": 0.004144188637321245, "phrase": "methodological_pitfalls"}, {"score": 0.004089991141220082, "phrase": "accurate_quantification"}, {"score": 0.00388016972840459, "phrase": "carbonate_lithofacies"}, {"score": 0.003819339842998955, "phrase": "bse-sem"}, {"score": 0.0037793152987497286, "phrase": "greyscale_pore_system_images"}, {"score": 0.0037005154613244363, "phrase": "binary_images"}, {"score": 0.00363290963550202, "phrase": "rock_phase"}, {"score": 0.0035980785484549123, "phrase": "wackestone_lithofacies"}, {"score": 0.003519864834185558, "phrase": "total_area"}, {"score": 0.003492155652400838, "phrase": "pore_system_image"}, {"score": 0.003374572770620577, "phrase": "standard_porosimetry_techniques"}, {"score": 0.003204227757313122, "phrase": "image_analysis_porosity"}, {"score": 0.003151113813808222, "phrase": "carbonate_textures"}, {"score": 0.0031262984171100856, "phrase": "porosity_quantification"}, {"score": 0.003028969851366049, "phrase": "micp_total_porosity"}, {"score": 0.002997203022420553, "phrase": "image_analysis_workflow"}, {"score": 0.0028886123801902517, "phrase": "lithofacies_textures"}, {"score": 0.0028734230458881903, "phrase": "pore_systems"}, {"score": 0.0024594533730032658, "phrase": "matrix_pore_types"}, {"score": 0.0024081065242654754, "phrase": "incomplete_imaging"}, {"score": 0.002376559242152662, "phrase": "unrepresentative_fields"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Image analysis", " Porosity quantification", " Carbonates", " Lithofacies"], "paper_abstract": "Image analysis is widely used to quantify porosity because, in addition to porosity, it can provide quantitative pore system information, such as pore sizes and shapes. Despite its wide use, no standard image analysis workflow exists. When employing image analysis, a workflow must be developed and evaluated to understand the methodological pitfalls and assumptions to enable accurate quantification of total porosity. This study presents an image analysis workflow that is used to quantify total porosity in a range of carbonate lithofacies. This study uses stitched BSE-SEM photomicrographs to construct greyscale pore system images, which are systematically thresholded to produce binary images composed of a pore phase and a rock phase. The ratio of the area of the pore phase to the total area of the pore system image defines the total porosity. Image analysis total porosity is compared with total porosity quantified by standard porosimetry techniques (He-porosimetry and mercury injection capillary pressure (MICP) porosimetry) to understand the systematics of the workflow. The impact of carbonate textures on image analysis porosity quantification is also assessed. A comparison between image analysis, He-porosimetry and MICP total porosity indicates that the image analysis workflow used in this study can accurately quantify or underestimate total porosity depending on the lithofacies textures and pore systems. The porosity of wackestone lithofacies tends to be significantly underestimated (i.e. greater than 10%) by image analysis, whereas packstone, grainstone, rudstone and floatstone lithofacies tend to be accurately estimated or slightly underestimated (i.e. 5% or less) by image analysis. The underestimation of image analysis porosity in the wackestone lithofacies is correlated to the quantity of matrix pore types and is thought to be caused by incomplete imaging of microporosity and by unrepresentative fields of view. Image analysis porosity, which is calculated from 2D areas, is comparable with 3D porosity volumes in lithofacies that lack or are weakly microporous; in such lithofacies, image analysis is assumed to be accurately measuring other 2D parameters, including pore sizes and shapes. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of carbonate texture on the quantification of total porosity by image analysis", "paper_id": "WOS:000365051100012"}