{"auto_keywords": [{"score": 0.03511182472801546, "phrase": "subject_areas"}, {"score": 0.00481495049065317, "phrase": "\"nash_equilibrium"}, {"score": 0.004272456401437226, "phrase": "game-theoretic_concept"}, {"score": 0.0038304902197108643, "phrase": "john_nash"}, {"score": 0.0033633514001658086, "phrase": "wide_variety"}, {"score": 0.0032769720645483102, "phrase": "nash_equilibrium-related_publications"}, {"score": 0.0031762308449055305, "phrase": "natural_and_social_sciences"}, {"score": 0.002847339938387273, "phrase": "nash's_papers"}, {"score": 0.002592606058287124, "phrase": "implicit_citations"}, {"score": 0.002435542816459651, "phrase": "time_period"}, {"score": 0.0021831803612759855, "phrase": "annual_rate"}], "paper_keywords": [""], "paper_abstract": "In order to examine the phenomena of eponymy and Obliteration by Incorporation at both the aggregate and individual subject level, the literature relating to the game-theoretic concept of the Nash Equilibrium was studied over the period 1950-2008. Almost 5,300 bibliographic database records for publications explicitly citing at least one of two papers by John Nash and/or using the phrase \"Nash Equilibrium/Nash Equilibria\" were retrieved from the Web of Science and various subject-related databases. Breadth of influence is demonstrated by the wide variety of subject areas in which Nash Equilibrium-related publications occur, including in the natural and social sciences, humanities, law, and medicine. Fifty percent of all items have been published since 2002, suggesting that Nash's papers have experienced \"delayed recognition.\" A degree of Obliteration by Incorporation is observed in that implicit citations (use of the phrase without citation) increased over the time period studied, although the proportion of all citations that are implicit has remained relatively stable during the most recent decade with an annual rate of between 60% and 70%; subject areas vary in their level of obliteration.", "paper_title": "Eponymy and Obliteration by Incorporation: The Case of the \"Nash Equilibrium\"", "paper_id": "WOS:000291953800016"}