{"auto_keywords": [{"score": 0.045338255693079324, "phrase": "alternative_ways"}, {"score": 0.00481495049065317, "phrase": "virtual_electronic_social_networks"}, {"score": 0.004740476936977635, "phrase": "traditional_advertising"}, {"score": 0.004547438494330851, "phrase": "media_owners"}, {"score": 0.0038907236419588255, "phrase": "social_network_traffic"}, {"score": 0.0037321585095070483, "phrase": "social_networks"}, {"score": 0.0035245918797629804, "phrase": "advertising_media"}, {"score": 0.0034881076466982226, "phrase": "unidirectional_message-sending_systems"}, {"score": 0.0030946423142739813, "phrase": "online_social_networks"}, {"score": 0.0029530125680590413, "phrase": "meeting_places"}, {"score": 0.0022175679453857473, "phrase": "milieux_and_meeting_places"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Advertising", " Monetizing online social networks", " Monetizing the internet", " Online revenue without advertising", " Social networks"], "paper_abstract": "As traditional advertising is losing its impact, both advertisers and the media owners who are dependent upon them are desperately seeking alternative ways to reach consumers and alternative ways to earn revenues by doing so. Although there are many ways to earn money from social network traffic, attempting to do so by treating social networks as just another entertainment medium is doomed to failure. Traditional entertainment and advertising media were unidirectional message-sending systems, where paid messages were pushed at viewers as part of the price they paid for being entertained. In contrast, online social networks are better viewed as milieux, or as meeting places where people congregate to exchange information, observe and emulate each other, assess status, and above all entertain themselves. People are not captives, and when they are not interested, are not entertained, or feel that they are being manipulated, they simply leave. The guidelines for monetizing milieux and meeting places are still being discovered. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "The complex problem of monetizing virtual electronic social networks", "paper_id": "WOS:000272366100006"}