{"auto_keywords": [{"score": 0.04959913342990779, "phrase": "retrieval_systems"}, {"score": 0.015719716506582538, "phrase": "search_results"}, {"score": 0.014660062129451435, "phrase": "human_relevance_judgments"}, {"score": 0.013490028647623343, "phrase": "overlap_structure"}, {"score": 0.01064657676588087, "phrase": "presented_method"}, {"score": 0.00473477283457869, "phrase": "relevance_judgments"}, {"score": 0.004056769841308405, "phrase": "multiple_systems"}, {"score": 0.003975781274672803, "phrase": "relative_performance_differences"}, {"score": 0.0038964032225585117, "phrase": "overlap_structures"}, {"score": 0.0038702962539127867, "phrase": "random_groupings"}, {"score": 0.0038443635340052558, "phrase": "five_systems"}, {"score": 0.003704797078215222, "phrase": "equal_number"}, {"score": 0.003594369823549604, "phrase": "average_percentage"}, {"score": 0.003558294449586273, "phrase": "system's_documents"}, {"score": 0.003152531962718477, "phrase": "retrieval_system"}, {"score": 0.002977294336234334, "phrase": "ranked_list"}, {"score": 0.002664375650349975, "phrase": "best_results"}, {"score": 0.0026023381988430666, "phrase": "previous_attempts"}, {"score": 0.002482552408222559, "phrase": "\"_method"}, {"score": 0.0023842666006371267, "phrase": "best_experts"}, {"score": 0.0022744957687536307, "phrase": "experts'_recommendations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["ranking retrieval systems", " data fusion", " meta search", " result overlap analysis"], "paper_abstract": "This paper addresses the problem of how to rank retrieval systems without the need for human relevance judgments, which are very resource intensive to obtain. Using TREC 3, 6, 7 and 8 data, it is shown how the overlap structure between the search results of multiple systems can be used to infer relative performance differences. In particular, the overlap structures for random groupings of five systems are computed, so that each system is selected an equal number of times. It is shown that the average percentage of a system's documents that are only found by it and no other systems is strongly and negatively correlated with its retrieval performance effectiveness, such as its mean average precision or precision at 1000. The presented method uses the degree of consensus or agreement a retrieval system can generate to infer its quality. This paper also addresses the question of how many documents in a ranked list need to be examined to be able to rank the systems. It is shown that the overlap structure of the top 50 documents can be used to rank the systems, often producing the best results. The presented method significantly improves upon previous attempts to rank retrieval systems without the need for human relevance judgments. This \"structure of overlap\" method can be of value to communities that need to identify the best experts or rank them, but do not have the resources to evaluate the experts' recommendations, since it does not require knowledge about the domain being searched or the information being requested. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Using the structure of overlap between search results to rank retrieval systems without relevance judgments", "paper_id": "WOS:000245605100015"}