{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_investigation"}, {"score": 0.010461432937097262, "phrase": "distinct_discipline"}, {"score": 0.006467438085313489, "phrase": "forensic_science"}, {"score": 0.0050150567497817345, "phrase": "computer_science"}, {"score": 0.004458722048888919, "phrase": "existing_academic_disciplines"}, {"score": 0.004394911125224763, "phrase": "computer"}, {"score": 0.0038973170902076707, "phrase": "significant_one"}, {"score": 0.0037864980290391354, "phrase": "professional_standards"}, {"score": 0.0034392837410790293, "phrase": "digital_investigations"}, {"score": 0.0032308006242867224, "phrase": "training_debate"}, {"score": 0.0025398521156505425, "phrase": "interdisciplinary_science"}, {"score": 0.002166711569953301, "phrase": "merits_professional_status"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital Investigation", " Academic discipline", " Education", " Training", " Pedagogy", " Curriculum"], "paper_abstract": "Is Digital Investigation sufficiently different in character from existing academic disciplines such as Computer or Forensic Science to be called a distinct discipline? Is it a profession in its own right? The authors outline why the debate is a significant one in terms of its consequences for professional standards, quality control, academic and personal accreditation. The paper emphasises the differences in the way we teach digital investigations in comparison to computer science covering theory, practice, the education versus training debate, the interdisciplinary nature of the subject, a problem solving and problem based approach, and the need to emphasis professionalism and ethics. The arguments for four alternative positions are proposed: Digital Investigation as a branch of Computer Science, Digital Investigation as a branch of Forensic Science, Digital Investigation as an interdisciplinary science and Digital Investigation as a distinct discipline. The experience gained in the development and delivery of three typical academic programmes in the area is used to support one position, namely that Digital Investigation is a distinct discipline that merits professional status. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Digital Investigation as a distinct discipline: A pedagogic perspective", "paper_id": "WOS:000271333300010"}