{"auto_keywords": [{"score": 0.03963215824845641, "phrase": "proxy_node"}, {"score": 0.034874695661108526, "phrase": "onion_routing"}, {"score": 0.00481495049065317, "phrase": "efficient_caching_strategies"}, {"score": 0.004775335634705251, "phrase": "gnutella-like_systems"}, {"score": 0.004620093797504386, "phrase": "critical_problem"}, {"score": 0.004563182153397349, "phrase": "peer-to-peer_file_sharing_system"}, {"score": 0.004414806639101985, "phrase": "agent_nodes"}, {"score": 0.004360412703519539, "phrase": "efficient_data_access_services"}, {"score": 0.00428892403807229, "phrase": "existing_technique"}, {"score": 0.004149429072483132, "phrase": "initiator_anonymity"}, {"score": 0.003264547032549398, "phrase": "fixed_proxy"}, {"score": 0.0031064226956732497, "phrase": "additional_features"}, {"score": 0.0027665315772006575, "phrase": "control_center"}, {"score": 0.0026543514413663893, "phrase": "temporary_proxy"}, {"score": 0.002515272856011004, "phrase": "retrieved_data_item"}, {"score": 0.0024842242921857705, "phrase": "reverse_path"}, {"score": 0.0023540387251475615, "phrase": "publisher_anonymity"}], "paper_keywords": [""], "paper_abstract": "A critical problem in a Peer-to-Peer file sharing system is how to protect the anonymity of agent nodes when providing efficient data access services. Most of existing technique mostly focus on how to provide the initiator anonymity and privacy, but leave the anonymity of the server. Our technique is similar to Onion routing in that it uses a proxy node to hide the identity of the client and the server. But it differs from it in that the proxy node is selected dynamically for each session and not fixed as in Onion routing. The fixed proxy might be convenient to use and is useful when loaded with additional features such as encryption as in Onion routing. However it is a sort of compromise from P2P point of view: we are introducing something similar to a control center that could become a bottleneck in the network. Temporary proxy doesn't have this problem. And our technique provides caching of a retrieved data item on the reverse path back to the requestor. Caching in our paper is primarily for providing publisher anonymity and security. In this paper, we show a technique to find such proxy and caching, explain the rationale behind the decision, and prove its effectiveness through experimentation.", "paper_title": "Efficient caching strategies for gnutella-like systems to achieve anonymity in unstructured P2P file sharing", "paper_id": "WOS:000239450400011"}