{"auto_keywords": [{"score": 0.04929460594219637, "phrase": "audio_fingerprinting"}, {"score": 0.04814050608144561, "phrase": "audio_clip"}, {"score": 0.04124249680455385, "phrase": "distorted_versions"}, {"score": 0.0229288305246866, "phrase": "identification_rate"}, {"score": 0.02246846748295755, "phrase": "false_positive_rate"}, {"score": 0.004817072885054259, "phrase": "fourier"}, {"score": 0.004488384083300084, "phrase": "extracted_fingerprint"}, {"score": 0.004396600680348434, "phrase": "previously_computed_fingerprints"}, {"score": 0.004115267130977749, "phrase": "different_audio_clips"}, {"score": 0.0036202043425301042, "phrase": "gaussian_mixture_models"}, {"score": 0.003264547032549398, "phrase": "shannon_entropy"}, {"score": 0.003237755895625552, "phrase": "renyi"}, {"score": 0.0030052732154202647, "phrase": "mel-frequency"}, {"score": 0.0029437270961011077, "phrase": "audio_clips"}, {"score": 0.0029194990004542307, "phrase": "gmm"}, {"score": 0.00276653157720066, "phrase": "large_number"}, {"score": 0.0024637379406427878, "phrase": "audio_fingerprints"}, {"score": 0.0021940118003312397, "phrase": "spectral_centroid"}], "paper_keywords": ["audio fingerprinting", " automatic song identification", " Gaussian mixture models"], "paper_abstract": "In audio fingerprinting, an audio clip must be recognized by matching an extracted fingerprint to a database of previously computed fingerprints. The fingerprints should reduce the dimensionality of the input significantly, provide discrimination among different audio clips, and, at the same time, be invariant to distorted versions of the same audio clip. In this paper, we design fingerprints addressing the above issues by modeling an audio clip by Gaussian mixture models (GMM). We evaluate the performance of many easy-to-compute short-time Fourier transform features, such as Shannon entropy, Renyi entropy, spectral centroid, spectral bandwidth, spectral flatness measure, spectral crest factor, and Mel-frequency cepstral coefficients in modeling audio clips using GMM for fingerprinting. We test the robustness of the fingerprints under a large number of distortions. To make the system robust, we use some of the distorted versions of the audio for training. However, we show that the audio fingerprints modeled using GMM are not only robust to the distortions used in training but also to distortions not used in training. Among the features tested, spectral centroid performs best with an identification rate of 99.2% at a false positive rate of 10(-4). All of the features give an identification rate of more than 90% at a false positive rate of 10(-3).", "paper_title": "Gaussian mixture modeling of short-time Fourier transform features for audio fingerprinting", "paper_id": "WOS:000246145600004"}