{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grammatical_evolution"}, {"score": 0.004494570360108983, "phrase": "good_control"}, {"score": 0.004332471656145115, "phrase": "severe_long-term_complications"}, {"score": 0.003757480190200645, "phrase": "main_problems"}, {"score": 0.0033190180867511605, "phrase": "food_intakes"}, {"score": 0.0030414140732789186, "phrase": "evolutionary_computation_techniques"}, {"score": 0.002999749669403939, "phrase": "customized_models"}, {"score": 0.00290473242917264, "phrase": "previous_approaches"}, {"score": 0.00286493504971388, "phrase": "averaged_models"}, {"score": 0.0027361626349903744, "phrase": "genetic_programming"}, {"score": 0.002518746501941657, "phrase": "silico_patient_data"}, {"score": 0.0023507916951658455, "phrase": "five_objective_functions"}, {"score": 0.0023079225317714815, "phrase": "test_phase"}, {"score": 0.002224510044064184, "phrase": "mean_percentage_average_error"}, {"score": 0.002163930783583212, "phrase": "also_both_hyper_and_hypoglycemic_situations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Diabetes mellitus is a disease that affects to hundreds of millions of people worldwide. Maintaining a good control of the disease is critical to avoid severe long-term complications. In recent years, several artificial pancreas systems have been proposed and developed, which are increasingly advanced. However there is still a lot of research to do. One of the main problems that arises in the (semi) automatic control of diabetes, is to get a model explaining how glycemia (glucose levels in blood) varies with insulin, food intakes and other factors, fitting the characteristics of each individual or patient. This paper proposes the application of evolutionary computation techniques to obtain customized models of patients, unlike most of previous approaches which obtain averaged models. The proposal is based on a kind of genetic programming based on grammars known as Grammatical Evolution (GE). The proposal has been tested with in silico patient data and results are clearly positive. We present also a study of four different grammars and five objective functions. In the test phase the models characterized the glucose with a mean percentage average error of 13.69%, modeling well also both hyper and hypoglycemic situations. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Modeling glycemia in humans by means of Grammatical Evolution", "paper_id": "WOS:000336410200005"}