{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "below-proficient_information_literacy_skills"}, {"score": 0.04398714383022717, "phrase": "information_literacy"}, {"score": 0.032336793142294054, "phrase": "post-intervention_interviews"}, {"score": 0.004592016716046632, "phrase": "first-year_community_college_students"}, {"score": 0.004120289747942224, "phrase": "discrete_skill"}, {"score": 0.00357362651129581, "phrase": "information-seeking_tasks"}, {"score": 0.0034780071331554003, "phrase": "experimental_design"}, {"score": 0.0033393377529146893, "phrase": "summative_evaluation"}, {"score": 0.0032279990773657215, "phrase": "pre-_and_post-intervention_test_scores"}, {"score": 0.0031845067058084583, "phrase": "pre-_and_post-intervention_tests"}, {"score": 0.0030992666061123533, "phrase": "post-intervention_surveys"}, {"score": 0.0028764048059439205, "phrase": "intervention_instructor"}, {"score": 0.0022992346264367374, "phrase": "greater_understanding"}], "paper_keywords": ["information literacy", " information literacy instruction", " information behaviour of college students"], "paper_abstract": "An intervention was developed for first-year community college students with below-proficient information literacy skills for the purpose of helping them gain an understanding of information literacy as a discrete skill set, develop a more accurate view of their own skill levels, and learn at least one skill they could apply in imposed and self-generated information-seeking tasks. Using an experimental design, the researchers conducted a summative evaluation of the intervention through pre- and post-intervention test scores, pre- and post-intervention tests, pre- and post-intervention surveys, post-intervention interviews with participants, and a debriefing with the intervention instructor. This paper focuses on the results of the post-intervention interviews. Those results suggest that students learned at least one skill from the intervention. The results are mixed as to whether they gained a greater understanding of information literacy as a skill set and whether they recalibrated their perceptions of their own information literacy skill levels.", "paper_title": "Enhancing Skills, Effecting Change: Evaluating an Intervention for Students with Below-Proficient Information Literacy Skills", "paper_id": "WOS:000298313200003"}