{"auto_keywords": [{"score": 0.03699372535833962, "phrase": "chemical_names"}, {"score": 0.00481495049065317, "phrase": "chemical-p-glycoprotein_interactions"}, {"score": 0.004378078970574258, "phrase": "drug_discovery"}, {"score": 0.003980687255880282, "phrase": "text-mining_system"}, {"score": 0.003910278811774747, "phrase": "automatic_extraction"}, {"score": 0.0035977623578676496, "phrase": "natural_language_processing"}, {"score": 0.0034101316738399203, "phrase": "sentence_context"}, {"score": 0.0031003255054939524, "phrase": "chemical-transporter_interactions"}, {"score": 0.0029737652463012318, "phrase": "key_verb_list"}, {"score": 0.0028185852354729026, "phrase": "known_drug_transporters"}, {"score": 0.002385595105638277, "phrase": "pubmed_abstracts"}, {"score": 0.0021049977753042253, "phrase": "chemical-p-gp_interactions"}], "paper_keywords": [""], "paper_abstract": "Knowledge of the interactions between drugs and transporters is important for drug discovery and development as well as for the evaluation of their clinical safety. We recently developed a text-mining system for the automatic extraction of information on chemical-CYP3A4 interactions from the literature. This system is based on natural language processing and can extract chemical names and their interaction patterns according to sentence context. The present study aimed to extend this system to the extraction of information regarding chemical-transporter interactions. For this purpose, the key verb list designed for cytochrome P450 enzymes was replaced with that for known drug transporters. The performance of the system was then tested by examining the accuracy of information on chemical-P-glycoprotein (P-gp) interactions extracted from randomly selected PubMed abstracts. The system achieved 89.8% recall and 84.2% precision for the identification of chemical names and 71.7% recall and 78.6% precision for the extraction of chemical-P-gp interactions.", "paper_title": "Automated Extraction of Information on Chemical-P-glycoprotein Interactions from the Literature", "paper_id": "WOS:000326480000003"}