{"auto_keywords": [{"score": 0.04957891638694611, "phrase": "single_crossbar_switch"}, {"score": 0.049248469394552366, "phrase": "fiber_delay_lines"}, {"score": 0.04778714188575569, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0034640450599342488, "phrase": "main_contribution"}, {"score": 0.0033919477901198716, "phrase": "formal_proof"}, {"score": 0.002767696345005216, "phrase": "simple_packet_routing_policy"}, {"score": 0.0026443135597866924, "phrase": "specific_decomposition"}, {"score": 0.0026166287606163145, "phrase": "packet_delay"}, {"score": 0.002363474907331799, "phrase": "buffer_size"}, {"score": 0.002266010412998422, "phrase": "sarwate"}, {"score": 0.0022501620437282714, "phrase": "anantharam"}, {"score": 0.0021049977753042253, "phrase": "priority_queues"}], "paper_keywords": ["exact emulation", " first-in-first-out (FIFO) queues", " optical multiplexers", " switched delay lines"], "paper_abstract": "In this paper, we prove a necessary and sufficient condition for the construction of 2-to-1 optical buffered first-in-first-out (FIFO) multiplexers by a single crossbar switch and fiber delay lines. We consider a feedback system consisting of an (M + 2) x (M + 2) crossbar switch and M fiber delay lines with delays d(1), d(2), ..., d(M). These M fiber delay lines are connected from M outputs of the crossbar switch back to M inputs of the switch, leaving two inputs (respectively, two outputs) of the switch for the two inputs (respectively, two outputs) of the 2-to-1 multiplexer. The main contribution of this paper is the formal proof that d(1) = 1 and d(i) <= d(i+1) < 2d(i), i = 1, 2.... M - 1, is a necessary and sufficient condition on the delays d(1), d(2), ..., d(M) for such a feedback system to be operated as a 2-to-1 FIFO multiplexer with buffer Sigma(M)(i=1) d(i) under a simple packet routing policy. Specifically, the routing of a packet is according to a specific decomposition of the packet delay, called the C-transform in this paper. Our result shows that under such a feedback architecture a 2-to-1 FIFO multiplexer can be constructed with ill = 0(log B), where B is the buffer size. Therefore, our construction improves on a more complicated construction recently proposed by Sarwate and Anantharam that requires M = O(root B) under the same feedback architecture (we note that their design is more general and works for priority queues).", "paper_title": "A necessary and sufficient condition for the construction of 2-to-1 optical FIFO multiplexers by a single crossbar switch and fiber delay lines", "paper_id": "WOS:000240776500013"}