{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mesh-based_peer-to-peer_streaming"}, {"score": 0.004611369021812453, "phrase": "mesh-based_peer-to-peer_streaming_systems_data"}, {"score": 0.004298666679374568, "phrase": "local_decisions"}, {"score": 0.00385832528624328, "phrase": "timely_data_delivery"}, {"score": 0.003695040819303525, "phrase": "analytic_framework"}, {"score": 0.0035771121569391916, "phrase": "scheduling_algorithms"}, {"score": 0.003352388337911934, "phrase": "forwarding_peer"}, {"score": 0.003210446135114967, "phrase": "playout_buffer_content"}, {"score": 0.0027741761880779535, "phrase": "playback_delay"}, {"score": 0.0025578967205807843, "phrase": "neighbors'_playout_buffer_contents"}, {"score": 0.0021627595586364724, "phrase": "node_arrivals"}, {"score": 0.0021049977753042253, "phrase": "overlay's_performance"}], "paper_keywords": ["Mesh-based streaming", " Delay performance"], "paper_abstract": "In mesh-based peer-to-peer streaming systems data is distributed among the peers according to local scheduling decisions. The local decisions affect how packets get distributed in the mesh, the probability of duplicates and consequently, the probability of timely data delivery. In this paper we propose an analytic framework that allows the evaluation of scheduling algorithms. We consider four solutions in which scheduling is performed at the forwarding peer, based on the knowledge of the playout buffer content at the neighbors. We evaluate the effectiveness of the solutions in terms of the probability that a peer can play out a packet versus the playback delay, the sensitivity of the solutions to the accuracy of the knowledge of the neighbors' playout buffer contents, and the scalability of the solutions with respect to the size of the overlay. We also show how the model can be used to evaluate the effects of node arrivals and departures on the overlay's performance.", "paper_title": "Delay and playout probability trade-off in mesh-based peer-to-peer streaming with delayed buffer map updates", "paper_id": "WOS:000284095100004"}