{"auto_keywords": [{"score": 0.025597409128017147, "phrase": "scotland"}, {"score": 0.018098729815844202, "phrase": "illinois"}, {"score": 0.00481495049065317, "phrase": "patient_care"}, {"score": 0.004784565134881178, "phrase": "pcast_disaggregation"}, {"score": 0.004296264970612285, "phrase": "particular_interest"}, {"score": 0.004242183179689357, "phrase": "particular_attention"}, {"score": 0.003906804492585634, "phrase": "patient_record"}, {"score": 0.0035978443860856216, "phrase": "q-uel_tags"}, {"score": 0.0034526191487098093, "phrase": "random_mix"}, {"score": 0.0033768559933238665, "phrase": "computationally_demanding_complexity"}, {"score": 0.0032922964156452696, "phrase": "data_tag"}, {"score": 0.0032302647179383915, "phrase": "valuable_but_rate"}, {"score": 0.0032098474677896274, "phrase": "isomorphism_test"}, {"score": 0.0031693980719538317, "phrase": "essential_clinical_data"}, {"score": 0.0029185830864495313, "phrase": "standard_laptop"}, {"score": 0.002881793492919646, "phrase": "practical_use"}, {"score": 0.0028274743316389437, "phrase": "downloaded_data"}, {"score": 0.0027218799769229596, "phrase": "increasing_club_size"}, {"score": 0.0026036473098881344, "phrase": "entire_nation"}, {"score": 0.002538400273615248, "phrase": "purely_random_assignments"}, {"score": 0.0025063909490744855, "phrase": "arbitrary_clubs"}, {"score": 0.0023522840272302507, "phrase": "military_veterans"}, {"score": 0.0022146486355422244, "phrase": "mere_million_patients"}, {"score": 0.0021049977753042253, "phrase": "whole_country"}], "paper_keywords": ["Universal exchange language", " PCAST report", " Continuity of care", " Interoperability", " Electronic health record", " Disaggregation"], "paper_abstract": "We describe here the applications of our recently proposed Q-UEL language to continuity of patient care between physicians, specialists and institutions as mediated via the Internet, giving examples derived from HL7 CDA and VistA of particular interest to workflow. Particular attention is given to the Universal Exchange Language for healthcare as requested by the US President's Council of Advisors on Science and Technology (PCAST) released in December 2010, especially in regard to disaggregation of the patient record on the Internet. To illustrate many features and options, one of our most elaborate configurations combining them, for disaggregation and reaggregation, is described. The Q-UEL tags used do not physically join, but query each other from a random mix via the application. Despite the computationally demanding complexity of the configuration with two joining tags for each data tag and four independently evolving keys, plus a valuable but rate limiting isomorphism test, packets of essential clinical data for patient could be recovered and displayed every 2s for a \"club\" of 30,000-50,000 patients in the mix. All computation here is on a standard laptop, but for practical use of the Internet to display downloaded data, the above is adequate, so focus is primarily on increasing club size. In practice, it is not necessary that a club comprise an entire nation. Assuming that one does not use purely random assignments of patients to arbitrary clubs, there could for example be a club comprising all schoolchildren in Scotland, or a club comprising all military veterans in Illinois. In such cases, one is typically dealing with clubs each of the order of a mere million patients. Using such club sizes efficiently, and in principle even a club the size of a whole country, appears to be possible. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Suggestions for a web based universal exchange and inference language for medicine. Continuity of patient care with PCAST disaggregation", "paper_id": "WOS:000348265400006"}