{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "human_environments"}, {"score": 0.004273723657275637, "phrase": "appropriate_path"}, {"score": 0.004238307626560739, "phrase": "daunting_yet_vital_challenge"}, {"score": 0.0039433581938239926, "phrase": "present_article"}, {"score": 0.0038354405231002323, "phrase": "intertwined_issues"}, {"score": 0.0037931018103829427, "phrase": "contemporary_world"}, {"score": 0.0035684266744407485, "phrase": "environmental_design"}, {"score": 0.002833891290347501, "phrase": "appropriate_solutions"}, {"score": 0.002763919794139171, "phrase": "concerted_efforts"}, {"score": 0.002718231974492536, "phrase": "collective_wisdom"}, {"score": 0.002695671290889612, "phrase": "wide_array"}, {"score": 0.0026364182801578043, "phrase": "decision_makers"}, {"score": 0.0021049977753042253, "phrase": "greater_aspirations"}], "paper_keywords": ["integration", " holism", " systems", " beliefs", " culture", " architecture", " values", " environmental design"], "paper_abstract": "Complexity, complication, contradiction, consumption, confusion, delusion, depression. Opportunity, inspiration, ingenuity, compassion, wisdom. Our world is perplexing, our times are fast moving, and our choices are many. To find an appropriate path is a daunting yet vital challenge that confronts us as individuals, as communities, and as a civilization. How sustainable is our world? How reasonable are our behaviors? The present article is a collection of thoughts on a series of intertwined issues related to the contemporary world, its environmental dimensions, and their present-day problems. The goal is to survey the landscape through a lens of Environmental Design, to provide some perspectives, to raise some questions, and to explore systems, beliefs, and values informing and influencing actions. It is important to consider how people's belief systems influence, inform, and shape actions. This holds true in realms political, spiritual, and cultural. It also proves relevant in the ways in which we imagine, design, develop, and construct our buildings, cities, spaces, and places. Appropriate solutions to some of our most daunting problems will arise through the concerted efforts, open dialogue, and collective wisdom of the wide array of stakeholders, professionals, politicians, decision makers, and citizens (both engaged and disenfranchised) who have the will and wherewithal to make a difference and to make the world safer, healthier, and better. It seems vital for us to critically examine, and question, our belief systems and their connections to the ways we define, refine, and realize progress. Architecture and Environmental Design, in both a philosophical and a practical sense, reflect as well as form greater aspirations, directions, and events of our times.", "paper_title": "Integration | Innovation | Inclusion: Values, Variables and the Design of Human Environments", "paper_id": "WOS:000357406400011"}