{"auto_keywords": [{"score": 0.04435952228911224, "phrase": "congestion_cost"}, {"score": 0.03473720012957105, "phrase": "social_optimum"}, {"score": 0.00481495049065317, "phrase": "sharable_items"}, {"score": 0.00474614491353724, "phrase": "particular_multiagent_resource_allocation_problem"}, {"score": 0.003992999293962473, "phrase": "valuation_function"}, {"score": 0.00392456965725842, "phrase": "delay_function"}, {"score": 0.0036412884223690576, "phrase": "current_users"}, {"score": 0.00353784217050407, "phrase": "new_agent"}, {"score": 0.003407728065269377, "phrase": "shared_control"}, {"score": 0.0033396533935201316, "phrase": "distributed_negotiation_protocols"}, {"score": 0.003226092536458594, "phrase": "valuation_functions"}, {"score": 0.003152531962718477, "phrase": "delay_functions"}, {"score": 0.0030629282276491403, "phrase": "structural_complexity"}, {"score": 0.00243877141503813, "phrase": "pure_nash_equilibria"}, {"score": 0.0023969131085585602, "phrase": "single_agent"}, {"score": 0.002255973756526505, "phrase": "modular_valuation_functions"}, {"score": 0.0021791815390109744, "phrase": "pure_nash_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "congestion_games"}], "paper_keywords": ["Multiagent resource allocation", " Congestion games"], "paper_abstract": "We study a particular multiagent resource allocation problem with indivisible, but sharable resources. In our model, the utility of an agent for using a bundle of resources is the difference between the value the agent would assign to that bundle in isolation and a congestion cost that depends on the number of agents she has to share each of the resources in her bundle with. The valuation function determining the value and the delay function determining the congestion cost can be agent-dependent. When the agents that share a resource also share control over that resource, then the current users of a resource will require some compensation when a new agent wants to join them using the resource. For this scenario of shared control, we study the existence of distributed negotiation protocols that lead to a social optimum. Depending on constraints on the valuation functions (mainly modularity), on the delay functions (such as convexity), and on the structural complexity of the deals between agents, we prove either the existence of a sequences of deals leading to a social optimum or the convergence of all sequences of deals to such an optimum. We also analyse the length of the path leading to such optimal allocations. For scenarios where the agents using a resource do not have shared control over that resource (i.e., where any agent can use any resource she wants), we study the existence of pure Nash equilibria, i.e., allocations in which no single agent has an incentive to add or drop any of the resources she is currently holding. We provide results for modular valuation functions, we analyse the length of the paths leading to a pure Nash equilibrium, and we relate our findings to results from the literature on congestion games.", "paper_title": "Multiagent resource allocation with sharable items", "paper_id": "WOS:000340534500004"}