{"auto_keywords": [{"score": 0.048733675491387074, "phrase": "requirements_specification"}, {"score": 0.04403460337789445, "phrase": "quality_requirements"}, {"score": 0.02753536152313771, "phrase": "tcm"}, {"score": 0.00481495049065317, "phrase": "spectrum_analysis_for_software_quality_requirements"}, {"score": 0.004775918707955445, "phrase": "tcm._quality_requirements"}, {"score": 0.004384623928442369, "phrase": "stakeholders'_needs"}, {"score": 0.003771282384646587, "phrase": "quality_spectrum"}, {"score": 0.003680212979775528, "phrase": "quantitative_feature"}, {"score": 0.0031139032290048788, "phrase": "common_quality_features"}, {"score": 0.0030262967460085366, "phrase": "existing_similar_systems"}, {"score": 0.0028351712509358997, "phrase": "problem_domain"}, {"score": 0.00266693888510356, "phrase": "domain_knowledge"}, {"score": 0.002321563536990284, "phrase": "similar_systems"}, {"score": 0.0022378620428620782, "phrase": "spectrum_analysis"}, {"score": 0.0021748483128942687, "phrase": "different_analysts"}, {"score": 0.002148387364260776, "phrase": "almost_the_stifle_spectra"}], "paper_keywords": ["requirements analysis", " quality requirements", " non-functional requirements"], "paper_abstract": "Quality requirements are scattered over a requirements specification. thus it Is hard to measure and trace such quality requirements to validate the specification against stakeholders' needs We proposed a technique called \"spectrum analysis for quality requirements\" which enabled analysts to sort a requirements specification to measure and track quality requirements in the specification In the same way as a spectrum in optics, a quality spectrum of a specification shows a quantitative feature of the specification with respect to quality Therefore. we can compare a specification of a system to another one with respect to quality As a result, we can validate such a specification because we can check whether the specification has common quality features and know its specific features against specifications of existing similar systems However. our first spectrum analysis for quality requirements required a lot of effort and knowledge of a problem domain and it was hard to reuse such knowledge to reduce the effort We thus introduce domain knowledge called term-characteristic map (TCM) to reuse the knowledge for our quality spectrum analysis Through several experiments, we evaluate our spectrum analysis. and main finding are as follows First we confirmed specifications of similar systems have similar quality spectra Second. results of spectrum analysis using TCM are objective. i.e. different analysts can generate almost the stifle spectra when they analyze the same specification.", "paper_title": "Improving Reliability of Spectrum Analysis for Software Quality Requirements Using TCM", "paper_id": "WOS:000276848600004"}