{"auto_keywords": [{"score": 0.04913548507380238, "phrase": "collaboration_distance"}, {"score": 0.04424296209239414, "phrase": "evaluated_objects"}, {"score": 0.042786126849983945, "phrase": "quality_function"}, {"score": 0.012345594943954468, "phrase": "sentencing_line"}, {"score": 0.01033263174249267, "phrase": "new_index"}, {"score": 0.00481495049065317, "phrase": "bibliometric_index"}, {"score": 0.0045357787854931894, "phrase": "popular_h-index"}, {"score": 0.004446349752828045, "phrase": "scientific_output"}, {"score": 0.0035183010916001664, "phrase": "index_value"}, {"score": 0.0025317627242523104, "phrase": "citing_papers"}, {"score": 0.0021474369836979048, "phrase": "new_c-index"}, {"score": 0.0021049977753042253, "phrase": "previous_proposals"}], "paper_keywords": ["Bibliometric indices", " h-Index", " c-Index"], "paper_abstract": "The popular h-index used to measure scientific output can be described in terms of a pool of evaluated objects (the papers), a quality function on the evaluated objects (the number of citations received by each paper) and a sentencing line crossing the origin, whose intersection with the graph of the quality function yields the index value (in the h-index this is a line with slope 1). Based on this abstraction, we present a new index, the c-index, in which the evaluated objects are the citations received by an author, a group of authors, a journal, etc., the quality function of a citation is the collaboration distance between the authors of the cited and the citing papers, and the sentencing line can take slopes between 0 and infinity. As a result, the new index counts only those citations which are significant enough, where significance is proportional to collaboration distance. Several advantages of the new c-index with respect to previous proposals are discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A bibliometric index based on the collaboration distance between cited and citing authors", "paper_id": "WOS:000288154700002"}