{"auto_keywords": [{"score": 0.04714129033641774, "phrase": "european"}, {"score": 0.046571234643024366, "phrase": "opterational_research"}, {"score": 0.033362816336643786, "phrase": "human_learning"}, {"score": 0.00481495049065317, "phrase": "learning_considerations"}, {"score": 0.004171891198117439, "phrase": "scheduling_field"}, {"score": 0.0038668462001710314, "phrase": "learning_effect"}, {"score": 0.0034359094594153304, "phrase": "position-based_learning"}, {"score": 0.0033641551050434663, "phrase": "realistic_model"}, {"score": 0.003335873298309004, "phrase": "machine_learning"}, {"score": 0.0032250961348210473, "phrase": "processing-time-based_learning"}, {"score": 0.003104849179057156, "phrase": "realistic_situations"}, {"score": 0.0029266219967426224, "phrase": "neural_networks"}, {"score": 0.002853396755102163, "phrase": "motor_vehicles"}, {"score": 0.0024926348205500715, "phrase": "control_center"}, {"score": 0.0023996317685956213, "phrase": "working_experience"}, {"score": 0.0023100907305651872, "phrase": "new_learning_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Scheduling", " Learning effect", " Single-machine", " Flowshop"], "paper_abstract": "Scheduling with learning effect has drawn many researchers' attention since Biskup [D. Biskup, Single-machine scheduling with learning considerations, European journal of Opterational Research 115 (1999) 173-178] introduced the concept of learning into the scheduling field. Biskup [D. Biskup, A state-of-the-art review on scheduling with learning effect, European journal of Opterational Research 188 (2008) 315-329] classified the learning approaches in the literature into two main streams. He claimed that the position-based learning seems to be a realistic model for machine learning, while the sum-of-processing-time-based learning is a model for human learning. In some realistic situations, both the machine and human learning might exist simultaneously. For example, robots with neural networks are used in computers, motor vehicles, and many assembly lines. The actions of a robot are constantly modified through self-learning in processing the jobs. On the other hand, the operators in the control center learn how to give the commands efficiently through working experience. In this paper, we propose a new learning model that unifies the two main approaches. We show that some single-machine problems and some specified flowshop problems are polynomially solvable. (c) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Some single-machine and m-machine flowshop scheduling problems with learning considerations", "paper_id": "WOS:000270620400005"}