{"auto_keywords": [{"score": 0.0500675595386264, "phrase": "groundwater_levels"}, {"score": 0.03583574966327729, "phrase": "wavelet"}, {"score": 0.0047113960612140335, "phrase": "non-stationary_and_nonlinear_characteristics"}, {"score": 0.004486432283770142, "phrase": "non-stationary_and_nonlinear_features"}, {"score": 0.004135010810625326, "phrase": "underlying_features"}, {"score": 0.003728966994353039, "phrase": "hydrologic_and_environmental_time_series_forecasting"}, {"score": 0.003201890266327127, "phrase": "reliable_long_term_forecasts"}, {"score": 0.0030822642403450207, "phrase": "canada"}, {"score": 0.003032228032253871, "phrase": "model_results"}, {"score": 0.002887210021573995, "phrase": "wavelet_neural_network"}, {"score": 0.0026752939536349453, "phrase": "artificial"}, {"score": 0.002386062690026682, "phrase": "wavelet_volterra_coupled_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Long term forecasting", " Groundwater level forecasting", " Wavelets"], "paper_abstract": "Groundwater systems are in general characterised by non-stationary and nonlinear features. Modelling of these systems and forecasting their future states requires identification and capture of these underlying features that seem to drive these processes. Recently, wavelets have been used extensively in the area of hydrologic and environmental time series forecasting owing to its ability to unravel these aforementioned component features. In this paper, dynamic wavelet based nonlinear model (Wavelet Volterra coupled model) is tested for its ability to yield reliable long term forecasts of groundwater levels at two sites in Canada. The model results are compared with the results from other recent techniques like wavelet neural network (WA-ANN), Wavelet linear regression (WLR), Artificial neural network and dynamic auto regressive (DAR) Models. The results of the study show the potential of wavelet Volterra coupled models in forecasting groundwater levels in addition to being more versatile and simpler to use when compared with other competing models. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Long term forecasting of groundwater levels with evidence of non-stationary and nonlinear characteristics", "paper_id": "WOS:000315558400044"}