{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evaluation_data"}, {"score": 0.04954756810706401, "phrase": "prototype_system"}, {"score": 0.0442858455982924, "phrase": "information_credibility"}, {"score": 0.014153303591062451, "phrase": "wisdom"}, {"score": 0.004682414867878963, "phrase": "information_credibility_analysis"}, {"score": 0.004630423009638876, "phrase": "purpose_-_the_purpose"}, {"score": 0.0041642891310893, "phrase": "natural_langdage_processing"}, {"score": 0.0032747835779400212, "phrase": "social_valuation"}, {"score": 0.0030794433253250476, "phrase": "natural_language_processing"}, {"score": 0.0030282147475402736, "phrase": "predicate_argument_structure"}, {"score": 0.0026478260192958924, "phrase": "manually-annotated_data"}, {"score": 0.0024620842899061614, "phrase": "medical_issues"}, {"score": 0.0023151088048303705, "phrase": "different_perspectives"}, {"score": 0.002189105604712615, "phrase": "credible_information"}, {"score": 0.0021049977753042253, "phrase": "different_evaluation_criteria"}], "paper_keywords": ["computer networks", " data analysis", " prototypes", " computer software"], "paper_abstract": "Purpose - The purpose of this paper is to describe evaluation data and a prototype system named WISDOM used for analyzing information credibility based on natural langdage processing. Design/methodology/approach - The authors started the Information Credibility Criteria project in April, 2007, mainly to analyze the credibility of information (text) on the web. The project proposes to capture information credibility based on four criteria (content, sender, appearance, and social valuation) and aims to analyze and organize them logically using natural language processing based on predicate argument structure. Findings - The evaluation data described in this paper were developed as learning and verifying data for these various analysis modules and are composed of manually-annotated data based on each evaluation criteria about several pre-selected topics such as current events and medical issues. The prototype system WISDOM was developed to provide information credibility from different perspectives. Orginality/value - Users will be able to find credible information more reliably by browsing information using different evaluation criteria and conditions provided by the system.", "paper_title": "Evaluation data and prototype system WISDOM for information credibility analysis", "paper_id": "WOS:000255182800003"}