{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "gender_differences"}, {"score": 0.004253618550301311, "phrase": "scientific_productivity"}, {"score": 0.004007083686875716, "phrase": "industrial_and_organizational_psychologists"}, {"score": 0.0034751259234824913, "phrase": "female_and_male_i-o_psychologists"}, {"score": 0.0032886455096627324, "phrase": "female_researchers"}, {"score": 0.0030135741897058844, "phrase": "male_researchers'_periods"}, {"score": 0.00290473242917264, "phrase": "longer_interruptions"}, {"score": 0.0026494723416072316, "phrase": "future_developments"}, {"score": 0.0025537472239953807, "phrase": "student_subsample"}, {"score": 0.002518746501941657, "phrase": "nearly_no_gender_differences"}, {"score": 0.0023507916951658455, "phrase": "status_quo"}, {"score": 0.002297327670408112, "phrase": "entire_psychological_sub-discipline"}, {"score": 0.0021049977753042253, "phrase": "external_constraints"}], "paper_keywords": ["Gender differences", " Research productivity", " Scientific productivity", " Impact", " Psychology"], "paper_abstract": "Questions about gender differences in the workplace usually attract much attention-but often generate more heat than light. To examine gender differences in several facets of scientific productivity and impact, a quantitative, scientometric approach is employed. Analyzing a sample of industrial and organizational psychologists (N (authors) = 4234; N (publications) = 46,656), this study raises both questions and concerns about gender differences in research, by showing that female and male I-O psychologists differ with regard to publication output (fewer publications authored by female researchers), impact (heterogeneous, indicator-dependent gender differences), their publication career courses (male researchers' periods of active publishing last longer and show longer interruptions), and research interests (only marginal gender differences). In order to get a glimpse of future developments, we repeated all analyses with the student subsample and found nearly no gender differences, suggesting a more gender-balanced future. Thus, this study gives an overview over the status quo of gender differences in an entire psychological sub-discipline. Future research will have to examine whether these gender differences are volitional in nature or the manifestation of external constraints.", "paper_title": "Are there gender differences among researchers from industrial/organizational psychology?", "paper_id": "WOS:000365130100030"}