{"auto_keywords": [{"score": 0.0482650857509263, "phrase": "keyword_extraction"}, {"score": 0.004814963541530272, "phrase": "keyword"}, {"score": 0.004759507166427077, "phrase": "support_vector_machine"}, {"score": 0.004473120230808053, "phrase": "experimental_results"}, {"score": 0.0041566143568825585, "phrase": "document_classification"}, {"score": 0.004046843083499649, "phrase": "large_number"}, {"score": 0.003534889186471058, "phrase": "'global_context_information"}, {"score": 0.003374655868348244, "phrase": "thorough_and_systematic_investigation"}, {"score": 0.002846647336160784, "phrase": "'local_context_information"}, {"score": 0.0026347074232350503, "phrase": "support_vector_machines"}, {"score": 0.002429090371567499, "phrase": "proposed_svm_based_method"}, {"score": 0.002382541887825168, "phrase": "baseline_methods"}, {"score": 0.0023368833197343953, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "keyword_extraction_method"}], "paper_keywords": [""], "paper_abstract": "This paper is concerned with keyword extraction. By keyword extraction, we mean extracting a subset of words/phrases from a document that can describe the 'meaning' of the document. Keywords are of benefit to many text mining applications. However, a large number of documents do not have keywords and thus it is necessary to assign keywords before enjoying the benefit from it. Several research efforts have been done on keyword extraction. These methods make use of the 'global context information', which makes the performance of extraction restricted. A thorough and systematic investigation on the issue is thus needed. In this paper, we propose to make use of not only 'global context information', but also 'local context information' for extracting keywords from documents. As far as we know, utilizing both 'global context information' and 'local context information' in keyword extraction has not been sufficiently investigated previously. Methods for performing the tasks on the basis of Support Vector Machines have also been proposed in this paper. Features in the model have been defined. Experimental results indicate that the proposed SVM based method can significantly outperform the baseline methods for keyword extraction. ne proposed method has been applied to document classification, a typical text mining processing. Experimental results show that the accuracy of document classification can be significantly improved by using the keyword extraction method.", "paper_title": "Keyword extraction using support vector machine", "paper_id": "WOS:000239658700008"}