{"auto_keywords": [{"score": 0.049040461120392176, "phrase": "italian_industry"}, {"score": 0.015719716506582538, "phrase": "software_modelling_and_model_driven_techniques"}, {"score": 0.012604002189586024, "phrase": "md_techniques"}, {"score": 0.004642105253191792, "phrase": "claimed_benefits"}, {"score": 0.004175006647851034, "phrase": "usage_complications"}, {"score": 0.004099340908974491, "phrase": "main_goals"}, {"score": 0.0038804410204616954, "phrase": "software_modelling"}, {"score": 0.0034642599795044445, "phrase": "exploratory_personal_opinion_survey"}, {"score": 0.0033397385936467204, "phrase": "web-based_questionnaire"}, {"score": 0.0032079118323314424, "phrase": "software_modelling_and_md_techniques"}, {"score": 0.003081272473508291, "phrase": "simple_modelling"}, {"score": 0.0030587884803931964, "phrase": "common_benefits"}, {"score": 0.002959617637433, "phrase": "better_maintenance"}, {"score": 0.002927278301452369, "phrase": "higher_software_quality"}, {"score": 0.0028014064098604093, "phrase": "higher_productivity"}, {"score": 0.002770791022032813, "phrase": "platform_independence"}, {"score": 0.0027006464509273806, "phrase": "hindering_adoption"}, {"score": 0.002437339565360659, "phrase": "important_objective_motivation"}, {"score": 0.0023324855762635616, "phrase": "attainable_benefits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Model driven techniques", " Software modelling", " Personal opinion survey"], "paper_abstract": "Context: Claimed benefits of software modelling and model driven techniques are improvements in productivity, portability, maintainability and interoperability. However, little effort has been devoted at collecting evidence to evaluate their actual relevance, benefits and usage complications. Goal: The main goals of this paper are: (1) assess the diffusion and relevance of software modelling and MD techniques in the Italian industry, (2) understand the expected and achieved benefits, and (3) identify which problems limit/prevent their diffusion. Method: We conducted an exploratory personal opinion survey with a sample of 155 Italian software professionals by means of a Web-based questionnaire on-line from February to April 2011. Results: Software modelling and MD techniques are very relevant in the Italian industry. The adoption of simple modelling brings common benefits (better design support, documentation improvement, better maintenance, and higher software quality), while MD techniques make it easier to achieve: improved standardization, higher productivity, and platform independence. We identified problems, some hindering adoption (too much effort required and limited usefulness) others preventing it (lack of competencies and supporting tools). Conclusions: The relevance represents an important objective motivation for researchers in this area. The relationship between techniques and attainable benefits represents an instrument for practitioners planning the adoption of such techniques. In addition the findings may provide hints for companies and universities. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Relevance, benefits, and problems of software modelling and model driven techniques-A survey in the Italian industry", "paper_id": "WOS:000322351100010"}