{"auto_keywords": [{"score": 0.04934553301452924, "phrase": "multi-spectral_images"}, {"score": 0.015719716506582538, "phrase": "dimension_reduction_methods"}, {"score": 0.004439941010250576, "phrase": "novel_machine_vision_application"}, {"score": 0.004046843083499649, "phrase": "moisture_content"}, {"score": 0.0037749456215035856, "phrase": "continuous_in-line_approach"}, {"score": 0.0036884198249734863, "phrase": "digital_image_analysis"}, {"score": 0.0035761182400032487, "phrase": "nine_spectral_bands"}, {"score": 0.0033616344666486725, "phrase": "five_different_sand_types"}, {"score": 0.0030401074516310184, "phrase": "summary_statistics"}, {"score": 0.0030166837276747816, "phrase": "single_bands"}, {"score": 0.00292477450010107, "phrase": "morphological_summaries"}, {"score": 0.00268616928039386, "phrase": "dimension_reductive_methods"}, {"score": 0.00257424957319189, "phrase": "important_consideration"}, {"score": 0.002486147565139633, "phrase": "small_number"}, {"score": 0.0022308329460335985, "phrase": "ordinary_least_squares"}], "paper_keywords": ["Concrete", " Dimension reduction", " Forward selection", " Genetic algorithms", " Least angle regression-elastic net", " Moisture estimation", " Multi-spectral images", " Partial least squares", " Principal component analysis", " Sand"], "paper_abstract": "This paper presents a comparison of dimension reduction methods based on a novel machine vision application for estimating moisture content in sand used to make concrete. For the application in question it is very important to know the moisture content of the sand so as to ensure good-quality concrete. In order to achieve a continuous in-line approach for the concrete mixing, digital image analysis is used. Multi-spectral images, consisting of nine spectral bands in the visible and near infrared (NIR) range, were acquired. Each image consists of approximately 9 million pixels. Five different sand types were examined with 20-60 images for each type. To reduce the amount of data, features were extracted from the multi-spectral images; the features were summary statistics on single bands and pairs of bands as well as morphological summaries. The number of features (2,016) is high in relation to the number of observations and, therefore, dimension reductive methods are needed. Furthermore, speed, which is an important consideration, is aided by the use of a small number of variables. On top of that, fewer dimensions tend to give more robust results. Two traditional statistical methods for dimension reduction (forward selection and principal components) combined with ordinary least squares and one sophisticated chemometrics algorithm (genetic algorithm-partial least squares) are compared to the recently proposed least angle regression-elastic net (LARS-EN) model selection method.", "paper_title": "A comparison of dimension reduction methods with application to multi-spectral images of sand used in concrete", "paper_id": "WOS:000282095900012"}