{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stereoscopic_hdr"}, {"score": 0.026615237375021732, "phrase": "stereo_correspondence_methods"}, {"score": 0.02369153537645144, "phrase": "ground_truth"}, {"score": 0.004737579882204798, "phrase": "hdr-ldr_image_pairs"}, {"score": 0.004611369021812453, "phrase": "novel_imaging_technologies"}, {"score": 0.004116823963855969, "phrase": "large_body"}, {"score": 0.003921393143378986, "phrase": "imaging_technologies"}, {"score": 0.0035965032173588753, "phrase": "current_limitations"}, {"score": 0.0030911702059432224, "phrase": "hdr_and_ldr_pair"}, {"score": 0.0029126002350975634, "phrase": "detailed_user_study"}, {"score": 0.0028195727965553367, "phrase": "shdr_content"}, {"score": 0.0025717770066591076, "phrase": "ldr_image"}, {"score": 0.002198173002125907, "phrase": "image_pair"}], "paper_keywords": ["Design", " Experimentation", " Performance", " Stereoscopy", " high dynamic range imaging", " stereo correspondence", " expansion operators"], "paper_abstract": "A number of novel imaging technologies have been gaining popularity over the past few years. Foremost among these are stereoscopy and high dynamic range (HDR) Imaging. While a large body of research has looked into each of these imaging technologies independently, very little work has attempted to combine them. This is mostly due to the current limitations in capture and display. In this article, we mitigate problems of capturing Stereoscopic HDR (SHDR) that would potentially require two HDR cameras, by capturing an HDR and LDR pair and using it to generate 3D stereoscopic HDR content. We ran a detailed user study to compare four different methods of generating SHDR content. The methods investigated were the following: two based on expanding the luminance of the LDR image, and two utilizing stereo correspondence methods, which were adapted for our purposes. Results demonstrate that one of the stereo correspondence methods may be considered perceptually indistinguishable from the ground truth (image pair captured using two HDR cameras), while the other methods are all significantly distinct from the ground truth.", "paper_title": "Generating Stereoscopic HDR Images Using HDR-LDR Image Pairs", "paper_id": "WOS:000340892200003"}