{"auto_keywords": [{"score": 0.04441673216143538, "phrase": "original_secret_image"}, {"score": 0.013445697030139604, "phrase": "share_image"}, {"score": 0.009558975559061671, "phrase": "reconstructed_image"}, {"score": 0.009254797253865655, "phrase": "traditional_vss_scheme"}, {"score": 0.00481495049065317, "phrase": "shift_tolerant_visual_secret_sharing_schemes"}, {"score": 0.0044289730051264116, "phrase": "visual_quality"}, {"score": 0.004367707617503722, "phrase": "reconstructed_secret_image"}, {"score": 0.00321425262806329, "phrase": "relative_shift"}, {"score": 0.003125835572347772, "phrase": "horizontal_direction"}, {"score": 0.003096905353118796, "phrase": "vertical_direction"}, {"score": 0.0027062100658653485, "phrase": "average_contrast"}, {"score": 0.0022995854132747233, "phrase": "larger_pixel_expansion"}, {"score": 0.002267708463966758, "phrase": "basic_building_block"}, {"score": 0.002134592410214824, "phrase": "basic_matrices"}, {"score": 0.0021049977753042253, "phrase": "seemingly_simple_but_very_powerful_construction_principle"}], "paper_keywords": ["Pixel expansion", " share alignment and registration", " visual secret sharing (VSS)"], "paper_abstract": "In a (k, n) visual secret sharing (VSS) scheme, the alignment of the transparencies is important to the visual quality of the reconstructed secret image. Each pixel of the original secret image is expanded to m subpixels in a share image. If a share image is printed on a paper with the same size as the original secret image, the alignment or the registration of the subpixels, which is only m times smaller than that of the original secret image, could be troublesome. In this paper, we propose a (2, n)-VSS scheme that allows a relative shift between the shares in the horizontal direction and vertical direction. When the shares are perfectly aligned, the contrast of the reconstructed image is equal to that of the traditional VSS scheme. When there is a shift, the average contrast of the reconstructed image is higher than that of the traditional VSS scheme, and the scheme can still work in cases where very little shape redundancy is present in the image. The trade-off is that our method involves a larger pixel expansion. The basic building block of our scheme is duplication and concatenation of certain rows or columns of the basic matrices. This seemingly simple but very powerful construction principle can be easily used to create more general (k, n) schemes.", "paper_title": "Towards Shift Tolerant Visual Secret Sharing Schemes", "paper_id": "WOS:000290737100007"}