{"auto_keywords": [{"score": 0.040567250179834126, "phrase": "proposed_scheme"}, {"score": 0.00481495049065317, "phrase": "restricted_private_memories"}, {"score": 0.004677847043645765, "phrase": "fault_diagnosis"}, {"score": 0.0046240999614456605, "phrase": "reconfiguration_method"}, {"score": 0.004518442937844318, "phrase": "pair_and_swap_scheme"}, {"score": 0.004143196873246147, "phrase": "network-on-chip_based_multiple_processor_systems"}, {"score": 0.0036063061558261546, "phrase": "processor_cores"}, {"score": 0.0033839745649214548, "phrase": "processor_faults"}, {"score": 0.00282822695516646, "phrase": "redundant_processor_cores"}, {"score": 0.002623184850933423, "phrase": "private_memories"}, {"score": 0.002418923027024191, "phrase": "proposed_quadruplicated_task_allocation_scheme"}, {"score": 0.0021049977753042253, "phrase": "duplicated_task_allocation_scheme"}], "paper_keywords": ["mean time to failure", " network-on-chip", " multiple processor system", " fault diagnosis", " pair and swap"], "paper_abstract": "We propose a fault diagnosis and reconfiguration method based on the Pair and Swap scheme to improve the reliability and the MTTF (Mean Time To Failure) of network-on-chip based multiple processor systems where each processor core has its private memory. In the proposed scheme, two identical copies of a given task are executed on a pair of processor cores and the results are compared repeatedly in order to detect processor faults. If a fault is detected by mismatches, the fault is identified and isolated using a TMR (Triple Module Redundancy) and the system is reconfigured by the redundant processor cores. We propose that each task is quadruplicated and statically assigned to private memories so that each memory has only two different tasks. We evaluate the reliability of the proposed quadruplicated task allocation scheme in the viewpoint of MTTF. As a result, the MTTF of the proposed scheme is over 4.3 times longer than that of the duplicated task allocation scheme.", "paper_title": "Fault Diagnosis and Reconfiguration Method for Network-on-Chip Based Multiple Processor Systems with Restricted Private Memories", "paper_id": "WOS:000326409300003"}