{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_flow"}, {"score": 0.014354522408900176, "phrase": "km_maturity"}, {"score": 0.007581309024841036, "phrase": "km_initiatives"}, {"score": 0.004776669953449352, "phrase": "different_knowledge_management_maturity_stages"}, {"score": 0.003975200317233532, "phrase": "comprehensive_research"}, {"score": 0.003294566092612857, "phrase": "cultural_historical_activity_theory"}, {"score": 0.0031654684543975077, "phrase": "existing_models"}, {"score": 0.002957471572421436, "phrase": "current_literature"}, {"score": 0.002818909613625567, "phrase": "constant_observation"}, {"score": 0.002730150696072947, "phrase": "qualitative_interviews"}, {"score": 0.002686821995335494, "phrase": "seven_firms"}, {"score": 0.002560907803820395, "phrase": "wide_range"}, {"score": 0.0025405019456703325, "phrase": "km_maturity_levels"}, {"score": 0.00240213106042981, "phrase": "major_findings"}, {"score": 0.0022895278869126848, "phrase": "different_km_maturity_levels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge management (KM)", " Knowledge flow", " Knowledge management maturity model (KMMM)", " Knowledge Navigator Model (KNM)", " Cultural historical activity theory (CHAT)"], "paper_abstract": "A significant amount of work has been done to better understand the barriers to knowledge flow and develop models of KM maturity; this was intended to help in assessing the progress of KM initiatives in the firm. However, to date there has been no comprehensive research that considers both these issues at the same time, and thus it is still necessary to explore the evolution of barriers to knowledge flow when the level of KM maturity is changing. We reviewed the progress of KM initiatives in recent years, categorized the barriers to knowledge flow according to the cultural historical activity theory (CHAT), and used one of the existing models of KM maturity (the Knowledge Navigator Model-KNM), to address gaps in the current literature. As part of our exploratory study, a longitudinal survey, involving constant observation, development and use of questionnaires and qualitative interviews with managers of seven firms were conducted. We selected the firms so they covered a wide range of KM maturity levels; triangulation was adopted to enhance the quality of the process. The major findings indicated that: (1) barriers to knowledge flow were inherently different at different KM maturity levels; and (2) various changes in the barriers to knowledge flow were associated with the maturity of the KM. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Exploring barriers to knowledge flow at different knowledge management maturity stages", "paper_id": "WOS:000300540700002"}