{"auto_keywords": [{"score": 0.0343966778700881, "phrase": "all-common_subsequences_measure"}, {"score": 0.015719716506582538, "phrase": "longest_common_subsequence"}, {"score": 0.013407944255866376, "phrase": "common_subsequences"}, {"score": 0.009182855873533608, "phrase": "longest_common_subsequence_measure"}, {"score": 0.004749106104067268, "phrase": "well_known_and_popular_method"}, {"score": 0.004007083686875716, "phrase": "sequence_similarity"}, {"score": 0.0038981499110532307, "phrase": "common_information"}, {"score": 0.003689053436223376, "phrase": "generic_similarity_measure"}, {"score": 0.0035722806911457545, "phrase": "close_connection"}, {"score": 0.0034118234596993836, "phrase": "bayes_classifier"}, {"score": 0.0033037970113095577, "phrase": "probabilistic_perspective"}, {"score": 0.0029722900280316216, "phrase": "k-nearest_neighbors"}, {"score": 0.002931569771634119, "phrase": "gene_sequence_classification_task"}, {"score": 0.0027361626349903744, "phrase": "small_k_values"}, {"score": 0.0026616868981501006, "phrase": "large_k_values"}, {"score": 0.0021940118003312397, "phrase": "nearest_neighbor"}, {"score": 0.0021342613107011624, "phrase": "first_k_nearest_neighbors"}, {"score": 0.0021049977753042253, "phrase": "main_contribution"}], "paper_keywords": ["sequence similarity", " all common subsequence", " neighborhood counting metric"], "paper_abstract": "The longest common subsequence is a well known and popular method for measuring similarity between sequences. It advocates the use of information contained in the longest common subsequence as an indication of similarity. In this paper we consider the count of all common subsequences as a measure of sequence similarity with the view that all common information is captured. This measure is inspired and derived from a generic similarity measure, neighborhood counting metric. The close connection of the neighborhood counting metric with probability and the Bayes classifier helps gain an insight from the probabilistic perspective into the all-common subsequences measure. We design algorithms to calculate this measure and we also carry out an experiment in the framework of k-nearest neighbors on a gene sequence classification task. The experiment shows that the all-common subsequences measure and the longest common subsequence measure have little difference for small k values, but differ significantly for large k values. The performance of the all-common subsequences measure remains steady as k gets larger, but the performance of the longest common subsequence measure drops sharply as k gets larger. Such a property may be useful for those tasks where we are interested not only in the nearest neighbor, but also in the first k nearest neighbors. The main contribution of this paper is a suite of algorithms for finding all common subsequences.", "paper_title": "Subsequence counting as a measure of similarity for sequences", "paper_id": "WOS:000251312600009"}