{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "haptic_data_visualization"}, {"score": 0.004617187934074393, "phrase": "training_medical_practitioners"}, {"score": 0.004483585361583022, "phrase": "virtual_environments"}, {"score": 0.0043721365634105565, "phrase": "haptic_methods"}, {"score": 0.004210114198411514, "phrase": "haptic_devices"}, {"score": 0.003604506544515223, "phrase": "line_graphs"}, {"score": 0.0034708317974593136, "phrase": "haptic_modality"}, {"score": 0.003059925849144792, "phrase": "significant_amount"}, {"score": 0.002971249577042111, "phrase": "haptic_data_presentation"}, {"score": 0.002885135695263876, "phrase": "force_feedback_line_graphs"}, {"score": 0.002789763110395331, "phrase": "haptic_representations"}, {"score": 0.002743262400544954, "phrase": "previous_research"}, {"score": 0.0026975346834867313, "phrase": "different_conferences"}, {"score": 0.0026414426081951734, "phrase": "different_application_emphases"}, {"score": 0.002511522462767081, "phrase": "comprehensive_review"}, {"score": 0.0021953959824690316, "phrase": "comprehensive_reference"}], "paper_keywords": ["Haptic data visualization", " haptics", " non-visual visualization", " haptic visualization", " haptic design"], "paper_abstract": "There are many different uses for haptics, such as training medical practitioners, teleoperation, or navigation of virtual environments. This review focuses on haptic methods that display data. The hypothesis is that haptic devices can be used to present information, and consequently, the user gains quantitative, qualitative, or holistic knowledge about the presented data. Not only is this useful for users who are blind or partially sighted (who can feel line graphs, for instance), but also the haptic modality can be used alongside other modalities, to increase the amount of variables being presented, or to duplicate some variables to reinforce the presentation. Over the last 20 years, a significant amount of research has been done in haptic data presentation; e.g., researchers have developed force feedback line graphs, bar charts, and other forms of haptic representations. However, previous research is published in different conferences and journals, with different application emphases. This paper gathers and collates these various designs to provide a comprehensive review of designs for haptic data visualization. The designs are classified by their representation: Charts, Maps, Signs, Networks, Diagrams, Images, and Tables. This review provides a comprehensive reference for researchers and learners, and highlights areas for further research.", "paper_title": "Review of Designs for Haptic Data Visualization", "paper_id": "WOS:000289470300006"}