{"auto_keywords": [{"score": 0.04334863831976788, "phrase": "critical_assets"}, {"score": 0.04136818576092414, "phrase": "p-dispersion_model"}, {"score": 0.00481495049065317, "phrase": "multi-objective_spatial_dispersion_models"}, {"score": 0.004676575291629554, "phrase": "urban_areas"}, {"score": 0.004608879242346434, "phrase": "diverse_array"}, {"score": 0.004564291332315995, "phrase": "spatial_optimization_models"}, {"score": 0.004181839414007266, "phrase": "effective_placement"}, {"score": 0.0037942165191367366, "phrase": "minimum_distance"}, {"score": 0.003704577873349949, "phrase": "dispersion"}, {"score": 0.0031536550157613974, "phrase": "computational_times"}, {"score": 0.0026986691610438327, "phrase": "orlando"}, {"score": 0.002672515652590805, "phrase": "florida"}, {"score": 0.002436289099444074, "phrase": "median_multi-objective_models"}, {"score": 0.002320449502337321, "phrase": "max_cover"}, {"score": 0.0021569129153653777, "phrase": "multi-objective_models"}, {"score": 0.0021049977753042253, "phrase": "dispersed_networks"}], "paper_keywords": ["Critical infrastructure protection", " Dispersion", " Facility location"], "paper_abstract": "A diverse array of spatial optimization models dealing with protection, service, coverage, equity, and risk can potentially aid with the effective placement of critical assets. Protection of assets can be enhanced using the p-dispersion model, which locates facilities to maximize the minimum distance between any two. Dispersion, however, is rarely the only objective for a system of facilities, and the p-dispersion model is known to be difficult to solve. Therefore, this paper analyzes the trade-offs and computational times of four multi-objective models that combine the p-dispersion model with other facility location objectives relevant to siting critical assets, such as the p-median, max-cover, p-center, and p-maxian models. The multi-objective models are tested on a case study of Orlando, Florida. The dispersion/center model produced the most gradual trade-off curve, while the dispersion/maxian trade-off curve had the most pronounced \"elbow.\" The center and median multi-objective models were far more computationally demanding than the models using max cover and p-maxian. These findings may inform decision-makers and researchers in deciding what type of multi-objective models to use for planning dispersed networks of critical assets. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison of multi-objective spatial dispersion models for managing critical assets in urban areas", "paper_id": "WOS:000305043800006"}