{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lexical_contrast"}, {"score": 0.042840968605840246, "phrase": "different_kinds"}, {"score": 0.004731638279336065, "phrase": "semantic_contrast"}, {"score": 0.004676895436217523, "phrase": "widespread_application"}, {"score": 0.00464976086880886, "phrase": "natural_language_processing"}, {"score": 0.004609352548073816, "phrase": "machine_translation"}, {"score": 0.004582608049002167, "phrase": "information_retrieval"}, {"score": 0.004542780650208743, "phrase": "dialogue_systems"}, {"score": 0.004187284711626886, "phrase": "existing_lexicons"}, {"score": 0.0036945485333312747, "phrase": "automatic_method"}, {"score": 0.003662410853488772, "phrase": "contrasting_word_pairs"}, {"score": 0.002817639725689939, "phrase": "large_crowdsourcing_experiment"}, {"score": 0.0027687904688616983, "phrase": "human_agreement"}, {"score": 0.002642615537454746, "phrase": "key_features"}, {"score": 0.002566685388128598, "phrase": "automatic_and_empirical_measure"}, {"score": 0.002507511169156787, "phrase": "contrast_hypothesis"}, {"score": 0.002435453488008121, "phrase": "roget-like_thesaurus"}, {"score": 0.002212002242551553, "phrase": "five_different_kinds"}, {"score": 0.0021609874288933163, "phrase": "proposed_measure"}, {"score": 0.0021359219875300957, "phrase": "high_precision"}, {"score": 0.0021234982719847643, "phrase": "large_coverage"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": [""], "paper_abstract": "Knowing the degree of semantic contrast between words has widespread application in natural language processing, including machine translation, information retrieval, and dialogue systems. Manually created lexicons focus on opposites, such as hot and cold. Opposites are of many kinds such as antipodals, complementaries, and gradable. Existing lexicons often do not classify opposites into the different kinds, however. They also do not explicitly list word pairs that are not opposites but yet have some degree of contrast in meaning, such as warm and cold or tropical and freezing. We propose an automatic method to identify contrasting word pairs that is based on the hypothesis that if a pair of words, A and B, are contrasting, then there is a pair of opposites, C and D, such that A and C are strongly related and B and D are strongly related. (For example, there exists the pair of opposites hot and cold such that tropical is related to hot, and freezing is related to cold.) We will call this the contrast hypothesis.We begin with a large crowdsourcing experiment to determine the amount of human agreement on the concept of oppositeness and its different kinds. In the process, we flesh out key features of different kinds of opposites. We then present an automatic and empirical measure of lexical contrast that relies on the contrast hypothesis, corpus statistics, and the structure of a Roget-like thesaurus. We show how, using four different data sets, we evaluated our approach on two different tasks, solving most contrasting word questions and distinguishing synonyms from opposites. The results are analyzed across four parts of speech and across five different kinds of opposites. We show that the proposed measure of lexical contrast obtains high precision and large coverage, outperforming existing methods.", "paper_title": "Computing Lexical Contrast", "paper_id": "WOS:000325864800004"}