{"auto_keywords": [{"score": 0.04740835405639562, "phrase": "facebook_usage"}, {"score": 0.005180425586217746, "phrase": "malaysia"}, {"score": 0.005037583774279033, "phrase": "facebook"}, {"score": 0.004826336741163943, "phrase": "financial_performance"}, {"score": 0.00481495049065317, "phrase": "social_media"}, {"score": 0.004718509350356246, "phrase": "purpose_-_the_purpose"}, {"score": 0.0045160988337296605, "phrase": "small_and_medium_enterprises"}, {"score": 0.004293267161763508, "phrase": "financial_and_non-_financial_performance"}, {"score": 0.004178935413340453, "phrase": "integrated_model"}, {"score": 0.0038538167879752137, "phrase": "statistical_analyses"}, {"score": 0.003738502710504415, "phrase": "survey_questionnaire"}, {"score": 0.003459191419478298, "phrase": "strong_positive_impact"}, {"score": 0.003386386157600417, "phrase": "business_activities"}, {"score": 0.0032772504899699416, "phrase": "non-financial_performance"}, {"score": 0.0032115093493071366, "phrase": "cost_reduction"}, {"score": 0.003168413874902081, "phrase": "customer_service"}, {"score": 0.00314708280192844, "phrase": "improved_customer_relations"}, {"score": 0.0031258948882273057, "phrase": "improved_information_accessibility"}, {"score": 0.0025958041241829254, "phrase": "clearer_idea"}, {"score": 0.0025696192337207155, "phrase": "real_importance"}, {"score": 0.002321834168782981, "phrase": "actual_impact"}, {"score": 0.0021049977753042253, "phrase": "exact_value"}], "paper_keywords": ["Facebook", " SME", " Social media"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the factors that influence Facebook usage among small and medium enterprises (SMEs). In addition, it examines the impact of Facebook usage on financial and non- financial performance of the SMEs. Design/methodology/approach - Using integrated model, this study examined the influence of compatibility, cost effectiveness, interactivity and trust on Facebook usage and its subsequent impact on organizations performance. Statistical analyses were based on the data collected, through survey questionnaire from 259 SMEs in Malaysia. Partial Least Square (PLS) method was used to test the hypotheses. Findings - The study revealed that Facebook usage has a strong positive impact on financial performance of SMEs; similarly it was also found that Facebook usage positively impacts the non-financial performance of SMEs in terms of cost reduction on marketing and customer service, improved customer relations and improved information accessibility. Additionally, factors such as compatibility, cost effectiveness and interactivity was identified as factors that influence Facebook usage among SMEs. Research limitations/implications - This study is limited in selection of samples. The sample only covered one community of SME in Malaysia which limits generalizability of the findings. This study provided a clearer idea on the real importance of Facebook and its benefits. The results would motivate and guide organizations in the adoption of Facebook for business activities. The study also has various theoretical and practical contributions. Originality/value - Very few empirical studies investigated the actual impact of Facebook usage among organizations. This study investigated the effect of Facebook usage on the financial performance of the organizations which is really important to study as it reveals the exact value of using Facebook for business activities.", "paper_title": "Factors influencing the use of social media by SMEs and its performance outcomes", "paper_id": "WOS:000354647900009"}