{"auto_keywords": [{"score": 0.04005920689564769, "phrase": "informal_knowledge"}, {"score": 0.013199298414797557, "phrase": "knowledge_workers"}, {"score": 0.00481495049065317, "phrase": "field_study_of_the_informal_knowledge_practices_of_healthcare_it_teams"}, {"score": 0.004776487704077893, "phrase": "cscw"}, {"score": 0.004662913362513954, "phrase": "formal_and_informal_knowledge_practices"}, {"score": 0.0035635256137029592, "phrase": "physical_artifacts"}, {"score": 0.003368707839819003, "phrase": "appropriate_knowledge"}, {"score": 0.0033283624928018177, "phrase": "particular_situation"}, {"score": 0.0029268619875960715, "phrase": "field_study"}, {"score": 0.0028342734482926677, "phrase": "regional_hospital"}, {"score": 0.0026792166577171476, "phrase": "ad-hoc_teams"}, {"score": 0.0023558375480288297, "phrase": "knowledge_activities"}, {"score": 0.002308953751676031, "phrase": "informal_knowledge_activities"}, {"score": 0.002244876254113051, "phrase": "implicit_and_sometimes_subtle_features"}, {"score": 0.002191366809047192, "phrase": "organizational_knowledge_management_systems"}, {"score": 0.0021049977753042253, "phrase": "knowledge_sharers"}], "paper_keywords": ["knowledge seeking", " informal knowledge", " collaboration", " IT teams", " knowledge management systems", " healthcare", " qualitative research", " team practices", " organizational work"], "paper_abstract": "CSCW has long been concerned with formal and informal knowledge practices in organizations, examining both the social and technical aspects of how knowledge is sought, shared, and used. In this study, we are interested in examining the set of activities that occur when co-located knowledge workers manage and resolve issues by seeking, sharing, and applying their informal knowledge. Informal knowledge seeking involves more than identifying the expert who has the knowledge or accessing the knowledge through physical artifacts. It also involves working with that expert to identify and apply the appropriate knowledge to the particular situation. However, our understandings of how people collaboratively work together to find, share and apply this knowledge are less well understood. To investigate this phenomenon, we conducted a field study of how professionals in three IT teams of a regional hospital managed and resolved IT issues. These knowledge workers used various collaborative practices such as creation of ad-hoc teams and the use of email to identify, share, and use informal knowledge to resolve IT issues. In addition, particular team practices such as how issues are assigned affected these knowledge activities. Our findings highlight how informal knowledge activities are affected by a variety of implicit and sometimes subtle features of the organization and that organizational knowledge management systems should support informal knowledge seeking activities and collaboration amongst the knowledge sharers.", "paper_title": "Beyond Expertise Seeking: A Field Study of the Informal Knowledge Practices of Healthcare IT Teams", "paper_id": "WOS:000301786300006"}