{"auto_keywords": [{"score": 0.021329804516292784, "phrase": "linguistic_information"}, {"score": 0.005963266402156625, "phrase": "flintstones"}, {"score": 0.0045443671106012405, "phrase": "probabilistic_nature"}, {"score": 0.004271234971981848, "phrase": "good_results"}, {"score": 0.0039813976794342, "phrase": "linguistic_decision_making_problems"}, {"score": 0.003916098498242888, "phrase": "specialized_literature"}, {"score": 0.0036352070472201086, "phrase": "software_tools"}, {"score": 0.0035461111918923117, "phrase": "computational_models"}, {"score": 0.003360464999544279, "phrase": "decision_problems"}, {"score": 0.003264547032549398, "phrase": "linguistic_results"}, {"score": 0.003145223158153384, "phrase": "human_beings"}, {"score": 0.0029805015010906013, "phrase": "different_extensions"}, {"score": 0.0028715299874549245, "phrase": "complex_decision_frameworks"}, {"score": 0.0027437235598539904, "phrase": "fuzzy_linguistic_decision_tools_enhancement_suite"}, {"score": 0.002494531100339247, "phrase": "flintstones_website"}, {"score": 0.002344311033783139, "phrase": "case_studies"}, {"score": 0.002305799666781492, "phrase": "different_linguistic_decision_making_problems"}, {"score": 0.002258546887303777, "phrase": "case_study"}], "paper_keywords": ["Linguistic decision making", " Decision software", " Linguistic information", " 2-Tuple linguistic model", " Heterogeneous information", " Unbalanced linguistic information"], "paper_abstract": "Uncertainty in real world decision making problems not always has probabilistic nature, in such cases the use of linguistic information to model and manage such an uncertainty has given good results. The adoption of linguistic information implies the accomplishment of processes of computing with words to solve linguistic decision making problems. In the specialized literature, several computational models can be found to carry out such processes. However, there is a shortage of software tools that develop and implement these computational models. The 2-tuple linguistic model has been widely used to operate with linguistic information in decision problems due to the fact that provides linguistic results that are accurate and easy to understand for human beings. Furthermore, another advantage of the 2-tuple linguistic model is the existence of different extensions to accomplish processes of computing with words in complex decision frameworks. Due to these reasons, in this paper a fuzzy linguistic decision tools enhancement suite so-called Flintstones is proposed to solve linguistic decision making problems based on the 2-tuple linguistic model and its extensions. Additionally, the Flintstones website is also presented, this website has been deployed and includes a repository of case studies and datasets for different linguistic decision making problems. Finally, a case study solved by Flintstones is illustrated in order to show its performance, usefulness and effectiveness. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "FLINTSTONES: A fuzzy linguistic decision tools enhancement suite based on the 2-tuple linguistic model and extensions", "paper_id": "WOS:000339132700010"}