{"auto_keywords": [{"score": 0.048839643896770986, "phrase": "news_articles"}, {"score": 0.007834036506304405, "phrase": "news_streams"}, {"score": 0.007345998286987896, "phrase": "news_analysis"}, {"score": 0.00481495049065317, "phrase": "large-scale_news_streams"}, {"score": 0.004773040022691547, "phrase": "keyword-based_searching"}, {"score": 0.004200127680373184, "phrase": "textwheel"}, {"score": 0.003191485583025302, "phrase": "special_challenges"}, {"score": 0.0030547611342112693, "phrase": "visual_analytics_system"}, {"score": 0.0029755458462182565, "phrase": "multiple_attributes"}, {"score": 0.002737960968372391, "phrase": "dynamic_natures"}, {"score": 0.002530359917257626, "phrase": "document_transportation_belt"}, {"score": 0.0024864020775253767, "phrase": "dynamic_system"}, {"score": 0.0023180581939456686, "phrase": "interesting_patterns"}, {"score": 0.0021801135036476136, "phrase": "major_companies"}, {"score": 0.002123531043641047, "phrase": "high_potential"}], "paper_keywords": ["Documentation", " Design", " Document analysis", " text visualization", " macro-micro relation"], "paper_abstract": "Keyword-based searching and clustering of news articles have been widely used for news analysis. However, news articles usually have other attributes such as source, author, date and time, length, and sentiment which should be taken into account. In addition, news articles and keywords have complicated macro/micro relations, which include relations between news articles (i.e., macro relation), relations between keywords (i.e., micro relation), and relations between news articles and keywords (i.e., macro-micro relation). These macro/micro relations are time varying and pose special challenges for news analysis. In this article we present a visual analytics system for news streams which can bring multiple attributes of the news articles and the macro/micro relations between news streams and keywords into one coherent analytical context, all the while conveying the dynamic natures of news streams. We introduce a new visualization primitive called TextWheel which consists of one or multiple keyword wheels, a document transportation belt, and a dynamic system which connects the wheels and belt. By observing the TextWheel and its content changes, some interesting patterns can be detected. We use our system to analyze several news corpora related to some major companies and the results demonstrate the high potential of our method.", "paper_title": "Watch the Story Unfold with TextWheel: Visualization of Large-Scale News Streams", "paper_id": "WOS:000313763300002"}