{"auto_keywords": [{"score": 0.030613766746716675, "phrase": "upper_bound"}, {"score": 0.00481495049065317, "phrase": "knowledge_transfer"}, {"score": 0.004506048850130758, "phrase": "individual_learning_characteristics"}, {"score": 0.004392565073466714, "phrase": "system_throughput"}, {"score": 0.004303830426772906, "phrase": "worker_productivity"}, {"score": 0.004238452771031322, "phrase": "skill_knowledge"}, {"score": 0.003926105480202798, "phrase": "allocation_problem"}, {"score": 0.0036181717017041387, "phrase": "individual_characteristics"}, {"score": 0.0032836104153151973, "phrase": "useful_measures"}, {"score": 0.002949598537993663, "phrase": "baseline_policy"}, {"score": 0.0028170314398963704, "phrase": "non-linear_math-programming_problem"}, {"score": 0.0025694584194998335, "phrase": "estimated_output"}, {"score": 0.002453934333239467, "phrase": "asymptotic_steady_state_productivity"}, {"score": 0.0022041312401435346, "phrase": "objective_gap_relative"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Learning-by-doing", " Knowledge transfer", " Assignment"], "paper_abstract": "This paper investigates the allocation of workers to tasks based on individual learning characteristics in order to improve system throughput. We model worker productivity to include skill knowledge obtained by learning-by-doing and learning-by-transfer. The allocation problem is composed of the selection of workers from a pool, grouping workers based on individual characteristics, and assignment of groups to tasks. We examine several related heuristic approaches for each phase with interest in identifying useful measures and policies, as well as interactions among these policies. The performance of each heuristic is compared to a baseline policy and to an upper bound obtained by solving a non-linear math-programming problem. Results are examined in the context of both parallel and serial systems. Current results demonstrate that heuristics based on estimated output, ability to learn from other workers, and asymptotic steady state productivity are useful for selecting, grouping and assigning workers to tasks, and these policies perform well with respect to objective gap relative to an upper bound. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Selection, grouping, and assignment policies with learning-by-doing and knowledge transfer", "paper_id": "WOS:000347866900017"}