{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "qos"}, {"score": 0.03667468258062181, "phrase": "pq-mac"}, {"score": 0.009612312623424516, "phrase": "mac"}, {"score": 0.0047517225918491226, "phrase": "wireless_sensor_networks"}, {"score": 0.0039748192550806815, "phrase": "energy_consumption"}, {"score": 0.003922580121023413, "phrase": "traffic-based_sleep-wakeup_scheduling"}, {"score": 0.0028173769301594745, "phrase": "multi-level_queue_management"}, {"score": 0.0027803070408286158, "phrase": "sleep-wakeup_scheduling"}, {"score": 0.002707620139970122, "phrase": "ordered_contention_period"}, {"score": 0.0025509294021449254, "phrase": "time-bounded_delivery"}, {"score": 0.0024678216843278806, "phrase": "performance_evaluation"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["MAC", " CSMA", " TDMA", " QoS", " priority-based", " wireless sensor networks"], "paper_abstract": "In this letter, we propose PQ-MAC: a priority-based medium access control (MAC) protocol for providing quality of service (QoS) in wireless sensor networks (WSNs) which minimizes the energy consumption with traffic-based sleep-wakeup scheduling and supports QoS using differentiating channel access policy, packet scheduling, and queue management. The PQ-MAC utilizes the advantages of time division multiple access (TDMA) and slotted carrier-sense multiple access (CSMA). The proposed protocol is an energy-efficient, priority-based, and QoS compatible MAC protocol. It consists of multi-level queue management, sleep-wakeup scheduling, and an ordered contention period (CP) scheme. It also guarantees time-bounded delivery of QoS packets. Performance evaluation is conducted between PQ-MAC and S-MAC with respect to three performance metrics: energy consumption, throughput, and average latency. The simulation results show that the performance of PQ-MAC is better than that of S-MAC.", "paper_title": "Priority-based medium access control protocol for providing QoS in wireless sensor networks", "paper_id": "WOS:000250094600014"}