{"auto_keywords": [{"score": 0.035485157497447295, "phrase": "total_utilization"}, {"score": 0.03312873504529802, "phrase": "epdf"}, {"score": 0.010435406709324488, "phrase": "schedulable_utilization"}, {"score": 0.00481495049065317, "phrase": "multiprocessor_epdf_pfair_algorithm"}, {"score": 0.0045748683993128425, "phrase": "pfair_scheduling_algorithm"}, {"score": 0.004329630571352367, "phrase": "recurrent_real-time_tasks"}, {"score": 0.004228577663320847, "phrase": "prior_work"}, {"score": 0.0038930368103015467, "phrase": "epdf._implicit"}, {"score": 0.003757480190200645, "phrase": "total_system_utilization"}, {"score": 0.0036987521452843987, "phrase": "total_available_processing_capacity"}, {"score": 0.00348655247465418, "phrase": "orthogonal_issue"}, {"score": 0.003405109584265324, "phrase": "sufficient_restriction"}, {"score": 0.0030494153169181334, "phrase": "per-task_weight_restrictions"}, {"score": 0.002763261749602258, "phrase": "task's_weight"}, {"score": 0.0023787690061742566, "phrase": "total_processing_capacity"}, {"score": 0.002259883463607508, "phrase": "maximum_weight"}, {"score": 0.0021049977753042253, "phrase": "schedule_task_sets"}], "paper_keywords": ["Pfair", " EPDF", " utilization bound", " real-time scheduling", " multiprocessors"], "paper_abstract": "The earliest-pseudo-deadline-first (EPDF) Pfair scheduling algorithm is less expensive than some other known Pfair algorithms, but is not optimal for scheduling recurrent real-time tasks on more than two processors. In prior work, sufficient per-task weight (i.e., utilization) restrictions were established for ensuring that tasks either do not miss their deadlines or have bounded tardiness when scheduled under EPDF. Implicit in these restrictions is the assumption that the total system utilization may equal the total available processing capacity (i.e., the total number of processors). This paper considers an orthogonal issue, namely, determining a sufficient restriction on the total utilization of a task set for it to be schedulable (i.e., a schedulable utilization bound) under EPDF, assuming that there are no per-task weight restrictions. We prove that a task set with total utilization at most 3M+1/4 is correctly scheduled under EPDF on M processors, regardless of how large each task's weight is. At present, we do not know whether this value represents the worst-case for EPDF, but we do provide a counterexample that shows that it cannot be improved to exceed 86% of the total processing capacity. The schedulable utilization bound we derive is expressed in terms of the maximum weight of any task, and hence, if this value is known, may be used to schedule task sets with total utilization greater than 3M+1/4.", "paper_title": "A schedulable utilization bound for the multiprocessor EPDF Pfair algorithm", "paper_id": "WOS:000252808000003"}