{"auto_keywords": [{"score": 0.04528487297387803, "phrase": "visually_impaired_persons"}, {"score": 0.008372892750903001, "phrase": "visually_impaired_users"}, {"score": 0.006267121820635722, "phrase": "qualitative_study"}, {"score": 0.00505410123826143, "phrase": "regularly_walked_routes"}, {"score": 0.00481495049065317, "phrase": "collaborative_navigation"}, {"score": 0.004672444473700524, "phrase": "navigation_system"}, {"score": 0.004081385289516914, "phrase": "navigation_task"}, {"score": 0.003940706575253453, "phrase": "new_system"}, {"score": 0.0031448288291084, "phrase": "unknown_environment"}, {"score": 0.003021141590548526, "phrase": "quantitative_study"}, {"score": 0.0025473475682739784, "phrase": "environment_description"}, {"score": 0.002459414063407306, "phrase": "safe_and_efficient_navigation"}, {"score": 0.0023864566654035924, "phrase": "proposed_collaborative_navigation_system"}, {"score": 0.002327310963701377, "phrase": "natural_behaviour"}, {"score": 0.0021049977753042253, "phrase": "urban_area"}], "paper_keywords": ["Collaboration", " Communication", " Regular routes", " Navigation", " Visually impaired"], "paper_abstract": "A navigation system for visually impaired users can be much more efficient if it is based on collaboration among visually impaired persons and on utilising distributed knowledge about the environment in which the navigation task takes place. To design a new system of this kind, it is necessary to make a study of communication among visually impaired users while navigating in a given environment and on their regularly walked routes. A qualitative study was conducted to gain insight into the issue of communication among visually impaired persons while they are navigating in an unknown environment, and our hypotheses were validated by a quantitative study with a sample of 54 visually impaired respondents. A qualitative study was conducted with 20 visually impaired participants aimed at investigating regularly walked routes used by visually impaired persons. The results show that most visually impaired users already collaborate on navigation, and consider an environment description from other visually impaired persons to be adequate for safe and efficient navigation. It seems that the proposed collaborative navigation system is based on the natural behaviour of visually impaired persons. In addition, it has been shown that a network of regularly walked routes can significantly expand the urban area in which visually impaired persons are able to navigate safely and efficiently.", "paper_title": "Collaborative navigation of visually impaired", "paper_id": "WOS:000337754000007"}