{"auto_keywords": [{"score": 0.0429935486588942, "phrase": "fixed_point_image"}, {"score": 0.021985692870845196, "phrase": "new_scheme"}, {"score": 0.010521976657130542, "phrase": "fixed_point_theory"}, {"score": 0.009952607487382234, "phrase": "image_integrity_authentication"}, {"score": 0.008827830479516331, "phrase": "original_one"}, {"score": 0.00481495049065317, "phrase": "image_integrity_authentication_scheme_based"}, {"score": 0.004379977556546879, "phrase": "digital_signature"}, {"score": 0.004342430078306461, "phrase": "fragile_watermarking"}, {"score": 0.004159446063902181, "phrase": "original_image"}, {"score": 0.003933000051147382, "phrase": "well-chosen_transform"}, {"score": 0.0035162927451540065, "phrase": "received_image"}, {"score": 0.003353521531649663, "phrase": "tampered_areas"}, {"score": 0.0030898642396380662, "phrase": "gaussian_convolution"}, {"score": 0.0029467742734417255, "phrase": "existence_theorem"}, {"score": 0.0029214769181390653, "phrase": "fixed_points"}, {"score": 0.0026916956768363158, "phrase": "gcd_transform"}, {"score": 0.0024906610581090223, "phrase": "whole_procedure"}, {"score": 0.002255431275670053, "phrase": "good_performance"}, {"score": 0.0021049977753042253, "phrase": "semifragile_system"}], "paper_keywords": ["Integrity authentication", " fixed point image", " Gaussian convolution and deconvolution (GCD)"], "paper_abstract": "Based on the fixed point theory, this paper proposes a new scheme for image integrity authentication, which is very different from digital signature and fragile watermarking. By the new scheme, the sender transforms an original image into a fixed point image (very close to the original one) of a well-chosen transform and sends the fixed point image (instead of the original one) to the receiver; using the same transform, the receiver checks the integrity of the received image by testing whether it is a fixed point image and locates the tampered areas if the image has been modified during the transmission. A realization of the new scheme is based on Gaussian convolution and deconvolution (GCD) transform, for which an existence theorem of fixed points is proved. The semifragility is analyzed via commutativity of transforms, and three commutativity theorems are found for the GCD transform. Three iterative algorithms are presented for finding a fixed point image with a few numbers of iterations, and for the whole procedure of image integrity authentication; a fragile authentication system and a semifragile one are separately built. Experiments show that both the systems have good performance in transparence, fragility, security, and tampering localization. In particular, the semifragile system can perfectly resist the rotation by a multiple of 90 degrees flipping and brightness attacks.", "paper_title": "Image Integrity Authentication Scheme Based on Fixed Point Theory", "paper_id": "WOS:000354550200011"}