{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_sources"}, {"score": 0.0063751334188600515, "phrase": "query_evaluation"}, {"score": 0.004721162131188487, "phrase": "general_form"}, {"score": 0.00438105507792004, "phrase": "query-based_access"}, {"score": 0.004001828274595483, "phrase": "possible_linguistic_mismatch"}, {"score": 0.003908396188878932, "phrase": "object_classification"}, {"score": 0.0036553070575015344, "phrase": "desired_information"}, {"score": 0.0035141291835319682, "phrase": "new_query"}, {"score": 0.00320970209394799, "phrase": "original_one"}, {"score": 0.003134705849154561, "phrase": "logical_implication"}, {"score": 0.003097865379563127, "phrase": "sought_extension"}, {"score": 0.002763261749602258, "phrase": "polynomial_time_algorithm"}, {"score": 0.0027093285574752457, "phrase": "general_case"}, {"score": 0.0023694065215394593, "phrase": "directed_acyclic_graph"}, {"score": 0.0022958180852458215, "phrase": "extended_sources"}, {"score": 0.0021049977753042253, "phrase": "information_access"}], "paper_keywords": ["logic-based abduction", " information systems", " algorithms"], "paper_abstract": "We consider a general form of information sources, consisting of a set of objects classified by terms arranged in a taxonomy. The query-based access to the information stored in sources of this kind, is plagued with uncertainty, due, among other things, to the possible linguistic mismatch between the user and the object classification. To overcome this uncertainty in all situations in which the user is not finding the desired information and is not willing or able to state a new query, the study proposes to extend the classification, in a way that is as reasonable as possible with respect to the original one. By equating reasonableness with logical implication, the sought extension turns out to be an explanation of the classification, captured by abduction. The problem of query evaluation on information sources extended in this way is studied and a polynomial time algorithm is provided for the general case, in which no hypothesis is made on the structure of the taxonomy. The algorithm is successively specialized on a most common kind of information sources, namely sources whose taxonomy can be represented as a directed acyclic graph. It is shown that query evaluation on extended sources is easier for this kind of sources. Finally, two applications of the method are presented, which capture very important aspects of information access: information browsing and query result ranking.", "paper_title": "Abduction for accessing information sources", "paper_id": "WOS:000256228800002"}