{"auto_keywords": [{"score": 0.03946152905781632, "phrase": "facebook_pages"}, {"score": 0.004606759374526927, "phrase": "qualitative_and_quantitative_content_analysis"}, {"score": 0.004560098694694199, "phrase": "facebook"}, {"score": 0.004216880725292, "phrase": "candidates'_pages"}, {"score": 0.004089725258435817, "phrase": "different_elements"}, {"score": 0.0040481944502103505, "phrase": "aristotelian_language"}, {"score": 0.0037947482487057076, "phrase": "additional_roles"}, {"score": 0.003680274684654909, "phrase": "findings_-_findings"}, {"score": 0.003593623872399777, "phrase": "emotional_and_motivational_appeal"}, {"score": 0.003545024951402818, "phrase": "social_capital"}, {"score": 0.003485196263406553, "phrase": "personal_image"}, {"score": 0.003391556348707911, "phrase": "statistical_analysis"}, {"score": 0.0029196116767956273, "phrase": "small_number"}, {"score": 0.0028997895009747502, "phrase": "non-controversial_subjects"}, {"score": 0.002850819170139645, "phrase": "content_analysis"}, {"score": 0.0027741761880779535, "phrase": "fund-raising_purposes"}, {"score": 0.002627000223796678, "phrase": "alternative_way"}, {"score": 0.0024707163158758307, "phrase": "affective_sensibility"}, {"score": 0.0023960878466674795, "phrase": "affective_allegiances"}, {"score": 0.002292243761395491, "phrase": "innovative_way"}, {"score": 0.002245842206945282, "phrase": "social_media_sites"}, {"score": 0.002185428109917791, "phrase": "political_information"}, {"score": 0.0021049977753042253, "phrase": "social_and_economic_capital"}], "paper_keywords": ["Elections", " Social networking sites", " Information dissemination", " Political information"], "paper_abstract": "Purpose The present study aims to report the findings of a qualitative and quantitative content analysis of the Facebook pages of the two presidential candidates. Design/methodology/approach - The sample contained 513 posts collected during the last three months of the 2012 US presidential election. The analysis of the candidates' pages consisted of three phases: the identification of the different elements of the Aristotelian language of persuasion, the identification of the subjects that appear on the posts, and the identification of additional roles that the Facebook pages play in the campaigns. Findings - Findings show that both candidates used an emotional and motivational appeal to create a social capital and to present a personal image that revealed very little of their personal lives. Statistical analysis shows the numbers of comments and likes given to the posts were influenced by the element of persuasion used on the posts. Results show that campaigns wanted to retain control of the message displayed on the pages by posting information on a small number of non-controversial subjects. Finally, the content analysis revealed that the Facebook pages were used for fund-raising purposes, and for the mobilization of supporters. The Facebook pages of both candidates present an alternative way to do politics called fandom politics that is based not on logic or reason but on the affective sensibility of the audiences, discouraging dissent and encouraging affective allegiances between the candidate and his supporters. Originality/value - This study presents an innovative way of analyzing the use of social media sites as a tool for the dissemination of political information and reveals utilization of these media for the creation of social and economic capital by politicians.", "paper_title": "Like me! Analyzing the 2012 presidential candidates' Facebook pages", "paper_id": "WOS:000320636600002"}