{"auto_keywords": [{"score": 0.03131725108108424, "phrase": "glue"}, {"score": 0.00481495049065317, "phrase": "face-to-face_to_distance"}, {"score": 0.00478778190213169, "phrase": "lms-mediated"}, {"score": 0.004550029253278477, "phrase": "integration_architecture"}, {"score": 0.004324031677173549, "phrase": "lms_environment"}, {"score": 0.00417961150804265, "phrase": "complex_collaborative_learning_situations"}, {"score": 0.0028756028995504035, "phrase": "equivalent_face"}, {"score": 0.002763709443278514, "phrase": "non-technological_setting"}, {"score": 0.002495521662819317, "phrase": "set_up_effort"}, {"score": 0.0023848164282879885, "phrase": "good_choice"}, {"score": 0.0022661190184053628, "phrase": "collaborative_learning_situations"}, {"score": 0.0022278779300543548, "phrase": "lms-mediated_ones"}, {"score": 0.002202742267484358, "phrase": "significant_negative_effects"}, {"score": 0.0021655683497137234, "phrase": "learning_achievement"}], "paper_keywords": ["collaborative learning", " distributed architectures", " interoperability", " learning management systems", " external tools"], "paper_abstract": "GLUE! is an integration architecture that allows teachers to easily set up an LMS environment with several external tools to carry out complex collaborative learning situations in distance settings. Though its effectiveness in alleviating the burden on teachers of deploying and enacting such situations has been studied elsewhere, there are no studies in the literature analyzing the impact, in terms of learning achievement, of turning traditional face-to-face collaborative learning situations into distance LMS-mediated ones with the support of integration approaches such as the GLUE! architecture. This paper compares the learning achievement in a distance LMS-mediated collaborative learning situation supported by GLUE! and in the equivalent face-to-face in a non-technological setting. The conclusions of this comparison, along with the fact that GLUE! significantly reduces the set up effort, suggest that GLUE! is a good choice for turning traditional face-to-face collaborative learning situations into distance LMS-mediated ones without significant negative effects in the learning achievement. (c) 2015 Wiley Periodicals, Inc. Comput Appl Eng Educ 23:527-536, 2015; View this article online at ; DOI", "paper_title": "From face-to-face to distance LMS-mediated collaborative learning situations with GLUE!", "paper_id": "WOS:000357466300005"}