{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_characteristics"}, {"score": 0.04920822493417558, "phrase": "visual_comfort"}, {"score": 0.00763675407846095, "phrase": "continuous_assessment"}, {"score": 0.004598933498016774, "phrase": "stereoscopic_content_experience_visual_discomfort"}, {"score": 0.004372442291178139, "phrase": "fast_in-scene_motion"}, {"score": 0.003809628721278519, "phrase": "different_measurement_methods"}, {"score": 0.003334309053314909, "phrase": "questionnaire_data"}, {"score": 0.0031991799574455555, "phrase": "stereoscopic_movie"}, {"score": 0.003140888248194296, "phrase": "general_visual_comfort_items"}, {"score": 0.0030414140732789186, "phrase": "double_vision"}, {"score": 0.002711109302199029, "phrase": "video_content"}, {"score": 0.0024389277933858054, "phrase": "questionnaire_results"}, {"score": 0.0023944552329463035, "phrase": "continuous_assessment_scores"}, {"score": 0.002297327670408112, "phrase": "linear_combination"}, {"score": 0.0021539955106204354, "phrase": "comfort_prediction"}, {"score": 0.0021342613107011624, "phrase": "entire_movies"}, {"score": 0.0021049977753042253, "phrase": "different_scenes"}], "paper_keywords": ["Three-dimensional displays", " Visual comfort", " Human factors", " Video processing", " Subjective assessment", " Modeling"], "paper_abstract": "Some viewers of stereoscopic content experience visual discomfort that can be induced or intensified by certain video characteristics such as fast in-scene motion, large changes in disparity and depth discontinuities caused by subtitles. An experiment was carried out to determine the impact of these video characteristics in terms of visual comfort via different measurement methods. Two 3-D movies of approximately 15 min each, both with and without subtitles, were assessed in terms of visual comfort via a continuous assessment and retrospective questionnaires. Analysis of the questionnaire data revealed that subtitles negatively affect how viewers watch stereoscopic movie in terms of general visual comfort items as well as in terms of double vision and sharpness. Via the questionnaires, participants reported that their visual comfort assessment depended primarily on the motion and (changes in) depth in the video content. The scores of the continuous assessment were directly correlated to video characteristics that were derived from the 3-D movies. In line with the questionnaire results, analysis of the continuous assessment scores revealed that visual comfort could be predicted from a linear combination of these video characteristics per scene, yet more complex models are required to extend the comfort prediction to entire movies, incorporating different scenes. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The impact of video characteristics and subtitles on visual comfort of 3D TV", "paper_id": "WOS:000316528100002"}