{"auto_keywords": [{"score": 0.04734547775045444, "phrase": "motor_skill"}, {"score": 0.015206547470878315, "phrase": "perceptive_and_motor_task_demands"}, {"score": 0.012613055140981915, "phrase": "random_practice"}, {"score": 0.00481495049065317, "phrase": "motor_skills"}, {"score": 0.004734853555630616, "phrase": "optimal_amount"}, {"score": 0.00403709306806495, "phrase": "constant_practice"}, {"score": 0.003920209964956682, "phrase": "skill's_macrostructure_formation"}, {"score": 0.0033280910751441496, "phrase": "adaptive_process"}, {"score": 0.00330025288273863, "phrase": "motor_learning"}, {"score": 0.00325893016361821, "phrase": "coincident_timing_complex_task"}, {"score": 0.0026414426081951734, "phrase": "perceptive_and_motor_demands"}, {"score": 0.0022609695885550058, "phrase": "minimum_amount"}, {"score": 0.0021049977753042253, "phrase": "needed_flexibility"}], "paper_keywords": ["Adaptive process", " variability of practice", " motor skill", " motor learning"], "paper_abstract": "In this study, motor skill was proposed as being organized into two hierarchical levels: macro-and microstructures, which would be responsible for the consistency and variability of actions, respectively. Constant practice was considered responsible for promoting the skill's macrostructure formation and, following random practice, its diversification (microstructure). The aim of this study was to investigate the effects of the number of items varied during random practice in order to promote diversification of the skill on the adaptive process of motor learning. A coincident timing complex task was manipulated in terms of perceptive (experiment 1), motor (experiment 2) and perceptive coupled with motor (experiment 3) requirements. In each experiment, 22 children were divided into two groups according to the amount of variability (three or six). Also, the design included two phases: stabilization and adaptation. Results showed that when the motor skill was diversified in relation to perceptive and motor demands separately (experiments 1 and 2), there were no differences between groups with variability of three and six parameters during the adaptation. No learning occurred for both groups in experiment 3. In conclusion, a minimum amount of variability in perceptive and motor task demands varying separately during practice (three variations) was enough to provide the needed flexibility for adaptation in the motor skill.", "paper_title": "Diversification of motor skills rely upon an optimal amount of variability of perceptive and motor task demands", "paper_id": "WOS:000351208900002"}