{"auto_keywords": [{"score": 0.04697928508658599, "phrase": "lad"}, {"score": 0.008608934075301299, "phrase": "logical_analysis"}, {"score": 0.005173410184742453, "phrase": "existing_approaches"}, {"score": 0.00481495049065317, "phrase": "pattern_selection"}, {"score": 0.004276949941406725, "phrase": "key_feature"}, {"score": 0.004161553532799662, "phrase": "hidden_patterns"}, {"score": 0.003916098498242888, "phrase": "decision_boundary"}, {"score": 0.003822003373331997, "phrase": "important_information"}, {"score": 0.0034994014234054397, "phrase": "positive_and_negative_classes"}, {"score": 0.0034465894339710864, "phrase": "measurement_errors"}, {"score": 0.0034152842718313888, "phrase": "lad_technique"}, {"score": 0.002519257735651759, "phrase": "proposed_approaches"}, {"score": 0.0024437176947749014, "phrase": "sparse_classifier"}, {"score": 0.002399482671479507, "phrase": "proposed_pattern_selection_approaches"}, {"score": 0.002370437342182879, "phrase": "existing_lad_approaches"}, {"score": 0.0023346234464901978, "phrase": "computational_results"}, {"score": 0.0023063614119692476, "phrase": "sparse_classifiers"}, {"score": 0.0022508572821818124, "phrase": "proposed_new_approaches"}, {"score": 0.0022303885749306645, "phrase": "improved_classification_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Classification", " Logical analysis of data", " Pattern selection", " Set covering problem"], "paper_abstract": "The logical analysis of data (LAD) is one of the most promising data mining methods developed to date for extracting knowledge from data. The key feature of the LAD is the capability of detecting hidden patterns in the data. Because patterns are basically combinations of certain attributes, they can be used to build a decision boundary for classification in the LAD by providing important information to distinguish observations in one class from those in the other. The use of patterns may result in a more stable performance in terms of being able to classify both positive and negative classes due to their robustness to measurement errors. The LAD technique, however, tends to choose too many patterns by solving a set covering problem to build a classifier; this is especially the case when outliers exist in the data set. In the set covering problem of the LAD, each observation should be covered by at least one pattern, even though the observation is an outlier. Thus, existing approaches tend to select too many patterns to cover these outliers, resulting in the problem of overfitting. Here, we propose new pattern selection approaches for LAD that take both outliers and the coverage of a pattern into account. The proposed approaches can avoid the problem of overfitting by building a sparse classifier. The performances of the proposed pattern selection approaches are compared with existing LAD approaches using several public data sets. The computational results show that the sparse classifiers built on the patterns selected by the proposed new approaches yield an improved classification performance compared to the existing approaches, especially when outliers exist in the data set. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Pattern selection approaches for the logical analysis of data considering the outliers and the coverage of a pattern", "paper_id": "WOS:000294084700039"}