{"auto_keywords": [{"score": 0.03738498060879032, "phrase": "phosphopoint"}, {"score": 0.00481495049065317, "phrase": "protein_kinase"}, {"score": 0.004771435352180973, "phrase": "biological_processes"}, {"score": 0.004070276454809864, "phrase": "substrate_recognition_motifs"}, {"score": 0.0038895008852940323, "phrase": "protein-protein_interaction"}, {"score": 0.0036663981146086103, "phrase": "potential_kinase-substrate_pairs"}, {"score": 0.002947611960613497, "phrase": "kinase-substrate_pairs"}, {"score": 0.0028682668647074397, "phrase": "gene_ontology_cellular_component_information"}, {"score": 0.0027035833504191233, "phrase": "amino_acids"}, {"score": 0.0026188490199688013, "phrase": "phosphoprotein_dataset"}, {"score": 0.002468450551616404, "phrase": "linked_phenotypes"}, {"score": 0.0023586493263143553, "phrase": "search_function"}, {"score": 0.0022434880661725493, "phrase": "robust_annotation"}, {"score": 0.0021049977753042253, "phrase": "functional_characterization"}], "paper_keywords": [""], "paper_abstract": "Motivation: To fully understand how a protein kinase regulates biological processes, it is imperative to first identify its substrate(s) and interacting protein(s). However, of the 518 known human serine/threonine/tyrosine kinases, 35 of these have known substrates, while 14 of the kinases have identified substrate recognition motifs. In contrast, 85 of the kinases have protein-protein interaction (PPI) datasets, raising the possibility that we might reveal potential kinase-substrate pairs from these PPIs. Results: PhosphoPOINT, a comprehensive human kinase interactome and phospho-protein database, is a collection of 4195 phospho-proteins with a total of 15 738 phosphorylation sites. PhosphoPOINT annotates the interactions among kinases, with their down-stream substrates and with interacting (phospho)-proteins to modulate the kinase-substrate pairs. PhosphoPOINT implements various gene expression profiles and Gene Ontology cellular component information to evaluate each kinase and their interacting (phospho)-proteins/substrates. Integration of cSNPs that cause amino acids change with the proteins with the phosphoprotein dataset reveals that 64 phosphorylation sites result in a disease phenotypes when changed; the linked phenotypes include schizophrenia and hypertension. PhosphoPOINT also provides a search function for all phospho-peptides using about 300 known kinase/phosphatase substrate/binding motifs. Altogether, PhosphoPOINT provides robust annotation for kinases, their downstream substrates and their interaction (phospho)-proteins and this should accelerate the functional characterization of kinomemediated signaling.", "paper_title": "PhosphoPOINT: a comprehensive human kinase interactome and phospho-protein database", "paper_id": "WOS:000258471500003"}