{"auto_keywords": [{"score": 0.036830344836331456, "phrase": "ssatmi"}, {"score": 0.010612387000973441, "phrase": "moment_invariants"}, {"score": 0.007165112108798466, "phrase": "joint_feature_histogram"}, {"score": 0.0047823219739028325, "phrase": "object_tracking"}, {"score": 0.004733791336312872, "phrase": "critical_task"}, {"score": 0.004701710196317656, "phrase": "automatic_security_precaution_systems"}, {"score": 0.004289215825521407, "phrase": "tracking_center"}, {"score": 0.003278024877215369, "phrase": "first_problem"}, {"score": 0.0030936482163040823, "phrase": "spatial_histogram"}, {"score": 0.0030414140732789186, "phrase": "spatial_information"}, {"score": 0.002850819170139645, "phrase": "novel_kernel_function"}, {"score": 0.002764741440770032, "phrase": "computation_efficiency"}, {"score": 0.002718045523483502, "phrase": "second_problem"}, {"score": 0.0026995881394357504, "phrase": "hu_moment_invariant"}, {"score": 0.0026449626324264275, "phrase": "kernel_bandwidth"}, {"score": 0.002618064695883914, "phrase": "candidate_object"}, {"score": 0.0024961041872030073, "phrase": "virat_ground_video_dataset"}, {"score": 0.0023079225317714815, "phrase": "experimental_results"}, {"score": 0.002185428109917791, "phrase": "partial_occlusion"}, {"score": 0.0021411841686226297, "phrase": "tracking_speed"}, {"score": 0.0021049977753042253, "phrase": "real-time_tracking_applications"}], "paper_keywords": [""], "paper_abstract": "Object tracking is a critical task in automatic security precaution systems. In order to precisely track objects, two major problems have to be solved. First, when the background and the object are similar, the tracking center of the object will be drifted to the background. Second, when the scales of an object are changed, the object will be lost in tracking. The widely used object tracking algorithms, e.g. Mean-Shift, Particle Filter etc., cannot effectively solve these problems. In this paper, we proposed SSATMI, a scale self-adaptive tracking method based on moment invariants. In SSATMI, to solve the first problem, a joint feature histogram, called spatial histogram, is proposed to represent the object. The spatial histogram includes not only color information but also spatial information so that it can describe the object more precisely and robustly for tracking. In addition, a novel kernel function is proposed for the joint feature histogram to improve the computation efficiency. To solve the second problem, HU moment invariant is applied to modify the kernel bandwidth of the candidate object. The SSATMI has been evaluated in a PC on a video from VIRAT Ground Video Dataset, a video taken under scale changing and light changing, and a video taken under scale changing and occluding. The experimental results show that SSATMI is adaptive to scale changing and light changing, and robust to partial occlusion. In addition, the tracking speed is fast enough for real-time tracking applications.", "paper_title": "A Scale Self-Adaptive Tracking Method Based on Moment Invariants", "paper_id": "WOS:000358336200004"}