{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emergency_supplies"}, {"score": 0.009627979245562026, "phrase": "scheduling_process"}, {"score": 0.006811520315731189, "phrase": "disaster_area"}, {"score": 0.006339371170744227, "phrase": "preparation_process"}, {"score": 0.004545544875014869, "phrase": "shortest_possible_time"}, {"score": 0.004454842144931373, "phrase": "pivotal_importance"}, {"score": 0.0042988665337000435, "phrase": "simulation_results"}, {"score": 0.003620360845720931, "phrase": "workflow_simulation_system"}, {"score": 0.0035175070315611088, "phrase": "petri_net"}, {"score": 0.003437324609836465, "phrase": "simplified_simulation_system"}, {"score": 0.003417565253539315, "phrase": "emergency_supplies_preparation"}, {"score": 0.0033396533935201316, "phrase": "actual_emergency_response"}, {"score": 0.0032729341532134514, "phrase": "china_lushan_earthquake"}, {"score": 0.003244748458248666, "phrase": "case_study"}, {"score": 0.00317991916931357, "phrase": "simulation_system"}, {"score": 0.0031253798902093457, "phrase": "decision_makers"}, {"score": 0.0030895394261534776, "phrase": "whole_emergency_supplies_preparation"}, {"score": 0.0029502287070757704, "phrase": "current_process"}, {"score": 0.002223654214753248, "phrase": "petri_net_based_workflow_model"}, {"score": 0.0021049977753042253, "phrase": "practical_decision"}], "paper_keywords": ["Decision making", " Systemic thinking", " Workflow", " Emergency supplies", " Petri net"], "paper_abstract": "Purpose - After the occurrence of a disaster, emergency supplies should arrive at disaster area in the shortest possible time. Therefore, it is of pivotal importance to speed up the preparation and scheduling process. In other words, only when the preparation process and scheduling process coordinate well, could the emergency supplies arrive at disaster area in time. Consequently, the purpose of this paper is to explore a method that can strengthen the coordination in various kinds of situations. Design/methodology/approach - The paper first elaborates the preparation and scheduling process of emergency supplies in disasters. Then, it establishes a workflow simulation system of the emergency supplies preparation and scheduling based on Petri Net. Afterward, the paper proposes a simplified simulation system of emergency supplies preparation and scheduling which can be employed in actual emergency response. Finally, the paper takes China Lushan Earthquake for a case study. Findings - By employing the simulation system proposed by this paper, decision makers can simulate the whole emergency supplies preparation and scheduling process, which can help them find a method that can optimize the current process. Specifically, by analyzing the simulation results, the government can obtain conclusions as follows. First, whether the preparation and scheduling process of emergency supplies can speed up or not. Second, which part of the process should be improved to realize the acceleration. Third, the workload of the staffs and experts. Fourth, whether it is necessary to add staffs or experts to work in parallel. Originality/value - This paper proposes a system that can coordinate the preparation process and scheduling process of emergency supplies in disaster. Then, it employs the Petri Net based workflow model to do simulation. The simulation results show that the system designed is reasonable and can be used in practical decision making on the preparation and scheduling of emergency supplies.", "paper_title": "Preparation and scheduling system of emergency supplies in disasters", "paper_id": "WOS:000352717100007"}