{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "subexponential-time_complexity"}, {"score": 0.03369742805926215, "phrase": "constraint_satisfaction_problem"}, {"score": 0.004530894050040479, "phrase": "np-complete_problems"}, {"score": 0.004466519142879166, "phrase": "efficient_computational_methods"}, {"score": 0.004263523633867905, "phrase": "major_challenge"}, {"score": 0.004202931484732134, "phrase": "theoretical_framework"}, {"score": 0.0038986150699604504, "phrase": "exact_complexities"}, {"score": 0.0037615180375561805, "phrase": "constraint_satisfaction_problems"}, {"score": 0.003734680485633702, "phrase": "natural_restrictions"}, {"score": 0.0034394269654205094, "phrase": "polynomial_time_computation"}, {"score": 0.0032829570709414736, "phrase": "increasing_popularity"}, {"score": 0.003259522768246318, "phrase": "complexity_theory"}, {"score": 0.003167441161387607, "phrase": "n_variables"}, {"score": 0.002969628818856786, "phrase": "polynomial_factor"}, {"score": 0.0028548578165712643, "phrase": "subexponential-time_algorithms"}, {"score": 0.002455889980202819, "phrase": "global_constraints"}, {"score": 0.0024209250169088575, "phrase": "tight_characterizations"}, {"score": 0.0023694065215394593, "phrase": "aforementioned_problems"}, {"score": 0.0022696277881969896, "phrase": "detailed_landscape"}, {"score": 0.0021896891011033105, "phrase": "fundamental_results"}, {"score": 0.0021049977753042253, "phrase": "brute-force_search_approach"}], "paper_keywords": [""], "paper_abstract": "Not all NP-complete problems share the same practical hardness with respect to exact computation. Whereas some NP-complete problems are amenable to efficient computational methods, others are yet to show any such sign. It becomes a major challenge to develop a theoretical framework that is more fine-grained than the theory of NP-completeness, and that can explain the distinction between the exact complexities of various NP-complete problems. This distinction is highly relevant for constraint satisfaction problems under natural restrictions, where various shades of hardness can be observed in practice. Acknowledging the NP-hardness of such problems, one has to look beyond polynomial time computation. The theory of subexponential-time complexity provides such a framework, and has been enjoying increasing popularity in complexity theory. An instance of the constraint satisfaction problem with n variables over a domain of d values can be solved by brute-force in d n steps (omitting a polynomial factor). In this paper we study the existence of subexponential-time algorithms, that is, algorithms running in d(o)(n) steps, for various natural restrictions of the constraint satisfaction problem. We consider both the constraint satisfaction problem in which all the constraints are given extensionally as tables, and that in which all the constraints are given intensionally in the form of global constraints. We provide tight characterizations of the subexponential-time complexity of the aforementioned problems with respect to several natural structural parameters, which allows us to draw a detailed landscape of the subexponential-time complexity of the constraint satisfaction problem. Our analysis provides fundamental results indicating whether and when one can significantly improve on the brute-force search approach for solving the constraint satisfaction problem.", "paper_title": "On the Subexponential-Time Complexity of CSP", "paper_id": "WOS:000350466500004"}