{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "partially_anonymous"}, {"score": 0.004506968388996092, "phrase": "leader_election_problems"}, {"score": 0.004218602458288531, "phrase": "asynchronous_communication_model"}, {"score": 0.003967314311312148, "phrase": "arbitrary_and_unpredictable_time"}, {"score": 0.003820144626025562, "phrase": "necessary_conditions"}, {"score": 0.003426640459083931, "phrase": "enumeration_algorithm"}, {"score": 0.0033308077968426937, "phrase": "leader_election_algorithm"}, {"score": 0.003102752392819577, "phrase": "initial_knowledge"}, {"score": 0.0030446120560494155, "phrase": "enumeration_problem"}, {"score": 0.0028360962841331634, "phrase": "related_works"}, {"score": 0.002679585860537941, "phrase": "election_problem"}, {"score": 0.002259883463607508, "phrase": "complexity_viewpoint"}, {"score": 0.0022175019341824603, "phrase": "polynomial_complexities"}, {"score": 0.0021049977753042253, "phrase": "exchanged_messages"}], "paper_keywords": ["Distributed Computing", " Multi-hop", " Broadcast", " Election", " Naming", " Enumeration", " Fibrations"], "paper_abstract": "We address the enumeration and the leader election problems over partially anonymous and multi-hop broadcast networks. We consider an asynchronous communication model where each process broadcasts a message and all its neighbours receive this message after arbitrary and unpredictable time. In this paper, we present necessary conditions that must be satisfied by any graph to solve these problems and we show that these conditions are sufficient by providing an enumeration algorithm on the one hand and a leader election algorithm on the other hand. For both problems, we highlight the importance of the initial knowledge. Considering the enumeration problem, each process only knows the size of the graph and, contrary to related works, the number of its neighbouring processes is unknown. Whereas for the election problem, we show that this combination of knowledge is not sufficient. Our algorithm assumes that each process initially knows a map of the network (without knowing its position in this map). From the complexity viewpoint, our algorithms offer polynomial complexities (memory at each process, number and size of exchanged messages).", "paper_title": "Enumeration and Leader Election in Partially Anonymous and Multi-hop Broadcast Networks", "paper_id": "WOS:000308703800001"}