{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "java"}, {"score": 0.041943438793125336, "phrase": "static_and_dynamic_semantics"}, {"score": 0.004635187610736025, "phrase": "fickle"}, {"score": 0.00456020621016909, "phrase": "small_object-oriented_language"}, {"score": 0.003831801113154043, "phrase": "separate_compilation"}, {"score": 0.0036886073959526396, "phrase": "fickle_class"}, {"score": 0.003531474887552889, "phrase": "used_classes"}, {"score": 0.0034366728236876016, "phrase": "formal_system"}, {"score": 0.0027341763737751467, "phrase": "formally_the_translation"}, {"score": 0.0025611773887867255, "phrase": "prototype_implementation"}, {"score": 0.0024653491388223546, "phrase": "alternative_translation"}, {"score": 0.002235040467016128, "phrase": "previous_translation"}], "paper_keywords": [""], "paper_abstract": "We present a translation from Fickle, a small object-oriented language allowing objects to change their class at runtime, into Java. The translation is provenly correct in the sense that it preserves the static and dynamic semantics. Moreover, it is compatible with separate compilation, since the translation of a Fickle class does not depend on the implementation of used classes. Based on the formal system, we have developed an implementation. The translation turned out to be a more subtle problem than we expected. In this article, we discuss four possible approaches we considered for the design of the translation and to justify our choice, we present formally the translation and proof of preservation of the static and dynamic semantics, and discuss the prototype implementation. Moreover, we outline an alternative translation based on generics that avoids most of the casts (but not all) needed in the previous translation. The language Fickle has undergone and is still undergoing several phases of development. In this article we are discussing the translation of Fickle(II).", "paper_title": "A provenly correct translation of tickle into Java", "paper_id": "WOS:000246013700007"}