{"auto_keywords": [{"score": 0.04538516192437314, "phrase": "web_searching"}, {"score": 0.01478864684155907, "phrase": "metacognitive_skills"}, {"score": 0.005900648570203198, "phrase": "significant_differences"}, {"score": 0.005860375801216859, "phrase": "reported_metacognition_usage"}, {"score": 0.00481495049065317, "phrase": "\"metacognitively_aware\"_ir_systems"}, {"score": 0.0047007816199415905, "phrase": "purpose_-_the_purpose"}, {"score": 0.004557943646825813, "phrase": "new_taxonomy"}, {"score": 0.004028525144566374, "phrase": "university_students"}, {"score": 0.0035972293900260414, "phrase": "data_collection_instrument"}, {"score": 0.0034758549674203825, "phrase": "sheffield_university"}, {"score": 0.0034520742915588004, "phrase": "findings_-_subjects"}, {"score": 0.003050712095258931, "phrase": "long-term_aims"}, {"score": 0.0029175079344240227, "phrase": "actual_and_potential_role"}, {"score": 0.002838435157502933, "phrase": "strategic_\"metacognitive_interventions"}, {"score": 0.002761499542632865, "phrase": "intelligent_information_retrieval_system"}, {"score": 0.002668248039798779, "phrase": "retrieval_effectiveness"}, {"score": 0.002631832840403278, "phrase": "metacognitive_weaknesses"}, {"score": 0.0023578033235964356, "phrase": "extensible_taxonomy"}, {"score": 0.002285995583106854, "phrase": "prototype_metacognitive_inventory"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Worldwide web", " Information retrieval", " Cognition"], "paper_abstract": "Purpose - The purpose of this paper is to describe: a new taxonomy of metacognitive skills designed to support the study of metacognition in the context of web searching; a data collection instrument based on the taxonomy: and the results of testing the instrument on a sample of university students and staff. Design/methodology/approach - The taxonomy is based on a review of the literature, and is extended to cover web searching. This forms the basis for the design of the data collection instrument, which is tested with 405 students and staff of Sheffield University. Findings - Subjects regard the range of metacognitive skills focused on as broadly similar. However, a number of significant differences in reported metacognition usage relating to age, gender and discipline. Practical implications - These findings contribute to the long-term aims of the research which are to: develop a model of the actual and potential role of metacognition in web searching, and identify strategic \"metacognitive interventions\" that can be built into an intelligent information retrieval system, driven by the model, capable of enhancing retrieval effectiveness by compensating for metacognitive weaknesses on the part of the searcher. Originality/value - The value of the paper lies in: the consideration of metacognition in the context of web searching, the presentation of an extensible taxonomy of metacognitive skills, development and testing of a prototype metacognitive inventory, finding of significant differences in reported metacognition usage according to age, gender and discipline, and reflection of the implications of the results for future research into web searching.", "paper_title": "Towards \"metacognitively aware\" IR systems: an initial user study", "paper_id": "WOS:000266464900006"}