{"auto_keywords": [{"score": 0.032348324864135594, "phrase": "near-duplicate_images"}, {"score": 0.00481495049065317, "phrase": "spanning_trees"}, {"score": 0.004757849078050144, "phrase": "digital_content"}, {"score": 0.0040740829470571425, "phrase": "similar_but_not_identical_copies"}, {"score": 0.003977952748523497, "phrase": "exact_image_duplicates"}, {"score": 0.003884081948117292, "phrase": "slightly_modified_versions"}, {"score": 0.003702908986507269, "phrase": "near-duplicate_detection"}, {"score": 0.0036263171149449997, "phrase": "cohabiting_versions"}, {"score": 0.003436537775827008, "phrase": "first_attempts"}, {"score": 0.0031046598804456366, "phrase": "image_relationships"}, {"score": 0.00301327406964098, "phrase": "image_phylogeny_tree"}, {"score": 0.0029333222445143705, "phrase": "biological_systems"}, {"score": 0.002689810805544938, "phrase": "immediate_applications"}, {"score": 0.002626257128137605, "phrase": "copyright_enforcement"}, {"score": 0.0026028125439483216, "phrase": "news_tracking_services"}, {"score": 0.002533723901680123, "phrase": "asymmetric_dissimilarity_matrix"}, {"score": 0.0024591021632707185, "phrase": "efficient_algorithm"}, {"score": 0.002302561649365666, "phrase": "appropriate_dissimilarity_function"}, {"score": 0.002275187016388399, "phrase": "good_ipt_reconstruction"}], "paper_keywords": ["Image dependencies", " image phylogeny", " image phylogeny tree", " image's ancestry relationships", " near-duplicate detection and recognition", " near-duplicates kinship"], "paper_abstract": "Nowadays, digital content is widespread and also easily redistributable, either lawfully or unlawfully. Images and other digital content can also mutate as they spread out. For example, after images are posted on the Internet, other users can copy, resize and/or re-encode them and then repost their versions, thereby generating similar but not identical copies. While it is straightforward to detect exact image duplicates, this is not the case for slightly modified versions. In the last decade, some researchers have successfully focused on the design and deployment of near-duplicate detection and recognition systems to identify the cohabiting versions of a given document in the wild. Those efforts notwithstanding, only recently have there been the first attempts to go beyond the detection of near-duplicates to find the structure of evolution within a set of images. In this paper, we tackle and formally define the problem of identifying these image relationships within a set of near-duplicate images, what we call Image Phylogeny Tree (IPT), due to its natural analogy with biological systems. The mechanism of building IPTs aims at finding the structure of transformations and their parameters if necessary, among a near-duplicate image set, and has immediate applications in security and law-enforcement, forensics, copyright enforcement, and news tracking services. We devise a method for calculating an asymmetric dissimilarity matrix from a set of near-duplicate images and formally introduce an efficient algorithm to build IPTs from such a matrix. We validate our approach with more than 625 000 test cases, including both synthetic and real data, and show that when using an appropriate dissimilarity function we can obtain good IPT reconstruction even when some pieces of information are missing. We also evaluate our solution when there are more than one near-duplicate sets in the pool of analysis and compare to other recent related approaches in the literature.", "paper_title": "Image Phylogeny by Minimal Spanning Trees", "paper_id": "WOS:000301506500036"}