{"auto_keywords": [{"score": 0.04908030881206855, "phrase": "leiden_methodology"}, {"score": 0.029219690623003284, "phrase": "lm"}, {"score": 0.00481495049065317, "phrase": "department's_research"}, {"score": 0.00433386573276633, "phrase": "\"crown_indicator"}, {"score": 0.0042212686864468805, "phrase": "quantitative_method"}, {"score": 0.004133292222875435, "phrase": "research_quality"}, {"score": 0.004068510313497539, "phrase": "research_group"}, {"score": 0.004025885154716127, "phrase": "academic_department"}, {"score": 0.0034193226278107346, "phrase": "hard_sciences"}, {"score": 0.0032437952431945724, "phrase": "isi_web"}, {"score": 0.003028969851366049, "phrase": "social_sciences"}, {"score": 0.0026270572353632297, "phrase": "research_study"}, {"score": 0.0021049977753042253, "phrase": "significant_limitations"}], "paper_keywords": ["Crown indicator", " Research quality assessment", " Citations", " Leiden methodology", " Business and management"], "paper_abstract": "The Leiden methodology (LM), also sometimes called the \"crown indicator\", is a quantitative method for evaluating the research quality of a research group or academic department based on the citations received by the group in comparison to averages for the field. There have been a number of applications but these have mainly been in the hard sciences where the data on citations, provided by the ISI Web of Science (WoS), is more reliable. In the social sciences, including business and management, many journals and books are not included within WoS and so the LM has not been tested here. In this research study the LM has been applied on a dataset of over 3000 research publications from three UK business schools. The results show that the LM does indeed discriminate between the schools, and has a degree of concordance with other forms of evaluation, but that there are significant limitations and problems within this discipline. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating a department's research: Testing the Leiden methodology in business and management", "paper_id": "WOS:000317529900001"}