{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "airway_geometry"}, {"score": 0.004762202897268383, "phrase": "computerized_tomography"}, {"score": 0.0046328364646343375, "phrase": "multislice_x-ray"}, {"score": 0.0045318666714939905, "phrase": "msct"}, {"score": 0.004360412703519539, "phrase": "approximately_isotropic_resolution"}, {"score": 0.0036553070575015344, "phrase": "objective_measuring_method"}, {"score": 0.003478321590910367, "phrase": "limited_spatial_resolution"}, {"score": 0.003440166097491567, "phrase": "clinical_ct_scanners"}, {"score": 0.0033651019362620866, "phrase": "thin_structures"}, {"score": 0.003328184259386487, "phrase": "airway_walls"}, {"score": 0.002883439044844259, "phrase": "new_method"}, {"score": 0.0027286224888843956, "phrase": "wall_thickness"}, {"score": 0.0026543514413663893, "phrase": "integral_based_closed-form_solution"}, {"score": 0.0025820967615278073, "phrase": "volume_conservation_property"}, {"score": 0.002312174113289583, "phrase": "eight_pigs"}, {"score": 0.002200077887697072, "phrase": "ct_datasets"}], "paper_keywords": ["airway geometry measurement", " closed-form solution for the measurement of thin structures in computed tomography(CT)", " measurement of thin structures", " quantitative computed tomography (CT)"], "paper_abstract": "The technology of multislice X-ray computed tomography (MSCT) provides volume data sets with approximately isotropic resolution, which permits a noninvasive 3-D measurement and quantification of airway geometry. In different diseases, like emphysema, chronic obstructive pulmonary disease (COPD), or cystic fribrosis, changes in lung parenchyma are associated with an increase in airway wall thickness. In this paper, we describe an objective measuring method of the airway geometry in the 3-D space. The limited spatial resolution of clinical CT scanners in comparison to thin structures like airway walls causes difficulties in the measurement of the density and the thickness of these structures. Initially, these difficulties will be addressed and then a new method is introduced to circumvent the problems. Therefore the wall thickness is approximated by an integral based closed-form solution, based on the volume conservation property of convolution. We evaluated the method with a phantom containing 10 silicone tubes and proved the repeatability in datasets of eight pigs scanned twice. Furthermore, a comparison of CT datasets of 16 smokers and 15 nonsmokers was done. Further medical studies are ongoing.", "paper_title": "About objective 3-D analysis of airway geometry in computerized tomography", "paper_id": "WOS:000252098300008"}