{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_friendliness"}, {"score": 0.022942054753865074, "phrase": "individual_characteristics"}, {"score": 0.00853632089695222, "phrase": "users'_individual_characteristics"}, {"score": 0.004775335634705251, "phrase": "ir_systems"}, {"score": 0.004506968388996092, "phrase": "wider_study"}, {"score": 0.004396600680348434, "phrase": "information_science"}, {"score": 0.004031082737449308, "phrase": "information-retrieval_systems"}, {"score": 0.003997952569071503, "phrase": "irs"}, {"score": 0.0037419747525425586, "phrase": "expert_study"}, {"score": 0.0036958398682001015, "phrase": "user_study"}, {"score": 0.0036202124173487413, "phrase": "ul"}, {"score": 0.0033743949483348626, "phrase": "ebsco_host"}, {"score": 0.003264547032549398, "phrase": "data_collection"}, {"score": 0.0032242793143795454, "phrase": "users'_perceptions"}, {"score": 0.003132236287543072, "phrase": "auxiliary_functions"}, {"score": 0.002755104031926742, "phrase": "hemisphere_leanings"}, {"score": 0.0024535580495414783, "phrase": "users'_academic_areas"}, {"score": 0.002373615081691254, "phrase": "different_academic_areas"}, {"score": 0.0023540387251475615, "phrase": "different_requirements"}, {"score": 0.002184943946549964, "phrase": "user_interfaces"}, {"score": 0.0021669202726173928, "phrase": "disciplinary_ir_systems"}], "paper_keywords": [""], "paper_abstract": "This article presents one part of a wider study, performed at the Department of library and information science and book studies (LIS & BS) at the University of Ljubljana (UL). The study investigated the perceptions of user friendliness of information-retrieval systems (IRS) and the role of individual characteristics of users in these perceptions. Based on an expert study, a user study with 61 postgraduate students of the UL was performed. Three interfaces of e-journals were studied: Science Direct, Proquest Direct, and Ebsco Host. Questionnaires and observations were used for data collection. The users' perceptions of user friendliness and of importance of auxiliary functions were investigated. Also, the connections between these perceptions and the users' individual characteristics were identified. Three sets of individual characteristics were included: approaches to studying, thinking styles, and hemisphere leanings. In connection with the dimensions of individual characteristics, very different perceptions of user friendliness were expressed. Some dimensions of individual characteristics were also found to be connected to the users' academic areas. It is shown that participants from different academic areas have different requirements and perceptions of user friendliness. The results of the study are relevant for the design of the user interfaces of disciplinary IR systems. They also have implications for other areas, for example, user education and training.", "paper_title": "Perceptions and importance of user friendliness of IR systems according to users' individual characteristics and academic discipline", "paper_id": "WOS:000259455500011"}