{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electrostatically_actuated_microbeams"}, {"score": 0.03917991336907943, "phrase": "fixed-fixed_microbeams"}, {"score": 0.03210819347571314, "phrase": "travel_range"}, {"score": 0.00474946741204285, "phrase": "static_and_dynamic_operating_ranges"}, {"score": 0.004642292792558686, "phrase": "systematic_development"}, {"score": 0.004537525607322823, "phrase": "generic_shape_optimization_methodology"}, {"score": 0.004256533389293113, "phrase": "energy-based_techniques"}, {"score": 0.0037971749182744334, "phrase": "nonprismatic_geometries"}, {"score": 0.0036275736378775757, "phrase": "proposed_width_functions"}, {"score": 0.003545625043276134, "phrase": "nelder-mead_method"}, {"score": 0.003433987036569199, "phrase": "penalty_method"}, {"score": 0.0031627430133087616, "phrase": "proposed_methodology"}, {"score": 0.0026704265616705023, "phrase": "geometric_nonlinearity"}, {"score": 0.002610043728801011, "phrase": "optimal_shapes"}, {"score": 0.0023067494372458427, "phrase": "representative_cases"}, {"score": 0.0021049977753042253, "phrase": "optimized_geometries"}], "paper_keywords": ["Microelectromechanical systems", " Shape optimization", " Nonprismatic beams", " Pull-in instability", " Penalty method", " Finite element analysis"], "paper_abstract": "We present the systematic development and application of a generic shape optimization methodology to enhance the static and dynamic pull-in ranges of electrostatically actuated microbeams. Energy-based techniques are used to extract static and dynamic pull-in parameters of the distributed electromechanical model that accounts for the fringing field capacitance, moderately large deflections, and coupling between the mechanical and electric forces. Versatile parametric width functions are used to characterize the nonprismatic geometries of cantilever and fixed-fixed microbeams, and parameters of the proposed width functions are optimized using the Nelder-Mead method of function minimization together with a penalty method to enforce the constraints. We consider several test cases in order to fully demonstrate the utility of the proposed methodology. Results indicate that an increase in the travel range of as much as 20% can be obtained using our optimization approach. In case of fixed-fixed microbeams, this enhancement in the travel range is found to be dependent on the extent of geometric nonlinearity. We present the optimal shapes of these microbeams, that easily lend themselves to microfabrication, which exhibit the improved pull-in response in both static and dynamic regimes. For a set of representative cases, the enhanced travel range in both static and dynamic modes of actuation is positively verified by 3D finite element analyses performed on the referential and optimized geometries.", "paper_title": "Shape optimization of electrostatically actuated microbeams for extending static and dynamic operating ranges", "paper_id": "WOS:000310832400008"}