{"auto_keywords": [{"score": 0.043069853910456694, "phrase": "near-optimal_control"}, {"score": 0.004406994912939125, "phrase": "powadima_research_project"}, {"score": 0.004073359218158693, "phrase": "water-distribution_networks"}, {"score": 0.003016544840824688, "phrase": "conventional_hydraulic_the_methodology"}, {"score": 0.0029576827451501956, "phrase": "near-optimal_control_simulation_model"}, {"score": 0.0027878797103973313, "phrase": "near-optimal_control_settings"}, {"score": 0.0027334673433027086, "phrase": "current_demands"}, {"score": 0.002680114113899346, "phrase": "overall_pumping_costs"}, {"score": 0.0026277995163948263, "phrase": "operating_horizon"}, {"score": 0.002323142666222693, "phrase": "potential_benefits"}, {"score": 0.0022665781920241245, "phrase": "control_system"}], "paper_keywords": ["optimal-control", " POWADIMA", " real-time", " water distribution"], "paper_abstract": "This paper is intended to serve as an introduction to the POWADIMA research project, whose objective was to determine the feasibility and efficacy of introducing real-time, near-optimal control for water-distribution networks, With that in mind, its content include the current state-of-the-art and some of the difficulties that would need to be addressed if the goal of near-optimal control was to be achieved. Subsequently, the approach adopted is outlined, together with the reasons for the choice. Since it would be somewhat impractical to use a conventional hydraulic the methodology includes replicating the near-optimal control simulation model for real-time use. In this way, the near-optimal control settings to meet the current demands and minimize the overall pumping costs up to the operating horizon can be derived. The programme of work undertaken p in achieving this end is then described. By way of conclusion, the potential benefits arising from implementing the control system developed are briefly reviewed, as are the possibilities of using the same approach for other application areas.", "paper_title": "Conceptual design of a generic, real-time, near-optimal control system for water-distribution networks", "paper_id": "WOS:000243505900002"}