{"auto_keywords": [{"score": 0.03647822605129656, "phrase": "main_drawback"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_video"}, {"score": 0.00459039896577789, "phrase": "video_streaming"}, {"score": 0.0037377733149169573, "phrase": "content_delivery_network"}, {"score": 0.0036147562669032957, "phrase": "numerous_replicate_servers"}, {"score": 0.0032850648549389025, "phrase": "numerous_servers"}, {"score": 0.0032074366230426727, "phrase": "infrastructure-less_approach"}, {"score": 0.002512926336312949, "phrase": "multiple_description_coding"}, {"score": 0.002350041573006264, "phrase": "on-demand_video_streaming"}, {"score": 0.0022294970815863774, "phrase": "mdc"}, {"score": 0.0021560018573288666, "phrase": "adaptive_video_quality"}, {"score": 0.0021049977753042253, "phrase": "heterogeneous_network_environment"}], "paper_keywords": ["adaptive video streaming", " peer-to-peer computing", " multimedia proxy", " cache replacement algorithm", " multiple description coding"], "paper_abstract": "In the past few years, video streaming has been one of the most prominent applications in the Internet. There are basically two types of approaches to deliver on-demand video streams: infrastructure-based and infrastructure-less. The infrastructure-based approach, also known as the content delivery network (CDN) approach. employs numerous replicate servers and proxies to assist video streaming. The main drawback of this approach is that it is costly to deploy numerous servers and proxies. The infrastructure-less approach, also known as the peer-to-peer (P2P) approach, employs numerous peers to relay video streams. The main drawback of the P2P approach is its instability due to frequent joining/leaving of peers. The state-of-the-art development is to combine the two types of approaches. In this paper, we employ multiple description coding (MDC) to develop a novel P2P-assisted proxy caching scheme, called MP(3), for on-demand video streaming. Our simulation results show that with the use of MDC, MP(3) call effectively provide adaptive video quality for clients in a heterogeneous network environment.", "paper_title": "Quality-Adaptive Proxy Caching for Peer-to-Peer Video Streaming Using Multiple Description Coding", "paper_id": "WOS:000266302900003"}