{"auto_keywords": [{"score": 0.04432938903369474, "phrase": "trmsim-wsn"}, {"score": 0.004781915513030716, "phrase": "distributed_and_heterogeneous_networks"}, {"score": 0.004342430078306461, "phrase": "trust_and_reputation_models_simulator"}, {"score": 0.004152288616186981, "phrase": "distributed_networks"}, {"score": 0.003956784357357341, "phrase": "specific_security_threats"}, {"score": 0.0038624981944755813, "phrase": "particular_systems"}, {"score": 0.003531474887552889, "phrase": "reasonably_good_performance"}, {"score": 0.0033075957452554368, "phrase": "ongoing_work"}, {"score": 0.003108565704097622, "phrase": "wider_range"}, {"score": 0.0029620573986902416, "phrase": "additional_security_threats"}, {"score": 0.0028715299874549245, "phrase": "new_undesirable_situations"}, {"score": 0.0027456170444204895, "phrase": "reputation_model"}, {"score": 0.002580315755140875, "phrase": "specific_features"}, {"score": 0.0025537472239953807, "phrase": "distributed_network"}, {"score": 0.0024501740852758505, "phrase": "possible_security_threats"}, {"score": 0.002224510044064184, "phrase": "distributed_systems"}, {"score": 0.0022015970225369975, "phrase": "new_model"}, {"score": 0.0021049977753042253, "phrase": "current_most_representative_ones"}], "paper_keywords": ["Trust", " Modelling", " Distributed databases", " Computer networks"], "paper_abstract": "Purpose - The purpose of this paper is to analyse and describe several trust and reputation models for distributed and heterogeneous networks and compare some of them in order to provide an evaluation amongst some of the most relevant works in this field. Design/methodology/approach - The authors have developed a trust and reputation models simulator for wireless sensor networks, called TRMSim-WSN, and implemented several trust models for distributed networks in order to test their accuracy as well as their resilience against a set of specific security threats that can be applied in these particular systems, as the paper will show. Findings - The analysis of the outcomes obtained from the experiments revealed that while some models have a reasonably good performance against certain security threats, none of them behaves as would be desired under any circumstances. Research limitations/implications - Ongoing work is focused on the implementation of several trust and reputation models in the simulator TRMSim-WSN, in order to have a wider range of possibilities for comparison. Furthermore, the authors are planning to include additional security threats that allow the testing of those models under new undesirable situations. Practical implications - The experiments show that when deciding which trust and/or reputation model is more suitable or adequate to be applied, it is crucial to study and analyse the specific features of the distributed network where such model is to be deployed, as well as the possible security threats that can spoil its accuracy. Originality/value - As far as is known, this is one of the few works in the field of trust and reputation in distributed systems where no new model is presented, but a comparison and analysis of some of the current most representative ones is carried out.", "paper_title": "Trust and reputation models comparison", "paper_id": "WOS:000291632400003"}