{"auto_keywords": [{"score": 0.04294110664419514, "phrase": "game_architectures"}, {"score": 0.013175153119485675, "phrase": "gwg_framework"}, {"score": 0.008459583599013366, "phrase": "computer_game_architectures"}, {"score": 0.005139629069506866, "phrase": "previous_reviews"}, {"score": 0.004591345494188032, "phrase": "game_world_graph"}, {"score": 0.004149922666541166, "phrase": "systematic_review"}, {"score": 0.003619235073669304, "phrase": "distinct_categories"}, {"score": 0.0034715658596258018, "phrase": "major_contribution"}, {"score": 0.002991524908432975, "phrase": "single_player_games"}, {"score": 0.002921114512115261, "phrase": "online_games"}, {"score": 0.002719644855867468, "phrase": "narrower_selection"}, {"score": 0.002414191082427217, "phrase": "systematic_framework"}, {"score": 0.0021049977753042253, "phrase": "systematic_way"}], "paper_keywords": ["GWG (game world graph)", " Software architecture", " Computer game"], "paper_abstract": "The game world graph (GWG) framework is a taxonomy for analyzing and classifying computer game architectures. This article presents a systematic review of game architectures using the GWG framework. The review validates the usefulness of the GWG framework through classifying game architectures described in the literature into distinct categories according to the framework. The major contribution of the paper is a state-of-the-art presentation of 40 different game architectures, which covers architectures for all kinds of games from single player games to massively multiplayer online games (MMOGs). Previous reviews of game architectures have focused on a narrower selection of games such as only networked games, MMOGs or similar. Further, none of the previous reviews has used a systematic framework for analyzing the characteristics of game architectures. Using the framework, we can identify similarities and differences of the 40 game architectures in a systematic way. Finally, the paper outlines the evolution of the game architectures from the perspective of the GWG framework.", "paper_title": "From 101 to nnn: a review and a classification of computer game architectures", "paper_id": "WOS:000320379500002"}