{"auto_keywords": [{"score": 0.04397860317645382, "phrase": "multi-product_job_shop"}, {"score": 0.00481495049065317, "phrase": "imprecise_activity_specification"}, {"score": 0.004775531918452571, "phrase": "purpose_-_the_purpose"}, {"score": 0.004489952932659799, "phrase": "knowledge-based_and_constraint_programming"}, {"score": 0.004398589723893764, "phrase": "production_planning"}, {"score": 0.004326833704481825, "phrase": "decision-making_software_supporting_scheduling"}, {"score": 0.004001593118269276, "phrase": "industrial_processes"}, {"score": 0.0039362878637371574, "phrase": "different_products"}, {"score": 0.003625347557965931, "phrase": "production_activities"}, {"score": 0.0034364867143322304, "phrase": "useful_information"}, {"score": 0.003352658916650986, "phrase": "fuzzy_and_crispy-like_schedule"}, {"score": 0.0031649018957020337, "phrase": "knowledge-based_and_cp-driven_methodology"}, {"score": 0.002999955539996569, "phrase": "typical_decision_problems"}, {"score": 0.002938821840519756, "phrase": "project-driven_production_flow_management"}, {"score": 0.0028553159147435424, "phrase": "order_manufacturing"}, {"score": 0.002673223453963085, "phrase": "fuzzy_gantt_diagrams"}, {"score": 0.002629539710839523, "phrase": "admissible_schedule"}, {"score": 0.002607965563121546, "phrase": "production_orders"}, {"score": 0.0025027144548626975, "phrase": "paper's_contribution"}, {"score": 0.002323826502178581, "phrase": "proposed_approach"}, {"score": 0.0021311850321045767, "phrase": "unified_form"}], "paper_keywords": ["Cybernetics", " Production scheduling", " Constraint handling", " Decision making", " Fuzzy control", " Knowledge engineering"], "paper_abstract": "Purpose - The purpose of this paper is to present research in the area of the applications of knowledge-based and constraint programming (CP)-driven methodology in production planning and development of decision-making software supporting scheduling of multi-robot in a multi-product job shop, taking into account imprecise (fuzzy) activity specification, and resource sharing by some industrial processes that simultaneously produce different products. Design/methodollogy/approach - Applications of the knowledge-based, logic-algebraic and CP-driven approach for multi-robot task allocation problem and generating of fuzzy plan/schedule of production activities for a given period of time. Findings - This paper illustrates the useful information that can be obtained from fuzzy and crispy-like schedule describing production activities in a multi-product job shop. Research limitation/impllications - The use of knowledge-based and CP-driven methodology for production planning in a multi-product job shop was a very effective method dedicated to solve typical decision problems in the area of project-driven production flow management applied in make-to-order manufacturing. Practical implications - The methodology discussed in the paper can be used to design fuzzy Gantt diagrams, which define admissible schedule of production orders for a given period of time. Originality/value - The paper's contribution covers various issues of decision making while employing the knowledge-and CP-based framework. The proposed approach provides the framework allowing one to take into account distinct (pointed), and imprecise (fuzzy) data, in a unified way and treat it in a unified form of a discrete, constraint satisfaction problem.", "paper_title": "Production flow prototyping subject to imprecise activity specification", "paper_id": "WOS:000270378700018"}