{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-issue_negotiation"}, {"score": 0.0047409388179452255, "phrase": "multi-issue_negotiations"}, {"score": 0.004456044928556639, "phrase": "latter_case"}, {"score": 0.004123781267600542, "phrase": "issue_dependencies"}, {"score": 0.0038959121068990517, "phrase": "computational_cost"}, {"score": 0.0037965243835456214, "phrase": "interdependent_issues"}, {"score": 0.003623949225126944, "phrase": "independent_issues"}, {"score": 0.003441352119167824, "phrase": "increased_complexity"}, {"score": 0.003234299589505403, "phrase": "negotiation_setting"}, {"score": 0.0030872017736888113, "phrase": "alternative_approach"}, {"score": 0.0030239842475439814, "phrase": "weighted_approximation-technique"}, {"score": 0.0029620573986902416, "phrase": "utility_space"}, {"score": 0.0024586427394152196, "phrase": "approximated_utility_structure"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": [""], "paper_abstract": "In multi-issue negotiations, issues may be negotiated independently or not. In the latter case, the utility associated with one issue depends on the value of another. These issue dependencies give rise to more complex, nonlinear utility spaces. As a consequence, the computational cost and complexity of negotiating interdependent issues is increased significantly compared to the case of independent issues. Several techniques have been proposed to deal with this increased complexity, including, for example, introducing a mediator in the negotiation setting. In this paper, we propose an alternative approach based on a weighted approximation-technique to simplify the utility space. We show that given certain natural assumptions about the outcome of negotiation the application of this technique results in an outcome that closely matches with the outcome based on the original, interdependent utility structure. Moreover, using the approximated utility structure, each of the issues can be negotiated independently which ensures that the negotiation is computationally tractable. The approach is illustrated by applying and testing it in a case study.", "paper_title": "Eliminating interdependencies between issues for multi-issue negotiation", "paper_id": "WOS:000240907300022"}