{"auto_keywords": [{"score": 0.04069837343856593, "phrase": "rational_curves"}, {"score": 0.035849860700508135, "phrase": "base_curve"}, {"score": 0.00481495049065317, "phrase": "algebraic_curves"}, {"score": 0.004526503177267299, "phrase": "irreducible_algebraic_affine_plane_curve"}, {"score": 0.00445712058827745, "phrase": "trivial_cases"}, {"score": 0.0037749456215035856, "phrase": "reducible_conchoids"}, {"score": 0.0037170399498025215, "phrase": "always_their_two_components"}, {"score": 0.003534889186471058, "phrase": "conchoid_component"}, {"score": 0.0034806529881619454, "phrase": "rational_curve"}, {"score": 0.003005039427642664, "phrase": "affirmative_case"}, {"score": 0.002891032998395276, "phrase": "proper_parametrization"}, {"score": 0.002728059572916527, "phrase": "previous_computation"}, {"score": 0.0025643086619242814, "phrase": "irreducible_conics"}, {"score": 0.0023550410480905727, "phrase": "lima_double_dagger_ons"}, {"score": 0.0023369149820331165, "phrase": "pascal"}, {"score": 0.002265638487492082, "phrase": "nicomedes"}], "paper_keywords": ["Conchoid curve", " Rational parametrization"], "paper_abstract": "We study the rationality of each of the components of the conchoid to an irreducible algebraic affine plane curve, excluding the trivial cases of the lines through the focus and the circle centered at the focus and radius the distance involved in the conchoid. We prove that conchoids having all their components rational can only be generated by rational curves. Moreover, we show that reducible conchoids to rational curves have always their two components rational. In addition, we prove that the rationality of the conchoid component, to a rational curve, does depend on the base curve and on the focus but not on the distance. As a consequence, we provide an algorithm that analyzes the rationality of all the components of the conchoid and, in the affirmative case, parametrizes them. The algorithm only uses a proper parametrization of the base curve and the focus and, hence, does not require the previous computation of the conchoid. As a corollary, we show that the conchoid to the irreducible conics, with conchoid-focus on the conic, are rational and we give parametrizations. In particular we parametrize the Lima double dagger ons of Pascal. We also parametrize the conchoids of Nicomedes. Finally, we show how to find the foci from where the conchoid is rational or with two rational components.", "paper_title": "Rational parametrization of conchoids to algebraic curves", "paper_id": "WOS:000278614200002"}