{"auto_keywords": [{"score": 0.046626974785833435, "phrase": "mixing_matrix"}, {"score": 0.017070998109782784, "phrase": "npcm"}, {"score": 0.015783419981503434, "phrase": "objective_function"}, {"score": 0.009275367542276619, "phrase": "source_number"}, {"score": 0.00481495049065317, "phrase": "sparse_mixtures"}, {"score": 0.004770211811866158, "phrase": "unknown_number"}, {"score": 0.00466016686289196, "phrase": "blind_source_separation"}, {"score": 0.0039024014688338964, "phrase": "new_method"}, {"score": 0.0035542408902458677, "phrase": "major_advantage"}, {"score": 0.0031770714776989282, "phrase": "nonlinear_projection"}, {"score": 0.002787181295054319, "phrase": "masking_operation"}, {"score": 0.002410942838102255, "phrase": "masking_procedure"}, {"score": 0.0023551955270737215, "phrase": "small_and_useless_local_maxima"}, {"score": 0.002154848229269863, "phrase": "pso"}, {"score": 0.0021049977753042253, "phrase": "comparative_experimental_results"}], "paper_keywords": ["Blind source separation", " particle swarm optimization", " sparse component analysis"], "paper_abstract": "In blind source separation, many methods have been proposed to estimate the mixing matrix by exploiting sparsity. However, they often need to know the source number a priori, which is very inconvenient in practice. In this paper, a new method, namely nonlinear projection and column masking (NPCM), is proposed to estimate the mixing matrix. A major advantage of NPCM is that it does not need any knowledge of the source number. In NPCM, the objective function is based on a nonlinear projection and its maxima just correspond to the columns of the mixing matrix. Thus a column can be estimated first by locating a maximum and then deflated by a masking operation. This procedure is repeated until the evaluation of the objective function decreases to zero dramatically. Thus the mixing matrix and the number of sources are estimated simultaneously. Because the masking procedure may result in some small and useless local maxima, particle swarm optimization (PSO) is introduced to optimize the objective function. Feasibility and efficiency of PSO are also discussed. Comparative experimental results show the efficiency of NPCM, especially in the cases where the number of sources is unknown and the sources are relatively less sparse.", "paper_title": "Mixing Matrix Estimation from Sparse Mixtures with Unknown Number of Sources", "paper_id": "WOS:000287097500004"}