{"auto_keywords": [{"score": 0.04201348416392754, "phrase": "pang_et_al"}, {"score": 0.015603900522133745, "phrase": "privacy_issues"}, {"score": 0.011429838871837987, "phrase": "implicit_identifiers"}, {"score": 0.008615777522070706, "phrase": "user_anonymity"}, {"score": 0.004708152527097594, "phrase": "serious_concern"}, {"score": 0.0046382670208947605, "phrase": "prior_research"}, {"score": 0.00453537012358554, "phrase": "pseudonym_techniques"}, {"score": 0.00441835720100232, "phrase": "mac"}, {"score": 0.0040997480534580065, "phrase": "always_changing_identifiers"}, {"score": 0.0036507498735369576, "phrase": "user_privacy"}, {"score": 0.003543059748318891, "phrase": "'s_method"}, {"score": 0.003287482882222731, "phrase": "user_behavior_patterns"}, {"score": 0.003178550413662537, "phrase": "classification_techniques"}, {"score": 0.002788066194685293, "phrase": "better_classification_rates"}, {"score": 0.0025868090345615197, "phrase": "implicit_identifiers_based_identification"}, {"score": 0.002463830258460528, "phrase": "bogus_traffic_injection"}, {"score": 0.002427177130359851, "phrase": "eight_different_methods"}, {"score": 0.002391067964886602, "phrase": "bogus_data"}, {"score": 0.0023466842270226888, "phrase": "original_traffic"}, {"score": 0.002311769781106355, "phrase": "users'_behavior_patterns"}, {"score": 0.002193600680263771, "phrase": "user_identification_rates"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["privacy", " network security", " user identification", " anonymization", " 802", " 11 networks"], "paper_abstract": "Privacy issues have been a serious concern for 802.11 Wireless LAN users. Prior research on privacy issues usually focuses on pseudonym techniques, where the unique, consistent explicit identifiers such as MAC addresses from the users can be frequently changed, and thus it is challenging to track users through those always changing identifiers. However, recent research done by Pang et al. (Pang et al. Proceedings of the 13th Annual ACM International Conference on Mobile Computing and Networking, 1997; 99110) has demonstrated that pseudonyms are not adequate to protect user privacy. The key idea of Pang et al.'s method is to locate implicit identifiers (e.g., IP addresses and port numbers a user frequently visits), build user behavior patterns based on these implicit identifiers, and then apply classification techniques to identify users. In this paper, we first propose a new 802.11 user identification approach through enhanced feature selection and generation for building more accurate user behavior patterns. Our simulation results on 9.27 GB SIGCOMM 2004 wireless data sets demonstrate that our method can achieve better classification rates compared with Pang et al.'s method. Then, we further study how to provide user anonymity, even if implicit identifiers based identification is applied, by introducing a set of 802.11 user anonymization approaches based on bogus traffic injection. We propose eight different methods to artificially generate bogus data and inject them into original traffic, and thus users' behavior patterns are disturbed. Our simulation results on the same SIGCOMM 2004 data sets demonstrate that our anonymization methods can efficiently decrease user identification rates and hence improve user anonymity. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "User identification and anonymization in 802.11 wireless LANs", "paper_id": "WOS:000298481700003"}