{"auto_keywords": [{"score": 0.04164969194087403, "phrase": "exploit_servers"}, {"score": 0.00927976633225404, "phrase": "exploit_server"}, {"score": 0.007560104588218877, "phrase": "long-lived_operations"}, {"score": 0.00481495049065317, "phrase": "malicia"}, {"score": 0.0047026237903774895, "phrase": "drive-by_download_operations"}, {"score": 0.004577440795549049, "phrase": "preferred_distribution_vector"}, {"score": 0.00413684709497912, "phrase": "larger_operation"}, {"score": 0.003626626504149897, "phrase": "grouping_servers"}, {"score": 0.0036022217019257598, "phrase": "similar_configurations"}, {"score": 0.0035062280202127136, "phrase": "individual_exploit_servers"}, {"score": 0.0034708912871162464, "phrase": "median_lifetime"}, {"score": 0.003032295420569351, "phrase": "multiple_malware_families"}, {"score": 0.002951444412262927, "phrase": "affiliate_programs"}, {"score": 0.0027867024825194834, "phrase": "exploit_polymorphism_problem"}, {"score": 0.0027492917990724467, "phrase": "repacking_rate"}, {"score": 0.0027307746993761035, "phrase": "different_exploit_types"}, {"score": 0.0026045914281028473, "phrase": "abuse_reporting_process"}, {"score": 0.00257831812581194, "phrase": "abuse_reports"}, {"score": 0.0021700361584578633, "phrase": "malicia_dataset"}], "paper_keywords": ["Drive-by download operations", " Malicia dataset", " Malware distribution", " Cybercrime"], "paper_abstract": "Drive-by downloads are the preferred distribution vector for many malware families. In the drive-by ecosystem, many exploit servers run the same exploit kit and it is a challenge understanding whether the exploit server is part of a larger operation. In this paper, we propose a technique to identify exploit servers managed by the same organization. We collect over time how exploit servers are configured, which exploits they use, and what malware they distribute, grouping servers with similar configurations into operations. Our operational analysis reveals that although individual exploit servers have a median lifetime of 16 h, long-lived operations exist that operate for several months. To sustain long-lived operations, miscreants are turning to the cloud, with 60 % of the exploit servers hosted by specialized cloud hosting services. We also observe operations that distribute multiple malware families and that pay-per-install affiliate programs are managing exploit servers for their affiliates to convert traffic into installations. Furthermore, we analyze the exploit polymorphism problem, measuring the repacking rate for different exploit types. To understand how difficult is to takedown exploit servers, we analyze the abuse reporting process and issue abuse reports for 19 long-lived servers. We describe the interaction with ISPs and hosting providers and monitor the result of the report. We find that 61 % of the reports are not even acknowledged. On average, an exploit server still lives for 4.3 days after a report. Finally, we detail the Malicia dataset we have collected and are making available to other researchers.", "paper_title": "The MALICIA dataset: identification and analysis of drive-by download operations", "paper_id": "WOS:000347729500002"}