{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "temporal_reasoning_system"}, {"score": 0.0399657996805008, "phrase": "temporal_relations"}, {"score": 0.013413204426327542, "phrase": "twenty_discharge_summaries"}, {"score": 0.01193715361873687, "phrase": "medical_events"}, {"score": 0.00886574358744859, "phrase": "temporal_questions"}, {"score": 0.004780780407878596, "phrase": "processing_clinical_discharge_summaries"}, {"score": 0.004499910169464113, "phrase": "temporal_information"}, {"score": 0.004467965784278827, "phrase": "clinical_text"}, {"score": 0.004265760046406154, "phrase": "clinical_discharge_summaries"}, {"score": 0.004205395707787349, "phrase": "six_physicians"}, {"score": 0.004175533280178052, "phrase": "biomedical_informatics_training"}, {"score": 0.004131135118662576, "phrase": "domain_experts"}, {"score": 0.0034444213065548688, "phrase": "expert-generated_results"}, {"score": 0.0032302647179383915, "phrase": "system's_accuracy"}, {"score": 0.003195885276330599, "phrase": "time-oriented_clinical_questions"}, {"score": 0.003128216758835217, "phrase": "five_to_ten_clinically_plausible_temporal_questions"}, {"score": 0.002954669496511141, "phrase": "gold_standard"}, {"score": 0.002861302930564756, "phrase": "system's_output"}, {"score": 0.0028006988338192375, "phrase": "generated_temporal_relations"}, {"score": 0.0027610089418453614, "phrase": "clinically_important_relations"}, {"score": 0.0021049977753042253, "phrase": "simple_temporal_questions"}], "paper_keywords": [""], "paper_abstract": "Context: TimeText is a temporal reasoning system designed to represent, extract, and reason about temporal information in clinical text. Objective: To measure the accuracy of the TimeText for processing clinical discharge summaries. Design: Six physicians with biomedical informatics training served as domain experts. Twenty discharge summaries were randomly selected for the evaluation. For each of the first 14 reports, 5 to 8 clinically important medical events were chosen. The temporal reasoning system generated temporal relations about the endpoints (start or finish) of pairs of medical events. Two experts (subjects) manually generated temporal relations for these medical events. The system and expert-generated results were assessed by four other experts (raters). All of the twenty discharge summaries were used to assess the system's accuracy in answering time-oriented clinical questions. For each report, five to ten clinically plausible temporal questions about events were generated. Two experts generated answers to the questions to serve as the gold standard. We wrote queries to retrieve answers from system's output. Measurements: Correctness of generated temporal relations, recall of clinically important relations, and accuracy in answering temporal questions. Results: The raters determined that 97% of subjects' 295 generated temporal relations were correct and that 96.5% of the system's 995 generated temporal relations were correct. The system captured 79% of 307 temporal relations determined to be clinically important by the subjects and raters. The system answered 84% of the temporal questions correctly. Conclusion: The system encoded the majority of information identified by experts, and was able to answer simple temporal questions.", "paper_title": "The evaluation of a temporal reasoning system in processing clinical discharge summaries", "paper_id": "WOS:000252312500014"}