{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "single_and_time-sharing_tasks"}, {"score": 0.004663533386096864, "phrase": "process_plants"}, {"score": 0.004537525607322823, "phrase": "dire_consequences"}, {"score": 0.004354841111644036, "phrase": "operator_behavior"}, {"score": 0.00419861271409079, "phrase": "task_performance"}, {"score": 0.0039027036493682887, "phrase": "important_factors"}, {"score": 0.003867206750827, "phrase": "multi-task_situations"}, {"score": 0.003711409222544974, "phrase": "multiple_tasks"}, {"score": 0.0032211117623834828, "phrase": "single_and_dual_control_tasks"}, {"score": 0.0031339552246625463, "phrase": "multiple_task_priority"}, {"score": 0.003105428650735113, "phrase": "independent_variables"}, {"score": 0.0029128614098881253, "phrase": "better_performance"}, {"score": 0.0023927516438886445, "phrase": "significantly_higher_workload"}, {"score": 0.0022136780933978612, "phrase": "training_programs"}, {"score": 0.002163600705898299, "phrase": "time-critical_operations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Complex control", " Hill-climbing", " Monochron/polychron", " Time use", " Control strategy", " Performance", " Task characteristics"], "paper_abstract": "Human errors in aviation, process plants and other critical industries can result in dire consequences and hence it is essential to understand the operator behavior and task characteristics in order to improve task performance and safety. The time available and how it is used by the operator are important factors in multi-task situations. Polychrons are people, who favor doing multiple tasks at the same time, while monochrons prefer doing tasks in series. In this study, the strategy, performance and workload of monochrons and polychrons were evaluated in a single and dual control tasks. The task difficulty and multiple task priority were independent variables. Results indicated that polychrons switched between two tasks more than monochrons and achieved better performance when the tasks were equally important and difficult. When the priority between the tasks was different, rnonochrons changed their emphasis to the more important task even though polychrons did not change their strategy as dramatically as the monochrons. In addition, monochrons indicated significantly higher workload and difficulty than polychrons. Results of this study can be important for the development of training programs of personnel involved in time-critical operations. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Time use behavior in single and time-sharing tasks", "paper_id": "WOS:000303303900002"}