{"auto_keywords": [{"score": 0.03907538912785229, "phrase": "segment_glands"}, {"score": 0.03777286146528922, "phrase": "spatial_arrangement"}, {"score": 0.03673828024179948, "phrase": "segmented_region"}, {"score": 0.0347503086063342, "phrase": "lumen-based_method"}, {"score": 0.00481495049065317, "phrase": "prostate_cancer_grading"}, {"score": 0.004634117581810466, "phrase": "tissue_image_grading"}, {"score": 0.0045317702763072445, "phrase": "prostate_cancer_diagnosis"}, {"score": 0.004417554571046256, "phrase": "gland_structure"}, {"score": 0.004361526027730043, "phrase": "gleason_grade"}, {"score": 0.0043199694330708464, "phrase": "tissue_image"}, {"score": 0.004265173275117678, "phrase": "grading_scheme"}, {"score": 0.0038880683136866268, "phrase": "novel_method"}, {"score": 0.0037419150096899127, "phrase": "graph_theory_techniques"}, {"score": 0.003367611042980526, "phrase": "fusion_method"}, {"score": 0.0033248546272754936, "phrase": "nuclei-based_method"}, {"score": 0.002797922160172791, "phrase": "normalized_cut_method"}, {"score": 0.0027447761472348614, "phrase": "different_components"}, {"score": 0.0025258696565944, "phrase": "multiple_lumina"}, {"score": 0.002485813299166851, "phrase": "important_contribution"}, {"score": 0.0022802093550930245, "phrase": "closed_chain_structure"}, {"score": 0.0022584385508256566, "phrase": "gland_boundary"}, {"score": 0.0021049977753042253, "phrase": "single_gland-score_value"}], "paper_keywords": ["Gland segmentation", " Gleason grading", " lumen", " normalized cut", " nuclei", " prostate cancer", " stroma"], "paper_abstract": "Tissue image grading is one of the most important steps in prostate cancer diagnosis, where the pathologist relies on the gland structure to assign a Gleason grade to the tissue image. In this grading scheme, the discrimination between grade 3 and grade 4 is the most difficult, and receives the most attention from researchers. In this study, we propose a novel method (called nuclei-based method) that 1) utilizes graph theory techniques to segment glands and 2) computes a gland-score (based on the spatial arrangement of nuclei) to estimate how similar a segmented region is to a gland. Next, we create a fusion method by combining this nuclei-based method with the lumen-based method presented in our previous work to improve the performance of grade 3 versus grade 4 classification problem (the accuracy is now improved to 87.3% compared to 81.1% of the lumen-based method alone). To segment glands, we build a graph of nuclei and lumina in the image, and use the normalized cut method to partition the graph into different components, each corresponding to a gland. Unlike most state-of-the-art lumen-based gland segmentation method, the nuclei-based method is able to segment glands without lumen or glands with multiple lumina. Moreover, another important contribution in this research is the development of a set of measures to exploit the difference in nuclei spatial arrangement between grade 3 images (where nuclei form closed chain structure on the gland boundary) and grade 4 image (where nuclei distribute more randomly in the gland). These measures are combined to generate a single gland-score value, which estimates how similar a segmented region (which is a set of nuclei and lumina) is to a gland.", "paper_title": "Prostate Cancer Grading: Use of Graph Cut and Spatial Arrangement of Nuclei", "paper_id": "WOS:000345907400004"}