{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_recognition"}, {"score": 0.047528888441075466, "phrase": "possible_object_locations"}, {"score": 0.012431072183537445, "phrase": "exhaustive_search"}, {"score": 0.004342430078306461, "phrase": "selective_search"}, {"score": 0.003939980614608309, "phrase": "image_structure"}, {"score": 0.003531474887552889, "phrase": "single_technique"}, {"score": 0.0032629585038738856, "phrase": "complementary_image_partitionings"}, {"score": 0.0029965060407413898, "phrase": "small_set"}, {"score": 0.002669259222649505, "phrase": "reduced_number"}, {"score": 0.0024963543716522087, "phrase": "stronger_machine_learning_techniques"}, {"score": 0.002466139325703204, "phrase": "stronger_appearance_models"}, {"score": 0.0021049977753042253, "phrase": "selective_search_software"}], "paper_keywords": [""], "paper_abstract": "This paper addresses the problem of generating possible object locations for use in object recognition. We introduce selective search which combines the strength of both an exhaustive search and segmentation. Like segmentation, we use the image structure to guide our sampling process. Like exhaustive search, we aim to capture all possible object locations. Instead of a single technique to generate possible object locations, we diversify our search and use a variety of complementary image partitionings to deal with as many image conditions as possible. Our selective search results in a small set of data-driven, class-independent, high quality locations, yielding 99% recall and a Mean Average Best Overlap of 0.879 at 10,097 locations. The reduced number of locations compared to an exhaustive search enables the use of stronger machine learning techniques and stronger appearance models for object recognition. In this paper we show that our selective search enables the use of the powerful Bag-of-Words model for recognition. The selective search software is made publicly available (Software: http://disi.unitn.it/similar to uijlings/SelectiveSearch.html).", "paper_title": "Selective Search for Object Recognition", "paper_id": "WOS:000322251800003"}