{"auto_keywords": [{"score": 0.04805541544871024, "phrase": "planar_diffuse_interface"}, {"score": 0.043460604923796865, "phrase": "image_potential"}, {"score": 0.025052559303894505, "phrase": "transition_layer"}, {"score": 0.00481495049065317, "phrase": "coulomb_green's"}, {"score": 0.0037159680715717056, "phrase": "previous_work"}, {"score": 0.0035369291417564606, "phrase": "quasi-harmonic_interface_model"}, {"score": 0.0033664873319204027, "phrase": "green's_function"}, {"score": 0.0031068064097811844, "phrase": "special_function"}, {"score": 0.00292132285746384, "phrase": "green"}, {"score": 0.002849442549612025, "phrase": "general_diffuse_interface_models"}, {"score": 0.0026953359825383624, "phrase": "transmission_lines"}, {"score": 0.002323826502178581, "phrase": "numerical_experiments"}, {"score": 0.002239225269052105, "phrase": "quasi-harmonic_diffuse_interface_model"}, {"score": 0.002157697367447098, "phrase": "semi-analytical_numerical_method"}], "paper_keywords": ["Green's function", " Image potential", " Self-polarization potential", " Diffuse interface", " Screened Poisson equation"], "paper_abstract": "In this work, we revisit the problem of calculating the Coulomb Green's function and the image potential near a planar diffuse interface in which the dielectric constant changes continuously in a transition layer between two dielectrics. In particular, we extend previous work in two ways. Firstly, a new diffuse interface model, termed the quasi-harmonic interface model, is constructed, for which analytical calculation of Green's function and the image potential is easy to achieve and need not use any special function. Secondly and also more importantly, a robust semi-analytical numerical procedure to build Green's functions for general diffuse interface models is developed in analogy to the analysis of transmission lines, thus opening the way to treat in principle any well-behaving and physically plausible dielectric permittivity profile for the transition layer. Numerical experiments are given to illustrate the quasi-harmonic diffuse interface model, and to validate the semi-analytical numerical method particularly by demonstrating its convergence as the number of the sublayers used to partition the transition layer goes to infinity. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Coulomb Green's function and image potential near a planar diffuse interface, revisited", "paper_id": "WOS:000311134400008"}