{"auto_keywords": [{"score": 0.04955461236891121, "phrase": "extended_possibilistic_truth_values"}, {"score": 0.010612387000973441, "phrase": "disjunctive_aggregation"}, {"score": 0.004384504920139083, "phrase": "truth_value"}, {"score": 0.003883850058095871, "phrase": "database_instance"}, {"score": 0.003820144626025562, "phrase": "query_condition"}, {"score": 0.00373682045166829, "phrase": "flexible_query"}, {"score": 0.0035953368057880593, "phrase": "different_importance"}, {"score": 0.003555902292752528, "phrase": "weighted_aggregation"}, {"score": 0.0030135741897058844, "phrase": "different_aggregation_types"}, {"score": 0.0029641011108505785, "phrase": "different_approach"}, {"score": 0.002931569771634119, "phrase": "special_care"}, {"score": 0.00241658945942583, "phrase": "basic_propel-ties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy connectives and aggregation operators", " Flexible querying", " Extended possibilistic truth values"], "paper_abstract": "Extended possibilistic truth values are a flexible means to model the certainly or uncertainty about the truth value of a proposition. With respect to flexible database querying, they are suited to express the extent to which a database instance satisfies a query condition. Since a flexible query can impose several conditions, each with different importance, weighted aggregation is necessary. In this paper, weighted aggregation of extended possibilistic truth values is presented. The impact of the weights on extended possibilistic truth values in both conjunctive and disjunctive aggregation is handled. It is illustrated that the different aggregation types require a different approach. Special care is given to the case where both conjunctive and disjunctive aggregation are mixed together. It is shown that the weights will have to be propagated throughout the calculations, but that this can cause basic propel-ties, like associativity, to get lost. The problems that can arise are illustrated and solutions are proposed. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Impact of weights on conjunctive and disjunctive aggregation of extended possibilistic truth values", "paper_id": "WOS:000267415800003"}