{"auto_keywords": [{"score": 0.036726151122533655, "phrase": "ro_problems"}, {"score": 0.0047515546458205046, "phrase": "software_development_process"}, {"score": 0.004688989566904871, "phrase": "requirements_engineering"}, {"score": 0.0044272138900038095, "phrase": "software_developers"}, {"score": 0.004330450801016359, "phrase": "software_development"}, {"score": 0.003775803846431323, "phrase": "exploratory_case_study"}, {"score": 0.003742554019950264, "phrase": "requirements-oriented_problems"}, {"score": 0.00344087639309216, "phrase": "varying_severity"}, {"score": 0.0029733865110222785, "phrase": "software-expert_opinion"}, {"score": 0.002934166052954463, "phrase": "large_insurance_company"}, {"score": 0.0028195727965553367, "phrase": "relatively_few_ro_problems"}, {"score": 0.0025465957200502404, "phrase": "quality_requirements"}, {"score": 0.0025241429061867633, "phrase": "different_stakeholders"}, {"score": 0.0024688710065898646, "phrase": "quality_scenarios"}, {"score": 0.002361923085067681, "phrase": "architecture_mapping"}, {"score": 0.0021809360405764763, "phrase": "crown"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["requirements engineering", " software architecture", " software quality", " process improvement", " empirical study"], "paper_abstract": "Requirements permeate many parts of the software development process outside the requirements engineering (RE) process. It is thus important to determine whether software developers in these other areas of software development face any requirements-oriented (RO) problems in carrying out their tasks. Feedback so obtained can be invaluable for improving both requirements and RE technologies. In this paper, we describe an exploratory case study of requirements-oriented problems experienced by 16 architecting teams designing the same banking application. The study found that there were several different types of RO problems, of varying severity, which the architects faced in using the given requirements; those architects with RE background also faced RO problems; and about a third of all problems were RO problems. There was much concurrence of our findings with software-expert opinion from a large insurance company. There were also areas where there were relatively few RO problems. The paper also describes some implications of the findings for the RE field, particularly in the areas of. expression of quality requirements for different stakeholders; empirical studies on quality scenarios; tighter integration of RE and software architecting processes; and requirements to architecture mapping. There are opportunities for further research based on two emergent hypotheses which are also described in this paper. Crown copyright (c) 2007 Published by Elsevier B.V. All rights reserved.", "paper_title": "Architecting-problems rooted in requirements", "paper_id": "WOS:000252196700008"}