{"auto_keywords": [{"score": 0.038354821270219504, "phrase": "medical_secretaries"}, {"score": 0.00481495049065317, "phrase": "boundary-object"}, {"score": 0.004702168843383725, "phrase": "medical_secretaries'_care"}, {"score": 0.0046389067165295466, "phrase": "healthcare_infrastructures"}, {"score": 0.004592016716046632, "phrase": "health_care_it"}, {"score": 0.00451491283266524, "phrase": "stand-alone_systems"}, {"score": 0.0040648241451154525, "phrase": "health_care"}, {"score": 0.003772793879444995, "phrase": "health_care_it."}, {"score": 0.003671865026158296, "phrase": "cooperative_work"}, {"score": 0.003525493807130663, "phrase": "comprehensive_electronic_health_record"}, {"score": 0.0030678912980325337, "phrase": "medical_secretaries'_core_task"}, {"score": 0.003006087482938274, "phrase": "patient_records"}, {"score": 0.002799388549023265, "phrase": "information_gatekeeping"}, {"score": 0.0027804579695873827, "phrase": "articulation_work"}, {"score": 0.002696837864985637, "phrase": "departments'_work_arrangements"}, {"score": 0.0026514708899935333, "phrase": "ehr_implementation"}, {"score": 0.002485911017095097, "phrase": "task_drift"}, {"score": 0.0024029583021102255, "phrase": "health_informatics"}, {"score": 0.00238670283618749, "phrase": "cscw"}, {"score": 0.002185093843598708, "phrase": "ehr"}, {"score": 0.002162951519368368, "phrase": "boundary_object"}, {"score": 0.0021049977753042253, "phrase": "hitherto_relative_invisibility"}], "paper_keywords": ["boundary objects", " cooperative work", " electronic health records", " gender", " health care", " medical secretaries", " invisible work", " non-clinical occupations"], "paper_abstract": "As health care IT gradually develops from being stand-alone systems towards integrated infrastructures, the work of various groups, occupations and units is likely to become more tightly integrated and dependent upon each other. Hitherto, the focus within health care has been upon the two most prominent professions, physicians and nurses, but most likely other non-clinical occupations will become relevant for the design and implementation of health care IT. In this paper, we describe the cooperative work of medical secretaries at two hospital departments, based on a study evaluating a comprehensive electronic health record (EHR) shortly after implementation. The subset of data on medical secretaries includes observation (11 hours), interviews (three individual and one group) and survey data (31 of 250 respondents were medical secretaries). We depict medical secretaries' core task as to take care of patient records by ensuring that information is complete, up to date, and correctly coded, while they also carry out information gatekeeping and articulation work. The importance of these tasks to the departments' work arrangements was highlighted by the EHR implementation, which also coupled the work of medical secretaries more tightly to that of other staff, and led to task drift among professions. Medical secretaries have been relatively invisible to health informatics and CSCW, and we propose the term 'boundary-object trimming' to foreground and conceptualize one core characteristic of their work: maintenance and optimization of the EHR as a boundary object. Finally, we reflect upon the hitherto relative invisibility of medical secretaries which may be related to issues of gender and power.", "paper_title": "Boundary-Object Trimming: On the Invisibility of Medical Secretaries' Care of Records in Healthcare Infrastructures", "paper_id": "WOS:000330730700004"}