{"auto_keywords": [{"score": 0.044855044727901076, "phrase": "target_person"}, {"score": 0.015719716506582538, "phrase": "computer_competence"}, {"score": 0.004659192888931046, "phrase": "negative_stereotype"}, {"score": 0.004018087343963485, "phrase": "complex_computer_task"}, {"score": 0.0037621210719690594, "phrase": "limited_amount"}, {"score": 0.003464890914694523, "phrase": "required_time_period"}, {"score": 0.003394314924677555, "phrase": "person's_performance"}, {"score": 0.0031518989079229714, "phrase": "skill_attribution"}, {"score": 0.003074991770768925, "phrase": "general_computer_competence"}, {"score": 0.002797121441432477, "phrase": "direct_evaluation"}, {"score": 0.002762774046280398, "phrase": "target_persons"}, {"score": 0.0027176309244222, "phrase": "causal_attribution"}, {"score": 0.0026622351303038885, "phrase": "systematic_gender-related_biases"}, {"score": 0.002304754792740636, "phrase": "computer-related_task"}, {"score": 0.0022117133940361025, "phrase": "identically_scripted_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Gender studies", " Media in education", " Computer competence", " Attribution of success", " Self-evaluation"], "paper_abstract": "Is the negative stereotype of women with regard to computer competence still exerting power in our society? In this study, 206 participants observed a target person (either a woman or a man) on a video who was about to solve a complex computer task. Participants had to estimate whether the target person was successful on this task in a limited amount of time. After they had received the information that the target person had solved the task successfully in the required time period, and that the person's performance was above average, they were asked to provide a reason for the success (luck vs. skill attribution) and to evaluate the general computer competence of the target. Then, participants had to evaluate their own (hypothetical) computer competence in comparison to the target. Results suggest that for the direct evaluation of the target persons and for the causal attribution of success, no systematic gender-related biases occurred. In the self-ratings of participants; however, findings showed that (a) women judged their computer competence to be lower than did men, and (b) both women and men judged their own hypothetical performance in the computer-related task to be relatively higher when comparing it to the identically scripted performance of a woman vs. a man. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "(Self-)Evaluation of computer competence: How gender matters", "paper_id": "WOS:000263921400018"}