{"auto_keywords": [{"score": 0.04303411303017019, "phrase": "malicious_nodes"}, {"score": 0.03865676418691567, "phrase": "sieve"}, {"score": 0.023226900844196992, "phrase": "rateless_codes"}, {"score": 0.02064065365522186, "phrase": "coded_blocks"}, {"score": 0.009924593275170118, "phrase": "manet"}, {"score": 0.004474856549909555, "phrase": "data_chunks"}, {"score": 0.0040622852274783275, "phrase": "pollution_attack"}, {"score": 0.003887496109332722, "phrase": "original_chunk"}, {"score": 0.0037530749925749245, "phrase": "chunk_providers"}, {"score": 0.0030118058266380503, "phrase": "chunk_integrity"}, {"score": 0.002994178996584381, "phrase": "belief_propagation"}, {"score": 0.0028317705704546123, "phrase": "factor_graph"}, {"score": 0.0026781477395106993, "phrase": "belief_propagation_algorithm"}, {"score": 0.002555247330102505, "phrase": "detailed_simulations"}, {"score": 0.002409503258044183, "phrase": "topological_properties"}, {"score": 0.002388368786294332, "phrase": "factor_graph_impacts"}, {"score": 0.0022787359717772976, "phrase": "identification_accuracy"}, {"score": 0.0022455164874830777, "phrase": "interesting_trade-off"}, {"score": 0.002212780203829396, "phrase": "sieve_accuracy"}], "paper_keywords": ["MANET", " rateless codes", " belief propagation", " pollution attack", " malicious node identification", " statistical inference"], "paper_abstract": "In this paper, we consider a scenario where nodes in a MANET disseminate data chunks using rateless codes. Any node is able to successfully decode any chunk by collecting enough coded blocks from several other nodes without any coordination. We consider the problem of identifying malicious nodes that launch a pollution attack by deliberately modifying the payload of coded blocks before transmitting. It follows that the original chunk can only be obtained if there are no malicious nodes among the chunk providers. In this paper we propose SIEVE, a fully distributed technique to infer the identity of malicious nodes. A node creates what we termed a check whenever a chunk is decoded; a check is a pair composed of the set of other nodes that provided coded blocks used to decode the chunk (the chunk uploaders) and a flag indicating whether the chunk is corrupted or not. SIEVE exploits rateless codes to detect chunk integrity and belief propagation to infer the identity of malicious nodes. In particular, every node autonomously constructs its own bipartite graph (a.k.a. factor graph in the literature) whose vertexes are checks and nodes, respectively. Then, it periodically runs the belief propagation algorithm on its factor graph to infer the probability of other nodes being malicious. We show by running detailed simulations using ns-3 that SIEVE is very accurate and robust under several attack scenarios and deceiving actions. We discuss how the topological properties of the factor graph impacts SIEVE performance and show that nodes speed in the MANET plays a role on the identification accuracy. Furthermore, an interesting trade-off between coding efficiency and SIEVE accuracy, completeness, and reactivity is discovered. We also show that SIEVE is efficient requiring low computational, memory, and communication resources.", "paper_title": "Exploiting Rateless Codes and Belief Propagation to Infer Identity of Polluters in MANET", "paper_id": "WOS:000339169100008"}