{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_problems"}, {"score": 0.0047517225918491226, "phrase": "carbon_nanotubes"}, {"score": 0.004389339243427964, "phrase": "artificial_evolution"}, {"score": 0.004054479957160662, "phrase": "detailed_understanding"}, {"score": 0.0037203741725514126, "phrase": "purpose-built_hardware_platform"}, {"score": 0.0036714667610391535, "phrase": "mecobo"}, {"score": 0.0033911868693238894, "phrase": "physical_materials"}, {"score": 0.0028930017387859804, "phrase": "evolution-in-materio_technique"}, {"score": 0.0026543514413663893, "phrase": "evolution-in-materio_approach"}, {"score": 0.0024678216843278806, "phrase": "well-known_effective_software-based_evolutionary_approach"}, {"score": 0.002161542155696987, "phrase": "simulated_khepera_robot"}], "paper_keywords": ["Evolutionary algorithms evolution-in-materio material computation evolvable hardware machine learning classification robot control"], "paper_abstract": "Evolution-in-materio is a method that uses artificial evolution to exploit properties of materials to solve computational problems without requiring a detailed understanding of such properties. In this paper, we show that using a purpose-built hardware platform called Mecobo, it is possible to evolve voltages and signals applied to physical materials to solve two computational problems: classification and robot control. We have investigated many experimental factors that could affect the effectiveness of the device and the evolution-in-materio technique. On the classification problem (Iris) we show that the evolution-in-materio approach with analogue signals gives very good results that are competitive with a well-known effective software-based evolutionary approach. In the case of robot control, we were able to evolve a controller that successfully allowed a simulated Khepera robot to fully explore its environment without colliding with any obstacle.", "paper_title": "Evolving Solutions to Computational Problems Using Carbon Nanotubes", "paper_id": "WOS:000368629300004"}