{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mastermind"}, {"score": 0.04434057362710073, "phrase": "doerr"}, {"score": 0.044040828236146926, "phrase": "winzen"}, {"score": 0.03553364967409077, "phrase": "arbitrary_number"}, {"score": 0.033870260990647834, "phrase": "optimal_strategy"}, {"score": 0.03352372157441863, "phrase": "worst_case"}, {"score": 0.004598933498016774, "phrase": "mastermind_game"}, {"score": 0.004455061431809975, "phrase": "constant_number"}, {"score": 0.004346266306175988, "phrase": "constant-size_memory_mastermind"}, {"score": 0.0036424097335610492, "phrase": "white_and_black_pegs"}, {"score": 0.0030847461428168614, "phrase": "corresponding_number"}, {"score": 0.002998688867384969, "phrase": "memory_restriction"}, {"score": 0.0028944757265206332, "phrase": "black-peg_variant"}, {"score": 0.002764379205581817, "phrase": "memory_size"}, {"score": 0.0024772013657695896, "phrase": "fixed_number"}, {"score": 0.0023742031943872464, "phrase": "computer_search"}, {"score": 0.0023491282852109757, "phrase": "additional_pairs"}, {"score": 0.0021885820862000962, "phrase": "size-one_memory_mastermind"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Game theory", " Logic game", " Mastermind", " Space complexity"], "paper_abstract": "We investigate a version of the Mastermind game, where the codebreaker may only store a constant number of questions and answers, called Constant-Size Memory Mastermind, which was recently introduced by Doerr and Winzen. We concentrate on the most difficult case, where the codebreaker may store only one question and one answer, called Size-One Memory Mastermind. We consider two variants of the game: the original one, where the answer is coded with white and black pegs, and the simplified one, where only black pegs are used in the answer. We show that for two pegs and an arbitrary number of colors, the number of questions needed by the codebreaker for an optimal strategy in the worst case for these games is equal to the corresponding number of questions in the games without a memory restriction. We show that this also holds for the black-peg variant and three pegs. In other words, for these cases restricting the memory size does not make the game harder for the codebreaker. This is a continuation of a result of Doerr and Winzen, who showed that this holds asymptotically for a fixed number of colors and an arbitrary number of pegs. Furthermore, by computer search we determine additional pairs (p, c), where again the numbers of questions for an optimal strategy in the worst case for Size-One Memory Mastermind and original Mastermind are equal. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Bounding memory for Mastermind might not make it harder", "paper_id": "WOS:000358972800005"}