{"auto_keywords": [{"score": 0.032321127685275584, "phrase": "journal_stature"}, {"score": 0.027435990507147404, "phrase": "power_measures"}, {"score": 0.004763565662615503, "phrase": "relative_stature"}, {"score": 0.004662427600500598, "phrase": "information_systems"}, {"score": 0.0045471315699087385, "phrase": "important_issue"}, {"score": 0.0043560464825349275, "phrase": "journal_assessment_results"}, {"score": 0.0041580507929967645, "phrase": "merit_decisions"}, {"score": 0.004011867299107537, "phrase": "major_ingredient"}, {"score": 0.0038986150699604504, "phrase": "underlying_journal_assessment_processes"}, {"score": 0.003616252896285766, "phrase": "overt_behaviors"}, {"score": 0.0034271313706984658, "phrase": "stated_preferences"}, {"score": 0.003342280102112269, "phrase": "objective_journal_assessments"}, {"score": 0.0031448288291084, "phrase": "so-called_journal_impact_factors"}, {"score": 0.0029802879302375986, "phrase": "impact_measure"}, {"score": 0.0028446460307503343, "phrase": "journal_impact"}, {"score": 0.0026008598632891837, "phrase": "impact_measures"}, {"score": 0.002473560912156024, "phrase": "small_group"}, {"score": 0.0021975548867457623, "phrase": "combined_use"}, {"score": 0.0021049977753042253, "phrase": "relative_statures"}], "paper_keywords": ["bibliometrics", " breadth", " citation", " H-index", " impact factor", " impact measures", " intensity", " journal evaluation", " journal quality", " journal stature", " power measures", " revealed preference"], "paper_abstract": "Assessing the relative stature of journals devoted to the information systems (IS) discipline is an important issue for IS scholars and those who evaluate them. Even though journal assessment results are often dubiously applied by those making hiring, promotion, and merit decisions, the fact that they are so often a major ingredient in these decisions demands that we understand underlying journal assessment processes. Beyond processes involving the opinions of various experts, we here examine how IS journals can be evaluated based on overt behaviors of crowds of IS scholars. These behaviors are revealed preferences, in contrast to stated preferences found in opinions. Two classes of objective journal assessments are studied: impact measures and power measures. Among the former, we find that so-called journal impact factors are problematic, rendering their meaningfulness in evaluating journal stature highly suspect. Another kind of impact measure, the H-index, is found to be a more straightforward way to gauge journal impact. Two power measures for assessing IS journal stature are examined: publishing intensity and publishing breadth. The stature of IS journals according to each of the impact measures and power measures is determined. A comparison of the results shows that a small group of four or five IS journals are repeatedly found at the top across multiple objective assessment approaches. To account for both the consumption and production of IS research, it is suggested that a combined use of impact and power measures be employed in exercises aimed at evaluating relative statures of journals devoted to IS research.", "paper_title": "EVALUATING JOURNAL QUALITY: BEYOND \"EXPERT\" JOURNAL ASSESSMENTS IN THE IS DISCIPLINE", "paper_id": "WOS:000326218500005"}