{"auto_keywords": [{"score": 0.04455442320959089, "phrase": "motor_complications"}, {"score": 0.029576426397292667, "phrase": "data_features"}, {"score": 0.010442007369047508, "phrase": "parkinson's_disease"}, {"score": 0.00970819593933994, "phrase": "accelerometer_data"}, {"score": 0.008356418749375701, "phrase": "svm-based_estimates"}, {"score": 0.008221957225240308, "phrase": "clinical_scores"}, {"score": 0.008056894095520182, "phrase": "video_recordings"}, {"score": 0.007075646511455653, "phrase": "parkinsonian_symptoms"}, {"score": 0.00481495049065317, "phrase": "monitoring_motor_fluctuations"}, {"score": 0.0046987973264610685, "phrase": "wearable_sensors"}, {"score": 0.004529776351030488, "phrase": "pilot_study"}, {"score": 0.003817655499320344, "phrase": "accelerometer_data_features"}, {"score": 0.003680212979775528, "phrase": "visual_inspection"}, {"score": 0.0035332741328861776, "phrase": "standardized_motor_tasks"}, {"score": 0.0031012349116334606, "phrase": "accelerometer_time_series"}, {"score": 0.002688781336915723, "phrase": "different_svm_kernels"}, {"score": 0.00266693888510356, "phrase": "misclassification_cost_values"}, {"score": 0.002570817338292482, "phrase": "different_motor_tasks"}, {"score": 0.0022561982694417116, "phrase": "computational_cost"}, {"score": 0.00221063611719246, "phrase": "data_feature"}, {"score": 0.0021571717917276724, "phrase": "body_sensor_network"}], "paper_keywords": ["Body sensor networks", " Parkinson's disease", " support vector machines (SVMs)", " wearable sensors"], "paper_abstract": "This paper presents the results of a pilot study to assess the feasibility of using accelerometer data to estimate the severity of symptoms and motor complications in patients with Parkinson's disease. A support vector machine (SVM) classifier was implemented to estimate the severity of tremor, bradykinesia and dyskinesia from accelerometer data features. SVM-based estimates were compared with clinical scores derived via visual inspection of video recordings taken while patients performed a series of standardized motor tasks. The analysis of the video recordings was performed by clinicians trained in the use of scales for the assessment of the severity of Parkinsonian symptoms and motor complications. Results derived from the accelerometer time series were analyzed to assess the effect on the estimation of clinical scores of the duration of the window utilized to derive segments (to eventually compute data features) from the accelerometer data, the use of different SVM kernels and misclassification cost values, and the use of data features derived from different motor tasks. Results were also analyzed to assess which combinations of data features carried enough information to reliably assess the severity of symptoms and motor complications. Combinations of data features were compared taking into consideration the computational cost associated with estimating each data feature on the nodes of a body sensor network and the effect of using such data features on the reliability of SVM-based estimates of the severity of Parkinsonian symptoms and motor complications.", "paper_title": "Monitoring Motor Fluctuations in Patients With Parkinson's Disease Using Wearable Sensors", "paper_id": "WOS:000271481300002"}