{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planar_drawings"}, {"score": 0.014985982609428775, "phrase": "rna_structures"}, {"score": 0.011514786318004918, "phrase": "web_services"}, {"score": 0.009410879136809392, "phrase": "pseudoviewer"}, {"score": 0.004768649568826951, "phrase": "large-scale_rna_structures"}, {"score": 0.004185289462328125, "phrase": "entire_rna_structure"}, {"score": 0.0038179283509963695, "phrase": "additional_intervention"}, {"score": 0.0036730297909962142, "phrase": "structure_graph"}, {"score": 0.0034325187732054093, "phrase": "overlap-free_graph"}, {"score": 0.003131023880006021, "phrase": "rna_pseudoknots"}, {"score": 0.0030267296900520217, "phrase": "almost_only_program"}, {"score": 0.002968695624366393, "phrase": "rna_secondary_structures"}, {"score": 0.002897710777957041, "phrase": "previous_version"}, {"score": 0.002707829887747594, "phrase": "hypothetical_pseudoknots"}, {"score": 0.0026817365934071486, "phrase": "non-planar_drawings"}, {"score": 0.002592369213499121, "phrase": "new_version"}, {"score": 0.0025181367444581993, "phrase": "large_rna_structures"}, {"score": 0.002230984431056064, "phrase": "previous_algorithm"}, {"score": 0.0021049977753042253, "phrase": "web_applications"}], "paper_keywords": [""], "paper_abstract": "Motivation: Pseudoknots in RNA structures make visualization of RNA structures difficult. Even if a pseudoknot itself is represented without a crossing, visualization of the entire RNA structure with a pseudoknot often results in a drawing with crossings between the pseudoknot and other structural elements, and requires additional intervention by the user to ensure that the structure graph is overlap-free. Many programs such as web services prefer to obtain an overlap-free graph in one-shot rather than get a graph with overlaps to be edited. There are few programs for visualizing RNA pseudoknots, and PseudoViewer has been the almost only program that automatically draws RNA secondary structures with pseudoknots. The previous version of PseudoViewer visualizes all the known types of RNA pseudoknots as planar drawings, but visualizes some hypothetical pseudoknots as non-planar drawings. Results: We developed a new version of PseudoViewer for efficiently visualizing large RNA structures with any types of pseudoknots, both known and hypothetical, as planar drawings in one-shot. It is about 10 times faster than the previous algorithm, and produces a more compact and aesthetic structure drawing. PseudoViewer3 supports both web services and web applications.", "paper_title": "PseudoViewer3: generating planar drawings of large-scale RNA structures with pseudoknots", "paper_id": "WOS:000266109500019"}