{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hierarchical_t-meshes"}, {"score": 0.009692349463004419, "phrase": "nurbs_surface"}, {"score": 0.004617949594931096, "phrase": "new_type"}, {"score": 0.00428733103049275, "phrase": "geometric_objects"}, {"score": 0.004017437417375057, "phrase": "detailed_construction_process"}, {"score": 0.00398028819691605, "phrase": "spline_basis_functions"}, {"score": 0.003712362078915926, "phrase": "local_support"}, {"score": 0.003367188029221534, "phrase": "new_splines"}, {"score": 0.003336031521101184, "phrase": "surface_models"}, {"score": 0.003199345207727474, "phrase": "open_or_closed_mesh_models"}, {"score": 0.002795762692061496, "phrase": "superfluous_control_points"}, {"score": 0.0026440008776012665, "phrase": "geometry_processing"}, {"score": 0.002607362103727335, "phrase": "natural_and_efficient_manner"}, {"score": 0.0024658019116387845, "phrase": "tensor-product_spline_patches"}, {"score": 0.0023646866829474798, "phrase": "coarser_t-mesh"}, {"score": 0.002278284823857861, "phrase": "sederberg's_t-splines"}], "paper_keywords": ["T-mesh", " T-splines", " NURBS", " Local refinement", " Surface fitting", " Shape simplification"], "paper_abstract": "In this paper, we introduce a new type of splines-polynomial splines over hierarchical T-meshes (called PHT-splines) to model geometric objects. PHT-splines are a generalization of B-splines over hierarchical T-meshes. We present the detailed construction process of spline basis functions over T-meshes which have the same important properties as B-splines do, such as nonnegativity, local support and partition of unity. As two fundamental operations, cross insertion and cross removal of PHT-splines are discussed. With the new splines, surface models can be constructed efficiently and adaptively to fit open or closed mesh models, where only linear Systems of equations with a few unknowns are involved. With this approach, a NURBS surface can be efficiently simplified into a PHT-spline which dramatically reduces the superfluous control points of the NURBS surface. Furthermore, PHT-splines allow for several important types of geometry processing in a natural and efficient manner, such as conversion of a PHT-spline into an assembly of tensor-product spline patches, and shape simplification of PHT-splines over a coarser T-mesh. PHT-splines not only inherit many good properties of Sederberg's T-splines Such as adaptivity and locality, but also extend T-splines in several aspects except that they are only C(I) continuous. For example, PHT-splines are polynomial instead of rational; cross insertion/removal of PHT-splines is local and simple. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Polynomial splines over hierarchical T-meshes", "paper_id": "WOS:000261456500006"}