{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "-site_building_information_retrieval"}, {"score": 0.00478218760286811, "phrase": "projection-based_augmented_reality"}, {"score": 0.004706601114516316, "phrase": "long-standing_problem"}, {"score": 0.004579780586951551, "phrase": "wearable_device"}, {"score": 0.004466519142879166, "phrase": "construction_drawings"}, {"score": 0.004446227790943307, "phrase": "related_information"}, {"score": 0.004248294537944227, "phrase": "bulky_construction_drawings"}, {"score": 0.004105624911530519, "phrase": "correct_drawings"}, {"score": 0.0038083271073378775, "phrase": "information-integration_module"}, {"score": 0.0037395458116642306, "phrase": "building_information_model"}, {"score": 0.003663645143713398, "phrase": "on-site_retrieval"}, {"score": 0.0035892794633115227, "phrase": "position_module"}, {"score": 0.003437188137527573, "phrase": "manipulation_module"}, {"score": 0.003359737464205214, "phrase": "touch_screen"}, {"score": 0.0032468107734641176, "phrase": "unneeded_information"}, {"score": 0.0032246835734680377, "phrase": "display_module"}, {"score": 0.0030115136348693888, "phrase": "correct_scale"}, {"score": 0.0029909851863915283, "phrase": "hardware_device"}, {"score": 0.0028641729745364952, "phrase": "construction_helmet"}, {"score": 0.002736474657938149, "phrase": "optoma"}, {"score": 0.0025730425700096365, "phrase": "user_test"}, {"score": 0.002397370428991875, "phrase": "mean_completion_times"}, {"score": 0.002280008490069972, "phrase": "mean_success_rates"}, {"score": 0.0022490076377344945, "phrase": "correct_answers"}, {"score": 0.0021049977753042253, "phrase": "american_society_of_civil_engineers"}], "paper_keywords": ["Building information model", " Augmented reality", " Mobile device", " Projector", " Wearable computing"], "paper_abstract": "This research focuses on a long-standing problem at construction sites: on-site information retrieval. A wearable device, therefore, has been developed that can project the construction drawings and related information on the basis of the needs of the users. This device is envisaged to help engineers avoid carrying bulky construction drawings to the site, and to reduce the effort required in looking for the correct drawings to obtain the information they need. This device includes four modules: the information-integration module, the display module, the positioning module, and the manipulation module. The information-integration module is used to transfer information in the building information model (BIM) into images to enable the on-site retrieval from the device that was developed. The position module enables users to input their locations and automatically search for the images that the users might need. The manipulation module can analyze the gestures of the users from the touch screen and accelerometer in the devices, and then crop the images to eliminate the unneeded information. The display module, which directly links to the projector, can continually calculate the images processed by the previous three modules and scale the images accordingly, ensuring that the projection results in a correct scale. A hardware device, coined the iHelmet, has also been developed to implement the four modules. It consists of a construction helmet (weight: 460 g), an iPod Touch (weight: 115 g), and an Optoma light-emitting diode (LED) projector (weight: 114 g). To validate the usability of the iHelmet on-site, a user test with 34 participants was conducted. A comparison of the efficiency and effectiveness of retrieving building information using the iHelmet was done using the traditional two-dimensional (2D) drawing approach. The results showed that the mean completion times were significantly shorter for participants using the iHelmet (iHelmet: 44 s; traditional approach: 99 s). The mean success rates of participants arriving at the correct answers were also significantly improved for those using the iHelmet (iHelmet: 91.6%; traditional approach: 64.3%). DOI: 10.1061/(ASCE)CP.1943-5487.0000156. (C) 2012 American Society of Civil Engineers.", "paper_title": "On-Site Building Information Retrieval by Using Projection-Based Augmented Reality", "paper_id": "WOS:000303933900007"}