{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "web_application_testing"}, {"score": 0.008737760396856014, "phrase": "research_area"}, {"score": 0.004701914499141374, "phrase": "significant_impact"}, {"score": 0.00446009116328642, "phrase": "web_applications"}, {"score": 0.004219493853770107, "phrase": "web-based_software_applications"}, {"score": 0.0041531569169503905, "phrase": "related_studies"}, {"score": 0.0038980354874628325, "phrase": "related_papers"}, {"score": 0.0036488733208062166, "phrase": "specialized_field"}, {"score": 0.0034701799486223698, "phrase": "systematic_mapping"}, {"score": 0.0033264838330329663, "phrase": "research_questions"}, {"score": 0.0032828067991933414, "phrase": "exclusion_criteria"}, {"score": 0.0032141094173256247, "phrase": "classification_schema"}, {"score": 0.0031468450866998523, "phrase": "bibliometrics_analysis"}, {"score": 0.002801209717483437, "phrase": "publicly-accessible_repository"}, {"score": 0.0027644104508413613, "phrase": "observed_trends"}, {"score": 0.0026428616811800913, "phrase": "test_cases"}, {"score": 0.002533336762815037, "phrase": "bibliometrics_trends"}, {"score": 0.002493442431605113, "phrase": "top-cited_papers"}, {"score": 0.002441223158817114, "phrase": "top_venues"}, {"score": 0.002377480602654593, "phrase": "emerging_trends"}, {"score": 0.002207698641055144, "phrase": "existing_web_application_testing_approaches"}, {"score": 0.00213869043367662, "phrase": "research_community"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Systematic mapping", " Web application", " Testing", " Paper repository", " Bibliometrics"], "paper_abstract": "Context: The Web has had a significant impact on all aspects of our society. As our society relies more and more on the Web, the dependability of web applications has become increasingly important. To make these applications more dependable, for the past decade researchers have proposed various techniques for testing web-based software applications. Our literature search for related studies retrieved 147 papers in the area of web application testing, which have appeared between 2000 and 2011. Objective: As this research area matures and the number of related papers increases, it is important to systematically identify, analyze, and classify the publications and provide an overview of the trends in this specialized field. Method: We review and structure the body of knowledge related to web application testing through a systematic mapping (SM) study. As part of this study, we pose two sets of research questions, define selection and exclusion criteria, and systematically develop and refine a classification schema. In addition, we conduct a bibliometrics analysis of the papers included in our study. Results: Our study includes a set of 79 papers (from the 147 retrieved papers) published in the area of web application testing between 2000 and 2011. We present the results of our systematic mapping study. Our mapping data is available through a publicly-accessible repository. We derive the observed trends, for instance, in terms of types of papers, sources of information to derive test cases, and types of evaluations used in papers. We also report the demographics and bibliometrics trends in this domain, including top-cited papers, active countries and researchers, and top venues in this research area. Conclusion: We discuss the emerging trends in web application testing, and discuss the implications for researchers and practitioners in this area. The results of our systematic mapping can help researchers to obtain an overview of existing web application testing approaches and indentify areas in the field that require more attention from the research community. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A systematic mapping study of web application testing", "paper_id": "WOS:000320685200002"}