{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "condition_based_maintenance"}, {"score": 0.0038654774211631564, "phrase": "decision_making"}, {"score": 0.0037989951856280423, "phrase": "control_charts"}, {"score": 0.0032496585171039797, "phrase": "models'_parameters"}, {"score": 0.0032122679403131568, "phrase": "monte_carlo_simulation"}, {"score": 0.0029622717081190667, "phrase": "parameter's_variations"}, {"score": 0.0028944757265206332, "phrase": "taguchi's_design"}, {"score": 0.0026846436189970446, "phrase": "variance_technique"}, {"score": 0.002461313735611462, "phrase": "maintenance_decisions"}, {"score": 0.0024049552650867935, "phrase": "optimization_techniques"}, {"score": 0.0021049977753042253, "phrase": "correct_decisions"}], "paper_keywords": ["Condition based maintenance", " Accuracy and robustness decision making"], "paper_abstract": "This paper presents a study on Type I and Type II errors that are inherent in every technique for decision making in condition based maintenance. Specifically, the study considers those errors that result when three methods are used for decision making: the control charts known as the Statistical Process Control, the Hidden Markov Model, and the Proportional Hazard Model. The objective is to study the accuracy and the robustness of these techniques to variations in the models' parameters. Monte Carlo simulation is used to simulate the performance of these techniques. The effects of parameter's variations are obtained through Taguchi's design of experiments, and the results are analyzed by the analysis of variance technique. Those results show that accuracy and robustness should be taken into consideration when maintenance decisions are taken. Optimization techniques can be used to optimize the values of the parameters in order to minimize the two types of errors and to increase the correct decisions.", "paper_title": "Accuracy and robustness of decision making techniques in condition based maintenance", "paper_id": "WOS:000301605000011"}