{"auto_keywords": [{"score": 0.04852232688729349, "phrase": "fractional_fourier_transform"}, {"score": 0.010615487176056888, "phrase": "fourier"}, {"score": 0.004736045157669388, "phrase": "signal_processing"}, {"score": 0.004506968388996092, "phrase": "classical_fourier_transform"}, {"score": 0.00433645229352341, "phrase": "mathematic_aspect"}, {"score": 0.00428892403807229, "phrase": "namias"}, {"score": 0.003841263262252044, "phrase": "signal_processing_community"}, {"score": 0.003615217162972726, "phrase": "chirp-basis_expansion"}, {"score": 0.003309877074892399, "phrase": "time-frequency_plane"}, {"score": 0.002789528662623221, "phrase": "time_domain"}, {"score": 0.0027437235598539904, "phrase": "frequency_domain"}, {"score": 0.0026838147966444783, "phrase": "research_paper"}, {"score": 0.002511803988580901, "phrase": "signal_processing_point"}, {"score": 0.0021049977753042253, "phrase": "interested_readers"}], "paper_keywords": ["fractional Fourier transform", " signal processing", " time-frequency analysis"], "paper_abstract": "The fractional Fourier transform is a generalization of the classical Fourier transform, which is introduced from the mathematic aspect by Namias at first and has many applications in optics quickly. Whereas its potential appears to have remained largely unknown to the signal processing community until 1990s. The fractional Fourier transform can be viewed as the chirp-basis expansion directly from its definition, but essentially it can be interpreted as a rotation in the time-frequency plane, i.e. the unified time-frequency transform. With the order from 0 increasing to 1, the fractional Fourier transform can show the characteristics of the signal changing from the time domain to the frequency domain. In this research paper, the fractional Fourier transform has been comprehensively and systematically treated from the signal processing point of view. Our aim is to provide a course from the definition to the applications of the fractional Fourier transform, especially as a reference and an introduction for researchers and interested readers.", "paper_title": "Research progress of the fractional Fourier transform in signal processing", "paper_id": "WOS:000236156800001"}