{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fractional_fetal_dna_concentration"}, {"score": 0.030824341918407664, "phrase": "maternal_plasma"}, {"score": 0.0076699671472610165, "phrase": "massively_parallel_sequencing"}, {"score": 0.007128270721915162, "phrase": "non-invasive_prenatal_diagnosis"}, {"score": 0.004675085201833056, "phrase": "fetalquant"}, {"score": 0.004473982381245469, "phrase": "critical_parameters"}, {"score": 0.0041954395820227456, "phrase": "mps"}, {"score": 0.003970439654470374, "phrase": "powerful_tool"}, {"score": 0.0037747835341722636, "phrase": "rapid_advance"}, {"score": 0.0037402558657576124, "phrase": "mps_technologies"}, {"score": 0.003689053436223376, "phrase": "sequencing_cost"}, {"score": 0.003126481516783286, "phrase": "sequencing_data"}, {"score": 0.003097865379563127, "phrase": "prior_genotype_information"}, {"score": 0.002945081009084692, "phrase": "statistical_mixture_model"}, {"score": 0.00283870598459543, "phrase": "maximum_likelihood"}, {"score": 0.002748775748298028, "phrase": "targeted_mps"}, {"score": 0.0026252106881752067, "phrase": "improved_deduction"}, {"score": 0.002518746501941657, "phrase": "genotype_information"}, {"score": 0.002405496949144104, "phrase": "bayes'_rule"}, {"score": 0.002329258721870127, "phrase": "informative_single-nucleotide_polymorphism_loci"}, {"score": 0.0021049977753042253, "phrase": "diagnostic_applications"}], "paper_keywords": [""], "paper_abstract": "Motivation: The fractional fetal DNA concentration is one of the critical parameters for non-invasive prenatal diagnosis based on the analysis of DNA in maternal plasma. Massively parallel sequencing (MPS) of DNA in maternal plasma has been demonstrated to be a powerful tool for the non-invasive prenatal diagnosis of fetal chromosomal aneuploidies. With the rapid advance of MPS technologies, the sequencing cost per base is dramatically reducing, especially when using targeted MPS. Even though several approaches have been developed for deducing the fractional fetal DNA concentration, none of them can be used to deduce the fractional fetal DNA concentration directly from the sequencing data without prior genotype information. Result: In this study, we implement a statistical mixture model, named FetalQuant, which utilizes the maximum likelihood to estimate the fractional fetal DNA concentration directly from targeted MPS of DNA in maternal plasma. This method allows the improved deduction of the fractional fetal DNA concentration, obviating the need of genotype information without loss of accuracy. Furthermore, by using Bayes' rule, this method can distinguish the informative single-nucleotide polymorphism loci where the mother is homozygous and the fetus is heterozygous. We believe that FetalQuant can help expand the spectrum of diagnostic applications using MPS on DNA in maternal plasma.", "paper_title": "FetalQuant: deducing fractional fetal DNA concentration from massively parallel sequencing of DNA in maternal plasma", "paper_id": "WOS:000311303500004"}