{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "translation_probabilities"}, {"score": 0.049725544371589304, "phrase": "social_tag_suggestion"}, {"score": 0.013624402101908796, "phrase": "text_description"}, {"score": 0.011718489587496448, "phrase": "vocabulary_gap_issue"}, {"score": 0.0044052452943364314, "phrase": "online_resource"}, {"score": 0.003970930401776528, "phrase": "significant_words"}, {"score": 0.003840598580753804, "phrase": "suggested_tags"}, {"score": 0.0036327808996444904, "phrase": "tag_suggestion"}, {"score": 0.003566028957296066, "phrase": "-_the_appropriate_tags"}, {"score": 0.0033730181385496186, "phrase": "corresponding_description"}, {"score": 0.0031904205547902695, "phrase": "new_perspective"}, {"score": 0.0025916375737852506, "phrase": "large_collection"}, {"score": 0.002572463625403536, "phrase": "description-tags_pairs"}, {"score": 0.0024603551979225195, "phrase": "resource_description"}, {"score": 0.0024240794798626674, "phrase": "real-world_datasets"}, {"score": 0.0021927897271015657, "phrase": "web_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Natural language processing", " Tag suggestion", " Translation model", " Word alignment model", " Pointwise mutual information"], "paper_abstract": "The task of social tag suggestion is to recommend tags automatically for a user when he or she wants to annotate an online resource. In this study, we focus on how to make use of the text description of a resource to suggest tags. It is intuitive to select significant words from the text description of a source as the suggested tags. However, since users can arbitrarily annotate any tags to a resource, tag suggestion suffers from the vocabulary gap issue - the appropriate tags of a resource may be statistically insignificant or even do not appear in the corresponding description. In order to solve the vocabulary gap issue, in this paper we present a new perspective on social tag suggestion. By considering both a description and tags as summaries of a given resource composed in two languages, tag suggestion can be regarded as a translation from description to tags. We propose two methods to estimate the translation probabilities between words in descriptions and tags. Based on the translation probabilities between words and tags estimated for a large collection of description-tags pairs, we can suggest tags according to the words in a resource description. Experiments on real-world datasets indicate that our methods outperform other methods in precision, recall and F-measure. Moreover, our methods are relatively simple and efficient, which makes them practical for Web applications. (C) 2014 The Authors. Published by Elsevier Ltd.", "paper_title": "Estimating translation probabilities for social tag suggestion", "paper_id": "WOS:000347579500017"}