{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bandwidth_allocation"}, {"score": 0.04953289560992991, "phrase": "admission_control"}, {"score": 0.048193365666829406, "phrase": "real-time_traffic"}, {"score": 0.047667240890459914, "phrase": "class-based_ip_networks"}, {"score": 0.0035518193979811367, "phrase": "already_established_ones"}, {"score": 0.00307657476125683, "phrase": "topological_placement"}, {"score": 0.00298942278888105, "phrase": "admission_control_schemes"}, {"score": 0.0027741761880779535, "phrase": "employed_procedures"}, {"score": 0.002361632539339945, "phrase": "different_points"}, {"score": 0.002321234686549485, "phrase": "class-based_ip_network"}, {"score": 0.0022041312401435346, "phrase": "expected_performance"}, {"score": 0.0021049977753042253, "phrase": "quantitative_view"}], "paper_keywords": [""], "paper_abstract": "The support of real-time traffic in class-based IP networks requires reservation of resources, accompanied by admission control in order to guarantee that newly admitted real-time traffic flows do not cause any violation to the Quality of Service (QoS) perceived by the already established ones. In this paper we highlight certain issues with respect to bandwidth allocation and admission control for supporting real-time traffic in class-based IP networks. We investigate the implications of topological placement of both bandwidth allocation and admission control schemes. We show that their performance depends highly on the location of the employed procedures with respect to the end-users and the various network boundaries. We conclude that the strategies for applying these schemes should be location-aware, because their performance at different points in a class-based IP network can be different and can deviate from the expected performance. Through simulations we also provide a quantitative view of these deviations.", "paper_title": "On the location-awareness of bandwidth allocation and admission control for the support of real-time traffic in class-based IP networks", "paper_id": "WOS:000242560000020"}