{"auto_keywords": [{"score": 0.0446859049301421, "phrase": "communication_technology"}, {"score": 0.00481495049065317, "phrase": "clinical_communication_interventions"}, {"score": 0.004681971826924847, "phrase": "information_and_communication_technology_adoptions"}, {"score": 0.004489327204473076, "phrase": "systematic_review"}, {"score": 0.004170996594527844, "phrase": "associated_patient_outcomes"}, {"score": 0.004141877689172017, "phrase": "hospital_settings"}, {"score": 0.003768028741967194, "phrase": "clinical_communication"}, {"score": 0.003663857375787215, "phrase": "full_text_articles"}, {"score": 0.003587616378156851, "phrase": "individual_articles"}, {"score": 0.003286596407873823, "phrase": "alphanumeric_paging"}, {"score": 0.003263631515158206, "phrase": "hands-free_communication_devices"}, {"score": 0.0031845067058084583, "phrase": "task_management_systems"}, {"score": 0.003151184191185831, "phrase": "display_based_paging_system"}, {"score": 0.003064013732721966, "phrase": "study_design"}, {"score": 0.003021334228842501, "phrase": "lower_quality"}, {"score": 0.0028364942193465194, "phrase": "improved_perceptions"}, {"score": 0.002767696345005216, "phrase": "communication_metrics"}, {"score": 0.0027483472371835865, "phrase": "qualitative_studies"}, {"score": 0.0025531499687505483, "phrase": "rapid_advancement"}, {"score": 0.0025352969524471496, "phrase": "information_and_communications_technology"}, {"score": 0.0024824815904738685, "phrase": "limited_evidence"}, {"score": 0.002422249273477746, "phrase": "health_professionals"}, {"score": 0.002363474907331799, "phrase": "critical_nature"}, {"score": 0.0022187920251626257, "phrase": "outcome_measures"}, {"score": 0.0021801944769738618, "phrase": "patient-oriented_outcomes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Hospital communication systems", " Communication", " Systematic review"], "paper_abstract": "Objective: To conduct a systematic review of the literature to identify, describe and assess interventions of information and communication technology on the processes of communication and associated patient outcomes within hospital settings. Materials and methods: Studies published from the years 1996 to 2010 were considered and were selected if they described an evaluation of information and communication technology interventions to improve clinical communication within hospitals. Two authors abstracted data from full text articles, and the quality of individual articles were appraised. Results of interventions were summarized by their effect. Results: There were 18 identified studies that evaluated the use of interventions that included alphanumeric paging, hands-free communication devices, mobile phones, smartphones, task management systems and a display based paging system. Most quantitative studies used a before and after study design and were of lower quality. Of all the studies, there was only one prospective randomized study, but this study used only simulated communication events. Quantitative studies identified improved perceptions of communication and some improvement in communication metrics. Qualitative studies described improvements in efficiency of communication but also issues of loss of control and reliability. Conclusions: Despite the rapid advancement in information and communications technology over the last decade, there is limited evidence suggesting improvements in the ability of health professionals to communicate effectively. Given the critical nature of communication, we advocate further evaluation of information and communication technology designed to improve communication between clinicians. Outcome measures should include measures of patient-oriented outcomes and efficiency for clinicians. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Effects of clinical communication interventions in hospitals: A systematic review of information and communication technology adoptions for improved communication between clinicians", "paper_id": "WOS:000310508800001"}