{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_performance"}, {"score": 0.044356039019745455, "phrase": "user_perceptions"}, {"score": 0.00470325458481566, "phrase": "display_technology"}, {"score": 0.004508661664944657, "phrase": "increasing_diversity"}, {"score": 0.00444559516711374, "phrase": "available_display_form_factors"}, {"score": 0.004362870617347183, "phrase": "empirical_evaluation"}, {"score": 0.004009175817816061, "phrase": "different_display_forms"}, {"score": 0.0038794730876377057, "phrase": "multiple_display_environments"}, {"score": 0.003807242767474929, "phrase": "initial_evidence"}, {"score": 0.0037188360359702182, "phrase": "ubiquitous_display"}, {"score": 0.0036667768092524576, "phrase": "previous_research"}, {"score": 0.003531474887552889, "phrase": "multiple_monitors"}, {"score": 0.003306559295382181, "phrase": "behavioral_impacts"}, {"score": 0.0032602525602322832, "phrase": "form_factors"}, {"score": 0.002818013056816282, "phrase": "single-user_scenarios"}, {"score": 0.0027139447110929586, "phrase": "geospatial_visual_analytics_tasks"}, {"score": 0.0026384167183586015, "phrase": "larger_displays"}, {"score": 0.002280333649167796, "phrase": "form_factor"}, {"score": 0.0021049977753042253, "phrase": "new_display_environments"}], "paper_keywords": [""], "paper_abstract": "As display technology continues to improve, there will be an increasing diversity in the available display form factors and scales. Empirical evaluation of how display attributes affect user perceptions and performance can help designers understand the strengths and weaknesses of different display forms, provide guidance for effectively designing multiple display environments, and offer initial evidence for developing theories of ubiquitous display. Although previous research has shown user performance benefits when tiling multiple monitors to increase the number of pixels, little research has analyzed the performance and behavioral impacts of the form factors of much larger, high-resolution displays. This article presents two experiments in which user performance was evaluated on a high-resolution (96 DPI), high pixel-count (approximately 32 million pixels) display for single-user scenarios in both flat and curved forms. We show that for geospatial visual analytics tasks there is a benefit to larger displays, and a distinct advantage to curving the display to make all portions of the display more accessible to the user. In addition, we found that changing the form factor of the display does have an impact on user perceptions that will have to be considered as new display environments are developed.", "paper_title": "Shaping the Display of the Future: The Effects of Display Size and Curvature on User Performance and Insights", "paper_id": "WOS:000265413800007"}