{"auto_keywords": [{"score": 0.004674952036988355, "phrase": "new_speed_records"}, {"score": 0.004253806270689741, "phrase": "bernstein"}, {"score": 0.003962633246555846, "phrase": "ietf."}, {"score": 0.0034591986220885557, "phrase": "avr"}, {"score": 0.003299460925313939, "phrase": "diffie-hellman_shared_secret"}, {"score": 0.002966438503447793, "phrase": "security_level"}, {"score": 0.002846175473457555, "phrase": "shared_secret"}, {"score": 0.002498961351132696, "phrase": "previous_constant-time_ecdh_software"}, {"score": 0.0021049977753042253, "phrase": "secure_ecdh_software"}], "paper_keywords": ["Curve25519", " ECDH key-exchange", " Elliptic-curve cryptography", " Embedded devices", " AVR ATmega", " MSP430", " ARM Cortex-M0"], "paper_abstract": "This paper presents new speed records for 128-bit secure elliptic-curve Diffie-Hellman key-exchange software on three different popular microcontroller architectures. We consider a 255-bit curve proposed by Bernstein known as Curve25519, which has also been adopted by the IETF. We optimize the X25519 key-exchange protocol proposed by Bernstein in 2006 for AVR ATmega 8-bit microcontrollers, MSP430X 16-bit microcontrollers, and for ARM Cortex-M0 32-bit microcontrollers. Our software for the AVR takes only 13,900,397 cycles for the computation of a Diffie-Hellman shared secret, and is the first to perform this computation in less than a second if clocked at 16 MHz for a security level of 128 bits. Our MSP430X software computes a shared secret in 5,301,792 cycles on MSP430X microcontrollers that have a 32-bit hardware multiplier and in 7,933,296 cycles on MSP430X microcontrollers that have a 16-bit multiplier. It thus outperforms previous constant-time ECDH software at the 128-bit security level on the MSP430X by more than a factor of 1.2 and 1.15, respectively. Our implementation on the Cortex-M0 runs in only 3,589,850 cycles and outperforms previous 128-bit secure ECDH software by a factor of 3.", "paper_title": "High-speed Curve25519 on 8-bit, 16-bit, and 32-bit microcontrollers", "paper_id": "WOS:000361991900014"}