{"auto_keywords": [{"score": 0.04950097558699653, "phrase": "shannon_code"}, {"score": 0.04911945324917725, "phrase": "wave_diffraction_patterns"}, {"score": 0.00481495049065317, "phrase": "redundancy_patterns"}, {"score": 0.0046803650677267146, "phrase": "partially_disordered_media"}, {"score": 0.0046238380150870435, "phrase": "average_redundancy"}, {"score": 0.00436890075128947, "phrase": "block_length"}, {"score": 0.0035100601949451028, "phrase": "large_n."}, {"score": 0.0033029038236817372, "phrase": "erratic_behavior"}, {"score": 0.0030953529970646626, "phrase": "wave_propagation"}, {"score": 0.003020918749760067, "phrase": "elementary_theory"}, {"score": 0.0025682999078906936, "phrase": "diffraction_intensity_spectrum"}, {"score": 0.0024461989110005447, "phrase": "full_constructive_interference"}, {"score": 0.002348883765159185, "phrase": "harmonic_waves"}, {"score": 0.002320449502337321, "phrase": "oscillatory_mode"}, {"score": 0.002165688807780663, "phrase": "considerable_degree"}, {"score": 0.0021049977753042253, "phrase": "bragg_peaks"}], "paper_keywords": ["Bragg peaks", " diffraction", " disorder", " Hendricks-Teller model", " lossless source coding", " redundancy", " scattering", " Shannon code"], "paper_abstract": "The average redundancy of the Shannon code, R-n, as a function of the block length n, is known to exhibit two very different types of behavior, depending on the rationality or irrationality of certain parameters of the source: It either converges to 1/2 as n grows without bound, or it may have a nonvanishing, oscillatory, (quasi-) periodic pattern around the value 1/2 for all large n. In this paper, we make an attempt to shed some insight into this erratic behavior of R-n, by drawing an analogy with the realm of physics of wave propagation, in particular, the elementary theory of scattering and diffraction. It turns out that there are two types of behavior of wave diffraction patterns formed by crystals, which are correspondingly analogous to the two types of patterns of R-n. When the crystal is perfect, the diffraction intensity spectrum exhibits very sharp peaks, a.k.a. Bragg peaks, at wavelengths of full constructive interference. These wavelengths correspond to the frequencies of the harmonic waves of the oscillatory mode of R-n. On the other hand, when the crystal is imperfect and there is a considerable degree of disorder in its structure, the Bragg peaks disappear, and the behavior of this mode is analogous to the one where R-n is convergent.", "paper_title": "Relations Between Redundancy Patterns of the Shannon Code and Wave Diffraction Patterns of Partially Disordered Media", "paper_id": "WOS:000304245100006"}