{"auto_keywords": [{"score": 0.03594893921057597, "phrase": "seed_nodes"}, {"score": 0.007538575175117413, "phrase": "large_graph"}, {"score": 0.005811617080683724, "phrase": "netsleuth"}, {"score": 0.005023653507314122, "phrase": "virus_propagation"}, {"score": 0.00481495049065317, "phrase": "starting_points"}, {"score": 0.0036445446531633368, "phrase": "efficient_method"}, {"score": 0.0035648266669315943, "phrase": "well-known_susceptible-infected_virus_propagation_model"}, {"score": 0.0032342101452939977, "phrase": "minimum_description_length_principle"}, {"score": 0.0031774686451753477, "phrase": "best_set"}, {"score": 0.002934166052954463, "phrase": "infected_graph"}, {"score": 0.0028699415886017468, "phrase": "highly_efficient_algorithm"}, {"score": 0.002832081745025006, "phrase": "likely_sets"}, {"score": 0.0025578967205807843, "phrase": "principled_way"}, {"score": 0.0023935128386292966, "phrase": "correct_number"}, {"score": 0.0022297712188622293, "phrase": "high_accuracy"}, {"score": 0.002123730137917387, "phrase": "correct_automatic_identification"}], "paper_keywords": ["Epidemics", " Diffusion", " Culprits", " Seeds"], "paper_abstract": "Given a snapshot of a large graph, in which an infection has been spreading for some time, can we identify those nodes from which the infection started to spread? In other words, can we reliably tell who the culprits are? In this paper, we answer this question affirmatively and give an efficient method called NetSleuth for the well-known susceptible-infected virus propagation model. Essentially, we are after that set of seed nodes that best explain the given snapshot. We propose to employ the minimum description length principle to identify the best set of seed nodes and virus propagation ripple, as the one by which we can most succinctly describe the infected graph. We give an highly efficient algorithm to identify likely sets of seed nodes given a snapshot. Then, given these seed nodes, we show we can optimize the virus propagation ripple in a principled way by maximizing likelihood. With all three combined, NetSleuth can automatically identify the correct number of seed nodes, as well as which nodes are the culprits. Experimentation on our method shows high accuracy in the detection of seed nodes, in addition to the correct automatic identification of their number. Moreover, NetSleuth scales linearly in the number of nodes of the graph.", "paper_title": "Efficiently spotting the starting points of an epidemic in a large graph", "paper_id": "WOS:000329944900002"}