{"auto_keywords": [{"score": 0.032404306538410976, "phrase": "objective_function"}, {"score": 0.00481495049065317, "phrase": "clustering_stability"}, {"score": 0.004692980391580608, "phrase": "common_tool"}, {"score": 0.004550669123303854, "phrase": "sample_based_algorithms"}, {"score": 0.004127753467337283, "phrase": "number_k"}, {"score": 0.0038810583785936505, "phrase": "practical_applications"}, {"score": 0.003574830654211291, "phrase": "formal_definition"}, {"score": 0.0032423089921154503, "phrase": "large_sample_size"}, {"score": 0.0030171910207671205, "phrase": "clustering_algorithm"}, {"score": 0.002851301751761804, "phrase": "unique_global_minimizer"}, {"score": 0.002559444836360178, "phrase": "well-suited_tool"}, {"score": 0.0022047613106966745, "phrase": "center-based_clusterings"}, {"score": 0.0021709933368474223, "phrase": "spectral_clustering"}], "paper_keywords": [""], "paper_abstract": "Stability is a common tool to verify the validity of sample based algorithms. In clustering it is widely used to tune the parameters of the algorithm, such as the number k of clusters. In spite of the popularity of stability in practical applications, there has been very little theoretical analysis of this notion. In this paper we provide a formal definition of stability and analyze some of its basic properties. Quite surprisingly, the conclusion of our analysis is that for large sample size, stability is fully determined by the behavior of the objective function which the clustering algorithm is aiming to minimize. If the objective function has a unique global minimizer, the algorithm is stable, otherwise it is unstable. In particular we conclude that stability is not a well-suited tool to determine the number of clusters - it is determined by the symmetries of the data which may be unrelated to clustering parameters. We prove our results for center-based clusterings and for spectral clustering, and support our conclusions by many examples in which the behavior of stability is counter-intuitive.", "paper_title": "A sober look at clustering stability", "paper_id": "WOS:000239587900004"}