{"auto_keywords": [{"score": 0.03153186549816821, "phrase": "bloomgraphs"}, {"score": 0.00481495049065317, "phrase": "rapidly_evolving_topic-subgraphs"}, {"score": 0.004695543202451537, "phrase": "large_online_social_networks"}, {"score": 0.004660505705333345, "phrase": "twitter"}, {"score": 0.00462531832552053, "phrase": "important_problem"}, {"score": 0.004579083503344774, "phrase": "considerable_interest"}, {"score": 0.004311178595606928, "phrase": "topical_community"}, {"score": 0.004268070459032083, "phrase": "underlying_social_graph"}, {"score": 0.0041102032028337366, "phrase": "key_metric"}, {"score": 0.003938306338115386, "phrase": "edge_activations"}, {"score": 0.0036522452243546756, "phrase": "great_use"}, {"score": 0.003588533760251239, "phrase": "bursty_topics"}, {"score": 0.0034125384776896696, "phrase": "considerable_scalability_challenge"}, {"score": 0.0033868916699805224, "phrase": "underlying_social_network"}, {"score": 0.002994178996584381, "phrase": "in-memory_approximation"}, {"score": 0.002832958297472413, "phrase": "bloom_filters"}, {"score": 0.0027834989278619974, "phrase": "underlying_graph"}, {"score": 0.002529652412291183, "phrase": "tracking_conductance"}, {"score": 0.0024054633108541983, "phrase": "small_memory_footprint"}, {"score": 0.0023933839684796994, "phrase": "efficient_updateability"}, {"score": 0.002230491796989549, "phrase": "approximate_conductance"}, {"score": 0.0021860169025888004, "phrase": "exact_conductance"}, {"score": 0.0021263052143077553, "phrase": "extensive_experimentation"}, {"score": 0.002115624727207135, "phrase": "large_twitter_graphs"}], "paper_keywords": ["Theory", " Conductance", " Bloom filters"], "paper_abstract": "Monitoring the formation and evolution of communities in large online social networks such as Twitter is an important problem that has generated considerable interest in both industry and academia. Fundamentally, the problem can be cast as studying evolving subgraphs (each subgraph corresponding to a topical community) on an underlying social graph - with users as nodes and the connection between them as edges. A key metric of interest in this setting is tracking the changes to the conductance of subgraphs induced by edge activations. This metric quantifies how well or poorly connected a subgraph is to the rest of the graph relative to its internal connections. Conductance has been demonstrated to be of great use in many applications, such as identifying bursty topics, tracking the spread of rumors, and so on. However, tracking this simple metric presents a considerable scalability challenge - the underlying social network is large, the number of communities that are active at any moment is large, the rate at which these communities evolve is high, and moreover, we need to track conductance in real-time. We address these challenges in this paper. We propose an in-memory approximation called BloomGraphs to store and update these (possibly overlapping) evolving subgraphs. As the name suggests, we use Bloom filters to represent an approximation of the underlying graph. This representation is compact and computationally efficient to maintain in the presence of updates. This is especially important when we need to simultaneously maintain thousands of evolving subgraphs. BloomGraphs are used in computing and tracking conductance of these subgraphs as edge-activations arrive. BloomGraphs have several desirable properties in the context of this application, including a small memory footprint and efficient updateability. We also demonstrate mathematically that the error incurred in computing conductance is one-sided and that in the case of evolving subgraphs the change in approximate conductance has the same sign as the change in exact conductance in most cases. We validate the effectiveness of BloomGraphs through extensive experimentation on large Twitter graphs and other social networks.", "paper_title": "Tracking the Conductance of Rapidly Evolving Topic-Subgraphs", "paper_id": "WOS:000386424900010"}