{"auto_keywords": [{"score": 0.047362124336083736, "phrase": "temporal_sequence"}, {"score": 0.04652284340152346, "phrase": "co-morbid_diseases"}, {"score": 0.015360974015315368, "phrase": "chronic_diseases"}, {"score": 0.014735435879120616, "phrase": "transition_rates"}, {"score": 0.013371802288737626, "phrase": "bivariate_co-morbidity_model"}, {"score": 0.013065930690017321, "phrase": "trivariate_co-morbidity_model"}, {"score": 0.012796555305837117, "phrase": "generalized_high-order_co-morbidity_model"}, {"score": 0.00893171122362707, "phrase": "p_values"}, {"score": 0.00481495049065317, "phrase": "multiple_pathways"}, {"score": 0.004792529198004001, "phrase": "temporal_natural_history"}, {"score": 0.004725886853744007, "phrase": "chronic_disease"}, {"score": 0.004344965512058521, "phrase": "thorny_issues"}, {"score": 0.00428451995524549, "phrase": "co-morbidity_stochastic_models"}, {"score": 0.004215057618794356, "phrase": "true_proportions"}, {"score": 0.00379452936798156, "phrase": "proposed_model"}, {"score": 0.0037504641715413287, "phrase": "population-based_health_check-up"}, {"score": 0.003638266287899602, "phrase": "matsu"}, {"score": 0.0035459454727560977, "phrase": "empirical_data"}, {"score": 0.0033919477901198716, "phrase": "underlying_population"}, {"score": 0.0032298783729987754, "phrase": "dm"}, {"score": 0.0031994292365575957, "phrase": "higher_likelihood"}, {"score": 0.0028464607144683247, "phrase": "proportional_hazards"}, {"score": 0.0028133741785871867, "phrase": "different_parameters"}, {"score": 0.002735522834514124, "phrase": "statistical_significance"}, {"score": 0.002691105581191125, "phrase": "bivariate_model"}, {"score": 0.0025561376388721683, "phrase": "satisfactory_model_fit"}, {"score": 0.002306123367679187, "phrase": "incidence_rates"}, {"score": 0.0022739766507258105, "phrase": "corresponding_transitions_rates"}, {"score": 0.0022110183535859374, "phrase": "complex_pathway"}, {"score": 0.0022006957146167294, "phrase": "high_dimension"}, {"score": 0.0021750990136123367, "phrase": "clinical_field"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Chronic disease", " Co-morbidity", " Latent variable", " Markov process"], "paper_abstract": "Chronic diseases frequently co-occur in individuals. Susceptibility to co-morbidity, the temporal sequence and the transition rates governing the development of co-morbid diseases are often hidden or partially observable. To tackle these thorny issues we developed a series of co-morbidity stochastic models with latent variables to estimate the true proportions of susceptibility, temporal sequence, and transition rates. We begin with a bivariate co-morbidity model for two chronic diseases, then extend to a trivariate co-morbidity model for three chronic diseases, and to a generalized high-order co-morbidity model to accommodate more than three chronic diseases. To illustrate our approach we fitted the proposed model with data from a population-based health check-up for hypertension, diabetes mellitus (DM), and overweight in Matsu. Compared with 3.93% of co-morbidity directly estimated from empirical data, approximately 12% (10%-14%) of participants have the potential of developing both hypertension and DM from the underlying population. Hypertension prior to DM was 74% (54.10%-93.77%) of these subjects susceptible to co-morbidity. Those who developed DM first had a higher likelihood of having hypertension (65.85 per 100 person-years; 95% CI: 15.61-116.09) compared with those with hypertension first and DM later (36.37 cases per 100 person-years; 95% CI: 14.57-58.18). Gender, smoking, and alcohol drinking modeled by incorporating them as covariates with proportional hazards form had impacts on different parameters of interest. The deviance statistics, indicating a lack of statistical significance (p values were 0.26 for the bivariate model) for the model without covariates and for the model with covariates (all p values > 0.05), suggest a satisfactory model fit. However, the trivariate co-morbidity model had poorer fit than the bivariate co-morbidity model. Our proposed co-morbidity stochastic latent variable models can tackle the problem of underestimating the proportion of susceptibility to co-morbidity, giving a clue to the temporal sequence of a constellation of co-morbid diseases, and quantifying the incidence rates of each disease and the corresponding transitions rates between co-morbid diseases. The generalized high-order co-morbidity model can be extended to model the complex pathway of high dimension of chronic diseases in the clinical field provided the dataset is sufficiently large. (C) 2012 Published by Elsevier B.V.", "paper_title": "Stochastic models for multiple pathways of temporal natural history on co-morbidity of chronic disease", "paper_id": "WOS:000310403700043"}