{"auto_keywords": [{"score": 0.048992899974696226, "phrase": "nominal_attributes"}, {"score": 0.015719716506582538, "phrase": "online_skyline_analysis"}, {"score": 0.015542316130590986, "phrase": "dynamic_preferences"}, {"score": 0.0045726187330434025, "phrase": "skyline_analysis"}, {"score": 0.004417848254181138, "phrase": "multicriteria_decision-making_applications"}, {"score": 0.0042928648367867835, "phrase": "previous_studies"}, {"score": 0.004219571240696568, "phrase": "fixed_order"}, {"score": 0.0036763623220059933, "phrase": "partial_orders"}, {"score": 0.002938317647182056, "phrase": "interesting_queries"}, {"score": 0.0025449518236394103, "phrase": "refined_skyline_query"}, {"score": 0.0024305268807926056, "phrase": "specific_order"}, {"score": 0.0023079225317714815, "phrase": "extensive_performance_study"}], "paper_keywords": ["Skyline", " materialization", " data warehouses", " preferences"], "paper_abstract": "The importance of skyline analysis has been well recognized in multicriteria decision-making applications. All of the previous studies assume a fixed order on the attributes in question. However, in some applications, users may be interested in skylines with respect to various total or partial orders on nominal attributes. In this paper, we identify and tackle the problem of online skyline analysis with dynamic preferences on nominal attributes. We investigate how changes of orders in attributes lead to changes of skylines. We address two novel types of interesting queries: a viewpoint query returns with respect to which orders a point is (or is not) in the skylines, and a refined skyline query retrieves the skyline with respect to a specific order. We develop two methods systematically and report an extensive performance study using both synthetic and real data sets to verify the effectiveness and the efficiency of our methods.", "paper_title": "Online Skyline Analysis with Dynamic Preferences on Nominal Attributes", "paper_id": "WOS:000260999100003"}