{"auto_keywords": [{"score": 0.04845849110410781, "phrase": "gpcr_genes"}, {"score": 0.04714657528813315, "phrase": "exon-intron_structures"}, {"score": 0.00481495049065317, "phrase": "diverse_exon-intron_structures"}, {"score": 0.004195418010131832, "phrase": "human_gpcr_genes"}, {"score": 0.0037617986040878342, "phrase": "large_diversity"}, {"score": 0.003221316290858497, "phrase": "adjacent_exon-exon_pairs"}, {"score": 0.002711109302199029, "phrase": "statistical_significance"}, {"score": 0.0025449518236394103, "phrase": "observed_splicing_isoforms"}, {"score": 0.0023346234464901978, "phrase": "exon_boundaries"}, {"score": 0.002129356014992349, "phrase": "specific_alternative_splicing"}, {"score": 0.0021049977753042253, "phrase": "functional_purposes"}], "paper_keywords": ["Gene structure", " alternative splicing", " G protein-coupled receptor", " GPCR", " exon-intron structures"], "paper_abstract": "The GPCR genes have a variety of exon-intron structures even though their proteins are all structurally homologous. We have examined all human GPCR genes with at least two functional protein isoforms, totaling 199, aiming to gain an understanding of what may have contributed to the large diversity of the exon-intron structures of the GPCR genes. The 199 genes have a total of 808 known protein splicing isoforms with experimentally verified functions. Our analysis reveals that 1301 (80.6%) adjacent exon-exon pairs out of the total of 1,613 in the 199 genes have either exactly one exon skipped or the intron in-between retained in at least one of the 808 protein splicing isoforms. This observation has a statistical significance p-value of 2.051762 * e(-09), assuming that the observed splicing isoforms are independent of the exon-intron structures. Our interpretation of this observation is that the exon boundaries of the GPCR genes are not randomly determined; instead they may be selected to facilitate specific alternative splicing for functional purposes.", "paper_title": "FUNCTIONAL UNDERSTANDING OF THE DIVERSE EXON-INTRON STRUCTURES OF HUMAN GPCR GENES", "paper_id": "WOS:000348346200007"}