{"auto_keywords": [{"score": 0.04359910369825113, "phrase": "chinese_notions"}, {"score": 0.02556871763634002, "phrase": "design_education"}, {"score": 0.00481507920716798, "phrase": "chinese"}, {"score": 0.004573537724320323, "phrase": "different_domains"}, {"score": 0.004344176114026701, "phrase": "artificial_world"}, {"score": 0.004302463542835521, "phrase": "novel_perspective"}, {"score": 0.0040343909885467485, "phrase": "conceptual_paper"}, {"score": 0.0039192497049015135, "phrase": "socio-technical_situations"}, {"score": 0.003881601350247482, "phrase": "trans-disciplinary_perspective"}, {"score": 0.003663157964665246, "phrase": "initial_ideas"}, {"score": 0.0033582480189327008, "phrase": "widest_sense"}, {"score": 0.0032518541963473405, "phrase": "future_products"}, {"score": 0.0029810774705309536, "phrase": "paper_results"}, {"score": 0.002933458667525067, "phrase": "disciplinary_terms"}, {"score": 0.002654693503799094, "phrase": "particular_aspects"}, {"score": 0.002629160426591144, "phrase": "disciplinary_approach"}, {"score": 0.00248903151226017, "phrase": "practical_application"}, {"score": 0.002326174890933973, "phrase": "second-order_cybernetics"}, {"score": 0.0023037942361136205, "phrase": "four-dimensional_design"}, {"score": 0.0022816284181888646, "phrase": "original_contribution"}, {"score": 0.0021669551936989886, "phrase": "south_china_university_of_technology"}, {"score": 0.002153031476985805, "phrase": "guangzhou"}, {"score": 0.0021049977753042253, "phrase": "students'_\"innovation_consciousness"}], "paper_keywords": ["China", " National cultures", " Li", " Second-order cybernetics", " Four-dimensional design", " Design education"], "paper_abstract": "Purpose - This paper aims to fuse some ideas within different domains perceived to have some resonance together with the purpose to assist the development of the artificial world using a novel perspective on design and cybernetics in the context of the Chinese notions of \"Li\". Design/methodology/approach - This is a conceptual paper that reviews concepts related to the design of socio-technical situations through a trans-disciplinary perspective. One method used to develop ideas was participation in the American Society of Cybernetics Conference - C:ADM 2010 and enable its participants to influence initial ideas presented by the authors. Findings - The paper provides a way of approaching the design of \"dynamics\" in the conceptualisation of artefacts in the widest sense of the term, and provides insights about designing future products, services and systems along with the education of designers in this. Research limitations/implications - The trans-disciplinary approach to topics covered by the paper results in some compromises in disciplinary terms, and it has a more intuitive approach than might be taken within the disciplines alone. The discussion is enhanced by this approach however, researchers are encouraged to follow up particular aspects within a disciplinary approach as well. Practical implications - The paper includes some examples of designs to illustrate the practical application of concepts discussed and how these may be incorporated into design education. Originality/value - The interrelationship of the Chinese notions of \"Li\", second-order cybernetics, and four-dimensional design is an original contribution. In addition the recommendation for design education generally, and a course for engineers at South China University of Technology, Guangzhou. in particular, to assist students' \"innovation consciousness\" is of value.", "paper_title": "Future \"designing\" and the Chinese notions of \"Li\"", "paper_id": "WOS:000296214100019"}