{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "refinement_modal_logic"}, {"score": 0.004191829338769843, "phrase": "standard_box"}, {"score": 0.003611751858608048, "phrase": "bisimulation_quantifier"}, {"score": 0.0035565113234273926, "phrase": "refinement_operator"}, {"score": 0.0030640804704319255, "phrase": "multi-agent_modal_logic"}, {"score": 0.002986329509791943, "phrase": "monadic_second-order_quantification"}, {"score": 0.002910545717767559, "phrase": "sound_and_complete_axiomatization"}, {"score": 0.0028807718824400697, "phrase": "multi-agent_refinement"}, {"score": 0.0026806884201358515, "phrase": "modal_mu-calculus"}, {"score": 0.002585906251354904, "phrase": "single-agent_version"}, {"score": 0.002159852420283463, "phrase": "dynamic_epistemic_logic"}, {"score": 0.0021049977753042253, "phrase": "detailed_results"}], "paper_keywords": [""], "paper_abstract": "In this paper we present refinement modal logic. A refinement is like a bisimulation, except that from the three relational requirements only 'atoms' and 'back' need to be satisfied. Our logic contains a new operator for all in addition to the standard box modalities for each agent. The operator for all acts as a quantifier over the set of all refinements of a given model. As a variation on a bisimulation quantifier, this refinement operator or refinement quantifier for all can be seen as quantifying over a variable not occurring in the formula bound by it. The logic combines the simplicity of multi-agent modal logic with some powers of monadic second-order quantification. We present a sound and complete axiomatization of multi-agent refinement modal logic. We also present an extension of the logic to the modal mu-calculus, and an axiomatization for the single-agent version of this logic. Examples and applications are also discussed: to software verification and design (the set of agents can also be seen as a set of actions), and to dynamic epistemic logic. We further give detailed results on the complexity of satisfiability, and on succinctness. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Refinement modal logic", "paper_id": "WOS:000345658400018"}