{"auto_keywords": [{"score": 0.04656392144364243, "phrase": "web_pages"}, {"score": 0.014896670495382616, "phrase": "web_accessibility_evaluation_methods"}, {"score": 0.004788851448504016, "phrase": "web_accessibility"}, {"score": 0.004749966632542467, "phrase": "disabled_people"}, {"score": 0.004068087482412997, "phrase": "barrier_walkthrough"}, {"score": 0.003969719785834687, "phrase": "bw_method"}, {"score": 0.003937459891461576, "phrase": "evaluation_method"}, {"score": 0.003800657736976392, "phrase": "different_user_groups"}, {"score": 0.003698656310338989, "phrase": "mobile_users"}, {"score": 0.003648683020392928, "phrase": "expertise_matters"}, {"score": 0.003408729906166478, "phrase": "important_factor"}, {"score": 0.003362660648932247, "phrase": "accessibility_evaluation"}, {"score": 0.003124401796325174, "phrase": "negative_monotonic_relationship"}, {"score": 0.0030157628075954588, "phrase": "five_experts"}, {"score": 0.002328271825420213, "phrase": "practical_implications"}, {"score": 0.00230932021677234, "phrase": "bw_results"}, {"score": 0.0021987994275190314, "phrase": "supplemental_materials"}, {"score": 0.0021396960731214203, "phrase": "publisher's_online_edition"}, {"score": 0.002128067018576581, "phrase": "human-computer_interaction"}, {"score": 0.0021165010328351693, "phrase": "statistical_details"}, {"score": 0.0021049977753042253, "phrase": "additional_measures"}], "paper_keywords": [""], "paper_abstract": "Web accessibility means that disabled people can effectively perceive, understand, navigate, and interact with the web. Web accessibility evaluation methods are needed to validate the accessibility of web pages. However, the role of subjectivity and of expertise in such methods is unknown and has not previously been studied. This article investigates the effect of expertise in web accessibility evaluation methods by conducting a Barrier Walkthrough (BW) study with 19 expert and 57 nonexpert judges. The BW method is an evaluation method that can be used to manually assess the accessibility of web pages for different user groups such as motor impaired, low vision, blind, and mobile users. Our results show that expertise matters, and even though the effect of expertise varies depending on the metric used to measure quality, the level of expertise is an important factor in the quality of accessibility evaluation of web pages. In brief, when pages are evaluated with nonexperts, we observe a drop in validity and reliability. We also observe a negative monotonic relationship between number of judges and reproducibility: more evaluators mean more diverse outputs. After five experts, reproducibility stabilizes, but this is not the case with nonexperts. The ability to detect all the problems increases with the number of judges: With 3 experts all problems can be found, but for such a level 14 nonexperts are needed. Even though our data show that experts rated pages differently, the difference is quite small. Finally, compared to nonexperts, experts spent much less time and the variability among them is smaller, they were significantly more confident, and they rated themselves as being more productive. The article discusses practical implications regarding how BW results should be interpreted, how to recruit evaluators, and what happens when more than one evaluator is hired. Supplemental materials are available for this article. Go to the publisher's online edition of Human-Computer Interaction for statistical details and additional measures for this article.", "paper_title": "The Expertise Effect on Web Accessibility Evaluation Methods", "paper_id": "WOS:000299250100003"}