{"auto_keywords": [{"score": 0.015615632001564043, "phrase": "different_sizes"}, {"score": 0.0052708638569617374, "phrase": "dkt_phenomena"}, {"score": 0.005148450100079659, "phrase": "dkt_process"}, {"score": 0.004502126088469323, "phrase": "two-dimensional_infinite_channel"}, {"score": 0.004442032546224076, "phrase": "lattice_boltzmann_equation"}, {"score": 0.004397487039229447, "phrase": "multiple-relaxation-time_collision_model"}, {"score": 0.00418134346679498, "phrase": "longitudinal_distance"}, {"score": 0.00407042677958844, "phrase": "flow_pattern"}, {"score": 0.0036676174658755683, "phrase": "larger_particle"}, {"score": 0.003510754567808717, "phrase": "smaller_particle"}, {"score": 0.003452218803245602, "phrase": "larger_one"}, {"score": 0.003417565253539315, "phrase": "simulation_results"}, {"score": 0.0024576084154573396, "phrase": "particle_diameter_ratio_gamma"}, {"score": 0.0022668507535947976, "phrase": "one-off_dkt_process"}, {"score": 0.002206606452557159, "phrase": "additional_mode"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sedimentation", " Lattice Boltzmann method", " Drafting, kissing and tumbling phenomenon"], "paper_abstract": "We numerically study the drafting, kissing and tumbling (DKT) phenomenon of two non-identical circular particles sedimenting in a two-dimensional infinite channel by using the lattice Boltzmann equation with a multiple-relaxation-time collision model. The main emphasis of this work is to investigate the effect of the longitudinal distance and diameter ratio between'two particles on the flow pattern during sedimentation. The method is first validated by simulating the sedimentation of one single particle and two identical particles. For two particles with different sizes, two cases are considered: in Case-1, the larger particle is initially located above the smaller one; in Case-2, the smaller particle is initially above the larger one. The simulation results are compared with the case of two equal-sized particles. The results show that two particles with different sizes are easier to separate than two identical ones. In particular, the effects of initial longitudinal distance (D-h) and diameter ratio on the occurrence of the DKT process are studied in detail. With changing these two parameters, the results reveal the transitions between the DKT phenomena. It is shown that the DKT process can take place (only once) regardless of any value of D-h in Case-1, while in Case-2, the two particles will never undergo the DKT process when increasing D-h beyond a certain threshold. The results also show that, as the particle diameter ratio gamma is increased starting from 1, in Case-1 the two particles will interact by undergoing two transitions of the DKT phenomena: from the repeated to the one-off DKT process, while in Case-2 there exists an additional mode: the gap increases continuously from the start. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Drafting, kissing and tumbling process of two particles with different sizes", "paper_id": "WOS:000336775700003"}