{"auto_keywords": [{"score": 0.049226991195811136, "phrase": "singapore_schools"}, {"score": 0.010549411880674882, "phrase": "pedagogical_practices"}, {"score": 0.00988062688811722, "phrase": "teachers'_beliefs"}, {"score": 0.008770447145520124, "phrase": "pedagogical_approaches"}, {"score": 0.007972083328629883, "phrase": "epistemic_ideas"}, {"score": 0.004817588277385965, "phrase": "impact"}, {"score": 0.004757643419056999, "phrase": "technology_use"}, {"score": 0.0039991106435277495, "phrase": "ict"}, {"score": 0.003800507899554071, "phrase": "school_culture"}, {"score": 0.0036993855514735746, "phrase": "singapore_teachers"}, {"score": 0.0034946232062615813, "phrase": "stable_cognitive_structures"}, {"score": 0.0033812801309408514, "phrase": "different_contexts"}, {"score": 0.0031940685896742356, "phrase": "eight_principals"}, {"score": 0.003081190713096043, "phrase": "structured_interviews"}, {"score": 0.002790867657645595, "phrase": "main_findings"}, {"score": 0.0027165361453855095, "phrase": "epistemological_beliefs"}, {"score": 0.002612640527241776, "phrase": "rather_teachers'_beliefs"}, {"score": 0.002482734080358268, "phrase": "pedagogical_strategies"}, {"score": 0.002453116398642071, "phrase": "teacher-directed_and_learner-centered_approaches"}, {"score": 0.0023241387549221408, "phrase": "relatively_fixed_and_stable_\"beliefs"}, {"score": 0.002269008698686152, "phrase": "epistemic_resources"}, {"score": 0.002143247921132179, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Epistemological beliefs", " Epistemic resources", " Country-specific developments", " Learning technologies", " Improving classroom teaching", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "This paper reports on two studies conducted in 2006 in the Singapore schools to investigate the relationships between teachers' beliefs about knowledge and learning, their pedagogical practices, and uses of information and communications technologies (ICT). Three primary research questions were examined in this research: First, do teachers' beliefs about knowledge and learning influence the uses of ICT, pedagogical approaches, and types of assessments used in the Singapore schools? Second, does the school culture influence the uses of pedagogical approaches and ICT by Singapore teachers in their classes? Third, are the epistemic ideas about the nature of knowledge and learning beliefs that are stable cognitive structures or are they resources that are more adaptively shaped to different contexts? In Study 1, 1882 teachers from 51 schools took part in the 187-item online survey on these areas, and Study 2 involved eight principals, two vice-principals, 33 heads of department, and 60 teachers in structured interviews. It had been hypothesized that beliefs about the nature of knowledge being complex and changing would be associated with more learner-centered pedagogical practices and uses of technology in the classrooms. However, the main findings of Study 1 suggest that it is not epistemological beliefs of teachers about knowledge and knowing that shape pedagogical practices in Singapore schools, but rather teachers' beliefs about learning. From the interviews in Study 2, it appears that teachers tend to mix pedagogical strategies consisting of both teacher-directed and learner-centered approaches primarily based on beliefs about learning. Our research findings also suggest that epistemic ideas teachers have may not be relatively fixed and stable \"beliefs\" but rather are more contextually influenced epistemic resources. The paper concludes with a discussion of these findings and their implications for theory, practice, and future research. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Epistemology and learning: Impact on pedagogical practices and technology use in Singapore schools", "paper_id": "WOS:000282349200026"}