{"auto_keywords": [{"score": 0.032329774677387874, "phrase": "gis"}, {"score": 0.00481495049065317, "phrase": "video_landmark_retrieval"}, {"score": 0.004714023408114857, "phrase": "sensor-equipped_smartphones"}, {"score": 0.004518442937844318, "phrase": "associated_geographic_metadata"}, {"score": 0.004317848984770719, "phrase": "new_opportunities"}, {"score": 0.004227297479492541, "phrase": "geo-referenced_videos"}, {"score": 0.004101208934887704, "phrase": "landmark_retrieval"}, {"score": 0.00375634209110551, "phrase": "content-based_method"}, {"score": 0.0036998728605395384, "phrase": "spatial_pyramid_matching"}, {"score": 0.0034195866335851935, "phrase": "geo-based_method"}, {"score": 0.0033681627448832996, "phrase": "geo_landmark_visibility_determination"}, {"score": 0.0031990183472675377, "phrase": "camera's_field"}, {"score": 0.0031035049228517715, "phrase": "landmark's_geometric_information"}, {"score": 0.0030754091839133705, "phrase": "geographic_information_systems"}, {"score": 0.00297454367746853, "phrase": "retrieval_results"}, {"score": 0.002548331088496964, "phrase": "hybrid_retrieval_method"}, {"score": 0.002405618568415162, "phrase": "significant_improvements"}, {"score": 0.002270880088524628, "phrase": "future_geo-referenced_video_retrieval_systems"}, {"score": 0.0021049977753042253, "phrase": "different_conditions"}], "paper_keywords": ["Experimentation", " Content-based analysis", " geo-referenced videos", " landmark retrieval"], "paper_abstract": "Due to the ubiquity of sensor-equipped smartphones, it has become increasingly feasible for users to capture videos together with associated geographic metadata, for example the location and the orientation of the camera. Such contextual information creates new opportunities for the organization and retrieval of geo-referenced videos. In this study we explore the task of landmark retrieval through the analysis of two types of state-of-the-art techniques, namely media-content-based and geocontext-based retrievals. For the content-based method, we choose the Spatial Pyramid Matching (SPM) approach combined with two advanced coding methods: Sparse Coding (SC) and Locality-Constrained Linear Coding (LLC). For the geo-based method, we present the Geo Landmark Visibility Determination (GeoLVD) approach which computes the visibility of a landmark based on intersections of a camera's field-of-view (FOV) and the landmark's geometric information available from Geographic Information Systems (GIS) and services. We first compare the retrieval results of the two methods, and discuss the strengths and weaknesses of each approach in terms of precision, recall and execution time. Next we analyze the factors that affect the effectiveness for the content-based and the geo-based methods, respectively. Finally we propose a hybrid retrieval method based on the integration of the visual (content) and geographic (context) information, which is shown to achieve significant improvements in our experiments. We believe that the results and observations in this work will enlighten the design of future geo-referenced video retrieval systems, improve our understanding of selecting the most appropriate visual features for indexing and searching, and help in selecting between the most suitable methods for retrieval based on different conditions.", "paper_title": "Content vs. Context: Visual and Geographic Information Use in Video Landmark Retrieval", "paper_id": "WOS:000349852500007"}