{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "othello"}, {"score": 0.009989523902509468, "phrase": "large_state_spaces"}, {"score": 0.008040666538257827, "phrase": "reinforcement_learning"}, {"score": 0.00469445816161498, "phrase": "management_science"}, {"score": 0.00457696724030363, "phrase": "sequential_decision_making_problems"}, {"score": 0.004485085675709643, "phrase": "standard_methods"}, {"score": 0.0039310261964323545, "phrase": "so-called_curse"}, {"score": 0.00349803055484394, "phrase": "sequential_decision"}, {"score": 0.0032415934630668484, "phrase": "function_approximation_method"}, {"score": 0.002342048999008582, "phrase": "human_experts"}, {"score": 0.002248755794042486, "phrase": "learning_agents"}, {"score": 0.0021049977753042253, "phrase": "basic_strategies"}], "paper_keywords": ["dynamic programming", " Markov decision processes", " reinforcement learning", " Q-learning", " multiagent learning", " neural networks", " game playing", " Othello"], "paper_abstract": "Operations research and management science are often confronted with sequential decision making problems with large state spaces. Standard methods that are used for solving such complex problems are associated with some difficulties. As we discuss in this article, these methods are plagued by the so-called curse of dimensionality and the curse of modelling. In this article, we discuss reinforcement learning, a machine learning technique for solving sequential decision making problems with large state spaces. We describe how reinforcement learning can be combined with a function approximation method to avoid both the curse of dimensionality and the curse of modelling. To illustrate the usefulness of this approach, we apply it to a problem with a huge state space-learning to play the game of Othello. We describe experiments in which reinforcement learning agents learn to play the game of Othello without the use of any knowledge provided by human experts. It turns out that the reinforcement learning agents learn to play the game of Othello better than players that use basic strategies. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Application of reinforcement learning to the game of Othello", "paper_id": "WOS:000251294600016"}