{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004747997855358171, "phrase": "special_nature"}, {"score": 0.004552648949390462, "phrase": "establishment_of_a_group_key"}, {"score": 0.004205226397573506, "phrase": "key_agreement_protocol"}, {"score": 0.003672427620845944, "phrase": "efficient_group_key_agreement_protocol"}, {"score": 0.0032674478600540477, "phrase": "small_clusters"}, {"score": 0.0031770714776989282, "phrase": "synchronous_execution"}, {"score": 0.0031475032122226, "phrase": "efficient_tripartite_key_agreement_protocols"}, {"score": 0.0030604342671868836, "phrase": "required_computations"}, {"score": 0.0028799352389969443, "phrase": "exchanged_messages"}, {"score": 0.0028133741785871867, "phrase": "storage_memory"}, {"score": 0.002684819249720834, "phrase": "proposed_protocol"}, {"score": 0.0026474076254702525, "phrase": "good_energy_balance"}, {"score": 0.002300734266971646, "phrase": "unauthenticated_and_authenticated_versions"}, {"score": 0.0022475295254231714, "phrase": "previously_known_protocols"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Group key agreement", " Ad hoc networks", " Pairings", " Joux's tripartite key agreement protocol"], "paper_abstract": "The special nature and the constraints posed by wireless ad hoc networks make the establishment of a group key among all nodes a difficult and challenging task. Therefore, the execution of a group key agreement protocol which involves all the nodes in the network must be very carefully selected having in mind both the computation and communication efficiency. In this paper, we present an efficient group key agreement protocol which is particularly suitable for energy constrained, dynamically evolving wireless ad hoc networks. The topology of the network is reflected in a structure composed by small clusters. This clustering allows the synchronous execution of efficient tripartite key agreement protocols based on pairings. The required computations are simple for the devices to implement, the size of the exchanged messages is minimum and the storage memory required in every node is very small. The proposed protocol achieves a good energy balance and is very flexible because it can be used either as contributory, non-contributory, unauthenticated or authenticated protocol by simply modifying a step of the protocol. Finally, we compare the communication/computation complexity of the unauthenticated and authenticated versions of our protocol with previously known protocols and show that they compare favourably with them. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient cluster-based group key agreement protocols for wireless ad hoc networks", "paper_id": "WOS:000285442200033"}