{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_possessions"}, {"score": 0.007037704239624443, "phrase": "digital_items"}, {"score": 0.004605147081797856, "phrase": "specific_qualities"}, {"score": 0.004440277230269978, "phrase": "twenty-three_participants"}, {"score": 0.003806541299696042, "phrase": "individual's_identity"}, {"score": 0.003524322230452833, "phrase": "bounded_control"}, {"score": 0.0034676182423067307, "phrase": "archival_concepts"}, {"score": 0.003356923403930231, "phrase": "defining_characteristics"}, {"score": 0.003223494720348768, "phrase": "former_studies"}, {"score": 0.0031974502006267163, "phrase": "material_possessions"}, {"score": 0.0029244418026475832, "phrase": "archival_principles"}, {"score": 0.0028195727965553367, "phrase": "individual_and_digital_item_relationship"}, {"score": 0.002762941385784905, "phrase": "new_areas"}, {"score": 0.0027184540871935284, "phrase": "outreach_services"}, {"score": 0.0026103363762901423, "phrase": "archival_and_library_reference_services"}, {"score": 0.0023776656246300063, "phrase": "individuals'_relationships"}, {"score": 0.002311047934798247, "phrase": "starting_point"}, {"score": 0.0022281257694320433, "phrase": "personal_information_management_consulting"}, {"score": 0.0022011501095573747, "phrase": "new_area"}, {"score": 0.002165688807780663, "phrase": "information_services"}, {"score": 0.0021049977753042253, "phrase": "personal_digital_material"}], "paper_keywords": ["digital objects", " information science", " archival science"], "paper_abstract": "Digital possessions are digital items that individuals distinguish from other digital items by specific qualities that individuals perceive the digital items to possess. Twenty-three participants were interviewed about their definitions of and relationships with digital possessions to identify the most salient characteristics of digital possessions and to inform preservation. Findings indicate that digital possessions are characterized as (a) providing evidence of the individual, (b) representing the individual's identity, (c) being recognized as having value, and (d) exhibiting a sense of bounded control. Furthermore, archival concepts of primary, secondary, and intrinsic values provide the frame for the defining characteristics. Although several findings from this study are consistent with former studies of material possessions and digital possessions, this study expands research in the area using the concept of digital possessions to inform preservation and by applying archival principles of value. Understanding the nature of the individual and digital item relationship provides potential to explore new areas of reference and outreach services in libraries and archives. As the nature of archival and library reference services evolves, some scholars have predicted that archives and libraries will play a part in helping individuals manage their personal collections An exploration of individuals' relationships with their digital possessions can serve as a starting point at which scholars can explore the potential of personal information management consulting as a new area of reference and information services, specifically for the preservation of personal digital material.", "paper_title": "It's stuff that speaks to me: Exploring the characteristics of digital possessions", "paper_id": "WOS:000321743500016"}