{"auto_keywords": [{"score": 0.025904720923515194, "phrase": "agent_network"}, {"score": 0.01529163007875935, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "emergent_structure"}, {"score": 0.004579005794486596, "phrase": "social_individuals"}, {"score": 0.003960101604693806, "phrase": "multiagent_system"}, {"score": 0.00389427992231721, "phrase": "locally-interacting_social_individuals"}, {"score": 0.003256526411907174, "phrase": "aoc_model"}, {"score": 0.0030967107893195246, "phrase": "service-based_interactions"}, {"score": 0.002707741309851526, "phrase": "dynamic_relationships"}, {"score": 0.002677616534005393, "phrase": "global_performance"}, {"score": 0.0026478260192958924, "phrase": "local_interaction"}, {"score": 0.002531933388815139, "phrase": "network_topology"}, {"score": 0.0024897902536499005, "phrase": "experimental_results"}, {"score": 0.002354302193867031, "phrase": "high_clustering_coefficient"}, {"score": 0.0021049977753042253, "phrase": "local_interaction_strategies"}], "paper_keywords": ["Autonomy-Oriented Computing (AOC)", " dynamics of social networks", " service transactions", " network topology", " network performance"], "paper_abstract": "A social network is composed of social individuals and their relationships. In many real-world applications, such a network will evolve dynamically over time and events. A social network can be naturally viewed as a multiagent system if considering locally-interacting social individuals as autonomous agents. In this paper, we present an Autonomy-Oriented Computing (AOC) based model of a social network, and study the dynamics of the network based on this model. In the AOC model, the pro. le of agents, service-based interactions, and the evolution of the network are defined, and the autonomy of the agents is emphasized. The model can reveal dynamic relationships among global performance, local interaction ( partner selection) strategies, and network topology. The experimental results show that the agent network forms a community with a high clustering coefficient, and the performance of the network is dynamically changing along with the formation of the network and the local interaction strategies of the agents. In this paper, the performance and topology of the agent network are analyzed, and the factors that affect the performance and evolution of the agent network are examined.", "paper_title": "Autonomy-oriented social networks modeling: Discovering the dynamics of emergent structure and performance", "paper_id": "WOS:000251312600002"}