{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "affective_computing"}, {"score": 0.004589763483242731, "phrase": "emotional_connotations"}, {"score": 0.004237512575106522, "phrase": "sentence_emotion"}, {"score": 0.004203803478570494, "phrase": "word_emotion"}, {"score": 0.00405538690701843, "phrase": "easy_conversion"}, {"score": 0.004023120753104693, "phrase": "existing_computational_representations"}, {"score": 0.0031654684543975077, "phrase": "easy_way"}, {"score": 0.00288736193515505, "phrase": "semantic_web_technologies"}, {"score": 0.002818909613625567, "phrase": "word_dependency_relations"}, {"score": 0.0026547761341670505, "phrase": "word_dependency"}, {"score": 0.002530359917257626, "phrase": "word_dependencies"}, {"score": 0.0024901940672239784, "phrase": "automated_classification"}, {"score": 0.0024703502756471514, "phrase": "mark-up_results"}, {"score": 0.002363995836370621, "phrase": "unrestricted_input"}, {"score": 0.0023171750718791713, "phrase": "restricted_set"}, {"score": 0.0022712795176156536, "phrase": "particular_rules"}, {"score": 0.002147540520631409, "phrase": "configuration_parameters"}, {"score": 0.0021049977753042253, "phrase": "emotional_voice_synthesis"}], "paper_keywords": ["Affective computing", " Emotional annotation", " Reasoning", " Ontologies"], "paper_abstract": "With the advent of affective computing, the task of adequately identifying, representing and processing the emotional connotations of text has acquired importance. Two problems facing this task are addressed in this paper: the composition of sentence emotion from word emotion, and a representation of emotion that allows easy conversion between existing computational representations. The emotion of a sentence of text should be derived by composition of the emotions of the words in the sentence, but no method has been proposed so far to model this compositionality. Of the various existing approaches for representing emotions, some are better suited for some problems and some for others, but there is no easy way of converting from one to another. This paper presents a system that addresses these two problems by reasoning with two ontologies implemented with Semantic Web technologies: one designed to represent word dependency relations within a sentence, and one designed to represent emotions. The ontology of word dependency relies on roles to represent the way emotional contributions project over word dependencies. By applying automated classification of mark-up results in terms of the emotion ontology the system can interpret unrestricted input in terms of a restricted set of concepts for which particular rules are provided. The rules applied at the end of the process provide configuration parameters for a system for emotional voice synthesis.", "paper_title": "Ontological reasoning for improving the treatment of emotions in text", "paper_id": "WOS:000284486700001"}