{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "imminent_attack"}, {"score": 0.004732444672509326, "phrase": "bilevel_fixed_charge_facility_location_problem"}, {"score": 0.004524455848517757, "phrase": "public_service"}, {"score": 0.004385819169212677, "phrase": "customer-facility_assignments"}, {"score": 0.0041211075804202905, "phrase": "sufficient_capacity"}, {"score": 0.0038323244983352587, "phrase": "protected_or_unprotected_mode"}, {"score": 0.0036259093827331725, "phrase": "worst-case_scenario"}, {"score": 0.003466382911409222, "phrase": "facility_sites"}, {"score": 0.0034069061502294685, "phrase": "different_costs"}, {"score": 0.0033023994098455457, "phrase": "unprotected_facilities"}, {"score": 0.0031680109156103334, "phrase": "total_post-attack_cost"}, {"score": 0.002976581914095474, "phrase": "closest_available_facilities"}, {"score": 0.002956037056206635, "phrase": "capacity_expansion"}, {"score": 0.002865320947289691, "phrase": "static_stackelberg_game"}, {"score": 0.0026550871446763082, "phrase": "tabu_search_heuristic"}, {"score": 0.0026276369627747896, "phrase": "hash_function"}, {"score": 0.00258251424573557, "phrase": "hash_values"}, {"score": 0.0025558124513934584, "phrase": "visited_solutions"}, {"score": 0.002451730979693715, "phrase": "sequential_method"}, {"score": 0.0024179854244287795, "phrase": "location_and_protection_decisions"}, {"score": 0.002149231173009159, "phrase": "exhaustive_search_algorithm"}, {"score": 0.0021343846011837204, "phrase": "test_results"}, {"score": 0.0021049977753042253, "phrase": "defender's_facility_opening_plan"}], "paper_keywords": ["Fixed charge facility location", " Protection", " Interdiction", " Bilevel programming", " Tabu search", " Hash function"], "paper_abstract": "We investigate a bilevel fixed charge facility location problem for a system planner (the defender) who has to provide public service to customers. The defender cannot dictate customer-facility assignments since the customers pick their facility of choice according to its proximity. Thus, each facility must have sufficient capacity installed to accommodate all customers for whom it is the closest one. Facilities can be opened either in the protected or unprotected mode. Protection immunizes against an attacker who is capable of destroying at most r unprotected facilities in the worst-case scenario. Partial protection or interdiction is not possible. The defender selects facility sites from m candidate locations which have different costs. The attacker is assumed to know the unprotected facilities with certainty. He makes his interdiction plan so as to maximize the total post-attack cost incurred by the defender. If a facility has been interdicted, its customers are reallocated to the closest available facilities making capacity expansion necessary. The problem is formulated as a static Stackelberg game between the defender (leader) and the attacker (follower). Two solution methods are proposed. The first is a tabu search heuristic where a hash function calculates and records the hash values of all visited solutions for the purpose of avoiding cycling. The second is a sequential method in which the location and protection decisions are separated. Both methods are tested on 60 randomly generated instances in which m ranges from 10 to 30, and r varies between 1 and 3. The solutions are further validated by means of an exhaustive search algorithm. Test results show that the defender's facility opening plan is sensitive to the protection and distance costs. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A bilevel fixed charge location model for facilities under imminent attack", "paper_id": "WOS:000298532900007"}