{"auto_keywords": [{"score": 0.02917331890726892, "phrase": "tja"}, {"score": 0.00481495049065317, "phrase": "distributed_network"}, {"score": 0.00407533728096378, "phrase": "cost_metric"}, {"score": 0.003592581806180854, "phrase": "irrelevant_results"}, {"score": 0.0035265659032655845, "phrase": "multi-hop_distributed_networks"}, {"score": 0.00328654473734697, "phrase": "computation_framework"}, {"score": 0.0032622464094096463, "phrase": "emerging_sensor_networks"}, {"score": 0.0031904205547902695, "phrase": "peer_networks"}, {"score": 0.00310031965275924, "phrase": "threshold"}, {"score": 0.0029621948240346092, "phrase": "non-uniform_threshold"}, {"score": 0.002929394386754424, "phrase": "queried_attribute"}, {"score": 0.002650018880406324, "phrase": "centralized_fashion"}, {"score": 0.0025157865918985704, "phrase": "extensive_experimental_evaluation"}, {"score": 0.002469508424323385, "phrase": "real_testbed"}, {"score": 0.00241509422805775, "phrase": "trace-driven_experimental_methodology"}, {"score": 0.0023184226291364097, "phrase": "magnitude_less_communication"}, {"score": 0.002152440300818582, "phrase": "network_topology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed Top-K query processing", " P2P networks", " Sensor networks"], "paper_abstract": "In this paper, we present an algorithm for finding the k highest-ranked (or Top-k) answers in a distributed network. A Top-K query returns the subset of most relevant answers, in place of all answers, for two reasons: (i) to minimize the cost metric that is associated with the retrieval of all answers; and (ii) to improve the recall and the precision of the answer-set, such that the user is not overwhelmed with irrelevant results. Our study focuses on multi-hop distributed networks in which the data is accessible by traversing a network of nodes. Such a setting captures very well the computation framework of emerging Sensor Networks, Peer-to-Peer Networks and Vehicular Networks. We present the Threshold join Algorithm (TJA), an efficient algorithm that utilizes a non-uniform threshold on the queried attribute in order to minimize the transfer of data when a query is executed. Additionally, TJA resolves queries in the network rather than in a centralized fashion which further minimizes the consumption of bandwidth and delay. We performed an extensive experimental evaluation of our algorithm using a real testbed of 75 workstations along with a trace-driven experimental methodology. Our results indicate that TJA requires an order of magnitude less communication than the state-of-the-art, scales well with respect to the parameter k and the network topology. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Finding the K highest-ranked answers in a distributed network", "paper_id": "WOS:000266531000008"}