{"auto_keywords": [{"score": 0.04204224612471482, "phrase": "backpressure_algorithm"}, {"score": 0.02951743842201432, "phrase": "iterative_maxweight_algorithm"}, {"score": 0.00481495049065317, "phrase": "multichannel_relay_networks"}, {"score": 0.0033759367489122716, "phrase": "maxweight_algorithm-variants"}, {"score": 0.003258090521354736, "phrase": "good_performance"}, {"score": 0.0032088487124106936, "phrase": "single-hop_setting"}, {"score": 0.003144345057121367, "phrase": "general_relay_setting"}, {"score": 0.003081137701194149, "phrase": "maxweight"}, {"score": 0.0027000395818027366, "phrase": "downlink_multichannel_relay_networks"}, {"score": 0.0023780209525032688, "phrase": "full-duplex_relays"}, {"score": 0.0023183698048498797, "phrase": "half-duplex_relays"}, {"score": 0.00217017119491777, "phrase": "iterative_maxweight"}], "paper_keywords": ["Downlink relay networks", " wireless scheduling and routing"], "paper_abstract": "We study routing and scheduling algorithms for relay-assisted, multichannel downlink wireless networks [e.g., orthogonal frequency-division multiplexing (OFDM)-based cellular systems with relays]. Over such networks, while it is well understood that the BackPressure algorithm is stabilizing (i.e., queue lengths do not become arbitrarily large), its performance (e.g., delay, buffer usage) can be poor. In this paper, we study an alternative-the MaxWeight algorithm-variants of which are known to have good performance in a single-hop setting. In a general relay setting, however, MaxWeight is not even stabilizing (and thus can have very poor performance). In this paper, we study an iterative MaxWeight algorithm for routing and scheduling in downlink multichannel relay networks. We show that, surprisingly, the iterative MaxWeight algorithm can stabilize the system in several large-scale instantiations of this setting (e.g., general arrivals with full-duplex relays, bounded arrivals with half-duplex relays). Furthermore, using both many-channel large-deviations analysis and simulations, we show that iterative MaxWeight outperforms the BackPressure algorithm from a queue-length/delay perspective.", "paper_title": "MaxWeight Versus BackPressure: Routing and Scheduling in Multichannel Relay Networks", "paper_id": "WOS:000363254100016"}