{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_process_models"}, {"score": 0.0046046429665581555, "phrase": "large_organizations"}, {"score": 0.0036991458715587163, "phrase": "notable_research_gap"}, {"score": 0.0036498637283470386, "phrase": "different_approaches"}, {"score": 0.0032492519841546682, "phrase": "process_repositories"}, {"score": 0.0031773926428131233, "phrase": "node_matching_similarity"}, {"score": 0.00303839203670705, "phrase": "model_elements"}, {"score": 0.002918483026678636, "phrase": "element_labels"}, {"score": 0.0028284924551705516, "phrase": "process_models"}, {"score": 0.00269263690712392, "phrase": "causal_relations"}, {"score": 0.002644865209801606, "phrase": "process_model"}, {"score": 0.0024075916292945715, "phrase": "comparable_results"}, {"score": 0.0023754752864092437, "phrase": "structural_similarity"}, {"score": 0.0022613292987262177, "phrase": "text-based_search_engines"}, {"score": 0.002162316557411786, "phrase": "similar_business_process_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business process management", " Process similarity", " Process model repository", " Process model search"], "paper_abstract": "It is common for large organizations to maintain repositories of business process models in order to document and to continuously improve their operations. Given such a repository, this paper deals with the problem of retrieving those models in the repository that most closely resemble a given process model or fragment thereof. Up to now, there is a notable research gap on comparing different approaches to this problem and on evaluating them in the same setting. Therefore, this paper presents three similarity metrics that can be used to answer queries on process repositories: (i) node matching similarity that compares the labels and attributes attached to process model elements; (ii) structural similarity that compares element labels as well as the topology of process models; and (iii) behavioral similarity that compares element labels as well as causal relations captured in the process model. These metrics are experimentally evaluated in terms of precision and recall. The results show that all three metrics yield comparable results, with structural similarity slightly outperforming the other two metrics. Also, all three metrics outperform text-based search engines when it comes to searching through a repository for similar business process models. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Similarity of business process models: Metrics and evaluation", "paper_id": "WOS:000285366700020"}