{"auto_keywords": [{"score": 0.035366979368155665, "phrase": "service_level"}, {"score": 0.029544044557666654, "phrase": "total_operating_costs"}, {"score": 0.004533427352547707, "phrase": "school_bus_routing_and_scheduling_problem"}, {"score": 0.004379977556546879, "phrase": "nonperiodic_public_transportation_systems"}, {"score": 0.0036710872046569532, "phrase": "bus_network_structure"}, {"score": 0.003531474887552889, "phrase": "operating_costs"}, {"score": 0.003310447652300423, "phrase": "perceived_service_quality"}, {"score": 0.0030898642396380662, "phrase": "user_ride_times"}, {"score": 0.0029214769181390653, "phrase": "positive_impact"}, {"score": 0.0028963961037320805, "phrase": "service_quality"}, {"score": 0.0028591768694918, "phrase": "main_objective"}, {"score": 0.002726740692380339, "phrase": "heuristic_solution_framework"}, {"score": 0.002437525632451029, "phrase": "time_loss"}, {"score": 0.0024061887405214186, "phrase": "user_ride_time"}, {"score": 0.0022168460543913787, "phrase": "average_and_maximum_user_ride_times"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["school bus routing", " transfers", " routing and scheduling", " metaheuristic"], "paper_abstract": "In this article, we study the school bus routing and scheduling problem with transfers arising in the field of nonperiodic public transportation systems. It deals with the transportation of pupils from home to their school in the morning taking the possibility that pupils may change buses into account. Allowing transfers has several consequences. On the one hand, it allows more flexibility in the bus network structure and can, therefore, help to reduce operating costs. On the other hand, transfers have an impact on the service level: the perceived service quality is lower due to the existence of transfers; however, at the same time, user ride times may be reduced and, thus, transfers may also have a positive impact on service quality. The main objective is the minimization of the total operating costs. We develop a heuristic solution framework to solve this problem and compare it with two solution concepts that do not consider transfers. The impact of transfers on the service level in terms of time loss (or user ride time) and the number of transfers is analyzed. Our results show that allowing transfers reduces total operating costs significantly while average and maximum user ride times are comparable to solutions without transfers. (c) 2015 Wiley Periodicals, Inc. NETWORKS, Vol. 65(2), 180-203 2015", "paper_title": "The School Bus Routing and Scheduling Problem with Transfers", "paper_id": "WOS:000349818900007"}