{"auto_keywords": [{"score": 0.03857748388499955, "phrase": "nash_equilibria"}, {"score": 0.010553456742586977, "phrase": "ad_hoc_networks"}, {"score": 0.010320956017783527, "phrase": "network_nodes"}, {"score": 0.00481495049065317, "phrase": "topology_control_games"}, {"score": 0.004734718930096544, "phrase": "topology_control_problems"}, {"score": 0.004565419586112417, "phrase": "desired_connectivity_properties"}, {"score": 0.00436530211426514, "phrase": "different_entities"}, {"score": 0.00416223958248046, "phrase": "overall_performance"}, {"score": 0.004104325562579697, "phrase": "game_theory"}, {"score": 0.004069963083642548, "phrase": "appropriate_tool"}, {"score": 0.0039024014688338964, "phrase": "power_levels"}, {"score": 0.0031094742030008346, "phrase": "intermediate_nodes"}, {"score": 0.00289885212998798, "phrase": "incentive-compatible_algorithms"}, {"score": 0.002802867698544655, "phrase": "social_optimum"}, {"score": 0.0027638156862940465, "phrase": "radius_assignment"}, {"score": 0.002732965124214202, "phrase": "total_cost"}, {"score": 0.002328895457218392, "phrase": "strong_connectivity_game"}, {"score": 0.002289993730291138, "phrase": "wireless_networks"}, {"score": 0.002277171099621041, "phrase": "directional_antennas"}, {"score": 0.002264420105254984, "phrase": "wireline_networks"}, {"score": 0.0021467832366847007, "phrase": "first_step"}, {"score": 0.002128774777817861, "phrase": "-theoretic_analyses"}, {"score": 0.0021168529640131326, "phrase": "topology_control"}, {"score": 0.0021049977753042253, "phrase": "wireless_and_wireline_networks"}], "paper_keywords": ["ad hoc networks", " wireline networks", " directional antenna networks", " game theory", " Nash equilibrium", " topology control"], "paper_abstract": "We study topology control problems in ad hoc networks where network nodes get to choose their power levels in order to ensure desired connectivity properties. Unlike most other work on this topic, we assume that the network nodes are owned by different entities, whose only goal is to maximize their own utility that they get out of the network without considering the overall performance of the network. Game theory is the appropriate tool to study such selfish nodes: we define several topology control games in which the nodes need to choose power levels in order to connect to other nodes in the network to reach their communication partners while at the same time minimizing their costs. We study Nash equilibria and show that-among the games we define-these can only be guaranteed to exist if each network node is required to be connected to all other nodes (we call this the STRONG CONNECTIVITY GAME). For a variation called CONNECTIVITY GAME, where each node is only required to be connected (possibly via intermediate nodes) to a given set of nodes, we show that Nash equilibria do not necessarily exist. We further study how to find Nash equilibria with incentive-compatible algorithms and compare the cost of Nash equilibria to the cost of a social optimum, which is a radius assignment that minimizes the total cost in a network where nodes cooperate. We also study variations of the games; one where nodes not only have to be connected, but k-connected, and one that we call the REACHABILITY GAME, where nodes have to reach as many other nodes as possible, while keeping costs low. We extend our study of the STRONG CONNECTIVITY GAME and the CONNECTIVITY GAME to wireless networks with directional antennas and wireline networks, where nodes need to choose neighbors to which they will pay a link. Our work is a first step towards game-theoretic analyses of topology control in wireless and wireline networks.", "paper_title": "Equilibria in topology control games for ad hoc networks", "paper_id": "WOS:000237835400004"}