{"auto_keywords": [{"score": 0.028187902610404502, "phrase": "group_members'_rationale_awareness"}, {"score": 0.00481495049065317, "phrase": "shared_free_form_rationale_space"}, {"score": 0.004449452743965974, "phrase": "reflective_thinking"}, {"score": 0.004402854153653114, "phrase": "group_learning_activities"}, {"score": 0.004155113657645735, "phrase": "collaborative_tool"}, {"score": 0.004068510313497539, "phrase": "dedicated_virtual_group_space"}, {"score": 0.0033480035183418642, "phrase": "one's_decisions"}, {"score": 0.0030935140058168885, "phrase": "shared_rationale_space"}, {"score": 0.0030449789178940787, "phrase": "virtual_group"}, {"score": 0.0029501745152877706, "phrase": "one's_rationale_awareness"}, {"score": 0.0028734230458881903, "phrase": "rationale_awareness"}, {"score": 0.0028432828877281388, "phrase": "one's_awareness"}, {"score": 0.002440071551819324, "phrase": "dedicated_rationale_space"}, {"score": 0.0023516185395256505, "phrase": "group_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rationale awareness", " Collaborative learning", " Activity awareness"], "paper_abstract": "We report the exploration of a technique for promoting reflective thinking in group learning activities in two field studies. In each study, we developed a collaborative tool that provided a dedicated virtual group space with no pre-structure. The students were required to articulate and share their rationales using the space, namely, the rationale space. The rationales in this program are defined as explanations of the reasons underlying one's decisions, conclusions, and interpretations. We discuss our findings on the design of the shared rationale space in a virtual group workspace and the effects of one's rationale awareness in the activities. Rationale awareness is one's awareness of the other group members' decision-making rationale of the shared tasks. Our study suggests that group members' rationale awareness facilitates the. group's common ground. In addition, the use of a dedicated rationale space has the potential of benefiting the group process through supporting group members' rationale awareness and encouraging group members to develop practices around sharing thoughts and perspectives. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "The effects of a shared free form rationale space in collaborative learning activities", "paper_id": "WOS:000319847600002"}