{"auto_keywords": [{"score": 0.04964156968469261, "phrase": "information_use"}, {"score": 0.008713768692145006, "phrase": "diverse_approaches"}, {"score": 0.004352411290383643, "phrase": "human_information_behaviors"}, {"score": 0.004138010495069077, "phrase": "current_focus"}, {"score": 0.004044064541716598, "phrase": "\"information_age"}, {"score": 0.0039341294012600085, "phrase": "limited_evolutionary_understanding"}, {"score": 0.0038981499110532307, "phrase": "human_information_behavior"}, {"score": 0.0037402558657576124, "phrase": "current_three_interdisciplinary_approaches"}, {"score": 0.0035233696341819437, "phrase": "everyday_life_information"}, {"score": 0.002878140062594849, "phrase": "information_behavior"}, {"score": 0.00283870598459543, "phrase": "fourth_information_approach"}, {"score": 0.0026986685585382347, "phrase": "use_theory"}, {"score": 0.0026373136897864763, "phrase": "evolutionary_psychology_notion"}, {"score": 0.0022041312401435346, "phrase": "integrated_model"}, {"score": 0.0021342613107011624, "phrase": "initial_integrated_model"}, {"score": 0.0021049977753042253, "phrase": "different_approaches"}], "paper_keywords": [""], "paper_abstract": "For millennia humans have sought, organized, and used information as they learned and evolved patterns of human information behaviors to resolve their human problems and survive. However, despite the current focus on living in an \"information age,\" we have a limited evolutionary understanding of human information behavior. In this article the authors examine the current three interdisciplinary approaches to conceptualizing how humans have sought information including (a) the everyday life information seeking-sense-making approach, (b) the information foraging approach, and (c) the problem-solution perspective on information seeking approach. In addition, due to the lack of clarity regarding the role of information use in information behavior, a fourth information approach is provided based on a theory of information use. The use theory proposed starts from an evolutionary psychology notion that humans are able to adapt to their environment and survive because of our modular cognitive architecture. Finally, the authors begin the process of conceptualizing these diverse approaches, and the various aspects or elements of these approaches, within an integrated model with consideration of information use. An initial integrated model of these different approaches with information use is proposed.", "paper_title": "Human information behavior: Integrating diverse approaches and information use", "paper_id": "WOS:000234324300003"}