{"auto_keywords": [{"score": 0.03056617908820521, "phrase": "different_schemas"}, {"score": 0.028780447258985667, "phrase": "interschema_knowledge"}, {"score": 0.00481495049065317, "phrase": "cooperative_owl-based_multi-information_server_grid_environment"}, {"score": 0.004661715471100588, "phrase": "cooperating_owl-based_multi-information_server_grid_environment"}, {"score": 0.004369656712097927, "phrase": "commonly_occurring_differences"}, {"score": 0.004331268265601626, "phrase": "intended_semantics"}, {"score": 0.003977065469905712, "phrase": "grid_environment"}, {"score": 0.003953729274556226, "phrase": "semantic_knowledge"}, {"score": 0.0038053333794618002, "phrase": "cooperating_servers"}, {"score": 0.0036732826889280487, "phrase": "computer_system"}, {"score": 0.0035146218353274672, "phrase": "underlying_grid_information_servers"}, {"score": 0.0033727064185569396, "phrase": "limited_expressiveness"}, {"score": 0.0033529044784726477, "phrase": "traditional_data_models"}, {"score": 0.0031425844781944896, "phrase": "semantic_level"}, {"score": 0.003087542744753579, "phrase": "semantic_enrichment_process"}, {"score": 0.003051383242082061, "phrase": "local_schemas"}, {"score": 0.0030334621225621525, "phrase": "grid_iss"}, {"score": 0.0027850945455980434, "phrase": "owl-based_domain_ontologies"}, {"score": 0.0027524673604095787, "phrase": "semantically_rich_schema_models"}, {"score": 0.002512198778854243, "phrase": "semantic_approach"}, {"score": 0.0024974364179629507, "phrase": "interschema_knowledge_specification"}, {"score": 0.0024536665097561073, "phrase": "conceptual_and_semantic_correspondences"}, {"score": 0.0022928555178098947, "phrase": "exactly_this_semantic_nature"}, {"score": 0.0022328311088272877, "phrase": "reasoning_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["semantic interoperability", " mediators", " domain ontologies", " schema enrichment", " compositional modelling"], "paper_abstract": "Establishing interschema semantic knowledge between corresponding elements in a cooperating OWL-based multi-information server grid environment requires deep knowledge, not only about the structure of the data represented in each server, but also about the commonly occurring differences in the intended semantics of this data. The same information could be represented in various incompatible structures, and more importantly the same structure could be used to represent data with many diverse and incompatible semantics. In a grid environment interschema semantic knowledge can only be detected if both the structural and semantic properties of the schemas of the cooperating servers are made explicit and formally represented in a way that a computer system can process. Unfortunately, very often there is lack of such knowledge and the underlying grid information servers (ISs) schemas, being semantically weak as a consequence of the limited expressiveness of traditional data models, do not help the acquisition of this knowledge. The solution to overcome this limitation is primarily to upgrade the semantic level of the IS local schemas through a semantic enrichment process by augmenting the local schemas of grid ISs to semantically enriched schema models, then to use these models in detecting and representing correspondences between classes belonging to different schemas. In this paper, we investigate the possibility of using OWL-based domain ontologies both for building semantically rich schema models, and for expressing interschema knowledge and reasoning about it. We believe that the use of OWL/RDF in this setting has two important advantages. On the one hand, it enables a semantic approach for interschema knowledge specification, by concentrating on expressing conceptual and semantic correspondences between both the conceptual (intensional) definition and the set of instances (extension) of classes represented in different schemas. On the other hand, it is exactly this semantic nature of our approach that allows us to devise reasoning mechanisms for discovering and reusing interschema knowledge when the need arises to compare and combine it. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Interschema correspondence establishment in a cooperative OWL-based multi-information server grid environment", "paper_id": "WOS:000253184800005"}