{"auto_keywords": [{"score": 0.04421783019302807, "phrase": "constituent_models"}, {"score": 0.033923184999155365, "phrase": "coupled_model_predictions"}, {"score": 0.00481495049065317, "phrase": "code_development"}, {"score": 0.0047872135686404275, "phrase": "partitioned_models"}, {"score": 0.004759635663291431, "phrase": "purpose_-_physical_phenomena"}, {"score": 0.0044536312768349, "phrase": "multiple_phenomena"}, {"score": 0.004377077848734575, "phrase": "widely_implemented_computational_approach"}, {"score": 0.004167218012926657, "phrase": "iterative_coupling_operations"}, {"score": 0.0041074234667687875, "phrase": "individually_developed_constituent_models"}, {"score": 0.004036796871316647, "phrase": "other's_inputs"}, {"score": 0.0038654774211631564, "phrase": "powerful_technique"}, {"score": 0.0038210283935447473, "phrase": "coupled_models"}, {"score": 0.003680055701720573, "phrase": "individual_constituents"}, {"score": 0.0035340293330075453, "phrase": "partitioned_analysis"}, {"score": 0.0034933782525914682, "phrase": "key_mechanism"}, {"score": 0.0030936850548131923, "phrase": "individual_constituent_models"}, {"score": 0.0030404363386284756, "phrase": "finite_resources"}, {"score": 0.0030141556259370675, "phrase": "code_development_efforts"}, {"score": 0.0029794666460666646, "phrase": "possible_constituents"}, {"score": 0.0029197159945990015, "phrase": "constituent_model_development"}, {"score": 0.0029028648824177715, "phrase": "efficient_use"}, {"score": 0.00265373679629359, "phrase": "constituent_model_predictions"}, {"score": 0.0026156018381676407, "phrase": "proposed_approach"}, {"score": 0.0024400265512135397, "phrase": "constituent_model"}, {"score": 0.0023841543436866875, "phrase": "quantitative_prioritization_metric"}, {"score": 0.0023430894142828155, "phrase": "proposed_metric"}, {"score": 0.002309408211203032, "phrase": "structural_portal_frame"}, {"score": 0.002289431798120276, "phrase": "optimization-based_uncertainty_inference"}, {"score": 0.0021172271087293217, "phrase": "bias_contributions"}, {"score": 0.0021049977753042253, "phrase": "sensitivity_analysis"}], "paper_keywords": ["Resource allocation", " Uncertainty propagation", " Code development", " Coupled simulations", " Model calibration", " Model validation"], "paper_abstract": "Purpose - Physical phenomena interact with each other in ways that one cannot be analyzed without considering the other. To account for such interactions between multiple phenomena, partitioning has become a widely implemented computational approach. Partitioned analysis involves the exchange of inputs and outputs from constituent models (partitions) via iterative coupling operations, through which the individually developed constituent models are allowed to affect each other's inputs and outputs. Partitioning, whether multi-scale or multi-physics in nature, is a powerful technique that can yield coupled models that can predict the behavior of a system more complex than the individual constituents themselves. The paper aims to discuss these issues. Design/methodology/approach - Although partitioned analysis has been a key mechanism in developing more realistic predictive models over the last decade, its iterative coupling operations may lead to the propagation and accumulation of uncertainties and errors that, if unaccounted for, can severely degrade the coupled model predictions. This problem can be alleviated by reducing uncertainties and errors in individual constituent models through further code development. However, finite resources may limit code development efforts to just a portion of possible constituents, making it necessary to prioritize constituent model development for efficient use of resources. Thus, the authors propose here an approach along with its associated metric to rank constituents by tracing uncertainties and errors in coupled model predictions back to uncertainties and errors in constituent model predictions. Findings - The proposed approach evaluates the deficiency (relative degree of imprecision and inaccuracy), importance (relative sensitivity) and cost of further code development for each constituent model, and combines these three factors in a quantitative prioritization metric. The benefits of the proposed metric are demonstrated on a structural portal frame using an optimization-based uncertainty inference and coupling approach. Originality/value - This study proposes an approach and its corresponding metric to prioritize the improvement of constituents by quantifying the uncertainties, bias contributions, sensitivity analysis, and cost of the constituent models.", "paper_title": "Resource allocation for code development in partitioned models", "paper_id": "WOS:000368249300006"}