{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "older_adults"}, {"score": 0.049613254104042076, "phrase": "social_media"}, {"score": 0.004562847483469705, "phrase": "information_sharing"}, {"score": 0.004057495982111461, "phrase": "risky_issues"}, {"score": 0.004017989546119125, "phrase": "privacy_leakages"}, {"score": 0.003978866233891427, "phrase": "information_sharing_hazards"}, {"score": 0.003661275004971829, "phrase": "private_information"}, {"score": 0.0034187896011435245, "phrase": "privacy-preserving_actions"}, {"score": 0.003255587294203565, "phrase": "facebook"}, {"score": 0.0032079813320482304, "phrase": "largest_social_networking_platform"}, {"score": 0.0029229677574293725, "phrase": "information_sharing_behavior"}, {"score": 0.002498873893632726, "phrase": "older_facebook_users"}, {"score": 0.0023104373174118458, "phrase": "comparative_purposes"}, {"score": 0.0022107428653358715, "phrase": "younger_facebook_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Older adults", " Social media", " Facebook", " Privacy-preserving", " Peer influence", " Information sharing", " Similarity index"], "paper_abstract": "Social media are being fast adopted by older adults for extending their social relationships. However along with the adoption, there have been concerns about risky issues regarding privacy leakages and information sharing hazards. Such risks are partially due to the fact that seniors (knowingly or unknowingly) share private information that may be misused by others. In this paper we explore the privacy-preserving actions regarding information sharing for this demography on one social media platform - Facebook. Facebook is the largest social networking platform today and many of its privacy related practices have been in the news recently. More specifically, we study the information sharing behavior of the elderly by observing the extent to which they opt out of sharing information publicly about themselves on their profile pages. In addition, we also observe how much overlap exists between these older Facebook users and their respective friends in terms of their public information sharing habits and explore the differences across gender. Finally for comparative purposes we also collect data on a sample of younger Facebook users and conduct an analysis. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Privacy preserving actions of older adults on social media: Exploring the behavior of opting out of information sharing", "paper_id": "WOS:000325041500012"}