{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "static_analysis"}, {"score": 0.01397801103286829, "phrase": "kernel-level_rootkits"}, {"score": 0.004774324145784758, "phrase": "kernel-level_rootkit_detection"}, {"score": 0.004734038956773703, "phrase": "rootkit's_main_goal"}, {"score": 0.0031912706211861324, "phrase": "legitimate_kernel-level_code"}, {"score": 0.0031110402375026016, "phrase": "malicious_kernel-level_code"}, {"score": 0.0030199761431186434, "phrase": "main_approaches"}, {"score": 0.0029691377785333872, "phrase": "windows_operating_system"}, {"score": 0.002931569771634119, "phrase": "kernel-level_drivers"}, {"score": 0.002833689453299307, "phrase": "malicious_kernel_drivers"}, {"score": 0.0026475981474045414, "phrase": "current_detection_technique"}, {"score": 0.002548331088496964, "phrase": "simple_static_analysis_technique"}, {"score": 0.0024842242921857705, "phrase": "malicious_driver"}, {"score": 0.002421726275597666, "phrase": "current_trends"}, {"score": 0.0023708445073819277, "phrase": "kernel-level_rookits"}, {"score": 0.0022434880661725493, "phrase": "malicious_behavior"}, {"score": 0.002224510044064184, "phrase": "kernel_drivers"}], "paper_keywords": ["Malware", " rootkit", " static analysis", " kernel driver"], "paper_abstract": "Rootkit's main goal is to hide itself and other modules present in the malware. Their stealthy nature has made their detection further difficult, especially in the case of kernel-level rootkits. There have been many dynamic analysis techniques proposed for detecting kernel-level rootkits, while on the other hand, static analysis has not been popular. This is perhaps due to its poor performance in detecting malware in general, which could be attributed to the level of obfuscation employed in binaries which make static analysis difficult if not impossible. In this paper, we make two important observations, first there is usually little obfuscation used in legitimate kernel-level code, as opposed to the malicious kernel-level code. Second, one of the main approaches to penetrate the Windows operating system is through kernel-level drivers. Therefore, by focusing on detecting malicious kernel drivers employed by the rootkit, one could detect the rootkit while avoiding the issues with current detection technique. Given these two observation, we propose a simple static analysis technique with the aim of detecting malicious driver. We first study the current trends in the implementation of kernel-level rookits. Afterward, we proposed a set of features to quantify the malicious behavior in kernel drivers. These features are then evaluated through a set of experiments on 4420 malicious and legitimate drivers, obtaining an accuracy of 98.15% in distinguishing between these drivers.", "paper_title": "Back to Static Analysis for Kernel-Level Rootkit Detection", "paper_id": "WOS:000341522800001"}