{"auto_keywords": [{"score": 0.03695046415669007, "phrase": "peer_assessors"}, {"score": 0.008713768692145006, "phrase": "expert_feedback"}, {"score": 0.008518169956427374, "phrase": "peer_feedback"}, {"score": 0.0046797114400479135, "phrase": "secondary_school_students"}, {"score": 0.004600389726895716, "phrase": "peer_assessment"}, {"score": 0.004561232179195321, "phrase": "secondary_school_level"}, {"score": 0.0043953478557600565, "phrase": "feedback_secondary_school_students"}, {"score": 0.004199406257273994, "phrase": "reciprocal_online_peer_assessment"}, {"score": 0.004139976980458675, "phrase": "secondary_school_science_course"}, {"score": 0.003966667994579941, "phrase": "student_science_web-portfolios"}, {"score": 0.003569451476205552, "phrase": "other's_web-portfolios"}, {"score": 0.0034789831290103967, "phrase": "expert_assessor"}, {"score": 0.0032954289787083713, "phrase": "data_sources"}, {"score": 0.0031483659534456802, "phrase": "quantitative_feedback"}, {"score": 0.002965229277927781, "phrase": "low_validity"}, {"score": 0.002931569771634119, "phrase": "qualitative_written_feedback"}, {"score": 0.0029148831519944358, "phrase": "student_and_expert_assessors"}, {"score": 0.0028006988338192375, "phrase": "peer_assessees'_skills"}, {"score": 0.002505595895866397, "phrase": "decision-making_strategies"}, {"score": 0.0023530305476484807, "phrase": "mere_explanation"}, {"score": 0.0023329572140896237, "phrase": "assessment_criteria"}, {"score": 0.0023196699954340437, "phrase": "prior_experience"}, {"score": 0.0023064582783867645, "phrase": "peer_assessment_procedures"}, {"score": 0.0022479284902217006, "phrase": "policy_makers"}, {"score": 0.0021413855297794946, "phrase": "high_quality_feedback"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reciprocal peer assessment", " Peer feedback", " Expert feedback", " Web-portfolios", " Secondary school science"], "paper_abstract": "Few studies have focused on peer assessment at the secondary school level. Consequently, we know very little about the quality of the feedback secondary school students can produce and its potential usefulness. This study was implemented in the context of reciprocal online peer assessment of web-portfolios in a secondary school science course. We evaluated both quantitative (grades) and qualitative (written comments) feedback on student science web-portfolios to assess the quality of peer feedback. We further investigated whether either peer or expert feedback led peer assesses to revise their work in any way. Participants (28 seventh-graders) anonymously assessed each other's web-portfolios on designing a CO2-friendly house. Peer assessors and an expert assessor used the same pre-specified assessment criteria. Peer assessees made revisions as they saw fit after reviewing the feedback. The data sources were: the feedback produced, screen capture and video data and questionnaires. The quantitative feedback was found to differ between peer assessors and the expert and also between peer assessors assessing the same web-portfolio, which resulted in low validity and reliability. Qualitative written feedback from student and expert assessors appeared similar in its structural components. It differed in that students placed less emphasis on peer assessees' skills, provided fewer suggestions for changes, provided more positive judgments, and provided more negative/critical judgments that were not accompanied by evidence. Finally, we found that the majority of changes proposed by peer assessors were scientifically accurate and assessee groups employed decision-making strategies to screen and process peer and expert feedback. These findings yield a number of implications for practice and policy. The mere explanation of the assessment criteria or prior experience with peer assessment procedures is not enough; teachers, researchers and policy makers should focus on the type of training and scaffolding that peer assessors need in order to produce high quality feedback. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Peer versus expert feedback: An investigation of the quality of peer feedback among secondary school students", "paper_id": "WOS:000328801300012"}