{"auto_keywords": [{"score": 0.049203403415225264, "phrase": "clinical_guidelines"}, {"score": 0.00481495049065317, "phrase": "automated_generation"}, {"score": 0.0046834372388970405, "phrase": "engine_design"}, {"score": 0.0045765783794477505, "phrase": "icu_modified_schofield_use_case"}, {"score": 0.004410629943506433, "phrase": "medical_information"}, {"score": 0.004002972723329302, "phrase": "best_practices"}, {"score": 0.0037696519417841287, "phrase": "diagnostic_and_treatment_process"}, {"score": 0.003683565150278339, "phrase": "standardized_format"}, {"score": 0.0035010071030752883, "phrase": "computer_interpretable_format"}, {"score": 0.0034052594710793664, "phrase": "physicians'_workflow"}, {"score": 0.003358368814209542, "phrase": "clinician's_uptake"}, {"score": 0.002896535621940078, "phrase": "detailed_overview"}, {"score": 0.0024636239664210433, "phrase": "calorie_need"}, {"score": 0.0024409345168575833, "phrase": "burn_patients"}, {"score": 0.0022149235007885826, "phrase": "optimization_algorithms"}, {"score": 0.0021945194903838132, "phrase": "execution_times"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision support", " Guidelines", " Automated generation", " Automated execution", " Optimization algorithms"], "paper_abstract": "As the complexity and amount of medical information keeps increasing, it is difficult to maintain the same quality of care. Therefore, clinical guidelines are used to structure best practices and care, but they also support physicians and nurses in the diagnostic and treatment process. Currently, no standardized format exists to represent these guidelines. Translating guidelines into a computer interpretable format can overcome problems in the physicians' workflow and improve clinician's uptake. An engine is proposed to automatically translate and execute clinical guidelines. These guidelines are represented as flowcharts, expressed in either (i) a computer interpretable guideline format or (ii) a UML diagram. A detailed overview of the architecture is presented and algorithms, aiming at grouping several components and distributing the guidelines, are proposed to optimize the execution of the guidelines. The Modified Schofield guideline for the calculation of the calorie need for burn patients was used for evaluation. Results show that the execution of guidelines using the engine is very efficient. Using optimization algorithms the execution times can be lowered. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Towards automated generation and execution of clinical guidelines: Engine design and implementation through the ICU Modified Schofield use case", "paper_id": "WOS:000307428100002"}