{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unintended_consequences"}, {"score": 0.004773476989344654, "phrase": "health_it"}, {"score": 0.00415625929636759, "phrase": "unprecedented_increase"}, {"score": 0.004120435930514554, "phrase": "health_information_technology"}, {"score": 0.00403221710768334, "phrase": "healthcare_provider_organizations"}, {"score": 0.003945918284047249, "phrase": "u.s."}, {"score": 0.0037786899855446, "phrase": "meaningful_use"}, {"score": 0.0034204548167213545, "phrase": "unanticipated_consequences"}, {"score": 0.003332704619499476, "phrase": "increased_implementation"}, {"score": 0.0033039560332995136, "phrase": "hit._conference_participants"}, {"score": 0.0027781870000242004, "phrase": "conference's_recommendations"}, {"score": 0.0025036862991477437, "phrase": "hit_implementations"}, {"score": 0.0023664730217196252, "phrase": "hit_implementation_experiences"}, {"score": 0.002315719347244451, "phrase": "best_practices"}, {"score": 0.002227083991228041, "phrase": "key_role"}, {"score": 0.0021049977753042253, "phrase": "hit-related_implementations"}], "paper_keywords": [""], "paper_abstract": "Federal legislation (Health Information Technology for Economic and Clinical Health (HITECH) Act) has provided funds to support an unprecedented increase in health information technology (HIT) adoption for healthcare provider organizations and professionals throughout the U.S. While recognizing the promise that widespread HIT adoption and meaningful use can bring to efforts to improve the quality, safety, and efficiency of healthcare, the American Medical Informatics Association devoted its 2009 Annual Health Policy Meeting to consideration of unanticipated consequences that could result with the increased implementation of HIT. Conference participants focused on possible unintended and unanticipated, as well as undesirable, consequences of HIT implementation. They employed an input output model to guide discussion on occurrence of these consequences in four domains: technical, human/cognitive, organizational, and fiscal/policy and regulation. The authors outline the conference's recommendations: (1) an enhanced research agenda to guide study into the causes, manifestations, and mitigation of unintended consequences resulting from HIT implementations; (2) creation of a framework to promote sharing of HIT implementation experiences and the development of best practices that minimize unintended consequences; and (3) recognition of the key role of the Federal Government in providing leadership and oversight in analyzing the effects of HIT-related implementations and policies.", "paper_title": "Anticipating and addressing the unintended consequences of health IT and policy: a report from the AMIA 2009 Health Policy Meeting", "paper_id": "WOS:000289218000015"}