{"auto_keywords": [{"score": 0.04941714403605284, "phrase": "unreliable_flow_network"}, {"score": 0.013821973224476583, "phrase": "flow_network_changes"}, {"score": 0.013200477971152197, "phrase": "source_nodes"}, {"score": 0.01108042710953359, "phrase": "network_reliability"}, {"score": 0.00481495049065317, "phrase": "multi-resource_allocations"}, {"score": 0.004491093879657087, "phrase": "reliability-maximizing_resource_allocation"}, {"score": 0.0034303736977646135, "phrase": "multiple_operational_states"}, {"score": 0.003096905353118796, "phrase": "earlier_developments"}, {"score": 0.0030117065110966414, "phrase": "reliability-maximizing_resource_allocation_problems"}, {"score": 0.0028615323526689582, "phrase": "new_resource_allocation_strategy"}, {"score": 0.0025592969422491476, "phrase": "existing_resource_allocation"}, {"score": 0.002331909406363425, "phrase": "existing_minimal_path_vectors"}, {"score": 0.0023103100997344072, "phrase": "corresponding_flow_patterns"}, {"score": 0.0022889103976458437, "phrase": "procedural_comparisons"}, {"score": 0.002267708463966758, "phrase": "numerical_examples"}, {"score": 0.0022258906408344973, "phrase": "updating_schemes"}, {"score": 0.0021646022201798247, "phrase": "recomputing_scheme"}, {"score": 0.002134592410214824, "phrase": "large_sized_flow_network"}], "paper_keywords": ["flow network", " minimal path vector", " network reliability", " resource allocation"], "paper_abstract": "In this paper, algorithms are developed to update the reliability-maximizing resource allocation in an unreliable flow network when either resource demand or the characteristic of the flow network changes. An unreliable flow network consists of nodes, characterized as source nodes, which supply resources of various types, sink nodes, at which resource demand takes place, and intermediate nodes, as well as unreliable directed arcs, which join pairs of nodes and whose capacities have multiple operational states. The network reliability of such an unreliable flow network is the probability that resources can be transmitted successfully from source nodes to sink nodes. With earlier developments on evaluating network reliability and resolving reliability-maximizing resource allocation problems in an unreliable flow network, one may recompute a new resource allocation strategy, when either resource demand or the characteristic of the flow network changes, without incorporating the efforts that have been made in obtaining the existing resource allocation. This study, in contrast, proposes updating, rather than recomputing, alternatives that take advantage of existing minimal path vectors and corresponding flow patterns. Procedural comparisons and numerical examples indicate that the updating schemes would perform better than the recomputing scheme in a large sized flow network that transmits various resource types. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Simple algorithms for updating multi-resource allocations in an unreliable flow network", "paper_id": "WOS:000238928500009"}