{"auto_keywords": [{"score": 0.05007831663443002, "phrase": "degree_centrality"}, {"score": 0.04911456302649167, "phrase": "time-variant_approach"}, {"score": 0.03676159621003009, "phrase": "traditional_degree_centrality_approach"}, {"score": 0.029930446109821457, "phrase": "patient-physician_network"}, {"score": 0.02573375668569452, "phrase": "los."}, {"score": 0.004493045859210086, "phrase": "social_network_analysis"}, {"score": 0.00434906528856802, "phrase": "diverse_research_domains"}, {"score": 0.004296264970612285, "phrase": "network_positions"}, {"score": 0.004091370602573054, "phrase": "network_analysis"}, {"score": 0.0032700071110068323, "phrase": "degree_centrality_measure_-_time_scale_degree_centrality"}, {"score": 0.0029773436815290215, "phrase": "traditional_and_tsdc_measure"}, {"score": 0.0028583875909257766, "phrase": "degree_attributes"}, {"score": 0.00278930116312699, "phrase": "patient_hospitalization_periods"}, {"score": 0.002755384932325921, "phrase": "hospital_length"}, {"score": 0.0026560841114619147, "phrase": "macro-and_a_micro-level"}, {"score": 0.0024680632991561074, "phrase": "degree_attribute"}, {"score": 0.0023694065215394593, "phrase": "micro-level_or_small_cluster_level"}, {"score": 0.0023501538131333643, "phrase": "tsdc"}, {"score": 0.0021659920594094407, "phrase": "time-variant_relations"}], "paper_keywords": ["Centrality", " degree centrality", " time scale degree centrality"], "paper_abstract": "Degree centrality is considered to be one of the most basic measures of social network analysis, which has been used extensively in diverse research domains for measuring network positions of actors in respect of the connections with their immediate neighbors. In network analysis, it emphasizes the number of connections that an actor has with others. However, it does not accommodate the value of the duration of relations with other actors in a network; and, therefore, this traditional degree centrality approach regards only the presence or absence of links. Here, we introduce a time-variant approach to the degree centrality measure - time scale degree centrality (TSDC), which considers both presence and duration of links among actors within a network. We illustrate the difference between traditional and TSDC measure by applying these two approaches to explore the impact of degree attributes of a patient-physician network evolving during patient hospitalization periods on the hospital length of stay (LOS) both at a macro-and a micro-level. At a macro-level, both the traditional and time-scale approaches to degree centrality can explain the relationship between the degree attribute of the patient-physician network and LOS. However, at a micro-level or small cluster level, TSDC provides better explanation while the traditional degree centrality approach is found to be inadequate in explaining its relationship with LOS. Our proposed TSDC measure can explore time-variant relations that evolve among actors in a given social network.", "paper_title": "New Direction in Degree Centrality Measure: Towards a Time-Variant Approach", "paper_id": "WOS:000340430200010"}