{"auto_keywords": [{"score": 0.04967913398382335, "phrase": "parallel_coordinates"}, {"score": 0.015719716506582538, "phrase": "visual_uncertainty"}, {"score": 0.01508085401026167, "phrase": "visual_representation"}, {"score": 0.004675652357253327, "phrase": "intrinsic_part"}, {"score": 0.004390517953424082, "phrase": "existing_research"}, {"score": 0.00422781730455246, "phrase": "data-space_uncertainty"}, {"score": 0.004174929128880472, "phrase": "visual_form"}, {"score": 0.0031117775337824853, "phrase": "different_sources"}, {"score": 0.0030470980812086247, "phrase": "screen_space"}, {"score": 0.0029837589912490026, "phrase": "different_effects"}, {"score": 0.0026193328696791306, "phrase": "different_perspective"}, {"score": 0.0024081387633065206, "phrase": "analysis_scenario"}, {"score": 0.002149722786728988, "phrase": "information_visualization_pipeline"}, {"score": 0.0021049977753042253, "phrase": "visual_uncertainty_analysis"}], "paper_keywords": [""], "paper_abstract": "Uncertainty is an intrinsic part of any visual representation in visualization, no matter how precise the input data. Existing research on uncertainty in visualization mainly focuses on depicting data-space uncertainty in a visual form. Uncertainty is thus often seen as a problem to deal with, in the data, and something to be avoided if possible. In this paper, we highlight the need for analyzing visual uncertainty in order to design more effective visual representations. We study various forms of uncertainty in the visual representation of parallel coordinates and propose a taxonomy for categorizing them. By building a taxonomy, we aim to identify different sources of uncertainty in the screen space and relate them to different effects of uncertainty upon the user. We examine the literature on parallel coordinates and apply our taxonomy to categorize various techniques for reducing uncertainty. In addition, we consider uncertainty from a different perspective by identifying cases where increasing certain forms of uncertainty may even be useful, with respect to task, data type and analysis scenario. This work suggests that uncertainty is a feature that can be both useful and problematic in visualization, and it is beneficial to augment an information visualization pipeline with a facility for visual uncertainty analysis.", "paper_title": "Conceptualizing Visual Uncertainty in Parallel Coordinates", "paper_id": "WOS:000305603500004"}