{"auto_keywords": [{"score": 0.035581377548100195, "phrase": "kcps_method"}, {"score": 0.010089214957117504, "phrase": "human_users"}, {"score": 0.008644760447045789, "phrase": "creative_problem-solving_methodology"}, {"score": 0.008274788692297334, "phrase": "kcps"}, {"score": 0.006808598308154368, "phrase": "human_creativity"}, {"score": 0.006312238294275175, "phrase": "knowledge_provision"}, {"score": 0.005851850683117521, "phrase": "information_processing"}, {"score": 0.004608121749000898, "phrase": "knowledgeable_creative_problem-solving_methodology"}, {"score": 0.004373190413519918, "phrase": "case_study"}, {"score": 0.003991110291836103, "phrase": "creative_solutions"}, {"score": 0.0038348235692738783, "phrase": "research_achievement"}, {"score": 0.003640730820018083, "phrase": "crucial_role"}, {"score": 0.0035403060198952244, "phrase": "human_mind"}, {"score": 0.0034152340901585374, "phrase": "key_components"}, {"score": 0.0031028232755683674, "phrase": "kcps._information_processing"}, {"score": 0.002841545331522694, "phrase": "mental_activities"}, {"score": 0.0027192536281209463, "phrase": "appropriate_techniques"}, {"score": 0.0025202582748972122, "phrase": "kcps."}, {"score": 0.002373472641477602, "phrase": "twelve_new_design_concepts"}, {"score": 0.0023357913211723884, "phrase": "balancing_equipment"}, {"score": 0.0021049977753042253, "phrase": "innovative_concepts"}], "paper_keywords": [""], "paper_abstract": "In this article, a knowledgeable creative problem-solving methodology (KCPS) is proposed. In addition to being applied as a creative problem-solving methodology, this KCPS method also aims to provide human users the knowledge that is important and necessary for the generation of creative solutions. The development of KCPS is based on the research achievement in the area of human creativity, which suggests that knowledge plays a crucial role in the evolvement of creativity in human mind. Consequently, knowledge provision is one of the key components of the KCPS method. Additionally, according to the models of human creativity, information processing and Meta-behaviors are identified as the other two components of the KCPS. Information processing facilitates human users in analyzing, processing information, and obtaining knowledge in order to approach problems creatively. Meta-behaviors indicate the mental activities of human users when they apply the KCPS method. Subsequently, appropriate techniques that can realize the functions of knowledge provision and information processing are selected and integrated for the development of the KCPS. The operation of the KCPS method is then discussed. A case study is illustrated with twelve new design concepts for articles of balancing equipment, which were generated by applying the KCPS method. This case study demonstrates that the KCPS method has the capacity to assist human users for the generation of innovative concepts.", "paper_title": "TOWARD A CREATIVE PROBLEM-SOLVING METHODOLOGY WITH KNOWLEDGE PROVISION", "paper_id": "WOS:000296541800005"}