{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reverse_supply_chains"}, {"score": 0.03235055845396387, "phrase": "used_products"}, {"score": 0.008881512935970465, "phrase": "third_party"}, {"score": 0.004871316596393489, "phrase": "collecting_price"}, {"score": 0.004653766973730142, "phrase": "end_customer's_willingness"}, {"score": 0.004582423717777699, "phrase": "collecting_price_decisions"}, {"score": 0.004462853778559432, "phrase": "optimal_results"}, {"score": 0.0038458526450015976, "phrase": "recycling_channel"}, {"score": 0.003443402656397069, "phrase": "returned_used_product"}, {"score": 0.003391290302481397, "phrase": "collection_function"}, {"score": 0.003314591878914152, "phrase": "increasing_function"}, {"score": 0.003131008124818913, "phrase": "price_decisions"}, {"score": 0.002956272941199248, "phrase": "game_theory"}, {"score": 0.0028783840417661694, "phrase": "pricing_decisions"}, {"score": 0.0028565082986974602, "phrase": "different_cases"}, {"score": 0.0024150528983695446, "phrase": "main_implication"}, {"score": 0.0023784664152543718, "phrase": "reusing_ratio"}, {"score": 0.0023069440108381364, "phrase": "remanufacturing_ratio"}, {"score": 0.0022806798371116698, "phrase": "key_parts"}, {"score": 0.0022375675189464715, "phrase": "optimal_pricing_decisions"}, {"score": 0.002203663884543687, "phrase": "practical_implications"}], "paper_keywords": ["Cybernetics", " Collecting", " Recycling", " Manufacturing industries", " Pricing"], "paper_abstract": "Purpose - The purpose of this paper is to present the collecting price decisions of used products in reverse supply chains based on the following cases: manufacturer for collecting and processing, third party for collecting and manufacturer for processing, retailer for collecting and manufacture for processing, and third party for collecting and processing. Design/methodology/approach - The paper considers a recycling channel whereby a manufacturer collects and processes the used products or delegates collecting (or processing) to the retailer or a third party; characterizes the steps of processing a returned used product; gives a collection function of used products which is an increasing function of the collecting price, since the quantity of returned used products is affected by the end customer's willingness and the end customer's willingness is affected by the collecting price. The optimal results were obtained by game theory. Findings - By investigating the pricing decisions for different cases, the manufacturer prefers to collect the used products rather than delegate to others if manufacturer for processing, and a third party joining the reverse supply chains hopes to collaborate more deeply, not only collecting but also processing the used products. Research limitations/implications - The main implication is that the reusing ratio of the returned used products and the remanufacturing ratio of the key parts have impacts on the optimal pricing decisions of reverse supply chains. Practical implications - The paper describes a very useful method for managers to make collecting price decisions for reverse supply chains. Originality/value - The paper provides the optimal results of collecting price decisions. The paper contributes to the reverse supply chains researches and managers who are responsible for the reverse supply chains.", "paper_title": "Pricing decisions for reverse supply chains", "paper_id": "WOS:000294884200018"}