{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "broadcast_soccer_video"}, {"score": 0.03381933677463954, "phrase": "ball_trajectories"}, {"score": 0.03171525019468471, "phrase": "high_accuracy"}, {"score": 0.00471003041684707, "phrase": "novel_trajectory-based_detection"}, {"score": 0.004424953471635011, "phrase": "ball_detection"}, {"score": 0.004187718090913465, "phrase": "wide_variation"}, {"score": 0.0040366412779632085, "phrase": "direct_detection_algorithms"}, {"score": 0.0037921662574137535, "phrase": "high_speed"}, {"score": 0.003484721713676736, "phrase": "two-phase_trajectory-based_algorithm"}, {"score": 0.002953217535105884, "phrase": "precise_location"}, {"score": 0.0027437235598539904, "phrase": "ball-like_candidates"}, {"score": 0.0026348886455716614, "phrase": "trajectory_information"}, {"score": 0.0025490525773769063, "phrase": "\"most_active\"_object"}, {"score": 0.002521064923851732, "phrase": "bsv."}, {"score": 0.00244792069601419, "phrase": "ball_locations"}, {"score": 0.0022825763382627443, "phrase": "partially_occluded_or_merged_balls"}, {"score": 0.0021049977753042253, "phrase": "ball_location"}], "paper_keywords": ["algorithms", " anti-model", " ball detection and tracking", " sports video", " trajectory-based"], "paper_abstract": "This paper presents a novel trajectory-based detection and tracking algorithm for locating the ball in broadcast soccer video (BSV). The problem of ball detection and tracking in BSV is well known to be very challenging because of the wide variation in the appearance of the ball over frames. Direct detection algorithms do not work well because the image of the ball may be distorted due to the high speed of the ball, occlusion, or merging with other objects in the frame. To overcome these challenges, we propose a two-phase trajectory-based algorithm in which we first generate a set of ball-candidates for each frame, and then use them to compute the set of ball trajectories. Informally, the two key ideas behind our strategy are 1) while it is very challenging to achieve high accuracy in locating the precise location of the ball, it is relatively easy to achieve very high accuracy in locating the ball among a set of ball-like candidates and 2) it is much better to study the trajectory information of the ball since the ball is the \"most active\" object in the BSV. Once the ball trajectories are computed, the ball locations can be reliably recovered from them. One important advantage of our algorithm is that it is able to reliably detect partially occluded or merged balls in the sequence. Two videos from the 2002 FIFA World Cup were used to evaluate our algorithm. It achieves a high accuracy of about 81% for ball location.", "paper_title": "Trajectory-based ball detection and tracking in broadcast soccer video", "paper_id": "WOS:000242311700007"}