{"auto_keywords": [{"score": 0.032847681616438064, "phrase": "rim"}, {"score": 0.015449513841746625, "phrase": "implementation_model"}, {"score": 0.011383428470727163, "phrase": "seven_factors"}, {"score": 0.00481495049065317, "phrase": "ihcs_implementation"}, {"score": 0.004426882270402403, "phrase": "healthcare_organization's_potential"}, {"score": 0.004334832612029898, "phrase": "interactive_health_communication_system"}, {"score": 0.004200319352919505, "phrase": "seven_weighted_factors"}, {"score": 0.004084245825701289, "phrase": "design_two_decision-analytic_approaches"}, {"score": 0.003999292102785413, "phrase": "conjoint_analysis"}, {"score": 0.003754847652236926, "phrase": "rim_model"}, {"score": 0.003651039356522665, "phrase": "prospective_study"}, {"score": 0.0036002125374696237, "phrase": "measurements_orthogonal_main_effects_design"}, {"score": 0.003021334228842501, "phrase": "implementation_outcomes"}, {"score": 0.0027483472371835865, "phrase": "implementation_readiness"}, {"score": 0.00268168157806506, "phrase": "predictive_validity"}, {"score": 0.0025264171945423254, "phrase": "better_predictor"}, {"score": 0.002473786357109046, "phrase": "half-year_outcome"}, {"score": 0.002439308179084911, "phrase": "expert_sample"}, {"score": 0.002388487669097511, "phrase": "survey_tasks"}, {"score": 0.00231423064137482, "phrase": "rim_cut-off_score"}, {"score": 0.002281971169774711, "phrase": "possible_limitations"}, {"score": 0.0021573582896732657, "phrase": "ihcs"}, {"score": 0.0021049977753042253, "phrase": "long_term"}], "paper_keywords": [""], "paper_abstract": "Objective To develop and validate the Readiness for Implementation Model (RIM). This model predicts a healthcare organization's potential for success in implementing an interactive health communication system (IHCS). The model consists of seven weighted factors, with each factor containing five to seven elements. Design Two decision-analytic approaches, self-explicated and conjoint analysis, were used to measure the weights of the RIM with a sample of 410 experts. The RIM model with weights was then validated in a prospective study of 25 IHCS implementation cases. Measurements Orthogonal main effects design was used to develop 700 conjoint-analysis profiles, which varied on seven factors. Each of the 410 experts rated the importance and desirability of the factors and their levels, as well as a set of 10 different profiles. For the prospective 25-case validation, three time-repeated measures of the RIM scores were collected for comparison with the implementation outcomes. Results Two of the seven factors, 'organizational motivation' and 'meeting user needs,' were found to be most important in predicting implementation readiness. No statistically significant difference was found in the predictive validity of the two approaches (self-explicated and conjoint analysis). The RIM was a better predictor for the 1-year implementation outcome than the half-year outcome. Limitations The expert sample, the order of the survey tasks, the additive model, and basing the RIM cut-off score on experience are possible limitations of the study. Conclusion The RIM needs to be empirically evaluated in institutions adopting IHCS and sustaining the system in the long term.", "paper_title": "Developing and validating a model to predict the success of an IHCS implementation: the Readiness for Implementation Model", "paper_id": "WOS:000283899900016"}