{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internal_models"}, {"score": 0.004720419202969916, "phrase": "necessary_strategy"}, {"score": 0.004447766706144458, "phrase": "useful_pieces"}, {"score": 0.004389339243427964, "phrase": "deterministic_previous_knowledge"}, {"score": 0.00400119808662365, "phrase": "industrial_control_systems"}, {"score": 0.003896717568943166, "phrase": "low_level_devices"}, {"score": 0.0035519826240477444, "phrase": "specific_controlled_plants"}, {"score": 0.003413705707789296, "phrase": "general_theoretical_foundations"}, {"score": 0.002671990515821213, "phrase": "intelligent_sensors_field"}, {"score": 0.0026194209399161184, "phrase": "brief_overview"}, {"score": 0.0024192592458651204, "phrase": "particular_architecture"}, {"score": 0.0021049977753042253, "phrase": "railway_cars"}], "paper_keywords": ["Internal model", " sensor fusion", " fuzzy-interpolative system"], "paper_abstract": "A necessary strategy to improve our technologies is to provide them with useful pieces of deterministic previous knowledge about the processes and the equipment. Our attention was previously focused on the industrial control systems, implemented with low level devices (controllers, sensors, actuators), that need knowledge on the specific controlled plants as well as on the general theoretical foundations. This was done on-line with the help of internal models, or off-line with planners whose design is assisted by simulations. This paper is orienting the same effort in the direction of the intelligent sensors field. A brief overview of the relationship between sensors and knowledge is provided. A particular architecture of sensors relying on modeling techniques and some internal model estimators for the velocity and for the weariness of the railway cars are illustrating the role of the models in sensors and estimators.", "paper_title": "World knowledge for sensors and estimators by models and internal models", "paper_id": "WOS:000274861400008"}