{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "research_collaboration"}, {"score": 0.03820939257232881, "phrase": "different_computer_science_subdisciplines"}, {"score": 0.004610809404212932, "phrase": "spanish_computer_science_production"}, {"score": 0.004334036641115555, "phrase": "computer_science_research_activity"}, {"score": 0.003937379670109389, "phrase": "different_circumstances"}, {"score": 0.003817306032290766, "phrase": "different_types"}, {"score": 0.003712362078915926, "phrase": "different_document_types"}, {"score": 0.0034893313013551704, "phrase": "different_impact_factor_quartiles"}, {"score": 0.0032695079595206986, "phrase": "active_spanish_university_professors"}, {"score": 0.003209275810748739, "phrase": "computer_science_field"}, {"score": 0.0031113369425402287, "phrase": "highest_percentage"}, {"score": 0.0030257422786589723, "phrase": "single-authored_documents"}, {"score": 0.0029884576691560642, "phrase": "lowest_percentage"}, {"score": 0.0028972380176088344, "phrase": "positive_association"}, {"score": 0.0028704174214048937, "phrase": "author_cardinality"}, {"score": 0.0028526747080263757, "phrase": "citation_impact"}, {"score": 0.0028350413546400703, "phrase": "statistical_tests"}, {"score": 0.002615460042926181, "phrase": "statistically_significant_differences"}, {"score": 0.0025355968118803956, "phrase": "research_findings"}, {"score": 0.0024734612838382486, "phrase": "higher_citation_rates"}, {"score": 0.002458166199164484, "phrase": "national_and_institutional_collaborations"}, {"score": 0.002405372603197824, "phrase": "citation_rates"}, {"score": 0.002260684786333025, "phrase": "collaborative_level"}, {"score": 0.0021049977753042253, "phrase": "computer_science_literature"}], "paper_keywords": ["Collaboration patterns", " Number of documents", " Number of citations", " Number of authors", " Computer science", " Academic staff", " Spain"], "paper_abstract": "This paper analyzes the relationship among research collaboration, number of documents and number of citations of computer science research activity. It analyzes the number of documents and citations and how they vary by number of authors. They are also analyzed (according to author set cardinality) under different circumstances, that is, when documents are written in different types of collaboration, when documents are published in different document types, when documents are published in different computer science subdisciplines, and, finally, when documents are published by journals with different impact factor quartiles. To investigate the above relationships, this paper analyzes the publications listed in the Web of Science and produced by active Spanish university professors between 2000 and 2009, working in the computer science field. Analyzing all documents, we show that the highest percentage of documents are published by three authors, whereas single-authored documents account for the lowest percentage. By number of citations, there is no positive association between the author cardinality and citation impact. Statistical tests show that documents written by two authors receive more citations per document and year than documents published by more authors. In contrast, results do not show statistically significant differences between documents published by two authors and one author. The research findings suggest that international collaboration results on average in publications with higher citation rates than national and institutional collaborations. We also find differences regarding citation rates between journals and conferences, across different computer science subdisciplines and journal quartiles as expected. Finally, our impression is that the collaborative level (number of authors per document) will increase in the coming years, and documents published by three or four authors will be the trend in computer science literature.", "paper_title": "Relationship among research collaboration, number of documents and number of citations: a case study in Spanish computer science production in 2000-2009", "paper_id": "WOS:000317746900012"}