{"auto_keywords": [{"score": 0.0479081478889254, "phrase": "different_size"}, {"score": 0.0074586875728635225, "phrase": "ebcl"}, {"score": 0.004754447398742591, "phrase": "competitive_learning_clustering"}, {"score": 0.003883194688426525, "phrase": "new_competitive_learning_clustering_method"}, {"score": 0.0038343546245999285, "phrase": "based_competitive_learning"}, {"score": 0.003568932067237836, "phrase": "high_energy"}, {"score": 0.0035091888798162176, "phrase": "core_point_set"}, {"score": 0.003465036432323081, "phrase": "connected_components"}, {"score": 0.003407026489727146, "phrase": "initial_clusters"}, {"score": 0.0031577303835881964, "phrase": "size-sparsity_balance"}, {"score": 0.0030017207229983385, "phrase": "winning_prototype"}, {"score": 0.002735392281320413, "phrase": "samples'_energy"}, {"score": 0.00231987280116332, "phrase": "proposed_method"}, {"score": 0.0022522565004588113, "phrase": "automatic_color_image_segmentation"}, {"score": 0.0021590588269751816, "phrase": "existing_competitive_learning_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Competitive learning", " Auto-initialization", " Size-sparsity", " Outliers", " Learning rate", " Energy"], "paper_abstract": "This paper addresses the three important issues associated with competitive learning clustering, which are auto-initialization, adaptation to clusters of different size and sparsity, and eliminating the disturbance caused by outliers. Although many competitive learning methods have been developed to deal with some of these problems, few of them can solve all the three problems simultaneously. In this paper, we propose a new competitive learning clustering method termed energy based competitive learning (EBCL) to simultaneously tackle these problems. Auto-initialization is achieved by extracting samples of high energy to form a core point set, whereby connected components are obtained as initial clusters. To adapt to clusters of different size and sparsity, a novel competition mechanism, namely, size-sparsity balance of clusters (SSB), is developed to select a winning prototype. For eliminating the disturbance caused by outliers, another new competition mechanism, namely, adaptive learning rate based on samples' energy (ALR), is proposed to update the winner. Data clustering experiments on 2000 simulated datasets comprising clusters of different size and sparsity, as well as with outliers, have been performed to verify the effectiveness of the proposed method. Then we apply EBCL to automatic color image segmentation. Comparison results show that the proposed EBCL outperforms existing competitive learning algorithms. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Energy based competitive learning", "paper_id": "WOS:000291915500023"}