{"auto_keywords": [{"score": 0.04070303364753307, "phrase": "domain_decomposition_method"}, {"score": 0.010612387000973441, "phrase": "parallel_particle-in-cell_beam_dynamics_simulation"}, {"score": 0.00872310612126457, "phrase": "particle-field_decomposition_method"}, {"score": 0.007445596476098666, "phrase": "better_scalability"}, {"score": 0.003245900020944865, "phrase": "particle-field_decomposition"}, {"score": 0.002988101395789399, "phrase": "macroparticle_dominant_applications"}, {"score": 0.002733260122876447, "phrase": "perfect_static_load_balance"}, {"score": 0.0026307897899760383, "phrase": "smaller_ratio"}, {"score": 0.002468450551616404, "phrase": "faster_speed"}, {"score": 0.002391067964886602, "phrase": "particle-field_decomposition_scheme"}, {"score": 0.002360796860462937, "phrase": "high-resolution_macroparticle-dominant_parallel_beam_dynamics_simulation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Parallel particle-in-cell simulation", " Particle-field decomposition", " Domain decomposition"], "paper_abstract": "Particle-in-cell (PIC) simulation is widely used in many branches of physics and engineering. In this paper, we give an analysis of the particle-field decomposition method and the domain decomposition method in parallel particle-in-cell beam dynamics simulation. The parallel performance of the two decomposition methods was studied on the Cray XT4 and the IBM Blue Gene/P Computers. The domain decomposition method shows better scalability but is slower than the particle-field decomposition in most cases (up to a few thousand processors) for macroparticle dominant applications. The particle-field decomposition method also shows less memory usage than the domain decomposition method due to its use of perfect static load balance. For applications with a smaller ratio of macroparticles to grid points, the domain decomposition method exhibits better scalability and faster speed. Application of the particle-field decomposition scheme to high-resolution macroparticle-dominant parallel beam dynamics simulation for a future light source linear accelerator is presented as an example. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Particle-field decomposition and domain decomposition in parallel particle-in-cell beam dynamics simulation", "paper_id": "WOS:000284184800012"}