{"auto_keywords": [{"score": 0.02891157131694613, "phrase": "surface_area"}, {"score": 0.00481495049065317, "phrase": "molecular_shape"}, {"score": 0.004738078275822989, "phrase": "fundamental_factor"}, {"score": 0.004371660146981191, "phrase": "globular_shapes"}, {"score": 0.004233119608341877, "phrase": "protein_sphericity"}, {"score": 0.004121015016128205, "phrase": "molecular_functions"}, {"score": 0.003781772207256374, "phrase": "recently_developed_geometric_constructs"}, {"score": 0.0037213333316218522, "phrase": "beta-complex_and_beta-shape"}, {"score": 0.0035457302646174148, "phrase": "euclidean_proximity"}, {"score": 0.0032016639006812826, "phrase": "corresponding_beta-complex"}, {"score": 0.0025003054002226965, "phrase": "good_measure"}, {"score": 0.0022453451864218477, "phrase": "presented_measure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Protein structure", " Sphericity", " Voronoi diagram", " beta-complex", " beta-shape", " PDB"], "paper_abstract": "Molecular shape is a fundamental factor in determining the function of a molecule. As proteins tend to fold into globular shapes, the shape descriptor for protein sphericity is important in understanding molecular functions. In this paper, a definition of protein sphericity is introduced based on the recently developed geometric constructs of the beta-complex and beta-shape of a protein. The beta-complex represents the Euclidean proximity among all the atoms in a protein, and the beta-shape is the polyhedron contained within the boundary of the corresponding beta-complex. Hence, the beta-shape determines the proximity among the atoms on the boundary of a protein. Given the volume of a beta-shape, the ratio between the surface area of a sphere with this volume and the surface area of the beta-shape itself is a good measure to classify the sphericity of a protein, especially when the radius of a probe is 3.0 angstrom. The presented measure is invariant to translation and rotation. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Sphericity of a protein via the beta-complex", "paper_id": "WOS:000276287200006"}