{"auto_keywords": [{"score": 0.0378414472002853, "phrase": "transformation_functions"}, {"score": 0.01812876786547932, "phrase": "transformation_function"}, {"score": 0.00481495049065317, "phrase": "consistent_operational_transformation_approach"}, {"score": 0.0047515546458205046, "phrase": "operational_transformation"}, {"score": 0.004330450801016359, "phrase": "shared_object"}, {"score": 0.004161553532799662, "phrase": "basic_idea"}, {"score": 0.004070573090297285, "phrase": "received_update_operation"}, {"score": 0.0038602398693916413, "phrase": "ot"}, {"score": 0.0036445446531633368, "phrase": "decentralized_integration"}, {"score": 0.0035178323426661626, "phrase": "object_replicas"}, {"score": 0.0034714553759044664, "phrase": "critical_and_challenging_issue"}, {"score": 0.003066945490483524, "phrase": "theoretical_point"}, {"score": 0.002807118943000936, "phrase": "controller_synthesis_technique"}, {"score": 0.002626760910629479, "phrase": "basic_signatures"}, {"score": 0.0022595974985992664, "phrase": "additional_parameters"}, {"score": 0.002200337772403981, "phrase": "update_operations"}, {"score": 0.0021049977753042253, "phrase": "new_transformation_function"}], "paper_keywords": ["Collaborative editors", " operational transformation", " proof of convergence", " symbolic model checking", " controller synthesis"], "paper_abstract": "The operational transformation (OT) approach, used in many collaborative editors, allows a group of users to concurrently update replicas of a shared object and exchange their updates in any order. The basic idea is to transform any received update operation before its execution on a replica of the object. Concretely, OT consists of a centralized/decentralized integration procedure and a transformation function. In the context of decentralized integration, designing transformation functions for achieving convergence of object replicas is a critical and challenging issue. Indeed, the transformation functions proposed in the literature are all revealed inefficient. In this paper, we investigate the existence of transformation functions. From the theoretical point of view, two properties, named TP1 and TP2, are necessary and sufficient to ensure convergence. Using controller synthesis technique, we show that there are some transformation functions, which satisfy TP1 for the basic signatures of insert and delete operations. But, there is no transformation function, which satisfies both TP1 and TP2. Consequently, a transformation function which satisfies both TP1 and TP2 must necessarily have additional parameters in the signatures of some update operations. We propose, in this paper, a new transformation function and show formally that it ensures convergence.", "paper_title": "On Synthesizing a Consistent Operational Transformation Approach", "paper_id": "WOS:000351458800014"}