{"auto_keywords": [{"score": 0.049340969667338204, "phrase": "gene_expression"}, {"score": 0.040140896843783705, "phrase": "current_methods"}, {"score": 0.004815157117989827, "phrase": "gibbs"}, {"score": 0.004716215351463082, "phrase": "network_connectivity_consistency"}, {"score": 0.004643488753834639, "phrase": "dna_microarrays"}, {"score": 0.004524750101015184, "phrase": "transcriptional_regulatory_analyses"}, {"score": 0.004478105342825352, "phrase": "experimental_noise"}, {"score": 0.004443436195282021, "phrase": "data_types"}, {"score": 0.004409034264881601, "phrase": "environmental_dependence"}, {"score": 0.004229986712918669, "phrase": "complimentary_data_sources"}, {"score": 0.0041004692702610365, "phrase": "transcription_analyses"}, {"score": 0.004016326119656517, "phrase": "gene_expression-chip-chip_agreement"}, {"score": 0.0038731929369886097, "phrase": "separate_data_sources"}, {"score": 0.0037740768331370324, "phrase": "key_assumptions"}, {"score": 0.003715824281874229, "phrase": "high_false_positive_and_false_negative_rates"}, {"score": 0.0035833618054331878, "phrase": "minimal_amount"}, {"score": 0.0034022512471548754, "phrase": "higher_confidence_level"}, {"score": 0.0033237664470380343, "phrase": "saccharomyces"}, {"score": 0.003297994194347844, "phrase": "currently_available_chip-chip_binding_data"}, {"score": 0.003188639687888399, "phrase": "randomized_networks"}, {"score": 0.003123148940480257, "phrase": "high_degree"}, {"score": 0.0029194246334886334, "phrase": "gibbs_sampling_technique"}, {"score": 0.002778979787458387, "phrase": "gibbs_sampling_method"}, {"score": 0.0027360442907401173, "phrase": "high_levels"}, {"score": 0.00269377035953549, "phrase": "transcription_network"}, {"score": 0.002679824306876977, "phrase": "gene_expression_error"}, {"score": 0.0026384167183586015, "phrase": "lower_levels"}, {"score": 0.0024984517279573906, "phrase": "unfiltered_use"}, {"score": 0.002472643795752315, "phrase": "chip-chip-derived_network_connectivity_data"}, {"score": 0.002194296665270526, "phrase": "author's_homepage"}, {"score": 0.0021269766269040426, "phrase": "supplementary_data"}, {"score": 0.0021049977753042253, "phrase": "bioinformatics_online"}], "paper_keywords": [""], "paper_abstract": "Motivation: Data from DNA microarrays and ChIP-chip binding assays often form the basis of transcriptional regulatory analyses. However, experimental noise in both data types combined with environmental dependence and uncorrelation between binding and regulation in ChIP-chip binding data complicate analyses that utilize these complimentary data sources. Therefore, to minimize the impact of these inaccuracies on transcription analyses it is desirable to identify instances of gene expression-ChIP-chip agreement, under the premise that inaccuracies are less likely to be present when separate data sources corroborate each other. Current methods for such identification either make key assumptions that limit their applicability and/or yield high false positive and false negative rates. The goal of this work was to develop a method with a minimal amount of assumptions, and thus widely applicable, that can identify agreement between gene expression and ChIP-chip data at a higher confidence level than current methods. Results: We demonstrate in Saccharomyces cerevisiae that currently available ChIP-chip binding data explain microarray data from a variety of environments only as well as randomized networks with the same connectivity density. This suggests a high degree of inconsistency between the two data types and illustrates the need for a method that can identify consistency between the two data sources. Here we have developed a Gibbs sampling technique to identify genes whose expression and ChIP-chip binding data are mutually consistent. Compared to current methods that could perform the same task, the Gibbs sampling method developed here exceeds their ability at high levels (> 50%) of transcription network and gene expression error, while performing similarly at lower levels. Using this technique, we show that on average 73% more gene expression features can be captured per gene as compared to the unfiltered use of gene expression and ChIP-chip-derived network connectivity data. It is important to note that the method described here can be generalized to other transcription connectivity data (e.g. sequence analysis, etc.). Availability: Our algorithm is available on request from the authors and soon to be posted on the web. See author's homepage for details, http://www.seas.ucla.edu/similar to liaoj/ Contact: liaoj@ucla.edu Supplementary information: Supplementary data are available at Bioinformatics Online.", "paper_title": "A Gibbs sampler for the identification of gene expression and network connectivity consistency", "paper_id": "WOS:000242715200011"}