{"auto_keywords": [{"score": 0.03779444038009023, "phrase": "evolutionary_support_vector_machine"}, {"score": 0.02322730111336099, "phrase": "nonrandomized_studies"}, {"score": 0.021545873961596514, "phrase": "classifier_performance"}, {"score": 0.01645872788050272, "phrase": "full_citations"}, {"score": 0.010007531992534246, "phrase": "full-text_screening"}, {"score": 0.008879018886449755, "phrase": "citation_portions"}, {"score": 0.00810302105774663, "phrase": "k-nearest_neighbor"}, {"score": 0.00805053733571474, "phrase": "bayes"}, {"score": 0.007426644278994147, "phrase": "phase_ii"}, {"score": 0.005568122215025527, "phrase": "naive_bayes_classifiers"}, {"score": 0.004793949677919487, "phrase": "medical_systematic_reviews"}, {"score": 0.004149792080414689, "phrase": "biomedical_citations"}, {"score": 0.0041136473765874815, "phrase": "mostly_nonrandomized_studies"}, {"score": 0.004042295865725559, "phrase": "test_sets"}, {"score": 0.0032054891061528896, "phrase": "overweighted_titles"}, {"score": 0.0031636612155559267, "phrase": "classifier_parameters"}, {"score": 0.0031360786664165093, "phrase": "information_gain_thresholds"}, {"score": 0.0030951536886513567, "phrase": "iterative_grid"}, {"score": 0.002949598537993663, "phrase": "feature_sets"}, {"score": 0.0028542895373777173, "phrase": "second_pass"}, {"score": 0.002835599469639296, "phrase": "reduced_set"}, {"score": 0.002749980017065414, "phrase": "best_recall"}, {"score": 0.002690406375639144, "phrase": "best_classifier"}, {"score": 0.00266693888510356, "phrase": "overall_performance"}, {"score": 0.0026263609643066197, "phrase": "good_enough_recall"}, {"score": 0.002508284945907166, "phrase": "generalization_performance"}, {"score": 0.002464709648714996, "phrase": "independent_tests"}, {"score": 0.002416589459425828, "phrase": "initial_retrieval_set"}, {"score": 0.0021658283945376494, "phrase": "second_independent_pass"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Medical informatics", " Clinical research informatics", " Text mining", " Document classification", " Systematic reviews"], "paper_abstract": "Objectives: To investigate whether (1) machine learning classifiers can help identify nonrandomized studies eligible for full-text screening by systematic reviewers; (2) classifier performance varies with optimization; and (3) the number of citations to screen can be reduced. Methods: We used an open-source, data-mining suite to process and classify biomedical citations that point to mostly nonrandomized studies from 2 systematic reviews. We built training and test sets for citation portions and compared classifier performance by considering the value of indexing, various feature sets, and optimization. We conducted our experiments in 2 phases. The design of phase I with no optimization was: 4 classifiers x 3 feature sets x 3 citation portions. Classifiers included k-nearest neighbor, naive Bayes, complement nave Bayes, and evolutionary support vector machine. Feature sets included bag of words, and 2- and 3-term n-grams. Citation portions included titles, titles and abstracts, and full citations with metadata. Phase II with optimization involved a subset of the classifiers, as well as features extracted from full citations, and full citations with overweighted titles. We optimized features and classifier parameters by manually setting information gain thresholds outside of a process for iterative grid optimization with 10-fold cross-validations. We independently tested models on data reserved for that purpose and statistically compared classifier performance on 2 types of feature sets. We estimated the number of citations needed to screen by reviewers during a second pass through a reduced set of citations. Results: In phase I, the evolutionary support vector machine returned the best recall for bag of words extracted from full citations; the best classifier with respect to overall performance was k-nearest neighbor. No classifier attained good enough recall for this task without optimization. In phase II, we boosted performance with optimization for evolutionary support vector machine and complement naive Bayes classifiers. Generalization performance was better for the latter in the independent tests. For evolutionary support vector machine and complement naive Bayes classifiers, the initial retrieval set was reduced by 46% and 35%, respectively. Conclusions: Machine learning classifiers can help identify nonrandomized studies eligible for full-text screening by systematic reviewers. Optimization can markedly improve performance of classifiers. However, generalizability varies with the classifier. The number of citations to screen during a second independent pass through the citations can be substantially reduced. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Screening nonrandomized studies for medical systematic reviews: A comparative study of classifiers", "paper_id": "WOS:000306769900006"}