{"auto_keywords": [{"score": 0.0498021329116458, "phrase": "automatic_parallelization"}, {"score": 0.00481495049065317, "phrase": "dependent_computations"}, {"score": 0.004350522674831886, "phrase": "cpu"}, {"score": 0.004300133642951283, "phrase": "autoparallelizing_compilers"}, {"score": 0.00421371094333215, "phrase": "granularity_analysis"}, {"score": 0.004046020290832207, "phrase": "spawn-off_cost"}, {"score": 0.004010960493946656, "phrase": "comfortable_margin"}, {"score": 0.0038962653593060427, "phrase": "good_results"}, {"score": 0.0038624981944755813, "phrase": "data_dependencies"}, {"score": 0.003784837517869512, "phrase": "running_computations"}, {"score": 0.00304435946188921, "phrase": "procedure_call"}, {"score": 0.002535265741041731, "phrase": "good_idea"}, {"score": 0.002462795995431834, "phrase": "mercury"}, {"score": 0.0023168823213024856, "phrase": "mercury_compiler"}, {"score": 0.002283460959126296, "phrase": "next_compilation"}, {"score": 0.002237477619351199, "phrase": "preliminary_results"}, {"score": 0.0021860555252905876, "phrase": "useful_parallelization_speedups"}, {"score": 0.00212343307513777, "phrase": "representative_input_data"}, {"score": 0.0021049977753042253, "phrase": "profiling_run"}], "paper_keywords": ["automatic parallelism", " program analysis", " program optimization", " Mercury"], "paper_abstract": "Researchers working on the automatic parallelization of programs have long known that too much parallelism can be even worse for performance than too little, because spawning a task to be run on another CPU incurs overheads. Autoparallelizing compilers have therefore long tried to use granularity analysis to ensure that they only spawn off computations whose cost will probably exceed the spawn-off cost by a comfortable margin. However, this is not enough to yield good results, because data dependencies may also limit the usefulness of running computations in parallel. If one computation blocks almost immediately and can resume only after another has completed its work, then the cost of parallelization again exceeds the benefit. We present a set of algorithms for recognizing places in a program where it is worthwhile to execute two or more computations in parallel that pay attention to the second of these issues as well as the first. Our system uses profiling information to compute the times at which a procedure call consumes the values of its input arguments and the times at which it produces the values of its output arguments. Given two calls that may be executed in parallel, our system uses the times of production and consumption of the variables they share to determine how much their executions would overlap if they were run in parallel, and therefore whether executing them in parallel is a good idea or not. We have implemented this technique for Mercury in the form of a tool that uses profiling data to generate recommendations about what to parallelize, for the Mercury compiler to apply on the next compilation of the program. We present preliminary results that show that this technique can yield useful parallelization speedups, while requiring nothing more from the programmer than representative input data for the profiling run.", "paper_title": "Estimating the overlap between dependent computations for automatic parallelization", "paper_id": "WOS:000292701100010"}