{"auto_keywords": [{"score": 0.04279339019139431, "phrase": "multiple_interfaces"}, {"score": 0.00481495049065317, "phrase": "multi-homed_mobile_hosts"}, {"score": 0.0045143706249204905, "phrase": "multiple_and_heterogeneous_wireless_interfaces"}, {"score": 0.004183137595671171, "phrase": "best_approach"}, {"score": 0.003991449490087454, "phrase": "mobile_device"}, {"score": 0.003591542373891629, "phrase": "simple_\"bandwidth_aggregation\"_approaches"}, {"score": 0.003487721546598799, "phrase": "meaningful_benefits"}, {"score": 0.003367077034382727, "phrase": "highly_disparate_bandwidths"}, {"score": 0.0023953929817357882, "phrase": "google_android_mobile_phone"}, {"score": 0.002193367454830741, "phrase": "real-world_experiments"}, {"score": 0.002129877319760485, "phrase": "theoretical_analysis"}, {"score": 0.0021049977753042253, "phrase": "extensive_experiments"}], "paper_keywords": ["Mobile devices", " Heterogeneous networks", " Bandwidth aggregation", " WiFi", " Cellular networks", " TCP"], "paper_abstract": "Most mobile devices today are equipped with multiple and heterogeneous wireless interfaces. In this paper we ask the following question: What is the best approach to leverage the multiple interfaces available at a mobile device in terms of the performance delivered to the user? In answering the question we argue that simple \"bandwidth aggregation\" approaches do not provide any meaningful benefits when the multiple interfaces used have highly disparate bandwidths as is true in many practical environments. We then present super-aggregation, a set of mechanisms that in tandem use the multiple interfaces intelligently and in the process is able to achieve a performance that is \"better than the sum of throughputs\" achievable through each of the interfaces individually. We prototype super-aggregation on both a laptop and the Google Android mobile phone and demonstrate the significant (up to 3 throughput) performance improvements it provides in real-world experiments. We conduct both theoretical analysis and extensive experiments to show that super-aggregation is able to improve throughput beyond the sum of the parts under most of the cases.", "paper_title": "A super-aggregation strategy for multi-homed mobile hosts with heterogeneous wireless interfaces", "paper_id": "WOS:000348448900020"}