{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parallel_applications"}, {"score": 0.008082035834666355, "phrase": "communication-intensive_applications"}, {"score": 0.004724878518219719, "phrase": "cluster_computing"}, {"score": 0.004614643339546038, "phrase": "primary_and_cost-effective_platform"}, {"score": 0.00438105507792004, "phrase": "large_amount"}, {"score": 0.004159241394996858, "phrase": "interconnection_network"}, {"score": 0.004120130206000757, "phrase": "conventional_load_balancers"}, {"score": 0.003766369160795001, "phrase": "existing_load-balancing_schemes"}, {"score": 0.0035755653799043, "phrase": "effective_bandwidth"}, {"score": 0.0033308077968426937, "phrase": "communication-aware_load-balancing_technique"}, {"score": 0.003132236287543072, "phrase": "effective_utilization"}, {"score": 0.003073545175760353, "phrase": "cluster_environments"}, {"score": 0.0030017207229983385, "phrase": "proposed_load-balancing_scheme"}, {"score": 0.002931569771634119, "phrase": "behavior_model"}, {"score": 0.0028766278519176355, "phrase": "large_requirements"}, {"score": 0.0024960069794216977, "phrase": "simulation_results"}, {"score": 0.002449208093757498, "phrase": "diverse_set"}, {"score": 0.0023249757987087055, "phrase": "cluster_show"}, {"score": 0.002125020720324262, "phrase": "existing_schemes"}], "paper_keywords": ["Cluster", " communication-aware computing", " parallel computing", " load balancing"], "paper_abstract": "Cluster computing has emerged as a primary and cost-effective platform for running parallel applications, including communication-intensive applications that transfer a large amount of data among the nodes of a cluster via the interconnection network. Conventional load balancers have proven effective in increasing the utilization of CPU, memory, and disk I/O resources in a cluster. However, most of the existing load-balancing schemes ignore network resources, leaving an opportunity to improve the effective bandwidth of networks on clusters running parallel applications. For this reason, we propose a communication-aware load-balancing technique that is capable of improving the performance of communication-intensive applications by increasing the effective utilization of networks in cluster environments. To facilitate the proposed load-balancing scheme, we introduce a behavior model for parallel applications with large requirements of network, CPU, memory, and disk I/O resources. Our load-balancing scheme can make full use of this model to quickly and accurately determine the load induced by a variety of parallel applications. Simulation results generated from a diverse set of both synthetic bulk synchronous and real parallel applications on a cluster show that our scheme significantly improves the performance, in terms of slowdown and turn-around time, over existing schemes by up to 206 percent (with an average of 74 percent) and 235 percent (with an average of 82 percent), respectively.", "paper_title": "Communication-Aware Load Balancing for Parallel Applications on Clusters", "paper_id": "WOS:000272314600004"}