{"auto_keywords": [{"score": 0.04798147908618875, "phrase": "euclidean_distance"}, {"score": 0.040558346923894165, "phrase": "fractional_norms"}, {"score": 0.03778893291109941, "phrase": "concentration_phenomenon"}, {"score": 0.00481495049065317, "phrase": "fractional_distances"}, {"score": 0.004775918707955445, "phrase": "nearest_neighbor_search_and_many_other_numerical_data_analysis_tools"}, {"score": 0.0044025116437190785, "phrase": "euclidean_distances"}, {"score": 0.004226856126282259, "phrase": "data_elements"}, {"score": 0.0034761488481944657, "phrase": "alternative_distances"}, {"score": 0.003310236836421397, "phrase": "intrinsic_property"}, {"score": 0.0031780228058373235, "phrase": "finite_sample"}, {"score": 0.0025918745925152423, "phrase": "euclidean_norm"}, {"score": 0.0024781515864648242, "phrase": "theoretical_arguments"}, {"score": 0.002359759876402679, "phrase": "real_data"}, {"score": 0.00220163445285539, "phrase": "independent_and_identically_distributed_variables"}, {"score": 0.0021049977753042253, "phrase": "optimal_metric"}], "paper_keywords": ["nearest neighbor search", " high-dimensional data", " distance concentration", " fractional distances"], "paper_abstract": "Nearest neighbor search and many other numerical data analysis tools most often rely on the use of the euclidean distance. When data are high dimensional, however, the euclidean distances seem to concentrate; all distances between pairs of data elements seem to be very similar. Therefore, the relevance of the euclidean distance has been questioned in the past, and fractional norms (Minkowski-like norms with an exponent less than one) were introduced to fight the concentration phenomenon. This paper justifies the use of alternative distances to fight concentration by showing that the concentration is indeed an intrinsic property of the distances and not an artifact from a finite sample. Furthermore, an estimation of the concentration as a function of the exponent of the distance and of the distribution of the data is given. It leads to the conclusion that, contrary to what is generally admitted, fractional norms are not always less concentrated than the euclidean norm; a counterexample is given to prove this claim. Theoretical arguments are presented, which show that the concentration phenomenon can appear for real data that do not match the hypotheses of the theorems, in particular, the assumption of independent and identically distributed variables. Finally, some insights about how to choose an optimal metric are given.", "paper_title": "The concentration of fractional distances", "paper_id": "WOS:000247177500001"}