{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ovarian_ultrasound_images"}, {"score": 0.0046046429665581555, "phrase": "females'_ovaries"}, {"score": 0.00445293569103488, "phrase": "gynaecological_imaging"}, {"score": 0.00400459716272594, "phrase": "ovarian_follicles'_growth"}, {"score": 0.003724034990158436, "phrase": "dominant_follicles"}, {"score": 0.003501991125315889, "phrase": "follicular_phase"}, {"score": 0.0031140747752837826, "phrase": "existing_computer_methods"}, {"score": 0.0026330549554033876, "phrase": "proposed_follicle_processing_algorithms"}, {"score": 0.0024620842899061614, "phrase": "higher_ranking_solutions"}, {"score": 0.0023941575109692336, "phrase": "so-called_best_algorithm"}, {"score": 0.0023151088048303705, "phrase": "ovarian_follicles"}, {"score": 0.0022261705957258506, "phrase": "future_research"}], "paper_keywords": ["Ovarian follicle detection", " Image segmentation", " Review"], "paper_abstract": "Observing changes in females' ovaries is essential in obstetrics and gynaecological imaging, e.g., genetic engineering and human reproduction. It is particularly important to monitor the dynamics of ovarian follicles' growth, as only fully mature and grown follicles, i.e., the dominant follicles have a potential to ovulate at the end of a follicular phase. Gynaecologists follow this process in two dimensions, but recently three-dimensional (3-D) ultrasound examinations are coming to the fore. This paper surveys the existing computer methods for detection, recognition, and analyses of follicles in two-dimensional (2-D) and 3-D ovarian ultrasound recordings. Our study focuses on the efficiency, validation, and assessment of proposed follicle processing algorithms. The most important processing steps were identified in order to compare their performances. Higher ranking solutions are suggested for the so-called best algorithm for 2-D and 3-D ultrasound recordings of ovarian follicles. Finally, some guidelines for future research in this field are discussed, in particular for 3-D ultrasound volumes.", "paper_title": "Computerized detection and recognition of follicles in ovarian ultrasound images: a review", "paper_id": "WOS:000312144300005"}