{"auto_keywords": [{"score": 0.04360576179569519, "phrase": "bad_downloads"}, {"score": 0.007932753780060281, "phrase": "bandwidth_consumption"}, {"score": 0.006761227896309992, "phrase": "sybil_attacks"}, {"score": 0.005394175750513647, "phrase": "elisyr"}, {"score": 0.004680725471654037, "phrase": "current_internet_and_file_sharing_accounts"}, {"score": 0.004286498418857255, "phrase": "downloaded_file_sizes"}, {"score": 0.004193220779864395, "phrase": "file_search"}, {"score": 0.004050708996795156, "phrase": "malicious_file_downloads"}, {"score": 0.0038038433163457754, "phrase": "high_volume"}, {"score": 0.003779996603264111, "phrase": "malicious_users"}, {"score": 0.003651477256755136, "phrase": "sybil_attacker"}, {"score": 0.0036171884608283047, "phrase": "large_number"}, {"score": 0.0034504976926879424, "phrase": "large_portion"}, {"score": 0.002957516535697149, "phrase": "social_networks"}, {"score": 0.0029113423551788264, "phrase": "benign_files"}, {"score": 0.0027509877943131945, "phrase": "similar_success"}, {"score": 0.0026490090146527407, "phrase": "sybilguard"}, {"score": 0.0026323829544632428, "phrase": "sybillimit"}, {"score": 0.002510960575700234, "phrase": "lower_bandwidth_consumption"}, {"score": 0.002456224752333807, "phrase": "fairer_distribution"}, {"score": 0.002440805709023898, "phrase": "computation_loads"}, {"score": 0.0024178580026395276, "phrase": "general_efforts"}, {"score": 0.0021049977753042253, "phrase": "subsequent_re-search"}], "paper_keywords": ["P2p file sharing", " Sybil-resilient", " p2p file search", " sybil attack", " load balancing"], "paper_abstract": "Peer-to-peer (P2P) networks consume the most bandwidth in the current Internet and file sharing accounts for the majority of the P2P traffic. Thus it is important for a P2P file sharing application to be efficient in bandwidth consumption. Bandwidth consumption as much as downloaded file sizes is inevitable, but those in file search and bad downloads, e. g. wrong, corrupted, or malicious file downloads, are overheads. In this paper, we target to reduce these overheads even in the presence of high volume of malicious users and their bad files. Sybil attacks are the example of such hostile environment. Sybil attacker creates a large number of identities (Sybil nodes) and unfairly influences the system. When a large portion of the system is subverted, either in terms of the number of users or the number of files shared in the system, the overheads due to the bad downloads rapidly increase. We propose ELiSyR, a file search protocol that can tolerate such a hostile environment. ELiSyR uses social networks for P2P file search and finds benign files in 71% of searches even when more than half of the users are malicious. Furthermore, ELiSyR provides similar success with less bandwidth than other general efforts against Sybil attacks. We compare our algorithm to SybilGuard, SybilLimit and EigenTrust in terms of bandwidth consumption and the likelihood of bad downloads. Our algorithm shows lower bandwidth consumption, similar chances of bad downloads and fairer distribution of computation loads than these general efforts. In return, our algorithm takes more rounds of search than them. However the time required for search is usually much less than the time required for downloads, so the delay in search is justifiable compared to the cost of bad downloads and subsequent re-search and downloads.", "paper_title": "ELiSyR: Efficient, Lightweight and Sybil-Resilient File Search in P2P Networks", "paper_id": "WOS:000285646500019"}