{"auto_keywords": [{"score": 0.041637876149046134, "phrase": "gda"}, {"score": 0.040841142776387125, "phrase": "information_flow"}, {"score": 0.01214125421250989, "phrase": "game_discourse"}, {"score": 0.00481495049065317, "phrase": "game_discourse_analysis"}, {"score": 0.004681653551412616, "phrase": "effective_serious_games"}, {"score": 0.004607139608615063, "phrase": "back_story"}, {"score": 0.0044795698035664695, "phrase": "serious_games_designers"}, {"score": 0.0037999551521987426, "phrase": "information_elements"}, {"score": 0.0037544644262310525, "phrase": "chronological_order"}, {"score": 0.003022465992278672, "phrase": "communication_tool"}, {"score": 0.0029982770062678926, "phrase": "multidisciplinary_design_teams"}, {"score": 0.0026577673946415583, "phrase": "substantial_deviations"}, {"score": 0.002625914195439153, "phrase": "optimal_information_flow"}, {"score": 0.002604890546456604, "phrase": "players'_actions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computer games", " Game design", " Discourse analysis", " Engagement", " Curiosity", " Entertainment"], "paper_abstract": "A challenge for serious games designers is to integrate learning with entertainment. For this purpose, the generation of curiosity using the foreshadowing/back story technique is promising. To implement this technique we propose the Game Discourse Analysis (GDA) which discerns between information flow (i.e. the sequence of information elements in a chronological order) and game discourse (i.e. the manipulation of the information flow to make the game more engaging and effective). We elaborate on the GDA and describe how two of the authors applied it in order to implement foreshadowing/back story in the game ReMission. The GDA was found to have potential as a communication tool for multidisciplinary design teams. Also, two problems were signaled: (1) creating an information flow is laborious and designers may benefit from automating parts of the GDA; (2) substantial deviations from the optimal information flow by players' actions may interfere with the intention of the game discourse. Additionally, in an experiment we tested the impact of this GDA supported manipulation on engagement (curiosity) and learning. We found that the GDA-supported foreshadowing/back story yielded more curiosity, but that it did not yield learning. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "The role of Game Discourse Analysis and curiosity in creating engaging and effective serious games by implementing a back story and foreshadowing", "paper_id": "WOS:000293320200006"}