{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "healthcare_simulation"}, {"score": 0.0430563354050527, "phrase": "healthcare_problems"}, {"score": 0.04084189426087636, "phrase": "healthcare_simulation_literature"}, {"score": 0.004329418448610183, "phrase": "operational_research"}, {"score": 0.004299823165101385, "phrase": "health_economics"}, {"score": 0.004226713291503426, "phrase": "simulation_techniques"}, {"score": 0.003800271653332246, "phrase": "high-quality_journals"}, {"score": 0.0036095967013657906, "phrase": "monte_carlo"}, {"score": 0.0033933295645859015, "phrase": "journal_impact_factor"}, {"score": 0.0031464653712924436, "phrase": "isi_web"}, {"score": 0.003050712095258931, "phrase": "high-impact_research_journals"}, {"score": 0.0028287025225754337, "phrase": "different_simulation_techniques"}, {"score": 0.0026138115448726567, "phrase": "article_citations"}, {"score": 0.0025429488129788077, "phrase": "healthcare_papers"}, {"score": 0.002398664348595521, "phrase": "co-citation_analysis"}, {"score": 0.0021562588804528667, "phrase": "review_paper"}, {"score": 0.0021049977753042253, "phrase": "broader_understanding"}], "paper_keywords": ["simulation research", " healthcare research", " profiling research", " co-citation analysis"], "paper_abstract": "The publications that relate to the application of simulation to healthcare have steadily increased over the years. These publications are scattered amongst various journals that belong to several subject categories, including operational research, health economics and pharmacokinetics. The simulation techniques that are applied to the study of healthcare problems are also various. The aim of this study, therefore, is to review healthcare simulation literature that have been published between 1970 and 2007 in high-quality journals belonging to various subject categories and that report on the application of four simulation techniques, namely, Monte Carlo simulation, discrete-event simulation, system dynamics and agent-based simulation. Arguably, journal impact factor is fundamental in assessing the quality of publications. Thus, the 201 publications selected for review have been queried from the ISI Web of Science (R) bibliographic database of high-impact research journals. Through a review of healthcare simulation literature the following three objectives have been realized: (a) papers have been categorized under the different simulation techniques, and the healthcare problems that each technique is employed to investigate are identified; (b) variables such as authors, article citations, etc., within our dataset of healthcare papers have been profiled; (c) turning point (strategically important) papers and authors have been identified through co-citation analysis of references cited by the papers in our dataset. The above objectives have been realized by devising and then employing a methodology for profiling literature. It is expected that this review paper will help the readers gain a broader understanding of research in healthcare simulation.", "paper_title": "Profiling Literature in Healthcare Simulation", "paper_id": "WOS:000280765600006"}