{"auto_keywords": [{"score": 0.048494587518403014, "phrase": "maximal_cliques"}, {"score": 0.010612387000973441, "phrase": "maximal_clique_enumeration"}, {"score": 0.0105337968807766, "phrase": "perturbed_graphs"}, {"score": 0.009421842289443441, "phrase": "mce"}, {"score": 0.005569332857291818, "phrase": "perturbed_graph"}, {"score": 0.004552360432689039, "phrase": "computationally_expensive_problem"}, {"score": 0.004434745755769205, "phrase": "different_domains"}, {"score": 0.004208515754292201, "phrase": "single_graph"}, {"score": 0.004130535674260505, "phrase": "initial_computation_time"}, {"score": 0.00399378014373321, "phrase": "noisy_or_uncertain_data"}, {"score": 0.0037899595175206143, "phrase": "computational_cost"}, {"score": 0.0034514309280805106, "phrase": "related_graphs"}, {"score": 0.0033121909731471787, "phrase": "baseline_graph"}, {"score": 0.002625866440129899, "phrase": "perturbed_graphs'_mces"}, {"score": 0.0024546155360991567, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.002427177130359851, "phrase": "difference_sets"}, {"score": 0.002193600680263771, "phrase": "traditional_calculations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph perturbation theory", " Maximal clique enumeration", " Graph algorithms", " Uncertain and noisy data"], "paper_abstract": "The problem of enumerating the maximal cliques of a graph is a computationally expensive problem with applications in a number of different domains. Sometimes the benefit of knowing the maximal clique enumeration (MCE) of a single graph is worth investing the initial computation time. However, when graphs are abstractions of noisy or uncertain data, the MCE of several closely related graphs may need to be found, and the computational cost of doing so becomes prohibitively expensive. Here, we present a method by which the cost of enumerating the set of maximal cliques for related graphs can be reduced. By using the MCE for some baseline graph, the MCE for a modified, or perturbed, graph may be obtained by enumerating only the maximal cliques that are created or destroyed by the perturbation. When the baseline and perturbed graphs are relatively similar, the difference set between the two MCEs can be overshadowed by the maximal cliques common to both. Thus, by enumerating only the difference set between the baseline and perturbed graphs' MCEs, the computational cost of enumerating the maximal cliques of the perturbed graph can be reduced. We present necessary and sufficient conditions for enumerating difference sets when the perturbed graph is formed by several different types of perturbations. We also present results of an algorithm based on these conditions that demonstrate a speedup over traditional calculations of the MCE of perturbed, real biological networks. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Theoretical underpinnings for maximal clique enumeration on perturbed graphs", "paper_id": "WOS:000278564600010"}