{"auto_keywords": [{"score": 0.029635807044573397, "phrase": "optimization_time"}, {"score": 0.00481495049065317, "phrase": "main_objective"}, {"score": 0.0046242451772036145, "phrase": "manufacturing_cost"}, {"score": 0.004481132747216135, "phrase": "economical_design"}, {"score": 0.00438161736774803, "phrase": "engineering_restrictions"}, {"score": 0.0037608593980593035, "phrase": "\"successive_coordinate_search"}, {"score": 0.003677280504320639, "phrase": "geometry_optimization"}, {"score": 0.0035156341294017685, "phrase": "optimization_speed"}, {"score": 0.0034529760173586583, "phrase": "solution_time"}, {"score": 0.003376216135716632, "phrase": "fast_matrix_analysis_methods"}, {"score": 0.0031559919178954644, "phrase": "objective_function"}, {"score": 0.003085813569061001, "phrase": "optimized_solution"}, {"score": 0.002624423288947767, "phrase": "appropriate_values"}, {"score": 0.002387758958649797, "phrase": "optimum_solution"}, {"score": 0.0022520496048464406, "phrase": "presented_method"}, {"score": 0.002124036931047162, "phrase": "fast_method"}, {"score": 0.0021049977753042253, "phrase": "optimizing_variety"}], "paper_keywords": ["Truss", " Optimization", " Sizing optimization", " Geometry optimization", " Structural optimization", " Coordinate descent"], "paper_abstract": "The main objective of the structure optimization is to reduce the manufacturing cost of the structure. However, economical design should not deviate from engineering restrictions and laws. Based on this concept, various methods have been invented to optimize structures. In this research, some variations in one of the very simple and primary methods called \"coordinate descent\" or \"successive coordinate search\" is used for geometry optimization of the trusses. In order to increase the optimization speed and decrease the solution time of the problem, fast matrix analysis methods has been employed leading to reduction of the time required for calculating of the objective function. Furthermore, an optimized solution seeking algorithm has been introduced. In this algorithm, some factors have been defined by which the relation between the optimization time and these factors have been calculated, both experimentally and mathematically and the appropriate values of these factors are obtained to reduce the optimization time. Moreover, the effect of increasing the accuracy of the optimum solution on the number of analyses has been studied. Analysis of the presented method shows that regardless of its simplicity, it can be utilized as a fast method for optimizing variety of structures. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A coordinate descent based method for geometry optimization of trusses", "paper_id": "WOS:000288570200002"}