{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "build_technology"}, {"score": 0.04770348844327158, "phrase": "source_code"}, {"score": 0.004664352260912174, "phrase": "build_systems"}, {"score": 0.004349337717774093, "phrase": "continual_maintenance"}, {"score": 0.0041074234667687875, "phrase": "build_maintenance"}, {"score": 0.0039036638083325783, "phrase": "build_technologies"}, {"score": 0.003663067281537946, "phrase": "build_code"}, {"score": 0.003459191419478298, "phrase": "different_build_technologies"}, {"score": 0.0032253056091816465, "phrase": "version_histories"}, {"score": 0.0024842242921857705, "phrase": "build_changes"}, {"score": 0.0023458049872325214, "phrase": "low-level_or_abstraction-based_ones"}, {"score": 0.0021456243019466843, "phrase": "build_maintenance_work"}, {"score": 0.0021049977753042253, "phrase": "build-focused_team"}], "paper_keywords": ["Build systems", " Software maintenance", " Large-scale analysis", " Open source"], "paper_abstract": "Build systems specify how source code is translated into deliverables. They require continual maintenance as the system they build evolves. This build maintenance can become so burdensome that projects switch build technologies, potentially having to rewrite thousands of lines of build code. We aim to understand the prevalence of different build technologies and the relationship between build technology and build maintenance by analyzing version histories in a corpus of 177,039 repositories spread across four software forges, three software ecosystems, and four large-scale projects. We study low-level, abstraction-based, and framework-driven build technologies, as well as tools that automatically manage external dependencies. We find that modern, framework-driven build technologies need to be maintained more often and these build changes are more tightly coupled with the source code than low-level or abstraction-based ones. However, build technology migrations tend to coincide with a shift of build maintenance work to a build-focused team, deferring the cost of build maintenance to them.", "paper_title": "A Large-Scale Empirical Study of the Relationship between Build Technology and Build Maintenance", "paper_id": "WOS:000363032900006"}