{"auto_keywords": [{"score": 0.036486666482566536, "phrase": "possibility_degree"}, {"score": 0.033443970554536524, "phrase": "bonferroni"}, {"score": 0.00481495049065317, "phrase": "geometric_bonferroni_mean_operator"}, {"score": 0.004454377387615279, "phrase": "fuzzy_multi-attribute_group_decision"}, {"score": 0.00414545383888272, "phrase": "decision_makers"}, {"score": 0.0035473867669654174, "phrase": "new_method"}, {"score": 0.0025051811853674215, "phrase": "fmagdm"}, {"score": 0.00247529638625566, "phrase": "trapezoidal_interval"}, {"score": 0.002445767214680791, "phrase": "fuzzy_information"}, {"score": 0.0023451553255837317, "phrase": "illustrative_example"}, {"score": 0.002262209824105154, "phrase": "developed_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy multi-attributes group decision making", " Interval type-2 fuzzy sets", " Possibility mean value", " Geometric Bonferroni mean operator"], "paper_abstract": "In this paper, we investigate the fuzzy multi-attribute group decision making (FMAGDM) problems in which all the information provided by the decision makers (DMs) is expressed as the trapezoidal interval type-2 fuzzy sets (IT2 FS). We introduce the concepts of interval possibility mean value and present a new method for calculating the possibility degree of two trapezoidal IT2 FS. Then, we develop two aggregation techniques called the trapezoidal interval type-2 fuzzy geometric Bonferroni mean (TIT2FGBM) operator and the trapezoidal interval type-2 fuzzy weighted geometric Bonferroni mean (TIT2FWGBM) operator. We study its properties and discuss its special cases. Based on the TIT2FWGBM operator and the possibility degree, the method of FMAGDM with trapezoidal interval type-2 fuzzy information is proposed. Finally, an illustrative example is given to verify the developed approaches and to demonstrate their practicality and effectiveness. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-attribute group decision making method based on geometric Bonferroni mean operator of trapezoidal interval type-2 fuzzy numbers", "paper_id": "WOS:000350778100016"}