{"auto_keywords": [{"score": 0.036155914988631646, "phrase": "herd"}, {"score": 0.004765788394931875, "phrase": "voip_systems"}, {"score": 0.004435363840720883, "phrase": "scalable_anonymity_network"}, {"score": 0.004322967486451877, "phrase": "traffic_analysis"}, {"score": 0.004256895619944631, "phrase": "sufficiently_low_delay"}, {"score": 0.00421340730888561, "phrase": "high-quality_voice_calls"}, {"score": 0.0031277316566463978, "phrase": "untrusted_super_peers"}, {"score": 0.002940626369102927, "phrase": "trust_zone"}, {"score": 0.0028076592725295646, "phrase": "strong_adversarial_model"}, {"score": 0.00250732953434891, "phrase": "low_bandwidth_requirements"}, {"score": 0.002456272788591051, "phrase": "super_peers"}, {"score": 0.0024186620196958867, "phrase": "bandwidth_and_cpu_requirements"}, {"score": 0.0023816257768353344, "phrase": "trusted_infrastructure"}, {"score": 0.0022390533383717715, "phrase": "prototype_deployment"}, {"score": 0.0021049977753042253, "phrase": "high-quality_calls"}], "paper_keywords": ["Anonymity networks", " Voice-over-IP", " Intersection attacks", " Strong anonymity"], "paper_abstract": "Effectively anonymizing Voice-over-IP (VoIP) calls requires a scalable anonymity network that is resilient to traffic analysis and has sufficiently low delay for high-quality voice calls. The popular Tor anonymity network, for instance, is not designed for the former and cannot typically achieve the latter. In this paper, we present the design, implementation, and experimental evaluation of Herd, an anonymity network where a set of dedicated, fully interconnected cloud-based proxies yield suitably low-delay circuits, while untrusted super peers add scalability. Herd provides caller/callee anonymity among the clients within a trust zone (e.g., jurisdiction) and under a strong adversarial model. Simulations based on a trace of 370 million mobile phone calls among 10.8 million users indicate that Herd achieves anonymity among millions of clients with low bandwidth requirements, and that super peers decrease the bandwidth and CPU requirements of the trusted infrastructure by an order of magnitude. Finally, experiments using a prototype deployment on Amazon EC2 show that Herd has a delay low enough for high-quality calls in most cases.", "paper_title": "Herd: A Scalable, Traffic Analysis Resistant Anonymity Network for VoIP Systems", "paper_id": "WOS:000370556200087"}