{"auto_keywords": [{"score": 0.004546174820239776, "phrase": "inherent_complexity"}, {"score": 0.004506171772318298, "phrase": "content-based_routing"}, {"score": 0.004466519142879166, "phrase": "message_loss_detection"}, {"score": 0.00436890075128947, "phrase": "network_state_recovery"}, {"score": 0.004292337783332826, "phrase": "existing_proposals"}, {"score": 0.004070573090297285, "phrase": "traditional_network_architecture"}, {"score": 0.0038602215057106917, "phrase": "robust_network_architectures"}, {"score": 0.0036445446531633368, "phrase": "traditional_architectures"}, {"score": 0.003502305158321511, "phrase": "hybrid_network_architecture"}, {"score": 0.0032919615578986816, "phrase": "moderate_fault_tolerance"}, {"score": 0.0032485526269852606, "phrase": "highly-robust_one"}, {"score": 0.003080548510001051, "phrase": "normal_operations"}, {"score": 0.0026036031415940563, "phrase": "minimal_overhead"}, {"score": 0.0025806490053534316, "phrase": "per-hop_reliability"}, {"score": 0.002490833392316362, "phrase": "lost_messages"}, {"score": 0.002436289099444074, "phrase": "transit_errors"}, {"score": 0.0023307492812556204, "phrase": "extensive_simulation_experiments"}, {"score": 0.0022496114364599328, "phrase": "superior_performance"}], "paper_keywords": ["Content-based publish/subscribe", " Fault tolerance", " Reliable distributed system", " High-performance system design"], "paper_abstract": "Provisioning reliability in a high-performance content-based publish/subscribe system is a challenging problem. The inherent complexity of content-based routing makes message loss detection and recovery, and network state recovery extremely complicated. Existing proposals either try to reduce the complexity of handling failures in a traditional network architecture, which only partially address the problem, or rely on robust network architectures that can gracefully tolerate failures, but perform less efficiently than the traditional architectures. In this paper, we present a hybrid network architecture for reliable and high-performance content-based publish/subscribe. Two overlay networks, a high-performance one with moderate fault tolerance and a highly-robust one with sufficient performance, work together to guarantee the performance of normal operations and reliability in the presence of failures. Our design exploits the fact that, in a high-performance content-based publish/subscribe system, subscriptions are broadcast to all brokers, to facilitate efficient backup routing when failures occur, which incurs a minimal overhead. Per-hop reliability is used to gracefully detect and recover lost messages that are caused by transit errors. Two backup routing methods based on DHT routing are proposed. Extensive simulation experiments are conducted. The results demonstrate the superior performance of our system compared to other state-of-the-art proposals. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Building a reliable and high-performance content-based publish/subscribe system", "paper_id": "WOS:000315614400001"}