{"auto_keywords": [{"score": 0.04335313856025993, "phrase": "conceptual_modeling_practice"}, {"score": 0.00481495049065317, "phrase": "conceptual_modeling."}, {"score": 0.004797303671967164, "phrase": "empirical_research"}, {"score": 0.004744748477093856, "phrase": "important_methodology"}, {"score": 0.004658426838467567, "phrase": "conceptual_modeling_practices"}, {"score": 0.0046073860169839305, "phrase": "recently_published_article"}, {"score": 0.004556901872357751, "phrase": "part-whole_relations"}, {"score": 0.004392576168969349, "phrase": "shanks"}, {"score": 0.004172360444377281, "phrase": "relatively_sophisticated_aspect"}, {"score": 0.003510439768484619, "phrase": "data_modeling_literature"}, {"score": 0.003086492169113408, "phrase": "viable_alternative"}, {"score": 0.003019121766552419, "phrase": "significant_conceptual_and_methodological_issues"}, {"score": 0.002825681384008326, "phrase": "requisite_methodological_procedures"}, {"score": 0.0023421547766273015, "phrase": "shanks_et_al"}, {"score": 0.0022081920438290193, "phrase": "future_endeavors"}, {"score": 0.0021441057555396013, "phrase": "appropriate_foundations"}, {"score": 0.0021049977753042253, "phrase": "conceptual_modeling"}], "paper_keywords": ["Conceptual modeling", " empirical research", " ontology", " information systems development", " composition", " UML", " entity-relationship model"], "paper_abstract": "Empirical research is an important methodology for the study of conceptual modeling practices. The recently published article \"Representing Part-Whole Relations in Conceptual Modeling: An Empirical Evaluation\" (Shanks et al. 2008) uses the lens of ontology to study a relatively sophisticated aspect of conceptual modeling practice, the representation of aggregation and composition. It contends that some analysts argue that a composite should be represented as a relationship while others argue that a composite should be represented as an entity. We find no evidence of such a dispute in the data modeling literature. We observe that composites are objects. By definition, all object-types should be represented as entities. Therefore, using the relationship construct to represent composites should not be seen as a viable alternative. Additionally, we found significant conceptual and methodological issues within the study that call its conclusions into question. As a way to offer insight into the requisite methodological procedures for research in this area, we conducted two experiments that both explicate and address the issues raised. Our results call into question the utility of using ontology as a foundation for conceptual modeling practice. Furthermore, they suggest a contrary but at least equally plausible explanation for the results reported by Shanks et al. In conducting this work we hope to encourage dialogue that will be beneficial for future endeavors aimed at identifying developing, and evaluating appropriate foundations for the discipline of conceptual modeling.", "paper_title": "A RESEARCH NOTE ON REPRESENTING PART-WHOLE RELATIONS IN CONCEPTUAL MODELING", "paper_id": "WOS:000307606300015"}