{"auto_keywords": [{"score": 0.036848735937290523, "phrase": "distributional_models"}, {"score": 0.015719716506582538, "phrase": "lexical_variation"}, {"score": 0.013422677863357003, "phrase": "distributional_semantics"}, {"score": 0.004760394308239882, "phrase": "language_varieties"}, {"score": 0.004522406417999492, "phrase": "different_language_varieties"}, {"score": 0.004223415145617665, "phrase": "different_meanings"}, {"score": 0.004035107125458193, "phrase": "ideal_framework"}, {"score": 0.0036622637391432143, "phrase": "belgian_dutch_and_netherlandic_dutch"}, {"score": 0.0036001255166809793, "phrase": "first_question"}, {"score": 0.0035390378585554547, "phrase": "classic_application"}, {"score": 0.003193606324727067, "phrase": "netherlandic_dutch"}, {"score": 0.00308610073274614, "phrase": "typically_belgian_words"}, {"score": 0.0024560114164181765, "phrase": "traditional_keyword_methods"}, {"score": 0.0023329572140896237, "phrase": "different_type"}, {"score": 0.0021413855297794946, "phrase": "variational_linguistics"}, {"score": 0.0021049977753042253, "phrase": "possible_future_applications"}], "paper_keywords": [""], "paper_abstract": "Languages are not uniform. Speakers of different language varieties use certain words differently - more or less frequently, or with different meanings. We argue that distributional semantics is the ideal framework for the investigation of such lexical variation. We address two research questions and present our analysis of the lexical variation between Belgian Dutch and Netherlandic Dutch. The first question involves a classic application of distributional models: the automatic retrieval of synonyms. We use corpora of two different language varieties to identify the Netherlandic Dutch synonyms for a set of typically Belgian words. Second, we address the problem of automatically identifying words that are typical of a given lect, either because of their high frequency or because of their divergent meaning. Overall, we show that distributional models are able to identify more lectal markers than traditional keyword methods. Distributional models also have a bias towards a different type of variation. In summary, our results demonstrate how distributional semantics can help research in variational linguistics, with possible future applications in lexicography or terminology extraction.", "paper_title": "The automatic identification of lexical variation between language varieties", "paper_id": "WOS:000283836700006"}