{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "basic_period_policy"}, {"score": 0.004630270043271386, "phrase": "multi-product_economic_lot_scheduling_problem"}, {"score": 0.004366387782457736, "phrase": "remanufacturing_operations"}, {"score": 0.0041579627441997, "phrase": "remanufactured_products"}, {"score": 0.003959502420751767, "phrase": "tang"}, {"score": 0.0037519679864796906, "phrase": "economic_lot_scheduling_problem"}, {"score": 0.0035902958977673313, "phrase": "complex_algorithm"}, {"score": 0.0035379628447303703, "phrase": "optimal_solution"}, {"score": 0.003385480888810982, "phrase": "kaparis"}, {"score": 0.0030101325901285537, "phrase": "common_cycle_policy"}, {"score": 0.0027026375053777543, "phrase": "common_cycle_time"}, {"score": 0.0021678232353129472, "phrase": "cost_savings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["ELSP", " Returns", " Remanufacturing"], "paper_abstract": "In this research we study the multi-product Economic Lot Scheduling Problem (ELSP) with manufacturing and remanufacturing opportunities. Manufacturing and remanufacturing operations are performed on the same production line. Both manufactured and remanufactured products have the same quality thus they fulfil the same demand stream. Tang and Teunter (2006) firstly studied this type of Economic Lot Scheduling Problem with Returns (ELSPR) and presented a complex algorithm for the optimal solution. More recently Teunter, Tang, and Kaparis (2009) proposed several heuristics to deal with the same problem using more computational efficient approaches. However, both studies have limited the attention to the common cycle policy with the assumption that a single (re)manufacturing lot is used for each item in each cycle. Relaxing the constraint of common cycle time and a single (re)manufacturing lot for each item in each cycle, we propose a simple, easy to implement algorithm, based on Segerstedt (1999), to solve the model using a basic period policy. Several numerical examples show the applicability of the algorithm and the cost savings. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-product economic lot scheduling problem with manufacturing and remanufacturing using a basic period policy", "paper_id": "WOS:000303092500018"}