{"auto_keywords": [{"score": 0.036025649252195896, "phrase": "small_phylogeny_problem"}, {"score": 0.034103767284835516, "phrase": "running_time"}, {"score": 0.00481495049065317, "phrase": "evolutionary_genome-wide_events"}, {"score": 0.004739915012924748, "phrase": "related_organisms"}, {"score": 0.00469545352928726, "phrase": "great_biological_interest"}, {"score": 0.0045789085863942825, "phrase": "genomic_basis"}, {"score": 0.0044792964927609456, "phrase": "whole_genomes"}, {"score": 0.004409468620826287, "phrase": "gene_families"}, {"score": 0.004327104321558231, "phrase": "duplication_and_loss_events"}, {"score": 0.004219663341808313, "phrase": "high_sequence_similarity"}, {"score": 0.004050708996795156, "phrase": "previous_methods"}, {"score": 0.003937704225837731, "phrase": "flanking_regions"}, {"score": 0.003640011825552854, "phrase": "ancestral_genomes"}, {"score": 0.0035384237846107793, "phrase": "sequenced_genomes"}, {"score": 0.003483211883149014, "phrase": "novel_branch-and-cut_algorithm"}, {"score": 0.0033859850551189938, "phrase": "evolutionary_model"}, {"score": 0.0031995714196263506, "phrase": "recently_proposed_method"}, {"score": 0.003149630099034765, "phrase": "six_vibrionaceae_lineages"}, {"score": 0.0030424776690194714, "phrase": "mere_improvement"}, {"score": 0.0028839835971201846, "phrase": "species_tree"}, {"score": 0.0026573612772397832, "phrase": "key_importance"}, {"score": 0.002599442416948628, "phrase": "ancestral_reconstruction"}, {"score": 0.002440805709023898, "phrase": "simulated_instances"}, {"score": 0.0023875955141436363, "phrase": "bacillus_genomes"}, {"score": 0.0022277818172421584, "phrase": "predicted_ancestral_genomes"}, {"score": 0.0021519235536763526, "phrase": "duplication-loss_model"}, {"score": 0.002139283350024658, "phrase": "np"}], "paper_keywords": [""], "paper_abstract": "The reconstruction of the history of evolutionary genome-wide events among a set of related organisms is of great biological interest since it can help to reveal the genomic basis of phenotypes. The sequencing of whole genomes faciliates the study of gene families that vary in size through duplication and loss events, like transfer RNA. However, a high sequence similarity often does not allow one to distinguish between orthologs and paralogs. Previous methods have addressed this difficulty by taking into account flanking regions of members of a family independently. We go one step further by inferring the order of genes of (a set of) families for ancestral genomes by considering the order of these genes on sequenced genomes. We present a novel branch-and-cut algorithm to solve the two species small phylogeny problem in the evolutionary model of duplications and losses. On average, our implementation, DupLoCut, improves the running time of a recently proposed method in the experiments on six Vibrionaceae lineages by a factor of approximate to 200. Besides the mere improvement in running time, the efficiency of our approach allows us to extend our model from cherries of a species tree, that is, subtrees with two leaves, to the median of three species setting. Being able to determine the median of three species is of key importance to one of the most common approaches to ancestral reconstruction, and our experiments show that its repeated computation considerably reduces the number of duplications and losses along the tree both on simulated instances comprising 128 leaves and a set of Bacillus genomes. Furthermore, in our simulations we show that a reduction in cost goes hand in hand with an improvement of the predicted ancestral genomes. Finally, we prove that the small phylogeny problem in the duplication-loss model is NP-complete already for two species.", "paper_title": "The Duplication-Loss Small Phylogeny Problem: From Cherries to Trees", "paper_id": "WOS:000323822000003"}