{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_security_policy"}, {"score": 0.04913171677961093, "phrase": "strategic_information_systems_plan"}, {"score": 0.004444921827311577, "phrase": "effective_deployment"}, {"score": 0.004386063799793622, "phrase": "information_systems"}, {"score": 0.004242291530697285, "phrase": "modem_business_enterprise"}, {"score": 0.0038385317554884713, "phrase": "new_systems"}, {"score": 0.003543273649210823, "phrase": "organisation's_strategic_goals"}, {"score": 0.003163326114997034, "phrase": "secure_manner"}, {"score": 0.002295964130868963, "phrase": "strategically_important_information_system_initiatives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["strategic information systems planning", " information security policy", " security breaches", " alignment", " information security management", " information security policy components"], "paper_abstract": "Two of the most important documents for ensuring the effective deployment of information systems and technologies within the modem business enterprise are the strategic information systems plan (SISP) and the information security policy. The strategic information systems plan ensures that new systems and technologies are deployed in a way that will support an Organisation's strategic goals whilst the information security policy provides a framework to ensure that systems are developed and operated in a secure manner. To date, the literature with regard to the formulation of the information security policy has tended to ignore its important relationship with the strategic information systems plan, and vice versa. In this paper we argue that these two important policy documents should be explicitly and carefully aligned to ensure that the outcomes of strategically important information system initiatives are not compromised by problems with their security. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Aligning the information security policy with the strategic information systems plan", "paper_id": "WOS:000235968100029"}