{"auto_keywords": [{"score": 0.04873991091315952, "phrase": "cervical_spine"}, {"score": 0.00481495049065317, "phrase": "thorax_segment"}, {"score": 0.0045332598718792515, "phrase": "intervertebral_movements"}, {"score": 0.004501326762615942, "phrase": "wu"}, {"score": 0.00378290546281883, "phrase": "present_time"}, {"score": 0.0034987163424726546, "phrase": "optimal_thorax_segment"}, {"score": 0.0031451673059794236, "phrase": "different_cervical_movements"}, {"score": 0.0028881548838751705, "phrase": "flexion-extension_movement"}, {"score": 0.0026146595609362715, "phrase": "thoracic_spinal_column"}, {"score": 0.00257775722777195, "phrase": "horizontal_plane"}, {"score": 0.0025504217985882725, "phrase": "sternal_marker"}, {"score": 0.0024526426124799085, "phrase": "optimal_triplet"}, {"score": 0.0024180213826477093, "phrase": "thorax_scs"}, {"score": 0.002276239029601328, "phrase": "th."}, {"score": 0.002204566591599102, "phrase": "orthonormal_scs"}, {"score": 0.0021427510493208864, "phrase": "anatomical_directions"}, {"score": 0.0021049977753042253, "phrase": "functional_axes"}], "paper_keywords": ["thorax segment coordinate system", " 3D kinematics", " cervical spine", " anatomical markers"], "paper_abstract": "The International Society of Biomechanics detailed the recommendations for 3D kinematics of intervertebral movements (Wu, et al. 2002. J Biomech. 35:543-548), but does not specify how to adapt this proposal to describe the kinematics of the cervical spine, between the head and the thorax. The analysis of the literature shows that no consensus exists at the present time on this subject. The objective of our study was to identify the reference points that formed the most rigid triplet allowing building an optimal thorax segment coordinate system (SCS). We thus measured the variations of distances between markers placed on various anatomical landmarks, and then the deformations of the combinations of three markers on different cervical movements of a sample of 10 asymptomatic subjects. The results show that the triplet formed by the sternum and both acromions undergoes less deformation on the flexion-extension movement. For all the other movements (lateral bending, axial rotation and complex movements), the triplet formed by sternum, T3 and TH (positioned on the thoracic spinal column, in a horizontal plane containing the sternal marker), undergoes less deformation. As a conclusion, the optimal triplet to define the thorax SCS for 3D kinematical analysis of the cervical spine is that formed by the markers: sternum, T3 and TH. This triplet makes it possible to define an orthonormal SCS, the axes of which coincide with anatomical directions, i.e. with the functional axes of the movement.", "paper_title": "Proposal of a thorax segment coordinate system for the 3D kinematical analysis of the cervical spine", "paper_id": "WOS:000299434500003"}