{"auto_keywords": [{"score": 0.040391456401351215, "phrase": "base_station"}, {"score": 0.010612387000973441, "phrase": "data_integrity"}, {"score": 0.010514349881698404, "phrase": "wireless_sensor_networks"}, {"score": 0.008772220048058551, "phrase": "transmission_overhead"}, {"score": 0.008334812762702004, "phrase": "aggregated_result"}, {"score": 0.00466016686289196, "phrase": "aggregation_schemes"}, {"score": 0.004595356579614969, "phrase": "privacy_homomorphism_encryption"}, {"score": 0.004385733482617193, "phrase": "data_aggregation_schemes"}, {"score": 0.004344965512058521, "phrase": "better_security"}, {"score": 0.00428451995524549, "phrase": "traditional_aggregation"}, {"score": 0.0042446888127531945, "phrase": "cluster_heads"}, {"score": 0.0035211747962710276, "phrase": "aggregation_functions"}, {"score": 0.003313592421224647, "phrase": "maximum_value"}, {"score": 0.002839812512030847, "phrase": "sensing_sample"}, {"score": 0.002550165781755603, "phrase": "even_these_data"}, {"score": 0.0023996890513009743, "phrase": "experiment_results"}, {"score": 0.0021049977753042253, "phrase": "homogeneous_and_heterogeneous_wireless_sensor_networks"}], "paper_keywords": ["Concealed data aggregation", " wireless sensor networks", " privacy homomorphism encryption"], "paper_abstract": "Recently, several data aggregation schemes based on privacy homomorphism encryption have been proposed and investigated on wireless sensor networks. These data aggregation schemes provide better security compared with traditional aggregation since cluster heads (aggregator) can directly aggregate the ciphertexts without decryption; consequently, transmission overhead is reduced. However, the base station only retrieves the aggregated result, not individual data, which causes two problems. First, the usage of aggregation functions is constrained. For example, the base station cannot retrieve the maximum value of all sensing data if the aggregated result is the summation of sensing data. Second, the base station cannot confirm data integrity and authenticity via attaching message digests or signatures to each sensing sample. In this paper, we attempt to overcome the above two drawbacks. In our design, the base station can recover all sensing data even these data has been aggregated. This property is called \"recoverable.\" Experiment results demonstrate that the transmission overhead is still reduced even if our approach is recoverable on sensing data. Furthermore, the design has been generalized and adopted on both homogeneous and heterogeneous wireless sensor networks.", "paper_title": "RCDA: Recoverable Concealed Data Aggregation for Data Integrity in Wireless Sensor Networks", "paper_id": "WOS:000300981100017"}