{"auto_keywords": [{"score": 0.0480861936518001, "phrase": "chirality"}, {"score": 0.00481495049065317, "phrase": "molecular_composition"}, {"score": 0.004464602028530629, "phrase": "corresponding_combinatorial_objects"}, {"score": 0.004401794742140806, "phrase": "unified_interpretation"}, {"score": 0.004339867166576126, "phrase": "fundamental_characteristics"}, {"score": 0.004299064805926241, "phrase": "organic_molecules"}, {"score": 0.00406214911915987, "phrase": "equivalence_classes"}, {"score": 0.00326840809777013, "phrase": "computer_memory"}, {"score": 0.0031619994642255846, "phrase": "algebraic_criterion"}, {"score": 0.002890266318361907, "phrase": "\"expanded\"_automorphism_groups"}, {"score": 0.00266693888510356, "phrase": "point_configuration"}, {"score": 0.0025678829712650437, "phrase": "chemical_structure"}, {"score": 0.0022492129111567824, "phrase": "molecular_formulas"}, {"score": 0.0022070310530794097, "phrase": "stereo_formulas"}, {"score": 0.0021049977753042253, "phrase": "combinatorial_objects"}], "paper_keywords": [""], "paper_abstract": "A unified interpretation of the fundamental characteristics of organic molecules (their composition, connectivity, and global configuration) as equivalence classes of mappings from one finite set into another is proposed. The main properties of three-, two-, and one-dimensional (3D, 2D, and 1D) point configurations are. discussed, as well as the methods of their representation in computer memory. For these configurations, an algebraic criterion of chirality is proposed; this criterion consists in the equality of the \"normal\" and the \"expanded\" automorphism groups. The equivalence classes of superpositions of two or three mappings (corresponding to composition, connectivity, or point configuration) are shown to unambiguously characterize the chemical Structure and three kinds of configurations, i.e., the labeled, graph. mid molecular configurations. The corresponding constructive enumeration problems - e.g., the generation of molecular formulas, structural formulas, and stereo formulas - are formalized in terms of a \"ladder of combinatorial objects,\"", "paper_title": "A Unified Approach to Characterization of Molecular Composition, Connectivity, and Configuration: Symmetry, Chirality, and Generation Problems for the Corresponding Combinatorial Objects", "paper_id": "WOS:000262121100008"}