{"auto_keywords": [{"score": 0.04764602699421295, "phrase": "explicit_computerized_protocols"}, {"score": 0.0067470844020435135, "phrase": "clinicians'_perceptions"}, {"score": 0.005182008293361471, "phrase": "total_variance"}, {"score": 0.00481495049065317, "phrase": "computerized_protocols"}, {"score": 0.0046390482426405324, "phrase": "evidence-based_techniques"}, {"score": 0.004502943680955863, "phrase": "limited_success"}, {"score": 0.0038798015183611275, "phrase": "cognitive_model"}, {"score": 0.0033054391731615618, "phrase": "nine_factors"}, {"score": 0.0029228387900175554, "phrase": "information_quality"}, {"score": 0.0027949428646076627, "phrase": "strongest_predictor"}, {"score": 0.0027741963344642567, "phrase": "beliefs"}, {"score": 0.0024529174827030787, "phrase": "critical_role"}, {"score": 0.0023807981747706376, "phrase": "routine_clinical_practice"}, {"score": 0.002363101338529545, "phrase": "behavioral_theories"}, {"score": 0.0023021895404322767, "phrase": "clinicians'_intention"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["computerized protocols", " clinician perceptions", " implementation", " clinical protocols [MeSH]", " decision making [MeSH]", " factor analysis [MeSH]"], "paper_abstract": "Purpose: Implementation of evidence-based techniques, such as explicit computerized protocols, has achieved limited success among clinicians. In this study, we describe the development and validation of an instrument for assessing clinicians' perceptions about use of explicit computerized protocols. Methods: Qualitative assessment of semi-structured interviews with clinicians gave rise to a cognitive model evaluating the factors that motivate clinicians to use explicit computerized protocols. Using these constructs we developed a 35-item instrument which was administered to 240 clinicians (132 nurses, 53 physicians and 55 respiratory therapists), in three health-care institutions. Results: Factor analysis identified nine factors that accounted for 66% of the total variance cumulatively. Factors identified were: Beliefs regarding Self-Efficacy, Environmental Support, Role Relevance, Work Importance, Beliefs regarding Control, Attitude towards Information Quality, Social Pressure, Culture, and Behavioral Intention. The strongest predictor was Beliefs regarding Self-Efficacy, which accounted for 26% of the total variance of intention to use explicit computerized protocols. Results supported the reliability and construct validity of the instrument. Conclusions: Clinicians' perceptions play a critical role in determining their intention to use explicit computerized protocols in routine clinical practice. Behavioral theories will help us understand factors predicting clinicians' intention to use explicit computerized protocols and recognize the implications of these factors in the design and implementation of these protocols. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Clinicians' perceptions about use of computerized protocols: A multicenter study", "paper_id": "WOS:000253700800005"}