{"auto_keywords": [{"score": 0.04843603269514023, "phrase": "citation_analysis"}, {"score": 0.04719401618022392, "phrase": "angewandte_chemie_international_edition"}, {"score": 0.0451349936761357, "phrase": "peer_review"}, {"score": 0.04252248047287167, "phrase": "\"best\"_scientific_work"}, {"score": 0.03020942633336309, "phrase": "reference_standards"}, {"score": 0.02576554420465121, "phrase": "chemical_research"}, {"score": 0.02480512207535274, "phrase": "accepted_communications"}, {"score": 0.00481495049065317, "phrase": "selecting_manuscripts"}, {"score": 0.00475924837336259, "phrase": "high-impact_journal"}, {"score": 0.004154908228936342, "phrase": "peer_review_system"}, {"score": 0.003981243132108877, "phrase": "journal_peer-review_process"}, {"score": 0.003800026771283179, "phrase": "prime_chemistry_journals"}, {"score": 0.0036842889387792635, "phrase": "communications"}, {"score": 0.003329994649432498, "phrase": "negative_binomial-regression_models"}, {"score": 0.0031906984691667246, "phrase": "ac-ie"}, {"score": 0.0031537270875516108, "phrase": "expected_number"}, {"score": 0.003045355729156972, "phrase": "average_citation"}, {"score": 0.0026892447164623247, "phrase": "thomson_reuters"}, {"score": 0.0025567271683947547, "phrase": "subject_areas"}, {"score": 0.002536926192232391, "phrase": "chemical_abstracts"}, {"score": 0.002440192402613492, "phrase": "mean_impact"}, {"score": 0.002356282242320051, "phrase": "average_riot"}, {"score": 0.002205560249972527, "phrase": "average_and_below-average_scientific_impact"}, {"score": 0.0021049977753042253, "phrase": "rejected_communications"}], "paper_keywords": [""], "paper_abstract": "All journals that use peer review have to deal with the following question: Does the peer review system fulfill its declared objective to select the \"best\" scientific work? We investigated the journal peer-review process at Angewandte Chemie International Edition (AC-IE), one of the prime chemistry journals worldwide, and conducted a citation analysis for Communications that were accepted by the journal (n = 878) or rejected but published elsewhere (n = 959). The results of negative binomial-regression models show that holding all other model variables constant, being accepted by AC-IE increases the expected number of citations by up to 50%. A comparison of average citation counts (with 95% confidence intervals) of accepted and rejected (but published elsewhere) Communications with international scientific reference standards was undertaken. As reference standards, (a) mean citation counts for the journal set provided by, Thomson Reuters corresponding to the field \"chemistry\" and (b) specific reference standards that refer to the subject areas of Chemical Abstracts were used. When compared to reference standards, the mean impact on chemical research is for the most part far above average riot only for accepted Communications but also for rejected (but published elsewhere) Communications. However, average and below-average scientific impact is to be expected significantly less frequently for accepted Communications than for rejected Communications. All in all, the results of this study confirm that peer review at AC-IE is able to. select the \"best\" scientific work with the highest impact on chemical research.", "paper_title": "Selecting manuscripts for a high-impact journal through peer review: A citation analysis of communications that were accepted by Angewandte Chemie International Edition, or rejected but published elsewhere", "paper_id": "WOS:000258582600013"}