{"auto_keywords": [{"score": 0.048000287634733727, "phrase": "social_networks"}, {"score": 0.03962261693999937, "phrase": "graph_randomness"}, {"score": 0.03521286949543274, "phrase": "overall_graph"}, {"score": 0.004831360439375975, "phrase": "spectrum"}, {"score": 0.00396530196547293, "phrase": "social_network"}, {"score": 0.0035684266744407485, "phrase": "nonrandomness_measures"}, {"score": 0.0032470094613727433, "phrase": "graph_nonrandomness"}, {"score": 0.0030715948036518603, "phrase": "adjacency_matrix"}, {"score": 0.0029380909574836587, "phrase": "upper_bound"}, {"score": 0.002857605453835429, "phrase": "nonrandomness_value"}, {"score": 0.0026740051685612957, "phrase": "laplacian"}, {"score": 0.002643753276264565, "phrase": "normal_spectra"}, {"score": 0.00251478366610296, "phrase": "nonrandomness_framework"}, {"score": 0.00230080652063411, "phrase": "consistent_framework"}, {"score": 0.002164331818029166, "phrase": "traditional_measures"}], "paper_keywords": ["Randomness measures", " graph spectra", " social networks"], "paper_abstract": "Social networks tend to contain some amount of randomness and some amount of nonrandomness. The amount of randomness versus nonrandomness affects the properties of a social network. In this paper, we theoretically analyze graph randomness and present a framework which provides a series of nonrandomness measures at levels of edge, node, subgraph, and the overall graph. We show that graph nonrandomness can be obtained mathematically from the spectra of the adjacency matrix of the network. We derive the upper bound and lower bound of nonrandomness value of the overall graph. We investigate whether other graph spectra (such as Laplacian and normal spectra) could also be used to derive a nonrandomness framework. Our theoretical results showed that they are unlikely, if not impossible, to have a consistent framework to evaluate randomness. We also compare our proposed nonrandomness measures with some traditional measures such as modularity. Our theoretical and empirical studies show our proposed nonrandomness measures can characterize and capture graph randomness.", "paper_title": "A Spectrum-Based Framework for Quantifying Randomness of Social Networks", "paper_id": "WOS:000295979600007"}