{"auto_keywords": [{"score": 0.03704842572745009, "phrase": "differential_equation"}, {"score": 0.015584241254267592, "phrase": "integral_equations"}, {"score": 0.010612387000973441, "phrase": "second-order_linear_differential_equations"}, {"score": 0.010543705235982487, "phrase": "liouville-neumann"}, {"score": 0.00988062688811722, "phrase": "quasi-factorization_technique"}, {"score": 0.009533707155391381, "phrase": "differential_equations"}, {"score": 0.009199554850673898, "phrase": "frobenius"}, {"score": 0.00469079145638866, "phrase": "factorization_method"}, {"score": 0.004645057834614705, "phrase": "ronveaux"}, {"score": 0.0040760539694352236, "phrase": "linear_differential_equation"}, {"score": 0.004036289523702633, "phrase": "theoretical_tool"}, {"score": 0.003768550679591666, "phrase": "liouville-neumann_algorithm"}, {"score": 0.003731774879299358, "phrase": "practical_tool"}, {"score": 0.0030769941082173314, "phrase": "new_liouville-neumann_algorithms"}, {"score": 0.0028915634293105014, "phrase": "convergence_properties"}, {"score": 0.0027984877593293786, "phrase": "special_functions"}, {"score": 0.0026470650216161577, "phrase": "function-parametric_family"}, {"score": 0.00259559608895677, "phrase": "special_choice"}, {"score": 0.0023222375006409675, "phrase": "also_a_relation"}, {"score": 0.0022995431219125536, "phrase": "liouville-neumann_expansion"}, {"score": 0.002225481283887324, "phrase": "liouville-neumann_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Factorization of differential equations", " Integral equations", " Liouville-Neumann expansions", " Approximation of special functions"], "paper_abstract": "Inspired by the factorization method used in Ronveaux (2003) [1], we introduce a quasi-factorization technique for second-order linear differential equations that brings together three rather diverse subjects of the field of differential equations: factorization of differential equations, Liouville-Neumann approximation, and the Frobenius theory. The factorization of a linear differential equation is a theoretical tool used to solve the equation exactly, although its range of applicability is quite reduced. On the other hand, the Liouville-Neumann algorithm is a practical tool that approximates a solution of the equation, it is based on a certain integral equation equivalent to the differential equation and its range of applicability is extraordinarily large. In this paper we combine both procedures. We use the ideas of the factorization to find families of integral equations equivalent to the differential equation. From those families of integral equations we propose new Liouville-Neumann algorithms that approximate the solutions of the equation. The method is valid for either regular or regular singular equations. We discuss the convergence properties of the algorithms and illustrate them with examples of special functions. These families of integral equations are parameterized by a certain regular function, so they constitute indeed a function-parametric family of integral equations. A special choice of that function corresponds with a factorization of the differential equation. In this respect, other choices of that function may be considered as quasi-factorizations of the differential equation. The quasi-factorization technique lets us find also a relation between the Liouville-Neumann expansion and the theory of Frobenius and shows that the Liouville-Neumann method may be viewed as a generalization of the theory of Frobenius. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Factorization of second-order linear differential equations and Liouville-Neumann expansions", "paper_id": "WOS:000314102400046"}