{"auto_keywords": [{"score": 0.03370007557524036, "phrase": "tl-mctag"}, {"score": 0.015719716506582538, "phrase": "tree-local_multi-component_tree-adjoining_grammar"}, {"score": 0.004586531354697466, "phrase": "natural_language_representation"}, {"score": 0.004434745755769205, "phrase": "appropriate_domain"}, {"score": 0.004271953920234395, "phrase": "lexical_items"}, {"score": 0.003934456513187142, "phrase": "base_formalism"}, {"score": 0.003890540531028228, "phrase": "synchronous_grammar"}, {"score": 0.0037336520904376687, "phrase": "divergent_structure"}, {"score": 0.003556345965454902, "phrase": "single_language"}, {"score": 0.003299813878412728, "phrase": "additional_popularity"}, {"score": 0.0030847901993222592, "phrase": "tag"}, {"score": 0.0028514344213899177, "phrase": "thorough_examination"}, {"score": 0.0027985291920293127, "phrase": "tl-mctag_recognition"}, {"score": 0.0027569106820061707, "phrase": "even_highly_restricted_forms"}, {"score": 0.0027164632146112764, "phrase": "np"}, {"score": 0.0025965187247488876, "phrase": "provable_difficulty"}, {"score": 0.002567498166608835, "phrase": "recognition_problem"}, {"score": 0.002482363351755741, "phrase": "processing_efficiency"}, {"score": 0.002418099158357658, "phrase": "parsing_algorithm"}, {"score": 0.002373214852820709, "phrase": "baseline_parsing_method"}, {"score": 0.002337906603857861, "phrase": "polynomial_time"}, {"score": 0.0022434880661725493, "phrase": "input_grammar"}, {"score": 0.0021049977753042253, "phrase": "strongly_equivalent_tl-mctag_grammar"}], "paper_keywords": [""], "paper_abstract": "Tree-Local Multi-Component Tree-Adjoining Grammar (TL-MCTAG) is an appealing formalism for natural language representation because it arguably allows the encapsulation of the appropriate domain of locality within its elementary structures. Its multicomponent structure allows modeling of lexical items that may ultimately have elements far apart in a sentence, such as quantifiers and wh-words. When used as the base formalism for a synchronous grammar, its flexibility allows it to express both the close relationships and the divergent structure necessary to capture the links between the syntax and semantics of a single language or the syntax of two different languages. Its limited expressivity provides constraints on movement and, we posit, may have generated additional popularity based on a misconception about its parsing complexity. Although TL-MCTAG was shown to be equivalent in expressivity to TAG when it was first introduced, the complexity of TL-MCTAG is still not well understood. This article offers a thorough examination of the problem of TL-MCTAG recognition, showing that even highly restricted forms of TL-MCTAG are NP-complete to recognize. However, in spite of the provable difficulty of the recognition problem, we offer several algorithms that can substantially improve processing efficiency. First, we present a parsing algorithm that improves on the baseline parsing method and runs in polynomial time when both the fan-out and rank of the input grammar are bounded. Second, we offer an optimal, efficient algorithm for factorizing a grammar to produce a strongly equivalent TL-MCTAG grammar with the rank of the grammar minimized.", "paper_title": "Complexity, Parsing, and Factorization of Tree-Local Multi-Component Tree-Adjoining Grammar", "paper_id": "WOS:000281744900006"}