{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "awareness_support"}, {"score": 0.03404205465110336, "phrase": "design_elements"}, {"score": 0.004775726266706856, "phrase": "collaborative_applications"}, {"score": 0.004640929126263433, "phrase": "valuable_feature"}, {"score": 0.0045843245695654875, "phrase": "collaborative_system"}, {"score": 0.00357146811369898, "phrase": "considered_kinds"}, {"score": 0.003428164458163043, "phrase": "significant_number"}, {"score": 0.0031714880645482496, "phrase": "awareness_types"}, {"score": 0.0030944828434567966, "phrase": "application_designer"}, {"score": 0.0027030963394733916, "phrase": "six_awareness_types"}, {"score": 0.002626645763725465, "phrase": "collaborative_systems"}, {"score": 0.002256973121326987, "phrase": "obtained_results"}, {"score": 0.0021751997984619585, "phrase": "helpful_hints"}, {"score": 0.0021049977753042253, "phrase": "application's_awareness_support"}], "paper_keywords": ["Awareness", " Formative evaluation", " Collaborative applications", " Software quality"], "paper_abstract": "Awareness to users is a valuable feature of a collaborative system. Therefore, the designers of a system of this type may find it useful to receive hints on the awareness support provided by the system when it is under development or evolution. This paper proposes a tool for their use to obtain suggestions on the awareness features provided by the system and those not currently supported by it. The considered kinds of awareness were obtained from a review of a significant number of proposals from the literature. The tool is based on a checklist of design elements related to these awareness types to be applied by the application designer. The construction of this checklist was done as follows. The process started with an analysis of the types of awareness to be provided. This step ended with 54 selected design elements and six awareness types. Experts on the development of collaborative systems used their experience to provide correlations between the design elements and the types of awareness previously identified, thus encapsulating their expertise within the checklist. The proposal was applied to three existing collaborative systems and the results are presented. The obtained results suggest that the checklist is adequate to provide helpful hints that may be used to improve an application's awareness support. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Reviewing the quality of awareness support in collaborative applications", "paper_id": "WOS:000331432600012"}