{"auto_keywords": [{"score": 0.04198166773648888, "phrase": "ict"}, {"score": 0.0129286381343115, "phrase": "medical_errors"}, {"score": 0.009303459660013886, "phrase": "conventional_standardization"}, {"score": 0.00896882498358465, "phrase": "intro-organizational_communication"}, {"score": 0.00481495049065317, "phrase": "-organizational_communication"}, {"score": 0.004782848614014638, "phrase": "healthcare_-_considerations"}, {"score": 0.0047192824773697, "phrase": "ict_application"}, {"score": 0.004533585346030341, "phrase": "synchronous_interruptive_communication"}, {"score": 0.004458375125223899, "phrase": "primary_source"}, {"score": 0.004240116703465252, "phrase": "communication_technology"}, {"score": 0.004019024264498125, "phrase": "communication_failures"}, {"score": 0.0037461743696712833, "phrase": "interpersonal_healthcare_communication"}, {"score": 0.0035507457285983268, "phrase": "diverse_scientific_disciplines"}, {"score": 0.003480108299476168, "phrase": "interpersonal_communication"}, {"score": 0.0031579462920888132, "phrase": "healthcare_communication"}, {"score": 0.003043679504527297, "phrase": "\"information_space"}, {"score": 0.002973120121800634, "phrase": "communication_space"}, {"score": 0.002855934865505357, "phrase": "semantic_gaps"}, {"score": 0.0024725918236048632, "phrase": "intra-organizational_communication"}, {"score": 0.0024152394732063908, "phrase": "multi-dimensional_approach"}, {"score": 0.002191438157029621, "phrase": "social_context"}, {"score": 0.00216950156199795, "phrase": "standard_information_processing_skills"}, {"score": 0.0021049977753042253, "phrase": "care_practices'_performance"}], "paper_keywords": ["interpersonal communication", " interoperability", " standardization", " patient safety", " ICT", " healthcare communication"], "paper_abstract": "Objectives: Intro-organizational communication is mostly interpersonal. Synchronous interruptive communication is recognized as a primary source of inefficiency and error in healthcare, and there is much potential for information and communication technology (ICT) to improve such communication. As recently suggested, however, due to communication failures ICT can also compound medical errors. In this paper we analyze factors that restrict the role of ICT in improving interpersonal healthcare communication and suggest solutions. Methods: We critically analyzed the literature from a selection of diverse scientific disciplines. These were related to interpersonal communication, to the role and place of standardization and computerization in its improvement, and to reducing medical errors. Results: Four possible scenarios were defined on how ICT can serve healthcare communication. Two differing conceptual frameworks about communication in healthcare were discussed. Considering \"information space\" as a part of \"communication space\" allows the recognition and control of the source of the semantic gaps in conventional standardization and on enhancement of the role of ICT in improving intro-organizational communication. Moreover, cognitive, social, and organizational dimensions of complexity in interpersonal communication can be managed. Three approaches to control the variability in those dimensions and to promote the role of ICT in intra-organizational communication were discussed. Conclusion: A multi-dimensional approach is required to promote the role of ICT in intro-organizational communication in healthcare. Parallel to conventional standardization, at least three dimensions need to be addressed: controlling the effect of the social context, developing standard information processing skills, and most importantly, controlling variations in care practices' performance.", "paper_title": "Intra-organizational communication in healthcare - Considerations for standardization and ICT application", "paper_id": "WOS:000258751400007"}