{"auto_keywords": [{"score": 0.043692086897500614, "phrase": "consensus_model"}, {"score": 0.0047468516620285525, "phrase": "large_chemical_library"}, {"score": 0.004389089062127892, "phrase": "cardiovascular_disease"}, {"score": 0.004326987090971404, "phrase": "chronic_inflammation"}, {"score": 0.0038884040003536904, "phrase": "svm"}, {"score": 0.00332375606483146, "phrase": "putative_negatives"}, {"score": 0.003029382820031577, "phrase": "thousand_currency_sign"}, {"score": 0.002881793492919646, "phrase": "estimated_false_positive_rate"}, {"score": 0.0028006988338192375, "phrase": "nine_novel_potential_inhibitors"}, {"score": 0.0025892330566358503, "phrase": "structural_features"}, {"score": 0.0022933216359142736, "phrase": "current_model"}], "paper_keywords": ["Drug discovery", " Machine learning", " Consensus model", " Virtual screening", " Phosphoinositide 3 kinases", " PI3K inhibitors"], "paper_abstract": "Phosphoinositide 3-kinases (PI3Ks) inhibitors have treatment potential for cancer, diabetes, cardiovascular disease, chronic inflammation and asthma. A consensus model consisting of three base classifiers (AODE, kNN, and SVM) trained with 1,283 positive compounds (PI3K inhibitors), 16 negative compounds (PI3K non-inhibitors) and 64,078 generated putative negatives was developed for predicting compounds with PI3K inhibitory activity of IC50 a parts per thousand currency sign 10 mu M. The consensus model has an estimated false positive rate of 0.75%. Nine novel potential inhibitors were identified using the consensus model and several of these contain structural features that are consistent with those found to be important for PI3K inhibitory activities. An advantage of the current model is that it does not require knowledge of 3D structural information of the various PI3K isoforms, which is not readily available for all isoforms.", "paper_title": "Consensus model for identification of novel PI3K inhibitors in large chemical library", "paper_id": "WOS:000275651700004"}