{"auto_keywords": [{"score": 0.030030612454007954, "phrase": "stable_coalitions"}, {"score": 0.015719716506582538, "phrase": "cooperative_boolean_games"}, {"score": 0.004586531354697466, "phrase": "coalitional_games"}, {"score": 0.004263972370406983, "phrase": "dunne_et_al"}, {"score": 0.003964007795174772, "phrase": "autonomous_agents"}, {"score": 0.0035616743422949766, "phrase": "core_showing"}, {"score": 0.00303319936111073, "phrase": "dependence_networks"}, {"score": 0.003003809128328864, "phrase": "abstract_dependence_networks"}, {"score": 0.0029747028229638625, "phrase": "refined_dependence_networks"}, {"score": 0.0025085435314540837, "phrase": "whole_game"}, {"score": 0.002424450174817922, "phrase": "search_space"}, {"score": 0.002125633390561792, "phrase": "prolog"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Coalition formation", " dependence networks", " stable sets", " core"], "paper_abstract": "Cooperative boolean games (CBG) are a family of coalitional games where agents may depend on each other for the satisfaction of their personal goals. In Dunne et al. (2008, Cooperative Boolean games. In Proceedings of the 7th International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS 2008), 1015-1022), the authors define as solution concept the notion of core showing that several decision problems, such as core-emptiness, are Pi(p)(2)-complete. In this work, we investigate how to improve the computation of the core. In particular, we introduce two different types of dependence networks, abstract dependence networks and refined dependence networks, that are used to define the notion of stable coalitions and delta-reduction, respectively. Stable coalitions enable to focus on a subset of the agents and use results to determinate the core of the whole game. delta-reduction prunes the search space by returning a set of actions that are not admissible to be executed. We present an algorithm based on stable coalitions and a delta-reduction implemented in Prolog and experimental results that show how they effectively improve the computation of the core.", "paper_title": "Dependency in Cooperative Boolean Games", "paper_id": "WOS:000316964800007"}