{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "layered_database_applications"}, {"score": 0.010500883140927127, "phrase": "vertical_integration_process"}, {"score": 0.004734853555630616, "phrase": "vertical_integration"}, {"score": 0.004597861947580946, "phrase": "single-core_performance"}, {"score": 0.00403709306806495, "phrase": "available_single-core_performance"}, {"score": 0.003138030910104256, "phrase": "different_layers"}, {"score": 0.0027548146060608902, "phrase": "data_access_code"}, {"score": 0.0024800509241747013, "phrase": "operational_workflow"}, {"score": 0.002459288755782293, "phrase": "experimental_evaluation"}, {"score": 0.0022232633360792222, "phrase": "available_hardware_resources"}, {"score": 0.0021770116505684394, "phrase": "greatly_improved_performance"}, {"score": 0.002122775261369663, "phrase": "significant_reduction"}, {"score": 0.0021049977753042253, "phrase": "energy_consumption"}], "paper_keywords": ["Performance", " Database applications", " vertical integration", " program transformation", " intermediate representation", " software overhead", " instruction reduction", " optimization"], "paper_abstract": "In the last decade, improvements on single-core performance of CPUs has stagnated. Consequently, methods for the development and optimization of software for these platforms have to be reconsidered. Software must be optimized such that the available single-core performance is exploited more effectively. This can be achieved by reducing the number of instructions that need to be executed. In this article, we show that layered database applications execute many redundant, nonessential, instructions that can be eliminated without affecting the course of execution and the output of the application. This elimination is performed using a vertical integration process which breaks down the different layers of layered database applications. By doing so, applications are being reduced to their essence, and as a consequence, transformations can be carried out that affect both the application code and the data access code which were not possible before. We show that this vertical integration process can be fully automated and, as such, be integrated in an operational workflow. Experimental evaluation of this approach shows that up to 95% of the instructions can be eliminated. The reduction of instructions leads to a more efficient use of the available hardware resources. This results in greatly improved performance of the application and a significant reduction in energy consumption.", "paper_title": "Reducing Layered Database Applications to their Essence through Vertical Integration", "paper_id": "WOS:000363567400004"}