{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "density-based_clustering"}, {"score": 0.034187791948032994, "phrase": "different_densities"}, {"score": 0.004622662375029505, "phrase": "widely_used_unsupervised_data_mining_technique"}, {"score": 0.00403026082093352, "phrase": "different_clusters"}, {"score": 0.003840598580753804, "phrase": "connected_dense_component"}, {"score": 0.0036734281414482735, "phrase": "basic_structure"}, {"score": 0.0036059320136308808, "phrase": "common_drawbacks"}, {"score": 0.003335683866508191, "phrase": "starting_object"}, {"score": 0.0032622464094096463, "phrase": "adjacent_clusters"}, {"score": 0.0029732094730218488, "phrase": "space_stratification"}, {"score": 0.0027810502577708105, "phrase": "original_space"}, {"score": 0.00267969955652659, "phrase": "original_data"}, {"score": 0.00241509422805775, "phrase": "input_parameters"}, {"score": 0.0023270490574896804, "phrase": "suitable_way"}, {"score": 0.002309828105129336, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Density based clustering", " Outlier detection", " Spatial dataset", " Stratification", " High dimensional embedding"], "paper_abstract": "Clustering is a widely used unsupervised data mining technique. It allows to identify structures in collections of objects by grouping them into classes, named clusters, in such a way that similarity of objects within any cluster is maximized and similarity of objects belonging to different clusters is minimized. In density-based clustering, a cluster is defined as a connected dense component and grows in the direction driven by the density. The basic structure of density-based clustering presents some common drawbacks: (i) parameters have to be set; (ii) the behavior of the algorithm is sensitive to the density of the starting object; and (iii) adjacent clusters of different densities could not be properly identified. In this paper, we address all the above problems. Our method, based on the concept of space stratification, efficiently identifies the different densities in the dataset and, accordingly, ranks the objects of the original space. Next, it exploits such a knowledge by projecting the original data into a space with one more dimension. It performs a density based clustering taking into account the reverse-nearest-neighbor of the objects. Our method also reduces the number of input parameters by giving a guideline to set them in a suitable way. Experimental results indicate that our algorithm is able to deal with clusters of different densities and outperforms the most popular algorithms DBSCAN and OPTICS in all the standard benchmark datasets. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancing density-based clustering: Parameter reduction and outlier detection", "paper_id": "WOS:000314331000004"}