{"auto_keywords": [{"score": 0.03893070572133374, "phrase": "goal_models"}, {"score": 0.02854015982860145, "phrase": "analysis_results"}, {"score": 0.023940524425641294, "phrase": "decision_making"}, {"score": 0.00481495049065317, "phrase": "goal-oriented_satisfaction_analysis_techniques"}, {"score": 0.00443308765153716, "phrase": "system_requirements"}, {"score": 0.004261268957001927, "phrase": "system_failures"}, {"score": 0.004185377431624781, "phrase": "wrong_requirements"}, {"score": 0.003965684670332574, "phrase": "system_analysis"}, {"score": 0.0038119123317396954, "phrase": "goal_satisfaction"}, {"score": 0.0036247638406450735, "phrase": "functional_or_design_alternatives"}, {"score": 0.003459191419478298, "phrase": "goal-oriented_requirements_models"}, {"score": 0.003230665474330377, "phrase": "different_choices"}, {"score": 0.0031730701021262155, "phrase": "goal_model_syntax"}, {"score": 0.003105305189036267, "phrase": "conflicting_or_partial_evidence"}, {"score": 0.002942138511829811, "phrase": "seven_similar_goal_satisfaction_analysis_procedures"}, {"score": 0.002708399936381754, "phrase": "procedural_design_choices"}, {"score": 0.0025938977569302177, "phrase": "different_recommendations"}, {"score": 0.0025021765811679446, "phrase": "different_satisfaction_analysis_techniques"}, {"score": 0.002448704249007665, "phrase": "variable_results"}, {"score": 0.002362105010110277, "phrase": "comparison_findings"}, {"score": 0.0022950308685133224, "phrase": "satisfaction_analysis_techniques"}, {"score": 0.002174346780014853, "phrase": "satisfaction_analysis"}, {"score": 0.0021278653331014614, "phrase": "model_quality"}, {"score": 0.0021049977753042253, "phrase": "domain_knowledge"}], "paper_keywords": ["Goal-oriented requirements engineering", " Requirements modeling", " Model analysis"], "paper_abstract": "Goal-oriented requirements engineering (GORE) has been introduced as a means of modeling and understanding the motivations for system requirements. Using models to make goals explicit helps to avoid system failures due to implementing the wrong requirements or ignoring certain stakeholder needs. These models are unique when compared to other models used in system analysis in that their structure naturally lends itself to an analysis of goal satisfaction. Existing work claims that analysis using goal models can facilitate decision making over functional or design alternatives, using criteria in the model. Many different approaches to the analysis of goal-oriented requirements models have been proposed, including several procedures that analyze the satisfaction or denial of goals. These procedures make different choices in their interpretation of the goal model syntax, the methods to resolve conflicting or partial evidence, and in the way they represent satisfaction. This work uses three available tools implementing seven similar goal satisfaction analysis procedures to analyze three sample goal models. Results are reported and compared. The purpose of this comparison is to understand the ways in which procedural design choices affect analysis results, and how differences in analysis results could lead to different recommendations over alternatives in the model. Our comparison shows that different satisfaction analysis techniques for goal models can produce variable results, depending on the structure of the model. Comparison findings lead us to recommend the use of satisfaction analysis techniques for goal models as only heuristics for decision making. Our results emphasize investigation into the benefits of satisfaction analysis beyond decision making, namely improving model quality, increasing domain knowledge, and facilitating communication.", "paper_title": "Comparison and evaluation of goal-oriented satisfaction analysis techniques", "paper_id": "WOS:000323260300001"}