{"auto_keywords": [{"score": 0.03163100284594392, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "context-aware_learning_activities"}, {"score": 0.004757227624616643, "phrase": "natural_science_courses"}, {"score": 0.0038284549148537373, "phrase": "effective_strategies"}, {"score": 0.0036700484729006136, "phrase": "context-aware_learning_environments"}, {"score": 0.0035181731203867456, "phrase": "progressive_prompt-based_context-aware_learning_approach"}, {"score": 0.003174903873774882, "phrase": "natural_science_course"}, {"score": 0.003117890043128058, "phrase": "elementary_school"}, {"score": 0.00291743479583421, "phrase": "experimental_results"}, {"score": 0.0027133856739937133, "phrase": "learning_achievement"}, {"score": 0.0025853238923610076, "phrase": "conventional_context-aware_learning_system"}, {"score": 0.0021565293818406554, "phrase": "contextual_information"}, {"score": 0.0021049977753042253, "phrase": "learning_content"}], "paper_keywords": ["ubiquitous and mobile computing systems and tools", " empirical studies in ubiquitous and mobile learning", " ubiquitous computing", " tablet computers", " location based services"], "paper_abstract": "Owing to the popularity of mobile, wireless communication and sensing technologies, issues related to contextual mobile learning have widely been discussed in recent years. In the meantime, researchers have indicated the importance of developing effective strategies for guiding students to learn in context-aware learning environments. In this study, a progressive prompt-based context-aware learning approach is proposed to improve the learning performance of students. An experiment was conducted on a natural science course of an elementary school to evaluate the performance of the proposed approach. From the experimental results, it is found that the proposed approach could effectively enhance the learning achievement of the students in comparison with the conventional context-aware learning system with single-stage prompts. It is also interesting to find that the proposed approach, by providing more challenging tasks, encouraged the students to put more effort into examining the contextual information and interpreting the learning content.", "paper_title": "A Progressive Prompting Approach to Conducting Context-Aware Learning Activities for Natural Science Courses", "paper_id": "WOS:000337059800005"}