{"auto_keywords": [{"score": 0.03606832220914119, "phrase": "z_axis"}, {"score": 0.010612387000973441, "phrase": "haptic_devices"}, {"score": 0.007662562816446813, "phrase": "x_axis"}, {"score": 0.004787874367741664, "phrase": "vibration_feedback"}, {"score": 0.004667894913438327, "phrase": "human_and_haptic_interfaces"}, {"score": 0.00456376131573829, "phrase": "wider_variety"}, {"score": 0.0042650339037168675, "phrase": "excitatory_direction"}, {"score": 0.004205293427426673, "phrase": "design_factor"}, {"score": 0.004008340263071222, "phrase": "first_experiment"}, {"score": 0.0037037769661437563, "phrase": "absolute_thresholds"}, {"score": 0.0036725447588682823, "phrase": "vibration_perception"}, {"score": 0.003550218173441985, "phrase": "ten_participants'_estimated_absolute_thresholds"}, {"score": 0.003189006695330464, "phrase": "second_experiment"}, {"score": 0.0021169341153215535, "phrase": "distinguishable_vibration"}], "paper_keywords": ["Vibration", " Haptics", " Excitatory direction", " Emotion", " Absolute threshold"], "paper_abstract": "Vibration feedback is one of the most popular ways to communicate between human and haptic interfaces nowadays. In order to deliver a wider variety of information accurately and efficiently, significant design factors of the vibration need to be investigated and applied to haptic devices. In this study, the excitatory direction was examined as a design factor of the vibration in terms of sensitivity and emotion. We conducted two experiments. In the first experiment, the sensitivities of three excitatory directions-X (lateral), Y (fore-and-aft) and Z (vertical) axes were estimated by the absolute thresholds of the vibration perception with two frequency levels (150 and 280 Hz). Based on ten participants' estimated absolute thresholds, we conclude that the vibration with X axis is less sensitive than Z axis at the frequency of 150 Hz, while the vibration with Y axis is less sensitive than Z axis at the frequency of 280 Hz. In the second experiment, the agreeability of 29 emotional expressions to the vibrations was measured by a 7-point scale with a total of 12 conditions (2 frequencies x 2 amplitudes (i.e., 50 x 10(-3) and 500 x 10(-3) g) x 3 excitatory directions). Based on 20 participants' responses, it is concluded that at the frequency of 150 Hz and the amplitude of 50 x 10(-3) g, the vibration is perceived as 'light', and as even 'lighter' if the vibration is with Y axis rather than with Z axis. Likewise, at the frequency of 150 Hz and the amplitude of 500 x 10(-3) g, the vibration is perceived as 'repulsive', and as even 'more repulsive' if the vibration is with Y or Z axis rather than with X axis. Therefore, three excitatory directions can be selectively utilized to design the distinguishable vibration by its sensitivity and emotion.", "paper_title": "Vibration perception and excitatory direction for haptic devices", "paper_id": "WOS:000286115600003"}