{"auto_keywords": [{"score": 0.0439602210203305, "phrase": "mobile_advertising"}, {"score": 0.015719716506582538, "phrase": "mobile_message_advertisements"}, {"score": 0.011717728819329165, "phrase": "independent_variable"}, {"score": 0.009943021757045126, "phrase": "high_volume"}, {"score": 0.009612105607093973, "phrase": "low_volume"}, {"score": 0.007920112320077484, "phrase": "advertisement_recall"}, {"score": 0.0046993598473345395, "phrase": "mobile_telecommunication"}, {"score": 0.004631335513513859, "phrase": "breakthrough_advances"}, {"score": 0.00443308765153716, "phrase": "mobile_telecommunications"}, {"score": 0.004263972370406983, "phrase": "internet_advertising_market"}, {"score": 0.0034760655218366, "phrase": "watermark_transparency"}, {"score": 0.003215659239270654, "phrase": "music_format"}, {"score": 0.0031845067058084583, "phrase": "five_levels"}, {"score": 0.0026986685585382347, "phrase": "watermarks_transparency"}, {"score": 0.002331781764406665, "phrase": "mobile_advertisements"}, {"score": 0.002297949552105756, "phrase": "vocal_music_version"}, {"score": 0.002125612498781805, "phrase": "instrumental_music"}, {"score": 0.0021049977753042253, "phrase": "mobile_device_users"}], "paper_keywords": ["transparent user interface", " mobile advertisements", " watermark", " advertisement music"], "paper_abstract": "The development of mobile telecommunication has made breakthrough advances in recent years. Compared to the Internet, mobile telecommunications has anywhere, anytime and always online characteristics. As growth in the Internet advertising market continues, mobile advertising has attracted attention. In this research, the effectiveness of two types of mobile message advertisements, watermarks and music are studied and compared. Two experiments were carried out to test four proposed hypotheses. The independent variable in experiment I was the watermark transparency (20%, 40% and 60%). The independent variable in experiment 2 was the music format with five levels: no music, vocal and instrumental version at high volume, vocal and instrumental version at low volume, instrumental version at high volume and instrumental version at low volume. The results showed that the watermarks transparency and format were effective in mobile advertising. The 60% watermark was found better than the 20% and 40% watermarks. The 40% watermark was found better than the 20% watermark for advertisement recall only. Music and vocal/instrumental music versions were effective in mobile advertisements. The vocal music version was found effective in mobile advertising. Music with both vocal and instrumental versions was more effective in advertisement recall than instrumental music for mobile device users. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of watermark and music on mobile message advertisements", "paper_id": "WOS:000239224700009"}