{"auto_keywords": [{"score": 0.04870300013732668, "phrase": "edge_costs"}, {"score": 0.015420339390084655, "phrase": "undirected_graph_g"}, {"score": 0.004608879242346434, "phrase": "specified_set"}, {"score": 0.0034760655218366, "phrase": "desired_size"}, {"score": 0.0033271045779740683, "phrase": "small_additive_term"}, {"score": 0.00303319936111073, "phrase": "previous_approximation_algorithm"}, {"score": 0.002751751956416832, "phrase": "integer_k"}, {"score": 0.002242647404307089, "phrase": "total_edge_cost"}, {"score": 0.002135995282374723, "phrase": "h._we"}], "paper_keywords": ["2-connected graphs", " Approximation", " k-MST", " Prize-collecting trees", " Density"], "paper_abstract": "Given an undirected graph G with edge costs and a specified set of terminals, let the density of any subgraph be the ratio of its cost to the number of terminals it contains. If G is 2-connected, does it contain smaller 2-connected subgraphs of density comparable to that of G? We answer this question in the affirmative by giving an algorithm to pruneG and find such subgraphs of any desired size, incurring only a logarithmic factor increase in density (plus a small additive term). We apply our pruning techniques to give algorithms for two NP-Hard problems on finding large 2-vertex-connected subgraphs of low cost; no previous approximation algorithm was known for either problem. In the k-2VC problem, we are given an undirected graph G with edge costs and an integer k; the goal is to find a minimum-cost 2-vertex-connected subgraph of G containing at least k vertices. In the Budget-2VC problem, we are given a graph G with edge costs, and a budget B; the goal is to find a 2-vertex-connected subgraph H of G with total edge cost at most B that maximizes the number of vertices in H. We describe an O(log nlog k) approximation for the k-2VC problem, and a bicriteria approximation for the Budget-2VC problem that gives an O (1/epsilon log(2)n) approximation, while violating the budget by a factor of at most 2+epsilon.", "paper_title": "Pruning 2-Connected Graphs", "paper_id": "WOS:000298388200019"}