{"auto_keywords": [{"score": 0.029858716207579766, "phrase": "synchronous_self-citations"}, {"score": 0.00481495049065317, "phrase": "research_articles"}, {"score": 0.004568617813032014, "phrase": "abnormally_high_rates"}, {"score": 0.00436530211426514, "phrase": "author_self-citations"}, {"score": 0.004200319352919505, "phrase": "high_levels"}, {"score": 0.004141877689172017, "phrase": "ecology_articles"}, {"score": 0.003929843413153981, "phrase": "reference_lists"}, {"score": 0.003741712498615481, "phrase": "web_of_science_online_database"}, {"score": 0.0031733603553977877, "phrase": "akaike's_information_criterion"}, {"score": 0.0028664985822266344, "phrase": "best_predictor"}, {"score": 0.002562123444678208, "phrase": "diachronous_self-citations"}, {"score": 0.002363474907331799, "phrase": "impact_factor"}, {"score": 0.0023469450817019, "phrase": "ecology_journals"}], "paper_keywords": ["Bibliometrics", " Citation models", " Diachronous self-citations", " Journal impact factor", " Self-reference", " Synchronous self-citations"], "paper_abstract": "Ecologists writing research articles frequently cite their own papers. Self-citations are frequent in science, but the reasons behind abnormally high rates of self-citations are questionable. My goals were to assess the prevalence of author self-citations and to identify the combination of attributes that best predict high levels of self-citations in ecology articles. I searched 643 articles from 9 different ecology journals of various impact factors for synchronous (i.e., within reference lists) and diachronous (i.e., following publication) self-citations, using the Web of Science online database. I assessed the effect of the number of authors, pages, and references/citations, the proportion of diachronous/synchronous self-citations, and the impact factor, on the proportion of synchronous and diachronous self-citations separately. I compared various candidate models made of these covariates using Akaike's Information Criterion. On average, ecologists made 6.0 synchronous self-citations (12.8% of references), and 2.5 diachronous self-citations (25.5% of citations received 2.8 to 4.5 years after publication) per article. The best predictor of the proportion of synchronous self-citations was the number of authors. My study is the first to report recidivism in the inclusion of self-citations by researchers, i.e., the proportion of diachronous self-citations was best explained by the proportion of synchronous self-citations. The proportion of self-citations also increased with the number of pages and the impact factor of ecology journals, and decreased with the number of references/citations. Although a lot of variance remained unexplained, my study successfully showed regularities in the propensity of ecologists to include self-citations in their research articles.", "paper_title": "Author self-citations in the field of ecology", "paper_id": "WOS:000303533600019"}