{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hypergraph_partitioning"}, {"score": 0.004664352260912174, "phrase": "promising_method"}, {"score": 0.004518442937844318, "phrase": "high-dimensional_clustering"}, {"score": 0.003936910716320182, "phrase": "edge_cut"}, {"score": 0.0036942726653704213, "phrase": "clustering_performance"}, {"score": 0.0034849681064606543, "phrase": "systematic_understanding"}, {"score": 0.0034482025128821548, "phrase": "desired_characteristics"}, {"score": 0.0031176485976102688, "phrase": "unified_clique_perspective"}, {"score": 0.0026447893350441502, "phrase": "clique_hyperedges"}, {"score": 0.0024423826953133844, "phrase": "extensive_evaluation"}, {"score": 0.002416589459425828, "phrase": "real-world_document_datasets"}, {"score": 0.0021049977753042253, "phrase": "fine_tuning"}], "paper_keywords": ["Clique", " Shared nearest neighbor", " Hypergraph partitioning", " High-dimensional clustering"], "paper_abstract": "Hypergraph partitioning has been considered as a promising method to address the challenges of high-dimensional clustering. With objects modeled as vertices and the relationship among objects captured by the hyperedges, the goal of graph partitioning is to minimize the edge cut. Therefore, the definition of hyperedges is vital to the clustering performance. While several definitions of hyperedges have been proposed, a systematic understanding of desired characteristics of hyperedges is still missing. To that end, in this paper, we first provide a unified clique perspective of the definition of hyperedges, which serves as a guide to define hyperedges. With this perspective, based on the concepts of shared (reverse) nearest neighbors, we propose two new types of clique hyperedges and analyze their properties regarding purity and size issues. Finally, we present an extensive evaluation using real-world document datasets. The experimental results show that, with shared (reverse) nearest neighbor-based hyperedges, the clustering performance can be improved significantly in terms of various external validation measures without the need for fine tuning of parameters.", "paper_title": "High-dimensional clustering: a clique-based hypergraph partitioning framework", "paper_id": "WOS:000333156900003"}