{"auto_keywords": [{"score": 0.0494111831348322, "phrase": "cloud_computing"}, {"score": 0.015589188592772307, "phrase": "mobile_users"}, {"score": 0.014994028227256114, "phrase": "mobile_networks"}, {"score": 0.007596410318513114, "phrase": "seamless_mobility_management"}, {"score": 0.006658620689329117, "phrase": "packet_loss"}, {"score": 0.004694700982410345, "phrase": "future_cloud_computing"}, {"score": 0.0046161999598320486, "phrase": "mobile_devices"}, {"score": 0.004450568197899267, "phrase": "seamless_services"}, {"score": 0.00413684709497912, "phrase": "real-time_services"}, {"score": 0.004102103162925209, "phrase": "voip"}, {"score": 0.004044822781630218, "phrase": "interactive_game_playing"}, {"score": 0.0038668462001710314, "phrase": "fast_handovers"}, {"score": 0.0036966717141736355, "phrase": "long_handover_latency"}, {"score": 0.0036042491702884052, "phrase": "seamless_handover"}, {"score": 0.0035639149949775856, "phrase": "handover_latency"}, {"score": 0.0033311827561285194, "phrase": "predictive_mode"}, {"score": 0.003303177222901723, "phrase": "reactive_mode"}, {"score": 0.0031845067058084583, "phrase": "different_network_environments"}, {"score": 0.003140004304719746, "phrase": "previous_works"}, {"score": 0.0030787405733989615, "phrase": "predictive_mode_failure"}, {"score": 0.002861441830192181, "phrase": "overall_performance"}, {"score": 0.002600194073758015, "phrase": "mobile_nodes"}, {"score": 0.0025137856138000014, "phrase": "system_parameters"}, {"score": 0.0024786330057813204, "phrase": "ppmf"}, {"score": 0.0024302416436559867, "phrase": "additional_layer"}, {"score": 0.0023296961971785357, "phrase": "signaling_cost"}, {"score": 0.0023100907305651872, "phrase": "packet_delivery_cost"}, {"score": 0.002297111954768114, "phrase": "analytical_results"}], "paper_keywords": ["Cloud computing", " Mobility protocol", " FMIPv6", " Performance analysis", " Probability of predictive mode failure"], "paper_abstract": "In the future cloud computing, users will heavily use mobile devices. Mobile networks for cloud computing should be managed efficiently as well as support seamless services to mobile users regardless of their locations and movements. Hence, in mobile networks for cloud computing, it is important to support seamless mobility management to mobile users who request real-time services such as VoIP, streaming, and interactive game playing. To support seamless mobility management for various wireless technologies in cloud computing, Mobile IPv6 (MIPv6) and fast handovers for MIPv6 (FMIPv6) have been studied. FMIPv6 has been emerged to reduce long handover latency and packet loss in MIPv6. FMIPv6 may provide seamless handover by minimizing the handover latency, and prevent packet loss through buffering and tunneling. FMIPv6 uses anticipation based on layer 2 trigger information, and consists of two operation modes such as the predictive mode and the reactive mode. Several works have been done to evaluate the performance of FMIPv6 in different network environments. However, the previous works did not consider the probability of predictive mode failure (PPMF) that distinguishes two operation modes. Even in the most previous work, two operation modes of FMIPv6 are evaluated separately. However, to accurately analyze the overall performance of FMIPv6, two operation modes should be analyzed altogether. In this paper, FMIPv6 combining two operation modes is analyzed considering the PPMF that is affected by the radius of a cell, velocity of mobile nodes, and the layer 2 triggering time. The effect of system parameters, such as the PPMF, the time required to process additional layer 3 signaling, and the layer 2 trigger time, is analytically investigated with respect to the signaling cost and the packet delivery cost. Analytical results show a trade-off between performance and system parameters. Then we show methods to optimize overhead of FMIPv6. Finally, mobile networks for cloud computing can be efficiently managed through the optimized FMIPv6.", "paper_title": "Optimized fast handover scheme in Mobile IPv6 networks to support mobile users for cloud computing", "paper_id": "WOS:000298297000005"}