{"auto_keywords": [{"score": 0.047155778350020515, "phrase": "turing-style_tests"}, {"score": 0.02185666387775369, "phrase": "computational_creativity"}, {"score": 0.015719716506582538, "phrase": "turing_test"}, {"score": 0.0047747348769918, "phrase": "purpose_-_the_purpose"}, {"score": 0.004281372589330329, "phrase": "stumbling_block"}, {"score": 0.0042455945330942746, "phrase": "artificial_intelligence"}, {"score": 0.0040882422992520925, "phrase": "\"grand_goal"}, {"score": 0.003619672388007568, "phrase": "burgeoning_ai"}, {"score": 0.0035296217979800463, "phrase": "fundamental_questions"}, {"score": 0.003138030910104256, "phrase": "intricate_and_possibly_unsolvable_problems"}, {"score": 0.0030216031606457214, "phrase": "old_and_new_blind_alleys"}, {"score": 0.002909482525367989, "phrase": "alternative_testing_procedure"}, {"score": 0.0028015105858516702, "phrase": "new_procedure"}, {"score": 0.0023879771786116228, "phrase": "new_avenue"}, {"score": 0.002367983991444061, "phrase": "viable_and_more_meaningful_testing_procedures"}, {"score": 0.0023187286045879643, "phrase": "novel_contributions"}, {"score": 0.0022609695885550058, "phrase": "seven_lessons"}, {"score": 0.0021049977753042253, "phrase": "new_testing_procedure"}], "paper_keywords": ["Creativity", " Artificial intelligence", " Turing test"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the relevance and the appropriateness of Turing-style tests for computational creativity. Design/methodology/approach - The Turing test is both a milestone and a stumbling block in artificial intelligence (Al). For more than half a century, the \"grand goal of passing the test\" has taught the authors many lessons. Here, the authors analyze the relevance of these lessons for computational creativity. Findings - Like the burgeoning AI, computational creativity concerns itself with fundamental questions such as \"Can machines be creative?\" It is indeed possible to frame such questions as empirical, Turing-style tests. However, such tests entail a number of intricate and possibly unsolvable problems, which might easily lead the authors into old and new blind alleys. The authors propose an outline of an alternative testing procedure that is fundamentally different from Turing-style tests. This new procedure focuses on the unfolding of creativity over time, and unlike Turing-style tests it is amenable to a more meaningful statistical testing. Research limitations/implications - This paper argues against Turing-style tests for computational creativity. Practical implications - This paper opens a new avenue for viable and more meaningful testing procedures. Originality/value - The novel contributions are: an analysis of seven lessons from the Turing test for computational creativity; an argumentation against Turing-style tests; and a proposal of a new testing procedure.", "paper_title": "Computing machinery and creativity: lessons learned from the Turing test", "paper_id": "WOS:000330599400006"}