{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "google_scholar"}, {"score": 0.004724365740062236, "phrase": "-_the_complexity"}, {"score": 0.004657542074154025, "phrase": "one's_publications"}, {"score": 0.004441517985511521, "phrase": "personal_profile_pages"}, {"score": 0.00388828234270598, "phrase": "erroneous_ones"}, {"score": 0.003569451476205552, "phrase": "forgotten_co-authors"}, {"score": 0.0032456625605347417, "phrase": "web_page_interface"}, {"score": 0.0031244995579170465, "phrase": "google_scholar's_profile_pages"}, {"score": 0.003007846011394511, "phrase": "single_page"}, {"score": 0.0027348611289528583, "phrase": "different_pages"}, {"score": 0.002326304140277375, "phrase": "decision_problem"}, {"score": 0.0021876052225599306, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational complexity", " NP-completeness", " Reduction", " 3-partition", " Google Scholar"], "paper_abstract": "With Google Scholar, scientists can maintain their publications on personal profile pages, while the citations to these works are automatically collected and counted. Maintenance of publications is done manually by the researcher herself, and involves deleting erroneous ones, merging ones that are the same but which were not recognized as the same, adding forgotten co-authors, and correcting titles of papers and venues. The publications are presented on pages with 20 or 100 papers in the web page interface from 2012-2014. (Since mid 2014, Google Scholar's profile pages allow any number of papers on a single page.) The interface does not allow a scientist to merge two versions of a paper if they appear on different pages. This not only implies that a scientist who wants to merge certain subsets of publications will sometimes be unable to do so, but also, we show in this note that the decision problem to determine if it is possible to merge given subsets of papers is NP-complete. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Google Scholar makes it hard - the complexity of organizing one's publications", "paper_id": "WOS:000361402400011"}