{"auto_keywords": [{"score": 0.04032089419637603, "phrase": "sava"}, {"score": 0.00481495049065317, "phrase": "next_generation_internet"}, {"score": 0.004758053266234474, "phrase": "source_address_validation_architecture"}, {"score": 0.0046739596755881185, "phrase": "ip_packet_forwarding"}, {"score": 0.004618720776729413, "phrase": "current_internet"}, {"score": 0.004404188306112211, "phrase": "forwarding_process"}, {"score": 0.004326321719714357, "phrase": "source_ip_address"}, {"score": 0.003910278811774747, "phrase": "\"source_address_validation_architecture"}, {"score": 0.0034304883989739804, "phrase": "authenticated_source"}, {"score": 0.0033299015941662302, "phrase": "design_goals"}, {"score": 0.0027034948760997564, "phrase": "local_subnet"}], "paper_keywords": ["IP source address validation", " network architecture", " network security"], "paper_abstract": "The IP packet forwarding of current Internet is mainly destination based. In the forwarding process, the source IP address is not checked in most cases. This causes serious security, management and accounting problems. Based on the drastically increased IPv6 address space, a \"source address validation architecture\" (SAVA) is proposed in this paper, which can guarantee that every packet received and forwarded holds an authenticated source IP address. The design goals of the architecture are lightweight, loose coupling, \"multi-fence support\" and incremental deployment. This paper discusses the design and implementation for the architecture, including inter-AS, intra-AS and local subnet. The performance and scalability of SAVA are described. This architecture is deployed into the CNGI-CERNET2 infrastructure-a large-scale native IPv6 backbone network of the China Next Generation Internet project. We believe that the SAVA will help the transition to a new, more secure and dependable Internet.", "paper_title": "Building a next generation Internet with source address validation architecture", "paper_id": "WOS:000260122000004"}