{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "inter-cluster_nonidentical_inputs"}, {"score": 0.03878676535760206, "phrase": "intra-cluster_synchronization"}, {"score": 0.015184637104034818, "phrase": "cluster_consensus"}, {"score": 0.012288368011015101, "phrase": "different_clusters"}, {"score": 0.00481495049065317, "phrase": "discrete-time_networks"}, {"score": 0.004616859702338596, "phrase": "multiagent_systems"}, {"score": 0.004457995891964028, "phrase": "general_graph_topologies"}, {"score": 0.00355009076716969, "phrase": "spanning_trees"}, {"score": 0.0035006643351909246, "phrase": "infinite_stochastic_matrix_product"}, {"score": 0.0034640450599342488, "phrase": "hajnal_inequality"}, {"score": 0.0031291625125786293, "phrase": "static_linear_system"}, {"score": 0.0030532878377173885, "phrase": "time-varying_coupling_cases"}, {"score": 0.002896819408461957, "phrase": "union_graph"}, {"score": 0.0028664985822266344, "phrase": "t-length_time_interval"}, {"score": 0.0027005626126039204, "phrase": "time-varying_linear_system"}, {"score": 0.002607464886544904, "phrase": "common_inter-cluster_influence"}, {"score": 0.0025175684590726796, "phrase": "inter-cluster_separation"}, {"score": 0.002371783323468861, "phrase": "different_inputs"}, {"score": 0.002298044430178591, "phrase": "infinite_sum"}, {"score": 0.002149799391146313, "phrase": "modified_non-bayesian_social_learning_model"}], "paper_keywords": ["Cluster consensus", " cooperative control", " linear system", " multiagent system", " non-Bayesian social learning"], "paper_abstract": "In this paper, cluster consensus of multiagent systems is studied via inter-cluster nonidentical inputs. Here, we consider general graph topologies, which might be time-varying. The cluster consensus is defined by two aspects: intracluster cluster synchronization, the state at which differences between each pair of agents in the same cluster converge to zero, and inter-cluster separation, the state at which agents in different clusters are separated. For intra-cluster synchronization, the concepts and theories of consensus, including the spanning trees, scramblingness, infinite stochastic matrix product, and Hajnal inequality, are extended. As a result, it is proved that if the graph has cluster spanning trees and all vertices self-linked, then the static linear system can realize intra-cluster synchronization. For the time-varying coupling cases, it is proved that if there exists T > 0 such that the union graph across any T-length time interval has cluster spanning trees and all graphs has all vertices self-linked, then the time-varying linear system can also realize intra-cluster synchronization. Under the assumption of common inter-cluster influence, a sort of inter-cluster nonidentical inputs are utilized to realize inter-cluster separation, such that each agent in the same cluster receives the same inputs and agents in different clusters have different inputs. In addition, the boundedness of the infinite sum of the inputs can guarantee the boundedness of the trajectory. As an application, we employ a modified non-Bayesian social learning model to illustrate the effectiveness of our results.", "paper_title": "Cluster Consensus in Discrete-Time Networks of Multiagents With Inter-Cluster Nonidentical Inputs", "paper_id": "WOS:000315517400006"}