{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "terminological_conventions"}, {"score": 0.04788992596085788, "phrase": "information_retrieval"}, {"score": 0.004740476936977635, "phrase": "searcher-indexer_coordination_game"}, {"score": 0.0046429592670444945, "phrase": "traditional_model"}, {"score": 0.004453874101119545, "phrase": "query_and_index_terms"}, {"score": 0.004317109072311102, "phrase": "term_choices"}, {"score": 0.004184526032558792, "phrase": "matching_process"}, {"score": 0.0040771431404398855, "phrase": "main_challenges"}, {"score": 0.004034962424068988, "phrase": "information_science"}, {"score": 0.0031270239691197515, "phrase": "feedback_data"}, {"score": 0.0029224275921964724, "phrase": "evolutionary_force"}, {"score": 0.002759769970554556, "phrase": "helpful_convergence"}, {"score": 0.0027311809666295565, "phrase": "searchers'_and_indexers'_term_usage"}, {"score": 0.002579140290642792, "phrase": "term_usage"}, {"score": 0.0021049977753042253, "phrase": "relevant_and_nonrelevant_information_items"}], "paper_keywords": [""], "paper_abstract": "In the traditional model of information retrieval, searchers and indexers choose query and index terms, respectively, and these term choices are ultimately compared in a matching process. One of the main challenges in information science and information retrieval is that searchers and indexers often do not choose the same term even though the item is relevant to the need whereas at other times they do choose the same term even though it is not relevant. But if both searchers and indexers have the opportunity to review feedback data showing the success or failure of their previous term choices, then there exists an evolutionary force that, all else being equal, will lead to helpful convergence in searchers' and indexers' term usage when the information is relevant, and helpful divergence of term usage when it is not. Based on learning theory, and new theory presented here, it is possible to predict which terms will emerge as the terminological conventions that are used by groups of searchers and the indexers of relevant and nonrelevant information items.", "paper_title": "Emergence of Terminological Conventions as a Searcher-Indexer Coordination Game", "paper_id": "WOS:000272257800011"}