{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent"}, {"score": 0.0046491050101721545, "phrase": "multi-agent_systems_interactions"}, {"score": 0.004534136929881113, "phrase": "multi-agent_systems"}, {"score": 0.004466519142879166, "phrase": "complex_task"}, {"score": 0.004205940624913343, "phrase": "different_nodes"}, {"score": 0.0038431888954930083, "phrase": "autonomous_entities"}, {"score": 0.0037480753312398754, "phrase": "possible_behaviours"}, {"score": 0.003459191419478298, "phrase": "new_interaction_patterns"}, {"score": 0.00327356326590461, "phrase": "system_execution"}, {"score": 0.0026384167183586015, "phrase": "data_mining_tools"}, {"score": 0.0025989960809479104, "phrase": "aclanalyser"}, {"score": 0.0024717881264735477, "phrase": "large_scale_multi-agent_systems"}, {"score": 0.002327310963701377, "phrase": "agent_development_toolset"}, {"score": 0.0022022878843247257, "phrase": "multi-agent_system_models"}, {"score": 0.0021049977753042253, "phrase": "programming_level"}], "paper_keywords": [""], "paper_abstract": "Testing interactions in multi-agent systems is a complex task because of several reasons. Agents are distributed and can move through different nodes in a network, so their interactions can occur concurrently and from many different sites. Also, agents are autonomous entities with a variety of possible behaviours, which can evolve. during their lives by adapting to changes in the environment and new interaction patterns. Furthermore, the number of agents can vary during system execution, from a few dozens to thousands or more. Therefore, the number of interactions can be huge and it is difficult to follow up their occurrence and relationships. In order to solve these issues we propose the use of a set of data mining tools, the ACLAnalyser, which processes the results of the execution of large scale multi-agent systems in a monitored environment. This has been integrated with an agent development toolset, the INGENIAS Development Kit, in order to facilitate the verification of multi-agent system models at the design level rather than at the programming level.", "paper_title": "Intelligent data analysis for the verification of multi-agent systems interactions", "paper_id": "WOS:000241790900143"}