{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "open_processes"}, {"score": 0.0046993598473345395, "phrase": "general_methodology"}, {"score": 0.004564291332315995, "phrase": "open_systems"}, {"score": 0.00386876598761639, "phrase": "operational_semantics"}, {"score": 0.0037030390595465673, "phrase": "symbolic_transition_system"}, {"score": 0.003459191419478298, "phrase": "potential_interaction"}, {"score": 0.00312310128226407, "phrase": "universal_closures"}, {"score": 0.0027383842769094354, "phrase": "dynamic_instantiation"}, {"score": 0.0024481856932959227, "phrase": "correct_approximations"}, {"score": 0.0023546121947302877, "phrase": "closed_components"}, {"score": 0.002320449502337321, "phrase": "process_calculi"}, {"score": 0.002297949552105756, "phrase": "suitable_formats"}, {"score": 0.002231747358665628, "phrase": "symbolic_semantics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["open systems", " symbolic bisimulation", " unification"], "paper_abstract": "We propose a general methodology for analysing the behaviour of open systems modelled as coordinators, i.e., open terms of suitable process calculi. A coordinator is understood as a process with holes or placeholders where other coordinators and components (i.e., closed terms) can be plugged in, thus influencing its behaviour. The operational semantics of coordinators is given by means of a symbolic transition system, where states are coordinators and transitions are labeled by spatial/modal formulae expressing the potential interaction that plugged components may enable. Behavioural equivalences for coordinators, like strong and weak bisimilarities, can be straightforwardly defined over such a transition system. Different from other approaches based on universal closures, i.e., where two coordinators are considered equivalent when all their closed instances are equivalent, our semantics preserves the openness of the system during its evolution, thus allowing dynamic instantiation to be accounted for in the semantics. To further support the adequacy of the construction, we show that our symbolic equivalences provide correct approximations of their universally closed counterparts, coinciding with them over closed components. For process calculi in suitable formats, we show how tractable symbolic semantics can be defined constructively using unification. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A semantic framework for open processes", "paper_id": "WOS:000251629200004"}