{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bitcoin_protocol"}, {"score": 0.03949589730935723, "phrase": "double_spending"}, {"score": 0.004681525814235883, "phrase": "popular_digital_currency"}, {"score": 0.00462919213721188, "phrase": "online_payments"}, {"score": 0.004500891637057374, "phrase": "decentralized_peer"}, {"score": 0.004400804926266097, "phrase": "peer_electronic_cash_system"}, {"score": 0.00435160900518983, "phrase": "bitcoin"}, {"score": 0.00397714507836836, "phrase": "correct_ledger"}, {"score": 0.003845154818609644, "phrase": "trusted_third_party"}, {"score": 0.0033405704229694656, "phrase": "important_threat"}, {"score": 0.003303177222901723, "phrase": "electronic_payment_systems"}, {"score": 0.002651960559564796, "phrase": "computational_power"}, {"score": 0.0024370965602952496, "phrase": "uppaal_model"}, {"score": 0.0021049977753042253, "phrase": "probability_double_spending"}], "paper_keywords": [""], "paper_abstract": "Bitcoin is a popular digital currency for online payments, realized as a decentralized peer-to-peer electronic cash system. Bitcoin keeps a ledger of all transactions; the majority of the participants decides on the correct ledger. Since there is no trusted third party to guard against double spending, and inspired by its popularity, we would like to investigate the correctness of the Bitcoin protocol. Double spending is an important threat to electronic payment systems. Double spending would happen if one user could force a majority to believe that a ledger without his previous payment is the correct one. We are interested in the probability of success of such a double spending attack, which is linked to the computational power of the attacker. This paper examines the Bitcoin protocol and provides its formalization as an UPPAAL model. The model will be used to show how double spending can be done if the parties in the Bitcoin protocol behave maliciously, and with what probability double spending occurs.", "paper_title": "Modeling and Verification of the Bitcoin Protocol", "paper_id": "WOS:000367347400006"}