{"auto_keywords": [{"score": 0.024623612667278978, "phrase": "proposed_algorithms"}, {"score": 0.00481495049065317, "phrase": "cluster_representatives"}, {"score": 0.004681971826924847, "phrase": "k-modes_type_clustering"}, {"score": 0.004595356579614969, "phrase": "leading_partitional_clustering_technique"}, {"score": 0.003994624397219346, "phrase": "attribute_value"}, {"score": 0.0038661089070527424, "phrase": "attribute_domain"}, {"score": 0.0037242701420971062, "phrase": "real_applications"}, {"score": 0.003329117824699891, "phrase": "data_analysis"}, {"score": 0.0031182092708983184, "phrase": "appropriate_weights"}, {"score": 0.002989714021608139, "phrase": "modified_algorithms"}, {"score": 0.0025741370320813968, "phrase": "original_k-modes_type_algorithms"}, {"score": 0.002479579797152119, "phrase": "weighted_cluster_prototypes"}, {"score": 0.0023996890513009743, "phrase": "existing_algorithms"}, {"score": 0.0023442013458139497, "phrase": "updating_formulas"}, {"score": 0.0022058510091498666, "phrase": "experimental_studies"}, {"score": 0.0021049977753042253, "phrase": "large_categorical_datasets"}], "paper_keywords": ["Clustering", " K-modes type clustering algorithms", " categorical data", " weighted cluster prototype", " convergence"], "paper_abstract": "As a leading partitional clustering technique, k-modes is one of the most computationally efficient clustering methods for categorical data. In the k-modes, a cluster is represented by a \"mode,\" which is composed of the attribute value that occurs most frequently in each attribute domain of the cluster, whereas, in real applications, using only one attribute value in each attribute to represent a cluster may not be adequate as it could in turn affect the accuracy of data analysis. To get rid of this deficiency, several modified clustering algorithms were developed by assigning appropriate weights to several attribute values in each attribute. Although these modified algorithms are quite effective, their convergence proofs are lacking. In this paper, we analyze their convergence property and prove that they cannot guarantee to converge under their optimization frameworks unless they degrade to the original k-modes type algorithms. Furthermore, we propose two different modified algorithms with weighted cluster prototypes to overcome the shortcomings of these existing algorithms. We rigorously derive updating formulas for the proposed algorithms and prove the convergence of the proposed algorithms. The experimental studies show that the proposed algorithms are effective and efficient for large categorical datasets.", "paper_title": "The Impact of Cluster Representatives on the Convergence of the K-Modes Type Clustering", "paper_id": "WOS:000317857900018"}