{"auto_keywords": [{"score": 0.029041275294292766, "phrase": "startup_condition"}, {"score": 0.0034988876789164235, "phrase": "third_structure"}, {"score": 0.003459191419478298, "phrase": "additional_two_oscillator_circuits"}, {"score": 0.0031037644581516973, "phrase": "grounded_capacitors"}, {"score": 0.002999274091205852, "phrase": "parasitic_components"}, {"score": 0.0028653893877383188, "phrase": "buffered_output_voltage"}, {"score": 0.0028328599839713866, "phrase": "orthogonal_tuning"}, {"score": 0.002527150892127982, "phrase": "barkhausen_criterion"}, {"score": 0.002414290278501595, "phrase": "oscillation_and_the_frequency_of_oscillation_yields_inaccurate_results"}, {"score": 0.0023064582783867645, "phrase": "selected_component_values"}, {"score": 0.0021413855297794946, "phrase": "characteristic_equation"}, {"score": 0.0021049977753042253, "phrase": "specific_oscillator_structure"}], "paper_keywords": ["Current feedback operational amplifier", " Sinusoidal oscilators", " Barkhausen criterion"], "paper_abstract": "Using a unified representation for a class of the two current-feedback operational amplifier (CFOA) sinusoidal oscillators, new circuits of this type can be systematically discovered. A catalogue of two circuit structures, each structure realizing 18 oscillator circuits, is presented. Moreover, using the RC:CR transformation, additional 18 oscillator circuits can be obtained from each structure. A third structure realizing additional two oscillator circuits is also presented. Some of the circuits enjoy one or more of the following attractive features: use of grounded capacitors, feasibility of absorbing the parasitic components of the CFOAs, availability of a buffered output voltage and orthogonal tuning of the frequency and the startup condition of oscillation. Moreover, it is shown that the use of the Barkhausen criterion for the determination of the startup condition of oscillation and the frequency of oscillation yields inaccurate results with relatively large errors depending on the selected component values. Furthermore, it is shown that using the roots of the characteristic equation of a specific oscillator structure will result in a startup condition that cannot be adjusted without disturbing the frequency of oscillation.", "paper_title": "Identification of a class of two CFOA-based sinusoidal RC oscillators", "paper_id": "WOS:000284640800010"}