{"auto_keywords": [{"score": 0.027372914001224515, "phrase": "owiki"}, {"score": 0.00481495049065317, "phrase": "wiki_content"}, {"score": 0.004695183699894267, "phrase": "planetary_success"}, {"score": 0.004648303332396172, "phrase": "wikipedia"}, {"score": 0.004442032546224076, "phrase": "shared_resources"}, {"score": 0.003452218803245602, "phrase": "other's_contributions"}, {"score": 0.0033156708990372047, "phrase": "key_aspects"}, {"score": 0.0030895394261534776, "phrase": "semantic_wiki_data"}, {"score": 0.002952356518921907, "phrase": "friendly_authoring_environments"}, {"score": 0.002723301730223192, "phrase": "semantic_wiki_content"}, {"score": 0.002682370021834353, "phrase": "ontology-driven_forms"}, {"score": 0.0024493494346360415, "phrase": "gaffe"}, {"score": 0.0023642842046859274, "phrase": "metadata_editors"}, {"score": 0.002214048743052355, "phrase": "particular_attention"}, {"score": 0.0021049977753042253, "phrase": "community_shared_knowledge"}], "paper_keywords": ["Ontologies", " OWL", " Model-View-Controller", " OWiki", " Interfaces"], "paper_abstract": "The planetary success of Wikipedia has opened the road to using wikis as shared resources for communities to collect and organize facts, concepts, and structures that constitute both the shared knowledge of the community and, more often than not, the very reason for the community to exist. The ease of creating, editing, and debating one's own and each other's contributions to the wiki knowledge-based are key aspects of the success and livelihood of the community itself. The need for semantic wiki data cannot be separated from the need of friendly authoring environments for those data. This paper introduces a framework that allows users to easily create semantic wiki content by exploiting ontology-driven forms and templates. The system, called OWiki, is an instantiation of a more general model, named GAFFE, that exploits ontologies to generate metadata editors. Both GAFFE and OWiki are presented in this paper, with particular attention to the way they exploit ontologies to model the community shared knowledge, the interfaces used to create that knowledge, and the way it evolves.", "paper_title": "Ontology-driven generation of wiki content and interfaces", "paper_id": "WOS:000283880200003"}