{"auto_keywords": [{"score": 0.04595629913789722, "phrase": "tw-k-means"}, {"score": 0.014706229748331655, "phrase": "multiview_data"}, {"score": 0.010718678979392156, "phrase": "variable_weights"}, {"score": 0.009332742460190523, "phrase": "view_weights"}, {"score": 0.0048150080555924265, "phrase": "tw"}, {"score": 0.003987126862293129, "phrase": "individual_variables"}, {"score": 0.0038636556112977226, "phrase": "view_weight"}, {"score": 0.003611751858608048, "phrase": "variable_weight"}, {"score": 0.003198860258228543, "phrase": "distance_function"}, {"score": 0.003058179790439378, "phrase": "new_algorithm"}, {"score": 0.002910545717767559, "phrase": "clustering_process"}, {"score": 0.0024641814990854463, "phrase": "individual_variable_weighting_method"}, {"score": 0.002387758958649797, "phrase": "convergence_property"}, {"score": 0.002292965705677312, "phrase": "tw-k-"}, {"score": 0.002262209824105154, "phrase": "five_clustering_algorithms"}, {"score": 0.00216263228969761, "phrase": "tw-k-means_algorithm"}], "paper_keywords": ["Data mining", " clustering", " multiview learning", " k-means", " variable weighting"], "paper_abstract": "This paper proposes TW-k-means, an automated two-level variable weighting clustering algorithm for multiview data, which can simultaneously compute weights for views and individual variables. In this algorithm, a view weight is assigned to each view to identify the compactness of the view and a variable weight is also assigned to each variable in the view to identify the importance of the variable. Both view weights and variable weights are used in the distance function to determine the clusters of objects. In the new algorithm, two additional steps are added to the iterative k-means clustering process to automatically compute the view weights and the variable weights. We used two real-life data sets to investigate the properties of two types of weights in TW-k-means and investigated the difference between the weights of TW-k-means and the weights of the individual variable weighting method. The experiments have revealed the convergence property of the view weights in TW-k-means. We compared TW-k-means with five clustering algorithms on three real-life data sets and the results have shown that the TW-k-means algorithm significantly outperformed the other five clustering algorithms in four evaluation indices.", "paper_title": "TW-k-Means: Automated Two-Level Variable Weighting Clustering Algorithm for Multiview Data", "paper_id": "WOS:000315519500016"}