{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_clustering_algorithm"}, {"score": 0.015560954417193747, "phrase": "image_segmentation"}, {"score": 0.01302504879561638, "phrase": "cluster_centers"}, {"score": 0.006993119396730054, "phrase": "intensity_overlap"}, {"score": 0.004645057834614705, "phrase": "frequently_used_method"}, {"score": 0.0035382855372646164, "phrase": "modified_strategy"}, {"score": 0.003343841875107018, "phrase": "two-pass_processes"}, {"score": 0.003292685392413911, "phrase": "first_process"}, {"score": 0.003143849342926373, "phrase": "segmented_image"}, {"score": 0.0030640804704319255, "phrase": "higher_value"}, {"score": 0.002986329509791943, "phrase": "alternative_threshold"}, {"score": 0.002895620643297197, "phrase": "lower_intensity"}, {"score": 0.0028221322455573624, "phrase": "second_process"}, {"score": 0.0026945086500597304, "phrase": "bias_field"}, {"score": 0.0026261108615242557, "phrase": "spatial_proximity"}, {"score": 0.002393907896783117, "phrase": "promising_results"}, {"score": 0.0022390533383717715, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "segmentation_performance"}], "paper_keywords": ["Image segmentation", " Infrared image", " Fuzzy clustering algorithm", " Cluster center"], "paper_abstract": "Fuzzy clustering algorithm is a frequently used method for image segmentation, which allows pixel to be classified into one or more clusters with respect to its membership level. However, its segmentation performance often suffered from the factors associated with the drift of cluster centers and the sensitiveness to the intensity overlap of distribution between classes. In this paper, we solve these drawbacks and present a modified strategy of fuzzy clustering algorithm for image segmentation. This strategy generally consists of two-pass processes. The first process is to directly calculate the cluster centers from the segmented image and then take the higher value of cluster centers as an alternative threshold to prevent the pixels with lower intensity from clustering. The second process thereby makes use of the fuzzy clustering algorithm with a bias field for partitioning pixels with spatial proximity, ensuring that our method is less sensitive to the drawbacks inherent in the fuzzy clustering algorithm and thus obtaining promising results. Experiments on synthetic and some representative infrared images demonstrate that the proposed method outperforms fuzzy c-means methods and its existing variants in terms of segmentation performance, and is less sensitive to the intensity overlap of the distribution between classes.", "paper_title": "A modified strategy of fuzzy clustering algorithm for image segmentation", "paper_id": "WOS:000361738400015"}