{"auto_keywords": [{"score": 0.0491574796453447, "phrase": "entity_type_models"}, {"score": 0.015569319767201488, "phrase": "geo-located_entities"}, {"score": 0.006586357461149238, "phrase": "extractive_multi-document_summarization"}, {"score": 0.00481495049065317, "phrase": "descriptive_multi-document_summaries"}, {"score": 0.004101281992566145, "phrase": "application_scenario"}, {"score": 0.0037942165191367366, "phrase": "natural_language"}, {"score": 0.0033433365160336842, "phrase": "multi-document_summarizer"}, {"score": 0.002725081358527507, "phrase": "integrated_entity_type_models"}, {"score": 0.0026337482179592422, "phrase": "standard_text-related_features"}, {"score": 0.0025829353063908256, "phrase": "text_summarization"}, {"score": 0.0025085435314540837, "phrase": "wikipedia_location_descriptions"}, {"score": 0.0023776656246300063, "phrase": "output_summaries"}, {"score": 0.002297949552105756, "phrase": "standard_summarization_features"}, {"score": 0.0022756672722130424, "phrase": "wikipedia_summaries"}, {"score": 0.002199363362666037, "phrase": "dependency_patterns"}, {"score": 0.002125612498781805, "phrase": "signature_words"}, {"score": 0.0021049977753042253, "phrase": "n-gram_language_models"}], "paper_keywords": ["summarization"], "paper_abstract": "In this article, we investigate the application of entity type models in extractive multi-document summarization using automatic caption generation for images of geo-located entities (e.g., WestminsterAbbey) as an application scenario. Entity type models contain sets of patterns aiming to capture the ways geo-located entities are described in natural language. They are automatically derived from texts about geo-located entities of the same type (e.g., churches, lakes). We integrate entity type models into a multi-document summarizer and use them to address the 2 major tasks in extractive multi-document summarization: sentence scoring and summary composition. We experiment with 3 different representation methods for entity type models: signature words, n-gram language models, and dependency patterns. We evaluate the summarizer with integrated entity type models relative to (a) a summarizer using standard text-related features commonly used in text summarization and (b) the Wikipedia location descriptions. Our results show that entity type models significantly improve the quality of output summaries over that of summaries generated using standard summarization features and Wikipedia summaries. The representation of entity type models using dependency patterns is superior to the representations using signature words and n-gram language models.", "paper_title": "Generating Descriptive Multi-Document Summaries of Geo-Located Entities Using Entity Type Models", "paper_id": "WOS:000351395800006"}