{"auto_keywords": [{"score": 0.03699607636337114, "phrase": "terrorist_activities"}, {"score": 0.00481495049065317, "phrase": "global_terrorism"}, {"score": 0.004771196027464407, "phrase": "recent_increases"}, {"score": 0.004727837281331949, "phrase": "terrorist_activity"}, {"score": 0.004600100053651545, "phrase": "analyzing_and_understanding_such_activities"}, {"score": 0.004141476915000558, "phrase": "detailed_historical_information"}, {"score": 0.004085115444878828, "phrase": "terrorist_event"}, {"score": 0.0037284065559949064, "phrase": "terrorists'_patterns"}, {"score": 0.003433987036569199, "phrase": "visual_analytical_system"}, {"score": 0.0032805541677236325, "phrase": "investigative_analysis"}, {"score": 0.0023818288346547692, "phrase": "multiple_terrorist_groups"}, {"score": 0.0023067494372458427, "phrase": "different_methods"}, {"score": 0.0021834945657804193, "phrase": "global_perspective"}, {"score": 0.0021049977753042253, "phrase": "five_questions"}], "paper_keywords": [""], "paper_abstract": "Recent increases in terrorist activity around the world have made analyzing and understanding such activities more critical than ever. With the help of organizations such as the National Center for the Study of Terrorism and Responses to Terrorism (START), we now have detailed historical information on each terrorist event around the world since 1970. However, due to the size and complexity of the data, identifying terrorists' patterns and trends has been difficult. To better enable investigators in understanding terrorist activities, we propose a visual analytical system that focuses on depicting one of the most fundamental concepts in investigative analysis, the five W's (who, what, where, when, and why). Views in our system are highly correlated, and each represents one of the W's. With this approach, an investigator can interactively explore terrorist activities efficiently and discover reasons of attacks (why) by identifying patterns temporally (when), geo-spatially (where), between multiple terrorist groups (who), and across different methods or modes of attacks (what). By coupling a global perspective with the details gleaned from asking these five questions, the system allows analysts to think both tactically and strategically.", "paper_title": "Investigative visual analysis of global terrorism", "paper_id": "WOS:000257075000027"}