{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "internet_access"}, {"score": 0.011493678315087937, "phrase": "public_transport_vehicle"}, {"score": 0.004756805752518494, "phrase": "public_transport_vehicles"}, {"score": 0.00445830200258645, "phrase": "true_mobile_internet_access_zones"}, {"score": 0.003964007795174772, "phrase": "influence_area"}, {"score": 0.003884479830773329, "phrase": "relay_nodes"}, {"score": 0.003806541299696042, "phrase": "access_area"}, {"score": 0.0036701570847323447, "phrase": "group-based_protocol"}, {"score": 0.0035965032173588753, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.0026103363762901423, "phrase": "feasible_proposal"}, {"score": 0.002537216271965659, "phrase": "study_case"}, {"score": 0.002506507889886399, "phrase": "real_values"}, {"score": 0.0022830706430588482, "phrase": "network_traffic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Group mobility", " Group-based architecture", " Mobility model", " VANETs"], "paper_abstract": "Some public transport vehicles embed devices that allow passengers to connect to Internet while traveling. These vehicles are true mobile Internet access zones inside public paths. These zones could be used by other vehicles moving close to them in order to have Internet access. At the same time, other vehicles in the influence area could be used as relay nodes which would increase this access area. In this paper, we present a group-based protocol and mobility model for vehicular ad hoc networks (VANETs) where each public transport vehicle forms a group of vehicles. They can access and allow access to Internet though the public transport vehicle. Each vehicle is moving inside the group and can leave and join any group at will, while all groups are moving. First, we will show the algorithm and protocol to achieve our purpose. Then, we will study the probability of having Internet access in order to demonstrate that it is a feasible proposal. Finally, we simulate a study case based on real values in order to obtain the performance of our proposal in terms of several network parameters such as the number of hops per route, the network traffic, the page response time, network delay, network load and so on. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Group-based protocol and mobility model for VANETs to offer internet access", "paper_id": "WOS:000320148400009"}