{"auto_keywords": [{"score": 0.046273829908275756, "phrase": "thz-tds_signals"}, {"score": 0.02819827616624647, "phrase": "conformal_split"}, {"score": 0.004517137548648729, "phrase": "geometric_algebra"}, {"score": 0.004466519142879166, "phrase": "novel_signal_analysis_approach"}, {"score": 0.004334280585565239, "phrase": "optical_physical_mechanism"}, {"score": 0.004127657126534723, "phrase": "high-dimensional_real_vector_space"}, {"score": 0.004035630066743877, "phrase": "algebraic_relationships"}, {"score": 0.0038721890530859578, "phrase": "complex_refractive_index"}, {"score": 0.003136952589428254, "phrase": "conformal_split_properties"}, {"score": 0.003066945490483524, "phrase": "substance_identification"}, {"score": 0.002931569771634119, "phrase": "novel_substance_identification_method"}, {"score": 0.0027602925235474317, "phrase": "\"known\"_substance"}, {"score": 0.0025989960809479104, "phrase": "different_thicknesses"}, {"score": 0.002437907960209364, "phrase": "thz-tds_signal"}, {"score": 0.00223570488212345, "phrase": "projected_vectors"}, {"score": 0.0021530945641993152, "phrase": "accurate_classification"}], "paper_keywords": ["terahertz time-domain spectroscopy", " substance identification", " geometric algebra", " conformal split"], "paper_abstract": "A terahertz time-domain spectroscopy (THz-TDS) imaging system can obtain high-dimensional signals with substance fingerprint information. By introducing geometric algebra, a novel signal analysis approach to THz-TDS signals is developed based on an optical physical mechanism. Using this approach, signals are represented with vectors in the high-dimensional real vector space. Geometric distribution properties and algebraic relationships of THz-TDS signals are deduced. It is proved that every complex refractive index of substances relates to a unique 2-blade, the vectors corresponding to the samples of the same substance are collinear and belong to the intrinsic 2-blade of the substance. When decomposed through the conformal split with respect to a 2-blade, THz-TDS signals of high dimensionality can be related to vectors in a 2-dimensional subspace. Based on the conformal split properties we deduced, two criteria for substance identification on the basis of THz-TDS signals are proposed. Accordingly, a novel substance identification method via the conformal split is presented. In the method, the 2-blade related to each \"known\" substance is calculated with two vectors corresponding to THz-TDS signals measured from samples of the substance but with different thicknesses. Using the conformal split with respect to those 2-blades, an identified vector corresponding to a THz-TDS signal is linearly related to the vector in a 2-dimensional subspace. The substance of a sample can be identified using criteria on the projected vectors in the subspaces. This method can contribute to accurate classification and identification. Finally, two experiments are presented that show the feasibility and accuracy of this method.", "paper_title": "THz-TDS signal analysis and substance identification via the conformal split", "paper_id": "WOS:000298651900007"}