{"auto_keywords": [{"score": 0.04773234497534146, "phrase": "cross-border_telemedicine_services"}, {"score": 0.00481495049065317, "phrase": "health_care"}, {"score": 0.004475798524102238, "phrase": "ten_databases"}, {"score": 0.004455412803723125, "phrase": "medline"}, {"score": 0.004435112929909235, "phrase": "embase"}, {"score": 0.004295740062781635, "phrase": "english"}, {"score": 0.004246824986308127, "phrase": "eldis_and_intute_databases"}, {"score": 0.004227474277489651, "phrase": "internet_search_engines"}, {"score": 0.00419861271409079, "phrase": "grey_literature"}, {"score": 0.0040479661688863884, "phrase": "cross-border_healthcare"}, {"score": 0.003669252883880186, "phrase": "relevant_data"}, {"score": 0.0036027928625276835, "phrase": "qualitative_approach"}, {"score": 0.003545625043276134, "phrase": "narrative_synthesis"}, {"score": 0.00325069754015951, "phrase": "inclusion_criteria"}, {"score": 0.003221111762383486, "phrase": "final_sample"}, {"score": 0.0031267991846693974, "phrase": "high_and_low_or_middle_income_countries"}, {"score": 0.002919529262595376, "phrase": "health_professionals"}, {"score": 0.0028340217672278975, "phrase": "main_driver"}, {"score": 0.0028018032777478567, "phrase": "cross-border_telemedicine"}, {"score": 0.0027510117151476675, "phrase": "specialist_services"}, {"score": 0.0027384579532946083, "phrase": "low_and_middle_income_countries"}, {"score": 0.0027197343489967322, "phrase": "underserved_rural_areas"}, {"score": 0.0027073229284666294, "phrase": "high_income_countries"}, {"score": 0.0023982317731094014, "phrase": "successful_engagement"}, {"score": 0.00238728400718416, "phrase": "cross-border_services"}, {"score": 0.0023226365302676973, "phrase": "innovative_ways"}, {"score": 0.0022700999144224295, "phrase": "strong_team_leadership"}, {"score": 0.0022136780933978612, "phrase": "low_cost"}, {"score": 0.0021985346458857575, "phrase": "simple_technologies"}, {"score": 0.0021735249249471614, "phrase": "clear_legal_and_regulatory_framework"}, {"score": 0.0021438877099090262, "phrase": "successful_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Telemedicine", " Systematic review", " Cross-border"], "paper_abstract": "Purpose: Innovative technologies to deliver health care across borders have attracted both evangelists and sceptics. Our aim was to systematically identify factors that hinder or support implementation of cross-border telemedicine services worldwide in the last two decades. Methods: Two reviewers independently searched ten databases including MEDLINE and EMBASE, in June 2011 including citations from 1990 onwards when at least an abstract was available in English. We also searched ELDIS and INTUTE databases and Internet search engines to identify grey literature. We included studies which (a) described the use of telemedicine to deliver cross-border healthcare and, or (b) described the factors that hinder or support implementation of cross-border telemedicine services. All study designs were included. Two reviewers independently assessed titles and abstracts of articles identified. Papers were allocated to one of four reviewers who extracted relevant data and validated it. We took a qualitative approach to the analysis, conducting a narrative synthesis of the evidence. Results: 6026 records were identified of which 5806 were excluded following screening of titles and abstracts. We assessed 227 full text articles, excluding 133 because they were fatally flawed or did not meet the inclusion criteria, producing a final sample of 94. They involved 76 countries worldwide, most involving collaborations between high and low or middle income countries. Most described services delivering a combination of types of telemedicine but specialties most represented were telepathology, telesurgery, Emergency and trauma telemedicine and teleradiology. Most link health professionals, with only a few linking professionals directly to patients. A main driver for the development of cross-border telemedicine is the need to improve access to specialist services in low and middle income countries and in underserved rural areas in high income countries. Factors that hinder or support implementation clustered into four main themes: (1) legal factors; (2) sustainability factors; (3) cultural factors; and (4) contextual factors. Conclusions: National telemedicine programmes may build infrastructure and change mind-sets, laying the foundations for successful engagement in cross-border services. Regional networks can also help with sharing of expertise and innovative ways of overcoming barriers to the implementation of services. Strong team leadership, training, flexible and locally responsive services delivered at low cost, using simple technologies, and within a clear legal and regulatory framework, are all important factors for the successful implementation of cross-border telemedicine services. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Telemedicine across borders: A systematic review of factors that hinder or support implementation", "paper_id": "WOS:000311830600001"}