{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml"}, {"score": 0.04930306698604389, "phrase": "data_warehouses"}, {"score": 0.0418934785592309, "phrase": "conceptual_level"}, {"score": 0.015568011297294149, "phrase": "multidimensional_modeling"}, {"score": 0.01320085177820265, "phrase": "main_md_properties"}, {"score": 0.007477239635915575, "phrase": "md_modeling"}, {"score": 0.004510502900568775, "phrase": "md_databases"}, {"score": 0.004466519142879166, "phrase": "online_analytical_processing"}, {"score": 0.0042668414931947615, "phrase": "traditional_database_modeling"}, {"score": 0.0038056875126935607, "phrase": "conceptual_md_modeling"}, {"score": 0.0035999631751991385, "phrase": "uml_profile"}, {"score": 0.0034388914613623857, "phrase": "tagged_values"}, {"score": 0.003179303164775306, "phrase": "defined_stereotypes"}, {"score": 0.0031277316566463978, "phrase": "arbitrary_use"}, {"score": 0.0029296522533971085, "phrase": "well_known_standard_modeling_language"}, {"score": 0.002826092315294647, "phrase": "new_notation"}, {"score": 0.0026557415971295633, "phrase": "specific_domain"}, {"score": 0.0026384167183586015, "phrase": "concrete_peculiarities"}, {"score": 0.0025368092524479615, "phrase": "model_driven_architecture"}, {"score": 0.002383854204260751, "phrase": "target_platform"}, {"score": 0.002160862869106241, "phrase": "rational_rose"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["UML", " multidimensional modeling", " data warehouses", " UML extension", " UML profile"], "paper_abstract": "The multidimensional (MD) modeling, which is the foundation of data warehouses (DWs), MD databases, and OnLine Analytical Processing (OLAP) applications, is based on several properties different from those in traditional database modeling. In the past few years, there have been some proposals, providing their own formal and graphical notations, for representing the main MD properties at the conceptual level. However, unfortunately none of them has been accepted as a standard for conceptual MD modeling. In this paper, we present an extension of the Unified Modeling Language (UML) using a UML profile. This profile is defined by a set of stereotypes, constraints and tagged values to elegantly represent main MD properties at the conceptual level. We make use of the Object Constraint Language (OCL) to specify the constraints attached to the defined stereotypes, thereby avoiding an arbitrary use of these stereotypes. We have based our proposal in UML for two main reasons: (i) UML is a well known standard modeling language known by most database designers, thereby designers can avoid learning a new notation, and (ii) UML can be easily extended so that it can be tailored for a specific domain with concrete peculiarities such as the multidimensional modeling for data warehouses. Moreover, our proposal is Model Driven Architecture (MDA) compliant and we use the Query View Transformation (QVT) approach for an automatic generation of the implementation in a target platform. Throughout the paper, we will describe how to easily accomplish the MD modeling of DWs at the conceptual level. Finally, we show how to use our extension in Rational Rose for MD modeling. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A UML profile for multidimensional modeling in data warehouses", "paper_id": "WOS:000241533800011"}