{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weighted-ipc_metrics"}, {"score": 0.013362868520185233, "phrase": "raw-ipc_metrics"}, {"score": 0.01043477444380794, "phrase": "multiprogram_workload_performance"}, {"score": 0.010318003342487881, "phrase": "weighted_speedup"}, {"score": 0.004423061344624088, "phrase": "weighted-ipc_metric"}, {"score": 0.004299621153829837, "phrase": "multiprogram_ipc"}, {"score": 0.00403999571801977, "phrase": "michaud"}, {"score": 0.0034086028336466688, "phrase": "harmonic_mean"}, {"score": 0.0033511469200347907, "phrase": "raw_ipc_values"}, {"score": 0.003239114833599948, "phrase": "multiprogram_workload"}, {"score": 0.002941558420246247, "phrase": "equal_importance"}, {"score": 0.002671263324230699, "phrase": "system-level_meaning"}, {"score": 0.0025383451160985488, "phrase": "inherent_behavior"}, {"score": 0.0021049977753042253, "phrase": "normalized_turnaround_time"}], "paper_keywords": [""], "paper_abstract": "Weighted speedup is nowadays the most commonly used multiprogram workload performance metric. Weighted speedup is a weighted-IPC metric, i.e., the multiprogram IPC of each program is first weighted with its isolated IPC. Recently, Michaud questions the validity of weighted-IPC metrics by arguing that they are inconsistent and that weighted speedup favors unfairness [4]. Instead, he advocates using the arithmetic or harmonic mean of the raw IPC values of the programs in the multiprogram workload. We show that weighted-IPC metrics are not inconsistent, and that weighted speedup is fair in giving equal importance to each program. We argue that, in contrast to raw-IPC metrics, weighted-IPC metrics have a system-level meaning, and that raw-IPC metrics are affected by the inherent behavior of the programs. We also show that the choice of a metric may adversely affect the conclusions from an experiment. We suggest to use two weighted-IPC metrics-system throughput (STP) and average normalized turnaround time (ANTT)-for evaluating multiprogram workload performance, and to avoid raw-IPC metrics.", "paper_title": "Restating the Case for Weighted-IPC Metrics to Evaluate Multiprogram Workload Performance", "paper_id": "WOS:000346979300010"}