{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pareto_sets"}, {"score": 0.004734987730139094, "phrase": "chemical_processes"}, {"score": 0.00465634671242413, "phrase": "multi-criteria_optimization_problem"}, {"score": 0.003724034990158436, "phrase": "novel_algorithm"}, {"score": 0.003601235776892337, "phrase": "state-of-the-art_steady-state_flow_sheet_simulator"}, {"score": 0.0031315358193567708, "phrase": "decision_maker"}, {"score": 0.0030113280682863234, "phrase": "pareto_set"}, {"score": 0.0029447150254434842, "phrase": "different_optimal_solutions"}, {"score": 0.0027382040767844093, "phrase": "entire_pareto_set"}, {"score": 0.0025178072071268534, "phrase": "distillation_process"}, {"score": 0.0024346858809238766, "phrase": "azeotropic_mixture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-objective optimization", " Non-convex Pareto frontier", " Interactive navigation", " Computer-aided process design", " Algorithm", " Software tool"], "paper_abstract": "Designing chemical processes is a multi-criteria optimization problem with conflicting objectives. It can efficiently be solved using Pareto sets. These sets contain all solutions for which an improvement in any objective can only be achieved by accepting a decline in at least one other objective. This work integrates a novel algorithm to determine Pareto sets in a state-of-the-art steady-state flow sheet simulator. An approximation of predefined accuracy of the Pareto set, which can be convex or non-convex, is calculated. The decision maker can then navigate interactively on the Pareto set and explore the different optimal solutions. His decision is, hence, embedded in the knowledge of the entire Pareto set. The application of the method is illustrated by an example in which a distillation process for the separation of an azeotropic mixture (acetone + chloroform) is designed. Two process variants are compared: a pressure-swing and an entrainer distillation. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-criteria optimization in chemical process design and decision support by navigation on Pareto sets", "paper_id": "WOS:000327885100026"}