{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lattice-valued_first-order_logic"}, {"score": 0.004614483128885678, "phrase": "resolution-based_automated_reasoning"}, {"score": 0.0043161190928529755, "phrase": "lattice-valued_logical_algebraic_structure_lattice_implication_algebra"}, {"score": 0.0033029038236817372, "phrase": "quasi-regular_generalized_literals"}, {"score": 0.0025578967205807843, "phrase": "practical_implementation"}, {"score": 0.002526938673434697, "phrase": "automated_reasoning_algorithms"}, {"score": 0.002392188222609101, "phrase": "key_support"}, {"score": 0.0023632309822037637, "phrase": "alpha-resolution-based_automated_reasoning_approaches"}, {"score": 0.002306369310443131, "phrase": "lia"}, {"score": 0.0021966859554037174, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Incomparability", " Many-valued logic", " Automated reasoning", " Lattice implication algebra", " Lattice-valued logic", " alpha-Resolution"], "paper_abstract": "Key issues for resolution-based automated reasoning in lattice-valued first-order logic LF(X) are investigated with truth-values in a lattice-valued logical algebraic structure lattice implication algebra (LIA). The determination of resolution at a certain truth-value level (called alpha-resolution) in LF(X) is proved to be equivalently transformed into the determination of alpha-resolution in lattice-valued propositional logic LP(X) based on LIA. The determination of alpha-resolution of any quasi-regular generalized literals and constants under various cases in LP(X) is further analyzed, specified, and subsequently verified. Hence the determination of alpha-resolution in LF(X) can be accordingly solved to a very broad extent. which not only lays a foundation for the practical implementation of automated reasoning algorithms in LF(X). but also provides a key support for alpha-resolution-based automated reasoning approaches and algorithms in LIA based linguistic truth-valued logics. Crown Copyright (C) 2010 Published by Elsevier Inc. All rights reserved.", "paper_title": "Determination of alpha-resolution in lattice-valued first-order logic LF(X)", "paper_id": "WOS:000288833300006"}