{"auto_keywords": [{"score": 0.04056003981914698, "phrase": "progressed_theory"}, {"score": 0.0164284996151193, "phrase": "alternative_definition"}, {"score": 0.010520308841471588, "phrase": "lin"}, {"score": 0.010428551980352682, "phrase": "reiter"}, {"score": 0.008870593340638824, "phrase": "first-order_logic"}, {"score": 0.00481495049065317, "phrase": "seminal_paper"}, {"score": 0.004669085371587273, "phrase": "model-theoretic_definition"}, {"score": 0.004547564208690591, "phrase": "basic_action_theory"}, {"score": 0.004487989502479992, "phrase": "situation_calculus"}, {"score": 0.004332894955218135, "phrase": "intended_properties"}, {"score": 0.004128317208406523, "phrase": "strong_negative_result"}, {"score": 0.0036499505265403377, "phrase": "alternative_simpler_definition"}, {"score": 0.002248816575548875, "phrase": "large_class"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge representation", " Reasoning about action", " Situation calculus"], "paper_abstract": "In a seminal paper, Lin and Reiter introduced a model-theoretic definition for the progression of a basic action theory in the situation calculus, and proved that it implies the intended properties. They also showed that this definition comes with a strong negative result, namely that for certain cases first-order logic is not expressive enough to correctly characterize the progressed theory and second-order axioms are necessary. However, they also considered an alternative simpler definition according to which the progressed theory is always first-order definable. They conjectured that this alternative definition is incorrect in the sense that the progressed theory is too weak and may sometimes lose information. This conjecture and the status of the definability of progression in first-order logic has remained open since. In this paper we present two significant results about this alternative definition of progression. First, we prove the Lin and Reiter conjecture by presenting a case where the progressed theory indeed does lose information, thus closing a question that has remained open for more than ten years. Second, we prove that the alternative definition is nonetheless correct for reasoning about a large class of sentences, including some that quantify over situations. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "How to progress a database III", "paper_id": "WOS:000315839600007"}