{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "service-oriented_context-driven_software_agents"}, {"score": 0.004553128404612054, "phrase": "web_service_paradigms"}, {"score": 0.004122179528285764, "phrase": "context_awareness"}, {"score": 0.0038978806337961565, "phrase": "service-oriented_environments"}, {"score": 0.0034634973175137486, "phrase": "dynamic_heterogeneous_environments"}, {"score": 0.0031746155143471725, "phrase": "remote_services"}, {"score": 0.0027172101552870973, "phrase": "performance_analysis_model"}, {"score": 0.00266693888510356, "phrase": "time_consumption"}, {"score": 0.002633941112839883, "phrase": "network_load"}, {"score": 0.002521623057264411, "phrase": "component_use"}, {"score": 0.0022402661832994094, "phrase": "multicriteria_decision-making_model"}], "paper_keywords": ["context-awareness", " service oriented computing", " software agents"], "paper_abstract": "The case for integrating software agent and web service paradigms has been well documented, and we believe that convergence of these two paradigms, enhanced with context awareness, can enable more efficient and effective pervasive services. Software agents in service-oriented environments have traditionally been limited to either using, providing, or aggregating services. We propose that in dynamic heterogeneous environments it would be sometimes beneficial if the agent, in addition to invoking remote services, could acquire the capacity to execute functionality provided by the service and run it locally. To this end, we build a performance analysis model that compares time consumption and network load of service access with that of component use. We argue that such a model would allow an agent to dynamically select the more efficient alternative. We present a multicriteria decision-making model that helps dynamic selection, describe experiments comparing the two approaches, and discuss results and lessons learned.", "paper_title": "Improving Efficiency of Service-Oriented Context-Driven Software Agents", "paper_id": "WOS:000295452100004"}