{"auto_keywords": [{"score": 0.04313137598710988, "phrase": "clustered_architecture"}, {"score": 0.00481495049065317, "phrase": "link_stability"}, {"score": 0.004594951819987416, "phrase": "extensive_research_efforts"}, {"score": 0.004407813106104401, "phrase": "efficient_clustering_algorithms"}, {"score": 0.004272456401437226, "phrase": "mobile_ad_hoc_network"}, {"score": 0.003850464100878052, "phrase": "longer_period"}, {"score": 0.0036553070575015344, "phrase": "node_mobility"}, {"score": 0.0031107911390188055, "phrase": "frequent_information_exchanges"}, {"score": 0.0030625949549620475, "phrase": "participating_nodes"}, {"score": 0.0029376803941247084, "phrase": "high_communication"}, {"score": 0.002674885993329912, "phrase": "performance_improvement"}, {"score": 0.002633425544817301, "phrase": "whole_network"}, {"score": 0.002512850690695835, "phrase": "efficient_clustering_algorithm"}, {"score": 0.0022760856906838814, "phrase": "computer_simulations"}, {"score": 0.0022291501521610737, "phrase": "clustered_architectures"}], "paper_keywords": ["Clustered Architecture", " Clustering Algorithm", " Link Stability", " Mobile Ad Hoc Network"], "paper_abstract": "Recently, extensive research efforts have been devoted to the design of efficient clustering algorithms to divide all the nodes in a mobile ad hoc network into multiple clusters to form a clustered architecture. A clustered architecture is more stable if it can hold for a longer period of time. In a clustered architecture, due to node mobility, a node may depart from its original cluster and enter another cluster dynamically. Such a change may cause the clustered architecture to be reconfigured, leading to the instability of the network. Frequent information exchanges among the participating nodes and re-computation of clusters involve high communication and computation overheads. Therefore, it is obvious that a more stable clustered architecture will directly lead to the performance improvement of the whole network. In this paper, we propose an efficient clustering algorithm that can establish a more stable clustered architecture by keeping a node with many weak links from being selected as a clusterhead. Computer simulations show that the clustered architectures generated by our clustering algorithm are more stable than those generated by other clustering algorithms.", "paper_title": "A Stable Clustering Algorithm Based on Link Stability for Mobile Ad Hoc Networks", "paper_id": "WOS:000207999700008"}