{"auto_keywords": [{"score": 0.048835745230446155, "phrase": "search_engines"}, {"score": 0.00481495049065317, "phrase": "information_source"}, {"score": 0.004025885154716127, "phrase": "web_users"}, {"score": 0.00392125815948488, "phrase": "alternative_services"}, {"score": 0.0035853745478488254, "phrase": "company's_web_site"}, {"score": 0.0032437952431945724, "phrase": "one's_web_site"}, {"score": 0.0029038817737006405, "phrase": "web_site"}, {"score": 0.002783945062714816, "phrase": "web_administrators"}, {"score": 0.0024789887640568093, "phrase": "defined_measures"}, {"score": 0.0024144659350277954, "phrase": "web_administrator"}, {"score": 0.0023640560785711923, "phrase": "web_design"}, {"score": 0.0022904032758108775, "phrase": "positioning_point"}, {"score": 0.0021049977753042253, "phrase": "measure_values"}], "paper_keywords": [""], "paper_abstract": "In recent years, the Internet has experienced a boom as an information source. The use of search engines is the most common way of finding this information. This means that less visible contents (for search engines) are increasingly difficult or even almost impossible to find. Thus,Web users are forced to accept alternative services or contents only because they are visible and offered to users by search engines. If a company's Web site is not visible, that company is losing clients. Therefore, it is fundamental to assure that one's Web site will be indexed and, consequently, visible to as many Web users as possible. To quantitatively evaluate the visibility of a Web site, this article introduces a method that Web administrators may use. The method consists of four activities and several tasks. Most of the tasks are accompanied by a set of defined measures that can help the Web administrator determine where the Web design is failing (from the positioning point of view). Some tools that can be used for the determination of the measure values also are referenced in the description of the method. The method is furthermore accompanied by examples to help in understanding how to apply it.", "paper_title": "Web site visibility evaluation", "paper_id": "WOS:000258582600004"}