{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "students'_political_engagement"}, {"score": 0.004743594110762319, "phrase": "teacher's_pedagogy"}, {"score": 0.004673290248999786, "phrase": "semester-long_political_blog_assignment"}, {"score": 0.004490842671590769, "phrase": "internet's_potential"}, {"score": 0.0043804319008535555, "phrase": "public_issues"}, {"score": 0.004188459638572375, "phrase": "political_engagement_outcomes"}, {"score": 0.0041469500929423595, "phrase": "students'_classroom-based_use"}, {"score": 0.0035712919163869176, "phrase": "political_engagement"}, {"score": 0.0034317185678527672, "phrase": "political_blogs"}, {"score": 0.00299958349498286, "phrase": "large_comparison_group"}, {"score": 0.0028253682745674608, "phrase": "quantitative_and_qualitative_analyses"}, {"score": 0.0027420820738468577, "phrase": "blog-focused_classes"}, {"score": 0.0027148677103585985, "phrase": "greater_political_interest"}, {"score": 0.002687922713487696, "phrase": "internal_political_efficacy"}, {"score": 0.0026217213613095322, "phrase": "political_writing"}, {"score": 0.002444883254621769, "phrase": "interactive_posting"}, {"score": 0.0023846534541336326, "phrase": "heated_exchanges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blogging", " Pedagogy", " Civic engagement", " Mixed methods", " Secondary education"], "paper_abstract": "Many scholars have written about the Internet's potential for engaging youth in public issues, but there has been little empirical research on the political engagement outcomes from students' classroom-based use of web 2.0 tools, such as blogs, or the pedagogies involved in designing such experiences. This paper begins to address this gap by analyzing the development of political engagement among several dozen high school students who were required to complete political blogs for their required U.S. government course and by exploring their teacher's pedagogical strategies and challenges. We analyzed data from 22 classroom observations, 15 student interviews, three teacher interviews, and surveys from over 300 students (including a large comparison group) given at the beginning and end of the fall 2012-13 semester. Quantitative and qualitative analyses indicate that students in the blog-focused classes developed greater political interest, internal political efficacy, and self-efficacy for political writing than other students. We also found that the teacher did not actively encourage interactive posting in order to avoid heated exchanges but that many students expressed an interest in seeing more responses to their online writing. We discuss implications for practice and research. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Students blogging about politics: A study of students' political engagement and a teacher's pedagogy during a semester-long political blog assignment", "paper_id": "WOS:000363818800006"}