{"auto_keywords": [{"score": 0.03363896917055259, "phrase": "outsourcing_company"}, {"score": 0.011528742690419345, "phrase": "external_contractor"}, {"score": 0.008114659866199758, "phrase": "personal_data"}, {"score": 0.0072551038283909155, "phrase": "insurance_contract"}, {"score": 0.00481495049065317, "phrase": "optimal_insurance_contracts"}, {"score": 0.004776484866276242, "phrase": "security_risks"}, {"score": 0.004738325072560588, "phrase": "privacy_violation"}, {"score": 0.00455202992136173, "phrase": "information_technology_goods"}, {"score": 0.00432070565627091, "phrase": "high_labor_cost"}, {"score": 0.00426900754050533, "phrase": "service_providers"}, {"score": 0.004117579919425373, "phrase": "vast_variety"}, {"score": 0.004084662575167727, "phrase": "application_domains"}, {"score": 0.0037244390953401533, "phrase": "business_model"}, {"score": 0.0034508665218929745, "phrase": "service_provider"}, {"score": 0.0033958751452139984, "phrase": "information_technology_outsourcing"}, {"score": 0.0032621876512517398, "phrase": "side_effect"}, {"score": 0.0026900059414552823, "phrase": "security_incident"}, {"score": 0.0024133533748653033, "phrase": "individual's_privacy"}, {"score": 0.002308953751676031, "phrase": "outsourcing_model"}, {"score": 0.0021738146596180404, "phrase": "probabilistic_model"}, {"score": 0.0021049977753042253, "phrase": "premium_and_compensation_amounts"}], "paper_keywords": ["privacy protection", " IT outsourcing", " insurance", " optimal contract"], "paper_abstract": "Day by day the provision of information technology goods and services becomes noticeably expensive. This is mainly due to the high labor cost for the service providers, resulting from the need to cover a vast variety of application domains and at the same time to improve or/and enhance the services offered in accordance to the requirements set by the competition. A business model that could ease the problem is the development or/and provision of the service by an external contractor on behalf of the service provider; known as Information Technology Outsourcing. However, outsourcing a service may have the side effect of transferring personal or/and sensitive data from the outsourcing company to the external contractor. Therefore the outsourcing company faces the risk of a contractor who does not adequately protect the data, resulting to their non- deliberate disclosure or modification, or of a contractor that acts maliciously in the sense that she causes a security incident for making profit out of it. Whatever the case, the outsourcing company is legally responsible for the misuse of personal data or/and the violation of an individual's privacy. In this paper we demonstrate how companies adopting the outsourcing model can protect the personal data and privacy of their customers through an insurance contract. Moreover a probabilistic model for optimising, in terms of the premium and compensation amounts, the insurance contract is presented.", "paper_title": "A probabilistic model for optimal insurance contracts against security risks and privacy violation in IT outsourcing environments", "paper_id": "WOS:000251612700001"}