{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "military_command"}, {"score": 0.004684157900507474, "phrase": "authorized_military_hierarchy_organization"}, {"score": 0.004157058883925715, "phrase": "problem_solving_knowledge"}, {"score": 0.0037921662574137535, "phrase": "military_organization"}, {"score": 0.0037060428445111664, "phrase": "multiple_actors"}, {"score": 0.0032436052954996097, "phrase": "staff_planning"}, {"score": 0.002878140062594849, "phrase": "unstructured_problem"}, {"score": 0.002711109302199029, "phrase": "case_knowledge"}, {"score": 0.002686284749214443, "phrase": "rule_knowledge"}, {"score": 0.0026494723416072316, "phrase": "heuristic_knowledge"}, {"score": 0.00257735013358606, "phrase": "combat_formations"}, {"score": 0.0025071862539276283, "phrase": "problem_structuring"}, {"score": 0.002318566141177149, "phrase": "knowledge-based_system_architecture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["problem structuring methods", " soft operational research", " military command and control", " knowledge management", " knowledge-based system architecture"], "paper_abstract": "In an authorized military hierarchy organization, the procedure of problem solving must be co-ordinated with the tasks of planning, directing, and controlling. In most combat situations, problem solving knowledge is acquired from an expert (commander) or a single group of experts (staff) in a military organization. Therefore, these multiple actors (commander and the staff), multiple perspectives (multi-expertise and knowledge types), incommensurable and/or conflicting interests (resource allocation and distribution among staff planning), important intangibles (ambiguous quantitative or qualitative apparatus), and key uncertainties (unexpected internal and external situations) are part of unstructured problem. In this article, military strategy and tactics are acquired as case knowledge, rule knowledge, and heuristic knowledge content in terms of representing combat formations and planning mechanism to support problem structuring and the solution of military command and control. By doing so, this article presents a knowledge-based system architecture, including case base, rule base, heuristic base, and learning paradigm, for the military command and control procedure with strategic guidance (commander's strategy and tactics) and tactical planning (staff plans generation) system functions in terms of implementing problem Structuring methods in military command and control. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Problem structuring methods in military command and control", "paper_id": "WOS:000257993700009"}