{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_algorithms"}, {"score": 0.020793028745677133, "phrase": "simulated_annealing"}, {"score": 0.00979615210115455, "phrase": "hybrid_metaheuristics"}, {"score": 0.007184864657518397, "phrase": "hybrid_approaches"}, {"score": 0.004563427013973105, "phrase": "synergy_test"}, {"score": 0.004255902303152008, "phrase": "evolutionary_algorithms_fields"}, {"score": 0.004187917910692495, "phrase": "fruitful_research_line"}, {"score": 0.0034148795808317555, "phrase": "empirical_study"}, {"score": 0.003306559295382181, "phrase": "representative_set"}, {"score": 0.002937879003671346, "phrase": "synergy_relationships"}, {"score": 0.002695768552609587, "phrase": "best_performing_hybrid_metaheuristic"}, {"score": 0.0024868972942701582, "phrase": "useful_conclusions"}, {"score": 0.002127765807039172, "phrase": "competitive_alternative"}, {"score": 0.0021049977753042253, "phrase": "binary_combinatorial_problems"}], "paper_keywords": ["Combinatorial optimization", " evolutionary algorithms (EAs)", " hybrid metaheuristics (HMs)", " simulated annealing (SA)"], "paper_abstract": "The design of hybrid metaheuristics with ideas taken from the simulated annealing and evolutionary algorithms fields is a fruitful research line. In this paper, we first present an overview of the hybrid metaheuristics based on simulated annealing and evolutionary algorithms presented in the literature and classify them according to two well-known taxonomies of hybrid methods. Second, we perform an empirical study comparing the behavior of a representative set of the hybrid approaches based on evolutionary algorithms and simulated annealing found in the literature. In addition, a study of the synergy relationships provided by these hybrid approaches is presented. Finally, we analyze the behavior of the best performing hybrid metaheuristic with regard to several state-of-the-art evolutionary algorithms for binary combinatorial problems. The experimental studies presented provide useful conclusions about the schemes for combining ideas from simulated annealing and evolutionary algorithms that may improve the performance of these kinds of approaches and suggest that these hybrids metaheuristics represent a competitive alternative for binary combinatorial problems.", "paper_title": "Hybrid Metaheuristics Based on Evolutionary Algorithms and Simulated Annealing: Taxonomy, Comparison, and Synergy Test", "paper_id": "WOS:000314269000003"}