{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soft_errors"}, {"score": 0.023004142076715618, "phrase": "sram-based_fpgas"}, {"score": 0.004494570360108983, "phrase": "system_failures"}, {"score": 0.004154332348800334, "phrase": "unused_resources"}, {"score": 0.0037834649508375544, "phrase": "cad_flow"}, {"score": 0.003548905904860611, "phrase": "t-vpack_and_vpr_tools"}, {"score": 0.003200230621987751, "phrase": "seu_reduction_methods"}, {"score": 0.0027878797103973313, "phrase": "system_failure_rate"}, {"score": 0.0026538282523433684, "phrase": "first_method"}, {"score": 0.0025014259919355453, "phrase": "second_method"}, {"score": 0.002346160830406661, "phrase": "third_method"}, {"score": 0.0021896891011033105, "phrase": "second_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "This paper presents three methods to reduce the system failures resulted from soft errors: (1) an adaptive redundancy-based method that utilizes unused resources to tolerate the effects of soft errors in SRAM-based FPGAs; (2) an SEU-aware method in CAD flow of SRAM-based FPGAs to mitigate the effects of soft errors which is based on T-VPack and VPR tools and functions without any redundancy; and finally, (3) combination of these two methods to realize whether these SEU reduction methods are cumulative or not when they are applied in sequence. The effects of these methods have been investigated on several MCNC benchmarks. The results show that the system failure rate of circuits implemented on FPGAs decreases about 3.59% using the first method, 4.60%, 10.09%, and 12.45% in three cases of the second method, and 7.47%, 15.94%, and 17.43% in three cases of the third method. These results show that the effect of combining the first and the second methods is cumulative. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Mitigation of soft errors in SRAM-based FPGAs using CAD tools", "paper_id": "WOS:000298907500017"}