{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_mechanisms"}, {"score": 0.04737528008749573, "phrase": "ddos_attacks"}, {"score": 0.04500352715676157, "phrase": "malicious_users"}, {"score": 0.004772137871562584, "phrase": "sophisticated_ddos_attacks"}, {"score": 0.003732368382223596, "phrase": "first_step"}, {"score": 0.003666217992454448, "phrase": "fundamental_gap"}, {"score": 0.00303839203670705, "phrase": "data_structure"}, {"score": 0.002815864555488112, "phrase": "closed_hash"}, {"score": 0.002716844480081738, "phrase": "open_hash"}, {"score": 0.002574788013427524, "phrase": "traditional_performance_evaluation"}, {"score": 0.0024842242921857705, "phrase": "queuing_mechanisms"}, {"score": 0.002451088210833819, "phrase": "computer_and_communications_systems"}, {"score": 0.002354302193867031, "phrase": "practical_case"}, {"score": 0.002322895056238477, "phrase": "hash_table"}, {"score": 0.0021430393104977788, "phrase": "regular_users"}, {"score": 0.0021049977753042253, "phrase": "performance_degradation"}], "paper_keywords": ["DDoS", " hash", " queue", " vulnerability", " metric", " malicious"], "paper_abstract": "In recent years, we have experienced a wave of DDoS attacks threatening the welfare of the internet. These are launched by malicious users whose only incentive is to degrade the performance of other, innocent, users. The traditional systems turn out to be quite vulnerable to these attacks. The objective of this work is to take a first step to close this fundamental gap, aiming at laying a foundation that can be used in future computer/network designs taking into account the malicious users. Our approach is based on proposing a metric that evaluates the vulnerability of a system. We then use our vulnerability metric to evaluate a data structure which is commonly used in network mechanisms-the Hash table data structure. We show that Closed Hash is much more vulnerable to DDoS attacks than Open Hash, even though the two systems are considered to be equivalent by traditional performance evaluation. We also apply the metric to queuing mechanisms common to computer and communications systems. Furthermore, we apply it to the practical case of a hash table whose requests are controlled by a queue, showing that even after the attack has ended, the regular users still suffer from performance degradation or even a total denial of service.", "paper_title": "Vulnerability of Network Mechanisms to Sophisticated DDoS Attacks", "paper_id": "WOS:000317010700015"}