{"auto_keywords": [{"score": 0.04966447721457641, "phrase": "ad_hoc_networks"}, {"score": 0.015451586618321553, "phrase": "critical_connectivity"}, {"score": 0.00481495049065317, "phrase": "ant_routing_algorithms"}, {"score": 0.004610058444728656, "phrase": "novel_self-organizing_approach"}, {"score": 0.0044524122425287005, "phrase": "distributed_ant_routing"}, {"score": 0.004081385289516914, "phrase": "ant_colonies"}, {"score": 0.0038906171474520756, "phrase": "heuristic_algorithm"}, {"score": 0.0038234714417849495, "phrase": "mathematical_proofs"}, {"score": 0.0033262524445013303, "phrase": "theoretical_analysis"}, {"score": 0.0032263884310883375, "phrase": "dar"}, {"score": 0.003170667618004276, "phrase": "important_advantages"}, {"score": 0.002906138793910919, "phrase": "algorithm_parameters"}, {"score": 0.0025389513338018414, "phrase": "fast_communication_establishment"}, {"score": 0.002516917671182532, "phrase": "minimum_signalling_overhead"}, {"score": 0.00226693109377084, "phrase": "proposed_algorithm"}, {"score": 0.0021607883988873492, "phrase": "existing_ad_hoc_routing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ad hoc networks", " Routing protocol", " Ant routing", " Critical connectivity"], "paper_abstract": "This paper shows a novel self-organizing approach for routing datagrams in ad hoc networks, called Distributed Ant Routing (DAR). This approach belongs to the class of routing algorithms inspired by the behavior of the ant colonies in locating and storing food. The effectiveness of the heuristic algorithm is supported by mathematical proofs and demonstrated by a comparison with the well-known Ad hoc On Demand Distance Vector (AODV) algorithm. The differences and the similarities of the two algorithms have been highlighted. Results obtained by a theoretical analysis and a simulation campaign show that DAR allows obtaining some important advantages that makes it a valuable candidate to operate in ad hoc networks and the same method helps in the selection of the algorithm parameters. Since the approach aims at minimizing complexity in the nodes at the expenses of the optimality of the solution, it results to be particularly suitable in environments where fast communication establishment and minimum signalling overhead are requested. These requirements are typical of ad hoc networks with critical connectivity, as described in the paper. Thus the performance of the proposed algorithm are shown in ad hoc networks with critical connectivity and compared to some existing ad hoc routing algorithms. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "On ant routing algorithms in ad hoc networks with critical connectivity", "paper_id": "WOS:000263410900001"}