{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sensor_surveillance_systems"}, {"score": 0.040043316347254894, "phrase": "base_station"}, {"score": 0.03178723188413869, "phrase": "maximal_lifetime"}, {"score": 0.012677470461608737, "phrase": "sensed_data"}, {"score": 0.011965321767357229, "phrase": "surveillance_system"}, {"score": 0.010941742795972686, "phrase": "active_sensors"}, {"score": 0.0103806009450104, "phrase": "optimal_solution"}, {"score": 0.009003852341436247, "phrase": "workload_matrix"}, {"score": 0.004664352260912174, "phrase": "maximal_lifetime_scheduling_problem"}, {"score": 0.0031011538704241908, "phrase": "target-watching_schedule"}, {"score": 0.002687235334499192, "phrase": "linear_programming_technique"}, {"score": 0.0025348408238837655, "phrase": "schedule_matrices"}, {"score": 0.002378408229095287, "phrase": "sensor_surveillance_trees"}, {"score": 0.0021049977753042253, "phrase": "first_time"}], "paper_keywords": [""], "paper_abstract": "This paper addresses the maximal lifetime scheduling problem in sensor surveillance systems. Given a set of sensors and targets in an area, a sensor can watch only one target at a time, our task is to schedule sensors to watch targets and forward the sensed data to the base station, such that the lifetime of the surveillance system is maximized, where the lifetime is the duration that all targets are watched and all active sensors are connected to the base station. We propose an optimal solution to find the target-watching schedule for sensors that achieves the maximal lifetime. Our solution consists of three steps: 1) computing the maximal lifetime of the surveillance system and a workload matrix by using the linear programming technique; 2) decomposing the workload matrix into a sequence of schedule matrices that can achieve the maximal lifetime; and 3) determining the sensor surveillance trees based on the above obtained schedule matrices, which specify the active sensors and the routes to pass sensed data to the base station. This is the first time in the literature that the problem of maximizing lifetime of sensor surveillance systems has been formulated and the optimal solution has been found.", "paper_title": "Maximizing lifetime of sensor surveillance systems", "paper_id": "WOS:000245863600007"}