{"auto_keywords": [{"score": 0.04129550037956937, "phrase": "rknn_queries"}, {"score": 0.00934002840301969, "phrase": "influence_zone"}, {"score": 0.00481495049065317, "phrase": "k-nearest_neighbors"}, {"score": 0.00462919213721188, "phrase": "clients_c"}, {"score": 0.004167982855788402, "phrase": "client_cac"}, {"score": 0.004024651422626329, "phrase": "k_closest_facilities"}, {"score": 0.0038862297330905836, "phrase": "significant_research_attention"}, {"score": 0.003623453648863547, "phrase": "continuous_monitoring"}, {"score": 0.0035605741849764187, "phrase": "road_networks"}, {"score": 0.0035141291835319682, "phrase": "state-of-the-art_technique"}, {"score": 0.0032621183241997777, "phrase": "so-called_unpruned_region"}, {"score": 0.0031775430407770026, "phrase": "existing_technique"}, {"score": 0.0031498398446368025, "phrase": "expensive_verification"}, {"score": 0.0028731024405707277, "phrase": "novel_concept"}, {"score": 0.00270221723573854, "phrase": "client_c"}, {"score": 0.0021896891011033105, "phrase": "efficient_algorithm"}], "paper_keywords": ["spatial networks", " RkNN queries", " continuous monitoring", " spatial queries"], "paper_abstract": "Given a set of clients C, a set of facilities F and a query qaF, a reverse k-nearest neighbor (RkNN) query retrieves every client caC for which q is one of the k closest facilities. In the past few years, RkNN queries have received significant research attention due to their wide range of applications. In this paper, we study the problem of continuous monitoring of RkNN queries in road networks. The state-of-the-art technique is sensitive toward the movement of clients, e.g. whenever a client that is inside the so-called unpruned region changes its location, the existing technique requires expensive verification of whether the client is an RkNN of q or not. To address this problem, we utilize the novel concept of influence zone, which is a region in the network such that a client c is the RkNN if and only if it lies inside this zone. This significantly improves performance because the problem of continuously monitoring RkNN queries is reduced to the problem of continuously monitoring the clients that are inside this zone. Based on several non-trivial observations, we present an efficient algorithm to compute the influence zone. Our extensive experimental study demonstrates that our algorithm is more than an order of magnitude faster than the state-of-the-art algorithm.", "paper_title": "Efficiently Monitoring Reverse k-Nearest Neighbors in Spatial Networks", "paper_id": "WOS:000350219300003"}