{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "within-device_precision"}, {"score": 0.012465179575725885, "phrase": "sample_size_determination"}, {"score": 0.006486494216388626, "phrase": "sample_size"}, {"score": 0.005156312464517452, "phrase": "dominant_term"}, {"score": 0.005043694614987036, "phrase": "between-day_variance"}, {"score": 0.004955365052776472, "phrase": "simulation_studies"}, {"score": 0.004804476346386651, "phrase": "real_data"}, {"score": 0.004678788141982999, "phrase": "proposed_method"}, {"score": 0.004627244470096107, "phrase": "square_root"}, {"score": 0.004566308708871429, "phrase": "total_variance"}, {"score": 0.004143196873246147, "phrase": "two-stage_nested_random-effects_model"}, {"score": 0.0032342101452939977, "phrase": "pre-specified_claim"}, {"score": 0.003121719509312159, "phrase": "asymptotic_distribution"}, {"score": 0.002999823428906084, "phrase": "modified_large-sample_method"}, {"score": 0.0025018875576502606, "phrase": "john_wiley"}, {"score": 0.0021906130276146325, "phrase": "upper_confidence"}, {"score": 0.0021049977753042253, "phrase": "prespecified_claim"}], "paper_keywords": ["within-device precision", " modified large-sample method", " sample size"], "paper_abstract": "The within-device precision for quantitative assays is the square root of the total variance, which is defined as the sum of the between-day, between-run, and within-run variances under a two-stage nested random-effects model. Currently, methods for point and interval estimations have been proposed. However, the literature on sample size determination for within-device precision is scarce. We propose an approach for the determination of sample size for within-device precision. Our approach is based on the probability for which the 100(1-)% upper confidence bound for the within-device precision smaller than the pre-specified claim is greater than 1-. We derive the asymptotic distribution of the confidence upper bound based on the modified large-sample method for sample size determination and allocation. Our study reveals that the dominant term for sample size determination is the between-day variance. Results of simulation studies are reported. An example with real data is used to illustrate the proposed method. Copyright (c) 2014 John Wiley & Sons, Ltd. We propose an approach for the determination of sample size for within-device precision. Our approach is based on the probability for which the 100(1-)% upper confidence bound for the within-device precision smaller than the prespecified claim is greater than 1-. Our study reveals that the dominant term for sample size determination is the between-day variance. Results of simulation studies are reported. An example with real data is used to illustrate the proposed method.", "paper_title": "Sample size determination for within-device precision", "paper_id": "WOS:000333021100008"}