{"auto_keywords": [{"score": 0.04472882712454684, "phrase": "personality_traits"}, {"score": 0.010523245753624266, "phrase": "non-random_sample"}, {"score": 0.00481495049065317, "phrase": "different_specialties"}, {"score": 0.004425616928975799, "phrase": "school_librarians"}, {"score": 0.004388450908826472, "phrase": "special_collections_librarians"}, {"score": 0.004333283735537634, "phrase": "systems_librarians"}, {"score": 0.0034359094594153304, "phrase": "person-oriented_library_specialties"}, {"score": 0.003144426503333397, "phrase": "normal_personality_inventory"}, {"score": 0.003117986133774198, "phrase": "important_traits"}, {"score": 0.0029639342245188203, "phrase": "two-step_cluster_analysis"}, {"score": 0.0028174721236762317, "phrase": "distinct_personality_traits"}, {"score": 0.002758597251689795, "phrase": "different_types"}, {"score": 0.00266693888510356, "phrase": "\"unadaptive\"_cluster"}, {"score": 0.0025137856138000014, "phrase": "person-oriented_and_technique-oriented_specialties"}, {"score": 0.0022713722522505592, "phrase": "career_counseling"}, {"score": 0.0021682027434117095, "phrase": "library_specialties"}, {"score": 0.0021228663458966813, "phrase": "narrow_work_trait"}, {"score": 0.0021049977753042253, "phrase": "broad_personality_trait_variables"}], "paper_keywords": ["personality", " libraries", " employees", " labour specialization"], "paper_abstract": "Purpose - This paper aims to investigate whether academic reference librarians, archivists, catalogers, distance education librarians, public librarians, records managers, school librarians, special collections librarians, and systems librarians differ in personality traits measured by the Personal Style Inventory: i.e. adaptability, assertiveness, autonomy, conscientiousness, customer service orientation, emotional resilience, extraversion, openness, optimism, teamwork, tough-mindedness, visionary/operational work style, and work drive. It: also aims to investigate whether personality traits of those in person-oriented library specialties differ front those in technique-oriented (technical) library specialties. Design/methodology/approach - A total of 2,075 librarians/information professionals were Surveyed in non-random sample. The Personal Style Inventory is a normal personality inventory assessing important traits for the world of work. It was used in a two-step cluster analysis for the data analysis. Findings - The paper finds that distinct personality traits were associated with the different types of librarians. There was also a \"unadaptive\" cluster composed of individuals from all specialties. There were distinguishing traits associated with person-oriented and technique-oriented specialties. Research limitations/implications - Results were not generalizable due to the non-random sample. Gender was not collected. The research has implications for career counseling. Originality/value - There have been few studies of personality traits in library specialties, none measuring both narrow work trait and broad personality trait variables.", "paper_title": "Personality traits of individuals in different specialties of librarianship", "paper_id": "WOS:000258733800007"}