{"auto_keywords": [{"score": 0.042347347931893105, "phrase": "modelica"}, {"score": 0.00481495049065317, "phrase": "education_and_industrial_applications"}, {"score": 0.004676575291629554, "phrase": "computer-aided_physical_modelling"}, {"score": 0.004542158659382197, "phrase": "computer-aided_approach"}, {"score": 0.004454691230204595, "phrase": "basic_aim"}, {"score": 0.0043830840694466, "phrase": "physical_structure"}, {"score": 0.004340671055146398, "phrase": "real_system"}, {"score": 0.00418862323286423, "phrase": "bond_graphs"}, {"score": 0.003964007795174772, "phrase": "industrial_staff"}, {"score": 0.0038375280115736958, "phrase": "deep_insight"}, {"score": 0.0036671822784770463, "phrase": "dymola-modelica_environment"}, {"score": 0.003392507399258166, "phrase": "thermal_and_radiation_flows"}, {"score": 0.003305584108847751, "phrase": "mineral-wool_production"}, {"score": 0.0030086877092638945, "phrase": "dymola-modelica"}, {"score": 0.0028104345972072534, "phrase": "modelica-like"}, {"score": 0.002659527314613792, "phrase": "historical_cssl_standard"}, {"score": 0.0026337482179592422, "phrase": "important_advantages"}, {"score": 0.002549604441640963, "phrase": "modelica-based_approach"}, {"score": 0.0025331002386232014, "phrase": "true_'physical'_modelling"}, {"score": 0.0024442137370930296, "phrase": "particular_danger"}, {"score": 0.0023815296953640383, "phrase": "basic_modelling_principles"}, {"score": 0.00235843888868088, "phrase": "sophisticated_libraries"}, {"score": 0.002160419006055386, "phrase": "real_reasons"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Education", " Object oriented modelling", " Acausal modelling", " Physical modelling", " Multi-domain modelling", " Thermal processes"], "paper_abstract": "For the purposes of this paper, computer-aided physical modelling means a type of modelling in which a computer-aided approach is used, with the basic aim being to maintain the physical structure of a real system or its topology as much as possible in the model. Bond graphs represent a very efficient and traditional approach. However, new, object-oriented and multi-domain tools based on the Modelica language are more appropriate for industrial staff or for the people who do not have a deep insight into modelling and simulation. In this paper we describe several educational and industrial application projects in the Dymola-Modelica environment: a process-systems library, two mechanical systems (an inverted pendulum and a laboratory helicopter), a model of thermal and radiation flows in buildings and two models of processes in mineral-wool production, i.e., a pendulum system and a recuperator system. We describe some experiences from these projects, but also from a more general use of the Matlab-Simulink and Dymola-Modelica environments over many years. One simple conclusion is that we need to educate with two approaches: a more physical and advanced acausal Modelica-like approach, but also a more traditional causal or block-oriented approach according to the historical CSSL standard. The important advantages and disadvantages of both approaches are described. The Modelica-based approach enables true 'physical' modelling with fully reusable components. However, there is a particular danger, i.e., users occasionally forget some basic modelling principles when using sophisticated libraries. The result is a very complex modelling structure that is relatively inefficient for the simulation and sometimes has many numerical problems. It is usually very difficult to detect the real reasons for that. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Computer-aided physical multi-domain modelling: Some experiences from education and industrial applications", "paper_id": "WOS:000317253700005"}