{"auto_keywords": [{"score": 0.04837093451796987, "phrase": "dom_tree"}, {"score": 0.04774494627841505, "phrase": "xml_document"}, {"score": 0.005101296235828404, "phrase": "memory_space"}, {"score": 0.004240116703465252, "phrase": "desired_nodes"}, {"score": 0.0038194503801108324, "phrase": "basic_operation"}, {"score": 0.003424771860049617, "phrase": "general-purpose_xml_parser"}, {"score": 0.0032725712584012953, "phrase": "arbitrary_node"}, {"score": 0.0031129269142224194, "phrase": "large_dom_tree"}, {"score": 0.0028037753646260937, "phrase": "n_small_xml_documents"}, {"score": 0.002765776659294382, "phrase": "sequentially_the_dom_tree"}, {"score": 0.0027035833504191233, "phrase": "small_n_xml_documents"}, {"score": 0.00266693888510356, "phrase": "later_reference"}, {"score": 0.0021632743048552536, "phrase": "personal_computer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["XML", " DOM", " DOM tree", " Very large XML documents"], "paper_abstract": "Browsing the DOM tree of an XML document is an act of following the links among the nodes of the DOM tree to find some desired nodes without any knowledge for search. When the structure of the XML document is not known to a user, browsing is the basic operation performed for referring the contents of the XML document. If the size of the XML document is very large, however, using a general-purpose XML parser for browsing the DOM tree of the XML document to access arbitrary node may suffer from the lack of memory space for constructing the large DOM tree. To alleviate this problem, we suggest a method to browse the DOM tree of a very large XML document by splitting the XML document into n small XML documents and generating sequentially the DOM tree of each of those small n XML documents. For later reference, the information of some nodes accessed from the DOM tree already generated has been also kept using the concept of their virtual nodes. With our suggested approach, the memory space necessary for browsing the DOM tree of a very large XML document is reduced such that it can be managed by a personal computer. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "DOM tree browsing of a very large XML document: Design and implementation", "paper_id": "WOS:000271681800009"}