{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_grid"}, {"score": 0.02213963634759212, "phrase": "transportation_sector"}, {"score": 0.010191500369847901, "phrase": "power_system"}, {"score": 0.009787140954621229, "phrase": "renewable_energy_sources"}, {"score": 0.004175533280178052, "phrase": "electric_energy_sector"}, {"score": 0.003976373766630594, "phrase": "generation_plug"}, {"score": 0.003817655499320344, "phrase": "hybrid_electric_vehicles"}, {"score": 0.0037866774001097596, "phrase": "electric_vehicles"}, {"score": 0.003755949722774176, "phrase": "vehicle-to-grid_capability"}, {"score": 0.0030139837612215728, "phrase": "forecasted_load"}, {"score": 0.0029652292779277782, "phrase": "unit_commitment"}, {"score": 0.002870066750788841, "phrase": "actual_load"}, {"score": 0.002388817995161952, "phrase": "valid_scenarios"}, {"score": 0.0023026973099101876, "phrase": "solar_energy_sources"}, {"score": 0.00220163445285539, "phrase": "optimization_algorithm"}, {"score": 0.0021483873642607738, "phrase": "expected_cost"}, {"score": 0.0021049977753042253, "phrase": "uc_schedule"}], "paper_keywords": ["Cost", " emissions", " plug-in electric vehicles", " renewable energy", " scenario", " smart grid", " uncertainty", " unit commitment"], "paper_abstract": "The power system and transportation sector are our planet's main sources of greenhouse gas emissions. Renewable energy sources (RESs), mainly wind and solar, can reduce emissions from the electric energy sector; however, they are very intermittent. Likewise, next generation plug-in vehicles, which include plug-in hybrid electric vehicles and electric vehicles with vehicle-to-grid capability, referred to as gridable vehicles (GVs) by the authors, can reduce emissions from the transportation sector. GVs can be used as loads, energy sources (small portable power plants) and energy storage units in a smart grid integrated with renewable energy sources. However, uncertainty surrounds the controllability of GVs. Forecasted load is used in unit commitment (UC); however, the actual load usually differs from the forecasted one. Thus, UC with plug-in vehicles under uncertainty in a smart grid is very complex considering smart charging and discharging to and from various energy sources and loads to reduce both cost and emissions. A set of valid scenarios is considered for the uncertainties of wind and solar energy sources, load and GVs. In this paper, an optimization algorithm is used to minimize the expected cost and emissions of the UC schedule for the set of scenarios. Results are presented indicating that the smart grid has the potential to maximally utilize RESs and GVs to reduce cost and emissions from the power system and transportation sector.", "paper_title": "Resource Scheduling Under Uncertainty in a Smart Grid with Renewables and Plug-in Vehicles", "paper_id": "WOS:000300658400012"}