{"auto_keywords": [{"score": 0.04110621963958909, "phrase": "monotone_input-output_behavior"}, {"score": 0.010306321440193193, "phrase": "monotone_rule_base"}, {"score": 0.010108652858310018, "phrase": "monotone_smooth_rule_base"}, {"score": 0.008499143511677399, "phrase": "linguistic_values"}, {"score": 0.008428772981035608, "phrase": "input_variables"}, {"score": 0.008358980186607136, "phrase": "output_variable"}, {"score": 0.007996318415606263, "phrase": "monotone_model"}, {"score": 0.005056913032903434, "phrase": "linguistic_output_values"}, {"score": 0.0049182122049951284, "phrase": "trapezoidal_or_triangular_membership_functions"}, {"score": 0.00481495049065317, "phrase": "gravity_defuzzification"}, {"score": 0.004774937143916685, "phrase": "first_sight"}, {"score": 0.004516509161825942, "phrase": "monotone_system"}, {"score": 0.004486809125469648, "phrase": "fuzzy_output_partition"}, {"score": 0.004166325872899957, "phrase": "mathematical_operators"}, {"score": 0.004108742905942481, "phrase": "model_output"}, {"score": 0.004040688646993605, "phrase": "membership_functions"}, {"score": 0.004007083686875716, "phrase": "output_domain"}, {"score": 0.003962709690230563, "phrase": "crucial_importance"}, {"score": 0.003875424718379985, "phrase": "mamdani-assilian_models"}, {"score": 0.0036553070575015344, "phrase": "trapezoidal_membership_functions"}, {"score": 0.003614814457621921, "phrase": "fuzzy_partition"}, {"score": 0.0035847385924978603, "phrase": "rule_base"}, {"score": 0.003525332840272254, "phrase": "crisp_output"}, {"score": 0.0032336801561165113, "phrase": "lukasiewicz_t-norm"}, {"score": 0.002974361501127496, "phrase": "monotone_linguistic_fuzzy_models"}, {"score": 0.002860546817196148, "phrase": "single_input_variable"}, {"score": 0.0026754488032585937, "phrase": "membership_degrees"}, {"score": 0.002660574167091781, "phrase": "equal_length"}, {"score": 0.0026384167183586015, "phrase": "latter_restriction"}, {"score": 0.002587429107459106, "phrase": "auxiliary_interpolation_procedure"}], "paper_keywords": ["Center-of-gravity (COG) defuzzification method", " linguistic fuzzy models", " monotonicity", " trapezoidal membership functions"], "paper_abstract": "At first sight, it seems that ordered linguistic values for all input variables and the output variable and a set of rules describing a monotone system are all that is needed for a monotone model. However, this is not the case. In this study, we show that the choice of the mathematical operators used when calculating the model output and the properties of the membership functions in the output domain are also of crucial importance to obtain a monotone input-output behavior. In the Mamdani-Assilian models considered in this study, the linguistic values of the input variables, as well as the output variable, are described by trapezoidal membership functions that form a fuzzy partition, the rule base is monotone, and the crisp output is obtained by the center-of-gravity (COG) defuzzification method. It is verified that for each of the three basic t-norms, i.e., the minimum T(M), the product T(P), and the Lukasiewicz t-norm T(L), a monotone input-output behavior is obtained for any monotone rule base, or at least for any monotone smooth rule base. The outcome of this study is a guideline for designers of monotone linguistic fuzzy models. For the t-norms T(M) and T(L), models with a single input variable show a monotone input-output behavior for any monotone rule base when the linguistic output values in the consequents of the rules are defined by trapezoidal or triangular membership functions with intervals of changing membership degrees of equal length. The latter restriction can easily be bypassed by an auxiliary interpolation procedure. For the t-norm T(P), models with a single input variable show a monotone input-output behavior for any monotone rule base and any fuzzy output partition. When designing a monotone model with more than one input variable, one should opt for the t-norm T(P) and use a monotone smooth rule base. It is shown that monotonicity of models with two input variables that apply T(P) is guaranteed for any monotone smooth rule base and any fuzzy output partition. Finally, it is proved that a monotone input-output behavior is always obtained for models with three input variables that apply T(P) and a monotone smooth rule base when the linguistic output values in the consequents of the rules are defined by trapezoidal or triangular membership functions of identical shape.", "paper_title": "Only Smooth Rule Bases Can Generate Monotone Mamdani-Assilian Models Under Center-of-Gravity Defuzzification", "paper_id": "WOS:000270591900013"}