{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bent-negabent_functions"}, {"score": 0.027336402315230327, "phrase": "completed_maiorana-mcfarland_class"}, {"score": 0.006110036757764189, "phrase": "indirect_sum_construction"}, {"score": 0.0041074234667687875, "phrase": "construction_methods"}, {"score": 0.00385431710959668, "phrase": "algebraic_degree"}, {"score": 0.003663067281537946, "phrase": "constructed_bent-negabent_functions"}, {"score": 0.0032874842270252344, "phrase": "carlet"}, {"score": 0.0028944757265206332, "phrase": "first_significant_attempt"}, {"score": 0.0026307897899760383, "phrase": "bent_functions"}, {"score": 0.0023758843175179702, "phrase": "class_members"}, {"score": 0.0021049977753042253, "phrase": "sufficient_conditions"}], "paper_keywords": ["Stream cipher", " Boolean function", " bent function", " bent-negabent function", " Maiorana-McFarland class"], "paper_abstract": "The problem of constructing bent-negabent functions that do not belong to the completed Maiorana-McFarland class emerges implicitly through a series of construction methods proposed recently. These approaches manage to optimize the algebraic degree of bent-negabent functions, but all of the constructed bent-negabent functions belong to the completed Maiorana-McFarland class. In this paper, we use the indirect sum construction (proposed by Carlet in 2004) for constructing the bent-negabent functions that are not provably contained in this class, which is the first significant attempt in this direction. To achieve this, we first provide a class of bent functions with certain desirable properties that does not belong to this class and demonstrate the existence of the class members. Then, embedding these functions in the framework of the indirect sum construction, we are able to specify sufficient conditions for bent-negabent functions not being contained in the completed Maiorana-McFarland class.", "paper_title": "Constructions of Bent-Negabent Functions and Their Relation to the Completed Maiorana-McFarland Class", "paper_id": "WOS:000350160400026"}