{"auto_keywords": [{"score": 0.0328794942843495, "phrase": "proximal_support_vector_machine"}, {"score": 0.01367084615309851, "phrase": "single-task_learning"}, {"score": 0.00481495049065317, "phrase": "explosive_growth"}, {"score": 0.004593787100061613, "phrase": "visual_recognition"}, {"score": 0.004502126088469323, "phrase": "important_role"}, {"score": 0.00432423070113186, "phrase": "research_attention"}, {"score": 0.0037297918570822876, "phrase": "multi-task_learning"}, {"score": 0.003195236629209403, "phrase": "novel_multi-task_learning_model"}, {"score": 0.0029873281676201565, "phrase": "large-margin_idea"}, {"score": 0.002907992115184249, "phrase": "standard_support_vector_machines"}, {"score": 0.0028498718992429825, "phrase": "looser_constraints"}, {"score": 0.0026111116934081284, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-task learning", " Support vector machines", " Proximal classifiers"], "paper_abstract": "With the explosive growth of the use of imagery, visual recognition plays an important role in many applications and attracts increasing research attention. Given several related tasks, single-task learning learns each task separately and ignores the relationships among these tasks. Different from single-task learning, multi-task learning can explore more information to learn all tasks jointly by using relationships among these tasks. In this paper, we propose a novel multi-task learning model based on the proximal support vector machine. The proximal support vector machine uses the large-margin idea as does the standard support vector machines but with looser constraints and much lower computational cost. Our multi-task proximal support vector machine inherits the merits of the proximal support vector machine and achieves better performance compared with other popular multi-task learning models. Experiments are conducted on several multi-task learning datasets, including two classification datasets and one regression dataset. All results demonstrate the effectiveness and efficiency of our proposed multi-task proximal support vector machine. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-task proximal support vector machine", "paper_id": "WOS:000357246100026"}