{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_fit"}, {"score": 0.01871192481821449, "phrase": "monotonicity_directions"}, {"score": 0.018074208295612643, "phrase": "input_dimensions"}, {"score": 0.010474196952875634, "phrase": "correct_monotonicity_directions"}, {"score": 0.0041102032028337366, "phrase": "sufficient_conditions"}, {"score": 0.0040385352882334235, "phrase": "optimal_linear_model"}, {"score": 0.003968112038249246, "phrase": "least_squares_regression"}, {"score": 0.0034168317227203206, "phrase": "general_case"}, {"score": 0.00306157413357278, "phrase": "gaussian"}, {"score": 0.002753891109273246, "phrase": "gaussian_densities"}, {"score": 0.002717750004930131, "phrase": "special_case"}, {"score": 0.0024451427672857458, "phrase": "regression_function"}, {"score": 0.0024024377855956136, "phrase": "finite_data_set"}, {"score": 0.0022787359717772976, "phrase": "exact_linear_regression"}, {"score": 0.0021901485584955487, "phrase": "sample_regression"}, {"score": 0.0021049977753042253, "phrase": "probabilistic_sense"}], "paper_keywords": ["learning", " hints", " sample complexity", " regression", " isotonic", " order constraints"], "paper_abstract": "Let f be a function on R-d that is monotonic in every variable. There are 2(d) possible assignments to the directions of monotonicity (two per variable). We provide sufficient conditions under which the optimal linear model obtained from a least squares regression on f will identify the monotonicity directions correctly. We show that when the input dimensions are independent, the linear fit correctly identifies the monotonicity directions. We provide an example to illustrate that in the general case, when the input dimensions are not independent, the linear fit may not identify the directions correctly. However, when the inputs are jointly Gaussian, as is often assumed in practice, the linear fit will correctly identify the monotonicity directions, even if the input dimensions are dependent. Gaussian densities are a special case of a more general class of densities (Mahalanobis densities) for which the result holds. Our results hold when f is a classification or regression function. If a finite data set is sampled from the function, we show that if the exact linear regression would have yielded the correct monotonicity directions, then the sample regression will also do so asymptotically (in a probabilistic sense). This result holds even if the data are noisy.", "paper_title": "A linear fit gets the correct monotonicity directions", "paper_id": "WOS:000251457500002"}