{"auto_keywords": [{"score": 0.04738301995810031, "phrase": "relevance_judgments"}, {"score": 0.010612387000973441, "phrase": "human_assessors"}, {"score": 0.004764542405129454, "phrase": "large_scale_information_retrieval_evaluation_experimentation."}, {"score": 0.004472935829694716, "phrase": "large_scale_test_collections"}, {"score": 0.004402854153653114, "phrase": "automated_method"}, {"score": 0.004311109608629196, "phrase": "similar_set"}, {"score": 0.004068510313497539, "phrase": "human_efforts"}, {"score": 0.0037397086147485897, "phrase": "participating_systems"}, {"score": 0.003700517478835807, "phrase": "trec"}, {"score": 0.0035853745478488254, "phrase": "chosen_metrics"}, {"score": 0.0022783523466965187, "phrase": "pool_depth"}, {"score": 0.002219040041886641, "phrase": "cutoff_percentage"}, {"score": 0.0021385822825864425, "phrase": "alternate_way"}, {"score": 0.0021049977753042253, "phrase": "consistent_relevance_judgments"}], "paper_keywords": ["Information retrieval", " relevance judgments", " retrieval evaluation", " large scale experimentation"], "paper_abstract": "Inconsistent judgments by various human assessors' compromises the reliability of the relevance judgments generated for large scale test collections. An automated method that creates a similar set of relevance judgments (pseudo relevance judgments) that eliminate the human efforts and errors introduced in creating relevance judgments is investigated in this study. Traditionally, the participating systems in TREC are measured by using a chosen metrics and ranked according to its performance scores. In order to generate these scores, the documents retrieved by these systems for each topic are matched with the set of relevance judgments (often assessed by humans). In this study, the number of occurrences of each document per topic from the various runs will be used with an assumption, the higher the number of occurrences of a document, the possibility of the document being relevant is higher. The study proposesa method with a pool depth of 100 using the cutoff percentage of >35% that could provide an alternate way of generating consistent relevance judgments without the involvement of human assessors.", "paper_title": "RELEVANCE JUDGMENTS EXCLUSIVE OF HUMAN ASSESSORS IN LARGE SCALE INFORMATION RETRIEVAL EVALUATION EXPERIMENTATION", "paper_id": "WOS:000338772100001"}