{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "log-polar_images"}, {"score": 0.020198457535548123, "phrase": "cartesian_images"}, {"score": 0.004688321299229397, "phrase": "effective_way"}, {"score": 0.004626255242038005, "phrase": "image_contents"}, {"score": 0.004565007074039171, "phrase": "particular_kinds"}, {"score": 0.004308791766002289, "phrase": "previous_literature"}, {"score": 0.0036229421570951807, "phrase": "proposed_algorithm"}, {"score": 0.003543273649210823, "phrase": "projection_signals"}, {"score": 0.0033442114331500407, "phrase": "corresponding_projection_signals"}, {"score": 0.0027131212233443137, "phrase": "careful_analysis"}, {"score": 0.0023739340417191965, "phrase": "mmm"}, {"score": 0.0023113506171584157, "phrase": "inherent_difficulties"}, {"score": 0.002250415129116109, "phrase": "space-variant_nature"}, {"score": 0.002200861826643147, "phrase": "significant_finding"}, {"score": 0.0021049977753042253, "phrase": "comparable_estimation_performance"}], "paper_keywords": ["motion analysis", " radon transform", " log-polar images", " parametric motion", " affine motion model", " projections"], "paper_abstract": "Image projections provide an effective way of describing image contents or estimate particular kinds of motion. However, most (if not all) of previous literature on projections has been done on Cartesian images. In contrast, the work described in this paper is aimed at exploring how projections can be defined on log-polar images and how they perform in estimating motion. In the proposed algorithm, a set of projection signals is computed in two consecutive frames. Then, 1D affine motion between each pair of corresponding projection signals is estimated. Finally, 2D image affine motion is derived from the set of estimated 1D motion parameters, using a 2D-1D motion mapping model (MMM). A reduced, 5-parameter, affine motion model can be estimated with this MMM. The algorithm is implemented in both, log-polar and Cartesian images. Synthetic motion is used for a careful analysis of the strengths and weaknesses of the algorithm. The comparison of the results with log-polar and Cartesian images reveal that the limitations of the approach are due to the MMM, rather than to the inherent difficulties and distortions introduced by the space-variant nature of log-polar images. Another significant finding is that Cartesian images require much more pixels than log-polar images to get comparable estimation performance.", "paper_title": "Motion analysis with the radon transform on log-polar images", "paper_id": "WOS:000252167900003"}