{"auto_keywords": [{"score": 0.035476792643882704, "phrase": "ir_drop_constraint"}, {"score": 0.01704316333743472, "phrase": "power_tsvs"}, {"score": 0.00481495049065317, "phrase": "three-dimensional_power_delivery_network"}, {"score": 0.003981106369547929, "phrase": "higher_integration_density"}, {"score": 0.0038946650372062783, "phrase": "power_consumption"}, {"score": 0.003810093416457147, "phrase": "fabrication_cost"}, {"score": 0.002863652837038965, "phrase": "power-aware_floorplanning"}, {"score": 0.0028220038404484196, "phrase": "specific_power_patterns"}, {"score": 0.0026419338604879404, "phrase": "authors'_methodology"}, {"score": 0.0026035011274172753, "phrase": "high_power-consuming_blocks"}, {"score": 0.0025468951021098717, "phrase": "dedicated_pattern_area"}, {"score": 0.0022321322970228308, "phrase": "simulation_results"}, {"score": 0.0021676351850669017, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "total_number"}], "paper_keywords": [""], "paper_abstract": "Three-dimensional (3D) integrated circuits, which use a vertically stacked design of 2D planar chips in a 3D arrangement using through-silicon-via (TSV) technology have been developed to minimise chip footprint, enable higher integration density, decrease power consumption and reduce fabrication cost. Floorplanning without considering power can increase the number of power TSVs and bumps needed to solve IR drop constraint in 3D power delivery network. In this study, the authors propose a methodology for minimising the power TSVs and bumps based on power-aware floorplanning using specific power patterns to solve IR drop constraint on the 3D power delivery network. The authors' methodology moves high power-consuming blocks to the dedicated pattern area which is able to minimise the number of power TSVs and bumps while solving the IR drop constraint. The simulation results show that the proposed method can reduce the total number of power TSVs and bumps by 13.7 and 12.2%, respectively, after power-aware floorplanning while solving the IR drop constraint.", "paper_title": "Power-aware floorplanning-based power through-silicon-via technology and bump minimisation for three-dimensional power delivery network", "paper_id": "WOS:000341185100002"}