{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "left_ventricle_dynamical_behavior"}, {"score": 0.004733901576706854, "phrase": "free-form_deformations_model"}, {"score": 0.0036691380448651443, "phrase": "ventricular_function"}, {"score": 0.0035666632046674153, "phrase": "computational_model"}, {"score": 0.0030433302702291116, "phrase": "left_ventricle_volume"}, {"score": 0.0029920129598858545, "phrase": "radial_contraction"}, {"score": 0.0027480831196871093, "phrase": "mr-tagging_images"}, {"score": 0.0025965853546625352, "phrase": "mechanical_parameters"}, {"score": 0.0025383451160985488, "phrase": "additional_time"}, {"score": 0.0024534188907003726, "phrase": "msct"}, {"score": 0.0023579143175099324, "phrase": "lv_wall_surfaces"}, {"score": 0.0022919762167777427, "phrase": "first_results"}, {"score": 0.002253299769886694, "phrase": "good_match"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Simulation", " Free-form deformation", " Left ventricle"], "paper_abstract": "A computational 4D (3D + time) model for simulating the dynamical shape of the left ventricle (LV) based on free-form deformations (FFD) techniques is described. The simulation model is useful as a teaching tool for understanding the normal left ventricle motion. The model is also useful for initializing 3D segmentation algorithms and for understanding the relation between pathologies and variation of parameters defining the ventricular function. Validation of this computational model is performed by synthesizing 4D sequences of the left ventricle, comprising the interval going from end-systole to end-diastole. From the resulting 4D shapes, several mechanical parameters Such as the left ventricle volume, the radial contraction and torsion are calculated and compared with results of works previously reported based in MR-tagging images. A comparison is also performed with respect to mechanical parameters extracted from the additional time instants in the same multislice computerized tomography (MSCT) database used for extracting the LV wall surfaces required for initialization. First results show a good match between parameters compared. (C) 2007 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Inferring the left ventricle dynamical behavior using a free-form deformations model", "paper_id": "WOS:000264093700004"}