{"auto_keywords": [{"score": 0.03716412331153162, "phrase": "ip_layer"}, {"score": 0.004274396662662802, "phrase": "dynamic_querying"}, {"score": 0.0041677440361312604, "phrase": "random_nature"}, {"score": 0.004034504342397309, "phrase": "underlying_communications_network"}, {"score": 0.0032367108248520277, "phrase": "better_match"}, {"score": 0.0030659380503460613, "phrase": "random_structure"}, {"score": 0.00283158908387463, "phrase": "random_overlay"}, {"score": 0.002811191663575046, "phrase": "randomly_connected_neighborhoods"}, {"score": 0.002790940765338191, "phrase": "topology_awareness"}, {"score": 0.0026918477311176376, "phrase": "negative_effect"}, {"score": 0.002558985036330194, "phrase": "extensive_simulations"}, {"score": 0.00251313643823856, "phrase": "ip_router_level"}, {"score": 0.0024950272594582673, "phrase": "autonomous_system_level"}, {"score": 0.0024503250425484306, "phrase": "ita"}, {"score": 0.0024326641072463157, "phrase": "communication_latencies"}, {"score": 0.0023042157412517333, "phrase": "ip_network_messages"}, {"score": 0.00216680270402079, "phrase": "traffic_load"}, {"score": 0.0021049977753042253, "phrase": "ip_network_layer"}], "paper_keywords": ["Peer-to-peer", " unstructured overlay network", " topology awareness", " self-(star) properties", " IP network layer", " communication latency"], "paper_abstract": "One of the most appealing characteristics of unstructured P2P overlays is their enhanced self-(star) properties, which results from their loose, random structure. In addition, most of the algorithms which make searching in unstructured P2P systems scalable, such as dynamic querying and 1-hop replication, rely on the random nature of the overlay to function efficiently. The underlying communications network (i.e., the Internet), however, is not as randomly constructed. This leads to a mismatch between the distance of two peers on the overlay and the hosts they reside on at the IP layer, which in turn leads to its misuse. The crux of the problem arises from the fact that any effort to provide a better match between the overlay and the IP layer will inevitably lead to a reduction in the random structure of the P2P overlay, with many adverse results. With this in mind, we propose ITA, an algorithm which creates a random overlay of randomly connected neighborhoods providing topology awareness to P2P systems, while at the same time has no negative effect on the self-(star) properties or the operation of the other P2P algorithms. Using extensive simulations, both at the IP router level and autonomous system level, we show that ITA reduces communication latencies by as much as 50 percent. Furthermore, it not only reduces by 20 percent the number of IP network messages which is critical for ISPs carrying the burden of transporting P2P traffic, but also distributes the traffic load more evenly on the routers of the IP network layer.", "paper_title": "ITA: Innocuous Topology Awareness for Unstructured P2P Networks", "paper_id": "WOS:000321153600011"}