{"auto_keywords": [{"score": 0.04203400118778606, "phrase": "twitter"}, {"score": 0.012336998091594855, "phrase": "facebook"}, {"score": 0.005718758254164407, "phrase": "flickr"}, {"score": 0.00481495049065317, "phrase": "back-channel_communication"}, {"score": 0.004619134710069517, "phrase": "new_web_mashup_system"}, {"score": 0.003863568356785813, "phrase": "hurricane_katrina"}, {"score": 0.003721735062704032, "phrase": "virginia_polytechnic_university"}, {"score": 0.003482276061796395, "phrase": "emergency_purposes"}, {"score": 0.003340475943517995, "phrase": "georeferenced_photos"}, {"score": 0.0030231983220281836, "phrase": "emergency_professionals"}, {"score": 0.002948689937518561, "phrase": "emergency_situations"}, {"score": 0.0029121251930855664, "phrase": "multiple_web_channels"}, {"score": 0.002816814445002924, "phrase": "visual_system"}, {"score": 0.0024149139610228887, "phrase": "analytic_evaluation"}, {"score": 0.0022877332844249065, "phrase": "usability_evaluation"}, {"score": 0.002259346051668556, "phrase": "expert_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mashups", " Collaboration systems", " Emergency management"], "paper_abstract": "In this paper we present a new web mashup system for helping people and professionals to retrieve information about emergencies and disasters. Today, the use of the web during emergencies, is confirmed by the employment of systems like Flickr, Twitter or Facebook as demonstrated in the cases of Hurricane Katrina, the July 7, 2005 London bombings, and the April 16, 2007 shootings at Virginia Polytechnic University. Many pieces of information are currently available on the web that can be useful for emergency purposes and range from messages on forums and blogs to georeferenced photos. We present here a system that, by mixing information available on the web, is able to help both people and emergency professionals in rapidly obtaining data on emergency situations by using multiple web channels. In this paper we introduce a visual system, providing a combination of tools that demonstrated to be effective in such emergency situations, such as spatio/temporal search features, recommendation and filtering tools, and storyboards. We demonstrated the efficacy of our system by means of an analytic evaluation (comparing it with others available on the web), an usability evaluation made by expert users (students adequately trained) and an experimental evaluation with 34 participants. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "eStorys: A visual storyboard system supporting back-channel communication for emergencies", "paper_id": "WOS:000289587200004"}