{"auto_keywords": [{"score": 0.04576865007383599, "phrase": "relay_nodes"}, {"score": 0.008800529175928867, "phrase": "minimum_number"}, {"score": 0.007094238917024478, "phrase": "wireless_sensor_networks"}, {"score": 0.006727663502771092, "phrase": "wireless_sensor_network"}, {"score": 0.006124609670889302, "phrase": "relay_node_placement_problem"}, {"score": 0.00481495049065317, "phrase": "constrained_relay_node_placement"}, {"score": 0.004293840838533456, "phrase": "sensor_nodes"}, {"score": 0.004204543497976196, "phrase": "sensor_node"}, {"score": 0.003736004578001584, "phrase": "unconstrained_version"}, {"score": 0.00342816445816304, "phrase": "physical_constraints"}, {"score": 0.003237116128682586, "phrase": "constrained_versions"}, {"score": 0.0030441844088874366, "phrase": "candidate_locations"}, {"score": 0.002994701080666466, "phrase": "connected_relay_node_placement_problem"}, {"score": 0.002770389097966904, "phrase": "base_station"}, {"score": 0.0027365364488693656, "phrase": "bidirectional_path"}, {"score": 0.0026920404458807444, "phrase": "survivable_relay_node_placement_problem"}, {"score": 0.0022111720236287547, "phrase": "small_approximation_ratios"}, {"score": 0.00219311232069446, "phrase": "extensive_numerical_results"}, {"score": 0.0021049977753042253, "phrase": "optimal_solutions"}], "paper_keywords": ["Approximation algorithms", " connectivity and survivability", " relay node placement", " wireless sensor networks (WSNs)"], "paper_abstract": "One approach to prolong the lifetime of a wireless sensor network (WSN) is to deploy some relay nodes to communicate with the sensor nodes, other relay nodes, and the base stations. The relay node placement problem for wireless sensor networks is concerned with placing a minimum number of relay nodes into a wireless sensor network to meet certain connectivity or survivability requirements. Previous studies have concentrated on the unconstrained version of the problem in the sense that relay nodes can be placed anywhere. In practice, there may be some physical constraints on the placement of relay nodes. To address this issue, we study constrained versions of the relay node placement problem, where relay nodes can only be placed at a set of candidate locations. In the connected relay node placement problem, we want to place a minimum number of relay nodes to ensure that each sensor node is connected with a base station through a bidirectional path. In the survivable relay node placement problem, we want to place a minimum number of relay nodes to ensure that each sensor node is connected with two base stations (or the only base station in case there is only one base station) through two node-disjoint bidirectional paths. For each of the two problems, we discuss its computational complexity and present a framework of polynomial time O(1)-approximation algorithms with small approximation ratios. Extensive numerical results show that our approximation algorithms can produce solutions very close to optimal solutions.", "paper_title": "Constrained Relay Node Placement in Wireless Sensor Networks: Formulation and Approximations", "paper_id": "WOS:000276685300008"}