{"auto_keywords": [{"score": 0.004389451298343287, "phrase": "agile_isd._objective"}, {"score": 0.004052823656906696, "phrase": "agile_isd"}, {"score": 0.0037299855191553, "phrase": "grounded_theory_approach"}, {"score": 0.0036826452656927877, "phrase": "research_phase"}, {"score": 0.003670904035061963, "phrase": "qualitative_interviews"}, {"score": 0.003589753165698119, "phrase": "grounded_theory"}, {"score": 0.003532885029484907, "phrase": "careful_data_analysis"}, {"score": 0.0034218279328844746, "phrase": "common_themes"}, {"score": 0.003378385493203297, "phrase": "global_theory"}, {"score": 0.0033248546272754936, "phrase": "empirical_data"}, {"score": 0.0031794236141757, "phrase": "desperate_rush"}, {"score": 0.0027800937731919276, "phrase": "agile_and_plan-driven_approaches"}, {"score": 0.002675477598833661, "phrase": "two-stage_pattern"}, {"score": 0.0026499429068956686, "phrase": "dramatic_changes"}, {"score": 0.002591303221962211, "phrase": "established_practices"}, {"score": 0.002574788013427524, "phrase": "process_adaptations"}, {"score": 0.0024620842899061614, "phrase": "cyclical_history"}, {"score": 0.0024463906152005772, "phrase": "punctuated_process_evolution"}, {"score": 0.0023846075213405284, "phrase": "current_practices"}, {"score": 0.0022656723439661163, "phrase": "possible_next_cycle"}, {"score": 0.002251227801482381, "phrase": "software_process_evolution"}, {"score": 0.0022084431489676993, "phrase": "dual_goal"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Agile information systems development", " Agility", " Grounded theory"], "paper_abstract": "Context: Agile information systems development (ISD) has received much attention from both the practitioner and researcher community over the last 10-15 years. However, it is still unclear what precisely constitutes agile ISD. Objective: Based on four empirical studies conducted over a 10-year time period from 1999 to 2008 the objective of this paper is to show how the meaning and practice of agile ISD has evolved over time and on this basis to speculate about what comes next. Method: Four phases of research has been conducted, using a grounded theory approach. For each research phase qualitative interviews were held in American and/or Danish companies and a grounded theory was inductively discovered by careful data analysis. Subsequently, the four unique theories have been analyzed for common themes, and a global theory was identified across the empirical data. Results: In 1999 companies were developing software at high-speed in a desperate rush to be first-to-market. In 2001 a new high-speed/quick results development process had become established practice. In 2003 changes in the market created the need for a more balanced view on speed and quality, and in 2008 companies were successfully combining agile and plan-driven approaches to achieve the benefits of both. The studies reveal a two-stage pattern in which dramatic changes in the market causes disruption of established practices and process adaptations followed by consolidation of lessons learnt into a once again stable software development process. Conclusion: The cyclical history of punctuated process evolution makes it possible to distinguish pre-agility from current practices (agility), and on this basis, to speculate about post-agility: a possible next cycle of software process evolution concerned with proactively pursuing the dual goal of agility and alignment through a diversity of means. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Post-agility: What follows a decade of agility?", "paper_id": "WOS:000288919900011"}