{"auto_keywords": [{"score": 0.03728661882776103, "phrase": "data_accesses"}, {"score": 0.01437317732735247, "phrase": "energy_efficiency"}, {"score": 0.01288658468773331, "phrase": "energy_consumption"}, {"score": 0.004777214679969785, "phrase": "massive_energy_consumption"}, {"score": 0.0047026237903774895, "phrase": "major_factor"}, {"score": 0.004468117364177126, "phrase": "numerous_academic_and_industrial_efforts"}, {"score": 0.004363846362238565, "phrase": "datacenter_infrastructures"}, {"score": 0.0042452552248398445, "phrase": "state-of-the-art_datacenter_facilities"}, {"score": 0.003405109584265324, "phrase": "many-core_severs"}, {"score": 0.0028857130140890787, "phrase": "main_memory"}, {"score": 0.002785133616425661, "phrase": "server_applications"}, {"score": 0.0025137856138000014, "phrase": "hardware-software_cooperation"}, {"score": 0.002445347925313158, "phrase": "chip_memory"}, {"score": 0.0023415390666563177, "phrase": "embedded_systems"}, {"score": 0.0022070310530794097, "phrase": "large_set"}], "paper_keywords": ["Energy consumption", " Embedded systems", " Main memory", " Storage devices", " Register file"], "paper_abstract": "Massive energy consumption has become a major factor for the design and implementation of datacenters. This has led to numerous academic and industrial efforts to improve the energy efficiency of datacenter infrastructures. As a result, in state-of-the-art datacenter facilities, over 80% of power is now consumed by servers themselves. Historically, the processor has dominated energy consumption in the server. However, as processors have become more energy efficient, their contribution has been decreasing. On the contrary, energy consumed by data accesses and storage is growing, since multi-and many-core severs are requiring increased main memory bandwidth/capacity, large register file and large-scale storage system. Accordingly, energy consumed by data accesses and storage approaching or even surpassing that consumed by processors in many servers. For example, it has been reported that main memory contributes to as much as 40-46% of total energy consumption in server applications. In this talk, we present our continuing efforts to improve the energy efficiency of data accesses and storage. We study on a series of approaches with hardware-software cooperation to save energy consumption of on-chip memory, register file, main memory and storage devices for embedded systems, multi-and many-core servers, respectively. Experiments with a large set of workloads show the accuracy of our analytical models and the effectiveness of our optimizations.", "paper_title": "Energy Efficient Data Access and Storage through HW/SW Co-design", "paper_id": "WOS:000341937800010"}