{"auto_keywords": [{"score": 0.038321180488345985, "phrase": "template_space"}, {"score": 0.007152368807539886, "phrase": "diffusion_tensor_fields"}, {"score": 0.006546935280155617, "phrase": "underlying_fibers"}, {"score": 0.006068700253456435, "phrase": "warped_image"}, {"score": 0.005132104052784037, "phrase": "backward_mapping"}, {"score": 0.004364833543615155, "phrase": "original_image"}, {"score": 0.004337276328199398, "phrase": "existing_algorithms"}, {"score": 0.004122964978180509, "phrase": "local_deformations"}, {"score": 0.003261133560558666, "phrase": "original_imaging_space"}, {"score": 0.002845466319548362, "phrase": "directional_orientation"}, {"score": 0.0028274743316389437, "phrase": "fiber_tracts"}, {"score": 0.0026036473098881344, "phrase": "forward_and_backward_mapping"}, {"score": 0.0025626745650279346, "phrase": "novel_method"}, {"score": 0.002538400273615248, "phrase": "spatial_normalization"}, {"score": 0.002522344964242888, "phrase": "diffusion_tensor"}, {"score": 0.002412758703672514, "phrase": "one-to-one_correspondences"}, {"score": 0.002359759876402679, "phrase": "dt_datasets"}, {"score": 0.0021251363422701446, "phrase": "warping_method"}, {"score": 0.0021049977753042253, "phrase": "procrustean_estimation"}], "paper_keywords": ["bijection", " diffusion tensor image (DTI)", " DTI warping", " procrustean estimation"], "paper_abstract": "To warp diffusion tensor fields accurately, tensors must be reoriented in the space to which the tensors are warped based on both the local deformation field and the orientation of the underlying fibers in the original image. Existing algorithms for warping tensors typically use forward mapping deformations in an attempt to ensure that the local deformations in the warped image remains true to the orientation of the underlying fibers; forward mapping, however, can also create \"seams\" or gaps and consequently artifacts in the warped image by failing to define accurately the voxels in the template space where the magnitude A the deformation is large (e.g., IJacobianj > 1). Backward mapping, in contrast, defines voxels in the template space by napping them back to locations in the original imaging space. backward mapping allows every voxel in the template space to be defined without the creation of seams, including voxels in which the deformation is extensive. Backward mapping, however, cannot reorient tensors in the template space because information about the directional orientation of fiber tracts is contained in the wiginal, unwarped imaging space only, and backward mapping alone cannot transfer that information to the template space. To combine the advantages of forward and backward mapping, we propose a novel method for the spatial normalization of diffusion tensor (DT) fields that uses a bijection (a bidirectional mapping with one-to-one correspondences between image spaces) to warp DT datasets seamlessly from one imaging space to another. Once the bijection has been achieved and tensors have been correctly relocated to the template space, we can appropriately reorient tensors in the template space using a warping method based on Procrustean estimation.", "paper_title": "Seamless warping of diffusion tensor fields", "paper_id": "WOS:000253558400001"}