{"auto_keywords": [{"score": 0.024573236387459566, "phrase": "real_liver_patient_cases"}, {"score": 0.00481495049065317, "phrase": "liver_ct_images"}, {"score": 0.004633429997452688, "phrase": "ct_scans"}, {"score": 0.00429057323623293, "phrase": "ambiguous_language"}, {"score": 0.004188702178897384, "phrase": "subjective_reporting_styles"}, {"score": 0.004069631519385246, "phrase": "standardization_efforts"}, {"score": 0.003916098498242888, "phrase": "radiology_terms"}, {"score": 0.003750260412839128, "phrase": "standard_vocabularies"}, {"score": 0.0036611708297251645, "phrase": "consistent_annotation"}, {"score": 0.0034892684482068347, "phrase": "intelligent_applications"}, {"score": 0.0025034338848015166, "phrase": "similar_liver_patient_cases"}, {"score": 0.00247944491239733, "phrase": "onlira"}, {"score": 0.0022626835039082746, "phrase": "illustration_purposes"}, {"score": 0.0021049977753042253, "phrase": "semantic_queries"}], "paper_keywords": ["Liver", " ontology", " radiology"], "paper_abstract": "Radiologists inspect CT scans and record their observations in reports to communicate with physicians. These reports may suffer from ambiguous language and inconsistencies resulting from subjective reporting styles, which present challenges in interpretation. Standardization efforts, such as the lexicon RadLex for radiology terms, aim to address this issue by developing standard vocabularies. While such vocabularies handle consistent annotation, they fall short in sufficiently processing reports for intelligent applications. To support such applications, the semantics of the concepts as well as their relationships must be modeled, for which, ontologies are effective. They enable the software to make inferences beyond what is present in the reports. This paper presents the open-source ontology ONLIRA (Ontology of the Liver for Radiology), which is developed to support such intelligent applications, such as identifying and ranking similar liver patient cases. ONLIRA is introduced in terms of its concepts, properties, and relations. Examples of real liver patient cases are provided for illustration purposes. The ontology is evaluated in terms of its ability to express real liver patient cases and address semantic queries.", "paper_title": "Semantic Description of Liver CT Images: An Ontological Approach", "paper_id": "WOS:000340119000027"}