{"auto_keywords": [{"score": 0.03498419501791243, "phrase": "top_management_participation"}, {"score": 0.022720979095709234, "phrase": "institutional_pressures"}, {"score": 0.022127610805744814, "phrase": "top_management"}, {"score": 0.01491906894389782, "phrase": "erp_usage"}, {"score": 0.010612387000973441, "phrase": "enterprise_systems"}, {"score": 0.007521379294992765, "phrase": "top_management_beliefs"}, {"score": 0.005904718672591901, "phrase": "normative_pressures"}, {"score": 0.004441059405327222, "phrase": "theoretical_model"}, {"score": 0.0042650992966174065, "phrase": "post-implementation_stage"}, {"score": 0.003987126862293129, "phrase": "external_institutional_pressures"}, {"score": 0.0038636556112977226, "phrase": "enterprise_resource_planning"}, {"score": 0.003677280504320636, "phrase": "survey_data"}, {"score": 0.003563370084662192, "phrase": "erp_systems"}, {"score": 0.003499864176875713, "phrase": "partial_least_squares_analyses"}, {"score": 0.0034529760173586583, "phrase": "mimetic_pressures"}, {"score": 0.0032716011062067286, "phrase": "erp_assimilation_process"}, {"score": 0.0029901699209266435, "phrase": "coercive_pressures"}, {"score": 0.00247529638625566, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "integration_processes"}], "paper_keywords": ["enterprise resource planning", " technology assimilation", " innovation diffusion", " top management", " institutional theory"], "paper_abstract": "We develop and test a theoretical model to investigate the assimilation of enterprise systems in the post-implementation stage within organizations. Specifically, this model explains how top management mediates the impact of external institutional pressures on the degree of usage of enterprise resource planning (ERP) systems. The hypotheses were tested using survey data from companies that have already implemented ERP systems. Results from partial least squares analyses suggest that mimetic pressures positively affect top management beliefs, which then positively affects top management participation in the ERP assimilation process. In turn, top management participation is confirmed to positively affect the degree of ERP usage. Results also suggest that coercive pressures positively affect top management participation without the mediation of top management beliefs. Surprisingly, we do not find support for our hypothesis that top management participation mediates the effect of normative pressures on ERP usage, but instead we find that normative pressures directly affect ERP usage. Our findings highlight the important role of top management in mediating the effect of institutional pressures on IT assimilation. We confirm that institutional pressures, which are known to be important for IT adoption and implementation, also contribute to post-implementation assimilation when the integration processes are prolonged and outcomes are dynamic and uncertain.", "paper_title": "Assimilation of enterprise systems: The effect of institutional pressures and the mediating role of top management", "paper_id": "WOS:000244601400005"}