{"auto_keywords": [{"score": 0.03485284372417499, "phrase": "optimal_route"}, {"score": 0.01031998042790526, "phrase": "mara"}, {"score": 0.00481495049065317, "phrase": "dual-channel_wireless_sensor_network"}, {"score": 0.004734448316824488, "phrase": "mobile_agent_routing_algorithm"}, {"score": 0.004351595642056769, "phrase": "dual-channel_communication_model"}, {"score": 0.004278807087784626, "phrase": "two-layer_network_combination_optimization_strategy"}, {"score": 0.003910595307634916, "phrase": "multicast_suppression"}, {"score": 0.0038668462001710314, "phrase": "channel_competitive_process"}, {"score": 0.00378080526397273, "phrase": "blocking_probability"}, {"score": 0.0036759314172445934, "phrase": "error_rate"}, {"score": 0.0036347979916389467, "phrase": "packet_transmission"}, {"score": 0.003378385493203297, "phrase": "restore_rule"}, {"score": 0.0029681091946289757, "phrase": "fail_nodes"}, {"score": 0.002853396755102163, "phrase": "original_optimal_route"}, {"score": 0.0021773853011112882, "phrase": "ant_agents"}], "paper_keywords": [""], "paper_abstract": "A mobile agent routing algorithm (MARA) is presented in this paper, and then based on the dual-channel communication model, the two-layer network combination optimization strategy is also proposed. Since this strategy deals with the collision between packets and the multicast suppression in channel competitive process well, the blocking probability of network and the error rate of packet transmission can be cut down by utilizing this strategy. Furthermore, a restore rule for the failure optimal route is presented too. By using this rule, the optimal route can restore quickly in the local of fail nodes and most of the information of original optimal route can be reserved. Compared with other existing algorithms like ant colony optimization-based dynamic energy-efficient mobile agent routing algorithm (ADEEMA) and mobile agent-based wireless sensor network (MAWSN), simulation results show that MARA performs better in improving the success rate of packet transmission and cutting down the delay of communication. The success rate of packet transmission is improved 15%. Simultaneously, this algorithm can keep the ant agents away from the nodes with less residual energy in searching for the optimal route. This way can make the energy of each nodes on the optimal route overall decline and hence improve the lifetime of network.", "paper_title": "A Mobile Agent Routing Algorithm in Dual-Channel Wireless Sensor Network", "paper_id": "WOS:000304937100001"}