{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geogebra"}, {"score": 0.008798668489833121, "phrase": "automated_deduction_tools"}, {"score": 0.004753512932910936, "phrase": "open-source_educational_mathematics_software_tool"}, {"score": 0.004419819325202464, "phrase": "computer_algebra"}, {"score": 0.004144810537437608, "phrase": "student_experiments"}, {"score": 0.004056981775766067, "phrase": "formal_reasoning"}, {"score": 0.0038868464660354626, "phrase": "whole_new_range"}, {"score": 0.0037238193456845124, "phrase": "theorem_proving"}, {"score": 0.003598317040926701, "phrase": "rather_mature_stage"}, {"score": 0.003388745581055085, "phrase": "different_automated_provers"}, {"score": 0.0032050528424273994, "phrase": "current_achievements"}, {"score": 0.002879237498994052, "phrase": "recent_and_forthcoming_changes"}, {"score": 0.0027583557819362034, "phrase": "user_interface"}, {"score": 0.0026425357050743003, "phrase": "educational_scenarios"}, {"score": 0.002575385171755899, "phrase": "automated_reasoning_features"}, {"score": 0.0024566655761509276, "phrase": "present_work"}, {"score": 0.002404522326122611, "phrase": "current_performance"}], "paper_keywords": ["Secondary education", " Interactive learning environments", " Intelligent tutoring systems", " Automatic theorem proving"], "paper_abstract": "GeoGebra is an open-source educational mathematics software tool, with millions of users worldwide. It has a number of features (integration of computer algebra, dynamic geometry, spreadsheet, etc.), primarily focused on facilitating student experiments, and not on formal reasoning. Since including automated deduction tools in GeoGebra could bring a whole new range of teaching and learning scenarios, and since automated theorem proving and discovery in geometry has reached a rather mature stage, we embarked on a project of incorporating and testing a number of different automated provers for geometry in GeoGebra. In this paper, we present the current achievements and status of this project, and discuss various relevant challenges that this project raises in the educational, mathematical and software contexts. We will describe, first, the recent and forthcoming changes demanded by our project, regarding the implementation and the user interface of GeoGebra. Then we present our vision of the educational scenarios that could be supported by automated reasoning features, and how teachers and students could benefit from the present work. In fact, current performance of GeoGebra, extended with automated deduction tools, is already very promising-many complex theorems can be proved in less than 1 second. Thus, we believe that many new and exciting ways of using GeoGebra in the classroom are on their way.", "paper_title": "Automated Theorem Proving in GeoGebra: Current Achievements", "paper_id": "WOS:000354485700002"}