{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "polyhedron_problem"}, {"score": 0.00471071771178029, "phrase": "previous_work"}, {"score": 0.004245476558619167, "phrase": "three-dimensional_polyhedron"}, {"score": 0.004176321608449849, "phrase": "single_determining_triangle"}, {"score": 0.0035435867326548665, "phrase": "horn's_work"}, {"score": 0.0033363396054797044, "phrase": "determining_triangles"}, {"score": 0.0028460640294160383, "phrase": "octree-based_ray_crossing_methods"}, {"score": 0.002564505790176378, "phrase": "time_and_memory_requirements"}, {"score": 0.002285527382381719, "phrase": "multi-material_models"}, {"score": 0.0021994343316143125, "phrase": "smaller_regions"}, {"score": 0.0021754360937943167, "phrase": "internal_boundaries"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Point-in-polyhedron"], "paper_abstract": "In this paper, we revisit the point-in-polyhedron problem. After reviewing previous work, we develop further insight into the problem. We then claim that, for a given testing point and a three-dimensional polyhedron, a single determining triangle can be found which suffices to determine whether the point is inside or outside the polyhedron. This work can be considered to be an extension and implementation of Horn's work, which inspired us to propose a theorem for obtaining determining triangles. Building upon this theorem, algorithms are then presented, implemented, and tested. The results show that although our code has the same asymptotic time efficiency as commonly used octree-based ray crossing methods, in practice it is usually several times and sometimes more than ten times faster, while other costs such as preprocessing time and memory requirements remain the same. The ideas proposed in this paper are simple and general. They thus extend naturally to multi-material models, i.e., polyhedrons subdivided into smaller regions by internal boundaries. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A new point containment test algorithm based on preprocessing and determining triangles", "paper_id": "WOS:000283962900008"}