{"auto_keywords": [{"score": 0.04954397446159371, "phrase": "multiple_instance_regression"}, {"score": 0.029420333683948783, "phrase": "mhcmir"}, {"score": 0.028312317972293805, "phrase": "mhc-ii"}, {"score": 0.00481495049065317, "phrase": "mhc-ii_binding_affinity"}, {"score": 0.004577440795549049, "phrase": "antigen_peptides"}, {"score": 0.004183638135671596, "phrase": "amino_acid_sequence_correlates"}, {"score": 0.0041136473765874815, "phrase": "binding_affinity"}, {"score": 0.0038668462001710314, "phrase": "immune_response"}, {"score": 0.0035941231858949035, "phrase": "significant_variability"}, {"score": 0.0033218213825698417, "phrase": "nine_amino_acids_core_region"}, {"score": 0.00305285084207725, "phrase": "flexible_length_mhc-ii_peptides"}, {"score": 0.002951444412262927, "phrase": "multiple_instance_regression_problems"}, {"score": 0.0021896891011033105, "phrase": "online_web_server"}, {"score": 0.0021408862709571615, "phrase": "mhcmir_method"}, {"score": 0.0021049977753042253, "phrase": "binding_affinity_prediction"}], "paper_keywords": ["MHC-II peptide prediction", " multiple instance learning", " multiple instance regression"], "paper_abstract": "Reliably predicting the ability of antigen peptides to bind to major histocompatibility complex class II (MHC-II) molecules is an essential step in developing new vaccines. Uncovering the amino acid sequence correlates of the binding affinity of MHC-II binding peptides is important for understanding pathogenesis and immune response. The task of predicting MHC-II binding peptides is complicated by the significant variability in their length. Most existing computational methods for predicting MHC-II binding peptides focus on identifying a nine amino acids core region in each binding peptide. We formulate the problems of qualitatively and quantitatively predicting flexible length MHC-II peptides as multiple instance learning and multiple instance regression problems, respectively. Based on this formulation, we introduce MHCMIR, a novel method for predicting MHC-II binding affinity using multiple instance regression. We present results of experiments using several benchmark data sets that show that MHCMIR is competitive with the state-of-the-art methods for predicting MHC-II binding peptides. An online web server that implements the MHCMIR method for MHC-II binding affinity prediction is freely accessible at http://ailab.cs.iastate.edu/mhcmir.", "paper_title": "Predicting MHC-II Binding Affinity Using Multiple Instance Regression", "paper_id": "WOS:000290449000018"}