{"auto_keywords": [{"score": 0.04888818798303966, "phrase": "feature_models"}, {"score": 0.00481495049065317, "phrase": "interactive_inconsistency"}, {"score": 0.004742730438544081, "phrase": "feature_modeling"}, {"score": 0.004397487039229447, "phrase": "similar_products"}, {"score": 0.004266501496765747, "phrase": "feature_models'_construction"}, {"score": 0.003366233863411861, "phrase": "novel_dynamic-priority_based_approach"}, {"score": 0.002922705896608178, "phrase": "domain_analysts"}, {"score": 0.0028498718992429825, "phrase": "desirable_solution"}, {"score": 0.002723301730223192, "phrase": "key_technical_contribution"}, {"score": 0.0025761937402886954, "phrase": "first_application"}, {"score": 0.0025374674652885354, "phrase": "constraint_hierarchy_theory"}, {"score": 0.0024247382451294255, "phrase": "domain_analysts'_confidence"}], "paper_keywords": ["software engineering", " requirement engineering", " feature modeling", " constraint hierarchy theory", " inconsistency fixing"], "paper_abstract": "Feature models have been widely adopted to reuse the requirements of a set of similar products in a domain. In feature models' construction, one basic task is to ensure the consistency of feature models, which often involves detecting and fixing of inconsistencies in feature models. While many approaches have been proposed, most of them focus on detecting inconsistencies rather than fixing inconsistencies. In this paper, we propose a novel dynamic-priority based approach to interactively fixing inconsistencies in feature models, and report an implementation of a system that not only automatically recommends a solution to fixing inconsistencies but also supports domain analysts to gradually reach the desirable solution by dynamically adjusting priorities of constraints. The key technical contribution is, as far as we are aware, the first application of the constraint hierarchy theory to feature modeling, where the degree of domain analysts' confidence on constraints is expressed by using priority and inconsistencies are resolved by deleting one or more lower-priority constraints. Two case studies demonstrate the usability and scalability (efficiency) of our new approach.", "paper_title": "Interactive Inconsistency Fixing in Feature Modeling", "paper_id": "WOS:000339302600015"}