{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "information_disclosure_behavior"}, {"score": 0.0047787596516662, "phrase": "infertility_bloggers"}, {"score": 0.004567230180529598, "phrase": "women_bloggers"}, {"score": 0.004348580182733617, "phrase": "anonymity_patterns"}, {"score": 0.004140354220982935, "phrase": "infertility_blogs"}, {"score": 0.003897659323896113, "phrase": "basic_demographic_and_blogging_practice_data"}, {"score": 0.00378167947598949, "phrase": "bloggers'_discursive_and_visual_anonymity"}, {"score": 0.0036553070575015344, "phrase": "findings_-_findings"}, {"score": 0.0033511469200347907, "phrase": "bloggers_post_actual_photos"}, {"score": 0.003226899588787952, "phrase": "high_rate"}, {"score": 0.0031665087019813244, "phrase": "sensitive_information"}, {"score": 0.003083849594367653, "phrase": "highly_intimate_details"}, {"score": 0.0029471223246724204, "phrase": "significant_correlation"}, {"score": 0.002902903244616154, "phrase": "visual_and_discursive_anonymity"}, {"score": 0.002870173628745123, "phrase": "perceived_self-disclosure"}, {"score": 0.002153316680437517, "phrase": "alternate_explanation"}, {"score": 0.0021049977753042253, "phrase": "bloggers'_self-disclosure_patterns"}], "paper_keywords": ["Information behavior", " Blogging", " Infertility", " Self-disclosure", " Self-presentation"], "paper_abstract": "Purpose - The study aimed to investigate the information disclosure behavior of women bloggers who suffer from infertility by examining their self-disclosure as it relates to the anonymity patterns they adopted. Design/methodology/approach - A survey was distributed to approximately 300 authors of infertility blogs, 135 bloggers answered the request to take part in the study. The survey gathered basic demographic and blogging practice data, and measured different elements of the bloggers' discursive and visual anonymity as well as their patters of self-disclosure. Findings - Findings reveal that the majority of respondents identify themselves on their blogs and only a small percentage decided to be totally anonymous, and about half of the bloggers post actual photos of themselves and their lives. The participants reported a high rate of self-disclosure, revealing sensitive information, letting their defenses down, disclosing highly intimate details about their lives, writing openly about their infertility treatments on their biog. No significant correlation was observed between visual and discursive anonymity and the perceived self-disclosure of participants. Results show that the more anonymous the bloggers are, the more afraid they become that their blog may be read by people they know offline. On the other hand, the more identifiable the bloggers are, the more willingness they show to share the content of their journal with people they know offline. The majority of participants expressed concerns that blogging could negatively impact their lives. Originality/value - This study explores an alternate explanation through the examination of the bloggers' self-disclosure patterns as they relate to the degree of anonymity adopted.", "paper_title": "An examination of the information disclosure behavior of infertility bloggers", "paper_id": "WOS:000334976300004"}