{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intradisciplinary_perspective"}, {"score": 0.004630423009638876, "phrase": "formation-seeking_behavior"}, {"score": 0.004528156929805637, "phrase": "different_subfields"}, {"score": 0.002911961514073769, "phrase": "general_search_facilities"}, {"score": 0.0027382040767844093, "phrase": "-disciplinary_use"}, {"score": 0.0025892330566358503, "phrase": "scattered_literature"}, {"score": 0.002251227801482381, "phrase": "information-seeking_behavior"}, {"score": 0.0022261705957258506, "phrase": "specialized_subject_communities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information-seeking behavior", " Interdisciplinarity", " Scatter of literature", " Physics", " Astronomy"], "paper_abstract": "Adopting an intradisciplinary perspective, this article evaluates the in formation-seeking behavior of academics from different subfields of physics and astronomy. It investigates the effect of interdisciplinarity (reliance on the literature of other subjects) and the scatter of literature on two aspects of the in formation-seeking behavior: methods used for keeping up-to-date and for identifying articles. To this end a survey of 114 PhD students and staff at the Department of Physics and Astronomy at the University College London was carried out. The findings showed that the subfields that are more interdisciplinary or have a more scattered literature are more likely to use general search facilities for finding information. The study also showed that cross-disciplinary use of the literature is not necessarily an indicator of scattered literature. The study reveals intradisciplinary, differences among physicists and astronomers in terms of their information-seeking behavior and highlights the risk of overlooking the characteristics of information-seeking behavior of specialized subject communities by focusing on very broad subject categories. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Interdisciplinarity and the information-seeking behavior of scientists", "paper_id": "WOS:000275611200009"}