{"auto_keywords": [{"score": 0.04408711241958952, "phrase": "image_hashing"}, {"score": 0.010638707364945987, "phrase": "expected_discriminability"}, {"score": 0.005151118799641723, "phrase": "image-hashing_scheme"}, {"score": 0.00481495049065317, "phrase": "fragility_analysis_of_adaptive_quantization-based_image_hashing"}, {"score": 0.004580550308652044, "phrase": "authentication-oriented_image_hashing"}, {"score": 0.0036485497734171294, "phrase": "proposed_measure"}, {"score": 0.003509487090932835, "phrase": "gray_code"}, {"score": 0.0034134024569847264, "phrase": "discrete-binary_conversion_stage"}, {"score": 0.003123203316511694, "phrase": "quantization_stage"}, {"score": 0.002794802975530612, "phrase": "adaptive_quantization"}, {"score": 0.0025570607111118793, "phrase": "deterministic_adaptive_quantization"}, {"score": 0.0023788319661581696, "phrase": "maximum_value"}], "paper_keywords": ["Adaptive quantization", " authentication", " fragility", " Gray code", " image hashing", " robustness"], "paper_abstract": "Fragility is one of the most important properties of authentication-oriented image hashing. However, to date, there has been little theoretical analysis on the fragility of image hashing. In this paper, we propose a measure called expected discriminability for the fragility of image hashing and study this fragility theoretically based on the proposed measure. According to our analysis, when Gray code is applied into the discrete-binary conversion stage of image hashing, the value of the expected discriminability, which is dominated by the quantization stage of image hashing, is no more than 1/2. We further evaluate the expected discriminability of the image-hashing scheme that uses adaptive quantization, which is the most popular quantization scheme in the field of image hashing. Our evaluation reveals that if deterministic adaptive quantization is applied, then the expected discriminability of the image-hashing scheme can reach the maximum value (i.e., 1/2). Finally, some experiments are conducted to validate our theoretical analysis and to compare the performance of several quantization schemes for image hashing.", "paper_title": "Fragility Analysis of Adaptive Quantization-Based Image Hashing", "paper_id": "WOS:000274737400012"}