{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "circos"}, {"score": 0.04671870192794838, "phrase": "circos_plot_tool"}, {"score": 0.045912844607109565, "phrase": "interactive_visualization_tool"}, {"score": 0.040988944830941225, "phrase": "specific_data_points"}, {"score": 0.004749824776508639, "phrase": "circos_plots"}, {"score": 0.004706895428234964, "phrase": "graphical_outputs"}, {"score": 0.003802135020791801, "phrase": "r-based_circos_tool"}, {"score": 0.0031129269142224194, "phrase": "circos_figures"}, {"score": 0.0027035833504191233, "phrase": "java_computer_language"}, {"score": 0.0025718104643205355, "phrase": "windows"}, {"score": 0.0025253056923091894, "phrase": "linux"}, {"score": 0.0024129269611844794, "phrase": "flat_data_formats"}, {"score": 0.0023372808856170386, "phrase": "graphical_user_interface"}, {"score": 0.0021049977753042253, "phrase": "next-generation_sequencing_data"}], "paper_keywords": [""], "paper_abstract": "Circos plots are graphical outputs that display three dimensional chromosomal interactions and fusion transcripts. However, the Circos plot tool is not an interactive visualization tool, but rather a figure generator. For example, it does not enable data to be added dynamically nor does it provide information for specific data points interactively. Recently, an R-based Circos tool (RCircos) has been developed to integrate Circos to R, but similarly, Rcircos can only be used to generate plots. Thus, we have developed a Circos plot tool (J-Circos) that is an interactive visualization tool that can plot Circos figures, as well as being able to dynamically add data to the figure, and providing information for specific data points using mouse hover display and zoom in/out functions. J-Circos uses the Java computer language to enable, it to be used on most operating systems (Windows, MacOS, Linux). Users can input data into J-Circos using flat data formats, as well as from the Graphical user interface (GUI). J-Circos will enable biologists to better study more complex chromosomal interactions and fusion transcripts that are otherwise difficult to visualize from next-generation sequencing data.", "paper_title": "J-Circos: an interactive Circos plotter", "paper_id": "WOS:000355665800017"}