{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "comparative_genomics"}, {"score": 0.004607686390487483, "phrase": "large_volumes"}, {"score": 0.004562847483469705, "phrase": "genome_sequences"}, {"score": 0.004518442937844318, "phrase": "comparative_analysis"}, {"score": 0.004345085569121329, "phrase": "public_sequencing_projects"}, {"score": 0.004219427915728969, "phrase": "individual_efforts"}, {"score": 0.003959447096055027, "phrase": "public_genome_browsers"}, {"score": 0.0037519679864796906, "phrase": "powerful_tools"}, {"score": 0.0033524956061690868, "phrase": "web-_accessible_ucsc_genome_browsers"}, {"score": 0.003115105266246263, "phrase": "broad_and_growing_community"}, {"score": 0.003024909947609294, "phrase": "easy_public_sharing"}, {"score": 0.002356173823922118, "phrase": "complex_structural_rearrangements"}, {"score": 0.0022107428653358715, "phrase": "comparative_assembly_hub"}], "paper_keywords": [""], "paper_abstract": "Motivation: Researchers now have access to large volumes of genome sequences for comparative analysis, some generated by the plethora of public sequencing projects and, increasingly, from individual efforts. It is not possible, or necessarily desirable, that the public genome browsers attempt to curate all these data. Instead, a wealth of powerful tools is emerging to empower users to create their own visualizations and browsers. Results: We introduce a pipeline to easily generate collections of Web- accessible UCSC Genome Browsers interrelated by an alignment. It is intended to democratize our comparative genomic browser resources, serving the broad and growing community of evolutionary genomicists and facilitating easy public sharing via the Internet. Using the alignment, all annotations and the alignment itself can be efficiently viewed with reference to any genome in the collection, symmetrically. A new, intelligently scaled alignment display makes it simple to view all changes between the genomes at all levels of resolution, from substitutions to complex structural rearrangements, including duplications. To demonstrate this work, we create a comparative assembly hub containing 57 Escherichia coli and 9 Shigella genomes and show examples that highlight their unique biology.", "paper_title": "Comparative assembly hubs: Web-accessible browsers for comparative genomics", "paper_id": "WOS:000345827400001"}