{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "icc"}, {"score": 0.00864065109352607, "phrase": "sequencing_errors"}, {"score": 0.008431566268069282, "phrase": "rare_variants"}, {"score": 0.004428728205625129, "phrase": "important_new_approach"}, {"score": 0.004321118442104989, "phrase": "diverse_sequence_populations"}, {"score": 0.004257806363128601, "phrase": "low_frequency_variants"}, {"score": 0.0036733470451885465, "phrase": "infected_host"}, {"score": 0.0036373553416391823, "phrase": "high_sensitivity"}, {"score": 0.003479692058963528, "phrase": "new_approach"}, {"score": 0.0028857130140890787, "phrase": "sequence_clustering"}, {"score": 0.002538687900036229, "phrase": "distance_cutoff_value"}, {"score": 0.0023928819778638055, "phrase": "control_datasets"}, {"score": 0.002357755095722877, "phrase": "pyrosequencing_data"}, {"score": 0.002323142666222693, "phrase": "pcr_fragment"}, {"score": 0.002157538586313944, "phrase": "highest_sensitivity"}, {"score": 0.0021363670305843403, "phrase": "similar_specificity"}], "paper_keywords": [""], "paper_abstract": "Motivation: Pyrosequencing technology provides an important new approach to more extensively characterize diverse sequence populations and detect low frequency variants. However, the promise of this technology has been difficult to realize, as careful correction of sequencing errors is crucial to distinguish rare variants (similar to 1%) in an infected host with high sensitivity and specificity. Results: We developed a new approach, referred to as Indel and Carryforward Correction (ICC), to cluster sequences without substitutions and locally correct only indel and carryforward sequencing errors within clusters to ensure that no rare variants are lost. ICC performs sequence clustering in the order of (i) homopolymer indel patterns only, (ii) indel patterns only and (iii) carryforward errors only, without the requirement of a distance cutoff value. Overall, ICC removed 93-95% of sequencing errors found in control datasets. On pyrosequencing data from a PCR fragment derived from 15 HIV-1 plasmid clones mixed at various frequencies as low as 0.1%, ICC achieved the highest sensitivity and similar specificity compared with other commonly used error correction and variant calling algorithms.", "paper_title": "Indel and Carryforward Correction (ICC): a new analysis approach for processing 454 pyrosequencing data", "paper_id": "WOS:000324778500006"}