{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "genre_recognition"}, {"score": 0.004730458558634266, "phrase": "eye_tracking"}, {"score": 0.004565876339189493, "phrase": "eight_different_types"}, {"score": 0.004081385289516914, "phrase": "different_genres"}, {"score": 0.0038930368103015467, "phrase": "oculographic_behavior_data"}, {"score": 0.003802135020791801, "phrase": "scanpath_duration"}, {"score": 0.003757480190200645, "phrase": "scanpath_length"}, {"score": 0.003338690782620756, "phrase": "genre_analysis"}, {"score": 0.00314708280192844, "phrase": "effective_means"}, {"score": 0.0026986685585382347, "phrase": "e-mail_texts"}, {"score": 0.002651213849567608, "phrase": "visual_cues"}, {"score": 0.0025137856138000014, "phrase": "ocular_strategies"}, {"score": 0.002194011800331242, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Genre", " Eyetracking", " E-mail", " Scanpaths", " Scanning", " Skimming"], "paper_abstract": "This paper reports on an approach to the analysis of form (layout and formatting) during genre recognition recorded using eye tracking. The researchers focused on eight different types of e-mail, such as calls for papers, newsletters and spam, which were chosen to represent different genres. The study involved the collection of oculographic behavior data based on the scanpath duration and scanpath length based metric, to highlight the ways in which people view the features of genres. We found that genre analysis based on purpose and form (layout features, etc.) was an effective means of identifying the characteristics of these e-mails. The research, carried out on a group of 24 participants, highlighted their interaction and interpretation of the e-mail texts and the visual cues or features perceived. In addition, the ocular strategies of scanning and skimming, they employed for the processing of the texts by block, genre and representation were evaluated. Crown Copyright (C) 2013 Published by Elsevier Ltd. All rights reserved.", "paper_title": "You have e-mail, what happens next? Tracking the eyes for genre", "paper_id": "WOS:000327287500011"}