{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "advanced_ontology-based_service_profiles"}, {"score": 0.004647911247507267, "phrase": "swindew-s"}, {"score": 0.004180622964109706, "phrase": "traditional_workflow_definition_languages"}, {"score": 0.004035500442527029, "phrase": "xpdl"}, {"score": 0.0037868092509097404, "phrase": "business_process_semantics"}, {"score": 0.003264316172836322, "phrase": "novel_solution"}, {"score": 0.002998688867384969, "phrase": "service_discovery"}, {"score": 0.0028137115734915624, "phrase": "enhanced_swindew-s_architecture"}, {"score": 0.0025846562485378247, "phrase": "well-developed_profile_generation_tool"}, {"score": 0.0024423826953133844, "phrase": "owl-s_profiles"}, {"score": 0.0023079225317714815, "phrase": "new_prototype"}, {"score": 0.0021049977753042253, "phrase": "service_flow_peers"}], "paper_keywords": ["web services", " p2p workilows", " business processes", " service profiles", " ontology"], "paper_abstract": "A peer-to-peer (p2p) based service flow management system, SwinDeW-S, could support decentralised Web service composition, deployment and enactment. However, traditional workflow definition languages, such as extended XPDL and service-oriented BPEL4WS, have become insufficient to specify business process semantics, especially the descriptions of inputs, outputs, preconditions and effects. In this paper, we propose a novel solution based on OWL-S, a semantic Web ontology language that leverages service discovery, invocation and negotiation more effectively. The enhanced SwinDeW-S architecture is adapted with advanced ontology-based service profiles, and it takes advantage of a well-developed profile generation tool, which translates the BPEL4WS process models to the OWL-S profiles. As a result, in a new prototype equipped with both BPEL4WS and OWL-S, communications and coordination among service flow peers have become better organised and more efficient. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A p2p based service flow system with advanced ontology-based service profiles", "paper_id": "WOS:000247676200011"}