{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "path_selection"}, {"score": 0.0076244284868518765, "phrase": "virtual_ants"}, {"score": 0.007532613639570396, "phrase": "artificial_pheromone"}, {"score": 0.004756805752518494, "phrase": "foraging_swarm"}, {"score": 0.004586531354697466, "phrase": "search_and_retrieval_task"}, {"score": 0.004161553532799662, "phrase": "different_paths"}, {"score": 0.003996271202811961, "phrase": "foraging_behavior"}, {"score": 0.003775803846431323, "phrase": "unused_robots"}, {"score": 0.003685067218455088, "phrase": "path_maintenance"}, {"score": 0.003289534854212415, "phrase": "local_messages"}, {"score": 0.003133252930886608, "phrase": "deposit_artificial_pheromone"}, {"score": 0.002751751956416832, "phrase": "selected_path"}, {"score": 0.0026638482306228575, "phrase": "mathematical_model"}, {"score": 0.0026209522797963447, "phrase": "experimental_validation"}, {"score": 0.002456148932305311, "phrase": "closest_resource"}, {"score": 0.0023970487263732737, "phrase": "new_path"}, {"score": 0.0023680327896318915, "phrase": "selected_resource"}, {"score": 0.002311047934798247, "phrase": "newly_detected_and_better_resource"}, {"score": 0.0021049977753042253, "phrase": "minimal_abilities"}], "paper_keywords": ["Swarm robotics", " Path selection", " Artificial pheromone"], "paper_abstract": "Foraging robots involved in a search and retrieval task may create paths to navigate faster in their environment. In this context, a swarm of robots that has found several resources and created different paths may benefit strongly from path selection. Path selection enhances the foraging behavior by allowing the swarm to focus on the most profitable resource with the possibility for unused robots to stop participating in the path maintenance and to switch to another task. In order to achieve path selection, we implement virtual ants that lay artificial pheromone inside a network of robots. Virtual ants are local messages transmitted by robots; they travel along chains of robots and deposit artificial pheromone on the robots that are literally forming the chain and indicating the path. The concentration of artificial pheromone on the robots allows them to decide whether they are part of a selected path. We parameterize the mechanism with a mathematical model and provide an experimental validation using a swarm of 20 real robots. We show that our mechanism favors the selection of the closest resource is able to select a new path if a selected resource becomes unavailable and selects a newly detected and better resource when possible. As robots use very simple messages and behaviors, the system would be particularly well suited for swarms of microrobots with minimal abilities.", "paper_title": "Artificial pheromone for path selection by a foraging swarm of robots", "paper_id": "WOS:000284507700001"}