{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ligand-target_prediction"}, {"score": 0.046840734843818926, "phrase": "overall_performance_statistics"}, {"score": 0.004108546015423213, "phrase": "bayesian"}, {"score": 0.004004257162400726, "phrase": "winnow"}, {"score": 0.003805591825381666, "phrase": "wombat_database"}, {"score": 0.003525861581971337, "phrase": "performance_assessment"}, {"score": 0.0031643005824589917, "phrase": "different_circular_fingerprints"}, {"score": 0.0030457198309616694, "phrase": "detailed_analysis"}, {"score": 0.002988101395789399, "phrase": "resulting_approximate"}, {"score": 0.002857849698346116, "phrase": "overall_accuracy"}, {"score": 0.0027159094186967247, "phrase": "significant_differences"}, {"score": 0.0026815368507715, "phrase": "individual_activity_classes"}, {"score": 0.0021049977753042253, "phrase": "detailed_information"}], "paper_keywords": [""], "paper_abstract": "We compared two algorithms for ligand-target prediction, namely, the Laplacian-modified Bayesian classifier and the Winnow algorithm. A dataset derived from the WOMBAT database, spanning 20 pharmaceutically relevant activity classes with 13 000 compounds, was used for performance assessment in 24 different experiments, each of which was assessed using a 15-fold Monte Carlo cross-validation. Compounds were described by different circular fingerprints, ECFP_4 and MOLPRINT 2D. A detailed analysis of the resulting approximate to 2.4 million predictions led to very similar measures for overall accuracy for both classifiers, whereas we observed significant differences for individual activity classes. Moreover, we analyzed Our data with respect to the numbers of compounds which are exclusively retrieved by either of the algorithms-but never by the other-or by neither of them. This provided detailed information that can never be obtained by considering the overall performance statistics alone.", "paper_title": "Ligand-Target Prediction Using Winnow and Naive Bayesian Algorithms and the Implications of Overall Performance Statistics", "paper_id": "WOS:000262003800004"}