{"auto_keywords": [{"score": 0.04609968630540795, "phrase": "proposed_algorithm"}, {"score": 0.025129049659657836, "phrase": "embedding_capacity"}, {"score": 0.00481495049065317, "phrase": "vq-compressed_images"}, {"score": 0.004758457292840376, "phrase": "embedding_algorithm"}, {"score": 0.00462919213721188, "phrase": "binary_message"}, {"score": 0.0045748683993128425, "phrase": "vq-compressed_image"}, {"score": 0.004278807087784626, "phrase": "codeword_grouping_phase"}, {"score": 0.004228577663320847, "phrase": "new_group"}, {"score": 0.003459191419478298, "phrase": "embedding_phase"}, {"score": 0.0030254743224136273, "phrase": "higher_the_embedding_capacity"}, {"score": 0.0028857130140890787, "phrase": "extracting_phase"}, {"score": 0.00266693888510356, "phrase": "embedded_message"}, {"score": 0.002474447780553576, "phrase": "experimental_results"}, {"score": 0.0023976048394496446, "phrase": "previous_algorithms"}, {"score": 0.0023415390666563177, "phrase": "image_quality"}, {"score": 0.0023048904639724438, "phrase": "test_images"}, {"score": 0.0021724831184390192, "phrase": "psnr_values"}], "paper_keywords": ["Information hiding", " Vector quantization", " Adaptively embedding", " Steganography"], "paper_abstract": "An embedding algorithm, which can adaptively embed a binary message into a VQ-compressed image, is proposed in this paper. The proposed algorithm is divided into three phases. In the codeword grouping phase, a new group of codewords is initiated by the two most similar codewords which do not belong to any group. For each codeword which does not belong to any group, if the codeword is similar to all of the codewords in the group, it will be added to the group. In the embedding phase, each codeword in a group will be assigned to embed a certain sub-message whose length is determined by the number of codewords in the group. The more codewords a group has, the higher the embedding capacity of a codeword in the group will be. In the extracting phase, given a codeword and the number of codewords in the group to which the codeword belongs, the embedded message can be extracted from the codeword by simply determining the order of the codeword in the group. Experimental results show that the proposed algorithm performs better than previous algorithms with regard to embedding capacity and image quality. For the test images, when the embedding capacity is less than 5 bits per codeword index, the difference of the PSNR values between the stego-image and its VQ-compressed cover image will be no more than 5 dB on average. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Adaptive embedding techniques for VQ-compressed images", "paper_id": "WOS:000263647200011"}