{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gas_sensors"}, {"score": 0.04925194419954486, "phrase": "ubicomp_applications"}, {"score": 0.0046176782475198085, "phrase": "previous_research"}, {"score": 0.0043976740574978085, "phrase": "highly_controlled_experimental_testing_chambers"}, {"score": 0.0043367547691560175, "phrase": "potential_ubicomp_applications"}, {"score": 0.0038517317559294962, "phrase": "ubicomp_environments"}, {"score": 0.0036680857629458816, "phrase": "classification_accuracy"}, {"score": 0.0036046342610557497, "phrase": "example_application"}, {"score": 0.003542276457435362, "phrase": "odor_fingerprint"}, {"score": 0.0034207673889407003, "phrase": "time_series_data"}, {"score": 0.003280427617955518, "phrase": "eight_mos_gas_sensors'_ability"}, {"score": 0.0032236602306747637, "phrase": "gas_molecules"}, {"score": 0.0030062165552187086, "phrase": "decision_tree_classifier"}, {"score": 0.002803398730609738, "phrase": "small_container"}, {"score": 0.0027452574218375593, "phrase": "open_air"}, {"score": 0.002678944072162297, "phrase": "odor_samples"}, {"score": 0.002329530057661417, "phrase": "context-aware_systems"}, {"score": 0.002297193869719681, "phrase": "lifelogging_applications"}, {"score": 0.0022260654608669593, "phrase": "natural_resources"}, {"score": 0.0021875036343988806, "phrase": "automatic_dual-flush_toilet"}, {"score": 0.0021496083700137305, "phrase": "appropriate_amount"}, {"score": 0.0021049977753042253, "phrase": "user's_toileting_activities"}], "paper_keywords": ["Electronic nose", " Gas sensors", " Activity sensing"], "paper_abstract": "Previous research has shown that gas sensors can be used to classify odors when used in highly controlled experimental testing chambers. However, potential ubicomp applications require these sensors to perform an analysis in less controlled environments, particularly at a distance. In this paper, we discuss our design of uSmell-a gas sensor system for sensing smell in ubicomp environments-and an evaluation of its basic efficacy, effects of airflow and distance on classification accuracy, and in an example application. Our system samples an odor fingerprint from eight metal oxide semiconductor (MOS) gas sensors every second. It then processes the time series data to extract three features that highlight how time and distance affect the eight MOS gas sensors' ability to react to the gas molecules released by an odor every 5 s; this generates 24 features in total that are then used to train a decision tree classifier. Using this approach, our system can classify a set of odors with 88 % accuracy when placed both in a small container with the samples and in open air 0.5-2 m from the odor samples. We also demonstrate its ability to classify odors in less controlled environments that might be targets for ubicomp applications by deploying it in a bathroom for a week. These results show the potential for applying this sensing toward the development of context-aware systems, such as lifelogging applications or those geared toward enhancing the sustainability of natural resources (e.g., an automatic dual-flush toilet that always uses an appropriate amount of water based on the user's toileting activities).", "paper_title": "uSmell: exploring the potential for gas sensors to classify odors in ubicomp applications relative to airflow and distance", "paper_id": "WOS:000347292500017"}