{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "atmospheric_concentration"}, {"score": 0.004772818068176176, "phrase": "halogenated_organic_compounds"}, {"score": 0.0045877173513910055, "phrase": "global_climate"}, {"score": 0.004371160978838441, "phrase": "halogenated_ether"}, {"score": 0.003698442219929622, "phrase": "counterpoise_cp-corrected_gradient_optimization"}, {"score": 0.0034319005131102495, "phrase": "vertical_bar_o-w_hydrogen_bonds"}, {"score": 0.003342471131048328, "phrase": "haeuro_broken_vertical_bar_o-w_distances"}, {"score": 0.003226834737003501, "phrase": "small_contraction"}, {"score": 0.0031845067058084583, "phrase": "ch_bonds"}, {"score": 0.003142732162296465, "phrase": "blue_shifts"}, {"score": 0.00307431840409833, "phrase": "stretching_vibrations"}, {"score": 0.002967931416941965, "phrase": "weak_interaction"}, {"score": 0.002903311792572216, "phrase": "f_atoms"}, {"score": 0.0028652153774536967, "phrase": "h_atom"}, {"score": 0.002682081928174866, "phrase": "stabilization_energies"}, {"score": 0.0023708980662168547, "phrase": "cl_halogen_bonding"}], "paper_keywords": ["Anaesthetic", " Enflurane", " Hydrogen bond", " Ab initio MP2", " CCSD(T)", " Halogen bond"], "paper_abstract": "Increase of the atmospheric concentration of halogenated organic compounds is partially responsible for a change of the global climate. In this work we have investigated the interaction between halogenated ether and water, which is one of the most important constituent of the atmosphere. The structures of the complexes formed by the two most stable conformers of enflurane (a volatile anaesthetic) with one and two water molecules were calculated by means of the counterpoise CP-corrected gradient optimization at the MP2/6-311++G(d,p) level. In these complexes the CHaEuro broken vertical bar O-w hydrogen bonds are formed, with the HaEuro broken vertical bar O-w distances varying between 2.23 and 2.32 . A small contraction of the CH bonds and the blue shifts of the nu(CH) stretching vibrations are predicted. There is also a weak interaction between one of the F atoms and the H atom of water, with the H(w)aEuro broken vertical bar F distances between 2.41 and 2.87 . The CCSD(T)/CBS calculated stabilization energies in these complexes are between -5.89 and -4.66 kcal mol(-1), while the enthalpies of formation are between -4.35 and -3.22 kcal mol(-1). The Cl halogen bonding between enflurane and water has been found in two complexes. The intermolecular (Cl center dot center dot center dot O) distance is smaller than the sum of the corresponding van der Waals radii. The CCSD(T)/CBS stabilization energies for these complexes are about -2 kcal mol(-1).", "paper_title": "Theoretical studies of the interaction between enflurane and water", "paper_id": "WOS:000315349800041"}