{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "structured_growth"}, {"score": 0.004658426838467567, "phrase": "scientific_and_other_non-patent_references"}, {"score": 0.004482206282876944, "phrase": "important_tools"}, {"score": 0.0033837135367113004, "phrase": "lexical_analysis"}, {"score": 0.0025678829712650437, "phrase": "developed_and_non-developed_countries"}, {"score": 0.002470547930651519, "phrase": "public_policies"}, {"score": 0.002312174113289583, "phrase": "industrial_and_technological_dimension"}, {"score": 0.002163930783583212, "phrase": "key_component"}, {"score": 0.0021401625519713577, "phrase": "developmental_policies"}, {"score": 0.0021049977753042253, "phrase": "twenty-first_century"}], "paper_keywords": ["Science and technology linkages", " Stages of economic development", " Systems of innovation"], "paper_abstract": "Scientific and other non-patent references (NPRs) in patents are important tools to analyze interactions between science and technology. This paper organizes a database with 514,894 USPTO patents granted globally in 1974, 1982, 1990, 1998 and 2006. There are 165,762 patents with at least one reference to science and engineering (S&E) literature, from a total of 1,375,503 references. Through a lexical analysis, 71.1% of this S&E literature is classified by S&E fields. These data serve as the basis for the elaboration of global and national 3-dimensional matrices (technological domains, S&E fields and number of references). Three indicators are proposed to analyze these matrices, allowing us to identify patterns of structured growth that differentiate developed and non-developed countries. This differentiation informs suggestions for public policies for development, emphasizing the need for an articulation between the industrial and technological dimension and scientific side. The intertwinement of these two dimensions is a key component of developmental policies for the twenty-first century.", "paper_title": "Matrices of science and technology interactions and patterns of structured growth: implications for development", "paper_id": "WOS:000275417400004"}