{"auto_keywords": [{"score": 0.04871093899700793, "phrase": "biomedical_terminologies"}, {"score": 0.00481495049065317, "phrase": "clinical_reality"}, {"score": 0.004543708337879809, "phrase": "agreed_meanings"}, {"score": 0.0035507457285983268, "phrase": "cimino"}, {"score": 0.003512308265830794, "phrase": "wuster"}, {"score": 0.003461728801314749, "phrase": "campbell"}, {"score": 0.0030821633718368206, "phrase": "corresponding_referents"}, {"score": 0.0029722900280316216, "phrase": "anchorage_problem"}, {"score": 0.0029294420752976947, "phrase": "terminology_construction"}, {"score": 0.002646267286675984, "phrase": "corresponding_instances"}, {"score": 0.0025518930446603335, "phrase": "realist_approach"}, {"score": 0.002355920629285463, "phrase": "new_type"}, {"score": 0.0023051296931856265, "phrase": "electronic_health_records"}, {"score": 0.002151388538895855, "phrase": "diagnostic_decision-support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["terminology", " ontology", " referent tracking", " concept orientation", " instances", " realism", " electronic health record", " diagnostic decision-support"], "paper_abstract": "It is only by fixing on agreed meanings of terms in biomedical terminologies that we will be in a position to achieve that accumulation and integration of knowledge that is indispensable to progress at the frontiers of biomedicine. Standardly, the goal of fixing meanings is seen as being realized through the alignment of terms on what are called 'concepts.' Part I addresses three versions of the concept-based approach-by Cimino, by Wuster, and by Campbell and associates-and surveys some of the problems to which they give rise, all of which have to do with a failure to anchor the terms in terminologies to corresponding referents in reality. Part II outlines a new, realist solution to this anchorage problem, which sees terminology construction as being motivated by the goal of alignment not on concepts but on the universals (kinds, types) in reality and thereby also on the corresponding instances (individuals, tokens). We outline the realist approach and show how on its basis we can provide a benchmark of correctness for terminologies which will at the same time allow a new type of integration of terminologies and electronic health records. We conclude by outlining ways in which the framework thus defined might be exploited for purposes of diagnostic decision-support. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "From concepts to clinical reality: An essay on the benchmarking of biomedical terminologies", "paper_id": "WOS:000237980400005"}