{"auto_keywords": [{"score": 0.047779520615043744, "phrase": "human_everyday_reasoning"}, {"score": 0.022893348986787767, "phrase": "cognitive_architecture"}, {"score": 0.01599425418380724, "phrase": "similarity-based_reasoning"}, {"score": 0.007136959598546832, "phrase": "human_data"}, {"score": 0.006964005211665019, "phrase": "clarion"}, {"score": 0.00481495049065317, "phrase": "reasoning_data"}, {"score": 0.004299910946753963, "phrase": "rule-based_reasoning"}, {"score": 0.003728000957725218, "phrase": "unified_framework"}, {"score": 0.003566422652043389, "phrase": "clarion._first"}, {"score": 0.0034118234596993836, "phrase": "computational_framework"}, {"score": 0.0028857130140890787, "phrase": "clarion."}, {"score": 0.0024525907271610104, "phrase": "mainly_implicit_associative_memory"}], "paper_keywords": ["human reasoning", " cognitive architecture", " intuition", " rule-based reasoning", " similarity-based reasoning", " CLARION"], "paper_abstract": "A variety of forms of human everyday reasoning are studied in this paper. In particular, the interplay between rule-based reasoning, (implicit) similarity-based reasoning, and (implicit) associative memory (intuition) is explored. In doing this, both explicit and implicit forms of human reasoning are incorporated in a unified framework, which is embodied in a cognitive architecture, CLARION. First, similarity in human everyday reasoning is explored. A computational framework encompassing both rule-based and similarity-based reasoning provides explanations for human data. The simulation using CLARION demonstrates the role played by similarity-based reasoning in human everyday reasoning, and how such a reasoning process follows from the structure of CLARION. Furthermore, the modelling of discovery tasks, i.e. tasks where sudden insights result from cumulative information, is explored. This is useful for improving the understanding of reasoning involving intuition and insight. The situation is interpreted as involving mainly implicit associative memory with successive accumulation of information. The simulation within CLARION accurately captures some human data. Overall, the exploration of both similarity-based reasoning and intuition in this cognitive architecture leads toward a more comprehensive framework of human everyday reasoning.", "paper_title": "Accounting for a variety of reasoning data within a cognitive architecture", "paper_id": "WOS:000239427300005"}