{"auto_keywords": [{"score": 0.02907500027015408, "phrase": "example_point"}, {"score": 0.00481495049065317, "phrase": "multi-field_datasets"}, {"score": 0.00460125407969429, "phrase": "physical_simulations"}, {"score": 0.004559661374976129, "phrase": "medical_imaging"}, {"score": 0.004518442937844318, "phrase": "illustrative_visualization_techniques"}, {"score": 0.004240116703465252, "phrase": "current_techniques"}, {"score": 0.004201774694043468, "phrase": "multi-field_visualization"}, {"score": 0.004051828608343507, "phrase": "local_attributes"}, {"score": 0.003996983218174335, "phrase": "single_values"}, {"score": 0.003960831041259951, "phrase": "vector_directions"}, {"score": 0.0035515951985356374, "phrase": "similar_characteristics"}, {"score": 0.0030429511467945525, "phrase": "characteristic_combination"}, {"score": 0.002468450551616404, "phrase": "separate_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-field visualization", " Illustrative visualization", " Interactive exploration"], "paper_abstract": "Multi-fields are widely used in areas ranging from physical simulations to medical imaging. Illustrative visualization techniques can help to effectively communicate features of interest found in a given field. Current techniques for multi-field visualization are mostly focused on showing subsets of local attributes such as single values or vector directions, e.g., using colors, texture, streamlines or glyphs. Instead, we present an approach based on highlighting areas with similar characteristics, considering all attributes of the field. Our approach is example-based and interactive. A user simply selects a point within the field, upon which the system automatically derives the characteristic combination of attributes for that point. Our system then automatically creates a visualization highlighting areas within the field which are similar to the example point with respect to these characteristics. The visualizations are presented using sparse, illustrative techniques, using contours and colors to clearly delineate and identify separate areas. Users can interact with the visualizations in real-time, by moving the example point or, optionally, by changing the characteristics or adjusting other parameters used to determine similarity. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Example-based interactive illustration of multi-field datasets", "paper_id": "WOS:000285655800011"}