{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_music_piracy"}, {"score": 0.026224975178945415, "phrase": "physical_music_sales"}, {"score": 0.00599581436027946, "phrase": "negative_relationship"}, {"score": 0.0046659637258752535, "phrase": "digital_music_sales"}, {"score": 0.00438161736774803, "phrase": "physical_media"}, {"score": 0.0038442457081430334, "phrase": "legal_channels"}, {"score": 0.0038098460474829485, "phrase": "digital_music"}, {"score": 0.0031702173541386888, "phrase": "similar_results"}, {"score": 0.0030171910207671205, "phrase": "significant_structural_change"}, {"score": 0.0029767499830258754, "phrase": "music_market"}, {"score": 0.0028076592725295646, "phrase": "individual_tracks"}, {"score": 0.0026841368358805407, "phrase": "existing_literature"}, {"score": 0.0025316254589087973, "phrase": "itunes-like_legal_channels"}, {"score": 0.00247529638625566, "phrase": "bivariate_granger_testing"}, {"score": 0.0023241387549221408, "phrase": "negative_effect"}, {"score": 0.0021821915946356168, "phrase": "music_distribution"}, {"score": 0.0021049977753042253, "phrase": "physical_music"}], "paper_keywords": ["digital music", " music piracy", " Granger test", " panel vector autoregression", " music sales"], "paper_abstract": "Traditionally, music has been sold to consumers by recording several individual songs/tracks in physical media such as CDs and cassettes. Sales of such physical music have been declining for the past several years. Many academic studies have attributed the decline of physical music sales to online music piracy, yet some other studies have not found evidence to support a negative relationship between online music piracy and physical music sales. Interestingly and importantly, we have observed that while many of the studies that found the negative relationship between online music piracy and physical music sales used data before 2003, other studies that do not find similar results have used post-2003 data. In fact, there was a significant structural change in the music market in 2003. Legal (iTunes-like) online channels for digital music that allow consumers to buy individual tracks became available during that year. This article complements the existing literature by analyzing the impact of online music piracy and physical music sales in the presence of iTunes-like legal channels for digital music using bivariate Granger testing. Our results show that the availability of legal channels for digital music has weakened the negative effect of online music piracy on physical music sales. Moreover, in the presence of legal channels for music distribution, digital music, not online music piracy, substitutes for physical music.", "paper_title": "Shifting Demand: Online Music Piracy, Physical Music Sales, and Digital Music Sales", "paper_id": "WOS:000348999900002"}