{"auto_keywords": [{"score": 0.03771465750530587, "phrase": "model_creation"}, {"score": 0.00481495049065317, "phrase": "business_process"}, {"score": 0.0046221918332842995, "phrase": "business_process_models"}, {"score": 0.004337502738649814, "phrase": "business_processes"}, {"score": 0.004201774694043468, "phrase": "conceptual_model"}, {"score": 0.004144908086646161, "phrase": "business_process_model"}, {"score": 0.0037336520904376687, "phrase": "model_artifact"}, {"score": 0.0034403745992576808, "phrase": "resulting_model's_quality"}, {"score": 0.0032429499567088113, "phrase": "explorative_analysis"}, {"score": 0.0028166415999555604, "phrase": "ppm"}, {"score": 0.0027035833504191233, "phrase": "cluster_analysis"}, {"score": 0.002491015208328868, "phrase": "modeler-specific_factors"}, {"score": 0.0022231606165229235, "phrase": "future_research"}, {"score": 0.0021731423856364003, "phrase": "high-quality_process_models"}, {"score": 0.002124247104243502, "phrase": "better_modeling_support"}, {"score": 0.0021049977753042253, "phrase": "modeling_instruction"}], "paper_keywords": ["Business process modeling", " Process of process modeling", " Modeling styles", " Cluster analysis"], "paper_abstract": "Business process models are an important means to design, analyze, implement, and control business processes. As with every type of conceptual model, a business process model has to meet certain syntactic, semantic, and pragmatic quality requirements to be of value. For many years, such quality aspects were investigated by centering on the properties of the model artifact itself. Only recently, the process of model creation is considered as a factor that influences the resulting model's quality. Our work contributes to this stream of research and presents an explorative analysis of the process of process modeling (PPM). We report on two large-scale modeling sessions involving 115 students. In these sessions, the act of model creation, i.e., the PPM, was automatically recorded. We conducted a cluster analysis on this data and identified three distinct styles of modeling. Further, we investigated how both task- and modeler-specific factors influence particular aspects of those modeling styles. Based thereupon, we propose a model that captures our insights. It lays the foundations for future research that may unveil how high-quality process models can be established through better modeling support and modeling instruction.", "paper_title": "Styles in business process modeling: an exploration and a model", "paper_id": "WOS:000360764200003"}