{"auto_keywords": [{"score": 0.04379599400813163, "phrase": "intelligent_model"}, {"score": 0.004815006984966773, "phrase": "rfid"}, {"score": 0.004733458808453602, "phrase": "intelligent_port"}, {"score": 0.004653339900995785, "phrase": "considerable_challenges"}, {"score": 0.004543436145505023, "phrase": "security_threats"}, {"score": 0.004436116555817464, "phrase": "innovative_solutions"}, {"score": 0.004405919996432158, "phrase": "minimal_reliance"}, {"score": 0.004375928080972614, "phrase": "manual_interventions"}, {"score": 0.003896079090280495, "phrase": "mombasa"}, {"score": 0.0038695436922618876, "phrase": "radio_frequency_identification"}, {"score": 0.003688773272422118, "phrase": "embedded_intelligence"}, {"score": 0.0030879936732269293, "phrase": "remedial_measures"}, {"score": 0.0029739847626249157, "phrase": "alert_generation"}, {"score": 0.002854392852477005, "phrase": "relevant_persons"}, {"score": 0.002693134880651768, "phrase": "working_operations"}, {"score": 0.0026747708876640377, "phrase": "supporting_technologies"}, {"score": 0.0024387423375226507, "phrase": "simulation_design"}, {"score": 0.0021857667493036786, "phrase": "likely_direction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intelligent port", " Intelligent port simulations", " Intelligent logistics", " RFID", " RFID simulations"], "paper_abstract": "Ports globally face considerable challenges ranging from efficiency in operations to security threats. These call for research on innovative solutions with minimal reliance on manual interventions and controls. This paper discusses the design and operation of an intelligent model of a port. The model is designed based on the challenges, experiences and operations of the port of Mombasa. Radio Frequency Identification (RFID) technology is central to the model in enabling intelligence. The embedded intelligence includes: what is entering or has entered the port; what is in the port; what is leaving or has left the port; legal (authorized) and illegal (un-authorized) transactions and movements; and, health and risk status of the cargo. Remedial measures are instituted upon observation of violations or deviations together with alert generation on violations or whenever set thresholds are exceeded that are then sent to relevant persons or agencies as defined in the system. The basis of the intelligent model, design, working operations and supporting technologies are presented. Simulations of the model are undertaken for movement of goods from arrival at the port to release using four simulations. Details of the simulation design and results are presented. An evaluation of the model and how it addresses the challenges currently being experienced are provided. Finally, the benefits of implementation, limitations and likely direction of the future are enumerated. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "RFID based model for an intelligent port", "paper_id": "WOS:000297189100002"}