{"auto_keywords": [{"score": 0.049826799506450456, "phrase": "chordal_graphs"}, {"score": 0.022987826627663403, "phrase": "polynomial_time"}, {"score": 0.019886111242688284, "phrase": "np"}, {"score": 0.009706186461142423, "phrase": "edge_contractions"}, {"score": 0.00481495049065317, "phrase": "fixed_patterns"}, {"score": 0.004726803158961502, "phrase": "contractibility_problem"}, {"score": 0.004253056919550972, "phrase": "vertex_deletions"}, {"score": 0.004164140506290362, "phrase": "vertex_dissolutions"}, {"score": 0.00403422512824534, "phrase": "h._we"}, {"score": 0.003908347021394284, "phrase": "fixed_h"}, {"score": 0.003877493646278466, "phrase": "input_graph"}, {"score": 0.003582001862325226, "phrase": "contractibility"}, {"score": 0.0035631141969666782, "phrase": "induced_minor"}, {"score": 0.0034701799486223698, "phrase": "classic_disjoint_paths_problem"}, {"score": 0.0033707400151191877, "phrase": "k_paths"}, {"score": 0.003317702336732309, "phrase": "specified_set"}, {"score": 0.003089140979429533, "phrase": "fixed_k."}, {"score": 0.003064734704643992, "phrase": "induced_topological_minor"}, {"score": 0.0030085317219673046, "phrase": "disjoint_paths"}, {"score": 0.00299266329873328, "phrase": "induced_disjoint_paths"}, {"score": 0.002945556972573912, "phrase": "different_paths"}, {"score": 0.0026219720371350942, "phrase": "general_framework"}, {"score": 0.0026081371792468708, "phrase": "graph_containment_problems"}, {"score": 0.002467194985250203, "phrase": "specified_graph_operations"}, {"score": 0.002371198394503181, "phrase": "vertex_dissolution_results"}, {"score": 0.002155738023005989, "phrase": "existing_results"}, {"score": 0.0021049977753042253, "phrase": "ten_corresponding_containment_problems"}], "paper_keywords": [""], "paper_abstract": "The Contractibility problem takes as input two graphs G and H, and the task is to decide whether H can be obtained from G by a sequence of edge contractions. The Induced Minor and Induced Topological Minor problems are similar, but the first allows both edge contractions and vertex deletions, whereas the latter allows only vertex deletions and vertex dissolutions. All three problems are NP-complete, even for certain fixed graphs H. We show that these problems can be solved in polynomial time for every fixed H when the input graph G is chordal. Our results can be considered tight, since these problems are known to be W[1]-hard on chordal graphs when parameterized by the size of H. To solve Contractibility and Induced Minor, we define and use a generalization of the classic Disjoint Paths problem, where we require the vertices of each of the k paths to be chosen from a specified set. We prove that this variant is NP-complete even when k=2, but that it is polynomial-time solvable on chordal graphs for every fixed k. Our algorithm for Induced Topological Minor is based on another generalization of Disjoint Paths called Induced Disjoint Paths, where the vertices from different paths may no longer be adjacent. We show that this problem, which is known to be NP-complete when k=2, can be solved in polynomial time on chordal graphs even when k is part of the input. Our results fit into the general framework of graph containment problems, where the aim is to decide whether a graph can be modified into another graph by a sequence of specified graph operations. Allowing combinations of the four well-known operations edge deletion, edge contraction, vertex deletion, and vertex dissolution results in the following ten containment relations: (induced) minor, (induced) topological minor, (induced) subgraph, (induced) spanning subgraph, dissolution, and contraction. Our results, combined with existing results, settle the complexity of each of the ten corresponding containment problems on chordal graphs.", "paper_title": "Detecting Fixed Patterns in Chordal Graphs in Polynomial Time", "paper_id": "WOS:000335752000002"}