{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "requirements_model"}, {"score": 0.009148606418879228, "phrase": "contextual_goal_model"}, {"score": 0.008266888346929303, "phrase": "deployment_environment"}, {"score": 0.004756521061849989, "phrase": "host_environment"}, {"score": 0.004660702714929615, "phrase": "main_development_phase"}, {"score": 0.004384623928442369, "phrase": "ultimate_goal"}, {"score": 0.004158563941891469, "phrase": "deployed_software"}, {"score": 0.003976373766630594, "phrase": "deployment_environments"}, {"score": 0.0037406791638601206, "phrase": "software_functionalities"}, {"score": 0.003447932289587852, "phrase": "additional_functionalities"}, {"score": 0.0032567057896906314, "phrase": "system_environment"}, {"score": 0.003217124533918232, "phrase": "basic_and_critical_step"}, {"score": 0.0031650944584992726, "phrase": "comprehensive_deployment_process"}, {"score": 0.0031012349116334606, "phrase": "tool-supported_modelling"}, {"score": 0.0025499307228648883, "phrase": "varying_states"}, {"score": 0.0021049977753042253, "phrase": "obtained_results"}], "paper_keywords": ["Requirements engineering", " Contextual requirements", " Deployment", " Context-sensitive systems modelling"], "paper_abstract": "Deployment is a main development phase which configures a software to be ready for use in a certain environment. The ultimate goal of deployment is to enable users to achieve their requirements while using the deployed software. However, requirements are not uniform and differ between deployment environments. In one environment, certain requirements could be useless or redundant, thereby making some software functionalities superfluous. In another environment, instead, some requirements could be impossible to achieve and, thus, additional functionalities would be required. We advocate that ensuring fitness between requirements and the system environment is a basic and critical step to achieve a comprehensive deployment process. We propose a tool-supported modelling and analysis approach to tailor a requirements model to each environment in which the system is to be deployed. We study the case of a contextual goal model, which is a requirements model that captures the relationship between the variability of requirements (goal variability space) and the varying states of a deployment environment (context variability space). Our analysis relies on sampling a deployment environment to discover its context variability space and use it to identify loci in the contextual goal model where a modification has to take place. Finally, we apply our approach in practice and report on the obtained results.", "paper_title": "Requirements-driven deployment Customizing the requirements model for the host environment", "paper_id": "WOS:000331000000019"}