{"auto_keywords": [{"score": 0.03666106118361921, "phrase": "pml"}, {"score": 0.008713753786780007, "phrase": "fourth-order_precise_integration_time_domain_method"}, {"score": 0.008400772422284812, "phrase": "maxwell's_equations"}, {"score": 0.00428629884026304, "phrase": "perfectly_matched_layer"}, {"score": 0.004081385289516914, "phrase": "berenger's_split_field"}, {"score": 0.003958299299658418, "phrase": "recently_proposed_low-dispersion_precise_integration_time_domain_method"}, {"score": 0.0031942814007173254, "phrase": "larger_time_steps"}, {"score": 0.0026252106881752067, "phrase": "finite-difference_time-domain"}, {"score": 0.002514887658420787, "phrase": "pml."}, {"score": 0.0023652572260178637, "phrase": "later_time_reflection_error"}, {"score": 0.0021441057555396013, "phrase": "fdtd_method"}], "paper_keywords": ["Fourth-order precise integration time domain (PITD(4)) method", " Perfectly matched layer"], "paper_abstract": "Purpose - The purpose of the paper is to introduce a perfectly matched layer (PML) absorber, based on Berenger's split field PML, to the recently proposed low-dispersion precise integration time domain method using a fourth-order accurate finite difference scheme (PITD(4)). Design/methodology/approach - The validity and effectiveness of the PITD(4) method with the inclusion of the PML is investigated through a two-dimensional (2-D) point source radiating example. Findings - Numerical results indicate that the larger time steps remain unchanged in the procedure of the PITD(4) method with the PML, and meanwhile, the PITD(4) method employing the PML is of the same absorbability as that of the finite-difference time-domain (FDTD) method with the PML. In addition, it is also demonstrated that the later time reflection error of the PITD(4) method employing the PML is much lower than that of the FDTD method with the PML. Originality/value - An efficient application of PML in fourth-order precise integration time domain method for the numerical solution of Maxwell's equations.", "paper_title": "An efficient application of PML in fourth-order precise integration time domain method for the numerical solution of Maxwell's equations", "paper_id": "WOS:000332135500012"}