{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "random_forests"}, {"score": 0.04911241438594345, "phrase": "missing_values"}, {"score": 0.012586519146898782, "phrase": "multiple_imputation"}, {"score": 0.012459783625028321, "phrase": "complete_case_analysis"}, {"score": 0.012087089395834591, "phrase": "self-contained_importance_measure"}, {"score": 0.004669845451682529, "phrase": "variable_selection"}, {"score": 0.004483120978156604, "phrase": "data_prediction"}, {"score": 0.0043258453436258405, "phrase": "basic_element"}, {"score": 0.003926105480202798, "phrase": "predictor_variables"}, {"score": 0.0038862297330905836, "phrase": "possible_solutions"}, {"score": 0.0035269696779744266, "phrase": "simulation_and_application_studies"}, {"score": 0.0030414140732789186, "phrase": "inaccurate_variable_selection"}, {"score": 0.0021705796895687864, "phrase": "actual_prediction_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Random Forests", " Variable importance", " Variable selection", " Missing data", " Multiple imputation", " Complete case analysis"], "paper_abstract": "Variable selection has been suggested for Random Forests to improve data prediction and interpretation. However, the basic element, i.e. variable importance measures, cannot be computed straightforward when there are missing values in the predictor variables. Possible solutions are multiple imputation, complete case analysis and the use of a self-contained importance measure that is able to deal with missing values. Simulation and application studies have been conducted to investigate the properties of these procedures when combined with two popular variable selection methods. Findings and recommendations: Complete case analysis should not be used as it led to inaccurate variable selection. Multiple imputation is the method of choice if the selection of a variable is supposed to reflect its potential relevance in a complete data setting. However, Random Forests are commonly used without any preprocessing of the data as they are known to implicitly deal with missing values. In such a case, the application of the self-contained importance measure permits the selection of variables that are of relevance in these actual prediction models. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Variable selection by Random Forests using data with missing values", "paper_id": "WOS:000341346300012"}