{"auto_keywords": [{"score": 0.04086595472417846, "phrase": "load_balancing_problem"}, {"score": 0.015719716506582538, "phrase": "large-scale_rfid_systems"}, {"score": 0.009997529947519436, "phrase": "mta"}, {"score": 0.004628400269774981, "phrase": "physical_objects"}, {"score": 0.004369824355829779, "phrase": "rf_communication"}, {"score": 0.0038671299350540554, "phrase": "readers_-_how"}, {"score": 0.003611751858608048, "phrase": "different_readers"}, {"score": 0.003397535839387366, "phrase": "centralized_solutions"}, {"score": 0.002984804493334037, "phrase": "mca"}, {"score": 0.002879878203226465, "phrase": "np"}, {"score": 0.002727967804120323, "phrase": "optimal_centralized_solution"}, {"score": 0.0025660347613972573, "phrase": "localized_distributed_algorithm"}, {"score": 0.002448704249007665, "phrase": "centralized_algorithms"}, {"score": 0.0024050158199950024, "phrase": "detailed_simulation_results"}, {"score": 0.0023451553255837317, "phrase": "localized_distributed_approach"}, {"score": 0.002286781334850213, "phrase": "centralized_optimal_and_near-optimal_solutions"}, {"score": 0.002197966048531954, "phrase": "tag_distribution"}, {"score": 0.0021821915946356168, "phrase": "reader_topology"}, {"score": 0.0021049977753042253, "phrase": "highly_dynamic_large-scale_rfid_systems"}], "paper_keywords": ["RFID", " load balancing", " min-max assignment"], "paper_abstract": "A radio frequency identifier (RFID) system consists of inexpensive, uniquely-identifiable tags that are mounted on physical objects, and readers that track these tags (and hence these physical objects) through RF communication. For many performance measures in large-scale RFID systems, the set of tags to be monitored needs to be properly balanced among all readers. In this paper we, therefore, address this load balancing problem for readers - how should a given set of tags be assigned to readers such that the cost for monitoring tags across the different readers is balanced, while guaranteeing that each tag is monitored by at least one reader. We first present centralized solutions to two different variants of this load balancing problem: (i) min-max cost assignment (MCA), and (ii) min-max tag count assignment (MTA). We show that MCA, the generalized variant of the load balancing problem, is NP-hard and hence present a 2-approximation algorithm for it. We next present an optimal centralized solution for MTA, an important specialized variant of the problem. Subsequently, we present a localized distributed algorithm that is probabilistic in nature and closely matches the performance of the centralized algorithms. Finally we present detailed simulation results that illustrate the performance of the localized distributed approach, how it compares with the centralized optimal and near-optimal solutions, and how it adapts the solution with changes in tag distribution and reader topology. Our results demonstrate that our schemes achieve very good performance even in highly dynamic large-scale RFID systems. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Load balancing in large-scale RFID systems", "paper_id": "WOS:000257012600008"}