{"auto_keywords": [{"score": 0.044203664887322844, "phrase": "pxi_bus-based_airborne_dte_test_system"}, {"score": 0.041425500262378435, "phrase": "neural_network"}, {"score": 0.024263364984552758, "phrase": "rough_set_theory"}, {"score": 0.012982546498360038, "phrase": "genetic_algorithm"}, {"score": 0.01248289411401327, "phrase": "decision_table"}, {"score": 0.009567685837204092, "phrase": "airborne_dte_test_system"}, {"score": 0.008415950949652974, "phrase": "novel_type"}, {"score": 0.0073906236738049145, "phrase": "fault_diagnosis"}, {"score": 0.00644432327690246, "phrase": "exact_application_results"}, {"score": 0.006267121820635722, "phrase": "developed_pxi_bus-based_airborne_dte_test_system"}, {"score": 0.00481495049065317, "phrase": "pxi_bus-based_airborne_data_transfer_equipment_test_system"}, {"score": 0.004628166081300344, "phrase": "pci_extension_for_instruments"}, {"score": 0.004386887374401584, "phrase": "pxi_bus"}, {"score": 0.004148462909715379, "phrase": "basic_conceptions"}, {"score": 0.004100439335557726, "phrase": "novel_hybrid_approach"}, {"score": 0.003770633265791941, "phrase": "condition_attributes"}, {"score": 0.0037096421179582373, "phrase": "input_nodes"}, {"score": 0.0036666797316998755, "phrase": "decision_attributes"}, {"score": 0.003624213094684988, "phrase": "output_nodes"}, {"score": 0.003225594765084394, "phrase": "newly_developed_airborne_dte_test_system"}, {"score": 0.0031220308415626963, "phrase": "proposed_hybrid_rough_set_theory"}, {"score": 0.0030858526648975906, "phrase": "neural_network_approach"}, {"score": 0.002884111441153185, "phrase": "different_unit"}, {"score": 0.0027979977327569077, "phrase": "definite_operators"}, {"score": 0.002658068304632523, "phrase": "newly_developed_pxi_bus-based_airborne_dte_test_system"}, {"score": 0.002536926192232391, "phrase": "practical_implementations"}, {"score": 0.0025192361321332325, "phrase": "hidden_errors"}, {"score": 0.002426946565101301, "phrase": "general_performance"}, {"score": 0.0023599497127331235, "phrase": "minimum_time"}, {"score": 0.002310915790114425, "phrase": "army_combat_capability"}, {"score": 0.0021049977753042253, "phrase": "effective_way"}], "paper_keywords": ["Program testing", " Data management", " Diagnostic testing", " Aircraft components"], "paper_abstract": "Purpose - The purpose of this paper is to design and implement a novel type of PCI eXtension for Instruments (PXI) bus-based airborne data transfer equipment (DTE) test system. Design/methodology/approach - First, the basic principle of PXI bus is introduced in detail. Then, the hardware and software are developed for the PXI bus-based airborne DTE test system. Based on the description of the basic conceptions of rough set theory, a novel hybrid approach for fault diagnosis in PXI bus-based airborne DTE test system is proposed, which is based on rough set theory, genetic algorithm and neural network. Combining with rough set theory, genetic algorithm is used to compute the reductions of the decision table. Subsequently, the condition attributes of decision table are regarded as the input nodes of neural network and the decision attributes are regarded as the output nodes of neural network correspondingly. Findings - The exact application results are also presented to verify the feasibility and effectiveness of the developed PXI bus-based airborne DTE test system, and the test results can also be saved automatically. The exact application results show that the various faults within the PXI bus-based airborne DTE test system can be located on board level, and the newly developed airborne DTE test system is also easy to be extended and upgraded. Practical implications - The proposed hybrid rough set theory, genetic algorithm and neural network approach could reduce the number of attributes in the decision table, simplify the structure of neural network and improve the ability of generality. The airborne DTE test system is also capable of different unit under test (UUT), which can be selected by the definite operators at the start of the test, to ensure that failures and problems are handled automatically and without intervention. This newly developed PXI bus-based airborne DTE test system can be located on board level, and it is also very easy to be extended and upgraded. Practical implementations show that hidden errors can be effectively detected by the developed PXI bus-based airborne DTE test system. The proposed methodology can help improve the general performance of the airborne DTE test system, and the faults can be checked with minimum time and effort. This system can enhance the army combat capability efficiently. Originality/value - This paper develops a novel type of PXI bus-based airborne DTE test system. In particular, a hybrid approach for fault diagnosis in PXI bus-based airborne DTE test system is proposed, which is based on rough set theory, genetic algorithm and neural network. This approach provides an effective way to diagnosis the faults of the airborne DTE test system.", "paper_title": "Novel type of PXI bus-based airborne data transfer equipment test system", "paper_id": "WOS:000273285900013"}