{"auto_keywords": [{"score": 0.04931727328027495, "phrase": "xpath_queries"}, {"score": 0.00481495049065317, "phrase": "query_rewritings"}, {"score": 0.004303404058571052, "phrase": "pre-computed_materialized_views"}, {"score": 0.004167451906343558, "phrase": "data_caching"}, {"score": 0.004134137523409649, "phrase": "query_optimization"}, {"score": 0.004101088357088207, "phrase": "schema_integration"}, {"score": 0.003923965929636472, "phrase": "relational_databases"}, {"score": 0.0037244390953401533, "phrase": "xml_data"}, {"score": 0.0027667539384678814, "phrase": "formal_definitions"}, {"score": 0.002553063001454625, "phrase": "query_containment"}, {"score": 0.0023182554418193927, "phrase": "different_characteristics"}, {"score": 0.0022358683283304533, "phrase": "maximality_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["XML", " Query", " View", " Rewriting", " Pattern", " Containment", " Embedding", " Maximality"], "paper_abstract": "Query rewriting using views is a technique that allows a query to be answered efficiently by using pre-computed materialized views. It has many applications, such as data caching, query optimization, schema integration, etc. This issue has been studied extensively for relational databases and, as a result, the technology is maturing. For XML data, however, the work is inadequate. Recently, several frameworks have been proposed for query rewriting using views for XPath queries. with the requirement that a rewriting must be complete. In this paper, we study the problem of query rewriting using views for XPath queries without requiring that the rewriting be complete. This will increase its applicability since in many cases, complete rewritings using views do not exist. We give formal definitions for various concepts to formulate the problem, and then propose solutions. Our solutions are built under the framework for query containment. We look into the problem from both theoretic perspectives, and algorithmic approaches. Two methods to generate rewritings using views are proposed, with different characteristics in terms of generalities and efficiencies. The maximality properties of the rewritings generated by these methods are discussed. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Query rewritings using views for XPath queries, framework, and methodologies", "paper_id": "WOS:000274562300004"}