{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cross-organizational_business_process"}, {"score": 0.004348936976349555, "phrase": "rapidly_evolving_business_landscape"}, {"score": 0.002893140560765452, "phrase": "product-based_workflow_design"}, {"score": 0.0027575842698911173, "phrase": "monitoring_requirements"}, {"score": 0.002628362641980801, "phrase": "monitoring_process"}, {"score": 0.002597012212823168, "phrase": "lowest_cost"}, {"score": 0.0025660347613972573, "phrase": "highest_availability"}, {"score": 0.0024901940672239784, "phrase": "optimal_monitoring_process"}, {"score": 0.002445767214680791, "phrase": "service-oriented_approach"}, {"score": 0.002262209824105154, "phrase": "antcolony_optimization_heuristic"}, {"score": 0.002169132543304098, "phrase": "prototypical_implementation"}, {"score": 0.0021049977753042253, "phrase": "prom_framework"}], "paper_keywords": ["Business process monitoring", " Product-based workflow design", " Ant colony optimization", " Service-based systems"], "paper_abstract": "Organizations can implement the agility required to survive in the rapidly evolving business landscape by focusing on their core business and engaging in collaborations with other partners. This entails the need for organizations to monitor the behavior of the partners with which they collaborate. The design and enactment of monitoring, in this scenario, must become flexible and adapt as the collaboration evolves. We propose an approach to flexibly design and enact cross-organizational business process monitoring based on Product-Based Workflow Design. Our approach allows organizations to capture monitoring requirements, optimize such requirements, e.g. choosing the monitoring process with lowest cost or highest availability, and enacting the optimal monitoring process through a service-oriented approach. Optimization, in particular, is made efficient by adopting an Antcolony optimization heuristic. The paper also describes a prototypical implementation of our approach in the ProM framework. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Optimized cross-organizational business process monitoring: Design and enactment", "paper_id": "WOS:000321479800007"}