{"auto_keywords": [{"score": 0.03606242426841463, "phrase": "temporal_rare_utility_itemsets"}, {"score": 0.00667742198551958, "phrase": "trui-mine"}, {"score": 0.004605258779434384, "phrase": "individual_items"}, {"score": 0.004470539706227421, "phrase": "utility_mining"}, {"score": 0.004296998284839309, "phrase": "highest_utilities"}, {"score": 0.0042336638794732255, "phrase": "temporal_significant_rare_utility_itemsets"}, {"score": 0.0040491842732233154, "phrase": "current_time_window"}, {"score": 0.004009288598277725, "phrase": "large_databases"}, {"score": 0.0038919354605673104, "phrase": "specific_data"}, {"score": 0.003685604033479918, "phrase": "tp-rui"}, {"score": 0.003192406091820197, "phrase": "first_work"}, {"score": 0.003053159610975692, "phrase": "novel_contribution"}, {"score": 0.002670719148310961, "phrase": "time_windows"}, {"score": 0.0026443691099806003, "phrase": "temporal_databases"}, {"score": 0.0025668646315794947, "phrase": "limited_memory_space"}, {"score": 0.0024793019587009035, "phrase": "experimental_results"}], "paper_keywords": ["Utility mining", " Temporal significant rare utility itemsets", " Temporal databases", " Association rules"], "paper_abstract": "Utility itemsets are considered to be the different values of individual items such as utilities, and utility mining and aims at identifying the itemsets with highest utilities. The temporal significant rare utility itemsets are those itemsets which appear infrequently in the current time window of large databases but are highly associated with specific data. In this paper, we propose two novel algorithms, namely TP-RUI (Two-Phase Rare Utility Itemsets) -Mine and TRUI (Temporal Rare Utility Itemsets) -Mine, for mining temporal rare utility itemsets from temporal databases. To the best of our knowledge, this is the first work on mining temporal rare utility itemsets from temporal databases. The novel contribution of TRUI-Mine is particularly that it can effectively identify the temporal rare utility itemsets by generating fewer temporal high transaction-weighted utilization 2-itemsets in temporal databases. In this way, the process under all time windows of temporal databases can be achieved effectively with limited memory space, less candidate itemsets and CPU I/O time. The experimental results show that TRUI-Mine can discover the temporal rare utility itemsets with higher performance and less candidate itemsets compared to the other algorithm TP-RUI-Mine that is also proposed in this paper by us under various experimental conditions.", "paper_title": "MINING TEMPORAL RARE UTILITY ITEMSETS IN LARGE DATABASES USING RELATIVE UTILITY THRESHOLDS", "paper_id": "WOS:000260923100002"}