{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "minimum_cycle_basis"}, {"score": 0.015119649415531204, "phrase": "directed_graph"}, {"score": 0.01236727901736258, "phrase": "vector_space"}, {"score": 0.006661494523301497, "phrase": "cycle_space"}, {"score": 0.004785896736401194, "phrase": "directed_graphs."}, {"score": 0.0045509185176876524, "phrase": "undirected_graph"}, {"score": 0.004450568197899267, "phrase": "nonnegative_weights"}, {"score": 0.004278807087784626, "phrase": "underlying_undirected_graph"}, {"score": 0.003930953151925098, "phrase": "right_direction"}, {"score": 0.0036553070575015344, "phrase": "g._a_set"}, {"score": 0.0034195866335851935, "phrase": "cycle_basis"}, {"score": 0.003287482882222731, "phrase": "current_fastest_algorithm"}, {"score": 0.00297454367746853, "phrase": "matrix_multiplication"}, {"score": 0.0028595832692215766, "phrase": "fast_matrix_multiplication"}, {"score": 0.0027910516355928983, "phrase": "dijkstra's_algorithm"}, {"score": 0.0027574024919144635, "phrase": "shortest_cycle"}, {"score": 0.0025951294037626174, "phrase": "monte_carlo"}, {"score": 0.0022434880661725493, "phrase": "fastest_known_algorithm"}, {"score": 0.0021049977753042253, "phrase": "directed_graphs"}], "paper_keywords": ["cycle basis", " fast matrix multiplication", " randomization", " shortest paths"], "paper_abstract": "We consider the problem of computing a minimum cycle basis in a directed graph. The input to this problem is a directed graph G whose edges have nonnegative weights. A cycle in this graph is actually a cycle in the underlying undirected graph with edges traversable in both directions. A {-1, 0, 1} edge incidence vector is associated with each cycle: edges traversed by the cycle in the right direction get 1 and edges traversed in the opposite direction get -1. The vector space over Q generated by these vectors is the cycle space of G. A set of cycles is called a cycle basis of G if it forms a basis for this vector space. We seek a cycle basis where the sum of weights of the cycles is minimum. The current fastest algorithm for computing a minimum cycle basis in a directed graph with m edges and n vertices runs in (O) over tilde (m(omega+1)n) time, where omega < 2.376 is the exponent of matrix multiplication. We present an O(m(3)n + m(2)n(2) log n) algorithm. We obtain our algorithm by using fast matrix multiplication over rings and an efficient extension of Dijkstra's algorithm to compute a shortest cycle in G whose dot product with a function on its edge set is nonzero. We also present a simple O(m(2)n + mn(2) log n) Monte Carlo algorithm. The problem of computing a minimum cycle basis in an undirected graph has been well studied. In this problem a {0, 1} edge incidence vector is associated with each cycle and the vector space over Z(2) generated by these vectors is the cycle space of the graph. The fastest known algorithm for computing a minimum cycle basis in an undirected graph runs in O(m(2)n + mn(2) log n) time and our randomized algorithm for directed graphs matches this running time.", "paper_title": "FASTER ALGORITHMS FOR MINIMUM CYCLE BASIS IN DIRECTED GRAPHS", "paper_id": "WOS:000261891600009"}