{"auto_keywords": [{"score": 0.04914293238940668, "phrase": "soil-pile_pressure"}, {"score": 0.007740489563401459, "phrase": "slope_angle"}, {"score": 0.007441546145298804, "phrase": "sandy_slopes"}, {"score": 0.005835475269379995, "phrase": "lateral_active_stress"}, {"score": 0.0050992676305986915, "phrase": "stabilizing_piles"}, {"score": 0.004758754431836072, "phrase": "proposed_model"}, {"score": 0.004434547543497673, "phrase": "lateral_soil_movement"}, {"score": 0.004405440436639404, "phrase": "lateral_force_loading"}, {"score": 0.004248718518635191, "phrase": "horizontal_semi"}, {"score": 0.0040975489787831955, "phrase": "limit_equilibrium_method"}, {"score": 0.004057258742593542, "phrase": "lateral_force"}, {"score": 0.0038616499489536123, "phrase": "semi-infinite_slopes"}, {"score": 0.0037611961382938964, "phrase": "soil_arching_effects"}, {"score": 0.0034751895536268953, "phrase": "squeezing_effect"}, {"score": 0.0034184084790182556, "phrase": "ito"}, {"score": 0.0033959306929096347, "phrase": "matsui"}, {"score": 0.003116989767430614, "phrase": "numerical_simulation"}, {"score": 0.003025854378927907, "phrase": "proposed_approach"}, {"score": 0.0027408292745619233, "phrase": "numerical_results"}, {"score": 0.002574328937802055, "phrase": "experimental_data"}, {"score": 0.0025489778320184255, "phrase": "published_literature"}, {"score": 0.0025322155884631384, "phrase": "parametric_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Stabilizing piles", " Sandy slope", " Soil arching", " Slope angle", " Limit equilibrium method"], "paper_abstract": "In the past, the response of stabilizing piles subjected to lateral soil movement or lateral force loading has been analysed assuming that the piles are embedded in horizontal semi-infinite soil grounds. In this study, a limit equilibrium method analysing the lateral force (soil-pile pressure per unit thickness) on stabilizing piles embedded in semi-infinite slopes is presented. In addition, the soil arching effects between two neighbouring stabilizing piles are analysed, and the lateral active stress in the rear of the piles is obtained. Furthermore, the squeezing effect between two piles proposed by Ito and Matsui is combined with the lateral active stress in the slope to evaluate the distribution of the soil-pile pressure per unit length of the stabilizing piles in sandy slopes. A numerical simulation using FLAC(3D) is used to evaluate the proposed approach. The simulation shows that the proposed model could reasonably predict the shape of the distribution of the soil-pile pressure acting on the stabilizing piles, while some discrepancy exists between the numerical results and predicted values. Furthermore, the prediction of the proposed model is also evaluated through comparison to the experimental data from the published literature. Parametric analysis is carried out to investigate the influence of the slope angle on the distribution of the soil-pile pressure. The shape of the distribution of the soil-pile pressure acting on the piles is shown to vary with the angle of the slope, while the magnitude of the soil-pile pressure remains in the same order. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating the effect of slope angle on the distribution of the soil-pile pressure acting on stabilizing piles in sandy slopes", "paper_id": "WOS:000361073900014"}