{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "functional_data_analysis"}, {"score": 0.0072879067174280695, "phrase": "second_part"}, {"score": 0.004719555598790209, "phrase": "measured_spectra"}, {"score": 0.004482804453576502, "phrase": "multivariate_data_analysis_techniques"}, {"score": 0.004055779248961644, "phrase": "physical_point"}, {"score": 0.0037435277798679722, "phrase": "physical_background"}, {"score": 0.0036483395389139556, "phrase": "absorption_peaks"}, {"score": 0.0036171490978544607, "phrase": "different_chemical_components"}, {"score": 0.003445356410458517, "phrase": "first_part"}, {"score": 0.003386685386000115, "phrase": "motivating_example"}, {"score": 0.0033577243441658302, "phrase": "functional_approach"}, {"score": 0.0031437375178303625, "phrase": "ubiquitous_pls_regression_technique"}, {"score": 0.0030637534925896585, "phrase": "spectral_data"}, {"score": 0.0029772596754941076, "phrase": "appealing_basis"}, {"score": 0.002876681496936827, "phrase": "pls"}, {"score": 0.0028276605157505977, "phrase": "predictive_ability"}, {"score": 0.002693262404213432, "phrase": "specific_structure"}, {"score": 0.002367467366291158, "phrase": "traditional_analysis"}, {"score": 0.0023005852665667903, "phrase": "spectroscopic_data"}, {"score": 0.002166206144892777, "phrase": "ambient_temperature"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["functional data analysis", " B-splines", " PLS", " functional regression", " FANOVA"], "paper_abstract": "In spectroscopy the measured spectra are typically plotted as a function of the wavelength (or wavenumber), but analysed with multivariate data analysis techniques (multiple linear regression (MLR), principal components regression (PCR), partial least squares (PLS)) which consider the spectrum as a set of m different variables. From a physical point of view it could be more informative to describe the spectrum as a function rather than as a set of points, hereby taking into account the physical background of the spectrum, being a sum of absorption peaks for the different chemical components, where the absorbance at two wavelengths close to each other is highly correlated. In a first part of this contribution, a motivating example for this functional approach is given. In a second part, the potential of functional data analysis is discussed in the field of chemometrics and compared to the ubiquitous PLS regression technique using two practical data sets. it is shown that for spectral data, the use of B-splines proves to be an appealing basis to accurately describe the data. By applying both functional data analysis and PLS on the data sets the predictive ability of functional data analysis is found to be comparable to that of PLS. Moreover, many chemometric datasets have some specific structure (e.g. replicate measurements, on the same object or objects that are grouped), but the structure is often removed before analysis (e.g. by averaging the replicates). In the second part of this contribution, we suggest a method to adapt traditional analysis of variance (ANOVA) methods to datasets with spectroscopic data. In particular, the possibilities to explore and interpret sources of variation, such as variations in sample and ambient temperature, are examined. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "Potential applications of functional data analysis in chemometrics", "paper_id": "WOS:000256935000006"}