{"auto_keywords": [{"score": 0.03802951425141935, "phrase": "single_probability"}, {"score": 0.00481495049065317, "phrase": "conditional_probabilistic_logic_programming"}, {"score": 0.004543046350523362, "phrase": "precise_probability"}, {"score": 0.004449688143230257, "phrase": "maximum_entropy_principle"}, {"score": 0.004010785080336424, "phrase": "priori_knowledge"}, {"score": 0.003660374693346876, "phrase": "probability_interval"}, {"score": 0.003340475943517995, "phrase": "probabilistic_logic_program"}, {"score": 0.0029981559422442693, "phrase": "high_value"}, {"score": 0.0027020387992490367, "phrase": "exact_probability"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["Probabilistic logic programming", " Queries", " Ignorance", " Imprecise probability"], "paper_abstract": "In conditional probabilistic logic programming, given a query, the two most common forms for answering the query are either a probability interval or a precise probability obtained by using the maximum entropy principle. The former can be noninformative (e.g., interval [0, 1]) and the reliability of the latter is questionable when the priori knowledge is imprecise. To address this problem, in this paper, we propose some methods to quantitatively measure if a probability interval or a single probability is sufficient for answering a query. We first propose an approach to measuring the ignorance of a probabilistic logic program with respect to a query. The measure of ignorance (w.r.t. a query) reflects how reliable a precise probability for the query can be and a high value of ignorance suggests that a single probability is not suitable for the query. We then propose a method to measure the probability that the exact probability of a query falls in a given interval, e.g., a second order probability. We call it the degree of satisfaction. If the degree of satisfaction is high enough w.r.t. the query, then the given interval can be accepted as the answer to the query. We also prove our measures satisfy many properties and we use a case study to demonstrate the significance of the measures.", "paper_title": "Imprecise probabilistic query answering using measures of ignorance and degree of satisfaction", "paper_id": "WOS:000304153500003"}