{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mcr-als_analysis"}, {"score": 0.04211704685011179, "phrase": "calibration_sets"}, {"score": 0.038108677336785184, "phrase": "spectral_overlap"}, {"score": 0.015616052025887846, "phrase": "excitation-emission_matrix_fluorescence"}, {"score": 0.013498394677226737, "phrase": "curve_resolution_technique"}, {"score": 0.012382927095975844, "phrase": "present_work"}, {"score": 0.008617466326184823, "phrase": "pure_eemf_spectra"}, {"score": 0.0047192824773697, "phrase": "data_sets"}, {"score": 0.004656557209439822, "phrase": "non-negativity_constraints"}, {"score": 0.00447331713604276, "phrase": "spectroscopic_data_sets"}, {"score": 0.0039655692352351625, "phrase": "commonly_used_mathematical_constraints"}, {"score": 0.0038737214010638745, "phrase": "multi-component_systems"}, {"score": 0.0038478705530517296, "phrase": "significant_spectral_overlap"}, {"score": 0.0037087324991876727, "phrase": "simple_system"}, {"score": 0.0035507457285983268, "phrase": "mcr-als_technique"}, {"score": 0.0030233510365494406, "phrase": "fluorescence_signatures"}, {"score": 0.002884792163423083, "phrase": "ten_calibration_sets"}, {"score": 0.002865521839875839, "phrase": "different_approaches"}, {"score": 0.002827365415832384, "phrase": "eemf_data_sets"}, {"score": 0.002431489080631481, "phrase": "calibration_set"}, {"score": 0.0023277839538663834, "phrase": "multifluorophoric_mixture"}, {"score": 0.0022585847551229252, "phrase": "pure_spectral_profiles"}, {"score": 0.002213596068643924, "phrase": "mathematical_constraints"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MCR-ALS", " EEMF", " Non-negativity", " Calibration set", " Purity"], "paper_abstract": "In this work, by analysing excitation-emission matrix fluorescence (EEMF) spectroscopic data sets with multivariate curve-resolution alternating least square (MCR-ALS) analysis under the commonly used mathematical constraint of non-negativity, an attempt was made to understand how the outconie of curve resolution technique can be influenced by the design of calibration sets. MCR-ALS analysis with commonly used mathematical constraints has been successfully used to analyse multi-component systems having significant spectral overlap. However, the present work showed that even for a simple system where the components do not have spectral overlap with each other, the MCR-ALS technique can resolve the spectra only if the calibration set is suitably designed. To carry out this study, three fluorophores-benzo[a]pyrene, perylene, and pyrene-having no spectral overlap with each other, were chosen. Selection of such fluorophores would enable the observation of fluorescence signatures of one fluorophore if it appears in the MCR-AIS retrieved profile of other fluorophores. Ten calibration sets with different approaches were created. EEMF data sets acquired for these calibration sets were subjected to MCR-ALS analysis. With most of the calibration sets, it was difficult to retrieve the pure EEMF spectra of all three fluorophores even if they did not have spectral overlap with each other. This work also evolved certain criterion for creating the calibration set which would enable the retrieval of pure EEMF spectra of all fluorophores of a multifluorophoric mixture using curve resolution technique. The present work clearly shows that pure spectral profiles of all the fluorophores under commonly used mathematical constraints can only be retrieved provided curve resolution analysis is performed on a suitably designed calibration set. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Understanding the effect of calibration set design for the application of MCR-ALS analysis on excitation-emission matrix fluorescence (EEMF) data sets under commonly used non-negativity constraints", "paper_id": "WOS:000368044700008"}