{"auto_keywords": [{"score": 0.04330964116308674, "phrase": "stem_concepts"}, {"score": 0.00481495049065317, "phrase": "cloud-hosted"}, {"score": 0.004671156704912419, "phrase": "high_school_stem_education"}, {"score": 0.00421668332357505, "phrase": "real-world_examples"}, {"score": 0.004168986485488861, "phrase": "student_interest"}, {"score": 0.0037918465913284478, "phrase": "innovative_and_attractive_modeling_and_simulation_frameworks"}, {"score": 0.0036645642553325215, "phrase": "real-world_example"}, {"score": 0.0035957006001349915, "phrase": "existing_traffic-related_tools"}, {"score": 0.0035415392642831616, "phrase": "traffic_simulators"}, {"score": 0.0032332256013507072, "phrase": "high_school_students"}, {"score": 0.002996840657035727, "phrase": "intuitive_abstractions"}, {"score": 0.0029629009627331355, "phrase": "google_maps"}, {"score": 0.0028525124381208705, "phrase": "dynamic_behavior"}, {"score": 0.002788257824525862, "phrase": "real-world_traffic_scenarios"}, {"score": 0.0026945722090537397, "phrase": "stem_problem"}, {"score": 0.0025260919226344305, "phrase": "stem_education"}, {"score": 0.0024785689583828796, "phrase": "key_contribution"}, {"score": 0.002288599327912511, "phrase": "stem"}, {"score": 0.0021782296784218923, "phrase": "user_study"}, {"score": 0.002153540857619362, "phrase": "sixty_high_school_students"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cloud", " Modeling", " Simulation-as-a-service", " STEM"], "paper_abstract": "Despite their advanced status, nations such as the United States of America continue to face a STEM (science, technology, engineering and mathematics) crisis in their education system. Lack of effective teaching modalities that can leverage real-world examples to stimulate student interest in STEM concepts are identified as one of the reasons for this crisis. To address these challenges, our research is investigating the use of innovative and attractive modeling and simulation frameworks for concurrent, interactive and collaborative STEM education where vehicular traffic serves as the real-world example to reify STEM concepts. Existing traffic-related tools, such as traffic simulators, however, do not provide: (1) intuitive abstractions to construct, refine, and simulate various traffic models that are commensurate to the level of high school students, (2) concurrent and scalable model execution, and (3) collaborative learning environments. On the other hand, although intuitive abstractions such as Google Maps exist, these abstractions do not support semantics for dynamic behavior, which is representative of real-world traffic scenarios. To overcome both these challenges and address the STEM problem, this paper presents a Cloud-based, Collaborative, and Scaled-up Modeling and Simulation Framework for STEM Education called C2SuMo. The key contribution of this paper lies in the design and implementation of a cloud-based, elastic modeling and simulation framework that provides an intuitive, model-driven, collaborative, and concurrent visual simulation environment for STEM education. The paper also reports on insights we gained conducting a user study involving over sixty high school students. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Cloud-hosted simulation-as-a-service for high school STEM education", "paper_id": "WOS:000365044400009"}