{"auto_keywords": [{"score": 0.037283253796596444, "phrase": "tactile_codes"}, {"score": 0.025539151721129437, "phrase": "primary_visual_task"}, {"score": 0.024032703300936147, "phrase": "haptic_medium"}, {"score": 0.00481495049065317, "phrase": "communicate_verb_phrases"}, {"score": 0.00469079145638866, "phrase": "enemy_assault"}, {"score": 0.004614815588012902, "phrase": "visual_and_auditory_awareness"}, {"score": 0.004322967486451877, "phrase": "tactile_medium"}, {"score": 0.00411620854480626, "phrase": "interpersonal_communication"}, {"score": 0.003919299546627271, "phrase": "verb_phrases"}, {"score": 0.0037932682371685433, "phrase": "three-by-three_tactile_display"}, {"score": 0.0036592924763139915, "phrase": "verb_phrase"}, {"score": 0.003611751858608048, "phrase": "tactile_codes-shape"}, {"score": 0.003179303164775306, "phrase": "graph-based_user-centric_model"}, {"score": 0.0031175178621644464, "phrase": "distinguishable_shapes"}, {"score": 0.0030569295881497176, "phrase": "presentable_shapes"}, {"score": 0.0029296522533971085, "phrase": "tactile_information"}, {"score": 0.0028633212043378564, "phrase": "users'_ability"}, {"score": 0.0028353540399641336, "phrase": "tactile_shapes"}, {"score": 0.002717277008333612, "phrase": "recognition_accuracy"}, {"score": 0.002587115505155995, "phrase": "graph_model"}, {"score": 0.002495633552236624, "phrase": "second_user_study"}, {"score": 0.0023682987863242427, "phrase": "secondary_audio_or_haptic_task"}, {"score": 0.0022845366011378238, "phrase": "auditory_medium"}, {"score": 0.0021049977753042253, "phrase": "audio_medium"}], "paper_keywords": ["Algorithms", " Human Factors", " Measurement", " Standardization", " Tactile interface", " tactile code", " user centric design", " Vibrotactile pattern perception", " graph model", " perception model", " communication"], "paper_abstract": "Soldiers, to guard themselves from enemy assault, have to maintain visual and auditory awareness of their environment. Their visual and auditory senses are thus saturated. This makes these channels less usable for communication. The tactile medium of communication with users is appropriate for displaying information in such situations. Research in interpersonal communication among soldiers shows that the most common form of communication between soldiers involves the use of verb phrases. In this article, we have developed a three-by-three tactile display and proposed a method for mapping the components of a verb phrase to two dimensions of tactile codes-shape and waveform. Perception of tactile codes by users depends on the ability of users to distinguish shape and waveform of the code. We have proposed a measure to rate the distinguish-ability of any two shapes and created a graph-based user-centric model using this measure to select distinguishable shapes from a set of all presentable shapes. We conducted two user studies to evaluate the ability of users to perceive tactile information. The results from our first study showed users' ability to perceive tactile shapes, tactile waveforms, and form verb phrases from tactile codes. The recognition accuracy and time taken to distinguish were better when the shapes were selected from the graph model than when shapes were chosen based on intuition. The second user study was conducted to test the performance of users while performing a primary visual task simultaneously with a secondary audio or haptic task. Users were more familiar with perceiving information from an auditory medium than from a haptic medium, which was reflected in their performance. Thus the performance of users in the primary visual task was better while using an audio medium of communication than while using a haptic medium of communication.", "paper_title": "Designing Vibrotactile Codes to Communicate Verb Phrases", "paper_id": "WOS:000343984800003"}