{"auto_keywords": [{"score": 0.04377352312035198, "phrase": "cortical_organization"}, {"score": 0.00481495049065317, "phrase": "model-driven_harmonic_parameterization"}, {"score": 0.0045262653692203815, "phrase": "inter_subject_brain_surface_matching"}, {"score": 0.004327196832280818, "phrase": "cortical_surface"}, {"score": 0.003999578057088828, "phrase": "harmonic_mapping"}, {"score": 0.003932654396285872, "phrase": "hemisphere_surface"}, {"score": 0.0038668462001710314, "phrase": "rectangular_planar_domain"}, {"score": 0.0036144035798673967, "phrase": "previous_landmark-based_registration_methods"}, {"score": 0.0033405704229694656, "phrase": "cortical_sulci"}, {"score": 0.003035711716881469, "phrase": "sulcus-based_registration_techniques"}, {"score": 0.00293487292076612, "phrase": "sulcal_landmarks"}, {"score": 0.002805597755796506, "phrase": "manually_traced_sulci"}, {"score": 0.002651960559564796, "phrase": "freesurfer_software"}, {"score": 0.0023962545023307937, "phrase": "model-based_strategy"}, {"score": 0.0021049977753042253, "phrase": "anatomically_defined_landmarks"}], "paper_keywords": ["Cortical organization", " harmonic mapping", " parameterization", " surface matching"], "paper_abstract": "In the context of inter subject brain surface matching, we present a parameterization of the cortical surface constrained by a model of cortical organization. The parameterization is defined via an harmonic mapping of each hemisphere surface to a rectangular planar domain that integrates a representation of the model. As opposed to previous landmark-based registration methods we do not match folds between individuals but instead optimize the fit between cortical sulci and specific iso-coordinate axis in the model. This strategy overcomes some limitation to sulcus-based registration techniques such as topological variability in sulcal landmarks across subjects. Experiments on 62 subjects with manually traced sulci are presented and compared with the result of the Freesurfer software. The evaluation involves a measure of dispersion of sulci with both angular and area distortions. We show that the model-based strategy can lead to a natural, efficient and very fast (less than 5 min per hemisphere) method for defining inter subjects correspondences. We discuss how this approach also reduces the problems inherent to anatomically defined landmarks and open the way to the investigation of cortical organization through the notion of orientation and alignment of structures across the cortex.", "paper_title": "Model-Driven Harmonic Parameterization of the Cortical Surface: HIP-HOP", "paper_id": "WOS:000318643500005"}