{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_social_media"}, {"score": 0.04711187924763279, "phrase": "rumor_diffusion"}, {"score": 0.0037928847801943404, "phrase": "passive_learning"}, {"score": 0.0036813725040313002, "phrase": "theoretical_proof"}, {"score": 0.0036501160751879784, "phrase": "simulation_analysis"}, {"score": 0.003557924423642353, "phrase": "threshold_value"}, {"score": 0.003130633384437765, "phrase": "maximum_density"}, {"score": 0.0030908254851076005, "phrase": "rumor_spreaders"}, {"score": 0.003025597247856977, "phrase": "generation_speed"}, {"score": 0.0029998918671747168, "phrase": "new_rumor_spreaders"}, {"score": 0.0028745946327439656, "phrase": "best_rumor_diffusion_strategy"}, {"score": 0.002801935384649699, "phrase": "forwarding_rumor"}, {"score": 0.0025291601927956765, "phrase": "truth_dissemination"}, {"score": 0.002362192695471035, "phrase": "unknown_a"}, {"score": 0.0022731540640627307, "phrase": "maximum_proportion"}, {"score": 0.002132135985573126, "phrase": "rumor_diffusion_range"}], "paper_keywords": ["Rumor", " diffusion dynamics", " truth", " complex systems"], "paper_abstract": "In this paper, we propose a model to investigate how truth affects rumor diffusion in online social media. Our model reveals a relation between rumor and truth namely, when a rumor is diffusing, the truth about the rumor also diffuses with it. Two patterns of the agents used to identify rumor, self-identification and passive learning are taken into account. Combining theoretical proof and simulation analysis, we find that the threshold value of rumor diffusion is negatively correlated to the connectivity between nodes in the network and the probability,beta of agents knowing truth. Increasing,beta can reduce the maximum density of the rumor spreaders and slow down the generation speed of new rumor spreaders. On the other hand, we conclude that the best rumor diffusion strategy must balance the probability of forwarding rumor and the probability of agents losing interest in the rumor. High spread rate A of rumor would lead to a surge in truth dissemination which will greatly limit the diffusion of rumor. Furthermore, in the case of unknown A, increasing,beta can effectively reduce the maximum proportion of agents who do not know the truth, but cannot narrow the rumor diffusion range in a certain interval of beta.", "paper_title": "A novel rumor diffusion model considering the effect of truth in online social media", "paper_id": "WOS:000353905500009"}