{"auto_keywords": [{"score": 0.04886626441968084, "phrase": "regulator_interference"}, {"score": 0.00481495049065317, "phrase": "link_loss"}, {"score": 0.004765788394931875, "phrase": "causal_network_inference"}, {"score": 0.004412654209742722, "phrase": "causal_regulatory_networks"}, {"score": 0.004367581653370531, "phrase": "time_series"}, {"score": 0.003982011128052839, "phrase": "similar_dynamics"}, {"score": 0.003782655283668953, "phrase": "associated_link_strength"}, {"score": 0.0033957904376127187, "phrase": "robust_method"}, {"score": 0.00332670230152448, "phrase": "interference-corrected_causal_network"}, {"score": 0.003209152260950748, "phrase": "conditional_link_probabilities"}, {"score": 0.003048370487544551, "phrase": "large_real_network"}, {"score": 0.0028659990472580154, "phrase": "significant_interference"}, {"score": 0.0022973933270056743, "phrase": "known_networks"}, {"score": 0.0022390533383717715, "phrase": "high_numbers"}, {"score": 0.0022161333611134806, "phrase": "functional_links"}], "paper_keywords": [""], "paper_abstract": "Motivation: There are a number of algorithms to infer causal regulatory networks from time series (gene expression) data. Here we analyse the phenomena of regulator interference, where regulators with similar dynamics mutually suppress both the probability of regulating a target and the associated link strength; for instance, interference between two identical strong regulators reduces link probabilities by similar to 50%. Results: We construct a robust method to define an interference-corrected causal network based on an analysis of the conditional link probabilities that recovers links lost through interference. On a large real network (Streptomyces coelicolor, phosphate depletion), we demonstrate that significant interference can occur between regulators with a correlation as low as 0.865, losing an estimated 34% of links by interference. However, levels of interference cannot be predicted from the correlation between regulators alone and are data specific. Validating against known networks, we show that high numbers of functional links are lost by regulator interference. Performance against other methods on DREAM4 data is excellent.", "paper_title": "Correcting for link loss in causal network inference caused by regulator interference", "paper_id": "WOS:000343082900012"}