{"auto_keywords": [{"score": 0.004815113528739192, "phrase": "uk"}, {"score": 0.004633429997452688, "phrase": "research_quality"}, {"score": 0.004480196733208298, "phrase": "uk_science"}, {"score": 0.004352876088312741, "phrase": "research_assessment_exercise"}, {"score": 0.003992129945230457, "phrase": "scientists'_responses"}, {"score": 0.003934970057482768, "phrase": "principal_evaluation_criteria"}, {"score": 0.003714368305523811, "phrase": "uk_scientists"}, {"score": 0.0035570425396761122, "phrase": "evaluation_criteria"}, {"score": 0.003325410433297401, "phrase": "uk_authors"}, {"score": 0.003169222811082848, "phrase": "relatively_high_citation_impact"}, {"score": 0.0030203487665054806, "phrase": "active_research_staff"}, {"score": 0.0023066880707738736, "phrase": "slight_upward_trend"}, {"score": 0.0022845800828325577, "phrase": "overall_uk_citation_impact"}, {"score": 0.002219516542316085, "phrase": "earlier_study"}, {"score": 0.0021049977753042253, "phrase": "citation_analysis"}], "paper_keywords": [""], "paper_abstract": "A longitudinal analysis of UK science covering almost 20 years revealed in the years prior to a Research Assessment Exercise (RAE 1992, 1996 and 2001) three distinct bibliometric patterns, that can be interpreted in terms of scientists' responses to the principal evaluation criteria applied in a RAE. When in the RAE 1992 total publications counts were requested, UK scientists substantially increased their article production. When a shift in evaluation criteria in the RAE 1996 was announced from 'quantity' to 'quality', UK authors gradually increased their number of papers in journals with a relatively high citation impact. And during 1997-2000, institutions raised their number of active research staff by stimulating their staff members to collaborate more intensively, or at least to co-author more intensively, although their joint paper productivity did not. This finding suggests that, along the way towards the RAE 2001, evaluated units in a sense shifted back from 'quality' to 'quantity'. The analysis also observed a slight upward trend in overall UK citation impact, corroborating conclusions from an earlier study. The implications of the findings for the use of citation analysis in the RAE are briefly discussed.", "paper_title": "UK research assessment exercises: Informed judgments on research quality or quantity?", "paper_id": "WOS:000251830300011"}