{"auto_keywords": [{"score": 0.0407071505772858, "phrase": "golden_netlist"}, {"score": 0.03379263292841378, "phrase": "hts"}, {"score": 0.025794579549917235, "phrase": "ht-free_and_ht-inserted_netlists"}, {"score": 0.00481495049065317, "phrase": "gate-level_netlists"}, {"score": 0.004769958800452922, "phrase": "outsourcing_ic"}, {"score": 0.004594137808658537, "phrase": "effective_solutions"}, {"score": 0.004529881123652277, "phrase": "design_cost"}, {"score": 0.004424768776701965, "phrase": "severe_security_risks"}, {"score": 0.004342430078306461, "phrase": "malicious_outside_vendors"}, {"score": 0.004281678802569817, "phrase": "hardware_trojans"}, {"score": 0.004066076430818046, "phrase": "ic_design_phase"}, {"score": 0.003934540154108188, "phrase": "ht-free_netlist"}, {"score": 0.0034494494982242187, "phrase": "score-based_hardware-trojans_identifying_method"}, {"score": 0.0031399038722901788, "phrase": "gate-level_netlist"}, {"score": 0.0029537373082480565, "phrase": "trojan"}, {"score": 0.0028312983170567948, "phrase": "trojan_nets"}, {"score": 0.0026633568650501873, "phrase": "extracted_trojan_net_features"}, {"score": 0.0024586427394152196, "phrase": "score_threshold"}, {"score": 0.0022064376000055764, "phrase": "ht-free_and_ht-inserted_aes_gate-level_netlists"}], "paper_keywords": ["hardware Trojans", " golden-IC free", " classification", " identification", " gate-level netlist"], "paper_abstract": "Outsourcing IC design and fabrication is one of the effective solutions to reduce design cost but it may cause severe security risks. Particularly, malicious outside vendors may implement Hardware Trojans (HTs) on ICs. When we focus on IC design phase, we cannot assume an HT-free netlist or a Golden netlist and it is too difficult to identify whether a given netlist is HT-free or not. In this paper, we propose a score-based hardware-trojans identifying method at gate-level netlists without using a Golden netlist. Our proposed method does not directly detect HTs themselves in a gate-level netlist but it detects a net included in HTs, which is called Trojan net, instead. Firstly, we observe Trojan nets from several HT-inserted benchmarks and extract several their features. Secondly, we give scores to extracted Trojan net features and sum up them for each net in benchmarks. Then we can find out a score threshold to classify HT-free and HT-inserted netlists. Based on these scores, we can successfully classify HT-free and HT-inserted netlists in all the Trust-HUB gate-level benchmarks and ISCAS85 benchmarks as well as HT-free and HT-inserted AES gate-level netlists. Experimental results demonstrate that our method successfully identify all the HT-inserted gate-level benchmarks to be \"HT-inserted\" and all the HT-free gate-level benchmarks to be \"HT-free\" in approximately three hours for each benchmark.", "paper_title": "A Hardware-Trojans Identifying Method Based on Trojan Net Scoring at Gate-Level Netlists", "paper_id": "WOS:000367096000022"}