{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_similarity"}, {"score": 0.003984444229875069, "phrase": "different_objects"}, {"score": 0.0036775717816768133, "phrase": "numerical_data"}, {"score": 0.003533083861130305, "phrase": "symbolic_data"}, {"score": 0.003419084516677794, "phrase": "web_technologies"}, {"score": 0.0033329590158056935, "phrase": "xml-based_formats"}, {"score": 0.0029123920023263446, "phrase": "ontological_definition"}, {"score": 0.0028702214190712036, "phrase": "similarity_assessment"}, {"score": 0.002838993542880416, "phrase": "proposed_approach"}, {"score": 0.002727362288104989, "phrase": "presented_method"}, {"score": 0.002535492891830764, "phrase": "concrete_pieces"}, {"score": 0.002391739069644444, "phrase": "context-aware_similarity_assessment"}, {"score": 0.0022397131088479514, "phrase": "experimental_comparison"}, {"score": 0.0021515951441422082, "phrase": "satisfying_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Similarity", " Feature-based similarity", " Ontology", " Context", " RDF triple"], "paper_abstract": "ways of processing and analyzing data. One of the most common activities performed by these processes is comparison of data - it is done to find something new or confirm things we already know. In each case there is a need for determining similarity between different objects and pieces of information. The process of determining similarity seems to be relatively easy when it is done for a numerical data, but it is not so in case of a symbolic data. At the same time, the development of Web technologies has led to the introduction of XML-based formats of data representation on the Web, Resource Description Framework (RDF) and ontology. This paper proposes a method for determining semantic similarity between concepts defined in ontology. In contrast to other techniques that use ontological definition of concepts for similarity assessment, the proposed approach focuses on the relations between concepts and their semantics. The presented method is able to determine similarity not only at the definition/abstract level, but also is able to evaluate similarity of concrete pieces of information that are instances of concepts. In addition, the method allows for context-aware similarity assessment when only specific sets of relations, identified by the context, are taken into consideration. Experimental comparison of our similarity assessment approach against other techniques known in the literature shows satisfying results. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Assessment of semantic similarity of concepts defined in ontology", "paper_id": "WOS:000325041400002"}