{"auto_keywords": [{"score": 0.031042443925142032, "phrase": "squared_covariances"}, {"score": 0.010235623354729575, "phrase": "data_matrices"}, {"score": 0.00481495049065317, "phrase": "concor"}, {"score": 0.004608879242346434, "phrase": "standard_approach"}, {"score": 0.004542158659382197, "phrase": "underlying_components"}, {"score": 0.0040222701316738295, "phrase": "maximal_sums"}, {"score": 0.003527181559366122, "phrase": "alternative_techniques"}, {"score": 0.003294875957676514, "phrase": "orthonormality_constraints"}, {"score": 0.0032471155306148156, "phrase": "weight_matrices"}, {"score": 0.0027922467043592597, "phrase": "additional_feature"}, {"score": 0.0025331002386232014, "phrase": "concorgm_algorithm"}, {"score": 0.002389276641014013, "phrase": "best_single-component_solution"}, {"score": 0.002297949552105756, "phrase": "respective_residual_spaces"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["canonical correlation", " generalized Maxbet analysis", " Concor", " partitioned data matrix analysis"], "paper_abstract": "A standard approach to derive underlying components from two or more data matrices, holding data from the same individuals or objects, is the (generalized) canonical correlation analysis. This technique finds components (canonical variates) with maximal sums of correlations between them. The components do not necessarily explain much variance in the matrices they were derived from. This observation has given rise to alternative techniques, which maximize the sum of covariances between the components, subject to orthonormality constraints on the weight matrices applied to generate the components from the data matrices. However, a method called ConcorGM, maximizing the sum of squared covariances, has also been proposed. It has the additional feature that it allows for the analysis of two sets of data matrices which may, but need not coincide. The ConcorGM algorithm maximizes the sum of squared covariances successively, by first finding the best single-component solution, and repeating that process in the respective residual spaces. An algorithm for maximizing the sum of squared covariances simultaneously is offered. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A simultaneous CONCOR algorithm for the analysis of two partitioned matrices", "paper_id": "WOS:000237882800002"}