{"auto_keywords": [{"score": 0.0445343414480921, "phrase": "vwtsr"}, {"score": 0.015439904543519832, "phrase": "data_collection"}, {"score": 0.010721833713800961, "phrase": "data_aggregation"}, {"score": 0.0094485008079732, "phrase": "inner_layer"}, {"score": 0.008250141974203463, "phrase": "reliability_constraint"}, {"score": 0.00481495049065317, "phrase": "variable_width_tiered_structure_routing"}, {"score": 0.004417012437860011, "phrase": "novel_variable_width_tiered_structure_routing_scheme"}, {"score": 0.004144908086646161, "phrase": "proposed_vwtsr_scheme"}, {"score": 0.003802135020791801, "phrase": "key_idea"}, {"score": 0.0036497740708342093, "phrase": "circular_tiers"}, {"score": 0.0036167509502276294, "phrase": "different_widths"}, {"score": 0.0030988045934942587, "phrase": "tier_width"}, {"score": 0.0029610472910087176, "phrase": "outer_layer"}, {"score": 0.0029076695661972114, "phrase": "parent_collecting_nodes"}, {"score": 0.0028422946420821075, "phrase": "collecting_nodes"}, {"score": 0.002468450551616404, "phrase": "system_parameters"}, {"score": 0.0023802126605244438, "phrase": "proposed_scheme"}, {"score": 0.0023586493263143553, "phrase": "extensive_theoretical_analysis"}, {"score": 0.0022537212268979507, "phrase": "vwtsr."}, {"score": 0.0021049977753042253, "phrase": "existing_scheme"}], "paper_keywords": [""], "paper_abstract": "Data collection should take reliability and delay into consideration. To address these problems, a novel variable width tiered structure routing scheme named variable width tiered structure routing (VWTSR) is proposed. The proposed VWTSR scheme integrates two core phases, namely, circular tiers and cells partition, and distributed in-network aggregation. The key idea of VWTSR is to partition the network into circular tiers with different widths and each tier is further partitioned into cells. Those cells that do not interfere with each other could simultaneously finish data aggregation by broadcast and retransmission within each cell. Moreover, the tier width could meet the goal that when collecting nodes in outer layer finish transmission to parent collecting nodes in inner layer, the collecting nodes in inner layer just finish data aggregation, thus minimizing the latency while maintaining reliability for data collection. The problem is formulated as to minimize the delay under reliability constraint by controlling the system parameters. To demonstrate the effectiveness of the proposed scheme, extensive theoretical analysis and simulations are conducted to evaluate the performance of VWTSR. The analysis and simulations show that VWTSR leads to lower delay subject to reliability constraint than the existing scheme.", "paper_title": "Minimized Delay with Reliability Guaranteed by Using Variable Width Tiered Structure Routing in WSNs", "paper_id": "WOS:000363582200001"}