{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "block_ciphers"}, {"score": 0.003909301559145041, "phrase": "feistel-like_structures"}, {"score": 0.003621588555525458, "phrase": "underlying_linear_functions"}, {"score": 0.0035222812668916736, "phrase": "maximal_branch_number"}, {"score": 0.0032629585038738856, "phrase": "highest_level"}, {"score": 0.003129623571496151, "phrase": "linear_and_differential_attacks"}, {"score": 0.0028000270988465486, "phrase": "simple_operations"}, {"score": 0.002742196991950893, "phrase": "word-level_xors"}, {"score": 0.0026118503041971976, "phrase": "simple_inverses"}, {"score": 0.002505054869094183, "phrase": "diffusion_layer"}, {"score": 0.002436289099444074, "phrase": "hash_functions"}, {"score": 0.0021049977753042253, "phrase": "new_efficient_lightweight_block_ciphers"}], "paper_keywords": ["Block ciphers", " Diffusion layer", " Branch number", " MDS matrix"], "paper_abstract": "Many modern block ciphers use maximum distance separable (MDS) matrices as the main part of their diffusion layers. In this paper, we propose a very efficient new class of diffusion layers constructed from several rounds of Feistel-like structures whose round functions are linear. We investigate the requirements of the underlying linear functions to achieve the maximal branch number for the proposed 4x4 words diffusion layer, which is an indication of the highest level of security with respect to linear and differential attacks. We try to extend our results for up to 8x8 words diffusion layers. The proposed diffusion layers only require simple operations such as word-level XORs, rotations, and they have simple inverses. They can replace the diffusion layer of several block ciphers and hash functions in the literature to increase their security, and performance. Furthermore, it can be deployed in the design of new efficient lightweight block ciphers and hash functions in future.", "paper_title": "Efficient Recursive Diffusion Layers for Block Ciphers and Hash Functions", "paper_id": "WOS:000350245700002"}