{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "scm"}, {"score": 0.019587366847223873, "phrase": "software_artifacts"}, {"score": 0.010612335465601362, "phrase": "change_management"}, {"score": 0.010491121567150251, "phrase": "software_development"}, {"score": 0.010194047420417244, "phrase": "software_configuration_management"}, {"score": 0.003138768436081888, "phrase": "traceability_model"}, {"score": 0.0030847461428168614, "phrase": "case_study"}, {"score": 0.0030141556259370675, "phrase": "software_development_organization"}, {"score": 0.0029281780903782284, "phrase": "knowledge_elements"}, {"score": 0.0027475383418803724, "phrase": "change_management_function"}, {"score": 0.0027159094186967247, "phrase": "scm_tools"}, {"score": 0.002608040688794517, "phrase": "integrated_practice"}, {"score": 0.0023363141951290526, "phrase": "change_management_scenario"}, {"score": 0.0021921063460682293, "phrase": "qualitative_study"}], "paper_keywords": ["Software configuration management", " Traceability", " Change management", " Process knowledge"], "paper_abstract": "Software configuration management (SCM) and traceability are two prominent practices that support change management in software development. While SCM helps manage the evolution of software artifacts and their documentation, traceability helps manage knowledge about the process of the development of software artifacts. In this paper, we present the integration of traceability and SCM to help change management during the development and evolution of software artifacts. We developed a traceability model using a case study conducted in a software development organization. This model represents knowledge elements that are essential to comprehensively manage changes tracked within the change management function of SCM tools. A tool that Supports the integrated practice of SCM and traceability is also presented. We illustrate the usefulness Of Our model and tool using a change management scenario that was drawn from our case study. We also present a qualitative study towards empirically evaluating the usefulness of our approach. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Improving change management in software development: Integrating traceability and software configuration management", "paper_id": "WOS:000260713900020"}