{"auto_keywords": [{"score": 0.04955461236891121, "phrase": "off-line_signature_verification"}, {"score": 0.00481495049065317, "phrase": "local_features"}, {"score": 0.004556901872357751, "phrase": "handwritten_signatures"}, {"score": 0.0040366412779632085, "phrase": "better_verification_results"}, {"score": 0.0039269071382230444, "phrase": "simplified_probabilistic_model"}, {"score": 0.0036958398682001015, "phrase": "verification_steps"}, {"score": 0.0031845067058084583, "phrase": "signature_verification_system"}, {"score": 0.0029641011108505785, "phrase": "input_samples"}, {"score": 0.0023507916951658455, "phrase": "error_rates"}, {"score": 0.0022368274529152342, "phrase": "original_samples"}, {"score": 0.002175913488493802, "phrase": "final_error_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Off-line signature verification", " Classification", " Normal distribution", " Biometrics"], "paper_abstract": "The computerized verification of scanned, handwritten signatures has been extensively studied in the past decades, but there are still several possibilities for improvement in the field. To achieve better verification results, we propose a simplified probabilistic model for off-line signature verification. In our model, each of the verification steps can be mathematically described and, therefore, individually analyzed and improved. Using this model, we are able to predict the accuracy of a signature verification system based on just a few a priori known parameters, such as the cardinality and the quality of input samples. Several experiments have been conducted using our statistics-based classifier to confirm the assumptions and the results of our model. Based on the results, we can provide answers to several old questions within the field, such as why is it so hard to achieve error rates below 10% or how does the number of original samples and features affect the final error rates. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A study on the consistency and significance of local features in off-line signature verification", "paper_id": "WOS:000315013000002"}