{"auto_keywords": [{"score": 0.04966008989090485, "phrase": "probabilistic_rough_set_model"}, {"score": 0.01409993695545415, "phrase": "classical_rough_set_model"}, {"score": 0.008713768692145006, "phrase": "attribute_reduction"}, {"score": 0.008124218315570798, "phrase": "uncertainty_measures"}, {"score": 0.004429191773525288, "phrase": "important_role"}, {"score": 0.003298631258267805, "phrase": "reduction_algorithms"}, {"score": 0.0031565959573536194, "phrase": "algorithm_design"}, {"score": 0.0030608148631528767, "phrase": "monotonic_uncertainty_measures"}, {"score": 0.002941913249957503, "phrase": "non-monotonicity_problem"}, {"score": 0.002555247330102505, "phrase": "corresponding_uncertainty_measures"}, {"score": 0.0024451427672857458, "phrase": "new_attribute_reduct"}, {"score": 0.002381365139274329, "phrase": "proposed_monotonic_uncertainty_measure"}, {"score": 0.002339771435910601, "phrase": "corresponding_heuristic_reduction_algorithms"}, {"score": 0.0022687189700002254, "phrase": "experimental_analysis"}, {"score": 0.0021805201234139475, "phrase": "proposed_uncertainty_measures"}, {"score": 0.0021613897794439227, "phrase": "new_reduct_definition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Uncertainty measure", " Approximation accuracy", " Attribute reduction", " Probabilistic rough set model", " Pawlak rough set model"], "paper_abstract": "Attribute reduction is one of the most fundamental and important topics in rough set theory. Uncertainty measures play an important role in attribute reduction. In the classical rough set model, uncertainty measures have the monotonicity with respect to the granularity of partition. However, the monotonicity of uncertainty measures does not hold when uncertainty measures in classical rough set model are directly extended into probabilistic rough set model, which makes it not so reasonable to use them to evaluate the uncertainty in probabilistic rough set model. Moreover, the monotonicity is very important for constructing attribute reduction algorithms because the monotonicity of uncertainty measures can simplify the algorithm design. This paper focuses on constructing monotonic uncertainty measures in probabilistic rough set model. Firstly, we analyze the non-monotonicity problem of uncertainty measures in probabilistic rough set model. Secondly, we propose three basic uncertainty measures and three expected granularity-based uncertainty measures, the monotonicity of these measures is proved to be held and the relationship between these measures and corresponding uncertainty measures in classical rough set model is also obtained. Finally, a new attribute reduct is defined based on the proposed monotonic uncertainty measure, and the corresponding heuristic reduction algorithms are developed. The results of experimental analysis are included to validate the effectiveness of the proposed uncertainty measures and new reduct definition. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Monotonic uncertainty measures for attribute reduction in probabilistic rough set model", "paper_id": "WOS:000351793300003"}