{"auto_keywords": [{"score": 0.04899785130579758, "phrase": "blended_learning_environment"}, {"score": 0.0075445391889371865, "phrase": "learning_processes"}, {"score": 0.004670504053818028, "phrase": "blended_learning"}, {"score": 0.004582423717777699, "phrase": "best_elements"}, {"score": 0.004513151518938864, "phrase": "face-to-face_education"}, {"score": 0.004377719094086111, "phrase": "predominant_teaching_model"}, {"score": 0.004150377643719188, "phrase": "mobile_learning"}, {"score": 0.004118874671285618, "phrase": "web-based_learning"}, {"score": 0.0040720661634333424, "phrase": "classroom_teaching"}, {"score": 0.0035500334260484376, "phrase": "quasi-experimental_instruction"}, {"score": 0.0032396224508754387, "phrase": "content_analysis"}, {"score": 0.003130325700934738, "phrase": "distinct_characteristics"}, {"score": 0.0028565082986974602, "phrase": "hybrid-oriented_group"}, {"score": 0.0027495914857929584, "phrase": "regular_manner"}, {"score": 0.0027079507175554857, "phrase": "instructor's_teaching_procedure"}, {"score": 0.002557322657104706, "phrase": "technology-oriented_group"}, {"score": 0.0024804352736263005, "phrase": "web_technologies"}, {"score": 0.0024428607154967806, "phrase": "superficial_problem"}, {"score": 0.002324620886282579, "phrase": "efficiency-oriented_group"}, {"score": 0.0022806798371116698, "phrase": "efficient_monitoring"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Improving classroom teaching", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "Blended learning, thoughtfully combining the best elements of online and face-to-face education, is likely to emerge as the predominant teaching model of the future. In this paper, we present a blended learning environment combining mobile learning, web-based learning, and classroom teaching to provide realistic, practical opportunities for learners and teachers to engage in problem solving activities. The purpose of this study was to explore problem solving patterns and their impact on learning achievement in a blended learning environment. Through quasi-experimental instruction, we collected all of the data of the learning processes from 34 students in a blended learning environment using classroom instruction, mobile and web scenarios. By combining cluster analysis and content analysis, we were able to identify three groups with distinct characteristics: the hybrid-oriented group, the technology-oriented group, and the efficiency-oriented group. Learners in the hybrid-oriented group used the classroom, mobile and web scenario almost equally. They displayed a regular manner in following the instructor's teaching procedure, and tended to passively accept whatever the teacher said. Students in the technology-oriented group spent most of their time using mobile and web technologies but they revealed superficial problem solving abilities such as a lack of understanding and planning. The efficiency-oriented group was characterized by the efficient monitoring of learning processes. It was more task-oriented and performed better than the other two groups. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring problem solving patterns and their impact on learning achievement in a blended learning environment", "paper_id": "WOS:000283916000014"}