{"auto_keywords": [{"score": 0.04158053779026507, "phrase": "virtual_screening_experiments"}, {"score": 0.00481495049065317, "phrase": "activated_homology_models"}, {"score": 0.0047224703862074665, "phrase": "structure-based_virtual_screening"}, {"score": 0.00440394242852293, "phrase": "alzheimer's_disease"}, {"score": 0.004171065188039856, "phrase": "homology_models"}, {"score": 0.0038296485293910026, "phrase": "homology_model"}, {"score": 0.0037125240439927114, "phrase": "crystal_structure"}, {"score": 0.0035850198321277418, "phrase": "initial_model"}, {"score": 0.0035024506353894644, "phrase": "agonist-bound_crystal_structure"}, {"score": 0.0030932778623387097, "phrase": "tm"}, {"score": 0.002998390117435555, "phrase": "inner_channel"}, {"score": 0.002963640433319524, "phrase": "transmembrane_region"}, {"score": 0.0029292922955739963, "phrase": "binding_sites"}, {"score": 0.002839625463110821, "phrase": "induced-fit_docking"}, {"score": 0.002658068304632523, "phrase": "decoy_molecules"}, {"score": 0.0025567271683947547, "phrase": "whole_range"}, {"score": 0.0024496978447849835, "phrase": "orthosteric_site"}, {"score": 0.0023932142697579506, "phrase": "ifd_refinement"}, {"score": 0.0023289568500915207, "phrase": "inactive_state_character"}, {"score": 0.002154693685426657, "phrase": "activated_state_character"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["G protein-coupled receptor", " Homology modeling", " Docking", " Virtual screening", " Activated structure"], "paper_abstract": "Structure-based virtual screening offers a good opportunity for the discovery of selective M-1 muscarinic acetylcholine receptor (mAChR) agonists for the treatment of Alzheimer's disease. However, no 3-D structure of an M-1 mAChR is yet available and the homology models that have been previously reported are only able to identify antagonists in virtual screening experiments. In this study, we generated a homology model of the human M-1 mAChR, based on the crystal structure of an M-3 mAChR as the template. This initial model was modified, using the agonist-bound crystal structure of a beta(2)-adrenergic receptor as a guide, to give two possible activated structures. The T192 side chain was adjusted in both structures and one of the structures also had the whole of transmembrane (TM) 5 rotated and tilted toward the inner channel of the transmembrane region. The binding sites of all three structures were then refined by induced-fit docking (IFD) with acetylcholine. Virtual screening experiments showed that all three refined models could efficiently differentiate agonists from decoy molecules, with the TM5-modified models also giving good agonist/antagonist selectivity. The whole range of agonists and antagonists was observed to bind within the orthosteric site of the structure obtained by IFD refinement alone, implying that it has inactive state character. In contrast, the two TM5-modified structures were unable to accommodate the antagonists, supporting the proposition that they possess activated state character. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Toward activated homology models of the human M-1 muscarinic acetylcholine receptor", "paper_id": "WOS:000335105500010"}