{"auto_keywords": [{"score": 0.04358406117033226, "phrase": "time_series"}, {"score": 0.004527619017250708, "phrase": "increasingly_pressing_need"}, {"score": 0.004429191773525288, "phrase": "diverse_domains"}, {"score": 0.003477505397536663, "phrase": "relevant_techniques"}, {"score": 0.0032697235411641695, "phrase": "data_collections"}, {"score": 0.003212663446866794, "phrase": "one-million_time_series"}, {"score": 0.002941913249957503, "phrase": "indexing_and_mining_truly_massive_collections"}, {"score": 0.0028276174348291923, "phrase": "main_bottleneck"}, {"score": 0.0025892330566358503, "phrase": "novel_bulk_loading_mechanism"}, {"score": 0.0024667783849055634, "phrase": "time_series_index"}, {"score": 0.0022687189700002254, "phrase": "first_published_experiments"}, {"score": 0.0021805201234139475, "phrase": "massive_data"}, {"score": 0.0021049977753042253, "phrase": "dna_and_web-scale_image_collections"}], "paper_keywords": ["Time series", " Data mining", " Representations", " Indexing", " Bulk loading"], "paper_abstract": "There is an increasingly pressing need, by several applications in diverse domains, for developing techniques able to index and mine very large collections of time series. Examples of such applications come from astronomy, biology, the web, and other domains. It is not unusual for these applications to involve numbers of time series in the order of hundreds of millions to billions. However, all relevant techniques that have been proposed in the literature so far have not considered any data collections much larger than one-million time series. In this paper, we describe SAX 2.0 and its improvements, SAX 2.0 Clustered and SAX2+, three methods designed for indexing and mining truly massive collections of time series. We show that the main bottleneck in mining such massive datasets is the time taken to build the index, and we thus introduce a novel bulk loading mechanism, the first of this kind specifically tailored to a time series index. We show how our methods allows mining on datasets that would otherwise be completely untenable, including the first published experiments to index one billion time series, and experiments in mining massive data from domains as diverse as entomology, DNA and web-scale image collections.", "paper_title": "Beyond one billion time series: indexing and mining very large time series collections with SAX2+", "paper_id": "WOS:000333156900005"}