{"auto_keywords": [{"score": 0.04419846536070136, "phrase": "svr"}, {"score": 0.01061237167920707, "phrase": "support_vector_regression"}, {"score": 0.010536185932826887, "phrase": "web_effort_estimation"}, {"score": 0.004643594260262632, "phrase": "new_generation"}, {"score": 0.004610058444728656, "phrase": "machine_learning_algorithms"}, {"score": 0.004150030918669128, "phrase": "cross-company_dataset"}, {"score": 0.004060718465754644, "phrase": "different_svr_configurations"}, {"score": 0.003944606115768627, "phrase": "best_performance"}, {"score": 0.0034118234596993836, "phrase": "six_different_data_configurations"}, {"score": 0.0033021988455635403, "phrase": "kernel_functions"}, {"score": 0.003266443127727596, "phrase": "non-linear_problems"}, {"score": 0.003104619199351347, "phrase": "radial_basis_function"}, {"score": 0.003037736332283186, "phrase": "polynomial_kernels"}, {"score": 0.0028663222014133813, "phrase": "best_values"}, {"score": 0.0027341763737751467, "phrase": "leave-one-out_cross-validation_approach"}, {"score": 0.002665555782056494, "phrase": "tukutuku"}, {"score": 0.0025334249463305875, "phrase": "test_set"}, {"score": 0.0024519545383399773, "phrase": "svr-based_predictions"}, {"score": 0.0023817332409567403, "phrase": "manual_stepwise_regression"}, {"score": 0.0023644936731468252, "phrase": "case-based_reasoning"}, {"score": 0.0022718774783143203, "phrase": "logarithmic_features'_preprocessing"}, {"score": 0.0022228943786652914, "phrase": "rbf_kernel"}, {"score": 0.0021987994275190314, "phrase": "best_results"}, {"score": 0.002120349374832685, "phrase": "significantly_superior_prediction_accuracy"}], "paper_keywords": ["Effort estimation", " Support Vector Regression"], "paper_abstract": "Support Vector Regression (SVR) is a new generation of Machine Learning algorithms, suitable for predictive data modeling problems. The objective of this paper is twofold: first, to investigate the effectiveness of SVR for Web effort estimation using a cross-company dataset; second, to compare different SVR configurations looking at the one that presents the best performance. In particular, we took into account three variables' preprocessing strategies (no-preprocessing, normalization, and logarithmic), in combination with two different dependent variables (effort and inverse effort). As a result, SVR was applied using six different data configurations. Moreover, to understand the suitability of kernel functions to handle non-linear problems, SVR was applied without a kernel, and in combination with the Radial Basis Function (RBF) and the Polynomial kernels, thus obtaining 18 different SVR configurations. To identify, for each configuration, which were the best values for each of the parameters we defined a procedure based on a leave-one-out cross-validation approach. The dataset employed was the Tukutuku database, which has been adopted in many previous Web effort estimation studies. Three different training and test set splits were used, including respectively 130 and 65 projects. The SVR-based predictions were also benchmarked against predictions obtained using Manual StepWise Regression and Case-Based Reasoning. Our results showed that the configuration corresponding to the logarithmic features' preprocessing, in combination with the RBF kernel provided the best results for all three data splits. In addition, SVR provided significantly superior prediction accuracy than all the considered benchmarking techniques.", "paper_title": "Investigating the use of Support Vector Regression for web effort estimation", "paper_id": "WOS:000288217800002"}