{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "competitive_binding_study_discovered_different_binding"}, {"score": 0.00458412183693466, "phrase": "newly_recognized_therapeutic_target"}, {"score": 0.004045068727683462, "phrase": "binding_site"}, {"score": 0.0035216195857272403, "phrase": "new_structural_model"}, {"score": 0.003397866151093552, "phrase": "experimental_data"}, {"score": 0.003293142761521425, "phrase": "molecular_docking"}, {"score": 0.0032638170723261538, "phrase": "competition_experiments"}, {"score": 0.003177392642813126, "phrase": "binding_modes"}, {"score": 0.0028924840289020906, "phrase": "dual-site_inhibitors"}, {"score": 0.0028539179130824786, "phrase": "inhibitory_mechanism"}, {"score": 0.0027659126653647712, "phrase": "inhibitor-substrate_competition_experiments"}, {"score": 0.0027047136845332917, "phrase": "potency-binding_site_relationships"}, {"score": 0.00259793885118959, "phrase": "molecular_docking_studies"}, {"score": 0.002506562885555113, "phrase": "docking_results"}, {"score": 0.002451088210833819, "phrase": "different_inhibitory_effects"}, {"score": 0.002322895056238477, "phrase": "substrate_and_the_cofactor_binding_sites"}, {"score": 0.002271476019266231, "phrase": "dual-site_binding_mode"}, {"score": 0.002221192647477371, "phrase": "future_rational_design"}, {"score": 0.0021049977753042253, "phrase": "binding_mechanism"}], "paper_keywords": [""], "paper_abstract": "Microsomal prostaglandin E synthase-1 (mPGES-1) is a newly recognized therapeutic target for the treatment of inflammation, pain, cancer, atherosclerosis, and stroke. Many mPGES-1 inhibitors have been discovered. However, as the structure of the binding site is not well-characterized, none of these inhibitors was designed based on the mPGES-1 structure, and their inhibition mechanism remains to be fully disclosed. Recently, we built a new structural model of mPGES-1 which was well supported by experimental data. Based on this model, molecular docking and competition experiments were used to investigate the binding modes of four representive mPGES-1 inhibitors. As the inhibitor binding sites predicted by docking overlapped with both the substrate and the cofactor binding sites, mPGES-1 inhibitors might act as dual-site inhibitors. This inhibitory mechanism was further verified by inhibitor-cofactor and inhibitor-substrate competition experiments. To investigate the potency-binding site relationships of mPGES-1 inhibitors, we also carried out molecular docking studies for another series of compounds. The docking results correlated well with the different inhibitory effects observed experimentally. Our data revealed that mPGES-1 inhibitors could bind to the substrate and the cofactor binding sites simultaneously, and this dual-site binding mode improved their potency. Future rational design and optimization of mPGES-1 inhibitors can be carried out based on this binding mechanism.", "paper_title": "Molecular Docking and Competitive Binding Study Discovered Different Binding Modes of Microsomal Prostaglandin E Synthase-1 Inhibitors", "paper_id": "WOS:000298315900023"}