{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_systems"}, {"score": 0.00849752547442701, "phrase": "ethnographic-action_research"}, {"score": 0.005401290226348549, "phrase": "aec_projects"}, {"score": 0.004754600386388821, "phrase": "project_teams"}, {"score": 0.0043527164193299574, "phrase": "work_routines"}, {"score": 0.003717368939083015, "phrase": "project-centric_research_and_development_methodology"}, {"score": 0.0035120164504478437, "phrase": "local_project_organizations"}, {"score": 0.0033814348757887232, "phrase": "iterative_improvement"}, {"score": 0.003235193484261443, "phrase": "small_action_research_implementation_cycles"}, {"score": 0.0031148723927633955, "phrase": "practical_feasibility"}, {"score": 0.00305639530600272, "phrase": "theoretical_methodology"}, {"score": 0.0029427043216782604, "phrase": "north_america"}, {"score": 0.002905795801686229, "phrase": "europe"}, {"score": 0.0023144166368024603, "phrase": "specific_problems"}, {"score": 0.0021049977753042253, "phrase": "close_collaboration"}], "paper_keywords": ["Information management", " Action research", " Ethnography", " Construction", " Engineering", " Design"], "paper_abstract": "Architecture, engineering, and construction (AEC) projects are characterized by a large variation in requirements and work routines. Therefore, it is difficult to develop and implement information systems to support projects. To address these challenges, this paper presents a project-centric research and development methodology that combines ethnographic observation of practitioners working in local project organizations to understand their local requirements and the iterative improvement of information systems directly on projects in small action research implementation cycles. The paper shows the practical feasibility of the theoretical methodology using cases from AEC projects in North America and Europe. The cases provide evidence that ethnographic-action research is well suited to support the development and implementation of information systems. In particular, the paper shows that the method enabled researchers on the cases to identify specific problems on AEC projects and, additionally, helped these researchers to adapt information systems accordingly in close collaboration with the practitioners working on these projects. (C) 2008 Elsevier Ltd. All rights reserved,", "paper_title": "Implementing information systems with project teams using ethnographic-action research", "paper_id": "WOS:000262567300005"}