{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tissue_p_systems"}, {"score": 0.007851522456113934, "phrase": "antiport_rules"}, {"score": 0.004746065479362881, "phrase": "control_languages"}, {"score": 0.004745476967036802, "phrase": "symport_rules"}, {"score": 0.004589124394375718, "phrase": "distributed_and_parallel_models"}, {"score": 0.0043738432231020885, "phrase": "living_cells"}, {"score": 0.004089239912167375, "phrase": "computational_power"}, {"score": 0.003714368305523811, "phrase": "empty_label"}, {"score": 0.0035229930971258316, "phrase": "halting_computation"}, {"score": 0.0029203055813347874, "phrase": "regular_languages"}, {"score": 0.002432152706473349, "phrase": "weight_one_and_symport_rules"}, {"score": 0.002251813863195168, "phrase": "rule_complexity"}, {"score": 0.002166711569953301, "phrase": "desired_computational_power"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Membrane computing", " Tissue P system", " Universality", " Control language"], "paper_abstract": "Tissue P systems are a class of distributed and parallel models of computation inspired by the way of communication among living cells or between cells and their environment. In this work, we investigate the computational power of tissue P systems, where each rule is assigned either with a label chosen from an alphabet or with the empty label A. The sequence of labels of rules applied during a halting computation is defined as the result of the computation, and the set of all results computed by a given tissue P system is called a control language. We prove that tissue P systems with antiport rules of weight one and without symport rules characterize regular languages; tissue P systems with antiport rules of weight at most two (resp., symport rules of weight at most two) without symport rules (resp., antiport rules) are universal. Tissue P systems with antiport rules of weight one and symport rules of weight one are also proved to be universal. These results show that the rule complexity is crucial for tissue P systems to achieve a desired computational power. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Computational power of tissue P systems for generating control languages", "paper_id": "WOS:000338390100019"}