{"auto_keywords": [{"score": 0.014277959111917083, "phrase": "large_outdoor_environments"}, {"score": 0.0046993598473345395, "phrase": "wireless_local_area_networks"}, {"score": 0.00386876598761639, "phrase": "unlicensed_spectrum"}, {"score": 0.0035965032173588753, "phrase": "great_deal"}, {"score": 0.00342568771304873, "phrase": "so-called_wifi-based_long_distance_networks"}, {"score": 0.0029965060407413898, "phrase": "standard_working_procedure"}, {"score": 0.0028541057064952876, "phrase": "coverage_ranges"}, {"score": 0.002735052488172277, "phrase": "high_propagation_delay_values"}, {"score": 0.0025892330566358503, "phrase": "increasing_propagation_delay"}, {"score": 0.002406799309495983, "phrase": "mathematical_model"}, {"score": 0.0022923586577645143, "phrase": "operating_range"}, {"score": 0.0022509187766762665, "phrase": "ieee"}, {"score": 0.0021569129153653777, "phrase": "throughput_threshold"}, {"score": 0.0021049977753042253, "phrase": "propagation_delay"}], "paper_keywords": ["WLAN", " IEEE 802.11", " MAC", " Propagation delay", " Slot time"], "paper_abstract": "Originally, Wireless Local Area Networks served only small indoor areas. Nevertheless, the idea of employing IEEE 802.11 networks in large outdoor environments is a very attractive possibility. IEEE 802.11 technology offers several advantages: the low cost of equipment, its operation in the unlicensed spectrum and its higher data rates. Since the advent of the first IEEE 802.11 standard, a great deal of research has been carried out. So-called Wifi-based Long Distance networks are currently being deployed. In this paper, we study the suitability of employing IEEE 802.11 networks in large outdoor environments without modifying the standard working procedure. In such scenarios, IEEE 802.11 networks should offer coverage ranges of several kilometer, which leads to high propagation delay values. Thus, we analyze the influence of increasing propagation delay in the IEEE 802.11 MAC protocol. To carry out our analysis we present a mathematical model and simulation results. We provide an operating range in which IEEE 802.11 performance is feasible and establish a throughput threshold according to the propagation delay.", "paper_title": "Propagation delay influence in IEEE 802.11 outdoor networks", "paper_id": "WOS:000277454200017"}