{"auto_keywords": [{"score": 0.040642263753439135, "phrase": "insertion_rate"}, {"score": 0.03423639170534165, "phrase": "enhanced_conflict_graph"}, {"score": 0.00481495049065317, "phrase": "chip_yield"}, {"score": 0.004477992162329249, "phrase": "wire_bending"}, {"score": 0.004370973501074594, "phrase": "postrouting_stage"}, {"score": 0.004301046274139699, "phrase": "single_via"}, {"score": 0.003935892934907777, "phrase": "existing_signal_wires"}, {"score": 0.0038417798012011155, "phrase": "double_vias"}, {"score": 0.0037955672944969287, "phrase": "primary_goal"}, {"score": 0.0035726811019151984, "phrase": "secondary_objective"}, {"score": 0.003473178781851477, "phrase": "layout_perturbation"}, {"score": 0.0033223686422055834, "phrase": "minimum-weight_maximum_independent_set"}, {"score": 0.0029672941061574375, "phrase": "zero-one_integer_linear_program"}, {"score": 0.002872979681637667, "phrase": "mwmis_problem"}, {"score": 0.0026181517251690606, "phrase": "experimental_results"}, {"score": 0.0023381630439887184, "phrase": "insertion_methods"}, {"score": 0.0022095803687183107, "phrase": "existing_method"}], "paper_keywords": ["Integer linear program", " redundant via", " wire bending"], "paper_abstract": "Redundant via insertion is highly recommended for improving chip yield and reliability. In this paper, we studied the problem of simultaneous double via insertion and wire bending (DVI/WB) in a postrouting stage, where a single via can have at most one redundant via inserted next to it. Aside from this, we are allowed to bend existing signal wires for enhancing the insertion rate of double vias. The primary goal of the DVI/WB problem is to insert as many double vias as possible; the secondary objective is to minimize the amount of layout perturbation. We formulate the DVI/WB problem as that of finding a minimum-weight maximum independent set (mWMIS) on an enhanced conflict graph. We proposed algorithms to perform wire bending and to construct the enhanced conflict graph from a given design. We also proposed a zero-one integer linear program (0-1 ILP)-based approach to solve the mWMIS problem. Moreover, we studied the problem of DVI/WB with the consideration of via density and extended our 0-1 ILP-based approach to solve it. Experimental results show that our approaches can improve the insertion rate by up to 6.34% at the expense of up to 1.29% wirelength increase when compared with the state-of-the-art double via insertion methods that do not consider wire bending. Moreover, when compared with an existing method that considers wire bending, our DVI/WB approach can insert 2% more double vias and produce 32% less wirelength increase rate on average.", "paper_title": "Enhanced Double Via Insertion Using Wire Bending", "paper_id": "WOS:000273928400002"}