{"auto_keywords": [{"score": 0.043284735713932626, "phrase": "apa"}, {"score": 0.02215093819243065, "phrase": "student_perceptions"}, {"score": 0.007623903203772239, "phrase": "computer-based_environment"}, {"score": 0.006181538921071028, "phrase": "higher_program_ratings"}, {"score": 0.00481495049065317, "phrase": "pedagogical_agent_gender_matching"}, {"score": 0.004626796109657584, "phrase": "similarity_attraction_hypothesis"}, {"score": 0.004287680323820891, "phrase": "middle-school_students"}, {"score": 0.004256703909255889, "phrase": "electrical_circuit_analysis"}, {"score": 0.004165105357908494, "phrase": "animated_pedagogical_agent"}, {"score": 0.003831801113154043, "phrase": "positive_impact"}, {"score": 0.0034366728236876016, "phrase": "female_students"}, {"score": 0.0033262524445013303, "phrase": "male_students"}, {"score": 0.00260810691979637, "phrase": "higher_far_transfer_scores"}, {"score": 0.0025518930446603335, "phrase": "animated_agent"}, {"score": 0.0023644936731468252, "phrase": "learner_control"}, {"score": 0.0023388674614404324, "phrase": "student_motivation"}, {"score": 0.0022148335975074904, "phrase": "instructional_materials"}, {"score": 0.002190825828942124, "phrase": "global_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Gender studies", " Human-computer interface", " Interactive learning environments", " Multimedia/hypermedia systems"], "paper_abstract": "The similarity attraction hypothesis posits that humans are drawn toward others who behave and appear similar to themselves. Two experiments examined this hypothesis with middle-school students learning electrical circuit analysis in a computer-based environment with an Animated Pedagogical Agent (APA). Experiment 1 was designed to determine whether matching the gender of the APA to the student has a positive impact on learning outcomes or student perceptions. One hundred ninety-seven middle-school students learned with the computer-based environment using an APA that matched their gender or one which was opposite in gender. Female students reported higher program ratings when the APA matched their gender. Male students, on the other hand, reported higher program ratings than females when the APA did not match their gender. Experiment 2 systematically tested the impact of providing learners the choice among four APAs on learning outcomes and student perceptions. Three hundred thirty-four middle-school students received either a pre-assigned random APA or were free to choose from four APA options: young male agent, older male agent, young female agent, or older female agent. Learners had higher far transfer scores when provided a choice of animated agent, but student perceptions were not impacted by having the ability to make this choice. We suggest that offering students learner control positively impacts student motivation and learning by increasing student perceptions of autonomy, responsibility for the success of the instructional materials, and global satisfaction with the design of materials. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Investigating the impact of pedagogical agent gender matching and learner choice on learning outcomes and perceptions", "paper_id": "WOS:000320430500004"}