{"auto_keywords": [{"score": 0.048811828059843985, "phrase": "correlated_pairs"}, {"score": 0.007340316271552312, "phrase": "\"good\"_correlation_measure"}, {"score": 0.00481495049065317, "phrase": "correlation_search"}, {"score": 0.004763565662615503, "phrase": "binary_data"}, {"score": 0.003947765701573287, "phrase": "high_pearson_correlation"}, {"score": 0.0036227329311981195, "phrase": "best_correlation_measure"}, {"score": 0.0034332736827447654, "phrase": "alternative_task"}, {"score": 0.0030178961017306646, "phrase": "upper_bound"}, {"score": 0.0028446460307503343, "phrase": "correlation_measures"}, {"score": 0.0025003054002226965, "phrase": "top-k_correlated_pairs"}, {"score": 0.0023694065215394593, "phrase": "experimental_results"}, {"score": 0.0022574539115388054, "phrase": "different_situations"}, {"score": 0.0021392418081444798, "phrase": "brute-force_method"}], "paper_keywords": ["Correlation search", " Correlation upper bound", " Token-ring algorithm"], "paper_abstract": "Searching correlated pairs in a collection of items is essential for many problems in commercial, medical, and scientific domains. Recently, a lot of progress has been made to speed up the search for pairs that have a high Pearson correlation (phi-coefficient). However, phi-coefficient is not the only or the best correlation measure. In this paper, we aim at an alternative task: finding correlated pairs of any \"good\" correlation measure which satisfies the three widely-accepted correlation properties in Section 2.1. In this paper, we identify a 1-dimensional monotone property of the upper bound of any \"good\" correlation measure, and different 2-dimensional monotone properties for different types of correlation measures. We can either use the 2-dimensional search algorithm to retrieve correlated pairs above a certain threshold, or our new token-ring algorithm to find top-k correlated pairs to prune many pairs without computing their correlations. The experimental results show that our robust algorithm can efficiently search correlated pairs under different situations and is an order of magnitude faster than the brute-force method. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Speeding up correlation search for binary data", "paper_id": "WOS:000323360400007"}