{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "learning_styles"}, {"score": 0.004664352260912174, "phrase": "main_concerns"}, {"score": 0.004576253356889219, "phrase": "learning_style_adaptation"}, {"score": 0.004518442937844318, "phrase": "adaptive_educational_hypermedia_systems"}, {"score": 0.00385431710959668, "phrase": "learning_style_dimension"}, {"score": 0.003548368289666932, "phrase": "general_tendency"}, {"score": 0.0028578496983461136, "phrase": "student_learning_styles"}, {"score": 0.002768293851511292, "phrase": "felder-silverman's_learning_style_model"}, {"score": 0.002548331088496964, "phrase": "precise_scores"}, {"score": 0.0024372021710656585, "phrase": "case_study"}, {"score": 0.0022578275190855124, "phrase": "students'_learning_style_preference"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adaptive hypermedia", " Learning styles", " User modeling"], "paper_abstract": "One of the main concerns when providing learning style adaptation in Adaptive Educational Hypermedia Systems is the number of questions the students have to answer. Most of the times, adaptive material available will discriminate among a few categories for each learning style dimension. Consequently, it is only needed to take into account the general tendency of the student and not the specific score obtained in each dimension. In this context, we present AH-questionnaire, a new approach to minimize the number of questions needed to classify student Learning Styles. Based on the Felder-Silverman's Learning Style Model, it aims at classifying students into categories in spite of providing precise scores. The results obtained in a case study with 330 students are very promising. It was possible to predict students' learning style preference with high accuracy and only a few questions. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "AH-questionnaire: An adaptive hierarchical questionnaire for learning styles", "paper_id": "WOS:000276114300017"}