{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "network-calculus-based_simulation"}, {"score": 0.03343816650549669, "phrase": "mixed-mode_simulation"}, {"score": 0.014316078019852112, "phrase": "tcp"}, {"score": 0.013195643037585502, "phrase": "packet-level_details"}, {"score": 0.009675216204426889, "phrase": "execution_time"}, {"score": 0.009479346049495421, "phrase": "simulation_results"}, {"score": 0.004678384952779725, "phrase": "tcp-operated_networks"}, {"score": 0.00445318311339027, "phrase": "packet-level_simulation"}, {"score": 0.0034364867143322274, "phrase": "packet-level_flows"}, {"score": 0.0034083145672246067, "phrase": "network-calculus-based_flows"}, {"score": 0.003074991770768925, "phrase": "simulation_study"}, {"score": 0.0027856252557826467, "phrase": "effective_candidate"}, {"score": 0.002740109776120878, "phrase": "large-scale_simulation"}, {"score": 0.0026622351303038885, "phrase": "significant_performance_improvement"}, {"score": 0.0023527296826339225, "phrase": "network_size"}, {"score": 0.002276439636865258, "phrase": "error_discrepancy"}, {"score": 0.002220846338732873, "phrase": "bottleneck_link_capacity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["mixed-mode simulation", " network calculus", " network-calculus-based simulation"], "paper_abstract": "In this paper, we investigate the issue of integrating packet-level simulation with network-calculus-based simulation for TCP-operated networks in order to simultaneously achieve within one simulation framework the performance gains acquired by the latter and the packet-level details afforded by the former. In Such mixed-mode simulation, a foreground flow is simulated at the packet-level while the other background flows are simulated in network-calculus-based simulation. One major challenge in realizing this notion is how to characterize the interaction between packet-level flows and network-calculus-based flows. In this paper, we develop the model of interaction at routers. We then implement mixed-mode simulation in ns-2, and conduct a simulation study to evaluate it in the perspective of efficiency in execution time and error discrepancy in simulation results. The simulation results indicate that mixed-mode simulation is an effective candidate for carrying out large-scale simulation for TCP networks since it makes significant performance improvement while retaining the packet-level details. Specifically, mixed-mode simulation achieves an order of magnitude or more improvement (maximally 20 times) in execution time and the improvement becomes more pronounced as the network size increases. On the other hand. the error discrepancy is within 1-2% of the bottleneck link capacity (e.g., the system throughput). (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Integrating network-calculus-based simulation with packet-level simulation for TCP-operated networks", "paper_id": "WOS:000238901800008"}