{"auto_keywords": [{"score": 0.030613766746716675, "phrase": "random_faults"}, {"score": 0.00481495049065317, "phrase": "network_expansion"}, {"score": 0.0046857508651690916, "phrase": "resilient_networks"}, {"score": 0.004638195656547484, "phrase": "node_faults"}, {"score": 0.004245667843980468, "phrase": "original_fault-free_network"}, {"score": 0.004174064076143015, "phrase": "pruning_technique"}, {"score": 0.0040619911719900976, "phrase": "faulty_network"}, {"score": 0.004020740863986328, "phrase": "poor_expansion"}, {"score": 0.003718045060236861, "phrase": "adversarial_setting"}, {"score": 0.003485196263406553, "phrase": "constant_times_alpha"}, {"score": 0.0033004240095380623, "phrase": "graph_g"}, {"score": 0.0030207674474548403, "phrase": "adversarial_case"}, {"score": 0.002653989719462843, "phrase": "fault_probability"}, {"score": 0.002627000223796678, "phrase": "constant_times"}, {"score": 0.0024289743270061157, "phrase": "constant_fault_probability"}, {"score": 0.0023717148226629105, "phrase": "different_parameter"}, {"score": 0.002245842206945282, "phrase": "maximum_fault_probability"}, {"score": 0.002177991273791155, "phrase": "first_known_results"}, {"score": 0.0021049977753042253, "phrase": "d-dimensional_meshes"}], "paper_keywords": [""], "paper_abstract": "We study the problem of how resilient networks are to node faults. Specifically, we investigate the question of how many faults a network can sustain and still contain a large (i.e., linear-sized) connected component with approximately the same expansion as the original fault-free network. We use a pruning technique that culls away those parts of the faulty network that have poor expansion. The faults may occur at random or be caused by an adversary. Our techniques apply in either case. In the adversarial setting we prove that for every network with expansion a, a large connected component with basically the same expansion as the original network exists for up to a constant times alpha . n faults. We show this result is tight in the sense that every graph G of size n and uniform expansion alpha(.) can be broken into components of size o(n) with omega(alpha(n) . n) faults. Unlike the adversarial case, the expansion of a graph gives a very weak bound on its resilience to random faults. While it is the case, as before, that there are networks of uniform expansion Omega(1/ log n) that are not resilient against a fault probability of a constant times 1/log n, it is also observed that there are networks of uniform expansion O(1/root n) that are resilient against a constant fault probability. Thus, we introduce a different parameter, called the span of a graph, which gives us a more precise handle on the maximum fault probability. We use the span to show the first known results for the effect of random faults on the expansion of d-dimensional meshes.", "paper_title": "The effect of faults on network expansion", "paper_id": "WOS:000242614200007"}