{"auto_keywords": [{"score": 0.044294032470466274, "phrase": "lexicographic_objectives"}, {"score": 0.00481495049065317, "phrase": "secure_equilibria"}, {"score": 0.004569905085027681, "phrase": "rational_behavior"}, {"score": 0.004316722156877335, "phrase": "classical_game_theory"}, {"score": 0.0038515000499988673, "phrase": "opponent's_payoff"}, {"score": 0.0036553070575015344, "phrase": "multiple_components"}, {"score": 0.003022186855664124, "phrase": "nash_equilibrium"}, {"score": 0.0027348611289528583, "phrase": "graph_games"}, {"score": 0.002708960273193547, "phrase": "borel_winning_conditions"}, {"score": 0.0024513404432665153, "phrase": "unique_maximal_payoff_profile"}, {"score": 0.00241658945942583, "phrase": "secure_equilibrium"}, {"score": 0.0022608057001451414, "phrase": "omega-regular_winning_conditions"}, {"score": 0.0021971473452127126, "phrase": "memory_requirements"}], "paper_keywords": ["game theory", " Nash equilibria", " omega-regular games", " component-based verification"], "paper_abstract": "In 2-player non-zero-sum games, Nash equilibria capture the options for rational behavior if each player attempts to maximize her payoff. In contrast to classical game theory, we consider lexicographic objectives: first, each player tries to maximize her own payoff, and then, the player tries to minimize the opponent's payoff. Such objectives arise naturally in the verification of systems with multiple components. There, instead of proving that each component satisfies its specification no matter how the other components behave, it sometimes suffices to prove that each component satisfies its specification provided that the other components satisfy their specifications. We say that a Nash equilibrium is secure if it is an equilibrium with respect to the lexicographic objectives of both players. We prove that in graph games with Borel winning conditions, which include the games that arise in verification, there may be several Nash equilibria, but there is always a unique maximal payoff profile of a secure equilibrium. We show how this equilibrium can be computed in the case of omega-regular winning conditions, and we characterize the memory requirements of strategies that achieve the equilibrium. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Games with secure equilibria", "paper_id": "WOS:000242312400004"}