{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "beam_elements"}, {"score": 0.029569783529974383, "phrase": "extended_finite_element_description"}, {"score": 0.004715908063787721, "phrase": "electrical_machines"}, {"score": 0.004162826481635768, "phrase": "common_description"}, {"score": 0.004034962424068988, "phrase": "shape_functions"}, {"score": 0.0036363418376496484, "phrase": "finite_element_description"}, {"score": 0.0035063024767122684, "phrase": "high-order_shape_functions"}, {"score": 0.0033633514001658086, "phrase": "seventh_degree"}, {"score": 0.0029224275921964724, "phrase": "large_influence"}, {"score": 0.0028325548627901004, "phrase": "conventional_fe_program"}, {"score": 0.002674885993329912, "phrase": "practical_implications"}, {"score": 0.002461059114204796, "phrase": "matlab."}, {"score": 0.002435542816459651, "phrase": "static_and_dynamic_behavior"}, {"score": 0.002360607691114015, "phrase": "electrical_machine"}, {"score": 0.0021049977753042253, "phrase": "conventional_finite_element_descriptions"}], "paper_keywords": ["Finite element method", " Rotor in electrical machines", " Shape functions", " Timoshenko beam element"], "paper_abstract": "Purpose - The purpose of this paper is to get a more consistent finite element description for three-dimensional (3D) Timoshenko beam elements. It extends the common description of beam elements by modifying the shape functions and considers the warping of the cross-section due to torsion. Design/methodology/approach - The paper builds mainly on a finite element description of 3D Timoshenko beam elements. The implementation of high-order shape functions for torsion is done by adding a seventh degree of freedom to the system. Findings - The results reveal that for some beams, depending on their physical dimensions, the warping of the cross-section has large influence. In comparison to a conventional FE program, the extended finite element description considers the warping and yields more accurate results. Practical implications - An application of the extended finite element description is done with an implementation of the code in MATLAB. The static and dynamic behavior of a rotor in an electrical machine is investigated. Originality/value - This paper presents a more consistent finite element description of 3D Timoshenko beam elements considering the warping. A comparison to conventional finite element descriptions is given.", "paper_title": "A full structural mechanical description of beam elements for rotors in electrical machines", "paper_id": "WOS:000369422000005"}