{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neural_architecture"}, {"score": 0.03317280490355695, "phrase": "binding_process"}, {"score": 0.0047804843375940835, "phrase": "grounded_language_processing"}, {"score": 0.004746263721902197, "phrase": "human_cognition"}, {"score": 0.004401342842183475, "phrase": "language_processing"}, {"score": 0.003798231095121328, "phrase": "productive_manner"}, {"score": 0.0034716556902775007, "phrase": "local_and_global_aspects"}, {"score": 0.00333697550984782, "phrase": "neural_\"binding\"_mechanisms"}, {"score": 0.0030499378654797143, "phrase": "feedforward_network"}, {"score": 0.002747676657869163, "phrase": "control_system"}, {"score": 0.002669683153809812, "phrase": "recurrent_system"}, {"score": 0.0024842242921857705, "phrase": "test_sentences"}, {"score": 0.0023199580436336163, "phrase": "dynamical_binding_conflicts"}, {"score": 0.0022298571016688335, "phrase": "potential_influence"}], "paper_keywords": ["Grounded representations", " Binding", " Learning", " Productivity", " Language", " Dynamics", " Neural architecture"], "paper_abstract": "Human cognition is characterized by three important features: productivity, dynamics and grounding. These features can be integrated in a neural architecture of language processing. The representations in this architecture always remain \"in situ\", because they are grounded in perception, action, emotion, associations and (semantic) relations. The neural architecture shows how these representations can be combined in a productive manner, and how dynamics influences this process. The constraints that each of these features impose on each other result in an architecture in which local and global aspects interact in processing and learning. The architecture consists of neural \"binding\" mechanisms that produce (novel) sentence structures on the fly. Here, we discuss how the control of this binding process can be learned. We trained a feedforward network (FFN) for this task. The results show that information from the architecture is needed as input to learn control of binding. Thus, the control system is recurrent. We show that this recurrent system can learn control of binding for basic (but recursive) sentence structures. After learning, the binding process behaves well on a series of test sentences, including sentences with (unlimited) embeddings. However, for some of these sentences, difficulties arise due to dynamical binding conflicts in the architecture. We also discuss and illustrate the potential influence that the dynamics in the architecture could have on the binding process. (C) 2008 Elsevier B. V. All rights reserved.", "paper_title": "Learning of control in a neural architecture of grounded language processing", "paper_id": "WOS:000272204800010"}