{"auto_keywords": [{"score": 0.04243918585673839, "phrase": "snip"}, {"score": 0.012245740058272286, "phrase": "norwegian_model"}, {"score": 0.008713765872165671, "phrase": "citation-based_and_expert-based_assessments"}, {"score": 0.004616859702338596, "phrase": "norwegian_quality_assessments"}, {"score": 0.0036553070575015344, "phrase": "expert-based_source_assessments"}, {"score": 0.0035376693476114733, "phrase": "different_subject_area_categories"}, {"score": 0.003472149546470424, "phrase": "-_the_degree"}, {"score": 0.0031919592786945126, "phrase": "higher_quality_levels"}, {"score": 0.0031328221096543823, "phrase": "substantially_higher_rip"}, {"score": 0.003003726508522467, "phrase": "subject_area_categories"}, {"score": 0.002839812512030847, "phrase": "field_normalization_point"}, {"score": 0.0027100725504733583, "phrase": "rip"}, {"score": 0.002538263784314365, "phrase": "highest_quality_level"}, {"score": 0.0022475295254231714, "phrase": "citation_practices"}, {"score": 0.002226592967032469, "phrase": "scientific_fields"}, {"score": 0.0021649437083408425, "phrase": "citation_indicators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citation impact", " Field normalization", " Norwegian model", " RIP", " SJR2", " SNIP"], "paper_abstract": "We study the correlation between citation-based and expert-based assessments of journals and series, which we collectively refer to as sources. The source normalized impact per paper (SNIP), the Scimago Journal Rank 2 (SJR2) and the raw impact per paper (RIP) indicators are used to assess sources based on their citations, while the Norwegian model is used to obtain expert-based source assessments. We first analyze - within different subject area categories and across such categories - the degree to which RIP, SNIP and SJR2 values correlate with the quality levels in the Norwegian model. We find that sources at higher quality levels on average have substantially higher RIP, SNIP, and SJR2 values. Regarding subject area categories, SNIP seems to perform substantially better than SJR2 from the field normalization point of view. We then compare the ability of RIP, SNIP and SJR2 to predict whether a source is classified at the highest quality level in the Norwegian model or not. SNIP and SJR2 turn out to give more accurate predictions than RIP, which provides evidence that normalizing for differences in citation practices between scientific fields indeed improves the accuracy of citation indicators. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The correlation between citation-based and expert-based assessments of publication channels: SNIP and SJR vs. Norwegian quality assessments", "paper_id": "WOS:000345527400018"}