{"auto_keywords": [{"score": 0.04839945497190438, "phrase": "empirical_studies"}, {"score": 0.03397371904693442, "phrase": "controlled_experiment"}, {"score": 0.00481495049065317, "phrase": "static_analysis_technologies"}, {"score": 0.004766090327062509, "phrase": "concurrent_software"}, {"score": 0.004598933498016774, "phrase": "software_engineering"}, {"score": 0.004506048850130758, "phrase": "particular_contexts"}, {"score": 0.0034556603183020407, "phrase": "existing_studies"}, {"score": 0.003403122817578447, "phrase": "power_analyses"}, {"score": 0.003351381374975648, "phrase": "accurate_minimum_sample_size"}, {"score": 0.0031360786664165093, "phrase": "automated_static_analysis_tools"}, {"score": 0.002860546817196148, "phrase": "concurrent_java_components"}, {"score": 0.0026359661683151006, "phrase": "automated_static_analysis"}, {"score": 0.0026091594819333654, "phrase": "code_inspection"}, {"score": 0.0022041312401435346, "phrase": "conclusive_results"}], "paper_keywords": ["controlled experiment", " concurrent Java components", " verification and validation"], "paper_abstract": "The results of empirical studies in Software Engineering are limited to particular contexts, difficult to generalise and the studies themselves are expensive to perform. Despite these problems, empirical studies can be made effective and they are important to both researchers and practitioners. The key to their effectiveness lies in the maximisation of the information that can be gained by examining and replicating existing studies and using power analyses for an accurate minimum sample size. This approach was applied in a controlled experiment examining the combination of automated static analysis tools and code inspection in the context of the verification and validation (V & V) of concurrent Java components. The paper presents the results of this controlled experiment and shows that the combination of automated static analysis and code inspection is cost-effective. Throughout the experiment a strategy to maximise the information gained from the experiment was used. As a result, despite the size of the study, conclusive results were obtained, contributing to the research on V & V technology evaluation.", "paper_title": "Maximising the information gained from a study of static analysis technologies for concurrent software", "paper_id": "WOS:000250592200003"}