{"auto_keywords": [{"score": 0.02700297753925382, "phrase": "ipac"}, {"score": 0.013488371721761854, "phrase": "autonomous_operation"}, {"score": 0.01338206170587395, "phrase": "open_dre_systems"}, {"score": 0.008197182060973146, "phrase": "autonomic_computing_capabilities"}, {"score": 0.007274763144874257, "phrase": "adaptive_planning"}, {"score": 0.00481495049065317, "phrase": "adaptive_resource_management_architecture_for_distributed_real-time_embedded_systems"}, {"score": 0.004608121749000898, "phrase": "closed_environments"}, {"score": 0.004571478018964363, "phrase": "operating_conditions"}, {"score": 0.004535124351828787, "phrase": "input_workloads"}, {"score": 0.004481132747216135, "phrase": "resource_availability"}, {"score": 0.004203803478570494, "phrase": "increasing_demand"}, {"score": 0.004120694410890683, "phrase": "autonomous_capabilities"}, {"score": 0.0035687137873965684, "phrase": "autonomous_adaptation"}, {"score": 0.0035403060198952244, "phrase": "varying-even_unpredictable-operational_conditions"}, {"score": 0.003334309053314909, "phrase": "dre_systems"}, {"score": 0.003268333444704392, "phrase": "resource_management"}, {"score": 0.0032036590920314725, "phrase": "mission_objectives"}, {"score": 0.002910545717767559, "phrase": "dynamic_resource_allocation"}, {"score": 0.002818909613625567, "phrase": "coordinated_system_adaptation"}, {"score": 0.0026547761341670505, "phrase": "autonomic_computing"}, {"score": 0.0023925401023682717, "phrase": "open_dre_system_case_study"}, {"score": 0.0023171750718791713, "phrase": "planning_and_adaptive_resource_management_capabilities"}, {"score": 0.0021049977753042253, "phrase": "system_resources"}], "paper_keywords": ["Real-time and embedded systems", " distributed systems", " hierarchical design"], "paper_abstract": "Real-time and embedded systems have traditionally been designed for closed environments where operating conditions, input workloads, and resource availability are known a priori and are subject to little or no change at runtime. There is an increasing demand, however, for autonomous capabilities in open distributed real-time and embedded (DRE) systems that execute in environments where input workload and resource availability cannot be accurately characterized a priori. These systems can benefit from autonomic computing capabilities, such as self-(re)configuration and self-optimization, that enable autonomous adaptation under varying-even unpredictable-operational conditions. A challenging problem faced by researchers and developers in enabling autonomic computing capabilities to open DRE systems involves devising adaptive planning and resource management strategies that can meet mission objectives and end-to-end quality of service (QoS) requirements of applications. To address this challenge, this paper presents the Integrated Planning, Allocation, and Control (IPAC) framework, which provides decision-theoretic planning, dynamic resource allocation, and runtime system control to provide coordinated system adaptation and enable the autonomous operation of open DRE systems. This paper presents two contributions to research on autonomic computing for open DRE systems. First, we describe the design of IPAC and show how IPAC resolves the challenges associated with the autonomous operation of a representative open DRE system case study. Second, we empirically evaluate the planning and adaptive resource management capabilities of IPAC in the context of our case study. Our experimental results demonstrate that IPAC enables the autonomous operation of open DRE systems by performing adaptive planning and management of system resources.", "paper_title": "An Integrated Planning and Adaptive Resource Management Architecture for Distributed Real-Time Embedded Systems", "paper_id": "WOS:000270031000005"}