{"auto_keywords": [{"score": 0.049198528177459636, "phrase": "graphene_sheets"}, {"score": 0.008093549870162186, "phrase": "diffusion_coefficients"}, {"score": 0.00481495049065317, "phrase": "ionic_liquid"}, {"score": 0.004388035083357706, "phrase": "dynamical_properties"}, {"score": 0.00383508177668219, "phrase": "different_interwall_distances"}, {"score": 0.0035273744062641636, "phrase": "seven_temperatures"}, {"score": 0.0031697368057340895, "phrase": "shortest_h"}, {"score": 0.003125835572347772, "phrase": "dense_monolayer"}, {"score": 0.0028218877037665484, "phrase": "potential_energy_diagram"}, {"score": 0.0027188259793109264, "phrase": "minimum_potential_energy"}, {"score": 0.002607362103727335, "phrase": "minimum_overlap"}, {"score": 0.0025712297362596574, "phrase": "density_profiles"}, {"score": 0.0021049977753042253, "phrase": "orientation_functions"}], "paper_keywords": ["Confined", " Graphene", " Ionic liquid", " Molecular dynamics simulation"], "paper_abstract": "This work was aimed to investigate the behavior, morphology, structure, and dynamical properties of pure ionic liquid (IL) 1-ethyl-3-methylimidazolium tetrafluoroborate ([emim][BF4]) confined between two parallel and flat graphene sheets at different interwall distances, H. Thus, molecular dynamic (MD) simulations were performed for different interwall distances including (10, 14, 16, 20, 23, and 28) angstrom at seven temperatures from 278 to 308 K. These results showed that the distribution and orientation of cations and anions on the graphene sheets depended on H. At the shortest H, a dense monolayer of the anions and cations was formed between two graphene sheets. The number of these layers increased as H increased. The potential energy diagram as a function of H demonstrated a minimum potential energy at H=16 angstrom. Also, there was a minimum overlap between the density profiles of the cations and anions at H=16 angstrom. Diffusion coefficients of the cations and anions increased as temperature and H increased. Moreover, slope of the plot of the diffusion coefficients of the cations and anions versus H significantly changed at H=16 angstrom. Orientation functions revealed that most of the cations oriented parallel to the graphene sheets.", "paper_title": "Specific distributions of anions and cations of an ionic liquid through confinement between graphene sheets", "paper_id": "WOS:000357458400002"}