{"auto_keywords": [{"score": 0.049369655300443765, "phrase": "ship_handling_simulator"}, {"score": 0.015719716506582538, "phrase": "ocean_waves"}, {"score": 0.007712975710434191, "phrase": "motion_calculation_module"}, {"score": 0.004337028108577593, "phrase": "realistic_and_intuitive_image_generation"}, {"score": 0.0040854526743211396, "phrase": "ship_navigation_simulators"}, {"score": 0.0038869467872381957, "phrase": "ship_motions"}, {"score": 0.0036070601923916196, "phrase": "calculated_motions"}, {"score": 0.0030600032877646263, "phrase": "traffic_ships"}, {"score": 0.002925728709297618, "phrase": "traffic_ship"}, {"score": 0.002769568481822277, "phrase": "realistic_visualization"}, {"score": 0.002634830238219976, "phrase": "simple_dynamics_model"}, {"score": 0.002595698433525986, "phrase": "ship_and_buoy_motions"}, {"score": 0.0025317627242523104, "phrase": "input_data"}, {"score": 0.0025066304722422463, "phrase": "wave_height"}, {"score": 0.0022799458141165587, "phrase": "proposed_dynamics_model"}], "paper_keywords": ["ocean waves", " real-time three-dimensional visualization", " ship and buoy dynamics model", " ship handling simulator"], "paper_abstract": "A ship's real-time three-dimensional (3D) visualization system, a component of a handling simulator, is one of its most important components, since realistic and intuitive image generation play an essential role in improving the effects of education using ship navigation simulators. Ship handling simulators should have capabilities of calculating ship motions (heave, pitch, and roll) at any given sea state and display the calculated motions through a real-time 3D visualization system. The motion solver of a ship handling simulator calculates those motions in addition to maneuverings for an own ship, the main simulation target, but only provides maneuvering information about traffic ships. Therefore, it is required to simulate traffic ship and buoy motions arising from ocean waves in a ship handling simulator for realistic visualization. In this paper, the authors propose a simple dynamics model by which ship and buoy motions are calculated with the input data of wave height and discuss a method for the implementation of a ship and buoy motion calculation module. The feasibility of the proposed dynamics model and the motion calculation module has been demonstrated through the development of a prototype real-time 3D visualization system based on an open-source 3D graphics engine.", "paper_title": "Simulating ship and buoy motions arising from ocean waves in a ship handling simulator", "paper_id": "WOS:000310883000001"}