{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "olive_oil"}, {"score": 0.04226255901245674, "phrase": "sensory_evaluation"}, {"score": 0.04154837736006719, "phrase": "evaluated_items"}, {"score": 0.00481495049065317, "phrase": "linguistic_multigranular_sensory_evaluation_model"}, {"score": 0.004406994912939125, "phrase": "different_objectives"}, {"score": 0.004329630571352367, "phrase": "quality_inspection"}, {"score": 0.004178935413340453, "phrase": "industrial_companies"}, {"score": 0.0036481158025940016, "phrase": "human_senses"}, {"score": 0.003091767402370757, "phrase": "successful_results"}, {"score": 0.0024842242921857705, "phrase": "different_linguistic_term_sets"}, {"score": 0.0023139986108451967, "phrase": "sensory_evaluation_model"}, {"score": 0.002273292707863821, "phrase": "multigranular_linguistic_evaluation_framework"}, {"score": 0.0022201273900989416, "phrase": "decision_analysis_scheme"}, {"score": 0.0021049977753042253, "phrase": "sensory_evaluation_process"}], "paper_keywords": [""], "paper_abstract": "Evaluation is a process that analyzes elements in order to achieve different objectives such as quality inspection, marketing and other fields in industrial companies. This paper focuses on sensory evaluation where the evaluated items are assessed by a panel of experts according to the knowledge acquired via human senses. In these evaluation processes the information provided by the experts implies uncertainty, vagueness and imprecision. The use of the Fuzzy Linguistic Approach (32) has provided successful results modelling such a type of information. In sensory evaluation it may happen that the panel of experts have more or less degree knowledge of about the evaluated items or indicators. So, it seems suitable that each expert could express their preferences in different linguistic term sets based on their own knowledge. In this paper, we present a sensory evaluation model that manages multigranular linguistic evaluation framework based on a decision analysis scheme. This model will be applied to the sensory evaluation process of Olive Oil.", "paper_title": "A Linguistic Multigranular Sensory Evaluation Model for Olive Oil", "paper_id": "WOS:000264143700005"}