{"auto_keywords": [{"score": 0.04660802533264657, "phrase": "load_distribution"}, {"score": 0.046081391722127746, "phrase": "wrist_joint"}, {"score": 0.00481495049065317, "phrase": "ulna_carpal_joint"}, {"score": 0.003919973783578995, "phrase": "three-dimensional_model"}, {"score": 0.003753022329975749, "phrase": "grip_handle"}, {"score": 0.0034129490818185595, "phrase": "rigid_bodies"}, {"score": 0.003359334465113303, "phrase": "proximal_end"}, {"score": 0.002971309306027602, "phrase": "load_distributions"}, {"score": 0.0029362173680378624, "phrase": "carpal_articular_surface"}, {"score": 0.0027778413437997613, "phrase": "applied_load"}, {"score": 0.002437425029824563, "phrase": "obtained_results"}, {"score": 0.0023990982005125763, "phrase": "previous_outcomes"}, {"score": 0.002370748155770563, "phrase": "prior_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Biomechanics of the wrist", " Load transmission", " Radius", " Ulna", " Joint analysis", " Carpal mechanics"], "paper_abstract": "Purpose: The purpose of this study is to validate a model for the analysis of the load distribution through the wrist joint, subjected to forces on the axes of the metacarpals from distal to proximal for two different mesh densities. Method: To this end, the Rigid Body Spring Model (RBSM) method was used on a three-dimensional model of the wrist joint, simulating the conditions when making a grip handle. The cartilage and ligaments were simulated as springs acting under compression and tension, respectively, while the bones were considered as rigid bodies. At the proximal end of the ulna the movement was completely restricted, and the radius was allowed to move only in the lateral/medial direction. Results: With these models, we found the load distributions on each carpal articular surface of radius. Additionally, the results show that the percentage of the applied load transmitted through the radius was about 86% for one mesh and 88% for the coarser one; for the ulna it was 21% for one mesh and 18% for the coarser. Conclusions: The obtained results are comparable with previous outcomes reported in prior studies. The latter allows concluding that, in theory, the methodology can be used to describe the changes in load distribution in the wrist. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Theoretical distribution of load in the radius and ulna carpal joint", "paper_id": "WOS:000353737400010"}