{"auto_keywords": [{"score": 0.04065736336796178, "phrase": "computer_cluster"}, {"score": 0.00481495049065317, "phrase": "pre-laboratory_chemical_course"}, {"score": 0.0047363569540686936, "phrase": "webct._pre-laboratory_activities"}, {"score": 0.0046437283535486545, "phrase": "students'_preparation"}, {"score": 0.004206948146882303, "phrase": "pre-laboratory_session"}, {"score": 0.004030665954016992, "phrase": "greece"}, {"score": 0.004004287228276489, "phrase": "uk"}, {"score": 0.003951736710391294, "phrase": "greek_students"}, {"score": 0.003748823861741978, "phrase": "face-to-face_communication"}, {"score": 0.0037000001537733185, "phrase": "english"}, {"score": 0.0036392821787269727, "phrase": "on-line_webct_course"}, {"score": 0.0035680320746705064, "phrase": "on-line_asynchronous_discussion"}, {"score": 0.0034183895670057717, "phrase": "simulation_program"}, {"score": 0.003264224201388006, "phrase": "teacher's_effort"}, {"score": 0.0031067299689394065, "phrase": "university_facilities"}, {"score": 0.0029960701622407924, "phrase": "virtual_learning_environments"}, {"score": 0.0028893405654376826, "phrase": "different_way"}, {"score": 0.002795607293713107, "phrase": "similar_learning_outcome"}, {"score": 0.0026085220231994955, "phrase": "teacher's_role"}, {"score": 0.0025913692304671675, "phrase": "slight_difference"}, {"score": 0.002433926157079375, "phrase": "expected_learning_outcome"}, {"score": 0.0024179186667595436, "phrase": "face-to-face_discussion"}, {"score": 0.002339442939538852, "phrase": "virtual_learning_environment"}, {"score": 0.0022486192232506388, "phrase": "facilitator_role"}, {"score": 0.0021470954708827125, "phrase": "independent_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Simulations", " Teaching/learning strategies", " Interactive learning environments", " Cooperative/collaborative learning", " Improving classroom teaching"], "paper_abstract": "Pre-laboratory activities have been known to improve students' preparation before their practical work as they assist students to make available more working memory capacity for actual learning during the laboratory. The aim of this investigation was to compare two different teaching approaches which supported a pre-laboratory session by using the same simulation program. The investigation was conducted in two countries (Greece and UK). The Greek students attended the course in a computer cluster, where the teacher and the students had a face-to-face communication, while the English students participated in the on-line WebCT course, where there was an on-line asynchronous discussion. A crucial point which emerged from this investigation was that the simulation program in the two different pre-laboratory training sessions gave the same learning outcome; however, the learning characteristics and the teacher's effort were different. Thus, the teacher could adopt both the two teaching approaches depending on the university facilities, the staffs time and the students' familiarity with virtual learning environments. However, in each case of students followed a different way (collaboration or/and independent learning) to obtain the similar learning outcome. In all cases after their pre-laboratory training session they entered the laboratory performing the experiments without any further instructions. Additionally, the teacher's role was slight difference in the two teaching approaches. In the computer cluster, the teacher had a more active role guiding students to obtain the expected learning outcome through face-to-face discussion and interaction, whereas in the case of the virtual learning environment (WebCT), the teacher had a more of a facilitator role focused on posing questions to the students and collecting the resources promoting the independent learning. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Integration of simulation into pre-laboratory chemical course: Computer cluster versus WebCT", "paper_id": "WOS:000263701900005"}