{"auto_keywords": [{"score": 0.0250463203675907, "phrase": "alloy"}, {"score": 0.00481495049065317, "phrase": "adapting_time-critical_requirements"}, {"score": 0.004112812699639956, "phrase": "run-time_monitor"}, {"score": 0.003891140864902669, "phrase": "erroneous_conditions"}, {"score": 0.0038253590626087237, "phrase": "appropriate_reactions"}, {"score": 0.003776750773624222, "phrase": "timely_manner"}, {"score": 0.0029871209444889716, "phrase": "critical_requirements"}, {"score": 0.0029116257477000617, "phrase": "dynamic_modification"}, {"score": 0.00268488398249084, "phrase": "system_architecture"}, {"score": 0.002583713580625699, "phrase": "timing_condition"}, {"score": 0.002539978170928796, "phrase": "timing_constraints"}, {"score": 0.002465210678474529, "phrase": "fractal_aspect_component"}, {"score": 0.002372298201966367, "phrase": "fractal-adl"}, {"score": 0.0022731540640627307, "phrase": "proposed_framework"}, {"score": 0.0022251433045184454, "phrase": "smart_cruise_control_system"}, {"score": 0.002132135985573126, "phrase": "monitoring_system"}, {"score": 0.0021049977753042253, "phrase": "dynamic_and_time"}], "paper_keywords": ["Monitoring", " Reconfiguration", " CBSE", " Fractal component", " Time critical"], "paper_abstract": "Sensor data can be useful in various applications, but it is also critical in some areas, such as health, safety and finance. In particular, in a time critical environment, temporal correlation of streaming sensor data should be monitored. A run-time monitor is embedded in the server for such applications, in order to detect erroneous conditions, and perform appropriate reactions in a timely manner. However, modification of the monitor may require stop and restart of the server, in order to take effect. This kind of option is not permissible where the server should be performing continuously. In this paper, we propose a component based reconfigurable sensor network monitor designed for handling time critical requirements. In order to allow dynamic modification, we implement both the server and the monitor on the Fractal Component model, which enables us to reconfigure the system architecture in run-time. For detecting violation of the timing condition, we specify timing constraints, and design the monitor on Fractal Aspect Component. The architecture can be formally verified by Fractal-ADL and Alloy. We demonstrate the feasibility of the proposed framework, by developing a smart cruise control system. We aim to provide guidance to construct a monitoring system in a dynamic and time critical environment.", "paper_title": "A Component-Based Reconfigurable Sensor Network Monitor for Adapting Time-Critical Requirements", "paper_id": "WOS:000320291200009"}