{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fast_tcp"}, {"score": 0.037771328677087865, "phrase": "bandwidth_allocation"}, {"score": 0.03168395817587274, "phrase": "tcp_reno"}, {"score": 0.004381962669035583, "phrase": "protocol_enhancements"}, {"score": 0.0041200448395938526, "phrase": "general_telecommunications_networks"}, {"score": 0.0037087324991876727, "phrase": "max-min_fairness_bandwidth_allocation"}, {"score": 0.0036288825833675127, "phrase": "euclidean_distance"}, {"score": 0.003512308265830794, "phrase": "max-min_bandwidth_allocation"}, {"score": 0.0030933709720820605, "phrase": "new_framework"}, {"score": 0.00295078850927459, "phrase": "max-min_fairness_criteria"}, {"score": 0.002887210021573995, "phrase": "max-min_fair_allocation"}, {"score": 0.002754103864198219, "phrase": "euclidian_norm"}, {"score": 0.0027143926774929957, "phrase": "explicit_expressions"}, {"score": 0.002655894070657161, "phrase": "general_network"}, {"score": 0.0023990982005125763, "phrase": "fast_tsp"}, {"score": 0.002355920629285463, "phrase": "\"parking_lot\"_linear_network"}, {"score": 0.0023219374444738723, "phrase": "nsfnet_backbone_network"}, {"score": 0.0022801453935251503, "phrase": "merely_a_comparison"}, {"score": 0.002206801982145622, "phrase": "better_choice"}], "paper_keywords": ["FAST TCP", " TCP Reno", " max-min fairness", " fairness comparison metric", " utility function"], "paper_abstract": "In networking, it is often required to quantify by how much one protocol is fairer than another and how certain parameter setting and/or protocol enhancements improve fairness. This paper provides a framework to evaluate the fairness of various protocols in a general telecommunications networks. Within this framework, there are two key components: (1) a benchmark and (2) a single dimension metric. We suggest to use the max-min fairness bandwidth allocation as the benchmark and the Euclidean distance between any bandwidth allocation under any protocol and the max-min bandwidth allocation as the metric. Explicity, we provide a method to compare the fairness of these sets of bandwidth allocation under two different protocols for a given network by using this metric. On the basis of this new framework, we evaluate the fairness of FAST TCP and TCP Reno relative to the max-min fairness criteria. The distance between the max-min fair allocation and allocations based on each of the two protocols is measured using the Euclidian norm. We derive explicit expressions for these distances for a general network and compare the fairness of these two protocols by using their corresponding utility functions. Finally, we numerically demonstrate how this method can be applied to compare the fairness of FAST TSP and TCP Reno for a \"Parking Lot\" linear network and for the NSFNET Backbone network. In addition to merely a comparison between protocols, such numerical results can provide guidelines for better choice of parameters to make a protocol fairer in a given scenario. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Fairness comparison of FAST TCP and TCP Reno", "paper_id": "WOS:000245700600018"}