{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "leiden"}, {"score": 0.00481495049065317, "phrase": "citation-based_university_rankings"}, {"score": 0.004552648949390462, "phrase": "heightened_competition"}, {"score": 0.004489327204473076, "phrase": "strong_growth"}, {"score": 0.004426882270402403, "phrase": "international_higher_education_market"}, {"score": 0.00436530211426514, "phrase": "increasing_number"}, {"score": 0.004205226397573506, "phrase": "scientific_performance"}, {"score": 0.004032118497047498, "phrase": "leiden_ranking"}, {"score": 0.003504756881063581, "phrase": "multilevel_regression_models"}, {"score": 0.0033603864623013733, "phrase": "ranking_results"}, {"score": 0.0032370412139943808, "phrase": "lr_data"}, {"score": 0.0025264171945423254, "phrase": "university_rankings"}, {"score": 0.0023662411481713682, "phrase": "goldstein-adjusted_confidence_intervals"}, {"score": 0.0022058510091498666, "phrase": "rank_differences"}], "paper_keywords": ["social sciences"], "paper_abstract": "Since the 1990s, with the heightened competition and the strong growth of the international higher education market, an increasing number of rankings have been created that measure the scientific performance of an institution based on data. The Leiden Ranking 2011/2012 (LR) was published early in 2012. Starting from Goldstein and Spiegelhalter's (1996) recommendations for conducting quantitative comparisons among institutions, in this study we undertook a reformulation of the LR by means of multilevel regression models. First, with our models we replicated the ranking results; second, the reanalysis of the LR data showed that only 5% of the PPtop10% total variation is attributable to differences between universities. Beyond that, about 80% of the variation between universities can be explained by differences among countries. If covariates are included in the model the differences among most of the universities become meaningless. Our findings have implications for conducting university rankings in general and for the LR in particular. For example, with Goldstein-adjusted confidence intervals, it is possible to interpret the significance of differences among universities meaningfully: Rank differences among universities should be interpreted as meaningful only if their confidence intervals do not overlap.", "paper_title": "Multilevel-statistical reformulation of citation-based university rankings: The Leiden ranking 2011/2012", "paper_id": "WOS:000321743500010"}