{"auto_keywords": [{"score": 0.031118791864958004, "phrase": "dissolution_rate"}, {"score": 0.028195869013090007, "phrase": "aqueous_phase"}, {"score": 0.00481495049065317, "phrase": "carbon_dioxide_geological_storage"}, {"score": 0.004539005582217309, "phrase": "geological_storage"}, {"score": 0.004500891637057374, "phrase": "carbon_dioxide"}, {"score": 0.004333283735537634, "phrase": "carbon_capture"}, {"score": 0.00413684709497912, "phrase": "primary_options"}, {"score": 0.004067635935640407, "phrase": "anthropogenic_emissions"}, {"score": 0.0040334640350288, "phrase": "greenhouse_gases"}, {"score": 0.003883194688426525, "phrase": "power_plants"}, {"score": 0.003378385493203297, "phrase": "formation_fluids"}, {"score": 0.0032387402145603412, "phrase": "two-phase_interface"}, {"score": 0.0030787405733989615, "phrase": "favorable_conditions"}, {"score": 0.0028775998963807324, "phrase": "density-driven_convection_process"}, {"score": 0.0028174721236762317, "phrase": "storage_security"}, {"score": 0.0026895647154863405, "phrase": "density_reduction"}, {"score": 0.0023100907305651872, "phrase": "spatial_distribution"}, {"score": 0.0022051664509486206, "phrase": "varying_amounts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Carbon storage", " Impurity", " Convective mixing", " Numerical simulation"], "paper_abstract": "Numerical simulations are carried out to investigate the effects of impurity on geological storage of carbon dioxide (CO2), in the context of carbon capture and storage which has been considered as one of the primary options for significantly reducing anthropogenic emissions of greenhouse gases into the atmosphere. The CO2 streams captured from power plants or other large industrial processes contain a variety of impurities. This study investigates the effects of nitrogen (N-2) on the dissolution trapping mechanism, which occurs when the injected CO2 mixture dissolves into the formation fluids. The density of the formation water/brine at the two-phase interface would increase in response to the dissolution of CO2. At favorable conditions, convection would be triggered and could greatly accelerate the dissolution rate of CO2. This density-driven convection process is beneficial for both storage security and permanence. However, N-2 would lead to a density reduction of the aqueous phase when dissolved into the formation water/brine. The onset of convection would be delayed and the dissolution rate may be affected when co-injecting CO2 with N-2. In addition, the spatial distribution of CO2 in the aqueous phase would also be different with varying amounts of N-2 in the CO2 streams. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Numerical analyses of the effects of nitrogen on the dissolution trapping mechanism of carbon dioxide geological storage", "paper_id": "WOS:000354141400001"}