{"auto_keywords": [{"score": 0.04894129109140115, "phrase": "blood_vessels"}, {"score": 0.02341215007405381, "phrase": "fp"}, {"score": 0.02246652091452348, "phrase": "fn"}, {"score": 0.004645057834614705, "phrase": "image_segmentation"}, {"score": 0.004562362497952548, "phrase": "important_role"}, {"score": 0.004508048086020253, "phrase": "image_analysis"}, {"score": 0.0042459818200777846, "phrase": "observer's_goal"}, {"score": 0.004023120753104693, "phrase": "unique_method"}, {"score": 0.003857871979942733, "phrase": "possible_cases"}, {"score": 0.0032229262928681304, "phrase": "new_algorithm"}, {"score": 0.002963390095037466, "phrase": "important_information"}, {"score": 0.0024311346712789553, "phrase": "manual_segmentation"}, {"score": 0.0023171750718791713, "phrase": "mean_shift_segmentation"}, {"score": 0.0022218413146898887, "phrase": "false_positives"}, {"score": 0.0021304214257321, "phrase": "false_negatives"}], "paper_keywords": ["image segmentation", " mean shift", " spectral methods"], "paper_abstract": "Image segmentation plays an important role in image analysis. According to several authors, segmentation terminates when the observer's goal is satisfied. For this reason. a unique method that can be applied to all possible cases does not yet exist. In this paper, we have carried out a comparison between two current segmentation techniques, namely the mean shift method, for which we propose a new algorithm, and the so-called spectral method. In this investigation the important information to be extracted from an image is the number of blood vessels (BV) present in the image. The results obtained by both strategies were compared with the results provided by manual segmentation. We have found that using the mean shift segmentation an error less than 20% for false positives (FP) and 0% for false negatives (FN) was observed, while for the spectral method more than 45% for FP and 0% for FN were obtained. We discuss the advantages and disadvantages of both methods. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison between two robust techniques for segmentation of blood vessels", "paper_id": "WOS:000259134700009"}