{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "colin"}, {"score": 0.010461202404277198, "phrase": "continuous_linear_numeric_change"}, {"score": 0.004305364955542171, "phrase": "full_temporal_semantics"}, {"score": 0.003991040678278726, "phrase": "expressive_reasoning_capabilities"}, {"score": 0.003891430578662587, "phrase": "continuous_linear_change"}, {"score": 0.003808024029417427, "phrase": "duration-dependent_effects"}, {"score": 0.003753411452669234, "phrase": "duration_inequalities"}, {"score": 0.0036729522133392175, "phrase": "tightly_coupled_temporal_and_numeric_reasoning"}, {"score": 0.003367939885018247, "phrase": "interacting_temporal_and_numeric_constraints"}, {"score": 0.003295795306155526, "phrase": "lp"}, {"score": 0.002790940765338191, "phrase": "continuous_change"}, {"score": 0.002721201438773336, "phrase": "task_variables"}, {"score": 0.002682133505994396, "phrase": "suitable_candidates"}, {"score": 0.0026151058979100596, "phrase": "continuous_numeric_change"}, {"score": 0.002486021541116251, "phrase": "mixed_integer_programming"}, {"score": 0.0021746545596056125, "phrase": "continuous_numeric_effects"}], "paper_keywords": [""], "paper_abstract": "In this paper we describe COLIN, a forward-chaining heuristic search planner, capable of reasoning with COntinuous LINear numeric change, in addition to the full temporal semantics of PDDL2.1. Through this work we make two advances to the state-of-the-art in terms of expressive reasoning capabilities of planners: the handling of continuous linear change, and the handling of duration-dependent effects in combination with duration inequalities, both of which require tightly coupled temporal and numeric reasoning during planning. COLIN combines FF-style forward chaining search, with the use of a Linear Program (LP) to check the consistency of the interacting temporal and numeric constraints at each state. The LP is used to compute bounds on the values of variables in each state, reducing the range of actions that need to be considered for application. In addition, we develop an extension of the Temporal Relaxed Planning Graph heuristic of CRIKEY3, to support reasoning directly with continuous change. We extend the range of task variables considered to be suitable candidates for specifying the gradient of the continuous numeric change effected by an action. Finally, we explore the potential for employing mixed integer programming as a tool for optimising the timestamps of the actions in the plan, once a solution has been found. To support this, we further contribute a selection of extended benchmark domains that include continuous numeric effects. We present results for COLIN that demonstrate its scalability on a range of benchmarks, and compare to existing state-of-the-art planners.", "paper_title": "COLIN: Planning with Continuous Linear Numeric Change", "paper_id": "WOS:000304260800001"}