{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "on-line_social_networks"}, {"score": 0.0046394362688524475, "phrase": "message_diffusion_process"}, {"score": 0.0039252049353279556, "phrase": "mean-field_analysis"}, {"score": 0.00379961236486522, "phrase": "diffusion_dynamics"}, {"score": 0.003712362078915926, "phrase": "large_n"}, {"score": 0.00321425262806329, "phrase": "threshold_theorems"}, {"score": 0.0029152570900178956, "phrase": "competing_message_streams"}, {"score": 0.002795762692061496, "phrase": "higher_threshold"}, {"score": 0.0025474193855847074, "phrase": "low_incidence"}, {"score": 0.002523828967909659, "phrase": "viral_messages"}, {"score": 0.002420339995088838, "phrase": "numerical_results"}, {"score": 0.0021848422732893926, "phrase": "successful_information_campaigns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["On-line social networks", " Diffusion models", " Threshold theorems"], "paper_abstract": "In this paper we investigate the message diffusion process in on-line social networks (OSNs) with the aim to understand how and why some messages become viral. We model peculiarities of messaging in OSNs, in particular, information aging and competing message streams. We present a mean-field analysis that gives an approximation to the diffusion dynamics in the limit of large N (the number of participants in an OSN). This approach allows us to precisely define the outbreak of a message and derive conditions for it. Our main results are threshold theorems, which imply that a message becomes viral if a certain threshold is crossed. The results show that owing to competing message streams, a message is required to cross a higher threshold in order to become viral. This, we believe, may be one of the reasons for the low incidence of viral messages in these networks. We provide simulation and numerical results to support our analyses. We also investigate the role of various factors which come into play and derive some insights for launching successful information campaigns on OSNs. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the diffusion of messages in on-line social networks", "paper_id": "WOS:000316532500002"}