{"auto_keywords": [{"score": 0.014104346263115238, "phrase": "content-based_method"}, {"score": 0.00942188691532513, "phrase": "time-based_method"}, {"score": 0.008713768692145006, "phrase": "session_analysis"}, {"score": 0.008479256619862785, "phrase": "professional_social_network"}, {"score": 0.004122604238556912, "phrase": "session_identification"}, {"score": 0.0039027036493682887, "phrase": "previous_research"}, {"score": 0.003832031470970347, "phrase": "identification_performance"}, {"score": 0.0033872210664940817, "phrase": "underlying_rationale"}, {"score": 0.003119659433566212, "phrase": "excellent_identification_performance"}, {"score": 0.0028470123663391126, "phrase": "extremely_low_computation_costs"}, {"score": 0.0022649119108225564, "phrase": "identified_sessions"}, {"score": 0.0021834945657804193, "phrase": "corresponding_ones"}, {"score": 0.002163600705898299, "phrase": "general_web_search"}, {"score": 0.0021049977753042253, "phrase": "profession-oriented_characteristics"}], "paper_keywords": ["query processing", " information processing", " searching"], "paper_abstract": "We perform session analysis for our domain of people search within a professional social network. We find that the content-based method is appropriate to serve as a basis for the session identification in our domain. However, there remain some problems reported in previous research which degrade the identification performance (such as accuracy) of the content-based method. Therefore, in this article, we propose two important refinements to address these problems. We describe the underlying rationale of our refinements and then empirically show that the content-based method equipped with our refinements is able to achieve an excellent identification performance in our domain (such as 99.820% accuracy and 99.707% F-measure in our experiments). Next, because the time-based method has extremely low computation costs, which makes it suitable for many real-world applications, we investigate the feasibility of the time-based method in our domain by evaluating its identification performance based on our refined content-based method. Our experiments demonstrate that the performance of the time-based method is potentially acceptable to many real applications in our domain. Finally, we analyze several features of the identified sessions in our domain and compare them with the corresponding ones in general web search. The results illustrate the profession-oriented characteristics of our domain.", "paper_title": "Session analysis of people search within a professional social network", "paper_id": "WOS:000325930600005"}