{"auto_keywords": [{"score": 0.03330821670244104, "phrase": "ts"}, {"score": 0.015719332077847425, "phrase": "differential_evolution"}, {"score": 0.004641770842098217, "phrase": "job-shop_scheduling_problems"}, {"score": 0.004585433265422727, "phrase": "job-shop_scheduling_problem"}, {"score": 0.0044747919503484055, "phrase": "considerable_interest"}, {"score": 0.004158563941891469, "phrase": "good_performances"}, {"score": 0.004108066884382925, "phrase": "local_search_procedures"}, {"score": 0.004041688859434719, "phrase": "nowicki"}, {"score": 0.004008897491380646, "phrase": "smutnicki"}, {"score": 0.0036652492107503956, "phrase": "evolutionary_algorithm"}, {"score": 0.0035189057079817285, "phrase": "continuous_optimization"}, {"score": 0.00335095982979018, "phrase": "permutation_problems"}, {"score": 0.0031780228058373235, "phrase": "tabu_search"}, {"score": 0.0030635374056374016, "phrase": "jssp._a_competitive_neighborhood"}, {"score": 0.0027666443986705453, "phrase": "main_strengths"}, {"score": 0.0025499307228648883, "phrase": "computational_experiments"}, {"score": 0.0024781515864648242, "phrase": "proposed_hybrid_de-ts_algorithm"}, {"score": 0.00221063611719246, "phrase": "solution_representation_modes"}], "paper_keywords": ["Job-Shop Scheduling", " Differential Evolution", " Tabu Search"], "paper_abstract": "The Job-Shop Scheduling Problem (JSSP) has drawn considerable interest during the last decades, mainly because of its combinatorial characteristics, which make it very difficult to solve. The good performances attained by local search procedures, and especially Nowicki and Smutnicki's i-TSAB algorithm, encouraged researchers to combine such local search engines with global methods. Differential Evolution (DE) is an Evolutionary Algorithm that has been found to be particularly efficient for continuous optimization, but which does not usually perform well when applied to permutation problems. We introduce in this paper the idea of hybridizing DE with Tabu Search (TS) in order to solve the JSSP. A competitive neighborhood is included within the TS with the aim of determining if DE is able to replace the re-start features that constitute the main strengths of i-TSAB (i.e., a long-term memory and a path-relinking procedure). The computational experiments reported for more than 100 JSSP instances show that the proposed hybrid DE-TS algorithm is competitive with respect to other state-of-the-art techniques, although, there is still room for improvement if the adequacy between the solution representation modes within DE and TS is properly stressed. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "A hybrid Differential Evolution-Tabu Search algorithm for the solution of Job-Shop Scheduling Problems", "paper_id": "WOS:000311506900039"}