{"auto_keywords": [{"score": 0.010023459164442661, "phrase": "social_interactivity"}, {"score": 0.004815053458744014, "phrase": "usability"}, {"score": 0.004752954376588157, "phrase": "online_communities"}, {"score": 0.004571692719970733, "phrase": "chief_objective"}, {"score": 0.004469151810727749, "phrase": "knowledge_sharing"}, {"score": 0.004312622975366676, "phrase": "discussion_forums"}, {"score": 0.004175066536037121, "phrase": "ongoing_participation"}, {"score": 0.00397688190820577, "phrase": "large_number"}, {"score": 0.003643470150731877, "phrase": "previous_research"}, {"score": 0.0035616743422949766, "phrase": "different_antecedents"}, {"score": 0.003459191419478298, "phrase": "socio-technical_perspective"}, {"score": 0.00342568771304873, "phrase": "online_community"}, {"score": 0.0032418515965728775, "phrase": "multi-dimensional_constructs"}, {"score": 0.003210446135114967, "phrase": "individual's_perceptions"}, {"score": 0.002969879184298794, "phrase": "different_importance"}, {"score": 0.0028379381771661116, "phrase": "research_model"}, {"score": 0.0027472888482450776, "phrase": "learning-focused_community_system"}, {"score": 0.002608218347502229, "phrase": "identified_dimensions"}, {"score": 0.002492304461447016, "phrase": "system_reliability"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Online communities", " Usability", " Sociability", " Knowledge seeking", " Knowledge contribution", " Measurement invariance"], "paper_abstract": "The chief objective in many online communities is to allow for knowledge sharing and learning, which is enabled by technologies such as discussion forums. The value realized from these communities depends on ongoing participation in terms of two key activities i.e., knowledge seeking and contribution. However, a large number of communities fail, as they cannot sustain these activities. This poses the question of how these two activities can be simultaneously promoted. While previous research has separately explicated a number of different antecedents for the two activities, this study adopts a socio-technical perspective of an online community and considers usability and sociability as two salient antecedents applicable to both activities. Usability and sociability are multi-dimensional constructs, where individual's perceptions of the two may be determined by dimensions such as ease of use and social interactivity. This paper proposes that individuals may place different importance on these dimensions when seeking knowledge, compared to contributing knowledge. The research model is tested through a survey of users of a learning-focused community system. Our findings indicate that individuals do, indeed, differ in their emphasis on the identified dimensions when they engage in the two activities. Specifically, ease of use and system reliability are considered as more important for usability, and moderator perception as more important for sociability when individuals seek knowledge. On the other hand, individuals perceive tracking fulfillment as more important for usability and social interactivity as more important for sociability when they contribute knowledge. These differences have implications for future research and practice.", "paper_title": "Usability and Sociability in Online Communities: A Comparative Study of Knowledge Seeking and Contribution", "paper_id": "WOS:000273383700002"}