{"auto_keywords": [{"score": 0.004644146045859622, "phrase": "gnss_traces"}, {"score": 0.004581660953729745, "phrase": "cartographic_methods"}, {"score": 0.004300951511110487, "phrase": "nowadays_collaborative_cartography"}, {"score": 0.003841610436545169, "phrase": "collaborative_cartography"}, {"score": 0.003638823482920949, "phrase": "general_interest"}, {"score": 0.0033393377529146893, "phrase": "low_accuracy_gps"}, {"score": 0.0031062822219953524, "phrase": "different_dates"}, {"score": 0.0028248293967214947, "phrase": "discrete_frechet_distance"}, {"score": 0.002699889709390707, "phrase": "farthest_neighbors"}, {"score": 0.002488724764295623, "phrase": "b-spline_fitting_procedure"}, {"score": 0.0023044434462692483, "phrase": "ideal_measurements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Geographic information", " Roads determination", " Frechet distance", " Homologous points", " B-spline fitting"], "paper_abstract": "Traditionally cartographic methods (i.e. photogrammetry) have been the way to data capture, but nowadays collaborative cartography deserves attention since everybody can edit and share its own data coming from GPS or similar. So a method to improve the precision of the collaborative cartography, particularly terrestrial transportation ways, has become useful and of general interest. In our study we use some polygonals in X, Y, Z coordinates which people capture with low accuracy GPS bring in their automobiles. For the same road we can have hundreds of traces coming from different dates and people. We aim to improve the accuracy computing a sort of mean of all the traces by using two different methods (discrete Frechet distance is implemented starting with both the nearest and the farthest neighbors). After each solution is computed, a comparative between them is analyzed by using a B-Spline fitting procedure. The developed method to compare our two solutions can be also applied between these solutions and some ideal measurements. (C) 2015 International Association for Mathematics and Computers in Simulation (IMACS). Published by Elsevier B.V. All rights reserved.", "paper_title": "A new iterative algorithm for creating a mean 3D axis of a road from a set of GNSS traces", "paper_id": "WOS:000361584600026"}