{"auto_keywords": [{"score": 0.04985729756574584, "phrase": "supernova_factory"}, {"score": 0.04841059819520943, "phrase": "universe"}, {"score": 0.03152745009222186, "phrase": "cloud_computing"}, {"score": 0.004764004403553372, "phrase": "amazon_aws_cloud"}, {"score": 0.004075596668736259, "phrase": "mysterious_new_physics"}, {"score": 0.004032441847334232, "phrase": "dark_energy"}, {"score": 0.003975609222669783, "phrase": "revolutionary_discovery"}, {"score": 0.003864326375679274, "phrase": "nearby_type_ia_supernovae"}, {"score": 0.003437154518139677, "phrase": "nearby_events"}, {"score": 0.003247319029344241, "phrase": "complex_pipeline"}, {"score": 0.003224336566887827, "phrase": "serial_processes"}, {"score": 0.003013931023579108, "phrase": "local_cluster"}, {"score": 0.0029190995437264377, "phrase": "berkeley_view"}, {"score": 0.0028172167834968477, "phrase": "university_of_california"}, {"score": 0.0026333078412549807, "phrase": "software_environment"}, {"score": 0.002532359001507531, "phrase": "developed_science_pipeline"}, {"score": 0.0024094425220967273, "phrase": "snfactory_pipeline"}, {"score": 0.0023838876943453515, "phrase": "amazon_web_services_environment"}, {"score": 0.002268161377269513, "phrase": "virtual_cluster"}, {"score": 0.0021967433763351884, "phrase": "application_data_placement"}, {"score": 0.0021657265492371976, "phrase": "detailed_performance_results"}], "paper_keywords": ["Cloud computing", " AWS cloud", " Supernova factory"], "paper_abstract": "Today, our picture of the Universe radically differs from that of just over a decade ago. We now know that the Universe is not only expanding as Hubble discovered in 1929, but that the rate of expansion is accelerating, propelled by mysterious new physics dubbed \"Dark Energy\". This revolutionary discovery was made by comparing the brightness of nearby Type Ia supernovae (which exploded in the past billion years) to that of much more distant ones (from up to seven billion years ago). The reliability of this comparison hinges upon a very detailed understanding of the physics of the nearby events. To further this understanding, the Nearby Supernova Factory (SNfactory) relies upon a complex pipeline of serial processes that execute various image processing algorithms in parallel on similar to 10 TBs of data. This pipeline traditionally runs on a local cluster. Cloud computing [ Above the clouds: a Berkeley view of cloud computing, Technical Report UCB/EECS-2009-28, University of California, 2009] offers many features that make it an attractive alternative. The ability to completely control the software environment in a cloud is appealing when dealing with a community developed science pipeline with many unique library and platform requirements. In this context we study the feasibility of porting the SNfactory pipeline to the Amazon Web Services environment. Specifically we: describe the tool set we developed to manage a virtual cluster on Amazon EC2, explore the various design options available for application data placement, and offer detailed performance results and lessons learned from each of the above design options.", "paper_title": "Performance and cost analysis of the Supernova factory on the Amazon AWS cloud", "paper_id": "WOS:000293453800004"}