{"auto_keywords": [{"score": 0.04794745553316023, "phrase": "track_correlation"}, {"score": 0.014667499720165926, "phrase": "grey_incidence_analysis"}, {"score": 0.014266315396748936, "phrase": "line_segment_hausdorff_distance"}, {"score": 0.008767169424212773, "phrase": "correlation_degree"}, {"score": 0.00481495049065317, "phrase": "grey_system_theory"}, {"score": 0.004649302313891199, "phrase": "efficient_algorithm"}, {"score": 0.004259582098193949, "phrase": "line_segment"}, {"score": 0.004069963083642548, "phrase": "line_segment_sets"}, {"score": 0.003971367134498762, "phrase": "face_recognition"}, {"score": 0.003943636379643578, "phrase": "good_results"}, {"score": 0.0038751504050385183, "phrase": "grey_incidence"}, {"score": 0.0035750641312373202, "phrase": "grey_incidence_matrix"}, {"score": 0.0034884152484429207, "phrase": "azimuth_information"}, {"score": 0.0034398445347109396, "phrase": "sensors_track_correlation"}, {"score": 0.0030747771905143273, "phrase": "last_part"}, {"score": 0.003042599375218838, "phrase": "paper_simulation_experiment"}, {"score": 0.0025892330566358503, "phrase": "intensive_targets"}, {"score": 0.002405309378904663, "phrase": "different_sensors"}], "paper_keywords": ["Track correlation", " Grey incidence analysis", " Multi-sensor", " Diagnosis", " Hausdorff distance", " Sensors", " Simulation"], "paper_abstract": "Purpose - The paper attempts to design an efficient algorithm for bearing track correlation of multi-sensor on the same platform using grey incidence analysis which is on the basis of the line segment Hausdorff distance. Design/methodology/approach - Starting from the line segment, Hausdorff distance that has been extended to calculate the distance between line segment sets by many scholars has been used for face recognition achieving good results. The degree of grey incidence is defined based on the above distance and properties which include normality, symmetry and closeness, are proved. Furthermore, a grey incidence matrix is built. With only the azimuth information detected by bearing sensors track correlation is difficult to judge, however grey incidence analysis can quickly and accurately determine whether two tracks are from the same target, and so an algorithm is designed to solve this dilemma. In the last part of the paper simulation experiment is conducted. Findings - The results are convincing: not only the algorithm proposed in the paper can solve the problem of track correlation of bearing-only sensors, but also the algorithm can judge the correlation degree of both tracks even in the case of intensive targets. Practical implications - The method exposed in the paper can be used to judge correlation degree of tracks detected by different sensors even for less information, and also be used to determine the similarity of two waveforms in the field of engineering. Originality/value - The paper succeeds in introducing the line segment Hausdorff distance into grey incidence analysis and on the basis of that an algorithm is designed to solve the problem of track correlation.", "paper_title": "Correlation analysis of bearing track using grey system theory", "paper_id": "WOS:000311266900012"}