{"auto_keywords": [{"score": 0.04830236777788389, "phrase": "radial_distortion"}, {"score": 0.010612387000973441, "phrase": "good_circular_arcs"}, {"score": 0.004686688155058031, "phrase": "common_problem"}, {"score": 0.004440277230269978, "phrase": "especially_those_low-cost_ones"}, {"score": 0.003775803846431323, "phrase": "straight_line"}, {"score": 0.0035965032173588753, "phrase": "ideal_image"}, {"score": 0.0035386420095120706, "phrase": "pin-hole_camera_model"}, {"score": 0.003370565320453525, "phrase": "new_line-based_approach"}, {"score": 0.002944284514509205, "phrase": "real_world_project"}, {"score": 0.0028502479839354637, "phrase": "single_parameter_division_model"}, {"score": 0.0027741761880779535, "phrase": "former_line-based_methods"}, {"score": 0.002685558057339722, "phrase": "paper_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Radial distortion", " Division model", " Circle fitting", " Good circular arcs"], "paper_abstract": "It is a common problem, radial distortion of off-the-shelf cameras, especially those low-cost ones and wide-angle ones. And the most direct method to judge whether radial distortion occurs in an image is the straightness of those lines in the image, for the straight line in the image should be straight in the ideal image under the pin-hole camera model. In this paper, we present a new line-based approach to eliminate the radial distortion which makes the line distorted in the image. It is based on the fact the straight lines in the real world project to circular arcs under the single parameter division model. Compared with those former line-based methods, the method in this paper work well and be easy to find the good circular arcs, which is valid to eliminate the interference of other curves. Experiments are provided for both synthetic and real images and the results show that our method can remove the radial distortion from images validly and robustly. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "DMS2015short-21: Robust radial distortion estimation using good circular arcs", "paper_id": "WOS:000366782000013"}