{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cloud_computing"}, {"score": 0.004456044928556639, "phrase": "computing_activities"}, {"score": 0.004413096646892175, "phrase": "numerous_promising_technological_and_economic_opportunities"}, {"score": 0.004123781267600542, "phrase": "cloud_security"}, {"score": 0.003853359519337239, "phrase": "virtual_wall"}, {"score": 0.003742941972172613, "phrase": "digital_investigations"}, {"score": 0.0036592457471262894, "phrase": "data_duplication"}, {"score": 0.003612259264584205, "phrase": "cloud_platform"}, {"score": 0.0034748763852150465, "phrase": "suspected_or_compromised_targets"}, {"score": 0.0033861930947608207, "phrase": "existing_approaches"}, {"score": 0.0032155369606336206, "phrase": "unrestricted_access"}, {"score": 0.0031845067058084583, "phrase": "relevant_system"}, {"score": 0.003163985877966426, "phrase": "user_data"}, {"score": 0.0029754949467239887, "phrase": "forensic_challenges"}, {"score": 0.0028438099634371886, "phrase": "existing_surveys"}, {"score": 0.002709161672473817, "phrase": "traditional_digital_forensics"}, {"score": 0.002622947550220266, "phrase": "digital_forensic_process"}, {"score": 0.0024191966390855048, "phrase": "non-cloud_and_cloud_digital_forensics"}, {"score": 0.0022897425998475362, "phrase": "cloud_environment"}, {"score": 0.0022096849931961247, "phrase": "cloud_forensics"}, {"score": 0.0021742244283295986, "phrase": "national_institute_of_standards"}, {"score": 0.0021462777256456554, "phrase": "amazon"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cloud computing", " Cloud forensics", " Cloud service provider", " Cloud customer", " Digital forensics", " Digital evidence", " Service level agreement", " Amazon EC2"], "paper_abstract": "Cloud computing is arguably one of the most significant advances in information technology (IT) services today. Several cloud service providers (CSPs) have offered services that have produced various transformative changes in computing activities and presented numerous promising technological and economic opportunities. However, many cloud customers remain reluctant to move their IT needs to the cloud, mainly due to their concerns on cloud security and the threat of the unknown. The CSPs indirectly escalate their concerns by not letting customers see what is behind virtual wall of their clouds that, among others, hinders digital investigations. In addition, jurisdiction, data duplication and multi-tenancy in cloud platform add to the challenge of locating, identifying and separating the suspected or compromised targets for digital forensics. Unfortunately, the existing approaches to evidence collection and recovery in a non-cloud (traditional) system are not practical as they rely on unrestricted access to the relevant system and user data; something that is not available in the cloud due its decentralized data processing. In this paper we systematically survey the forensic challenges in cloud computing and analyze their most recent solutions and developments. In particular, unlike the existing surveys on the topic, we describe the issues in cloud computing using the phases of traditional digital forensics as the base. For each phase of the digital forensic process, we have included a list of challenges and analysis of their possible solutions. Our description helps identifying the differences between the problems and solutions for non-cloud and cloud digital forensics. Further, the presentation is expected to help the investigators better understand the problems in cloud environment. More importantly, the paper also includes most recent development in cloud forensics produced by researchers, National Institute of Standards and Technology and Amazon. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Cloud forensics: Technical challenges, solutions and comparative analysis", "paper_id": "WOS:000356057200005"}