{"auto_keywords": [{"score": 0.031327039112783714, "phrase": "lda"}, {"score": 0.00481495049065317, "phrase": "normalized_mutual_information"}, {"score": 0.004621447740470602, "phrase": "novel_feature_selection_method"}, {"score": 0.0044356867986444426, "phrase": "well-known_mutual_information_measurement"}, {"score": 0.004183137595671171, "phrase": "existing_approach"}, {"score": 0.003742084495435749, "phrase": "mutual_information"}, {"score": 0.0032697235411641695, "phrase": "commonly_used_recognition_models"}, {"score": 0.0032315723330399375, "phrase": "support_vector_machine"}, {"score": 0.002994178996584381, "phrase": "linear_discriminant_analysis"}, {"score": 0.0024667783849055634, "phrase": "data-specific_statements"}, {"score": 0.002339771435910601, "phrase": "uci_machine"}, {"score": 0.0021049977753042253, "phrase": "classification_accuracy"}], "paper_keywords": ["Feature selection", " Mutual information", " Minimal redundancy", " Maximal relevance"], "paper_abstract": "In this paper, a novel feature selection method based on the normalization of the well-known mutual information measurement is presented. Our method is derived from an existing approach, the max-relevance and min-redundancy (mRMR) approach. We, however, propose to normalize the mutual information used in the method so that the domination of the relevance or of the redundancy can be eliminated. We borrow some commonly used recognition models including Support Vector Machine (SVM), k-Nearest-Neighbor (kNN), and Linear Discriminant Analysis (LDA) to compare our algorithm with the original (mRMR) and a recently improved version of the mRMR, the Normalized Mutual Information Feature Selection (NMIFS) algorithm. To avoid data-specific statements, we conduct our classification experiments using various datasets from the UCI machine learning repository. The results confirm that our feature selection method is more robust than the others with regard to classification accuracy.", "paper_title": "A novel feature selection method based on normalized mutual information", "paper_id": "WOS:000305396200007"}