{"auto_keywords": [{"score": 0.006410982402519154, "phrase": "digital_environment"}, {"score": 0.005911101288919318, "phrase": "information-seeking_activities"}, {"score": 0.005888818288308272, "phrase": "information-seeking_problems"}, {"score": 0.0047247764275344245, "phrase": "purpose_-_the_purpose"}, {"score": 0.0045926573094411645, "phrase": "knowledge_gap"}, {"score": 0.004343891422096849, "phrase": "search_process"}, {"score": 0.004274184834062827, "phrase": "quantitative_and_qualitative_studies"}, {"score": 0.004194095512253246, "phrase": "higher_education_sector"}, {"score": 0.004061358721727931, "phrase": "correlation_analysis"}, {"score": 0.003859088869420924, "phrase": "different_stages"}, {"score": 0.0036391998521585777, "phrase": "successive_search_sessions"}, {"score": 0.0035845101417046415, "phrase": "new_model"}, {"score": 0.0035306393931003937, "phrase": "proposed_model"}, {"score": 0.0034841647157189985, "phrase": "better_understanding"}, {"score": 0.0033420335728415653, "phrase": "systems_design"}, {"score": 0.003266958560622792, "phrase": "negative_impact"}, {"score": 0.0031814930955904592, "phrase": "positive_aspects"}, {"score": 0.0031395998366532747, "phrase": "general_consensus"}, {"score": 0.0031041292992126665, "phrase": "mental_state"}, {"score": 0.002988754460079807, "phrase": "relevant_information"}, {"score": 0.0028831113660064225, "phrase": "present_study"}, {"score": 0.002642509764635509, "phrase": "initial_information"}, {"score": 0.002563604927614964, "phrase": "relevant_systems"}, {"score": 0.002232394392500392, "phrase": "information_search_process"}, {"score": 0.002224031397416544, "phrase": "wilson"}, {"score": 0.0021780592308757586, "phrase": "varying_degrees"}, {"score": 0.002145280189428436, "phrase": "information_search"}, {"score": 0.00213716263548432, "phrase": "retrieval_process"}, {"score": 0.0021049977753042253, "phrase": "different_information-seeking_behaviours"}], "paper_keywords": ["Uncertainty", " Information seeking and retrieval", " Information seeking model", " IS&R", " Uncertainty model"], "paper_abstract": "Purpose - The purpose of this paper is to show that uncertaintymay be caused not only by a knowledge gap in the mind of a user with respect to a given subject or topic, but also by the various complexities associated with the information seeking and retrieval (IS&R) process in a digital environment. Design/methodology/approach - Both quantitative and qualitative studies were conducted to collect data from users in the higher education sector regarding whether or not they experienced uncertainty in relation to the IS&R process. Analysis: a correlation analysis was undertaken to establish whether there were any relationships between information-seeking activities and information-seeking problems. Findings - The findings of this research show that uncertainty existed at different stages of the IS&R process amongst users. It was established that uncertainty was caused by a number of information-seeking activities and information-seeking problems, and that such uncertainty could continue over the course of successive search sessions, leading to the proposal of a new model of uncertainty. Research limitations/implications - The proposed model of uncertainty should contribute to a better understanding of the issues related to IS&R in a digital environment. Practical implications - A number of benefits could be realised in systems design from the application of this model in terms of reducing the negative impact of uncertainty, while at the same time helping users to gain from the positive aspects of uncertainty in IS&R. Originality/value - The general consensus is that uncertainty is a mental state of users reflecting a gap in knowledge which triggers an IS&R process, and that the gap is reduced as relevant information is found, and thus that the uncertainty disappears as the search process concludes. However, in the present study it is argued that some form of uncertainty is always associated with some part of the IS&R process and that it also fluctuates throughout the IS&R process. Users may therefore feel uncertain at any stage of the IS&R process and this may be related to: the initial information need and expression of that need, the search process itself, including identification of relevant systems, services and resources; and the assessment of, and reaction to, the results produced by the search process. Uncertainty may be unresolved, or even increase, as the user progresses, often iteratively, through the IS&R process and may remain even after its completion, resulting in what may be called a persistent uncertainty. In other words, this research hypothesises that, in addition to the uncertainty that triggers the information search process (Wilson et al., 2000), users suffer from varying degrees of uncertainty at every stage of the information search and retrieval process, and that in turn, triggers different information-seeking behaviours.", "paper_title": "A model of uncertainty and its relation to information seeking and retrieval (IS&R)", "paper_id": "WOS:000341924700006"}