{"auto_keywords": [{"score": 0.04963913874714364, "phrase": "distance_correlation"}, {"score": 0.02791408517466667, "phrase": "proposed_methods"}, {"score": 0.00481495049065317, "phrase": "maximal_correlation"}, {"score": 0.004640398886726948, "phrase": "regression_problems"}, {"score": 0.004597754207658615, "phrase": "first_task"}, {"score": 0.004077616905584829, "phrase": "variable_selection_problems"}, {"score": 0.0040215052006051235, "phrase": "statistical_literature"}, {"score": 0.00398452530840582, "phrase": "numerous_methods"}, {"score": 0.0032515545824588453, "phrase": "renyi"}, {"score": 0.0032066653632708965, "phrase": "dependence_measures"}, {"score": 0.0030759821501544224, "phrase": "nonlinear_dependence_structures"}, {"score": 0.0028698706191651155, "phrase": "nonlinear_regression_models"}, {"score": 0.002498053212249228, "phrase": "akaike_information_criterion"}, {"score": 0.002418453525649304, "phrase": "linear_dependence"}, {"score": 0.0022772782536385717, "phrase": "nonlinear_or_uncorrelated_dependencies"}, {"score": 0.0021049977753042253, "phrase": "real_financial_data_set"}], "paper_keywords": ["distance correlation", " nonlinear regression", " variable selection", " maximal correlation"], "paper_abstract": "In most of the regression problems the first task is to select the most influential predictors explaining the response, and removing the others from the model. These problems are usually referred to as the variable selection problems in the statistical literature. Numerous methods have been proposed in this field, most of which address linear models. In this study we propose two variable selection criteria for regression based on two powerful dependence measures, maximal correlation and distance correlation. We focus on these two measures since they fully or partially satisfy the Renyi postulates for dependence measures, and thus they are able to detect nonlinear dependence structures. Therefore, our methods are considered to be appropriate in linear as well as nonlinear regression models. Both methods are easy to implement and they perform well. We illustrate the performances of the proposed methods via simulations, and compare them with two benchmark methods, stepwise Akaike information criterion and lasso. In several cases with linear dependence all four methods turned out to be comparable. In the presence of nonlinear or uncorrelated dependencies, we observed that our proposed methods may be favourable. An application of the proposed methods to a real financial data set is also provided.", "paper_title": "Variable selection in regression using maximal correlation and distance correlation", "paper_id": "WOS:000349904400014"}