{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_health_records"}, {"score": 0.004761494044422926, "phrase": "ambulatory_physician_performance"}, {"score": 0.004630423009638876, "phrase": "support_staff"}, {"score": 0.00445293569103488, "phrase": "highly_skilled_employees"}, {"score": 0.004403480614319231, "phrase": "substantial_gains"}, {"score": 0.004258372598568333, "phrase": "information_technologies"}, {"score": 0.0036214184763804034, "phrase": "general_internists"}, {"score": 0.003348838095597268, "phrase": "top_performers"}, {"score": 0.0031845067058084583, "phrase": "nurse_practitioners"}, {"score": 0.0031490944606172152, "phrase": "physician_assistants"}, {"score": 0.002276566401216226, "phrase": "national_push"}, {"score": 0.002251227801482381, "phrase": "greater_ehr_adoption"}, {"score": 0.0021049977753042253, "phrase": "ehr_use"}], "paper_keywords": [""], "paper_abstract": "In industries outside healthcare, highly skilled employees enable substantial gains in productivity after adoption of information technologies. The authors explore whether the presence of highly skilled, autonomous clinical support staff is associated with higher performance among physicians with electronic health records (EHRs). Using data from a survey of general internists, the authors assessed whether physicians with EHRs were more likely to be top performers on cost and quality if they worked with nurse practitioners or physician assistants. It was found that, among physicians with EHRs, those with highly skilled, autonomous staff were far more likely to be top performing than those without such staff (OR 7.0, 95% Cl 1.7 to 34.8, p=0.02). This relationship did not hold among physicians without EHRs (OR 1.0). As we begin a national push towards greater EHR adoption, it is critical to understand why some physicians gain from EHR use and others do not.", "paper_title": "Organizational complements to electronic health records in ambulatory physician performance: the role of support staff", "paper_id": "WOS:000306024100009"}