{"auto_keywords": [{"score": 0.030956458222884953, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "fuzzy_owa"}, {"score": 0.004746853072172016, "phrase": "dematel"}, {"score": 0.004548253531664032, "phrase": "risk_priority_number"}, {"score": 0.004116440453049531, "phrase": "traditional_rpn_methodology"}, {"score": 0.0035949949979695063, "phrase": "failure_problems"}, {"score": 0.0032533922820811093, "phrase": "owa"}, {"score": 0.0027610089418453614, "phrase": "traditional_rpn_method"}, {"score": 0.0027025233739857374, "phrase": "numerical_verification"}, {"score": 0.0026452734009203764, "phrase": "failure_mode"}, {"score": 0.0025525334050366926, "phrase": "fmea"}, {"score": 0.0021659920594094407, "phrase": "rpn_numbers"}], "paper_keywords": ["Fuzzy set", " Ordered weighted averaging", " Decision making trial and evaluation laboratory", " Failure mode and effect analysis", " Risk priority number"], "paper_abstract": "Most current risk assessment methods use the risk priority number (RPN) value to evaluate the risk of failure. However, traditional RPN methodology has been criticized to have several shortcomings. Therefore, an efficient, simplified algorithm to evaluate the orderings of risk for failure problems is proposed in this paper, which utilizes fuzzy ordered weighted averaging (OWA) and the decision making trial and evaluation laboratory (DEMATEL) approach to rank the risk of failure. The proposed approach resolves some of the shortcomings of the traditional RPN method. In numerical verification, a failure mode and effects analysis (FMEA) of the thin film transistor liquid crystal display (TFT-LCD) product is presented to further illustrate the proposed approach. The results show that the proposed approach can reduce duplicated RPN numbers and get a more accurate, reasonable risk assessment. As a result, the stability of product and process can be assured.", "paper_title": "Evaluating the risk of failure using the fuzzy OWA and DEMATEL method", "paper_id": "WOS:000288222000001"}