{"auto_keywords": [{"score": 0.04776501880537941, "phrase": "local_terms"}, {"score": 0.008220949445589413, "phrase": "correct_loinc_code"}, {"score": 0.007423893077759183, "phrase": "rich_corpus"}, {"score": 0.005477363039930256, "phrase": "laboratory_terms"}, {"score": 0.00481495049065317, "phrase": "automated_loinc_mapping"}, {"score": 0.004103212598803194, "phrase": "supervised_machine_learning"}, {"score": 0.004041155193307942, "phrase": "apache's_opennlp_maxent"}, {"score": 0.00394981748347167, "phrase": "information_retrieval"}, {"score": 0.0038900709793274484, "phrase": "apache's_lucene"}, {"score": 0.00377326532920359, "phrase": "random_subsampling_method"}, {"score": 0.0032150107187871543, "phrase": "lucene"}, {"score": 0.0029450255269318007, "phrase": "maxent"}, {"score": 0.0027812405653371503, "phrase": "lucene's_performance"}, {"score": 0.0026771333996253783, "phrase": "cut-off_score"}, {"score": 0.0024335561337016174, "phrase": "loinc"}, {"score": 0.0024150528983695446, "phrase": "collective_knowledge"}, {"score": 0.002324620886282579, "phrase": "freely_available_software_tools"}, {"score": 0.0022806798371116698, "phrase": "data-driven_automated_approach"}, {"score": 0.002246124435189668, "phrase": "term_descriptions"}, {"score": 0.002229043128610864, "phrase": "existing_mappings"}, {"score": 0.002186904773823281, "phrase": "accurate_and_efficient_automated_mapping_methods"}, {"score": 0.002129243122440408, "phrase": "vocabulary_standards"}, {"score": 0.0021049977753042253, "phrase": "widespread_health_information"}], "paper_keywords": [""], "paper_abstract": "Objective To determine whether the knowledge contained in a rich corpus of local terms mapped to LOINC (Logical Observation Identifiers Names and Codes) could be leveraged to help map local terms from other institutions. Methods We developed two models to test our hypothesis. The first based on supervised machine learning was created using Apache's OpenNLP Maxent and the second based on information retrieval was created using Apache's Lucene. The models were validated by a random subsampling method that was repeated 20 times and that used 80/20 splits for training and testing, respectively. We also evaluated the performance of these models on all laboratory terms from three test institutions. Results For the 20 iterations used for validation of our 80/20 splits Maxent and Lucene ranked the correct LOINC code first for between 70.5% and 71.4% and between 63.7% and 65.0% of local terms, respectively. For all laboratory terms from the three test institutions Maxent ranked the correct LOINC code first for between 73.5% and 84.6% (mean 78.9%) of local terms, whereas Lucene's performance was between 66.5% and 76.6% (mean 71.9%). Using a cut-off score of 0.46 Maxent always ranked the correct LOINC code first for over 57% of local terms. Conclusions This study showed that a rich corpus of local terms mapped to LOINC contains collective knowledge that can help map terms from other institutions. Using freely available software tools, we developed a data-driven automated approach that operates on term descriptions from existing mappings in the corpus. Accurate and efficient automated mapping methods can help to accelerate adoption of vocabulary standards and promote widespread health information exchange.", "paper_title": "A corpus-based approach for automated LOINC mapping", "paper_id": "WOS:000336716000012"}