{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hidden_tag_problem"}, {"score": 0.03438275554507546, "phrase": "high_identification_rate"}, {"score": 0.004488946121663966, "phrase": "rfid_techniques"}, {"score": 0.004312622975366676, "phrase": "reader's_interrogation_area"}, {"score": 0.004020492138367616, "phrase": "real_practice"}, {"score": 0.003785836059995376, "phrase": "interrogation_range"}, {"score": 0.00354700018079049, "phrase": "multipath_effect"}, {"score": 0.003306559295382181, "phrase": "big_challenge"}, {"score": 0.003097865379563127, "phrase": "empirical_or_measurement-based_methods"}, {"score": 0.0028021527740710508, "phrase": "generic_implementation"}, {"score": 0.002496722870659199, "phrase": "unified_and_measurable_model"}, {"score": 0.0023745087648471613, "phrase": "previous_works"}, {"score": 0.0021049977753042253, "phrase": "rfid_systems"}], "paper_keywords": [""], "paper_abstract": "Radio-frequency identification (RFID) techniques are widely used in many ubiquitous applications. The most important usage of RFID techniques is to read the tags within a reader's interrogation area such that the objects attached with those tags can be identified. In real practice, it is common that a tag is physically in the interrogation range but cannot be read by the reader, due to the multipath effect and other interference. This phenomenon, namely, the hidden tag problem, is a big challenge to achieve high identification rate. To address this problem, most prior works depend on empirical or measurement-based methods to tune the transmission power for readers. Such a case-by-case solution is impractical for generic implementation. In this paper, we theoretically and experimentally explore the reasons why hidden tag problem occurs. To alleviate its impact, we propose a unified and measurable model to formulate this problem and its impact. Different from previous works, our solution is generic and fully compatible with existing EPC C1G2 protocol. The analysis and measurement based on our model can help to design and deploy RFID systems with high identification rate.", "paper_title": "An Empirical Study on Hidden Tag Problem", "paper_id": "WOS:000358209400001"}