{"auto_keywords": [{"score": 0.04958872791995373, "phrase": "africa"}, {"score": 0.04743903474535981, "phrase": "rural_people"}, {"score": 0.00481495049065317, "phrase": "situating_media"}, {"score": 0.004790230103466081, "phrase": "rural_knowledge"}, {"score": 0.004644538007978237, "phrase": "rural_wisdom"}, {"score": 0.004468610388406918, "phrase": "community_cohesion"}, {"score": 0.0044114547518956625, "phrase": "africa's_urbanization"}, {"score": 0.004388796812234033, "phrase": "oral_information"}, {"score": 0.004332657586180943, "phrase": "rural_identity"}, {"score": 0.0040416348762873115, "phrase": "knowledge_traditions"}, {"score": 0.0038884550413416036, "phrase": "users'_locations"}, {"score": 0.003828814886998649, "phrase": "social_networking"}, {"score": 0.0037507098392196617, "phrase": "intriguing_opportunities"}, {"score": 0.0037314328720368453, "phrase": "rural_communities"}, {"score": 0.003562322256892338, "phrase": "herero_tribe"}, {"score": 0.0034627874921249755, "phrase": "namibia"}, {"score": 0.003383364717254709, "phrase": "detailed_analysis"}, {"score": 0.0033143162974997547, "phrase": "rural_participants"}, {"score": 0.0031968441980848436, "phrase": "writing_materials"}, {"score": 0.003091482743000161, "phrase": "observer-and_participant-recorded_video_and_participants'_interpretations"}, {"score": 0.0029589086332593674, "phrase": "verbal_and_bodily_interactions"}, {"score": 0.0027957221876121706, "phrase": "local_experiences"}, {"score": 0.0026965813247045427, "phrase": "locative_media"}, {"score": 0.0025610035410346386, "phrase": "social_relational_and_topokinetic_rather_than_topographic_spaces"}, {"score": 0.002407255910639214, "phrase": "social_relationships"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Traditional Knowledge", " Rural", " Africa", " Spatial", " Temporal", " Locative Media", " Topokinetic", " Topographic"], "paper_abstract": "Designing interactions with technologies that are compatible with rural wisdom and skills can help to digitally enfranchise rural people and, thus, contribute to community cohesion in the face of Africa's urbanization. Oral information has been integral to rural identity and livelihood in Africa for generations. However, the use of technology can inadvertently displace the knowledge of communities with practices that differ from the knowledge traditions in which technology is designed. We propose that devices that are sensitive to users' locations, combined with platforms for social networking and user-generated content, offer intriguing opportunities for rural communities to extend their knowledge practices digitally. In this paper we present insights on the way rural people of the Herero tribe manage information spatially and temporally during some of our design activities in Namibia. We generated these insights from ethnography and detailed analysis of interactions with media in our ongoing Ethnographic Action Research. Rural participants had not depicted their wisdom graphically by photography or video before, rarely use writing materials and some cannot read. Thus, we gathered 30 h of observer-and participant-recorded video and participants' interpretations and interactions with thumbnail photos from video, photography and paper. We describe insights into verbal and bodily interactions and relationships between bodies, movements, settings, knowledge and identity. These findings have made us more sensitive to local experiences of locations and more aware of assumptions about space and time embedded in locative media. As a result, we have started to adopt an approach that emphasizes connectors rather than points and social relational and topokinetic rather than topographic spaces. In the final section of the paper we discuss applying this approach in design by responding to the ways that participants use social relationships to orient information and use voice, gesture and movement to incorporate locations into this \"dialogic\". In conclusion we outline why we hope our reflections will inspire others to examine the spatial, temporal and social affordances of technologies within the bonds of rural, and other, communities. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Pushing personhood into place: Situating media in rural knowledge in Africa", "paper_id": "WOS:000295432100003"}