{"auto_keywords": [{"score": 0.04960770684597511, "phrase": "incomplete_preference_information"}, {"score": 0.00481495049065317, "phrase": "multi-attribute_negotiation"}, {"score": 0.004697308822154191, "phrase": "component-based_generic_agent_architecture"}, {"score": 0.00442651096522781, "phrase": "prototype_system"}, {"score": 0.004130165601475531, "phrase": "dutch_telecom_kpn."}, {"score": 0.003989487818395848, "phrase": "cooperative_one-to-one_multi-criteria_negotiation"}, {"score": 0.0033879628186273625, "phrase": "negotiation_partner"}, {"score": 0.0032402142645120958, "phrase": "reached_agreements"}, {"score": 0.0027650234530228897, "phrase": "opponent's_bids"}, {"score": 0.0026973310437053573, "phrase": "experimental_evaluation"}, {"score": 0.0024793019587009035, "phrase": "pareto-efficient_frontier"}, {"score": 0.002442693254693416, "phrase": "main_original_contribution"}, {"score": 0.0022563636435096457, "phrase": "cooperative_negotiation"}, {"score": 0.0021049977753042253, "phrase": "significant_joint_gains"}], "paper_keywords": ["agent architecture", " bilateral negotiation", " multi-attribute negotiation", " cooperative negotiation", " component-based modeling", " cognitive modeling"], "paper_abstract": "A component-based generic agent architecture for multi-attribute ( integrative) negotiation is introduced and its application is described in a prototype system for negotiation about cars, developed in cooperation with, among others, Dutch Telecom KPN. The approach can be characterized as cooperative one-to-one multi-criteria negotiation in which the privacy of both parties is protected as much as desired. We model a mechanism in which agents are able to use any amount of incomplete preference information revealed by the negotiation partner in order to improve the efficiency of the reached agreements. Moreover, we show that the outcome of such a negotiation can be further improved by incorporating a \"guessing\" heuristic, by which an agent uses the history of the opponent's bids to predict his preferences. Experimental evaluation shows that the combination of these two strategies leads to agreement points close to or on the Pareto-efficient frontier. The main original contribution of this paper is that it shows that it is possible for parties in a cooperative negotiation to reveal only a limited amount of preference information to each other, but still obtain significant joint gains in the outcome.", "paper_title": "An agent architecture for multi-attribute negotiation using incomplete preference information", "paper_id": "WOS:000248894000004"}