{"auto_keywords": [{"score": 0.005787916204231766, "phrase": "streaming_performance"}, {"score": 0.004430452655732319, "phrase": "traditional_internet_streaming_service"}, {"score": 0.004149922666541166, "phrase": "distribute_video_content"}, {"score": 0.004076533120753605, "phrase": "large_amount"}, {"score": 0.0038411109150557504, "phrase": "locality-based_peer_selection_mechanisms"}, {"score": 0.002921114512115261, "phrase": "rate_allocation_mechanism"}, {"score": 0.002608583927848071, "phrase": "multiobjective_optimization_problem"}, {"score": 0.002472412920623605, "phrase": "evaluation_result"}, {"score": 0.0022610379771517966, "phrase": "good_fairness"}, {"score": 0.002181626277903721, "phrase": "streaming_overlays"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-assisted video-on-demand streaming", " Cross-ISP P2P traffic", " Media server load", " Goal Attainment method"], "paper_abstract": "Peer-to-peer (P2P) technology greatly scales up traditional Internet streaming service. However, the philosophy that peers help one another distribute video content produces a large amount of cross-ISP P2P traffic. Newly proposed ISP-friendly P2P mechanisms reduce the cross-ISP P2P traffic by using locality-based peer selection mechanisms, in which the peers tend to connect to other peers in the same ISP domain. However, one unanswered question is how can we achieve the tradeoffs between the cross-ISP P2P traffic and the P2P streaming performance if there are conflicts between them. In this paper, we propose a rate allocation mechanism for achieving the tradeoffs between the cross-ISP P2P traffic and the P2P streaming performance. We model the tradeoffs as a multiobjective optimization problem and solve it using the Goal Attainment method. The evaluation result shows that our mechanism is able to achieve the tradeoffs between the conflicts and maintain good fairness among the peers and the streaming overlays. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On tradeoffs between cross-ISP P2P traffic and P2P streaming performance", "paper_id": "WOS:000297875700005"}