{"auto_keywords": [{"score": 0.04569879800147235, "phrase": "trubal"}, {"score": 0.008814919848481472, "phrase": "computational_time"}, {"score": 0.004815133528682739, "phrase": "gpu"}, {"score": 0.004610058444728656, "phrase": "die_filling"}, {"score": 0.00443308765153716, "phrase": "discrete_element"}, {"score": 0.004244375827831527, "phrase": "cpu-gpu_heterogeneous_architecture"}, {"score": 0.004189337956225294, "phrase": "two-_and_three-dimensional_cases"}, {"score": 0.003958937342925219, "phrase": "theoretical_contact_mechanics"}, {"score": 0.0038906171474520756, "phrase": "direct_use"}, {"score": 0.0038568987435766014, "phrase": "real_physical_material_properties"}, {"score": 0.0036288825833675127, "phrase": "static_storage_structure"}, {"score": 0.003535320700255283, "phrase": "relative_newer_version_code"}, {"score": 0.00326881479036966, "phrase": "moving_shoe"}, {"score": 0.003062091606343783, "phrase": "intel_core-duo"}, {"score": 0.002918826667294298, "phrase": "intel_xeon"}, {"score": 0.0022180544041790697, "phrase": "final_version_parallel_code"}, {"score": 0.0021892345747666977, "phrase": "substantial_acceleration"}, {"score": 0.0021607883988873492, "phrase": "original_trubal"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["GPU", " Discrete Element Method", " CPU-GPU heterogeneous architecture", " Die filling"], "paper_abstract": "In this study, parallelization of a Discrete Element Method (DEM) code titled Trubal was carried out based on the CPU-GPU heterogeneous architecture where both two- and three-dimensional cases were assessed. In Trubal, the particle-particle/wall interaction rules are governed by the theoretical contact mechanics which enable the direct use of real physical material properties in the calculation. We reconstructed Trubal in two steps: reconstruction of the static storage structure; essential parallelism on the relative newer version code. Numerical simulations were implemented to present the benefits of this research. Firstly, two simulations of die filling with a moving shoe involving 6000 and 60,000 two-dimensional particles were conducted under (i) NVIDIA Tesla C2050 card together with Intel Core-Duo 2.93 GHz CPU and (ii) NVIDIA Tesla K40c card along with Intel Xeon 3.00 GHz CPU. Average speedups of (i) 4.69 and 12.78 as well as (ii) 6.52 and 18.60 in computational time were obtained, respectively. Then, a simulation of die filling with a stationary shoe containing 20,000 three-dimensional particles was carried out under the same conditions where average speedups of (i) 12.90 and (ii) 19.66 in computational time were obtained, respectively. It is shown that the final version parallel code gave a substantial acceleration on the original Trubal. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A GPU-based discrete element modeling code and its application in die filling", "paper_id": "WOS:000350535100025"}