{"auto_keywords": [{"score": 0.04412469500707909, "phrase": "molecular_docking"}, {"score": 0.04387075461973788, "phrase": "pharmacophore_mapping"}, {"score": 0.019920276512276396, "phrase": "potential_inhibitors"}, {"score": 0.00903057283622597, "phrase": "tcm"}, {"score": 0.00884338917258717, "phrase": "compound_target_interaction_network"}, {"score": 0.007523216503765076, "phrase": "bayesian_classifiers"}, {"score": 0.0065739195468988865, "phrase": "predicted_inhibitors"}, {"score": 0.00481495049065317, "phrase": "compound-target_interaction_network"}, {"score": 0.00477179293077195, "phrase": "chinese"}, {"score": 0.0047289360793096044, "phrase": "type_ii_diabetes"}, {"score": 0.004466519142879166, "phrase": "action_mechanism"}, {"score": 0.004439753960631346, "phrase": "traditional_chinese_medicines"}, {"score": 0.004360412703519539, "phrase": "clinical_efficacy"}, {"score": 0.004334280585565239, "phrase": "type_ii_diabetes_mellitus"}, {"score": 0.004256816146106783, "phrase": "integrated_protocol"}, {"score": 0.003948613642680196, "phrase": "prediction_capabilities"}, {"score": 0.003662643573658492, "phrase": "satisfactory_predictions"}, {"score": 0.0035328029694928296, "phrase": "prediction_accuracies"}, {"score": 0.003459191419478298, "phrase": "different_targets"}, {"score": 0.003267003547703286, "phrase": "well-validated_bayesian_classifiers"}, {"score": 0.003066945490483524, "phrase": "compound_target_network"}, {"score": 0.003030247482854539, "phrase": "small_portion"}, {"score": 0.0029139757013408926, "phrase": "pharmacological_activities"}, {"score": 0.002702733794508487, "phrase": "considerable_number"}, {"score": 0.002678433668156676, "phrase": "predicted_multitarget_inhibitors"}, {"score": 0.0025678829712650437, "phrase": "pharmacological_effect"}, {"score": 0.0025447921872619435, "phrase": "tcm_formulas"}, {"score": 0.002262802370005939, "phrase": "deep_insight"}, {"score": 0.0022155944576897862, "phrase": "classical_tcm_formulas"}, {"score": 0.002124106476971252, "phrase": "good_source"}, {"score": 0.0021049977753042253, "phrase": "new_lead_compounds"}], "paper_keywords": [""], "paper_abstract": "In this study, in order to elucidate the action mechanism of traditional Chinese medicines (TCMs) that exhibit clinical efficacy for type II diabetes mellitus (T2DM), an integrated protocol that combines molecular docking and pharmacophore mapping was employed to find the potential inhibitors from TCM for the T2DM-related targets and establish the compound target interaction network. First, the prediction capabilities of molecular docking and pharmacophore mapping to distinguish inhibitors from noninhibitors for the selected T2DM-related targets were evaluated. The results show that molecular docking or pharmacophore mapping can give satisfactory predictions for most targets but the validations are still quite necessary because the prediction accuracies of these two methods are variable across different targets. Then, the Bayesian classifiers by integrating the predictions from molecular docking and pharmacophore mapping were developed, and the well-validated Bayesian classifiers for 15 targets were utilized to find the potential inhibitors from TCM and establish the compound target interaction network. The analysis of the compound target network demonstrates that a small portion (18.6%) of the predicted inhibitors can interact with multitargets. The pharmacological activities for some potential inhibitors have been experimentally confirmed, highlighting the reliability of the Bayesian classifiers. Besides, it is interesting to find that a considerable number of the predicted multitarget inhibitors have free radical scavenging/antioxidant activities, which are closely related to T2DM. It appears that the pharmacological effect of the TCM formulas is determined not only by the compounds that interact directly with one or more T2DM-related targets, but also by the compounds with other supplementary bioactivities important for relieving T2DM, such as free radical scavenging/antioxidant effects. The mechanism uncovered by this study may offer a deep insight for understanding the theory of the classical TCM formulas for combating T2DM. Moreover, the predicted inhibitors for the T2DM-related targets may provide a good source to find new lead compounds against T2DM.", "paper_title": "Modeling Compound-Target Interaction Network of Traditional Chinese Medicines for Type II Diabetes Mellitus: Insight for Polypharmacology and Drug Design", "paper_id": "WOS:000322345400022"}