{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "cancer_classification"}, {"score": 0.015719716506582538, "phrase": "marker_genes"}, {"score": 0.015458405179271837, "phrase": "supervised_weighted_kernel_clustering"}, {"score": 0.01526523201371504, "phrase": "support_vector_machine"}, {"score": 0.00459568664065473, "phrase": "recent_interest"}, {"score": 0.004499334809770281, "phrase": "dna_microarray_data"}, {"score": 0.004461359547152617, "phrase": "new_methods"}, {"score": 0.004276216827737399, "phrase": "statistical_classification"}, {"score": 0.004133627071344356, "phrase": "gene_expression_profile"}, {"score": 0.004098725744818192, "phrase": "existing_data"}, {"score": 0.0039119492240482, "phrase": "relevant_diagnostic_category"}, {"score": 0.0034154440860550564, "phrase": "novel_algorithm"}, {"score": 0.002857849698346116, "phrase": "simulated_data_set"}, {"score": 0.002821685815956478, "phrase": "real_data_sets"}, {"score": 0.002750721367040336, "phrase": "otherwell-known_methods"}, {"score": 0.0027159094186967247, "phrase": "prediction_analysis_of_microarrays"}, {"score": 0.0024947959375982614, "phrase": "structured_polychotomous_machine"}, {"score": 0.0024114635128122783, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "Due to recent interest in the analysis of DNA microarray data, new methods have been considered and developed in the area of statistical classification. In particular, according to the gene expression profile of existing data, the goal is to classify the sample into a relevant diagnostic category. However, when classifying outcomes into certain cancer types, it is often the case that some genes are not important, while some genes are more important than others. A novel algorithm is presented for selecting such relevant genes referred to 15 marker genes for cancer classification. This algorithm is based on the Support Vector Machine (SVM) and Supervised Weighted Kernel Clustering (SWKC). To investigate the performance of this algorithm, the methods were applied to a simulated data set and some real data sets. For comparison, some otherwell-known methods such as Prediction Analysis of Microarrays (PAM), Support Vector Machine-Recursive Feature Elimination (SVM-RFE), and a Structured Polychotomous Machine (SPM) were considered. The experimental results indicate that the proposed SWKC/SVM algorithm is conceptually much simpler and performs more efficiently than other existing methods used in identifying marker genes for cancer classification. Furthermore, the SWKC/SVM algorithm has the advantage that it requires much less computing time compared with the other existing methods. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Selecting marker genes for cancer classification using supervised weighted kernel clustering and the support vector machine", "paper_id": "WOS:000264751000020"}