{"auto_keywords": [{"score": 0.04885877600670675, "phrase": "china"}, {"score": 0.010612100823933015, "phrase": "research_focus"}, {"score": 0.004753194996637899, "phrase": "library_and_information_science_institutions"}, {"score": 0.004632039024076267, "phrase": "institution-specific_keywords"}, {"score": 0.0041773934798743405, "phrase": "keyword_activity_index"}, {"score": 0.003941479030920711, "phrase": "kai"}, {"score": 0.003767203575060969, "phrase": "activity_index"}, {"score": 0.0036006068766833103, "phrase": "alternatively_comparative_advantage"}, {"score": 0.003531474887552889, "phrase": "particular_topic"}, {"score": 0.002622947550220266, "phrase": "kai_values"}, {"score": 0.0024906610581090223, "phrase": "co-word_analysis"}, {"score": 0.00244278788608393, "phrase": "research_advantages"}, {"score": 0.0021049977753042253, "phrase": "research_background"}], "paper_keywords": ["Research institution", " Research focus", " Keyword analysis", " Keyword Activity Index", " Library and Information Science in China"], "paper_abstract": "In order to distinguish the research focus between different Library and Information Science (LIS) research institutions in China, we use the Keyword Activity Index (KAI) to identify their institution-specific keywords. The KAI, whose idea is borrowed from the Activity Index, measures whether an institution has alternatively comparative advantage in a particular topic according to its share in publications. In this study, a total of 65,653 papers from 19 core LIS journals in China during the period of 2000-2013 are collected. The top 8 most prolific LIS research institutions in China are selected for further investigation of the utility of KAI. Their institution-specific keywords are extracted based on the KAI values to represent their research focus and then clustered using co-word analysis; the research advantages of each institution are analyzed and compared according to these clusters. The reasons of their research advantages are analyzed based on their research function and research background.", "paper_title": "Identifying the research focus of Library and Information Science institutions in China with institution-specific keywords", "paper_id": "WOS:000352995000020"}