{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grid_workflows"}, {"score": 0.018033772412990267, "phrase": "performance_metrics"}, {"score": 0.006787487980687089, "phrase": "performance_data"}, {"score": 0.0046340196745259694, "phrase": "performance_behavior"}, {"score": 0.004268780663872836, "phrase": "dynamic_and_complex_grid_systems"}, {"score": 0.0037636590459094762, "phrase": "comprehensive_study"}, {"score": 0.003429358748802009, "phrase": "grid"}, {"score": 0.003175792987190499, "phrase": "essential_performance-related_concepts"}, {"score": 0.0028150302583265655, "phrase": "performance_monitoring"}, {"score": 0.0026213749921120623, "phrase": "grid_workilows"}, {"score": 0.002536534348967786, "phrase": "multiple_levels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["grid workflows", " grid computing", " performance monitoring and analysis", " performance metrics and ontology"], "paper_abstract": "Many Grid workflow middleware services require knowledge about the performance behavior of Grid applications/services in order to effectively select, compose, and execute workflows in dynamic and complex Grid systems. To provide performance information for building such knowledge, Grid workflow performance tools have to select, measure, and analyze various performance metrics of workflows. However, there is a lack of a comprehensive study of performance metrics which can be used to evaluate the performance of a workflow executed in the Grid. Moreover, given the complexity of both Grid systems and workflows, semantics of essential performance-related concepts and relationships, and associated performance data in Grid workflows should be well described. In this paper, we analyze performance metrics that performance monitoring and analysis tools should provide during the evaluation of the performance of Grid workilows. Performance metrics are associated with multiple levels of abstraction. We introduce an ontology for describing performance data of Grid workflows and illustrate how the ontology can be utilized for monitoring and analyzing the performance of Grid workflows. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Performance metrics and ontologies for Grid workflows", "paper_id": "WOS:000247228700003"}