{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "engineers'_information_behaviors"}, {"score": 0.004585433265422727, "phrase": "knowledge_work"}, {"score": 0.004366808573435364, "phrase": "extensive_empirical_study"}, {"score": 0.004192571571622019, "phrase": "effective_work_sampling_method"}, {"score": 0.004158563941891469, "phrase": "seventy-eight_design_engineers"}, {"score": 0.004091370602573054, "phrase": "portable_handheld_computer"}, {"score": 0.00405821006535105, "phrase": "pda"}, {"score": 0.0036652492107503956, "phrase": "information_behaviors"}, {"score": 0.0035477010181860376, "phrase": "resultant_data"}, {"score": 0.003504595508262064, "phrase": "comprehensive_picture"}, {"score": 0.0032302647179383915, "phrase": "specific_hypotheses"}, {"score": 0.0029652292779277782, "phrase": "substantially_more_time"}, {"score": 0.002570817338292482, "phrase": "time_participants"}, {"score": 0.0024781515864648242, "phrase": "nonhuman_sources"}, {"score": 0.002438043578514396, "phrase": "former_case"}, {"score": 0.002408388114274793, "phrase": "relatively_less_time"}, {"score": 0.002379092507901856, "phrase": "information_source"}, {"score": 0.0021049977753042253, "phrase": "organizational_practice"}], "paper_keywords": [""], "paper_abstract": "The importance of the acquisition and provision of information within knowledge work such as engineering is widely acknowledged. This article reports an extensive empirical study of such information behaviors in engineers, using a novel and effective work sampling method. Seventy-eight design engineers each carried a portable handheld computer (PDA) for 20 working days. Once every hour, they were prompted to enter data concerning the task they were currently performing, including the information behaviors in which they were engaging. The resultant data represent a comprehensive picture of engineers' information behaviors and the percentage of their working time for which each of these behaviors accounts (55.75% in total). Specific hypotheses concerning the time spent engaged in these behaviors were also tested. Accordingly, it was found that participants spent substantially more time receiving information they had not requested than information they had, and this pattern was also reflected when they provided others with information. Furthermore, although there was no difference found between the time participants spent searching for information from other people compared with nonhuman sources, in the former case they spent relatively less time locating the information source and information within that source, and relatively more time engaged in problem solving and decision making. The results are discussed in terms of their implications for theory and organizational practice.", "paper_title": "An Empirical Analysis of Engineers' Information Behaviors", "paper_id": "WOS:000276370500001"}