{"auto_keywords": [{"score": 0.04927465911141675, "phrase": "thermal_awareness"}, {"score": 0.028345798718804226, "phrase": "peak_temperature"}, {"score": 0.0044424917428102445, "phrase": "huber-based_local_smoothing_technique"}, {"score": 0.004349337717774093, "phrase": "helmholtz-based_global_smoothing_technique"}, {"score": 0.004204320052179726, "phrase": "experimental_results"}, {"score": 0.004133627071344356, "phrase": "analytical_approach"}, {"score": 0.0038461561450308813, "phrase": "tsv"}, {"score": 0.003548368289666935, "phrase": "similar_number"}, {"score": 0.003287482882222731, "phrase": "uniform_power_distribution"}, {"score": 0.002944039482467119, "phrase": "tsv_area"}, {"score": 0.0028457440091791252, "phrase": "lumped_power_consumption"}, {"score": 0.0024736973328071026, "phrase": "tsv_oblivious_method"}, {"score": 0.0022626276288355432, "phrase": "slightly_less_wirelength_overhead"}, {"score": 0.0021870332034407817, "phrase": "thermal_effects"}, {"score": 0.0021049977753042253, "phrase": "placement_stage"}], "paper_keywords": ["3-D integrated circuits", " analytical placement", " thermal optimization", " through-silicon-via (TSV)"], "paper_abstract": "In this paper, we present a high-quality analytical 3-D placement framework. We propose using a Huber-based local smoothing technique to work with a Helmholtz-based global smoothing technique to handle the nonoverlapping constraints. The experimental results show that this analytical approach is effective for achieving tradeoffs between the wirelength and the through-silicon-via (TSV) number. Compared to the state-of-the-art 3-D placer ntuplace3d, our placer achieves more than 20% wirelength reduction, on average, with a similar number of TSVs. Furthermore, we extend this analytical 3-D placement framework with thermal awareness. While 2-D thermal-aware placement simply follows uniform power distribution to minimize temperature, we show that the same criterion does not work for 3-D ICs. Instead, we are able to prove that when the TSV area in each bin is proportional to the lumped power consumption of that bin and the bins in all tiers directly above it, the peak temperature is minimized. Based on this criterion, we implement thermal awareness in our analytical 3-D placement framework. Compared with a TSV oblivious method, which only results in an 8% peak temperature reduction, our method reduces the peak temperature by 34%, on average, with slightly less wirelength overhead. These results suggest that considering the thermal effects of TSVs is necessary and effective during the placement stage.", "paper_title": "An Analytical Placement Framework for 3-D ICs and Its Extension on Thermal Awareness", "paper_id": "WOS:000317001200004"}