{"auto_keywords": [{"score": 0.0490670488207421, "phrase": "alignment_independent_descriptors"}, {"score": 0.03074250152501011, "phrase": "ache_active_site"}, {"score": 0.004548253531664032, "phrase": "predictive_power"}, {"score": 0.0040726680518382965, "phrase": "different_conformations"}, {"score": 0.004015025120733852, "phrase": "next_criteria"}, {"score": 0.003846926701870193, "phrase": "conformation_most_similar_to_the_co-crystalized_ligand_conformation"}, {"score": 0.0034567253581991226, "phrase": "protonated_pyridine_nitrogen"}, {"score": 0.003432160899769594, "phrase": "tacrine_moiety"}, {"score": 0.00335950642866031, "phrase": "hba_and_hbd_interactions"}, {"score": 0.0031731685183735508, "phrase": "protonated_pyridinium_nitrogen"}, {"score": 0.0029336622847544857, "phrase": "dry_grid_probes"}, {"score": 0.0028207566216121856, "phrase": "amino_acid_residues"}, {"score": 0.002751174423568564, "phrase": "high_impact"}, {"score": 0.0027121844541913367, "phrase": "external_predictive_power"}, {"score": 0.0024368006923629476, "phrase": "different_enzyme_source"}, {"score": 0.0023936956017015696, "phrase": "external_predictivity"}, {"score": 0.0023015232625177755, "phrase": "docked_conformations"}, {"score": 0.0022851491693940272, "phrase": "superior_predictive_ability"}, {"score": 0.0021659920594094407, "phrase": "geometrical_restrictions"}, {"score": 0.002150580119047236, "phrase": "ache_active_site_gorge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Acetylcholinesterase", " Dual binding inhibitors", " GRIND-2", " 3D-QSAR", " Molecular interaction fields", " External predictivity"], "paper_abstract": "The 3D-QSAR analysis based on alignment independent descriptors (GRIND-2) was performed on the set of 110 structurally diverse, dual binding AChE reversible inhibitors. Three separate models were built, based on different conformations, generated following next criteria: (i) minimum energy conformations, (ii) conformation most similar to the co-crystalized ligand conformation, and (iii) docked conformation. We found that regardless on conformation used, all the three models had good statistic and predictivity. The models revealed the importance of protonated pyridine nitrogen of tacrine moiety for anti AChE activity, and recognized HBA and HBD interactions as highly important for the potency. This was revealed by the variables associated with protonated pyridinium nitrogen, and the two amino groups of the linker. MIFs calculated with the N1= (pyridinium nitrogen) and the DRY GRID probes in the AChE active site enabled us to establish the relationship between amino acid residues within AChE active site and the variables having high impact on models. External predictive power of the models was tested on the set of 40 AChE reversible inhibitors, most of them structurally different from the training set. Some of those compounds were tested on the different enzyme source. We found that external predictivity was highly sensitive on conformations used. Model based on docked conformations had superior predictive ability, emphasizing the need for the employment of conformations built by taking into account geometrical restrictions of AChE active site gorge. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "The 3D-QSAR study of 110 diverse, dual binding, acetylcholinesterase inhibitors based on alignment independent descriptors (GRIND-2). The effects of conformation on predictive power and interpretability of the models", "paper_id": "WOS:000313392800020"}