{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "action_recognition"}, {"score": 0.015719716506582538, "phrase": "pose_estimation"}, {"score": 0.004756805752518494, "phrase": "multiple_views"}, {"score": 0.004476399615305783, "phrase": "human_body_movements"}, {"score": 0.0037988336463795963, "phrase": "coupled_action_recognition"}, {"score": 0.0034887749053459584, "phrase": "action-specific_manifolds"}, {"score": 0.003051713660488494, "phrase": "action_labels"}, {"score": 0.0030147970456037274, "phrase": "relational_pose_features"}, {"score": 0.0027184540871935284, "phrase": "high_degrees"}, {"score": 0.0024511688853030168, "phrase": "humaneva-ii_benchmark"}, {"score": 0.002278440725193305, "phrase": "action_recognition_accuracy"}, {"score": 0.0021966859554037174, "phrase": "challenging_tum_kitchen_dataset"}], "paper_keywords": ["Human pose estimation", " Human action recognition", " Tracking", " Stochastic optimization", " Hough transform"], "paper_abstract": "Action recognition and pose estimation are two closely related topics in understanding human body movements; information from one task can be leveraged to assist the other, yet the two are often treated separately. We present here a framework for coupled action recognition and pose estimation by formulating pose estimation as an optimization over a set of action-specific manifolds. The framework allows for integration of a 2D appearance-based action recognition system as a prior for 3D pose estimation and for refinement of the action labels using relational pose features based on the extracted 3D poses. Our experiments show that our pose estimation system is able to estimate body poses with high degrees of freedom using very few particles and can achieve state-of-the-art results on the HumanEva-II benchmark. We also thoroughly investigate the impact of pose estimation and action recognition accuracy on each other on the challenging TUM kitchen dataset. We demonstrate not only the feasibility of using extracted 3D poses for action recognition, but also improved performance in comparison to action recognition using low-level appearance features.", "paper_title": "Coupled Action Recognition and Pose Estimation from Multiple Views", "paper_id": "WOS:000305564800002"}