{"auto_keywords": [{"score": 0.04784104453818294, "phrase": "flow_state"}, {"score": 0.04383078644467653, "phrase": "irms"}, {"score": 0.03143910212603226, "phrase": "child's_input"}, {"score": 0.00481495049065317, "phrase": "emotional_state"}, {"score": 0.004690952711665194, "phrase": "flow_machine"}, {"score": 0.004394688617163029, "phrase": "miror-improvisation_prototype"}, {"score": 0.004099183062034004, "phrase": "flow_machines"}, {"score": 0.003806866174028117, "phrase": "twenty-four_children"}, {"score": 0.0024412911465483225, "phrase": "miror-impro"}, {"score": 0.0023990982005125763, "phrase": "set-up_same"}, {"score": 0.002257070536352418, "phrase": "reflexive_interaction"}, {"score": 0.0021420294823879292, "phrase": "flow_grid"}, {"score": 0.0021049977753042253, "phrase": "effective_way"}], "paper_keywords": ["MIROR platform", " flow machine", " human-machine interaction", " observation methodology", " emotion", " childhood music education"], "paper_abstract": "The presence of flow state was measured and observed in children playing with the MIROR-Improvisation prototype, an interactive reflexive musical system (IRMS). IRMS have been defined as flow machines' on account of their ability to imitate the style of the human playing a keyboard. Twenty-four children (4 and 8 years old) took part in three sessions playing a keyboard on three consecutive days. In each session, all children played the keyboard with and without the MIROR-Impro, alone and with a friend. One group of children played the system with a set-up in which the reply is more similar to the child's input (set-up Same). The other group played the system with the set-up Very Different, in which the reply is less similar to the child's input. The results show that the flow state is higher when the children play with MIROR-Impro, with the set-up Same and in 8-year-old children. These results would support the hypothesis that IRMS and reflexive interaction can generate an experience of well being and creativity. The flow grid worked in an effective way and it was possible to identify some aspects of the system that could be improved.", "paper_title": "The Flow Grid: A Technique for Observing and Measuring Emotional State in Children Interacting with a Flow Machine", "paper_id": "WOS:000361214900005"}