{"auto_keywords": [{"score": 0.047813641354219324, "phrase": "ui"}, {"score": 0.016196035046373167, "phrase": "ui-ss_relationship"}, {"score": 0.006759651218728254, "phrase": "user_involvement"}, {"score": 0.006331670737415907, "phrase": "system_success"}, {"score": 0.00474950769553788, "phrase": "sdlc"}, {"score": 0.004695687924940238, "phrase": "research_method"}, {"score": 0.004548253531664032, "phrase": "system_development_lifecycle"}, {"score": 0.004046627438964482, "phrase": "complex_phenomenon"}, {"score": 0.003966667994579941, "phrase": "systematic_literature_review"}, {"score": 0.00394411495217349, "phrase": "slr"}, {"score": 0.0038332390893263844, "phrase": "evidence_based_software_engineering"}, {"score": 0.003789763907758991, "phrase": "resulting_studies"}, {"score": 0.0034004869983267085, "phrase": "software_development_lifecycle"}, {"score": 0.003025063194178549, "phrase": "negative_contribution"}, {"score": 0.0025781678963568114, "phrase": "sufficient_empirical_evidence"}, {"score": 0.0024005409468262203, "phrase": "double_edged_sword"}, {"score": 0.0022223932033729396, "phrase": "effective_management"}, {"score": 0.0021413855297794946, "phrase": "published_literature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["User involvement", " Software development", " Systematic Literature Review"], "paper_abstract": "Context: For more than four decades it has been intuitively accepted that user involvement (UI) during system development lifecycle leads to system success. However when the researchers have evaluated the user involvement and system success (UI-SS) relationship empirically, the results were not always positive. Objective: Our objective was to explore the UI-SS relationship by synthesizing the results of all the studies that have empirically investigated this complex phenomenon. Method: We performed a Systematic Literature Review (SLR) following the steps provided in the guidelines of Evidence Based Software Engineering. From the resulting studies we extracted data to answer our 9 research questions related to the UI-SS relationship, identification of users, perspectives of UI, benefits, problems and challenges of UI, degree and level of UI, relevance of stages of software development lifecycle (SDLC) and the research method employed on the UI-SS relationship. Results: Our systematic review resulted in selecting 87 empirical studies published during the period 1980-2012. Among 87 studies reviewed, 52 reported that UI positively contributes to system success, 12 suggested a negative contribution and 23 were uncertain. The UI-SS relationship is neither direct nor binary, and there are various confounding factors that play their role. The identification of users, their degree/level of involvement, stage of SDLC for UI, and choice of research method have been claimed to have impact on the UI-SS relationship. However, there is not sufficient empirical evidence available to support these claims. Conclusion: Our results have revealed that UI does contribute positively to system success. But it is a double edged sword and if not managed carefully it may cause more problems than benefits. Based on the analysis of 87 studies, we were able to identify factors for effective management of UI alluding to the causes for inconsistency in the results of published literature. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A systematic review on the relationship between user involvement and system success", "paper_id": "WOS:000347022800009"}