{"auto_keywords": [{"score": 0.048239757080509704, "phrase": "xpath_queries"}, {"score": 0.043919388355231175, "phrase": "partial_evaluation"}, {"score": 0.010744556947962596, "phrase": "boolean_xpath_queries"}, {"score": 0.00481495049065317, "phrase": "distributed_xpath_query_processing"}, {"score": 0.004575977644865379, "phrase": "xml_tree"}, {"score": 0.004264463695140275, "phrase": "key_idea"}, {"score": 0.004084584884062157, "phrase": "whole_query"}, {"score": 0.003776801632114611, "phrase": "boolean"}, {"score": 0.003357633232360232, "phrase": "data-selecting_xpath_queries"}, {"score": 0.0032158817866929563, "phrase": "network_traffic"}, {"score": 0.0029616217177058602, "phrase": "total_computation"}, {"score": 0.002892729377519916, "phrase": "centralized_algorithms"}, {"score": 0.0028143720888311537, "phrase": "single_site"}, {"score": 0.0026431267487109543, "phrase": "mapreduce_algorithm"}, {"score": 0.0024150092189446424, "phrase": "centralized_setting"}, {"score": 0.0022948742034852917, "phrase": "large_trees"}, {"score": 0.0022769287097263564, "phrase": "complex_xpath_queries"}, {"score": 0.0021383149182448544, "phrase": "distributed_systems"}, {"score": 0.0021049977753042253, "phrase": "centralized_xml_stores"}], "paper_keywords": ["Algorithms", " Performance", " Distributed XML documents", " XPath queries", " parallel query processing"], "paper_abstract": "This article proposes algorithms for evaluating XPath queries over an XML tree that is partitioned horizontally and vertically, and is distributed across a number of sites. The key idea is based on partial evaluation: it is to send the whole query to each site that partially evaluates the query, in parallel, and sends the results as compact (Boolean) functions to a coordinator that combines these to obtain the result. This approach possesses the following performance guarantees. First, each site is visited at most twice for data-selecting XPath queries, and only once for Boolean XPath queries. Second, the network traffic is determined by the answer to the query, rather than the size of the tree. Third, the total computation is comparable to that of centralized algorithms on the tree stored in a single site, regardless of how the tree is fragmented and distributed. We also present a MapReduce algorithm for evaluating Boolean XPath queries, based on partial evaluation. In addition, we provide algorithms to evaluate XPath queries on very large XML trees, in a centralized setting. We show both analytically and empirically that our techniques are scalable with large trees and complex XPath queries. These results, we believe, illustrate the usefulness and potential of partial evaluation in distributed systems as well as centralized XML stores for evaluating XPath queries and beyond.", "paper_title": "Partial Evaluation for Distributed XPath Query Processing and Beyond", "paper_id": "WOS:000312942400010"}