{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "real-time_simulation"}, {"score": 0.004437613070853689, "phrase": "higher_and_higher_levels"}, {"score": 0.004238452771031322, "phrase": "animated_scenarios"}, {"score": 0.003769006950727621, "phrase": "accurate_answer"}, {"score": 0.0036553070575015344, "phrase": "visually_plausible_one"}, {"score": 0.0034911335714333507, "phrase": "physically_based_simulations"}, {"score": 0.003334309053314909, "phrase": "simulation_conditions"}, {"score": 0.002949598537993663, "phrase": "finite_element-based_technique"}, {"score": 0.0027459678326877744, "phrase": "first_stage"}, {"score": 0.002676692093594358, "phrase": "initial_solution"}, {"score": 0.002556359086441866, "phrase": "large_error"}, {"score": 0.002441422510910065, "phrase": "final_stage"}, {"score": 0.002392008392892289, "phrase": "angular_momenta"}, {"score": 0.0023435920614377306, "phrase": "experimental_results"}, {"score": 0.002272794656458419, "phrase": "new_approach"}, {"score": 0.0021049977753042253, "phrase": "stiffness_warping_method"}], "paper_keywords": ["real-time simulation", " deformable objects", " robust linear FEM"], "paper_abstract": "Nowadays many interactive computer graphics applications deal with soft-bodies. These applications are always demanding higher and higher levels of realism, increasing the complexity of the animated scenarios. Therefore, the techniques used to animate the objects should be very efficient to grant interactivity. Most often, an accurate answer is not needed and a visually plausible one is enough. One of the most important issues in physically based simulations is to keep the model stable under all simulation conditions. In this paper we present a technique called matrix system reduction solver (MSRS) to highly accelerate the real-time simulation of a finite element-based technique. Our method is fast, visually plausible and robust. In the first stage of the algorithm an initial solution is estimated. Then, only those equations showing a large error are solved using a more precise technique. In the final stage the linear and angular momenta are corrected. Experimental results show the feasibility of this new approach from the point of view of performance compared to the results provided by the stiffness warping method. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "MSRS: A fast linear solver for the real-time simulation of deformable objects", "paper_id": "WOS:000258024100002"}