{"auto_keywords": [{"score": 0.004664352260912174, "phrase": "infrastructural_projects"}, {"score": 0.004353948887538618, "phrase": "involved_parties"}, {"score": 0.004085713541752114, "phrase": "information_harmonisation"}, {"score": 0.00385431710959668, "phrase": "infrastructural_project"}, {"score": 0.0034118234596993836, "phrase": "thematic_semantic_information"}, {"score": 0.00267301171407926, "phrase": "existing_integrated_semantic_information_model"}, {"score": 0.002575526825728026, "phrase": "subsurface_objects"}, {"score": 0.002391067964886602, "phrase": "geotechnical_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CityGML", " Database", " Harmonisation", " Geotechnique", " Geology"], "paper_abstract": "In infrastructural projects, communication as well as information exchange and (re-)use in and between involved parties is difficult. Mainly this is caused by a lack of information harmonisation. Various specialists are working together on the development of an infrastructural project and all use their own specific software and definitions for various information types. In addition, the lack of and/or differences in the use and definition of thematic semantic information regarding the various information types adds to the problem. Realistic 3D models describing and integrating parts of the earth already exist, but are generally neglecting the subsurface, and especially the aspects of geology and geo-technology. This paper summarises the research towards the extension of an existing integrated semantic information model to include surface as well as subsurface objects and in particular, subsurface geological and geotechnical objects. The major contributions of this research are the definition of geotechnical objects and the mechanism to link them with CityGML, GeoSciML and O&M standard models. The model is called 3D-GEM, short for 3D Geotechnical Extension Model. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "3D-GEM: Geo-technical extension towards an integrated 3D information model for infrastructural development", "paper_id": "WOS:000333232700014"}