{"auto_keywords": [{"score": 0.03669884834098149, "phrase": "knowledge_management_system"}, {"score": 0.00481495049065317, "phrase": "knowledge_management_systems"}, {"score": 0.004300830853119242, "phrase": "organizational_performance"}, {"score": 0.004235095881928715, "phrase": "competitive_capacity"}, {"score": 0.0041490029730869345, "phrase": "serious_difficulties"}, {"score": 0.003982011128052839, "phrase": "knowledge_management"}, {"score": 0.00368673793612343, "phrase": "suitable_methodologies"}, {"score": 0.003343841875107018, "phrase": "computer_system"}, {"score": 0.002309242063033298, "phrase": "expected_results"}, {"score": 0.0021709933368474223, "phrase": "proposed_methodology"}, {"score": 0.0021049977753042253, "phrase": "particular_case"}], "paper_keywords": [""], "paper_abstract": "Managing knowledge means managing the processes of creation, development, distribution and utilisation of knowledge in order to improve organizational performance and increase competitive capacity. However, serious difficulties arise when attempts are made to implement knowledge management in enterprises. One of the reasons behind this situation is the lack of suitable methodologies for guiding the process of development and implementation of a knowledge management system (KMS), which is a computer system that allows the processes of creating, collecting, organising, accessing and using knowledge to be automated as far as possible. In this article we propose a methodology for directing the process of developing and implementing a knowledge management system in any type of organization. The methodology is organised in phases and outlines the activities to be performed, the techniques and supporting tools to be used, and the expected results for each phase. In addition, we show how the proposed methodology can be applied to the particular case of an enterprise.", "paper_title": "Methodology for the implementation of knowledge management systems", "paper_id": "WOS:000253550400007"}