{"auto_keywords": [{"score": 0.0468720905372598, "phrase": "darwinian_evolution"}, {"score": 0.00481495049065317, "phrase": "comprehensive_answer"}, {"score": 0.004284100953217494, "phrase": "different_ways"}, {"score": 0.004138309011478741, "phrase": "pervasive_bias"}, {"score": 0.003634262647873338, "phrase": "passive_trend"}, {"score": 0.003571850980647625, "phrase": "driven_one"}, {"score": 0.003163878786694538, "phrase": "later_sections"}, {"score": 0.0029264925857346497, "phrase": "concise_form"}, {"score": 0.0028145455182562807, "phrase": "sustained_trend"}, {"score": 0.002766171878646582, "phrase": "maximum_complexity"}, {"score": 0.0021049977753042253, "phrase": "double-_edged_sword"}], "paper_keywords": ["evolution", " complexity", " arrow of complexity", " trends"], "paper_abstract": "We attempt to provide a comprehensive answer to the question of whether, and when, an arrow of complexity emerges in Darwinian evolution. We note that this expression can be interpreted in different ways, including a passive, incidental growth, or a pervasive bias towards complexification. We argue at length that an arrow of complexity does indeed occur in evolution, which can be most reasonably interpreted as the result of a passive trend rather than a driven one. What, then, is the role of evolution in the creation of this trend, and under which conditions will it emerge? In the later sections of this article we point out that when certain proper conditions ( which we attempt to formulate in a concise form) are met, Darwinian evolution predictably creates a sustained trend of increase in maximum complexity ( that is, an arrow of complexity) that would not be possible without it; but if they are not, evolution will not only fail to produce an arrow of complexity, but may actually prevent any increase in complexity altogether. We conclude that, with regard to the growth of complexity, evolution is very much a double- edged sword.", "paper_title": "Evolution and complexity: The double-edged sword", "paper_id": "WOS:000258039000008"}