{"auto_keywords": [{"score": 0.03437053554551738, "phrase": "digital_curve"}, {"score": 0.00481495049065317, "phrase": "digital_curves"}, {"score": 0.004776297980616768, "phrase": "relaxed_straightness_properties"}, {"score": 0.004370973501074594, "phrase": "digital_straightness"}, {"score": 0.004249332848326785, "phrase": "large_number"}, {"score": 0.004016072233242585, "phrase": "curve_segment"}, {"score": 0.003734810936407523, "phrase": "multiple_dss"}, {"score": 0.003558294449586273, "phrase": "new_concept"}, {"score": 0.0035296940954990964, "phrase": "approximate_straightness"}, {"score": 0.0034314496905159674, "phrase": "dss"}, {"score": 0.0029913511336659327, "phrase": "exact_dss_cover"}, {"score": 0.0027816546451972725, "phrase": "large_extent"}, {"score": 0.002748159131396737, "phrase": "extracted_set"}, {"score": 0.002639385610609024, "phrase": "compact_polygonal_approximation"}, {"score": 0.002545165985686468, "phrase": "specified_error_tolerance"}, {"score": 0.0025145109881926143, "phrase": "proposed_algorithm"}, {"score": 0.0023666732429695908, "phrase": "exact_dss."}, {"score": 0.002347628167175859, "phrase": "overall_time_complexity"}, {"score": 0.002218526133566788, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["digital geometry", " digital straight line", " polygonal approximation", " shape analysis"], "paper_abstract": "Several existing digital straight line segment (DSS) recognition algorithms can be used to determine the digital straightness of a given one-pixel-thick digital curve. Because of the inherent geometric constraints of digital straightness, these algorithms often produce a large number of segments to cover a given digital curve representing a real-life object/image. Thus, a curve segment, which is not exactly digitally straight but appears to be visually straight, is fragmented into multiple DSS when these algorithms are run. In this paper, a new concept of approximate straightness is introduced by relaxing certain conditions of DSS, and an algorithm is described to extract those segments from a digital curve. The number of such segments required to cover the curve is found to be significantly fewer than that of the exact DSS cover. As a result, the data set required for representing a curve also reduces to a large extent. The extracted set of segments can further be combined to determine a compact polygonal approximation of a digital curve based on certain approximation criteria and a specified error tolerance. The proposed algorithm involves only primitive integer operations and, thus, runs very fast compared to those based on exact DSS. The overall time complexity becomes linear in the number of points present in the representative set. Experimental results on several digital curves demonstrate the speed, elegance, and efficacy of the proposed method.", "paper_title": "Fast polygonal approximation of digital curves using relaxed straightness properties", "paper_id": "WOS:000247965600008"}