{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "regular_expressions"}, {"score": 0.015602846720880584, "phrase": "clinical_text_classification"}, {"score": 0.010260727710311413, "phrase": "svm_classifier"}, {"score": 0.008504807361281817, "phrase": "svm"}, {"score": 0.004550029253278477, "phrase": "human_experts"}, {"score": 0.004332199142914195, "phrase": "text_classification"}, {"score": 0.0042351951710402425, "phrase": "novel_regular_expression_discovery"}, {"score": 0.003971938976270902, "phrase": "alignment_algorithm"}, {"score": 0.003853757393357659, "phrase": "support_vector_machine"}, {"score": 0.003641536679929222, "phrase": "smoke"}, {"score": 0.0035599338383885447, "phrase": "smoking_status"}, {"score": 0.0035065612417565883, "phrase": "pain"}, {"score": 0.0034279721355412285, "phrase": "pain_status"}, {"score": 0.0028485585670146025, "phrase": "svm's_accuracy"}, {"score": 0.0027741761880779535, "phrase": "small_but_consistent_improvements"}, {"score": 0.002631172352670227, "phrase": "red_classifiers"}, {"score": 0.002402921062033032, "phrase": "total_instances"}, {"score": 0.002340147988348115, "phrase": "svm's_misclassifications"}, {"score": 0.002202742267484358, "phrase": "regular_expression-based_classifier"}, {"score": 0.0021049977753042253, "phrase": "classification_performance"}], "paper_keywords": [""], "paper_abstract": "Objectives Natural language processing (NLP) applications typically use regular expressions that have been developed manually by human experts. Our goal is to automate both the creation and utilization of regular expressions in text classification. Methods We designed a novel regular expression discovery (RED) algorithm and implemented two text classifiers based on RED. The RED+ALIGN classifier combines RED with an alignment algorithm, and RED +SVM combines RED with a support vector machine (SVM) classifier. Two clinical datasets were used for testing and evaluation: the SMOKE dataset, containing 1091 text snippets describing smoking status; and the PAIN dataset, containing 702 snippets describing pain status. We performed 10-fold cross-validation to calculate accuracy, precision, recall, and F-measure metrics. In the evaluation, an SVM classifier was trained as the control. Results The two RED classifiers achieved 80.9-83.0% in overall accuracy on the two datasets, which is 1.3-3% higher than SVM's accuracy (p<0.001). Similarly, small but consistent improvements have been observed in precision, recall, and F-measure when RED classifiers are compared with SVM alone. More significantly, RED+ALIGN correctly classified many instances that were misclassified by the SVM classifier (8.1-10.3% of the total instances and 43.8-53.0% of SVM's misclassifications). Conclusions Machine-generated regular expressions can be effectively used in clinical text classification. The regular expression-based classifier can be combined with other classifiers, like SVM, to improve classification performance.", "paper_title": "Learning regular expressions for clinical text classification", "paper_id": "WOS:000340581400013"}