{"auto_keywords": [{"score": 0.035698246609395815, "phrase": "defective_items"}, {"score": 0.010286041580577266, "phrase": "defective_members"}, {"score": 0.007152368807539886, "phrase": "probabilistic_tests"}, {"score": 0.0046368166127362925, "phrase": "large_populations"}, {"score": 0.004535950496583731, "phrase": "statistics_community"}, {"score": 0.004465243405240743, "phrase": "group_testing"}, {"score": 0.004340724551091173, "phrase": "different_pools"}, {"score": 0.004219663341808316, "phrase": "test_results"}, {"score": 0.00411487907113509, "phrase": "classical_noiseless_group_testing_setup"}, {"score": 0.004025320909035849, "phrase": "sampling_procedure"}, {"score": 0.003950103621065539, "phrase": "reconstruction_algorithm"}, {"score": 0.0038278398921822404, "phrase": "defective_member"}, {"score": 0.003744505496142733, "phrase": "test_outcome"}, {"score": 0.00356075194411181, "phrase": "valid_assumption"}, {"score": 0.0031995714196263506, "phrase": "negative_test_result"}, {"score": 0.0030616859252873235, "phrase": "sampling_and_reconstruction_method"}, {"score": 0.0027683608802260636, "phrase": "infected_people"}, {"score": 0.0027509877943131945, "phrase": "viral_epidemics"}, {"score": 0.002716567128011818, "phrase": "nonadaptive_sampling_procedures"}, {"score": 0.0026910337912859268, "phrase": "successful_identification"}, {"score": 0.0024254832239892017, "phrase": "activation_probability"}, {"score": 0.0023063080082656737, "phrase": "possible_sets"}, {"score": 0.002213793650525558, "phrase": "single_set"}, {"score": 0.0021049977753042253, "phrase": "simple_reconstruction_algorithm"}], "paper_keywords": ["Compressed sensing", " epidemiology", " group testing", " probabilistic tests", " sparsity recovery"], "paper_abstract": "Identification of defective members of large populations has been widely studied in the statistics community under the name of group testing. It involves grouping subsets of items into different pools and detecting defective members based on the set of test results obtained for each pool. In a classical noiseless group testing setup, it is assumed that the sampling procedure is fully known to the reconstruction algorithm, in the sense that the existence of a defective member in a pool results in the test outcome of that pool to be positive. However, this may not be always a valid assumption in some cases of interest. In particular, we consider the case where the defective items in a pool can become independently inactive with a certain probability. Hence, one may obtain a negative test result in a pool despite containing some defective items. As a result, any sampling and reconstruction method should be able to cope with two different types of uncertainty, i.e., the unknown set of defective items and the partially unknown, probabilistic testing procedure. In this work, motivated by the application of detecting infected people in viral epidemics, we design nonadaptive sampling procedures that allow successful identification of the defective items through a set of probabilistic tests. Our design requires only a small number of tests to single out the defective items. In particular, for a population of size and at most defective items with activation probability, our results show that M = O(K-2 log (N/K)/p(3)) tests is sufficient if the sampling procedure should work for all possible sets of defective items, while M = O(K log (N)/p(3)) tests is enough to be successful for any single set of defective items. Moreover, we show that the defective members can be recovered using a simple reconstruction algorithm with complexity of O(MN).", "paper_title": "Group Testing With Probabilistic Tests: Theory, Design and Application", "paper_id": "WOS:000295739000051"}