{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "trapezoidal_fuzzy_numbers"}, {"score": 0.00443308765153716, "phrase": "resource_selection_problem"}, {"score": 0.004195418010131832, "phrase": "\"ideal\"_resource"}, {"score": 0.004062682236016889, "phrase": "fuzzy_subsets"}, {"score": 0.0038271712887391015, "phrase": "subjective_variables"}, {"score": 0.0035072146967082083, "phrase": "decision-making_process"}, {"score": 0.0032585499655442404, "phrase": "mean_quadratic_distance"}, {"score": 0.002748775748298028, "phrase": "weighted_mean_asymmetric_index"}, {"score": 0.002673957615079041, "phrase": "mean_distance"}, {"score": 0.0025420267431501367, "phrase": "corresponding_trfns"}, {"score": 0.0025071862539276283, "phrase": "\"ideal\"_candidate"}, {"score": 0.002183938718432764, "phrase": "\"pilot_test"}, {"score": 0.0021049977753042253, "phrase": "market_segment"}], "paper_keywords": ["Fuzzy sets", " distance", " resource selection", " pilot test", " subjective information marketing"], "paper_abstract": "In this paper, we present a tool to help reduce the uncertainty presented in the resource selection problem when information is subjective in nature. The candidates and the \"ideal\" resource required by evaluators are modeled by fuzzy subsets whose elements are trapezoidal fuzzy numbers (TrFN). By modeling with TrFN the subjective variables used to determine the best among a set of resources, one should take into account in the decision-making process not only their expected value, but also the uncertainty that they express. A mean quadratic distance (MQD) function is defined to measure the separation between two TrFN. It allows us to consider the case when a TrFN is wholly or partially contained in another. Then, for each candidate a weighted mean asymmetric index (WMAI) evaluates the mean distance between the TrFNs for each of the variables and the corresponding TrFNs of the \"ideal\" candidate, allowing the decision-maker to choose among the candidates. We apply this index to the case of the selection of the product that is best suited for a \"pilot test\" to be carried out in some market segment.", "paper_title": "An Asymmetric Index to Compare Trapezoidal Fuzzy Numbers", "paper_id": "WOS:000340077000018"}