{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "energy-constrained_parallel_applications"}, {"score": 0.004741845603430361, "phrase": "moore's_law_scaling"}, {"score": 0.004646088032529303, "phrase": "transistor_density"}, {"score": 0.004598933498016774, "phrase": "technology_generation"}, {"score": 0.004552255360140208, "phrase": "supply_voltage_reduction"}, {"score": 0.004392565073466714, "phrase": "power_density"}, {"score": 0.004347972379250724, "phrase": "total_energy"}, {"score": 0.0042819270655224916, "phrase": "conventional_microprocessors"}, {"score": 0.004195418010131832, "phrase": "future_processors"}, {"score": 0.003906116922372891, "phrase": "massive_amount"}, {"score": 0.0035997452281985465, "phrase": "near-threshold_supply_domain"}, {"score": 0.003403122817578447, "phrase": "dynamic_energy_consumption"}, {"score": 0.0028170314398963704, "phrase": "severe_process_variability"}, {"score": 0.0027600360731762997, "phrase": "extremely_large_delay_variations"}, {"score": 0.0024414225109100672, "phrase": "expected_large_delay_variations"}, {"score": 0.0023798115577749225, "phrase": "circuit_simulations"}], "paper_keywords": [""], "paper_abstract": "While Moore's law scaling continues to double transistor density every technology generation, supply voltage reduction has essentially stopped, increasing both power density and total energy consumed in conventional microprocessors. Therefore, future processors will require an architecture that can: a) take advantage of the massive amount of transistors that will be available; and b) operate these transistors in the near-threshold supply domain, thereby achieving near optimal energy/computation by balancing the leakage and dynamic energy consumption. Unfortunately, this optimality is typically achieved while running at very low frequencies (i.e. 0.1 - 10MHz) and with only one computation executing per cycle, such that performance is limited. Further, near-threshold designs suffer from severe process variability that can introduce extremely large delay variations. In this paper, we propose a near energy-optimal, stream processor family that relies on massively parallel, near-threshold VLSI circuits and interconnect, incorporating cooperative circuit/architecture techniques to tolerate the expected large delay variations. Initial estimations from circuit simulations show that it is possible to achieve greater than 1 Giga-Operations per second (1GOP/s) with less than 1mW total power consumption, enabling a new class of energy-constrained, high-throughput computing applications.", "paper_title": "Synctium: a Near-Threshold Stream Processor for Energy-Constrained Parallel Applications", "paper_id": "WOS:000288081600006"}