{"auto_keywords": [{"score": 0.030311084376533765, "phrase": "large-sized_test_problems"}, {"score": 0.013820796052661266, "phrase": "robot_moves"}, {"score": 0.008826237815103543, "phrase": "optimal_solution"}, {"score": 0.007753480630444674, "phrase": "lower_bound"}, {"score": 0.00481495049065317, "phrase": "sequence-dependent_setup_times"}, {"score": 0.004652016085325825, "phrase": "new_and_practical_two-machine_robotic_cell_scheduling_problem"}, {"score": 0.004084510791138056, "phrase": "total_cycle_time"}, {"score": 0.004037877545494505, "phrase": "proposed_problem"}, {"score": 0.003946999587586799, "phrase": "np"}, {"score": 0.0036413370053909886, "phrase": "input_parameters"}, {"score": 0.0035997452281985465, "phrase": "dominance_condition"}, {"score": 0.0035179764329354877, "phrase": "optimal_sequence"}, {"score": 0.0027741761880779535, "phrase": "medium-_and_large-sized_test_problems"}, {"score": 0.0026596472456182707, "phrase": "milp_model"}, {"score": 0.002540078552743003, "phrase": "proposed_sa"}, {"score": 0.0024918548761791435, "phrase": "taguchi_technique"}, {"score": 0.0021705796895687864, "phrase": "sa_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Robotic cell scheduling", " Sequence-dependent setup times", " Mixed-integer linear programming", " Simulated annealing", " Branch and bound", " Taguchi"], "paper_abstract": "In this paper, we introduce a new and practical two-machine robotic cell scheduling problem with sequence-dependent setup times (2RCSDST) along with different loading/unloading times for each part. Our objective is to simultaneously determine the sequence of robot moves and the sequence of parts that minimize the total cycle time. The proposed problem is proven to be strongly NP-hard. Using the Gilmore and Gomory (GnG) algorithm, a polynomial-time computable lower bound is provided. Based on the input parameters, a dominance condition is developed to determine the optimal sequence of robot moves for a given sequence of parts. A mixed-integer linear programming (MILP) model is provided and enhanced using a valid inequality based on the given dominance condition. In addition, a branch and bound (BnB) algorithm is exploited to solve the problem, and due to the NP-hardness, an improved simulated annealing (SA) algorithm is proposed to address large-sized test problems. All the solution methods are evaluated using small-, medium- and large-sized test problems. The numerical results indicate that the optimal solution of the MILP model is attained for the medium- and some large-sized test problems, and the proposed SA, tuned using the Taguchi technique, provides an acceptable, near-optimal solution with markedly reduced CPU time. Moreover, the lower bound is observed to be significantly near the optimal solution. Thus, this lower bound is exploited to validate the results of the SA algorithm for large-sized test problems. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Two-machine robotic cell scheduling problem with sequence-dependent setup times", "paper_id": "WOS:000317165200025"}