{"auto_keywords": [{"score": 0.030888139026237965, "phrase": "scanindex"}, {"score": 0.012512903172804787, "phrase": "similarity_scores"}, {"score": 0.00860527843537089, "phrase": "individual_attributes"}, {"score": 0.00481495049065317, "phrase": "multiple_attributes"}, {"score": 0.004591466267316524, "phrase": "k_records"}, {"score": 0.004175006647851034, "phrase": "similarity_score"}, {"score": 0.004084372444216856, "phrase": "query_record"}, {"score": 0.004039792863335641, "phrase": "individual_attribute"}, {"score": 0.003995697901740734, "phrase": "specific_similarity_function"}, {"score": 0.003908940988435398, "phrase": "aggregate_function"}, {"score": 0.003754731210715724, "phrase": "aggregated_value"}, {"score": 0.003476963781647026, "phrase": "greatest_similarities"}, {"score": 0.003315374849824563, "phrase": "computational_cost"}, {"score": 0.0022734117274137468, "phrase": "experimental_results"}, {"score": 0.0022158306933307685, "phrase": "naive_approach"}, {"score": 0.002104999186027529, "phrase": "td."}], "paper_keywords": ["top-K queries", " approximate search", " data quality"], "paper_abstract": "In this paper, we study the problem of efficiently identifying K records that are most similar to a given query record, where the similarity is defined as: (1) for each record, we calculate the similarity score between the record and the query record over each individual attribute using a specific similarity function; (2) an aggregate function is utilized to combine these similarity scores with weights and the aggregated value is served as the similarity of the record. After similarities of all records have been computed, K records with the greatest similarities can further be identified. Under this framework, unfortunately, the computational cost will be extremely expensive when the cardinality of relation is large as computation of similarity for each record is required. As a result, in this paper, we propose two efficient algorithms, named ScanIndex and Top-Down (TD for short), to cope with this problem. With respect to ScanIndex, similarity scores that are equal to zero over individual attributes are free from computation. Based on ScanIndex, with respect to TD, similarity scores less than thresholds (rather than zero) over individual attributes are skipped, where these thresholds are improved dynamically over time. Experimental results demonstrate that, comparing with the naive approach, the performance can be improved by two orders of magnitude using ScanIndex and TD.", "paper_title": "Efficient top-K approximate searches against a relation with multiple attributes", "paper_id": "WOS:000294558800005"}