{"auto_keywords": [{"score": 0.04820613313024096, "phrase": "ic"}, {"score": 0.01554138997223875, "phrase": "taxonomic_knowledge"}, {"score": 0.0046797114400479135, "phrase": "information_content"}, {"score": 0.003877211065759289, "phrase": "concept_appearance_probabilities"}, {"score": 0.0034789831290103967, "phrase": "previous_approaches"}, {"score": 0.0030164423559955896, "phrase": "new_model"}, {"score": 0.002706383680762465, "phrase": "related_works"}, {"score": 0.0026003455833291124, "phrase": "semantic_evidences"}, {"score": 0.0024700776739384977, "phrase": "authors'_approach"}, {"score": 0.002373276186210053, "phrase": "well-known_semantic_similarity_measures"}, {"score": 0.0022933216359142736, "phrase": "standard_benchmarks"}, {"score": 0.0021784009230363627, "phrase": "authors'_model"}], "paper_keywords": ["Computational Linguistics", " Information Content", " Knowledge Management", " Ontologies", " Semantic Similarity"], "paper_abstract": "The Information Content (IC) of a concept quantifies the amount of information it provides when appearing in a context. In the past, IC used to be computed as a function of concept appearance probabilities in corpora, but corpora-dependency and data sparseness hampered results. Recently, some other authors tried to overcome previous approaches, estimating IC from the knowledge modeled in an ontology. In this paper, the authors develop this idea, by proposing a new model to compute the IC of a concept exploiting the taxonomic knowledge modeled in an ontology. In comparison with related works, their proposal aims to better capture semantic evidences found in the ontology. To test the authors' approach, they have applied it to well-known semantic similarity measures, which were evaluated using standard benchmarks. Results show that the use of the authors' model produces, in most cases, more accurate similarity estimations than related works.", "paper_title": "A New Model to Compute the Information Content of Concepts from Taxonomic Knowledge", "paper_id": "WOS:000312931500002"}