{"auto_keywords": [{"score": 0.025549853870762477, "phrase": "proposed_method"}, {"score": 0.015719716506582538, "phrase": "multi-linear_subspace_analysis"}, {"score": 0.004600389726895716, "phrase": "individual's_facial_appearance"}, {"score": 0.004271843728776305, "phrase": "forensic_medicine"}, {"score": 0.003966667994579941, "phrase": "statistical_learning_based_method"}, {"score": 0.0037042817107563785, "phrase": "craniofacial_shape_variation"}, {"score": 0.003559284776569813, "phrase": "different_local_regions"}, {"score": 0.0033619033669956317, "phrase": "face_skin"}, {"score": 0.0031754329320561317, "phrase": "craniofacial_subspace_features"}, {"score": 0.002849084541088137, "phrase": "bmi"}, {"score": 0.002753138528582461, "phrase": "unknown_skull"}, {"score": 0.0026302120935562568, "phrase": "learned_mapping"}, {"score": 0.0025416235470290286, "phrase": "skin_tensor_model"}, {"score": 0.0023064582783867645, "phrase": "shape_relationship"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Multi-linear subspace analysis", " Partial least squares regression", " Craniofacial reconstruction"], "paper_abstract": "Craniofacial reconstruction aims to estimate an individual's facial appearance from its skull. It can be applied in many multimedia services such as forensic medicine, archaeology, face animation etc. In this paper, a statistical learning based method is proposed for 3D craniofacial reconstruction. In order to well represent the craniofacial shape variation and better utilize the relevance between different local regions, two tensor models are constructed for the skull and the face skin respectively, and multi-linear subspace analysis is used to extract the craniofacial subspace features. A partial least squares regression (PLSR) based mapping from skull subspace to skin subspace is established with the attributes such as age and BMI being considered. For an unknown skull, the 3D face skin is reconstructed using the learned mapping with the help of the skin tensor model. Compared with some other statistical learning based method in literature, the proposed method more directly and properly reflects the shape relationship between the skull and the face. In addition, the proposed method has little manual intervention. Experimental results show that the proposed method is valid.", "paper_title": "Craniofacial reconstruction based on multi-linear subspace analysis", "paper_id": "WOS:000343080700011"}