{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single-stage_production_system"}, {"score": 0.025248171746263842, "phrase": "signed_distance_method"}, {"score": 0.023892013599887286, "phrase": "gmir_method"}, {"score": 0.004666598697538815, "phrase": "fuzzy_environment"}, {"score": 0.004494570360108983, "phrase": "lot_size_model"}, {"score": 0.003965468669507077, "phrase": "demand_rate"}, {"score": 0.0035648266669315943, "phrase": "triangular_fuzzy_numbers"}, {"score": 0.0034984340449789745, "phrase": "fuzzified_total_cost_function"}, {"score": 0.0029169007179202164, "phrase": "numerical_example"}, {"score": 0.002431797888365548, "phrase": "optimal_lot_size"}, {"score": 0.0021049977753042253, "phrase": "total_costs"}], "paper_keywords": ["Lot sizing", " fuzzy set theory", " graded mean integration representation method", " signed distance method", " rework process", " single-stage production system"], "paper_abstract": "This paper develops a lot size model for a single-stage production system producing defective items that need to be reworked. Because the rate of defectives and the demand rate are usually not known precisely in practice, we fuzzify both rates with the help of triangular fuzzy numbers. The fuzzified total cost function, which considers setup, inventory carrying, and processing costs is defuzzified using two popular defuzzifying techniques, namely the signed distance and the graded mean integration representation (GMIR) methods. For the defuzzified total cost function, optimal lot sizes are calculated. A numerical example is then provided to illustrate the results of the model, and the results that were obtained by the two defuzzification methods are compared. The results indicate that the optimal lot size obtained by the signed distance method is larger than the one obtained by the GMIR method. In addition, the results show that the total costs obtained using the GMIR method are higher than those obtained by the signed distance method.", "paper_title": "Optimal manufacturing lot size for a single-stage production system with rework in a fuzzy environment", "paper_id": "WOS:000345981600031"}