{"auto_keywords": [{"score": 0.0409303070249204, "phrase": "chaotic_system"}, {"score": 0.004719609114608853, "phrase": "lorenz"}, {"score": 0.004269630481719451, "phrase": "general_use"}, {"score": 0.004164007198843467, "phrase": "chaotic_operation_mode"}, {"score": 0.003729335910488339, "phrase": "secure_codification"}, {"score": 0.002858952758523772, "phrase": "traditional_algorithms"}, {"score": 0.0027602925235474317, "phrase": "numerical_experiments"}, {"score": 0.002496722870659199, "phrase": "fast_version"}, {"score": 0.002386489708339451, "phrase": "aes"}, {"score": 0.0021369416775353107, "phrase": "general_purpose_cryptography_applications"}, {"score": 0.0021049977753042253, "phrase": "internet_page"}], "paper_keywords": ["Encryption/decription", " chaos", " Lorenz's attractor", " nonlinear systems"], "paper_abstract": "A novel cryptography method based on the Lorenz's attractor chaotic system is presented. The proposed algorithm is secure and fast, making it practical for general use. We introduce the chaotic operation mode, which provides an interaction among the password, message and a chaotic system. It ensures that the algorithm yields a secure codification, even if the nature of the chaotic system is known. The algorithm has been implemented in two versions: one sequential and slow and the other, parallel and fast. Our algorithm assures the integrity of the ciphertext (we know if it has been altered, which is not assured by traditional algorithms) and consequently its authenticity. Numerical experiments are presented, discussed and show the behavior of the method in terms of security and performance. The fast version of the algorithm has a performance comparable to AES, a popular cryptography program used commercially nowadays, but it is more secure, which makes it immediately suitable for general purpose cryptography applications. An internet page has been set up, which enables the readers to test the algorithm and also to try to break into the cipher.", "paper_title": "FAST, PARALLEL AND SECURE CRYPTOGRAPHY ALGORITHM USING LORENZ'S ATTRACTOR", "paper_id": "WOS:000278088500005"}