{"auto_keywords": [{"score": 0.04014843959765129, "phrase": "monadic_logic"}, {"score": 0.03780999217534513, "phrase": "temporal_logics"}, {"score": 0.03623869198838893, "phrase": "prescribed_time"}, {"score": 0.028660843917288854, "phrase": "temporal_logic"}, {"score": 0.028355657671382793, "phrase": "truth_tables"}, {"score": 0.00481495049065317, "phrase": "common_metric_temporal_logic"}, {"score": 0.00442660986903627, "phrase": "pnueli"}, {"score": 0.004362326712297089, "phrase": "finite_temporal_logic"}, {"score": 0.004099340908974491, "phrase": "optimal_decidable_metric_logic"}, {"score": 0.004039792863335641, "phrase": "infinitely_many_modalities"}, {"score": 0.0039665679106594106, "phrase": "different_formalism"}, {"score": 0.003838078705946304, "phrase": "second_order"}, {"score": 0.003351987298847214, "phrase": "punctual_event"}, {"score": 0.002853183476661506, "phrase": "continuous_time"}, {"score": 0.002290135975651888, "phrase": "decidable_satisfiability_problem"}], "paper_keywords": [""], "paper_abstract": "The common metric temporal logic for continuous time were shown to be insufficient, when it was proved that they cannot express a modality suggested by Pnueli. Moreover no finite temporal logic can express all the natural generalizations of this modality. It followed that if we look for an optimal decidable metric logic we must accept infinitely many modalities, or adopt a different formalism. Here we identify a fragment of the second order monadic logic of order with the \"+ 1\" function, that expresses all the Pnueli modalities and much more. Its main advantage over the temporal logics is that it enables us to say not just that within prescribed time there is a point where some punctual event will occur, but also that within prescribed time some process that starts now (or that started before, or that will start soon) will terminate. We prove that this logic is decidable with respect to satisfiability and validity, over continuous time. The proof depends heavily on the theory of compositionality. In particular every temporal logic that has truth tables in this logic is automatically decidable. We extend this result by proving that any temporal logic, that has all its modalities defined by means more general than truth tables, in a logic stronger than the one just described, has a decidable satisfiability problem. We suggest that this monadic logic can be the framework in which temporal logics can be safely defined, with the guarantee that their satisfiability problem is decidable. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Decidable metric logics", "paper_id": "WOS:000262457200004"}