{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recent_advances"}, {"score": 0.004653339900995785, "phrase": "multidimensional_multiple_choice_knapsack_problems"}, {"score": 0.004466519142879166, "phrase": "rather_large_problem_instances"}, {"score": 0.003976775340098895, "phrase": "new_methods"}, {"score": 0.0038695436922618876, "phrase": "comprehensive_benchmark_instances"}, {"score": 0.0037395458116642306, "phrase": "special_correlation_properties"}, {"score": 0.003195414285736136, "phrase": "existing_exact_algorithm"}, {"score": 0.0028641729745364952, "phrase": "weakly_or_strongly_correlated_cases"}, {"score": 0.002748984715897838, "phrase": "similar_set"}, {"score": 0.002430411367515404, "phrase": "instance_groups"}, {"score": 0.002364777610365689, "phrase": "hard_instances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multidimensional", " Multiple choice", " Knapsack problem", " Algorithm", " Performance evaluation"], "paper_abstract": "Recent advances in algorithms for the multidimensional multiple choice knapsack problems have enabled us to solve rather large problem instances. However, these algorithms are evaluated with very limited benchmark instances. In this study, we propose new methods to systematically generate comprehensive benchmark instances. Some instances with special correlation properties between parameters are found to be several orders of magnitude harder than those currently used for benchmarking the algorithms. Experiments on an existing exact algorithm and two generic solvers show that instances whose weights are uncorrelated with the profits are easier compared with weakly or strongly correlated cases. Instances with classes containing similar set of profits for items and with weights strongly correlated to the profits are the hardest among all instance groups investigated. These hard instances deserve further study and understanding their properties may shed light to better algorithms. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Hard multidimensional multiple choice knapsack problems, an empirical study", "paper_id": "WOS:000270630100017"}