{"auto_keywords": [{"score": 0.045881615499481956, "phrase": "social_psychology"}, {"score": 0.04564545201636961, "phrase": "online_interaction"}, {"score": 0.036236184849108656, "phrase": "first_study"}, {"score": 0.03163342118633492, "phrase": "blog_corpus"}, {"score": 0.00481495049065317, "phrase": "blog_writing"}, {"score": 0.004750597411562959, "phrase": "rapid_development"}, {"score": 0.004687100377432172, "phrase": "social_networking_tool"}, {"score": 0.004208618307314636, "phrase": "online_domain"}, {"score": 0.004163531538667519, "phrase": "appropriate_use"}, {"score": 0.004063837272072844, "phrase": "community_building"}, {"score": 0.003861111257449031, "phrase": "large_number"}, {"score": 0.003840366634191312, "phrase": "novel_research_questions"}, {"score": 0.003658591144369006, "phrase": "personality_influences"}, {"score": 0.0035136783150077175, "phrase": "personality_research_literature"}, {"score": 0.003476010424393516, "phrase": "two-part_experiment"}, {"score": 0.003420261789594412, "phrase": "eight_participants"}, {"score": 0.0032670996052464, "phrase": "second_study"}, {"score": 0.0031716573469516055, "phrase": "blog_texts"}, {"score": 0.003078994644402931, "phrase": "personality_questionnaire"}, {"score": 0.0030295940341691203, "phrase": "blog_text_author"}, {"score": 0.0027941961109477997, "phrase": "well-established_social_rule"}, {"score": 0.0027567761303683683, "phrase": "real-life_interaction"}, {"score": 0.002626154851822891, "phrase": "blog_environment"}, {"score": 0.0025840009505256373, "phrase": "feather_flock"}, {"score": 0.002501707130971532, "phrase": "writer's_personality"}, {"score": 0.0024748609903955656, "phrase": "online_personality"}, {"score": 0.0024417070865579765, "phrase": "linguistic_cues"}, {"score": 0.0023895799632294586, "phrase": "personal_journal"}, {"score": 0.002325979556988998, "phrase": "author_personality_traits"}, {"score": 0.002239766348597362, "phrase": "important_determinant"}, {"score": 0.002156741753559494, "phrase": "social_network_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blogs", " Personality theory", " Interpersonal attraction", " Computer-mediated communication", " Blog genre"], "paper_abstract": "The rapid development of blogs as a social networking tool has greatly increased the number of people who are expressing themselves in text published online. As yet little is known about the social psychology of online interaction using recently developed Web 2.0 functionalities. To what extent do principles of social psychology carry over into the online domain and how can appropriate use of those principles assist in activities such as community building, e-commerce, marketing, and personalization of services? There would seem to be a large number of novel research questions that can be posed with respect to online interaction. One pertinent question concerns the extent to which compatibility of personality influences online interaction. We investigated this question in terms of hypotheses derived from the personality research literature, using a two-part experiment. In the first study, eight participants wrote blogs in two distinct genres (personal diaries and commentaries) and rated their own personalities. In the second study 12 different participants judged the personality of authors as implied in the blog texts created in the first study. Those participants also completed a personality questionnaire and rated their attraction to the blog text author. Readers of the blog corpus were able to consistently judge the personality of the writers based solely on the text that they wrote. Moreover, they followed a well-established social rule regarding interpersonal attraction in real-life interaction. Blog readers were significantly more attracted to blog writers with more similar personalities offering support that in a blog environment, \"birds of a feather flock together.\" Emotion word use in the blog corpus correlated with writer's personality, suggesting that online personality may be signalled by linguistic cues. The two most popular genres of blog writing, personal journal and commentary, differed in how accurately readers judged author personality traits. Based on the results obtained it is suggested that personality is an important determinant and that further research on how people communicate with blogs will be relevant to social network analysis and to marketing. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Birds of a feather: How personality influences blog writing and reading", "paper_id": "WOS:000279564300004"}