{"auto_keywords": [{"score": 0.048603687852811175, "phrase": "interactive_problem"}, {"score": 0.04523052527830738, "phrase": "mathema"}, {"score": 0.043891862951523725, "phrase": "senior_high_school_students"}, {"score": 0.00481495049065317, "phrase": "adaptive_educational_hypermedia_system_mathema."}, {"score": 0.004466519142879166, "phrase": "mathema."}, {"score": 0.004410938507689426, "phrase": "general_goal"}, {"score": 0.004066076430818046, "phrase": "higher_education"}, {"score": 0.003965468669507077, "phrase": "interactive_and_constructivist_environment"}, {"score": 0.0035648266669315943, "phrase": "learning_difficulties"}, {"score": 0.0034118234596993836, "phrase": "related_work"}, {"score": 0.0032858981413454802, "phrase": "didactic_design_principles"}, {"score": 0.0029169007179202164, "phrase": "electromagnetism_problems"}, {"score": 0.002509284173541882, "phrase": "didactic_approaches"}, {"score": 0.0024625017739528096, "phrase": "experimental_study"}], "paper_keywords": ["Adaptive educational hypermedia", " interactive problem solving", " learning styles", " misconceptions"], "paper_abstract": "This paper describes the interactive problem solving support offered by our adaptive educational hypermedia system called MATHEMA. The general goal of the MATHEMA is the support of senior high school students or the beginners of higher education, through an interactive and constructivist environment, in learning physics (electromagnetism) individually and/or collaboratively, and to overcome their possible misconceptions and learning difficulties. Initially, a review of related work about the implemented AEHS/ITS and the didactic design principles of the MATHEMA are presented. Through the interactive problem solving, the system supports the students in solving electromagnetism problems, individually and/or collaboratively, by following an activity that is based on the experimentation with simulations, explorations, guided discovery, and collaboration didactic approaches. An experimental study with senior high school students showed that they improve their performances when following this activity. A questionnaire that we gave to the students to express their opinion about our system helped us to improve the quality of the courses.", "paper_title": "Interactive Problem Solving Support in the Adaptive Educational Hypermedia System MATHEMA", "paper_id": "WOS:000207848000004"}