{"auto_keywords": [{"score": 0.0328973830323921, "phrase": "existing_moaco_algorithms"}, {"score": 0.02480826479192901, "phrase": "moaco_algorithms"}, {"score": 0.023610098837608288, "phrase": "automatic_algorithm_configuration_techniques"}, {"score": 0.0047709540557306284, "phrase": "multiobjective_optimization_problems"}, {"score": 0.004473982381245469, "phrase": "pareto_optimality_principle"}, {"score": 0.004412780054037622, "phrase": "partial_order"}, {"score": 0.004138010495069077, "phrase": "nondominated_solutions"}, {"score": 0.004062682236016889, "phrase": "single_one"}, {"score": 0.0036553076010367863, "phrase": "moaco"}, {"score": 0.0035887342563437935, "phrase": "different_design_choices"}, {"score": 0.003459191419478298, "phrase": "multiobjective_context"}, {"score": 0.003334309053314909, "phrase": "algorithmic_components"}, {"score": 0.0030695103543472908, "phrase": "equivalent_design_choices"}, {"score": 0.0029722900280316216, "phrase": "different_terms"}, {"score": 0.00283870598459543, "phrase": "flexible_algorithmic_framework"}, {"score": 0.002427732996314194, "phrase": "new_moaco_algorithm"}, {"score": 0.00226583335721762, "phrase": "proposed_moaco_framework"}, {"score": 0.0021342613107011624, "phrase": "paper_show"}, {"score": 0.0021049977753042253, "phrase": "automatically_configured_moaco_framework"}], "paper_keywords": ["Ant colony optimization (ACO)", " automatic algorithm configuration", " multiobjective optimization", " traveling salesman problem"], "paper_abstract": "Multiobjective optimization problems are problems with several, typically conflicting, criteria for evaluating solutions. Without any a priori preference information, the Pareto optimality principle establishes a partial order among solutions, and the output of the algorithm becomes a set of nondominated solutions rather than a single one. Various ant colony optimization (ACO) algorithms have been proposed in recent years for solving such problems. These multiobjective ACO (MOACO) algorithms exhibit different design choices for dealing with the particularities of the multiobjective context. This paper proposes a formulation of algorithmic components that suffices to describe most MOACO algorithms proposed so far. This formulation also shows that existing MOACO algorithms often share equivalent design choices, but they are described in different terms. Moreover, this formulation is synthesized into a flexible algorithmic framework, from which not only existing MOACO algorithms may be instantiated, but also combinations of components that were never studied in the literature. In this sense, this paper goes beyond proposing a new MOACO algorithm, but it rather introduces a family of MOACO algorithms. The flexibility of the proposed MOACO framework facilitates the application of automatic algorithm configuration techniques. The experimental results presented in this paper show that the automatically configured MOACO framework outperforms the MOACO algorithms that inspired the framework itself. This paper is also among the first to apply automatic algorithm configuration techniques to multiobjective algorithms.", "paper_title": "The Automatic Design of Multiobjective Ant Colony Optimization Algorithms", "paper_id": "WOS:000314269000008"}