{"auto_keywords": [{"score": 0.03837133585425088, "phrase": "transition_curves"}, {"score": 0.0038737214010638745, "phrase": "inflection_endpoints"}, {"score": 0.003831801113154043, "phrase": "compound-rhythm_log-aesthetic_curves"}, {"score": 0.0034554281349858836, "phrase": "railroad_track_design"}, {"score": 0.003290237137651949, "phrase": "inflection_points"}, {"score": 0.003201890266327127, "phrase": "new_approach"}, {"score": 0.002675252546913683, "phrase": "similar_triangle"}, {"score": 0.0023346234464901978, "phrase": "circular_arc"}, {"score": 0.0022595316565074304, "phrase": "obtained_curves"}, {"score": 0.0021987994275190314, "phrase": "gear_design"}, {"score": 0.00217496508306238, "phrase": "fillet_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Log-aesthetic curve", " Multispiral", " Transition curve", " Fair curve", " High-quality curve", " Spiral"], "paper_abstract": "In this paper, we describe an algorithm for generating a C-shaped G(2) multispiral transition curve between two non-parallel straight lines. The G(2) multispiral is a curve that consists of two or more log-aesthetic curve segments connected with curvature continuity, and it has inflection endpoints. Compound-rhythm log-aesthetic curves are not directly applicable to the generation of transition curves between two straight lines, which is important in highway and railroad track design, because both endpoints are required to be inflection points. Thus, a new approach for generating transition curves is necessary. The two log-aesthetic curve segments with shape parameter alpha < 0 are connected at the origin, and they form a multispiral. The problem is to find a similar triangle, as in the given data. Depending on the parameter alpha, the G(2) multispiral transition curve may have different shapes; moreover, the shape of the curve approximates a circular arc as a decreases. The obtained curves also find applications in gear design and fillet modeling. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Fitting G(2) multispiral transition curve joining two straight lines", "paper_id": "WOS:000303290700007"}