{"auto_keywords": [{"score": 0.04549508303230704, "phrase": "gene_sets"}, {"score": 0.03441856679421127, "phrase": "standard_approach"}, {"score": 0.00481495049065317, "phrase": "over-represented_gene_ontology_annotations"}, {"score": 0.004592905436175987, "phrase": "improved_statistic"}, {"score": 0.0045122922461952805, "phrase": "over-represented_gene_ontology"}, {"score": 0.004253618550301311, "phrase": "current_methods"}, {"score": 0.0039626308903511764, "phrase": "go_hierarchy"}, {"score": 0.00387011040370557, "phrase": "parent-child_relationships"}, {"score": 0.002763261749602258, "phrase": "single_terms"}, {"score": 0.002620040660435039, "phrase": "receiver_operator_characteristics"}, {"score": 0.0024405312482831646, "phrase": "biological_dataset"}, {"score": 0.0023139986108451967, "phrase": "additional_computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "freely_available_ontologizer_application"}], "paper_keywords": [""], "paper_abstract": "We propose an improved statistic for detecting over-represented Gene Ontology (GO) annotations in gene sets. While the current methods treats each term independently and hence ignores the structure of the GO hierarchy, our approach takes parent-child relationships into account. Over-representation of a term is measured with respect to the presence of its parental terms in the set. This resolves the problem that the standard approach tends to falsely detect an over-representation of more specific terms below terms known to be over-represented. To show this, we have generated gene sets in which single terms are artificially over-represented and compared the receiver operator characteristics of the two approaches on these sets. A comparison on a biological dataset further supports our method. Our approach comes at no additional computational complexity when compared to the standard approach. An implementation is available within the framework of the freely available Ontologizer application.", "paper_title": "An improved statistic for detecting over-represented gene ontology annotations in gene sets", "paper_id": "WOS:000236991800009"}