{"auto_keywords": [{"score": 0.03766790381695943, "phrase": "tile_types"}, {"score": 0.015719716506582538, "phrase": "approximate_squares"}, {"score": 0.004521566043596533, "phrase": "d._thesis"}, {"score": 0.004441059405327222, "phrase": "mathematical_theory"}, {"score": 0.004414542249381157, "phrase": "crystal_aggregations"}, {"score": 0.004388182727039715, "phrase": "monomer_additions"}, {"score": 0.004322967486451877, "phrase": "emerging_science"}, {"score": 0.00429715240295033, "phrase": "dna_self-assembly"}, {"score": 0.004120694410890683, "phrase": "turing_universal_computation"}, {"score": 0.003987126862293129, "phrase": "canonical_problem"}, {"score": 0.003789137598068894, "phrase": "tam."}, {"score": 0.003371159698962328, "phrase": "required_approximate_dimensions"}, {"score": 0.003311067956326299, "phrase": "optimal_construction"}, {"score": 0.003081190713096043, "phrase": "modified_tile_assembly_model"}, {"score": 0.002981216610222911, "phrase": "concentration_programming_model"}, {"score": 0.0028758391869611374, "phrase": "non-zero_concentrations"}, {"score": 0.002741091312632307, "phrase": "highly_accurate_squares"}, {"score": 0.0025892330566358503, "phrase": "best_comparable_constructions"}, {"score": 0.0023381288193776778, "phrase": "na_parts"}, {"score": 0.0022019274077124795, "phrase": "lxl_square"}, {"score": 0.002188750508959063, "phrase": "optimal_assembly_time"}], "paper_keywords": ["Self-assembly", " Tile assembly model", " Program size complexity", " Approximation algorithms"], "paper_abstract": "The standard Tile Assembly Model (TAM) of Winfree (Algorithmic self-assembly of DNA, Ph.D. thesis, 1998) is a mathematical theory of crystal aggregations via monomer additions with applications to the emerging science of DNA self-assembly. Self-assembly under the rules of this model is programmable and can perform Turing universal computation. Many variations of this model have been proposed and the canonical problem of assembling squares has been studied extensively. We consider the problem of building approximate squares in TAM. Given any we show how to construct squares whose sides are within (1 +/-epsilon)N of any given positive integer N using tile types. We prove a matching lower bound by showing that tile types are necessary almost always to build squares of required approximate dimensions. In comparison, the optimal construction for a square of side exactly N in TAM uses tile types. The question of constructing approximate squares has been recently studied in a modified tile assembly model involving concentration programming. All our results are trivially translated into the concentration programming model by assuming arbitrary (non-zero) concentrations for our tile types. Indeed, the non-zero concentrations could be chosen by an adversary and our results would still hold. Our construction can get highly accurate squares using very few tile types and are feasible starting from values of N that are orders of magnitude smaller than the best comparable constructions previously suggested. At an accuracy of epsilon=0.01, the number of tile types used to achieve a square of size 10(7) is just 58 and our constructions are proven to work for all Na parts per thousand yen13130. If the concentrations of the tile types are carefully chosen, we prove that our construction assembles an LxL square in optimal assembly time O(L) where (1-epsilon)Na parts per thousand currency signLa parts per thousand currency sign(1+epsilon)N.", "paper_title": "Tile Complexity of Approximate Squares", "paper_id": "WOS:000315446700001"}