{"auto_keywords": [{"score": 0.04134567426628143, "phrase": "fit_profile"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004192730391924712, "phrase": "general_framework"}, {"score": 0.004160612392068268, "phrase": "future_cscl_research"}, {"score": 0.004003660777805554, "phrase": "research_framework"}, {"score": 0.003779223269006069, "phrase": "cscl."}, {"score": 0.003622642432563435, "phrase": "users'_learning_processes"}, {"score": 0.0034194902384248006, "phrase": "future_research"}, {"score": 0.003265175268104804, "phrase": "collaborative_learning_objective"}, {"score": 0.002931569771634119, "phrase": "cscl_technology"}, {"score": 0.0027458373015999916, "phrase": "learning_process"}, {"score": 0.002703869368554536, "phrase": "practical_implications"}, {"score": 0.0026218430041123164, "phrase": "cscl_applications"}, {"score": 0.0025521085778978042, "phrase": "important_research_area"}, {"score": 0.0021049977753042253, "phrase": "theory-based_research_framework"}], "paper_keywords": ["Learning methods", " Learning processes", " Computer based learning", " Computer-supported collaborative learning", " Collaborative learning technologies", " Group support systems", " Fit profile", " Research work"], "paper_abstract": "Purpose - The purpose of this paper is to propose a computer-supported collaborative learning (CSCL) research framework. Design/methodology/approach - The framework was developed from a review and synthesis of the literature. More specifically, gaps in the literature were identified and a general framework for future CSCL research was proposed. Findings - This paper proposes a research framework that identifies a fit profile between learning objectives, learning tasks, and technology in CSCL. The fit profile, in turn, is expected to influence users' learning processes and outcomes. Research limitations/implications - This framework can serve as a foundation for future research in CSCL. More specifically, research should give consideration to the collaborative learning objective and task, which will vary in degrees of complexity and cognitive demands. Also, researchers will want to evaluate the level of sophistication of the CSCL technology, as well as its appropriateness for a given objective and task, which ultimately influences the learning process and outcomes. Practical implications - Considerations and guidelines for development of CSCL applications are provided. Originality/value - CSCL is an important research area that has attracted the attention of researchers from various disciplines (e.g. information systems, educational psychology). However, the findings are varied and sometimes conflict with each other. By emphasizing a fit profile between learning objectives, learning tasks, and technology, this paper proposes a theory-based research framework to address the inconsistencies observed in the literature.", "paper_title": "Computer-supported collaborative learning: a research framework", "paper_id": "WOS:000318207100008"}