{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_social_networks"}, {"score": 0.004669085371587273, "phrase": "technology-enabled_relationship_tools"}, {"score": 0.004371160978838441, "phrase": "user-generated_content"}, {"score": 0.004003169429008801, "phrase": "product_and_service_recommendations"}, {"score": 0.00376409764683147, "phrase": "personal_communication"}, {"score": 0.003698442219929622, "phrase": "consumer_decisions"}, {"score": 0.003298631258267805, "phrase": "relationship_theories"}, {"score": 0.0031845067058084583, "phrase": "impact_relationship_characteristics"}, {"score": 0.0031151864044353245, "phrase": "osn_contacts"}, {"score": 0.002903311792572216, "phrase": "osn_contact's_recommendation"}, {"score": 0.0027417911324611917, "phrase": "excessive_posting_behavior"}, {"score": 0.002670296619878048, "phrase": "positive_impact"}, {"score": 0.002381365139274329, "phrase": "recommendation_trust"}], "paper_keywords": ["online social network", " trust", " personal relationship", " friendship", " recommendation", " similarity", " closeness", " past experience", " posting behavior"], "paper_abstract": "Online social networks (OSN) are technology-enabled relationship tools in which a user creates a profile, connects to other individuals, and shares user-generated content with them. One of the many features OSN offer is the ability to post messages in the form of product and service recommendations. Although word-of-mouth research has examined this type of personal communication to intentionally influence consumer decisions, limited understanding exists regarding when a user acts upon a recommendation received from one of their contacts. In this study, we draw on relationship theories and research on trust to analyze the impact relationship characteristics and behaviors of the OSN contacts have on trust in the recommendation that subsequently leads a user to act on this OSN contact's recommendation. The results of a survey of 116 OSN users showed that closeness, excessive posting behavior, and past recommendation experience have a positive impact on trust and intention to act on the recommendation. One characteristic of the relationships, that is, similarity, however, does not affect recommendation trust in the context of OSN. The findings enhance our understanding of relationships and their defining characteristics in OSN. The results also provide insights into how companies might leverage OSN in their marketing efforts.", "paper_title": "Forming an intention to act on recommendations given via online social networks", "paper_id": "WOS:000348095700006"}