{"auto_keywords": [{"score": 0.04714352860016274, "phrase": "covert_channels"}, {"score": 0.032545346393690326, "phrase": "pattern_variations"}, {"score": 0.00481495049065317, "phrase": "categorization_of_network_covert_channel_techniques"}, {"score": 0.004768378525561471, "phrase": "network_covert_channels"}, {"score": 0.004608879242346434, "phrase": "network_protocols"}, {"score": 0.003409057326528229, "phrase": "hierarchical_catalog"}, {"score": 0.003359647377874098, "phrase": "pattern_language"}, {"score": 0.0032156592392706567, "phrase": "future_covert_channel_novelty_evaluation"}, {"score": 0.00259554612218815, "phrase": "pattern-based_covert_channel_optimizations_pattern"}, {"score": 0.002436289099444074, "phrase": "pattern-based_countermeasures"}, {"score": 0.0023546121947302877, "phrase": "specific_channels"}, {"score": 0.002320449502337321, "phrase": "pattern-oriented_approach"}, {"score": 0.0022536005664642294, "phrase": "multiple_channels"}, {"score": 0.0022101055924375725, "phrase": "future_countermeasure_development"}, {"score": 0.0021049977753042253, "phrase": "real-world_protection"}], "paper_keywords": ["Security", " Covert channels", " information hiding", " taxonomy", " patterns", " PLML", " network security"], "paper_abstract": "Network covert channels are used to hide communication inside network protocols. Various techniques for covert channels have arisen in the past few decades. We surveyed and analyzed 109 techniques developed between 1987 and 2013 and show that these techniques can be reduced to only 11 different patterns. Moreover, the majority (69.7%) of techniques can be categorized into only four different patterns (i.e., most techniques we surveyed are similar). We represent the patterns in a hierarchical catalog using a pattern language. Our pattern catalog will serve as a base for future covert channel novelty evaluation. Furthermore, we apply the concept of pattern variations to network covert channels. With pattern variations, the context of a pattern can change. For example, a channel developed for IPv4 can automatically be adapted to other network protocols. We also propose the pattern-based covert channel optimizations pattern hopping and pattern combination. Finally, we lay the foundation for pattern-based countermeasures: whereas many current countermeasures were developed for specific channels, a pattern-oriented approach allows application of one countermeasure to multiple channels. Hence, future countermeasure development can focus on patterns, and the development of real-world protection against covert channels is greatly simplified.", "paper_title": "Pattern-Based Survey and Categorization of Network Covert Channel Techniques", "paper_id": "WOS:000354046600013"}