{"auto_keywords": [{"score": 0.030510836027086725, "phrase": "two-server_pake"}, {"score": 0.00481495049065317, "phrase": "password-authenticated_key_exchange"}, {"score": 0.004304574865291508, "phrase": "cryptographic_key"}, {"score": 0.003939033374807842, "phrase": "single_server"}, {"score": 0.0036553070575015344, "phrase": "even_insider_attack"}, {"score": 0.0029343128039167185, "phrase": "compromised_server"}, {"score": 0.0029069972482610403, "phrase": "current_solutions"}, {"score": 0.002445021071485221, "phrase": "symmetric_solution"}, {"score": 0.002344201345813952, "phrase": "different_cryptographic_keys"}, {"score": 0.0021750990136123367, "phrase": "existing_symmetric_two-server_pake_protocol"}, {"score": 0.0021049977753042253, "phrase": "existing_asymmetric_two-server_pake_protocols"}], "paper_keywords": ["Password-authenticated key exchange", " dictionary attack", " Diffie-Hellman key exchange", " ElGamal encryption"], "paper_abstract": "Password-authenticated key exchange (PAKE) is where a client and a server, who share a password, authenticate each other and meanwhile establish a cryptographic key by exchange of messages. In this setting, all the passwords necessary to authenticate clients are stored in a single server. If the server is compromised, due to, for example, hacking or even insider attack, passwords stored in the server are all disclosed. In this paper, we consider a scenario where two servers cooperate to authenticate a client and if one server is compromised, the attacker still cannot pretend to be the client with the information from the compromised server. Current solutions for two-server PAKE are either symmetric in the sense that two peer servers equally contribute to the authentication or asymmetric in the sense that one server authenticates the client with the help of another server. This paper presents a symmetric solution for two-server PAKE, where the client can establish different cryptographic keys with the two servers, respectively. Our protocol runs in parallel and is more efficient than existing symmetric two-server PAKE protocol, and even more efficient than existing asymmetric two-server PAKE protocols in terms of parallel computation.", "paper_title": "Efficient Two-Server Password-Only Authenticated Key Exchange", "paper_id": "WOS:000322516200007"}