{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fixed_time_horizon"}, {"score": 0.004658426838467567, "phrase": "fixed_length_ski_rental_problem"}, {"score": 0.004464602028530629, "phrase": "ski_season"}, {"score": 0.003784209997115174, "phrase": "additional_cost"}, {"score": 0.003475582268210954, "phrase": "current_non-negative_cost"}, {"score": 0.0030446120560494155, "phrase": "rental_cost"}, {"score": 0.0027567336518542858, "phrase": "rental_costs"}, {"score": 0.002580061425699194, "phrase": "mth_day"}, {"score": 0.002460825108719896, "phrase": "prior_notice"}, {"score": 0.0024146842687658467, "phrase": "optimal_online_algorithms"}, {"score": 0.002292199117499287, "phrase": "optimal_competitive_ratios"}, {"score": 0.0021049977753042253, "phrase": "mathematical_programs"}], "paper_keywords": ["Online problems", " Scheduling with rejection", " Competitive analysis"], "paper_abstract": "We study several variants of a fixed length ski rental problem and related scheduling problems with rejection. A ski season consists of m days, and an equipment of cost 1 is to be used during these days. The equipment can be bought on any day, in which case it can be used without any additional cost starting that day and until the vacation ends. On each day, the algorithm is informed with the current non-negative cost of renting the equipment. As long as the algorithm did not buy the equipment, it must rent it every day of the vacation, paying the rental cost of each day of rental. We consider the case of arbitrary, non-increasing, and non-decreasing rental costs. We consider the case where the season cannot end before the mth day, and the case that it can end without prior notice. We propose optimal online algorithms for all values of m for all variants. The optimal competitive ratios are either defined by solutions of equations (closed formulas or finite recurrences) or sets of mathematical programs, and tend to 2 as m grows.", "paper_title": "Rent or Buy Problems with a Fixed Time Horizon", "paper_id": "WOS:000349768700002"}