{"auto_keywords": [{"score": 0.005684242681468073, "phrase": "benchmarking_results"}, {"score": 0.00481495049065317, "phrase": "bestpeer"}, {"score": 0.004425215632459868, "phrase": "corporate_network"}, {"score": 0.004251728624599691, "phrase": "participating_companies"}, {"score": 0.004048860957751714, "phrase": "common_interest"}, {"score": 0.0037209035703970705, "phrase": "inter-company_data_sharing"}, {"score": 0.0036553070575015344, "phrase": "unique_challenges"}, {"score": 0.0032706520949775065, "phrase": "elastic_data"}, {"score": 0.0032129675521135616, "phrase": "corporate_network_applications"}, {"score": 0.0027865506182608263, "phrase": "data_sharing_services"}, {"score": 0.0027131212233443137, "phrase": "widely_accepted_pay-as-you-go_business_model"}, {"score": 0.0025153849593038484, "phrase": "hadoopdb"}, {"score": 0.002290858045013009, "phrase": "typical_corporate_network_workloads"}, {"score": 0.0021910825909008946, "phrase": "linear_scalability"}, {"score": 0.0021049977753042253, "phrase": "peer_nodes"}], "paper_keywords": ["Peer-to-peer systems", " cloud computing", " MapReduce", " query processing", " index"], "paper_abstract": "The corporate network is often used for sharing information among the participating companies and facilitating collaboration in a certain industry sector where companies share a common interest. It can effectively help the companies to reduce their operational costs and increase the revenues. However, the inter-company data sharing and processing poses unique challenges to such a data management system including scalability, performance, throughput, and security. In this paper, we present BestPeer++, a system which delivers elastic data sharing services for corporate network applications in the cloud based on BestPeer-a peer-to-peer (P2P) based data management platform. By integrating cloud computing, database, and P2P technologies into one system, BestPeer++ provides an economical, flexible and scalable platform for corporate network applications and delivers data sharing services to participants based on the widely accepted pay-as-you-go business model. We evaluate BestPeer++ on Amazon EC2 Cloud platform. The benchmarking results show that BestPeer++ outperforms HadoopDB, a recently proposed large-scale data processing system, in performance when both systems are employed to handle typical corporate network workloads. The benchmarking results also demonstrate that BestPeer++ achieves near linear scalability for throughput with respect to the number of peer nodes.", "paper_title": "BestPeer plus plus : A Peer-to-Peer Based Large-Scale Data Processing Platform", "paper_id": "WOS:000340205000003"}