{"auto_keywords": [{"score": 0.04855239486253465, "phrase": "fuzzy_sets"}, {"score": 0.00481495049065317, "phrase": "alpha-plane_representation_theory"}, {"score": 0.004586531354697466, "phrase": "mathematical_tools"}, {"score": 0.004392565073466714, "phrase": "data_analysis"}, {"score": 0.004345363360869553, "phrase": "traditional_rough_set_theory"}, {"score": 0.004252469672259375, "phrase": "crisp_environments"}, {"score": 0.004094639048362357, "phrase": "rough_sets"}, {"score": 0.0038168424095396205, "phrase": "fuzzy_rough_sets"}, {"score": 0.003695040819303525, "phrase": "fuzzy_set"}, {"score": 0.0036553070575015344, "phrase": "additional_degree"}, {"score": 0.0034442607586033657, "phrase": "highly_uncertainties"}, {"score": 0.002928399649340438, "phrase": "-plane_representation_method"}, {"score": 0.0027443174539994925, "phrase": "computational_workload"}, {"score": 0.0026710653215026685, "phrase": "aforementioned_accomplishments"}, {"score": 0.0024628046987344846, "phrase": "-plane_representation_theory"}, {"score": 0.002410058288617039, "phrase": "basic_properties"}, {"score": 0.002246292543825748, "phrase": "fuzzy_rough_upper_and_lower_approximation_operators"}, {"score": 0.0021510820434023207, "phrase": "axiomatic_approach"}], "paper_keywords": ["General type-2 fuzzy sets", " Rough sets", " Approximation operators", " General type-2 fuzzy relations", " alpha-Plane"], "paper_abstract": "Rough sets theory and fuzzy sets theory are mathematical tools to deal with uncertainty, imprecision in data analysis. Traditional rough set theory is restricted to crisp environments. Since theories of fuzzy sets and rough sets are distinct and complementary on dealing with uncertainty, the concept of fuzzy rough sets has been proposed. Type-2 fuzzy set provides additional degree of freedom, which makes it possible to directly handle highly uncertainties. Some researchers proposed interval type-2 fuzzy rough sets by combining interval type-2 fuzzy sets and rough sets. However, there are no reports about combining general type-2 fuzzy sets and rough sets. In addition, the -plane representation method of general type-2 fuzzy sets has been extensively studied, and can reduce the computational workload. Motivated by the aforementioned accomplishments, in this paper, from the viewpoint of constructive approach, we first present definitions of upper and lower approximation operators of general type-2 fuzzy sets by using -plane representation theory and study some basic properties of them. Furthermore, the connections between special general type-2 fuzzy relations and general type-2 fuzzy rough upper and lower approximation operators are also examined. Finally, in axiomatic approach, various classes of general type-2 fuzzy rough approximation operators are characterized by different sets of axioms.", "paper_title": "General type-2 fuzzy rough sets based on alpha-plane Representation theory", "paper_id": "WOS:000329975000003"}