{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "learner_modelling"}, {"score": 0.004607686390487483, "phrase": "natural_language_technologies"}, {"score": 0.004562847483469705, "phrase": "database_manipulation"}, {"score": 0.004518442937844318, "phrase": "educational_theories"}, {"score": 0.004198839649063847, "phrase": "intelligent_tutoring_system"}, {"score": 0.0036792371574197826, "phrase": "conversational_agent"}, {"score": 0.003319830633865628, "phrase": "natural_language"}, {"score": 0.003192312493850036, "phrase": "metacognitive_goals"}, {"score": 0.0029086869572567072, "phrase": "uk_educational_policy"}, {"score": 0.0027159094186967247, "phrase": "user_trial"}, {"score": 0.0023677483882740317, "phrase": "user_beliefs"}, {"score": 0.002333193766510394, "phrase": "learner_model"}, {"score": 0.0021891781017389783, "phrase": "research_and_experimentation_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["conversational agents", " chatbots", " open learner modelling", " negotiation", " natural language"], "paper_abstract": "This paper describes a system which incorporates natural language technologies, database manipulation and educational theories in order to offer learners a Negotiated Learner Model, for integration into an Intelligent Tutoring System. The system presents the learner with their learner model, offering them the opportunity to compare their own beliefs regarding their capabilities with those inferred by the system. A conversational agent, or \"chatbot\" has been developed to allow the learner to negotiate over the representations held about them using natural language. The system aims to support the metacognitive goals of self-assessment and reflection, which are increasingly seen as key to learning and are being incorporated into UK educational policy. The paper describes the design of the system, and reports a user trial, in which the chatbot was found to support users in increasing the accuracy of their self-assessments, and in reducing the number of discrepancies between system and user beliefs in the learner model. Some lessons learned in the development have been highlighted and future research and experimentation directions are outlined. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "CALMsystem: A conversational agent for learner modelling", "paper_id": "WOS:000254809500010"}