{"auto_keywords": [{"score": 0.0469988093233022, "phrase": "spanish_public_hospitals"}, {"score": 0.04332513984673763, "phrase": "web_site_adoption"}, {"score": 0.04181483232042558, "phrase": "web_sites"}, {"score": 0.03461617249114157, "phrase": "web_site"}, {"score": 0.034246554531909036, "phrase": "hospital_web_sites"}, {"score": 0.00481495049065317, "phrase": "spanish_public_hospital_web_sites"}, {"score": 0.004406994912939125, "phrase": "useful_information"}, {"score": 0.004310501708408856, "phrase": "hospital-patient_relationships"}, {"score": 0.003959706549088536, "phrase": "public_hospitals"}, {"score": 0.003584025547693836, "phrase": "internal_and_external_factors"}, {"score": 0.003557653536102669, "phrase": "web_site_adoption_mid_level"}, {"score": 0.0035054881943660096, "phrase": "logit_and_linear_regressions"}, {"score": 0.003378385493203297, "phrase": "findings_-_half"}, {"score": 0.0031845067058084583, "phrase": "information_dimension"}, {"score": 0.0030239842475439814, "phrase": "significant_improvements"}, {"score": 0.002860938351029155, "phrase": "determining_factor"}, {"score": 0.002706659627293686, "phrase": "external_factors"}, {"score": 0.002618104519194264, "phrase": "significant_factor"}, {"score": 0.0023869914500743083, "phrase": "health-related_information"}, {"score": 0.0022168460543913787, "phrase": "patient-care_provider_relationships"}, {"score": 0.0021049977753042253, "phrase": "empirical_study"}], "paper_keywords": ["Hospitals", " Web sites", " Information transfer", " Internet", " Customer orientation", " Spain"], "paper_abstract": "Purpose - The objective of this paper is twofold: first to determine to what extent Spanish public hospitals are using their web sites to provide useful information to users and to improve hospital-patient relationships, and second to determine which factors have an influence on web site adoption and level of development over time. Design/methodology/approach The web sites of public hospitals were searched for and analysed in 2005 and 2008. Their contents and features were scored using an 86-item checklist. Several hypotheses were proposed regarding the influence of internal and external factors on web site adoption mid level of development. Logit and linear regressions were conducted to test the Tin posed hypotheses. Findings - Half of the Spanish public hospitals do not have a web site. The hospital web sites were acceptable in the information dimension but should improve their interactive features, as well as their navigation and usability. No significant improvements were observed during the period analysed. The size of the hospitals was a determining factor for web site adoption and level of development in both years. However, from 2005 to 2008. external factors - in particular internet penetration - became a significant factor to explain the adoption and level of development of web sites. Practical implications - Citizens are increasingly relying on the internet to search for health-related information. Hospital managers should exploit the advantages of implementing and properly developing a web site in order to improve the patient-care provider relationships and offer citizens reliable in about healthcare. Originality/value - To date. no empirical study has analysed the factors that influence the implementation of hospital web sites or the evolution of their contents and quality over time.", "paper_title": "The unpromising quality and evollution of Spanish public hospital web sites", "paper_id": "WOS:000288877000006"}