{"auto_keywords": [{"score": 0.04292431658522854, "phrase": "end-to-end_delay"}, {"score": 0.00481495049065317, "phrase": "topology_control"}, {"score": 0.0047732596509542135, "phrase": "heterogeneous_wireless_multi-hop_networks"}, {"score": 0.004610058444728656, "phrase": "end-to-end_delay_minimization"}, {"score": 0.00443308765153716, "phrase": "wireless_multi-hop_networks"}, {"score": 0.004337710093279712, "phrase": "existing_eligibility"}, {"score": 0.00428146713705618, "phrase": "energy_efficiency"}, {"score": 0.00417115038996633, "phrase": "new_defined_metrics"}, {"score": 0.004135010810625326, "phrase": "fair_energy_consumption"}, {"score": 0.003773870856027139, "phrase": "node's_view_point"}, {"score": 0.00367658459781873, "phrase": "neighboring_nodes"}, {"score": 0.0027104535060134653, "phrase": "ldtc"}, {"score": 0.0026869447116525443, "phrase": "dts"}, {"score": 0.0025500402081330394, "phrase": "simulation_results"}, {"score": 0.0024306740161601625, "phrase": "minimized_imbalance_energy_reserve"}, {"score": 0.002357632753637638, "phrase": "existing_similar_works"}, {"score": 0.0021607883988873492, "phrase": "low_end-to-end_delay"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless multi-hop network", " Topology control", " Network lifetime", " Delay", " Optimization"], "paper_abstract": "The network lifetime maximization and the end-to-end delay minimization are tackled by jointly considering the two topology performance indexes in wireless multi-hop networks. Based on the existing eligibility metric for energy efficiency, as well as the new defined metrics for fair energy consumption and end-to-end delay, a new eligibility metric is modeled as psi(t)(up) (or psi(t)(down)). From a node's view point, the estimation over the neighboring nodes is made according to their psi(t)(up) (or psi(t)(down)). The Lifetime and Delay based localized Topology Control (LDTC) algorithm is proposed to construct the topology, in which each node keeps its k physical neighbors with maximum psi(t)(up) (or psi(t)(down)) as its logical neighbors. Then the Distributed Topology Symmetry (DTS) algorithm is proposed to enforce topology symmetry. Finally, we present the Distributed Logical Neighbor Adjustment (DLNA) algorithm, by which each node adjusts its logical neighbors during the interval between two successive executions of the LDTC and DTS algorithm in order to have nodes exhaust their energy fairly. The simulation results confirm that, under the most simulation settings, our topology control scheme has the minimized imbalance energy reserve and end-to-end delay when compared with the existing similar works. These results show that our topology control scheme suits to prolong the lifetime of the network and also satisfies the demand for low end-to-end delay. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Joint network lifetime and delay optimization for topology control in heterogeneous wireless multi-hop networks", "paper_id": "WOS:000351965300003"}