{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "audience_response_system"}, {"score": 0.01820002142192921, "phrase": "multiple-choice_powerpoint_slides"}, {"score": 0.010420432572757203, "phrase": "baccalaureate_nursing_students"}, {"score": 0.008368475886486915, "phrase": "lecture_format"}, {"score": 0.00763675407846095, "phrase": "pharmacological_knowledge"}, {"score": 0.0047709540557306284, "phrase": "teaching_pharmacology"}, {"score": 0.004577869668211548, "phrase": "students'_use"}, {"score": 0.004273196830970426, "phrase": "didactic_material"}, {"score": 0.004138010495069077, "phrase": "students'_grades"}, {"score": 0.0032886455096627324, "phrase": "positively_affected_students'_satisfaction"}, {"score": 0.003140888248194296, "phrase": "lecture_classes"}, {"score": 0.00286493504971388, "phrase": "test_scores"}, {"score": 0.0027361626349903744, "phrase": "satisfaction_questionnaire"}, {"score": 0.0026616868981501006, "phrase": "control_students"}, {"score": 0.0023725232579531273, "phrase": "future_courses"}, {"score": 0.002214297250267208, "phrase": "students'_comprehension"}, {"score": 0.0021049977753042253, "phrase": "solely_multiple-choice_powerpoint_slides"}], "paper_keywords": ["Audience response system", " Computer-assisted instruction", " Educational technology", " Feedback methods", " Interactive-voice response system", " Student response system"], "paper_abstract": "It has been proposed that students' use of an audience response system, commonly called clickers, may promote comprehension and retention of didactic material. Whether this method actually improves students' grades, however, is still not determined. The purpose of this study was to evaluate whether a lecture format utilizing multiple-choice PowerPoint slides and an audience response system was more effective than a lecture format using only multiple-choice PowerPoint slides in the comprehension and retention of pharmacological knowledge in baccalaureate nursing students. The study also assessed whether the additional use of clickers positively affected students' satisfaction with their learning. Results from 78 students who attended lecture classes with multiple-choice PowerPoint slides plus clickers were compared with those of 55 students who utilized multiple-choice PowerPoint slides only. Test scores between these two groups were not significantly different. A satisfaction questionnaire showed that 72.2% of the control students did not desire the opportunity to use clickers. Of the group utilizing the clickers, 92.3% recommend the use of this system in future courses. The use of multiple-choice PowerPoint slides and an audience response system did not seem to improve the students' comprehension or retention of pharmacological knowledge as compared with those who used solely multiple-choice PowerPoint slides.", "paper_title": "Effectiveness of an Audience Response System in Teaching Pharmacology to Baccalaureate Nursing Students", "paper_id": "WOS:000292876200006"}