{"auto_keywords": [{"score": 0.042221198159302094, "phrase": "cosmos"}, {"score": 0.009449492159155361, "phrase": "corina"}, {"score": 0.00849585824347358, "phrase": "average_speed"}, {"score": 0.00481495049065317, "phrase": "data-driven_high-throughput_prediction"}, {"score": 0.0047468516620285525, "phrase": "review_and_progress"}, {"score": 0.004713162564945179, "phrase": "accurate_prediction"}, {"score": 0.004629977311316031, "phrase": "small_molecules"}, {"score": 0.004265760046406154, "phrase": "high-throughput_methods"}, {"score": 0.004175533280178052, "phrase": "new_target_specifications"}, {"score": 0.004131135118662576, "phrase": "next_generation"}, {"score": 0.003819599991449801, "phrase": "torsion_angle_parameters"}, {"score": 0.003672738792746948, "phrase": "csd"}, {"score": 0.0035567476133074533, "phrase": "system's_performance"}, {"score": 0.0033475472608077823, "phrase": "significant_improvement"}, {"score": 0.0033001333942688778, "phrase": "state-of-the-art_prediction_methods"}, {"score": 0.0032073043728420843, "phrase": "complex_molecular_structures"}, {"score": 0.0028920935761027724, "phrase": "widely_used_commercial_method"}, {"score": 0.0027121844541913367, "phrase": "common_subset"}, {"score": 0.0024281181691350085, "phrase": "average_rmsd"}], "paper_keywords": [""], "paper_abstract": "Accurate prediction of the 3-D structure of small molecules is essential in order to understand their physical, chemical, and biological properties, including how they interact with other molecules. Here, we survey the field of high-throughput methods for 3-D structure prediction and set up new target specifications for the next generation of methods. We then introduce COSMOS, a novel data-driven prediction method that utilizes libraries of fragment and torsion angle parameters. We illustrate COSMOS using parameters extracted from the Cambridge Structural Database (CSD) by analyzing their distribution and then evaluating the system's performance in terms of speed, coverage, and accuracy. Results show that COSMOS represents a significant improvement when compared to state-of-the-art prediction methods, particularly in terms of coverage of complex molecular structures, including metal-organics. COSMOS can predict structures for 96.4% of the molecules in the CSD (99.6% organic, 94.6% metal-organic), whereas the widely used commercial method CORINA predicts structures for 68.5% (98.5% organic, 51.6% metal-organic). On the common subset of molecules predicted by both methods, COSMOS makes predictions with an average speed per molecule of 0.15 s (0.10 s organic, 0.21 s metal-organic) and an average rmsd of 1.57 angstrom (1.26 angstrom organic, 1.90 angstrom metal-organic), and CORINA makes predictions with an average speed per molecule of 0.13s (0.18s organic, 0.08s metal-organic) and an average rmsd of 1.60 angstrom (1.13 angstrom organic, 2.11 angstrom metal-organic). COSMOS is available through the ChemDB chemoinformatics Web portal at http://cdb.ics.uci.edu/.", "paper_title": "Data-Driven High-Throughput Prediction of the 3-D Structure of Small Molecules: Review and Progress", "paper_id": "WOS:000289710800002"}