{"auto_keywords": [{"score": 0.043534853125544316, "phrase": "toulmin_structures"}, {"score": 0.015561929573070624, "phrase": "toulmin_argument_formalism"}, {"score": 0.015405701639645027, "phrase": "structured_argumentation_tools"}, {"score": 0.01017412188200244, "phrase": "toulmin_formalism"}, {"score": 0.00481495049065317, "phrase": "structured_argumentation"}, {"score": 0.0045137173841642035, "phrase": "formalism's_effect"}, {"score": 0.004483120978156604, "phrase": "argument_evaluation"}, {"score": 0.0038467574225322086, "phrase": "structured_representations"}, {"score": 0.0037947482487057076, "phrase": "written_argument"}, {"score": 0.0036058769733410614, "phrase": "argument_soundness"}, {"score": 0.003391556348707911, "phrase": "weak_manipulation"}, {"score": 0.0033685408148574846, "phrase": "small_sample_size"}, {"score": 0.002690406375639144, "phrase": "structure_generation"}, {"score": 0.002538996868327341, "phrase": "participants'_soundness_ratings"}, {"score": 0.0025046245057922557, "phrase": "mediating_role"}, {"score": 0.002487612781045517, "phrase": "cognitive_effort"}, {"score": 0.002453934333239467, "phrase": "generated_structures"}, {"score": 0.002331641523873951, "phrase": "better_soundness_ratings"}, {"score": 0.002230584233627327, "phrase": "claimed_value"}, {"score": 0.0021705796895687864, "phrase": "additional_empirical_research"}, {"score": 0.0021049977753042253, "phrase": "effective_cognitive_aids"}], "paper_keywords": ["argument support systems", " structured argumentation tools", " Toulmin argument formalism"], "paper_abstract": "Some structured argumentation tools employ the Toulmin argument formalism, but no research has been performed testing this formalism's effect on argument evaluation or commiunication. An experiment was conducted to address this need by assessing: 1) if the process of generating Toulmin structures impacted participant (re)assessment of the soundness of an argument presented in an article and 2) if other participants thought that the structured representations adequately reflected the written argument. Results were mixed. First, generating Toulmin structures did impact the assessment of argument soundness. This was noteworthy given that participants were professionals representing the population of interest and that a weak manipulation and small sample size were used in the experiment. However, the effect was limited to the article where the argument was poorly aligned with the Toulmin formalism, and second, participants reviewing these, structures found them to be less sound than the argument presented in the article itself. More generally, participants did not find it easy to generate Toulmin structures. Greater perceived difficulty in structure generation (and not generation time) was significantly correlated with the amount of change in the participants' soundness ratings, suggesting the mediating role of cognitive effort on reassessment. Generated structures varied greatly. Structures that had more total elements were easier to understand and were given better soundness ratings. These findings suggest that one needs to be cautious of the claimed value of the structured argumentation tools employing the Toulmin formalism without additional empirical research, demonstrating whether and how they can be effective cognitive aids.", "paper_title": "An empirical evaluation of structured argumentation using the Toulmin argument formalism", "paper_id": "WOS:000246034500006"}