{"auto_keywords": [{"score": 0.04731443162421143, "phrase": "conveyor_belt"}, {"score": 0.04586846484671967, "phrase": "maximum_dimension"}, {"score": 0.03285425557766291, "phrase": "oversize_rocks"}, {"score": 0.00481495049065317, "phrase": "size-based_analysis"}, {"score": 0.004139128578531134, "phrase": "size_threshold"}, {"score": 0.0036159990127332315, "phrase": "large_cost"}, {"score": 0.0032629585038738856, "phrase": "size_distribution"}, {"score": 0.003074495313651187, "phrase": "image_segmentation"}, {"score": 0.0027592065435732955, "phrase": "support_vector_machine"}, {"score": 0.002714779217561487, "phrase": "novel_split_algorithm"}, {"score": 0.0021049977753042253, "phrase": "moving_conveyor"}], "paper_keywords": ["2D image segmentation", " Size distribution", " Oversize rocks", " Conveyor belt", " Support vector machine", " Quarry"], "paper_abstract": "As rocks are transported along the conveyor belt of a quarry, the maximum dimension of the rocks exiting the crushers should not exceed a size threshold specific to each crusher. If the rocks are too large then they can pose a threat to equipment, and lead to a large cost in repair and loss of production. A 2D vision system is presented, which is capable of estimating the size distribution of the rocks, and also monitoring for oversize rocks. Image segmentation is performed, which is followed by a process that classifies the segments as valid or invalid using a support vector machine. A novel split algorithm is presented, which attempts to split segments that have resulted in undersegmentation. This allows the system to constantly monitor for oversize rocks without stopping the conveyor belt. For the experiments presented in this paper, a set of images was taken of rocks on a moving conveyor. In testing, it was found that 81.31 % of the segments output by the system correctly found the maximum dimension of the rock that it represented.", "paper_title": "Fast inspection for size-based analysis in aggregate processing", "paper_id": "WOS:000347776600003"}