{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_fusion"}, {"score": 0.004742290714667451, "phrase": "new_data_fusion_operator"}, {"score": 0.0044624036486300865, "phrase": "particular_data_sample"}, {"score": 0.004285010985001827, "phrase": "proposed_approach"}, {"score": 0.0036245239349157236, "phrase": "proposed_operator"}, {"score": 0.0035337158050484474, "phrase": "possible_applications"}, {"score": 0.003462704420080129, "phrase": "traditional_average"}, {"score": 0.003144345057121367, "phrase": "pattern_recognition"}, {"score": 0.0029584874121320165, "phrase": "illustrative_numerical_examples"}, {"score": 0.002592523232809191, "phrase": "density-based_weights"}, {"score": 0.002414544068560716, "phrase": "minimum_distance"}, {"score": 0.002390133671838151, "phrase": "weighted_class_mean"}, {"score": 0.00217017119491777, "phrase": "different_distance_measures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Weighted average", " Data fusion", " Data density", " Cauchy kernel", " Fuzzy classifier"], "paper_abstract": "A new data fusion operator based on averaging that is weighted by the density of each particular data sample is introduced in this paper. The proposed approach differs from other weighted averages by its suitability to on-line, real-time applications due to the fact that recursive calculations are being used. It also differs by the fact that it is non-parametric. The proposed operator has a very wide area of possible applications same as the traditional average and most of the other weighted averages. This includes, but is not limited to clustering, classification, pattern recognition, group decision making approaches, data fusion, etc. Some illustrative numerical examples are provided mainly as a proof of concept, including its application to classification. Two simple, yet very effective classification approaches based on the density-based weights called 'one-rule-per-class' or 1R/C and on the minimum distance to weighted class mean has been introduced. Further work will focus on more application-oriented studies that cover various practical applications to clustering and use of different distance measures. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Density-based averaging - A new operator for data fusion", "paper_id": "WOS:000313774200011"}