{"auto_keywords": [{"score": 0.03899523601303667, "phrase": "virtual_world"}, {"score": 0.00481495049065317, "phrase": "space_to_place"}, {"score": 0.00477924690801092, "phrase": "predicting_users'_intentions"}, {"score": 0.004720598146591975, "phrase": "cognitive_absorption"}, {"score": 0.00470862827326028, "phrase": "virtual_worlds._virtual_worlds"}, {"score": 0.00465634671242413, "phrase": "considerable_attention"}, {"score": 0.004650842062085632, "phrase": "users'_awareness"}, {"score": 0.0039822874870125095, "phrase": "virtual_environment"}, {"score": 0.003779943062894615, "phrase": "users_'intentions"}, {"score": 0.0033301694494391643, "phrase": "meaningful_experiences"}, {"score": 0.003256526411907174, "phrase": "interactionist_theory"}, {"score": 0.003232341244892437, "phrase": "place_attachment"}, {"score": 0.0030451958332949735, "phrase": "lab_experiment"}, {"score": 0.0029889584492584073, "phrase": "users'_intentions"}, {"score": 0.0028581775908203683, "phrase": "deep_involvement"}, {"score": 0.002345535736297701, "phrase": "virtual_sense"}, {"score": 0.002217880187104576, "phrase": "state_predictors"}, {"score": 0.0021607035327962246, "phrase": "virtual_worlds"}, {"score": 0.0021049977753042253, "phrase": "users'_experiences"}], "paper_keywords": ["Virtual worlds", " cognitive absorption", " intention to return", " social awareness", " location awareness", " task awareness", " sense of place", " place attachment"], "paper_abstract": "Virtual worlds have received considerable attention as platforms for entertainment, education, and commerce. But organizations are experiencing failures in their early attempts to lure customers, employees, or partners into these worlds. Among the more grievous problems is the inability to attract users back into a virtual environment. In this study, we propose and test a model to predict users 'intentions to return to a virtual world. Our model is based on the idea that users intend to return to a virtual world having conceived of it as a \"place\" in which they have had meaningful experiences. We rely on the interactionist theory of place attachment to explain the links among the constructs of our model. Our model is tested via a lab experiment. We find that users' intentions to return to a virtual world is determined by a state of deep involvement (termed cognitive absorption) that users experience as they perform an activity and tend to lose track of time. In turn, cognitive absorption is determined by users' awareness of whom they interact with and how they interact within a virtual world, what they interact about, and where, in a virtual sense, such interaction occurs. Our work contributes to theory in the following ways: it identifies state predictors of cognitive absorption, it conceives of virtual worlds in such a way as to account for users' experiences through the notion of place, and it explains how the properties of a virtual world contribute to users' awareness.", "paper_title": "FROM SPACE TO PLACE: PREDICTING USERS' INTENTIONS TO RETURN TO VIRTUAL WORLDS", "paper_id": "WOS:000294088300014"}