{"auto_keywords": [{"score": 0.047402641750643425, "phrase": "phylogenetic_tree"}, {"score": 0.031081029813157822, "phrase": "fpt"}, {"score": 0.013986154690254668, "phrase": "ancestral_sequences"}, {"score": 0.010093371423277568, "phrase": "approximation_algorithm"}, {"score": 0.00971623471498439, "phrase": "optimal_solution"}, {"score": 0.00481495049065317, "phrase": "ancestral_genomic_sequences"}, {"score": 0.004738765336344627, "phrase": "challenging_task"}, {"score": 0.00470862827326028, "phrase": "computational_biology"}, {"score": 0.004634117581810466, "phrase": "genomic_sequences"}, {"score": 0.0046046429665581555, "phrase": "extinct_ancestors"}, {"score": 0.003875674688691641, "phrase": "latter_problem"}, {"score": 0.003815071278610546, "phrase": "np"}, {"score": 0.0037419150096899127, "phrase": "computational_complexity"}, {"score": 0.003532885029484907, "phrase": "performance_guarantees"}, {"score": 0.003499195973264457, "phrase": "biological_importance"}, {"score": 0.0034218279328844746, "phrase": "better_algorithms"}, {"score": 0.0030209660697925285, "phrase": "log-_likelihood_ratio"}, {"score": 0.002907312188714594, "phrase": "running_time"}, {"score": 0.00266693888510356, "phrase": "small_trees"}, {"score": 0.0025420718926332615, "phrase": "arbitrary_good_approximation_guarantee"}, {"score": 0.0022875127203850027, "phrase": "interesting_biological_question"}, {"score": 0.0022297330866277738, "phrase": "approximation_algorithms"}, {"score": 0.00221551716210208, "phrase": "good_solutions"}, {"score": 0.002187356046251648, "phrase": "ancestral_genomes"}, {"score": 0.0021049977753042253, "phrase": "supplementary_material"}], "paper_keywords": ["ancestral maximum likelihood", " most parsimonious likelihood", " PTAS", " FPT", " 2-approximation"], "paper_abstract": "A challenging task in computational biology is the reconstruction of genomic sequences of extinct ancestors, given the phylogenetic tree and the sequences at the leafs. This task is best solved by calculating the most likely estimate of the ancestral sequences, along with the most likely edge lengths. We deal with this problem and also the variant in which the phylogenetic tree in addition to the ancestral sequences need to be estimated. The latter problem is known to be NP-hard, while the computational complexity of the former is unknown. Currently, all algorithms for solving these problems are heuristics without performance guarantees. The biological importance of these problems calls for developing better algorithms with guarantees of finding either optimal or approximate solutions. We develop approximation, fix parameter tractable ( FPT), and fast heuristic algorithms for two variants of the problem; when the phylogenetic tree is known and when it is unknown. The approximation algorithm guarantees a solution with a log- likelihood ratio of 2 relative to the optimal solution. The FPT has a running time which is polynomial in the length of the sequences and exponential in the number of taxa. This makes it useful for calculating the optimal solution for small trees. Moreover, we combine the approximation algorithm and the FPT into an algorithm with arbitrary good approximation guarantee ( PTAS). We tested our algorithms on both synthetic and biological data. In particular, we used the FPT for computing the most likely ancestral mitochondrial genomes of hominidae ( the great apes), thereby answering an interesting biological question. Moreover, we show how the approximation algorithms find good solutions for reconstructing the ancestral genomes for a set of lentiviruses ( relatives of HIV). Supplementary material of this work is available at www.nada.kth.se/(similar to)isaac/publications/aml/aml.html.", "paper_title": "Reconstruction of ancestral genomic sequences using likelihood", "paper_id": "WOS:000245943700006"}