{"auto_keywords": [{"score": 0.04770073889647974, "phrase": "time_duration"}, {"score": 0.03567868353540659, "phrase": "route_duration"}, {"score": 0.00481495049065317, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.004452228677941085, "phrase": "mobile_multi-hop_ad-hoc_networks"}, {"score": 0.0041981583430961734, "phrase": "source_and_destination_nodes"}, {"score": 0.003958529104387973, "phrase": "initial_position"}, {"score": 0.0039122637074546895, "phrase": "intermediate_node"}, {"score": 0.003674461410107989, "phrase": "second_case"}, {"score": 0.00351938145050947, "phrase": "extensive_analysis"}, {"score": 0.003241203549050267, "phrase": "analytical_or_statistical_methods"}, {"score": 0.003203294948113915, "phrase": "main_contribution"}, {"score": 0.0030440661915657175, "phrase": "n_intermediate_nodes"}, {"score": 0.0029500270981001058, "phrase": "minimum_route_duration"}, {"score": 0.002892729377519916, "phrase": "n_routes"}, {"score": 0.0028365413717574544, "phrase": "simulation_work"}, {"score": 0.0027060907634889734, "phrase": "proposed_model"}, {"score": 0.0025215486544004134, "phrase": "better_agreement"}, {"score": 0.002501835053002899, "phrase": "simulation_results"}, {"score": 0.002312960805824996, "phrase": "unicast_and_multi-cast_routing_protocols"}, {"score": 0.0021892798077661956, "phrase": "route_length"}], "paper_keywords": ["Ad-hoc networks", " Route duration", " MANET"], "paper_abstract": "In this paper, we present a model that estimates the time duration of routes formed by several intermediate nodes in mobile multi-hop ad-hoc networks. First, we analyze a 3-node route, where only the intermediate node is in movement while source and destination nodes remain static. From this case, we show how route duration is affected by the initial position of the intermediate node and the size of the region where it is located. We also consider a second case where all nodes of 3-node routes are mobile. Based on extensive analysis of these routes, we determine the PDF of route duration under two different mobility models. This PDF can be determined by either analytical or statistical methods. The main contribution of this paper is that the time duration of a route formed by N intermediate nodes can be accurately computed by considering the minimum route duration of a set of N routes of 3 nodes each. Simulation work was conducted using the NS-2 network simulator to verify the accuracy of the proposed model and to compare it with other proposals found in the literature. We show that our model is in better agreement with simulation results as compared with other models. Results from this work can be used to compute overhead signaling during route-maintenance of unicast and multi-cast routing protocols for mobile ad-hoc networks. Similarly, because route duration decreases with route length, this study can be used to scale the network size up/down.", "paper_title": "Route duration modeling for mobile ad-hoc networks", "paper_id": "WOS:000275558500012"}