{"auto_keywords": [{"score": 0.04376849414216941, "phrase": "information_behaviors"}, {"score": 0.03909673303902588, "phrase": "information_use_outcomes"}, {"score": 0.015007343178059716, "phrase": "information_culture"}, {"score": 0.0092060974012617, "phrase": "organization's_information_culture"}, {"score": 0.00454090611248773, "phrase": "information_use"}, {"score": 0.0036553070575015344, "phrase": "primary_method"}, {"score": 0.0036126731589251906, "phrase": "data_collection"}, {"score": 0.0035496495489801667, "phrase": "questionnaire_survey"}, {"score": 0.0034268702387746106, "phrase": "national_law_firm"}, {"score": 0.0032505921489759224, "phrase": "engineering_company"}, {"score": 0.0030653094605910727, "phrase": "data_analysis"}, {"score": 0.002994178996584381, "phrase": "questionnaire_instrument"}, {"score": 0.0021805201234139475, "phrase": "identified_behaviors"}, {"score": 0.0021049977753042253, "phrase": "significant_proportions"}], "paper_keywords": [""], "paper_abstract": "This research explores the link between information culture and information use in three organizations. We ask if there is a way to systematically identify information behaviors and values that can characterize the information culture of an organization, and whether this culture has an effect on information use outcomes. The primary method of data collection was a questionnaire survey that was applied to a national law firm, a public health agency, and an engineering company. Over 650 persons in the three organizations answered the survey. Data analysis suggests that the questionnaire instrument was able to elicit information behaviors and values that denote an organization's information culture. Moreover, the information behaviors and values of each organization were able to explain 30-50% of the variance in information use outcomes. We conclude that it is possible to identify behaviors and values that describe an organization's information culture, and that the sets of identified behaviors and values can account for significant proportions of the variance in information use outcomes.", "paper_title": "Information culture and information use: An exploratory study of three organizations", "paper_id": "WOS:000253550400011"}