{"auto_keywords": [{"score": 0.04155362490823712, "phrase": "network_simulators"}, {"score": 0.015719716506582538, "phrase": "communication_software"}, {"score": 0.01329857554942221, "phrase": "communication_software_execution"}, {"score": 0.0047797212183363835, "phrase": "accurate_network_simulation"}, {"score": 0.004744748477093856, "phrase": "network_simulation"}, {"score": 0.004590496414177077, "phrase": "distributed_systems"}, {"score": 0.004424953471635011, "phrase": "performance_impact"}, {"score": 0.004392565073466714, "phrase": "protocol_execution"}, {"score": 0.004096409451697279, "phrase": "real_devices_models"}, {"score": 0.0037921662574137535, "phrase": "target_devices"}, {"score": 0.0036822794196763506, "phrase": "software_execution"}, {"score": 0.00327356326590461, "phrase": "obtained_models"}, {"score": 0.00322576184471691, "phrase": "high-level_abstractions"}, {"score": 0.003097865379563127, "phrase": "wide_range"}, {"score": 0.003030247482854539, "phrase": "design_principles"}, {"score": 0.002931569771634119, "phrase": "specific_network_simulator"}, {"score": 0.0027946649584841754, "phrase": "discrete_event-based_network_simulators"}, {"score": 0.0026543514413663893, "phrase": "human-readable_format"}, {"score": 0.0023769469926009784, "phrase": "google"}, {"score": 0.0023079230472408787, "phrase": "nokia"}, {"score": 0.002200077887697072, "phrase": "real_experiments"}, {"score": 0.0021205548157547495, "phrase": "simulation_overhead"}], "paper_keywords": ["Modeling", " methodology", " network", " simulation", " performance evaluation", " operating systems"], "paper_abstract": "Network simulation is commonly used to evaluate the performance of distributed systems, but these approaches do not account for the performance impact that protocol execution on nodes has on performance, which can be significant. We provide a methodology to extract from real devices models of communication software execution that can be used to extend network simulators to improve their accuracy. The models are obtained by instrumenting the target devices to obtain the events necessary to describe software execution. We specify which events must be captured, how to capture them, and how to transform the event traces into models that can be used to extend network simulators. The obtained models are based on high-level abstractions that can be used to describe the execution of a wide range of communication software, and the design principles to extend network simulators are not restricted to any specific network simulator. The same model of communication software execution can be used without modification in all discrete event-based network simulators that are extended according to our principles. The models are represented in a human-readable format that is suitable for modification and can therefore be used to predict how software modifications impact performance. We evaluate our models with two proof-of-concept extensions of Ns-3 that execute the models of two modern smartphones: the Google Nexus One (GN1) and the Nokia N900. We measure the accuracy of our models by comparing results from real experiments with those from simulations with our models and analyze the simulation overhead of our approach.", "paper_title": "A Methodology to Model the Execution of Communication Software for Accurate Network Simulation", "paper_id": "WOS:000367933900004"}