{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "information_systems"}, {"score": 0.047045721055493844, "phrase": "production_function"}, {"score": 0.03543704829341049, "phrase": "hospital_output"}, {"score": 0.03222031375045697, "phrase": "short_run"}, {"score": 0.004573953147933065, "phrase": "new_empirical_model"}, {"score": 0.004108161406159407, "phrase": "information_technology"}, {"score": 0.0035542408902458677, "phrase": "seven-year_lag"}, {"score": 0.0034398445347109396, "phrase": "output_variables"}, {"score": 0.003329117824699891, "phrase": "medical_labor_productivity"}, {"score": 0.002839812512030847, "phrase": "organizational_performance"}, {"score": 0.0027100527874262446, "phrase": "performance_measures"}, {"score": 0.0026722904884984348, "phrase": "long_run"}, {"score": 0.002344201345813952, "phrase": "resulting_pattern"}, {"score": 0.0023223663501882917, "phrase": "business_value"}, {"score": 0.0022793032191981404, "phrase": "differential_lag_length"}, {"score": 0.0021049977753042253, "phrase": "new_it_projects"}], "paper_keywords": ["health-care informatics", " IT productivity", " value-chain model"], "paper_abstract": "A new empirical model for the production function of the hospital incorporating two types of information systems (IS) is developed. One type of IS is representative of information technology (IT) used in primary, clinical, value-chain activities, and the other is representative of the IT used in support (administrative) value-chain activities. The model innovation is that it accommodates up to a seven-year lag for each type of IS. The output variables for the production function are hospital output and medical labor productivity. Using data spanning from 1979 to 2006 from several hospitals, it was found that clinical IS improve hospital output in the short run (of two years). Administrative IS were found to be negatively associated with organizational performance in the short run, but positively associated with these performance measures over the long run (over four years). These results highlight the importance of timing IT investments and the sequencing chosen for the implementation of IS presenting various value-chain activities, and the resulting pattern of business value over time. Differential lag length of the types of IS is to be considered in estimating the rate of return of new IT projects.", "paper_title": "Differential Effects of the Two Types of Information Systems: A Hospital-Based Study", "paper_id": "WOS:000268520500012"}