{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ockham's_razor"}, {"score": 0.004692227830462433, "phrase": "modern_information_theory"}, {"score": 0.0045726187330434025, "phrase": "preferred_theory"}, {"score": 0.0038758293658651237, "phrase": "data_reduction_technique"}, {"score": 0.0035681790580031998, "phrase": "simplicity_model"}, {"score": 0.0028715299874549245, "phrase": "psychological_procedures"}, {"score": 0.0025493457404304446, "phrase": "metric_axioms"}, {"score": 0.002420762293555924, "phrase": "transformation_procedures"}, {"score": 0.00226322835801988, "phrase": "data_sets"}, {"score": 0.0022283519468680475, "phrase": "distinctive_aspect"}, {"score": 0.002126907587540404, "phrase": "clustering_algorithm"}, {"score": 0.0021049977753042253, "phrase": "psychological_principles"}], "paper_keywords": [""], "paper_abstract": "The simplicity principle-an updating of Ockham's razor to take into account modern information theory-states that the preferred theory for a set of data is the one that allows for the most efficient encoding of the data. We consider this in the context of classification, or clustering, as a data reduction technique that helps describe a set of objects by dividing the objects into groups. The simplicity model we present favors clusters such that the similarity of the items in the clusters is maximal, while the similarity of items between clusters is minimal. Several novel features of our clustering criterion make it especially appropriate for clustering of data derived from, psychological procedures ( e. g., similarity ratings): It is non-parametric, and may be applied in situations where the metric axioms are violated without requiring (information-forgetting) transformation procedures. We illustrate the use of the criterion with a selection of data sets. A distinctive aspect of this research is that it motivates a clustering algorithm from psychological principles.", "paper_title": "A non-parametric approach to simplicity clustering", "paper_id": "WOS:000249498800002"}