{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_drug_events"}, {"score": 0.04397860317645382, "phrase": "automated_surveillance_system"}, {"score": 0.030930835564620236, "phrase": "ade_surveillance_system"}, {"score": 0.0047267100475487595, "phrase": "pediatric_hospital"}, {"score": 0.004611554879923759, "phrase": "limited_data"}, {"score": 0.004555028829645471, "phrase": "adverse_drug_event_rates"}, {"score": 0.003976978140059542, "phrase": "pediatric_patients"}, {"score": 0.003693103542455806, "phrase": "large_pediatric_hospital"}, {"score": 0.0036477941360224435, "phrase": "potential_ades"}, {"score": 0.0034720284451902083, "phrase": "medication_safety_pharmacists"}, {"score": 0.003204232566468624, "phrase": "study_period"}, {"score": 0.0023382335380460304, "phrase": "composite_positive_predictive_value"}, {"score": 0.002239225269052105, "phrase": "automated_surveillance"}, {"score": 0.0021049977753042253, "phrase": "hospitalized_children"}], "paper_keywords": [""], "paper_abstract": "There are limited data on adverse drug event rates in pediatrics. The authors describe the implementation and evaluation of an automated surveillance system modified to detect adverse drug events (ADEs) in pediatric patients. The authors constructed an automated surveillance system to screen admissions to a large pediatric hospital. Potential ADEs identified by the system were reviewed by medication safety pharmacists and a physician and scored for causality and severity. Over the 6 month study period, 6,889 study children were admitted to the hospital for a total of 40,250 patient-days. The ADE surveillance system generated 1226 alerts, which yielded 160 true ADEs. This represents a rate of 2.3 ADEs per 100 admissions or 4 per 1,000 patient-days. Medications most frequently implicated were diuretics, antibiotics, immunosuppressants, narcotics, and anticonvulsants. The composite positive predictive value of the ADE surveillance system was 13%. Automated surveillance can be art effective method for detecting ADEs in hospitalized children.", "paper_title": "Computerized Surveillance for Adverse Drug Events in a Pediatric Hospital", "paper_id": "WOS:000269755500001"}