{"auto_keywords": [{"score": 0.04497163234841055, "phrase": "skype"}, {"score": 0.011185736135157654, "phrase": "overlay_maintenance"}, {"score": 0.00481495049065317, "phrase": "today's_voip_application"}, {"score": 0.004656729019170898, "phrase": "telecom_operators"}, {"score": 0.004614483128885678, "phrase": "research_community"}, {"score": 0.004544919390397046, "phrase": "great_interest"}, {"score": 0.00450368324850566, "phrase": "skype's_traffic"}, {"score": 0.003988180913997414, "phrase": "accurate_skype_classification_engine"}, {"score": 0.003775803846431323, "phrase": "extensive_passive_measurements"}, {"score": 0.003629463418198991, "phrase": "skype_protocol"}, {"score": 0.0035530197642369464, "phrase": "black-box_approach"}, {"score": 0.003272899463005088, "phrase": "signaling_bandwidth"}, {"score": 0.0032431667821391044, "phrase": "normal_peers"}, {"score": 0.0031459887611258765, "phrase": "significant_portion"}, {"score": 0.003117405395602633, "phrase": "total_traffic"}, {"score": 0.003079696561895752, "phrase": "single_skype_client"}, {"score": 0.0030424424705823455, "phrase": "peer_discovery"}, {"score": 0.0029874020705125356, "phrase": "large_number"}, {"score": 0.002969276778056666, "phrase": "single_packet_probes"}, {"score": 0.0027184540871935284, "phrase": "single-packet_probes"}, {"score": 0.002669259222649505, "phrase": "signaling_traffic"}, {"score": 0.002466139325703204, "phrase": "peer_selection_mechanism"}, {"score": 0.0023275257102180554, "phrase": "skype_network"}, {"score": 0.0023063614119692476, "phrase": "worldwide_service_outage"}, {"score": 0.002203385580030364, "phrase": "striking_impacts"}, {"score": 0.002183347623351868, "phrase": "signaling_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Internet traffic measurements", " Skype"], "paper_abstract": "Skype is without a doubt today's VoIP application of choice. Its amazing success has drawn the attention of both telecom operators and the research community. There is a great interest in characterizing Skype's traffic, understanding its internal mechanisms, and learning about its users' behavior. One of the most interesting characteristics of Skype is that it relies on a P2P infrastructure for the exchange of signaling information that is distributed between peers. Leveraging the use of an accurate Skype classification engine that we recently designed, we now report the results of our experimental study of Skype signaling based on extensive passive measurements collected from our campus LAN. We avoid the need to reverse-engineer the Skype protocol, and we instead adopt a black-box approach. We focus on signaling traffic in order to infer certain interesting properties regarding overlay maintenance and, possibly, the overlay structure as well. Our results show that, even though the signaling bandwidth used by normal peers is exiguous, it may nonetheless account for a significant portion of the total traffic generated by a single Skype client. Skype performs peer discovery and refresh by using a large number of single packet probes. This may be as effective for the purpose of overlay maintenance as it is costly, at least from the viewpoint of layer-4 network devices. At the same time, single-packet probes account for only a minor fraction of all signaling traffic: therefore, we wish to explore more deeply the traffic that is exchanged among the more stable peers, in an attempt to learn how the peer selection mechanism actually operates. Measurements were collected during April and August 2007. In particular, during the second month of sampling, the Skype network suffered a worldwide service outage. We compare the results collected during the two time periods, and we demonstrate the striking impacts on the signaling network as a result of the outage. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Understanding Skype signaling", "paper_id": "WOS:000262771900002"}