{"auto_keywords": [{"score": 0.04713957641895844, "phrase": "brazil"}, {"score": 0.0063982120282586406, "phrase": "full_phd"}, {"score": 0.004814952636027606, "phrase": "brazilian"}, {"score": 0.00470862827326028, "phrase": "biological_sciences"}, {"score": 0.004553510708976456, "phrase": "full_doctorate"}, {"score": 0.004387117409226736, "phrase": "brazilian_scientific_production"}, {"score": 0.00395273370234774, "phrase": "current_study"}, {"score": 0.00383668723824441, "phrase": "scientific_production"}, {"score": 0.0036281710561308377, "phrase": "specifically_the_scientific_production"}, {"score": 0.0035407638986939393, "phrase": "phd"}, {"score": 0.0033801845720347118, "phrase": "phd_conclusion"}, {"score": 0.0031726587374218277, "phrase": "national_council_of_technological_and_scientific_development"}, {"score": 0.003137378217902869, "phrase": "lattes"}, {"score": 0.003067996605599337, "phrase": "isi"}, {"score": 0.0030338645940033875, "phrase": "scival-scopus"}, {"score": 0.002613487968156893, "phrase": "lower_impact_factor"}, {"score": 0.0024256208351516027, "phrase": "qualitative_performance"}, {"score": 0.002234491924392104, "phrase": "brazilian_government"}, {"score": 0.0021526564019119466, "phrase": "brazilian_articles"}, {"score": 0.0021207658298095845, "phrase": "scientific_quality"}, {"score": 0.0021049977753042253, "phrase": "international_insertion"}], "paper_keywords": ["Brazilian scientific production", " Brazilian doctorate Brazil/abroad"], "paper_abstract": "Know and compare the Brazilian scientific production of researchers that did full PhD in Brazil or abroad may be important to evaluate the development of science in the country. In this context, the current study was planned to verify the evolution of scientific production of researchers that concluded PhD in Brazil or abroad between 1997 and 2002. The evaluation included specifically the scientific production of PhDs in the areas of biochemistry, physiology and pharmacology during the period of 9 years after the PhD conclusion. The data were obtained from the database of CAPES (Foundation for Higher Education Development in Brazil), CNPq (National Council of Technological and Scientific Development), Lattes, Web of Science (Institute for Scientific Information (ISI) and Scival-Scopus). In terms of quantity, researchers that did full PhD in Brazil published more articles than the researchers that did it abroad. However, articles from researchers that did the PhD in Brazil were published in journals with lower impact factor and received less citation than the articles published by researchers that did PhD abroad. The results indicate that the qualitative performance of researchers that did PhD abroad was better than those who did PhD in Brazil. Consequently, the policies of Brazilian government need to be devoted to enhance the relevance of Brazilian articles in terms of scientific quality and international insertion.", "paper_title": "Brazilian scientific production in areas of biological sciences: a comparative study on the modalities of full doctorate in Brazil or abroad", "paper_id": "WOS:000329319200026"}