{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "slideware_presentations"}, {"score": 0.004519736937243476, "phrase": "microsoft_powerpoint"}, {"score": 0.004486212539464774, "phrase": "apple_keynote"}, {"score": 0.00443638953122199, "phrase": "openoffice_impress"}, {"score": 0.0041488110506566825, "phrase": "cinematic_experiences"}, {"score": 0.0038224221344037236, "phrase": "slideware_use"}, {"score": 0.003601235776892337, "phrase": "elaborative_thinking"}, {"score": 0.0033426036530090205, "phrase": "visual_system"}, {"score": 0.0030909442697163356, "phrase": "target_information"}, {"score": 0.002763850622950247, "phrase": "text_summaries"}, {"score": 0.002398627220761345, "phrase": "image-rich_slides"}, {"score": 0.0021607035327962246, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multimedia learning", " Memory", " Pedagogical issues", " Media in education", " PowerPoint", " Interest"], "paper_abstract": "With the advent of technologies that allow lecturers to develop presentations using software such as Microsoft PowerPoint, Apple Keynote, and OpenOffice Impress (referred to generically here as \"slideware\"), lectures and meetings are beginning to resemble cinematic experiences rather than the text filled transactions that have been the norm for the last decade. Unfortunately, there has been little research on slideware use. Furthermore, literature on this topic indicates that lectures typically do little to encourage elaborative thinking. To address this gap in the literature, we tested 90 participants who each viewed a lecture on the visual system that consisted of three different styles of presentation: (1) Image Congruent: presenting images that were relevant to the target information, (2) Image Incongruent: presenting images that were relevant to the narration but not the target information and, (3) Text Based: presenting text summaries of the narration. Throughout each of these conditions, participants provided ratings of interest and then completed a quiz to measure recognition, recall and transfer. Our results revealed that participants were more interested in the image-rich slides than bullet points, and that accuracy (but not interest) depended on whether the images were relevant to the content of the lecture or not. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "The role of interest and images in slideware presentations", "paper_id": "WOS:000286682700031"}