{"auto_keywords": [{"score": 0.04360247103779728, "phrase": "malicious_peers"}, {"score": 0.004677711903652145, "phrase": "research_focus"}, {"score": 0.0045443671106012405, "phrase": "valid_way"}, {"score": 0.00446987606516801, "phrase": "transaction_security"}, {"score": 0.00443308765153716, "phrase": "peer-to-peer_file_sharing_networks"}, {"score": 0.0039813976794342, "phrase": "strategic_peers"}, {"score": 0.0037886833451021723, "phrase": "service_providers"}, {"score": 0.003757480190200645, "phrase": "authentic_peers"}, {"score": 0.003531474887552889, "phrase": "new_trust_mechanism"}, {"score": 0.003473529187092258, "phrase": "maximum_flow_theory"}, {"score": 0.0033053159828082095, "phrase": "original_members"}, {"score": 0.0031452231581533814, "phrase": "maximum_flow_algorithm"}, {"score": 0.0029194625087935345, "phrase": "new_members"}, {"score": 0.0028127163745564777, "phrase": "almost_every_normal_peer"}, {"score": 0.0026875205754965537, "phrase": "request_peer"}, {"score": 0.002621590601574503, "phrase": "downloading_sources"}, {"score": 0.002344311033783139, "phrase": "high_reputation"}, {"score": 0.0023249757987087055, "phrase": "extensive_experimental_results"}], "paper_keywords": ["peer-to-peer file sharing network", " personal reputation", " maximum flow", " trust mechanism", " peer cluster"], "paper_abstract": "Trust mechanism has become a research focus in recent years as a novel and valid way to ensure the transaction security in peer-to-peer file sharing networks. Nevertheless, some fundamental challenges still exist, for example: How can malicious peers be effectively isolated? How can various threats of manipulation by strategic peers be resisted? What strategy should be used to ensure that the service providers are authentic peers? Considering these challenges in our minds, in this paper, we propose a new trust mechanism based on the maximum flow theory. We firstly add a few prestigious peers into a cluster as the original members according to their transaction behaviors in a period; then, we perform maximum flow algorithm and identify those peers that still link from (to) the peers in the cluster as new members, which is carried out repeatedly, and almost every normal peer would finally become the member of the cluster. Each request peer has the priority to select downloading sources from this cluster according to our trust mechanism. In this way, the malicious peers are isolated, and their transaction behaviors are also confined largely even though they have high reputation. Extensive experimental results confirm the efficiency of our trust mechanism against the threats of exaggeration, cheat, collusion, and disguise. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Peer cluster: a maximum flow-based trust mechanism in P2P file sharing networks", "paper_id": "WOS:000321821200007"}