{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unsupervised_trajectory_segmentation"}, {"score": 0.044857284553732626, "phrase": "explicit_criteria"}, {"score": 0.004740009255053372, "phrase": "important_problem"}, {"score": 0.004666228956744244, "phrase": "knowledge_discovery"}, {"score": 0.004405348628112645, "phrase": "existing_algorithms"}, {"score": 0.004359500411441827, "phrase": "trajectory_segmentation"}, {"score": 0.004051595625804513, "phrase": "segmenting_trajectories"}, {"score": 0.003610929883213109, "phrase": "minimum_description_length"}, {"score": 0.0033910448175165004, "phrase": "trajectory_data"}, {"score": 0.0029905104479072482, "phrase": "homogeneity_measurements"}, {"score": 0.0028828348726682965, "phrase": "greedy_randomized_adaptive_search_procedure"}, {"score": 0.002301211274459965, "phrase": "experimental_results"}, {"score": 0.0022653055209664284, "phrase": "grasp-uts"}, {"score": 0.0021951623041245897, "phrase": "predetermined_criteria"}], "paper_keywords": ["moving objects", " GPS track", " segmenting trajectories", " trajectory data analysis", " unsupervised learning"], "paper_abstract": "An important problem in the knowledge discovery of trajectories is segmentation in subparts (subtrajectories). Existing algorithms for trajectory segmentation generally use explicit criteria to create segments. In this article, we propose segmenting trajectories using a novel, unsupervised approach, in which no explicit criteria are predetermined. To achieve this, we apply the Minimum Description Length (MDL) principle, which can measure homogeneity in the trajectory data by computing the similarities between landmarks (i.e. representative points of the trajectory) and the points in their neighborhood. Based on the homogeneity measurements, we propose an algorithm named Greedy Randomized Adaptive Search Procedure for Unsupervised Trajectory Segmentation (GRASP-UTS), which is a meta-heuristic that builds segments by modifying the number and positions of landmarks. We perform experiments with GRASP-UTS in two real-world datasets, using segment purity and coverage metrics to evaluate its efficiency. Experimental results demonstrate that GRASP-UTS correctly segmented sample trajectories without predetermined criteria, by computing similarities between landmarks and other trajectory points.", "paper_title": "GRASP-UTS: an algorithm for unsupervised trajectory segmentation", "paper_id": "WOS:000350367900003"}