{"auto_keywords": [{"score": 0.007684683140529521, "phrase": "dns_cache_server"}, {"score": 0.00481495049065317, "phrase": "dns_server"}, {"score": 0.004740009255053372, "phrase": "conventional_egress_network_access_control"}, {"score": 0.0046906977533339245, "phrase": "nac"}, {"score": 0.004593591780245872, "phrase": "access_control_lists"}, {"score": 0.004359500411441827, "phrase": "heavy_task"}, {"score": 0.0041589926969138585, "phrase": "large_amount"}, {"score": 0.004115697805448384, "phrase": "administrators'_effort"}, {"score": 0.00396767023935381, "phrase": "nac."}, {"score": 0.0032689949867583633, "phrase": "user_name"}, {"score": 0.003053873937567957, "phrase": "dns"}, {"score": 0.002721388234661538, "phrase": "ip_options"}, {"score": 0.002195162304124588, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "router's_performance"}], "paper_keywords": ["access control", " capabilities", " network security", " egress filters", " DNS"], "paper_abstract": "In conventional egress network access control (NAC) based on access control lists (ACLs), modifying the ACLs is a heavy task for administrators. To enable configuration without a large amount of administrators' effort, we introduce capabilities to egress NAC. In our method, a user can transfer his/her access rights (capabilities) to other persons without asking administrators. To realize our method, we use a DNS cache server and a router. A resolver of the client sends the user name, domain name, and service name to the DNS cache server. The DNS server issues capabilities according to a policy and sends them to the client. The client puts these Capabilities into the IP options of packets and sends them to the router. The router verifies the capabilities, and determines whether to pass or block the packets. In this paper, we describe the design and implementation of our method in detail. Experimental results show that our method does not reduce the router's performance. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Capability-based egress network access control by using DNS server", "paper_id": "WOS:000249949500002"}