{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_visual_attention_method"}, {"score": 0.0046176782475198085, "phrase": "visual_surveillance"}, {"score": 0.004545793387330536, "phrase": "biologically_motivated_dynamic_visual_attention"}, {"score": 0.003926359151817743, "phrase": "dynamic_scene"}, {"score": 0.0038854765143440965, "phrase": "surveillance_purposes"}, {"score": 0.0036680857629458816, "phrase": "predefined_features"}, {"score": 0.003610929883213109, "phrase": "gray_level"}, {"score": 0.0032012284065895537, "phrase": "selective_visual_attention_problem"}, {"score": 0.003118486096035156, "phrase": "input_images"}, {"score": 0.003069867656852932, "phrase": "indefinite_sequence"}, {"score": 0.0028527866590859967, "phrase": "user's_interest"}, {"score": 0.002651015392318126, "phrase": "features_extraction"}, {"score": 0.0022653055209664284, "phrase": "moving_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["dynamic visual attention", " visual surveillance", " segmentation from motion", " feature extraction", " feature integration"], "paper_abstract": "This paper describes a method for visual surveillance based on biologically motivated dynamic visual attention in video image sequences. Our system is based on the extraction and integration of local (pixels and spots) as well as global (objects) features. Our approach defines a method for the generation of an active attention focus on a dynamic scene for surveillance purposes. The system segments in accordance with a set of predefined features, including gray level, motion and shape features, giving raise to two classes of objects: vehicle and pedestrian. The solution proposed to the selective visual attention problem consists of decomposing the input images of an indefinite sequence of images into its moving objects, defining which of these elements are of the user's interest at a given moment, and keeping attention on those elements through time. Features extraction and integration are solved by incorporating mechanisms of charge and discharge-based on the permanency effect-, as well as mechanisms of lateral interaction. All these mechanisms have proved to be good enough to segment the scene into moving objects and background. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Visual surveillance by dynamic visual attention method", "paper_id": "WOS:000240156500022"}