{"auto_keywords": [{"score": 0.04974492695968205, "phrase": "semantic_technologies"}, {"score": 0.02817440361101287, "phrase": "ewe"}, {"score": 0.00481495049065317, "phrase": "evented_web"}, {"score": 0.0047314049780079765, "phrase": "live_web"}, {"score": 0.004649302313891199, "phrase": "new_way"}, {"score": 0.004536735647938243, "phrase": "dynamic_streams"}, {"score": 0.004505074966056871, "phrase": "relevant_real-time_contextual_information"}, {"score": 0.004395984840790689, "phrase": "massive_data"}, {"score": 0.004156411748278609, "phrase": "task_automation_services"}, {"score": 0.003971367134498762, "phrase": "automation_rules"}, {"score": 0.0038078492247427594, "phrase": "incoming_information"}, {"score": 0.0035129562812850784, "phrase": "tass_developers"}, {"score": 0.003275093899046286, "phrase": "large_scale_data"}, {"score": 0.0030747771905143273, "phrase": "existing_state"}, {"score": 0.002796975007007085, "phrase": "evented_web_ontology"}, {"score": 0.002719576221177709, "phrase": "evented_web_domain"}, {"score": 0.002447882520797866, "phrase": "semantic_tas"}, {"score": 0.0023223663501882896, "phrase": "realistic_problem"}, {"score": 0.0021649437083408425, "phrase": "thorough_ontology_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Event-stream", " Linked data", " Semantic Web", " Web rule", " Knowledge management", " Social sensor"], "paper_abstract": "The Live Web is characterised by a new way of interacting with the Web through dynamic streams of relevant real-time contextual information to users. These sources of massive data usually overwhelm them, because they are not able to consume that amount of data. Task Automation Services (TASs) are platforms or apps that allow their users to author automation rules to combine events from streams while reducing the effort for handling incoming information. While these platforms are a reality, they suffer from two major drawbacks: (i) the only incoming data streams available are those the TASs developers decided to include in the system, and (ii) they lack of a mechanism to reason over large scale data outside their platform. To face these challenges, this paper contributes in (i) reviewing the existing state of the art including research and commercial work given their relevance. Based on the lessons learnt from this review, (ii) we propose the Evented WEb ontology (EWE), that models the Evented WEb domain, and in particular those concepts around TASs. EWE enables scalability, interoperability and definition of rules with reasoning over Linked Open Data (LOD) cloud. To illustrate these contributions, (iii) a semantic TAS has been implemented that benefits from the advantages EWE offers, and solves a realistic problem using semantic technologies. Finally, (iv) to validate the ontology covers the domain it models, a thorough ontology evaluation is presented. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling rules for automating the Evented WEb by semantic technologies", "paper_id": "WOS:000360772500059"}