{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media_mashups"}, {"score": 0.007273332952015386, "phrase": "organizational_context"}, {"score": 0.005345415785098514, "phrase": "representative_themes"}, {"score": 0.005040545323467835, "phrase": "social_media"}, {"score": 0.0047273577269638725, "phrase": "existing_mashup_literature"}, {"score": 0.004641351004344458, "phrase": "actual_adoption"}, {"score": 0.004408729661992651, "phrase": "mashup_initiatives"}, {"score": 0.004312622975366676, "phrase": "mashup_use_and_adoption_issues"}, {"score": 0.004096409451697279, "phrase": "maximum_benefits"}, {"score": 0.003601951458683923, "phrase": "text_mining_approach"}, {"score": 0.003562444653947001, "phrase": "relevant_posts"}, {"score": 0.003471933181807712, "phrase": "major_online_mashup_forum"}, {"score": 0.0033961782274326948, "phrase": "current_status"}, {"score": 0.0033712944392793195, "phrase": "social_media_mashup"}, {"score": 0.0030751605843937673, "phrase": "higher_education_institutions"}, {"score": 0.00300803677566719, "phrase": "usa._findings"}, {"score": 0.002713604305939145, "phrase": "social_media_mashup_sites"}, {"score": 0.0024569466759289055, "phrase": "value_-_this"}, {"score": 0.0024299678474208023, "phrase": "first_article"}, {"score": 0.0023421547766273036, "phrase": "organizational_environments"}, {"score": 0.00226583335721762, "phrase": "starting_point"}, {"score": 0.0021679176844660074, "phrase": "different_industries"}], "paper_keywords": ["Twitter", " Facebook", " YouTube", " Community engagement", " Social media mashup", " Higher education institutions", " Organizations"], "paper_abstract": "Purpose - The existing mashup literature paid little attention to the actual adoption and diffusion of mashups in an organizational context. As more and more organizations are engaged in mashup initiatives, more research efforts focussing on the mashup use and adoption issues from the organizational perspective are needed to ensure that organizations can receive the maximum benefits from their mashup initiatives. Two studies are conducted to increase the understanding of the use and adoption issues with social media mashups. The paper aims at discussing these issues. Design/methodology/approach - The paper first used a text mining approach to analyze relevant posts on blogs and messages in a major online mashup forum in order to understand the current status of social media mashup as well as representative themes and issues with social media mashups in general. Subsequently, the paper reviewed a number of social media mashup sites created by higher education institutions (HEIs) in the USA. Findings - The paper identified some representative themes and issues with social media mashups in general. The paper also identified the approaches that were used to design the interface of social media mashup sites by HEIs. Based on the two studies, this paper provides recommendations and insights to guide social media mashup development and adoption in an organizational context. Originality value - This is the first article to discuss the use and adoption of social media mashups in organizational environments. This paper can be used as a starting point to motivate other researchers to further explore the diffusion of social media mashups in different industries. This paper also helps organizations improve their social media mashup initiatives.", "paper_title": "Insights into the adoption of social media mashups", "paper_id": "WOS:000332998600002"}