{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autonomous_mobile_robots"}, {"score": 0.004435112270935294, "phrase": "grid_network"}, {"score": 0.004335000368745273, "phrase": "arbitrary_placement"}, {"score": 0.0042178318724732005, "phrase": "purely_localized_computations"}, {"score": 0.004029517895918228, "phrase": "finite_time"}, {"score": 0.003956558420993431, "phrase": "static_equilibrium"}, {"score": 0.0037798652680135106, "phrase": "theoretical_quest"}, {"score": 0.0036944890904337833, "phrase": "minimal_capabilities"}, {"score": 0.00325069754015951, "phrase": "provably_correct_protocol"}, {"score": 0.003221111762383486, "phrase": "uniform_self-deployment"}, {"score": 0.0029666322924554274, "phrase": "minimal_assumptions"}, {"score": 0.0027954035431845344, "phrase": "direct_or_explicit_communication"}, {"score": 0.0026461080202599694, "phrase": "robots_synchronization"}, {"score": 0.0022238315004700607, "phrase": "simple_finite-state_machines"}, {"score": 0.0021243539405631866, "phrase": "global_localization_system"}], "paper_keywords": [""], "paper_abstract": "We consider the uniform scattering problem for a set of autonomous mobile robots deployed in a grid network: starting from an arbitrary placement in the grid, using purely localized computations, the robots must move so to reach in finite time a state of static equilibrium in which they cover uniformly the grid. The theoretical quest is on determining the minimal capabilities needed by the robots to solve the problem. We prove that uniform scattering is indeed possible even for very weak robots. The proof is constructive. We present a provably correct protocol for uniform self-deployment in a grid. The protocol is fully localized, collision-free, and it makes minimal assumptions; in particular: (1) it does not require any direct or explicit communication between robots; (2) it makes no assumption on robots synchronization or timing, hence the robots can be fully asynchronous in all their actions; (3) it requires only a limited visibility range; (4) it uses at each robot only a constant size memory, hence computationally the robots can be simple Finite-State Machines; (5) it does not need a global localization system but only orientation in the grid (e.g., a compass); (6) it does not require identifiers, hence the robots can be anonymous and totally identical.", "paper_title": "UNIFORM SCATTERING OF AUTONOMOUS MOBILE ROBOTS IN A GRID", "paper_id": "WOS:000289639700010"}