{"auto_keywords": [{"score": 0.04901380668219845, "phrase": "wireless_mesh_networks"}, {"score": 0.03757256833386091, "phrase": "multi-path_routing"}, {"score": 0.00481495049065317, "phrase": "multi-path_forwarding"}, {"score": 0.004738177185041523, "phrase": "improved_network_performance"}, {"score": 0.00447174501210281, "phrase": "viable_alternative"}, {"score": 0.004443077867798955, "phrase": "wired_networks"}, {"score": 0.0042748769561032325, "phrase": "low_deployment"}, {"score": 0.003906660012576505, "phrase": "node_or_link_failures"}, {"score": 0.0034237422623525937, "phrase": "different_objectives"}, {"score": 0.003078639412163634, "phrase": "single_mac_frame"}, {"score": 0.002952414496287241, "phrase": "aware_forwarding"}, {"score": 0.002886598310196588, "phrase": "existing_multi-path_routing_algorithms"}, {"score": 0.002822245166926626, "phrase": "packet_aggregation"}, {"score": 0.0027152365187093244, "phrase": "proposed_technique"}, {"score": 0.0026718527964253312, "phrase": "path_computation_phase"}, {"score": 0.0026122745966589795, "phrase": "forwarding_decisions"}, {"score": 0.002554021496818708, "phrase": "sending_queues"}, {"score": 0.0023037942361136205, "phrase": "thorough_performance_evaluation"}, {"score": 0.0021599821402426013, "phrase": "network_throughput"}, {"score": 0.00214610313234565, "phrase": "end-to-end_delay"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless mesh network", " Multi-path routing", " Packet aggregation"], "paper_abstract": "Wireless mesh networks (WMNs) based on the IEEE 802.11 standard are becoming increasingly popular as a viable alternative to wired networks. WMNs can cover large or difficult to reach areas with low deployment and management costs. Several multi-path routing algorithms have been proposed for such kind of networks with the objective of load balancing the traffic across the network and providing robustness against node or link failures. Packet aggregation has also been proposed to reduce the overhead associated with the transmission of frames, which is not negligible in IEEE 802.11 networks. Unfortunately, multi-path routing and packet aggregation do not work well together, as they pursue different objectives. Indeed, while multi-path routing tends to spread packets among several next-hops, packet aggregation works more efficiently when several packets (destined to the same next-hop) are aggregated and sent together in a single MAC frame. In this paper, we propose a technique, called aggregation aware forwarding, that can be applied to existing multi-path routing algorithms to allow them to effectively exploit packet aggregation so as to significantly increase their network performance. In particular, the proposed technique does not modify the path computation phase, but it just influences the forwarding decisions by taking the state of the sending queues into account. We demonstrated our proposed technique by applying it to Layer-2.5, a multi-path routing and forwarding paradigm for WMNs that has been previously proposed. We conducted a thorough performance evaluation by means of the ns-3 network simulator, which showed that our technique allows to increase the performance both in terms of network throughput and end-to-end delay. (c) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Combining multi-path forwarding and packet aggregation for improved network performance in wireless mesh networks", "paper_id": "WOS:000335610700003"}