{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user-specific_design_specifications"}, {"score": 0.036138896254365616, "phrase": "design_specifications"}, {"score": 0.010037069753607655, "phrase": "affordance-based_approach"}, {"score": 0.004318881178805575, "phrase": "user_variation"}, {"score": 0.004153041453795458, "phrase": "unique_set"}, {"score": 0.0041170581247889654, "phrase": "human_factors"}, {"score": 0.004046020290832207, "phrase": "personal_knowledge"}, {"score": 0.0035199624440843892, "phrase": "ad_hoc"}, {"score": 0.0034742854447532678, "phrase": "priori_decisions"}, {"score": 0.0031431690368229443, "phrase": "user_level"}, {"score": 0.0029961221584602405, "phrase": "early_stages"}, {"score": 0.0024095777415804346, "phrase": "relational_field"}, {"score": 0.0022277448907881306, "phrase": "individual_design_specifications"}, {"score": 0.002132711053003407, "phrase": "later_stages"}, {"score": 0.0021049977753042253, "phrase": "design_process"}], "paper_keywords": ["Affordance", " Early Design Process Planning", " Problem Clarification", " User Needs"], "paper_abstract": "When developing an artifact, designers must first understand the problem. This includes the benefits that the artifact must deliver and the user variation that is present. Each user has a unique set of human factors, preferences, personal knowledge, and solution constraints that could potentially influence the characteristics of the artifact. Currently, there is little work supporting the process of how to formally generate user-specific design specifications, resulting in ad hoc or a priori decisions when generating design specifications. Further, because most design processes generate design specifications manually, the number of design specifications is not typically addressed at the user level. This research presents an affordance-based approach for use in the early stages of design to help designers establish user-specific design specifications. This information can then be used in the creation of a system or set of systems that meets the demands of both the user(s) and the organization that is developing the artifact. An affordance-based approach is leveraged because it maintains the relational field of view among the user, existing artifacts, and the artifact(s) being designed. Once individual design specifications are generated, designers can use this information in later stages of the design process.", "paper_title": "An affordance-based approach for generating user-specific design specifications", "paper_id": "WOS:000360110200007"}