{"auto_keywords": [{"score": 0.0415483773600672, "phrase": "driver_situation_awareness"}, {"score": 0.01173389657937066, "phrase": "emotional_effects"}, {"score": 0.00481495049065317, "phrase": "driver_situation_awareness_and_driving_performance"}, {"score": 0.004647442352794694, "phrase": "emotional_states"}, {"score": 0.004592905436175987, "phrase": "critical_effects"}, {"score": 0.00443308765153716, "phrase": "important_components"}, {"score": 0.00438105507792004, "phrase": "situation_awareness"}, {"score": 0.004329630571352367, "phrase": "endsley"}, {"score": 0.0032223742018434856, "phrase": "neutral_affect"}, {"score": 0.0031100973266506163, "phrase": "induced_angry_state"}, {"score": 0.0028800314406626022, "phrase": "neutral_state"}, {"score": 0.0027961342030212353, "phrase": "angry_state"}, {"score": 0.0026827569390113822, "phrase": "participants'_subjective_judgment"}, {"score": 0.002426137929553724, "phrase": "conscious_awareness"}, {"score": 0.0021049977753042253, "phrase": "severe_impacts"}], "paper_keywords": [""], "paper_abstract": "Research has suggested that emotional states have critical effects on various cognitive processes, which are important components of situation awareness (Endsley, 1995b). Evidence from driving studies has also emphasized the importance of driver situation awareness for performance and safety. However, to date, little research has investigated the relationship between emotional effects and driver situation awareness. In our experiment, 30 undergraduates drove in a simulator after induction of either anger or neutral affect. Results showed that an induced angry state can degrade driver situation awareness as well as driving performance as compared to a neutral state. However, the angry state did not have an impact on participants' subjective judgment or perceived workload, which might imply that the effects of anger occurred below their level of conscious awareness. One of the reasons participants showed a lack of compensation for their deficits in performance might be that they were not aware of severe impacts of emotional effects on driving performance.", "paper_title": "Anger Effects on Driver Situation Awareness and Driving Performance", "paper_id": "WOS:000336824500006"}