{"auto_keywords": [{"score": 0.04971075098097409, "phrase": "emr_systems"}, {"score": 0.015305054603780614, "phrase": "shakedown_phase"}, {"score": 0.008128615682477875, "phrase": "emr_system_use"}, {"score": 0.00481495049065317, "phrase": "physicians'_use"}, {"score": 0.004509057381424944, "phrase": "prior_work"}, {"score": 0.004439941010250576, "phrase": "multidisciplinary_approach"}, {"score": 0.004388796812234033, "phrase": "electronic_medical_records"}, {"score": 0.0043215158337835706, "phrase": "system_use"}, {"score": 0.004288261454002681, "phrase": "consequent_performance"}, {"score": 0.004125773078637226, "phrase": "early_stages"}, {"score": 0.004031238480458909, "phrase": "emr._design"}, {"score": 0.0039694170761766226, "phrase": "quantitative_study"}, {"score": 0.0036459102716260784, "phrase": "emr"}, {"score": 0.0031968441980848436, "phrase": "emr_system_implementation"}, {"score": 0.00317221667574882, "phrase": "results_physicians"}, {"score": 0.0025347150832077175, "phrase": "key_technology_perception"}, {"score": 0.0024385083712241988, "phrase": "hospital_administrators"}, {"score": 0.0022222152430170254, "phrase": "patient_satisfaction"}, {"score": 0.0021965609224818853, "phrase": "great_importance"}, {"score": 0.0021049977753042253, "phrase": "physician's_use"}], "paper_keywords": [""], "paper_abstract": "Objective This work seeks to complement and extend prior work by using a multidisciplinary approach to explain electronic medical records (EMR) system use and consequent performance (here, patient satisfaction) among physicians during early stages of the implementation of an EMR. Design This was a quantitative study, with data obtained from three distinct sources: individual-level and social-network data from employees; use data from EMR system logs; and patient satisfaction data from patients and/or authorized decision-makers. Responses were obtained from 151 physicians and 8440 patient satisfaction surveys over the course of a 1-year period at the shakedown phase of an EMR system implementation. Results Physicians who were better connected, both directly and indirectly, to their peers that is, other physicians for advice on their work, used the system less than those who were less connected. In addition to such social network ties, demographic characteristics (gender and age), three personality characteristics (openness to experience, agreeableness and extroversion) and a key technology perception (perceived usefulness) predicted EMR system use. Conclusions For hospital administrators and other stakeholders, understanding the contributors to, and the relative importance of, various factors in explaining EMR system use, and its impact on patient satisfaction is of great importance. The factors identified in this work that influence a physician's use of EMR systems can be used to develop interventions and applications that can increase physician buy-in and use of EMR systems.", "paper_title": "Explaining physicians' use of EMR systems and performance in the shakedown phase", "paper_id": "WOS:000288718400005"}