{"auto_keywords": [{"score": 0.04573629565804587, "phrase": "sign_language_signs"}, {"score": 0.03647638288732214, "phrase": "automatic_system"}, {"score": 0.030879127828332697, "phrase": "automatic_recognizer"}, {"score": 0.00481495049065317, "phrase": "automatic_sign_language_recognition"}, {"score": 0.004707479285061122, "phrase": "sign_language"}, {"score": 0.0045200127552893704, "phrase": "automatic_recognition_systems"}, {"score": 0.004439097815805505, "phrase": "human_signers"}, {"score": 0.004074016501033133, "phrase": "comparable_redundancies"}, {"score": 0.003983016985197904, "phrase": "automatic_sign_language_recognition_system"}, {"score": 0.00357362651129581, "phrase": "uninformative_phases"}, {"score": 0.003369669078274226, "phrase": "isolated_fragments"}, {"score": 0.0031773149810690494, "phrase": "human_signer_experiments"}, {"score": 0.0028764048059439205, "phrase": "central_phase"}, {"score": 0.002687702958515561, "phrase": "recognition_performance"}, {"score": 0.0026157259734105, "phrase": "entire_sign"}, {"score": 0.0025000115574335693, "phrase": "human_signer_studies"}, {"score": 0.0023044434462692483, "phrase": "early_phases"}], "paper_keywords": ["Algorithms", " Experimentation", " Performance", " Sign language perception", " automatic sign language recognition"], "paper_abstract": "Human perception of sign language can serve as inspiration for the improvement of automatic recognition systems. Experiments with human signers show that sign language signs contain redundancy over time. In this article, experiments are conducted to investigate whether comparable redundancies also exist for an automatic sign language recognition system. Such redundancies could be exploited, for example, by reserving more processing resources for the more informative phases of a sign, or by discarding uninformative phases. In the experiments, an automatic system is trained and tested on isolated fragments of sign language signs. The stimuli used were similar to those of the human signer experiments, allowing us to compare the results. The experiments show that redundancy over time exists for the automatic recognizer. The central phase of a sign is the most informative phase, and the first half of a sign is sufficient to achieve a recognition performance similar to that of the entire sign. These findings concur with the results of the human signer studies. However, there are differences as well, most notably the fact that human signers score better on the early phases of a sign than the automatic system. The results can be used to improve the automatic recognizer, by using only the most informative phases of a sign as input.", "paper_title": "Human-Inspired Search for Redundancy in Automatic Sign Language Recognition", "paper_id": "WOS:000289362900007"}