{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "python"}, {"score": 0.009792188958566088, "phrase": "pysy"}, {"score": 0.004744437370338926, "phrase": "enhanced_concurrent_programming"}, {"score": 0.004013662619667083, "phrase": "python's_easy_to_use_and_concise_syntax"}, {"score": 0.0036733470451885465, "phrase": "semantically_equivalent_programs"}, {"score": 0.0034969166048385808, "phrase": "java"}, {"score": 0.003445591238183763, "phrase": "important_aspect"}, {"score": 0.0033950634506367235, "phrase": "language's_flexibility"}, {"score": 0.0033452741392850523, "phrase": "highly_parallelizable_environment"}, {"score": 0.003247868216333148, "phrase": "concurrent_programs"}, {"score": 0.002801651984283755, "phrase": "jr"}, {"score": 0.002680114113899346, "phrase": "easy_to_use_and_expressive_concurrent_environment"}, {"score": 0.002428530921948425, "phrase": "qualitative_and_quantitative_analyses"}, {"score": 0.002404706573379854, "phrase": "well-known_concurrent_programs"}, {"score": 0.0021789194955896124, "phrase": "acceptable_performance"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Python", " concurrency", " distributed programming"], "paper_abstract": "Over the last decade, the popularity of Python has increased considerably. Python is widely used and has been demonstrated to be effective over many problem domains including scripting, prototyping, and simulation. Python's easy to use and concise syntax is highly expressive and allows a developer to create considerably shorter and easier to understand programs than semantically equivalent programs written in languages like C, C++, or Java. An important aspect of any language's flexibility is a highly parallelizable environment that allows its users to write concurrent programs. However, Python is still lacking a high-level, expressive concurrent and distributed programming environment. This paper presents our experience creating PySy, a Python package (on the basis of the SR and JR concurrent programming languages), which provides an easy to use and expressive concurrent environment and allows for the distributed sharing of resources. This paper discusses our design decisions, describes our implementation, and shows qualitative and quantitative analyses of well-known concurrent programs written in PySy. Overall, PySy is reasonable to use for expressing the more common programming scenarios, while it provides acceptable performance. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "PySy: a Python package for enhanced concurrent programming", "paper_id": "WOS:000329764200001"}