{"auto_keywords": [{"score": 0.046400324443240264, "phrase": "large_number"}, {"score": 0.03391924906641819, "phrase": "mmog_market"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_protocols"}, {"score": 0.004600389726895716, "phrase": "multiplayer_online_games"}, {"score": 0.004548253531664032, "phrase": "networked_games"}, {"score": 0.004247560712327667, "phrase": "mmog_worlds"}, {"score": 0.0029822063545668887, "phrase": "mmog"}, {"score": 0.002849078393246526, "phrase": "server_farm"}, {"score": 0.0026302120935562568, "phrase": "small_budgets"}, {"score": 0.0024842242921857705, "phrase": "market_place"}, {"score": 0.0023064582783867645, "phrase": "massively_multiplayer_game_protocols"}, {"score": 0.002241517354570928, "phrase": "performance_bottlenecks"}, {"score": 0.0021049977753042253, "phrase": "business_viability"}], "paper_keywords": ["MMOG", " P2P", " Networking", " Simulation"], "paper_abstract": "Massively Multiplayer Online Games are networked games that allow a large number of people to play together. Classically MMOG worlds are hosted on many powerful servers and players that move around the world are passed from server to server as they pass through the environment. Running a large number of servers can be challenging and there are many considerations for a developer who wants to create a game to enter the MMOG market. If it is possible to use a P2P network to host an MMOG successfully, the costs of running a server farm are taken out of the equation. This will allow for groups with small budgets to enter the MMOG market and help competition in the market place. In this paper, the methods for the design of P2P massively multiplayer game protocols have been presented. Performance bottlenecks have been evaluated and highlighted by using simulations. The business viability has also been discussed in this paper.", "paper_title": "Performance evaluation and simulation of peer-to-peer protocols for Massively Multiplayer Online Games", "paper_id": "WOS:000351692300011"}