{"auto_keywords": [{"score": 0.04895586541793087, "phrase": "algebraic_expertise"}, {"score": 0.010612387000973441, "phrase": "digital_intervention"}, {"score": 0.004215420212546748, "phrase": "netherlands"}, {"score": 0.0037610536973798113, "phrase": "formative_assessment"}, {"score": 0.0036553070575015344, "phrase": "theoretical_concepts"}, {"score": 0.003603549914861701, "phrase": "intervention's_design_principles"}, {"score": 0.003485605409687907, "phrase": "formative_scenarios"}, {"score": 0.0030078460113945136, "phrase": "log_files"}, {"score": 0.002965229277927781, "phrase": "students'_digital_work"}, {"score": 0.002881793492919646, "phrase": "student_survey"}, {"score": 0.0028140548269469934, "phrase": "effect_study"}, {"score": 0.0027610089418453614, "phrase": "multilevel_models"}, {"score": 0.0025343769150179764, "phrase": "post-test_score"}, {"score": 0.0025103699913760057, "phrase": "pre-test_results"}, {"score": 0.002416589459425828, "phrase": "digital_self-tests"}, {"score": 0.002337403139264533, "phrase": "intervention's_success"}, {"score": 0.0021049977753042253, "phrase": "versatile_algebraic_expertise"}], "paper_keywords": ["ICT", " Algebra", " Expertise", " Skills", " Formative assessment", " Feedback", " Design"], "paper_abstract": "In this article we report on the effects of a digital intervention on the development of algebraic expertise of 17-18 year old students in the Netherlands. The question to be answered was whether the intervention would be effective and what factors influenced the outcome. With notions of formative assessment and symbol sense as guiding theoretical concepts, the intervention's design principles included the concepts of crises, formative scenarios and feedback. The intervention aimed to improve algebraic expertise and was deployed in fifteen grade 12 mathematics classes in nine schools. Data included results from pre- and posttests, scores, questionnaires and log files of the students' digital work, and responses to a student survey. Results from the effect study, analyzed with multilevel models, showed that the intervention was effective in improving algebraic expertise. Factors that significantly contributed to the post-test score were pre-test results, the amount of time invested in digital self-tests and attitude towards mathematics. The intervention's success was not significantly influenced by other variables. We conclude that these types of intervention have a potential for the acquisition of versatile algebraic expertise. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of a digital intervention on the development of algebraic expertise", "paper_id": "WOS:000298524300019"}