{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "internet_backbone"}, {"score": 0.004771672073078768, "phrase": "monitoring_network_traffic_and_classifying_applications"}, {"score": 0.004665162327051461, "phrase": "network_administrators"}, {"score": 0.004623224002010226, "phrase": "current_traffic_classification_methods"}, {"score": 0.0037052054802048707, "phrase": "new_applications"}, {"score": 0.003415681637907093, "phrase": "traffic_dispersion_graphs"}, {"score": 0.0031773249073959826, "phrase": "tdg"}, {"score": 0.002955533639862811, "phrase": "network-wide_interactions"}, {"score": 0.0028505007899807446, "phrase": "application_classification_framework"}, {"score": 0.002699889709390707, "phrase": "systematic_way"}, {"score": 0.002592163447843447, "phrase": "network-wide_behavior"}, {"score": 0.002568812627436125, "phrase": "now-level_characteristics"}, {"score": 0.002232579371411544, "phrase": "backbone_traces"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Traffic classification", " Behavioral-approach", " Peer-to-peer", " Graph mining"], "paper_abstract": "Monitoring network traffic and classifying applications are essential functions for network administrators. Current traffic classification methods can be grouped in three categories: (a) now-based (e.g., packet sizing/timing features), (b) payload-based, and (c) host-based. Methods from all three categories have limitations, especially when it comes to detecting new applications, and classifying traffic at the backbone. In this paper, we propose the use of Traffic Dispersion Graphs (TDGs) to remedy these limitations. Given a set of flows, a TDG is a graph with an edge between any two IP addresses that communicate; thus TDGs capture network-wide interactions. Using TDGs, we develop an application classification framework dubbed Graption (Graph-based classification). Our framework provides a systematic way to classify traffic by using information from the network-wide behavior and now-level characteristics of Internet applications. As a proof of concept, we instantiate our framework to detect P2P traffic, and show that it can identify 90% of P2P flows with 95% accuracy in backbone traces, which are particularly challenging for other methods. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Graption: A graph-based P2P traffic classification framework for the internet backbone", "paper_id": "WOS:000291175500021"}