{"auto_keywords": [{"score": 0.0486922705076036, "phrase": "advertising_messages"}, {"score": 0.011986336124758759, "phrase": "microblogging_sites"}, {"score": 0.005464949796160459, "phrase": "diffusion_properties"}, {"score": 0.004814959858439619, "phrase": "breadth"}, {"score": 0.00445195298244008, "phrase": "empirical_assessment"}, {"score": 0.003932129823796712, "phrase": "advertiser-level_factors"}, {"score": 0.0036832960694422765, "phrase": "popular_microblogging_web_site"}, {"score": 0.0036593148359504975, "phrase": "china"}, {"score": 0.003461454328850212, "phrase": "microblogging_web_site"}, {"score": 0.0034388914613623857, "phrase": "generalized_linear_modeling"}, {"score": 0.0032423089921154503, "phrase": "positive_driving_forces"}, {"score": 0.0031482594269532254, "phrase": "message_length"}, {"score": 0.002771152088379478, "phrase": "practical_implications"}, {"score": 0.002735118294625477, "phrase": "optimal_diffusion"}, {"score": 0.002664446536828292, "phrase": "appropriate_time_windows"}, {"score": 0.0024631735269020735, "phrase": "unnecessary_urls"}, {"score": 0.0023760637960293257, "phrase": "diffusion_theory"}, {"score": 0.0023451553255837317, "phrase": "mixed_effects"}, {"score": 0.0023298518405721804, "phrase": "different_information_attributes"}, {"score": 0.002225481283887324, "phrase": "advertisers'_structural_characteristics"}, {"score": 0.0021049977753042253, "phrase": "advertisers'_sales_presentations"}], "paper_keywords": ["Information diffusion", " Microblogging sites", " Social advertising", " Structural characteristics", " Advertising messages"], "paper_abstract": "Purpose - The purpose of this paper is to present an empirical assessment of the diffusion of advertising messages on microblogging sites. The diffusion properties of advertising messages are quantified based on the following three aspects: diffusion breadth, depth, and speed. Furthermore, this study examines the influence of message- and advertiser-level factors on the diffusion of advertising messages. Design/methodology/approach - The study data comprises 20,000 advertising messages that are randomly drawn from a popular microblogging web site in China. Five message- level factors and four advertiser-level factors are constructed based on the information retrieved from the microblogging web site. Generalized linear modeling is adopted to examine the effects of such factors on the diffusion properties of advertising messages. Findings - The positive driving forces underlying the diffusion of advertising messages on microblogging sites include message length, the advertisers' in-degrees, and their reputation. The diffusion of advertising messages is hampered by typicality, affectivity, the completeness of the information of the advertising messages, and advertisers' out-degrees. Practical implications - To achieve optimal diffusion on microblogging sites, advertisers should select the appropriate time windows for releasing advertising messages. Moreover, advertisers should actively increase the number of fans, use less typical and less emotional words in advertising messages, and eliminate unnecessary URLs in such messages. Originality/value - This study contributes to the diffusion theory by identifying the mixed effects of different information attributes on the diffusion of advertising messages on microblogging sites, and examining the roles of advertisers' structural characteristics in the diffusion of advertising messages. Furthermore, the results illustrate how consumers cope with the advertisers' sales presentations on microblogging sites.", "paper_title": "Breadth, depth, and speed: diffusion of advertising messages on microblogging sites", "paper_id": "WOS:000357106300007"}