{"auto_keywords": [{"score": 0.04361989929058287, "phrase": "economic_growth"}, {"score": 0.02322730111336098, "phrase": "contribution_rate"}, {"score": 0.007833446855611442, "phrase": "membership_degree"}, {"score": 0.007290138616115621, "phrase": "contribution_rates"}, {"score": 0.004761850836420121, "phrase": "scientific_and_technological_progress"}, {"score": 0.004631637679516574, "phrase": "chinese_regions"}, {"score": 0.004504969093304219, "phrase": "new_economic_growth_theory"}, {"score": 0.004076858589744185, "phrase": "cobb-douglas_production_function"}, {"score": 0.004009555045206973, "phrase": "solow_residual_value_method"}, {"score": 0.0036893138790705534, "phrase": "chinese"}, {"score": 0.003265090934183249, "phrase": "different_categories"}, {"score": 0.0030208364972341096, "phrase": "obtained_contribution_rate"}, {"score": 0.0023656467839555458, "phrase": "thirty_one_chinese_regions"}, {"score": 0.0021763973978248005, "phrase": "computing_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scientific and technological progress", " Contribution rate of scientific and technological progress", " C-D production function", " Solow residual value method"], "paper_abstract": "According to the new economic growth theory, a new method of computing the contribution rate of scientific and technological (S&T) progress to economic growth based on the Cobb-Douglas production function and the Solow residual value method is proposed in this paper. This method includes three steps: Firstly, according to their levels of S&T progress, fuzzy soft clustering of thirty one Chinese regions is performed to obtain the membership degree of these places to the categories. Secondly, to calculate the contribution rates that different categories of levels of S&T progress contribute to economic growth. Thirdly, to multiply the obtained contribution rate of each category by the membership degree of the place belonging to this category, from which the contribution rate of S&T progress to economic growth in each place is obtained. Finally, this method is used to calculate the contribution rates of S&T progress to economic growth in thirty one Chinese regions during the period from 1998 to 2007. Last but not least, some reasonable suggestions and conclusions are proposed by analyzing the computing results. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Computing of the contribution rate of scientific and technological progress to economic growth in Chinese regions", "paper_id": "WOS:000303281800002"}