{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "circular_genomes"}, {"score": 0.019285917836889214, "phrase": "shared_orthologs"}, {"score": 0.006054534998948936, "phrase": "proposed_procedures"}, {"score": 0.004640079189342692, "phrase": "single_chromosome"}, {"score": 0.004380540407926982, "phrase": "orthologous_genes"}, {"score": 0.0041696157492057, "phrase": "ancestor_gene"}, {"score": 0.00405127920820053, "phrase": "different_species"}, {"score": 0.003952513974962462, "phrase": "bacterial_genomes"}, {"score": 0.00338037259057507, "phrase": "joint_distribution"}, {"score": 0.003204232566468624, "phrase": "bivariate_distributions"}, {"score": 0.003177958355586418, "phrase": "generalized_von_mises_marginals"}, {"score": 0.0030497740719977835, "phrase": "new_measure"}, {"score": 0.0030123335878664064, "phrase": "circular_grade_correlation"}, {"score": 0.0027741761880779535, "phrase": "genome_structure_similarity"}, {"score": 0.0026953359825383624, "phrase": "eight_pairs"}, {"score": 0.002544296663333569, "phrase": "mammalian_pathogens"}, {"score": 0.002391825892939338, "phrase": "genomic_organization"}, {"score": 0.002333421318779658, "phrase": "binding_sites"}, {"score": 0.0021755548389283856, "phrase": "conserved_chromosome_backbones"}, {"score": 0.0021224200236681498, "phrase": "genome_construction"}, {"score": 0.0021049977753042253, "phrase": "synthetic_biology"}], "paper_keywords": [""], "paper_abstract": "Motivation: Most prokaryotic genomes are circular with a single chromosome (called circular genomes), which consist of bacteria and archaea. Orthologous genes (abbreviated as orthologs) are genes directly evolved from an ancestor gene, and can be traced through different species in evolution. Shared orthologs between bacterial genomes have been used to measure their genome evolution. Here, organization of circular genomes is analyzed via distributions of shared orthologs between genomes. However, these distributions are often asymmetric and bimodal; to date, there is no joint distribution to model such data. This motivated us to develop a family of bivariate distributions with generalized von Mises marginals (BGVM) and its statistical inference. Results: A new measure based on circular grade correlation and the fraction of shared orthologs is proposed for association between circular genomes, and a visualization tool developed to depict genome structure similarity. The proposed procedures are applied to eight pairs of prokaryotes separated from domain down to species, and 13 mycoplasma bacteria that are mammalian pathogens belonging to the same genus. We close with remarks on further applications to many features of genomic organization, e.g. shared transcription factor binding sites, between any pair of circular genomes. Thus, the proposed procedures may be applied to identifying conserved chromosome backbones, among others, for genome construction in synthetic biology.", "paper_title": "Modeling and comparing the organization of circular genomes", "paper_id": "WOS:000289162000004"}