{"auto_keywords": [{"score": 0.004774324145784758, "phrase": "decomposition-based_evolutionary_algorithms"}, {"score": 0.004634799977448855, "phrase": "optimization_problems"}, {"score": 0.004330941610682453, "phrase": "decomposition-based_approaches"}, {"score": 0.003995772867224968, "phrase": "reference_point_generation"}, {"score": 0.0036864465771943933, "phrase": "reference_directions"}, {"score": 0.003548368289666932, "phrase": "decomposition-based_evolutionary_algorithm"}, {"score": 0.003533347967582184, "phrase": "wherein_uniformly_distributed_reference_points"}, {"score": 0.0034738975998176323, "phrase": "systematic_sampling"}, {"score": 0.00327356326590461, "phrase": "simple_preemptive_distance_comparison_scheme"}, {"score": 0.0030847461428168614, "phrase": "adaptive_epsilon_formulation"}, {"score": 0.002931569771634119, "phrase": "standard_benchmark_problems"}, {"score": 0.002391067964886602, "phrase": "redundant_objectives"}, {"score": 0.0023708445073819277, "phrase": "disconnected_pareto_fronts"}, {"score": 0.002168531704054597, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "recent_reference_direction-based_approaches"}], "paper_keywords": ["Adaptive epsilon constraint handling", " decomposition", " evolutionary algorithm", " many-objective optimization"], "paper_abstract": "Decomposition-based evolutionary algorithms have been quite successful in solving optimization problems involving two and three objectives. Recently, there have been some attempts to exploit the strengths of decomposition-based approaches to deal with many objective optimization problems. Performance of such approaches are largely dependent on three key factors: 1) means of reference point generation; 2) schemes to simultaneously deal with convergence and diversity; and 3) methods to associate solutions to reference directions. In this paper, we introduce a decomposition-based evolutionary algorithm wherein uniformly distributed reference points are generated via systematic sampling, balance between convergence and diversity is maintained using two independent distance measures, and a simple preemptive distance comparison scheme is used for association. In order to deal with constraints, an adaptive epsilon formulation is used. The performance of the algorithm is evaluated using standard benchmark problems, i.e., DTLZ1-DTLZ4 for 3, 5, 8, 10, and 15 objectives, WFG1-WFG9, the car side impact problem, the water resource management problem, and the constrained ten-objective general aviation aircraft design problem. Results of problems involving redundant objectives and disconnected Pareto fronts are also included in this paper to illustrate the capability of the algorithm. The study clearly highlights that the proposed algorithm is better or at par with recent reference direction-based approaches for many objective optimization.", "paper_title": "A Decomposition-Based Evolutionary Algorithm for Many Objective Optimization", "paper_id": "WOS:000356517700010"}