{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "np-complete_sets"}, {"score": 0.04730141453825046, "phrase": "np-complete_set"}, {"score": 0.015191731207889483, "phrase": "np."}, {"score": 0.013042954982428072, "phrase": "np-p"}, {"score": 0.011477867794704747, "phrase": "sparse_information"}, {"score": 0.01130017741583139, "phrase": "complete_set"}, {"score": 0.010225658877835865, "phrase": "pseudorandom_generators"}, {"score": 0.004423346952963429, "phrase": "p-selective_sparse_set"}, {"score": 0.004381842527244507, "phrase": "l-s"}, {"score": 0.004219663341808316, "phrase": "sparse_set_s"}, {"score": 0.0036976999184012535, "phrase": "sparse_s"}, {"score": 0.0033436911266518073, "phrase": "exp"}, {"score": 0.003179500862953224, "phrase": "exponential_time_complexity_classes"}, {"score": 0.0030907252217934477, "phrase": "one-way_permutations"}, {"score": 0.003032918641059871, "phrase": "open_questions"}, {"score": 0.002733723435814484, "phrase": "secure_one-way_permutations"}, {"score": 0.002463970672403004, "phrase": "strong_but_reasonable_hypothesis"}, {"score": 0.0024107483170103827, "phrase": "np"}, {"score": 0.002313582249239217, "phrase": "up-machine_m"}, {"score": 0.0021655216339356693, "phrase": "m._we"}], "paper_keywords": ["NP-completeness", " robustness", " immunity", " one-way permutations", " disjoint unions"], "paper_abstract": "We study several properties of sets that are complete for NP. We prove that if L is an NP-complete set and S superset of L is a p-selective sparse set, then L-S is <=(p)(m)-hard for NP. We demonstrate the existence of a sparse set S is an element of DTIME(2(2 n)) such that for every L is an element of NP-P, L-S is not <=(p)(m)-hard for NP. Moreover, we prove for every L is an element of NP-P that there exists a sparse S is an element of EXP such that L-S is not <=(p)(m)-hard for NP. Hence, removing sparse information in P from a complete set leaves the set complete, while removing sparse information in EXP from a complete set may destroy its completeness. Previously, these properties were known only for exponential time complexity classes. We use hypotheses about pseudorandom generators and secure one-way permutations to derive consequences for longstanding open questions about whether NP-complete sets are immune. For example, assuming that pseudorandom generators and secure one-way permutations exist, it follows easily that NP-complete sets are not p-immune. Assuming only that secure one-way permutations exist, we prove that no NP-complete set is DTIME(2(n epsilon))-immune. Also, using these hypotheses we show that no NP-complete set is quasi-polynomial-close to P. We introduce a strong but reasonable hypothesis and infer from it that disjoint Turing-complete sets for NP are not closed under union. Our hypothesis asserts the existence of a UP-machine M that accepts 0* such that for some 0<epsilon<1, no 2(n epsilon) time-bounded machine can correctly compute infinitely many accepting computations of M. We show that if UP boolean AND coUP contains DTIME(2(n epsilon))-bi-immune sets, then this hypothesis is true.", "paper_title": "Properties of NP-complete sets", "paper_id": "WOS:000240043700010"}