{"auto_keywords": [{"score": 0.05007850122175858, "phrase": "simultaneous_conflict"}, {"score": 0.04876612507369841, "phrase": "dpl"}, {"score": 0.004720269202737973, "phrase": "double_patterning_lithography"}, {"score": 0.004429566229017728, "phrase": "layout_patterns"}, {"score": 0.0037784540167266497, "phrase": "proper_coloring"}, {"score": 0.0036456298076415652, "phrase": "minimum_distance"}, {"score": 0.003531474887552889, "phrase": "complex_pattern_configurations"}, {"score": 0.0032355864829403413, "phrase": "stitch_insertion"}, {"score": 0.003197200793408836, "phrase": "yield_loss"}, {"score": 0.0028487656293168795, "phrase": "minimization_algorithm"}, {"score": 0.002814956065949522, "phrase": "integer_linear_programming"}, {"score": 0.0027376431569760325, "phrase": "ilp"}, {"score": 0.0023439376937579204, "phrase": "design_rules"}, {"score": 0.002316105585203396, "phrase": "overlap_margin"}, {"score": 0.0022977342663599042, "phrase": "minimum_width"}, {"score": 0.002279508335630797, "phrase": "practical_use"}, {"score": 0.0022434880661725493, "phrase": "off-grid_layout"}], "paper_keywords": ["Double patterning lithography", " integer linear programming", " layout decomposition"], "paper_abstract": "Double patterning lithography (DPL) is considered as a most likely solution for 32 nm/22nm technology. In DPL, the layout patterns are decomposed into two masks (colors), and manufactured through two exposures and etch steps. If the spacing between two features (polygons) is less than certain minimum coloring distance, they have to be assigned opposite colors. However, a proper coloring is not always feasible because two neighboring patterns within the minimum distance may be in the same mask due to complex pattern configurations. In that case, a feature may need to be split into two parts to resolve the conflict, resulting in stitch insertion which causes yield loss due to overlay and line-end effect. While previous layout decomposition approaches perform coloring and splitting separately, in this paper, we propose a simultaneous conflict and stitch minimization algorithm with an integer linear programming (ILP) formulation. Since ILP is in class NP-hard, the algorithm includes three speed-up techniques: 1) grid merging; 2) independent component computation; and 3) layout partition. In addition, our algorithm can be extended to handle design rules such as overlap margin and minimum width for practical use as well as off-grid layout. Our approach can reduce 33% of stitches and remove conflicts by 87.6% compared with two phase greedy decomposition.", "paper_title": "Double Patterning Layout Decomposition for Simultaneous Conflict and Stitch Minimization", "paper_id": "WOS:000273928400003"}