{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dimethyl_sulfoxide_solubility_models"}, {"score": 0.0046328364646343375, "phrase": "domain_applicability_metric"}, {"score": 0.004482206282876944, "phrase": "dimethyl_sulfoxide"}, {"score": 0.004312622975366676, "phrase": "enamine"}, {"score": 0.004241935283741746, "phrase": "ucb"}, {"score": 0.0039269071382230444, "phrase": "analyzed_data_sets"}, {"score": 0.003675517796014622, "phrase": "soluble_molecules"}, {"score": 0.003421245054271364, "phrase": "prediction_performances"}, {"score": 0.003309877074892399, "phrase": "highest_accuracies"}, {"score": 0.0031150035760241705, "phrase": "associative_neural_networks"}, {"score": 0.002931569771634119, "phrase": "individual_data_sets"}, {"score": 0.002669042572650594, "phrase": "nonsoluble_compounds"}, {"score": 0.002337848196418384, "phrase": "structural_features"}, {"score": 0.0022245143503505775, "phrase": "dmso"}, {"score": 0.0021520139248317333, "phrase": "best_models"}, {"score": 0.0021049977753042253, "phrase": "publicly_available_enamine_data_set"}], "paper_keywords": [""], "paper_abstract": "The dimethyl sulfoxide (DMSO) solubility data from Enamine and two UCB pharma compound collections were analyzed using 8 different machine learning methods and 12 descriptor sets. The analyzed data sets were highly imbalanced with 1.7-5.8% nonsoluble compounds. The libraries' enrichment by soluble molecules from the set of 10% of the most reliable predictions was used to compare prediction performances of the methods. The highest accuracies were calculated using a C4.5 decision classification tree, random forest, and associative neural networks. The performances of the methods developed were estimated on individual data sets and their combinations. The developed models provided on average a 2-fold decrease of the number of nonsoluble compounds amid all compounds predicted as soluble in DMSO. However, a 4-9-fold enrichment was observed if only 10% of the most reliable predictions were considered. The structural features influencing compounds to be soluble or nonsoluble in DMSO were also determined. The best models developed with the publicly available Enamine data set are freely available online at http://ochem.eu/article/33409.", "paper_title": "Development of Dimethyl Sulfoxide Solubility Models Using 163 000 Molecules: Using a Domain Applicability Metric to Select More Reliable Predictions", "paper_id": "WOS:000323797700015"}