{"auto_keywords": [{"score": 0.037694919794756004, "phrase": "posteriori_reasoning"}, {"score": 0.034771027312325585, "phrase": "priori_reasoning"}, {"score": 0.025589768305819507, "phrase": "limiting_case"}, {"score": 0.004248782702870078, "phrase": "single_principle"}, {"score": 0.00421668332357505, "phrase": "inductive_reasoning"}, {"score": 0.0038498211283780484, "phrase": "single-trial_probabilities"}, {"score": 0.0038062581748678245, "phrase": "repeatable_chance_process"}, {"score": 0.0031484483754909026, "phrase": "subsequent_probabilistic_deductions"}, {"score": 0.003042697264766327, "phrase": "particular_form"}, {"score": 0.002896167001212006, "phrase": "large_part"}, {"score": 0.002820202660128789, "phrase": "underlying_symmetry"}, {"score": 0.002777689934513217, "phrase": "stronger_the_symmetry"}, {"score": 0.0026338658998573752, "phrase": "long-run_behavior"}, {"score": 0.0024411935317269705, "phrase": "frequency-based_reasoning"}, {"score": 0.00233240715947344, "phrase": "simple_games"}, {"score": 0.002153540857619362, "phrase": "intermediate_forms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Probability", " A priori", " A posteriori", " Symmetry", " Frequency"], "paper_abstract": "We argue that in spite of their apparent dissimilarity, the methodologies employed in the a priori and a posteriori assessment of probabilities can both be justified by appeal to a single principle of inductive reasoning, viz., the principle of symmetry. The difference between these two methodologies consists in the way in which information about the single-trial probabilities in a repeatable chance process is extracted from the constraints imposed by this principle. In the case of a posteriori reasoning, these constraints inform the analysis by fixing an a posteriori determinant of the probabilities, whereas, in the case of a priori reasoning, they imply certain claims which then serve as the basis for subsequent probabilistic deductions. In a given context of inquiry, the particular form which a priori or a posteriori reason may take depends, in large part, on the strength of the underlying symmetry assumed: the stronger the symmetry, the more information can be acquired a priori and the less information about the long-run behavior of the process is needed for an a posteriori assessment of the probabilities. In the context of this framework, frequency-based reasoning emerges as a limiting case of a posteriori reasoning, and reasoning about simple games of chance, as a limiting case of a priori reasoning. Between these two extremes, both a priori and a posteriori reasoning can take a variety of intermediate forms. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the a priori and a posteriori assessment of probabilities", "paper_id": "WOS:000327288300007"}