{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-cognisant_artificial_intelligence_systems"}, {"score": 0.004685012337701536, "phrase": "possible_benefits"}, {"score": 0.004608730887154718, "phrase": "main_issues"}, {"score": 0.004153520149706423, "phrase": "technological_artefacts"}, {"score": 0.003743102131902864, "phrase": "important_step"}, {"score": 0.003702323283528696, "phrase": "greater_autonomy"}, {"score": 0.0031069334778456633, "phrase": "imperfectly_manufactured_item"}, {"score": 0.0027996401456881806, "phrase": "warning_mechanism"}, {"score": 0.002323446065342625, "phrase": "self-reflective_learning"}, {"score": 0.002260591903283384, "phrase": "possible_way"}, {"score": 0.002128220632893247, "phrase": "relevant_areas"}, {"score": 0.0021049977753042253, "phrase": "computer_science"}], "paper_keywords": ["Artificial intelligence", " Robot", " Self-reference", " Machine learning", " Self-cognition", " Self-certification"], "paper_abstract": "This work discusses the challenge of developing self-cognisant artificial intelligence systems, looking at the possible benefits and the main issues in this quest. It is argued that the degree of complexity, variation, and specialisation of technological artefacts used nowadays, along with their sheer number, represent an issue that can and should be addressed through an important step towards greater autonomy, that is, the integration of learning, which will allow the artefact to observe its own functionality and build a model of itself. This model can be used to adjust the expectations from an imperfectly manufactured item, patch up its performance and control its consistency over time, so providing a form of self-certification and a warning mechanism in case of deterioration. It is suggested that these goals cannot be fully achieved without the ability of the learner to model its own performance, and the implications and issues of this self-reflective learning are debated. A possible way of quantifying the faculty for self-cognition is proposed, and relevant areas of computer science, philosophy and the study of the evolution of language are mentioned.", "paper_title": "The Self-Cognisant Robot", "paper_id": "WOS:000308817500012"}