{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "global_user_similarity"}, {"score": 0.02322730111336097, "phrase": "local_user_similarity"}, {"score": 0.007964008905572102, "phrase": "surprisal-based_vector_similarity"}, {"score": 0.004667149874736771, "phrase": "collaborative_filtering"}, {"score": 0.004559270778306828, "phrase": "classical_method"}, {"score": 0.004488734023485018, "phrase": "information_retrieval"}, {"score": 0.004119762981892093, "phrase": "information_overload"}, {"score": 0.003389704997952315, "phrase": "maximin_distance"}, {"score": 0.0033372020049592726, "phrase": "graph_theory"}, {"score": 0.002311933249234786, "phrase": "collaborative_filtering_framework"}, {"score": 0.0022407927161620855, "phrase": "empirical_study"}, {"score": 0.002188874450946842, "phrase": "movielens_dataset"}], "paper_keywords": ["collaborative filtering", " similarity measure", " information theory"], "paper_abstract": "Collaborative filtering as a classical method of information retrieval has been widely used in helping people to deal with information overload. In this paper, we introduce the concept of local user similarity and global user similarity, based on surprisal-based vector similarity and the application of the concept of maximin distance in graph theory. Surprisal-based vector similarity expresses the relationship between any two users based on the quantities of information (called surprisal) contained in their ratings. Global user similarity defines two users being similar if they can be connected through their locally similar neighbors. Based on both of Local User Similarity and Global User Similarity, we develop a collaborative filtering framework called LS&GS. An empirical study using the MovieLens dataset shows that our proposed framework outperforms other state-of-the-art collaborative filtering algorithms.", "paper_title": "A collaborative filtering framework based on both local user similarity and global user similarity", "paper_id": "WOS:000258194500006"}