{"auto_keywords": [{"score": 0.03828620693621283, "phrase": "spare_lines"}, {"score": 0.009503234640681268, "phrase": "memory_manufacturing"}, {"score": 0.00481495049065317, "phrase": "fault-tolerant_scheme"}, {"score": 0.00471700544744796, "phrase": "fault-tolerant_design"}, {"score": 0.004545675105321216, "phrase": "important_role"}, {"score": 0.004471530397729526, "phrase": "yield_rate"}, {"score": 0.004018087343963485, "phrase": "faulty_cells"}, {"score": 0.003985166330358716, "phrase": "spare_memory"}, {"score": 0.0038561471948364723, "phrase": "laser-cutting_technology"}, {"score": 0.0035079364710988627, "phrase": "cutting_location"}, {"score": 0.00338037259057507, "phrase": "bad_cutting_location"}, {"score": 0.0031260524791486347, "phrase": "first_one"}, {"score": 0.0030372426452745073, "phrase": "good_cutting_location"}, {"score": 0.0029509483926257645, "phrase": "previous_algorithms"}, {"score": 0.0029027394930867902, "phrase": "better_approach"}, {"score": 0.002391825892939338, "phrase": "faulty_pattern"}, {"score": 0.002333421318779658, "phrase": "optimal_solution"}, {"score": 0.0022670785913397637, "phrase": "experimental_results"}], "paper_keywords": ["pare cutting approach", " spare cutting approach", " memory reconfiguration problem", " redundant memory", " fault-tolerant"], "paper_abstract": "Fault-tolerant design for memory production is beginning to play an important role in increasing the yield rate of manufacturing. To improve the reliability of memory manufacturing, there are many methods that have been proposed. One of the most used technologies is replacing the faulty cells with spare memory interleaved in the memory. Nowadays, laser-cutting technology improves the yield of memories because of the enhancement of the use of spare lines. However, the issue of choosing a cutting location significantly affects the utilisation of spare lines. A bad cutting location can even render it useless. To use spare lines more efficiently, this article proposes two algorithms. The first one is designed to seek out a good cutting location. It corrects some defects of previous algorithms and provides a better approach to finding cutting candidates. In addition, because most heuristic solution-finding algorithms do not work properly under the condition of cutting memory, the second algorithm, called modification of most-repair is proposed to help make the decision as to whether or not a solution exists for the faulty pattern. We can find an optimal solution by combing these two algorithms. The experimental results show that our proposed algorithms increase the reparable percentage of a 1024-by-1024 memory from 55 to 100% and also improve both the reliability of memory manufacturing and the flexibility of spare lines.", "paper_title": "Optimal cutting design and analysis for fault-tolerant scheme of redundant memories", "paper_id": "WOS:000281159900007"}