{"auto_keywords": [{"score": 0.03188564341795562, "phrase": "checkmate"}, {"score": 0.015465164763662316, "phrase": "lhc"}, {"score": 0.015297253272301407, "phrase": "new_data"}, {"score": 0.01493625658032022, "phrase": "cms"}, {"score": 0.01481454150327719, "phrase": "new_physics"}, {"score": 0.014485601570990025, "phrase": "detector_simulations"}, {"score": 0.014392947694254164, "phrase": "particular_analysis_details"}, {"score": 0.014028136969041479, "phrase": "program_package"}, {"score": 0.013960756840586017, "phrase": "simulated_event_files"}, {"score": 0.013282914538585199, "phrase": "confidence_limits"}, {"score": 0.013219065881762006, "phrase": "detailed_information"}, {"score": 0.013176668428829088, "phrase": "signal_regions"}, {"score": 0.012945869702398284, "phrase": "program_structure"}, {"score": 0.01288362000745991, "phrase": "easy_extensions"}, {"score": 0.012842284426859843, "phrase": "upcoming_lhc_results"}, {"score": 0.012042532211440348, "phrase": "distributed_program"}, {"score": 0.011984573438877403, "phrase": "test_data"}, {"score": 0.011475795956647682, "phrase": "python"}, {"score": 0.011365778379774233, "phrase": "mac"}, {"score": 0.004601417929493065, "phrase": "integrated_luminosity"}, {"score": 0.0043477114072437316, "phrase": "tedious_task"}, {"score": 0.00431961803224392, "phrase": "terascale_energies"}, {"score": 0.0038824203237753444, "phrase": "program"}, {"score": 0.0038624981944755813, "phrase": "checkmate_catalogue"}, {"score": 0.0037942165191367366, "phrase": "cpc_program_library"}, {"score": 0.00378193149213127, "phrase": "queen's_university"}, {"score": 0.003769686371673353, "phrase": "belfast"}, {"score": 0.003757480190200645, "phrase": "n._ireland"}, {"score": 0.003733186380744006, "phrase": "standard_cpc"}, {"score": 0.003527181559366122, "phrase": "tar.gz_programming_language"}, {"score": 0.0034424378558182167, "phrase": "linux"}, {"score": 0.003343339251180502, "phrase": "delphes"}, {"score": 0.003038125530190128, "phrase": "tedious_and_repetitive_task"}, {"score": 0.0027030528947088075, "phrase": "available_experimental_results"}, {"score": 0.0026380273616280893, "phrase": "hard_work"}, {"score": 0.0024923052035101304, "phrase": "anti-kt"}, {"score": 0.002362290075688632, "phrase": "cheng"}, {"score": 0.0023546337544740584, "phrase": "han"}, {"score": 0.0022390081666133627, "phrase": "running_time"}, {"score": 0.0022101055924375725, "phrase": "input_events"}, {"score": 0.0021534125023440895, "phrase": "single_core_calculation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Analysis", " Confidence limits", " Monte Carlo", " Detector simulation", " Delphes", " ROOT", " LHC 12.60.-i"], "paper_abstract": "In the first three years of running, the LHC has delivered a wealth of new data that is now being analysed. With over 20 fb(-1) of integrated luminosity, both ATLAS and CMS have performed many searches for new physics that theorists are eager to test their model against. However, tuning the detector simulations, understanding the particular analysis details and interpreting the results can be a tedious task. CheckmATE (Check Models At Terascale Energies) is a program package which accepts simulated event files in many formats for any model. The program then determines whether the model is excluded or not at 95% C.L. by comparing to many recent experimental analyses. Furthermore the program can calculate confidence limits and provide detailed information about signal regions of interest. It is simple to use and the program structure allows for easy extensions to upcoming LHC results in the future. Program summary Program title: CheckMATE Catalogue identifier: AEUT_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEUT_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 179960 No. of bytes in distributed program, including test data, etc.: 6089336 Distribution format: tar.gz Programming language: C++, Python. Computer: PC, Mac. Operating system: Linux, Mac OS. RAM: Bytes Classification: 11.9. External routines: ROOT, Python, Delphes (included with the distribution) Nature of problem: The LHC has delivered a wealth of new data that is now being analysed. Both ATLAS and CMS have performed many searches for new physics that theorists are eager to test their model against. However, tuning the detector simulations, understanding the particular analysis details and interpreting the results can be a tedious and repetitive task. Solution method: CheckMATE is a program package which accepts simulated event files in many formats for any model. The program then determines whether the model is excluded or not at 95% C.L. by comparing to many recent experimental analyses. Furthermore the program can calculate confidence limits and provide detailed information about signal regions of interest. It is simple to use and the program structure allows for easy extensions to upcoming LHC results in the future. Restrictions: Only a subset of available experimental results have been implemented. Additional comments: Checkmate is built upon the tools and hard work of many people. If Checkmate is used in your publication it is extremely important that all of the following citations are included, Delphes 3 [1]. FastJet [2, 3]. Anti-kt jet algorithm [4]. CL s prescription [5]. In analyses that use the MT2 kinematical discriminant we use the Oxbridge Kinetics Library [6, 7] and the algorithm developed by Cheng and Han [8]. All experimental analyses that were used to set limits in the study. The Monte Carlo event generator that was used. Running time: The running time scales about linearly with the number of input events provided by the user. The detector simulation/analysis of 20000 events needs about 50 s/1 s for a single core calculation on an Intel Core i5-3470 with 3.2 GHz and 8 GB RAM. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "CheckMATE: Confronting your favourite new physics model with LHC data", "paper_id": "WOS:000346954200024"}