{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_camera_networks"}, {"score": 0.013073583498346348, "phrase": "citric"}, {"score": 0.0046432244185370605, "phrase": "new_class"}, {"score": 0.00460125407969429, "phrase": "sensor_network_infrastructure"}, {"score": 0.004477595431209663, "phrase": "high-power_in-network_signal_processing"}, {"score": 0.004051828608343507, "phrase": "low-bandwidth_wireless_camera_network_platform"}, {"score": 0.003440442134680132, "phrase": "mb"}, {"score": 0.003378385493203297, "phrase": "single_device"}, {"score": 0.0032577270508271305, "phrase": "standard_sensor_network_mote"}, {"score": 0.0031990183472675377, "phrase": "wireless_camera_mote"}, {"score": 0.0030017207229983385, "phrase": "decent_operating_system"}, {"score": 0.0028037753646260937, "phrase": "distributed_image"}, {"score": 0.002778385486855157, "phrase": "video_processing"}, {"score": 0.0027282915297520624, "phrase": "in-network_image_processing"}, {"score": 0.0024239973128068787, "phrase": "ieee"}, {"score": 0.002233301265743633, "phrase": "concrete_research_results"}, {"score": 0.002133937537670314, "phrase": "coverage_hole_identification"}, {"score": 0.0021049977753042253, "phrase": "object_recognition"}], "paper_keywords": ["Algorithms", " Wireless Sensor Networks", " Camera Sensor Architecture"], "paper_abstract": "Smart camera networks have recently emerged as a new class of sensor network infrastructure that is capable of supporting high-power in-network signal processing and enabling a wide range of applications. In this article, we provide an exposition of our efforts to build a low-bandwidth wireless camera network platform, called CITRIC, and its applications in smart camera networks. The platform integrates a camera, a microphone, a frequency-scalable (up to 624 MHz) CPU, 16 MB FLASH, and 64 MB RAM onto a single device. The device then connects with a standard sensor network mote to form a wireless camera mote. With reasonably low power consumption and extensive algorithmic libraries running on a decent operating system that is easy to program, CITRIC is ideal for research and applications in distributed image and video processing. Its capabilities of in-network image processing also reduce communication requirements, which has been high in other existing camera networks with centralized processing. Furthermore, the mote easily integrates with other low-bandwidth sensor networks via the IEEE 802.15.4 protocol. To justify the utility of CITRIC, we present several representative applications. In particular, concrete research results will be demonstrated in two areas, namely, distributed coverage hole identification and distributed object recognition.", "paper_title": "A Low-Bandwidth Camera Sensor Platform with Applications in Smart Camera Networks", "paper_id": "WOS:000316964400012"}