{"auto_keywords": [{"score": 0.0494958626187401, "phrase": "time_series_prediction"}, {"score": 0.010612387000973441, "phrase": "rank-based_ensemble"}, {"score": 0.008859656298209444, "phrase": "comtsp"}, {"score": 0.007145380316900038, "phrase": "good_performance"}, {"score": 0.006639763118807343, "phrase": "retsp-value"}, {"score": 0.006199983459406986, "phrase": "remaining_predictor"}, {"score": 0.004733027247615181, "phrase": "ensemble_pruning"}, {"score": 0.0046983433525535365, "phrase": "desirable_and_popular_method"}, {"score": 0.004629732658284854, "phrase": "high_computational_costs"}, {"score": 0.004607084771741802, "phrase": "traditional_ensemble_learning_techniques"}, {"score": 0.00455094636483257, "phrase": "ensemble_pruning_methods"}, {"score": 0.004528682134292651, "phrase": "rank-based_pruning"}, {"score": 0.004451607773464291, "phrase": "performance_advantage"}, {"score": 0.004115570004186379, "phrase": "complementarity_measure"}, {"score": 0.00409545212637643, "phrase": "com"}, {"score": 0.004035585063207576, "phrase": "design_idea"}, {"score": 0.003899319124792991, "phrase": "pruning_sample"}, {"score": 0.0038329147510261473, "phrase": "candidate_predictor"}, {"score": 0.003622559723615179, "phrase": "error_rate"}, {"score": 0.00357837485772307, "phrase": "pruning_set"}, {"score": 0.00352606130954801, "phrase": "selection_step"}, {"score": 0.003500191024670829, "phrase": "second_one"}, {"score": 0.003373649462784305, "phrase": "concurrency_measure"}, {"score": 0.003357126069332372, "phrase": "con"}, {"score": 0.00330803564230463, "phrase": "contsp"}, {"score": 0.0029692499675546017, "phrase": "reduce_error"}, {"score": 0.0026781944023444777, "phrase": "predictive_error"}, {"score": 0.0026585282178839473, "phrase": "series_prediction"}, {"score": 0.002524839485174388, "phrase": "error_direction"}, {"score": 0.0025001458314665745, "phrase": "retsp-trend"}, {"score": 0.002433473462558075, "phrase": "time_series"}, {"score": 0.002403757058012995, "phrase": "forecasting_error"}, {"score": 0.002288467996411331, "phrase": "comparison_experiments"}, {"score": 0.002194820845542919, "phrase": "predictive_ability"}, {"score": 0.002173347836083306, "phrase": "generalization_capability"}, {"score": 0.0021573807590576336, "phrase": "pruned_ensembles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ensemble pruning", " Time series prediction", " Rank-based ensemble pruning", " Complementarity measure for time series prediction (ComTSP)", " Concurrency thinning for time series prediction (ConTSP)", " Reduce Error pruning for time series prediction (ReTSP-Trend)", " Time window size"], "paper_abstract": "Ensemble pruning is a desirable and popular method to overcome the deficiency of high computational costs of traditional ensemble learning techniques. Among various of ensemble pruning methods, rank-based pruning is conceptually the simplest and possesses performance advantage. While four evaluation measures for rank-based ensemble pruning specifically for time series prediction are proposed by us in this paper. The first one, i.e. Complementarity measure for time series prediction (ComTSP), is properly modified from Complementarity measure (COM) for classification. The design idea of ComTSP is, if the error made by the subensemble for a pruning sample is larger than that by the candidate predictor to a certain extent, it is assumed that the predictor is complementary to the subensemble. And the predictor which minimizes the error rate of subensemble on the pruning set will be selected at each selection step. The second one, i.e. Concurrency thinning for time series prediction (ConTSP), is correctly transformed from Concurrency measure (CON) for classification. With ConTSP, a predictor is rewarded for obtaining a good performance, and rewarded more for obtaining a good performance when the subensemble performs badly. A predictor is penalized when both the subensemble and itself perform poorly. The measure ReTSP-Value is specifically designed for Reduce Error (RE) pruning for time series prediction. However, ReTSP-Value and ComTSP have the same flaw that, they could not guarantee the remaining predictor which supplements the subensemble the most will be selected. The cause of this flaw is that the predictive error in time series prediction is directional. It is not reasonable for these measures to take reducing error as the only goal while ignore the error direction. While our finally proposed measure ReTSP-Trend overcomes this defect, taking into consideration the trend of time series and the direction of forecasting error. It could indeed guarantee that the remaining predictor which supplements the subensemble the most will be selected. The comparison experiments on four benchmark financial time series datasets show that the measure ReTSP-Trend outperforms the other measures, which can remarkably improve the predictive ability and promote the generalization capability of the pruned ensembles for time series forecasting. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Several novel evaluation measures for rank-based ensemble pruning with applications to time series prediction", "paper_id": "WOS:000344034300024"}