{"auto_keywords": [{"score": 0.0472606558974219, "phrase": "intersection_information"}, {"score": 0.03529624542703245, "phrase": "proposed_design"}, {"score": 0.004658426838467567, "phrase": "efficient_intersection_locator_design"}, {"score": 0.004149429072483132, "phrase": "intersection_point"}, {"score": 0.003970439654470374, "phrase": "line_segments"}, {"score": 0.00379914165379475, "phrase": "line_segment"}, {"score": 0.003459191419478298, "phrase": "proper_successive_sampling_point"}, {"score": 0.002996992362027833, "phrase": "complex_functional_units"}, {"score": 0.00282048824450047, "phrase": "simultaneous_equations"}, {"score": 0.0026838147966444783, "phrase": "functional_units"}, {"score": 0.0025537472239953807, "phrase": "initial_coefficients"}, {"score": 0.0025257081555100556, "phrase": "afd_algorithm"}, {"score": 0.0021520139248317333, "phrase": "proposed_locator"}], "paper_keywords": ["OpenVG", " Vector graphics", " Bezier curve", " Adaptive-forward-difference", " Forward-difference"], "paper_abstract": "This paper presents an efficient intersection locator design used to generate the intersection information of curves and scan-lines required for the two-dimensional (2D) graphics rasterization process. The conventional method of calculating the intersection point first approximates the curve with enough number of line segments and then solves the two simultaneous equations of each line segment and scan-line. By extending the adaptive-forward-difference (AFD) algorithm to choose the proper successive sampling point of the curve, the proposed design can not only locate the intersection points precisely, but more importantly, it can avoid the use of complex functional units like multipliers and dividers which are typically used in solving simultaneous equations. In addition, our design also reuses the functional units of the locator for the computation of the initial coefficients of AFD algorithm.The intersection information generated by our locator can lead to over 99.6 % accuracy. Our experimental results show that the proposed design requires about 18.1 k gates, and can run at 150 MHz with 90 nm technology. The proposed locator is suitable for embedded dedicated 2D graphics systems.", "paper_title": "An Efficient Curve-Scanline Intersection Locator Design for 2D Graphics Rendering", "paper_id": "WOS:000349013500005"}