{"auto_keywords": [{"score": 0.04328118820753266, "phrase": "sbllm"}, {"score": 0.010612387000973441, "phrase": "permeability_and_pvt_properties"}, {"score": 0.006947288287713643, "phrase": "fuzzy_logic_systems"}, {"score": 0.004783852487938866, "phrase": "oil_and_gas_reservoir"}, {"score": 0.004527462929045081, "phrase": "fuzzy_logic_system"}, {"score": 0.004326624385772596, "phrase": "hybrid_model_setup"}, {"score": 0.004298666679374568, "phrase": "hybrid_intelligent_model"}, {"score": 0.004161553532799662, "phrase": "sensitivity-based_linear_learning_method"}, {"score": 0.003912925129722523, "phrase": "learning_tool"}, {"score": 0.0037392451233558234, "phrase": "generalization_capability"}, {"score": 0.003392507399258166, "phrase": "hybrid_system"}, {"score": 0.0027651847105654363, "phrase": "reservoir_data"}, {"score": 0.0027295084882654917, "phrase": "final_output"}, {"score": 0.0026337482179592422, "phrase": "final_prediction"}, {"score": 0.002591335708291347, "phrase": "unseen_testing_dataset"}, {"score": 0.00257456206600449, "phrase": "comparative_studies"}, {"score": 0.0025248881422983553, "phrase": "different_industrial_reservoir_data"}, {"score": 0.002268287853885277, "phrase": "sbllm_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Type-2 fuzzy logic systems", " Sensitivity-based linear learning method", " Reservoir modeling", " Permeability", " PVT properties", " Hybrid models"], "paper_abstract": "In this work, the power of type-2 fuzzy logic system is demonstrated by using it to improve the prediction of permeability and PVT properties in a hybrid model setup. Hybrid intelligent model through the fusion of type-2 FLS (T2) and sensitivity-based linear learning method (SBLLM) is presented, and is hereby referred to as T2-SBLLM hybrid model. SBLLM, as a learning tool, has gained popularity due to its unique characteristics and performance. However, the generalization capability of SBLLM and other neural network-based solutions often depends on the nature of the dataset, particularly on whether uncertainty is present in the dataset or not. This work proposes a hybrid system through a combination of type-2 fuzzy logic systems (type-2 FLS) and SBLLM, and then uses it to model both permeability and PVT properties of oil and gas reservoir; type-2 FLS has been chosen to be a precursor to SBLLM in order to better handle uncertainties existing in the datasets. The type-2 FLS is used to first handle uncertainties in the reservoir data so that the final output is then passed to the SBLLM for training and then final prediction is done using the unseen testing dataset. Comparative studies have been carried out using different industrial reservoir data for both permeability and PVT properties. Empirical results show that the proposed T2-SBLLM hybrid system outperformed each of the type-2 FLS and SBLLM, as the two constituent models, in all cases, with the improvement made to the SBLLM performance being far higher compared to that of type-2 FLS, since type-2 FLS is originally adept at modeling uncertainties. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Modeling permeability and PVT properties of oil and gas reservoir using hybrid model based on type-2 fuzzy logic systems", "paper_id": "WOS:000351801600013"}