{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spain"}, {"score": 0.004777034835192062, "phrase": "purpose_-_companies"}, {"score": 0.004683540676363745, "phrase": "strategic_reasons"}, {"score": 0.004610058444728656, "phrase": "close-knit_relationships"}, {"score": 0.004573748810476845, "phrase": "third-party_logistics"}, {"score": 0.004014135205423942, "phrase": "case_study"}, {"score": 0.0036940852452587093, "phrase": "main_reasons"}, {"score": 0.003306559295382181, "phrase": "practical_implications"}, {"score": 0.0028446460307503343, "phrase": "cost_reduction"}, {"score": 0.0027559226203857316, "phrase": "supply_chain"}, {"score": 0.0025059724686541263, "phrase": "senior_management"}, {"score": 0.0023801608396295396, "phrase": "existing_gap"}, {"score": 0.002138636271204459, "phrase": "outsourcing_organisation"}, {"score": 0.0021049977753042253, "phrase": "vast_majority"}], "paper_keywords": ["Strategic outsourcing", " Third-party logistics providers", " Case study", " Spain", " Outsourcing"], "paper_abstract": "Purpose - Companies consider logistics outsourcing for strategic reasons, and build close-knit relationships with third-party logistics (3PLs) providers. The purpose of this paper is to analyse logistics outsourcing in Spain from the viewpoint of 3PLs. Design/methodology/approach - The paper suggests three propositions and conducts a case study of four 3PLs in Spain, chosen because of their market coverage and their range of services. Findings - The results identify the main reasons why companies choose to outsource logistics, what kind of relationship they build with providers, and how much involvement in the management of their supply chain they seek from providers. Practical implications - Most companies in Spain continue to outsource mainly on the basis of costs, and do so tactically. However, the option of developing an alliance with a 3PL provider is not always more economical, as cost reduction is due more to optimisation of the supply chain than to outsourcing itself. Based on the experiences of the four 3PLs providers under analysis, the paper makes a set of recommendations for senior management in the sector. Originality/value - The research helps to fill an existing gap in the study of logistics outsourcing in Spain because it analyses logistics outsourcing from the perspective of the 3PLs provider and not from the viewpoint of the outsourcing organisation, as the vast majority of the studies conducted in Spain have done to date.", "paper_title": "Third-party logistics providers in Spain", "paper_id": "WOS:000296823100001"}