{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentation_theory"}, {"score": 0.04411287777932204, "phrase": "information_sources"}, {"score": 0.029520516423983654, "phrase": "information_items"}, {"score": 0.00450633982324153, "phrase": "conflicting_information"}, {"score": 0.004475022550508119, "phrase": "different_sources"}, {"score": 0.003919515745050147, "phrase": "possibly_conflicting_motivations"}, {"score": 0.0033969686698961713, "phrase": "sources'_arguments"}, {"score": 0.003314965171168532, "phrase": "trusted_source"}, {"score": 0.00292339061443511, "phrase": "focused_representation"}, {"score": 0.002249527353528286, "phrase": "formal_way"}, {"score": 0.0021646872269755067, "phrase": "socio-cognitive_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Trust", " Abstract argumentation theory", " Meta-argumentation"], "paper_abstract": "Trust is used to minimise the uncertainty in the interactions of the agents especially in case of conflicting information from different sources. Besides conflicts among information there can also be conflicts about the trust attributed to the information sources. In this paper, we discuss how to reason about trust using argumentation theory, so to express also the possibly conflicting motivations about trust and distrust. The methodology of meta-argumentation allows us to model both information and information sources as arguments and to argue about them. First, we present a model for representing evidence provided as motivation of the sources' arguments to represent the need of a trusted source to believe the information, and we show how to model the information sources in a way that it can be argued whether they should be considered trustworthy or not. Second, we provide a focused representation of trust about the sources in which trust concerns not only the sources but also the information items and the relation with other information. Third, we introduce the feedback on the trustworthiness of the sources and the information items they propose, such that an attack to the trustworthiness of the items feeds back on the trustworthiness of the source. Finally, we distinguish two dimensions of trust, namely competence and sincerity, and we present a formal way to express those dimensions, only informally described in the socio-cognitive models of trust. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A socio-cognitive model of trust using argumentation theory", "paper_id": "WOS:000317379500009"}