{"auto_keywords": [{"score": 0.04930986456658361, "phrase": "dtl"}, {"score": 0.00481495049065317, "phrase": "security_protocol_models"}, {"score": 0.004756805752518494, "phrase": "distributed_temporal_logic"}, {"score": 0.0046803650677267146, "phrase": "expressive_logic"}, {"score": 0.0041784516085055035, "phrase": "different_security_protocol_models"}, {"score": 0.004078078530972285, "phrase": "model_simplifications"}, {"score": 0.003853115465608543, "phrase": "model_reductions"}, {"score": 0.00342568771304873, "phrase": "security_models"}, {"score": 0.003171615440419782, "phrase": "general_theorem"}, {"score": 0.0031459887611258765, "phrase": "sufficient_conditions"}, {"score": 0.0029126002350975634, "phrase": "message-origin_authentication"}, {"score": 0.0028425481299483254, "phrase": "channel-based_and_intruder-centric_models"}, {"score": 0.0024862418814045723, "phrase": "mutatis_mutandis"}, {"score": 0.002264607102799332, "phrase": "subtle_aspects"}, {"score": 0.0022371907579775796, "phrase": "model_transformations"}, {"score": 0.0021307975800397816, "phrase": "first_place"}], "paper_keywords": ["Security protocols", " Security protocol analysis", " Security protocol models", " Temporal logic", " Distributed temporal logic"], "paper_abstract": "The distributed temporal logic DTL is an expressive logic, well suited for formalizing properties of concurrent, communicating agents. We show how DTL can be used as a metalogic to reason about and relate different security protocol models. This includes reasoning about model simplifications, where models are transformed to have fewer agents or behaviors, and verifying model reductions, where to establish the validity of a property it suffices to consider its satisfaction on only a subset of models. We illustrate how DTL can be used to formalize security models, protocols, and properties, and then present three concrete examples of metareasoning. First, we prove a general theorem about sufficient conditions for data to remain secret during communication. Second, we prove the equivalence of two models for guaranteeing message-origin authentication. Finally, we relate channel-based and intruder-centric models, showing that it is sufficient to consider models in which the intruder completely controls the network. While some of these results belong to the folklore or have been shown, mutatis mutandis, using other formalisms. DTL provides a uniform means to prove them within the same formalism. It also allows us to clarify subtle aspects of these model transformations that are often neglected or cannot be specified in the first place. (c) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Distributed temporal logic for the analysis of security protocol models", "paper_id": "WOS:000292353400003"}