{"auto_keywords": [{"score": 0.018182847807468025, "phrase": "lowest_diversion_rate"}, {"score": 0.010612387000973441, "phrase": "waste-management_system"}, {"score": 0.010479039317043937, "phrase": "china"}, {"score": 0.008856065838369408, "phrase": "waste_management"}, {"score": 0.008800057131247126, "phrase": "beijing"}, {"score": 0.00792373764841515, "phrase": "long-term_planning_objective"}, {"score": 0.007435400004912526, "phrase": "highest_diversion_rate"}, {"score": 0.0067368779877062315, "phrase": "system_cost"}, {"score": 0.004292484293656852, "phrase": "chance-constrained_programming_methods"}, {"score": 0.004157648639294148, "phrase": "multiple_uncertainties"}, {"score": 0.004118026552723285, "phrase": "model_parameters"}, {"score": 0.003875674688691641, "phrase": "current_situation"}, {"score": 0.0035103899379658006, "phrase": "medium_diversion_rate"}, {"score": 0.0032100439293541085, "phrase": "lower_significance_level"}, {"score": 0.0031591719975282073, "phrase": "higher_system_reliability"}, {"score": 0.0030017207229983385, "phrase": "increased_risk"}, {"score": 0.0028339216840405873, "phrase": "lowest_system_cost"}, {"score": 0.0027623786741707594, "phrase": "landfill's_lifespan"}, {"score": 0.002616274347640382, "phrase": "fuzzy_mcda_model"}, {"score": 0.0025665698207861533, "phrase": "optimal_solutions"}, {"score": 0.002501759237420687, "phrase": "landfill_lifespan"}, {"score": 0.0024620856338966397, "phrase": "mcda"}, {"score": 0.00221551716210208, "phrase": "net_system_cost"}, {"score": 0.002187356046251648, "phrase": "least_favorable_solution"}, {"score": 0.0021664698544866753, "phrase": "different_scenarios"}, {"score": 0.0021526564019119466, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interval programming", " Chance-constraint", " Waste management", " MCDA", " Solid waste"], "paper_abstract": "An inexact chance-constrained mixed-integer linear programming (ICMILP) model was provided for supporting long-term planning of solid waste management in the City of Beijing, China. The model was formulated by integrating interval-parameter, mixed-integer, and chance-constrained programming methods into a general framework, and effectively dealing with multiple uncertainties associated with model parameters and constraints. Three scenarios were examined for waste management in Beijing: scenario 1 is designed according to the current situation of waste management in the city, which has the lowest diversion rate among the three scenarios; scenario 2 is based on the balance between a long-term planning objective and the current situation with the medium diversion rate; and scenario 3 is based on a long-term planning objective which has the highest diversion rate among the three scenarios. Results from the model indicate that a solution with a lower significance level would lead to a higher system reliability and system cost; conversely, a desire for reducing system cost would result in an increased risk of violating the constraints. The solutions associate with these three scenarios show that scenario 1 has the lowest system cost, but also the lowest diversion rate. A landfill's lifespan may be prolonged by 5 and by 7 years under scenarios 2 and 3, respectively. A fuzzy MCDA model was applied for analyzing the optimal solutions among the three alternatives. With consideration of landfill lifespan, system cost, diversion rate, and public satisfaction, the results from the fuzzy MCDA method illustrate that scenario 3, which has the highest diversion rate and system cost, is the most favorable scheme for supporting the waste-management system in Beijing, and scenario 1, which has the lowest diversion rate and net system cost, is the least favorable solution among the different scenarios. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "An integrated optimization approach and multi-criteria decision analysis for supporting the waste-management system of the City of Beijing, China", "paper_id": "WOS:000277872700019"}