{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_facility_layout_problem"}, {"score": 0.0047283116134926645, "phrase": "inherent_complexity"}, {"score": 0.004518442937844318, "phrase": "challenging_issue"}, {"score": 0.004437115547184535, "phrase": "solution_algorithm"}, {"score": 0.0042209023469249205, "phrase": "different_algorithms"}, {"score": 0.003683097597914604, "phrase": "effective_novel_hybrid_multi-population_genetic_algorithm"}, {"score": 0.0035194572615570977, "phrase": "solution_space"}, {"score": 0.0034876091188625535, "phrase": "different_parts"}, {"score": 0.0033937776228549557, "phrase": "separate_part"}, {"score": 0.002765776659294382, "phrase": "computational_time"}, {"score": 0.0027282915297520624, "phrase": "infeasible_space"}, {"score": 0.0025951294037626174, "phrase": "parameter_tuning"}, {"score": 0.002536763634539386, "phrase": "taguchi_method"}, {"score": 0.002502374576203785, "phrase": "perfectly_tuned_algorithm"}, {"score": 0.002391067964886602, "phrase": "well-known_set"}, {"score": 0.0023372808856170386, "phrase": "different_analyses"}, {"score": 0.0022434880661725493, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dynamic facility layout problem", " Multi-population genetic algorithm", " Heuristics"], "paper_abstract": "Due to inherent complexity of the dynamic facility layout problem, it has always been a challenging issue to develop a solution algorithm for this problem. For more than one decade, many researchers have proposed different algorithms for this problem. After reviewing the shortcomings of these algorithms, we realize that the performance can be further improved by a more intelligent search. This paper develops an effective novel hybrid multi-population genetic algorithm. Using a proposed heuristic procedure, we separate solution space into different parts and each subpopulation represents a separate part. This assures the diversity of the algorithm. Moreover, to intensify the search more and more, a powerful local search mechanism based on simulated annealing is developed. Unlike the available genetic operators previously proposed for this problem, we design the operators so as to search only the feasible space; thus, we save computational time by avoiding infeasible space. To evaluate the algorithm, we comprehensively discuss the parameter tuning of the algorithms by Taguchi method. The perfectly tuned algorithm is then compared with 11 available algorithms in the literature using well-known set of benchmark instances. Different analyses conducted on the results, show that the proposed algorithm enjoys the superiority and outperformance over the other algorithms. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A hybrid multi-population genetic algorithm for the dynamic facility layout problem", "paper_id": "WOS:000343138500039"}