{"auto_keywords": [{"score": 0.028028462835376203, "phrase": "bmiq"}, {"score": 0.00481495049065317, "phrase": "probe_design_bias"}, {"score": 0.004771672073078768, "phrase": "illumina_infinium"}, {"score": 0.004602395776895036, "phrase": "prime_candidate_technology"}, {"score": 0.004561019117546361, "phrase": "epigenome-wide_association_studies"}, {"score": 0.004129607015893271, "phrase": "widely_different_dna_methylation_distributions"}, {"score": 0.003983016985197904, "phrase": "downstream_analyses"}, {"score": 0.003929391999210588, "phrase": "key_statistical_issue"}, {"score": 0.003638823482920949, "phrase": "novel_model-based_intra-array_normalization_strategy"}, {"score": 0.0033393377529146893, "phrase": "statistical_distribution_characteristic"}, {"score": 0.003191714656606822, "phrase": "three-state_beta-mixture_model"}, {"score": 0.002712131567923321, "phrase": "cell-line_data"}, {"score": 0.002687702958515561, "phrase": "fresh_frozen_and_paraffin-embedded_tumour_tissue_samples"}, {"score": 0.0024440836179156593, "phrase": "normalization_procedure"}, {"score": 0.002400241288973103, "phrase": "technical_variation"}, {"score": 0.0022631003204259224, "phrase": "lower_dynamic_range"}, {"score": 0.002162951519368368, "phrase": "preprocessing_step"}], "paper_keywords": [""], "paper_abstract": "Motivation: The Illumina Infinium450 k DNA Methylation Beadchip is a prime candidate technology for Epigenome-Wide Association Studies (EWAS). However, a difficulty associated with these beadarrays is that probes come in two different designs, characterized by widely different DNA methylation distributions and dynamic range, which may bias downstream analyses. A key statistical issue is therefore how best to adjust for the two different probe designs. Results: Here we propose a novel model-based intra-array normalization strategy for 450 k data, called BMIQ (Beta MIxture Quantile dilation), to adjust the beta-values of type2 design probes into a statistical distribution characteristic of type1 probes. The strategy involves application of a three-state beta-mixture model to assign probes to methylation states, subsequent transformation of probabilities into quantiles and finally a methylation-dependent dilation transformation to preserve the monotonicity and continuity of the data. We validate our method on cell-line data, fresh frozen and paraffin-embedded tumour tissue samples and demonstrate that BMIQ compares favourably with two competing methods. Specifically, we show that BMIQ improves the robustness of the normalization procedure, reduces the technical variation and bias of type2 probe values and successfully eliminates the type1 enrichment bias caused by the lower dynamic range of type2 probes. BMIQ will be useful as a preprocessing step for any study using the Illumina Infinium 450 k platform.", "paper_title": "A beta-mixture quantile normalization method for correcting probe design bias in Illumina Infinium 450 k DNA methylation data", "paper_id": "WOS:000313722800006"}