{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "health_behaviors"}, {"score": 0.004739344544832536, "phrase": "previous_work"}, {"score": 0.004635477242873163, "phrase": "health_behavior"}, {"score": 0.00459165923324494, "phrase": "social_contexts"}, {"score": 0.004519543557571175, "phrase": "behavior_documentation"}, {"score": 0.00444855545435494, "phrase": "virtual_rewards"}, {"score": 0.004420472010542188, "phrase": "rich_visualizations"}, {"score": 0.004309892341117025, "phrase": "social_influence"}, {"score": 0.004242183179689357, "phrase": "improved_behaviors"}, {"score": 0.004215397034321004, "phrase": "friendly_competition"}, {"score": 0.004149166224411185, "phrase": "emotional_and_informational_support"}, {"score": 0.003666908853711961, "phrase": "particular_portrayal"}, {"score": 0.0035864603175592854, "phrase": "prior_work"}, {"score": 0.003344895435289136, "phrase": "geographically_distributed_strangers"}, {"score": 0.003240521834737935, "phrase": "performative_nature"}, {"score": 0.0031393948330209224, "phrase": "different_social_group"}, {"score": 0.0031096747349602344, "phrase": "local_neighborhood"}, {"score": 0.0030704837930305745, "phrase": "community_mosaic"}, {"score": 0.0029840952148215733, "phrase": "collectivistic_focus"}, {"score": 0.002587180385280577, "phrase": "participants'_motivations"}, {"score": 0.002412758703672514, "phrase": "performative_aspects"}, {"score": 0.0023974961635593135, "phrase": "photograph_staging"}, {"score": 0.002382329940096419, "phrase": "textual_narration"}, {"score": 0.0021522871388240444, "phrase": "behavior_monitoring_tools"}, {"score": 0.0021049977753042253, "phrase": "users'_perceived_audience"}], "paper_keywords": ["Health monitoring", " Reflection", " Performance", " Social computing", " Community computing", " Nutrition"], "paper_abstract": "Previous work has examined how technology can support health behavior monitoring in social contexts. These tools incentivize behavior documentation through the promise of virtual rewards, rich visualizations, and improved co-management of disease. Social influence is leveraged to motivate improved behaviors through friendly competition and the sharing of emotional and informational support. Prior work has described how by documenting and sharing behaviors in these tools, people engage in performances of the self. This performance happens as users selectively determine what information to share and hide, crafting a particular portrayal of their identity. Much of the prior work in this area has examined the implications of systems that encourage people to share their behaviors with friends, family, and geographically distributed strangers. In this paper, we report upon the performative nature of behavior sharing in a system created for a different social group: the local neighborhood. We designed Community Mosaic (CM), a system with a collectivistic focus: this tool asks users to document their behaviors using photographs and text, but not for their own benefit-for the benefit of others in their community. Through a 6-week deployment of CM, we evaluated the nature of behavior sharing in this system, including participants' motivations for sharing, the way in which this sharing happened, and the reflexive impact of sharing. Our findings highlight the performative aspects of photograph staging and textual narration and how sharing this content led participants to become more aware and evaluative of their behaviors, and led them to try to eat more healthfully. We conclude with recommendations for behavior monitoring tools, specifically examining the implications of users' perceived audience and automated behavioral tracking on opportunities for reflection-through-performance.", "paper_title": "Reflection-through-performance: personal implications of documenting health behaviors for the collective", "paper_id": "WOS:000342454500014"}