{"auto_keywords": [{"score": 0.04508162406013034, "phrase": "vehicular_systems"}, {"score": 0.011447270630167997, "phrase": "convenience_type"}, {"score": 0.00481495049065317, "phrase": "location-based_service_discovery"}, {"score": 0.004678940805063634, "phrase": "intelligent_transportation_systems"}, {"score": 0.004054169947971483, "phrase": "service_discovery_mechanism"}, {"score": 0.003828187766572941, "phrase": "existing_services"}, {"score": 0.0033806943112103397, "phrase": "secure_service_discovery"}, {"score": 0.003348513474852869, "phrase": "communication_protocol"}, {"score": 0.003222814590544802, "phrase": "malicious_processes"}, {"score": 0.003176899769744057, "phrase": "vehicular_system"}, {"score": 0.003043031131345537, "phrase": "possible_attacks"}, {"score": 0.0029569247903654477, "phrase": "service_discovery_and_communication_processes"}, {"score": 0.0025737890313763407, "phrase": "security_requirements"}, {"score": 0.0023388183537341213, "phrase": "high_success_rate"}, {"score": 0.00230546852838578, "phrase": "secure_discovery"}, {"score": 0.002176747110119268, "phrase": "low_discovery_delays"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["service discovery", " vehicular networks", " security"], "paper_abstract": "Intelligent transportation systems have attracted many researchers. These latter have invested much effort to develop many applications and services mainly for vehicular systems. Services can be classified as safety or convenience services. A service discovery mechanism is needed to permit the discovery and the interaction with the existing services. However, so far security issues for service discovery in vehicular systems have not been widely considered, mainly for the convenience type of applications. Thus, a secure service discovery and communication protocol is necessary to prevent from many attacks and malicious processes in the vehicular system. In this paper, we investigate the possible attacks that can occur during the service discovery and communication processes. Then, we present our proposed group-based authentication scheme for secure service discovery and communication in vehicular systems. Our proposed scheme is mainly dedicated for the convenience type of applications. We discuss the security requirements achieved by our proposed protocol and we report on its performance evaluation. We prove through our extensive set of simulations that our proposed scheme achieves a high success rate for the secure discovery of services, while maintaining the scalability of the network and low discovery delays. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Efficient group-based authentication protocol for location-based service discovery in intelligent transportation systems", "paper_id": "WOS:000316820600009"}