{"auto_keywords": [{"score": 0.04499108676167184, "phrase": "cast_shadows"}, {"score": 0.00737892612069917, "phrase": "sparse_representation"}, {"score": 0.00481495049065317, "phrase": "cast_shadows_via_sparse_representation"}, {"score": 0.0043511221096418475, "phrase": "single_image"}, {"score": 0.003727527379253624, "phrase": "low-dimensional_linear_subspaces"}, {"score": 0.003422462630994095, "phrase": "lambertian_scene"}, {"score": 0.003261934055562238, "phrase": "sparse_set"}, {"score": 0.0031760175583084274, "phrase": "directional_light_sources"}, {"score": 0.0029789104204803137, "phrase": "diffusive_part"}, {"score": 0.002869613770219469, "phrase": "residual_part"}, {"score": 0.0023424328921363585, "phrase": "effective_and_fast_solution"}, {"score": 0.0023051837161137674, "phrase": "recent_advances"}, {"score": 0.0022087165619569006, "phrase": "synthetic_and_real_data"}], "paper_keywords": ["Compressive sensing", " l(1) minimization", " illumination recovery", " inverse lighting", " sparse representation"], "paper_abstract": "In this paper, we propose using sparse representation for recovering the illumination of a scene from a single image with cast shadows, given the geometry of the scene. The images with cast shadows can be quite complex and, therefore, cannot be well approximated by low-dimensional linear subspaces. However, it can be shown that the set of images produced by a Lambertian scene with cast shadows can be efficiently represented by a sparse set of images generated by directional light sources. We first model an image with cast shadows composed of a diffusive part (without cast shadows) and a residual part that captures cast shadows. Then, we express the problem in an l(1)-regularized least-squares formulation, with nonnegativity constraints (as light has to be non-negative at any point in space). This sparse representation enjoys an effective and fast solution thanks to recent advances in compressive sensing. In experiments on synthetic and real data, our approach performs favorably in comparison with several previously proposed methods.", "paper_title": "Illumination Recovery From Image With Cast Shadows Via Sparse Representation", "paper_id": "WOS:000293692300025"}