{"auto_keywords": [{"score": 0.049596205816074275, "phrase": "range_images"}, {"score": 0.007740489563401459, "phrase": "automatic_pairwise_registration"}, {"score": 0.004718314112245913, "phrase": "automatic_registration"}, {"score": 0.004600228893803583, "phrase": "fundamental_problem"}, {"score": 0.003736567662016446, "phrase": "used_feature_representation"}, {"score": 0.003642962673467835, "phrase": "novel_feature"}, {"score": 0.0033759367489122716, "phrase": "novel_tensor_representation"}, {"score": 0.0032251796659158696, "phrase": "third_order_tensors"}, {"score": 0.0031926001871260524, "phrase": "multiple_tensors"}, {"score": 0.00309681702203087, "phrase": "range_image"}, {"score": 0.002797757576619329, "phrase": "pairwise_registration"}, {"score": 0.0027276063888634424, "phrase": "experimental_results"}, {"score": 0.002226017732566121, "phrase": "spin_image_representation"}, {"score": 0.0021049977753042253, "phrase": "low_resolution"}], "paper_keywords": ["correspondence", " automatic registration", " feature matching", " shape descriptor", " 3D representation", " 3D modeling"], "paper_abstract": "Automatic registration of range images is a fundamental problem in 3D modeling of free-from objects. Various feature matching algorithms have been proposed for this purpose. However, these algorithms suffer from various limitations mainly related to their applicability, efficiency, robustness to resolution, and the discriminating capability of the used feature representation. We present a novel feature matching algorithm for automatic pairwise registration of range images which overcomes these limitations. Our algorithm uses a novel tensor representation which represents semi-local 3D surface patches of a range image by third order tensors. Multiple tensors are used to represent each range image. Tensors of two range images are matched to identify correspondences between them. Correspondences are verified and then used for pairwise registration of the range images. Experimental results show that our algorithm is accurate and efficient. Moreover, it is robust to the resolution of the range images, the number of tensors per view, the required amount of overlap, and noise. Comparisons with the spin image representation revealed that our representation has more discriminating capabilities and performs better at a low resolution of the range images.", "paper_title": "A novel representation and feature matching algorithm for automatic pairwise registration of range images", "paper_id": "WOS:000235198800002"}