{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fault_attacks"}, {"score": 0.004103212598803194, "phrase": "implementation_attacks"}, {"score": 0.004048860957751714, "phrase": "advanced_encryption_standard"}, {"score": 0.0039952539910814554, "phrase": "aes"}, {"score": 0.0038900709793274484, "phrase": "aes_algorithm"}, {"score": 0.0035908627899097407, "phrase": "conventional_cryptanalytic_attacks"}, {"score": 0.0034963129868796033, "phrase": "algebraic_or_mathematical_weaknesses"}, {"score": 0.0030595112110658675, "phrase": "faulty_cipher_output"}, {"score": 0.00260657976055413, "phrase": "demonstration_purposes"}, {"score": 0.002520990102833368, "phrase": "complex_mathematical_analysis"}, {"score": 0.0024875444192203485, "phrase": "programming_algorithms"}, {"score": 0.0021049977753042253, "phrase": "attack_methods"}], "paper_keywords": ["Fault attack", " AES", " cryptanalysis"], "paper_abstract": "This research presents the survey, analysis, comparisons and implementation of the most threatening new kind of cryptographic attacks known as fault attacks or implementation attacks against Advanced Encryption Standard (AES) algorithm. AES algorithm is used in various applications and is considered the most secure against conventional cryptanalytic attacks which exploits the algebraic or mathematical weaknesses in the crypto-systems. Fault attacks are based on interrupting the execution of the algorithm in such a way that it produces faulty cipher output which can be analysed to break the algorithm. This research survey various fault attacks and provide implementation of three of them in detail for demonstration purposes. It mapped the complex mathematical analysis into programming algorithms for ease of implementation. At the end it compares various types of attacks based on our devised criteria of efficiency, flexibility and usability of the attack methods.", "paper_title": "Implementation and Comparative Analysis of the Fault Attacks on AES", "paper_id": "WOS:000329949200013"}