{"auto_keywords": [{"score": 0.04795845458902327, "phrase": "living_systems"}, {"score": 0.026831747073449014, "phrase": "autopoietic_loop"}, {"score": 0.00481495049065317, "phrase": "autonomous_agents"}, {"score": 0.004733901576706854, "phrase": "roboticle_perspective"}, {"score": 0.004680624753255133, "phrase": "autonomous_robots"}, {"score": 0.003882970272082245, "phrase": "open_systems"}, {"score": 0.0034867406208212146, "phrase": "roboticle_framework"}, {"score": 0.003239114833599948, "phrase": "autonomous_robot_control_unit"}, {"score": 0.0027017308406240563, "phrase": "highly_organized_internal_control_structure"}, {"score": 0.0026411384812121503, "phrase": "external_applied_perturbations"}, {"score": 0.0025965853546625352, "phrase": "necessary_energy_balancing"}, {"score": 0.0021049977753042253, "phrase": "adaptive_properties"}], "paper_keywords": ["autonomous robots", " roboticle framework", " autopoietic loop"], "paper_abstract": "Autonomous robots, like living systems, must be adaptive in nature if we want them to preserve their integrity while completing their mission. The challenge to survive in their environment is better accomplished if they are open systems, interacting with the environment by exchanging matter, energy, information, and so on. The roboticle framework, presented here forth, is an attempt to model how the autonomous robot control unit works. It borrows from living systems the idea that sensing and acting on the environment can be recognized as a mechanism exchanging energy with the environment in order to maintain an highly organized internal control structure to resist to external applied perturbations. The necessary energy balancing is provided by an autopoietic loop which is fed by the energy entering the robot through its sensor devices and it is dissipated by its effectors for properly acting in the environment. The autopoietic loop is also responsible of the adaptive properties of the robot.", "paper_title": "Issues on autonomous agents from a roboticle perspective", "paper_id": "WOS:000258564000005"}