{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conjunctive_queries"}, {"score": 0.007850315001985929, "phrase": "query_q"}, {"score": 0.005507269455854781, "phrase": "view_set"}, {"score": 0.004192803336288522, "phrase": "widely_studied_technique"}, {"score": 0.0035965032173588753, "phrase": "view_set_v"}, {"score": 0.0029381648092259064, "phrase": "set_v"}, {"score": 0.0027466028572379455, "phrase": "interesting_cases"}, {"score": 0.002463830258460528, "phrase": "equivalent_rewritings"}, {"score": 0.002436289099444074, "phrase": "almost_all\"_queries"}, {"score": 0.0022101055924375725, "phrase": "restricted_results"}, {"score": 0.00216907363015155, "phrase": "broader_classes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Determinacy", " Views", " Query rewriting", " Query answering", " Conjunctive queries", " Chain queries", " Path queries", " First order logic"], "paper_abstract": "Answering queries using views is the problem which examines how to derive the answers to a query when we only have the answers to a set of views. Constructing rewritings is a widely studied technique to derive those answers. In this paper we consider the problem of the existence of rewritings in the case where the answers to the views uniquely determine the answers to the query. Specifically, we say that a view set V determines a query Q if for any two databases D(1), D(2) it holds: V(D(1)) = V(D(2)) implies Q(D(1)) = Q (D(2)). We consider the case where query and views are defined by conjunctive queries and investigate the question: If a view set V determines a query Q, is there an equivalent rewriting of Q using V? We present here interesting cases where there are such rewritings in the language of conjunctive queries. Interestingly, we identify a class of conjunctive queries, CQ(path), for which a view set can produce equivalent rewritings for \"almost all\" queries which are determined by this view set. We introduce a problem which relates determinacy to query equivalence. We show that there are cases where restricted results can carry over to broader classes of queries. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Determinacy and query rewriting for conjunctive queries and views", "paper_id": "WOS:000287791400004"}