{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "software_engineering_publications"}, {"score": 0.04509347182239666, "phrase": "female_participation"}, {"score": 0.004538045400396629, "phrase": "software_engineering_research_publications"}, {"score": 0.004418666248371415, "phrase": "well-defined_procedure"}, {"score": 0.004340822341073993, "phrase": "empirical_study"}, {"score": 0.003983404013173127, "phrase": "two-year_period"}, {"score": 0.0035485301437669656, "phrase": "female_distribution"}, {"score": 0.003465350958971198, "phrase": "geographical_location"}, {"score": 0.0032755054812060444, "phrase": "data_collection"}, {"score": 0.0032082065314048974, "phrase": "female_authors"}, {"score": 0.0031703706626348507, "phrase": "female_editors"}, {"score": 0.00296128862361938, "phrase": "representation_rates"}, {"score": 0.0028492532869274743, "phrase": "editorial_boards"}, {"score": 0.0027659570272100835, "phrase": "quantitative_data"}, {"score": 0.0026771333996253783, "phrase": "major_software_engineering_journals"}, {"score": 0.00260657976055413, "phrase": "important_differences"}, {"score": 0.002194337509146714, "phrase": "editorial_boards_members"}], "paper_keywords": ["Gender study", " Empirical research", " Research publications", " Software engineering"], "paper_abstract": "To the best of our knowledge, no works analyzing the participation of women as authors and editors in software engineering research publications currently exist. We have therefore followed a well-defined procedure in order to conduct an empirical study of female participation in 12 leading software engineering journals. We have analyzed the gender of the authors, editorial board members, associate editors and editors-in-chief over a two-year period in order to analyze, on the one hand, the rate of participation of women as authors and as editors in software engineering publications, and on the other, whether women are underrepresented. We have also analyzed the female distribution of authors and editors according to the geographical location of their institutions. This was done by first selecting the journals to be used as the population for data collection which then allowed us to identify female authors of papers and female editors, including the country in which their institutions are located. This eventually led to an analysis of female participation in order to understand representation rates. We analyzed 3,546 authors of 1,266 papers in 61 different countries, and 363 members of editorial boards in 30 different countries. The results of this analysis provide quantitative data concerning the participation of women as authors and editors in major software engineering journals including their distribution per country, in which important differences have been found. The results obtained were first used to compare the participation of women as authors and editors and were then used to carry out a series of simulations in order to be able to statistically confirm whether women are underrepresented. The study shows, amongst other things, that women are not underrepresented as editorial boards members and as editors-in-chief of the journals studied, although their representation as editors-in-chief is low.", "paper_title": "Participation of women in software engineering publications", "paper_id": "WOS:000310964500006"}