{"auto_keywords": [{"score": 0.030864586550531856, "phrase": "cloudnet"}, {"score": 0.00481495049065317, "phrase": "cloud_computing_platforms"}, {"score": 0.004406994912939125, "phrase": "existing_offerings"}, {"score": 0.004278807087784626, "phrase": "basic_computation"}, {"score": 0.0038246602895705643, "phrase": "cloud_computing"}, {"score": 0.003757480190200645, "phrase": "great_potential"}, {"score": 0.003479692058963528, "phrase": "network_resources"}, {"score": 0.0034388111429203222, "phrase": "security_needs"}, {"score": 0.0030374213037172803, "phrase": "data_center_resources"}, {"score": 0.0027796495180095657, "phrase": "virtual_private_networks"}, {"score": 0.0026827569390113822, "phrase": "cloud_and_enterprise_sites"}, {"score": 0.0025286975935774245, "phrase": "data_centers"}, {"score": 0.0024118292918742967, "phrase": "cloud_resources"}, {"score": 0.0021049977753042253, "phrase": "enterprise_settings"}], "paper_keywords": ["cloud computing", " IT management", " data centers", " virtualization", " virtual private networks", " security"], "paper_abstract": "Cloud computing platforms such as Amazon EC2 provide customers with flexible, on-demand resources at low cost. However, while existing offerings are useful for providing basic computation and storage resources, they have not provided the transparency, security and network controls that many enterprise customers would like. While cloud computing has a great potential to change how enterprises run and manage their IT systems, a more comprehensive control over network resources and security needs to be provided for such users. Toward this goal, we propose a virtual cloud pool (VCP) abstraction to logically unify cloud and enterprise data center resources, and present the vision behind CloudNet, a cloud platform architecture that utilizes virtual private networks to securely and seamlessly link cloud and enterprise sites. It also enables the pooling of resources across data centers to provide enterprises the capability of having cloud resources that are dynamic and adaptive to their needs. We describe several usage scenarios for VCPs and discuss the benefits of using this abstraction in enterprise settings.", "paper_title": "Enterprise-Ready Virtual Cloud Pools: Vision, Opportunities and Challenges", "paper_id": "WOS:000307171400007"}