{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "usability_assessment"}, {"score": 0.048877326221094704, "phrase": "wheelchair-mounted_robot_manipulator"}, {"score": 0.004480307124735185, "phrase": "innovative_methodology"}, {"score": 0.003995772867224968, "phrase": "case_study"}, {"score": 0.003797530813314321, "phrase": "physically_disabled_people"}, {"score": 0.003670843919846253, "phrase": "synthetic_usability_index"}, {"score": 0.003459192448427086, "phrase": "saaty"}, {"score": 0.0031643005824589917, "phrase": "cross-array_experimental_plan"}, {"score": 0.003071682293903262, "phrase": "control_and_noise_factors"}, {"score": 0.0030071857666598193, "phrase": "subjective_user_evaluations"}, {"score": 0.0026363807171515255, "phrase": "proposed_approach"}, {"score": 0.0025810006125483835, "phrase": "quantitative_indexes"}, {"score": 0.0024527767211457046, "phrase": "participatory_design_session"}, {"score": 0.0024012441367538434, "phrase": "vr_technologies"}, {"score": 0.0023408288327263316, "phrase": "experimental_data"}, {"score": 0.0021049977753042253, "phrase": "noise_factors"}], "paper_keywords": ["Participatory design", " Virtual reality experiments", " Assistive robotics", " Usability index", " Analytic hierarchy process (AHP)"], "paper_abstract": "The aim of the paper is to address an innovative methodology for assessing the usability of a product. This methodology is particularly suitable for designing products that provide their main functions through their control interfaces. In particular, this case study relates to the usability assessment of two control devices for a wheelchair-mounted robot manipulator to assist physically disabled people. The study focuses on defining a synthetic usability index on the basis of two currently used methods: the multi criteria decision analysis and the Saaty's analytic hierarchy process. Several virtual reality (VR)-based experiments have been conducted, set up in accordance with a cross-array experimental plan, that adequately caters for both control and noise factors. Quantitative measures and subjective user evaluations have been collected to maximize the effectiveness, the efficiency and the satisfaction perceived by users while using the product. Compared to the literature on the subject, the proposed approach provides both more flexibility in defining quantitative indexes and more adequate results, even when involving only a small sample of users in the participatory design session. The use of VR technologies for the collection of the experimental data has been essential in terms of safety, costs and repeatability of the tests, as well as of the robustness with respect to noise factors.", "paper_title": "A virtual reality approach for usability assessment: case study on a wheelchair-mounted robot manipulator", "paper_id": "WOS:000320456400009"}