{"auto_keywords": [{"score": 0.049014830901543974, "phrase": "partition_integrity"}, {"score": 0.008079319992405585, "phrase": "different_trade-offs"}, {"score": 0.007617996190543974, "phrase": "rb"}, {"score": 0.006277681519049429, "phrase": "evolutionary_process"}, {"score": 0.005985226786286036, "phrase": "purposely_defined_index"}, {"score": 0.00481495049065317, "phrase": "multi-objective_evolutionary_fuzzy_systems"}, {"score": 0.004603244077348199, "phrase": "multi-objective_evolutionary_algorithms"}, {"score": 0.0045262653692203815, "phrase": "mamdani_fuzzy_rule-based_systems"}, {"score": 0.004327196832280818, "phrase": "common_approach"}, {"score": 0.004230956171850591, "phrase": "rule_base"}, {"score": 0.004079090520520216, "phrase": "fuzzy_partitions"}, {"score": 0.0036656047855140386, "phrase": "membership_function"}, {"score": 0.0030614565460256897, "phrase": "three-objective_evolutionary_algorithm"}, {"score": 0.0030101827310631915, "phrase": "mfrbss"}, {"score": 0.0028775998963807324, "phrase": "mf_parameters"}, {"score": 0.002853396755102163, "phrase": "linguistic_variables"}, {"score": 0.002727700630869639, "phrase": "predicted_values"}, {"score": 0.0026744596572861093, "phrase": "total_number"}, {"score": 0.002535115422089855, "phrase": "proposed_approach"}, {"score": 0.0024996652869401837, "phrase": "six_real-world_regression_problems"}, {"score": 0.0022842059306412304, "phrase": "rbs_and_mf_parameters"}, {"score": 0.002233301265743633, "phrase": "parameter_tuning"}, {"score": 0.0021835285538696673, "phrase": "best_trade-offs"}, {"score": 0.0021049977753042253, "phrase": "similar_moea"}], "paper_keywords": ["Accuracy-interpretability trade-off", " Partition integrity index", " Multi-objective evolutionary fuzzy systems", " Piecewise linear transformation"], "paper_abstract": "In the last few years, several papers have exploited multi-objective evolutionary algorithms (MOEAs) to generate Mamdani fuzzy rule-based systems (MFRBSs) with different trade-offs between interpretability and accuracy. In this framework, a common approach is to distinguish between interpretability of the rule base (RB), also known as complexity, and interpretability of fuzzy partitions, also known as integrity of the database (DB). Typically, complexity has been used as one of the objectives of the MOEAs, while partition integrity has been ensured by enforcing constraints on the membership function (MF) parameters. In this paper, we propose to adopt partition integrity as an objective of the evolutionary process. To this aim, we first discuss how partition integrity can be measured by using a purposely defined index based on the similarity between the partitions learned during the evolutionary process and the initial interpretable partitions defined by an expert. Then, we introduce a three-objective evolutionary algorithm which generates a set of MFRBSs with different trade-offs between complexity, accuracy and partition integrity by concurrently learning the RB and the MF parameters of the linguistic variables. Accuracy is assessed in terms of mean squared error between the actual and the predicted values, complexity is calculated as the total number of conditions in the antecedents of the rules and integrity is measured by using the purposely defined index. The proposed approach has been experimented on six real-world regression problems. The results have been compared with those obtained by applying the same MOEA, but with only accuracy and complexity as objectives, both to learn only RBs, and to concurrently learn RBs and MF parameters, with and without constraints on the parameter tuning. We show that our approach achieves the best trade-offs between interpretability and accuracy. Finally, we compare our approach with a similar MOEA recently proposed in the literature.", "paper_title": "Learning knowledge bases of multi-objective evolutionary fuzzy systems by simultaneously optimizing accuracy, complexity and partition integrity", "paper_id": "WOS:000297128000004"}