{"auto_keywords": [{"score": 0.043722123083785994, "phrase": "clinical_texts"}, {"score": 0.008741116202103646, "phrase": "ml-based_techniques"}, {"score": 0.00481495049065317, "phrase": "electronic_medical_records"}, {"score": 0.004716113134313215, "phrase": "natural-language-processing_techniques"}, {"score": 0.004603352344461032, "phrase": "medical_concepts"}, {"score": 0.004571630734130793, "phrase": "clinical_text"}, {"score": 0.004295752645085445, "phrase": "medical_problem"}, {"score": 0.0033951334049808733, "phrase": "large_set"}, {"score": 0.0033023994098455457, "phrase": "external_resources"}, {"score": 0.003124437382827821, "phrase": "optimal_results"}, {"score": 0.0030285690317007805, "phrase": "feature-selection_techniques"}, {"score": 0.002956037056206635, "phrase": "manual_experimentation"}, {"score": 0.002701474449898187, "phrase": "medical_concept_extraction"}, {"score": 0.0026828233195176155, "phrase": "assertion_classification"}, {"score": 0.0025914765323897604, "phrase": "new_data_sets"}, {"score": 0.0025735828740162223, "phrase": "new_medical_informatics_tasks"}, {"score": 0.002503232182798796, "phrase": "optimal_features"}, {"score": 0.002451730979693715, "phrase": "promising_feature-selection_techniques"}, {"score": 0.0023764543399388658, "phrase": "current_state"}, {"score": 0.0021943920257952174, "phrase": "novel_feature-selection_methods"}], "paper_keywords": [""], "paper_abstract": "Objective This paper describes natural-language-processing techniques for two tasks: identification of medical concepts in clinical text, and classification of assertions, which indicate the existence, absence, or uncertainty of a medical problem. Because so many resources are available for processing clinical texts, there is interest in developing a framework in which features derived from these resources can be optimally selected for the two tasks of interest. Materials and methods The authors used two machine-learning (ML) classifiers: support vector machines (SVMs) and conditional random fields (CRFs). Because SVMs and CRFs can operate on a large set of features extracted from both clinical texts and external resources, the authors address the following research question: Which features need to be selected for obtaining optimal results? To this end, the authors devise feature-selection techniques which greatly reduce the amount of manual experimentation and improve performance. Results The authors evaluated their approaches on the 2010 i2b2/VA challenge data. Concept extraction achieves 79.59 micro F-measure. Assertion classification achieves 93.94 micro F-measure. Discussion Approaching medical concept extraction and assertion classification through ML-based techniques has the advantage of easily adapting to new data sets and new medical informatics tasks. However, ML-based techniques perform best when optimal features are selected. By devising promising feature-selection techniques, the authors obtain results that outperform the current state of the art. Conclusion This paper presents two ML-based approaches for processing language in the clinical texts evaluated in the 2010 i2b2/VA challenge. By using novel feature-selection methods, the techniques presented in this paper are unique among the i2b2 participants.", "paper_title": "A flexible framework for deriving assertions from electronic medical records", "paper_id": "WOS:000294572000007"}