{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "self-consolidating_concrete"}, {"score": 0.043716255883393715, "phrase": "cement-based_materials"}, {"score": 0.004715536784432697, "phrase": "artificial_intelligence-based_computational_techniques"}, {"score": 0.004676345706416371, "phrase": "adaptive_neuro-fuzzy_inference_systems"}, {"score": 0.004503959683578956, "phrase": "complex_systems"}, {"score": 0.004466519142879166, "phrase": "known_input-output_data_sets"}, {"score": 0.004007083686875716, "phrase": "different_forms"}, {"score": 0.0038112201846057445, "phrase": "well-known_complexity"}, {"score": 0.003685972800046028, "phrase": "current_work"}, {"score": 0.003609789241414946, "phrase": "anfis"}, {"score": 0.003505749731180509, "phrase": "wide_range"}, {"score": 0.003418958653159371, "phrase": "mixture_designs"}, {"score": 0.0030797912111959137, "phrase": "sustained_flexural_loading"}, {"score": 0.0029169007179202164, "phrase": "elastic_dynamic_modulus"}, {"score": 0.0028091907694771613, "phrase": "tested_scc_specimens"}, {"score": 0.002594652434287807, "phrase": "environmental_conditions"}, {"score": 0.002509284173541882, "phrase": "relative_humidity"}, {"score": 0.002376495929405298, "phrase": "anfis_and_fuzzy_inference_systems"}, {"score": 0.0022601535748259785, "phrase": "sensitivity_analyses"}, {"score": 0.002149494537191303, "phrase": "good_agreement"}, {"score": 0.0021315842986705485, "phrase": "actual_experimental_results"}], "paper_keywords": ["Neuro-fuzzy systems", " self-consolidating concrete", " sulfate attack", " environmental conditions", " flexural loading"], "paper_abstract": "Among artificial intelligence-based computational techniques, adaptive neuro-fuzzy inference systems (ANFIS) are particularly suitable for modelling complex systems with known input-output data sets. Such systems can be efficient in modelling non-linear, complex and ambiguous behaviour of cement-based materials undergoing single, dual or multiple damage factors of different forms (chemical, physical and structural). Due to the well-known complexity of sulfate attack on cement-based materials, the current work investigates the use of ANFIS to model the behaviour of a wide range of self-consolidating concrete (SCC) mixture designs under various high-concentration sodium sulfate exposure regimes including full immersion, wetting-drying, partial immersion, freezing-thawing, and cyclic cold-hot conditions with or without sustained flexural loading. Three ANFIS models have been developed to predict the expansion, reduction in elastic dynamic modulus, and starting time of failure of the tested SCC specimens under the various high-concentration sodium sulfate exposure regimes. A fuzzy inference system was also developed to predict the level of aggression of environmental conditions associated with very severe sodium sulfate attack based on temperature, relative humidity and degree of wetting-drying. The results show that predictions of the ANFIS and fuzzy inference systems were rational and accurate, with errors not exceeding 5%. Sensitivity analyses showed that the trends of results given by the models had good agreement with actual experimental results and with thermal, mineralogical and micro-analytical studies.", "paper_title": "Neuro-fuzzy based prediction of the durability of self-consolidating concrete to various sodium sulfate exposure regimes", "paper_id": "WOS:000261488400005"}