{"auto_keywords": [{"score": 0.04279913252338238, "phrase": "ephemeral_secret_keys"}, {"score": 0.00481495049065317, "phrase": "gdh_assumption"}, {"score": 0.004690305164360866, "phrase": "existing_identity-based_authenticated_key_agreement"}, {"score": 0.003852371777780562, "phrase": "session_secret_key"}, {"score": 0.0031636612155559267, "phrase": "pairing-free_id-aka_protocol"}, {"score": 0.002943147037670826, "phrase": "full_proof"}, {"score": 0.0028480459059007468, "phrase": "extended_canetti-krawczyk_model"}, {"score": 0.0025137856138000036, "phrase": "master_key"}, {"score": 0.002480961181275199, "phrase": "security_and_key_compromise_impersonation_resistance"}, {"score": 0.0024007585788965655, "phrase": "existing_id-aka_protocols"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["pairings", " eCK model", " leakage of ephemeral secret keys", " identity-based authenticated key agreement"], "paper_abstract": "Among the existing identity-based authenticated key agreement (ID-AKA) protocols, there are only a few of them that can resist to leakage of ephemeral secret keys, which is about the protection of the session secret key after the ephemeral secret keys of users are compromised. However, all these ID-AKA protocols with leakage of ephemeral secret keys resistance require expensive bilinear pairing operations. In this paper, we present a pairing-free ID-AKA protocol with ephemeral secrets leakage resistance. We also provide a full proof of its security in the extended Canetti-Krawczyk model, which not only can capture resistance to leakage of ephemeral secret keys but also can capture other basic security properties such as master key forward security and key compromise impersonation resistance. Compared with the existing ID-AKA protocols, our scheme is a good trade-off between security and efficiency. Copyright (c) 2015 John Wiley & Sons, Ltd.", "paper_title": "A strongly secure identity-based authenticated key agreement protocol without pairings under the GDH assumption", "paper_id": "WOS:000363883200018"}