{"auto_keywords": [{"score": 0.045934685709724456, "phrase": "sensed_data"}, {"score": 0.028401593692493923, "phrase": "base_station"}, {"score": 0.00481495049065317, "phrase": "time-correlated_region_queries"}, {"score": 0.0045404698551856125, "phrase": "smart_things"}, {"score": 0.003738847528809348, "phrase": "target_sub-regions"}, {"score": 0.0034780071331554003, "phrase": "significant_difference"}, {"score": 0.0034467039994594065, "phrase": "proximate_sensing_time-slots"}, {"score": 0.0033242742850902295, "phrase": "energy_consumption"}, {"score": 0.0030644247579222333, "phrase": "grid_cells"}, {"score": 0.0029959082125682918, "phrase": "energy-efficiency_hierarchical_clustering_index_tree"}, {"score": 0.0028376361457661415, "phrase": "time-correlated_region_query_technique"}, {"score": 0.0027367816003722252, "phrase": "sensor_nodes"}, {"score": 0.00233594452829104, "phrase": "interested_sensors"}, {"score": 0.0022733662000757318, "phrase": "theoretical_analysis"}, {"score": 0.002252880693912436, "phrase": "experimental_results"}, {"score": 0.002162951519368368, "phrase": "traditional_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Internet of Things", " ECH-tree", " Time-correlated region queries", " Grid cell clustering"], "paper_abstract": "In the Internet of Things, smart things communicate with each other, and sensed data are aggregated and queried to satisfy certain requests of end-users. When a region of interest requires to be monitored continuously, the strategy that each query is to be executed independently through gathering sensed data of target sub-regions may not be energy efficient, since the values reported by sensors may have no significant difference in proximate sensing time-slots in some applications. To mitigate the energy consumption in this context, in this paper we firstly divide the region with sensor nodes evenly into grid cells, and propose an energy-efficiency hierarchical clustering index tree to organize these grid cells. Then, we develop a time-correlated region query technique for answering continuous queries. Generally, sensor nodes report their values to the base station at the beginning, and report their values only when these values are changed significantly with respect to those reported previously. Queries are answered through assembling the values of interested sensors saved in the base station. Theoretical analysis and experimental results show that our proposal is energy efficient compared with traditional techniques. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An energy efficient hierarchical clustering index tree for facilitating time-correlated region queries in the Internet of Things", "paper_id": "WOS:000334002900001"}