{"auto_keywords": [{"score": 0.03942454916662994, "phrase": "satem"}, {"score": 0.00481495049065317, "phrase": "trusted_ad_hoc_networks"}, {"score": 0.004731492618963217, "phrase": "fair_and_secure_communication"}, {"score": 0.004690305164360866, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004392565073466714, "phrase": "proper_communication_policies"}, {"score": 0.004024651422626329, "phrase": "traditional_distributed_systems"}, {"score": 0.0033636292024305406, "phrase": "associated_policy"}, {"score": 0.003247868216333148, "phrase": "different_nodes"}, {"score": 0.0030017207229983385, "phrase": "underlying_protocols"}, {"score": 0.002835599469639296, "phrase": "trusted_application-centric_networks"}, {"score": 0.0026436755508085223, "phrase": "required_set"}, {"score": 0.0021896891011033105, "phrase": "security_analysis"}, {"score": 0.002123531043641047, "phrase": "performance_evaluation"}], "paper_keywords": ["Trusted computing", " ad hoc networks", " mobile computing"], "paper_abstract": "To ensure fair and secure communication in Mobile Ad hoc Networks (MANETs), the applications running in these networks must be regulated by proper communication policies. However, enforcing policies in MANETs is challenging because they lack the infrastructure and trusted entities encountered in traditional distributed systems. This paper presents the design and implementation of a policy enforcing mechanism based on Satem, a kernel-level trusted execution monitor built on top of the Trusted Platform Module. Under this mechanism, each application or protocol has an associated policy. Two instances of an application running on different nodes may engage in communication only if these nodes enforce the same set of policies for both the application and the underlying protocols used by the application. In this way, nodes can form trusted application-centric networks. Before allowing a node to join such a network, Satem verifies its trustworthiness of enforcing the required set of policies. Furthermore, Satem protects the policies and the software enforcing these policies from being tampered with. If any of them is compromised, Satem disconnects the node from the network. We demonstrate the correctness of our solution through security analysis, and its low overhead through performance evaluation of two MANET applications.", "paper_title": "A Policy Enforcing Mechanism for Trusted Ad Hoc Networks", "paper_id": "WOS:000288453700001"}