{"auto_keywords": [{"score": 0.042948433778622036, "phrase": "personal_space"}, {"score": 0.007740489563401459, "phrase": "collaborative_virtual_environments"}, {"score": 0.005655444839051507, "phrase": "avatar_gender"}, {"score": 0.005517788674513181, "phrase": "observational_study"}, {"score": 0.0043119436480557, "phrase": "physical_world"}, {"score": 0.003832423454781517, "phrase": "empirical_investigations"}, {"score": 0.0037621210719690594, "phrase": "non_immersive_virtual_environment"}, {"score": 0.003244050414264445, "phrase": "experimental_results"}, {"score": 0.0028848643090508205, "phrase": "high_personal_space_invasion_anxiety"}, {"score": 0.002728847267539957, "phrase": "personal_space_invasion"}, {"score": 0.0023527296826339225, "phrase": "similar_way"}, {"score": 0.0021049977753042253, "phrase": "improved_understanding"}], "paper_keywords": ["Collaborative virtual environment", " Anxiety", " Personal space"], "paper_abstract": "As humans start to spend more time in collaborative virtual environments (CVEs) it becomes important to study their interactions in such environments. One aspect of such interactions is personal space. To begin to address this, we have conducted empirical investigations in a non immersive virtual environment: an experiment to investigate the influence on personal space of avatar gender, and an observational study to further explore the existence of personal space. Experimental results give some evidence to suggest that avatar gender has an influence on personal space although the participants did not register high personal space invasion anxiety, contrary to what one might expect from personal space invasion in the physical world. The observational study suggests that personal space does exist in CVEs, as the users tend to maintain, in a similar way to the physical world, a distance when they are interacting with each other. Our studies provide an improved understanding of personal space in CVEs and the results can be used to further enhance the usability of these environments.", "paper_title": "Human interactions and personal space in collaborative virtual environments", "paper_id": "WOS:000296279800002"}