{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_competences"}, {"score": 0.04785173377652109, "phrase": "infolitrans_test"}, {"score": 0.04024583202473007, "phrase": "information_competence"}, {"score": 0.004638195656547484, "phrase": "spanish_universities"}, {"score": 0.004333208536635007, "phrase": "information_literacy_instruction"}, {"score": 0.004274650638302117, "phrase": "user_community"}, {"score": 0.004007083686875716, "phrase": "project_infolitrans"}, {"score": 0.003926105480202798, "phrase": "overall_framework"}, {"score": 0.0036928221419965253, "phrase": "information_treatment"}, {"score": 0.0033231308748636885, "phrase": "spain"}, {"score": 0.003104201872147936, "phrase": "statistical_descriptive_analysis"}, {"score": 0.0030414140732789186, "phrase": "learning_level"}, {"score": 0.003010496595090984, "phrase": "competence_area"}, {"score": 0.0029798924689472014, "phrase": "overall_levels"}, {"score": 0.0029596622424171264, "phrase": "information_management"}, {"score": 0.0027366287564324966, "phrase": "translation_tasks"}, {"score": 0.002690406375639144, "phrase": "profitable_synergy"}, {"score": 0.0026721361773711315, "phrase": "translators'_core_competences"}, {"score": 0.0025046245057922557, "phrase": "available_technology"}, {"score": 0.00226892463779702, "phrase": "translators'_instruction"}, {"score": 0.0022535101994966907, "phrase": "information_literacy"}, {"score": 0.0021049977753042253, "phrase": "learning_community"}], "paper_keywords": ["Information literacy", " SWOT Analysis", " Information research", " Information skills", " Translation and interpreting"], "paper_abstract": "Purpose The purpose of this paper is to report the findings of a study about Information Literacy instruction addressed to the user community of translators and interpreters through the application of InfoLiTrans Test. This test is one of the outcomes of project InfoLiTrans, aimed at applying an overall framework for assessing the acquisition of the information competence in four big macro areas: information search, assessment of information, information treatment, and communication and dissemination of information. Design/methodology/approach The test was used to analyse, explore, and improve the information competence of Translation and Interpreting trainees from 17 universities in Spain. Data were processed and analysed after collecting responses at two levels of difficulty: basic and advanced. A statistical descriptive analysis was performed to diagnose the learning level of each competence area. Findings Overall levels of information management were found to be excellent, particularly in relation to disseminating and communicating information, and to assessing the information required for translation tasks. Such results show a profitable synergy between translators' core competences and their information competences. However, skills required to search for information and to make use of it with available technology could be improved, providing room for further training. Originality/value Considering the diagnosis of information competences put forward by the research, this paper provides guidelines for further improvement of translators' instruction on information literacy, thus, encouraging the design of models, methods and tools that could be more effective for this learning community.", "paper_title": "Assessing information competences of translation and interpreting trainees A study of proficiency at Spanish universities using the InfoliTrans Test", "paper_id": "WOS:000334967100005"}