{"auto_keywords": [{"score": 0.04172164658250479, "phrase": "click_data"}, {"score": 0.015065040106516575, "phrase": "search_engine"}, {"score": 0.013217652505444792, "phrase": "search_session"}, {"score": 0.008713768692145006, "phrase": "implicit_relevance_feedback"}, {"score": 0.008146470555150389, "phrase": "search_results"}, {"score": 0.006820504513705826, "phrase": "relevance_feedback"}, {"score": 0.004785466029391189, "phrase": "web_search"}, {"score": 0.004756161254039343, "phrase": "search_sessions"}, {"score": 0.004219121035447185, "phrase": "previously_viewed_pages"}, {"score": 0.0038950888505884687, "phrase": "relevance_feedback_information"}, {"score": 0.0036854004736318197, "phrase": "search_results_quality"}, {"score": 0.0031698463667614004, "phrase": "search_results_page"}, {"score": 0.003083286468174091, "phrase": "search_results_page-"}, {"score": 0.0029442253041602044, "phrase": "even_more_reliable_relevance_feedback"}, {"score": 0.0024934179092125277, "phrase": "empirical_data"}, {"score": 0.0024704972295365164, "phrase": "live_website"}, {"score": 0.002455333662233046, "phrase": "manual_assessment"}, {"score": 0.0022525395705281083, "phrase": "feedback_data"}, {"score": 0.00217082725339744, "phrase": "strictly_relevant_documents"}, {"score": 0.0021049977753042253, "phrase": "last_visited_documents"}], "paper_keywords": ["click data", " implicit feedback", " explicit feedback", " search engines", " information retrieval", " collaborative filtering", " SERF"], "paper_abstract": "Search sessions consist of a person presenting a query to a search engine, followed by that person examining the search results, selecting some of those search results for further review, possibly following some series of hyperfinks, and perhaps backtracking to previously viewed pages in the session. The series of pages selected for viewing in a search session, sometimes called the click data, is intuitively a source of relevance feedback information to the search engine. We are interested in how that relevance feedback can be used to improve the search results quality for all users, not just the current user. For example, the search engine Could learn which documents are frequently visited when certain search queries are given. In this article, we address three issues related to using click data as implicit relevance feedback: (1) How click data beyond the search results page might be more reliable than just the clicks from the search results page-, (2) Whether we can further subselect from this click data to get even more reliable relevance feedback; and (3) How the reliability of click data for relevance feedback changes when the goal becomes finding one document for the user that completely meets their information needs (if possible). We refer to these documents as the ones that are strictly relevant to the query. Our conclusions are based on empirical data from a live website with manual assessment of relevance. We found that considering all of the click data in a search session as relevance feedback has the potential to increase both precision and recall of the feedback data. We further found that, when the goal is identifying strictly relevant documents, that it could be useful to focus on last visited documents rather than all documents visited in a search session. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Click data as implicit relevance feedback in web search", "paper_id": "WOS:000244618900016"}