{"auto_keywords": [{"score": 0.04208347954551837, "phrase": "valuation_functions"}, {"score": 0.00481495049065317, "phrase": "simple_preferences"}, {"score": 0.00456159659731398, "phrase": "abstract_negotiation_framework"}, {"score": 0.004422827355213055, "phrase": "indivisible_resources"}, {"score": 0.003702702337768558, "phrase": "optimal_allocation"}, {"score": 0.0034806529881619454, "phrase": "monetary_side_payments"}, {"score": 0.0034538466642399976, "phrase": "self-interested_but_myopic_agents"}, {"score": 0.0033877275374263314, "phrase": "modular_valuation_functions"}, {"score": 0.0032216622984027558, "phrase": "sufficient_condition"}, {"score": 0.0030401074516310184, "phrase": "necessary_condition"}, {"score": 0.00292477450010107, "phrase": "individual_valuation_functions"}, {"score": 0.002792119634261638, "phrase": "evaluating_conditions"}, {"score": 0.002728059572916527, "phrase": "whole_profile"}, {"score": 0.002410363090950055, "phrase": "modular_functions"}, {"score": 0.0023368833197343953, "phrase": "strictly_larger_class"}, {"score": 0.0022744242010653997, "phrase": "optimal_outcome"}, {"score": 0.0021628142746829187, "phrase": "similar_results"}, {"score": 0.0021049977753042253, "phrase": "side_payments"}], "paper_keywords": ["Multiagent resource allocation", " Negotiation"], "paper_abstract": "We investigate the properties of an abstract negotiation framework where agents autonomously negotiate over allocations of indivisible resources. In this framework, reaching an allocation that is optimal may require very complex multilateral deals. Therefore, we are interested in identifying classes of valuation functions such that any negotiation conducted by means of deals involving only a single resource at a time is bound to converge to an optimal allocation whenever all agents model their preferences using these functions. In the case of negotiation with monetary side payments amongst self-interested but myopic agents, the class of modular valuation functions turns out to be such a class. That is, modularity is a sufficient condition for convergence in this framework. We also show that modularity is not a necessary condition. Indeed, there can be no condition on individual valuation functions that would be both necessary and sufficient in this sense. Evaluating conditions formulated with respect to the whole profile of valuation functions used by the agents in the system would be possible in theory, but turns out to be computationally intractable in practice. Our main result shows that the class of modular functions is maximal in the sense that no strictly larger class of valuation functions would still guarantee an optimal outcome of negotiation, even when we permit more general bilateral deals. We also establish similar results in the context of negotiation without side payments.", "paper_title": "Simple negotiation schemes for agents with simple preferences: sufficiency, necessity and maximality", "paper_id": "WOS:000273978500005"}