{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_libraries"}, {"score": 0.025489783246816215, "phrase": "public_access"}, {"score": 0.007197429628484883, "phrase": "public-access_internet"}, {"score": 0.004870698462085696, "phrase": "pat"}, {"score": 0.004539005582217309, "phrase": "early_adopters"}, {"score": 0.00447251540886613, "phrase": "internet-based_technologies"}, {"score": 0.0036914757355166966, "phrase": "world_wide_web"}, {"score": 0.003091767402370757, "phrase": "existing_service"}, {"score": 0.0029796206196589115, "phrase": "substantial_consideration"}, {"score": 0.002726740692380339, "phrase": "public-access_technology"}, {"score": 0.0021522261505574035, "phrase": "pat_provision_resources"}], "paper_keywords": [""], "paper_abstract": "Public libraries were early adopters of Internet-based technologies and have provided public access to the Internet and computers since the early 1990s. The landscape of public-access Internet and computing was substantially different in the 1990s as the World Wide Web was only in its initial development. At that time, public libraries essentially experimented with public-access Internet and computer services, largely absorbing this service into existing service and resource provision without substantial consideration of the management, facilities, staffing, and other implications of public-access technology (PAT) services and resources. This article explores the implications for public libraries of the provision of PAT and seeks to look further to review issues and practices associated with PAT provision resources. While much research focuses on the amount of public access that public libraries provide, little offers a view of the effect of public access on libraries. This article provides insights into some of the costs, issues, and challenges associated with public access and concludes with recommendations that require continued exploration.", "paper_title": "Public Access Technologies in Public Libraries: Effects and Implications", "paper_id": "WOS:000266804700005"}