{"auto_keywords": [{"score": 0.04504910461181417, "phrase": "strategic_fit"}, {"score": 0.01395423808579395, "phrase": "firm's_information_systems"}, {"score": 0.00481495049065317, "phrase": "multilevel_model"}, {"score": 0.0045411156682300695, "phrase": "highly_dynamic_marketplace"}, {"score": 0.004395742407834023, "phrase": "information_systems"}, {"score": 0.004353040792349733, "phrase": "dominant_literature"}, {"score": 0.004213662826578328, "phrase": "high-level_measures"}, {"score": 0.003986844722309844, "phrase": "business_performance"}, {"score": 0.0038216374069880038, "phrase": "specific_areas"}, {"score": 0.0037599278182081056, "phrase": "firm's_competitive_strategies"}, {"score": 0.0032053233533168362, "phrase": "current_level"}, {"score": 0.0031228618763672173, "phrase": "capabilities_instrument"}, {"score": 0.003082427650896418, "phrase": "ideal_level"}, {"score": 0.0029836109362668586, "phrase": "conant_et_al"}, {"score": 0.0028973794653974327, "phrase": "strategic_archetype"}, {"score": 0.0027323009127771525, "phrase": "multiple_case_study_analysis"}, {"score": 0.0026969099161088398, "phrase": "fine-grained_assessment"}, {"score": 0.0025515282069418286, "phrase": "strategic_fit_measurement_outputs"}, {"score": 0.0024858445890050614, "phrase": "iterative_design_science_research_approach"}, {"score": 0.0024061070225431525, "phrase": "prototype_artifacts"}, {"score": 0.002351813899450668, "phrase": "field-tested_and_theoretically_grounded_measurement_models"}, {"score": 0.0022615684627308283, "phrase": "practical_utility"}, {"score": 0.0021049977753042253, "phrase": "research_findings"}], "paper_keywords": ["Strategic alignment", " information systems capabilities", " configurational theory", " strategic archetypes", " design science", " research methods"], "paper_abstract": "To compete in a highly dynamic marketplace, firms must frequently adapt and align their competitive strategies and information systems. The dominant literature on the strategic fit of a firm's information systems focuses primarily on high-level measures of the strategic fit of a firm's overall IS portfolio and the impact of fit on business performance. This paper addresses the need for a more fine-grained approach for assessing the specific areas of misfit between a firm's competitive strategies and IS capabilities. We describe the design and evaluation of a multilevel strategic fit (MSF) measurement model that enables researchers and practitioners to measure the strategic fit of a firm's information systems at both an overall and a detailed level. The steps in the model include identifying the relevant IS capabilities according to the type of system; measuring the current level of support for each capability using a capabilities instrument; identifying the ideal level of support for each capability using an adaptation of Conant et al.'s (1990) instrument to assess strategic archetype; and comparing the ideal and realized level of support for each capability. Evidence from a multiple case study analysis indicates that the fine-grained assessment of strategic fit can strengthen the validity, utility, and ease of corroboration of the strategic fit measurement outputs. The paper also demonstrates how an iterative design science research approach, with its emphasis on evaluating the utility of prototype artifacts, is well suited to developing field-tested and theoretically grounded measurement models and instruments that are accessible to practitioners. This focus on practical utility in turn provides researchers with results that can be more readily corroborated, thus improving the quality and usefulness of the research findings.", "paper_title": "A MULTILEVEL MODEL FOR MEASURING FIT BETWEEN A FIRM'S COMPETITIVE STRATEGIES AND INFORMATION SYSTEMS CAPABILITIES", "paper_id": "WOS:000297236000006"}