{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "logically_constrained_issues"}, {"score": 0.0348500503107606, "phrase": "logical_constraints"}, {"score": 0.029073737945136693, "phrase": "original_degrees"}, {"score": 0.004756805752518494, "phrase": "general_method"}, {"score": 0.004549524321051407, "phrase": "consistent_decisions"}, {"score": 0.004333642054036135, "phrase": "belief_revision"}, {"score": 0.0038375280115736958, "phrase": "original_ones"}, {"score": 0.003171615440419782, "phrase": "revised_degree"}, {"score": 0.002796782643988021, "phrase": "majority_criterion"}, {"score": 0.0026638482306228575, "phrase": "consistent_result"}, {"score": 0.0024963543716522087, "phrase": "particular_issue"}, {"score": 0.0022371907579775796, "phrase": "well_established_or_increasingly_accepted_methods"}, {"score": 0.0021922308351126746, "phrase": "single-link_method"}, {"score": 0.0021049977753042253, "phrase": "preferential_voting"}], "paper_keywords": ["Constrained judgment aggregation", " Degrees of belief", " Belief revision", " Plausible reasoning", " Artificial intelligence", " Decision theory", " Doctrinal paradox", " Cluster analysis", " Preferential voting", " Conjunctive normal forms"], "paper_abstract": "A general method is given for revising degrees of belief and arriving at consistent decisions about a system of logically constrained issues. In contrast to other works about belief revision, here the constraints are assumed to be fixed. The method has two variants, dual of each other, whose revised degrees of belief are respectively above and below the original ones. The upper [resp. lower] revised degrees of belief are uniquely characterized as the lowest [resp. greatest] ones that are invariant by a certain max-min [resp. min-max] operation determined by the logical constraints. In both variants, making balance between the revised degree of belief of a proposition and that of its negation leads to decisions that are ensured to be consistent with the logical constraints. These decisions are ensured to agree with the majority criterion as applied to the original degrees of belief whenever this gives a consistent result. They are also ensured to satisfy a property of respect for unanimity about any particular issue, as well as a property of monotonicity with respect to the original degrees of belief. The application of the method to certain special domains comes down to well established or increasingly accepted methods, such as the single-link method of cluster analysis and the method of paths in preferential voting.", "paper_title": "A general method for deciding about logically constrained issues", "paper_id": "WOS:000303801500002"}