{"auto_keywords": [{"score": 0.02322730111336097, "phrase": "nested_logit_model"}, {"score": 0.008535605539111323, "phrase": "offered_products"}, {"score": 0.0070798407443483, "phrase": "expected_revenue"}, {"score": 0.00624915507759327, "phrase": "optimal_expected_revenue"}, {"score": 0.005897136691392994, "phrase": "linear_program"}, {"score": 0.004772137871562584, "phrase": "price_bounds"}, {"score": 0.004625255533545965, "phrase": "pricing_problem"}, {"score": 0.004482873744893272, "phrase": "first_variant"}, {"score": 0.004009074013302036, "phrase": "second_variant"}, {"score": 0.003107117564014497, "phrase": "approximation_methods"}, {"score": 0.0024075916292945715, "phrase": "upper_bound"}, {"score": 0.002291905937251069, "phrase": "expected_revenues"}, {"score": 0.0022013916728990564, "phrase": "upper_bounds"}, {"score": 0.0021720199689914464, "phrase": "optimal_expected_revenues"}, {"score": 0.0021049977753042253, "phrase": "high-quality_solutions"}], "paper_keywords": ["nested logit", " choice modeling", " pricing", " revenue management"], "paper_abstract": "We consider two variants of a pricing problem under the nested logit model. In the first variant, the set of products offered to customers is fixed, and we want to determine the prices of the products. In the second variant, we jointly determine the set of offered products and their corresponding prices. In both variants, the price of each product has to be chosen within given upper and lower bounds specific to the product, each customer chooses among the offered products according to the nested logit model, and the objective is to maximize the expected revenue from each customer. We give approximation methods for both variants. For any rho > 0, our approximation methods obtain a solution with an expected revenue deviating from the optimal expected revenue by no more than a factor of 1 + rho. To obtain such a solution, our approximation methods solve a linear program whose size grows at rate 1/rho. In addition to our approximation methods, we develop a linear program that we can use to obtain an upper bound on the optimal expected revenue. In our computational experiments, we compare the expected revenues from the solutions obtained by our approximation methods with the upper bounds on the optimal expected revenues and show that we can obtain high-quality solutions quite fast.", "paper_title": "Approximation Methods for Pricing Problems Under the Nested Logit Model with Price Bounds", "paper_id": "WOS:000355224700010"}