{"auto_keywords": [{"score": 0.04635531096465831, "phrase": "gsm_protocols"}, {"score": 0.03394009994668227, "phrase": "weak_cipher"}, {"score": 0.00481495049065317, "phrase": "instant_ciphertext-only_cryptanalysis"}, {"score": 0.004312622975366676, "phrase": "gsm_networks"}, {"score": 0.004265354774450696, "phrase": "\"unbreakable\"_ciphers"}, {"score": 0.004172360444377281, "phrase": "ciphertext-only_attack"}, {"score": 0.004051501401100304, "phrase": "encrypted_off-the-air_cellular_conversation"}, {"score": 0.0039053194919285725, "phrase": "personal_computer"}, {"score": 0.003249574947858394, "phrase": "mobile_phone"}, {"score": 0.002975024676463106, "phrase": "cellular_phone"}, {"score": 0.0027437235598539904, "phrase": "previous_attacks"}, {"score": 0.002693708217226793, "phrase": "unrealistic_information"}, {"score": 0.0026641365405034355, "phrase": "long_known-plaintext_periods"}, {"score": 0.0023768935613578007, "phrase": "reception_errors"}, {"score": 0.002191993482098238, "phrase": "later_time"}, {"score": 0.002136226584784576, "phrase": "call_hijacking"}, {"score": 0.0021049977753042253, "phrase": "data_messages"}], "paper_keywords": ["GSM", " cellular", " ciphertext-only", " cryptanalysis", " GPRS", " SMS", " SIM"], "paper_abstract": "In this paper we present a very practical ciphertext-only cryptanalysis of GSM (Global System for Mobile communications) encrypted communication, and various active attacks on the GSM protocols. These attacks can even break into GSM networks that use \"unbreakable\" ciphers. We first describe a ciphertext-only attack on A5/2 that requires a few dozen milliseconds of encrypted off-the-air cellular conversation and finds the correct key in less than a second on a personal computer. We extend this attack to a (more complex) ciphertext-only attack on A5/1. We then describe new (active) attacks on the protocols of networks that use A5/1, A5/3, or even GPRS (General Packet Radio Service). These attacks exploit flaws in the GSM protocols, and they work whenever the mobile phone supports a weak cipher such as A5/2. We emphasize that these attacks are on the protocols, and are thus applicable whenever the cellular phone supports a weak cipher, for example, they are also applicable for attacking A5/3 networks using the cryptanalysis of A5/1. Unlike previous attacks on GSM that require unrealistic information, like long known-plaintext periods, our attacks are very practical and do not require any knowledge of the content of the conversation. Furthermore, we describe how to fortify the attacks to withstand reception errors. As a result, our attacks allow attackers to tap conversations and decrypt them either in real-time, or at any later time. We present several attack scenarios such as call hijacking, altering of data messages and call theft.", "paper_title": "Instant ciphertext-only cryptanalysis of GSM encrypted communication", "paper_id": "WOS:000254259600003"}