{"auto_keywords": [{"score": 0.040108824253493075, "phrase": "secret_reconstruction_phase"}, {"score": 0.03067008294770572, "phrase": "dishonest_shareholder"}, {"score": 0.004815069911537196, "phrase": "fair"}, {"score": 0.004677737612789436, "phrase": "shamir"}, {"score": 0.004236074477264561, "phrase": "n_shareholders"}, {"score": 0.0038518661517315533, "phrase": "secret_s."}, {"score": 0.003726533059542558, "phrase": "threshold_secret_sharing"}, {"score": 0.003560807940070886, "phrase": "harn"}, {"score": 0.003502382624110703, "phrase": "shamir's_secret_reconstruction_phase"}, {"score": 0.0032510690712452147, "phrase": "harn's_paper"}, {"score": 0.0031845067058084583, "phrase": "reconstruction_scheme"}, {"score": 0.003005271873916767, "phrase": "shamir's_secret_reconstruction"}, {"score": 0.002778006389296707, "phrase": "fake_share"}, {"score": 0.002504880563070155, "phrase": "secret_reconstruction_scheme"}, {"score": 0.0022122603123901114, "phrase": "interactive_dealer"}, {"score": 0.002184943946549964, "phrase": "cryptographic_primitives"}, {"score": 0.0021049977753042253, "phrase": "honest_shareholders"}], "paper_keywords": ["Secret sharing", " Rational secret sharing", " Lagrange component", " Secret reconstruction", " Fair secret reconstruction", " Asynchronous network"], "paper_abstract": "In Shamir's (t, n) threshold secret sharing scheme, one secret s is divided into n shares by a dealer and all shares are shared among n shareholders, such that knowing t or more than t shares can reconstruct this secret; but knowing fewer than t shares cannot reveal any information about the secret s. The secret reconstruction phase in Shamir's (t, n) threshold secret sharing is very simple and unconditionally secure. In 2014, Harn has shown that Shamir's secret reconstruction phase cannot prevent an outside attacker from knowing the secret if more than t participants work together in the secret reconstruction phase. Harn's paper also has proposed a reconstruction scheme which can prevent the outside adversary from knowing the secret. However, in Shamir's secret reconstruction, when shares are released asynchronously, a dishonest shareholder (an inside adversary) can always release a fake share last so the dishonest shareholder can exclusively retrieve the secret; but other honest shareholders retrieve a fake secret. In this paper, we design a secret reconstruction scheme against both inside and outside adversaries. This scheme can also be called an asynchronously rational secret sharing scheme. Unlike other rational secret sharing schemes, our scheme does not need any interactive dealer, complicate cryptographic primitives, or any assumption on the number of honest shareholders. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Fair secret reconstruction in (t, n) secret sharing", "paper_id": "WOS:000362220700001"}