{"auto_keywords": [{"score": 0.04845849110410781, "phrase": "feature_selection"}, {"score": 0.00481495049065317, "phrase": "functional_networks"}, {"score": 0.004760017604908536, "phrase": "sensitivity_analysis"}, {"score": 0.0047057084749407485, "phrase": "wrapper_method"}, {"score": 0.0044688500725247726, "phrase": "new_wrapper_method"}, {"score": 0.003916098498242888, "phrase": "induction_algorithm"}, {"score": 0.0037834649508375544, "phrase": "backward_non-sequential_strategy"}, {"score": 0.0033922781038328844, "phrase": "computational_time"}, {"score": 0.0032398798149196432, "phrase": "\"multivariate\"_relations"}, {"score": 0.0031481164109237636, "phrase": "important_characteristic"}, {"score": 0.0022296340517805125, "phrase": "proposed_method"}, {"score": 0.0022041312401435346, "phrase": "better_performance_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feature selection", " Wrapper methods", " Machine learning", " Neural networks"], "paper_abstract": "In this paper, a new wrapper method for feature selection, namely IAFN-FS (Incremental ANalysis Of VAriance and Functional Networks for Feature Selection) is presented. The method uses as induction algorithm the AFN (ANOVA and Functional Networks) learning method; follows a backward non-sequential strategy from the complete set of features (thus allowing to discard several variables in one step, and so reducing computational time); and is able to consider \"multivariate\" relations between features. An important characteristic of the method is that it permits the user the interpretation of the results obtained, because the relevance of each feature selected or rejected is given in terms of its variance. IAFN-FS is applied to several benchmark real-world classification data sets showing adequate performance results. Also, a comparison with the results obtained by other wrapper methods is carried out, showing that the proposed method obtains better performance results in average. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Combining functional networks and sensitivity analysis as wrapper method for feature selection", "paper_id": "WOS:000292169500101"}