{"auto_keywords": [{"score": 0.03771465750530587, "phrase": "stackelberg_game"}, {"score": 0.00481495049065317, "phrase": "common_value"}, {"score": 0.004690305164360866, "phrase": "game-theoretic_analysis"}, {"score": 0.004614038128321949, "phrase": "bidders'_private_values"}, {"score": 0.004553914287137776, "phrase": "uncertain_common_value"}, {"score": 0.003967835031625103, "phrase": "prior_work"}, {"score": 0.0038271712887391015, "phrase": "auctioneer's_option"}, {"score": 0.003777261911983744, "phrase": "external_information"}, {"score": 0.0031326477464204768, "phrase": "potentially_imperfect_information"}, {"score": 0.0031019373572233706, "phrase": "leader's_actions"}, {"score": 0.002982068153662372, "phrase": "strategies_results"}, {"score": 0.0029238768315330305, "phrase": "pure-strategy_perfect_bayesian_nash_equilibrium"}, {"score": 0.00268452026617243, "phrase": "information_cost"}, {"score": 0.002640781900605126, "phrase": "great_importance"}, {"score": 0.0025722741181993278, "phrase": "strategic_information-provider"}, {"score": 0.0024891269874339553, "phrase": "mixed-strategy_perfect_bayesian_nash_equilibrium"}, {"score": 0.0021610874773389096, "phrase": "bidders'_awareness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Single item auction", " Nash equilibrium", " Information disclosure", " Value of information"], "paper_abstract": "This paper introduces a game-theoretic analysis of auction settings where bidders' private values depend on an uncertain common value, and the auctioneer has the option to purchase information that can eliminate that uncertainty. Therefore the auctioneer needs to decide whether to purchase the information, and if so, whether to disclose it to the bidders. Unlike prior work, the model assumes that bidders are aware of the auctioneer's option to purchase the external information but are not necessarily aware of her decision. The modeling of the problem as a Stackelberg game, where the auctioneer is the leader, is complicated by the fact that in cases where the auctioneer decides not to disclose the information, the situation is actually modeled as a version of Stackelberg game where the follower has potentially imperfect information about the leader's actions. Our analysis of the individual expected-benefit-maximizing strategies results in the characterization of the pure-strategy perfect Bayesian Nash equilibrium and proof of its existence for any setting. In addition, we introduce an algorithm for extracting the equilibrium as a function of the information cost, which is of great importance when the information is provided by a strategic information-provider. The analysis is also extended to deal with mixed-strategy perfect Bayesian Nash equilibrium and with noisy information. Overall, the analysis enables the demonstration of various model characteristics, including many non-intuitive properties related to the benefits of competition, the benefits in having the option of the auctioneer to purchase such information and the benefits encapsulated in the bidders' awareness of such an option. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the choice of obtaining and disclosing the common value in auctions", "paper_id": "WOS:000341468000002"}