{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_aggression"}, {"score": 0.00819210341190915, "phrase": "virtual_worlds"}, {"score": 0.0050462014026409876, "phrase": "control_disorder"}, {"score": 0.0045726187330434025, "phrase": "user_aggression"}, {"score": 0.004481116624378756, "phrase": "real_world"}, {"score": 0.004342430078306461, "phrase": "aggressive_behaviour"}, {"score": 0.004277556198743679, "phrase": "positive_predictor"}, {"score": 0.003835972725191194, "phrase": "aggression_relaxation"}, {"score": 0.003531474887552889, "phrase": "previous_research"}, {"score": 0.0022749744354271816, "phrase": "negative_impact"}], "paper_keywords": ["behaviour intention", " self-efficacy", " virtual space", " virtual reality", " virtual community"], "paper_abstract": "Most studies on user aggression in virtual worlds have mainly focused on the causes of aggressive behaviour, but only a few have focused on the factors that relieve it. This study was conducted to determine the causes of aggression relaxation and aggravation in virtual worlds, using an approach that significantly differs from that used in previous research. We examined the mechanisms that affect aggravation and relaxation of virtual aggression, and suggested ways to resolve problems with aggression. A survey was conducted with 112 Second Life users to examine how commitment, belief, avatar attachment, desensitisation, and addiction were related to self-control and control disorder, and how the two latter factors affected virtual aggression. The survey also examined how virtual aggression influenced the intention for attacking behaviour in the real world. The results showed that (1) belief is a positive predictor of self-control, which has a negative impact on virtual aggression, (2) addiction is a positive predictor of control disorder, and (3) anger in virtual worlds is significantly connected to aggression in the real world.", "paper_title": "Mechanisms underlying aggravation and relaxation of virtual aggression: a Second Life survey study", "paper_id": "WOS:000323997000010"}