{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "knowledge_integration"}, {"score": 0.004568871736067739, "phrase": "general_framework"}, {"score": 0.004392565073466714, "phrase": "bibliometric_data"}, {"score": 0.002552628669352939, "phrase": "science_policy_issues"}, {"score": 0.0024218895273910943, "phrase": "research_networks"}, {"score": 0.0023694065215394593, "phrase": "main_contribution"}, {"score": 0.002208966376185464, "phrase": "existing_approach"}, {"score": 0.0021328586481696157, "phrase": "knowledge_diffusion"}], "paper_keywords": ["Knowledge integration", " Knowledge diffusion", " Interdisciplinarity", " Diversity", " Coherence", " Diversity management", " Knowledge management"], "paper_abstract": "Purpose - This paper aims to introduce a general framework for the analysis of knowledge integration and diffusion using bibliometric data. Design/methodology/approach - The authors propose that in order to characterise knowledge integration and diffusion of a given issue (the source, for example articles on a topic or by an organisation, etc.), one has to choose a set of elements from the source (the intermediary set, for example references, keywords, etc.). This set can then be classified into categories (cats), thus making it possible to investigate its diversity. The set can also be characterised according to the coherence of a network associated to it. Findings - This framework allows a methodology to be developed to assess knowledge integration and diffusion. Such methodologies can be useful for a number of science policy issues, including the assessment of interdisciplinarity in research and dynamics of research networks. Originality/value - The main contribution of this article is to provide a simple and easy to use generalisation of an existing approach to study interdisciplinarity, bringing knowledge integration and knowledge diffusion together in one framework.", "paper_title": "A framework for knowledge integration and diffusion", "paper_id": "WOS:000300207000003"}