{"auto_keywords": [{"score": 0.014365021645746424, "phrase": "probabilistic_information"}, {"score": 0.006570670791792796, "phrase": "possibilistic_information"}, {"score": 0.004771435352180973, "phrase": "conventional_wisdom"}, {"score": 0.004532141038197266, "phrase": "shannon's_information_theory"}, {"score": 0.004265871391568953, "phrase": "different_view"}, {"score": 0.0036553070575015344, "phrase": "probability_distribution"}, {"score": 0.003492897128445075, "phrase": "bimodal_restriction"}, {"score": 0.0034403745992576808, "phrase": "possibilistic_and_probabilistic_restrictions"}, {"score": 0.0033989238477802864, "phrase": "restriction-centered_approach"}, {"score": 0.0030199761431186434, "phrase": "bimodal_information"}, {"score": 0.0026427848602443293, "phrase": "widespread_unawareness"}, {"score": 0.0024423826953133844, "phrase": "important_empirical_observation"}, {"score": 0.0023983322584501332, "phrase": "natural_language"}, {"score": 0.0023694065215394593, "phrase": "predominantly_fuzzy_possibilistic_information"}, {"score": 0.0023550777055067096, "phrase": "fpi"}, {"score": 0.0023055907344584946, "phrase": "fbi"}, {"score": 0.0022847009758393405, "phrase": "existing_systems"}, {"score": 0.0021436720821474973, "phrase": "fuzzy_bimodal_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Information", " Restriction", " Information principle", " Possibilistic information", " Probabilistic information", " Bimodal information"], "paper_abstract": "The conventional wisdom is that the concept of information is closely related to the concept of probability. In Shannon's information theory, information is equated to a reduction in entropy-a probabilistic concept. In this paper, a different view of information is put on the table. Information is equated to restriction. More concretely, a restriction is a limitation on the values which a variable can take. The concept of a restriction is more general than the concept of a constraint and the concept of a probability distribution. There are three principal kinds of restrictions: possibilistic, probabilistic and bimodal. A bimodal restriction is a combination of possibilistic and probabilistic restrictions. Underlying the restriction-centered approach to information is what may be called the Information Principle. Briefly stated, the Information Principle has three parts. (a) Information = restriction. (b) There are three principal types of information: possibilistic information, probabilistic information and bimodal information. Bimodal information is a combination of possibilistic information and probabilistic information. (c) Possibilistic information and probabilistic information are underivable (orthogonal), in the sense that neither is derivable from the other. Information is all around us. And yet, there is widespread unawareness of the existence of the Information Principle. In particular, what is not recognized is that possibilistic information and probabilistic information are underivable (orthogonal). An important empirical observation is that propositions in a natural language are carriers of predominantly fuzzy possibilistic information (FPI) and fuzzy bimodal information (FBI). Existing systems of reasoning and computation-other than fuzzy logic-do not have the capability to reason and compute with fuzzy bimodal information. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "The Information Principle", "paper_id": "WOS:000346542800037"}