{"auto_keywords": [{"score": 0.04717317999994781, "phrase": "mild_disabilities"}, {"score": 0.01194765190836811, "phrase": "adaptive_case-based_learning"}, {"score": 0.00481495049065317, "phrase": "adaptive_learning_case_recommendation_approach"}, {"score": 0.0034902664176377943, "phrase": "real_complexity"}, {"score": 0.00341309513558946, "phrase": "learning_problems"}, {"score": 0.0032347516831068715, "phrase": "adaptive_case_recommendation_approach"}, {"score": 0.0025518429503461736, "phrase": "regular_and_special_education_teachers'_knowledge_development"}, {"score": 0.002364865100579589, "phrase": "case-based_reasoning"}, {"score": 0.0023125191783901367, "phrase": "semantics_identification"}, {"score": 0.0022816681646340518, "phrase": "adaptive_recommendation_approach"}, {"score": 0.0022112700457629494, "phrase": "adaptive_pbel"}, {"score": 0.002162316557411786, "phrase": "teachers'_practical_knowledge"}, {"score": 0.0021049977753042253, "phrase": "students'_learning_problems"}], "paper_keywords": ["Problem-based e-learning", " Case-based reasoning", " Clustering analysis", " Probability latent semantic analysis"], "paper_abstract": "Most e-learning platforms offer theoretical knowledge content but not practical knowledge required for problem solving. This study proposed a problem-based e-learning (PBeL) model which incorporates the problem-based learning (PBL) theory, social constructivism, and situated learning theories to assist regular and special education teachers in effectively developing knowledge for mathematics teaching for students with mild disabilities. To support adaptive case-based learning in the proposed PBeL and to adequately address the real complexity and diversity of the learning problems of students' with mild disabilities, this research also developed an adaptive case recommendation approach which identifies the most suitable authentic learning cases based on the characteristics of learners (teachers), the strengths, weaknesses, and types of disabilities of their students, the teaching problems of various mathematical topics, and the teaching context in order to facilitate adaptive case-based learning in the context of problem-based e-learning for regular and special education teachers' knowledge development. Clustering and information retrieval techniques were used to construct the context and content maps for case-based reasoning with the capability of semantics identification. The adaptive recommendation approach not only enables the realization of adaptive PBeL, but also enhances teachers' practical knowledge and assists them to solve students' learning problems. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Development of an adaptive learning case recommendation approach for problem-based e-learning on mathematics teaching for students with mild disabilities", "paper_id": "WOS:000263584100160"}