{"auto_keywords": [{"score": 0.046916644702957915, "phrase": "e-learning_system_quality"}, {"score": 0.046577269805750374, "phrase": "e-learning_readiness"}, {"score": 0.04624023069838199, "phrase": "e-learners'_competency"}, {"score": 0.008463150994491008, "phrase": "taiwan"}, {"score": 0.00481495049065317, "phrase": "online_learning_skills"}, {"score": 0.004600870784042767, "phrase": "conceptual_structural_equation_model"}, {"score": 0.004248782702870078, "phrase": "direct_and_indirect_effect"}, {"score": 0.0037774893672602506, "phrase": "e-learning_experience"}, {"score": 0.0036093693971289754, "phrase": "structural_equation_modeling"}, {"score": 0.0035820833812158035, "phrase": "findings_-_results"}, {"score": 0.0034618177773967015, "phrase": "direct_and_significant_impact"}, {"score": 0.0031246358910995316, "phrase": "-learners'_competency"}, {"score": 0.0031010029460927864, "phrase": "direct_and_positive_significant_influence"}, {"score": 0.003042697264766327, "phrase": "practical_implications"}, {"score": 0.002777689934513217, "phrase": "individuals'_online_learning_skills"}, {"score": 0.0025357050267224715, "phrase": "external_and_internal_factors"}, {"score": 0.0024504843466435487, "phrase": "high_tech_companies"}, {"score": 0.0024043803470189455, "phrase": "research_contributions"}, {"score": 0.0023591417077156555, "phrase": "previous_researches"}, {"score": 0.0023235629819760018, "phrase": "mediating_effect"}, {"score": 0.002305974875400655, "phrase": "e-learning_competency"}, {"score": 0.0021049977753042253, "phrase": "employees'_knowledge"}], "paper_keywords": ["Students", " Electronic media", " Learning", " Quality", " Internet"], "paper_abstract": "Purpose - This study aims to propose a conceptual structural equation model to investigate the relationships among e-learning system quality, e-learning readiness, e-learners' competency as well as learning outcomes, and to demonstrate the direct and indirect effect of e-learning system quality and e-learning readiness on learning outcomes from the perspectives of e-learners' competency. Design/methodology/approach - A questionnaire was distributed to 379 full-time employees from ten technological companies in Taiwan who have had e-learning experience (n = 379). Data were analyzed by employing structural equation modeling. Findings - Results reveal that both e-learning system quality and e-learning readiness have a direct and significant impact on e-learners' competency. However, e-learning system quality and e-learning readiness influence learning outcomes indirectly through e-learners' competency. In addition, e-learners' competency has direct and positive significant influence on learning outcomes. Practical implications - Based on these findings, organizations in Taiwan that would like to implement e-learning with their employees should focus on improving individuals' online learning skills such as self-direction, meta-cognitive, and collaborative skills. Originality/value - The findings created an understanding of what attributes of external and internal factors influence the outcome of e-learning in high tech companies. In terms of research contributions, the study extends previous researches by identifying the mediating effect of e-learning competency, on the relationship between e-learning system quality, e-learning readiness and learning outcome. Organizations that would like to adopt e-learning to improve employees' knowledge and skills will be able to apply strategies based on the findings from the research.", "paper_title": "Influence of online learning skills in cyberspace", "paper_id": "WOS:000276069000004"}