{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pce"}, {"score": 0.004359328949187473, "phrase": "pce-based_wavelength_switched_optical_networks"}, {"score": 0.004278807087784626, "phrase": "distributed_wavelength_assignment_scheme"}, {"score": 0.0032749212355657215, "phrase": "pce-based_architecture"}, {"score": 0.0029645930408561086, "phrase": "advisable_way"}, {"score": 0.0029097582786754444, "phrase": "additional_wavelength"}, {"score": 0.0027857115172243226, "phrase": "meanwhile_a_lightpath"}, {"score": 0.0027172101552870973, "phrase": "higher_probability"}, {"score": 0.0024595996811420566, "phrase": "backup_wavelength"}, {"score": 0.0023990982005125763, "phrase": "simulation_results"}, {"score": 0.0022967713922705, "phrase": "proper_value"}, {"score": 0.0022402661832994094, "phrase": "dbwa"}, {"score": 0.0021851480717840484, "phrase": "contention-induced_blockings"}], "paper_keywords": ["PCE", " WSONs", " Wavelength assignment", " Backup reservation"], "paper_abstract": "For the Destination Initialed Reservation in PCE-based Wavelength Switched Optical Networks using the distributed wavelength assignment scheme, the establishment of a lightpath might be blocked because of the contention for the same wavelength between two or more concurrent requests traversing the same links, although there might be enough wavelength resource available. In order to reduce the blocking caused by contention, in the PCE-based architecture a Dynamic Backup-reservation Wavelength Assignment (DBWA) scheme has been proposed in this paper. Considering that it is not an advisable way to reserve additional wavelength when the resource is lacking and meanwhile a lightpath with more physical hops has higher probability to collide with others, a threshold is defined to decide whether to reserve a backup wavelength or not. Simulation results show that, by setting a proper value for threshold, DBWA can reduce the contention-induced blockings efficiently in comparison with the two traditional schemes.", "paper_title": "A PCE-based dynamic backup-reservation wavelength assignment scheme for WSONs", "paper_id": "WOS:000301332600010"}