{"auto_keywords": [{"score": 0.049596205816074254, "phrase": "euler"}, {"score": 0.012664991758511655, "phrase": "data_sets"}, {"score": 0.004600228893803583, "phrase": "set-theoretic_notions"}, {"score": 0.004328689762198895, "phrase": "previous_work"}, {"score": 0.003717656912608012, "phrase": "specific_contributions"}, {"score": 0.003241593463066851, "phrase": "topological_adjacency_properties"}, {"score": 0.002884317729022721, "phrase": "well-known_class"}, {"score": 0.002713788077665689, "phrase": "drawability_questions"}, {"score": 0.0024392031587145728, "phrase": "diagram_description"}, {"score": 0.002342048999008582, "phrase": "unique_labels"}, {"score": 0.002214734873559146, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Euler diagrams", " Venn diagrams", " 3D", " Information visualization"], "paper_abstract": "3D Euler diagrams visually represent the set-theoretic notions of intersection, containment and disjointness by using closed, orientable surfaces. In previous work, we introduced 3D Venn and Euler diagrams and formally defined them. In this paper, we consider the drawability of data sets using 3D Venn and Euler diagrams. The specific contributions are as follows. First, we demonstrate that there is more choice of layout when drawing 3D Euler diagrams than when drawing 2D Euler diagrams. These choices impact the topological adjacency properties of the diagrams and having more choice is helpful for some Euler diagram drawing algorithms. To illustrate this, we consider the well-known class of Venn-3 diagrams in detail. We then proceed to consider drawability questions centered around which data sets can be visualized when the diagrams are required to possess certain properties. We show that any diagram description can be drawn with 3D Euler diagrams that have unique labels. We then go on to define a set of necessary and sufficient conditions for wellformed drawability in 3D. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "On the drawability of 3D Venn and Euler diagrams", "paper_id": "WOS:000334651300005"}