{"auto_keywords": [{"score": 0.04931727328027492, "phrase": "set_agreement"}, {"score": 0.006908582798367306, "phrase": "distributed_computing"}, {"score": 0.00481495561571796, "phrase": "asynchrony"}, {"score": 0.004675398507423721, "phrase": "fundamental_problem"}, {"score": 0.004564219532677855, "phrase": "small_subset"}, {"score": 0.004503594685501314, "phrase": "larger_set"}, {"score": 0.004420064334987394, "phrase": "fault-tolerant_set_agreement"}, {"score": 0.004326488232412809, "phrase": "seminal_results"}, {"score": 0.00426900754050533, "phrase": "synchronous_networks"}, {"score": 0.004145212745333947, "phrase": "significant_research_challenge"}, {"score": 0.004068302313449334, "phrase": "real_systems"}, {"score": 0.0034004242101610556, "phrase": "novel_technique"}, {"score": 0.003346233959203152, "phrase": "fault-prone_asynchronous"}, {"score": 0.003284098922460191, "phrase": "asynchronous_and_failure-prone_message-passing_system"}, {"score": 0.0031632577978662484, "phrase": "simulation_technique"}, {"score": 0.003055020877549054, "phrase": "partially_synchronous_system"}, {"score": 0.003014381456564809, "phrase": "asynchronous_wait-free_set_agreement"}, {"score": 0.0029504765287722465, "phrase": "set_agreement_protocol"}, {"score": 0.0028191285111793126, "phrase": "distributed_asynchrony_detection_mechanism"}, {"score": 0.0026577673946415583, "phrase": "minimal_window"}, {"score": 0.002519084003850149, "phrase": "independent_interest"}, {"score": 0.0023369711258107244, "phrase": "gafni_et_al"}, {"score": 0.0023120501704065777, "phrase": "siam_j._comput"}, {"score": 0.002197248893814575, "phrase": "guerraoui_et_al"}, {"score": 0.0021738284702463337, "phrase": "theor"}, {"score": 0.0021049977753042253, "phrase": "algorithmic_way"}], "paper_keywords": ["Distributed computing", " Message passing", " Set agreement", " Eventual synchrony", " Time complexity", " Lower bounds"], "paper_abstract": "Set agreement is a fundamental problem in distributed computing in which processes collectively choose a small subset of values from a larger set of proposals. The impossibility of fault-tolerant set agreement in asynchronous networks is one of the seminal results in distributed computing. In synchronous networks, too, the complexity of set agreement has been a significant research challenge that has now been resolved. Real systems, however, are neither purely synchronous nor purely asynchronous. Rather, they tend to alternate between periods of synchrony and periods of asynchrony. Nothing specific is known about the complexity of set agreement in such a \"partially synchronous\" setting. In this paper, we address this challenge, presenting the first (asymptotically) tight bound on the complexity of set agreement in such systems. We introduce a novel technique for simulating, in a fault-prone asynchronous shared memory, executions of an asynchronous and failure-prone message-passing system in which some fragments appear synchronous to some processes. We use this simulation technique to derive a lower bound on the round complexity of set agreement in a partially synchronous system by a reduction from asynchronous wait-free set agreement. Specifically, we show that every set agreement protocol requires at least [t/k] + 2 synchronous rounds to decide. We present an (asymptotically) matching algorithm that relies on a distributed asynchrony detection mechanism to decide as soon as possible during periods of synchrony. From these two results, we derive the size of the minimal window of synchrony needed to solve set agreement. By relating synchronous, asynchronous and partially synchronous environments, our simulation technique is of independent interest. In particular, it allows us to obtain a new lower bound on the complexity of early deciding k-set agreement complementary to that of Gafni et al. (in SIAM J. Comput. 40(1):63-78, 2011), and to re-derive the combinatorial topology lower bound of Guerraoui et al. (in Theor. Comput. Sci. 410(6-7):570-580, 2009) in an algorithmic way.", "paper_title": "Of Choices, Failures and Asynchrony: The Many Faces of Set Agreement", "paper_id": "WOS:000298388200026"}