{"auto_keywords": [{"score": 0.031461310706329015, "phrase": "nomological_network"}, {"score": 0.00481495049065317, "phrase": "complementary_views"}, {"score": 0.00447251540886613, "phrase": "individual_information_behavior"}, {"score": 0.004363846362238565, "phrase": "different_approaches"}, {"score": 0.004321118442104989, "phrase": "different_relationships"}, {"score": 0.0041136473765874815, "phrase": "different_views"}, {"score": 0.004013662619667083, "phrase": "individual_actions"}, {"score": 0.003877737556673229, "phrase": "different_theoretical_views"}, {"score": 0.003566422652043389, "phrase": "different_analytic_treatments"}, {"score": 0.003378385493203297, "phrase": "respondent's_unaided_recall"}, {"score": 0.0032160319265621285, "phrase": "inherited_cancers"}, {"score": 0.002943147037670826, "phrase": "related_concepts"}, {"score": 0.0028857130140890787, "phrase": "omnibus_survey"}, {"score": 0.0026933542552712033, "phrase": "increased_fragmentation"}, {"score": 0.00266693888510356, "phrase": "information_environments"}, {"score": 0.0026277995163948263, "phrase": "different_underlying_logics"}, {"score": 0.0026020254041372723, "phrase": "active_ingredients"}, {"score": 0.0024525907271610104, "phrase": "emerging_common_theme"}, {"score": 0.0022777800735119405, "phrase": "particular_problems"}], "paper_keywords": ["information behavior", " information seeking", " context", " fields", " pathways"], "paper_abstract": "This research contrasts two different conceptions, fields and pathways, of individual information behavior in context. These different approaches imply different relationships between actors and their information environments and, thus, encapsulate different views of the relationship between individual actions and contexts. We discuss these different theoretical views, then empirically compare and contrast them. The operationalization of these conceptions is based on different analytic treatments of the same raw data: a battery of three questions based on respondent's unaided recall of the sources they would consult for information on inherited cancers, a particularly rich information seeking problem. These operationalizations are then analyzed in a nomological network of related concepts drawn from an omnibus survey of 882 adults. The results indicated four clusters for fields and 16 different pathways, indicating increased fragmentation of information environments, with different underlying logics and active ingredients, although the use of the Internet appears to be an emerging common theme. The analysis of the nomological network suggests that both approaches may have applications for particular problems. In the implications, we compare and contrast these approaches, discussing their significance for future methodological, analytical, and theoretical developments. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Fields and pathways: Contrasting or complementary views of information seeking", "paper_id": "WOS:000233061300015"}