{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_interfaces"}, {"score": 0.046523629458456256, "phrase": "user_friendliness"}, {"score": 0.03732094694824022, "phrase": "expert_study"}, {"score": 0.014064882650771757, "phrase": "user_study"}, {"score": 0.01341332369811801, "phrase": "ebsco_host"}, {"score": 0.011998326964057568, "phrase": "data_collection"}, {"score": 0.004794952674520433, "phrase": "e-journals_ii"}, {"score": 0.004618651617663879, "phrase": "wider_study"}, {"score": 0.004439552313910285, "phrase": "information_retrieval"}, {"score": 0.0042319750840864485, "phrase": "previous_expert_study"}, {"score": 0.00408478706058626, "phrase": "emerald"}, {"score": 0.0038533908724436806, "phrase": "pilot_study"}, {"score": 0.003837371279203483, "phrase": "ten_subjects"}, {"score": 0.0038134661959562813, "phrase": "main_study"}, {"score": 0.0037739536087090467, "phrase": "postgraduate_students"}, {"score": 0.0037504588298826204, "phrase": "ul"}, {"score": 0.0036426367491469327, "phrase": "users_perceptions"}, {"score": 0.003457750082677649, "phrase": "high_appreciation"}, {"score": 0.003443369590223299, "phrase": "auxiliary_functions"}, {"score": 0.003414787164401854, "phrase": "search_history"}, {"score": 0.003316597994305725, "phrase": "great_extent"}, {"score": 0.003254967550314256, "phrase": "available_different_full-text_formats"}, {"score": 0.003089696510540289, "phrase": "different_functions"}, {"score": 0.0030385974707339, "phrase": "overall_perceptions"}, {"score": 0.003019653302485665, "phrase": "interface_friendliness"}, {"score": 0.002502948201667317, "phrase": "large_quantities"}, {"score": 0.0023609483974495063, "phrase": "ir_systems"}, {"score": 0.002312206270838452, "phrase": "user_education"}, {"score": 0.0022644681484934306, "phrase": "users'_own_perceptions"}, {"score": 0.0022362986152673547, "phrase": "e-journal_interfaces"}, {"score": 0.002167395053885582, "phrase": "valuable_insight"}, {"score": 0.0021049977753042253, "phrase": "demanding_concept"}], "paper_keywords": ["User interfaces", " Electronic journals", " User studies", " Perception"], "paper_abstract": "Purpose - The paper aims to present a part of a wider study. performed at the Department of LIS&BS at the University of Ljubljana (UL). The study investigated the perceptions of user friendliness of information retrieval (IR) systems. Design/methodology/approach - An expert study and a user study were performed. The user study was based on the results of the previous expert study, which surveyed the interfaces of four e-journal IR systems (Science Direct, Proquest Direct, Ebsco Host and Emerald) and has been published separately. In the user study three of these interfaces were used: Science Direct, Proquest Direct, and Ebsco Host. A pilot study with ten subjects and a main study with 61 subjects, all postgraduate students of the UL, was performed. Questionnaires and observation were used for data collection. The users perceptions of user interfaces were investigated and compared to the finding's of the expert study. Findings - It was found that users do not show high appreciation of auxiliary functions (Such as search history, indexes, etc.) and do not use them to a great extent. They also do not prefer to have available different full-text formats. Perception,, of user friendliness of elements and functions were different in each interface. For each interface it was also established that different functions and elements; were influential in the overall perceptions of the interface friendliness. In comparison of the findings of the expert and user study it was found that the expert study was in some cases too detailed and investigated aspects not perceived by the users. For this reason, certain findings of both studies were not appropriate for comparison. Research limitations/implications - The methodology of data collection was rather demanding and lengthy, and influenced the type and size of sample. Because of that it may not be possible to generalise the result to all users of e-journals. Also, large quantities of data were collected which could be studied further. Practical implications - The results of the study are relevant for the design of the user interfaces of IR systems. They also have implications for other areas. e.g. user education and training. Originality/value - The study investigates the users' own perceptions of user friendliness of the e-journal interfaces and also compares them to the findings of the expert study. This gives a valuable insight and provides many different viewpoints in regard to user friendliness, which in itself is a demanding concept.", "paper_title": "Comparison and evaluation of the user interfaces of e-journals II: perceptions of the users", "paper_id": "WOS:000262135600003"}