{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "academic_research"}, {"score": 0.0047273577269638725, "phrase": "net-generation_students"}, {"score": 0.004494570360108983, "phrase": "googling"}, {"score": 0.004273196830970426, "phrase": "-paste_practices"}, {"score": 0.004214729542986473, "phrase": "educators'_concern"}, {"score": 0.0036385493850693983, "phrase": "tertiary_level"}, {"score": 0.003459191419478298, "phrase": "third-year_music_class"}, {"score": 0.00338060449446278, "phrase": "blog-based_supervision"}, {"score": 0.003213920601037463, "phrase": "hybrid_fashion"}, {"score": 0.0030414140732789186, "phrase": "blog_sharing"}, {"score": 0.0029722900280316216, "phrase": "students'_individually-owned_blogs"}, {"score": 0.0026011706232569316, "phrase": "researcher's_self-evaluation"}, {"score": 0.0025655216052760093, "phrase": "teaching-supervising_process"}, {"score": 0.0024956789310376635, "phrase": "students'_blog_discourse"}, {"score": 0.0023725232579531273, "phrase": "useful_insights"}, {"score": 0.002183938718432764, "phrase": "students'_research_skills"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blogging", " Web 2.0", " Net-Generation", " Academic/student research"], "paper_abstract": "For the net-generation students learning in a Web 2.0 world, research is often equated with Googling and approached with a mindset accustomed to cut-and-paste practices. Recognizing educators' concern over such students' learning dispositions on the one hand, and the educational affordances of blogging on the other, this study examines the use of blogging to initiate students into academic research at the tertiary level. It focuses on the experiences of three students from a third-year music class working on their research paper with blog-based supervision provided by the teacher. The course, in a hybrid fashion, combined face-to-face lectures and tutorials with blog sharing and discussion. The students' individually-owned blogs were specifically used as their research diaries in which they logged in their work in progress, they then received input from both the teacher and fellow students. Based on the researcher's self-evaluation of the teaching-supervising process, an analysis of the students' blog discourse, and students' survey feedback, this article offers useful insights and suggestions for educators interested in either using or researching on blogging as a means to develop students' research skills and understanding. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Using blogging to enhance the initiation of students into academic research", "paper_id": "WOS:000279137800033"}