{"auto_keywords": [{"score": 0.045492676640370204, "phrase": "conformant_planning"}, {"score": 0.03301414096234223, "phrase": "inductive_definitions"}, {"score": 0.00481495049065317, "phrase": "approximative_inference_method"}, {"score": 0.00445712058827745, "phrase": "second-order_logic"}, {"score": 0.0042388570312522, "phrase": "finite_domain_satisfiability_problems"}, {"score": 0.0037749456215035856, "phrase": "general_approximative_method"}, {"score": 0.0034806529881619454, "phrase": "syntactic_representation"}, {"score": 0.0034405207528624983, "phrase": "constraint_propagation_method"}, {"score": 0.0034140224493254935, "phrase": "first-order_logic"}, {"score": 0.003075583447856341, "phrase": "finite_domain_satisfiability_problem"}, {"score": 0.0030401074516310184, "phrase": "latter_language"}, {"score": 0.0030062647004989763, "phrase": "np"}, {"score": 0.002879872305061576, "phrase": "powerful_knowledge_representation_tool"}, {"score": 0.002373339527491525, "phrase": "general_theoretical_framework"}, {"score": 0.0023278569001363263, "phrase": "approximative_methods"}, {"score": 0.002171202123281881, "phrase": "practical_useful_problems"}, {"score": 0.0021049977753042253, "phrase": "effective_way"}], "paper_keywords": [""], "paper_abstract": "This paper considers the fragment there exists for all SO of second-order logic. Many interesting problems, such as conformant planning, can be naturally expressed as finite domain satisfiability problems of this logic. Such satisfiability problems are computationally hard (Sigma(P)(2)) and many of these problems are often solved approximately. In this paper, we develop a general approximative method, i.e., a sound but incomplete method, for solving there exists for all SO satisfiability problems. We use a syntactic representation of a constraint propagation method for first-order logic to transform such an there exists for all SO satisfiability problem to an there exists SO(I D) satisfiability problem (second-order logic, extended with inductive definitions). The finite domain satisfiability problem for the latter language is in NP and can be handled by several existing solvers. Inductive definitions are a powerful knowledge representation tool, and this motivates us to also approximate there exists for all SO (I D) problems. In order to do this, we first show how to perform propagation on such inductive definitions. Next, we use this to approximate there exists for all SO (I D) satisfiability problems. All this provides a general theoretical framework for a number of approximative methods in the literature. Moreover, we also show how we can use this framework for solving practical useful problems, such as conformant planning, in an effective way.", "paper_title": "An Approximative Inference Method for Solving there exists for all SO Satisfiability Problems", "paper_id": "WOS:000310674600001"}