{"auto_keywords": [{"score": 0.039503906687397436, "phrase": "voronoi_diagram"}, {"score": 0.014672406454289546, "phrase": "worst_case"}, {"score": 0.008557993111698895, "phrase": "spherical_particles"}, {"score": 0.004765636025196421, "phrase": "spatial_structure"}, {"score": 0.00469260526822018, "phrase": "morphological_structure"}, {"score": 0.004422869628975075, "phrase": "voronoi"}, {"score": 0.00431042908288624, "phrase": "delaunay"}, {"score": 0.00415777266387528, "phrase": "understanding_proximity"}, {"score": 0.0039490205074757985, "phrase": "corresponding_algorithms"}, {"score": 0.003928728331703105, "phrase": "reasoning_proximity"}, {"score": 0.003427246079774314, "phrase": "interior_states"}, {"score": 0.0033400433146309706, "phrase": "sorted_set"}, {"score": 0.0032216622984027558, "phrase": "particular_value"}, {"score": 0.0027175263159330523, "phrase": "low_bound_values"}, {"score": 0.0025151755329660837, "phrase": "binary_search"}, {"score": 0.0024893563212341633, "phrase": "sequential_search"}, {"score": 0.002364172626241202, "phrase": "presented_theory"}, {"score": 0.002292097733181405, "phrase": "diverse_areas"}, {"score": 0.0022744242010653997, "phrase": "structural_biology"}, {"score": 0.0022627174473816374, "phrase": "computer_graphics"}, {"score": 0.0022510708139135928, "phrase": "geometric_modelling"}, {"score": 0.0022394839933089074, "phrase": "computational_geometry"}, {"score": 0.002176812047296225, "phrase": "core_hurdle"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Voronoi diagram of spheres", " Beta-shape", " Beta-complex", " Quasi-triangulation", " Complex", " Protein structure", " Particle proximity"], "paper_abstract": "The proximity and topology among particles are often the most important factor for understanding the spatial structure of particles. Reasoning the morphological structure of molecules and reconstructing a surface from a point set are examples where proximity among particles is important. Traditionally, the Voronoi diagram of points, the power diagram, the Delaunay triangulation, and the regular triangulation, etc. have been used for understanding proximity among particles. In this paper, we present the theory of the beta-shape and the beta-complex and the corresponding algorithms for reasoning proximity among a set of spherical particles, both using the quasi-triangulation which is the dual of the Voronoi diagram of spheres. Given the Voronoi diagram of spheres, we first transform the Voronoi diagram to the quasi-triangulation. Then, we compute some intervals called beta-intervals for the singular, regular, and interior states of each simplex in the quasi-triangulation. From the sorted set of simplexes, the beta-shape and the beta-complex corresponding to a particular value of beta can be found efficiently. Given the Voronoi diagram of spheres, the quasi-triangulation can be obtained in O(m) time in the worst case, where m represents the number of simplexes in the quasi-triangulation. Then, the beta-intervals for all simplexes in the quasi-triangulation can also be computed in O(m) time in the worst case. After sorting the simplexes using the low bound values of the beta-intervals of each simplex in O(m log m) time, the beta-shape and the beta-complex can be computed in O(log m+k) time in the worst case by a binary search followed by a sequential search in the neighborhood, where k represents the number of simplexes in the beta-shape or the beta-complex. The presented theory of the beta-shape and the beta-complex will be equally useful for diverse areas such as structural biology, computer graphics, geometric modelling, computational geometry, CAD, physics, and chemistry, where the core hurdle lies in determining the proximity among spherical particles. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Three-dimensional beta-shapes and beta-complexes via quasi-triangulation", "paper_id": "WOS:000281619600006"}