{"auto_keywords": [{"score": 0.03579591370813866, "phrase": "pla_stability"}, {"score": 0.015178079617995315, "phrase": "pla"}, {"score": 0.00481495049065317, "phrase": "design_stability"}, {"score": 0.004775726266706856, "phrase": "software_product_line"}, {"score": 0.004672676139571354, "phrase": "product_line_architectures"}, {"score": 0.0045968436745655004, "phrase": "stable_accommodating_evolutionary_changes"}, {"score": 0.004571839402666666, "phrase": "stakeholder's_requirements"}, {"score": 0.004522236296659418, "phrase": "architectural_modifications"}, {"score": 0.0044005599565517875, "phrase": "product_line"}, {"score": 0.004352807055792728, "phrase": "maintenance_costs"}, {"score": 0.004317331276979733, "phrase": "key_challenge"}, {"score": 0.004212622018863036, "phrase": "crosscutting_impact"}, {"score": 0.004178283966378171, "phrase": "pla_decomposition"}, {"score": 0.0038393766931273223, "phrase": "crosscutting_features"}, {"score": 0.0035959257387697097, "phrase": "positive_and_negative_change_impact"}, {"score": 0.003556873173040166, "phrase": "aspect_based_design"}, {"score": 0.003331275574328097, "phrase": "evolutionary_change"}, {"score": 0.003286102075191774, "phrase": "broader_analysis"}, {"score": 0.0032063229232501965, "phrase": "hybrid_approach"}, {"score": 0.0031284745499175507, "phrase": "isolated_use"}, {"score": 0.0030525958912530475, "phrase": "ao"}, {"score": 0.0025910025014681368, "phrase": "eight_releases"}, {"score": 0.0025280559977738353, "phrase": "conventional_metrics_suites"}, {"score": 0.002466634951303726, "phrase": "architecture_stability_evaluation"}, {"score": 0.002374036811130075, "phrase": "superior_pla_resilience"}, {"score": 0.0022111720236287547, "phrase": "high_cohesive_and_loosely_coupled_plas"}, {"score": 0.0021515433205041585, "phrase": "feature_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Product Line Architecture", " Component-based Development", " Aspect-Oriented Software Development", " Design stability"], "paper_abstract": "Context: It is important for Product Line Architectures (PLA) to remain stable accommodating evolutionary changes of stakeholder's requirements. Otherwise, architectural modifications may have to be propagated to products of a product line, thereby increasing maintenance costs. A key challenge is that several features are likely to exert a crosscutting impact on the PLA decomposition, thereby making it more difficult to preserve its stability in the presence of changes. Some researchers claim that the use of aspects can ameliorate instabilities caused by changes in crosscutting features. Hence, it is important to understand which aspect-oriented (AO) and non-aspect-oriented techniques better cope with PLA stability through evolution. Objective: This paper evaluates the positive and negative change impact of component and aspect based design on PLAs. The objective of the evaluation is to assess how aspects and components promote PLA stability in the presence of various types of evolutionary change. To support a broader analysis, we also evaluate the PLA stability of a hybrid approach (i.e. combined use of aspects and components) against the isolated use of component-based, 00, and AO approaches. Method: An quantitative and qualitative analysis of PLA stability which involved four different implementations of a PLA: (i) an 00 implementation, (ii) an AO implementation, (iii) a component-based implementation, and (iv) a hybrid implementation where both components and aspects are employed. Each implementation has eight releases and they are functionally equivalent. We used conventional metrics suites for change impact and modularity to measure the architecture stability evaluation of the 4 implementations. Results: The combination of aspects and components promotes superior PLA resilience than the other PlAs in most of the circumstances. Conclusion: It is concluded that the combination of aspects and components supports the design of high cohesive and loosely coupled PLAs. It also contributes to improve modularity by untangling feature implementation. (C) 2010 Published by Elsevier B.V.", "paper_title": "Components meet aspects: Assessing design stability of a software product line", "paper_id": "WOS:000285812700001"}