{"auto_keywords": [{"score": 0.013273694186237441, "phrase": "visual_analytics_environments"}, {"score": 0.00481495049065317, "phrase": "visual_analytics"}, {"score": 0.004682917599491709, "phrase": "challenge_evaluation_methodology"}, {"score": 0.00450052670755585, "phrase": "algorithm_correctness"}, {"score": 0.004290969772225093, "phrase": "end_user"}, {"score": 0.004091130285858113, "phrase": "evaluation_methodology"}, {"score": 0.003947358102140903, "phrase": "community_evaluation_resource"}, {"score": 0.0031217859267564344, "phrase": "original_challenge"}, {"score": 0.0028037753646260937, "phrase": "community_evaluation_program"}, {"score": 0.0026307897899760383, "phrase": "right_metrics"}, {"score": 0.0024586427394152196, "phrase": "ongoing_evaluations"}, {"score": 0.002316105585203396, "phrase": "evaluation_methodologies"}, {"score": 0.0021049977753042253, "phrase": "community_evaluations"}], "paper_keywords": ["Community evaluations", " visual analytics environments", " utility evaluations"], "paper_abstract": "Evaluation of software can take many forms ranging from algorithm correctness and performance to evaluations that focus on the value to the end user. This article presents a discussion of the development of an evaluation methodology for visual analytics environments. The Visual Analytics Science and Technology Challenge was created as a community evaluation resource. This resource is available to researchers and developers of visual analytics environments and allows them to test out their designs and visualization and compare the results with the solution and the entries prepared by others. Sharing results allows the community to learn from each other and to hopefully advance more quickly. In this article, we discuss the original challenge and its evolution during the 7 years since its inception. While the Visual Analytics Science and Technology Challenge is the focus of this article, there are lessons for many involved in setting up a community evaluation program, including the need to understand the purpose of the evaluation, decide upon the right metrics to use, and the appropriate implementation of those metrics including datasets and evaluators. For ongoing evaluations, it is also necessary to track the evolution and to ensure that the evaluation methodologies are keeping pace with the science being evaluated. The discussions on the Visual Analytics Science and Technology Challenge on these topics should be pertinent to many interested in community evaluations.", "paper_title": "Evaluation of visual analytics environments: The road to the Visual Analytics Science and Technology challenge evaluation methodology", "paper_id": "WOS:000343034300003"}