{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "facebook"}, {"score": 0.0045691640746165045, "phrase": "online_social_networks"}, {"score": 0.004496080495247288, "phrase": "vertiginous_increase"}, {"score": 0.004406360418456518, "phrase": "young_people"}, {"score": 0.0043358695338488445, "phrase": "key_players"}, {"score": 0.0040485975929323, "phrase": "new_student_generation"}, {"score": 0.00398380712846857, "phrase": "digital_natives"}, {"score": 0.0038885527668812807, "phrase": "digital_immigrants"}, {"score": 0.003601628511550962, "phrase": "teaching_tool"}, {"score": 0.0034452601929727752, "phrase": "huge_potential"}, {"score": 0.003229815147800001, "phrase": "teaching_experience"}, {"score": 0.0031909403420958752, "phrase": "facebook_social_network"}, {"score": 0.003165283275312972, "phrase": "human_resource_management_degree_subjects"}, {"score": 0.002931569771634119, "phrase": "university_students"}, {"score": 0.0026181517251690606, "phrase": "findings_-_facebook"}, {"score": 0.0021049977753042253, "phrase": "literature_review"}], "paper_keywords": ["Teaching", " Facebook", " Universities", " Social networks"], "paper_abstract": "Purpose - The use of online social networks has experienced a vertiginous increase in the last few years, and young people appear as the key players in this trend. Immersed, educated and raised in the middle of technology, the new student generation is one of digital natives. Instead, lecturers are digital immigrants, but the authors have the responsibility to turn a technology which can be a distraction into a teaching tool. Facebook is an example of Web 2.0 technology that owns a huge potential in the field of education. The purpose of this paper is to show the teaching experience with the Facebook social network in human resource management degree subjects, for the purpose of highlighting its strengths and weaknesses. Design/methodology/approach - A survey was carried out among university students in order to reach the goal. A total of 191 students were asked to give their opinion about the use of Facebook in teaching, achieving 125 valid answers. Findings - Facebook can positively impact on the performance of students, who are satisfied with the experience and think that the information obtained in Facebook can improve their training. More negative attitudes towards Facebook appeared among those students who had not used it. Originality/value - The paper summarises the strengths and weaknesses of Facebook through a literature review and assesses them via a survey.", "paper_title": "Facebook in teaching: strengths and weaknesses", "paper_id": "WOS:000355669100005"}