{"auto_keywords": [{"score": 0.03709788182167048, "phrase": "group_skyline_computation"}, {"score": 0.03538009322318605, "phrase": "dominance_relation"}, {"score": 0.029071185405892198, "phrase": "skyline_groups"}, {"score": 0.00481495049065317, "phrase": "multi-dimensional_dataset"}, {"score": 0.004698514007994158, "phrase": "skyline_computation"}, {"score": 0.004157058883925715, "phrase": "conventional_skyline_computation"}, {"score": 0.002860546817196148, "phrase": "individual_dimensions"}, {"score": 0.002469032978674379, "phrase": "group_skyline_algorithm_gdynamic"}, {"score": 0.0023798115577749225, "phrase": "dynamic_algorithm"}, {"score": 0.002265833357217618, "phrase": "experimental_results"}, {"score": 0.002183938718432764, "phrase": "practical_group_skyline_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Skyline computation", " Dynamic algorithm"], "paper_abstract": "Given a multi-dimensional dataset of tuples, skyline computation returns a subset of tuples that are not dominated by any other tuples when all dimensions are considered together. Conventional skyline computation, however, is inadequate to answer various queries that need to analyze not just individual tuples of a dataset but also their combinations. In this paper, we study group skyline computation which is based on the notion of dominance relation between groups of the same number of tuples. It determines the dominance relation between two groups by comparing their aggregate values such as sums or averages of elements of individual dimensions, and identifies a set of skyline groups that are not dominated by any other groups. We investigate properties of group skyline computation and develop a group skyline algorithm GDynamic which is equivalent to a dynamic algorithm that fills a table of skyline groups. Experimental results show that GDynamic is a practical group skyline algorithm. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Group skyline computation", "paper_id": "WOS:000300201700008"}