{"auto_keywords": [{"score": 0.04790711481217238, "phrase": "information_granules"}, {"score": 0.010427555749207004, "phrase": "justifiable_granularity"}, {"score": 0.008631168465458004, "phrase": "input_space"}, {"score": 0.006416914320934244, "phrase": "output_space"}, {"score": 0.0061476101318469365, "phrase": "granular_mapping"}, {"score": 0.004556230694068238, "phrase": "design_framework"}, {"score": 0.004466519142879166, "phrase": "conceptually_meaningful_entities"}, {"score": 0.004397961100937846, "phrase": "large_number"}, {"score": 0.004378566229970024, "phrase": "experimental_input-output_numeric_data"}, {"score": 0.004263972370406983, "phrase": "conceptually_and_algorithmically_sound_way"}, {"score": 0.004189240486798138, "phrase": "directional_nature"}, {"score": 0.004106725110985659, "phrase": "directionality_aspect"}, {"score": 0.0038602215057106917, "phrase": "great_deal"}, {"score": 0.003628460216207393, "phrase": "clustering_algorithm"}, {"score": 0.0036044660791188037, "phrase": "illustrative_purposes"}, {"score": 0.00354909279546064, "phrase": "fuzzy_clustering"}, {"score": 0.00349456719539013, "phrase": "fuzzy_c-means_algorithm"}, {"score": 0.0033212215487678854, "phrase": "underlying_fundamental_conceptual_pursuits"}, {"score": 0.003306559295382181, "phrase": "granular_computing"}, {"score": 0.003227062590987598, "phrase": "constructed_information_granules"}, {"score": 0.0029018766659279294, "phrase": "single_formalism"}, {"score": 0.0028826733506942554, "phrase": "fuzzy_sets"}, {"score": 0.002832081745025006, "phrase": "required_formalism"}, {"score": 0.0028195727965553367, "phrase": "information_granulation"}, {"score": 0.002691509482993781, "phrase": "output_spaces"}, {"score": 0.002644263951773787, "phrase": "coverage_criterion"}, {"score": 0.002609373423354631, "phrase": "experimental_data"}, {"score": 0.002535344521369057, "phrase": "input_experimental_data"}, {"score": 0.002512990657100351, "phrase": "parametric_studies"}, {"score": 0.0024148064819862337, "phrase": "specificity_criteria"}, {"score": 0.0023462845318226577, "phrase": "output_information_granules"}, {"score": 0.0022948982889920044, "phrase": "coverage-specificity_dependency_help"}, {"score": 0.0022545989512505493, "phrase": "sound_compromise"}], "paper_keywords": ["Clustering", " free structure modeling", " granular mappings", " information granules", " principle of justifiable granularity"], "paper_abstract": "The study introduces a concept of mappings realized in presence of information granules and offers a design framework supporting the formation of such mappings. Information granules are conceptually meaningful entities formed on a basis of a large number of experimental input-output numeric data available for the construction of the model. We develop a conceptually and algorithmically sound way of forming information granules. Considering the directional nature of the mapping to be formed, this directionality aspect needs to be taken into account when developing information granules. The property of directionality implies that while the information granules in the input space could be constructed with a great deal of flexibility, the information granules formed in the output space have to inherently relate to those built in the input space. The input space is granulated by running a clustering algorithm; for illustrative purposes, the focus here is on fuzzy clustering realized with the aid of the fuzzy C-means algorithm. The information granules in the output space are constructed with the aid of the principle of justifiable granularity (being one of the underlying fundamental conceptual pursuits of Granular Computing). The construct exhibits two important features. First, the constructed information granules are formed in the presence of information granules already constructed in the input space (and this realization is reflective of the direction of the mapping from the input to the output space). Second, the principle of justifiable granularity does not confine the realization of information granules to a single formalism such as fuzzy sets but helps form the granules expressed any required formalism of information granulation. The quality of the granular mapping (viz. the mapping realized for the information granules formed in the input and output spaces) is expressed in terms of the coverage criterion (articulating how well the experimental data are \"covered\" by information granules produced by the granular mapping for any input experimental data). Some parametric studies are reported by quantifying the performance of the granular mapping (expressed in terms of the coverage and specificity criteria) versus the values of a certain parameters utilized in the construction of output information granules through the principle of justifiable granularity. The plots of coverage-specificity dependency help determine a knee point and reach a sound compromise between these two conflicting requirements imposed on the quality of the granular mapping. Furthermore, quantified is the quality of the mapping with regard to the number of information granules (implying a certain granularity of the mapping). A series of experiments is reported as well.", "paper_title": "The Design of Free Structure Granular Mappings: The Use of the Principle of Justifiable Granularity", "paper_id": "WOS:000327647500048"}