{"auto_keywords": [{"score": 0.035315857356336945, "phrase": "angular_velocity"}, {"score": 0.00481495049065317, "phrase": "head_movement_dynamics"}, {"score": 0.004723847090183984, "phrase": "perturbed_mother-infant_interaction"}, {"score": 0.004568525347438891, "phrase": "head_movement"}, {"score": 0.0036147562669032957, "phrase": "normal_behavior"}, {"score": 0.0033806943112103397, "phrase": "infant_angular_displacement"}, {"score": 0.00326939082861424, "phrase": "csiro_head_tracker"}, {"score": 0.003222814590544802, "phrase": "male_but_not_female_infants"}, {"score": 0.003043031131345537, "phrase": "still_face"}, {"score": 0.0029853535424953595, "phrase": "infant_angular_velocity"}, {"score": 0.00283229915062791, "phrase": "male_and_female_infants"}, {"score": 0.0027259252868643926, "phrase": "infant_and_mother_head_movements"}, {"score": 0.002661474607275484, "phrase": "dramatic_changes"}, {"score": 0.002537097217899195, "phrase": "infant_head_movement"}, {"score": 0.002350041573006264, "phrase": "angular_displacement"}, {"score": 0.00220823903315848, "phrase": "age-appropriate_emotion_challenge"}, {"score": 0.0021049977753042253, "phrase": "emotion_communication"}], "paper_keywords": ["face paradigm", " mother-infant interaction", " head movements", " social interaction"], "paper_abstract": "We investigated the dynamics of head movement in mothers and infants during an age-appropriate, well-validated emotion induction, the Still Face paradigm. In this paradigm, mothers and infants play normally for 2 minutes (Play) followed by 2 minutes in which the mothers remain unresponsive (Still Face), and then two minutes in which they resume normal behavior (Reunion). Participants were 42 ethnically diverse 4-month-old infants and their mothers. Mother and infant angular displacement and angular velocity were measured using the CSIRO head tracker. In male but not female infants, angular displacement increased from Play to Still-Face and decreased from Still Face to Reunion. Infant angular velocity was higher during Still-Face than Reunion with no differences between male and female infants. Windowed cross-correlation suggested changes in how infant and mother head movements are associated, revealing dramatic changes in direction of association. Coordination between mother and infant head movement velocity was greater during Play compared with Reunion. Together, these findings suggest that angular displacement, angular velocity and their coordination between mothers and infants are strongly related to age-appropriate emotion challenge. Attention to head movement can deepen our understanding of emotion communication.", "paper_title": "Head Movement Dynamics during Play and Perturbed Mother-Infant Interaction", "paper_id": "WOS:000366027900004"}