{"auto_keywords": [{"score": 0.049631680892871025, "phrase": "movement_disorders"}, {"score": 0.012250969614012508, "phrase": "developed_methodology"}, {"score": 0.010612387000973441, "phrase": "early_detection"}, {"score": 0.01036760480476965, "phrase": "infantile_cerebral_palsy"}, {"score": 0.007509142610165985, "phrase": "objective_diagnosis"}, {"score": 0.00703268184016045, "phrase": "pediatric_offices"}, {"score": 0.006837789186990486, "phrase": "daily_routine"}, {"score": 0.0045726187330434025, "phrase": "diagnostic_strategies"}, {"score": 0.004182301599359094, "phrase": "clinical_settings"}, {"score": 0.003861288537079326, "phrase": "pediatric_clinics"}, {"score": 0.003275616518505955, "phrase": "icp."}, {"score": 0.002939853413763817, "phrase": "low-cost_system"}, {"score": 0.002818013056816282, "phrase": "newborn's_movement"}, {"score": 0.0027012086158226456, "phrase": "decision_tree_algorithm"}, {"score": 0.002626034130205569, "phrase": "healthy_and_pathological_data"}, {"score": 0.0024586427394152196, "phrase": "clinical_study"}, {"score": 0.0022168460543913787, "phrase": "overall_detection_rate"}, {"score": 0.0021049977753042253, "phrase": "evaluated_measurements"}], "paper_keywords": ["Accelerometry", " Movement analysis", " Infantile cerebral palsy", " Diagnosis", " Movement disorders"], "paper_abstract": "So far, developed diagnostic strategies for the early detection of movement disorders due to infantile cerebral palsy (ICP) in newborns are not easily applicable in clinical settings. They are either difficult to acquire or they are too expensive to be established in pediatric clinics and are not sufficiently usable to be integrated into daily routine. The aim of this study therefore was to develop a methodology that allows the objective diagnosis of developing movement disorders in newborns due to ICP. It should be applicable to pediatric offices and should easily integrate in daily routine. To achieve this, a simple to use and low-cost system based on accelerometers was developed to evaluate the newborn's movement. Afterward, a classificator based on a decision tree algorithm was implemented to differentiate between healthy and pathological data in order to propose the most likely diagnosis. The developed methodology was validated in a clinical study with 19 healthy and 4 affected subjects that were evaluated at the first, third and fifths month after birth (corrected age). The overall detection rate of the developed methodology reached between 88 and 92% for all evaluated measurements. The developed methodology is simple to use, therefore is applicable for the objective diagnosis of developing movement disorders in newborns due to ICP and can be established in pediatric offices for use in daily routine.", "paper_title": "Movement analysis by accelerometry of newborns and infants for the early detection of movement disorders due to infantile cerebral palsy", "paper_id": "WOS:000280080400004"}