{"auto_keywords": [{"score": 0.04965786117733892, "phrase": "engineering_applications"}, {"score": 0.02322730111336099, "phrase": "semantic_information"}, {"score": 0.00746378820068061, "phrase": "conceptual_models"}, {"score": 0.004606843145343611, "phrase": "latest_advances"}, {"score": 0.004566308708871429, "phrase": "information_technology"}, {"score": 0.004506171772318298, "phrase": "increasing_complexity"}, {"score": 0.003999217176949845, "phrase": "natural_language_processing"}, {"score": 0.0037260386566859197, "phrase": "exhaustive_study"}, {"score": 0.003660700128133065, "phrase": "partial_views"}, {"score": 0.0035178323426661626, "phrase": "present_paper"}, {"score": 0.002807118943000936, "phrase": "hierarchy_structured_criteria"}, {"score": 0.002351485871160907, "phrase": "comparative_study"}, {"score": 0.002320449502337321, "phrase": "different_models"}, {"score": 0.0022999859758286423, "phrase": "different_features"}, {"score": 0.0022696277881969896, "phrase": "different_fields"}, {"score": 0.002219916677664081, "phrase": "present_comparison_study"}, {"score": 0.0021331586055770447, "phrase": "right_conceptual_models"}, {"score": 0.0021049977753042253, "phrase": "specific_requirements"}], "paper_keywords": ["Semantic information", " Conceptual model", " Modeling semantic information"], "paper_abstract": "Due to the latest advances of information technology and the increasing complexity of engineering applications, it is becoming more and more important to model semantic information. There are many modeling methodologies to do the work of modeling semantic information instead of natural language processing. Since this field is very broad, the comparison discussed here is not an exhaustive study but rather the partial views of the coauthors from our own perspectives. In the present paper we give a review of the literature of conceptual models especially static one and then classify them into four type models namely structure-based model, object-oriented model, knowledge semantic-based model, and web semantic-based model. Based on the classification given above, a hierarchy structured criteria is given. According to the criteria we pick one or two representative conceptual models from each type to conduct the comparison. We compare the following five aspects of conceptual models: expressivity, clarity, semantics, formal foundation, and application fields. The comparative study shows that different models have different features and fit different fields of engineering applications. The present comparison study is useful for users to understand and choose right conceptual models combining with specific requirements of engineering applications.", "paper_title": "Modeling semantic information in engineering applications: a review", "paper_id": "WOS:000300283700002"}