{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "complex_tasks"}, {"score": 0.010612420430273392, "phrase": "tam"}, {"score": 0.010425374673446256, "phrase": "swarm_robotics_research"}, {"score": 0.004662427600500598, "phrase": "swarm_robotics"}, {"score": 0.0043560464825349275, "phrase": "task_execution"}, {"score": 0.004217998654053147, "phrase": "abstract_tasks"}, {"score": 0.00347657813672945, "phrase": "ad_hoc_fashion"}, {"score": 0.0033663073782936952, "phrase": "new_approach"}, {"score": 0.003213153188898728, "phrase": "physical_device"}, {"score": 0.003066945490483524, "phrase": "single-robot_tasks"}, {"score": 0.0030017207229983385, "phrase": "e-puck_robot"}, {"score": 0.002969628818856786, "phrase": "complex_multi-robot_task"}, {"score": 0.00235247790591897, "phrase": "cooperative_behaviors"}, {"score": 0.002253410447951689, "phrase": "difficult_and_costly_to_conduct_using_specialized_robots_or_ad_hoc_task_abstraction"}, {"score": 0.0021662599012740127, "phrase": "multiple_tams"}, {"score": 0.0021430808503936963, "phrase": "example_scenario"}, {"score": 0.0021049977753042253, "phrase": "e-puck_robots"}], "paper_keywords": ["Swarm robotics", " Task abstraction", " Swarm intelligence", " Robotics"], "paper_abstract": "Research in swarm robotics focuses mostly on how robots interact and cooperate to perform tasks, rather than on the details of task execution. As a consequence, researchers often consider abstract tasks in their experimental work. For example, foraging is often studied without physically handling objects: the retrieval of an object from a source to a destination is abstracted into a trip between the two locations-no object is physically transported. Despite being commonly used, so far task abstraction has only been implemented in an ad hoc fashion. In this paper, we propose a new approach to abstracting complex tasks in swarm robotics research. This approach is based on a physical device called the \"task abstraction module\" (TAM) that abstracts single-robot tasks to be performed by an e-puck robot. A complex multi-robot task can be abstracted using a group of TAMs by first modeling the task as the set of its constituent single-robot subtasks and then abstracting each subtask with a TAM. We present a collection of tools for modeling complex tasks, and a framework for controlling a group of TAMs such that the behavior of the group implements the model of the task. The TAM enables research on cooperative behaviors and complex tasks with simple, cost-effective robots such as the e-puck-research that would be difficult and costly to conduct using specialized robots or ad hoc task abstraction. We demonstrate how to abstract a complex task with multiple TAMs in an example scenario involving a swarm of e-puck robots.", "paper_title": "The TAM: abstracting complex tasks in swarm robotics research", "paper_id": "WOS:000349915900001"}