{"auto_keywords": [{"score": 0.042901468727873274, "phrase": "different_types"}, {"score": 0.004058180509184539, "phrase": "ip_addresses"}, {"score": 0.00332375606483146, "phrase": "novel_dual-stack-based_architecture"}, {"score": 0.0031845067058084583, "phrase": "core_element"}, {"score": 0.003094920033010818, "phrase": "dual-stack_tracker"}, {"score": 0.003007846011394511, "phrase": "ip_address_interconnect"}, {"score": 0.002909342017421165, "phrase": "hybrid_network"}, {"score": 0.0025345213929290835, "phrase": "ip"}, {"score": 0.0024397017438101726, "phrase": "architecture_and_performance_results"}, {"score": 0.0021049977753042253, "phrase": "representative_application"}], "paper_keywords": ["IPv4/v6 network", " Peer-to-peer", " IPTV", " Live video streaming"], "paper_abstract": "As IPv4 address pool has been completely depleted and the transition from IPv4 to IPv6 has become a trend, P2P video streaming through IPv4/v6 hybrid network is now needed, for equipments with different types of IP addresses widely exist on the Internet. Traditionally, large-scale commercial P2P-IPTV systems have been deployed in IPv4 networks. However, these systems do not support equipments with IPv6 addresses and cannot work in IPv4/v6 hybrid networks. To overcome this problem, we propose a novel dual-stack-based architecture to distribute contents to different networks. The core element of the system is the dual-stack tracker which makes all equipments with IP address interconnect with each other and form a hybrid network. Meanwhile, equipments with IPv4/v6 addresses act as bridges, which distribute contents to IPv4 and IPv6 networks. The paper focuses on how to make all equipments with different types of IP addresses work in one system, analyzing the architecture and performance results related to the use of IPv6 bandwidth. This system has been deployed and broadcasted the 2010 FIFA World Cup South Africa with 755 kbps video stream, and our results demonstrate the feasibility of video over IPv4/v6 hybrid network for a representative application.", "paper_title": "A novel P2P IPTV system for IPv4/v6 networks", "paper_id": "WOS:000339889800044"}