{"auto_keywords": [{"score": 0.04560362315992008, "phrase": "social_value"}, {"score": 0.04283466066833854, "phrase": "private_value"}, {"score": 0.015719716506582538, "phrase": "discrete_and_cumulative_innovation"}, {"score": 0.015057811791245978, "phrase": "private_and_social_value"}, {"score": 0.013232489800110598, "phrase": "technological_fields"}, {"score": 0.0034554281349858836, "phrase": "underlying_concepts"}, {"score": 0.0030989899982042236, "phrase": "cumulative_innovation"}, {"score": 0.002918826667294298, "phrase": "technological_standards"}, {"score": 0.0028715299874549245, "phrase": "factor_analysis"}, {"score": 0.0027943943921568456, "phrase": "patent_quality_indicators"}, {"score": 0.0024386325347607674, "phrase": "robust_and_significant_link"}, {"score": 0.0021049977753042253, "phrase": "whole_technological_classes"}], "paper_keywords": ["Patent value", " Patent quality", " Indicators", " Cumulative innovation", " Complex technologies", " Standardization"], "paper_abstract": "This article analyzes the relationship between private and social value of patents, comparing discrete and cumulative innovation. Indicators of the social value of patents are known to be less correlated with measures of private value in technological fields where innovation is more cumulative. We test whether this is because the link between private and social value is weaker, or because the indicators are less informative of the underlying concepts of value. Furthermore we analyze whether these differences between technological fields are really due to cumulativeness. We observe cumulative innovation by making use of databases of patents declared essential for technological standards. Using factor analysis and a set of patent quality indicators, we test the relevance of social value for predicting the private value of a patent measured by renewal and litigation. Whereas we establish a robust and significant link for discrete technologies; neither common factors nor any indicator of social value allows predicting the private value of essential, very cumulative patents. Nevertheless, this result cannot be generalized to whole technological classes identified as \"complex\" by the literature.", "paper_title": "The private and social value of patents in discrete and cumulative innovation", "paper_id": "WOS:000299088900015"}