{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_mining"}, {"score": 0.019321956832196625, "phrase": "previous_works"}, {"score": 0.010016715202670293, "phrase": "knowledge_extraction"}, {"score": 0.008102469484009125, "phrase": "medical_data_mining"}, {"score": 0.004768559572292452, "phrase": "powerful_method"}, {"score": 0.004662036750452837, "phrase": "raw_data"}, {"score": 0.004587402291248795, "phrase": "traditional_method"}, {"score": 0.00409723267214392, "phrase": "different_areas"}, {"score": 0.00390346982868576, "phrase": "medical_data"}, {"score": 0.003865826699096508, "phrase": "main_idea"}, {"score": 0.003779393063001438, "phrase": "key_papers"}, {"score": 0.003694884775158077, "phrase": "medical_practitioners"}, {"score": 0.003635676878573833, "phrase": "multidisciplinary_field"}, {"score": 0.0034081501761600067, "phrase": "users'_requirements"}, {"score": 0.0032051601987130207, "phrase": "structural_medical_data"}, {"score": 0.003014223770316234, "phrase": "six_medical_tasks"}, {"score": 0.0028438099634371886, "phrase": "five_data_mining_approaches"}, {"score": 0.002648520437064087, "phrase": "brief_summarization"}, {"score": 0.0025892330566358503, "phrase": "standard_framework"}, {"score": 0.0022676260293002706, "phrase": "single_work"}, {"score": 0.0021601997088758957, "phrase": "interesting_areas"}, {"score": 0.0021462652605453163, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining application", " Medical data mining", " Medicine", " Disease", " Data mining algorithms"], "paper_abstract": "Data mining is a powerful method to extract knowledge from data. Raw data faces various challenges that make traditional method improper for knowledge extraction. Data mining is supposed to be able to handle various data types in all formats. Relevance of this paper is emphasized by the fact that data mining is an object of research in different areas. In this paper, we review previous works in the context of knowledge extraction from medical data. The main idea in this paper is to describe key papers and provide some guidelines to help medical practitioners. Medical data mining is a multidisciplinary field with contribution of medicine and data mining. Due to this fact, previous works should be classified to cover all users' requirements from various fields. Because of this, we have studied papers with the aim of extracting knowledge from structural medical data published between 1999 and 2013. We clarify medical data mining and its main goals. Therefore, each paper is studied based on the six medical tasks: screening, diagnosis, treatment, prognosis, monitoring and management. In each task, five data mining approaches are considered: classification, regression, clustering, association and hybrid. At the end of each task, a brief summarization and discussion are stated. A standard framework according to CRISP-DM is additionally adapted to manage all activities. As a discussion, current issue and future trend are mentioned. The amount of the works published in this scope is substantial and it is impossible to discuss all of them on a single work. We hope this paper will make it possible to explore previous works and identify interesting areas for future research. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Knowledge discovery in medicine: Current issue and future trend", "paper_id": "WOS:000333778000035"}