{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quantitative_information_flow"}, {"score": 0.011666521018137655, "phrase": "quantitative_analysis"}, {"score": 0.004612376827433774, "phrase": "information_theory"}, {"score": 0.004460703838987562, "phrase": "main_ideas"}, {"score": 0.003529364798514874, "phrase": "deterministic_systems"}, {"score": 0.0033645655483989746, "phrase": "valuable_foundation"}, {"score": 0.0032074366230426727, "phrase": "elegant_algebraic_framework"}, {"score": 0.002859533151305368, "phrase": "order_relation_correspondences"}, {"score": 0.0028187792953857957, "phrase": "different_quantitative_approaches"}, {"score": 0.002699960312990493, "phrase": "recent_work"}, {"score": 0.002524982927936405, "phrase": "foundational_importance"}, {"score": 0.002327648608736437, "phrase": "linux_kernel_vulnerabilities"}, {"score": 0.0021049977753042253, "phrase": "main_reference_structure"}], "paper_keywords": [""], "paper_abstract": "Several mathematical ideas have been investigated for quantitative information flow. Information theory, probability, guessability are the main ideas in most proposals. They aim to quantify how much information is leaked, how likely is to guess the secret and how long does it take to guess the secret respectively. In this work, we investigate the relationship between these ideas in the context of the quantitative analysis of deterministic systems. We propose the lattice of information as a valuable foundation for these approaches; not only it provides an elegant algebraic framework for the ideas, but also to investigate their relationship. In particular, we will use this lattice to prove some results establishing order relation correspondences between the different quantitative approaches. The implications of these results w.r.t. recent work in the community is also investigated. While this work concentrates on the foundational importance of the lattice of information its practical relevance has been recently proven, notably with the quantitative analysis of Linux kernel vulnerabilities. Overall, we believe these works set the case for establishing the lattice of information as one of the main reference structure for quantitative information flow.", "paper_title": "Algebraic foundations for quantitative information flow", "paper_id": "WOS:000347805000007"}