{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "path-preserving_clusterings"}, {"score": 0.004718314112245913, "phrase": "graph_visualization_systems"}, {"score": 0.004647105813224402, "phrase": "opaque_metanodes"}, {"score": 0.00457696724030363, "phrase": "visual_clutter"}, {"score": 0.0044398358177815305, "phrase": "large_graphs"}, {"score": 0.004241771072194993, "phrase": "path-preserving_way"}, {"score": 0.004177724522109952, "phrase": "attribute_values"}, {"score": 0.003971111060168551, "phrase": "extensive_use"}, {"score": 0.003736567662016446, "phrase": "formal_experimentation"}, {"score": 0.003341839487905525, "phrase": "user_study"}, {"score": 0.0030500051941781034, "phrase": "graph_size"}, {"score": 0.002943502888225748, "phrase": "primary_research_question"}, {"score": 0.002769483748975581, "phrase": "significant_difference"}, {"score": 0.002237357942660354, "phrase": "global_tasks"}, {"score": 0.0021049977753042253, "phrase": "local_attribute_tasks"}], "paper_keywords": [""], "paper_abstract": "Graph visualization systems often exploit opaque metanodes to reduce visual clutter and improve the readability of large graphs. This filtering can be done in a path-preserving way based on attribute values associated with the nodes of the graph. Despite extensive use of these representations, as far as we know, no formal experimentation exists to evaluate if they improve the readability of graphs. In this paper, we present the results of a user study that formally evaluates how such representations affect the readability of graphs. We also explore the effect of graph size and connectivity in terms of this primary research question. Overall, for our tasks, we did not find a significant difference when this clustering is used. However, if the graph is highly connected, these clusterings can improve performance. Also, if the graph is large enough and can be simplified into a few metanodes, benefits in performance on global tasks are realized. Under these same conditions, however, performance of local attribute tasks may be reduced.", "paper_title": "The Readability of Path-Preserving Clusterings of Graphs", "paper_id": "WOS:000280991300041"}