{"auto_keywords": [{"score": 0.03415513336079159, "phrase": "core-to-access-speed_ratio"}, {"score": 0.015397832559667004, "phrase": "core_routers"}, {"score": 0.00481495049065317, "phrase": "impact_of_file_arrivals"}, {"score": 0.00474827840031692, "phrase": "buffer_sizing"}, {"score": 0.004553725265085244, "phrase": "efficiency_requirements"}, {"score": 0.00452215340217755, "phrase": "tcp"}, {"score": 0.004459445258869177, "phrase": "buffer_size"}, {"score": 0.0037719307016238998, "phrase": "statistical_multiplexing"}, {"score": 0.0036425727071563965, "phrase": "long-lived_connections"}, {"score": 0.0034327289845581693, "phrase": "buffer-size_requirements"}, {"score": 0.0030591665967282886, "phrase": "larger_buffer_sizes"}, {"score": 0.0030167329549240078, "phrase": "flow-level_performance"}, {"score": 0.0029438813080245544, "phrase": "modeling_point"}, {"score": 0.0027741761880779535, "phrase": "buffer-sizing_rules"}, {"score": 0.0027071661844502992, "phrase": "fixed_number"}, {"score": 0.0023133055945761235, "phrase": "independent_quantities"}, {"score": 0.0021496083700137305, "phrase": "good_performance"}, {"score": 0.0021049977753042253, "phrase": "utilization_results"}], "paper_keywords": ["Buffer sizing", " core routers", " edge routers", " Internet routers"], "paper_abstract": "Traditionally, it had been assumed that the efficiency requirements of TCP dictate that the buffer size at the router must be of the order of the bandwidth-delay (C x RTT) product. Recently, this assumption was questioned in a number of papers, and the rule was shown to be conservative for certain traffic models. In particular, by appealing to statistical multiplexing, it was shown that on a router with long-lived connections, buffers of size O(C x RTT/root N) or even O(1) are sufficient. In this paper, we reexamine the buffer-size requirements of core routers when flows arrive and depart. Our conclusion is as follows: If the core-to-access-speed ratio is large, then O(1) buffers are sufficient at the core routers; otherwise, larger buffer sizes do improve the flow-level performance of the users. From a modeling point of view, our analysis offers two new insights. First, it may not be appropriate to derive buffer-sizing rules by studying a network with a fixed number of users. In fact, depending upon the core-to-access-speed ratio, the buffer size itself may affect the number of flows in the system, so these two parameters (buffer size and number of flows in the system) should not be treated as independent quantities. Second, in the regime where the core-to-access-speed ratio is large, we note that the O(1) buffer sizes are sufficient for good performance and that no loss of utilization results, as previously believed.", "paper_title": "Impact of File Arrivals and Departures on Buffer Sizing in Core Routers", "paper_id": "WOS:000289845700004"}