{"auto_keywords": [{"score": 0.036472550633710604, "phrase": "preferential_text_categorization_task"}, {"score": 0.0319925883999622, "phrase": "primary_and_secondary_categories"}, {"score": 0.00481495049065317, "phrase": "evaluation_measures"}, {"score": 0.004701556483912018, "phrase": "textual_documents"}, {"score": 0.004627441072541506, "phrase": "thematic_categories"}, {"score": 0.0044826811976193485, "phrase": "primary_categories"}, {"score": 0.00385431710959668, "phrase": "text_categorization_research"}, {"score": 0.003503497128638099, "phrase": "evaluation_measure"}, {"score": 0.0034208822062692127, "phrase": "different_kinds"}, {"score": 0.0031342307827666675, "phrase": "well-known_benchmark"}, {"score": 0.0028487656293168795, "phrase": "well_established_classification_problems"}, {"score": 0.0027815466400771768, "phrase": "state-of-the-art_learning_technology"}, {"score": 0.002726740692380339, "phrase": "kernel-based_methods"}, {"score": 0.002578946584040053, "phrase": "recently_proposed_class"}, {"score": 0.0024981087707313656, "phrase": "training_data"}, {"score": 0.002468450551616404, "phrase": "preferential_form"}, {"score": 0.002181813794658713, "phrase": "classification_phase"}, {"score": 0.0021387992835532367, "phrase": "learning_phase"}], "paper_keywords": ["Preferential learning", " Supervised learning", " Text categorization", " Text classification", " Primary and secondary categories"], "paper_abstract": "In many applicative contexts in which textual documents are labelled with thematic categories, a distinction is made between the primary categories of a document, which represent the topics that are central to it, and its secondary categories, which represent topics that the document only touches upon. We contend that this distinction, so far neglected in text categorization research, is important and deserves to be explicitly tackled. The contribution of this paper is threefold. First, we propose an evaluation measure for this preferential text categorization task, whereby different kinds of misclassifications involving either primary or secondary categories have a different impact on effectiveness. Second, we establish several baseline results for this task on a well-known benchmark for patent classification in which the distinction between primary and secondary categories is present; these results are obtained by reformulating the preferential text categorization task in terms of well established classification problems, such as single and/or multi-label multiclass classification; state-of-the-art learning technology such as SVMs and kernel-based methods are used. Third, we improve on these results by using a recently proposed class of algorithms explicitly devised for learning from training data expressed in preferential form, i.e., in the form \"for document d (i) , category c' is preferred to category c''aEuroe; this allows us to distinguish between primary and secondary categories not only in the classification phase but also in the learning phase, thus differentiating their impact on the classifiers to be generated.", "paper_title": "Preferential text classification: learning algorithms and evaluation measures", "paper_id": "WOS:000269320200003"}