{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "effective_and_efficient_use"}, {"score": 0.004691465925553365, "phrase": "numerous_studies"}, {"score": 0.004206338218873218, "phrase": "web-authoring_tools"}, {"score": 0.003598705020845104, "phrase": "effective_and_efficient_strategies"}, {"score": 0.003542976343910816, "phrase": "computer_applications"}, {"score": 0.0032094634756436595, "phrase": "controlled_experiments"}, {"score": 0.003143341238802547, "phrase": "instructional_approach"}, {"score": 0.002968424524565369, "phrase": "command_knowledge"}, {"score": 0.0028921584725218642, "phrase": "technical_and_nontechnical_majors"}, {"score": 0.002759769970554556, "phrase": "different_instructional_contexts"}, {"score": 0.0027311809666295565, "phrase": "new_applications"}, {"score": 0.002702887319160532, "phrase": "real-world_classroom_experience"}, {"score": 0.0026609940110902666, "phrase": "strategy-based_instruction"}, {"score": 0.0022407927161620855, "phrase": "large_number"}, {"score": 0.0021381565332182773, "phrase": "strategic_knowledge"}], "paper_keywords": ["strategies", " teaching", " training", " strategy-based instruction"], "paper_abstract": "Numerous studies have shown that many users do not acquire the knowledge necessary for the effective and efficient use of computer applications such as spreadsheets and Web-authoring tools. While many cognitive, cultural, and social reasons have been offered to explain this phenomenon, there have been few systematic attempts to address it. This article describes how we identified a framework to organize effective and efficient strategies to use computer applications and used an approach called strategy-based instruction to teach those strategies over five years to almost 400 students. Controlled experiments demonstrated that the instructional approach (1) enables students to learn strategies without harming command knowledge, (2) benefits students from technical and nontechnical majors, and (3) is robust across different instructional contexts and new applications. Real-world classroom experience of teaching strategy-based instruction over several instantiations has enabled the approach to be disseminated to other universities. The lessons learned throughout the process of design, implementation, evaluation, and dissemination should allow teaching a large number of users in many organizations to rapidly acquire the strategic knowledge to make more effective and efficient use of computer applications.", "paper_title": "Strategy-based instruction: Lessons learned in teaching the effective and efficient use of computer applications", "paper_id": "WOS:000255973100002"}