{"auto_keywords": [{"score": 0.047144925784151935, "phrase": "intellectual_ability"}, {"score": 0.010246026778676177, "phrase": "internet_use"}, {"score": 0.00481495049065317, "phrase": "non-academic_internet_use"}, {"score": 0.004356741449157895, "phrase": "cell_phones"}, {"score": 0.0036810726176482278, "phrase": "portable_device_use"}, {"score": 0.0034013521529056715, "phrase": "introductory_psychology_class"}, {"score": 0.0030772505522663612, "phrase": "exam_scores"}, {"score": 0.0029657683623403085, "phrase": "classroom_learning"}, {"score": 0.0027258422018680453, "phrase": "portable_devices"}, {"score": 0.0025858215477025117, "phrase": "higher_intellectual_ability"}, {"score": 0.0024144659350277954, "phrase": "higher_rates"}, {"score": 0.002339246282204109, "phrase": "lower_test_grades"}, {"score": 0.0023146962503449186, "phrase": "students'_beliefs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Internet", " Cell phone", " Texting", " Academic performance"], "paper_abstract": "The use of laptops and cell phones in the classroom is increasing but there is little research assessing whether these devices create distraction that diminishes learning. Moreover, the contribution of intellectual ability to the relationship between learning and portable device use has not been thoroughly investigated. To bridge this gap, students in an introductory psychology class were surveyed about the frequency and duration of their use of various portable devices in the classroom. Internet use negatively predicted exam scores and added to the prediction of classroom learning, above a measure of intellectual ability. Furthermore, students discounted the effect of using portable devices on learning over time. Concomitantly, those with higher intellectual ability reported using the internet more in class over time. Thus, higher rates of internet use were associated with lower test grades and students' beliefs about this relationship did not reflect their ability to multi-task effectively. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Non-academic internet use in the classroom is negatively related to classroom learning regardless of intellectual ability", "paper_id": "WOS:000341675100011"}