{"auto_keywords": [{"score": 0.010985018032136324, "phrase": "linear-stretch_prg"}, {"score": 0.00481495049065317, "phrase": "pseudorandom_generators"}, {"score": 0.004773692073488661, "phrase": "linear_stretch"}, {"score": 0.0045726187330434025, "phrase": "cryptographic_pseudorandom_generators"}, {"score": 0.0044369056710423065, "phrase": "namely_ones"}, {"score": 0.004159446063902181, "phrase": "previous_constructions"}, {"score": 0.0039841418890102925, "phrase": "n_bits"}, {"score": 0.003296212583539166, "phrase": "non-trivial_hardness"}, {"score": 0.0031982609080278643, "phrase": "pcp_machinery"}, {"score": 0.0028591768694918, "phrase": "specific_intractability_assumption"}, {"score": 0.002738523189244011, "phrase": "\"_linear_codes"}, {"score": 0.002566998160386212, "phrase": "alekhnovich"}, {"score": 0.0025122373359090454, "phrase": "approximation_results"}, {"score": 0.0024799423362011582, "phrase": "latter_assumption"}, {"score": 0.0023548511815224098, "phrase": "new_concrete_assumptions"}, {"score": 0.0021049977753042253, "phrase": "cryptographic_applications"}], "paper_keywords": [""], "paper_abstract": "We consider the question of constructing cryptographic pseudorandom generators (PRGs) in NC0, namely ones in which each bit of the output depends on just a constant number of input bits. Previous constructions of such PRGs were limited to stretching a seed of n bits to n + o(n) bits. This leaves open the existence of a PRG with a linear (let alone superlinear) stretch in NC0. In this work we study this question and obtain the following main results: 1. We show that the existence of a linear-stretch PRG in NC0 implies non-trivial hardness of approximation results without relying on PCP machinery. In particular, that Max 3SAT is hard to approximate to within some constant. 2. We construct a linear-stretch PRG in NC0 under a specific intractability assumption related to the hardness of decoding \"sparsely generated\" linear codes. Such an assumption was previously conjectured by Alekhnovich [1]. We note that Alekhnovich directly obtains hardness of approximation results from the latter assumption. Thus, we do not prove hardness of approximation under new concrete assumptions. However, our first result is motivated by the hope to prove hardness of approximation under more general or standard cryptographic assumptions, and the second result is independently motivated by cryptographic applications.", "paper_title": "On pseudorandom generators with linear stretch in NC0", "paper_id": "WOS:000240348600023"}