{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "individual_haplotyping"}, {"score": 0.009156191881424785, "phrase": "block_partition"}, {"score": 0.008902979249677822, "phrase": "better_accuracy"}, {"score": 0.0046593017130868, "phrase": "important_role"}, {"score": 0.004594137808658537, "phrase": "association_studies"}, {"score": 0.004551199992546761, "phrase": "disease_gene"}, {"score": 0.004508661664944657, "phrase": "drug_responsivity"}, {"score": 0.004383406949799696, "phrase": "low_throughput"}, {"score": 0.004342430078306461, "phrase": "expensive_biological_experiments"}, {"score": 0.004182301599359094, "phrase": "efficient_statistical_methods"}, {"score": 0.003807242767474929, "phrase": "numerous_possible_haplotypes"}, {"score": 0.0037188360359702182, "phrase": "ligation_strategy"}, {"score": 0.003598492288058048, "phrase": "time_complexity"}, {"score": 0.0033851984021896287, "phrase": "recent_studies"}, {"score": 0.003066945490483524, "phrase": "haplotype_structure"}, {"score": 0.002818013056816282, "phrase": "simple_algorithm"}, {"score": 0.0022064376000055764, "phrase": "real_and_simulated_dataset"}, {"score": 0.0021049977753042253, "phrase": "short_running_time"}], "paper_keywords": [""], "paper_abstract": "Motivation: Haplotype played an important role in the association studies of disease gene and drug responsivity over the past years, but the low throughput of expensive biological experiments largely limited its application. Alternatively, some efficient statistical methods were developed to deduce haplotypes from genotypes directly. Because these algorithms usually needed to estimate the frequencies of numerous possible haplotypes, the partition and ligation strategy was widely adopted to reduce the time complexity. The haplotypes were usually partitioned uniformly in the past, but recent studies showed that the haplotypes had their own block structure, which may be not uniform. More reasonable block partition and ligation strategy according to the haplotype structure may further improve the accuracy of individual haplotyping. Results: In this article, we presented a simple algorithm for block partition and ligation, which provided better accuracy for individual haplotyping. The block partition and ligation could be completed within O(m(2) logm + m(2)n) time complexity, where m represented the length of genotypes and n represented the number of individuals. We tested the performance of our algorithm on both real and simulated dataset. The result showed that our algorithm yielded better accuracy with short running time.", "paper_title": "A better block partition and ligation strategy for individual haplotyping", "paper_id": "WOS:000261168600009"}