{"auto_keywords": [{"score": 0.04257671993897684, "phrase": "type_functions"}, {"score": 0.010612470572670002, "phrase": "haskell"}, {"score": 0.007345444066179932, "phrase": "ghc"}, {"score": 0.004621279527317074, "phrase": "glasgow_haskell_compiler"}, {"score": 0.004481132747216135, "phrase": "expressive_type-level_programming"}, {"score": 0.004002513373645485, "phrase": "type_inference"}, {"score": 0.0035932440062595252, "phrase": "type_variable"}, {"score": 0.003361069456060196, "phrase": "small_modification"}, {"score": 0.003048370487544551, "phrase": "injectivity_annotations"}, {"score": 0.0026806884201358537, "phrase": "completeness_property"}, {"score": 0.0024311346712789553, "phrase": "simple_pattern-matching_structure"}, {"score": 0.0021377414429251647, "phrase": "regular_users"}, {"score": 0.0021049977753042253, "phrase": "next_stable_release"}], "paper_keywords": ["Haskell", " type-level programming", " type families", " functional dependencies", " injectivity"], "paper_abstract": "Haskell, as implemented by the Glasgow Haskell Compiler (GHC), allows expressive type-level programming. The most popular typelevel programming extension is TypeFamilies, which allows users to write functions on types. Yet, using type functions can cripple type inference in certain situations. In particular, lack of injectivity in type functions means that GHC can never infer an instantiation of a type variable appearing only under type functions. In this paper, we describe a small modification to GHC that allows type functions to be annotated as injective. GHC naturally must check validity of the injectivity annotations. The algorithm to do so is surprisingly subtle. We prove soundness for a simplification of our algorithm, and state and prove a completeness property, though the algorithm is not fully complete. As much of our reasoning surrounds functions defined by a simple pattern-matching structure, we believe our results extend beyond just Haskell. We have implemented our solution on a branch of GHC and plan to make it available to regular users with the next stable release of the compiler.", "paper_title": "Injective Type Families for Haskell", "paper_id": "WOS:000370549100012"}