{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "line_signature_verification"}, {"score": 0.004726052718910578, "phrase": "wavelet_transform"}, {"score": 0.004638788604042707, "phrase": "characteristic_points"}, {"score": 0.004581505405526037, "phrase": "on-line_signature_verification"}, {"score": 0.004386503433248535, "phrase": "personal_verification"}, {"score": 0.004225950334493496, "phrase": "on-line_signature_verification_method"}, {"score": 0.0028917056916949744, "phrase": "majority_voting_scheme"}, {"score": 0.002803104254950008, "phrase": "signature_database"}, {"score": 0.0027512482368183596, "phrase": "f-tablet"}, {"score": 0.002521623057264411, "phrase": "experimental_results"}, {"score": 0.0021851480717840484, "phrase": "whole_authentication_processing"}, {"score": 0.0021049977753042253, "phrase": "signature_verification"}], "paper_keywords": [""], "paper_abstract": "On-line signature verification is one of the most accepted means for personal verification. This paper proposes an on-line signature verification method based on Wavelet Transform (WT). Firstly, the method uses wavelet transform to exact characteristic points of 3-axis force and 2-dimension coordinate of signature obtained by the F-Tablet. And then it builds 5-dimension feature sequences and dynamically creates multi-templates using clustering. Finally, after the fusion of the above-mentioned 5-dimension feature sequences, whether the signature is genuine or not is decided by majority voting scheme. Experimenting on a signature database acquired by F-Tablet, the performance evaluation in even EER (Equal Error Rate) was improved to 2.83%. The experimental results show that the method not only reduces the amount of data to be stored, but also minimizes the duration of the whole authentication processing and increases the efficiency of signature verification.", "paper_title": "On-line signature verification based on wavelet transform to extract characteristic points", "paper_id": "WOS:000240385300127"}