{"auto_keywords": [{"score": 0.031059848886510907, "phrase": "social_traits"}, {"score": 0.00481495049065317, "phrase": "body_motion_cues"}, {"score": 0.004691805714620268, "phrase": "better_understanding"}, {"score": 0.004571795959568108, "phrase": "body_movements"}, {"score": 0.004416523252575371, "phrase": "socially_realistic_manner"}, {"score": 0.004340867148018378, "phrase": "realistic_body_motion"}, {"score": 0.00429114801805935, "phrase": "human_movements"}, {"score": 0.00415732498274046, "phrase": "natural_animations"}, {"score": 0.00392456965725842, "phrase": "specific_information"}, {"score": 0.0037369640296837834, "phrase": "perceived_traits"}, {"score": 0.0035175070315611088, "phrase": "body_motions"}, {"score": 0.003378385493203297, "phrase": "\"villain\"-like_manner"}, {"score": 0.0033396533935201316, "phrase": "first_experiment"}, {"score": 0.003301363873919944, "phrase": "individual_video_recordings"}, {"score": 0.0031891008393769515, "phrase": "body_motion_stimuli"}, {"score": 0.0031434552452869156, "phrase": "different_cognitive_dimensions"}, {"score": 0.003010389418340144, "phrase": "intersubject_ratings"}, {"score": 0.0028912667826416494, "phrase": "body_motion"}, {"score": 0.002858103326172894, "phrase": "correlational_analyses"}, {"score": 0.002817181909556205, "phrase": "consistent_associations"}, {"score": 0.0026211746739675927, "phrase": "qualitative_body_motion_cues"}, {"score": 0.0025761937402886954, "phrase": "specific_intentions"}, {"score": 0.0025392983369523143, "phrase": "hero-_and_villain-like_body_movements"}, {"score": 0.0025029300115295317, "phrase": "distinct_body_motions"}, {"score": 0.0023287359930308864, "phrase": "portrayed_character_type"}, {"score": 0.0022429900751970797, "phrase": "specific_sets"}, {"score": 0.0021729011671662536, "phrase": "important_implications"}, {"score": 0.0021233040503324005, "phrase": "virtual_characters"}, {"score": 0.0021049977753042253, "phrase": "desired_social_information"}], "paper_keywords": ["Human Factors", " Experimentation", " Body motion", " traits", " intentions", " social inferences", " cognitive dimensions", " \"Effort Shape\" analysis", " virtual humans"], "paper_abstract": "A better understanding of how intentions and traits are perceived from body movements is required for the design of more effective virtual characters that behave in a socially realistic manner. For this purpose, realistic body motion, captured from human movements, is being used more frequently for creating characters with natural animations in games and entertainment. However, it is not always clear for programmers and designers which specific motion parameters best convey specific information such as certain emotions, intentions, or traits. We conducted two experiments to investigate whether the perceived traits of actors could be determined from their body motion, and whether these traits were associated with their perceived intentions. We first recorded body motions from 26 professional actors, who were instructed to move in a \"hero\"-like or a \"villain\"-like manner. In the first experiment, 190 participants viewed individual video recordings of these actors and were required to provide ratings to the body motion stimuli along a series of different cognitive dimensions (intentions, attractiveness, dominance, trustworthiness, and distinctiveness). The intersubject ratings across observers were highly consistent, suggesting that social traits are readily determined from body motion. Moreover, correlational analyses between these ratings revealed consistent associations across traits, for example, that perceived \"good\" intentions were associated with higher ratings of attractiveness and dominance. Experiment 2 was designed to elucidate the qualitative body motion cues that were critical for determining specific intentions and traits from the hero- and villain-like body movements. The results revealed distinct body motions that were readily associated with the perception of either \"good\" or \"bad\" intentions. Moreover, regression analyses revealed that these ratings accurately predicted the perception of the portrayed character type. These findings indicate that intentions and social traits are communicated effectively via specific sets of body motion features. Furthermore, these results have important implications for the design of the motion of virtual characters to convey desired social information.", "paper_title": "Strutting Hero, Sneaking Villain: Utilizing Body Motion Cues to Predict the Intentions of Others", "paper_id": "WOS:000369773400001"}