{"auto_keywords": [{"score": 0.046345717877726705, "phrase": "proposed_concept"}, {"score": 0.00481495049065317, "phrase": "automated_and_self-adaptive_systems"}, {"score": 0.004611369021812453, "phrase": "machine_learning_techniques"}, {"score": 0.004512814529823301, "phrase": "human_expertise"}, {"score": 0.003900257249255497, "phrase": "access_patterns"}, {"score": 0.0037352048741373816, "phrase": "network_traffic"}, {"score": 0.0035005841368145525, "phrase": "protocol_level"}, {"score": 0.003370565320453525, "phrase": "real-life_data"}, {"score": 0.003059650700398617, "phrase": "levels"}, {"score": 0.0027741761880779535, "phrase": "small_spamtrap"}, {"score": 0.002270745003370529, "phrase": "similar_way"}, {"score": 0.0022101055924375725, "phrase": "purely_passive_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Botnet", " E-mail spam", " Traffic analysis", " Machine learning", " IT security"], "paper_abstract": "We develop and discuss automated and self-adaptive systems for detecting and classifying botnets based on machine learning techniques and integration of human expertise. The proposed concept is purely passive and is based on analyzing information collected at three levels: (i) the payload of single packets received, (ii) observed access patterns to a darknet at the level of network traffic, and (iii) observed contents of TCP/IP traffic at the protocol level. We illustrate experiments based on real-life data collected with a darknet set up for this purpose to show the potential of the proposed concept for Levels (i) and (ii). As darknets cannot capture TCP/IP traffic data, we use a small spamtrap in our experiments at Level (iii). Strictly speaking, this approach for Level (iii) is not purely passive. However, traffic moving through a network could potentially be analyzed in a similar way to also obtain a purely passive system at this level. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "On the detection and identification of botnets", "paper_id": "WOS:000272862400005"}