{"auto_keywords": [{"score": 0.048644738257163776, "phrase": "autonomous_e-coaching_systems"}, {"score": 0.010612387000973441, "phrase": "option_generation"}, {"score": 0.00437281181878921, "phrase": "user's_decision-making_process"}, {"score": 0.0038131738052230254, "phrase": "corresponding_process"}, {"score": 0.002988685006809336, "phrase": "human_option_generation"}, {"score": 0.0028120022457134267, "phrase": "first_aim"}, {"score": 0.0024268423699752113, "phrase": "person's_options"}, {"score": 0.002390133671838149, "phrase": "e-coaching_system's_suggestions"}, {"score": 0.0021373366163721518, "phrase": "e-coaching_systems"}, {"score": 0.0021049977753042253, "phrase": "people's_autonomy"}], "paper_keywords": ["Option generation", " Decision making", " E-coaching", " Effectiveness", " Ethics", " Autonomy"], "paper_abstract": "Autonomous e-coaching systems offer their users suggestions for action, thereby affecting the user's decision-making process. More specifically, the suggestions that these systems make influence the options for action that people actually consider. Surprisingly though, options and the corresponding process of option generation-a decision-making stage preceding intention formation and action selection-have received very little attention in the various disciplines studying decision making. We argue that this neglect is unjustified and that it is important, particularly for designers of autonomous e-coaching systems, to understand how human option generation works. The aims of this paper are threefold. The first aim is to generate awareness with designers of autonomous e-coaching systems that these systems do in fact influence their users' options. The second is to show that understanding the interplay between a person's options and the e-coaching system's suggestions is important for improving the effectiveness of the system. The third is that the very same interplay is also crucial for designing e-coaching systems that respect people's autonomy.", "paper_title": "Why option generation matters for the design of autonomous e-coaching systems", "paper_id": "WOS:000365104200007"}