{"auto_keywords": [{"score": 0.04961325410404205, "phrase": "dti_fibers"}, {"score": 0.00481495049065317, "phrase": "interactive_exploration"}, {"score": 0.004721711709176679, "phrase": "visual_exploration"}, {"score": 0.004178351419209898, "phrase": "dti_fiber_visualization_use"}, {"score": 0.0034524248924699985, "phrase": "even_a_few_thousand_fibers"}, {"score": 0.0033361232750221863, "phrase": "novel_interaction_method"}, {"score": 0.0031767199435197243, "phrase": "low-dimensional_embedding"}, {"score": 0.002937318465594425, "phrase": "visual_clutter"}, {"score": 0.0027832502848247303, "phrase": "new_interface"}, {"score": 0.002414708668304862, "phrase": "gpu"}, {"score": 0.002356173823922118, "phrase": "real-time_interaction"}, {"score": 0.0021678232353129472, "phrase": "user's_workload"}, {"score": 0.0021049977753042253, "phrase": "quick_and_accurate_dti_fiber_selection"}], "paper_keywords": ["Diffusion Tensor Imaging", " Fibers", " Fiber Clustering", " Visualization Interface"], "paper_abstract": "Visual exploration is essential to the visualization and analysis of densely sampled 3D DTI fibers in biological speciments, due to the high geometric, spatial, and anatomical complexity of fiber tracts. Previous methods for DTI fiber visualization use zooming, color-mapping, selection, and abstraction to deliver the characteristics of the fibers. However, these schemes mainly focus on the optimization of visualization in the 3D space where cluttering and occlusion make grasping even a few thousand fibers difficult. This paper introduces a novel interaction method that augments the 3D visualization with a 2D representation containing a low-dimensional embedding of the DTI fibers. This embedding preserves the relationship between the fibers and removes the visual clutter that is inherent in 3D renderings of the fibers. This new interface allows the user to manipulate the DTI fibers as both 3D curves and 2D embedded points and easily compare or validate his or her results in both domains. The implementation of the framework is GPU-based to achieve real-time interaction. The framework was applied to several tasks, and the results show that our method reduces the user's workload in recognizing 3D DTI fibers and permits quick and accurate DTI fiber selection.", "paper_title": "A Novel Interface for Interactive Exploration of DTI Fibers", "paper_id": "WOS:000270778900074"}