{"auto_keywords": [{"score": 0.04999075963438953, "phrase": "minimum_arborescence_problem"}, {"score": 0.049124089120586543, "phrase": "map"}, {"score": 0.03978951043790749, "phrase": "msap"}, {"score": 0.03539897369792484, "phrase": "spanning_property"}, {"score": 0.03235275702100603, "phrase": "multicommodity_flow_reformulation"}, {"score": 0.02909950987926379, "phrase": "linear_programming_relaxation"}, {"score": 0.004606148097788071, "phrase": "minimum_cost_arborescence"}, {"score": 0.004550783060775205, "phrase": "directed_graph"}, {"score": 0.003935892934907777, "phrase": "model_presentation"}, {"score": 0.003487222504700868, "phrase": "polyhedral_structure"}, {"score": 0.0029792984108210525, "phrase": "well-known_multicommodity_flow_reformulations"}, {"score": 0.002907992115184249, "phrase": "flow_conservation_constraints"}, {"score": 0.0024642355970277497, "phrase": "upper_bound_perspective"}, {"score": 0.0024149629835339926, "phrase": "constructive_heuristic"}, {"score": 0.0023666732429695908, "phrase": "local_search_procedure"}, {"score": 0.002319346861878611, "phrase": "key_path"}, {"score": 0.002272964710550345, "phrase": "steiner_tree_problem"}, {"score": 0.002254672021120091, "phrase": "numerical_experiments"}, {"score": 0.0021566565951738658, "phrase": "proposed_methods"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["arborescence", " Steiner Tree", " reformulation", " connectivity constraints", " Lagrangean relaxation", " local search"], "paper_abstract": "The Minimum Arborescence problem (MAP) consists of finding a minimum cost arborescence in a directed graph. This problem is NP-Hard and is a generalization of two well-known problems: the Minimum Spanning Arborescence Problem (MSAP) and the Directed Node Weighted Steiner Tree Problem (DNWSTP). We start the model presentation in this paper by describing four models for the MSAP (including two new ones, using so called \"connectivity\" constraints which forbid disconnected components) and we then describe the changes induced on the polyhedral structure of the problem by the removal of the spanning property. Only two (the two new ones) of the four models for the MSAP remain valid when the spanning property is removed. We also describe a multicommodity flow reformulation for the MAP that differs from well-known multicommodity flow reformulations in the sense that the flow conservation constraints at source and destination are replaced by inequalities. We show that the linear programming relaxation of this formulation is equivalent to the linear programming relaxation of the best of the two previous valid formulations and we also propose two Lagrangean relaxations based on the multicommodity flow reformulation. From the upper bound perspective, we describe a constructive heuristic as well as a local search procedure involving the concept of key path developed earlier for the Steiner Tree Problem. Numerical experiments taken from instances with up to 400 nodes are used to evaluate the proposed methods. (C) 2007 Wiley Periodicals, Inc.", "paper_title": "Models and heuristics for a minimum arborescence problem", "paper_id": "WOS:000252171500004"}