{"auto_keywords": [{"score": 0.04879536524099014, "phrase": "ethernet"}, {"score": 0.004389912080394437, "phrase": "lan_installations"}, {"score": 0.0038737214010638745, "phrase": "expanded_application"}, {"score": 0.0035701213515857227, "phrase": "new_trend"}, {"score": 0.003219368413618912, "phrase": "specific_adaptations"}, {"score": 0.003115908199991072, "phrase": "communication_technology"}, {"score": 0.0027943943921568456, "phrase": "specific_requirements"}, {"score": 0.0025334249463305875, "phrase": "common_ethernet_lan_technology"}, {"score": 0.0023602032679095977, "phrase": "application_field's_requirements"}, {"score": 0.0022718774783143203, "phrase": "different_fields"}, {"score": 0.0021631447601689444, "phrase": "fundamental_concepts"}, {"score": 0.0021049977753042253, "phrase": "service_capabilities"}], "paper_keywords": ["Ethernet", " IEEE 802 standards"], "paper_abstract": "During the last decades, Ethernet progressively became the most widely used local area networking (LAN) technology. Apart from LAN installations, Ethernet became also attractive for many other fields of application, ranging from industry to avionics, telecommunication, and multimedia. The expanded application of this technology is mainly due to its significant assets like reduced cost, backward-compatibility, flexibility, and expandability. However, this new trend raises some problems concerning the services of the protocol and the requirements for each application. Therefore, specific adaptations prove essential to integrate this communication technology in each field of application. Our primary objective is to show how Ethernet has been enhanced to comply with the specific requirements of several application fields, particularly in transport, embedded and multimedia contexts. The paper first describes the common Ethernet LAN technology and highlights its main features. It reviews the most important specific Ethernet versions with respect to each application field's requirements. Finally, we compare these different fields of application and we particularly focus on the fundamental concepts and the quality of service capabilities of each proposal.", "paper_title": "Ethernet - A Survey on its Fields of Application", "paper_id": "WOS:000277777000009"}