{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "systemic_sclerosis"}, {"score": 0.049118287236398724, "phrase": "scleroderma_renal_crisis"}, {"score": 0.04043162424334016, "phrase": "natural_language_processing"}, {"score": 0.004635366297643894, "phrase": "emr"}, {"score": 0.004588583394515502, "phrase": "ideal_opportunity"}, {"score": 0.004383913419671869, "phrase": "vha"}, {"score": 0.004231029153290218, "phrase": "potential_ssc_patients"}, {"score": 0.004083455907659561, "phrase": "outreach_project"}, {"score": 0.003971111060168551, "phrase": "electronic_medical_data"}, {"score": 0.003911135156992, "phrase": "veterans_informatics_and_computing_infrastructure"}, {"score": 0.003765113620570665, "phrase": "retrieval_criteria"}, {"score": 0.0036801209922064817, "phrase": "high_correlation"}, {"score": 0.003569763795153386, "phrase": "single_adjudicated_set"}, {"score": 0.003401896896146971, "phrase": "ssc"}, {"score": 0.0032829931417909224, "phrase": "clinical_document"}, {"score": 0.0032088487124106936, "phrase": "active_medication"}, {"score": 0.0031845067058084583, "phrase": "prescription_list"}, {"score": 0.0028263192354046245, "phrase": "concurrent_diagnosis"}, {"score": 0.0026457367614424756, "phrase": "possible_ssc"}, {"score": 0.0023066199295447686, "phrase": "current_clinical_practice"}, {"score": 0.002271725588755076, "phrase": "potentially_dangerous_use"}, {"score": 0.002220369152257624, "phrase": "present_study"}, {"score": 0.002164703990357694, "phrase": "nlp"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Informatics", " Systemic sclerosis", " Scleroderma", " Renal crisis", " Prednisone", " Steroid", " Blood pressure", " Hypertension", " Natural language processing", " Management"], "paper_abstract": "Background: Electronic medical records (EMR) provide an ideal opportunity for the detection, diagnosis, and management of systemic sclerosis (SSc) patients within the Veterans Health Administration (VHA). The objective of this project was to use informatics to identify potential SSc patients in the VHA that were on prednisone, in order to inform an outreach project to prevent scleroderma renal crisis (SRC). Methods: The electronic medical data for this study came from Veterans Informatics and Computing Infrastructure (VINCI). For natural language processing (NLP) analysis, a set of retrieval criteria was developed for documents expected to have a high correlation to SSc. The two annotators reviewed the ratings to assemble a single adjudicated set of ratings, from which a support vector machine (SVM) based document classifier was trained. Any patient having at least one document positively classified for SSc was considered positive for SSc and the use of prednisone >= 10 mg in the clinical document was reviewed to determine whether it was an active medication on the prescription list. Results: In the VHA, there were 4272 patients that have a diagnosis of SSc determined by the presence of an ICD-9 code. From these patients, 1118 patients (21%) had the use of prednisone >= 10 mg. Of these patients, 26 had a concurrent diagnosis of hypertension, thus these patients should not be on prednisone. By the use of natural language processing (NLP) an additional 16,522 patients were identified as possible SSc, highlighting that cases of SSc in the VHA may exist that are unidentified by ICD-9. A 10-fold cross validation of the classifier resulted in a precision (positive predictive value) of 0.814, recall (sensitivity) of 0.973, and f-measure of 0.873. Conclusions: Our study demonstrated that current clinical practice in the VHA includes the potentially dangerous use of prednisone for veterans with SSc. This present study also suggests there may be many undetected cases of SSc and NLP can successfully identify these patients. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Informatics can identify systemic sclerosis (SSc) patients at risk for scleroderma renal crisis", "paper_id": "WOS:000343617000022"}