{"auto_keywords": [{"score": 0.04407953898448545, "phrase": "unknown_genes"}, {"score": 0.015719716506582538, "phrase": "disease_gene_identification"}, {"score": 0.014912190296895863, "phrase": "machine_learning_methods"}, {"score": 0.014620019112721446, "phrase": "new_disease_genes"}, {"score": 0.014006192938981274, "phrase": "positive_training"}, {"score": 0.010715592977507286, "phrase": "unlabeled_set"}, {"score": 0.00855287292739234, "phrase": "disease_genes"}, {"score": 0.004688321299229397, "phrase": "human_genome"}, {"score": 0.0046416946590535964, "phrase": "important_but_challenging_task"}, {"score": 0.004415395176043526, "phrase": "known_ones"}, {"score": 0.004386063799793622, "phrase": "existing_machine_learning_methods"}, {"score": 0.004327981760540394, "phrase": "known_disease_genes"}, {"score": 0.0041721750101390825, "phrase": "negative_training"}, {"score": 0.004116913661033223, "phrase": "non-disease_gene_set"}, {"score": 0.00378767277402891, "phrase": "noisy_negative_set"}, {"score": 0.003712640297460159, "phrase": "unknown_disease_genes"}, {"score": 0.003370344851760079, "phrase": "negative_examples"}, {"score": 0.0027680095380207756, "phrase": "weighted_support_vector_machines"}, {"score": 0.002704079288159013, "phrase": "multi-level_classifier"}, {"score": 0.002537880772794665, "phrase": "existing_methods"}, {"score": 0.0024875444192203485, "phrase": "proposed_pudi_algorithm"}, {"score": 0.002397833600728684, "phrase": "unknown_data"}, {"score": 0.002250415129116109, "phrase": "positive_and_unlabeled_data"}, {"score": 0.0022279798606617356, "phrase": "negative_data"}, {"score": 0.0021049977753042253, "phrase": "pu_learning_methods"}], "paper_keywords": [""], "paper_abstract": "Background: Identifying disease genes from human genome is an important but challenging task in biomedical research. Machine learning methods can be applied to discover new disease genes based on the known ones. Existing machine learning methods typically use the known disease genes as the positive training set P and the unknown genes as the negative training set N (non-disease gene set does not exist) to build classifiers to identify new disease genes from the unknown genes. However, such kind of classifiers is actually built from a noisy negative set N as there can be unknown disease genes in N itself. As a result, the classifiers do not perform as well as they could be. Result: Instead of treating the unknown genes as negative examples in N, we treat them as an unlabeled set U. We design a novel positive-unlabeled (PU) learning algorithm PUDI (PU learning for disease gene identification) to build a classifier using P and U. We first partition U into four sets, namely, reliable negative set RN, likely positive set LP, likely negative set LN and weak negative set WN. The weighted support vector machines are then used to build a multi-level classifier based on the four training sets and positive training set P to identify disease genes. Our experimental results demonstrate that our proposed PUDI algorithm outperformed the existing methods significantly. Conclusion: The proposed PUDI algorithm is able to identify disease genes more accurately by treating the unknown data more appropriately as unlabeled set U instead of negative set N. Given that many machine learning problems in biomedical research do involve positive and unlabeled data instead of negative data, it is possible that the machine learning methods for these problems can be further improved by adopting PU learning methods, as we have done here for disease gene identification.", "paper_title": "Positive-unlabeled learning for disease gene identification", "paper_id": "WOS:000309881200011"}