{"auto_keywords": [{"score": 0.04192295379379876, "phrase": "older_adults"}, {"score": 0.010612387000973441, "phrase": "older_adults'_perceptions"}, {"score": 0.004251621267564331, "phrase": "ict_interventions"}, {"score": 0.0040186038781533946, "phrase": "balance_training"}, {"score": 0.003623949225126944, "phrase": "systematic_searches"}, {"score": 0.003606960040766958, "phrase": "medline"}, {"score": 0.003590046656156051, "phrase": "embase"}, {"score": 0.0035732137126133208, "phrase": "cinahl"}, {"score": 0.0035564594133525164, "phrase": "psychinfo"}, {"score": 0.003539783569052493, "phrase": "compendex"}, {"score": 0.00351491577968631, "phrase": "cochrane_database"}, {"score": 0.0034984340449789745, "phrase": "key_search_terms"}, {"score": 0.0032756158688245, "phrase": "key_word"}, {"score": 0.002960664764152793, "phrase": "ephpp"}, {"score": 0.0028513433988089274, "phrase": "quality_review"}, {"score": 0.00283796434900956, "phrase": "twelve_qualitative_studies"}, {"score": 0.002688532127821979, "phrase": "intrinsic_factors"}, {"score": 0.002669628552848069, "phrase": "older_adults'_attitudes"}, {"score": 0.0025409639091476363, "phrase": "extrinsic_factors"}, {"score": 0.0024818877663889813, "phrase": "important_elements"}, {"score": 0.0024241817763927163, "phrase": "positive_messages"}, {"score": 0.002373391713337104, "phrase": "healthy_active_ageing"}, {"score": 0.0022589720760078274, "phrase": "individual_need"}, {"score": 0.0022064376000055764, "phrase": "research_and_older_peoples'_attitudes"}, {"score": 0.0021551222226685648, "phrase": "specific_recommendations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Technology", " Aged", " Fall prevention", " Behavioura"], "paper_abstract": "Background: Over recent years a number of Information and Communication Technologies( ICTs) have emerged aiming at falls prevention, falls detection and alarms for use in case off all. There are also a range of ICT interventions, which have been created or adapted to be pro-active in preventing falls, such as those which provide strength and balance training to older adults in the prevention of falls. However, there are issues related to the adoption and continued use of these technologies by older adults. Objectives: This review provides an overview of older adults' perceptions of falls technologies. Methods: We undertook systematic searches of MEDLINE, EMBASE, CINAHL and PsychINFO, COMPENDEX and the Cochrane database. Key search terms included 'older adults', 'seniors', 'preference', 'attitudes' and a wide range of technologies, they also included the key word 'fall*'. We considered all studies that included older adults aged 50 and above. Studies had to include technologies related specifically to falls prevention, detection or monitoring. The Joanna Briggs Institute (JBI) tool and the Quality Assessment Tool for Quantitative Studies by the Effective Public Health Practice Project (EPHPP) were used. Results: We identified 76 potentially relevant papers. Some 21 studies were considered for quality review. Twelve qualitative studies, three quantitative studies and 6 mixed methods studies were included. The literature related to technologies aimed at predicting, monitoring and preventing falls suggest that intrinsic factors related to older adults' attitudes around control, independence and perceived need/requirements for safety are important for their motivation to use and continue using technologies. Extrinsic factors such as usability, feedback gained and costs are important elements which support these attitudes and perceptions. Conclusion: Positive messages about the benefits of falls technologies for promoting healthy active ageing and independence are critical, as is ensuring that the technologies are simple, reliable and effective and tailored to individual need. The technologies need to be clearly described in research and older peoples' attitudes towards different sorts of technologies must be clarified if specific recommendations are to be made. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Older adults' perceptions of technologies aimed at falls prevention, detection or monitoring: A systematic review", "paper_id": "WOS:000335903400003"}