{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mesh_networks"}, {"score": 0.04409532278951084, "phrase": "total_energy"}, {"score": 0.004167218012926657, "phrase": "whole_network"}, {"score": 0.00402514392911723, "phrase": "disproportionate_burden"}, {"score": 0.003955926499405168, "phrase": "nash_equilibrium"}, {"score": 0.0036907133026806327, "phrase": "node's_utility"}, {"score": 0.0035442655396704724, "phrase": "wireless_communication_protocols"}, {"score": 0.0034832884999421374, "phrase": "peer_networks"}, {"score": 0.0031296996688485617, "phrase": "fairness_constraint"}, {"score": 0.0029622717081190667, "phrase": "big_incentive"}, {"score": 0.0029197159945990015, "phrase": "proposed_solution"}, {"score": 0.0027475387508048604, "phrase": "beccaria"}, {"score": 0.00273167822885383, "phrase": "bolelli"}, {"score": 0.002716422555160413, "phrase": "proceedings"}, {"score": 0.002600507146542738, "phrase": "oslo"}, {"score": 0.0025409639091476363, "phrase": "social_welfare"}, {"score": 0.002526293222350046, "phrase": "user_needs"}, {"score": 0.0024756080101497086, "phrase": "distributed_and_online_routing_algorithm"}, {"score": 0.002391067964886602, "phrase": "centralized_approach"}, {"score": 0.0023363141951290526, "phrase": "information_requirements"}, {"score": 0.0021731423856364003, "phrase": "extensive_set"}, {"score": 0.0021605907787994446, "phrase": "computational_experiments"}], "paper_keywords": ["Wireless network", " Least-energy routing protocol", " Fairness"], "paper_abstract": "Inspired by the One Laptop Per Child project, we consider mesh networks that connect devices that cannot recharge their batteries easily. We study how the mesh should retransmit information to make use of the energy stored in each of the nodes effectively. The solution that minimizes the total energy spent by the whole network may be very unfair to some nodes because they bear a disproportionate burden of the traffic. A Nash equilibrium achieved when nodes minimize the energy they spend does not model the situation well because, as retransmissions consume battery without increasing the node's utility, it predicts that nodes refuse to participate. Actually, there are wireless communication protocols, peer-to-peer networks and other systems that provide incentives or impose penalties to encourage nodes to be active and to participate. We explicitly aim at the solution that minimizes the total energy spent by nodes among those that satisfy a fairness constraint. Although this does not guarantee that the solution is at equilibrium, nodes do not have a big incentive to deviate from the proposed solution since they do not view the situation as extremely unfair to them. This is consistent with the recommendation of Beccaria and Bolelli (Proceedings of the 3rd IEEE Vehicle Navigation & Information Systems Conference, pp. 117-126, Oslo, 1992) who proposed to optimize social welfare keeping user needs as constraints. We propose a distributed and online routing algorithm and compare it to an offline, centralized approach. The centralized approach, besides being unrealistic in terms of information requirements, is also NP-hard to solve. For both reasons, we focus on the former and evaluate it by conducting an extensive set of computational experiments that evaluate the efficiency and fairness achieved by our algorithm.", "paper_title": "Efficient and fair routing for mesh networks", "paper_id": "WOS:000280154400016"}