{"auto_keywords": [{"score": 0.04876768085416924, "phrase": "mpi"}, {"score": 0.005276447376434831, "phrase": "openmp."}, {"score": 0.00481495049065317, "phrase": "parallel_simulation"}, {"score": 0.004748556604045108, "phrase": "three-dimensional_bursting"}, {"score": 0.0044608829094248985, "phrase": "mathematical_model"}, {"score": 0.004190563478825626, "phrase": "three-dimensional_bursting_phenomena"}, {"score": 0.003909301559145041, "phrase": "fast_and_slow_subsystems"}, {"score": 0.0038286491141253584, "phrase": "differential_equations"}, {"score": 0.003621588555525458, "phrase": "linearly-implicit_finite_difference_method"}, {"score": 0.00342568771304873, "phrase": "resulting_system"}, {"score": 0.0024533019565858073, "phrase": "biprocessors_xeon"}, {"score": 0.0022101055924375725, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "second_platform"}], "paper_keywords": [""], "paper_abstract": "This work presents a mathematical model and its parallel implementation via two parallel paradigms for the simulation of three-dimensional bursting phenomena. The mathematical model consists of four nonlinearly coupled partial differential equations and includes fast and slow subsystems. The differential equations have been discretized by means of a linearly-implicit finite difference method in equally-spaced grids. The resulting system of equations at each time level has been solved by means of an optimized Preconditioned Conjugate Gradient (PCG) method. The proposed mathematical model has been implemented via: (1) a message passing paradigm based on the standard MPI and (2) a shared address space paradigm based on SPMD OpenMP. The two implementations have been evaluated on two current parallel architectures, i.e., a cluster of biprocessors Xeon and an SGI Altix 3700 Bx2 based on Itanium. It is shown that better performance and scalability are obtained on the second platform.", "paper_title": "Parallel simulation of three-dimensional bursting with MPI and OpenMP", "paper_id": "WOS:000238389400015"}