{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "shortest_path"}, {"score": 0.0044289730051264116, "phrase": "orientable_combinatorial_surface"}, {"score": 0.004367707617503722, "phrase": "earlier_results"}, {"score": 0.004228016636379321, "phrase": "input_path"}, {"score": 0.003644001325962353, "phrase": "tight_octagonal_decomposition"}, {"score": 0.003593555152077465, "phrase": "surface-a_set"}, {"score": 0.002607362103727335, "phrase": "similar_algorithm"}, {"score": 0.0025832180231667853, "phrase": "shortest_homotopic_curves"}, {"score": 0.0024091057723923857, "phrase": "recent_algorithms"}, {"score": 0.0023867931451842087, "phrase": "colin_de_verdiere"}, {"score": 0.002364689147492501, "phrase": "lazarus"}, {"score": 0.002331909406363425, "phrase": "embedded_graphs"}, {"score": 0.0021545524633190985, "phrase": "input_curves"}, {"score": 0.0021049977753042253, "phrase": "surface_geometry"}], "paper_keywords": ["computational topology", " combinatorial surface", " embedded graph", " homotopy", " topological graph theory"], "paper_abstract": "We describe algorithms to compute the shortest path homotopic to a given path, or the shortest cycle freely homotopic to a given cycle, on an orientable combinatorial surface. Unlike earlier results, our algorithms do not require the input path or cycle to be simple. Given a surface with complexity n, genus g >= 2, and no boundary, we construct in O(gn log n) time a tight octagonal decomposition of the surface-a set of simple cycles, each as short as possible in its free homotopy class, that decompose the surface into a complex of octagons meeting four at a vertex. After the surface is preprocessed, we can compute the shortest path homotopic to a given path of complexity k in O(gnk) time, or the shortest cycle homotopic to a given cycle of complexity k in O(gnk log(nk)) time. A similar algorithm computes shortest homotopic curves on surfaces with boundary or with genus 1. We also prove that the recent algorithms of Colin de Verdiere and Lazarus for shortening embedded graphs and sets of cycles have running times polynomial in the complexity of the surface and the input curves, regardless of the surface geometry.", "paper_title": "TIGHTENING NONSIMPLE PATHS AND CYCLES ON SURFACES", "paper_id": "WOS:000285546500015"}