{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "positive_results"}, {"score": 0.03163537021432405, "phrase": "citation_differential"}, {"score": 0.004586531354697466, "phrase": "negative_results"}, {"score": 0.003964007795174772, "phrase": "citation_frequencies"}, {"score": 0.003359647377874098, "phrase": "citation_advantage"}, {"score": 0.0030778231027679464, "phrase": "space_science"}, {"score": 0.00303319936111073, "phrase": "reference_category"}, {"score": 0.0028058765785670546, "phrase": "clinical_medicine"}, {"score": 0.0027651847105654363, "phrase": "plant_and_animal_science"}, {"score": 0.0026337482179592422, "phrase": "applied_disciplines"}, {"score": 0.0024842242921857705, "phrase": "social_sciences"}, {"score": 0.002400944221804575, "phrase": "significant_predictor"}, {"score": 0.002366110899738696, "phrase": "actual_frequency"}, {"score": 0.002264607102799332, "phrase": "future_studies"}, {"score": 0.0021674482571326283, "phrase": "publication_bias"}, {"score": 0.002135995282374723, "phrase": "different_causes"}, {"score": 0.0021049977753042253, "phrase": "different_solutions"}], "paper_keywords": ["Bias", " File-drawer", " Citations", " Competition", " Publication", " Research evaluation"], "paper_abstract": "Negative results are commonly assumed to attract fewer readers and citations, which would explain why journals in most disciplines tend to publish too many positive and statistically significant findings. This study verified this assumption by counting the citation frequencies of papers that, having declared to \"test\" a hypothesis, reported a \"positive\" (full or partial) or a \"negative\" (null or negative) support. Controlling for various confounders, positive results were cited on average 32 % more often. The citation advantage, however, was unequally distributed across disciplines (classified as in the Essential Science Indicators database). Using Space Science as the reference category, the citation differential was positive and formally statistically significant only in Neuroscience & Behaviour, Molecular Biology & Genetics, Clinical Medicine, and Plant and Animal Science. Overall, the effect was significantly higher amongst applied disciplines, and in the biological compared to the physical and the social sciences. The citation differential was not a significant predictor of the actual frequency of positive results amongst the 20 broad disciplines considered. Although future studies should attempt more fine-grained assessments, these results suggest that publication bias may have different causes and require different solutions depending on the field considered.", "paper_title": "Positive results receive more citations, but only in some disciplines", "paper_id": "WOS:000313711500015"}