{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "admission_control_problem"}, {"score": 0.04886896473422157, "phrase": "online_algorithm"}, {"score": 0.009974893351057487, "phrase": "repetitions_problem"}, {"score": 0.004792592210415499, "phrase": "general_networks"}, {"score": 0.004770337253462637, "phrase": "communication_requests"}, {"score": 0.0045959609346817535, "phrase": "capacity_limitations"}, {"score": 0.004458963445434022, "phrase": "benefit_problem"}, {"score": 0.004326031862126335, "phrase": "maximum_number"}, {"score": 0.004236321075918639, "phrase": "objective_function"}, {"score": 0.004206831063328322, "phrase": "even_algorithms"}, {"score": 0.004187284711626886, "phrase": "optimal_competitive_ratios"}, {"score": 0.003868500946401611, "phrase": "rare_events"}, {"score": 0.0037970771782696974, "phrase": "preemptive_online_algorithms"}, {"score": 0.0037182945894106935, "phrase": "rejected_requests"}, {"score": 0.0035407444171266624, "phrase": "weighted_case"}, {"score": 0.003411160942525321, "phrase": "maximum_edge_capacity"}, {"score": 0.003379510439129211, "phrase": "unweighted_case"}, {"score": 0.003301658794793088, "phrase": "open_question"}, {"score": 0.003286304298109081, "phrase": "blum_et_al"}, {"score": 0.0031366202239057404, "phrase": "trivial_lower_bounds"}, {"score": 0.002952146666681891, "phrase": "n_elements"}, {"score": 0.002682980395408199, "phrase": "cover_problem"}, {"score": 0.002621132073063456, "phrase": "different_subsets"}, {"score": 0.0024496978447849835, "phrase": "recent_lower_bound"}, {"score": 0.002410023516674212, "phrase": "korman"}, {"score": 0.0023325818889343144, "phrase": "competitive_ratio"}, {"score": 0.00231631341869674, "phrase": "randomized_polynomial_time_algorithm"}, {"score": 0.002294803206765997, "phrase": "bpp"}, {"score": 0.0022792573983585643, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "optimal_solution"}], "paper_keywords": ["Admission control", " competitive", " online", " set cover"], "paper_abstract": "We study the admission control problem in general networks. Communication requests arrive over time, and the online algorithm accepts or rejects each request while maintaining the capacity limitations of the network. The admission control problem has been usually analyzed as a benefit problem, where the goal is to devise an online algorithm that accepts the maximum number of requests possible. The problem with this objective function is that even algorithms with optimal competitive ratios may reject almost all of the requests, when it would have been possible to reject only a few. This could be inappropriate for settings in which rejections are intended to be rare events. In this article, we consider preemptive online algorithms whose goal is to minimize the number of rejected requests. Each request arrives together with the path it should be routed on. We show an O(log(2)(mc))-competitive randomized algorithm for the weighted case, where m is the number of edges in the graph and c is the maximum edge capacity. For the unweighted case, we give an O(logm log c)-competitive randomized algorithm. This settles an open question of Blum et al. [2001]. We note that allowing preemption and handling requests with given paths are essential for avoiding trivial lower bounds. The admission control problem is a generalization of the online set cover with repetitions problem, whose input is a family of m subsets of a ground set of n elements. Elements of the ground set are given to the online algorithm one by one, possibly requesting each element a multiple number of times. (If each element arrives at most once, this corresponds to the online set cover problem.) The algorithm must cover each element by different subsets, according to the number of times it has been requested. We give an O(log m log n)-competitive randomized algorithm for the online set cover with repetitions problem. This matches a recent lower bound of Omega(logm log n) given by Korman [2005] (based on Feige [1998]) for the competitive ratio of any randomized polynomial time algorithm, under the BPP not equal NP assumption. Given any constant epsilon > 0, an O(logm log n)-competitive deterministic bi-criteria algorithm is shown that covers each element by at least (1-epsilon)k sets, where k is the number of times the element is covered by the optimal solution.", "paper_title": "Admission Control to Minimize Rejections and Online Set Cover with Repetitions", "paper_id": "WOS:000273223500011"}