{"auto_keywords": [{"score": 0.04860706942858534, "phrase": "water_stress"}, {"score": 0.004734680382498411, "phrase": "crop_selection"}, {"score": 0.004534334971193607, "phrase": "low_precipitation"}, {"score": 0.004469446551343178, "phrase": "groundwater-supplied_irrigation"}, {"score": 0.004405482605147622, "phrase": "regional_water_management_agencies"}, {"score": 0.004099079363559579, "phrase": "real-time_decisions"}, {"score": 0.003925522982179656, "phrase": "limited_water_resources"}, {"score": 0.003906696552076012, "phrase": "evolutionary_algorithms"}, {"score": 0.0037233091202256894, "phrase": "competing_objectives"}, {"score": 0.0035570425396761122, "phrase": "simulation_tools"}, {"score": 0.0035399770257915466, "phrase": "optimization_algorithms"}, {"score": 0.0034725269588525534, "phrase": "source_code"}, {"score": 0.0032308006242867224, "phrase": "different_software_components"}, {"score": 0.003131332224180461, "phrase": "multi-objective_genetic_algorithm"}, {"score": 0.003101345168761592, "phrase": "dakota_optimization_suite"}, {"score": 0.003056900519741143, "phrase": "sandia_national_laboratory"}, {"score": 0.002977061391551631, "phrase": "geological_survey"}, {"score": 0.0028715299874549245, "phrase": "agriculture-dciminated_regions"}, {"score": 0.002749804945326094, "phrase": "case_study"}, {"score": 0.002730023736069673, "phrase": "planting_decisions"}, {"score": 0.002677964894127131, "phrase": "numerical_results"}, {"score": 0.0025830084481785905, "phrase": "demand_targets"}, {"score": 0.002473483584015147, "phrase": "algorithmic_parameter_choices"}, {"score": 0.002432152706473349, "phrase": "associated_evolutionary_algorithm"}, {"score": 0.0024030531369997124, "phrase": "expert_guidance"}, {"score": 0.002312248338073107, "phrase": "decision-making_tools"}, {"score": 0.0022302306304023602, "phrase": "chosen_evolutionary_algorithm"}, {"score": 0.002203541627595726, "phrase": "feasible_planting_scenarios"}, {"score": 0.0021771713131746636, "phrase": "policy_makers"}, {"score": 0.0021356322417874106, "phrase": "realistic_simulation_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Simulation-based optimization", " Multi-objective", " Farm management"], "paper_abstract": "Farmers in regions experiencing water stress or drought conditions can struggle to balance their crop portfolios. Periods of low precipitation often lead to increased, unsustainable reliance on groundwater-supplied irrigation. As a result, regional water management agencies place limits on the amount of water which can be obtained from groundwater, requiring farmers to reduce acreage for more water-intensive crops or remove them from the portfolio entirely. Real-time decisions must be made by the farmer to ensure viability of their farming operation and reduce the impacts associated with limited water resources. Evolutionary algorithms, coupled with accurate, flexible, realistic simulation tools, are ideal mechanisms to allow farmers to assess scenarios with regard to multiple, competing objectives. In order to effective, however, one must be able to select among a variety of simulation tools and optimization algorithms. Many simulation tools allow no access to the source code, and many optimization algorithms are now packaged as part of a suite of tools available to a user. In this work, we describe a framework for integrating these different software components using only their associated input and output streams. We analyze our strategy by coupling a multi-objective genetic algorithm available in the DAKOTA optimization suite (developed and distributed by Sandia National Laboratory) with the MODFLOW-FMP2 simulation tool (developed and distributed by the United States Geological Survey). MODFLOW-FMP2 has been used extensively to model hydrological and farming processes in agriculture-dciminated regions, allowing us to represent both farming and conservation interests. We evaluate our integration by considering a case study related to planting decisions facing farmers experiencing water stress. We present numerical results for three competing objectives associated with stakeholders in a given region (i.e., profitability, meeting demand targets, and water conservation). The data obtained from the optimization are robust with respect to algorithmic parameter choices, validating the ability of the associated evolutionary algorithm to perform well without expert guidance. This is integral to our approach, as a motivation for this work is providing decision-making tools. In addition, the results from this study demonstrate that output from the chosen evolutionary algorithm provides a suite of feasible planting scenarios, giving farmers and policy makers the ability to compromise solutions based on realistic simulation data. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A decision making framework with MODFLOW-FMP2 via optimization: Determining trade-offs in crop selection", "paper_id": "WOS:000356548800024"}