{"auto_keywords": [{"score": 0.0368372167659939, "phrase": "large_moving_objects"}, {"score": 0.020572412671567585, "phrase": "mobile_platforms"}, {"score": 0.010522904823767824, "phrase": "delta_optical_flow"}, {"score": 0.007623793682351844, "phrase": "video_scenes"}, {"score": 0.00481495049065317, "phrase": "feature_point_selection"}, {"score": 0.004575053987970206, "phrase": "novel_video_stabilisation_algorithm"}, {"score": 0.0041835168653521, "phrase": "unmanned_airborne_vehicles"}, {"score": 0.003941215575554871, "phrase": "undesired_jitter"}, {"score": 0.003891140864902669, "phrase": "accurate_estimation"}, {"score": 0.003858110309630846, "phrase": "global_motion"}, {"score": 0.0036813725040313002, "phrase": "global_motions"}, {"score": 0.0035883942463601688, "phrase": "increased_estimation_errors"}, {"score": 0.003394891095032025, "phrase": "estimation_errors"}, {"score": 0.002924074850256874, "phrase": "theoretical_proof"}, {"score": 0.002742787059497186, "phrase": "video_stabilisation"}, {"score": 0.002561752783323717, "phrase": "sorted_arrays"}, {"score": 0.002539978170928796, "phrase": "local_motions"}, {"score": 0.0024863459251358217, "phrase": "feature_points"}, {"score": 0.0024028742248152425, "phrase": "proposed_algorithm"}, {"score": 0.002362192695471035, "phrase": "six_video_sequences"}], "paper_keywords": [""], "paper_abstract": "In this study, the authors propose a novel video stabilisation algorithm for mobile platforms with moving objects in the scene. The quality of videos obtained from mobile platforms, such as unmanned airborne vehicles, suffers from jitter caused by several factors. In order to remove this undesired jitter, the accurate estimation of global motion is essential. However, it is difficult to estimate global motions accurately from mobile platforms because of increased estimation errors and noises. Additionally, large moving objects in the video scenes contribute to the estimation errors. Currently, only very few motion estimation algorithms have been developed for video scenes collected from mobile platforms, and this study shows that these algorithms fail when there are large moving objects in the scene. In this study, a theoretical proof is provided which demonstrates that the use of delta optical flow can improve the robustness of video stabilisation in the presence of large moving objects in the scene. The authors also propose to use sorted arrays of local motions and the selection of feature points to separate outliers from inliers. The proposed algorithm is tested over six video sequences, collected from one fixed platform, four mobile platforms and one synthetic video, of which three contain large moving objects. Experiments show that our proposed algorithm performs well to all these video sequences.", "paper_title": "Robust video stabilisation algorithm using feature point selection and delta optical flow", "paper_id": "WOS:000273043600002"}