{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cardiac_electrical_propagation"}, {"score": 0.00446240364863009, "phrase": "adaptive_high-order_finite_element_method"}, {"score": 0.003971111060168551, "phrase": "residual-based_error_indicator"}, {"score": 0.003569763795153386, "phrase": "two-dimensional_domains"}, {"score": 0.003462704420080129, "phrase": "significant_improvements"}, {"score": 0.003341839487905525, "phrase": "standard_linear"}, {"score": 0.0025275050635202878, "phrase": "parallel_h-adaptive_methods"}, {"score": 0.0021923400552366756, "phrase": "moderate_numbers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Adaptive finite element method", " p-version", " Monodomain simulation", " Computational cardiology", " Numerical efficiency"], "paper_abstract": "We present a computationally efficient method of simulating cardiac electrical propagation using an adaptive high-order finite element method to automatically concentrate computational effort where it is most needed in space on each time-step. We drive the adaptivity using a residual-based error indicator, and demonstrate using norms of the error that the indicator allows us to control it successfully. Our results using two-dimensional domains of varying complexity demonstrate that significant improvements in efficiency are possible over the standard linear FEM in our single-thread studies, and our preliminary three-dimensional results suggest that improvements are also possible in 3D. We do not work in parallel or investigate the challenges for adaptivity such as dynamic load-balancing which are associated with parallelisation. However, based upon recent work demonstrating that in some circumstances and with moderate processor counts parallel h-adaptive methods are efficient, and upon the claim that p-adaptivity will outperform h-adaptivity, we argue that p-adaptivity should be investigated for efficiency in parallel for simulation on moderate numbers of processors. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Efficient simulation of cardiac electrical propagation using high-order finite elements II: Adaptive p-version", "paper_id": "WOS:000323610500023"}