{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cyp_chemical_interactions"}, {"score": 0.004761132425263795, "phrase": "biomedical_literature_using_natural_language_processing_methods"}, {"score": 0.004500891637057374, "phrase": "cyp_protein"}, {"score": 0.004450568197899267, "phrase": "chemical_interactions"}, {"score": 0.004278807087784626, "phrase": "natural_language_processing"}, {"score": 0.00423099515363822, "phrase": "nlp"}, {"score": 0.004160177106153782, "phrase": "text_mining_methods"}, {"score": 0.00397714507836836, "phrase": "maximum_entropy_based_learning_method"}, {"score": 0.0034944094552943, "phrase": "based_models"}, {"score": 0.003104849179057156, "phrase": "entity_recognition"}, {"score": 0.0026370661343466354, "phrase": "dependency_parsing"}, {"score": 0.0025928815987676535, "phrase": "ner_components"}, {"score": 0.0022145052062614514, "phrase": "interaction_extraction_component"}, {"score": 0.0021049977753042253, "phrase": "overall_system"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a system that automatically extracts CYP protein and chemical interactions from journal article abstracts, using natural language processing (NLP) and text mining methods. In our system, we employ a maximum entropy based learning method, using results from syntactic, semantic, and lexical analysis of texts. We first present our system architecture and then discuss the data set for training our machine learning based models and the methods in building components in our system, such as part of speech (POS) tagging, Named Entity Recognition (NER), dependency parsing, and relation extraction. An evaluation of the system is conducted at the end, yielding very promising results: The POS, dependency parsing, and NER components in our system have achieved a very high level of accuracy as measured by precision, ranging from 85.9% to 98.5%, and the precision and the recall of the interaction extraction component are 76.0% and 82.6%, and for the overall system are 68.4% and 72.2%, respectively.", "paper_title": "Extraction of CYP Chemical Interactions from Biomedical Literature Using Natural Language Processing Methods", "paper_id": "WOS:000263658200010"}