{"auto_keywords": [{"score": 0.05007840182816709, "phrase": "object_recognition"}, {"score": 0.04915735408214162, "phrase": "novel_patch_selection_method"}, {"score": 0.043960221020330516, "phrase": "hmax"}, {"score": 0.004586531354697466, "phrase": "biologically_inspired_hierarchical_model"}, {"score": 0.004476399615305783, "phrase": "hierarchical_model"}, {"score": 0.004284755353695709, "phrase": "considerable_attention"}, {"score": 0.0038127186374325582, "phrase": "rotational_deformation"}, {"score": 0.003631671435460452, "phrase": "main_reason"}, {"score": 0.003579046565851265, "phrase": "numerous_randomly_chosen_patches"}, {"score": 0.002861062731782219, "phrase": "conventional_random-patch-selection-based_hmax_model"}, {"score": 0.0027383842769094354, "phrase": "feature_extraction"}, {"score": 0.0026986685585382347, "phrase": "skps-based_hmax_model"}, {"score": 0.0025578967205807843, "phrase": "promising_distinctiveness"}, {"score": 0.0022101055924375725, "phrase": "conventional_hmax"}, {"score": 0.0021464286727045623, "phrase": "existing_architectures"}, {"score": 0.0021049977753042253, "phrase": "similar_framework"}], "paper_keywords": [""], "paper_abstract": "The biologically inspired hierarchical model for object recognition, Hierarchical Model and X (HMAX), has attracted considerable attention in recent years. HMAX is robust (i.e. shift- and scale-invariant), but its use of random-patch-selection makes it sensitive to rotational deformation, which heavily limits its performance in object recognition. The main reason is that numerous randomly chosen patches are often orientation selective, thereby leading to mismatch. To address this issue, the authors propose a novel patch selection method for HMAX called saliency and keypoint-based patch selection (SKPS), which is based on a saliency (attention) mechanism and multi-scale keypoints. In contrast to the conventional random-patch-selection-based HMAX model that involves huge amounts of redundant information in feature extraction, the SKPS-based HMAX model (S-HMAX) extracts a very few features while offering promising distinctiveness. To show the effectiveness of S-HMAX, the authors apply it to object categorisation and conduct experiments on the CalTech101, TU Darmstadt, ImageNet and GRAZ01 databases. The experimental results demonstrate that S-HMAX outperforms conventional HMAX and is very comparable with existing architectures that have a similar framework.", "paper_title": "Enhanced hierarchical model of object recognition based on a novel patch selection method in salient regions", "paper_id": "WOS:000361362400006"}