{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "peer-to-peer_-based_video"}, {"score": 0.0043477114072437316, "phrase": "scalable_vod"}, {"score": 0.004161553532799662, "phrase": "ip_networks"}, {"score": 0.003983334573043943, "phrase": "underlying_multisource_streaming_architecture"}, {"score": 0.0036671822784770463, "phrase": "core_building_block"}, {"score": 0.003614044704141927, "phrase": "distributed_vod_services_provisioning_system"}, {"score": 0.003527181559366122, "phrase": "new_reliability_challenges"}, {"score": 0.0034760655218366, "phrase": "streaming_failure_probability"}, {"score": 0.003278878522165815, "phrase": "major_contribution"}, {"score": 0.0029747028229638625, "phrase": "multisource_streaming"}, {"score": 0.0026466064623118105, "phrase": "advanced_adaptation_policies"}, {"score": 0.002570385604065795, "phrase": "different_conditions"}, {"score": 0.0023431692392929353, "phrase": "different_reliability_mechanisms"}, {"score": 0.002320449502337321, "phrase": "adaptation_policies"}, {"score": 0.002286781334850213, "phrase": "real_prototype_system"}, {"score": 0.0022101055924375725, "phrase": "problems_diagnosis"}, {"score": 0.002135995282374723, "phrase": "reliability_mechanisms"}], "paper_keywords": ["Multimedia communication", " Multisource streaming", " Error control", " VOD services provisioning", " QoS", " P2P communication"], "paper_abstract": "In this article, we present the design, implementation, and analysis of a scalable VOD (Video On Demand) distribution architecture for IP networks. The focus of our work is on the underlying multisource streaming architecture upon which the P2P (Peer-to-Peer) -based VOD services provisioning system relies. While multipoint-to-point multisource streaming is the core building block for a distributed VOD services provisioning system, it also introduces new reliability challenges as the streaming failure probability increases with the number of sources in a session. A major contribution of our work is the design of a suite of distinct yet complementary reliability/failover mechanisms that can be leveraged to improve the dependability of multisource streaming, and the viability of P2P-based VOD systems in general. Our work shows that the reliability/failover mechanisms can be arranged, combined, and alternated in advanced adaptation policies in order to deal with different conditions exhibited by the network. Another contribution of our work consists of implementing and assessing the performance of the different reliability mechanisms and adaptation policies in a real prototype system. We evaluate both the accuracy of streaming problems diagnosis, and the efficiency of the reliability mechanisms, in two adaptation strategies: one responsive to loss variation, and the other responsive to delay variation.", "paper_title": "A dependable multisource streaming system for peer-to-peer -based video on demand services provisioning", "paper_id": "WOS:000303869800010"}