{"auto_keywords": [{"score": 0.047205746903605746, "phrase": "query_expansion"}, {"score": 0.009877001208804912, "phrase": "url_search_options"}, {"score": 0.00890494568833879, "phrase": "exact_title"}, {"score": 0.00481495049065317, "phrase": "natural_language_query_expansion"}, {"score": 0.004691273968935458, "phrase": "non-topical_terms"}, {"score": 0.0045559136361908795, "phrase": "new_approach"}, {"score": 0.004497008230182996, "phrase": "search_engines"}, {"score": 0.004424441580112395, "phrase": "general_non-topical_terms"}, {"score": 0.004078729256705429, "phrase": "topical_terms"}, {"score": 0.003973887756331297, "phrase": "retrieval_results"}, {"score": 0.0037477896719754333, "phrase": "google"}, {"score": 0.0030425153622841822, "phrase": "'exact_title"}, {"score": 0.002906836691319759, "phrase": "health_and_the_social_sciences_vis-a-vis_keyword_and_'exact_phrase'_search_results"}, {"score": 0.0027323009127771525, "phrase": "exact_phrase"}, {"score": 0.002688133833564332, "phrase": "url_search_result_frequencies_to_keyword_search_result_frequencies"}, {"score": 0.0024456516553345966, "phrase": "initial_query"}, {"score": 0.002413964586947992, "phrase": "search_results"}, {"score": 0.0022468671200629024, "phrase": "knowledge-based_lists"}, {"score": 0.0021676977432828373, "phrase": "specialized_search_engines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["query expansion", " natural language", " non-topical terms", " semi-topical terms", " search engines"], "paper_abstract": "This paper presents a new approach to query expansion in search engines through the use of general non-topical terms (NTTs) and domain-specific semi-topical terms (STTs). NTTs and STTs can be used in conjunction with topical terms (TTs) to improve precision in retrieval results. In Phase 1, 20 topical queries in two domains (Health and the Social Sciences) were carried out in Google and from the results of the queries, 800 pages were textually analysed. Of 1442 NTTs and STTs identified, 15% were shared between the two domains; 62% were NTTs and 38% were STTs; and approximately 64% occurred before while 36% occurred after their respective topical terms (TTs). Findings of Phase 11 showed that query expansion through NTTs (or STTs) particularly in the 'exact title' and URL search options resulted in more precise and manageable results. Statistically significant differences were found between Health and the Social Sciences vis-a-vis keyword and 'exact phrase' search results; however there were no significant differences in exact title and URL search results. The ratio of exact phrase, exact title, and URL search result frequencies to keyword search result frequencies also showed statistically significant differences between the two domains. Our findings suggest that web searching could be greatly enhanced combining NTTs (and STTs) with TTs in an initial query. Additionally, search results would improve if queries are restricted to the exact title or URL search options. Finally, we suggest the development and implementation of knowledge-based lists of NTTs (and STTs) by both general and specialized search engines to aid query expansion. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An alternative approach to natural language query expansion in search engines: Text analysis of non-topical terms in Web documents", "paper_id": "WOS:000257276800007"}