{"auto_keywords": [{"score": 0.04244936431166401, "phrase": "hidden_representations"}, {"score": 0.010528096841203892, "phrase": "cross-modal_retrieval"}, {"score": 0.00481495049065317, "phrase": "correspondence_autoencoders"}, {"score": 0.004515655183335171, "phrase": "text_query"}, {"score": 0.004338076511024884, "phrase": "different_autoencoders"}, {"score": 0.003923965929636472, "phrase": "novel_optimal_objective"}, {"score": 0.003845994935767022, "phrase": "linear_combination"}, {"score": 0.0037999551521987426, "phrase": "representation_learning_errors"}, {"score": 0.0037095162593960727, "phrase": "correlation_learning_error"}, {"score": 0.00328849874768242, "phrase": "different_modalities"}, {"score": 0.00321019328631004, "phrase": "learning_error"}, {"score": 0.0029623549392492777, "phrase": "representation_learning"}, {"score": 0.0029386456078004863, "phrase": "correlation_learning"}, {"score": 0.002880196765572443, "phrase": "specific_parameter"}, {"score": 0.0023558375480288297, "phrase": "single_modality"}, {"score": 0.002327594516681507, "phrase": "proposed_models"}, {"score": 0.0021049977753042253, "phrase": "cross-modal_retrieval_tasks"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Cross-modal", " retrieval", " image and text", " deep learning", " autoencoder"], "paper_abstract": "This article considers the problem of cross-modal retrieval, such as using a text query to search for images and vice-versa. Based on different autoencoders, several novel models are proposed here for solving this problem. These models are constructed by correlating hidden representations of a pair of autoencoders. A novel optimal objective, which minimizes a linear combination of the representation learning errors for each modality and the correlation learning error between hidden representations of two modalities, is used to train the model as a whole. Minimizing the correlation learning error forces the model to learn hidden representations with only common information in different modalities, while minimizing the representation learning error makes hidden representations good enough to reconstruct inputs of each modality. To balance the two kind of errors induced by representation learning and correlation learning, we set a specific parameter in our models. Furthermore, according to the modalities the models attempt to reconstruct they are divided into two groups. One group including three models is named multimodal reconstruction correspondence autoencoder since it reconstructs both modalities. The other group including two models is named unimodal reconstruction correspondence autoencoder since it reconstructs a single modality. The proposed models are evaluated on three publicly available datasets. And our experiments demonstrate that our proposed correspondence autoencoders perform significantly better than three canonical correlation analysis based models and two popular multimodal deep models on cross-modal retrieval tasks.", "paper_title": "Correspondence Autoencoders for Cross-Modal Retrieval", "paper_id": "WOS:000363654100016"}