{"auto_keywords": [{"score": 0.049440303515783074, "phrase": "strengthen_selection_probability"}, {"score": 0.015719716506582538, "phrase": "opinion_formation"}, {"score": 0.012370903052728604, "phrase": "majority_rule"}, {"score": 0.012207066456518818, "phrase": "linear_selection"}, {"score": 0.004655924035639928, "phrase": "local_majority_rule"}, {"score": 0.004471978831302331, "phrase": "paradigmatic_model"}, {"score": 0.003935892934907777, "phrase": "opinion_update_rule"}, {"score": 0.003510754567808717, "phrase": "adjustable_parameter_beta"}, {"score": 0.0030688220103201836, "phrase": "different_values"}, {"score": 0.002907992115184249, "phrase": "different_kinds"}, {"score": 0.002811770047652563, "phrase": "different_regular_networks"}, {"score": 0.0027741761880779535, "phrase": "complex_networks"}, {"score": 0.002628747284714371, "phrase": "optimal_value"}], "paper_keywords": ["Opinion formation", " strengthen selection probability", " majority rule"], "paper_abstract": "The local majority rule is extensively accepted as a paradigmatic model to reflect the formation of opinion. In this paper, we study a model of opinion formation where opinion update rule is not based on the majority rule or linear selection probability but on a strengthen selection probability controlled by an adjustable parameter beta. In particular, our proposed probability function can proximately fit the two extreme cases-linear probability function and majority rule or in between the two cases under different values of beta. By studying such model on different kinds of networks, including different regular networks and complex networks, we find that there exists an optimal value of beta giving the most efficient convergence to consensus regardless of the topology of networks. This work reveals that, compared with the majority rule and linear selection probability, the strengthen selection probability might be a more proper model in understanding the formation of opinions in society.", "paper_title": "Dynamics of opinion formation with strengthen selection probability", "paper_id": "WOS:000342160700006"}