{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "home_telemonitoring"}, {"score": 0.015616881986156449, "phrase": "chronic_diseases"}, {"score": 0.004611669085594069, "phrase": "patient_management_approach"}, {"score": 0.0044169318855693356, "phrase": "systematic_review"}, {"score": 0.004216362268148017, "phrase": "chronic_illnesses"}, {"score": 0.004188459638572375, "phrase": "pulmonary_conditions"}, {"score": 0.004092240621596351, "phrase": "cardiovascular_diseases"}, {"score": 0.004024863549087511, "phrase": "comprehensive_literature_search"}, {"score": 0.003971761552420796, "phrase": "medline"}, {"score": 0.003906357144047631, "phrase": "relevant_articles"}, {"score": 0.0035595545121149827, "phrase": "europe"}, {"score": 0.0034431390653713173, "phrase": "telemonitoring_effects"}, {"score": 0.0034203358208034973, "phrase": "patients'_conditions"}, {"score": 0.0032975819773787985, "phrase": "blood_pressure"}, {"score": 0.003004572722189157, "phrase": "socioeconomic_status"}, {"score": 0.002925728709297618, "phrase": "telemonitoring_programs"}, {"score": 0.0027741761880779535, "phrase": "hospital_admissions"}, {"score": 0.0027557911038816256, "phrase": "average_hospital_length"}, {"score": 0.0026834578825190407, "phrase": "pulmonary_and_cardiac_studies"}, {"score": 0.0026130182682465096, "phrase": "economic_viability"}, {"score": 0.0024858771358801392, "phrase": "cost-minimization_analyses"}, {"score": 0.0023806911724834024, "phrase": "promising_patient_management_approach"}, {"score": 0.002357055030818803, "phrase": "accurate_and_reliable_data"}, {"score": 0.0022423402528961144, "phrase": "future_studies"}, {"score": 0.0021762030438262046, "phrase": "cost_effectiveness"}, {"score": 0.0021049977753042253, "phrase": "health_care_providers"}], "paper_keywords": [""], "paper_abstract": "Objective: Home telemonitoring represents a patient management approach combining various information technologies for monitoring patients at distance. This study presents a systematic review of the nature and magnitude of outcomes associated with telemonitoring of four types of chronic illnesses: pulmonary conditions, diabetes, hypertension, and cardiovascular diseases. Methods: A comprehensive literature search was conducted on Medline and the Cochrane Library to identify relevant articles published between 1990 and 2006. A total of 65 empirical studies were obtained (18 pulmonary conditions, 17 diabetes, 16 cardiac diseases, 14 hypertension) mostly conducted in the United States and Europe. Results: The magnitude and significance of the telemonitoring effects on patients' conditions (e.g., early detection of symptoms, decrease in blood pressure, adequate medication, reduced mortality) still remain inconclusive for all four chronic illnesses. However, the results of this study suggest that regardless of their nationality, socioeconomic status, or age, patients comply with telemonitoring programs and the use of technologies. Importantly, the telemonitoring effects on clinical effectiveness outcomes (e.g., decrease in the emergency visits, hospital admissions, average hospital length of stay) are more consistent in pulmonary and cardiac studies than diabetes and hypertension. Lastly, economic viability of telemonitoring was observed in very few studies and, in most cases, no in-depth cost-minimization analyses were performed. Conclusion: Home telemonitoring of chronic diseases seems to be a promising patient management approach that produces accurate and reliable data, empowers patients, influences their attitudes and behaviors, and potentially improves their medical conditions. Future studies need to build evidence related to its clinical effects, cost effectiveness, impacts on services utilization, and acceptance by health care providers.", "paper_title": "Systematic review of home telemonitoring for chronic diseases: The evidence base", "paper_id": "WOS:000246670800003"}