{"auto_keywords": [{"score": 0.02767161250889291, "phrase": "new_method"}, {"score": 0.02115072008227606, "phrase": "interpolating_surface"}, {"score": 0.00481495049065317, "phrase": "based_interpolation"}, {"score": 0.004777917315737992, "phrase": "catmull-clark_subdivision_surfaces"}, {"score": 0.004650519511749445, "phrase": "catmull-clark_subdivision_surface"}, {"score": 0.004439941010250576, "phrase": "arbitrary_topology"}, {"score": 0.0038634933357842302, "phrase": "construction_process"}, {"score": 0.0035076666315744525, "phrase": "limit_surface"}, {"score": 0.0027813397260607487, "phrase": "interpolating_surface's_control"}, {"score": 0.0027386335451725762, "phrase": "new_approach"}, {"score": 0.002665465323614577, "phrase": "resulting_global_linear_system"}, {"score": 0.0026043035241045394, "phrase": "approximate_solution"}, {"score": 0.0025643086619242814, "phrase": "fast_iterative_linear_system_solver"}, {"score": 0.002410363090950055, "phrase": "important_improvement"}, {"score": 0.002391779843744166, "phrase": "previous_methods"}, {"score": 0.002283243905993669, "phrase": "large_number"}, {"score": 0.0021461354559957234, "phrase": "similarity_based_interpolation"}], "paper_keywords": ["subdivision", " subdivision surfaces", " Catmull-Clark subdivision surfaces", " interpolation"], "paper_abstract": "A new method for constructing a Catmull-Clark subdivision surface (CCSS) that interpolates the vertices of a given mesh with arbitrary topology is presented. The new method handles both open and closed meshes. Normals or derivatives specified at any vertices of the mesh (which can actually be anywhere) can also be interpolated. The construction process is based on the assumption that, in addition to interpolating the vertices of the given mesh, the interpolating surface is also similar to the limit surface of the given mesh. Therefore, construction of the interpolating surface can use information from the given mesh as well as its limit surface. This approach, called similarity based interpolation, gives us more control on the smoothness of the interpolating surface and, consequently, avoids the need of shape fairing in the construction of the interpolating surface. The computation of the interpolating surface's control mesh follows a new approach, which does not require the resulting global linear system to be solvable. An approximate solution provided by any fast iterative linear system solver is sufficient. Nevertheless, interpolation of the given mesh is guaranteed. This is an important improvement over previous methods because with these features, the new method can handle meshes with large number of vertices efficiently. Although the new method is presented for CCSSs, the concept of similarity based interpolation can be used for other subdivision surfaces as well.", "paper_title": "Similarity based interpolation using Catmull-Clark subdivision surfaces", "paper_id": "WOS:000240381000029"}