{"auto_keywords": [{"score": 0.042805078003764936, "phrase": "structured_documentation"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_documentation"}, {"score": 0.004745362527093198, "phrase": "primary_care"}, {"score": 0.004710944813540894, "phrase": "objective_physicians"}, {"score": 0.004609175313390942, "phrase": "electronic_health_records"}, {"score": 0.004476878957065829, "phrase": "greater_attention"}, {"score": 0.00444439983637316, "phrase": "coded_fields"}, {"score": 0.004412155302768363, "phrase": "clinical_decision_support"}, {"score": 0.004332559296185432, "phrase": "higher_quality_care"}, {"score": 0.004042919099733537, "phrase": "free_text"}, {"score": 0.003955523458325766, "phrase": "retrospective_analysis"}, {"score": 0.003870009704443373, "phrase": "coronary_artery_disease"}, {"score": 0.0037725685596495355, "phrase": "main_outcome_measures"}, {"score": 0.0031787077057214086, "phrase": "free_text_notes"}, {"score": 0.003144134096095214, "phrase": "multivariable_modeling"}, {"score": 0.002707541142254756, "phrase": "structured_documenters"}, {"score": 0.0024987660207458555, "phrase": "free_text_documenters"}, {"score": 0.0023570895666021664, "phrase": "higher_quality"}, {"score": 0.002280948283235427, "phrase": "conclusions_ehr-assessed_quality"}, {"score": 0.002159460831267798, "phrase": "worse_quality"}, {"score": 0.0021049977753042253, "phrase": "structured_ehr_documentation"}], "paper_keywords": [""], "paper_abstract": "Objective Physicians who more intensively interact with electronic health records (EHRs) through their documentation style may pay greater attention to coded fields and clinical decision support and thus may deliver higher quality care. We measured the quality of care of physicians who used three predominating EH documentation styles: dictation, structured documentation, and free text. Methods We conducted a retrospective analysis of visits by patients with coronary artery disease and diabetes to the Partners Primary Care Practice Based Research Network. The main outcome measures were 15 EHR-based coronary artery disease and diabetes measures assessed 30 days after primary care visits. Results During the 9-month study period, 7000 coronary artery disease and diabetes patients made 18 569 visits to 234 primary care physicians of whom 20 (9%) predominantly dictated their notes, 68 (29%) predominantly used structured documentation, and 146 (62%) predominantly typed free text notes. In multivariable modeling adjusted for clustering by patient and physician, quality of care appeared significantly worse for dictators than for physicians using the other two documentation styles on three of 15 measures (antiplatelet medication, tobacco use documentation, and diabetic eye exam); better for structured documenters for three measures (blood pressure documentation, body mass index documentation, and diabetic foot exam); and better for free text documenters on one measure (influenza vaccination). There was no measure for which dictators had higher quality of care than physicians using the other two documentation styles. Conclusions EHR-assessed quality is necessarily documentation-dependent, but physicians who dictated their notes appeared to have worse quality of care than physicians who used structured EHR documentation.", "paper_title": "Method of electronic health record documentation and quality of primary care", "paper_id": "WOS:000310408500015"}