{"auto_keywords": [{"score": 0.04703179823046393, "phrase": "ad_hoc_networks"}, {"score": 0.00481495049065317, "phrase": "bandwidth_allocation_algorithms"}, {"score": 0.004762550320451225, "phrase": "wireless_personal_area_networks"}, {"score": 0.004685012337701536, "phrase": "major_issue"}, {"score": 0.00441130431691048, "phrase": "common_spectrum"}, {"score": 0.004245476558619167, "phrase": "bandwidth_allocation"}, {"score": 0.0038470175104007524, "phrase": "single_neighbor"}, {"score": 0.0035826234811610316, "phrase": "bluetooth_personal_area_networks"}, {"score": 0.003429001377800258, "phrase": "capacity_assignment_heuristics"}, {"score": 0.0027539714188091866, "phrase": "general_convex_objective_functions"}, {"score": 0.002260591903283384, "phrase": "different_manner"}, {"score": 0.0021049977753042253, "phrase": "numerical_results"}], "paper_keywords": ["bandwidth allocation", " capacity assignment", " scheduling", " approximation algorithms", " matching", " Bluetooth", " scatternet", " IEEE 802.15.3"], "paper_abstract": "A major issue in the design and operation of ad hoc networks is sharing the common spectrum among links in the same geographic area. Bandwidth allocation, to optimize the performance of networks in which each station can converse with at most a single neighbor at a time, has been recently studied in the context of Bluetooth Personal Area Networks. There, centralized and distributed, capacity assignment heuristics were developed, with applicability to a variety of ad hoc networks. Yet, no guarantees on the performance of these heuristics have been provided. In this paper, we extend these heuristics such that they can operate with general convex objective functions. Then, we present our analytic results regarding these heuristics. Specifically, we show that they are beta-approximation (beta < 2) algorithms. Moreover, we show that even though the distributed and centralized algorithms allocate capacity in a different manner, both algorithms converge to the same results. Finally, we present numerical results that demonstrate the performance of the algorithms.", "paper_title": "Analysis of bandwidth allocation algorithms for wireless personal area networks", "paper_id": "WOS:000240263700006"}