{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "research_infrastructure"}, {"score": 0.029302631271982942, "phrase": "research_agenda"}, {"score": 0.004564401713056939, "phrase": "ever-changing_world"}, {"score": 0.0037776319581225046, "phrase": "research_objects"}, {"score": 0.003746673633703251, "phrase": "scientific_methods"}, {"score": 0.0035808664384880213, "phrase": "social_organization"}, {"score": 0.00327086925741257, "phrase": "regulatory_regimes"}, {"score": 0.0031649018957020337, "phrase": "information_infrastructure"}, {"score": 0.0030876784650745973, "phrase": "sociotechnical_facet"}, {"score": 0.0029027394930867902, "phrase": "empirical_instances"}, {"score": 0.0026403934420630155, "phrase": "long-term_research_infrastructure"}, {"score": 0.0025865679621853667, "phrase": "hiv_disease"}, {"score": 0.0024517252159075333, "phrase": "macs"}, {"score": 0.0024215727801940434, "phrase": "tremendous_changes"}, {"score": 0.002314271047073691, "phrase": "specimen_repositories"}, {"score": 0.0021049977753042253, "phrase": "change_research_infrastructures"}], "paper_keywords": ["Infrastructure", " Long-Term", " Sustainability", " Change", " Flexibility", " Science", " Ethnography and Archival Research", " Symbolic Interactionism", " Methodology"], "paper_abstract": "It is often said that, in the face of an ever-changing world, infrastructure must remain flexible. Yet, what is meant by change remains glib and, consequently, so too do our studies on flexibility. In this paper, we develop three sensitizing concepts to investigate change to research infrastructure: 1) technoscientific: changes in research objects, scientific methods, and instruments; 2) sociotechnical: changes in social organization, coordination and, collaboration tools; and data sharing techniques; and 3) institutional: changes in funding and regulatory regimes. The majority of studies of \"information infrastructure\" have focused on the sociotechnical facet, and so we offer the two additional facets of change to help sensitize researchers to empirical instances of these encountered in the field, and to broaden the research agenda. To elaborate these concepts, we focus on a long-term research infrastructure that has been investigating HIV disease for nearly thirty years: The Multicenter AIDS Cohort Study (MACS). Over time, the MACS has faced tremendous changes in its science, collaboration and communication tools, its data and specimen repositories, its institutional environment, and the disease itself. Before we can begin to characterize flexibility, we must understand the nature of change research infrastructures face. We conclude by outlining a research agenda that will match forms of flexibility to the heterogeneity of changes an infrastructure may encounter.", "paper_title": "Flexibility Relative to What? Change to Research Infrastructure", "paper_id": "WOS:000336971800003"}