{"auto_keywords": [{"score": 0.04274422292795533, "phrase": "known_poles"}, {"score": 0.0409303070249204, "phrase": "crb"}, {"score": 0.010612306914261346, "phrase": "cram"}, {"score": 0.00443308765153716, "phrase": "multi-poles_sinusoidal_model"}, {"score": 0.004143196873246147, "phrase": "noise_space"}, {"score": 0.003800093834008562, "phrase": "algorithms_performance"}, {"score": 0.0033190180867511605, "phrase": "close_subspaces_context"}, {"score": 0.0031845067058084583, "phrase": "unknown_ones"}, {"score": 0.002493592357827492, "phrase": "diagonal_terms"}, {"score": 0.0024563343593706883, "phrase": "fim"}, {"score": 0.0024014759148123736, "phrase": "complex_amplitudes"}, {"score": 0.0022105951175680856, "phrase": "closed-form_expressions"}, {"score": 0.0021049977753042253, "phrase": "known_complex-amplitude_parameters"}], "paper_keywords": ["Prior-knowledge of poles", " Cramer-Rao bound", " Singular Fisher information matrix"], "paper_abstract": "Introducing prior-knowledge of some damped/undamped poles in the estimation of the parameters of a multi-poles sinusoidal model is an important problem in various applications. The principle is to orthogonally project the data onto the noise space associated with the known poles. As the Cram,r-Rao Lower Bound (CRB) gives a benchmark against which algorithms performance can be compared, it is useful to derive the CRB associated with this model, named Prior-CRB (P-CRB). In particular, we analyze this bound in the close subspaces context, i.e., when the known poles are close to the unknown ones and we show that the P-CRB is lower-bounded by the CRB without (interfering) known poles and higher-bounded by the CRB with no a priori but which takes into account the known poles as parameters of interest. In addition, we show that for damped/undamped exponential process the sensibility of the P-CRB to the closeness of the subspaces is simply relied to the diagonal terms of the Fisher Information Matrix (FIM) associated only with the complex amplitudes of the model. So, by discarding these terms, we regularize the P-CRB and we can derive and analyze closed-form expressions (asymptotics and exacts) of this bound in the case of known complex-amplitude parameters.", "paper_title": "Cram,r-Rao bound for damped/undamped exponential process with prior-knowledge", "paper_id": "WOS:000268304900004"}