{"auto_keywords": [{"score": 0.05007828823667564, "phrase": "scientific_articles"}, {"score": 0.04967686446208658, "phrase": "database_descriptors"}, {"score": 0.041078685670043524, "phrase": "cab"}, {"score": 0.00413684709497912, "phrase": "six-hundred_forty_inspec"}, {"score": 0.0035539019235553897, "phrase": "detailed_comparisons"}, {"score": 0.003378385493203297, "phrase": "important_presence"}, {"score": 0.0032250961348210473, "phrase": "exactly_the_same_form"}, {"score": 0.0027009505231313864, "phrase": "inspec"}, {"score": 0.002678443591304539, "phrase": "lisa"}, {"score": 0.0023395610923736595, "phrase": "large_number"}, {"score": 0.0022333035936565548, "phrase": "ista"}], "paper_keywords": [""], "paper_abstract": "In this article, the authors analyze the keywords given by authors of scientific articles and the descriptors assigned to the articles to ascertain the presence of the keywords in the descriptors. Six-hundred forty INSPEC (information Service for Physics, Engineering, and Computing), CAB (Current Agriculture Bibliography) abstracts, ISTA (information Science and Technology Abstracts), and LISA (Library and Information Science Abstracts) database records were consulted. After detailed comparisons, it was found that keywords provided by authors have an important presence in the database descriptors studied; nearly 25% of all the keywords appeared in exactly the same form as descriptors, with another 21% though normalized, still detected in the descriptors. This means that almost 46% of keywords appear in the descriptors, either as such or after normalization. Elsewhere, three distinct indexing policies appear, one represented by INSPEC and LISA (indexers seem to have freedom to assign the descriptors they deem necessary); another is represented by CAB (no record has fewer than four descriptors and, in general, a large number of descriptors is employed). In contrast, in ISTA, a certain institutional code exists towards economy in indexing because 84% of records contain only four descriptors.", "paper_title": "Keywords given by authors of scientific articles in database descriptors", "paper_id": "WOS:000247078400009"}