{"auto_keywords": [{"score": 0.042895448768476785, "phrase": "outer_boundary"}, {"score": 0.015719716506582538, "phrase": "multiply-connected_domain"}, {"score": 0.015438592235578466, "phrase": "shortest_path"}, {"score": 0.01023453101049691, "phrase": "potential_paths"}, {"score": 0.00460626523683981, "phrase": "well-known_geometric_problem"}, {"score": 0.00455848598917637, "phrase": "widely_assumed_obstacles"}, {"score": 0.00444118525702523, "phrase": "curved_obstacles"}, {"score": 0.0043608674815879345, "phrase": "curved_multiply-connected_domains"}, {"score": 0.0042375659560642265, "phrase": "parametric_curves"}, {"score": 0.0038177536203992278, "phrase": "shortest_interior_path"}, {"score": 0.003709765513679065, "phrase": "sip"}, {"score": 0.0036331209562640164, "phrase": "straight_line_segments"}, {"score": 0.0035211228844308383, "phrase": "point-curve_tangents"}, {"score": 0.0034036710998644865, "phrase": "generalized_region_lemma"}, {"score": 0.0032559521297271165, "phrase": "potential_path"}, {"score": 0.0030422964624730567, "phrase": "redundant_computations"}, {"score": 0.0030185612970938724, "phrase": "final_sip"}, {"score": 0.0028426209019228694, "phrase": "equal_lengths"}, {"score": 0.002820439143557402, "phrase": "shortest_paths"}, {"score": 0.002791131730717477, "phrase": "tolerance_level"}, {"score": 0.002656015767150362, "phrase": "visibility_graph"}, {"score": 0.002587542884228226, "phrase": "non-uniform_rational_b-splines"}, {"score": 0.0021948718993867154, "phrase": "simply-connected_domains"}, {"score": 0.0021663824267071545, "phrase": "bharath_ram"}, {"score": 0.002155091991047052, "phrase": "ramanathan"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Shortest path", " Curve obstacles", " Multiply-connected curves", " Visibility graph", " Freeform curves"], "paper_abstract": "Computing the shortest path, overcoming obstacles in a plane, is a well-known geometric problem. However, widely assumed obstacles are polygonal in nature. Very few papers have focused on curved obstacles, and in particular, for curved multiply-connected domains (domains having holes). Given a set of parametric curves forming a multiply-connected domain (MCD), with one closed curve acting as an outer boundary and several non-intersecting inner curves (loops) as representing holes and two distinct points S and E lying on the outer boundary, this paper provides an algorithm to find the shortest interior path (SIP) between the two points in the domain. SIP consists of portions of curves along with straight line segments that are tangential to the curve. The algorithm initially computes point-curve tangents (PCTs) and bitangents (BTs) using their respective constraints. A generalized region lemma is proposed, which is then employed to remove PCTs/BTs that will not contribute to the potential path and subsequently aiding in removing a few inner loops. The algorithm is designed to explore all potential paths. Merging of paths is also proposed to avoid redundant computations. A final SIP is chosen from potential paths using the length of each path. The algorithm also has the potential to give all paths of equal lengths contributing to shortest paths (within a tolerance level). As the algorithm computes all the potential paths on the fly, there is no need to employ a visibility graph to compute the shortest path. Curves are represented using non-uniform rational B-splines (NURBS). The algorithm uses the curves as such and does not discretize into point-sets or polygons. Extensions to handle curves with C-1 discontinuities and S and E not on the outer boundary have also been described. Results of the implementation are provided and complexity of the algorithm is also discussed. This paper follows up the one presented for simply-connected domains (SCDs) in Bharath Ram and Ramanathan (2011)[4]. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Shortest path in a multiply-connected domain having curved boundaries", "paper_id": "WOS:000315834300014"}