{"auto_keywords": [{"score": 0.034887398305923065, "phrase": "stereotrust"}, {"score": 0.00481495049065317, "phrase": "computational_trust_support_users"}, {"score": 0.004556901872357751, "phrase": "users'_judgements"}, {"score": 0.004511485198940203, "phrase": "online_auction_sites"}, {"score": 0.004184921610672245, "phrase": "historical_information"}, {"score": 0.004060986196931943, "phrase": "specific_agent"}, {"score": 0.003901407184706592, "phrase": "real_life"}, {"score": 0.0037480753312398754, "phrase": "stranger's_actions"}, {"score": 0.0029611289031152856, "phrase": "expected_outcome"}, {"score": 0.0026919067120537055, "phrase": "stranger's_profile"}, {"score": 0.002534596206835737, "phrase": "trustor's_own_personal_experiences"}, {"score": 0.0024842242921857705, "phrase": "historical_behavioral_information"}, {"score": 0.0022810491620483737, "phrase": "epinions.com_dataset"}, {"score": 0.0022133711375320266, "phrase": "existing_trust_models"}, {"score": 0.0021802872319258977, "phrase": "different_kinds"}], "paper_keywords": ["Security and trust", " Computational trust", " E-commerce", " Multiagent systems", " Information retrieval", " Distributed systems", " Recommender systems"], "paper_abstract": "Models of computational trust support users in taking decisions. They are commonly used to guide users' judgements in online auction sites; or to determine quality of contributions in Web 2.0 sites. However, most existing systems require historical information about the past behavior of the specific agent being judged. In contrast, in real life, to anticipate and to predict a stranger's actions in absence of the knowledge of such behavioral history, we often use our \"instinct\"-essentially stereotypes developed from our past interactions with other \"similar\" persons. In this paper, we propose StereoTrust, a computational trust model inspired by stereotypes as used in real-life. A stereotype contains certain features of agents and an expected outcome of the transaction. When facing a stranger, an agent derives its trust by aggregating stereotypes matching the stranger's profile. Since stereotypes are formed locally, recommendations stem from the trustor's own personal experiences and perspective. Historical behavioral information, when available, can be used to refine the analysis. According to our experiments using Epinions.com dataset, StereoTrust compares favorably with existing trust models that use different kinds of information and more complete historical information. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Trust beyond reputation: A computational trust model based on stereotypes", "paper_id": "WOS:000315022400003"}