{"auto_keywords": [{"score": 0.044375144742625765, "phrase": "language_equivalence"}, {"score": 0.015719716506582538, "phrase": "fuzzy_discrete-event_systems"}, {"score": 0.015236319355575342, "phrase": "supervisory_control_theory"}, {"score": 0.014690831414034622, "phrase": "fuzzy_language_equivalence"}, {"score": 0.011375898092871489, "phrase": "fuzzy_simulation_equivalence"}, {"score": 0.010408143834580195, "phrase": "fuzzy_simulation"}, {"score": 0.002711506442590442, "phrase": "fuzzy_simulation_relations"}, {"score": 0.0025722202862084186, "phrase": "fuzzy_simulation-based_controllability"}, {"score": 0.0024144659350277954, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.002339246282204109, "phrase": "fuzzy_supervisors"}, {"score": 0.0022307779508260205, "phrase": "\"range\"_control_problem"}, {"score": 0.0021049977753042253, "phrase": "main_results"}], "paper_keywords": ["Fuzzy discrete-event systems (FDESs)", " fuzzy finite automata", " fuzzy simulation equivalence", " simulation-based controllability", " supervisory control"], "paper_abstract": "The supervisory control theory of fuzzy discrete-event systems (FDESs) for fuzzy language equivalence has been developed. However, in a way, language equivalence has limited expressiveness. Therefore, if the given specification can not be expressed by language equivalence, then the control for language equivalence does not work. In this paper, we further establish the supervisory control theory of FDESs for fuzzy simulation equivalence whose expressiveness is stronger than that of fuzzy language equivalence. First, we formalize the notions of fuzzy simulation and fuzzy simulation equivalence between two FDESs. Then, we present a method for deciding whether there is a fuzzy simulation or not. In addition, we also show several basic properties of fuzzy simulation relations. Afterward, we put forward the notion of fuzzy simulation-based controllability and, in particular, show that it serves as a necessary and sufficient condition for the existence of the fuzzy supervisors of FDESs. Moreover, we study the \"range\" control problem of FDESs. Some examples are given to illustrate the main results obtained.", "paper_title": "Supervisory Control of Fuzzy Discrete-Event Systems for Simulation Equivalence", "paper_id": "WOS:000349418100015"}