{"auto_keywords": [{"score": 0.04968898347890439, "phrase": "grant_authorization"}, {"score": 0.04930231023249967, "phrase": "digital_rights_management_solutions"}, {"score": 0.0043114466990006334, "phrase": "specific_business_cases"}, {"score": 0.004138575034269399, "phrase": "large_cases"}, {"score": 0.004104838067758352, "phrase": "scalable_drm_solutions"}, {"score": 0.0039402177950179345, "phrase": "complex_cross_media_content"}, {"score": 0.003813269577615793, "phrase": "educational_content"}, {"score": 0.0037667216301666196, "phrase": "electronic_medical_record"}, {"score": 0.00357146811369898, "phrase": "drm_costs"}, {"score": 0.0035278613436978933, "phrase": "scalability_problems"}, {"score": 0.0033449479263613848, "phrase": "large_number"}, {"score": 0.0031845067058084583, "phrase": "proposed_solution"}, {"score": 0.0028744731986533076, "phrase": "drm_solutions"}, {"score": 0.002759058732719621, "phrase": "drm_architecture"}, {"score": 0.0025945450101602825, "phrase": "traditional_drm_solutions"}, {"score": 0.0025628355581338563, "phrase": "provided_experimental_results"}, {"score": 0.0024398167078355224, "phrase": "aforementioned_cases"}], "paper_keywords": ["DRM complexity", " DRM P2P", " MPEG-21", " DHT", " AXMEDIS", " Rights controls", " Media distribution and protection", " Rights control of electronic medical record"], "paper_abstract": "Digital rights management solutions are today quite widespread. Their cost is still quite expensive, and thus in many cases, their application is limited to specific business cases. On the other hand, the market still offers large cases where scalable DRM solutions would find their applicability, for example the management of complex cross media content such as the one used for the educational content, for electronic medical record, etc. In this paper, the focus is on reducing DRM costs by solving scalability problems lying behind the complexity of granting authorizations and performing verification for a large number of users, content and rights associated with them. The proposed solution is based on the exploitation of the DHT P2P network and storage to cope with verification and grant authorization. The paper reports the structure of the DRM solutions, the details for including the DHT P2P into the DRM architecture. The paper also reports details on how the proposed P2P DRM solution can be integrated into traditional DRM solutions. The provided experimental results have proved the reduction of costs, the scalability against the aforementioned cases. The studies and solutions reported in this paper have been worked out and validated on top of MPEG-21/AXMEDIS DRM solutions and tools. On the other hand, the solution is general enough to be adapted in other DRM solutions.", "paper_title": "Exploiting P2P scalability for grant authorization in digital rights management solutions", "paper_id": "WOS:000339891300026"}