{"auto_keywords": [{"score": 0.04959913342990779, "phrase": "scholarly_influence"}, {"score": 0.0048149905375886514, "phrase": "homophily"}, {"score": 0.00473477283457869, "phrase": "information_systems_research"}, {"score": 0.004368037394395782, "phrase": "discipline's_identity"}, {"score": 0.00432423070113186, "phrase": "social_aspect"}, {"score": 0.0038314621564116192, "phrase": "acedo_et_al"}, {"score": 0.003630809610997277, "phrase": "c-oauthored_work"}, {"score": 0.0034638476252104706, "phrase": "subsequent_citations"}, {"score": 0.003260377175139591, "phrase": "co-authored_papers"}, {"score": 0.0030380052848799155, "phrase": "north_america"}, {"score": 0.00300749708357049, "phrase": "european_journals"}, {"score": 0.0029473940028924748, "phrase": "significant_effects"}, {"score": 0.002783527398566117, "phrase": "stronger_preference"}, {"score": 0.00251620434048784, "phrase": "intriguing_results"}, {"score": 0.0021049977753042253, "phrase": "downstream_benefits"}], "paper_keywords": ["Co-authorship", " Scientific Collaboration", " Scientometrics", " Social Networks", " Sociology of Science"], "paper_abstract": "Information Systems (IS) researchers have increasingly focused attention on understanding the identity of our field (Hirschheim & Klein 2003; Lyytinen & King 2004). One facet of any discipline's identity is the social aspect of how its scholars actually conduct their work (DeSanctis 2003), which is formally labeled as the study of sociology of science. Contributing to this tradition of work, we empirically examine scholarly influence (Acedo et al., 2006); scientific collaboration, including metrics that capture the prevalence of c-oauthored work; antecedents to co-authorship; and the effect of co-authorship on subsequent citations. Based on analyzing five leading IS journals for a period of seven years, we found that co-authored papers have become increasingly common in leading IS journals and that coauthoring continues to be more prevalent in journals published in North America compared to European journals. Moreover, we found significant effects of homophily related to gender, homophily/proximity, and geography. IS scholars worldwide exhibit a stronger preference for collaborating with co-authors of the same sex and those who attended the same PhD program than one would expect by chance. We also examined differences among journals and found some intriguing results for the effect of co-authorship on citations. Overall, we found evidence that the number of co-authors was positively related to citations although there was some variance across journals. These findings point to a need for more research to better understand both the processes of collaboration and the drivers and downstream benefits associated with it.", "paper_title": "Co-authorship, Homophily, and Scholarly Influence in Information Systems Research", "paper_id": "WOS:000367680700001"}