{"auto_keywords": [{"score": 0.032910724397084354, "phrase": "visual_lifelogs"}, {"score": 0.00481495049065317, "phrase": "aiding_autobiographical_memory"}, {"score": 0.004695900553353526, "phrase": "human_memory"}, {"score": 0.004625881588444304, "phrase": "dynamic_system"}, {"score": 0.004556901872357751, "phrase": "accessible_certain_memories"}, {"score": 0.004269630481719451, "phrase": "personal_significance"}, {"score": 0.0036921366375716005, "phrase": "one's_life"}, {"score": 0.0036553070575015344, "phrase": "digital_form"}, {"score": 0.003407549468745519, "phrase": "computer-based_solutions"}, {"score": 0.0032085525502105836, "phrase": "technical_basis"}, {"score": 0.003036333273800443, "phrase": "event_similarity_and_event_importance"}, {"score": 0.0028877818105020434, "phrase": "cognitive_science_considerations"}, {"score": 0.002534596206835737, "phrase": "multiple_years"}, {"score": 0.0024842242921857705, "phrase": "review_article"}, {"score": 0.002246955931290095, "phrase": "human_memory_systems"}, {"score": 0.0022022878843247257, "phrase": "inherent_tension"}, {"score": 0.0021693692831601745, "phrase": "large_amounts"}], "paper_keywords": [""], "paper_abstract": "Human memory is a dynamic system that makes accessible certain memories of events based on a hierarchy of information, arguably driven by personal significance. Not all events are remembered, but those that are tend to be more psychologically relevant. In contrast, lifelogging is the process of automatically recording aspects of one's life in digital form without loss of information. In this article we share our experiences in designing computer-based solutions to assist people review their visual lifelogs and address this contrast. The technical basis for our work is automatically segmenting visual lifelogs into events, allowing event similarity and event importance to be computed, ideas that are motivated by cognitive science considerations of how human memory works and can be assisted. Our work has been based on visual lifelogs gathered by dozens of people, some of them with collections spanning multiple years. In this review article we summarize a series of studies that have led to the development of a browser that is based on human memory systems and discuss the inherent tension in storing large amounts of data but making the most relevant material the most accessible.", "paper_title": "Experiences of Aiding Autobiographical Memory Using the SenseCam", "paper_id": "WOS:000304010300007"}