{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "observed_properties"}, {"score": 0.04962483589994812, "phrase": "internet_topology"}, {"score": 0.010838568908017187, "phrase": "real_data"}, {"score": 0.003978866233891427, "phrase": "obtained_data"}, {"score": 0.003953639783762917, "phrase": "i.e._the_properties"}, {"score": 0.003916098498242888, "phrase": "obtained_maps"}, {"score": 0.003817715315140651, "phrase": "real_topology"}, {"score": 0.00369819191449264, "phrase": "general_approach"}, {"score": 0.0034263289553691408, "phrase": "theoretical_results"}, {"score": 0.00337224813954299, "phrase": "network_models"}, {"score": 0.0032770376530295436, "phrase": "actual_measurement_procedures"}, {"score": 0.002912963877144772, "phrase": "internet_topology_measurements"}, {"score": 0.0028397103530211415, "phrase": "partial_measurements"}, {"score": 0.0024606011870678493, "phrase": "strong_influence"}, {"score": 0.0023986960505076784, "phrase": "common_statistics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Internet topology", " Traceroute", " Metrology", " Complex networks"], "paper_abstract": "Maps of the internet topology are generally obtained by measuring the routes from a given set of sources to a given set of destinations (with tools such as traceroute). It has been shown that this approach misses some links and nodes. Worse, in some cases it can induce a bias in the obtained data, i.e. the properties of the obtained maps are significantly different from those of the real topology. In order to reduce this bias, the general approach consists in increasing the number of sources. Some works have studied the relevance of this approach. Most of them have used theoretical results, or simulations on network models. Some papers have used real data obtained from actual measurement procedures to evaluate the importance of the number of sources and destinations, but no work to our knowledge has studied extensively the importance of the choice of sources or destinations. Here, we use real data from internet topology measurements to study this question: by comparing partial measurements to our complete data, we can evaluate the impact of adding sources or destinations on the observed properties. We show that the number of sources and destinations used plays a role in the observed properties, but that their choice, and not only their number, also has a strong influence on the observations. We then study common statistics used to describe the internet topology, and show that they behave differently: some can be trusted once the number of sources and destinations are not too small, while others are difficult to evaluate. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Impact of sources and destinations on the observed properties of the internet topology", "paper_id": "WOS:000288298100008"}