{"auto_keywords": [{"score": 0.02674249215031368, "phrase": "proposed_system"}, {"score": 0.004815105663484454, "phrase": "hidden"}, {"score": 0.004347256848088215, "phrase": "rapid_development"}, {"score": 0.004308791766002289, "phrase": "information_technology"}, {"score": 0.004251728624599691, "phrase": "increasing_number"}, {"score": 0.003959863717046575, "phrase": "brick-and-mortar_stores"}, {"score": 0.003907403442285109, "phrase": "new_e-commerce_model"}, {"score": 0.0036553070575015344, "phrase": "significant_managerial_and_academic_attention"}, {"score": 0.003114449258490062, "phrase": "new_reputation_management_system"}, {"score": 0.002952516738708181, "phrase": "probabilistic_model"}, {"score": 0.002811464848641341, "phrase": "observable_online_and_offline_raw_reputation_information"}, {"score": 0.002641621667026613, "phrase": "offline_merchants'_historical_and_predictive_reputation_information"}, {"score": 0.0024490834773668153, "phrase": "extant_hidden_markov_model-based_reputation_management_system"}, {"score": 0.0023010815714140467, "phrase": "hsmm-rms."}, {"score": 0.002200861826643147, "phrase": "realistic_solution"}, {"score": 0.0021813467128927347, "phrase": "reputation_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online to offline e-commerce", " Reputation management system", " Hidden semi-Markov model"], "paper_abstract": "The rapid development of information technology enables an increasing number of consumers to search and book products/services online first and then to consume them in brick-and-mortar stores. This new e-commerce model is called online to offline (O2O) e-commerce and has received significant managerial and academic attention. Compared with many extant e-commerce models (i.e., B2B, B2C and C2C), reputation management in this emerging model needs some improvement. It has to collect more raw reputation-related data, consider more reputation-related factors and show more comprehensive reputation evaluation results. As a stepping-stone in the research in O2O e-commerce, a new reputation management system (HSMM-RMS) has been developed based on a probabilistic model called the hidden semi-Markov model. By combining observable online and offline raw reputation information, the proposed system can accurately, promptly and dynamically provide O2O e-commerce participants with offline merchants' historical and predictive reputation information. Our Monte-Carlo simulation experiments indicate that the proposed system performs significantly better than the extant hidden Markov model-based reputation management system. A case study based on a real O2O e-commerce platform demonstrates the real application of HSMM-RMS. It also shows that the proposed system can provide a realistic solution for reputation management in the O2O e-commerce market (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Hidden semi-Markov model-based reputation management system for online to offline (020) e-commerce markets", "paper_id": "WOS:000360250500007"}