{"auto_keywords": [{"score": 0.04747282423410841, "phrase": "sequential_programs"}, {"score": 0.00481495049065317, "phrase": "multicore_processors"}, {"score": 0.004046020290832207, "phrase": "dense_matrix_computations"}, {"score": 0.0038737214010638745, "phrase": "irregular_programs"}, {"score": 0.003528730431045574, "phrase": "galois_project"}, {"score": 0.0034420211080526094, "phrase": "fresh_look"}, {"score": 0.0030017207229983385, "phrase": "programming_abstractions"}, {"score": 0.0027172101552870973, "phrase": "runtime_system"}, {"score": 0.0022542611024997474, "phrase": "experimental_results"}, {"score": 0.002185148071784046, "phrase": "delaunay_mesh_refinement_application"}, {"score": 0.0021446993452098597, "phrase": "graphics_application"}, {"score": 0.0021049977753042253, "phrase": "agglomerative_clustering"}], "paper_keywords": [""], "paper_abstract": "The problem of writing software for multicore processors is greatly simplified if we could automatically parallelize sequential programs. Although auto-parallelization has been studied for many decades, it has succeeded only in a few application areas such as dense matrix computations. In particular, auto-parallelization of irregular programs, which are organized around large, pointer-based data structures like graphs, has seemed intractable. The Galois project is taking a fresh look at auto-parallelization. Rather than attempt to parallelize all programs no matter how obscurely they are written, we are designing programming abstractions that permit programmers to highlight opportunities for exploiting parallelism in sequential programs, and building a runtime system that uses these hints to execute the program in parallel. In this paper, we describe the design and implementation of a system based on these ideas. Experimental results for two real-world irregular applications, a Delaunay mesh refinement application and a graphics application that performs agglomerative clustering, demonstrate that this approach is promising.", "paper_title": "Optimistic Parallelism Requires Abstractions", "paper_id": "WOS:000269418800025"}