{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "resolvable_h-designs"}, {"score": 0.008519961948881334, "phrase": "necessary_conditions"}, {"score": 0.005578186818628728, "phrase": "alternative_existence_proof"}, {"score": 0.004856347676607507, "phrase": "thousand_yen"}, {"score": 0.004614873511829352, "phrase": "hartman"}, {"score": 0.004097599949514035, "phrase": "ji"}, {"score": 0.004074474463941302, "phrase": "zhu"}, {"score": 0.0038719896823446592, "phrase": "simple_but_powerful_construction"}, {"score": 0.0034086028336466688, "phrase": "existence_problem"}, {"score": 0.002795228413298423, "phrase": "existence_result"}, {"score": 0.002337936608245512, "phrase": "general_existence_problem"}, {"score": 0.0022661190184053628, "phrase": "mainly_the_case"}, {"score": 0.0021049977753042253, "phrase": "resolvable_g-design"}], "paper_keywords": ["B-4-pairings", " Candelabra systems", " G-designs", " H-designs", " H-frames", " Resolvable", " Steiner quadruple systems"], "paper_abstract": "In 1987, Hartman showed that the necessary condition v a parts per thousand 4 or 8 (mod 12) for the existence of a resolvable SQS(v) is also sufficient for all values of v, with 23 possible exceptions. These last 23 undecided orders were removed by Ji and Zhu in 2005 by introducing the concept of resolvable H-designs. In this paper, we first develop a simple but powerful construction for resolvable H-designs, i.e., a construction of an RH(g (2n) ) from an RH((2g) (n) ), which we call group halving construction. Based on this construction, we provide an alternative existence proof for resolvable SQS(v)s by investigating the existence problem of resolvable H-designs with group size 2. We show that the necessary conditions for the existence of an RH(2 (n) ), namely, n a parts per thousand 2 or 4 (mod 6) and n a parts per thousand yen 4 are also sufficient. Meanwhile, we provide an alternative existence proof for resolvable H-designs with group size 6. These results are obtained by first establishing an existence result for resolvable H-designs with group size 4, that is, the necessary conditions n a parts per thousand 1 or 2 (mod 3) and n a parts per thousand yen 4 for the existence of an RH(4 (n) ) are also sufficient for all values of n except possibly n a {73, 149}. As a consequence, the general existence problem of an RH(g (n) ) is solved leaving mainly the case of g a parts per thousand 0 (mod 12) open. Finally, we show that the necessary conditions for the existence of a resolvable G-design of type g (n) are also sufficient.", "paper_title": "Existence of resolvable H-designs with group sizes 2, 3, 4 and 6", "paper_id": "WOS:000274238100007"}