{"auto_keywords": [{"score": 0.03253253627295769, "phrase": "exponential_function"}, {"score": 0.007584506487195445, "phrase": "average_mean"}, {"score": 0.005137487058363558, "phrase": "individual_learner"}, {"score": 0.0047273577269638725, "phrase": "artificial_learners"}, {"score": 0.004641351004344458, "phrase": "appropriate_description"}, {"score": 0.004556901872357751, "phrase": "optimal_solution"}, {"score": 0.004515252649226697, "phrase": "learning_problem"}, {"score": 0.004473982381245469, "phrase": "functional_dependency"}, {"score": 0.004253618550301311, "phrase": "arbitrary_artificial_learners"}, {"score": 0.004034787583452251, "phrase": "learning_curve"}, {"score": 0.003835972725191194, "phrase": "publicly_available_repositories"}, {"score": 0.0035722806911457545, "phrase": "measured_error_rates"}, {"score": 0.0034196729898826467, "phrase": "error_rate"}, {"score": 0.003357377246682711, "phrase": "dependent_samples_t-test"}, {"score": 0.0032886455096627324, "phrase": "mean_squared_error"}, {"score": 0.0032436052954996097, "phrase": "wilcoxon's_signed_rank_test"}, {"score": 0.003126481516783286, "phrase": "decision_trees_error_rate"}, {"score": 0.002999749669403939, "phrase": "better_descriptor"}, {"score": 0.002985988377995789, "phrase": "error_rate_function"}, {"score": 0.0026678152205422026, "phrase": "linear_function"}, {"score": 0.0026252106881752067, "phrase": "exponential_function's_rank"}, {"score": 0.0025892330566358503, "phrase": "reasonable_threshold"}, {"score": 0.002444544487772349, "phrase": "human_cognitive_performance"}, {"score": 0.002411036840516453, "phrase": "heathcote_et_al"}, {"score": 0.0022502481160673257, "phrase": "different_tasks"}, {"score": 0.0021889694778800682, "phrase": "future_performance"}, {"score": 0.0021049977753042253, "phrase": "better_accuracy"}], "paper_keywords": ["learning curve", " learning process", " classification", " accuracy", " assessment", " data mining", " C4.5", " power law"], "paper_abstract": "Background: In the area of artificial learners, not much research on the question of an appropriate description of artificial learner's (empirical) performance has been conducted. The optimal solution of describing a learning problem would be a functional dependency between the data, the learning algorithm's internal specifics and its performance. Unfortunately, a general, restrictionsfree theory on performance of arbitrary artificial learners has not been developed yet. Objective: The objective of this paper is to investigate which function is most appropriately describing the learning curve produced by C4.5 algorithm. Methods: The J48 implementation of the C4.5 algorithm was applied to datasets (n = 121) from publicly available repositories (e.g. UCI) in step wise k-fold cross-validation. First, four different functions (power, linear, logarithmic, exponential) were fit to the measured error rates. Where the fit was statistically significant (n = 86), we measured the average mean squared error rate for each function and its rank. The dependent samples T-test was performed to test whether the differences between mean squared error are significantly different, and Wilcoxon's signed rank test was used to test whether the differences between ranks are significant. Results: The decision trees error rate can be successfully modeled by an exponential function. In a total of 86 datasets, exponential function was a better descriptor of error rate function in 64 of 86 cases, power was best in 13, logarithmic in 3, and linear in 6 out of 86 cases. Average mean squared error across all datasets was 0.052954 for exponential function, and was significantly different at P = 0.001 from power and at P = 0.000 from linear function. The results also show that exponential function's rank is significantly different at any reasonable threshold (P = 0.000) from the rank of any other model. Conclusion: Our findings are consistent with tests performed in the area of human cognitive performance, e.g. with works by Heathcote et al. (2000), who were observing that the exponential function is best describing an individual learner. In our case we did observe an individual learner (C4.5 algorithm) at different tasks. The work can be used to forecast and model the future performance of C4.5 when not all data have been used or there is a need to obtain more data for better accuracy.", "paper_title": "Best-Fit Learning Curve Model for the C4.5 Algorithm", "paper_id": "WOS:000342876400002"}