{"auto_keywords": [{"score": 0.0459177180449158, "phrase": "close_proximity"}, {"score": 0.03464034545023033, "phrase": "visual_information"}, {"score": 0.00481495049065317, "phrase": "multiple_interacting_targets_tracking"}, {"score": 0.004766683200410046, "phrase": "fusion_of_laser_and_vision"}, {"score": 0.004624751696958501, "phrase": "multitarget_tracking"}, {"score": 0.004139401327448803, "phrase": "promising_online_system"}, {"score": 0.003704797078215222, "phrase": "online_learning"}, {"score": 0.003366233863411861, "phrase": "laser-based_independent_trackers"}, {"score": 0.0031208772639433145, "phrase": "\"possible_interacting_targets"}, {"score": 0.0025119730908615104, "phrase": "entire_process"}, {"score": 0.0024125253170522816, "phrase": "experimental_results"}, {"score": 0.0021697677572213086, "phrase": "good_trade-off"}, {"score": 0.0021049977753042253, "phrase": "time-cost_factor"}], "paper_keywords": ["Measurement", " Algorithms", " Multiple targets tracking", " sensor fusion"], "paper_abstract": "Multitarget tracking becomes significantly more challenging when the targets are in close proximity or frequently interact with each other. This article presents a promising online system to deal with these problems. The novelty of this system is that laser and vision are integrated with tracking and online learning to complement each other in one framework: when the targets do not interact with each other, the laser-based independent trackers are employed and the visual information is extracted simultaneously to train some classifiers online for \"possible interacting targets\". When the targets are in close proximity, the classifiers learned online are used alongside visual information to assist in tracking. Therefore, this mode of cooperation not only deals with various tough problems encountered in tracking, but also ensures that the entire process can be completely online and automatic. Experimental results demonstrate that laser and vision fully display their respective advantages in our system, and it is easy for us to obtain a good trade-off between tracking accuracy and the time-cost factor.", "paper_title": "An Online System for Multiple Interacting Targets Tracking: Fusion of Laser and Vision, Tracking and Learning", "paper_id": "WOS:000321962000018"}