{"auto_keywords": [{"score": 0.033850431301400814, "phrase": "random_forests"}, {"score": 0.02322730111336099, "phrase": "conditional_quantiles"}, {"score": 0.022646511475430186, "phrase": "gb"}, {"score": 0.004753194996637899, "phrase": "gradient_boosting"}, {"score": 0.004427366754240748, "phrase": "regression_problems"}, {"score": 0.0043705604923728195, "phrase": "great_power"}, {"score": 0.0037188360359702182, "phrase": "distributional_functionals"}, {"score": 0.003647442345566347, "phrase": "conditional_mean"}, {"score": 0.003486123304074186, "phrase": "huge_amount"}, {"score": 0.0033971539563683174, "phrase": "conditional_quantile_prediction"}, {"score": 0.0031233388358844188, "phrase": "simulation_studies"}, {"score": 0.002927780883930371, "phrase": "centre_quantiles"}, {"score": 0.0021049977753042253, "phrase": "gb._empirical_results"}], "paper_keywords": ["gradient boosting", " random gradient boosting", " random forests", " quantile regression", " quantile regression forests"], "paper_abstract": "Gradient Boosting (GB) was introduced to address both classification and regression problems with great power. People have studied the boosting with L2 loss intensively both in theory and practice. However, the L2 loss is not proper for learning distributional functionals beyond the conditional mean such as conditional quantiles. There are huge amount of literatures studying conditional quantile prediction with various methods including machine learning techniques such like random forests and boosting. Simulation studies reveal that the weakness of random forests lies in predicting centre quantiles and that of GB lies in predicting extremes. Is there an algorithm that enjoys the advantages of both random forests and boosting so that it can perform well over all quantiles? In this article, we propose such a boosting algorithm called random GB which embraces the merits of both random forests and GB. Empirical results will be presented to support the superiority of this algorithm in predicting conditional quantiles.", "paper_title": "Random gradient boosting for predicting conditional quantiles", "paper_id": "WOS:000361612800008"}