{"auto_keywords": [{"score": 0.048734215142491696, "phrase": "delivery_plan"}, {"score": 0.032948015900054896, "phrase": "new_heuristic"}, {"score": 0.029420333683948783, "phrase": "kalinowski"}, {"score": 0.027764407562132207, "phrase": "optimal_solutions"}, {"score": 0.02460516955331743, "phrase": "optimal_solution"}, {"score": 0.00481495049065317, "phrase": "new_sequential"}, {"score": 0.004724365740062236, "phrase": "cancer_radiation_treatment_using_multileaf_collimators"}, {"score": 0.004657542074154025, "phrase": "cancer_radiation_treatment"}, {"score": 0.004635477242873163, "phrase": "multileaf_collimators"}, {"score": 0.0045374660781550445, "phrase": "\"_mode"}, {"score": 0.004420472010542188, "phrase": "integer_matrix"}, {"score": 0.004389089062127892, "phrase": "weighted_sum"}, {"score": 0.0043682904296796264, "phrase": "binary_matrices"}, {"score": 0.004337276328199398, "phrase": "consecutive-ones_property"}, {"score": 0.004255639740735269, "phrase": "collimator_technology"}, {"score": 0.003944112858235306, "phrase": "different_binary_matrices"}, {"score": 0.0037789720824759503, "phrase": "setup_time"}, {"score": 0.0034118234596993836, "phrase": "decomposition_problem"}, {"score": 0.0033728823673902, "phrase": "np"}, {"score": 0.00332375606483146, "phrase": "best_available_exact_solution_methods"}, {"score": 0.0032766780632972363, "phrase": "reasonable_time"}, {"score": 0.0031845067058084583, "phrase": "actual_medical_applications"}, {"score": 0.0030078460113945136, "phrase": "exact_bounds"}, {"score": 0.0027413748388534025, "phrase": "average_gap"}, {"score": 0.002676927955032731, "phrase": "optimal_value"}, {"score": 0.0026452734009203764, "phrase": "largest_problems"}, {"score": 0.0021454671611847507, "phrase": "optimality_gap"}, {"score": 0.0021049977753042253, "phrase": "kalinowski's_heuristic"}], "paper_keywords": ["matrix decomposition", " multileaf collimator sequencing", " cancer radiation therapy"], "paper_abstract": "Finding a delivery plan for cancer radiation treatment using multileaf collimators operating in \"step-and-shoot\" mode can be formulated mathematically as a problem of decomposing an integer matrix into a weighted sum of binary matrices having the consecutive-ones property and sometimes other properties related to the collimator technology. The efficiency of the delivery plan is measured by both the sum of the weights in the decomposition, known as the total beam-on time, and the number of different binary matrices appearing in it, referred to as the cardinality, the latter being closely related to the setup time of the treatment. In practice, the total beam-on time is usually restricted to its minimum possible value (which is easy to find), and a decomposition that minimizes cardinality (subject to this restriction) is sought. This decomposition problem is known to be NP-hard, and the best available exact solution methods cannot solve, in reasonable time, problems with dimensions large enough to be of use in actual medical applications. In this paper, we propose a new heuristic. To ensure that the heuristic is computationally efficient, we make use of exact bounds that apply to the decomposition and prove that these bounds can be computed efficiently. We demonstrate that the heuristic performs very well numerically against the best previously published heuristic (that of Kalinowski), reducing the average gap between the cardinality of the solution found and the optimal value by 37% on the largest problems tested (for which optimal solutions could be found). Importantly, this new heuristic performs well on those instances that are problematical for Kalinowski's heuristic. A \"best-of\" algorithm, combining heuristics, produces a decomposition with cardinality within one of optimal in about 98.7% of instances tested (for which an optimal solution is available). It reduces the cardinality of solutions produced by about 5% on average. On instances for which optimal solutions can be found, it more than halves the optimality gap and finds an optimal solution in about 28% more cases than Kalinowski's heuristic.", "paper_title": "A New Sequential Extraction Heuristic for Optimizing the Delivery of Cancer Radiation Treatment Using Multileaf Collimators", "paper_id": "WOS:000265756900004"}