{"auto_keywords": [{"score": 0.031342475094813, "phrase": "im"}, {"score": 0.00481495049065317, "phrase": "instant_messaging"}, {"score": 0.004608060637237746, "phrase": "audio_channels"}, {"score": 0.004507958400383826, "phrase": "im's_use"}, {"score": 0.0041287394089001405, "phrase": "greater_gains"}, {"score": 0.0038125954036382177, "phrase": "main_goal"}, {"score": 0.0037297085404352347, "phrase": "selfishness_theory"}, {"score": 0.003530261958550734, "phrase": "ending_concessions"}, {"score": 0.003482083698073306, "phrase": "individuals'_gains"}, {"score": 0.003378385493203297, "phrase": "negotiation_laboratory_experiment"}, {"score": 0.003268767497941097, "phrase": "unrestricted_offers"}, {"score": 0.003102411189152985, "phrase": "resulting_communications"}, {"score": 0.003043272957851679, "phrase": "simulated_lottery_tickets"}, {"score": 0.0028100102841877835, "phrase": "non-equitable_agreements"}, {"score": 0.0026305114818849042, "phrase": "individuals'_concessions"}, {"score": 0.002601727192945944, "phrase": "partners'_ending_concessions"}, {"score": 0.0025034338848015187, "phrase": "partners'_bidding_behaviors"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["instant messaging", " audio", " selfishness", " agreement", " ending concession", " self-interest", " deindividuation", " media", " negotiation experiment", " lottery", " negative reciprocation"], "paper_abstract": "In many online price negotiations, instant messaging (IM) and audio channels rival each other in use, but IM's use is on the rise. In these contexts, people who are strangers to each other are inclined to act more competitively. They are driven by self-interest and strive for greater gains from agreement in the form of what is termed \"ending concessions.\" To date, however, researchers have focused on striving for agreement as the main goal of negotiators. This study uses a selfishness theory to explain how individuals using IM, as compared to those using audio, can encourage their negotiation partners to make ending concessions, and thereby increase individuals' gains when agreement is reached. We use data from a negotiation laboratory experiment to test a model of ending concessions that is predicted by unrestricted offers and comments that negotiators make over IM and audio. We base our analyses on the contents of the resulting communications. The objects of negotiation are simulated lottery tickets. Our results provide three key insights. First, when using IM, partners appear to interpret offers that include concessions from individuals as attempts to manipulate partners into accepting non-equitable agreements; as a result partners decrease their ending concessions. These interpretations do not appear to occur when using audio, and as a result individuals' concessions do not decrease partners' ending concessions. Second, using IM, when individuals disagree with anger directed at partners' bidding behaviors, partners respond by increasing their ending concessions. Ending concessions are further increased when using audio. Third, and in contrast, using IM, when individuals disagree with emotion that does not include anger, partners respond by decreasing their ending concessions. Ending concessions are further decreased when using audio. These insights provide guidance for practice, and are bases for future research on the use of IM and audio for negotiation.", "paper_title": "Understanding the Influence of Instant Messaging on Ending Concessions During Negotiations", "paper_id": "WOS:000353145800012"}