{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sci"}, {"score": 0.04943553766012613, "phrase": "non-patent_references"}, {"score": 0.03712967059090659, "phrase": "sci_publications"}, {"score": 0.03095699143484087, "phrase": "proposed_approach"}, {"score": 0.004579316323166273, "phrase": "science_citation_index"}, {"score": 0.004340614094598847, "phrase": "computer_science_method"}, {"score": 0.004141936429360251, "phrase": "information_retrieval_systems"}, {"score": 0.003939107874750185, "phrase": "retrievability_ratios"}, {"score": 0.003647156095687574, "phrase": "intermediate_outcome"}, {"score": 0.0034568750690264034, "phrase": "five_steps"}, {"score": 0.0033095814296125532, "phrase": "supervised_and_test_data"}, {"score": 0.0029631742332058087, "phrase": "proposed_and_conventional_approaches"}, {"score": 0.0027250276317603507, "phrase": "previous_studies"}, {"score": 0.002644050667977234, "phrase": "comprehensive_npr_data"}, {"score": 0.0026263842544386948, "phrase": "u.s._utility_patents"}, {"score": 0.002407155340052809, "phrase": "acceptable_time"}, {"score": 0.0021049977753042253, "phrase": "science_publications"}], "paper_keywords": ["Non-patent references", " US utility patents", " Science citation", " Automated matching"], "paper_abstract": "In order to evaluate approaches for identifying science citation index (SCI) covered publications within non-patent references (NPRs), the author employs a computer science method that uses two key indicators, recall and precision, to evaluate the relevance of information retrieval systems. There are two primary reasons that this method is adequate: in contrast to the retrievability ratios used previously, first, this method can evaluate two dimensions of matching accuracy, and second, results of its evaluation are independent of the intermediate outcome. The author then proposes an approach for identifying SCI publications within NPRs that consists of five steps: (1) data collection, (2) creation of supervised and test data, (3) selection and execution of matching algorithms, (4) evaluation of algorithms and optimization of their combinations, and (5) evaluation of optimized combinations. A comparison of the proposed and conventional approaches showed that the proposed approach works well, with results far better (99 % precision and 95 % recall) than the target implicitly set in previous studies. The author also applied the approach to comprehensive NPR data in U.S. utility patents registered between 1992 and 2012 and checked the performance. Results showed that the approach could identify SCI publications from within millions of NPRs in an acceptable time (i.e., within a couple of weeks) and that it performs as expected from the evaluation in step 5. On the basis of these results, the proposed approach is considered of value in studies on relations and/or interactions between science publications and patents.", "paper_title": "Identifying SCI covered publications within non-patent references in US utility patents", "paper_id": "WOS:000343609900006"}