{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "large_coding_gain"}, {"score": 0.0092718002486067, "phrase": "srinath-rajan_code"}, {"score": 0.004627944735913613, "phrase": "new_method"}, {"score": 0.004299621153829837, "phrase": "channel_use"}, {"score": 0.003927203683176278, "phrase": "multiple_input_double_output"}, {"score": 0.0031665087019813244, "phrase": "non-vanishing_determinant"}, {"score": 0.0027017308406240563, "phrase": "lowest_ml-decoding_complexity"}, {"score": 0.002425757064804087, "phrase": "stbc"}, {"score": 0.002253299769886694, "phrase": "positive_a_previous_conjecture"}, {"score": 0.0021049977753042253, "phrase": "nvd_property"}], "paper_keywords": ["Cyclic division algebra (CDA)", " fast-decodability", " Galois group", " multiple-input double-output (MIDO) systems", " non-vanishing determinant (NVD)", " space-time block codes (STBCs)"], "paper_abstract": "In this paper, a new method is proposed to obtain full-diversity, rate-2 (rate of two complex symbols per channel use) space-time block codes (STBCs) that are full-rate for multiple input double output (MIDO) systems. Using this method, rate-2 STBCs for 4 x 2, 6 x 2, 8 x 2, and 12 x 2 systems are constructed and these STBCs are fast ML-decodable, have large coding gains, and STBC-schemes consisting of these STBCs have a non-vanishing determinant (NVD) so that they are DMT-optimal for their respective MIDO systems. It is also shown that the Srinath-Rajan code for the 4 x 2 system, which has the lowest ML-decoding complexity among known rate-2 STBCs for the 4x2 MIDO system with a large coding gain for 4-/16-QAM, has the same algebraic structure as the STBC constructed in this paper for the 4 x 2 system. This also settles in positive a previous conjecture that the STBC-scheme that is based on the Srinath-Rajan code has the NVD property and hence is DMT-optimal for the 4 x 2 system.", "paper_title": "Fast-Decodable MIDO Codes With Large Coding Gain", "paper_id": "WOS:000330286100016"}