{"auto_keywords": [{"score": 0.04465544779528525, "phrase": "home_network"}, {"score": 0.03741433141757543, "phrase": "security_policy"}, {"score": 0.00481495049065317, "phrase": "home_gateway"}, {"score": 0.004757643419056999, "phrase": "smart_homes"}, {"score": 0.004517055580214742, "phrase": "security_technologies"}, {"score": 0.0044101380740283825, "phrase": "home_network_systems"}, {"score": 0.004322967486451877, "phrase": "specialized_security_mechanisms"}, {"score": 0.004104269996872886, "phrase": "research_model"}, {"score": 0.0035973486787314883, "phrase": "rbac_methodologies"}, {"score": 0.0034981163169818803, "phrase": "newly-designed_script_language"}, {"score": 0.0034426417353349567, "phrase": "xhdl._findings"}, {"score": 0.003321008590273796, "phrase": "home_network_users"}, {"score": 0.0030292784088033838, "phrase": "specialized_rather_than_general_specification"}, {"score": 0.0027741761880779535, "phrase": "user_accessibility"}, {"score": 0.0026547761341670505, "phrase": "physical_transport_layer"}, {"score": 0.002571171956724731, "phrase": "home_network_environment"}, {"score": 0.0024802523752944536, "phrase": "implementation-based_security_model"}, {"score": 0.002373472641477602, "phrase": "home_network_security"}, {"score": 0.0022895278869126848, "phrase": "real_deployment"}, {"score": 0.0022085455097790537, "phrase": "integrated_security_model"}, {"score": 0.0021049977753042253, "phrase": "home_network_services"}], "paper_keywords": ["Computer networks", " Data security", " Communication technologies", " Local area networks"], "paper_abstract": "Purpose - The purpose of this paper is to identify security technologies that are essential in making home network systems secure and to describe specialized security mechanisms for the home network and the relationships among them. Design/methodology/approach - The research model is designed to support three functions: authentication, authorization, and security policy. Authentication is tested in several methodologies Such as id/pw, certificate, or bio; authorization is tested using RBAC methodologies; and security policy is specified using newly-designed script language, Such as xHDL. Findings - The findings for \"authentication\" suggest that home network users can access services conveniently and securely. In addition, the findings for \"security policy\" suggest that security policy for home network requires specialized rather than general specification. Practical implications - The paper identifies three security functions essential for home network: authentication that supports most existing authentication mechanisms, so as to maximize user accessibility; authorization that is middleware-independent and beyond the physical transport layer; and security policy optimized for the home network environment. Originality/value - The paper focuses on an implementation-based security model for the home network. Though interest and research in home network security are increasing, only limited authentication applications have been adopted in real deployment up to now. This paper introduces an integrated security model and emphasizes safety and convenience so as to promote reliability in home network services.", "paper_title": "Security technologies based on a home gateway for making smart homes secure", "paper_id": "WOS:000265859500006"}