{"auto_keywords": [{"score": 0.04591009828177041, "phrase": "possible_consequences"}, {"score": 0.03822824368505865, "phrase": "five_hospitals"}, {"score": 0.00481495049065317, "phrase": "medication_administration_systems"}, {"score": 0.004693476992528682, "phrase": "patient_safety"}, {"score": 0.00458806383414443, "phrase": "clinicians'_workarounds"}, {"score": 0.004549144357293899, "phrase": "barcoded_medication_administration"}, {"score": 0.004273601449537163, "phrase": "handheld_devices"}, {"score": 0.0042373381286051354, "phrase": "machine-readable_barcodes"}, {"score": 0.004118658982032481, "phrase": "electronic_medication_administration_records"}, {"score": 0.00402610372759447, "phrase": "five_\"rights"}, {"score": 0.003991932110277654, "phrase": "medication_administration"}, {"score": 0.003423969509052361, "phrase": "hospital_leaders"}, {"score": 0.0033374705499418377, "phrase": "bcma_staff_meetings"}, {"score": 0.003021297818604431, "phrase": "computer_carts"}, {"score": 0.0029617414861784525, "phrase": "nurses'_belt_rings"}, {"score": 0.0028139168128067343, "phrase": "unreadable_medication_barcodes"}, {"score": 0.002440779299091561, "phrase": "bcma_alerts"}, {"score": 0.0023188961045301367, "phrase": "wrong_administration"}, {"score": 0.0022926465161639633, "phrase": "wrong_doses"}, {"score": 0.0022796331061797916, "phrase": "wrong_times"}, {"score": 0.0022602510455448587, "phrase": "wrong_formulations"}, {"score": 0.0022346638243276717, "phrase": "bcmas'_design"}, {"score": 0.0021534846185436497, "phrase": "real-world_clinical_workflows"}, {"score": 0.002123051344001408, "phrase": "situ_use"}, {"score": 0.0021049977753042253, "phrase": "safety_features'_correct_use"}], "paper_keywords": [""], "paper_abstract": "The authors develop a typology of clinicians' workarounds when using barcoded medication administration (BCMA) systems. Authors then identify the causes and possible consequences of each workaround. The BCMAs usually consist of handheld devices for scanning machine-readable barcodes on patients and medications. They also interface with electronic medication administration records. Ideally, BCMAs help confirm the five \"rights\" of medication administration: right patient, drug, dose, route, and time. While BCMAs are reported to reduce medication administration errors-the least likely medication error to be intercepted-these claims have not been clearly demonstrated. The authors studied BCMA use at five hospitals by: (1) observing and shadowing nurses using BCMAs at two hospitals, (2) interviewing staff and hospital leaders at five hospitals, (3) participating in BCMA staff meetings, (4) participating in one hospital's failure-mode-and-effects analyses, (5) analyzing BCMA override log data. The authors identified 15 types of workarounds, including, for example, affixing patient identification barcodes to computer carts, scanners, doorjambs, or nurses' belt rings; carrying several patients' prescanned medications on carts. The authors identified 31 types of causes of workarounds, such as unreadable medication barcodes (crinkled, smudged, torn, missing, covered by another label); malfunctioning scanners; unreadable or missing patient identification wristbands (chewed, soaked, missing); nonbarcoded medications; failing batteries; uncertain wireless connectivity; emergencies. The authors found nurses overrode BCMA alerts for 4.2% of patients charted and for 10.3% of medications charted. Possible consequences of the workarounds include wrong administration of medications, wrong doses, wrong times, and wrong formulations. Shortcomings in BCMAs' design, implementation, and workflow integration encourage workarounds. Integrating BCMAs within real-world clinical workflows requires attention to in situ use to ensure safety features' correct use.", "paper_title": "Workarounds to barcode medication administration systems: Their occurrences, causes, and threats to patient safety", "paper_id": "WOS:000257794700003"}