{"auto_keywords": [{"score": 0.04373932371398143, "phrase": "on-screen_text"}, {"score": 0.00481495049065317, "phrase": "multimedia_learning"}, {"score": 0.0045850648862091085, "phrase": "animated_agent's_image"}, {"score": 0.004112582094962078, "phrase": "computer-based_multimedia_learning_environment"}, {"score": 0.003937459891461576, "phrase": "visual_presence"}, {"score": 0.0038737214010638745, "phrase": "animated_pedagogical_agent"}, {"score": 0.003728966994353039, "phrase": "information_deeper_than_narration_or_on-screen_text"}, {"score": 0.0034180189629740426, "phrase": "human_cardiovascular_system"}, {"score": 0.0027491084541806823, "phrase": "large_and_significant_embodied_agent"}, {"score": 0.0025611773887867255, "phrase": "surprisingly_no_modality_effect"}, {"score": 0.002210814150677161, "phrase": "science-focused_multimedia_learning_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["animated pedagogical agents", " modality effect", " multimedia learning"], "paper_abstract": "Research suggests that students learn better when studying a picture coupled with narration rather than on-screen text in a computer-based multimedia learning environment. Moreover, combining narration with the visual presence of an animated pedagogical agent may also encourage students to process information deeper than narration or on-screen text alone. The current study was designed to evaluate three effects among students learning about the human cardiovascular system: the modality effect (narration vs. on-screen text), the embodied agent effect (narration + agent vs. on-screen text), and the image effect (narration + agent vs. narration). The results of this study document large and significant embodied agent and image effects on the posttest (particularly retention items) but surprisingly no modality effect was found. Overall, the results suggest that incorporating an animated pedagogical agent - programmed to coordinate narration with gaze and pointing - into a science-focused multimedia learning environment can foster learning. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Fostering multimedia learning of science: Exploring the role of an animated agent's image", "paper_id": "WOS:000247852800008"}