{"auto_keywords": [{"score": 0.04247114644429954, "phrase": "vbas"}, {"score": 0.0047464608267006395, "phrase": "tape_library"}, {"score": 0.004612376827433774, "phrase": "viable_place"}, {"score": 0.004418287966422041, "phrase": "virtualization_technology"}, {"score": 0.004252602474733162, "phrase": "virtual_backup"}, {"score": 0.004132411680987228, "phrase": "vbas."}, {"score": 0.003958439439112026, "phrase": "consistent_view"}, {"score": 0.003920780681351006, "phrase": "mass_storage"}, {"score": 0.0029711052657054463, "phrase": "large-scale_file_systems"}, {"score": 0.00283229915062791, "phrase": "general_backup_application"}, {"score": 0.0026870706690548586, "phrase": "vtl"}, {"score": 0.002327648608736437, "phrase": "tape_library_storage"}, {"score": 0.0022725931637071852, "phrase": "good_tradeoff"}, {"score": 0.0021976915360493628, "phrase": "prototype_system_performance"}], "paper_keywords": [""], "paper_abstract": "Built on a sequential write/read device, a tape library is seldom considered as a viable place for fast backup/restore data. With the help of the virtualization technology, in this paper we propose a virtual backup and archive system, called VBAS. The purpose of VBAS is to maintain a consistent view of mass storage so that the user can effectively manage it. And VBAS allows users to create files and directories as well as delete, open, close, read, write and/or extend the files on the device(s). VBAS maintains security on the files and provides the management for fragmentation. Moreover, VBAS can support large-scale file systems. Users have two ways to access VBAS: using general backup application, and through the APIs provided by VBAS. Based on VTL, RAID-DP, and iSCSI, VBAS not only has the disk-file-system-like. functions, but also retains the characteristics of tape library storage, thus achieving a good tradeoff between cost and performance. The prototype system performance is presented and improvements are analyzed to achieve higher write/read performance.", "paper_title": "High performance virtual backup and archive system", "paper_id": "WOS:000238417300088"}