{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_quality"}, {"score": 0.0491410816092368, "phrase": "customer_satisfaction"}, {"score": 0.008418288301926424, "phrase": "continuance_intention"}, {"score": 0.00833570514918076, "phrase": "mobile_value-added_services"}, {"score": 0.005240439302068919, "phrase": "significant_and_positive_effects"}, {"score": 0.004841732331403725, "phrase": "transaction-specific_satisfaction"}, {"score": 0.004448471107649881, "phrase": "multidimensional_model"}, {"score": 0.004212759658511567, "phrase": "mobile_communications_market"}, {"score": 0.0037407704200033607, "phrase": "mobile_services"}, {"score": 0.0035600143547053287, "phrase": "multiple_dimensions"}, {"score": 0.003507504253087326, "phrase": "research_model"}, {"score": 0.0034047882921717913, "phrase": "multidimensional_approach"}, {"score": 0.0031924548818636806, "phrase": "china"}, {"score": 0.0026973310437053573, "phrase": "significant_and_positive_effect"}, {"score": 0.00263129148531588, "phrase": "procedural_justice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Service quality", " Justice", " Transaction-specific satisfaction", " Cumulative satisfaction", " Continuance intention", " Mobile value-added services"], "paper_abstract": "Understanding the antecedents and consequences of customer satisfaction in the mobile communications market is important. This study explores the effects of service quality and justice on customer satisfaction, which, in turn, affects continuance intention of mobile services. Service quality, justice and customer satisfaction were measured by multiple dimensions. A research model was developed based on this multidimensional approach and was empirically examined with data collected from about one thousand users of mobile value-added services in China. Results show that all three dimensions of service quality (interaction quality, environment quality and outcome quality) have significant and positive effects on cumulative satisfaction while only one dimension of service quality (interaction quality) has a significant and positive effect on transaction-specific satisfaction. Besides procedural justice, the other two dimensions of justice (distributive justice and interactional justice) significantly influence both transaction-specific satisfaction and cumulative satisfaction. Furthermore, both types of customer satisfaction have significant and positive effects on continuance intention. Implications for research and practice are discussed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Assessing the effects of service quality and justice on customer satisfaction and the continuance intention of mobile value-added services: An empirical test of a multidimensional model", "paper_id": "WOS:000300648300009"}