{"auto_keywords": [{"score": 0.035053113860869144, "phrase": "randomly_selected_demand"}, {"score": 0.01073310606137257, "phrase": "channel_b"}, {"score": 0.00481495049065317, "phrase": "diverse_two-channel_systems"}, {"score": 0.004733901576706854, "phrase": "\"possibly_perfect"}, {"score": 0.004562923889976588, "phrase": "first_author"}, {"score": 0.004373267443572639, "phrase": "fault-tolerant_systems"}, {"score": 0.0039050245929822354, "phrase": "extreme_simplicity"}, {"score": 0.003882970272082245, "phrase": "extensive_analysis"}, {"score": 0.0038392331564122387, "phrase": "plausible_claim"}, {"score": 0.003627800727103479, "phrase": "safe_state"}, {"score": 0.0035767810270163312, "phrase": "system_probability"}, {"score": 0.003437697879833853, "phrase": "first_concerns"}, {"score": 0.003370190834214415, "phrase": "channel_a"}, {"score": 0.0027794243746094905, "phrase": "conditional_independence"}, {"score": 0.002671263324230699, "phrase": "\"_the_second_step"}, {"score": 0.002633660362974928, "phrase": "epistemic_uncertainty"}, {"score": 0.002603958475519519, "phrase": "assessors'_beliefs"}, {"score": 0.0024120247307686084, "phrase": "quite_plausible_assumptions"}, {"score": 0.0023313149689465386, "phrase": "point_estimates"}, {"score": 0.0022661190184053628, "phrase": "credible_estimates"}, {"score": 0.0021049977753042253, "phrase": "monitored_architectures"}], "paper_keywords": ["Software reliability", " software fault tolerance", " program correctness", " assurance case", " software diversity"], "paper_abstract": "This paper refines and extends an earlier one by the first author [1]. It considers the problem of reasoning about the reliability of fault-tolerant systems with two \"channels\" (i.e., components) of which one, A, because it is conventionally engineered and presumed to contain faults, supports only a claim of reliability, while the other, B, by virtue of extreme simplicity and extensive analysis, supports a plausible claim of \"perfection.\" We begin with the case where either channel can bring the system to a safe state. The reasoning about system probability of failure on demand (pfd) is divided into two steps. The first concerns aleatory uncertainty about 1) whether channel A will fail on a randomly selected demand and 2) whether channel B is imperfect. It is shown that, conditional upon knowing p(A) (the probability that A fails on a randomly selected demand) and p(B) (the probability that channel B is imperfect), a conservative bound on the probability that the system fails on a randomly selected demand is simply p(A) x p(B). That is, there is conditional independence between the events \" A fails\" and \" B is imperfect.\" The second step of the reasoning involves epistemic uncertainty, represented by assessors' beliefs about the distribution of (p(A), p(B)), and it is here that dependence may arise. However, we show that under quite plausible assumptions, a conservative bound on system pfd can be constructed from point estimates for just three parameters. We discuss the feasibility of establishing credible estimates for these parameters. We extend our analysis from faults of omission to those of commission, and then combine these to yield an analysis for monitored architectures of a kind proposed for aircraft.", "paper_title": "Reasoning about the Reliability of Diverse Two-Channel Systems in Which One Channel Is \"Possibly Perfect\"", "paper_id": "WOS:000308999100012"}