{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "flipped_model"}, {"score": 0.04293812570249546, "phrase": "higher_education"}, {"score": 0.004766877640444116, "phrase": "flipped_learning_model"}, {"score": 0.0045946617913925755, "phrase": "collaborative_activities"}, {"score": 0.0043697607816770775, "phrase": "previous_studies"}, {"score": 0.004197758831410097, "phrase": "higher_education_context"}, {"score": 0.004169754607580288, "phrase": "research_and_design_models"}, {"score": 0.0037587384888691645, "phrase": "flipped_learning"}, {"score": 0.003410871299189454, "phrase": "proposed_research"}, {"score": 0.003388098723960553, "phrase": "design_model"}, {"score": 0.0032112897905024976, "phrase": "engaging_experiences"}, {"score": 0.003043679504527297, "phrase": "\"holistic_flipped_classroom\"_environment"}, {"score": 0.0029830992938695007, "phrase": "student_survey"}, {"score": 0.0029041917003677234, "phrase": "computer_system"}, {"score": 0.0028368567593956054, "phrase": "proposed_model"}, {"score": 0.002600105134993952, "phrase": "transactional_distance"}, {"score": 0.0025654738267173274, "phrase": "learning_process"}, {"score": 0.002548331088496964, "phrase": "highly_motivated_students"}, {"score": 0.002375087848055933, "phrase": "full_adoption"}, {"score": 0.0022967713922705, "phrase": "\"flipped\"_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pedagogical issues", " Teaching/learning strategies", " Distributed learning environments", " Interactive learning environments", " Improving classroom teaching"], "paper_abstract": "The flipped learning model, which \"flips\" traditional in-class lectures with collaborative activities, has gained many followers and converts in K-12 education. However, a review of previous studies shows that the flipped model is still underutilized and underexplored in the higher education context. Research and design models for flipped learning in higher education are also insufficient. This study attempts to fill this gap by developing a model that can provide a foundation for further research and practice for flipped learning in higher education. Building from the four pillars of F-L-I-P (TM) (Flexible Environments, Learning Culture, Intentional Content, and Professional Educators), the proposed research and design model named \"FLIPPED\" adds three extra letters P-E-D (Progressive Activities, Engaging Experiences, and Diversified Platforms) to the F-L-I-P (TM) acronym. This model was implemented in a \"Holistic Flipped Classroom\" environment and evaluated based on a student survey, interviews, and an analysis of computer system logs. Findings demonstrated that the proposed model was effective; students reported that they were satisfied with the course, their attendance improved, and their study efforts increased. Results also suggested that the transactional distance changed during the learning process: highly motivated students performed much better than less motivated students. However, some students retained their former passive learning habits, and this resulted in an obstruction to full adoption. Reflections on the achievements and challenges of the \"FLIPPED\" model have culminated in various examples, guidelines, and suggestions for practitioners as they consider their own design, implementation, and adoption. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Is FLIP enough? Or should we use the FLIPPED model instead?", "paper_id": "WOS:000342880100002"}