{"auto_keywords": [{"score": 0.04049136264607471, "phrase": "image_data"}, {"score": 0.00481495049065317, "phrase": "multiple_linear_descriptors"}, {"score": 0.004764435715755502, "phrase": "automatic_classification"}, {"score": 0.004681413843223496, "phrase": "indirect_immunofluorescence_images"}, {"score": 0.004551563730037998, "phrase": "image_classification_problem"}, {"score": 0.004183137595671171, "phrase": "special_task"}, {"score": 0.0037376972797084976, "phrase": "local_patch"}, {"score": 0.003621160116056119, "phrase": "linear_projections"}, {"score": 0.0033868916699805224, "phrase": "multi-projection-multi-codebook_scheme"}, {"score": 0.00329282940819675, "phrase": "multiple_image_representation_channels"}, {"score": 0.0031234247639701134, "phrase": "image_representation"}, {"score": 0.0030689098754563982, "phrase": "different_channels"}, {"score": 0.0029627094945653427, "phrase": "single-projection_scheme"}, {"score": 0.0028301085867789076, "phrase": "proposed_approach"}, {"score": 0.00243225236680506, "phrase": "best_performance"}, {"score": 0.002282755117032059, "phrase": "single_type"}, {"score": 0.0022036996784968793, "phrase": "patch_pixel_values"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["HEp-2 cell", " Stain pattern", " Image classification", " Feature learning", " Partial least square", " Multiple codebooks"], "paper_abstract": "The automatic classification of the HEp-2 cell stain patterns from indirect immunofluorescence images has attracted much attention recently. As an image classification problem, it can be well solved by the state-of-the-art bag-of-features (BoF) model as long as a suitable local descriptor is known. Unfortunately, for this special task, we have very limited knowledge of such a descriptor. In this paper, we explore the possibility of automatically learning the descriptor from the image data itself. Specifically, we assume that a local patch can be well described by a set of linear projections performed on its pixel values. Based on this assumption, both unsupervised and supervised approaches are explored for learning the projections. More importantly, we propose a multi-projection-multi-codebook scheme which creates multiple linear projection descriptors and multiple image representation channels with each channel corresponding to one descriptor. Through our analysis, we show that the image representation obtained by combining these different channels can be more discriminative than that obtained from a single-projection scheme. This analysis is further verified by our experimental study. We evaluate the proposed approach by strictly following the protocol suggested by the organizer of the 2012 HEp-2 cell classification contest which is hosted to compare the state-of-the-art methods for HEp-2 cell classification. In this paper, our system achieves 66.6% cell level classification accuracy which is just slightly lower than the best performance achieved in the HEp-2 cell classification contest. This result is impressive and promising considering that we only utilize a single type of feature (namely, linear projection coefficients of patch pixel values) which is learned from the image data. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "HEp-2 cell image classification with multiple linear descriptors", "paper_id": "WOS:000334978100011"}