{"auto_keywords": [{"score": 0.03623436450881329, "phrase": "resource_management_system"}, {"score": 0.03122345406469281, "phrase": "hybrid_rfid_sensor_network_architecture"}, {"score": 0.015172220672198622, "phrase": "distribution_centres"}, {"score": 0.014357667347974022, "phrase": "rescue_equipment"}, {"score": 0.012260520036607596, "phrase": "humanitarian_supply_chain"}, {"score": 0.011531841485580192, "phrase": "humanitarian_logistics_centre"}, {"score": 0.00481495049065317, "phrase": "zigbee_rfid"}, {"score": 0.00477676183069697, "phrase": "humanitarian_logistics_centre_management"}, {"score": 0.004663995095505242, "phrase": "resource_management"}, {"score": 0.004617794630730795, "phrase": "typical_supply_chain"}, {"score": 0.004581162468419365, "phrase": "humanitarian_distribution_centre"}, {"score": 0.004544819575849435, "phrase": "hybrid_freight_types"}, {"score": 0.004341349148702215, "phrase": "site_staff"}, {"score": 0.004315487055548749, "phrase": "destabilized_operating_circumstances"}, {"score": 0.004298330938529755, "phrase": "swift_response"}, {"score": 0.004221964965920217, "phrase": "existing_technologies"}, {"score": 0.004171806400183634, "phrase": "diverse_needs"}, {"score": 0.00409767906535741, "phrase": "higher_cost"}, {"score": 0.004081385289516914, "phrase": "slower_implementation"}, {"score": 0.004000879233987927, "phrase": "hybrid_system_architecture"}, {"score": 0.003977037271626109, "phrase": "network_level"}, {"score": 0.003953336823885861, "phrase": "resource_information_management_system"}, {"score": 0.003937614732940086, "phrase": "humanitarian_logistics_centres"}, {"score": 0.0037837791091589433, "phrase": "flexible_solution"}, {"score": 0.0035784171859443792, "phrase": "local_environment"}, {"score": 0.0034180637905376504, "phrase": "research_method"}, {"score": 0.003370697077280661, "phrase": "participatory_design"}, {"score": 0.0033306180744375616, "phrase": "common_understanding"}, {"score": 0.0032975819773787985, "phrase": "possible_solutions"}, {"score": 0.0032004205378150354, "phrase": "end_users"}, {"score": 0.003187683149449344, "phrase": "current_technologies"}, {"score": 0.003149773381571644, "phrase": "general_logistics_centre"}, {"score": 0.0027889722809041092, "phrase": "warehouse_field_trial"}, {"score": 0.002706756048961313, "phrase": "old_systems"}, {"score": 0.0026480044868438875, "phrase": "complete_information"}, {"score": 0.002524196771318977, "phrase": "simple_and_flexible_network_architecture"}, {"score": 0.002415785882995862, "phrase": "possible_emergency_relocation"}, {"score": 0.0023398707854417294, "phrase": "system_development"}, {"score": 0.002156026732527872, "phrase": "significant_improvements"}, {"score": 0.0021431549235270903, "phrase": "overall_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distribution centre", " Humanitarian supply chain", " RFID", " Wireless Sensor Network"], "paper_abstract": "Purpose: Various information technologies have been designed to assist with the resource management of distribution centres in a typical supply chain. But the humanitarian distribution centre has its own characteristics including hybrid freight types (food, medicine and general living goods, as well as a need to track rescue equipment, vehicles and on-site staff), destabilized operating circumstances, swift response to emergencies, etc. None of the existing technologies can satisfy all of these diverse needs and the adoption of several different technologies may lead to higher cost, slower implementation and more complex integration. This paper seeks to design a hybrid system architecture at the network level for a resource information management system in humanitarian logistics centres. The aim of the design is to provide a complete, simple easy-to-implement and flexible solution for distribution centres in the humanitarian supply chain providing the ability to monitor all of their resources, including freights, rescue equipment, vehicles and people, as well as the local environment. Design/methodology/approach: The characteristics of a humanitarian logistics centre are investigated to capture the requirements for the design of a resource management system. The research method used adheres to the principle of participatory design (PD) where a common understanding of both the domain demands and the possible solutions across the disciplines can be achieved and continuously improved through the involvement of the end users. Current technologies used in the resource management system for general logistics centre are then studied. Two new concepts, \"passive RFID reader as a sensor\" and \"active tag as a sensor\", are used as basis for the design of a hybrid RFID sensor network architecture followed by a discussion of the implementation of such system architecture in a humanitarian logistics centre. A resource management system based on such architecture was developed and validated in both a laboratory environment and a warehouse field trial and the results of these trials are discussed. Findings: Compared to the old systems, the system using the hybrid RFID sensor network architecture is able to provide complete information for logistics centre resource management while the cost, complexity and time required for such a system implementation were significantly reduced as a result of the simple and flexible network architecture. In addition, the system can easily and quickly be removed and re-implemented in the event of a possible emergency relocation of the centre. Originality/value: The design of the hybrid RFID sensor network architecture is unique and the system development and evaluation have shown the feasibility and value of this approach. The work has demonstrated the completeness of information that the system can provide, as well as the flexibility of such a low cost but complete system which can lead to significant improvements in the overall performance of the humanitarian supply chain. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Hybrid Zigbee RFID sensor network for humanitarian logistics centre management", "paper_id": "WOS:000289137800014"}