{"auto_keywords": [{"score": 0.03951537737195524, "phrase": "additional_layer"}, {"score": 0.015719716506582538, "phrase": "long_synapses"}, {"score": 0.004780633011300165, "phrase": "guaranteed_latencies"}, {"score": 0.004746558955503364, "phrase": "large_neural_networks"}, {"score": 0.0046457802872573025, "phrase": "new_approach"}, {"score": 0.004563427013973105, "phrase": "randomly_interconnected_neural_networks"}, {"score": 0.0042943049090848825, "phrase": "long"}, {"score": 0.004263598390307789, "phrase": "short"}, {"score": 0.0036947814248579243, "phrase": "hierarchical_structures"}, {"score": 0.0036684182697540382, "phrase": "networks_on_chip"}, {"score": 0.0035904480418810837, "phrase": "connection_scheme"}, {"score": 0.0033542722986970265, "phrase": "circuit_switching"}, {"score": 0.0032712190037495975, "phrase": "interconnection_scheme"}, {"score": 0.0031223774204093713, "phrase": "neuronal_network"}, {"score": 0.003100085797251317, "phrase": "grid_structure_arrangement"}, {"score": 0.0029909851863915283, "phrase": "firing_rate"}, {"score": 0.002610198789888055, "phrase": "grouped_neurons"}, {"score": 0.0022696277881969896, "phrase": "complete_operation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Circuit switching", " Guaranteed latency", " Network on chip", " Randomly interconnected neuronal networks", " Spiking neural network"], "paper_abstract": "This paper introduces a new approach for the implementation of randomly interconnected neural networks on hardware taking into account the length of the synapses. We divide the synapses into Long and Short according to the distance between the source and target neurons in a 2D mesh, and we demonstrate that it is possible to guarantee the latency of the Long synapses when they are routed through an additional layer which is based on hierarchical structures of Networks on Chip (NoC). The connection scheme consists in grouping neurons into four regions and communicating their sets of synapses between a pair of them, using circuit switching. In order to validate the interconnection scheme, we simulated the operation of this additional layer for two regions in a neuronal network with grid structure arrangement comprising 1.03 x 10(6) neurons, with a firing rate of 100 Hz and an average of 10(4) synapses per neuron. This pair of regions can support an average of 562 Long synapses per neuron, which is equivalent to managing 5% of the traffic generated by the grouped neurons, with the advantage of having the latency of the synapses guaranteed. A node of the one region has 30,528 neurons and operates with a throughput of 2.95 Millions of spikes per second (Mspk/s) approximately. In a complete operation, the additional layer has four regions and it would support 58 Mspk/s and 520,672 neurons of the network. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A model for communicating long synapses with guaranteed latencies on large neural networks", "paper_id": "WOS:000362606700033"}