{"auto_keywords": [{"score": 0.04975714855421353, "phrase": "umls_source_integration"}, {"score": 0.038107341892635066, "phrase": "wordnet"}, {"score": 0.030068768791252688, "phrase": "synonym-substitution_methodology"}, {"score": 0.00481495049065317, "phrase": "wordnet_synonym_substitution"}, {"score": 0.004740076426055645, "phrase": "synonym-substitution_algorithms"}, {"score": 0.0046455100886251535, "phrase": "source_vocabulary_terms"}, {"score": 0.004522336570662195, "phrase": "possible_explosion"}, {"score": 0.004422179351310403, "phrase": "computational_and_expert_review_resources"}, {"score": 0.0043533862892678864, "phrase": "synonym-substitution_approach"}, {"score": 0.003892039911310129, "phrase": "marked_decline"}, {"score": 0.0038659620645797137, "phrase": "additional_matches"}, {"score": 0.003638957196655354, "phrase": "four-stage_synonym-substitution_methodology"}, {"score": 0.00345609074800888, "phrase": "\"maximum_term_length"}, {"score": 0.003180938052232752, "phrase": "\"minimal_standard_terminology"}, {"score": 0.0031313934668702305, "phrase": "umls._synonym-substitution_matches"}, {"score": 0.003082618175016222, "phrase": "current_content"}, {"score": 0.0030619483949318655, "phrase": "umls"}, {"score": 0.002954012541487203, "phrase": "original_integration"}, {"score": 0.0029342012486563776, "phrase": "mst._results"}, {"score": 0.0027866514486229637, "phrase": "tight_threshold_values"}, {"score": 0.00257041953177942, "phrase": "performance_enhancement"}, {"score": 0.0025474514996697644, "phrase": "additional_audit_phase"}, {"score": 0.002513382718220154, "phrase": "reported_mismatches"}, {"score": 0.0023656111509970604, "phrase": "useful_automated_aide"}, {"score": 0.0023131084326717755, "phrase": "significant_speed-up"}, {"score": 0.0022668507535947976, "phrase": "methodology's_\"maximum_number"}, {"score": 0.0021624739899833868, "phrase": "mst's_original_integration"}, {"score": 0.0021239851029066087, "phrase": "umls's_conceptual_content"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["UMLS", " Source integration", " WordNet", " Synonym substitution", " Synonym generation", " Synonymy", " Integration audit"], "paper_abstract": "Objective: Synonym-substitution algorithms have been developed for the purpose of matching source vocabulary terms with existing Unified Medical Language System (UMLS) terms during the integration process. A drawback is the possible explosion in the number of newly generated (potential) synonyms, which can tax computational and expert review resources. Experiments are run using a synonym-substitution approach based on WordNet to see how constraining two methodological parameters, namely, \"maximum number of substitutions per term\" and \"maximum term length,\" affects performance. Our hypothesis is that these values can be constrained rather tightly-thus greatly speeding up the methodology-without a marked decline in the additional matches produced. Furthermore, we investigate whether a limitation on only the first of the two parameters is sufficient to achieve the same results. Methods: A four-stage synonym-substitution methodology using WordNet is presented. A group of experiments is carried out in which the two methodological parameters \"maximum number of substitutions per term\" and \"maximum term length\" are varied. The purpose is to examine their effect on the growth in the number of potential synonyms generated and the associated toss of results. The experiments are based on the re-integration of the \"Minimal Standard Terminology\" (MST) into the UMLS. Synonym-substitution matches found to be inconsistent with the current content of the UMLS and thus deemed to be incorrect are further manually scrutinized as an audit of the original integration of the MST. Results: An increase of 11% in the number of \"MST term/UMLS term\" matches was achieved using the synonym-substitution methodology. Importantly, this result prevailed when tight threshold values (such as a maximum of two synonym substitutions per term) were imposed on the parameters. Furthermore, it was found that limiting only the \"maximum number of substitutions per term\" parameter was sufficient to obtain the performance enhancement. During the additional audit phase, a number of the reported mismatches were actually seen to be correct, representing an additional 10% increase in the number of matches obtained. Conclusion: A synonym-substitution methodology that utilizes WordNet is a useful automated aide in UMLS source integration. Experiments showed that there was a significant speed-up but no degradation in match results when the methodology's \"maximum number of substitutions per term\" parameter was relatively tightly constrained. The methodology also helped to discover errors in the MST's original integration, and improve the quality of the UMLS's conceptual content. Published by Elsevier B.V.", "paper_title": "Using WordNet synonym substitution to enhance UMLS source integration", "paper_id": "WOS:000267115700001"}