{"auto_keywords": [{"score": 0.04447615312841563, "phrase": "inductive_and_coinductive_types"}, {"score": 0.007807881873425904, "phrase": "non-deterministic_dual_calculus"}, {"score": 0.005575661345803421, "phrase": "second-order_dual_calculus"}, {"score": 0.00481495049065317, "phrase": "inductive_and_coinductive_types."}, {"score": 0.004652016085325825, "phrase": "dual_calculus"}, {"score": 0.004588389551682397, "phrase": "inductive_types"}, {"score": 0.004525629293824217, "phrase": "coinductive_types"}, {"score": 0.004053362743156545, "phrase": "original_dual_calculus"}, {"score": 0.0027741761880779535, "phrase": "second-order_symmetric_lambda_calculus"}, {"score": 0.002643386043540555, "phrase": "call-by-value_system"}, {"score": 0.0025892330566358503, "phrase": "call-by-name_system"}, {"score": 0.0021639309447095767, "phrase": "church-rosser"}], "paper_keywords": ["Curry-Howard isomorphism", " Classical logic", " Dual Calculus", " Inductive definitions", " Coinductive definitions"], "paper_abstract": "This paper extends the dual calculus with inductive types and coinductive types. The paper first introduces a non-deterministic dual calculus with inductive and coinductive types. Besides the same duality of the original dual calculus, it has the duality of inductive and coinductive types, that is, the duality of terms and coterms for inductive and coinductive types, and the duality of their reduction rules. Its strong normalization is also proved, which is shown by translating it into a second-order dual calculus. The strong normalization of the second-order dual calculus is proved by translating it into the second-order symmetric lambda calculus. This paper then introduces a call-by-value system and a call-by-name system of the dual calculus with inductive and coinductive types, and shows the duality of call-by-value and call-by-name, their Church-Rosser properties, and their strong normalization. Their strong normalization is proved by translating them into the non-deterministic dual calculus with inductive and coinductive types.", "paper_title": "CALL-BY-VALUE AND CALL-BY-NAME DUAL CALCULI WITH INDUCTIVE AND COINDUCTIVE TYPES", "paper_id": "WOS:000317894100014"}