{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hexahedral_meshes"}, {"score": 0.04962396550254858, "phrase": "patient-specific_abdominal_aortic_aneurysms"}, {"score": 0.04570540673399683, "phrase": "medical_images"}, {"score": 0.028124342668400446, "phrase": "fe_analysis"}, {"score": 0.004546755482549647, "phrase": "finite_element"}, {"score": 0.004272969980602508, "phrase": "suitable_elements"}, {"score": 0.004172094622123562, "phrase": "semi-automatic_method"}, {"score": 0.004112711391952791, "phrase": "conforming_hexahedral"}, {"score": 0.003939565240409143, "phrase": "magnetic_resonance_images"}, {"score": 0.0037199473428123175, "phrase": "high_contrast"}, {"score": 0.0036669760226536977, "phrase": "surrounding_soft_tissue"}, {"score": 0.00349577373145384, "phrase": "different_structures"}, {"score": 0.00326939082861424, "phrase": "sectioned_geometry"}, {"score": 0.003087017178815267, "phrase": "three-layered_morphology"}, {"score": 0.002687070469080394, "phrase": "high-quality_elements"}, {"score": 0.0025861368747446324, "phrase": "bifurcation_region"}, {"score": 0.002512926336312949, "phrase": "iliac_arteries"}, {"score": 0.0022617389804167943, "phrase": "novel_input"}], "paper_keywords": ["Magnetic resonance imaging", " Abdominal aortic aneurysm", " Intraluminal thrombus", " Conforming hexahedral meshes", " Finite element analysis"], "paper_abstract": "In order to perform finite element (FE) analyses of patient-specific abdominal aortic aneurysms, geometries derived from medical images must be meshed with suitable elements. We propose a semi-automatic method for generating conforming hexahedral meshes directly from contours segmented from medical images. Magnetic resonance images are generated using a protocol developed to give the abdominal aorta high contrast against the surrounding soft tissue. These data allow us to distinguish between the different structures of interest. We build novel quadrilateral meshes for each surface of the sectioned geometry and generate conforming hexahedral meshes by combining the quadrilateral meshes. The three-layered morphology of both the arterial wall and thrombus is incorporated using parameters determined from experiments. We demonstrate the quality of our patient-specific meshes using the element Scaled Jacobian. The method efficiently generates high-quality elements suitable for FE analysis, even in the bifurcation region of the aorta into the iliac arteries. For example, hexahedral meshes of up to 125,000 elements are generated in less than 130 s, with 94.8 % of elements well suited for FE analysis. We provide novel input for simulations by independently meshing both the arterial wall and intraluminal thrombus of the aneurysm, and their respective layered morphologies.", "paper_title": "High-quality conforming hexahedral meshes of patient-specific abdominal aortic aneurysms including their intraluminal thrombi", "paper_id": "WOS:000330808500007"}