{"auto_keywords": [{"score": 0.01509365405069706, "phrase": "first-order_theory"}, {"score": 0.004818773716668806, "phrase": "bounds"}, {"score": 0.004496280772084575, "phrase": "equivalent_propositional_theory"}, {"score": 0.004374772264092067, "phrase": "preprocessing_phase"}, {"score": 0.0042178318724732005, "phrase": "rich_first-order_input_language"}, {"score": 0.004066498558415824, "phrase": "efficient_propositional_solvers"}, {"score": 0.0039928721865882, "phrase": "actual_reasoning"}, {"score": 0.003711409222544974, "phrase": "also_additional_data"}, {"score": 0.003356396922662246, "phrase": "common_practice"}, {"score": 0.0031339552246625463, "phrase": "semantically_redundant_information"}, {"score": 0.003091262582401731, "phrase": "input_theory"}, {"score": 0.0026461080202599694, "phrase": "input_theories"}, {"score": 0.0025627194819793347, "phrase": "current_systems"}, {"score": 0.0024819522818492284, "phrase": "classical_first-order_logic"}, {"score": 0.002275318238366854, "phrase": "fo"}, {"score": 0.002254571365634257, "phrase": "inductive_definitions"}, {"score": 0.0021049977753042253, "phrase": "practical_applicability"}], "paper_keywords": [""], "paper_abstract": "Grounding is the task of reducing a first-order theory and finite domain to an equivalent propositional theory. It is used as preprocessing phase in many logic-based reasoning systems. Such systems provide a rich first-order input language to a user and can rely on efficient propositional solvers to perform the actual reasoning. Besides a first-order theory and finite domain, the input for grounders contains in many applications also additional data. By exploiting this data, the size of the grounder's out put can often be reduced significantly. A common practice to improve the efficiency of a grounder in this context is by manually adding semantically redundant information to the input theory, indicating where and when the grounder should exploit the data. In this paper we present a method to compute and add such redundant information automatically. Our method therefore simplifies the task of writing input theories that can be grounded efficiently by current systems. We first present our method for classical first-order logic (FO) theories. Then we extend it to FO (ID), the extension of FO with inductive definitions, which allows for more concise and comprehensive input theories. We discuss implementation issues and experimentally validate the practical applicability of our method.", "paper_title": "Grounding FO and FO (ID) with Bounds", "paper_id": "WOS:000278755500005"}