{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "prior_work"}, {"score": 0.028923900272745124, "phrase": "source_rate"}, {"score": 0.00481495049065317, "phrase": "network_codes_resilient"}, {"score": 0.0047436169162382545, "phrase": "eavesdropping"}, {"score": 0.004620957579769604, "phrase": "communicating_information"}, {"score": 0.004418192459607072, "phrase": "hidden_adversary"}, {"score": 0.004320156581220516, "phrase": "malicious_errors"}, {"score": 0.004256005669252138, "phrase": "polynomial-time_distributed_network_codes"}, {"score": 0.003934456513187142, "phrase": "ngai_et_al"}, {"score": 0.0033370841436001597, "phrase": "network_capacity"}, {"score": 0.0030617295196636173, "phrase": "vanishingly_small_error_probability"}, {"score": 0.00264561514767961, "phrase": "security_requirements"}, {"score": 0.002463830258460528, "phrase": "communicated_message"}, {"score": 0.0024000447011533078, "phrase": "interior_nodes"}, {"score": 0.002311769781106355, "phrase": "random_linear_network_coding"}], "paper_keywords": ["Achievable rates", " adversary", " error control", " network coding", " secrecy"], "paper_abstract": "We consider the problem of communicating information over a network secretly and reliably in the presence of a hidden adversary who can eavesdrop and inject malicious errors. We provide polynomial-time distributed network codes that are information-theoretically rate-optimal for this scenario, improving on the rates achievable in prior work by Ngai et al. Our main contribution shows that as long as the sum of the number of links the adversary can jam (denoted by Z(O)) and the number of links he can eavesdrop on (denoted by Z(I)) is less than the network capacity (denoted by C) (i.e., Z(O) + Z(I) < C), our codes can communicate (with vanishingly small error probability) a single bit correctly and without leaking any information to the adversary. We then use this scheme as a module to design codes that allow communication at the source rate of C - Z(O) when there are no security requirements, and codes that allow communication at the source rate of C - Z(O) - Z(I) while keeping the communicated message provably secret from the adversary. Interior nodes are oblivious to the presence of adversaries and perform random linear network coding; only the source and destination need to be tweaked. We also prove that the rate-region obtained is information-theoretically optimal. In proving our results, we correct an error in prior work by a subset of the authors in this paper.", "paper_title": "Network Codes Resilient to Jamming and Eavesdropping", "paper_id": "WOS:000346796000022"}