{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "different_corporate_cultural_types"}, {"score": 0.004687645903373103, "phrase": "previous_studies"}, {"score": 0.004523103062368843, "phrase": "information_systems"}, {"score": 0.004383852039913171, "phrase": "future_research"}, {"score": 0.004267896572751978, "phrase": "different_contexts"}, {"score": 0.003920476803132283, "phrase": "mclean_model"}, {"score": 0.003601235776892337, "phrase": "system_success"}, {"score": 0.002931569771634119, "phrase": "strong_support"}, {"score": 0.0028924840289020906, "phrase": "research_model"}, {"score": 0.0026806139086152365, "phrase": "corporate_culture"}, {"score": 0.0024620842899061614, "phrase": "greater_impact"}, {"score": 0.0023754752864092437, "phrase": "entrepreneurial_corporate_culture"}, {"score": 0.0023021895404322767, "phrase": "formal_corporate_culture"}, {"score": 0.002172022233163906, "phrase": "mclean"}, {"score": 0.0021049977753042253, "phrase": "diverse_corporate_cultural_types"}], "paper_keywords": ["corporate culture", " impact of information systems use", " information systems success", " information technology plan quality"], "paper_abstract": "Previous studies surrounding the DeLone and McLean model of information systems (IS) success have called for future research and further examination of its measure in different contexts. We draw from the literature on strategic IS planning and organizational culture to contextualize the DeLone and McLean model. There is some evidence that a high-quality information technology (IT) plan leads to system success; therefore, we empirically examine the inclusion of the IT plan quality construct as an antecedent to IS success. We also empirically examine the relationships among constructs in the model of IS success in the context of different corporate cultural types-entrepreneurial and formal. The results provide strong support for the research model and suggest that variations in IS success are explained by the quality of the IT plan and the corporate culture exhibited by a firm. We discuss implications related to our finding that IT plan quality has a greater impact on IS success in organizations that exhibit an entrepreneurial corporate culture than in those that exhibit a formal corporate culture. Furthermore, we discuss how the relationships in the DeLone and McLean model of IS success differ in diverse corporate cultural types and the meaning of these differences.", "paper_title": "Information systems success in the context of different corporate cultural types: An empirical investigation", "paper_id": "WOS:000241879900012"}