{"auto_keywords": [{"score": 0.04472882712454684, "phrase": "reynolds_number"}, {"score": 0.013332884915839935, "phrase": "mach_number"}, {"score": 0.00481495049065317, "phrase": "wall-mounted_cubic_obstacle"}, {"score": 0.0038638811223100184, "phrase": "flow_field"}, {"score": 0.003470358620464986, "phrase": "side_walls"}, {"score": 0.0032888418378433037, "phrase": "downstream_upper-half"}, {"score": 0.0031845067058084583, "phrase": "downstream_wake"}, {"score": 0.0030178961017306646, "phrase": "flow_features"}, {"score": 0.002875391177926809, "phrase": "higher_reynolds_numbers"}, {"score": 0.0027991418754844347, "phrase": "wake_region"}, {"score": 0.0027395968397212053, "phrase": "significantly_larger_area"}, {"score": 0.0025822818714499795, "phrase": "attachment_point"}, {"score": 0.0023950275815082297, "phrase": "fixed_reynolds_number"}, {"score": 0.0022941723937662927, "phrase": "reduced_size"}, {"score": 0.002174041708084857, "phrase": "horseshoe_vortex"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The fully-compressible, viscous and non-stationary Navier-Stokes equations are solved for the subsonic flow over a block placed oil the floor of a channel. The Reynolds number is varied from 50 to 250. The Mach number is varied between 0.1 and 0.6. In all cases studied the flow field proves to be steady. Several distinct flow features are identified: a horseshoe vortex system, inward bending flow at the side walls of the obstacle, a horizontal vortex at the downstream upper-half of the obstacle and a downstream wake containing two counter-rotating vortices. The shape and size of these flow features are mainly dominated by the Reynolds number. For higher Reynolds numbers, both the horseshoe vortex and the wake region extend over a significantly larger area. The correlation of the position of the separation and attachment point with the Reynolds number has been calculated. Increasing the Mach number (at a fixed Reynolds number of 150) shows its influence in the reduced size, due to compression, of both the wake region and the horseshoe vortex. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Compressible laminar flow around a wall-mounted cubic obstacle", "paper_id": "WOS:000245571500010"}