{"auto_keywords": [{"score": 0.029251789737065388, "phrase": "pyrohmmvar"}, {"score": 0.015719716506582538, "phrase": "short_indels"}, {"score": 0.015447321965512014, "phrase": "ion_torrent"}, {"score": 0.004546174820239776, "phrase": "short_insertions"}, {"score": 0.004407690586271672, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.004217110862974562, "phrase": "challenging_problem"}, {"score": 0.003759142310009214, "phrase": "existing_mapping_programs"}, {"score": 0.0036932254391253134, "phrase": "homopolymer_errors"}, {"score": 0.00354909279546064, "phrase": "resulting_alignments"}, {"score": 0.003365598242636633, "phrase": "accurate_determination"}, {"score": 0.003335948601271999, "phrase": "variant_loci"}, {"score": 0.0029602552900111407, "phrase": "pairwise_alignments"}, {"score": 0.0029212075318449616, "phrase": "weighted_alignment_graph"}, {"score": 0.0028446460307503343, "phrase": "hidden_markov_model"}, {"score": 0.0026036031415940563, "phrase": "human_resequencing_data"}, {"score": 0.002512990657100351, "phrase": "simulated_diploid_datasets"}, {"score": 0.0023101951336207955, "phrase": "samtools"}, {"score": 0.0022898220010285583, "phrase": "gatk"}, {"score": 0.0022101055924375725, "phrase": "parameter_settings"}], "paper_keywords": [""], "paper_abstract": "Motivation: The identification of short insertions and deletions (indels) and single nucleotide polymorphisms (SNPs) from Ion Torrent and 454 reads is a challenging problem, essentially because these techniques are prone to sequence erroneously at homopolymers and can, therefore, raise indels in reads. Most of the existing mapping programs do not model homopolymer errors when aligning reads against the reference. The resulting alignments will then contain various kinds of mismatches and indels that confound the accurate determination of variant loci and alleles. Results: To address these challenges, we realign reads against the reference using our previously proposed hidden Markov model that models homopolymer errors and then merges these pairwise alignments into a weighted alignment graph. Based on our weighted alignment graph and hidden Markov model, we develop a method called PyroHMMvar, which can simultaneously detect short indels and SNPs, as demonstrated in human resequencing data. Specifically, by applying our methods to simulated diploid datasets, we demonstrate that PyroHMMvar produces more accurate results than state-of-the-art methods, such as Samtools and GATK, and is less sensitive to mapping parameter settings than the other methods. We also apply PyroHMMvar to analyze one human whole genome resequencing dataset, and the results confirm that PyroHMMvar predicts SNPs and indels accurately.", "paper_title": "PyroHMMvar: a sensitive and accurate method to call short indels and SNPs for Ion Torrent and 454 data", "paper_id": "WOS:000326643600007"}