{"auto_keywords": [{"score": 0.04725836981129391, "phrase": "combinatorial_reverse_auctions"}, {"score": 0.010612387000973441, "phrase": "group-buying-based_combinatorial_reverse_auctions"}, {"score": 0.007112907831393017, "phrase": "computational_efficiency"}, {"score": 0.005175797035544486, "phrase": "multiple_independent_combinatorial_reverse_auctions"}, {"score": 0.004688894532233354, "phrase": "popular_business_model"}, {"score": 0.004600870784042767, "phrase": "multiple_buyers"}, {"score": 0.0038352452380298464, "phrase": "group-buying_model"}, {"score": 0.00373474182086791, "phrase": "overall_cost"}, {"score": 0.0036784938661226104, "phrase": "required_items"}, {"score": 0.003501452436803395, "phrase": "high_computational_complexity"}, {"score": 0.002985484575498061, "phrase": "aforementioned_two_different_combinatorial_reverse_auction_models"}, {"score": 0.0023771343615901185, "phrase": "group-buying-based_combinatorial_reverse_auction"}, {"score": 0.0022284577808744316, "phrase": "non-uniform_scheme"}, {"score": 0.002153540857619362, "phrase": "based_combinatorial_reverse_auctions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Group-buying", " Integer programming", " Combinatorial reverse auctions", " Procurement"], "paper_abstract": "Combinatorial reverse auctions represent a popular business model in procurement. For multiple buyers, different procurement models based on combinatorial reverse auctions may be applied. For example, each buyer may hold one combinatorial reverse auction independently. Alternatively, the buyers may delegate the auction to a group-buyer and let the group-buyer hold only one combinatorial reverse auction on behalf of all the buyers. A combination of a combinatorial reverse auctions with the group-buying model makes it possible to reduce the overall cost to acquire the required items significantly due to complementarities between items. However, combinatorial reverse auctions suffer from high computational complexity. To assess the advantage of combining group-buying with combinatorial reverse auctions, three issues must be addressed, including performance, computational efficiency and the scheme to reward the buyers. This motivates us to compare the performance and efficiency of the aforementioned two different combinatorial reverse auction models and to study the possible schemes to reward the buyers. To achieve these objectives, we first illustrate the advantage of group-buying-based combinatorial reverse auctions over multiple independent combinatorial reverse auctions. We then formulate the problems for these two combinatorial reverse auction models and propose solution algorithms for them. We compare performance and computational efficiency for these two combinatorial reverse auction models. Our analysis indicates that a group-buying-based combinatorial reverse auction not only outperforms multiple independent combinatorial reverse auctions but also is more efficient than multiple independent combinatorial reverse auctions. We also propose a non-uniform scheme to reward the buyers in group-buying based combinatorial reverse auctions. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Assessing the benefits of group-buying-based combinatorial reverse auctions", "paper_id": "WOS:000308066000009"}