{"auto_keywords": [{"score": 0.04151111040011756, "phrase": "homological_reduction_method"}, {"score": 0.03769201191873028, "phrase": "heuristic_search"}, {"score": 0.03737634241271663, "phrase": "hadamard_cocyclic_matrices"}, {"score": 0.00481495049065317, "phrase": "cocyclic_hadamard_matrices"}, {"score": 0.00475254914916922, "phrase": "alternate_method"}, {"score": 0.004650330504968421, "phrase": "cocyclic_matrices"}, {"score": 0.004590052784169268, "phrase": "finite_group"}, {"score": 0.0038906171474520756, "phrase": "full_basis"}, {"score": 0.0034143003168921114, "phrase": "explicit_basis"}, {"score": 0.0032974089700312423, "phrase": "key_point"}, {"score": 0.0029701328654852246, "phrase": "exhaustive_searching_techniques"}, {"score": 0.002880927789104712, "phrase": "computational-cost_point"}, {"score": 0.0025279105573394727, "phrase": "required_computing_time"}, {"score": 0.002357632753637638, "phrase": "previous_calculations"}, {"score": 0.002208490157776562, "phrase": "mathematica"}], "paper_keywords": ["Homological model", " Integer Smith normal form", " Cocyclic matrix", " Hadamard matrix"], "paper_abstract": "An alternate method for constructing (Hadamard) cocyclic matrices over a finite group G is described. Provided that a homological model (phi:) (B) over bar (Z vertical bar G vertical bar) (F)reversible arrow(H) hG for G is known, the homological reduction method automatically generates a full basis for 2-cocycles over G (including 2-coboundaries). From these data, either an exhaustive or a heuristic search for Hadamard cocyclic matrices is then developed. The knowledge of an explicit basis for 2-cocycles which includes 2-coboundaries is a key point for the designing of the heuristic search. It is worth noting that some Hadamard cocyclic matrices have been obtained over groups G for which the exhaustive searching techniques are not feasible. From the computational-cost point of view, even in the case that the calculation of such a homological model is also included, comparison with other methods in the literature shows that the homological reduction method drastically reduces the required computing time of the operations involved, so that even exhaustive searches succeeded at orders for which previous calculations could not be completed. With aid of an implementation of the method in MATHEMATICA, some examples are discussed, including the case of very well-known groups (finite abelian groups, dihedral groups) for clarity. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The homological reduction method for computing cocyclic Hadamard matrices", "paper_id": "WOS:000264679300013"}