{"auto_keywords": [{"score": 0.04907049129770542, "phrase": "different_turn-taking_strategies"}, {"score": 0.00481495049065317, "phrase": "agents'_turn-taking_strategies_influence_impressions"}, {"score": 0.004095323392273661, "phrase": "first_study"}, {"score": 0.003858110309630846, "phrase": "second_study"}, {"score": 0.003760685138103153, "phrase": "artificial_interviewer"}, {"score": 0.003512702405367876, "phrase": "semantic_differential_scales"}, {"score": 0.003423969509052361, "phrase": "social_skill"}, {"score": 0.002886885861509621, "phrase": "subjects'_behavior"}, {"score": 0.0028139168128067343, "phrase": "subjects'_speech"}, {"score": 0.002617007341172262, "phrase": "user's_perception"}, {"score": 0.002465210678474529, "phrase": "negative_and_strong_personality_attributes"}, {"score": 0.0021049977753042253, "phrase": "turn-taking_strategies"}], "paper_keywords": [""], "paper_abstract": "Different turn-taking strategies of an agent influence the impression that people have of it and the behaviors that they display in response. To study these influences, we carried out several studies. In the first study, subjects listened as bystanders to computer-generated, unintelligible conversations between two speakers. In the second study, subjects talked to an artificial interviewer which was controlled by a human in a Wizard of Oz setting. Questionnaires with semantic differential scales concerning personality, emotion, social skill, and interviewing skills were used in both studies to assess the impressions that the subjects have of the agents that carried out different turn-taking strategies. In addition, in order to assess the effects of these strategies on the subjects' behavior we measured several aspects in the subjects' speech, such as speaking rate and turn length. We found that different turn-taking strategies indeed influence the user's perception. Starting too early (interrupting the user) is mostly associated with negative and strong personality attributes and is perceived as less agreeable and more assertive. Leaving pauses between turns is perceived as more agreeable, less assertive, and creates the feeling of having more rapport. Finally, we found that turn-taking strategies also influence the subjects' speaking behavior", "paper_title": "How Agents' Turn-Taking Strategies Influence Impressions and Response Behaviors", "paper_id": "WOS:000300527200003"}