{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personalised_insoles"}, {"score": 0.049465088868450476, "phrase": "high_street"}, {"score": 0.04906009284763672, "phrase": "additive_manufacturing"}, {"score": 0.030809208723928477, "phrase": "discomfort_ratings"}, {"score": 0.004456044928556639, "phrase": "personalised_footwear"}, {"score": 0.004123781267600542, "phrase": "lower_extremity_biomechanics"}, {"score": 0.003967021436047945, "phrase": "five_elements"}, {"score": 0.0036710872046569532, "phrase": "physical_biomechanical_evaluation"}, {"score": 0.003531474887552889, "phrase": "recreational_runners"}, {"score": 0.003296212583539166, "phrase": "scan_data"}, {"score": 0.0028468767420392945, "phrase": "main_advantage"}, {"score": 0.002668582249630492, "phrase": "foot_scans"}, {"score": 0.0025780912201045555, "phrase": "last_and_mould"}, {"score": 0.0024906610581090223, "phrase": "statistical_analysis"}, {"score": 0.0024586427394152196, "phrase": "significant_differences"}, {"score": 0.002236055625099805, "phrase": "personalised_condition"}, {"score": 0.0022073031056287903, "phrase": "short_period"}, {"score": 0.0021232402128269906, "phrase": "comfortable_personalised_insoles"}], "paper_keywords": ["footwear design", " anthropometry", " reverse engineering", " additive manufacturing"], "paper_abstract": "Research was undertaken to explore a process that delivers insoles for personalised footwear to the high street using additive manufacturing (AM) and to evaluate such insoles in terms of discomfort and lower extremity biomechanics. During the development of the process, five elements were identified: foot capture, anthropometric measurements, insole design, manufacture of the parts and physical biomechanical evaluation. In order to evaluate the process, recreational runners were recruited. They had 15 anthropometric measurements of the foot taken and both feet scanned. Scan data enabled personalised insoles to be designed and manufactured. Participants were fitted with footwear under two conditions: personalised and control insoles. Both conditions were evaluated in terms of discomfort ratings and biomechanics. The main advantage of the process is that it is possible to design footwear based on the foot scans, without the need to construct a last and mould for every consumer. In fact, statistical analysis indicated no significant differences between the two conditions for discomfort ratings and only one biomechanical parameter, midfoot peak mean pressure, was found to be significantly higher for the personalised condition for a short period of usage. The results suggest that producing comfortable personalised insoles using AM technique shows potential.", "paper_title": "Delivering personalised insoles to the high street using additive manufacturing", "paper_id": "WOS:000319325500001"}