{"auto_keywords": [{"score": 0.04549657143943836, "phrase": "proposed_packing_algorithm"}, {"score": 0.03681703781612336, "phrase": "packing_algorithm"}, {"score": 0.00481495049065317, "phrase": "iso_luggage_packing"}, {"score": 0.004634459424542272, "phrase": "compact_packing_algorithm"}, {"score": 0.004252602474733162, "phrase": "three-dimensional_free-form_objects"}, {"score": 0.00409310463335204, "phrase": "packing_efficiency"}, {"score": 0.003413183361838603, "phrase": "tessellated_geometry"}, {"score": 0.00276534038425712, "phrase": "improved_layout_algorithm"}, {"score": 0.0027129118211250336, "phrase": "arbitrary_container_geometry"}, {"score": 0.002648768009464535, "phrase": "separate_layout_algorithms"}, {"score": 0.002611014372559074, "phrase": "sae"}, {"score": 0.0025861368747446324, "phrase": "iso_luggage"}, {"score": 0.0023613185213421173, "phrase": "fast_and_efficient_handling"}, {"score": 0.002327648608736437, "phrase": "computer_aided_design"}, {"score": 0.0022188370388602813, "phrase": "comprehensive_benchmarking"}, {"score": 0.002166349705365602, "phrase": "synthetic_and_hypothetical_problems"}], "paper_keywords": [""], "paper_abstract": "In this paper, a compact packing algorithm for the placement of objects inside a container is described. The proposed packing algorithm is designed to pack three-dimensional free-form objects inside an arbitrary enclosure such that the packing efficiency is maximized. The proposed packing algorithm can handle objects with holes or cavities, and its performance does not degrade significantly with the increase in complexity of the enclosure or the objects. The packing algorithm takes as input the tessellated geometry of the container and all the objects to be packed and outputs the list of objects that can be placed inside the enclosure. The packing algorithm also outputs the location and orientation of all the objects, the packing sequence, and the packed configuration. An improved layout algorithm that works with arbitrary container geometry is also proposed. Separate layout algorithms for the SAE and ISO luggage are developed. Several heuristics to improve the performance of the packing algorithm are also incorporated. Certain aspects that facilitate fast and efficient handling of the computer aided design (CAD) data are also discussed. A comprehensive benchmarking of the proposed packing algorithm on synthetic and hypothetical problems reflects its superior performance as compared with other similar approaches. [DOI: 10.1115/1.3330440]", "paper_title": "A Fast and Efficient Compact Packing Algorithm for SAE and ISO Luggage Packing Problems", "paper_id": "WOS:000278575300010"}