{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "express_schemas"}, {"score": 0.0045318666714939905, "phrase": "semantic_enabler"}, {"score": 0.004126623209579942, "phrase": "underlying_principles"}, {"score": 0.003841263262252044, "phrase": "building_information_modeling_domain"}, {"score": 0.003478321590910367, "phrase": "industry_foundation_classes"}, {"score": 0.0033465923623290034, "phrase": "modeling_information"}, {"score": 0.0032376465741070274, "phrase": "express_family"}, {"score": 0.003097865379563127, "phrase": "logically_rigid_and_semantically_enhanced_ontological_level"}, {"score": 0.002947790697936243, "phrase": "added_value"}, {"score": 0.002883439044844259, "phrase": "building_models"}, {"score": 0.00280496585980086, "phrase": "generic_query"}, {"score": 0.002363806685815014, "phrase": "underlying_resource_description_framework"}, {"score": 0.002163930783583212, "phrase": "distributed_collaborative_work"}, {"score": 0.0021049977753042253, "phrase": "construction_industry"}], "paper_keywords": ["Building Information Modeling", " Knowledge Representation", " Model-Driven Architectures", " Ontologies"], "paper_abstract": "Ontologies have been successfully applied as a semantic enabler of communication between both users and applications in fragmented, heterogeneous multinational business environments. In this paper we discuss the underlying principles, their Current implementation status, and most importantly, their applicability to problems in the building information modeling domain. We introduce the development of an ontology for the building and construction sector based on the industry foundation classes. We discuss several approaches of lifting modeling information that is based on the express family of languages for data modeling onto a logically rigid and semantically enhanced ontological level encoded in the W3C Ontology Web Language. We exemplify the added value of such formal notation of building models by providing several examples where generic query and reasoning algorithms can be applied to problems that otherwise have to be manually hard-wired into applications for processing building information. Furthermore, we show how the underlying resource description framework and the set of technologies evolving around it can be tailored to the need of distributed collaborative work in the building and construction industry.", "paper_title": "IfcOWL: A case of transforming EXPRESS schemas into ontologies", "paper_id": "WOS:000262050200007"}