{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_computation_games"}, {"score": 0.004551647527068771, "phrase": "human_intelligence"}, {"score": 0.003928834302530914, "phrase": "different_types"}, {"score": 0.003895009798180981, "phrase": "hcg"}, {"score": 0.0038613835226952117, "phrase": "players'_perceptions"}, {"score": 0.003697760799674494, "phrase": "different_players"}, {"score": 0.003618558599449415, "phrase": "good_hcg_design"}, {"score": 0.0035564156572789473, "phrase": "present_research"}, {"score": 0.003480230347985338, "phrase": "image_tagging_hcgs"}, {"score": 0.002718627370925435, "phrase": "users'_perceptions"}, {"score": 0.0026146109167103655, "phrase": "motivational_needs"}, {"score": 0.0025920406425973368, "phrase": "usage_intention"}, {"score": 0.0024713335323674223, "phrase": "collaborative_and_competitive_hcgs"}, {"score": 0.0024393978073660757, "phrase": "control_application"}, {"score": 0.0023460397258997525, "phrase": "better_quality_tags"}, {"score": 0.0021982976170703884, "phrase": "individual's_need"}], "paper_keywords": ["Human computation games", " image tagging", " playability", " quality", " motivations", " needs", " computainment"], "paper_abstract": "Human computation games (HCGs) are applications that use games to harness human intelligence to perform various computational tasks. That is, users perform computations as a byproduct of being entertained while playing a game. Such games are increasing in popularity and it is critical to examine how different types of HCG affect players' perceptions and performance. In addition, understanding their motivational appeal to different players is also important to good HCG design. In the present research, we focus on image tagging HCGs, where users play games to generate keywords for images. Three versions were created: a collaborative HCG which required players to cooperate, a competitive HCG where players worked against each other, and a control non-game manual tagging application. The applications were evaluated to uncover the quality of the tags, users' perceptions of these variants, and the influence of motivational needs on usage intention. Results suggest that, while participants reported liking the collaborative and competitive HCGs over the control application, those using the latter seemed to generate better quality tags. Further, using the trichotomy of needs theory, we found that an individual's need for achievement and power influenced intention to use the various applications.", "paper_title": "Perceptions, quality and motivational needs in image tagging human computation games", "paper_id": "WOS:000295737200006"}