{"auto_keywords": [{"score": 0.049782445699425075, "phrase": "gene_expression_levels"}, {"score": 0.006785308586493249, "phrase": "association_patterns"}, {"score": 0.006497118684154917, "phrase": "tissue_classes"}, {"score": 0.005529245315967381, "phrase": "gene_expression"}, {"score": 0.00481495049065317, "phrase": "high-order_patterns"}, {"score": 0.0046676969718111765, "phrase": "statistically_significant_association_patterns"}, {"score": 0.004610058444728656, "phrase": "microarray_data"}, {"score": 0.004058615475230867, "phrase": "statistical_measure"}, {"score": 0.00402094658848301, "phrase": "objective_manner"}, {"score": 0.0036288825833675127, "phrase": "entire_gene_pool"}, {"score": 0.0034100553723847037, "phrase": "gene_groups"}, {"score": 0.0033947530711090686, "phrase": "colon_cancer"}, {"score": 0.0031944286166257466, "phrase": "smaller_gene_pool"}, {"score": 0.00316475494774005, "phrase": "gene_pool"}, {"score": 0.0030965805992969027, "phrase": "original_pool"}, {"score": 0.0030110748510795175, "phrase": "first_time"}, {"score": 0.0029645930408561086, "phrase": "significant_association_patterns"}, {"score": 0.0028917056916949744, "phrase": "small_pool"}, {"score": 0.0025532173213934422, "phrase": "data_set"}, {"score": 0.0025373711401047772, "phrase": "gene_expression_intervals"}, {"score": 0.0024826780747521505, "phrase": "statistically_significant_associations"}, {"score": 0.002414082940963702, "phrase": "different_tissue_classes"}, {"score": 0.002362041061180632, "phrase": "colon-cancer_microarray_gene_expression_data"}, {"score": 0.0022683432490549064, "phrase": "normal_subjects"}, {"score": 0.0022472527731744974, "phrase": "statistically_significant_combinations"}, {"score": 0.0021648294450401133, "phrase": "colon-cancer_data"}, {"score": 0.0021380309053013647, "phrase": "discovered_association_patterns"}], "paper_keywords": ["bioinformatics", " data mining", " gene expression", " microarray data", " pattern discovery"], "paper_abstract": "This paper reports the discovery of statistically significant association patterns of gene expression levels from microarray data. By association patterns, we mean certain gene expression intensity intervals having statistically significant associations among themselves and with the tissue classes, such as cancerous and normal tissues. We describe how the significance of the associations among gene expression levels can be evaluated using a statistical measure in an objective manner. If an association is found to be significant based on the measure, we say that it is statistically significant. Given a gene expression data set, we first cluster the entire gene pool comprising all the genes into groups by optimizing the correlation (or more precisely, interdependence) among the gene expression levels within gene groups. From each group, we select one or several genes that are most correlated with other genes within that group to form a smaller gene pool. This gene pool then constitutes the most representative genes from the original pool. Our pattern discovery algorithm is then used, for the first time, to discover the significant association patterns of gene expression levels among the genes from the small pool. With our method, it is more effective to discover and express the associations in terms of their intensity intervals. Hence, we discretize each gene expression levels into intervals maximizing the interdependence between the gene expression and the tissue classes. From this data set of gene expression intervals, we discover the association patterns representing statistically significant associations, some positively and some negatively, with different tissue classes. We apply our pattern discovery methodology to the colon-cancer microarray gene expression data set. It consists of 2000 genes and 62 samples taken from colon cancer or normal subjects. The statistically significant combinations of gene expression levels that repress or activate colon cancer are revealed in the colon-cancer data set. The discovered association patterns are ranked according to their statistical significance and displayed for interpretation and further analysis.", "paper_title": "Discovering high-order patterns of gene expression levels", "paper_id": "WOS:000258164000006"}