{"auto_keywords": [{"score": 0.033525769462478656, "phrase": "different_camera_views"}, {"score": 0.015452145170570702, "phrase": "multiple_camera_views"}, {"score": 0.00481495049065317, "phrase": "correspondence-free_activity_analysis"}, {"score": 0.00465067040500426, "phrase": "novel_approach"}, {"score": 0.0046184900568047565, "phrase": "activity_analysis"}, {"score": 0.004523272849033429, "phrase": "static_camera_views"}, {"score": 0.00435375504298636, "phrase": "motion_patterns"}, {"score": 0.004219774794569897, "phrase": "far-field_scenes"}, {"score": 0.003697895355947004, "phrase": "different_ground_planes"}, {"score": 0.0036595438031512217, "phrase": "low-level_cues"}, {"score": 0.003559199464487982, "phrase": "camera_view"}, {"score": 0.0033317342432676385, "phrase": "probabilistic_model"}, {"score": 0.0031955979242589494, "phrase": "feature_spaces"}, {"score": 0.0027326751144684386, "phrase": "abnormal_activities"}, {"score": 0.0025937408242280757, "phrase": "challenging_correspondence_problem"}, {"score": 0.0023285383529595416, "phrase": "correspondence_problem"}, {"score": 0.002127092664485508, "phrase": "simulated_data"}], "paper_keywords": ["Visual surveillance", " activity analysis in multiple camera views", " correspondence", " clustering"], "paper_abstract": "We propose a novel approach for activity analysis in multiple synchronized but uncalibrated static camera views. In this paper, we refer to activities as motion patterns of objects, which correspond to paths in far-field scenes. We assume that the topology of cameras is unknown and quite arbitrary, the fields of views covered by these cameras may have no overlap or any amount of overlap, and objects may move on different ground planes. Using low-level cues, objects are first tracked in each camera view independently, and the positions and velocities of objects along trajectories are computed as features. Under a probabilistic model, our approach jointly learns the distribution of an activity in the feature spaces of different camera views. Then, it accomplishes the following tasks: 1) grouping trajectories, which belong to the same activity but may be in different camera views, into one cluster; 2) modeling paths commonly taken by objects across multiple camera views; and 3) detecting abnormal activities. Advantages of this approach are that it does not require first solving the challenging correspondence problem, and that learning is unsupervised. Even though correspondence is not a prerequisite, after the models of activities have been learned, they can help to solve the correspondence problem, since if two trajectories in different camera views belong to the same activity, they are likely to correspond to the same object. Our approach is evaluated on a simulated data set and two very large real data sets, which have 22,951 and 14,985 trajectories, respectively.", "paper_title": "Correspondence-Free Activity Analysis and Scene Modeling in Multiple Camera Views", "paper_id": "WOS:000271826700006"}