{"auto_keywords": [{"score": 0.027161698292739685, "phrase": "epui_methodology"}, {"score": 0.00481495049065317, "phrase": "kitchen_interactions"}, {"score": 0.004524455848517757, "phrase": "new_technologies"}, {"score": 0.004178522455099832, "phrase": "typical_users"}, {"score": 0.003939880387831148, "phrase": "interaction_design"}, {"score": 0.0037927494831151553, "phrase": "participatory_design"}, {"score": 0.0035025644647418983, "phrase": "intended_users"}, {"score": 0.0033484464719654105, "phrase": "kitchen_demands"}, {"score": 0.003325343504284345, "phrase": "high_and_consistent_level"}, {"score": 0.003201088113538101, "phrase": "truly_smart_and_human-centred_kitchen"}, {"score": 0.0030814613175385672, "phrase": "interaction_design_process"}, {"score": 0.002915370532555375, "phrase": "whole_design_process"}, {"score": 0.0028554143163813947, "phrase": "early_design_phases"}, {"score": 0.002520637941597506, "phrase": "kitchen_users"}, {"score": 0.0024945743145462144, "phrase": "kitchen_interaction_design"}, {"score": 0.0024773480858940504, "phrase": "fruitful_participatory_design"}, {"score": 0.002368410889996604, "phrase": "pd"}, {"score": 0.0023518840222764696, "phrase": "adr"}, {"score": 0.0023356349192255074, "phrase": "padr"}, {"score": 0.0021049977753042253, "phrase": "seasoned_and_less-experienced_researchers"}], "paper_keywords": ["Kitchen", " Interaction design", " User research", " User integration", " Participatory design", " Ubiquitous computing"], "paper_abstract": "The kitchen is a place where many interactions happen every day. It is a place where new technologies and tradition meet. What makes a place a smart kitchen? This article describes our research over 29 months with a group representing typical users-we will call them the kitchen heroes. We involved them in a process of interaction design (IxD) for the kitchen following the tradition of participatory design (PD), to find out the potential of such a collaboration. We asked ourselves how could we, together with the intended users design for better, seamless interaction in the kitchen? Our research showed that designing for kitchen demands a high and consistent level of engagement of all the stakeholders if we are to design a truly smart and human-centred kitchen. How then, could we integrate them into the interaction design process? As an answer we developed a methodology for the integration of all the stakeholders into the whole design process. We focused on the early design phases and the ways to trigger engagement. The methodology we developed is named EPUI and consists of four parts: exploration, participation, understanding and integration. This article illustrates the EPUI methodology for successfully integrating kitchen users into the kitchen interaction design and fruitful participatory design. It is based on and combines benefits from methodologies such as PD, ADR, PADR, while in the article we explain how it also contributes to their flaws. Additionally, we present our lessons learned while implementing the EPUI methodology and offer tools to both seasoned and less-experienced researchers.", "paper_title": "Experience to understand: a methodology for integrating users into the design for kitchen interactions", "paper_id": "WOS:000338120700006"}