{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "research_performance"}, {"score": 0.015036696411805035, "phrase": "gender_differences"}, {"score": 0.004114527599108729, "phrase": "different_factors"}, {"score": 0.003660788124282824, "phrase": "significantly_different_ranking_lists"}, {"score": 0.003563370084662192, "phrase": "structural_factor"}, {"score": 0.003437486158494063, "phrase": "female_researchers"}, {"score": 0.0033011569787033297, "phrase": "equal_capacities"}, {"score": 0.003198860258228543, "phrase": "comparative_evaluations"}, {"score": 0.0031702173541386888, "phrase": "individual_performance"}, {"score": 0.0026362590493392785, "phrase": "hard_sciences"}, {"score": 0.0025660347613972573, "phrase": "italian_university_system"}, {"score": 0.0024202176034746337, "phrase": "subsequently_the_ranking_lists"}, {"score": 0.0022419349154472806, "phrase": "efficient_selection"}, {"score": 0.0021821915946356168, "phrase": "career_advancement"}, {"score": 0.00216263228969761, "phrase": "incentive_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Research evaluation", " Gender", " Bibliometrics", " Italy"], "paper_abstract": "The literature on gender differences in research performance seems to suggest a gap between men and women, where the former outperform the latter. Whether one agrees with the different factors proposed to explain the phenomenon, it is worthwhile to verify if comparing the performance within each gender, rather than without distinction, gives significantly different ranking lists. If there were some structural factor that determined a penalty in performance of female researchers compared to their male peers, then under conditions of equal capacities of men and women, any comparative evaluations of individual performance that fail to account for gender differences would lead to distortion of the judgments in favor of men. In this work we measure the extent of differences in rank between the two methods of comparing performance in each field of the hard sciences: for professors in the Italian university system, we compare the distributions of research performance for men and women and subsequently the ranking lists with and without distinction by gender. The results are of interest for the optimization of efficient selection in formulation of recruitment, career advancement and incentive schemes. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Should the research performance of scientists be distinguished by gender?", "paper_id": "WOS:000349770500005"}