{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "decomposable_interval"}, {"score": 0.028880275857527744, "phrase": "proposed_exact_inversion_methodology"}, {"score": 0.004247560712327667, "phrase": "fuzzy_logic_systems"}, {"score": 0.004058180509184539, "phrase": "control_system_design"}, {"score": 0.0038551626276406175, "phrase": "exact_inversion_methodology"}, {"score": 0.0036001255166809793, "phrase": "decomposition_property"}, {"score": 0.0031037644581516973, "phrase": "input_space"}, {"score": 0.003051073364818384, "phrase": "fuzzy_logic_system"}, {"score": 0.002965229277927781, "phrase": "analytical_formulation"}, {"score": 0.0029148831519944358, "phrase": "inverse_interval"}, {"score": 0.0027689017918347755, "phrase": "karnik-mendel_type_reduction_method"}, {"score": 0.0026302120935562568, "phrase": "fuzzy_logic_subsystem"}, {"score": 0.002359759876402679, "phrase": "proposed_methodology"}, {"score": 0.0023196699954340437, "phrase": "simulation_study"}, {"score": 0.002254357921422124, "phrase": "beneficial_sides"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Interval type-2 fuzzy logic systems", " System inversion", " Decomposition property"], "paper_abstract": "It has been demonstrated that type-2 fuzzy logic systems are much more powerful tools than ordinary (type-1) fuzzy logic systems to represent highly nonlinear and/or uncertain systems. As a consequence, type-2 fuzzy logic systems have been applied in various areas especially in control system design and modelling. In this study, an exact inversion methodology is developed for decomposable interval type-2 fuzzy logic system. In this context, the decomposition property is extended and generalized to interval type-2 fuzzy logic sets. Based on this property, the interval type-2 fuzzy logic system is decomposed into several interval type-2 fuzzy logic subsystems under a certain condition on the input space of the fuzzy logic system. Then, the analytical formulation of the inverse interval type-2 fuzzy logic subsystem output is explicitly driven for certain switching points of the Karnik-Mendel type reduction method. The proposed exact inversion methodology driven for the interval type-2 fuzzy logic subsystem is generalized to the overall interval type-2 fuzzy logic system via the decomposition property. In order to demonstrate the feasibility of the proposed methodology, a simulation study is given where the beneficial sides of the proposed exact inversion methodology are shown clearly. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Exact inversion of decomposable interval type-2 fuzzy logic systems", "paper_id": "WOS:000315071200001"}