{"auto_keywords": [{"score": 0.03099019471491858, "phrase": "deterministic_strategy"}, {"score": 0.030216600726220552, "phrase": "worst-case_rendezvous_delay"}, {"score": 0.00471193241675062, "phrase": "deterministic_algorithms"}, {"score": 0.0033909518548844047, "phrase": "telephone_problem"}, {"score": 0.003332704619499476, "phrase": "fundamental_importance"}, {"score": 0.0033039560332995136, "phrase": "distributed_algorithm_design"}, {"score": 0.003177615880037735, "phrase": "generalised_version"}, {"score": 0.0031365819432206004, "phrase": "n_telephones"}, {"score": 0.0029012378668247397, "phrase": "bounded_rendezvous_delay"}, {"score": 0.0026033013834547507, "phrase": "phone_pick_sequences"}, {"score": 0.002525489173110693, "phrase": "prior_coordination"}, {"score": 0.002449997042686432, "phrase": "globally_unique_id"}, {"score": 0.0021418339161425994, "phrase": "constant_factor"}, {"score": 0.0021049977753042253, "phrase": "id_length"}], "paper_keywords": ["Telephone coordination game", " rendezvous search game", " distributed algorithm design"], "paper_abstract": "Two players wishing to communicate are placed each in a room with N telephones connecting the two rooms. The players do not know how the telephones are interconnected. In each round, each player picks up a phone and says \"hello\" until when they hear each other. The problem is to devise an algorithm minimising the delay to establish communication. The above problem, called the Telephone Coordination Game, also termed as the Telephone Problem, is of fundamental importance in distributed algorithm design. In this paper, we investigate a generalised version where among N telephones, only a subset can establish communication between the two players. We are interested in devising the deterministic strategy achieving bounded rendezvous delay and minimising the worst-case rendezvous delay. Specifically, we first establish the lower-bound of worst-case rendezvous delay. We then characterise the structure of the phone pick sequences that can guarantee rendezvous without any prior coordination. Assuming each player has a globally unique ID, we further devise a deterministic strategy that (1) guarantees rendezvous between the players regardless of their telephone labeling functions and their relative time difference and (2) approaches the performance bound within a constant factor proportional to the ID length.", "paper_title": "The Telephone Coordination Game Revisited: From Random to Deterministic Algorithms", "paper_id": "WOS:000361480400019"}