{"auto_keywords": [{"score": 0.018463524653883217, "phrase": "spatial_similarity"}, {"score": 0.007183382404269746, "phrase": "feature_space"}, {"score": 0.00481495049065317, "phrase": "multiple_clusterings"}, {"score": 0.004762435022350756, "phrase": "growing_and_important_research_field"}, {"score": 0.004558012799538011, "phrase": "principled_methods"}, {"score": 0.0043464021636703066, "phrase": "clustering_similarity_indices"}, {"score": 0.004283280680222718, "phrase": "important_subclass"}, {"score": 0.004190305872545087, "phrase": "spatial_clustering_similarity"}, {"score": 0.004010342699414496, "phrase": "account_properties"}, {"score": 0.0037823114064881357, "phrase": "spatially_aware_clustering_comparison"}, {"score": 0.003713736138854327, "phrase": "single_similarity_value"}, {"score": 0.003161271802988128, "phrase": "deeper_exploration"}, {"score": 0.002927278301452369, "phrase": "full_feature_space"}, {"score": 0.0027006464509273806, "phrase": "starting_point"}, {"score": 0.002315452777999619, "phrase": "search_space"}, {"score": 0.0021835829960683666, "phrase": "synthetic_and_real_world"}, {"score": 0.0021049977753042253, "phrase": "novel_information"}], "paper_keywords": ["Clustering similarity", " Clustering comparison", " Multiple clusterings"], "paper_abstract": "Generation and analysis of multiple clusterings is a growing and important research field. A fundamental challenge underpinning this area is how to develop principled methods for assessing and explaining the similarity between two clusterings. A range of clustering similarity indices exist and an important subclass consists of measures for assessing spatial clustering similarity. These provide the advantage of being able to take into account properties of the feature space when assessing the similarity of clusterings. However, the output of spatially aware clustering comparison is limited to a single similarity value, which lacks detail for a user. Instead, a user may also wish to understand the degree to which the assessment of clustering similarity is dependent on the choice of feature space. To this end, we propose a technique for deeper exploration of the spatial similarity between two clusterings. Using as a reference a measure that assesses the spatial similarity of two clusterings in the full feature space, our method discovers deviating subspaces in which the spatial similarity of the two clusterings becomes substantially larger or smaller. Such information provides a starting point for the user to understand the circumstances in which the distance functions associated with each of the two clusterings are behaving similarly or dissimilarly. The core of our method employs a range of pruning techniques to help efficiently enumerate and explore the search space of deviating subspaces. We experimentally assess the effectiveness of our approach using an evaluation with synthetic and real world datasets and demonstrate the potential of our technique for highlighting novel information about spatial similarity between clusterings.", "paper_title": "Enriched spatial comparison of clusterings through discovery of deviating subspaces", "paper_id": "WOS:000347694700005"}