{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "key_determinants"}, {"score": 0.014345905744373678, "phrase": "dw"}, {"score": 0.010495526236698912, "phrase": "seven_variables"}, {"score": 0.0047872135686404275, "phrase": "data_warehouse_adoption"}, {"score": 0.004759635663291431, "phrase": "data_warehousing"}, {"score": 0.004326771493322954, "phrase": "relatively_high_failure_rates"}, {"score": 0.004252389342697521, "phrase": "major_it_infrastructural_innovation"}, {"score": 0.004095567486538121, "phrase": "organizational_theories"}, {"score": 0.0037336520904376687, "phrase": "rigorous_measurement_scales"}, {"score": 0.003701401653850141, "phrase": "research_variables"}, {"score": 0.0036588323994343045, "phrase": "survey_instrument"}, {"score": 0.0032970073375059522, "phrase": "logistic_regression_model"}, {"score": 0.0032496585171039797, "phrase": "direct_effect"}, {"score": 0.002877769867854964, "phrase": "dw_adoption"}, {"score": 0.002820052889643225, "phrase": "preexisting_data_environment"}, {"score": 0.0027634902834910184, "phrase": "adopter_firms"}, {"score": 0.0025780134737796085, "phrase": "alternative_structural_model"}, {"score": 0.002555719763475824, "phrase": "lisrel"}, {"score": 0.0024827861706195765, "phrase": "antecedent_variables"}, {"score": 0.0024400265512135397, "phrase": "dependent_variable"}, {"score": 0.0023566987138026285, "phrase": "existing_research"}, {"score": 0.002309408211203032, "phrase": "fairly_comprehensive_model"}, {"score": 0.0022960713730673494, "phrase": "organizational_adoption"}, {"score": 0.002276210060619432, "phrase": "information_technology"}, {"score": 0.0022048406330100697, "phrase": "interesting_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["absorptive capacity", " adoption", " data warehousing", " decision-support technology", " innovation factors", " organizational factors"], "paper_abstract": "Data warehousing (DW) has emerged as one of the most powerful decision support technologies during the last decade. However, despite the fact that it has been around for some time, DW has experienced limited spread/use and relatively high failure rates. Treating DW as a major IT infrastructural innovation, we propose a comprehensive research model - grounded in IT adoption and organizational theories - that examines the impact of various organizational and technological (innovation) factors on DW adoption. Seven factors - five organizational and two technological - are tested in the model. The study employed rigorous measurement scales of the research variables to develop a survey instrument and targeted 2500 organizations in both manufacturing and services segments within two major states in the United States. A total of 196 firms (276 executives), of which nearly 55% were adopters, responded to the survey. The results from a logistic regression model, initially conceptualizing a direct effect of each of the seven variables on adoption, indicate that five of the seven variables (three organizational factors - commitment, size, and absorptive capacity - and two innovation characteristics relative - advantage and low complexity) are key determinants of DW adoption. Although scope for DW and preexisting data environment within the organization were favorable for adopter firms, they did not emerge as key determinants. However, the study provided an opportunity to explore a more complex set of relationships. This alternative structural model (using LISREL) provides a much richer explanation of the relationships among the antecedent variables and with adoption, the dependent variable. The study, especially the revised conceptualization, contributes to existing research by proposing and empirically testing a fairly comprehensive model of organizational adoption of an information technology (IT) innovation, more specifically a DSS technology. The findings of the study have interesting implications with respect to IT/DW adoption, both for researchers and practitioners. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "An empirical investigation of the key determinants of data warehouse adoption", "paper_id": "WOS:000253750200005"}