{"auto_keywords": [{"score": 0.03230782898550848, "phrase": "unified_graph_distance_measures"}, {"score": 0.015123132908475001, "phrase": "graph_distance"}, {"score": 0.01239874547049964, "phrase": "existing_structure-based_graph_distance_measures"}, {"score": 0.00481495049065317, "phrase": "high_degree"}, {"score": 0.0043877939717652855, "phrase": "real_applications"}, {"score": 0.0041174821422410544, "phrase": "structure-based_graph_distance_measures"}, {"score": 0.003863758357292741, "phrase": "cost_functions"}, {"score": 0.0034187896011435245, "phrase": "graph_distance_measures"}, {"score": 0.0033524956061690868, "phrase": "substructure_abundance_vector"}, {"score": 0.003319831621498292, "phrase": "sav"}, {"score": 0.002689430273401131, "phrase": "occurrence_mapping"}, {"score": 0.002523481637809674, "phrase": "unified_graph_distance"}, {"score": 0.0024383967028975616, "phrase": "population_evolution_analysis"}, {"score": 0.0024028135317872, "phrase": "distance_graphs"}, {"score": 0.002379379676378223, "phrase": "marker_networks"}, {"score": 0.002299142268368128, "phrase": "single_nucleotide_polymorphism"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["graph distance", " distance metric", " structure-based graph distance", " SNP linkage disequilibrium"], "paper_abstract": "In recent years, evaluating graph distance has become more and more important in a variety of real applications and many graph distance measures have been proposed. Among all of those measures, structure-based graph distance measures have become the research focus due to their independence of the definition of cost functions. However, existing structure-based graph distance measures have low degree of precision because only node and edge information of graphs are employed in these measures. To improve the precision of graph distance measures, we define substructure abundance vector (SAV) to capture more substructure information of a graph. Furthermore, based on SAV, we propose unified graph distance measures which are generalization of the existing structure-based graph distance measures. In general, the unified graph distance measures can evaluate graph distance in much finer grain. We also show that unified graph distance measures based on occurrence mapping and some of their variants are metrics. Finally, we apply the unified graph distance metric and its variants to the population evolution analysis and construct distance graphs of marker networks in three populations, which reflect the single nucleotide polymorphism (SNP) linkage disequilibrium (LD) differences among these populations. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Structure-based graph distance measures of high degree of precision", "paper_id": "WOS:000259547900003"}