{"auto_keywords": [{"score": 0.03933224477480833, "phrase": "qos_ratings"}, {"score": 0.009380756465047956, "phrase": "web_service"}, {"score": 0.00481495049065317, "phrase": "qos-aware_recommender_system"}, {"score": 0.0047823219739028325, "phrase": "trustworthy_web_service_selection"}, {"score": 0.004701710196317656, "phrase": "qos-aware_recommender_approach"}, {"score": 0.004544521651302002, "phrase": "web_services"}, {"score": 0.004437613070853689, "phrase": "service-oriented_environments"}, {"score": 0.004303830426772906, "phrase": "trust_model"}, {"score": 0.004260134699483774, "phrase": "service_provider"}, {"score": 0.003966388754366831, "phrase": "similar_services"}, {"score": 0.003438058620195309, "phrase": "probabilistic_approach"}, {"score": 0.0030936482163040823, "phrase": "different_statistical_distributions"}, {"score": 0.0030726480920918097, "phrase": "namely_multinomial_dirichlet"}, {"score": 0.0030313752399332844, "phrase": "dirichlet"}, {"score": 0.0028218336994432864, "phrase": "different_quality_classes"}, {"score": 0.0027459678326877744, "phrase": "bayesian_inference_method"}, {"score": 0.002681255756642227, "phrase": "aforementioned_distributions"}, {"score": 0.0026359661683151006, "phrase": "multidimensional_probabilistic_embodiment"}, {"score": 0.0025826247025542213, "phrase": "corresponding_web_services"}, {"score": 0.002530359917257626, "phrase": "bayesian_network_classifier"}, {"score": 0.002420710733288495, "phrase": "composite_services"}, {"score": 0.0023079225317714815, "phrase": "online_setting"}, {"score": 0.0021049977753042253, "phrase": "proposed_approaches"}], "paper_keywords": ["Web service", " Trust", " Bayesian network", " Online learning", " Dirichlet", " Beta-Liouville"], "paper_abstract": "We present a QoS-aware recommender approach based on probabilistic models to assist the selection of web services in open, distributed, and service-oriented environments. This approach allows consumers to maintain a trust model for each service provider they interact with, leading to the prediction of the most trustworthy service a consumer can interact with among a plethora of similar services. In this paper, we associate the trust in a service to its performance denoted by QoS ratings instigated by the amalgamation of various QoS metrics. Since the quality of a service is contingent, which renders its trustworthiness uncertain, we adopt a probabilistic approach for the prediction of the quality of a service based on the evaluation of past experiences (ratings) of each of its consumers. We represent the QoS ratings of services using different statistical distributions, namely multinomial Dirichlet, multinomial generalized Dirichlet, and multinomial Beta-Liouville. We leverage various machine learning techniques to compute the probabilities of each web service to belong to different quality classes. For instance, we use the Bayesian inference method to estimate the parameters of the aforementioned distributions, which presents a multidimensional probabilistic embodiment of the quality of the corresponding web services. We also employ a Bayesian network classifier with a Beta-Liouville prior to enable the classification of the QoS of composite services given the QoS of its constituents. We extend our approach to function in an online setting using the Voting EM algorithm that enables the estimation of the probabilities of the QoS after each interaction with a web service. Our experimental results demonstrate the effectiveness of the proposed approaches in modeling, classifying and incrementally learning the QoS ratings.", "paper_title": "Probabilistic approach for QoS-aware recommender system for trustworthy web service selection", "paper_id": "WOS:000341094000012"}