{"auto_keywords": [{"score": 0.01428527218471856, "phrase": "cellular_networks"}, {"score": 0.004429191773525288, "phrase": "human_intervention"}, {"score": 0.004003169429008801, "phrase": "significant_challenges"}, {"score": 0.003916098498242888, "phrase": "different_data_transactions"}, {"score": 0.0038818006513785977, "phrase": "diverse_applications"}, {"score": 0.003586278948128509, "phrase": "extremely_power"}, {"score": 0.0034018288705284427, "phrase": "comprehensive_survey"}, {"score": 0.003284145698220425, "phrase": "third-generation_partnership_project"}, {"score": 0.0028778584739756786, "phrase": "architectural_enhancements"}, {"score": 0.002646880721119838, "phrase": "signal_overheads"}, {"score": 0.0024024377855956136, "phrase": "diverse_random_access_overload_control"}, {"score": 0.002339771435910601, "phrase": "random_channel_access"}, {"score": 0.002298902547676131, "phrase": "different_application_scenarios"}], "paper_keywords": ["M2M communication", " 3GPP", " LTE", " LTE-Advanced", " architecture", " random access"], "paper_abstract": "Machine-to-machine (M2M) communication is an emerging technology to provide ubiquitous connectivity among devices without human intervention. The cellular networks are considered a ready-to-use infrastructure to implement M2M communications. However, M2M communications over cellular pose significant challenges to cellular networks due to different data transactions, diverse applications, and a large number of connections. To support such a large number of devices, M2M system architecture should be extremely power and spectrum efficient. In this paper, we provide a comprehensive survey on M2M communications in the context of the Third-Generation Partnership Project (3GPP) Long-Term Evolution (LTE) and Long-Term Evolution-Advanced (LTE-A). More specifically, this paper presents architectural enhancements for providing M2M services in 3GPP LTE/LTE-A networks and reviews the features and requirements of M2M applications. In addition, the signal overheads and various quality-of-service (QoS) requirements in M2M communications also deserve our attention. We address M2M challenges over 3GPP LTE/LTE-A and also identify the issues on diverse random access overload control to avoid congestion caused by random channel access of M2M devices. Different application scenarios are considered to illustrate futuristic M2M applications. Finally, we present possible enabling technologies and point out the directions for M2M communications research.", "paper_title": "M2M Communications in 3GPP LTE/LTE-A Networks: Architectures, Service Requirements, Challenges, and Applications", "paper_id": "WOS:000354860000003"}