{"auto_keywords": [{"score": 0.04264314285320384, "phrase": "formative_constructs"}, {"score": 0.00481495049065317, "phrase": "annotated_example"}, {"score": 0.004726052718910578, "phrase": "abundant_advice"}, {"score": 0.004469042910390712, "phrase": "multi-item_scales"}, {"score": 0.004386503433248535, "phrase": "reflective_constructs"}, {"score": 0.004332322079100859, "phrase": "scant_attention"}, {"score": 0.003640183972131238, "phrase": "recent_advances"}, {"score": 0.0035507457285983268, "phrase": "testing_models"}, {"score": 0.0029830992938695007, "phrase": "general_principles"}, {"score": 0.002633941112839883, "phrase": "statistical_logic"}, {"score": 0.0021987994275190314, "phrase": "professional_reward_structure"}], "paper_keywords": ["IS research methods", " formative constructs", " reflective constructs", " tutorial"], "paper_abstract": "Although abundant advice is available for how to develop and validate multi-item scales based on reflective constructs, scant attention has been directed to how to construct and validate formative constructs. Such advice is important because (1) theory suggests many constructs are formative and (2) recent advances in software render testing models with formative constructs more tractable. In this tutorial, our goal is to enhance understanding of formative constructs at the conceptual, statistical and methodological levels. Specifically, we (1) provide general principles for specifying whether a construct should be conceptually modeled as reflective or formative, (2) discuss the statistical logic behind formative constructs, and (3) illustrate how to model and evaluate formative constructs. In particular, we provide a tutorial in which we test and validate professional reward structure, a formative construct, in two popular structural equation modeling programs: EQS and PLS. We conclude with a summary of guidelines for how to conduct and evaluate research using formative constructs.", "paper_title": "Conceptualizing and Testing Formative Constructs: Tutorial and Annotated Example", "paper_id": "WOS:000277409100002"}