{"auto_keywords": [{"score": 0.03187289699542171, "phrase": "braking_ics"}, {"score": 0.011771586003564555, "phrase": "passive_motion_safety"}, {"score": 0.008642708847914392, "phrase": "limited_field"}, {"score": 0.00481495049065317, "phrase": "mobile_robots"}, {"score": 0.004659192888931046, "phrase": "dynamic_environments"}, {"score": 0.00445318311339027, "phrase": "provably_safe_manner"}, {"score": 0.004416713079266374, "phrase": "mobile_robot"}, {"score": 0.004221379262804442, "phrase": "unknown_dynamic_environment"}, {"score": 0.0036553070575015344, "phrase": "weaker_level"}, {"score": 0.003625347557965931, "phrase": "motion_safety"}, {"score": 0.0033115124244647736, "phrase": "primary_contribution"}, {"score": 0.003204232566468624, "phrase": "braking_inevitable_collision_states"}, {"score": 0.002890810475014827, "phrase": "future_braking_trajectory"}, {"score": 0.002471973283582411, "phrase": "efficient_braking_ics-checking_algorithm"}, {"score": 0.0021845387990972543, "phrase": "reactive_navigation_scheme"}, {"score": 0.0021049977753042253, "phrase": "passavoid"}], "paper_keywords": ["Mobile robots", " Dynamic environments", " Autonomous navigation", " Motion safety", " Collision avoidance", " Inevitable collision states"], "paper_abstract": "This paper addresses the problem of navigating in a provably safe manner a mobile robot with a limited field-of-view placed in a unknown dynamic environment. In such a situation, absolute motion safety (in the sense that no collision will ever take place whatever happens in the environment) is impossible to guarantee in general. It is therefore settled for a weaker level of motion safety dubbed passive motion safety: it guarantees that, if a collision takes place, the robot will be at rest. The primary contribution of this paper is the concept of Braking Inevitable Collision States (ICS), i.e. a version of the ICS corresponding to passive motion safety. Braking ICS are defined as states such that, whatever the future braking trajectory followed by the robot, a collision occurs before it is at rest. Passive motion safety is obtained by avoiding Braking ICS at all times. It is shown that Braking ICS verify properties that allow the design of an efficient Braking ICS-Checking algorithm, i.e. an algorithm that determines whether a given state is a Braking ICS or not. To validate the Braking ICS concept and demonstrate its usefulness, the Braking ICS-Checking algorithm is integrated in a reactive navigation scheme called PassAvoid. It is formally established that PassAvoid is provably passively safe in the sense that it is guaranteed that the robot will always stay away from Braking ICS no matter what happens in the environment.", "paper_title": "Provably safe navigation for mobile robots with limited field-of-views in dynamic environments", "paper_id": "WOS:000302037300007"}