{"auto_keywords": [{"score": 0.04919852817745961, "phrase": "market_choice"}, {"score": 0.008633568965554068, "phrase": "logistics_problems"}, {"score": 0.00481495049065317, "phrase": "supply_chain_planning"}, {"score": 0.004575272950516775, "phrase": "broad_class"}, {"score": 0.004532988904965752, "phrase": "traditional_supply_chain_planning"}, {"score": 0.004169519409162853, "phrase": "traditional_setting"}, {"score": 0.003610292749660581, "phrase": "first_stage"}, {"score": 0.0032292292848296617, "phrase": "minimum-cost_production_plan"}, {"score": 0.002874870266177579, "phrase": "rejected_markets"}, {"score": 0.0026811531172346676, "phrase": "important_aspects"}, {"score": 0.0026440008776012665, "phrase": "shaping_within_supply_chain_planning_and_logistics_models"}, {"score": 0.002523828967909659, "phrase": "existing_approximation_results"}, {"score": 0.002488851299416018, "phrase": "traditional_models"}, {"score": 0.0024543571925896073, "phrase": "corresponding_results"}, {"score": 0.0023427844897844093, "phrase": "lp-based_alpha-approximation"}, {"score": 0.0022052711621931144, "phrase": "counterpart_model"}], "paper_keywords": ["Approximation algorithm", " Linear programming", " Inventory management", " Facility location"], "paper_abstract": "We propose generalizations of a broad class of traditional supply chain planning and logistics models that we call supply chain planning and logistics problems with market choice. Instead of the traditional setting, we are given a set of markets, each specified by a sequence of demands and associated with a revenue. Decisions are made in two stages. In the first stage, one chooses a subset of markets and rejects the others. Once that market choice is made, one needs to construct a minimum-cost production plan (set of facilities) to satisfy all of the demands of all the selected markets. The goal is to minimize the overall lost revenues of rejected markets and the production (facility opening and connection) costs. These models capture important aspects of demand shaping within supply chain planning and logistics models. We introduce a general algorithmic framework that leverages existing approximation results for the traditional models to obtain corresponding results for their counterpart models with market choice. More specifically, any LP-based alpha-approximation for the traditional model can be leveraged to a 1/1-e(-1/alpha)-approximation algorithm for the counterpart model with market choice. Our techniques are also potentially applicable to other covering problems.", "paper_title": "Approximation algorithms for supply chain planning and logistics problems with market choice", "paper_id": "WOS:000295785100004"}