{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "symmetric_functions"}, {"score": 0.013056277963523901, "phrase": "constant_number"}, {"score": 0.011613173647364437, "phrase": "partially_symmetric_functions"}, {"score": 0.009375955812465399, "phrase": "partial_symmetry"}, {"score": 0.0047650691627251825, "phrase": "isomorphism_testable."}, {"score": 0.004715702140552199, "phrase": "boolean_function"}, {"score": 0.00465067040500426, "phrase": "f-isomorphism_testing_problem"}, {"score": 0.00436890075128947, "phrase": "input_variables"}, {"score": 0.004205143879089321, "phrase": "important_open_question"}, {"score": 0.004176033420846065, "phrase": "property_testing"}, {"score": 0.003855347387268162, "phrase": "essentially_only_two_classes"}, {"score": 0.0037627064621795514, "phrase": "efficiently_isomorphism_testable"}, {"score": 0.0032179862309818135, "phrase": "shannon"}, {"score": 0.00269491620131611, "phrase": "junta_testing_problem"}, {"score": 0.002648448458159033, "phrase": "new_proof"}, {"score": 0.0026027798552168344, "phrase": "nearly_optimal_junta_tester"}, {"score": 0.0025578967205807843, "phrase": "fourier_machinery"}, {"score": 0.0025313382638451776, "phrase": "original_proof"}, {"score": 0.002505054869094183, "phrase": "purely_combinatorial_argument"}, {"score": 0.002419393934835993, "phrase": "low_influence"}, {"score": 0.0024026156525362684, "phrase": "intersecting_families"}, {"score": 0.0023776656246300063, "phrase": "important_ingredient"}, {"score": 0.002336655334451464, "phrase": "new_notion"}, {"score": 0.002320449502337321, "phrase": "symmetric_influence"}, {"score": 0.002164432930854161, "phrase": "efficient_sample_extractor"}, {"score": 0.0021049977753042253, "phrase": "sample_extractor"}], "paper_keywords": ["Boolean functions", " property testing", " partial symmetry"], "paper_abstract": "Given a Boolean function f, the f-isomorphism testing problem requires a randomized algorithm to distinguish functions that are identical to f up to relabeling of the input variables from functions that are far from being so. An important open question in property testing is to determine for which functions f we can test f-isomorphism with a constant number of queries. Despite much recent attention to this question, essentially only two classes of functions were known to be efficiently isomorphism testable: symmetric functions and juntas. We unify and extend these results by showing that all partially symmetric functions-functions invariant to the reordering of all but a constant number of their variables-are efficiently isomorphism testable. This class of functions, first introduced by Shannon, includes symmetric functions, juntas, and many other functions as well. We conjecture that these functions are essentially the only functions efficiently isomorphism-testable. To prove our main result, we also show that partial symmetry is efficiently testable. In turn, to prove this result we had to revisit the junta testing problem. We provide a new proof of correctness of the nearly optimal junta tester. Our new proof replaces the Fourier machinery of the original proof with a purely combinatorial argument that exploits the connection between sets of variables with low influence and intersecting families. Another important ingredient in our proofs is a new notion of symmetric influence. We use this measure of influence to prove that partial symmetry is efficiently testable and also to construct an efficient sample extractor for partially symmetric functions. We then combine the sample extractor with the testing-by-implicit-learning approach to complete the proof that partially symmetric functions are efficiently isomorphism testable.", "paper_title": "PARTIALLY SYMMETRIC FUNCTIONS ARE EFFICIENTLY ISOMORPHISM TESTABLE", "paper_id": "WOS:000353967200006"}