{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "arbitrary_dimensions"}, {"score": 0.004631637679516574, "phrase": "dimension-independent_data_structure"}, {"score": 0.003588291565092195, "phrase": "suitable_subset"}, {"score": 0.0035290250358997904, "phrase": "adjacency_relations"}, {"score": 0.003283272764794988, "phrase": "storage_requirements"}, {"score": 0.003158088307044493, "phrase": "dimension-specific_and_dimension-independent_representations"}, {"score": 0.002810373366887749, "phrase": "existing_dimension-specific_ones"}, {"score": 0.0027486060614330043, "phrase": "efficient_algorithms"}, {"score": 0.0026881926384093088, "phrase": "simplicial_complex"}, {"score": 0.002486987042061596, "phrase": "topological_relations"}, {"score": 0.00230080652063411, "phrase": "incidence-based_representations"}, {"score": 0.0021763973978248005, "phrase": "boundary_simplices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Simplicial complexes", " Non-manifold data structures", " Topological data structures"], "paper_abstract": "We propose a compact, dimension-independent data structure for manifold, non-manifold and non-regular simplicial complexes, that we call the Generalized Indexed Data Structure with Adjacencies (IA* data structure). It encodes only top simplices, i.e. the ones that are not on the boundary of any other simplex, plus a suitable subset of the adjacency relations. We describe the IA* data structure in arbitrary dimensions, and compare the storage requirements of its 2D and 3D instances with both dimension-specific and dimension-independent representations. We show that the IA* data structure is more cost effective than other dimension-independent representations and is even slightly more compact than the existing dimension-specific ones. We present efficient algorithms for navigating a simplicial complex described as an IA* data structure. This shows that the IA* data structure allows retrieving all topological relations of a given simplex by considering only its local neighborhood and thus it is a more efficient alternative to incidence-based representations when information does not need to be encoded for boundary simplices. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "IA*: An adjacency-based representation for non-manifold simplicial shapes in arbitrary dimensions", "paper_id": "WOS:000292226700038"}