{"auto_keywords": [{"score": 0.04783182929351233, "phrase": "approximation_algorithms"}, {"score": 0.009925892451524363, "phrase": "generic_multi-variate_homogeneous_polynomial_function"}, {"score": 0.007520596124321659, "phrase": "polynomial-time_approximation_algorithms"}, {"score": 0.00481495049065317, "phrase": "homogeneous_polynomial_optimization"}, {"score": 0.0047689174754929195, "phrase": "quadratic_constraints"}, {"score": 0.00429057323623293, "phrase": "wide_applications"}, {"score": 0.004188702178897384, "phrase": "signal_processing"}, {"score": 0.0038047474331318974, "phrase": "polynomial_functions"}, {"score": 0.0036266207211763588, "phrase": "np"}, {"score": 0.0032308006242867224, "phrase": "multi-linear_tensor_function"}, {"score": 0.003184575071887037, "phrase": "cartesian"}, {"score": 0.0029914213495838998, "phrase": "worst-case_performance_ratios"}, {"score": 0.002527654365712841, "phrase": "provable_approximation_performance_ratios"}, {"score": 0.00236289633510808, "phrase": "co-centered_ellipsoids"}, {"score": 0.0022626835039082746, "phrase": "homogeneous_polynomial"}, {"score": 0.0021049977753042253, "phrase": "provable_worst-case_performance_ratios"}], "paper_keywords": ["Multi-linear tensor form", " Polynomial function optimization", " Approximation algorithm"], "paper_abstract": "In this paper, we consider approximation algorithms for optimizing a generic multi-variate homogeneous polynomial function, subject to homogeneous quadratic constraints. Such optimization models have wide applications, e.g., in signal processing, magnetic resonance imaging (MRI), data training, approximation theory, and portfolio selection. Since polynomial functions are non-convex, the problems under consideration are all NP-hard in general. In this paper we shall focus on polynomial-time approximation algorithms. In particular, we first study optimization of a multi-linear tensor function over the Cartesian product of spheres. We shall propose approximation algorithms for such problem and derive worst-case performance ratios, which are shown to be dependent only on the dimensions of the model. The methods are then extended to optimize a generic multi-variate homogeneous polynomial function with spherical constraint. Likewise, approximation algorithms are proposed with provable approximation performance ratios. Furthermore, the constraint set is relaxed to be an intersection of co-centered ellipsoids; namely, we consider maximization of a homogeneous polynomial over the intersection of ellipsoids centered at the origin, and propose polynomial-time approximation algorithms with provable worst-case performance ratios. Numerical results are reported, illustrating the effectiveness of the approximation algorithms studied.", "paper_title": "Approximation algorithms for homogeneous polynomial optimization with quadratic constraints", "paper_id": "WOS:000282829600007"}