{"auto_keywords": [{"score": 0.04902896582647276, "phrase": "digital_libraries"}, {"score": 0.03502408389490971, "phrase": "cognitive_style"}, {"score": 0.02573995021802734, "phrase": "digital_library"}, {"score": 0.00481495049065317, "phrase": "digital_library_users"}, {"score": 0.003987367359722647, "phrase": "key_elements"}, {"score": 0.00392153537973826, "phrase": "user_satisfaction"}, {"score": 0.003751228706861377, "phrase": "personalizing_factors"}, {"score": 0.00370981613076245, "phrase": "cognitive_styles"}, {"score": 0.0035290250358997904, "phrase": "relevant_parameters"}, {"score": 0.003175676186323053, "phrase": "web_personalized_service"}, {"score": 0.002921815042028607, "phrase": "time-consuming_test"}, {"score": 0.0026881926384093088, "phrase": "different_classification_systems"}, {"score": 0.0023788319661581696, "phrase": "classification_systems"}, {"score": 0.0022502133699402018, "phrase": "cognitive-style_point"}], "paper_keywords": [""], "paper_abstract": "Digital libraries have become one of the most important Web services for information seeking. One of their main drawbacks is their global approach: In general, there is just one interface for all users. One of the key elements in improving user satisfaction in digital libraries is personalization. When considering personalizing factors, cognitive styles have been proved to be one of the relevant parameters that affect information seeking. This justifies the introduction of cognitive style as one of the parameters of a Web personalized service. Nevertheless, this approach has one major drawback: Each user has to run a time-consuming test that determines his or her cognitive style. In this article, we present a study of how different classification systems can be used to automatically identify the cognitive style of a user using the set of interactions with a digital library. These classification systems can be used to automatically personalize, from a cognitive-style point of view, the interaction of the digital library and each of its users.", "paper_title": "Automatic cognitive style identification of digital library users for personalization", "paper_id": "WOS:000246379300009"}