{"auto_keywords": [{"score": 0.046301804206836855, "phrase": "mobile_learning"}, {"score": 0.03374211914374083, "phrase": "mobile_learning_system_design"}, {"score": 0.00481495049065317, "phrase": "mobile_learning_studies"}, {"score": 0.003984665807155269, "phrase": "research_purposes"}, {"score": 0.0038365781437074017, "phrase": "meta-analysis_approach"}, {"score": 0.0034244153725855, "phrase": "major_findings"}, {"score": 0.003317970131738248, "phrase": "mobile_learning_focus"}, {"score": 0.002999012736727594, "phrase": "primary_research_methods"}, {"score": 0.0029241700853970013, "phrase": "mobile_phones"}, {"score": 0.00264296841319955, "phrase": "emerging_technologies"}, {"score": 0.0023887436047824386, "phrase": "system_effectiveness"}, {"score": 0.0022142194702079866, "phrase": "research_trends"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["M-learning", " Research trends", " Evaluation methodologies", " Pedagogical issues"], "paper_abstract": "Two previous literature review-based studies have provided important insights into mobile learning, but the issue still needs to be examined from other directions such as the distribution of research purposes. This study takes a meta-analysis approach to systematically reviewing the literature, thus providing a more comprehensive analysis and synthesis of 164 studies from 2003 to 2010. Major findings include that most studies of mobile learning focus on effectiveness, followed by mobile learning system design, and surveys and experiments were used as the primary research methods. Also, mobile phones and PDAs are currently the most widely used devices for mobile learning but these may be displaced by emerging technologies. In addition, the most highly-cited articles are found to focus on mobile learning system design, followed by system effectiveness. These findings may provide insights for researchers and educators into research trends in mobile learning. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Review of trends from mobile learning studies: A meta-analysis", "paper_id": "WOS:000305036400056"}