{"auto_keywords": [{"score": 0.036539044699620084, "phrase": "process_planners"}, {"score": 0.00481495049065317, "phrase": "explicating_formal_geometrical_and_dimensional_tolerances_schema"}, {"score": 0.0047192824773697, "phrase": "three-dimensional_conformance_analysis"}, {"score": 0.00447331713604276, "phrase": "detailed_design_drawings"}, {"score": 0.004443482801729777, "phrase": "computer-aided_design"}, {"score": 0.004155822339559211, "phrase": "operation_parameters"}, {"score": 0.0037461743696712833, "phrase": "design_drawings"}, {"score": 0.003721171512886929, "phrase": "standard_geometrical_and_dimensional_tolerances"}, {"score": 0.003622811707147052, "phrase": "datum_reference_frames"}, {"score": 0.0031473840619203825, "phrase": "design_tolerances"}, {"score": 0.003115908199991072, "phrase": "manufacturing_datum_flow"}, {"score": 0.0030847461428168614, "phrase": "operation_sequence"}, {"score": 0.003043679504527297, "phrase": "resulting_plans"}, {"score": 0.002799080959445996, "phrase": "machining_process_plans"}, {"score": 0.0027710786693798534, "phrase": "first_step"}, {"score": 0.0027068216332674895, "phrase": "fixturing_method"}, {"score": 0.002644050667977234, "phrase": "basic_dimensions"}, {"score": 0.0025313026089662165, "phrase": "extracted_drf."}, {"score": 0.002514387630447547, "phrase": "shop_data"}, {"score": 0.00242335068996852, "phrase": "possible_geometric_variations"}, {"score": 0.0022434880661725493, "phrase": "datum_flow_chain"}, {"score": 0.0021049977753042253, "phrase": "t-map_math_model"}], "paper_keywords": [""], "paper_abstract": "A process plan is an instruction set for the manufacture of parts generated from detailed design drawings or computer-aided design (CAD) models. While these plans are highly detailed about machines, tools, fixtures, and operation parameters, tolerances typically show up in less formal manner, if at all. It is not uncommon to see only dimensional plus/minus values on rough sketches accompanying the instructions. On the other hand, design drawings use standard geometrical and dimensional tolerances (GD&T) symbols with datums and datum reference frames (DRFs) clearly specified. This is not to say that process planners do not consider tolerances; they are implied by way of choices of fixtures, tools, machines, and operations. Process planners do tolerance charting in converting design tolerances to the manufacturing datum flow based on operation sequence, but the resulting plans cannot be audited for conformance to design specification. In this paper, we present a framework for explicating the GD&T schema implied by machining process plans. The first step is to derive DRFs from the fixturing method in each setup. Then, basic dimensions for features machined in the setup are determined with respect to the extracted DRF. Using shop data for the machines and operations involved, the range of possible geometric variations are estimated for each type (form, size, orientation, and position). The sequence of operations determines the datum flow chain. Once we have a formal manufacturing GD&T schema, we can analyze and compare it to design specification using the T-map math model.", "paper_title": "A Framework for Explicating Formal Geometrical and Dimensional Tolerances Schema From Manufacturing Process Plans for Three-Dimensional Conformance Analysis", "paper_id": "WOS:000352819000004"}