{"auto_keywords": [{"score": 0.049613254104042076, "phrase": "carrier_sense_multiple_access"}, {"score": 0.04915207774681705, "phrase": "collision_avoidance"}, {"score": 0.00481495049065317, "phrase": "wireless_networks"}, {"score": 0.004452641437293878, "phrase": "good_performance"}, {"score": 0.00413767314434795, "phrase": "multi-hop_topologies"}, {"score": 0.004077394032903726, "phrase": "asymmetric_view"}, {"score": 0.004017989546119125, "phrase": "channel_state"}, {"score": 0.003940122359770492, "phrase": "throughput_distribution"}, {"score": 0.003319830633865628, "phrase": "receiver_detection"}, {"score": 0.0030847461428168614, "phrase": "physical_layer"}, {"score": 0.003024909947609294, "phrase": "handshake_mechanism"}, {"score": 0.0027832502848247303, "phrase": "historical_observations"}, {"score": 0.002391067964886602, "phrase": "handshake_sequence"}, {"score": 0.002333193766510394, "phrase": "interesting_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MAC", " CSMA/CA", " Receiver-initiated", " Evaluation", " Wireless", " Starvation", " Simulation"], "paper_abstract": "Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) has been adopted by the IEEE 802.11 standard and provides good performance when all transmitters are within the range of each other. Unfortunately, in multi-hop topologies, the asymmetric view of the channel state leads to a throughput distribution where a few flows may capture all the available bandwidth while many other flows get very low throughput and sometime meet starvation. To address this problem, in this paper we describe a solution called Carrier Sense Multiple Access with Collision Avoidance by Receiver Detection (CSMA/CARD) which makes use of collisions sensed by a receiver at the physical layer to help the handshake mechanism and mitigate the effect of such problem. More specifically, we propose a mechanism based on historical observations, where collisions can be used by the receiver to predict whether some sender attempted to initiate a transmission. The receiver then reacts accordingly by participating itself in a handshake sequence. We show some interesting results, obtained through analysis and simulations, when the CSMA/CARD is compared to the IEEE 802.11 protocol. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A new adaptive receiver-initiated scheme for mitigating starvation in wireless networks", "paper_id": "WOS:000313860800003"}