{"auto_keywords": [{"score": 0.049655608595442394, "phrase": "individual_scholars"}, {"score": 0.015719716506582538, "phrase": "bibliometric_indicators"}, {"score": 0.004709193603747991, "phrase": "large_data_set"}, {"score": 0.004667541072056214, "phrase": "citation_numbers"}, {"score": 0.004565007074039171, "phrase": "bibliographic_databases"}, {"score": 0.00450456611645112, "phrase": "standard_tools"}, {"score": 0.004327981760540394, "phrase": "research_activities"}, {"score": 0.00421410521089045, "phrase": "still_their_statistical_properties"}, {"score": 0.003754140294151593, "phrase": "large-scale_data_sets"}, {"score": 0.003404320684078852, "phrase": "google"}, {"score": 0.003299880298525127, "phrase": "entire_publication_record"}, {"score": 0.003198705576491802, "phrase": "scientific_profile"}, {"score": 0.002900426826591769, "phrase": "individual_scientists"}, {"score": 0.0027495914857929584, "phrase": "rather_weak_relation"}], "paper_keywords": ["Statistical analysis", " Citations", " h-Index"], "paper_abstract": "Citation numbers and other quantities derived from bibliographic databases are becoming standard tools for the assessment of productivity and impact of research activities. Though widely used, still their statistical properties have not been well established so far. This is especially true in the case of bibliometric indicators aimed at the evaluation of individual scholars, because large-scale data sets are typically difficult to be retrieved. Here, we take advantage of a recently introduced large bibliographic data set, Google Scholar Citations, which collects the entire publication record of individual scholars. We analyze the scientific profile of more than 30,000 researchers, and study the relation between the h-index, the number of publications and the number of citations of individual scientists. While the number of publications of a scientist has a rather weak relation with his/her h-index, we find that the h-index of a scientist is strongly correlated with the number of citations that she/he has received so that the number of citations can be effectively be used as a proxy of the h-index. Allowing for the h-index to depend on both the number of citations and the number of publications, we find only a minor improvement.", "paper_title": "Analysis of bibliometric indicators for individual scholars in a large data set", "paper_id": "WOS:000327219900007"}