{"auto_keywords": [{"score": 0.04715783641110323, "phrase": "original_features"}, {"score": 0.00481495049065317, "phrase": "pattern_classification"}, {"score": 0.00477190623242136, "phrase": "feature_construction"}, {"score": 0.004645057834614705, "phrase": "classification_tasks"}, {"score": 0.003987126862293129, "phrase": "domain_knowledge"}, {"score": 0.003933736547198066, "phrase": "underlying_principles"}, {"score": 0.0037104876694493815, "phrase": "simple_and_efficient_feature_construction_approach"}, {"score": 0.003611751858608048, "phrase": "concrete_classifiers"}, {"score": 0.0035794251590584563, "phrase": "data_domains"}, {"score": 0.0028844769395018595, "phrase": "new_feature_vector"}, {"score": 0.0028076592725295646, "phrase": "novel_work"}, {"score": 0.0026126405272417783, "phrase": "simple_rule"}, {"score": 0.0025660347613972573, "phrase": "generated_features"}, {"score": 0.0023770362063833903, "phrase": "local_classifier"}, {"score": 0.002282667669149476, "phrase": "proposed_method"}, {"score": 0.00216263228969761, "phrase": "noisy_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Classification", " Feature construction", " Feature selection", " Neighborhoods"], "paper_abstract": "Feature construction is much critical to support classification tasks when a combination of the original features carries more discriminative information. However, the construction of features usually implies searching a very large space of possibilities and is often computationally demanding. Besides, some approaches require domain knowledge and the underlying principles of some approaches are hard to interpret. This paper presents a simple and efficient feature construction approach, which is independent of concrete classifiers and data domains. It begins with generating the features by calculating the distances between the sample and its neighborhoods in each class as features, as they have abilities to distinguish the sample. These features are then applied to combine with the original features of the sample to form the new feature vector for the sample. The novel work of this method lies in that a new general framework to create features for the given sample and a simple rule to combine the generated features with the original features are presented. This approach has been validated by applying it to a local classifier in experiments. The results suggest that the proposed method can be applied to nicely deal with the sparse and the noisy data. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Multiple perceptual neighborhoods-based feature construction for pattern classification", "paper_id": "WOS:000340341400052"}