{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interdependent_infrastructure_systems"}, {"score": 0.00464811139983244, "phrase": "modern_society"}, {"score": 0.004509694461067052, "phrase": "civil_infrastructure_systems"}, {"score": 0.0033832583769880576, "phrase": "five_types"}, {"score": 0.0033492947290751996, "phrase": "infrastructure_interdependencies"}, {"score": 0.003233075944817365, "phrase": "network_flows_mathematical_representation"}, {"score": 0.0030431198971423937, "phrase": "lower_manhattan_region"}, {"score": 0.003012560489169148, "phrase": "new_york"}, {"score": 0.0029672941061574375, "phrase": "illustrative_purposes"}, {"score": 0.0027788478707700274, "phrase": "data_requirements"}, {"score": 0.002723301730223192, "phrase": "realistic_data"}, {"score": 0.0024617483174454113, "phrase": "major_disruption"}, {"score": 0.0022706700510423954, "phrase": "guiding_restoration"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["civil infrastructure systems", " emergency management", " mathematical programming", " networks"], "paper_abstract": "Modern society depends on the operations of civil infrastructure systems, such as transportation, energy, telecommunications, and water. These systems have become so interconnected, one relying on another, that disruption of one may lead to disruptions in all. The approach taken in this research is to model these systems by explicitly identifying these interconnections or interdependencies. Definitions of five types of infrastructure interdependencies are presented and incorporated into a network flows mathematical representation, i.e., an interdependent layer network model. Using the lower Manhattan region of New York, for illustrative purposes, the implementation of the model is shown. First, the data requirements are presented with realistic data on the interdependent infrastructure systems of power, telecommunications, and subways. Next, a scenario is given that causes major disruption in the services provided by these infrastructures and demonstrates the use of the model in guiding restoration of services. The paper concludes with a discussion of accomplishments and opportunities for future work.", "paper_title": "Restoration of services in interdependent infrastructure systems: A network flows approach", "paper_id": "WOS:000250395300019"}