{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unexpected_documents"}, {"score": 0.04753799882019955, "phrase": "large_corpora"}, {"score": 0.03889065839041926, "phrase": "unexpected_information"}, {"score": 0.030525322155516763, "phrase": "unexpectedminer"}, {"score": 0.0047283116134926645, "phrase": "text_mining"}, {"score": 0.00460125407969429, "phrase": "frequent_patterns"}, {"score": 0.004126123386192962, "phrase": "relational_databases"}, {"score": 0.003942877273973905, "phrase": "textual_data"}, {"score": 0.0036497740708342093, "phrase": "frequent_ones"}, {"score": 0.0035515951985356374, "phrase": "technology_watch"}, {"score": 0.0034092396400930446, "phrase": "new_trends"}, {"score": 0.003378385493203297, "phrase": "specific_markets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Text mining", " Unexpected patterns", " Information retrieval"], "paper_abstract": "Text mining is widely used to discover frequent patterns in large corpora of documents. Hence, many classical data mining techniques, that have been proven fruitful in the context of data stored in relational databases, are now successfully used in the context of textual data. Nevertheless, there are many situations where it is more valuable to discover unexpected information rather than frequent ones. In the context of technology watch for example, we may want to discover new trends in specific markets, or discover what competitors are planning in the near future, etc. This paper is related to that context of research. We have proposed several unexpectedness measures and implemented them in a prototype, called UnexpectedMiner, that can be used by watchers, in order to discover unexpected documents in large corpora of documents (patents, datasheets, advertisements, scientific papers, etc.). UnexpectedMiner is able to take into account the structure of documents during the discovery of unexpected information. Many experiments have been performed in order to validate our measures and show the interest of our system. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Discovering unexpected documents in corpora", "paper_id": "WOS:000269341700004"}