{"auto_keywords": [{"score": 0.04865905329192029, "phrase": "de_finetti"}, {"score": 0.03860453603548873, "phrase": "coherent_lower_previsions"}, {"score": 0.012098490186577875, "phrase": "desirable_gambles"}, {"score": 0.010178301229854634, "phrase": "natural_extension"}, {"score": 0.009910961348472337, "phrase": "walley's_theory"}, {"score": 0.009586543839961782, "phrase": "conglomerable_natural_extension"}, {"score": 0.00481495049065317, "phrase": "probability_theory"}, {"score": 0.004355163162038354, "phrase": "infinitely_many_conditional_bets"}, {"score": 0.004326115026411233, "phrase": "walley"}, {"score": 0.0039259432210911925, "phrase": "conglomerability_condition"}, {"score": 0.0038737214010638745, "phrase": "uncertainty_models"}, {"score": 0.0033206861608068025, "phrase": "weakest_extension"}, {"score": 0.003053894781246847, "phrase": "conglomerability-the_procedure"}, {"score": 0.0028179057379595124, "phrase": "marginal_extension"}, {"score": 0.0024478477463201302, "phrase": "sufficient_conditions"}, {"score": 0.002391067964886602, "phrase": "special_cases"}, {"score": 0.0023199918653986342, "phrase": "coherent_sets"}, {"score": 0.0021622381640810442, "phrase": "infinite_partitions"}, {"score": 0.0021477840826122853, "phrase": "conditioning_events"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Conglomerability", " Coherence", " Lower previsions", " Sets of desirable gambles", " Marginal extension"], "paper_abstract": "At the foundations of probability theory lies a question that has been open since de Finetti framed it in 1930: whether or not an uncertainty model should be required to be conglomerable. Conglomerability is related to accepting infinitely many conditional bets. Walley is one of the authors who have argued in favor of conglomerability, while de Finetti rejected the idea. In this paper we study the extension of the conglomerability condition to two types of uncertainty models that are more general than the ones envisaged by de Finetti: sets of desirable gambles and coherent lower previsions. We focus in particular on the weakest (i.e., the least-committal) of those extensions, which we call the conglomerable natural extension. The weakest extension that does not take conglomerability into account is simply called the natural extension. We show that taking the natural extension of assessments after imposing conglomerability-the procedure adopted in Walley's theory-does not yield, in general, the conglomerable natural extension (but it does so in the case of the marginal extension). Iterating this process of imposing conglomerability and taking the natural extension produces a sequence of models that approach the conglomerable natural extension, although it is not known, at this point, whether this sequence converges to it. We give sufficient conditions for this to happen in some special cases, and study the differences between working with coherent sets of desirable gambles and coherent lower previsions. Our results indicate that it is necessary to rethink the foundations of Walley's theory of coherent lower previsions for infinite partitions of conditioning events. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Conglomerable natural extension", "paper_id": "WOS:000309624800009"}