{"auto_keywords": [{"score": 0.04931971121682221, "phrase": "markovian_jump_parameters"}, {"score": 0.015719716506582538, "phrase": "stochastic_neural_networks"}, {"score": 0.014447430960181798, "phrase": "exponential_stability"}, {"score": 0.01356032341728277, "phrase": "mixed_time_delays"}, {"score": 0.00887670418245499, "phrase": "previous_literature"}, {"score": 0.004081385289516914, "phrase": "jumping_parameters"}, {"score": 0.003973971215091993, "phrase": "continuous-time_finite-state_markov_chain"}, {"score": 0.0034777028461723198, "phrase": "equilibrium_point"}, {"score": 0.003422462630994095, "phrase": "mean_square"}, {"score": 0.0033680968918579717, "phrase": "proposed_lmi-based_criteria"}, {"score": 0.003210110095236981, "phrase": "noise_perturbations"}, {"score": 0.00260657976055413, "phrase": "time-varying_and_distributed_delays"}, {"score": 0.0022087165619569006, "phrase": "theoretical_results"}, {"score": 0.002150481043278758, "phrase": "stability_criteria"}, {"score": 0.0021049977753042253, "phrase": "earlier_literature"}], "paper_keywords": ["Exponential stability", " linear matrix inequality (LMI)", " Lyapunov functional", " Markovian jump parameter", " mixed time delay", " stochastic neural network"], "paper_abstract": "In this paper, the problem of exponential stability is investigated for a class of stochastic neural networks with both Markovian jump parameters and mixed time delays. The jumping parameters are modeled as a continuous-time finite-state Markov chain. Based on a Lyapunov-Krasovskii functional and the stochastic analysis theory, a linear matrix inequality (LMI) approach is developed to derive some novel sufficient conditions, which guarantee the exponential stability of the equilibrium point in the mean square. The proposed LMI-based criteria are quite general since many factors, such as noise perturbations, Markovian jump parameters, and mixed time delays, are considered. In particular, the mixed time delays in this paper synchronously consist of constant, time-varying, and distributed delays, which are more general than those discussed in the previous literature. In the latter, either constant and distributed delays or time-varying and distributed delays are only included. Therefore, the results obtained in this paper generalize and improve those given in the previous literature. Two numerical examples are provided to show the effectiveness of the theoretical results and demonstrate that the stability criteria used in the earlier literature fail.", "paper_title": "Exponential Stability of Stochastic Neural Networks With Both Markovian Jump Parameters and Mixed Time Delays", "paper_id": "WOS:000288454300003"}