{"auto_keywords": [{"score": 0.04256358546174949, "phrase": "weak_bisimilarity"}, {"score": 0.00481495049065317, "phrase": "defender's_forcing"}, {"score": 0.0045726187330434025, "phrase": "so-called_normed_pushdown_processes"}, {"score": 0.003531474887552889, "phrase": "unrestricted_e-popping_pushdown_processes"}, {"score": 0.003378403247340943, "phrase": "stirling"}, {"score": 0.003353522529270604, "phrase": "senizergues"}, {"score": 0.003069006373093756, "phrase": "normed_case"}, {"score": 0.0029359118862487357, "phrase": "defender"}, {"score": 0.002860938351029155, "phrase": "bisimulation_games"}, {"score": 0.0026768142335374156, "phrase": "uniform_way"}, {"score": 0.0025892330566358503, "phrase": "undecidable_problems"}, {"score": 0.002570162055835289, "phrase": "prefix_rewrite_systems"}, {"score": 0.002541817937194794, "phrase": "pushdown_automata"}, {"score": 0.002431525473795068, "phrase": "decidability_question"}, {"score": 0.0021842976754894846, "phrase": "so-called_parallel_pushdown"}], "paper_keywords": ["theory", " verification", " bisimilarity", " pushdown automata", " process algebra", " undecidability"], "paper_abstract": "Stirling [1996, 1998] proved the decidability of bisimilarity on so-called normed pushdown processes. This result was substantially extended by Senizergues [1998, 2005] who showed the decidability of bisimilarity for regular (or equational) graphs of finite out-degree; this essentially coincides with weak bisimilarity of processes generated by (unnormed) pushdown automata where the e-transitions can only deterministically pop the stack. The question of decidability of bisimilarity for the more general class of so called Type -1 systems, which is equivalent to weak bisimilarity on unrestricted e-popping pushdown processes, was left open. This was repeatedly indicated by both Stirling and Senizergues. Here we answer the question negatively, that is, we show the undecidability of bisimilarity on Type -1 systems, even in the normed case. We achieve the result by applying a technique we call Defender's Forcing, referring to the bisimulation games. The idea is simple, yet powerful. We demonstrate its versatility by deriving further results in a uniform way. First, we classify several versions of the undecidable problems for prefix rewrite systems (or pushdown automata) as Pi(0)(1)-complete or Sigma(1)(1)-complete. Second, we solve the decidability question for weak bisimilarity on PA (Process Algebra) processes, showing that the problem is undecidable and even Sigma(1)(1)-complete. Third, we show Sigma(1)(1)-completeness of weak bisimilarity for so-called parallel pushdown (or multiset) automata, a subclass of (labeled, place/transition) Petri nets.", "paper_title": "Undecidability of bisimilarity by defender's forcing", "paper_id": "WOS:000253939800005"}