{"auto_keywords": [{"score": 0.04132712815039597, "phrase": "segregation_rate"}, {"score": 0.00481495049065317, "phrase": "discrete_particle_method."}, {"score": 0.004579780586951551, "phrase": "continuum_models"}, {"score": 0.004466519142879166, "phrase": "different_sizes"}, {"score": 0.0028327783069076883, "phrase": "continuum_model"}, {"score": 0.0025409639091476363, "phrase": "particle_size_ratio"}, {"score": 0.002519800066326798, "phrase": "reasonable_agreement"}, {"score": 0.002447101794397243, "phrase": "measurable_discrepancies"}, {"score": 0.002346861891137455, "phrase": "thick_pure_phase"}, {"score": 0.002327310963701377, "phrase": "large_particles"}, {"score": 0.00216755493625594, "phrase": "peclet_number"}, {"score": 0.00212268510072928, "phrase": "size_ratio"}, {"score": 0.0021049977753042253, "phrase": "low_values"}], "paper_keywords": ["Granular materials", " DPM (DEM)", " segregation", " continuum approach"], "paper_abstract": "Over the last 25 years a lot of work has been undertaken on constructing continuum models for segregation of particles of different sizes. We focus on one model that is designed to predict segregation and remixing of two differently sized particle species. This model contains two dimensionless parameters: S-r, a measure of the segregation rate, and D-r, a measure of the strength of diffusion. These, in general, depend on both flow and particle properties and one of the weaknesses of the model is that these dependencies are not predicted. They have to be determined by either experiments or simulations. We present steady-state, periodic, chute-flow simulations using the discrete particle method (DPM) for several bi-disperse systems with different size ratios. The aim is to determine one parameter in the continuum model, i.e. the segregation Peclet number (ratio of the segregation rate to diffusion, S-r/D-r) as a function of the particle size ratio. Reasonable agreement is found; but, also measurable discrepancies are reported; mainly, in the simulations a thick pure phase of large particles is formed at the top of the flow. Additionally, it was found that the Peclet number increases linearly with the size ratio for low values, but saturates to a value of approximately 7.7.", "paper_title": "MODELING OF PARTICLE SIZE SEGREGATION: CALIBRATION USING THE DISCRETE PARTICLE METHOD", "paper_id": "WOS:000307849200015"}