{"auto_keywords": [{"score": 0.010298047683139059, "phrase": "vigorous_wrist_motion"}, {"score": 0.00481495049065317, "phrase": "growing_prevalence"}, {"score": 0.004565007074039171, "phrase": "energy_intake"}, {"score": 0.004139850082354509, "phrase": "considerable_manual_effort"}, {"score": 0.0038728151007982378, "phrase": "long_term"}, {"score": 0.003687960013746783, "phrase": "new_method"}, {"score": 0.0036229421570951807, "phrase": "watch-like_configuration"}, {"score": 0.003527550673371394, "phrase": "wrist_motion"}, {"score": 0.003329368827624161, "phrase": "novel_idea"}, {"score": 0.002836601200672692, "phrase": "large_dataset"}, {"score": 0.00241658945942583, "phrase": "event_logs"}, {"score": 0.002290858045013009, "phrase": "useful_indicator"}, {"score": 0.002123831297790248, "phrase": "continued_development"}, {"score": 0.0021049977753042253, "phrase": "body-worn_sensor_tools"}], "paper_keywords": ["Accelerometer", " activity recognition", " body motion tracking", " energy intake", " gyroscope", " obesity"], "paper_abstract": "This paper is motivated by the growing prevalence of obesity, a health problem affecting over 500 million people. Measurements of energy intake are commonly used for the study and treatment of obesity. However, the most widely used tools rely upon self-report and require a considerable manual effort, leading to underreporting of consumption, noncompliance, and discontinued use over the long term. The purpose of this paper is to describe a new method that uses a watch-like configuration of sensors to continuously track wrist motion throughout the day and automatically detect periods of eating. Our method uses the novel idea that meals tend to be preceded and succeeded by the periods of vigorous wrist motion. We describe an algorithm that segments and classifies such periods as eating or noneating activities. We also evaluate our method on a large dataset (43 subjects, 449 total h of data, containing 116 periods of eating) collected during free-living. Our results show an accuracy of 81% for detecting eating at 1-s resolution in comparison to manually marked event logs of periods eating. These results indicate that vigorous wrist motion is a useful indicator for identifying the boundaries of eating activities, and that our method should prove useful in the continued development of body-worn sensor tools for monitoring energy intake.", "paper_title": "Detecting Periods of Eating During Free-Living by Tracking Wrist Motion", "paper_id": "WOS:000340119000017"}