{"auto_keywords": [{"score": 0.045080525298987595, "phrase": "competitive_advantages"}, {"score": 0.00948232313583489, "phrase": "information_technology"}, {"score": 0.0065553798595183715, "phrase": "china"}, {"score": 0.005037249452443521, "phrase": "firm's_competitive_advantage"}, {"score": 0.004751889650408546, "phrase": "competitive_advantage"}, {"score": 0.004710306419574744, "phrase": "logistics_firms"}, {"score": 0.004276120412040056, "phrase": "third-party_logistics"}, {"score": 0.004074212307838049, "phrase": "questionnaire-based_mail_survey"}, {"score": 0.004003169429008801, "phrase": "mainland_china"}, {"score": 0.003968112038249246, "phrase": "spline_regressions"}, {"score": 0.0034018288705284427, "phrase": "modeled_relationship"}, {"score": 0.003317151908853188, "phrase": "pioneering_study"}, {"score": 0.0032697235411641695, "phrase": "different_cultural_environments"}, {"score": 0.0032410683344688625, "phrase": "industrial_settings"}, {"score": 0.003198554193075258, "phrase": "sample_size"}, {"score": 0.002790511479398411, "phrase": "business_strategy"}, {"score": 0.002753891109273246, "phrase": "it-related_management_skills"}, {"score": 0.0021049977753042253, "phrase": "valuable_guidance"}], "paper_keywords": ["information", " technology led strategy", " competitive advantage", " logistics data processing", " China"], "paper_abstract": "Purpose - This paper seeks to examine the impact of information technology (IT) on the competitive advantages of third-party logistics (3PL) firms in China. Design/methodology/approach - A questionnaire-based mail survey was conducted in mainland China. Spline regressions were used to model the relationship between IT and competitive advantages. Findings - This study found that IT could significantly influence a firm's competitive advantage, and the effects are nonlinear. Research limitations/implications - The modeled relationship between IT and competitive advantages may not hold in different cultural environments and industrial settings. The sample size was small. Practical implications - A higher IT focus may improve a firm's competitive advantage. To achieve competitive advantages efficiently, it is essential to integrate IT, align IT strategy and business strategy, obtain IT-related management skills, and achieve IT competency. 3PL managers can expect competitive advantages from their investments in IT to begin showing up when the deployment of IT is higher than the average relative to competitors. Originality/value - This paper is a pioneering study that investigates the relationship between IT and competitive advantages in 3PL firms; is a pioneering study on IT and its impact on competitive advantages in China's 3PL firms; and provides valuable guidance and insights for 3PL managers to improve competitive advantages using information technology.", "paper_title": "The impact of information technology on the competitive advantage of logistics firms in China", "paper_id": "WOS:000242114700002"}