{"auto_keywords": [{"score": 0.03408522284914619, "phrase": "scientific_community"}, {"score": 0.00481495049065317, "phrase": "virtual_world"}, {"score": 0.004740823885631586, "phrase": "mixed_reality"}, {"score": 0.004219912413995784, "phrase": "physical_learning"}, {"score": 0.004138813595009761, "phrase": "academic_environment"}, {"score": 0.004027876348834879, "phrase": "virtual_worlds"}, {"score": 0.003904713104101532, "phrase": "learning_experiences"}, {"score": 0.003756021561809324, "phrase": "emotional_state"}, {"score": 0.0035024511562752395, "phrase": "csikszentmihalyi"}, {"score": 0.003304224820203298, "phrase": "proposed_model"}, {"score": 0.003129317057177867, "phrase": "theoretical_models"}, {"score": 0.0031050953733360825, "phrase": "experimental_results"}, {"score": 0.002752695791351096, "phrase": "wheelchair_simulator"}, {"score": 0.002421291757425244, "phrase": "main_findings"}, {"score": 0.002222780643552078, "phrase": "theoretical_measures"}, {"score": 0.0021970000365512227, "phrase": "empirical_values"}, {"score": 0.0021049977753042253, "phrase": "mcgonigal"}], "paper_keywords": ["Accessibility", " Simulation", " Wheelchair", " Virtual Worlds", " disability", " social awareness", " learning", " 3DOF", " Unity3D", " flow state"], "paper_abstract": "Psychology has widely probed the relationship between body, mind and emotions, these findings have been traditionally applied to physical learning but its penetration into the academic environment was still slower than expected. Virtual worlds, augmented reality and gamification applied to learning experiences, have once again highlighted the correlation between the emotional state of the student and his learning outcomes. There have been many studies around the concept of flow proposed by Csikszentmihalyi in 1988, what factors influence their extent and how to promote it. Although the proposed model is widely accepted by the scientific community there are some studies showing discrepancies between theoretical models and experimental results. The scientific community demands more studies on how to measure flow and how to analyse the factors behind these discrepancies. This paper presents a study with 20 students between 21 and 36 years using a wheelchair simulator to reach awareness about the difficulties that people with disabilities face daily. Experience confirms the discrepancies between emotions calculated from the model and expressed directly by students. Two of the main findings of this study are: (1) the influence of gender on emotions and (2) some of the factors that moderate the theoretical measures to fit empirical values are related to the four defining traits of a game proposed by McGonigal (challenging goals, clear rules, real time feedback and voluntary participation).", "paper_title": "PhyMEL-WS: Physically Experiencing the Virtual World. Insights into Mixed Reality and Flow State on Board a Wheelchair Simulator", "paper_id": "WOS:000347734300003"}