{"auto_keywords": [{"score": 0.034526216484340136, "phrase": "black_hole_attacks"}, {"score": 0.013986395475240136, "phrase": "external_agent_infiltration"}, {"score": 0.0048189640602846915, "phrase": "survey"}, {"score": 0.004763565662615503, "phrase": "black_hole_attack_detection"}, {"score": 0.004712726613162057, "phrase": "mobile_ad_hoc_network"}, {"score": 0.004612662942073808, "phrase": "wireless_mobile_ad_hoc_network"}, {"score": 0.003470358620464986, "phrase": "growing_interest"}, {"score": 0.003034189076659334, "phrase": "manet"}, {"score": 0.0027543636132088332, "phrase": "confirmation_rrep"}, {"score": 0.0024339783012484032, "phrase": "black_hole_node"}, {"score": 0.0022453451864218477, "phrase": "data_packets"}, {"score": 0.0021049977753042253, "phrase": "existing_solutions"}], "paper_keywords": ["MANETs (Mobile ad hoc networks)", " Black hole attack", " RREP", " EERQ"], "paper_abstract": "In a wireless mobile ad hoc network (MANET), Similar to other systems, there is a risk of external agent infiltration. These networks are basically no-infrastructure, meaning no routing such as router or switch is used. So, they are highly posed to the risk of damage or exhausting all their common behavior energy. Hence, there is a growing interest towards the methods which can warn the network against the black hole attacks and external agent infiltration. black hole attacks which are among the most dangerous network attacks one of such security issue in MANET, These attacks are induced through each nodes existing in the network, where the node sends confirmation RREP to RREQ, no matter what its routing table is or whether a route exists towards the node. By doing this, the black hole node can deprive the traffic from the source node. so as to get all data packets and drops it. In this paper, we survey the existing solutions, classify type of attacks and black hole attacks.", "paper_title": "A Survey over Black hole Attack Detection in Mobile Ad hoc Network", "paper_id": "WOS:000360797100008"}