{"auto_keywords": [{"score": 0.04063185478507006, "phrase": "new_insights"}, {"score": 0.004685575787741084, "phrase": "big_data"}, {"score": 0.0046432244185370605, "phrase": "smart_data"}, {"score": 0.00460125407969429, "phrase": "data-intensive_science"}, {"score": 0.004539005582217305, "phrase": "smart_dust_highlight"}, {"score": 0.004397000006837371, "phrase": "common_theme"}, {"score": 0.004259418153299952, "phrase": "data-centered_perspective"}, {"score": 0.003907212558276185, "phrase": "thematic_resolution"}, {"score": 0.0036663981146086103, "phrase": "strong_domain_theories"}, {"score": 0.0035194572615570977, "phrase": "envisioned_methodologies"}, {"score": 0.0033630629374009607, "phrase": "predictive_analytics"}, {"score": 0.0032429499567088113, "phrase": "data_mining"}, {"score": 0.0027407299369891502, "phrase": "required_data"}, {"score": 0.0027159094186967247, "phrase": "today's_chaotic_information_universe"}, {"score": 0.002423931101340771, "phrase": "semantic_web"}, {"score": 0.0022847009758393405, "phrase": "data_train"}, {"score": 0.0022640009579466924, "phrase": "semantic_rails"}, {"score": 0.0021049977753042253, "phrase": "inductive_and_deductive_techniques"}], "paper_keywords": [""], "paper_abstract": "While catchphrases such as big data, smart data, data-intensive science, or smart dust highlight different aspects, they share a common theme namely, a shift toward a data-centered perspective in which the synthesis and analysis of data at an ever-increasing spatial, temporal, and thematic resolution promise new insights, while, at the same time, reduce the need for strong domain theories as starting points. In terms of the envisioned methodologies, those catchphrases tend to emphasize the role of predictive analytics, that is, statistical techniques including data mining and machine learning, as well as supercomputing. Interestingly, however, while this perspective takes the availability of data as a given, it does not answer the question how one would discover the required data in today's chaotic information universe, how one would understand which data sets can be meaningfully integrated, and how to communicate the results to humans and machines alike. The semantic web addresses these questions. In the following, we argue why the data train needs semantic rails. We point out that making sense of data and gaining new insights work best if inductive and deductive techniques go hand-in-hand instead of competing over the prerogative of interpretation.", "paper_title": "Why the Data Train Needs Semantic Rails", "paper_id": "WOS:000353079700002"}