{"auto_keywords": [{"score": 0.028045396569549026, "phrase": "mac"}, {"score": 0.004939156983194017, "phrase": "aes"}, {"score": 0.00481495049065317, "phrase": "iar-ctr"}, {"score": 0.0047787596516662, "phrase": "iar-cfb"}, {"score": 0.00443141503046841, "phrase": "real-time_crypto_system"}, {"score": 0.004315879542755464, "phrase": "strong_security_level"}, {"score": 0.00409372989087314, "phrase": "conventional_stream_cipher_modes"}, {"score": 0.003614124997453808, "phrase": "unauthorized_message_modification"}, {"score": 0.003226899588787952, "phrase": "secure_block_algorithm"}, {"score": 0.0032026066791743866, "phrase": "advanced_encryption_standard"}, {"score": 0.003014713272570927, "phrase": "based_ae_environment"}, {"score": 0.0026915366885986586, "phrase": "single_pass"}, {"score": 0.0026611838252683507, "phrase": "message_authentication_code"}, {"score": 0.0026113524778702624, "phrase": "even_any_kind"}, {"score": 0.0023938516706864775, "phrase": "chosenplain-text_attacks"}, {"score": 0.0022493207034415563, "phrase": "cfb"}, {"score": 0.0022363199197710385, "phrase": "'limited_error_propagation"}, {"score": 0.0022112714143899424, "phrase": "ofb"}, {"score": 0.0021451873499061633, "phrase": "ctr._copyright"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["privacy", " integrity", " indicator", " authenticated encryption", " low latency", " low jitter", " real-time"], "paper_abstract": "It is highly desirable that a real-time crypto system should be designed to offer a strong security level by assuring both the privacy and integrity together in the same podium. However, the conventional stream cipher modes of operation (counter (CTR), cipher feedback (CFB), and Output Feedback (OFB)), often used in several real-time applications, are unable to prevent any unauthorized message modification, which may often lead to several active attacks. This article shows a way to construct the real-time based Authenticated Encryption (AE) environment, where the real-time key stream is generated from any secure block algorithm like Advanced Encryption Standard (AES). Accordingly, in order to demonstrate the principle of the real-time based AE environment, here we introduce two modes of operations, namely integrity aware real-time based counter (IAR-CTR) and cipher feedback (IAR-CFB) modes, where both the proposed modes of operations can guarantee to offer both the confidentiality and message integrity in a single pass without any Message Authentication Code (MAC) or even any kind of non-crypto checksum Cyclic Redundancy Check (CRC) support. Besides, here we argue that both the proposed real-time based AE environments are quite robust against several active attacks, for example, message stream modification attacks and chosenplain-text attacks, and at the same time, they can also be useful to deal with some other issues like 'limited error propagation' existing in several conventional stream cipher modes like CFB, OFB, and CTR. Copyright (C) 2015 John Wiley & Sons, Ltd.", "paper_title": "IAR-CTR and IAR-CFB: integrity aware real-time based counter and cipher feedback modes", "paper_id": "WOS:000367922500052"}