{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "proactive_strategy"}, {"score": 0.01367084615309851, "phrase": "mutation_rate"}, {"score": 0.00481495049065317, "phrase": "distributed_eas"}, {"score": 0.004471978831302331, "phrase": "new_distributed_evolutionary_algorithm"}, {"score": 0.0040978781692373005, "phrase": "proactive_decision"}, {"score": 0.003195236629209403, "phrase": "genetic_diversity"}, {"score": 0.003131393466870228, "phrase": "desired_level"}, {"score": 0.002755567647101251, "phrase": "problem_solution"}, {"score": 0.0025761937402886954, "phrase": "local_minima"}, {"score": 0.002507748938616919, "phrase": "computational_experiments"}, {"score": 0.0024742098091226203, "phrase": "large_instances"}, {"score": 0.0024247382451294255, "phrase": "nk_landscape_problem"}, {"score": 0.0023131084326717755, "phrase": "traditional_deas"}], "paper_keywords": ["Proactive behavior", " Distributed EAs", " Migration period"], "paper_abstract": "In this work we propose a new distributed evolutionary algorithm that uses a proactive strategy to adapt its migration policy and the mutation rate. The proactive decision is carried out locally in each subpopulation based on the entropy of that subpopulation. In that way, each subpopulation can change their own incoming flow of individuals by asking their neighbors for more frequent or less frequent migrations in order to maintain the genetic diversity at a desired level. Moreover, this proactive strategy is reinforced by adapting the mutation rate while the algorithm is searching for the problem solution. All these strategies avoid the subpopulations to get trapped into local minima. We conduct computational experiments on large instances of the NK landscape problem which have shown that our proactive approach outperforms traditional dEAs, particularly for not highly rugged landscapes, in which it does not only reaches the most accurate solutions, but it does the fastest.", "paper_title": "Enhancing distributed EAs by a proactive strategy", "paper_id": "WOS:000336424400006"}