{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "older_adults"}, {"score": 0.015521306991853608, "phrase": "case_study"}, {"score": 0.015390405415585397, "phrase": "website_redesign"}, {"score": 0.004652845998457721, "phrase": "complex_task"}, {"score": 0.004573842508130535, "phrase": "organised_use"}, {"score": 0.0045348429403481464, "phrase": "design_methods"}, {"score": 0.004419819325202464, "phrase": "meaningful_assessments"}, {"score": 0.004363401436068803, "phrase": "important_reason"}, {"score": 0.004162602203448056, "phrase": "'non-traditional'_user_groups"}, {"score": 0.0038868464660354626, "phrase": "touristic_web_portal"}, {"score": 0.003692040748097991, "phrase": "redesign_process"}, {"score": 0.0034621581245372138, "phrase": "web_design"}, {"score": 0.0031102878400698143, "phrase": "interactive_online_prototype"}, {"score": 0.002904040426340639, "phrase": "hoc_interviews"}, {"score": 0.0027940789980683, "phrase": "redesigned_website"}, {"score": 0.0025207284405252914, "phrase": "web_redesign_process"}], "paper_keywords": ["online prototyping", " older adults", " comparative evaluation", " guidelines", " principles", " web redesign"], "paper_abstract": "Website redesign is a complex task that requires the organised use of design methods and guidelines as well as meaningful assessments. An important reason for website redesign is to enhance the usability and accessibility for 'non-traditional' user groups like the older population. The paper presents a case study of the redesign of a touristic web portal in order for it to be senior-friendly. The redesign process involved: (a) identification of a set of 7 principles and 45 guidelines (7p/45g) for web design for older adults; (b) heuristic evaluation of the original website on the basis of the identified 7p/45g set; (c) redesign of the website in an interactive online prototype; and (d) comparative summative usability evaluation, which involved 12 older users and post hoc interviews and questionnaires. The results showed that the redesigned website was significantly more usable and acceptable than the original. This study makes two contributions in the field: first, it outlines a web redesign process for older adults, which is effective in terms of time and cost, making use of various assessments of experts and users; second, it presents the application of this process in a manner that can be adopted and repeated in other redesign cases.", "paper_title": "Redesigning websites for older adults: a case study", "paper_id": "WOS:000335849100003"}