{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smoking_cessation_website"}, {"score": 0.039671672094659736, "phrase": "smoking_cessation_websites"}, {"score": 0.0318323006519255, "phrase": "current_and_former_smokers"}, {"score": 0.031198882608858298, "phrase": "discussion_forums"}, {"score": 0.004525629293824217, "phrase": "smoking_cessation_tool"}, {"score": 0.0040186038781533946, "phrase": "smoking_cessation_support"}, {"score": 0.0036427316134070007, "phrase": "similar_content"}, {"score": 0.0028273061946184645, "phrase": "new_feature"}, {"score": 0.002755104031926742, "phrase": "addiction_treatment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["smoking cessation", " Internet", " computer systems evaluation"], "paper_abstract": "Objective: To present a smoking cessation website and a reflection on the use of the Internet as a smoking cessation tool. Methods: A Literature review and an Internet survey in 1506 current and former evaluation smokers. Results: The Internet may be the only form of smoking cessation support available to many smokers. There is a competition between hundreds of smoking cessation websites, many of which have a similar content. Smoking cessation websites are popular, but little scientific evidence is available on their efficacy. Neither do we know which components of these websites are most effective in motivating and helping smokers quit smoking and avoid relapse. Groups of current and former smokers form spontaneously in discussion forums on the Internet, this is a new feature in the field of addiction treatment. These discussion forums have not yet been the object of much scientific research. Conclusion: Research should be conducted to assess the efficacy of smoking cessation website, to identify which of their components are most effective, and to identify subgroups of current and former smokers for whom websites are most effective. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Internet-based smoking cessation programs", "paper_id": "WOS:000234947400011"}