{"auto_keywords": [{"score": 0.04479104178564006, "phrase": "skin_penetration_enhancement"}, {"score": 0.015562892822886143, "phrase": "qsar_models"}, {"score": 0.011687584806198721, "phrase": "significant_qsar_models"}, {"score": 0.00481495049065317, "phrase": "skin_penetration_enhancers"}, {"score": 0.00441738161338662, "phrase": "classic_qsar_descriptors"}, {"score": 0.004198965651975536, "phrase": "hydrocortisone_acetate"}, {"score": 0.003911135156992, "phrase": "penetration_enhancement"}, {"score": 0.003793876828939456, "phrase": "net_permeation"}, {"score": 0.003642962673467835, "phrase": "common_fixed_concentration"}, {"score": 0.003462704420080129, "phrase": "linear_regression"}, {"score": 0.00317643367669255, "phrase": "trial_descriptor_pool"}, {"score": 0.003144345057121367, "phrase": "reasonable_qsar_models"}, {"score": 0.0027414948679658816, "phrase": "descriptor_terms"}, {"score": 0.0025663181430010686, "phrase": "best_qsar_models"}, {"score": 0.0024641134634779535, "phrase": "significant_extent"}, {"score": 0.0024392031587145728, "phrase": "similar_terms"}, {"score": 0.002342048999008582, "phrase": "penetration-enhancer_systems"}, {"score": 0.002203509076886664, "phrase": "distinct_mechanisms"}], "paper_keywords": [""], "paper_abstract": "QSAR models for four skin penetration enhancer data sets of 61, 44, 42, and 17 compounds were constructed using classic QSAR descriptors and 4D-fingerprints. Three data sets involved skin penetration enhancement of hydrocortisone and hydrocortisone acetate. The other data set involved skin penetration enhancement of fluorouracil. The measure of penetration enhancement is the ratio of the net permeation of the penetrant with and without a common fixed concentration of enhancer. Significant QSAR models could be built using multidimensional linear regression fitting and genetic function model optimization for all four data sets when both classic and 4D-fingerprint descriptors were used in the trial descriptor pool. Reasonable QSAR models could be built when only 4D-fingerprint descriptors were employed, and no significant QSAR models could be built using only classic descriptors for two of the four data sets. Comparison analyses of the descriptor terms, and their respective regression coefficients, across the pairs of the best QSAR models of the four skin penetration enhancer data sets did not reveal any significant extent of similar terms. Overall, the QSAR models for the penetration-enhancer systems appear meaningfully different from one another, suggesting that there are distinct mechanisms of skin penetration enhancement that depend on the chemistry of both the enhancer and the penetrant.", "paper_title": "QSAR analyses of skin penetration enhancers", "paper_id": "WOS:000246776400046"}