{"auto_keywords": [{"score": 0.046957022409536184, "phrase": "soil_consolidation"}, {"score": 0.00481495049065317, "phrase": "ground_improvement"}, {"score": 0.004446677711302801, "phrase": "prefabricated_vertical_drains"}, {"score": 0.0035887342563437935, "phrase": "design_process"}, {"score": 0.0033548062793973144, "phrase": "finite_element_method"}, {"score": 0.003253560798692431, "phrase": "femc"}, {"score": 0.0026576091519087065, "phrase": "complex_femc_approach"}, {"score": 0.0025148871904409095, "phrase": "soil_spatial_variability"}, {"score": 0.002469032978674379, "phrase": "rbsa_method"}, {"score": 0.0023944552329463035, "phrase": "similar_results"}, {"score": 0.0023079225317714815, "phrase": "femc_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reliability-based design", " Soil consolidation", " Prefabricated vertical drains", " Finite element method", " Monte Carlo technique", " Soil spatial variability"], "paper_abstract": "The design of soil consolidation via prefabricated vertical drains (PVDs) has been traditionally carried out deterministically and thus can be misleading due to the ignorance of the uncertainty associated with the inherent (spatial) variation of soil properties. To treat such uncertainty in the design process of soil consolidation by PVDs, stochastic approaches that combine the finite element method with the Monte Carlo technique (FEMC) have been usually used. However, such approaches are complex, computationally intensive and time consuming. In this paper, a simpler reliability-based semi-analytical (RBSA) method is proposed as an alternative tool to the complex FEMC approach for soil, consolidation by PVDs, considering soil spatial variability. The RBSA method is found to give similar results to those obtained from the FEMC approach and can thus be used with confidence in practice. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Reliability-based semi-analytical solution for ground improvement by PVDs incorporating inherent (spatial) variability of soil", "paper_id": "WOS:000354140400011"}