{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "citation_behaviours"}, {"score": 0.004640311812502743, "phrase": "disciplinary_differences"}, {"score": 0.004029592719134717, "phrase": "obsolescence_characteristics"}, {"score": 0.003922685601503529, "phrase": "diachronic_counts"}, {"score": 0.0038443635340052523, "phrase": "document_types"}, {"score": 0.0037423521744765075, "phrase": "journal_impact_and_journal_usage_measures"}, {"score": 0.0033492947290751996, "phrase": "downloaded_documents"}, {"score": 0.0030380052848799155, "phrase": "cited_documents"}, {"score": 0.0028498718992429825, "phrase": "document_type"}, {"score": 0.002811770047652563, "phrase": "citation-specific_characteristics"}, {"score": 0.002783527398566117, "phrase": "observed_subject_areas"}, {"score": 0.0024909230668523847, "phrase": "whole_scientific_community"}, {"score": 0.0023923066544220277, "phrase": "perfect_proxy"}, {"score": 0.0023603078194781965, "phrase": "overall_usage"}, {"score": 0.002282166507956957, "phrase": "downloaded_material"}, {"score": 0.002251637552201872, "phrase": "invaluable_information"}, {"score": 0.002206606452557159, "phrase": "publication_and_communication_processes"}, {"score": 0.002155204688099519, "phrase": "unique_nature"}], "paper_keywords": ["Citations", " Downloads", " Citation metrics", " Usage metrics", " Impact factor", " Usage factor", " Disciplinary differences", " Articles in press"], "paper_abstract": "This study puts an emphasis on the disciplinary differences observed for the behaviour of citations and downloads. This was exemplified by studying citations over the last 10 years in four selected fields, namely, arts and humanities, computer science, economics, econometrics, and finance, and oncology. Differences in obsolescence characteristics were studied using synchronic as well as diachronic counts. Furthermore, differences between document types were taken into consideration and correlations between journal impact and journal usage measures were calculated. The number of downloads per document remains almost constant for all four observed areas within the last four years, varying from approximately 180 (oncology) to 300 (economics). The percentage of downloaded documents is higher than 90 % for all areas. The number of citations per document ranges from one (arts and humanities) to three (oncology). The percentages of cited documents range from 40 to 56 %. According to our study, 50-140 downloads correspond to one citation. A differentiation according to document type reveals further download- and citation-specific characteristics for the observed subject areas. This study points to the fact that citations can only measure the impact in the 'publish or perish' community; however, this approach is neither applicable to the whole scientific community nor to society in general. Downloads may not be a perfect proxy to estimate the overall usage. Nevertheless, they measure at least the intention to use the downloaded material, which is invaluable information in order to better understand publication and communication processes. Usage metrics should consider the unique nature of downloads and ought to reflect their intrinsic differences from citations.", "paper_title": "Usage versus citation behaviours in four subject areas", "paper_id": "WOS:000343609900011"}