{"auto_keywords": [{"score": 0.004401342842183475, "phrase": "complete_digital_environment"}, {"score": 0.004322967486451877, "phrase": "human_intervention"}, {"score": 0.0042920078348374375, "phrase": "arbitrary_complex_polygonal_worlds"}, {"score": 0.004185377431624781, "phrase": "today's_computers"}, {"score": 0.004140490129683107, "phrase": "processed_information"}, {"score": 0.004052148727852149, "phrase": "limited_number"}, {"score": 0.0037305551963210523, "phrase": "route_finding"}, {"score": 0.0033249931673591457, "phrase": "robot_navigation"}, {"score": 0.003105305189036267, "phrase": "arbitrary_building"}, {"score": 0.002942138511829811, "phrase": "tactical_military_units"}, {"score": 0.0028792911886505526, "phrase": "specific_locations"}, {"score": 0.002396371892825691, "phrase": "popular_computer_game"}, {"score": 0.0023877589586497948, "phrase": "quake_iii_arena"}, {"score": 0.002362105010110277, "phrase": "artificial_players"}, {"score": 0.0022298571016688335, "phrase": "polygonal_worlds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["automated path finding", " automated route finding", " motion planning", " geometric path planning", " navigation through polygonal worlds", " hierarchical routing", " Quake III Arena", " game AI"], "paper_abstract": "A complete system for path and route finding through arbitrary complex three-dimensional (313) polygonal worlds is presented. The system is fully automated and can quickly map a complete digital environment without the need for human intervention. Arbitrary complex polygonal worlds can be processed within a few minutes on today's computers. The processed information allows a robot with a limited number of degrees of freedom to efficiently navigate around obstacles and find routes through the environment. The system is especially suitable for route finding and navigation through buildings which are typically designed with the use of computers these days. As such, digital polygonal representations of buildings are readily available. Not only can the system be used for robot navigation, it can also be used to guide people through buildings. Being able to quickly compile an arbitrary building into a route and path finding system can be especially useful for firemen and tactical military units to invade buildings and reach specific locations. When a building is partly destroyed or inaccessible for other reasons, the digital representation of the building can easily be adjusted by adding or removing polygons and the system presented here can be used to quickly recalculate routes. The system has been successfully implemented and employed in the popular computer game Quake III Arena. The artificial players in this game use the system for path and route finding through complex 31) polygonal worlds. Many other computer games can also benefit from the system presented here. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Automated path and route finding through arbitrary complex 3D polygonal worlds", "paper_id": "WOS:000238515700003"}