{"auto_keywords": [{"score": 0.039682325996342485, "phrase": "new_tested_fingerprint"}, {"score": 0.019786656303784254, "phrase": "standard_fingerprint"}, {"score": 0.007332505898480966, "phrase": "fingerprint_examination"}, {"score": 0.005643826964868603, "phrase": "correlation_coefficient"}, {"score": 0.00481495049065317, "phrase": "multi-dimensional_vector"}, {"score": 0.004191986252940157, "phrase": "chinese"}, {"score": 0.003472927015404464, "phrase": "representative_fingerprints"}, {"score": 0.0031609252620168446, "phrase": "critical_value"}, {"score": 0.002834409847642238, "phrase": "bootstrap_method"}, {"score": 0.0027513507830537165, "phrase": "sampling_distribution"}, {"score": 0.0023476849595393872, "phrase": "simulated_distribution"}, {"score": 0.002301572462091142, "phrase": "corresponding_critical_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["fingerprint", " HPLC", " statistical bootstrap", " Pearson correlation coefficient"], "paper_abstract": "A chemical or DNA fingerprint can be treated as a multi-dimensional vector. Correlation coefficient between two fingerprints which is easy to understand and simple to compute has been widely used to assess the similarity of fingerprints in chemical and Chinese Medicine. In the process of fingerprint examination, we are often confronted with such question on how to assess whether a new tested fingerprint is qualified or not. Usually, the mean or median fingerprint of a group of representative fingerprints measured accurately is regarded as a standard fingerprint, then correlation coefficient between the standard fingerprint and a new tested fingerprint is calculated. The critical value for the correlation coefficient is for assessment of a new tested fingerprint whether it is qualified or not. In this study, a bootstrap method is used to estimate the sampling distribution of the correlation coefficient between the standard fingerprint and a new tested fingerprint under the hypothesis that the new tested fingerprint belongs to the same group with the fingerprints used to construct standard fingerprint. Furthermore, using the simulated distribution we obtain the corresponding critical value as the criteria for fingerprint examination. This method is illustrated using Chinese Angelica (CA) fingerprint data. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Critical value determination on similarity of fingerprints", "paper_id": "WOS:000237588100032"}