{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "decision_performance"}, {"score": 0.049188612914091503, "phrase": "decision_table"}, {"score": 0.010287258803738635, "phrase": "rough_set_theory"}, {"score": 0.007532613639570396, "phrase": "decision_tables"}, {"score": 0.004522796947899013, "phrase": "approximation_accuracy"}, {"score": 0.004466519142879166, "phrase": "consistency_degree"}, {"score": 0.003965468669507077, "phrase": "elaborate_depictions"}, {"score": 0.0027395968397212053, "phrase": "condition_granulation"}, {"score": 0.0027054473441439422, "phrase": "decision_granulation"}, {"score": 0.0025569530630374995, "phrase": "experimental_analyses"}, {"score": 0.002283913454238574, "phrase": "decision-rule_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["rough set theory", " decision table", " knowledge granulation", " decision evaluation"], "paper_abstract": "As two classical measures, approximation accuracy and consistency degree can be employed to evaluate the decision performance of a decision table. However, these two measures cannot give elaborate depictions of the certainty and consistency of a decision table when their values are equal to zero. To overcome this shortcoming, we first classify decision tables in rough set theory into three types according to their consistency and introduce three new measures for evaluating the decision performance of a decision-rule set extracted from a decision table. We then analyze how each of these three measures depends on the condition granulation and decision granulation of each of the three types of decision tables. Experimental analyses on three practical data sets show that the three new measures appear to be well suited for evaluating the decision performance of a decision-rule set and are much better than the two classical measures. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Measures for evaluating the decision performance of a decision table in rough set theory", "paper_id": "WOS:000250731100012"}