{"auto_keywords": [{"score": 0.04191337609468307, "phrase": "oo_metrics"}, {"score": 0.03137708734879228, "phrase": "class_size"}, {"score": 0.007740489563401452, "phrase": "potentially_confounding_effect"}, {"score": 0.006521713870666854, "phrase": "confounding_variable"}, {"score": 0.00466102244911872, "phrase": "object-oriented_metrics"}, {"score": 0.004532988904965752, "phrase": "previous_research"}, {"score": 0.0032898346872897383, "phrase": "high-level_design_phase"}, {"score": 0.0021646022201798247, "phrase": "confounding_effect"}], "paper_keywords": ["Object-oriented", " metrics", " validation", " class size", " confounding", " change-proneness"], "paper_abstract": "Previous research shows that class size can influence the associations between object-oriented (OO) metrics and fault-proneness and therefore proposes that it should be controlled as a confounding variable when validating OO metrics on fault-proneness. Otherwise, their true associations may be distorted. However, it has not been determined whether this practice is equally applicable to other external quality attributes. In this paper, we use three size metrics, two of which are available during the high-level design phase, to examine the potentially confounding effect of class size on the associations between OO metrics and change-proneness. The OO metrics that are investigated include cohesion, coupling, and inheritance metrics. Our results, based on Eclipse, indicate that: 1) The confounding effect of class size on the associations between OO metrics and change-proneness, in general, exists, regardless of whichever size metric is used; 2) the confounding effect of class size generally leads to an overestimate of the associations between OO metrics and change-proneness; and 3) for many OO metrics, the confounding effect of class size completely accounts for their associations with change-proneness or results in a change of the direction of the associations. These results strongly suggest that studies validating OO metrics on change-proneness should also consider class size as a confounding variable.", "paper_title": "Examining the Potentially Confounding Effect of Class Size on the Associations between Object-Oriented Metrics and Change-Proneness", "paper_id": "WOS:000270154300002"}