{"auto_keywords": [{"score": 0.02398471479240488, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "based_retrieval"}, {"score": 0.004683292152590589, "phrase": "fast_and_simple_method"}, {"score": 0.004406121974246201, "phrase": "full_decompression"}, {"score": 0.004309434349688514, "phrase": "compressed_domain_retrieval"}, {"score": 0.004191540451296395, "phrase": "content_analysis"}, {"score": 0.004099542199088835, "phrase": "compressed_image"}, {"score": 0.003088702479841264, "phrase": "integer_discrete_cosine_transform"}, {"score": 0.0029544572689681934, "phrase": "color_histogram_indexing_method"}, {"score": 0.0028417741269408194, "phrase": "coded_i-frames"}, {"score": 0.002718231974492536, "phrase": "independent_i-frame_coded_pictures"}, {"score": 0.0021763973978248005, "phrase": "fully_decompressed_image_systems"}], "paper_keywords": ["Compressed domain image indexing and retrieval", " DC-picture", " H.264 video coding standard", " Color histogram"], "paper_abstract": "A fast and simple method for content based retrieval using the DC-pictures of H.264 coded video without full decompression is presented. Compressed domain retrieval is very desirable for content analysis and retrieval of compressed image and video. Even though, DC-pictures are among the most widely used compressed domain indexing and retrieval methods in pre H.264 coded videos, they are not generally used in the H.264 coded video. This is due to two main facts, first, the I-frame in the H.264 standard are spatially predicatively coded and second, the H.264 standard employs Integer Discrete Cosine Transform. In this paper we have applied color histogram indexing method on the DC-pictures derived from H.264 coded I-frames. Since the method is based on independent I-frame coded pictures, it can be used either for video analysis of H.264 coded videos, or image retrieval of the I-frame based coded images such as advanced image coding. The retrieval performance of the proposed algorithm is compared with that the fully decoded images. Simulation results indicate that the performance of the proposed method is very close to the fully decompressed image systems. Moreover the proposed method has much lower computational load.", "paper_title": "Compressed domain content based retrieval using H.264 DC-pictures", "paper_id": "WOS:000305276400011"}