{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "massively_multiple_attack_paths"}, {"score": 0.03679418729719719, "phrase": "fragment_combinations"}, {"score": 0.03200058326193355, "phrase": "attack_paths"}, {"score": 0.028720937117165172, "phrase": "upstream_router_map"}, {"score": 0.02661104179666677, "phrase": "original_ips"}, {"score": 0.004545675105321216, "phrase": "internet_attacks"}, {"score": 0.004471530397729526, "phrase": "ip_traceback"}, {"score": 0.004273782634394231, "phrase": "probabilistic_packet_marking_scheme"}, {"score": 0.0039362878637371574, "phrase": "additional_network_traffic"}, {"score": 0.00388800655625083, "phrase": "minimal_protocol_change"}, {"score": 0.0034364867143322304, "phrase": "ip_addresses"}, {"score": 0.00327086925741257, "phrase": "effective_way"}, {"score": 0.0031260524791486347, "phrase": "false_positive_error_rates"}, {"score": 0.0029147175927233546, "phrase": "similar_problems"}, {"score": 0.0027514186391258263, "phrase": "additional_data_structures"}, {"score": 0.0024116163689723354, "phrase": "massive_multiple_attack_paths"}, {"score": 0.002295277579105177, "phrase": "additional_information"}, {"score": 0.0021049977753042253, "phrase": "zero_false_positives"}], "paper_keywords": ["PPM", " Sparsely-tagged", " IP Trace", " Multiple attack", " S-TFMS"], "paper_abstract": "IP traceback is known to be one of the most effective measures to deter Internet attacks. Various techniques for IP traceback have been suggested. Among them, we focus on Probabilistic Packet Marking scheme (PPM) with tagging. We believe PPM is more advantageous than others because it does not generate additional network traffic and requires minimal protocol change. However, three parameters need to be optimized to make PPM practical under massively multiple attack paths: the number of packets to collect, the number of fragment combinations to recover the IP addresses, and the false positive error rate. Tagging is an effective way to reduce the number of combinations but it increases the false positive error rates when the number of routers in the attack paths grows. Other PPM-related techniques suggested in the past have similar problems. They improve one or two parameters at the expense of others, or they require additional data structures such as an upstream router map. In this paper, we propose a method that optimizes the three parameters at the same time and recovers original IPs quickly and correctly even in the presence of massive multiple attack paths. Our method does not need either a combinatorial process to recover IPs or additional information such as an upstream router map. Our result shows that our method recovers 95% of the original IPs correctly with no fragment combinations and with zero false positives. It needs to collect only 8N packets per router where N is the number of routers involved in the attack paths.", "paper_title": "IP traceback with sparsely-tagged fragment marking scheme under massively multiple attack paths", "paper_id": "WOS:000319747200004"}