{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "exposure_effect"}, {"score": 0.0067952134505740005, "phrase": "particular_journal"}, {"score": 0.004767826806287385, "phrase": "perceived_journal_quality"}, {"score": 0.004406994912939125, "phrase": "journal_ranking_decisions"}, {"score": 0.004236908273106904, "phrase": "journal_ranking_surveys"}, {"score": 0.004195418010131832, "phrase": "higher_scores"}, {"score": 0.0038397509389856625, "phrase": "overall_journal's_contribution"}, {"score": 0.0036733470451885465, "phrase": "ranking_data"}, {"score": 0.003496868378204654, "phrase": "knowledge_management"}, {"score": 0.003462599815177726, "phrase": "intellectual_capital"}, {"score": 0.002464709648714996, "phrase": "respondents'_perceptions"}, {"score": 0.0024405312482831646, "phrase": "overall_contribution"}, {"score": 0.0022443390559699974, "phrase": "major_limitation"}, {"score": 0.0022113879114507577, "phrase": "stated_preference_journal"}, {"score": 0.0021049977753042253, "phrase": "future_research_and_results_interpretation"}], "paper_keywords": ["Journal ranking", " Stated preference", " Exposure effect", " Familiarity effect"], "paper_abstract": "The purpose of this study is to test the existence of the exposure effect in journal ranking decisions. The exposure effect emerges when participants of journal ranking surveys assign higher scores to some journals merely because they are more familiar with them rather than on their objective assessment of the overall journal's contribution to the field. Analysis of the journal ranking data from a survey of 233 active researchers in the field of knowledge management and intellectual capital confirmed the existence of the exposure effect. Specifically, it was found that: (1) those who previously published in a particular journal rated it higher than those who did not; (2) those who previously served as a reviewer or editor for a particular journal also rated it higher than those who did not; and (3) a very strong correlation was found between the respondents' perceptions of overall contribution of a journal and the degree of their familiarity with this outlet. This investigation confirmed a major limitation of the stated preference journal ranking approach that should be taken into consideration in future research and results interpretation. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "What's familiar is excellent: The impact of exposure effect on perceived journal quality", "paper_id": "WOS:000285626000018"}