{"auto_keywords": [{"score": 0.028802910704520485, "phrase": "synchronization_languages"}, {"score": 0.004478308876320956, "phrase": "parameterized_systems"}, {"score": 0.00442987501427177, "phrase": "graph-structured_data"}, {"score": 0.004256703909255889, "phrase": "well-behaved_relations"}, {"score": 0.004075469816959996, "phrase": "equivalent_definitions"}, {"score": 0.00393032656248792, "phrase": "non-equivalent_notions"}, {"score": 0.0037493114715625784, "phrase": "systematic_way"}, {"score": 0.003424225677958491, "phrase": "standard_techniques"}, {"score": 0.003387153161968927, "phrase": "word_relations"}, {"score": 0.003350480663660326, "phrase": "key_idea"}, {"score": 0.0031386091093713706, "phrase": "extended_alphabet"}, {"score": 0.002993947751499058, "phrase": "regular_languages"}, {"score": 0.0029615198132465236, "phrase": "fixed_alphabet"}, {"score": 0.002887210021573995, "phrase": "binary_relations"}, {"score": 0.002814759530655965, "phrase": "standard_classes"}, {"score": 0.0023644936731468252, "phrase": "canonical_synchronization_languages"}, {"score": 0.002239103860494545, "phrase": "canonical_representatives"}, {"score": 0.0021987994275190314, "phrase": "sufficient_conditions"}], "paper_keywords": ["Word relations", " Regular", " Rational", " Recognizable"], "paper_abstract": "While the theory of languages of words is very mature, our understanding of relations on words is still lagging behind. And yet such relations appear in many new applications such as verification of parameterized systems, querying graph-structured data, and information extraction, for instance. Classes of well-behaved relations typically used in such applications are obtained by adapting some of the equivalent definitions of regularity of words for relations, leading to non-equivalent notions of recognizable, regular, and rational relations. The goal of this paper is to propose a systematic way of defining classes of relations on words, of which these three classes are just natural examples, and to demonstrate its advantages compared to some of the standard techniques for studying word relations. The key idea is that of a synchronization of a pair of words, which is a word over an extended alphabet. Using it, we define classes of relations via classes of regular languages over a fixed alphabet, just {1,2} for binary relations. We characterize some of the standard classes of relations on words via finiteness of parameters of synchronization languages, called shift, lag, and shiftlag. We describe these conditions in terms of the structure of cycles of graphs underlying automata, thereby showing their decidability. We show that for these classes there exist canonical synchronization languages, and every class of relations can be effectively re-synchronized using those canonical representatives. We also give sufficient conditions on synchronization languages, defined in terms of injectivity and surjectivity of their Parikh images, that guarantee closure under intersection and complement of the classes of relations they define.", "paper_title": "Synchronizing Relations on Words", "paper_id": "WOS:000358740800001"}