{"auto_keywords": [{"score": 0.040034968123333736, "phrase": "working_hours"}, {"score": 0.00481495049065317, "phrase": "work-life_balance"}, {"score": 0.004787966206092959, "phrase": "purpose_-_this_paper"}, {"score": 0.004425616928975799, "phrase": "average_time"}, {"score": 0.0043884509088264675, "phrase": "work_e-mails"}, {"score": 0.004171891198117434, "phrase": "employees'_work-life_balance"}, {"score": 0.00397714507836836, "phrase": "employees'_thoughts"}, {"score": 0.003954837422946628, "phrase": "company_culture"}, {"score": 0.003474799999519295, "phrase": "office_hours"}, {"score": 0.0034166271604770576, "phrase": "quick_reply"}, {"score": 0.003349984456443527, "phrase": "case_study_approach"}, {"score": 0.003284637361174143, "phrase": "multinational_service_organisation"}, {"score": 0.0032296377835432533, "phrase": "online_questionnaire"}, {"score": 0.0032024832043416516, "phrase": "seven-day_diary"}, {"score": 0.0031577303835881964, "phrase": "qualitative_and_quantitative_data"}, {"score": 0.0030961218779438702, "phrase": "findings_-_data"}, {"score": 0.003044269254752414, "phrase": "respondents'_gender"}, {"score": 0.002910189469006115, "phrase": "current_literature"}, {"score": 0.0028214413724451442, "phrase": "single_organisation"}, {"score": 0.0025855896351972586, "phrase": "short-term_recommendations"}, {"score": 0.0025494354909453847, "phrase": "particular_company"}, {"score": 0.0025208755851561368, "phrase": "negative_impact"}, {"score": 0.002464709648714996, "phrase": "contracted_working_hours"}, {"score": 0.002362741548363011, "phrase": "work-related_communications"}, {"score": 0.002349467661235186, "phrase": "employees'_personal_lives"}, {"score": 0.0022906498741695094, "phrase": "long-term_psychological_and_sociological_effects"}, {"score": 0.0021408862709571615, "phrase": "data_collection"}, {"score": 0.0021049977753042253, "phrase": "e-mail_use"}], "paper_keywords": ["Electronic mail", " Work-life balance", " Diaries", " Quality of working life", " Communication", " Organizational culture"], "paper_abstract": "Purpose - This paper aims to illustrate how a company's current 24-hour e-mail culture impacts on employees' lives outside of their contracted working hours. There are two objectives of the study - first, to calculate the average time spent on work e-mails by employees per day outside of working hours and, second, to identify what impact e-mail had on employees' work-life balance by addressing three research questions. These questions aims to focus on the relationships between: employees' thoughts about company culture and their belief that their work is dependent on them checking their e-mails outside of working hours; employees' urges to check e-mails out of working hours and their belief that spending time on e-mails outside of work means they are neglecting their social life; and employees sending e-mails out of office hours and their expectation of a quick reply or action. Design/methodology/approach - A case study approach was taken. Employees from a multinational service organisation were invited to complete an online questionnaire and a seven-day diary so as to collect qualitative and quantitative data about their use of e-mail. Findings - Data were analysed with respect to respondents' gender, role and length of service in the organisation and discussed with respect to the current literature. Research limitations/implications - Although the limitations of exploring a single organisation are recognised, it is likely that some of the insights and lessons generated by the study will be transferable to other organisational settings. Practical implications - This study identified some short-term recommendations as to how a particular company could limit the negative impact that e-mails have on its employees' lives outside of contracted working hours. In addition, this study will also raise awareness of the pervasion of work-related communications into employees' personal lives and, hopefully, trigger further research into the long-term psychological and sociological effects of a 24/7 communication culture. Originality/value - There are two novel aspects to this study: the use of diaries as a method of data collection and the notion of exploring e-mail use \"out of hours\".", "paper_title": "The impact of e-mail on work-life balance", "paper_id": "WOS:000302969800004"}