{"auto_keywords": [{"score": 0.04558099031824589, "phrase": "williams"}, {"score": 0.04523587494120218, "phrase": "tsang"}, {"score": 0.026827360847187936, "phrase": "'last_word"}, {"score": 0.0047026237903774895, "phrase": "conflicting_positions"}, {"score": 0.004065348865695599, "phrase": "robust_exchange"}, {"score": 0.003802436817177577, "phrase": "lee"}, {"score": 0.003772306776343196, "phrase": "baskerville"}, {"score": 0.0029664385034477905, "phrase": "respective_pairs"}, {"score": 0.002573965014439041, "phrase": "authors'_conception"}, {"score": 0.002426137929553722, "phrase": "key_concepts"}, {"score": 0.0023415390666563177, "phrase": "seddon"}, {"score": 0.0023231492382587682, "phrase": "scheepers"}, {"score": 0.0022509878391826867, "phrase": "seddon_and_scheepers'_framework"}], "paper_keywords": ["generalization", " IS research", " induction", " knowledge claim", " representativeness", " other settings"], "paper_abstract": "This paper is a companion to the paper on generalization in IS research by Williams and Tsang published in this edition of the Journal of Information Technology. Its purpose is to discuss the implications of the robust exchange of views about the meaning of the term 'generalization' in four papers, two by Lee and Baskerville, and two by Tsang and Williams. The objectives of this paper are, first, to help the reader understand the issues by summarizing the arguments in the four papers, and second, to assess the implications of the debate for future IS research. Our conclusion is that when the papers are interpreted from the perspectives of the respective pairs of authors, most of what they say is sound. However, because their perspectives are so different, their differences of opinion are also very real. As a way of showing that neither pair of authors' conception of generalization is the 'last word' on this topic, the paper also compares key concepts from both pairs of authors with those from Seddon and Scheepers. It is argued that although the Seddon and Scheepers' framework is also not the 'last word', it may prove more useful than either of the two preceding frameworks.", "paper_title": "Generalization in IS research: a critique of the conflicting positions of Lee & Baskerville and Tsang & Williams", "paper_id": "WOS:000352826400003"}