{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_models"}, {"score": 0.004637478829869904, "phrase": "recent_flurry"}, {"score": 0.004551199992546761, "phrase": "consciousness_research"}, {"score": 0.004466519142879166, "phrase": "operational_definition"}, {"score": 0.003401148484767927, "phrase": "plausible_substitute"}, {"score": 0.003306559295382181, "phrase": "current_computational_models_model_consciousness"}, {"score": 0.0031995142224983094, "phrase": "current_computational_models"}, {"score": 0.0026384167183586015, "phrase": "successful_model"}, {"score": 0.0022064376000055764, "phrase": "identified_aspect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Consciousness", " Computational cognitive modeling", " Clarion", " LIDA", " ACT-R", " Neuronal Work Space Model", " ART", " GMU-BICA"], "paper_abstract": "There has been a recent flurry of activity in consciousness research. Although an operational definition of consciousness has not yet been developed, philosophy has come to identify a set of features and aspects that are thought to be associated with the various elements of consciousness. On the other hand, there have been several recent attempts to develop computational models of consciousness that are claimed to capture or illustrate one or more aspects of consciousness. As a plausible substitute to evaluating how well the current computational models model consciousness, this study examines how the current computational models fare in modeling those aspects and features of consciousness identified by philosophy. Following a review of the literature on the philosophy of consciousness, this study constructs a list of features and aspects that would be expected in any successful model of consciousness. The study then evaluates, from the viewpoint of that list, some of the current self-claimed and implemented computational models of consciousness. The computational models studied are evaluated with respect to each identified aspect and feature of consciousness. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A philosophical assessment of computational models of consciousness", "paper_id": "WOS:000301289500004"}