{"auto_keywords": [{"score": 0.0369398824318344, "phrase": "controlled_process"}, {"score": 0.00481495049065317, "phrase": "temperature_control"}, {"score": 0.004763565662615503, "phrase": "real_time_control_process"}, {"score": 0.0045879792359519375, "phrase": "quantitative_comparison"}, {"score": 0.004490552331642995, "phrase": "real_power_consumption"}, {"score": 0.003990385737207714, "phrase": "proposed_adaptive_and_self_organizing_fuzzy_policy"}, {"score": 0.003802135020791801, "phrase": "remaining_controllers"}, {"score": 0.0037216353828833657, "phrase": "adaptive"}, {"score": 0.0036815763368083197, "phrase": "self_organizing_fuzzy_logic_controller"}, {"score": 0.0034332736827447654, "phrase": "monotonicity_sign"}, {"score": 0.003306559295382181, "phrase": "offline_pre-training"}, {"score": 0.0032536902910768957, "phrase": "adaptive_controller"}, {"score": 0.003150466780962537, "phrase": "necessary_background"}, {"score": 0.002953711377604328, "phrase": "real_behavior"}, {"score": 0.002681315076008658, "phrase": "room_temperature"}, {"score": 0.0025137856138000014, "phrase": "set_points"}, {"score": 0.0023189818169615135, "phrase": "statistical_tool"}], "paper_keywords": ["Adaptive fuzzy policy", " self-organize fuzzy controller", " real time control", " saving power"], "paper_abstract": "In this paper, a temperature control in real time control process was presented using several control algorithms. A quantitative comparison based on the real power consumption and (the precision and the robustness) of these controllers during the same control process and under the same conditions will be done. The proposed Adaptive and Self Organizing Fuzzy policy has been able to prove its superiority against the remaining controllers. The new Adaptive and Self Organizing Fuzzy Logic Controller starts the control with a very limited information about the controlled process (delay and the monotonicity sign) and without any kind of offline pre-training, the adaptive controller acts online to collect the necessary background to adapt their rules consequents and to self organize their membership functions from the real behavior of the controlled process. During 200 minutes and under the same conditions all the performed controllers have been used to control the room temperature, each simulation has been repeated five times with two different sets of set points. These amounts of results was used as a set of sampling for the statistical tool ANOVA (Analysis of Variance) that can prove and illustrate the validity and the extrapolability of the conclusions extracted from several stages of this work.", "paper_title": "A NEW ADAPTIVE AND SELF ORGANIZING FUZZY POLICY TO ENHANCE THE REAL TIME CONTROL PERFORMANCE", "paper_id": "WOS:000336216400014"}