{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_photography"}, {"score": 0.004757227624616643, "phrase": "experience_capture_tools"}, {"score": 0.004671932143798307, "phrase": "patient_understanding"}, {"score": 0.004560568143816105, "phrase": "diabetes_self-management_practices"}, {"score": 0.004140924670517666, "phrase": "health_complications"}, {"score": 0.0038284549148537373, "phrase": "physiological_data"}, {"score": 0.0035181731203867456, "phrase": "blood_glucose_levels"}, {"score": 0.003213489259323924, "phrase": "good_health"}, {"score": 0.002952900365829518, "phrase": "diabetes_self-management_routines"}, {"score": 0.0027298319171606498, "phrase": "long-term_health"}, {"score": 0.002318799760022913, "phrase": "design_suggestions"}, {"score": 0.0022909325048608054, "phrase": "augmented_memory_systems"}], "paper_keywords": ["experience capture and sharing", " ubiquitous computing", " digital photography", " information visualization", " diabetes and health management"], "paper_abstract": "Glucometers measure the accumulation of glucose in the bloodstream and are essential for avoiding health complications related to diabetes. Despite their value as tools to record and present physiological data, they lack the ability to capture the behaviors that cause fluctuations in blood glucose levels, activities that ultimately need to be understood and managed in order to maintain good health. In this paper, we describe an intervention that introduces digital photography into diabetes self-management routines to augment glucometer data and facilitate the sharing of experiences that affect long-term health. Two studies of the approach are presented to illustrate the ways that diabetics use visualizations of past activities to reflect on their health. We also discuss design suggestions for augmented memory systems based on our findings, focusing on ways to enhance learning with repositories of past experiences collected automatically and/or manually.", "paper_title": "Integrating glucometers and digital photography as experience capture tools to enhance patient understanding and communication of diabetes self-management practices", "paper_id": "WOS:000246339700006"}