{"auto_keywords": [{"score": 0.04893920853196635, "phrase": "regular_equivalence"}, {"score": 0.028009325429443156, "phrase": "fuzzy_graphs"}, {"score": 0.005443009788998985, "phrase": "regular_similarity"}, {"score": 0.005240871201250109, "phrase": "equivalence_relation"}, {"score": 0.00481495049065317, "phrase": "regular_equivalences"}, {"score": 0.004620093797504386, "phrase": "different_applications"}, {"score": 0.004556901872357751, "phrase": "positional_analysis"}, {"score": 0.004525629293824217, "phrase": "social_networks"}, {"score": 0.004494570360108983, "phrase": "behavior_analysis"}, {"score": 0.004463723624910583, "phrase": "state_transition_systems"}, {"score": 0.004417848254181138, "phrase": "common_characteristic"}, {"score": 0.0038758293658651237, "phrase": "borgatti"}, {"score": 0.0038492192801784482, "phrase": "everett"}, {"score": 0.0035681790580031998, "phrase": "considerable_attention"}, {"score": 0.003130077012135034, "phrase": "crisp_graphs"}, {"score": 0.0030872017736888113, "phrase": "different_generalizations"}, {"score": 0.0030344301563232944, "phrase": "first_generalization"}, {"score": 0.002841971477743441, "phrase": "underlying_graph_edges"}, {"score": 0.0027741761880779535, "phrase": "fuzzy_binary_relation"}, {"score": 0.002643386043540555, "phrase": "second_generalization"}, {"score": 0.0022092084106039834, "phrase": "generalized_regular_equivalence"}, {"score": 0.0021490449563443025, "phrase": "crisp_partition"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_graph"}], "paper_keywords": ["Granular computing", " Fuzzy graph", " Regular equivalences", " Bisimulation", " Labeled transition systems", " Social networks"], "paper_abstract": "The notion of regular equivalence or bisimulation arises in different applications, such as positional analysis of social networks and behavior analysis of state transition systems. The common characteristic of these applications is that the system under modeling can be represented as a graph. Thus, regular equivalence is a notion used to capture the similarity between nodes based on their linking patterns with other nodes. According to Borgatti and Everett, two nodes are regularly equivalent if they are equally related to equivalent others. In recent years, fuzzy graphs have also received considerable attention because they can represent both the qualitative relationships and the degrees of connection between nodes. In this paper, we generalize the notion of regular equivalence to fuzzy graphs based on two alternative definitions of regular equivalence. While the two definitions are equivalent for crisp graphs, they induce different generalizations for fuzzy graphs. The first generalization, called regular similarity, is based on the characterization of regular equivalence as an equivalence relation that commutes with the underlying graph edges. The regular similarity is then a fuzzy binary relation that specifies the degree of similarity between nodes in the graph. The second generalization, called generalized regular equivalence, is based on the definition of coloring. A Coloring is a mapping from the set of nodes to a set of colors. A coloring is regular if nodes that are mapped to the same color, have the same colors in their neighborhoods. Hence, generalized regular equivalence is an equivalence relation that can determine a crisp partition of the nodes in a fuzzy graph. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "A theoretical investigation of regular equivalences for fuzzy graphs", "paper_id": "WOS:000261713600011"}