{"auto_keywords": [{"score": 0.034182875683624124, "phrase": "habit"}, {"score": 0.00481495049065317, "phrase": "hierarchical_bayesian_modelling"}, {"score": 0.003894570038675774, "phrase": "reliable_interaction_partners"}, {"score": 0.003820144626025562, "phrase": "personal_experience"}, {"score": 0.0037060428445111664, "phrase": "hierarchical_and_bayesian_inferred_trust_model"}, {"score": 0.0035854375135437634, "phrase": "direct_and_third_party_information"}, {"score": 0.0034879261743468574, "phrase": "third_party_information"}, {"score": 0.0033837135367113004, "phrase": "existing_approaches"}, {"score": 0.00319330258693017, "phrase": "principled_statistical_techniques"}, {"score": 0.003140888248194296, "phrase": "multiple_discrete_or_continuous_aspects"}, {"score": 0.003030247482854539, "phrase": "single_shared_representation"}, {"score": 0.002939669079524801, "phrase": "observed_correlation"}, {"score": 0.0028993944292191433, "phrase": "similar_trustees"}, {"score": 0.002883439044844259, "phrase": "information_sources"}, {"score": 0.0028360962841331634, "phrase": "pragmatic_solution"}, {"score": 0.0028127163745564777, "phrase": "whitewasher_problem"}, {"score": 0.00278184186397901, "phrase": "unreliable_agents"}, {"score": 0.002758907973783665, "phrase": "new_identity"}, {"score": 0.0027361626349903744, "phrase": "bad_reputation"}, {"score": 0.0026616868981501006, "phrase": "theoretical_aspects"}, {"score": 0.0025678829712650437, "phrase": "agent_behaviour"}, {"score": 0.0024842242921857705, "phrase": "real-world_webserver_domain"}, {"score": 0.00240328454980006, "phrase": "trustee_performance"}, {"score": 0.0023834640793589414, "phrase": "multiple_representations"}, {"score": 0.002305804301699552, "phrase": "blade"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Trust", " Reputation", " Probabilistic trust", " Group-based trust"], "paper_abstract": "In many dynamic open systems, autonomous agents must interact with one another to achieve their goals. Such agents may be self-interested and, when trusted to perform an action, may betray that trust by not performing the action as required. Due to the scale and dynamism of these systems, agents will often need to interact with other agents with which they have little or no past experience. Each agent must therefore be capable of assessing and identifying reliable interaction partners, even if it has no personal experience with them. To this end, we present HABIT, a Hierarchical And Bayesian Inferred Trust model for assessing how much an agent should trust its peers based on direct and third party information. This model is robust in environments in which third party information is malicious, noisy, or otherwise inaccurate. Although existing approaches claim to achieve this, most rely on heuristics with little theoretical foundation. In contrast, HABIT is based exclusively on principled statistical techniques: it can cope with multiple discrete or continuous aspects of trustee behaviour; it does not restrict agents to using a single shared representation of behaviour; it can improve assessment by using any observed correlation between the behaviour of similar trustees or information sources; and it provides a pragmatic solution to the whitewasher problem (in which unreliable agents assume a new identity to avoid bad reputation). In this paper, we describe the theoretical aspects of HABIT, and present experimental results that demonstrate its ability to predict agent behaviour in both a simulated environment, and one based on data from a real-world webserver domain. In particular, these experiments show that HABIT can predict trustee performance based on multiple representations of behaviour, and is up to twice as accurate as BLADE, an existing state-of-the-art trust model that is both statistically principled and has been previously shown to outperform a number of other probabilistic trust models. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An efficient and versatile approach to trust and reputation using hierarchical Bayesian modelling", "paper_id": "WOS:000311977500006"}