{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "contextual_polarity"}, {"score": 0.02605034551184317, "phrase": "neutral_instances"}, {"score": 0.004695389394526107, "phrase": "phrase-level_sentiment_analysis"}, {"score": 0.0046118021635786315, "phrase": "automatic_sentiment_analysis"}, {"score": 0.004546000131069232, "phrase": "large_lexicon"}, {"score": 0.004185377431624781, "phrase": "particular_instance"}, {"score": 0.004023120753104693, "phrase": "word's_prior_polarity"}, {"score": 0.0038950367927745267, "phrase": "negative_sentiments"}, {"score": 0.0033490008882413103, "phrase": "prior_and_contextual_polarity"}, {"score": 0.003150319576043518, "phrase": "important_aspect"}, {"score": 0.003071965703296204, "phrase": "polar_terms"}, {"score": 0.0030171910207671205, "phrase": "neutral_contexts"}, {"score": 0.002952745241052452, "phrase": "neutral_and_polar_instances"}, {"score": 0.0028381384547894865, "phrase": "positive_and_negative_contextual_polarity"}, {"score": 0.002727967804120323, "phrase": "multiple_machine"}, {"score": 0.002669683153809812, "phrase": "learning_algorithms"}, {"score": 0.0025568135952982345, "phrase": "best_performance"}, {"score": 0.002370625627299064, "phrase": "positive_and_negative_polarity"}, {"score": 0.002190064650401852, "phrase": "best_way"}, {"score": 0.002143247921132179, "phrase": "polarity_classes"}, {"score": 0.0021049977753042253, "phrase": "system's_ability"}], "paper_keywords": [""], "paper_abstract": "Many approaches to automatic sentiment analysis begin with a large lexicon of words marked with their prior polarity (also called semantic orientation). However, the contextual polarity of the phrase in which a particular instance of a word appears may be quite different from the word's prior polarity. Positive words are used in phrases expressing negative sentiments, or vice versa. Also, quite often words that are positive or negative out of context are neutral in context, meaning they are not even being used to express a sentiment. The goal of this work is to automatically distinguish between prior and contextual polarity, with a focus on understanding which features are important for this task. Because an important aspect of the problem is identifying when polar terms are being used in neutral contexts, features for distinguishing between neutral and polar instances are evaluated, as well as features for distinguishing between positive and negative contextual polarity. The evaluation includes assessing the performance of features across multiple machine learning algorithms. For all learning algorithms except one, the combination of all features together gives the best performance. Another facet of the evaluation considers how the presence of neutral instances affects the performance of features for distinguishing between positive and negative polarity. These experiments show that the presence of neutral instances greatly degrades the performance of these features, and that perhaps the best way to improve performance across all polarity classes is to improve the system's ability to identify when an instance is neutral.", "paper_title": "Recognizing Contextual Polarity: An Exploration of Features for Phrase-Level Sentiment Analysis", "paper_id": "WOS:000272350900003"}