{"auto_keywords": [{"score": 0.004664352260912174, "phrase": "computing_power"}, {"score": 0.004518442937844318, "phrase": "ever_more_complex_fluid_simulations"}, {"score": 0.0040334640350288, "phrase": "flow_visualization"}, {"score": 0.0038368442918503072, "phrase": "geometry-based_flow_visualization_techniques"}, {"score": 0.003716724243777879, "phrase": "geometric_flow_visualization_methods"}, {"score": 0.0036167509502276294, "phrase": "velocity_field"}, {"score": 0.0035515951985356374, "phrase": "underlying_properties"}, {"score": 0.0034560481756572632, "phrase": "great_amount"}, {"score": 0.0029209233709517634, "phrase": "geometric_flow_visualization_literature"}, {"score": 0.0027910516355928983, "phrase": "central_theme"}, {"score": 0.002753224894944965, "phrase": "seeding_algorithm"}, {"score": 0.0024349853033241663, "phrase": "up-to-date_overview"}, {"score": 0.0022743274702883456, "phrase": "unsolved_problems"}, {"score": 0.0022434880661725493, "phrase": "rapidly_evolving_branch"}, {"score": 0.002153450937601075, "phrase": "concise_introduction"}, {"score": 0.0021049977753042253, "phrase": "flow_visualization_research"}], "paper_keywords": ["flow visualization", " vector fields", " time-dependent data"], "paper_abstract": "With ever increasing computing power, it is possible to process ever more complex fluid simulations. However, a gap between data set sizes and our ability to visualize them remains. This is especially true for the field of flow visualization, which deals with large, time-dependent, multivariate simulation data sets. In this paper, geometry-based flow visualization techniques form the focus of discussion. Geometric flow visualization methods place discrete objects in the velocity field whose characteristics reflect the underlying properties of the flow. A great amount of progress has been made in this field over the last two decades. However, a number of challenges remain, including placement, speed of computation and perception. In this survey, we review and classify geometric flow visualization literature according to the most important challenges when considering such a visualization, a central theme being the seeding algorithm upon which they are based. This paper details our investigation into these techniques with discussions on their applicability and their relative merits and drawbacks. The result is an up-to-date overview of the current state-of-the-art that highlights both solved and unsolved problems in this rapidly evolving branch of research. It also serves as a concise introduction to the field of flow visualization research.", "paper_title": "Over Two Decades of Integration-Based, Geometric Flow Visualization", "paper_id": "WOS:000281853800007"}