{"auto_keywords": [{"score": 0.04076936422859308, "phrase": "integrality_gap"}, {"score": 0.00481495049065317, "phrase": "maximum_budgeted_allocation"}, {"score": 0.004690694501758065, "phrase": "maximum_budgeted_allocation_problem"}, {"score": 0.004382364826200616, "phrase": "n_players"}, {"score": 0.0042692243768616455, "phrase": "separate_budget"}, {"score": 0.004115697805448384, "phrase": "collected_revenue"}, {"score": 0.004030449969901066, "phrase": "natural_assignment"}, {"score": 0.0040095581319387385, "phrase": "lp"}, {"score": 0.0037653554368382814, "phrase": "best_known_approximation_algorithms"}, {"score": 0.0035920758080335655, "phrase": "stronger_configuration_lp_relaxation"}, {"score": 0.0032012284065895537, "phrase": "corresponding_polynomial_time_roundings"}, {"score": 0.0021951623041245897, "phrase": "general_case"}, {"score": 0.0021049977753042253, "phrase": "approximation_results"}], "paper_keywords": [""], "paper_abstract": "We study the maximum budgeted allocation problem, i.e., the problem of selling a set of m indivisible goods to n players, each with a separate budget, such that we maximize the collected revenue. Since the natural assignment LP is known to have an integrality gap of , which matches the best known approximation algorithms, our main focus is to improve our understanding of the stronger configuration LP relaxation. In this direction, we prove that the integrality gap of the configuration LP is strictly better than , and provide corresponding polynomial time roundings, in the following restrictions of the problem: (i) the restricted budgeted allocation problem, in which all the players have the same budget and every item has the same value for any player it can be sold to, and (ii) the graph MBA problem, in which an item can be assigned to at most 2 players. Finally, we improve the best known upper bound on the integrality gap for the general case from to and also prove hardness of approximation results for both cases.", "paper_title": "On the configuration LP for maximum budgeted allocation", "paper_id": "WOS:000364528000018"}