{"auto_keywords": [{"score": 0.044513698991525526, "phrase": "new_types"}, {"score": 0.04401556349011591, "phrase": "internet_worms"}, {"score": 0.040905102236525534, "phrase": "detection_rules"}, {"score": 0.03335306997705366, "phrase": "zero-day_attacks"}, {"score": 0.00481495049065317, "phrase": "campus_networks"}, {"score": 0.0047588556219929756, "phrase": "intrusion_detection_systems"}, {"score": 0.003968112038249246, "phrase": "new_attacks"}, {"score": 0.003591542373891629, "phrase": "valuable_security_resources"}, {"score": 0.002570296816631395, "phrase": "agent-based_honeynet_framework"}, {"score": 0.0024813081174066653, "phrase": "campus_network"}, {"score": 0.0023674192513753996, "phrase": "malicious_processes"}, {"score": 0.002339771435910601, "phrase": "executable_files"}, {"score": 0.002142426911242168, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "novel_defense_mechanism"}], "paper_keywords": [""], "paper_abstract": "Intrusion detection systems (IDSs) and intrusion prevention systems (IPSs) that use signatures cannot protect servers from new types of internet worms. Therefore it is important to collect information about new attacks because the detection rules employed by IDSs and IPSs are formulated using this information. Honeypots are valuable security resources that act as baits for attackers. They can monitor intrusions by being probed, attacked or compromised and can detect zero-day attacks and provide researchers intending to improve security with information about the attacks. However, it is almost impossible to immediately generate detection rules from the information collected by honeypots. This study presents an agent-based honeynet framework for protecting servers in a campus network. In this framework, agents remove malicious processes and executable files on servers infected by zero-day attacks as soon as the honeynet detects them. The proposed framework provides a novel defense mechanism that protects servers from new types of internet worms effectively, without the use of signatures.", "paper_title": "Agent-based honeynet framework for protecting servers in campus networks", "paper_id": "WOS:000312961900009"}