{"auto_keywords": [{"score": 0.042457032177558765, "phrase": "tracking_robot"}, {"score": 0.04035434229513091, "phrase": "target_robot"}, {"score": 0.015719716506582538, "phrase": "networked_control_frames"}, {"score": 0.014260422787272747, "phrase": "multi-robot_object_tracking"}, {"score": 0.00931412340256704, "phrase": "object_tracing"}, {"score": 0.009249158046190692, "phrase": "docking_missions"}, {"score": 0.0045037997020733415, "phrase": "specific_missions"}, {"score": 0.004456534664975427, "phrase": "special_environments"}, {"score": 0.004124688058533477, "phrase": "target_recognition"}, {"score": 0.0040102178375662914, "phrase": "target_robot's_position"}, {"score": 0.003804046908915231, "phrase": "data_fusion_algorithm"}, {"score": 0.0036467403626789666, "phrase": "exterior_parameters"}, {"score": 0.003608437115371213, "phrase": "ccd_camera"}, {"score": 0.003447035529485425, "phrase": "coded_target"}, {"score": 0.003316098012193133, "phrase": "relative_position"}, {"score": 0.0031455000569352454, "phrase": "coordinate_rotation_parameters"}, {"score": 0.0030366573271799406, "phrase": "relative_position_measure_error"}, {"score": 0.0029731625157696845, "phrase": "relative_pose_measure_error"}, {"score": 0.0029109914689364465, "phrase": "research_results"}, {"score": 0.002609840513713399, "phrase": "main_applications"}], "paper_keywords": ["Cybernetics", " Data handling", " Robotics", " Tracking", " Control systems"], "paper_abstract": "Purpose - The purpose of this paper is to describe how, in order to fulfill the specific missions under some special environments without people participating, a multi-robot object tracking and docking systems are designed based on networked control frames. Design/methodology/approach - In the process of target recognition and tracking, the tracking robot obtains the target robot's position and poses information by means of multi-sensors, and tracking the target robot uses a data fusion algorithm based on network-delay. In the phase of docking, the exterior parameters of the CCD camera installed on the tracking robot can be calculated in-phase by recognizing the coded target in a place on the target robot. Finally, the relative position and pose parameters between the tracking robot and the target robot can be derived using the coordinate rotation parameters. Findings - The experiment results indicated that the relative position measure error is less than 1.5 percent, and the relative pose measure error less than 1 degrees within 1.5-10 m. The research results show that the system can actualize object tracing and docking missions accurately and timely. Research limitations/implications - This paper is devoted to multi-robot object tracking and docking systems. Practical implications - The main applications are in the exploration in the seabed, consignment in the workshop, formation of spacecrafts, docking of spacecrafts, and so on. Originality/value - The system can actualize object tracing and docking missions accurately, and the system is of reliable, real-time, and robust capabilities. This will aid all developers and researchers to enhance their technicality.", "paper_title": "Multi-robot object tracking and docking systems based on networked control frames", "paper_id": "WOS:000281928100011"}