{"auto_keywords": [{"score": 0.0491163375687563, "phrase": "clock_tree_power"}, {"score": 0.045146009142429014, "phrase": "previous_works"}, {"score": 0.035687560751607256, "phrase": "clock_gating"}, {"score": 0.004176509019758331, "phrase": "register_transfer_level"}, {"score": 0.0040373708328770306, "phrase": "clock_tree_synthesis_stage"}, {"score": 0.003983016985197904, "phrase": "clock_gating_design"}, {"score": 0.003671865026158296, "phrase": "physical_information"}, {"score": 0.0034780071331554003, "phrase": "large_wirelength_overhead"}, {"score": 0.003272083495778595, "phrase": "clock_tree_synthesis"}, {"score": 0.0032061793819537633, "phrase": "optimization_space"}, {"score": 0.002895986736522535, "phrase": "logical_and_physical_information"}, {"score": 0.0027616550517346066, "phrase": "new_flow"}, {"score": 0.002724428781940696, "phrase": "low-power_gated_clock_tree_design"}], "paper_keywords": ["Activity", " gated clock tree", " low power", " register placement"], "paper_abstract": "Clock gating is one of the most effective techniques to reduce clock tree power. Although it has already been studied considerably, most of the previous works are restricted to either register transfer level (RTL) or clock tree synthesis stage. Clock gating design at RTL is coarse and it pays no attention to the physical information, therefore, it often results in large wirelength overhead. While if clock gating is considered only at clock tree synthesis, the optimization space is largely limited due to the fixing of registers. To fully use the logical and physical information between registers, we propose a new flow for low-power gated clock tree design in this work. It mainly includes three parts: gated clock tree aware register placement, gated clock tree construction, and incremental placement. Compared with the previous works on clock gating, our algorithm reduces the clock tree power with much fewer gating logics, therefore, the overhead to the placement is also reduced.", "paper_title": "An Effective Gated Clock Tree Design Based on Activity and Register Aware Placement", "paper_id": "WOS:000284546000002"}