{"auto_keywords": [{"score": 0.02753770387093116, "phrase": "cliff"}, {"score": 0.00481495049065317, "phrase": "comma_selection"}, {"score": 0.004688989566904871, "phrase": "local_optima"}, {"score": 0.004506171772318298, "phrase": "isotropic_mutations"}, {"score": 0.004330450801016359, "phrase": "theoretical_runtime_analysis"}, {"score": 0.003759142310009214, "phrase": "linear_function"}, {"score": 0.003676926952533304, "phrase": "piecewise_linear_function"}, {"score": 0.0030264946886983833, "phrase": "almost_unnoticeable_number"}, {"score": 0.0028699415886017468, "phrase": "page_limit"}, {"score": 0.002615156460073562, "phrase": "gaussian_mutations"}, {"score": 0.002341094670523097, "phrase": "function_value"}, {"score": 0.0021049977753042253, "phrase": "global-optimum_region"}], "paper_keywords": [""], "paper_abstract": "We investigate (1,lambda) ESs using isotropic mutations for optimization in R-n by means of a theoretical runtime analysis. In particular, a constant offspring-population size A will be of interest. We start off by considering an adaptation-less (1,2) ES minimizing a linear function. Subsequently, a piecewise linear function with a jump/cliff is considered, where a (1+lambda) ES gets trapped, i.e., (at least) an exponential (in n) number of steps are necessary to escape the local-optimum region. The (1,lambda) ES, however, manages to overcome the cliff in an almost unnoticeable number of steps. Finally, we outline (because of the page limit) how the reasoning and the calculations can be extended to the scenario where a (1,lambda) ES using Gaussian mutations minimizes CLIFF, a bimodal, spherically symmetric function already considered in the literature, which is merely SPHERE with a jump in the function value at a certain distance from the minimum. For lambda a constant large enough, the (1,lambda) ES manages to conquer the global-optimum region - in contrast to (1+lambda) ESs which get trapped.", "paper_title": "How comma selection helps with the escape from local optima", "paper_id": "WOS:000241446400006"}