{"auto_keywords": [{"score": 0.04448558694741615, "phrase": "traffic_matrices"}, {"score": 0.041917382197890755, "phrase": "missing_values"}, {"score": 0.034294434684238075, "phrase": "real_traffic_matrices"}, {"score": 0.00481495049065317, "phrase": "spatio-temporal_compressive_sensing"}, {"score": 0.0033955105098235345, "phrase": "compressive_sensing"}, {"score": 0.003365598242636633, "phrase": "existing_compressive-sensing_solutions"}, {"score": 0.0032919615578986816, "phrase": "traffic_matrix_interpolation"}, {"score": 0.003191560305761507, "phrase": "technical_conditions"}, {"score": 0.002999823428906084, "phrase": "novel_spatio-temporal_compressive_sensing_framework"}, {"score": 0.0027094427948305515, "phrase": "sparse_or_low-rank_nature"}, {"score": 0.002685558057339722, "phrase": "real-world_traffic_matrices"}, {"score": 0.0025465957200502404, "phrase": "low-rank_approximations"}, {"score": 0.0025241429061867633, "phrase": "local_interpolation_procedures"}, {"score": 0.002219916677664081, "phrase": "network_tomography"}, {"score": 0.002200337772403983, "phrase": "traffic_prediction"}, {"score": 0.0021712920081029194, "phrase": "anomaly_detection"}], "paper_keywords": ["Measurement", " Performance", " Compressive Sensing", " Traffic Matrix", " Interpolation", " Tomography", " Prediction", " Anomaly Detection"], "paper_abstract": "Many basic network engineering tasks (e. g., traffic engineering, capacity planning, anomaly detection) rely heavily on the availability and accuracy of traffic matrices. However, in practice it is challenging to reliably measure traffic matrices. Missing values are common. This observation brings us into the realm of compressive sensing, a generic technique for dealing with missing values that exploits the presence of structure and redundancy in many real-world systems. Despite much recent progress made in compressive sensing, existing compressive-sensing solutions often perform poorly for traffic matrix interpolation, because real traffic matrices rarely satisfy the technical conditions required for these solutions. To address this problem, we develop a novel spatio-temporal compressive sensing framework with two key components: (i) a new technique called SPARSITY REGULARIZED MATRIX FACTORIZATION (SRMF) that leverages the sparse or low-rank nature of real-world traffic matrices and their spatio-temporal properties, and (ii) a mechanism for combining low-rank approximations with local interpolation procedures. We illustrate our new framework and demonstrate its superior performance in problems involving interpolation with real traffic matrices where we can successfully replace up to 98% of the values. Evaluation in applications such as network tomography, traffic prediction, and anomaly detection confirms the flexibility and effectiveness of our approach.", "paper_title": "Spatio-Temporal Compressive Sensing and Internet Traffic Matrices", "paper_id": "WOS:000271210500024"}