{"auto_keywords": [{"score": 0.04528487297387803, "phrase": "extension_attack"}, {"score": 0.01437845476062736, "phrase": "ro"}, {"score": 0.01318899566047596, "phrase": "mdhf."}, {"score": 0.0127637412506554, "phrase": "cryptosystems_security"}, {"score": 0.006535885988704234, "phrase": "wro"}, {"score": 0.006248350083634833, "phrase": "mdhf"}, {"score": 0.005079463490545867, "phrase": "oaep_encryption_scheme"}, {"score": 0.00481495049065317, "phrase": "merkle-damgard"}, {"score": 0.004771750408749566, "phrase": "random_oracle_model"}, {"score": 0.004714749768410393, "phrase": "merkle-daingard_hash_function"}, {"score": 0.004658426838467567, "phrase": "mdfh"}, {"score": 0.004588964055070299, "phrase": "fixed_input_length_random_oracle"}, {"score": 0.004453116532937849, "phrase": "random_oracle"}, {"score": 0.004397333410094239, "phrase": "ero"}, {"score": 0.0041183611532727375, "phrase": "ro_model"}, {"score": 0.00393675895773741, "phrase": "criteria_methodology"}, {"score": 0.0038757362392051234, "phrase": "ero_model"}, {"score": 0.0036516442918817214, "phrase": "weakened_random_oracle"}, {"score": 0.0033465923623290034, "phrase": "wro_model"}, {"score": 0.0033165225911231115, "phrase": "indifferentiability_framework"}, {"score": 0.0032966286514091022, "phrase": "maurer"}, {"score": 0.003276854626622552, "phrase": "renner"}, {"score": 0.003257189496962683, "phrase": "holenstein"}, {"score": 0.0030577296589049704, "phrase": "wro."}, {"score": 0.003030247482854539, "phrase": "traceable_random_oracle"}, {"score": 0.0021049977753042253, "phrase": "rsa-kem"}], "paper_keywords": ["indifferentiability", " Merkle-Damgard hash function", " variants of random oracle", " cryptosystems security"], "paper_abstract": "Since the Merkle-Daingard hash function (denoted by MDFH) that uses a fixed input length random oracle as a compression function is not indifferentiable from a random oracle (denoted by RO) due to the extension attack, there is no guarantee for the security of cryptosystems, which are secure in the RO model, when RO is instantiated with MDHF. This fact motivates us to establish a criteria methodology for confirming cryptosystems security when RO is instantiated with MDHF. In this paper, we confirm cryptosystems security by using the following approach: I. Find a weakened random oracle (denoted by WRO) which leaks values needed to realize the extension attack. 2. Prove that MDHF is indifferentiable from WRO. 3. Prove cryptosystems security in the WRO model. The indifferentiability framework of Maurer, Renner and Holenstein guarantees that we can securely use the cryptosystem when WRO is instantiated with MDHF. Thus we concentrate on such finding WRO. We propose Traceable Random Oracle (denoted by TRO) which leaks values enough to permit the extension attack. By using TRO, we can easily confirm the security of OAEP encryption scheme and variants of OAEP encryption scheme. However, there are several practical cryptosystems whose security cannot be confirmed by TRO (e.g. RSA-KEM). This is because TRO leaks values that are irrelevant to the extension attack. Therefore, we propose another WRO, Extension Attack Simulatable Random Oracle (denoted by ERO), which leaks just the value needed for the extension attack. Fortunately, ERO is necessary and sufficient to confirm the security of cryptosystems under MDHF. This means that the security of any cryptosystem under MDHF is equivalent to that under the ERO model. We prove that RSA-KEM is secure in the ERO model.", "paper_title": "Security of Cryptosystems Using Merkle-Damgard in the Random Oracle Model", "paper_id": "WOS:000293818300008"}