{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "healthcare_professionals"}, {"score": 0.020536401250656644, "phrase": "data_linkage_system"}, {"score": 0.010470446361776102, "phrase": "routinely_collected_healthcare_data"}, {"score": 0.008937026027400312, "phrase": "data_sharing"}, {"score": 0.004424087591260246, "phrase": "healthcare_data"}, {"score": 0.004349791059765796, "phrase": "potential_barriers"}, {"score": 0.003942732596426676, "phrase": "medline"}, {"score": 0.003916098886350634, "phrase": "embase"}, {"score": 0.00388965383265668, "phrase": "scopus"}, {"score": 0.0038633711600270936, "phrase": "cinahl"}, {"score": 0.0038242899532391914, "phrase": "psychinfo."}, {"score": 0.0036968421974412522, "phrase": "english_language"}, {"score": 0.0034311578789991363, "phrase": "data_linkage"}, {"score": 0.003350679980619693, "phrase": "individual_patient_level"}, {"score": 0.0032389643666649094, "phrase": "potential_benefits"}, {"score": 0.003109795964425612, "phrase": "data_governance"}, {"score": 0.0030265495849271617, "phrase": "negative_views"}, {"score": 0.002789907247876628, "phrase": "physician-patient_relationship"}, {"score": 0.002669525619637691, "phrase": "published_literature"}, {"score": 0.0025113494092413604, "phrase": "public_health_purposes"}, {"score": 0.0023625233416109917, "phrase": "planned_data_linkage_project"}, {"score": 0.002322767202375341, "phrase": "main_barriers"}, {"score": 0.0022300545742463262, "phrase": "prescriber-patient_relationship"}, {"score": 0.0021049977753042253, "phrase": "patient_safety"}], "paper_keywords": [""], "paper_abstract": "Objective To review the literature on the views of healthcare professionals to the linkage of healthcare data and to identify any potential barriers and/or facilitators to participation in a data linkage system. Methods Published papers describing the views of healthcare professionals (HCPs) to data sharing and linkage were identified by searches of Medline, EMBASE, SCOPUS, CINAHL, and PsychINFO. The searches were limited to papers published in the English language from 2001 to 2011. Results A total of 2917 titles were screened. From these, 18 papers describing the views of HCPs about data linkage or data sharing of routinely collected healthcare data at an individual patient level were included. Views were generally positive, and potential benefits were reported. Facilitators included having trust in the system including data governance, reliability, and feedback. Some negative views, identified as barriers were also expressed including costs, data governance, technical issues, and privacy concerns. Effects on the physician-patient relationship, and workload were also identified as deterrent. Discussion From the published literature included in this review, the views of HCPs were in general positive towards data sharing for public health purposes. The identification of barriers to contributing to a data linkage system allows these to be addressed in a planned data linkage project for pharmacovigilance. The main barriers identified were concerns about costs, governance and interference with the prescriber-patient relationship. These would have to be addressed if healthcare professionals are to support a data linkage system to improve patient safety.", "paper_title": "Views of healthcare professionals to linkage of routinely collected healthcare data: a systematic literature review", "paper_id": "WOS:000337672800003"}