{"auto_keywords": [{"score": 0.04055183019778486, "phrase": "improved_accuracy"}, {"score": 0.039895574736304354, "phrase": "voxel_basis_functions"}, {"score": 0.00481495049065317, "phrase": "spline_driven"}, {"score": 0.004734175871914184, "phrase": "tomographic_reconstruction"}, {"score": 0.004681076799813777, "phrase": "tomographic_iterative_reconstruction_methods"}, {"score": 0.004487181594905386, "phrase": "available_projections"}, {"score": 0.004337838898735768, "phrase": "projector_design"}, {"score": 0.0040768201656951756, "phrase": "voxel"}, {"score": 0.004019667124208171, "phrase": "projection_models"}, {"score": 0.003896805547540686, "phrase": "distance_driven_model"}, {"score": 0.0038313742407700144, "phrase": "strong_approximations"}, {"score": 0.0037776850052383014, "phrase": "cubic_voxel_basis_functions"}, {"score": 0.003621073118305693, "phrase": "smoother_and_more_isotropic_basis_functions"}, {"score": 0.003540209451914227, "phrase": "simpler_projectors"}, {"score": 0.0034416557738293947, "phrase": "spherically_symmetric_volume_elements"}, {"score": 0.003198025698778023, "phrase": "separable_b-splines"}, {"score": 0.0030395056129324575, "phrase": "basis_functions"}, {"score": 0.0029548493827229088, "phrase": "b-splines_increases"}, {"score": 0.0027147290829871245, "phrase": "approximation_quality"}, {"score": 0.002699431192257011, "phrase": "computational_complexity"}, {"score": 0.0026540514432710277, "phrase": "good_accuracy"}, {"score": 0.0025082099345978717, "phrase": "long_et_al"}, {"score": 0.002480015345340149, "phrase": "numerical_experiments"}, {"score": 0.0023108237893935766, "phrase": "cubic_b-splines"}, {"score": 0.002246417055582878, "phrase": "higher_accuracy_projectors"}, {"score": 0.002183801521729492, "phrase": "existing_systems"}], "paper_keywords": ["Tomography", " reconstruction", " inverse problems", " signal processing", " B-splines"], "paper_abstract": "Tomographic iterative reconstruction methods need a very thorough modeling of data. This point becomes critical when the number of available projections is limited. At the core of this issue is the projector design, i.e., the numerical model relating the representation of the object of interest to the projections on the detector. Voxel driven and ray driven projection models are widely used for their short execution time in spite of their coarse approximations. Distance driven model has an improved accuracy but makes strong approximations to project voxel basis functions. Cubic voxel basis functions are anisotropic, accurately modeling their projection is, therefore, computationally expensive. Both smoother and more isotropic basis functions better represent the continuous functions and provide simpler projectors. These considerations have led to the development of spherically symmetric volume elements, called blobs. Set apart their isotropy, blobs are often considered too computationally expensive in practice. In this paper, we consider using separable B-splines as basis functions to represent the object, and we propose to approximate the projection of these basis functions by a 2D separable model. When the degree of the B-splines increases, their isotropy improves and projections can be computed regardless of their orientation. The degree and the sampling of the B-splines can be chosen according to a tradeoff between approximation quality and computational complexity. We quantitatively measure the good accuracy of our model and compare it with other projectors, such as the distance-driven and the model proposed by Long et al. From the numerical experiments, we demonstrate that our projector with an improved accuracy better preserves the quality of the reconstruction as the number of projections decreases. Our projector with cubic B-splines requires about twice as many operations as a model based on voxel basis functions. Higher accuracy projectors can be used to improve the resolution of the existing systems, or to reduce the number of projections required to reach a given resolution, potentially reducing the dose absorbed by the patient.", "paper_title": "Spline Driven: High Accuracy Projectors for Tomographic Reconstruction From Few Projections", "paper_id": "WOS:000361685100004"}