{"auto_keywords": [{"score": 0.04924143139933198, "phrase": "yellow_race"}, {"score": 0.015340070891138204, "phrase": "white_race"}, {"score": 0.0062143192307533655, "phrase": "significant_differences"}, {"score": 0.004486640769041646, "phrase": "hereditary_nonpolyposis_colorectal_cancer"}, {"score": 0.004285289574869884, "phrase": "international_database"}, {"score": 0.004151188559520802, "phrase": "insight_database"}, {"score": 0.0041074234667687875, "phrase": "original_references"}, {"score": 0.0036424097335610492, "phrase": "mutation_individuals"}, {"score": 0.003241312187060814, "phrase": "mutation_types"}, {"score": 0.00281371157349156, "phrase": "five_mutations"}, {"score": 0.002180848602315088, "phrase": "specific_mutations"}], "paper_keywords": ["Racial differences", " MLH1 mutation", " MSH2 mutation"], "paper_abstract": "MLH1 and MSH2 mutations underlie 90% of hereditary nonpolyposis colorectal cancer (HNPCC) mutations. The International Society of Gastrointestinal Hereditary Tumors (InSiGHT) has established an international database of mutations associated with HNPCC. Based on the InSiGHT database and the original references that reported the mutations, we analyzed the distributions of MLH1 and MSH2 mutations in yellow race and white race respectively and compared them subsequently. We found: (1) the distributions of mutation individuals in exon 1, 17 and 19 of MLH1 gene and in exon 2 of MSH2 gene showed significant differences between the two race groups (p < 0.05); (2) the distributions of mutation types in exon 2, 7 and 18 of MLH1 and exon 10 and 16 of MSH2 showed significant differences (p < 0.05); and (3) three mutations (c.649C > T, c.1625A > T and c.1721T > C) in MLH1 and five mutations (c.23C > T, c.187dupG, c.505A > G, c.1168C > T and c.2211-6T > C) in MSH2 have much higher frequency in yellow race than those in white race. Furthermore, three mutations (c.1453G > C, c.1742C > T and c.1758dupC) in MLH1 and two mutations (c.1255C > A and c.1886A > G) in MSH2 were only found in yellow race, which implies that specific mutations in yellow race need more attention when screening mutations in these two genes.", "paper_title": "RACIAL DIFFERENCES IN MLH1 AND MSH2 MUTATION: AN ANALYSIS OF YELLOW RACE AND WHITE RACE BASED ON THE INSIGHT DATABASE", "paper_id": "WOS:000208165500009"}