{"auto_keywords": [{"score": 0.050076584515905, "phrase": "prediction_methods"}, {"score": 0.04168332478241091, "phrase": "nmf"}, {"score": 0.004468415400599571, "phrase": "new_model_framework"}, {"score": 0.0042446888127531945, "phrase": "particle_deposition"}, {"score": 0.004205226397573506, "phrase": "transfer_factors"}, {"score": 0.004050996777117918, "phrase": "base_de_donnees"}, {"score": 0.0037417347513316384, "phrase": "hough"}, {"score": 0.003504756881063581, "phrase": "bappet"}, {"score": 0.003455966620588832, "phrase": "danish"}, {"score": 0.0033296385616557378, "phrase": "pb"}, {"score": 0.0030461580449080553, "phrase": "measured_concentrations"}, {"score": 0.00297576670831646, "phrase": "bappet_database"}, {"score": 0.0029343128039167185, "phrase": "absolute_normalized_error"}, {"score": 0.002622755848331379, "phrase": "rural_danish_background_scenario"}, {"score": 0.002422249273477746, "phrase": "measured_values"}, {"score": 0.0022475295254231714, "phrase": "simple_transfer_factors"}, {"score": 0.0021049977753042253, "phrase": "background_conditions"}], "paper_keywords": ["plant", " metals", " transfer factors", " human risk assessment", " crops"], "paper_abstract": "The New Model Framework (NMF) for uptake into crops is based on particle deposition and Transfer factors from soil to plant calculated from the BAse de donnees sur les teneurs en Elements Traces metalliques de Plantes Potageres (BAPPET) database. Besides NMF, approaches developed by the National Institute of Public Health and the Environment (RIVM), Hough, and the United States Environmental Protection Agency (US EPA), and the Contaminated Land Exposure Assessment (CLEA) approach were tested. Experimental data were assembled from the BAPPET database and Danish background data of As, Cd and Pb in soil, air and crops was collected. None of the models proved able to estimate the measured concentrations in plants from the BAPPET database with an absolute normalized error smaller than 70%. On average, the predictions had an error of 80-250%. However, when applying the models to the rural Danish background scenario, the NMF and other models predicted the concentrations in carrot and lettuce within the range of measured values. Regressions considering soil pH, organic matter and clay content were not superior to simple transfer factors. The transfer from air to plant is significant, at least under background conditions, and should be considered in the prediction methods.", "paper_title": "Comparison of prediction methods for the uptake of As, Cd and Pb in carrot and lettuce", "paper_id": "WOS:000281592100008"}