{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "long-term_relationships"}, {"score": 0.03956450799762414, "phrase": "previous_work"}, {"score": 0.03920557268818556, "phrase": "long-term_interaction"}, {"score": 0.004769702911065878, "phrase": "virtual_and_robotic_characters"}, {"score": 0.004571269461883144, "phrase": "recent_advances"}, {"score": 0.003626626504149897, "phrase": "novelty_effect"}, {"score": 0.00314708280192844, "phrase": "first_interaction"}, {"score": 0.0028495431343111897, "phrase": "current_conversation"}, {"score": 0.0027307746993761035, "phrase": "long-term_interaction_framework"}, {"score": 0.002679585860537941, "phrase": "dialogue_planning_capability"}, {"score": 0.0024842242921857705, "phrase": "tutoring_application"}, {"score": 0.0024146842687658467, "phrase": "social_presence"}, {"score": 0.002391938519840648, "phrase": "task_engagement_levels"}, {"score": 0.002155412043665635, "phrase": "important_contributions"}, {"score": 0.0021049977753042253, "phrase": "engagement_level"}], "paper_keywords": ["Long-term relationships", " Long-term interaction", " Episodic memory", " Social presence"], "paper_abstract": "With the recent advances, today people are able to communicate with embodied (virtual/robotic) entities using natural ways of communication. In order to use them in our daily lives, they need to be intelligent enough to make long-term relationships with us and this is highly challenging. Previous work on long-term interaction frequently reported that after the novelty effect disappeared, users' interest into the interaction decreased with time. Our primary goal in this study was to develop a system that can still keep the attention of the users after the first interaction. Incorporating the notion of time, we think that the key to long-term interaction is the recall of past memories during current conversation. For this purpose, we developed a long-term interaction framework with remembering and dialogue planning capability. In order to see the effect of remembering on users, we designed a tutoring application and measured the changes in social presence and task engagement levels according to the existence of memory. Different from previous work, users' interest in our system did not decrease with time with the important contributions of remembering to the engagement level of users.", "paper_title": "Building long-term relationships with virtual and robotic characters: the role of remembering", "paper_id": "WOS:000298995000008"}