{"auto_keywords": [{"score": 0.043143970382308466, "phrase": "globally_developable_triangulations"}, {"score": 0.00481495049065317, "phrase": "smooth_globally_developable_surface"}, {"score": 0.004011867299107537, "phrase": "globally_developable_smooth_surface_s"}, {"score": 0.0039481177357673005, "phrase": "hausdorff"}, {"score": 0.0033072544151755566, "phrase": "s."}, {"score": 0.0031167895790050405, "phrase": "developable_triangulations"}, {"score": 0.0030017207229983385, "phrase": "smooth_surfaces"}, {"score": 0.0024868972942701582, "phrase": "strictly_negative_gauss_curvature"}, {"score": 0.002447101794397243, "phrase": "interior_point"}, {"score": 0.002382182688788248, "phrase": "smooth_surface"}, {"score": 0.0023440589015485077, "phrase": "strictly_positive_gauss_curvature"}, {"score": 0.002306543826130521, "phrase": "gauss_curvature"}], "paper_keywords": [""], "paper_abstract": "This paper deals with the approximation of the unfolding of a smooth globally developable surface (i.e. \"isometric\" to a domain of E-2) with a triangulation. We prove the following result: let T-n be a sequence of globally developable triangulations which tends to a globally developable smooth surface S in the Hausdorff sense. If the normals of T-n tend to the normals of S, then the shape of the unfolding of T-n tends to the shape of the unfolding of S. We also provide several examples: first, we show globally developable triangulations whose vertices are close to globally developable smooth surfaces; we also build sequences of globally developable triangulations inscribed on a sphere, with a number of vertices and edges tending to infinity. Finally, we also give an example of a triangulation with strictly negative Gauss curvature at any interior point, inscribed in a smooth surface with a strictly positive Gauss curvature. The Gauss curvature of these triangulations becomes positive (at each interior vertex) only by switching some of their edges.", "paper_title": "Unfolding of surfaces", "paper_id": "WOS:000240466900001"}