{"auto_keywords": [{"score": 0.046238615936730884, "phrase": "wireless_networks"}, {"score": 0.012171513864330536, "phrase": "deadline_constraints"}, {"score": 0.00481495049065317, "phrase": "hard_deadlines"}, {"score": 0.004776853267973129, "phrase": "wireless_multihop_networks"}, {"score": 0.004739056045644449, "phrase": "network_coding"}, {"score": 0.004664352260912174, "phrase": "network_coding_mixes_packets"}, {"score": 0.00446490613141384, "phrase": "energy_efficiency"}, {"score": 0.004257000695796238, "phrase": "coding_opportunities"}, {"score": 0.004223299391912042, "phrase": "intermediate_nodes"}, {"score": 0.003603131015842491, "phrase": "np"}, {"score": 0.003353521531649663, "phrase": "broadcasting_trees"}, {"score": 0.003197200793408836, "phrase": "overlapping_conditions"}, {"score": 0.0031467250930224126, "phrase": "constructed_trees"}, {"score": 0.0026307897899760383, "phrase": "linear_coding"}, {"score": 0.002391067964886602, "phrase": "local_neighborhood_information"}, {"score": 0.002372103459168231, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["broadcasting", " broadcast tree", " linear network coding", " local XOR coding", " energy efficiency", " deadline", " partial dominant pruning", " NP-completeness"], "paper_abstract": "Broadcasting with network coding mixes packets to minimize the number of transmissions, which improves the energy efficiency of wireless networks. On the other hand, delaying the transmissions increases coding opportunities at intermediate nodes, but increases the delay of packets. In this paper, we consider these two contradicting factors and study the problem of minimizing the number of transmissions in wireless networks while meeting the deadline constraints. We show that this problem is NP-complete; therefore, we provide a heuristic to solve it. First, we construct broadcasting trees, each of them rooted at one source. We then specify overlapping conditions based on the constructed trees, to determine the number of transmissions each node has to perform without the deadline constraints. Then, we partition the set of packets such that coding is performed among the packets of the same partition, which does not result in deadline misses. Linear coding may not be applicable in some wireless networks because of its computational complexity. For these networks, we propose three XOR coding approaches, which rely only on local neighborhood information. Simulation results show that our techniques not only reduce the number of transmissions but also allow the majority of nodes to receive the packets on time. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Broadcasting with hard deadlines in wireless multihop networks using network coding", "paper_id": "WOS:000351300900013"}