{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wiki_way"}, {"score": 0.0047810714349158165, "phrase": "customer-centric_business"}, {"score": 0.004664352260912174, "phrase": "individual_customers"}, {"score": 0.004566567411073082, "phrase": "new_products"}, {"score": 0.004486640769041646, "phrase": "existing_ones"}, {"score": 0.004392565073466714, "phrase": "recent_attention"}, {"score": 0.004346266306175988, "phrase": "marketing_literature"}, {"score": 0.004165879874212301, "phrase": "theory_development"}, {"score": 0.003950846696972114, "phrase": "web-based_collaboration_technology"}, {"score": 0.0037868092509097404, "phrase": "wiki-based_web_site"}, {"score": 0.00352835528598178, "phrase": "organization's_web_presence"}, {"score": 0.0034299649219748513, "phrase": "joint_content_development"}, {"score": 0.0033698643928647726, "phrase": "web_content"}, {"score": 0.0032184697893776052, "phrase": "web_site"}, {"score": 0.00316206336164649, "phrase": "intellectual_property"}, {"score": 0.002998688867384969, "phrase": "possible_failure"}, {"score": 0.0029670381308395505, "phrase": "increasing_number"}, {"score": 0.002640114583897493, "phrase": "ever-increasing_level"}, {"score": 0.0025393296453558203, "phrase": "six_characteristics"}, {"score": 0.0025125151618810523, "phrase": "customer_engagement-comm_unity_custodianship"}, {"score": 0.0021049977753042253, "phrase": "open_source_software_movement"}], "paper_keywords": ["customer-centricity", " knowledge creation", " knowledge management", " open source", " wiki"], "paper_abstract": "Customer-centric business makes the needs and resources of individual customers the starting point for planning new products and services or improving existing ones. While customer-centricity has received recent attention in the marketing literature, technologies to enable customer-centricity have been largely ignored in research and theory development. In this paper, we describe one enabling technology-wikis. Wiki is a Web-based collaboration technology designed to allow anyone to update any information posted to a wiki-based Web site. As such, wikis can be used to enable customers to not only access but also change the organization's Web presence, creating previously unheard of opportunities for joint content development and 11 peer production\" of Web content. At the same time, such openness may make the organization vulnerable to Web site defacing, destruction of intellectual property, and general chaos. In this zone of tension-between opportunity and possible failure-an increasing number of organizations are experimenting with the use of wikis and the wiki way to engage customers. Three cases of organizations using wikis to foster customer-centricity are described, with each case representing an ever-increasing level of customer engagement. An examination of the three cases reveals six characteristics that affect customer engagement-comm unity custodianship, goal alignment among contributors, value-adding processes, emerging layers of participation, critical mass of management and monitoring activity, and technologies in which features are matched to assumptions about how the community collaborates. Parallels between our findings and those evolving in studies of the open source software movement are drawn.", "paper_title": "Enabling customer-centricity using wikis and the wiki way", "paper_id": "WOS:000243480700003"}