{"auto_keywords": [{"score": 0.040549873447721874, "phrase": "ms_complex"}, {"score": 0.00481495049065317, "phrase": "morse-smale_complexes"}, {"score": 0.004562847483469705, "phrase": "feature-driven_data_analysis"}, {"score": 0.004302791070310513, "phrase": "sole_dependence"}, {"score": 0.004240116703465252, "phrase": "input_scalar_field"}, {"score": 0.004097389262726735, "phrase": "application-dependent_features"}, {"score": 0.003940122359770492, "phrase": "new_combinatorial_technique"}, {"score": 0.003572766402294553, "phrase": "ms_complex_computation"}, {"score": 0.002966230968271199, "phrase": "resulting_segmentation"}, {"score": 0.0027832502848247303, "phrase": "prior_flow_path_knowledge"}, {"score": 0.002598764579760562, "phrase": "employed_numerical_integration"}, {"score": 0.002486659929589854, "phrase": "often_the_data"}, {"score": 0.002333193766510394, "phrase": "domain_expert"}, {"score": 0.002254510319372956, "phrase": "ms_complexes"}, {"score": 0.0021049977753042253, "phrase": "robust_topology-based_representation"}], "paper_keywords": ["Computational Topology", " Morse-Smale Complex", " Data Analysis"], "paper_abstract": "Morse-Smale (MS) complexes have been gaining popularity as a tool for feature-driven data analysis and visualization. However, the quality of their geometric embedding and the sole dependence on the input scalar field data can limit their applicability when expressing application-dependent features. In this paper we introduce a new combinatorial technique to compute an MS complex that conforms to both an input scalar field and an additional, prior segmentation of the domain. The segmentation constrains the MS complex computation guaranteeing that boundaries in the segmentation are captured as separatrices of the MS complex. We demonstrate the utility and versatility of our approach with two applications. First, we use streamline integration to determine numerically computed basins/mountains and use the resulting segmentation as an input to our algorithm. This strategy enables the incorporation of prior flow path knowledge, effectively resulting in an MS complex that is as geometrically accurate as the employed numerical integration. Our second use case is motivated by the observation that often the data itself does not explicitly contain features known to be present by a domain expert. We introduce edit operations for MS complexes so that a user can directly modify their features while maintaining all the advantages of a robust topology-based representation.", "paper_title": "Conforming Morse-Smale Complexes", "paper_id": "WOS:000344991700105"}