{"auto_keywords": [{"score": 0.04103762508953094, "phrase": "quantization_error"}, {"score": 0.014539303776329015, "phrase": "original_signal"}, {"score": 0.014068817344991628, "phrase": "quantized_samples"}, {"score": 0.011932488855450781, "phrase": "reconstructed_signal"}, {"score": 0.008435013893080493, "phrase": "quantization_operator"}, {"score": 0.00477513738640734, "phrase": "nonoversampled_signals"}, {"score": 0.0035554096354423756, "phrase": "bandlimited_interpolation"}, {"score": 0.003285380677401785, "phrase": "nyquist_rate"}, {"score": 0.003151572886432253, "phrase": "paley-wiener_space"}, {"score": 0.002805121439110729, "phrase": "bounded_subset"}, {"score": 0.0027818804382539444, "phrase": "pw_pi"}, {"score": 0.002657445352746803, "phrase": "unexpected_behavior"}, {"score": 0.0025385621498128243, "phrase": "slow_decay"}, {"score": 0.0025070703395635133, "phrase": "sinc_function"}, {"score": 0.0023948981440134478, "phrase": "linear_operator"}, {"score": 0.002176275802465835, "phrase": "fixed_signal"}, {"score": 0.0021049977753042253, "phrase": "quantization_step_size"}], "paper_keywords": ["Analog-to-digital conversion", " bandlimited signal", " quantization noise", " Shannon sampling series", " signal quantization"], "paper_abstract": "The process of quantization generates a loss of information, and, thus, the original signal cannot be reconstructed exactly from the quantized samples in general. However, it is desirable to keep the error as small as possible. In this paper, the quantization error is quantified in terms of several distortion measures. All these measures employ the difference between the original signal and the reconstructed signal, which is obtained by bandlimited interpolation of the quantized samples. We assume that the signals are bandlimited and that the samples are taken at Nyquist rate. It is shown that for signals in the Paley-Wiener space PW pi 1, the supremum of the reconstructed signal, and, hence, the quantization error cannot be bounded in the sense that there exists a bounded subset of PW pi 1 on which both quantities can increase unboundedly. This unexpected behavior is due to the nonlinearity of the quantization operator and the slow decay of the sinc function. The nonlinearity is essential for this behavior because every linear operator that fulfills a certain property of the quantization operator would otherwise have to be bounded. Furthermore, it is proven that for a fixed signal the possible quantization error increases as the quantization step size tends to zero. The treatment of the quantization error in this paper is completely deterministic.", "paper_title": "Behavior of the Quantization Operator for Bandlimited, Nonoversampled Signals", "paper_id": "WOS:000278067900025"}