{"auto_keywords": [{"score": 0.047471955813438785, "phrase": "ccbr"}, {"score": 0.016482148474427447, "phrase": "ccbr_system"}, {"score": 0.008472739820900346, "phrase": "high_levels"}, {"score": 0.007892555292054335, "phrase": "target_class"}, {"score": 0.005940597304537555, "phrase": "selected_datasets"}, {"score": 0.005733114401895805, "phrase": "complete_problem_description"}, {"score": 0.00481495049065317, "phrase": "medical_decision_making"}, {"score": 0.004718019768447783, "phrase": "solution_quality"}, {"score": 0.004694092086199672, "phrase": "problem-solving_efficiency"}, {"score": 0.004623031313100715, "phrase": "important_challenge"}, {"score": 0.004599583143434576, "phrase": "medical_applications"}, {"score": 0.004576253356889219, "phrase": "conversational_case-based_reasoning"}, {"score": 0.004484106242427055, "phrase": "test_selection"}, {"score": 0.004327271696245578, "phrase": "specific_hypothesis"}, {"score": 0.0041441550660566906, "phrase": "test_results"}, {"score": 0.003948613642680196, "phrase": "medical_classification"}, {"score": 0.0036584091796060246, "phrase": "feature_selection"}, {"score": 0.003503497128638102, "phrase": "feature's_discriminating_power"}, {"score": 0.0033808435504493767, "phrase": "cbr-confirm"}, {"score": 0.003204841443605308, "phrase": "algorithm's_accuracy"}, {"score": 0.003108400804985359, "phrase": "health_care"}, {"score": 0.0029241132369720764, "phrase": "local_or_global_feature_selection"}, {"score": 0.0025418468477681772, "phrase": "accuracy_levels"}, {"score": 0.00247790399592093, "phrase": "spect"}, {"score": 0.0024465350225981682, "phrase": "uci_machine"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Conversational case-based reasoning", " Feature selection", " Explanation of reasoning", " Transparency", " Medical classification and diagnosis"], "paper_abstract": "Objectives: Balancing the trade-offs between solution quality, problem-solving efficiency, and transparency is an important challenge in medical applications of conversational case-based reasoning (CCBR). For example, test selection in CCBR is often based on strategies in which the absence of a specific hypothesis (e.g., diagnosis) to be confirmed makes it difficult to explain the relevance of test results that users are asked to provide. In this paper, we present an approach to CCBR in medical classification and diagnosis that aims to increase transparency while also providing high levels of accuracy and efficiency. Methods: We present an algorithm for CCBR called iNN(k) in which feature selection is driven by the goal of confirming a target class and informed by a measure of a feature's discriminating power in favor of the target class. As we demonstrate in a CCBR system called CBR-Confirm, this enables a CCBR system to explain the relevance of any question it asks the user. We evaluate the algorithm's accuracy and efficiency on a selection of datasets related to medicine and health care. Results: The performance of iNN(k) on a given dataset is shown to depend on the value of k and on whether local or global feature selection is used in the algorithm. The combination of these parameters for which iNN(k) is most effective in addressing the trade-off between accuracy and efficiency is identified for each of the selected datasets. For example, only 42% and 51% on average of features in a complete problem description were needed by iNN(k) to provide accuracy levels of 86.5% and 84.3% respectively on the lymphography and SPECT heart datasets from the UCI machine learning repository. Conclusion: Our results demonstrate the ability of iNN(k) to provide high levels of accuracy on most of the selected datasets, while often requiring the user to provide only a small subset of the features in a complete problem description, and enabling a CCBR system to explain the relevance of any question it asks the user. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Conversational case-based reasoning in medical decision making", "paper_id": "WOS:000293101100003"}