{"auto_keywords": [{"score": 0.042335347716798616, "phrase": "similarity_function"}, {"score": 0.00481495049065317, "phrase": "semantic_similarity_measures"}, {"score": 0.004672444473700524, "phrase": "human-like_interaction"}, {"score": 0.004248294537944227, "phrase": "human-like_interaction_system"}, {"score": 0.003940706575253453, "phrase": "five_dimensions"}, {"score": 0.0036370297611938796, "phrase": "ontological_knowledge"}, {"score": 0.00327356326590461, "phrase": "similarity_values"}, {"score": 0.003129096013910623, "phrase": "global_similarity_measure"}, {"score": 0.0028446460307503343, "phrase": "training_methods"}, {"score": 0.0024717881264735477, "phrase": "knowledge_base"}, {"score": 0.002422694594114281, "phrase": "wordnet"}, {"score": 0.0023507916951658455, "phrase": "knowledge_editing_toolkit"}, {"score": 0.0023273113102281057, "phrase": "cognos"}, {"score": 0.002158505888557746, "phrase": "system_responses"}, {"score": 0.0021049977753042253, "phrase": "human_test_subjects"}], "paper_keywords": [""], "paper_abstract": "The focus of this paper is the calculation of similarity between two concepts from an ontology for a Human-Like Interaction system. In order to facilitate this calculation, a similarity function is proposed based on five dimensions (sort, compositional, essential, restrictive and descriptive) constituting the structure of ontological knowledge. The paper includes a proposal for computing a similarity function for each dimension of knowledge. Later on, the similarity values obtained are weighted and aggregated to obtain a global similarity measure. In order to calculate those weights associated to each dimension, four training methods have been proposed. The training methods differ in the element to fit: the user, concepts or pairs of concepts, and a hybrid approach. For evaluating the proposal, the knowledge base was fed from WordNet and extended by using a knowledge editing toolkit (Cognos). The evaluation of the proposal is carried out through the comparison of system responses with those given by human test subjects, both providing a measure of the soundness of the procedure and revealing ways in which the proposal may be improved.", "paper_title": "Semantic Similarity Measures Applied to an Ontology for Human-Like Interaction", "paper_id": "WOS:000305881400001"}