{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-dimensional_transfer_function"}, {"score": 0.004569293780076254, "phrase": "effective_way"}, {"score": 0.004386887374401584, "phrase": "different_vascular_pathologies"}, {"score": 0.0042859292226559535, "phrase": "surgical_treatments"}, {"score": 0.004020066537823032, "phrase": "thin_vessel_structures"}, {"score": 0.0037487368769596814, "phrase": "direct_volume_rendering"}, {"score": 0.003336468343971626, "phrase": "appropriate_parameters"}, {"score": 0.0032031180198375283, "phrase": "enhancement_results"}, {"score": 0.003111133215976132, "phrase": "traditional_enhancement_techniques"}, {"score": 0.0030042210975126616, "phrase": "vessel_voxels"}, {"score": 0.0026892447164623247, "phrase": "direct_volume"}, {"score": 0.002507511169156787, "phrase": "line_structures"}, {"score": 0.002351705899181029, "phrase": "interpolation_method"}, {"score": 0.002231441081806766, "phrase": "traditional_approaches"}, {"score": 0.002142161017595363, "phrase": "vessel_selection"}, {"score": 0.0021049977753042253, "phrase": "mip-guided_method"}], "paper_keywords": [""], "paper_abstract": "Direct volume rendering (DVR) is an effective way to visualize 3D vascular images for diagnosis of different vascular pathologies and planning of surgical treatments. Angiograms are typically noisy, fuzzy, and contain thin vessel structures. Therefore, some kinds of enhancements are usually needed before direct volume rendering can start. However, without visualizing the 3D structures in angiograms, users may find it difficult to select appropriate parameters and assess the effectiveness of the enhancement results. In addition, traditional enhancement techniques cannot easily separate the vessel voxels from other contextual structures with the same or very similar intensity. In this paper, we propose a framework to integrate enhancement and direct volume rendering into one visualization pipeline using multi-dimensional transfer function tailored for visualizing the curvilinear and line structures in angiograms. Furthermore, we present a feature preserving interpolation method to render very thin vessels which are usually missed using traditional approaches. To ease the difficulty in vessel selection, a MIP-guided method is suggested to assist the process.", "paper_title": "MIP-guided vascular image visualization with multi-dimensional transfer function", "paper_id": "WOS:000239486600032"}