{"auto_keywords": [{"score": 0.045745364372558946, "phrase": "lca"}, {"score": 0.00481495049065317, "phrase": "xml_keyword_search"}, {"score": 0.004754600386388821, "phrase": "keyword_search"}, {"score": 0.004665483918844599, "phrase": "friendly_mechanism"}, {"score": 0.00452063603944825, "phrase": "desired_information"}, {"score": 0.004463958296056236, "phrase": "xml_databases"}, {"score": 0.004298134888203576, "phrase": "popular_concept"}, {"score": 0.004191007935893067, "phrase": "meaningful_subtrees"}, {"score": 0.004112411350177274, "phrase": "query_keywords"}, {"score": 0.0034244153725855, "phrase": "whole_subtree"}, {"score": 0.003338992028053874, "phrase": "maxmatch_algorithm"}, {"score": 0.0028332303659245085, "phrase": "unnecessary_index_accesses"}, {"score": 0.002676587673012276, "phrase": "subset_detection"}, {"score": 0.0025933275734892508, "phrase": "core_procedure"}, {"score": 0.0024968185204913935, "phrase": "resultant_algorithm"}], "paper_keywords": [""], "paper_abstract": "Keyword search is a friendly mechanism for users to identify desired information in XML databases, and LCA is a popular concept for locating the meaningful subtrees corresponding to query keywords. Among all the LCA-based approaches, MaxMatch [9] is the only one which could achieve the property of monotonicity and consistency, by outputting only contributors instead of the whole subtree. Although the MaxMatch algorithm performs efficiently in some cases, there is still room for improvement. In this paper, we first propose to improve its performance by avoiding unnecessary index accesses. We then speed up the process of subset detection, which is a core procedure for determining contributors. The resultant algorithm is called MinMap and MinMap(+), respectively. At last, we analytically and empirically demonstrate the efficiency of our methods. According to our experiments, our two algorithms work better than the existing one, and MinMap+ is particularly helpful when the breadth of the tree is large and the number of keywords grows.", "paper_title": "Improving the Performance of Identifying Contributors for XML Keyword Search", "paper_id": "WOS:000297687700001"}