{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "numeric_abstractions"}, {"score": 0.004628223381645729, "phrase": "weakly-relational_numeric_constraints"}, {"score": 0.004294962474996283, "phrase": "formal_analysis"}, {"score": 0.004183137595671171, "phrase": "hardware_systems"}, {"score": 0.003747575730190958, "phrase": "semantic_abstract_domains"}, {"score": 0.003682207422331339, "phrase": "geometric_shapes"}, {"score": 0.00346223706087128, "phrase": "previous_proposals"}, {"score": 0.0029548937818509656, "phrase": "proper_widening_operators"}, {"score": 0.0027660443371695024, "phrase": "effective_reduction_procedure"}, {"score": 0.002729744174693491, "phrase": "considered_constraint_description"}, {"score": 0.002646880721119838, "phrase": "bounded_difference"}, {"score": 0.002499590390751339, "phrase": "significantly_more_complex_cases"}, {"score": 0.0024776677004255104, "phrase": "rational_and_integer_octagonal_shapes"}, {"score": 0.0022290883852844057, "phrase": "entailment_algorithms"}, {"score": 0.0022095328812245852, "phrase": "reduced_complexity"}, {"score": 0.0021613897794439227, "phrase": "rational_and_integer_octagonal_constraints"}, {"score": 0.0021049977753042253, "phrase": "weakly-relational_numerical_domains"}], "paper_keywords": ["Abstract interpretation", " Numerical domains", " Widening operators", " Closure by entailment", " Elimination of redundant constraints", " UTVPI constraints"], "paper_abstract": "Weakly-relational numeric constraints provide a compromise between complexity and expressivity that is adequate for several applications in the field of formal analysis and verification of software and hardware systems. We address the problems to be solved for the construction of full-fledged, efficient and provably correct abstract domains based on such constraints. We first propose to work with semantic abstract domains, whose elements are geometric shapes, instead of the (more concrete) syntactic abstract domains of constraint networks and matrices on which the previous proposals are based. This allows to solve, once and for all, the problem whereby closure by entailment, a crucial operation for the realization of such domains, seemed to impede the realization of proper widening operators. In our approach, the implementation of widenings relies on the availability of an effective reduction procedure for the considered constraint description: one for the domain of bounded difference shapes already exists in the literature; we provide algorithms for the significantly more complex cases of rational and integer octagonal shapes. We also improve upon the state-of-the-art by presenting, along with their proof of correctness, closure by entailment algorithms of reduced complexity for domains based on rational and integer octagonal constraints. The consequences of implementing weakly-relational numerical domains with floating point numbers are also discussed.", "paper_title": "Weakly-relational shapes for numeric abstractions: improved algorithms and proofs of correctness", "paper_id": "WOS:000273555800004"}