{"auto_keywords": [{"score": 0.03010368972447254, "phrase": "smith"}, {"score": 0.004788851448504016, "phrase": "barry_smith"}, {"score": 0.0047370749839861165, "phrase": "werner_ceusters"}, {"score": 0.0045850648862091085, "phrase": "cogent_criticisms"}, {"score": 0.004535481695403089, "phrase": "historical_approaches"}, {"score": 0.004342430078306461, "phrase": "biomedical_terminologies"}, {"score": 0.003958937342925219, "phrase": "\"realism-based\"_approach"}, {"score": 0.0037493114715625784, "phrase": "realism-based_approach"}, {"score": 0.003668591097652231, "phrase": "clear_advantages"}, {"score": 0.0036091892088392775, "phrase": "well-founded_methodological_basis"}, {"score": 0.002966900048034132, "phrase": "careful_characterization"}, {"score": 0.0028096544129939277, "phrase": "ceusters"}, {"score": 0.0024653491388223546, "phrase": "smith's_and_ceusters'_criticisms"}, {"score": 0.00230932021677234, "phrase": "medical_informatics"}, {"score": 0.0021049977753042253, "phrase": "obvious_merit"}], "paper_keywords": ["Ontology", " metaphysics", " realism", " empiricism", " ontological methodology"], "paper_abstract": "In a series of papers over a period of several years Barry Smith and Werner Ceusters have offered a number of cogent criticisms of historical approaches to creating, maintaining, and applying biomedical terminologies and ontologies. And they have urged the adoption of what they refer to as a \"realism-based\" approach. Indeed, at times they insist that the realism-based approach not only offers clear advantages and a well-founded methodological basis for ontology development and evaluation, but that such a realist perspective is in fact necessary for understanding and using terminologies and ontologies in science. This paper explores a number of questions surrounding such claims, provides a careful characterization of the type of realism recommended by Smith and Ceusters, and evaluates the role that realism plays in the critiques and recommendations that they offer. The conclusion reached is that while Smith's and Ceusters' criticisms of prior practice in the treatment of ontologies and terminologies in medical informatics are often both perceptive and well founded, and while at least some of their own proposals demonstrate obvious merit and promise, none of this either follows from or requires the brand of realism that they propose.", "paper_title": "Ontological realism: Methodology or misdirection?", "paper_id": "WOS:000290996100001"}