{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "distributed_teams"}, {"score": 0.040341907947413075, "phrase": "shared_understanding"}, {"score": 0.013129164128687918, "phrase": "relational_and_task_conflict"}, {"score": 0.012476689172736574, "phrase": "team_members"}, {"score": 0.01117816607411733, "phrase": "task_conflict"}, {"score": 0.010663426827182467, "phrase": "team_effectiveness"}, {"score": 0.00459186790405058, "phrase": "technological_intervention"}, {"score": 0.0045198174374297285, "phrase": "team_members'_perceptions"}, {"score": 0.004327429667024575, "phrase": "distributed_team_members"}, {"score": 0.004293336465549723, "phrase": "electronic_profiles"}, {"score": 0.003650488388949457, "phrase": "laboratory_experiment"}, {"score": 0.003190817088774159, "phrase": "important_differences"}, {"score": 0.0030187498405804315, "phrase": "e-profile_intervention"}, {"score": 0.0027450280220853137, "phrase": "relational_conflict"}, {"score": 0.0023427323356117365, "phrase": "distributed_team_settings"}, {"score": 0.002324238863944163, "phrase": "important_implications"}, {"score": 0.0022517100995552443, "phrase": "common_understanding"}, {"score": 0.0021049977753042253, "phrase": "useful_intervention"}], "paper_keywords": ["Distributed Teams", " Team Conflict", " Shared Understanding", " Collaboration"], "paper_abstract": "In this research, we examine the efficacy of a technological intervention in shaping distributed team members' perceptions about their teammates. We argue that, by exposing distributed team members to electronic profiles (e-profiles) with information emphasizing their personal similarities with one another, distributed teams should experience lower levels of relational and task conflict. In turn, reductions in conflict should facilitate a shared understanding among team members, which should increase their team effectiveness. The results of a laboratory experiment of 46 distributed teams generally support these assertions. Specifically, we found that a simple, technological intervention can reduce task conflict in distributed teams, which, in turn, improves shared understanding and team effectiveness. We also uncovered important differences in the antecedents and impacts of relational and task conflict. Although we found that the e-profile intervention was effective in accounting for variance in task conflict (R-2 = .41), it was quite poor in accounting for variance in relational conflict (R-2 = .04). The model accounts for 33% and 43% of the variance in shared understanding and team effectiveness, respectively. Taken together, the results of this research suggest that the information shared about team members in distributed team settings has important implications for their ability to collaborate, achieve a common understanding of their work, and accomplish their task effectively. We suggest that e-profiles may be a useful intervention for management to enhance effectiveness in distributed teams.", "paper_title": "E-profiles, Conflict, and Shared Understanding in Distributed Teams", "paper_id": "WOS:000365195300003"}