{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimal_parallelism"}, {"score": 0.008584645458382617, "phrase": "p_systems"}, {"score": 0.004748740786945996, "phrase": "current_research_topic"}, {"score": 0.0047051051659828275, "phrase": "membrane_computing"}, {"score": 0.004555499634179394, "phrase": "biological_point"}, {"score": 0.004153647187175639, "phrase": "maximally_parallel_way"}, {"score": 0.0025683581446365165, "phrase": "latter_case"}, {"score": 0.002418453525649304, "phrase": "active_membranes"}, {"score": 0.002363150587804677, "phrase": "usual_results"}, {"score": 0.0022563011263787847, "phrase": "np-complete_problems"}, {"score": 0.0021945194903838132, "phrase": "trading_space"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["membrane computing", " P system", " universality", " SAT problem"], "paper_abstract": "A current research topic in membrane computing is to find more realistic P systems from a biological point of view, and one target in this respect is to relax the condition of using the rules in a maximally parallel way. We contribute in this paper to this issue by considering the minimal parallelism of using the rules: if at least a rule from a set of rules associated with a membrane or a region can be used, then at least one rule from that membrane or region must be used, without any other restriction (e.g., more rules can be used, but we do not care how many). Weak as it might look, this minimal parallelism still leads to universality. We first prove this for the case of symport/antiport rules. The result is obtained both for generating and accepting P systems, in the latter case also for systems working deterministically. Then, we consider P systems with active membranes, and again the usual results are obtained: universality and the possibility to solve NP-complete problems in polynomial time (by trading space for time). (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "P systems with minimal parallelism", "paper_id": "WOS:000247224500010"}