{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "privacy_problem"}, {"score": 0.04920822493417558, "phrase": "user_authentication"}, {"score": 0.04170081392512019, "phrase": "certification_process"}, {"score": 0.0043764594918057915, "phrase": "important_communication_subjects"}, {"score": 0.0042031320273645065, "phrase": "user's_intention"}, {"score": 0.0039053194919285725, "phrase": "communication_chairman"}, {"score": 0.003249574947858394, "phrase": "certification_work"}, {"score": 0.0032021226849872054, "phrase": "psdua"}, {"score": 0.003097865379563127, "phrase": "light_certification_process"}, {"score": 0.0030638704739988595, "phrase": "existent_system"}, {"score": 0.003008043041734157, "phrase": "kerberos"}, {"score": 0.002985988377995789, "phrase": "public_key_infrastructure"}, {"score": 0.00275383721396097, "phrase": "gradual_access"}, {"score": 0.0027036380093304747, "phrase": "time_stamp"}, {"score": 0.0026838147966444783, "phrase": "device_identification"}, {"score": 0.002558450494671067, "phrase": "privacy_information"}, {"score": 0.0022909940601580675, "phrase": "-middle_attack"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["M2M", " machine-to-machine", " device and user authentication", " privacy problem", " Kerberos", " PKI", " certification"], "paper_abstract": "Inside a machine-to-machine (M2M) environment, a device is very much a communication subject. Machine and gateways are important communication subjects. It can be collecting or storing surrounding information as user's intention. There is a case that infringes other person's privacy such as not passing through a certification process of the user or communication chairman who requests communications among the information that is collected by the machine. Therefore, we wish to propose privacy problem solving using device and user authentication (PSDUA) that can support the certification process between device and user communicating the subject in M2M environment and can support the user in another certification work about various services. PSDUA proposes a design that can pass through a light certification process based on existent system. For example, Kerberos and public key infrastructure (PKI) can support very heavy certification process but our proposed scheme cannot. However, our proposed system can act easily and fast and that gradual access may be possible using time stamp, device identification, and user log-in information. It can also protect privacy information of other person ormachines that are not the subject of communication. Additionally, we also check about confidentiality, integrity, and safety of machine-in-the-middle attack. Also, we can show safety in our proposed system. Our proposed scheme will provide solutions on various securities privacy problems. Copyright (C) 2013 John Wiley & Sons, Ltd.", "paper_title": "A study of privacy problem solving using device and user authentication for M2M environments", "paper_id": "WOS:000343009300010"}