{"auto_keywords": [{"score": 0.03525836607351927, "phrase": "online_discussion_forum"}, {"score": 0.033413566842277836, "phrase": "course_performance"}, {"score": 0.00481495049065317, "phrase": "voluntary_online_discussion_forum"}, {"score": 0.004748740786945996, "phrase": "students'_course_performance"}, {"score": 0.004472146692254812, "phrase": "voluntary_discussion_forums"}, {"score": 0.004410629943506433, "phrase": "higher_education_setting"}, {"score": 0.004290112502811656, "phrase": "intrinsic_forum_participation"}, {"score": 0.0038756055612167942, "phrase": "undergraduate_introductory_psychology_course"}, {"score": 0.003683565150278339, "phrase": "assignment_grades"}, {"score": 0.0036496814103475174, "phrase": "exam_grades"}, {"score": 0.003468796799802612, "phrase": "forum_participation"}, {"score": 0.0032514447965530354, "phrase": "second_undergraduate_introductory_psychology_course"}, {"score": 0.0031918759137610523, "phrase": "initial_measure"}, {"score": 0.0030476702431093687, "phrase": "potential_confound"}, {"score": 0.0030196181347744372, "phrase": "student_engagement"}, {"score": 0.0026042472337367015, "phrase": "better_performance"}, {"score": 0.002341384304635523, "phrase": "facilitation_effect"}, {"score": 0.0023198180380964305, "phrase": "discussion_forum_participation"}, {"score": 0.0021049977753042253, "phrase": "minimal_time"}], "paper_keywords": ["Discussion forum", " Performance", " Page hits", " Lurking"], "paper_abstract": "The purpose of this study was to evaluate the effectiveness of voluntary discussion forums in a higher education setting. Specifically, we examined intrinsic forum participation and investigated its relation to course performance across two experiments. In Experiment 1 (N = 1284) an online discussion forum was implemented at the beginning of an undergraduate introductory psychology course, and measures of course performance (i.e., writing assignment grades, exam grades, and extra-credits obtained) were compared with measures of forum participation. In Experiment 2 (N = 1334) an online discussion forum was implemented halfway through a second undergraduate introductory psychology course, after an initial measure of course performance was obtained, to control for the potential confound of student engagement (e.g., students who perform better in the course use the forum more). Overall, the results showed that students who participated in the forum tended to have better performance in the course, and furthermore that participating in the discussion forum, particularly reading posts on the forum, slightly improved exam performance. This study provides empirical support for the theoretical proposition that there is a facilitation effect of discussion forum participation on course performance. The results also suggest that implementation of an online discussion forum is beneficial even if a teacher only invests minimal time on the forum. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Assessing the effectiveness of a voluntary online discussion forum on improving students' course performance", "paper_id": "WOS:000283916000025"}