{"auto_keywords": [{"score": 0.04861462157289286, "phrase": "relevance_feedback"}, {"score": 0.00481495049065317, "phrase": "image_retrieval"}, {"score": 0.004332322079100859, "phrase": "content-based_image_retrieval"}, {"score": 0.0038978806337961565, "phrase": "training_samples"}, {"score": 0.0032546105164772995, "phrase": "representative_images"}, {"score": 0.0030017207229983385, "phrase": "unlabeled_data"}, {"score": 0.0029462012558267863, "phrase": "training_process"}, {"score": 0.0028206052780047424, "phrase": "active_feedback_framework"}, {"score": 0.0025532173213934422, "phrase": "practical_implementation"}, {"score": 0.002325554982412043, "phrase": "multi-subspace_label_propagation"}, {"score": 0.0021446993452098597, "phrase": "proposed_active_feedback_framework"}], "paper_keywords": ["active learning", " image retrieval", " clustering", " relevance feedback"], "paper_abstract": "In recent years, relevance feedback has been studied extensively as a way to improve performance of content-based image retrieval (CBIR). Since users are usually unwilling to provide much feedback, the insufficiency of training samples limits the success of relevance feedback. In this paper, we propose two strategies to tackle this problem: (i) to make relevance feedback more informative by presenting representative images for users to label; (ii) to make use of unlabeled data in the training process. As a result, an active feedback framework is proposed, consisting of two components, representative image selection and label propagation. For practical implementation of this framework, we develop two coupled algorithms corresponding to the two components, namely, overlapped subspace clustering and multi-subspace label propagation. Experimental results on a very large-scale image collection demonstrated the high effectiveness of the proposed active feedback framework. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "An active feedback framework for image retrieval", "paper_id": "WOS:000254374500008"}