{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "jazz_audiences"}, {"score": 0.008250141974203472, "phrase": "chamber_music_festival"}, {"score": 0.004692227830462433, "phrase": "edinburgh_jazz_and_blues_festival"}, {"score": 0.004439634831927606, "phrase": "musical_events"}, {"score": 0.004169692306713217, "phrase": "large-scale_survey"}, {"score": 0.003830312347175889, "phrase": "audience_members"}, {"score": 0.0037325918533747953, "phrase": "like-minded_jazz_enthusiasts"}, {"score": 0.0034925663938977715, "phrase": "larger_edinburgh_festival"}, {"score": 0.0031727643282003976, "phrase": "prevailing_view"}, {"score": 0.0030576885787607796, "phrase": "classical_music"}, {"score": 0.003035177667751495, "phrase": "s._oakes"}, {"score": 0.002914288956035066, "phrase": "classical_music_festivals"}, {"score": 0.002726740692380339, "phrase": "recent_studies"}, {"score": 0.002706659627293686, "phrase": "classical_music_audiences"}, {"score": 0.0026867260506696455, "phrase": "s.e._pitts"}, {"score": 0.0023958326775913165, "phrase": "s.e._pitts_c.p._spencer"}, {"score": 0.002233301265743633, "phrase": "music_and_letters"}, {"score": 0.0021363670305843403, "phrase": "stronger_sense"}, {"score": 0.002120624523437494, "phrase": "individual_taste"}, {"score": 0.0021049977753042253, "phrase": "jazz_listeners"}], "paper_keywords": [""], "paper_abstract": "This paper considers the ways in which jazz audiences participate in and contribute to musical events, and examines the roles that music plays in their lives and identities. Analysis of a large-scale survey and in-depth interviews, carried out at the Edinburgh Jazz and Blues Festival in 2007, reveals a sense of community and atmosphere within which audience members value the opportunity to be amongst like-minded jazz enthusiasts. The jazz festival is shown to be enhanced by the city and the context of the larger Edinburgh Festival, with the size and character of the venues also contributing significantly to the intimacy and success of each event. The findings challenge the prevailing view that jazz audiences tend to be younger than those for classical music (S. Oakes, 2003, Demographic and sponsorship considerations for jazz and classical music festivals, The Service Industries Journal, 23(3), 165-178), and offer points of comparison with recent studies of classical music audiences (S.E. Pitts, 2005, What makes an audience? Investigating the roles and experiences of listeners at a chamber music festival, Music and Letters, 86(2), 257-269; S.E. Pitts, 2005, Valuing Musical Participation. Aldershot: Ashgate; S.E. Pitts C.P. Spencer, 2008, Loyalty and longevity in audience listening: Investigating experiences of attendance at a chamber music festival, Music and Letters, 89(2), 227-238), showing a stronger sense of individual taste amongst jazz listeners, expressed through loyalty to performers and genres, rather than to the festival itself.", "paper_title": "Understanding Jazz Audiences: Listening and Learning at the Edinburgh Jazz and Blues Festival", "paper_id": "WOS:000280284100003"}