{"auto_keywords": [{"score": 0.044246639819202106, "phrase": "grey-level_hmt"}, {"score": 0.012122791834328956, "phrase": "ronse"}, {"score": 0.012036646393820604, "phrase": "soille"}, {"score": 0.00481495049065317, "phrase": "fundamental_operation"}, {"score": 0.0047804843375940835, "phrase": "binary_images"}, {"score": 0.004529696178827392, "phrase": "grey-level_images"}, {"score": 0.0038119123317396954, "phrase": "main_definitions"}, {"score": 0.0035601676907962626, "phrase": "applicative_potential"}, {"score": 0.0034097787109430384, "phrase": "vessel_segmentation"}, {"score": 0.0033249931673591457, "phrase": "first_part"}, {"score": 0.00326572165784246, "phrase": "previous_approaches"}, {"score": 0.002984794722633428, "phrase": "flat_structuring_elements"}, {"score": 0.0028689475587958917, "phrase": "non-flat_ones"}, {"score": 0.0028177825595998023, "phrase": "unified_theory"}, {"score": 0.002708399936381754, "phrase": "first_a_fitting_associates"}, {"score": 0.0025112011945912327, "phrase": "soille's_approach"}, {"score": 0.0024842242921857705, "phrase": "fitting_step"}, {"score": 0.0023877589586497948, "phrase": "final_grey-level_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["mathematical morphology", " hit-or-miss transform", " grey-level interval operator", " morphological probing"], "paper_abstract": "The hit-or-miss transform (HMT) is a fundamental operation on binary images, widely used since 40 years. As it is not increasing, its extension to grey-level images is not straightforward, and very few authors have considered it. Moreover, despite its potential usefulness, very few applications of the grey-level HMT have been proposed until now. Part I of this paper, developed hereafter, is devoted to the description of a theory leading to a unification of the main definitions of the grey-level HMT, mainly proposed by Ronse and Soille, respectively (part II will deal with the applicative potential of the grey-level HMT, which will be illustrated by its use for vessel segmentation from 3D angiographic data). In this first part, we review the previous approaches to the grey-level HMT, especially the supremal one of Ronse, and the integral one of Soille; the latter was defined only for flat structuring elements (SEs), but it can be generalized to non-flat ones. We present a unified theory of the grey-level HMT, which is decomposed into two steps. First a fitting associates to each point the set of grey-levels for which the SEs can be fitted to the image; as in Soille's approach, this fitting step can be constrained. Next, a valuation associates a final grey-level value to each point; we propose three valuations: supremal (as in Ronse), integral (as in Soille) and binary. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Grey-level hit-or-miss transforms - Part I: Unified theory", "paper_id": "WOS:000242305700024"}