{"auto_keywords": [{"score": 0.0437854518464528, "phrase": "computational_methods"}, {"score": 0.0154278230191577, "phrase": "interacting_domain_patterns"}, {"score": 0.00481495049065317, "phrase": "multiple_genomic_features"}, {"score": 0.004618342952383313, "phrase": "protein-protein_interactions"}, {"score": 0.004313713204732449, "phrase": "experimental_techniques"}, {"score": 0.0039684322717435045, "phrase": "wide_genomic_scale"}, {"score": 0.003923532450854754, "phrase": "experimental_approaches"}, {"score": 0.0036645642553325215, "phrase": "high_false_positive_rates"}, {"score": 0.0035685175471526823, "phrase": "solid_ppi_information"}, {"score": 0.0034618177773967015, "phrase": "computational_framework"}, {"score": 0.0034096661914349577, "phrase": "ppi_prediction_results"}, {"score": 0.0033455764382772754, "phrase": "post-prediction_process"}, {"score": 0.002820202660128789, "phrase": "protein_function_prediction_method"}, {"score": 0.0026040262154057607, "phrase": "goa."}, {"score": 0.0025165151708122957, "phrase": "predicted_ppi_pairs"}, {"score": 0.0024785689583828796, "phrase": "false_positive_pairs"}, {"score": 0.002386181960126766, "phrase": "high_confidence_level"}, {"score": 0.002368120987066921, "phrase": "ppi_datasets"}, {"score": 0.002254003531073337, "phrase": "satisfactory_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Gene ontology annotation", " Genomic features", " Interacting domain patterns", " Protein-protein interactions prediction", " Protein-protein interaction-filter"], "paper_abstract": "Protein-protein interaction (PPI) networks play an outstanding role in the organization of life. Parallel to the growth of experimental techniques on determining PPIs, the emergence of computational methods has greatly accelerated the time needed for the identification of PPIs on a wide genomic scale. Although experimental approaches have limitations that can be complemented by the computational methods, the results from computational methods still suffer from high false positive rates which contribute to the lack of solid PPI information. Our study introduces the PPI-Filter: a computational framework aimed at improving PPI prediction results. It is a post-prediction process which involves filtration, using information based on three different genomic features: (i) gene ontology annotation (GOA), (ii) homologous interactions and (iii) protein families (PFAM) domain interactions. In the study, we incorporated a protein function prediction method, based on interacting domain patterns, the protein function predictor or PFP ( ), for the purpose of aiding the GOA. The goal is to improve the robustness of predicted PPI pairs by removing the false positive pairs and sustaining as much true positive pairs as possible, thus achieving a high confidence level of PPI datasets. The PPI-Filter has been proven to be applicable based on the satisfactory results obtained using signal-to-noise ratio (SNR) and strength measurements that were applied on different computational PPI prediction methods. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Incorporating multiple genomic features with the utilization of interacting domain patterns to improve the prediction of protein-protein interactions", "paper_id": "WOS:000281174800008"}