{"auto_keywords": [{"score": 0.04567531268022503, "phrase": "real_machining_environment"}, {"score": 0.00481495049065317, "phrase": "ar_system"}, {"score": 0.004733901576706854, "phrase": "situ_machining_simulation"}, {"score": 0.004448169552315403, "phrase": "machining_simulation"}, {"score": 0.004227209809791869, "phrase": "situ_machining_simulation_system"}, {"score": 0.004062937864702115, "phrase": "simulation_process"}, {"score": 0.003971938976270902, "phrase": "machining_parameters"}, {"score": 0.003332210257373994, "phrase": "different_machining_parameters"}, {"score": 0.0032760377953971248, "phrase": "real_machine"}, {"score": 0.0030955250132409964, "phrase": "tool_breakages"}, {"score": 0.0027017308406240563, "phrase": "proposed_methodologies"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["augmented reality", " dexel structure", " machining force estimation", " machining simulation"], "paper_abstract": "This paper presents an implementation of machining simulation in a real machining environment applying Augmented Reality (AR) technology. This in situ machining simulation system allows a machinist to analyze the simulation process, adjust the machining parameters, and observe the results in real-time in a real machining environment. Such a system is useful for machinists and trainees during the trial and learning stages, allowing them to experiment with different machining parameters on a real machine without having to worry about possibilities of machine and tool breakages. Three research aspects, namely, the tracking and registration module, the physical simulation module, and the implementation and performance of these proposed methodologies are discussed in details in this paper. Experiments were conducted on a real 3-axis CNC machine to validate and evaluate the performance of the system and the feedback from a survey carried out with the experiments is very positive. Copyright (C) 2009 John Wiley & Sons, Ltd.", "paper_title": "Development of an AR system achieving in situ machining simulation on a 3-axis CNC machine", "paper_id": "WOS:000276878600005"}