{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "shared_buffer"}, {"score": 0.0046491050101721545, "phrase": "lower_packet_loss_probabilities"}, {"score": 0.004143196873246147, "phrase": "shared_buffer_switches"}, {"score": 0.00392100783796804, "phrase": "strong_dependencies"}, {"score": 0.0038624981944755813, "phrase": "output_queues"}, {"score": 0.0036370297611938796, "phrase": "good_analytical_model"}, {"score": 0.0036007478932719417, "phrase": "existing_models"}, {"score": 0.0034940519373446335, "phrase": "exponential_complexities"}, {"score": 0.00327356326590461, "phrase": "novel_analytical_model"}, {"score": 0.0022582634725291225, "phrase": "entire_switch"}, {"score": 0.0021693692831601745, "phrase": "perfect_accuracies"}, {"score": 0.0021369416775353124, "phrase": "tested_conditions"}, {"score": 0.0021049977753042253, "phrase": "polynomial_complexity"}], "paper_keywords": ["aggregation", " analytical model", " Markov chain", " shared buffer", " switches"], "paper_abstract": "Switches with a shared buffer have lower packet loss probabilities than other types of switches when the sizes of the buffers are the same. In the past, the performance of shared buffer switches has been studied extensively. However, due to the strong dependencies of the output queues in the buffer, it is very difficult to find a good analytical model. Existing models are either accurate but have exponential complexities or not very accurate. In this paper, we propose a novel analytical model called the Aggregation model for switches with shared buffer. The model is based on the idea of induction: first find the behavior of two queues, then aggregate them into one block; then find the behavior of three queues while regarding two of the queues as one block, then aggregate the three queues into one block; then aggregate four queues, and so on. When all queues have been aggregated, the behavior of the entire switch will be found. This model has perfect accuracies under all tested conditions and has polynomial complexity.", "paper_title": "A novel analytical model for switches with shared buffer", "paper_id": "WOS:000250245300017"}