{"auto_keywords": [{"score": 0.03927822773271868, "phrase": "first_component"}, {"score": 0.03774156611827689, "phrase": "second_component"}, {"score": 0.026286033416243717, "phrase": "gilowg_operator"}, {"score": 0.00481495049065317, "phrase": "generalized_induced_linguistic_aggregation_operators"}, {"score": 0.004549063619065006, "phrase": "linguistic_aggregation_operators"}, {"score": 0.0038758293658651237, "phrase": "object_processed_by_these_operators_consists"}, {"score": 0.003680587852807675, "phrase": "importance_degree"}, {"score": 0.003267925215811654, "phrase": "third_components"}, {"score": 0.0032176163279340206, "phrase": "linguistic_variables"}, {"score": 0.003168079471049896, "phrase": "uncertain_linguistic_variables"}, {"score": 0.0029013950320185573, "phrase": "ilowa"}, {"score": 0.002769395841379498, "phrase": "lowa"}, {"score": 0.0026986685585382347, "phrase": "special_cases"}, {"score": 0.0026570998719084153, "phrase": "gilowa_operator"}, {"score": 0.002194011800331242, "phrase": "giulowa_operator"}, {"score": 0.0021049977753042253, "phrase": "lowg"}], "paper_keywords": ["generalized induced linguistic aggregation operators", " linguistic variable", " uncertain linguistic variable", " operational laws"], "paper_abstract": "In this paper, we define various generalized induced linguistic aggregation operators, including eneralized induced linguistic ordered weighted averaging (GILOWA) operator, generalized induced linguistic ordered weighted geometric (GILOWG) operator, generalized induced uncertain linguistic ordered weighted averaging (GIULOWA) operator, generalized induced uncertain linguistic ordered weighted geometric (GIULOWG) operator, etc. Each object processed by these operators consists of three components, where the first component represents the importance degree or character of the second component, and the second component is used to induce an ordering, through the first component, over the third components which are linguistic variables (or uncertain linguistic variables) and then aggregated. It is shown that the induced linguistic ordered weighted averaging (ILOWA) operator and linguistic ordered weighted averaging (LOWA) operator are the special cases of the GILOWA operator, induced linguistic ordered weighted geometric (ILOWG) operator and linguistic ordered weighted geometric (LOWG) operator are the special cases of the GILOWG operator, the induced uncertain linguistic ordered weighted averaging (IULOWA) operator and uncertain linguistic ordered weighted averaging (ULOWA) operator are the special cases of the GIULOWA operator, and that the induced uncertain linguistic ordered weighted geometric (IULOWG) operator and uncertain LOWG operator are the special cases of the GILOWG operator.", "paper_title": "On generalized induced linguistic aggregation operators", "paper_id": "WOS:000236605900002"}