{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rich_graph-based_feature_sets."}, {"score": 0.00467424463996457, "phrase": "complex_events"}, {"score": 0.004556901872357751, "phrase": "biomedical_literature"}, {"score": 0.004349337717774093, "phrase": "event_extraction"}, {"score": 0.0039119492240482, "phrase": "shared_task"}, {"score": 0.0037178503842258087, "phrase": "nested_structure"}, {"score": 0.003639835714755229, "phrase": "underlying_biological_statements"}, {"score": 0.003533347967582184, "phrase": "independent_steps"}, {"score": 0.003459191419478298, "phrase": "machine_learning_problems"}, {"score": 0.0033865859510157238, "phrase": "wide_array"}, {"score": 0.003287482882222731, "phrase": "extensive_use"}, {"score": 0.003259702394241964, "phrase": "dependency_parse_graphs"}, {"score": 0.0032184697893776052, "phrase": "rule-based_postprocessing_step"}, {"score": 0.003032820755030689, "phrase": "extraction_task"}, {"score": 0.0029817668105720924, "phrase": "shared_task_evaluation"}, {"score": 0.0028457440091791252, "phrase": "primary_task"}, {"score": 0.0021319959284827896, "phrase": "best_performance"}], "paper_keywords": ["event extraction", " BioNLP'09 Shared Task", " machine learning", " natural language processing", " biomedical domain"], "paper_abstract": "We describe a system for extracting complex events among genes and proteins from biomedical literature, developed in context of the BioNLP09 Shared Task on Event Extraction. For each event, the system extracts its text trigger, class, and arguments. In contrast to the approaches prevailing prior to the shared task, events can be arguments of other events, resulting in a nested structure that better captures the underlying biological statements. We divide the task into independent steps which we approach as machine learning problems. We define a wide array of features and in particular make extensive use of dependency parse graphs. A rule-based postprocessing step is used to refine the output in accordance with the restrictions of the extraction task. In the shared task evaluation, the system achieved an F-score of 51.95% on the primary task, the best performance among the participants. Currently, with modifications and improvements described in this article, the system achieves 52.86% F-score on Task 1, the primary task, improving on its original performance. In addition, we extend the system also to Tasks 2 and 3, gaining F-scores of 51.28% and 50.18%, respectively. The system thus addresses the BioNLP09 Shared Task in its entirety and achieves the best performance on all three subtasks.", "paper_title": "EXTRACTING CONTEXTUALIZED COMPLEX BIOLOGICAL EVENTS WITH RICH GRAPH-BASED FEATURE SETS", "paper_id": "WOS:000297461700002"}