{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compositional_expressions"}, {"score": 0.01207816381632507, "phrase": "centre_x"}, {"score": 0.004730338746443662, "phrase": "compositional_models."}, {"score": 0.004501217435918426, "phrase": "distribution_functions"}, {"score": 0.004192937957960497, "phrase": "jirousek"}, {"score": 0.004090083576606688, "phrase": "compositional_models"}, {"score": 0.00376950244909, "phrase": "set_system_h"}, {"score": 0.0035613768414594262, "phrase": "\"base_scheme"}, {"score": 0.0033766722372180003, "phrase": "jirousek's_result"}, {"score": 0.003167587258150065, "phrase": "base_scheme_h"}, {"score": 0.0030354183220734038, "phrase": "canonical_expressions"}, {"score": 0.002748016244165687, "phrase": "intersection_property"}, {"score": 0.002699627613420169, "phrase": "compositional_expression"}, {"score": 0.00265208877121581, "phrase": "star-like_set_system"}, {"score": 0.0025504217985882725, "phrase": "canonical_expression"}, {"score": 0.002392375784707278, "phrase": "graphical_characterization"}, {"score": 0.0023670015392684885, "phrase": "set_systems_h"}, {"score": 0.0022361384265153677, "phrase": "graphical_algorithm"}, {"score": 0.0021427510493208864, "phrase": "conditional_independences"}, {"score": 0.0021049977753042253, "phrase": "compositional_model"}], "paper_keywords": ["compositional expression", " compositional model", " running intersection property", " perfect sequence"], "paper_abstract": "We generalize Jirousek's (right) composition operator in such a way that it can be applied to distribution functions with values in a \"semifield\", and introduce (parenthesized) compositional expressions, which in some sense generalize Jirousek's \"generating sequences\" of compositional models. We say that two compositional expressions are equivalent if their evaluations always produce the same results whenever they are defined. Our first result is that a set system H is star-like with centre X if and only if every two compositional expressions with \"base scheme\" H and \"key\" X are equivalent. This result is stronger than Jirousek's result which states that, if H is star-like with centre X, then every two generating sequences with base scheme H and key X are equivalent. Then, we focus on canonical expressions, by which we mean compositional expressions theta such that the sequence of the sets featured in theta and arranged in order of appearance enjoys the \"running intersection property\". Since every compositional expression, whose base scheme is a star-like set system with centre X and whose key is X, is a canonical expression, we investigate the equivalence between two canonical expressions with the same base scheme and the same key. We state a graphical characterization of those set systems H such that every two canonical expressions with base scheme H and key X are equivalent, and also provide a graphical algorithm for their recognition. Finally, we discuss the problem of detecting conditional independences that hold in a compositional model.", "paper_title": "EQUIVALENCE OF COMPOSITIONAL EXPRESSIONS AND INDEPENDENCE RELATIONS IN COMPOSITIONAL MODELS", "paper_id": "WOS:000340734200003"}