{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hidden_glitches"}, {"score": 0.03025569272658139, "phrase": "masking_index"}, {"score": 0.004766388573192505, "phrase": "data_glitches"}, {"score": 0.004553822674247401, "phrase": "complex_entities"}, {"score": 0.00446240364863009, "phrase": "multiple_attributes"}, {"score": 0.002988685006809336, "phrase": "missing_values"}, {"score": 0.002797757576619329, "phrase": "data_quality_profiling_and_data_exploration"}, {"score": 0.0024641134634779535, "phrase": "valuable_data_quality_index"}, {"score": 0.002414544068560716, "phrase": "anomaly_detection_method"}, {"score": 0.002126502291103601, "phrase": "intensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "synthetic_and_real-world_datasets"}], "paper_keywords": ["Anomaly detection", " Masking", " Duplicate record identification", " Missing values", " Outlier detection"], "paper_abstract": "Data glitches are errors in a dataset. They are complex entities that often span multiple attributes and records. When they co-occur in data, the presence of one type of glitch can hinder the detection of another type of glitch. This phenomenon is called masking. In this paper, we define two important types of masking and propose a novel, statistically rigorous indicator called masking index for quantifying the hidden glitches. We outline four cases of masking: outliers masked by missing values, outliers masked by duplicates, duplicates masked by missing values, and duplicates masked by outliers. The masking index is critical for data quality profiling and data exploration. It enables a user to measure the extent of masking and hence the confidence in the data. In this sense, it is a valuable data quality index for choosing an anomaly detection method that is best suited for the glitches that are present in any given dataset. We demonstrate the utility and effectiveness of the masking index by intensive experiments on synthetic and real-world datasets.", "paper_title": "A masking index for quantifying hidden glitches", "paper_id": "WOS:000357678800001"}