{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aes"}, {"score": 0.004713379149462482, "phrase": "optical_side_channel"}, {"score": 0.004565007074039171, "phrase": "short_note"}, {"score": 0.004492573860101133, "phrase": "newly_emerging_optical_side_channel"}, {"score": 0.0033178098116654064, "phrase": "cnes."}, {"score": 0.003010893527930816, "phrase": "french_space_agency"}, {"score": 0.0028089634624677957, "phrase": "optical_side_channel_information"}, {"score": 0.0027349450784503273, "phrase": "specific_cipher"}, {"score": 0.002592693161475495, "phrase": "deep_inner_states"}, {"score": 0.0022444104439449737, "phrase": "aes_secret_key"}, {"score": 0.002196944917134202, "phrase": "initial_addroundkey_operation"}, {"score": 0.0021620042653528846, "phrase": "side_channel_plaintext"}, {"score": 0.0021049977753042253, "phrase": "individual_key_bits"}], "paper_keywords": [""], "paper_abstract": "The authors present a short note describing the newly emerging optical side channel. The basic idea of the channel is very simple - many parts of the integrated circuits consist of transistors that represent one of the two logical states 0 or 1. When the state changes, there is some light that is emitted in the form of a few photons. A device employing the method which is able to detect these photons (called picosecond imaging circuit analysis) is available in several laboratories, for example, in the French space agency CNES. From the point of view of the cryptanalyst, once the optical side channel information is available for a specific cipher on a device, it is possible to identify deep inner states that should not be revealed. In fact, it turns out that for an outdated and unprotected 0.8 mu PIC16F84A microcontroller it is possible to recover the AES secret key directly during the initial AddRoundKey operation as the side channel plaintext. can distinguish the individual key bits being XORed to the", "paper_title": "When AES blinks: introducing optical side channel", "paper_id": "WOS:000259787300005"}