{"auto_keywords": [{"score": 0.04589193974665992, "phrase": "social_impact"}, {"score": 0.008589586732633155, "phrase": "citation_network"}, {"score": 0.008188182943645086, "phrase": "cooperative_game_theory"}, {"score": 0.0057156399093954416, "phrase": "mathematical_equations"}, {"score": 0.00481495049065317, "phrase": "social_impact_of_scholarly_articles"}, {"score": 0.004352876088312741, "phrase": "scholarly_papers"}, {"score": 0.00429057323623293, "phrase": "citation_networks"}, {"score": 0.004089239912167375, "phrase": "net_effect"}, {"score": 0.0038973170902076707, "phrase": "direct_and_indirect_influence"}, {"score": 0.0035229930971258316, "phrase": "cited_articles"}, {"score": 0.0033900126423990823, "phrase": "influence_structure"}, {"score": 0.003325410433297401, "phrase": "cited_publications"}, {"score": 0.002837188425640173, "phrase": "citation_relationships"}, {"score": 0.0028100102841877835, "phrase": "academic_papers"}, {"score": 0.0027564303939865476, "phrase": "citation_structure"}], "paper_keywords": ["scientometrics", " informetrics"], "paper_abstract": "The intent of this article is to use cooperative game theory to predict the level of social impact of scholarly papers created by citation networks. Social impact of papers can be defined as the net effect of citations on a network. A publication exerts direct and indirect influence on others (e.g., by citing articles) and is itself influenced directly and indirectly (e.g., by cited articles). This network leads to an influence structure of citing and cited publications. Drawing on cooperative game theory, our research problem is to translate into mathematical equations the rules that govern the social impact of a paper in a citation network. In this article, we show that when citation relationships between academic papers function within a citation structure, the result is social impact instead of the (individual) citation impact of each paper. Mathematical equations explain the interaction between papers in such a citation structure. The equations show that the social impact of a paper is affected by the (individual) citation impact of citing publications, immediacy of citing articles, and number of both citing and cited papers. Examples are provided for several academic papers.", "paper_title": "Social Impact of Scholarly Articles in a Citation Network", "paper_id": "WOS:000346361000008"}