{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gof_design_patterns"}, {"score": 0.004585433265422727, "phrase": "software_system's_resistance"}, {"score": 0.004529776351030488, "phrase": "\"ripple_effect"}, {"score": 0.0035913348026306306, "phrase": "pattern_occurrences"}, {"score": 0.0032833625797814474, "phrase": "case_study"}, {"score": 0.0028006988338192375, "phrase": "design_patterns"}, {"score": 0.0025189177411152645, "phrase": "coupled_pattern_occurrences"}, {"score": 0.0021049977753042253, "phrase": "refactoring_activities"}], "paper_keywords": ["Design Tools and Techniques", " Object-oriented programming", " Metrics/Measurement"], "paper_abstract": "Stability refers to a software system's resistance to the \"ripple effect\", i.e., propagation of changes. In this paper, we investigate the stability of classes that participate in instances/occurrences of GoF design patterns. We examine whether the stability of such classes is affected by (a) the pattern type, (b) the role that the class plays in the pattern, (c) the number of pattern occurrences in which the class participates, and (d) the application domain. To this end, we conducted a case study on about 65.000 Java open-source classes, where we performed change impact analysis on classes that participate in zero, one (single pattern), or more than one (coupled) pattern occurrences. The results suggest that, the application of design patterns can provide the expected \"shielding\" of certain pattern-participating classes against changes, depending on their role in the pattern. Moreover, classes that participate in coupled pattern occurrences appear to be the least stable. The results can be used for assessing the benefits and liabilities of the use of patterns and for testing and refactoring prioritization, because less stable classes are expected to require more effort while testing, and urge for refactoring activities that would make them more resistant to change propagation.", "paper_title": "The Effect of GoF Design Patterns on Stability: A Case Study", "paper_id": "WOS:000359563800004"}