{"auto_keywords": [{"score": 0.04880247283985043, "phrase": "information_retrieval"}, {"score": 0.0048152322149798915, "phrase": "corpus"}, {"score": 0.0043215158337835706, "phrase": "semrol"}, {"score": 0.0042552618754756934, "phrase": "corpus-based_approach"}, {"score": 0.003674192201248236, "phrase": "pos_tags"}, {"score": 0.0036459007842756983, "phrase": "shallow_parsing_information"}, {"score": 0.0035761182400032487, "phrase": "new_phase"}, {"score": 0.003534889186471058, "phrase": "semantic_role_labeling_task"}, {"score": 0.00297037471252423, "phrase": "different_set"}, {"score": 0.0028687545730861665, "phrase": "labeling_arguments_phase"}, {"score": 0.0028356575042385156, "phrase": "tuning_procedure"}, {"score": 0.0026965813247045427, "phrase": "best_sets"}, {"score": 0.002644920521740564, "phrase": "labeling_arguments_task"}, {"score": 0.0023368833197343953, "phrase": "semantic_role"}, {"score": 0.002205079358459154, "phrase": "answering_systems"}, {"score": 0.0021544587602892466, "phrase": "semantic_information"}, {"score": 0.0021049977753042253, "phrase": "information_retrieval_system"}], "paper_keywords": ["semantic roles", " information retrieval systems", " corpus-based methods", " feature selection procedure", " word sense disambiguation", " shallow parsing", " PoS tag", " lemma"], "paper_abstract": "In this paper, a method to determine the semantic role for the constituents of a sentence is presented. This method, named SemRol, is a corpus-based approach that uses two different statistical models, conditional Maximum Entropy (ME) Probability Models and the TiMBL program, a Memory-based Learning. It consists of three phases that make use of features using words, lemmas, PoS tags and shallow parsing information. Our method introduces a new phase in the Semantic Role Labeling task which has usually been approached as a two phase procedure consisting of recognition and labeling arguments. From our point of view, firstly the sense of the verbs in the sentences must be disambiguated. That is why depending on the sense of the verb a different set of roles must be considered. Regarding the labeling arguments phase, a tuning procedure is presented. As a result of this procedure one of the best sets of features for the labeling arguments task is detected. With this set, that is different for TiMBL and ME, precisions of 76.71% for TiMBL or 70.55% for ME, are obtained. Furthermore, the semantic role information provided by our SemRol method could be used as an extension of Information Retrieval or Question Answering systems. We propose using this semantic information as an extension of an Information Retrieval system in order to reduce the number of documents or passages retrieved by the system. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Corpus-based semantic role approach in information retrieval", "paper_id": "WOS:000246382800006"}