{"auto_keywords": [{"score": 0.03560374668835337, "phrase": "internet_users"}, {"score": 0.013763294182765192, "phrase": "users'_queries"}, {"score": 0.00481495049065317, "phrase": "privacy-uncooperative_queryable_databases"}, {"score": 0.004652016085325825, "phrase": "privacy_problem"}, {"score": 0.004556901872357751, "phrase": "internet_search_engines"}, {"score": 0.004011687811047391, "phrase": "practical_compromise"}, {"score": 0.0039841418890102925, "phrase": "computational_efficiency"}, {"score": 0.0035193239615499074, "phrase": "proposed_methods"}, {"score": 0.0033190180867511605, "phrase": "search_engines"}, {"score": 0.0032849422429104065, "phrase": "google"}, {"score": 0.0031845067058084613, "phrase": "real_interests"}, {"score": 0.002982557900944478, "phrase": "obtained_trade-off"}, {"score": 0.0029416973901327925, "phrase": "practical_implications"}, {"score": 0.0028715344743357103, "phrase": "pir"}, {"score": 0.0026071599759743833, "phrase": "web_search_engines"}, {"score": 0.0025449518236394103, "phrase": "database_server"}, {"score": 0.0025100713447593773, "phrase": "pir_protocol"}, {"score": 0.0024586427394152196, "phrase": "real-life_uncooperative_settings"}, {"score": 0.0023426936553484546, "phrase": "first_set"}, {"score": 0.002302619021497886, "phrase": "practical_protection"}, {"score": 0.0022092084106039834, "phrase": "internet_search_engine"}, {"score": 0.0021049977753042253, "phrase": "general_public"}], "paper_keywords": ["Information retrieval", " Search engines", " Internet"], "paper_abstract": "Purpose - This paper aims to address the privacy problem associated with the use of internet search engines. The purpose of the paper is to propose and validate a set of methods and protocols to guarantee the privacy of users' queries. Design/methodology/approach - In this paper h(k)-private information retrieval (h(k)-PIR) is defined as a practical compromise between computational efficiency and privacy. Also presented are h(k)-PIR protocols that can be used to query any database, which does not even need to know that the user is trying to preserve his or her privacy. Findings - The proposed methods are able to properly protect the privacy of users' queries. When internet users apply the protocols, search engines (e.g. Google) are not able to determine unequivocally the real interests of their users. The quality of the results does decrease with the increase in privacy, but the obtained trade-off is excellent. Practical implications - Current private information retrieval (PIR) protocols suffer from two significant shortcomings: their computational complexity is O(n) where n is the number of records in the database, which precludes their use for very large databases and web search engines; and they assume that the database server cooperates in the PIR protocol, which prevents deployment in real-life uncooperative settings. The proposed protocols overcome both problems. Originality/value - This is the first set of protocols that offer practical protection for the privacy of the queries that internet users submit to an internet search engine. The proposal has been implemented and it will be released to the general public soon. It will help to protect the right to privacy of millions of internet users.", "paper_title": "h(k)-private information retrieval from privacy-uncooperative queryable databases", "paper_id": "WOS:000270768100005"}