{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimization_hardness"}, {"score": 0.01526751765740687, "phrase": "real-parameter_problems"}, {"score": 0.004592905436175987, "phrase": "evolutionary_algorithms"}, {"score": 0.004557811372535214, "phrase": "ehfr"}, {"score": 0.004304144138805271, "phrase": "algorithmic_operators"}, {"score": 0.0039626308903511764, "phrase": "best_ways"}, {"score": 0.0031845067058084583, "phrase": "qualitative_analysis"}, {"score": 0.0031100973266506163, "phrase": "idealized_model"}, {"score": 0.002966438503447793, "phrase": "theoretically_qualitative_analysis"}, {"score": 0.0023554316787703137, "phrase": "test_results"}, {"score": 0.002181069180139225, "phrase": "theoretical_analysis"}], "paper_keywords": ["Problem difficulty", " Fourier transform", " Evolutionary computation", " Memetic algorithm", " Optimal feature factor"], "paper_abstract": "For evolutionary algorithms with the ability to self-adapt, linking the algorithmic operators and the problem features is one of the most interesting topics. One of the best ways to begin a study of this topic is to explore the relationship between the optimization hardness and the problem features. This paper attempts to interpret the relationship between optimization hardness and frequency features of real-parameter problems through a qualitative analysis based on an idealized model. Based on the results of a theoretically qualitative analysis, the effective high-frequency ratio (EHFR) is subsequently proposed to measure the optimization hardness of real-parameter problems. Finally, three aspects to the performance of EHFR are evaluated: stability, precision and ability to distinguish. Test results show that the EHFR is relevant not only for the results of theoretical analysis, but also for the other features related to the optimization hardness.", "paper_title": "A novel optimization hardness indicator based on the relationship between optimization hardness and frequency features of real-parameter problems", "paper_id": "WOS:000361484700016"}