{"auto_keywords": [{"score": 0.04043476064430838, "phrase": "fast"}, {"score": 0.008173690514068877, "phrase": "fast_algorithm"}, {"score": 0.00481495049065317, "phrase": "high-dimensional_data"}, {"score": 0.004614038128321949, "phrase": "compatible_results"}, {"score": 0.004568871736067739, "phrase": "original_entire_set"}, {"score": 0.004494570360108983, "phrase": "feature_selection_algorithm"}, {"score": 0.003877737556673229, "phrase": "fast_clustering-based_feature_selection_algorithm"}, {"score": 0.0036194914688460656, "phrase": "first_step"}, {"score": 0.0035141291835319682, "phrase": "graph-theoretic_clustering_methods"}, {"score": 0.003468287913322255, "phrase": "second_step"}, {"score": 0.0031949807365182167, "phrase": "different_clusters"}, {"score": 0.0031019373572233706, "phrase": "high_probability"}, {"score": 0.0030414140732789186, "phrase": "useful_and_independent_features"}, {"score": 0.0029238768315330305, "phrase": "efficient_minimum-spanning_tree"}, {"score": 0.0027560092576928595, "phrase": "empirical_study"}, {"score": 0.002737960968372391, "phrase": "extensive_experiments"}, {"score": 0.0026321200201766966, "phrase": "fcbf"}, {"score": 0.0025977656415788917, "phrase": "cfs"}, {"score": 0.002580871784469827, "phrase": "consist"}, {"score": 0.0025554259726979786, "phrase": "focus-sf"}, {"score": 0.002497319603143104, "phrase": "well-known_classifiers"}, {"score": 0.0024325244760735566, "phrase": "naive_bayes"}, {"score": 0.0022852791175553486, "phrase": "ripper"}, {"score": 0.002255431275670053, "phrase": "feature_selection"}, {"score": 0.0021049977753042253, "phrase": "smaller_subsets"}], "paper_keywords": ["Feature subset selection", " filter method", " feature clustering", " graph-based clustering"], "paper_abstract": "Feature selection involves identifying a subset of the most useful features that produces compatible results as the original entire set of features. A feature selection algorithm may be evaluated from both the efficiency and effectiveness points of view. While the efficiency concerns the time required to find a subset of features, the effectiveness is related to the quality of the subset of features. Based on these criteria, a fast clustering-based feature selection algorithm (FAST) is proposed and experimentally evaluated in this paper. The FAST algorithm works in two steps. In the first step, features are divided into clusters by using graph-theoretic clustering methods. In the second step, the most representative feature that is strongly related to target classes is selected from each cluster to form a subset of features. Features in different clusters are relatively independent, the clustering-based strategy of FAST has a high probability of producing a subset of useful and independent features. To ensure the efficiency of FAST, we adopt the efficient minimum-spanning tree (MST) clustering method. The efficiency and effectiveness of the FAST algorithm are evaluated through an empirical study. Extensive experiments are carried out to compare FAST and several representative feature selection algorithms, namely, FCBF, ReliefF, CFS, Consist, and FOCUS-SF, with respect to four types of well-known classifiers, namely, the probability-based Naive Bayes, the tree-based C4.5, the instance-based IB1, and the rule-based RIPPER before and after feature selection. The results, on 35 publicly available real-world high-dimensional image, microarray, and text data, demonstrate that the FAST not only produces smaller subsets of features but also improves the performances of the four types of classifiers.", "paper_title": "A Fast Clustering-Based Feature Subset Selection Algorithm for High-Dimensional Data", "paper_id": "WOS:000312890500001"}