{"auto_keywords": [{"score": 0.04039388026426996, "phrase": "second_handshaking_process"}, {"score": 0.0196019291446736, "phrase": "first_handshaking_process"}, {"score": 0.014506342913760881, "phrase": "k_servers"}, {"score": 0.00471003041684707, "phrase": "three-way_handshaking_process"}, {"score": 0.004360412703519539, "phrase": "new_two-way_handshaking_reliability_model"}, {"score": 0.004218602458288531, "phrase": "two-way_handshaking_process"}, {"score": 0.004096409451697279, "phrase": "participated_servers"}, {"score": 0.0039053194919285725, "phrase": "successfully_connected_servers"}, {"score": 0.0034464962568390265, "phrase": "connection_probabilities"}, {"score": 0.0033837135367113004, "phrase": "handshaking_processes"}, {"score": 0.002216336059488137, "phrase": "average_stop"}, {"score": 0.0021520139248317333, "phrase": "twhcsknc_system"}, {"score": 0.002128376306688074, "phrase": "communication_system"}, {"score": 0.0021049977753042253, "phrase": "efficient_two-way_handshaking_process"}], "paper_keywords": ["circular consecutive k-out-of-n : F system", " circular sequential k-out-of-n congestion system", " congestion", " ternary state circular sequential k-out-of-n congestion system"], "paper_abstract": "Many communication systems require a two-way, or three-way handshaking process to improve their dependability & authenticity in order to achieve a more successful operation. In this paper, we present a new two-way handshaking reliability model based upon (k, n) threshold-based cryptography systems. Such systems require a two-way handshaking process to i) establish a group of participated servers in the first handshaking process, and ii) calculate a cipher with k successfully connected servers collaboratively in the second handshaking process. When the servers are attempted, each server has three known connection probabilities in the following three states: i) successful, ii) breakdown, and iii) congested. These connection probabilities are unchanged in both handshaking processes. During the first handshaking process, we establish connections that more than k servers are willing to participate. For the second handshaking process, the system becomes successful as soon as we can connect these k servers successfully again. Because we need to connect k servers successfully in the second handshaking process, we would rather connect m additional servers besides the k servers required to be connected successfully in the first handshaking process. This preference will minimize the chance that the system breaks down when fewer than k,servers can be reconnected successfully in the second handshaking process. We refer to this system as a Two-Way Handshaking Circular Sequential k-out-of-n Congestion (TWHCSknC) system. In this paper, we derived analytical formulas for the system's successful probability & average stop length, and we showed that the TWHCSknC system is a communication system with an efficient two-way handshaking process.", "paper_title": "Two-way handshaking circular sequential k-out-of-n congestion system", "paper_id": "WOS:000253840700007"}