{"auto_keywords": [{"score": 0.03309156953206277, "phrase": "social_presence"}, {"score": 0.014219316507879104, "phrase": "virtual_goods"}, {"score": 0.00481495049065317, "phrase": "virtual_products."}, {"score": 0.004756161254039343, "phrase": "three-dimensional_virtual_environments"}, {"score": 0.0046407174174471644, "phrase": "social_and_business_aspects"}, {"score": 0.004514173914270395, "phrase": "large-scale_social_virtual_worlds"}, {"score": 0.004459040623282319, "phrase": "second_life"}, {"score": 0.004404577716425371, "phrase": "dramatic_growth"}, {"score": 0.004142039499650824, "phrase": "virtual_worlds"}, {"score": 0.004091432545219401, "phrase": "stimulus_organism_response"}, {"score": 0.0038121670939902574, "phrase": "participants'_virtual_experiences"}, {"score": 0.0034655801487210158, "phrase": "life_residents"}, {"score": 0.0033297542331358057, "phrase": "significant_positive_impact"}, {"score": 0.0029532983066856994, "phrase": "significantly_influence_participants'_virtual_experiences"}, {"score": 0.002890367960684987, "phrase": "strong_social_bonds"}, {"score": 0.002759983642011259, "phrase": "curvilinear_patterns"}, {"score": 0.0026435894486890594, "phrase": "results_exhibit"}, {"score": 0.0024029886206651573, "phrase": "net_impact"}, {"score": 0.0023373204242028304, "phrase": "relative_strength"}, {"score": 0.00221130685073215, "phrase": "technological_and_spatial_environments"}, {"score": 0.002177522137110944, "phrase": "virtual_products"}, {"score": 0.0021049977753042253, "phrase": "theoretical_and_practical_contributions"}], "paper_keywords": ["Virtual worlds", " technological environment", " spatial environment", " virtual experience", " intention to purchase virtual products", " S-O-R framework", " Second Life", " interactivity", " sociability", " density", " stability", " symbolic consumption"], "paper_abstract": "Although research on three-dimensional virtual environments abounds, little is known about the social and business aspects of virtual worlds. Given the emergence of large-scale social virtual worlds, such as Second Life, and the dramatic growth in sales of virtual goods, it is important to understand the dynamics that govern the purchase of virtual goods in virtual worlds. Employing the stimulus organism response (S-O-R) framework, we investigate how technological (interactivity and sociability) and spatial (density and stability) environments in virtual worlds influence the participants' virtual experiences (telepresence, social presence, and low), and how experiences subsequently affect their response (intention to purchase virtual goods). The results of our survey of 354 Second Life residents indicate that interactivity, which enhances the interaction with objects, has a significant positive impact on telepresence and flow. Also, sociability, which fosters interactions with participants, is significantly associated with social presence, although no such significant impact was observed on flow. Furthermore, both density and stability are found to significantly influence participants' virtual experiences; stability helps users to develop strong social bonds, thereby increasing both social presence and flow. However, contrary to our prediction of curvilinear patterns, density is linearly associated with flow and social presence. Interestingly, the results exhibit two opposing effects of density: while it reduces the extent of flow, density increases the amount of social presence. Since social presence is found to increase flow, the net impact of density on flow depends heavily on the relative strength of the associations involving these three constructs. Finally, we find that flow mediates the impacts of technological and spatial environments on intention to purchase virtual products. We conclude the paper with a discussion of the theoretical and practical contributions of our findings.", "paper_title": "AN ODYSSEY INTO VIRTUAL WORLDS: EXPLORING THE IMPACTS OF TECHNOLOGICAL AND SPATIAL ENVIRONMENTS ON INTENTION TO PURCHASE VIRTUAL PRODUCTS", "paper_id": "WOS:000294088300016"}