{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "movement-based_interaction"}, {"score": 0.00481495049065317, "phrase": "expressive_and_rich_movement-based_interaction"}, {"score": 0.004053994613859937, "phrase": "core_reason"}, {"score": 0.0029381648092259064, "phrase": "design_tools"}, {"score": 0.002436289099444074, "phrase": "gestural_design_tools"}, {"score": 0.002418099158357658, "phrase": "interactive_installations"}, {"score": 0.0024000447011533078, "phrase": "interactive_tangible_sketching"}, {"score": 0.0022018377054878534, "phrase": "limited_scope"}, {"score": 0.002185394402074883, "phrase": "rather_uniform_and_traditional_electronic_consumer_products"}], "paper_keywords": ["movement-based interaction", " richness", " tangible interaction", " meaning", " tools", " methods", " gestures", " choreography of interaction", " installations", " emotions", " expressivity", " experience", " product design"], "paper_abstract": "The world is inherently meaningful for us, i.e. we perceive the world in terms of what we can do with it, and by physically interacting with it we access this meaning and express the meaning. We believe that this is the core reason and foundation for turning to movement-based interaction. 'Interaction creates meaning' does not only hold for users during interaction but also for designers when generating ideas and developing concepts. Therefore, we postulate that if one truly likes to design for movement-based interaction, one has to be or become an expert in movement, not just theoretically, by imagination or on paper, but by doing and experiencing while designing. In order to do so, we believe that designers need design tools, techniques, knowledge, awareness and skills that support their search for expressive, rich behaviour. Our search for this support resulted in several methods, tools and knowledge that help designers exploring, visualising and reflecting on interactions. Our developed methods and tools such as the Design Movement approach with its choreography of interaction, gestural design tools, interactive installations and interactive tangible sketching, have not only supported and inspired designers to design for movement-based interaction, but also resulted in surprising, fresh designs in comparison with the limited scope of rather uniform and traditional electronic consumer products. This paper discusses the possibilities and limitations of our approach.", "paper_title": "Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction", "paper_id": "WOS:000250208000007"}