{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "oriented_edge_magnitudes"}, {"score": 0.049571431541439726, "phrase": "face_recognition"}, {"score": 0.004613940521007727, "phrase": "good_feature_descriptor"}, {"score": 0.004191690483929023, "phrase": "storage_requirement"}, {"score": 0.0038487848937121204, "phrase": "high_recognition_results"}, {"score": 0.00378767277402891, "phrase": "end_user"}, {"score": 0.003687960013746783, "phrase": "recent_feature_descriptor"}, {"score": 0.0029789104204803137, "phrase": "whitened_principal-component-analysis_dimensionality_reduction_technique"}, {"score": 0.002720376476146181, "phrase": "strong_results"}, {"score": 0.0023675986784123656, "phrase": "gabor_filters"}, {"score": 0.0022806798371116698, "phrase": "additional_technique"}, {"score": 0.0021049977753042253, "phrase": "image_matching"}], "paper_keywords": ["Face recognition", " face representation", " Face Recognition Technology (FERET)", " image matching", " Labeled Faces in the Wild (LFW)", " local descriptors", " low complexity", " Patterns of Oriented Edge Magnitudes (POEM)"], "paper_abstract": "A good feature descriptor is desired to be discriminative, robust, and computationally inexpensive in both terms of time and storage requirement. In the domain of face recognition, these properties allow the system to quickly deliver high recognition results to the end user. Motivated by the recent feature descriptor called Patterns of Oriented Edge Magnitudes (POEM), which balances the three concerns, this paper aims at enhancing its performance with respect to all these criteria. To this end, we first optimize the parameters of POEM and then apply the whitened principal-component-analysis dimensionality reduction technique to get a more compact, robust, and discriminative descriptor. For face recognition, the efficiency of our algorithm is proved by strong results obtained on both constrained (Face Recognition Technology, FERET) and unconstrained (Labeled Faces in the Wild, LFW) data sets in addition with the low complexity. Impressively, our algorithm is about 30 times faster than those based on Gabor filters. Furthermore, by proposing an additional technique that makes our descriptor robust to rotation, we validate its efficiency for the task of image matching.", "paper_title": "Enhanced Patterns of Oriented Edge Magnitudes for Face Recognition and Image Matching", "paper_id": "WOS:000300510800036"}