{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mobile_service_robots"}, {"score": 0.00443308765153716, "phrase": "real-world_robotic_implementation"}, {"score": 0.004041879818641576, "phrase": "everyday_places"}, {"score": 0.0038876302202924644, "phrase": "developmental_phase"}, {"score": 0.0037392451233558234, "phrase": "\"keep_out"}, {"score": 0.0033433365160336842, "phrase": "long_periods"}, {"score": 0.003278878522165815, "phrase": "complex_realistic_environments"}, {"score": 0.0030480018094535158, "phrase": "serious_accident"}, {"score": 0.002545468362709126, "phrase": "mobile_robotics_research_health_and_safety_assessment"}, {"score": 0.002320449502337321, "phrase": "robotics_research_labs"}, {"score": 0.0021049977753042253, "phrase": "catastrophic_accidents"}], "paper_keywords": ["Health and safety", " mobile robots"], "paper_abstract": "This paper is not about the details of yet another robot control system, but rather the issues surrounding real-world robotic implementation. It is a fact that in order to realize a future where robots coexist with people in everyday places, we have to pass through a developmental phase that involves some risk. Putting a \"Keep Out, Experiment in Progress\" sign on the door is no longer possible, since we are now at a level of capability that requires testing over long periods of time in complex realistic environments that contain people. We all know that controlling the risk is important a serious accident could set the field back globally but just as important is convincing others that the risks are known and controlled. In this paper, we describe our experience going down this path and we show that mobile robotics research health and safety assessment is still unexplored territory in universities and is often ignored. We hope that this paper will make robotics research labs in universities around the world take note of these issues rather than operating under the radar to prevent any catastrophic accidents.", "paper_title": "Rubbing Shoulders With Mobile Service Robots", "paper_id": "WOS:000371388200024"}