{"auto_keywords": [{"score": 0.04012953228645082, "phrase": "rogue_taxa"}, {"score": 0.00481495049065317, "phrase": "hidden_phylogenetic_consensus"}, {"score": 0.004782848614014638, "phrase": "large_data_sets"}, {"score": 0.004672160300006692, "phrase": "phylogenetic_reconstruction"}, {"score": 0.004579316323166273, "phrase": "rogue\"_taxa-taxa"}, {"score": 0.004268591456106124, "phrase": "almost_any_choice"}, {"score": 0.0038867116254051363, "phrase": "novel_framework"}, {"score": 0.0037087324991876727, "phrase": "bicriterion_optimization_problem"}, {"score": 0.0035865983700531278, "phrase": "net_increase"}, {"score": 0.003562656752692045, "phrase": "useful_information_present"}, {"score": 0.0035270425911920595, "phrase": "consensus_tree"}, {"score": 0.003445316481824611, "phrase": "input_data"}, {"score": 0.0031473840619203825, "phrase": "pathological_examples"}, {"score": 0.00306414423737093, "phrase": "large_biological_data_sets"}, {"score": 0.002953261517737546, "phrase": "bootstrap_replicates"}, {"score": 0.0029139401928060123, "phrase": "deceivingly_poor_support_values"}, {"score": 0.0028368567593956054, "phrase": "support_values"}, {"score": 0.0026797398345997114, "phrase": "large_number"}, {"score": 0.0025740882809779913, "phrase": "\"_status"}, {"score": 0.002391067964886602, "phrase": "implementation_issues"}, {"score": 0.0021049977753042253, "phrase": "even_larger_analyses"}], "paper_keywords": ["Phylogeny", " consensus methods", " bootstrapping", " support values", " MAST"], "paper_abstract": "Many of the steps in phylogenetic reconstruction can be confounded by \"rogue\" taxa-taxa that cannot be placed with assurance anywhere within the tree, indeed, whose location within the tree varies with almost any choice of algorithm or parameters. Phylogenetic consensus methods, in particular, are known to suffer from this problem. In this paper, we provide a novel framework to define and identify rogue taxa. In this framework, we formulate a bicriterion optimization problem, the relative information criterion, that models the net increase in useful information present in the consensus tree when certain taxa are removed from the input data. We also provide an effective greedy heuristic to identify a subset of rogue taxa and use this heuristic in a series of experiments, with both pathological examples from the literature and a collection of large biological data sets. As the presence of rogue taxa in a set of bootstrap replicates can lead to deceivingly poor support values, we propose a procedure to recompute support values in light of the rogue taxa identified by our algorithm; applying this procedure to our biological data sets caused a large number of edges to move from \"unsupported\" to \"supported\" status, indicating that many existing phylogenies should be recomputed and reevaluated to reduce any inaccuracies introduced by rogue taxa. We also discuss the implementation issues encountered while integrating our algorithm into RAxML v7.2.7, particularly those dealing with scaling up the analyses. This integration enables practitioners to benefit from our algorithm in the analysis of very large data sets (up to 2,500 taxa and 10,000 trees, although we present the results of even larger analyses).", "paper_title": "Uncovering Hidden Phylogenetic Consensus in Large Data Sets", "paper_id": "WOS:000290449000005"}