{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-finger_manipulation"}, {"score": 0.003980687255880282, "phrase": "appropriate_control_strategy"}, {"score": 0.003818326867123525, "phrase": "cyclic_finger_motions"}, {"score": 0.0035977623578676496, "phrase": "exact_trajectory"}, {"score": 0.0033101397746161843, "phrase": "final_orientation"}, {"score": 0.003009390313137981, "phrase": "control_policy"}, {"score": 0.0028693932802982417, "phrase": "offline_simulations"}, {"score": 0.0027852126030055305, "phrase": "practical_considerations"}, {"score": 0.0026714812866037584, "phrase": "synthesized_motions"}, {"score": 0.0025776913268808124, "phrase": "scalarized_multi-objective_optimization"}, {"score": 0.0022209780222461587, "phrase": "low-level_controllers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Grasping", " Manipulation", " Hand animation"], "paper_abstract": "We present a method for one-handed, task-based manipulation of objects. Our approach uses a mid-level, multi-phase approach to organize the problem into three phases. This provides an appropriate control strategy for each phase and results in cyclic finger motions that, together, accomplish the task. The exact trajectory of the object is never specified since the goal is defined by the final orientation and position of the object. All motion is physically based and guided by a control policy that is learned through a series of offline simulations. We also discuss practical considerations for our learning method. Variations in the synthesized motions are possible by tuning a scalarized multi-objective optimization. We demonstrate our method with two manipulation tasks, discussing the performance and limitations. Additionally, we provide an analysis of the robustness of the low-level controllers used by our framework. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Goal directed multi-finger manipulation: Control policies and analysis", "paper_id": "WOS:000325834400007"}