{"auto_keywords": [{"score": 0.04754843024727077, "phrase": "performance_evaluation"}, {"score": 0.046052300942641664, "phrase": "stochastic_monotonicity"}, {"score": 0.043716255883393715, "phrase": "markov_chain"}, {"score": 0.03647396736112184, "phrase": "monotonicity_properties"}, {"score": 0.03269788843226682, "phrase": "markovian_submodels"}, {"score": 0.028945221607366203, "phrase": "fixed_point_system"}, {"score": 0.00481495049065317, "phrase": "high_speed"}, {"score": 0.004774937143916685, "phrase": "mobile_networks"}, {"score": 0.0037795163893761027, "phrase": "exact_value"}, {"score": 0.0036400696415545813, "phrase": "approximated_value"}, {"score": 0.0035947360742084253, "phrase": "unknown_parameter"}, {"score": 0.0032246835734680377, "phrase": "second_application"}, {"score": 0.0031579997262619758, "phrase": "well_known_approximation_method"}, {"score": 0.00300351371036355, "phrase": "complex_networks"}, {"score": 0.0028209599545587745, "phrase": "next_submodel"}, {"score": 0.0027857990883821504, "phrase": "iterative_computation"}, {"score": 0.002509284173541882, "phrase": "convergence_proof"}, {"score": 0.002477998427152547, "phrase": "iterative_algorithm"}, {"score": 0.0021049977753042253, "phrase": "fixed_point_systems"}], "paper_keywords": ["Stochastic monotonicity", " Markov chains", " Iterative algorithms", " Communication networks"], "paper_abstract": "We illustrate through examples how monotonicity may help for performance evaluation of networks. We consider two different applications of stochastic monotonicity in performance evaluation. In the first one, we assume that a Markov chain of the model depends on a parameter that can be estimated only up to a certain level and we have only an interval that contains the exact value of the parameter. Instead of taking an approximated value for the unknown parameter, we show how we can use the monotonicity properties of the Markov chain to take into account the error bound from the measurements. In the second application, we consider a well known approximation method: the decomposition into Markovian submodels. In such an approach, models of complex networks or other systems are decomposed into Markovian submodels whose results are then used as parameters for the next submodel in an iterative computation. One obtains a fixed point system which is solved numerically. In general, we have neither an existence proof of the solution of the fixed point system nor a convergence proof of the iterative algorithm. Here we show how stochastic monotonicity can be used to answer these questions and provide, to some extent, the theoretical foundations for this approach. Furthermore, monotonicity properties can also help to derive more efficient algorithms to solve fixed point systems.", "paper_title": "Monotonicity and performance evaluation: applications to high speed and mobile networks", "paper_id": "WOS:000311507200007"}