{"auto_keywords": [{"score": 0.04891621500316522, "phrase": "self-organizing_overlay_networks"}, {"score": 0.03917580279660818, "phrase": "overlay_network"}, {"score": 0.015719716506582538, "phrase": "self-organizing_overlay_network"}, {"score": 0.004606479650820579, "phrase": "next_generation_networks"}, {"score": 0.004342430078306461, "phrase": "applications_performance"}, {"score": 0.004133940019630129, "phrase": "underlying_self-organizing_overlay_networks"}, {"score": 0.0032800186243040663, "phrase": "new_optimizing_approaches"}, {"score": 0.00307657476125683, "phrase": "evolutionary_optimization_methodology"}, {"score": 0.002914288956035066, "phrase": "dynamically_evolutionary_process"}, {"score": 0.0026538282523433684, "phrase": "collective_performance"}, {"score": 0.0026020254041372723, "phrase": "appropriate_fitness_functions"}, {"score": 0.002416589459425828, "phrase": "stable_state"}, {"score": 0.0023928819778638055, "phrase": "desired_global_application_performance"}, {"score": 0.0023003498123420237, "phrase": "proximity-based_overlay_topology_maintenance"}, {"score": 0.0022777800735119405, "phrase": "peer-to-peer_living_media"}, {"score": 0.0021049977753042253, "phrase": "local_available_information"}], "paper_keywords": ["evolutionary algorithm", " optimization", " overlay network", " self-organizing"], "paper_abstract": "Self-organizing overlay networks are emerging as next generation networks capable of adapting to the needs of applications at runtime. Applications performance significantly depends on the structure and behaviors of the underlying self-organizing overlay networks. To achieve desired performance, not only the logical overlay topology but also the behaviors of nodes in this overlay network need to be optimized. Moreover, self-organizing overlay networks are extremely dynamic, unreliable and often large-scale. It is therefore important to design new optimizing approaches to meet these challenges. In this paper, we present an evolutionary optimization methodology for self-organizing overlay network. The optimizations of self-organizing overlay networks are modeled as dynamically evolutionary process, in which the nodes interact with each other, change their internal structures and alter their external links to improve the collective performance. To design appropriate fitness functions and rules that guides the direction of the evolution, overlay network can reach a stable state with desired global application performance eventually. Such a methodology leads to our distributed algorithms for proximity-based overlay topology maintenance and Peer-to-Peer living media streaming, in which every node in the overlay network rewires their behaviors and connectivity according to local available information and embedded rules. These algorithms are shown to perform well using simulations.", "paper_title": "Optimizing self-organizing overlay network using evolutionary approach", "paper_id": "WOS:000253522700005"}