{"auto_keywords": [{"score": 0.048337051624524105, "phrase": "single_neurons"}, {"score": 0.035058720022299546, "phrase": "exponential_distribution"}, {"score": 0.00481495049065317, "phrase": "inferior_temporal_visual_cortex"}, {"score": 0.004105666842002734, "phrase": "visual_stimuli"}, {"score": 0.0037421829222825964, "phrase": "visual_fixation_task"}, {"score": 0.0036598289615980837, "phrase": "significantly_different_responses"}, {"score": 0.003579280847524597, "phrase": "firing_rate_distribution"}, {"score": 0.003461758868675955, "phrase": "twenty-nine_percent"}, {"score": 0.0032381271420557052, "phrase": "gamma_distribution"}, {"score": 0.0031786037839399055, "phrase": "raw_firing_rate_distribution"}, {"score": 0.002791393223133408, "phrase": "maximal_value"}, {"score": 0.0026401983633087267, "phrase": "rather_distributed_representation"}, {"score": 0.0025251455169484557, "phrase": "whole_population"}, {"score": 0.0024061422012437344, "phrase": "average_value"}, {"score": 0.0021049977753042253, "phrase": "different_neurons"}], "paper_keywords": [""], "paper_abstract": "The sparseness of the encoding of stimuli by single neurons and by populations of neurons is fundamental to understanding the efficiency and capacity of representations in the brain, and was addressed as follows. The selectivity and sparseness of firing to visual stimuli of single neurons in the primate inferior temporal visual cortex were measured to a set of 20 visual stimuli including objects and faces in macaques performing a visual fixation task. Neurons were analysed with significantly different responses to the stimuli. The firing rate distribution of 36% of the neurons was exponential. Twenty-nine percent of the neurons had too few low rates to be fitted by an exponential distribution, and were fitted by a gamma distribution. Interestingly, the raw firing rate distribution taken across all neurons fitted an exponential distribution very closely. The sparseness a(s) or selectivity of the representation of the set of 20 stimuli provided by each of these neurons (which takes a maximal value of 1.0) had an average across all neurons of 0.77, indicating a rather distributed representation. The sparseness of the representation of a given stimulus by the whole population of neurons, the population sparseness a(p), also had an average value of 0.77. The similarity of the average single neuron selectivity a(s) and population sparseness for any one stimulus taken at any one time a(p) shows that the representation is weakly ergodic. For this to occur, the different neurons must have uncorrelated tuning profiles to the set of stimuli.", "paper_title": "Neuronal selectivity, population sparseness, and ergodicity in the inferior temporal visual cortex", "paper_id": "WOS:000247153500001"}