{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "secondary_structures"}, {"score": 0.004697308822154191, "phrase": "precise_prediction"}, {"score": 0.004651057147690674, "phrase": "protein_secondary_structure"}, {"score": 0.004582528208024817, "phrase": "key_importance"}, {"score": 0.00442651096522781, "phrase": "biological_function"}, {"score": 0.004130165601475531, "phrase": "prediction_accuracies"}, {"score": 0.0036312482387007815, "phrase": "first_time"}, {"score": 0.0035954555250614197, "phrase": "structural_position-specific_scoring_matrix"}, {"score": 0.003455765987713262, "phrase": "unprecedented_database"}, {"score": 0.0032241994368246065, "phrase": "purpose-designed_blast_tool"}, {"score": 0.0031609252620168446, "phrase": "novel_prediction_tool"}, {"score": 0.002993231973906559, "phrase": "large_dataset"}, {"score": 0.0028484940955893134, "phrase": "protein_secondary_structure_prediction"}, {"score": 0.002394719113232821, "phrase": "newly_determined_sequences"}, {"score": 0.002212040873849046, "phrase": "low-homology_proteins"}, {"score": 0.002147180332779021, "phrase": "spssmpred"}], "paper_keywords": [""], "paper_abstract": "Motivation: The precise prediction of protein secondary structure is of key importance for the prediction of 3D structure and biological function. Although the development of many excellent methods over the last few decades has allowed the achievement of prediction accuracies of up to 80%, progress seems to have reached a bottleneck, and further improvements in accuracy have proven difficult. Results: We propose for the first time a structural position-specific scoring matrix (SPSSM), and establish an unprecedented database of 9 million sequences and their SPSSMs. This database, when combined with a purpose-designed BLAST tool, provides a novel prediction tool: SPSSMPred. When the SPSSMPred was validated on a large dataset (10 814 entries), the Q3 accuracy of the protein secondary structure prediction was 93.4%. Our approach was tested on the two latest EVA sets; accuracies of 82.7 and 82.0% were achieved, far higher than can be achieved using other predictors. For further evaluation, we tested our approach on newly determined sequences (141 entries), and obtained an accuracy of 89.6%. For a set of low-homology proteins (40 entries), the SPSSMPred still achieved a Q3 value of 84.6%.", "paper_title": "A novel structural position-specific scoring matrix for the prediction of protein secondary structures", "paper_id": "WOS:000298383800006"}