{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "activity_landscapes"}, {"score": 0.04931727328027492, "phrase": "activity_cliffs"}, {"score": 0.039750428575466526, "phrase": "activity_landscape_models"}, {"score": 0.02888807132631179, "phrase": "non-random_landscapes"}, {"score": 0.00444377150105556, "phrase": "visual_representation"}, {"score": 0.004286171444202565, "phrase": "sar._recent_developments"}, {"score": 0.004052007312730483, "phrase": "predictive_abilities"}, {"score": 0.00401961206251868, "phrase": "activity_landscape_methods"}, {"score": 0.0035635256137029592, "phrase": "current_study"}, {"score": 0.0035067452724203124, "phrase": "first_time"}, {"score": 0.0034508665218929745, "phrase": "quantitative_manner"}, {"score": 0.0033417571465258, "phrase": "individual_cliffs"}, {"score": 0.0031845067058084583, "phrase": "activity_landscape"}, {"score": 0.003083793024782014, "phrase": "randomly_generated_landscape"}, {"score": 0.0029862549873935496, "phrase": "sali_measure"}, {"score": 0.0029623549392492777, "phrase": "six_different_data_sets"}, {"score": 0.0028003107731426322, "phrase": "single_and_multiple_representations"}, {"score": 0.002668470532683947, "phrase": "molecular_representation"}, {"score": 0.002615381301695394, "phrase": "data_sets"}, {"score": 0.0022721178679337025, "phrase": "consensus_models"}, {"score": 0.0022268964676199292, "phrase": "significance_testing"}], "paper_keywords": ["Consensus models", " Structure-activity relationships", " Significant activity cliffs", " Structure Activity Landscape Index"], "paper_abstract": "Background: Most work on the topic of activity landscapes has focused on their quantitative description and visual representation, with the aim of aiding navigation of SAR. Recent developments have addressed applications such as quantifying the proportion of activity cliffs, investigating the predictive abilities of activity landscape methods and so on. However, all these publications have worked under the assumption that the activity landscape models are \"real\" (i.e., statistically significant). Results: The current study addresses for the first time, in a quantitative manner, the significance of a landscape or individual cliffs in the landscape. In particular, we question whether the activity landscape derived from observed (experimental) activity data is different from a randomly generated landscape. To address this we used the SALI measure with six different data sets tested against one or more molecular targets. We also assessed the significance of the landscapes for single and multiple representations. Conclusions: We find that non-random landscapes are data set and molecular representation dependent. For the data sets and representations used in this work, our results suggest that not all representations lead to non-random landscapes. This indicates that not all molecular representations should be used to a) interpret the SAR and b) combined to generate consensus models. Our results suggest that significance testing of activity landscape models and in particular, activity cliffs, is key, prior to the use of such models.", "paper_title": "On the validity versus utility of activity landscapes: are all activity cliffs statistically significant?", "paper_id": "WOS:000335605600001"}