{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bioactive_compounds"}, {"score": 0.0047515546458205046, "phrase": "target-dependent_composite_workflow"}, {"score": 0.004606843145343611, "phrase": "chemoinformatic_method"}, {"score": 0.004526129302830441, "phrase": "main_and_secondary_targets"}, {"score": 0.0042734067085669885, "phrase": "potential_side_effects"}, {"score": 0.004198510172614725, "phrase": "existing_drugs"}, {"score": 0.004161553532799662, "phrase": "novel_therapeutic_indications"}, {"score": 0.003911771812701971, "phrase": "single_computational_method"}, {"score": 0.0038602215057106917, "phrase": "potentially_new_target-ligand_associations"}, {"score": 0.003759142310009214, "phrase": "automated_workflow"}, {"score": 0.003660700128133065, "phrase": "target-ligand_space"}, {"score": 0.0036124465071873998, "phrase": "existing_knowledge"}, {"score": 0.00354909279546064, "phrase": "target_space"}, {"score": 0.0029733865110222785, "phrase": "well-defined_ligand_and_target_property_checks"}, {"score": 0.002807118943000936, "phrase": "main_target"}, {"score": 0.002626760910629479, "phrase": "rolofylline"}, {"score": 0.002436289099444074, "phrase": "moderate_affinity"}, {"score": 0.002279702500235741, "phrase": "strong_binding"}, {"score": 0.0021906130276146325, "phrase": "claimed_selective_phosphodiesterase"}], "paper_keywords": [""], "paper_abstract": "Computational target fishing is a chemoinformatic method aimed at determining main and secondary targets of bioactive compounds in order to explain their mechanism of action, anticipate potential side effects, or repurpose existing drugs for novel therapeutic indications. Many existing successes in this area have been based on a use of a single computational method to estimate potentially new target-ligand associations. We herewith present an automated workflow using several methods to optimally browse target-ligand space according to existing knowledge on either ligand and target space under investigation. The protocol uses four ligand-based (SVM classification, SVR affinity prediction, nearest neighbors interpolation, shape similarity) and two structure-based approaches (docking, protein-ligand pharmacophore match) in series, according to well-defined ligand and target property checks. The workflow was remarkably accurate (72%) in identifying the main target of 189 clinical candidates and proposed two novel off-targets which could be experimentally validated. Rolofylline, an adenosine A(1) receptor antagonist, was confirmed to inhibit phosphodiesterase 5 with a moderate affinity (IC50 = 13.8 mu M). More interestingly, we describe a strong binding (IC50 = 142 nM) of a claimed selective phosphodiesterase 10 A inhibitor (PF-2545920) with the cysteinyl leukotriene type 1 G protein-coupled receptor.", "paper_title": "Computational Profiling of Bioactive Compounds Using a Target-Dependent Composite Workflow", "paper_id": "WOS:000330097200011"}