{"auto_keywords": [{"score": 0.04966877349162058, "phrase": "neutral_genetic_drift"}, {"score": 0.007152368807539886, "phrase": "cartesian_genetic_programming"}, {"score": 0.00706293892908607, "phrase": "explicit_genetic_redundancy"}, {"score": 0.006853823298770536, "phrase": "implicit_genetic_redundancy"}, {"score": 0.006764090666190051, "phrase": "local_optima"}, {"score": 0.004712463245074863, "phrase": "evolutionary_mechanism"}, {"score": 0.004361163586439822, "phrase": "evolutionary_computational_methods"}, {"score": 0.004141575435071002, "phrase": "genetic_programming_technique"}, {"score": 0.003751011827704279, "phrase": "useful_tool"}, {"score": 0.0034562118159899772, "phrase": "substantial_evaluation"}, {"score": 0.002448061472257196, "phrase": "new_possibilities"}, {"score": 0.002304607326525017, "phrase": "cgp"}, {"score": 0.0021049977753042253, "phrase": "additional_benefits"}], "paper_keywords": ["Cartesian Genetic Programming", " Neutral genetic drift", " Genetic redundancy"], "paper_abstract": "Neutral genetic drift is an evolutionary mechanism which can strongly aid the escape from local optima. This makes neutral genetic drift an increasingly important property of Evolutionary Computational methods as more challenging applications are approached. Cartesian Genetic Programming (CGP) is a Genetic Programming technique which contains explicit, as well as the more common implicit, genetic redundancy. As explicit genetic redundancy is easily identified and manipulated it represents a useful tool for investigating neutral genetic drift. The contributions of this paper are as follows. Firstly the paper presents a substantial evaluation of the role and benefits of neutral genetic drift in CGP. Here it is shown that the benefits of explicit genetic redundancy are additive to the benefits of implicit genetic redundancy. This is significant as it indicates that that levels of implicit genetic redundancy present in other Evolutionary Computational methods may be insufficient to fully utilise neutral genetic drift. It is also shown than the identification and manipulation of explicit genetic redundancy is far easier than for implicit genetic redundancy. This is significant as it makes the investigations here possible and leads to new possibilities for allowing more effective use of neutral genetic drift. This is the case not only for CGP, but many other Evolutionary Computational methods which contain explicit genetic redundancy. Finally, it is also shown that neutral genetic drift has additional benefits other than aiding the escape from local optima.", "paper_title": "Neutral genetic drift: an investigation using Cartesian Genetic Programming", "paper_id": "WOS:000364634900004"}