{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "interpersonal_relationships"}, {"score": 0.02150946861914653, "phrase": "internet_addiction"}, {"score": 0.005259768633503281, "phrase": "porn_website_surfing"}, {"score": 0.00481495049065317, "phrase": "college_students'_internet_usage"}, {"score": 0.004562847483469705, "phrase": "different_internet_usages"}, {"score": 0.00413767314434795, "phrase": "new_functions"}, {"score": 0.0038827648476984756, "phrase": "facebook"}, {"score": 0.0037519679864796906, "phrase": "new_relationships"}, {"score": 0.0036079110889031874, "phrase": "close_relationships"}, {"score": 0.0033361232750221863, "phrase": "person's_interpersonal_relationships"}, {"score": 0.002663208600887875, "phrase": "different_grade_levels"}, {"score": 0.0026372419109713923, "phrase": "internet_usage"}, {"score": 0.002548331088496964, "phrase": "internet_functions"}, {"score": 0.002523481637809674, "phrase": "social_interaction"}, {"score": 0.002498873893632724, "phrase": "video_watching"}, {"score": 0.0022216045996270974, "phrase": "social_interactions"}, {"score": 0.0021784745589727246, "phrase": "game_playing"}, {"score": 0.0021049977753042253, "phrase": "poor_interpersonal_relationships"}], "paper_keywords": ["Internet addiction", " Interpersonal relationship", " Internet usage"], "paper_abstract": "This study investigated the effects of different Internet usages on interpersonal relationships intermediated by Internet addiction. Many past studies have shown that overuses of Internet negatively affect interpersonal relationships. However, new functions on the Internet provide more online interactions, especially some social websites such as Facebook, which enable individuals to establish new relationships with acquaintances, as well as maintain close relationships with friends. This drives us to question whether the Internet is detrimental to a person's interpersonal relationships or whether, instead, it might enhance them. This study examined the association among various Internet usages, Internet addiction, and interpersonal relationships. In total, 444 valid copies of questionnaires were collected from a university. The results revealed some discrepancies among genders and students in different grade levels regarding Internet usage. It was found that the Internet functions of social interaction, video watching, and information seeking can enhance interpersonal relationships, while porn website surfing and game playing do not directly affect them. On the other hand, social interactions, porn website surfing, game playing, and video watching led to poor interpersonal relationships mediated by Internet addiction.", "paper_title": "The Association between College Students' Internet Usage and Interpersonal Relationships", "paper_id": "WOS:000340983100018"}