{"auto_keywords": [{"score": 0.00471193241675062, "phrase": "early_warning"}, {"score": 0.004651177631663439, "phrase": "users'_perspective"}, {"score": 0.004591202593942391, "phrase": "special_category"}, {"score": 0.004340247531010891, "phrase": "australia"}, {"score": 0.004284100953217494, "phrase": "instructive_case"}, {"score": 0.004247180402119585, "phrase": "early_warning_information"}, {"score": 0.004084920064588169, "phrase": "australia's_recorded_history"}, {"score": 0.0036500346000495317, "phrase": "affected_residents'_information_needs"}, {"score": 0.0032471982781283374, "phrase": "timely_warning"}, {"score": 0.00319141242685261, "phrase": "clearly_fire_severity"}, {"score": 0.003163878786694538, "phrase": "nearly_two_thirds"}, {"score": 0.0030560920414081645, "phrase": "official_warning"}, {"score": 0.002888692115811987, "phrase": "personal_observation"}, {"score": 0.0027068691342344545, "phrase": "normalcy_bias"}, {"score": 0.0024713335323674223, "phrase": "disaster_warnings"}, {"score": 0.002266051712795851, "phrase": "warning_information"}, {"score": 0.0021418339161425994, "phrase": "policy's_effectiveness"}, {"score": 0.0021049977753042253, "phrase": "information_challenges"}], "paper_keywords": [""], "paper_abstract": "This study examines early warning from the users' perspective as a special category of information seeking. Specifically, we look at the 2009 Victorian bushfires in Australia as an instructive case of early warning information seeking. The bushfires, the worst in Australia's recorded history, were unique in its ferocity and damage caused, but also in the amount of data and research that was generated. We analyzed the affected residents' information needs, seeking and use in terms of their cognitive, affective, and situational dimensions. We found that residents wanted information that would act as a \"trigger for action,\" provide timely warning, and indicate clearly fire severity. Nearly two thirds of residents surveyed did not receive an official warning. Almost half first found out that the bushfire was in their area through personal observation of smoke, embers, or flames. We suggest that a form of normalcy bias may have been at work during information seeking, causing people to interpret their situations as \"normal\" even when disaster warnings have been issued. Although the authorities had adopted a \"Stay or Go\" policy to help residents use warning information to decide between staying to defend their property or leaving early, the policy's effectiveness was undermined by information challenges.", "paper_title": "Early Warning Information Seeking in the 2009 Victorian Bushfires", "paper_id": "WOS:000335580800008"}