{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "finger-count_interaction"}, {"score": 0.04253556916257135, "phrase": "finger-count_gestures"}, {"score": 0.00475382761232911, "phrase": "multitouch_gestures"}, {"score": 0.0046141941030386525, "phrase": "multi-touch_displays"}, {"score": 0.004536244367689415, "phrase": "challenging_problem"}, {"score": 0.004421770937919324, "phrase": "gestural_vocabularies"}, {"score": 0.003958049372486465, "phrase": "multi-finger_and_two-handed_gestures"}, {"score": 0.0039244530915794025, "phrase": "finger-count"}, {"score": 0.0034532961266947734, "phrase": "finger-count_menu"}, {"score": 0.003409399407390298, "phrase": "menu_technique"}, {"score": 0.0033804443117334535, "phrase": "teaching_method"}, {"score": 0.003104038398386081, "phrase": "menu_technique_perspectives"}, {"score": 0.0029744042270542655, "phrase": "alternative_designs"}, {"score": 0.002850168497994985, "phrase": "multi-user_scenarios"}, {"score": 0.0026734504926268442, "phrase": "radial_menus"}, {"score": 0.0023926387830753033, "phrase": "finger-count_for"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Menu techniques", " Multi-touch", " Multi-finger interaction", " Two-handed interaction"], "paper_abstract": "Selecting commands on multi-touch displays is still a challenging problem. While a number of gestural vocabularies have been proposed, these are generally restricted to one or two fingers or can be difficult to learn. We introduce Finger-Count gestures, a coherent set of multi-finger and two-handed gestures. Finger-Count gestures are simple, robust, expressive and fast to perform. In order to make these gestures self-revealing and easy to learn, we propose the Finger-Count menu, a menu technique and teaching method for implicitly learning Finger-Count gestures. We discuss the properties, advantages and limitations of Finger-Count interaction from the gesture and menu technique perspectives as well as its integration into three applications. We present alternative designs to increase the number of commands and to enable multi-user scenarios. Following a study which shows that Finger:Count is as easy to learn as radial menus, we report the results of an evaluation investigating which gestures are easier to learn and which finger chords people prefer. Finally, we present Finger-Count for in-the-air gestures. Thereby, the same gesture set can be used from a distance as well as when touching the surface. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Design and evaluation of finger-count interaction: Combining multitouch gestures and menus", "paper_id": "WOS:000309695200003"}