{"auto_keywords": [{"score": 0.04296888386788002, "phrase": "online_shoppers"}, {"score": 0.0341348972039469, "phrase": "utilitarian_benefits"}, {"score": 0.00481495049065317, "phrase": "net-enabled_infomediaries"}, {"score": 0.004588158931776543, "phrase": "online_consumers"}, {"score": 0.004372002674739612, "phrase": "prominent_trend"}, {"score": 0.004229306699561554, "phrase": "consumer_reactions"}, {"score": 0.004191200981137508, "phrase": "new_ecommerce_tool"}, {"score": 0.00406663414150229, "phrase": "new_infomediary_website"}, {"score": 0.00399367108161192, "phrase": "conceptual_model"}, {"score": 0.003898411343926653, "phrase": "technology_acceptance_model"}, {"score": 0.003771114171630529, "phrase": "transaction_cost_analysis"}, {"score": 0.003748422620183546, "phrase": "tca"}, {"score": 0.003692271726952282, "phrase": "powerful_search_capabilities"}, {"score": 0.0035824802350703376, "phrase": "potential_retailers"}, {"score": 0.0033020239107199876, "phrase": "proposed_model"}, {"score": 0.003213489259323921, "phrase": "online_customers"}, {"score": 0.003080449000295983, "phrase": "one's_willingness"}, {"score": 0.0028391824655912617, "phrase": "subjective_interpretation"}, {"score": 0.0027215964067013924, "phrase": "online_questionnaire"}, {"score": 0.002680789041160613, "phrase": "online_shoppers'_intention"}, {"score": 0.002546554566866823, "phrase": "perceived_ease"}, {"score": 0.0024336917123957387, "phrase": "asset_specificity"}, {"score": 0.0023541098780336255, "phrase": "high_transaction-specific_investment"}, {"score": 0.0023328599525181707, "phrase": "specific_online_retailer"}, {"score": 0.0022160085332710265, "phrase": "online_retailers"}], "paper_keywords": ["e-commerce", " TAM", " transaction cost analysis", " net-enhanced B2C systems", " online shopping"], "paper_abstract": "The emergence of infomediaries - which allow online consumers to search for, and provide comparisons among, many online retailers - is a prominent trend in ecommerce. However, little research has been done on consumer reactions to this new ecommerce tool. To explain why and how online shoppers adopt a new infomediary website, this study proposes a conceptual model with insights obtained from literatures on the technology acceptance model (TAM), the economics of intermediation, and transaction cost analysis (TCA). Infomediaries provide powerful search capabilities to online shoppers to provide them with a list of potential retailers ( efficiency benefits), and then provide information to aid in selecting from this list of retailers ( effectiveness benefits). Accordingly, the proposed model posits that infomediaries offer two major types of utilitarian benefits to online customers: namely, perceived efficiency and perceived effectiveness. In addition, the model predicts that one's willingness to adopt an infomediary is a function of his/her evaluation of the two types of utilitarian benefits of using the infomediary, which are in turn determined by the subjective interpretation of his/ her e-commerce transaction environment. The model was tested using data collected from an online questionnaire administered to 367 online shoppers. Online shoppers' intention to use the infomediary was found to be a function of the two types of utilitarian benefits and perceived ease of use. In addition, our findings suggest that online shoppers who are low on asset specificity ( e. g., consumers who have not made a high transaction-specific investment toward a specific online retailer) and who also are high on uncertainty ( e. g., consumers who believe that online retailers in general are opportunistic) tend to appreciate the benefits of using an infomediary more than other online shoppers.", "paper_title": "Consumer adoption of net-enabled infomediaries: Theoretical explanations and an empirical test", "paper_id": "WOS:000246738600002"}