{"auto_keywords": [{"score": 0.04967088836874544, "phrase": "fuzzy_uml_models"}, {"score": 0.03302063764038534, "phrase": "fuzzy_ontologies"}, {"score": 0.005580430269409345, "phrase": "web_ontologies"}, {"score": 0.004613175917207636, "phrase": "semantic_web"}, {"score": 0.004419819325202464, "phrase": "classical_ontology_construction_approaches"}, {"score": 0.004307700591183651, "phrase": "imprecise_and_uncertain_information"}, {"score": 0.004127094600862448, "phrase": "great_efforts"}, {"score": 0.0038207994186834015, "phrase": "formal_approach"}, {"score": 0.0037558704408683905, "phrase": "automated_tool"}, {"score": 0.003582928547553209, "phrase": "formalization_methods"}, {"score": 0.003316884515934182, "phrase": "semantic_interpretation_methods"}, {"score": 0.003063708687640905, "phrase": "constructed_fuzzy_ontologies"}, {"score": 0.002854645802851, "phrase": "proposed_approach"}, {"score": 0.0027940789980683, "phrase": "prototype_transformation_tool"}, {"score": 0.0021973099304606076, "phrase": "reasoning_tasks"}, {"score": 0.0021049977753042253, "phrase": "reasoning_mechanism"}], "paper_keywords": ["Fuzzy UML model", " Fuzzy ontology", " Construction", " Reasoning"], "paper_abstract": "The success and proliferation of the Semantic Web depends heavily on construction of Web ontologies. However, classical ontology construction approaches are not sufficient for handling imprecise and uncertain information that is commonly found in many application domains. Therefore, great efforts on construction of fuzzy ontologies have been made in recent years. In this paper, we propose a formal approach and develop an automated tool for constructing fuzzy ontologies from fuzzy UML models. Firstly, we propose formalization methods of fuzzy UML models and fuzzy ontologies, where fuzzy UML models and fuzzy ontologies can be represented and interpreted by their respective formal definitions and semantic interpretation methods. Then, we propose an approach for constructing fuzzy ontologies from fuzzy UML models, i.e., transforming fuzzy UML models (including the structure and instance information of fuzzy UML models) into fuzzy ontologies. Furthermore, following the proposed approach, we implement a prototype transformation tool called FUML2FOnto that can construct fuzzy ontologies from fuzzy UML models. Constructing fuzzy ontologies from fuzzy UML models will facilitate the development of Web ontologies. Moreover, in order to show that the constructed fuzzy ontologies may be useful for reasoning on fuzzy UML models, we investigate how to reason on fuzzy UML models based on the constructed fuzzy ontologies, and it turns out that the reasoning tasks of fuzzy UML models can be checked by means of the reasoning mechanism of fuzzy ontologies.", "paper_title": "Construction of Fuzzy Ontologies from Fuzzy UML Models", "paper_id": "WOS:000315944900004"}