{"auto_keywords": [{"score": 0.04265549222326924, "phrase": "homogeneous_areas"}, {"score": 0.042357817734438044, "phrase": "data_cubes"}, {"score": 0.00481495049065317, "phrase": "multiple-level_fuzzy_blocks"}, {"score": 0.004728122501822142, "phrase": "multidimensional_databases"}, {"score": 0.004609175313390942, "phrase": "standard_way"}, {"score": 0.0045591142048535165, "phrase": "aggregated_and_historized_data"}, {"score": 0.0038559375376635047, "phrase": "main_trends"}, {"score": 0.003704467870496114, "phrase": "levelwise_approach"}, {"score": 0.0034190870593244884, "phrase": "chocolate"}, {"score": 0.0032848751442918966, "phrase": "london"}, {"score": 0.003260874860710321, "phrase": "pat"}, {"score": 0.0027876981671591202, "phrase": "measure_values"}, {"score": 0.0027373270600305885, "phrase": "fuzzy_partition"}, {"score": 0.0025170626402362633, "phrase": "fuzzy_measure_values"}, {"score": 0.00241805924231814, "phrase": "output_set"}, {"score": 0.0021752783872387173, "phrase": "efficient_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["multidimensional databases", " hierarchies", " levelwise algorithms", " fuzzy data mining"], "paper_abstract": "Multidimensional databases are now recognized as being the standard way to store aggregated and historized data. Multidimensional databases are designed to store information on measures (also known as indicators) regarding a set of dimensions. One important issue in this framework is the identification of homogeneous areas in data cubes, which allows users to summarize and visualize the data through the main trends they contain. In our previous work, we have proposed a levelwise approach to mine homogeneous areas of the data, called blocks that can be interpreted, for instance, as If product is Chocolate and month is between January and March and city is London or Pat-is, then the number of sales is 5. However, in this work, the information provided by the hierarchies defined over the dimensions is not taken into account. In this paper, we consider the case where measure values are discretized using a fuzzy partition, and we extend our method so as to mine multiple-level fuzzy blocks, that is, blocks that are defined using hierarchies and that characterize fuzzy measure values. Moreover, in order to avoid redundancies in the output set of blocks, only the most specific ones (according to hierarchies) are computed. We show that our algorithms are linear in the size of the cube, thus providing an efficient method for summarizing data cubes. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Mining multiple-level fuzzy blocks from multidimensional data", "paper_id": "WOS:000256820300008"}