{"auto_keywords": [{"score": 0.03603678363143078, "phrase": "chemistry_librarians"}, {"score": 0.00481495049065317, "phrase": "chemistry_research_data_management"}, {"score": 0.004692227830462433, "phrase": "compelling_needs"}, {"score": 0.004204459295724526, "phrase": "government_mandates"}, {"score": 0.004123781267600542, "phrase": "research_data"}, {"score": 0.004018844570641612, "phrase": "europe"}, {"score": 0.0028530201960995896, "phrase": "necessary_infrastructure"}, {"score": 0.0027622407190589326, "phrase": "best_practices"}, {"score": 0.002709161672473817, "phrase": "full_research_data_cycle"}, {"score": 0.0022168460543913787, "phrase": "increased_collaboration"}], "paper_keywords": ["Chemistry librarians", " Research data management", " Chemistry metadata", " Chemical health and safety"], "paper_abstract": "There are compelling needs from a variety of camps for more chemistry data to be available. While there are funder and government mandates for depositing research data in the United States and Europe, this does not mean it will be done well or expediently. Chemists themselves do not appear overly engaged at this stage and chemistry librarians who work directly with chemists and their local information environments are interested in helping with this challenge. Our unique understanding of organizing data and information enables us to contribute to building necessary infrastructure and establishing standards and best practices across the full research data cycle. As not many support structures focused on chemistry currently exist, we are initiating explorations through a few case studies and focused pilot projects presented here, with an aim of identifying opportunities for increased collaboration among chemists, chemistry librarians, cheminformaticians and other chemistry professionals.", "paper_title": "Academic librarians at play in the field of cheminformatics: building the case for chemistry research data management", "paper_id": "WOS:000343819600002"}