{"auto_keywords": [{"score": 0.04035766097608913, "phrase": "base_station"}, {"score": 0.015513337096446315, "phrase": "gathering_problem"}, {"score": 0.009582330216163594, "phrase": "optimal_makespan"}, {"score": 0.006203344987118653, "phrase": "personalized_broadcasting_problem"}, {"score": 0.00481495049065317, "phrase": "radio_grids"}, {"score": 0.004719410128388276, "phrase": "particular_node"}, {"score": 0.004101443275426048, "phrase": "interference_constraints"}, {"score": 0.0031527034724242392, "phrase": "non-buffering_model"}, {"score": 0.0030286255681983712, "phrase": "next_step"}, {"score": 0.002235795635149101, "phrase": "approximation_algorithms"}, {"score": 0.0021191453699647483, "phrase": "personalized_broadcasting"}], "paper_keywords": ["Gathering", " Personalized broadcasting", " Grid", " Interference", " Radio networks"], "paper_abstract": "In the gathering problem, a particular node in a graph, the base station, aims at receiving messages from some nodes in the graph. At each step, a node can send one message to one of its neighbors (such an action is called a call). However, a node cannot send and receive a message during the same step. Moreover, the communication is subject to interference constraints, more precisely, two calls interfere in a step, if one sender is at distance at most d(I) from the other receiver. Given a graph with a base station and a set of nodes having some messages, the goal of the gathering problem is to compute a schedule of calls for the base station to receive all messages as fast as possible, i.e., minimizing the number of steps (called makespan). The gathering problem is equivalent to the personalized broadcasting problem where the base station has to send messages to some nodes in the graph, with same transmission constraints. In this paper, we focus on the gathering and personalized broadcasting problem in grids. Moreover, we consider the non-buffering model: when a node receives a message at some step, it must transmit it during the next step. In this setting, though the problem of determining the complexity of computing the optimal makespan in a grid is still open, we present linear (in the number of messages) algorithms that compute schedules for gathering with d(I) is an element of {0, 1, 2}. In particular, we present an algorithm that achieves the optimal makespan up to an additive constant 2 when d(I) = 0. If no messages are \"close\" to the axes (the base station being the origin), our algorithms achieve the optimal makespan up to an additive constant 1 when d(I) =0, 4 when d(I). = 2, and 3 when both d(I) =1 and the base station is in a corner. Note that, the approximation algorithms that we present also provide approximation up to a ratio 2 for the gathering with buffering. All our results are proved in terms of personalized broadcasting. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Data gathering and personalized broadcasting in radio grids with interference", "paper_id": "WOS:000347602000032"}