{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mathematical_model"}, {"score": 0.049010515885303176, "phrase": "application_servers"}, {"score": 0.004771672073078768, "phrase": "low-rate_dos"}, {"score": 0.004339979174946844, "phrase": "shrew_attack"}, {"score": 0.004262273304740847, "phrase": "quality_attacks"}, {"score": 0.003309278541665552, "phrase": "mathematical_models"}, {"score": 0.0032061793819537633, "phrase": "sometimes_complex_processes"}, {"score": 0.0029959082125682918, "phrase": "lordas_attack"}, {"score": 0.0028120802837806234, "phrase": "configuration_parameters"}, {"score": 0.002488724764295623, "phrase": "simulated_environment"}, {"score": 0.0024220634963019114, "phrase": "applicability_issues"}, {"score": 0.0023253967212081626, "phrase": "interpretation_guidelines"}, {"score": 0.0022940375532231145, "phrase": "model's_behaviour"}, {"score": 0.0021337783230121286, "phrase": "challenging_task"}, {"score": 0.0021049977753042253, "phrase": "defense_techniques"}], "paper_keywords": ["Denial of service (DoS) attacks", " low-rate traffic", " modeling techniques", " network-level security and protection"], "paper_abstract": "In recent years, variants of denial of service (DoS) attacks that use low-rate traffic have been proposed, including the Shrew attack, reduction of quality attacks, and low-rate DoS attacks against application servers (LoRDAS). All of these are flooding attacks that take advantage of vulnerability in the victims for reducing the rate of the traffic. Although their implications and impact have been comprehensively studied, mainly by means of simulation, there is a need for mathematical models by which the behaviour of these sometimes complex processes can be described. In this paper, we propose a mathematical model for the LoRDAS attack. This model allows us to evaluate its performance by relating it to the configuration parameters of the attack and the dynamics of network and victim. The model is validated by comparing the performance values given against those obtained from a simulated environment. In addition, some applicability issues for the model are contributed, together with interpretation guidelines to the model's behaviour. Finally, experience of the model enables us to make some recommendations for the challenging task of building defense techniques against this attack.", "paper_title": "Mathematical Model for Low-Rate DoS Attacks Against Application Servers", "paper_id": "WOS:000269155900021"}