{"auto_keywords": [{"score": 0.03414771930815549, "phrase": "collaborative_articles"}, {"score": 0.017507321555256684, "phrase": "citation_level"}, {"score": 0.015157782009656855, "phrase": "non-collaborative_articles"}, {"score": 0.010519569757466537, "phrase": "collaborative_research"}, {"score": 0.00481495049065317, "phrase": "higher_citation"}, {"score": 0.004235793609579307, "phrase": "non-collaborative_research"}, {"score": 0.003964007795174772, "phrase": "high_citation"}, {"score": 0.003894512634265439, "phrase": "economics_articles"}, {"score": 0.0035023063736682914, "phrase": "ssci"}, {"score": 0.0034105830956367854, "phrase": "american"}, {"score": 0.003163439005885435, "phrase": "citation_levels"}, {"score": 0.003080548510001051, "phrase": "main_findings"}, {"score": 0.00289546142998427, "phrase": "mean_citation_level"}, {"score": 0.002685558057339722, "phrase": "five_us_states"}, {"score": 0.0021331586055770447, "phrase": "multiple_indicators"}, {"score": 0.0021049977753042253, "phrase": "citation_advantage"}], "paper_keywords": ["Citation analysis", " Research collaboration"], "paper_abstract": "Many studies have found that collaborative research is, in general, more highly cited than non-collaborative research. This paper describes an investigation into the extent to which the association between high citation and collaboration for Economics articles published in 2000 varies from region to region and depends on the choice of indicator of citation level. Using data from the Social Science Citation Index (SSCI) for 18 countries, 17 American states and four indicators of citation level the citation levels of the collaborative articles are compared with the citation levels of the non-collaborative articles. The main findings are that: (a) for every country and every indicator the mean citation level of the collaborative articles was at least as high as that for the non-collaborative articles, but for five US states and for at least one other indicator the citation level of collaborative articles was lower than that of non-collaborative articles, and (b) the extent to which collaborative articles were more highly cited varied considerably from country to country, from state to state, and from indicator to indicator. This indicates the importance of using multiple indicators when investigating citation advantage since the choice of indicator can change the results.", "paper_title": "Does the higher citation of collaborative research differ from region to region? A case study of Economics", "paper_id": "WOS:000280947400013"}