{"auto_keywords": [{"score": 0.04490388164168672, "phrase": "online_information"}, {"score": 0.00481495049065317, "phrase": "purpose_-_information"}, {"score": 0.0047468516620285525, "phrase": "serendipitous_acquisition"}, {"score": 0.004373480870285314, "phrase": "explicit_process"}, {"score": 0.004326987090971404, "phrase": "implicit_factors"}, {"score": 0.004101797841848363, "phrase": "critical_incident_technique"}, {"score": 0.004029359223675788, "phrase": "qualitative_data"}, {"score": 0.0038060092376105414, "phrase": "key_phases"}, {"score": 0.003765525342866404, "phrase": "encountering_process"}, {"score": 0.0032418062548293745, "phrase": "social_interaction"}, {"score": 0.003128216758835217, "phrase": "encountering_occurrence"}, {"score": 0.002965229277927781, "phrase": "interesting_or_useful_content"}, {"score": 0.002664221051021009, "phrase": "user-related_factors"}, {"score": 0.0025343769150179764, "phrase": "activity_diversity"}, {"score": 0.002516350372379076, "phrase": "information-related_factors"}, {"score": 0.002309754152767196, "phrase": "changeable_nature"}, {"score": 0.0022851491693940272, "phrase": "influencing_factors"}, {"score": 0.002212892265364764, "phrase": "purposive_design"}, {"score": 0.0021893168527276105, "phrase": "support_features"}, {"score": 0.002127667143545464, "phrase": "macro-_process"}, {"score": 0.0021049977753042253, "phrase": "natural_occurring_mechanisms"}], "paper_keywords": ["Serendipity", " Information encountering", " Model", " Process", " Factors"], "paper_abstract": "Purpose - Information encountering is the serendipitous acquisition of information that requires low or no involvement and expectation of users. The purpose of this paper is to model the explicit process and the implicit factors of online information encountering, i.e. how and why it occurs. Design/methodology/approach - The critical incident technique was adopted to collect qualitative data from 16 interview participants. They contributed 27 true incidents of online information encountering which were used to identify the key phases of the encountering process. They also commented on the factors that they thought had an influence on the chance of the occurrence of encountering. Findings - The macro-process of information encountering is composed of three phases. First, browsing, searching, or social interaction provides the context for encountering; second, the encountering occurrence consists of three steps - noticing the stimuli, examining the content, and acquiring interesting or useful content; and third, the information encountered will be explored further, saved, used, or shared. The 14 influencing factors of information encountering obtained divide into three clusters. User-related factors include sensitivity, emotions, expertise, attitudes, intentionality, curiosity, activity diversity; information-related factors include type, relevance, quality, visibility, and sources; and environment-related factors include time limits and interface usability. Originality/value - This study engenders useful implications for designing information encountering experience. The changeable nature of some influencing factors suggests that encountering can be elicited through the purposive design of encountering support features or even encountering systems, and the macro- process depicts the natural occurring mechanisms of encountering for the design to follow.", "paper_title": "Online information encountering: modeling the process and influencing factors", "paper_id": "WOS:000369171600002"}