{"auto_keywords": [{"score": 0.033502945522523205, "phrase": "normal_cones"}, {"score": 0.00481495049065317, "phrase": "dual_hyperplanes_representations"}, {"score": 0.0047155367844327, "phrase": "robust_solutions"}, {"score": 0.004637478829869904, "phrase": "nonlinear_multivariate_constraints"}, {"score": 0.004503959683578956, "phrase": "subdivision-based_multivariate_constraint_solvers"}, {"score": 0.004160531596936783, "phrase": "feasible_solution"}, {"score": 0.004007083686875716, "phrase": "numerical_improvement_method"}, {"score": 0.0038112201846057445, "phrase": "termination_criteria"}, {"score": 0.003376369479008885, "phrase": "first_theoretical_criterion"}, {"score": 0.0028091907694771613, "phrase": "dual_representation"}, {"score": 0.0027510752634224726, "phrase": "parallel_hyperplanes"}, {"score": 0.0027167830773160203, "phrase": "unit_hypersphere"}, {"score": 0.0024883835349005863, "phrase": "second_termination_criterion"}, {"score": 0.0024065032567542107, "phrase": "parallel_hyperplane_pairs"}, {"score": 0.00223196703759329, "phrase": "multivariate_solver"}, {"score": 0.0022041312401435346, "phrase": "irit_solid_modelling_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["subdivision solvers", " termination criteria", " non-linear equations"], "paper_abstract": "The need for robust solutions for sets of nonlinear multivariate constraints or equations needs no motivation. Subdivision-based multivariate constraint solvers typically employ the convex hull and subdivision/domain clipping properties of the Bezier/B-spline representation to detect all regions that may contain a feasible solution. Once such a region has been identified, a numerical improvement method is usually applied, which quickly converges to the root. Termination criteria for this subdivision/domain clipping approach are necessary so that, for example, no two roots reside in the same sub-domain (root isolation). This work presents two such termination criteria. The first theoretical criterion identifies subdomains with at most a single solution. This criterion is based on the analysis of the normal cones of the multiviarates and has been known for some time. Yet, a computationally tractable algorithm to examine this criterion has never been proposed. In this paper, we present a dual representation of the normal cones as parallel hyperplanes over the unit hypersphere, which enables us to construct an algorithm for identifying subdomains with at most a single solution. Further, we also offer a second termination criterion, based on the representation of bounding parallel hyperplane pairs, to identify and reject subdomains that contain no solution. We implemented both algorithms in the multivariate solver of the IRIT solid modelling system and present examples using our implementation. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Subdivision termination criteria in subdivision multivariate solvers using dual hyperplanes representations", "paper_id": "WOS:000247222600005"}