{"auto_keywords": [{"score": 0.043726272486193644, "phrase": "component_assembly"}, {"score": 0.03325558852335445, "phrase": "dynamic_metrics"}, {"score": 0.00481495049065317, "phrase": "software_components"}, {"score": 0.0045122922461952805, "phrase": "static_and_dynamic_aspects"}, {"score": 0.0040097139701644165, "phrase": "component_packing_density"}, {"score": 0.0039626308903511764, "phrase": "component_interaction_density_metrics"}, {"score": 0.0034388111429203222, "phrase": "triangular_metric"}, {"score": 0.0030017207229983385, "phrase": "complete_application"}, {"score": 0.0025892330566358503, "phrase": "weyuker's_set"}, {"score": 0.002246553137021003, "phrase": "mccall's_quality_model"}, {"score": 0.002181069180139225, "phrase": "product_quality"}, {"score": 0.0021049977753042253, "phrase": "component-based_product_development"}], "paper_keywords": ["Component-Based Software Engineering", " software component metrics", " component assembly", " CORBA component model"], "paper_abstract": "This paper defines two suites of metrics, which address static and dynamic aspects of component assembly. The static metrics measure complexity and criticality of component assembly, wherein complexity is measured using Component Packing Density and Component Interaction Density metrics. Further, four criticality conditions namely, Link, Bridge, Inheritance and Size criticalities have been identified and quantified. The complexity and criticality metrics are combined to form a Triangular Metric, which can be used to classify the type and nature of applications. Dynamic metrics are collected during the runtime of a complete application. Dynamic metrics are useful to identify super-component and to evaluate the degree of utilization of various components. In this paper both static and dynamic metrics are evaluated using Weyuker's set of properties. The result shows that the metrics provide a valid means to measure issues in component assembly. We relate our metrics suite with McCall's Quality Model and illustrate their impact on product quality and to the management of component-based product development. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Some theoretical considerations for a suite of metrics for the integration of software components", "paper_id": "WOS:000242985400013"}