{"auto_keywords": [{"score": 0.0467633416687467, "phrase": "social_network_sites"}, {"score": 0.00481495049065317, "phrase": "tie_strength"}, {"score": 0.0047013405841819025, "phrase": "social_network_site"}, {"score": 0.004525088883501587, "phrase": "hurtful_behavior"}, {"score": 0.004313996835376177, "phrase": "young_people's_connections"}, {"score": 0.003920780681351006, "phrase": "eighth-grade_students"}, {"score": 0.003462648009666777, "phrase": "facebook"}, {"score": 0.003222814590544802, "phrase": "one's_network"}, {"score": 0.0031921317979928406, "phrase": "online_connections"}, {"score": 0.003087017178815267, "phrase": "fellow_students"}, {"score": 0.002791932344920906, "phrase": "disproportionally_high_number"}, {"score": 0.002524982927936405, "phrase": "social_status"}, {"score": 0.002327648608736437, "phrase": "online_victimization"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["social network site", " online harassment", " online bullying", " status imbalance", " friendship", " adolescents"], "paper_abstract": "The subject of this research is hurtful behavior on social network sites. Specifically, the study examines how young people's connections on such sites are related to their risk of being involved in cyberharassment and cyberbullying. For this purpose, eighth-grade students from 11 secondary schools were surveyed (n = 1,458). The students indicated who their friends were at school and with whom they were connected on Facebook. The results demonstrate that victimization and perpetration are linked to the composition of one's network of online connections. The presence of many connections with fellow students who are not friends elevates the risk of cyberharassment and cyberbullying. In addition, perpetrators and victims have a disproportionally high number of connections based on unbalanced, weak friendships. This lack of balance may indicate that perpetrators are higher in the hierarchy of social status and that victims are lower. The findings imply that adolescents may be able to avert online victimization by carefully selecting their online ties. Further implications for the prevention of harassment and bullying on social network sites as well as avenues for future research are discussed.", "paper_title": "The Strong, the Weak, and the Unbalanced: The Link Between Tie Strength and Cyberaggression on a Social Network Site", "paper_id": "WOS:000354306600004"}