{"auto_keywords": [{"score": 0.04400365477045312, "phrase": "riemann_zeta_function"}, {"score": 0.022222929246617996, "phrase": "entire_functions"}, {"score": 0.014327398662532274, "phrase": "imaginary_axis"}, {"score": 0.01020142137192291, "phrase": "new_class"}, {"score": 0.00935192919420057, "phrase": "partial_sum"}, {"score": 0.00475162193118036, "phrase": "real_part"}, {"score": 0.004330941610682453, "phrase": "ritt's_formula"}, {"score": 0.0038953958723049287, "phrase": "large_class"}, {"score": 0.0036456298076415652, "phrase": "class_a"}, {"score": 0.0036167744339027997, "phrase": "levin"}, {"score": 0.0033668870709083884, "phrase": "alternating_dirichlet_series_expansion"}, {"score": 0.0027015344365793016, "phrase": "left_half-plane"}, {"score": 0.0026518169452004465, "phrase": "right_half-plane"}, {"score": 0.0025961134295137958, "phrase": "relevant_fact"}, {"score": 0.002190519728921395, "phrase": "original_class"}, {"score": 0.0021559025985688255, "phrase": "new_point"}, {"score": 0.0021049977753042253, "phrase": "alternating_dirichlet_truncations"}], "paper_keywords": ["Number theory", " Complex variable", " Partial sums of the Riemann zeta function", " FInite truncations of the alternating Dirichlet series", " Expansion of the Riemann zeta function", " Function evaluation"], "paper_abstract": "Purpose - This paper aims to introduce a new class of entire functions whose zeros (z(k))(k >= 1) satisfy Sigma(infinity)(k=1)Im z(k) = O(1). Design/methodology/approach - This is done by means of a Ritt's formula which is used to prove that every partial sum of the Riemann Zeta function, zeta(n)(z) := Sigma(n)(k=1)1/k(z), n >= 2, has zeros (s(nk))(k >= 1) verifying Sigma(infinity)(k=1) Res(nk) = O(1)and extending this property to a large class of entire functions denoted by A(O). Findings - It is found that this new class A(O) has a part in common with the class A introduced by Levin but is distinct from it. It is shown that, in particular, A(O) contains every partial sum of the Riemann Zeta function zeta(n)(iz) and every finite truncation of the alternating Dirichlet series expansion of the Riemann zeta function, T-n(iz) := Sigma(n)(k=1) (-1)(k-1)/k(iz), for all n >= 2. Practical implications - With the exception of the n = 2 case, numerical experiences show that all zeros of zeta(n)(z) and T-n(z) are not symmetrically distributed around the imaginary axis. However, the fact consisting of every function zeta(n)(iz) and T-n(iz) to be in the class A(O) implies the existence of a very precise physical equilibrium between the zeros situated on the left half-plane and the zeros situated on the right half-plane of each function. This is a relevant fact and it points out that there is certain internal rule that distributes the zeros of zeta(n)(z) and T-n(z) in such a way that few zeros on the left of the imaginary axis and far away from it, must be compensated with a lot of zeros on the right of the imaginary axis and close to it, and vice versa. Originality/value - The paper presents an original class of entire functions that provides a new point of view to study the approximants and the alternating Dirichlet truncations of the Riemann zeta function.", "paper_title": "A class of functions whose sum of zeros has bounded real part", "paper_id": "WOS:000304024000009"}