{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mobile_sensor_networks"}, {"score": 0.0041184843463633386, "phrase": "required_qoi"}, {"score": 0.004034649282040889, "phrase": "large_scale"}, {"score": 0.003920128102807887, "phrase": "heterogeneous_mobile"}, {"score": 0.0037312893857519803, "phrase": "comprehensive_study"}, {"score": 0.003700709435644458, "phrase": "major_qoi_metrics"}, {"score": 0.0035079364710988627, "phrase": "mobile_sensors"}, {"score": 0.003479180627368156, "phrase": "mobile_sinks"}, {"score": 0.0034364867143322304, "phrase": "mobile_mules"}, {"score": 0.0031260524791486347, "phrase": "increased_coverage"}, {"score": 0.0030497740719977835, "phrase": "case_study"}, {"score": 0.002762774046280398, "phrase": "target_area"}, {"score": 0.0025865679621853667, "phrase": "relevant_sensors"}, {"score": 0.002544296663333569, "phrase": "location-based_routing"}, {"score": 0.0023624435546097658, "phrase": "simulation_results"}, {"score": 0.0022670785913397637, "phrase": "low_communication_overhead"}, {"score": 0.0021488235554917128, "phrase": "data_loss"}], "paper_keywords": ["Quality of information", " Data collection", " Wireless sensor networks", " Mobility"], "paper_abstract": "Quality of information (QoI) in sensor networks measures information attributes such as precision, timeliness, completeness, and relevance of data ultimately delivered to users. It is a challenge to provide the required QoI in mobile sensor networks given the large scale and complexity of the networks with heterogeneous mobile and sensing devices. In this paper, we provide a comprehensive study on major QoI metrics for mobile sensor networks and discuss how QoI-aware data collection can be achieved. The cases with mobile sensors, mobile sinks, and mobile mules carrying data and their impact on QoI are discussed in detail. Mobility creates challenges in terms of timeliness but also opportunities in increased coverage and relevance. In a case study, we design a QoI-aware publish/subscribe system for mobile sensor networks. Users can subscribe to obtain information about events of interest by specifying the target area, sensing context, etc. The subscriptions and the sensing data are delivered to relevant sensors and users by location-based routing. We also discuss techniques that can be applied to further enhance the QoI in our publish/subscribe system. Simulation results demonstrate that the users can receive their subscribed data successfully with low communication overhead. Our publish/subscribe system can also handle mobility of clients smoothly without causing any data loss. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "Quality-of-information-aware data collection for mobile sensor networks", "paper_id": "WOS:000333813800014"}