{"auto_keywords": [{"score": 0.047408354056395596, "phrase": "sn_p_systems"}, {"score": 0.005761046435077888, "phrase": "computational_power"}, {"score": 0.00481495049065317, "phrase": "neural_p_systems"}, {"score": 0.004577440795549049, "phrase": "new_variant"}, {"score": 0.004293267161763508, "phrase": "recent_studies"}, {"score": 0.00419625566682241, "phrase": "synapse_having_weight"}, {"score": 0.0034243271052114234, "phrase": "sequential_way"}, {"score": 0.002971453391894977, "phrase": "finite_sets"}, {"score": 0.00266693888510356, "phrase": "n_spikes"}, {"score": 0.0026045914281028473, "phrase": "weight_k"}, {"score": 0.002509541181962613, "phrase": "totally_nk_spikes"}, {"score": 0.0024343522820859578, "phrase": "computing_functions"}, {"score": 0.0023375847850353355, "phrase": "extended_rules"}, {"score": 0.002259883463607508, "phrase": "universal_system"}, {"score": 0.002222004614440872, "phrase": "standard_rules"}, {"score": 0.0021049977753042253, "phrase": "important_feature"}], "paper_keywords": ["Membrane computing", " spiking neural P system", " rule on synapse"], "paper_abstract": "Spiking neural P systems (SN P systems, for short) with rules on synapses are a new variant of SN P systems, where the spiking and forgetting rules are placed on synapses instead of in neurons. Recent studies illustrated that this variant of SN P systems is universal working in the way that the synapses starting from the same neuron work in parallel (i.e., all synapses starting from the same neuron should apply their rules if they have rules to be applied). In this work, we consider SN P systems with rules on synapses working in another way: the synapses starting from the same neuron are restricted to work in a sequential way (i.e., at each step at most one synapse starting from the same neuron applies its rule). It is proved that the computational power of SN P systems with rules on synapses working in this way is reduced; specifically, they can only generate finite sets of numbers. Such SN P systems with rules on synapses are proved to be universal, if synapses are allowed to have weight at most 2 (if a rule which can generate n spikes is applied on a synapse with weight k, then the neuron linking to this synapse will receive totally nk spikes). Two small universal SN P systems with rules on synapses for computing functions are also constructed: a universal system with 26 neurons when using extended rules and each synapse having weight at most 2, and a universal system with 26 neurons when using standard rules and each synapse having weight at most 12. These results illustrate that the weight is an important feature for the computational power of SN P systems.", "paper_title": "Weighted Spiking Neural P Systems with Rules on Synapses", "paper_id": "WOS:000345457100014"}