{"auto_keywords": [{"score": 0.034887398305923065, "phrase": "visual_interfaces"}, {"score": 0.00481495049065317, "phrase": "taxonomy_visualisation_user_interfaces"}, {"score": 0.004629912133717504, "phrase": "user_interfaces"}, {"score": 0.004481132747216135, "phrase": "usability_perspective"}, {"score": 0.0044374341132573936, "phrase": "final_aim"}, {"score": 0.00433711346313652, "phrase": "scientific_basis"}, {"score": 0.004023120753104693, "phrase": "large_digital_collections"}, {"score": 0.0039579160185689325, "phrase": "hci_study"}, {"score": 0.0035999631751991385, "phrase": "second_one"}, {"score": 0.003541592380113389, "phrase": "ad_hoc"}, {"score": 0.003231722251475338, "phrase": "resource_discovery"}, {"score": 0.0031585736196310726, "phrase": "overall_good_general_user_opinion"}, {"score": 0.0030569295881497176, "phrase": "thorough_study"}, {"score": 0.0029975152932436144, "phrase": "target_users"}, {"score": 0.0028633212043378564, "phrase": "ideal_type"}, {"score": 0.002762099499401202, "phrase": "user_acceptance"}, {"score": 0.002735118294625477, "phrase": "unnecessary_implementation_costs"}, {"score": 0.0026384167183586015, "phrase": "relatively_small_sample_size"}, {"score": 0.0026042261024286657, "phrase": "spain"}, {"score": 0.002587115505155995, "phrase": "latin_america"}, {"score": 0.0025120232221781825, "phrase": "general_population"}, {"score": 0.0024874787612079252, "phrase": "similar_studies"}, {"score": 0.00247935055073462, "phrase": "previous_knowledge"}, {"score": 0.002247446386787241, "phrase": "previous_usability_studies"}, {"score": 0.0021821915946356168, "phrase": "digital_learning"}, {"score": 0.002167949230651206, "phrase": "cultural_repositories"}, {"score": 0.0021467594103960585, "phrase": "authors'_experience"}, {"score": 0.0021049977753042253, "phrase": "usability_aspects"}], "paper_keywords": ["User interfaces", " Perception", " Repositories", " Data visualization", " Visual taxonomy search", " Visualization techniques"], "paper_abstract": "Purpose - This paper aims to analyse user interfaces for search and collection visualisation and navigation from a usability perspective. The final aim is to offer repository owners a scientific basis to support their decisions when they have to choose an interface that can really help users to effectively locate and visualise resources over large digital collections. Design/methodology/approach - This HCI study is divided into two parts: perception and usability. The first one analysed three perceptual abilities required to use interfaces: attention, retention of information and understanding. The second one was run on an ad hoc generated collection including more than 40,000 European digital resources collected and classified according to a given branch of knowledge in the Art & Architecture Thesaurus. Findings - Although visual interfaces proved useful for certain tasks related to resource discovery and search, and despite the overall good general user opinion, the authors found it necessary to conduct another thorough study to know more about the target users and the amplitude of the collection, as well as to determine the ideal type of interface to implement. All these factors are important for increasing user acceptance and avoiding unnecessary implementation costs. Research limitations/implications - This research was run on a relatively small sample size of users from Spain and Latin America, which may not be representative of the general population. In similar studies previous knowledge about usability has been reported to introduce bias in the results, so the authors tried to avoid this when selecting the participants. Originality/value - There are no previous usability studies for the development and implementation of interfaces in digital learning or cultural repositories. The authors' experience highlights the importance of addressing usability aspects a priori, to prevent users from ceasing to use visual interfaces over time, because they do not perceive any benefit from using them.", "paper_title": "A usability study of taxonomy visualisation user interfaces in digital repositories", "paper_id": "WOS:000333794700007"}