{"auto_keywords": [{"score": 0.009809910700799668, "phrase": "cood"}, {"score": 0.004283280680222718, "phrase": "internet_service_providers"}, {"score": 0.004039792863335641, "phrase": "recent_works"}, {"score": 0.0034139056533151, "phrase": "fundamental_problem"}, {"score": 0.003036468052876648, "phrase": "isp-friendly_inter-overlay_coordination_framework"}, {"score": 0.0028220038404484196, "phrase": "cood_framework"}, {"score": 0.0025469059073128415, "phrase": "isp"}, {"score": 0.002248553559414903, "phrase": "better_overall_performance"}, {"score": 0.0021676351850669017, "phrase": "service_differentiation"}, {"score": 0.0021049977753042253, "phrase": "flexible_mechanisms"}], "paper_keywords": ["Cross-ISP P2P traffic control", " Multi-P2P traffic optimization", " Multi-P2P service differentiation"], "paper_abstract": "As Peer-to-Peer (P2P) systems are widely deployed in the Internet, P2P traffic control becomes a challenge for Internet Service Providers (ISPs) and P2P system vendors. Some recent works consider the interaction between ISPs and P2P systems, and propose ISP-friendly P2P traffic control mechanisms for reducing cross-ISP P2P traffic. In this paper, we consider another fundamental problem: the performance optimization and the interaction among multiple coexisting P2P systems. Specifically, we propose an ISP-friendly inter-overlay coordination framework (COOD) for controlling P2P traffic. The COOD framework consists of three important components: network traffic optimization, P2P service differentiation, and ISP policy enforcement. Our packet-level simulation results show that, compared with current P2P traffic control mechanisms, the COOD framework can provide better overall performance to multiple coexisting P2P systems, achieve service differentiation, and implement flexible mechanisms to effectively control cross-ISP P2P traffic.", "paper_title": "An ISP-friendly inter-overlay coordination framework for multiple coexisting P2P systems", "paper_id": "WOS:000339877700007"}