{"auto_keywords": [{"score": 0.004770461993586338, "phrase": "scaled_stt-ram._spin-torque_transfer"}, {"score": 0.0044495843279816075, "phrase": "leakage_power_consumption"}, {"score": 0.00415019999222481, "phrase": "physical_effects"}, {"score": 0.003817306032290766, "phrase": "previously_unreported_and_alarming_trends"}, {"score": 0.003593555152077465, "phrase": "error_rates"}, {"score": 0.003446353878654566, "phrase": "scaling_trends"}, {"score": 0.0034144678683346173, "phrase": "stt-ram"}, {"score": 0.003125835572347772, "phrase": "peripheral_circuit_delay_ratio"}, {"score": 0.003054009753601139, "phrase": "uncorrectable_read_error_rates"}, {"score": 0.0028615323526689582, "phrase": "delay_ratio_levels"}, {"score": 0.0026317312518257803, "phrase": "case_study"}, {"score": 0.0025952620596908773, "phrase": "multilevel_stt-ram_cache"}, {"score": 0.002523828967909659, "phrase": "reconfigurable_cache_cell"}, {"score": 0.0024772998651215964, "phrase": "extreme_access_mode"}, {"score": 0.0021246816854197732, "phrase": "energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "sram_caches"}], "paper_keywords": ["Memory architecture", " nonvolatile memory", " STT-RAM"], "paper_abstract": "Spin-torque transfer RAM (STT-RAM), a promising alternative to static RAM (SRAM) for reducing leakage power consumption, has been widely studied to mitigate the impact of its asymmetrically long write latency. However, physical effects of technology scaling down to 45 nm and below, in particular, process variation, introduce the previously unreported and alarming trends in read performance and reliability due to reduced sensing margins and increasing error rates. In this brief, we study the scaling trends of STT-RAM from 65 down to 22 nm as they pertain to read performance, including a 50% increase in sensing versus peripheral circuit delay ratio and a more than 80% increase in uncorrectable read error rates. Through differential sensing, we show how 22 nm can return to sense delay ratio levels at 65 nm and uncorrectable read errors can be reduced by an order of magnitude. Through a case study of a multilevel STT-RAM cache, we show how a reconfigurable cache cell can create an extreme access mode (X-mode) based on differential sensing improve to outperform the state-of-the-art STT-RAM caching techniques in both raw performance and performance per watt by more than 10% while still reducing energy consumption over SRAM caches by more than 1/3.", "paper_title": "Read Performance: The Newest Barrier in Scaled STT-RAM", "paper_id": "WOS:000355218000019"}