{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_real-time"}, {"score": 0.004632388761885302, "phrase": "end-to-end_application_deadlines"}, {"score": 0.004287680323820891, "phrase": "varied_workloads"}, {"score": 0.004185289462328125, "phrase": "distributed_computing"}, {"score": 0.004007083686875716, "phrase": "end-to-end_real-time_performance"}, {"score": 0.003744780941673966, "phrase": "previous_work"}, {"score": 0.0029686990110243555, "phrase": "firs"}, {"score": 0.002897710777957041, "phrase": "layering_network_design_principle"}, {"score": 0.0028421434495262796, "phrase": "upper_level"}, {"score": 0.002814759530655965, "phrase": "hrs's_traffic-aware_routing_module"}, {"score": 0.0026175952455594277, "phrase": "lower_level"}, {"score": 0.002592369213499121, "phrase": "hrs's_weighted_deadline_scheduling_module"}, {"score": 0.0023530698447434308, "phrase": "lower_deadline"}, {"score": 0.0022202042044679984, "phrase": "extensive_evaluations"}, {"score": 0.0021049977753042253, "phrase": "proposed_methods"}], "paper_keywords": ["Real Time", " Routing", " Scheduling", " Distributed"], "paper_abstract": "How to guarantee end-to-end application deadlines is an important research challenge for distributed real-time and embedded systems. Further challenges arise due to varied workloads and the nature of distributed computing. Routing and scheduling are two important design aspects affecting the end-to-end real-time performance of distributed real-time and embedded systems. While most of the previous work has focused on either routing or scheduling, the study of the integration of routing and scheduling has not been well investigated for distributed real-time and embedded systems. In this paper, we propose HRS: a novel two-level hierarchical routing and scheduling scheme. FIRS is based on the layering network design principle: at the upper level, HRS's traffic-aware routing module determines which route to take through the network for each flow; at the lower level, HRS's weighted deadline scheduling module determines which packet to serve at each time instant for each node. Together this two-level hierarchical design supports lower deadline miss ratios for distributed real-time and embedded systems. We also conduct extensive evaluations on OMNeT++ to demonstrate the efficiency and efficacy of the proposed methods in this paper.", "paper_title": "HRS: A Hierarchical Routing and Scheduling Scheme for Distributed Real-Time and Embedded Systems", "paper_id": "WOS:000287433400005"}