{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "real-time_systems"}, {"score": 0.04178009466428808, "phrase": "pre-run-time_scheduling"}, {"score": 0.004710306419574744, "phrase": "artificial_intelligence"}, {"score": 0.004429191773525288, "phrase": "pre-run-time_scheduling_problem"}, {"score": 0.00427612041204006, "phrase": "real-time_tasks"}, {"score": 0.003698442219929622, "phrase": "latter_problem"}, {"score": 0.003586278948128509, "phrase": "existing_techniques"}, {"score": 0.00355485940716082, "phrase": "possible_research_perspectives"}, {"score": 0.003255364511414329, "phrase": "constraint_satisfaction_problems_class"}, {"score": 0.002994178996584381, "phrase": "intelligent_algorithms"}, {"score": 0.0026468817060759067, "phrase": "lrta"}, {"score": 0.002600661525224505, "phrase": "constraints_satisfaction_problems"}, {"score": 0.0025778546800417808, "phrase": "particularly_the_pre-run-time_scheduling"}, {"score": 0.0024451427672857458, "phrase": "large-scale_real-time_systems"}, {"score": 0.0022787359717772976, "phrase": "artificial_intelligence_literature"}, {"score": 0.0022095328812245852, "phrase": "artificial_intelligence_community"}, {"score": 0.0021613897794439227, "phrase": "real-time_systems_community"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Real-time systems", " Pre-run-time scheduling", " Artificial Intelligence", " Problem solving"], "paper_abstract": "This paper presents the taxonomy of real-time systems with special emphasize on pre-run-time scheduling problem. Firstly, we present real-time systems, real-time tasks, timing, precedence and exclusion constraints. Then, we describe the problem of pre-run-time scheduling of tasks under constraints. After that, we present the most existing efficient techniques to deal with the latter problem. We summarize the discussion of existing techniques and possible research perspectives after surveying the Artificial Intelligence's point of view about the problem of pre-run-time scheduling of real-time tasks. The Artificial Intelligence survey includes Constraint Satisfaction Problems class since pre-run-time scheduling belongs to the latter class. The Artificial Intelligence survey includes also Path-finding Problems from which intelligent algorithms could be observed such as Learning-Real-Time-A*LRTA*) thanks to its important properties (optimality, linear space complexity and determinism). The development of an algorithm like LRTA* to solve Constraints Satisfaction Problems and particularly the pre-run-time scheduling of real-time tasks problem is one clear research direction to deal with large-scale real-time systems. The overall objective of this paper is to show what are the perspectives to Artificial Intelligence literature that could be beneficial firstly to Artificial Intelligence community itself and secondly to real-time systems community. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Pre-run-time scheduling in real-time systems: Current researches and Artificial Intelligence perspectives", "paper_id": "WOS:000330600800009"}