{"auto_keywords": [{"score": 0.04788992596085788, "phrase": "decision_diagrams"}, {"score": 0.015164139669368139, "phrase": "multi-state_systems"}, {"score": 0.00481495049065317, "phrase": "decision_diagram"}, {"score": 0.004547438494330851, "phrase": "graphical_structures"}, {"score": 0.004477083974172596, "phrase": "shannon's_decomposition"}, {"score": 0.00422826362023938, "phrase": "logic_functions"}, {"score": 0.004119762981892093, "phrase": "circuit_verification"}, {"score": 0.0040771431404398855, "phrase": "compact_markov_chain_representation"}, {"score": 0.004014035333627087, "phrase": "symbolic_model_checking"}, {"score": 0.0035245918797629804, "phrase": "binary-state_systems"}, {"score": 0.0029072537537959374, "phrase": "perfect_operation"}, {"score": 0.0026610047049752737, "phrase": "mss"}, {"score": 0.0022524959504997303, "phrase": "comprehensive_complexity_analysis"}], "paper_keywords": ["Binary decision diagram", " complexity analysis", " logarithmically-encoded binary decision diagram", " multi-state system", " multi-valued decision diagram"], "paper_abstract": "Decision diagrams are graphical structures based on Shannon's decomposition. They have been extensively used for representing and manipulating logic functions in areas such as circuit verification, compact Markov chain representation, and symbolic model checking. However, their applicability in reliability modeling and analysis has only been recently studied. Moreover, the study had been mostly restricted to binary-state systems in which both the system and its components are either operational, or failed. Nevertheless, many practical systems are multi-state systems (MSS) in which both the system and its components may reside at multiple (more than two) performance levels (or states), varying from perfect operation to complete failure. This paper presents three forms of decision diagrams for the modeling and analysis of MSS: binary decision diagrams, logarithmically encoded binary decision diagrams, and multi-valued decision diagrams. We present both separated, and shared methods based on these decision diagrams. Comprehensive complexity analysis, and performance comparisons among these methods, are conducted with both mathematical, and empirical approaches.", "paper_title": "Decision Diagram Based Methods and Complexity Analysis for Multi-State Systems", "paper_id": "WOS:000278618100016"}