{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncapacitated_r-allocation_p-hub_median_problem"}, {"score": 0.004571630734130793, "phrase": "classical_p-hub_location_problem"}, {"score": 0.0044469055125323466, "phrase": "pairwise_traffic_demands"}, {"score": 0.0043106348117582915, "phrase": "hub_locations"}, {"score": 0.004178522455099832, "phrase": "minimum_cost"}, {"score": 0.00387231142512656, "phrase": "yaman"}, {"score": 0.003663749926218976, "phrase": "selected_hubs"}, {"score": 0.0030814613175385672, "phrase": "grasp_methodology"}, {"score": 0.002997269132281551, "phrase": "combinatorial_nature"}, {"score": 0.0028554143163813947, "phrase": "filtering_mechanism"}, {"score": 0.002825898877873034, "phrase": "low-quality_constructions"}, {"score": 0.002655087144676306, "phrase": "key-search_parameters"}, {"score": 0.0025735828740162223, "phrase": "previous_algorithms"}, {"score": 0.0025558124513934584, "phrase": "computational_results"}, {"score": 0.002451730979693715, "phrase": "exact_methods"}, {"score": 0.0023847032316716503, "phrase": "high-quality_solutions"}, {"score": 0.0023437424558633013, "phrase": "short_computing_times"}, {"score": 0.0022875739347765914, "phrase": "classical_p-hub_versions"}, {"score": 0.002149231173009159, "phrase": "art_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["p-hub", " Heuristics", " GRASP", " Combinatorial optimization"], "paper_abstract": "In this paper we propose a heuristic for the Uncapacitated r-Allocation p-Hub Median Problem. In the classical p-hub location problem, given a set of nodes with pairwise traffic demands, we must select p of them as hub locations and route all traffics through them at a minimum cost. We target here an extension, called the r-allocation p-hub median problem, recently proposed by Yaman [19], in which every node is assigned to r of the p selected hubs (r <= p) and we are restricted to route the traffic of the nodes through their associated r hubs. As it is usual in this type of problems, our method has three phases: location, assignment and routing. Specifically, we propose a heuristic based on the GRASP methodology in which we consider three local search procedures. The combinatorial nature of this problem makes them time-consuming. We therefore propose a filtering mechanism to discard low-quality constructions and skip its improvement, saving its associated running time. We perform several experiments to first determine the values of the key-search parameters of our method and then to compare with previous algorithms. Computational results on 465 instances show that while only small instances can be optimally solved with exact methods, the heuristic is able to find high-quality solutions on larger instances in short computing times. Moreover, when targeting the classical p-hub versions (with r= 1 or r =p), our heuristic is competitive with the state of the art methods. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "GRASP for the uncapacitated r-allocation p-hub median problem", "paper_id": "WOS:000329383300005"}