{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sram_row_cache"}, {"score": 0.0046741260449047976, "phrase": "scaling_dram_cells"}, {"score": 0.0045599093158915326, "phrase": "energy-efficient_dram_chips"}, {"score": 0.004404658750724105, "phrase": "dram_industry"}, {"score": 0.00427578268550103, "phrase": "alternative_approach"}, {"score": 0.00419195822011581, "phrase": "looming_issues"}, {"score": 0.003778004256546193, "phrase": "emerging_integration_technology"}, {"score": 0.003421697038352743, "phrase": "new_memory_hierarchy"}, {"score": 0.0033879628186273625, "phrase": "future_system_design"}, {"score": 0.003114283314285167, "phrase": "energy_efficiency"}, {"score": 0.0028484940955893134, "phrase": "dram_chip"}, {"score": 0.0026973310437053573, "phrase": "traditional_sram_row_cache_design_issues"}, {"score": 0.002516457934208144, "phrase": "novel_floorplan"}, {"score": 0.002234092591045251, "phrase": "small_row_cache"}, {"score": 0.0021049977753042253, "phrase": "dynamic_energy"}], "paper_keywords": ["3-D stacking", " Cache", " dynamic random access memory (DRAM)", " main memory", " through-silicon-via (TSV)"], "paper_abstract": "As scaling DRAM cells becomes more challenging and energy-efficient DRAM chips are in high demand, the DRAM industry has started to undertake an alternative approach to address these looming issues-that is, to vertically stack DRAM dies with through-silicon-vias (TSVs) using 3-D-IC technology. Furthermore, this emerging integration technology also makes heterogeneous die stacking in one DRAM package possible. Such a heterogeneous DRAM chip provides a unique, promising opportunity for computer architects to contemplate a new memory hierarchy for future system design. In this paper, we study how to design such a heterogeneous DRAM chip for improving both performance and energy efficiency. In particular, we found that, if we want to design an SRAM row cache in a DRAM chip, simple stacking alone cannot address the majority of traditional SRAM row cache design issues. In this paper, to address these issues, we propose a novel floorplan and several architectural techniques that fully exploit the benefits of 3-D stacking technology. Our multi-core simulation results with memory-intensive applications suggest that, by tightly integrating a small row cache with its corresponding DRAM array, we can improve performance by 30% while saving dynamic energy by 31%.", "paper_title": "Pragmatic Integration of an SRAM Row Cache in Heterogeneous 3-D DRAM Architecture Using TSV", "paper_id": "WOS:000312835000001"}