{"auto_keywords": [{"score": 0.03695844504614638, "phrase": "background_knowledge"}, {"score": 0.015719716506582538, "phrase": "identity_web_references"}, {"score": 0.01531071318933702, "phrase": "web_users"}, {"score": 0.014092301643301393, "phrase": "web_resources"}, {"score": 0.011845318935280725, "phrase": "automated_approaches"}, {"score": 0.008488238142650383, "phrase": "random_walks"}, {"score": 0.004394424341776717, "phrase": "lateral_surveillance"}, {"score": 0.004361077072629878, "phrase": "identity_theft_increases"}, {"score": 0.004262539473250432, "phrase": "personal_information"}, {"score": 0.004010477922833839, "phrase": "unary_set"}, {"score": 0.0033019779616246356, "phrase": "detailed_approach"}, {"score": 0.0032519989404960073, "phrase": "web_presence"}, {"score": 0.003118410827789671, "phrase": "automated_disambiguation_processes"}, {"score": 0.00293380698353469, "phrase": "rdf_data_models"}, {"score": 0.0028347983387988847, "phrase": "seed_data"}, {"score": 0.0027286918886186245, "phrase": "semi-supervised_machine_learning_technique"}, {"score": 0.002616544154458438, "phrase": "graph-based_technique"}, {"score": 0.0024804352736263005, "phrase": "intrinsic_functionalities"}, {"score": 0.002351389889948836, "phrase": "human_processing"}, {"score": 0.0022806798371116698, "phrase": "average_precision_level"}, {"score": 0.002220551141101661, "phrase": "average_f-measure_level"}], "paper_keywords": ["Semantic Web", " Web 2.0", " Identity disambiguation", " Machine learning", " Graphs"], "paper_abstract": "As web users disseminate more of their personal information on the web, the possibility of these users becoming victims of lateral surveillance and identity theft increases. Therefore web resources containing this personal information, which we refer to as identity web references must be found and disambiguated to produce a unary set of web resources which refer to a given person. Such is the scale of the web that forcing web users to monitor their identity web references is not feasible, therefore automated approaches are required. However, automated approaches require background knowledge about the person whose identity web references are to be disambiguated. Within this paper we present a detailed approach to monitor the web presence of a given individual by obtaining background knowledge from Web 2.0 platforms to support automated disambiguation processes. We present a methodology for generating this background knowledge by exporting data from multiple Web 2.0 platforms as RDF data models and combining these models together for use as seed data. We present two disambiguation techniques; the first using a semi-supervised machine learning technique known as Self-training and the second using a graph-based technique known as Random Walks, we explain how the semantics of data supports the intrinsic functionalities of these techniques. We compare the performance of our presented disambiguation techniques against several baseline measures including human processing of the same data. We achieve an average precision level of 0.935 for Self-training and an average f-measure level of 0.705 for Random Walks in both cases outperforming several baselines measures. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Disambiguating identity web references using Web 2.0 data and semantics", "paper_id": "WOS:000279532700004"}