{"auto_keywords": [{"score": 0.045146009142429, "phrase": "time_slot"}, {"score": 0.03020755459799627, "phrase": "generalized_model"}, {"score": 0.022972061189703973, "phrase": "positive-delay_region"}, {"score": 0.014505049878796932, "phrase": "transmitted_symbol"}, {"score": 0.010696235967122126, "phrase": "dmn"}, {"score": 0.010318948189984974, "phrase": "capacity_region"}, {"score": 0.008058843527526331, "phrase": "two-node_dmn"}, {"score": 0.00481495049065317, "phrase": "zero-delay_nodes"}, {"score": 0.003929391999210588, "phrase": "received_symbol"}, {"score": 0.00338493754743055, "phrase": "classical_model"}, {"score": 0.003294350220187021, "phrase": "discrete_memoryless_network"}, {"score": 0.0032061793819537633, "phrase": "unit_delay"}, {"score": 0.0023044434462692483, "phrase": "causal_relay_network"}, {"score": 0.0021925226977381244, "phrase": "cut-set_outer"}, {"score": 0.0021049977753042253, "phrase": "achievable_rate_tuples"}], "paper_keywords": ["Capacity region", " cut-set outer bound", " delay", " discrete memoryless network (DMN)", " positive-delay region"], "paper_abstract": "In a network, a node is said to incur a delay if its encoding of each transmitted symbol involves only its received symbols obtained before the time slot in which the transmitted symbol is sent (hence the transmitted symbol sent in a time slot cannot depend on the received symbol obtained in the same time slot). A node is said to incur no delay if its received symbol obtained in a time slot is available for encoding its transmitted symbol sent in the same time slot. Under the classical model, every node in a discrete memoryless network (DMN) incurs a unit delay, and the capacity region of the DMN satisfies the well-known cut-set outer bound. In this paper, we propose a generalized model for the DMN where some nodes may incur no delay. Under our generalized model, we obtain a new cut-set outer bound, which is proved to be tight for some two-node DMN and is shown to subsume an existing cut-set bound for the causal relay network. In addition, we establish under the generalized model another cut-set outer bound on the positive-delay region-the set of achievable rate tuples under the constraint that every node incurs a delay. We use the cut-set bound on the positive-delay region to show that for some two-node DMN under the generalized model, the positive-delay region is strictly smaller than the capacity region.", "paper_title": "Cut-Set Bounds for Networks With Zero-Delay Nodes", "paper_id": "WOS:000356301600013"}