{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "biomedical_document_access"}, {"score": 0.004537525607322823, "phrase": "biomedical_documents"}, {"score": 0.004475798524102238, "phrase": "future_document_access"}, {"score": 0.004276016541197123, "phrase": "query_log"}, {"score": 0.004179480763003705, "phrase": "pubmed_users"}, {"score": 0.0040479661688863884, "phrase": "largest_medical_center"}, {"score": 0.0037977031586174455, "phrase": "anderson"}, {"score": 0.0037626342268042997, "phrase": "schooler"}, {"score": 0.0031627430133087616, "phrase": "empirical_data"}, {"score": 0.0028600623410146796, "phrase": "frequency-only_model"}, {"score": 0.002527788827701828, "phrase": "creation_date"}, {"score": 0.00243694486220507, "phrase": "low_storage_overheads"}, {"score": 0.002327956449278255, "phrase": "large_corpora"}, {"score": 0.0022962183207691188, "phrase": "medline._conclusion"}], "paper_keywords": [""], "paper_abstract": "Objective To determine whether past access to biomedical documents can predict future document access. Materials and methods The authors used 394 days of query log (August 1, 2009 to August 29, 2010) from PubMed users in the Texas Medical Center, which is the largest medical center in the world. The authors evaluated two document access models based on the work of Anderson and Schooler. The first is based on how frequently a document was accessed. The second is based on both frequency and recency. Results The model based only on frequency of past access was highly correlated with the empirical data (R-2=0.932), whereas the model based on frequency and recency had a much lower correlation (R-2=0.668). Discussion The frequency-only model accurately predicted whether a document will be accessed based on past use. Modeling accesses as a function of frequency requires storing only the number of accesses and the creation date for the document. This model requires low storage overheads and is computationally efficient, making it scalable to large corpora such as MEDLINE. Conclusion It is feasible to accurately model the probability of a document being accessed in the future based on past accesses.", "paper_title": "Predicting biomedical document access as a function of past use", "paper_id": "WOS:000302783600022"}