{"auto_keywords": [{"score": 0.03184186863528856, "phrase": "server_speeds"}, {"score": 0.00481495049065317, "phrase": "classical_load_balancing_problem"}, {"score": 0.004764220976404241, "phrase": "modern_context"}, {"score": 0.0047306971679760175, "phrase": "decentralized_systems"}, {"score": 0.00469740813902244, "phrase": "self-interested_clients"}, {"score": 0.004361644989356558, "phrase": "permissible_set"}, {"score": 0.004270178957872099, "phrase": "unit-length_job"}, {"score": 0.003813669883040509, "phrase": "pth_power"}, {"score": 0.003578600071301459, "phrase": "atomic_congestion_game"}, {"score": 0.0034299649219748513, "phrase": "nash_equilibria"}, {"score": 0.0033579708256295847, "phrase": "nearly_tight_bounds"}, {"score": 0.003207108833360533, "phrase": "nash_solution"}, {"score": 0.0030847461428168614, "phrase": "linear_latency_functions"}, {"score": 0.0028037753646260937, "phrase": "nash_assignment"}, {"score": 0.002784007794229784, "phrase": "social_optimum"}, {"score": 0.0023491282852109757, "phrase": "lower_bound"}, {"score": 0.002259426425685765, "phrase": "coordinated_load_balancing_problem"}, {"score": 0.002127472359795555, "phrase": "competitive_ratio"}, {"score": 0.0021049977753042253, "phrase": "simple_greedy_scheme"}], "paper_keywords": ["load balancing", " congestion games", " price of anarchy."], "paper_abstract": "We revisit a classical load balancing problem in the modern context of decentralized systems and self-interested clients. In particular, there is a set of clients, each of whom must choose a server from a permissible set. Each client has a unit-length job and selfishly wants to minimize its own latency (job completion time). A server's latency is inversely proportional to its speed, but it grows linearly with (or, more generally. as the pth power of) the number of clients matched to it. This interaction is naturally modeled as an atomic congestion game, which we call selfish load balancing. We analyze the Nash equilibria of this game and prove nearly tight bounds on the price of anarchy (worst-case ratio between a Nash solution and the social Optimum). In particular, for linear latency functions, we show that if the server speeds are relatively bounded and the number of clients is large compared with the number of servers, then every Nash assignment approaches social optimum. Without any assumptions on the number of clients, servers, and server speeds, the price of anarchy is at most 2.5. If all servers have the same speed, then the price of anarchy further improves to 1 + 2/root 3 approximate to 2.15. We also exhibit a lower bound of 2.01. Our proof techniques can also be adapted for the coordinated load balancing problem under L-2 norm, where it slightly improves the best previously known upper bound on the competitive ratio of a simple greedy scheme.", "paper_title": "Selfish load balancing and atomic congestion games", "paper_id": "WOS:000243363900004"}