{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "data_dissemination"}, {"score": 0.01053123592463406, "phrase": "wireless_sensor_networks"}, {"score": 0.005431841765909986, "phrase": "different_categories"}, {"score": 0.004544016163767266, "phrase": "application_areas"}, {"score": 0.004304856672196293, "phrase": "long_period"}, {"score": 0.004078232992955235, "phrase": "system_parameters"}, {"score": 0.003923671536980019, "phrase": "reliable_system_performance"}, {"score": 0.003745881316228299, "phrase": "serial_connections"}, {"score": 0.0035212516951180946, "phrase": "harsh_deploying_environments"}, {"score": 0.0032217062257862104, "phrase": "wsns"}, {"score": 0.0031845067058084613, "phrase": "existing_work"}, {"score": 0.0031356295480964927, "phrase": "relevant_techniques"}, {"score": 0.0028576796380512157, "phrase": "possible_future_directions"}, {"score": 0.0028356575042385156, "phrase": "data_dissemination_studies"}, {"score": 0.0027599042621376624, "phrase": "existing_approaches"}, {"score": 0.002554406040896888, "phrase": "network_structure_information"}, {"score": 0.0025054621733192283, "phrase": "disseminating_process"}, {"score": 0.002476546030310661, "phrase": "existing_literatures"}, {"score": 0.0024385083712241988, "phrase": "definite_boundary"}, {"score": 0.002419708657850547, "phrase": "limited_analysis"}, {"score": 0.0022744242010653997, "phrase": "emerging_techniques"}, {"score": 0.0022481685132781626, "phrase": "constructive_interference"}], "paper_keywords": ["wireless sensor network", " data dissemination"], "paper_abstract": "Wireless sensor networks (WSNs) have been applied in a variety of application areas. Most WSN systems, once deployed, are intended to operate unattended for a long period. During the lifetime, it is necessary to fix bugs, reconfigure system parameters, and upgrade the software in order to achieve reliable system performance. However, manually collecting all nodes back and reconfiguring through serial connections with computer is infeasible since it is labor-intensive and inconvenient due to the harsh deploying environments. Hence, data dissemination over multi-hop is desired to facilitate such tasks. This survey discusses the requirements and challenges of data dissemination in WSNs, reviews existing work, introduces some relevant techniques, presents the metrics of the performance and comparisons of the state-of-the-art work, and finally suggests the possible future directions in data dissemination studies. This survey elaborates and compares existing approaches of two categories: structure-less schemes and structure-based schemes, classified by whether or not the network structure information is used during the disseminating process. In existing literatures, different categories have definite boundary and limited analysis on the trade-off between different categories. Besides, there is no survey that discusses the emerging techniques such as Constructive Interference (CI) while these techniques have the chance to change the framework of data dissemination. In a word, even though many efforts have been made, data dissemination in WSNs still needs some more work to embrace the new techniques and improve the efficiency and practicability further.", "paper_title": "A Survey on Data Dissemination in Wireless Sensor Networks", "paper_id": "WOS:000335936300009"}