{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "utility_sectors"}, {"score": 0.014545048706543154, "phrase": "dea"}, {"score": 0.013623151492350234, "phrase": "proposed_algorithm"}, {"score": 0.007861693296321073, "phrase": "sfa"}, {"score": 0.007005126890667624, "phrase": "vrs"}, {"score": 0.0063451498734984684, "phrase": "cols"}, {"score": 0.005818582707878342, "phrase": "dea_model"}, {"score": 0.0046970764288494764, "phrase": "flexible_and_dynamic_algorithm"}, {"score": 0.004488384083300084, "phrase": "data_envelopment_analysis"}, {"score": 0.004047781270412204, "phrase": "constant_return"}, {"score": 0.0037886833451021723, "phrase": "one-way_analysis"}, {"score": 0.0033883824438527316, "phrase": "mean_efficiency_scores"}, {"score": 0.003171406379979934, "phrase": "crs"}, {"score": 0.0031064226956732497, "phrase": "higher_efficiency_score"}, {"score": 0.0030554300179552415, "phrase": "optimization_purpose"}, {"score": 0.002883439044844259, "phrase": "spearman_correlation_test"}, {"score": 0.0028243822059448266, "phrase": "higher_correlation"}, {"score": 0.002789528662623221, "phrase": "selected_method"}, {"score": 0.0026107601878587816, "phrase": "simultaneous_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Utility sector", " Assessment", " Optimization", " Data envelopment analysis", " Corrected ordinary least squares", " Stochastic frontier analysis"], "paper_abstract": "This paper presents a flexible and dynamic algorithm for total assessment, ranking, and optimization of utility sectors Data envelopment analysis (DEA). corrected ordinary least square (COLS), and stochastic frontier analysis (SFA) are employed for assessment and ranking purpose The proposed algorithm is flexible due to utilizing both constant return to scale (CRS) and variable return to scale (VRS) DEA models. One-way analysis of variance (ANOVA) is applied to test the equality of the results obtained by DEA, COLS, and SFA models in terms of mean efficiency scores. In this regard, if all the three methods reveal equal performance, the DEA model (either CRS or VRS) with higher efficiency score is selected for optimization purpose. Otherwise, through Duncan's multiple range test (DMRT), the method with the highest efficiency score is selected and then, using Spearman correlation test, the DEA model with higher correlation with the selected method is identified and applied for optimization of the utility sectors The proposed algorithm is dynamic due to simultaneous application of deterministic (i e DEA and COLS) and stochastic (i.e. SFA) methods in order to improve the ranking and optimization of utility sectors. Two real case studies are considered in order to illustrate the applicability and usefulness of the proposed algorithm in assessment, ranking, and optimization of the utility sectors (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A flexible and dynamic algorithm for assessment and optimization of utility sectors", "paper_id": "WOS:000283403900012"}