{"auto_keywords": [{"score": 0.03509976669544979, "phrase": "knowledge_maintenance_logs"}, {"score": 0.00481495049065317, "phrase": "knowledge_maintenance"}, {"score": 0.004579780586951551, "phrase": "knowledge_repository"}, {"score": 0.004015458740397976, "phrase": "knowledge_maintenance_process"}, {"score": 0.003940706575253453, "phrase": "knowledge_maintenance_process_model"}, {"score": 0.003454858296390957, "phrase": "process_mining"}, {"score": 0.003028727936200845, "phrase": "control_flow_perspective"}, {"score": 0.002953711377604328, "phrase": "good_characterization"}, {"score": 0.0029169007179202164, "phrase": "knowledge_maintenance_tasks"}, {"score": 0.002688532127821979, "phrase": "organizational_perspective"}, {"score": 0.0023127544795063263, "phrase": "proposed_approach"}, {"score": 0.0022273034991008326, "phrase": "knowledge_management_system"}], "paper_keywords": ["Knowledge maintenance", " Knowledge management", " Process mining", " Process mining"], "paper_abstract": "The quality of knowledge in the knowledge repository determines the effect of knowledge reusing and sharing. Knowledge to be reused should be checked in advance through a knowledge maintenance process. The knowledge maintenance process model is difficult to be constructed because of the balance between the efficiency and the effect. In this paper, process mining is applied to analyze the knowledge maintenance logs to discover process and then construct a more appropriate knowledge maintenance process model. We analyze knowledge maintenance logs from the control flow perspective to find a good characterization of knowledge maintenance tasks and dependencies. In addition, the logs are analyzed from the organizational perspective to cluster the performers who are qualified to do the same kinds of tasks and to get the relations among these clusters. The proposed approach has been applied in the knowledge management system. The result of the experiment shows that our approach is feasible and efficient.", "paper_title": "A process mining based approach to knowledge maintenance", "paper_id": "WOS:000292286200007"}