{"auto_keywords": [{"score": 0.042829132218243846, "phrase": "side_information"}, {"score": 0.008561287155879126, "phrase": "secrecy_capacity"}, {"score": 0.00481495049065317, "phrase": "side_information-strong_secrecy_capacity"}, {"score": 0.004646088032529303, "phrase": "wiretap_channel_models"}, {"score": 0.0041316803676012155, "phrase": "wiretap_channel"}, {"score": 0.003926105480202798, "phrase": "additional_side_information"}, {"score": 0.003711723285313348, "phrase": "transmitted_message"}, {"score": 0.0033857878144822906, "phrase": "confidential_message"}, {"score": 0.0032668821950788533, "phrase": "strong_secrecy"}, {"score": 0.0032172054825137866, "phrase": "signal-processing-inspired_criterion"}, {"score": 0.002889928791032578, "phrase": "worst_decoding_performance"}, {"score": 0.002831462722290752, "phrase": "specific_decoding_strategy"}, {"score": 0.002466510117718297, "phrase": "classical_wiretap_channel"}, {"score": 0.0023197517832705297, "phrase": "corresponding_capacity-achieving_code_structure"}, {"score": 0.0021049977753042253, "phrase": "multiple_wiretappers"}], "paper_keywords": ["Decoding performance", " optimal transceiver design", " secrecy capacity", " side information", " strong secrecy", " wiretap channel"], "paper_abstract": "The wiretap channel models the communication scenario where two legitimate users want to communicate in such a way that a wiretapper is kept ignorant. In this paper, the wiretap channel with side information is studied, where the wiretapper has additional side information available. This side information allows the wiretapper to restrict the transmitted message to a certain subset of messages before further postprocessing. Two different criteria are employed to model the secrecy of the confidential message: the information theoretic criterion of strong secrecy and a signal-processing-inspired criterion based on the decoding performance of the wiretapper. For the latter, the wiretapper is required to have the worst decoding performance regardless of the specific decoding strategy that is used. It is shown that both criteria are equivalent in terms of secrecy capacity. Furthermore, the secrecy capacity equals the one of the classical wiretap channel without side information available at the wiretapper. In addition, the corresponding capacity-achieving code structure and optimal transceiver design are characterized and properties are identified. Finally, extensions to channel uncertainty and multiple wiretappers are discussed.", "paper_title": "Wiretap Channels With Side Information-Strong Secrecy Capacity and Optimal Transceiver Design", "paper_id": "WOS:000322026900012"}