{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "japanese_firms"}, {"score": 0.034902990466084145, "phrase": "standard_costing"}, {"score": 0.013188015145659029, "phrase": "japan"}, {"score": 0.004647105813224402, "phrase": "new_manufacturing_environment"}, {"score": 0.004263336444795021, "phrase": "japanese_manufacturing_environment"}, {"score": 0.00409382470158851, "phrase": "manufacturing_environment"}, {"score": 0.0037555742428544096, "phrase": "current_level"}, {"score": 0.00351582806482809, "phrase": "relevant_literature"}, {"score": 0.0031926001871260524, "phrase": "large_number"}, {"score": 0.0031125795874844438, "phrase": "developing_and_developed_countries"}, {"score": 0.0028263192354046245, "phrase": "technological_changes"}, {"score": 0.0026863605504566924, "phrase": "different_purposes"}, {"score": 0.002540377258232509, "phrase": "empirical_investigation"}, {"score": 0.0024766636161181544, "phrase": "japanese_manufacturing_firms"}, {"score": 0.0021049977753042253, "phrase": "current_research"}], "paper_keywords": ["standard costs", " Japan", " advanced manufacturing technologies"], "paper_abstract": "Purpose - The purpose of this paper is to review literature on standard costing in Japanese manufacturing environment. It examines the changes in the manufacturing environment: in Japan that has lowered the significance of standard costing in Japanese firms and investigates the current level of its applicability in Japanese firms. Design/methodology/approach - The paper systematically categorizes the relevant literature and reviews it methodologically. Findings - The paper finds that standard costing is still being used by a large number of firms both in developing and developed countries. Overall, the research suggests that the importance of standard costing has not declined to such a low level despite the technological changes. In Japan standard costing is still used for different purposes despite its apparent weaknesses. Research limitations/implications - This is not an empirical investigation of standard costing in Japanese manufacturing firms. Originality/value - The paper will be useful to researchers, cost accountants and others concerned with product costing to understand the importance of standard costing. It is also expected that the current research will help reveal whether or not one should continue teaching standard costing in the classroom.", "paper_title": "Standard costing in Japanese firms - Reexamination of its significance in the new manufacturing environment", "paper_id": "WOS:000245771000016"}