{"auto_keywords": [{"score": 0.04835227522307675, "phrase": "normative_environment"}, {"score": 0.008248501783718536, "phrase": "development_process"}, {"score": 0.00481495049065317, "phrase": "agent_methodologies"}, {"score": 0.00436575511349828, "phrase": "collaborative_work"}, {"score": 0.00405646687267772, "phrase": "expanding_demand"}, {"score": 0.0037459885494311217, "phrase": "heterogeneous_environments"}, {"score": 0.0036329805216306576, "phrase": "software_applications"}, {"score": 0.0035668128900149814, "phrase": "specific_regulations"}, {"score": 0.0031553611552558986, "phrase": "final_design"}, {"score": 0.003097865379563127, "phrase": "software_system"}, {"score": 0.002949598537993663, "phrase": "important_issue"}, {"score": 0.002791239714439304, "phrase": "agent-oriented_software_engineering_methodologies"}, {"score": 0.002690406375639144, "phrase": "normative_systems"}, {"score": 0.0021049977753042253, "phrase": "open_issues"}], "paper_keywords": ["Multi-agent systems", " Normative systems", " Agent methodologies"], "paper_abstract": "Due to the increase in collaborative work and the decentralization of processes in many domains, there is an expanding demand for large-scale, flexible and adaptive software systems to support the interactions of people and institutions distributed in heterogeneous environments. Commonly, these software applications should follow specific regulations meaning the actors using them are bound by rights, duties and restrictions. Since this normative environment determines the final design of the software system, it should be considered as an important issue during the design of the system. Some agent-oriented software engineering methodologies deal with the development of normative systems (systems that have a normative environment) by integrating the analysis of the normative environment of a system in the development process. This paper analyses to what extent these methodologies support the analysis and formalisation of the normative environment and highlights some open issues of the topic.", "paper_title": "Evaluating how agent methodologies support the specification of the normative environment through the development process", "paper_id": "WOS:000361822800002"}