{"auto_keywords": [{"score": 0.04329804133557501, "phrase": "cscl_layer"}, {"score": 0.007109153838003679, "phrase": "cesium_chloride"}, {"score": 0.005076700593660301, "phrase": "lithium_fluoride"}, {"score": 0.00481495049065317, "phrase": "organic_electroluminescent_devices"}, {"score": 0.004517387079319428, "phrase": "organic_light-emitting_diodes"}, {"score": 0.004449280529563265, "phrase": "basic_device_configuration"}, {"score": 0.004012500850311087, "phrase": "al_cathode"}, {"score": 0.003969205877368471, "phrase": "npb_layer"}, {"score": 0.0039280214778273925, "phrase": "effective_barrier"}, {"score": 0.0039042115674024006, "phrase": "electron_injection"}, {"score": 0.0034887749053459584, "phrase": "electron_injection_layer"}, {"score": 0.0027601397818618617, "phrase": "charge_transfer"}, {"score": 0.0027433895507237584, "phrase": "metal_cs"}, {"score": 0.002726740692380339, "phrase": "organic_material"}, {"score": 0.002628942455803398, "phrase": "hole_blocking"}, {"score": 0.002370437342182877, "phrase": "device_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cesium chloride", " Electron injection", " Trap site", " Hole blocking", " Carrier balance"], "paper_abstract": "The effect of various positions and thicknesses of cesium chloride (CsCl) layer in organic light-emitting diodes is investigated. The basic device configuration is indium-tin-oxide (ITO)/N,N'-bis-(1-naphthl)-diphenyl-1,1'-biphenyl-4,4'-diamine (NPB)/tris (8-hydroxyquinoline) aluminum (Alq(3))/aluminum (Al). The following results are demonstrated. When the CsCl layer is placed at the Alq(3)/Al interface and closer to the Al cathode inside Alq(3) layer, the effective barrier to electron injection is reduced due to the reaction between Cs and Al. As a result, the injection of electrons and holes is more balanced and the efficiency is enhanced from 1.83 to 3.49 cd/A. And as an electron injection layer, CsCl can be comparable with lithium fluoride (LiF). If the distance of the CsCl layer is more than 20 nm from Alq(3)/Al interface inside Alq(3) layer, the luminance and efficiency are enhanced but the injection is not increased, which is attributed to trap sites induced by the CsCl layer. The decrease of luminance and efficiency is observed when the CsCl layer is located at the NPB/Alq(3) interface. The reason is exciton quenching due to charge transfer from metal Cs to organic material Alq(3). The CsCl layer inside NPB layer plays a role of hole blocking. More balanced injection of carriers is expected. Subsequently, both luminance and efficiency are enhanced by 34% and 60%, respectively. When the cathode of lithium fluoride (LiF)/Al is used, the device efficiency is also improved from 4.0 to 5.0 cd/A by inserting the CsCl layer inside NPB layer. However, the improvement is not observed for the device with the CsCl layer inserted inside Alq(3) layer in LiF/Al-OLED. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Enhanced properties of organic electroluminescent devices with cesium chloride ultra-thin layer", "paper_id": "WOS:000316528100009"}