{"auto_keywords": [{"score": 0.049604883316905636, "phrase": "host-guest_affinities"}, {"score": 0.026608464109780024, "phrase": "alpha-cd_complexes"}, {"score": 0.004817805484352212, "phrase": "lie"}, {"score": 0.004673290248999786, "phrase": "solvation_model"}, {"score": 0.004565984572487962, "phrase": "guest-host_systems"}, {"score": 0.004490842671590769, "phrase": "popular_end-point_methods"}, {"score": 0.004202387892988509, "phrase": "six_primary_alcohols"}, {"score": 0.004011521305179232, "phrase": "eight_guest_molecules"}, {"score": 0.0037662262006579023, "phrase": "guest_molecules"}, {"score": 0.0036804016944290995, "phrase": "resp"}, {"score": 0.0035712919163869176, "phrase": "average_esp"}, {"score": 0.003500812175550438, "phrase": "molecular_dynamics_snapshots"}, {"score": 0.003286642683771891, "phrase": "relative_affinities"}, {"score": 0.003014576010931602, "phrase": "charge_model"}, {"score": 0.002801983400946225, "phrase": "absolute_deviation"}, {"score": 0.0027649684074145028, "phrase": "systematic_error"}, {"score": 0.002710358243468008, "phrase": "correlation_coefficient"}, {"score": 0.0024776238724770524, "phrase": "lie_method"}, {"score": 0.002318180580715058, "phrase": "nonpolar_scaling_parameter"}], "paper_keywords": ["MM/GBSA", " MM/PBSA", " LIE", " MD simulations", " alpha-cyclodextrin", " Cucurbit[8]uril"], "paper_abstract": "The affinities of two sets of guest-host systems were estimated using the popular end-point methods MM/GBSA (molecular-mechanics with generalised Born and surface-area solvation) and LIE (linear interaction energy). A set of six primary alcohols that bind to alpha-cyclodextrin (alpha-CD) and a set of eight guest molecules to cucurbit[8]uril (CB8) were considered. Three different charge schemes were used to obtain charges for the host and guest molecules, viz., AM1-BCC, RESP, and the recently suggested xAvESP (which average ESP charges over a number of molecular dynamics snapshots). Furthermore, both the generalised Born and Poisson-Boltzmann solvation models were used in the MM/GBSA calculations. The two solvation models perform equally well in predicting relative affinities, and hence there is no point in using the more expensive Poisson-Boltzmann model for these systems. Both the LIE and MM/GBSA estimates are shown to be robust with respect to the charge model, and therefore it is recommended to use the cheapest AM1-BCC charges. Using AM1-BCC charges, the MM/GBSA method gave a MADtr (mean absolute deviation after removal of systematic error) of 17 kJ/mol and a correlation coefficient (r(2)) of 0.67 for the CB8 complexes, and a MADtr of 10 kJ/mol and an r(2) of 0.96 for the alpha-CD complexes. The LIE method gave a MADtr of 20 kJ/mol and an r(2) of 0.10 for the CB8 complexes, after optimisation of the nonpolar scaling parameter. For the alpha-CD complexes, no optimisation was necessary and the method gave a MADtr of 2 kJ/mol and a r(2) of 0.96. These results indicate that both MM/GBSA and LIE are able to estimate host-guest affinities accurately.", "paper_title": "MM/GBSA and LIE estimates of host-guest affinities: dependence on charges and solvation model", "paper_id": "WOS:000298191200007"}