{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-path_algorithms"}, {"score": 0.044565655484193806, "phrase": "minimum-colour_path_problem"}, {"score": 0.015601773566707966, "phrase": "minimum-colour_path_problems"}, {"score": 0.010982420746971332, "phrase": "polynomial-time_solutions"}, {"score": 0.00922666031665495, "phrase": "barrier_resilience_problem"}, {"score": 0.004688321299229397, "phrase": "barrier_resilience"}, {"score": 0.004547656324173302, "phrase": "zero_or_more_colours"}, {"score": 0.003702797077941999, "phrase": "np"}, {"score": 0.00364603066037512, "phrase": "strong_hardness"}, {"score": 0.0036183419672924095, "phrase": "approximation_results"}, {"score": 0.0032272929113113203, "phrase": "approximation_algorithms"}, {"score": 0.0029450186031370245, "phrase": "constant_factor_approximations"}, {"score": 0.002687366778212309, "phrase": "arrangement_a"}, {"score": 0.00266693888510356, "phrase": "n_regions"}, {"score": 0.0025282151875392817, "phrase": "s-t_paths"}, {"score": 0.002229043128610864, "phrase": "unit_disks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " Barrier coverage", " Resilience", " Minimum colour path problems in graphs"], "paper_abstract": "Let G be a graph with zero or more colours assigned to its vertices, and let v(s) and v(t) be two vertices of G. The minimum-colour path problem is to determine the minimum over all v(s)-v(t) paths of the number of colours used, where a colour is considered used if it is assigned to any vertex in the path. Although this problem is NP-hard with strong hardness of approximation results, many problems can be formulated as instances of the minimum-colour path problem with additional constraints which may be exploited to allow polynomial-time solutions or close approximations. We introduce a family of approximation algorithms, referred to as the Multi-Path Algorithms, for minimum-colour path problems, and go on to show examples of constraints which would allow polynomial-time solutions or constant factor approximations. In particular, we describe applications to variants of the barrier resilience problem: given a pair of points s and t and an arrangement A of n regions in the plane, the problem is to determine the minimum over all s-t paths of the number of regions intersected. We show how to reduce the barrier resilience problem to the minimum-colour path problem, and go on to show that the Multi-Path Algorithms guarantee a 1.5 approximation when regions are unit disks and s, t are separated by at least 2 root 3. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Multi-Path Algorithms for minimum-colour path problems with applications to approximating barrier resilience", "paper_id": "WOS:000343358400008"}