{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "practical_negotiating_agents"}, {"score": 0.004610058444728656, "phrase": "in-depth_analysis"}, {"score": 0.004564021871465994, "phrase": "key_insights"}, {"score": 0.004443482801729777, "phrase": "anac"}, {"score": 0.004399102320426124, "phrase": "international_competition"}, {"score": 0.004311660976562745, "phrase": "successful_automated_negotiation_agents"}, {"score": 0.004059585951426263, "phrase": "key_objectives"}, {"score": 0.0038867116254051363, "phrase": "practical_bilateral_multi-issue_negotiations"}, {"score": 0.003622811707147052, "phrase": "eighteen_teams"}, {"score": 0.003598629227969919, "phrase": "seven_different_institutes"}, {"score": 0.003399466007862412, "phrase": "negotiation_scenarios"}, {"score": 0.0032985137109323827, "phrase": "final_rounds"}, {"score": 0.003168543855125077, "phrase": "different_strategies"}, {"score": 0.0029041917003677234, "phrase": "standard_benchmark_strategies"}, {"score": 0.0028368567593956054, "phrase": "empirical_game_theory"}, {"score": 0.0026977641744883826, "phrase": "competition_results"}, {"score": 0.0026263842544386948, "phrase": "broader_automated_negotiation_community"}, {"score": 0.0025059724686541263, "phrase": "different_opponents"}, {"score": 0.0023044856709624494, "phrase": "utility_maximisation"}, {"score": 0.00216950156199795, "phrase": "successful_and_robust_negotiation_agent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "This paper presents an in-depth analysis and the key insights gained from the Second International Automated Negotiating Agents Competition (ANAC 2011). ANAC is an international competition that challenges researchers to develop successful automated negotiation agents for scenarios where there is no information about the strategies and preferences of the opponents. The key objectives of this competition are to advance the state-of-the-art in the area of practical bilateral multi-issue negotiations, and to encourage the design of agents that are able to operate effectively across a variety of scenarios. Eighteen teams from seven different institutes competed. This paper describes these agents, the setup of the tournament, including the negotiation scenarios used, and the results of both the qualifying and final rounds of the tournament. We then go on to analyse the different strategies and techniques employed by the participants using two methods: (i) we classify the agents with respect to their concession behaviour against a set of standard benchmark strategies and (ii) we employ empirical game theory (EGT) to investigate the robustness of the strategies. Our analysis of the competition results allows us to highlight several interesting insights for the broader automated negotiation community. In particular, we show that the most adaptive negotiation strategies, while robust across different opponents, are not necessarily the ones that win the competition. Furthermore, our EGT analysis highlights the importance of considering metrics, in addition to utility maximisation (such as the size of the basin of attraction), in determining what makes a successful and robust negotiation agent for practical settings. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Evaluating practical negotiating agents: Results and analysis of the 2011 international competition", "paper_id": "WOS:000319539400004"}