{"auto_keywords": [{"score": 0.03421787969149637, "phrase": "unauthorized_sharing"}, {"score": 0.033782804396948224, "phrase": "trust_violation"}, {"score": 0.00481495049065317, "phrase": "pervasive_use"}, {"score": 0.004710306419574744, "phrase": "customer_information_privacy_violation"}, {"score": 0.004429191773525288, "phrase": "previous_literature"}, {"score": 0.004003169429008801, "phrase": "negative_events"}, {"score": 0.003968112038249246, "phrase": "customer_information_privacy"}, {"score": 0.003539252646181146, "phrase": "privacy_breaches"}, {"score": 0.0034319005131102495, "phrase": "company_responses"}, {"score": 0.0033572130837348623, "phrase": "moderating_effects"}, {"score": 0.003170520716404193, "phrase": "repair_process"}, {"score": 0.0028276174348291923, "phrase": "significant-moderating_impact"}, {"score": 0.0026352496813713292, "phrase": "universally_effective_response"}, {"score": 0.0024451427672857458, "phrase": "complex_response"}, {"score": 0.0023604768913655463, "phrase": "trustworthiness_beliefs"}, {"score": 0.0022192891418394514, "phrase": "violation-repair_process"}, {"score": 0.0021805201234139475, "phrase": "theoretical_and_managerial_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Trust violation", " Trust repair", " Privacy concern", " Hacking", " Unauthorized sharing"], "paper_abstract": "With the pervasive use of the Internet, customer information privacy violation is on the rise and companies could suffer by losing their customers' trust. While previous literature has identified factors that influence trust, less attention has been paid to how trust may be rebuilt after it is violated by negative events regarding customer information privacy. The study synthesized two salient theories (the attribution theory and the organizational justice theory) to investigate the process by which trust is violated by privacy breaches and the extent of its repair by company responses. We examine the moderating effects of two types of privacy violation hacking and unauthorized sharing on the trust violation and repair process. We investigate the efficacy of three response types apology, denial and no response. Data were gathered using a controlled, scenario-based lab experiment. Our results showed the significant-moderating impact of violation type on the process of trust violation and repair. Apology emerged as a universally effective response, although its reparative power was far less in unauthorized sharing than in hacking. Denial emerged as a complex response. Furthermore, the results showed that trustworthiness beliefs (ability, integrity, and benevolence) are differently impacted in the violation-repair process. Details of theoretical and managerial implications are discussed. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Trust violation and repair: The information privacy perspective", "paper_id": "WOS:000352050600006"}