{"auto_keywords": [{"score": 0.045441220077317934, "phrase": "new_server"}, {"score": 0.027526005207902864, "phrase": "optimal_location_query"}, {"score": 0.015174504699822315, "phrase": "road_network"}, {"score": 0.007234480450936072, "phrase": "minmax"}, {"score": 0.007194966673117809, "phrase": "maxsum"}, {"score": 0.007000617457320619, "phrase": "optimal_location_query_problem"}, {"score": 0.006905406696548821, "phrase": "cost_function"}, {"score": 0.00481495049065317, "phrase": "road_networks"}, {"score": 0.0040390073554283906, "phrase": "cost_functions"}, {"score": 0.003618662721828278, "phrase": "maximum_cost"}, {"score": 0.003154012038613403, "phrase": "minmax_query"}, {"score": 0.003128105549382381, "phrase": "maxsum_query"}, {"score": 0.0030265836903931604, "phrase": "clients'_perspective"}, {"score": 0.0029934784017784204, "phrase": "new_server's_perspective"}, {"score": 0.002936410533329336, "phrase": "existing_solutions"}, {"score": 0.002912286162122983, "phrase": "optimal_query_problem"}, {"score": 0.002817748867229525, "phrase": "efficient_algorithm"}, {"score": 0.0027869214641194646, "phrase": "minmax-alg"}, {"score": 0.0026377570446517004, "phrase": "novel_idea"}, {"score": 0.0026232857693533535, "phrase": "nearest_location_component"}, {"score": 0.0024355006743908905, "phrase": "extensive_experiments"}], "paper_keywords": ["Algorithms", " Optimal location query", " road network", " nearest location component"], "paper_abstract": "In this article, we study an optimal location query based on a road network. Specifically, given a road network containing clients and servers, an optimal location query finds a location on the road network such that when a new server is set up at this location, a certain cost function computed based on the clients and servers (including the new server) is optimized. Two types of cost functions, namely, MinMax and MaxSum, have been used for this query. The optimal location query problem with MinMax as the cost function is called the MinMax query, which finds a location for setting up a new server such that the maximum cost of a client being served by his/her closest server is minimized. The optimal location query problem with MaxSum as the cost function is called the MaxSum query, which finds a location for setting up a new server such that the sum of the weights of clients attracted by the new server is maximized. The MinMax query and the MaxSum query correspond to two types of optimal location query with the objectives defined from the clients' perspective and from the new server's perspective, respectively. Unfortunately, the existing solutions for the optimal query problem are not efficient. In this article, we propose an efficient algorithm, namely, MinMax-Alg (MaxSum-Alg), for the MinMax (MaxSum) query, which is based on a novel idea of nearest location component. We also discuss two extensions of the optimal location query, namely, the optimal multiple-location query and the optimal location query on a 3D road network. Extensive experiments were conducted, showing that our algorithms are faster than the state of the art by at least an order of magnitude on large real benchmark datasets. For example, in our largest real datasets, the state of the art ran for more than 10 (12) hours while our algorithm ran within 3 (2) minutes only for the MinMax (MaxSum) query, that is, our algorithm ran at least 200 (600) times faster than the state of the art.", "paper_title": "Optimal Location Queries in Road Networks", "paper_id": "WOS:000363567400003"}