{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "moira-plus"}, {"score": 0.04773403300490865, "phrase": "heavy_metals"}, {"score": 0.03885478211962643, "phrase": "dss_moira-plus"}, {"score": 0.004656557209439822, "phrase": "complex_fresh_water_ecosystems"}, {"score": 0.004533585346030341, "phrase": "accidental_release"}, {"score": 0.004503350877279651, "phrase": "radioactive_substances"}, {"score": 0.004355163162038354, "phrase": "suitable_countermeasures"}, {"score": 0.004268591456106124, "phrase": "polluted_environment"}, {"score": 0.004114303071093143, "phrase": "detrimental_effects"}, {"score": 0.003809416146761322, "phrase": "optimal_countermeasure_strategies"}, {"score": 0.0037839928025418896, "phrase": "different_kinds"}, {"score": 0.0037587384888691645, "phrase": "aquatic_ecosystems"}, {"score": 0.0037336520904376687, "phrase": "contamination_scenarios"}, {"score": 0.0035388743851813512, "phrase": "contaminated_water_bodies"}, {"score": 0.003410871299189454, "phrase": "contamination_levels"}, {"score": 0.003354223660940168, "phrase": "radiation_dose"}, {"score": 0.0032546105164772995, "phrase": "relevant_exposure_pathways"}, {"score": 0.002789715649746005, "phrase": "geographic_information_system"}, {"score": 0.002743355746391485, "phrase": "associated_databases"}, {"score": 0.0027068216332674895, "phrase": "aquatic_system"}, {"score": 0.0024152394732063908, "phrase": "environmental_models"}, {"score": 0.002391067964886602, "phrase": "moira-plus_dss"}, {"score": 0.0021987994275190314, "phrase": "complex_water_systems"}, {"score": 0.0021049977753042253, "phrase": "main_principles"}], "paper_keywords": ["Decision systems", " Multi-attribute analysis", " MOIRA DSS", " Modelling", " Countermeasures", " Fresh water ecosystems"], "paper_abstract": "The accidental release of radioactive substances into the environment leads to the necessity of applying suitable countermeasures for the restoration of the polluted environment. However, despite their obvious benefits, such interventions may result in detrimental effects of an economic, ecological and social nature that must be carefully evaluated. MOIRA-PLUS is a PC-based user-friendly, computerised decision support system (DSS) that helps decision makers to choose optimal countermeasure strategies for different kinds of aquatic ecosystems and contamination scenarios. The DSS MOIRA-PLUS is based on: (a) Validated models to evaluate the behaviour of radionuclides in contaminated water bodies and biota and to assess the effect of countermeasures on contamination levels; (b) Models to assess the radiation dose to people and biota (fish) by relevant exposure pathways, the effect of countermeasures, and the associated economic impact; (c) A multi-attribute analysis (MAA) module to evaluate the effectiveness of different countermeasure strategies by accounting for the social, ecological and economic detriments and costs in relation to their benefits; (d) A software system consisting of: (1) software realisation of the mathematical models; (2) a Geographic Information System (GIS) and associated databases to select the aquatic system of interest and, if necessary, the default environmental data required to run the models: (3) a graphical user interface (GUI): (4) an operating system connecting all the above parts. The flexible structures of the environmental models implemented in MOIRA-PLUS DSS give the potential for the application of these models to several other types of pollutants, such as heavy metals. The DSS can be applied to complex water systems comprising lakes, reservoirs and rivers. In this paper, the main principles underpinning the functioning of the DSS MOIRA-PLUS are described and discussed. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "MOIRA-PLUS: A decision support system for the management of complex fresh water ecosystems contaminated by radionuclides and heavy metals", "paper_id": "WOS:000266672300003"}