{"auto_keywords": [{"score": 0.04733190377720631, "phrase": "vietnam"}, {"score": 0.003626626504149897, "phrase": "medical_errors"}, {"score": 0.0033984088755183287, "phrase": "arv_therapy"}, {"score": 0.0031285355811105915, "phrase": "antiretroviral_therapy_information"}, {"score": 0.0030195184114140063, "phrase": "hanoi_capital"}, {"score": 0.002931569771634119, "phrase": "overall_design_considerations"}, {"score": 0.0028127163745564777, "phrase": "centralized_database_and_decentralized_management"}, {"score": 0.00246957392654378, "phrase": "implementation_model"}, {"score": 0.0024405312482831646, "phrase": "health_care"}, {"score": 0.002286781334850213, "phrase": "hiv_infection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Decentralized management", " Centralized database", " ARV drug management", " HIV", " Vietnam"], "paper_abstract": "Management of antiretroviral (ARV) drug and HIV patients data is an important component of Vietnam Administration of HIV/AIDS Control (VAAC) Department and hospitals/health care units when people often travel in other places of Vietnam; therefore, it would lead to a number of medical errors in treatment as well as patients do not adhere to ARV therapy. In this paper, we describe a system that manages and shares antiretroviral therapy information of 4438 HIV patients in three healthcare centers in Hanoi capital of Vietnam. The overall design considerations, architecture and the integration of centralized database and decentralized management for the system are also presented. The findings from this study can serve as a guide to consider in the implementation model of health care to manage and share information of patients not only in HIV infection, but also in the other chronic and non-communicable diseases. (C) 2013 Published by Elsevier Ireland Ltd.", "paper_title": "A method to manage and share anti-retroviral (ARV) therapy information of human immunodeficiency virus (HIV) patients in Vietnam", "paper_id": "WOS:000321345400003"}