{"auto_keywords": [{"score": 0.049193598318116316, "phrase": "blocking_flow_shop_problem"}, {"score": 0.04399037714588096, "phrase": "food_source_phase"}, {"score": 0.00481495049065317, "phrase": "discrete_artificial_bee_colony"}, {"score": 0.004681971826924847, "phrase": "total_flowtime_minimization"}, {"score": 0.004552648949390462, "phrase": "high_performing_discrete_artificial_bee_colony_algorithm"}, {"score": 0.004447600571127578, "phrase": "flow_time_criterion"}, {"score": 0.004344965512058521, "phrase": "proposed_algorithm"}, {"score": 0.003689628075766217, "phrase": "employed_bees_phase"}, {"score": 0.0033761303704612734, "phrase": "initialization_scheme"}, {"score": 0.0031475032122226, "phrase": "initial_food_sources"}, {"score": 0.0030604342671868836, "phrase": "computational_evaluation"}, {"score": 0.00297576670831646, "phrase": "main_procedures"}, {"score": 0.0028799352389969443, "phrase": "good_solutions"}, {"score": 0.0027741761880779535, "phrase": "best_configuration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Flow shop", " Blocking", " Total flowtime", " Heuristics"], "paper_abstract": "This paper presents a high performing Discrete Artificial Bee Colony algorithm for the blocking flow shop problem with flow time criterion. To develop the proposed algorithm, we considered four strategies for the food source phase and two strategies for each of the three remaining phases (employed bees, onlookers and scouts). One of the strategies tested in the food source phase and one implemented in the employed bees phase are new. Both have been proved to be very effective for the problem at hand. The initialization scheme named HPF2(lambda,mu) in particular, which is used to construct the initial food sources, is shown in the computational evaluation to be one of the main procedures that allow the DABC_RCT to obtain good solutions for this problem. To find the best configuration of the algorithm, we used design of experiments (DOE). This technique has been used extensively in the literature to calibrate the parameters of the algorithms but not to select its configuration. Comparing it with other algorithms proposed for this problem in the literature demonstrates the effectiveness and superiority of the DABC_RCT. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An efficient Discrete Artificial Bee Colony algorithm for the blocking flow shop problem with total flowtime minimization", "paper_id": "WOS:000355063700013"}