{"auto_keywords": [{"score": 0.04920822493417558, "phrase": "coauthorship_network"}, {"score": 0.014529566849191584, "phrase": "structural_communities"}, {"score": 0.014010645057457399, "phrase": "socioacademic_characteristics"}, {"score": 0.00481495049065317, "phrase": "structural_and_socioacademic_communities"}, {"score": 0.003910106508089187, "phrase": "bibliographic_record"}, {"score": 0.0037921662574137535, "phrase": "interdisciplinary_research_group"}, {"score": 0.0036553070575015344, "phrase": "sensor_networks"}, {"score": 0.0036107898615445797, "phrase": "wireless_communication"}, {"score": 0.003438058620195309, "phrase": "structural_community"}, {"score": 0.0028605468171961457, "phrase": "academic_affiliation"}, {"score": 0.0027403605798830984, "phrase": "academic_position"}, {"score": 0.0026252106881752067, "phrase": "simulated_monte_carlo"}, {"score": 0.0021049977753042253, "phrase": "departmental_and_institutional_affiliation"}], "paper_keywords": ["social networks", " structures and organization in human complex systems", " community detection", " collaboration patterns"], "paper_abstract": "This article presents a study that compares detected structural communities in a coauthorship network to the socioacademic characteristics of the scholars that compose the network. The coauthorship network was created from the bibliographic record of a multi-institution, interdisciplinary research group focused on the study of sensor networks and wireless communication. Four different community detection algorithms were employed to assign a structural community to each scholar in the network: leading eigenvector, walktrap, edge betweenness and spinglass. Socioacademic characteristics were gathered from the scholars and include such information as their academic department, academic affiliation, country of origin, and academic position. A Pearson's chi(2)test, with a simulated Monte Carlo, revealed that structural communities best represent groupings of individuals working in the same academic department and at the same institution. A generalization of this result suggests that, even in interdisciplinary, multi-institutional research groups, coauthorship is primarily driven by departmental and institutional affiliation. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "On the relationship between the structural and socioacademic communities of a coauthorship network", "paper_id": "WOS:000257767400003"}