{"auto_keywords": [{"score": 0.039874374480149306, "phrase": "tandem_repeats"}, {"score": 0.015719716506582538, "phrase": "edit_distance"}, {"score": 0.004441590240656494, "phrase": "tandem"}, {"score": 0.004275904315753662, "phrase": "eukaryotic_and_prokaryotic_organisms"}, {"score": 0.004155742403177802, "phrase": "numerous_fields"}, {"score": 0.004116440453049531, "phrase": "disease_diagnosis"}, {"score": 0.004019797503157808, "phrase": "human_identity_testing"}, {"score": 0.003906804492585634, "phrase": "sequence_homology"}, {"score": 0.0035189057079817285, "phrase": "exhaustive_search"}, {"score": 0.0032456625605347417, "phrase": "efficient_algorithm"}, {"score": 0.003065619675251781, "phrase": "edit_distance_measure"}, {"score": 0.0028006988338192375, "phrase": "precise_definition"}, {"score": 0.0022076314894741394, "phrase": "new_ways"}, {"score": 0.0021049977753042253, "phrase": "protein_molecules"}], "paper_keywords": [""], "paper_abstract": "Motivation: A tandem repeat in DNA is a sequence of two or more contiguous, approximate copies of a pattern of nucleotides. Tandem repeats occur in the genomes of both eukaryotic and prokaryotic organisms. They are important in numerous fields including disease diagnosis, mapping studies, human identity testing (DNA fingerprinting), sequence homology and population studies. Although tandem repeats have been used by biologists for many years, there are few tools available for performing an exhaustive search for all tandem repeats in a given sequence. Results: In this paper we describe an efficient algorithm for finding all tandem repeats within a sequence, under the edit distance measure. The contributions of this paper are two-fold: theoretical and practical. We present a precise definition for tandem repeats over the edit distance and an efficient, deterministic algorithm for finding these repeats. Availability: The algorithm has been implemented in C++, and the software is available upon request and can be used at http://www.sci.brooklyn.cuny.edu/similar to sokol/trepeats. The use of this tool will assist biologists in discovering new ways that tandem repeats affect both the structure and function of DNA and protein molecules.", "paper_title": "Tandem repeats over the edit distance", "paper_id": "WOS:000243992400006"}