{"auto_keywords": [{"score": 0.030311084376533765, "phrase": "parikh"}, {"score": 0.00481495049065317, "phrase": "membrane_computing"}, {"score": 0.004752221133109136, "phrase": "biologically_inspired_computational_paradigm"}, {"score": 0.004669845451682529, "phrase": "brane_calculi"}, {"score": 0.004608997772926119, "phrase": "membrane_systems"}, {"score": 0.004529093447865156, "phrase": "conventional_membrane_systems"}, {"score": 0.003752550907120244, "phrase": "attached_molecules"}, {"score": 0.0033197446406648626, "phrase": "cellular_dripping"}, {"score": 0.0031775430407770026, "phrase": "living_cells"}, {"score": 0.0027741761880779535, "phrase": "programmed_grammars"}, {"score": 0.002749980017065414, "phrase": "appearance_checking"}, {"score": 0.00270221723573854, "phrase": "non-semilinear_sets"}, {"score": 0.0021993066642488237, "phrase": "semilinear_sets"}, {"score": 0.0021049977753042253, "phrase": "decision_problems"}], "paper_keywords": [""], "paper_abstract": "Membrane computing is a biologically inspired computational paradigm. Motivated by brane calculi we investigate membrane systems which differ from conventional membrane systems by the following features: (1) biomolecules (proteins) can move through the regions of the systems, and can attach onto (and de-attach from) membranes, and (2) membranes can evolve depending on the attached molecules. The evolution of membranes is performed by using rules that are motivated by the operation of pinocytosis (the pino rule) and the operation of cellular dripping (the drip rule) that take place in living cells. We show that such membrane systems are computationally universal. We also show that if only the second feature is used then one can generate at least the family of Parikh images of the languages generated by programmed grammars without appearance checking (which contains non-semilinear sets of vectors). If, moreover, the use of pino/drip rules is non-cooperative (i.e., not dependent on the proteins attached to membranes), then one generates a family of sets of vectors that is strictly included in the family of semilinear sets of vectors. We also consider a number of decision problems concerning reachability of configurations and boundness. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Membrane systems with proteins embedded in membranes", "paper_id": "WOS:000259652200006"}