{"auto_keywords": [{"score": 0.0496440564698755, "phrase": "dynamic_load-balancing"}, {"score": 0.03754771325746951, "phrase": "dynamic_load"}, {"score": 0.03190442184967932, "phrase": "rl"}, {"score": 0.004815802550581909, "phrase": "scalability"}, {"score": 0.0047283116134926645, "phrase": "optimistic_gate_level_simulation"}, {"score": 0.0046221918332842995, "phrase": "moore's_law"}, {"score": 0.004518442937844318, "phrase": "integrated_circuits"}, {"score": 0.004317848984770719, "phrase": "major_bottleneck"}, {"score": 0.004259418153299952, "phrase": "circuit_design_process"}, {"score": 0.0042209023469249205, "phrase": "parallel_simulation"}, {"score": 0.0038368442918503072, "phrase": "parallel_discrete_event_simulator"}, {"score": 0.0037506567448470163, "phrase": "synthesizeable_verilog_circuits"}, {"score": 0.00304295114679455, "phrase": "reinforcement_learning"}, {"score": 0.0026913130726432645, "phrase": "first_time"}, {"score": 0.002391067964886602, "phrase": "gate_level_simulations"}, {"score": 0.0023479541382385506, "phrase": "vlsi"}, {"score": 0.002153450937601075, "phrase": "simulation_time"}], "paper_keywords": ["Dynamic load-balancing", " parallel circuit simulation", " reinforcement learning (RL)", " time warp", " verilog"], "paper_abstract": "As proscribed by Moore's law, the size of integrated circuits has grown geometrically, resulting in simulation becoming the major bottleneck in the circuit design process. Parallel simulation provides us with a way to cope with this growth. In this paper, we describe an optimistic (time warp) parallel discrete event simulator which can simulate all synthesizeable Verilog circuits. We investigate its scalability and describe a machine learning based dynamic load balancing algorithm for use with the simulator. We initially developed two dynamic load balancing algorithms to balance the load and the communication, respectively, during the course of a simulation. Making use of reinforcement learning (RL), we then created an algorithm which is an amalgam of these two algorithms. To the best of our knowledge, this is the first time that RL has been used for the dynamic load-balancing of time warp. We investigated the scalability and the effectiveness of the dynamic load balancing algorithms on gate level simulations of several realistic very large scale integration (VLSI) circuits. Our experimental results showed that our simulator is indeed scalable. They also reveled a 88.6% improvement in the simulation time through the use of our RL algorithm.", "paper_title": "On the Scalability and Dynamic Load-Balancing of Optimistic Gate Level Simulation", "paper_id": "WOS:000283145400006"}