{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "metric_steiner_tree_problem"}, {"score": 0.04839945497190436, "phrase": "bidirected_cut_relaxation"}, {"score": 0.015405701639645055, "phrase": "integrality_gap"}, {"score": 0.012586519146898772, "phrase": "primal-dual_schema"}, {"score": 0.00437021209960886, "phrase": "long-standing_open_problem"}, {"score": 0.003788296551609616, "phrase": "geometric_setting"}, {"score": 0.003351381374975648, "phrase": "quasi-bipartite_graphs"}, {"score": 0.0032836104153151973, "phrase": "best_integrality_gap"}, {"score": 0.0031521523497281567, "phrase": "vazirani"}, {"score": 0.0027883885425383534, "phrase": "key_difficulty"}, {"score": 0.002622528664187849, "phrase": "reasonable_dual_growth_procedure"}, {"score": 0.0025958582759972315, "phrase": "extremely_unwieldy_dual_solutions"}, {"score": 0.002556359086441866, "phrase": "new_algorithmic_idea"}, {"score": 0.0023197517832705297, "phrase": "altered_instance"}, {"score": 0.0022041312401435346, "phrase": "new_technique"}, {"score": 0.0021049977753042253, "phrase": "approximation_algorithms"}], "paper_keywords": [""], "paper_abstract": "Determining the integrality gap of the bidirected cut relaxation for the metric Steiner tree problem, and exploiting it algorithmically, is a long-standing open problem. We use geometry to define an LP whose dual is equivalent to this relaxation. This opens up the possibility of using the primal-dual schema in a geometric setting for designing an algorithm for this problem. Using this approach, we obtain a 4/3 factor algorithm and integrality gap bound for the case of quasi-bipartite graphs; the previous best integrality gap upper bound being 3/2 (Rajagopalan and Vazirani in On the bidirected cut relaxation for the metric Steiner tree problem, 1999). We also obtain a factor root 2 strongly polynomial algorithm for this class of graphs. A key difficulty experienced by researchers in working with the bidirected cut relaxation was that any reasonable dual growth procedure produces extremely unwieldy dual solutions. A new algorithmic idea helps finesse this difficulty-that of reducing the cost of certain edges and constructing the dual in this altered instance-and this idea can be extracted into a new technique for running the primal-dual schema in the setting of approximation algorithms.", "paper_title": "New geometry-inspired relaxations and algorithms for the metric Steiner tree problem", "paper_id": "WOS:000295785100001"}