{"auto_keywords": [{"score": 0.048186916426953504, "phrase": "serious_adverse_drug_reaction"}, {"score": 0.00481495049065317, "phrase": "citationrank"}, {"score": 0.004757087682427765, "phrase": "google_technology"}, {"score": 0.004514241562580097, "phrase": "sadr"}, {"score": 0.004318422955036175, "phrase": "well-organized_gene-oriented_sadr_information_pool"}, {"score": 0.0040485975929323, "phrase": "particular_sadr"}, {"score": 0.0036454883790271843, "phrase": "sort_genes"}, {"score": 0.003558294449586273, "phrase": "sadr_topics"}, {"score": 0.003487222504700868, "phrase": "sadr-gengle_database"}, {"score": 0.003390092184270794, "phrase": "gene-sadr_relationships"}, {"score": 0.0033493017036313783, "phrase": "pubmed"}, {"score": 0.0032559935867182035, "phrase": "six_major_sadrs"}, {"score": 0.0030895394261534776, "phrase": "stevens-johnson"}, {"score": 0.0029913511336659327, "phrase": "citationrank_algorithm"}, {"score": 0.002896274285996145, "phrase": "google_pagerank_algorithm"}, {"score": 0.002639385610609024, "phrase": "sadr-related_genes"}, {"score": 0.0025866199378466754, "phrase": "extraneous_noise"}, {"score": 0.002357131515622894, "phrase": "google-type_system"}, {"score": 0.002263799931018574, "phrase": "sadr_topic"}, {"score": 0.0021566565951738658, "phrase": "visualized_gene-gene_knowledge_chain_networks"}], "paper_keywords": [""], "paper_abstract": "Motivation: Serious adverse drug reaction (SADR) is an urgent, world-wide problem. In the absence of any well-organized gene-oriented SADR information pool, a database should be constructed. Since the importance of a gene to a particular SADR cannot simply be defined in terms of how frequently the two are cited together in the literature, an algorithm should be devised to sort genes according to their relevance to the SADR topics. Results: The SADR-Gengle database, which is made up of gene-SADR relationships extracted from Pubmed, has been constructed, covering six major SADRs, namely cholestasis, deafness, muscle toxicity, QT prolongation, Stevens-Johnson syndrome and torsades de points. The CitationRank algorithm, which inherits the principle of the Google PageRank algorithm that a gene should be highly ranked when biologically related to other highly ranked genes, is devised. The algorithm performs robustly in recovering SADR-related genes in the presence of extraneous noise, and the use of the algorithm has been extended to sorting genes in our database. Users can browse genes in a Google-type system where genes are ordered according to their descending relevance to the SADR topic selected by the user. The database also provides users with visualized gene-gene knowledge chain networks, helping them to systematize their gene-oriented knowledge chain whilst navigating these networks.", "paper_title": "A CitationRank algorithm inheriting Google technology designed to highlight genes responsible for serious adverse drug reaction", "paper_id": "WOS:000269196000015"}