{"auto_keywords": [{"score": 0.03049551493204858, "phrase": "proposed_algorithm"}, {"score": 0.015350666900671116, "phrase": "process_planning"}, {"score": 0.00481495049065317, "phrase": "multi-objective_integrated_process_planning_and_scheduling"}, {"score": 0.004437349839203418, "phrase": "modern_manufacturing_system"}, {"score": 0.004089239912167375, "phrase": "whole_manufacturing_system"}, {"score": 0.003992129945230457, "phrase": "multi-objective_optimization_problem"}, {"score": 0.0038973170902076707, "phrase": "manufacturing_system"}, {"score": 0.0037683358267785435, "phrase": "effective_genetic_algorithm"}, {"score": 0.0036611708297251645, "phrase": "multi-objective_integrated_process_planning"}, {"score": 0.003199864072042816, "phrase": "total_machine_workload"}, {"score": 0.003169222811082848, "phrase": "maximal_machine_workload"}, {"score": 0.0029627701619228527, "phrase": "multi-objective_ipps"}, {"score": 0.0027697290872182477, "phrase": "effective_genetic_operations"}, {"score": 0.002677964894127131, "phrase": "pareto_set"}, {"score": 0.002527654365712841, "phrase": "searching_procedure"}, {"score": 0.002273605493468005, "phrase": "experiment_results"}, {"score": 0.002198242191529979, "phrase": "multi-objective_ipps_problem"}, {"score": 0.0021049977753042253, "phrase": "good_solutions"}], "paper_keywords": ["Integrated process planning and scheduling", " Multi-objective optimization", " Genetic algorithm"], "paper_abstract": "Process planning and scheduling are two of the most important functions in modern manufacturing system. Considering their complementarity, integrating them more tightly can improve the performance and productivity of the whole manufacturing system. Meanwhile, the multi-objective optimization problem is widespread existing in manufacturing system. In this paper, an effective genetic algorithm is proposed to optimize the multi-objective integrated process planning and scheduling (IPPS) problem with various flexibilities in process planning. Three types of flexibilities related to process, sequence and machine are considered. And three objectives including makespan, total machine workload and maximal machine workload are taken into account simultaneously. According to the model and characteristics of multi-objective IPPS, the framework of the proposed algorithm is designed to optimize three objectives simultaneously. Effective genetic operations are employed in the proposed algorithm. Pareto set is set to store and maintain the solutions obtained during the searching procedure, the proposed algorithm could get several Pareto optimal solutions during one searching process. Two experiments are employed to test the performance of the proposed algorithm. The experiment results show that the proposed algorithm can solve multi-objective IPPS problem with various flexibilities in process planning effectively and obtain good solutions.", "paper_title": "An Effective Genetic Algorithm for Multi-objective Integrated Process Planning and Scheduling with Various Flexibilities in Process Planning", "paper_id": "WOS:000350212400004"}