{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_dictionary_attacks"}, {"score": 0.006438040445419063, "phrase": "challenge-response_system"}, {"score": 0.004698000536608171, "phrase": "authenticating_users"}, {"score": 0.004257806363128601, "phrase": "dictionary_attacks"}, {"score": 0.004195418010131832, "phrase": "offline_dictionary_attacks"}, {"score": 0.003916098498242888, "phrase": "successful_protocol_execution"}, {"score": 0.003820896867623235, "phrase": "communication_channel"}, {"score": 0.0036733470451885465, "phrase": "public_key_cryptography"}, {"score": 0.003462599815177726, "phrase": "satisfactory_solution"}, {"score": 0.0032639039638211347, "phrase": "authentication_protocol"}, {"score": 0.0031377955308198634, "phrase": "infrastructural_changes"}, {"score": 0.002680114113899346, "phrase": "genuine_user"}, {"score": 0.0024405312482831646, "phrase": "authentication_requests"}, {"score": 0.0023694065215394593, "phrase": "online_dictionary_attack"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["authentication online dictionary attacks", " hash functions", " cryptographic protocol", " passwords"], "paper_abstract": "The most popular method of authenticating users is through passwords. Though passwords are the most convenient means of authentication, they bring along themselves the threat of dictionary attacks. While offline dictionary attacks are possible only if the adversary is able to collect data for a successful protocol execution by eavesdropping on the communication channel and can be successfully countered by using public key cryptography, online dictionary attacks can be performed by anyone and there is no satisfactory solution to counter them. In this paper, we propose an authentication protocol which is easy to implement without any infrastructural changes and yet prevents online dictionary attacks. our protocol uses only one way hash functions and eliminates online dictionary attacks by implementing a challenge-response system. This challenge-response system is designed in a fashion that it hardly poses any difficulty to a genuine user but is extremely burdensome, time consuming and computationally intensive for an adversary trying to launch as many as hundreds of thousands of authentication requests as in case of an online dictionary attack. The protocol is perfectly stateless and thus less vulnerable to denial of service (DOS) attacks. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "A new protocol to counter online dictionary attacks", "paper_id": "WOS:000236533000020"}