{"auto_keywords": [{"score": 0.041367212659941505, "phrase": "service_developers"}, {"score": 0.038182416208762074, "phrase": "wide_variety"}, {"score": 0.027873010773457767, "phrase": "constrained_devices"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_devices"}, {"score": 0.004638354165775803, "phrase": "constrained_internet"}, {"score": 0.004250969091124481, "phrase": "multiple_iot_application_domains"}, {"score": 0.004077995480957875, "phrase": "efficiency_gains"}, {"score": 0.004010785080336424, "phrase": "iot._today"}, {"score": 0.0038157022294338454, "phrase": "existing_iot_systems"}, {"score": 0.003600022318864217, "phrase": "network_connectivity_options"}, {"score": 0.0032990689963715127, "phrase": "service_developer"}, {"score": 0.0030995835539697893, "phrase": "multiple_options"}, {"score": 0.00286407451582299, "phrase": "cloud-based_platform"}, {"score": 0.002828556054338357, "phrase": "heterogeneous_constrained_iot_devices"}, {"score": 0.002559775585192185, "phrase": "tangible_benefit"}, {"score": 0.0025385621498128243, "phrase": "service_integration"}, {"score": 0.002517524071220657, "phrase": "low-resource_iot_devices"}, {"score": 0.0023651843133643785, "phrase": "management_dashboard"}, {"score": 0.002268769196700254, "phrase": "presented_platform"}, {"score": 0.0021049977753042253, "phrase": "iot_application_domains"}], "paper_keywords": [""], "paper_abstract": "As the Internet of Things continues to expand in the coming years, the need for services that span multiple IoT application domains will continue to increase in order to realize the efficiency gains promised by the IoT. Today, however, service developers looking to add value on top of existing IoT systems are faced with very heterogeneous devices and systems. These systems implement a wide variety of network connectivity options, protocols (proprietary or standards-based), and communication methods all of which are unknown to a service developer that is new to the IoT. Even within one IoT standard, a device typically has multiple options for communicating with others. In order to alleviate service developers from these concerns, this paper presents a cloud-based platform for integrating heterogeneous constrained IoT devices and communication models into services. Our evaluation shows that the impact of our approach on the operation of constrained devices is minimal while providing a tangible benefit in service integration of low-resource IoT devices. A proof of concept demonstrates the latter by means of a control and management dashboard for constrained devices that was implemented on top of the presented platform. The results of our work enable service developers to more easily implement and deploy services that span a wide variety of IoT application domains.", "paper_title": "Integration of Heterogeneous Devices and Communication Models via the Cloud in the Constrained Internet of Things", "paper_id": "WOS:000364075200001"}