{"auto_keywords": [{"score": 0.042286973061808834, "phrase": "prior_probabilities"}, {"score": 0.032959611964887864, "phrase": "normalized_brier_distance"}, {"score": 0.03207438967850344, "phrase": "susceptibility_test_results"}, {"score": 0.00481495049065317, "phrase": "antibiogram_-_a_semi-naive_bayesian_approach"}, {"score": 0.004721485382198782, "phrase": "abg"}, {"score": 0.0046298096189358595, "phrase": "vitro_susceptibility_tests"}, {"score": 0.004389831166704716, "phrase": "institutional_cross"}, {"score": 0.004328764169068557, "phrase": "conditional_probability"}, {"score": 0.004185632403886255, "phrase": "interpretative_reading"}, {"score": 0.003990894139793398, "phrase": "institutional_abg._probabilities"}, {"score": 0.0038265753098624877, "phrase": "institutional_abgs"}, {"score": 0.003689628075766217, "phrase": "isolate_database"}, {"score": 0.0036587247965487366, "phrase": "israeli_university_hospital"}, {"score": 0.003459191419478298, "phrase": "regular_use"}, {"score": 0.0034398445347109396, "phrase": "patient_treatment"}, {"score": 0.0031979338522541054, "phrase": "institutional_cross-abg"}, {"score": 0.0029813378321133697, "phrase": "respectively_prior_probabilities"}, {"score": 0.0029646555801624563, "phrase": "posteriori_probabilities"}, {"score": 0.002858466611898155, "phrase": "different_approaches"}, {"score": 0.002834505099882888, "phrase": "posterior_susceptibilities"}, {"score": 0.00263505298504827, "phrase": "naive_bayes_method"}, {"score": 0.0026129593626748326, "phrase": "smallest_normalized_brier_distance"}, {"score": 0.0024912073108138613, "phrase": "respectively_cross-resistance"}, {"score": 0.0024427343146442284, "phrase": "cross-abg._conclusion"}, {"score": 0.002422249273477746, "phrase": "practical_method"}, {"score": 0.002388487669097511, "phrase": "antimicrobial_susceptibility"}, {"score": 0.002342008661341529, "phrase": "semi-naive_bayesian_approach"}, {"score": 0.002264420105254984, "phrase": "brier_distance"}, {"score": 0.0022141245558628263, "phrase": "significant_advantage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bayes theorem", " Bacterial infections", " Antimicrobial therapy", " Antibiogram", " Cross-resistance", " Antimicrobial Stewardship"], "paper_abstract": "Background: An antibiogram (ABG) gives the results of in vitro susceptibility tests performed on a pathogen isolated from a culture of a sample taken from blood or other tissues. The institutional cross-ABG consists of the conditional probability of susceptibility for pairs of antimicrobials. This paper explores how interpretative reading of the isolate ABG can be used to replace and improve the prior probabilities stored in the institutional ABG. Probabilities were calculated by both a naive and semi-naive Bayesian approaches, both using the ABG for the given isolate and institutional ABGs and cross-ABGs. Methods and Material: We assessed an isolate database from an Israeli university hospital with ABGs from 3347 clinically significant blood isolates, where on average 19 antimicrobials were tested for susceptibility, out of 31 antimicrobials in regular use for patient treatment. For each of 14 pathogens or groups of pathogens in the database the average (prior) probability of susceptibility (also called the institutional ABG) and the institutional cross-ABG were calculated. For each isolate, the normalized Brier distance was used as a measure of the distance between susceptibility test results from the isolate ABG and respectively prior probabilities and posteriori probabilities of susceptibility. We used a 5-fold cross-validation to evaluate the performance of different approaches to predict posterior susceptibilities. Results: The normalized Brier distance between the prior probabilities and the susceptibility test results for all isolates in the database was reduced from 37.7% to 28.2% by the naive Bayes method. The smallest normalized Brier distance of 253% was obtained with the semi-naive min2max2 method, which uses the two smallest significant odds ratios and the two largest significant odds ratios expressing respectively cross-resistance and cross-susceptibility, calculated from the cross-ABG. Conclusion: A practical method for predicting probability for antimicrobial susceptibility could be developed based on a semi-naive Bayesian approach using statistical data on cross-susceptibilities and cross-resistances. The reduction in Brier distance from 37.7% to 25.3%, indicates a significant advantage to the proposed min2max2 method (p<10(99)). (C) 2015 The Authors. Published by Elsevier B.V.", "paper_title": "Interpretative reading of the antibiogram - a semi-naive Bayesian approach", "paper_id": "WOS:000366069500003"}