{"auto_keywords": [{"score": 0.023219631453777926, "phrase": "data_sets"}, {"score": 0.00481495049065317, "phrase": "classification_performance"}, {"score": 0.0046046429665581555, "phrase": "new_classification_rule"}, {"score": 0.004419904580451831, "phrase": "real_data_sets"}, {"score": 0.004322267755421529, "phrase": "high-dimensional_studies"}, {"score": 0.004242546312843817, "phrase": "gene-expression_microarrays"}, {"score": 0.004195418010131832, "phrase": "small_samples"}, {"score": 0.004087469540575263, "phrase": "feature_selection"}, {"score": 0.0040571383470418085, "phrase": "error_estimation"}, {"score": 0.004027031316965272, "phrase": "individual_reported_performances"}, {"score": 0.0038798015183611275, "phrase": "best_test_results"}, {"score": 0.0037101871762082153, "phrase": "overall_performance"}, {"score": 0.0036689507925299885, "phrase": "proposed_procedure"}, {"score": 0.0034437574674180365, "phrase": "large_simulation_study"}, {"score": 0.0033054391731615618, "phrase": "different_reporting_biases"}, {"score": 0.002613487968156893, "phrase": "extremely_large_amount"}, {"score": 0.0024529174827030787, "phrase": "generally_large_bias"}, {"score": 0.0021049977753042253, "phrase": "real_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: It is commonplace for authors to propose a new classification rule, either the operator construction part or feature selection, and demonstrate its performance on real data sets, which often come from high-dimensional studies, such as from gene-expression microarrays, with small samples. Owing to the variability in feature selection and error estimation, individual reported performances are highly imprecise. Hence, if only the best test results are reported, then these will be biased relative to the overall performance of the proposed procedure. Results: This article characterizes reporting bias with several statistics and computes these statistics in a large simulation study using both modeled and real data. The results appear as curves giving the different reporting biases as functions of the number of samples tested when reporting only the best or second best performance. It does this for two classification rules, linear discriminant analysis (LDA) and 3-nearest-neighbor (3NN), and for filter and wrapper feature selection, t-test and sequential forward search. These were chosen on account of their well-studied properties and because they were amenable to the extremely large amount of processing required for the simulations. The results across all the experiments are consistent: there is generally large bias overriding what would be considered a significant performance differential, when reporting the best or second best performing data set. We conclude that there needs to be a database of data sets and that, for those studies depending on real data, results should be reported for all data sets in the database.", "paper_title": "Reporting bias when using real data sets to analyze classification performance", "paper_id": "WOS:000273116100010"}