{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "enhancing_text_categorization_using"}, {"score": 0.004706895428234964, "phrase": "text_categorization_techniques"}, {"score": 0.004518442937844318, "phrase": "statistical_analysis"}, {"score": 0.004457309741979921, "phrase": "term_frequency"}, {"score": 0.0037506567448470163, "phrase": "underlying_model"}, {"score": 0.0028682668647074397, "phrase": "traditional_analysis"}, {"score": 0.002765776659294382, "phrase": "concept-based_model"}, {"score": 0.0027035833504191233, "phrase": "nonimportant_terms"}, {"score": 0.0026548344763838213, "phrase": "sentence_semantics"}, {"score": 0.0024349853033241663, "phrase": "proposed_concept-based_model"}, {"score": 0.0023802126605244438, "phrase": "text_categorization"}, {"score": 0.002305589818994465, "phrase": "traditional_models"}, {"score": 0.0022434880661725493, "phrase": "substantial_enhancement"}, {"score": 0.002213065910356615, "phrase": "categorization_quality"}, {"score": 0.0021049977753042253, "phrase": "corpus-based_concept_analysis"}], "paper_keywords": ["data mining", " text categorization", " concept-based model"], "paper_abstract": "Most of text categorization techniques are based on word and/or phrase analysis of the text. Statistical analysis of a term frequency captures the importance of the term within a document only. However, two terms can have the same frequency in there documents, but one term contributes more to the meaning of its sentences than the other term. Thus, the underlying model should identify terms that capture the semantics of text. In this case, the model can capture terms that present the concepts of the sentence, which leads to discovering the topic of the document. A new concept-based model that analyzes terms on the sentence, document, and corpus levels rather than the traditional analysis of document only is introduced. The concept-based model can effectively discriminate between nonimportant terms with respect to sentence semantics and terms which hold the concepts that represent the sentence meaning. A set of experiments using the proposed concept-based model on different datasets in text categorization is conducted in comparison with the traditional models. The results demonstrate the substantial enhancement of the categorization quality using the sentence-based, document-based and corpus-based concept analysis.", "paper_title": "AN EFFICIENT MODEL FOR ENHANCING TEXT CATEGORIZATION USING SENTENCE SEMANTICS", "paper_id": "WOS:000280359100002"}