{"auto_keywords": [{"score": 0.040691162217611467, "phrase": "collective_performance"}, {"score": 0.03932486938372318, "phrase": "client-server_model"}, {"score": 0.012393304713189857, "phrase": "authentication_protocol"}, {"score": 0.011688145078164744, "phrase": "task_assignment"}, {"score": 0.010558584908720602, "phrase": "primitive_operations"}, {"score": 0.008579947876614407, "phrase": "modeling_results"}, {"score": 0.00481495049065317, "phrase": "scalable_fingerprint_authentication"}, {"score": 0.004739773204474094, "phrase": "fingerprint_authentication_technique"}, {"score": 0.004647442352794694, "phrase": "close_range"}, {"score": 0.004398331355940011, "phrase": "remote_user_authentication"}, {"score": 0.004346704947011699, "phrase": "next_step"}, {"score": 0.004295681900150244, "phrase": "large-scale_remote_user_authentication_services"}, {"score": 0.003832198214757852, "phrase": "fingerprint_verification"}, {"score": 0.003527998934981411, "phrase": "fingerprint_authentication"}, {"score": 0.002533687835358909, "phrase": "lowest_level"}, {"score": 0.0021049977753042253, "phrase": "communication_setup_time"}], "paper_keywords": ["performance evaluation", " fingerprint verification", " authentication protocol"], "paper_abstract": "As the fingerprint authentication technique becomes widely used at close range such as for the door lock, it will be applied for the remote user authentication as the next step. For large-scale remote user authentication services such as board control using bio-passport, the real-time as well as the security/privacy requirements should be satisfied. However, nothing is known about the collective performance of the fingerprint verification and the authentication protocol on the client-server model. In this paper, we analyzed the collective performance of the task assignment of the fingerprint authentication on the client-server model. To obtain the characteristics of the workload of both the fingerprint verification and the authentication protocol, we first consider three types of primitive operations on the client and the server; fingerprint verification module, cryptography module and communication module. Then, based on these primitive operations, the workload of each scenario of the task assignment was applied to the M/D/1 queueing model representing the client-server model, and the collective performance of each scenario was analyzed quantitatively. The modeling results showed that the server could handle the lowest level of workload when the server does decryption, verification and matching. On the contrary, the server can handle 9.57 times heavier workload when the clients do decryption, verification and matching. The modeling results also showed that the workload manageable by the server depends largely on the communication setup time.", "paper_title": "Capacity planning for scalable fingerprint authentication", "paper_id": "WOS:000242122000109"}