{"auto_keywords": [{"score": 0.04616293897139308, "phrase": "cyclic_pattern"}, {"score": 0.00481495049065317, "phrase": "diurnal_oscillations"}, {"score": 0.00476697427418509, "phrase": "microarray_time_series_data"}, {"score": 0.004672444473700524, "phrase": "living_organisms"}, {"score": 0.0035292625231068517, "phrase": "biological_phenomenon"}, {"score": 0.003459191419478298, "phrase": "large_number"}, {"score": 0.0032085525502105836, "phrase": "cyanothece"}, {"score": 0.0027602925235474317, "phrase": "specific_metabolic_functional_category"}, {"score": 0.002678433668156676, "phrase": "perhaps_a_\"preferred_time"}, {"score": 0.002509284173541882, "phrase": "proposed_analysis"}, {"score": 0.0024348510123716424, "phrase": "microarray_experiments"}, {"score": 0.002398464540102246, "phrase": "varying_incident_light_patterns"}, {"score": 0.0022133711375320266, "phrase": "central_master_clock"}, {"score": 0.0021049977753042253, "phrase": "circadian-controlled_genes"}], "paper_keywords": ["Gene expression", " circadian rhythm", " microarray time series", " diurnal cycle", " phase oscillation", " cyanothece", " KaiC protein", " oscillator network"], "paper_abstract": "Behavior of living organisms is strongly modulated by the day and night cycle giving rise to a cyclic pattern of activities. Such a pattern helps the organisms to coordinate their activities and maintain a balance between what could be performed during the \"day\" and what could be relegated to the \"night.\" This cyclic pattern, called the \"Circadian Rhythm,\" is a biological phenomenon observed in a large number of organisms. In this paper, our goal is to analyze transcriptome data from Cyanothece for the purpose of discovering genes whose expressions are rhythmic. We cluster these genes into groups that are close in terms of their phases and show that genes from a specific metabolic functional category are tightly clustered, indicating perhaps a \"preferred time of the day/night\" when the organism performs this function. The proposed analysis is applied to two sets of microarray experiments performed under varying incident light patterns. Subsequently, we propose a model with a network of three phase oscillators together with a central master clock and use it to approximate a set of \" circadian-controlled genes\" that can be approximated closely.", "paper_title": "Identification and Modeling of Genes with Diurnal Oscillations from Microarray Time Series Data", "paper_id": "WOS:000283926400010"}