{"auto_keywords": [{"score": 0.04351879568458235, "phrase": "abc"}, {"score": 0.010437883116587294, "phrase": "discretely_observed_markov_models"}, {"score": 0.007769647012458398, "phrase": "posterior_density"}, {"score": 0.006197780035610447, "phrase": "abc_samples"}, {"score": 0.005935434289031934, "phrase": "gaussian_approximation"}, {"score": 0.005703079539988721, "phrase": "kernel_density_estimate"}, {"score": 0.00481495049065317, "phrase": "piecewise_approximate_bayesian_computation"}, {"score": 0.004688321299229397, "phrase": "factorised_posterior_distribution"}, {"score": 0.004595529592539951, "phrase": "complicated_stochastic_models"}, {"score": 0.0045346863560033175, "phrase": "likelihood_function"}, {"score": 0.004256455007398593, "phrase": "bayesian_inference"}, {"score": 0.004186105377259855, "phrase": "approximate_bayesian_computation"}, {"score": 0.004021954624114115, "phrase": "abc_methodology"}, {"score": 0.003955465362027017, "phrase": "computational_cost"}, {"score": 0.0038642157757169315, "phrase": "summary_statistics"}, {"score": 0.003651245743840663, "phrase": "new_\"piecewise"}, {"score": 0.00306973798582805, "phrase": "summary_statistic"}, {"score": 0.0030189426536422577, "phrase": "stringent_tolerance"}, {"score": 0.002295964130868963, "phrase": "true_piecewise"}, {"score": 0.002183776628088228, "phrase": "piecewise_abc_approach"}, {"score": 0.0021049977753042253, "phrase": "fast_and_accurate_inference"}], "paper_keywords": ["Approximate Bayesian Computation", " Simulation", " Stochastic Lotka-Volterra"], "paper_abstract": "Many modern statistical applications involve inference for complicated stochastic models for which the likelihood function is difficult or even impossible to calculate, and hence conventional likelihood-based inferential techniques cannot be used. In such settings, Bayesian inference can be performed using Approximate Bayesian Computation (ABC). However, in spite of many recent developments to ABC methodology, in many applications the computational cost of ABC necessitates the choice of summary statistics and tolerances that can potentially severely bias the estimate of the posterior. We propose a new \"piecewise\" ABC approach suitable for discretely observed Markov models that involves writing the posterior density of the parameters as a product of factors, each a function of only a subset of the data, and then using ABC within each factor. The approach has the advantage of side-stepping the need to choose a summary statistic and it enables a stringent tolerance to be set, making the posterior \"less approximate\". We investigate two methods for estimating the posterior density based on ABC samples for each of the factors: the first is to use a Gaussian approximation for each factor, and the second is to use a kernel density estimate. Both methods have their merits. The Gaussian approximation is simple, fast, and probably adequate for many applications. On the other hand, using instead a kernel density estimate has the benefit of consistently estimating the true piecewise ABC posterior as the number of ABC samples tends to infinity. We illustrate the piecewise ABC approach with four examples; in each case, the approach offers fast and accurate inference.", "paper_title": "Piecewise Approximate Bayesian Computation: fast inference for discretely observed Markov models using a factorised posterior distribution", "paper_id": "WOS:000349551100009"}