{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "appropriate_trade-offs"}, {"score": 0.015163796190289671, "phrase": "desirability-based_multiobjective_optimization"}, {"score": 0.004476878957065829, "phrase": "promising_therapeutic_option"}, {"score": 0.004348363291608004, "phrase": "virus-nnrtis_resistance"}, {"score": 0.004254393078576148, "phrase": "major_problem"}, {"score": 0.004102248600058478, "phrase": "\"knock-out\"_strategy"}, {"score": 0.003912533878506028, "phrase": "high_drug_or_drug-drug_concentrations"}, {"score": 0.0034692911858848893, "phrase": "combined_strategy"}, {"score": 0.003406646907682766, "phrase": "moop"}, {"score": 0.0031671412657333364, "phrase": "toxic_effects"}, {"score": 0.0030986183831544487, "phrase": "moop_process"}, {"score": 0.003064913196639932, "phrase": "theoretical_levels"}, {"score": 0.0030315735229977958, "phrase": "predictive_variables"}, {"score": 0.0029768089698126547, "phrase": "desirable_ri_inhibitor_candidate"}, {"score": 0.0029444248503861167, "phrase": "best_possible_compromise"}, {"score": 0.0026976845075643314, "phrase": "similarity-based_structural_criterion"}, {"score": 0.0026586145364395544, "phrase": "ranking_quality"}, {"score": 0.002582159550634798, "phrase": "comparative_study"}, {"score": 0.002391739069644444, "phrase": "nnrtis"}, {"score": 0.0022976536579329514, "phrase": "fully_optimized_hits"}, {"score": 0.0021049977753042253, "phrase": "successful_antiretroviral_drug"}], "paper_keywords": ["Drug discovery", " HIV-1", " NNRTI", " Multiobjective optimization", " Virtual screening"], "paper_abstract": "Nonnucleoside reverse transcriptase (RT) inhibitors (NNRTIs) constitute a promising therapeutic option for AIDS. However, the emergence of virus-NNRTIs resistance was found to be a major problem in the field. Toward that goal, a \"knock-out\" strategy stands out between the several options to circumvent the problem. However the high drug or drug-drug concentrations often used generate additional safety concerns. The need for approaches able to early integrate drug- or lead-likeness, toxicity and bioavailability criteria in the drug discovery phase is an emergent issue. Given that, we propose a combined strategy based on desirability-based multiobjective optimization (MOOP) and ranking for the prioritization of HIV-1 NNRTIs hits with appropriate trade-offs between inhibitory efficacy over the HIV-1 RI and toxic effects over MT4 blood cells. Through the MOOP process, the theoretical levels of the predictive variables required to reach a desirable RI inhibitor candidate with the best possible compromise between efficacy and safety were found. This information is used as a pattern to rank the library of compounds according to a similarity-based structural criterion, providing a ranking quality of 64%/71 %/73% in training/validation/test set. A comparative study between the sequential, parallel and multiobjective virtual screening revealed that the multiobjective approach can outperform the other approaches. These results suggest that the identification of NNRTIs hits with appropriate trade-offs between potency and safety, rather than fully optimized hits solely based on potency, can facilitate the hit to lead transition and increase the likelihood of the candidate to evolve into a successful antiretroviral drug.", "paper_title": "Prioritizing Hits with Appropriate Trade-Offs Between HIV-1 Reverse Transcriptase Inhibitory Efficacy and MT4 Blood Cells Toxicity Through Desirability-Based Multiobjective Optimization and Ranking", "paper_id": "WOS:000277596900006"}