{"auto_keywords": [{"score": 0.03387930915494381, "phrase": "p-symmetric_measures"}, {"score": 0.02322730111336097, "phrase": "fuzzy_measures"}, {"score": 0.022032500252406953, "phrase": "order_polytope"}, {"score": 0.010207623031439817, "phrase": "adjacency_structure"}, {"score": 0.004240116703465252, "phrase": "corresponding_order"}, {"score": 0.003998380230709541, "phrase": "original_poset"}, {"score": 0.0037336520904376687, "phrase": "quadratic_time"}, {"score": 0.0035379628447303703, "phrase": "particular_cases"}, {"score": 0.003503497128638102, "phrase": "order_polytopes"}, {"score": 0.0024264776194357993, "phrase": "direct_product"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Order polytope", " Adjacency", " Fuzzy measures", " p-symmetric measures"], "paper_abstract": "In this paper we study the adjacency structure of the order polytope of a poset. For a given poset, we determine whether two vertices in the corresponding order polytope are adjacent. This is done through filters in the original poset. We also prove that checking adjacency between two vertices can be done in quadratic time on the number of elements of the poset. As particular cases of order polytopes, we recover the adjacency structure of the set of fuzzy measures and obtain it for the set of p-symmetric measures for a given indifference partition: moreover, we show that the set of p-symmetric measures can be seen as the order polytope of a quotient set of the poset leading to fuzzy measures. From this property, we obtain the diameter of the set of p-symmetric measures. Finally, considering the set of p-symmetric measures as the order polytope of a direct product of chains, we obtain some other properties of these measures, as bounds on the volume and the number of vertices on certain cases. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Adjacency on the order polytope with applications to the theory of fuzzy measures", "paper_id": "WOS:000277443000001"}