{"auto_keywords": [{"score": 0.039434146520232714, "phrase": "dynamic_noise"}, {"score": 0.010612387000973441, "phrase": "distributed_tsv_topology"}, {"score": 0.004494570360108983, "phrase": "energy_consumption"}, {"score": 0.0036942726653704213, "phrase": "straightforward_extension"}, {"score": 0.0036553070575015344, "phrase": "traditional_design_techniques"}, {"score": 0.0036167509502276294, "phrase": "previous_work"}, {"score": 0.0034118234596993836, "phrase": "silicon_vias"}, {"score": 0.0031845067058084583, "phrase": "smaller_size"}, {"score": 0.0030521898646210413, "phrase": "significant_reduction"}, {"score": 0.0024553821147953463, "phrase": "power_distribution_network"}, {"score": 0.0023532890136269986, "phrase": "scaling_trends"}, {"score": 0.0023038418282549274, "phrase": "increased_stacking"}, {"score": 0.002279508335630797, "phrase": "power_distribution_tsvs"}], "paper_keywords": ["3-D", " inductive noise", " power supply network", " through-silicon via (TSV)"], "paper_abstract": "3-D integration has the potential to increase performance and decrease energy consumption. However, there are many unsolved issues in the design of these systems. In this work we study the design of 3-D power supply networks and demonstrate a technique specific to 3-D systems that improves IR-drop and dynamic noise over a straightforward extension of traditional design techniques. Previous work in 3-D power delivery network design has simply extended 2-D techniques by treating through-silicon vias (TSVs) as extensions of the C4 bumps. By exploiting the smaller size and much higher interconnect density possible with TSVs we demonstrate significant reduction of nearly 50% in the IR-drop and 42% in the dynamic noise of our large-scale 3-D design. Simulations also show that a 3-tier stack with the distributed TSV topology actually lowers IR-drop by 21% and dynamic noise by 32% over a non-3-D system with less power dissipation. We analyze the power distribution network of an envisioned 1000-core processor with 30 stacked dies and show scaling trends related to both increased stacking and power distribution TSVs. Finally, we examine several techniques for minimizing IR-drop and dynamic noise and their effects on our large-scale 3-D system.", "paper_title": "Distributed TSV Topology for 3-D Power-Supply Networks", "paper_id": "WOS:000307125500013"}