{"auto_keywords": [{"score": 0.037945151553555774, "phrase": "differentially_expressed_genes"}, {"score": 0.008089323074233894, "phrase": "microarray_experiment"}, {"score": 0.006543842979615044, "phrase": "proposed_model"}, {"score": 0.00481495049065317, "phrase": "multiple_microarrays"}, {"score": 0.004719359108879602, "phrase": "controlling_variables"}, {"score": 0.004533806239310673, "phrase": "expression_levels"}, {"score": 0.00432070565627091, "phrase": "experiment_increases"}, {"score": 0.004117579919425373, "phrase": "different_laboratories"}, {"score": 0.003939748053452577, "phrase": "microarray_data"}, {"score": 0.0038614646772981848, "phrase": "combined_conclusion"}, {"score": 0.0037095162593960727, "phrase": "main_objectives"}, {"score": 0.0035635256137029592, "phrase": "different_experimental_groups"}, {"score": 0.003171740347925348, "phrase": "usual_anova_model"}, {"score": 0.003108669771132255, "phrase": "additional_variability"}, {"score": 0.0029982770062678926, "phrase": "different_hospitals"}, {"score": 0.0029268619875960715, "phrase": "two-stage_anova_model"}, {"score": 0.0027446057983474994, "phrase": "second_stage"}, {"score": 0.0026577673946415583, "phrase": "experimental_groups"}, {"score": 0.0025840347813610815, "phrase": "first_stage"}, {"score": 0.0024822279007111255, "phrase": "permutation_test"}, {"score": 0.0022904619303011097, "phrase": "proposed_approach"}, {"score": 0.002165091261117016, "phrase": "individual_covariates"}, {"score": 0.0021049977753042253, "phrase": "meta-analysis_approach"}], "paper_keywords": [""], "paper_abstract": "Motivation: Microarray technology enables the monitoring of expression levels for thousands of genes simultaneously. When the magnitude of the experiment increases, it becomes common to use the same type of microarrays from different laboratories or hospitals. Thus, it is important to analyze microarray data together to derive a combined conclusion after accounting for the differences. One of the main objectives of the microarray experiment is to identify differentially expressed genes among the different experimental groups. The analysis of variance (ANOVA) model has been commonly used to detect differentially expressed genes after accounting for the sources of variation commonly observed in the microarray experiment. Results: We extended the usual ANOVA model to account for an additional variability resulting from many confounding variables such as the effect of different hospitals. The proposed model is a two-stage ANOVA model. The first stage is the adjustment for the effects of no interests. The second stage is the detection of differentially expressed genes among the experimental groups using the residuals obtained from the first stage. Based on these residuals, we propose a permutation test to detect the differentially expressed genes. The proposed model is illustrated using the data from 133 microarrays collected at three different hospitals. The proposed approach is more flexible to use, and it is easier to accommodate the individual covariates in this model than using the meta-analysis approach. Availability: A set of programs written in R will be electronically sent upon request.", "paper_title": "Combining multiple microarrays in the presence of controlling variables", "paper_id": "WOS:000239725900002"}