{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "air_cargo_industry"}, {"score": 0.004555028829645471, "phrase": "multi-agent-based_framework"}, {"score": 0.0039040344230094164, "phrase": "software_agent-based_flight_planning_module"}, {"score": 0.003738973626996355, "phrase": "rfid-based_warehouse_management_system"}, {"score": 0.003558830226733501, "phrase": "freight_forwarder's_warehouse"}, {"score": 0.0034083145672246067, "phrase": "night_plans"}, {"score": 0.0031260524791486347, "phrase": "simulated_annealing_optimization_engines"}, {"score": 0.0030497740719977835, "phrase": "time-consuming_tasks"}, {"score": 0.0028848643090508205, "phrase": "latest_flight_plans"}, {"score": 0.002487296495786493, "phrase": "operation_steps"}, {"score": 0.0021845387990972543, "phrase": "better_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-agent system", " Logistics", " Air cargo", " Simulated annealing"], "paper_abstract": "In this paper, we propose a multi-agent-based framework to facilitate process automation for the air cargo industry. The focus is on enhancing two labor-intensive flight planning processes, namely cargo consolidation and equalization. By employing a software agent-based flight planning module, which is linked with an RFID-based warehouse management system, air cargo items received at a freight forwarder's warehouse can be processed more efficiently and night plans can be generated automatically. In particular, we employ agents equipped with simulated annealing optimization engines to handle the time-consuming tasks of optimization. By doing so, the latest flight plans can be generated more efficiently. The system has been evaluated experimentally by both simulated and real-life data. The results are encouraging. For example, operation steps that normally require over 30 minutes to complete can now be carried out in as quickly as two minutes, and produce a better solution. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Agent-based flight planning system for enhancing the competitiveness of the air cargo industry", "paper_id": "WOS:000305204600001"}