{"auto_keywords": [{"score": 0.03953876560784093, "phrase": "static_geometry"}, {"score": 0.015615208559724942, "phrase": "navigation_meshes"}, {"score": 0.013258128183850441, "phrase": "way_points"}, {"score": 0.010417928922739163, "phrase": "collision_free_paths"}, {"score": 0.00481495049065317, "phrase": "agents'_sizes"}, {"score": 0.004686791459644141, "phrase": "crowd_simulation"}, {"score": 0.004623990904432388, "phrase": "mesh_design"}, {"score": 0.004440570928903645, "phrase": "navigation_mesh"}, {"score": 0.0035779805381654438, "phrase": "full_length"}, {"score": 0.0034944094552943, "phrase": "novel_method"}, {"score": 0.003412783661090541, "phrase": "current_trajectory"}, {"score": 0.0032332756920184177, "phrase": "different_way_points"}, {"score": 0.0028824650336365465, "phrase": "new_method"}, {"score": 0.0027867024825194834, "phrase": "dynamically_assigned_way_points"}, {"score": 0.0026045914281028473, "phrase": "new_version"}, {"score": 0.002526561920777972, "phrase": "larger_number"}, {"score": 0.002385479082527538, "phrase": "exact_clearance"}, {"score": 0.0023694065215394593, "phrase": "dynamic_way"}, {"score": 0.002345500021653278, "phrase": "local_movement"}, {"score": 0.002155412043665635, "phrase": "traditional_way_points"}, {"score": 0.0021049977753042253, "phrase": "better_use"}], "paper_keywords": ["Clearance", " Navigation meshes", " Dynamic way points"], "paper_abstract": "There are two frequent artifacts in crowd simulation caused by navigation mesh design. The first appears when all agents attempt to traverse the navigation mesh and share the same way points through portals, thus increasing the probability of collisions with other agents or queues forming around portals. The second is caused by way points being assigned at locations where clearance is not guaranteed, which causes the agents to either walk too close to the static geometry, slide along walls or get stuck. To overcome this we use the full length of the portal and propose a novel method for dynamically calculating way points based on current trajectory, destination, and clearance, therefore guaranteeing that agents in a crowd will have different way points assigned. To achieve collision free paths we propose two novel techniques: the first provides the computation of paths with clearance for cells of any shape (even with concavities) and the second presents a new method for calculating portals with clearance, so that the dynamically assigned way points will always guarantee collision free paths relative to the static geometry. In this paper, we extend our previous work by describing a new version of the algorithm that is suitable for a larger number of navigation meshes, while further improving performance. Our results show how the combination of portals with exact clearance and dynamic way points improve local movement by reducing the number of collision between agents and the static geometry. We evaluate our algorithm with a variety of scenarios and compare our results with traditional way points to show that our technique also offers better use of the space by the agents. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Clearance for diversity of agents' sizes in navigation meshes", "paper_id": "WOS:000351785600005"}