{"auto_keywords": [{"score": 0.04717766219733611, "phrase": "upper-limb_kinematics"}, {"score": 0.00481495049065317, "phrase": "inertial_and_magnetic_sensors"}, {"score": 0.0047797212183363835, "phrase": "inertial_and_magnetic_measurement_systems"}, {"score": 0.004675565200598801, "phrase": "new_generation"}, {"score": 0.004641351004344458, "phrase": "motion_analysis_systems"}, {"score": 0.004360412703519539, "phrase": "xsens_technologies"}, {"score": 0.004328612998179315, "phrase": "nl"}, {"score": 0.003820144626025562, "phrase": "single-joint-angle_movements"}, {"score": 0.003510439768484619, "phrase": "literature_results"}, {"score": 0.0031553611552558986, "phrase": "six_tasks"}, {"score": 0.003030247482854539, "phrase": "optoelectronic_system"}, {"score": 0.002920805294420291, "phrase": "rms_error"}, {"score": 0.0028993944292191433, "phrase": "correlation_coefficient"}, {"score": 0.0027036380093304747, "phrase": "protocol_validity"}, {"score": 0.0026155681847364483, "phrase": "joint_angles"}, {"score": 0.002521064923851732, "phrase": "rms_errors"}, {"score": 0.0021049977753042253, "phrase": "ambulatory_settings"}], "paper_keywords": ["shoulder", " elbow", " kinematics", " inertial and magnetic sensors", " ambulatory measurement"], "paper_abstract": "Inertial and magnetic measurement systems (IMMSs) are a new generation of motion analysis systems which may diffuse the measurement of upper-limb kinematics to ambulatory settings. Based on the MT9B IMMS (Xsens Technologies, NL), we therefore developed a protocol that measures the scapulothoracic, humerothoracic and elbow 3D kinematics. To preliminarily evaluate the protocol, a 23-year-old subject performed six tasks involving shoulder and elbow single-joint-angle movements. Criteria for protocol validity were limited cross-talk with the other joint-angles during each task; scapulohumeral-rhythm close to literature results; and constant carrying-angle. To assess the accuracy of the MT9B when measuring the upper-limb kinematics through the protocol, we compared the MT9B estimations during the six tasks, plus other four, with the estimations of an optoelectronic system (the gold standard), in terms of RMS error, correlation coefficient (r), and the amplitude ratio (m). Results indicate that the criteria for protocol validity were met for all tasks. For the joint angles mainly involved in each movement, the MT9B estimations presented RMS errors < 3.6, r > 0.99 and 0.9 < m < 1.09. It appears therefore that (1) the protocol in combination with the MT9B is valid for, and (2) the MT9B in combination with the protocol is accurate when, measuring shoulder and elbow kinematics, during the tasks tested, in ambulatory settings.", "paper_title": "Ambulatory measurement of shoulder and elbow kinematics through inertial and magnetic sensors", "paper_id": "WOS:000252889300008"}