{"auto_keywords": [{"score": 0.04922330296681037, "phrase": "computational_problem"}, {"score": 0.03998618808716689, "phrase": "simulation_game"}, {"score": 0.02322730111336099, "phrase": "simulation_games"}, {"score": 0.009597916385080025, "phrase": "flow_learning_experience"}, {"score": 0.004447509888681154, "phrase": "discovery_processes"}, {"score": 0.0042436501739199495, "phrase": "learning_experiences"}, {"score": 0.003392363211686023, "phrase": "traditional_lectures"}, {"score": 0.0033557940171476683, "phrase": "students'_intrinsic_motivation"}, {"score": 0.003110579040263398, "phrase": "close_association"}, {"score": 0.003077038060542514, "phrase": "students'_learning_experience_states"}, {"score": 0.0029464414592923196, "phrase": "flow_experience_state"}, {"score": 0.002801047964786189, "phrase": "analytical_reasoning_strategies"}, {"score": 0.0023804491500749106, "phrase": "learning-by-example_strategy"}, {"score": 0.002320943211698446, "phrase": "flow_state"}, {"score": 0.002151183757599893, "phrase": "superficial_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Game-based learning", " Problem solving", " Simulation", " Flow experience"], "paper_abstract": "Simulation games are now increasingly applied to many subject domains as they allow students to engage in discovery processes, and may facilitate a flow learning experience. However, the relationship between learning experiences and problem solving strategies in simulation games still remains unclear in the literature. This study, thus, analyzed the feedback and problem solving behaviors of 117 students in a simulation game, designed to assist them to learn computational problem solving. It was found that students when learning computational problem solving with the game were more likely to perceive a flow learning experience than in traditional lectures. The students' intrinsic motivation was also enhanced when they learned with the simulation game. In particular, the results of the study found a close association between the students' learning experience states and their problem solving strategies. The students who perceived a flow experience state frequently applied trial-and-error, learning-by-example, and analytical reasoning strategies to learn the computational problem solving skills. However, a certain portion of students who experienced states of boredom and anxiety did not demonstrate in-depth problem solving strategies. For instance, the students who felt anxious in the simulation game did not apply the learning-by-example strategy as frequently as those in the flow state. In addition, the students who felt bored in the simulation game only learned to solve the problem at a superficial level. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of simulation games on the learning of computational problem solving", "paper_id": "WOS:000294099000006"}