{"auto_keywords": [{"score": 0.03738133313641756, "phrase": "black_hole"}, {"score": 0.03057034786717778, "phrase": "black_hole_search_problem"}, {"score": 0.029798932888724827, "phrase": "polynomial_number"}, {"score": 0.00481495049065317, "phrase": "unknown_dangerous_graph"}, {"score": 0.004641351004344458, "phrase": "g._unaware"}, {"score": 0.004604969434921559, "phrase": "graph_topology"}, {"score": 0.00438105507792004, "phrase": "graph_exploration"}, {"score": 0.0043128645442473785, "phrase": "shannon"}, {"score": 0.004102865227227444, "phrase": "existing_investigations"}, {"score": 0.003954837422946628, "phrase": "vast_majority"}, {"score": 0.003762415923844781, "phrase": "exploration_problem"}, {"score": 0.00347740824437241, "phrase": "incoming_agent"}, {"score": 0.003441069696100277, "phrase": "observable_trace"}, {"score": 0.00308163068747474, "phrase": "black_hole_search"}, {"score": 0.0029938442475631946, "phrase": "powerful_inter-agent_communication_mechanisms"}, {"score": 0.0028405715222684183, "phrase": "optimal_team_size"}, {"score": 0.0022777800735119405, "phrase": "optimal_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph exploration", " Black hole search", " Tokens", " Mobile agent algorithms", " Distributed algorithms"], "paper_abstract": "Consider a team of (one or more) mobile agents operating in a graph G. Unaware of the graph topology and starting from the same node, the team must explore the graph. This problem, known as graph exploration, was initially formulated by Shannon in 1951, and has been extensively studied since under a variety of conditions. Most of the existing investigations have assumed that the network is safe for the agents, and the vast majority of the solutions presented in the literature succeed in their task only under this assumption. Recently, the exploration problem has been examined also when the network is unsafe. The danger examined is the presence in the network of a black hole, a node that disposes of any incoming agent without leaving any observable trace of this destruction. The goal is for at least one agent to survive and to have all the surviving agents to construct a map of the network, indicating the edges leading to the black hole. This variant of the problem is also known as a black hole search. This problem has been investigated for the most part assuming powerful inter-agent communication mechanisms: whiteboards at all nodes. Indeed, in this model, the black hole search problem can be solved with an optimal team size and performing a polynomial number of moves. In this paper, we consider the less powerful enhanced token model: each agent has available a token that can be carried, placed on a node or on a link, and can be removed from it. All tokens are identical and no other form of marking or communication is available. We constructively prove that the black hole search problem can be solved also in this model; furthermore, this can be done using a team of agents of optimal size and performing a polynomial number of moves. Our algorithm works even if the agents are asynchronous and if both the agents and the nodes are anonymous. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Exploring an unknown dangerous graph using tokens", "paper_id": "WOS:000315754000003"}