{"auto_keywords": [{"score": 0.04799755018493269, "phrase": "context-dependent_term_weights"}, {"score": 0.03292105678481787, "phrase": "new_term_weights"}, {"score": 0.00481495049065317, "phrase": "relevance_information"}, {"score": 0.004646852519870358, "phrase": "new_class"}, {"score": 0.00446471538346719, "phrase": "traditional_term"}, {"score": 0.00421410521089045, "phrase": "new_weighting"}, {"score": 0.004158290806404304, "phrase": "term_t"}, {"score": 0.003977505904363489, "phrase": "occurrence_statistics"}, {"score": 0.003770869401884267, "phrase": "text_window"}, {"score": 0.003389136094439662, "phrase": "partial_relevance_information"}, {"score": 0.0032272929113113203, "phrase": "logistic_regression_model"}, {"score": 0.002992195343569767, "phrase": "relevance_feedback"}, {"score": 0.0029133627624098064, "phrase": "title_queries"}, {"score": 0.0027373807320805084, "phrase": "residual_mean_average_precision"}, {"score": 0.002303203861293712, "phrase": "map"}, {"score": 0.0022604585778195152, "phrase": "new_weights"}, {"score": 0.0022404162042797262, "phrase": "relative_improvement"}, {"score": 0.0021620042653528846, "phrase": "statistical_significance"}], "paper_keywords": [""], "paper_abstract": "We studied the effectiveness of a new class of context-dependent term weights for information retrieval. Unlike the traditional term frequency-inverse document frequency (TF-IDF), the new weighting of a term t in a document d depends not only on the occurrence statistics of t alone but also on the terms found within a text window (or \"document-context\") centered on t. We introduce a Boost and Discount (B&D) procedure which utilizes partial relevance information to compute the context-dependent term weights of query terms according to a logistic regression model. We investigate the effectiveness of the new term weights compared with the context-independent BM25 weights in the setting of relevance feedback. We performed experiments with title queries of the TREC-6, -7, -8, and 2005 collections, comparing the residual Mean Average Precision (MAP) measures obtained using B&D term weights and those obtained by a baseline using BM25 weights. Given either 10 or 20 relevance judgments of the top retrieved documents, using the new term weights yields improvement over the baseline for all collections tested. The MAP obtained with the new weights has relative improvement over the baseline by 3.3 to 15.2%, with statistical significance at the 95% confidence level across all four collections.", "paper_title": "A New Context-Dependent Term Weight Computed by Boost and Discount Using Relevance Information", "paper_id": "WOS:000284231100011"}