{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "named_entity_recognition"}, {"score": 0.0046240999614456605, "phrase": "natural_language_processing"}, {"score": 0.004518442937844318, "phrase": "intelligent_information_access"}, {"score": 0.004167218012926657, "phrase": "carefully_authored_news_text"}, {"score": 0.003910441483033426, "phrase": "new_challenges"}, {"score": 0.003523822585025555, "phrase": "consecutive_stages"}, {"score": 0.0034832884999421374, "phrase": "language_identification"}, {"score": 0.0028944757265206332, "phrase": "new_twitter_entity_disambiguation_dataset"}, {"score": 0.0028119023819663472, "phrase": "empirical_analysis"}, {"score": 0.002432971714608409, "phrase": "main_sources"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information extraction", " Named entity recognition", " Entity disambiguation", " Microblogs", " Twitter"], "paper_abstract": "Applying natural language processing for mining and intelligent information access to tweets (a form of microblog) is a challenging, emerging research area. Unlike carefully authored news text and other longer content, tweets pose a number of new challenges, due to their short, noisy, context-dependent, and dynamic nature. Information extraction from tweets is typically performed in a pipeline, comprising consecutive stages of language identification, tokenisation, part-of-speech tagging, named entity recognition and entity disambiguation (e.g. with respect to DBpedia). In this work, we describe a new Twitter entity disambiguation dataset, and conduct an empirical analysis of named entity recognition and disambiguation, investigating how robust a number of state-of-the-art systems are on such noisy texts, what the main sources of error are, and which problems should be further investigated to improve the state of the art. (C) 2015 Published by Elsevier Ltd.", "paper_title": "Analysis of named entity recognition and linking for tweets", "paper_id": "WOS:000351320100003"}