{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "deformation_statistics"}, {"score": 0.004361428012479218, "phrase": "domain_deformations"}, {"score": 0.004236321075918639, "phrase": "three-dimensional_scenes"}, {"score": 0.004114787982556699, "phrase": "vantage_point"}, {"score": 0.003950453462399077, "phrase": "empirical_statistics"}, {"score": 0.003770633265791941, "phrase": "kurtotic_behavior"}, {"score": 0.003662410853488772, "phrase": "natural_image"}, {"score": 0.0032596049901888724, "phrase": "simple_parametric_maps"}, {"score": 0.0031845067058084583, "phrase": "affine_ones"}, {"score": 0.0029694040368299624, "phrase": "occluding_boundaries"}, {"score": 0.002736694413701639, "phrase": "dedicated_descriptors"}, {"score": 0.0025967927629150715, "phrase": "invariant_descriptors"}, {"score": 0.0023380300046435187, "phrase": "current_state"}, {"score": 0.0022576249214220187, "phrase": "affine-invariant_region_descriptors"}], "paper_keywords": [""], "paper_abstract": "We study the set of domain deformations induced on images of three-dimensional scenes by changes of the vantage point. We parametrize such deformations and derive empirical statistics on the parameters, that show a kurtotic behavior similar to that of natural image and range statistics. Such a behavior would suggest that most deformations are locally smooth, and therefore could be captured by simple parametric maps, such as affine ones. However, we show that deformations induced by singularities and occluding boundaries, although rare, are highly salient, thus warranting the development of dedicated descriptors. We therefore illustrate the development of viewpoint invariant descriptors for singularities, as well as for occluding boundaries. We test their performance on scenes where the current state of the art based on affine-invariant region descriptors fail to establish correspondence, highlighting the features and shortcomings of our approach.", "paper_title": "Viewpoint induced deformation statistics and the design of viewpoint invariant features: Singularities and occlusions", "paper_id": "WOS:000237555200028"}