{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "decision_problems"}, {"score": 0.004784795480627637, "phrase": "parameterized_machines"}, {"score": 0.0046368166127362925, "phrase": "parameterized_versions"}, {"score": 0.003594507685403249, "phrase": "input_length"}, {"score": 0.0035273120781708655, "phrase": "equivalence_problems"}, {"score": 0.003354180941665089, "phrase": "pushdown_stacks"}, {"score": 0.002526821678335054, "phrase": "counter_machines"}, {"score": 0.0024639706724030063, "phrase": "arbitrary_integers"}, {"score": 0.002380089119791563, "phrase": "universe_problem"}, {"score": 0.002328199473006809, "phrase": "simple_characterization"}, {"score": 0.0021587119099287337, "phrase": "multiple_input_heads"}, {"score": 0.0021451564984201364, "phrase": "multiple_input_tapes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Parameterized machines", " Decision problems", " Turing machines", " Pushdown automata", " Counter machines"], "paper_abstract": "In this paper,we investigate various decision problems concerning parameterized versions of some classes of machines. Let C(s, m, t) be the class of nondeterministic multitape Turing machine (TM) acceptors with a two-way read-only input, at most s states, at most m read-write worktapes, and at most t symbols in the worktape alphabet, where s. m, t are fixed positive integers. There is no restriction on the cardinality of the input alphabet. We are able to show the emptiness, disjointness, and universe (also called universality) problems to be decidable for C(s, m, t). For the class consisting of machines in C(s. m, t) that always halt or whose minimal-time accepting computations can be bounded by some recursive function f(n) (where n is the input length), the containment and equivalence problems are decidable. These results hold for other machines, e.g., when the worktapes are pushdown stacks (where on every step, each pushdown can only pop the top of the stack or replace the top of the stack by at most two symbols) or when stacks are counters (where on every step, a counter can be incremented by 1, decremented by 1, or remain unchanged, and can be tested for zero). Our results are the best possible in the sense that not parameterizing one of s, m, t (or, in the case of counter machines, allowing the counters to increment by arbitrary integers that may change from machines to machines) makes the universe problem undecidable. We also give a simple characterization of the languages defined by C(s, m, t). Finally, we investigate the applicability of our techniques to machines with multiple input heads or multiple input tapes. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "On decision problems for parameterized machines", "paper_id": "WOS:000274886700022"}