{"auto_keywords": [{"score": 0.03287333803746842, "phrase": "design_pattern"}, {"score": 0.03265769574929044, "phrase": "metapattern_roles"}, {"score": 0.00908895949592321, "phrase": "design_pattern_roles"}, {"score": 0.00481495049065317, "phrase": "pattern_roles"}, {"score": 0.0047341211614980085, "phrase": "change-prone_sections"}, {"score": 0.004592016716046632, "phrase": "maintenance_effort"}, {"score": 0.004561019117546361, "phrase": "design_patterns"}, {"score": 0.004176509019758331, "phrase": "recorded_changes"}, {"score": 0.003983016985197904, "phrase": "reasonable_explanation"}, {"score": 0.0036224139706218916, "phrase": "w._pree's_metapatterns"}, {"score": 0.00338493754743055, "phrase": "simpler_model"}, {"score": 0.003350679980619693, "phrase": "recent_findings"}, {"score": 0.0033280337910399104, "phrase": "di_penta_et_al"}, {"score": 0.0028184476518849015, "phrase": "strong_determinants"}, {"score": 0.002678598911294797, "phrase": "stronger_determinant"}, {"score": 0.0021556211190198703, "phrase": "change-prone_classes"}, {"score": 0.0021049977753042253, "phrase": "better_indicator"}], "paper_keywords": ["Design patterns", " Empirical software engineering"], "paper_abstract": "Identifying change-prone sections of code can help managers plan and allocate maintenance effort. Design patterns have been used to study change-proneness and are widely believed to support certain kinds of changes, while inhibiting others. Recently, several studies have analyzed recorded changes to classes playing design pattern roles and find that the patterns \"folklore\" offers a reasonable explanation for the reality: certain pattern roles do seem to be less change-prone than others. We push this analysis on two fronts: first, we deploy W. Pree's metapatterns, which group patterns purely by structure (rather than intent), and argue that metapatterns are a simpler model to explain recent findings by Di Penta et al. (2008). Second, we study the effect of the size of the classes playing the design pattern and metapattern roles. We find that size explains more of the variance in change-proneness than either design pattern or metapattern roles. We also find that both design pattern and metapattern roles were strong determinants of size. We conclude, therefore, that size appears to be a stronger determinant of change-proneness than either design pattern or metapattern roles, and observed differences in change-proneness between roles might be due to differences in the sizes of the classes playing those roles. The size of a class can be found much more quickly, easily and accurately than its pattern-roles. Thus, while identifying design pattern roles may be important for other reasons, as far as identifying change-prone classes, sheer size might be a better indicator.", "paper_title": "An empirical study on the influence of pattern roles on change-proneness", "paper_id": "WOS:000289254600004"}