{"auto_keywords": [{"score": 0.03204003536468291, "phrase": "show_gesture"}, {"score": 0.015719716506582538, "phrase": "early_language_development"}, {"score": 0.010619689793091516, "phrase": "referring_word"}, {"score": 0.004737328254103122, "phrase": "infant-caregiver_perceiving"}, {"score": 0.004511855629018383, "phrase": "fine-grained_descriptions"}, {"score": 0.004320474748991553, "phrase": "mexico"}, {"score": 0.004285438467997083, "phrase": "naturalistic_approach"}, {"score": 0.004216316375000129, "phrase": "perceptual_processes"}, {"score": 0.004182172788492861, "phrase": "caregiver's_role"}, {"score": 0.00414830454375092, "phrase": "infants'_early_word"}, {"score": 0.004092463367307375, "phrase": "infants'_attention"}, {"score": 0.003983016985197904, "phrase": "dynamic_gesture"}, {"score": 0.0037933088900625822, "phrase": "perceptual_information"}, {"score": 0.0037219886365287085, "phrase": "amodal_invariant"}, {"score": 0.003583331341515525, "phrase": "auditory_and_visual_flow"}, {"score": 0.0034218637688148653, "phrase": "earlier_naturalistic_work"}, {"score": 0.00338493754743055, "phrase": "eye-tracking_experiments"}, {"score": 0.002776687200568343, "phrase": "enhanced_word_learning"}, {"score": 0.002695008409963157, "phrase": "referent-word_relations"}, {"score": 0.0026015629469149384, "phrase": "seed_framework"}, {"score": 0.002497750121448195, "phrase": "distributed_character"}, {"score": 0.0024842242921857705, "phrase": "caregiver-infant_interaction"}, {"score": 0.002391567424973148, "phrase": "social_interaction"}, {"score": 0.002277485549459112, "phrase": "continuous_loop"}, {"score": 0.0021688337445559, "phrase": "cognitive_systems"}, {"score": 0.0021570852132316294, "phrase": "autonomous_robots"}, {"score": 0.0021049977753042253, "phrase": "\"acoustic_packages"}], "paper_keywords": ["Human voice", " learning system", " natural language processing", " psychology", " speech processing"], "paper_abstract": "The research and theory described here evolved from fine-grained descriptions of early word learning based on videotapes of infants and their families in the US and Mexico. This naturalistic approach led to theorizing about the perceptual processes underlying the caregiver's role in assisting infants' early word learning. Caregivers educate infants' attention by synchronizing the saying of a word with a dynamic gesture, a show, in which they display the object/referent to the infant. By making this perceptual information prominent, infants can detect an amodal invariant across gesture and speech. Doing so brackets the word and object within the auditory and visual flow of events and constitutes the basis for perceiving them as belonging together. Stemming from the earlier naturalistic work, we designed eye-tracking experiments to test three hypotheses: 1) infants will attend more to an object when the referring word is said if the speaker uses a dynamic, synchronized show gesture, rather than a static or asynchronous gesture; 2) a show gesture will be most effective in drawing attention away from the mouth to the object when the referring word is spoken; and 3) the use of a show gesture will lead to enhanced word learning. These experiments confirmed our hypotheses, establishing that infants detected referent-word relations best when the speaker used a show gesture. These results support the SEED Framework of early language development which delineates how the situated, culturally embodied, emergent, and distributed character of caregiver-infant interaction nurtures communicative behavior. The ability to communicate germinates and takes root during social interaction, as the dynamically-coupled perceiving-and-acting of infants and caregivers forms a continuous loop, each of them unceasingly affecting the other. These findings have implications for the design of cognitive systems in autonomous robots, especially \"tutor spotting\" and detecting \"acoustic packages.\"", "paper_title": "SEED Framework of Early Language Development: The Dynamic Coupling of Infant-Caregiver Perceiving and Acting Forms a Continuous Loop during Interaction", "paper_id": "WOS:000324583800007"}