{"auto_keywords": [{"score": 0.028564362307969614, "phrase": "line-up_section"}, {"score": 0.0148281309515914, "phrase": "multipartite_access_structures"}, {"score": 0.008515524316456994, "phrase": "bench_section"}, {"score": 0.00481495049065317, "phrase": "integer_polymatroids"}, {"score": 0.004771435352180973, "phrase": "ideal_access_structures"}, {"score": 0.0047283116134926645, "phrase": "ideal_secret_sharing_schemes"}, {"score": 0.00460125407969429, "phrase": "minimal_size"}, {"score": 0.004437115547184535, "phrase": "real_social_organizations"}, {"score": 0.004259418153299952, "phrase": "disjoint_groups"}, {"score": 0.004070276454809864, "phrase": "expressive_ideal_multipartite_access_structures"}, {"score": 0.003907212558276185, "phrase": "ideal_multipartite_access_structures"}, {"score": 0.0037848978618663684, "phrase": "powerful_tool"}, {"score": 0.0035194572615570977, "phrase": "flexible_applications"}, {"score": 0.003378385493203297, "phrase": "known_results"}, {"score": 0.003257727050827128, "phrase": "compartmented_access_structures"}, {"score": 0.0032282396745967504, "phrase": "strictly_lower_bounds"}, {"score": 0.0030017207229983385, "phrase": "ideal_bench_access_structures"}, {"score": 0.0023479408542211875, "phrase": "emergency_situations"}, {"score": 0.002153450937601075, "phrase": "ideal_partially_hierarchical_access_structures"}], "paper_keywords": ["secret sharing", " access structure", " multipartite secret sharing", " polymatroids", " matroids", " linear programming"], "paper_abstract": "Ideal access structures admit ideal secret sharing schemes where the shares have the minimal size. As multipartite access structures can well mirror the real social organizations, of which the participants are partitioned into disjoint groups according to their properties, it is desirable to find expressive ideal multipartite access structures. Integer polymatroids, due to their close relationship with ideal multipartite access structures, have been shown as a powerful tool to study the ideality of some multipartite access structures. In this paper, to cater for flexible applications, we consider several ideal multipartite access structures that further extend some known results. We first explore a type of compartmented access structures with strictly lower bounds, which provide fairness among all the participant groups when recovering the secret. Then, we investigate ideal bench access structures where the participant set is divided into two parts, that is, line-up section and bench section. The participants in line-up section can delegate their capabilities to the participants in bench section in such a way that the participants in bench section can take over the role of their delegators in line-up section, which is applicable to emergency situations when there are no enough participants in line-up section for recovering the secret. Finally, we propose two types of ideal partially hierarchical access structures which are suitable to more realistic hierarchical social organizations than existing results.", "paper_title": "Further ideal multipartite access structures from integer polymatroids", "paper_id": "WOS:000358136300013"}