{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_systems_discipline"}, {"score": 0.004725787037228084, "phrase": "scholarly_endeavor"}, {"score": 0.004620957579769604, "phrase": "ranking_research_journals"}, {"score": 0.003964007795174772, "phrase": "journal's_articles"}, {"score": 0.0038327445210488355, "phrase": "selected_set"}, {"score": 0.0035298229915690974, "phrase": "private_and_public_universities"}, {"score": 0.0034001358540125303, "phrase": "private_and_public_faculty_researchers"}, {"score": 0.003299813878412728, "phrase": "resultant_ranking"}, {"score": 0.0027985291920293127, "phrase": "widespread_bibliometric_assumption"}, {"score": 0.0027363334666886912, "phrase": "ranking_methodology"}, {"score": 0.002675516297446243, "phrase": "actual_publishing_behaviors"}, {"score": 0.002655544981260646, "phrase": "tenured_researchers"}, {"score": 0.00250103550267459, "phrase": "leading_private_universities"}, {"score": 0.002463830258460528, "phrase": "leading_public_universities"}, {"score": 0.0023291617361832157, "phrase": "different_publication_patterns"}, {"score": 0.0022859244876449396, "phrase": "public_institutions"}, {"score": 0.002235095576913575, "phrase": "journal-ranking_exercises"}, {"score": 0.0022018377054878534, "phrase": "private-public_distinctions"}, {"score": 0.002128801826067279, "phrase": "evaluation_standards"}, {"score": 0.0021049977753042253, "phrase": "private_and_public_rankings"}], "paper_keywords": [""], "paper_abstract": "In most disciplines of scholarly endeavor, there are many efforts at ranking research journals. There are two common methods for such efforts. One of these is based on tabulations of opinions offered by persons having some kind of relationship with the discipline. The other is based on analyses of the extent to which a journal's articles have been cited by papers appearing in some selected set of publications. In either case, construction of a journal ranking for a discipline makes no effort to distinguish between private and public universities. That is, data are aggregated from both private and public faculty researchers. It is thus assumed that the resultant ranking is applicable for both kinds of institutions. But, is this assumption reasonable? The answer is very important because these rankings are applied in the evaluation of promotion, tenure, and merit cases of faculty members working in a discipline. Here, we examine this widespread bibliometric assumption through the use of a ranking methodology that is based on the actual publishing behaviors of tenured researchers in a discipline. The method is used to study the behaviors of researchers at leading private universities versus those at leading public universities. Illustrating this approach within the information systems discipline, we find that there are indeed different publication patterns for the private versus public institutions. This finding suggests that journal-ranking exercises should not ignore private-public distinctions and that care should be taken to avoid evaluation standards that confound private and public rankings of journals.", "paper_title": "How Much and Where? Private Versus Public Universities' Publication Patterns in the Information Systems Discipline", "paper_id": "WOS:000263136200009"}