{"auto_keywords": [{"score": 0.04170081392512019, "phrase": "informational_knowledge"}, {"score": 0.00481495049065317, "phrase": "emerging_computing_systems"}, {"score": 0.004641351004344458, "phrase": "autonomous_agents"}, {"score": 0.004441236717408874, "phrase": "business_requirements"}, {"score": 0.004296809240805996, "phrase": "external_agents"}, {"score": 0.004265354774450696, "phrase": "sufficient_level"}, {"score": 0.0040366412779632085, "phrase": "dynamic_and_incomplete_knowledge"}, {"score": 0.003668768542734106, "phrase": "defeasible_logic"}, {"score": 0.00352696206684445, "phrase": "angle"}, {"score": 0.00327356326590461, "phrase": "policy-based_method"}, {"score": 0.003213920601037463, "phrase": "contract-based_coordination"}, {"score": 0.0026446021865907197, "phrase": "extended_defeasible_logic"}, {"score": 0.0026252106881752067, "phrase": "modal_operators"}, {"score": 0.00257735013358606, "phrase": "existing_defeasible_theories"}, {"score": 0.002530359917257626, "phrase": "belief_theory"}, {"score": 0.002511803988580901, "phrase": "goal_theory"}, {"score": 0.0024933837962398267, "phrase": "intention_theory"}, {"score": 0.0023507916951658455, "phrase": "external_motivational_knowledge"}, {"score": 0.0022081920438290193, "phrase": "underlying_theories"}, {"score": 0.002191993482098238, "phrase": "argument_construction"}, {"score": 0.002159951198924152, "phrase": "monotonic_process"}, {"score": 0.0021049977753042253, "phrase": "existing_argumentation_framework"}], "paper_keywords": ["Autonomous agents", " Argumentation", " Defeasible logic", " Normative agents", " Policy-based management", " Non-monotonic reasoning"], "paper_abstract": "Some emerging computing systems (especially autonomic computing systems) raise several challenges to autonomous agents, including (1) how to reflect the dynamics of business requirements, (2) how to coordinate with external agents with sufficient level of security and predictability, and (3) how to perform reasoning with dynamic and incomplete knowledge, including both informational knowledge (observations) and motivational knowledge (for example, policy rules and contract rules). On the basis of defeasible logic and argumentation, this paper proposes an autonomous, normative and guidable agent model, called ANGLE, to cope with these challenges. This agent is established by combining beliefs-desires-intentions (BDI) architecture with policy-based method and the mechanism of contract-based coordination. Its architecture, knowledge representation, as well as reasoning and decision-making, are presented in this paper. ANGLE is characteristic of the following three aspects. First, both its motivational knowledge and informational knowledge are changeable, and allowed to be incomplete, inconsistent/conflicting. Second, its knowledge is represented in terms of extended defeasible logic with modal operators. Different from the existing defeasible theories, its theories (including belief theory, goal theory and intention theory) are dynamic (called dynamic theories), reflecting the variations of observations and external motivational knowledge. Third, its reasoning and decision-making are based on argumentation. Due to the dynamics of underlying theories, argument construction is not a monotonic process, which is different from the existing argumentation framework where arguments are constructed incrementally. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "ANGLE: An autonomous, normative and guidable agent with changing knowledge", "paper_id": "WOS:000280022100005"}