{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fluorine_bonding_-_how"}, {"score": 0.004564291332315995, "phrase": "pharmacologically_active_compounds"}, {"score": 0.004454691230204595, "phrase": "common_strategy"}, {"score": 0.0043477114072437316, "phrase": "membrane_permeation"}, {"score": 0.004243289764306128, "phrase": "protein-ligand_interactions"}, {"score": 0.0040027552011993005, "phrase": "chemistry_and_biology_communities"}, {"score": 0.00386876598761639, "phrase": "geometric_characteristics'and"}, {"score": 0.003831310632470526, "phrase": "energetic_behaviors"}, {"score": 0.0037942165191367366, "phrase": "fluorine_bonding"}, {"score": 0.00342568771304873, "phrase": "short_contacts"}, {"score": 0.003392507399258166, "phrase": "fluorine_atoms"}, {"score": 0.0032471155306148156, "phrase": "fluorinated_ligands"}, {"score": 0.0029747028229638625, "phrase": "sulfur-involved_hydrogen_bonding"}, {"score": 0.002778682854371595, "phrase": "essential_role"}, {"score": 0.002751751956416832, "phrase": "protein-ligand_binding"}, {"score": 0.002672511078070529, "phrase": "isolated_fluorine_bonding"}, {"score": 0.0025207920578878894, "phrase": "molecular_mechanics"}, {"score": 0.0024126686412257407, "phrase": "fluorine_bonding_energies"}, {"score": 0.0021049977753042253, "phrase": "moderate_and_large_fluorine_bonding_systems"}], "paper_keywords": [""], "paper_abstract": "Although fluorination of pharmacologically active compounds has long been a common strategy to increase their metabolic stability and membrane permeation, the functionality of protein-ligand interactions involving fluorine atoms (fluorine bonding).was only recenily recognized in the chemistry and biology communities. In this study, the geometric characteristics'and the energetic behaviors of fluorine bonding were systematically investigated by combining two quite disparate but cornplementary approaches: X-ray structural analysis and theoretical calculations. We found that the short contacts involving fluorine atoms (generalized fluorine bonding) between proteins and fluorinated ligands are very frequent, and these contacts, compared to those routine hydrogen/halogdn bonding, are more similar to sulfur-involved hydrogen bonding observed in proteins. ONIOM-based quantum mechanics/molecular mechanics analysis further revealed that fluorine bonding does play an essential role in protein-ligand binding, albeik the strength of isolated fluorine bonding is quite modest. Furthermore, 14 quantum mechanics (QM) and molecular mechanics (MM) methods were performed to reproduce fluorine bonding energies obtained at the rigorous MP2/aug-ce-pVDZ level of theory, and the results showed that most QM and very few MM methods perform well in the reproducibility; the MPWLYP functional and MMFF94 force field are recommended to study moderate and large fluorine bonding systems, respectively.", "paper_title": "Fluorine Bonding - How Does It Work In Protein-Ligand Interactions?", "paper_id": "WOS:000271011500018"}