{"auto_keywords": [{"score": 0.04612581829700841, "phrase": "iot_environment"}, {"score": 0.011556381955817305, "phrase": "moving_target"}, {"score": 0.008567323212088508, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004723847090183984, "phrase": "actual_platform"}, {"score": 0.004634459424542272, "phrase": "personal_and_ubiquitous_computing"}, {"score": 0.004525088883501587, "phrase": "target_localization"}, {"score": 0.0037377733149169573, "phrase": "wireless_sensor_nodes"}, {"score": 0.0031921317979928406, "phrase": "sr-ukf_idea"}, {"score": 0.0029996699429582835, "phrase": "sensor_nodes"}, {"score": 0.002928765962664163, "phrase": "real-time_location"}, {"score": 0.002752139271586703, "phrase": "iterative_fashion"}, {"score": 0.002687070469080394, "phrase": "target_status_tracking"}, {"score": 0.002661474607275484, "phrase": "simulation_results"}, {"score": 0.0025861368747446324, "phrase": "good_performance"}, {"score": 0.0024301229420875155, "phrase": "uniform_linear_motion"}, {"score": 0.002406968743305622, "phrase": "variable-speed_curve_motion"}, {"score": 0.002316569850481301, "phrase": "kalman"}, {"score": 0.0022835056077245507, "phrase": "ekf"}, {"score": 0.0022509365210788015, "phrase": "ukf-based_methods"}, {"score": 0.0021049977753042253, "phrase": "ubiquitous_computing_applications"}], "paper_keywords": ["Internet of Things (IoT)", " Wireless sensor network ( WSN)", " Localization", " Tracking", " Square-root unscented Kalman filtering (SR-UKF)"], "paper_abstract": "The Internet of Things (IoT), which is usually established over architectures of wireless sensor networks, provides an actual platform for various applications of personal and ubiquitous computing. Recently, moving target localization and tracking in an IoT environment have been paid more and more attention. This paper proposes a square-root unscented Kalman filtering (SR-UKF)-based algorithm to discover real-time location of a moving target in an IoT environment where there exist quantities of sensors. The data generated from wireless sensor nodes of the IoT make contributions to localization and tracking of the moving target. First, a least-square (LS) criterion-based mathematical model is proposed for localization initialization in an IoT scenario. Next, we employ an SR-UKF idea for the further localization and tracking. By using the data coming from sensor nodes near the target, real-time location of the moving target can be estimated by implementation of SR-UKF in an iterative fashion so as to achieve target status tracking. Simulation results show that the proposed algorithm achieves good performance in estimation of both position and velocity of the target with either uniform linear motion or variable-speed curve motion. Compared with some existing conventional extended Kalman filtering (EKF) or UKF-based methods, the proposed algorithm shows lower location/velocity estimation error under the same computational complexity, which demonstrates its potential significance in ubiquitous computing applications for an IoT environment.", "paper_title": "Square-root unscented Kalman filtering-based localization and tracking in the Internet of Things", "paper_id": "WOS:000333341000022"}