{"auto_keywords": [{"score": 0.0313043814036037, "phrase": "desired_throughput"}, {"score": 0.007630019696831919, "phrase": "arrival_rate"}, {"score": 0.00481495049065317, "phrase": "unstable_queueing_networks"}, {"score": 0.0047559432344272, "phrase": "flexible_servers"}, {"score": 0.004527024978801684, "phrase": "dynamic_assignment"}, {"score": 0.004362564831572539, "phrase": "queueing_networks"}, {"score": 0.003952513974962462, "phrase": "system_throughput"}, {"score": 0.0038561471948364723, "phrase": "fluid_limit_analysis"}, {"score": 0.0032240802202623316, "phrase": "desired_feasible_throughput"}, {"score": 0.002831894638104635, "phrase": "linear_programming_problems"}, {"score": 0.002762774046280398, "phrase": "generalized_round-robin_policies"}, {"score": 0.0022531089868518235, "phrase": "numerical_examples"}, {"score": 0.0021049977753042253, "phrase": "system_behavior"}], "paper_keywords": ["Multi-class queueing networks", " Stability", " Fluid model", " Maximum throughput", " Jackson networks"], "paper_abstract": "This paper is concerned with the dynamic assignment of servers to tasks in queueing networks where demand may exceed the capacity for service. The objective is to maximize the system throughput. We use fluid limit analysis to show that several quantities of interest, namely the maximum possible throughput, the maximum throughput for a given arrival rate, the minimum arrival rate that will yield a desired feasible throughput, and the optimal allocations of servers to classes for a given arrival rate and desired throughput, can be computed by solving linear programming problems. We develop generalized round-robin policies for assigning servers to classes for a given arrival rate and desired throughput, and show that our policies achieve the desired throughput as long as this throughput is feasible for the arrival rate. We conclude with numerical examples that illustrate the points discussed and provide insights into the system behavior when the arrival rate deviates from the one the system is designed for.", "paper_title": "Dynamic server allocation for unstable queueing networks with flexible servers", "paper_id": "WOS:000298880800004"}