{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nba"}, {"score": 0.0046176782475198085, "phrase": "multi-million_sports-betting_market"}, {"score": 0.004382364826200616, "phrase": "sports_event"}, {"score": 0.004217425501814589, "phrase": "uncountable_number"}, {"score": 0.00418810762179987, "phrase": "descriptive_statistics"}, {"score": 0.0041589926969138585, "phrase": "background_information"}, {"score": 0.0037719307016238998, "phrase": "traditional_way"}, {"score": 0.0037326500020622715, "phrase": "sports_events"}, {"score": 0.0036680857629458816, "phrase": "model_sports_leagues"}, {"score": 0.003505378950567746, "phrase": "work_relationships"}, {"score": 0.0033381913087533457, "phrase": "sports_leagues"}, {"score": 0.0031458272260508637, "phrase": "single_parameter"}, {"score": 0.002974886152979993, "phrase": "team_sports_league"}, {"score": 0.00290304212971385, "phrase": "sports_league"}, {"score": 0.0027936239349923464, "phrase": "implicit_feedback"}, {"score": 0.0027741761880779535, "phrase": "network_changes"}, {"score": 0.0026325577905633494, "phrase": "network-based_prediction_models"}, {"score": 0.00256895975568914, "phrase": "significantly_high_probability"}, {"score": 0.002305237748207288, "phrase": "mlb"}, {"score": 0.0022653055209664284, "phrase": "consistently_good_results"}, {"score": 0.00217987162651941, "phrase": "network_properties"}], "paper_keywords": ["Complex networks", " social networks", " sports analytics"], "paper_abstract": "The multi-million sports-betting market is based on the fact that the task of predicting the outcome of a sports event is very hard. Even with the aid of an uncountable number of descriptive statistics and background information, only a few can correctly guess the outcome of a game or a league. In this work, our approach is to move away from the traditional way of predicting sports events, and instead to model sports leagues as networks of players and teams where the only information available is the work relationships among them. We propose two network-based models to predict the behavior of teams in sports leagues. These models are parameter-free, that is, they do not have a single parameter, and moreover are sport-agnostic: they can be applied directly to any team sports league. First, we view a sports league as a network in evolution, and we infer the implicit feedback behind network changes and properties over the years. Then, we use this knowledge to construct the network-based prediction models, which can, with a significantly high probability, indicate how well a team will perform over a season. We compare our proposed models with other prediction models in two of the most popular sports leagues: the National Basketball Association (NBA) and the Major League Baseball (MLB). Our model shows consistently good results in comparison with the other models and, relying upon the network properties of the teams, we achieved a approximate to 14% rank prediction accuracy improvement over our best competitor.", "paper_title": "Forecasting in the NBA and Other Team Sports: Network Effects in Action", "paper_id": "WOS:000310560600004"}