{"auto_keywords": [{"score": 0.047999235622023344, "phrase": "abpbgs"}, {"score": 0.00481495049065317, "phrase": "adaptive_block-propagative"}, {"score": 0.004733458808453602, "phrase": "uhdtv_foreground_detection"}, {"score": 0.004637478829869904, "phrase": "adapting_block-propagative_background_subtraction"}, {"score": 0.004129067429043414, "phrase": "moving_object"}, {"score": 0.004031495920060339, "phrase": "uhdtv"}, {"score": 0.00388278852285898, "phrase": "total_area"}, {"score": 0.0038300786263543835, "phrase": "seed_block"}, {"score": 0.0037523473563976246, "phrase": "previous_iteration"}, {"score": 0.0034924598001567944, "phrase": "block_history_map"}, {"score": 0.0032616462517547477, "phrase": "computational_time"}, {"score": 0.003239418275717787, "phrase": "memory_usage"}, {"score": 0.0029235593748707495, "phrase": "best_results"}, {"score": 0.0028937142757436683, "phrase": "average_global_quality_score"}, {"score": 0.002549672862868133, "phrase": "reasonable_time"}, {"score": 0.0024893297856666808, "phrase": "average_speed"}], "paper_keywords": ["foreground detection", " block-propagation", " UHDTV", " ABPBGS", " 8K", " 4K", " moving object", " super hi-vision"], "paper_abstract": "This paper presents an Adapting Block-Propagative Background Subtraction (ABPBGS) designed for Ultra High Definition Television (UHDTV) foreground detection. The main idea is to detect block after block along the objects in order to skip all areas of the image in which there is no moving object. This is particularly interesting for UHDTV when the objects of interest could represent not even 0.1% of the total area. From a seed block which is determined in a previous iteration, the detection will spread along an object as long as it detects a part of that object. A block history map guaranties that each block is processed only once. Moreover, only small blocks are loaded and processed, thus saving computational time and memory usage. The process of each block is independent enough to be easily parallelized. Compared to 9 state-of-the-art works, the ABPBGS achieved the best results with an average global quality score of 0.57 (1 being the maximum) on a dataset of 4K and 8K UHDTV sequences developed for this work. None of the state-of-the-art methods could process 4K videos in reasonable time while the ABPBGS has shown an average speed of 5.18 fps. In comparison, 5 of the 9 state-of-the-art methods performed slower on 270p down-scale version of the same videos. The experiments have also shown that for the process an 8K UHDTV video the ABPBGS can divide the memory required by about 24 for a total of 450 MB.", "paper_title": "Adaptive Block-Propagative Background Subtraction Method for UHDTV Foreground Detection", "paper_id": "WOS:000364414700015"}