{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cocitation_clusters"}, {"score": 0.01239961720682002, "phrase": "cocitation_networks"}, {"score": 0.0047292449487169345, "phrase": "multiple-perspective_cocitation_analysis"}, {"score": 0.004645057834614705, "phrase": "multiple-perspective_cocitation_analysis_method"}, {"score": 0.004195418010131832, "phrase": "analytic_and_sense_making_tasks"}, {"score": 0.0034841647157189985, "phrase": "automatic_cluster_labeling"}, {"score": 0.0032423089921154503, "phrase": "cocitation_cluster's_members"}, {"score": 0.0031277316566463978, "phrase": "generic_method"}, {"score": 0.0030353401945270755, "phrase": "three-part_analysis"}, {"score": 0.002945669860541221, "phrase": "information_science"}, {"score": 0.0024901940672239784, "phrase": "time_series"}, {"score": 0.0021953290937408807, "phrase": "multiple-perspective_method"}], "paper_keywords": [""], "paper_abstract": "A multiple-perspective cocitation analysis method is introduced for characterizing and interpreting the structure and dynamics of cocitation clusters. The method facilitates analytic and sense making tasks by integrating network visualization, spectral clustering, automatic cluster labeling, and text summarization. Cocitation networks are decomposed into cocitation clusters. The interpretation of these clusters is augmented by automatic cluster labeling and summarization. The method focuses on the interrelations between a cocitation cluster's members and their citers. The generic method is applied to a three-part analysis of the field of information science as defined by 12 journals published between 1996 and 2008: (a) a comparative author cocitation analysis (ACA), (b) a progressive ACA of a time series of cocitation networks, and (c) a progressive document cocitation analysis (DCA). Results show that the multiple-perspective method increases the interpretability and accountability of both ACA and DCA networks.", "paper_title": "The Structure and Dynamics of Cocitation Clusters: A Multiple-Perspective Cocitation Analysis", "paper_id": "WOS:000279151600007"}