{"auto_keywords": [{"score": 0.04644064164555673, "phrase": "physical_world"}, {"score": 0.015719721124940293, "phrase": "cave."}, {"score": 0.008624386171290153, "phrase": "surrounding_objects"}, {"score": 0.004743164872278112, "phrase": "virtual_environments"}, {"score": 0.003659890662429693, "phrase": "fundamental_phenomena"}, {"score": 0.0036324746826127997, "phrase": "correct_size"}, {"score": 0.003232779373179631, "phrase": "retinal_size"}, {"score": 0.0031606404966938568, "phrase": "increasing_distance"}, {"score": 0.003043961047382774, "phrase": "cave"}, {"score": 0.0029648446274266765, "phrase": "strong_and_dominant_perception"}, {"score": 0.0029095936591723645, "phrase": "test_object"}, {"score": 0.0028553693643045795, "phrase": "environmental_objects"}, {"score": 0.0028127163745564777, "phrase": "size-constancy_changes"}, {"score": 0.0027811441123794427, "phrase": "visual_angle_performance"}, {"score": 0.002347843727281585, "phrase": "object's_depth"}, {"score": 0.0022022878843247257, "phrase": "projection-based_ve"}, {"score": 0.0021049977753042253, "phrase": "object_size"}], "paper_keywords": [""], "paper_abstract": "The use of virtual environments (VE) for many research and commercial purposes relies on its ability to generate environments that faithfully reproduce the physical world. However, due to its limitations the VE can have a number of flaws that adversely affect its use and believability. One of the more important aspects of this problem is whether the size of an object in the VE is perceived as it would be in the physical world. One of the fundamental phenomena for correct size is size-constancy, that is, an object is perceived to be the same size regardless of its distance from the observer. This is in spite of the fact that the retinal size of the object shrinks with increasing distance from the observer. We examined size-constancy in the CAVE and found that size-constancy is a strong and dominant perception in our subject population when the test object is accompanied by surrounding environmental objects. Furthermore, size-constancy changes to a visual angle performance (i.e., object size changed with distance from the subject) when these surrounding objects are removed from the scene. As previously described for the physical world, our results suggest that it is necessary to provide surrounding objects to aid in the determination of an object's depth and to elicit size-constancy in VE. These results are discussed regarding their implications for viewing objects in projection-based VE and the environments that play a role in the perception of object size in the CAVE.", "paper_title": "Size-constancy in the CAVE", "paper_id": "WOS:000244865300003"}