{"auto_keywords": [{"score": 0.04642059407256737, "phrase": "cf"}, {"score": 0.00871353873203678, "phrase": "physical_activity"}, {"score": 0.007764920290131704, "phrase": "daily_living"}, {"score": 0.004767451673469903, "phrase": "daily_life"}, {"score": 0.004736045157669388, "phrase": "cystic_fibrosis_patients"}, {"score": 0.00461246494886034, "phrase": "important_role"}, {"score": 0.004477270137801732, "phrase": "cystic_fibrosis"}, {"score": 0.0041084684278314305, "phrase": "activity_profiles"}, {"score": 0.0038838500580958744, "phrase": "longer-term_use"}, {"score": 0.003807529003314843, "phrase": "cf_patients"}, {"score": 0.0036959165077944055, "phrase": "pa"}, {"score": 0.0036352070472201086, "phrase": "patients'_clinical_state"}, {"score": 0.003516898780234098, "phrase": "age-matched_healthy_control_group"}, {"score": 0.003030247482854539, "phrase": "usage_time"}, {"score": 0.002921879966280267, "phrase": "younger_patients"}, {"score": 0.0026107601878587816, "phrase": "elder_subjects"}, {"score": 0.0025678829712650437, "phrase": "time-series_analysis"}, {"score": 0.0025257081555100556, "phrase": "characteristic_patterns"}, {"score": 0.0023326907270271153, "phrase": "continuous_recording"}, {"score": 0.0023019834179097607, "phrase": "additional_clinical_information"}], "paper_keywords": ["Cystic fibrosis", " Physical activity", " Accelerometer", " Exacerbation", " Usability"], "paper_abstract": "Physical Activity (PA) plays an important role in the health and quality of life of cystic fibrosis (CF) patients, but little is known about their PA in daily living. With the use of accelerometers it is now possible to monitor activity profiles in detail. The goals of this study are to assess feasibility and acceptance of a longer-term use of accelerometers in daily living in CF patients, study the possibility of detecting changes in PA in relation to the patients' clinical state and compare the findings between a CF and an age-matched healthy control group. We asked 15 CF patients to wear two accelerometers for 21 days and fill in a diary. Ten of them (age 21 to 40, mean 29.5 years) participated and delivered data that could be evaluated. We also recruited 10 age-matched control subjects. Data was processed for calculating usage time and features extracted to construct models of activity. The younger patients, particularly females, were concerned with fashion and style and considered wearing the sensors a challenge. Overall, the compliance of patients with CF seemed to be lower than reported for elder subjects in the literature. Time-series analysis of the data indicated characteristic patterns of PA over time, provided that data preprocessing and noise-filtering had been optimized. Further studies have to assess whether the continuous recording of PA yields additional clinical information in CF and in particular, whether it is possible to detect or even predict exacerbations in patients with CF or other diseases. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Assessing physical activity in the daily life of cystic fibrosis patients", "paper_id": "WOS:000311074500004"}