{"auto_keywords": [{"score": 0.015162993085281736, "phrase": "particular_objects"}, {"score": 0.011917309672144338, "phrase": "inverted_file"}, {"score": 0.009284610247405635, "phrase": "co-occurring_word_sets"}, {"score": 0.00481495049065317, "phrase": "clustering_co-occurring_visual_words"}, {"score": 0.004718431349852634, "phrase": "scalable_approach"}, {"score": 0.00436890075128947, "phrase": "basic_idea"}, {"score": 0.003775803846431323, "phrase": "visual_words"}, {"score": 0.0037150687722055727, "phrase": "local_image_features"}, {"score": 0.003495855671790616, "phrase": "visual_word"}, {"score": 0.0032762198196613084, "phrase": "visual_word_sets"}, {"score": 0.0030086877092638945, "phrase": "unstable_and_polysemous_visual_words"}, {"score": 0.0029722900280316216, "phrase": "co-occurring_word"}, {"score": 0.0026423134393535265, "phrase": "object_models"}, {"score": 0.0025892330566358503, "phrase": "highly_overlapping_co-occurring_word_sets"}, {"score": 0.0024165896393196816, "phrase": "min-hashing"}, {"score": 0.0022281257694320455, "phrase": "oxford_buildings"}, {"score": 0.00218334762335187, "phrase": "quantitative_evaluation"}, {"score": 0.0021394674440767124, "phrase": "ground_truth_landmarks"}, {"score": 0.0021049977753042253, "phrase": "higher_scores"}], "paper_keywords": ["object discovery", " large-scale image mining", " bag-of-features", " Min-Hashing", " agglomerative clustering"], "paper_abstract": "We present a scalable approach to automatically discovering particular objects (as opposed to object categories) from a set of images. The basic idea is to search for local image features that consistently appear in the same images under the assumption that such co-occurring features underlie the same object. We first represent each image in the set as a set of visual words (vector quantized local image features) and construct an inverted file to memorize the set of images in which each visual word appears. Then, our object discovery method proceeds by searching the inverted file and extracting visual word sets whose elements tend to appear in the same images; such visual word sets are called co-occurring word sets. Because of unstable and polysemous visual words, a co-occurring word set typically represents only a part of an object. We observe that co-occurring word sets associated with the same object often share many visual words with one another. Hence, to obtain the object models, we further cluster highly overlapping co-occurring word sets in an agglomerative manner. Remarkably, we accelerate both extraction and clustering of co-occurring word sets by Min-Hashing. We show that the models generated by our method can effectively discriminate particular objects. We demonstrate our method on the Oxford buildings dataset. In a quantitative evaluation using a set of ground truth landmarks, our method achieved higher scores than the state-of-the-art methods.", "paper_title": "Scalable Object Discovery: A Hash-Based Approach to Clustering Co-occurring Visual Words", "paper_id": "WOS:000295601200023"}