{"auto_keywords": [{"score": 0.04623108318579366, "phrase": "csit"}, {"score": 0.04072806163991271, "phrase": "achievable_information_rate"}, {"score": 0.004500596283281564, "phrase": "channel_state_information"}, {"score": 0.004008516312861836, "phrase": "design_problem"}, {"score": 0.003931879808909078, "phrase": "limited_feedback_resource"}, {"score": 0.0037225777441034936, "phrase": "grassmann_precoding"}, {"score": 0.0036046832119756528, "phrase": "eigenvalue_decomposition"}, {"score": 0.0035700457562655246, "phrase": "covariance_matrix"}, {"score": 0.0035357399513289904, "phrase": "transmitted_signal"}, {"score": 0.0034017706220810223, "phrase": "corresponding_eigenvalues"}, {"score": 0.003369076363771074, "phrase": "beam's_power"}, {"score": 0.003220596121589591, "phrase": "constant_power"}, {"score": 0.0029810774705309536, "phrase": "optimal_number"}, {"score": 0.002629160426591144, "phrase": "channel_realizations"}, {"score": 0.002570531747243578, "phrase": "signal-to-noise_ratio"}, {"score": 0.0025132071574192672, "phrase": "feedback_rate"}, {"score": 0.002386922774536045, "phrase": "imperfect_beamforming"}, {"score": 0.002371589020876307, "phrase": "quantization_bounds"}, {"score": 0.0023487724551034227, "phrase": "grassmann_manifold"}, {"score": 0.0022596753843232755, "phrase": "good_approximation"}, {"score": 0.0021809687586808522, "phrase": "proposed_strategy"}, {"score": 0.002139197034966045, "phrase": "performance_approximation"}, {"score": 0.0021049977753042253, "phrase": "experimented_snrs"}], "paper_keywords": ["Beamforming", " Grassmann manifold", " limited feedback", " multiple-input multiple-output (MIMO)", " power on/off", " precoding"], "paper_abstract": "It is well known that multiple-input multiple-output (MIMO) systems have high spectral efficiency, especially when channel state information at the transmitter (CSIT) is available. In many practical systems, it is reasonable to assume that the CSIT is obtained by a limited (i.e., finite rate) feedback and is therefore imperfect. We consider the design problem of how to use the limited feedback resource to maximize the achievable information rate. In particular, we develop a low complexity power on/off strategy with beamforming (or Grassmann precoding), and analytically characterize its performance. Given the eigenvalue decomposition of the covariance matrix of the transmitted signal, refer to the eigenvectors as beams, and to the corresponding eigenvalues as the beam's power. A power on/off strategy means that a beam is either turned on with a constant power, or turned off. We will first assume that the beams match the channel perfectly and show that the ratio between the optimal number of beams turned on and the number of antennas converges to a constant when the numbers of transmit and receive antennas approach infinity proportionally. This motivates our power on/off strategy where the number of beams turned on is independent of channel realizations but is a function of the signal-to-noise ratio (SNR). When the feedback rate is finite, beamforming cannot be perfect, and we characterize the effect of imperfect beamforming by quantization bounds on the Grassmann manifold. By combining the results for power on/off and beamforming, a good approximation to the achievable information rate is derived. Simulations show that the proposed strategy is near optimal and the performance approximation is accurate for all experimented SNRs.", "paper_title": "On the Information Rate of MIMO Systems With Finite Rate Channel State Feedback Using Beamforming and Power On/Off Strategy", "paper_id": "WOS:000271019700018"}