{"auto_keywords": [{"score": 0.05007458300714675, "phrase": "wikiidrank"}, {"score": 0.03520902264612844, "phrase": "wikipedia"}, {"score": 0.025129379116599966, "phrase": "wikipedia_text"}, {"score": 0.004671588539217021, "phrase": "wikiidrank_system"}, {"score": 0.004640311812502743, "phrase": "entity_linking."}, {"score": 0.004209539728590977, "phrase": "quick_and_accurate_way"}, {"score": 0.00407042677958844, "phrase": "structuring_process"}, {"score": 0.003989190971547073, "phrase": "tac"}, {"score": 0.0038314621564116192, "phrase": "automated_systems"}, {"score": 0.0037549546301384336, "phrase": "unstructured_information"}, {"score": 0.0036064757492752703, "phrase": "kbp_track"}, {"score": 0.0034755154823256588, "phrase": "named_entities"}, {"score": 0.0033718991936259038, "phrase": "reference_knowledge_base"}, {"score": 0.002664375650349975, "phrase": "different_modifications"}, {"score": 0.0025761937402886954, "phrase": "best_combination"}, {"score": 0.002524688179363081, "phrase": "initial_system"}, {"score": 0.002465895175961543, "phrase": "resultant_system"}, {"score": 0.0023053377085828415, "phrase": "kbp"}, {"score": 0.0021844290159501313, "phrase": "global_comparison"}, {"score": 0.0021407391538313786, "phrase": "human_supervision"}, {"score": 0.0021049977753042253, "phrase": "wikipedia_textual_contents"}], "paper_keywords": ["Knowledge base population", " named entity linking", " named entity disambiguation", " unsupervised knowledge discovery", " semantic web"], "paper_abstract": "The amount of information available on the Web has grown considerably in recent years, leading to the need to structure it in order to access it in a quick and accurate way. In order to develop techniques to automate the structuring process, the Knowledge Base Population (KBP) track of the Text Analysis Conference (TAC) was created. This forum aims to encourage research in automated systems capable of capturing knowledge in unstructured information. One of the tasks proposed in the context of the KBP track is named entity linking, and its goal is to link named entities mentioned in a document to instances in a reference knowledge base built from Wikipedia. This paper focuses on the entity linking task in the context of KBP 2010, where two different varieties of this task were considered, depending on whether the use of the text from Wikipedia was allowed or not. Specifically, the paper proposes a set of modifications to a system that participated in KBP 2010, named WikiIdRank, in order to improve its performance. The different modifications were evaluated in the official KBP 2010 corpus, showing that the best combination increases the accuracy of the initial system in a 7.04%. Though the resultant system, named WikiIdRank++, is unsupervised and does not take advantage of Wikipedia text, a comparison with other approaches in KBP indicates that the system would rank as 4th (out of 16) in the global comparison, outperforming other approaches that use human supervision and take advantage of Wikipedia textual contents. Furthermore, the system would rank as 1st in the category of systems that do not use Wikipedia text.", "paper_title": "WikiIdRank plus plus : EXTENSIONS AND IMPROVEMENTS OF THE WikiIdRank SYSTEM FOR ENTITY LINKING", "paper_id": "WOS:000320617300009"}