{"auto_keywords": [{"score": 0.04811914031577569, "phrase": "pervasive_computing_application"}, {"score": 0.03730575590231708, "phrase": "design_language"}, {"score": 0.00481495049065317, "phrase": "tool-based_development_methodology"}, {"score": 0.004770461993586338, "phrase": "pervasive_computing_applications"}, {"score": 0.0044289730051264116, "phrase": "conceptual_frameworks"}, {"score": 0.004228016636379321, "phrase": "heterogeneous_devices"}, {"score": 0.00411182818527434, "phrase": "distributed_systems_technologies"}, {"score": 0.00379961236486522, "phrase": "specific_code"}, {"score": 0.0034303736977646135, "phrase": "development_life-cycle"}, {"score": 0.00321425262806329, "phrase": "area-specific_building-blocks"}, {"score": 0.0028882701690741467, "phrase": "architectural_pattern"}, {"score": 0.0028218877037665484, "phrase": "pervasive_computing_domain"}, {"score": 0.0025712297362596574, "phrase": "design_artifacts"}, {"score": 0.0024658019116387845, "phrase": "programming_framework"}, {"score": 0.002420339995088838, "phrase": "subsequent_development_stages"}, {"score": 0.002236272403824371, "phrase": "wide_spectrum"}], "paper_keywords": ["Methodology", " domain-specific language", " generative programming", " pervasive computing", " toolkit", " programming support", " simulation"], "paper_abstract": "Despite much progress, developing a pervasive computing application remains a challenge because of a lack of conceptual frameworks and supporting tools. This challenge involves coping with heterogeneous devices, overcoming the intricacies of distributed systems technologies, working out an architecture for the application, encoding it in a program, writing specific code to test the application, and finally deploying it. This paper presents a design language and a tool suite covering the development life-cycle of a pervasive computing application. The design language allows us to define a taxonomy of area-specific building-blocks, abstracting over their heterogeneity. This language also includes a layer to define the architecture of an application, following an architectural pattern commonly used in the pervasive computing domain. Our underlying methodology assigns roles to the stakeholders, providing separation of concerns. Our tool suite includes a compiler that takes design artifacts written in our language as input and generates a programming framework that supports the subsequent development stages, namely, implementation, testing, and deployment. Our methodology has been applied on a wide spectrum of areas. Based on these experiments, we assess our approach through three criteria: expressiveness, usability, and productivity.", "paper_title": "Toward a Tool-Based Development Methodology for Pervasive Computing Applications", "paper_id": "WOS:000311556100012"}