{"auto_keywords": [{"score": 0.03174276842867588, "phrase": "conditional_heavy_hitters"}, {"score": 0.00481495049065317, "phrase": "interesting_correlations"}, {"score": 0.004769182299692333, "phrase": "data_streams"}, {"score": 0.004656647251517823, "phrase": "heavy_hitters"}, {"score": 0.004503525064934708, "phrase": "large_fraction"}, {"score": 0.004152230318165203, "phrase": "rfid"}, {"score": 0.0035632774896594524, "phrase": "correlated_pairs"}, {"score": 0.003300813776412652, "phrase": "particular_item"}, {"score": 0.002887028262617443, "phrase": "network_monitoring"}, {"score": 0.002859533151305368, "phrase": "markov_chain_modeling"}, {"score": 0.002648768009464535, "phrase": "analytically_and_experimentally_the_usefulness"}, {"score": 0.0024534993283766332, "phrase": "input_data"}, {"score": 0.0023840346303791032, "phrase": "analytical_results"}, {"score": 0.0022944576894161485, "phrase": "experimental_evaluations"}, {"score": 0.0021252533072727707, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "different_types"}], "paper_keywords": ["Streaming data", " Online algorithms", " Heavy hitters"], "paper_abstract": "The notion of heavy hitters-items that make up a large fraction of the population-has been successfully used in a variety of applications across sensor and RFID monitoring, network data analysis, event mining, and more. Yet this notion often fails to capture the semantics we desire when we observe data in the form of correlated pairs. Here, we are interested in items that are conditionally frequent: when a particular item is frequent within the context of its parent item. In this work, we introduce and formalize the notion of conditional heavy hitters to identify such items, with applications in network monitoring and Markov chain modeling. We explore the relationship between conditional heavy hitters and other related notions in the literature, and show analytically and experimentally the usefulness of our approach. We introduce several algorithm variations that allow us to efficiently find conditional heavy hitters for input data with very different characteristics, and provide analytical results for their performance. Finally, we perform experimental evaluations with several synthetic and real datasets to demonstrate the efficacy of our methods and to study the behavior of the proposed algorithms for different types of data.", "paper_title": "Conditional heavy hitters: detecting interesting correlations in data streams", "paper_id": "WOS:000354298200004"}