{"auto_keywords": [{"score": 0.03835682907912186, "phrase": "deliberative_multi-agent_mindreading"}, {"score": 0.025995457916087112, "phrase": "nuclear_deterrence"}, {"score": 0.00481495049065317, "phrase": "deliberative_mindreading"}, {"score": 0.0047517225918491226, "phrase": "computational_modeling"}, {"score": 0.004506968388996092, "phrase": "deadly_boa"}, {"score": 0.004433269427673633, "phrase": "smith"}, {"score": 0.003845500924733243, "phrase": "new_computational-logic_framework"}, {"score": 0.0035637545647574853, "phrase": "nuclear_strategy"}, {"score": 0.0032807941194429235, "phrase": "fifth-order_beliefs"}, {"score": 0.0032376465741070274, "phrase": "precise_deductive_reasoning"}, {"score": 0.003153041030690117, "phrase": "relevant_models"}, {"score": 0.003020232503089429, "phrase": "nuclear-strategy_realm"}, {"score": 0.002893047801744075, "phrase": "msp"}, {"score": 0.002707620139970122, "phrase": "arbitrarily_iterated_beliefs"}, {"score": 0.002673900184805184, "phrase": "earth"}, {"score": 0.0025509294021449254, "phrase": "modeling_framework"}, {"score": 0.002387415084371473, "phrase": "game_theory"}, {"score": 0.0023481972886024347, "phrase": "digital_games"}, {"score": 0.0023249757987087055, "phrase": "tabletop_games"}, {"score": 0.002226968099778524, "phrase": "possible_objections"}, {"score": 0.002161542155696987, "phrase": "ongoing_and_future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Nuclear deterrence", " Deliberative mindreading", " Deontic cognitive event calculus"], "paper_abstract": "Although the computational modeling of \"mindreading\" (e.g., believing that you believe that there's a deadly boa in the box, Smith mindreadingly predicts that you will refrain from removing the top) is well-established, this success has been achieved primarily in connection with scenarios that, relatively speaking, are both simple and common. Herein, we introduce a new computational-logic framework that allows formalization of mindreading of a rather more demanding sort: viz., deliberative multi-agent mindreading, applied to the realm of nuclear strategy. This form of mindreading, in this domain, is both complex and uncommon: it for example can quickly involve at least formulae reflecting fifth-order beliefs, and requires precise deductive reasoning over such iterated beliefs. In addition, the relevant models and simulations involve three, four, five agents, and sometimes many more. In the nuclear-strategy realm, for example, the better kind of modeling, simulation, and prediction (MSP) that our framework is intended to enable, should ultimately be capable of formalizing, at once, the arbitrarily iterated beliefs of at least every civilized nation on Earth. Based on our modeling, we present a set of desiderata that any modeling framework should satisy to be able to capture deliberative multi-agent mindreading in domains such as nuclear deterrence. Using our desiderata, we evaluate game theory, metagame theory, digital games, and tabletop games when used to model nuclear deterrence. Finally, we consider and rebut possible objections to our modeling paradigm and conclude with a map of ongoing and future work. (C) 2014 Published by Elsevier B.V.", "paper_title": "Nuclear deterrence and the logic of deliberative mindreading", "paper_id": "WOS:000330578400003"}