{"auto_keywords": [{"score": 0.0455130508584883, "phrase": "similarity-based_algorithms"}, {"score": 0.014961670913568108, "phrase": "patient_data"}, {"score": 0.013971190144861659, "phrase": "major_adverse_cardiac_events"}, {"score": 0.00481495049065317, "phrase": "cardiovascular_events_using_long-term_time-series_data"}, {"score": 0.004615656893404919, "phrase": "comparative_analysis"}, {"score": 0.004307099985737249, "phrase": "stratify_patients"}, {"score": 0.004192730391924712, "phrase": "traditional_approach"}, {"score": 0.0037937873032347, "phrase": "long-term_signals"}, {"score": 0.0033672608231654897, "phrase": "known_outcomes"}, {"score": 0.00334144503360907, "phrase": "risk_stratification"}, {"score": 0.003240139593712436, "phrase": "anomaly_detection_framework"}, {"score": 0.003034916887102753, "phrase": "elevated_risk"}, {"score": 0.002977061391551631, "phrase": "potential_utility"}, {"score": 0.002897906501262407, "phrase": "mismatch-based_algorithms"}, {"score": 0.002788454815865172, "phrase": "high_or_low_risk"}, {"score": 0.002683125911877974, "phrase": "large_population"}, {"score": 0.002631959004685823, "phrase": "symbolic_mismatch"}, {"score": 0.002344762593995099, "phrase": "available_long-term_electrocardiographic_data"}, {"score": 0.002326767693352058, "phrase": "symbolic_mismatch-based_comparative_approaches"}, {"score": 0.0022648637058989463, "phrase": "roughly_a_two-fold_increased_risk"}, {"score": 0.0021876814398268775, "phrase": "acute_coronary_syndrome"}], "paper_keywords": ["risk stratification", " cardiovascular disease", " time-series comparison", " symbolic analysis", " anomaly detection"], "paper_abstract": "In medicine, one often bases decisions upon a comparative analysis of patient data. In this paper, we build upon this observation and describe similarity-based algorithms to risk stratify patients for major adverse cardiac events. We evolve the traditional approach of comparing patient data in two ways. First, we propose similarity-based algorithms that compare patients in terms of their long-term physiological monitoring data. Symbolic mismatch identifies functional units in long-term signals and measures changes in the morphology and frequency of these units across patients. Second, we describe similarity-based algorithms that are unsupervised and do not require comparisons to patients with known outcomes for risk stratification. This is achieved by using an anomaly detection framework to identify patients who are unlike other patients in a population and may potentially be at an elevated risk. We demonstrate the potential utility of our approach by showing how symbolic mismatch-based algorithms can be used to classify patients as being at high or low risk of major adverse cardiac events by comparing their long-term electrocardiograms to that of a large population. We describe how symbolic mismatch can be used in three different existing methods: one-class support vector machines, nearest neighbor analysis, and hierarchical clustering. When evaluated on a population of 686 patients with available long-term electrocardiographic data, symbolic mismatch-based comparative approaches were able to identify patients at roughly a two-fold increased risk of major adverse cardiac events in the 90 days following acute coronary syndrome. These results were consistent even after adjusting for other clinical risk variables.", "paper_title": "Unsupervised Similarity-Based Risk Stratification for Cardiovascular Events Using Long-Term Time-Series Data", "paper_id": "WOS:000289635000008"}