{"auto_keywords": [{"score": 0.043871637004018804, "phrase": "social_knowledge_graph"}, {"score": 0.006745861202824492, "phrase": "dag"}, {"score": 0.00481495049065317, "phrase": "graphical_multicast_cost_sharing_games"}, {"score": 0.0047735489327932114, "phrase": "non-cooperative_games"}, {"score": 0.0047325016751114165, "phrase": "highly_decentralized_networks"}, {"score": 0.00429114801805935, "phrase": "chosen_strategy"}, {"score": 0.0038351438570038195, "phrase": "social_knowledge_graphs"}, {"score": 0.003802135020791801, "phrase": "fundamental_multicast_cost_sharing_game"}, {"score": 0.003651797365598713, "phrase": "undirected_network"}, {"score": 0.003609942041018041, "phrase": "classical_complete_information_case"}, {"score": 0.003407728065269377, "phrase": "total_number"}, {"score": 0.0032729341532134514, "phrase": "pure_nash_equilibria"}, {"score": 0.002975863677327411, "phrase": "classical_price"}, {"score": 0.0028663584600000023, "phrase": "specific_instances"}, {"score": 0.002362579221912841, "phrase": "fixed_instance"}, {"score": 0.0022365262201954643, "phrase": "new_window"}, {"score": 0.0021981315377404245, "phrase": "non-cooperative_systems"}, {"score": 0.0021541682088058677, "phrase": "total_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithmic game theory", " Nash equilibrium", " Social networks", " Price of anarchy"], "paper_abstract": "In non-cooperative games played on highly decentralized networks the assumption that each player knows the strategy adopted by any other player may be too optimistic or even infeasible. In such situations, the set of players of which each player knows the chosen strategy can be modeled by means of a social knowledge graph in which nodes represent players and there is an edge from i to j if i knows j. Following the framework introduced in 171, we study the impact of social knowledge graphs on the fundamental multicast cost sharing game in which all the players want to receive the same communication from a given source in an undirected network. In the classical complete information case, such a game is known to be highly inefficient, since its price of anarchy can be as high as the total number of players rho. We first show that, under our incomplete information setting, pure Nash equilibria always exist only if the social knowledge graph is directed acyclic (DAG). We then prove that the price of stability of any DAG is at least 1/2 log rho and provide a DAG lowering the classical price of anarchy to a value between 1/2 log rho and log(2) rho. If specific instances of the game are concerned, that is if the social knowledge graph can be selected as a function of the instance, we show that the price of stability is at least 4 rho/rho+3, and that the same bound holds also for the price of anarchy of any social knowledge graph (not only DAGs). Moreover, we provide a nearly matching upper bound by proving that, for any fixed instance, there always exists a DAG yielding a price of anarchy less than 4. Our results open a new window on how the performances of non-cooperative systems may benefit from the lack of total knowledge among players. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "When ignorance helps: Graphical multicast cost sharing games", "paper_id": "WOS:000274074600006"}