{"auto_keywords": [{"score": 0.03579325014887771, "phrase": "search_process"}, {"score": 0.015599567027237244, "phrase": "pattern_matching"}, {"score": 0.015012247011208547, "phrase": "genetic_algorithm"}, {"score": 0.014726807128007901, "phrase": "dhga"}, {"score": 0.013377904034445188, "phrase": "search_space"}, {"score": 0.00481495049065317, "phrase": "efficient_optimization"}, {"score": 0.004631758267671427, "phrase": "new_approach"}, {"score": 0.004542780650208743, "phrase": "hierarchical_genetic_algorithm"}, {"score": 0.004302593474473502, "phrase": "hybrid_technique"}, {"score": 0.0037853015963603682, "phrase": "hierarchical_way"}, {"score": 0.0037414662674652805, "phrase": "entire_space"}, {"score": 0.003329994649432498, "phrase": "whole_space"}, {"score": 0.003021781956684419, "phrase": "convergence_status"}, {"score": 0.002668420182908979, "phrase": "variable_resolution"}, {"score": 0.0025468074858862964, "phrase": "analytical_and_empirical_studies"}, {"score": 0.002421291757425244, "phrase": "conventional_ga"}, {"score": 0.0024025371556472557, "phrase": "dcga"}, {"score": 0.0023746766301040974, "phrase": "different_function_optimization_problems"}, {"score": 0.002205560249972527, "phrase": "edge_map"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["genetic algorithm", " optimization", " coarse-to-fine", " distributed", " variable resolution", " pattern matching"], "paper_abstract": "In this paper we propose a new approach in genetic algorithm called distributed hierarchical genetic algorithm (DHGA) for optimization and pattern matching. It is eventually a hybrid technique combining the advantages of both distributed and hierarchical processes in exploring the search space. The search is initially distributed over the space and then in each subspace the algorithm works in a hierarchical way. The entire space is essentially partitioned into a number of subspaces depending on the dimensionality of the space. This is done in order to spread the search process more evenly over the whole space. In each subspace the genetic algorithm is employed for searching and the search process advances from one hypercube to a neighboring hypercube hierarchically depending on the convergence status of the population and the solution obtained so far. The dimension of the hypercube and the resolution of the search space are altered with iterations. Thus the search process passes through variable resolution (coarse-to-fine) search space. Both analytical and empirical studies have been carried out to evaluate the performance between DHGA and distributed conventional GA (DCGA) for different function optimization problems. Further, the performance of the algorithms is demonstrated on problems like pattern matching and object matching with edge map. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "A distributed hierarchical genetic algorithm for efficient optimization and pattern matching", "paper_id": "WOS:000241837300017"}