{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gene_expression"}, {"score": 0.0201573866251328, "phrase": "microarray_data"}, {"score": 0.014588082925024922, "phrase": "evocluster"}, {"score": 0.004644451060812007, "phrase": "interesting_groupings"}, {"score": 0.004466519142879166, "phrase": "clustering_problems"}, {"score": 0.004399905285945236, "phrase": "application_domains"}, {"score": 0.004244040105917499, "phrase": "bioinformatics_research"}, {"score": 0.004205940624913343, "phrase": "inherent_clusters"}, {"score": 0.004044740057668712, "phrase": "popular_clustering_algorithms"}, {"score": 0.003901407184706592, "phrase": "simulated_and_real_data"}, {"score": 0.003511613254403125, "phrase": "novel_evolutionary_algorithm"}, {"score": 0.003397313647699294, "phrase": "entire_cluster"}, {"score": 0.003141675970409644, "phrase": "reproduction_operators"}, {"score": 0.003030247482854539, "phrase": "fitness_function"}, {"score": 0.0029139757013408926, "phrase": "feature_value"}, {"score": 0.002870449780891857, "phrase": "particular_cluster"}, {"score": 0.0024544817577464816, "phrase": "easy_interpretation"}, {"score": 0.0024324082074887858, "phrase": "casual_users"}, {"score": 0.0024105326885334962, "phrase": "performance_evaluation"}, {"score": 0.0021498542694398273, "phrase": "dna_sequences"}, {"score": 0.0021049977753042253, "phrase": "significant_biological_binding_sites"}], "paper_keywords": ["bioinformatics", " clustering", " DNA sequence analysis", " evolutionary algorithms (EAs)", " gene expression microarray data analysis"], "paper_abstract": "Clustering is concerned with the discovery of interesting groupings of records in a database. Many algorithms have been developed to tackle clustering problems in a variety of application domains. In particular, some of them have been used in bioinformatics research to uncover inherent clusters in gene expression microarray data. In this paper, we show how some popular clustering algorithms have been used for this purpose. Based on experiments using simulated and real data, we also show that the performance of these algorithms can be further improved. For more effective clustering of gene expression microarray data, which is typically characterized by a lot of noise, we propose a novel evolutionary algorithm called evolutionary clustering (EvoCluster). EvoCluster encodes an entire cluster grouping in a chromosome so that each gene in the chromosome encodes one cluster. Based on such encoding scheme, it makes use of a set of reproduction operators to facilitate the exchange of grouping information between chromosomes. The fitness function that the EvoCluster adopts is able to differentiate between how relevant a feature value is in determining a particular cluster grouping. As such, instead of just local pairwise distances, it also takes into consideration how clusters are arranged globally. Unlike many popular clustering algorithms, EvoCluster does not require the number of clusters to be decided in advance. Also, patterns hidden in each cluster can be explicitly revealed and presented for easy interpretation even by casual users. For performance evaluation, we have tested EvoCluster using both simulated and real data. Experimental results show that it can be very effective and robust even in the presence of noise and missing values. Also, when correlating the gene expression microarray data with DNA sequences, we were able to uncover significant biological binding sites (both previously known and unknown) in each cluster discovered by EvoCluster.", "paper_title": "An evolutionary clustering algorithm for gene expression microarray data analysis", "paper_id": "WOS:000237981300006"}