{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generative_power"}, {"score": 0.01778201765270195, "phrase": "acceptance_modes"}, {"score": 0.004589763483242731, "phrase": "formal_grammar"}, {"score": 0.004137184278868391, "phrase": "clean_and_uniform_definitions"}, {"score": 0.004007083686875716, "phrase": "systematic_study"}, {"score": 0.003789137457228946, "phrase": "complete_set"}, {"score": 0.003361069456060196, "phrase": "designated_elements"}, {"score": 0.003190878119415192, "phrase": "binary_relation"}, {"score": 0.0031028232755683674, "phrase": "normal_or_leftmost_derivations"}, {"score": 0.002730150696072947, "phrase": "special_forms"}, {"score": 0.0026654155072292707, "phrase": "epsilon-production-free_omega-grammars"}, {"score": 0.0025001755089445092, "phrase": "translation_techniques"}, {"score": 0.0023451553255837317, "phrase": "omega-_cfg"}, {"score": 0.002244178699939059, "phrase": "omega-_csg"}, {"score": 0.0022085455097790537, "phrase": "omega-_tm"}, {"score": 0.0021734768728417977, "phrase": "linear-bounded_omega-automata-like_devices"}, {"score": 0.0021049977753042253, "phrase": "remaining_open_problems"}], "paper_keywords": ["omega-automaton", " omega-grammar", " omega-language", " generative power"], "paper_abstract": "An omega-grammar is a formal grammar used to generate omega-words (i.e. infinite length words), while an omega-automaton is an automaton used to recognize omega-words. This paper gives clean and uniform definitions for omega-grammars and omega-automata, provides a systematic study of the generative power of omega-grammars with respect to omega-automata, and presents a complete set of results for various types of omega-grammars and acceptance modes. We use the tuple (sigma, rho, pi) to denote various acceptance modes, where sigma denotes that some designated elements should appear at least once or infinitely often, rho denotes some binary relation between two sets, and pi denotes normal or leftmost derivations. Technically, we propose (sigma, rho, pi)-accepting omega-grammars, and systematically study their relative generative power with respect to (sigma, rho)-accepting w-automata. We show how to construct some special forms of omega-grammars, such as epsilon-production-free omega-grammars. We study the equivalence or inclusion relations between omega-grammars and omega-automata by establishing the translation techniques. In particular, we show that, for some acceptance modes, the generative power of omega- CFG is strictly weaker than omega-PDA, and the generative power of omega- CSG is equal to omega- TM (rather than linear-bounded omega-automata-like devices). Furthermore, we raise some remaining open problems for two of the acceptance modes.", "paper_title": "On the Generative Power of omega-Grammars and omega-Automata", "paper_id": "WOS:000297871900001"}