{"auto_keywords": [{"score": 0.035719248733257394, "phrase": "image_data"}, {"score": 0.0047386923107107645, "phrase": "different_thresholds."}, {"score": 0.004517055580214742, "phrase": "research_method"}, {"score": 0.004445494322321316, "phrase": "protein_spots"}, {"score": 0.0038348235692738783, "phrase": "image_transfer"}, {"score": 0.0035973486787314883, "phrase": "important_proteins"}, {"score": 0.0034289106230496816, "phrase": "important_parts"}, {"score": 0.0027741761880779535, "phrase": "different_regions"}, {"score": 0.0027192536281209463, "phrase": "different_levels"}, {"score": 0.0024703502756471514, "phrase": "losses_compression_progressive_image_transmission_method"}, {"score": 0.0022712795176156536, "phrase": "experimental_results"}, {"score": 0.0021909411820497707, "phrase": "tsai_et_al"}, {"score": 0.0021049977753042253, "phrase": "quick_viewing"}], "paper_keywords": ["2D-GE image", " Two-dimensional gel electrophoresis", " Progressive image transmission"], "paper_abstract": "Two-Dimensional Gel Electrophoresis (2D-GE) images are one of the tools for protein research. The research method with images containing protein spots is called proteomics. Currently, there are many image databases on-line and biologists can use them through the internet. In order to transmit this type of data quickly, one of the,methods for image transfer is called the Progressive Image Transmission (PIT) method. Biologists are interested in spots, which might have important proteins residing inside the spots and it is important to transmit these important parts of the image data first. The Tsai et al. method provides a technique to transmit the more important parts of the images from the first several phases. However, the Tsai et al. method used only one (1) threshold to find these parts, which is not considered sufficient. This is due to the less important parts in different regions of the image data having different levels. If only one (1) threshold is used, there will be some loss of the more important parts of the image. For this reason, a losses compression progressive image transmission method was designed in this research that uses more than one (1) threshold to detect the more important parts Of an image. In the experimental results, the most important parts were detected better than the Tsai et al. method. And, this method allows the quick viewing of the location, size and color of the most important parts through the first several phases.", "paper_title": "A PROGRESSIVE IMAGE TRANSMISSION METHOD FOR 2D-GE IMAGE BASED ON CONTEXT FEATURE WITH DIFFERENT THRESHOLDS", "paper_id": "WOS:000263795500013"}