{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_overload"}, {"score": 0.004469042910390712, "phrase": "online_shoppers"}, {"score": 0.004413846562278824, "phrase": "abundant_information"}, {"score": 0.004252296935371162, "phrase": "previous_studies"}, {"score": 0.004199766284749713, "phrase": "mixed_results"}, {"score": 0.0034634973175137486, "phrase": "different_review_valences"}, {"score": 0.0030204580407008214, "phrase": "clear_evidence"}, {"score": 0.0029462012558267863, "phrase": "information_overload_increases"}, {"score": 0.0026013505538490223, "phrase": "purchase_decisions"}, {"score": 0.002444333100610621, "phrase": "review_valence"}, {"score": 0.0023546984428119864, "phrase": "different_information_sources"}, {"score": 0.002131383155056741, "phrase": "interesting_implications"}, {"score": 0.0021049977753042253, "phrase": "design_guidelines"}], "paper_keywords": [""], "paper_abstract": "Online consumer reviews have become a substantial component of e-commerce and provide online shoppers with abundant information about products. However, previous studies provided mixed results about whether consumers experience information overload from such a vast volume of reviews. Thus, this study investigates how users perceive products depending on various numbers of reviews (from 0 to 3,000 reviews) and different review valences (generally positive, generally negative, and divided). Two crowdsourced studies with 1,783 participants were conducted. The study found no clear evidence to suggest that information overload increases as the number of reviews increases. Instead, the participants relied on a very limited number of reviews in making purchase decisions. In addition, it was observed that the review valence affected how the participants used different information sources from the interface. Based on the results, this article provides a set of interesting implications and design guidelines.", "paper_title": "Do People Really Experience Information Overload While Reading Online Reviews?", "paper_id": "WOS:000366419600009"}