{"auto_keywords": [{"score": 0.0409658163863962, "phrase": "multimedia_content"}, {"score": 0.02402394767470177, "phrase": "drm_systems"}, {"score": 0.007805906405494881, "phrase": "governed_distribution"}, {"score": 0.00699196449108749, "phrase": "complete_digital_value_chain"}, {"score": 0.0068343906011217965, "phrase": "verification_algorithms"}, {"score": 0.00481495049065317, "phrase": "governed_use"}, {"score": 0.004547656324173302, "phrase": "different_verification_algorithms"}, {"score": 0.004444921827311577, "phrase": "digital_rights_management"}, {"score": 0.004118874671285618, "phrase": "increased_interest"}, {"score": 0.003391290302481397, "phrase": "digital_assets"}, {"score": 0.003047865053078826, "phrase": "complete_distribution_chain"}, {"score": 0.0027079507175554857, "phrase": "proper_way"}, {"score": 0.00266693888510356, "phrase": "child_licences"}, {"score": 0.0021049977753042253, "phrase": "content_creators"}], "paper_keywords": ["intellectual property", " data security", " algorithmic languages", " multimedia standards"], "paper_abstract": "Purpose - The purpose of this paper is to present different verification algorithms that will be used by digital rights management (DRM) systems to enable the governed distribution, super-distribution and offers of multimedia content. An issue of increased interest in DRM systems is the control of the creation, distribution and consumption of multimedia content through the complete digital value chain. Design/methodology/approach - The design and implementation of verification algorithms based on licences is described. Tools implementing these algorithms are used by DRM systems in 13213 and B2C models where the distribution, offer and consumption of digital assets are controlled. Some use cases regarding the distribution, super-distribution and offer models are presented. Findings - It has been demonstrated that DRM systems governing the use of multimedia content through the complete distribution chain can use the verification algorithms proposed in this paper to enable governed distribution of multimedia content. By using these algorithms, they can determine whether the rights have been passed in a proper way from parent to child licences. Moreover, these systems can also enforce the rights when distributing multimedia content. Originality/value - The algorithms proposed can be used by DRM systems that control the use of multimedia content through the complete digital value chain. These algorithms have been designed to ensure that the permissions and constraints passed from parent to child licences have been done according to the terms determined by content creators or distributors.", "paper_title": "Verification algorithms for governed use of multimedia content", "paper_id": "WOS:000245043600004"}