{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "live_streaming_media_workload"}, {"score": 0.004722038375317162, "phrase": "thorough_characterization"}, {"score": 0.004577076689777069, "phrase": "first_significant_live_internet_streaming_media_workload"}, {"score": 0.0038106195546165574, "phrase": "live_versus_stored_objects"}, {"score": 0.0037516215763875225, "phrase": "stored_objects"}, {"score": 0.0034162643819889054, "phrase": "interesting_dualities"}, {"score": 0.00331125524068286, "phrase": "zipf-like_profile"}, {"score": 0.0031351720217878917, "phrase": "classic_zipf-like_popularity"}, {"score": 0.0029916929549256297, "phrase": "transfer_lengths"}, {"score": 0.002865929543375884, "phrase": "client_stickiness"}, {"score": 0.0028325548627901004, "phrase": "particular_live_object"}, {"score": 0.002559072326933071, "phrase": "live_media"}, {"score": 0.002549096826249, "phrase": "access_workloads"}, {"score": 0.00243237365704391, "phrase": "live_content"}, {"score": 0.0023391880766516285, "phrase": "strong_temporal_correlation"}, {"score": 0.002223351523626989, "phrase": "synchronous_access"}, {"score": 0.0021049977753042253, "phrase": "live_media_workload_generation"}], "paper_keywords": [""], "paper_abstract": "We present a thorough characterization of what we believe to be the first significant live Internet streaming media workload in the scientific literature. Our characterization of over 3.5 million requests spanning a 28-day period is done at three increasingly granular levels, corresponding to clients, sessions, and transfers. Our findings support two important conclusions. First, we show that the nature of interactions between users and objects is fundamentally different for live versus stored objects. Access to stored objects is user driven, whereas access to live objects is object driven. This reversal of active/passive roles of users and objects leads to interesting dualities. For instance, our analysis underscores a Zipf-like profile for user interest in a given object, which is in contrast to the classic Zipf-like popularity of objects for a given user. Also, our analysis reveals that transfer lengths are highly variable and that this variability is due to client stickiness to a particular live object, as opposed to structural (size) properties of objects. Second, by contrasting two live streaming workloads from two radically different applications, we conjecture that some characteristics of live media access workloads are likely to be highly dependent on the nature of the live content being accessed. This dependence is clear from the strong temporal correlation observed in the traces, which we attribute to the impact of synchronous access to live content. Based on our analysis, we present a model for live media workload generation that incorporates many of our findings, and which we implement in GISMO.", "paper_title": "A hierarchical characterization of a live streaming media workload", "paper_id": "WOS:000235479700011"}