{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mining_large_protein-protein_interaction_networks"}, {"score": 0.004231089088705995, "phrase": "different_clusters"}, {"score": 0.0040215052006051235, "phrase": "challenging_task"}, {"score": 0.003929689573550262, "phrase": "suitable_compromise"}, {"score": 0.0038756055612167942, "phrase": "biological_relevance"}, {"score": 0.0037696519417841287, "phrase": "comprehensive_coverage"}, {"score": 0.0037177622939493084, "phrase": "analyzed_networks"}, {"score": 0.003616108223034427, "phrase": "high_accurate_results"}, {"score": 0.003468796799802612, "phrase": "input_ppi_network"}, {"score": 0.0034052594710793664, "phrase": "low-characterized_networks"}, {"score": 0.0032968474833776906, "phrase": "coclustering-based_technique"}, {"score": 0.0032215231177304513, "phrase": "overlapping_and_nonoverlapping_clusters"}, {"score": 0.0025447065763362984, "phrase": "good_compromise"}, {"score": 0.002498053212249228, "phrase": "network_coverage"}, {"score": 0.0023198180380964305, "phrase": "input_network"}, {"score": 0.002164264600379492, "phrase": "yeast_network"}, {"score": 0.0021147618956483556, "phrase": "human_network"}], "paper_keywords": ["Coclustering", " biological networks", " protein-protein interaction networks", " protein complexes", " hub proteins"], "paper_abstract": "Several approaches have been presented in the literature to cluster Protein-Protein Interaction (PPI) networks. They can be grouped in two main categories: those allowing a protein to participate in different clusters and those generating only nonoverlapping clusters. In both cases, a challenging task is to find a suitable compromise between the biological relevance of the results and a comprehensive coverage of the analyzed networks. Indeed, methods returning high accurate results are often able to cover only small parts of the input PPI network, especially when low-characterized networks are considered. We present a coclustering-based technique able to generate both overlapping and nonoverlapping clusters. The density of the clusters to search for can also be set by the user. We tested our method on the two networks of yeast and human, and compared it to other five well-known techniques on the same interaction data sets. The results showed that, for all the examples considered, our approach always reaches a good compromise between accuracy and network coverage. Furthermore, the behavior of our algorithm is not influenced by the structure of the input network, different from all the techniques considered in the comparison, which returned very good results on the yeast network, while on the human network their outcomes are rather poor.", "paper_title": "A Coclustering Approach for Mining Large Protein-Protein Interaction Networks", "paper_id": "WOS:000301293900008"}