{"auto_keywords": [{"score": 0.04822150491313864, "phrase": "computer-assisted_formative_assessment"}, {"score": 0.015719716506582538, "phrase": "student_performance"}, {"score": 0.012480594409951966, "phrase": "formative_assessment"}, {"score": 0.010435409021063343, "phrase": "computer-assisted_practice_tests"}, {"score": 0.004751889650408546, "phrase": "first-year_geography_course"}, {"score": 0.004092168350316413, "phrase": "computer-assisted_multiple-choice_practice_tests"}, {"score": 0.003698442219929622, "phrase": "multiple-choice_questions"}, {"score": 0.00307431840409833, "phrase": "feedback_questionnaires"}, {"score": 0.00303398491761013, "phrase": "academic_years"}, {"score": 0.002717750004930131, "phrase": "in-class_midterms"}, {"score": 0.002658562959236011, "phrase": "statistical_analysis"}, {"score": 0.0026352496813713292, "phrase": "in-class_performance"}, {"score": 0.0025328377393370642, "phrase": "computer-assisted_practice"}, {"score": 0.002499590390751339, "phrase": "significantly_higher_grades"}, {"score": 0.0022192891418394535, "phrase": "case_practice_tests"}, {"score": 0.0021805201234139475, "phrase": "positive_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-assisted assessment", " Formative assessment", " Practice tests", " Learning strategies", " Universal design for learning"], "paper_abstract": "The main objective of this paper is to examine the effectiveness of computer-assisted formative assessment in a large, first-year undergraduate geography course. In particular, the paper evaluates the impact of computer-assisted multiple-choice practice tests on student performance in the course as well as student opinions of this type of formative assessment in two academic years (2008 and 2009). The multiple-choice questions included in the formative assessment vary in their level of difficulty and range from those that focus on knowledge and comprehension to those that focus on application and analysis. While the use of the computer-assisted practice tests is completely voluntary over 50 percent of students used them. Feedback questionnaires from both academic years reveals that students are overwhelmingly positive with over 95 percent indicating that the computer-assisted practice tests assist them in identifying their strengths and weaknesses and help them prepare for in-class midterms and final exams. Statistical analysis of in-class performance on midterms shows that students who use the computer-assisted practice quizzes earn significantly higher grades (i.e., equivalent to three letter grades) than those students who do not. The results of the research demonstrate that computer-assisted formative assessment (in this case practice tests) has a positive impact on student performance. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Improving student performance in a first-year geography course: Examining the importance of computer-assisted formative assessment", "paper_id": "WOS:000292437400004"}