{"auto_keywords": [{"score": 0.03447334788867727, "phrase": "stable_nodes"}, {"score": 0.008266329591796054, "phrase": "service_provider_overlay"}, {"score": 0.008080451483325351, "phrase": "local_links"}, {"score": 0.007544436644573046, "phrase": "local_cluster"}, {"score": 0.006821491738564865, "phrase": "local_clusters"}, {"score": 0.005524752531296326, "phrase": "dynamic_nature"}, {"score": 0.005461766087825917, "phrase": "dynamic_nodes"}, {"score": 0.005028864982067103, "phrase": "proposed_system"}, {"score": 0.00481495049065317, "phrase": "-peer_systems"}, {"score": 0.004484793903506666, "phrase": "node"}, {"score": 0.004412780054037622, "phrase": "short_network_distance"}, {"score": 0.004382492183629855, "phrase": "remote_link"}, {"score": 0.004322535972320132, "phrase": "remote_nodes"}, {"score": 0.0038802832668554457, "phrase": "remote_links"}, {"score": 0.003697538418750941, "phrase": "intra-cluster_query_processes"}, {"score": 0.0036301992752948956, "phrase": "simple_search_methods"}, {"score": 0.0035395987202335223, "phrase": "dynamic_character"}, {"score": 0.0035072146967082083, "phrase": "decentralized_distribution"}, {"score": 0.0033961782274326948, "phrase": "up-to-date_resource_distribution_information"}, {"score": 0.0033190180867511605, "phrase": "inter-cluster_query"}, {"score": 0.0032065418360603263, "phrase": "longer_time"}, {"score": 0.0031193028729331667, "phrase": "resource_distribution"}, {"score": 0.002945081009084692, "phrase": "differentiated_publishing"}, {"score": 0.002858355214906446, "phrase": "large_areas"}, {"score": 0.002704881797334006, "phrase": "decentralized_topology"}, {"score": 0.002461472107682778, "phrase": "small_portion"}, {"score": 0.0024501740852758505, "phrase": "super_nodes"}, {"score": 0.002405496949144104, "phrase": "high_query_success_rate"}, {"score": 0.0023453899049149535, "phrase": "resource_indices"}, {"score": 0.00226583335721762, "phrase": "maintenance_cost"}, {"score": 0.0022296340517805125, "phrase": "search_traffic"}, {"score": 0.0021789194955896102, "phrase": "shrunken_search_scope"}, {"score": 0.0021490449563443025, "phrase": "proposed_diffpublishing_architecture"}], "paper_keywords": [""], "paper_abstract": "To make P2P (Peer-to-Peer) logical overlay network match the physical topology, cluster-based P2P systems have been proposed. In such systems, nodes maintain two types of links: local link and remote link. Node uses local links to cluster nodes with short network distance and the remote link to build connections with some remote nodes according to certain rules. When a query is generated, it is first processed in local cluster (intra-cluster query) based on local links, and if it fails, it will be selectively relayed to other clusters (inter-cluster query) based on remote links. Because the number of nodes and the distance between nodes in local clusters are small compared to the entire P2P network, intra-cluster query processes can get high efficiency just using some simple search methods such as Flooding or Random Walk. Nevertheless, the dynamic character of nodes and decentralized distribution of resources in the systems make the nodes in one cluster difficult to maintain up-to-date resource distribution information in other clusters. Thus, the efficiency of inter-cluster query is limited. In P2P systems, stable nodes have much longer online time, so they have a longer time to let other nodes download resources from them. Also, maintaining resource distribution of stable nodes can cause much less traffic, incurred by the dynamic nature of nodes, than dynamic nodes. Based on the above analysis, we propose the Differentiated Publishing (DiffPublishing) architecture by letting resources of stable nodes serve queries in large areas and having resources of dynamic nodes answer queries in local clusters. In the proposed system, the resources of the stable nodes are indexed by a decentralized topology: service provider overlay. When a query is generated, it is first processed in the local cluster, and if it fails, it will be forwarded to the service provider overlay. Because most resources in P2P systems are provided by a small portion of super nodes that tend to be stable, a high query success rate can be achieved in the service provider overlay. Also, maintaining resource indices of stable nodes can save much traffic caused by the dynamic nature of nodes, so the maintenance cost in service provider overlay is not expensive. Search traffic in the proposed system is dramatically reduced due to the shrunken search scope. More importantly, the proposed DiffPublishing architecture can be easily deployed in existing cluster-based P2P systems to improve their inter-cluster query processes.", "paper_title": "Improving Cluster-Based Peer-to-Peer Systems", "paper_id": "WOS:000265103800076"}