{"auto_keywords": [{"score": 0.046232683509134974, "phrase": "icu"}, {"score": 0.04324399365172852, "phrase": "medical_staff"}, {"score": 0.014339849363020456, "phrase": "medical_decision_support_services"}, {"score": 0.004661022795309889, "phrase": "icu."}, {"score": 0.004575272950516775, "phrase": "computer_aided_decision_making"}, {"score": 0.004307286039184164, "phrase": "medical_data"}, {"score": 0.004228016636379321, "phrase": "present_results"}, {"score": 0.003610292749660581, "phrase": "appropriate_actions"}, {"score": 0.0032593915869553714, "phrase": "large_amount"}, {"score": 0.003096905353118796, "phrase": "daily_basis"}, {"score": 0.002795762692061496, "phrase": "jain_slee"}, {"score": 0.0025592969422491476, "phrase": "appropriate_services"}, {"score": 0.0023646866829474798, "phrase": "design_details"}, {"score": 0.002331909406363425, "phrase": "evaluation_results"}, {"score": 0.0021049977753042253, "phrase": "strict_time_constraints"}], "paper_keywords": ["Intensive Care Units", " computer assisted decision making", " software architectures", " computer systems evaluation", " high performance computing"], "paper_abstract": "The importance of computer aided decision making is continuously increasing. In the ICU, medical decision support services gather and process medical data of patients and present results and suggestions to the medical staff. The medical decision support services can monitor for example blood pressure, creatinine levels or the usage of antibiotics. If certain levels are crossed, they raise alerts so that the medical staff can take appropriate actions if required. This significantly reduces the amount of data needing to be processed by the medical staff. To handle the large amount of data that is generated by the ICU on a daily basis, a platform for routing and processing this data is necessary. In this paper we propose a platform based on JAIN SLEE and an Enterprise Service Bus. The platform takes care of the routing of the data to the appropriate services and allows to easily deploy and manage services. In this paper, we present the design details and the evaluation results. Furthermore, it is shown that the platform is capable of routing and processing all the events generated by the ICU within strict time constraints. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Design of a JAIN SLEE/ESB-based platform for routing medical data in the ICU", "paper_id": "WOS:000258258400009"}