{"auto_keywords": [{"score": 0.042539794061343325, "phrase": "social_media"}, {"score": 0.014885988331749166, "phrase": "work-related_social_media_questionnaire"}, {"score": 0.004814951205790945, "phrase": "beneficial"}, {"score": 0.00476697427418509, "phrase": "harmful_work-related"}, {"score": 0.00392100783796804, "phrase": "key_gap"}, {"score": 0.0036188435232325337, "phrase": "qualitative_critical_incident_study"}, {"score": 0.00347657813672945, "phrase": "social_media_behaviors"}, {"score": 0.0033905067962602515, "phrase": "work_performance"}, {"score": 0.0028877818105020434, "phrase": "criterion-related_validity_evidence"}, {"score": 0.002816246391862638, "phrase": "wsmq._behaviors"}, {"score": 0.002719055901632759, "phrase": "job_performance"}, {"score": 0.002509284173541882, "phrase": "actual_job_performance"}, {"score": 0.0022133711375320266, "phrase": "limited_value"}, {"score": 0.0021049977753042253, "phrase": "particular_plan"}], "paper_keywords": ["social media", " job performance", " taxonomy", " work", " workplace", " counterproductive work behavior", " contextual performance", " task performance", " adaptive performance", " WSMQ", " survey"], "paper_abstract": "Although social media are increasingly used by employees during work, little is known about what employees are actually doing on social media or why. To remedy this key gap in the literature, a series of three studies were conducted. In Study 1, a qualitative critical incident study was conducted to develop a taxonomy of social media behaviors that are beneficial to work performance, along with a taxonomy of behaviors that are harmful. In Study 2, the Work-related Social Media Questionnaire (WSMQ) was developed to measure these behaviors. In Study 3, cross-validation and criterion-related validity evidence was collected on the WSMQ. Behaviors identified by employees as harmful to job performance were positively related to counterproductive work behaviors and negatively related to task, contextual, and adaptive job performance. Behaviors identified by employees as beneficial to job performance were generally unrelated to actual job performance. Thus, behaviors identified as harmful by employees were indeed harmful, but behaviors identified as beneficial were not beneficial. This suggests limited value in permitting access to social media by employees without a particular plan in place to utilize the features of social media productively.", "paper_title": "Validation of the Beneficial and Harmful Work-Related Social Media Behavioral Taxonomies: Development of the Work-Related Social Media Questionnaire", "paper_id": "WOS:000342807900005"}