{"auto_keywords": [{"score": 0.04580913817161026, "phrase": "qms"}, {"score": 0.013938357008389747, "phrase": "cqma_expert"}, {"score": 0.00481495049065317, "phrase": "auditing_quality_management_systems"}, {"score": 0.0046238380150870435, "phrase": "construction_quality_management_audit"}, {"score": 0.004422325007817267, "phrase": "quality_management_system"}, {"score": 0.004298666679374568, "phrase": "construction_firm"}, {"score": 0.0041784516085055035, "phrase": "matlab's_gui_components"}, {"score": 0.004061584718427419, "phrase": "cqma_expert's_rule_base"}, {"score": 0.0038375280115736958, "phrase": "quality_requirements"}, {"score": 0.003685067218455088, "phrase": "audit_inputs"}, {"score": 0.0036257863613963245, "phrase": "consistent_decisions"}, {"score": 0.0034817084307034955, "phrase": "interactive_user_interface"}, {"score": 0.003210446135114967, "phrase": "continuous_quality_improvement"}, {"score": 0.0026530590435527527, "phrase": "burdensome_process"}, {"score": 0.002578745296475411, "phrase": "audit_results"}, {"score": 0.00235843888868088, "phrase": "different_auditors"}, {"score": 0.00233936726307301, "phrase": "different_quality_management_processes"}, {"score": 0.0021922308351126746, "phrase": "test_equipment"}], "paper_keywords": [""], "paper_abstract": "This article introduces a system called Construction Quality Management Audit (CQMA) Expert that assesses the performance of a quality management system (QMS) implemented in a construction firm. CQMA Expert is programmed by using MATLAB's GUI components and its Fuzzy Logic Toolbox. CQMA Expert's rule base is constructed using information obtained from auditors of QMSs. CQMA Expert imports the quality requirements relative to the many quality management processes specified in ISO 9000, processes audit inputs, and generates consistent decisions relative to conformance to standards. It provides an interactive user interface for recording evidence collected during the audit and clearly states the reasons for the conclusions. It contributes to continuous quality improvement because (1) it enhances the maintenance of a QMS by quantifying its performance, (2) it assists with and facilitates the implementation of the duties of auditors in charge of assessing the performance of a QMS, (3) it simplifies the burdensome process involved in keeping track of the audit results of the many quality management processes investigated, and (4) it reduces the impact of the variability caused by the use of different auditors assessing different quality management processes. Case studies based on Section 4.11 of the ISO 9000 standard entitled \"Control of inspection, measuring and test equipment\" are used to illustrate the system and verify its usability and validity.", "paper_title": "An Expert System for Auditing Quality Management Systems in Construction", "paper_id": "WOS:000295077800003"}