{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "traffic_localization"}, {"score": 0.004630755876583033, "phrase": "first_and_most_extensive_characterizations"}, {"score": 0.004517210371632577, "phrase": "organic_groups"}, {"score": 0.0037561467438280175, "phrase": "better_performance"}, {"score": 0.0037163618245226755, "phrase": "user_experience"}, {"score": 0.003486316700608598, "phrase": "different_continents"}, {"score": 0.003412833120814178, "phrase": "large-scale_closed_communities"}, {"score": 0.0028984332556216946, "phrase": "network_providers"}, {"score": 0.002777463594061196, "phrase": "important_lessons"}, {"score": 0.0027577972695911825, "phrase": "ongoing_research"}, {"score": 0.0026900523406547827, "phrase": "isp_boundaries"}, {"score": 0.002559501330352064, "phrase": "heterogeneous_access_technologies"}, {"score": 0.0024094425220967273, "phrase": "seed-like_behavior"}, {"score": 0.0023754296478100865, "phrase": "high-bandwidth_access_technologies"}, {"score": 0.002268161377269513, "phrase": "internet_peering_links"}, {"score": 0.0021967433763351884, "phrase": "significant_increase"}, {"score": 0.0021657265492371976, "phrase": "internal_links"}, {"score": 0.0021049977753042253, "phrase": "network_links"}], "paper_keywords": ["Peer-to-peer networks", " Internet measurements"], "paper_abstract": "In this paper, we present one of the first and most extensive characterizations of closed community-based P2P systems. Such systems are organic groups of peer-to-peer (P2P) clients, which can be joined only by users belonging to a certain network (e.g., connected to a given Internet Service Provider (ISP)). A number of factors motivate the growth of these communities, such as quality of content, anonymity of transfers, and the potential for better performance that enhances user experience. Our study is conducted in two contrasting environments-a campus network and a national ISP-located in different continents. In both cases, large-scale closed communities have been found to be the predominant P2P systems in use. We shed light both on the factors motivating the growth of such communities, and present results characterizing the extensiveness of their usage, the performance achievable by the systems, and the implications of such communities for network providers. While our findings are interesting in their own right, they also offer important lessons for ongoing research that seeks to localize traffic within ISP boundaries. In particular, our results suggest that (i) in ISPs with heterogeneous access technologies, the performance benefits to users on localizing P2P traffic is largely dependent on the degree of seed-like behavior of peers behind high-bandwidth access technologies; and (ii) while localization can reduce the traffic on Internet peering links, it has the potential to cause a significant increase in traffic on internal links of providers, potentially requiring upgrades of network links.", "paper_title": "Characterization of community based-P2P systems and implications for traffic localization", "paper_id": "WOS:000313868100002"}