{"auto_keywords": [{"score": 0.027574967571943197, "phrase": "authentication_security"}, {"score": 0.004743594110762319, "phrase": "ghost_compromising_attack"}, {"score": 0.004490842671590769, "phrase": "upmost_importance"}, {"score": 0.004294052530714228, "phrase": "traditional_authentication_schemes"}, {"score": 0.0038102613924627647, "phrase": "first_attempt"}, {"score": 0.0035183010916001664, "phrase": "possible_attacks"}, {"score": 0.0034146585649631692, "phrase": "channel_eavesdropping_attack"}, {"score": 0.003380791705551809, "phrase": "credential_compromise_attack"}, {"score": 0.003347259612209552, "phrase": "function_compromise_attack"}, {"score": 0.0032975819773787985, "phrase": "ghost_compromise_attack"}, {"score": 0.0031372369299648233, "phrase": "corresponding_adversaries"}, {"score": 0.0025571463140118805, "phrase": "proposed_models"}, {"score": 0.0022573076362326135, "phrase": "concrete_authentication_protocols"}, {"score": 0.0021798257311714665, "phrase": "uniform_authentication_framework"}, {"score": 0.0021049977753042253, "phrase": "possible_authentication_mechanisms"}], "paper_keywords": [""], "paper_abstract": "In Machine-to-Machine (M2M) communications, authentication of a device is of upmost importance for applications of Internet of Things. As traditional authentication schemes always assume the presence of a person, most authentication technologies cannot be applied in machine-centric M2M context. In this paper, we make the first attempt to formally model the authentication in M2M. We first model four attacking adversaries that can formulate all possible attacks in M2M, which are channel eavesdropping attack, credential compromise attack, function compromise attack, and ghost compromise attack. Next, we propose four models to tackle those corresponding adversaries, namely, credential-based model, machine-metrics-based model, reference-based model, and witness-based model. We also illustrate several concrete attacking methods and authentication approaches. We proof the authentication security for all proposed models and compare them for clarity. Our models present soundness and completeness in terms of authentication security, which can guide the design and analysis of concrete authentication protocols. Particularly, we construct a uniform authentication framework for M2M context and point out all possible authentication mechanisms in M2M.", "paper_title": "How to Authenticate a Device? Formal Authentication Models for M2M Communications Defending against Ghost Compromising Attack", "paper_id": "WOS:000315231700001"}