{"auto_keywords": [{"score": 0.04624748036146564, "phrase": "manets"}, {"score": 0.00481495049065317, "phrase": "cartography_enhanced_olsr."}, {"score": 0.004224627834741731, "phrase": "obstructing_obstacles"}, {"score": 0.003910278811774747, "phrase": "obstacle_map"}, {"score": 0.00368442237104581, "phrase": "dynamic_and_autonomic_detection"}, {"score": 0.003369778677878286, "phrase": "enhanced_cartography_optimized_link_state"}, {"score": 0.00333021059234429, "phrase": "ce"}, {"score": 0.003232254571848865, "phrase": "extra_signaling_overhead"}, {"score": 0.003009390313137981, "phrase": "extensive_simulations"}, {"score": 0.0027852126030055305, "phrase": "obstacle_area"}, {"score": 0.0027522340188241446, "phrase": "high_coverage"}, {"score": 0.002719644855867468, "phrase": "efficient_precision_ratios"}, {"score": 0.002608583927848071, "phrase": "proposed_scheme"}, {"score": 0.002399850604120431, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "obstructing_obstacle_map"}], "paper_keywords": [""], "paper_abstract": "The presence of obstructing obstacles severely degrades the efficiency of routing protocols in MANETs. To mitigate the effect of these obstructing obstacles, routing in MANETs is usually based on the a priori knowledge of the obstacle map. In this paper, we investigate rather the dynamic and autonomic detection of obstacles that might stand within the network. This is accomplished using the enhanced cartography optimized link state routing CE-OLSR with no extra signaling overhead. The evaluation of the performance of our proposed detection scheme is accomplished through extensive simulations using OMNET++. Results clearly show the ability of our proposed scheme to accurately delimit the obstacle area with high coverage and efficient precision ratios. Furthermore, we integrated the proposed scheme into CE-OLSR to make it capable of autonomously detecting and avoiding obstacles. Simulation results show the effectiveness of such an integrated protocol that provides the same route validity as that of CE-OLSR-OA which is based on the a priori knowledge of the obstructing obstacle map.", "paper_title": "Autonomic Obstacle Detection and Avoidance in MANETs Driven by Cartography Enhanced OLSR", "paper_id": "WOS:000360461700001"}