{"auto_keywords": [{"score": 0.04621807134587006, "phrase": "customer_loyalty"}, {"score": 0.034121716542078906, "phrase": "perceived_e-service_quality"}, {"score": 0.03343410130414582, "phrase": "perceived_value"}, {"score": 0.00481495049065317, "phrase": "examining_e-"}, {"score": 0.004617187934074393, "phrase": "risk-_value"}, {"score": 0.0045213598841171935, "phrase": "inherently_virtual_nature"}, {"score": 0.004483585361583022, "phrase": "online_environments"}, {"score": 0.003838791650587681, "phrase": "value-driven_perspectives"}, {"score": 0.003743310268453678, "phrase": "quality-satisfaction-loyalty_paradigm"}, {"score": 0.003696460568091852, "phrase": "extrinsic_cue-quality-risk-value_chain"}, {"score": 0.003485437176235259, "phrase": "integrated_quality-risk-value_perspective"}, {"score": 0.0033280910751441522, "phrase": "theoretical_research_model"}, {"score": 0.00325893016361821, "phrase": "mediation_effects"}, {"score": 0.003059925849144792, "phrase": "electronic_word"}, {"score": 0.002873038567884343, "phrase": "rigorous_statistical_methods"}, {"score": 0.002289667393538803, "phrase": "sequential_causal_relationships"}, {"score": 0.002270495425498003, "phrase": "key_extrinsic_cues"}, {"score": 0.0021678771715091492, "phrase": "customer_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "theoretical_and_practical_implications"}], "paper_keywords": ["customer loyalty", " electronic word-of-mouth", " eWOM", " mediating effects", " perceived risk-value model", " quality-satisfaction-loyalty chain"], "paper_abstract": "Because of the inherently virtual nature of online environments, maintaining customer loyalty on business-to-customer (B2C) e-commerce websites is a challenging task. Although there have been many e-commerce studies that investigate customer loyalty in various B2C contexts, none of them have examined loyalty by simultaneously adopting quality-, risk-, and value-driven perspectives. This study integrates the quality-satisfaction-loyalty paradigm and the extrinsic cue-quality-risk-value chain to develop a theoretical model of customer loyalty that is based on an integrated quality-risk-value perspective. Data collected from 542 experienced online shoppers are used to validate the theoretical research model. Additionally, the mediation effects of perceived e-service quality, perceived risk, perceived value, and satisfaction on the relationship between electronic word-of-mouth (eWOM) and loyalty in B2C websites are validated using rigorous statistical methods. As hypothesized, the findings indicate that both positive and negative eWOM significantly influence perceived e-service quality and perceived risk and, in turn, significantly affect perceived value, customer satisfaction, and customer loyalty via the mediation of perceived e-service quality and risk. This study substantially enriches our understanding of the success of B2C websites by highlighting how the sequential causal relationships among key extrinsic cues, quality, risk, and value can strongly influence customer satisfaction and loyalty on these websites. Theoretical and practical implications are discussed.", "paper_title": "EXAMINING E- COMMERCE CUSTOMER SATISFACTION AND LOYALTY: AN INTEGRATED QUALITY- RISK- VALUE PERSPECTIVE", "paper_id": "WOS:000363301700003"}