{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "electrical_breakdown_strength_increment"}, {"score": 0.013091499099065578, "phrase": "electrical_breakdown_strength"}, {"score": 0.012827688574296564, "phrase": "keto-enol_isomerization"}, {"score": 0.004504193207111593, "phrase": "theoretical_investigation"}, {"score": 0.003611751858608048, "phrase": "minimum_structures"}, {"score": 0.003574830654211291, "phrase": "transition_states"}, {"score": 0.002971016979295967, "phrase": "equilibrium_geometries"}, {"score": 0.0029255474957478474, "phrase": "minimum_energy_path"}, {"score": 0.002836679611901583, "phrase": "intrinsic_reaction"}, {"score": 0.0025726416100664853, "phrase": "calculated_results"}, {"score": 0.0025202582748972122, "phrase": "energy_barriers"}, {"score": 0.002309242063033298, "phrase": "average_c-c_bond_energy"}, {"score": 0.0022390533383717715, "phrase": "acetophenone_doping"}, {"score": 0.0021049977753042253, "phrase": "polyethylene_electrical_tree_initiation"}], "paper_keywords": ["Acetophenone", " Electrical breakdown strength", " Keto-enol isomerization", " Polyethylene", " Transition state"], "paper_abstract": "A theoretical investigation is completed on the mechanism of electrical breakdown strength increment of polyethylene. It is shown that it is one of the most important factors for increasing electrical breakdown strength of polyethylene through keto-enol isomerization of acetophenone and its analogues at the ground state S-0 and the lowest triplet state T-1. The minimum structures and transition states of the keto- and the enol-tautomer of acetophenone and its analogues at the S-0 and T-1 states are obtained at the B3LYP/6-311+G(d,p) level, as well as the harmonic vibration frequencies of the equilibrium geometries and the minimum energy path (MEP) by the intrinsic reaction coordinate (IRC) theory at the same level. The two C-C bond cleavage reaction channels have been identified in acetophenone. The calculated results show that the energy barriers of keto-enol isomerization of acetophenone and its analogues at S-0 and T-1 states are much smaller than the average C-C bond energy of polyethylene, and the acetophenone doping or bond linked into polyethylene can increase the electrical breakdown strength and inhibit polyethylene electrical tree initiation and aging.", "paper_title": "Mechanisms on electrical breakdown strength increment of polyethylene by acetophenone and its analogues addition: a theoretical study", "paper_id": "WOS:000324644000039"}