{"auto_keywords": [{"score": 0.04902546742954503, "phrase": "virtual_screening"}, {"score": 0.00481495049065317, "phrase": "human_histone_deacetylase"}, {"score": 0.0047882394431576795, "phrase": "hdac"}, {"score": 0.004735254735115024, "phrase": "qsar_modeling_of_known_inhibitors"}, {"score": 0.004669845451682529, "phrase": "experimental_validation"}, {"score": 0.004618166136069052, "phrase": "histone_deacetylases"}, {"score": 0.004516509161825942, "phrase": "new_class"}, {"score": 0.004429388453288922, "phrase": "human_cancers"}, {"score": 0.004343940916975968, "phrase": "cell_growth"}, {"score": 0.0038431888954930083, "phrase": "two-dimensional_rendering"}, {"score": 0.003800622925737337, "phrase": "chemical_graphs"}, {"score": 0.003696251566632813, "phrase": "rigorous_model_development_workflow"}, {"score": 0.003525332840272254, "phrase": "highly_predictive_qsar_models"}, {"score": 0.0030840850263807204, "phrase": "validated_qsar_models"}, {"score": 0.0029909851863915283, "phrase": "in-house_compound_collection"}, {"score": 0.002900687590961084, "phrase": "wdi"}, {"score": 0.002860546817196148, "phrase": "asinex_synergy_libraries"}, {"score": 0.002690406375639144, "phrase": "computational_hits"}, {"score": 0.0026237474270482345, "phrase": "original_data"}, {"score": 0.002587429107459106, "phrase": "novel_scaffolds"}, {"score": 0.002406503256754213, "phrase": "fourth_compound"}, {"score": 0.0023599867869259663, "phrase": "selective_inhibitor"}, {"score": 0.0022759659334501826, "phrase": "confirmed_hits"}, {"score": 0.002207206921611084, "phrase": "anticancer_agents"}, {"score": 0.0021524941421636997, "phrase": "combined_qsar-vs_method"}, {"score": 0.0021345589634924633, "phrase": "general_approach"}, {"score": 0.0021167729086934775, "phrase": "effective_identification"}, {"score": 0.0021049977753042253, "phrase": "structurally_novel_bioactive_compounds"}], "paper_keywords": [""], "paper_abstract": "Inhibitors of histone deacetylases (HDACIs) have emerged as a new class of drugs for the treatment of human cancers and other diseases because of their effects on cell growth, differentiation, and apoptosis. In this study we have developed several quantitative structure - activity relationship (QSAR) models for 59 chemically diverse histone deacetylase class 1 (HDAC I) inhibitors. The variable selection k nearest neighbor (kNN) and support vector machines (SVM) QSAR modeling approaches using both MolconnZ and MOE chemical descriptors generated from two-dimensional rendering of compounds as chemical graphs have been employed. We have relied on a rigorous model development workflow including the division of the data set into training, test, and external sets and extensive internal and external validation. Highly predictive QSAR models were generated with leave-one-out cross-validated (LOO-CV) q(2) and external R(2) values as high as 0.80 and 0.87, respectively, using the kNN/MolconnZ approach and 0.93 and 0.87, respectively, using the SVM/MolconnZ approach. All validated QSAR models were employed concurrently for virtual screening (VS) of an in-house compound collection including 9.5 million molecules compiled from the ZINC7.0 database, the World Drug Index (WDI) database, the ASINEX Synergy libraries, and other commercial databases. VS resulted in 45 structurally unique consensus hits that were considered novel putative HDAC1 inhibitors. These computational hits had several novel structural features that were not present in the original data set. Four computational hits with novel scaffolds were tested experimentally, and three of them were confirmed active against HDAC1, with IC(50) values for the most active compound of 1.00 mu M. The fourth compound was later identified to be a selective inhibitor of HDAC6, a Class II HDAC. Moreover, two of the confirmed hits are marketed drugs, which could potentially facilitate their further development as anticancer agents. This study illustrates the power of the combined QSAR-VS method as a general approach for the effective identification of structurally novel bioactive compounds.", "paper_title": "Novel Inhibitors of Human Histone Deacetylase (HDAC) Identified by QSAR Modeling of Known Inhibitors, Virtual Screening, and Experimental Validation", "paper_id": "WOS:000263658200028"}