{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "congestion_games"}, {"score": 0.0047851345246117455, "phrase": "linear_latency_functions"}, {"score": 0.004482949028773004, "phrase": "social_knowledge_graph_g"}, {"score": 0.004008467832216946, "phrase": "adjacent_ones"}, {"score": 0.003934401172799425, "phrase": "complete_characterization"}, {"score": 0.0038737214010638745, "phrase": "pure_nash_equilibria"}, {"score": 0.003802135020791801, "phrase": "social_graph"}, {"score": 0.0036972190829870906, "phrase": "exact_potential_game"}, {"score": 0.0036288825833675127, "phrase": "classical_congestion_game"}, {"score": 0.003506851152129303, "phrase": "nash_equilibria"}, {"score": 0.0031845067058084613, "phrase": "polynomial_time"}, {"score": 0.003086961663712383, "phrase": "best_equilibrium"}, {"score": 0.0030582832134483685, "phrase": "intractable_problem"}, {"score": 0.002973831814707697, "phrase": "limited_knowledge"}, {"score": 0.002803104254950008, "phrase": "maximum_degree"}, {"score": 0.0027512482368183596, "phrase": "convergent_cases"}, {"score": 0.002700348931172875, "phrase": "upper_bounds"}, {"score": 0.0026421521830403377, "phrase": "asymptotically_tight_bounds"}, {"score": 0.0021049977753042253, "phrase": "singleton_congestion_games"}], "paper_keywords": ["Algorithmic game theory", " Nash equilibrium", " Price of anarchy", " Price of stability", " Congestion games", " Social knowledge"], "paper_abstract": "We consider congestion games with linear latency functions in which each player is aware only of a subset of all the other players. This is modeled by means of a social knowledge graph G in which nodes represent players and there is an edge from i to j if i knows j. Under the assumption that the payoff of each player is affected only by the strategies of the adjacent ones, we first give a complete characterization of the games possessing pure Nash equilibria. Namely, if the social graph G is undirected, the game is an exact potential game and thus isomorphic to a classical congestion game. As a consequence, it always converges and possesses Nash equilibria. On the other hand, if G is directed an equilibrium is not guaranteed to exist, but the game is always convergent and an equilibrium can be found in polynomial time if G is acyclic, even if finding the best equilibrium remains an intractable problem. We then investigate the impact of the limited knowledge of the players on the performance of the game. More precisely, given a bound on the maximum degree of G, for the convergent cases we provide tight lower and upper bounds on the price of stability and asymptotically tight bounds on the price of anarchy. Such results are determined for four natural social cost functions: total and maximum presumed latencies, that is the ones the players believe to pay due to the fact that they are only aware of the existence of their neighbors, and total and maximum perceived latencies, i.e. actually experienced due to all (and not only the known) players using the same facilities. All the results are then extended to singleton congestion games.", "paper_title": "Graphical Congestion Games", "paper_id": "WOS:000293234800003"}