{"auto_keywords": [{"score": 0.044360417302630274, "phrase": "scientific_development"}, {"score": 0.004560568143816105, "phrase": "great_development"}, {"score": 0.00396234224936868, "phrase": "researchers'_innovative_work"}, {"score": 0.003844551068192153, "phrase": "accumulated_scientific_knowledge"}, {"score": 0.00360417515510547, "phrase": "scientific_knowledge"}, {"score": 0.0032920678776655783, "phrase": "rest_researchers"}, {"score": 0.003174903873774882, "phrase": "scientists'_innovative_consciousness"}, {"score": 0.002813566267090177, "phrase": "fixed_basic_contribution"}, {"score": 0.002779769492357829, "phrase": "innovative_output"}, {"score": 0.0025083651612064144, "phrase": "initial_stage"}], "paper_keywords": ["Scientists", " Science", " Researchers", " Innovation"], "paper_abstract": "Many scientists were respected by people and science has made great development in the twentieth century. What role do scientists play in the process of scientific development? Does scientific development bring more researchers into scientists? This paper mainly analyzes the two interested questions and suggests that: (a) not all researchers' output could be attributed to scientific knowledge, only the innovative output could promote science to develop. Scientists play a more significant role than the rest researchers in scientific development in average because scientists' innovative consciousness is far higher than that of non-scientists. (b) Distinguishing scientists from researchers in accordance with the fixed basic contribution of innovative output in the process of scientific development. Researchers' innovative work becomes easier with the accumulated scientific knowledge growing gradually in the initial stage of scientific development. Thus, scientific development could produce more and more scientists. On the contrary, researchers' innovative work becomes more challenged with the accumulated scientific knowledge increasing gradually while science develops to a certain stage. As a result, scientific development would make researchers become scientist increasingly difficult.", "paper_title": "The relationship between scientists and science: knowledge-based innovation output", "paper_id": "WOS:000331559800015"}