{"auto_keywords": [{"score": 0.048465841392702935, "phrase": "emotion_mechanisms"}, {"score": 0.046561686820073854, "phrase": "action_selection"}, {"score": 0.014912190296895863, "phrase": "artificial_agents"}, {"score": 0.012969573010851524, "phrase": "architectural_qualities"}, {"score": 0.012071308924422663, "phrase": "emotion_mechanism"}, {"score": 0.00481495049065317, "phrase": "autonomous_agents"}, {"score": 0.0037446140218109895, "phrase": "existing_agent_architectures"}, {"score": 0.0036321600255449613, "phrase": "triangulate_design_possibilities"}, {"score": 0.003443402656397069, "phrase": "twelve_autonomous_agents"}, {"score": 0.0029675701595142656, "phrase": "emotion_model"}, {"score": 0.0028025415122856973, "phrase": "architectural_space"}, {"score": 0.0027286918886186245, "phrase": "similar_theoretical_components"}, {"score": 0.0026771333996253783, "phrase": "architectural_aspects"}, {"score": 0.0025867643733794724, "phrase": "initial_framework"}, {"score": 0.0023966900120342364, "phrase": "emotion_roles"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Emotion", " Action selection", " Artificial agents", " Agent architecture"], "paper_abstract": "Emotion mechanisms are often used in artificial agents as a method of improving action selection. Comparisons between agents are difficult due to a lack of unity between the theories of emotion, tasks of agents and types of action selection utilised. A set of architectural qualities is proposed as a basis for making comparisons between agents. An analysis of existing agent architectures that include an emotion mechanism can help to triangulate design possibilities within the space outlined by these qualities. With this in mind, twelve autonomous agents incorporating an emotion mechanism into action selection are selected for analysis. Each agent is dissected using these architectural qualities (the agent architecture, the action selection mechanism, the emotion mechanism and emotion state representation, along with the emotion model it is based on). This helps to place the agents within an architectural space, highlights contrasting methods of implementing similar theoretical components, and suggests which architectural aspects are important to performance of tasks. An initial framework is introduced, consisting of a series of recommendations for designing emotion mechanisms within artificial agents, based on correlations between emotion roles performed and the aspects of emotion mechanisms used to perform those roles. The conclusion discusses how problems with this type of research can be resolved and to what extent development of a framework can aid future research.", "paper_title": "Emotions in autonomous agents: comparative analysis of mechanisms and functions", "paper_id": "WOS:000300283100001"}