{"auto_keywords": [{"score": 0.04550288640963527, "phrase": "overlined_parts"}, {"score": 0.0061204450284555205, "phrase": "expected_weight"}, {"score": 0.00481495049065317, "phrase": "integer_n"}, {"score": 0.004672444473700524, "phrase": "last_occurrence"}, {"score": 0.003980402855254965, "phrase": "corteel"}, {"score": 0.0039407068095755815, "phrase": "hitczenko"}, {"score": 0.002496722870659199, "phrase": "first_computation"}, {"score": 0.0024348510123716424, "phrase": "known_asymptotics"}, {"score": 0.0023745087648471613, "phrase": "second_one"}, {"score": 0.0022925278792429553, "phrase": "sieve_argument"}, {"score": 0.002224510044064184, "phrase": "saddle-point_method"}], "paper_keywords": ["partitions", " combinatorial probability", " local limit theorem", " asymptotic analysis"], "paper_abstract": "An overpartition of an integer n is a partition where the last occurrence of a part can be overlined. We study the weight of the overlined parts of an overpartition counted with or without their multiplicities. This is a continuation of a work by Corteel and Hitczenko where it was shown that the expected weight of the overlined parts is asymptotic to n/3 as n -> infinity and that the expected weight of the overlined parts counted with multiplicity is n/2. Here we refine these results. We first compute the asymptotics of the variance of the weight of the overlined parts counted with multiplicity. We then asymptotically evaluate the probability that the weight of the overlined parts is n/3 +/- k for k = o(n) and the probability that the weight of the overlined parts counted with multiplicity is n/2 +/- k for k = o(n). The first computation is straightforward and uses known asymptotics of partitions. The second one is more involved and requires a sieve argument and the application of the saddle-point method. From that we can directly evaluate the probability that two random partitions of n do not share a part.", "paper_title": "A local limit theorem in the theory of overpartitions", "paper_id": "WOS:000243383500005"}