{"auto_keywords": [{"score": 0.04971747610320425, "phrase": "user_resistance"}, {"score": 0.021026559532621045, "phrase": "implementers'_responses"}, {"score": 0.00481495049065317, "phrase": "information_technology_implementers'_responses"}, {"score": 0.004706699397060569, "phrase": "effects._user_resistance"}, {"score": 0.004583464412234181, "phrase": "critical_issue"}, {"score": 0.004548848077202625, "phrase": "information_technology_implementation"}, {"score": 0.004090682761004765, "phrase": "organizational_disruption"}, {"score": 0.003953409087444568, "phrase": "implementers-business_managers"}, {"score": 0.0030311679447397725, "phrase": "case_survey"}, {"score": 0.002951673109860487, "phrase": "case_studies"}, {"score": 0.0028851913035322415, "phrase": "large_quantities"}, {"score": 0.0023952639120005193, "phrase": "set-theoretic_analysis_approach"}, {"score": 0.0023412849215629986, "phrase": "content_analysis"}, {"score": 0.0022284577808744316, "phrase": "theoretical_explanation"}, {"score": 0.002153540857619362, "phrase": "earlier_research"}, {"score": 0.0021049977753042253, "phrase": "user_resistance_behaviors"}], "paper_keywords": ["User resistance", " information technology implementation", " implementers' response", " theory building", " case survey", " set-theoretic analysis"], "paper_abstract": "User resistance has long been acknowledged as a critical issue during information technology implementation. Resistance can be functional when it signals the existence of problems with the IT or with its effects; it will be dysfunctional when it leads to organizational disruption. Notwithstanding the nature of resistance, the implementers-business managers, functional managers, or IT professionals-have to address it. Although the literature recognizes the importance of user resistance, it has paid little attention to implementers' responses-and their effect-when resistance occurs. Our study focuses on this phenomenon, and addresses two questions: What are implementers' responses to user resistance? What are the effects of these responses on user resistance? To answer these questions, we conducted a case survey, which combines the richness of case studies with the benefits of analyzing large quantities of data. Our case database includes 89 cases with a total of 137 episodes of resistance. In response to our first research question, we propose a taxonomy that includes four categories of implementers' responses to user resistance: inaction, acknowledgment, rectification, and dissuasion. To answer our second question, we adopted a set-theoretic analysis approach, which we enriched with content analysis of the cases. Based on these analyses, we offer a theoretical explanation of how implementers' responses may affect the antecedents that earlier research found to be associated with user resistance behaviors.", "paper_title": "INFORMATION TECHNOLOGY IMPLEMENTERS' RESPONSES TO USER RESISTANCE: NATURE AND EFFECTS", "paper_id": "WOS:000307606300012"}