{"auto_keywords": [{"score": 0.015595500194448667, "phrase": "convex_optimization"}, {"score": 0.007859253774157035, "phrase": "observation_probability"}, {"score": 0.00481495049065317, "phrase": "partially_observed_graphs"}, {"score": 0.00458869631642791, "phrase": "partially_observed_unweighted_graph"}, {"score": 0.004461634909525319, "phrase": "node_pairs"}, {"score": 0.0037544644262310525, "phrase": "disjoint_clusters"}, {"score": 0.0034508665218929745, "phrase": "natural_approach"}, {"score": 0.0028456853685842293, "phrase": "disagreement_minimization"}, {"score": 0.00254282157860369, "phrase": "sufficient_conditions"}, {"score": 0.002432834929068545, "phrase": "minimum_cluster_size"}, {"score": 0.0024133533748653033, "phrase": "edge_density"}, {"score": 0.002253920389285441, "phrase": "edge_density_gap"}, {"score": 0.0022001958412800745, "phrase": "constant_number"}, {"score": 0.002165091261117016, "phrase": "equal_size"}, {"score": 0.0021049977753042253, "phrase": "logarithmic_factors"}], "paper_keywords": ["graph clustering", " convex optimization", " sparse and low-rank decomposition"], "paper_abstract": "This paper considers the problem of clustering a partially observed unweighted graph i.e., one where for some node pairs we know there is an edge between them, for some others we know there is no edge, and for the remaining we do not know whether or not there is an edge. We want to organize the nodes into disjoint clusters so that there is relatively dense (observed) connectivity within clusters, and sparse across clusters. We take a novel yet natural approach to this problem, by focusing on finding the clustering that minimizes the number of \"disagreements\" i.e., the sum of the number of (observed) missing edges within clusters, and (observed) present edges across clusters. Our algorithm uses convex optimization; its basis is a reduction of disagreement minimization to the problem of recovering an (unknown) low-rank matrix and an (unknown) sparse matrix from their partially observed sum. We evaluate the performance of our algorithm on the classical Planted Partition/Stochastic Block Model. Our main theorem provides sufficient conditions for the success of our algorithm as a function of the minimum cluster size, edge density and observation probability; in particular, the results characterize the tradeoff between the observation probability and the edge density gap. When there are a constant number of clusters of equal size, our results are optimal up to logarithmic factors.", "paper_title": "Clustering Partially Observed Graphs via Convex Optimization", "paper_id": "WOS:000344638300011"}