{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "time_series"}, {"score": 0.004121015016128205, "phrase": "first_part"}, {"score": 0.0040334640350288, "phrase": "mathematical_properties"}, {"score": 0.003926626018798576, "phrase": "second_part"}, {"score": 0.003741371936431574, "phrase": "real_data"}, {"score": 0.0036815763368083197, "phrase": "practical_application"}, {"score": 0.003584025547693833, "phrase": "social_sciences"}, {"score": 0.003526735797659508, "phrase": "top_chinese_universities"}, {"score": 0.0032016639006812826, "phrase": "decreasing_tendency"}, {"score": 0.0031167895790050405, "phrase": "practical_cases"}, {"score": 0.002985631781749091, "phrase": "relatively_short_periods"}, {"score": 0.002652639568848117, "phrase": "relative_rate"}, {"score": 0.002407941567598653, "phrase": "innovative_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Time series", " Social sciences", " Informetrics", " Chinese universities"], "paper_abstract": "Introducing and studying two types of time series, referred to as R1 and R2, we try to enrich the set of time series available for time dependent informetric studies. In a first part we focus on mathematical properties, while in a second part we check if these properties are visible in real data. This practical application uses data in the social sciences related to top Chinese universities. R1 sequences always increase over time, tending relatively fast to one, while R2 sequences have a decreasing tendency tending to zero in practical cases. They can best be used over relatively short periods of time. R1 sequences can be used to detect the rate with which cumulative data increase, while R2 sequences detect the relative rate of development. The article ends by pointing out that these time series can be used to compare innovative activities in firms. Clearly, this investigation is just a first attempt. More studies are needed, including comparisons with other related sequences. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Two time series, their meaning and some applications", "paper_id": "WOS:000323859700004"}