{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "renegar's_condition_number"}, {"score": 0.015236319355575356, "phrase": "conic_curvature"}, {"score": 0.011799772698877, "phrase": "computational_complexity"}, {"score": 0.010033752113341416, "phrase": "feasible_solutions"}, {"score": 0.004568108391981922, "phrase": "conic_linear_system"}, {"score": 0.004047141845635495, "phrase": "last_dozen_years"}, {"score": 0.0037397086147485897, "phrase": "data_perturbation"}, {"score": 0.0037005154613244363, "phrase": "error_bounds"}, {"score": 0.0036617315529835497, "phrase": "problem_geometry"}, {"score": 0.0034193226278107346, "phrase": "representation-dependent_measure"}, {"score": 0.003226744277130179, "phrase": "overly_conservative_bounds"}, {"score": 0.0031594291695784286, "phrase": "geometric_quantities"}, {"score": 0.002640947693258573, "phrase": "singular_values"}, {"score": 0.0025452314655691165, "phrase": "condition_number"}, {"score": 0.0022783523466965187, "phrase": "lower_and_upper_bounds"}], "paper_keywords": [""], "paper_abstract": "For a conic linear system of the form Ax is an element of K, K a convex cone, several condition measures have been extensively studied in the last dozen years. Among these, Renegar's condition number C(A) is arguably the most prominent for its relation to data perturbation, error bounds, problem geometry, and computational complexity of algorithms. Nonetheless, C(A) is a representation-dependent measure which is usually difficult to interpret and may lead to overly conservative bounds of computational complexity and/or geometric quantities associated with the set of feasible solutions. Herein we show that Renegar's condition number is bounded from above and below by certain purely geometric quantities associated with A and K; furthermore our bounds highlight the role of the singular values of A and their relationship with the condition number. Moreover, by using the notion of conic curvature, we show how Renegar's condition number can be used to provide both lower and upper bounds on the width of the set of feasible solutions. This complements the literature where only lower bounds have heretofore been developed.", "paper_title": "A geometric analysis of Renegar's condition number, and its interplay with conic curvature", "paper_id": "WOS:000263380900005"}