{"auto_keywords": [{"score": 0.039541503396406254, "phrase": "performance_ratio"}, {"score": 0.015719716506582538, "phrase": "unsigned_circular_permutations"}, {"score": 0.015448758509906459, "phrase": "cut-and-paste_operation"}, {"score": 0.004332894955218135, "phrase": "linear_permutations"}, {"score": 0.0041586840496756474, "phrase": "signed_permutations"}, {"score": 0.0039449104968131655, "phrase": "unsigned_permutations"}, {"score": 0.0032315723330399375, "phrase": "cut-and-paste_operations"}, {"score": 0.0030295361111006866, "phrase": "alternating_path"}, {"score": 0.002381365139274329, "phrase": "unsigned_linear_permutations"}, {"score": 0.002193367454830741, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Permutation", " Cut-and-paste", " Reversal", " Transposition", " Transreversal", " Approximation algorithm"], "paper_abstract": "A cut-and-paste operation can be a reversal, a transposition, or a transreversal on circular or linear permutations. There are several approximation algorithms for sorting signed permutations by combinations of these operations. For sorting unsigned permutations, we only know an algorithm with performance ratio 3 and its improved version with performance ratio 2.8386 + delta allowing reversals and transpositions. In this paper, we present a 2.25-approximation algorithm for sorting unsigned circular permutations by cut-and-paste operations. A structure called tie is proposed to represent the alternating path of length 5. We can classify the ties into 6 types and find ways to remove the breakpoints for each type of ties, so that every cut-and-paste operation can reduce at least 4/3 breakpoints averagely. Our algorithm can be used to sort unsigned linear permutations and achieve the performance ratio 2.25 if another operation named revrev is allowed. Crown Copyright (C) 2012 Published by Elsevier Inc. All rights reserved.", "paper_title": "A new approximation algorithm for cut-and-paste sorting of unsigned circular permutations", "paper_id": "WOS:000302396000005"}