{"auto_keywords": [{"score": 0.0494713765104406, "phrase": "mumford-shah_model"}, {"score": 0.010612387000973441, "phrase": "convex_variant"}, {"score": 0.00907254799461721, "phrase": "first_stage"}, {"score": 0.008229179546517766, "phrase": "second_stage"}, {"score": 0.004402973626416765, "phrase": "last_twenty_years"}, {"score": 0.0042373381286051354, "phrase": "two-stage_segmentation_method"}, {"score": 0.003991932110277654, "phrase": "smooth_solution_g"}, {"score": 0.0035883942463601688, "phrase": "different_phases"}, {"score": 0.0033374705499418377, "phrase": "clustering_methods"}, {"score": 0.0030776686414001964, "phrase": "split-bregman_algorithm"}, {"score": 0.003038532168038562, "phrase": "chambolle-pock_method"}, {"score": 0.0028992294924613327, "phrase": "solution_g"}, {"score": 0.002539978170928796, "phrase": "k-phase_segmentations"}, {"score": 0.002215663255682209, "phrase": "different_segmentation_features"}, {"score": 0.0021688641066186817, "phrase": "experimental_results"}], "paper_keywords": ["image segmentation", " Mumford-Shah model", " split-Bregman", " total variation"], "paper_abstract": "The Mumford-Shah model is one of the most important image segmentation models and has been studied extensively in the last twenty years. In this paper, we propose a two-stage segmentation method based on the Mumford-Shah model. The first stage of our method is to find a smooth solution g to a convex variant of the Mumford-Shah model. Once g is obtained, then in the second stage the segmentation is done by thresholding g into different phases. The thresholds can be given by the users or can be obtained automatically using any clustering methods. Because of the convexity of the model, g can be solved efficiently by techniques like the split-Bregman algorithm or the Chambolle-Pock method. We prove that our method is convergent and that the solution g is always unique. In our method, there is no need to specify the number of segments K (K = 2) before finding g. We can obtain any K-phase segmentations by choosing (K-1) thresholds after g is found in the first stage, and in the second stage there is no need to recompute g if the thresholds are changed to reveal different segmentation features in the image. Experimental results show that our two-stage method performs better than many standard two-phase or multiphase segmentation methods for very general images, including antimass, tubular, MRI, noisy, and blurry images.", "paper_title": "A Two-Stage Image Segmentation Method Using a Convex Variant of the Mumford-Shah Model and Thresholding", "paper_id": "WOS:000326032900014"}