{"auto_keywords": [{"score": 0.04569117705973995, "phrase": "object_recognition"}, {"score": 0.014059660093344225, "phrase": "pre-shape_space"}, {"score": 0.013082155944443808, "phrase": "basic_data"}, {"score": 0.010612387000973441, "phrase": "multiple_configurations"}, {"score": 0.008569850049535175, "phrase": "dynamic_state"}, {"score": 0.006328229999383287, "phrase": "shape_space"}, {"score": 0.0054546898651747335, "phrase": "new_data_models"}, {"score": 0.004783232571029632, "phrase": "computer_vision"}, {"score": 0.0045820747375409435, "phrase": "main_goals"}, {"score": 0.004551883842967241, "phrase": "computer_vision_applications"}, {"score": 0.004303127794432684, "phrase": "large_quantity"}, {"score": 0.0042325743185503825, "phrase": "real_world"}, {"score": 0.004149429072483132, "phrase": "diverse_configurations"}, {"score": 0.0037203741725514126, "phrase": "objects_recognition"}, {"score": 0.0034706569037527774, "phrase": "static_state"}, {"score": 0.0032591491777773035, "phrase": "effective_robust_algorithm"}, {"score": 0.0030706395717772436, "phrase": "different_objects"}, {"score": 0.00257640185288362, "phrase": "new_basic_data"}], "paper_keywords": ["The shape space", " The pre-shape space", " Landmarks", " The Procrustean distance", " Object recognition"], "paper_abstract": "Computer vision has been extensively adopted in many domains during the last three decades. One of the main goals of computer vision applications is to recognize objects. Generally, computers can successfully achieve object recognition by relying on a large quantity of data. In real world, some objects may own diverse configurations or/and be observed at various angles and positions, and the process of object recognition is denoted as recognizing objects in dynamic state. It is difficult to collect enough data to achieve the sorts of objects recognition. In order to resolve the problem, we propose a technique to achieve object recognition which is not only in static state where the objects do not own multiple configurations, but also in dynamic state. First, we apply an effective robust algorithm to obtain landmarks from objects in two dimensional images. With the algorithm, the number of landmarks from different objects can be appointed in advance. A set of landmarks as a point is projected into a pre-shape space and a shape space. Next, a method is proposed to create a surface among three basic data models in a pre-shape space. If basic data are too few to create a surface or a curve, a new basic data can be built from the basic data. Then, a series of new data models can be obtained from these basic data in a pre-shape space. Finally, object recognition can be achieved by using the new data models in shape space. We give some examples to show the algorithms are efficient not only for the objects with noises, but also for the ones with various configurations.", "paper_title": "Recognizing objects with multiple configurations", "paper_id": "WOS:000330839400015"}