{"auto_keywords": [{"score": 0.04888510471747535, "phrase": "family_physicians"}, {"score": 0.010275465296979928, "phrase": "canada"}, {"score": 0.00481495049065317, "phrase": "primary_care"}, {"score": 0.004544859094594241, "phrase": "potential_value"}, {"score": 0.004093190049699647, "phrase": "main_performance_outcomes"}, {"score": 0.0038634281440398355, "phrase": "medical_practices"}, {"score": 0.0038356285277580428, "phrase": "quebec"}, {"score": 0.003712964709503484, "phrase": "bivariate_and_multivariate_statistical_analyses"}, {"score": 0.003646516176920946, "phrase": "ehr_usage_behaviors"}, {"score": 0.0035942114996235803, "phrase": "perceived_performance_outcomes"}, {"score": 0.0032018141503341365, "phrase": "significant_differences"}, {"score": 0.003178758306417406, "phrase": "\"basic\"_and_\"advanced\"_users"}, {"score": 0.0030993584115563146, "phrase": "ehr_system's_characteristics"}, {"score": 0.0030659380503460613, "phrase": "performance_outcomes"}, {"score": 0.0025962638592454974, "phrase": "longest_usage_experience"}, {"score": 0.0023042157412517333, "phrase": "significant_performance_improvements"}, {"score": 0.0022711207841260767, "phrase": "future_research"}, {"score": 0.0022143417457627006, "phrase": "primary_care_physicians"}, {"score": 0.0021904435447196884, "phrase": "ehr_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health record", " Usage behaviors", " Family physicians", " Medical practices", " Performance outcomes", " Survey research"], "paper_abstract": "Objective: The importance and potential value of office-based electronic health record (EHR) systems is being recognized internationally. We thus sought to better understand how EHRs are actually being used by family physicians and what they perceive to be the main performance outcomes for themselves and their medical practices. Methods: We conducted a survey of family physicians practicing in medical practices in Quebec, Canada (n = 331). Bivariate and multivariate statistical analyses were conducted to characterize EHR usage behaviors and assess the perceived performance outcomes of these systems. Results: EHR systems \"as-used\" vary substantively from one family physician to another in terms of the capabilities that are actually mobilized by them. Significant differences between \"basic\" and \"advanced\" users were observed in terms of the EHR system's characteristics and perceived performance outcomes. Physicians were also clustered under three profiles that could be clearly distinguished from one another, in terms of the extent to which their performance and their practice's performance was impacted by their EHR usage. Physicians that are \"highly impacted\" by their EHR system are those who have the longest usage experience and make the most extended use of their system's capabilities. Conclusions: Our study indicates that only a minority of family physicians in our sample use most of the features available in their EHR system. Consequently, few physicians perceive gaining significant performance improvements from such systems. Future research must identify the factors that motivate primary care physicians to assimilate EHR systems in a more extensive manner. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "Electronic health record usage behaviors in primary care medical practices: A survey of family physicians in Canada", "paper_id": "WOS:000360562100015"}