{"auto_keywords": [{"score": 0.042907225459955275, "phrase": "esn"}, {"score": 0.00481495049065317, "phrase": "changing_role"}, {"score": 0.004739773204474094, "phrase": "enterprise_social_networks"}, {"score": 0.0047026237903774895, "phrase": "social_media"}, {"score": 0.00462919213721188, "phrase": "social_networking_platforms"}, {"score": 0.004503422625191897, "phrase": "enterprise_contexts"}, {"score": 0.004295681900150244, "phrase": "improved_communication"}, {"score": 0.003954837422946628, "phrase": "formal_influence"}, {"score": 0.003684213587410217, "phrase": "organizational_hierarchy"}, {"score": 0.00314708280192844, "phrase": "user's_contributions"}, {"score": 0.002931569771634119, "phrase": "unique_data_set"}, {"score": 0.0028630535573013686, "phrase": "esn_platform"}, {"score": 0.0028293966058473476, "phrase": "deloitte_australia"}, {"score": 0.002656445226355143, "phrase": "informal_influence"}, {"score": 0.0026252106881752067, "phrase": "stronger_effect"}, {"score": 0.0025638362414466278, "phrase": "esn_community"}, {"score": 0.0025137856138000014, "phrase": "communication_structures"}, {"score": 0.0024357240356443653, "phrase": "hierarchical_levels"}, {"score": 0.0022157533515146503, "phrase": "esn_emergence"}, {"score": 0.0021049977753042253, "phrase": "user-driven_communication"}], "paper_keywords": ["Enterprise social networking", " Microblogging", " Community building", " Communication analysis", " Hierarchy", " Response behavior", " Influence"], "paper_abstract": "Social media, such as social networking platforms, are increasingly gaining importance in enterprise contexts. Enterprise social networking (ESN) is often associated with improved communication, information-sharing and problem-solving. At the same time, ESN has been argued to diminish the role of formal influence in that users increasingly derive authority from their contributions to the network rather than from their position in the organizational hierarchy. Others argue that ESN will diminish influence considerably by producing more democratic and inclusive communication structures. Yet, these assertions have so far remained largely unexplored empirically. Against this background, we explore what influence both a user's position in the organization's hierarchy and a user's contributions on the network have on the the ability to elicit responses from other ESN users. We draw on a unique data set of more than 110,000 messages collected from the ESN platform used at Deloitte Australia. While we find evidence for both kinds of influence, our data also reveals that informal influence has a stronger effect and that, as the ESN community matures over time, communication structures become indeed more inclusive and balanced across hierarchical levels. We contribute a set of propositions that theorize the ways in which influence and communication pattern are shaped during the process of ESN emergence. Our results further underline the potentials of ESN to improve organic, user-driven communication and knowledge sharing within firms.", "paper_title": "From Top to Bottom Investigating the Changing Role of Hierarchy in Enterprise Social Networks", "paper_id": "WOS:000354193700005"}