{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topic_transition"}, {"score": 0.010517549960534058, "phrase": "topic_detection"}, {"score": 0.0045200127552893704, "phrase": "document_collection"}, {"score": 0.004281569980694349, "phrase": "tdt"}, {"score": 0.0040010534672646775, "phrase": "full_use"}, {"score": 0.00391167729353583, "phrase": "topic_transition_information"}, {"score": 0.003841610436545169, "phrase": "tdt_algorithms"}, {"score": 0.0037219886365287085, "phrase": "topic_models"}, {"score": 0.003655432940572754, "phrase": "lda"}, {"score": 0.0034623203126093833, "phrase": "mixture_model"}, {"score": 0.00326469463991041, "phrase": "topic_transition_model_representation"}, {"score": 0.003220709449062307, "phrase": "hidden_markov_model"}, {"score": 0.0027616550517346066, "phrase": "proposed_model"}, {"score": 0.0026157259734105, "phrase": "performance_comparison"}, {"score": 0.002212460584002629, "phrase": "bbs_website"}, {"score": 0.002162951519368368, "phrase": "manual_analysis_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Topic transition", " Topic detection and tracking", " Hidden Markov model"], "paper_abstract": "Topics often transit among documents in a document collection. To improve the accuracy of the topic detection and tracking (TDT) algorithms in discovering topics or classifying documents, it is necessary to make full use of this kind of topic transition information. However, TDT algorithms usually. find topics based on topic models, such as LDA, pLSI, etc., which are a kind of mixture model and make the topic transition difficult to be denoted and implemented. A topic transition model representation based on hidden Markov model is present, and learning the topic transition from documents is discussed. Based on the model, two TDT algorithms incorporating topic transition, i.e. topic discovering and document classifying, are provided to show the application of the proposed model. Experiments on two real-world document collections are done with the two algorithms, and performance comparison with other similar algorithm shows that the accuracy can achieve 93% for topic discovering in Reuters-21578, and 97.3% in document classifying. Furthermore, topic transition discovered by the algorithm on a dataset which was collected from a BBS website is consistent with the manual analysis results. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Incorporating topic transition in topic detection and tracking algorithms", "paper_id": "WOS:000264182800024"}