{"auto_keywords": [{"score": 0.0473555705346302, "phrase": "broadcast_protocols"}, {"score": 0.014569748590195039, "phrase": "corrupted_parties"}, {"score": 0.00481495049065317, "phrase": "partially_compromised_public-key_infrastructure"}, {"score": 0.004745056850725867, "phrase": "public-key_infrastructure"}, {"score": 0.004710495563495478, "phrase": "pki"}, {"score": 0.004659108142668152, "phrase": "digital_signatures"}, {"score": 0.004426607895888934, "phrase": "existing_protocols"}, {"score": 0.004159763048814389, "phrase": "honest_parties"}, {"score": 0.0037823114064881357, "phrase": "usual_guarantees"}, {"score": 0.003476963781647026, "phrase": "secret_keys"}, {"score": 0.002992313172550772, "phrase": "efficient_protocol"}, {"score": 0.0027405092973494293, "phrase": "standard_results"}, {"score": 0.002290135975651888, "phrase": "\"exceptional\"_values"}, {"score": 0.002175594509651082, "phrase": "complete_characterization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Broadcast protocols", " Public-key infrastructure (PKI)"], "paper_abstract": "Given a public-key infrastructure (PKI) and digital signatures, it is possible to construct broadcast protocols tolerating any number of corrupted parties. Existing protocols, however, do not distinguish between corrupted parties who do not follow the protocol, and honest parties whose secret (signing) keys have been compromised but continue to behave honestly. We explore conditions under which it is possible to construct broadcast protocols that still provide the usual guarantees (i.e., validity/agreement) to the latter. Consider a network of n parties, where an adversary has compromised the secret keys of up to t(c) honest parties and, in addition, fully controls the behavior of up to t(a) other parties. We show that for any fixed t(c) > 0 and any fixed t(a), there exists an efficient protocol for broadcast if and only if 2t(a) min(t(a), t(c)) < n. (When t(c) = 0, standard results imply feasibility for all t(a) < n.) We also show that if t(c), t(a) are not fixed, but are only guaranteed to satisfy the above bound, then broadcast is impossible to achieve except for a few specific values of n; for these \"exceptional\" values of n, we demonstrate broadcast protocols. Taken together, our results give a complete characterization of this problem. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Authenticated broadcast with a partially compromised public-key infrastructure", "paper_id": "WOS:000331527100003"}