{"auto_keywords": [{"score": 0.032646468497261105, "phrase": "formal_definition"}, {"score": 0.00481495049065317, "phrase": "artificial-life_research"}, {"score": 0.004583205112737672, "phrase": "bottom-up_research_approach"}, {"score": 0.004152502093643003, "phrase": "notable_progress"}, {"score": 0.004101579688745222, "phrase": "processing_power"}, {"score": 0.004067977399245212, "phrase": "personal_computers"}, {"score": 0.0034083145672246067, "phrase": "bird_flocks"}, {"score": 0.00327086925741257, "phrase": "craig_w._reynolds"}, {"score": 0.003230723298995081, "phrase": "first_and_most_influential_model"}, {"score": 0.00292674497467906, "phrase": "second_generation"}, {"score": 0.0029027394930867902, "phrase": "flocking_models"}, {"score": 0.002629539710839523, "phrase": "second-generation_models"}, {"score": 0.002575934917174136, "phrase": "artificial_animal_construction_framework"}, {"score": 0.002471973283582411, "phrase": "existing_bird"}, {"score": 0.0021049977753042253, "phrase": "reynolds's_boids"}], "paper_keywords": ["animat", " artificial life", " bird", " boid", " flock", " moore automaton"], "paper_abstract": "Artificial-life research was founded in the mid-1980s. It promotes the idea of the bottom-up research approach, where only the basic units of a situation and their local interaction are modelled, and then the system is left to evolve. However, the notable progress of the processing power of personal computers, evident in the last two decades, has had little influence on the ways the basic units (artificial animals or animats) are constructed. This impacts largely on the applicability of the methods in other research fields. Our field of choice is the modelling of bird flocks. This area was at its peak in the late 1980s when Craig W. Reynolds presented the first and most influential model - the boids. In spite of his many following works no formal definition has ever been presented. This might be the reason why a second generation of flocking models is still awaited. In this article we make a step forward, all in view of allowing for the development of the second-generation models. We present an artificial animal construction framework that has been obtained as a generalization of the existing bird flocking models, but is not limited to them. The article thus presents a formal definition of the framework and gives an example of its use. In the latter the framework is employed to present a formalization of Reynolds's boids.", "paper_title": "The computational beauty of flocking: boids revisited", "paper_id": "WOS:000249642500002"}