{"auto_keywords": [{"score": 0.04775244230872765, "phrase": "membrane_dipping_loops"}, {"score": 0.03813169063807108, "phrase": "discovered_patterns"}, {"score": 0.03236245548199097, "phrase": "tmloop"}, {"score": 0.030982333237418662, "phrase": "collective_motif_method"}, {"score": 0.00481495049065317, "phrase": "membrane_dipping"}, {"score": 0.004490842671590769, "phrase": "membrane_proteins"}, {"score": 0.0038676325043529524, "phrase": "combinatorial_pattern_discovery_approach"}, {"score": 0.003661382948704217, "phrase": "membrane_dipping_loop"}, {"score": 0.0030906666356950887, "phrase": "polytopic_membrane_proteins"}, {"score": 0.0028394925080958205, "phrase": "single_motif_method"}, {"score": 0.002769568481822277, "phrase": "inherent_limitations"}, {"score": 0.0027420820738468577, "phrase": "single_motif_methods"}, {"score": 0.002701361707441567, "phrase": "distantly_related_proteins"}, {"score": 0.0024941578231560055, "phrase": "small_variations"}, {"score": 0.0022460727898764216, "phrase": "swiss-prot_database"}, {"score": 0.0021474369836979048, "phrase": "topology_prediction_methods"}, {"score": 0.002126111716875142, "phrase": "experimental_approaches"}], "paper_keywords": [""], "paper_abstract": "Motivation: Membrane dipping loops are sections of membrane proteins that reside in the membrane but do not traverse from one side to the other, rather they enter and leave the same side of the membrane. We applied a combinatorial pattern discovery approach to sets of sequences containing at least one characterised structure described as possessing a membrane dipping loop. Discovered patterns were found to be composed of residues whose biochemical role is known to be essential for function of the protein, thus validating our approach. TMLOOP(http://membraneproteins.swan.ac.uk/TMLOOP) was implemented to predict membrane dipping loops in polytopic membrane proteins. TMLOOP applies discovered patterns as weighted predictive rules in a collective motif method (a variation of the single motif method), to avoid inherent limitations of single motif methods in detecting distantly related proteins. The collective motif method applies several, partially overlapping patterns, which pertain to the same sequence region, allowing proteins containing small variations to be detected. The approach achieved 92.4% accuracy in sensitivity and 100% reliability in specificity. TMLOOP was applied to the Swiss-Prot database, identifying 1392 confirmed membrane dipping loops, 75 plausible membrane dipping loops hitherto uncharacterised by topology prediction methods or experimental approaches and 128 false positives (8.0%).", "paper_title": "A combinatorial pattern discovery approach for the prediction of membrane dipping (re-entrant) loops", "paper_id": "WOS:000250005000036"}