{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "extensive_class"}, {"score": 0.004259293347851015, "phrase": "coordinated_motion"}, {"score": 0.0037474693720823643, "phrase": "global_property"}, {"score": 0.0036100762867678415, "phrase": "maximum_or_average_movement"}, {"score": 0.003010893527930816, "phrase": "mobile_agents"}, {"score": 0.0027791193706247267, "phrase": "fixed-parameter_tractability"}, {"score": 0.0026771333996253783, "phrase": "tractable_and_intractable_movement_problems"}, {"score": 0.002405853977978678, "phrase": "minimal_configurations"}, {"score": 0.0023051837161137674, "phrase": "particular_problem"}, {"score": 0.002220551141101661, "phrase": "purely_combinatorial_question"}], "paper_keywords": ["Algorithms", " Fixed-parameter tractability", " movement problems", " pebbles", " treewidth"], "paper_abstract": "We study an extensive class of movement minimization problems that arise from many practical scenarios but so far have little theoretical study. In general, these problems involve planning the coordinated motion of a collection of agents (representing robots, people, map labels, network messages, etc.) to achieve a global property in the network while minimizing the maximum or average movement (expended energy). The only previous theoretical results about this class of problems are about approximation and are mainly negative: many movement problems of interest have polynomial in approximability. Given that the number of mobile agents is typically much smaller than the complexity of the environment, we turn to fixed-parameter tractability. We characterize the boundary between tractable and intractable movement problems in a very general setup: it turns out the complexity of the problem fundamentally depends on the treewidth of the minimal configurations. Thus, the complexity of a particular problem can be determined by answering a purely combinatorial question. Using our general tools, we determine the complexity of several concrete problems and fortunately show that many movement problems of interest can be solved efficiently.", "paper_title": "Minimizing Movement: Fixed-Parameter Tractability", "paper_id": "WOS:000345574900007"}