{"auto_keywords": [{"score": 0.04415653596856239, "phrase": "new_technique"}, {"score": 0.042848233390648034, "phrase": "niv."}, {"score": 0.00481495049065317, "phrase": "automatic_sleep"}, {"score": 0.004769958800452922, "phrase": "ventilator_signals"}, {"score": 0.004740197030914445, "phrase": "non-invasive_ventilation"}, {"score": 0.004637491230030104, "phrase": "niv"}, {"score": 0.004536976344964643, "phrase": "chronic_hypercapnic_respiratory_failure"}, {"score": 0.004261617028111862, "phrase": "required_technological_complexity"}, {"score": 0.004195418010131832, "phrase": "automatic_sleep_staging"}, {"score": 0.0039038519189781135, "phrase": "domiciliary_ventilators"}, {"score": 0.003643873052150612, "phrase": "electrocardiogram_recordings"}, {"score": 0.003587235362628753, "phrase": "cardiorespiratory_features"}, {"score": 0.003327349929456035, "phrase": "first_type"}, {"score": 0.0031448288291084, "phrase": "second_type"}, {"score": 0.003095923814666088, "phrase": "five_stages"}, {"score": 0.002953711377604328, "phrase": "patient-dependent_and_patient-independent_classifiers"}, {"score": 0.0028268629720802772, "phrase": "sleep_specialist"}, {"score": 0.0028003960243011975, "phrase": "average_accuracy"}, {"score": 0.002509284173541882, "phrase": "ppg-based_and_flow_features"}, {"score": 0.0022767594422780026, "phrase": "long-term_sleep_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Non-invasive ventilation", " Automatic sleep scoring", " Electrode-free classification", " Support Vector Machines"], "paper_abstract": "Non-invasive ventilation (NIV), a recognized treatment for chronic hypercapnic respiratory failure, is predominantly applied at night. Nevertheless, the quality of sleep is rarely evaluated due to the required technological complexity. A new technique for automatic sleep staging is here proposed for patients treated by NIV. This new technique only requires signals (airflow and hemoglobin oxygen saturation) available in domiciliary ventilators plus a photo-plethysmogram, a signal already managed by some ventilators. Consequently, electroencephalogram, electrooculogram, electromyogram, and electrocardiogram recordings are not needed. Cardiorespiratory features are extracted from the three selected signals and used as input to a Support Vector Machine (SVM) multi-class classifier. Two different types of sleep scoring were investigated: the first type was used to distinguish three stages (wake, REM sleep and nonREM sleep), and the second type was used to evaluate five stages (wake, REM sleep, N1, N2 and N3 stages). Patient-dependent and patient-independent classifiers were tested comparing the resulting hypnograms with those obtained from visual/manual scoring by a sleep specialist. An average accuracy of 91% (84%) was obtained with three-stage (five-stage) patient-dependent classifiers. With patient-independent classifiers, an average accuracy of 78% (62%) was obtained when three (five) sleep stages were scored. Also if the PPG-based and flow features are left out, a reduction of 4.5% (resp. 5%) in accuracy is observed for the three-stage (resp. five-stage) cases. Our results suggest that long-term sleep evaluation and nocturnal monitoring at home is feasible in patients treated by NIV. Our technique could even be integrated into ventilators. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic sleep staging from ventilator signals in non-invasive ventilation", "paper_id": "WOS:000321175500004"}