{"auto_keywords": [{"score": 0.02763740548243862, "phrase": "africa"}, {"score": 0.019256385684099386, "phrase": "asia"}, {"score": 0.00481495049065317, "phrase": "useful_tool"}, {"score": 0.004723322467153553, "phrase": "population_diversity"}, {"score": 0.004545240514015278, "phrase": "sample_sizes"}, {"score": 0.004208881856146758, "phrase": "allelic_distributions"}, {"score": 0.0039729853486821995, "phrase": "generalized_rarefaction_approach"}, {"score": 0.0033200826267264383, "phrase": "remaining_populations"}, {"score": 0.003256808693019209, "phrase": "equal-sized_subsamples"}, {"score": 0.003054450075234415, "phrase": "worldwide_human_microsatellite_dataset"}, {"score": 0.002958021635132416, "phrase": "high_number"}, {"score": 0.0028100102841877835, "phrase": "african_and_oceanian_populations"}, {"score": 0.002347775213789611, "phrase": "modern_populations"}, {"score": 0.002173679145840769, "phrase": "sample_size_correction"}, {"score": 0.0021049977753042253, "phrase": "population_history"}], "paper_keywords": [""], "paper_abstract": "Motivation: Analysis of the distribution of alleles across populations is a useful tool for examining population diversity and relationships. However, sample sizes often differ across populations, sometimes making it difficult to assess allelic distributions across groups. Results: We introduce a generalized rarefaction approach for counting alleles private to combinations of populations. Our method evaluates the number of alleles found in each of a set of populations but absent in all remaining populations, considering equal-sized subsamples from each population. Applying this method to a worldwide human microsatellite dataset, we observe a high number of alleles private to the combination of African and Oceanian populations. This result supports the possibility of a migration out of Africa into Oceania separate from the migrations responsible for the majority of the ancestry of the modern populations of Asia, and it highlights the utility of our approach to sample size correction in evaluating hypotheses about population history.", "paper_title": "ADZE: a rarefaction approach for counting alleles private to combinations of populations", "paper_id": "WOS:000260381200012"}