{"auto_keywords": [{"score": 0.03220004840176991, "phrase": "atomic_objects"}, {"score": 0.03069819562357211, "phrase": "failure-oblivious_services"}, {"score": 0.030052683840456753, "phrase": "failure-aware_services"}, {"score": 0.00481495049065317, "phrase": "distributed_service_resilience"}, {"score": 0.00476272232146049, "phrase": "f-resilient_services"}, {"score": 0.004559388082717885, "phrase": "associated_processes"}, {"score": 0.004329124434198367, "phrase": "connection_pattern"}, {"score": 0.004076933247171215, "phrase": "distributed_system"}, {"score": 0.004010730084243186, "phrase": "f-resilient_atomic_objects"}, {"score": 0.0039348451962364, "phrase": "consensus_problem"}, {"score": 0.0034422330919613294, "phrase": "n-process_consensus_services"}, {"score": 0.003241539155408198, "phrase": "larger_class"}, {"score": 0.003215091066260523, "phrase": "-oblivious_services"}, {"score": 0.002929968589372435, "phrase": "first_theorem"}, {"score": 0.0028046593475268174, "phrase": "failure_detectors"}, {"score": 0.0027141975147496264, "phrase": "failure-aware_service"}, {"score": 0.0024733853322652637, "phrase": "arbitrary_connection_patterns"}, {"score": 0.0022911610600672445, "phrase": "first_time"}, {"score": 0.002278669708496024, "phrase": "unified_framework"}, {"score": 0.00223548265756157, "phrase": "atomic_and_non-atomic_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Distributed services", " Resilience", " Boosting", " Consensus", " Atomic objects", " Failure detectors", " I/O automata"], "paper_abstract": "We study f-resilient services, which are guaranteed to operate as long as no more than f of the associated processes fail. We prove three theorems asserting the impossibility of boosting the resilience of such services. Our first theorem allows any connection pattern between processes and services but assumes these services to be atomic (linearizable) objects. This theorem says that no distributed system in which processes coordinate using f-resilient atomic objects and reliable registers can solve the consensus problem in the presence of f + 1 undetectable process stopping failures. In contrast, we show that it is possible to boost the resilience of some systems solving problems easier than consensus: for example, the 2-set consensus problem is solvable for 2n processes and 2n - 1 failures' (i.e., wait-free) using n-process consensus services resilient to n - 1 failures (wait-free). Our proof is short and self-contained. We then introduce the larger class of failure-oblivious services. These are services that cannot use information about failures, although they may behave more flexibly than atomic objects. An example of such a service is totally ordered broadcast. Our second theorem generalizes the first theorem and its proof to failure-oblivious services. Our third theorem allows the system to contain failure-aware services, such as failure detectors, in addition to failure-oblivious services. This theorem requires that each failure-aware service be connected to all processes; thus, f + 1 process failures overall can disable all the failure-aware services. In contrast, it is possible to boost the resilience of a system solving consensus using failure-aware services if arbitrary connection patterns between processes and services are allowed: consensus is solvable for any number of failures using only 1-resilient 2-process perfect failure detectors. As far as we know, this is the first time a unified framework has been used to describe both atomic and non-atomic objects, and the first time boosting analysis has been performed for services more general than atomic objects. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "The impossibility of boosting distributed service resilience", "paper_id": "WOS:000291293800003"}