{"auto_keywords": [{"score": 0.049568154654955704, "phrase": "facebook"}, {"score": 0.010612188543248876, "phrase": "virtual_private_social_networks"}, {"score": 0.004662427600500598, "phrase": "social_networking_sites"}, {"score": 0.00449859196755507, "phrase": "largest_sites"}, {"score": 0.004387329529902255, "phrase": "privacy_settings"}, {"score": 0.003788583194314947, "phrase": "sns"}, {"score": 0.0033542722986970265, "phrase": "first_complete_architecture"}, {"score": 0.003190215563286321, "phrase": "important_problem"}, {"score": 0.0030889995517870525, "phrase": "automatic_propagation"}, {"score": 0.003066945490483524, "phrase": "updated_profiles"}, {"score": 0.0029484244900690485, "phrase": "in-depth_study"}, {"score": 0.002834470668509792, "phrase": "vpsn"}, {"score": 0.0028142286985235977, "phrase": "user_experience"}, {"score": 0.0027841357057119317, "phrase": "proposed_solution"}, {"score": 0.002591554263245753, "phrase": "central_point"}, {"score": 0.0024122616475793206, "phrase": "simple_settings"}, {"score": 0.0023189818169615135, "phrase": "thorough_experiments"}, {"score": 0.002285961573963468, "phrase": "extended_set"}, {"score": 0.0021049977753042253, "phrase": "facebook_pages"}], "paper_keywords": ["Security", " Virtual private social networks", " Internet and privacy", " social networking sites", " Facebook privacy"], "paper_abstract": "The popularity of Social Networking Sites (SNS) is growing rapidly, with the largest sites serving hundreds of millions of users and their private information. The privacy settings of these SNSs do not allow the user to avoid sharing some information (e. g., name and profile picture) with all the other users. Also, no matter the privacy settings, this information is always shared with the SNS (that could sell this information or be hacked). To mitigate these threats, we recently introduced the concept of Virtual Private Social Networks (VPSNs). In this work we propose the first complete architecture and implementation of VPSNs for Facebook. In particular, we address an important problem left unexplored in our previous research-that is the automatic propagation of updated profiles to all the members of the same VPSN. Furthermore, we made an in-depth study on performance and implemented several optimization to reduce the impact of VPSN on user experience. The proposed solution is lightweight, completely distributed, does not depend on the collaboration from Facebook, does not have a central point of failure, it offers (with some limitations) the same functionality as Facebook, and apart from some simple settings, the solution is almost transparent to the user. Thorough experiments, with an extended set of parameters, we have confirmed the feasibility of the proposal and have shown a very limited time-overhead experienced by the user while browsing Facebook pages.", "paper_title": "Virtual Private Social Networks and a Facebook Implementation", "paper_id": "WOS:000329437500003"}