{"auto_keywords": [{"score": 0.03475909446366891, "phrase": "ldl-c_goal"}, {"score": 0.016291382465003987, "phrase": "cdss"}, {"score": 0.010311453763283535, "phrase": "hyperlipidemia_management"}, {"score": 0.00481495049065317, "phrase": "guideline-based_decision_support"}, {"score": 0.0045442212183089, "phrase": "cpoe"}, {"score": 0.004372207937638619, "phrase": "medication_errors"}, {"score": 0.0042748769561032325, "phrase": "clinical_decision_support_systems"}, {"score": 0.004206678601411097, "phrase": "practitioner_performance"}, {"score": 0.004073515217375164, "phrase": "long_cycle_time"}, {"score": 0.003957261767109878, "phrase": "wider_scope"}, {"score": 0.003819652968070514, "phrase": "hyperlipidemia_treatment_guideline"}, {"score": 0.0038073819845638227, "phrase": "atp_iii"}, {"score": 0.003782957707237928, "phrase": "adult_treatment_panel_iii"}, {"score": 0.0036986954643952203, "phrase": "medical_center"}, {"score": 0.0031386977609818736, "phrase": "odds_ratio"}, {"score": 0.002777156434571452, "phrase": "ldl-c_goal_level"}, {"score": 0.0027416032255956585, "phrase": "antihyperlipidemia_therapy"}, {"score": 0.0025954969340495353, "phrase": "cdss."}, {"score": 0.002296381861149051, "phrase": "total_prescribing_time"}, {"score": 0.0022379331011153146, "phrase": "preliminary_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Computerized physician order entry", " Clinical decision support system", " Medical order entry system", " Clinical practice guideline", " Evidence-based medicine", " Quality indicators", " Hyperlipidemia"], "paper_abstract": "Introduction: The Institute of Medicine has identified both Computerized Physician Order Entry (CPOE) and Electronic Prescription (EP) as key in reducing medication errors and improving safety. Many computerized clinical decision support systems (CDSSs) improve practitioner performance. However, the development of CDSSs involves a long cycle time that makes it difficult to apply in a wider scope. Methods: In this study, we integrated the hyperlipidemia treatment guideline ATP III (Adult Treatment Panel III) in a CPOE of a medical center. The first 200 consecutive patients followed up more than 1 year were recorded for analysis. Results: Our study revealed that 130 (65%) patients reached the LDL-C (low density lipoprotein-cholesterol) goal in 1 year. For those who with CDSS finished, 74% reached the LDL-C goal. For those who with CDSS exited, 57% reached the LDL-C goal. The odds ratio is 2.1 (1.2, 3.8) (p = 0.022), which means for those who with CDSS finished can have 2 times of chance to reach the LDL-C goal. The mean of days to attain the LDL-C goal level after initiation of antihyperlipidemia therapy was 175 +/- 98 days. 11,806 prescribing records from 8023 patients were collected for analyzing the reasons of prematurely exiting the CDSS. The most frequent reason for exiting the system is \"too busy to use\". Conclusion: We conclude that a CPOE with CDSS integrated may let more hyperlipidemia patients reach the LDL-C goal. However, data also showed the total prescribing time may increase. The results of a preliminary evaluation are presented to illustrate that the CDSSs can improve the quality of hyperlipidemia management. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A guideline-based decision support for pharmacological treatment can improve the quality of hyperlipidemia management", "paper_id": "WOS:000275897600008"}