{"auto_keywords": [{"score": 0.041917382197890735, "phrase": "alphabetical_order"}, {"score": 0.013907901948766668, "phrase": "research_credit"}, {"score": 0.00481495049065317, "phrase": "first_authorship"}, {"score": 0.004772593750252861, "phrase": "last_names"}, {"score": 0.004566308708871429, "phrase": "co-author_surnames"}, {"score": 0.0038431888954930083, "phrase": "four-author_articles"}, {"score": 0.0038093479435377764, "phrase": "eighteen_social_sciences"}, {"score": 0.0028195727965553367, "phrase": "high_correlation"}, {"score": 0.002733539375462443, "phrase": "first_authors"}, {"score": 0.0026267609106294817, "phrase": "high_percentages"}, {"score": 0.0025578967205807843, "phrase": "appropriate_allocation"}, {"score": 0.002512990657100351, "phrase": "similar_patterns"}, {"score": 0.0022999859758286423, "phrase": "social_science_disciplines"}, {"score": 0.002200337772403983, "phrase": "social_sciences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scientometrics", " Research evaluation", " Collaboration"], "paper_abstract": "The practice of listing co-author surnames in alphabetical order, irrespective of their contribution, can make it difficult to effectively allocate research credit to authors. This article compares the percentages of articles with co-authors in alphabetical order (alphabetization) for two-author, three-author and four-author articles in eighteen social sciences in 1995 and 2010 to assess how widespread this practice is. There is some degree of alphabetization in all disciplines except one but the level varies substantially between disciplines. This level is increasing slightly over time, on average, but it has increased substantially in a few disciplines and decreased in others, showing that the practice of alphabetization is not fading away. A high correlation between alphabetical order and the proportion of first authors near the beginning of the alphabet confirms that high percentages of alphabetical order could affect the appropriate allocation of research credit. Similar patterns were found for science and the humanities. Finally, since some degree of alphabetization is almost universal in social science disciplines, this practice may be affecting careers throughout the social sciences and hence seems indefensible. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Alphabetization and the skewing of first authorship towards last names early in the alphabet", "paper_id": "WOS:000323859700001"}