{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stochastic_abstract_policies"}, {"score": 0.015338999225467375, "phrase": "reinforcement_learning"}, {"score": 0.011998079090660987, "phrase": "target_task"}, {"score": 0.010783936870549881, "phrase": "effective_way"}, {"score": 0.004414806639101985, "phrase": "trial-and-error_interactions"}, {"score": 0.004047781270412204, "phrase": "long_time"}, {"score": 0.0039323225960857956, "phrase": "learning_performance"}, {"score": 0.0038838500580958744, "phrase": "prior_knowledge"}, {"score": 0.003757480190200645, "phrase": "proper_behavior"}, {"score": 0.003171358146412577, "phrase": "current_practice"}, {"score": 0.0029928611380840757, "phrase": "new_algorithm"}, {"score": 0.002968192753809507, "phrase": "absprob-pi"}, {"score": 0.0028243822059448266, "phrase": "stochastic_abstract_policy"}, {"score": 0.0028010985923790036, "phrase": "new_rl_tasks"}, {"score": 0.0024842242921857705, "phrase": "robotic_navigation_environment"}, {"score": 0.0024434201175883674, "phrase": "agent's_behavior"}, {"score": 0.002413256359147736, "phrase": "learning_process"}, {"score": 0.002363806685815014, "phrase": "transfer_ratio"}, {"score": 0.002344311033783139, "phrase": "different_amounts"}, {"score": 0.0023249757987087055, "phrase": "source_tasks"}, {"score": 0.002122507495446441, "phrase": "generalized_policy"}, {"score": 0.0021049977753042253, "phrase": "better_results"}], "paper_keywords": ["Knowledge transfer", " machine learning"], "paper_abstract": "Reinforcement learning (RL) enables an agent to learn behavior by acquiring experience through trial-and-error interactions with a dynamic environment. However, knowledge is usually built from scratch and learning to behave may take a long time. Here, we improve the learning performance by leveraging prior knowledge; that is, the learner shows proper behavior from the beginning of a target task, using the knowledge from a set of known, previously solved, source tasks. In this paper, we argue that building stochastic abstract policies that generalize over past experiences is an effective way to provide such improvement and this generalization outperforms the current practice of using a library of policies. We achieve that contributing with a new algorithm, AbsProb-PI-multiple and a framework for transferring knowledge represented as a stochastic abstract policy in new RL tasks. Stochastic abstract policies offer an effective way to encode knowledge because the abstraction they provide not only generalizes solutions but also facilitates extracting the similarities among tasks. We perform experiments in a robotic navigation environment and analyze the agent's behavior throughout the learning process and also assess the transfer ratio for different amounts of source tasks. We compare our method with the transfer of a library of policies, and experiments show that the use of a generalized policy produces better results by more effectively guiding the agent when learning a target task.", "paper_title": "Stochastic Abstract Policies: Generalizing Knowledge to Improve Reinforcement Learning", "paper_id": "WOS:000346734300007"}