{"auto_keywords": [{"score": 0.04733190377720633, "phrase": "use_case-based_evaluation_approach"}, {"score": 0.004715702140552199, "phrase": "objective_the_goal"}, {"score": 0.004586531354697466, "phrase": "successful_application"}, {"score": 0.004338860159008856, "phrase": "chi"}, {"score": 0.0041184131734368825, "phrase": "high_blood_pressure"}, {"score": 0.003828820997351295, "phrase": "google"}, {"score": 0.0034615969985956866, "phrase": "patient_proxies"}, {"score": 0.003401954670986958, "phrase": "use_case_tasks"}, {"score": 0.003129623571496151, "phrase": "human_factors"}, {"score": 0.0030017207229983385, "phrase": "use_case-based_approach"}, {"score": 0.0028195727965553367, "phrase": "thirty-nine_challenges"}, {"score": 0.002505054869094183, "phrase": "off-the-shelf_chi_interventions"}, {"score": 0.002427826856342292, "phrase": "larger_number"}, {"score": 0.0023942700905678735, "phrase": "actual_patient_populations"}, {"score": 0.0023529740798601015, "phrase": "conclusion_chi_designers"}, {"score": 0.002264607102799332, "phrase": "chi_intervention"}, {"score": 0.002248899833549883, "phrase": "patients'_health_work"}, {"score": 0.0021049977753042253, "phrase": "laboratory-based_studies"}], "paper_keywords": [""], "paper_abstract": "Objective The goal of this paper is to describe the successful application of a use case-based evaluation approach to guide the effective design, evaluation and redesign of inexpensive, commercial, off-the-shelf consumer health informatics (CHI) interventions. Design Researchers developed four CHI intervention use cases representing two distinct patient populations (patients with diabetes with high blood pressure, post-bariatric surgery patients), two commercial off-the-shelf CHI applications (Microsoft HealthVault, Google Health), and related devices (blood pressure monitor, pedometer, weight scale). Three patient proxies tested each intervention for 10 days. Measurements The patient proxies recorded their challenges while completing use case tasks, rating the severity of each challenge based on how much it hindered their use of the intervention. Two independent evaluators categorized the challenges by human factors domain (physical, cognitive, macroergonomic). Results The use case-based approach resulted in the identification of 122 challenges, with 12% physical, 50% cognitive and 38% macroergonomic. Thirty-nine challenges (32%) were at least moderately severe. Nine of 22 use case tasks (41%) accounted for 72% of the challenges. Limitations The study used two patient proxies and addressed two specific patient populations and low-cost, off-the-shelf CHI interventions, which may not perfectly generalize to a larger number of proxies, actual patient populations, or other CHI interventions. Conclusion CHI designers can employ the use case-based evaluation approach to assess the fit of a CHI intervention with patients' health work, in the context of their daily activities and environment, which would be difficult or impossible to evaluate by laboratory-based studies.", "paper_title": "Commercial off-the-shelf consumer health informatics interventions: recommendations for their design, evaluation and redesign", "paper_id": "WOS:000298848100021"}