{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adaptive_novel_class_detection_of_feature-evolving_data_streams"}, {"score": 0.004632968695963776, "phrase": "data_mining_community"}, {"score": 0.004074397977869244, "phrase": "data_stream"}, {"score": 0.0037238193456845124, "phrase": "common_phenomenon"}, {"score": 0.003692040748097991, "phrase": "data_streams"}, {"score": 0.003522027550662857, "phrase": "underlying_concepts"}, {"score": 0.0034033029171804106, "phrase": "new_classes"}, {"score": 0.003274499008699115, "phrase": "frequently_occurring_process"}, {"score": 0.00319134078848996, "phrase": "text_streams"}, {"score": 0.0027940789980683, "phrase": "ensemble_classification_framework"}, {"score": 0.0026882700311968025, "phrase": "novel_class_detector"}, {"score": 0.0025207284405252914, "phrase": "feature_set_homogenization_technique"}, {"score": 0.0024566655761509276, "phrase": "novel_class_detection_module"}, {"score": 0.002373767863833987, "phrase": "evolving_stream"}, {"score": 0.0021599099979586946, "phrase": "classification_techniques"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Data stream", " concept-evolution", " novel class", " outlier"], "paper_abstract": "Data stream classification poses many challenges to the data mining community. In this paper, we address four such major challenges, namely, infinite length, concept-drift, concept-evolution, and feature-evolution. Since a data stream is theoretically infinite in length, it is impractical to store and use all the historical data for training. Concept-drift is a common phenomenon in data streams, which occurs as a result of changes in the underlying concepts. Concept-evolution occurs as a result of new classes evolving in the stream. Feature-evolution is a frequently occurring process in many streams, such as text streams, in which new features (i.e., words or phrases) appear as the stream progresses. Most existing data stream classification techniques address only the first two challenges, and ignore the latter two. In this paper, we propose an ensemble classification framework, where each classifier is equipped with a novel class detector, to address concept-drift and concept-evolution. To address feature-evolution, we propose a feature set homogenization technique. We also enhance the novel class detection module by making it more adaptive to the evolving stream, and enabling it to detect more than one novel class at a time. Comparison with state-of-the-art data stream classification techniques establishes the effectiveness of the proposed approach.", "paper_title": "Classification and Adaptive Novel Class Detection of Feature-Evolving Data Streams", "paper_id": "WOS:000319461800004"}