{"auto_keywords": [{"score": 0.04611675251284609, "phrase": "fl"}, {"score": 0.0044624036486300865, "phrase": "fuzzy_logic"}, {"score": 0.003736567662016446, "phrase": "uncertain_values"}, {"score": 0.003569763795153386, "phrase": "parameter_tuning_rules"}, {"score": 0.003341839487905525, "phrase": "learning_algorithm"}, {"score": 0.0029735479904284706, "phrase": "noisy_conditions"}, {"score": 0.0028120022457134267, "phrase": "simulation_studies"}, {"score": 0.0027554538693034163, "phrase": "specific_systems"}, {"score": 0.002592523232809191, "phrase": "novel_membership_function"}, {"score": 0.002501955525421155, "phrase": "input_noise"}, {"score": 0.0024641134634779535, "phrase": "rule_base"}, {"score": 0.002390133671838151, "phrase": "general_way"}, {"score": 0.0023066199295447686, "phrase": "different_input-output_data_sets"}, {"score": 0.002181227522730908, "phrase": "proposed_novel_membership_function"}, {"score": 0.0021591707887653865, "phrase": "better_noise_reduction_property"}], "paper_keywords": ["Noise reduction property", " type-2 fuzzy logic (FL) system (FLS) (T2FLS)", " type-2 fuzzy sets"], "paper_abstract": "In this paper, the noise reduction property of type-2 fuzzy logic (FL) systems (FLSs) (T2FLSs) that use a novel type-2 fuzzy membership function is studied. The proposed type-2 membership function has certain values on both ends of the support and the kernel and some uncertain values for the other values of the support. The parameter tuning rules of a T2FLS that uses such a membership function are derived using the gradient descend learning algorithm. There exist a number of papers in the literature that claim that the performance of T2FLSs is better than type-1 FLSs under noisy conditions, and the claim is tried to be justified by simulation studies only for some specific systems. In this paper, a simpler T2FLS is considered with the novel membership function proposed in which the effect of input noise in the rule base is shown numerically in a general way. The proposed type-2 fuzzy neuro structure is tested on different input-output data sets, and it is shown that the T2FLS with the proposed novel membership function has better noise reduction property when compared to the type-1 counterparts.", "paper_title": "Analysis of the Noise Reduction Property of Type-2 Fuzzy Logic Systems Using a Novel Type-2 Membership Function", "paper_id": "WOS:000295012000018"}