{"auto_keywords": [{"score": 0.04904273003005848, "phrase": "coreference_resolution"}, {"score": 0.00481495049065317, "phrase": "discourse_entities"}, {"score": 0.004558564684763264, "phrase": "numerous_entities"}, {"score": 0.00380511089035825, "phrase": "hypothesis_space"}, {"score": 0.0037636590459094762, "phrase": "coreference_resolution_models"}, {"score": 0.003682100144121148, "phrase": "increased_performance"}, {"score": 0.0033546701239540555, "phrase": "model's_feature_representations"}, {"score": 0.0032107911131811057, "phrase": "discourse_entity_lifespans"}, {"score": 0.0030064251340251196, "phrase": "existing_results"}, {"score": 0.002508867228980776, "phrase": "feature_representations"}, {"score": 0.0024410093024417527, "phrase": "anchor_phrases"}, {"score": 0.0021049977753042253, "phrase": "significant_performance_improvements"}], "paper_keywords": [""], "paper_abstract": "A discourse typically involves numerous entities, but few are mentioned more than once. Distinguishing those that die out after just one mention (singleton) from those that lead longer lives (coreferent) would dramatically simplify the hypothesis space for coreference resolution models, leading to increased performance. To realize these gains, we build a classifier for predicting the singleton/coreferent distinction. The model's feature representations synthesize linguistic insights about the factors affecting discourse entity lifespans (especially negation, modality, and attitude predication) with existing results about the benefits of \"surface\" (part-of-speech and n-gram-based) features for coreference resolution. The model is effective in its own right, and the feature representations help to identify the anchor phrases in bridging anaphora as well. Furthermore, incorporating the model into two very different state-of-the-art coreference resolution systems, one rule-based and the other learning-based, yields significant performance improvements.", "paper_title": "Modeling the Lifespan of Discourse Entities with Application to Coreference Resolution", "paper_id": "WOS:000351921800001"}