{"auto_keywords": [{"score": 0.042105172167053985, "phrase": "terminal_tips"}, {"score": 0.013220003098355809, "phrase": "branching_points"}, {"score": 0.00481495049065317, "phrase": "neuronal_dendritic_branching_patterns"}, {"score": 0.004714387899814988, "phrase": "retinal_ganglion_cells"}, {"score": 0.0046159158660556985, "phrase": "sholl's_analysis"}, {"score": 0.004372002674739612, "phrase": "log-log_method"}, {"score": 0.004319566932528865, "phrase": "linear_two-_dimensional_sholl's_method"}, {"score": 0.004140924670517666, "phrase": "neuronal_dendrites"}, {"score": 0.003898411343926653, "phrase": "circle_radius"}, {"score": 0.0037939470786850457, "phrase": "mathematical_model"}, {"score": 0.0036811433915589216, "phrase": "dendritic_intersections"}, {"score": 0.003362393461932223, "phrase": "last_two_sets"}, {"score": 0.0032920678776655783, "phrase": "cumulative_frequency_plots"}, {"score": 0.0032427347282370225, "phrase": "logistic_model"}, {"score": 0.0032234746590085314, "phrase": "boltzmann"}, {"score": 0.0029262611715147454, "phrase": "inflection_points"}, {"score": 0.002899861600151726, "phrase": "corresponding_sigmoid_plots"}, {"score": 0.002779769492357829, "phrase": "additional_tool"}, {"score": 0.0027463775689957255, "phrase": "vertebrate_retinal_ganglion_cells"}, {"score": 0.0026326249204932733, "phrase": "morphologically_different_cat's_retinal_ganglion_cells"}, {"score": 0.002455857849359612, "phrase": "rat's_alpha_cells"}, {"score": 0.0024336917123957387, "phrase": "inner_and_outer_cells"}, {"score": 0.002318799760022913, "phrase": "inner_plexiform_layer"}, {"score": 0.0021049977753042253, "phrase": "biological_images"}], "paper_keywords": ["Branching points", " Logistic model", " Retina", " Sholl's analysis", " Terminal tips"], "paper_abstract": "Sholl's analysis has been used for about 50 years to study neuron branching characteristics based on a linear, semi-log or log-log method. Using the linear two- dimensional Sholl's method, we call attention to a relationship between the number of intersections of neuronal dendrites with a circle and the numbers of branching points and terminal tips encompassed by the circle, with respect to the circle radius. For that purpose, we present a mathematical model, which incorporates a supposition that the number of dendritic intersections with a circle can be resolved into two components: the number of branching points and the number of terminal tips within the annulus of two adjoining circles. The numbers of intersections and last two sets of data are also presented as cumulative frequency plots and analysed using a logistic model (Boltzmann's function). Such approaches give rise to several new morphometric parameters, such as, the critical, maximal and mean values of the numbers of intersections, branching points and terminal tips, as well as the abscissas of the inflection points of the corresponding sigmoid plots, with respect to the radius. We discuss these parameters as an additional tool for further morphological classification schemes of vertebrate retinal ganglion cells. To test the models, we apply them first to three groups of morphologically different cat's retinal ganglion cells (the alpha, gamma and epsilon cells). After that, in order to quantitatively support the classification of the rat's alpha cells into the inner and outer cells, we apply our models to two subgroups of these cells grouped according to their stratification levels in the inner plexiform layer. We show that differences between most of our parameters calculated for these subgroups are statistically significant. We believe that these models have the potential to aid in the classification of biological images.", "paper_title": "Mathematical modelling of neuronal dendritic branching patterns in two dimensions: application to retinal ganglion cells in the cat and rat", "paper_id": "WOS:000263868500001"}