{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "existential_rules"}, {"score": 0.010039887809943847, "phrase": "msa"}, {"score": 0.004718980873413673, "phrase": "ontologies"}, {"score": 0.004678317945062391, "phrase": "conjunctive_queries"}, {"score": 0.0044934920013049145, "phrase": "prominent_problem"}, {"score": 0.004467688517224214, "phrase": "knowledge_representation"}, {"score": 0.004328383851864678, "phrase": "chase_algorithm"}, {"score": 0.004217630522974106, "phrase": "fresh_facts"}, {"score": 0.00363080961099728, "phrase": "numerous_acyclicity_notions"}, {"score": 0.003589193972443107, "phrase": "sufficient_conditions"}, {"score": 0.0035685647258810738, "phrase": "chase_termination"}, {"score": 0.0032354070943654487, "phrase": "known_acyclicity_notions"}, {"score": 0.0031983089354509667, "phrase": "complete_taxonomy"}, {"score": 0.0030806545154428563, "phrase": "mfa"}, {"score": 0.0029502287070757704, "phrase": "horn_fragments"}, {"score": 0.002800977405203334, "phrase": "relevant_facts"}, {"score": 0.0027529194650495817, "phrase": "termination_problems"}, {"score": 0.0025761937402886954, "phrase": "termination_guarantees"}, {"score": 0.002481358892606969, "phrase": "principled_and_practical_solution"}, {"score": 0.0024317447319124066, "phrase": "theoretical_side"}, {"score": 0.0023762535034673017, "phrase": "acyclic_ontologies"}, {"score": 0.0023557715482776694, "phrase": "lower_complexity"}, {"score": 0.002335465722613665, "phrase": "general_ontologies"}, {"score": 0.0023086626639649724, "phrase": "practical_side"}, {"score": 0.0021171843749653477, "phrase": "principled_development"}, {"score": 0.0021049977753042253, "phrase": "materialisation-based_owl"}], "paper_keywords": [""], "paper_abstract": "Answering conjunctive queries (CQs) over a set of facts extended with existential rules is a prominent problem in knowledge representation and databases. This problem can be solved using the chase algorithm, which extends the given set of facts with fresh facts in order to satisfy the rules. If the chase terminates, then CQs can be evaluated directly in the resulting set of facts. The chase, however, does not terminate necessarily, and checking whether the chase terminates on a given set of rules and facts is undecidable. Numerous acyclicity notions were proposed as sufficient conditions for chase termination. In this paper, we present two new acyclicity notions called model-faithful acyclicity (MFA) and model-summarising acyclicity (MSA). Furthermore, we investigate the landscape of the known acyclicity notions and establish a complete taxonomy of all notions known to us. Finally, we show that MFA and MSA generalise most of these notions. Existential rules are closely related to the Horn fragments of the OWL 2 ontology language; furthermore, several prominent OWL 2 reasoners implement CQ answering by using the chase to materialise all relevant facts. In order to avoid termination problems, many of these systems handle only the OWL 2 RL profile of OWL 2; furthermore, some systems go beyond OWL 2 RL, but without any termination guarantees. In this paper we also investigate whether various acyclicity notions can provide a principled and practical solution to these problems. On the theoretical side, we show that query answering for acyclic ontologies is of lower complexity than for general ontologies. On the practical side, we show that many of the commonly used OWL 2 ontologies are MSA, and that the number of facts obtained by materialisation is not too large. Our results thus suggest that principled development of materialisation-based OWL 2 reasoners is practically feasible.", "paper_title": "Acyclicity Notions for Existential Rules and Their Application to Query Answering in Ontologies", "paper_id": "WOS:000323594900001"}