{"auto_keywords": [{"score": 0.0409658163863962, "phrase": "different_types"}, {"score": 0.0383444137402212, "phrase": "medline_document_clustering"}, {"score": 0.02289243508564586, "phrase": "ml_constraints"}, {"score": 0.02246846748295755, "phrase": "cl_constraints"}, {"score": 0.00481495049065317, "phrase": "mesh-semantic_and_global-content_constraints"}, {"score": 0.00421410521089045, "phrase": "whole_medline_collections"}, {"score": 0.004010477922833839, "phrase": "biomedical_documents"}, {"score": 0.0035230711775515854, "phrase": "ms_information"}, {"score": 0.003456554957885269, "phrase": "simple_linear_combination"}, {"score": 0.003327253821888569, "phrase": "representation_space"}, {"score": 0.0032027739752274, "phrase": "different_reliability"}, {"score": 0.0030829367866722825, "phrase": "new_semisupervised_spectral_clustering_method"}, {"score": 0.0029675701595142656, "phrase": "lc_similarities"}, {"score": 0.0028025415122856973, "phrase": "document_pairs"}, {"score": 0.0027812405653371503, "phrase": "high_ms"}, {"score": 0.002636587060621144, "phrase": "low_similarities"}, {"score": 0.0024804352736263005, "phrase": "medline_records"}, {"score": 0.0024615764782448214, "phrase": "experimental_results"}, {"score": 0.002405853977978678, "phrase": "linear_combination_method"}, {"score": 0.002246124435189668, "phrase": "ms_and_gc_similarities"}, {"score": 0.0021702728407945976, "phrase": "interesting_finding"}], "paper_keywords": ["Biomedical text mining", " document clustering", " semisupervised clustering", " spectral clustering"], "paper_abstract": "For clustering biomedical documents, we can consider three different types of information: the local-content (LC) information from documents, the global-content (GC) information from the whole MEDLINE collections, and the medical subject heading (MeSH)-semantic (MS) information. Previous methods for clustering biomedical documents are not necessarily effective for integrating different types of information, by which only one or two types of information have been used. Recently, the performance of MEDLINE document clustering has been enhanced by linearly combining both the LC and MS information. However, the simple linear combination could be ineffective because of the limitation of the representation space for combining different types of information (similarities) with different reliability. To overcome the limitation, we propose a new semisupervised spectral clustering method, i.e., SSNCut, for clustering over the LC similarities, with two types of constraints: must-link (ML) constraints on document pairs with high MS (or GC) similarities and cannot-link (CL) constraints on those with low similarities. We empirically demonstrate the performance of SSNCut on MEDLINE document clustering, by using 100 data sets of MEDLINE records. Experimental results show that SSNCut outperformed a linear combination method and several well-known semisupervised clustering methods, being statistically significant. Furthermore, the performance of SSNCut with constraints from both MS and GC similarities outperformed that from only one type of similarities. Another interesting finding was that ML constraints more effectively worked than CL constraints, since CL constraints include around 10% incorrect ones, whereas this number was only 1% for ML constraints.", "paper_title": "Efficient Semisupervised MEDLINE Document Clustering With MeSH-Semantic and Global-Content Constraints", "paper_id": "WOS:000322029400010"}