{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "digital_information"}, {"score": 0.004698000536608171, "phrase": "accelerated_pace"}, {"score": 0.004342430078306461, "phrase": "information_visualization_methods"}, {"score": 0.004216112320418982, "phrase": "human_perception"}, {"score": 0.0041136473765874815, "phrase": "complex_relationships"}, {"score": 0.004053362743156545, "phrase": "graphical_hierarchy_trees"}, {"score": 0.003896871009090446, "phrase": "conventional_methods"}, {"score": 0.003820896867623235, "phrase": "fixed_degree"}, {"score": 0.003479692058963528, "phrase": "magic_eye_view"}, {"score": 0.0032800186243040663, "phrase": "three-dimensional_interactive_function"}, {"score": 0.0025262061502713683, "phrase": "preferred_degree"}, {"score": 0.0022890371899188466, "phrase": "simulation_results"}, {"score": 0.002255431275670053, "phrase": "significant_advantages"}, {"score": 0.002233301265743633, "phrase": "existing_approaches"}, {"score": 0.0021682027434117095, "phrase": "crucial_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["3D interaction", " Information visualization", " Focus plus context technique"], "paper_abstract": "The generation of digital information is continuing at an accelerated pace, and the exploration of relationships within such enormous volumes of data is becoming increasingly difficult. Information visualization methods directly address the requirements of human perception to help users analyze complex relationships, and graphical hierarchy trees are employed to present the results. Conventional methods only provide a fixed degree of detail, despite the requirements of users to alter the manner in which data is viewed. Magic Eye View, a well-known information visualization tool, incorporates a three-dimensional interactive function allowing users to control the degree of detail with which they view data. Unfortunately, this system fails to provide a number of crucial focus + context features. To address these shortcomings, we propose a novel 3D information visualization method that enables users to control the focus point three-dimensionally and view the information at a preferred degree of detail. It also provides crucial focus + context features that help users to comprehend the data. Simulation results have shown significant advantages over existing approaches through the incorporation of these crucial features. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "An interactive and flexible information visualization method", "paper_id": "WOS:000313146700023"}