{"auto_keywords": [{"score": 0.04902896582647276, "phrase": "bigbatch"}, {"score": 0.00481495049065317, "phrase": "grid_implementations"}, {"score": 0.004631637679516574, "phrase": "image_processing_environment"}, {"score": 0.004430629452265786, "phrase": "monochromatic_documents"}, {"score": 0.004261885692956071, "phrase": "pioneer_aspects"}, {"score": 0.004031865694174726, "phrase": "distributed_environments"}, {"score": 0.003751228706861377, "phrase": "bigbatch_image_processing_features"}, {"score": 0.003175676186323053, "phrase": "new_lights"}, {"score": 0.0030208364972341096, "phrase": "almost_no_difference"}, {"score": 0.002987463078971627, "phrase": "total_execution_times"}, {"score": 0.0025008468316682036, "phrase": "peak_performance"}, {"score": 0.0022129983153880467, "phrase": "general_picture"}, {"score": 0.0021049977753042253, "phrase": "document_images"}], "paper_keywords": ["Cluster", " grid", " image processing", " load-balancing"], "paper_abstract": "BigBatch is an image processing environment designed to process batches of thousands of monochromatic documents. One of the flexibilities and pioneer aspects of BigBatch is offering the possibility of working in distributed environments such as clusters and grids. This paper presents an overview of BigBatch image processing features and analyzes the results of a number of experiments devised to compare its cluster and grid configurations. Although preliminary results were published earlier on, the new data shown here that sheds new lights onto this aspect. The results obtained exhibit almost no difference in total execution times for some grid and cluster configurations, but significant differences for others, indicating that the choice between such configurations must take into account a number of details in order to reach peak performance. Besides those, there are other qualitative aspects that may impact this choice. This paper analyzes these aspects and provides a general picture of how to successfully use BigBatch to process document images employing computers in parallel for this task.", "paper_title": "Comparative Aspects between the Cluster and Grid Implementations of BigBatch", "paper_id": "WOS:000264754500009"}