{"auto_keywords": [{"score": 0.026698537067676022, "phrase": "competitive_ratio"}, {"score": 0.010614445455718248, "phrase": "buffer_management_strategy"}, {"score": 0.009040449889237879, "phrase": "suppressed_packets"}, {"score": 0.00481495049065317, "phrase": "packets_improves_buffer_management"}, {"score": 0.004721711709176679, "phrase": "service_switches."}, {"score": 0.004607686390487483, "phrase": "network_switches"}, {"score": 0.004562847483469705, "phrase": "different_levels"}, {"score": 0.004240116703465252, "phrase": "arbitrary_number"}, {"score": 0.004198839649063847, "phrase": "new_packets"}, {"score": 0.002852256089630964, "phrase": "sent_packets"}, {"score": 0.0027026375053777543, "phrase": "deterministic_strategy"}, {"score": 0.0024028135317872, "phrase": "best_known_competitive_ratio"}, {"score": 0.0023677483882740317, "phrase": "deterministic_case"}, {"score": 0.002276717177453959, "phrase": "memoryless_version"}, {"score": 0.0021049977753042253, "phrase": "first_memoryless_strategy"}], "paper_keywords": ["online algorithms", " competitive analysis", " buffer management", " bounded delay", " quality of service"], "paper_abstract": "The following buffer management problem arises in network switches providing different levels of services: At the beginning of each time step, one packet can be sent, and afterward an arbitrary number of new packets arrive. Packets that are not sent can be stored in a buffer. Each packet has a deadline, and a packet is automatically deleted from the buffer if it is still stored in the buffer by the end of its deadline. Additionally, each packet has a value which reflects its importance. A buffer management strategy determines the packet to be sent in each time step. The goal of a buffer management strategy is to maximize the sum of the values of sent packets. We introduce the concept of suppressed packets and present a deterministic strategy that is based on this concept. We show that this strategy achieves a competitive ratio of 2 root 2 - 1 approximate to 1.828, which is the best known competitive ratio in the deterministic case. In addition, we present a memoryless version of this strategy that achieves a competitive ratio of approximate to 1.893. This is the first memoryless strategy that achieves a competitive ratio less than 2. Altogether, this demonstrates the potential of the concept of suppressed packets.", "paper_title": "CONSIDERING SUPPRESSED PACKETS IMPROVES BUFFER MANAGEMENT IN QUALITY OF SERVICE SWITCHES", "paper_id": "WOS:000310582600004"}