{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "motion_uncertainty"}, {"score": 0.004684157900507474, "phrase": "adaptive_robot_speed_control_method"}, {"score": 0.004641351004344458, "phrase": "safe_and_efficient_navigation"}, {"score": 0.004392565073466714, "phrase": "trade-off_relationship"}, {"score": 0.004176194589991187, "phrase": "low_reliability"}, {"score": 0.0041001740903338834, "phrase": "environment_recognition"}, {"score": 0.003916098498242888, "phrase": "speed_control"}, {"score": 0.0036052633308076933, "phrase": "narrow_free_space"}, {"score": 0.0026494723416072316, "phrase": "simple_but_effective_strategy"}, {"score": 0.0025537472239953807, "phrase": "safest_fast_speed"}, {"score": 0.0023079225317714815, "phrase": "proposed_method"}, {"score": 0.002214297250267208, "phrase": "unknown_static_environments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["mobile robot", " navigation in unknown environments", " adaptive speed control", " map generation"], "paper_abstract": "This paper describes an adaptive robot speed control method for safe and efficient navigation in unknown environments. Safety and efficiency are usually in a trade-off relationship. Moving quickly increases efficiency but decreases safety due to low reliability in localization and environment recognition; moving slowly decreases efficiency but increases safety. Speed control considering this trade-off is important in the following two cases. (1) When the robot enters a narrow free space, it needs to control the speed to avoid any collisions by considering the motion uncertainty. (2) When the robot enters a region whose vacancy (i.e., being free) has not been decided yet, it needs to control the speed so that it can observe the region sufficiently to be confident with the vacancy of the region. This paper proposes a simple but effective strategy for such a speed control that the robot selects the safest fast speed. To adopt this strategy, we define criteria for judging whether a speed is safe for the above two cases. The proposed method successfully makes, the robot move around in unknown static environments by adaptively controlling the speed. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Adaptive robot speed control by considering map and motion uncertainty", "paper_id": "WOS:000235256900004"}