{"auto_keywords": [{"score": 0.04807157020342475, "phrase": "search_systems"}, {"score": 0.025698719444026977, "phrase": "search_decisions"}, {"score": 0.00481495049065317, "phrase": "interface_support_mechanisms"}, {"score": 0.004773904938276846, "phrase": "interactive_information_retrieval"}, {"score": 0.0046928556063004214, "phrase": "search_technology"}, {"score": 0.004162602203448056, "phrase": "user_interests"}, {"score": 0.00385368199735867, "phrase": "search_results"}, {"score": 0.0037719988989298983, "phrase": "retrieved_material"}, {"score": 0.0036762529165489644, "phrase": "new_search_functionality"}, {"score": 0.0036448787596988423, "phrase": "system_designers"}, {"score": 0.003582928547553209, "phrase": "tho_new_functionality"}, {"score": 0.0023035249767734286, "phrase": "control_users"}, {"score": 0.0021049977753042253, "phrase": "user's_search"}], "paper_keywords": [""], "paper_abstract": "Advances in search technology have meant that search systems can now offer assistance to users beyond simply retrieving a set of documents. For example, search systems are now capable of inferring user interests by observing their interaction, offering suggestions about what terms could be used in a query, or reorganizing search results to make exploration of retrieved material more effective. When providing new search functionality, system designers must decide how tho new functionality should be offered to users. One major choice is between (a) offering automatic features that require little human input, but give little human control; or (b) interactive features which allow human control over how the feature is used, but often give little guidance over how the feature should be best used. This article presents a study in which we empirically investigate the issue of control by presenting an experiment in which participants were asked to interact with three experimental systems that vary the degree of control they had in creating queries, indicating which results are relevant in making search decisions. We use our findings to discuss why and how the control users want over search decisions can vary depending on the nature of the decisions and the impact of those decisions on the user's search.", "paper_title": "A study of interface support mechanisms for interactive information retrieval", "paper_id": "WOS:000237125400009"}