{"auto_keywords": [{"score": 0.04245029123448948, "phrase": "product-related_and_organization-related_characteristics"}, {"score": 0.028841904482755882, "phrase": "dea"}, {"score": 0.00481495049065317, "phrase": "integrated_approach"}, {"score": 0.0047804843375940835, "phrase": "supplier_portfolio_selection"}, {"score": 0.004096082254543022, "phrase": "supplier_selection"}, {"score": 0.003839422251550131, "phrase": "probable_changes"}, {"score": 0.003611751858608048, "phrase": "lean_and_agile_criteria"}, {"score": 0.003459191419478298, "phrase": "best_criteria"}, {"score": 0.0032423089921154503, "phrase": "appropriate_supplier_portfolio"}, {"score": 0.0031845067058084583, "phrase": "supplier_selection_problem"}, {"score": 0.003105305189036267, "phrase": "multi-criteria_decision_making"}, {"score": 0.002952745241052452, "phrase": "analytical_network_process"}, {"score": 0.00247529638625566, "phrase": "anp_approach"}, {"score": 0.0023791769068748194, "phrase": "accurate_interdependencies"}, {"score": 0.0023536149458842992, "phrase": "proposed_criteria"}, {"score": 0.0022950308685133224, "phrase": "evaluation_laboratory"}, {"score": 0.002278562065142173, "phrase": "dematel"}, {"score": 0.002190064650401852, "phrase": "real_case"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Supplier selection", " Analytical hierarchy process", " Lean manufacturing", " Agile manufacturing"], "paper_abstract": "Supply chain environment is more dynamic and unpredictable than the past; therefore, it needs to be highly flexible in order to reconfigure in response to changes in their environment on the spur of the moment. This study presents a framework for supplier selection based on product-related and organization-related characteristics of the suppliers to be more competitive in the market and flexible to overcome probable changes in demands, supplies etc. Product-related and organization-related characteristics are those which are named in this study as lean and agile criteria respectively. Comprehensively digging up the literature, we extract the best criteria representing both leanness and agility of an organization. The aim of this paper is to select an appropriate supplier portfolio based on two aforementioned concepts. Supplier selection problem is solved using a combination of multi-criteria decision making (MCDM) methods. Due to the interaction between the criteria, analytical network process (ANP) is applied for determining the weight of each criterion for each alternative (supplier), and then data envelopment analysis (DEA) is used to rank them. The reason that DEA is used in this study is that when the number of suppliers increases, ANP approach tends to work inefficiently. Moreover, for determining the accurate interdependencies between the proposed criteria, fuzzy decision making trial and evaluation laboratory (DEMATEL) is applied. The framework is applied on a real case to demonstrate its applicability and feasibility. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An integrated approach for supplier portfolio selection: Lean or agile?", "paper_id": "WOS:000344034300057"}