{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "force_method"}, {"score": 0.02609370443536681, "phrase": "regular_part"}, {"score": 0.015719716506582538, "phrase": "near-regular_structures"}, {"score": 0.00578422833341315, "phrase": "statically_determinate_basic_structure"}, {"score": 0.005368309995089755, "phrase": "basic_structure"}, {"score": 0.00427081960618674, "phrase": "additional_elements"}, {"score": 0.004264558080356621, "phrase": "additional_part"}, {"score": 0.004050996777117918, "phrase": "canonical_forms"}, {"score": 0.0037069087922811488, "phrase": "near-regular_structure"}, {"score": 0.002893434697072309, "phrase": "new_algebraic_method"}, {"score": 0.0027741761880779535, "phrase": "efficient_analysis"}, {"score": 0.0027483472371835865, "phrase": "large_near-regular_structures"}, {"score": 0.002311525062244175, "phrase": "redundant_elements"}, {"score": 0.0021649437083408425, "phrase": "present_approach"}, {"score": 0.0021049977753042253, "phrase": "missing_elements"}], "paper_keywords": ["Regular structure (graphs)", " Near-regular structures (graphs)", " Force method", " Eigensolution", " Analysis of structure", " Force", " Structures"], "paper_abstract": "Purpose - In the analysis of some near-regular structures one can solve the regular part independently and then superimpose the effect of the additional part. For such models, the matrices corresponding to regular part have canonical forms and their eigensolution or inversion can easily be performed. The effect of member changing the regular to a near-regular structure can then be added. The purpose of this paper is to analyze near-regular structures using the force method. Design/methodology/approach - The paper uses the force method, and instead of selecting a statically determinate basic structure (standard method), the paper employs the regular part of the structure as the basic structure. Findings - A new algebraic method is introduced for the force method of analysis for efficient analysis of large near-regular structures. Originality/value - In this paper, the force method is used, however, instead of selecting a statically determinate basic structure, the regular part of the structure is employed as the basic structure. Those additional elements are considered as redundant elements. This method is applied to truss and frame structures. In the present approach it is possible to have missing elements instead of additional elements.", "paper_title": "Analysis of near-regular structures using the force method", "paper_id": "WOS:000316236900002"}