{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computer-guided_diagnosis"}, {"score": 0.004471530397729526, "phrase": "almost_real-time_us_volume_imaging"}, {"score": 0.003952513974962462, "phrase": "computer_guidance"}, {"score": 0.003808845109556467, "phrase": "exact_position"}, {"score": 0.0036703791815812328, "phrase": "tracking_reference"}, {"score": 0.0034935290662899488, "phrase": "probe_calibration"}, {"score": 0.003244050414264445, "phrase": "membrane_phantom"}, {"score": 0.0031845067058084583, "phrase": "calibration_matrix"}, {"score": 0.0030497740719977835, "phrase": "membrane_plane"}, {"score": 0.0028670988845838296, "phrase": "plane_detection"}, {"score": 0.0027120400060701034, "phrase": "feature_extraction_process"}, {"score": 0.0025495426598675583, "phrase": "calibration_system"}, {"score": 0.002456744238900652, "phrase": "clinical_context"}, {"score": 0.0021710766932077972, "phrase": "rms_angular_error"}, {"score": 0.0021049977753042253, "phrase": "point_reconstruction_accuracy"}], "paper_keywords": [""], "paper_abstract": "With the emergence of swept-volume ultrasound (US) probes, precise and almost real-time US volume imaging has become available. This offers many new opportunities for computer guided diagnosis and therapy, 3-D images containing significantly more information than 2-D slices. However, computer guidance often requires knowledge about the exact position of US voxels relative to a tracking reference, which can only be achieved through probe calibration. In this paper we present a 3-D US probe calibration system based on a membrane phantom. The calibration matrix is retrieved by detection of a membrane plane in a dozen of US acquisitions of the phantom. Plane detection is robustly performed with the 2-D Hough transformation. The feature extraction process is fully automated, calibration requires about 20 minutes and the calibration system can be used in a clinical context. The precision of the system was evaluated to a root mean square (RMS) distance error of 1.15nm and to an RMS angular error of 0.61 degrees. The point reconstruction accuracy was evaluated to 0.9mm and the angular reconstruction accuracy to 1.79 degrees.", "paper_title": "3-D ultrasound probe calibration for computer-guided diagnosis and therapy", "paper_id": "WOS:000241602500022"}