{"auto_keywords": [{"score": 0.03936608684117128, "phrase": "discovery_process"}, {"score": 0.00481495049065317, "phrase": "resource_discovery"}, {"score": 0.004626680470601208, "phrase": "read-dominated_behaviour"}, {"score": 0.004223415145617665, "phrase": "frequent_queries"}, {"score": 0.004175533280178052, "phrase": "information_discovery"}, {"score": 0.003877211065759289, "phrase": "summary_techniques"}, {"score": 0.0034395119150793787, "phrase": "grid_computing_environments"}, {"score": 0.0032860401904845522, "phrase": "computational_and_storage_resources"}, {"score": 0.002898291237210567, "phrase": "network-aware_summarisation_algorithms"}, {"score": 0.002254357921422124, "phrase": "specific_types"}, {"score": 0.0021784009230363627, "phrase": "summarised_content"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network awareness", " Content networks", " Clustering", " Summarisation", " Large-scale information systems"], "paper_abstract": "Many application scenarios have a read-dominated behaviour of information provision, which means that there are few updates, and that users execute frequent queries for information discovery. Discovery of content in such systems could benefit from the use of summary techniques in order to facilitate the discovery process and minimise the size of the data exchanged. This is particularly applicable within Grid computing environments where nodes (representing a group of computational and storage resources), which enable jobs to reach them may need to exchange metadata with each other about their resources. We introduce network-aware summarisation algorithms for the resource discovery in P2P-content networks, which are based on Cobweb clustering. We identify how summarisation can improve the discovery process while also improving the accuracy of the discovered resource(s). Metrics based on precision-recall are used to compare the accuracy for specific types of queries generated over the summarised content. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Network-aware summarisation for resource discovery in P2P-content networks", "paper_id": "WOS:000298774200009"}