{"auto_keywords": [{"score": 0.03654234973952578, "phrase": "unit_information"}, {"score": 0.015719716506582538, "phrase": "product_family_life_cycle"}, {"score": 0.014412963742343255, "phrase": "product_family"}, {"score": 0.004451546786101008, "phrase": "entire_life_cycle"}, {"score": 0.004370087541308677, "phrase": "mass_customisation"}, {"score": 0.004330019101593187, "phrase": "mc"}, {"score": 0.004172874316207784, "phrase": "information_integration_modelling_architecture"}, {"score": 0.003929689573550262, "phrase": "comprehensive_perspective"}, {"score": 0.0038046452381676967, "phrase": "single_product"}, {"score": 0.0030196181347744372, "phrase": "life_cycle"}, {"score": 0.0029642838574678526, "phrase": "different_depth"}, {"score": 0.002640636493247601, "phrase": "dynamic_evolution_processes"}, {"score": 0.0021049997346287348, "phrase": "mc."}], "paper_keywords": ["product family", " product life cycle", " mass customisation", " information integration", " information model"], "paper_abstract": "To support integrating, managing, sharing and reusing information throughout the entire life cycle of product family in mass customisation (MC), this paper puts forward an information integration modelling architecture for product family life cycle (I(2)MAfPFL). As an architecture built from the comprehensive perspective of the product family rather than the single product, the I(2)MAfPFL is centred on the model of three-dimensional (3-D) state space with integration of the model of unit information and the model of the 3-D evolution space. In the I(2)MAfPFL, the model of unit information is used to represent the features of unit information produced throughout all phases in the life cycle of product family in different depth and level. The model of 3-D state space provides the structure and framework to support integrating unit information, and the model of 3-D evolution space describes the dynamic evolution processes of unit information and reveals the internal correlated, interacted and evolved relationships among them. The expression of the three models in the I(2)MAfPFL is explained in detail. Finally, a case is used to demonstrate how the I(2)MAfPFL is used to integrate information for the product family life cycle in MC.", "paper_title": "An information integration modelling architecture for product family life cycle in mass customisation", "paper_id": "WOS:000337245200005"}