{"auto_keywords": [{"score": 0.04484001917361669, "phrase": "general_cytotoxicity_model"}, {"score": 0.043025239716159284, "phrase": "drug_discovery_process"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_data_sources"}, {"score": 0.004793203387266194, "phrase": "bayesian_learning"}, {"score": 0.004685925469417181, "phrase": "pfizer"}, {"score": 0.004591420273889298, "phrase": "public_sources"}, {"score": 0.004428071672932172, "phrase": "assay_formats"}, {"score": 0.004378221614702569, "phrase": "different_measured_endpoints"}, {"score": 0.004358438393001596, "phrase": "incubation_times"}, {"score": 0.004338744173262641, "phrase": "cell_types"}, {"score": 0.004222425791189547, "phrase": "computational_model"}, {"score": 0.004146610621578086, "phrase": "potentially_cytotoxic_series"}, {"score": 0.004053745316167863, "phrase": "bayesian_models"}, {"score": 0.003971938976270902, "phrase": "default_physical_property_descriptors"}, {"score": 0.003847941142006433, "phrase": "roc_score"}, {"score": 0.003770272297171597, "phrase": "experimental_outcome"}, {"score": 0.003685804072151312, "phrase": "prediction_pairs"}, {"score": 0.0035626240654214932, "phrase": "roc_scores"}, {"score": 0.002965015957679959, "phrase": "fda"}, {"score": 0.0029515810021277797, "phrase": "drug_compounds"}, {"score": 0.0028985178863303483, "phrase": "predictive_model"}, {"score": 0.0028854014057868916, "phrase": "general_cytotoxicity"}, {"score": 0.0028335246764206205, "phrase": "multiple_ways"}, {"score": 0.0027574483087986048, "phrase": "different_assay_formats"}, {"score": 0.0026773292902090248, "phrase": "potentially_toxic_compound"}, {"score": 0.0026652110650500957, "phrase": "multiple_assays"}, {"score": 0.0024673738215365104, "phrase": "cytotoxicity_assay"}, {"score": 0.0022997906242985737, "phrase": "first_time"}, {"score": 0.002253299769886694, "phrase": "known_cytotoxic_compounds"}, {"score": 0.002238012143899288, "phrase": "pfizer_compound_collection"}, {"score": 0.002202742267484358, "phrase": "predictive_cytotoxicity_model"}, {"score": 0.0021729527129781463, "phrase": "new_compounds"}, {"score": 0.0021582090265155783, "phrase": "desired_cytotoxicity_profile"}, {"score": 0.002129020447793464, "phrase": "model_output"}], "paper_keywords": [""], "paper_abstract": "Background: We collected data from over 80 different cytotoxicity assays from Pfizer in-house work as well as from public sources and investigated the feasibility of using these datasets, which come from a variety of assay formats (having for instance different measured endpoints, incubation times and cell types) to derive a general cytotoxicity model. Our main aim was to derive a computational model based on this data that can highlight potentially cytotoxic series early in the drug discovery process. Results: We developed Bayesian models for each assay using Scitegic FCFP_6 fingerprints together with the default physical property descriptors. Pairs of assays that are mutually predictive were identified by calculating the ROC score of the model derived from one predicting the experimental outcome of the other, and vice versa. The prediction pairs were visualised in a network where nodes are assays and edges are drawn for ROC scores >0.60 in both directions. We observed that, if assay pairs (A, B) and (B, C) were mutually predictive, this was often not the case for the pair (A, C). The results from 48 assays connected to each other were merged in one training set of 145590 compounds and a general cytotoxicity model was derived. The model has been cross-validated as well as being validated with a set of 89 FDA approved drug compounds. Conclusions: We have generated a predictive model for general cytotoxicity which could speed up the drug discovery process in multiple ways. Firstly, this analysis has shown that the outcomes of different assay formats can be mutually predictive, thus removing the need to submit a potentially toxic compound to multiple assays. Furthermore, this analysis enables selection of (a) the easiest-to-run assay as corporate standard, or (b) the most descriptive panel of assays by including assays whose outcomes are not mutually predictive. The model is no replacement for a cytotoxicity assay but opens the opportunity to be more selective about which compounds are to be submitted to it. On a more mundane level, having data from more than 80 assays in one dataset answers, for the first time, the question - \"what are the known cytotoxic compounds from the Pfizer compound collection?\" Finally, having a predictive cytotoxicity model will assist the design of new compounds with a desired cytotoxicity profile, since comparison of the model output with data from an in vitro safety/toxicology assay suggests one is predictive of the other.", "paper_title": "Predicting cytotoxicity from heterogeneous data sources with Bayesian learning", "paper_id": "WOS:000208222200010"}