{"auto_keywords": [{"score": 0.04142946866573755, "phrase": "logically_redundant_information"}, {"score": 0.0043309416106824495, "phrase": "hierarchically_structured_domains"}, {"score": 0.0037336520904376687, "phrase": "significant_reduction"}, {"score": 0.0033817999428800457, "phrase": "generation_algorithms"}, {"score": 0.00310664242361199, "phrase": "generated_expression"}, {"score": 0.0027159094186967247, "phrase": "human_subjects"}, {"score": 0.0026214978443388653, "phrase": "first_experiment"}, {"score": 0.0025664295665392203, "phrase": "human_judges"}, {"score": 0.0024772013657695896, "phrase": "logically_redundant_expressions"}, {"score": 0.0022434880661725493, "phrase": "second_experiment"}, {"score": 0.0021049977753042253, "phrase": "logical_redundancy"}], "paper_keywords": [""], "paper_abstract": "It is often desirable that referring expressions be chosen in such a way that their referents are easy to identify. This article focuses on referring expressions in hierarchically structured domains, exploring the hypothesis that referring expressions can be improved by including logically redundant information in them if this leads to a significant reduction in the amount of search that is needed to identify the referent, Generation algorithms are presented that implement this idea by including logically redundant information into the generated expression, in certain well-circumscribed situations. To test our hypotheses, and to assess the performance of our algorithms, two controlled experiments with human subjects were conducted. The first experiment confirms that human judges have a preference for logically redundant expressions in the cases where our model predicts this to be the case. The second experiment suggests that readers benefit from the kind of logical redundancy that our algorithms produce, as measured in terms of the effort needed to identify the referent of the expression.", "paper_title": "Generating referring expressions: Making referents easy to identify", "paper_id": "WOS:000247471600004"}