{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "time_series"}, {"score": 0.014429121292476577, "phrase": "information_granules"}, {"score": 0.00763244140542191, "phrase": "granular_computing"}, {"score": 0.005278418332670382, "phrase": "granular_models"}, {"score": 0.0052045575384789735, "phrase": "granular_time_series"}, {"score": 0.004667894913438327, "phrase": "truly_remarkable_diversity"}, {"score": 0.004538091274791439, "phrase": "evident_need"}, {"score": 0.0042290889708544305, "phrase": "great_deal"}, {"score": 0.004111437132764509, "phrase": "nonlinear_numeric_models"}, {"score": 0.004042416569959828, "phrase": "evident_objective"}, {"score": 0.004008340263071222, "phrase": "high_accuracy"}, {"score": 0.0037990701686283672, "phrase": "evident_and_ongoing_challenge"}, {"score": 0.003600686288078524, "phrase": "abstract_constructs"}, {"score": 0.003550218173441985, "phrase": "plain_numeric_entities"}, {"score": 0.003403004190606271, "phrase": "interpretable_entities"}, {"score": 0.003364785219131544, "phrase": "pivotal_role"}, {"score": 0.003162101526249052, "phrase": "generic_concepts"}, {"score": 0.0031001995131925896, "phrase": "fundamental_way"}, {"score": 0.002929913956904329, "phrase": "justifiable_granularity"}, {"score": 0.0026690928516336153, "phrase": "granular_representation"}, {"score": 0.002572822239596127, "phrase": "fundamental_hierarchically"}, {"score": 0.0025655618834535027, "phrase": "organized_layers"}, {"score": 0.0024452162861064524, "phrase": "granular_descriptors"}, {"score": 0.0022848429198019885, "phrase": "linguistic_prediction_models"}, {"score": 0.002246417055582878, "phrase": "linguistic_descriptors"}, {"score": 0.0021592456879408937, "phrase": "entire_paper"}, {"score": 0.0021229275892217583, "phrase": "main_functionalities"}, {"score": 0.0021049977753042253, "phrase": "essential_layers"}], "paper_keywords": ["Information granularity", " Granular time series", " Principle of justifiable granularity", " Linguistic description", " Higher order granular models"], "paper_abstract": "In spite of the truly remarkable diversity of models of time series, there is still an evident need to develop constructs whose accuracy and interpretability are carefully identified and reconciled subsequently leading to highly interpretable (human-centric) constructs. While a great deal of research has been devoted to the design of nonlinear numeric models of time series (with an evident objective to achieve high accuracy of prediction), an issue of interpretability (transparency) of models of time series becomes an evident and ongoing challenge. The user-friendliness of models of time series comes with an ability of humans to perceive and process abstract constructs rather than dealing with plain numeric entities. In perception of time series, information granules (which are regarded as realizations of interpretable entities) play a pivotal role. This gives rise to a concept of granular models of time series or granular time series, in brief. This study revisits generic concepts of information granules and elaborates on a fundamental way of forming information granules (both sets-intervals as well as fuzzy sets) through applying a principle of justifiable granularity encountered in granular computing. Information granules are discussed with regard to the granulation of time series in a certain predefined representation space (viz. a feature space) and granulation carried out in time. The granular representation and description of time series is then presented. We elaborate on the fundamental hierarchically organized layers of processing supporting the development and interpretation of granular time series, namely (a) formation of granular descriptors used in their visualization, (b) construction of linguistic descriptors used afterwards in the generation of (c) linguistic description of time series. The layer of the linguistic prediction models of time series exploiting the linguistic descriptors is outlined as well. A number of examples are offered throughout the entire paper with intent to illustrate the main functionalities of the essential layers of the granular models of time series.", "paper_title": "Human-centric analysis and interpretation of time series: a perspective of granular computing", "paper_id": "WOS:000345097100006"}