{"auto_keywords": [{"score": 0.0493187379183741, "phrase": "information_scent"}, {"score": 0.015956318972842786, "phrase": "time_constraints"}, {"score": 0.009862851164052413, "phrase": "website_owners"}, {"score": 0.004814957165200867, "phrase": "cyberspace"}, {"score": 0.004050116768809519, "phrase": "specific_information"}, {"score": 0.003025197043767572, "phrase": "high_information_scent"}, {"score": 0.00299622333197717, "phrase": "important_design_goal"}, {"score": 0.0029391032882625473, "phrase": "latent_semantic_analysis"}, {"score": 0.002901627749562029, "phrase": "useful_tool"}, {"score": 0.0025521085778978042, "phrase": "users'_satisfaction"}, {"score": 0.002495411946660959, "phrase": "website_designers"}, {"score": 0.002347775213789611, "phrase": "page_point"}, {"score": 0.0023178219772486868, "phrase": "appropriate_destination"}, {"score": 0.0022663183381878044, "phrase": "latent_semantic_analysis_tool"}, {"score": 0.002173679145840769, "phrase": "clear_links"}, {"score": 0.0021597662797996843, "phrase": "even_more_importance"}, {"score": 0.0021049977753042253, "phrase": "measurable_stress"}], "paper_keywords": ["human-computer interaction", " information scent", " Internet", " latent semantic analysis", " online anxiety", " online stress"], "paper_abstract": "As competition online increases, website owners investigate ways in which they can attract and retain more users. One avenue is to reduce frustration and stress for the users. Furthermore, many website users are rushed when browsing for specific information on a website. To save time and prevent frustration, website owners should try to maximize information scent, that is, visual, audio, and semantic cues that are meant to lead or guide the user to his or her informational goal. This paper presents and tests a model to predict how information scent can reduce the amount of stress that consumers experience when seeking information under time constraints. The study also demonstrates the relationships between information scent, time constraints, stress, performance, and attitudes toward the website. Results demonstrate that high information scent is an important design goal for a website, and latent semantic analysis can be a useful tool for measuring scent. In addition, rather than an attribute of an overall site, the concept of scent is demonstrated to be dependent on both the website and the task(s) being performed by the user. This finding demonstrates that to maximize users' satisfaction and ability to accomplish their goals, website designers need to determine what tasks users need to accomplish, and to make sure that the links on each page point clearly to the appropriate destination to meet those goals. The latent semantic analysis tool can provide an indication of strength and clarity of the links. Clear links gain even more importance when considering the time constraints of users. Measurable stress explains some of the variance in performance and attitudes.", "paper_title": "Lost in Cyberspace: The Impact of Information Scent and Time Constraints on Stress, Performance, and Attitudes Online", "paper_id": "WOS:000357794600007"}