{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "real_life_scenarios"}, {"score": 0.004655285779819366, "phrase": "conditional_plans"}, {"score": 0.004616199959832044, "phrase": "external_events"}, {"score": 0.0045581828632009795, "phrase": "actual_execution_sequence"}, {"score": 0.004519908617935935, "phrase": "conditional_temporal_problems"}, {"score": 0.004333283735537634, "phrase": "classical_temporal_constraint_models"}, {"score": 0.004084829853870028, "phrase": "key_aspect"}, {"score": 0.0038996120252338556, "phrase": "natural_way"}, {"score": 0.003850566273995209, "phrase": "different_satisfaction_levels"}, {"score": 0.0036450381529042103, "phrase": "fuzzy_preferences"}, {"score": 0.003599182629885611, "phrase": "temporal_constraints"}, {"score": 0.0035389348527719404, "phrase": "fuzzy_thresholds"}, {"score": 0.00257831812581194, "phrase": "temporal_framework"}, {"score": 0.002482126086922683, "phrase": "polynomial_mapping"}, {"score": 0.0023794391656001466, "phrase": "strong_theoretical_connection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["temporal constraints", " uncertainty", " scheduling", " preferences fuzzy reasoning"], "paper_abstract": "In real life scenarios there is often the need for modeling conditional plans where external events determine the actual execution sequence. Conditional temporal problems (CTPs) have addressed such a need by extending the classical temporal constraint models with conditions on the occurrence of some events. Preferences are also a key aspect in many temporal reasoning tasks, since they allow for modeling in a natural way desires and different satisfaction levels. In this paper, we generalize CTPs to CTPPs by adding fuzzy preferences to the temporal constraints and by allowing fuzzy thresholds for the occurrence of some events. This allows us to generalize the conditions: events are allowed to determine not only which variables are executed, but also the preferences associated to their execution time. We consider two consistency notions (that is, strong and weak) and we provide their corresponding testing algorithms. We show that the complexity of these algorithms is not larger than their classical counterparts for CTPs. We also compare CTPPs with STPPUs, another temporal framework with uncertainty and preferences, by providing a polynomial mapping from STPPUs to CTPPs which allows to identify a strong theoretical connection among the two formalisms. Finally, we describe a tool to define CTPPs and to test if they are strongly or weakly consistent. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy conditional temporal problems: Strong and weak consistency", "paper_id": "WOS:000257620400005"}