{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "bioaminergic_receptors"}, {"score": 0.015631380376753615, "phrase": "antipsychotic_drugs"}, {"score": 0.00481495049065317, "phrase": "selective_polypharmacology"}, {"score": 0.004719881293102484, "phrase": "receptor_dynamic_conformational_ensembles"}, {"score": 0.00453531164565523, "phrase": "single_molecular_target"}, {"score": 0.004407892112070471, "phrase": "structure-based_system_biology_approach"}, {"score": 0.0043208252177835815, "phrase": "disease-active_protein_network"}, {"score": 0.0041636475197809825, "phrase": "g-protein-coupled_receptors"}, {"score": 0.004069766428492073, "phrase": "therapeutic_agents"}, {"score": 0.003390799914533271, "phrase": "recent_release"}, {"score": 0.0031393948330209224, "phrase": "structural_and_dynamic_context"}, {"score": 0.0030423786289357846, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003007846011394511, "phrase": "conformational_space"}, {"score": 0.002931569771634119, "phrase": "molecular_probe_mapping"}, {"score": 0.0028490783932465288, "phrase": "generated_probe_maps"}, {"score": 0.0028247853353817044, "phrase": "selected_diverse_conformations"}, {"score": 0.002776817142154944, "phrase": "tanimoto_similarity_coefficient"}, {"score": 0.0026003455833291124, "phrase": "tc-selected_receptor_conformations"}, {"score": 0.002570817338292482, "phrase": "multiple_probe_maps"}, {"score": 0.0025561788724870974, "phrase": "structural_features"}, {"score": 0.0024074058206123793, "phrase": "ligand_selectivity"}, {"score": 0.002373276186210053, "phrase": "available_mutagenesis"}, {"score": 0.002359759876402679, "phrase": "ligand_structure_activity_relationship_studies"}, {"score": 0.0023196699954340437, "phrase": "tc-selected_conformations"}, {"score": 0.0022672718785099666, "phrase": "good_performance"}, {"score": 0.00224151735457093, "phrase": "known_ligands"}, {"score": 0.0022223932033729396, "phrase": "random_decoy"}, {"score": 0.0021291870676682406, "phrase": "multiple_drug_targets"}, {"score": 0.0021049977753042253, "phrase": "oncologic_and_infectious_disorders"}], "paper_keywords": [""], "paper_abstract": "Selective polypharmacology, where a drug acts on multiple rather than a single molecular target involved in a disease, emerges to develop a structure-based system biology approach to design drugs selectively targeting a disease-active protein network. We focus on the bioaminergic receptors that belong to the group of G-protein-coupled receptors (GPCRs) and represent targets for therapeutic agents against schizophrenia and depression. Among them, it has been shown that the serotonin (5-HT2A and 5-HT6) and dopamine (D-2 and D-3) receptors induce a cognition-enhancing effect (group 1), while the histamine (H-1) and serotonin (5-HT2C) receptors lead to metabolic side effects and the 5-HT2B serotonin receptor causes pulmonary hypertension (group 2). Thus, the problem arises to develop an approach that allows identifying drugs targeting only the disease-active receptors, i.e. group 1. The recent release of several crystal structures of the bioaminergic receptors, involving the D-3 and H-1 receptors, provides the possibility to model the structures of all receptors and initiate a study of the structural and dynamic context of selective polypharmacology. In this work, we use molecular dynamics simulations to generate a conformational space of the receptors and subsequently characterize its binding properties applying molecular probe mapping. All-against-all comparison of the generated probe maps of the selected diverse conformations of all receptors with the Tanimoto similarity coefficient (Tc) enable the separation of the receptors of group 1 from group 2. The pharmacophore built based on the Tc-selected receptor conformations, using the multiple probe maps discovers structural features that can be used to design molecules selective toward the receptors of group 1. The importance of several predicted residues to ligand selectivity is supported by the available mutagenesis and ligand structure activity relationship studies. In addition, the Tc-selected conformations of the receptors for group 1 show good performance in isolation of known ligands from a random decoy. Our computational structure-based protocol to tackle selective polypharmacology of antipsychotic drugs could be applied for other diseases involving multiple drug targets, such as oncologic and infectious disorders.", "paper_title": "Addressing Selective Polypharmacology of Antipsychotic Drugs Targeting the Bioaminergic Receptors through Receptor Dynamic Conformational Ensembles", "paper_id": "WOS:000322345400020"}