{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vehicle_capacity"}, {"score": 0.04915098975480121, "phrase": "mro_items"}, {"score": 0.0442509802604871, "phrase": "large_number"}, {"score": 0.03863292188701627, "phrase": "integrated_steel_plant"}, {"score": 0.004469700997700534, "phrase": "third_parties"}, {"score": 0.0044002186469797476, "phrase": "logistical_services"}, {"score": 0.0041328796505374155, "phrase": "small_individual_weights"}, {"score": 0.00385141330111392, "phrase": "vehicle_utilization"}, {"score": 0.0036172962914449796, "phrase": "third-party_transporter"}, {"score": 0.003203294948113915, "phrase": "known_weight"}, {"score": 0.0031658283119347396, "phrase": "mathematical_formulation"}, {"score": 0.0030680392468327147, "phrase": "traditional_subset_sum_problem"}, {"score": 0.0030084563186769764, "phrase": "exchange_algorithm"}, {"score": 0.002892729377519916, "phrase": "proposed_exchange_algorithm"}, {"score": 0.0028588847851995533, "phrase": "lower_time_complexity"}, {"score": 0.0026327757304477665, "phrase": "test_problems"}, {"score": 0.002462867872567125, "phrase": "truck_capacity"}, {"score": 0.0024340403320192807, "phrase": "aforementioned_case"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["capacity utilization", " subset sum problem", " third party logistics", " transportation"], "paper_abstract": "With the pressure to remain competitive, organizations are increasingly depending on third parties for support for logistical services like transportation, particularly for MRO items that involve a large number of items, each with small individual weights and a large number of suppliers. In order to cut costs, it is important to maximize vehicle utilization. In this paper we have addressed a case of an integrated steel plant that engages a third-party transporter for transportation of its MRO supplies. The problem here is to find a subset Of Suppliers so as to maximize the utilization of vehicle capacity which is used for carrying items with known weight. The mathematical formulation of the problem is similar to the traditional Subset sum problem. We propose an exchange algorithm for finding a solution of the problem. The proposed exchange algorithm has a lower time complexity. Further, its quality of solutions is found to be superior to many currently available algorithms, when tested on a number of test problems given in the literature. The algorithm is also applied to maximize the utilization of the truck capacity for the aforementioned case of an integrated steel plant. When used for the data available from the case, the algorithm resulted in a very high level of utilization of the vehicle and thus huge savings in terms of costs. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Maximum utilization of vehicle capacity: A case of MRO items", "paper_id": "WOS:000253363300002"}