{"auto_keywords": [{"score": 0.029809590689935692, "phrase": "pcg"}, {"score": 0.00481495049065317, "phrase": "projective_and_direct_solvers"}, {"score": 0.00461075951152053, "phrase": "civil_and_mechanical_engineering"}, {"score": 0.004531517501420676, "phrase": "complex_structures"}, {"score": 0.004402448972861048, "phrase": "deformation_fields"}, {"score": 0.004377077848734575, "phrase": "structural_parts"}, {"score": 0.00435185229819578, "phrase": "mechanical_bodies"}, {"score": 0.004301834610818624, "phrase": "former_case"}, {"score": 0.004240116703465252, "phrase": "different_types"}, {"score": 0.003910569363955778, "phrase": "fem"}, {"score": 0.003701401653850141, "phrase": "nodal_connections"}, {"score": 0.0035648266669315943, "phrase": "direct_solver"}, {"score": 0.0034832884999421374, "phrase": "numerical_experiments"}, {"score": 0.0033937776228549557, "phrase": "spatial_discretization"}, {"score": 0.0033741997276290356, "phrase": "different_solution_techniques"}, {"score": 0.0033353809745319857, "phrase": "possible_nodal_reordering"}, {"score": 0.0032779858508704364, "phrase": "pcg_pre-conditioner"}, {"score": 0.0032122679403131537, "phrase": "incomplete_cholesky_factorization"}, {"score": 0.0031937337757356526, "phrase": "variable_fill-in"}, {"score": 0.002861160152640875, "phrase": "direct_elimination_methods"}, {"score": 0.0027555028011388033, "phrase": "cheaper_preconditioner"}, {"score": 0.0026924262536607915, "phrase": "main_disadvantage"}, {"score": 0.0026460656993236354, "phrase": "appropriate_degree"}, {"score": 0.002418923027024191, "phrase": "fe_discretization"}, {"score": 0.0024049552650867935, "phrase": "structural_components"}, {"score": 0.002391067964886602, "phrase": "geomechanical_structures"}, {"score": 0.002211235429059514, "phrase": "large_geomechanical_problem"}, {"score": 0.0021794454466797382, "phrase": "direct_solvers"}, {"score": 0.00212336833618933, "phrase": "serial_computers"}], "paper_keywords": ["Krylov", " Preconditioning", " Conjugate gradient", " Reorderings"], "paper_abstract": "The Finite Element Method (FEM) is widely used in civil and mechanical engineering to simulate the behavior of complex structures and, more specifically, to predict stress and deformation fields of structural parts or mechanical bodies. In the former case, the coupling between different types of elements, such as beams, trusses, and shells, is often required, while in the latter fully 3D discretizations are typically used. For both, FEM leads to symmetric positive definite (SPD) matrices that, depending on the type of discretization and especially on the topology of the nodal connections, may be efficiently solved by either the Preconditioned Conjugate Gradient (PCG) or a direct solver such as the routine MA57 of the Harwell Software Library. Numerical experiments are shown and discussed where the effect of spatial discretization, different solution techniques, and a possible nodal reordering, is explored. The PCG pre-conditioner used is a variant of the incomplete Cholesky factorization with variable fill-in. It is shown that for structures with 1D or 2D connections, such as for example a bridge, MA57 performs usually better than PCG. In this case it is noted that some reorderings specifically designed and implemented for direct elimination methods can be very helpful for PCG as well as they yield a cheaper preconditioner and lead to a much faster PCG convergence. The main disadvantage is the need for an appropriate degree of fill-in for the preconditioner which turns out to be problem dependent and must be found empirically. However, in fully 3D problems, arising for example from the FE discretization of structural components or geomechanical structures, PCG outperforms MA57 while also requiring much less memory, and thus allowing for the use of much refined grids, if needed. With the aid of a large geomechanical problem it is shown that direct solvers may not be (even) used on serial computers due to their prohibitive computational cost with PCG the only viable alternative solver. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison of projective and direct solvers for finite elements in elastostatics", "paper_id": "WOS:000266339000016"}