{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sample_size"}, {"score": 0.04896848785083955, "phrase": "significant_frequent_pattern_mining_task"}, {"score": 0.004487541157100498, "phrase": "statistical_significance"}, {"score": 0.00444559516711374, "phrase": "frequent_patterns"}, {"score": 0.0039716833701918365, "phrase": "unknown_underlying_distribution"}, {"score": 0.003807242767474929, "phrase": "frequent_pattern_mining_process"}, {"score": 0.0037363522297378777, "phrase": "false_frequent_pattern"}, {"score": 0.0036667768092524576, "phrase": "true_one"}, {"score": 0.0034332736827447654, "phrase": "dataset_size"}, {"score": 0.0033851984021896287, "phrase": "application-dependent_parameter"}, {"score": 0.0028312983170567948, "phrase": "optimal_size"}, {"score": 0.002765490759189057, "phrase": "good_approximation"}, {"score": 0.002552946390854313, "phrase": "chernoff_bounds"}, {"score": 0.0024818877663889813, "phrase": "independent_control"}, {"score": 0.0023456351719724957, "phrase": "mentioned_drawbacks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Frequent pattern mining", " Lower bound"], "paper_abstract": "During the past few years, the problem of assessing the statistical significance of frequent patterns extracted from a given set S of data has received much attention. Considering that S always consists of a sample drawn from an unknown underlying distribution, two types of risks can arise during a frequent pattern mining process: accepting a false frequent pattern or rejecting a true one. In this context, many approaches presented in the literature assume that the dataset size is an application-dependent parameter. In this case, there is a trade-off between both errors leading to solutions that only control one risk to the detriment of the other one. On the other hand, many sampling-based methods have attempted to determine the optimal size of S ensuring a good approximation of the original (potentially infinite) database from which S is drawn. However, these approaches often resort to Chernoff bounds that do not allow the independent control of the two risks. In this paper. we overcome the mentioned drawbacks by providing a lower bound on the sample size required to control both risks and achieve a significant frequent pattern mining task. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A lower bound on the sample size needed to perform a significant frequent pattern mining task", "paper_id": "WOS:000268165100002"}