{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "six-component_handrim_dynamometer"}, {"score": 0.048880968765446134, "phrase": "manual_wheelchair_locomotion"}, {"score": 0.00437281181878921, "phrase": "wheel_axle"}, {"score": 0.004156590395333602, "phrase": "static_zero_level_calibration"}, {"score": 0.0036614948691735105, "phrase": "angular_position"}, {"score": 0.00351582806482809, "phrase": "dynamic_calibration"}, {"score": 0.0033588449972778004, "phrase": "direct_correction"}, {"score": 0.003308085469148074, "phrase": "sensor_signals"}, {"score": 0.0032746712603464235, "phrase": "fourier's_polynomials"}, {"score": 0.003019189898170698, "phrase": "wheel's_angular_position"}, {"score": 0.0029285940369182277, "phrase": "wheel's_angular_velocity"}, {"score": 0.002700055254682791, "phrase": "hrd"}, {"score": 0.0025146979283050923, "phrase": "calculated_forces"}, {"score": 0.0023066199295447686, "phrase": "wheel_dynamometer"}], "paper_keywords": ["dynamometer", " zero level", " calibration", " wheelchair", " rehabilitation", " biomechanics"], "paper_abstract": "A six-component handrim dynamometer (HRD) is a dynamometer that rotates around the wheel axle during measurements. For this kind of dynamometer, static zero level calibration is insufficient because the proportion of the forces (i.e. handrim weight and centrifugal force) measured by each sensor varies according to the angular position and velocity of the dynamometer. The dynamic calibration presented in this paper is based on the direct correction of the sensor signals using Fourier's polynomials that take into account the influences of both the handrim weight distribution on the sensors with respect to the wheel's angular position and the effect of the wheel's angular velocity. When these corrections were applied to the signals produced by the sensors while the HRD was rotating and no effort was being exerted on the handrim, the calculated forces and torques remained close to zero, as expected. Based on these results, the wheel dynamometer can be confidently used for studying manual wheelchair locomotion under various real conditions. The method could also be applied in other situations in which a dynamometer rotates during measurements.", "paper_title": "Zeroing of six-component handrim dynamometer for biomechanical studies of manual wheelchair locomotion", "paper_id": "WOS:000329199700013"}