{"auto_keywords": [{"score": 0.04385291217970335, "phrase": "paradigm_model"}, {"score": 0.00481495049065317, "phrase": "human-computer_interaction"}, {"score": 0.004430629452265786, "phrase": "different_paradigms"}, {"score": 0.003751228706861377, "phrase": "empirical_study"}, {"score": 0.003509487090932835, "phrase": "online_questionnaire"}, {"score": 0.0033570147767493746, "phrase": "attitude_about_reality'"}, {"score": 0.003123203316511694, "phrase": "educational_background"}, {"score": 0.0030208364972341096, "phrase": "good_predictor"}, {"score": 0.0029709144755382787, "phrase": "self-reported_profession"}, {"score": 0.0026584843838039166, "phrase": "cohesive_element"}, {"score": 0.0025713100093065645, "phrase": "dual_backgrounds"}, {"score": 0.0022129983153880467, "phrase": "hci_community"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["human-computer interaction", " community", " paradigm", " design", " engineering", " science", " attitude about reality"], "paper_abstract": "The cooperation between designers, engineers and scientists in the human-computer interaction (HCI) community is often difficult, and can only be explained by investigating the different paradigms by which they operate. This study proposes a paradigm model for designers, engineers and scientists, using three barriers to separate the professions. We then report on an empirical study that attempted to validate the understand/transform world barrier in the paradigm model using an online questionnaire. We conclude that the used 'Attitude About Reality' scale was unsuitable for measuring this barrier, whereas information about the educational background of the participants was a good predictor for the self-reported profession (designer, engineer or scientist). Interestingly, among the three professions, engineers appear to be the cohesive element, since they often have dual backgrounds, whereas very few participants had dual science/design backgrounds. Engineers could, therefore, build a bridge between designers and scientists, and through their integrative role, could guide the HCI community to realizing its full potential. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "HCI reality - an 'unreal tournament'?", "paper_id": "WOS:000247427900004"}