{"auto_keywords": [{"score": 0.04866188206860211, "phrase": "leach"}, {"score": 0.008235415757069436, "phrase": "secure_leach_schemes"}, {"score": 0.00481495049065317, "phrase": "secure_leach-based_clustering_protocols"}, {"score": 0.004625881588444304, "phrase": "low-energy_adaptive_clustering_hierarchy"}, {"score": 0.004556901872357751, "phrase": "successful_clustering-based_routing_protocol"}, {"score": 0.003785836059995376, "phrase": "main_problems"}, {"score": 0.00347657813672945, "phrase": "leach_protocol"}, {"score": 0.0033735490732324713, "phrase": "secure_versions"}, {"score": 0.0028877818105020434, "phrase": "leach_schemes"}, {"score": 0.0027327327233891865, "phrase": "security_features"}, {"score": 0.0024842242921857705, "phrase": "cryptographic-based_and_trust-based_solutions"}, {"score": 0.0023040642263522505, "phrase": "qualitative_comparison"}, {"score": 0.0021693692831601745, "phrase": "open_research_issues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Trust", " Reputation", " Security", " Attacks", " Cluster head", " Cryptography", " Confidentiality", " Malicious nodes"], "paper_abstract": "LEACH or Low-Energy Adaptive Clustering Hierarchy is a successful clustering-based routing protocol that recently has attracted a lot of attention in literature. However, this protocol is not prefect and has some deficiencies that other extensions of LEACH try to solve it. Security is one of the main problems of LEACH and many security attacks can be launched against this protocol. The need for security in LEACH protocol has inspired many researchers to design secure versions of this protocol and to make it resilient against insider and outsider attackers. In this paper, we discuss about the current state-of-the-art secure LEACH schemes that are proposed in literature. We briefly describe the security features of each solution and highlight their objectives, advantages and limitations. In addition, we classify secure LEACH schemes into cryptographic-based and trust-based solutions and review the major development in these two categories. Then, we present a qualitative comparison on secure LEACH schemes based on various security metrics. Finally, we conclude with open research issues. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of Secure LEACH-Based Clustering Protocols in Wireless Sensor Networks", "paper_id": "WOS:000320750600014"}