{"auto_keywords": [{"score": 0.0308162514646343, "phrase": "chain_a"}, {"score": 0.030368644421535716, "phrase": "chain_b"}, {"score": 0.00481495049065317, "phrase": "barrier-to-autointegration_factor_dimer"}, {"score": 0.004707672504464783, "phrase": "lem_domain"}, {"score": 0.004350594827104932, "phrase": "nonspecific_fragment"}, {"score": 0.004318027255281003, "phrase": "double-strand_dna_molecule"}, {"score": 0.004174451361776433, "phrase": "zdock_program"}, {"score": 0.0038576618286586387, "phrase": "detailed_effect"}, {"score": 0.0034203874753429113, "phrase": "molecular_dynamics"}, {"score": 0.0032085525502105836, "phrase": "trajectory_fluctuations"}, {"score": 0.0031845067058084613, "phrase": "mt_complex"}, {"score": 0.0030901063954739375, "phrase": "wt_complex"}, {"score": 0.003032528228056611, "phrase": "binding_free_energy_analysis"}, {"score": 0.002987236799291296, "phrase": "electronegative_residues"}, {"score": 0.002719055901632759, "phrase": "stable_pi-pi_stack"}, {"score": 0.0022696277881969896, "phrase": "strong_interaction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Barrier-to-autointegration factor dimer (BAF2)", " Molecular dynamics", " Emerin", " LEM domain", " Point mutation"], "paper_abstract": "The interaction between barrier-to-autointegration factor dimer (BAF2) and LEM domain of emerin (Em(LEM)) was studied by molecular simulation methods. Nonspecific fragment of double-strand DNA molecule was docked with each chain of BAF2 by ZDOCK program. The model of DNA2:BAF2:Em(LEM) was thus constructed. The mutant Gly25Glu of BAF2 was manually constructed to explore the detailed effect of the mutation on the binding of BAF2 and Em(LEM). It has been experimentally suggested that point mutation Gly25Glu can disturb the binding between BAF2 and Em(LEM). Then, molecular dynamics (MD) simulations were performed on DNA2:BAF2(WT):Em(LEM) and DNA2:BAF2(MT):Em(LEM) complexes. 30 ns trajectories revealed that the trajectory fluctuations of MT complex are more violent than that of the WT complex. Further, the binding free energy analysis showed that the electronegative residues Asp57, Glu61 and Asp65 from chain A, glu36 from chain B of BAF2 mainly contribute to interact with Em(LEM). Besides, a stable pi-pi stack between trp62 and phe39 from BAF2(WT) chain B is destroyed by Glu25 in BAF2(MT). As a result, trp62 forms an interaction with glu25, and phe39 converts to strengthen affinity to Em(LEM). On the other hand, Trp62 from chain A also forms a strong interaction with MT Glu25. Thus, with the docking of DNA, BAF2(MT) has higher affinity with Em(LEM) than BAF2(WT). (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Molecular simulation investigation on the interaction between barrier-to-autointegration factor dimer or its Gly25Glu mutant and LEM domain of emerin", "paper_id": "WOS:000347580700002"}