{"auto_keywords": [{"score": 0.04969528428867482, "phrase": "clinical_research"}, {"score": 0.04118498548932337, "phrase": "handheld_computer"}, {"score": 0.014788809785766785, "phrase": "electronic_data_collection"}, {"score": 0.012018544049523535, "phrase": "data_entry_process"}, {"score": 0.00481495049065317, "phrase": "handheld_vs."}, {"score": 0.004802052800653483, "phrase": "laptop_computers_for_electronic_data_collection"}, {"score": 0.004738078275822989, "phrase": "crossover_randomized_trial"}, {"score": 0.004662427600500598, "phrase": "users'_speed"}, {"score": 0.004612662942073808, "phrase": "entry_errors"}, {"score": 0.0043482604833437735, "phrase": "randomized_cross"}, {"score": 0.004077005481951783, "phrase": "equally_balanced_sequence"}, {"score": 0.003751431514258335, "phrase": "sealed_and_opaque_envelopes"}, {"score": 0.0036324746826127997, "phrase": "quiet_environment"}, {"score": 0.003526735797659508, "phrase": "data_recording_process"}, {"score": 0.0034610501297253895, "phrase": "users'_satisfaction"}, {"score": 0.0032888418378433037, "phrase": "original_paper-based_questionnaire"}, {"score": 0.0032016639006812826, "phrase": "overall_duration"}, {"score": 0.003175962507754933, "phrase": "recording_process"}, {"score": 0.0030423222504103752, "phrase": "laptop_computer"}, {"score": 0.002985631781749091, "phrase": "data_accuracy"}, {"score": 0.0027322430861658527, "phrase": "missing_data"}, {"score": 0.002460295872115956, "phrase": "increasing_use"}, {"score": 0.002447101794397243, "phrase": "handheld_computers"}, {"score": 0.0022757392673269624, "phrase": "typing_errors_and_missing_data"}, {"score": 0.0022393151471501137, "phrase": "particularly_crucial_issue"}, {"score": 0.002174041708084857, "phrase": "healthcare_workers"}, {"score": 0.0021507795710951384, "phrase": "computer_technologies"}, {"score": 0.0021049977753042253, "phrase": "data_collection_processes"}], "paper_keywords": [""], "paper_abstract": "Objective: To compare users' speed, number of entry errors and satisfaction in using two current devices for electronic data collection in clinical research: handheld and laptop computers. Design: The authors performed a randomized cross-over trial using 160 different paper-based questionnaires and representing altogether 45,440 variables. Four data coders were instructed to record, according to a random predefined and equally balanced sequence, the content of these questionnaires either on a laptop or on a handheld computer. Instructions on the kind of device to be used were provided to data-coders in individual sealed and opaque envelopes. Study conditions were controlled and the data entry process performed in a quiet environment. Measurements: The authors compared the duration of the data recording process, the number of errors and users' satisfaction with the two devices. The authors divided errors into two separate categories, typing and missing data errors. The original paper-based questionnaire was used as a gold-standard. Results: The overall duration of the recording process was significantly reduced (2.0 versus 3.3 min) when data were recorded on the laptop computer (p < 0.001). Data accuracy also improved. There were 5.8 typing errors per 1,000 entries with the laptop compared to 8.4 per 1,000 with the handheld computer (p < 0.001). The difference was even more important for missing data which decreased from 22.8 to 2.9 per 1,000 entries when a laptop was used (p < 0.001.). Users found the laptop easier, faster and more satisfying to use than the handheld computer. Conclusions: Despite the increasing use of handheld computers for electronic data collection in clinical research, these devices should be used with caution. They double the duration of the data entry process and significantly increase the risk of typing errors and missing data. This may become a particularly crucial issue in Studies where these devices are provided to patients or healthcare workers, unfamiliar with Computer Technologies, for self-reporting or research data collection processes.", "paper_title": "Handheld vs. Laptop Computers for Electronic Data Collection in Clinical Research: A Crossover Randomized Trial", "paper_id": "WOS:000269755500007"}