{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "supervisory_control"}, {"score": 0.023227301113361, "phrase": "control_systems"}, {"score": 0.008239932072014266, "phrase": "c_systems"}, {"score": 0.006260597652148879, "phrase": "ac_systems"}, {"score": 0.006181641559570122, "phrase": "grammar_control_systems"}, {"score": 0.004734080441265399, "phrase": "grammars"}, {"score": 0.003945266418163835, "phrase": "designated_control_mechanisms"}, {"score": 0.0033865859510157238, "phrase": "c_system"}, {"score": 0.002857849698346116, "phrase": "automaton_control_systems"}, {"score": 0.002526780881314497, "phrase": "generative_power"}, {"score": 0.0021049977753042253, "phrase": "open_questions"}], "paper_keywords": ["control systems", " automata", " grammars", " supervisory control", " regulated rewriting", " discrete event systems"], "paper_abstract": "This work is primarily inspired by the observation that supervisory control and regulated rewriting have the same nature. Indeed, both of them model a system using some formalism and use a certain formalized control structure to restrict the behavior of the system via some designated control mechanisms. In this paper, we propose the theory of Control Systems (C Systems), which provides a more generic framework to integrate the automaton and grammar representations of control in supervisory control and regulated rewriting. The C system contains two components: the controlled component and the controlling component. The two components are expressed using the same formalism, e.g. automata or grammars. More specifically, we define three types of control systems based on the automaton or grammar representation, namely Automaton Control Systems (AC Systems), Grammar Control Systems (GC Systems) and Leftmost-derivation-based Grammar Control Systems (LGC Systems). We formally study their key theoretical characterizations, such as generative power, equivalence and translation techniques, as well as their connections with supervisory control and regulated rewriting, including the relationships between AC systems and supervisory control, and between GC/LGC systems and regulated rewriting. We also discuss some applications of C systems and finally propose some open questions.", "paper_title": "Control Systems on Automata and Grammars", "paper_id": "WOS:000350219300005"}