{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "space_time_cube_representation"}, {"score": 0.007621584595158814, "phrase": "complex_spatiotemporal_patterns"}, {"score": 0.0049956124261964965, "phrase": "error_rates"}, {"score": 0.0046269981365987915, "phrase": "information_visualization_technique"}, {"score": 0.004581162468419365, "phrase": "spatiotemporal_data_points"}, {"score": 0.004424268136268051, "phrase": "information_visualization_researchers"}, {"score": 0.003829290275367182, "phrase": "spatial_information"}, {"score": 0.0034660938095219846, "phrase": "actual_usefulness"}, {"score": 0.0030906666356950887, "phrase": "between-subjects_experiment"}, {"score": 0.0030600032877646263, "phrase": "novice_users'_error_rates"}, {"score": 0.002797329638474873, "phrase": "simple_questions"}, {"score": 0.0026745503978347143, "phrase": "baseline_representation"}, {"score": 0.002634830238219976, "phrase": "complex_questions"}, {"score": 0.0025571463140118805, "phrase": "overall_understanding"}, {"score": 0.0025191653363555193, "phrase": "spatiotemporal_structure"}, {"score": 0.002158179521369965, "phrase": "empirical_foundation"}, {"score": 0.0021049977753042253, "phrase": "space_time_cube_representation_benefits_users"}], "paper_keywords": ["Information visualization", " evaluation/methodology", " space time cube"], "paper_abstract": "Space time cube representation is an information visualization technique where spatiotemporal data points are mapped into a cube. Information visualization researchers have previously argued that space time cube representation is beneficial in revealing complex spatiotemporal patterns in a data set to users. The argument is based on the fact that both time and spatial information are displayed simultaneously to users, an effect difficult to achieve in other representations. However, to our knowledge the actual usefulness of space time cube representation in conveying complex spatiotemporal patterns to users has not been empirically validated. To fill this gap, we report on a between-subjects experiment comparing novice users' error rates and response times when answering a set of questions using either space time cube or a baseline 2D representation. For some simple questions, the error rates were lower when using the baseline representation. For complex questions where the participants needed an overall understanding of the spatiotemporal structure of the data set, the space time cube representation resulted in on average twice as fast response times with no difference in error rates compared to the baseline. These results provide an empirical foundation for the hypothesis that space time cube representation benefits users analyzing complex spatiotemporal patterns.", "paper_title": "An Evaluation of Space Time Cube Representation of Spatiotemporal Patterns", "paper_id": "WOS:000265828400015"}