{"auto_keywords": [{"score": 0.044935050925839014, "phrase": "symmetric_concepts"}, {"score": 0.00481495049065317, "phrase": "structural_self-bisimilarity"}, {"score": 0.004353831792593701, "phrase": "automated_computational_method"}, {"score": 0.004174929128880472, "phrase": "linguistic_structure"}, {"score": 0.004122699822340296, "phrase": "concept_names"}, {"score": 0.00396988421137599, "phrase": "concept_b"}, {"score": 0.003887438245620965, "phrase": "concept_a"}, {"score": 0.0038227112550093863, "phrase": "single_modifier"}, {"score": 0.003589404014552974, "phrase": "possible_local_structural_types"}, {"score": 0.003559387846675818, "phrase": "symmetric_concept_pairs"}, {"score": 0.0028251537271620996, "phrase": "potential_errors"}, {"score": 0.0027548146060608902, "phrase": "manual_evaluation"}, {"score": 0.0027317585060414253, "phrase": "fma_domain_experts"}, {"score": 0.002500987934534128, "phrase": "latest_version"}, {"score": 0.0024800516625994883, "phrase": "fma."}, {"score": 0.0023980368333253147, "phrase": "valuable_method"}, {"score": 0.0023779596230982234, "phrase": "ontology_quality_assurance"}, {"score": 0.0023284972218506157, "phrase": "missing_concepts"}, {"score": 0.002309000874224222, "phrase": "misaligned_concepts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ontology", " FMA", " Auditing", " Bisimilarity", " Symmetric concepts"], "paper_abstract": "As ontologies are mostly manually created, they tend to contain errors and inconsistencies. In this paper, we present an automated computational method to audit symmetric concepts in ontologies by leveraging self-bisimilarity and linguistic structure in the concept names. Two concepts A and B are symmetric if concept B can be obtained from concept A by replacing a single modifier such as \"left\" with its symmetric modifier such as \"right.\" All possible local structural types for symmetric concept pairs are enumerated according to their local subsumption hierarchy, and the pairs are further classified into Non-Matches and Matches. To test the feasibility and validate the benefits of this method, we computed all the symmetric modifier pairs in the Foundational Model of Anatomy (FMA) and selected six of them for experimentation. 9893 Non-Matches and 221 abnormal Matches with potential errors were discovered by our algorithm. Manual evaluation by FMA domain experts on 176 selected Non-Matches and all the 221 abnormal Matches found 102 missing concepts and 40 misaligned concepts. Corrections for them have currently been implemented in the latest version of FMA. Our result demonstrates that self-bisimilarity can be a valuable method for ontology quality assurance, particularly in uncovering missing concepts and misaligned concepts. Our approach is computationally scalable and can be applied to other ontologies that are rich in symmetric concepts. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "An analysis of FMA using structural self-bisimilarity", "paper_id": "WOS:000319719500011"}