{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "universal-algebraic_approach"}, {"score": 0.047913915004548654, "phrase": "computational_complexity"}, {"score": 0.03235427586892729, "phrase": "existential_positive_closure"}, {"score": 0.004683195250422422, "phrase": "powerful_tool"}, {"score": 0.004569095351567258, "phrase": "constraint_satisfaction_problems"}, {"score": 0.004139712771605295, "phrase": "finite_or_omega-categorical_structures"}, {"score": 0.0038922387719873865, "phrase": "u."}, {"score": 0.0038206161632040672, "phrase": "finite_or_omega-categorical_structure"}, {"score": 0.003750529559133893, "phrase": "core_structure"}, {"score": 0.0036030386046805598, "phrase": "infinite_structures"}, {"score": 0.0030972277169783067, "phrase": "infinitary_polymorphisms"}, {"score": 0.0030123335878664064, "phrase": "known_results"}, {"score": 0.0029570303644956128, "phrase": "new_notions"}, {"score": 0.002938821840519756, "phrase": "core_theories"}, {"score": 0.002814454488050123, "phrase": "model_companions"}, {"score": 0.002797121441432477, "phrase": "model_theory"}, {"score": 0.002720430692494596, "phrase": "core_companions"}, {"score": 0.0026704721397631938, "phrase": "model-complete_cores"}, {"score": 0.002654023460098497, "phrase": "omega-categorical_structures"}, {"score": 0.0026052812376885504, "phrase": "crucial_concept"}, {"score": 0.0025732834751685803, "phrase": "exact_characterization"}, {"score": 0.002316656229510391, "phrase": "general_hardness_criteria"}, {"score": 0.0022048882869630114, "phrase": "polymorphism-based_description"}, {"score": 0.0021049977753042253, "phrase": "polynomial_time"}], "paper_keywords": ["Constraint satisfaction", " Model theory", " Universal-algebraic approach"], "paper_abstract": "The universal-algebraic approach has proved a powerful tool in the study of the computational complexity of constraint satisfaction problems (CSPs). This approach has previously been applied to the study of CSPs with finite or (infinite) omega-categorical templates, and relies on two facts. The first is that in finite or omega-categorical structures U, a relation is primitive positive definable if and only if it is preserved by the polymorphisms of U. The second is that every finite or omega-categorical structure is homomorphically equivalent to a core structure. In this paper, we present generalizations of these facts to infinite structures that are not necessarily omega-categorical. Specifically, we prove that every CSP can be formulated with a template U such that a relation is primitive positive definable in U if and only if it is first-order definable in U and preserved by the infinitary polymorphisms of U. Using existential positive closure we rederive and extend known results about cores, presenting the new notions of core theories (models of which will be cores);and core companions (which are defined analogously to model companions in model theory). We prove a uniqueness result for core companions that yields the uniqueness of model-complete cores of omega-categorical structures. Existential positive closure is also the crucial concept to give an exact characterization of those CSPs that can be formulated with (a finite or) an omega-categorical template. Finally, we present applications of our general results to the description and analysis of the computational complexity of CSPs. In particular, we give general hardness criteria based on the absence of polymorphisms that depend on more than one argument, and we present a polymorphism-based description of those CSPs that are first-order definable (and therefore can be solved in polynomial time).", "paper_title": "ON THE SCOPE OF THE UNIVERSAL-ALGEBRAIC APPROACH TO CONSTRAINT SATISFACTION", "paper_id": "WOS:000309447200013"}