{"auto_keywords": [{"score": 0.04843603269514023, "phrase": "recommendation_systems"}, {"score": 0.022876230545430875, "phrase": "data_sparsity"}, {"score": 0.010612387000973441, "phrase": "user_and_item_information"}, {"score": 0.010329731180063374, "phrase": "side_information"}, {"score": 0.007019086950809235, "phrase": "higher_quality_recommendations"}, {"score": 0.004525190364108967, "phrase": "ranked_lists"}, {"score": 0.0042035670399069485, "phrase": "item-based_collaborative_filtering_methods"}, {"score": 0.003981243132108882, "phrase": "rapid_growth"}, {"score": 0.003844545552246988, "phrase": "great_challenges"}, {"score": 0.0036695284042874395, "phrase": "available_online_information"}, {"score": 0.003516079377293321, "phrase": "high_quality_recommendations"}, {"score": 0.0033690254452595865, "phrase": "high_coverage"}, {"score": 0.003010063382882408, "phrase": "novel_method"}, {"score": 0.002940697344380201, "phrase": "different_users"}, {"score": 0.002850682396853918, "phrase": "user-item_rating_information"}, {"score": 0.002752695791351096, "phrase": "special_interests"}, {"score": 0.0024784363584530976, "phrase": "fuir"}, {"score": 0.0023471384232499016, "phrase": "recommendation_results"}, {"score": 0.0023289568500915207, "phrase": "target_users"}, {"score": 0.002248863090203165, "phrase": "experimental_results"}, {"score": 0.002188472974132732, "phrase": "sparse_rating_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recommendations system", " Collaborative filtering", " Sparse rating data"], "paper_abstract": "Recommendation systems adopt various techniques to recommend ranked lists of items to help users in identifying items that fit their personal tastes best. Among various recommendation algorithms, user and item-based collaborative filtering methods have been very successful in both industry and academia. More recently, the rapid growth of the Internet and E-commerce applications results in great challenges for recommendation systems as the number of users and the amount of available online information have been growing too fast. These challenges include performing high quality recommendations per second for millions of users and items, achieving high coverage under the circumstance of data sparsity and increasing the scalability of recommendation systems. To obtain higher quality recommendations under the circumstance of data sparsity, in this paper, we propose a novel method to compute the similarity of different users based on the side information which is beyond user-item rating information from various online recommendation and review sites. Furthermore, we take the special interests of users into consideration and combine three types of information (users, items, user-items) to predict the ratings of items. Then FUIR, a novel recommendation algorithm which fuses user and item information, is proposed to generate recommendation results for target users. We evaluate our proposed FUIR algorithm on three data sets and the experimental results demonstrate that our FUIR algorithm is effective against sparse rating data and can produce higher quality recommendations. (C) 2016 Elsevier Ltd. All rights reserved.", "paper_title": "FUIR: Fusing user and item information to deal with data sparsity by using side information in recommendation systems", "paper_id": "WOS:000378667000003"}