{"auto_keywords": [{"score": 0.029420333683948783, "phrase": "singular_cases"}, {"score": 0.026756161636025125, "phrase": "real_part"}, {"score": 0.00481495049065317, "phrase": "exact_and_efficient_algorithm"}, {"score": 0.00476323161560059, "phrase": "proper_parametric_representation"}, {"score": 0.004674050471183959, "phrase": "three-dimensional_real_space"}, {"score": 0.004598933498016774, "phrase": "rational_coefficients"}, {"score": 0.004561826854638056, "phrase": "output_functions"}, {"score": 0.00450064357719659, "phrase": "projective_space"}, {"score": 0.00427550604912774, "phrase": "smooth_quartic"}, {"score": 0.003889731893761571, "phrase": "distinct_square_roots"}, {"score": 0.00374531366198605, "phrase": "small_number"}, {"score": 0.003725123268391067, "phrase": "well-identified_cases"}, {"score": 0.003665200409053223, "phrase": "extra_square_root"}, {"score": 0.003519561814102764, "phrase": "lazard_et_al"}, {"score": 0.0034723086467062804, "phrase": "pefiaranda"}, {"score": 0.003453584878128719, "phrase": "l.m."}, {"score": 0.0034349627476861393, "phrase": "petitjean"}, {"score": 0.0032629585038738856, "phrase": "computational_geometry"}, {"score": 0.0028119555769208484, "phrase": "parts_ii"}, {"score": 0.002714779217561487, "phrase": "first_classification"}, {"score": 0.002656650588033728, "phrase": "real_type"}, {"score": 0.0023712394008737958, "phrase": "optimal_parameterizations"}, {"score": 0.0021627595586364724, "phrase": "square_roots"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["intersection of surfaces quadrics", " pencils of quadrics", " curve parameterization"], "paper_abstract": "We present an exact and efficient algorithm for computing a proper parametric representation of the intersection of two quadrics in three-dimensional real space given by implicit equations with rational coefficients. The output functions parameterizing the intersection in projective space are polynomial, whenever it is possible, which is the case when the intersection is not a smooth quartic (for example, a singular quartic, a cubic and a line, and two conics). Furthermore, the parameterization is near-optimal in the sense that the number of distinct square roots appearing in the coefficients of these functions is minimal, except in a small number of well-identified cases where there may be an extra square root. In addition, the algorithm is practical: a complete and efficient C++ implementation is described in Lazard et al. [Lazard, S., Pefiaranda, L.M., Petitjean, S., 2006. Intersecting quadrics: An efficient and exact implementation. In: 20th ACM Symposium on Computational Geometry, 2004. Computational Geometry: Theory and Applications 35 (1-2), 74-99 (special issue)]. In Part 1, we present an algorithm for computing a parameterization of the intersection of two arbitrary quadrics which we prove to be near-optimal in the generic, smooth quartic, case. Parts II and III treat the singular cases. We present in Part 11 the first classification of pencils of quadrics according to the real type of the intersection and we show how this classification can be used to efficiently determine the type of the real part of the intersection of two arbitrary quadrics. This classification is at the core of the design of our algorithms for computing near-optimal parameterizations of the real part of the intersection in all singular cases. We present these algorithms in Part III and give examples covering all the possible situations in terms of both the real type of intersection and the number and depth of square roots appearing in the coefficients. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Near-optimal parameterization of the intersection of quadrics: I. The generic algorithm", "paper_id": "WOS:000254366500002"}