{"auto_keywords": [{"score": 0.04450903326587539, "phrase": "data_sharing"}, {"score": 0.01030313449432444, "phrase": "successful_data_sharing"}, {"score": 0.00481495049065317, "phrase": "property_rights"}, {"score": 0.004765788394931875, "phrase": "shared_scientific_data"}, {"score": 0.004621279527317074, "phrase": "formal_intellectual_property_law"}, {"score": 0.0036490529923833884, "phrase": "common_property_theory"}, {"score": 0.0027505037762786087, "phrase": "environmental_sciences"}, {"score": 0.0027223626424366207, "phrase": "micrometeorology_community"}, {"score": 0.00248167018931442, "phrase": "irresolvable_disputes"}, {"score": 0.002393907896783117, "phrase": "successfully_managed_natural_resource_commons"}, {"score": 0.002262209824105154, "phrase": "biophysical_scientists"}, {"score": 0.002193447487477984, "phrase": "social_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Common pool resources", " Common property", " Commons", " Data sharing", " Design principles", " FLUXNET", " Intellectual property", " Remote sensing"], "paper_abstract": "Property rights of shared scientific data are often analyzed by applying formal intellectual property law. However, the scales at which these laws apply are not necessarily relevant to data sharing practice among individuals (e.g., in virtual, social communities). Rather, the data sharing communities and their members often form their own policies, practices and norms governing data sharing. Using common property theory, our research objectives were to determine: (1) parallels between data sharing communities and natural resource-sharing communities: (2) factors that lead to successful data sharing; (3) circumstances under which rules, laws and policies govern data sharing. We used cases from two emerging data sharing communities in the environmental sciences a micrometeorology community (FLUXNET) and a satellite remote sensing community. Cases of data sharing without conflict or irresolvable disputes had more principles in common with a successfully managed natural resource commons than did those characterized by conflict. Successful data sharing requires that biophysical scientists be more attentive to the social nature of data sharing. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Governing the data commons: Policy, practice, and the advancement of science", "paper_id": "WOS:000279034900005"}