{"auto_keywords": [{"score": 0.049529099900281724, "phrase": "concept_lattices"}, {"score": 0.003955926499405168, "phrase": "image_content"}, {"score": 0.0035648266669315943, "phrase": "different_search_context"}, {"score": 0.0034832884999421374, "phrase": "image_shape"}, {"score": 0.0032496585171039797, "phrase": "semantic_content"}, {"score": 0.0031026497891826726, "phrase": "metadata_ontology"}, {"score": 0.003049247243348174, "phrase": "test_collection"}, {"score": 0.0027475383418803724, "phrase": "image-sleuth_program"}, {"score": 0.0026846436189970446, "phrase": "usability_testing"}, {"score": 0.0022696277881969896, "phrase": "image_navigation"}, {"score": 0.0022305310659333864, "phrase": "concept_lattice"}, {"score": 0.0021921063460682293, "phrase": "highly_successful_interface_paradigm"}, {"score": 0.002129527338875116, "phrase": "general_insights"}, {"score": 0.0021049977753042253, "phrase": "interface_design"}], "paper_keywords": ["concept lattices", " image navigation", " MPEG-7", " user interface", " semantic browsing"], "paper_abstract": "This paper presents the evaluation of a design and architecture for browsing and searching MPEG-7 images. Our approach is novel in that it exploits concept lattices for the representation and navigation of image content. Several concept lattices provide the foundation for the system (called IMAGE-SLEUTH) each representing a different search context, one for image shape, another for color and luminance, and a third for semantic content, namely image browsing based on a metadata ontology. The test collection used for our study is a sub-set of MPEG-7 images created from the popular The Sims 2 (TM) game. The evaluation of the IMAGE-SLEUTH program is based on usability testing among 29 subjects. The results of the study are used to build an improved second generation program - IMAGE-SLEUTH2 - however these results also indicate that image navigation via a concept lattice is a highly successful interface paradigm. Our results provide general insights for interface design using concept lattices that will be of interest to any applied research and development using concept lattices.", "paper_title": "An intelligent user interface for browsing and searching MPEG-7 images using concept lattices", "paper_id": "WOS:000255611400007"}