{"auto_keywords": [{"score": 0.040108824253493075, "phrase": "successive_decoding"}, {"score": 0.00481495049065317, "phrase": "capacity_region"}, {"score": 0.004762202897268383, "phrase": "asynchronous_memoryless_multiple-access_channels"}, {"score": 0.0045820747375409435, "phrase": "memoryless_multiple-access_channels"}, {"score": 0.00373682045166829, "phrase": "dominant_face"}, {"score": 0.0028993944292191433, "phrase": "aforementioned_polytopes"}, {"score": 0.002851790448644913, "phrase": "group_composition"}, {"score": 0.0027741761880779535, "phrase": "decoding_order"}, {"score": 0.002363806685815014, "phrase": "structural_properties"}, {"score": 0.002261666793030715, "phrase": "corresponding_face"}], "paper_keywords": ["Capacity region", " dominant face", " face", " group successive decoding", " multiple-access channel (MAC)", " polymatroid", " polytope"], "paper_abstract": "The asynchronous capacity region of memoryless multiple-access channels is the union of certain polytopes. It is well known that vertices of such polytopes may be approached via a technique called successive decoding. It is also known that an extension of successive decoding applies to the dominant face of such polytopes. The extension consists of forming groups of users in such a way that users within a group are decoded jointly whereas groups are decoded successively. This paper goes one step further. It is shown that successive decoding extends to every face of the aforementioned polytopes. The group composition as well as the decoding order for all rates on a face of interest is obtained from a label assigned to that face. From the label, one can extract a number of structural properties, such as the dimension of the corresponding face and whether or not two faces intersect. Expressions for the number of faces of any given dimension are also derived from the labels.", "paper_title": "On the Structure of the Capacity Region of Asynchronous Memoryless Multiple-Access Channels", "paper_id": "WOS:000305575000020"}