{"auto_keywords": [{"score": 0.04959522198262252, "phrase": "pollutant_dispersion"}, {"score": 0.015719716506582538, "phrase": "meteorological_data"}, {"score": 0.004576491793324233, "phrase": "environmental_analysis"}, {"score": 0.004262273304740847, "phrase": "long-time_periods"}, {"score": 0.004162382992340309, "phrase": "statistical_data"}, {"score": 0.0040373708328770306, "phrase": "long_period"}, {"score": 0.00388964573736626, "phrase": "classical_approach"}, {"score": 0.0036224139706218916, "phrase": "environmental_test_reference_year"}, {"score": 0.0035615322947497013, "phrase": "i.e._a_set"}, {"score": 0.0034662353953537773, "phrase": "hourly_series"}, {"score": 0.002975652654536407, "phrase": "huge_amount"}, {"score": 0.0029355502535757696, "phrase": "processing_time"}, {"score": 0.0025113537085968652, "phrase": "try"}, {"score": 0.0024607296642187824, "phrase": "long-term_data"}, {"score": 0.002427549902743566, "phrase": "good_agreement"}, {"score": 0.002370555661688829, "phrase": "multi-year_simulation"}, {"score": 0.0022992346264367374, "phrase": "long-term_approach"}], "paper_keywords": ["Test Reference Year (TRY)", " Air dispersion", " Pollution", " Diffusion", " Environmental analysis", " Meteorological data"], "paper_abstract": "The use of meteorological data is essential for environmental analysis of the diffusion of pollutants in the atmosphere and it is very important to have data that are relevant over long-time periods. Normally, a set of statistical data is used to describe the conditions over a long period of time. In this paper we show that the classical approach is not adequate for modelling pollutant dispersion in the atmosphere. In addition, we explore the possibility of using an environmental Test Reference Year (TRY), i.e. a set of real, contemporaneous and hourly meteorological variables \"extracted\" from an hourly series of at least 10 years. We compare the results of simulations with three different data sets: - the multi-year data set: the hourly data set of 10 years (in this case the simulation can be considered a 'brute force' approach, since it requires a huge amount of data and processing time), - the long-term data set: the statistical set derived from the full 10-year data set (in this case the simulation is that usually done by analysts), - the TRY data set, which can be regarded as an innovative procedure. It is demonstrated that the results obtained using the TRY are much better than the long-term data, and show good agreement with the results obtained with the multi-year simulation of the 10-year data. In addition, the long-term approach (described above as 'usual') turns out to be unreliable and not adequate to correctly predict pollutant dispersion in the atmosphere, despite its frequent use worldwide. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Using meteorological data to model pollutant dispersion in the atmosphere", "paper_id": "WOS:000260992800011"}