{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_method"}, {"score": 0.04973325992892519, "phrase": "information_acquisition"}, {"score": 0.04268563153769319, "phrase": "verbal_reports"}, {"score": 0.004350308086118336, "phrase": "empirical_case_study"}, {"score": 0.004256703909255889, "phrase": "vehicle_operators"}, {"score": 0.004016782710006123, "phrase": "video_data"}, {"score": 0.003916098498242888, "phrase": "exactly_the_same_driving_task"}, {"score": 0.0034995881411519925, "phrase": "driving_task"}, {"score": 0.003461702544605219, "phrase": "driver_environment"}, {"score": 0.003424225677958491, "phrase": "empirical_study"}, {"score": 0.003350480663660326, "phrase": "high-speed_ferry"}, {"score": 0.0029722900280316216, "phrase": "'buggy_mental_models"}, {"score": 0.002665555782056494, "phrase": "empirical_exploration"}, {"score": 0.002579847272930948, "phrase": "collegial_verbalisation"}, {"score": 0.0025518930446603335, "phrase": "combinatorial_advantages"}, {"score": 0.0024788167298469455, "phrase": "analytical_tool"}, {"score": 0.0024519545383399773, "phrase": "traditional_forms"}, {"score": 0.0023644936731468252, "phrase": "work_tasks"}, {"score": 0.0023051296931856265, "phrase": "operators'_behaviours"}, {"score": 0.0021049977753042253, "phrase": "experimental_design"}], "paper_keywords": ["verbal protocols", " verbalisation techniques", " information acquisition", " driver environments", " bridge design", " human computer interaction"], "paper_abstract": "The purpose of this paper is to propose and discuss a new method for information acquisition called collegial verbalisation. The method is explored in an empirical case study, and it consists of vehicle operators being videotaped while driving, followed by some of their colleagues making verbal reports while watching the video data. These colleagues have previously experienced exactly the same driving task as the operators, that is, they have travelled the same route, with the same craft, and used the same instrumentation. Thus, they are very familiar with the driving task and the driver environment. The empirical study is carried out on a high-speed ferry. The method is explored in relation to three rather open hypotheses: the amount of information provided in general; the reliability of the data; and how it contributes to the detection of 'buggy mental models' within the operators. The method is discussed in relation to the more traditional forms of verbal reports: concurrent and retrospective verbalisations, respectively. From the results of the empirical exploration, it is suggested that the method of collegial verbalisation may have combinatorial advantages that makes it more powerful as an analytical tool than the traditional forms of verbalisation, specifically if one wants to analyse work tasks that are dynamic and where the operators' behaviours are highly automated. However, more elaborate and systematic investigations must be conducted on the topic, and the paper therefore ends with a suggestion on an experimental design for this purpose.", "paper_title": "Collegial verbalisation - a case study on a new method on information acquisition", "paper_id": "WOS:000250361500009"}