{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "trade_show"}, {"score": 0.013966135786330242, "phrase": "sociomaterial_contexts"}, {"score": 0.004685224205630963, "phrase": "authorized_discourses"}, {"score": 0.004653339900995785, "phrase": "information_technology"}, {"score": 0.004017745870068031, "phrase": "everyday_discourses"}, {"score": 0.003803991592917943, "phrase": "organizing_visions"}, {"score": 0.0037267877774290374, "phrase": "direct_observations"}, {"score": 0.003504418473478722, "phrase": "micro-social_practices"}, {"score": 0.0032952735750239924, "phrase": "new_it_buzzwords"}, {"score": 0.003141246279336443, "phrase": "existing_discourses"}, {"score": 0.0026839372202435065, "phrase": "existing_discourse"}, {"score": 0.0025848074189353397, "phrase": "trade_shows"}, {"score": 0.0023810183846557486, "phrase": "better_understanding"}, {"score": 0.0022618732192713235, "phrase": "multiple_actors"}, {"score": 0.0022311183974368484, "phrase": "sociomaterial_context"}, {"score": 0.0021049977753042253, "phrase": "industry_level"}], "paper_keywords": ["IT", " Practices", " Discourses", " Artifacts", " Organizing vision", " Trade show", " Industry"], "paper_abstract": "This paper examines the fabric of authorized discourses about Information Technology (IT), i.e. of \"organizing visions\" (OVs), through the investigation of the discourses, practices, and sociomaterial contexts that make up their micro-social underpinnings. The case of a trade show allows us to explore the production of everyday discourses and practices about IT by gathering many of the parties involved in the fabric of organizing visions. Through a combination of direct observations, interviews, pictures, documents and a survey, we identify and analyze a number of micro-social practices related to the fabric of IT discourses. The trade show we studied was not a context in which new IT buzzwords and concepts emerged, but, rather, it was a setting where existing discourses about IT were repeated, refreshed, and materialized. Our three main findings reveal intriguing relationships between practices, discourses, and sociomaterial contexts: (1) practices and artifacts contribute to enclose the production of discourses; (2) practices and discourses aim at refining and updating an existing discourse about IT; and (3) many actors in the trade shows engage in discourses and practices that materialize the IT artifact. This research adds to the conceptualization of the dynamics of OVs through a better understanding of how they are affected by the relationships between the discourses and practices of multiple actors and by the sociomaterial context in which they take place. It draws several strategic implications concerning the dynamics of OVs at the industry level, how actors influence the fabric of OVs, as well as the roles and combination of artifacts, discourses and practices to build OVs. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Moving closer to the fabric of organizing visions: The case of a trade show", "paper_id": "WOS:000317162600002"}