{"auto_keywords": [{"score": 0.032539471083621686, "phrase": "mpi"}, {"score": 0.00481495049065317, "phrase": "mpi-interoperable_coarray_fortran"}, {"score": 0.004544127927346964, "phrase": "parallel_programming_models"}, {"score": 0.004472935829694716, "phrase": "coarray_fortran"}, {"score": 0.004111584914709491, "phrase": "productivity_gains"}, {"score": 0.0035106041824568618, "phrase": "new_programming_models"}, {"score": 0.0034738037330064885, "phrase": "existing_mpi_applications"}, {"score": 0.0023516185395256505, "phrase": "runtime_system"}, {"score": 0.0022544399432457164, "phrase": "broader_goal"}, {"score": 0.002207363758847308, "phrase": "single_application"}, {"score": 0.0021049977753042253, "phrase": "highest_level"}], "paper_keywords": ["Coarray Fortran", " MPI", " PGAS", " Interoperability"], "paper_abstract": "The past decade has seen the advent of a number of parallel programming models such as Coarray Fortran (CAF), Unified Parallel C, X10, and Chapel. Despite the productivity gains promised by these models, most parallel scientific applications still rely on MPI as their data movement model. One reason for this trend is that it is hard for users to incrementally adopt these new programming models in existing MPI applications. Because each model use its own runtime system, they duplicate resources and are potentially error-prone. Such independent runtime systems were deemed necessary because MPI was considered insufficient in the past to play this role for these languages. The recently released MPI-3, however, adds several new capabilities that now provide all of the functionality needed to act as a runtime, including a much more comprehensive one-sided communication framework. In this paper, we investigate how MPI-3 can form a runtime system for one example programming model, CAF, with a broader goal of enabling a single application to use both MPI and CAF with the highest level of interoperability.", "paper_title": "Portable, MPI-Interoperable Coarray Fortran", "paper_id": "WOS:000349142100008"}