{"auto_keywords": [{"score": 0.024692920828320673, "phrase": "partition_function"}, {"score": 0.00481495049065317, "phrase": "algorithmic_entropy"}, {"score": 0.004720043307726269, "phrase": "special_case"}, {"score": 0.0046269981365987915, "phrase": "statistical_mechanics"}, {"score": 0.004358676214574977, "phrase": "algorithmic_information_theory"}, {"score": 0.004230382915464495, "phrase": "universal_prefix-free_turing_machine"}, {"score": 0.003595097948724078, "phrase": "gibbs_ensemble"}, {"score": 0.0035594478687904743, "phrase": "entropy_subject"}, {"score": 0.003500812175550438, "phrase": "expected_values"}, {"score": 0.003375179864844835, "phrase": "log_runtime"}, {"score": 0.0032324864013225166, "phrase": "energy_e"}, {"score": 0.0032110737733503807, "phrase": "volume_v"}, {"score": 0.003075296862372287, "phrase": "conjugate_variables"}, {"score": 0.0026130182682465096, "phrase": "fundamental_thermodynamic_relation"}, {"score": 0.0024858771358801392, "phrase": "thermodynamic_cycles"}, {"score": 0.002444883254621769, "phrase": "heat_engines"}, {"score": 0.0021049977753042253, "phrase": "non-trivial_algorithmic_entropy"}], "paper_keywords": [""], "paper_abstract": "Algorithmic entropy can be viewed as a special case of the entropy studied in statistical mechanics. This viewpoint allows us to apply many techniques developed for use in thermodynamics to the subject of algorithmic information theory. In particular, suppose we fix a universal prefix-free Turing machine and let X be the set of programs that halt for this machine. Then we can regard X as a set of 'microstates', and treat any function on X as an 'observable'. For any collection of observables, we can study the Gibbs ensemble that maximises entropy subject to constraints on the expected values of these observables. We illustrate this by taking the log runtime, length and output of a program as observables analogous to the energy E, volume V and number of molecules N in a container of gas. The conjugate variables of these observables allow us to define quantities we call the 'algorithmic temperature' T, 'algorithmic pressure' P and 'algorithmic potential' mu, since they are analogous to the temperature, pressure and chemical potential. We derive an analogue of the fundamental thermodynamic relation dE = TdS - PdV + mu dN, and use it to study thermodynamic cycles analogous to those for heat engines. We also investigate the values of T, P and mu for which the partition function converges. At some points on the boundary of this domain of convergence, the partition function becomes uncomputable - indeed, at these points the partition function itself has non-trivial algorithmic entropy.", "paper_title": "Algorithmic thermodynamics", "paper_id": "WOS:000308719500004"}