{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiple_views"}, {"score": 0.015295517801718412, "phrase": "common_definition"}, {"score": 0.0043106348117582915, "phrase": "clear_and_overarching_definition"}, {"score": 0.004222105714769577, "phrase": "overall_justifications"}, {"score": 0.004036455094603843, "phrase": "systematic_attempts"}, {"score": 0.0030180996912267683, "phrase": "empirically_validated_model"}, {"score": 0.0024432508011008563, "phrase": "logically_possible_views"}, {"score": 0.0022404996930993413, "phrase": "different_views"}, {"score": 0.0022020103573658035, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "better_understanding"}], "paper_keywords": ["Common Definition", " Environment", " Extend Function", " Generate", " Intended Change", " GEMS of SAPPhIRE", " Requirement", " Scenarios", " Solution", " System"], "paper_abstract": "Functions are important in designing. However, several issues hinder progress with the understanding and usage of functions: lack of a clear and overarching definition of function, lack of overall justifications for the inevitability of the multiple views of function, and scarcity of systematic attempts to relate these views with one another. To help resolve these, the objectives of this research are to propose a common definition of function that underlies the multiple views in literature and to identify and validate the views of function that are logically justified to be present in designing. Function is defined as a change intended by designers between two scenarios: before and after the introduction of the design. A framework is proposed that comprises the above definition of function and an empirically validated model of designing, extended generate, evaluate, modify, and select of state-change, and an action, part, phenomenon, input, organ, and effect model of causality (Known as GEMS of SAPPhIRE), comprising the views of activity, outcome, requirement-solution-information, and system-environment. The framework is used to identify the logically possible views of function in the context of designing and is validated by comparing these with the views of function in the literature. Describing the different views of function using the proposed framework should enable comparisons and determine relationships among the various views, leading to better understanding and usage of functions in designing.", "paper_title": "A case for multiple views of function in design based on a common definition", "paper_id": "WOS:000322175800009"}