{"auto_keywords": [{"score": 0.030049536764850712, "phrase": "randomized_strategies"}, {"score": 0.02911054128726375, "phrase": "probabilistic_transitions"}, {"score": 0.00481495049065317, "phrase": "finite-state_graphs"}, {"score": 0.00407474190126995, "phrase": "partial_view"}, {"score": 0.0036652492107503956, "phrase": "complete_view"}, {"score": 0.002953164020173741, "phrase": "transition_function"}, {"score": 0.002777949746964955, "phrase": "deterministic_strategies"}, {"score": 0.0026452734009203764, "phrase": "complete_characterization"}, {"score": 0.002388817995161952, "phrase": "deterministic_transitions"}, {"score": 0.0021837406983565098, "phrase": "new_undecidability_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "We consider two-player zero-sum games on finite-state graphs. These games can be classified on the basis of the information of the players and on the mode of interaction between them. On the basis of information the classification is as follows: (a) partial-observation (both players have partial view of the game); (b) one-sided complete-observation (one player has complete observation); and (c) complete-observation (both players have complete view of the game). On the basis of mode of interaction we have the following classification: (a) concurrent (players interact simultaneously); and (b) turn-based (players interact in turn). The two sources of randomness in these games are randomness in the transition function and randomness in the strategies. In general, randomized strategies are more powerful than deterministic strategies, and probabilistic transitions give more general classes of games. We present a complete characterization for the classes of games where randomness is not helpful in: (a) the transition function (probabilistic transitions can be simulated by deterministic transitions); and (b) strategies (pure strategies are as powerful as randomized strategies). As a consequence of our characterization we obtain new undecidability results for these games. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Randomness for free", "paper_id": "WOS:000368899100002"}