{"auto_keywords": [{"score": 0.047510470298773595, "phrase": "miqcp"}, {"score": 0.00481495049065317, "phrase": "convex_relaxations"}, {"score": 0.004788504414069974, "phrase": "non-convex_mixed_integer"}, {"score": 0.004671274735676484, "phrase": "common_way"}, {"score": 0.004620093797504386, "phrase": "convex_relaxation"}, {"score": 0.0045820747375409435, "phrase": "mixed_integer_quadratically_constrained_program"}, {"score": 0.004445316841017889, "phrase": "higher-dimensional_space"}, {"score": 0.004408729661992651, "phrase": "variables_y"}, {"score": 0.004160879027087841, "phrase": "quadratic_form"}, {"score": 0.0038518661517315533, "phrase": "main_drawback"}, {"score": 0.0035657203308982065, "phrase": "low-dimensional_relaxations"}, {"score": 0.003478321590910367, "phrase": "extended_formulations"}, {"score": 0.0034024277222012597, "phrase": "projection_techniques"}, {"score": 0.0033373756615875517, "phrase": "lift-and-project_methodology"}, {"score": 0.0032826043188559613, "phrase": "extended_formulation"}, {"score": 0.0032198357970567595, "phrase": "original_space"}, {"score": 0.00319330258693017, "phrase": "linear_programs"}, {"score": 0.003097865379563127, "phrase": "sdp_relaxation"}, {"score": 0.0029887355917821304, "phrase": "single_quadratic_constraint"}, {"score": 0.002947790697936243, "phrase": "subgradient-based_heuristic"}, {"score": 0.0028596699752849682, "phrase": "new_eigen-reformulation"}, {"score": 0.0028127163745564777, "phrase": "cut_generation_technique"}, {"score": 0.0027361626349903744, "phrase": "extensive_computational_results"}, {"score": 0.0026838147966444783, "phrase": "proposed_techniques"}, {"score": 0.002610760187858779, "phrase": "globallib_instances"}, {"score": 0.0023900527169254744, "phrase": "box-qp_instances"}, {"score": 0.0023703411133292746, "phrase": "strengthened_relaxations"}, {"score": 0.002243011652519744, "phrase": "large_instances"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_sdp_solver"}], "paper_keywords": [""], "paper_abstract": "A common way to produce a convex relaxation of a Mixed Integer Quadratically Constrained Program (MIQCP) is to lift the problem into a higher-dimensional space by introducing variables Y (ij) to represent each of the products x (i) x (j) of variables appearing in a quadratic form. One advantage of such extended relaxations is that they can be efficiently strengthened by using the (convex) SDP constraint Y - xx(T) >= 0 and disjunctive programming. On the other hand, the main drawback of such an extended formulation is its huge size, even for problems for which the number of x (i) variables is moderate. In this paper, we study methods to build low-dimensional relaxations of MIQCP that capture the strength of the extended formulations. To do so, we use projection techniques pioneered in the context of the lift-and-project methodology. We show how the extended formulation can be algorithmically projected to the original space by solving linear programs. Furthermore, we extend the technique to project the SDP relaxation by solving SDPs. In the case of an MIQCP with a single quadratic constraint, we propose a subgradient-based heuristic to efficiently solve these SDPs. We also propose a new eigen-reformulation for MIQCP, and a cut generation technique to strengthen this reformulation using polarity. We present extensive computational results to illustrate the efficiency of the proposed techniques. Our computational results have two highlights. First, on the GLOBALLib instances, we are able to generate relaxations that are almost as strong as those proposed in our companion paper even though our computing times are about 100 times smaller, on average. Second, on box-QP instances, the strengthened relaxations generated by our code are almost as strong as the well-studied SDP+RLT relaxations and can be solved in less than 2 s, even for large instances with 100 variables; the SDP+RLT relaxations for the same set of instances can take up to a couple of hours to solve using a state-of-the-art SDP solver.", "paper_title": "Convex relaxations of non-convex mixed integer quadratically constrained programs: projected formulations", "paper_id": "WOS:000297130400005"}