{"auto_keywords": [{"score": 0.04547939622783775, "phrase": "information_channels"}, {"score": 0.015536626463772414, "phrase": "linguistic_communication"}, {"score": 0.015132433741337957, "phrase": "vsm"}, {"score": 0.013144852151093544, "phrase": "requisite_variety"}, {"score": 0.00481495049065317, "phrase": "viable_social_systems"}, {"score": 0.004660634721704355, "phrase": "viable_system_model"}, {"score": 0.004538045400396629, "phrase": "communication_structures"}, {"score": 0.004042866322177613, "phrase": "ashby's_law"}, {"score": 0.003983404013173127, "phrase": "resulting_models"}, {"score": 0.003901617424466747, "phrase": "variety_attenuation"}, {"score": 0.003844224579620687, "phrase": "variety_amplification"}, {"score": 0.0036989087840696025, "phrase": "complexity_management_laws"}, {"score": 0.0036661603351260926, "phrase": "ashby"}, {"score": 0.003394164702727995, "phrase": "minimum_damage"}, {"score": 0.002935050614509531, "phrase": "logical_presentation"}, {"score": 0.0028492532869274743, "phrase": "basic_argument"}, {"score": 0.00273332251017364, "phrase": "self-organizing_processes"}, {"score": 0.00260657976055413, "phrase": "linguistic_predication"}, {"score": 0.002530359917257626, "phrase": "turing_machine"}, {"score": 0.0024418251230319435, "phrase": "human_agents"}, {"score": 0.002356380755825062, "phrase": "technical_means"}, {"score": 0.002328567395792052, "phrase": "social_processes"}, {"score": 0.0022739194433372173, "phrase": "large_knowledge_base"}, {"score": 0.0021049977753042253, "phrase": "conceptual_and_logical_argument"}], "paper_keywords": ["Social structure", " Modelling", " Communities", " Communication", " Language", " Cybernetics"], "paper_abstract": "Purpose - The viable system model (VSM) provides a way to understand communication structures in an organization. It gives us a means to visualize and analyze information channels relating the functions in an enterprise, a corporation, or any other kind of organization. At the heart of the VSM is the application of Ashby's law of requisite variety. The resulting models help to analyze and discuss what variety attenuation of operations and what variety amplification of management can establish requisite variety. Many studies and applications show that the complexity management laws described by Ashby and Beer hold, and that managerial, operational and environmental varieties tend to equate. The amplifiers and attenuators, however, should be designed to do so with minimum damage to people and to cost. The purpose of this paper is to determine to what extent the design of amplifiers and attenuators is possible if these are realized based on linguistic communication, and whether this design can be automated in these cases. Design/methodology/approach - The paper uses logical presentation of ideas along with examples from cases. The basic argument is that the design of information channels - amplifiers and attenuators - relies on self-organizing processes that depend on an operation called linguistic predication. Findings - The paper demonstrates that linguistic predication is not computable based on the model of the Turing machine so that this operation is restricted to be carried out by human agents. In these cases, technology is limited to providing a technical means for communication and social processes. Originality/value - While there is a large knowledge base of literature in the field of applications of the VSM there is less work providing concepts and guidelines for designing information channels. This paper offers a conceptual and logical argument for their characteristics based on linguistics and philosophy of language.", "paper_title": "Designing viable social systems The role of linguistic communication for self-organization", "paper_id": "WOS:000293669700014"}