{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vmi_systems"}, {"score": 0.03754776323381931, "phrase": "inventory_position"}, {"score": 0.0046928583946554666, "phrase": "vmi"}, {"score": 0.004613175917207636, "phrase": "supply-chain_initiative"}, {"score": 0.004144810537437608, "phrase": "ed_joint_inventory_policy"}, {"score": 0.0038702288460744274, "phrase": "-order_policies"}, {"score": 0.0037558704408683905, "phrase": "can-order_policy"}, {"score": 0.0037078961288626185, "phrase": "retailer's_inventory"}, {"score": 0.003537155405923517, "phrase": "retailer_k"}, {"score": 0.00296698375549856, "phrase": "economical_consolidated_dispatch_quantity"}, {"score": 0.002854645802851, "phrase": "renewal_theoretic_model"}, {"score": 0.0027940789980683, "phrase": "poisson_demands"}, {"score": 0.002586457551025025, "phrase": "analytical_solution"}, {"score": 0.0024884913795612707, "phrase": "approximate_optimal_decision"}], "paper_keywords": ["vendor-managed inventory", " vendor-retailer coordination", " can-order policy"], "paper_abstract": "Vendor managed inventory (VMI) is a supply-chain initiative in which the vendor is authorized to manage inventories of agreed upon stock-keeping-units at retail locations. In this paper, a modi. ed joint inventory policy is introduced for VMI systems where the vendor takes a standard (s, S) policy and the retailers utilize can-order policies. Under the regime of a can-order policy, each retailer's inventory is controlled by three variables s, c and S. Once the inventory position of retailer k reaches its must-order level s(k), a dispatch from the vendor to retailers is triggered. At the same time, any retailer j, with inventory position at or below its can-order level c(j), is included in the dispatch and thus an economical consolidated dispatch quantity accumulates. To formulate the policy, a renewal theoretic model for the case of Poisson demands is developed. Due to the complexity of the problem, it is difficult to get the analytical solution and thus simulations are utilized to obtain an approximate optimal decision. Finally, the results from simulations show that about 5 to 20 percent of the cost can be saved from utilizing of the modi. ed joint policy, comparing with the standard joint (s, S) policy where both the vendor and retailers take (s, S) policies.", "paper_title": "A modified joint inventory policy for VMI systems", "paper_id": "WOS:000257387900003"}