{"auto_keywords": [{"score": 0.04131023925415857, "phrase": "metacognitive_strategies"}, {"score": 0.006379096910294416, "phrase": "social_entertainment"}, {"score": 0.00631991707568, "phrase": "information-seeking_activities"}, {"score": 0.00481495049065317, "phrase": "online_social_entertainment_and_information_seeking_activities"}, {"score": 0.00466016686289196, "phrase": "distinct_effects"}, {"score": 0.004616859702338596, "phrase": "different_online_activities"}, {"score": 0.004224911726496726, "phrase": "current_study"}, {"score": 0.0040890178236849825, "phrase": "online_reading_activities"}, {"score": 0.003884212965525665, "phrase": "mediation_analysis"}, {"score": 0.0030747771905143273, "phrase": "indirect_effects"}, {"score": 0.002684819249720834, "phrase": "better_reading_literacy"}, {"score": 0.0025028892126605124, "phrase": "poorer_reading_literacy"}, {"score": 0.0022580713471027996, "phrase": "offline_reading"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Social reading activities", " Information-seeking activities", " Metacognitive strategies", " Reading literacy", " Mediation analysis"], "paper_abstract": "Research showed distinct effects of different online activities on reading literacy or learning outcomes; however, no explanation about this link was provided. The current study investigated the effects of two genres of online reading activities on reading literacy based on knowledge of metacognitive strategies in a mediation analysis. Participants were 87,735 fifteen-year-old students (49.8% girls) across 15 regions in the PISA 2009 dataset. We divided online reading activities into social entertainment and information-seeking activities and controlled for gender, socioeconomic status, and the availability of Information and Communication Technologies (ICT) at home and at school. The indirect effects of knowledge of metacognitive strategies helped to explain why social entertainment and information-seeking activities would predict reading literacy differently. More frequent information-seeking activities predicted better knowledge of metacognitive strategies, which in turn predicted better reading literacy, while more frequent social entertainment activities predicted poorer knowledge of metacognitive strategies, which in turn led to poorer reading literacy. Suggestions were made to guide students in engaging in more online information-seeking reading activities, and incorporate instruction of metacognitive strategies for both online and offline reading, thereby improving students' reading literacy in both printed and digital formats. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The indirect effects of online social entertainment and information seeking activities on reading literacy", "paper_id": "WOS:000320430500015"}