{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pre-school_children's_attitudes"}, {"score": 0.047056578280237404, "phrase": "small_children"}, {"score": 0.04243245346718886, "phrase": "young_children"}, {"score": 0.03942319319946729, "phrase": "book-related_places"}, {"score": 0.038577767498153, "phrase": "focus_group_interview"}, {"score": 0.027029331462353184, "phrase": "adapted_methodological_approach"}, {"score": 0.004634639877463851, "phrase": "adapted_form"}, {"score": 0.004603525341738782, "phrase": "qualitative_research_method"}, {"score": 0.004451044169211355, "phrase": "small-scale_study"}, {"score": 0.004401342842183475, "phrase": "direct_study"}, {"score": 0.003978178618126202, "phrase": "research_methods"}, {"score": 0.0038810583785936505, "phrase": "additional_research_objectives"}, {"score": 0.0036361876334500107, "phrase": "content_questions"}, {"score": 0.003406713877432236, "phrase": "animation_toy"}, {"score": 0.003308587435077573, "phrase": "purposive_sample"}, {"score": 0.0031277316566463978, "phrase": "appropriate_method"}, {"score": 0.00294346227267869, "phrase": "toy_animation"}, {"score": 0.002930251343471448, "phrase": "positive_results"}, {"score": 0.002904006582593092, "phrase": "gathering_data"}, {"score": 0.0028586409810976367, "phrase": "content_results"}, {"score": 0.0028458096625791625, "phrase": "positive_attitudes"}, {"score": 0.0027513878455384445, "phrase": "daily_exposure"}, {"score": 0.002666081878235023, "phrase": "quite_good_knowledge"}, {"score": 0.0024808725694787093, "phrase": "different_user_groups"}, {"score": 0.0024641814990854463, "phrase": "different_circumstances"}, {"score": 0.002425670010594346, "phrase": "user_group"}, {"score": 0.0023346234464901978, "phrase": "non-probability_purposive_sampling"}, {"score": 0.0022981320927411885, "phrase": "first_attempt"}, {"score": 0.0021384289799304197, "phrase": "educational_programmes"}, {"score": 0.002114495969857587, "phrase": "proper_development"}, {"score": 0.0021049977753042253, "phrase": "children's_reading_competences"}], "paper_keywords": ["Methodology", " Attitudes", " Adaptation", " Focus group interview", " Kindergarten", " Pre-school children"], "paper_abstract": "Purpose - The purpose of this paper is to present an adapted form of a qualitative research method, focus group interview, for use with small children and demonstrate its use in a small-scale study. Researchers often avoid direct study of children, and study them indirectly by asking adults. This was frequent before 1990s, but today, researchers increasingly discuss research with children rather than on children. Nevertheless, in research with young children it is not possible to use all research methods, therefore the authors modified and tested one. The additional research objectives, besides verification of methodology, were to determine the pre-school children's attitudes to books, book-related places, reading. Design/methodology/approach - The adaptation of the focus group interview involved merging the content questions of the research with a story and using a toy as the storyteller. This resembled storytelling and enabled the children to directly participate by talking to the animation toy instead of the researcher. The authors tested the method on a purposive sample of 13 pre-school children aged four and five in one public kindergarten. Findings - Despite of the belief of some experts, who claim that focus group interview is not an appropriate method to explore habits or opinions of children, the authors found that adaptation of this method for the use with small children by means of storytelling and toy animation brings positive results because it enabled gathering data directly from the children. The content results show positive attitudes towards books and reading, differences in reading interests between boys and girls, daily exposure to books and reading, both in kindergarten and at home, and quite good knowledge of book-related places, especially libraries, somewhat less bookstores. Research limitations/implications - Since this is only the first attempt to use this adapted methodological approach, it is necessary that the method is tested on different user groups and in different circumstances to further validate its suitability for this user group. Regarding the content of the study, the results cannot be generalized due to non-probability purposive sampling. Originality/value - This is the first attempt to use the adapted methodological approach for researching young children. The research may serve as a beginning and incentive for further research in this area, since only high-quality results provide good modifications and adaptations of educational programmes and activities to ensure proper development of children's reading competences and attitudes to books and reading.", "paper_title": "Focus group interview through storytelling Researching pre-school children's attitudes towards books and reading", "paper_id": "WOS:000369171600010"}