{"auto_keywords": [{"score": 0.04625336728938103, "phrase": "monitoring_system"}, {"score": 0.036055667489892834, "phrase": "parameter_stability"}, {"score": 0.00481495049065317, "phrase": "batch_processes"}, {"score": 0.004619027561771169, "phrase": "paramount_aspect"}, {"score": 0.004370087541308677, "phrase": "so-called_parameter_stability"}, {"score": 0.0036665842836420223, "phrase": "reduced_amount"}, {"score": 0.003468796799802612, "phrase": "sound_study"}, {"score": 0.0030336118627011786, "phrase": "principal_component_analysis-based_bmspc_methods"}, {"score": 0.0028566300478906916, "phrase": "indicator_variable"}, {"score": 0.0025447065763362984, "phrase": "three-way_batch_data"}, {"score": 0.0023851190889040254, "phrase": "k-models"}, {"score": 0.0022355167967736326, "phrase": "previous_conclusions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["stability", " uncertainty", " multivariate statistical process control", " unfolding", " principal component analysis", " synchronization"], "paper_abstract": "A paramount aspect in the development of a model for a monitoring system is the so-called parameter stability. This is inversely related to the uncertainty, i.e., the variance in the parameters estimates. Noise affects the performance of the monitoring system, reducing its fault detection capability. Low parameters uncertainty is desired to ensure a reduced amount of noise in the model. Nonetheless, there is no sound study on the parameter stability in batch multivariate statistical process control (BMSPC). The aim of this paper is to investigate the parameter stability associated to the most used synchronization and principal component analysis-based BMSPC methods. The synchronization methods included in this study are the following: indicator variable, dynamic time warping, relaxed greedy time warping, and time linear expanding/compressing-based. In addition, different arrangements of the three-way batch data into two-way matrices are considered, namely single-model, K-models, and hierarchical-model approaches. Results are discussed in connection with previous conclusions in the first two papers of the series. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Bilinear modeling of batch processes. Part III: parameter stability", "paper_id": "WOS:000329807700002"}