{"auto_keywords": [{"score": 0.047568746232458624, "phrase": "academic_institutions"}, {"score": 0.015365263781263006, "phrase": "case_study"}, {"score": 0.004778121549742778, "phrase": "spanish"}, {"score": 0.004615656893404919, "phrase": "novel_methodology"}, {"score": 0.0042250952759280225, "phrase": "useful_identifiers"}, {"score": 0.003988293689448734, "phrase": "academic_journals"}, {"score": 0.0039274105882136775, "phrase": "research_output_representation"}, {"score": 0.003735862292632131, "phrase": "institution_descriptors"}, {"score": 0.003608732492631878, "phrase": "journal_weights"}, {"score": 0.0035536228914319354, "phrase": "institution_identifiers"}, {"score": 0.0034194902384248006, "phrase": "large_proportion"}, {"score": 0.0033158265075584796, "phrase": "bad_indicator"}, {"score": 0.003082007273423372, "phrase": "different_institutions"}, {"score": 0.003000070450638437, "phrase": "cluster_analysis"}, {"score": 0.0027670642397888494, "phrase": "agglomerative_hierarchical_clustering"}, {"score": 0.0026218430041123164, "phrase": "spanish_universities"}, {"score": 0.002532526438148958, "phrase": "study_sample"}, {"score": 0.002493810638588771, "phrase": "institution's_overall_research_output"}, {"score": 0.0021049977753042253, "phrase": "different_disciplinary_contexts"}], "paper_keywords": ["bibliometrics"], "paper_abstract": "We introduce a novel methodology for mapping academic institutions based on their journal publication profiles. We believe that journals in which researchers from academic institutions publish their works can be considered as useful identifiers for representing the relationships between these institutions and establishing comparisons. However, when academic journals are used for research output representation, distinctions must be introduced between them, based on their value as institution descriptors. This leads us to the use of journal weights attached to the institution identifiers. Since a journal in which researchers from a large proportion of institutions published their papers may be a bad indicator of similarity between two academic institutions, it seems reasonable to weight it in accordance with how frequently researchers from different institutions published their papers in this journal. Cluster analysis can then be applied to group the academic institutions, and dendrograms can be provided to illustrate groups of institutions following agglomerative hierarchical clustering. In order to test this methodology, we use a sample of Spanish universities as a case study. We first map the study sample according to an institution's overall research output, then we use it for two scientific fields (Information and Communication Technologies, as well as Medicine and Pharmacology) as a means to demonstrate how our methodology can be applied, not only for analyzing institutions as a whole, but also in different disciplinary contexts.", "paper_title": "Mapping academic institutions according to their journal publication profile: Spanish universities as a case study", "paper_id": "WOS:000310550000016"}