{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "input_error-correction_features"}, {"score": 0.00450456611645112, "phrase": "input_validation"}, {"score": 0.004386063799793622, "phrase": "erroneous_inputs"}, {"score": 0.003754140294151593, "phrase": "erroneous_effects"}, {"score": 0.0032706520949775065, "phrase": "input_error"}, {"score": 0.003114449258490062, "phrase": "empirical_study"}, {"score": 0.003032405563826263, "phrase": "interesting_control_flow_graph_patterns"}, {"score": 0.0029133627624098064, "phrase": "information_systems"}, {"score": 0.0028492532869274743, "phrase": "initial_findings"}, {"score": 0.0027010719929751, "phrase": "automated_recovery"}, {"score": 0.0025950024597986366, "phrase": "source_code"}, {"score": 0.002515384834484012, "phrase": "recovered_information"}, {"score": 0.0024490834773668153, "phrase": "decomposition-slicing_technique"}, {"score": 0.0022705467477443417, "phrase": "case_study"}, {"score": 0.0021716540012278744, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["input error-correction features", " automated recovery", " software maintenance", " decomposition slicing", " empirical properties", " information systems"], "paper_abstract": "Most information systems deal with inputs submitted from their external environments. In such systems, input validation is often incorporated to reject erroneous inputs. Unfortunately, many input errors cannot be detected automatically and therefore result in errors in the effects raised by the system. Therefore, the provision of input error-correction features (IECFs) to correct these erroneous effects is critical. However, recovery and maintenance of these features are complicated, tedious and error prone because there are many possible input errors during user interaction with the system; each input error, in turn, might result in several erroneous effects. Through empirical study, we have discovered some interesting control flow graph patterns with regard to the implementation of IECFs in information systems. Motivated by these initial findings, in this paper, we propose an approach to the automated recovery of IECFs by realizing these patterns from the source code. On the basis of the recovered information, we further propose a decomposition-slicing technique to aid the maintenance of these features without interfering with other parts of the system. A case study has been conducted to show the usefulness of the proposed approach. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "Empirical-based recovery and maintenance of input error-correction features", "paper_id": "WOS:000252079600003"}