{"auto_keywords": [{"score": 0.04271017950038436, "phrase": "different_estimators"}, {"score": 0.00481495049065317, "phrase": "implicit_symmetric_positive_semi-definite_matrix"}, {"score": 0.004673530058379246, "phrase": "randomized_trace_estimators"}, {"score": 0.004112812699639956, "phrase": "random_vectors"}, {"score": 0.004043298628655316, "phrase": "different_distributions"}, {"score": 0.003542786326740931, "phrase": "explicit_representation"}, {"score": 0.003512702405367876, "phrase": "abut"}, {"score": 0.0034977560416755726, "phrase": "rather_an_efficient_method"}, {"score": 0.0029744042270542655, "phrase": "relative_error"}, {"score": 0.002539978170928796, "phrase": "minimum-variance_estimators"}, {"score": 0.0023123057299992587, "phrase": "projection_matrices"}, {"score": 0.0022062235065459274, "phrase": "electronic_structure_calculations"}, {"score": 0.0021504218042734677, "phrase": "new_estimator"}], "paper_keywords": ["Algorithms", " Trace estimation", " implicit linear operators"], "paper_abstract": "We analyze the convergence of randomized trace estimators. Starting at 1989, several algorithms have been proposed for estimating the trace of a matrix by 1/M Sigma(M)(i=1) z(i)(T) A(zi), where the z(i) are random vectors; different estimators use different distributions for the z(i)s, all of which lead to E (1/M Sigma(M)(i=1)z(i)(T)Az(i)) = trace(A). These algorithms are useful in applications in which there is no explicit representation of Abut rather an efficient method compute z(T) Az given z. Existing results only analyze the variance of the different estimators. In contrast, we analyze the number of samples M required to guarantee that with probability at least 1-delta, the relative error in the estimate is at most epsilon. We argue that such bounds are much more useful in applications than the variance. We found that these bounds rank the estimators differently than the variance; this suggests that minimum-variance estimators may not be the best. We also make two additional contributions to this area. The first is a specialized bound for projection matrices, whose trace (rank) needs to be computed in electronic structure calculations. The second is a new estimator that uses less randomness than all the existing estimators.", "paper_title": "Randomized Algorithms for Estimating the Trace of an Implicit Symmetric Positive Semi-Definite Matrix", "paper_id": "WOS:000289197700004"}