{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "identifier-to-locator_mapping_services"}, {"score": 0.04133762036949356, "phrase": "identifier-to-locator_mapping_service"}, {"score": 0.004630150894006861, "phrase": "scalability_issue"}, {"score": 0.00457013354092966, "phrase": "internet_routing_architecture"}, {"score": 0.0044718206943536514, "phrase": "growing_consensus"}, {"score": 0.004318881178805575, "phrase": "locator_role"}, {"score": 0.004262881313926916, "phrase": "identifier_role"}, {"score": 0.004225950334493496, "phrase": "ip_addresses"}, {"score": 0.004046020290832207, "phrase": "critical_challenge"}, {"score": 0.0023782753249846794, "phrase": "service_providers"}, {"score": 0.0022084059770026416, "phrase": "elegant_mapping_service"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Future Internet routing", " Locator/identifier separation", " Mapping service", " Scalability", " Security"], "paper_abstract": "In order to address the scalability issue of the Internet routing architecture, there is a growing consensus that it is necessary to separate the locator role and the identifier role of IP addresses. When identifiers are separated from locators, a critical challenge is how to design an identifier-to-locator mapping service to map identifiers onto locators. While many mapping services have been proposed in the literature, they are designed based on either the structure or the hash of identifiers. That is, they are all designed based on identifiers. A result of such design choices is that users of identifiers do not have the freedom to choose where to store their identifier-to-locator mappings. In this paper, we argue that an identifier-to-locator mapping service should offer users of identifiers the freedom to choose where to store their mappings. For this purpose, we propose to decouple the design of identifier-to-locator mapping services from identifiers. In particular, our research results show that, by setting a set of identifier-to-locator mapping service providers (MSPs) and letting the users of identifiers choose their preferred/trusted MSPs, we can design an elegant mapping service to map identifiers onto locators. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Decoupling the design of identifier-to-locator mapping services from identifiers", "paper_id": "WOS:000288771000007"}