{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "resource_hogs"}, {"score": 0.015076850391341292, "phrase": "basic_technique"}, {"score": 0.004761132425263795, "phrase": "mobile_delay-tolerant_networks"}, {"score": 0.004655285779819366, "phrase": "tolerant_networks"}, {"score": 0.004475659507646842, "phrase": "low_connectivity"}, {"score": 0.004425616928975799, "phrase": "unreliable_links"}, {"score": 0.0033974527047473044, "phrase": "uncontrolled_resource_hogs"}, {"score": 0.003266201217790818, "phrase": "successfully_delivered_non-hog_messages"}, {"score": 0.00305285084207725, "phrase": "coarse-grained_priority_classes"}, {"score": 0.0025928815987676535, "phrase": "verifiable_senders"}, {"score": 0.0025494354909453847, "phrase": "resource_hog_behavior"}, {"score": 0.0022777800735119405, "phrase": "message_delivery_ratio"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Delay-tolerant networks", " Resource management", " Resource hogs"], "paper_abstract": "Delay-tolerant networks (DTNs) are characterized by low connectivity and/or unreliable links. Messages are delivered by intermediaries who donate their resources to the system. If these resources are not managed they can be abused by resource hogs, i.e., individuals whose message generation rate is much higher than the average. In this paper we first show through simulation that uncontrolled resource hogs can substantially reduce the proportion of successfully delivered non-hog messages. To combat this problem we employ a basic technique based on coarse-grained priority classes. User or node authentication can be one basis for constructing such classes: for example, messages from certain verifiable senders are assigned to a higher priority class. The basic technique effectively deals with strangers who act as resource hogs but cannot counter verifiable senders who exhibit resource hog behavior. We extend the basic technique into three fine-grained solutions for dealing with such \"insider\" hogs and show the effectiveness of each in restoring message delivery ratio to the scenario where no resource hogs are present. (c) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Controlling resource hogs in mobile delay-tolerant networks", "paper_id": "WOS:000273235800002"}