{"auto_keywords": [{"score": 0.04531715265766572, "phrase": "broader_context"}, {"score": 0.0045804107341714, "phrase": "archer's_morphogenetic_approach"}, {"score": 0.0041074234667687875, "phrase": "ma's_analytical_and_explanatory_apparatus"}, {"score": 0.003942877273973905, "phrase": "public_sector_ict_provision"}, {"score": 0.003907217205033169, "phrase": "kenya"}, {"score": 0.003683097597914604, "phrase": "practical_value"}, {"score": 0.00330246222643051, "phrase": "global_normative_pressures"}, {"score": 0.0032282396745967504, "phrase": "national_socio-economic_base"}, {"score": 0.0030988045934942587, "phrase": "multistakeholder_networks"}, {"score": 0.0030707512751243214, "phrase": "key_forces"}, {"score": 0.003015401937358271, "phrase": "evolutionary_trajectory"}, {"score": 0.0028813415821988156, "phrase": "understanding_mechanisms"}, {"score": 0.0028422946420821075, "phrase": "evolutionary_process"}, {"score": 0.0027159094186967247, "phrase": "individual_public_sector_ict_projects"}], "paper_keywords": ["Morphogenetic approach", " ICT4D", " temporality", " networks", " emergent social systems", " agency and structure", " broader context", " information systems", " development", " critical realism"], "paper_abstract": "This paper demonstrates the value of Archer's morphogenetic approach (MA) in understanding and explaining the complexity of the broader context within which many developing country information and communication technology (ICT) projects are implemented. It does this by using MA's analytical and explanatory apparatus to examine the evolution of the context of public sector ICT provision in Kenya over the period 1963-2006. In addition to demonstrating the practical value of MA, the paper contributes to the Information Systems literature on ICT for development (ICT4D). The analysis identifies (1) global normative pressures, polity, the national socio-economic base, disruptive technology, and the emergence of multistakeholder networks as key forces in shaping the evolutionary trajectory, (2) the explicit treatment of time and temporality as key for understanding mechanisms underpinning the evolutionary process, and (3) the difficulty of cleanly isolating the implementation of individual public sector ICT projects from the broader context and ICT4D agendas. The discussion elaborates on the features of MA found to be particularly valuable in this study. The paper concludes that explicitly attending to time and temporality, and to the broader context for ICT4D projects, would contribute to the development of more nuanced accounts of such projects and a more emancipatory outlook for ICT4D research.", "paper_title": "THE BROADER CONTEXT FOR ICT4D PROJECTS: A MORPHOGENETIC ANALYSIS", "paper_id": "WOS:000329756000012"}