{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "transfinder"}, {"score": 0.011506895331955981, "phrase": "generated_atomic_regions"}, {"score": 0.00481495049065317, "phrase": "automatic_atomic_region_identification"}, {"score": 0.004761132425263795, "phrase": "shared_memory_spmd_programs"}, {"score": 0.0043029342321223825, "phrase": "unsynchronized_multithreaded_program"}, {"score": 0.004183638135671596, "phrase": "atomic_regions"}, {"score": 0.004044822781630218, "phrase": "previous_tools"}, {"score": 0.003932654396285872, "phrase": "programmer_input"}, {"score": 0.003284637361174143, "phrase": "programmer-specified_transactions"}, {"score": 0.003087419032091453, "phrase": "eight_stamp_benchmarks"}, {"score": 0.002984867789900281, "phrase": "identical_synchronization_semantics"}, {"score": 0.0025638362414466278, "phrase": "program_structure"}, {"score": 0.0023827927890399357, "phrase": "programmer-specified_atomic_regions"}], "paper_keywords": ["Algorithms", " Performance", " Design", " Automatic transactional region identification", " conflict-serializability", " parallel programming"], "paper_abstract": "This paper presents TransFinder, a compile-time tool that automatically determines which statements of an unsynchronized multithreaded program must be enclosed in atomic regions to enforce conflict-serializability. Unlike previous tools, TransFinder requires no programmer input (beyond the program) and is more efficient in both time and space. Our implementation shows that the generated atomic regions range from being identical to, or smaller than, the programmer-specified transactions in the three Java Grande benchmarks considered, and in five of the eight STAMP benchmarks considered, while still providing identical synchronization semantics and results. The generated atomic regions are between 5 and 38 lines larger in the three remaining STAMP benchmarks. In the most conservative case, TransFinder can, based on the program structure, successfully identify and suggest an alternative that conforms exactly to the programmer-specified atomic regions. By generating small, highly-targeted, conflict-serializable atomic regions, TransFinder allows the programmer to focus further tuning efforts on only a small portion of the code (when further tuning is needed).", "paper_title": "Automatic Atomic Region Identification in Shared Memory SPMD Programs", "paper_id": "WOS:000286595800040"}