{"auto_keywords": [{"score": 0.004027031316965272, "phrase": "'graded'_version"}, {"score": 0.003920476803132283, "phrase": "logical_equivalence"}, {"score": 0.003868257410961701, "phrase": "basic_properties"}, {"score": 0.0036498637283470386, "phrase": "different_concepts"}, {"score": 0.003278447235176855, "phrase": "logic_theory"}, {"score": 0.0030113280682863234, "phrase": "approximate_reasoning"}, {"score": 0.002931569771634119, "phrase": "many-valued_propositional_logic_systems"}, {"score": 0.002716844480081738, "phrase": "\"quantitative_logic"}, {"score": 0.0024842242921857705, "phrase": "information_theory"}, {"score": 0.0023754752864092437, "phrase": "profound_impact"}, {"score": 0.002354302193867031, "phrase": "contemporary_information_technology"}, {"score": 0.0023021895404322767, "phrase": "quantitative_logic"}, {"score": 0.002241171326888997, "phrase": "highly_representative_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Degree of the truth", " Degree of the similarity", " Pseudo-metric", " Degree of the divergence", " Degree of the consistency", " Approximate reasoning", " Quantitative logic"], "paper_abstract": "In this paper, we introduce the concept of the degree of the truth in the framework of so called many-valued propositional logic systems with the intention of measuring to what extent a given formula is true. Such a concept can indeed induce, in a very natural way, the degree of the similarity as well as to induce a pseudo-metric among formulas as the 'graded' version of the notion of the logical equivalence. The basic properties of such induced logic metric space hence are investigated in this paper. We further introduce different concepts of the degree of the divergence and the degree of the consistency in order to grade the extent of the consistency of a logic theory. To the end, all the basic logic notions are graded. Lastly, we propose in this paper three patterns of approximate reasoning' so far as the many-valued propositional logic systems are concerned. Hence, we can claim that we have laid the foundation for the \"quantitative logic\". Since this theory has touched upon several key concepts of similarity, comparison, measurements, etc. in information theory, we are convinced that the theory may have profound impact in contemporary information technology. In addition, quantitative logic can be regarded as a highly representative example of mathematics of uncertainty capable of handling vagueness. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Quantitative logic", "paper_id": "WOS:000263708600003"}