{"auto_keywords": [{"score": 0.04570398300724071, "phrase": "thematic_evolution"}, {"score": 0.010612387000973441, "phrase": "research_field"}, {"score": 0.010205260054638308, "phrase": "fuzzy_sets_theory_field"}, {"score": 0.009227992032695566, "phrase": "performance_analysis"}, {"score": 0.00413684709497912, "phrase": "science_mapping"}, {"score": 0.004022137057452406, "phrase": "conceptual_subdomains"}, {"score": 0.003378385493203297, "phrase": "longitudinal_framework"}, {"score": 0.003266201217790818, "phrase": "different_themes"}, {"score": 0.00305285084207725, "phrase": "different_bibliometric_measures"}, {"score": 0.002727700630869639, "phrase": "presented_approach"}, {"score": 0.0026820015810254004, "phrase": "visualization_method"}, {"score": 0.00257831812581194, "phrase": "studied_field"}, {"score": 0.0021773853011112882, "phrase": "fuzzy_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Science mapping", " Co-word analysis", " Bibliometric studies", " Fuzzy Sets Theory", " Thematic evolution", " h-Index"], "paper_abstract": "This paper presents an approach to analyze the thematic evolution of a given research field. This approach combines performance analysis and science mapping for detecting and visualizing conceptual subdomains (particular themes or general thematic areas). It allows us to quantify and visualize the thematic evolution of a given research field. To do this, co-word analysis is used in a longitudinal framework in order to detect the different themes treated by the research field across the given time period. The performance analysis uses different bibliometric measures, including the h-index, with the purpose of measuring the impact of both the detected themes and thematic areas. The presented approach includes a visualization method for showing the thematic evolution of the studied field. Then, as an example, the thematic evolution of the Fuzzy Sets Theory field is analyzed using the two most important journals in the topic: Fuzzy Sets and Systems and IEEE Transactions on Fuzzy Systems. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An approach for detecting, quantifying, and visualizing the evolution of a research field: A practical application to the Fuzzy Sets Theory field", "paper_id": "WOS:000285626000012"}