{"auto_keywords": [{"score": 0.019876248858286226, "phrase": "p_systems"}, {"score": 0.007141338634616953, "phrase": "register_machines"}, {"score": 0.0065882569264434036, "phrase": "recursively_enumerable_set"}, {"score": 0.004641351004344458, "phrase": "small_numbers"}, {"score": 0.00454019648854141, "phrase": "present_several_results"}, {"score": 0.004400188079089631, "phrase": "non-negative_integers"}, {"score": 0.004218602458288531, "phrase": "number_m"}, {"score": 0.004066416005586085, "phrase": "natural_numbers"}, {"score": 0.003668768542734106, "phrase": "original_paper"}, {"score": 0.0033465923623290034, "phrase": "general_results"}, {"score": 0.002888747754856871, "phrase": "upper_bounds"}, {"score": 0.00275383721396097, "phrase": "k-dimensional_vectors"}, {"score": 0.0026838147966444783, "phrase": "partial_recursive_function"}, {"score": 0.0025868521085189843, "phrase": "computational_power"}, {"score": 0.002421040737931745, "phrase": "finite_sets"}, {"score": 0.002216336059488137, "phrase": "computational_completeness"}, {"score": 0.002175913488493802, "phrase": "arbitrary_number"}, {"score": 0.0021049977753042253, "phrase": "tissue_p_systems"}], "paper_keywords": [""], "paper_abstract": "We consider P systems with symport/antiport rules and small numbers of symbols and membranes and present several results for P systems with symport/antiport rules simulating register machines with the number of registers depending on the numbers of symbols and the number m of membranes. For instance, any recursively enumerable set of natural numbers can be generated (accepted) by systems with 8 > 2 symbols and m >= 1 membranes such that m + s >= 6. In particular, the result of the original paper [17] proving universality for three symbols and four membranes is improved (e.g., three symbols and three membranes are sufficient). The general results that P systems with symport/antiport rules with s symbols and m membranes are able to simulate register machines with max {m (s - 2), (m - 1) (s - 1)} registers also allows us to give upper bounds for the numbers s and m needed to generate/accept any recursively enumerable set of k-dimensional vectors of non-negative integers or to compute any partial recursive function f : N-alpha - N-beta. Finally, we also study the computational power of P systems with symport/antiport rules and only one symbol: with one membrane, we can exactly generate the family of finite sets of non-negative integers; with one symbol and two membranes, we can generate at least all semilinear sets. The most interesting open question is whether P systems with symport/antiport rules and only one symbol can gain computational completeness (even with an arbitrary number of membranes) as it was shown for tissue P systems in [1].", "paper_title": "Symbol/membrane complexity of P systems with symport/antiport rules", "paper_id": "WOS:000235807300007"}