{"auto_keywords": [{"score": 0.04083167311579895, "phrase": "selfish_behavior"}, {"score": 0.03542065657821509, "phrase": "atomic_congestion_games"}, {"score": 0.00481495049065317, "phrase": "linear_atomic_congestion_games"}, {"score": 0.004755054742217193, "phrase": "congestion_games"}, {"score": 0.004508661664944657, "phrase": "possible_strategies"}, {"score": 0.003977907771686101, "phrase": "previous_work"}, {"score": 0.0038673406001234535, "phrase": "system_performance"}, {"score": 0.00347657813672945, "phrase": "original_game"}, {"score": 0.0033377940531761985, "phrase": "linear_latency_functions"}, {"score": 0.0033169383771576343, "phrase": "present_both_negative_and_positive_results"}, {"score": 0.0032449610741097992, "phrase": "optimal_system_performance"}, {"score": 0.003134986603941304, "phrase": "positive_side"}, {"score": 0.0029722900280316216, "phrase": "linear_congestion_games"}, {"score": 0.0028895932204402986, "phrase": "total_latency"}, {"score": 0.0026055251533586804, "phrase": "system_behavior"}, {"score": 0.002525074485615743, "phrase": "total_disutility"}, {"score": 0.00241658945942583, "phrase": "optimal_total_latency"}, {"score": 0.0023939545398857518, "phrase": "existential_results"}, {"score": 0.002255431275670053, "phrase": "convex_quadratic_programs"}, {"score": 0.0022413233627905696, "phrase": "similar_questions"}, {"score": 0.0021789194955896102, "phrase": "non-atomic_congestion_games"}, {"score": 0.0021049977753042253, "phrase": "first_study"}], "paper_keywords": ["Congestion games", " Nash equilibria", " taxes"], "paper_abstract": "We study congestion games where players aim to access a set of resources. Each player has a set of possible strategies and each resource has a function associating the latency it incurs to the players using it. Players are non cooperative and each wishes to follow a strategy that minimizes her own latency with no regard to the global optimum. Previous work has studied the impact of this selfish behavior on system performance. In this article, we study the question of how much the performance can be improved if players are forced to pay taxes for using resources. Our objective is to extend the original game so that selfish behavior does not deteriorate performance. We consider atomic congestion games with linear latency functions and present both negative and positive results. Our negative results show that optimal system performance cannot be achieved even in very simple games. On the positive side, we show that there are ways to assign taxes that can improve the performance of linear congestion games by forcing players to follow strategies where the total latency suffered is within a factor of 2 of the minimum possible; this result is shown to be tight. Furthermore, even in cases where in the absence of taxes the system behavior may be very poor, we show that the total disutility of players (latency plus taxes) is not much larger than the optimal total latency. Besides existential results, we show how to compute taxes in time polynomial in the size of the game by solving convex quadratic programs. Similar questions have been extensively studied in the model of non-atomic congestion games. To the best of our knowledge, this is the first study of the efficiency of taxes in atomic congestion games.", "paper_title": "Taxes for Linear Atomic Congestion Games", "paper_id": "WOS:000288825000013"}