{"auto_keywords": [{"score": 0.04951471866031507, "phrase": "collagen_stability"}, {"score": 0.0339632599049277, "phrase": "different_temperatures"}, {"score": 0.00481495049065317, "phrase": "computer-aided_models"}, {"score": 0.004720751439584719, "phrase": "collagen"}, {"score": 0.004610058444728656, "phrase": "whole_human_body"}, {"score": 0.00443133501650381, "phrase": "osteogenesis_imperfecta"}, {"score": 0.004396426822203258, "phrase": "ehlers-danlos_syndrome"}, {"score": 0.0042426974826585695, "phrase": "collagen_triple_helix"}, {"score": 0.003919973783578995, "phrase": "computational_methods"}, {"score": 0.0038737214010638745, "phrase": "collagen's_structure"}, {"score": 0.0034129490818185595, "phrase": "large_number"}, {"score": 0.0033860360186761533, "phrase": "collagen-like_peptides"}, {"score": 0.0033328427701162368, "phrase": "first_markov_chain_model"}, {"score": 0.003140680985599885, "phrase": "amino_acid_sequence"}, {"score": 0.002901538668877986, "phrase": "great_variance"}, {"score": 0.002867268370615848, "phrase": "main_motif"}, {"score": 0.002566255769251419, "phrase": "artificial_neural_network"}, {"score": 0.0021049977753042253, "phrase": "fast_and_accurate_predictions"}], "paper_keywords": ["Markov chain model", " linear discriminant analysis", " artificial neural network", " amino acid sequence", " collagen stability"], "paper_abstract": "Collagen is the most abundant protein in the whole human body and its instability is involved in many important diseases, such as Osteogenesis imperfecta, Ehlers-Danlos syndrome, and collagenopathy. The stability of the collagen triple helix is strictly related to its amino acid sequence, especially the main Gly-X-Y motif. Many groups have used computational methods to investigate collagen's structure and the relationship between its stability and structure. In this study, we initially reviewed the most important computational methods that have been applied in this field. We then assembled data on a large number of collagen-like peptides to build the first Markov chain model for predicting the stability of the collagen at different temperatures, simply by analyzing the amino acid sequence. We used the literature to assemble a set of 102 peptides and their relative melting temperatures were determined experimentally, indicating a great variance with the main motif of the collagen. This dataset was then split in two classes, stable and unstable, according to their melting temperatures and the dataset was then used to build artificial neural network (ANN) models to predict collagen stability. We built models to predict stability at temperatures of 38 degrees C, 35 degrees C, 30 degrees C, and 25 degrees C degrees, and all models had an accuracy between 82% and 92%. Several cross-validation procedures were performed to validate the model. This method facilitates fast and accurate predictions of collagen stability at different temperatures.", "paper_title": "Review of Computer-Aided Models for Predicting Collagen Stability", "paper_id": "WOS:000298590400008"}