{"auto_keywords": [{"score": 0.04819817381511665, "phrase": "top_management_support"}, {"score": 0.005340154260891569, "phrase": "multiple-project_environment"}, {"score": 0.00481495049065317, "phrase": "multiple-project_environments"}, {"score": 0.004184921610672245, "phrase": "implicit_or_explicit_assumptions"}, {"score": 0.00396050388346298, "phrase": "entire_life"}, {"score": 0.0038239757564863057, "phrase": "previous_research"}, {"score": 0.0036370297611938796, "phrase": "'single_project"}, {"score": 0.00354700018079049, "phrase": "contemporary_organisational_settings"}, {"score": 0.0032571885279065126, "phrase": "previous_assumptions"}, {"score": 0.002719055901632759, "phrase": "enterprise_resource_planning_system"}, {"score": 0.0026252106881752067, "phrase": "prominent_international_organisation"}, {"score": 0.002534596206835737, "phrase": "actor_network_theory"}, {"score": 0.0024842242921857705, "phrase": "different_aspects"}, {"score": 0.0021369416775353107, "phrase": "contemporary_organisational_setting"}, {"score": 0.0021049977753042253, "phrase": "important_implications"}], "paper_keywords": ["IS project management", " top management support", " multiple projects", " qualitative case study", " Actor Network Theory"], "paper_abstract": "Top management support has generally been considered the most critical factor for the success of IS projects. Typically, there have developed implicit or explicit assumptions that top management support has to be constant and consistent during the entire life of an IS implementation project. However, previous research investigating this issue has been based mainly on a 'single project' perspective, although contemporary organisational settings have increasingly involved many projects taking place simultaneously. Such multiple-project environments bring into question the feasibility of the previous assumptions and invite revisiting them. This paper aims to do this by examining the materialisation of top management support in a multiple-project environment. To this end, it investigates the interactions between a project to implement an Enterprise Resource Planning system and other projects and programmes in a prominent international organisation. It applies a framework from Actor Network Theory to explore the different aspects of what is involved in being in a multiple-project environment and the nature of the materialisation of top management support. The findings unravel some of the complexity surrounding top management support in this contemporary organisational setting. Some important implications for theory and practice are highlighted and discussed.", "paper_title": "Top management support in multiple-project environments: an in-practice view", "paper_id": "WOS:000317572500003"}