{"auto_keywords": [{"score": 0.049038638823551965, "phrase": "shannon_feedback"}, {"score": 0.007574250573993217, "phrase": "output_feedback"}, {"score": 0.005977011812877667, "phrase": "mimo_ics"}, {"score": 0.0056703009095743, "phrase": "dof_region"}, {"score": 0.00481495049065317, "phrase": "freedom_region"}, {"score": 0.004751889650408546, "phrase": "mimo_interference_channel"}, {"score": 0.004128317208406523, "phrase": "channel_matrices"}, {"score": 0.003618025880609613, "phrase": "shannon"}, {"score": 0.00304737045343781, "phrase": "dof_gains"}, {"score": 0.002981026404927824, "phrase": "new_interference_alignment_scheme"}, {"score": 0.0029289895726382653, "phrase": "transmitter_cooperation"}, {"score": 0.0028151944356239952, "phrase": "delayed_csit"}, {"score": 0.002705808393126695, "phrase": "interference_alignment"}, {"score": 0.002646880721119838, "phrase": "previously_known_schemes"}, {"score": 0.002589239801371804, "phrase": "csit."}, {"score": 0.0025328377393370642, "phrase": "output-only_feedback"}], "paper_keywords": ["Degrees of freedom (DoF)", " delayed channel state information at the transmitters (CSIT)", " feedback", " interference alignment (IA)", " interference channel (IC)", " multiple-input multiple-output (MIMO)", " Shannon feedback"], "paper_abstract": "The two-user multiple-input multiple-output (MIMO) fast-fading interference channel (IC) with an arbitrary number of antennas at each of the four terminals is studied under the settings of Shannon feedback and output feedback, wherein channel matrices and outputs, or just the channel outputs, respectively, are available to the transmitters with a delay. While for most numbers of antennas at the four terminals, the degree-of-freedom (DoF) regions with Shannon feedback are equal to that with just delayed channel state information (CSIT), it is shown that for the rest of the MIMO ICs, the DoF region with Shannon feedback is strictly larger than the DoF region with just delayed CSIT. To realize these DoF gains with Shannon feedback, a new interference alignment scheme is obtained wherein transmitter cooperation made possible by output feedback (in addition to delayed CSIT) is employed to effect a more efficient form of interference alignment than is feasible with previously known schemes that use just delayed CSIT. The DoF region for output-only feedback is also obtained for all but a class of MIMO ICs that satisfy one of two inequalities involving the numbers of antennas. Moreover, the DoF region for Shannon feedback is shown to be applicable to two limited Shannon feedback settings where the transmitters have knowledge only of certain channel matrices and certain outputs with delay.", "paper_title": "The Degrees-of-Freedom Region of the MIMO Interference Channel With Shannon Feedback", "paper_id": "WOS:000321928500007"}