{"auto_keywords": [{"score": 0.04987996209567256, "phrase": "cardinality_constraint"}, {"score": 0.007461303525977055, "phrase": "optimal_solutions"}, {"score": 0.004448803829591984, "phrase": "receiving-transmitting_antennas"}, {"score": 0.004411912530067, "phrase": "on-board_switch"}, {"score": 0.0041968742372965806, "phrase": "negligible_time"}, {"score": 0.004127539918955547, "phrase": "switch_configurations"}, {"score": 0.00404247403494972, "phrase": "entire_traffic_matrix"}, {"score": 0.003983969024275096, "phrase": "exact_method"}, {"score": 0.003766100169756294, "phrase": "general_case"}, {"score": 0.0037038559698628626, "phrase": "known_milp_formulation"}, {"score": 0.0036731192906738802, "phrase": "extended_formulation"}, {"score": 0.003627490127517863, "phrase": "column_generation_method"}, {"score": 0.0035675286006730494, "phrase": "derived_pricing_problem"}, {"score": 0.003545298532373804, "phrase": "polynomial_time_algorithm"}, {"score": 0.0035012516370266544, "phrase": "k-cardinality_assignment_problem"}, {"score": 0.0034649627563898017, "phrase": "lower_bound_method"}, {"score": 0.003443369590223299, "phrase": "two-phase_branch"}, {"score": 0.003234678797260244, "phrase": "older_method"}, {"score": 0.0031878272443845793, "phrase": "final_computational_experiments"}, {"score": 0.0031028110934631582, "phrase": "scope"}, {"score": 0.003057660123064073, "phrase": "commonly_used_devices"}, {"score": 0.002951193268506483, "phrase": "communications_requests"}, {"score": 0.0029327924196713385, "phrase": "efficient_manner"}, {"score": 0.0029023781998764957, "phrase": "transmissions_requests"}, {"score": 0.0028782734189316856, "phrase": "earth_stations"}, {"score": 0.0028188812188372505, "phrase": "traffic_matrix"}, {"score": 0.0027492216000914605, "phrase": "satellite-switched_time-division-multiple-access"}, {"score": 0.00269810584577589, "phrase": "traffic_matrix_entries"}, {"score": 0.0026314229275748754, "phrase": "different_frame"}, {"score": 0.0026150106348204255, "phrase": "single_time_slot"}, {"score": 0.002487335212683516, "phrase": "satellite_antennas"}, {"score": 0.0023906843193813774, "phrase": "next_one"}, {"score": 0.0023511186493174424, "phrase": "completion_time"}, {"score": 0.0023315814738260614, "phrase": "maximum_transmission_time"}, {"score": 0.0023073876214214995, "phrase": "crucial_decision"}, {"score": 0.0022834442439757198, "phrase": "total_satellite"}, {"score": 0.002208478729770911, "phrase": "effective_exact_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["SS/TDMA", " Satellite communications", " Branch and price", " Combinatorial optimization"], "paper_abstract": "In this paper, we consider a square n x n traffic matrix D and a satellite having l <= n receiving and transmitting antennas. Transmissions are allowed by interconnecting pairs of receiving-transmitting antennas, through an on-board switch. We also assume that no preemption of the communications is allowed, and that changing the configuration of the switch requires a negligible time. We ask for a set of switch configurations that minimizes the total time occurring for transmitting the entire traffic matrix. In the literature, an exact method has been already proposed for the SS/TDMA optimization problem without cardinality constraint (i.e. for instances having l = n), but only heuristics have been proposed for the general case. In this paper, from a known MILP formulation we derive an extended formulation, and we use a column generation method to obtain its LP-relaxation. We address the derived pricing problem through a polynomial time algorithm based on solvers for the k-cardinality assignment problem. We insert this lower bound method in a two-phase branch and price algorithm in order to obtain the optimal solutions. To compare our new exact method with the one proposed in literature to solve the SS/TDMA optimization problem without cardinality constraint, we extend this older method to consider the cardinality constraint. The final computational experiments, comparing our new method with other already known methods, show the efficiency of our algorithms. Scope and purpose: Satellites are the commonly used devices to wirelessly connect two distant earth points. Since satellites are very expansive devices, it is important to schedule the communications requests in an efficient manner. A satellite receives transmissions requests between pairs of earth stations, and these requests can be described by a traffic matrix. One method used in practice to satisfy these requests is called Satellite-Switched Time-Division-Multiple-Access (SS/TDMA) which requires to partition the traffic matrix entries in sets called frames and to transmit the elements of each different frame in a single time slot. Each frame must contain at most one communication involving the same earth station and the number of its nonzero entries must be at most equal to the number of satellite antennas. Since a satellite has to complete the transmission of a frame before starting the transmission of the next one, each frame is associated with a completion time equal to the maximum transmission time of its entries. A crucial decision, to minimize the total satellite used time, is how to partition the given traffic matrix. Our aim is to provide an effective exact algorithm for finding optimal solutions to the SS/TDMA problem and to compare it with other methods already known in the literature. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A branch and price algorithm for the SS/TDMA problem with cardinality constraint", "paper_id": "WOS:000311533900007"}