{"auto_keywords": [{"score": 0.03299364983449957, "phrase": "gsm"}, {"score": 0.00481495049065317, "phrase": "gaas_phemt"}, {"score": 0.004574247691703376, "phrase": "quad-band_gsm_and_umts_handsets_applications"}, {"score": 0.003683728206476548, "phrase": "dc"}, {"score": 0.0035390378585554547, "phrase": "high_linearity"}, {"score": 0.0034395119150793787, "phrase": "series-shunt_switch_structure"}, {"score": 0.0033811403330431897, "phrase": "dc_boost_circuit"}, {"score": 0.0032302647179383915, "phrase": "measured_insertion_loss"}, {"score": 0.0027374647587075935, "phrase": "umts_arms"}, {"score": 0.0023064582783867645, "phrase": "rf_switches_module"}, {"score": 0.0021908807203548345, "phrase": "digital_module"}, {"score": 0.0021413855297794946, "phrase": "gold_bonding_wires"}], "paper_keywords": ["GSM", " UMTS", " Single-pole nine-throw (SP9T)", " pHEMT", " Encoder", " DC boost"], "paper_abstract": "A multi-band/multi-mode single-pole nine-throw (SP9T) switch for GSM/UMTS (global system for mobile communications/universal mobile telecommunication system) systems is demonstrated. The switch consists of a GaAs 0.5 mu m pseudomorphic high-electron mobility transistor (pHEMT) radio frequency (RF) switches module and Si complementary metal-oxide-semiconductor (COMS) digital module with an encoder and a DC boost circuit. High isolation and high linearity are achieved by a series-shunt switch structure and the DC boost circuit, respectively. The switch shows a measured insertion loss of 0.4 dB at 0.8 GHz for GSM transmit arms, 0.7 dB at 0.9 GHz and 0.9 dB at 1.8 GHz for GSM receive arms, and 0.6 dB at 1.8 GHz for UMTS arms. The switch introduces 2nd and 3rd harmonic suppression levels less than -64 dBc at 37 dBm input power. Isolations between transmit and receive terminals are more than 48 dB when one transmit arm is activated. The size of the RF switches module is 1.5 mmx1.1 mm, and the size of the digital module is 1.3 mmx0.63 mm with gold bonding wires connecting these two modules.", "paper_title": "GaAs pHEMT multi-band/multi-mode SP9T switch for quad-band GSM and UMTS handsets applications", "paper_id": "WOS:000289803000007"}