{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user-centred_design"}, {"score": 0.010514349881698404, "phrase": "e-government_services"}, {"score": 0.00466016686289196, "phrase": "user_involvement"}, {"score": 0.00428451995524549, "phrase": "e-government_uptake"}, {"score": 0.004166129325245761, "phrase": "portnl"}, {"score": 0.003939055039467881, "phrase": "netherlands"}, {"score": 0.003741712498615481, "phrase": "inevitable_tension"}, {"score": 0.0034398445347109396, "phrase": "structured_approach"}, {"score": 0.0033919477901198716, "phrase": "interactive_systems"}, {"score": 0.003313592421224647, "phrase": "potential_users"}, {"score": 0.0031770714776989282, "phrase": "design_process"}, {"score": 0.002826562521633885, "phrase": "users'_and_governments'_contradictory_visions"}, {"score": 0.002722758109991685, "phrase": "governments'_mandate"}, {"score": 0.0025028892126605124, "phrase": "differing_commitments"}], "paper_keywords": ["user-centred design", " e-government", " electronic services", " adoption", " service design"], "paper_abstract": "The absence of user involvement in the design and development of e-government is often cited as a reason for the lag in e-government uptake. Drawing on our involvement with PortNL, an integrated e-government service for expatriates in the Netherlands, we explain this absence as a result of an inevitable tension between user-centred design - the most common way to involve users - and e-government. User-centred design is a structured approach to produce interactive systems by involving users or potential users and addressing their needs at every stage of the design process. Governments, while concerned with their users' needs, have their own considerable needs to address. We outline four manifestations of the tension between user-centred design and e-government: users' and governments' contradictory visions of the tasks to be accomplished; governments' mandate to design for exceptions, as well as for the mainstream, governments' and users' differing commitments to the law and governments' and users' contradicting desires about the nature of their relationship. We conclude with observations about the design and development of e-government services to improve their quality and, thus, increase their uptake.", "paper_title": "The tension between user-centred design and e-government services", "paper_id": "WOS:000300849400006"}