{"auto_keywords": [{"score": 0.045655676553107725, "phrase": "input_signal"}, {"score": 0.042873545961637505, "phrase": "information_content"}, {"score": 0.02322730111336099, "phrase": "neural_coding"}, {"score": 0.004638136142210615, "phrase": "stochastic_resonance"}, {"score": 0.004509780213218666, "phrase": "random_fluctuations"}, {"score": 0.004467785611058897, "phrase": "neuron's_membrane_voltage"}, {"score": 0.004412397783369937, "phrase": "neural_representations"}, {"score": 0.004344123393283444, "phrase": "neuronal_heterogeneity"}, {"score": 0.004197599791067716, "phrase": "neuron_parameters"}, {"score": 0.0037751107742174848, "phrase": "neuronal_population"}, {"score": 0.002652693384545025, "phrase": "signal_timing"}, {"score": 0.0026115760183617947, "phrase": "signal_amplitude"}, {"score": 0.0024002822777025906, "phrase": "complementary_aspects"}, {"score": 0.00223379991739614, "phrase": "population_coding"}, {"score": 0.0021049977753042253, "phrase": "underlying_mechanisms"}], "paper_keywords": [""], "paper_abstract": "Noise and heterogeneity are both known to benefit neural coding. Stochastic resonance describes how noise, in the form of random fluctuations in a neuron's membrane voltage, can improve neural representations of an input signal. Neuronal heterogeneity refers to variation in any one of a number of neuron parameters and is also known to increase the information content of a population. We explore the interaction between noise and heterogeneity and find that their benefits to neural coding are not independent. Specifically, a neuronal population better represents an input signal when either noise or heterogeneity is added, but adding both does not always improve representation further. To explain this phenomenon, we propose that noise and heterogeneity operate using two shared mechanisms: (1) temporally desynchronizing the firing of neurons in the population and (2) linearizing the response of a population to a stimulus. We first characterize the effects of noise and heterogeneity on the information content of populations of either leaky integrate-and-fire or FitzHugh-Nagumo neurons. We then examine how the mechanisms of desynchronization and linearization produce these effects, and find that they work to distribute information equally across all neurons in the population in terms of both signal timing (desynchronization) and signal amplitude (linearization). Without noise or heterogeneity, all neurons encode the same aspects of the input signal; adding noise or heterogeneity allows neurons to encode complementary aspects of the input signal, thereby increasing information content. The simulations detailed in this letter highlight the importance of heterogeneity and noise in population coding, demonstrate their complex interactions in terms of the information content of neurons, and explain these effects in terms of underlying mechanisms.", "paper_title": "The Competing Benefits of Noise and Heterogeneity in Neural Coding", "paper_id": "WOS:000338596100003"}