{"auto_keywords": [{"score": 0.04752155296993491, "phrase": "strategic_flexibility"}, {"score": 0.015052078478730834, "phrase": "external_social_networks"}, {"score": 0.008161024979836775, "phrase": "qm"}, {"score": 0.007477352685864453, "phrase": "iso_standards"}, {"score": 0.006230627505406315, "phrase": "tqm"}, {"score": 0.00481495049065317, "phrase": "external_managerial_social_networks"}, {"score": 0.004710489616113198, "phrase": "quality_management"}, {"score": 0.004283280680222718, "phrase": "wide_variety"}, {"score": 0.004221072004655573, "phrase": "managing_quality"}, {"score": 0.004025040955430234, "phrase": "different_alternatives"}, {"score": 0.003754731210715724, "phrase": "main_purpose"}, {"score": 0.0035283277900278174, "phrase": "iso"}, {"score": 0.003351987298847214, "phrase": "comparative_anova_analysis"}, {"score": 0.0032196786163178107, "phrase": "different_regressions"}, {"score": 0.0029813748433158032, "phrase": "observed_group"}, {"score": 0.002959617637433, "phrase": "findings_-_paper_results"}, {"score": 0.0027911639820564897, "phrase": "external_managerial_networks"}, {"score": 0.0026419338604879404, "phrase": "external_social_networks_influences"}, {"score": 0.002528300562452668, "phrase": "negative_effect"}, {"score": 0.002419542935774618, "phrase": "positive_effect"}, {"score": 0.0022403279163829516, "phrase": "qm_alternatives"}, {"score": 0.002175594509651082, "phrase": "new_perspective"}, {"score": 0.0021049977753042253, "phrase": "managerial_networks"}], "paper_keywords": ["Quality management", " Strategic management", " Networking", " Managers"], "paper_abstract": "Purpose - The paper aims to study the effect of external managerial social networks on strategic flexibility for a quality management (QM) perspective. External social networks can affect strategic flexibility positively. QM also contributes to developing these networks. However, there is currently a wide variety of alternatives for managing quality in organizations, such as ISO standards or the European Foundation for Quality Management model. Thus, different alternatives will influence the external social networks differently in ways that have repercussions for strategic flexibility. Testing these differences is the main purpose of this paper. Design/methodology/approach - A total of 203 valid responses were classified in three groups: non-QM, ISO, and total quality management (TQM) firms. Then, a comparative ANOVA analysis was performed to test differences among groups. Finally, different regressions were run to test the effects of external social networks (range, size and strength) on strategic flexibility depending of the observed group. Findings - Paper results show that, depending on which QM initiative is implemented in the organization, the effects of external managerial networks on strategic flexibility vary. Thus, in organizations without QM, the range of external social networks influences strategic flexibility negatively, whereas in organizations with ISO standards, this negative effect disappears. In organizations with TQM, the paper finds the positive effect of both size and strength of relations in the networks. Practical implications - The paper facilitates how to differentiate QM alternatives depending on their observed behavior. Originality/value - A new perspective (QM) is observed to test how managerial networks affect strategic flexibility.", "paper_title": "Managerial networks and strategic flexibility: a QM perspective", "paper_id": "WOS:000285567500005"}