{"auto_keywords": [{"score": 0.049193598318116295, "phrase": "apneic_events"}, {"score": 0.00481495049065317, "phrase": "fuzzy_reasoning"}, {"score": 0.00466016686289196, "phrase": "sleep_apnea-hypopnea_syndrome"}, {"score": 0.004406260054779782, "phrase": "disrupted_breathing"}, {"score": 0.003812299519486331, "phrase": "respiratory_signals"}, {"score": 0.003741712498615481, "phrase": "entire_night's_sleep"}, {"score": 0.0035376693476114733, "phrase": "complex_task"}, {"score": 0.0033761303704612734, "phrase": "digitising_signals"}, {"score": 0.003313592421224647, "phrase": "expert_criteria"}, {"score": 0.0031182092708983184, "phrase": "fuzzy-logic-based_automated_system"}, {"score": 0.0026722904884984348, "phrase": "ultimate_goal"}, {"score": 0.002300734266971646, "phrase": "receiver_operating_curve_index"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sleep apnea-hypopnea syndrome", " Intelligent systems", " Fuzzy reasoning"], "paper_abstract": "The sleep apnea/hypopnea syndrome is a very common sleep disorder, characterised by disrupted breathing during sleep. Depending on the extent of the disruptions to sleep, these are classified as apneas or hypopneas. In order to locate these apneic events an analysis of respiratory signals recorded for an entire night's sleep is necessary. However, identifying and classifying apneic events is a complex task, given the error associated with the process for digitising signals, variability in expert criteria and the complexity of the signals themselves. This article describes a fuzzy-logic-based automated system for detecting apneic events and classifying them as apneas or hypopneas. The aim is to equip this system with mechanisms for dealing with imprecision and reasoning affected by uncertainty. The ultimate goal was to assist the physician in diagnosing the sleep apnea/hypopnea syndrome. Results in terms of locating events in the polysomnogrann showed sensitivity and specificity of 0.87 and 0.89, respectively. A receiver operating curve index of 0.88 was obtained for the classification of events as apneas or hypopneas. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy reasoning used to detect apneic events in the sleep apnea-hypopnea syndrome", "paper_id": "WOS:000264528600056"}