{"auto_keywords": [{"score": 0.03882201257057183, "phrase": "semiempirical_molecular_orbital_calculation"}, {"score": 0.004076352180903171, "phrase": "planar-conjugated_compounds"}, {"score": 0.003832423454781517, "phrase": "docking_simulation"}, {"score": 0.0035808664384880213, "phrase": "possible_binding_modes"}, {"score": 0.0034294219963679857, "phrase": "automated_docking"}, {"score": 0.0033457659530207306, "phrase": "crystal_structure"}, {"score": 0.003244050414264445, "phrase": "binding_energy"}, {"score": 0.0031260524791486347, "phrase": "activation_energies"}, {"score": 0.0028848643090508205, "phrase": "metabolic_probability"}, {"score": 0.002797121441432477, "phrase": "binding_and_activation_energies"}, {"score": 0.002487296495786493, "phrase": "primary_preferred_site"}, {"score": 0.0024416087858984644, "phrase": "possible_metabolic_sites"}, {"score": 0.00230950802983053, "phrase": "secondary_preferred_site"}, {"score": 0.002198084195030656, "phrase": "qualitative_prediction"}, {"score": 0.0021710766932077972, "phrase": "drug_metabolism"}], "paper_keywords": [""], "paper_abstract": "A kinetic, reactivity-binding model has been proposed to predict the regioselectivity of substrates meditated by the CYP1A2 enzyme, which is responsible for the metabolism of planar-conjugated compounds such as caffeine. This model consists of a docking simulation for binding energy and a semiempirical molecular orbital calculation for activation energy. Possible binding modes of CYP1A2 substrates were first examined using automated docking based on the crystal structure of CYP1A2, and binding energy was calculated. Then, activation energies for CYP1A2-mediated metabolism reactions were calculated using the semiempirical molecular orbital calculation, AMI. Finally, the metabolic probability obtained from two energy terms, binding and activation energies, was used for predicting the most probable metabolic site. This model predicted 8 out of 12 substrates accurately as the primary preferred site among all possible metabolic sites, and the other four substrates were predicted into the secondary preferred site. This method can be applied for qualitative prediction of drug metabolism mediated by CYP1A2 and other CYP450 family enzymes, helping to develop drugs efficiently.", "paper_title": "Regioselectivity prediction of CYP1A2-mediated phase I metabolism", "paper_id": "WOS:000256240400012"}