{"auto_keywords": [{"score": 0.03009264010414389, "phrase": "phantom_sensation"}, {"score": 0.014734087605252905, "phrase": "vibro-tactile_feedback"}, {"score": 0.009426125978617726, "phrase": "user_experience"}, {"score": 0.008940141600491407, "phrase": "real-world_application"}, {"score": 0.00481495049065317, "phrase": "tactile_phantom_sensations"}, {"score": 0.00467905143301368, "phrase": "mobile_interaction"}, {"score": 0.004258843584164121, "phrase": "interaction_device"}, {"score": 0.0041725881174377345, "phrase": "user_body"}, {"score": 0.003892126266260425, "phrase": "\"out_of_the_body\"_experience"}, {"score": 0.0037207397635410327, "phrase": "handheld_object"}, {"score": 0.0035423376631308567, "phrase": "practical_applicability"}, {"score": 0.0034990853199511982, "phrase": "theoretical_result"}, {"score": 0.00347054319869429, "phrase": "mobile_tactile_interaction"}, {"score": 0.0031714880645482496, "phrase": "actual_handheld_smart_phone"}, {"score": 0.0029824560656987855, "phrase": "first_time"}, {"score": 0.002933973181012572, "phrase": "third_experiment"}, {"score": 0.0021751997984619585, "phrase": "small_additional_cost"}, {"score": 0.0021049977753042253, "phrase": "conventional_single_vibrator-based_device"}], "paper_keywords": ["Saltation", " Funneling", " Phantom sensation", " Illusory feedback", " Vibro-tactile feedback", " User experience"], "paper_abstract": "Funneling and saltation are the two major perceptual illusion techniques for vibro-tactile feedback. They can be used to minimize the number of vibrators on the interaction device in contact with the user body and thereby build a less cumbersome and less expensive feedback device. Recently, these techniques have been found to elicit an \"out of the body\" experience, i.e., phantom tactile sensations indirectly felt from the handheld object (external to the body). This paper explores the practical applicability of this theoretical result to mobile tactile interaction. Two psychophysical experiments were first conducted to validate the effects of \"out of the body\" funneling and saltation on an actual handheld smart phone along (1) 1D and (2) when extended, for the first time, to 2D. A third experiment was run to evaluate user experience, applying phantom sensation based on vibro-tactile feedback, using funneling, to a real-world application. Experimental results have confirmed the same \"out of the body\" 1D illusory effects on an actual mobile device. In addition, a 2D modulated phantom sensation with a resolution of 5 x 3 on a 3.5-inch display space was achieved through saltation and funneling. Finally, we showed that the phantom sensation does significantly improve the user experience for a real-world application with a small additional cost of a few more vibrators, compared to a conventional single vibrator-based device.", "paper_title": "Extending \"out of the body\" tactile phantom sensations to 2D and applying it to mobile interaction", "paper_id": "WOS:000366591500005"}