{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "pervasive_availability"}, {"score": 0.004555371402128666, "phrase": "new_public_health_data_collection_capability"}, {"score": 0.004442032546224076, "phrase": "commercial_efforts"}, {"score": 0.0043533862892678864, "phrase": "sensor-based_collection"}, {"score": 0.004245051445971095, "phrase": "personal_fitness"}, {"score": 0.004202472962684885, "phrase": "healthcare_feedback_purposes"}, {"score": 0.003975781274672803, "phrase": "detailed_investigation"}, {"score": 0.003780286517897356, "phrase": "public_health_data_collection_purposes"}, {"score": 0.003417565253539315, "phrase": "full_detailed_data"}, {"score": 0.0030431198971423937, "phrase": "specific_route"}, {"score": 0.0026688629249775925, "phrase": "new_type"}, {"score": 0.0026420518944303716, "phrase": "public_health_information_system"}, {"score": 0.0026023381988430666, "phrase": "aggregate_population_health_data"}, {"score": 0.0024617483174454113, "phrase": "sensor_capabilities"}, {"score": 0.002202894673025544, "phrase": "intervention_capabilities"}, {"score": 0.0021697677572213086, "phrase": "emerging_systems"}, {"score": 0.0021263705039915198, "phrase": "detailed_evaluation"}, {"score": 0.0021049977753042253, "phrase": "anonymity_preservation_characteristics"}], "paper_keywords": ["computer applications", " information dissemination", " personal information systems"], "paper_abstract": "The pervasive availability of smartphones and their connected external sensors or wearable devices can provide a new public health data collection capability. Current research and commercial efforts have concentrated on sensor-based collection of health data for personal fitness and healthcare feedback purposes. However, to date there has not been a detailed investigation of how such smartphones and sensors can be utilized for public health data collection purposes. Public health data have the characteristic of being capturable while still not infringing upon privacy, as the full detailed data of individuals are not needed but rather only anonymized, aggregate, de-identified, and non-unique data for an individual. For example, rather than details of physical activity including specific route, just total caloric burn over a week or month could be submitted, thereby strongly assisting non-re-identification. In this paper we introduce, prototype, and evaluate a new type of public health information system to provide aggregate population health data capture and public health intervention capabilities via utilizing smartphone and sensor capabilities, while fully maintaining the anonymity and privacy of each individual. We consider in particular the key aspects of privacy, anonymity, and intervention capabilities of these emerging systems and provide a detailed evaluation of anonymity preservation characteristics.", "paper_title": "Smartphone-based public health information systems: Anonymity, privacy and intervention", "paper_id": "WOS:000368338400015"}