{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_thoughts"}, {"score": 0.013573187887020326, "phrase": "material_world"}, {"score": 0.009099312787110053, "phrase": "fourth_crisis"}, {"score": 0.0046544807197808095, "phrase": "purpose_-_the_paper"}, {"score": 0.004499334809770281, "phrase": "systemic_yoyo_structure"}, {"score": 0.0043863636475983845, "phrase": "human_way"}, {"score": 0.004012751049253625, "phrase": "underlying_structure"}, {"score": 0.003503497128638099, "phrase": "authors'_understanding"}, {"score": 0.003400984514637656, "phrase": "actual_infinities"}, {"score": 0.00337224813954299, "phrase": "potential_infinities"}, {"score": 0.0030847461428168614, "phrase": "hidden_contradictions"}, {"score": 0.0030071857666598193, "phrase": "modern_mathematics"}, {"score": 0.002857849698346116, "phrase": "authors'_yoyo_model"}, {"score": 0.0025810006125483835, "phrase": "new_crisis"}, {"score": 0.0024736973328071026, "phrase": "first_time"}, {"score": 0.0024320326084093465, "phrase": "human_thought"}, {"score": 0.0023607968604629393, "phrase": "economic_entity"}, {"score": 0.0023210293050850276, "phrase": "common_structure"}], "paper_keywords": ["cybernetics", " critical thinking", " set theory", " mathematics"], "paper_abstract": "Purpose - The paper aims to show the existence of the systemic yoyo structure in human thoughts so that the human way of thinking is proven to have the same structure as that of the material world. Design/methodology/approach - Parallel comparison is used to reveal the underlying structure existing in human thoughts. Findings - After highlighting all the relevant ideas and concepts, which are behind each and every crisis in the foundations of mathematics, it becomes clear that some difficulties in the authors' understanding of nature are originated from confusing actual infinities with potential infinities, and vice versa. By pointing out the similarities and differences between these two kinds of infinities, then some hidden contradictions existing in the system of modern mathematics are handily picked out. Then, theoretically, using the authors' yoyo model, it is predicted that the fourth crisis in the foundations of mathematics has appeared. And, a plan of resolution of this new crisis is provided. Originality/value - This paper shows the first time in history that human thought, the material world, and each economic entity, share a common structure - the systemic yoyo structure. And it proves the arrival of the fourth crisis in mathematics by using systems modeling and listing several; contradictions hidden deeply in the foundations of mathematics.", "paper_title": "Systemic yoyo structure in human thoughts and the fourth crisis in mathematics", "paper_id": "WOS:000256048100002"}