{"auto_keywords": [{"score": 0.04769152759457353, "phrase": "linux"}, {"score": 0.033777359925535204, "phrase": "common_coupling"}, {"score": 0.019893471101618928, "phrase": "release_date"}, {"score": 0.010434065097826803, "phrase": "software_evolution"}, {"score": 0.00481495049065317, "phrase": "release_intervals"}, {"score": 0.004774115617883476, "phrase": "empirical_research"}, {"score": 0.004255431326383001, "phrase": "release_sequence_number"}, {"score": 0.003941215575554871, "phrase": "release_dates"}, {"score": 0.003776750773624222, "phrase": "open-source_software"}, {"score": 0.0037287578312533596, "phrase": "widely_cited_study"}, {"score": 0.0033660587983313536, "phrase": "linux_kernel"}, {"score": 0.0032670563228107273, "phrase": "rsn"}, {"score": 0.0030908254851076005, "phrase": "adverse_effect"}, {"score": 0.0028623555849897632, "phrase": "minimal_common_coupling"}, {"score": 0.00235213013487844, "phrase": "linux_releases"}, {"score": 0.0021049977753042253, "phrase": "temporal_variables"}], "paper_keywords": [""], "paper_abstract": "In most empirical research on software evolution, analysis of the data is performed with respect to the release sequence number (RSN), rather than the release date. This distinction is important when the intervals between release dates vary widely, as is generally the case with open-source software. A widely cited study on the maintainability of Linux was published in this journal in 2002. The study showed that, whereas the size of the Linux kernel grew linearly with respect to the RSN, the amount of common coupling grew exponentially. In view of the adverse effect of common coupling on maintainability, the conclusion drawn there was that Linux needed to be refactored with minimal common coupling. Here, it is shown that, if the same data are analysed with respect to the release date, the amount of common coupling grows linearly; hence, there is no need to refactor Linux to promote maintainability. The authors also analyse three stable series of Linux releases, and observe that the size and the common coupling grow linearly. The authors conclude that rates of growth should be computed with respect to temporal variables, such as the release date.", "paper_title": "Impact of release intervals on empirical research into software evolution, with application to the maintainability of Linux", "paper_id": "WOS:000263914900006"}