{"auto_keywords": [{"score": 0.03779831745903596, "phrase": "ddi_decision_support"}, {"score": 0.009369667379843164, "phrase": "ddi_alerts"}, {"score": 0.009147886655479776, "phrase": "override_rates"}, {"score": 0.00481495049065317, "phrase": "drug-drug_interaction_clinical_decision_support_alerts"}, {"score": 0.004497576466646301, "phrase": "ddi_clinical_decision_support_conference_series"}, {"score": 0.004201033616196156, "phrase": "web-based_meetings"}, {"score": 0.003923965929636472, "phrase": "decision_support"}, {"score": 0.003368715856723357, "phrase": "ddi"}, {"score": 0.0032231139180761183, "phrase": "consistent_use"}, {"score": 0.003171740347925348, "phrase": "visual_cues"}, {"score": 0.003146360480030653, "phrase": "minimal_text"}, {"score": 0.0029268619875960715, "phrase": "medication_use_process"}, {"score": 0.0027008385562908425, "phrase": "good_measure"}, {"score": 0.0025736694380861604, "phrase": "ddi_information"}, {"score": 0.002384422461262006, "phrase": "alert_effectiveness"}, {"score": 0.0023463854193479274, "phrase": "ddi_clinical_decision_support_alerts"}, {"score": 0.0022630008787375435, "phrase": "healthcare_organizations"}, {"score": 0.002209060366991921, "phrase": "clinician_interface"}, {"score": 0.002130545585846588, "phrase": "alert_fatigue"}, {"score": 0.0021049977753042253, "phrase": "patient_safety"}], "paper_keywords": ["clinical decision support", " alerts", " drug interactions", " usability", " CPOE (up to 5)"], "paper_abstract": "Objective: To establish preferred strategies for presenting drug-drug interaction (DDI) clinical decision support alerts. Materials and Methods: A DDI Clinical Decision Support Conference Series included a workgroup consisting of 24 clinical, usability, and informatics experts representing academia, health information technology (IT) vendors, healthcare organizations, and the Office of the National Coordinator for Health IT. Workgroup members met via web-based meetings 12 times from January 2013 to February 2014, and two in-person meetings to reach consensus on recommendations to improve decision support for DDIs. We addressed three key questions: (1) what, how, where, and when do we display DDI decision support? (2) should presentation of DDI decision support vary by clinicians? and (3) how should effectiveness of DDI decision support be measured? Results: Our recommendations include the consistent use of terminology, visual cues, minimal text, formatting, content, and reporting standards to facilitate usability. All clinicians involved in the medication use process should be able to view DDI alerts and actions by other clinicians. Override rates are common but may not be a good measure of effectiveness. Discussion: Seven core elements should be included with DDI decision support. DDI information should be presented to all clinicians. Finally, in their current form, override rates have limited capability to evaluate alert effectiveness. Conclusion: DDI clinical decision support alerts need major improvements. We provide recommendations for healthcare organizations and IT vendors to improve the clinician interface of DDI alerts, with the aim of reducing alert fatigue and improving patient safety.", "paper_title": "Recommendations to improve the usability of drug-drug interaction clinical decision support alerts", "paper_id": "WOS:000373722400022"}