{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "symbolic_rules"}, {"score": 0.017737071768158853, "phrase": "conversion_process"}, {"score": 0.010433253537377337, "phrase": "splitting_methods"}, {"score": 0.009540773294505039, "phrase": "adaline_unit"}, {"score": 0.008576430600719978, "phrase": "neurule_base"}, {"score": 0.004773904938276846, "phrase": "integrated_rules"}, {"score": 0.0046928556063004214, "phrase": "mergability_criteria"}, {"score": 0.0045543011700929096, "phrase": "neuro-symbolic_rules"}, {"score": 0.004476963405985556, "phrase": "production_rules"}, {"score": 0.004074397977869244, "phrase": "interactive_and_integrated_inferences"}, {"score": 0.003988055287053139, "phrase": "reached_conclusions"}, {"score": 0.003788196352457501, "phrase": "existing_symbolic_rule_base"}, {"score": 0.003177687211289478, "phrase": "initial_set"}, {"score": 0.0030573959252626695, "phrase": "research_work"}, {"score": 0.0029165216647792924, "phrase": "produced_neurules"}, {"score": 0.0026425357050743003, "phrase": "alternative_rule"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["rule merging", " rule clustering", " neuro-symbolic approaches", " hybrid expert systems", " hybrid intelligent systems", " hybrid knowledge representation"], "paper_abstract": "Neurules are a type of neuro-symbolic rules integrating neurocomputing and production rules. Each neurule is represented as an adaline unit. Neurules exhibit characteristics such as modularity, naturalness and ability to perform interactive and integrated inferences and provide explanations for reached conclusions. One way of producing a neurule base is through conversion of an existing symbolic rule base yielding an equivalent but more compact rule base. The conversion process merges symbolic rules having the same conclusion into one or more neurules. Because of the inability of the adaline unit to handle inseparability, more than one neurule for each conclusion may be produced by splitting the initial set of symbolic rules into subsets. This paper presents research work improving the conversion process in terms of runtime and number of produced neurules. First, we show how easier it is to construct a neurule base than a connectionist one. Second, we present alternative rule set splitting methods. Finally, we define criteria concerning the ability or inability to convert a rule set into a single, equivalent, but more compact rule. With application of such mergability criteria, the conversion process of symbolic rules into neurules becomes more time-efficient. All the aforementioned are supported by experimental results.", "paper_title": "Improving efficiency of merging symbolic rules into integrated rules: splitting methods and mergability criteria", "paper_id": "WOS:000352546200007"}