{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hidden_nodes"}, {"score": 0.04832242519222614, "phrase": "image_classification"}, {"score": 0.01043861054778464, "phrase": "structured-based_neural_network"}, {"score": 0.008179837836516024, "phrase": "hidden_layer"}, {"score": 0.004543232345250743, "phrase": "nn"}, {"score": 0.004250969091124481, "phrase": "large_image_database"}, {"score": 0.004163587877500036, "phrase": "challenging_problem"}, {"score": 0.003737234606207431, "phrase": "input_layer"}, {"score": 0.0036756196381448015, "phrase": "output_layer"}, {"score": 0.0030231983220281836, "phrase": "first_group"}, {"score": 0.0029242629306714773, "phrase": "image_intensities"}, {"score": 0.0028640745158229875, "phrase": "second_group"}, {"score": 0.002805121439110729, "phrase": "wavelet_coefficients"}, {"score": 0.0027818804382539444, "phrase": "experimental_results"}, {"score": 0.0024452510143564057, "phrase": "classification_rate"}, {"score": 0.0022036216160494925, "phrase": "appropriate_choice"}, {"score": 0.0021049977753042253, "phrase": "structured-based_nn"}], "paper_keywords": ["Hidden nodes", " Backpropagation through structure", " Image classification", " Neural network", " Features set"], "paper_abstract": "A structured-based neural network (NN) with backpropagation through structure (BPTS) algorithm is conducted for image classification in organizing a large image database, which is a challenging problem under investigation. Many factors can affect the results of image classification. One of the most important factors is the architecture of a NN, which consists of input layer, hidden layer and output layer. In this study, only the numbers of nodes in hidden layer (hidden nodes) of a NN are considered. Other factors are kept unchanged. Two groups of experiments including 2,940 images in each group are used for the analysis. The assessment of the effects for the first group is carried out with features described by image intensities, and, the second group uses features described by wavelet coefficients. Experimental results demonstrate that the effects of the numbers of hidden nodes on the reliability of classification are significant and non-linear. When the number of hidden nodes is 17, the classification rate on training set is up to 95%, and arrives at 90% on the testing set. The results indicate that 17 is an appropriate choice for the number of hidden nodes for the image classification when a structured-based NN with BPTS algorithm is applied.", "paper_title": "Effects of the number of hidden nodes used in a structured-based neural network on the reliability of image classification", "paper_id": "WOS:000263383500005"}