{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "web-based_audience_response_system"}, {"score": 0.00370981613076245, "phrase": "ars_functionalities"}, {"score": 0.0036485497734171294, "phrase": "dedicated_systems"}, {"score": 0.003211145390854807, "phrase": "web-based_solutions"}, {"score": 0.0030545815929619306, "phrase": "web-based_system"}, {"score": 0.002718231974492536, "phrase": "web_browser"}, {"score": 0.0025287979714720423, "phrase": "poll_creation"}, {"score": 0.002473203873496859, "phrase": "web_interfaces"}, {"score": 0.0023525345110929326, "phrase": "main_needs"}, {"score": 0.0022377394845878268, "phrase": "first_need"}, {"score": 0.0021885300925245516, "phrase": "students'_access"}], "paper_keywords": ["audience response system", " formative learning", " in-class participation", " learning platform", " educational technology"], "paper_abstract": "Currently Audience Response Systems (ARS) can easily be used in classes enabling students to participate in questionnaires and polls. The literature about ARSs shows their benefits, highlighting as the most important the student engagement and classroom attendance. Several companies provide solutions to support ARS functionalities by using dedicated systems (e.g. remote control devices and dedicated receivers) or more generally available web technologies. In this paper, we review web-based solutions and introduce our own ARS development. We have created a web-based system that enables students to answer in-class questions using their own devices. This system can be operated from devices running a web browser (e.g. laptop, tablet or smart phone). Our approach allows poll creation and management through web interfaces and it is focused on two of the main needs that are not covered by other services. The first need is to facilitate students' access and the second is to provide more question types.", "paper_title": "Web-based Audience Response System Using the Educational Platform Called BeA", "paper_id": "WOS:000209590100007"}