{"auto_keywords": [{"score": 0.0485718029388882, "phrase": "alzheimer's_disease"}, {"score": 0.0048149508482222, "phrase": "beta-secretase"}, {"score": 0.004613940521007727, "phrase": "beta-site_amyloid_precursor_protein"}, {"score": 0.0036488111139918135, "phrase": "computational_chemistry_and_cheminformatics_techniques"}, {"score": 0.003571751184289622, "phrase": "quantitative_structure_activity_relationships"}, {"score": 0.003459191419478298, "phrase": "remarkable_relationship"}, {"score": 0.0031760175583084274, "phrase": "main_descriptor"}, {"score": 0.0030923570058383355, "phrase": "hydrophobic_contacts"}, {"score": 0.002900426826591769, "phrase": "active_site"}, {"score": 0.0027058852678238632, "phrase": "readily_available_structural_data"}, {"score": 0.0026771333996253783, "phrase": "protein-inhibitor_complexes"}, {"score": 0.0026345758986796703, "phrase": "protein_data_bank"}, {"score": 0.002497531381123025, "phrase": "proprietary_structural_biology_data"}, {"score": 0.002418742283474052, "phrase": "structure-based_design"}, {"score": 0.0021620042653528846, "phrase": "first_assay"}, {"score": 0.0021049977753042253, "phrase": "compound's_true_activity"}], "paper_keywords": [""], "paper_abstract": "Beta-site amyloid precursor protein cleaving enzyme-1 (BACE1) is a target of interest for treating patients with Alzheimer's disease (AD). Inhibition of BACE1 may prevent amyloid-beta (A beta) plaque formation and the development or progression of Alzheimer's disease. Known BACE1 inhibitors were analyzed using computational chemistry and cheminformatics techniques to search for quantitative structure activity relationships (QSAR). A remarkable relationship was found with only two simple descriptors. The square of the linear correlation coefficient r(2) is 0.75. The main descriptor is the number of hydrophobic contacts in the range 4-5 angstrom between the atoms of the ligand and active site. The other descriptor is the number of short (<2.8 angstrom) hydrogen bonds. Our approach uses readily available structural data on protein-inhibitor complexes in the Protein Data Bank (PDB) but would be equally applicable to proprietary structural biology data. The findings can aid structure-based design of improved BACE-1 inhibitors. If an inhibitor has less observed activity than predicted by our correlation, the compound should be retested because the first assay may have underestimated the compound's true activity.", "paper_title": "Simple Structure-Based Approach for Predicting the Activity of Inhibitors of Beta-Secretase (BACE1) Associated with Alzheimer's Disease", "paper_id": "WOS:000312563800020"}