{"auto_keywords": [{"score": 0.043335277289837486, "phrase": "ict_tools"}, {"score": 0.00481495049065317, "phrase": "linked_data"}, {"score": 0.004695303774351139, "phrase": "educational_ict_tools"}, {"score": 0.003790751492305239, "phrase": "tool_information"}, {"score": 0.003574364535717202, "phrase": "educational_tool_registries"}, {"score": 0.0032726467814278345, "phrase": "linked_data_approach"}, {"score": 0.0031512402798625056, "phrase": "third-party_sources"}, {"score": 0.002921732652917206, "phrase": "educational_applications"}, {"score": 0.00284899583294417, "phrase": "incipient_educational_dataset"}, {"score": 0.0027317585060414253, "phrase": "non-educative_information"}, {"score": 0.0026862220320327613, "phrase": "updated_third-party_sources"}, {"score": 0.0023779596230982234, "phrase": "evaluation_results"}, {"score": 0.0023481578019624843, "phrase": "available_information"}, {"score": 0.0022420373745572837, "phrase": "suitable_tools"}, {"score": 0.0022232633360792222, "phrase": "real_educational_settings"}, {"score": 0.0021770116505684394, "phrase": "sustainability_problems"}, {"score": 0.002158780936704905, "phrase": "existing_ict_tool_registries"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Linked data", " Data sustainability", " ICT tools", " Web of Data"], "paper_abstract": "The use of Information and Communication Technologies (ICT) tools to support learning activities is nowadays generalized. Several educational registries provide information about ICT tools in order to help educators in their discovery and selection. These registries are typically isolated and require much effort to keep tool information up to date. To address this issue, this paper explores whether educational tool registries can be federated to other datasets currently available on the Web of Data. In order to answer this question, and following the Linked Data approach, this paper proposes to collect data from third-party sources, align it to a vocabulary understandable by educators and finally publish it to be consumed by educational applications. This way, an incipient educational dataset can be automatically created and easily maintained, since non-educative information is obtained from updated third-party sources. A case study with practitioners has been carried out to evaluate whether the information about ICT tools provided by this dataset is understandable and useful for educators. Evaluation results show that available information on the Web of Data can be used to obtain suitable tools for real educational settings, thus overcoming the sustainability problems of existing ICT tool registries. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A Linked Data approach for the discovery of educational ICT tools in the Web of Data", "paper_id": "WOS:000306582400011"}