{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "online_gaming"}, {"score": 0.027350172284374925, "phrase": "dissonance_theory"}, {"score": 0.008713768692145006, "phrase": "attitude_change"}, {"score": 0.00856008935638784, "phrase": "adolescent_players"}, {"score": 0.0062392381002223975, "phrase": "online_gaming_addiction"}, {"score": 0.0058354792208471186, "phrase": "attitude-discrepant_behavior"}, {"score": 0.0044231966846655394, "phrase": "negative_impact"}, {"score": 0.004045068727683462, "phrase": "critical_issue"}, {"score": 0.003920476803132283, "phrase": "external_justification"}, {"score": 0.0038338299812503, "phrase": "experimental_study"}, {"score": 0.003601235776892337, "phrase": "adolescent_players'_attitude_change"}, {"score": 0.0033376244286643176, "phrase": "classic_studies"}, {"score": 0.0031071175640144943, "phrase": "apparently_interesting_online_game"}, {"score": 0.002905454531687249, "phrase": "negative_side"}, {"score": 0.0028284924551705516, "phrase": "low_level"}, {"score": 0.0027535633837592597, "phrase": "high_level"}, {"score": 0.0024620842899061614, "phrase": "similar_pattern"}, {"score": 0.0024401411219526774, "phrase": "participants'_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Interdisciplinary projects"], "paper_abstract": "The negative impact of online gaming on adolescents has received much attention. The question of how to reduce their pathological use of online gaming is a critical issue. Based on the concept of external justification in dissonance theory, this experimental study aimed to examine whether severity of threat and justification of effort would impact adolescent players' attitude change toward online gaming, and their subjective estimations of online gaming addiction. The results echoed predictions from classic studies in dissonance theory. When participants engaged in attitude-discrepant behavior, i.e., persuading other adolescents that an apparently interesting online game is not fun at all, their attitudes toward online gaming shifted more dramatically to the negative side in the context of a low level of threat rather than a high level of threat. Additionally, the magnitude of attitude change was more prominent when participants exerted more rather than less effort to engage in attitude-discrepant behavior. Moreover, a similar pattern of participants' evaluations of the likelihood of online gaming addiction was also observed. The findings show that dissonance theory has the potential to be useful for inducing adolescent players to disengage in online gaming. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Inducing attitude change toward online gaming among adolescent players based on dissonance theory: The role of threats and justification of effort", "paper_id": "WOS:000272310100015"}