{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "maximal_confidence_interval"}, {"score": 0.015719716506582538, "phrase": "interval-valued_belief_structure"}, {"score": 0.014788358415917703, "phrase": "maximal_confidence_intervals"}, {"score": 0.011797292599321841, "phrase": "valid_and_normalized_interval-valued_belief_structures"}, {"score": 0.004701985831087475, "phrase": "unsolved_problem"}, {"score": 0.004420472010542188, "phrase": "credible_and_maximal_interval-valued_beliefs"}, {"score": 0.004116440453049531, "phrase": "combination_rule"}, {"score": 0.0028006988338192375, "phrase": "interval-valued_beliefs"}, {"score": 0.002632716358833918, "phrase": "well-designed_examples"}, {"score": 0.0023152577218214804, "phrase": "practical_applications"}, {"score": 0.0022824314760583834, "phrase": "proposed_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Dempster-Shafer's theory of evidence", " Interval-valued belief structure", " Imprecise probability mass", " Combination of interval-valued belief", " Maximal confidence interval"], "paper_abstract": "An unsolved problem in the interval-valued belief structure is the existence of maximal confidence intervals, referring to the credible and maximal interval-valued beliefs assigned to focal elements, in which every point can be reached by a combination rule. In this study, the existence of maximal confidence intervals of the interval-valued belief structure was investigated and validated. In addition, some applications of the maximal confidence interval in constructing valid and normalized interval-valued belief structures are discussed. A numerical experiment was conducted to illustrate the existence of maximal confidence intervals. Several propositions and a theorem were further proposed to demonstrate the validity of the maximal confidence interval. By using the concept of the maximal confidence interval, a procedure was proposed to construct valid and normalized interval-valued belief structures, and some meaningful guidance for assigning interval-valued beliefs was also suggested to the experts. Finally, a series of well-designed examples was presented as applications of the maximal confidence interval, the proposed procedure and the suggestions. They indicated that valid and normalized interval-valued belief structures can be achieved accurately and efficiently in practical applications with the proposed procedure and guidance on the basis of the concept of the maximal confidence interval. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Maximal confidence intervals of the interval-valued belief structure and applications", "paper_id": "WOS:000288774700013"}