{"auto_keywords": [{"score": 0.030454570211478012, "phrase": "merge_assumptions"}, {"score": 0.00481495049065317, "phrase": "view_merging"}, {"score": 0.004640929126263433, "phrase": "key_problem"}, {"score": 0.004603115982404017, "phrase": "conceptual_modeling"}, {"score": 0.004565609517511076, "phrase": "large_models"}, {"score": 0.004418601451254075, "phrase": "individual_views"}, {"score": 0.004104838067758352, "phrase": "unified_perspective"}, {"score": 0.0036753171449945654, "phrase": "varying_degrees"}, {"score": 0.003556873173040169, "phrase": "different_but_overlapping_aspects"}, {"score": 0.0029581155916843663, "phrase": "merged_view"}, {"score": 0.0027030963394733916, "phrase": "incomplete_and_inconsistent_graph-based_views"}, {"score": 0.0025628355581338563, "phrase": "built-in_annotation_scheme"}, {"score": 0.002459902948098627, "phrase": "structure-preserving_maps"}, {"score": 0.002370794661629904, "phrase": "disparate_views"}, {"score": 0.0023418133729330303, "phrase": "annotated_graphs"}, {"score": 0.002294294558114909, "phrase": "general_algorithm"}, {"score": 0.0022477377970612847, "phrase": "arbitrary_interconnections"}, {"score": 0.002202123699556382, "phrase": "systematic_way"}, {"score": 0.002148604369150115, "phrase": "traceability_information"}, {"score": 0.0021049977753042253, "phrase": "merged_view_elements"}], "paper_keywords": ["model management", " view-based development", " view merging", " inconsistency management"], "paper_abstract": "View merging, also called view integration, is a key problem in conceptual modeling. Large models are often constructed and accessed by manipulating individual views, but it is important to be able to consolidate a set of views to gain a unified perspective, to understand interactions between views, or to perform various types of analysis. View merging is complicated by incompleteness and inconsistency: Stakeholders often have varying degrees of confidence about their statements. Their views capture different but overlapping aspects of a problem, and may have discrepancies over the terminology being used, the concepts being modeled, or how these concepts should be structured. Once views are merged, it is important to be able to trace the elements of the merged view back to their sources and to the merge assumptions related to them. In this paper, we present a framework for merging incomplete and inconsistent graph-based views. We introduce a formalism, called annotated graphs, with a built-in annotation scheme for modeling incompleteness and inconsistency. We show how structure-preserving maps can be employed to express the relationships between disparate views modeled as annotated graphs, and provide a general algorithm for merging views with arbitrary interconnections. We provide a systematic way to generate and represent the traceability information required for tracing the merged view elements back to their sources, and to the merge assumptions giving rise to the elements.", "paper_title": "View merging in the presence of incompleteness and inconsistency", "paper_id": "WOS:000238277800003"}