{"auto_keywords": [{"score": 0.04747663842253329, "phrase": "seamless_application_execution"}, {"score": 0.010344179250783932, "phrase": "seamless_execution"}, {"score": 0.007740489563401459, "phrase": "mobile_cloud_computing"}, {"score": 0.005634317416899509, "phrase": "mcc"}, {"score": 0.004258372598568333, "phrase": "resource-intensive_migration_process"}, {"score": 0.004118026552723285, "phrase": "wireless_medium"}, {"score": 0.003808209866576388, "phrase": "first_comprehensive_survey"}, {"score": 0.003724034990158436, "phrase": "state-of-the-art_cloud-based_mobile_application_execution_frameworks"}, {"score": 0.0034245614958572012, "phrase": "frameworks_suitability"}, {"score": 0.0030794433253250476, "phrase": "implementation_locations"}, {"score": 0.002722930614979045, "phrase": "mcc."}, {"score": 0.00269263690712392, "phrase": "existing_frameworks"}, {"score": 0.002603758927691463, "phrase": "significant_parameters"}, {"score": 0.002251227801482381, "phrase": "open_research_challenges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mobile Cloud Computing", " Seamless Application Execution", " Cloud-Based Mobile Application Execution", " Frameworks"], "paper_abstract": "Seamless application execution is vital for the usability of various delay-sensitive mobile cloud applications. However, the resource-intensive migration process and intrinsic limitations of the wireless medium impede the realization of seamless execution in mobile cloud computing (MCC) environment. This work is the first comprehensive survey that studies the state-of-the-art cloud-based mobile application execution frameworks (CMAEFs) in perspective of seamless application execution in MCC and investigates the frameworks suitability for the seamless execution. The seamless execution enabling approaches for the CMAEFs are identified and classified based on the implementation locations. We also investigate the seamless application execution enabling approaches to identify advantages and disadvantages of employing such approaches for attaining the seamless application execution in MCC. The existing frameworks are compared based on the significant parameters derived from the taxonomy of the seamless application execution enabling approaches. The principles for enabling the seamless application execution within the MCC are also highlighted. Finally, open research challenges in realizing the seamless application execution are discussed. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Seamless application execution in mobile cloud computing: Motivation, taxonomy, and open challenges", "paper_id": "WOS:000354589100013"}