{"auto_keywords": [{"score": 0.04049871558392555, "phrase": "mccullochs-pitts"}, {"score": 0.00481495049065317, "phrase": "feedforward_networks"}, {"score": 0.004767826806287385, "phrase": "recent_experimental_and_computational_evidence"}, {"score": 0.004674952036988355, "phrase": "dynamical_propertiesmay"}, {"score": 0.004606479650820579, "phrase": "operating_point"}, {"score": 0.004539005582217309, "phrase": "neural_networks"}, {"score": 0.004278807087784626, "phrase": "wide_range"}, {"score": 0.004236908273106904, "phrase": "firing_patterns"}, {"score": 0.004133940019630129, "phrase": "simplest_setting"}, {"score": 0.003548905904860611, "phrase": "feedforward_connectivity"}, {"score": 0.003462599815177726, "phrase": "low_thresholds"}, {"score": 0.0030614565460256897, "phrase": "overall_firing_rates"}, {"score": 0.0029576827451501956, "phrase": "broad_distributions"}, {"score": 0.0027200305495826797, "phrase": "high_thresholds"}, {"score": 0.002680114113899346, "phrase": "key_tool"}, {"score": 0.002551231163230566, "phrase": "resulting_mean-field_markov_chain"}, {"score": 0.0023346234464901978, "phrase": "purely_excitatory_networks"}, {"score": 0.002255431275670053, "phrase": "local_noise"}], "paper_keywords": [""], "paper_abstract": "Recent experimental and computational evidence suggests that several dynamical propertiesmay characterize the operating point of functioning neural networks: critical branching, neutral stability, and production of a wide range of firing patterns. We seek the simplest setting in which these properties emerge, clarifying their origin and relationship in random, feedforward networks of McCullochs-Pitts neurons. Two key parameters are the thresholds at which neurons fire spikes and the overall level of feedforward connectivity. When neurons have low thresholds, we show that there is always a connectivity for which the properties in question all occur, that is, these networks preserve overall firing rates from layer to layer and produce broad distributions of activity in each layer. This fails to occur, however, when neurons have high thresholds. A key tool in explaining this difference is the eigenstructure of the resulting mean-field Markov chain, as this reveals which activity modes will be preserved from layer to layer. We extend our analysis from purely excitatory networks to more complex models that include inhibition and local noise, and find that both of these features extend the parameter ranges over which networks produce the properties of interest.", "paper_title": "Neutral Stability, Rate Propagation, and Critical Branching in Feedforward Networks", "paper_id": "WOS:000319903700004"}