{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "structurally_conserved_residues"}, {"score": 0.015219048343999583, "phrase": "neural_network_ensemble"}, {"score": 0.013207095925484798, "phrase": "homologous_structural_information"}, {"score": 0.011788484869176939, "phrase": "single_protein_structure"}, {"score": 0.004698229304089357, "phrase": "structural_homologs"}, {"score": 0.004509919457793852, "phrase": "machine_learning_techniques"}, {"score": 0.004104838067758352, "phrase": "protein_structure"}, {"score": 0.0040713749949601915, "phrase": "almost_all_methods"}, {"score": 0.0040052617265655035, "phrase": "structure-based_alignments"}, {"score": 0.0038446194432899183, "phrase": "protein_structure_comparison_studies"}, {"score": 0.0037055370870874484, "phrase": "neural_network_approach"}, {"score": 0.0036453427552753533, "phrase": "structurally_important_residues"}, {"score": 0.0035278613436978933, "phrase": "structural_alignment"}, {"score": 0.00335867620389808, "phrase": "negative_correlation"}, {"score": 0.0031199418866663543, "phrase": "amino_acid_conservation"}, {"score": 0.003069230909006614, "phrase": "physico-chemical_properties"}, {"score": 0.002827740707723551, "phrase": "high_prediction_sensitivity"}, {"score": 0.0027477745788313163, "phrase": "matthew's_correlation_coefficient"}, {"score": 0.0023131855385489764, "phrase": "ncl-nne"}, {"score": 0.0021049977753042253, "phrase": "large-scale_benchmarking_studies"}], "paper_keywords": [""], "paper_abstract": "Motivation: So far various bioinformatics and machine learning techniques applied for identification of sequence and functionally conserved residues in proteins. Although few computational methods are available for the prediction of structurally conserved residues from protein structure, almost all methods require homologous structural information and structure-based alignments, which still prove to be a bottleneck in protein structure comparison studies. In this work, we developed a neural network approach for identification of structurally important residues from a single protein structure without using homologous structural information and structural alignment. Results: A neural network ensemble ( NNE) method that utilizes negative correlation learning ( NCL) approach was developed for identification of structurally conserved residues ( SCRs) in proteins using features that represent amino acid conservation and composition, physico-chemical properties and structural properties. The NCL-NNE method was applied to 6042 SCRs that have been extracted from 496 protein domains. This method obtained high prediction sensitivity ( 92.8%) and quality ( Matthew's correlation coefficient is 0.852) in identification of SCRs. Further benchmarking using 60 protein domains containing 1657 SCRs that were not part of the training and testing datasets shows that the NCL-NNE can correctly predict SCRs with similar to 90% sensitivity. These results suggest the usefulness of NCL-NNE for facilitating the identification of SCRs utilizing information derived from a single protein structure. Therefore, this method could be extremely effective in large-scale benchmarking studies where reliable structural homologs and alignments are limited.", "paper_title": "Identification of structurally conserved residues of proteins in absence of structural homologs using neural network ensemble", "paper_id": "WOS:000262518300008"}