{"auto_keywords": [{"score": 0.03849655364030264, "phrase": "current_study"}, {"score": 0.011519639804969025, "phrase": "target_users"}, {"score": 0.00481495049065317, "phrase": "smartphone_application"}, {"score": 0.004670655190860886, "phrase": "user_population"}, {"score": 0.0045625946800833895, "phrase": "major_public_health_problem"}, {"score": 0.0045095013424771065, "phrase": "recurrent_episodes"}, {"score": 0.004488436622161689, "phrase": "out-of-control_eating"}, {"score": 0.004415478544531707, "phrase": "unusually_large_amount"}, {"score": 0.004364089641254575, "phrase": "discrete_time_period"}, {"score": 0.004323407601695861, "phrase": "existing_treatments"}, {"score": 0.004144961421882705, "phrase": "smartphone_applications"}, {"score": 0.004077563553937693, "phrase": "ideal_alternative"}, {"score": 0.003973851110684823, "phrase": "treatment_dissemination"}, {"score": 0.0038366467523757433, "phrase": "user_perceptions"}, {"score": 0.003809777470248088, "phrase": "therapeutic_app"}, {"score": 0.0036183810378594395, "phrase": "potential_app"}, {"score": 0.0033256370159843378, "phrase": "smartphone_app"}, {"score": 0.003302334637050387, "phrase": "self-help_material"}, {"score": 0.003070869944590677, "phrase": "phone_interviews"}, {"score": 0.0028090909581917002, "phrase": "user_burden"}, {"score": 0.0027698423810299023, "phrase": "data_visualization"}, {"score": 0.0026993015509692497, "phrase": "perceived_effectiveness"}, {"score": 0.002680376034383189, "phrase": "proposed_app"}, {"score": 0.002667832601202387, "phrase": "thematic_analyses"}, {"score": 0.0026429210937992742, "phrase": "qualitative_data"}, {"score": 0.002612107716115644, "phrase": "interview_notes"}, {"score": 0.002581652656568769, "phrase": "focus_groups"}, {"score": 0.0023614786386287456, "phrase": "highly_specific_feedback"}, {"score": 0.002339421072433804, "phrase": "essential_app_features"}, {"score": 0.002263825841421634, "phrase": "future_apps"}, {"score": 0.0021549785581216063, "phrase": "therapeutic_apps"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Binge eating disorder", " Smartphone applications", " Focus group", " User feedback", " Qualitative"], "paper_abstract": "Background: Binge eating, a major public health problem, is characterized by recurrent episodes of out-of-control eating in which an individual consumes an unusually large amount of food in a discrete time period. Limitations of existing treatments for binge eating (both in-person psychotherapy and guided self-help) indicate that smartphone applications (apps) may be an ideal alternative or enhancement. An app for binge eating could aid treatment dissemination, engagement, and/or compliance. However, no research to date has examined user perceptions of a therapeutic app for binge eating, which is critical for development. Objectives: The purposes of the current study were to conceptualize a potential app for binge eating and obtain feedback regarding feasibility and acceptability from target users (i.e., individuals with binge eating) and clinicians specializing in the treatment of binge eating. Methods: Our team conceptualized a smartphone app that contained self-help material, functions to monitor behavior, and provisions of in-the-moment interventions. We presented this app (e.g., feature explanations, mock screen shots) through phone interviews with clinicians who specialize in the treatment of binge eating (n = 10), and focus groups with individuals experiencing binge eating (n = 11). Participants were asked to discuss customization, user burden, terminology, attrition, data visualization, comprehensiveness, reminders, feasibility, acceptability, and perceived effectiveness of the proposed app. Thematic analyses were conducted from qualitative data (e.g., audio recordings and interview notes) obtained via the focus groups and interviews. Results: Results indicated that our proposed app would be highly feasible and acceptable to users and clinicians, though concerns about the degree of personalization and customizability were noted. Conclusions: The current study details highly specific feedback and ideas regarding essential app features from target users and clinicians. This information is critical for the development of future apps to treat binge eating. Ways in which data obtained from the current study may be generalized to the development of therapeutic apps for other psychological disorders is discussed. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Perceptions of the feasibility and acceptability of a smartphone application for the treatment of binge eating disorders: Qualitative feedback from a user population and clinicians", "paper_id": "WOS:000360562100010"}