{"auto_keywords": [{"score": 0.03458969141050206, "phrase": "spatial_features"}, {"score": 0.015719716506582538, "phrase": "wrist_pulse_signals"}, {"score": 0.014030191529696198, "phrase": "important_information"}, {"score": 0.004772593750252861, "phrase": "time_domain_spatial_features"}, {"score": 0.004466519142879166, "phrase": "body_condition"}, {"score": 0.004330450801016359, "phrase": "wrist_pulse_signal"}, {"score": 0.004179991181159956, "phrase": "human_body"}, {"score": 0.0040347380310668994, "phrase": "signal_processing_techniques"}, {"score": 0.003894512634265439, "phrase": "radial_artery_pulse_pressure_signals"}, {"score": 0.003826231150275071, "phrase": "wrist_position"}, {"score": 0.003365598242636633, "phrase": "bi-modal_gaussian_model"}, {"score": 0.0027947199430705077, "phrase": "recursive_cluster_elimination"}, {"score": 0.002615156460073562, "phrase": "high_classification_accuracy"}, {"score": 0.002535344521369057, "phrase": "exercise_case"}, {"score": 0.0024579623598183355, "phrase": "lunch_case"}, {"score": 0.002219916677664081, "phrase": "changing_body_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wrist pulse signal", " Gaussian model", " Spatial features", " Support vector machine", " Biomedical signal processing"], "paper_abstract": "Blood travels throughout the body and thus its flow is modulated by changes in body condition. As a consequence, the wrist pulse signal contains important information about the status of the human body. In this work we have employed signal processing techniques to extract important information from these signals. Radial artery pulse pressure signals are acquired at wrist position noninvasively for several subjects for two cases of interest, viz. before and after exercise, and before and after lunch. Further analysis is performed by fitting a bi-modal Gaussian model to the data and extracting spatial features from the fit. The spatial features show statistically significant (p < 0.001) changes between the groups for both the cases, which indicates that they are effective in distinguishing the changes taking place due to exercise or food intake. Recursive cluster elimination based support vector machine classifier is used to classify between the groups. A high classification accuracy of 99.71% is achieved for the exercise case and 99.94% is achieved for the lunch case. This paper demonstrates the utility of certain spatial features in studying wrist pulse signals obtained under various experimental conditions. The ability of the spatial features in distinguishing changing body conditions can be potentially used for various healthcare applications. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Study of wrist pulse signals using time domain spatial features", "paper_id": "WOS:000362606700009"}