{"auto_keywords": [{"score": 0.03283261216778949, "phrase": "test_session"}, {"score": 0.005416511860525068, "phrase": "single_test_users"}, {"score": 0.00481495049065317, "phrase": "paired_user_testing"}, {"score": 0.004778088905211055, "phrase": "idtv._interactive_digital_television"}, {"score": 0.004669180816745142, "phrase": "social_medium"}, {"score": 0.004458722048888919, "phrase": "real_life"}, {"score": 0.00429057323623293, "phrase": "potential_and_importance"}, {"score": 0.004208881856146758, "phrase": "real-life_couples"}, {"score": 0.004176640648520877, "phrase": "idtv_usability_testing"}, {"score": 0.0040190868373730015, "phrase": "single_user_testing"}, {"score": 0.003988293689448734, "phrase": "coparticipation_testing"}, {"score": 0.0032777653153451265, "phrase": "idtv_applications"}, {"score": 0.0031418958350109038, "phrase": "irrelevant_issues"}, {"score": 0.003070166825722112, "phrase": "fourth_finding"}, {"score": 0.0028100102841877835, "phrase": "sixty_perecent"}, {"score": 0.0027458373015999916, "phrase": "intrinsic_suggestions"}, {"score": 0.002703869368554536, "phrase": "general_problem_detections"}, {"score": 0.0021625417261202603, "phrase": "future_tests"}, {"score": 0.0021049977753042253, "phrase": "considerable_effort"}], "paper_keywords": [""], "paper_abstract": "Interactive digital television (iDTV) is a social medium and must therefore be tested in a context as close to real life as possible. This explains why we saw the potential and importance for the involvement of real-life couples in iDTV usability testing. In this article, an experiment that compares single user testing and coparticipation testing with couples for the evaluation of several Flemish iDTV applications is described. The study found that, first, there was less probing needed by the facilitator to think out loud in the think aloud/coparticipation method with couples than in the think aloud/single test user method. Second, couples did not encounter difficulties working together with the iDTV applications. Further, couples did not lose time by discussing irrelevant issues during the test session. A fourth finding is that couples detected more usability hits than single test users. The quality of comments, however, was the same in both conditions. Sixty perecent of the comments consisted of intrinsic suggestions and 40% of general problem detections. Another issue was raised through findings during the test. Couples in general were enthusiastic to participate, put in little effort on their part in the test session, and evaluated the test session as easy and fun to do. On the contrary, single test users in general were not sure whether they would like to participate again in future tests, declared that the test session demanded considerable effort, and evaluated the test session less positively.", "paper_title": "Coupling the users: The benefits of paired user testing for iDTV", "paper_id": "WOS:000253447700006"}