{"auto_keywords": [{"score": 0.04633392568746383, "phrase": "disassembly_sequences"}, {"score": 0.00481495049065317, "phrase": "disassembly_sequence_evaluation"}, {"score": 0.004607594060491493, "phrase": "product_recovery"}, {"score": 0.0039427304473829165, "phrase": "routine_maintenance"}, {"score": 0.0038242899532391914, "phrase": "optimization_algorithms"}, {"score": 0.0036101552409969037, "phrase": "high_uncertainty"}, {"score": 0.003525493807130663, "phrase": "cad_modeling_software"}, {"score": 0.0034545033623115634, "phrase": "design_stage"}, {"score": 0.003350679980619693, "phrase": "mathematically_generated_solutions"}, {"score": 0.0030992666061123533, "phrase": "disassembly_sequence_opportunities"}, {"score": 0.002975652654536407, "phrase": "mathematical_modeling"}, {"score": 0.0029256091368059446, "phrase": "immersive_computing_technologies"}, {"score": 0.0027336881691956186, "phrase": "ict_application"}, {"score": 0.0026068650963042444, "phrase": "interactive_graph_visualization"}, {"score": 0.0025892330566358503, "phrase": "existing_disassembly_sequences"}, {"score": 0.0025113494092413604, "phrase": "geometric_models"}, {"score": 0.002452392552332778, "phrase": "graph_visualization"}, {"score": 0.002427549902743566, "phrase": "calculated_optimal_path"}, {"score": 0.002338588929719847, "phrase": "optimal_sequence"}, {"score": 0.002199978308846543, "phrase": "hydraulic_pump_assembly"}, {"score": 0.0021049977753042253, "phrase": "viable_method"}], "paper_keywords": [""], "paper_abstract": "As interest in product recovery, reuse, and recycling rises, planning and evaluating disassembly sequences are becoming increasingly important. The manner in which a product can be taken apart strongly influences end-of-life (EOL) operations and costs. Early disassembly planning can also inform non-EOL processes including repair and routine maintenance. Recently, research has concentrated on creating optimization algorithms which automatically generate disassembly sequences. These algorithms often require data that are unavailable or estimated with high uncertainty. Furthermore, industries often employ CAD modeling software to evaluate disassembly sequences during the design stage. The combination of these methods result in mathematically generated solutions, however, the solutions may not account for attributes that are difficult to quantify (human interaction). To help designers better explore and understand disassembly sequence opportunities, the research presented in this paper combines the value of mathematical modeling with the benefits of immersive computing technologies (ICT) to aid in early design decision making. For the purposes of this research, an ICT application was developed. The application displays both 3D geometry of a product and an interactive graph visualization of existing disassembly sequences. The user can naturally interact with the geometric models and explore sequences outlined in the graph visualization. The calculated optimal path can be highlighted allowing the user to quickly compare the optimal sequence against alternatives. The application has been implemented in a three wall immersive projection environment. A user study involving a hydraulic pump assembly was conducted. The results suggest that this approach may be a viable method of evaluating disassembly sequences early in design.", "paper_title": "Disassembly Sequence Evaluation: A User Study Leveraging Immersive Computing Technologies", "paper_id": "WOS:000349754800002"}