{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "radius_information"}, {"score": 0.01560984472994894, "phrase": "multiple_kernel_learning"}, {"score": 0.013951419327036987, "phrase": "mkl"}, {"score": 0.012163498932874618, "phrase": "meb"}, {"score": 0.009707538617379297, "phrase": "proposed_approach"}, {"score": 0.004647206916983993, "phrase": "recent_work"}, {"score": 0.004517210371632577, "phrase": "promising_way"}, {"score": 0.004469400468609653, "phrase": "kernel_learning_performance"}, {"score": 0.0043443560029027195, "phrase": "minimum_enclosing_ball"}, {"score": 0.004119211418949265, "phrase": "significant_computational_overhead"}, {"score": 0.003933508945770709, "phrase": "notorious_sensitivity"}, {"score": 0.003650984439966844, "phrase": "total_data"}, {"score": 0.0031788569040714434, "phrase": "support_vector_machines"}, {"score": 0.0028072256092845417, "phrase": "resulting_optimization"}, {"score": 0.0025686131021181134, "phrase": "noisy_training_samples"}, {"score": 0.0024789326485851666, "phrase": "quadratic_optimization"}, {"score": 0.002341895788806396, "phrase": "existing_off-the-shelf_mkl_packages"}, {"score": 0.0022843440226146005, "phrase": "university_of_california"}], "paper_keywords": ["Class separability measure", " enclosing minimum ball", " kernel methods", " multiple kernel learning (MKL)", " radius-margin bound", " support vector machines (SVMs)"], "paper_abstract": "Integrating radius information has been demonstrated by recent work on multiple kernel learning (MKL) as a promising way to improve kernel learning performance. Directly integrating the radius of the minimum enclosing ball (MEB) into MKL as it is, however, not only incurs significant computational overhead but also possibly adversely affects the kernel learning performance due to the notorious sensitivity of this radius to outliers. Inspired by the relationship between the radius of the MEB and the trace of total data scattering matrix, this paper proposes to incorporate the latter into MKL to improve the situation. In particular, in order to well justify the incorporation of radius information, we strictly comply with the radius-margin bound of support vector machines (SVMs) and thus focus on the l(2)-norm soft-margin SVM classifier. Detailed theoretical analysis is conducted to show how the proposed approach effectively preserves the merits of incorporating the radius of the MEB and how the resulting optimization is efficiently solved. Moreover, the proposed approach achieves the following advantages over its counterparts: 1) more robust in the presence of outliers or noisy training samples; 2) more computationally efficient by avoiding the quadratic optimization for computing the radius at each iteration; and 3) readily solvable by the existing off-the-shelf MKL packages. Comprehensive experiments are conducted on University of California, Irvine, protein subcellular localization, and Caltech-101 data sets, and the results well demonstrate the effectiveness and efficiency of our approach.", "paper_title": "An Efficient Approach to Integrating Radius Information into Multiple Kernel Learning", "paper_id": "WOS:000317644300013"}