{"auto_keywords": [{"score": 0.04922391988868445, "phrase": "object_detection"}, {"score": 0.027935142620587036, "phrase": "detection_rate"}, {"score": 0.00481495049065317, "phrase": "shape_reconstructability_measure"}, {"score": 0.004786107405332454, "phrase": "object_part_importance"}, {"score": 0.004630517016920072, "phrase": "computational_model"}, {"score": 0.004282483226549419, "phrase": "shape_part"}, {"score": 0.004020492138367616, "phrase": "global_shape"}, {"score": 0.0038086741610654715, "phrase": "global_shapes"}, {"score": 0.003751834457361072, "phrase": "local_part"}, {"score": 0.003376933842097587, "phrase": "global_shape_reconstruction"}, {"score": 0.003306559295382181, "phrase": "reconstructed_global_shape"}, {"score": 0.003276848046269042, "phrase": "true_object_shape"}, {"score": 0.0029052181875265995, "phrase": "information_theoretic_formulation"}, {"score": 0.0028360962841331634, "phrase": "conditional_entropy"}, {"score": 0.0027853332413658666, "phrase": "object_shape"}, {"score": 0.0027437235598539904, "phrase": "experimental_results"}, {"score": 0.002694609420649617, "phrase": "proposed_part_importance"}, {"score": 0.0026146933470934408, "phrase": "localization_accuracy"}, {"score": 0.0025911827307616136, "phrase": "detection_efficiency"}, {"score": 0.0024324082074887858, "phrase": "considerable_improvement"}, {"score": 0.0024105326885334962, "phrase": "proposed_importance_measure"}, {"score": 0.0023179843199613174, "phrase": "challenging_pascal_dataset"}, {"score": 0.0022424487483398876, "phrase": "pascal_voc_challenge"}, {"score": 0.002162844717299508, "phrase": "psychological_experiment"}, {"score": 0.0021049977753042253, "phrase": "similar_measure"}], "paper_keywords": ["Shape part", " Part importance", " Shape reconstruction", " Object recognition and detection"], "paper_abstract": "We propose a computational model which computes the importance of 2-D object shape parts, and we apply it to detect and localize objects with and without occlusions. The importance of a shape part (a localized contour fragment) is considered from the perspective of its contribution to the perception and recognition of the global shape of the object. Accordingly, the part importance measure is defined based on the ability to estimate/recall the global shapes of objects from the local part, namely the part's \"shape reconstructability\". More precisely, the shape reconstructability of a part is determined by two factors-part variation and part uniqueness. (i) Part variation measures the precision of the global shape reconstruction, i.e. the consistency of the reconstructed global shape with the true object shape; and (ii) part uniqueness quantifies the ambiguity of matching the part to the object, i.e. taking into account that the part could be matched to the object at several different locations. Taking both these factors into consideration, an information theoretic formulation is proposed to measure part importance by the conditional entropy of the reconstruction of the object shape from the part. Experimental results demonstrate the benefit with the proposed part importance in object detection, including the improvement of detection rate, localization accuracy, and detection efficiency. By comparing with other state-of-the-art object detectors in a challenging but common scenario, object detection with occlusions, we show a considerable improvement using the proposed importance measure, with the detection rate increased over . On a subset of the challenging PASCAL dataset, the Interpolated Average Precision (as used in the PASCAL VOC challenge) is improved by 4-8 %. Moreover, we perform a psychological experiment which provides evidence suggesting that humans use a similar measure for part importance when perceiving and recognizing shapes.", "paper_title": "A Shape Reconstructability Measure of Object Part Importance with Applications to Object Detection and Localization", "paper_id": "WOS:000336394900005"}