{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ldacs_system"}, {"score": 0.004304963945457799, "phrase": "existing_legacy_systems"}, {"score": 0.003973971215091993, "phrase": "jtids_impulsive_interference"}, {"score": 0.003869373085652601, "phrase": "novel_idea"}, {"score": 0.003422462630994095, "phrase": "blanking_operation"}, {"score": 0.0033680968918579717, "phrase": "corrupted_samples"}, {"score": 0.0031760175583084274, "phrase": "adopted_retransmission_policy"}, {"score": 0.00256514094268541, "phrase": "useful_information"}, {"score": 0.002418742283474052, "phrase": "soft_combining_approach"}, {"score": 0.002317533977770783, "phrase": "paper_highlight"}, {"score": 0.0022928991183989115, "phrase": "good_behavior"}, {"score": 0.002256435842862802, "phrase": "proposed_methods"}, {"score": 0.0022324489895237504, "phrase": "significant_advantages"}, {"score": 0.0021735890994119757, "phrase": "traditional_blanking_method"}, {"score": 0.0021049977753042253, "phrase": "bit_error_rate"}], "paper_keywords": ["JTIDS", " LDACS", " Spectrum sensing", " Blanking", " Symbol recombining"], "paper_abstract": "Future digital air/ground communication systems (LDACS) will operate on the L-Band where the coexistence with existing legacy systems shall be guaranteed. This paper proposes a scheme to detect and mitigate the JTIDS impulsive interference on LDACS-1 system. The novel idea advised here is the transmission of two copies of the symbols received with interference that are suitably combined at the receiver after a blanking operation of the corrupted samples. In particular two alternatives are presented that differ for the adopted retransmission policy, namely full combining scheme, where all the symbols are transmitted twice, and partial combining scheme, which foresees the retransmission of only those symbols where interference has been detected. Both these methods permit to efficiently remove the interference without affecting the useful information and exploiting profitably the diversity gain against noise through the soft combining approach. The numerical results provided in the paper highlight a good behavior of the proposed methods and significant advantages in comparison with the traditional blanking method, either in terms of Bit Error Rate and throughput.", "paper_title": "A Novel Mitigation Scheme for JTIDS Impulsive Interference on LDACS System Based on Sensing and Symbol Retransmission", "paper_id": "WOS:000324109100005"}