{"auto_keywords": [{"score": 0.047781951057069436, "phrase": "older_adults"}, {"score": 0.010981971548445036, "phrase": "health_information"}, {"score": 0.00481495049065317, "phrase": "health_information-seeking_behaviors"}, {"score": 0.004154995396099332, "phrase": "health-related_information"}, {"score": 0.003991196463806465, "phrase": "information-seeking_characteristics"}, {"score": 0.0038338299812503, "phrase": "retirement_communities"}, {"score": 0.003505908076430666, "phrase": "respondents'_mean_age"}, {"score": 0.0034437574674180365, "phrase": "average_scores"}, {"score": 0.003382704886584695, "phrase": "particular_sources"}, {"score": 0.0027907771648224273, "phrase": "greater_amount"}, {"score": 0.0025632898741546556, "phrase": "nonliving_source"}, {"score": 0.002241171326888997, "phrase": "dependable_online_sources"}], "paper_keywords": ["Health Information National Trends Survey", " Health information-seeking behavior", " Krantz Health Opinion Survey", " Survey"], "paper_abstract": "This study aims to examine which resources older adults utilize for their health information needs, how trustworthy and reliable they find these resources, and the difficulties they face in obtaining health-related information. A 41-item survey designed to understand the information-seeking characteristics of older adults was developed and distributed to retirement communities. Some items were taken from the Health Information National Trends Survey. Of 1520 surveys, 403 were returned completed (26.6%). Respondents' mean age was 77.65 years. Average scores indicated respondents trusted particular sources of health information in the following order (highest to lowest): health care providers, pharmacists, friends and relatives, retirement community staff, newspapers, the Internet, television, and the radio. In conclusion, older adults have a greater amount of trust in a person with whom they are able to actively discuss their health as opposed to a nonliving source, which they have to access or manipulate, such as the Internet. Efforts must be made to help older adults better navigate and utilize the Internet and recognize dependable online sources so that they may increase their trust in its use, thereby increasing satisfaction with their own ability to seek and use sources of health information.", "paper_title": "Examining Health Information-Seeking Behaviors of Older Adults", "paper_id": "WOS:000327049200006"}