{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "granular_worlds"}, {"score": 0.004590820632326585, "phrase": "granular_algorithm"}, {"score": 0.004377077848734575, "phrase": "fuzzy_rulebases"}, {"score": 0.004064117897000019, "phrase": "different_granulations"}, {"score": 0.0035408501923902477, "phrase": "information_granularity"}, {"score": 0.0034849681064606543, "phrase": "target_world"}, {"score": 0.003304965389155549, "phrase": "first-order_interpolation_algorithm"}, {"score": 0.0032355864829403413, "phrase": "linguistic_arithmetic"}, {"score": 0.003150900886669123, "phrase": "elementary_granular_computing_operations"}, {"score": 0.002988101395789399, "phrase": "common_\"fuzzy-pd\"_rulebase"}, {"score": 0.0025214217930287003, "phrase": "\"natural\"_granularity"}, {"score": 0.0023408288327263316, "phrase": "three-different_granulations"}, {"score": 0.0021049977753042253, "phrase": "minimum_necessary_precision"}], "paper_keywords": ["fuzzy systems", " granular computing", " granular worlds", " granular algorithms"], "paper_abstract": "In this paper, we describe a granular algorithm for translating information between two granular worlds, represented as fuzzy rulebases. These granular worlds are defined on the same universe of discourse, but employ different granulations of this universe. In order to translate information from one granular world to the other, we must regranulate the information so that it matches the information granularity of the target world. This is accomplished through the use of a first-order interpolation algorithm, implemented using linguistic arithmetic, a set of elementary granular computing operations. We first demonstrate this algorithm by studying the common \"fuzzy-PD\" rulebase at several different granularities, and conclude that the \"3 x 3\" granulation may be too coarse for this objective. We then examine the question of what the \"natural\" granularity of a system might be; this is studied through a 10-fold cross-validation experiment involving three-different granulations of the same underlying mapping. For the problem under consideration, we find that a 7 x 7 granulation appears to be the minimum necessary precision. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Regranulation: A granular algorithm enabling communication between granular worlds", "paper_id": "WOS:000242509400006"}