{"auto_keywords": [{"score": 0.04186146148425489, "phrase": "high-resolution_climate_models"}, {"score": 0.00481495049065317, "phrase": "high_spatial_and_temporal_resolution_data"}, {"score": 0.004643839937761046, "phrase": "modern_climate_models"}, {"score": 0.003898411343926653, "phrase": "selectively_outputting_regions"}, {"score": 0.003692271726952282, "phrase": "global_cloud-resolving_model"}, {"score": 0.003080449000295983, "phrase": "implementation_challenges"}, {"score": 0.0030251262102203385, "phrase": "global_parameters"}, {"score": 0.0029707940194245216, "phrase": "strictly_core-localized_model"}, {"score": 0.0029351141718104725, "phrase": "properly_formatting_output_files"}, {"score": 0.002813566267090177, "phrase": "global_grid"}, {"score": 0.002404447017429959, "phrase": "dual_output_rates"}, {"score": 0.0021049977753042253, "phrase": "particular_interest"}], "paper_keywords": ["Global cloud-resolving model", " software agent", " Hoshen-Kopelman algorithm", " parallel clustering"], "paper_abstract": "Fine cell granularity in modern climate models can produce terabytes of data in each snapshot, causing significant I/O overhead. To address this issue, a method of reducing the I/O latency of high-resolution climate models by identifying and selectively outputting regions of interest is presented. Working with a global cloud-resolving model and running with up to 10,240 processors on a Cray XE6, this method provides significant I/O bandwidth reduction depending on the frequency of writes and the size of the region of interest. The implementation challenges of determining global parameters in a strictly core-localized model and properly formatting output files that only contain subsections of the global grid are addressed, as well as the overall bandwidth impact and benefits of the method. The gains in I/O throughput provided by this method allow dual output rates for high-resolution climate models: a low-frequency global snapshot as well as a high-frequency regional snapshot when events of particular interest occur.", "paper_title": "A global climate model agent for high spatial and temporal resolution data", "paper_id": "WOS:000349452000009"}