{"auto_keywords": [{"score": 0.03728974906367277, "phrase": "update_complexity"}, {"score": 0.03653034604293921, "phrase": "high_probability"}, {"score": 0.00481495049065317, "phrase": "expected_doubly-logarithmic_time"}, {"score": 0.004742379087286591, "phrase": "classic_solution"}, {"score": 0.004614483128885678, "phrase": "orthogonal_query_range"}, {"score": 0.004276949941406725, "phrase": "logarithmic_worst_case_complexity"}, {"score": 0.004238134740341528, "phrase": "main_and_external_memory"}, {"score": 0.003939980614608309, "phrase": "input_coordinates"}, {"score": 0.00386876598761639, "phrase": "specific_probability_distributions"}, {"score": 0.0037988336463795963, "phrase": "linear_space_solutions"}, {"score": 0.0037189391452075024, "phrase": "ram"}, {"score": 0.003353521531649663, "phrase": "input_points"}, {"score": 0.0028715299874549245, "phrase": "smooth_distributions"}, {"score": 0.002828166765606611, "phrase": "deleted_points"}, {"score": 0.0027601397818618617, "phrase": "currently_stored_points"}, {"score": 0.0023849158959156026, "phrase": "realistic_distributions"}, {"score": 0.0023632309822037637, "phrase": "data_structures"}, {"score": 0.0022923586577645143, "phrase": "assumed_distributions"}, {"score": 0.0022508572821818124, "phrase": "known_data_structures"}, {"score": 0.0021900066569764862, "phrase": "weight_balanced_exponential_tree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["3-Sided range reporting", " Doubly logarithmic", " Average case analysis", " Dynamic data structures", " Computational geometry"], "paper_abstract": "The Priority Search Tree is the classic solution for the problem of dynamic 2-dimensional searching for the orthogonal query range of the form [a, b] x (-infinity, c] (3-sided rectangle). It supports all operations in logarithmic worst case complexity in both main and external memory. In this work we show that the update and query complexities can be improved to expected doubly-logarithmic, when the input coordinates are being continuously drawn from specific probability distributions. We present three pairs of linear space solutions for the problem, i.e. a RAM and a corresponding I/O model variant: (1) First, we improve the update complexity to doubly-logarithmic expected with high probability, under the most general assumption that both the x- and y-coordinates of the input points are continuously being drawn from a distribution whose density function is unknown but fixed. (2) Next, we improve both the query complexity to doubly-logarithmic expected with high probability and the update complexity to doubly-logarithmic amortized expected, by assuming that only the x-coordinates are being drawn from a class of smooth distributions, and that the deleted points are selected uniformly at random among the currently stored points. In fact, the y-coordinates are allowed to be arbitrarily distributed. (3) Finally, we improve both the query and the update complexity to doubly-logarithmic expected with high probability by moreover assuming the y-coordinates to be continuously drawn from a more restricted class of realistic distributions. All data structures are deterministic and their complexity's expectation is with respect to the assumed distributions. They comprise combinations of known data structures and of two new data structures introduced here, namely the Weight Balanced Exponential Tree and the External Modified Priority Search Tree. (C) 2014 Elsevier B.V. All rights", "paper_title": "Dynamic 3-sided planar range queries with expected doubly-logarithmic time", "paper_id": "WOS:000334006400005"}