{"auto_keywords": [{"score": 0.048218728842235804, "phrase": "automatic_entity_summarization"}, {"score": 0.004815149279107745, "phrase": "wikipedia"}, {"score": 0.004733901576706854, "phrase": "empirical_findings"}, {"score": 0.004498812433096501, "phrase": "entity-centric_structured_data"}, {"score": 0.00399449659126893, "phrase": "information_overload"}, {"score": 0.0037745459666402915, "phrase": "limited_number"}, {"score": 0.0031308163228919773, "phrase": "extensive_studies"}, {"score": 0.0028919522313933525, "phrase": "empirical_support"}, {"score": 0.002843180211561427, "phrase": "future_research"}, {"score": 0.0027017308406240563, "phrase": "large-scale_statistical_analysis"}, {"score": 0.0025819103625985915, "phrase": "dbpedia"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DBpedia", " Entity summarization", " Feature selection", " Property ranking", " Wikipedia"], "paper_abstract": "The volume of entity-centric structured data grows rapidly on the Web. The description of an entity, composed of property-value pairs (a.k.a. features), has become very large in many applications. To avoid information overload, efforts have been made to automatically select a limited number of features to be shown to the user based on certain criteria, which is called automatic entity summarization. However, to the best of our knowledge, there is a lack of extensive studies on how humans rank and select features in practice, which can provide empirical support and inspire future research. In this article, we present a large-scale statistical analysis of the descriptions of entities provided by DBpedia and the abstracts of their corresponding Wikipedia articles, to empirically study, along several different dimensions, which kinds of features are preferable when humans summarize. Implications for automatic entity summarization are drawn from the findings. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Preferences in Wikipedia abstracts: Empirical findings and implications for automatic entity summarization", "paper_id": "WOS:000333492200003"}