{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "generalized_eigenvalues"}, {"score": 0.004304963945457799, "phrase": "multi-category_proximal_support_vector_classification"}, {"score": 0.004103212598803194, "phrase": "support_vector_machines"}, {"score": 0.00304321897427383, "phrase": "test_samples"}, {"score": 0.002994859407965545, "phrase": "multicategory_classification_tasks"}, {"score": 0.002947266048104005, "phrase": "training_point"}, {"score": 0.0027058852678238632, "phrase": "fuzzy_setting"}, {"score": 0.0026345758986796703, "phrase": "fuzzy_multi-category_classifier"}, {"score": 0.0025243592424524764, "phrase": "training_samples"}, {"score": 0.0024578219177450876, "phrase": "generalization_ability"}, {"score": 0.0023802825369325354, "phrase": "desired_classifier"}, {"score": 0.0021735890994119757, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_classifier"}], "paper_keywords": ["support vector machines", " generalized eigenvalues", " proximal classifier", " multi-category classification", " fuzzy data classification"], "paper_abstract": "Given a dataset, where each point is labeled with one of M labels, we propose a technique for multi-category proximal support vector classification via generalized eigenvalues (MGEPSVMs). Unlike Support Vector Machines that classify points by assigning them to one of M disjoint half-spaces, here points are classified by assigning them to the closest of M non-parallel planes that are close to their respective classes. When the data contains samples belonging to several classes, classes often overlap, and classifiers that solve for several non-parallel planes may often be able to better resolve test samples. In multicategory classification tasks, a training point may have similarities with prototypes of more than one class. This information can be used in a fuzzy setting. We propose a fuzzy multi-category classifier that utilizes information about the membership of training samples, to improve the generalization ability of the classifier. The desired classifier is obtained by using one-from-rest (OFR) separation for each class, i.e. 1: M -1 classification. Experimental results demonstrate the efficacy of the proposed classifier over MGEPSVMs.", "paper_title": "Fuzzy multi-category proximal support vector classification via generalized eigenvalues", "paper_id": "WOS:000244305200009"}