{"auto_keywords": [{"score": 0.043743228649701246, "phrase": "distributed_environment"}, {"score": 0.03963620921346668, "phrase": "multidisciplinary_simulations"}, {"score": 0.030660592326805094, "phrase": "model-driven_approach"}, {"score": 0.00481495049065317, "phrase": "multidisciplinary_collaborative_simulation"}, {"score": 0.0047810714349158165, "phrase": "virtual_product_development"}, {"score": 0.004664352260912174, "phrase": "complex_artifacts"}, {"score": 0.004550469496119256, "phrase": "distributed_and_collaborative_paradigm"}, {"score": 0.004502513902377422, "phrase": "simulation_environments"}, {"score": 0.004285289574869884, "phrase": "design_teams"}, {"score": 0.00422516469733364, "phrase": "multidisciplinary_simulation"}, {"score": 0.004121960535174029, "phrase": "current_simulation_tools"}, {"score": 0.003923023699005215, "phrase": "specific_problems"}, {"score": 0.0038953958723049287, "phrase": "different_disciplines"}, {"score": 0.0033937776228549557, "phrase": "distributed_simulation_models"}, {"score": 0.0032991276152705934, "phrase": "computational_infrastructure"}, {"score": 0.003264316172836322, "phrase": "high-level_modelling_approach"}, {"score": 0.003150900886669123, "phrase": "novel_combination"}, {"score": 0.0030630037175103032, "phrase": "distributed_models"}, {"score": 0.002833689453299307, "phrase": "high-level_model"}, {"score": 0.0028037753646260937, "phrase": "simulation_system"}, {"score": 0.0025573643582417573, "phrase": "prototype_tool"}, {"score": 0.0022434880661725493, "phrase": "high-level_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The design and development of complex artifacts and systems is shifting towards a distributed and collaborative paradigm. The simulation environments for such a paradigm, therefore, need to take into account the cooperation between design teams, i.e. supporting multidisciplinary simulation in a distributed environment. However, current simulation tools can not fulfil this requirement as they have been developed to solve the specific problems from different disciplines. Although it's already possible to perform multidisciplinary simulations by using several tools together, it is very difficult to implement it when these tools are distributed on the Internet. A solution which can support the integration of distributed simulation models at run-time is presented, involving a computational infrastructure and a high-level modelling approach. Specifically, the infrastructure is constructed by a novel combination of two distributed computing techniques to implement the synchronization of distributed models, as well as to ensure the interoperability at run-time. In addition, a model-driven approach is developed to bridge the high-level model of a simulation system and the infrastructure which implements this model. The solution is evaluated by making a comparison with other approaches, as well as by developing a prototype tool. It's shown in the evaluation that (1) it is viable to develop multidisciplinary simulations in a distributed environment using this solution: (2) the model-driven approach allows designers to focus only on the high-level structure of a design without getting concerned with the details of the infrastructure. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A model-driven approach to multidisciplinary collaborative simulation for virtual product development", "paper_id": "WOS:000276925900006"}