{"auto_keywords": [{"score": 0.03953876560784093, "phrase": "object_surface"}, {"score": 0.008713768692145013, "phrase": "video_projector"}, {"score": 0.008655428162017522, "phrase": "real_object_surface"}, {"score": 0.006956387511561103, "phrase": "geometry_registration"}, {"score": 0.006886519417712533, "phrase": "rendered_image"}, {"score": 0.004639612079116459, "phrase": "novel_virtual_display_system"}, {"score": 0.00438105507792004, "phrase": "digital_images"}, {"score": 0.00430777589162606, "phrase": "real_surface"}, {"score": 0.004278807087784626, "phrase": "arbitrary_shape"}, {"score": 0.004178935413340453, "phrase": "uncalibrated_camera_and_video_projector"}, {"score": 0.004067635935640407, "phrase": "virtual_object"}, {"score": 0.003959288961559545, "phrase": "white_object"}, {"score": 0.003919404114585274, "phrase": "real_world"}, {"score": 0.0035900807334877218, "phrase": "small_rectangular_regions"}, {"score": 0.00348263058839775, "phrase": "projector_image_plane"}, {"score": 0.0032115093493071366, "phrase": "conventional_method"}, {"score": 0.0029118285733827406, "phrase": "color-coded_checker_patterns"}, {"score": 0.002721562843196732, "phrase": "projection_image"}, {"score": 0.0024842242921857705, "phrase": "second_process"}, {"score": 0.0022370795358896784, "phrase": "real_paper_surface"}, {"score": 0.0021192805640815795, "phrase": "virtual_museum"}], "paper_keywords": ["texture mapping onto arbitrary shaped surface", " camera", " video projector", " homography", " calibration free"], "paper_abstract": "In this paper, we propose a novel virtual display system for a real object surface by using a video projector, so that the viewer can feel as if digital images are printed on the real surface with arbitrary shape. This system consists of an uncalibrated camera and video projector connected to a same PC and creates a virtual object by rendering 2D contents preserved beforehand onto a white object in a real world via a projector. For geometry registration between the rendered image and the object surface correctly, we regard the object surface as a set of a number of small rectangular regions and perform geometry registration by calculating homographies between the projector image plane and the each divided regions. By using such a homography-based method, we can avoid calibration of a camera and a projector that is necessary in a conventional method. In this system, we perform following two processes. First of all, we acquire the status of the object surface from images which capture the scene that color-coded checker patterns are projected on it and generate image rendered on it without distortion by calculating homographies. After once the projection image is generated, the rendered image can be updated if the object surface moves, or refined when it is stationary by observing the object surface. By this second process, the system always offers more accurate display. In implementation, we demonstrate our system in various conditions. This system enables it to project them as if it is printed on a real paper surface of a book. By using this system, we expect the realization of a virtual museum or other industrial application.", "paper_title": "Calibration free virtual display system using video projector onto real object surface", "paper_id": "WOS:000234952100011"}