{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "autonomous_multi-robot_exploration"}, {"score": 0.0047273577269638725, "phrase": "mobile_robots"}, {"score": 0.004536029676655286, "phrase": "human_involvement"}, {"score": 0.003970439654470374, "phrase": "higher_levels"}, {"score": 0.0036553070575015344, "phrase": "unknown_areas"}, {"score": 0.0034911335714333507, "phrase": "unique_challenges"}, {"score": 0.003427540517249369, "phrase": "limited_sensing_accuracy"}, {"score": 0.0033961782274326948, "phrase": "onboard_computing_resources"}, {"score": 0.0031553611552558986, "phrase": "unstructured_environments"}, {"score": 0.003126481516783286, "phrase": "design_and_implementation_details"}, {"score": 0.0027741761880779535, "phrase": "multi-robot_system"}, {"score": 0.0024842242921857705, "phrase": "'onto_the_surface"}, {"score": 0.00241658945942583, "phrase": "environment'_events"}, {"score": 0.0023834640793589435, "phrase": "simulated_planetary_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile robots", " Distributed robots", " Multi-robot team", " Low-cost SLAM", " Planetary exploration"], "paper_abstract": "Mobile robots are becoming more heavily used in environments where human involvement is limited, impossible, or dangerous. These robots perform some of the more laborious human tasks oil Earth and throughout the solar system, simultaneously saving resources and offering automation. Higher levels of autonomy are also being sought in these applications, such as distributed exploration and mapping of unknown areas. Smaller, less expensive mobile robots are becoming more prevalent, which introduces unique challenges in terms of limited sensing accuracy and onboard computing resources. This paper presents a novel low-cost, limited-resource approach to autonomous multi-robot mapping and exploration in unstructured environments. Design and implementation details are presented, along with results from two planetary style environments. Results demonstrate that low-cost ($ 1250) mobile robots capable of simultaneous localization and mapping can be Successfully constructed. The multi-robot system presented in this paper participated in the 2008 International Conference oil Robotics and Automation (ICRA) Space Robotics Challenge, receiving two awards for successfully completing the 'Onto the Surface' and 'Map the Environment' events in a simulated planetary environment. This work demonstrates not only that such systems are possible, but also that this direction of research is important and needs attention. Published by Elsevier B.V.", "paper_title": "A novel low-cost, limited-resource approach to autonomous multi-robot exploration and mapping", "paper_id": "WOS:000275072000008"}