{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bibliographic_citations"}, {"score": 0.004622662375029505, "phrase": "difficult_problem"}, {"score": 0.004487635647709636, "phrase": "research_community"}, {"score": 0.004198010835867604, "phrase": "heuristic-based_hierarchical_clustering_method"}, {"score": 0.003970930401776528, "phrase": "similar_author_names"}, {"score": 0.003897989308486044, "phrase": "similarity_measures"}, {"score": 0.003566028957296066, "phrase": "disambiguation_task"}, {"score": 0.0035004992651905585, "phrase": "fused_clusters"}, {"score": 0.003410768840300913, "phrase": "next_round"}, {"score": 0.0031317713853981064, "phrase": "real-world_digital_libraries"}, {"score": 0.002689666606553487, "phrase": "author_name"}, {"score": 0.002361876178411006, "phrase": "supervised_method"}, {"score": 0.0021604504765314497, "phrase": "privileged_information"}, {"score": 0.0021049977753042253, "phrase": "correct_number"}], "paper_keywords": [""], "paper_abstract": "Name ambiguity in the context of bibliographic citations is a difficult problem which, despite the many efforts from the research community, still has a lot of room for improvement. In this article, we present a heuristic-based hierarchical clustering method to deal with this problem. The method successively fuses clusters of citations of similar author names based on several heuristics and similarity measures on the components of the citations (e.g., coauthor names, work title, and publication venue title). During the disambiguation task, the information about fused clusters is aggregated providing more information for the next round of fusion. In order to demonstrate the effectiveness of our method, we ran a series of experiments in two different collections extracted from real-world digital libraries and compared it, under two metrics, with four representative methods described in the literature. We present comparisons of results using each considered attribute separately (i.e., coauthor names, work title, and publication venue title) with the author name attribute and using all attributes together. These results show that our unsupervised method, when using all attributes, performs competitively against all other methods, under both metrics, loosing only in one case against a supervised method, whose result was very close to ours. Moreover, such results are achieved without the burden of any training and without using any privileged information such as knowing a priori the correct number of clusters.", "paper_title": "An Unsupervised Heuristic-Based Hierarchical Method for Name Disambiguation in Bibliographic Citations", "paper_id": "WOS:000281011400010"}