{"auto_keywords": [{"score": 0.04808171687412105, "phrase": "partition_equilibrium"}, {"score": 0.027848622641302175, "phrase": "resource_selection_games"}, {"score": 0.008211247434419089, "phrase": "super-strong_equilibrium"}, {"score": 0.006668447181436651, "phrase": "general_resource_selection_games"}, {"score": 0.00481495049065317, "phrase": "partition_equilibrium_always"}, {"score": 0.0038253590626087237, "phrase": "model_coalitions"}, {"score": 0.003760685138103153, "phrase": "social_context"}, {"score": 0.0033660587983313536, "phrase": "fixed_partition"}, {"score": 0.003025597247856977, "phrase": "resource_selection_game"}, {"score": 0.0028992294924613327, "phrase": "open_question"}, {"score": 0.0024863459251358217, "phrase": "nash_equilibrium"}, {"score": 0.0023123057299992587, "phrase": "individual_players"}, {"score": 0.002253826965566618, "phrase": "coalitional_deviations"}], "paper_keywords": ["Strong equilibrium", " Nash equilibrium", " Load balancing", " Resource selection"], "paper_abstract": "We consider the existence of Partition Equilibrium in Resource Selection Games. Super-strong equilibrium, where no subset of players has an incentive to change their strategies collectively, does not always exist in such games. We show, however, that partition equilibrium (introduced in (Feldman and Tennenholtz in SAGT, pp. 48-59, 2009) to model coalitions arising in a social context) always exists in general resource selection games, as well as how to compute it efficiently. In a partition equilibrium, the set of players has a fixed partition into coalitions, and the only deviations considered are by coalitions that are sets in this partition. Our algorithm to compute a partition equilibrium in any resource selection game (i.e., load balancing game) settles the open question from (Feldman and Tennenholtz in SAGT, pp. 48-59, 2009) about existence of partition equilibrium in general resource selection games. Moreover, we show how to always find a partition equilibrium which is also a Nash equilibrium. This implies that in resource selection games, we do not need to sacrifice the stability of individual players when forming solutions stable against coalitional deviations. In addition, while super-strong equilibrium may not exist in resource selection games, we show that its existence can be decided efficiently, and how to find one if it exists.", "paper_title": "Partition Equilibrium Always Exists in Resource Selection Games", "paper_id": "WOS:000319706700005"}