{"auto_keywords": [{"score": 0.04495971759688538, "phrase": "group_profile"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_group_recommendation"}, {"score": 0.004717325943509345, "phrase": "remarkable_recommender_systems"}, {"score": 0.0044512920090463105, "phrase": "group_member"}, {"score": 0.004214569581360156, "phrase": "equal_weighting"}, {"score": 0.00417160036938041, "phrase": "individual_preferences"}, {"score": 0.0038960785110831162, "phrase": "realistic_situation"}, {"score": 0.0037651925588909783, "phrase": "group_act"}, {"score": 0.0034215569542785907, "phrase": "different_expectations"}, {"score": 0.0032952735750239924, "phrase": "different_behaviour"}, {"score": 0.002984173420996039, "phrase": "multi-agent_system"}, {"score": 0.002702363975375762, "phrase": "corresponding_user"}, {"score": 0.0026656357767832245, "phrase": "different_useragents"}, {"score": 0.002455489835065937, "phrase": "negotiatoragent"}, {"score": 0.002148677187261496, "phrase": "heterogeneous_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Group recommender systems", " Group profile", " Negotiation", " Alternative offers protocol"], "paper_abstract": "Over the last years, some remarkable recommender systems for group of users have been developed. When using most of these systems, each group member communicates his/her preferences to the system, which obtains a group profile as the result of an equal weighting of the individual preferences. This way, no member is particularly dissatisfied with the recommendations. However, this is not a realistic situation, given that not all the members in a group act in the same manner. This paper deals with the problem of recommendation for a group of users, where, besides his/her own preferences, each user may have different expectations about the result of the recommendation and may exhibit a different behaviour with respect to the other group members. Moreover, all this information is private and may be revealed under certain circumstances. In this context, we have opted for building a multi-agent system, where an agent acts on behalf of one group member. We have implemented a UserAgent that can be configured in order to exhibit the behaviour desired by the corresponding user. Then, different UserAgents negotiate with the aim of building a group profile that satisfies their particular minimum requirements, while preserving some privacy. Moreover, we have designed a NegotiatorAgent, which governs the negotiation and may act as a mediator in order to facilitate the agreement. Finally, we have performed some experiments that show that this mechanism is able to give a response in this heterogeneous environment. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A negotiation framework for heterogeneous group recommendation", "paper_id": "WOS:000330158700028"}