{"auto_keywords": [{"score": 0.04967088836874542, "phrase": "protein_functional_sites"}, {"score": 0.0492663932388163, "phrase": "phylogenetic_motifs"}, {"score": 0.00481495049065317, "phrase": "position-specific_predictions"}, {"score": 0.004652845998457721, "phrase": "accurate_computational_prediction"}, {"score": 0.00445783412174435, "phrase": "recent_high-throughput_sequencing_efforts"}, {"score": 0.004326188427877999, "phrase": "position-specific_conservation_scores"}, {"score": 0.004039639718055365, "phrase": "high_false_positive_rates"}, {"score": 0.003988055287053139, "phrase": "limiting_factor"}, {"score": 0.0030837288356760973, "phrase": "prediction_accuracy"}, {"score": 0.003031287195944274, "phrase": "statistically_significant_way"}, {"score": 0.00296698375549856, "phrase": "underlying_conservation_scores"}, {"score": 0.0029416448256236057, "phrase": "increased_accuracy"}, {"score": 0.002904040426340639, "phrase": "general_result"}, {"score": 0.0024884913795612707, "phrase": "critical_insight"}, {"score": 0.0024566655761509276, "phrase": "relative_importance"}, {"score": 0.0024148618915672353, "phrase": "alignment_conservation"}, {"score": 0.0023233800372985686, "phrase": "phylogenetic_concepts"}, {"score": 0.002244969789802093, "phrase": "presented_results"}, {"score": 0.0021973099304606076, "phrase": "functional_site_definition"}, {"score": 0.0021049977753042253, "phrase": "prediction_community"}], "paper_keywords": [""], "paper_abstract": "Motivation: Accurate computational prediction of protein functional sites is critical to maximizing the utility of recent high-throughput sequencing efforts. Among the available approaches, position-specific conservation scores remain among the most popular due to their accuracy and ease of computation. Unfortunately, high false positive rates remain a limiting factor. Using phylogenetic motifs (PMs), we have developed two combined (conservationPMs) prediction schemes that significantly improve prediction accuracy. Results: Our first approach, called position-specific MINER (psMINER), rank orders alignment columns by conservation. Subsequently, positions that are also not identified as PMs are excluded from the prediction set. This approach improves prediction accuracy, in a statistically significant way, compared to the underlying conservation scores. Increased accuracy is a general result, meaning improvement is observed over several different conservation scores that span a continuum of complexity. In addition, a hybrid MINER (hMINER) that quantitatively considers both scoring regimes provides further improvement. More importantly, it provides critical insight into the relative importance of phylogeny versus alignment conservation. Both methods outperform other common prediction algorithms that also utilize phylogenetic concepts. Finally, we demonstrate that the presented results are critically sensitive to functional site definition, thus highlighting the need for more complete benchmarks within the prediction community.", "paper_title": "Improving position-specific predictions of protein functional sites using phylogenetic motifs", "paper_id": "WOS:000259973500006"}