{"auto_keywords": [{"score": 0.049561472167574526, "phrase": "firewall_policy_specification"}, {"score": 0.036598248434623164, "phrase": "formal_framework"}, {"score": 0.03346188523139848, "phrase": "security_requirements"}, {"score": 0.00481495049065317, "phrase": "argumentation_logic"}, {"score": 0.004610058444728656, "phrase": "important_perimeter_security_mechanisms"}, {"score": 0.00456020621016909, "phrase": "imple-ment_an_organisation's_network_security_requirements"}, {"score": 0.004157561334726201, "phrase": "network_administrators"}, {"score": 0.004002242925856335, "phrase": "firewall_configuration_rules"}, {"score": 0.0034366728236876047, "phrase": "argumentation_based_preference_reasoning"}, {"score": 0.003308195943172624, "phrase": "network_abstractions"}, {"score": 0.0030654278282822027, "phrase": "declarative_manner"}, {"score": 0.003032228032253871, "phrase": "high-level_terms"}, {"score": 0.0025059724686541263, "phrase": "firewall_configurations"}, {"score": 0.0023346234464901978, "phrase": "inconsistency_property"}, {"score": 0.0022595316565074304, "phrase": "previous_research"}, {"score": 0.0021049977753042253, "phrase": "argumentation_reasoning_framework"}], "paper_keywords": [""], "paper_abstract": "Firewalls are important perimeter security mechanisms that imple-ment an organisation's network security requirements and can be notoriously difficult to configure correctly. Given their widespread use, it is crucial that network administrators have tools to translate their security requirements into firewall configuration rules and ensure that these rules are consistent with each other. In this paper we propose an approach to firewall policy specification and analysis that uses a formal framework for argumentation based preference reasoning. By allowing administrators to define network abstractions (e.g. subnets, protocols etc) security requirements can be specified in a declarative manner using high-level terms. Also it is possible to specify preferences to express the importance of one requirement over another. The use of a formal framework means that the security requirements defined can be automatically analysed for inconsistencies and firewall configurations can be automatically generated. We demonstrate that the technique allows any inconsistency property, including those identified in previous research, to be specified and automatically checked and the use of an argumentation reasoning framework provides administrators with information regarding the causes of the inconsistency.", "paper_title": "Using argumentation logic for firewall policy specification and analysis", "paper_id": "WOS:000242406000016"}