{"auto_keywords": [{"score": 0.04897469322900726, "phrase": "infinite_number"}, {"score": 0.03310942563843797, "phrase": "infinite-level_interpolation"}, {"score": 0.01557524067598944, "phrase": "fuzzy_rule_interpolation"}, {"score": 0.015219744311173556, "phrase": "activating_points"}, {"score": 0.014872239374032738, "phrase": "sparse_fuzzy_rules"}, {"score": 0.00481606614688862, "phrase": "inference"}, {"score": 0.004595356579614969, "phrase": "inference_method"}, {"score": 0.004447600571127578, "phrase": "fuzzy_rules"}, {"score": 0.00428451995524549, "phrase": "deduces_consequences"}, {"score": 0.003672427620845944, "phrase": "interpolated_fuzzy_rules"}, {"score": 0.003570889780957037, "phrase": "proposed_method"}, {"score": 0.0030178044717552605, "phrase": "least_upper_and_greatest_lower_bounds"}, {"score": 0.0027100527874262446, "phrase": "deduced_ones"}, {"score": 0.002479579797152119, "phrase": "practical_viewpoint"}, {"score": 0.0023551955270737215, "phrase": "nonlinear_mapping"}, {"score": 0.002237036807966899, "phrase": "alpha-geminas._thereby"}, {"score": 0.0021049977753042253, "phrase": "wide_variety"}], "paper_keywords": ["fuzzy inference", " sparse fuzzy rules", " fuzzy rule interpolation", " nonlinear mapping", " alpha-cut"], "paper_abstract": "An inference method for sparse fuzzy rules is proposed which interpolates fuzzy rules at an infinite number of activating points and deduces consequences based on alpha-GEMII (alpha-level-set and generalized-mean-based inference). The activating points, proposed in this paper, are determined so as to activate interpolated fuzzy rules by each given fact. The proposed method is named alpha-GEMINAS (alpha-GEMII-based inference with fuzzy rule interpolation at an infinite number of activating points). alpha-GEMINAS solves the problem in infinite-level interpolation where fuzzy rules are interpolated at the least upper and greatest lower bounds of an infinite number of alpha-cuts of each given fact. The infinite-level interpolation can nonlinearly transform the shapes of given membership functions to those of deduced ones in accordance even with sparse fuzzy rules under some conditions. These conditions are, however, strict from a practical viewpoint. alpha-GEMINAS can deduce consequences without these conditions and provide nonlinear mapping comparable with infinite-level interpolation. Simulation results demonstrate these properties of alpha-GEMINAS. Thereby, it is found that alpha-GEMINAS is practical and applicable to a wide variety of fields.", "paper_title": "Inference with Fuzzy Rule Interpolation at an Infinite Number of Activating Points", "paper_id": "WOS:000370188200010"}