{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "positional_uncertainty"}, {"score": 0.015567537886639652, "phrase": "spatial_decision-making"}, {"score": 0.004494570360108983, "phrase": "spatial_information"}, {"score": 0.003877737556673229, "phrase": "spatial_uncertainty"}, {"score": 0.003584025547693836, "phrase": "possible_effects"}, {"score": 0.003296212583539166, "phrase": "psychological_literature"}, {"score": 0.002538687900036229, "phrase": "significant_differences"}, {"score": 0.0025137856138000014, "phrase": "participants'_responses"}, {"score": 0.002146926767291475, "phrase": "strong_preferences"}], "paper_keywords": ["spatial information", " decision-making", " positional uncertainty", " cognitive testing"], "paper_abstract": "There is now increasing agreement that the uncertainty associated with spatial information should be represented to users in a manner that is comprehensive and unambiguous. To assist with this task, researchers have developed a variety of methods to portray spatial uncertainty. While there has been some testing of the effectiveness of these displays, the possible effects of such representations on decision-making have not yet been thoroughly investigated. Indeed, studies from the psychological literature indicate that people do not always make the same decisions when presented with the same information, and they can also be sensitive to the effects of presentation, task, and context. This paper examines how the use of four different methods to represent positional uncertainty can affect spatial decision-making. The authors found that extremely significant differences in participants' responses were exhibited, depending on the manner in which positional uncertainty was displayed, although little difference was observed in the ability of the participants to comprehend the four display methods. In addition, strong preferences were recorded for certain representations over others.", "paper_title": "Testing the effects of positional uncertainty on spatial decision-making", "paper_id": "WOS:000247000600003"}