{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sample_mix-ups"}, {"score": 0.00729352419436702, "phrase": "genome-wide_studies"}, {"score": 0.006487907113854602, "phrase": "mixupmapper"}, {"score": 0.005456201974717133, "phrase": "incorrect_expression_phenotypes"}, {"score": 0.00457553517865013, "phrase": "small_genetic_effects"}, {"score": 0.004392565073466714, "phrase": "sample_collection"}, {"score": 0.004260134699483774, "phrase": "data_management"}, {"score": 0.0038862297330905836, "phrase": "post_hoc_methods"}, {"score": 0.0037498152007206815, "phrase": "unrelated_samples"}, {"score": 0.003351381374975648, "phrase": "gene_expression_levels"}, {"score": 0.0032008144731234265, "phrase": "publicly_available_human_genetical_genomics_datasets"}, {"score": 0.0030726480920918097, "phrase": "analyzed_samples"}, {"score": 0.0021484955960643167, "phrase": "explained_heritability"}, {"score": 0.002126635713519051, "phrase": "complex_traits"}, {"score": 0.0021049977753042253, "phrase": "genome-wide_association_datasets"}], "paper_keywords": [""], "paper_abstract": "Motivation: Sample mix-ups can arise during sample collection, handling, genotyping or data management. It is unclear how often sample mix-ups occur in genome-wide studies, as there currently are no post hoc methods that can identify these mix-ups in unrelated samples. We have therefore developed an algorithm (MixupMapper) that can both detect and correct sample mix-ups in genome-wide studies that study gene expression levels. Results: We applied MixupMapper to five publicly available human genetical genomics datasets. On average, 3% of all analyzed samples had been assigned incorrect expression phenotypes: in one of the datasets 23% of the samples had incorrect expression phenotypes. The consequences of sample mix-ups are substantial: when we corrected these sample mix-ups, we identified on average 15% more significant cis-expression quantitative trait loci (cis-eQTLs). In one dataset, we identified three times as many significant cis-eQTLs after correction. Furthermore, we show through simulations that sample mix-ups can lead to an underestimation of the explained heritability of complex traits in genome-wide association datasets.", "paper_title": "MixupMapper: correcting sample mix-ups in genome-wide datasets increases power to detect small genetic effects", "paper_id": "WOS:000292778700012"}