{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "relay_node"}, {"score": 0.011436519751766912, "phrase": "node_scheduling"}, {"score": 0.006759656126470509, "phrase": "wireless_networks"}, {"score": 0.006592841763747959, "phrase": "controllable_mobility"}, {"score": 0.004444203710097837, "phrase": "joint_relay_node_placement"}, {"score": 0.004181121847054168, "phrase": "relay_node_placement"}, {"score": 0.004040688646993605, "phrase": "multiple_nodes"}, {"score": 0.003511613254403125, "phrase": "lowest_weighted_throughput"}, {"score": 0.002362620540317279, "phrase": "simulation_results"}, {"score": 0.0022133711375320244, "phrase": "system_performance"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["joint optimization", " relay node placement", " node scheduling", " wireless networks"], "paper_abstract": "In this paper, we propose an algorithm for joint relay node placement and node scheduling in wireless networks. We consider a system that consists of a relay node with controllable mobility and multiple nodes that communicate with each other via the relay node. Each node communicates with the relay node according to its schedule. The objective of our algorithm is to maximize the lowest weighted throughput among those of all nodes. To this end, we consider a problem to optimally place the relay node and optimally schedule all nodes in the network. We develop three algorithms for relay node placement and node scheduling considering three different cases: when the location of the relay node is controllable while the node scheduling is fixed, when the node scheduling is controllable while the location of the relay node is fixed, and when both the location of the relay node and node scheduling are controllable. The simulation results show that by jointly optimizing relay node placement and node scheduling, we can improve system performance significantly in many cases. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Joint relay node placement and node scheduling in wireless networks with a relay node with controllable mobility", "paper_id": "WOS:000303860600004"}