{"auto_keywords": [{"score": 0.04582599200276382, "phrase": "sensing_area"}, {"score": 0.01458993196677037, "phrase": "starting_point"}, {"score": 0.0057624085342321526, "phrase": "optimal_robot"}, {"score": 0.005237076246556866, "phrase": "optimal_exploration"}, {"score": 0.00481495049065317, "phrase": "mobile_robots"}, {"score": 0.0047732596509542135, "phrase": "mobile_robot"}, {"score": 0.004650330504968421, "phrase": "polygonal_line"}, {"score": 0.004530552828603269, "phrase": "unknown_polygon"}, {"score": 0.004439486420991018, "phrase": "competitive_exploration_algorithm"}, {"score": 0.0036026484429137998, "phrase": "entire_polygon"}, {"score": 0.0034391729011989795, "phrase": "manhattan"}, {"score": 0.0034095661576497857, "phrase": "euclidean"}, {"score": 0.003331084078553706, "phrase": "exploration_performance"}, {"score": 0.0026791410961432677, "phrase": "manhattan_metric"}, {"score": 0.0026175952455594277, "phrase": "optimal_exploration_algorithm"}, {"score": 0.0024342079318127423, "phrase": "rectilinear_polygons"}, {"score": 0.0022439896633013297, "phrase": "arbitrary_convex_polygons"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Competitive algorithm", " Mobile robot", " On-line exploration", " Polygon"], "paper_abstract": "A mobile robot, represented by a point moving along a polygonal line in the plane, has to explore an unknown polygon and return to the starting point; The robot has a sensing area which can be a circle or a square centered at the robot. This area shifts while the robot moves inside the polygon, and at each point of its trajectory the robot \"sees\" (explores) all points for which the segment between the robot and the point is contained in the polygon and in the sensing area. We focus on two tasks: exploring the entire polygon and exploring only its boundary. We consider several scenarios: both shapes of the sensing area and the Manhattan and the Euclidean metrics. We focus on two quality benchmarks for exploration performance: optimality (the length of the trajectory of the robot is equal to that of the optimal robot knowing the polygon) and competitiveness (the length of the trajectory of the robot is at most a constant multiple of that of the optimal robot knowing the polygon). Most of our results concern rectilinear polygons. We show that optimal exploration is possible in only one scenario, that of exploring the boundary by a robot with square sensing area, starting at the boundary and using the Manhattan metric. For this case we give an optimal exploration algorithm, and in all other scenarios we prove impossibility of optimal exploration. For competitiveness the situation is more optimistic: we show a competitive exploration algorithm for rectilinear polygons whenever the sensing area is a square, for both tasks, regardless of the metric and of the starting point. Finally, we show a competitive exploration algorithm for arbitrary convex polygons, for both shapes of the sensing area, regardless of the metric and of the starting point. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Optimality and competitiveness of exploring polygons by mobile robots", "paper_id": "WOS:000285405100004"}