{"auto_keywords": [{"score": 0.030758346097077935, "phrase": "proposed_technique"}, {"score": 0.010612387000973441, "phrase": "project's_cost_predictability"}, {"score": 0.00792978684233222, "phrase": "cost_performance_indexes"}, {"score": 0.005413670029896, "phrase": "traditional_technique"}, {"score": 0.004769702911065878, "phrase": "earned_value_management"}, {"score": 0.004724878518219719, "phrase": "historical_data_of_cost_-_an_empirical_study"}, {"score": 0.0038382392088338784, "phrase": "performance_data"}, {"score": 0.0037486121194392564, "phrase": "normal_distribution"}, {"score": 0.003678414118674967, "phrase": "reliable_projections"}, {"score": 0.003378385493203297, "phrase": "worsening_tendency"}, {"score": 0.00314708280192844, "phrase": "evm_technique"}, {"score": 0.003073545175760353, "phrase": "historical_cost_performance_data"}, {"score": 0.0028360962841331634, "phrase": "empirical_study"}, {"score": 0.0026045914281028473, "phrase": "real_projects"}, {"score": 0.002426137929553722, "phrase": "hypotheses_tests"}, {"score": 0.002196609505859369, "phrase": "cost_performance_index"}, {"score": 0.0021049980887990318, "phrase": "eac"}], "paper_keywords": ["Cost estimation", " performance measures", " productivity"], "paper_abstract": "Although the Earned Value Management (EVM) technique has been used by several companies in various industrial sectors (software development, construction, aerospace, aeronautics, among others) for over 35 years to predict time and cost outcomes, many studies have found vulnerabilities, including: (i) cost performance data do not always have normal distribution, which makes reliable projections difficult; (ii) instability of cost performance indexes during the execution of projects, (iii) there is a worsening tendency in cost performance indexes when project approaches termination. This paper proposes an extension of the EVM technique through the integration of historical cost performance data of processes as a means to improve the project's cost predictability. The proposed technique was evaluated through an empirical study, which evaluated the implementation of the proposed technique in 22 software development projects. The proposed technique has been applied in real projects with the aim of evaluating the accuracy and variation compared to the traditional technique. Hypotheses tests with 95% significance level were performed, and the proposed technique was more accurate and more precise than the traditional technique for calculating the Cost Performance Index (CPI) and Estimates at Completion (EAC).", "paper_title": "A Proposal for the Improvement of Project's Cost Predictability Using Earned Value Management and Historical Data of Cost - An Empirical Study", "paper_id": "WOS:000354763600003"}