{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "resources_model"}, {"score": 0.029245254202259995, "phrase": "participants'_confidence"}, {"score": 0.004641351004344458, "phrase": "automated_process"}, {"score": 0.004556901872357751, "phrase": "present_study"}, {"score": 0.004312622975366676, "phrase": "potential_errors"}, {"score": 0.004208282550386197, "phrase": "automatic_interpretation"}, {"score": 0.004157058883925715, "phrase": "technical_documents"}, {"score": 0.0039341294012600085, "phrase": "supervised_retro-conversion"}, {"score": 0.0038862297330905836, "phrase": "architectural_floor_plans"}, {"score": 0.003769006950727621, "phrase": "distributed_cognition"}, {"score": 0.0036553070575015344, "phrase": "automated_assistance"}, {"score": 0.0031942814007173254, "phrase": "possible_errors"}, {"score": 0.0021441057555396013, "phrase": "automated_assistance_system"}, {"score": 0.0021049977753042253, "phrase": "improved_performances"}], "paper_keywords": [""], "paper_abstract": "The present study was designed to ascertain how far flagging up potential errors can improve the automatic interpretation of technical documents. We used the resources model to analyze the supervised retro-conversion of architectural floor plans from the perspective of distributed cognition. Results showed that automated assistance helps users to correct errors spotted by the system and saves time. Surprisingly, they also showed that flagging up possible errors may make users less effective in identifying and correcting errors that go unnoticed by the system. Responses to a questionnaire probing the participants' confidence in the system suggested that they were so trusting that they lowered their vigilance in those areas that had not been signaled by the system, leading to the identification of fewer errors there. Thus, although the participants' confidence in the automated assistance system led to improved performances in those areas it highlighted, it also meant that areas to which the system did not draw attention were less thoroughly checked.", "paper_title": "Application of the Resources Model to the Supervision of an Automated Process", "paper_id": "WOS:000345228500001"}