{"auto_keywords": [{"score": 0.04926219622874719, "phrase": "restaurant_service"}, {"score": 0.015586480634730926, "phrase": "intelligent_vehicles"}, {"score": 0.014071831337886991, "phrase": "multiple_tasks"}, {"score": 0.00481495049065317, "phrase": "multitasking_planning_and_executing"}, {"score": 0.004652016085325825, "phrase": "indoor_intelligent_vehicles"}, {"score": 0.004342430078306461, "phrase": "long_period"}, {"score": 0.0035620354052144656, "phrase": "traditional_htn_model"}, {"score": 0.003267925215811654, "phrase": "new_inserted_task"}, {"score": 0.0030898642396380662, "phrase": "global_plan"}, {"score": 0.0030109772626153797, "phrase": "maximal_weight_clique_problem"}, {"score": 0.0027741761880779535, "phrase": "protected_states"}, {"score": 0.0027503564589458837, "phrase": "goal_states"}, {"score": 0.002236055625099805, "phrase": "execution_monitoring"}, {"score": 0.0021232402128269906, "phrase": "drink_service"}, {"score": 0.0021049977753042253, "phrase": "restaurant_environment"}], "paper_keywords": [""], "paper_abstract": "Indoor intelligent vehicles have been applied widely in restaurant service, where they are usually demanded to work for long period for multiple tasks and face the challenges of uncertainty, efficiency, and working online. In this paper, we propose an approach of multitasking planning and executing by networking for intelligent vehicles working for restaurant service. As to increase the efficiency of accomplishing multiple tasks, traditional HTN model is adapted to present the property of executing in parallel for the plan. As working online, the new inserted task is decomposed to get its individual plan, which is then merged into the global plan by optimization modelled as a maximal weight clique problem through evaluating the relations among actions and optimizing based on maximal cost saving first. Additionally, the protected states and goal states of an action are monitored in execution monitoring while action executing. Once exception occurs, the replanning based on partially backtracking would repair it. Moreover, with the mechanism of cooperation by networking, vehicles can allocate tasks, share information, and cooperate for execution monitoring. Finally, the test and demonstration of the experiment for drink service in restaurant environment show the feasibility and the improvement on the efficiency of multitasking.", "paper_title": "Multitasking Planning and Executing of Intelligent Vehicles for Restaurant Service by Networking", "paper_id": "WOS:000364678900001"}