{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "finite_domains"}, {"score": 0.004539005582217309, "phrase": "functional_logic_programming"}, {"score": 0.004324985524216987, "phrase": "lazy_functional_logic_programming_language"}, {"score": 0.004233119608341877, "phrase": "finite_domain"}, {"score": 0.003990385737207714, "phrase": "constraint_logic_programming"}, {"score": 0.003802135020791801, "phrase": "functional_and_relational_notation"}, {"score": 0.0025409639091476363, "phrase": "programming_point"}, {"score": 0.002460295872115956, "phrase": "new_features"}, {"score": 0.0023189818169615135, "phrase": "performance_analysis"}, {"score": 0.0021049977753042253, "phrase": "closer_approach"}], "paper_keywords": ["constraint logic programming", " functional logic programming", " finite domains"], "paper_abstract": "In this paper, we present our proposal to Constraint Functional Logic Programming over Finite Domains (CFLP(FD)) with a lazy functional logic programming language which seamlessly embodies finite domain (FD) constraints. This proposal increases the expressiveness and power of constraint logic programming over finite domains (CLP(FD)) by combining functional and relational notation, curried expressions, higher-order functions, patterns, partial applications, non-determinism, lazy evaluation, logical variables, types, domain variables, constraint composition, and finite domain constraints. We describe the syntax of the language, its type discipline, and its declarative and operational semantics. We also describe TOY(FD), an implementation for CFLP(FD), and a comparison of our approach with respect to CLP(FD) from a programming point of view, showing the new features we introduce. And, finally, we show a performance analysis which demonstrates that our implementation is competitive with respect to existing CLP(FD) systems and that clearly outperforms the closer approach to CFLP(FD).", "paper_title": "Constraint functional logic programming over finite domains", "paper_id": "WOS:000250062600002"}