{"auto_keywords": [{"score": 0.0496578611773389, "phrase": "polygonal_meshes"}, {"score": 0.03488739830592305, "phrase": "existing_methods"}, {"score": 0.00481495049065317, "phrase": "topology_simplification"}, {"score": 0.00470975295439431, "phrase": "topological_complexity"}, {"score": 0.004606843145343611, "phrase": "large_impact"}, {"score": 0.00436890075128947, "phrase": "detection_algorithms"}, {"score": 0.0034714553759044664, "phrase": "novel_top-down_approach"}, {"score": 0.0031079352545607267, "phrase": "topologic_features"}, {"score": 0.0030399188412691914, "phrase": "carving_operations"}, {"score": 0.0029602552900111433, "phrase": "multiresolution_stream"}, {"score": 0.002908306074124806, "phrase": "increasing_topologic_level"}, {"score": 0.002807118943000936, "phrase": "carving_algorithm"}, {"score": 0.0027456676902333304, "phrase": "constrained_delaunay_tetrahedralization"}, {"score": 0.002661883310629088, "phrase": "tetrahedral_mesh"}, {"score": 0.002436289099444074, "phrase": "prioritized_manner"}, {"score": 0.0023935128386292966, "phrase": "quality_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Model simplification", " Topology simplification", " Level-of-detail generation", " Shape approximation", " Geometric modeling"], "paper_abstract": "The topological complexity of polygonal meshes has a large impact on the performance of various geometric processing algorithms, such as rendering and collision detection algorithms. Several approaches for simplifying topology have been discussed in the literature. These methods operate locally on models, which makes their effect on the topology hard to predict and analyze. Most existing methods tend to exhibit several disturbing artifacts, such as shrinking of the input and splitting of its components. We propose a novel top-down approach for topology simplification that avoids most problems that are common in existing methods. We start with a simple, genus-zero mesh that bounds the input and gradually introduce topologic features by a series of carving operations. This process yields a multiresolution stream of meshes with increasing topologic level of detail. We further present a carving algorithm that is based on constrained Delaunay tetrahedralization. The algorithm first constructs the tetrahedral mesh of the complement of the input with respect to its convex hull. It then proceeds to eliminate tetrahedra in a prioritized manner. We present quality results for two families of meshes that are difficult to simplify by all existing methods known to us: topologically complex meshes and highly clustered meshes. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Carving for topology simplification of polygonal meshes", "paper_id": "WOS:000273879800008"}