{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "slightest_tag_motion"}, {"score": 0.004715908063787721, "phrase": "existing_methods"}, {"score": 0.004667149874736771, "phrase": "rfid_systems"}, {"score": 0.004430784015995566, "phrase": "tags'_motions"}, {"score": 0.004272456401437226, "phrase": "motion_detection_requirement"}, {"score": 0.004098397888277889, "phrase": "signal_strength"}, {"score": 0.0037908515763223107, "phrase": "tag_motion"}, {"score": 0.0035614563596982306, "phrase": "weak_stability"}, {"score": 0.0033633514001658086, "phrase": "significant_changes"}, {"score": 0.0032599633778910516, "phrase": "high_false_positives"}, {"score": 0.002983916676307492, "phrase": "gaussian_model"}, {"score": 0.0028178463431115562, "phrase": "foreground_segment"}, {"score": 0.0027886573969044042, "phrase": "computer_vision"}, {"score": 0.0027169974137406148, "phrase": "strength_image"}, {"score": 0.002448260697722081, "phrase": "evaluation_results"}], "paper_keywords": ["RFID", " motion detection", " background substraction", " mixture of Gaussian model"], "paper_abstract": "Existing methods in RFID systems often employ presence or absence fashion to detect the tags' motions, so they cannot meet motion detection requirement in many applications. Our recent observations suggest that the signal strength backscattered from the tag is hypersensitive to its position, inspiring us to perceive the tag motion through its radio signal strength changes. Motion perception is not trivial and challenged by weak stability of strength in that any other interference or noise may incur significant changes as well, resulting in high false positives. To tackle this issue, we propose to model the strength via the Mixture of Gaussian Model (MoG). The problem is thus converted to foreground segment in computer vision with the help of Strength Image, where the technique of MoG based background subtraction is employed. We then implement a prototype using commercial off-the-shelf products. The evaluation results show that the slightest tag motion (similar to 10 cm) can be precisely perceived, and the accuracy is up to 92.34 percent while the false positive is suppressed under 0.5 percent.", "paper_title": "Perceiving the Slightest Tag Motion beyond Localization", "paper_id": "WOS:000362378600013"}