{"auto_keywords": [{"score": 0.03309001214060327, "phrase": "sharing_site"}, {"score": 0.004752614341164843, "phrase": "novel_approach"}, {"score": 0.004691081414630302, "phrase": "popular_video"}, {"score": 0.004418088217921573, "phrase": "current_popularity"}, {"score": 0.00428199598648637, "phrase": "different_websites"}, {"score": 0.004248630241580105, "phrase": "major_hosting_website"}, {"score": 0.004226530361866316, "phrase": "web_video"}, {"score": 0.003719442481033911, "phrase": "social_networks"}, {"score": 0.003690596497907126, "phrase": "wikipedia"}, {"score": 0.0036712368673314177, "phrase": "numerous_video-sharing_websites"}, {"score": 0.003604793006510814, "phrase": "phenomenal_level"}, {"score": 0.0035395474074405935, "phrase": "entire_cyberspace"}, {"score": 0.0033159875234063715, "phrase": "original_work"}, {"score": 0.0031637923055285533, "phrase": "small_site"}, {"score": 0.003090326414654403, "phrase": "good_level"}, {"score": 0.0029331010547170187, "phrase": "existing_study"}, {"score": 0.002805747278767813, "phrase": "video's_influence"}, {"score": 0.0027838524522031034, "phrase": "whole_cyberspace"}, {"score": 0.0027050191590609765, "phrase": "novel_framework"}, {"score": 0.0026629616681274875, "phrase": "popular_videos"}, {"score": 0.0025807931917993087, "phrase": "unified_virtual_community_space"}, {"score": 0.002468698571619528, "phrase": "novel_learning_method"}, {"score": 0.0023552998182859463, "phrase": "video's_origin"}, {"score": 0.002282602844012085, "phrase": "annotated_dataset"}, {"score": 0.002258871472099473, "phrase": "major_video_sharing_site"}, {"score": 0.0021948718993867154, "phrase": "collected_videos"}, {"score": 0.002166382426707153, "phrase": "interesting_discussions"}, {"score": 0.0021049977753042253, "phrase": "user_behavior"}], "paper_keywords": ["Video influence estimation", " video origin estimation", " unified virtual community space"], "paper_abstract": "We propose a novel approach to analyze how a popular video is propagated in the cyberspace, to identify if it originated from a certain sharing-site, and to identify how it reached the current popularity in its propagation. In addition, we also estimate their influences across different websites outside the major hosting website. Web video is gaining significance due to its rich and eye-ball grabbing content. This phenomenon is evidently amplified and accelerated by the advance of Web 2.0. When a video receives some degree of popularity, it tends to appear on various websites including not only video-sharing websites but also news websites, social networks or even Wikipedia. Numerous video-sharing websites have hosted videos that reached a phenomenal level of visibility and popularity in the entire cyberspace. As a result, it is becoming more difficult to determine how the propagation took place - was the video a piece of original work that was intentionally uploaded to its major hosting site by the authors, or did the video originate from some small site then reached the sharing site after already getting a good level of popularity, or did it originate from other places in the cyberspace but the sharing site made it popular. Existing study regarding this flow of influence is lacking. Literature that discuss the problem of estimating a video's influence in the whole cyberspace also remains rare. In this article we introduce a novel framework to identify the propagation of popular videos from its major hosting site's perspective, and to estimate its influence. We define a Unified Virtual Community Space (UVCS) to model the propagation and influence of a video, and devise a novel learning method called Noise-reductive Local-and-Global Learning (NLGL) to effectively estimate a video's origin and influence. Without losing generality, we conduct experiments on annotated dataset collected from a major video sharing site to evaluate the effectiveness of the framework. Surrounding the collected videos and their ranks, some interesting discussions regarding the propagation and influence of videos as well as user behavior are also presented.", "paper_title": "On the Influence Propagation of Web Videos", "paper_id": "WOS:000341570800011"}