{"auto_keywords": [{"score": 0.026473265069877187, "phrase": "transparent_incremental_tabling"}, {"score": 0.00481495049065317, "phrase": "knowledge_representation"}, {"score": 0.004180811160813507, "phrase": "hilog"}, {"score": 0.0040942189695983185, "phrase": "defeasibility_theories"}, {"score": 0.004030449969901066, "phrase": "equality_theories"}, {"score": 0.003629882559085245, "phrase": "heavy_use"}, {"score": 0.0035920758080335655, "phrase": "tabled_resolution"}, {"score": 0.0032861588691414667, "phrase": "simple_facts"}, {"score": 0.003251920460276645, "phrase": "performing_dynamic_updates"}, {"score": 0.0029593432468318745, "phrase": "incremental_tabling"}, {"score": 0.0024377918036784336, "phrase": "semantic_level"}, {"score": 0.0023254633298356894, "phrase": "full_consistency"}, {"score": 0.002289180040240783, "phrase": "tabled_queries"}, {"score": 0.0022299587520401747, "phrase": "significant_performance_improvements"}, {"score": 0.002206700502606511, "phrase": "previous_implementations"}, {"score": 0.002172266188075892, "phrase": "lazy_recomputation"}, {"score": 0.0021049977753042253, "phrase": "dependency_structures"}], "paper_keywords": [""], "paper_abstract": "Resolution-based Knowledge Representation and Reasoning (KRR) systems, such as Flora-2, Silk or Ergo, can scale to tens or hundreds of millions of facts, while supporting reasoning that includes Hilog, inheritance, defeasibility theories, and equality theories. These systems handle the termination and complexity issues that arise from the use of these features by a heavy use of tabled resolution. In fact, such systems table by default all rules defined by users, unless they are simple facts. Performing dynamic updates within such systems is nearly impossible unless the tables themselves can be made to react to changes. Incremental tabling as first implemented in XSB (Saha 2006) partially addressed this problem, but the implementation was limited in scope and not always easy to use. In this paper, we introduce transparent incremental tabling which at the semantic level supports updates in the 3-valued well-founded semantics, while guaranteeing full consistency of all tabled queries. Transparent incremental tabling also has significant performance improvements over previous implementations, including lazy recomputation, and control over the dependency structures used to determine how tables are updated.", "paper_title": "Incremental Tabling in Support of Knowledge Representation and Reasoning", "paper_id": "WOS:000343203200011"}