{"auto_keywords": [{"score": 0.04964156968469263, "phrase": "intrinsically_disordered_proteins"}, {"score": 0.004684157900507474, "phrase": "eukaryotic_proteomic_sequences"}, {"score": 0.004253618550301311, "phrase": "widely_used_force_fields"}, {"score": 0.0038981499110532273, "phrase": "cmap_energy_corrections"}, {"score": 0.0038447943243941685, "phrase": "eight_disorder-promoting_residues"}, {"score": 0.0032436052954996097, "phrase": "simulation_results"}, {"score": 0.003140888248194296, "phrase": "free_disordered_proteins"}, {"score": 0.003097865379563127, "phrase": "chemical_shifts"}, {"score": 0.0030135741897058844, "phrase": "quantitative_agreement"}, {"score": 0.0029586543333524904, "phrase": "reported_nmr_measurements"}, {"score": 0.0027614468443073028, "phrase": "disordered_conformers"}, {"score": 0.0026986685585382347, "phrase": "structural_proteins"}, {"score": 0.002329258721870127, "phrase": "relative_errors"}, {"score": 0.0022347698358650514, "phrase": "ordered_residues"}, {"score": 0.0022041312401435346, "phrase": "long_disorder-promoting_sequences"}, {"score": 0.002163930783583212, "phrase": "polarizable_force_fields"}, {"score": 0.0021049977753042253, "phrase": "possible_ways"}], "paper_keywords": [""], "paper_abstract": "Over 40% of eukaryotic proteomic sequences have been predicted to be intrinsically disordered proteins (IDPs) or intrinsically disordered regions (IDRs) and confirmed to be associated with many diseases. However, widely used force fields cannot well reproduce the conformers of IDPs. Previously the ff99IDPs force field was released to simulate IDPs with CMAP energy corrections for the eight disorder-promoting residues. In order to further confirm the performance of ff99IDPs, three representative IDP systems (arginine-rich HIV-1 Rev, aspartic proteinase inhibitor IA(3), and alpha-synuclein) were used to test and evaluate the simulation results. The results show that for free disordered proteins, the chemical shifts from the ff99IDPs simulations are in quantitative agreement with those from reported NMR measurements and better than those from ff99SBildn. Thus, ff99IDPs can sample more clusters of disordered conformers than ff99SBildn. For structural proteins, both ff99IDPs and ff99SBildn can well reproduce the conformations. In general, ff99IDPs can successfully be used to simulate the conformations of IDPs and IDRs in both bound and free states. However, relative errors could still be found at the bou(n)daries of ordered residues scattered in long disorder-promoting sequences. Therefore, polarizable force fields might be one of the possible ways to further improve the performance on IDPs.", "paper_title": "Test and Evaluation of ff99IDPs Force Field for Intrinsically Disordered Proteins", "paper_id": "WOS:000355382200011"}