{"auto_keywords": [{"score": 0.047757412970608114, "phrase": "software_systems"}, {"score": 0.012346594582402844, "phrase": "manual_search"}, {"score": 0.00481495049065317, "phrase": "software_systems-a_systematic_literature_review"}, {"score": 0.004439097815805505, "phrase": "different_contexts"}, {"score": 0.004359625030298944, "phrase": "key_property"}, {"score": 0.004204904449336037, "phrase": "existing_research"}, {"score": 0.004055652445791872, "phrase": "variability_handling"}, {"score": 0.004019171295196278, "phrase": "major_software_engineering_phases"}, {"score": 0.0038242899532391914, "phrase": "systematic_literature_review"}, {"score": 0.003249966782844541, "phrase": "targeted_automated_search"}, {"score": 0.0031917146566068245, "phrase": "software_quality_attributes"}, {"score": 0.0029689311901364797, "phrase": "software_engineering_phases"}, {"score": 0.0027993885490232677, "phrase": "current_approaches"}, {"score": 0.0027367816003722252, "phrase": "research_designs"}, {"score": 0.0025456716198597627, "phrase": "software_engineering"}, {"score": 0.0025113494092413604, "phrase": "empirically_grounded_classification"}, {"score": 0.0023571835517819124, "phrase": "disparate_or_loosely_coupled_research_themes"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Variability", " systematic review", " software engineering"], "paper_abstract": "Context: Variability (i.e., the ability of software systems or artifacts to be adjusted for different contexts) became a key property of many systems. Objective: We analyze existing research on variability in software systems. We investigate variability handling in major software engineering phases (e.g., requirements engineering, architecting). Method: We performed a systematic literature review. A manual search covered 13 premium software engineering journals and 18 premium conferences, resulting in 15,430 papers searched and 196 papers considered for analysis. To improve reliability and to increase reproducibility, we complemented the manual search with a targeted automated search. Results: Software quality attributes have not received much attention in the context of variability. Variability is studied in all software engineering phases, but testing is underrepresented. Data to motivate the applicability of current approaches are often insufficient; research designs are vaguely described. Conclusions: Based on our findings we propose dimensions of variability in software engineering. This empirically grounded classification provides a step towards a unifying, integrated perspective of variability in software systems, spanning across disparate or loosely coupled research themes in the software engineering community. Finally, we provide recommendations to bridge the gap between research and practice and point to opportunities for future research.", "paper_title": "Variability in Software Systems-A Systematic Literature Review", "paper_id": "WOS:000334666500005"}