{"auto_keywords": [{"score": 0.03982569637126584, "phrase": "crosscutting_concerns"}, {"score": 0.0047273577269638725, "phrase": "software_system"}, {"score": 0.004684157900507474, "phrase": "source-code_level"}, {"score": 0.004598933498016774, "phrase": "different_concerns"}, {"score": 0.004253618550301311, "phrase": "source_code"}, {"score": 0.004081385289516914, "phrase": "program_entities"}, {"score": 0.003689053436223376, "phrase": "single_program_entity"}, {"score": 0.0030414140732789186, "phrase": "combined_experiment"}, {"score": 0.00290473242917264, "phrase": "jhotdraw_framework"}, {"score": 0.0027998115185013258, "phrase": "jhotdraw"}, {"score": 0.0024501740852758505, "phrase": "detected_concerns"}, {"score": 0.0023944552329463035, "phrase": "original_techniques"}, {"score": 0.002329258721870127, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "identified_crosscutting_concerns"}], "paper_keywords": [""], "paper_abstract": "Understanding a software system at source-code level requires understanding the different concerns that it addresses, which in turn requires a way to identify these concerns in the source code. Whereas some concerns are explicitly represented by program entities (like classes, methods and variables) and thus are easy to identify, crosscutting concerns are not captured by a single program entity but are scattered over many program entities and are tangled with the other concerns. Because of their crosscutting nature, such crosscutting concerns are difficult to identify, and reduce the understandability of the system as a whole. In this paper, we report on a combined experiment in which we try to identify crosscutting concerns in the JHotDraw framework automatically. We first apply three independently developed aspect mining techniques to JHotDraw and evaluate and compare their results. Based on this analysis, we present three interesting combinations of these three techniques, and show how these combinations provide a more complete coverage of the detected concerns as compared to the original techniques individually. Our results are a first step towards improving the understandability of a system that contains crosscutting concerns, and can be used as a basis for refactoring the identified crosscutting concerns into aspects.", "paper_title": "Applying and combining three different aspect mining techniques", "paper_id": "WOS:000239300800003"}