{"auto_keywords": [{"score": 0.04912982131704961, "phrase": "mobile_robots"}, {"score": 0.0325919697536789, "phrase": "mobility_schedule"}, {"score": 0.004814951205791257, "phrase": "beachcombers"}, {"score": 0.004637478829869904, "phrase": "new_problem"}, {"score": 0.004568326972997448, "phrase": "geometric_domain"}, {"score": 0.00450020161335541, "phrase": "line_segment"}, {"score": 0.004388899540291536, "phrase": "n_mobile_robots"}, {"score": 0.004205940624913343, "phrase": "searching_speed_si"}, {"score": 0.0033651019362620866, "phrase": "n_robots"}, {"score": 0.003314859966384039, "phrase": "efficient_mobility_schedules"}, {"score": 0.003021141590548526, "phrase": "segment_length"}, {"score": 0.002902304851882577, "phrase": "offline_scenario"}, {"score": 0.0027327327233891865, "phrase": "arbitrary_walking"}, {"score": 0.0026516890043911836, "phrase": "online_algorithm"}, {"score": 0.0025795066118838067, "phrase": "actual_length"}, {"score": 0.0025219085140220773, "phrase": "speed_s"}, {"score": 0.0022925278792429553, "phrase": "proposed_online_algorithm"}, {"score": 0.0022639385158576344, "phrase": "competitive_ratio"}, {"score": 0.0022022878843247257, "phrase": "robots'_walking_speeds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithm", " Mobile robots", " On-line", " Schedule", " Searching", " Two-speed"], "paper_abstract": "We introduce and study a new problem concerning the exploration of a geometric domain by mobile robots. Consider a line segment [0, 1] and a set of n mobile robots r(1), r(2)..... r(n) placed at one of its endpoints. Each robot has a searching speed si and a walking speed w(i), where s(i) < w(i). We assume that every robot is aware of the number of robots of the collection and their corresponding speeds. At each time moment a robot r(i) either walks along a portion of the segment not exceeding its walking speed wi, or it searches a portion of the segment with speed not exceeding Si. A search of segment [0, 1] is completed at the time when each of its points have been searched by at least one of the n robots. We want to develop efficient mobility schedules (algorithms) for the robots which complete the search of the segment as fast as possible. More exactly we want to maximize the speed of the mobility schedule (equal to the ratio of the segment length versus the time of the completion of the schedule). We analyze first the offline scenario when the robots know the length of the segment that is to be searched. We give an algorithm producing a mobility schedule for arbitrary walking and searching speeds and prove its optimality. Then we propose an online algorithm, when the robots do not know in advance the actual length of the segment to be searched. The speed S of such algorithm is defined as S = inf(IL) S(I-L) where S(I-L) denotes the speed of searching of segment I-L = [0, L]. We prove that the proposed online algorithm is 2-competitive. The competitive ratio is shown to be better in the case when the robots' walking speeds are all the same, approaching 1.29843 as n goes to infinity. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The Beachcombers' Problem: Walking and searching with mobile robots", "paper_id": "WOS:000367488200002"}