{"auto_keywords": [{"score": 0.040490368143968024, "phrase": "mcc"}, {"score": 0.021099429597519353, "phrase": "ecghi"}, {"score": 0.018864450154261317, "phrase": "bc"}, {"score": 0.010465987380855005, "phrase": "cardiovascular_diseases"}, {"score": 0.007152357679877727, "phrase": "electrocardiogram_health_identifier"}, {"score": 0.006359417143636599, "phrase": "heart_diseases"}, {"score": 0.00618446641194943, "phrase": "myocardial_infarction"}, {"score": 0.006159867324647655, "phrase": "dysrhythmia"}, {"score": 0.006135364870956437, "phrase": "bundle_branch_block"}, {"score": 0.00494664246771404, "phrase": "six_criteria"}, {"score": 0.004786211598268987, "phrase": "multiple_criteria"}, {"score": 0.004701015188740582, "phrase": "human_beings"}, {"score": 0.004645057834614705, "phrase": "global_death"}, {"score": 0.0045441856999319675, "phrase": "severe_shortage"}, {"score": 0.004526080990381695, "phrase": "medical_personnel"}, {"score": 0.004512756924989927, "phrase": "ahp_performance_score"}, {"score": 0.004476868124209147, "phrase": "score_components"}, {"score": 0.00429715240295033, "phrase": "swift_identification"}, {"score": 0.004015094245381472, "phrase": "overall_population_suffering"}, {"score": 0.003873314196550409, "phrase": "multi-class_classifier"}, {"score": 0.0037740295668681014, "phrase": "multi-class_support_vector_machine"}, {"score": 0.0037329632227627277, "phrase": "high_accuracy"}, {"score": 0.0037216229812089686, "phrase": "exact_type"}, {"score": 0.0037067832801150067, "phrase": "cardiovascular_disease"}, {"score": 0.0036958621428704254, "phrase": "mcc-bc_scheme"}, {"score": 0.003662616965614571, "phrase": "two-class_svm"}, {"score": 0.003449527826309159, "phrase": "feature_vector"}, {"score": 0.0032814236411444022, "phrase": "analytic_hierarchy_process"}, {"score": 0.003235835216834799, "phrase": "multiple_criteria_decision"}, {"score": 0.003190878119415192, "phrase": "optimal_evaluation"}, {"score": 0.002893140560765452, "phrase": "testing_time"}, {"score": 0.0027741761880779535, "phrase": "optimized_ecghi"}, {"score": 0.0024703502756471514, "phrase": "developed_ecghi"}, {"score": 0.002321815210458373, "phrase": "research_area"}, {"score": 0.0022486729928886903, "phrase": "speedy_and_accurate_identification"}, {"score": 0.0022307495238819124, "phrase": "heart_disease"}, {"score": 0.0022174005294867604, "phrase": "instant_response"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cardiovascular diseases", " Electrocardiogram", " Feature vector", " Multiple criteria decision making", " Support vector machine"], "paper_abstract": "Cardiovascular diseases can wreak havoc on human beings and lead to 30% of global death annually. The World Health Organization has always highlighted that there is a severe shortage of medical personnel, especially cardiologists, in most of the countries. In this paper, an electrocardiogram health identifier (ECGHI) has been proposed and developed for swift identification of heart diseases. The ECGHI has been applied to four most common types of cardiovascular diseases, namely Myocardial Infarction, Dysrhythmia, Bundle Branch Block and Heart Failure since these four types of cardiovascular diseases contribute to 25% of the overall population suffering from heart diseases. In the investigation of ECGHI, the binary,classifier (BC) and multi-class classifier (MCC) are designed and analyzed. The MCC features a multi-class support vector machine (SVM) to diagnose the exact type of cardiovascular disease. The BC features a two-class SVM to identify healthiness of heart accurately. In this paper, the following indicators have been investigated, namely the overall accuracy, specificity, sensitivity, the dimensionality of feature vector, the total training and testing time of ECGHI and a newly defined confidence index. These six criteria form the basis to derive an analytic hierarchy process (AHP) to facilitate the multiple criteria decision making (MCDM) for the optimal evaluation of hyperplanes. Four kernels have been analyzed from which both the BC and MCC are evaluated and analyzed. The optimized ECGHI using BC yields an AHP Performance Score of 0.079 with score components (overall accuracy, specificity, sensitivity, average confidence index, dimensionality, total time for training and testing time) of 0.982, 0.978, 0.986, 0.608, 6, and 5.77 s respectively. Likewise, the optimized ECGHI using MCC yields an AHP Performance Score of 0.093 with score components of 0.882, 0.89, 0.874, 0.504, 9, and 7.32 s respectively. The BC is employed as a supplement of the MCC to achieve a further improvement in all six criteria. Such a novel process of identification and detection with high accuracy is referred as the MCC-BC scheme. The developed ECGHI (MCC) may identify the FOUR most common and important cardiovascular diseases simultaneously (with BC supplementing the MCC to achieve a high accuracy). Such simultaneous identification of cardiovascular diseases is the first of its kind in this research area, so no comparison can be made. The MCC-BC scheme will pave the way for speedy and accurate identification and detection of heart disease. The instant response of the ECGHI minimizes the probability of death from Myocardial Infarction, Bundle Branch Block, Dysrhythmia, and Heart Failure. (C) 2015 Published by Elsevier Ltd.", "paper_title": "Cardiovascular diseases identification using electrocardiogram health identifier based on multiple criteria decision making", "paper_id": "WOS:000355036900024"}