{"auto_keywords": [{"score": 0.04248955968880871, "phrase": "numerical_data"}, {"score": 0.031263055009915615, "phrase": "relative_covering_reduction"}, {"score": 0.00481495049065317, "phrase": "rough_set_theory"}, {"score": 0.004594951819987416, "phrase": "machine_learning"}, {"score": 0.004547438494330851, "phrase": "data_mining"}, {"score": 0.004500414250942443, "phrase": "pawlak's_rough_set_theory"}, {"score": 0.004430784015995566, "phrase": "formal_theoretical_framework"}, {"score": 0.004384960761826366, "phrase": "attribute_reduction"}, {"score": 0.004272456401437226, "phrase": "nominal_data"}, {"score": 0.003931402465972151, "phrase": "real-world_applications"}, {"score": 0.003712796038920873, "phrase": "numerical_feature_spaces"}, {"score": 0.0027886573969044042, "phrase": "feature_space"}, {"score": 0.0022760856906838814, "phrase": "numerical_experiments"}, {"score": 0.002171836484200008, "phrase": "proposed_technique"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Neighborhood covering", " Covering reduction", " Relative covering reduction", " Rule learning"], "paper_abstract": "Rough set theory has been extensively discussed in the domain of machine learning and data mining. Pawlak's rough set theory offers a formal theoretical framework for attribute reduction and rule learning from nominal data. However, this model is not applicable to numerical data, which widely exist in real-world applications. In this work, we extend this framework to numerical feature spaces by replacing partition of universe with neighborhood covering and derive a neighborhood covering reduction based approach to extracting rules from numerical data. We first analyze the definition of covering reduction and point out its advantages and disadvantages. Then we introduce the definition of relative covering reduction and develop an algorithm to compute it. Given a feature space, we compute the neighborhood of each sample and form a neighborhood covering of the universe, and then employ the algorithm of relative covering reduction to the neighborhood covering, thus derive a minimal covering rule set. Some numerical experiments are presented to show the effectiveness of the proposed technique. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Rule learning for classification based on neighborhood covering reduction", "paper_id": "WOS:000296940100006"}