{"auto_keywords": [{"score": 0.04967913398382337, "phrase": "digital_microfluidic_biochips"}, {"score": 0.040460720519068925, "phrase": "biochemical_application"}, {"score": 0.015719716506582538, "phrase": "error_recovery"}, {"score": 0.010947883297094412, "phrase": "transient_errors"}, {"score": 0.004734853555630616, "phrase": "microfluidic-based_biochips"}, {"score": 0.004656082803151484, "phrase": "conventional_biochemical_analyzers"}, {"score": 0.004210114198411514, "phrase": "continuous_flow"}, {"score": 0.004140036888016244, "phrase": "discrete_droplets"}, {"score": 0.0030599258491447946, "phrase": "fault-tolerance_approaches"}, {"score": 0.0030089355635315005, "phrase": "predetermined_recovery_actions"}, {"score": 0.002813307389456184, "phrase": "online_recovery_strategy"}, {"score": 0.002564862727498502, "phrase": "time_redundancy"}, {"score": 0.0024904974828343033, "phrase": "erroneous_operations"}, {"score": 0.0023980368333253147, "phrase": "redundant_droplets"}, {"score": 0.0022232633360792222, "phrase": "timing_constraints"}, {"score": 0.002149722786728988, "phrase": "proposed_redundancy_optimization_approach"}], "paper_keywords": ["Microfluidic biochips", " Electrowetting on dielectric", " Droplet-based biochips", " Computer-aided design", " Fault-tolerance", " Runtime recovery"], "paper_abstract": "Microfluidic-based biochips are replacing the conventional biochemical analyzers, and are able to integrate all the necessary functions for biochemical analysis. The digital microfluidic biochips are based on the manipulation of liquids not as a continuous flow, but as discrete droplets. Researchers have proposed approaches for the synthesis of digital microfluidic biochips, which, starting from a biochemical application and a given biochip architecture, determine the allocation, resource binding, scheduling, placement and routing of the operations in the application. During the execution of a bioassay, operations could experience transient errors (e.g., erroneous droplet volumes), thus impacting negatively the correctness of the application. Researchers have proposed fault-tolerance approaches, which apply predetermined recovery actions at the moment when errors are detected. In this paper, we propose an online recovery strategy, which decides during the execution of the biochemical application the introduction of the redundancy required for fault-tolerance. We consider both time redundancy, i.e., re-executing erroneous operations, and space redundancy, i.e., creating redundant droplets for fault-tolerance. Error recovery is performed such that the number of transient errors tolerated is maximized and the timing constraints of the biochemical application are satisfied. The proposed redundancy optimization approach has been evaluated using several benchmarks.", "paper_title": "Redundancy optimization for error recovery in digital microfluidic biochips", "paper_id": "WOS:000357339400006"}