{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_productivity"}, {"score": 0.03923307184680597, "phrase": "mean_citation"}, {"score": 0.004664352260912174, "phrase": "thomson_reuters"}, {"score": 0.004419018661564621, "phrase": "multiplying_strategy"}, {"score": 0.004081385289516914, "phrase": "large_proportion"}, {"score": 0.003941086361584705, "phrase": "individual_productivity"}, {"score": 0.003537097098008714, "phrase": "individual_productivity_distributions"}, {"score": 0.0034812740368914455, "phrase": "size-and_scale-independent_indicators"}, {"score": 0.003404593678001724, "phrase": "productivity_distributions"}, {"score": 0.0033615344963450343, "phrase": "robust_index"}, {"score": 0.003245900020944865, "phrase": "scales_approach"}, {"score": 0.0032150572968898923, "phrase": "productivity_inequality"}, {"score": 0.003036040409062437, "phrase": "entire_population"}, {"score": 0.002821685815956478, "phrase": "main_result"}, {"score": 0.0027594936602962075, "phrase": "wide_differences"}, {"score": 0.0026560424475094396, "phrase": "field_productivity_distributions"}, {"score": 0.002468450551616404, "phrase": "successful_authors"}, {"score": 0.0023532890136269986, "phrase": "fractal_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Individual scientist's productivity distributions", " Skewness of science", " Disambiguation algorithm", " Co-authorship"], "paper_abstract": "This paper exploits a unique 2003-2011 large dataset, indexed by Thomson Reuters, consisting of 17.2 million disambiguated authors classified into 30 broad scientific fields, as well as the 48.2 million articles resulting from a multiplying strategy in which any article coauthored by two or more persons is wholly assigned as many times as necessary to each of them. The dataset is characterized by a large proportion of authors who have their oeuvre in several fields. We measure individual productivity in two ways that are uncorrelated: as the number of articles per person and as the mean citation per article per person in the 2003-2011 period. We analyze the shape of the two types of individual productivity distributions in each field using size-and scale-independent indicators. To assess the skewness of productivity distributions we use a robust index of skewness, as well as the Characteristic Scores and Scales approach. For productivity inequality, we use the coefficient of variation. In each field, we study two samples: the entire population, and what we call \"successful authors\", namely, the subset of scientists whose productivity is above their field average. The main result is that, in spite of wide differences in production and citation practices across fields, the shape of field productivity distributions is very similar across fields. The parallelism of the results for the population as a whole and for the subset of successful authors, when productivity is measured as mean citation per article per person, reveals the fractal nature of the skewness of scientific productivity in this case. These results are essentially maintained when any article co-authored by two or more persons is fractionally assigned to each of them. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The skewness of scientific productivity", "paper_id": "WOS:000345527400013"}