{"auto_keywords": [{"score": 0.03793044352294926, "phrase": "information_use"}, {"score": 0.007777833493222805, "phrase": "illness_representations"}, {"score": 0.0047709540557306284, "phrase": "illness_coping"}, {"score": 0.004684157900507474, "phrase": "leventhal's_common_sense_model"}, {"score": 0.004641351004344458, "phrase": "illness_regulation"}, {"score": 0.004273196830970426, "phrase": "people's_illness_representations"}, {"score": 0.0041001740903338834, "phrase": "lifestyle_modifications"}, {"score": 0.003970439654470374, "phrase": "information_use_play"}, {"score": 0.0038271712887391015, "phrase": "crucial_question"}, {"score": 0.003757480190200645, "phrase": "two-part_study"}, {"score": 0.0035722806911457545, "phrase": "different_timepoints"}, {"score": 0.0032886455096627324, "phrase": "information_use_type"}, {"score": 0.0032585499655442404, "phrase": "time_pairings"}, {"score": 0.003140888248194296, "phrase": "healthcare_practitioners"}, {"score": 0.0031121406603482112, "phrase": "symptom_onset"}, {"score": 0.003027462227648001, "phrase": "present-day_level"}, {"score": 0.00286493504971388, "phrase": "merely_type"}, {"score": 0.002530359917257626, "phrase": "patient_education_programs"}, {"score": 0.002329258721870127, "phrase": "online_health_forums"}, {"score": 0.0023079225317714815, "phrase": "social_media_sites"}], "paper_keywords": ["information use"], "paper_abstract": "According to Leventhal's Common Sense Model of illness regulation, people approach and deal with their illnesses differently depending on their cognitive representations of them. Thus, understanding people's illness representations can be invaluable when assisting them to develop lifestyle modifications that improve their health. What role does information use play in this equation? This is the crucial question addressed by this two-part study. Part 1 hypothesizes a model of how information use at different timepoints may affect illness representations, and then tests this model. The study found that a number of information use type and time pairings (e.g., information used to consult healthcare practitioners at symptom onset) were significantly associated with present-day level of personal control. The results suggest that it is not merely type or timing of information use alone that is helpful in illness coping, but the coupling of the two; this has several implications for the design of patient education programs. Part 2 examines how information use and illness representations differ based on the way an individual participates in online health forums and social media sites. The following four different participation styles were investigated: nonuser, only reading (lurker), posting occasionally but largely reading (infrequent poster), and reading and posting (poster). Differences in both information use and illness perceptions were found, and the implications of these are discussed.", "paper_title": "Information Use and Illness Representations: Understanding Their Connection in Illness Coping", "paper_id": "WOS:000348730000008"}