{"auto_keywords": [{"score": 0.030484325283082408, "phrase": "role_ambiguity"}, {"score": 0.00481495049065317, "phrase": "information_and_communication_technologies"}, {"score": 0.00436890075128947, "phrase": "academic_literature"}, {"score": 0.004333642054036135, "phrase": "popular_press"}, {"score": 0.004144723510171449, "phrase": "increased_stress_levels"}, {"score": 0.00386876598761639, "phrase": "health_costs"}, {"score": 0.003567455727660992, "phrase": "stress_research"}, {"score": 0.0034118234596993836, "phrase": "person-environment_fit_model"}, {"score": 0.0033433365160336842, "phrase": "theoretical_lens"}, {"score": 0.0033029038236817372, "phrase": "research_model"}, {"score": 0.002796782643988021, "phrase": "home_conflict"}, {"score": 0.0027184540871935284, "phrase": "field_data"}, {"score": 0.0024461989110005447, "phrase": "work_overload"}, {"score": 0.00233936726307301, "phrase": "intrusive_technology_characteristics"}, {"score": 0.0022830706430588482, "phrase": "dominant_predictors"}, {"score": 0.0022101055924375725, "phrase": "new_avenues"}, {"score": 0.0021049977753042253, "phrase": "possible_interventions"}], "paper_keywords": ["Technostress", " ICTs", " information and communication technologies", " stress", " technology characteristics", " strain", " stressors"], "paper_abstract": "With the proliferation and ubiquity of information and communication technologies (ICTs), it is becoming imperative for individuals to constantly engage with these technologies in order to get work accomplished. Academic literature, popular press, and anecdotal evidence suggest that ICTs are responsible for increased stress levels in individuals (known as technostress). However, despite the influence of stress on health costs and productivity, it is not very clear which characteristics of ICTs create stress. We draw from IS and stress research to build and test a model of technostress. The person-environment fit model is used as a theoretical lens. The research model proposes that certain technology characteristics-like usability (usefulness, complexity, and reliability), intrusiveness (presenteeism, anonymity), and dynamism (pace of change)-are related to stressors (work overload, role ambiguity, invasion of privacy, work home conflict, and job insecurity). Field data from 661 working professionals was obtained and analyzed. The results clearly suggest the prevalence of technostress and the hypotheses from the model are generally supported. Work overload and role ambiguity are found to be the two most dominant stressors, whereas intrusive technology characteristics are found to be the dominant predictors of stressors. The results open up new avenues for research by highlighting the incidence of technostress in organizations and possible interventions to alleviate it.", "paper_title": "TECHNOSTRESS: TECHNOLOGICAL ANTECEDENTS AND IMPLICATIONS", "paper_id": "WOS:000297236000003"}