{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_sciences"}, {"score": 0.004687645903373103, "phrase": "increasing_interdisciplinarity"}, {"score": 0.0046046429665581555, "phrase": "policy_objective"}, {"score": 0.0044430006374681285, "phrase": "funding_agencies"}, {"score": 0.004136469845987887, "phrase": "numerous_articles"}, {"score": 0.0037490909410974166, "phrase": "different_social_science_subjects"}, {"score": 0.0033525843225012918, "phrase": "social_sciences_citation_index"}, {"score": 0.002971182100871581, "phrase": "median_level"}, {"score": 0.0028795712616923462, "phrase": "cross-disciplinary_citations"}, {"score": 0.0027047136845332917, "phrase": "previous_research"}, {"score": 0.002181766829493483, "phrase": "ssci_subject"}, {"score": 0.0021526564019119466, "phrase": "largest_increase"}], "paper_keywords": [""], "paper_abstract": "Increasing interdisciplinarity has been a policy objective since the 1990s, promoted by many governments and funding agencies, but the question is: How deeply has this affected the social sciences? Although numerous articles have suggested that research has become more interdisciplinary, yet no study has compared the extent to which the interdisciplinarity of different social science subjects has changed. To address this gap, changes in the level of interdisciplinarity since 1980 are investigated for subjects with many articles in the Social Sciences Citation Index (SSCI), using the percentage of cross-disciplinary citing documents (PCDCD) to evaluate interdisciplinarity. For the 14 SSCI subjects investigated, the median level of interdisciplinarity, as measured using cross-disciplinary citations, declined from 1980 to 1990, but rose sharply between 1990 and 2000, confirming previous research. This increase was not fully matched by an increase in the percentage of articles that were assigned to more than one subject category. Nevertheless, although on average the social sciences have recently become more interdisciplinary, the extent of this change varies substantially from subject to subject. The SSCI subject with the largest increase in interdisciplinarity between 1990 and 2000 was Information Science & Library Science (IS&LS) but there is evidence that the level of interdisciplinarity of IS&LS increased less quickly during the first decade of this century.", "paper_title": "Variations Between Subjects in the Extent to Which the Social Sciences Have Become More Interdisciplinary", "paper_id": "WOS:000291122800010"}