{"auto_keywords": [{"score": 0.03967855647494404, "phrase": "cross-media_analysis"}, {"score": 0.0311170659605185, "phrase": "hypothesized_transformation"}, {"score": 0.00481495049065317, "phrase": "standard_ransac"}, {"score": 0.004678384952779725, "phrase": "media_visual_matching"}, {"score": 0.004640079189342692, "phrase": "hypothesis_relevancy"}, {"score": 0.004489952932659799, "phrase": "multiple_visual_media"}, {"score": 0.004273782634394231, "phrase": "comic_image"}, {"score": 0.004221379262804442, "phrase": "movie_frame"}, {"score": 0.00388800655625083, "phrase": "visual_analogies"}, {"score": 0.0035661605757956096, "phrase": "key_points"}, {"score": 0.003464890914694523, "phrase": "mapping_hypotheses"}, {"score": 0.0033115124244647736, "phrase": "higher_its_score"}, {"score": 0.003177958355586418, "phrase": "conventional_set-size_measure"}, {"score": 0.002843581231499026, "phrase": "matching_task"}, {"score": 0.0025547994452342266, "phrase": "different_properties"}, {"score": 0.00245168871716047, "phrase": "consensus_set"}, {"score": 0.0021224200236681498, "phrase": "correct_matches"}, {"score": 0.0021049977753042253, "phrase": "conventional_methods"}], "paper_keywords": ["Object detection", " 3D viewpoint estimation", " Image registration", " Shape matching"], "paper_abstract": "The same scene can be depicted by multiple visual media. For example, the same event can be captured by a comic image or a movie frame; the same object can be represented by a photograph or by a 3D computer graphics model. In order to extract the visual analogies that are at the heart of cross-media analysis, spatial matching is required. This matching is commonly achieved by extracting key points and scoring multiple, randomly generated mapping hypotheses. The more consensus a hypothesis can draw, the higher its score. In this paper, we go beyond the conventional set-size measure for the quality of a match and present a more general hypothesis score that attempts to reflect how likely is each hypothesized transformation to be the correct one for the matching task at hand. This is achieved by considering additional, contextual cues for the relevance of a hypothesized transformation. This context changes from one matching task to another and reflects different properties of the match, beyond the size of a consensus set. We demonstrate that by learning how to correctly score each hypothesis based on these features we are able to deal much more robustly with the challenges required to allow cross-media analysis, leading to correct matches where conventional methods fail.", "paper_title": "When standard RANSAC is not enough: cross-media visual matching with hypothesis relevancy", "paper_id": "WOS:000334447600010"}