{"auto_keywords": [{"score": 0.04278273234402079, "phrase": "gabor"}, {"score": 0.04112243917404154, "phrase": "eye_image"}, {"score": 0.03044009028372348, "phrase": "segmentation_method"}, {"score": 0.00481495049065317, "phrase": "gabor_transform"}, {"score": 0.004771196027464407, "phrase": "iris_recognition"}, {"score": 0.004663533386096864, "phrase": "best_methods"}, {"score": 0.004600100053651545, "phrase": "biometric_field"}, {"score": 0.004141476915000558, "phrase": "new_method"}, {"score": 0.0037626342268042997, "phrase": "iris_recognition_system"}, {"score": 0.003561865840737996, "phrase": "constant_templates"}, {"score": 0.0031339552246625463, "phrase": "tuning_parameter"}, {"score": 0.002782647772219627, "phrase": "gradient_based_method"}, {"score": 0.0026220103561723066, "phrase": "gradient_based_algorithm"}, {"score": 0.002493333098814506, "phrase": "low_frr_and_far_values"}, {"score": 0.002370955769074803, "phrase": "different_gabor_wavelet_filters"}, {"score": 0.002349357968054711, "phrase": "feature_extraction"}, {"score": 0.002234031373581961, "phrase": "feature_vectors"}, {"score": 0.0021049977753042253, "phrase": "corresponding_gabor_wavelet_transform"}], "paper_keywords": [""], "paper_abstract": "Iris recognition is one of the best methods in the biometric field. It includes two main processes: This localization and segmentation\" and \"Feature extraction and coding\". We have introduced a new method based on Gabor transform for localization and segmentation of iris in eye image and also have used it to implement an Iris Recognition system. By applying the Gabor transform to an eye image, some constant templates are extracted related to the borders of pupil and iris. These features are robust and almost easy to use. There is no restriction and no tuning parameter in algorithm. The algorithm is extremely robust to the eyelids and eyelashes occlusions. To evaluate the segmentation method, we have also developed a gradient based method. The results of experimentations show that our proposed algorithm works better than the gradient based algorithm. The results of our recognition system are also noticeable. The low FRR and FAR values justify the results of segmentation method. We have also applied different Gabor Wavelet filters for feature extraction. The observations show that the threshold used to discriminate feature vectors is highly dependant on the orientation, scale and parameters of the corresponding Gabor Wavelet Transform.", "paper_title": "Iris recognition: Localization, segmentation and feature extraction based on Gabor transform", "paper_id": "WOS:000237648300124"}