{"auto_keywords": [{"score": 0.04917331388552706, "phrase": "baci"}, {"score": 0.005515020867411277, "phrase": "communication_policies"}, {"score": 0.00481495049065317, "phrase": "communication_interfaces"}, {"score": 0.004612376827433774, "phrase": "communication_intefaces"}, {"score": 0.004439445472040688, "phrase": "flexible_communication_policy"}, {"score": 0.004334657104697421, "phrase": "ambient_calculi"}, {"score": 0.004272969980602508, "phrase": "fixed_communication_policy"}, {"score": 0.004034841146538891, "phrase": "parent_ambient"}, {"score": 0.0037556843869894566, "phrase": "different_communication_policies"}, {"score": 0.0037199473428123175, "phrase": "different_parents"}, {"score": 0.0029569247903654477, "phrase": "child_ambients"}, {"score": 0.002661474607275484, "phrase": "entering_ambient"}, {"score": 0.0026235360404084137, "phrase": "host_ambient"}, {"score": 0.00220823903315848, "phrase": "subject_reduction_property"}, {"score": 0.0021049977753042253, "phrase": "labelled_transition_system"}], "paper_keywords": [""], "paper_abstract": "We define BACI (Boxed Ambients with Communication Intefaces), an ambient calculus with a flexible communication policy. Traditionally, typed ambient calculi have a fixed communication policy determining the kind of information that can be exchanged with a parent ambient, even though mobility changes the parent. BACI lifts that restriction, allowing different communication policies with different parents during computation. Furthermore, BACI separates communication and mobility by making the channels of communication between ambients explicit. In contrast with other typed ambient calculi where communication policies are global, each ambient in BACI is equipped with a description of the communication policies ruling its information exchange with parent and child ambients. The communication policies of ambients increase when they move: more precisely, when an ambient enters another ambient, the entering ambient and the host ambient can exchange their communication ports and agree on the kind of information to be exchanged. This information is recorded locally in both ambients. We show the type-soundness of BACI, proving that it satisfies the subject reduction property, and we study its behavioural semantics by means of a labelled transition system.", "paper_title": "Boxed ambients with communication interfaces", "paper_id": "WOS:000249229800002"}