{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multipath_transmission"}, {"score": 0.04232965042885736, "phrase": "current_ip_networks"}, {"score": 0.039597752374290154, "phrase": "multipath_transmissions"}, {"score": 0.0047707093928203, "phrase": "wired_packet_networks"}, {"score": 0.0047268728636719725, "phrase": "ip_networks"}, {"score": 0.004619027561771169, "phrase": "general_connectivity"}, {"score": 0.004513631630494221, "phrase": "routing_methods"}, {"score": 0.004211594861013822, "phrase": "multiple_paths"}, {"score": 0.003734979290204709, "phrase": "existing_ip_networks"}, {"score": 0.002964308116806137, "phrase": "valiant"}, {"score": 0.002909961050070465, "phrase": "multi-protocol"}, {"score": 0.0025329623864528317, "phrase": "network_virtualization"}, {"score": 0.002498053212249228, "phrase": "multipath_tcp."}, {"score": 0.0024522530645471065, "phrase": "mentioned_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Routing", " Multipath", " Load balancing"], "paper_abstract": "IP networks were designed to provide general connectivity. At their advent, routing methods focused only on finding one optimal path between given endpoints. Although many solutions to sending traffic via multiple paths have appeared over time, the majority of current IP networks are still managed to support only single-path ttansmissions. This survey examines various approaches which can provide multipath transmissions in existing IP networks. Firstly, the most recognizable solutions are presented, and later, less well-known proposals are introduced. We show how it is possible to realize multipath transmission in source and hop-by-hop routing, multi-topology routing, bio-inspired routing solutions, Valiant's routing, Multi-Protocol Label Switching, Software-Defined Networks, Flow-Aware Multi-Topology Adaptive Routing, Shortest-Path Bridging, Transparent Interconnection of Lots of Links, network virtualization, and Multipath TCP. Moreover, the mentioned approaches are compared, contrasted and subjectively assessed. The goal of the survey is to show that multipath transmissions can be achieved in the current IP networks and in many different ways. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A survey on methods to provide multipath transmission in wired packet networks", "paper_id": "WOS:000349502300002"}