{"auto_keywords": [{"score": 0.0494894891527237, "phrase": "arpanet_network"}, {"score": 0.00481495049065317, "phrase": "tiny_acorn"}, {"score": 0.004098291340525772, "phrase": "wide_variety"}, {"score": 0.004064548693812535, "phrase": "primary_and_secondary_sources"}, {"score": 0.0039649719120779066, "phrase": "computer_networks"}, {"score": 0.00334659360678777, "phrase": "arpanet"}, {"score": 0.0032109670662222416, "phrase": "systematic_effort"}, {"score": 0.002709862658377861, "phrase": "nuanced_interpretation"}, {"score": 0.0024535580495414783, "phrase": "economic_framework"}, {"score": 0.002413256359147736, "phrase": "network_effects"}, {"score": 0.002373615081691254, "phrase": "historical_accidents"}, {"score": 0.0022962708568492734, "phrase": "universal_acceptance"}, {"score": 0.0021940118003312397, "phrase": "information_systems"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": ["history of the Internet", " information systems", " computer networks"], "paper_abstract": "The origins of the Internet are only partially understood. It is often believed that the Internet grew as a tree from a tiny acorn, the ARPANET network set up in 1969. In this study, we argue that this interpretation is incomplete at best and seriously flawed at worst. Our article makes three contributions. First, on the basis of a wide variety of primary and secondary sources we reconstruct the history of computer networks between the late 1950s and the early 1990s. We show that the ARPANET network was one among a myriad of (commercial and non-commercial) networks that developed over that period of time the integration of these networks into an internet was likely to happen, whether ARPANET existed or not. Second, we make a systematic effort to quantify the significance of these various networks. This allows us to visualize more clearly the extent to which the ARPANET network was one among many, and not a particularly large one at that. Third, we provide a nuanced interpretation of the rise of various technologies, including the Transmission Control Protocol/Internet Protocol and the World Wide Web, as 'dominant designs.' Their rise should be interpreted within the economic framework of industries with network effects, in which historical accidents bring about tipping points that lead to universal acceptance. We thus show that history matters for understanding why information systems function in the way they do. Journal of Information Technology (201 3) 28, 18-33. doi:10.1057/jit.2013.4", "paper_title": "The history of the internet: the missing narratives", "paper_id": "WOS:000315931800002"}