{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "regular_language"}, {"score": 0.004594951819987416, "phrase": "new_advances"}, {"score": 0.004071846628708832, "phrase": "robust_classes"}, {"score": 0.0038255128976509545, "phrase": "group_languages"}, {"score": 0.0037079710789139305, "phrase": "partial_commutation"}, {"score": 0.003552204377093386, "phrase": "transitive_relation"}, {"score": 0.0034700069041302003, "phrase": "sufficient_graph"}, {"score": 0.0034564928013639125, "phrase": "theoretic_condition"}, {"score": 0.002888396879326153, "phrase": "largest_positive_variety"}, {"score": 0.00228499525153, "phrase": "combinatorial_ramsey_type_arguments"}, {"score": 0.0022320551224679526, "phrase": "syntactic_monoid"}, {"score": 0.002154930852763048, "phrase": "insertion_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Regular language", " Partial commutation", " Trace language", " Shuffle", " Variety of languages"], "paper_abstract": "The closure of a regular language under a [partial] commutation I has been extensively studied. We present new advances on two problems of this area: (1) When is the closure of a regular language under [partial] commutation still regular? (2) Are there any robust classes of languages closed under [partial] commutation? We show that the class Pol(G) of polynomials of group languages is closed under commutation, and under partial commutation when the complement of I in A(2) is a transitive relation. We also give a sufficient graph theoretic condition on I to ensure that the closure of a language of Pol(G) under I-commutation is regular. We exhibit a very robust class of languages W which is closed under commutation. This class contains Pol(G), is decidable and can be defined as the largest positive variety of languages not containing (ab)*. It is also closed under intersection, union, shuffle, concatenation, quotients, length-decreasing morphisms and inverses of morphisms. If I is transitive, we show that the closure of a language of W under I-commutation is regular. The proofs are nontrivial and combine several advanced techniques, including combinatorial Ramsey type arguments, algebraic properties of the syntactic monoid, finiteness conditions on semigroups and properties of insertion systems. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Regular languages and partial commutations", "paper_id": "WOS:000324608700004"}