{"auto_keywords": [{"score": 0.029027825485525773, "phrase": "similarity_queries"}, {"score": 0.0036553070575015344, "phrase": "data_similarities"}, {"score": 0.0033419808453225516, "phrase": "similarity-aware_operations"}, {"score": 0.003296212583539166, "phrase": "first-class_database_operators"}, {"score": 0.0026252106881752067, "phrase": "similarity_selection"}, {"score": 0.002518746501941657, "phrase": "similarity_group-by"}, {"score": 0.0023999697562763433, "phrase": "implementation_techniques"}, {"score": 0.002302619021497886, "phrase": "consistent_and_comprehensive_conceptual_evaluation_model"}, {"score": 0.0021789194955896102, "phrase": "rich_set"}, {"score": 0.0021490449563443025, "phrase": "transformation_rules"}, {"score": 0.0021049977753042253, "phrase": "cost-based_query_optimization"}], "paper_keywords": ["Similarity queries", " Query processing", " Query transformations", " Conceptual evaluation"], "paper_abstract": "Many application scenarios can significantly benefit from the identification and processing of similarities in the data. Even though some work has been done to extend the semantics of some operators, for example join and selection, to be aware of data similarities, there has not been much study on the role and implementation of similarity-aware operations as first-class database operators. Furthermore, very little work has addressed the problem of evaluating and optimizing queries that combine several similarity operations. The focus of this paper is the study of similarity queries that contain one or multiple first-class similarity database operators such as Similarity Selection, Similarity Join, and Similarity Group-by. Particularly, we analyze the implementation techniques of several similarity operators, introduce a consistent and comprehensive conceptual evaluation model for similarity queries, and present a rich set of transformation rules to extend cost-based query optimization to the case of similarity queries.", "paper_title": "Similarity queries: their conceptual evaluation, transformations, and processing", "paper_id": "WOS:000319276000006"}