{"auto_keywords": [{"score": 0.044987186634711365, "phrase": "computer_knowledge"}, {"score": 0.02322730111336099, "phrase": "digital_divide"}, {"score": 0.0169924797988854, "phrase": "academic-related_work"}, {"score": 0.010514349881698404, "phrase": "college_student_learning"}, {"score": 0.005649291542672819, "phrase": "private_universities"}, {"score": 0.004681971826924847, "phrase": "digital_divide-computer_use"}, {"score": 0.004175869526372684, "phrase": "college_students"}, {"score": 0.004050996777117918, "phrase": "student_academic_performance"}, {"score": 0.003985305257857655, "phrase": "research_questions"}, {"score": 0.003957477564354679, "phrase": "national_survey"}, {"score": 0.003857100082321815, "phrase": "taiwan"}, {"score": 0.003732981171114489, "phrase": "response_rate"}, {"score": 0.003604421041893448, "phrase": "computer_use"}, {"score": 0.0034640450599342488, "phrase": "total_computer_hours"}, {"score": 0.0034238045290210534, "phrase": "multiple_regressions"}, {"score": 0.0033998841732261072, "phrase": "generalized_ordered_logit"}, {"score": 0.003384029870084534, "phrase": "i.e._a_partial_proportional_odds_model"}, {"score": 0.003336907692258383, "phrase": "main_findings"}, {"score": 0.002954967280174553, "phrase": "middle_average_level"}, {"score": 0.0028866770996648057, "phrase": "significant_differences"}, {"score": 0.0028464607144683247, "phrase": "demographic_and_socioeconomic_family_background"}, {"score": 0.002666047990954489, "phrase": "blue-collar_workers"}, {"score": 0.0025862068041567934, "phrase": "social_sciences"}, {"score": 0.0025087506382067536, "phrase": "computer_skills"}, {"score": 0.002473786357109046, "phrase": "female_students"}, {"score": 0.002289993730291138, "phrase": "moderate_effect"}, {"score": 0.0022161977759646693, "phrase": "different_kinds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["adult learning", " country-specific developments", " post-secondary education", " teaching/learning strategies"], "paper_abstract": "By focusing on two dimensions of the digital divide-computer use and computer knowledge, this study explores four research questions: (1) What are the undergraduates doing with the computers they use at colleges? (2) How do undergraduates perform in regard to computer knowledge and skills? (3) With what is the digital divide among college students correlated? (4) What consequences does the digital divide have for student academic performance? In order to answer these research questions, a national survey was conducted. The survey investigated 3083 first-year college students of 12 4-year universities in Taiwan. A total of 2719 of them completed the questionnaires resulting in a response rate of 88.2%. In this study, the digital divide is measured in terms of computer use, which includes a variety of purposes for using computers and academic-related work as a proportion of total computer hours, and computer knowledge. Multiple regressions and a generalized ordered logit, i.e. a partial proportional odds model, are employed. The main findings include the following: (1) Undergraduates use computers not only for fulfilling their academic requirements and searching for information, but also for entertainment. On average, undergraduates spend about 19 h per week using computers, of which 5 h are academic-related. (2) Most undergraduates perform at the middle average level in terms of computer knowledge. (3) No significant differences among correlates in relating to demographic and socioeconomic family background were found in predicting the various purposes in using computers. (4) Students who are female, whose fathers and/or whose mothers are from minorities, whose fathers are blue-collar workers or unemployed, who study in the fields of the humanities and social sciences, and who enter private universities are at a disadvantage in terms of computer skills and knowledge. However, female students, students whose mothers were less educated and students who enroll in private universities are more focused computer users in terms of allocating time to academic-related work. (5) Computer knowledge and devotion to using computers for academic-related work have a moderate effect on college student learning, while the various other uses of computers do not. Of the different kinds of computer knowledge, it is the knowledge of software that helps students to learn the most. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "The correlates of the digital divide and their impact on college student learning", "paper_id": "WOS:000250796900028"}