{"auto_keywords": [{"score": 0.04894077157096776, "phrase": "academic_library's_research_collection"}, {"score": 0.00481495049065317, "phrase": "multiple_methods"}, {"score": 0.004757366891541805, "phrase": "faculty_use"}, {"score": 0.00455202992136173, "phrase": "local_citation_analysis"}, {"score": 0.0044795698035664695, "phrase": "journal_use"}, {"score": 0.0043210676983240805, "phrase": "journal"}, {"score": 0.004052031403739053, "phrase": "wos"}, {"score": 0.0032621876512517398, "phrase": "academic_staff"}, {"score": 0.003171740347925348, "phrase": "higher_impact_journals"}, {"score": 0.003108669771132255, "phrase": "\"_numbers"}, {"score": 0.003022465992278672, "phrase": "\"actual\"_numbers"}, {"score": 0.002857143106182505, "phrase": "cited_serial_references"}, {"score": 0.0026577673946415583, "phrase": "u.s._university_surveys"}, {"score": 0.002615381301695394, "phrase": "engineering_academics"}, {"score": 0.0025840347813610815, "phrase": "highest_number"}, {"score": 0.0025633455664747606, "phrase": "article_readings"}, {"score": 0.002512342528545883, "phrase": "research_related_activities"}, {"score": 0.0024922258873137093, "phrase": "citation_analysis_data"}, {"score": 0.0024524733595572084, "phrase": "unsw_library"}, {"score": 0.002308953751676031, "phrase": "electronic_formats"}, {"score": 0.0021738146596180404, "phrase": "joint_methods"}, {"score": 0.0021049977753042253, "phrase": "library_research_collections"}], "paper_keywords": [""], "paper_abstract": "This study assessed the intermix of local citation analysis and survey of journal use and reading patterns for evaluating an academic library's research collection. Journal articles and their cited references from faculties at the University of New South Wales were downloaded from the Web of Science (WoS) and journal impact factors from the Journal Citation Reports. The survey of the University of New South Wales (UNSW) academic staff asked both reader-related and reading-related questions. Both methods showed that academics in medicine published more and had more coauthors per paper than academics in the other faculties; however, when correlated with the number of students and academic staff, science published more and engineering published in higher impact journals. When \"recalled\" numbers of articles published were compared to \"actual\" numbers, all faculties over-estimated their productivity by nearly two-told. The distribution of cited serial references was highly skewed with over half of the titles cited only once. The survey results corresponded with U.S. university surveys with one exception: Engineering academics reported the highest number of article readings and read mostly for research related activities. Citation analysis data showed that the UNSW library provided the majority of journals in which researchers published and cited, mostly in electronic formats. However, the availability of non-journal cited sources was low. The joint methods provided both confirmatory and contradictory results and proved useful in evaluating library research collections.", "paper_title": "Local citation analysis, publishing and reading patterns: Using multiple methods to evaluate faculty use of an academic library's research collection", "paper_id": "WOS:000257168200003"}