{"auto_keywords": [{"score": 0.026693106017769648, "phrase": "online_newspaper"}, {"score": 0.010188282670518517, "phrase": "greek_newspaper_websites"}, {"score": 0.0076770179514961175, "phrase": "alexa"}, {"score": 0.005597954930788037, "phrase": "website_administrator"}, {"score": 0.00481495049065317, "phrase": "greek_newspapers'_websites"}, {"score": 0.004474856549909555, "phrase": "alexa_search_engine"}, {"score": 0.00440976345264104, "phrase": "recommendation_approach"}, {"score": 0.004345613093011898, "phrase": "greek_online_newspapers"}, {"score": 0.004282391936827106, "phrase": "potential_readers"}, {"score": 0.004146510711518748, "phrase": "recommender_tool"}, {"score": 0.003944916556494864, "phrase": "greek"}, {"score": 0.0037530749925749245, "phrase": "greek_information_bank"}, {"score": 0.0033572130837348623, "phrase": "naftemporiki_newspaper"}, {"score": 0.0033277936960179892, "phrase": "highest_traffic_rank"}, {"score": 0.003298631258267805, "phrase": "eleftherotypia_newspaper"}, {"score": 0.003203250401424656, "phrase": "macedonia_newspaper"}, {"score": 0.0031751758963130135, "phrase": "largest_number"}, {"score": 0.0031565959573536194, "phrase": "foreign_users"}, {"score": 0.0030295419709872634, "phrase": "uk."}, {"score": 0.002890557197908352, "phrase": "common_characteristics"}, {"score": 0.00284009509859163, "phrase": "proposed_recommendation_approach"}, {"score": 0.0027579362569638945, "phrase": "recommendation_solution"}, {"score": 0.002646880721119838, "phrase": "slight_adjustments"}, {"score": 0.0024813081174066653, "phrase": "newspaper's_features"}, {"score": 0.00241658945942583, "phrase": "prevailing_user_profile"}, {"score": 0.002272053079580848, "phrase": "writing_style"}], "paper_keywords": ["Newspapers", " Evaluation", " Worldwide web", " User studies", " Greece"], "paper_abstract": "Purpose - The aim of this work is to evaluate Greek newspaper websites using clustering and a number of criteria obtained from the Alexa search engine. Furthermore, a recommendation approach is proposed for matching Greek online newspapers with the profiles of potential readers. The paper presents the implementation and validation of a recommender tool that suggests to a user (based on age, education and income) an optional Greek newspaper's website to read. Design/methodology/approach - A total of 25 newspaper websites were selected from the Greek information bank http://edoellada.gr. After investigating these websites one by one, this number was decreased to 16 websites due to their printing prevention, cessation or no coverage by Alexa. Findings - Based on data obtained from Alexa, the Naftemporiki newspaper has the highest traffic rank and the Eleftherotypia newspaper the largest number of links among others. The Macedonia newspaper has the largest number of foreign users. The results of the study also show that most newspaper web:sites' visitors come from the UK. The expectation-maximisation (EM) clustering algorithm classifies the 16 websites into two groups based on some common characteristics. Research limitations/implications - The proposed recommendation approach is generic because it can be applied as a recommendation solution on various types of website, such as educational or commercial. However, slight adjustments are needed depending on the nature of recommending websites. Practical implications - A website administrator of an online newspaper can adapt the newspaper's features such as content and layout according to the prevailing user profile of the online newspaper. For example, a website administrator of an online newspaper whose dominant user education is \"no.college\" should enable the writing style of this newspaper in a more naive way. The administrator can also add advertisements that are more suitable to readers aged between 35 and 55 years, if the most frequent age of users of this online newspaper is between 35 and 55. Originality/value - The results of this research will be important not only to administrators of Greek newspaper websites but also to anyone with a need to increase the usage of a website.", "paper_title": "Evaluating and recommending Greek newspapers' websites using clustering", "paper_id": "WOS:000302485800005"}