{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "peer-to-peer_iptv_communities"}, {"score": 0.004506968388996092, "phrase": "content_distribution"}, {"score": 0.004360412703519539, "phrase": "content_delivery"}, {"score": 0.004278807087784626, "phrase": "passive_downloaders"}, {"score": 0.004159241394996858, "phrase": "content_producers"}, {"score": 0.003986103192038901, "phrase": "multimedia_contents"}, {"score": 0.003948613642680196, "phrase": "network_communities"}, {"score": 0.003678414118674967, "phrase": "detailed_study"}, {"score": 0.0035925056609681194, "phrase": "useful_insights"}, {"score": 0.0031619994642255846, "phrase": "novel_results"}, {"score": 0.002917736974519881, "phrase": "video_traffic"}, {"score": 0.002782938683493689, "phrase": "different_time_scales"}, {"score": 0.0022385926290967263, "phrase": "network_nodes"}], "paper_keywords": ["Peer-to-peer IPTV communities", " Traffic analysis", " Internet measurement", " Experimental restbeds"], "paper_abstract": "The Internet is currently experiencing one of the most important challenges in terms of content distribution since its first uses as a medium for content delivery: users from passive downloaders and browsers are moving towards content producers and publishers. They often distribute and retrieve multimedia contents establishing network communities. This is the case of peer-to-peer IPTV communities. In this work we present a detailed study of P2P IPTV traffic, providing useful insights on both transport- and packet-level properties as well as on the behavior of the peers inside the network. In particular, we provide novel results on the (i) ports and protocols used: (ii) differences between signaling and video traffic; (iii) behavior of the traffic at different time scales; (iv) differences between TO and UDP traffic: (v) traffic generated and received by peers; (vi) peers neighborhood and session duration. The knowledge gained thanks to this analysis is useful for several tasks, e.g. traffic identification, understanding the performance of different P2P IPTV technologies and the impact of such traffic on network nodes and links, and building more realistic models for simulations.(1) (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Traffic analysis of peer-to-peer IPTV communities", "paper_id": "WOS:000264083300004"}