{"auto_keywords": [{"score": 0.04379920681756381, "phrase": "triangle_inequality"}, {"score": 0.018626634359589563, "phrase": "nonmetric_measures"}, {"score": 0.00481495049065317, "phrase": "fast_exact_and_approximate_search"}, {"score": 0.004739296614044257, "phrase": "multimedia_systems"}, {"score": 0.004579414215146498, "phrase": "query_object"}, {"score": 0.004531308346870945, "phrase": "similarity_assessment"}, {"score": 0.004366865376588095, "phrase": "db_objects"}, {"score": 0.0042982215334159135, "phrase": "similarity_measure"}, {"score": 0.004087858617494781, "phrase": "relevant_objects"}, {"score": 0.004044895463817651, "phrase": "metric_access_methods"}, {"score": 0.003918685725277592, "phrase": "recent_research"}, {"score": 0.0036974027232000335, "phrase": "made-to-measure_similarity"}, {"score": 0.003433686179247488, "phrase": "sophisticated_similarity_measures"}, {"score": 0.0033796614187448, "phrase": "black-box_nonanalytic_form"}, {"score": 0.0033002085989689875, "phrase": "even_a_hardware_device"}, {"score": 0.00285355076155907, "phrase": "mentioned_aspects"}, {"score": 0.0028384974541050497, "phrase": "similarity_retrieval"}, {"score": 0.0027571086524714743, "phrase": "approximate_search"}, {"score": 0.0027425627058001133, "phrase": "metric_versus_nonmetric_search"}, {"score": 0.0026851402402656246, "phrase": "similarity_retrieval_framework"}, {"score": 0.0026219720371350942, "phrase": "single_unified_model"}, {"score": 0.002540047443578731, "phrase": "dissimilarity_measure"}, {"score": 0.0023338514021359843, "phrase": "mam-based_retrieval"}, {"score": 0.0023031776036503324, "phrase": "varying_\"amount"}, {"score": 0.002144357963705675, "phrase": "desired_modification"}, {"score": 0.002127400176088142, "phrase": "black-box_distance"}], "paper_keywords": ["design", " algorithms", " similarity retrieval", " approximate and exact search"], "paper_abstract": "In multimedia systems we usually need to retrieve database (DB) objects based on their similarity to a query object, while the similarity assessment is provided by a measure which defines a (dis) similarity score for every pair of DB objects. In most existing applications, the similarity measure is required to be a metric, where the triangle inequality is utilized to speed up the search for relevant objects by use of metric access methods (MAMs), for example, the M-tree. A recent research has shown, however, that nonmetric measures are more appropriate for similarity modeling due to their robustness and ease to model a made-to-measure similarity. Unfortunately, due to the lack of triangle inequality, the nonmetric measures cannot be directly utilized by MAMs. From another point of view, some sophisticated similarity measures could be available in a black-box nonanalytic form (e. g., as an algorithm or even a hardware device), where no information about their topological properties is provided, so we have to consider them as nonmetric measures as well. From yet another point of view, the concept of similarity measuring itself is inherently imprecise and we often prefer fast but approximate retrieval over an exact but slower one. To date, the mentioned aspects of similarity retrieval have been solved separately, that is, exact versus approximate search or metric versus nonmetric search. In this article we introduce a similarity retrieval framework which incorporates both of the aspects into a single unified model. Based on the framework, we show that for any dissimilarity measure (either a metric or nonmetric) we are able to change the \"amount\" of triangle inequality, and so obtain an approximate or full metric which can be used for MAM-based retrieval. Due to the varying \"amount\" of triangle inequality, the measure is modified in a way suitable for either an exact but slower or an approximate but faster retrieval. Additionally, we introduce the TriGen algorithm aimed at constructing the desired modification of any black-box distance automatically, using just a small fraction of the database.", "paper_title": "Unified framework for fast exact and approximate search in dissimilarity spaces", "paper_id": "WOS:000251588500010"}