{"auto_keywords": [{"score": 0.04575734555459498, "phrase": "human_skin"}, {"score": 0.040123926246889534, "phrase": "application_temperature"}, {"score": 0.025283537827141656, "phrase": "test_data"}, {"score": 0.02504302957024089, "phrase": "fuzzy_class"}, {"score": 0.024804750913975767, "phrase": "published_data"}, {"score": 0.00481495049065317, "phrase": "mamdani-type"}, {"score": 0.0047527118741586055, "phrase": "skin_permeability"}, {"score": 0.004282787299993434, "phrase": "multiple_data_sources"}, {"score": 0.0042550030421781605, "phrase": "laboratory_data"}, {"score": 0.004213662826578328, "phrase": "data_bases"}, {"score": 0.004172722575842674, "phrase": "statistical_models"}, {"score": 0.004132178452877669, "phrase": "expert_opinion"}, {"score": 0.003569050665799723, "phrase": "mole_molecular_weight"}, {"score": 0.0032157824854214313, "phrase": "predicted_values"}, {"score": 0.0031638248208086263, "phrase": "permeability_coefficient"}, {"score": 0.0027862576750944277, "phrase": "predicted_and_actual_fuzzy_classification"}, {"score": 0.0027412207934201013, "phrase": "predicted_outputs"}, {"score": 0.0027145478956494356, "phrase": "crisp_values"}, {"score": 0.002670667021775741, "phrase": "published_values"}, {"score": 0.002644678812707061, "phrase": "modified_form"}, {"score": 0.0026189428303175664, "phrase": "hamming_distance_measure"}, {"score": 0.002518472813045417, "phrase": "entropy_measure"}, {"score": 0.0024376912001213362, "phrase": "predicted_fuzzy_outputs"}], "paper_keywords": ["Mamdani fuzzy modeling", " Hamming distance", " skin permeability"], "paper_abstract": "Two Mamdani type fuzzy models ( three inputs-one output and two inputs-one output) were developed to predict the permeability of compounds through human skin. The models were derived from multiple data sources including laboratory data, published data bases, published statistical models, and expert opinion. The inputs to the model include information about the compound ( molecular weight and octonal-H2O partition coefficient) and the application temperature. One model included all three parameters as inputs and the other model only included information about the compound. The values for mole molecular weight ranged from 30 to 600 Da. The values for the log of the octonal-H2O partition coefficient ranged from -3.1 to 4.34. The values for the application temperature ranged from 22 to 39 degrees C. The predicted values of the log of permeability coefficient ranged from -5.5 to -0.08. Each model was a collection of rules that express the relationship of each input to the permeability of the compound through human skin. The quality of the model was determined by comparing predicted and actual fuzzy classification and defuzzification of the predicted outputs to get crisp values for correlating estimates with published values. A modified form of the Hamming distance measure is proposed to compare predicted and actual fuzzy classification. An entropy measure is used to describe the ambiguity associated with the predicted fuzzy outputs. The three input model predicted over 70% of the test data within one-half of a fuzzy class of the published data. The two input model predicted over 40% of the test data within one-half of a fuzzy class of the published data. Comparison of the models show that the three input model exhibited less entropy than the two input model. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Rule-based Mamdani-type fuzzy modeling of skin permeability", "paper_id": "WOS:000249508500025"}