{"auto_keywords": [{"score": 0.047360974305469115, "phrase": "cdc"}, {"score": 0.0106123681970393, "phrase": "contextual_document_clustering"}, {"score": 0.00848743265315302, "phrase": "new_documents"}, {"score": 0.0043619799095455415, "phrase": "dynamic_and_rapidly_changing_environment"}, {"score": 0.0042650992966174065, "phrase": "dynamic_environment"}, {"score": 0.004096082254543022, "phrase": "time-ordered_segments"}, {"score": 0.0024311346712789553, "phrase": "six_times_its_original_size"}, {"score": 0.002292965705677312, "phrase": "similar_simple_incremental_approaches"}, {"score": 0.0022118619998034742, "phrase": "icdc"}, {"score": 0.0021529183360603434, "phrase": "unique_manner"}, {"score": 0.0021049977753042253, "phrase": "cluster_themes"}], "paper_keywords": [""], "paper_abstract": "In this article, we assess the effectiveness of Contextual Document Clustering (CDC) as a means of indexing within a dynamic and rapidly changing environment. We simulate a dynamic environment, by splitting two chronologically ordered datasets into time-ordered segments and assessing how the technique performs under two different scenarios. The first is when new documents are added incrementally without reclustering [incremental CDC (iCDC)], and the second is when reclustering is performed [nonincremental CDC (nCDC)]. The datasets are very large, are independent of each other, and belong to two very different domains. We show that CDC itself is effective at clustering very large document corpora, and that, significantly, it lends itself to a very simple, efficient incremental document addition process that is seen to be very stable over time despite the size of the corpus growing considerably. It was seen to be effective at in- crementally clustering new documents even when the corpus grew to six times its original size. This is in contrast to what other researchers have found when applying similar simple incremental approaches to document clustering. The stability of iCDC is accounted for by the unique manner in which CDC discovers cluster themes.", "paper_title": "An investigation into the stability of contextual document clustering", "paper_id": "WOS:000252161000008"}