{"auto_keywords": [{"score": 0.04508451323215887, "phrase": "original_image"}, {"score": 0.00481495049065317, "phrase": "linear_template_mapping"}, {"score": 0.004677847043645765, "phrase": "artistic_recoloring_method"}, {"score": 0.004518442937844318, "phrase": "complex_scenes"}, {"score": 0.004389745162172933, "phrase": "visual_quality"}, {"score": 0.004048483412089098, "phrase": "color_theme"}, {"score": 0.0037989951856280423, "phrase": "munsell_color"}, {"score": 0.0029622717081190667, "phrase": "simpler_and_more_focused_color_contrasts"}, {"score": 0.0027159094186967247, "phrase": "regression_line"}, {"score": 0.0022696277881969896, "phrase": "color_distribution"}, {"score": 0.0022305310659333864, "phrase": "source_image"}, {"score": 0.0021668575137633317, "phrase": "transformed_color_distribution"}], "paper_keywords": ["Recoloring", " Templates", " Color contrast", " Color transfer"], "paper_abstract": "We propose an artistic recoloring method that enhances the perception of complex scenes, while preserving the visual quality of the original image. Our algorithm employs the template which contains the information of color theme. The colors of template is selected based on the Munsell color and are designed on the a (auaEuro parts per thousand) b (auaEuro parts per thousand) chromatic plane of the CIE L (auaEuro parts per thousand) a (auaEuro parts per thousand) b (auaEuro parts per thousand) color space. Template can be used to recolor the original image with simpler and more focused color contrasts. The proposed algorithm consists of the three steps. First, we calculate the regression line for the colors on the original image and the template. Then we create a transformation refer to the relationship between the two regression lines. This transformation is used to change the color distribution in the source image. Finally, the transformed color distribution is mapped from the chromatic a (auaEuro parts per thousand) b (auaEuro parts per thousand) plane to become the template.", "paper_title": "Image recoloring using linear template mapping", "paper_id": "WOS:000316876200005"}