{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chess_players"}, {"score": 0.004711843410316589, "phrase": "increasing_strength"}, {"score": 0.004677965073019951, "phrase": "chess_engines"}, {"score": 0.004495922204117959, "phrase": "computer_analysis"}, {"score": 0.004352236750212992, "phrase": "move-by-move_basis"}, {"score": 0.004049096735491828, "phrase": "sufficiently_strong_engine"}, {"score": 0.003753411452669234, "phrase": "position_evaluation"}, {"score": 0.003110579040263398, "phrase": "estimated_strength"}, {"score": 0.0030328769643087066, "phrase": "perceived_elo_rating"}, {"score": 0.0029571101238632783, "phrase": "player's_actual_rating"}, {"score": 0.002872827714395808, "phrase": "perceived_elo_ratings"}, {"score": 0.002790940765338191, "phrase": "actual_elo_ratings"}, {"score": 0.0027113815712365924, "phrase": "critical_factor"}, {"score": 0.002354762471810519, "phrase": "different_eras"}, {"score": 0.0021049977753042253, "phrase": "illustrative_purposes"}], "paper_keywords": [""], "paper_abstract": "The increasing strength of chess engines and their fine-tuned ability to evaluate positions provide the opportunity to use computer analysis for assessing the strength of players on a move-by-move basis, as a game is being played. As each player makes a move on the board, a sufficiently strong engine will be able to determine whether that move has contributed to improve or degrade the position. This change in position evaluation is defined as the gain per move. In this article, we assume that it is possible to characterise a player by a distribution of gain over several moves, preferably across several games. We present an approach to estimate the strength of players based on their distributions of gain. This estimated strength is expressed in terms of a perceived Elo rating, which may differ from a player's actual rating. However, the average of the perceived Elo ratings is equal to the average of the actual Elo ratings for a set of players. A critical factor in the approach is the need to determine the strength of the engine used for analysis. Once this is obtained, it is possible to carry out all sorts of comparisons between players, even players from different eras who never competed against each other. There are many potential applications but here we focus mainly on developing the approach, using a few recent tournaments as well as some historical events for illustrative purposes.", "paper_title": "DETERMINING THE STRENGTH OF CHESS PLAYERS BASED ON ACTUAL PLAY", "paper_id": "WOS:000209088500001"}