{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "integrated_management_system"}, {"score": 0.015214121792561831, "phrase": "heterogeneous_virtual_resources"}, {"score": 0.01343481349375567, "phrase": "distributed_systems"}, {"score": 0.004597244847332915, "phrase": "virtualization_technology"}, {"score": 0.004447766706144458, "phrase": "server_installation"}, {"score": 0.0038710257356894067, "phrase": "xen"}, {"score": 0.0037699314527031218, "phrase": "vmware"}, {"score": 0.003482160257566501, "phrase": "heterogeneous_platforms"}, {"score": 0.003153041030690117, "phrase": "heterogeneous_virtualized_resources"}, {"score": 0.0029706504420983896, "phrase": "current_virtualization_techniques"}, {"score": 0.0025173564697303836, "phrase": "main_focus"}, {"score": 0.0021049977753042253, "phrase": "libvirt-based_virtualization_api"}], "paper_keywords": ["Integrated management", " Heterogeneous virtual resources", " Hypervisor", " Libvirt", " Data distribution service"], "paper_abstract": "Virtualization technology reduces the costs for server installation, operation, and maintenance and it can simplify development of distributed systems. Currently, there are various virtualization technologies such as Xen, KVM, VMware, and etc, and all these technologies support various virtualization functions individually on the heterogeneous platforms. Therefore, it is important to be able to integrate and manage these heterogeneous virtualized resources in order to develop distributed systems based on the current virtualization techniques. This paper presents an integrated management system that is able to provide information for the usage of heterogeneous virtual resources and also to control them. The main focus of the system is to abstract various virtual resources and to reconfigure them flexibly. For this, an integrated management system has been developed and implemented based on a libvirt-based virtualization API and data distribution service (DDS).", "paper_title": "Towards an integrated management system based on abstraction of heterogeneous virtual resources", "paper_id": "WOS:000345077400009"}