{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "link_capacity"}, {"score": 0.015237830551664586, "phrase": "wireless_network"}, {"score": 0.010979652599463227, "phrase": "capest"}, {"score": 0.004777214679969785, "phrase": "wireless_networks"}, {"score": 0.004611013257082199, "phrase": "complex_task"}, {"score": 0.004556901872357751, "phrase": "available_capacity"}, {"score": 0.004261998281333649, "phrase": "arrival_rate"}, {"score": 0.0035981701736904495, "phrase": "high_implementation_overhead"}, {"score": 0.003555902292752528, "phrase": "restrictive_assumptions"}, {"score": 0.003459191419478298, "phrase": "real_networks"}, {"score": 0.0028293966058473476, "phrase": "iterative_fashion"}, {"score": 0.0027741761880779535, "phrase": "correct_estimate"}, {"score": 0.0026459927476753585, "phrase": "correct_value"}, {"score": 0.0024357240356443653, "phrase": "autorate_adaptation"}, {"score": 0.0023694065215394593, "phrase": "low_implementation_overhead"}, {"score": 0.0022509878391826867, "phrase": "residual_capacity"}, {"score": 0.002224510044064184, "phrase": "wireless_link"}, {"score": 0.0021554120436656334, "phrase": "network_layer"}, {"score": 0.0021049977753042253, "phrase": "underlying_chipset"}], "paper_keywords": ["Capacity estimation", " wireless mesh networks", " rate control"], "paper_abstract": "Estimating link capacity in a wireless network is a complex task because the available capacity at a link is a function of not only the current arrival rate at that link, but also of the arrival rate at links which interfere with that link as well as of the nature of interference between these links. Models which accurately characterize this dependence are either too computationally complex to be useful or lack accuracy. Further, they have a high implementation overhead and make restrictive assumptions, which makes them inapplicable to real networks. In this paper, we propose CapEst, a general, simple yet accurate, measurement-based approach to estimating link capacity in a wireless network. To be computationally light, CapEst allows inaccuracy in estimation; however, using measurements, it can correct this inaccuracy in an iterative fashion and converge to the correct estimate. Our evaluation shows that CapEst always converged to within 5 percent of the correct value in less than 18 iterations. CapEst is model-independent; hence, it is applicable to any MAC/PHY layer and works with autorate adaptation. Moreover, it has a low implementation overhead, can be used with any application which requires an estimate of residual capacity on a wireless link and can be implemented completely at the network layer without any support from the underlying chipset.", "paper_title": "CapEst: A Measurement-Based Approach to Estimating Link Capacity in Wireless Networks", "paper_id": "WOS:000310390400012"}