{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "xpath_queries"}, {"score": 0.004685938734697859, "phrase": "eulerian"}, {"score": 0.0045108906244892165, "phrase": "sequence-based_xml_indexing"}, {"score": 0.004318881178805575, "phrase": "xml_query_processing"}, {"score": 0.004024072318264299, "phrase": "state-of-the-art_xml_indexing"}, {"score": 0.00349324530379071, "phrase": "semantic_uncertainty_problem"}, {"score": 0.0032546105164772995, "phrase": "new_sequencing_technique"}, {"score": 0.0031500213134140953, "phrase": "eulerian_cycle"}, {"score": 0.002999386721353559, "phrase": "xml_document"}, {"score": 0.0026033756286033285, "phrase": "xml_tree"}, {"score": 0.0024788167298469455, "phrase": "associated_fasteulerstack_subsequence"}, {"score": 0.002347378595930709, "phrase": "semantic_uncertainty"}, {"score": 0.0022718774783143203, "phrase": "simple_query_equivalence_theory"}, {"score": 0.0021987994275190314, "phrase": "correct_answers"}, {"score": 0.00217496508306238, "phrase": "refinement_phases"}, {"score": 0.0021396960731214225, "phrase": "extensive_experimental_results"}], "paper_keywords": [""], "paper_abstract": "Sequence-based XML indexing aims at avoiding expensive join operations in XML query processing. In this paper, we first provide an overview of the state-of-the-art XML indexing and querying techniques, particularly the twig-based and sequence-based approaches, in the literature. We describe their difficulty in resolving the semantic uncertainty problem which is inherent in XPath queries with predicates. We then present a new sequencing technique based on the theory of Eulerian Cycle, called EulerSequenceing. Such method can translate an XML document (respectively XPath query) into a sequence with strict O(n) time and space complexity, where n is the number of nodes in an XML tree (respectively an XPath twig). An associated FastEulerStack subsequence matching algorithm is developed to deal with XPath queries with semantic uncertainty by generating one query sequence with a simple query equivalence theory, and then retrieve the correct answers without refinement phases. The extensive experimental results demonstrate that our FastEulerStack is efficient, effective, and scalable in processing XPath queries with predicates.", "paper_title": "Evaluation of XPath queries with predicates: an Eulerian cycle theory based sequencing approach", "paper_id": "WOS:000298942400002"}