{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "valued_relations"}, {"score": 0.004716520738331953, "phrase": "interestingness_measures"}, {"score": 0.0045820747375409435, "phrase": "knowledge_discovery"}, {"score": 0.0044514440242754815, "phrase": "association_rules"}, {"score": 0.004236074477264561, "phrase": "attributes_a"}, {"score": 0.0036502716977381004, "phrase": "datamining_context"}, {"score": 0.0033190180867511605, "phrase": "extracted_rules"}, {"score": 0.003132236287543072, "phrase": "new_approach"}, {"score": 0.002931569771634119, "phrase": "valued_relation"}, {"score": 0.0028596699752849682, "phrase": "numerical_values"}, {"score": 0.0024434201175883674, "phrase": "incomparability_issues"}, {"score": 0.0022962708568492734, "phrase": "numerical_nature"}, {"score": 0.0022492129111567824, "phrase": "pure_binary_approaches"}, {"score": 0.0021049977753042253, "phrase": "toy_example"}], "paper_keywords": [""], "paper_abstract": "One of the concerns of knowledge discovery in databases is the production of association rules. An association rule A -> B defines a relationship between two sets of attributes A and B, caracterising the data studied. Such a rule means that objects sharing attributes of A will \"likely\" have those contained in B. Yet, this notion of \"likeliness\" depends on the datamining context. Many interestingness measures have been introduced in order to quantify this likeliness. This panel of measures is heterogeneous and the ranking of extracted rules, according to measures, may differ largely. This contribution explores a new approach for assessing the quality of rules: aggregating valued relations. For each measure, a valued relation is built out of the numerical values it takes on the rules, and represents the preference of a rule over another. The aim in using such tools is to take into account the intensity of preference expressed by various measures, and should reduce incomparability issues related to differences in their co-domains. It also has the advantage of relating the numerical nature of measures compared to pure binary approaches. We studied several aggregation operators. In this. contribution we discuss results obtained on a toy example using the simplest of them.", "paper_title": "Aggregation of valued relations applied to association rule interestingness measures", "paper_id": "WOS:000237084600021"}