{"auto_keywords": [{"score": 0.04015450647819761, "phrase": "arbitrary_number"}, {"score": 0.03880550409822826, "phrase": "binary_phylogenetic_tree"}, {"score": 0.00443308765153716, "phrase": "computationally_simplest_known_model"}, {"score": 0.003939296259436904, "phrase": "polynomial_time"}, {"score": 0.0031100973266506163, "phrase": "scj_scenarios"}, {"score": 0.0027961342030212353, "phrase": "counting_and_sampling_problems"}, {"score": 0.002651213849567608, "phrase": "fully_polynomial_randomized_approximation_scheme"}, {"score": 0.0023554316787703137, "phrase": "wider_scope"}, {"score": 0.0023277282036119106, "phrase": "genome_rearrangements"}, {"score": 0.002246553137021003, "phrase": "parsimonious_evolutionary_scenarios"}, {"score": 0.002181069180139225, "phrase": "discrete_characters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computations on discrete structures", " Counting problems", " Single cut and join", " FPAUS", " FPRAS", " Non-approximability"], "paper_abstract": "The Single Cut or Join (SCJ) operation on genomes, generalizing chromosome evolution by fusions and fissions, is the computationally simplest known model of genome rearrangement. While most genome rearrangement problems are already hard when comparing three genomes, it is possible to compute in polynomial time a most parsimonious SCJ scenario for an arbitrary number of genomes related by a binary phylogenetic tree. Here we consider the problems of sampling and counting the most parsimonious SCJ scenarios. We show that both the sampling and counting problems are easy for two genomes, and we relate SCJ scenarios to alternating permutations. However, for an arbitrary number of genomes related by a binary phylogenetic tree, the counting and sampling problems become hard. We prove that if a Fully Polynomial Randomized Approximation Scheme or a Fully Polynomial Almost Uniform Sampler exist for the most parsimonious SCJ scenario, then RP = NP. The proof has a wider scope than genome rearrangements: the same result holds for parsimonious evolutionary scenarios on any set of discrete characters. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Counting and sampling SCJ small parsimony solutions", "paper_id": "WOS:000342475400006"}