{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hb"}, {"score": 0.04840176289062468, "phrase": "weis"}, {"score": 0.004565007074039171, "phrase": "prior_work"}, {"score": 0.004524640197999905, "phrase": "hopper"}, {"score": 0.004484619337298508, "phrase": "blum"}, {"score": 0.004158290806404304, "phrase": "low-cost_devices"}, {"score": 0.004103212598803194, "phrase": "radio-frequency_identification"}, {"score": 0.0038556354709511818, "phrase": "conjectured_hardness"}, {"score": 0.0034963129868796033, "phrase": "active_attacks"}, {"score": 0.0032706520949775065, "phrase": "sequential_executions"}, {"score": 0.003032405563826263, "phrase": "parallel_or_concurrent_executions"}, {"score": 0.0029133627624098064, "phrase": "stronger_class"}, {"score": 0.0028492532869274743, "phrase": "positive_answer"}, {"score": 0.0026182085765020548, "phrase": "recent_result"}, {"score": 0.002595016365060635, "phrase": "regev"}, {"score": 0.002537880772794665, "phrase": "aforementioned_question"}, {"score": 0.0022705467477443417, "phrase": "substantially_simpler_security_proofs"}, {"score": 0.0021049977753042253, "phrase": "soundness_error"}], "paper_keywords": [""], "paper_abstract": "Juels and Weis (building on prior work of Hopper and Blum) propose and analyze two shared-key authentication protocols - HB and HB(+) - whose extremely low computational cost makes them attractive for low-cost devices such as radio-frequency identification (RFID) tags. Security of these protocols is based on the conjectured hardness of the \"learning parity with noise\" (LPN) problem: the HB protocol is proven secure against a passive (eavesdropping) adversary, while the HB(+) protocol is proven secure against active attacks. Juels and Weis prove security of these protocols only for the case of sequential executions, and explicitly leave open the question of whether security holds also in the case of parallel or concurrent executions. In addition to guaranteeing security against a stronger class of adversaries, a positive answer to this question would allow the HB(+) protocol to be parallelized, thereby substantially reducing its round complexity. Adapting a recent result by Regev, we answer the aforementioned question in the affirmative and prove security of the HB and HB(+) protocols under parallel/concurrent executions. We also give what we believe to be substantially simpler security proofs for these protocols which are more complete in that they explicitly address the dependence of the soundness error on the number of iterations.", "paper_title": "Parallel and concurrent security of the HB and HB(+) protocols", "paper_id": "WOS:000238574200006"}