{"auto_keywords": [{"score": 0.0367698002611785, "phrase": "causal_inference"}, {"score": 0.010515976468041012, "phrase": "intermediate_phenotypes"}, {"score": 0.010185314503510515, "phrase": "rheumatoid_arthritis"}, {"score": 0.00481495049065317, "phrase": "causal_relationships"}, {"score": 0.004662705558154439, "phrase": "case_study"}, {"score": 0.004536029676655286, "phrase": "genetic_association_analysis"}, {"score": 0.004453488286477661, "phrase": "statistical_correlations"}, {"score": 0.004332471656145115, "phrase": "cause-to-effect_arrows"}, {"score": 0.004081385289516914, "phrase": "effect_label"}, {"score": 0.003988719758707836, "phrase": "genetic_analysis"}, {"score": 0.003097865379563127, "phrase": "genotypic_information"}, {"score": 0.0030554300179552415, "phrase": "shared_epitope"}, {"score": 0.0030135741897058844, "phrase": "causal_relationship"}, {"score": 0.0025892330566358503, "phrase": "third_variable"}, {"score": 0.002472822097373027, "phrase": "potential_ambiguities"}, {"score": 0.0021342613107011624, "phrase": "third_confounding_factor"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genetic association analysis is based on statistical correlations which do not assign any cause-to-effect arrows between the two correlated variables. Normally, such assignment of cause and effect label is not necessary in genetic analysis since genes are always the cause and phenotypes are always the effect. However, among intermediate phenotypes and biomarkers, assigning cause and effect becomes meaningful, and causal inference can be useful. Results: We show that causal inference is possible by an example in a study of rheumatoid arthritis. With the help of genotypic information, the shared epitope, the causal relationship between two biomarkers related to the disease, anti-cyclic citrullinated peptide (anti-CCP) and rheumatoid factor (RF) has been established. We emphasize the fact that third variable must be a genotype to be able to resolve potential ambiguities in causal inference. Two non-trivial conclusions have been reached by the causal inference: (1) anti-CCP is a cause of RF and (2) it is unlikely that a third confounding factor contributes to both anti-CCP and RF.", "paper_title": "Inferring causal relationships among intermediate phenotypes and biomarkers: a case study of rheumatoid arthritis", "paper_id": "WOS:000238768500015"}