{"auto_keywords": [{"score": 0.04921204406580073, "phrase": "atn"}, {"score": 0.00481495049065317, "phrase": "automated_trust_negotiation_using_cryptographic_credentials"}, {"score": 0.004762435022350756, "phrase": "automated_trust_negotiation"}, {"score": 0.004558012799538011, "phrase": "attribute_information"}, {"score": 0.004459101239560164, "phrase": "access_control_decisions"}, {"score": 0.004205660924155212, "phrase": "access_control_policies"}, {"score": 0.004159763048814389, "phrase": "traditional_atn"}, {"score": 0.003810093416457147, "phrase": "cyclic_dependency"}, {"score": 0.003315374849824563, "phrase": "precise_attribute_values"}, {"score": 0.0028116863172018593, "phrase": "atn_process"}, {"score": 0.002690771424958613, "phrase": "diverse_credential_schemes"}, {"score": 0.0025468951021098717, "phrase": "policy_language"}, {"score": 0.002473325513637559, "phrase": "authorization_requirements"}, {"score": 0.0023496433751182162, "phrase": "certified_attributes"}, {"score": 0.0022239665922395104, "phrase": "uncertified_attributes"}, {"score": 0.0021439311243100913, "phrase": "policy_satisfaction"}], "paper_keywords": ["Security", " Design", " Access control", " automated trust negotiation", " digital credentials", " privacy"], "paper_abstract": "In automated trust negotiation (ATN), two parties exchange digitally signed credentials that contain attribute information to establish trust and make access control decisions. Because the information in question is often sensitive, credentials are protected according to access control policies. In traditional ATN, credentials are transmitted either in their entirety or not at all. This approach can at times fail unnecessarily, either because a cyclic dependency makes neither negotiator willing to reveal her credential before her opponent because the opponent must be authorized for all attributes packaged together in a credential to receive any of them, or because it is necessary to disclose the precise attribute values, rather than merely proving they satisfy some predicate (such as being over 21 years of age). Recently, several cryptographic credential schemes and associated protocols have been developed to address these and other problems. However, they can be used only as fragments of an ATN process. This article introduces a framework for ATN in which the diverse credential schemes and protocols can be combined, integrated, and used as needed. A policy language is introduced that enables negotiators to specify authorization requirements that must be met by an opponent to receive various amounts of information about certified attributes and the credentials that contain it. The language also supports the use of uncertified attributes, allowing them to be required as part of policy satisfaction, and to place their (automatic) disclosure under policy control.", "paper_title": "Automated Trust Negotiation Using Cryptographic Credentials", "paper_id": "WOS:000272040100002"}