{"auto_keywords": [{"score": 0.049759738849303216, "phrase": "query_expansion"}, {"score": 0.049442871815077706, "phrase": "enterprise_search"}, {"score": 0.04819443626772539, "phrase": "search_quality"}, {"score": 0.04652663377625889, "phrase": "enterprise_data"}, {"score": 0.034134088407798795, "phrase": "related_entities"}, {"score": 0.00481495049065317, "phrase": "entity_relationship"}, {"score": 0.004579316323166273, "phrase": "direct_impact"}, {"score": 0.004413846562278824, "phrase": "structured_and_unstructured_information"}, {"score": 0.0042543303585113965, "phrase": "structured_information"}, {"score": 0.004211831095629, "phrase": "relational_databases"}, {"score": 0.003445316481824611, "phrase": "relevant_documents"}, {"score": 0.0030847461428168614, "phrase": "retrieval_performance"}, {"score": 0.0028944757265206332, "phrase": "novel_entity-centric_query_expansion_framework"}, {"score": 0.0027341763737751467, "phrase": "unstructured_and_structured_information"}, {"score": 0.0025568881277209725, "phrase": "existing_feedback_methods"}, {"score": 0.0024643161985886085, "phrase": "experimental_results"}, {"score": 0.0024152394732063908, "phrase": "proposed_entity-centric_query_expansion_strategies"}, {"score": 0.0023434465472518943, "phrase": "search_performance"}, {"score": 0.0023199918653986342, "phrase": "state-of-the-art_pseudo_feedback_methods"}, {"score": 0.0021987994275190314, "phrase": "trec_ad_hoc_retrieval_collections"}, {"score": 0.00216950156199795, "phrase": "proposed_methods"}, {"score": 0.0021262835396323623, "phrase": "short_keyword_queries"}, {"score": 0.0021049977753042253, "phrase": "general_search_domain"}], "paper_keywords": ["Entity centric", " Enterprise search", " Retrieval", " Query expansion", " Combining structured and unstructured data"], "paper_abstract": "Enterprise search is important, and the search quality has a direct impact on the productivity of an enterprise. Enterprise data contain both structured and unstructured information. Since these two types of information are complementary and the structured information such as relational databases is designed based on ER (entity-relationship) models, there is a rich body of information about entities in enterprise data. As a result, many information needs of enterprise search center around entities. For example, a user may formulate a query describing a problem that she encounters with an entity, e.g., the web browser, and want to retrieve relevant documents to solve the problem. Intuitively, information related to the entities mentioned in the query, such as related entities and their relations, would be useful to reformulate the query and improve the retrieval performance. However, most existing studies on query expansion are term-centric. In this paper, we propose a novel entity-centric query expansion framework for enterprise search. Specifically, given a query containing entities, we first utilize both unstructured and structured information to find entities that are related to the ones in the query. We then discuss how to adapt existing feedback methods to use the related entities and their relations to improve search quality. Experimental results over two real-world enterprise collections show that the proposed entity-centric query expansion strategies are more effective and robust to improve the search performance than the state-of-the-art pseudo feedback methods for long natural language-like queries with entities. Moreover, results over a TREC ad hoc retrieval collections show that the proposed methods can also work well for short keyword queries in the general search domain.", "paper_title": "Exploiting entity relationship for query expansion in enterprise search", "paper_id": "WOS:000334494200003"}