{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_diagrams"}, {"score": 0.0063425765017811305, "phrase": "task_performance"}, {"score": 0.004696491408936132, "phrase": "first_design_principles"}, {"score": 0.004412881870378388, "phrase": "empirical_studies"}, {"score": 0.004304271837157217, "phrase": "graphical_features"}, {"score": 0.004163587877500036, "phrase": "straight_line_segments"}, {"score": 0.003928321515373316, "phrase": "recent_empirical_research"}, {"score": 0.003768426876815755, "phrase": "prominent_set_visualization_techniques"}, {"score": 0.0037218844639600253, "phrase": "euler"}, {"score": 0.0036909281151862984, "phrase": "venn"}, {"score": 0.0035113478590679133, "phrase": "overlapping_sets"}, {"score": 0.003285380677401785, "phrase": "user_task_performance"}, {"score": 0.003177892611195514, "phrase": "seven_crowdsourced_empirical_studies"}, {"score": 0.0029242629306714773, "phrase": "minimal_number"}, {"score": 0.002900037689072025, "phrase": "line_segments"}, {"score": 0.0026796495639791426, "phrase": "thick_bars"}, {"score": 0.0023651843133643768, "phrase": "freely_available_software_implementation"}, {"score": 0.002306855521822739, "phrase": "user-controlled_graphical_choices"}, {"score": 0.002167235986623239, "phrase": "effective_visualizations"}, {"score": 0.0021049977753042253, "phrase": "human-computer_interaction"}], "paper_keywords": ["Sets", " visualization", " linear diagrams"], "paper_abstract": "This paper presents the first design principles that optimize the visualization of sets using linear diagrams. These principles are justified through empirical studies that evaluate the impact of graphical features on task performance. Linear diagrams represent sets using straight line segments, with line overlaps corresponding to set intersections. This study builds on recent empirical research, which establishes that linear diagrams can be superior to prominent set visualization techniques, namely Euler and Venn diagrams. We address the problem of how to best visualize overlapping sets using linear diagrams. To solve the problem, we investigate which graphical features of linear diagrams significantly impact user task performance. To this end, we conducted seven crowdsourced empirical studies involving a total of 1,760 participants. These studies allowed us to identify the following design principles, which significantly aid task performance: use a minimal number of line segments, use guidelines where overlaps start and end, and draw lines that are thin as opposed to thick bars. We also evaluated the following graphical properties that did not significantly impact task performance: color, orientation, and set order. The results are brought to life through a freely available software implementation that automatically draws linear diagrams with user-controlled graphical choices. An important consequence of our research is that users are now able to create effective visualizations of sets automatically, thus improving human-computer interaction.", "paper_title": "Visualizing Sets with Linear Diagrams", "paper_id": "WOS:000367406400002"}