{"auto_keywords": [{"score": 0.03152448407819682, "phrase": "gpu"}, {"score": 0.004767546015485477, "phrase": "gpgpu._feature"}, {"score": 0.004628101576367193, "phrase": "simple_surface_normals"}, {"score": 0.004296998284839309, "phrase": "object_recognition"}, {"score": 0.0034386894664467003, "phrase": "hardware-based_implementation"}, {"score": 0.0031609252620168446, "phrase": "rgbd_based_computer_vision_systems"}, {"score": 0.0029344771385297137, "phrase": "general_purpose_processor"}, {"score": 0.0028911669203979156, "phrase": "considerable_speed-ups"}, {"score": 0.002834409847642238, "phrase": "cpu_implementation"}, {"score": 0.0027513507830537165, "phrase": "advantageous_results"}, {"score": 0.0024306105794630246, "phrase": "descriptor_computation"}, {"score": 0.0022901862321082407, "phrase": "accelerated_descriptor"}, {"score": 0.002234092591045251, "phrase": "object_recognition_tasks"}, {"score": 0.0022120408738490437, "phrase": "source_code"}, {"score": 0.0021049977753042253, "phrase": "open_source_point_cloud_library"}], "paper_keywords": ["Real-time", " GPGPU", " RGB-D", " 3D local shape descriptor", " Object recognition"], "paper_abstract": "Feature vectors can be anything from simple surface normals to more complex feature descriptors. Feature extraction is important to solve various computer vision problems: e.g. registration, object recognition and scene understanding. Most of these techniques cannot be computed online due to their complexity and the context where they are applied. Therefore, computing these features in real-time for many points in the scene is impossible. In this work, a hardware-based implementation of 3D feature extraction and 3D object recognition is proposed to accelerate these methods and therefore the entire pipeline of RGBD based computer vision systems where such features are typically used. The use of a GPU as a general purpose processor can achieve considerable speed-ups compared with a CPU implementation. In this work, advantageous results are obtained using the GPU to accelerate the computation of a 3D descriptor based on the calculation of 3D semi-local surface patches of partial views. This allows descriptor computation at several points of a scene in real-time. Benefits of the accelerated descriptor have been demonstrated in object recognition tasks. Source code will be made publicly available as contribution to the Open Source Point Cloud Library.", "paper_title": "Real-time 3D semi-local surface patch extraction using GPGPU", "paper_id": "WOS:000365269700005"}