{"auto_keywords": [{"score": 0.046588866765139514, "phrase": "gapg"}, {"score": 0.00481495049065317, "phrase": "generalized_accelerated_proximal_gradient_approach"}, {"score": 0.004769702911065878, "phrase": "total-variation-based_image_restoration"}, {"score": 0.00438105507792004, "phrase": "original_apg_algorithm"}, {"score": 0.004299376442260755, "phrase": "lipschitz"}, {"score": 0.004218602458288531, "phrase": "appropriate_positive-definite_matrix"}, {"score": 0.004139639802595566, "phrase": "faster_convergence"}, {"score": 0.004081385289516914, "phrase": "tv-based_image_restoration_problems"}, {"score": 0.0039114753002009485, "phrase": "partial_derivatives"}, {"score": 0.0035925056609681194, "phrase": "tv_regularization"}, {"score": 0.0033943947596098583, "phrase": "recently_developed_apg-based_methods"}, {"score": 0.0033624514778823763, "phrase": "tv-based_image_restoration"}, {"score": 0.0028093921138602606, "phrase": "convergence_rate"}, {"score": 0.002281376498102863, "phrase": "mfista."}, {"score": 0.0021656385587456952, "phrase": "original_apg"}, {"score": 0.0021049977753042253, "phrase": "identical_problems"}], "paper_keywords": ["Convex optimization", " image restoration", " proximal gradient algorithm", " regularization", " total variation (TV)"], "paper_abstract": "This paper proposes a generalized accelerated proximal gradient (GAPG) approach for solving total variation (TV)-based image restoration problems. The GAPG algorithm generalizes the original APG algorithm by replacing the Lipschitz constant with an appropriate positive-definite matrix, resulting in faster convergence. For TV-based image restoration problems, we further introduce two auxiliary variables that approximate the partial derivatives. Constraints on the variables can easily be imposed without modifying the algorithm much, and the TV regularization can be either isotropic or anisotropic. As compared with the recently developed APG-based methods for TV-based image restoration, i.e., monotone version of the two-step iterative shrinkage/thresholding algorithm (MTwIST) and monotone version of the fast IST algorithm (MFISTA), our GAPG is much simpler as it does not require to solve an image denoising subproblem. Moreover, the convergence rate of O(k(-2)) is maintained by our GAPG, where k s the number of iterations; the cost of each iteration in GAPG is also lower. As a result, in our experiments, our GAPG approach can be much faster than MTwIST and MFISTA. The experiments also verify that our GAPG converges faster than the original APG and MTwIST when they solve identical problems.", "paper_title": "A Generalized Accelerated Proximal Gradient Approach for Total-Variation-Based Image Restoration", "paper_id": "WOS:000295008100005"}