{"auto_keywords": [{"score": 0.009709973768390386, "phrase": "transition_schemes"}, {"score": 0.00481495049065317, "phrase": "source_address_validation"}, {"score": 0.004703149944841539, "phrase": "ip_spoofing"}, {"score": 0.004611959213131437, "phrase": "research_focus"}, {"score": 0.004021071032434839, "phrase": "ietf"}, {"score": 0.0037915057447460133, "phrase": "key_properties"}, {"score": 0.0036315047659984247, "phrase": "savi"}, {"score": 0.0035332058983966424, "phrase": "simple_network_access_scenarios"}, {"score": 0.003128798520531889, "phrase": "long_period"}, {"score": 0.0028588847851995533, "phrase": "ordinary_solution"}, {"score": 0.0027167292419065514, "phrase": "improved_general_savi-based_framework"}, {"score": 0.002695570649836422, "phrase": "ip"}, {"score": 0.002531463482341473, "phrase": "essential_and_mutual_properties"}, {"score": 0.0023038997972591193, "phrase": "corresponding_sub-solutions"}, {"score": 0.002223927963267319, "phrase": "traceback_solution"}], "paper_keywords": [""], "paper_abstract": "IP spoofing has nowadays become a research focus, as it has been bothering netizens since the emergence of the Internet. Though many studies have made their contributions to the prevention of IP-spoofing, the most excellent one is the SAVI (Source Address Validation Improvement) proposal advocated by IETF, since it can prevent IP-spoofing from happening by automatically binding the key properties of hosts in layer2 access subnet. Nevertheless, till now, SAVI only focuses on the IPv6 stack and simple network access scenarios. To the best of our knowledge, there is no solution even has paid attention to IPv4/IPv6 transition scenarios. Given the fact that IPv4/IPv6 transition will continue to be adopted for a long period of time, this issue is becoming increasingly urgent. However, since transition schemes are plenty and diverse, hardly can an ordinary solution satisfy all the requirements of various transition scenarios. In this paper, we present an improved general SAVI-based framework of IP source address validation and traceback for IPv4/IPv6 transition scenarios. To achieve this goal, we extract essential and mutual properties from these transition schemes, and create sub-solutions for each property. Naturally, if one transition scheme is proposed by combining some properties, the corresponding sub-solutions would be included into its IP source address validation and traceback solution. Therefore, the advantage of this framework is its capability to adapt to all the transition schemes.", "paper_title": "A General Framework of Source Address Validation and Traceback for IPv4/IPv6 Transition Scenarios", "paper_id": "WOS:000328643600011"}