{"auto_keywords": [{"score": 0.04954276574546316, "phrase": "generalized_use"}, {"score": 0.01316433787837666, "phrase": "sn_p_systems"}, {"score": 0.007740489563401459, "phrase": "neural_p_systems"}, {"score": 0.007022239404323837, "phrase": "spiking_rules"}, {"score": 0.006866121914870035, "phrase": "sequential_way"}, {"score": 0.0067893606449658086, "phrase": "applicable_rule"}, {"score": 0.005143770943799185, "phrase": "computational_power"}, {"score": 0.00450020161335541, "phrase": "distributed_parallel_computing_devices"}, {"score": 0.003701401653850141, "phrase": "generalized_way"}, {"score": 0.0035648266669315943, "phrase": "exhaustive_way"}, {"score": 0.0032941471167321408, "phrase": "possible_number"}, {"score": 0.0028877818105020434, "phrase": "finite_sets"}, {"score": 0.002628506002255396, "phrase": "semilinear_sets"}, {"score": 0.0025892330566358503, "phrase": "sn_p"}, {"score": 0.0021049977753042253, "phrase": "desired_computational_power"}], "paper_keywords": [""], "paper_abstract": "Spiking neural P systems (SN P systems) are a class of distributed parallel computing devices inspired by spiking neurons, where the spiking rules are usually used in a sequential way (an applicable rule is applied one time at a step) or an exhaustive way (an applicable rule is applied as many times as possible at a step). In this letter, we consider a generalized way of using spiking rules by combining the sequential way and the exhaustive way: if a rule is used at some step, then at that step, it can be applied any possible number of times, nondeterministically chosen. The computational power of SN P systems with a generalized use of rules is investigated. Specifically, we prove that SN P systems with a generalized use of rules consisting of one neuron can characterize finite sets of numbers. If the systems consist of two neurons, then the computational power of such systems can be greatly improved, but not beyond generating semilinear sets of numbers. SN P systems with a generalized use of rules consisting of three neurons are proved to generate at least a non-semilinear set of numbers. In the case of allowing enough neurons, SN P systems with a generalized use of rules are computationally complete. These results show that the number of neurons is crucial for SN P systems with a generalized use of rules to achieve a desired computational power.", "paper_title": "Spiking Neural P Systems with a Generalized Use of Rules", "paper_id": "WOS:000344921400009"}