{"auto_keywords": [{"score": 0.027317205251797025, "phrase": "network's_post-learning_productions"}, {"score": 0.023951328846092662, "phrase": "english_vowels"}, {"score": 0.00481495049065317, "phrase": "neural_network"}, {"score": 0.004737201825299411, "phrase": "vocal_motor_development"}, {"score": 0.004641770842098217, "phrase": "crucial_foundation"}, {"score": 0.004604136423327813, "phrase": "language_development"}, {"score": 0.004548253531664032, "phrase": "significant_early_accomplishments"}, {"score": 0.004108066884382925, "phrase": "one's_language"}, {"score": 0.00407474190126995, "phrase": "previous_work"}, {"score": 0.004008897491380646, "phrase": "social_reinforcement"}, {"score": 0.0039280803011236395, "phrase": "vocalizations_infants"}, {"score": 0.0038332390893263844, "phrase": "neural_network_model"}, {"score": 0.0035332741328861776, "phrase": "self-organizing_map"}, {"score": 0.003433909720151841, "phrase": "realistic_vocalization_synthesizer"}, {"score": 0.003076052206618737, "phrase": "similar_muscle_activations"}, {"score": 0.0027666443986705453, "phrase": "different_conditions"}, {"score": 0.00221063611719246, "phrase": "korean_vowels"}, {"score": 0.0021837406983565098, "phrase": "model's_post-learning_productions"}, {"score": 0.0021049977753042253, "phrase": "vice_versa"}], "paper_keywords": ["Infant vocalization", " Motor development", " Neural network", " Reinforcement", " Neuromuscular control", " Articulatory speech synthesis"], "paper_abstract": "Vocal motor development in infancy provides a crucial foundation for language development. Some significant early accomplishments include learning to control the process of phonation (the production of sound at the larynx) and learning to produce the sounds of one's language. Previous work has shown that social reinforcement shapes the kinds of vocalizations infants produce. We present a neural network model that provides an account of how vocal learning may be guided by reinforcement. The model consists of a self-organizing map that outputs to muscles of a realistic vocalization synthesizer. Vocalizations are spontaneously produced by the network. If a vocalization meets certain acoustic criteria, it is reinforced, and the weights are updated to make similar muscle activations increasingly likely to recur. We ran simulations of the model under various reinforcement criteria and tested the types of vocalizations it produced after learning in the different conditions. When reinforcement was contingent on the production of phonated (i.e. voiced) sounds, the network's post-learning productions were almost always phonated, whereas when reinforcement was not contingent on phonation, the network's post-learning productions were almost always not phonated. When reinforcement was contingent on both phonation and proximity to English vowels as opposed to Korean vowels, the model's post-learning productions were more likely to resemble the English vowels and vice versa. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Prespeech motor learning in a neural network using reinforcement", "paper_id": "WOS:000314388600006"}