{"auto_keywords": [{"score": 0.04677854488900562, "phrase": "first-time_visitors"}, {"score": 0.03933093432923548, "phrase": "reputation_categorization"}, {"score": 0.03901373451392639, "phrase": "trust_transference"}, {"score": 0.03454081327902275, "phrase": "first_study"}, {"score": 0.004597861947580946, "phrase": "actual_buying_behavior"}, {"score": 0.004559451202070545, "phrase": "online_shopping_environments"}, {"score": 0.0044275118637330975, "phrase": "internet_store"}, {"score": 0.004317450843594688, "phrase": "established_reputation"}, {"score": 0.004054071599735255, "phrase": "trustbuilding_strategies"}, {"score": 0.003574364535717202, "phrase": "unit_grouping"}, {"score": 0.0033420978105332686, "phrase": "large_public_university"}, {"score": 0.0033141428467975795, "phrase": "hong_kong"}, {"score": 0.00323166859966514, "phrase": "laboratory_experiment"}, {"score": 0.003138030910104256, "phrase": "online_bookstore_environment"}, {"score": 0.0030857431184193765, "phrase": "real_task"}, {"score": 0.0030470980812086247, "phrase": "actual_book_purchases"}, {"score": 0.0028251537271620996, "phrase": "consumers'_trusting_beliefs"}, {"score": 0.0026862220320327613, "phrase": "consumers'_attitudes"}, {"score": 0.002511522462767081, "phrase": "actual_buying_behaviors"}, {"score": 0.0023980368333253147, "phrase": "second_study"}, {"score": 0.0023481578019624843, "phrase": "questionnaire_survey_approach"}], "paper_keywords": ["e-commerce", " online shopping", " theory of planned behavior", " trust", " Web site design"], "paper_abstract": "This research investigates the effectiveness of various trust-building strategies to influence actual buying behavior in online shopping environments, particularly for first-time visitors to an Internet store that does not have an established reputation. Drawing from the literature on trust, we developed a model of how trustbuilding strategies could affect trust and the consequences of trust. We investigated two trust-building strategies: portal association (based on reputation categorization and trust transference) and satisfied customer endorsements (based on unit grouping, reputation categorization, and trust transference). A series of two studies was conducted at a large public university in Hong Kong. The first study employed a laboratory experiment to test the model in an online bookstore environment, using a real task that involves actual book purchases. Of the two strategies investigated, satisfied customer endorsement by similar peers, but not portal association, was found to increase consumers' trusting beliefs about the store. This, in turn, positively influenced consumers' attitudes toward the store and their willingness to buy from the store, which ultimately led to actual buying behaviors. To gather further insights on the two Web strategies investigated, a second study was conducted using a questionnaire survey approach. Overall, the findings corroborated those in the first study. Specifically, it shows that endorsements by similar (local, nonforeign) peers, but not by dissimilar (foreign) peers, were effective means of developing trust among first-time visitors to online stores.", "paper_title": "Do I trust you online, and if so, will I buy? An empirical study of two trust-building strategies", "paper_id": "WOS:000241879900011"}