{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "maximal_number"}, {"score": 0.021322143446156728, "phrase": "fibonacci_words"}, {"score": 0.018930478555296566, "phrase": "vertical_bar"}, {"score": 0.009896252120042899, "phrase": "standard_sturmian_words"}, {"score": 0.009410464409083072, "phrase": "asymptotic_behaviour"}, {"score": 0.008923302121329081, "phrase": "sturmian_words"}, {"score": 0.00462919213721188, "phrase": "distinct_squares"}, {"score": 0.0045903243893123105, "phrase": "string_w"}, {"score": 0.004090578850678702, "phrase": "vie"}, {"score": 0.0033879057307626328, "phrase": "complicated_formulas"}, {"score": 0.0032754063607898904, "phrase": "s._we"}, {"score": 0.003044269254752414, "phrase": "infinite_sequence"}, {"score": 0.002600194073758015, "phrase": "natural_extension"}, {"score": 0.002297111954768114, "phrase": "upper_bound"}, {"score": 0.002195866991284673, "phrase": "summation_formulas"}, {"score": 0.0021348627335303016, "phrase": "closed_formula"}, {"score": 0.0021049977753042253, "phrase": "nontrivial_reductions"}], "paper_keywords": ["Sturmian words", " repetitions", " data compression"], "paper_abstract": "Denote by sq(w) the number of distinct squares in a string w and let S be the class of standard Sturmian words. They are generalizations of Fibonacci words and are important, combinatorics on words. For Fibonacci words the asymptotic behaviour of the number of runs and the number of squares is the same. Vie show that for Sturmian words the situation is quite different. The tight bound 8/10 vertical bar w vertical bar for the number of runs was given in [3]. In this paper we show that the tight bound for the maximal number of squares is 9/10 vertical bar w vertical bar. We use the results of [1], where exact (but, not, closed) complicated formulas were given for sq(w) for w is an element of S. We show that for all w is an element of S we have sq(w) <= 9/10 vertical bar w vertical bar and there is an infinite sequence of words w(k) is an element of S such that lim(k ->infinity) vertical bar w(k)vertical bar = infinity and lim(k ->infinity) sq(w(k))/vertical bar w(k)vertical bar = 9/10. Surprisingly the maximal number of squares is reached by the words with recurrences of length, only 5. This contrasts with, the situation of. Fibonacci words, though standard Sturmian words are natural extension of Fibonacci words. If this length drops to 4, the asymptotic behaviour of the maximal number of squares falls down significantly below 9/10 vertical bar w vertical bar. The structure of Sturmian words rich in squares has been discovered by us experimentally and verified theoretically. The upper bound is much harder, its proof is not a matter of. simple calculations. The summation formulas for the number of squares are complicated, no closed formula is known. Some nontrivial reductions were necessary.", "paper_title": "ASYMPTOTIC BEHAVIOUR OF THE MAXIMAL NUMBER OF SQUARES IN STANDARD STURMIAN WORDS", "paper_id": "WOS:000302061000006"}