{"auto_keywords": [{"score": 0.004655285779819366, "phrase": "global_supplier_selection"}, {"score": 0.004400804926266097, "phrase": "additional_degrees"}, {"score": 0.0041136473765874815, "phrase": "real_word"}, {"score": 0.0038668462001710314, "phrase": "fuzzy_multi-attribute_group_decision"}, {"score": 0.0036144035798673967, "phrase": "decision_makers"}, {"score": 0.0033594249301033604, "phrase": "attribute_weights"}, {"score": 0.0031223774204093713, "phrase": "upper_possibility"}, {"score": 0.002984867789900281, "phrase": "crisp_standard_deviation"}, {"score": 0.0026370661343466354, "phrase": "obtained_attribute_weights"}, {"score": 0.0025928815987676535, "phrase": "arithmetic_operations"}, {"score": 0.0023560952790080943, "phrase": "proposed_fuzzy_possibility_degree"}, {"score": 0.0022396019251440724, "phrase": "global_supplier_selection_problem"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Interval type-2 fuzzy sets", " possibility mean value", " fuzzy multi-attributes group decision making", " global supplier selection"], "paper_abstract": "Interval type-2 fuzzy sets (IT2 FS) provide us with additional degrees of freedom to represent the uncertainty and the fuzziness of the real word than traditional type-1 fuzzy sets. In this paper, we investigate the fuzzy multi-attribute group decision making (FMAGDM) problems in which all the information provided by the decision makers (DMs) is expressed as IT2 FS, and the information about attribute weights is completely unknown. We first introduce the concepts of lower and upper possibility mean value of IT2 FS. Based on the crisp standard deviation and mean deviation of IT2 FS, we establish one optimization model to determine the weights of attributes. Furthermore, we utilize the obtained attribute weights and the arithmetic operations to fuse the IT2 fuzzy information in the collective IT2 fuzzy decision matrix to get the overall IT2 fuzzy values of alternatives by which the proposed fuzzy possibility degree of all the given alternatives can be found. Finally, global supplier selection problem is given to illustrate the feasibility and effectiveness of the proposed method.", "paper_title": "Fuzzy Multi-Attribute Group Decision Making Method Based on Interval Type-2 Fuzzy Sets and Applications to Global Supplier Selection", "paper_id": "WOS:000330156000003"}