{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_diffusion"}, {"score": 0.008914853433678486, "phrase": "explicit_relationships"}, {"score": 0.004633996867999857, "phrase": "portal_main_page"}, {"score": 0.004217708394188058, "phrase": "blogosphere_an_important_medium"}, {"score": 0.0036359780843400625, "phrase": "existing_studies"}, {"score": 0.003597625122515975, "phrase": "social_networks"}, {"score": 0.002988101395789399, "phrase": "blog-service_providers"}, {"score": 0.0029253546782349875, "phrase": "high_quality_post"}, {"score": 0.002744888626958772, "phrase": "main_causes"}, {"score": 0.0025214217930287003, "phrase": "blogcast"}, {"score": 0.002231607958228148, "phrase": "halo_effect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data mining", " Social network analysis", " Blogosphere", " Information diffusion"], "paper_abstract": "The increase in the number of bloggers and the amount of information diffused in the blogosphere makes the blogosphere an important medium through which to communicate and exchange information. Accordingly, the interest in understanding the nature of the information diffusion in the blogosphere has also been increased. Existing studies in social networks have mainly focused on the information diffusion through explicit relationships between members. In this paper, we analyze the causes for the information diffusion without explicit relationships in the blogosphere. BlogCast, a functionality provided by blog-service providers to expose a high quality post on the portal main page, is found to be one of the main causes of the information diffusion without explicit relationships. We analyze the characteristics of the information diffusion through the BlogCast and its halo effect on the bloggers whose post has been exposed on the portal main page. In addition, we examine the sustainability of the halo effect of the BlogCast over time. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "An analysis on information diffusion through BlogCast in a blogosphere", "paper_id": "WOS:000343620500004"}