{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "brand"}, {"score": 0.00481495049065317, "phrase": "restrictive_blind_signatures"}, {"score": 0.0045846424310611745, "phrase": "blind_signature"}, {"score": 0.0039024014688338964, "phrase": "blind_signatures"}, {"score": 0.003715579364728729, "phrase": "necessary_information"}, {"score": 0.0033919477901198716, "phrase": "resulting_signatures"}, {"score": 0.0032294837250130327, "phrase": "restrictive_partially_blind_signatures"}, {"score": 0.0030319482153908037, "phrase": "existing_restrictive_partially_blind_signature_scheme"}, {"score": 0.0024912073108138613, "phrase": "id-based_restrictive_partially_blind_signature_scheme"}, {"score": 0.0023551955270737215, "phrase": "random_oracle_model"}, {"score": 0.0022110183535859374, "phrase": "proposed_signature_scheme"}, {"score": 0.002149799391146313, "phrase": "untraceable_off-line_electronic_cash_system"}], "paper_keywords": ["ID-based systems", " blind signatures", " bilinear pairings"], "paper_abstract": "Restrictive blind signatures allow a recipient to receive a blind signature on a message not known to the signer but the choice of message is restricted and must conform to certain rules. Partially blind signatures allow a signer to explicitly include necessary information (expiration date, collateral conditions, or whatever) in the resulting signatures under some agreement with receiver. Restrictive partially blind signatures incorporate the advantages of these two blind signatures. The existing restrictive partially blind signature scheme was constructed under certificate-based (CA-based) public key systems. In this paper we follow Brand's construction to propose the first identity-based (ID-based) restrictive blind signature scheme from bilinear pairings. Furthermore, we first propose an ID-based restrictive partially blind signature scheme, which is provably secure in the random oracle model. As an application, we use the proposed signature scheme to build an untraceable off-line electronic cash system followed the Brand's construction. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "ID-based restrictive partially blind signatures and applications", "paper_id": "WOS:000244026300002"}