{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "incentive_mechanisms"}, {"score": 0.0044192837023190445, "phrase": "autonomous_character"}, {"score": 0.004317109072311102, "phrase": "selfish_peers"}, {"score": 0.004040211152784802, "phrase": "successful_cooperations"}, {"score": 0.003946766004066276, "phrase": "inventive_mechanisms"}, {"score": 0.0038106195546165574, "phrase": "game_theory"}, {"score": 0.0035383712891119937, "phrase": "peers'_transaction_relationships"}, {"score": 0.003443031148055198, "phrase": "novel_analysis_framework"}, {"score": 0.0034029588672379926, "phrase": "spatial_evolutionary_game_theory"}, {"score": 0.0032094634756436595, "phrase": "transaction_overlay_network"}, {"score": 0.0031351720217878917, "phrase": "transaction_relationships"}, {"score": 0.002968424524565369, "phrase": "donor-recipient_game"}, {"score": 0.0028771413440398614, "phrase": "learning_noise"}, {"score": 0.0028436364707396613, "phrase": "common_behaviors"}, {"score": 0.0026095369186867707, "phrase": "reciprocation-based_incentive_mechanism"}, {"score": 0.002559072326933071, "phrase": "requestors'_behaviors"}, {"score": 0.0024040357029838774, "phrase": "homogeneous_and_heterogeneous_benefits"}, {"score": 0.002223351523626989, "phrase": "peers'_strategies"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["incentive mechanism", " evaluation", " spatial evolutionary game theory", " peer-to-peer"], "paper_abstract": "In peer-to-peer (P2P) networks, contributions are made by peers voluntarily for the autonomous character of peers. However, selfish peers may refuse to be cooperative when considering their limited transmission resources. Incentive mechanisms are always used to guarantee successful cooperations among peers. Although the inventive mechanisms have been widely investigated on the basis of game theory, most researches assume that peers are well mixed in the network, regardless of the influence of peers' transaction relationships. In this paper, a novel analysis framework based on spatial evolutionary game theory is proposed to verify the effectiveness of incentive mechanisms. In the framework, a transaction overlay network is used to model the transaction relationships of peers. The transactions between clients and servers are modeled as the donor-recipient game to satisfy their asymmetric characters. Influences of the learning noise and some common behaviors of peers on incentive mechanisms are also considered. Moreover, in order to demonstrate the utility of the framework, a reciprocation-based incentive mechanism, which considers the requestors' behaviors of providing and consuming services, is thoroughly investigated under the framework in scenarios with homogeneous and heterogeneous benefits of services. By using the framework, besides the effectiveness of incentive mechanisms, the detailed spatiotemporal evolutions of peers' strategies driven by incentive mechanisms can also be obtained. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Analysis and evaluation of incentive mechanisms in P2P networks: a spatial evolutionary game theory perspective", "paper_id": "WOS:000358507500010"}