{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "merge_sets"}, {"score": 0.007113955218233762, "phrase": "ssa_form"}, {"score": 0.004776297980616768, "phrase": "dj-graphs"}, {"score": 0.004624751696958501, "phrase": "efficient_algorithm"}, {"score": 0.004550783060775205, "phrase": "liveness_information"}, {"score": 0.004514241562580097, "phrase": "program_variables"}, {"score": 0.004249332848326785, "phrase": "merge_set"}, {"score": 0.003999910370213748, "phrase": "cfg"}, {"score": 0.003473178781851477, "phrase": "prior_knowledge"}, {"score": 0.0032559935867182035, "phrase": "liveness_query"}, {"score": 0.003152531962718477, "phrase": "analysis_phase"}, {"score": 0.0029913511336659327, "phrase": "dominator_tree"}, {"score": 0.0029553380263320195, "phrase": "pre-computed_merge_sets"}, {"score": 0.0025145109881926143, "phrase": "existing_algorithms"}, {"score": 0.0024842242921857705, "phrase": "additional_complexities"}, {"score": 0.0024345529783611703, "phrase": "irreducible_loops"}, {"score": 0.0023099954987126, "phrase": "ssa_construction_step"}, {"score": 0.002174155795026218, "phrase": "liveness_computation"}, {"score": 0.0021049977753042253, "phrase": "recent_algorithm"}], "paper_keywords": ["Liveness", " Algorithms", " Compilers", " Liveness", " SSA", " merge set", " dominator tree", " DJ-graph", " optimizing compilers"], "paper_abstract": "In this work we devise an efficient algorithm that computes the liveness information of program variables. The algorithm employs SSA form and DJ-graphs as representation to build Merge sets. The Merge set of node n, M(n) is based on the structure of the Control Flow Graph (CFG) and consists of all nodes where a phi-function needs to be placed, if a definition of a variable appears in n. The merge sets of a CFG can be computed using DJ-graphs without prior knowledge of how the variables are used and defined. Later, we can answer the liveness query (as a part of other optimization or analysis phase) by utilizing the knowledge of the use/def of variables, the dominator tree and the pre-computed merge sets. On average, merge sets have been shown to be of size comparable to the Dominance Frontier(DF) set of a CFG and can be computed efficiently for all kinds of applications consisting of both reducible and irreducible loops. This is an advantage over existing algorithms which require additional complexities while handling applications using irreducible loops. For cases where the merge sets have already been created during the SSA construction step, the cost of our algorithm reduces even further when we use these merge sets for liveness computation. We have compared our new algorithm with a recent algorithm for computing liveness based on SSA form, and show how it performs better in practice, though being simpler to understand and implement.", "paper_title": "Efficient Liveness Computation Using Merge Sets and DJ-Graphs", "paper_id": "WOS:000299995000010"}