{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ad-hoc_networks"}, {"score": 0.004531997388646422, "phrase": "initial_secrets"}, {"score": 0.004454237726525018, "phrase": "ad-hoc_network"}, {"score": 0.0043213410601860985, "phrase": "sensor_network"}, {"score": 0.002790254164160135, "phrase": "constant_factor"}, {"score": 0.0026835045963349647, "phrase": "user_capability"}, {"score": 0.0026146109167103655, "phrase": "necessary_secrets"}, {"score": 0.0024713335323674223, "phrase": "security_compromise"}, {"score": 0.002179313258573377, "phrase": "user_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ad-hoc networks", " sensor networks", " security", " instantiating security", " scalability"], "paper_abstract": "In this paper, we focus our attention on the problem of assigning initial secrets to users in ad-hoc network (respectively, sensors in a sensor network) so that they can use those secrets to ensure authentication and privacy during their communication. The goal of this assignment is to ensure that any two users can communicate securely with each other even though each user maintains only a small number of secrets. With this motivation, we present a protocol that maintains O(root n) secrets per user where n is the number of users in the system. We show that our secret distribution protocol suffices for privacy and authentication as well as secure multihop communication between two users. Furthermore, we show that the number of secrets maintained in this protocol is within a constant factor of the optimal. For the case where user capability prevents them from maintaining the necessary secrets, we propose two probabilistic protocols that maintain 0(log n) secrets and where the probability of security compromise between two users is inversely proportional to the number of secrets they maintain. Thus, our protocols provide a continuum where the level of privacy and authentication depends upon user requirements and capabilities. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Secret instantiation in ad-hoc networks", "paper_id": "WOS:000234868500006"}