{"auto_keywords": [{"score": 0.03781219191522741, "phrase": "parallel_plans"}, {"score": 0.014210240800265339, "phrase": "propositional_logic"}, {"score": 0.00906856238431608, "phrase": "sequential_plan"}, {"score": 0.00481495049065317, "phrase": "plan_search"}, {"score": 0.004622450915803531, "phrase": "satisfiability_testing"}, {"score": 0.004392565073466714, "phrase": "time_points"}, {"score": 0.004188287972391714, "phrase": "different_values"}, {"score": 0.004117647922204903, "phrase": "first_problem"}, {"score": 0.004020740863986328, "phrase": "parallel_operator_application"}, {"score": 0.0038467574225322086, "phrase": "standard_semantics"}, {"score": 0.003807684498435389, "phrase": "parallel_operators"}, {"score": 0.003520971639466546, "phrase": "dimopoulos_et_al"}, {"score": 0.003438058620195309, "phrase": "normal_form"}, {"score": 0.0031467766123827717, "phrase": "present_translations"}, {"score": 0.002681255756642227, "phrase": "parallel_plan"}, {"score": 0.002530359917257626, "phrase": "second_problem"}, {"score": 0.0023000698178350415, "phrase": "big_efficiency_gains"}, {"score": 0.0022382002476510573, "phrase": "standard_strategy"}, {"score": 0.002163193271881447, "phrase": "increasing_number"}, {"score": 0.0021484955960643167, "phrase": "time_steps"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["planning", " satisfiability", " complexity"], "paper_abstract": "We address two aspects of constructing plans efficiently by means of satisfiability testing: efficient encoding of the problem of existence of plans of a given number t of time points in the propositional logic and strategies for finding plans, given these formulae for different values of t. For the first problem we consider three semantics for plans with parallel operator application in order to make the search for plans more efficient. The standard semantics requires that parallel operators are independent and can therefore be executed in any order. We consider a more relaxed definition of parallel plans which was first proposed by Dimopoulos et al., as well as a normal form for parallel plans that requires every operator to be executed as early as possible. We formalize the semantics of parallel plans emerging in this setting and present translations of these semantics into the propositional logic. The sizes of the translations are asymptotically optimal. Each of the semantics is constructed in such a way that there is a plan following the semantics exactly when there is a sequential plan, and moreover, the existence of a parallel plan implies the existence of a sequential plan with as many operators as in the parallel one. For the second problem we consider strategies based on testing the satisfiability of several formulae representing plans of n time steps for several values of it concurrently by several processes. We show that big efficiency gains can be obtained in comparison to the standard strategy of sequentially testing the satisfiability of formulae for an increasing number of time steps. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Planning as satisfiability: parallel plans and algorithms for plan search", "paper_id": "WOS:000241704800001"}