{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "young_undergraduate_college_students"}, {"score": 0.004701985831087475, "phrase": "digital_natives"}, {"score": 0.0045052562941109734, "phrase": "completely_digital_information_environments"}, {"score": 0.004215397034321004, "phrase": "constant_transition"}, {"score": 0.004175533280178052, "phrase": "successive_forms"}, {"score": 0.004136044939878838, "phrase": "digital_storage"}, {"score": 0.0040969285074699, "phrase": "communication_devices"}, {"score": 0.003944112858235306, "phrase": "daily_work"}, {"score": 0.00388828234270598, "phrase": "young_people"}, {"score": 0.0038332390893263844, "phrase": "effective_management"}, {"score": 0.0037610536973798113, "phrase": "digital_academic_materials"}, {"score": 0.0027610089418453614, "phrase": "remarkable_creativity"}, {"score": 0.0026705669656375197, "phrase": "automated_and_manual_resources"}, {"score": 0.002522344964242888, "phrase": "yearlong_procession"}, {"score": 0.002359759876402679, "phrase": "time_management_activities"}, {"score": 0.0022393843660697484, "phrase": "student_use"}, {"score": 0.0021971473452127126, "phrase": "information_technology"}], "paper_keywords": ["students", " human behavior", " information seeking"], "paper_abstract": "Young undergraduate college students are often described as digital natives, presumed to prefer living and working in completely digital information environments. In reality, their world is part-paper/part-digital, in constant transition among successive forms of digital storage and communication devices. Studying for a degree is the daily work of these young people, and effective management of paper and digital academic materials and resources contributes crucially to their success in life. Students must also constantly manage their work against deadlines to meet their course and university requirements. This study, following the Personal Information Management (PIM) paradigm, examines student academic information management under these various constraints and pressures. A total of 41 18- to 22-year-old students were interviewed and observed regarding the content, structure, and uses of their immediate working environment within their dormitory rooms. Students exhibited remarkable creativity and variety in the mixture of automated and manual resources and devices used to support their academic work. The demands of a yearlong procession of assignments, papers, projects, and examinations increase the importance of time management activities and influence much of their behavior. Results provide insights on student use of various kinds of information technology and their overall planning and management of information associated with their studies.", "paper_title": "Undergraduates' personal academic information management and the consideration of time and task-urgency", "paper_id": "WOS:000321743500006"}