{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "shape-preserving_capability"}, {"score": 0.03738598763994486, "phrase": "shape-preserving_metric"}, {"score": 0.00457696724030363, "phrase": "favorable_shape-preserving_property"}, {"score": 0.004285010985001827, "phrase": "basic_shape"}, {"score": 0.0039310261964323545, "phrase": "spline_fit"}, {"score": 0.003462704420080129, "phrase": "extra_information"}, {"score": 0.002540377258232509, "phrase": "observed_strong_shape-preserving_capability"}, {"score": 0.0024392031587145728, "phrase": "function-value-based_spline_fits"}, {"score": 0.002226017732566121, "phrase": "quantitative_research"}, {"score": 0.002203509076886664, "phrase": "shape_preservation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["L-1 spline", " Shape preservation", " Approximation", " Spline fit", " Univariate"], "paper_abstract": "Cubic L-1 spline fits have shown some favorable shape-preserving property for geometric data. To quantify the shape-preserving capability, we consider the basic shape of two parallel line segments in a given window. When one line segment is sufficiently longer than the other, the spline fit can preserve its linear shape in at least half of the window. We propose to use the minimum of such length difference as a shape-preserving metric because it represents the extra information that the spline fits need to preserve the shape. We analytically calculate this metric in a 3-node window for second-derivativebased, first-derivative-based and function-value-based spline fits. In a 5-node window, we compute this metric numerically. In both cases, the shape-preserving metric is rather small, which explains the observed strong shape-preserving capability of spline fits. Moreover, the function-value-based spline fits are indicated to preserve shape better than the other two types of spline fits. This study initiates a quantitative research on shape preservation of L-1 spline fits. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "On shape-preserving capability of cubic L-1 spline fits", "paper_id": "WOS:000367121300004"}