{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generative_model"}, {"score": 0.004555028829645471, "phrase": "computer_vision"}, {"score": 0.0041269626762569095, "phrase": "human_visual_system's_extraordinary_ability"}, {"score": 0.003738973626996355, "phrase": "general_low-level_generative_models"}, {"score": 0.003693103542455806, "phrase": "powerful_layer-based_and_hierarchical_models"}, {"score": 0.003515162360861593, "phrase": "first_step"}, {"score": 0.0033047037762521984, "phrase": "restricted_boltzmann_machines"}, {"score": 0.0031649018957020337, "phrase": "continuous-valued_data"}, {"score": 0.002867098884583832, "phrase": "image_patches"}, {"score": 0.0027457584014804574, "phrase": "patch_region"}, {"score": 0.0025812459787060097, "phrase": "larger_images"}, {"score": 0.0022811346113905295, "phrase": "deep_model"}, {"score": 0.0021049977753042253, "phrase": "object_recognition"}], "paper_keywords": [""], "paper_abstract": "Computer vision has grown tremendously in the past two decades. Despite all efforts, existing attempts at matching parts of the human visual system's extraordinary ability to understand visual scenes lack either scope or power. By combining the advantages of general low-level generative models and powerful layer-based and hierarchical models, this work aims at being a first step toward richer, more flexible models of images. After comparing various types of restricted Boltzmann machines (RBMs) able to model continuous-valued data, we introduce our basic model, the masked RBM, which explicitly models occlusion boundaries in image patches by factoring the appearance of any patch region from its shape. We then propose a generative model of larger images using a field of such RBMs. Finally, we discuss how masked RBMs could be stacked to form a deep model able to generate more complicated structures and suitable for various tasks such as segmentation or object recognition.", "paper_title": "Learning a Generative Model of Images by Factoring Appearance and Shape", "paper_id": "WOS:000287008500001"}