{"auto_keywords": [{"score": 0.042241510933875154, "phrase": "linguistic_evaluation_values"}, {"score": 0.006024527074653916, "phrase": "nuclear_safeguard_evaluations"}, {"score": 0.005873813771460861, "phrase": "overall_evaluation"}, {"score": 0.005174666088385891, "phrase": "iaea_experts"}, {"score": 0.004745665541429529, "phrase": "nuclear_safeguards_evaluation"}, {"score": 0.004624917894366759, "phrase": "weighted_linguistic_aggregation_operator"}, {"score": 0.00456020621016909, "phrase": "linguistic_aggregation_approach"}, {"score": 0.00442987501427177, "phrase": "hierarchical_analysis"}, {"score": 0.004381962669035583, "phrase": "state's_nuclear_activities"}, {"score": 0.004287680323820891, "phrase": "iaea_physical_model"}, {"score": 0.004135010810625326, "phrase": "weight_information"}, {"score": 0.0037766095501754952, "phrase": "different_uncertain_evaluations"}, {"score": 0.0037087324991876727, "phrase": "complete_information"}, {"score": 0.003681923235979914, "phrase": "conflict_information"}, {"score": 0.003350480663660326, "phrase": "belief_degrees"}, {"score": 0.0030157628075954588, "phrase": "linguistic_evaluation_value"}, {"score": 0.002814759530655965, "phrase": "existed_approaches"}, {"score": 0.00260810691979637, "phrase": "belief_degree"}, {"score": 0.0025518930446603335, "phrase": "cumulative_belief_degree"}, {"score": 0.0024788167298469455, "phrase": "aggregation_process"}, {"score": 0.0024342079318127423, "phrase": "aggregated_results"}, {"score": 0.0022884433286785165, "phrase": "existed_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Nuclear safeguards evaluation", " Hierarchical structure", " Decision making", " Linguistic aggregation operator", " 2-Tuple fuzzy linguistic representation"], "paper_abstract": "The paper treats and handles nuclear safeguard evaluations by using a linguistic aggregation approach. The overall evaluation is based on a hierarchical analysis of a state's nuclear activities on the basis of the IAEA physical model. In this framework, we analyse three kinds of weight information, i.e., belief degrees of linguistic evaluation values, weights of IAEA experts about indicators and strengths of indicators, where, different belief degrees of linguistic evaluation values correspond with different uncertain evaluations due to lack of complete information or conflict information. To aggregate these linguistic evaluation values, we propose a weighted linguistic aggregation operator, and discuss it's properties. Based on the weighted linguistic aggregation operator, we firstly use belief degrees of linguistic evaluation values and weights of IAEA experts to aggregate linguistic evaluation values of every indicator, then, we use strengths of indicators to aggregate linguistic evaluation values of indicators, and obtain linguistic evaluation value of every sub-factor, finally, we combine linguistic evaluation values of sub-factors to make the overall evaluation. Compared with existed approaches, we arrange linguistic evaluation values according to their belief degrees, and aggregated results of indicators are vectors of linguistic evaluation values in order of belief degree, this is different with cumulative belief degree of linguistic evaluation values, moreover, in the aggregation process, we analyse the aggregated results of \"no information\" and \"conflict information\". We compare our method with some existed methods for nuclear safeguard evaluations in an example, which supports and clarifies the method of this paper. (C) 2011 Published by Elsevier B.V.", "paper_title": "A linguistic aggregation operator with three kinds of weights for nuclear safeguards evaluation", "paper_id": "WOS:000301168700003"}