{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "alert_system"}, {"score": 0.007171280376842929, "phrase": "contraindicated_medication"}, {"score": 0.00645057838525242, "phrase": "inappropriate_prescriptions"}, {"score": 0.0055351292030019995, "phrase": "patient's_renal_function"}, {"score": 0.004866417954393878, "phrase": "renal_dysfunction"}, {"score": 0.004761779859548054, "phrase": "patients'_clinical_condition"}, {"score": 0.004667541072056214, "phrase": "careful_indication"}, {"score": 0.004575158759070043, "phrase": "numerous_cases"}, {"score": 0.004562855540538582, "phrase": "alert_message"}, {"score": 0.00446471538346719, "phrase": "clinical_decision_support_system"}, {"score": 0.004395819307169095, "phrase": "computerized_physician_order_entry"}, {"score": 0.004376329928635881, "phrase": "cpoe"}, {"score": 0.004195418010131832, "phrase": "renal_function"}, {"score": 0.004021954624114115, "phrase": "target_problems"}, {"score": 0.003995226376780718, "phrase": "raw_data"}, {"score": 0.003838531755488468, "phrase": "cpoe_system"}, {"score": 0.0036797696306714372, "phrase": "order_entry_system"}, {"score": 0.0035988560001022924, "phrase": "creatinine_clearance"}, {"score": 0.0035118972210075633, "phrase": "estimate_equation"}, {"score": 0.003496313116873589, "phrase": "cockcroft"}, {"score": 0.0034807976670686628, "phrase": "gault"}, {"score": 0.003449972561293443, "phrase": "patient_data"}, {"score": 0.0034118234596993836, "phrase": "impaired_renal_function"}, {"score": 0.0030799988391729464, "phrase": "liver_diseases"}, {"score": 0.0030663252799604914, "phrase": "renal_diseases"}, {"score": 0.003052712238207245, "phrase": "diabetes_mellitus"}, {"score": 0.0029789104204803137, "phrase": "knowledge_base"}, {"score": 0.002952516738708181, "phrase": "patient's_data"}, {"score": 0.002881130228859848, "phrase": "problem_database"}, {"score": 0.0028366012006726896, "phrase": "prescription_check_master"}, {"score": 0.0027434793341391097, "phrase": "prescribed_medication"}, {"score": 0.0026652435674846095, "phrase": "alert_message_database"}, {"score": 0.00264750749413377, "phrase": "alert-presenting_module"}, {"score": 0.002629889135655667, "phrase": "web_system"}, {"score": 0.00260657976055413, "phrase": "patients'_id"}, {"score": 0.0021049977753042253, "phrase": "patient's_clinical_condition"}], "paper_keywords": ["Clinical decision support systems", " contraindications", " renal insufficiency", " liver diseases", " diabetes mellitus"], "paper_abstract": "Objectives: Because information of contraindication and careful indication of medication is vast, there have been numerous cases of prescribing medication inappropriately. Our goal is to have a clinical decision support system (CDSS) combined with a computerized physician order entry (CPOE) to aid physicians in prescribing medication appropriately. In this study we developed an alert system for evaluating renal function and checking doses of medication according to the patient's renal function. In addition, we developed functions of extracting target problems from the raw data and verifying if contraindicated medication has being prescribed. Methods: This system scrutinizes data handled in the CPOE system. It picks up the data needed to ascertain problems and the data of medication entered from the order entry system. First we made an alert system for renal dysfunction. Creatinine clearance (Ccr) of a patient was calculated by the estimate equation of Cockcroft and Gault. If a patient data fulfills the condition of impaired renal function, the alert message is sent to the database. The alert system also checks the dosage of each medication according to a patient's renal function. When the dosage is over-prescribed, an alert is sent. Next, we made an alert system targeting contraindication for liver diseases, renal diseases and diabetes mellitus. The criteria of these problems were set in the knowledge base. if a patient's data meets the criteria, that fact is stored in the problem database. The system also keeps a prescription check master and checks whether the patient has a problem which is a contraindication of the prescribed medication. If a problem exists, an alert is sent to the alert message database. The alert-presenting module is a web system. After accepting patients' ID indicated by a user, the system searches the alerts concerning the patients from the database and constructs pages presenting the alert message. Results: We compared the period during which the contraindicated medication was prescribed before and after the alert system was put into operation. Of the patients with renal dysfunction who were prescribed the contraindicated medication, 24% had their medication discontinued before the alert system was put into operation. In contrast, the rate significantly increased to 54% after the alert system began to function. Conclusion: We developed an alert system for inappropriate prescriptions for each patient's clinical condition. The alerts generated by this system were effective for discontinuing contraindicated medication.", "paper_title": "Alert System for Inappropriate Prescriptions Relating to Patients' Clinical Condition", "paper_id": "WOS:000273461900010"}