{"auto_keywords": [{"score": 0.04865678212430773, "phrase": "intelligent_environments"}, {"score": 0.00481495049065317, "phrase": "frequent_user-environment_interactions"}, {"score": 0.004425072111844721, "phrase": "user's_needs"}, {"score": 0.0038749521906474593, "phrase": "current_computing_systems"}, {"score": 0.0035181731203867456, "phrase": "information_or_programming_any_device"}, {"score": 0.003352256019007896, "phrase": "automated_learning"}, {"score": 0.0032920678776655783, "phrase": "user's_most_common_behaviors"}, {"score": 0.003080449000295983, "phrase": "highly_personalized_services"}, {"score": 0.0027630232270330402, "phrase": "starting_point"}, {"score": 0.0026970382454914437, "phrase": "frequent_relationships"}, {"score": 0.0021049977753042253, "phrase": "natural_way"}], "paper_keywords": ["Ambient intelligence", " Intelligent environments", " Pattern learning", " Machine learning techniques"], "paper_abstract": "Intelligent Environments are expected to act proactively, anticipating the user's needs and preferences. To do that, the environment must somehow obtain knowledge of those need and preferences, but unlike current computing systems, in Intelligent Environments, the user ideally should be released from the burden of providing information or programming any device as much as possible. Therefore, automated learning of a user's most common behaviors becomes an important step towards allowing an environment to provide highly personalized services. In this article, we present a system that takes information collected by sensors as a starting point and then discovers frequent relationships between actions carried out by the user. The algorithm developed to discover such patterns is supported by a language to represent those patterns and a system of interaction that provides the user the option to fine tune their preferences in a natural way, just by speaking to the system.", "paper_title": "Discovering frequent user-environment interactions in intelligent environments", "paper_id": "WOS:000299516400009"}