{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "modularity_intensity"}, {"score": 0.026500153091896635, "phrase": "link_weights"}, {"score": 0.015616052025887832, "phrase": "community_partition"}, {"score": 0.006347162751714628, "phrase": "weight-topology_correlation"}, {"score": 0.0060168664682058145, "phrase": "community_evolution"}, {"score": 0.005479441876451937, "phrase": "fuzzy_relation"}, {"score": 0.0045946617913925755, "phrase": "network_topology"}, {"score": 0.0043697607816770775, "phrase": "community_formation"}, {"score": 0.004340614094598847, "phrase": "complex_networks"}, {"score": 0.0042543303585113965, "phrase": "function-modularity_intensity"}, {"score": 0.0041837333868790134, "phrase": "modularity_density"}, {"score": 0.0037087324991876727, "phrase": "resolution_limits_problem"}, {"score": 0.003647156095687574, "phrase": "better_performance"}, {"score": 0.0034223147241452547, "phrase": "simple_model"}, {"score": 0.002780381587615479, "phrase": "evolutionary_step"}, {"score": 0.0027525658515943985, "phrase": "simulation_experiments"}, {"score": 0.002600105134993952, "phrase": "gradual_transition"}, {"score": 0.002497585679098234, "phrase": "granovetter"}, {"score": 0.0024808951705681636, "phrase": "strong_links"}, {"score": 0.0024396547357855777, "phrase": "tight_communities"}, {"score": 0.0021622381640810442, "phrase": "new_view"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Community", " Modularity intensity", " Evolution"], "paper_abstract": "Most previous studies of community partition have often focused on the network topology, the topology and link weights are in fact closely associated with each other for community formation in complex networks. This paper proposes a function-modularity intensity, a variation of modularity density (D-value) for evaluating the cohesiveness of a community, which considers links between vertices as well as link weights. The results showed that maximizing the modularity intensity not only can resolve the resolution limits problem, but also achieve better performance for community partition. To further evaluate the function and clarify the weight-topology correlation with communities, we give a simple model to simulate the topology and link weights development for community evolution, and use the modularity intensity to capture communities of networks in each step of this process. In this model, a network is treated as a fuzzy relation, and two operations of the fuzzy relation are used to make the link weights stronger and weaker respectively with the growth of the network in each evolutionary step. By simulation experiments, we found that in the model the modularity intensity catches communities of networks that undergo a gradual transition from faintness to clearness. Our model also reproduces the finding of Granovetter that strong links are confined mainly in tight communities and the links between communities are predominantly weak. From the results above, we believe that the modularity intensity gives a more comprehensive evaluation for communities, and by studying the weight-topology correlation, this model provides a new view for community evolution. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Maximizing modularity intensity for community partition and evolution", "paper_id": "WOS:000318747800006"}