{"auto_keywords": [{"score": 0.04347900416933489, "phrase": "information_journey"}, {"score": 0.010612387000973441, "phrase": "marketing_professionals"}, {"score": 0.004754447398742591, "phrase": "work_task-driven_information"}, {"score": 0.004635701867952543, "phrase": "information_use"}, {"score": 0.004577440795549049, "phrase": "information_sharing"}, {"score": 0.004539005582217309, "phrase": "marketing_professionals'_work_activities"}, {"score": 0.004333283735537634, "phrase": "large_amounts"}, {"score": 0.004296889776409743, "phrase": "quality_information"}, {"score": 0.004050514095922329, "phrase": "task-driven_information"}, {"score": 0.003660452313567116, "phrase": "user-information_interaction"}, {"score": 0.0034944094552943, "phrase": "diary_method"}, {"score": 0.003027178161479457, "phrase": "marketing_professionals'_information_journeys"}, {"score": 0.002914288956035066, "phrase": "five_stages"}, {"score": 0.0027937732927852646, "phrase": "work_task-generated_information"}, {"score": 0.00257831812581194, "phrase": "obtained_information"}, {"score": 0.0023594160789762227, "phrase": "gap-bridge_techniques"}, {"score": 0.002242758902593467, "phrase": "empirical_findings"}, {"score": 0.0022145052062614514, "phrase": "information_journey_model"}, {"score": 0.00214995338990007, "phrase": "information_systems"}, {"score": 0.0021049977753042253, "phrase": "different_stages"}], "paper_keywords": ["information seeking", " information dissemination", " information use"], "paper_abstract": "Marketing professionals' work activities are heavily reliant on access to and the use of large amounts of quality information. This study aims to examine the information journey experienced by marketing professionals, including task-driven information seeking, information judgments, information use, and information sharing, from a more contextualized and holistic viewpoint. The information journey presents a more comprehensive picture of user-information interaction than is usually offered in the literature. Using a diary method and post-diary in-depth interviews, data consisting of 1,198 diary entries relating to 101 real work tasks were collected over a period of 5 work days. The data were used to ascertain characteristics of the stages of marketing professionals' information journeys as well as the relationships between them. Five stages of the information journey, including determining the need for work task-generated information, seeking such information, judging and evaluating the information found, making sense of and using the obtained information, and sharing the obtained or assembled information, were identified. The information journey also encompassed types of gaps and gap-bridge techniques that occurred during information seeking and use. Based on the empirical findings, an information journey model was developed. The implications for information systems design solutions that enable different stages of the information journey to be linked together are also discussed.", "paper_title": "The information journey of marketing professionals: Incorporating work task-driven information seeking, information judgments, information use, and information sharing", "paper_id": "WOS:000340479500008"}