{"auto_keywords": [{"score": 0.028632624519806166, "phrase": "local_experts"}, {"score": 0.028477557044858173, "phrase": "adfl"}, {"score": 0.015084015460884665, "phrase": "learning_system"}, {"score": 0.014197195383164244, "phrase": "local_decision_maker"}, {"score": 0.00481495049065317, "phrase": "multiple_experts'_decisions"}, {"score": 0.0044789647691204654, "phrase": "active_fusion"}, {"score": 0.004417079972725732, "phrase": "decision_maker"}, {"score": 0.004236487143672267, "phrase": "probability_distribution"}, {"score": 0.004201260666621267, "phrase": "possible_decisions"}, {"score": 0.004074574278425223, "phrase": "active_sequential_selection"}, {"score": 0.004040688646993605, "phrase": "local_decision_makers"}, {"score": 0.00392975069429078, "phrase": "final_decision"}, {"score": 0.003790055020889785, "phrase": "single_sequential_decision-making_problem"}, {"score": 0.0037272595230222125, "phrase": "markov_decision_process"}, {"score": 0.0036553070575015344, "phrase": "continuous_reinforcement_learning_method"}, {"score": 0.003495998865054482, "phrase": "attended_local_decision_makers"}, {"score": 0.003371670107290574, "phrase": "final_decisions"}, {"score": 0.003279039724748895, "phrase": "wrong_final_decision"}, {"score": 0.0032427017567827235, "phrase": "correct_final_decisions"}, {"score": 0.003101320048106963, "phrase": "sequential_consultation_policy"}, {"score": 0.0028131083807134984, "phrase": "local_decision_maker's_expertise"}, {"score": 0.0026310718762875707, "phrase": "classification_tasks"}, {"score": 0.0025802410088098084, "phrase": "adaboost"}, {"score": 0.0024953323481118617, "phrase": "owa"}, {"score": 0.002481458457111403, "phrase": "borda"}, {"score": 0.0022133711375320266, "phrase": "special_cases"}, {"score": 0.002158505888557746, "phrase": "maximum_benefit"}, {"score": 0.0021405207258001118, "phrase": "informative_local_decision_makers"}, {"score": 0.0021049977753042253, "phrase": "redundant_ones"}], "paper_keywords": [""], "paper_abstract": "In this letter, we propose a learning system, active decision fusion learning (ADFL), for active fusion of decisions. Each decision maker, referred to as a local decision maker, provides its suggestion in the form of a probability distribution over all possible decisions. The goal of the system is to learn the active sequential selection of the local decision makers in order to consult with and thus learn the final decision based on the consultations. These two learning tasks are formulated as learning a single sequential decision-making problem in the form of a Markov decision process (MDP), and a continuous reinforcement learning method is employed to solve it. The states of this MDP are decisions of the attended local decision makers, and the actions are either attending to a local decision maker or declaring final decisions. The learning system is punished for each consultation and wrong final decision and rewarded for correct final decisions. This results in minimizing the consultation and decision-making costs through learning a sequential consultation policy where the most informative local decision makers are consulted and the least informative, misleading, and redundant ones are left unattended. An important property of this policy is that it acts locally. This means that the system handles any nonuniformity in the local decision maker's expertise over the state space. This property has been exploited in the design of local experts. ADFL is tested on a set of classification tasks, where it outperforms two well-known classification methods, Adaboost and bagging, as well as three benchmark fusion algorithms: OWA, Borda count, and majority voting. In addition, the effect of local experts design strategy on the performance of ADFL is studied, and some guidelines for the design of local experts are provided. Moreover, evaluating ADFL in some special cases proves that it is able to derive the maximum benefit from the informative local decision makers and to minimize attending to redundant ones.", "paper_title": "Learning Active Fusion of Multiple Experts' Decisions: An Attention-Based Approach", "paper_id": "WOS:000286133600008"}