{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "design_process"}, {"score": 0.0065364513297798, "phrase": "autonomous_cognitive_system"}, {"score": 0.0043080553835735825, "phrase": "anticipatory_and_future-oriented_representational_content"}, {"score": 0.003968335788430238, "phrase": "essential_characteristics"}, {"score": 0.0038953958723049287, "phrase": "cognitive_systems"}, {"score": 0.0037139103792217143, "phrase": "enhanced_second-order_cybernetic_framework"}, {"score": 0.0036337356161112357, "phrase": "second-order_cybernetics"}, {"score": 0.003597625122515975, "phrase": "analytic_description"}, {"score": 0.003494220378760389, "phrase": "respective_implications"}, {"score": 0.0032355864829403413, "phrase": "cognitive_system"}, {"score": 0.0031676593724896075, "phrase": "second-order_cybernetic_framework"}, {"score": 0.003027997655358647, "phrase": "interactive_aspects"}, {"score": 0.0030039966201398966, "phrase": "self-organising_system"}, {"score": 0.002902164861082173, "phrase": "complex_design_process"}, {"score": 0.002818692837561076, "phrase": "fundamental_characteristics"}, {"score": 0.002744888626958772, "phrase": "useful_insights"}, {"score": 0.0027303606813078255, "phrase": "multiple_levels"}, {"score": 0.0026307897899760383, "phrase": "creative_fostering"}, {"score": 0.002561892963059385, "phrase": "design_capabilities"}, {"score": 0.0025214217930287003, "phrase": "innovative_aspect"}, {"score": 0.002255431275670053, "phrase": "interesting_implications"}, {"score": 0.0021049977753042253, "phrase": "participating_autonomous_systems"}], "paper_keywords": ["autonomy", " second-order cybernetics", " design process", " functionality", " closure", " representational content", " anticipation", " interaction", " cybernetics", " design"], "paper_abstract": "Purpose - This paper aims to develop the role of autonomy in the emergence of the design process. It shows how the design process is facilitated by autonomy, how autonomy is enhanced through the design process and how the emergence of anticipatory and future-oriented representational content in an autonomous cognitive system provides the functionality needed for the strengthening of both its autonomy and the design process, in which the autonomous cognitive system purposefully engages. Design/methodology/approach - Initially, the essential characteristics of the design process and of the cognitive systems participating in it will be identified. Then, an attempt to demonstrate the ability of an enhanced second-order cybernetic framework to satisfy these characteristics will be made. Next, an analytic description of the design process under this framework is presented and the respective implications are critically discussed. Findings - The role of autonomy is crucial for the design process, as it seems that autonomy is both the primary motive and the goal for a cognitive system to engage in a design process. A second-order cybernetic framework is suitable for the analysis of such a complex process, as long as both the constructive and the interactive aspects of a self-organising system are taken under consideration. Practical implications - The modelling of the complex design process under the framework of second-order cybernetics and the indication of the fundamental characteristics of an autonomous cognitive system as well as their interrelations may provide useful insights in multiple levels, from the purely theoretical (i.e. better understanding of the design process and the conditions for each creative fostering), to the purely technical (i.e. the design of artificial agents with design capabilities). Originality/value - The innovative aspect of the paper is that it attempts an analysis of the design process under a framework of second-order cybernetics, by attempting to analyse and explain the emergence of such a process from the point of view of an autonomous cognitive system. This results in some interesting implications regarding the nature of the design process, as well as regarding its \"mechanisms\" of emergence and evolution, with respect to the characteristics of the participating autonomous systems.", "paper_title": "Cybernetic embodiment and the role of autonomy in the design process", "paper_id": "WOS:000251883500004"}