{"auto_keywords": [{"score": 0.047093024821969934, "phrase": "oss_answerers'_motivations"}, {"score": 0.044583027124499, "phrase": "yahoo"}, {"score": 0.020857154390173, "phrase": "oss-related_questions"}, {"score": 0.01051233590017578, "phrase": "open_source_software"}, {"score": 0.009228249596836165, "phrase": "general_public's_information"}, {"score": 0.009162863659061502, "phrase": "oss."}, {"score": 0.007560950942396115, "phrase": "general_public"}, {"score": 0.00481495049065317, "phrase": "general_public's_awareness"}, {"score": 0.0047241071553733825, "phrase": "purpose_-_the_purpose"}, {"score": 0.0045475151616672805, "phrase": "oss"}, {"score": 0.004095021635819183, "phrase": "online_survey"}, {"score": 0.00405618051382474, "phrase": "oss_answerers"}, {"score": 0.003524116316149333, "phrase": "data_analysis"}, {"score": 0.0034739312899532363, "phrase": "study"}, {"score": 0.0032265482459640344, "phrase": "general_description"}, {"score": 0.0029610860976385218, "phrase": "seven_motivations"}, {"score": 0.002939972945005856, "phrase": "i.e._altruism"}, {"score": 0.0028030036990021523, "phrase": "smallest_mean_value"}, {"score": 0.0026470150945693974, "phrase": "significantly_influence_contribution_continuance_intention"}, {"score": 0.0025722984748295704, "phrase": "oss_communities"}, {"score": 0.0024003038945183907, "phrase": "community_leaders"}, {"score": 0.002120127378874655, "phrase": "oss_community_leaders"}], "paper_keywords": ["Open source software", " Motivations", " Open content", " Social Q&A"], "paper_abstract": "Purpose - The purpose of this paper is to examine the general public's information needs concerning open source software (OSS) and OSS answerers' motivations for sharing their knowledge of OSS in social Q&A. Design/methodology/approach - Two studies were carried out. In Study 1, a content analysis classifying OSS-related questions posted during December 2005-December 2012 in Yahoo! Answers was employed to investigate the general public's information needs regarding OSS. In Study 2, an online survey was conducted with OSS answerers in Yahoo! Answers in order to examine what motivates them to share and continue to share their knowledge of OSS in social Q&A. In total, 1,463 invitations were sent out via Yahoo! Answers' internal e-mail function to those who provided answers to OSS-related questions during September 2009-September 2012. In total, 150 usable surveys were returned and used for data analysis. Findings - The findings from Study 1 indicate that the general public is most interested in finding out if there is OSS that meets their software need in a certain category (51.4 percent). Other popular question categories include the general description of OSS (15.6 percent), technical issues that they have with OSS (9.8 percent), and the advantages/disadvantages of using OSS (7.0 percent). Results on OSS answerers' motivations from Study 2 support that all seven motivations identified (i.e. altruism, enjoyment, ideology, learning, reputation, reciprocity, and self-efficacy) are important, with the smallest mean value being 4.42 out of seven (i.e. reciprocity). However, only altruism, ideology, self-efficacy, and enjoyment were found to significantly influence contribution continuance intention. Practical implications - With social Q&A growing in popularity, OSS communities that look for ways to draw in more users from the general public are recommended to increase their presence in social Q&A. The findings with regard to OSS answerers' motivations can also help OSS community leaders attract and guide more members who are interested in sharing their OSS knowledge in social Q&A. Originality/value - By classifying OSS-related questions that are publicly available in Yahoo! Answers, this study offers a breakdown of the general public's information needs regarding OSS. In addition, results on OSS answerers' motivations suggest that in order to sustain their member contributions in social Q&A, OSS community leaders should pay more attention to nurturing the motivations that are intrinsic (i.e. altruism, self-efficacy, enjoyment) and integrated (i.e. ideology).", "paper_title": "Raising the general public's awareness and adoption of open source software through social Q&A interactions", "paper_id": "WOS:000350588600008"}