{"auto_keywords": [{"score": 0.048552394862534626, "phrase": "davidon_class"}, {"score": 0.009738563817735985, "phrase": "dennis_class"}, {"score": 0.004488505301335364, "phrase": "secant_updates"}, {"score": 0.004072573194988867, "phrase": "parametric_form"}, {"score": 0.003921393143378986, "phrase": "maximality_property"}, {"score": 0.003775803846431323, "phrase": "natural_derivation"}, {"score": 0.0037150687722055727, "phrase": "broyden-fletcher-goldfarb-shanno_update"}, {"score": 0.0035771136641194316, "phrase": "fletcher"}, {"score": 0.003519561814102764, "phrase": "davidon-fletcher-powell_inverse_update"}, {"score": 0.0024896081630179194, "phrase": "maximal_class"}, {"score": 0.002246292543825748, "phrase": "extension_process"}, {"score": 0.0021627595586364724, "phrase": "important_part"}, {"score": 0.0021049977753042253, "phrase": "update_classes"}], "paper_keywords": ["Newton's method", " secant methods", " quasi-Newton methods", " BFGS method", " Davidon class", " Dennis class", " symmetric rank-2 updates"], "paper_abstract": "We first catalogue several classes of secant updates including the Dennis class, the Davidon class, and the class of all symmetric rank-2 updates. Reflection on the parametric form of this class leads to a maximality property of the Davidon class and to a natural derivation of the Broyden-Fletcher-Goldfarb-Shanno update, analogous to that presented by Fletcher for the Davidon-Fletcher-Powell inverse update. Next, we propose a symmetric rank-1 extension process for classes of updates that allows us to introduce a degree of commonness to the material presented. An application of the symmetric rank-1 extension process to the class of rank-1 secant updates produces the Dennis class, an application to the Dennis class produces the Davidon class, and an application to the Davidon class leaves the Davidon class fixed implying that it is a maximal class. The maximality of the Davidon class, the definition of the symmetric rank-1 extension process, and the demonstration that this extension process can be used to unify an important part of the literature on update classes are the contributions of the paper.", "paper_title": "Generation of classes of symmetric rank-2 secant updates and the maximality of the Davidon class", "paper_id": "WOS:000305295400017"}