{"auto_keywords": [{"score": 0.04979718216987578, "phrase": "neural_networks"}, {"score": 0.049378038061471535, "phrase": "bilbao"}, {"score": 0.00481495049065317, "phrase": "air_pollution"}, {"score": 0.004620093797504386, "phrase": "hourly_levels"}, {"score": 0.004525629293824217, "phrase": "five_pollutants"}, {"score": 0.0039509464162209565, "phrase": "historical_records"}, {"score": 0.003459191419478298, "phrase": "final_identification"}, {"score": 0.003428665921276366, "phrase": "best_model"}, {"score": 0.003299460925313939, "phrase": "best_values"}, {"score": 0.0031009188628557957, "phrase": "hourly_cases"}, {"score": 0.0030374213037172803, "phrase": "data_predictions"}, {"score": 0.0030195184114140063, "phrase": "possible_range"}, {"score": 0.0027961342030212353, "phrase": "different_types"}, {"score": 0.00266693888510356, "phrase": "bilbao's_air_pollution_network"}, {"score": 0.0026355812883224203, "phrase": "diagnosis_purposes"}, {"score": 0.0025436978068459565, "phrase": "different_sensors"}, {"score": 0.0024915819531646645, "phrase": "maximum_value"}, {"score": 0.0023694065215394593, "phrase": "minimum_value"}, {"score": 0.002181069180139225, "phrase": "maximum_forecasting_capability"}, {"score": 0.0021682027434117095, "phrase": "bilbao's_network"}, {"score": 0.002142696637011647, "phrase": "real-life_operating_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["neural networks", " fluid mechanics", " air pollution forecasting", " air quality network", " traffic network", " Bilbao", " photochemistry"], "paper_abstract": "This work focuses on the prediction of hourly levels up to 8 h ahead for five pollutants (SO2, CO, NO2, NO and O-3) and six locations in the area of Bilbao (Spain). To that end, 216 models based on neural networks (NNs) were built. The database used to fit the NNs were historical records of the traffic, meteorological and air pollution networks existing in the area corresponding to year 2000. Then, the models were tested on data from the same networks but corresponding to year 2001. At a first stage, for each of the 216 cases, 100 models based on different types of neural networks were built using data corresponding to year 2000. The final identification of the best model was made under the criteria of simultaneously having at a 95% confidence level the best values of R-2, d(1), FA2 and RMSE when applied to data of year 2001. The number of hourly cases in which due to gaps in data predictions were possible range from 11% to 38% depending on the sensor. Depending on the pollutant, location and number of hours ahead the prediction is made, different types of models were selected. The use of these models based on NNs can provide Bilbao's air pollution network originally designed for diagnosis purposes, with short-term, real time forecasting capabilities. The performance of these models at the different sensors in the area range from a maximum value of R-2 = 0.88 for the prediction of NO, 1 h ahead, to a minimum value of R-2 = 0.15 for the prediction of ozone 8 h ahead. These boundaries and the limitation in the number of cases that predictions are possible represent the maximum forecasting capability that Bilbao's network can provide in real-life operating conditions. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "From diagnosis to prognosis for forecasting air pollution using neural networks: Air pollution monitoring in Bilbao", "paper_id": "WOS:000253118500009"}