{"auto_keywords": [{"score": 0.0413333189031113, "phrase": "collaborating_agents"}, {"score": 0.00481495049065317, "phrase": "agent_collaboration"}, {"score": 0.004765788394931875, "phrase": "improved_communication"}, {"score": 0.004668957916795845, "phrase": "contextual_reasoning"}, {"score": 0.004458189822972851, "phrase": "context-driven_agent_representation_paradigm"}, {"score": 0.004367581653370531, "phrase": "collaborative_tactical_behaviors"}, {"score": 0.004278807087784626, "phrase": "team_games"}, {"score": 0.004235095881928715, "phrase": "military_missions"}, {"score": 0.003724810609448597, "phrase": "ccxbr"}, {"score": 0.003574830654211291, "phrase": "joint_intention_theory"}, {"score": 0.003275807170434343, "phrase": "contextual_framework"}, {"score": 0.003048370487544551, "phrase": "active_contexts"}, {"score": 0.002708399936381754, "phrase": "ccxbr_agent"}, {"score": 0.0025202582748972122, "phrase": "common_goal"}, {"score": 0.002393907896783117, "phrase": "ccxbr_approach"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "This paper describes an extension to a context-driven agent representation paradigm that facilitates modeling collaborative tactical behaviors for simulations of team games or military missions. Called collaborative context-based reasoning, it emphasizes communication among the collaborating agents and carries it out by exchanging their currently active context when feasible. CCxBR is founded on the concepts defined in joint intention theory (JIT). The research described here presents an architecture that incorporates JIT in a contextual framework. The ability to facilitate communication among the collaborating agents by exchanging information about active contexts resembles the ability of humans to agree on a tactic in midstream and predict the behavior of their collaborators. This allows a CCxBR agent to invoke the actions involved in the tactic in the pursuit of a common goal. The paper describes several prototypes built to evaluate the CCxBR approach and the experiments executed to determine its effectiveness. The results of the experiments and the conclusions reached are discussed. (C) 2010 Wiley Periodicals, Inc.", "paper_title": "Effective Agent Collaboration through Improved Communication by Means of Contextual Reasoning", "paper_id": "WOS:000286034700003"}