{"auto_keywords": [{"score": 0.04928275842421276, "phrase": "content_management"}, {"score": 0.02816365002013277, "phrase": "semantic_gaps"}, {"score": 0.015719716506582538, "phrase": "content_abstraction"}, {"score": 0.013706924906195881, "phrase": "human_beings"}, {"score": 0.004502433187097914, "phrase": "well_organizations"}, {"score": 0.00426344619171077, "phrase": "knowledge_container"}, {"score": 0.003953256858638655, "phrase": "effective_content_management_call"}, {"score": 0.003838791650587681, "phrase": "knowledge_management"}, {"score": 0.0038066979615349822, "phrase": "content_management_activities"}, {"score": 0.003759057920801288, "phrase": "oil_meta-content"}, {"score": 0.003696460568091852, "phrase": "content_feature"}, {"score": 0.003456287408801543, "phrase": "content_creator"}, {"score": 0.003398714712611042, "phrase": "logical_combinations"}, {"score": 0.00330025288273863, "phrase": "semantic_formats"}, {"score": 0.0031248767378106663, "phrase": "semantic_approach"}, {"score": 0.002766415324343602, "phrase": "semantic-based_content_abstraction"}, {"score": 0.0026975346834867313, "phrase": "semantic_pattern"}, {"score": 0.0024904974828343033, "phrase": "content_call"}, {"score": 0.002309000874224222, "phrase": "existing_content_management_systems"}, {"score": 0.0022514836269627186, "phrase": "right_content"}, {"score": 0.0022232633360792222, "phrase": "right_user"}, {"score": 0.0021953959824690316, "phrase": "right_time"}, {"score": 0.0021049977753042253, "phrase": "content_author"}], "paper_keywords": ["Content managernent", " Semantic web", " Semantic pattern", " Content abstraction", " Content annotation"], "paper_abstract": "In recent years, knowledge becomes the most important asset of individuals as well organizations, and determines the competitiveness of all enterprise. Content is a knowledge container that implies what human beings transform their knowledge ill when they want to communicate with other people. Therefore, effective content management call achieve the goal and value of knowledge management. Content management activities are depending oil meta-content which represents the content feature and are generated through the procedures of content abstraction and annotation. In general, the content creator utilizes words and logical combinations to express his intentions and concepts in semantic formats that are comprehensible to human beings. Accordingly, managing content from a semantic approach can effectively improve transparency and visibility of the content, and guides both the content creator and the user to engage in seamless, semantic-based communications and interactions. This study proposes a semantic-based content abstraction and annotation approach and a semantic pattern for bridging the semantic gaps of content management. Based on this approach, a semantic-driven content management environment that features a high interoperability of content call be constructed to accomplish the following goals and benefits: (1) effectively bridging semantic gaps ill the existing content management systems (2) delivering the right content to the right user at the right time; (3) bridging the semantic gaps for the content author and the customer to increase the efficiency of content management; and (4) realizing the acquisition, analysis, access, management. diffusion, interpretation, and innovation of knowledge. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A semantic-based approach to content abstraction and annotation for content management", "paper_id": "WOS:000262178000136"}