{"auto_keywords": [{"score": 0.004692980391580608, "phrase": "silico_methods"}, {"score": 0.004574085781766281, "phrase": "antigenic_peptides"}, {"score": 0.004504193207111593, "phrase": "mhc_class"}, {"score": 0.004390060342250211, "phrase": "increasingly_important_role"}, {"score": 0.004278807087784626, "phrase": "t-cell_epitopes"}, {"score": 0.004235095881928715, "phrase": "statistical_and_machine_learning_methods"}, {"score": 0.004064653055162238, "phrase": "candidate_binders"}, {"score": 0.003961613484271729, "phrase": "known_binders"}, {"score": 0.003782655283668953, "phrase": "mhc_molecules"}, {"score": 0.003611751858608048, "phrase": "statistical_methods"}, {"score": 0.0035565113234273926, "phrase": "building_models"}, {"score": 0.003378385493203297, "phrase": "recent_work"}, {"score": 0.0030017207229983385, "phrase": "support_vector_machine_algorithm"}, {"score": 0.002910545717767559, "phrase": "peptidemhc-i_binding_models"}, {"score": 0.002793260314529583, "phrase": "binding_information"}, {"score": 0.0026261108615242557, "phrase": "user-defined_measure"}, {"score": 0.0023211517663846346, "phrase": "key_residues"}], "paper_keywords": [""], "paper_abstract": "Motivation: In silico methods for the prediction of antigenic peptides binding to MHC class I molecules play an increasingly important role in the identification of T-cell epitopes. Statistical and machine learning methods in particular are widely used to score candidate binders based on their similarity with known binders and non-binders. The genes coding for the MHC molecules, however, are highly polymorphic, and statistical methods have difficulties building models for alleles with few known binders. In this context, recent work has demonstrated the utility of leveraging information across alleles to improve the performance of the prediction. Results: We design a support vector machine algorithm that is able to learn peptideMHC-I binding models for many alleles simultaneously, by sharing binding information across alleles. The sharing of information is controlled by a user-defined measure of similarity between alleles. We show that this similarity can be defined in terms of supertypes, or more directly by comparing key residues known to play a role in the peptideMHC binding. We illustrate the potential of this approach on various benchmark experiments where it outperforms other state-of-the-art methods.", "paper_title": "Efficient peptideMHC-I binding prediction for alleles with few known binders", "paper_id": "WOS:000252903700008"}