{"auto_keywords": [{"score": 0.03736008398055479, "phrase": "cell's_intra-cell_flow_path"}, {"score": 0.034296462589383216, "phrase": "proposed_layout_procedure"}, {"score": 0.010345267560803532, "phrase": "cellular_manufacturing_system"}, {"score": 0.009803006066001124, "phrase": "traditional_approaches"}, {"score": 0.008363198767904185, "phrase": "intra-cell_flow_distance"}, {"score": 0.006531568677442783, "phrase": "inter-cell_flow_path"}, {"score": 0.00481495049065317, "phrase": "intra-cell_flow_path_layouts"}, {"score": 0.00453531164565523, "phrase": "intra-cell_flow_path_layout_problem"}, {"score": 0.004357927940322685, "phrase": "separate_problems"}, {"score": 0.003977993693395208, "phrase": "layout_procedure"}, {"score": 0.00382232393805049, "phrase": "inter-cell_flow_distance"}, {"score": 0.0036518336555639093, "phrase": "straight-line_inter-cell_flow_path"}, {"score": 0.0034789831290103967, "phrase": "intra-cell_flow_path"}, {"score": 0.0033811403330431897, "phrase": "shop_floor"}, {"score": 0.0032954289787083713, "phrase": "intra-cell_flow_paths"}, {"score": 0.0032210609849058483, "phrase": "flow_distance"}, {"score": 0.003193606324727067, "phrase": "inter-cell_flow"}, {"score": 0.0031215289677725693, "phrase": "different_solution_procedures"}, {"score": 0.003025063194178549, "phrase": "first_phase"}, {"score": 0.002982203248352076, "phrase": "cell's_input_and_output_points"}, {"score": 0.0026680267928092167, "phrase": "previous_two_phases"}, {"score": 0.0025127604406208668, "phrase": "fourth_phase"}, {"score": 0.002477140909481497, "phrase": "accurate_the_input_points"}, {"score": 0.0021908807203548345, "phrase": "intra-cell_flow_path_layout"}, {"score": 0.0021659920594094407, "phrase": "intra-cell_and_inter-cell_flow_distance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intra-cell flow path layout", " I/O point location", " Cellular manufacturing system"], "paper_abstract": "In this paper, we study the I/O (Input/Output) point location problem and the intra-cell flow path layout problem of cells in a cellular manufacturing system. Traditional approaches have often solved these two problems as separate problems, despite they are mutually affected. As a result, the results obtained by traditional approaches may not be as desirable as expected. In this study, we propose a layout procedure that can solve these two problems concurrently, so that the sum of the inter-cell flow distance and the intra-cell flow distance can be minimized. We assume cells have been arranged along a straight-line inter-cell flow path. Furthermore, the machines' positions on each cell's intra-cell flow path have been determined, but the intra-cell flow path of each cell has not been placed on the shop floor yet. We also assume the configuration of intra-cell flow paths is serpentine. The proposed layout procedure classifies the flow distance incurred by inter-cell flow into five types and minimizes them with different solution procedures containing various linear programming models. The proposed layout procedure has four phases. At the first phase, we find each cell's input and output points on the inter-cell flow path by considering only the inter-cell flow distance. At the second phase, we find the input and outpoint points on each cell's intra-cell flow path by considering only the intra-cell flow distance. At the third phase, we use the points found in the previous two phases as references to help us correctly orient and arrange each cell's intra-cell flow path on the shop floor. Finally, at the fourth phase, we find the accurate the input points and output points on each cell's intra-cell flow path and the inter-cell flow path by simultaneously considering the inter-cell and the intra-cell flow distance. We use an example to illustrate the proposed layout procedure. The results of the example show that the proposed layout procedure can effectively find each cell's I/O point locations and intra-cell flow path layout by considering both intra-cell and inter-cell flow distance at the same time. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A concurrent solution for intra-cell flow path layouts and I/O point locations of cells in a cellular manufacturing system", "paper_id": "WOS:000289395500018"}