{"auto_keywords": [{"score": 0.03581216971673249, "phrase": "primal_optimization_problem"}, {"score": 0.019118213147679353, "phrase": "svdd"}, {"score": 0.015133295961820678, "phrase": "optimal_solution"}, {"score": 0.013837968666375933, "phrase": "sphere_radius"}, {"score": 0.010612387000973441, "phrase": "support_vector_data_description"}, {"score": 0.008566911745256905, "phrase": "convex_programming_problem"}, {"score": 0.008172261858162697, "phrase": "svdd_solution"}, {"score": 0.004213519983188569, "phrase": "unique_solution"}, {"score": 0.0039841418890102925, "phrase": "primal_optimization"}, {"score": 0.0036553070575015344, "phrase": "analogous_way"}, {"score": 0.0036239558713305575, "phrase": "svm."}, {"score": 0.003486123304074186, "phrase": "theoretical_analysis"}, {"score": 0.0033680032592969633, "phrase": "svdd."}, {"score": 0.0030501665085457606, "phrase": "sphere_center"}, {"score": 0.0029722900280316216, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.0026004229197334875, "phrase": "svdd_dual_form"}, {"score": 0.0025230952890994236, "phrase": "geometric_interpretation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Kernel methods", " Support vector data description", " Convex optimization", " Uniqueness"], "paper_abstract": "As we may know well, uniqueness of the Support Vector Machines (SVM) solution has been solved. However, whether Support Vector Data Description (SVDD), another best-known machine learning method, has a unique solution or not still remains unsolved. Due to the fact that the primal optimization of SVDD is not a convex programming problem, it is difficult for us to theoretically analyze the SVDD solution in an analogous way to SVM. In this paper, we concentrate on the theoretical analysis for the solution to the primal optimization problem of SVDD. We first reformulate equivalently the primal optimization problem of SVDD into a convex programming problem, and then prove that the optimal solution with respect to the sphere center is unique, derive the necessary and sufficient conditions of non-uniqueness of the optimal solution with respect to the sphere radius in the primal optimization problem of SVDD. Moreover, we also explore the property of the SVDD solution from the perspective of the SVDD dual form. Furthermore, according to the geometric interpretation of SVDD, a method of computing the sphere radius is proposed when the optimal solution with respect to the sphere radius in the primal optimization problem is non-unique. Finally, we have several examples to illustrate these findings. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Theoretical analysis for solution of support vector data description", "paper_id": "WOS:000288824400005"}