{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "internet-based_education"}, {"score": 0.013727122295839058, "phrase": "face-to-face_education"}, {"score": 0.004658426838467567, "phrase": "growing_need"}, {"score": 0.004614643339546038, "phrase": "patient_education"}, {"score": 0.004299064805926241, "phrase": "ambulatory_orthopaedic_surgery"}, {"score": 0.004278807087784626, "phrase": "patients'_knowledge"}, {"score": 0.0040049806975968145, "phrase": "internet-based_patient_education"}, {"score": 0.0036958398682001015, "phrase": "patients'_level"}, {"score": 0.003459191419478298, "phrase": "demographic_variables"}, {"score": 0.0030446120560494155, "phrase": "empirical_data"}, {"score": 0.0027437235598539904, "phrase": "experiment_group"}, {"score": 0.0025922974876210194, "phrase": "control_group"}, {"score": 0.002507845411496512, "phrase": "patients'_sufficiency"}, {"score": 0.0023694065215394593, "phrase": "patients'_age"}, {"score": 0.0023249757987087055, "phrase": "earlier_ambulatory_surgeries"}, {"score": 0.002125020720324262, "phrase": "viable_method"}, {"score": 0.0021049977753042253, "phrase": "ambulatory_care"}], "paper_keywords": ["Patient education", " Internet", " outcome assessment"], "paper_abstract": "Background: There is a growing need for patient education and an evaluation of its outcomes. Objectives:The aim of this study was to compare ambulatory orthopaedic surgery patients' knowledge with Internet-based education and face-to-face education with a nurse. The following hypothesis was proposed: Internet-based patient education (experiment) is as effective as face-to-face education with a nurse (control) in increasing patients' level of knowledge and sufficiency of knowledge. In addition, the correlations of demographic variables were tested. Methods: The patients were randomized to either an experiment group (n = 72) or a control group (n = 75). Empirical data were collected with two instruments. Results: Patients in both groups showed improvement in their knowledge during their, care. Patients in the experiment group improved their knowledge level significantly more in total than those patients in the control group. There were no differences in patients' sufficiency of knowledge between the groups. Knowledge was correlated especially with patients' age, gender and earlier ambulatory surgeries. Conclusions:As a conclusion, positive results; concerning patients' knowledge could be achieved with the Internet-based education. The Internet is a viable method in ambulatory care.", "paper_title": "Ambulatory Orthopaedic Surgery Patients' Knowledge with Internet-based Education", "paper_id": "WOS:000307487600003"}