{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bayes_code"}, {"score": 0.04204790475185293, "phrase": "codeword_lengths"}, {"score": 0.016658356092635603, "phrase": "overflow_probability"}, {"score": 0.0044967055264893184, "phrase": "universal_lossless_variable-length_source_coding_problem"}, {"score": 0.004395409073581129, "phrase": "bayes"}, {"score": 0.0038772110657592854, "phrase": "asymptotic_normality"}, {"score": 0.0036207206487324506, "phrase": "asymptotic_shape"}, {"score": 0.003193606324727067, "phrase": "iterated_logarithm"}, {"score": 0.002982203248352076, "phrase": "asymptotic_end_points"}, {"score": 0.0025127604406208668, "phrase": "upper_and_lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "necessary_and_sufficient_condition"}], "paper_keywords": ["asymptotic normality", " Bayes code", " law of the iterated logarithm", " overflow probability", " universal source coding"], "paper_abstract": "This paper considers universal lossless variable-length source coding problem and investigates the Bayes code from viewpoints of the distribution of its codeword lengths. First, we show that the codeword lengths of the Bayes code satisfy the asymptotic normality. This study can be seen as the investigation on the asymptotic shape of the distribution of codeword lengths. Second, we show that the codeword lengths of the Bayes code satisfy the law of the iterated logarithm. This study can be seen as the investigation on the asymptotic end points of the distribution of codeword lengths. Moreover, the overflow probability, which represents the bottom of the distribution of codeword lengths, is studied for the Bayes code. We derive upper and lower bounds of the infimum of a threshold on the overflow probability under the condition that the overflow probability does not exceed epsilon is an element of(0, 1). We also analyze the necessary and sufficient condition on a threshold for the overflow probability of the Bayes code to approach zero asymptotically.", "paper_title": "Evaluation of the Bayes Code from Viewpoints of the Distribution of Its Codeword Lengths", "paper_id": "WOS:000367096000006"}