{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_library_buildings"}, {"score": 0.043697809978335764, "phrase": "public_libraries"}, {"score": 0.03751951230806167, "phrase": "library_buildings"}, {"score": 0.033833183214614, "phrase": "non-book_space"}, {"score": 0.0046650615456476155, "phrase": "new_public_libraries"}, {"score": 0.00459186790405058, "phrase": "idea_stores"}, {"score": 0.0045557008859819234, "phrase": "tower_hamlets"}, {"score": 0.004293336465549723, "phrase": "non-book_materials"}, {"score": 0.0035931556794840027, "phrase": "secondary_data"}, {"score": 0.0034949740315415043, "phrase": "floor_plans"}, {"score": 0.00344007531836105, "phrase": "stock_statistics"}, {"score": 0.003153140905312787, "phrase": "new_trend"}, {"score": 0.003042752533935891, "phrase": "significant_role"}, {"score": 0.0029949359231919307, "phrase": "floor_space"}, {"score": 0.002947868524740683, "phrase": "new_libraries"}, {"score": 0.002901538668877986, "phrase": "increased_addition"}, {"score": 0.002456816881853114, "phrase": "alternative_method"}, {"score": 0.0023801608396295374, "phrase": "future_research"}, {"score": 0.0021987994275190314, "phrase": "library_profession"}, {"score": 0.002155656133617155, "phrase": "future_library_buildings"}, {"score": 0.0021049977753042253, "phrase": "different_way"}], "paper_keywords": ["Public libraries", " Library buildings", " Perception", " Collections management"], "paper_abstract": "Purpose - With the development of new public libraries such as the Idea Stores in Tower Hamlets and Discovery Centres in Hampshire, it has been debated whether the inclusion of non-book materials and activities illustrates the death of public libraries by the marginalisation of books. This paper aims to investigate these assumptions by examining the use of space in public library buildings for book and non-book purposes over time. Design/methodology/approach - The methodology involves a survey of secondary data on library buildings and the comparison of floor plans, observations and stock statistics of libraries in the two authorities over time. Findings - This study concludes that the inclusion of non-book space is not a new trend in library buildings and that books still have a significant role in terms of floor space and stock in new libraries even with the increased addition of non-book space, illustrating less dramatic changes than suggested by some commentators. These trends in fact indicate a diversification of public libraries and their buildings not their imminent death. Research limitations/implications - Although this research was only able to study a few examples of libraries, this alternative method of investigating space could be repeated in future research. Originality/value - The study of use of space in libraries is important as it has implications for the library profession and the design of future library buildings. This methodology provides a different way of studying the issues of space.", "paper_title": "Death or diversification? The use of space in public library buildings", "paper_id": "WOS:000273504900006"}