{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ivf_treatment"}, {"score": 0.010508301165555982, "phrase": "ranking_algorithm"}, {"score": 0.004274767599413424, "phrase": "ivf"}, {"score": 0.003948613642680196, "phrase": "infertile_couples"}, {"score": 0.0038838500580958744, "phrase": "stressful_and_costly_process"}, {"score": 0.0036714667610391535, "phrase": "initial_evaluation"}, {"score": 0.0036352070472201086, "phrase": "low_pregnancy_rate"}, {"score": 0.002931569771634119, "phrase": "new_technique"}, {"score": 0.0027346529452880585, "phrase": "ranking-based_algorithm"}, {"score": 0.002707620139970122, "phrase": "particular_ranking_algorithm"}, {"score": 0.0026281103468378856, "phrase": "new_algorithm"}, {"score": 0.0024353398669404334, "phrase": "bayes_classifier"}, {"score": 0.0024192592458651204, "phrase": "random_forest"}, {"score": 0.0023249757987087055, "phrase": "roc_curve"}, {"score": 0.0022641658133181115, "phrase": "tenfold_stratified_cross-validation"}, {"score": 0.0022122603123901114, "phrase": "proposed_sera_algorithm"}, {"score": 0.0021049977753042253, "phrase": "medical_treatment"}], "paper_keywords": ["Estimation of success", " Ranking", " Classification", " In vitro fertilization", " Clinical decision support system"], "paper_abstract": "In medicine, estimating the chance of success for treatment is important in deciding whether to begin the treatment or not. This paper focuses on the domain of in vitro fertilization (IVF), where estimating the outcome of a treatment is very crucial in the decision to proceed with treatment for both the clinicians and the infertile couples. IVF treatment is a stressful and costly process. It is very stressful for couples who want to have a baby. If an initial evaluation indicates a low pregnancy rate, decision of the couple may change not to start the IVF treatment. The aim of this study is twofold, firstly, to develop a technique that can be used to estimate the chance of success for a couple who wants to have a baby and secondly, to determine the attributes and their particular values affecting the outcome in IVF treatment. We propose a new technique, called success estimation using a ranking algorithm (SERA), for estimating the success of a treatment using a ranking-based algorithm. The particular ranking algorithm used here is RIMARC. The performance of the new algorithm is compared with two well-known algorithms that assign class probabilities to query instances. The algorithms used in the comparison are Na < ve Bayes Classifier and Random Forest. The comparison is done in terms of area under the ROC curve, accuracy and execution time, using tenfold stratified cross-validation. The results indicate that the proposed SERA algorithm has a potential to be used successfully to estimate the probability of success in medical treatment.", "paper_title": "Estimating the chance of success in IVF treatment using a ranking algorithm", "paper_id": "WOS:000361491900013"}