{"auto_keywords": [{"score": 0.03250938140687976, "phrase": "essential_trigeminal_neuralgia"}, {"score": 0.015719716506582538, "phrase": "multicriterion_problem"}, {"score": 0.015516063929909176, "phrase": "pareto_dominance_relationship"}, {"score": 0.009945579009317992, "phrase": "treatment_methods"}, {"score": 0.00439041997682389, "phrase": "multiobjective_optimization_problem"}, {"score": 0.004020813632357377, "phrase": "multiobjective_problem"}, {"score": 0.0038989120088094185, "phrase": "conventional_pareto_dominance"}, {"score": 0.0036499505265403377, "phrase": "medical_domain_problem"}, {"score": 0.0036179751816682454, "phrase": "trigeminal_neuralgia"}, {"score": 0.002981026404927824, "phrase": "five_different_treatment_methods"}, {"score": 0.0028276174348291923, "phrase": "multiple_criteria_procedure"}, {"score": 0.002802825862847951, "phrase": "evolutionary_algorithms"}, {"score": 0.002646880721119838, "phrase": "evaluation_criteria"}, {"score": 0.0024451427672857458, "phrase": "weighted_sum_method"}, {"score": 0.002381365139274329, "phrase": "domain_expert_input"}, {"score": 0.0023090525096074264, "phrase": "new_proposed_technique"}, {"score": 0.002238930800075706, "phrase": "ally_additional_information"}, {"score": 0.0021049977753042253, "phrase": "weighted_sum_approach"}], "paper_keywords": [""], "paper_abstract": "The most common way to deal with a multiobjective optimization problem is to apply Pareto dominance relationship between solutions. The question is: how can we make a decision for a multiobjective problem if we cannot use the conventional Pareto dominance for ranking solutions? We will exemplify this by considering a multicriterion problem for a medical domain problem. Trigeminal Neuralgia (TN) is a pain that is described as among the most acute known to mankind. TN produces excruciating, lightning strikes of facial pain, typically near the nose, lips, eyes or ears. Essential trigeminal neuralgia has questioned treatment methods. We consider five different treatment methods of the essential trigeminal neuralgia for evaluation under several criteria. We give a multiple criteria procedure using evolutionary algorithms for ranking the treatment methods of the essential trigeminal neuralgia for the set of all evaluation criteria. Results obtained by our approach using a very simple method are the same as the results obtained by applying weighted sum method (which requires lots of domain expert input). The advantage of the new proposed technique is that it does not require ally additional information about the problem (like weights for each criteria in the case of weighted sum approach).", "paper_title": "How to solve a multicriterion problem for which Pareto dominance relationship cannot be applied? A case study from medicine", "paper_id": "WOS:000242123100142"}