{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "domain-specific_technical_documents"}, {"score": 0.004450568197899267, "phrase": "information_retrieval"}, {"score": 0.004321118442104989, "phrase": "long_or_multi-topic_documents"}, {"score": 0.004195418010131832, "phrase": "satisfactory_results"}, {"score": 0.00376488621224566, "phrase": "independent_document"}, {"score": 0.0036373553416391823, "phrase": "novel_passage"}, {"score": 0.003445591238183763, "phrase": "domain_knowledge"}, {"score": 0.0033452741392850523, "phrase": "base_domain_ontology"}, {"score": 0.002943147037670826, "phrase": "concept-based_ir_system"}, {"score": 0.0027605398374811667, "phrase": "ontopassage"}, {"score": 0.002551231163230566, "phrase": "proposed_ontopassage_approach"}, {"score": 0.0025137856138000036, "phrase": "domain-specific_technical_reports"}, {"score": 0.0024525907271610125, "phrase": "conventional_passage"}, {"score": 0.002357755095722877, "phrase": "ontopassage_approach"}, {"score": 0.0022113879114507577, "phrase": "concept-based_ir"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information retrieval", " Passage retrieval", " Ontology", " Reference collection", " Knowledge management"], "paper_abstract": "Technical documents, which often have complicated structures, are often produced during Architecture/Engineering/Construction (A/E/C) projects and research. Applying information retrieval (IR) techniques directly to long or multi-topic documents often does not lead to satisfactory results. One way to address the problem is to partition each document into several \"passages\", and treat each passage as an independent document. In this research, a novel passage partitioning approach is designed. It generates passages according to domain knowledge, which is represented by base domain ontology. Such a passage is herein defined as an OntoPassage. In order to demonstrate the advantage of the OntoPassage partitioning approach, this research implements a concept-based IR system to illustrate the application of such an approach. The research also compares the OntoPassage partitioning approach with several conventional passage partitioning approaches to verify its IR effectiveness. It is shown that, with the proposed OntoPassage approach, IR effectiveness on domain-specific technical reports is as good as conventional passage partitioning approaches. In addition, the OntoPassage approach provides the possibility to display the concepts in each passage, and concept-based IR may thus be implemented. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A concept-based information retrieval approach for engineering domain-specific technical documents", "paper_id": "WOS:000308122400015"}