{"auto_keywords": [{"score": 0.004768196060187511, "phrase": "multicast_communication"}, {"score": 0.004570759604335229, "phrase": "current_protocols"}, {"score": 0.004497008230182996, "phrase": "tree_communication_model"}, {"score": 0.004241178291414502, "phrase": "large_set"}, {"score": 0.004145649381700967, "phrase": "scalability_problems"}, {"score": 0.004105367230078949, "phrase": "multicast_source"}, {"score": 0.0038092152998069786, "phrase": "reverse_multicast_communication_system"}, {"score": 0.003699210979926274, "phrase": "intermediate_multicast_routers"}, {"score": 0.0033878306639271963, "phrase": "single_message"}, {"score": 0.0032053233533168362, "phrase": "size_growth"}, {"score": 0.0031741489723036255, "phrase": "aggregated_message"}, {"score": 0.003082427650896418, "phrase": "extra_requirements"}, {"score": 0.0030227528484104756, "phrase": "root_traffic"}, {"score": 0.0028228178454284825, "phrase": "n_leaves"}, {"score": 0.002670667021775741, "phrase": "moderate_values"}, {"score": 0.002610419798339639, "phrase": "new_protocol"}, {"score": 0.0025102759256260703, "phrase": "previous_literature"}, {"score": 0.0022249936992104822, "phrase": "upper_bound"}, {"score": 0.0021676977432828373, "phrase": "least_probable_bit"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["multicast", " many-to-one communication", " communications security"], "paper_abstract": "In multicast communication, a source transmits the same content to a set of receivers. Current protocols for multicast follow a tree communication model which makes them scalable. This allows the set of receivers to be arbitrarily large. A large set of receivers (leaves) poses scalability problems when the multicast source (root) needs to collect data from the receivers. The literature on this subject is rather scarce. For a reverse multicast communication system to be scalable, it is necessary that intermediate multicast routers in the tree collect messages from their child nodes, aggregate them and send them back to their parent node. In this way, the root finally obtains a single message containing all data. Scalability also requires that aggregation of messages does not result in a size growth of the aggregated message. We focus on this problem with the extra requirements that leaf-to-root traffic should stay confidential and authentic. The few existing solutions satisfying all these requirements are such that, for a tree with n leaves, messages have an O(n) constant length. Therefore, such proposals are only practical for moderate values of n. We propose here a new protocol offering confidentiality, integrity and authentication that is more efficient than previous literature when communication is biased, i.e., when the probabilities of sending '1' or '0' are clearly different. Messages have an O(k log k log n) constant length, where k is an upper bound on the number of leaves transmitting the least probable bit in a certain time slot. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Scalability and security in biased many-to-one communication", "paper_id": "WOS:000241715500001"}