{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multidimensional_olap_data_cubes"}, {"score": 0.004739056045644449, "phrase": "probabilistic_relational_data"}, {"score": 0.004590820632326585, "phrase": "novel_database_application_scenarios"}, {"score": 0.0044826811976193485, "phrase": "data_sets"}, {"score": 0.004273951631010383, "phrase": "uncertain_and_imprecise_formats"}, {"score": 0.004010624853427534, "phrase": "novel_decomposition_framework"}, {"score": 0.0028944757265206332, "phrase": "so-called_probabilistic_olap_data_cubes"}, {"score": 0.00252812242767189, "phrase": "innovative_probability_distribution_function"}, {"score": 0.0023532890136269986, "phrase": "well-known_probabilistic_estimators_theory"}, {"score": 0.0022614266476954467, "phrase": "probabilistic_olap_data_cubes"}, {"score": 0.0021731423856364003, "phrase": "comprehensive_experimental_assessment"}, {"score": 0.0021049977753042253, "phrase": "synthetic_probabilistic_databases"}], "paper_keywords": [""], "paper_abstract": "Focusing on novel database application scenarios, where data sets arise more and more in uncertain and imprecise formats, in this paper we propose a novel decomposition framework for efficiently computing and querying multidimensional OLAP data cubes over probabilistic data, which well-capture previous kind of data. Several models and algorithms supported in our proposed framework are formally presented and described in details, based on well-understood theoretical statistical/probabilistic tools, which converge to the definition of the so-called probabilistic OLAP data cubes, the most prominent result of our research. Finally, we complete our analytical contribution by introducing an innovative Probability Distribution Function (PDF)-based approach, which makes use of well-known probabilistic estimators theory, for efficiently querying probabilistic OLAP data cubes, along with a comprehensive experimental assessment and analysis over synthetic probabilistic databases.", "paper_title": "A Decomposition Framework for Computing and Querying Multidimensional OLAP Data Cubes over Probabilistic Relational Data", "paper_id": "WOS:000336408000005"}