{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "allelic_penetrance_models"}, {"score": 0.049643973872019624, "phrase": "complex_binary_traits"}, {"score": 0.03917991336907943, "phrase": "recessive_allele"}, {"score": 0.004642292792558686, "phrase": "intricate_network"}, {"score": 0.004600100053651545, "phrase": "genetic_and_environmental_factors"}, {"score": 0.004085115444878828, "phrase": "genetic_interpretation"}, {"score": 0.00393852508392789, "phrase": "allelic_penetrance_approach"}, {"score": 0.0036776458116294986, "phrase": "single_locus"}, {"score": 0.0032955848190195343, "phrase": "recessive_alleles"}, {"score": 0.003091262582401731, "phrase": "previous_work"}, {"score": 0.0028210902750714075, "phrase": "dominant_allele"}, {"score": 0.0025627194819793347, "phrase": "bayesian_methods"}, {"score": 0.002234031373581961, "phrase": "immunoglobulin_deficiencies"}, {"score": 0.0021537217025910356, "phrase": "two-locus_action"}, {"score": 0.0021049977753042253, "phrase": "listeria_infection_susceptibility"}], "paper_keywords": [""], "paper_abstract": "Complex binary traits result from an intricate network of genetic and environmental factors. To aid their genetic dissection, several generalized linear models have been described to detect interaction between genes. However, it is recognized that these models have limited genetic interpretation. To overcome this problem, the allelic penetrance approach was proposed to model the action of a dominant or a recessive allele at a single locus, and to describe two-locus independent, inhibition, and cumulative actions. Classically, a recessive inheritance requires the expression of both recessive alleles in homozygotes to obtain the phenotype (type I recessiveness). In previous work, recessiveness was defined alternatively as a situation where a recessive allele is able to express the phenotype when the dominant allele is not active (type 11 recessiveness). Both definitions of recessiveness are then discussed under the allelic penetrance models. Bayesian methods are applied to analyze two data sets: one regarding the effect of the haplotype [HLA-B8, SC01, DR3] on the inheritance of IgD and IgG4 immunoglobulin deficiencies in humans, and other related to two-locus action in the control of Listeria infection susceptibility in mice. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Bayesian analysis of allelic penetrance models for complex binary traits", "paper_id": "WOS:000263626700042"}