{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "beam_sensors"}, {"score": 0.04745804949919058, "phrase": "rotating_sensors"}, {"score": 0.014742210853040554, "phrase": "detection_sectors"}, {"score": 0.009804308137850022, "phrase": "sensor_networks"}, {"score": 0.00481495049065317, "phrase": "optimal_sensor_networks_for_area_monitoring_using_rotating"}, {"score": 0.004591202593942391, "phrase": "euclidean_plane"}, {"score": 0.004102639724186862, "phrase": "full_knowledge"}, {"score": 0.004049709080817396, "phrase": "sensor_network"}, {"score": 0.0038781372962808894, "phrase": "finite_amount"}, {"score": 0.0037623642073222547, "phrase": "optimal_network"}, {"score": 0.003465189575252443, "phrase": "minimum_number"}, {"score": 0.0031502008922533894, "phrase": "detection_sector"}, {"score": 0.0028267701593809877, "phrase": "detection_time"}, {"score": 0.0023767561522363367, "phrase": "infinite_plane"}, {"score": 0.0022758994740331258, "phrase": "finite_regions"}, {"score": 0.0021049977753042253, "phrase": "infinite_plane_case"}], "paper_keywords": ["Sensor network", " Area monitoring", " Intruder detection", " Rotating sensors", " Beam sensors"], "paper_abstract": "We consider the problem of monitoring the Euclidean plane using rotating sensors with detection sectors and beam sensors. We assume that intruders can appear anywhere at any time and move arbitrarily fast, and may have full knowledge of the sensor network. We require that such intruders be detected within a finite amount of time. We give an optimal network for this problem consisting of a combination of rotating sensors of angle 0 and beam sensors that uses the minimum number of both types of sensors. We show a trade-off between the density of beam sensors needed and the angle of the detection sector of the rotating sensors. Secondly, we give a family of sensor networks using only rotating sensors for the same problem, that demonstrate a trade-off between the detection time and the density of rotating sensors used. We show that the density of rotating sensors required in this case can be significantly reduced by increasing the angle of detection sectors. Finally, we show that our results on the infinite plane can be used to derive sensor networks that monitor some finite regions using a density of sensors that is asymptotically the same, or close to that of the infinite plane case.", "paper_title": "Optimal Sensor Networks for Area Monitoring Using Rotating and Beam Sensors", "paper_id": "WOS:000334413600006"}