{"auto_keywords": [{"score": 0.0039979034033977845, "phrase": "vanderbilt"}, {"score": 0.003956790533261966, "phrase": "tersoff"}, {"score": 0.003336225354214798, "phrase": "clar_type"}, {"score": 0.0032510690712452147, "phrase": "quantum_chemical_calculations"}, {"score": 0.0028567126120064546, "phrase": "buckled_carbon_nanotubes"}, {"score": 0.0027837615811247963, "phrase": "periodically_varying_radii"}, {"score": 0.002643386043540555, "phrase": "coalescing_arrays"}, {"score": 0.002445950676329976, "phrase": "shifting_parameters"}, {"score": 0.0023467391904246834, "phrase": "large_shifting_parameter"}, {"score": 0.0022749744354271816, "phrase": "unusual_geometric_form"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Toroidal", " Helical", " Carbon nanotube", " C-60"], "paper_abstract": "Toroidal, cylindrical, and helical analogs of C-60 buckyball are theoretically constructed and analyzed. In these structures, pentagons and heptagons are separated compactly by hexagons in analogy to pentagons in C-60 and heptagons in C-168 proposed by Vanderbilt and Tersoff (1992) [2]. Specifically, all nonhexagons therein are surrounded by hexagons and hexagons are surrounded alternatively by hexagons and nonhexagons, i.e. these structures are polyhedra of Clar type with all their Clar rings nonhexagonal. Quantum chemical calculations have been carried out which show that they possess stabilities comparative to that Of C-60. And their structural features are also investigated in detail. Buckled carbon nanotubes deriving from buckytori with periodically varying radii are suggested to be candidacies for the product of coalescing arrays of C-60. The helicity of the buckyhelices as a function of their characterizing shifting parameters is studied. In the limit of large shifting parameter, the buckyhelices adopt an unusual geometric form that has not been reported in the literature yet. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Hypothetical toroidal, cylindrical, and helical analogs of C-60", "paper_id": "WOS:000271349300002"}