{"auto_keywords": [{"score": 0.047270897600543725, "phrase": "organizational_drivers"}, {"score": 0.04240525763043868, "phrase": "stakeholder_satisfaction"}, {"score": 0.004654210559456924, "phrase": "smes'_investment"}, {"score": 0.004481868017991508, "phrase": "adoption_readiness"}, {"score": 0.004124754315882517, "phrase": "great_understanding"}, {"score": 0.003927203683176278, "phrase": "quantitative_approach"}, {"score": 0.0036830211726031946, "phrase": "pilot_study"}, {"score": 0.0034279721355412285, "phrase": "structural_equation"}, {"score": 0.0033765627434550432, "phrase": "findings_-_findings"}, {"score": 0.0033385105985286154, "phrase": "mediating_relationships"}, {"score": 0.003263683763829895, "phrase": "smes'_perceptions"}, {"score": 0.0030375852871252934, "phrase": "complementary_nature"}, {"score": 0.0029694830678462787, "phrase": "strategic_alignment"}, {"score": 0.002859345731792013, "phrase": "research_limitations"}, {"score": 0.002671263324230699, "phrase": "survey_respondents"}, {"score": 0.0026511422582578027, "phrase": "practical_implications"}, {"score": 0.002543148295176345, "phrase": "business_objectives"}, {"score": 0.0024395426929046415, "phrase": "direct_impact"}, {"score": 0.002253299769886694, "phrase": "key_contribution"}], "paper_keywords": ["Small to medium-sized enterprises", " Business-to-business marketing", " Information technology", " Web sites", " Effectiveness model", " Australia"], "paper_abstract": "Purpose - The study examines SMEs' investment in B2B web sites and the relationship between organizational drivers such as adoption readiness and constraints and evaluation of investments. We investigate how these drivers influence the perception of B2B web site benefits and the effect a great understanding of issues has on stakeholder satisfaction in the investment. Design/methodology/approach - A quantitative approach is used to test the hypotheses, which are developed from the literature. Following a pilot study, a survey of 1,000 Australian SMEs with B2B web sites is used to collect the data, which is analyzed using structural equation modeling techniques. Findings - Findings reveal the mediating relationships between organizational drivers and their influence on SMEs' perceptions of benefits and stakeholder satisfaction and support the B2B web site evaluation effectiveness model. Further insights show that SMEs do not understand the complementary nature of the organizational drivers that support strategic alignment and therefore fail to realize benefits from their web sites. Research limitations - Limitations of the research are noted and discussed with regard to constructs and the views of survey respondents. Practical implications - Results suggest that SMEs consider reallocation and/or prioritization of resources and business objectives in order to improve their IT investment evaluation practices. This would have a direct impact on the level of IT benefits realized, and ultimately affect the degree of stakeholder satisfaction with B2B web site adoption. Originality/value - A key contribution is the development of a B2B web site evaluation effectiveness model that supports greater understanding of how SMEs can gain more value from their B2B web sites.", "paper_title": "Developing a B2B web site effectiveness model for SMEs", "paper_id": "WOS:000292852700006"}