{"auto_keywords": [{"score": 0.03378593783201612, "phrase": "hetesim"}, {"score": 0.023023460829023273, "phrase": "heterogeneous_networks"}, {"score": 0.019639725868936506, "phrase": "different_types"}, {"score": 0.01061238630452144, "phrase": "relevance_measure"}, {"score": 0.007487775441912663, "phrase": "heterogeneous_objects"}, {"score": 0.0047292449487169345, "phrase": "similarity_search"}, {"score": 0.0046659637258752535, "phrase": "important_function"}, {"score": 0.003595552309967789, "phrase": "relevance_search_problem"}, {"score": 0.0032132782979796895, "phrase": "novel_measure"}, {"score": 0.002820319063320601, "phrase": "uniform_framework"}, {"score": 0.0026481480455339055, "phrase": "search_path"}, {"score": 0.002543043781904587, "phrase": "node_types"}, {"score": 0.002387758958649797, "phrase": "good_properties"}, {"score": 0.00216263228969761, "phrase": "computation_characteristics"}, {"score": 0.0021049977753042253, "phrase": "corresponding_quick_computation_strategies"}], "paper_keywords": ["Heterogeneous information network", " similarity search", " pair-wise random walk", " relevance measure"], "paper_abstract": "Similarity search is an important function in many applications, which usually focuses on measuring the similarity between objects with the same type. However, in many scenarios, we need to measure the relatedness between objects with different types. With the surge of study on heterogeneous networks, the relevance measure on objects with different types becomes increasingly important. In this paper, we study the relevance search problem in heterogeneous networks, where the task is to measure the relatedness of heterogeneous objects (including objects with the same type or different types). A novel measure HeteSim is proposed, which has the following attributes: (1) a uniform measure: it can measure the relatedness of objects with the same or different types in a uniform framework; (2) a path-constrained measure: the relatedness of object pairs are defined based on the search path that connects two objects through following a sequence of node types; (3) a semi-metric measure: HeteSim has some good properties (e.g., self-maximum and symmetric), which are crucial to many data mining tasks. Moreover, we analyze the computation characteristics of HeteSim and propose the corresponding quick computation strategies. Empirical studies show that HeteSim can effectively and efficiently evaluate the relatedness of heterogeneous objects.", "paper_title": "HeteSim: A General Framework for Relevance Measure in Heterogeneous Networks", "paper_id": "WOS:000342076600011"}