{"auto_keywords": [{"score": 0.040179630763545776, "phrase": "computer-science_knowledge"}, {"score": 0.02832626361491208, "phrase": "aec"}, {"score": 0.00481495049065317, "phrase": "online_survey"}, {"score": 0.0042102651938187114, "phrase": "civil_engineering"}, {"score": 0.004136548839735555, "phrase": "construction_management_curricula"}, {"score": 0.004078502325220629, "phrase": "current_state"}, {"score": 0.004007083686875716, "phrase": "aec_curricula"}, {"score": 0.0033579708256295847, "phrase": "basic_aspects"}, {"score": 0.003334309053314909, "phrase": "computing_education"}, {"score": 0.0031732652552570644, "phrase": "useful_benchmarks"}, {"score": 0.003095674983836725, "phrase": "industry_collaboration"}, {"score": 0.0028944757265206332, "phrase": "computer_skills"}, {"score": 0.002764379205581817, "phrase": "computing_skills"}, {"score": 0.0025846562485378247, "phrase": "computer-science_concepts"}, {"score": 0.002391067964886602, "phrase": "aec_industry"}, {"score": 0.0023491282852109757, "phrase": "computing_courses"}, {"score": 0.00225144317399471, "phrase": "scientific_concepts"}, {"score": 0.0021654633404434623, "phrase": "unknown_future_developments"}, {"score": 0.0021501863832966966, "phrase": "information_technology"}, {"score": 0.0021049977753042253, "phrase": "american_society_of_civil_engineers"}], "paper_keywords": ["Architecture education", " Engineering education", " Computer application", " Information technology (IT)", " Curricula", " Computer programming", " Computer software"], "paper_abstract": "This paper includes the results of an online survey that was conducted by the American Society of Civil Engineers (ASCE) task committee on computing education to assess the evolution of computing in architecture, engineering, and construction (AEC) education in 2012. The committee aims to understand and measure the evolution of computing in civil engineering, architecture, and construction management curricula and evaluate the current state of computing within the AEC curricula. The paper contains an investigation of the levels and concentrations of computer-science knowledge versus computer skills in curricula. In addition, the committee seeks to recognize the similarities and differences between architecture, engineering, and construction management programs by comparing the data associated with these disciplines. The paper also includes a discussion of basic aspects of computing education including the prerequisites that are necessary for further learning. The survey results provide useful benchmarks for decision making regarding research, industry collaboration, and curricula. Findings of the study include: (1) the importance and coverage of computer skills and competence of graduates has increased over the past decade; (2) computing skills are judged to be more important than computer-science knowledge in AEC curricula; (3) the links between computer-science concepts and AEC applications of computing are not yet fully recognized; (4) computing education is not sufficient to meet the demands of the AEC industry and the share of computing courses is less than what educators desire; and (5) scientific concepts of computing are important for preparing architects and engineers for unknown future developments in information technology. (C) 2014 American Society of Civil Engineers.", "paper_title": "Surveying the Evolution of Computing in Architecture, Engineering, and Construction Education", "paper_id": "WOS:000359941100005"}