{"auto_keywords": [{"score": 0.04037367688510611, "phrase": "linear_model"}, {"score": 0.00481495049065317, "phrase": "keyword-based_search_engines"}, {"score": 0.004750527930368202, "phrase": "superficially_relevant_papers"}, {"score": 0.004562362497952548, "phrase": "irrelevant_information"}, {"score": 0.004059438255358923, "phrase": "factoid_qa_system"}, {"score": 0.003951453722517865, "phrase": "named_entity_recognition_module"}, {"score": 0.0038985392250620483, "phrase": "answer_candidates"}, {"score": 0.0036443694410100507, "phrase": "named_entity_types"}, {"score": 0.003611751858608048, "phrase": "semantic_roles"}, {"score": 0.003361069456060196, "phrase": "learning_algorithm"}, {"score": 0.0032863459256972896, "phrase": "small_amounts"}, {"score": 0.003256922225995089, "phrase": "training_data"}, {"score": 0.003141830113006653, "phrase": "qa_system"}, {"score": 0.002897482096228207, "phrase": "efficient_formula"}, {"score": 0.0028586409810976367, "phrase": "mean_average_reciprocal_rank"}, {"score": 0.0026600905156986317, "phrase": "effective_semantic_features"}, {"score": 0.002453116398642071, "phrase": "baseline_system"}, {"score": 0.0022419349154472806, "phrase": "test_set"}, {"score": 0.0021432488786696804, "phrase": "marr"}], "paper_keywords": [""], "paper_abstract": "Biologists rely on keyword-based search engines to retrieve superficially relevant papers, from which they must filter out the irrelevant information manually. Question answering (QA) systems can offer more efficient and user-friendly ways of retrieving such information. Two contributions are provided in this paper. First, a factoid QA system is developed to employ a named entity recognition module to extract answer candidates and a linear model to rank them. The linear model uses various semantic features, such as named entity types and semantic roles. To tune the weights of features used by the model, a novel supervised learning algorithm, which only needs small amounts of training data, is provided. Second, a QA system may assign several answers with the same score, making evaluation unfair. To solve this problem, an efficient formula for a mean average reciprocal rank (MARR) is proposed to reduce the complexity of its computation. After employing all effective semantic features, our system achieves a top-1 MARR of 74.11% and top-5 MARR of 76.68%. In comparison of the baseline system, the top-1 and top-5 MARR increase by 9.5% and 7.1%. In addition, the experiment result on test set shows our ranking method, which achieves 55.58% top-1 MARR and 66.99% top-5 MARR, significantly surpasses traditional BM25 and simple voting in performance by averagely 35.23% and 36.64%, respectively.", "paper_title": "A supervised learning approach to biological question answering", "paper_id": "WOS:000267820300008"}