{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electric_field"}, {"score": 0.022930221994575485, "phrase": "power_lines"}, {"score": 0.01681803215142224, "phrase": "electric_field_vector"}, {"score": 0.013488385843625569, "phrase": "double_complex_number"}, {"score": 0.010384261263942728, "phrase": "double_complex_numbers"}, {"score": 0.00985636950633747, "phrase": "complete_analysis"}, {"score": 0.008956658116340211, "phrase": "vector_distances"}, {"score": 0.008725735873631669, "phrase": "complex_numbers"}, {"score": 0.007203402019481263, "phrase": "direct_calculation"}, {"score": 0.004669845451682529, "phrase": "purpose_-_the_paper"}, {"score": 0.003687439449869248, "phrase": "simultaneous_representation"}, {"score": 0.0035141291835319682, "phrase": "elegant_expressions"}, {"score": 0.003408091901859624, "phrase": "mathematical_relations"}, {"score": 0.0033636292024305406, "phrase": "great_degree"}, {"score": 0.003334309053314909, "phrase": "findings_-_general_analytical_formulas"}, {"score": 0.003191485583025302, "phrase": "elliptically_rotating_electric_field"}, {"score": 0.002860546817196148, "phrase": "analytical_formulas"}, {"score": 0.00270221723573854, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "analytical_relations"}], "paper_keywords": ["Analytical calculation", " Double complex numbers", " Intensity of the electric field", " Power lines", " Electric fields", " Vectors"], "paper_abstract": "Purpose - The paper aims to highlight the efficiency of double complex numbers for the complete analysis of the intensity of the electric field produced by power lines. Design/methodology/approach - One set of complex numbers is used to represent all the plane vectors (vector distances) and another set of complex numbers is used to represent all the sinusoidal time varying quantities (electric charges and voltages). The simultaneous representation of vector distances and sinusoidal time varying quantities with complex numbers gives elegant expressions to the electric field vector and simplifies the mathematical relations to a great degree. Findings - General analytical formulas are developed for the direct calculation of all the parameters of the elliptically rotating electric field (rms value, major and minor semi-axis of the ellipse, angles of the semi-axes, tracing direction, polarization). The analytical formulas depend on the components of the double complex number. Research limitations/implications - The proposed method can be applied only on 2D problems, especially power lines where the electric field vector can be expressed as a double complex number. Originality/value - Double complex numbers are proved in this paper as a very effective mathematical tool for the complete analysis of the electric field produced by power lines. The expression of the electric field vector as a double complex number allows the direct calculation of all the parameters of the electric field with analytical relations.", "paper_title": "Analysis of the electric field produced by power lines using double complex numbers", "paper_id": "WOS:000314484400020"}