{"auto_keywords": [{"score": 0.033550893132319834, "phrase": "new_model"}, {"score": 0.00481495049065317, "phrase": "heart_failure_conditions"}, {"score": 0.004737579882204798, "phrase": "object-oriented_modeling_environment"}, {"score": 0.004712065638657606, "phrase": "dymola"}, {"score": 0.004611369021812453, "phrase": "different_physiological_systems"}, {"score": 0.004116823963855969, "phrase": "clinical_decisions"}, {"score": 0.004007083686875716, "phrase": "medical_therapies"}, {"score": 0.0038168424095396205, "phrase": "signal-flow-oriented_simulation_environment"}, {"score": 0.0035386420095120706, "phrase": "technical_description"}, {"score": 0.002944284514509205, "phrase": "healthy_subject"}, {"score": 0.0026280534600940137, "phrase": "simulation_results"}, {"score": 0.0025440911575156755, "phrase": "cardiovascular_system"}, {"score": 0.0025031188149336257, "phrase": "ventricular_assist_device"}, {"score": 0.0024495111090152857, "phrase": "heart_failure"}, {"score": 0.0022830706430588482, "phrase": "simulation_environment"}, {"score": 0.0021049977753042253, "phrase": "innovative_simulation_environment"}], "paper_keywords": ["Object-oriented modeling", " Cardiovascular system", " Respiratory system", " Thermoregulation", " Ventricular assist device"], "paper_abstract": "Several mathematical models of different physiological systems are spread through literature. They serve as tools which improve the understanding of (patho-) physiological processes, may help to meet clinical decisions and can even enhance medical therapies. These models are typically implemented in a signal-flow-oriented simulation environment and focus on the behavior of one specific subsystem. Neglecting other physiological subsystems and using a technical description of the physiology hinders the exchange with and acceptance of clinicians. By contrast, this paper presents a new model implemented in a physical, object-oriented modeling environment which includes the cardiovascular, respiratory and thermoregulatory system. Simulation results for a healthy subject at rest and at the onset of exercise are given, showing the validity of the model. Finally, simulation results showing the interaction of the cardiovascular system with a ventricular assist device in case of heart failure are presented showing the flexibility and mightiness of the model and the simulation environment. Thus, we present a new model including three important physiological systems and one medical device implemented in an innovative simulation environment.", "paper_title": "Modeling a healthy and a person with heart failure conditions using the object-oriented modeling environment Dymola", "paper_id": "WOS:000363252800012"}