{"auto_keywords": [{"score": 0.040387229066893286, "phrase": "proactive_fhcop-b"}, {"score": 0.026369545366370917, "phrase": "error-prone_wireless_links"}, {"score": 0.012913584734393952, "phrase": "nemo"}, {"score": 0.009484307390894913, "phrase": "packet_losses"}, {"score": 0.00481495049065317, "phrase": "hcop-b_reactive_fast_handover_mechanisms"}, {"score": 0.004589124394375718, "phrase": "handover_prediction_concept"}, {"score": 0.004444462552988661, "phrase": "cross-layer_architecture"}, {"score": 0.004063116219782941, "phrase": "actual_layer"}, {"score": 0.004011366422179016, "phrase": "mobile_subnet"}, {"score": 0.0039729853486821995, "phrase": "nested_mobile_network"}, {"score": 0.0036203204049740575, "phrase": "fast_movements"}, {"score": 0.0032359856233193504, "phrase": "fast_and_seamless_handovers"}, {"score": 0.003154012038613403, "phrase": "analytical_model"}, {"score": 0.0030741085942960814, "phrase": "proactive_and_reactive_fhcop-b"}, {"score": 0.002837188425640173, "phrase": "error-prone_wireless_link"}, {"score": 0.002801008719218055, "phrase": "intensive_simulations"}, {"score": 0.002370493290982407, "phrase": "nemo_literature"}, {"score": 0.0022882500116799777, "phrase": "reactive_one"}, {"score": 0.0021876814398268775, "phrase": "seamless_reactive_handover"}, {"score": 0.002166711569953301, "phrase": "nested_nemo"}, {"score": 0.0021049977753042253, "phrase": "reactive_fhcop-b"}], "paper_keywords": ["Fast and seamless handovers", " HCoP-B", " Network mobility'", " Proactive FHCoP-B", " Reactive FHCoP-B"], "paper_abstract": "Purpose In the past, by adopting the handover prediction concept of the fast mobile IPv6, the authors have proposed a cross-layer architecture, which was called the proactive fast HCoP-B (FHCoP-B), to trigger layer 3 HCoP-B route optimization flow by 802.11 and 802.16 link events before the actual layer 2 handover of a mobile subnet in the nested mobile network (NEMO) occurs. In this way, proactive FHCoP-B has shortened its handover latency and packet loss. However, there are two scenarios where proactive FHCoP-B cannot normally complete its operations due to fast movements of the NEMO during handover. The paper aims to discuss these issues. Design/methodology/approach In this paper, the authors will propose efficient reactive FHCoP-B flows for these two scenarios to support fast and seamless handovers. The authors will further extend the analytical model proposed for mobile IPv6 to investigate four performance metrics of proactive and reactive FHCoP-B, HCoP-B and two well-known NEMO schemes with the radio link protocol (RLP), which can detect packet losses and performs retransmissions over the error-prone wireless link. Findings Through intensive simulations, the authors conclude that FHCoP-B outperforms HCoP-B and the other two well-known NEMO schemes by achieving the shortest handover latencies, the smallest number of packet losses and the fewest playback interruption time during handover only with few extra buffer spaces, even over error-prone wireless links of the nested NEMO. Originality/value This paper has three major contributions, which are rare in the NEMO literature. First, the proactive FHCoP-B has been enhanced as the reactive one to handle two fast handover scenarios with RLP for the nested NEMO. Second, the reactive FHCoP-B supports seamless reactive handover for the nested NEMO over error-prone wireless links. Third, mathematical performance analyses for two scenarios of reactive FHCoP-B with RLP over error-prone wireless links have been conducted.", "paper_title": "Mathematical performance analysis for HCoP-B reactive fast handover mechanisms for the nested mobile networks", "paper_id": "WOS:000333868900002"}