{"auto_keywords": [{"score": 0.030377480155847663, "phrase": "minimum_number"}, {"score": 0.012965203607452847, "phrase": "pspace"}, {"score": 0.012269190442154774, "phrase": "bipartite_graphs"}, {"score": 0.009354580665494749, "phrase": "recolouring_steps"}, {"score": 0.00481495049065317, "phrase": "graph_colourings"}, {"score": 0.004766536335036112, "phrase": "superpolynomial_distances"}, {"score": 0.004396267325338022, "phrase": "beta_recolouring_vertices"}, {"score": 0.004243415959311671, "phrase": "proper_k-colouring"}, {"score": 0.004190118389204342, "phrase": "decision_problem"}, {"score": 0.004075198669927074, "phrase": "polynomial_time"}, {"score": 0.0035281264325950556, "phrase": "planar_graphs"}, {"score": 0.003303518376493005, "phrase": "larger_values"}, {"score": 0.002816635287470419, "phrase": "first_colouring"}, {"score": 0.002571266312964923, "phrase": "stark_contrast"}, {"score": 0.0021809902552410265, "phrase": "remarkable_correspondence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vertex-recolouring", " Colour graph", " PSPACE-complete", " Superpolynomial distance"], "paper_abstract": "Suppose we are given a graph G together with two proper vertex k-colourings of G, alpha and beta. How easily can we decide whether it is possible to transform alpha into beta recolouring vertices of G one at a time, making sure we always have a proper k-colouring of G? This decision problem is trivial for k = 2, and decidable in polynomial time for k = 3. Here we prove it is PSPACE-complete for all k >= 4. In particular, we prove that the problem remains PSPACE-complete for bipartite graphs, as well as for: (i) planar graphs and 4 <= k <= 6, and (ii) bipartite planar graphs and k = 4. Moreover, the values of kin (i) and (ii) are tight, in the sense that for larger values of k, it is always possible to recolour alpha to beta. We also exhibit, for every k >= 4, a class of graphs {G(N,k) : N is an element of N*}, together with two k-colourings for each G(N,k), such that the minimum number of recolouring steps required to transform the first colouring into the second is superpolynomial in the size of the graph: the minimum number of steps is Omega(2(N)), whereas the size of G(N) is O(N(2)). This is in stark contrast to the k = 3 case, where it is known that the minimum number of recolouring steps is at most quadratic in the number of vertices. We also show that a class of bipartite graphs can be constructed with this property, and that: (i) for 4 <= k <= 6 planar graphs and (ii) for k = 4 bipartite planar graphs can be constructed with this property. This provides a remarkable correspondence between the tractability of the problem and its underlying structure. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Finding Paths between graph colourings: PSPACE-completeness and superpolynomial distances", "paper_id": "WOS:000271555200003"}