{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mutual_understanding"}, {"score": 0.015214126264674908, "phrase": "cio"}, {"score": 0.01013127651376955, "phrase": "strategic_alignment"}, {"score": 0.0039748192550806815, "phrase": "business_performance"}, {"score": 0.002931569771634119, "phrase": "ceo's_assessment"}, {"score": 0.0028930017387859804, "phrase": "eight_strobe_dimensions"}, {"score": 0.0028360962841331634, "phrase": "cio's_assessment"}, {"score": 0.0027803070408286158, "phrase": "analogous_stroepis_dimensions"}, {"score": 0.002689746491842271, "phrase": "evaluated_is_contribution"}, {"score": 0.0025173564697303836, "phrase": "seven_alignment_dimensions"}, {"score": 0.0024842242921857705, "phrase": "six_alignment_dimensions"}], "paper_keywords": ["Mutual understanding of the role of IT", " Strategic alignment", " IT strategy", " IS contribution"], "paper_abstract": "Mutual understanding between the CEO and CIO is thought to facilitate the alignment of an organization's IS with its business strategy, and thereby enhance the contribution of the IS to business performance. A survey of 202 pairs of CEOs and CIOs was taken to investigate the relationships between them. Mutual understanding was measured as the role of IS in the organization, using the perspectives of both executives. Strategic alignment was measured as the fit between the CEO's assessment of eight STROBE dimensions and the CIO's assessment of the analogous STROEPIS dimensions: both the CEO and CIO evaluated IS contribution. Mutual understanding of the role of IT led to seven alignment dimensions whereas six alignment dimensions led to IS contributions. Our study extended the theory of IT strategic alignment and provided direction for CEOs and ClOs interested in improving the IS contribution of their organization. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "CEO/CIO mutual understanding, strategic alignment, and the contribution of IS to the organization", "paper_id": "WOS:000276771300002"}