{"auto_keywords": [{"score": 0.039018926830031914, "phrase": "problem_instance"}, {"score": 0.015719716506582538, "phrase": "ant_colony_optimization"}, {"score": 0.014063455632207983, "phrase": "blum"}, {"score": 0.013955718080446792, "phrase": "dorigo"}, {"score": 0.012483032090075126, "phrase": "aco"}, {"score": 0.009754119862259903, "phrase": "ant_system"}, {"score": 0.009679118455012096, "phrase": "max-min_ant_system"}, {"score": 0.009567685837204092, "phrase": "ant_colony_system"}, {"score": 0.004667833113864304, "phrase": "promising_metaheuristic"}, {"score": 0.004613825044585923, "phrase": "great_amount"}, {"score": 0.004336115760817672, "phrase": "hypercube_framework"}, {"score": 0.004106810349956121, "phrase": "aco_algorithms"}, {"score": 0.002998390117435555, "phrase": "aco_family"}, {"score": 0.002606906626639414, "phrase": "internal_state"}, {"score": 0.00243072375406841, "phrase": "minor_variations"}, {"score": 0.0021049977753042253, "phrase": "original_ones"}], "paper_keywords": ["ant colony optimization (ACO)", " combinatorial optimization", " pheromone invariace", " swarm intelligence", " weak and strong invariance"], "paper_abstract": "Ant colony optimization (ACO) is a promising metaheuristic and a great amount of research has been devoted to its empirical and theoretical analysis. Recently, with the introduction of the hypercube framework, Blum and Dorigo have explicitly raised the issue of the invariance of ACO algorithms to transformation of units. They state (Blum and Dorigo, 2004) that the performance of ACO depends on the scale of the problem instance under analysis. In this paper, we show that the ACO internal state-commonly referred to as the pheromone-indeed depends on the scale of the problem at hand. Nonetheless, we formally prove that this does not affect the sequence of solutions produced by the three most widely adopted algorithms belonging to the ACO family: ant system, MAX-MIN ant system, and ant colony system. For these algorithms, the sequence of solutions does not depend on the scale of the problem instance under analysis. Moreover, we introduce three new ACO algorithms, the internal state of which is independent of the scale of the problem instance considered. These algorithms are obtained as minor variations of ant system, MAX-MIN ant system, and ant colony system. We formally show that these algorithms are functionally equivalent to their original counterparts. That is, for any given instance, these algorithms produce the same sequence of solutions as the original ones.", "paper_title": "On the invariance of ant colony optimization", "paper_id": "WOS:000251376600003"}