{"auto_keywords": [{"score": 0.050071503437283324, "phrase": "nonlinear_camera_response_functions"}, {"score": 0.0318121870875069, "phrase": "psf"}, {"score": 0.004268780663872836, "phrase": "image_deblurring"}, {"score": 0.004153520149706423, "phrase": "comprehensive_study"}, {"score": 0.003682100144121148, "phrase": "spatially_invariant_blur"}, {"score": 0.0035826234811610316, "phrase": "spatially_varying_blur"}, {"score": 0.003429001377800258, "phrase": "large_errors"}, {"score": 0.00319324425647735, "phrase": "crf_correction"}, {"score": 0.0030395624703152212, "phrase": "known_point_spread_function"}, {"score": 0.002679501909303057, "phrase": "psf_estimation_algorithms"}, {"score": 0.0026070408483940535, "phrase": "blind_deconvolution"}, {"score": 0.002414408192716443, "phrase": "crf"}, {"score": 0.0022359278646792153, "phrase": "synthetic_and_real_images"}], "paper_keywords": ["Nonlinear camera response functions (CRFs)", " motion deblurring", " CRF estimation"], "paper_abstract": "This paper investigates the role that nonlinear camera response functions (CRFs) have on image deblurring. We present a comprehensive study to analyze the effects of CRFs on motion deblurring. In particular, we show how nonlinear CRFs can cause a spatially invariant blur to behave as a spatially varying blur. We prove that such nonlinearity can cause large errors around edges when directly applying deconvolution to a motion blurred image without CRF correction. These errors are inevitable even with a known point spread function (PSF) and with state-of-the-art regularization-based deconvolution algorithms. In addition, we show how CRFs can adversely affect PSF estimation algorithms in the case of blind deconvolution. To help counter these effects, we introduce two methods to estimate the CRF directly from one or more blurred images when the PSF is known or unknown. Our experimental results on synthetic and real images validate our analysis and demonstrate the robustness and accuracy of our approaches.", "paper_title": "Nonlinear Camera Response Functions and Image Deblurring: Theoretical Analysis and Practice", "paper_id": "WOS:000323175200014"}