{"auto_keywords": [{"score": 0.04954033184026155, "phrase": "routing_energy_consumption"}, {"score": 0.04900761970662832, "phrase": "mobile_sensor_networks"}, {"score": 0.019987799902920687, "phrase": "energy_consumption"}, {"score": 0.016812063909756016, "phrase": "mobility_impact"}, {"score": 0.009808336363053631, "phrase": "routing_scheme"}, {"score": 0.006953714574218716, "phrase": "traffic_condition"}, {"score": 0.00481495049065317, "phrase": "impact_of_mobility"}, {"score": 0.004550029253278477, "phrase": "frequent_route_breaks"}, {"score": 0.004348580182733617, "phrase": "route_breaks"}, {"score": 0.004203343568960231, "phrase": "performance_degradation"}, {"score": 0.003971938976270902, "phrase": "routing_schemes"}, {"score": 0.0036691380448651443, "phrase": "significantly_different_results"}, {"score": 0.003627800727103479, "phrase": "varying_network_dynamics"}, {"score": 0.002859345731792013, "phrase": "expected_energy_consumption"}, {"score": 0.0025097154697345096, "phrase": "strong_relationship"}, {"score": 0.0024814079299143536, "phrase": "sensor_mobility"}, {"score": 0.0024534188907003726, "phrase": "traffic_conditions"}, {"score": 0.0021049977753042253, "phrase": "sensor_application"}], "paper_keywords": [""], "paper_abstract": "Mobility in mobile sensor networks causes frequent route breaks, and each routing scheme reacts differently during route breaks. It results in a performance degradation of the energy consumption to reestablish the route. Since routing schemes have various operational characteristics for rerouting, the impact of mobility on routing energy consumption shows significantly different results under varying network dynamics. Therefore, we should consider the mobility impact when analyzing the routing energy consumption in mobile sensor networks. However, most analysis of the routing energy consumption concentrates on the traffic condition and often neglects the mobility impact. We analyze the mobility impact on the routing energy consumption by deriving the expected energy consumption of reactive, proactive, and flooding scheme as a function of both the packet arrival rate and topology change rate. Routing energy consumption for mobile sensor networks is analytically shown to have a strong relationship with sensor mobility and traffic conditions. We then demonstrate the accuracy of our analysis through simulations. Our analysis can be used to decide a routing scheme that will operate most energy efficiently for a sensor application, taking into account the mobility as well as traffic condition.", "paper_title": "Impact of Mobility on Routing Energy Consumption in Mobile Sensor Networks", "paper_id": "WOS:000302658700001"}