{"auto_keywords": [{"score": 0.04579236087036459, "phrase": "fuzzy_rule-based_models"}, {"score": 0.015599002431466464, "phrase": "genetic_fuzzy_rule-based_classification_systems"}, {"score": 0.014665581495259167, "phrase": "computational_time"}, {"score": 0.012325477724919915, "phrase": "higher_number"}, {"score": 0.009845992579911426, "phrase": "evolutionary_process"}, {"score": 0.00481495049065317, "phrase": "instance_selection_techniques"}, {"score": 0.0045415338200109345, "phrase": "genetic_fuzzy_systems"}, {"score": 0.004436545340717729, "phrase": "genetic_algorithms"}, {"score": 0.004024485331377682, "phrase": "fitness_evaluation"}, {"score": 0.0038106195546165574, "phrase": "resulting_model"}, {"score": 0.0032220148724914867, "phrase": "interpretable_models"}, {"score": 0.002766963729586353, "phrase": "generated_models"}, {"score": 0.002163367190715979, "phrase": "overall_training"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Instance selection", " Training set selection", " Fuzzy rule-based classifiers", " Evolutionary algorithms", " Genetic fuzzy systems", " Complexity-accuracy trade-off"], "paper_abstract": "In the framework of genetic fuzzy systems, the computational time required by genetic algorithms for generating fuzzy rule-based models from data increases considerably with the increase of the number of instances in the training set, mainly due to the fitness evaluation. Also, the amount of data typically affects the complexity of the resulting model: a higher number of instances generally induces the generation of models with a higher number of rules. Since the number of rules is considered one of the factors which affect the interpretability of the fuzzy rule-based models, large datasets generally bring to less interpretable models. Both these problems can be tackled and partially solved by reducing the number of instances before applying the evolutionary process. In the literature several algorithms of instance selection have been proposed for selecting instances without deteriorating the accuracy of the generated models. The aim of this paper is to analyze the effectiveness of 36 training set selection methods when combined with genetic fuzzy rule-based classification systems. Using 37 datasets of different sizes we show that some of these methods can considerably help to reduce the computational time of the evolutionary process and to decrease the complexity of the fuzzy rule-based models with a very limited decrease of their accuracy with respect to the models generated by using the overall training set. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A study on the application of instance selection techniques in genetic fuzzy rule-based classification systems: Accuracy-complexity trade-off", "paper_id": "WOS:000327685800004"}