{"auto_keywords": [{"score": 0.04656595045799919, "phrase": "peer-to-peer_architecture"}, {"score": 0.00481495049065317, "phrase": "scalable_live_video"}, {"score": 0.00476527679607755, "phrase": "nano_data_centers"}, {"score": 0.004540126719762935, "phrase": "network_operator"}, {"score": 0.004385819169212677, "phrase": "also_called_here_nano_data_centers"}, {"score": 0.004295752645085445, "phrase": "churn_and_resource_heterogeneity"}, {"score": 0.004236733825313407, "phrase": "uncontrolled_environments"}, {"score": 0.003912712778141845, "phrase": "self-scaling_property"}, {"score": 0.0037535816047183845, "phrase": "live_video_streaming_service"}, {"score": 0.0035884582625234297, "phrase": "branching_architecture"}, {"score": 0.0035637052288771706, "phrase": "nano_datacenters"}, {"score": 0.003113637673848439, "phrase": "optimal_trade-off_point"}, {"score": 0.0029254845664637204, "phrase": "robust_topology"}, {"score": 0.0027296938800704484, "phrase": "content_dissemination"}, {"score": 0.00258251424573557, "phrase": "flow_control"}, {"score": 0.00254697318939512, "phrase": "data_transmission"}, {"score": 0.0022955150243239623, "phrase": "small_number"}, {"score": 0.002279660253812632, "phrase": "relay_nodes"}, {"score": 0.0022560827223539934, "phrase": "significant_performance_gains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Nano data centers", " Live video streaming", " Peer-to-peer technology", " TCP tandem", " Scalability"], "paper_abstract": "To improve the efficiency and the quality of a service, a network operator may consider deploying a peer-to-peer architecture among controlled peers, also called here nano data centers, which contrast with the churn and resource heterogeneity of peers in uncontrolled environments. In this paper, we consider a prevalent peer-to-peer application: live video streaming. We demonstrate how nano data centers can take advantage of the self-scaling property of a peer-to-peer architecture, while significantly improving the quality of a live video streaming service, allowing smaller delays and fast channel switching. We introduce the branching architecture for nano datacenters (BAND), where a user can \"pull\" content from a channel of interest, or content could be \"pushed\" to it for relaying to other interested users. We prove that there exists an optimal trade-off point between minimizing the number of push, or the number of relaying nodes, and maintaining a robust topology as the number of channels and users get large, which allows scalability. We analyze the performance of content dissemination as users switch between channels, creating migration of nodes in the tree, while flow control insures continuity of data transmission. We prove that this p2p architecture guarantees a throughput independently of the size of the group. Analysis and evaluation of the model demonstrate that pushing content to a small number of relay nodes can have significant performance gains in throughput, start-up time, playback lags and channel switching delays. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A performance evaluation of scalable live video streaming with nano data centers", "paper_id": "WOS:000262771900004"}