{"auto_keywords": [{"score": 0.041741505471269987, "phrase": "salient_regions"}, {"score": 0.016126187022290888, "phrase": "saliency_information"}, {"score": 0.010612387000973441, "phrase": "singular_value_decomposition"}, {"score": 0.010545803876565674, "phrase": "saliency_detection"}, {"score": 0.009747812102538366, "phrase": "svd"}, {"score": 0.009356463569874523, "phrase": "singular_values"}, {"score": 0.0044910139920501515, "phrase": "new_approach"}, {"score": 0.0040969285074699, "phrase": "key_concept"}, {"score": 0.003944112858235306, "phrase": "important_parts"}, {"score": 0.0035864603175592854, "phrase": "large_singular_values"}, {"score": 0.0035189057079817285, "phrase": "non-salient_background"}, {"score": 0.003409120890690851, "phrase": "intermediate_singular_values"}, {"score": 0.0032922964156452696, "phrase": "small_singular_values"}, {"score": 0.0030998304961483217, "phrase": "average_information"}, {"score": 0.003051073364818384, "phrase": "leading_largest_singular_values"}, {"score": 0.0030030808225723266, "phrase": "machine_learning"}, {"score": 0.0028909473120830842, "phrase": "learning-based_methods"}, {"score": 0.0027741761880779535, "phrase": "gaussian_filters"}, {"score": 0.002696101728474703, "phrase": "experimental_results"}, {"score": 0.0026285439034014904, "phrase": "superior_performance"}, {"score": 0.002530359917257626, "phrase": "human-eye_fixations"}, {"score": 0.0024905375922547918, "phrase": "salient-object_detection"}, {"score": 0.0024204262825429095, "phrase": "receiver_operating_characteristic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Gaussian filter", " Saliency detection", " Singular value decomposition", " Human-perception mechanism", " Learning-based", " Human-eye fixations", " Salient-object detection", " Visual attention"], "paper_abstract": "Saliency detection has gained popularity in many applications, and many different approaches have been proposed. In this paper, we propose a new approach based on singular value decomposition (SVD) for saliency detection. Our algorithm considers both the human-perception mechanism and the relationship between the singular values of an image decomposed by SVD and its salient regions. The key concept of our proposed algorithms is based on the fact that salient regions are the important parts of an image. The singular values of an image are divided into three groups: large, intermediate, and small singular values. We propose the hypotheses that the large singular values mainly contain information about the non-salient background and slight information about the salient regions, while the intermediate singular values contain most or even all of the saliency information. The small singular values contain little or even none of the saliency information. These hypotheses are validated by experiments. By regularization based on the average information, regularization using the leading largest singular values or regularization based on machine learning, the salient regions will become more conspicuous. In our proposed approach, learning-based methods are proposed to improve the accuracy of detecting salient regions in images. Gaussian filters are also employed to enhance the saliency information. Experimental results prove that our methods based on SVD achieve superior performance compared to other state-of-the-art methods for human-eye fixations, as well as salient-object detection, in terms of the area under the receiver operating characteristic (ROC) curve (AUC) score, the linear correlation coefficient (CC) score, the normalized scan-path saliency (NSS) score, the F-measure score, and visual quality. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Saliency detection based on singular value decomposition", "paper_id": "WOS:000362388300008"}