{"auto_keywords": [{"score": 0.047916548037392724, "phrase": "prefrontal_cortex"}, {"score": 0.04494965530581908, "phrase": "working_memory"}, {"score": 0.014865838850983063, "phrase": "basal_ganglia"}, {"score": 0.00481495049065317, "phrase": "working_memory_work"}, {"score": 0.004191829338769843, "phrase": "information_online"}, {"score": 0.0036490529923833884, "phrase": "mechanistic_basis"}, {"score": 0.003611751858608048, "phrase": "executive_function"}, {"score": 0.00325901518290063, "phrase": "powerful_learning_mechanisms"}, {"score": 0.003192700856094016, "phrase": "computational_model"}, {"score": 0.0028807718824400697, "phrase": "subcortical_structures"}, {"score": 0.0026806884201358537, "phrase": "actor-critic_architecture"}, {"score": 0.00263965046277432, "phrase": "critic_system"}, {"score": 0.0025992391074270097, "phrase": "prefrontal_representations"}, {"score": 0.0024186620196958867, "phrase": "dynamic_gating_mechanism"}, {"score": 0.0023816257768353344, "phrase": "working_memory_updating"}, {"score": 0.0023211517663846346, "phrase": "learning_mechanism"}, {"score": 0.0022390533383717715, "phrase": "temporal_and_structural_credit_assignment_problems"}, {"score": 0.0021377414429251647, "phrase": "standard_backpropagation-based_temporal_learning_mechanisms"}], "paper_keywords": [""], "paper_abstract": "The prefrontal cortex has long been thought to subserve both working memory (the holding of information online for processing) and executive functions (deciding how to manipulate working memory and perform processing). Although many computational models of working memory have been developed, the mechanistic basis of executive function remains elusive, often amounting to a homunculus. This article presents an attempt to deconstruct this homunculus through powerful learning mechanisms that allow a computational model of the prefrontal cortex to control both itself and other brain areas in a strategic, task-appropriate manner. These learning mechanisms are based on subcortical structures in the midbrain, basal ganglia, and amygdala, which together form an actor-critic architecture. The critic system learns which prefrontal representations are task relevant and trains the actor, which in turn provides a dynamic gating mechanism for controlling working memory updating. Computationally, the learning mechanism is designed to simultaneously solve the temporal and structural credit assignment problems. The model's performance compares favorably with standard backpropagation-based temporal learning mechanisms on the challenging 1-2-AX working memory task and other benchmark working memory tasks.", "paper_title": "Making working memory work: A computational model of learning in the prefrontal cortex and basal ganglia", "paper_id": "WOS:000243193400002"}