{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_sites"}, {"score": 0.0037249853525936428, "phrase": "scoring_system"}, {"score": 0.0036005006349430586, "phrase": "pilot_test"}, {"score": 0.0035331426502479687, "phrase": "eight_volunteers"}, {"score": 0.0035065523764817143, "phrase": "ten_chocolate-related_web_sites"}, {"score": 0.0033765627434550432, "phrase": "findings_-_aspects"}, {"score": 0.00302612773666719, "phrase": "resulting_scores"}, {"score": 0.002859345731792013, "phrase": "best_web_site"}, {"score": 0.0027741761880779535, "phrase": "significant_inter-scorer_discrepancy"}, {"score": 0.0025819015229390663, "phrase": "relatively_small_number"}, {"score": 0.0024487847651989128, "phrase": "web_designers"}, {"score": 0.0023313149689465386, "phrase": "similar_products"}, {"score": 0.0022363199197710385, "phrase": "real_users"}, {"score": 0.0021049977753042253, "phrase": "possible_general_methodology"}], "paper_keywords": ["worldwide web", " function evaluation", " chocolate"], "paper_abstract": "Purpose - The purpose of this research is to report the results of research that was carried out to evaluate the effectiveness of a number of web sites selling chocolate. Design/methodology/approach - The research was founded on a series of criteria for evaluating such web sites, based upon a review of the literature. A series of criteria were developed and a scoring system associated with them was generated. Following a pilot test, a panel of eight volunteers evaluated ten chocolate-related web sites which were carefully chosen for their range of characteristics. Findings - Aspects evaluated included presentation, content, accessibility, language. navigation and structure, transaction page, security, privacy and authority. and marketing factors. The resulting scores were then analysed. Using two different methods of analysis. it was found that the best web site was www.danschocolates.com, but that there was significant inter-scorer discrepancy in some of the scores assigned. Research limitations/implications - only a small number of sites were evaluated, using a relatively small number of evaluators. Practical implications - Conclusions are drawn regarding the most important factors that web designers should take into account when developing a site for selling chocolate or similar products. Comments are also made on the need to involve real users when developing criteria for the evaluation of web sites. Originality/value - The paper provides a possible general methodology for evaluating web sites.", "paper_title": "Evaluation of web sites for B2C e-commerce", "paper_id": "WOS:000239130800005"}