{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "equality_constraints"}, {"score": 0.03001548408086769, "phrase": "rdo"}, {"score": 0.004779876533667754, "phrase": "robust_design"}, {"score": 0.004591466267316524, "phrase": "robust_design_optimization"}, {"score": 0.004459101239560164, "phrase": "significant_area"}, {"score": 0.0041445748748895365, "phrase": "product_reliability"}, {"score": 0.004025040955430234, "phrase": "resulting_solution"}, {"score": 0.003908940988435398, "phrase": "objective_function"}, {"score": 0.003754731210715724, "phrase": "inequality_constraint_and_objective_function_formulations"}, {"score": 0.003489714006817602, "phrase": "rdo_literature"}, {"score": 0.0031267359296488118, "phrase": "systematic_approach"}, {"score": 0.002895291306821514, "phrase": "critical_issues"}, {"score": 0.002832359116458113, "phrase": "rdo._equality_constraints"}, {"score": 0.0025468951021098717, "phrase": "rdo_problem"}, {"score": 0.002298544073884724, "phrase": "linearization-_based_approach"}, {"score": 0.0022158306933307685, "phrase": "respective_formulation_methods"}, {"score": 0.002191600750693037, "phrase": "theoretical_developments"}], "paper_keywords": ["robust design optimization", " equality constraints", " uncertainty"], "paper_abstract": "In recent years, robust design optimization (RDO) has emerged as a significant area of research. The focus of RDO is to obtain a design that minimizes the effects of uncertainty on product reliability and performance. The effectiveness of the resulting solution in RDO highly depends on how the objective function and the constraints are formulated to account for uncertainties. Inequality constraint and objective function formulations under uncertainty have been studied extensively in the literature. However, the approaches for formulating equality constraints in the RDO literature are in a state of disharmony. Moreover, we observe that these approaches are generally applicable only to certain special cases of equality constraints. There is a need for a systematic approach for handling equality constraints in RDO, which is the motivation for this research. In this paper, we examine critical issues pertinent to formulating equality constraints in RDO. Equality constraints in RDO can be classified as belonging to two classes: (1) those that cannot be satisfied, because of the uncertainty inherently present in the RDO problem, and (2) those that must be satisfied, regardless of the uncertainty present in the problem. In this paper, we propose a linearization- based approach to classify equality constraints into the above two classes, and propose respective formulation methods. The theoretical developments presented in this paper are illustrated with the help of two numerical examples.", "paper_title": "The challenge of equality constraints in robust design optimization: examination and new approach", "paper_id": "WOS:000249803900002"}