{"auto_keywords": [{"score": 0.04656048238443008, "phrase": "grass-roots_design"}, {"score": 0.02608804045956966, "phrase": "proposed_methodology"}, {"score": 0.00481495049065317, "phrase": "mathematical_programming"}, {"score": 0.004594443767709888, "phrase": "regeneration_recycling_water_networks"}, {"score": 0.004332894955218135, "phrase": "virtually_a_multi-objective_problem"}, {"score": 0.0040385352882334235, "phrase": "relative_importance"}, {"score": 0.0039218440805789965, "phrase": "sequential_optimization"}, {"score": 0.0037862398004482253, "phrase": "multi-objective_problem"}, {"score": 0.003138124398958758, "phrase": "regeneration_recycling_water_network"}, {"score": 0.002924694271730544, "phrase": "qualitative_analysis"}, {"score": 0.00284009509859163, "phrase": "water_network_configuration"}, {"score": 0.0023674192513753996, "phrase": "available_technologies"}, {"score": 0.0021805201234139475, "phrase": "complicated_and_variable_economic_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["water system", " regeneration recycling", " grass-roots design", " mathematical programming", " sequential optimization"], "paper_abstract": "In this paper, mathematical programming coupled with superstructure is utilized to optimize regeneration recycling water networks at the stage of grass-roots design. The optimization is virtually a multi-objective problem with several important parameters on regeneration recycling involved. Considering the relative importance of these parameters, sequential optimization is adopted to solve this multi-objective problem. Freshwater consumption, regenerated water flowrate and contaminant regeneration load, are in turn minimized, which correspond to three mathematical models. By solving these models step by step, a regeneration recycling water network can be constructed, which is economically favorable in terms of qualitative analysis. The complexity of water network configuration is also taken into account by minimizing the number of interconnections among processes. Additionally several examples are used to demonstrate the application of the proposed methodology. In comparison with the available technologies, the proposed methodology excels in simplicity and adaptability for grass-roots design by exempting from complicated and variable economic parameters. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Grass-roots design of regeneration recycling water networks", "paper_id": "WOS:000257616900017"}