{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "object_referral_lists"}, {"score": 0.0039341294012600085, "phrase": "information_extraction_system"}, {"score": 0.0037402558657576124, "phrase": "web_page"}, {"score": 0.003689053436223376, "phrase": "hierarchical_structure"}, {"score": 0.0035233696341819437, "phrase": "hierarchical_structures"}, {"score": 0.0034911335714333507, "phrase": "logical_statements"}, {"score": 0.0033190180867511605, "phrase": "findings_-_experimental_results"}, {"score": 0.00327356326590461, "phrase": "university_domain"}, {"score": 0.003140888248194296, "phrase": "course_home_pages"}, {"score": 0.0030414140732789186, "phrase": "meta-data_and_instance_extraction_averages"}, {"score": 0.002825681384008326, "phrase": "domain_specific_engineering_requirement"}, {"score": 0.0027614468443073028, "phrase": "meteor_system"}, {"score": 0.00257735013358606, "phrase": "object_instance_pages"}, {"score": 0.002405496949144104, "phrase": "previously_engineered_domain"}, {"score": 0.002329258721870127, "phrase": "link_pages"}, {"score": 0.0021049977753042253, "phrase": "high_accuracy"}], "paper_keywords": ["worldwide web", " information retrieval", " data handling"], "paper_abstract": "Purpose - The purpose of this research is to automatically separate and extract meta-data and instance information from various link pages in the web, by utilizing presentation and linkage regularities on the web. Design/methodology/approach - Research objectives have been achieved through an information extraction system called semantic partitioner that automatically organizes the content in each web page into a hierarchical structure, and an algorithm that interprets and translates these hierarchical structures into logical statements by distinguishing, and representing the meta-data and their individual data instances. Findings - Experimental results for the university domain with 12 computer science department web sites, comprising 361 individual faculty and course home pages indicate that the performance of the meta-data and instance extraction averages 85, 88 percent F-measure, respectively. Our METEOR system achieves this performance without any domain specific engineering requirement. Originality/value - Important contributions of the METEOR system presented in this paper are: it performs extraction without the assumption that the object instance pages are template-driven; it is domain independent and does not require any previously engineered domain ontology; and by interpreting the link pages, it can extract both meta-data, such as concept and attribute names and their relationships, as well as their instances with high accuracy.", "paper_title": "Gathering meta-data and instances from object referral lists on the web", "paper_id": "WOS:000239526000006"}