{"auto_keywords": [{"score": 0.029793819886233187, "phrase": "energy_harvesting"}, {"score": 0.00481495049065317, "phrase": "green_wireless_body_area_nanonetworks"}, {"score": 0.004761850836420121, "phrase": "energy_management"}, {"score": 0.004430629452265786, "phrase": "green_wireless_body_area_nanonetwork"}, {"score": 0.003319939715683536, "phrase": "energy_depletion"}, {"score": 0.0032290277960438855, "phrase": "residual_energy"}, {"score": 0.0029380909574836587, "phrase": "energy_consumption"}, {"score": 0.0022880528191813083, "phrase": "ubiquitous_healthcare_monitoring_scenario"}, {"score": 0.0022129983153880467, "phrase": "cooperative_nash_bargaining_game"}, {"score": 0.0021763973978248005, "phrase": "optimal_strategy"}, {"score": 0.0021285340816566906, "phrase": "nash_equilibrium_solution"}, {"score": 0.0021049977753042253, "phrase": "improved_network_performance"}], "paper_keywords": ["Nanonetwork", " Nash Bargaining", " ubiquitous healthcare"], "paper_abstract": "In this paper, we envisage the architecture of Green Wireless Body Area Nanonetwork (GBAN) as a collection of nanodevices, in which each device is capable of communicating in both themolecular and wireless electromagnetic communication modes. The term green refers to the fact that the nanodevices in such a network can harvest energy from their surrounding environment, so that no nanodevice gets old solely due to the reasons attributed to energy depletion. However, the residual energy of a nanodevice can deplete substantially with the lapse of time, if the rate of energy consumption is not comparable with the rate of energy harvesting. It is observed that the rate of energy harvesting is nonlinear and sporadic in nature. So, the management of energy of the nanodevices is fundamentally important. We specifically address this problem in a ubiquitous healthcare monitoring scenario and formulate it as a cooperative Nash Bargaining game. The optimal strategy obtained from the Nash equilibrium solution provides improved network performance in terms of throughput and delay.", "paper_title": "Green Wireless Body Area Nanonetworks: Energy Management and the Game of Survival", "paper_id": "WOS:000332987400009"}