{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "local_and_non-local_contextual_information"}, {"score": 0.004506968388996092, "phrase": "new_method"}, {"score": 0.004447766706144458, "phrase": "part-based_human_pose_estimation"}, {"score": 0.00424659225577246, "phrase": "authors_method"}, {"score": 0.004054479957160662, "phrase": "leaf_parts_localisations"}, {"score": 0.003794954883650141, "phrase": "previous_study"}, {"score": 0.003413705707789296, "phrase": "local_contextual_information"}, {"score": 0.003132236287543072, "phrase": "non-local_contextual_information"}, {"score": 0.003030247482854539, "phrase": "detection_accuracies"}, {"score": 0.0029706504420983896, "phrase": "leaf_parts"}, {"score": 0.0026194209399161184, "phrase": "subsequent_optimisation_procedure"}, {"score": 0.00250073564820402, "phrase": "basic_structure"}, {"score": 0.002451527111936163, "phrase": "tree-based_model"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "In this study, the authors propose a new method for part-based human pose estimation. The key idea of the authors method is to improve the accuracies for leaf parts localisations - an issue that was largely ignored by the previous study - by incorporating both local and non-local contextual information into the model. In particular, they use the local contextual information to reduce or eliminate the influences of the noises, while the non-local contextual information helps to improve the detection accuracies of the leaf parts. Since more accurate parts localisations usually mean a more reasonable active set of spatial constraints, this potentially enhances the effectiveness of the subsequent optimisation procedure. Furthermore, they keep the basic structure of the tree-based model, hence taking advantage of its conceptual simplicity and computationally efficient inference. Their experiments on two challenging real-world datasets demonstrate the feasibility and the effectiveness of the proposed method.", "paper_title": "Part-based pose estimation with local and non-local contextual information", "paper_id": "WOS:000348194100002"}