{"auto_keywords": [{"score": 0.03191059228073323, "phrase": "grlp"}, {"score": 0.008981697371230111, "phrase": "heuristic_framework"}, {"score": 0.004757227624616643, "phrase": "optical_network"}, {"score": 0.0046578649614541995, "phrase": "maximum_distance_dmax"}, {"score": 0.003922011960904278, "phrase": "generalized_regenerator_location_problem"}, {"score": 0.0038054151244558123, "phrase": "set_s"}, {"score": 0.0037371212381934853, "phrase": "candidate_locations"}, {"score": 0.003444600613447231, "phrase": "regenerator_location_problem"}, {"score": 0.0033026968242689633, "phrase": "np"}, {"score": 0.0032329595250932754, "phrase": "rlp"}, {"score": 0.0031653299069848463, "phrase": "maximum_leaf"}, {"score": 0.0031462682245392785, "phrase": "tree_problem"}, {"score": 0.0029262613892378653, "phrase": "rlp."}, {"score": 0.0028563889983942215, "phrase": "reduction_procedures"}, {"score": 0.0028050788526778957, "phrase": "local_search_procedure"}, {"score": 0.002561992219031343, "phrase": "natural_and_extended_integer_programming"}, {"score": 0.002368383667454108, "phrase": "strongest_model"}, {"score": 0.0023399219122055177, "phrase": "natural_node_selection_variables"}, {"score": 0.0023118013999542594, "phrase": "branch-_and-cut_approach"}, {"score": 0.002222717552124615, "phrase": "exact_approach"}, {"score": 0.002124176532827015, "phrase": "high-quality_approach"}, {"score": 0.0021049977753042253, "phrase": "large-scale_instances"}], "paper_keywords": ["optical network design", " extended formulations", " multicommodity flow", " branch and cut", " heuristics regenerator location"], "paper_abstract": "In an optical network a signal can only travel a maximum distance dmax before its quality deteriorates to the point that it must be regenerated by installing regenerators at nodes of the network. As the cost of a regenerator is high, we wish to deploy as few regenerators as possible in the network, while ensuring all nodes can communicate with each other. In this paper we introduce the generalized regenerator location problem (GRLP) in which we are given a set S of nodes that corresponds to candidate locations for regenerators, and a set T of nodes that must communicate with each other. If S = T = N, we obtain the regenerator location problem (RLP), which we have studied previously and shown to be NP-complete. Our solution procedure to the RLP is based on its equivalence to the maximum leaf spanning tree problem (MLSTP). Unfortunately, this equivalence does not apply to the GRLP, nor do the procedures developed previously for the RLP. To solve the GRLP, we propose reduction procedures, two construction heuristics, and a local search procedure that we collectively refer to as a heuristic framework. We also establish a correspondence between the (node-weighted) directed Steiner forest problem and the GRLP. Using this fact, we provide several ways to derive natural and extended integer programming (IP) and mixed-integer programming (MIP) models for the GRLP and compare the strength of these models. Using the strongest model derived on the natural node selection variables we develop a branch- and-cut approach to solve the problem to optimality. The results indicate that the exact approach can easily solve instances with up to 200 nodes to optimality, whereas the heuristic framework is a high-quality approach for solving large-scale instances.", "paper_title": "The Generalized Regenerator Location Problem", "paper_id": "WOS:000355224700002"}