{"auto_keywords": [{"score": 0.038317712805750005, "phrase": "water_molecules"}, {"score": 0.00481495049065317, "phrase": "calculate_water_binding_free_energies"}, {"score": 0.004768104290288521, "phrase": "protein-ligand_complexes"}, {"score": 0.004585212379675535, "phrase": "binding_pockets"}, {"score": 0.004178351419209898, "phrase": "ligand_binding"}, {"score": 0.003978866233891427, "phrase": "great_interest"}, {"score": 0.0030101325901285537, "phrase": "grand_canonical_monte_carlo"}, {"score": 0.0027026375053777543, "phrase": "enclosed_binding_sites"}, {"score": 0.002573424607574822, "phrase": "jaws_scoring_procedure"}, {"score": 0.002523481637809674, "phrase": "binding_free_energies"}, {"score": 0.002498873893632724, "phrase": "strongly_bound_water_molecules"}, {"score": 0.0024264776194357993, "phrase": "high_degree"}, {"score": 0.0023677483882740317, "phrase": "significantly_less_computational_effort"}, {"score": 0.0021999341184897217, "phrase": "rapid_scheme"}, {"score": 0.0021049977753042253, "phrase": "rational_drug_design"}], "paper_keywords": [""], "paper_abstract": "Water molecules are commonplace in protein binding pockets, where they can typically form a complex between the protein and a ligand or become displaced upon ligand binding. As a result, it is often of great interest to establish both the binding free energy and location of such molecules. Several approaches to predicting the location and affinity of water molecules to proteins have been proposed and utilized in the literature, although it is often unclear which method should be used under what circumstances. We report here a comparison between three such methodologies, Just Add Water Molecules (JAWS), Grand Canonical Monte Carlo (GCMC), and double-decoupling in the hope of understanding the advantages and limitations of each method when applied to enclosed binding sites. As a result, we have adapted the JAWS scoring procedure, allowing the binding free energies of strongly bound water molecules to be calculated to a high degree of accuracy, requiring significantly less computational effort than more rigorous approaches. The combination of JAWS and GCMC offers a route to a rapid scheme capable of both locating and scoring water molecules for rational drug design.", "paper_title": "Strategies to Calculate Water Binding Free Energies in Protein-Ligand Complexes", "paper_id": "WOS:000337937100008"}