{"auto_keywords": [{"score": 0.040214030606452976, "phrase": "phase_transition"}, {"score": 0.012283851162894285, "phrase": "giant_component"}, {"score": 0.00481495049065317, "phrase": "inhomogeneous_random_graphs"}, {"score": 0.004782366519650462, "phrase": "\"classical\"_random_graph_models"}, {"score": 0.0044683582413957675, "phrase": "typical_value"}, {"score": 0.0044080641984377954, "phrase": "real_world"}, {"score": 0.004212873921676287, "phrase": "recent_interest"}, {"score": 0.004165436366506785, "phrase": "\"inhomogeneous\"_random_graph_models"}, {"score": 0.004090640258896358, "phrase": "new_models"}, {"score": 0.003999023402642396, "phrase": "\"phase_transition"}, {"score": 0.003962951496863254, "phrase": "edge_density_parameter"}, {"score": 0.0037617394143447044, "phrase": "central_topic"}, {"score": 0.003719362723728175, "phrase": "random_graphs"}, {"score": 0.0036608332080581884, "phrase": "new_inhomogeneous_models"}, {"score": 0.003522482515043419, "phrase": "exactly_the_critical_point"}, {"score": 0.0032026066791743866, "phrase": "inhomogeneous_random_graph"}, {"score": 0.0028079361390683445, "phrase": "special_cases"}, {"score": 0.00272017744454479, "phrase": "expected_number"}, {"score": 0.0025819015229390663, "phrase": "critical_point"}, {"score": 0.002456203564035989, "phrase": "branching_processes"}, {"score": 0.002258418763901064, "phrase": "typical_random_graph"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["sparse inhomogeneous random graphs", " branching process", " phase transition"], "paper_abstract": "The \"classical\" random graph models, in particular G(n,p), are \"homogeneous,\" in the sense that the degrees (for example) tend to be concentrated around a typical value. Many graphs arising in the real world do not have this property, having, for example, power-law degree distributions. Thus there has been a lot of recent interest in defining and studying \"inhomogeneous\" random graph models. One of the most studied properties of these new models is their \"robustness\", or, equivalently, the \"phase transition\" as an edge density parameter is varied. For G(n,p), p = c/n, the phase transition at c = 1 has been a central topic in the study of random graphs for well over 40 years. Many of the new inhomogeneous models are rather complicated; although there are exceptions, in most cases precise questions such as determining exactly the critical point of the phase transition are approachable only when there is independence between the edges. Fortunately, some models studied have this property already, and others can be approximated by models with independence. Here we introduce a very general model of an inhomogeneous random graph with (conditional) independence between the edges, which scales so that the number of edges is linear in the number of vertices. This scaling corresponds to the p = c/n scaling for G(n, p) used to study the phase transition; also, it seems to be a property of many large real-world graphs. Our model includes as special cases many models previously studied. We show that, under one very weak assumption (that the expected number of edges is \"what it should be\"), many properties of the model can be determined, in particular the critical point of the phase transition, and the size of the giant component above the transition. We do this by relating our random graphs to branching processes, which are much easier to analyze. We also consider other properties of the model, showing, for example, that when there is a giant component, it is \"stable\": for a typical random graph, no matter how we add or delete o(n) edges, the size of the giant component does not change by more than o(n). (C) 2007 Wiley Periodicals, Inc.", "paper_title": "The phase transition in inhomogeneous random graphs", "paper_id": "WOS:000248254500002"}