{"auto_keywords": [{"score": 0.03950534971883884, "phrase": "proposed_bist_circuit"}, {"score": 0.01073369795572656, "phrase": "test_responses"}, {"score": 0.010063919084952444, "phrase": "tested_switches"}, {"score": 0.00481495049065317, "phrase": "power_switch"}, {"score": 0.004281284532043714, "phrase": "manufacturing_defects"}, {"score": 0.0037150687722055727, "phrase": "corresponding_charge"}, {"score": 0.0035819501337406596, "phrase": "test_clock"}, {"score": 0.003495855671790616, "phrase": "test_patterns"}, {"score": 0.00342568771304873, "phrase": "test_vectors"}, {"score": 0.003384262486955773, "phrase": "test_time"}, {"score": 0.0025892330566358503, "phrase": "faulty_switches"}, {"score": 0.002466139325703204, "phrase": "bist_design"}, {"score": 0.002311047934798247, "phrase": "simulation_results"}, {"score": 0.0022738201751000865, "phrase": "bist_circuit"}, {"score": 0.0022371907579775796, "phrase": "possible_manufacturing_defects"}, {"score": 0.0021922308351126746, "phrase": "discharge_transistors"}, {"score": 0.002148172508419683, "phrase": "corresponding_consumed_power"}, {"score": 0.0021049977753042253, "phrase": "test_frequency"}], "paper_keywords": [""], "paper_abstract": "It is becoming common to implement header (footer) power switches in low-power system-on-chip. However, the switches are not tested for manufacturing defects in most designs currently. In this study, a novel built-in self test (BIST) solution for power switch is proposed. To accelerate the test of the header (footer) switches, a charge (discharge) transistor is adopted in the proposed BIST circuit and the corresponding charge (discharge) transistor is gated by the test clock. Therefore the number of test patterns, the length of test vectors and the test time are all decreased. Besides, the test responses can be identified easily. If the test responses are all logic-high, the tested switches are fault-free. Or else, the tested switches are faulty. In addition, the structure of the proposed BIST circuit can be scaled freely with the amount of switches. For m switches, it takes m + 2 cycles to locate the faulty switches at worst. Finally, to verify the proposed BIST circuit, the BIST design with 255 header switches is implemented with SMIC 0.18 mu m 1P6M logic process. The corresponding area is 0.043 mm(2). The simulation results show that the BIST circuit can locate the possible manufacturing defects in the switches and discharge transistors within 257 clock cycles. The corresponding consumed power is 2.04 mW when the test frequency is 20 MHz.", "paper_title": "Built-in self test design of power switch with clock-gated charge/discharge transistor", "paper_id": "WOS:000331699600001"}