{"auto_keywords": [{"score": 0.05007851542092211, "phrase": "termination_value"}, {"score": 0.049819351144464605, "phrase": "one-counter_mdps"}, {"score": 0.0409712432835189, "phrase": "counter_value"}, {"score": 0.0388783111850969, "phrase": "optimal_termination_value"}, {"score": 0.029238938069487155, "phrase": "oc-mdps"}, {"score": 0.004635187610736025, "phrase": "one-counter_simple_stochastic_games"}, {"score": 0.004377993339397485, "phrase": "transition_graph"}, {"score": 0.00435425242455915, "phrase": "classic_one-counter_automata"}, {"score": 0.004214474870088774, "phrase": "key_objective"}, {"score": 0.004090274535243564, "phrase": "termination_objective"}, {"score": 0.0037493114715625784, "phrase": "qualitative_decision_problems"}, {"score": 0.0034837525210738326, "phrase": "polynomial_time"}, {"score": 0.0034554281349858836, "phrase": "np_boolean_and_conp"}, {"score": 0.0033902272003899277, "phrase": "quantitative_decision"}, {"score": 0.0030905652689424924, "phrase": "optimal_strategies"}, {"score": 0.002958833344831972, "phrase": "highly_non-trivial_structure"}, {"score": 0.0028715299874549245, "phrase": "quantitative_termination_problems"}, {"score": 0.0027416330922421226, "phrase": "oc-ssgs"}, {"score": 0.0025403348084746835, "phrase": "oc-ssg_termination_game"}, {"score": 0.0024653491388223546, "phrase": "epsilon-optimal_strategies"}, {"score": 0.0024056425729434634, "phrase": "key_ingredient"}, {"score": 0.0023730978395564116, "phrase": "subtle_martingale"}, {"score": 0.0022967713922705, "phrase": "maximizing_oc-mdp."}, {"score": 0.0022718774783143203, "phrase": "azuma's_inequality"}, {"score": 0.0021808993912887462, "phrase": "\"rich_person's_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "One-counter MDPs (OC-MDPs) and one-counter simple stochastic games (OC-SSGs) are 1-player, and 2-player turn-based zero-sum, stochastic games played on the transition graph of classic one-counter automata (equivalently, pushdown automata with a 1-letter stack alphabet). A key objective for the analysis and verification of these games is the termination objective, where the players aim to maximize (minimize, respectively) the probability of hitting counter value 0, starting at a given control state and given counter value. Recently, we studied qualitative decision problems (\"is the optimal termination value equal to 1?\") for OC-MDP5 (and OC-SSGs) and showed them to be decidable in polynomial time (in NP boolean AND coNP, respectively). However, quantitative decision and approximation problems (\"is the optimal termination value at least p\", or \"approximate the termination value within epsilon\") are far more challenging. This is so in part because optimal strategies may not exist, and because even when they do exist they can have a highly non-trivial structure. It thus remained open even whether any of these quantitative termination problems are computable. In this paper we show that all quantitative approximation problems for the termination value for OC-MDPs and OC-SSGs are computable. Specifically, given an OC-SSG, and given epsilon > 0, we can compute a value v that approximates the value of the OC-SSG termination game within additive error epsilon, and furthermore we can compute epsilon-optimal strategies for both players in the game. A key ingredient in our proofs is a subtle martingale, derived from solving certain linear programs that we can associate with a maximizing OC-MDP. An application of Azuma's inequality on these martingales yields a computable bound for the \"wealth\" at which a \"rich person's strategy\" becomes epsilon-optimal for OC-MDPs. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Approximating the termination value of one-counter MDPs and stochastic games", "paper_id": "WOS:000313861100010"}