{"auto_keywords": [{"score": 0.049494138119342224, "phrase": "unsplittable_flow_problem"}, {"score": 0.00481495049065317, "phrase": "truthful_unsplittable_flow"}, {"score": 0.004791330993892003, "phrase": "large_capacity_networks"}, {"score": 0.004539005582217309, "phrase": "capacitated_graph"}, {"score": 0.004483529384256972, "phrase": "connection_requests"}, {"score": 0.004205752490816441, "phrase": "maximum_value_subset"}, {"score": 0.004144123693155448, "phrase": "edge_capacities"}, {"score": 0.004093453936415085, "phrase": "well_known_fact"}, {"score": 0.003954837422946628, "phrase": "maximal_demand"}, {"score": 0.00376488621224566, "phrase": "sufficiently_large_capacities"}, {"score": 0.0037371883813356755, "phrase": "integrality_gap"}, {"score": 0.003709693561373117, "phrase": "corresponding_integer_linear_program"}, {"score": 0.003584025547693836, "phrase": "randomized_rounding_technique"}, {"score": 0.003488269683533964, "phrase": "large_capacities"}, {"score": 0.003353521531649663, "phrase": "selfish_agents"}, {"score": 0.003296212583539166, "phrase": "requests_characteristics"}, {"score": 0.003168859801438632, "phrase": "theoretic_settings"}, {"score": 0.003130077012135034, "phrase": "randomized_rounding"}, {"score": 0.002914288956035066, "phrase": "monotone_deterministic_algorithm"}, {"score": 0.0028644645610584876, "phrase": "primal-dual_machinery"}, {"score": 0.0028293966058473476, "phrase": "approximation_ratio"}, {"score": 0.002726740692380339, "phrase": "current_best_truthful_mechanism"}, {"score": 0.00266693888510356, "phrase": "current_best_combinatorial_algorithm"}, {"score": 0.002551231163230566, "phrase": "reasonable_iterative_path"}, {"score": 0.0025014259919355453, "phrase": "better_approximation_ratio"}, {"score": 0.0024225729268167796, "phrase": "ptas"}, {"score": 0.002357755095722877, "phrase": "different_techniques"}, {"score": 0.0021735545290040522, "phrase": "special_case"}, {"score": 0.002157538586313944, "phrase": "integer_linear_program"}, {"score": 0.0021049977753042253, "phrase": "comparable_performance_guarantee"}], "paper_keywords": ["Algorithms", " Economics", " Theory", " Mechanism design", " approximation algorithms", " combinatorial and multi-unit auctions", " primal-dual method"], "paper_abstract": "The unsplittable flow problem is one of the most extensively studied optimization problems in the field of networking. Aninstance of it consists of an edge capacitated graph and a set of connection requests, each of which is associated with source and target vertices, a demand, and a value. The objective is to route a maximum value subset of requests subject to the edge capacities. It is a well known fact that as the capacities of the edges are larger with respect to the maximal demand among the requests, the problem can be approximated better. In particular, it is known that for sufficiently large capacities, the integrality gap of the corresponding integer linear program becomes 1 + epsilon, which can be matched by an algorithm that utilizes the randomized rounding technique. In this article, we focus our attention on the large capacities unsplittable flow problem in a game theoretic setting. In this setting, there are selfish agents, which control some of the requests characteristics, and may be dishonest about them. It is worth noting that in game theoretic settings many standard techniques, such as randomized rounding, violate certain monotonicity properties, which are imperative for truthfulness, and therefore cannot be employed. In light of this state of affairs, we design a monotone deterministic algorithm, which is based on a primal-dual machinery, which attains an approximation ratio of e/e-1, up to a disparity of epsilon away. This implies an improvement on the current best truthful mechanism, as well as an improvement on the current best combinatorial algorithm for the problem under consideration. Surprisingly, we demonstrate that any algorithm in the family of reasonable iterative path minimizing algorithms, cannot yield a better approximation ratio. Consequently, it follows that in order to achieve a monotone PTAS, if that exists, one would have to exert different techniques. We also consider the large capacities single-minded multi-unit combinatorial auction problem. This problem is closely related to the unsplittable flow problem since one can formulate it as a special case of the integer linear program of the unsplittable flow problem. Accordingly, we obtain a comparable performance guarantee by refining the algorithm suggested for the unsplittable flow problem.", "paper_title": "Truthful Unsplittable Flow for Large Capacity Networks", "paper_id": "WOS:000276389400013"}