{"auto_keywords": [{"score": 0.043779260734752676, "phrase": "root_complexity"}, {"score": 0.040841239240267654, "phrase": "fractal_dimension"}, {"score": 0.034702848012498407, "phrase": "root_image"}, {"score": 0.03087319757456138, "phrase": "characteristic_curves"}, {"score": 0.00481495049065317, "phrase": "support_vector_machine_method"}, {"score": 0.004700468701207975, "phrase": "important_factor"}, {"score": 0.004570326517392777, "phrase": "maize_plants"}, {"score": 0.004533806239310673, "phrase": "biotic_and_abiotic_stress_conditions"}, {"score": 0.00444377150105556, "phrase": "root_structure"}, {"score": 0.003939748053452577, "phrase": "root_system"}, {"score": 0.0036798490617699227, "phrase": "complexity_indicator"}, {"score": 0.003437036036889996, "phrase": "single_parameter"}, {"score": 0.0033552055241931346, "phrase": "alternative_method"}, {"score": 0.002974281028713475, "phrase": "root_branches"}, {"score": 0.0026471070725516467, "phrase": "root_images"}, {"score": 0.0024133533748653033, "phrase": "artificial_intelligence"}, {"score": 0.0023750047551654085, "phrase": "svm"}, {"score": 0.0022904619303011097, "phrase": "merely_three_parameters"}, {"score": 0.0022268964676199292, "phrase": "svm_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["SVM", " Feature extraction", " Corn"], "paper_abstract": "Root complexity is an important factor in the growth and survivability of maize plants under biotic and abiotic stress conditions. To genetically improve root structure in the future, there is a need to identify the genes that govern root complexity. Root complexity itself is ill defined, but indicators derived from images of the root system such as Fractal Dimension can be used as proxies. A disadvantage of using Fractal Dimension as a complexity indicator is that the complexity of the root as seen in the images is captured into a single parameter. This paper describes an alternative method, which translates a root image into a set of parameters. The method consists of computing the intercepts of circles drawn around the centre of the root image with the root branches. This led to characteristic curves from which parameters can be extracted using curve fitting In addition to the parameters obtained by curve fitting. the density of the root images was included. All parameters were evaluated on their ability to classify the roots among their original genotypes using a method from the realm of Artificial Intelligence, the Support Vector Machine (SVM). The results showed that whilst using merely three parameters originating from the characteristic curves, the SVM algorithm was capable of correctly classifying 99.95% of roots among 235 original genotypes. Published by Elsevier B.V.", "paper_title": "Maize root complexity analysis using a Support Vector Machine method", "paper_id": "WOS:000270011900008"}