{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conditional_renyi_entropy"}, {"score": 0.004740970785485843, "phrase": "renyi"}, {"score": 0.004668059458774745, "phrase": "general_order_unifies"}, {"score": 0.004549114568417568, "phrase": "shannon"}, {"score": 0.0043875257506180865, "phrase": "min-entropy_or_collision_entropy"}, {"score": 0.004253618550301311, "phrase": "shannon_entropy"}, {"score": 0.004102528738941734, "phrase": "commonly_accepted_definition"}, {"score": 0.0035681790580031998, "phrase": "general_order"}, {"score": 0.0034951478868404055, "phrase": "arimoto"}, {"score": 0.003353521531649663, "phrase": "particular_notion"}, {"score": 0.0023346234464901978, "phrase": "natural_interpretation"}, {"score": 0.0021601997088758957, "phrase": "recently_proposed_notion"}, {"score": 0.0021049977753042253, "phrase": "quantum_setting"}], "paper_keywords": ["Conditial Renyi entropy", " monotonicity and chain rule", " Renyi divergence", " quantum Renyi entropy"], "paper_abstract": "The Renyi entropy of general order unifies the well-known Shannon entropy with several other entropy notions, like the min-entropy or collision entropy. In contrast to the Shannon entropy, there seems to be no commonly accepted definition for the conditional Renyi entropy: several versions have been proposed and used in the literature. In this paper, we reconsider the definition for the conditional Renyi entropy of general order as proposed by Arimoto in the seventies. We show that this particular notion satisfies several natural properties. In particular, we show that it satisfies monotonicity under conditioning, meaning that conditioning can only reduce the entropy, and (a weak form of) chain rule, which implies that the decrease in entropy due to conditioning is bounded by the number of bits one conditions on. None of the other suggestions for the conditional Renyi entropy satisfies both these properties. Finally, we show a natural interpretation of the conditional Renyi entropy in terms of (unconditional) Renyi divergence, and we show consistency with a recently proposed notion of conditional Renyi entropy in the quantum setting.", "paper_title": "On the Conditional Renyi Entropy", "paper_id": "WOS:000344524100006"}