{"auto_keywords": [{"score": 0.04969089536874819, "phrase": "perceived_duration"}, {"score": 0.02322730111336098, "phrase": "body_posture"}, {"score": 0.010150331387515464, "phrase": "internal_clock_model"}, {"score": 0.004331393784852601, "phrase": "time_production_task"}, {"score": 0.004192571571622019, "phrase": "arousing_odor"}, {"score": 0.004141663280057689, "phrase": "upright_body_posture"}, {"score": 0.004058180509184539, "phrase": "experimental_task"}, {"score": 0.003695237613399466, "phrase": "relaxing_chair"}, {"score": 0.0032040376301815544, "phrase": "predicted_effects"}, {"score": 0.003051073364818384, "phrase": "self-reported_arousal"}, {"score": 0.002777949746964955, "phrase": "skin_conductance"}, {"score": 0.0025189177411152645, "phrase": "rosemary_odor"}, {"score": 0.0024781515864648242, "phrase": "significantly_shorter_time_intervals"}, {"score": 0.002321563536990284, "phrase": "increased_arousal"}, {"score": 0.0021049977753042253, "phrase": "proposed_arousal_mechanism"}], "paper_keywords": ["perceived duration", " internal clock", " arousal", " affective state", " body posture", " odor"], "paper_abstract": "This study reports an examination of the internal clock model, according to which subjective time duration is influenced by attention and arousal state. In a time production task, we examine the hypothesis that an arousing odor and an upright body posture affect perceived duration. The experimental task was performed while participants were exposed to an odor and either sitting upright (arousing condition) or lying down in a relaxing chair (relaxing condition). They were allocated to one of three experimental odor conditions: rosemary (arousing condition), peppermint (relaxing condition), and no odor (control condition). The predicted effects of the odors were not borne out by the results. Self-reported arousal (SRA) and pleasure (PL) states were measured before, during (after each body posture condition) and postexperimentally. Heart rate (HR) and skin conductance were measured before and during the experiment. As expected, odor had an effect on perceived duration. When participants were exposed to rosemary odor, they produced significantly shorter time intervals than in the no odor condition. This effect, however, could not be explained by increased arousal. There was no effect of body posture on perceived duration, even though body posture did induce arousal. The results do not support the proposed arousal mechanism of the internal clock model.", "paper_title": "The effects of odor and body posture on perceived duration", "paper_id": "WOS:000348808800001"}