{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_behaviour"}, {"score": 0.046857674197631136, "phrase": "existing_models"}, {"score": 0.04505606543446886, "phrase": "new_model"}, {"score": 0.039568077517546554, "phrase": "practical_value"}, {"score": 0.004054745478848129, "phrase": "key_factors"}, {"score": 0.0040052617265655035, "phrase": "successful_communication"}, {"score": 0.0037207397635410327, "phrase": "information_providers"}, {"score": 0.0035278613436978933, "phrase": "literature_search"}, {"score": 0.003470543198694293, "phrase": "well-established_models"}, {"score": 0.0033176589215021353, "phrase": "new_conceptual_model"}, {"score": 0.003250403288147613, "phrase": "-_existing_models"}, {"score": 0.003107186371289819, "phrase": "information_science"}, {"score": 0.0030193416820392554, "phrase": "information_user"}, {"score": 0.002839352319679885, "phrase": "communication_process"}, {"score": 0.0027477745788313163, "phrase": "key_elements"}, {"score": 0.0023610946923597405, "phrase": "seeking_and_communication_models"}, {"score": 0.0023131855385489764, "phrase": "previous_research"}], "paper_keywords": ["Information behaviour", " Communications", " Theory", " Models", " Information"], "paper_abstract": "Purpose - This paper aims to gain insights from existing models of information behaviour, building on them to develop a new model which, unlike most others, encompasses both information seeking and communication. By identifying key factors affecting the successful communication and use of information, it is hoped that the model will be of practical value both to information providers and to users. Design/methodology/approach - The paper is based on a literature search and analysis of well-established models of information seeking and of communication, from which a new conceptual model is constructed. Findings - Existing models have elements in common, though most models in library and information science focus on information seeking and the information user, while those from the field of communications focus on the communicator and the communication process. A new model is proposed that includes key elements of existing models and takes into account not just the information seeker but also the communicator or information provider. Originality/value - The model developed in this paper is the first to combine elements from both information seeking and communication models. Being built on previous research, it can be used to investigate the practical value of the model itself and the elements that it has in common with other models.", "paper_title": "Building on models of information behaviour: linking information seeking and communication", "paper_id": "WOS:000317150200002"}