{"auto_keywords": [{"score": 0.0495133738546852, "phrase": "dynamic_networks"}, {"score": 0.04840115289905245, "phrase": "multipiles"}, {"score": 0.00481495049065317, "phrase": "explore_temporal_patterns"}, {"score": 0.004249825947483216, "phrase": "physical_analogy"}, {"score": 0.004174677062711731, "phrase": "adjacency_matrices"}, {"score": 0.004028326293950714, "phrase": "single_temporal_snapshot"}, {"score": 0.003706410380455668, "phrase": "small_multiples"}, {"score": 0.003251552926963083, "phrase": "one's_advantages"}, {"score": 0.0029737652463012318, "phrase": "temporal_snapshots"}, {"score": 0.002903771635043968, "phrase": "multipiles_technique"}, {"score": 0.002639845784408318, "phrase": "brain_connectivity_networks"}, {"score": 0.002315574871863272, "phrase": "statistical_analysis"}, {"score": 0.0022610379771517966, "phrase": "high-level_temporal_patterns"}], "paper_keywords": [""], "paper_abstract": "We introduce MultiPiles, a visualization to explore time-series of dense, weighted networks. MultiPiles is based on the physical analogy of piling adjacency matrices, each one representing a single temporal snapshot. Common interfaces for visualizing dynamic networks use techniques such as: flipping/animation; small multiples; or summary views in isolation. Our proposed piling' metaphor presents a hybrid of these techniques, leveraging each one's advantages, as well as offering the ability to scale to networks with hundreds of temporal snapshots. While the MultiPiles technique is applicable to many domains, our prototype was initially designed to help neuroscientists investigate changes in brain connectivity networks over several hundred snapshots. The piling metaphor and associated interaction and visual encodings allowed neuroscientists to explore their data, prior to a statistical analysis. They detected high-level temporal patterns in individual networks and this helped them to formulate and reject several hypotheses.", "paper_title": "Small MultiPiles: Piling Time to Explore Temporal Patterns in Dynamic Networks", "paper_id": "WOS:000358328200006"}