{"auto_keywords": [{"score": 0.04752086310544823, "phrase": "systematic_inheritance"}, {"score": 0.04508762438435365, "phrase": "potentially_erroneous_concepts"}, {"score": 0.00481495049065317, "phrase": "terminology_design_life_cycle"}, {"score": 0.004668659654386976, "phrase": "auditing_methodology"}, {"score": 0.004589307360976108, "phrase": "medical_terminologies"}, {"score": 0.004404296965915598, "phrase": "high-level_views"}, {"score": 0.004014728271095809, "phrase": "terminology's_concepts"}, {"score": 0.003892655187180623, "phrase": "multi-rooted_area"}, {"score": 0.0035972293900260414, "phrase": "structurally_and_semantically_uniform_concepts"}, {"score": 0.003536023290715607, "phrase": "abstraction_networks"}, {"score": 0.0032788123043064475, "phrase": "auditing_approach"}, {"score": 0.0031464653712924436, "phrase": "human_reviewers"}, {"score": 0.003082302636409597, "phrase": "limited_number"}, {"score": 0.003061206247127742, "phrase": "problematic_concepts"}, {"score": 0.0030090929255598485, "phrase": "probable_concentration"}, {"score": 0.002877700749616268, "phrase": "p-area_taxonomy"}, {"score": 0.0028482011835781434, "phrase": "biological_process"}, {"score": 0.002761499542632865, "phrase": "ncit"}, {"score": 0.0025604827895852646, "phrase": "different_kinds"}, {"score": 0.002440231768165477, "phrase": "error_concentration"}, {"score": 0.0023416540209862803, "phrase": "p-area_taxonomies"}, {"score": 0.002317636745271539, "phrase": "efficient_tool"}, {"score": 0.002163682878218085, "phrase": "domain_expert's_manual_review"}, {"score": 0.0021049977753042253, "phrase": "high_likelihood"}], "paper_keywords": [""], "paper_abstract": "Objective: To develop and test an auditing methodology for detecting errors in medical terminologies satisfying systematic inheritance. This methodology is based on various abstraction taxonomies that provide high-level views of a terminology and highlight potentially erroneous concepts. Design: Our auditing methodology is based on dividing concepts of a terminology into smaller, more manageable units. First, we divide the terminology's concepts into areas according to their relationships/roles. Then each multi-rooted area is further divided into partial-areas (p-areas) that are singly-rooted. Each p-area contains a set of structurally and semantically uniform concepts. Two kinds of abstraction networks, called the area taxonomy and p-area taxonomy, are derived. These taxonomies form the basis for the auditing approach. Taxonomies tend to highlight potentially erroneous concepts in areas and p-areas. Human reviewers can focus their auditing efforts on the limited number of problematic concepts following two hypotheses on the probable concentration of errors. Results: A sample of the area taxonomy and p-area taxonomy for the Biological Process (BP) hierarchy of the National Cancer Institute Thesaurus (NCIT) was derived from the application of our methodology to its concepts. These views led to the detection of a number of different kinds of errors that are reported, and to confirmation of the hypotheses on error concentration in this hierarchy. Conclusion: Our auditing methodology based on area and p-area taxonomies is an efficient tool for detecting errors in terminologies satisfying systematic inheritance of roles, and thus facilitates their maintenance. This methodology concentrates a domain expert's manual review on portions of the concepts with a high likelihood of errors.", "paper_title": "Auditing as part of the terminology design life cycle", "paper_id": "WOS:000242430300012"}