{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "binding_mode"}, {"score": 0.004398331355940011, "phrase": "human_cancer"}, {"score": 0.004312622975366676, "phrase": "tumor_progression"}, {"score": 0.00414616342377235, "phrase": "anticancer_drug_discovery"}, {"score": 0.00361237042013781, "phrase": "mmpbsa_method"}, {"score": 0.0035141291835319682, "phrase": "mmgbsa_method"}, {"score": 0.003260690513595527, "phrase": "conserved_hydrophobic_adenine_region"}, {"score": 0.002763261749602258, "phrase": "nitrogen_atom"}, {"score": 0.0027200305495826797, "phrase": "aminothiazole_ring"}, {"score": 0.002594342451017822, "phrase": "binding_site_wall"}, {"score": 0.0025237171554924128, "phrase": "c-terminal_lobe"}, {"score": 0.002407078478216306, "phrase": "side_chain"}, {"score": 0.0023694065215394593, "phrase": "notably_the_interaction"}, {"score": 0.0022777800735119405, "phrase": "selectivity_profile"}], "paper_keywords": ["Molecular dynamics simulation", " Phosphatidylinositol 3-kinase alpha"], "paper_abstract": "Activation of the phosphatidylinositol 3-kinase alpha (PI3K alpha) is commonly observed in human cancer and is critical for tumor progression, which has made PI3K alpha an attractive target for anticancer drug discovery. To systematically investigate the binding mode of A-66S, a new selective PI3K alpha inhibitor for PI3K alpha, molecular docking, molecular dynamics simulation and ensuing energetic analysis were performed. The binding free energy between PI3K alpha and A-66S is -11.27 kcal.mol(-1) using MMPBSA method, while -14.67 kcal.mol(-1) using MMGBSA method, which is beneficial for the binding, and the van der Waals/hydrophobic and electrostatic interactions are critical for the binding. The conserved hydrophobic adenine region of PI3K alpha made up of Met772, Pro778, Ile800, Tyr836, Ile848, Val850, Val851, Met922, Phe930 and Ile932 accommodates the flat 2-tert-butyl-4'-methyl-4,5'-bithiazol moiety of A-66S, and the NH of Val851 forms a hydrogen with the nitrogen atom embedded in the aminothiazole ring of A-66S. The (S)-pyrrolidine carboxamide urea moiety especially extends toward the region of the binding site wall (Ser854-Gln859) defined by the C-terminal lobe, and has three hydrogen-bond arms with the backbone of Ser854 and the side chain of Gln859. Notably the interaction between the non-conserved residue Gln859 and A-66S is responsible for the selectivity profile of A-66S. The binding mode of A-66S for PI3K alpha presented in this study should aid in the design of a new highly selective PI3K alpha inhibitor.", "paper_title": "Definition of the binding mode of phosphoinositide 3-kinase alpha-selective inhibitor A-66S through molecular dynamics simulation", "paper_id": "WOS:000334934900050"}