{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_management_system"}, {"score": 0.004516856326107826, "phrase": "business_system"}, {"score": 0.00429558848734449, "phrase": "leading_point"}, {"score": 0.004237138632255772, "phrase": "highest_value"}, {"score": 0.004141476915000558, "phrase": "human_factor"}, {"score": 0.0040111533608228195, "phrase": "company's_disposal"}, {"score": 0.0037798652680135106, "phrase": "sole_awareness"}, {"score": 0.002993887707344862, "phrase": "possible_models"}, {"score": 0.002551022760887132, "phrase": "modern_information"}, {"score": 0.002527788827701828, "phrase": "communication_technology_application"}, {"score": 0.0023818288346547692, "phrase": "main_part"}, {"score": 0.0022962183207691188, "phrase": "intelligent_document_management"}, {"score": 0.0021049977753042253, "phrase": "modern_document_management_systems"}], "paper_keywords": ["adaptability", " personalization", " management information system", " business process optimization", " collaboration", " portals", " web services", " digital identities", " electronic document management"], "paper_abstract": "Among the most significant values of a business system that contribute to its competitiveness in comparison with others, the leading point and the highest value, second to the human factor, is the information at the company's disposal, unified in the company's know how. Unfortunately, the sole awareness of the importance and significance of information is mostly not enough. It is for this reason that this resource is unfairly neglected and is insufficiently used. What results from this situation is that information is mostly unavailable and insufficiently protected. This paper will show one of the possible models of systems for managing information based on principles of adaptability and personalization which aims towards adequate, fast, efficient and secure access to protected information in the company. The subject of this manuscript is to explore the possibilities of modern information and communication technology application in developing information management system based on principles of adaptability and personalization. The main part of this system is the portal for intelligent document management. The solution proposed in the dissertation is based on integration and implementation of services for adaptation in modern document management systems.", "paper_title": "Information Management System based on Principles of Adaptability and Personalization", "paper_id": "WOS:000360696200019"}