{"auto_keywords": [{"score": 0.03377552578189033, "phrase": "mi-qsar_models"}, {"score": 0.014473643967239326, "phrase": "qsar_models"}, {"score": 0.013830323279136773, "phrase": "skin_penetration_enhancement"}, {"score": 0.00481495049065317, "phrase": "skin_penetration_enhancers"}, {"score": 0.004160531596936783, "phrase": "hydrocortisone_acetate"}, {"score": 0.00389164348807591, "phrase": "new_mi-qsar_descriptor"}, {"score": 0.003795335309109018, "phrase": "integrated_cylindrical_distribution_functions"}, {"score": 0.0037480753312398754, "phrase": "phospholipid_monolayer_model"}, {"score": 0.0035947360742084253, "phrase": "skin_penetration_enhancer"}, {"score": 0.0033905067962602515, "phrase": "optimized_mi-qsar_models"}, {"score": 0.0033482708495261864, "phrase": "training_sets"}, {"score": 0.0030797912111959137, "phrase": "classic_intramolecular_descriptors"}, {"score": 0.00300351371036355, "phrase": "good_penetration_enhancers"}, {"score": 0.002978508766388785, "phrase": "bigger_\"holes"}, {"score": 0.0027167830773160203, "phrase": "poor_penetration_enhancers"}, {"score": 0.002682917193736698, "phrase": "skin_penetration"}, {"score": 0.0025409639091476363, "phrase": "space_and_time_alteration"}, {"score": 0.0024573577356299765, "phrase": "membrane_monolayer"}, {"score": 0.00212268510072928, "phrase": "stable_predictive_models"}, {"score": 0.0021049977753042253, "phrase": "accepted_diagnostic_measures"}], "paper_keywords": [""], "paper_abstract": "Membrane-interaction quantitative structure-activity relationship (MI-QSAR) models for two skin penetration enhancer data sets of 61 and 42 compounds were constructed and compared to QSAR models constructed for the same two data sets using only classic intramolecular QSAR descriptors. These two data sets involve skin penetration enhancement of hydrocortisone and hydrocortisone acetate, and the enhancers are generally similar in structure to lipids and surfactants. A new MI-QSAR descriptor, the difference in the integrated cylindrical distribution functions over the phospholipid monolayer model, in and out of the presence of the skin penetration enhancer, Delta Sigma h(r), was developed. This descriptor is dominant in the optimized MI-QSAR models of both training sets studied and greatly reduces the size and complexity of the MI-QSAR models as compared to those QSAR models developed using the classic intramolecular descriptors. The MI-QSAR models indicate that good penetration enhancers make bigger \"holes\" in the monolayer and are less aqueous-soluble, so as to preferentially enter the monolayer, than are poor penetration enhancers. The skin penetration enhancer thus alters the structure and organization of the monolayer. This space and time alteration in the structure and dynamics of the membrane monolayer is captured by Delta Sigma h(r) and is simplistically referred to as \"holes\" in the monolayer. The MI-QSAR models explain 70-80% of the variance in skin penetration enhancement across each of the two training sets and are stable predictive models using accepted diagnostic measures of robustness and predictivity.", "paper_title": "Membrane-interaction quantitative structure-activity relationship (MI-QSAR) analyses of skin penetration enhancers", "paper_id": "WOS:000257026800012"}