{"auto_keywords": [{"score": 0.04150361803672889, "phrase": "sports_matches"}, {"score": 0.015719716506582538, "phrase": "sports_results_prediction"}, {"score": 0.004613516457919661, "phrase": "sports_prediction"}, {"score": 0.004580769304731227, "phrase": "bayesian_inference"}, {"score": 0.004548253531664032, "phrase": "rule-based_reasoning"}, {"score": 0.004467965784278827, "phrase": "in-game_time-series_approach"}, {"score": 0.004131699581310179, "phrase": "bayesian"}, {"score": 0.0035822005511799036, "phrase": "crisp_logic_rules"}, {"score": 0.003493900927782043, "phrase": "rule-based_component"}, {"score": 0.003419943984098415, "phrase": "reasonably_good_predictions"}, {"score": 0.003383552654319383, "phrase": "statistical_data"}, {"score": 0.0031393948330209255, "phrase": "learning_techniques"}, {"score": 0.0031170783606525856, "phrase": "great_difficulty"}, {"score": 0.003061976628792769, "phrase": "insufficient_data"}, {"score": 0.002923214590192792, "phrase": "current_scores"}, {"score": 0.0025343769150179764, "phrase": "knowledge-based_in-game_time-series_approach"}, {"score": 0.0023936956017015696, "phrase": "sports_match"}, {"score": 0.0022527488455744674, "phrase": "football_results_predictor"}, {"score": 0.0021049977753042253, "phrase": "reasonable_and_stable_predictions"}], "paper_keywords": ["Rule-based reasoning", " Bayesian inference", " Sports prediction", " Football", " In-game time-series approach", " Simulation"], "paper_abstract": "We propose a framework for sports prediction using Bayesian inference and rule-based reasoning, together with an in-game time-series approach. The framework is novel in three ways. The framework consists of two major components: a rule-based reasoner and a Bayesian network component. The two different approaches cooperate in predicting the results of sports matches. It is motivated by the observation that sports matches are highly stochastic, but at the same time, the strategies of a team can be approximated by crisp logic rules. Furthermore, because of the rule-based component, our framework can give reasonably good predictions even when statistical data is scanty: it can be used to predict results of matches between teams which have had few previous encounters. Machine learning techniques have great difficulty in handling such situations of insufficient data. Second, our framework is able to consider many factors, such as current scores, morale, fatigue, skills, etc. when it predicts the results of sports matches: most previous work considered only one factor, usually the score. Third, in contrast to most previous work on sports results prediction, we use a knowledge-based in-game time-series approach to predict sports matches. This approach enables our framework to reflect the tides/flows of a sports match, making our predictions certainly more realistic, and somewhat more accurate. We have implemented a football results predictor called FIRES (Football Result Expert System) based on this framework, and show that it gives reasonable and stable predictions. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A compound framework for sports results prediction: A football case study", "paper_id": "WOS:000260213800005"}