{"auto_keywords": [{"score": 0.04902896582647276, "phrase": "low-discrepancy_point_distributions"}, {"score": 0.03962261693999935, "phrase": "space-filling_curve"}, {"score": 0.00481495049065317, "phrase": "parametric_surfaces"}, {"score": 0.004761850836420121, "phrase": "adaptive_space-filling_curves"}, {"score": 0.0035486713647627246, "phrase": "parametric_mapping"}, {"score": 0.0034707339811048403, "phrase": "corrective_approach"}, {"score": 0.0034134024569847264, "phrase": "histogram_equalisation"}, {"score": 0.0030715948036518603, "phrase": "local_density"}, {"score": 0.002841774126940817, "phrase": "higher_curvature"}, {"score": 0.002763919794139171, "phrase": "parametric_distortion"}, {"score": 0.0024732038734968567, "phrase": "low-discrepancy_distributions"}, {"score": 0.002445865715873089, "phrase": "arbitrary_parametric_surfaces"}, {"score": 0.0024054226746197706, "phrase": "nearly_as_good_results"}, {"score": 0.00218853009252455, "phrase": "machine-precision_limitations"}, {"score": 0.002152332983488664, "phrase": "surface_reparameterisation"}, {"score": 0.0021049977753042253, "phrase": "adaptive_sampling"}], "paper_keywords": [""], "paper_abstract": "Low-discrepancy point distributions exhibit excellent uniformity properties for sampling in applications such as rendering and measurement. We present an algorithm for generating low-discrepancy point distributions on arbitrary parametric surfaces using the idea of converting the 2D sampling problem into a 1D problem by adaptively mapping a space-filling curve onto the surface. The 1D distribution takes into account the parametric mapping by employing a corrective approach similar to histogram equalisation to ensure that it gives a 2D low-discrepancy point distribution on the surface. This also allows for control over the local density of the distribution, e.g. to place points more densely in regions of higher curvature. To allow for parametric distortion, the space-filling curve is generated adaptively to cover the surface evenly. Experiments show that this approach efficiently generates low-discrepancy distributions on arbitrary parametric surfaces and creates nearly as good results as well-known low-discrepancy sampling methods designed for particular surfaces like planes and spheres. However, we also show that machine-precision limitations may require surface reparameterisation in addition to adaptive sampling.", "paper_title": "Density-controlled sampling of parametric surfaces using adaptive space-filling curves", "paper_id": "WOS:000239567900033"}