{"auto_keywords": [{"score": 0.02938004719337372, "phrase": "design_space"}, {"score": 0.004832762679569159, "phrase": "context"}, {"score": 0.004425616928975799, "phrase": "user's_behavior"}, {"score": 0.004242868712089958, "phrase": "increasingly_pressing_concern"}, {"score": 0.004154332348800334, "phrase": "design_frameworks"}, {"score": 0.004033464035028803, "phrase": "context-aware_computing_systems"}, {"score": 0.003378385493203297, "phrase": "context-aware_systems"}, {"score": 0.0032387402145603412, "phrase": "five_concerns"}, {"score": 0.003091767402370757, "phrase": "process_model"}, {"score": 0.0030017207229983385, "phrase": "system_designers"}, {"score": 0.0029020077365708966, "phrase": "central_role"}, {"score": 0.00287759989638073, "phrase": "designers'_views"}, {"score": 0.002853396755102163, "phrase": "context_plays"}, {"score": 0.002689564715486338, "phrase": "relevant_features"}, {"score": 0.002600194073758015, "phrase": "possible_solutions"}, {"score": 0.0023996317685956213, "phrase": "dynamic_concept"}, {"score": 0.00231987280116332, "phrase": "design_project"}, {"score": 0.002242758902593467, "phrase": "positivist_interpretation"}, {"score": 0.0021049977753042253, "phrase": "context-aware_design"}], "paper_keywords": [""], "paper_abstract": "Context has long been considered an important component of design, but as technology becomes more capable of inferring the user's behavior and environment, what constitutes context has become an increasingly pressing concern to designers. Although design frameworks and models have been proposed for context-aware computing systems, there has not yet been research that focuses on understanding context empirically from the perspective of the designer. To address this, we present an analysis of 11 in-depth interviews we conducted with designers of a variety of context-aware systems. Our analysis of the artifacts and interviews reveal five concerns designers address in their work. Furthermore, we present a process model that illustrates how context-aware system designers address these concerns. Our findings demonstrate the central role that designers' views of context plays in (a) framing a design space, (b) encoding the relevant features of context, (c) unifying possible solutions within that design space, and (d) evaluating designs. These findings suggest that context is a dynamic concept that evolves over the course of a design project, generally from a more phenomenological perspective toward a positivist interpretation. This, and the process by which it occurs, contributes insight into context-aware design with implications for both academics and practitioners.", "paper_title": "What Designers Talk About When They Talk About Context", "paper_id": "WOS:000342301700002"}