{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "gpcr_models"}, {"score": 0.026693106017769638, "phrase": "virtual_screening_campaigns"}, {"score": 0.004468304427278713, "phrase": "gpcr_structures"}, {"score": 0.003698442219929622, "phrase": "primary_objective"}, {"score": 0.003372019835750424, "phrase": "distant_templates"}, {"score": 0.003198554193075258, "phrase": "presumably_reliable_model"}, {"score": 0.0030206579994328975, "phrase": "second_less_reliable_model"}, {"score": 0.0029289895726382653, "phrase": "second_model"}, {"score": 0.002381365139274329, "phrase": "predictive_power"}, {"score": 0.0021709339252206825, "phrase": "specially_developed_tool"}, {"score": 0.002142426911242168, "phrase": "highly_predictive_consensus_functions"}, {"score": 0.0021049977753042253, "phrase": "corresponding_enrichment_factors"}], "paper_keywords": ["mAChR1 receptor", " GPCR modeling", " Pro-containing helices", " Virtual screening", " Consensus algorithms"], "paper_abstract": "To better investigate the GPCR structures, we have recently proposed to explore their flexibility by simulating the bending of their Pro-containing TM helices so generating a set of models (the so-called chimeras) which exhaustively combine the two conformations (bent and straight) of these helices. The primary objective of the study is to investigate whether such an approach can be exploited to enhance the reliability of the GPCR models generated by distant templates. The study was focused on the human mAChR1 receptor for which a presumably reliable model was generated using the congener mAChR3 as the template along with a second less reliable model based on the distant beta 2-AR template. The second model was then utilized to produce the chimeras by combining the conformations of its Pro-containing helices (i.e., TM4, TM5, TM6 and TM7 with 16 modeled chimeras). The reliability of such chimeras was assessed by virtual screening campaigns as evaluated using a novel skewness metric where they surpassed the predictive power of the more reliable mAChR1 model. Finally, the virtual screening campaigns emphasize the opportunity of synergistically combining the scores of more chimeras using a specially developed tool which generates highly predictive consensus functions by maximizing the corresponding enrichment factors.", "paper_title": "Enhancing the Reliability of GPCR Models by Accounting for Flexibility of Their Pro-Containing Helices: the Case of the Human mAChR1 Receptor", "paper_id": "WOS:000352620100003"}