{"auto_keywords": [{"score": 0.04715783641110325, "phrase": "social_web_sites"}, {"score": 0.0057880407211942635, "phrase": "semantic_web"}, {"score": 0.004743423032820112, "phrase": "trusted_applications"}, {"score": 0.004414542249381157, "phrase": "simplified_user_contributions"}, {"score": 0.004284302478991387, "phrase": "online_social_networks"}, {"score": 0.004047296286849109, "phrase": "\"object-centered_networks"}, {"score": 0.003677280504320636, "phrase": "user_access"}, {"score": 0.0036553070575015344, "phrase": "multiple_sites"}, {"score": 0.003321008590273796, "phrase": "representation_mechanisms"}, {"score": 0.0032520438684277885, "phrase": "social_web"}, {"score": 0.0032229262928681304, "phrase": "interoperable_and_extensible_way"}, {"score": 0.003044455555031339, "phrase": "heterogeneous_ties"}, {"score": 0.002816092821027267, "phrase": "agreed-upon_semantic_web_formats"}, {"score": 0.0026600905156986317, "phrase": "embeddable_application_widgets"}, {"score": 0.00255068452076921, "phrase": "common_semantics"}, {"score": 0.002482734080358268, "phrase": "social_aspect"}, {"score": 0.00242385118139873, "phrase": "software_project"}, {"score": 0.0023522028979450897, "phrase": "social_networking"}, {"score": 0.0022895278869126848, "phrase": "representation_models"}, {"score": 0.0021049977753042253, "phrase": "social_networking_sites"}], "paper_keywords": [""], "paper_abstract": "In recent years, there has been an explosion in the number of Social Web sites which allow the creation of knowledge through simplified user contributions via blogs, wikis, and the deployment of online social networks. As more Social Web sites form around the connections between people and their objects of interest, and as these \"object-centered networks\" grow bigger and more diverse, more intuitive methods are needed for representing and navigating the objects in these sites: both within and across Social Web sites. Also, to better enable user access to multiple sites, interoperability among Social Web sites is required in terms of both the expressed data (content objects, person-to-person networks, etc.) and the social applications in use (e.g., widgets) on each site. This requires representation mechanisms for data and applications on the Social Web in an interoperable and extensible way. The Semantic Web provides such representation mechanisms: it can be used to link people and objects by representing the heterogeneous ties that bind us all to each other (either directly or indirectly). In this chapter, we will describe methods that build on agreed-upon Semantic Web formats to describe people, content objects, the connections that bind them together explicitly or implicitly, and embeddable application widgets on Social Web sites, thereby enabling these sites to interoperate by appealing to some common semantics. We will also focus on how a social aspect can be added to data such as software project and widgets descriptions, so that one can combine social networking, trust, and relationship aspects with those representation models. We will also look at how developers can use the Semantic Web to augment the ways in which they create, reuse, and link content on social networking sites and Social Web sites. In particular, we will see how both data and applications can be shared on the Web, thanks to these semantics.", "paper_title": "The Future of Social Web Sites: Sharing Data and Trusted Applications with Semantics", "paper_id": "WOS:000267364500004"}