{"auto_keywords": [{"score": 0.04702689500411954, "phrase": "non-alphanumeric_characters"}, {"score": 0.008713768692145006, "phrase": "scientific_publications"}, {"score": 0.00673092403588921, "phrase": "specific_disciplines"}, {"score": 0.004640079189342692, "phrase": "citation_impact"}, {"score": 0.00445318311339027, "phrase": "randomized_subset"}, {"score": 0.004273782634394231, "phrase": "science_database"}, {"score": 0.003985166330358716, "phrase": "field-normalised_citation"}, {"score": 0.003479180627368156, "phrase": "impact_values"}, {"score": 0.003352658916650986, "phrase": "individual_characters"}, {"score": 0.0025547994452342266, "phrase": "thematically_related_science_fields"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Impact", " Occurrence", " Special characters", " Scientific publications", " Titles", " Bootstrap", " Heatmaps"], "paper_abstract": "We investigated the occurrence of non-alphanumeric characters in a randomized subset of over almost 650,000 titles of scientific publications from the Web of Science database. Additionally, for almost 500,000 of these publications we correlated occurrence with impact, using the field-normalised citation metric CPP/FCSm. We compared occurrence and correlation with impact both at in general and for specific disciplines and took into account the variation within sets by (non-parametrically) bootstrapping the calculation of impact values. We also compared use and impact of individual characters in the 30 fields in which non-alphanumeric characters occur most frequently, by using heatmaps that clustered and reordered fields and characters. We conclude that the use of some non-alphanumeric characters, such as the hyphen and colon, is common in most titles and that not including such characters generally correlates negatively with impact. Specific disciplines on the other hand, may show either a negative, absent, or positive correlation. We also found that thematically related science fields use non-alphanumeric characters in comparable numbers, but that impact associated with such characters shows a less strong thematic relation. Overall, it appears that authors cannot influence success of publications by including non-alphanumeric characters in fields where this is not already commonplace. (C) 2011 Published by Elsevier Ltd.", "paper_title": "Non-alphanumeric characters in titles of scientific publications: An analysis of their occurrence and correlation with citation impact", "paper_id": "WOS:000296524200012"}