{"auto_keywords": [{"score": 0.04178514569843149, "phrase": "ise"}, {"score": 0.00481495049065317, "phrase": "dual_subproblems"}, {"score": 0.0047026237903774895, "phrase": "incomplete_series_expansions"}, {"score": 0.004415675459182871, "phrase": "diagonal_approximate_hessian_matrices"}, {"score": 0.00404937519538515, "phrase": "incomplete_series_expansion"}, {"score": 0.003802135020791801, "phrase": "salient_feature"}, {"score": 0.0029547698888028697, "phrase": "highly_efficient_dual_formulations"}, {"score": 0.0028857130140890787, "phrase": "different_combinations"}, {"score": 0.0023507916951658455, "phrase": "design_variables"}, {"score": 0.0022958180852458215, "phrase": "minimum_compliance_topology_optimization_problem"}], "paper_keywords": ["Sequential approximate optimization (SAO)", " Incomplete series expansion (ISE)", " Structural optimization", " Duality"], "paper_abstract": "In this paper, dual formulations for nonlinear multipoint approximations with diagonal approximate Hessian matrices are proposed; these approximations for example derive from the incomplete series expansion (ISE) proposed previously. A salient feature of the ISE is that it may be used to formulate strictly convex and separable (recast) primal approximate subproblems for use in sequential approximate optimization (SAO). In turn, this allows for the formulation of highly efficient dual formulations, and different combinations of direct, reciprocal, and exponential intervening variables for the objective and the constraint functions may be used. Two frequently encountered problems in structural optimization, namely the weight minimization problem with sizing design variables and the minimum compliance topology optimization problem, are degenerate cases of the formulations we present. Computational experiments confirm the efficiency of our proposed methodology; to this end, comparative results for the method of moving asymptotes (MMA) are presented.", "paper_title": "Sequential approximate optimization using dual subproblems based on incomplete series expansions", "paper_id": "WOS:000260380300001"}