{"auto_keywords": [{"score": 0.04657874670402126, "phrase": "lma"}, {"score": 0.00481495049065317, "phrase": "implementation_strategies_for_location-based_multicast_addressing"}, {"score": 0.0046276016230633495, "phrase": "important_building_block"}, {"score": 0.004594326191526569, "phrase": "context-aware_applications"}, {"score": 0.0045612889352793584, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.0041677440361312604, "phrase": "receiving_nodes"}, {"score": 0.004005476499933792, "phrase": "addressing_mechanism"}, {"score": 0.003976656675903324, "phrase": "multicast_applications"}, {"score": 0.003948085938409603, "phrase": "manets"}, {"score": 0.0037806195039533355, "phrase": "application_scenarios"}, {"score": 0.003753411452669234, "phrase": "different_implementation_strategies"}, {"score": 0.0035426543993952184, "phrase": "specific_applications"}, {"score": 0.003416963042033614, "phrase": "specific_implementation_strategies"}, {"score": 0.002989348426906409, "phrase": "lma."}, {"score": 0.0025962638592454974, "phrase": "restricted_multicasting"}, {"score": 0.002337791830793841, "phrase": "communication_patterns"}, {"score": 0.0022958971655679832, "phrase": "common_expectations"}, {"score": 0.002230418233881411, "phrase": "hybrid_approach"}, {"score": 0.0021049977753042253, "phrase": "varying_or_unknown_communication_patterns"}], "paper_keywords": ["Mobile", " ad hoc", " location", " addressing", " multicast"], "paper_abstract": "Location-based multicast addressing (LMA) yields an important building block for context-aware applications in mobile ad hoc networks (MANETs). In LMA, messages are routed based on their content as well as on the location of the sending and the receiving nodes. The same dynamism that motivates locations as part of the addressing mechanism for multicast applications in MANETs, makes such a multicast challenging to implement both efficiently and reliably across application scenarios. Different implementation strategies have been proposed in literature for abstractions similar to LMA, motivated and validated by specific applications. The goal of this paper is to devise specific implementation strategies for LMA and compare these strategies in the context of several application scenarios, in order to aid in the selection of a scheme for a given application. To that end, we first detail three algorithms for implementing LMA. The first, message-centric, strategy uses geographically scoped gossiping to propagate messages. The second, query-centric, strategy propagates queries of receivers to subsequently route messages. The third, hybrid, strategy strives for the best of both worlds through a restricted multicasting of both messages and queries. We compare these algorithms both analytically and empirically. We pinpoint differences and break-even points among the approaches based on communication patterns, contrasting our findings with common expectations and our analysis. Our evaluations show that the hybrid approach invariably outperforms at least one of the other approaches, making it a safe choice for settings with varying or unknown communication patterns.", "paper_title": "Evaluating Implementation Strategies for Location-Based Multicast Addressing", "paper_id": "WOS:000319407200004"}