{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "job_search"}, {"score": 0.014198998193688118, "phrase": "south_korea"}, {"score": 0.011890180010927613, "phrase": "job_seekers"}, {"score": 0.008016293803480243, "phrase": "germany"}, {"score": 0.004582423717777699, "phrase": "unemployment_spells"}, {"score": 0.004461882369408972, "phrase": "national_panel_datasets"}, {"score": 0.004246333442872459, "phrase": "probit_and_hausman-taylor_iv_models"}, {"score": 0.00394981748347167, "phrase": "duration_analysis"}, {"score": 0.0038166522763373434, "phrase": "internet_job_search"}, {"score": 0.003264422557779248, "phrase": "shorter_duration"}, {"score": 0.003094716540812336, "phrase": "interne_penetration_rates"}, {"score": 0.0028565082986974602, "phrase": "job_application_process"}, {"score": 0.002557322657104706, "phrase": "job_search_efforts"}, {"score": 0.0024428607154967806, "phrase": "first_study"}, {"score": 0.0024150528983695446, "phrase": "panel_datasets"}, {"score": 0.002360381056508366, "phrase": "internet_use"}, {"score": 0.0022547140008848912, "phrase": "unobserved_heterogeneity_problems"}, {"score": 0.0021049977753042253, "phrase": "hausman-taylor_iv_model"}], "paper_keywords": ["Job search", " Internet recruitment", " Unemployment", " Germany", " South Korea", " Employment services", " Information searches"], "paper_abstract": "Purpose - This paper aims to estimate the impact of job search on the internet on the probability of re-employment and the duration of unemployment spells. Design/methodology/approach - The study uses national panel datasets from Germany (SOEP 2003-2007) and South Korea (KLIPS 1996-2006) to estimate probit and Hausman-Taylor IV models of the impact of job search on the internet on the probability of re-employment. The study also explores duration analysis with the aim of estimating the impact of internet job search on the duration of unemployment. Findings - In Germany and South Korea job seekers who used the internet had a 7.1 and 12.7 percentage point higher probability, respectively, of being re-employed in the next 12 months. Furthermore, job seekers who used the internet had a shorter duration of unemployment in both Germany and South Korea. Practical implications - Over the past decade, interne penetration rates and use of the interne in job search have risen sharply across the world. The internet has significantly changed the job application process and improved the channels of communication between employers and job seekers. The findings of the research indicate that the internet is beneficial and should be a part of job search efforts. Originality/value - The contribution of this study is twofold. It is the first study to use panel datasets to analyze the link between internet use and job search outcomes. Therefore, the results are robust to unobserved heterogeneity problems. The study also addresses the issue of endogeneity of job search on the internet by using the Hausman-Taylor IV model.", "paper_title": "Job search on the internet and its outcome", "paper_id": "WOS:000307611400003"}