{"auto_keywords": [{"score": 0.030923053106664926, "phrase": "high_groundwater_table"}, {"score": 0.00481495049065317, "phrase": "bukit_batok_slope"}, {"score": 0.004744018246633455, "phrase": "residual_soil_slope"}, {"score": 0.004697339522583428, "phrase": "singapore"}, {"score": 0.003834548373258131, "phrase": "average_shear_strength_parameters"}, {"score": 0.003778004256546193, "phrase": "residual_soils"}, {"score": 0.003192406091820197, "phrase": "rising_groundwater_table"}, {"score": 0.0029784342137867776, "phrase": "shallow_failure"}, {"score": 0.0027925723953701083, "phrase": "groundwater_table"}, {"score": 0.0027650234530228897, "phrase": "horizontal_drains"}, {"score": 0.002442693254693416, "phrase": "low_groundwater_table"}, {"score": 0.002168586864007222, "phrase": "routine_slope_designs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Two-dimensional", " Three-dimensional", " Limit equilibrium", " Slope stability", " Residual soil", " Unsaturated", " Matric suction", " Groundwater table", " Rainfall", " Factor of safety"], "paper_abstract": "A residual soil slope in Singapore that failed on two occasions, in 1989 and 1991, was reanalysed using two (20) and three-dimensional (3D) slope stability analyses. The geometry of the slope in 1989 differed from that in 1991. The 2D and 3D slope stability analyses on the slope that failed in 1989 showed that the average shear strength parameters of the residual soils are representative of the slope and the factors of safety obtained from 2D slope stability analyses are not necessarily more conservative than 3D slope stability analyses. The analyses also showed that the slope failed in 1989 due to rising groundwater table. The analyses of the slope in 1991 showed that the slope experienced shallow failure due to the high groundwater table. Analyses of the slope after lowering of groundwater table by horizontal drains showed that the factor of safety of the slope has improved tremendously. The differences in factors of safety for 2D and 3D slope stability analyses are greater for low groundwater table as compared with those for high groundwater table. The results illustrated how 3D slope stability analyses have become less daunting to perform and can be incorporated into routine slope designs. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Two and three-dimensional slope stability reanalyses of Bukit Batok slope", "paper_id": "WOS:000301912300008"}