{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "site-oriented_framework"}, {"score": 0.017253981544174693, "phrase": "page-oriented_framework"}, {"score": 0.00701310731957321, "phrase": "max-flow_based_method"}, {"score": 0.004722872607188402, "phrase": "mining_communities"}, {"score": 0.00442651096522781, "phrase": "well-known_ones"}, {"score": 0.004296998284839309, "phrase": "flake_et_al"}, {"score": 0.0037593521467237287, "phrase": "hits"}, {"score": 0.0032402142645120958, "phrase": "significantly_better_communities"}, {"score": 0.0021049977753042253, "phrase": "original_max-flow"}], "paper_keywords": ["web", " data mining", " site", " max-flow", " site-oriented framework"], "paper_abstract": "There are several methods for mining communities on the Web using hyperlinks. One of the well-known ones is a max-flow based method proposed by Flake et al. The method adopts a page-oriented framework, that is, it uses a page on the Web as a unit of information, like other methods including HITS and trawling. Recently, Asano et al. built a site-oriented framework which uses a site as a unit of information, and they experimentally showed that trawling on the site-oriented framework often outputs significantly better communities than trawling on the page-oriented framework. However, it has not been known whether the site-oriented framework is effective in mining communities through the max-flow based method. In this paper, we first point out several problems of the max-flow based method, mainly owing to the page-oriented framework, and then propose solutions to the problems by utilizing several advantages of the site-oriented framework. Computational experiments reveal that our max-flow based method on the site-oriented framework is very effective in mining communities, related to the topics of given pages, in comparison with the original max-flow based method on the page-oriented framework.", "paper_title": "Mining communities on the web using a max-flow and a site-oriented framework", "paper_id": "WOS:000241296100003"}