{"auto_keywords": [{"score": 0.04787831476853698, "phrase": "obo_ontologies"}, {"score": 0.00481495049065317, "phrase": "syntactic_patterns"}, {"score": 0.004766683200410046, "phrase": "umls_semantics"}, {"score": 0.004718897469501381, "phrase": "biomedical_ontologies"}, {"score": 0.004640311812502743, "phrase": "obo_disease_ontologies"}, {"score": 0.004517275498868226, "phrase": "different_domains"}, {"score": 0.0043533862892678864, "phrase": "ontology_alignment"}, {"score": 0.004266501496765747, "phrase": "consistent_biomedical_ontologies"}, {"score": 0.004223708778943785, "phrase": "standard_vocabularies"}, {"score": 0.004167315942319306, "phrase": "specific_domains"}, {"score": 0.0038314621564116192, "phrase": "relation_r"}, {"score": 0.003704797078215222, "phrase": "subsumption_relations"}, {"score": 0.003007498426064287, "phrase": "umls"}, {"score": 0.002917793073455365, "phrase": "syntactico-semantic_patterns"}, {"score": 0.00267335773670308, "phrase": "pato."}, {"score": 0.002628747284714371, "phrase": "equivalent_concepts"}, {"score": 0.00243291444168046, "phrase": "semantic_categorization"}, {"score": 0.0023053339328456234, "phrase": "umls_metathesaurus"}, {"score": 0.0022365262201954643, "phrase": "semantic_patterns"}, {"score": 0.0021770860717929192, "phrase": "semantic_relations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Ontology", " Alignment", " Lexical methods", " Patterns", " UMLS", " Medical ontologies", " OBO ontologies"], "paper_abstract": "The OBO ontologies include more than 50 standard vocabularies that cover different domains, including genomics, chemistry, anatomy and phenotype. Ontology alignment is a means to build consistent biomedical ontologies compatible with standard vocabularies and dedicated to specific domains, such as cancer. An alignment is defined as a set of pairs of concepts, coming from two ontologies, related by a relation R, R not being restricted to the equivalence or subsumption relations. Alignment is performed in three major steps: first, the concepts that are equivalent in the ontologies are identified; second the pairs of concepts that are related although not equivalent are searched for; third the relations between the concepts are characterized. We have developed a method to align ontologies that exploits the compositionality of the terms in OBO ontologies, uses the UMLS to provide synonyms and relations, and defines syntactico-semantic patterns that characterize semantically the relations between concepts. We have applied it to four OBO phenotype ontologies: mouse pathology, human disease, mammalian phenotype, and PATO. We found 386 pairs of equivalent concepts and 20,461 pairs of concepts where one concept name is included in the other term. Among the 20,460 inclusions, we were able to provide a semantic categorization for 2682 relations. In 2552 cases, the relation was present and semantically defined in the UMLS Metathesaurus, in 131 cases the relation was characterized through semantic patterns. Our approach may help to find the semantic relations between concepts in ontologies. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A method exploiting syntactic patterns and the UMLS semantics for aligning biomedical ontologies: The case of OBO disease ontologies", "paper_id": "WOS:000207730900006"}