{"auto_keywords": [{"score": 0.04925367071541478, "phrase": "dynamic_models"}, {"score": 0.04884608760304102, "phrase": "corresponding_physical_phenomena"}, {"score": 0.03406766854315252, "phrase": "dynamic_model"}, {"score": 0.00481495049065317, "phrase": "mixed_reality_approach"}, {"score": 0.004413846562278824, "phrase": "computer_simulation"}, {"score": 0.004375613460102577, "phrase": "key_parts"}, {"score": 0.004135010810625326, "phrase": "physical_phenomena"}, {"score": 0.004099183062034004, "phrase": "state_changes"}, {"score": 0.003613119346373748, "phrase": "automotive_engine"}, {"score": 0.0035199624440843892, "phrase": "cognitive_context"}, {"score": 0.0034742854447532678, "phrase": "diagrammatic_icon"}, {"score": 0.003340768341189764, "phrase": "typical_solution"}, {"score": 0.002831158147480665, "phrase": "physical_phenomenon"}, {"score": 0.002583597507349819, "phrase": "user_interaction"}, {"score": 0.002257070536352418, "phrase": "diagram-based_dynamic_models"}, {"score": 0.0021420294823879292, "phrase": "human_study"}, {"score": 0.0021049977753042253, "phrase": "spatial_cognition"}], "paper_keywords": ["Mixed reality", " modeling", " simulation", " human computer interaction"], "paper_abstract": "The design, visualization, manipulation, and implementation of models for computer simulation are key parts of the discipline. Models are constructed as a means to understand physical phenomena as state changes occur over time. One issue that arises is the need to correlate models and their components with the phenomena being modeled. For example, a part of an automotive engine needs to be placed into cognitive context with the diagrammatic icon that represents that part's function. A typical solution to this problem is to display a dynamic model of the engine in one window and the engine's CAD model in another. Users are expected to, on their own, mentally blend the dynamic model and the physical phenomenon into the same context. However, this contextualization is not trivial in many applications. Our approach expands upon this form of user interaction by specifying two ways in which dynamic models and the corresponding physical phenomena may be viewed, and experimented with, within the same human interaction space. We present a methodology and implementation of contextualization for diagram-based dynamic models using an anesthesia machine, and then follow up with a human study of its effects on spatial cognition.", "paper_title": "A Mixed Reality Approach for Interactively Blending Dynamic Models with Corresponding Physical Phenomena", "paper_id": "WOS:000284937900005"}