{"auto_keywords": [{"score": 0.04937491786272553, "phrase": "industrial_tubular_heat_exchanger_system"}, {"score": 0.03699754186071713, "phrase": "best_model"}, {"score": 0.00481495049065317, "phrase": "predictive_control_scheme"}, {"score": 0.004537804310268603, "phrase": "novel_intelligent_predictive_control_scheme"}, {"score": 0.0041515831652973794, "phrase": "operating_environments"}, {"score": 0.00403026082093352, "phrase": "wide_range"}, {"score": 0.0036327808996444904, "phrase": "linear_models"}, {"score": 0.003436169600453596, "phrase": "lgpc_control_action"}, {"score": 0.0032743731084995515, "phrase": "intelligent_decision_maker_scheme"}, {"score": 0.003120171161064748, "phrase": "finalized_control_action"}, {"score": 0.0028862231180242053, "phrase": "adaptive_algorithm"}, {"score": 0.0028017745468000587, "phrase": "corresponding_predictive_control_schemes"}, {"score": 0.002719790133195399, "phrase": "good_tracking_performance"}, {"score": 0.002689666606553487, "phrase": "predictive_control_action"}, {"score": 0.0024421501497321027, "phrase": "proposed_approach"}, {"score": 0.00222561197623787, "phrase": "wiener_model"}, {"score": 0.0021049977753042253, "phrase": "proposed_control_scheme"}], "paper_keywords": ["Fuzzy adaptive predictive control scheme", " Nonlinear generalized predictive control scheme", " Multiple models strategy", " Intelligent decision maker scheme", " Tubular heat exchanger system"], "paper_abstract": "The purpose of this paper is to deal with a novel intelligent predictive control scheme using the multiple models strategy with its application to an industrial tubular heat exchanger system. The main idea of the strategy proposed here is to represent the operating environments of the system, which have a wide range of variation in the span of time by several local explicit linear models. In line with this strategy, the well-known linear generalized predictive control (LGPC) schemes are initially designed corresponding to each one of the linear models of the system. After that, the best model of the system and the LGPC control action are precisely identified, at each instant of time, by an intelligent decision maker scheme (IDMS), which is playing the so important role in realizing the finalized control action for the system. In such a case, as soon as each model could be identified as the best model, the adaptive algorithm is implemented on the both chosen model and the corresponding predictive control schemes. In conclusion, for having a good tracking performance, the predictive control action is instantly updated and is also applied to the system, at each instant of time. In order to demonstrate the effectiveness of the proposed approach, simulations are carried out and the results are compared with those obtained using a nonlinear GPC (NLGPC) scheme as a benchmark approach realized based on the Wiener model of the system. In agreement with these results, the validity of the proposed control scheme can tangibly be verified.", "paper_title": "An intelligent multiple models based predictive control scheme with its application to industrial tubular heat exchanger system", "paper_id": "WOS:000286599700010"}