{"auto_keywords": [{"score": 0.04152395746218505, "phrase": "minimal_dominating_sets"}, {"score": 0.020192366968542208, "phrase": "line_graphs"}, {"score": 0.015552533248843845, "phrase": "flipping_method"}, {"score": 0.010612387000973441, "phrase": "minimal_edge"}, {"score": 0.00828891761883307, "phrase": "minimal_transversals"}, {"score": 0.0044747919503484055, "phrase": "incremental_polynomial_time"}, {"score": 0.004313793774439379, "phrase": "equivalent_problem"}, {"score": 0.004141663280057689, "phrase": "incremental_polynomial"}, {"score": 0.0035189057079817285, "phrase": "output_polynomial_time"}, {"score": 0.0034761488481944657, "phrase": "fundamental_and_challenging_question"}, {"score": 0.00332375606483146, "phrase": "extensive_research"}, {"score": 0.0030262967460085366, "phrase": "flipping_operation"}, {"score": 0.0029895074299598275, "phrase": "minimal_dominating_set"}, {"score": 0.0026452734009203764, "phrase": "consecutively_output_minimal_dominating_sets"}, {"score": 0.002508663916554954, "phrase": "input_graph"}, {"score": 0.0024182330686905256, "phrase": "already_generated_minimal_dominating_sets"}, {"score": 0.002274684393868218, "phrase": "bipartite_graphs"}, {"score": 0.0021483873642607738, "phrase": "large_girth"}, {"score": 0.0021049977753042253, "phrase": "incremental_polynomial_time_algorithm"}], "paper_keywords": ["Enumerations", " Minimal dominating sets", " Line graphs"], "paper_abstract": "We show that all minimal edge dominating sets of a graph can be generated in incremental polynomial time. We present an algorithm that solves the equivalent problem of enumerating minimal (vertex) dominating sets of line graphs in incremental polynomial, and consequently output polynomial, time. Enumeration of minimal dominating sets in graphs has recently been shown to be equivalent to enumeration of minimal transversals in hypergraphs. The question whether the minimal transversals of a hypergraph can be enumerated in output polynomial time is a fundamental and challenging question; it has been open for several decades and has triggered extensive research. To obtain our result, we present a flipping method to generate all minimal dominating sets of a graph. Its basic idea is to apply a flipping operation to a minimal dominating set to generate minimal dominating sets such that contains more edges than . We show that the flipping method works efficiently on line graphs, resulting in an algorithm with delay between each pair of consecutively output minimal dominating sets, where and are the numbers of vertices and edges of the input graph, respectively, and is the set of already generated minimal dominating sets. Furthermore, we are able to improve the delay to on line graphs of bipartite graphs. Finally we show that the flipping method is also efficient on graphs of large girth, resulting in an incremental polynomial time algorithm to enumerate the minimal dominating sets of graphs of girth at least 7.", "paper_title": "An Incremental Polynomial Time Algorithm to Enumerate All Minimal Edge Dominating Sets", "paper_id": "WOS:000355939800008"}