{"auto_keywords": [{"score": 0.049435104149514096, "phrase": "undergraduate_students"}, {"score": 0.014159025308478223, "phrase": "purposefully_designed_intervention"}, {"score": 0.013858286308329118, "phrase": "database_searching"}, {"score": 0.00481495049065317, "phrase": "information_search"}, {"score": 0.004635765943321778, "phrase": "long-term_impact"}, {"score": 0.00459824135341107, "phrase": "electronic_information_skills"}, {"score": 0.0045240968219563225, "phrase": "student_information"}, {"score": 0.004403158130041613, "phrase": "second-year_undergraduate_radiography_students"}, {"score": 0.004367508141547766, "phrase": "eis_intervention"}, {"score": 0.0041935232812319295, "phrase": "internet_sources"}, {"score": 0.004114709438935832, "phrase": "literature_review"}, {"score": 0.004004686288045183, "phrase": "questionnaire"}, {"score": 0.0037933088900625822, "phrase": "four-point_scale"}, {"score": 0.003772793879444995, "phrase": "self-reported_frequency"}, {"score": 0.0034685865622700435, "phrase": "library_catalogue"}, {"score": 0.0034498216366236015, "phrase": "open_questions"}, {"score": 0.003394131704039811, "phrase": "criteria_students"}, {"score": 0.003357503738345204, "phrase": "internet_information"}, {"score": 0.0033032991393331787, "phrase": "search_engines"}, {"score": 0.003128838753643307, "phrase": "university_assignments"}, {"score": 0.0028764048059439205, "phrase": "routine_part"}, {"score": 0.002252880693912436, "phrase": "students'_abilities"}, {"score": 0.002216469817316079, "phrase": "high_quality_relevant_information_resources"}, {"score": 0.0021688337445559, "phrase": "independent_learning_activities"}, {"score": 0.002139581380750111, "phrase": "graduate_health_practitioners"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["databases", " information retrieval", " informatics", " internet", " education", " learning", " universities", " world wide web"], "paper_abstract": "Aim: To investigate the short- and long-term impact of the Electronic Information Skills (EIS) Intervention on student information searching and evaluation behaviour. Method: Participants were second-year undergraduate radiography students. The EIS Intervention was a purposefully designed intervention with its knowledge construction activities aimed at engaging students with database searching and evaluation of internet sources as these were identified from the literature review as areas that are poorly developed in undergraduate students. Questionnaire was used to document the information searching and internet evaluation behaviour of the students pre-, post- and 1-year post-involvement in the EIS Intervention. Information search behaviour was assessed using a four-point scale of self-reported frequency of searching: always, usually (>1/2 the time), sometimes (<1/2 the time) and rarely, for the following electronic resources: internet, databases and library catalogue. Open questions were used to determine the criteria students used to evaluate internet information and to identify which databases and search engines they used. Results: Pre-intervention, 83% of students always or usually searched the internet for university assignments and projects compared with 53% for databases. This frequency of database searching by students increased to 93% post-intervention and remained high 1-year post-intervention (100%). Internet searching continued to be a routine part of student search process post- (73%) and 1-year post-intervention (79%). The number of students searching more than one database increased from 39% pre- to 96% post-intervention. Pre-intervention 62% of students listed one criterion that they used to evaluate information retrieved from the internet and no students named three or more criteria. Post-intervention and 1-year post-intervention 69% and 80%, respectively, listed 3 or more criteria they used to evaluate information retrieved from the internet. Conclusion: This research demonstrates that a purposefully designed intervention, the EIS Intervention, can be used to transform information searching and information evaluation behaviour. This transformation supports students' abilities to autonomously search and obtain high quality relevant information resources to meet their learning needs as they engage in independent learning activities as undergraduate students and as graduate health practitioners. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Transforming information search and evaluation practices of undergraduate students", "paper_id": "WOS:000257978900003"}