{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "general_systems"}, {"score": 0.013424007996596224, "phrase": "organization's_behavior"}, {"score": 0.009298410685750196, "phrase": "trfm"}, {"score": 0.004350308086118336, "phrase": "relationship_flows"}, {"score": 0.004287680323820891, "phrase": "structural_theory"}, {"score": 0.003958937342925219, "phrase": "information_flow"}, {"score": 0.00393032656248792, "phrase": "matter_flow"}, {"score": 0.0039019217388438134, "phrase": "energy_flow"}, {"score": 0.0038737214010638745, "phrase": "fund_flow"}, {"score": 0.003350480663660326, "phrase": "so-called_basic_level_h-d"}, {"score": 0.002961519813246521, "phrase": "innovative_concept"}, {"score": 0.0027943943921568456, "phrase": "underlying_model"}, {"score": 0.002542642270762272, "phrase": "pertinent_relationships"}, {"score": 0.0024430651605100214, "phrase": "theoretical_perspective"}, {"score": 0.0023817332409567403, "phrase": "unified_theoretical_foundation"}, {"score": 0.0022884433286785165, "phrase": "exact_science"}, {"score": 0.002255431275670053, "phrase": "practical_front"}, {"score": 0.00217496508306238, "phrase": "better_understanding"}], "paper_keywords": ["organization", " relationship flow", " TRFM", " management science", " system science"], "paper_abstract": "This paper aims to search for the fundamentals of management. Based on the concept of relationship flows and applying the structural theory of general systems, we study the relationships and their laws between an organization's behavior and the relationship flows of the organization, including information flow, matter flow, energy flow, fund flow, personnel flow, etc. and derive two theorems and propose a model. The theorems show that the behavior of an organization is determined and governed only by the organization's input flow Rf(t) and all its relationship flows Rf(Ord)(t) at the so-called basic level H-d, i.e. the total relationship flow TRf(t) = Rf(t) U Rf(Ord)(t); especially by the relationship flow cycle(s) in TRf(t). We thus present in this paper an innovative concept and idea of management, namely total relationship flow management (TRFM). The underlying model of TRFM involves a series of relationships and their laws between an organization's behavior and its total relationship flow. By performing further mathematical analysis of the model, we deduce the pertinent relationships and their laws, as well as their derivatives. From a theoretical perspective, our results help to establish a unified theoretical foundation and framework for management and develop management to become an exact science. On the practical front, our findings are helpful for managers to gain a better understanding of the fundamentals of management and to improve their management performance.", "paper_title": "The structural theory of general systems applied in management: the total relationship flow management theorems", "paper_id": "WOS:000251144200003"}