{"auto_keywords": [{"score": 0.033148814747548876, "phrase": "constant_number"}, {"score": 0.015719716506582538, "phrase": "query_complexity"}, {"score": 0.012779406442995179, "phrase": "space_complexity"}, {"score": 0.004790756351382389, "phrase": "combinatorial_property_testing_deals"}, {"score": 0.004730799017074255, "phrase": "decision_problems"}, {"score": 0.004683371330233808, "phrase": "fixed_property"}, {"score": 0.004397487039229447, "phrase": "main_focus"}, {"score": 0.0043753813457279404, "phrase": "property_testing"}, {"score": 0.004331501320993783, "phrase": "large_families"}, {"score": 0.004118587636081584, "phrase": "nearly_no_general_results"}, {"score": 0.0040978781692373005, "phrase": "standard_complexity_measures"}, {"score": 0.0033156708990372047, "phrase": "testing_languages"}, {"score": 0.00317648284060926, "phrase": "regular_language"}, {"score": 0.002764899920492989, "phrase": "newman"}, {"score": 0.0026891491143652083, "phrase": "exponential_gap"}, {"score": 0.0026487293624964997, "phrase": "special_case"}, {"score": 0.0023287359930308864, "phrase": "testable_properties"}, {"score": 0.0022879364955824153, "phrase": "context-free_languages"}, {"score": 0.002208464681793994, "phrase": "testable_languages"}, {"score": 0.002164295134968241, "phrase": "single_counter_machines"}, {"score": 0.0021049977753042253, "phrase": "finite_automata"}], "paper_keywords": [""], "paper_abstract": "Combinatorial property testing deals with the following relaxation of decision problems: Given a fixed property and an input x, one wants to decide whether x satisfies the property or is \"far\" from satisfying it. The main focus of property testing is in identifying large families of properties that can be tested with a certain number of queries to the input. Unfortunately, there are nearly no general results connecting standard complexity measures of languages with the hardness of testing them. In this paper we study the relation between the space complexity of a language and its query complexity. Our main result is that for any space complexity s(n) <= log n there is a language with space complexity O(s(n)) and query complexity 2(Omega(s(n))). We conjecture that this exponential lower bound is best possible, namely that the query complexity of a languages is at most exponential in its space complexity. Our result has implications with respect to testing languages accepted by certain restricted machines. Alon et al. [FOCS 1999] have shown that any regular language is testable with a constant number of queries. It is well known that any language in space o(log log n) is regular, thus implying that such languages can be so tested. It was previously known that there are languages in space O(log n) which are not testable with a constant number of queries and Newman [FOCS 2000] raised the question of closing the exponential gap between these two results. A special case of our main result resolves this problem as it implies that there is a language in space 0(log log n) that is not testable with a constant number of queries, thus showing that the o(log log n) bound is best possible. It was also previously known that the class of testable properties cannot be extended to all context-free languages. We further show that one cannot even extend the family of testable languages to the class of languages accepted by single counter machines which is perhaps the weakest (uniform) computational model that is strictly stronger than finite automata.", "paper_title": "Space complexity vs. query complexity", "paper_id": "WOS:000240348600037"}