{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "artificial_pets"}, {"score": 0.006479245147455166, "phrase": "companionship_scale"}, {"score": 0.004447600571127578, "phrase": "emotional_attachments"}, {"score": 0.00436530211426514, "phrase": "long-term_interaction"}, {"score": 0.004101586798219438, "phrase": "psychological_satisfaction"}, {"score": 0.0040890178236849825, "phrase": "crucial_factor"}, {"score": 0.003848088904418221, "phrase": "suitable_scale"}, {"score": 0.0035376693476114733, "phrase": "companionship_features"}, {"score": 0.003504756881063581, "phrase": "real_pets"}, {"score": 0.003472149546470424, "phrase": "human_companionship"}, {"score": 0.0028133741785871867, "phrase": "companionship_functions"}, {"score": 0.002787181295054319, "phrase": "discriminant_analysis"}, {"score": 0.0026722904884984348, "phrase": "key_factor"}, {"score": 0.002456486927713543, "phrase": "companionship_function"}, {"score": 0.002388487669097511, "phrase": "overall_reliability"}, {"score": 0.0023551955270737215, "phrase": "csap"}, {"score": 0.002226592967032469, "phrase": "companionship_levels"}, {"score": 0.0021049977753042253, "phrase": "relevant_industries"}], "paper_keywords": ["artificial intelligence", " psychology", " interaction design"], "paper_abstract": "Artificial pets are accepted worldwide. Some users even establish relationships with or develop emotional attachments to artificial pets after long-term interaction; such relationships can benefit the lives of users. Companionship is a crucial factor that encourages users to continue interacting with artificial pets; however, a suitable scale for measuring the companionship between users and artificial pets has not yet been developed. Based on the companionship features of real pets, human companionship and companionship features of artificial pets, a companionship scale for artificial pets (CSAP) was developed. This scale comprises 34 items, including the 3 factors of enjoyment, psychological satisfaction and responsibility, which benefit the development of companionship. These factors were adopted to identify companionship functions through discriminant analysis. The results indicated that psychological satisfaction is the key factor that influences the level of companionship provided by artificial pets, In addition, the accuracy of the companionship function was 71.3%, and the overall reliability of the CSAP was 0.951. This scale can be used to compare the companionship levels offered by various artificial pets and suggest designs and improvements for artificial pets in relevant industries.", "paper_title": "The Development of a Companionship Scale for Artificial Pets", "paper_id": "WOS:000350210100007"}