{"auto_keywords": [{"score": 0.04893638421315736, "phrase": "different_inlet_particle_concentrations"}, {"score": 0.015719716506582524, "phrase": "separation_characteristics"}, {"score": 0.01316925139836793, "phrase": "inlet_particle_concentration"}, {"score": 0.004413846562278824, "phrase": "simplified_eulerian_model"}, {"score": 0.003987755561492638, "phrase": "particle-particle_interaction"}, {"score": 0.0036908381347418805, "phrase": "present_work"}, {"score": 0.0036026484429137998, "phrase": "different_size"}, {"score": 0.0035679633126097115, "phrase": "different_phase"}, {"score": 0.0034826993555190765, "phrase": "collision_coefficient"}, {"score": 0.003254610758550934, "phrase": "asmm"}, {"score": 0.0030267296900520217, "phrase": "full_eulerian_model"}, {"score": 0.002968695624366393, "phrase": "higher_inlet_particle_concentration"}, {"score": 0.00269475174341129, "phrase": "calculated_results"}, {"score": 0.0025673856614952854, "phrase": "practical_ones"}, {"score": 0.0021049977753042253, "phrase": "practical_applications"}], "paper_keywords": ["cyclone", " inlet particle concentration", " separation characteristics", " numerical study"], "paper_abstract": "Numerical studies were conducted for different inlet particle concentrations of a cyclone. The simplified Eulerian model-Algebraic Slip Mixture Model (ASMM) was used for different inlet particle concentrations. With the increase of the inlet particle concentration, particle-particle interaction becomes important. ASMM can take into account this effect in this condition. The present work considered the particle of different size as different phase, and obtained a collision coefficient by experiment when considering the interaction between particles. The advantage of the ASMM is that this model can save a lot of calculating time comparing with the full Eulerian model. However, higher inlet particle concentration will result in the agglomeration between particles deduced by some mechanisms. In point of this fact, the calculated results based on ASMM have some differences comparing with the practical ones. Therefore, this model still has some discrepancies which plead for further improvement. In spite of this fact, this model can be used to analyze the effect of the inlet particle concentration on the separation characteristics of the cyclone qualitatively in practical applications. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Numerical study of the separation characteristics in a cyclone of different inlet particle concentrations", "paper_id": "WOS:000247812500011"}