{"auto_keywords": [{"score": 0.03870719807060688, "phrase": "time_resolution"}, {"score": 0.00481495049065317, "phrase": "high-performance_multi-channel_counter"}, {"score": 0.004752873752686246, "phrase": "high-performance_configurable_multi-channel_counter"}, {"score": 0.002939202022371694, "phrase": "photon_counting_applications"}, {"score": 0.0029012378668247397, "phrase": "spad_arrays"}, {"score": 0.002766171878646582, "phrase": "collected_counting_results"}, {"score": 0.0024820711838337713, "phrase": "entire_acquisition_process"}, {"score": 0.0024078737745407614, "phrase": "even_higher_degree"}, {"score": 0.002335889180060105, "phrase": "theoretical_model"}, {"score": 0.002315719347244451, "phrase": "general_use"}, {"score": 0.002266051712795851, "phrase": "overall_system_performance"}, {"score": 0.0021604924928015283, "phrase": "reported_experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Counting circuits", " Digital measurements", " Digital signal processors", " Digital systems", " Field programmable gate arrays"], "paper_abstract": "A high-performance configurable multi-channel counter is presented. The system has been implemented on a small-size and low-cost Commercial-Off-The-Shelf (COTS) FPGA/DSP-based board, and features 64 input channels, a maximum counting rate of 45 MHz, and a minimum integration window (time resolution) of 24 mu s with a 23 b counting depth. In particular, the time resolution depends on both the selected counting bit-depth and the number of acquisition channels: indeed, with a 8 b counting depth, the time resolution reaches the value of 8 mu s if all the 64 input channels are enabled, whereas it lowers to 378 ns if only 2 channels are used. Thanks to its flexible architecture and performance, the system is suitable in highly demanding photon counting applications based on SPAD arrays, as well as in many other scientific experiments. Moreover, the collected counting results are both real-time processed and transmitted over a high-speed IEEE 1394 serial link. The same link is used to remotely set up and control the entire acquisition process, thus giving the system a even higher degree of flexibility. Finally, a theoretical model of general use which immediately provides the overall system performance is described. The model is then validated by the reported experimental results. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "FPGA/DSP-based implementation of a high-performance multi-channel counter", "paper_id": "WOS:000267390200002"}