{"auto_keywords": [{"score": 0.03651700477162455, "phrase": "individual_fibres"}, {"score": 0.031763843900136826, "phrase": "graspability_analysis"}, {"score": 0.00481495049065317, "phrase": "paper_fibres"}, {"score": 0.004692980391580608, "phrase": "automatic_computer_vision_algorithm"}, {"score": 0.004621279527317074, "phrase": "individual_paper_fibres"}, {"score": 0.004367581653370531, "phrase": "detected_fibres"}, {"score": 0.004235095881928715, "phrase": "suitable_grasping_points"}, {"score": 0.003982011128052839, "phrase": "automatic_fibre_manipulation"}, {"score": 0.003941319912895672, "phrase": "mechanical_characterisation"}, {"score": 0.0038217146888983576, "phrase": "slow_manual_work"}, {"score": 0.0035201528214608914, "phrase": "proper_grasp_points"}, {"score": 0.002955782731675529, "phrase": "calculated_grasp_points"}, {"score": 0.0028659990472580154, "phrase": "experienced_human_operator"}, {"score": 0.002708399936381754, "phrase": "detection_results"}, {"score": 0.0024062532032402533, "phrase": "average_distance"}, {"score": 0.0023694065215394593, "phrase": "grasp_points"}, {"score": 0.0021049977753042253, "phrase": "human_choices"}], "paper_keywords": [""], "paper_abstract": "An automatic computer vision algorithm that detects individual paper fibres from an image, assesses the possibility of grasping the detected fibres with microgrippers and detects the suitable grasping points is presented. The goal of the algorithm is to enable automatic fibre manipulation for mechanical characterisation, which has traditionally been slow manual work. The algorithm classifies the objects in images based on their morphology, and detects the proper grasp points from the individual fibres by applying given geometrical constraints. The authors test the ability of the algorithm to detect the individual fibres with 35 images containing more than 500 fibres in total, and also compare the graspability analysis and the calculated grasp points with the results of an experienced human operator with 15 images that contain a total of almost 200 fibres. The detection results are outstanding, with fewer than 1% of fibres missed. The graspability analysis gives sensitivity of 0.83 and specificity of 0.92, and the average distance between the grasp points of the human and the algorithm is 220 mu m. Also, the choices made by the algorithm are much more consistent than the human choices.", "paper_title": "Automatic image-based detection and inspection of paper fibres for grasping", "paper_id": "WOS:000359605600015"}