{"auto_keywords": [{"score": 0.041725522589024386, "phrase": "domain-specific_wdbs'_forms"}, {"score": 0.008076709454770127, "phrase": "coverage_rate"}, {"score": 0.00481495049065317, "phrase": "domain-specific_deep_web_databases"}, {"score": 0.004591202593942391, "phrase": "rich_and_high_quality_information"}, {"score": 0.004531997388646422, "phrase": "deep_web_databases"}, {"score": 0.0042656009036320585, "phrase": "domain-specific_wdbs'_entry_points"}, {"score": 0.004014800383343256, "phrase": "challenging_task"}, {"score": 0.00374610869916551, "phrase": "significant_efforts"}, {"score": 0.003261295948815592, "phrase": "enhanced_form-focused_crawler"}, {"score": 0.0032331613500559764, "phrase": "domain-specific_wdbs"}, {"score": 0.00308269056870936, "phrase": "novel_framework"}, {"score": 0.0030428787018636147, "phrase": "existing_solutions'_limitations"}, {"score": 0.002754208576828914, "phrase": "two-step_page_classifier"}, {"score": 0.0026146109167103655, "phrase": "domain-specific_forms"}, {"score": 0.0024820711838337713, "phrase": "optimized_harvest_rate"}, {"score": 0.0023257824499250653, "phrase": "real_web_pages"}, {"score": 0.0022758994740331258, "phrase": "representative_domains"}, {"score": 0.0021511430180912164, "phrase": "existing_domain-specific_deep_web_form-focused_crawlers"}, {"score": 0.0021049977753042253, "phrase": "harvest_rate"}], "paper_keywords": ["Deep Web Databases (WDBs)", " Form-Focused Crawler (FFC)", " Harvest rate", " Coverage rate"], "paper_abstract": "A key problem of retrieving, integrating and mining rich and high quality information from massive Deep Web Databases (WDBs) online is how to automatically and effectively discover and recognize domain-specific WDBs' entry points, i.e., forms, in the Web. It has been a challenging task because domain-specific WDBs' forms with dynamic and heterogeneous properties are very sparsely distributed over several trillion Web pages. Although significant efforts have been made to address the problem and its special cases, more effective solutions remain to be further explored towards achieving both the satisfactory harvest rate and coverage rate of domain-specific WDBs' forms simultaneously. In this paper, an Enhanced Form-Focused Crawler for domain-specific WDBs (E-FFC) has been proposed as a novel framework to address existing solutions' limitations. The E-FFC, based on the divide and conquer strategy, employs a series of novel and effective strategies/algorithms, including a two-step page classifier, a link scoring strategy, classifiers for advanced searchable and domain-specific forms, crawling stopping criteria, etc. to its end achieving the optimized harvest rate and coverage rate of domain-specific WDBs' forms simultaneously. Experiments of the E-FFC over a number of real Web pages in a set of representative domains have been conducted and the results show that the E-FFC outperforms the existing domain-specific Deep Web Form-Focused Crawlers in terms of the harvest rate, coverage rate and crawling robustness.", "paper_title": "E-FFC: an enhanced form-focused crawler for domain-specific deep web databases", "paper_id": "WOS:000313657900008"}