{"auto_keywords": [{"score": 0.0329235942341221, "phrase": "scorm."}, {"score": 0.015719721124940293, "phrase": "scorm"}, {"score": 0.015548617796651919, "phrase": "web_service_architecture"}, {"score": 0.012487398913157168, "phrase": "different_versions"}, {"score": 0.01173389657937066, "phrase": "distance_education"}, {"score": 0.010904914338388772, "phrase": "lms"}, {"score": 0.009010637910673336, "phrase": "abstract_layer"}, {"score": 0.004456044928556639, "phrase": "extensible_framework"}, {"score": 0.004342443305995853, "phrase": "e-learning"}, {"score": 0.004093453936415085, "phrase": "learning_management_system"}, {"score": 0.00395970654908854, "phrase": "different_data_model"}, {"score": 0.00388729255686046, "phrase": "learning_contents"}, {"score": 0.0037881238886444332, "phrase": "authoring_tool"}, {"score": 0.0036373553416391823, "phrase": "increasing_tools"}, {"score": 0.0036105923401756126, "phrase": "content_development_budget"}, {"score": 0.0034160263294684785, "phrase": "public_accepted_data_model"}, {"score": 0.003243871564587106, "phrase": "current_existing_distance_education_applications"}, {"score": 0.003069006373093756, "phrase": "existing_e-learning_applications"}, {"score": 0.002903540062437197, "phrase": "major_obstacle"}, {"score": 0.00266693888510356, "phrase": "novel_standard"}, {"score": 0.0024677487011556427, "phrase": "quick_adoption"}, {"score": 0.0024405312482831646, "phrase": "new_standard"}, {"score": 0.0022005118194652704, "phrase": "e-learning_standard"}, {"score": 0.0021049977753042253, "phrase": "scorm-compliant_run-time_environment"}], "paper_keywords": ["Web Service", " Learning Management System (LMS)", " E-Leaming", " SCORM"], "paper_abstract": "In this paper, we focus on how to adopt the advantages of Web Service architecture to construct extensible framework for not only new Sharable Content Object Reference Model (SCORM) platforms but also those old E-Learning systems and applications. Currently, a lot of learning contents built for delivering via Learning Management System (LMS) are not sharable due to different data model and specifications. These learning contents are not durable because different versions of authoring tool may produce different versions of courseware. These issues result in increasing tools and content development budget for distance education. Fortunately, SCORM was introduced to solve these issues by providing public accepted data model and specifications for learning content and LMS in 1997. However, for current existing distance education applications and systems do not understand the meta-data which proposed by SCORM. It means those existing E-Learning applications and systems need to be redesigned again to conform to SCORM. This becomes a major obstacle to the adoption of SCORM. Furthermore, we believe that there should be an abstract layer for applications and systems to adopt the novel standard of distance education such as SCORM. Since SCORM came into E-Learning, many applications and systems have been developed just for the quick adoption of this new standard. Our proposed SCORM Compliant Web Service APIs assist to efficiently develop extensible applications and systems. Therefore, the abstract layer of between applications and systems deems very important to the evolution of E-Learning standard. Finally, we demonstrate the LMS based on our proposed framework and SCORM-compliant run-time environment on mobile devices platforms.", "paper_title": "A cross domain framework for SCORM based on Web Service architecture", "paper_id": "WOS:000257602500005"}