{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_mesh_networks"}, {"score": 0.049418985040378574, "phrase": "multi-hop_wireless_networks"}, {"score": 0.037968646320562176, "phrase": "scheduling_algorithms"}, {"score": 0.00478163886605204, "phrase": "scheduling_mac-layer_transmissions"}, {"score": 0.0046993598473345395, "phrase": "active_and_stimulating_area"}, {"score": 0.004491970050862321, "phrase": "problem_space"}, {"score": 0.004249188865832993, "phrase": "vehicular_ad-hoc"}, {"score": 0.003366662001961897, "phrase": "solution_technique"}, {"score": 0.0032971676471625646, "phrase": "different_scheduling_algorithms"}, {"score": 0.0032516342542969387, "phrase": "classification_framework"}, {"score": 0.0031845067058084583, "phrase": "state-of-the-art_scheduling_mechanisms"}, {"score": 0.0031187606191012012, "phrase": "multi-radio_wireless_mesh_networks"}, {"score": 0.0030437652050982617, "phrase": "wimax_mesh_networks"}, {"score": 0.0030226700832113942, "phrase": "long_distance_mesh_networks"}, {"score": 0.0030017207229983385, "phrase": "vehicular_ad-hoc_networks"}, {"score": 0.0029295314433077134, "phrase": "scheduling_data"}, {"score": 0.002869034325496957, "phrase": "video_traffic"}, {"score": 0.002723186210025975, "phrase": "individual_mechanisms"}, {"score": 0.0024963543716522087, "phrase": "wireless_mesh_network"}, {"score": 0.002272501735900584, "phrase": "wireless_multi-hop"}, {"score": 0.002233301265743633, "phrase": "wireless_mesh"}, {"score": 0.0021871503075921537, "phrase": "desirable_properties"}, {"score": 0.002164432930854161, "phrase": "scheduling_mechanism"}, {"score": 0.0021049977753042253, "phrase": "open_research_issues"}], "paper_keywords": ["Scheduling algorithms", " wireless mesh networks", " classification dimensions"], "paper_abstract": "Scheduling MAC-layer transmissions in multi-hop wireless networks is an active and stimulating area of research. There are several interesting algorithms proposed in the literature in the problem space of scheduling for multi-hop wireless networks, specifically for (a) WiMAX mesh networks, (b) long distance multi-hop WiFi networks, and (c) Vehicular Ad-hoc Networks (VANETs). In general, these algorithms have several dimensions in terms of the assumptions made, the input space considered and the solution space generated. In this context, the goal of this survey is three-fold. Firstly, we classify the scheduling algorithms proposed in the literature based on following parameters: problem setting, problem goal, type of inputs and solution technique. Secondly, we describe different scheduling algorithms based on this classification framework. We specifically cover the state-of-the-art scheduling mechanisms proposed for generic multichannel, multi-radio wireless mesh networks and in particular scheduling algorithms for WiMAX mesh networks, long distance mesh networks and vehicular ad-hoc networks. We describe scheduling algorithms which consider scheduling data, voice as well as video traffic. Finally, we compare these algorithms based on our classification parameters. We also critique individual mechanisms and point out the practicality and the limitations, wherever applicable. We observe that, the literature in the domain of scheduling for wireless mesh network is quite extensive, in terms of depth as well as breadth. Our classification framework helps in understanding the pros and cons of various aspects of scheduling for wireless multi-hop (popularly known as wireless mesh) networks. We also list desirable properties of any scheduling mechanism and use our classification framework to point out the open research issues in the space of scheduling for wireless mesh networks.", "paper_title": "A Classification Framework for Scheduling Algorithms in Wireless Mesh Networks", "paper_id": "WOS:000317574100012"}