{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "longest_path"}, {"score": 0.004773040022691547, "phrase": "inherently_fuzzy_data"}, {"score": 0.004431149592844886, "phrase": "obvious_task"}, {"score": 0.004149792080414689, "phrase": "higher_speeds"}, {"score": 0.003818807671883534, "phrase": "indoor_mot_test"}, {"score": 0.003687439449869248, "phrase": "cab_run"}, {"score": 0.003423042581201533, "phrase": "drive_wheels"}, {"score": 0.003378385493203297, "phrase": "indoor_measure"}, {"score": 0.0030148941188459987, "phrase": "modern_vehicles"}, {"score": 0.0029886047149545025, "phrase": "driving_aids"}, {"score": 0.0024007585788965655, "phrase": "discretionary_circuit"}, {"score": 0.0022678201262721323, "phrase": "gps_data"}, {"score": 0.0021801135036476136, "phrase": "genetic_and_fuzzy_techniques"}, {"score": 0.0021049977753042253, "phrase": "raw_data"}], "paper_keywords": [""], "paper_abstract": "Measuring the length of a path that a taxi must fare is an obvious task: when driving lower than certain speed threshold the fare is time dependent, but at higher speeds the length of the path is measured, and the fare depends on such measure. When passing an indoor MOT test, the taximeter is calibrated simulating a cab run, while the taxi is placed on a device equipped with four rotating steel cylinders in touch with the drive wheels. This indoor measure might be inaccurate, as the information given by the cylinders is affected by tires inflating pressure, and only straight trajectories are tested. Moreover, modern vehicles with driving aids such as ABS, ESP or TCS might have their electronics damaged in the test, since two wheels are spinning while the others are not. To surpass these problems, we have designed a small, portable GPS sensor that periodically logs the coordinates of the vehicle and computes the length of a discretionary circuit. We will show that all the legal issues with the tolerance of such a procedure (GPS data are inherently imprecise) can be overcome if genetic and fuzzy techniques are used to process and analyze the raw data.", "paper_title": "Genetic algorithms for estimating longest path from inherently fuzzy data acquired with GPS", "paper_id": "WOS:000241790900028"}