{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "numeric_data_analysis._clustering"}, {"score": 0.004737579882204798, "phrase": "data_analysis_technique"}, {"score": 0.004392565073466714, "phrase": "partitional_clustering_algorithms"}, {"score": 0.0041840994704406866, "phrase": "initial_partition"}, {"score": 0.00385832528624328, "phrase": "numeric_data_analysis"}, {"score": 0.0036159990127332315, "phrase": "maximal_frequent_item-set_discovery"}, {"score": 0.0034442607586033657, "phrase": "k_and_the_initial_cluster_\"attractors"}, {"score": 0.003245359940011418, "phrase": "distance_measure"}, {"score": 0.0031417377608722, "phrase": "high_precision"}, {"score": 0.003074495313651187, "phrase": "initial_attractors"}, {"score": 0.0028348690177346448, "phrase": "farthestfirst"}, {"score": 0.0027443174539994925, "phrase": "compared_results"}, {"score": 0.0026280534600940137, "phrase": "convergence_speed"}, {"score": 0.002599763359352916, "phrase": "cluster_formation_quality"}, {"score": 0.0021049977753042253, "phrase": "algorithm's_accuracy"}], "paper_keywords": [""], "paper_abstract": "Clustering is a data analysis technique, particularly useful when there are many dimensions and little prior information about the data. Partitional clustering algorithms are efficient but suffer from sensitivity to the initial partition and noise. We propose here k-attractors, a partitional clustering algorithm tailored to numeric data analysis. As a preprocessing (initialization) step, it uses maximal frequent item-set discovery and partitioning to define the number of clusters k and the initial cluster \"attractors.'' During its main phase the algorithm uses a distance measure, which is adapted with high precision to the way initial attractors are determined. We applied k-attractors as well as k-means, EM, and FarthestFirst clustering algorithms to several datasets and compared results. Comparison favored k-attractors in terms of convergence speed and cluster formation quality in most cases, as it outperforms these three algorithms except from cases of datasets with very small cardinality containing only a few frequent item sets. On the downside, its initialization phase adds an overhead that can be deemed acceptable only when it contributes significantly to the algorithm's accuracy.", "paper_title": "k-ATTRACTORS: A PARTITIONAL CLUSTERING ALGORITHM FOR NUMERIC DATA ANALYSIS", "paper_id": "WOS:000287439000001"}