{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "upheaval"}, {"score": 0.004537254814246843, "phrase": "microprocessor_design"}, {"score": 0.004345363360869553, "phrase": "chip_power"}, {"score": 0.004298666679374568, "phrase": "wire_latency"}, {"score": 0.004116823963855969, "phrase": "multicore_processors"}, {"score": 0.003964007795174772, "phrase": "entirely_new_software_landscape"}, {"score": 0.003370565320453525, "phrase": "microarchitecture_design"}, {"score": 0.0033163269450817716, "phrase": "narrow_software_context"}, {"score": 0.0032806521851034766, "phrase": "native_sequential_spec_cpu_benchmarks"}, {"score": 0.0024495111090152857, "phrase": "native_sequential_workloads"}, {"score": 0.0023970487263732737, "phrase": "managed_workloads"}, {"score": 0.0023712394008737958, "phrase": "even_native_parallel_workloads"}, {"score": 0.0023079225317714815, "phrase": "diverse_application_power_profiles"}, {"score": 0.002270745003370529, "phrase": "future_applications"}, {"score": 0.002246292543825748, "phrase": "system_software"}, {"score": 0.0021745003291048356, "phrase": "power_optimization"}], "paper_keywords": [""], "paper_abstract": "The past 10 years have delivered two significant revolutions. (1) Microprocessor design has been transformed by the limits of chip power, wire latency, and Dennard scaling-leading to multicore processors and heterogeneity. (2) Managed languages and an entirely new software landscape emerged-revolutionizing how software is deployed, is sold, and interacts with hardware. Researchers most often examine these changes in isolation. Architects mostly grapple with microarchitecture design through the narrow software context of native sequential SPEC CPU benchmarks, while language researchers mostly consider microarchitecture in terms of performance alone. This work explores the clash of these two revolutions over the past decade by measuring power, performance, energy, and scaling, and considers what the results may mean for the future. Our diverse findings include the following: (a) native sequential workloads do not approximate managed workloads or even native parallel workloads; (b) diverse application power profiles suggest that future applications and system software will need to participate in power optimization and management; and (c) software and hardware researchers need access to real measurements to optimize for power and energy.", "paper_title": "Looking Back and Looking Forward: Power, Performance, and Upheaval", "paper_id": "WOS:000306310900031"}