{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml_sequence_diagrams"}, {"score": 0.0044052452943364314, "phrase": "model_elements"}, {"score": 0.004260719592945006, "phrase": "diagram_semantics"}, {"score": 0.00418247778205288, "phrase": "main_goal"}, {"score": 0.0032987614613108345, "phrase": "ctml"}, {"score": 0.0030970990565391183, "phrase": "meta-analysis_study"}, {"score": 0.0030514638431036714, "phrase": "different_data_samples"}, {"score": 0.002995361424576051, "phrase": "statistical_analysis"}, {"score": 0.0028121943702224326, "phrase": "proposed_stereotypes"}, {"score": 0.0024603551979225195, "phrase": "better_comprehension"}, {"score": 0.0022091400304857043, "phrase": "interesting_practice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Stereotypes", " UML sequence diagrams", " Comprehension", " Family of experiments", " Meta-analysis"], "paper_abstract": "Context: The conventional wisdom states that stereotypes are used to clarify or extend the meaning of model elements and consequently should be helpful in comprehending the diagram semantics. Objective: The main goal of this work is to present a family of experiments that we have carried out to investigate whether the use of stereotypes improves the comprehension of UML sequence diagrams. Method: The family of experiments consists of an experiment and two replications carried out with 78, 29 and 36 undergraduate Computer Science students, respectively. The comprehension of UML sequence diagrams with and without stereotypes was analyzed from three different perspectives borrowed from the Cognitive Theory of Multimedia Learning (CTML): semantic comprehension, retention and transfer. in addition, we carried out a meta-analysis study to integrate the different data samples. Results: The statistical analysis and meta-analysis of the data obtained from each experiment separately indicates that the use of the proposed stereotypes helps improving the comprehension of the diagrams, especially when the subjects are not familiar with the domain. Conclusions: The set of stereotypes presented in this work seem to be helpful for a better comprehension of UML sequence diagrams, especially with not well-known domains. Although further research is necessary for strengthening these results, introducing these stereotypes both in academia and industry could be an interesting practice for checking the validity of the results. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Assessing the influence of stereotypes on the comprehension of UML sequence diagrams: A family of experiments", "paper_id": "WOS:000296986900008"}