{"auto_keywords": [{"score": 0.03818620838813371, "phrase": "organizational_perspective"}, {"score": 0.012030273726017218, "phrase": "software_professionals"}, {"score": 0.00481495049065317, "phrase": "change_impact_analysis_issues"}, {"score": 0.004756233569671719, "phrase": "impact_analysis"}, {"score": 0.004640929126263433, "phrase": "change_management_activity"}, {"score": 0.00447316895126645, "phrase": "technical_perspective"}, {"score": 0.003892126266260425, "phrase": "change_management_process"}, {"score": 0.003797690272118125, "phrase": "ia_issues"}, {"score": 0.003372460634140967, "phrase": "qualitative_and_statistical_analyses"}, {"score": 0.003158522476399068, "phrase": "important_issues"}, {"score": 0.0031199418866663543, "phrase": "particular_level"}, {"score": 0.0026159017392986595, "phrase": "personal_opinions"}, {"score": 0.002157433262687853, "phrase": "view_concern"}, {"score": 0.0021226205223888236, "phrase": "ia"}], "paper_keywords": ["change impact analysis", " organizational level", " perspective", " prioritization", " issues"], "paper_abstract": "Change impact analysis (IA) is a change management activity that previously has been much studied from a technical perspective. For example, much work focuses on methods for determining the impact of a change. In this paper, we present results from a study on the role of IA in the change management process. In the study, IA issues were prioritized with respect to criticality by software professionals from an organizational perspective and a self-perspective. The software professionals belonged to three organizational levels: operative, tactical, and strategic. Qualitative and statistical analyses with respect to differences between perspectives and levels are presented. The results show that important issues for a particular level are tightly related to how the level is defined. Similarly, issues important from an organizational perspective are more holistic than those important from a self-perspective. However, our data indicate that the self-perspective colors the organizational perspective, meaning that personal opinions and attitudes cannot be easily disregarded. In comparing the perspectives and the levels, we visualize the differences in a way that allows us to discuss two classes of issues: high priority and medium priority. The most important issues from this point of view concern fundamental aspects of IA and its execution.", "paper_title": "An empirical study on views of importance of change impact analysis issues", "paper_id": "WOS:000257936500007"}