{"auto_keywords": [{"score": 0.03332169746093553, "phrase": "optimal_disguised_attack"}, {"score": 0.03137842661161641, "phrase": "link_farm"}, {"score": 0.009378507037353047, "phrase": "target_page"}, {"score": 0.007572616563068773, "phrase": "pagerank_score"}, {"score": 0.00481495049065317, "phrase": "optimal_link_bombs"}, {"score": 0.004511663118269957, "phrase": "interlinked_environment"}, {"score": 0.004438861041839598, "phrase": "optimal_attack_pattern"}, {"score": 0.004213662826578328, "phrase": "specific_node"}, {"score": 0.003935267970727093, "phrase": "optimal_attacks"}, {"score": 0.0035574466515880337, "phrase": "optimal_attack_patterns"}, {"score": 0.0033439771810057717, "phrase": "disguised_attacks"}, {"score": 0.0029933487820771217, "phrase": "optimal_link_farm_configurations"}, {"score": 0.002906836691319759, "phrase": "special_case"}, {"score": 0.00214659338413584, "phrase": "random_graph_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Link analysis", " Pagerank", " Link spam", " Spam farms"], "paper_abstract": "We analyze the phenomenon of collusion for the purpose of boosting the pagerank of a node in an interlinked environment. We investigate the optimal attack pattern for a group of nodes (attackers) attempting to improve the ranking of a specific node (the victim). We consider attacks where the attackers can only manipulate their own outgoing links. We show that the optimal attacks in this scenario are uncoordinated, i.e. the attackers link directly to the victim and no one else; nodes do not link to each other. We also discuss optimal attack patterns for a group that wants to hide itself by not pointing directly to the victim. In these disguised attacks, the attackers link to nodes / hops away from the victim. We show that an optimal disguised attack exists and how it can be computed. The optimal disguised attack also allows us to find optimal link farm configurations. A link farm can be considered as a special case of our approach: the target page of the link farm is the victim and the other nodes in the link farm are the attackers for the purpose of improving the rank of the victim. The target page can however control its own outgoing links for the purpose of improving its own rank, which can be modeled as an optimal disguised attack of 1-hop on itself. Our results are unique in the literature as we show optimality not only in the pagerank score, but also in the rank based on the pagerank score. We further validate our results with experiments on a variety of random graph models. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An analysis of optimal link bombs", "paper_id": "WOS:000304583800001"}