{"auto_keywords": [{"score": 0.04616388974806529, "phrase": "perception"}, {"score": 0.004696909870731282, "phrase": "sensory_history"}, {"score": 0.004517210371632577, "phrase": "physiological_effects"}, {"score": 0.004313643010028869, "phrase": "encoder-decoder_cascade"}, {"score": 0.004163290958633733, "phrase": "probabilistic_response"}, {"score": 0.003989742144066683, "phrase": "population_activity"}, {"score": 0.003947492797744999, "phrase": "perceptual_estimate"}, {"score": 0.0036769967497738165, "phrase": "decoder_behavior"}, {"score": 0.0036251554804124066, "phrase": "observed_perceptual_effects"}, {"score": 0.0033408932140621948, "phrase": "inverse_fisher_information"}, {"score": 0.0033172506969692626, "phrase": "estimation_bias"}, {"score": 0.003178856904071446, "phrase": "different_reasons"}, {"score": 0.0028677070439412427, "phrase": "encoding_population"}, {"score": 0.002559501330352064, "phrase": "gain_change_description"}, {"score": 0.0025413743933379185, "phrase": "encoder_adaptation"}, {"score": 0.0024439412207268355, "phrase": "decoder_bias"}, {"score": 0.0023502347146791285, "phrase": "\"unaware\"_decoder"}, {"score": 0.002260112998123604, "phrase": "preadaptation_encoder"}, {"score": 0.0021967433763351884, "phrase": "behavioral_data"}, {"score": 0.0021503823972534096, "phrase": "adaptation-induced_biases"}, {"score": 0.0021049977753042253, "phrase": "temporary_suboptimality"}], "paper_keywords": [""], "paper_abstract": "Neural activity and perception are both affected by sensory history. The work presented here explores the relationship between the physiological effects of adaptation and their perceptual consequences. Perception is modeled as arising from an encoder-decoder cascade, in which the encoder is defined by the probabilistic response of a population of neurons, and the decoder transforms this population activity into a perceptual estimate. Adaptation is assumed to produce changes in the encoder, and we examine the conditions under which the decoder behavior is consistent with observed perceptual effects in terms of both bias and discriminability. We show that for all decoders, discriminability is bounded from below by the inverse Fisher information. Estimation bias, on the other hand, can arise for a variety of different reasons and can range from zero to substantial. We specifically examine biases that arise when the decoder is fixed, \"unaware\" of the changes in the encoding population (as opposed to \"aware\" of the adaptation and changing accordingly). We simulate the effects of adaptation on two well-studied sensory attributes, motion direction and contrast, assuming a gain change description of encoder adaptation. Although we cannot uniquely constrain the source of decoder bias, we find for both motion and contrast that an \"unaware\" decoder that maximizes the likelihood of the percept given by the preadaptation encoder leads to predictions that are consistent with behavioral data. This model implies that adaptation-induced biases arise as a result of temporary suboptimality of the decoder.", "paper_title": "Is the Homunculus \"Aware\" of Sensory Adaptation?", "paper_id": "WOS:000272200100001"}