{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverbial_clauses"}, {"score": 0.008415950949652974, "phrase": "contemporary_british_english"}, {"score": 0.006519618271114101, "phrase": "empirical_evidence"}, {"score": 0.0058384354272831215, "phrase": "english"}, {"score": 0.0045959609346817535, "phrase": "adverbial_subordinators"}, {"score": 0.00451642066363115, "phrase": "important_index"}, {"score": 0.004464156619275582, "phrase": "different_types"}, {"score": 0.004162978902905446, "phrase": "automatic_text_classification"}, {"score": 0.0034753508746887957, "phrase": "misconceived_notion"}, {"score": 0.002917931350071647, "phrase": "contrastive_analysis"}, {"score": 0.002884111441153185, "phrase": "spontaneous_and_prepared_speech"}, {"score": 0.0026736111900632934, "phrase": "timed_and_untimed_university_essays"}, {"score": 0.0023932142697579506, "phrase": "previous_studies"}, {"score": 0.0021297010898172534, "phrase": "significant_characteristic"}], "paper_keywords": [""], "paper_abstract": "Adverbial subordinators are an important index of different types of discourse and have been used, for example, in automatic text classification. This article reports an investigation of the use of adverbial clauses based on a corpus of contemporary British English. It demonstrates on the basis of empirical evidence that it is simply a misconceived notion that adverbial clauses are typically associated with informal, unplanned types of discourse and hence spoken English. The investigation initially examined samples from both spoken and written English, followed by a contrastive analysis of spontaneous and prepared speech, to be finally confirmed by evidence from a further experiment based on timed and untimed university essays. The three sets of experiments consistently produced empirical evidence which irrefutably suggests that, contrary to claims by previous studies, the proportion of adverbial clauses are consistently much lower in speech than in writing and that adverbial clauses are a significant characteristic of planned, elaborated discourse.", "paper_title": "A corpus-based empirical account of adverbial clauses across speech and writing in contemporary British English", "paper_id": "WOS:000240270400004"}