{"auto_keywords": [{"score": 0.047232975924705344, "phrase": "twine"}, {"score": 0.03559053250299552, "phrase": "differential_fault_analysis"}, {"score": 0.00481495049065317, "phrase": "security_analysis"}, {"score": 0.0041316803676012155, "phrase": "key_lengths"}, {"score": 0.0037922107970110677, "phrase": "rfid"}, {"score": 0.0037459885494311217, "phrase": "smart_cards"}, {"score": 0.003293688299319582, "phrase": "important_method"}, {"score": 0.0031747618267940155, "phrase": "lightweight_cryptosystems"}, {"score": 0.002985988377995789, "phrase": "differential_analysis"}, {"score": 0.0028958411976400646, "phrase": "effective_differential_fault_attack"}, {"score": 0.0028430608076324727, "phrase": "twine_cryptosystem"}, {"score": 0.0028084079003212947, "phrase": "mathematical_analysis"}, {"score": 0.0027741761880779535, "phrase": "simulating_experiments"}], "paper_keywords": ["Internet of Things", " Cryptanalysis", " Lightweight Cryptosystem", " Differential Fault Analysis", " TWINE"], "paper_abstract": "The TWINE is a new Generalized Feistel Structure (GFS) lightweight cryptosystem in the Internet of Things. It has 36 rounds and the key lengths support 80 bits and 128 bits, which are flexible to provide security for the RFID, smart cards and other highly-constrained devices. Due to the strong attacking ability, fast speed, simple implementation and other characteristics, the differential fault analysis has become an important method to evaluate the security of lightweight cryptosystems. On the basis of the 4-bit fault model and the differential analysis, we propose an effective differential fault attack on the TWINE cryptosystem. Mathematical analysis and simulating experiments show that the attack could recover its 80-bit and 128-bit secret keys by introducing 8 faulty ciphertexts and 18 faulty ciphertexts on average, respectively. The result in this study describes that the TWINE is vulnerable to differential fault analysis. It will be beneficial to the analysis of the same type of other iterated lightweight cryptosystems in the Internet of Things.", "paper_title": "Security Analysis of the Lightweight Cryptosystem TWINE in the Internet of Things", "paper_id": "WOS:000351719100018"}