{"auto_keywords": [{"score": 0.04111001881446785, "phrase": "scholarly_publication"}, {"score": 0.04085999286861161, "phrase": "patenting_activity"}, {"score": 0.03379440311039387, "phrase": "scientific_communication"}, {"score": 0.00459165923324494, "phrase": "non-publication_output"}, {"score": 0.004406496547539966, "phrase": "entrepreneurial_activity"}, {"score": 0.004351033214640434, "phrase": "public_research_institutes"}, {"score": 0.004282680502911952, "phrase": "spin-out_companies"}, {"score": 0.004202067185873954, "phrase": "collaborative_research"}, {"score": 0.0037729898581369673, "phrase": "data_set"}, {"score": 0.003749155155531426, "phrase": "nanoscience_publications"}, {"score": 0.003725470458263889, "phrase": "nanotechnology_patents"}, {"score": 0.0032818759580573575, "phrase": "collaborative_activity"}, {"score": 0.0030802351224657673, "phrase": "adverse_relationship"}, {"score": 0.0029185830864495313, "phrase": "patenting_scientists"}, {"score": 0.0028006988338192375, "phrase": "publication_counts"}, {"score": 0.002782989122345306, "phrase": "citation_frequency"}, {"score": 0.0026705669656375197, "phrase": "top_performance_class"}, {"score": 0.002587180385280577, "phrase": "top_positions"}, {"score": 0.002522344964242888, "phrase": "co-authorship_links"}, {"score": 0.0024513404432665153, "phrase": "prominent_role"}, {"score": 0.0023974961635593135, "phrase": "network_maps"}, {"score": 0.002337403139264533, "phrase": "frequently_and_others"}, {"score": 0.0022572213326336374, "phrase": "cognitive_differences"}, {"score": 0.0021522871388240444, "phrase": "marginal_share"}, {"score": 0.0021386687477715494, "phrase": "publishing_scholars"}, {"score": 0.0021049977753042253, "phrase": "substantial_role"}], "paper_keywords": [""], "paper_abstract": "Policy-makers in many countries emphasize the importance of non-publication output of university research. Increasingly, policies are pursued that attempt to encourage entrepreneurial activity in universities and public research institutes. Apart from generating spin-out companies, technology licensing, and collaborative research, attention is focused on patenting activities of researchers. Some analysts suggest that there is a trade-off between scholarly publication and patenting activity. This paper explores this relationship drawing on a data set of nanoscience publications and nanotechnology patents in three European countries. In particular, this study examines whether researchers who both publish and patent are more productive and more highly cited than their peers who concentrate on scholarly publication in communicating their research results. Furthermore, this study investigates the collaborative activity of inventor-authors and their position in their respective networks of scientific communication. The findings suggest that overall there seems to be no adverse relationship between publication and patenting activity, at least not in this area of science and technology. Patenting scientists appear to outperform their solely publishing, non-inventing peers in terms of publication counts and citation frequency. However, while they are considerably over-represented in the top performance class, the data indicates that inventor-authors may not occupy top positions within that group. An analysis of co-authorship links indicates that patenting authors can also play a prominent role within networks of scientific communication. The network maps also point to groups where inventor-authors occur frequently and others where this is not the case, which possibly reflects cognitive differences between sub-fields. Finally, the data indicates that inventor-authors account only for a marginal share of publishing scholars while they play a substantial role amongst inventors.", "paper_title": "Knowledge integrators or weak links? An exploratory comparison of patenting researchers with their non-inventing peers in nano-science and technology", "paper_id": "WOS:000239300600015"}