{"auto_keywords": [{"score": 0.04457655224247401, "phrase": "qspr_models"}, {"score": 0.008998612013278468, "phrase": "pubchem"}, {"score": 0.004645057834614705, "phrase": "important_molecular_property"}, {"score": 0.0045309482598142395, "phrase": "quantitative_structure-property_relationship"}, {"score": 0.004101750582758106, "phrase": "nci"}, {"score": 0.0040566716336110226, "phrase": "balloon"}, {"score": 0.004012011375577782, "phrase": "openbabel"}, {"score": 0.003978866233891427, "phrase": "rdkit"}, {"score": 0.0037751895787179173, "phrase": "carboxylic_acids"}, {"score": 0.0037027980582474856, "phrase": "qspr_model_descriptors"}, {"score": 0.0036217569360301105, "phrase": "empirical_partial_atomic_charges"}, {"score": 0.003361069456060196, "phrase": "partial_atomic_charges"}, {"score": 0.003287482882222731, "phrase": "high_accuracy"}, {"score": 0.0032244131604567323, "phrase": "initio_and_semiempirical_qm_charges"}, {"score": 0.0031801031575393766, "phrase": "empirical_charges"}, {"score": 0.0031538090440906873, "phrase": "electronegativity_equalization"}, {"score": 0.002983968624542411, "phrase": "gasteiger-marsili_empirical_charges"}, {"score": 0.0029429530636278837, "phrase": "pka_prediction"}, {"score": 0.0026711620032802683, "phrase": "appropriate_selection"}, {"score": 0.0026417396488589385, "phrase": "optimization_method"}, {"score": 0.0026054158371650884, "phrase": "successful_qspr_modeling"}, {"score": 0.002527247425576091, "phrase": "dtp_nci"}, {"score": 0.0022249209015955305, "phrase": "unfortunate_combination"}, {"score": 0.0022126280490696363, "phrase": "molecular_class"}, {"score": 0.0022004029656808224, "phrase": "charge_calculation_approach"}, {"score": 0.0021821915946356168, "phrase": "weak_qspr_models"}, {"score": 0.0021049977753042253, "phrase": "good_quality_qspr_models"}], "paper_keywords": [""], "paper_abstract": "The acid dissociation constant is an important molecular property, and it can be successfully predicted by Quantitative Structure-Property Relationship (QSPR) models, even for in silico designed molecules. We analyzed how the methodology of in silico 3D structure preparation influences the quality of QSPR models. Specifically, we evaluated and compared QSPR models based on six different 3D structure sources (DTP NCI, Pubchem, Balloon, Frog2, OpenBabel, and RDKit) combined with four different types of optimization. These analyses were performed for three classes of molecules (phenols, carboxylic acids, anilines), and the QSPR model descriptors were quantum mechanical (QM) and empirical partial atomic charges. Specifically, we developed 516 QSPR models and afterward systematically analyzed the influence of the 3D structure source and other factors on their quality. Our results confirmed that QSPR models based on partial atomic charges are able to predict pK(a) with high accuracy. We also confirmed that ab initio and semiempirical QM charges provide very accurate QSPR models and using empirical charges based on electronegativity equalization is also acceptable, as well as advantageous, because their calculation is very fast. On the other hand, Gasteiger-Marsili empirical charges are not applicable for pKa prediction. We later found that QSPR models for some classes of molecules (carboxylic acids) are less accurate. In this context, we compared the influence of different 3D structure sources. We found that an appropriate selection of 3D structure source and optimization method is essential for the successful QSPR modeling of pK(a). Specifically, the 3D structures from the DTP NCI and Pubchem databases performed the best, as they provided very accurate QSPR models for all the tested molecular classes and charge calculation approaches, and they do not require optimization. Also, Frog2 performed very well. Other 3D structure sources can also be used but are not so robust, and an unfortunate combination of molecular class and charge calculation approach can produce weak QSPR models. Additionally, these 3D structures generally need optimization in order to produce good quality QSPR models.", "paper_title": "How Does the Methodology of 3D Structure Preparation Influence the Quality of pK(a) Prediction?", "paper_id": "WOS:000356903200002"}