{"auto_keywords": [{"score": 0.0349618967211496, "phrase": "fourier-wavelet_method"}, {"score": 0.020905835894725566, "phrase": "randomization_method"}, {"score": 0.020413923391577785, "phrase": "stratified_sampling"}, {"score": 0.00481495049065317, "phrase": "multiscale_gaussian_random_field_simulation_algorithms"}, {"score": 0.004603352344461032, "phrase": "homogeneous_random_fields"}, {"score": 0.004571630734130793, "phrase": "multiscale_resolution"}, {"score": 0.004193000200816171, "phrase": "wavenumber_space"}, {"score": 0.004050442607427367, "phrase": "equal_energy_subdivision"}, {"score": 0.003926273177600597, "phrase": "logarithmically_uniform_subdivision"}, {"score": 0.0038456073694665, "phrase": "fractal_gaussian_random_fields"}, {"score": 0.0038190873308414333, "phrase": "kolmogorov-type_spectra"}, {"score": 0.0035147084172295123, "phrase": "self-similar_structure_function"}, {"score": 0.003466382911409222, "phrase": "reasonable_computational_effort"}, {"score": 0.0032457271401035545, "phrase": "accurate_self-similar_scaling"}, {"score": 0.003102875178186416, "phrase": "computational_effort"}, {"score": 0.0029254845664637204, "phrase": "conceptual_and_numerical_comparison"}, {"score": 0.002865320947289691, "phrase": "random_field_simulation_method"}, {"score": 0.002796687674642564, "phrase": "ensemble-averaged_quantities"}, {"score": 0.0026828233195176155, "phrase": "multi-point_statistical_characteristics"}, {"score": 0.0026185499482623, "phrase": "good_accuracy"}, {"score": 0.0023847032316716503, "phrase": "random_field_statistics"}, {"score": 0.002279660253812632, "phrase": "better_ergodic_properties"}, {"score": 0.002119640369431708, "phrase": "partial_differential_equations"}, {"score": 0.0021049977753042253, "phrase": "random_field_coefficients"}], "paper_keywords": ["Monte Carlo", " random field simulation", " randomization", " fourier wavelet", " multiscale"], "paper_abstract": "We analyze and compare the efficiency and accuracy of two simulation methods for homogeneous random fields with multiscale resolution. We consider in particular the Fourier-wavelet method and three variants of the Randomization method: (A) without any stratified sampling of wavenumber space, (B) with stratified sampling of wavenumbers with equal energy subdivision, (C) with stratified sampling with a logarithmically uniform subdivision. We focus primarily on fractal Gaussian random fields with Kolmogorov-type spectra. Previous work has shown that variants (A) and (B) of the Randomization method are only able to generate a self-similar structure function over three to four decades with reasonable computational effort. By contrast, variant (C), along with the Fourier-wavelet method, is able to reproduce accurate self-similar scaling of the structure function over a number of decades increasing linearly with computational effort (for our examples we will show that nine decades can be reproduced). We provide some conceptual and numerical comparison of the various cost contributions to each random field simulation method. We find that when evaluating ensemble-averaged quantities like the correlation and structure functions, as well as some multi-point statistical characteristics, the Randomization method can provide good accuracy with less cost than the Fourier-wavelet method. The cost of the Randomization method relative to the Fourier-wavelet method, however, appears to increase with the complexity of the random field statistics which are to be calculated accurately. Moreover, the Fourier-wavelet method has better ergodic properties, and hence becomes more efficient for the computation of spatial (rather than ensemble) averages which may be important in simulating the solutions to partial differential equations with random field coefficients. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Comparative analysis of multiscale Gaussian random field simulation algorithms", "paper_id": "WOS:000249936500041"}