{"auto_keywords": [{"score": 0.03615086805519576, "phrase": "feedback_information"}, {"score": 0.015719716506582538, "phrase": "network_coding"}, {"score": 0.01272320301765646, "phrase": "delay-constrained_traffic"}, {"score": 0.0046394362688524475, "phrase": "wireless_networks"}, {"score": 0.004491093879657087, "phrase": "strict_per-packet_delay_constraints"}, {"score": 0.0037820003983334476, "phrase": "unreliable_nature"}, {"score": 0.003747020072136732, "phrase": "wireless_links"}, {"score": 0.0030117065110966414, "phrase": "application_requirements"}, {"score": 0.0029838294169759663, "phrase": "traffic_patterns"}, {"score": 0.002956209594959227, "phrase": "delay_constraints"}, {"score": 0.0029152570900178956, "phrase": "throughput_requirements"}, {"score": 0.0028482561434303886, "phrase": "wireless_limitations"}, {"score": 0.002795762692061496, "phrase": "unreliable_wireless_links"}, {"score": 0.002607362103727335, "phrase": "general_framework"}, {"score": 0.0025712297362596574, "phrase": "feasibility-optimal_broadcasting_policies"}, {"score": 0.0022052711621931144, "phrase": "xor_coding"}, {"score": 0.0021049977753042253, "phrase": "linear_coding"}], "paper_keywords": ["Broadcast", " delay constraints", " multicast", " network coding", " real-time communications", " wireless networks"], "paper_abstract": "There is increasing demand for using wireless networks for applications that generate packets with strict per-packet delay constraints. In addition to delay constraints, such applications also have various traffic patterns and require guarantees on throughputs of packets that are delivered within their delay constraints. Furthermore, a mechanism for serving delay-constrained traffic needs to specifically consider the unreliable nature of wireless links, which may differ from link to link. Also, as it is usually infeasible to gather feedback information from all clients after each transmission, broadcasting delay-constrained traffic requires addressing the challenge of the lack of feedback information. We study a model that jointly considers the application requirements on traffic patterns, delay constraints, and throughput requirements, as well as wireless limitations, including the unreliable wireless links and the lack of feedback information. Based on this model, we develop a general framework for designing feasibility-optimal broadcasting policies that applies to systems with various network coding mechanisms. We demonstrate the usage of this framework by designing policies for three different kinds of systems: one that does not use network coding, one that employs XOR coding, and the last that allows the usage of linear coding.", "paper_title": "Broadcasting Delay-Constrained Traffic Over Unreliable Wireless Links With Network Coding", "paper_id": "WOS:000356298800004"}