{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_networks"}, {"score": 0.004189698902282913, "phrase": "k_best_nodes"}, {"score": 0.003456359260921982, "phrase": "real-time_decisions"}, {"score": 0.003237116128682586, "phrase": "healthy_nodes"}, {"score": 0.003158522476399068, "phrase": "already_infected_nodes"}, {"score": 0.0031327496009959464, "phrase": "efficient_algorithms"}, {"score": 0.0030692309090066166, "phrase": "public-health_experts"}, {"score": 0.002970260970134645, "phrase": "actual_distribution"}, {"score": 0.002827740707723551, "phrase": "data-aware_vaccination_problem"}, {"score": 0.0024700078414481297, "phrase": "varying_degrees"}, {"score": 0.002294294558114909, "phrase": "extensive_experiments"}, {"score": 0.002275557501858879, "phrase": "multiple_real_networks"}, {"score": 0.002256973121326987, "phrase": "large_epidemiology_datasets"}, {"score": 0.0021662983565317283, "phrase": "substantial_gains"}], "paper_keywords": ["Algorithms", " Experimentation", " Graph mining", " social networks", " immunization", " diffusion"], "paper_abstract": "Given a graph, like a social/computer network or the blogosphere, in which an infection (or meme or virus) has been spreading for some time, how to select the k best nodes for immunization/quarantining immediately? Most previous works for controlling propagation (say via immunization) have concentrated on developing strategies for vaccination preemptively before the start of the epidemic. While very useful to provide insights in to which baseline policies can best control an infection, they may not be ideal to make real-time decisions as the infection is progressing. In this paper, we study how to immunize healthy nodes, in the presence of already infected nodes. Efficient algorithms for such a problem can help public-health experts make more informed choices, tailoring their decisions to the actual distribution of the epidemic on the ground. First we formulate the Data-Aware Vaccination problem, and prove it is NP-hard and also that it is hard to approximate. Secondly, we propose three effective polynomial-time heuristics DAVA, DAVA-prune and DAVA-fast, of varying degrees of efficiency and performance. Finally, we also demonstrate the scalability and effectiveness of our algorithms through extensive experiments on multiple real networks including large epidemiology datasets (containing millions of interactions). Our algorithms show substantial gains of up to ten times more healthy nodes at the end against many other intuitive and nontrivial competitors.", "paper_title": "Data-Aware Vaccine Allocation Over Large Networks", "paper_id": "WOS:000363675500010"}