{"auto_keywords": [{"score": 0.025277506657904566, "phrase": "china"}, {"score": 0.02273345277388751, "phrase": "google_trends"}, {"score": 0.022571527821337548, "phrase": "baidu_index"}, {"score": 0.008664219654721394, "phrase": "google"}, {"score": 0.006527874313246852, "phrase": "search_volume_data"}, {"score": 0.00481495049065317, "phrase": "data_mining_from_web_search"}, {"score": 0.004642852977065663, "phrase": "numerous_studies"}, {"score": 0.004493207015584002, "phrase": "web_search_queries"}, {"score": 0.004348363291608004, "phrase": "web_query_data_sources"}, {"score": 0.0038983084627130502, "phrase": "baidu"}, {"score": 0.0038279459368975965, "phrase": "largest_search_engines"}, {"score": 0.0035719191251314918, "phrase": "extensive_testing"}, {"score": 0.003481957226813911, "phrase": "empirical_study"}, {"score": 0.0034440966820590024, "phrase": "query_volume_data"}, {"score": 0.003201967054773186, "phrase": "chinese_universities"}, {"score": 0.003009548189374684, "phrase": "differing_methods"}, {"score": 0.002987682397171167, "phrase": "language_processing"}, {"score": 0.0027978827655799495, "phrase": "predictive_power"}, {"score": 0.0026976845075643314, "phrase": "major_difference"}, {"score": 0.0026296828616623994, "phrase": "data_availability"}, {"score": 0.002391739069644444, "phrase": "google's_smaller_user_base"}, {"score": 0.002280948283235427, "phrase": "google's_user_bases"}], "paper_keywords": ["web mining", " webometrics"], "paper_abstract": "Numerous studies have explored the possibility of uncovering information from web search queries but few have examined the factors that affect web query data sources. We conducted a study that investigated this issue by comparing Google Trends and Baidu Index. Data from these two services are based on queries entered by users into Google and Baidu, two of the largest search engines in the world. We first compared the features and functions of the two services based on documents and extensive testing. We then carried out an empirical study that collected query volume data from the two sources. We found that data from both sources could be used to predict the quality of Chinese universities and companies. Despite the differences between the two services in terms of technology, such as differing methods of language processing, the search volume data from the two were highly correlated and combining the two data sources did not improve the predictive power of the data. However, there was a major difference between the two in terms of data availability. Baidu Index was able to provide more search volume data than Google Trends did. Our analysis showed that the disadvantage of Google Trends in this regard was due to Google's smaller user base in China. The implication of this finding goes beyond China. Google's user bases in many countries are smaller than that in China, so the search volume data related to those countries could result in the same issue as that related to China.", "paper_title": "Data Mining From Web Search Queries: A Comparison of Google Trends and Baidu Index", "paper_id": "WOS:000346361000002"}