{"auto_keywords": [{"score": 0.036359699237778445, "phrase": "non-utilized_band"}, {"score": 0.014122003684324978, "phrase": "licensed_band"}, {"score": 0.008345181361214194, "phrase": "ob"}, {"score": 0.00481495049065317, "phrase": "informed_spectrum_discovery"}, {"score": 0.004776484866276242, "phrase": "cognitive_radio_networks"}, {"score": 0.004738325072560588, "phrase": "proactive_out-of-band_sensing"}, {"score": 0.00444377150105556, "phrase": "primary_users"}, {"score": 0.0038614646772981848, "phrase": "-band_channels"}, {"score": 0.0034926916198124484, "phrase": "sus'_communication"}, {"score": 0.0033283624928018177, "phrase": "short_period"}, {"score": 0.003301733505307784, "phrase": "seamless_communication"}, {"score": 0.0028003107731426322, "phrase": "proactive_ob"}, {"score": 0.0026792166577171476, "phrase": "non-utilized_spectrum"}, {"score": 0.002472269923319476, "phrase": "cr_networks"}, {"score": 0.0023653276631862958, "phrase": "lost_throughput"}, {"score": 0.002308953751676031, "phrase": "new_discovered_band"}], "paper_keywords": ["Cognitive radio", " spectrum sensing", " proactive sensing", " out-of-band sensing", " throughput analysis"], "paper_abstract": "Cognitive radio (CR) users, known as secondary users (SUs), should avoid interference with primary users (PUs) who own the licensed band, while trying to access it; when the licensed band is unused by the PUs. To detect PUs, spectrum sensing should be performed over in-band channels that are currently in use by SUs. If PUs return to access the band, SUs need to vacate it, disrupting the SUs' communication unless a non-utilized band is discovered. Obtaining a non-utilized band in a short period facilitate seamless communication for SUs and avoid interference on PUs by vacating from the channel immediately. Searching for a non-utilized band can be done through proactive out-of-band (OB) sensing. In this paper, we suggest a proactive OB sensing scheme that minimizes the time required to discover a non-utilized spectrum in order to continue communication. Although, the duration spent on OB sensing reduces the throughput of the CR networks that can be achieved on band being utilized, the lost throughput can be compensated in the new discovered band. We demonstrate that, the effect of our proposed scheme on the throughput owing to OB sensing is insignificant, while exhibiting a very short channel discovery time.", "paper_title": "Informed Spectrum Discovery in Cognitive Radio Networks using Proactive Out-of-Band Sensing", "paper_id": "WOS:000345331400001"}