{"auto_keywords": [{"score": 0.034104123360996684, "phrase": "delay_estimation"}, {"score": 0.0196559209070181, "phrase": "packet_delay"}, {"score": 0.016076101491061645, "phrase": "measurement_results"}, {"score": 0.008144185151602716, "phrase": "measurement_overhead"}, {"score": 0.00481495049065317, "phrase": "packet_delay_estimation"}, {"score": 0.00478778190213169, "phrase": "distributed_service_networks"}, {"score": 0.00447374807328756, "phrase": "delay_measurement"}, {"score": 0.004448169552315403, "phrase": "highly_dynamic_environment"}, {"score": 0.004312125825387938, "phrase": "network_nodes"}, {"score": 0.004287467395064377, "phrase": "delay_variation"}, {"score": 0.0042391934825554076, "phrase": "acceptable_level"}, {"score": 0.00417961150804265, "phrase": "network-based_services"}, {"score": 0.004144269035383502, "phrase": "voip"}, {"score": 0.00412086349411889, "phrase": "multimedia_streaming"}, {"score": 0.003949798354746051, "phrase": "packet_delays"}, {"score": 0.0038283757748142156, "phrase": "timely_basis"}, {"score": 0.0037320255482878365, "phrase": "great_deal"}, {"score": 0.0037007205870586593, "phrase": "accuracy_requirements"}, {"score": 0.0035565739009596267, "phrase": "measurement_architecture"}, {"score": 0.0035165002796966895, "phrase": "specific_measurement_techniques"}, {"score": 0.003447451122274614, "phrase": "network_overhead"}, {"score": 0.0033797531990222124, "phrase": "reasonable_level"}, {"score": 0.002975099633631871, "phrase": "measurement_nodes"}, {"score": 0.002795228413298423, "phrase": "dynamic_requirement"}, {"score": 0.002656158309155626, "phrase": "actual_measurement"}, {"score": 0.0026411384812121503, "phrase": "desired_accuracy"}, {"score": 0.0023848164282879885, "phrase": "topological_properties"}], "paper_keywords": ["Network management", " Measurement", " Round trip time", " Correlation", " Internet"], "paper_abstract": "Packet delay (either one-way time or round-trip time) is a very important metric for measuring the performance of networks in a highly dynamic environment such as the Internet. Many network applications are also sensitive to packet delay or delay variation for ensuring an acceptable level of quality in providing network-based services such as VoIP, multimedia streaming, etc. A very important property of packet delay is that it is very dynamic and therefore should be measured frequently with measurement results being updated on a timely basis. Measurement of packet delay has thus generated a great deal of interest in the past years and a lot of research has been performed in the development of measurement architecture as well as specific measurement techniques. However, how to reduce network overhead resulting from measurement while achieving a reasonable level of accuracy still remains a challenge. In this paper, we propose to use delay estimation as an alternative to delay measurement for reducing measurement overhead and, in particular, examine the level of accuracy that delay estimation can achieve. With delay estimation, measurement nodes can be dynamically selected and activated and other nodes can share measurement results by performing delay estimation, thus reducing measurement overhead while supporting the dynamic requirement for delay measurement. Consequently, while measurement overhead can be reduced by activating only a subset of network nodes to perform actual measurement, desired accuracy can be achieved by exploring the correlation between delays as well as by sharing measurement results to do delay estimation based on such a correlation. We illustrate how packet delays of network nodes can correlate to each other based on topological properties and show how delays can be estimated based on such a correlation to meet accuracy requirements, which would make delay measurement in the Internet highly dynamic and adaptable to the accuracy requirements and measurement results highly reliable. We also show how delay estimation can be applied by presenting three application scenarios as well as an example to demonstrate the usefulness and effectiveness of delay estimation in the measurement of packet delays.", "paper_title": "On the Accuracy of Packet Delay Estimation in Distributed Service Networks", "paper_id": "WOS:000324650000004"}