{"auto_keywords": [{"score": 0.03970953989057199, "phrase": "ihe_concepts"}, {"score": 0.0051576923472001525, "phrase": "ihe_profiles"}, {"score": 0.00481495049065317, "phrase": "interoperable_information_systems"}, {"score": 0.0047623424179093704, "phrase": "ihe._background"}, {"score": 0.004741459716170509, "phrase": "strategic_planning"}, {"score": 0.004720668149994765, "phrase": "information_systems"}, {"score": 0.004294962474996283, "phrase": "planned_architecture"}, {"score": 0.004220086640742953, "phrase": "current_state"}, {"score": 0.004092168350316413, "phrase": "interoperable_components"}, {"score": 0.0039333604469462356, "phrase": "healthcare_enterprise"}, {"score": 0.003927325769245765, "phrase": "ihe_developers"}, {"score": 0.0038309141193444015, "phrase": "established_standards"}, {"score": 0.003657988259333007, "phrase": "information_manager"}, {"score": 0.0036020923276404433, "phrase": "complex_ihe_world"}, {"score": 0.0031845067058084613, "phrase": "three-layer_graph-based_meta-model"}, {"score": 0.0030206579994328975, "phrase": "i._e."}, {"score": 0.002987595484581518, "phrase": "ire_concepts"}, {"score": 0.0027721409930610767, "phrase": "ihe_domains"}, {"score": 0.002747834479007666, "phrase": "information_managers"}, {"score": 0.0026527154263947814, "phrase": "eap_activities"}, {"score": 0.0025272660394963734, "phrase": "tool_conclusion"}, {"score": 0.0025106241866273897, "phrase": "complex_relations"}, {"score": 0.0024613516428946764, "phrase": "eap_method"}, {"score": 0.0023090525096074264, "phrase": "ire_profiles"}, {"score": 0.0022144056504286164, "phrase": "reference_model"}, {"score": 0.0021236300589450143, "phrase": "ire_developers"}], "paper_keywords": ["Information systems", " health information systems", " systems integration", " enterprise architecture planning", " EAP", " modeling", " integrating the healthcare enterprise", " IHE", " three-layer graph-based meta-model", " 3LGM(2)"], "paper_abstract": "Background: Strategic planning of information systems (IS) in healthcare requires descriptions of the current and the future IS state. Enterprise architecture planning (EAP) tools like the 3LGM(2) tool help to build up and to analyze IS models. A model of the planned architecture can be derived from an analysis of current state IS models. Building an interoperable IS, i.e. an IS consisting of interoperable components, can be considered a relevant strategic information management goal for many IS in healthcare. Integrating the healthcare enterprise (IHE) is an initiative which targets interoperability by using established standards. Objectives: To link IHE concepts to 3LGM(2) concepts within the 3LGM(2) tool. To describe how an information manager can be supported in handling the complex IHE world and planning interoperable IS using 3LGM(2) models. To describe how developers or maintainers of IHE profiles can be supported by the representation of IHE concepts in 3LGM(2). Methods: Conceptualization and concept mapping methods are used to assign IHE concepts such as domains, integration profiles actors and transactions to the concepts of the three-layer graph-based meta-model (3LGM(2)). Results: IHE concepts were successfully linked to 3LGM(2) concepts. An IHE-master-model, i. e. an abstract model for IRE concepts, was modeled with the help of 3LGM(2) tool. Two IHE domains were modeled in detail (ITI, QRPH). We describe two use cases for the representation of IHE concepts and IHE domains as 3LGM2 models. Information managers can use the IHE-master-model as reference model for modeling interoperable IS based on IHE profiles during EAP activities. IHE developers are supported in analyzing consistency of IHE concepts with the help of the IRE-master-model and functions of the 3LGM(2) tool Conclusion: The complex relations between IHE concepts can be modeled by using the EAP method 3LGM(2). 3LGM(2) tool offers visualization and analysis features which are now available for the IRE-master-model. Thus information managers and IHE developers can use or develop IRE profiles systematically. In order to improve the usability and handling of the IRE-master-model and its usage as a reference model, some further refinements have to be done. Evaluating the use of the IRE-master-model by information managers and IRE developers is subject to further research.", "paper_title": "Modeling Interoperable Information Systems with 3LGM(2) and IHE", "paper_id": "WOS:000363599400003"}