{"auto_keywords": [{"score": 0.02761374365149895, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "election_outcomes"}, {"score": 0.004535950496583731, "phrase": "particular_candidate"}, {"score": 0.0044512342099350555, "phrase": "imperfect_information"}, {"score": 0.004206421370630723, "phrase": "probability_distribution"}, {"score": 0.0041408296624638125, "phrase": "preference_orderings"}, {"score": 0.003975019199506057, "phrase": "possible_preference_orderings"}, {"score": 0.0034073545850838, "phrase": "polynomial_time_algorithm"}, {"score": 0.0032708180619317423, "phrase": "experimental_results"}, {"score": 0.003149630099034765, "phrase": "algorithm's_performance"}, {"score": 0.0028470499122838526, "phrase": "copeland"}, {"score": 0.0028451732271447885, "phrase": "borda"}, {"score": 0.0027886006987279453, "phrase": "bucklin"}, {"score": 0.0025588443155279855, "phrase": "plurality_voting_rule"}, {"score": 0.0024951987856762646, "phrase": "different_weights"}, {"score": 0.002471740959383183, "phrase": "unweighted_voters"}, {"score": 0.002433132434417479, "phrase": "polynomial_algorithm"}, {"score": 0.002291827910789624, "phrase": "monte_carlo_approximation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational social choice", " Voting rules"], "paper_abstract": "We investigate the extent to which it is possible to compute the probability of a particular candidate winning an election, given imperfect information about the preferences of the electorate. We assume that for each voter, we have a probability distribution over a set of preference orderings. Thus, for each voter, we have a number of possible preference orderings - we do not know which of these orderings actually represents the preferences of the voter, but for each ordering, we know the probability that it does. For the case where the number of candidates is a constant, we are able to give a polynomial time algorithm to compute the probability that a given candidate will win. We present experimental results obtained with an implementation of the algorithm, illustrating how the algorithm's performance in practice is better than its predicted theoretical bound. However, when the number of candidates is not bounded, we prove that the problem becomes #P-hard for the Plurality, k-approval, Borda, Copeland, and Bucklin voting rules. We further show that even evaluating if a candidate has any chance of winning is NP-complete for the Plurality voting rule in the case where voters may have different weights. With unweighted voters, we give a polynomial algorithm for Plurality, and show that the problem is hard for many other voting rules. Finally, we give a Monte Carlo approximation algorithm for computing the probability of a candidate winning in any settings, with an error that is as small as desired. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "On the evaluation of election outcomes under uncertainty", "paper_id": "WOS:000307612200001"}