{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "techno-hybridization"}, {"score": 0.004548253531664032, "phrase": "lifelike_technology"}, {"score": 0.004195418010131832, "phrase": "living_systems"}, {"score": 0.003925414526537783, "phrase": "recurring_fabrication_technique"}, {"score": 0.0038515000499988673, "phrase": "artificial_life_art"}, {"score": 0.003307988966112615, "phrase": "special_issue"}, {"score": 0.0031693980719538317, "phrase": "contemporary_artificial_life_science"}, {"score": 0.0028006988338192375, "phrase": "artificial_life_science"}, {"score": 0.002683304054823427, "phrase": "fields'_underlying_assumptions"}, {"score": 0.0023936956017015696, "phrase": "general_public"}, {"score": 0.002304263635960015, "phrase": "scientific_research"}, {"score": 0.0021049977753042253, "phrase": "artificial_life"}], "paper_keywords": ["Artificial life art", " techno-hybridization", " chimera", " creativity", " technology"], "paper_abstract": "Artists and engineers have devised lifelike technology for millennia. Their ingenious devices have often prompted inquiry into our preferences, prejudices, and beliefs about living systems, especially regarding their origins, status, constitution, and behavior. A recurring fabrication technique is shared across artificial life art, science, and engineering. This involves aggregating representations or re-creations of familiar biological partstechno-hybridizationbut the motives of practitioners may differ markedly. This article, and the special issue it introduces, explores how ground familiar to contemporary artificial life science and engineering has been assessed and interpreted in parallel by (a) artists and (b) theorists studying creativity explicitly. This activity offers thoughtful, alternative perspectives on artificial life science and engineering, highlighting and sometimes undermining the fields' underlying assumptions, or exposing avenues that are yet to be explored outside of art. Additionally, art has the potential to engage the general public, supporting and exploring the findings of scientific research and engineering. This adds considerably to the maturity of a culture tackling the issues the discipline of artificial life raises.", "paper_title": "Artificial Life Art, Creativity, and Techno-hybridization (editor's introduction)", "paper_id": "WOS:000359912700001"}