{"auto_keywords": [{"score": 0.03454004118415158, "phrase": "information_skills"}, {"score": 0.013191802238045251, "phrase": "semantic_features"}, {"score": 0.012330193047140163, "phrase": "surface_features"}, {"score": 0.01131821151161597, "phrase": "credibility_evaluation"}, {"score": 0.00481495049065317, "phrase": "online_credibility_evaluation"}, {"score": 0.004685575787741084, "phrase": "user-generated_content"}, {"score": 0.004278807087784626, "phrase": "way_credibility_evaluation"}, {"score": 0.004201774694043468, "phrase": "domain_experts"}, {"score": 0.00330246222643051, "phrase": "varying_expected_levels"}, {"score": 0.0030707512751243214, "phrase": "wikipedia_articles"}, {"score": 0.0030429511467945525, "phrase": "varying_quality"}, {"score": 0.003015401937358271, "phrase": "familiar_and_unfamiliar_topics"}, {"score": 0.00245724480030654, "phrase": "better_information_skills"}, {"score": 0.0022951216874671516, "phrase": "poorer_information_skills"}, {"score": 0.002213065910356615, "phrase": "enabling_character"}, {"score": 0.002193013499219711, "phrase": "domain_expertise"}], "paper_keywords": ["trust", " skills", " domain knowledge"], "paper_abstract": "With the rise of user-generated content, evaluating the credibility of information has become increasingly important. It is already known that various user characteristics influence the way credibility evaluation is performed. Domain experts on the topic at hand primarily focus on semantic features of information (e.g., factual accuracy), whereas novices focus more on surface features (e.g., length of a text). In this study, we further explore two key influences on credibility evaluation: topic familiarity and information skills. Participants with varying expected levels of information skills (i.e., high school students, undergraduates, and postgraduates) evaluated Wikipedia articles of varying quality on familiar and unfamiliar topics while thinking aloud. When familiar with the topic, participants indeed focused primarily on semantic features of the information, whereas participants unfamiliar with the topic paid more attention to surface features. The utilization of surface features increased with information skills. Moreover, participants with better information skills calibrated their trust against the quality of the information, whereas trust of participants with poorer information skills did not. This study confirms the enabling character of domain expertise and information skills in credibility evaluation as predicted by the updated 3S-model of credibility evaluation.", "paper_title": "Topic familiarity and information skills in online credibility evaluation", "paper_id": "WOS:000323388100003"}