{"auto_keywords": [{"score": 0.047549616959848454, "phrase": "nominal_level"}, {"score": 0.008496290932156838, "phrase": "nuisance_parameter"}, {"score": 0.006841047654884485, "phrase": "sample_size"}, {"score": 0.00671877455238856, "phrase": "loh"}, {"score": 0.006430768839025629, "phrase": "contingency_table"}, {"score": 0.0049049357372110206, "phrase": "sample_sizes"}, {"score": 0.004716520738331953, "phrase": "statistical_hypothesis_testing"}, {"score": 0.004620093797504386, "phrase": "type_i_error_rate"}, {"score": 0.004220782530243866, "phrase": "continuity_correction"}, {"score": 0.004049873425121855, "phrase": "limited_simulation_studies"}, {"score": 0.0039465735912396355, "phrase": "small_samples"}, {"score": 0.0035315805459722447, "phrase": "ann"}, {"score": 0.0034059806425893544, "phrase": "yu"}, {"score": 0.0033190180867511605, "phrase": "likelihood_ratio_test"}, {"score": 0.0029391622197860907, "phrase": "large-sample_lower_bounds"}, {"score": 0.0028864239961184338, "phrase": "complete_enumeration"}, {"score": 0.002733804109911159, "phrase": "moderate_sample_sizes"}, {"score": 0.0026365556244432146, "phrase": "error_rates"}, {"score": 0.0022690938135021747, "phrase": "chi-square_test"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Chi-square test", " likelihood ratio test", " continuity correction", " Type I error rate", " nuisance parameter", " contingency table"], "paper_abstract": "In statistical hypothesis testing it is important to ensure that the type I error rate is preserved under the nominal level. This paper addresses the sizes and the type I errors rates of the three popular asymptotic tests for testing homogeneity of two binomial proportions: the chi-square test with and without continuity correction, the likelihood ratio test. Although it has been recognized that, based on limited simulation studies, the sizes of the tests are inflated in small samples, it has been thought that the sizes are well preserved under the nominal level when the sample size is sufficiently large. But, Loh [1989. Bounds on the size of the chi(2) test of independence in a contingency table. Ann. Statist. 17, 1709-1722], and Loh and Yu [1993. Bounds on the size of the likelihood ratio test of independence in a contingency table. J. Multivariate Anal. 45, 291-304] showed theoretically that the sizes are always greater than or equal to the nominal level when the sample size is infinite. In this paper, we confirm their results by computing the large-sample lower bounds of the sizes numerically. Applying complete enumeration which does not have any error, we confirm again the results by computing the sizes precisely on computer in moderate sample sizes. When the sample sizes are unbalanced, the peaks of the type I error rates occur at the extremes of the nuisance parameter. But, the type I error rates of the three tests are close to the nominal level in most values of the nuisance parameter except the extremes. We also find that, when the sample sizes are severely unbalanced and the value of the nuisance parameter is very small, the size of the chi-square test with continuity correction can exceed the nominal level excessively (for instance, the size could be at least 0.877 at 5% nominal level in some cases). (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "The sizes of the three popular asymptotic tests for testing homogeneity of two binomial proportions", "paper_id": "WOS:000242484200021"}