{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_technology"}, {"score": 0.006941919674749939, "phrase": "value-focused_thinking_approach"}, {"score": 0.004508048086020253, "phrase": "human_interaction"}, {"score": 0.004348936976349555, "phrase": "mobile_collaboration"}, {"score": 0.004120694410890683, "phrase": "today's_educational_environment"}, {"score": 0.003999089046152065, "phrase": "tremendous_potential"}, {"score": 0.0038851209217101884, "phrase": "means-ends_objective_network"}, {"score": 0.003633464433320317, "phrase": "new_phenomenon"}, {"score": 0.002169132543304098, "phrase": "conceptual_foundation"}, {"score": 0.002143247921132179, "phrase": "future_studies"}, {"score": 0.0021049977753042253, "phrase": "useful_guidelines"}], "paper_keywords": ["mobile technology", " collaborative learning", " means-ends network", " value-focused thinking"], "paper_abstract": "Mobile technology has mobilized the human interaction in all dimensions by supporting mobile collaboration. As collaboration is key to learning in today's educational environment, mobile technology has tremendous potential in supporting and improving education and its delivery. Given that mobile technology for education is a new phenomenon that is gaining popularity, the values of using mobile technology to support education need to be further researched and better understood. In this research, we used the Value-Focused Thinking approach to interview students and instructors to identify the values of education that are enabled by mobile technology. These values are represented in the form of a means-ends objective network that not only captures the values of education facilitated by mobile technology but also depicts the relationships between these values. The means-ends objective network derived from this research can serve as a conceptual foundation for future studies and provide useful guidelines to practitioners for implementation of mobile technology in education.", "paper_title": "Understanding the Values of Mobile Technology in Education: A Value-Focused Thinking Approach", "paper_id": "WOS:000277999500002"}