{"auto_keywords": [{"score": 0.0488492843865137, "phrase": "mesh_terms"}, {"score": 0.036284175186168555, "phrase": "meshy"}, {"score": 0.033111790160887264, "phrase": "mesh_term_pairs"}, {"score": 0.00481495049065317, "phrase": "pubmed_information"}, {"score": 0.004630636201507787, "phrase": "pubmed"}, {"score": 0.004078729256705429, "phrase": "assigned_medical"}, {"score": 0.003772189804219758, "phrase": "unanticipated_information"}, {"score": 0.003735522846193052, "phrase": "appropriate_ranking"}, {"score": 0.003569050665799723, "phrase": "guiding_novel_research"}, {"score": 0.0035343512834706417, "phrase": "promising_trends"}, {"score": 0.003477264432055326, "phrase": "web-based_tool"}, {"score": 0.003376813851525222, "phrase": "mainly_statistical_algorithm"}, {"score": 0.0032053233533168362, "phrase": "semantic_similarities"}, {"score": 0.0031638248208086263, "phrase": "retrieved_pubmed_documents"}, {"score": 0.002935393439834135, "phrase": "online_interactive_interface"}, {"score": 0.002777191653403706, "phrase": "mesh_categories"}, {"score": 0.0024858445890050614, "phrase": "pharmacology_field"}, {"score": 0.0024536380420452676, "phrase": "molecularly-targeted_drug_imatinib"}, {"score": 0.0024376912001213362, "phrase": "nutrition-related_flavonoids"}, {"score": 0.002351813899450668, "phrase": "first_publicly_available_tool"}, {"score": 0.0022912596877648723, "phrase": "complex_nature"}, {"score": 0.0022763657774198184, "phrase": "published_work"}, {"score": 0.0022177597835626884, "phrase": "perl"}, {"score": 0.002153605290802688, "phrase": "major_browsers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["PubMed", " MeSH terms", " Ontology", " Imatinib"], "paper_abstract": "Motivation: PubMed is the most widely used database of biomedical literature. To the detriment of the user though, the ranking of the documents retrieved for a query is not content-based, and important semantic information in the form of assigned Medical Subject Headings (MeSH) terms is not readily presented or productively utilized. The motivation behind this work was the discovery of unanticipated information through the appropriate ranking of MeSH term pairs and, indirectly, documents. Such information can be useful in guiding novel research and following promising trends. Methods: A web-based tool, called MeSHy, was developed implementing a mainly statistical algorithm. The algorithm takes into account the frequencies of occurrences, concurrences, and the semantic similarities of MeSH terms in retrieved PubMed documents to create MeSH term pairs. These are then scored and ranked, focusing on their unexpectedly frequent or infrequent occurrences. Results: MeSHy presents results through an online interactive interface facilitating further manipulation through filtering and sorting. The results themselves include the MeSH term pairs, along with MeSH categories, the score, and document IDs, all of which are hyperlinked for convenience. To highlight the applicability of the tool, we report the findings of an expert in the pharmacology field on querying the molecularly-targeted drug imatinib and nutrition-related flavonoids. To the best of our knowledge. MeSHy is the first publicly available tool able to directly provide such a different perspective on the complex nature of published work. Implementation and availability: Implemented in Perl and served by Apache2 at http://bat.ina.certh.gr/tools/meshy/ with all major browsers supported. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "MeSHy: Mining unanticipated PubMed information using frequencies of occurrences and concurrences of MeSH terms", "paper_id": "WOS:000297904700001"}