{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lsa"}, {"score": 0.04173558117450762, "phrase": "predication_algorithm"}, {"score": 0.033956691840199525, "phrase": "polysemic_word"}, {"score": 0.0047583630644046785, "phrase": "context"}, {"score": 0.0046859752697029355, "phrase": "determining_factor"}, {"score": 0.004578165674080246, "phrase": "decisive_role"}, {"score": 0.004542780650208743, "phrase": "polysemic_words"}, {"score": 0.00440394242852293, "phrase": "human_management"}, {"score": 0.003950454636889479, "phrase": "kintsch"}, {"score": 0.003800026771283179, "phrase": "vector_representation"}, {"score": 0.0036838048761094933, "phrase": "latent_semantic_analysis"}, {"score": 0.003516079377293321, "phrase": "predicative_metaphors"}, {"score": 0.0033690254452595865, "phrase": "unwanted_effects"}, {"score": 0.0032914145394036657, "phrase": "vector-space_models"}, {"score": 0.003253279945540651, "phrase": "different_meanings"}, {"score": 0.002731381261399358, "phrase": "different_methods"}, {"score": 0.0023746766301040974, "phrase": "potential_solutions"}, {"score": 0.002301947614465974, "phrase": "human-based_computational_algorithm"}, {"score": 0.0021214346747442363, "phrase": "theoretical_assumptions"}], "paper_keywords": [""], "paper_abstract": "Context is a determining factor in language and plays a decisive role in polysemic words. Several psycholinguistically motivated algorithms have been proposed to emulate human management of context, under the assumption that the value of a word is evanescent and takes on meaning only in interaction with other structures. The predication algorithm (Kintsch, 2001), for example, uses a vector representation of the words produced by LSA (Latent Semantic Analysis) to dynamically simulate the comprehension of predications and even of predicative metaphors. The objective of this study was to predict some unwanted effects that could be present in vector-space models when extracting different meanings of a polysemic word (predominant meaning inundation, lack of precision, and low-level definition), and propose ideas based on the predication algorithm for avoiding them. Our first step was to visualize such unwanted phenomena and also the effect of solutions. We use different methods to extract the meanings for a polysemic word (without context, vector sum, and predication algorithm). Our second step was to conduct an analysis of variance to compare such methods and measure the impact of potential solutions. Results support the idea that a human-based computational algorithm like the predication algorithm can take into account features that ensure more accurate representations of the structures we seek to extract. Theoretical assumptions and their repercussions are discussed.", "paper_title": "Visualizing Polysemy Using LSA and the Predication Algorithm", "paper_id": "WOS:000280019100014"}