{"auto_keywords": [{"score": 0.029668259727588443, "phrase": "ict"}, {"score": 0.02322697306863356, "phrase": "agricultural_graduate_students"}, {"score": 0.006129510684632508, "phrase": "agricultural_students"}, {"score": 0.004612147352416241, "phrase": "information_and_communication_technology"}, {"score": 0.004305203085016233, "phrase": "new_technology"}, {"score": 0.0041773934798743405, "phrase": "higher_education"}, {"score": 0.003751011827704279, "phrase": "statistical_population"}, {"score": 0.003471135453226184, "phrase": "random_sampling_method"}, {"score": 0.0033680032592969633, "phrase": "data_collection"}, {"score": 0.0031982609080278643, "phrase": "faculty_members"}, {"score": 0.0031435968684569112, "phrase": "cronbach's_alpha"}, {"score": 0.0030501665085457606, "phrase": "descriptive_and_inferential_statistics"}, {"score": 0.0026116651619502184, "phrase": "tam"}, {"score": 0.0024906610581090223, "phrase": "direct_and_indirect_effects"}, {"score": 0.0022848092812445533, "phrase": "direct_effect"}, {"score": 0.0021883400011393564, "phrase": "students'_skills"}, {"score": 0.0021049982977903946, "phrase": "ict."}], "paper_keywords": [""], "paper_abstract": "With improving technology in the world, particularly Information and Communication Technology (ICT), people need to make an effort to keep up with the new technology. The importance of ICT in higher education continues to grow year by year. The purpose of this study was to analyze factors influencing application of ICT by agricultural graduate students. The statistical population included agricultural graduate students in colleges of agriculture at the University of Tehran. A sample of 110 students was selected using a random sampling method. A questionnaire was used for data collection. Reliability and validity of instrument were determined through opinions of faculty members and application of Cronbach's alpha. The data were analyzed using descriptive and inferential statistics. The findings revealed that skill, support, and facilities were the three factors that influenced the application of ICT by agricultural students. In order to predict application of ICT by agricultural students, the Technology Acceptance Model (TAM) was used. The results showed that skill had direct and indirect effects on the application of ICT, while support and facilities affected the application of ICT indirectly. Given the direct effect on application of ICT, we infer that when students' skills improve, they are more likely to use ICT.", "paper_title": "Analysis of Factors Influencing Application of ICT by Agricultural Graduate Students", "paper_id": "WOS:000273155100006"}