{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "finite_or_infinite_family"}, {"score": 0.004728780808284175, "phrase": "total_area"}, {"score": 0.00418595288276353, "phrase": "minimum_area"}, {"score": 0.0037052054802048707, "phrase": "general_case"}, {"score": 0.0036060781902674207, "phrase": "finite_unit_families"}, {"score": 0.003557509959237602, "phrase": "former_statement"}, {"score": 0.0034780071331554003, "phrase": "d._j._kleitman"}, {"score": 0.0034467039994594065, "phrase": "m._krieger"}, {"score": 0.003249966782844541, "phrase": "general_discussion"}, {"score": 0.003036832649117453, "phrase": "major_cases"}, {"score": 0.0027491902732542013, "phrase": "packing_algorithm"}, {"score": 0.002433048706565187, "phrase": "corresponding_packing_algorithm"}, {"score": 0.0023465400668244386, "phrase": "complete_and_preferably_constructive_published_proof"}, {"score": 0.0021925226977381244, "phrase": "interesting_technique"}, {"score": 0.002162951519368368, "phrase": "quadratic_programming"}], "paper_keywords": ["Rectangle packing", " 2-dimensional bin packing", " quadratic programming"], "paper_abstract": "In this paper, we prove that any finite or infinite family of squares with total area at most 1 can be packed into the rectangle with dimensions 2/root 3 x root 2 and that this rectangle is unique with this property and minimum area. Furthermore,we show that for a finite unit family of n squares which are given sorted by their side lengths, a packing into the 2/root 3 x root 2 rectangle can be found in linear time,which yields an O(n log n) time algorithm for the general case. With a restriction to finite unit families, the former statement has been published by D. J. Kleitman and M. Krieger, who - as they state themselves - only provide \"a general discussion of the methods used [throughout the proof] and an outline of the major cases\". Although they refer their proof to as \"being constructive\", it is not clear from their presentation how a packing algorithm would look like. Regarding the fact that there are some other results that rely on this statement - some of which even make use of a corresponding packing algorithm - it is important to have an complete and preferably constructive published proof for it. The proof that is presented here is constructive and uses an interesting technique based on quadratic programming which could be applicable to other packing problems as well.", "paper_title": "A GENERALIZATION OF A THEOREM OF KLEITMAN AND KRIEGER", "paper_id": "WOS:000308706700003"}