{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "reverse_engineering"}, {"score": 0.043836068704824434, "phrase": "design_patterns"}, {"score": 0.004701556483912018, "phrase": "significant_role"}, {"score": 0.004325208730208653, "phrase": "specific_way"}, {"score": 0.004091130285858113, "phrase": "specific_context"}, {"score": 0.0037188360359702182, "phrase": "micro-structures_design_patterns"}, {"score": 0.0034073030552032304, "phrase": "principal_aim"}, {"score": 0.0030000149283621255, "phrase": "closer_link"}, {"score": 0.002964415652865295, "phrase": "source_code"}, {"score": 0.0027485326424697095, "phrase": "automatic_recognition"}, {"score": 0.002558495760339272, "phrase": "elemental_design_patterns"}, {"score": 0.002488183412451029, "phrase": "micro_patterns"}, {"score": 0.002381566880282456, "phrase": "design_pattern_detection_process"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["design", " software engineering", " design patterns", " micro-structures", " design pattern recognition", " reverse engineering"], "paper_abstract": "Design patterns play a significant role in reverse engineering by providing information not only on how but also on why a solution has been implemented in a specific way because of their semantics. The application of design patterns leads to their personalization to a specific context, hence to the generation of variants. This makes their recognition a challenging task, which may be addressed through the understanding and detection of the micro-structures design patterns are made of. This is very useful for the detection as well as for the application of design patterns. The principal aim of this paper is to present a survey on these micro-structures and a comparison among them in the perspective of reverse engineering. Because of their less complex structure and behavior, as well as closer link to the source code, the recognition of these micro-structures may be automated, which can be considered a step towards the automatic recognition of the more complex design patterns. In this paper, we consider four of the most significant types of micro-structures: elemental design patterns, clues, sub-patterns, and micro patterns. To analyze the role of the micro-structures in the design pattern detection process, we make a comparison among these four types of micro-structures and among the micro-structures of various types in order to identify the relations among them. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Design patterns: a survey on their micro-structures", "paper_id": "WOS:000313911600002"}