{"auto_keywords": [{"score": 0.041765365816587144, "phrase": "universal_composability"}, {"score": 0.02253141675861873, "phrase": "concurrent_general_composition"}, {"score": 0.00481495049065317, "phrase": "general_composition"}, {"score": 0.004556901872357751, "phrase": "secure_protocol"}, {"score": 0.004195418010131832, "phrase": "modern_computer_networks"}, {"score": 0.004095469337291803, "phrase": "canetti"}, {"score": 0.003459191419478298, "phrase": "natural_way"}, {"score": 0.0034236045013591437, "phrase": "simulation_paradigm"}, {"score": 0.003140888248194296, "phrase": "newer_versions"}, {"score": 0.0030239842475439814, "phrase": "important_corollary"}, {"score": 0.0029620573986902416, "phrase": "existing_impossibility_results"}, {"score": 0.002707993764473537, "phrase": "large_classes"}, {"score": 0.0026893753781434618, "phrase": "two-party_functionalities"}, {"score": 0.002580315755140875, "phrase": "plain_model"}, {"score": 0.0024756677425317474, "phrase": "impossibility_results"}, {"score": 0.002358917661465133, "phrase": "non-black-box_simulation"}, {"score": 0.0022015970225369975, "phrase": "composition_guarantee"}, {"score": 0.0021049977753042253, "phrase": "security_definition"}], "paper_keywords": ["Secure computation", " Concurrent general composition", " Universal composability"], "paper_abstract": "Concurrent general composition relates to a setting where a secure protocol is run in a network concurrently with other, arbitrary protocols. Clearly, security in such a setting is what is desired, or even needed, in modern computer networks where many different protocols are executed concurrently. Canetti (FOCS 2001) introduced the notion of universal composability and showed that security under this definition is sufficient for achieving concurrent general composition. However, it is not known whether or not the opposite direction also holds. Our main result is a proof that security under concurrent general composition, when interpreted in the natural way under the simulation paradigm, is equivalent to a variant of universal composability, where the only difference relates to the order of quantifiers in the definition. (In newer versions of universal composability, these variants are equivalent.) An important corollary of this theorem is that existing impossibility results for universal composability (for all its variants) are inherent for definitions that imply security under concurrent general composition, as formulated here. In particular, there are large classes of two-party functionalities for which it is impossible to obtain protocols (in the plain model) that remain secure under concurrent general composition. We stress that the impossibility results obtained are not \"black-box,\" and apply even to non-black-box simulation. Our main result also demonstrates that the definition of universal composability is somewhat \"minimal\" in that the composition guarantee provided by universal composability implies the definition itself. This indicates that the security definition of universal composability is not overly restrictive.", "paper_title": "General Composition and Universal Composability in Secure Multiparty Computation", "paper_id": "WOS:000265092400005"}