{"auto_keywords": [{"score": 0.034534063912358345, "phrase": "grouping_information"}, {"score": 0.004594326191526569, "phrase": "basic_building_block"}, {"score": 0.004336556638639097, "phrase": "mix_networks"}, {"score": 0.0042436501739199495, "phrase": "active_attacks"}, {"score": 0.0039055075176836263, "phrase": "previous_countermeasures"}, {"score": 0.0038356264368681107, "phrase": "regroup-"}, {"score": 0.0034417406427881075, "phrase": "intermediate_mixes"}, {"score": 0.0033076455392068095, "phrase": "last_mix"}, {"score": 0.003178758306417406, "phrase": "public_key"}, {"score": 0.0031444844772458504, "phrase": "corresponding_mix"}, {"score": 0.0029041492019217033, "phrase": "timeout_alert"}, {"score": 0.0028418430688995247, "phrase": "ongoing_attack"}, {"score": 0.002790940765338191, "phrase": "findings_-_rg_mix"}, {"score": 0.002672454243212711, "phrase": "internal_and_external_attackers"}, {"score": 0.002320943211698446, "phrase": "successful_attack"}, {"score": 0.002279349794239273, "phrase": "-_rg_mix"}, {"score": 0.0022547515816852266, "phrase": "hidden_correlations"}, {"score": 0.002222365485177405, "phrase": "active_attack_prevention"}, {"score": 0.0021904435447196884, "phrase": "rg_mix"}, {"score": 0.002158979137177815, "phrase": "unpractical_requirements"}, {"score": 0.0021049977753042253, "phrase": "real-world_implementations"}], "paper_keywords": ["privacy", " computer networks"], "paper_abstract": "Purpose - The (n-1) attack is the most powerful attack against mix which is the basic building block of many modem anonymous systems. This paper aims to present a strategy that can be implemented in mix networks to detect and counter the active attacks, especially the (n-1) attack and its variants. Design/methodology/approach - Based on the analysis of the preconditions of a successful (n-1) attack and the limitations of previous countermeasures, this paper presents Regroup-And-Go mix (RG mix) for detecting and foiling the (n-1) attack. Messages are divided into groups by the sender, regrouped and forwarded at the intermediate mixes, and reordered and sent to the receiver at the last mix. The grouping information for each mix is encrypted with the public key of the corresponding mix. The messages are forwarded only when all the messages in the same group have arrived. When the regrouping of messages triggers a timeout alert, the mix detects the ongoing attack and takes countermeasures. Findings - RG mix can help foil and detect the (n-1) attacks from both internal and external attackers because the grouping information for the other mixes is unavailable for them. They can only guess which messages can constitute a group and randomly select some messages to have a try. Analysis and experiments show that the probability of successful attack is low. Originality/value - RG mix uses the hidden correlations between messages for active attack prevention and detection. RG mix does not have unpractical requirements and can be used in the real-world implementations.", "paper_title": "Regroup-And-Go mixes to counter the (n-1) attack", "paper_id": "WOS:000237578500007"}