{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_libraries"}, {"score": 0.010714731155541045, "phrase": "flow_experience"}, {"score": 0.00621082302008911, "phrase": "information_and_individual_performance"}, {"score": 0.0037632749713937637, "phrase": "research_model"}, {"score": 0.0035382855372646164, "phrase": "structural_equation_modeling"}, {"score": 0.002494466951433885, "phrase": "diversified_user_training"}, {"score": 0.0024311346712789553, "phrase": "potential_users"}, {"score": 0.002262209824105156, "phrase": "theoretical_development"}, {"score": 0.0022275639370573264, "phrase": "structural_model"}, {"score": 0.0021267708018655493, "phrase": "new_view"}, {"score": 0.0021049977753042253, "phrase": "digital_library_research"}], "paper_keywords": ["Digital libraries", " Technology Acceptance Model", " Individual performance", " Flow", " Self-efficacy", " Information seeking"], "paper_abstract": "Purpose - The purpose of this paper is to explore the antecedents of information seeking in digital libraries from the perspectives of the Technology Acceptance Model and flow experience, as well as the consequences from the perspectives of self-efficacy in getting information and individual performance. Design/methodology/approach - A research model is developed and tested using questionnaires and, partial least squares structural equation modeling. Findings - The effect of flow experience on information seeking in digital libraries is the largest one. Meanwhile, flow experience fully mediates the effects of ease of use and usefulness on information seeking in digital libraries which further leads to self-efficacy in getting information and individual performance. Practical implications - Librarians should help users to experience more stable and sustainable flow by providing dependable, prompt, personalized and professional service to them. Librarians should try their best to provide diversified user training so as to guide potential users to seek information in digital libraries. Originality/value - This study contributes to the theoretical development of the structural model exploring information seeking in digital libraries, presenting a new view for digital library research and practice alike.", "paper_title": "Understanding information seeking in digital libraries: antecedents and consequences", "paper_id": "WOS:000366468500006"}