{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "posterior_simulations"}, {"score": 0.02626973013346844, "phrase": "bayesian_computing"}, {"score": 0.004745665541429529, "phrase": "random_variable_objects"}, {"score": 0.004677372885331908, "phrase": "practical_bayesian_data_analysis"}, {"score": 0.004413846562278824, "phrase": "posterior_distribution"}, {"score": 0.004318881178805575, "phrase": "unknown_parameters"}, {"score": 0.003958937342925219, "phrase": "generating_posterior_predictive_distributions"}, {"score": 0.0031845067058084583, "phrase": "random_variable_object_type"}, {"score": 0.0022967713922705, "phrase": "new_programming_environment"}, {"score": 0.002182881082103045, "phrase": "missing-value_imputation"}, {"score": 0.0021049977753042253, "phrase": "regression_predictions"}], "paper_keywords": ["Bayesian inference", " Bayesian data analysis", " object-oriented programming", " posterior simulation", " random variable objects"], "paper_abstract": "Practical Bayesian data analysis involves manipulating and summarizing simulations from the posterior distribution of the unknown parameters. By manipulation we mean computing posterior distributions of functions of the unknowns, and generating posterior predictive distributions. The results need to be summarized both numerically and graphically. We introduce, and implement in R, an object-oriented programming paradigm based on a random variable object type that is implicitly represented by simulations. This makes it possible to define vector and array objects that may contain both random and deterministic quantities, and syntax rules that allow to treat these objects like any numeric vectors or arrays, providing a solution to various problems encountered in Bayesian computing involving posterior simulations. We illustrate the use of this new programming environment with examples of Bayesian computing, demonstrating missing-value imputation, nonlinear summary of regression predictions, and posterior predictive checking.", "paper_title": "Manipulating and summarizing posterior simulations using random variable objects", "paper_id": "WOS:000248818100003"}