{"auto_keywords": [{"score": 0.05007837343017582, "phrase": "adverse_drug_reactions"}, {"score": 0.04907545807893087, "phrase": "drug-target_interactions"}, {"score": 0.03828140730792708, "phrase": "less-characterized_drugs"}, {"score": 0.0337082311858877, "phrase": "imc"}, {"score": 0.0043678116213858, "phrase": "drug_development"}, {"score": 0.004330941610682453, "phrase": "clinical_safety"}, {"score": 0.00422218060227958, "phrase": "high_performance"}, {"score": 0.0038953958723049287, "phrase": "known_drug-adr_associations"}, {"score": 0.003797530813314321, "phrase": "overall_data_sets"}, {"score": 0.003593812067062062, "phrase": "insufficient_prior_knowledge"}, {"score": 0.0034445472801689046, "phrase": "novel_method"}, {"score": 0.0034154440860550564, "phrase": "new_drug_features"}, {"score": 0.00327356326590461, "phrase": "novel_matrix-completion_method"}, {"score": 0.0029191527226078286, "phrase": "different_ways"}, {"score": 0.002833689453299307, "phrase": "comprehensive_validations"}, {"score": 0.002750721367040336, "phrase": "new_approach"}, {"score": 0.0025591748412278174, "phrase": "tenfold_cross-validation"}, {"score": 0.0023013968622710847, "phrase": "cosine_similarity"}, {"score": 0.002243488734319232, "phrase": "imc."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Inductive matrix completion", " Adverse drug reactions", " Singleton", " Drug", " Target"], "paper_abstract": "Correctly and efficiently identifying associations between drugs and adverse drug reactions (ADRs) is critically important for drug development and clinical safety. Because of their low costs and high performance, many statistical and machine learning methods have been recently implemented to identify these associations. Most existing computer-aided methods for predicting ADRs mainly rely on known drug-ADR associations and achieve expected performances on overall data sets. However, they fail to predict ADRs for less-characterized drugs because of insufficient prior knowledge. To solve this problem, we present a novel method with new drug features. In this paper, we first applied a novel matrix-completion method called inductive matrix completion (IMC) to predict ADRs by combining features for drugs and ADRs. Then, similarities between drugs were calculated in different ways based on drug-target interactions. Finally, comprehensive validations were carried out to compare the new approach with four other typical approaches on various drug features. Comparison of approaches and features showed that no matter evaluated by tenfold cross-validation or prospective validation, IMC consistently performed well on both types of drugs, well-known or less studied. Moreover, the cosine similarity of drugs was prominent for IMC. Therefore, our method excels at predicting ADRs for less-characterized drugs. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Inductive matrix completion for predicting adverse drug reactions (ADRs) integrating drug-target interactions", "paper_id": "WOS:000355353700010"}