{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topological_relations"}, {"score": 0.02274310693209873, "phrase": "broad_boundaries"}, {"score": 0.022504720640870834, "phrase": "uncertain_regions"}, {"score": 0.006559853122370323, "phrase": "crisp_regions"}, {"score": 0.003947765701573287, "phrase": "processing_bbrs"}, {"score": 0.0035457302646174148, "phrase": "simple_regions"}, {"score": 0.0033602844686125375, "phrase": "new_topological_information"}, {"score": 0.0030017207229983385, "phrase": "basic_topological_relations"}, {"score": 0.002568435291444709, "phrase": "reasoning_mechanism"}, {"score": 0.0023189818169615135, "phrase": "multi-resolution_spatial_databases"}, {"score": 0.0022213218042340735, "phrase": "complete_or_incomplete_symbolic_description"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["geographical information system", " 4-tuple representation", " regions with broad boundaries", " reasoning of topological relations"], "paper_abstract": "Uncertain regions can be represented as having broad boundaries (BBRs) and their topological relations can be modeled by the extended 9-intersection. In order to satisfy the need for querying, managing, and processing BBRs, this study presents a 4-tuple representation of topological relations between BBRs, and a method in which the relations between simple regions with broad boundaries (SBBRs) are used to infer new topological information. The 4-tuple representation can distinguish the same topological relations as identified by the extended 9-intersection. Since the 4-tuple uses combinations of the basic topological relations between crisp regions to describe the relations between uncertain regions, the reasoning of topological relations between SBBRs can be obtained by combining the results of those between crisp regions. The reasoning mechanism can be used in several applications, such as. to evaluate the consistency of topological relations between uncertain regions in multi-resolution spatial databases and to assess the consistency of a complete or incomplete symbolic description of a spatial scene. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Reasoning about topological relations between regions with broad boundaries", "paper_id": "WOS:000253088500006"}