{"auto_keywords": [{"score": 0.03219771999225611, "phrase": "flame_sender"}, {"score": 0.0318468401138975, "phrase": "flame_recipient"}, {"score": 0.00481495049065317, "phrase": "computer-mediated_negotiations"}, {"score": 0.004725385523804256, "phrase": "increasing_use"}, {"score": 0.004690025569165577, "phrase": "computer_media"}, {"score": 0.004534136929881113, "phrase": "computer-mediated_channels"}, {"score": 0.004483328889361545, "phrase": "hostile_expressions"}, {"score": 0.004269630481719451, "phrase": "important_effects"}, {"score": 0.0038721890530859578, "phrase": "negotiation_research"}, {"score": 0.003591733916159209, "phrase": "negotiating_opponent"}, {"score": 0.003356675879109443, "phrase": "negotiating_context"}, {"score": 0.0032817813775647756, "phrase": "communication_channel"}, {"score": 0.003078504229140364, "phrase": "concession_behaviors"}, {"score": 0.0029095936591723645, "phrase": "negotiated_agreement"}, {"score": 0.0028661330049356186, "phrase": "laboratory_study"}, {"score": 0.002770698757048806, "phrase": "negotiation_opponent"}, {"score": 0.0024105326885334962, "phrase": "negotiation_context"}, {"score": 0.002218933616777076, "phrase": "flame_senders"}, {"score": 0.0021693692831601745, "phrase": "flame_recipients"}, {"score": 0.002128910637262527, "phrase": "important_basis"}, {"score": 0.0021049977753042253, "phrase": "strategic_use"}], "paper_keywords": ["flaming", " computer mediation", " negotiation", " concession", " emotion", " affect"], "paper_abstract": "There is an increasing use of computer media for negotiations. However, the use of computer-mediated channels increases the hostile expressions of emotion, termed flaming. Although researchers agree that flaming has important effects on negotiation, predictions concerning these effects are inconsistent, suggesting a need for further investigation. We address this need by extending current flaming and negotiation research in two ways. First, we identify two different types of flaming: that which is motivated by perceptions concerning the negotiating opponent (e. g., he/she is unfair) and that which is motivated by perceptions concerning the negotiating context (e. g., the communication channel is too slow). Second, we differentiate between the effects of flaming on the concession behaviors of the flame sender and the flame recipient, and the effects of these behaviors on negotiated agreement. Via a laboratory study, we demonstrate that flames directed at the negotiation opponent slightly decrease the likelihood of reaching an agreement, and when an agreement is reached, it result in outcomes significantly favoring the flame recipient rather than the flame sender. In contrast, flames directed at the negotiation context significantly increase the likelihood of agreement, although outcomes still favor the flame recipient over the flame sender. These results suggest that flame senders are generally worse off than flame recipients, which provides an important basis for the strategic use of flaming in negotiations.", "paper_title": "The effect of flaming on computer-mediated negotiations", "paper_id": "WOS:000260470100010"}