{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_traffic"}, {"score": 0.004674952036988355, "phrase": "commonly_used_measures"}, {"score": 0.004635701867952543, "phrase": "traffic_burstiness"}, {"score": 0.004500891637057374, "phrase": "traffic_variability"}, {"score": 0.004444317282171449, "phrase": "entire_range"}, {"score": 0.003818210967854446, "phrase": "typical_network_traffic_process"}, {"score": 0.0035389348527719404, "phrase": "closed-form_expressions"}, {"score": 0.0032115093493071366, "phrase": "-variability_curves"}, {"score": 0.003014422649429416, "phrase": "network_traffic_variability"}, {"score": 0.0029764767329116875, "phrase": "network_performance"}, {"score": 0.0029639342245188203, "phrase": "relevant_time-scales"}, {"score": 0.002889778121878728, "phrase": "practical_method"}, {"score": 0.0024926348205500715, "phrase": "real_network_traffic"}, {"score": 0.0023395610923736595, "phrase": "qualitative_differences"}, {"score": 0.00231987280116332, "phrase": "traffic_traces"}, {"score": 0.0022906498741695094, "phrase": "different_networks"}, {"score": 0.0021049977753042253, "phrase": "existing_tools"}], "paper_keywords": ["Measure of traffic variability", " network traffic burstiness"], "paper_abstract": "Commonly used measures of traffic burstiness do not capture the fluctuation of traffic variability over the entire range of time-scales. In this paper, we present a measure of variability, called the Index of Variability (H(v)(T)), that depicts the degree of variability (burstiness) of a typical network traffic process at each time-scale and is analytically tractable for many traffic models. As an illustration, we derive the closed-form expressions of H(v)(T) for two traditional traffic models and generate a variety of two-dimensional (2D) and three-dimensional (3D) Index-of-Variability curves. These curves demonstrate that the Index of Variability can help in determining the complexities of the network traffic variability over the network performance relevant time-scales. We then introduce a practical method for estimating the Index-of-Variability curve from a given traffic trace. Using this method, we estimate the Index-of-Variability curves for 12 long NLANR network traffic traces. The results indicate that the variability of real network traffic varies with time-scales and that the Index of Variability has the ability to discern qualitative differences between traffic traces obtained from different networks. Thus, the Index of Variability offers the potential to gain insights into the dynamics of network traffic that existing tools do not offer.", "paper_title": "Describing Network Traffic Using the Index of Variability", "paper_id": "WOS:000270747600024"}