{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiobjective_optimization"}, {"score": 0.004735414083933722, "phrase": "fundamental_concept"}, {"score": 0.003929177231678094, "phrase": "real_spaces"}, {"score": 0.0038900709793274484, "phrase": "large_number"}, {"score": 0.0038642157757169315, "phrase": "non-dominated_solutions"}, {"score": 0.003749969582830009, "phrase": "moo_techniques"}, {"score": 0.003700279655380723, "phrase": "relaxed_forms"}, {"score": 0.0035789061301304977, "phrase": "faster_convergence"}, {"score": 0.003404244237372396, "phrase": "epsilon-sized_grids"}, {"score": 0.0029789104204803137, "phrase": "novel_way"}, {"score": 0.00285242509099472, "phrase": "objective_function"}, {"score": 0.002572001496778222, "phrase": "epsilon_values"}, {"score": 0.002554923872917995, "phrase": "pbe"}, {"score": 0.0025125868638809284, "phrase": "archived_simulated_annealing_based_moo_technique"}, {"score": 0.0023739321566540682, "phrase": "pbe_based_amosa"}, {"score": 0.0023346234464901978, "phrase": "pbe-amosa"}, {"score": 0.0022806798371116698, "phrase": "amosa"}, {"score": 0.002242911772136627, "phrase": "conventional_epsilon"}, {"score": 0.0022279798606617356, "phrase": "version_epsilon-amosa"}, {"score": 0.0021620042653528846, "phrase": "benchmark_test_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["epsilon-dominance", " Multiobjective simulated annealing", " Multiobjective knapsack problem", " PBE-AMOSA"], "paper_abstract": "Dominance is a fundamental concept in Multiobjective Optimization (MOO) where a solution is said to,dominate the other if it is better in at least one objective, and same as or better in the other objectives. Given a pair of solutions, if neither dominates the other, then the solutions are said to be non-dominated. In real spaces, a large number of non-dominated solutions can exist in principle, making convergence of MOO techniques rather slow. Relaxed forms of dominance have been proposed in the literature for faster convergence. One such form is the epsilon-dominance, which in principle, partitions the space into epsilon-sized grids. The value of epsilon is often user defined and the performance of epsilon-dominance based multi-objective evolutionary algorithms (epsilon-MOEAs) critically depends on the value of epsilon. In this article we propose a novel way of determining the value of epsilon, which is different for each objective function, based on the correlation between them. We call this approach Priority Based epsilon (PBE) as the method ranks the objectives according to their priority before calculating the epsilon values. PBE is incorporated in an archived simulated annealing based MOO technique called AMOSA. AMOSA has been earlier shown to outperform several well-known MOO techniques especially for many objective optimization. PBE based AMOSA, referred to as PBE-AMOSA, is found to comprehensively outperform AMOSA, MOEA/D-DE, the conventional epsilon based version epsilon-AMOSA and epsilon-MOEA both in case of benchmark test problems and 0/1 knapsack problem. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Priority based epsilon dominance: A new measure in multiobjective optimization", "paper_id": "WOS:000352037100006"}