{"auto_keywords": [{"score": 0.036970649887962836, "phrase": "efficient_comparison"}, {"score": 0.0365546744612873, "phrase": "conformational_space"}, {"score": 0.004648995193787914, "phrase": "ligand-based_virtual_screening"}, {"score": 0.004055998173160551, "phrase": "multiple_conformer_data_sets"}, {"score": 0.003916098498242888, "phrase": "significant_computational_overhead"}, {"score": 0.0038106195546165574, "phrase": "special_conformational_space_encoding"}, {"score": 0.0037516215763875225, "phrase": "gaussian_mixture_models"}, {"score": 0.0037079710789139305, "phrase": "similarity_function"}, {"score": 0.003552204377093386, "phrase": "model-based_encoding"}, {"score": 0.0030745737579268876, "phrase": "multiple_conformers"}, {"score": 0.0030506626796257077, "phrase": "inferior_results"}, {"score": 0.0028996963188373144, "phrase": "filtered_directory_of_useful_decoys"}, {"score": 0.002888396879326153, "phrase": "data_sets"}, {"score": 0.0027886573969044042, "phrase": "auc_value"}, {"score": 0.0024418934977061876, "phrase": "robust_performance"}, {"score": 0.0023946630984825207, "phrase": "conformational_space_encoding"}, {"score": 0.002171836484200008, "phrase": "single_desktop_cpu"}, {"score": 0.0021049977753042253, "phrase": "real-world_applications"}], "paper_keywords": [""], "paper_abstract": "Background: The performance of 3D-based virtual screening similarity functions is affected by the applied conformations of compounds. Therefore, the results of 3D approaches are often less robust than 2D approaches. The application of 3D methods on multiple conformer data sets normally reduces this weakness, but entails a significant computational overhead. Therefore, we developed a special conformational space encoding by means of Gaussian mixture models and a similarity function that operates on these models. The application of a model-based encoding allows an efficient comparison of the conformational space of compounds. Results: Comparisons of our 4D flexible atom-pair approach with over 15 state-of-the-art 2D- and 3D-based virtual screening similarity functions on the 40 data sets of the Directory of Useful Decoys show a robust performance of our approach. Even 3D-based approaches that operate on multiple conformers yield inferior results. The 4D flexible atom-pair method achieves an averaged AUC value of 0.78 on the filtered Directory of Useful Decoys data sets. The best 2D- and 3D-based approaches of this study yield an AUC value of 0.74 and 0.72, respectively. As a result, the 4D flexible atom-pair approach achieves an average rank of 1.25 with respect to 15 other state-of-the-art similarity functions and four different evaluation metrics. Conclusions: Our 4D method yields a robust performance on 40 pharmaceutically relevant targets. The conformational space encoding enables an efficient comparison of the conformational space. Therefore, the weakness of the 3D-based approaches on single conformations is circumvented. With over 100,000 similarity calculations on a single desktop CPU, the utilization of the 4D flexible atom-pair in real-world applications is feasible.", "paper_title": "4D Flexible Atom-Pairs: An efficient probabilistic conformational space comparison for ligand-based virtual screening", "paper_id": "WOS:000300227100001"}