{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parameter-less_population_pyramid"}, {"score": 0.004580550308652044, "phrase": "recently_introduced_method"}, {"score": 0.004504969093304219, "phrase": "evolutionary_optimization"}, {"score": 0.004406121974246201, "phrase": "user-specified_parameters"}, {"score": 0.004238307626560739, "phrase": "generational_model"}, {"score": 0.004122351497440992, "phrase": "multiple_populations"}, {"score": 0.0036892809673917592, "phrase": "problem_difficulty"}, {"score": 0.003628352506247126, "phrase": "previously_learned_information"}, {"score": 0.003509487090932835, "phrase": "seven_problems"}, {"score": 0.003283272764794988, "phrase": "five_advanced_comparison_algorithms"}, {"score": 0.002873524721802591, "phrase": "algorithm_analysis"}, {"score": 0.0025287979714720423, "phrase": "best_comparison_algorithms"}, {"score": 0.0023788319661581696, "phrase": "problem-specific_tuning"}, {"score": 0.0023136311468961125, "phrase": "previous_parameter-less_methods"}], "paper_keywords": ["Genetic algorithms", " linkage learning", " local search", " parameter-less"], "paper_abstract": "The parameter-less population pyramid (P3) is a recently introduced method for performing evolutionary optimization without requiring any user-specified parameters. P3's primary innovation is to replace the generational model with a pyramid of multiple populations that are iteratively created and expanded. In combination with local search and advanced crossover, P3 scales to problem difficulty, exploiting previously learned information before adding more diversity. Across seven problems, each tested using on average 18 problem sizes, P3 outperformed all five advanced comparison algorithms. This improvement includes requiring fewer evaluations to find the global optimum and better fitness when using the same number of evaluations. Using both algorithm analysis and comparison, we find P3's effectiveness is due to its ability to properly maintain, add, and exploit diversity. Unlike the best comparison algorithms, P3 was able to achieve this quality without any problem-specific tuning. Thus, unlike previous parameter-less methods, P3 does not sacrifice quality for applicability. Therefore we conclude that P3 is an efficient, general, parameter-less approach to black box optimization which is more effective than existing state-of-the-art techniques.", "paper_title": "Fast and Efficient Black Box Optimization Using the Parameter-less Population Pyramid", "paper_id": "WOS:000362839000005"}