{"auto_keywords": [{"score": 0.04902663615016438, "phrase": "art_historians"}, {"score": 0.015719716506582538, "phrase": "image_use"}, {"score": 0.004639822587124109, "phrase": "purpose_-_the_purpose"}, {"score": 0.004487635647709636, "phrase": "research_study"}, {"score": 0.004324361008753555, "phrase": "professional_image_users"}, {"score": 0.004198010835867604, "phrase": "information_systems"}, {"score": 0.003941592232278979, "phrase": "art_historian"}, {"score": 0.0038263829059336564, "phrase": "qualitative_research_study"}, {"score": 0.00370077772049505, "phrase": "one-on-one_semi-structured_interview"}, {"score": 0.0036059320136308808, "phrase": "case-ordered_displays"}, {"score": 0.003566028957296066, "phrase": "constant_comparative_method"}, {"score": 0.0030856268625708695, "phrase": "design_creation"}, {"score": 0.0028862231180242053, "phrase": "conceptual_model"}, {"score": 0.0028436862612859896, "phrase": "cognitive_recall"}, {"score": 0.002822652835367827, "phrase": "critical_thinking"}, {"score": 0.002719790133195399, "phrase": "social_connection"}, {"score": 0.0026109540617641593, "phrase": "user_groups"}, {"score": 0.002553431170229379, "phrase": "participants'_abilities"}, {"score": 0.0024240794798626674, "phrase": "varied_roles"}, {"score": 0.00241509422805775, "phrase": "visual_information"}, {"score": 0.0021604504765314497, "phrase": "systems_designers"}, {"score": 0.0021049977753042253, "phrase": "image_users"}], "paper_keywords": ["Image behaviors", " Image use", " Visual information"], "paper_abstract": "Purpose - The purpose of this paper is to report on a research study which examined how and why images were used by professional image users to inform the design and development of information systems and services. Design/methodology/approach - A total of 20 participants in four user groups, archaeologist, architect, art historian and artist, took part in this qualitative research study. Data was collected through a survey and one-on-one semi-structured interview and data analysis was completed using case-ordered displays and the constant comparative method. Findings - The findings revealed that image use varied according to profession. Archaeologists and art historians identified using images within their lecture presentations, and for research and publications. While architects and artists noted using images for research and design creation, their work products differed. Several reasons why these professionals used images in their work were identified: knowledge, conceptual model, inspiration, cognitive recall, critical thinking, emotion, engagement, marketing, proof, social connection, translation, and trust Research limitations/implications - Study limitations include the small number of user groups, and methods dependent on participants' abilities to recall and clearly articulate past activities. Originality/value - The study clarifies the varied roles visual information plays in the work of archaeologists, architects, art historians and artists. As the paper reveals how and why images are used, its contents are particularly useful for systems designers, librarians and other individuals who support image users.", "paper_title": "A framework of image use among archaeologists, architects, art historians and artists", "paper_id": "WOS:000329769200008"}