{"auto_keywords": [{"score": 0.04961956293585017, "phrase": "regional_scale"}, {"score": 0.03863803926884115, "phrase": "sliding_surface"}, {"score": 0.007686809235237251, "phrase": "computer_code"}, {"score": 0.00481495049065317, "phrase": "landslides_volume"}, {"score": 0.004558855900816642, "phrase": "landslide_dams"}, {"score": 0.004372207937638619, "phrase": "depleted_material"}, {"score": 0.003931879808909078, "phrase": "river_blockage"}, {"score": 0.003524377837382856, "phrase": "landslide_material"}, {"score": 0.0032941315867266495, "phrase": "italy"}, {"score": 0.0032623406075681315, "phrase": "first_level"}, {"score": 0.0032309820601312787, "phrase": "iffi"}, {"score": 0.002952414496287241, "phrase": "slope_movement"}, {"score": 0.002886598310196588, "phrase": "iffi_project"}, {"score": 0.002858841145587906, "phrase": "vector_maps"}, {"score": 0.002777156434571452, "phrase": "main_sliding_direction"}, {"score": 0.002637644120899848, "phrase": "adequate_approximation"}, {"score": 0.002570531747243578, "phrase": "rotational_slides"}, {"score": 0.0025051226957195634, "phrase": "geologic_maps"}, {"score": 0.0024571577953004546, "phrase": "geotechnical_parameters"}, {"score": 0.002296381861149051, "phrase": "slope_stability"}, {"score": 0.0022379331011153146, "phrase": "simplified_janbu_method"}, {"score": 0.0021739507091654755, "phrase": "gnu-linux_os"}, {"score": 0.0021186115162176457, "phrase": "grass_gis"}, {"score": 0.0021049977753042253, "phrase": "r_statistical_software"}], "paper_keywords": ["GRASS GIS", " Landslide volume", " 3D slope stability analysis"], "paper_abstract": "Dealing with the evaluation of the risk connected to the formation of landslide dams at regional scale, it is important to estimate the volume of the depleted material that can reach the riverbed. This information, combined with other elements (river dimensions, valley width, landslide velocity, etc.) allows making predictions on the possibility of river blockage. One of the problems of this approach is the lack of data concerning the shape and position of the sliding surface; this does not permit us to estimate the volume of the landslide material. The IFFI (Inventario dei Fenomeni Franosi in Italia, i.e. Landslide Inventory in Italy) project furnishes information, at different levels of precision, on nearly totality of the landslides existing in Italy. The first level of the IFFI (compiled for all slides) does not contain information on the depth of the sliding surface but contains data regarding the type and the activity of the slope movement. Along with this information the IFFI project also furnishes vector maps containing the boundary of each landslide and the main sliding direction. This paper describes the implementation of an algorithm aimed to define, with an adequate approximation, the 3D geometry of the sliding surface of rotational slides for which, on the basis of geologic maps available at regional scale, some geotechnical parameters can be known or estimated. The work also required the creation of a computer code useful for the 3D analysis of slope stability (3D safety factor) using the simplified Janbu method. All computer code has been created on a GNU-Linux OS and using shell scripting, based on GRASS GIS and R statistical software.", "paper_title": "A preliminary method for the evaluation of the landslides volume at a regional scale", "paper_id": "WOS:000266162800004"}