{"auto_keywords": [{"score": 0.033362822135817066, "phrase": "rmcb"}, {"score": 0.012352033422440024, "phrase": "wsn"}, {"score": 0.005124497689488527, "phrase": "monte_carlo"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004747314816584038, "phrase": "great_potential"}, {"score": 0.004720526055343478, "phrase": "ubiquitous_computing"}, {"score": 0.004654210559456924, "phrase": "severe_resource_constraints"}, {"score": 0.004627944735913613, "phrase": "wsn_rule"}, {"score": 0.004524348699657099, "phrase": "careful_design"}, {"score": 0.004460776815459387, "phrase": "energy_conservation"}, {"score": 0.0044359234202934065, "phrase": "sensor_hardware"}, {"score": 0.004385663349966071, "phrase": "key_infrastructural_problem"}, {"score": 0.004251210982670317, "phrase": "geographical_locations"}, {"score": 0.004074457750151711, "phrase": "global_positioning_systems"}, {"score": 0.004028572475177205, "phrase": "non-seed_nodes"}, {"score": 0.003817548980308163, "phrase": "different_scenarios"}, {"score": 0.0031308163228919773, "phrase": "wsn._rmcb"}, {"score": 0.002916650173868229, "phrase": "ranging_capabilities"}, {"score": 0.0028756028995504035, "phrase": "small_fraction"}, {"score": 0.002803164004793949, "phrase": "received_signal_strength_measurements"}, {"score": 0.002656158309155626, "phrase": "range-based_localization_work"}, {"score": 0.00263366036297493, "phrase": "range-free_localization"}, {"score": 0.0025892330566358503, "phrase": "empirical_signal_strength_data"}, {"score": 0.00241887505439182, "phrase": "localization_error"}, {"score": 0.0023579143175099324, "phrase": "similar_computational_complexity"}, {"score": 0.0023445770108033288, "phrase": "wmcl."}, {"score": 0.002318127769195112, "phrase": "wmcl"}, {"score": 0.002184076393632467, "phrase": "range_estimation"}, {"score": 0.0021049977753042253, "phrase": "range-based_localization"}], "paper_keywords": ["Wireless sensor networks", " Localization", " Ranging", " Monte Carlo sampling"], "paper_abstract": "Wireless sensor networks (WSN) have great potential in ubiquitous computing. However, the severe resource constraints of WSN rule out the use of many existing networking protocols and require careful design of systems that prioritizes energy conservation over performance optimization. A key infrastructural problem in WSN is localization-the problem of determining the geographical locations of nodes. WSN typically have some nodes called seeds that know their locations using global positioning systems or other means. Non-seed nodes compute their locations by exchanging messages with nodes within their radio range. Several algorithms have been proposed for localization in different scenarios. Algorithms have been designed for networks in which each node has ranging capabilities, i.e., can estimate distances to its neighbours. Other algorithms have been proposed for networks in which no node has such capabilities. Some algorithms only work when nodes are static. Some other algorithms are designed specifically for networks in which all nodes are mobile. We propose a very general, fully distributed localization algorithm called range-based Monte Carlo boxed (RMCB) for WSN. RMCB allows nodes to be static or mobile and that can work with nodes that can perform ranging as well as with nodes that lack ranging capabilities. RMCB uses a small fraction of seeds. It makes use of the received signal strength measurements that are available from the sensor hardware. We use RMCB to investigate the question: \"When does range-based localization work better than range-free localization?\" We demonstrate using empirical signal strength data from sensor hardware (Texas Instruments EZ430-RF2500) and simulations that RMCB outperforms a very good range-free algorithm called weighted Monte Carlo localization (WMCL) in terms of localization error in a number of scenarios and has a similar computational complexity to WMCL. We also implement WMCL and RMCB on sensor hardware and demonstrate that it outperforms WMCL. The performance of RMCB depends critically on the quality of range estimation. We describe the limitations of our range estimation approach and provide guidelines on when range-based localization is preferable.", "paper_title": "Efficient and accurate sensor network localization", "paper_id": "WOS:000333341000009"}