{"auto_keywords": [{"score": 0.049198528177459636, "phrase": "rear-end_collisions"}, {"score": 0.033487695187782704, "phrase": "brake_lights"}, {"score": 0.00481495049065317, "phrase": "dynamic_brake_light_concept"}, {"score": 0.0046394362688524475, "phrase": "optical_looming"}, {"score": 0.0044702911400353535, "phrase": "optical_looming_cues"}, {"score": 0.004408456735066782, "phrase": "lead_vehicle's_brake_lights"}, {"score": 0.004036141321779216, "phrase": "low-fidelity_driving_simulator"}, {"score": 0.0038708810091769856, "phrase": "leading_vehicle"}, {"score": 0.0036780770650562036, "phrase": "lv"}, {"score": 0.003336031521101184, "phrase": "fv_headlights"}, {"score": 0.0032745778756077693, "phrase": "lv_braking_events"}, {"score": 0.003011706511096639, "phrase": "nominally_imperceptible_amount"}, {"score": 0.002942495422585405, "phrase": "effective_virtual_time_shift"}, {"score": 0.0028615323526689582, "phrase": "lv._results"}, {"score": 0.0026195184143518713, "phrase": "lv_brake_lights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["optical looming", " rear-end collision", " emergency braking", " dynamic brake lights"], "paper_abstract": "The concept of dynamically manipulating the optical looming cues of a lead vehicle's brake lights is investigated as a means of potentially reducing the frequency of rear-end collisions in automobile driving. In a low-fidelity driving simulator, 40 participants were instructed to follow a leading vehicle (LV) and appropriately respond to braking of the LV, under three visibility conditions: day, night-time with following vehicle (FV) headlights, and night-time without FV headlights. During some LV braking events, separation and size of the brake lights of the LV were expanded or contracted, by a nominally imperceptible amount, to simulate an effective virtual time shift in the headway of the LV. Results show that this manipulation was most effective for very poor visibility conditions: at night with no headlights, for which LV brake lights were most salient. When confronting a LV with expanding or contracting brake lights, subjects generally braked sooner or later respectively, in comparison with the no manipulation case. The concept shows some promise for causing drivers to brake sooner in emergencies. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An empirical investigation of a dynamic brake light concept for reduction of rear-end collisions through manipulation of optical looming", "paper_id": "WOS:000254064700004"}