{"auto_keywords": [{"score": 0.047961161866622415, "phrase": "unified_security_practices"}, {"score": 0.03671879024692416, "phrase": "pmt"}, {"score": 0.00481495049065317, "phrase": "individual_security_behaviors"}, {"score": 0.004427366754240748, "phrase": "security_threats"}, {"score": 0.004286708921931472, "phrase": "home_computers"}, {"score": 0.003531474887552889, "phrase": "protection_motivation_theory"}, {"score": 0.00306334226516593, "phrase": "generic_measure"}, {"score": 0.0030239842475439814, "phrase": "security_protection_tools"}, {"score": 0.002639968630788011, "phrase": "newly_developed_measure"}, {"score": 0.002427035025924384, "phrase": "important_portion"}, {"score": 0.002202547013259953, "phrase": "individual_security_practices"}], "paper_keywords": ["Information Security", " Security Practices", " Protection Motivation Theory", " Home User"], "paper_abstract": "Security threats regularly affect users of home computers. As such, it is important to understand the practices of users for protecting their computers and networks, and to identify determinants of these practices. Several recent studies utilize Protection Motivation Theory (PMT) to explore these practices. However, these studies focus on one specific security protection behavior or on intentions to use a generic measure of security protection tools or techniques (practices). In contrast, this study empirically tests the effectiveness of PMT to explain a newly developed measure for collectively capturing several individual security practices. The results show that PMT explains an important portion of the variance in the unified security practices measure, and demonstrates the importance of explaining individual security practices as a whole as opposed to one particular behavior individually. Implications of the study for research and practice are discussed.", "paper_title": "An Extended Perspective on Individual Security Behaviors: Protection Motivation Theory and a Unified Security Practices (USP) Instrument", "paper_id": "WOS:000345630100003"}