{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "differential_analysis"}, {"score": 0.00392125815948488, "phrase": "co-expression_analysis_aim"}, {"score": 0.0037793152987497286, "phrase": "wide_range"}, {"score": 0.0034738037330064885, "phrase": "expected_gene_behavior"}, {"score": 0.0034193226278107346, "phrase": "known_links"}, {"score": 0.003278167066287366, "phrase": "previously_unseen_specific_effects"}, {"score": 0.0030935140058168885, "phrase": "expected_behavior"}, {"score": 0.0029038817737006405, "phrase": "linear_regression_models"}, {"score": 0.002769304577201566, "phrase": "gene_specific_prediction_accuracy_distributions"}, {"score": 0.002440071551819324, "phrase": "novel_way"}, {"score": 0.0023891283748647416, "phrase": "experiment_specificity"}, {"score": 0.0022904032758108775, "phrase": "validation_procedure"}, {"score": 0.0021049977753042253, "phrase": "average_accuracy"}], "paper_keywords": ["algorithms", " biochemical networks", " cancer genomics", " DNA arrays"], "paper_abstract": "The differential analysis of genes between microarrays from several experimental conditions or treatments routinely estimates which genes change significantly between groups. As genes are never regulated individually, observed behavior may be a consequence of changes in other genes. Existing approaches like co-expression analysis aim to resolve such patterns from a wide range of experiments. The knowledge of such a background set of experiments can be used to compute expected gene behavior based on known links. It is particularly interesting to detect previously unseen specific effects in other experiments. Here, a new method to spot genes deviating from expected behavior (PAttern DEviation SCOring Padesco) is devised. It uses linear regression models learned from a background set to arrive at gene specific prediction accuracy distributions. For a given experiment, it is then decided whether each gene is predicted better or worse than expected. This provides a novel way to estimate the experiment specificity of each gene. We propose a validation procedure to estimate the detection of such specific candidates and show that these can be identified with an average accuracy of about 85%.", "paper_title": "Experiment Specific Expression Patterns", "paper_id": "WOS:000296891100006"}