{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "acca"}, {"score": 0.008259924617223975, "phrase": "dcca"}, {"score": 0.006158618783891547, "phrase": "similar_pattern"}, {"score": 0.004751216062917875, "phrase": "co-regulated_genes"}, {"score": 0.004638602678192715, "phrase": "distance_based_clustering_algorithms"}, {"score": 0.004565007074039171, "phrase": "similar_expression_values"}, {"score": 0.004540734419151103, "phrase": "multiple_experimental_conditions"}, {"score": 0.004038076978795421, "phrase": "correlation_clustering"}, {"score": 0.003818107035361389, "phrase": "new_clustering_algorithm"}, {"score": 0.00378767277402891, "phrase": "average_correlation_clustering_algorithm"}, {"score": 0.003687960013746783, "phrase": "better_clustering_solution"}, {"score": 0.003256861527695211, "phrase": "zip_file"}, {"score": 0.0032272929113113203, "phrase": "correlation_clustering_concept"}, {"score": 0.003201552914322119, "phrase": "bansal_et_al"}, {"score": 0.003159106878239524, "phrase": "correlation_matrix"}, {"score": 0.003067689908193796, "phrase": "highest_average_correlation_values"}, {"score": 0.002955145580455969, "phrase": "well-known_conventional_methods"}, {"score": 0.0028391271282216758, "phrase": "clustering_results"}, {"score": 0.0027495914857929584, "phrase": "biological_annotations"}, {"score": 0.002431699464104896, "phrase": "c_and_visual_basic"}, {"score": 0.0023739321566540682, "phrase": "microsoft_windows_platforms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Transcription factors", " Correlation clustering", " P-Value", " z-Score", " Functional enrichment"], "paper_abstract": "Distance based clustering algorithms can group genes that show similar expression values under multiple experimental conditions. They are unable to identify a group of genes that have similar pattern of variation in their expression values. Previously we developed an algorithm called divisive correlation clustering algorithm (DCCA) to tackle this situation, which is based on the concept of correlation clustering. But this algorithm may also fail for certain cases. In order to overcome these situations, we propose a new clustering algorithm, called average correlation clustering algorithm (ACCA), which is able to produce better clustering solution than that produced by some others. ACCA is able to find groups of genes having more common transcription factors and similar pattern of variation in their expression values. Moreover, ACCA is more efficient than DCCA with respect to the time of execution. Like DCCA, we use the concept of correlation clustering concept introduced by Bansal et al. ACCA uses the correlation matrix in such a way that all genes in a cluster have the highest average correlation values with the genes in that cluster. We have applied ACCA and some well-known conventional methods including DCCA to two artificial and nine gene expression datasets, and compared the performance of the algorithms. The clustering results of ACCA are found to be more significantly relevant to the biological annotations than those of the other methods. Analysis of the results show the superiority of ACCA over some others in determining a group of genes having more common transcription factors and with similar pattern of variation in their expression profiles. Availability of the software: The software has been developed using C and Visual Basic languages, and can be executed on the Microsoft Windows platforms. The software may be downloaded as a zip file from http://www.isical.acin/similar to rajat. Then it needs to be installed. Two word files (included in the zip file) need to be consulted before installation and execution of the software. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Average correlation clustering algorithm (ACCA) for grouping of co-regulated genes with similar pattern of variation in their expression values", "paper_id": "WOS:000280025300008"}