{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "periodic_preventive_maintenance"}, {"score": 0.027920842522465426, "phrase": "artificial_immune_system"}, {"score": 0.004761850836420121, "phrase": "flexible_flowshop_scheduling_problems"}, {"score": 0.004333406378146173, "phrase": "production_scheduling"}, {"score": 0.004191540451296395, "phrase": "great_attempts"}, {"score": 0.004076858589744185, "phrase": "preventive_maintenance"}, {"score": 0.004009555045206973, "phrase": "different_methods"}, {"score": 0.003490056936165004, "phrase": "specific_features"}, {"score": 0.0034324073240680213, "phrase": "original_considered_problem"}, {"score": 0.002921815042028607, "phrase": "flexible_flowshops"}, {"score": 0.0026584843838039166, "phrase": "genetic_algorithm"}, {"score": 0.0025713100093065645, "phrase": "constructive_heuristics"}, {"score": 0.002262756631083292, "phrase": "computational_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Scheduling", " Flexible flowshops", " Periodic preventive maintenance", " Genetic algorithm", " Artificial immune algorithm", " Constructive heuristic"], "paper_abstract": "One of the most thoroughly studied scheduling assumptions is considering that machines may not be periodically available during the production scheduling. Although many researchers have made great attempts at integrating production and preventive maintenance scheduling by different methods, some of these methods are so intricate that one cannot independently code them to achieve the same effectiveness, or some strongly utilize specific features of the original considered problem that one cannot extend to other problems. This paper intends to apply integrating methods simple, yet easily extendible to any other machine scheduling problems. The paper investigates scheduling flexible flowshops subject to periodic preventive maintenance on machines. The objective is to minimize makespan. Two metaheuristics, including genetic algorithm and artificial immune system, and some constructive heuristics are developed to tackle the problem. The performance of the algorithms is evaluated by comparing their solutions. The results of the computational experiments indicate that the artificial immune system outperforms the other methods. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Incorporating periodic preventive maintenance into flexible flowshop scheduling problems", "paper_id": "WOS:000286373200061"}