{"auto_keywords": [{"score": 0.03564752791514836, "phrase": "web_site"}, {"score": 0.010612387000973441, "phrase": "ambulatory_orthopedic_surgical_patient_education_web_site"}, {"score": 0.006309575217647169, "phrase": "web_site_evaluators'_scores"}, {"score": 0.00456020621016909, "phrase": "web_sites"}, {"score": 0.0045108906244892165, "phrase": "ambulatory_surgery"}, {"score": 0.004486432283770142, "phrase": "patients'_education"}, {"score": 0.0029029754274913803, "phrase": "diary_of_the_use_of_the_website"}, {"score": 0.002646267286675984, "phrase": "web_site_evaluations"}, {"score": 0.002186849855560281, "phrase": "educational_material"}, {"score": 0.0021631447601689444, "phrase": "orthopedic_surgery_patients"}, {"score": 0.0021049977753042253, "phrase": "patients'_opinions"}], "paper_keywords": ["Internet", " Patient education", " Web evaluation", " Web intervention"], "paper_abstract": "The use and evaluation of Web sites in ambulatory surgery patients' education are rare; hence, innovative approaches to educate these patients should be adopted and evaluated. The aim of this study was to describe the creation of and evaluate the utility and usability of an ambulatory orthopedic surgical patient education Web site. A descriptive study design was used. The evaluators were 72 ambulatory orthopedic surgery patients receiving education through a Web site. The data were collected after education pre-operatively and 2 weeks postoperatively. Two instruments were used: \"Patients' Evaluation of Education'' and \"Diary of the Use of the Website.\" Web site evaluators' scores for utility of the Web site ranged from 57.56 to 87.87 of 100. Utility of the Web site evaluations was significantly higher (P < .05) 2 weeks postoperatively than immediately after the operation. Web site evaluators' scores for usability of the Web site ranged from 85.69 to 88.32. The use of this program as educational material for orthopedic surgery patients was supported by the patients' opinions of the usability and utility of the Web site.", "paper_title": "The Creation and Evaluation of an Ambulatory Orthopedic Surgical Patient Education Web Site to Support Empowerment", "paper_id": "WOS:000281672000006"}