{"auto_keywords": [{"score": 0.029975003529628383, "phrase": "h_index"}, {"score": 0.004578783486828809, "phrase": "scientist's_publications"}, {"score": 0.004385555408850022, "phrase": "widely_used_h_index"}, {"score": 0.003923144245133288, "phrase": "scientist's_citations_profile"}, {"score": 0.0037305551963210523, "phrase": "positive_integers"}, {"score": 0.0036509280916606937, "phrase": "sufficiently_fine_'granularity"}, {"score": 0.0035858673522839407, "phrase": "fully_satisfactory_ranking"}, {"score": 0.0034343965063429447, "phrase": "social_sciences_and_humanities"}, {"score": 0.003397535839387366, "phrase": "scientific_productivity_and_citation_practices"}, {"score": 0.0032075033252058835, "phrase": "'structurally'_lower_values"}, {"score": 0.002984794722633428, "phrase": "scientist's_h_index"}, {"score": 0.0029210388852074208, "phrase": "right-open_interval"}, {"score": 0.002708399936381754, "phrase": "scientist's_most-cited_publications"}, {"score": 0.0025752890978323873, "phrase": "w_index_accounts"}, {"score": 0.0025112011945912327, "phrase": "entire_set"}, {"score": 0.0022785613865764923, "phrase": "new_indexes"}, {"score": 0.002245975340642921, "phrase": "different_results"}, {"score": 0.002166530105679438, "phrase": "italian_universities"}, {"score": 0.0021049977753042253, "phrase": "italian_university_departments"}], "paper_keywords": ["Bibliometrics", " Citation statistics", " h index", " Evaluating research in Social Sciences"], "paper_abstract": "The paper proposes two simple new indexes-k and w-to assess a scientist's publications record based on citations. The two indexes are superior to the widely used h index (Hirsch, 2005), as they preserve all its valuable characteristics and try to overcome one of its shortcomings, i.e. that it uses only a fraction of the information contained in a scientist's citations profile and, as a result, it is defined over the set of positive integers and does not show a sufficiently fine 'granularity' to allow a fully satisfactory ranking of scientists. This problem is particularly acute in many areas of Social Sciences and Humanities, where scientific productivity and citation practices typically yield fewer citations per paper and, as a consequence, are characterized by 'structurally' lower values of the h index. Both the indexes proposed are defined over R+, their integer part is equal to the scientist's h index and they fall in the right-open interval [h, h+1). While the h index is influenced only by part of the citations received by a scientist's most-cited publications, the k index takes into account all the citations received by her most-cited publications and the w index accounts for the citations received by the entire set of her publications. Variants of the k and w indexes are proposed which consider co-authorship. To show the extent to which the h index and the new indexes proposed may yield different results, they are calculated for 332 professors of economics in Italian universities and the results obtained used to rank Italian university departments.", "paper_title": "Two simple new bibliometric indexes to better evaluate research in disciplines where publications typically receive less citations", "paper_id": "WOS:000321852600015"}