{"auto_keywords": [{"score": 0.04647021928133098, "phrase": "users'_mental_representations"}, {"score": 0.032815965918636725, "phrase": "web_site_design"}, {"score": 0.00481495049065317, "phrase": "digital_information"}, {"score": 0.004669845451682529, "phrase": "web-based_newspaper"}, {"score": 0.004483120978156604, "phrase": "digital_genres"}, {"score": 0.00437765047900432, "phrase": "two-phase_study"}, {"score": 0.004260134699483774, "phrase": "six_expert_news_readers"}, {"score": 0.004188287972391714, "phrase": "hci_experts"}, {"score": 0.004007083686875716, "phrase": "web_news_page_design"}, {"score": 0.003939487754302632, "phrase": "story_categorization"}, {"score": 0.0038467574225322086, "phrase": "longitudinal_experiment"}, {"score": 0.003545024951402818, "phrase": "user_data"}, {"score": 0.0031254169757175257, "phrase": "between-group_difference"}, {"score": 0.002949598537993663, "phrase": "genre-con_forming_design"}, {"score": 0.002889928791032578, "phrase": "within-group_difference"}, {"score": 0.0027180455234834993, "phrase": "interaction_effect"}, {"score": 0.0025826247025542213, "phrase": "surprising_interaction_effect"}, {"score": 0.002530359917257626, "phrase": "specifically_the_breadth"}, {"score": 0.0023717148226629105, "phrase": "genre-violating_group"}, {"score": 0.002339601774631419, "phrase": "genre-conforming_group"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "In an effort to understand the impact of designing for digital genres on users' mental representations of structure, a two-phase study was conducted. In phase 1, six expert news readers and a panel of HCI experts were solicited for input regarding genre-conforming and genre-violating web news page design, navigation, and story categorization. In phase 2, a longitudinal experiment with a group of 25 novice web news readers who were exposed to one of the two designs over 5 sessions is reported. During these sessions a variety of user data were captured, including: comprehension (recall, recognition), usability (time on task, accuracy, user satisfaction), and navigation (path length, category node hits). The between-group difference of web site design was significant for comprehension, usability, and navigation with the users of the genre-con forming design demonstrating better performance. The within-group difference of time was significant across these three measures as well, with performance improving over time. No interaction effect was found between web site design and time on comprehension or usability. However, a surprising interaction effect was found on navigation; specifically the breadth of navigation (i.e. the number of nodes visited for two classes of tasks) increased over time more dramatically for the genre-violating group than for the genre-conforming group. By examining the changes in these data over time and between the two designs, evidence for the development of users' mental representations of structure was captured. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Why structure and genre matter for users of digital information: A longitudinal experiment with readers of a web-based newspaper", "paper_id": "WOS:000237146300002"}