{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wizarded_uncertainty-adaptive_spoken_dialogue_tutoring_system"}, {"score": 0.004466519142879166, "phrase": "spoken_dialogue_tutoring_system"}, {"score": 0.004143196873246147, "phrase": "unseen_human_\"wizard"}, {"score": 0.004081385289516914, "phrase": "speech_recognition"}, {"score": 0.004040688646993605, "phrase": "natural_language_understanding"}, {"score": 0.003441891354624516, "phrase": "additional_substantive_content"}, {"score": 0.0033735490732324713, "phrase": "uncertain_turns"}, {"score": 0.0030363332738004454, "phrase": "first_controlled_experiments"}, {"score": 0.002976019715894587, "phrase": "substantive_dynamic_responses"}, {"score": 0.0028446460307503343, "phrase": "computer_tutors"}, {"score": 0.0027464781499539296, "phrase": "first_study"}, {"score": 0.0025730425700096365, "phrase": "computer_tutoring"}, {"score": 0.0022925278792429553, "phrase": "wider_computer_speech"}, {"score": 0.0022696277881969896, "phrase": "language_community"}, {"score": 0.00223570488212345, "phrase": "linguistic_resource"}, {"score": 0.0021912600076114033, "phrase": "effective_affect-adaptive_spoken_dialogue_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Affective states in spontaneous data", " Spoken dialogue tutoring system", " Automatic affect adaptation", " Wizard of Oz experimental design", " Collection and annotation of realistic, representative, and publicly"], "paper_abstract": "We describe the design and evaluation of two different dynamic student uncertainty adaptations in wizarded versions of a spoken dialogue tutoring system. The two adaptive systems adapt to each student turn based on its uncertainty, after an unseen human \"wizard\" performs speech recognition and natural language understanding and annotates the turn for uncertainty. The design of our two uncertainty adaptations is based on a hypothesis in the literature that uncertainty is an \"opportunity to learn\"; both adaptations use additional substantive content to respond to uncertain turns, but the two adaptations vary in the complexity of these responses. The evaluation of our two uncertainty adaptations represents one of the first controlled experiments to investigate whether substantive dynamic responses to student affect can significantly improve performance in computer tutors. To our knowledge we are the first study to show that dynamically responding to uncertainty can significantly improve learning during computer tutoring. We also highlight our ongoing evaluation of our uncertainty-adaptive systems with respect to other important performance metrics, and we discuss how our corpus can be used by the wider computer speech and language community as a linguistic resource supporting further research on effective affect-adaptive spoken dialogue systems in general. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Designing and evaluating a wizarded uncertainty-adaptive spoken dialogue tutoring system", "paper_id": "WOS:000282563500007"}