{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "software_system"}, {"score": 0.004700027722284931, "phrase": "nontraditional_educational_resources"}, {"score": 0.004456717971917794, "phrase": "educational_content"}, {"score": 0.004308455856718928, "phrase": "software_applications"}, {"score": 0.004205570965859848, "phrase": "teaching-learning_process"}, {"score": 0.0040656296649390486, "phrase": "school_boundaries"}, {"score": 0.003987755561492638, "phrase": "new_expositions"}, {"score": 0.003911367220315185, "phrase": "theatre_performances"}, {"score": 0.0037087324991876727, "phrase": "learning_activity"}, {"score": 0.0036553070575015344, "phrase": "huge_quantity"}, {"score": 0.00328625950643742, "phrase": "filtering_resources"}, {"score": 0.0024342079318127423, "phrase": "recommender_system"}, {"score": 0.002387507583705495, "phrase": "contextual_factors"}, {"score": 0.0021670777282518424, "phrase": "itec_project"}, {"score": 0.0021049977753042253, "phrase": "framework_programme"}], "paper_keywords": ["Technology Enhanced Learning", " Recommender System", " Multicriteria recommendation", " Context-Aware Recommender", " Semantic technologies"], "paper_abstract": "This paper describes a software system that allows for discovering nontraditional educational resources, that is to say, those that go beyond educational content and incorporate elements such as: software applications that may support the teaching-learning process; events that take place outside school boundaries, such as new expositions in museums and theatre performances; and people who may participate as experts in some Learning Activity. The huge quantity of information available potentially all that can be extracted from the Internet-enforces us to adopt a strategy that enables filtering resources in accordance with their appropriateness and relevance, that is, an strategy based on recommendations. Besides, due to their particular nature (e.g. the most relevant events are those that will take place in the same city where the school is located) the apropriateness of those resources is highly dependent on the context where teaching and learning is produced. Therefore, the recommender system takes into account contextual factors when calculating the relevance of every resource. This system was evaluated with several focus groups in the scope of the iTEC project, which belongs to the European Commision's Framework Programme 7.", "paper_title": "A Recommender System for Non-traditional Educational Resources: A Semantic Approach", "paper_id": "WOS:000352143200007"}