{"auto_keywords": [{"score": 0.04186435485228401, "phrase": "range_queries"}, {"score": 0.00481495049065317, "phrase": "probabilistic_guarantees"}, {"score": 0.004736666296080189, "phrase": "range_query_processing"}, {"score": 0.0043495571869907376, "phrase": "efficient_range_query_processing"}, {"score": 0.0042508289538799905, "phrase": "distributed_data_sets"}, {"score": 0.004140726362519362, "phrase": "infrastructure's_resources"}, {"score": 0.0037402558657576124, "phrase": "data_items"}, {"score": 0.003269266730193333, "phrase": "classic_logarithmic_complexity"}, {"score": 0.0032372213689015844, "phrase": "point_queries"}, {"score": 0.0029722900280316216, "phrase": "sub-logarithmic_complexity"}, {"score": 0.0026234862160314397, "phrase": "theoretical_analysis"}, {"score": 0.0025807396931129926, "phrase": "detailed_experimental_results"}, {"score": 0.002538687900036229, "phrase": "communication_cost"}, {"score": 0.0025220591847502356, "phrase": "query_and_update_operations"}, {"score": 0.002472822097373027, "phrase": "base_b"}, {"score": 0.0024485643104830814, "phrase": "double-exponentially_power"}, {"score": 0.0023928819778638055, "phrase": "total_number"}, {"score": 0.002323142666222693, "phrase": "fully_dynamic_and_fault-tolerant_structure"}, {"score": 0.0021825034787117986, "phrase": "detailed_performance_comparison"}, {"score": 0.0021539955106204354, "phrase": "improved_performance"}, {"score": 0.0021049993427773544, "phrase": "art."}], "paper_keywords": ["Distributed data structures", " P2P data management"], "paper_abstract": "We focus on range query processing on large-scale, typically distributed infrastructures, such as clouds of thousands of nodes of shared-datacenters, of p2p distributed overlays, etc. In such distributed environments, efficient range query processing is the key for managing the distributed data sets per se, and for monitoring the infrastructure's resources. We wish to develop an architecture that can support range queries in such large-scale decentralized environments and can scale in terms of the number of nodes as well as in terms of the data items stored. Of course, in the last few years there have been a number of solutions (mostly from researchers in the p2p domain) for designing such large-scale systems. However, these are inadequate for our purposes, since at the envisaged scales the classic logarithmic complexity (for point queries) is still too expensive while for range queries it is even more disappointing. In this paper we go one step further and achieve a sub-logarithmic complexity. We contribute the ART (Autonomous Range Tree) structure, which outperforms the most popular decentralized structures, including Chord (and some of its successors), BATON (and its successor) and Skip-Graphs. We contribute theoretical analysis, backed up by detailed experimental results, showing that the communication cost of query and update operations is hops, where the base b is a double-exponentially power of two and N is the total number of nodes. Moreover, ART is a fully dynamic and fault-tolerant structure, which supports the join/leave node operations in O(loglogN) expected w.h.p. number of hops. Our experimental performance studies include a detailed performance comparison which showcases the improved performance, scalability, and robustness of ART.", "paper_title": "ART: sub-logarithmic decentralized range query processing with probabilistic guarantees", "paper_id": "WOS:000312716700003"}