{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "map_studies"}, {"score": 0.0469306417943247, "phrase": "human-map-space_interactions"}, {"score": 0.03444917381686712, "phrase": "wayfinding_tasks"}, {"score": 0.030410275128128987, "phrase": "external_systems"}, {"score": 0.029746792174444855, "phrase": "actual_environment"}, {"score": 0.004724980378009193, "phrase": "people-map-space_interactions"}, {"score": 0.004550029253278477, "phrase": "systemic_approach"}, {"score": 0.004365022891478405, "phrase": "wayfinding_map"}, {"score": 0.0042351951710402425, "phrase": "case_study"}, {"score": 0.004156012879026324, "phrase": "van_bockstaele_et_al"}, {"score": 0.004109212945115815, "phrase": "sociocybernetic_theory"}, {"score": 0.004062937864702115, "phrase": "research_framework"}, {"score": 0.0039869632444468036, "phrase": "van_bockstaele"}, {"score": 0.003853757393357659, "phrase": "individual's_behaviour"}, {"score": 0.0037959868107895053, "phrase": "cognitive_system"}, {"score": 0.0035331426502479687, "phrase": "individual's_action"}, {"score": 0.003440945901489461, "phrase": "cognitive_systems"}, {"score": 0.003214730261140886, "phrase": "western_australia"}, {"score": 0.002902903244616154, "phrase": "findings_-_findings"}, {"score": 0.0027741761880779535, "phrase": "individual's_latent_and_patent_actions"}, {"score": 0.002340147988348115, "phrase": "graphic_and_information_designers"}, {"score": 0.0023137485947956732, "phrase": "substantial_understanding"}], "paper_keywords": ["design", " research", " cybernetics", " feedback", " information research", " sociocybernetics"], "paper_abstract": "Purpose - This paper seeks to apply a systemic approach to study human-map-space interactions that will benefit the design of a wayfinding map. Design/methodology/approach - This paper presents a case study that was based on Van Bockstaele et al.'s sociocybernetic theory as a research framework to map study. Van Bockstaele et al.'s theory suggests that an individual's behaviour derives from a cognitive system that consists of latent (background thinking process) and patent (amplified language or action that communicates with the public) action. To observe and understand an individual's action, the observer must also consider cognitive systems. Applying this theory, the process of individuals using maps to solve wayfinding tasks within the City of Fremantle, Western Australia was observed. The study involved observing 30 international students who use three maps, each of which presents iconic, symbolic, and iconic and symbolic representations, to locate four destinations in the city. Findings - Findings suggest that external systems such as maps and the actual environment affect an individual's latent and patent actions, while their behaviour affects the way they perceive the external systems. Research limitations/implications - This paper addresses the complexity of systems involved in the process of an individual using maps to solve wayfinding tasks in the actual environment. Practical implications - This study provides graphic and information designers with a substantial understanding of human-map-space interactions based on systemic perspectives. Originality/value - The application of sociocybernetics is uncommon in map studies. This paper provides a link between the two disciplines.", "paper_title": "A sociocybernetic approach to wayfinding map studies - The systems of people-map-space interactions", "paper_id": "WOS:000251883500018"}