{"auto_keywords": [{"score": 0.029192170003207354, "phrase": "different_steps"}, {"score": 0.024779175340786327, "phrase": "clustering_step"}, {"score": 0.00481495049065317, "phrase": "embedded_multiprocessors"}, {"score": 0.004776669953449352, "phrase": "multiprocessor_mapping"}, {"score": 0.0044990584725586764, "phrase": "different_perspectives"}, {"score": 0.004392565073466714, "phrase": "two-step_decomposition"}, {"score": 0.003714195746979591, "phrase": "single-step_scheduling_algorithms"}, {"score": 0.0034841647157189985, "phrase": "two-phase_decomposition"}, {"score": 0.0034152340901585374, "phrase": "efficient_and_novel_techniques"}, {"score": 0.003361069456060196, "phrase": "interprocessor_communications"}, {"score": 0.003255295296893174, "phrase": "significantly_longer_compilation_time"}, {"score": 0.003190878119415192, "phrase": "embedded_system_designers"}, {"score": 0.0029693204265884327, "phrase": "diverse_structures"}, {"score": 0.002910545717767559, "phrase": "experimental_setup"}, {"score": 0.0028302049070944944, "phrase": "two-step_scheduling_approach"}, {"score": 0.0026547761341670505, "phrase": "overall_schedule_performance"}, {"score": 0.002571171956724731, "phrase": "scheduling_process"}, {"score": 0.002530359917257626, "phrase": "overall_performance"}, {"score": 0.0021304214257321, "phrase": "accurate_measure"}, {"score": 0.0021049977753042253, "phrase": "final_performance"}], "paper_keywords": ["interprocessor communication", " multiprocessor systems", " scheduling", " task partitioning"], "paper_abstract": "Multiprocessor mapping and scheduling algorithms have been extensively studied over the past few decades and have been tackled from different perspectives. In the late 1980's, the two-step decomposition of scheduling-into clustering and cluster-scheduling-was introduced. Ever since, several clustering and merging algorithms have been proposed and individually reported to be efficient. However, it is not clear how effective they are and how well they compare against single-step scheduling algorithms or other multistep algorithms. In this paper, we explore the effectiveness of the two-phase decomposition of scheduling and describe efficient and novel techniques that aggressively streamline interprocessor communications and can be tuned to exploit the significantly longer compilation time that is available to embedded system designers. We evaluate a number of leading clustering and merging algorithms using a set of benchmarks with diverse structures. We present an experimental setup for comparing the single-step against the two-step scheduling approach. We determine the importance of different steps in scheduling and the effect of different steps on overall schedule performance and show that the decomposition of the scheduling process indeed improves the overall performance. We also show that the quality of the solutions depends on the quality of the clusters generated in the clustering step. Based on the results, we also discuss why the parallel time metric in the clustering step may not provide an accurate measure for the final performance of cluster-scheduling.", "paper_title": "Efficient techniques for clustering and scheduling onto embedded multiprocessors", "paper_id": "WOS:000237786100007"}