{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bell_labs_security_framework"}, {"score": 0.003746779951069909, "phrase": "organization's_information_security_management_system"}, {"score": 0.0035796471115594553, "phrase": "general_principles"}, {"score": 0.0033427754823819157, "phrase": "standardized_techniques"}, {"score": 0.0031393948330209255, "phrase": "security_controls"}, {"score": 0.003051073364818384, "phrase": "isms_life_cycle"}, {"score": 0.0028167336373711494, "phrase": "layered_hierarchy"}, {"score": 0.002527150892127982, "phrase": "standardized_manner"}, {"score": 0.0024700776739384977, "phrase": "framework_security_dimensions"}, {"score": 0.0024281181691350085, "phrase": "necessary_mechanisms"}, {"score": 0.0023463203637929466, "phrase": "selected_controls"}, {"score": 0.0022287497627555895, "phrase": "comprehensive_end-to-end_approach"}, {"score": 0.0021049980887993046, "phrase": "alcatel-lucent"}], "paper_keywords": [""], "paper_abstract": "The global information technology (IT) industry recognizes the need for standards to improve the quality and consistency of security for IT products and services. As such, the International Organization for Standardization/International Electrotechnical Commission (ISO/IEC) 27000 series is focusing on the requirements, security controls, and implementation guidance for an organization's information security management system (ISMS). This guidance establishes general principles that can be used in various industries and government, however, standardized techniques are also needed to identify, implement, and operate security controls as part of the ISMS life cycle. The Bell Labs Security Framework identifies both the minimal and differentiating security controls by decomposing an IT product or service into a layered hierarchy of equipment and facilities groupings and examining the types of activities that occur at each layer in a standardized manner Furthermore, the Bell Labs Security Framework security dimensions provide the necessary mechanisms to implement and operate the selected controls. The Bell Labs Security Framework enhances the ISO/IEC 27000 series by providing a comprehensive end-to-end approach to implementing IT security. (C) 2007 Alcatel-Lucent.", "paper_title": "Using the bell labs security framework to enhance the ISO 17799/27001 information security management system", "paper_id": "WOS:000250961000004"}