{"auto_keywords": [{"score": 0.04872267695171359, "phrase": "mexico"}, {"score": 0.00481495049065317, "phrase": "participatory_modeling_approaches"}, {"score": 0.004322967486451877, "phrase": "hydrologic_modeling_workshop"}, {"score": 0.0042004472903194616, "phrase": "hermosillo"}, {"score": 0.00374399358035391, "phrase": "participants'_perceptions"}, {"score": 0.0035601676907962626, "phrase": "water_quality_models"}, {"score": 0.00333697550984782, "phrase": "local_water_resource-related_problems"}, {"score": 0.0031277316566463978, "phrase": "on-site_pre-and_post-workshop_surveys"}, {"score": 0.002747676657869163, "phrase": "water_quality_problems"}, {"score": 0.002262209824105154, "phrase": "presented_models"}, {"score": 0.0021049977753042253, "phrase": "future_watershed_modeling_workshop_efforts"}], "paper_keywords": ["Modeling workshop", " Risk perceptions", " Hydrologic modeling", " Water quality modeling", " Less-developed regions"], "paper_abstract": "This study presents the results from evaluation of a hydrologic modeling workshop for 46 water resource decision makers in Hermosillo, Mexico. This region has serious, ongoing water quantity and quality problems. Our goals were to assess participants' perceptions of our workshop and associated hydrologic and water quality models and to learn whether it changed their perceptions of local water resource-related problems, causes, and solutions. We administered on-site pre-and post-workshop surveys to assess any changes and to collect evaluations of the workshop and models. A few about water quality problems changed significantly over the course of the workshop, but most measured perceptions did not. On average, participants rated the workshop highly and believed that the presented models could assist their future decision-making. These results could contribute to future watershed modeling workshop efforts. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring the application of participatory modeling approaches in the Sonora River Basin, Mexico", "paper_id": "WOS:000346751700023"}