{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_wiki"}, {"score": 0.02414755469867715, "phrase": "semantic_wikis"}, {"score": 0.0045848959186340485, "phrase": "wikis"}, {"score": 0.0037459885494311217, "phrase": "semantically_linked_and_ontologically_structured_hypertexts"}, {"score": 0.003501846136829077, "phrase": "existing_ontologically_structured_web_site"}, {"score": 0.0031747618267940155, "phrase": "community_contribution"}, {"score": 0.0030414140732789186, "phrase": "existing_semantic_wikis"}, {"score": 0.0027741761880779535, "phrase": "system's_ability"}, {"score": 0.002673957615079041, "phrase": "useful_ontologies"}, {"score": 0.00259320616168125, "phrase": "frema_case_study"}, {"score": 0.0022938068444116827, "phrase": "web-based_knowledge_bases"}, {"score": 0.0021049977753042253, "phrase": "next_generation"}], "paper_keywords": ["Rich Hypertext", " Semantic Graphs", " Semantics-on-demand"], "paper_abstract": "In the same way that Wikis have become the mechanism that has enabled groups of users to collaborate on the production of hypertexts on the web, Semantic Wikis promise a future of collaboration on the production of semantically linked and ontologically structured hypertexts. In this paper we describe our efforts to convert an existing ontologically structured web site called Framework Reference Model for Assessment (FREMA) into a Semantic Wiki specifically to enable community contribution. We compare a number of existing Semantic Wikis, and explore how the notion of semantics-on-demand affects a system's ability to control the creation of useful ontologies and annotations. The FREMA case study introduces a number of the problems we encountered and solved, and sets the template for others considering implementing web-based knowledge bases using Semantic Wikis. Our conclusions will contribute to the agenda for those implementing the next generation of Semantic Wikis.", "paper_title": "Semantics on demand: Can a Semantic Wiki replace a knowledge base?", "paper_id": "WOS:000207587800005"}