{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "combinatorial_double_auctions"}, {"score": 0.009897297647229762, "phrase": "wdp"}, {"score": 0.0067998081531222875, "phrase": "computational_complexity"}, {"score": 0.005468361186644321, "phrase": "mas"}, {"score": 0.00492231503281668, "phrase": "multi-agent_learning_algorithms"}, {"score": 0.004722038375317162, "phrase": "real_world"}, {"score": 0.004523865550323285, "phrase": "winner_determination_problem"}, {"score": 0.004362105000374107, "phrase": "fictitious_market"}, {"score": 0.004168240841388958, "phrase": "trade_goods"}, {"score": 0.00396218934254591, "phrase": "computation_point"}, {"score": 0.0037957839728524046, "phrase": "effective_mechanism"}, {"score": 0.0037079710789139305, "phrase": "multi-agent_systems"}, {"score": 0.0034029588672379926, "phrase": "important_issue"}, {"score": 0.0031597433845085092, "phrase": "scalable_multi-agent_learning_algorithms"}, {"score": 0.003015143226706584, "phrase": "exact_solution"}, {"score": 0.0028996963188373144, "phrase": "mas_architecture"}, {"score": 0.002499798127196099, "phrase": "learning_algorithms"}, {"score": 0.0023029188952824685, "phrase": "lagrangian_relaxation_approach"}, {"score": 0.0022760856906838814, "phrase": "subgradient_method"}, {"score": 0.0022495644368875686, "phrase": "efficient_multi-agent_learning_algorithms"}, {"score": 0.002146527342660575, "phrase": "proposed_multi-agent_learning_algorithms"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["Auction", " Multi-agent", " Learning"], "paper_abstract": "Many complex decision problems in the real world are very difficult to solve due to computational complexity. The winner determination problem (WDP) in combinatorial double auctions is one example of such complex problems. Although it allows buyers and sellers to submit bids and trade goods conveniently, the WDP in combinatorial double auctions is notoriously difficult to solve from computation point of view. It relies on the development of an effective mechanism to determine the winners. Multi-agent systems (MAS) provide an approach in which several agents attempt, through their interactions, to jointly solve a problem. An important issue in MAS is the design of multi-agent learning algorithms. In this paper, we will study the development of scalable multi-agent learning algorithms for solving the WDP in combinatorial double auctions. Instead of finding the exact solution, we will set up a fictitious market based on MAS architecture and develop multi-agent learning algorithms to reduce the computational complexity in solving the WDP of combinatorial double auctions. In the fictitious market, each buyer, each seller and the mediator is modeled by an agent. The issue is to develop learning algorithms for all the agents in the system to collectively solve the WDP in combinatorial double auctions. In this paper, we adopt a Lagrangian relaxation approach and a subgradient method to develop efficient multi-agent learning algorithms for solving the WDP in combinatorial double auctions. The effectiveness of the proposed multi-agent learning algorithms is also demonstrated by numerical examples.", "paper_title": "Scalable multi-agent learning algorithms to determine winners in combinatorial double auctions", "paper_id": "WOS:000358314000005"}