{"auto_keywords": [{"score": 0.039497461061921244, "phrase": "inference_structures"}, {"score": 0.01290752264641629, "phrase": "sub-triangle_product"}, {"score": 0.00481495049065317, "phrase": "bk_sub-triangle_product"}, {"score": 0.004671932490796184, "phrase": "bandler"}, {"score": 0.0046159158660556985, "phrase": "kohout's_sub-triangle_product"}, {"score": 0.0036479584876742085, "phrase": "inference_engine"}, {"score": 0.0033929894721242367, "phrase": "medical_expert_system"}, {"score": 0.00291743479583421, "phrase": "non-emptiness_condition"}, {"score": 0.0027298319171606498, "phrase": "inappropriate_logical_connectives"}, {"score": 0.0021306081217770173, "phrase": "inference_engines"}, {"score": 0.0021049977753042253, "phrase": "medical_expert_systems"}], "paper_keywords": ["BK sub-triangle product", " fuzzy relation", " inference structure", " logical connective"], "paper_abstract": "Bandler and Kohout's sub-triangle product is well-known due to its ability to retrieve relations of elements in the sets which are not directly associated. In practice, the sub-triangle product is able to generate a list of inference structures that can work as inference engine. In this paper, we examine this sub-triangle product in a medical expert system where lists of equations were initialized from the sub-triangle product as the inference structures. Two limitations were discovered where the former arises from the ignorance of non-emptiness condition, whereas the latter arises from the initialization of an inappropriate logical connectives. To rectify this problem, we proposed to eliminate those inference structures that are not performing well. With a further study on the behaviour of well performing inference structures, we first proposed a combination of inference structures that good for forming inference engines of medical expert systems.", "paper_title": "Logical Connectives and Operativeness of BK Sub-triangle Product in Fuzzy Inferencing", "paper_id": "WOS:000299452500002"}