{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "old_workforce"}, {"score": 0.0047517225918491226, "phrase": "strategic_research_agenda"}, {"score": 0.004689321062844586, "phrase": "workforce_ages"}, {"score": 0.004643055780443262, "phrase": "industrialized_countries"}, {"score": 0.004462494148878735, "phrase": "new_challenges"}, {"score": 0.004317378385832431, "phrase": "dramatic_demographical_change"}, {"score": 0.004163172790791119, "phrase": "increasingly_modern_information_and_communication_technologies"}, {"score": 0.003871024872459116, "phrase": "information_systems"}, {"score": 0.0036714667610391535, "phrase": "empirical_perspective"}, {"score": 0.0035285548582081627, "phrase": "control_variable"}, {"score": 0.0035052810710060893, "phrase": "limited_understanding"}, {"score": 0.0032807941194429235, "phrase": "substantive_variable"}, {"score": 0.0032269483581856737, "phrase": "stereotypical_accounts"}, {"score": 0.00290259605431505, "phrase": "marked_lack"}, {"score": 0.0025509294021449254, "phrase": "age-related_impacts"}, {"score": 0.0024192592458651204, "phrase": "research_agenda"}, {"score": 0.0023096222276192194, "phrase": "future_research"}, {"score": 0.002226968099778524, "phrase": "managerial_challenges"}, {"score": 0.002175913488493802, "phrase": "graying_workforce"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information Technology", " IT", " ICT", " Age", " Older", " Younger"], "paper_abstract": "As the workforce ages rapidly in industrialized countries, a phenomenon known as the graying of the workforce, new challenges arise for firms as they have to juggle this dramatic demographical change (Trend 1) in conjunction with the proliferation of increasingly modern information and communication technologies (ICTs) (Trend 2). Although these two important workplace trends are pervasive, their interdependencies have remained largely unexplored. While Information Systems (IS) research has established the pertinence of age to IS phenomena from an empirical perspective, it has tended to model the concept merely as a control variable with limited understanding of its conceptual nature. In fact, even the few IS studies that used the concept of age as a substantive variable have mostly relied on stereotypical accounts alone to justify their age-related hypotheses. Further, most of these studies have examined the role of age in the same phenomenon (i.e., initial adoption of ICTs), implying a marked lack of diversity with respect to the phenomena under investigation. Overall, IS research has yielded only limited insight into the role of age in phenomena involving ICTs. In this essay, we argue for the importance of studying age-related impacts more carefully and across various IS phenomena, and we enable such research by providing a research agenda that IS scholars can use. In doing so, we hope that future research will further both our empirical and conceptual understanding of the managerial challenges arising from the interplay of a graying workforce and rapidly evolving ICTs. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Modern information technology in an old workforce: Toward a strategic research agenda", "paper_id": "WOS:000347601200004"}