{"auto_keywords": [{"score": 0.049643973872019624, "phrase": "senior_population"}, {"score": 0.040229067790740376, "phrase": "social_computing"}, {"score": 0.00481495049065317, "phrase": "promote_social_computing"}, {"score": 0.004727837281331949, "phrase": "smartphones_and_tablets_proliferation"}, {"score": 0.004663533386096864, "phrase": "accessible_prices"}, {"score": 0.004256533389293113, "phrase": "new_horizons"}, {"score": 0.004160435626849478, "phrase": "continuous_and_noninvasive_monitoring"}, {"score": 0.003920573616298175, "phrase": "great_benefits"}, {"score": 0.0037454814403672697, "phrase": "elderly's_quality"}, {"score": 0.002782647772219627, "phrase": "elderly_people"}, {"score": 0.0025981315738078793, "phrase": "singular_requirements"}, {"score": 0.0025627194819793347, "phrase": "age_related_changes"}, {"score": 0.0023173287402646577, "phrase": "responsive_design"}, {"score": 0.002163600705898299, "phrase": "usability_tests"}, {"score": 0.0021438877099090262, "phrase": "semistructured_interviews"}, {"score": 0.0021049977753042253, "phrase": "real_scenario"}], "paper_keywords": [""], "paper_abstract": "Smartphones and tablets proliferation enabled by accessible prices and also by the inclusion of sensing abilities promotes their use in several areas, such as healthcare. It opens new horizons in the field of continuous and noninvasive monitoring and support to population, namely, to seniors. Despite the great benefits that mobile sensing and social computing could provide to increase elderly's quality of life, many studies have shown that elderlies deal with difficulty with Information and Communication Technology (ICT). In this paper we present a solution to overcome barriers between elderlies and their ICT usage in order to potentiate all the benefits provided from mobile sensing and social computing. A survey on guidelines, standards, and advice regarding usability and accessibility issues when developing solutions for elderly people was carried out. This survey was made having in mind that senior population have singular requirements due to age related changes and also frequently technological illiteracy. We have identified and applied the most important guidelines to our solution. A prototype was made using responsive design in order to be adaptable to any type of devices. Regarding evaluation, usability tests and semistructured interviews were conducted in real scenario.", "paper_title": "Removing Barriers to Promote Social Computing among Senior Population", "paper_id": "WOS:000364077100001"}