{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_network_virtualization"}, {"score": 0.004354572391793908, "phrase": "radio_spectrum_resources"}, {"score": 0.00428222231579898, "phrase": "overall_expenses"}, {"score": 0.00423465514675998, "phrase": "wireless_network_deployment"}, {"score": 0.0039380388343479384, "phrase": "easier_migration"}, {"score": 0.0036214184763804034, "phrase": "potential_vision"}, {"score": 0.0034245614958572012, "phrase": "widespread_deployment"}, {"score": 0.0032383707002544755, "phrase": "resource_discovery"}, {"score": 0.003166751241099304, "phrase": "mobility_management"}, {"score": 0.0031315358193567708, "phrase": "network_management"}, {"score": 0.002977835845437357, "phrase": "non-technical_issues"}, {"score": 0.0029282926103224717, "phrase": "governance_regulations"}, {"score": 0.0027535633837592597, "phrase": "brief_survey"}, {"score": 0.0024897902536499005, "phrase": "research_issues"}, {"score": 0.0021049977753042253, "phrase": "broader_perspectives"}], "paper_keywords": ["Wireless network virtualization", " abstraction and sharing", " isolation", " cognitive radio and networks", " cloud computing"], "paper_abstract": "Since wireless network virtualization enables abstraction and sharing of infrastructure and radio spectrum resources, the overall expenses of wireless network deployment and operation can be reduced significantly. Moreover, wireless network virtualization can provide easier migration to newer products or technologies by isolating part of the network. Despite the potential vision of wireless network virtualization, several significant research challenges remain to be addressed before widespread deployment of wireless network virtualization, including isolation, control signaling, resource discovery and allocation, mobility management, network management and operation, and security as well as non-technical issues such as governance regulations, etc. In this paper, we provide a brief survey on some of the works that have already been done to achieve wireless network virtualization, and discuss some research issues and challenges. We identify several important aspects of wireless network virtualization: overview, motivations, framework, performance metrics, enabling technologies, and challenges. Finally, we explore some broader perspectives in realizing wireless network virtualization.", "paper_title": "Wireless Network Virtualization: A Survey, Some Research Issues and Challenges", "paper_id": "WOS:000352024400017"}