{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "monge-kantorovich_equidistribution"}, {"score": 0.0287336003490647, "phrase": "current_mesh"}, {"score": 0.0046432244185370605, "phrase": "numerical_error"}, {"score": 0.00460125407969429, "phrase": "prescribed_number"}, {"score": 0.004477595431209663, "phrase": "key_roadblock"}, {"score": 0.004437115547184535, "phrase": "widespread_deployment"}, {"score": 0.0041637779492720295, "phrase": "multiple_dimensions"}, {"score": 0.003871869188502677, "phrase": "grid_cell_cross"}, {"score": 0.003524793389371463, "phrase": "monge-kantorovich_optimization"}, {"score": 0.0034612884978779163, "phrase": "earlier_publications"}, {"score": 0.0032577270508271305, "phrase": "time-independent_case"}, {"score": 0.0030847461428168614, "phrase": "time-stepping_context"}, {"score": 0.0030383422480050573, "phrase": "elegant_solution"}, {"score": 0.003010834638993771, "phrase": "otherwise_pervasive_problem"}, {"score": 0.0029655392888938295, "phrase": "mesh-motion_approaches"}, {"score": 0.0029209233709517634, "phrase": "ad_hoc_time-dependent_terms"}, {"score": 0.0028857130140890787, "phrase": "moving-mesh_pdes"}, {"score": 0.002774344617528317, "phrase": "mk"}, {"score": 0.0024721971183379867, "phrase": "direct_approach"}, {"score": 0.002326669201839705, "phrase": "hyperbolic_pde"}, {"score": 0.0022847009758393405, "phrase": "passive_scalar"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mesh-motion", " Mesh adaptation", " r-Refinement", " Monge-Kantorovich", " Monge-Ampere", " Grid tangling", " Newton-Krylov"], "paper_abstract": "Mesh-motion (r-refinement) grid adaptivity schemes are attractive due to their potential to minimize the numerical error for a prescribed number of degrees of freedom. However, a key roadblock to a widespread deployment of this class of techniques has been the formulation of robust, reliable mesh-motion governing principles, which (1) guarantee a solution in multiple dimensions (2D and 3D), (2) avoid grid tangling (or folding of the mesh, whereby edges of a grid cell cross somewhere in the domain), and (3) can be solved effectively and efficiently. In this study, we formulate such a mesh-motion governing principle, based on volume equidistribution via Monge-Kantorovich optimization (MK). In earlier publications [1,2], the advantages of this approach with regard to these points have been demonstrated for the time-independent case. In this study, we demonstrate that Monge-Kantorovich equidistribution can in fact be used effectively in a time-stepping context, and delivers an elegant solution to the otherwise pervasive problem of grid tangling in mesh-motion approaches, without resorting to ad hoc time-dependent terms (as in moving-mesh PDEs, or MMPDEs [3,4]). We explore two distinct r-refinement implementations of MK: the direct method, where the current mesh relates to an initial, unchanging mesh, and the sequential method, where the current mesh is related to the previous one in time. We demonstrate that the direct approach is superior with regard to mesh distortion and robustness. The properties of the approach are illustrated with a hyperbolic PDE, the advection of a passive scalar, in 20 and 3D. Velocity flow fields with and without flow shear are considered. Three-dimensional grid, time-step, and nonlinear tolerance convergence studies are presented which demonstrate the optimality of the approach. Published by Elsevier Inc.", "paper_title": "Robust, multidimensional mesh-motion based on Monge-Kantorovich equidistribution", "paper_id": "WOS:000284670300005"}