{"auto_keywords": [{"score": 0.044802678427214616, "phrase": "direction_information"}, {"score": 0.007827894006882297, "phrase": "ndi-de"}, {"score": 0.00481495049065317, "phrase": "neighborhood_and_direction_information"}, {"score": 0.004719359108879602, "phrase": "differential_evolution"}, {"score": 0.004607139608615063, "phrase": "simple_and_powerful_population-based_evolutionary_algorithm"}, {"score": 0.004461652144504607, "phrase": "de"}, {"score": 0.0037244390953401533, "phrase": "mutation_and_the_direction_induced_mutation_strategy"}, {"score": 0.002891793055307152, "phrase": "neighboring_individuals"}, {"score": 0.0026471070725516467, "phrase": "undesired_region"}, {"score": 0.0025944417620244924, "phrase": "promising_area"}, {"score": 0.00254282157860369, "phrase": "good_balance"}, {"score": 0.0023558375480288297, "phrase": "proposed_framework"}, {"score": 0.002308953751676031, "phrase": "original_de_algorithms"}, {"score": 0.002182573128803447, "phrase": "effective_framework"}, {"score": 0.0021049977753042253, "phrase": "de_algorithms"}], "paper_keywords": ["Differential evolution (DE)", " direction information", " exploitation", " exploration", " neighborhood information"], "paper_abstract": "Differential evolution (DE) is a simple and powerful population-based evolutionary algorithm, successfully used in various scientific and engineering fields. Although DE has been studied by many researchers, the neighborhood and direction information is not fully and simultaneously exploited in the designing of DE. In order to alleviate this drawback and enhance the performance of DE, we first introduce two novel operators, namely, the neighbor guided selection scheme for parents involved in mutation and the direction induced mutation strategy, to fully exploit the neighborhood and direction information of the population, respectively. By synergizing these two operators, a simple and effective DE framework, which is referred to as the neighborhood and direction information based DE (NDi-DE), is then proposed for enhancing the performance of DE. This way, NDi-DE not only utilizes the information of neighboring individuals to exploit the regions of minima and accelerate convergence but also incorporates the direction information to prevent an individual from entering an undesired region and move to a promising area. Consequently, a good balance between exploration and exploitation can be achieved. In order to test the effectiveness of NDi-DE, the proposed framework is applied to the original DE algorithms, as well as several state-of-the-art DE variants. Experimental results show that NDi-DE is an effective framework to enhance the performance of most of the DE algorithms studied.", "paper_title": "Differential Evolution With Neighborhood and Direction Information for Numerical Optimization", "paper_id": "WOS:000327647500057"}