{"auto_keywords": [{"score": 0.03353453147009433, "phrase": "pareto_front"}, {"score": 0.029237135610446486, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "multi-objective_particle_swarm_optimization_control"}, {"score": 0.004430248457624686, "phrase": "final_product"}, {"score": 0.00418199705290765, "phrase": "batch_process"}, {"score": 0.003872414709826833, "phrase": "pareto-optimal_solutions"}, {"score": 0.0036788184374592706, "phrase": "novel_diversity_preservation_strategy"}, {"score": 0.003450329424861292, "phrase": "similarity_judgment"}, {"score": 0.002703869368554536, "phrase": "benchmark_functions"}, {"score": 0.0021597662797996843, "phrase": "desire_value"}, {"score": 0.0021049977753042253, "phrase": "input_trajectory"}], "paper_keywords": ["Batch process", " Multi-objective", " Pareto-optimal solutions", " Particle swarm optimization"], "paper_abstract": "In order to maximize the amount of the final product while reducing the amount of the by-product in batch process, an improved multi-objective particle swarm optimization based on Pareto-optimal solutions is proposed in this paper. A novel diversity preservation strategy that combines the information of distance and angle into similarity judgment is employed to select global best and thus the convergence and diversity of the Pareto front is guaranteed. As a result, enough Pareto solutions are distributed evenly in the Pareto front. To test the effectiveness of the proposed algorithm, some benchmark functions are used and a comparison with its conventional counterparts is made. Furthermore, the algorithm is applied to two classical batch processes. The results show that the quality at the end of each batch can approximate the desire value sufficiently and the input trajectory converges, thus verify the efficiency and practicability of the proposed algorithm.", "paper_title": "Pareto-optimal solutions based multi-objective particle swarm optimization control for batch processes", "paper_id": "WOS:000307552600004"}