{"auto_keywords": [{"score": 0.0494111831348322, "phrase": "display_size"}, {"score": 0.049146612112995945, "phrase": "information_space"}, {"score": 0.006047801850068437, "phrase": "scale_ratio"}, {"score": 0.00481495049065317, "phrase": "large_and_small_displays"}, {"score": 0.004642220710209137, "phrase": "controlled_experiments"}, {"score": 0.004528515272291753, "phrase": "larger_display"}, {"score": 0.00440299274165318, "phrase": "map_size"}, {"score": 0.004171891198117439, "phrase": "experimental_approaches"}, {"score": 0.003954837422946628, "phrase": "entire_information_space"}, {"score": 0.003921609402733751, "phrase": "lowest_zoom_level"}, {"score": 0.0035240305920962766, "phrase": "interrelated_variables"}, {"score": 0.0033311827561285194, "phrase": "multi-scale_navigation"}, {"score": 0.0028695095228791724, "phrase": "large_display"}, {"score": 0.0028373742057129126, "phrase": "constant_map_size"}, {"score": 0.002600194073758015, "phrase": "completion_times"}, {"score": 0.002471661547432869, "phrase": "different_interaction_effects"}, {"score": 0.0023694065215394593, "phrase": "large_display_size"}, {"score": 0.0023560952790080943, "phrase": "variable_map_size"}, {"score": 0.0023100907305651872, "phrase": "small_display_size"}, {"score": 0.0022906498741695094, "phrase": "fixed_map_size"}, {"score": 0.002258610515906159, "phrase": "theoretical_analysis"}, {"score": 0.0022207529556565854, "phrase": "visualization_techniques"}, {"score": 0.002195866991284673, "phrase": "individual_task_actions"}, {"score": 0.0021529842700733974, "phrase": "relative_impact"}, {"score": 0.0021049977753042253, "phrase": "visualization_techniques'_performance"}], "paper_keywords": ["Information visualization", " multi-scale navigation", " interaction techniques", " experimental method", " user studies"], "paper_abstract": "In controlled experiments on the relation of display size (i.e., the number of pixels) and the usability of visualizations, the size of the information space can either be kept constant or varied relative to display size. Both experimental approaches have limitations. If the information space is kept constant then the scale ratio between an overview of the entire information space and the lowest zoom level varies, which can impact performance; if the information space is varied then the scale ratio is kept constant, but performance cannot be directly compared. In other words, display size, information space, and scale ratio are interrelated variables. We investigate this relation in two experiments with interfaces that implement classic information visualization techniques-focus+context, overview+detail, and zooming-for multi-scale navigation in maps. Display size varied between 0.17, 1.5, and 13.8 megapixels. Information space varied relative to display size in one experiment and was constant in the other. Results suggest that for tasks where users navigate targets that are visible at all map scales the interfaces do not benefit from a large display: With a constant map size, a larger display does not improve performance with the interfaces; with map size varied relative to display size, participants found interfaces harder to use with a larger display and task completion times decrease only when they are normalized to compensate for the increase in map size. The two experimental approaches show different interaction effects between display size and interface. In particular, focus+context performs relatively worse at a large display size with variable map size, and relatively worse at a small display size with a fixed map size. Based on a theoretical analysis of the interaction with the visualization techniques, we examine individual task actions empirically so as to understand the relative impact of display size and scale ratio on the visualization techniques' performance and to discuss differences between the two experimental approaches.", "paper_title": "Interactive Visualizations on Large and Small Displays: The Interrelation of Display Size, Information Space, and Scale", "paper_id": "WOS:000325991600039"}