{"auto_keywords": [{"score": 0.0403643019485267, "phrase": "high_accuracy"}, {"score": 0.00481495049065317, "phrase": "deanonymizing_scientific_publications"}, {"score": 0.004769444094319619, "phrase": "peer-review_system"}, {"score": 0.004420472010542188, "phrase": "anonymity_requirement"}, {"score": 0.004242183179689357, "phrase": "qualitative_level"}, {"score": 0.004122964978180509, "phrase": "quantitative_argument"}, {"score": 0.0038698476651328898, "phrase": "scientific_publications"}, {"score": 0.00373729411492695, "phrase": "statistical_analysis"}, {"score": 0.0037136840686010303, "phrase": "multiple_heterogeneous_aspects"}, {"score": 0.003441693005357189, "phrase": "feature_category"}, {"score": 0.003419943984098415, "phrase": "individual_authors"}, {"score": 0.003355515315708125, "phrase": "single_ensemble_classifier"}, {"score": 0.0031895588542135245, "phrase": "first_approach"}, {"score": 0.0031593653672862924, "phrase": "multiple_categories"}, {"score": 0.0031393948330209255, "phrase": "discriminative_features"}, {"score": 0.0029558409515535525, "phrase": "academic_publication"}, {"score": 0.0026036473098881344, "phrase": "probable_authors"}, {"score": 0.0025871803852805793, "phrase": "anonymous_papers"}, {"score": 0.0024281181691350085, "phrase": "first_guess"}, {"score": 0.0021049977753042253, "phrase": "automatic_deanonymization"}], "paper_keywords": ["Data privacy", " text analysis", " text mining"], "paper_abstract": "The peer-review system of most academic conferences relies on the anonymity of both the authors and reviewers of submissions. In particular, with respect to the authors, the anonymity requirement is heavily disputed and pros and cons are discussed exclusively on a qualitative level. In this paper, we contribute a quantitative argument to this discussion by showing that it is possible for a machine to reveal the identity of authors of scientific publications with high accuracy. We attack the anonymity of authors using statistical analysis of multiple heterogeneous aspects of a paper, such as its citations, its writing style, and its content. We apply several multilabel, multiclass machine learning methods to model the patterns exhibited in each feature category for individual authors and combine them to a single ensemble classifier to deanonymize authors with high accuracy. To the best of our knowledge, this is the first approach that exploits multiple categories of discriminative features and uses multiple, partially complementing classifiers in a single, focused attack on the anonymity of the authors of an academic publication. We evaluate our author identification framework, deAnon, based on a real-world data set of 3894 papers. From these papers, we target 1405 productive authors that each have at least three publications in our data set. Our approach returns a ranking of probable authors for anonymous papers, an ordering for guessing the authors of a paper. In our experiments, following this ranking, the first guess corresponds to one of the authors of a paper in 39.7% of the cases, and at least one of the authors is among the top 10 guesses in 65.6% of all cases. Thus, deAnon significantly outperforms current state-of-the-art techniques for automatic deanonymization.", "paper_title": "What You Submit Is Who You Are: A Multimodal Approach for Deanonymizing Scientific Publications", "paper_id": "WOS:000346751600010"}