{"auto_keywords": [{"score": 0.0045119929871912405, "phrase": "human_observer"}, {"score": 0.004054931951058077, "phrase": "suitable_control_map"}, {"score": 0.003943481134959376, "phrase": "synthesis_process"}, {"score": 0.0034947408949397127, "phrase": "automatic_example-based_generation"}, {"score": 0.003244275497488318, "phrase": "natural_aging"}, {"score": 0.003054009753601139, "phrase": "appropriate_control_map"}, {"score": 0.0028218877037665484, "phrase": "visible_parts"}, {"score": 0.002607362103727335, "phrase": "texture_exemplar"}, {"score": 0.0025712297362596574, "phrase": "small_number"}, {"score": 0.002488851299416018, "phrase": "novel_example-based_shape_synthesis_algorithm"}, {"score": 0.0023103100997344072, "phrase": "local_and_global_characteristics"}, {"score": 0.002278284823857861, "phrase": "exemplar's_layer_map"}, {"score": 0.0022052711621931144, "phrase": "new_control_map"}, {"score": 0.0021049977753042253, "phrase": "subsequent_texture_synthesis_process"}], "paper_keywords": ["control maps", " example-based texture synthesis", " non-stationary textures", " shape synthesis"], "paper_abstract": "Many inhomogeneous real-world textures are non-stationary and exhibit various large scale patterns that are easily perceived by a human observer. Such textures violate the assumptions underlying most state-of-the-art example-based synthesis methods. Consequently, they cannot be properly reproduced by these methods, unless a suitable control map is provided to guide the synthesis process. Such control maps are typically either user specified or generated by a simulation. In this paper, we present an alternative: a method for automatic example-based generation of control maps, geared at synthesis of natural, highly inhomogeneous textures, such as those resulting from natural aging or weathering processes. Our method is based on the observation that an appropriate control map for many of these textures may be modeled as a superposition of several layers, where the visible parts of each layer are occupied by a more homogeneous texture. Thus, given a decomposition of a texture exemplar into a small number of such layers, we employ a novel example-based shape synthesis algorithm to automatically generate a new set of layers. Our shape synthesis algorithm is designed to preserve both local and global characteristics of the exemplar's layer map. This process results in a new control map, which then may be used to guide the subsequent texture synthesis process.", "paper_title": "Layered Shape Synthesis: Automatic Generation of Control Maps for Non-Stationary Textures", "paper_id": "WOS:000273315300002"}