{"auto_keywords": [{"score": 0.046591905845561485, "phrase": "taxi_driver"}, {"score": 0.00481495049065317, "phrase": "taxi_drivers'_routing_choices"}, {"score": 0.004776853267973129, "phrase": "spatial_and_social_traces"}, {"score": 0.00435971969507033, "phrase": "unknown_road"}, {"score": 0.0043080553835735825, "phrase": "large_city"}, {"score": 0.004010624853427534, "phrase": "time_period"}, {"score": 0.003503497128638099, "phrase": "interesting_problem"}, {"score": 0.003313741359811683, "phrase": "different_answers"}, {"score": 0.0027704982687041147, "phrase": "large_scale_taxi_driver_trace_data"}, {"score": 0.002488183412451029, "phrase": "socialized_information"}, {"score": 0.0022434880661725493, "phrase": "uncertain_environment"}, {"score": 0.0021559025985688255, "phrase": "large_scale_real_life_data"}], "paper_keywords": ["routing choices", " socialized information learning", " social network"], "paper_abstract": "Most of our learning comes from other people or from our own experience. For instance, when a taxi driver is seeking passengers on an unknown road in a large city, what should the driver do? Alternatives include cruising around the road or waiting for a time period at the roadside in the hopes of finding a passenger or just leaving for another road enroute to a destination he knows (e.g., hotel taxi rank)? This is an interesting problem that arises everyday in cities all over the world. There could be different answers to the question poised above, but one fundamental problem is how the driver learns about the likelihood of finding passengers on a road that is new to him (as he has not picked up or dropped off passengers there before). Our observation from large scale taxi driver trace data is that a driver not only learns from his own experience but through interactions with other drivers. In this paper, we first formally define this problem as socialized information learning (SIL), second we propose a framework including a series of models to study how a taxi driver gathers and learns information in an uncertain environment through the use of his social network. Finally, the large scale real life data and empirical experiments confirm that our models are much more effective, efficient and scalable that prior work on this problem.", "paper_title": "Understanding taxi drivers' routing choices from spatial and social traces", "paper_id": "WOS:000351519500003"}