{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emerged_communities"}, {"score": 0.004724365740062236, "phrase": "peer-to-peer_networks"}, {"score": 0.004613516457919661, "phrase": "emerged_community_structure"}, {"score": 0.004548253531664032, "phrase": "important_challenge"}, {"score": 0.0045052562941109734, "phrase": "networks_analysis"}, {"score": 0.004136044939878838, "phrase": "discovered_structures"}, {"score": 0.004019797503157808, "phrase": "existing_analysis_models"}, {"score": 0.0035189057079817285, "phrase": "induced_graph"}, {"score": 0.0032456625605347417, "phrase": "structural_properties"}, {"score": 0.0030078460113945136, "phrase": "community_structures"}, {"score": 0.0028274743316389437, "phrase": "obtained_properties"}, {"score": 0.002787406053363446, "phrase": "emerged_level"}, {"score": 0.0021352776064254195, "phrase": "emerged_structures"}], "paper_keywords": ["Emerged networks", " Robustness", " Community structures"], "paper_abstract": "The study of emerged community structure is an important challenge in networks analysis. In fact, several methods have been proposed in the literature to statistically determine the significance of discovered structures. Nevertheless, most of existing analysis models consider only the structural aspect of emerged communities. We are interested in studying the robustness of emerged communities in peer-to-peer (P2P) networks. More precisely, we consider the emerged communities in the induced graph by all the exchanges in these networks. Hence, rather than examining the robustness only on the structural properties of the graph, we will focus on the parameters that allow the emergence of community structures. In fact, perturbing these parameters might destroy most of the obtained properties at the emerged level. To the best of our knowledge, robustness of networks has never been considered from this angle before. In this paper, we study the impact of perturbing the content and the profile of nodes on the emerged communities in P2P networks. We show how these alterations affect both structure and information supported by the emerged structures. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Robustness study of emerged communities from exchanges in peer-to-peer networks", "paper_id": "WOS:000320838600004"}