{"auto_keywords": [{"score": 0.04392019422481263, "phrase": "mlr"}, {"score": 0.00481495049065317, "phrase": "multimode_methods_applied"}, {"score": 0.004624751696958501, "phrase": "physicochemical_descriptors"}, {"score": 0.004232232993872917, "phrase": "multiple_linear_regression"}, {"score": 0.003810909603178837, "phrase": "partial_least_squares"}, {"score": 0.003501322813520807, "phrase": "large_number"}, {"score": 0.003403801095792972, "phrase": "recently_implemented_mia-qsar"}, {"score": 0.0033764382987428497, "phrase": "multivariate_image_analysis"}, {"score": 0.0031398318568608505, "phrase": "active_compound_result"}, {"score": 0.0031020367403802773, "phrase": "three-way_array"}, {"score": 0.00301560261110296, "phrase": "data_set"}, {"score": 0.002907992115184249, "phrase": "n-way_methods"}, {"score": 0.002861402531078998, "phrase": "multilinear_pls"}, {"score": 0.0027816546451972725, "phrase": "parallel_factor_analysis"}, {"score": 0.0026181517251690606, "phrase": "qsar_studies"}, {"score": 0.0024842242921857705, "phrase": "mia-qsar_approach"}, {"score": 0.002395530243993313, "phrase": "mia_descriptors"}, {"score": 0.0021917966722180132, "phrase": "case_study"}, {"score": 0.0021479597698614373, "phrase": "anti-hiv_compounds"}], "paper_keywords": [""], "paper_abstract": "Since the introduction of physicochemical descriptors to derive useful QSAR ( quantitative structure-activity relationship) models, some regression methods have been applied to linearly correlate dependent (bioactivities) and independent variables. Multiple linear regression ( MLR) has been widely used when the number of samples ( rows) exceed the amount of descriptors ( columns), whilst partial least squares (PLS) is the most commonly applied regression method in 3D QSAR (e. g. CoMFA and related methods), where a large number of descriptors are generated. The recently implemented MIA-QSAR ( Multivariate Image Analysis applied to QSAR) method is a especial ( not only) case in which the descriptors (pixels) for each active compound result in a three-way array after grouping samples to give a data set. Such array may be properly treated by using N-way methods, such as multilinear PLS (N-PLS) and parallel factor analysis (PARAFAC). However, these methods have not been appropriately explored in QSAR studies, despite their supposed advantages over well established methods. Thus, this review formally details the MIA-QSAR approach prior to presenting two promising multimode methods to be applied on MIA descriptors, namely N-PLS and PARAFAC. Also, the suitability of such methods is discussed in terms of application to a case study ( a series of anti-HIV compounds) and comparison to traditional (bilinear) PLS and docking studies.", "paper_title": "Multimode Methods Applied on MIA Descriptors in QSAR", "paper_id": "WOS:000261495500003"}