{"auto_keywords": [{"score": 0.03785838340094739, "phrase": "original_graph"}, {"score": 0.010612387000973441, "phrase": "tensor_product_graph"}, {"score": 0.010312290962248104, "phrase": "data_points"}, {"score": 0.009942469079617315, "phrase": "pairwise_similarities"}, {"score": 0.007498217277606196, "phrase": "tpg"}, {"score": 0.006877970073031243, "phrase": "proposed_approach"}, {"score": 0.005476463692061681, "phrase": "image_patches"}, {"score": 0.005334785475496006, "phrase": "learned_affinities"}, {"score": 0.0047026237903774895, "phrase": "finite_set"}, {"score": 0.00462919213721188, "phrase": "data_manifold"}, {"score": 0.004544963224988473, "phrase": "edge_weights"}, {"score": 0.0042452552248398445, "phrase": "intrinsic_difficulties"}, {"score": 0.0042119653427658025, "phrase": "similarity_values"}, {"score": 0.0040387608245932086, "phrase": "original_similarities"}, {"score": 0.003752550907120244, "phrase": "existing_methods"}, {"score": 0.003626626504149897, "phrase": "similarity_information"}, {"score": 0.003468287913322255, "phrase": "tensor_product"}, {"score": 0.003360685661587978, "phrase": "higher_order_information"}, {"score": 0.003188692204564829, "phrase": "higher_order_computational_complexity"}, {"score": 0.0031388260991640268, "phrase": "key_contribution"}, {"score": 0.00308163068747474, "phrase": "information_propagation"}, {"score": 0.0028857130140890787, "phrase": "graph_diffusion_process"}, {"score": 0.0028331166986026108, "phrase": "novel_iterative_algorithm"}, {"score": 0.002723607240517261, "phrase": "new_edge_weights"}, {"score": 0.0025977542995083624, "phrase": "unsupervised_setting"}, {"score": 0.002530359917257626, "phrase": "data_manifolds"}, {"score": 0.0024325244760735566, "phrase": "image_segmentation"}, {"score": 0.0023818980286716826, "phrase": "bull's_eye_retrieval_score"}, {"score": 0.0021384748235753425, "phrase": "original_affinities"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_image_segmentation_methods"}], "paper_keywords": ["Diffusion process", " tensor product graph", " affinity learning", " image retrieval", " image segmentation"], "paper_abstract": "In many applications, we are given a finite set of data points sampled from a data manifold and represented as a graph with edge weights determined by pairwise similarities of the samples. Often the pairwise similarities (which are also called affinities) are unreliable due to noise or due to intrinsic difficulties in estimating similarity values of the samples. As observed in several recent approaches, more reliable similarities can be obtained if the original similarities are diffused in the context of other data points, where the context of each point is a set of points most similar to it. Compared to the existing methods, our approach differs in two main aspects. First, instead of diffusing the similarity information on the original graph, we propose to utilize the tensor product graph (TPG) obtained by the tensor product of the original graph with itself. Since TPG takes into account higher order information, it is not a surprise that we obtain more reliable similarities. However, it comes at the price of higher order computational complexity and storage requirement. The key contribution of the proposed approach is that the information propagation on TPG can be computed with the same computational complexity and the same amount of storage as the propagation on the original graph. We prove that a graph diffusion process on TPG is equivalent to a novel iterative algorithm on the original graph, which is guaranteed to converge. After its convergence we obtain new edge weights that can be interpreted as new, learned affinities. We stress that the affinities are learned in an unsupervised setting. We illustrate the benefits of the proposed approach for data manifolds composed of shapes, images, and image patches on two very different tasks of image retrieval and image segmentation. With learned affinities, we achieve the bull's eye retrieval score of 99.99 percent on the MPEG-7 shape dataset, which is much higher than the state-of-the-art algorithms. When the data points are image patches, the NCut with the learned affinities not only significantly outperforms the NCut with the original affinities, but it also outperforms state-of-the-art image segmentation methods.", "paper_title": "Affinity Learning with Diffusion on Tensor Product Graph", "paper_id": "WOS:000311127700005"}