{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wavefront_construction"}, {"score": 0.0047588556219929756, "phrase": "collective_agents"}, {"score": 0.0041102032028337366, "phrase": "unknown_environment"}, {"score": 0.0034268702387746106, "phrase": "artificial_potential_field"}, {"score": 0.0033083236588614174, "phrase": "agents'_home"}, {"score": 0.003175175896313016, "phrase": "multi-agent_model"}, {"score": 0.003119760592916715, "phrase": "distributed_and_asynchronous_version"}, {"score": 0.0030833537429977797, "phrase": "barraquand_et_al"}, {"score": 0.002555247330102505, "phrase": "optimal_apf."}, {"score": 0.002452333524620638, "phrase": "complete_parameter-free_foraging_algorithm"}, {"score": 0.002206290313627494, "phrase": "foraging_settings"}, {"score": 0.0021049977753042253, "phrase": "pheromone-based_algorithm"}], "paper_keywords": ["Swarm algorithm", " Foraging task", " Artificial potential field", " Ant algorithms"], "paper_abstract": "We consider the problem of coordinating a team of agents that have to collect disseminated resources in an unknown environment. We are interested in approaches in which agents collectively explore the environment and build paths between home and resources. The originality of our approach is to simultaneously build an artificial potential field (APF) around the agents' home while foraging. We propose a multi-agent model defining a distributed and asynchronous version of Barraquand et al. Wavefront algorithm. Agents need only to mark and read integers locally on a grid, that is, their environment. We prove that the construction converges to the optimal APF. This allows the definition of a complete parameter-free foraging algorithm, called c-marking agents. The algorithm is evaluated by simulation, while varying the foraging settings. Then we compare our approach to a pheromone-based algorithm. Finally, we discuss requirements for implementation in robotics.", "paper_title": "Revisiting wavefront construction with collective agents: an approach to foraging", "paper_id": "WOS:000338318600002"}