{"auto_keywords": [{"score": 0.044340662163821154, "phrase": "purpose_information"}, {"score": 0.014619448447482922, "phrase": "access_control"}, {"score": 0.013205511448045534, "phrase": "data_element"}, {"score": 0.00481495049065317, "phrase": "privacy_protection"}, {"score": 0.004768104290288521, "phrase": "relational_database_systems"}, {"score": 0.004562847483469705, "phrase": "comprehensive_approach"}, {"score": 0.004097389262726735, "phrase": "intended_use"}, {"score": 0.003978866233891427, "phrase": "key_feature"}, {"score": 0.0038448988429199086, "phrase": "multiple_purposes"}, {"score": 0.003661275004971829, "phrase": "explicit_prohibitions"}, {"score": 0.0035902958977673313, "phrase": "privacy_officers"}, {"score": 0.0033524956061690868, "phrase": "important_issue"}, {"score": 0.0032079813320482304, "phrase": "data_labeling"}, {"score": 0.0028662606272282926, "phrase": "relational_databases"}, {"score": 0.0027561164046279413, "phrase": "different_granularity"}, {"score": 0.002573424607574822, "phrase": "low_storage_overhead"}, {"score": 0.002511147699138714, "phrase": "query_modification_techniques"}], "paper_keywords": ["privacy", " access control", " purpose", " private data management"], "paper_abstract": "In this article, we present a comprehensive approach for privacy preserving access control based on the notion of purpose. In our model, purpose information associated with a given data element specifies the intended use of the data element. A key feature of our model is that it allows multiple purposes to be associated with each data element and also supports explicit prohibitions, thus allowing privacy officers to specify that some data should not be used for certain purposes. An important issue addressed in this article is the granularity of data labeling, i.e., the units of data with which purposes can be associated. We address this issue in the context of relational databases and propose four different labeling schemes, each providing a different granularity. We also propose an approach to represent purpose information, which results in low storage overhead, and we exploit query modification techniques to support access control based on purpose information. Another contribution of our work is that we address the problem of how to determine the purpose for which certain data are accessed by a given user. Our proposed solution relies on role-based access control (RBAC) models as well as the notion of conditional role which is based on the notions of role attribute and system attribute.", "paper_title": "Purpose based access control for privacy protection in relational database systems", "paper_id": "WOS:000256765700001"}