{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "row_reduction"}, {"score": 0.004764542405129454, "phrase": "fast_and_accurate_estimation"}, {"score": 0.0042212686864468805, "phrase": "major_data_mining_tasks"}, {"score": 0.004133292222875435, "phrase": "missing_information"}, {"score": 0.003819339842998955, "phrase": "social_network_communities"}, {"score": 0.0035853745478488254, "phrase": "practical_balance"}, {"score": 0.0033480035183418642, "phrase": "relation_estimation"}, {"score": 0.0026689487424251907, "phrase": "estimation_problem"}, {"score": 0.002376559242152662, "phrase": "special_assumption"}, {"score": 0.0023516185395256505, "phrase": "known_relations"}, {"score": 0.0022783523466965187, "phrase": "superior_performance"}, {"score": 0.0021049977753042253, "phrase": "artificial_and_real-world_data_sets"}], "paper_keywords": ["similarity", " Positive Semi-Definite (PSD) matrix", " Positive Semi-Definite (PSD) Estimation", " row reduction", " incomplete Cholesky decomposition"], "paper_abstract": "Fast and accurate estimation of missing relations, e.g., similarity, distance and kernel, among objects is now one of the most important techniques required by major data mining tasks, because the missing information of the relations is needed in many applications such as economics, psychology, and social network communities. Though some approaches have been proposed in the last several years, the practical balance between their required computation amount and obtained accuracy are insufficient for some class of the relation estimation. The objective of this paper is to formalize a problem to quickly and efficiently estimate missing relations among objects from the other known relations among the objects and to propose techniques called \"PSD Estimation\" and \"Row Reduction\" for the estimation problem. This technique uses a characteristic of the relations named \"Positive Semi-Definiteness (PSD)\" and a special assumption for known relations in a matrix. The superior performance of our approach in both efficiency and accuracy is demonstrated through an evaluation based on artificial and real-world data sets.", "paper_title": "Fast and Accurate PSD Matrix Estimation by Row Reduction", "paper_id": "WOS:000311012600001"}