{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user-scheduler_dialogue"}, {"score": 0.004704187604192605, "phrase": "user-provided_runtime_estimates"}, {"score": 0.004569293780076254, "phrase": "effective_communication"}, {"score": 0.004386887374401584, "phrase": "important_prerequisite"}, {"score": 0.0042859292226559535, "phrase": "successful_scheduling_outcome"}, {"score": 0.004211731831120046, "phrase": "parties'_perspectives"}, {"score": 0.003837089839193524, "phrase": "user-provided_job_script"}, {"score": 0.0035989687070420977, "phrase": "requested_runtime"}, {"score": 0.0032596049901888724, "phrase": "actual_runtimes"}, {"score": 0.003039445153076014, "phrase": "tangible_reward"}, {"score": 0.002736694413701639, "phrase": "improved_estimate"}, {"score": 0.0026272523687965615, "phrase": "substantial_improvement"}, {"score": 0.0025816953009851072, "phrase": "overall_average_accuracy"}, {"score": 0.0023792975669318615, "phrase": "value_users"}, {"score": 0.002324433454350402, "phrase": "timely_job_completion"}, {"score": 0.002205560249972527, "phrase": "richer_utility_functions"}], "paper_keywords": ["scheduling", " runtime estimates", " utility functions"], "paper_abstract": "Effective communication between user and scheduler is an important prerequisite to achieving a successful scheduling outcome from both parties' perspectives. In a grid or stand-alone high-performance computing (HPC) environment, this communication typically takes the form of a user-provided job script containing essential configuration information, including processors/resources required, a requested runtime, and a priority. Users' requested runtimes are notoriously inaccurate as a predictor of actual runtimes. This study examines whether users can improve their runtime estimates if a tangible reward is provided for accuracy. We show that under these conditions, about half of users provide an improved estimate, but there is not a substantial improvement in the overall average accuracy. Priority, as implemented in many production schedulers, is a very crude approximation of the value users may attach to timely job completion. We show users are capable of providing richer utility functions than most schedulers elicit. Thus we explore two elements of the user-scheduler dialogue to understand if accuracy and completeness of information conveyed could be improved.", "paper_title": "On the user-scheduler dialogue: Studies of user-provided runtime estimates and utility functions", "paper_id": "WOS:000242290400006"}