{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "domestic_and_service_robots"}, {"score": 0.004634552430216732, "phrase": "artificial_intelligence"}, {"score": 0.004507594400447103, "phrase": "shared_testbed"}, {"score": 0.0044608829094248985, "phrase": "different_solutions"}, {"score": 0.00436890075128947, "phrase": "research_results"}, {"score": 0.004249188865832993, "phrase": "general_audiences"}, {"score": 0.004047500054405469, "phrase": "multiple-year_competitions"}, {"score": 0.003964007795174772, "phrase": "scientific_conferences"}, {"score": 0.003749654338704576, "phrase": "temporal_evolution"}, {"score": 0.0031187606191012012, "phrase": "evolving_competitions"}, {"score": 0.0029705677977833857, "phrase": "largest_worldwide_competition"}, {"score": 0.0029499784768149146, "phrase": "domestic_service_robots"}, {"score": 0.0028000270988465486, "phrase": "proper_scoring_system"}, {"score": 0.0027709616040210686, "phrase": "desired_functionalities"}, {"score": 0.002685558057339722, "phrase": "resulting_analysis_fuels"}, {"score": 0.002639251247218711, "phrase": "general_and_robust_solutions"}, {"score": 0.002288373472756928, "phrase": "competition_advances"}, {"score": 0.002164432930854161, "phrase": "multi-year_research_projects"}, {"score": 0.002149418970824546, "phrase": "artificial_intelligence_and_robotics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Robotic competitions", " Artificial intelligence and robotics", " Benchmarking"], "paper_abstract": "Scientific competitions are becoming more common in many research areas of artificial intelligence and robotics, since they provide a shared testbed for comparing different solutions and enable the exchange of research results: Moreover, they are interesting for general audiences and industries. Currently, many major research areas in artificial intelligence and robotics are organizing multiple-year competitions that are typically associated with scientific conferences. One important aspect of such competitions is that they are organized for many years. This introduces a temporal evolution that is interesting to analyze. However, the problem of evaluating a competition over many years remains unaddressed. We believe that this issue is critical to properly fuel changes over the years and measure the results of these decisions. Therefore, this article focuses on the analysis and the results of evolving competitions. In this article, we present the ROBOCUP@HOME competition, which is the largest worldwide competition for domestic service robots, and evaluate its progress over the past seven years. We show how the definition of a proper scoring system allows for desired functionalities to be related to tasks and how the resulting analysis fuels subsequent changes to achieve general and robust solutions implemented by the teams. Our results show not only the steadily increasing complexity of the tasks that ROBOCUP@HOME robots can solve but also the increased performance for all of the functionalities addressed in the competition. We believe that the methodology used in ROBOCUP@HOME for evaluating competition advances and for stimulating changes can be applied and extended to other robotic competitions as well as to multi-year research projects involving Artificial Intelligence and Robotics. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "ROBOCUP@HOME: Analysis and results of evolving competitions for domestic and service robots", "paper_id": "WOS:000363071100009"}