{"auto_keywords": [{"score": 0.0450678547644915, "phrase": "user_performance"}, {"score": 0.00481495049065317, "phrase": "fundamental_tasks"}, {"score": 0.0047709540557306284, "phrase": "analytic_activity"}, {"score": 0.004515252649226697, "phrase": "particular_quantity"}, {"score": 0.004453488286477661, "phrase": "information_visualization"}, {"score": 0.004119049028319832, "phrase": "experimental_comparison"}, {"score": 0.004007083686875716, "phrase": "error_distance"}, {"score": 0.0037060428445111664, "phrase": "common_vertical_axes"}, {"score": 0.0035395987202335223, "phrase": "staircase_layout"}, {"score": 0.00338060449446278, "phrase": "rotated_axes"}, {"score": 0.003349670229755675, "phrase": "neighboring_cells"}, {"score": 0.0030135741897058844, "phrase": "baseline_pcp"}, {"score": 0.002711129881213363, "phrase": "pcp"}, {"score": 0.002286781334850213, "phrase": "data_dimensionality"}, {"score": 0.00226583335721762, "phrase": "density_increase"}, {"score": 0.0021049977753042253, "phrase": "future_researchers"}], "paper_keywords": [""], "paper_abstract": "One of the fundamental tasks for analytic activity is retrieving (i.e., reading) the value of a particular quantity in an information visualization. However, few previous studies have compared user performance in such value retrieval tasks for different visualizations. We present an experimental comparison of user performance (time and error distance) across four multivariate data visualizations. Three variants of scatterplot (SCP) visualizations, namely SCPs with common vertical axes (SCP-common), SCPs with a staircase layout (SCP-staircase), and SCPs with rotated axes between neighboring cells (SCP-rotated), and a baseline parallel coordinate plots (PCP) were compared. Results show that the baseline PCP is better than SCP-rotated and SCP-staircase under all conditions, while the difference between SCP-common and PCP depends on the dimensionality and density of the dataset. PCP shows advantages over SCP-common when the dimensionality and density of the dataset are low, but SCP-common eventually outperforms PCP as data dimensionality and density increase. The results suggest guidelines for the use of SCPs and PCPs that can benefit future researchers and practitioners.", "paper_title": "Tracing Tuples Across Dimensions: A Comparison of Scatterplots and Parallel Coordinate Plots", "paper_id": "WOS:000305604000012"}