{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_community"}, {"score": 0.03396813177319679, "phrase": "archive_management"}, {"score": 0.010468143818602832, "phrase": "taiwan"}, {"score": 0.007689358800395894, "phrase": "brand_image"}, {"score": 0.0053218559177349595, "phrase": "channel_richness"}, {"score": 0.005285361574402466, "phrase": "information_transparency"}, {"score": 0.004053363345639596, "phrase": "naa"}, {"score": 0.0039841418890102925, "phrase": "records_staff"}, {"score": 0.003916098498242888, "phrase": "digital_preservation"}, {"score": 0.003680587852807675, "phrase": "structural_equation_modeling_method"}, {"score": 0.0033651019362620866, "phrase": "professional_participants"}, {"score": 0.0032848684681050745, "phrase": "findings_-_appropriate_disclosure"}, {"score": 0.0025981810951165836, "phrase": "better_brand_image"}, {"score": 0.002358917661465133, "phrase": "strategic_direction"}, {"score": 0.002318566141177149, "phrase": "national_archive"}, {"score": 0.00227890329511847, "phrase": "government_agencies"}, {"score": 0.002224510044064184, "phrase": "information_richness"}, {"score": 0.0021049977753042253, "phrase": "professional_community"}], "paper_keywords": ["Satisfaction", " Archive", " Information richness", " Online community"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the relationship between the richness of information and the satisfaction of participants in an online community regarding archive management in Taiwan. Design/methodology/approach - An investigation was deployed to attendants in 20 training courses created by the National Archives Administration (NAA) in Taiwan for records staff on the topic of digital preservation. The responses were collected from respondents who were participating in an online community for archive management. Through structural equation modeling method, this study examined the effects of channel richness, information transparency and accessibility of archive to brand image and trust and then continued to the satisfaction of professional participants to archive management in an online community. Findings - Appropriate disclosure of information regarding archiving can effectively improve the satisfaction of participants in the online community to archive. Channel richness of communication, information transparency and accessibility of archive significantly affect the brand image of archive and the trust of participants to archivists and finally affect the satisfaction of participants in the online community towards archive management. Practical implications - The larger the amount of information exchanged, the more the trust among participants and the better brand image of the archives. The more trust and brand image exists among participants, the more satisfaction they will obtain from archive management. Originality/value - The results can provide a strategic direction for managers of the national archive and the online community in government agencies to allocate resources for enhancing the information richness and the image of archive as well as achieving the satisfaction of participants in the professional community.", "paper_title": "Factors affecting the satisfaction of an online community for archive management in Taiwan", "paper_id": "WOS:000350590000003"}