{"auto_keywords": [{"score": 0.04148072981038625, "phrase": "fcm"}, {"score": 0.025399637074230975, "phrase": "cognitive_processes"}, {"score": 0.012793423455727699, "phrase": "cta"}, {"score": 0.008713748147066606, "phrase": "think-aloud_methods"}, {"score": 0.008039049736843901, "phrase": "program_comprehension"}, {"score": 0.006801948039312362, "phrase": "collected_information"}, {"score": 0.0047872135686404275, "phrase": "program_comprehension_studies"}, {"score": 0.0047049532961375, "phrase": "explorative_experimental_comparison"}, {"score": 0.0046240999614456605, "phrase": "experience-sampling_method"}, {"score": 0.004203509998995399, "phrase": "feedback-collection_method"}, {"score": 0.004001938457469328, "phrase": "regular_intervals"}, {"score": 0.003933118499284644, "phrase": "concurrent_think-aloud"}, {"score": 0.0036167509502276294, "phrase": "data_collection_methods"}, {"score": 0.0035855066449812273, "phrase": "subjects'_performance"}, {"score": 0.003503497128638102, "phrase": "greater_number"}, {"score": 0.0034832884999421374, "phrase": "comprehension_problems"}, {"score": 0.0034233569308012982, "phrase": "significant_delay"}, {"score": 0.0027475383418803724, "phrase": "data_collection"}, {"score": 0.002370386872018425, "phrase": "software_applications"}, {"score": 0.0022434880661725493, "phrase": "large_number"}, {"score": 0.0021481115112986582, "phrase": "user_log_files"}], "paper_keywords": ["think-aloud", " program comprehension", " data collection methods", " experience sampling"], "paper_abstract": "This paper reports an explorative experimental comparison of (i) an experience-sampling method called feedback collection and (ii) the think-aloud methods with respect to their usefulness in studies on program comprehension. Think-aloud methods are widely used in studies of cognitive processes, including program comprehension. Alternatively, as in the feedback-collection method (FCM), cognitive processes can be traced by collecting written feedback from the subjects at regular intervals. We compare FCM with concurrent think-aloud (CTA) and retrospective think-aloud (RTA) regarding type and usefulness of the collected information, costs related to analysis of the collected information and effects of the data collection methods on the subjects' performance. FCM allowed us to identify a greater number of comprehension problems that prevented progress or caused significant delay (FCM: 30 problems; CTA: 5; RTA: 15). It was less precise in identifying strategies for comprehension than CTA (92% correctness for FCM; 100% for CTA). FCM was less expensive in analysis (transcription and coding) than the other two methods (FCM: 0.7h of analysis per protocol; CTA: 31h; RTA: 7.9h). The results indicate that all three methods of data collection were intrusive and affected the performance of the subjects with respect to time and correctness (small to medium effect size). This research confirms that FCM can be used beneficially in studies that trace the cognitive processes involved in, and identify problems related to, the comprehension of software applications. On the basis of our experience, we recommend that FCM be used in studies that have a large number of subjects and as a complement to other methods for tracing cognitive processes, such as user log files. We recommend a design with two groups (verbalisation and silent control) and a pretest task to be used in studies with FCM or CTA that focus on performances.", "paper_title": "Comparing of feedback-collection and think-aloud methods in program comprehension studies", "paper_id": "WOS:000263649100004"}