{"auto_keywords": [{"score": 0.043622601940501264, "phrase": "incentive_protocols"}, {"score": 0.00481495049065317, "phrase": "adaptive_incentive_protocols"}, {"score": 0.004352876088312741, "phrase": "scalable_and_robust_service"}, {"score": 0.0038047474331318974, "phrase": "simple_yet_general_framework"}, {"score": 0.00266510562382701, "phrase": "high_degree"}, {"score": 0.002527654365712841, "phrase": "incentive_protocol"}, {"score": 0.0024088451312725924, "phrase": "robustness_characteristics"}, {"score": 0.002198242191529979, "phrase": "system_stability"}, {"score": 0.0021049977753042253, "phrase": "adaptive_incentive_policy"}], "paper_keywords": ["Incentive", " network economics", " peer-to-peer (P2P) computing"], "paper_abstract": "In peer-to-peer (P2P) networks, incentive protocol is used to encourage cooperation among end-nodes so as to deliver a scalable and robust service. However, the design and analysis of incentive protocols have been ad hoc and heuristic at best. The objective of this paper is to provide a simple yet general framework to analyze and design incentive protocols. We consider a class of incentive protocols that can learn and adapt to other end-nodes' strategies. Based on our analytical framework, one can evaluate the expected performance gain and, more importantly, the system robustness of a given incentive protocol. To illustrate the framework, we present two adaptive learning models and three incentive policies and show the conditions in which the P2P networks may collapse and the conditions in which the P2P networks can guarantee a high degree of cooperation. We also show the connection between evaluating incentive protocol and evolutionary game theory so one can easily identify robustness characteristics of a given policy. Using our framework, one can gain the understanding on the price of altruism and system stability, as well as the correctness of the adaptive incentive policy.", "paper_title": "A Mathematical Framework for Analyzing Adaptive Incentive Protocols in P2P Networks", "paper_id": "WOS:000303068300004"}