{"auto_keywords": [{"score": 0.0472628041258561, "phrase": "network_traffic"}, {"score": 0.043692086897500614, "phrase": "nearby_peers"}, {"score": 0.040379704731441084, "phrase": "packet_propagation_behavior"}, {"score": 0.03942024763180968, "phrase": "system_performance"}, {"score": 0.028880275857527744, "phrase": "swarm-based_scheme"}, {"score": 0.027033423104758696, "phrase": "tree-based_scheme"}, {"score": 0.00481495049065317, "phrase": "neighboring_strategy"}, {"score": 0.004780780407878596, "phrase": "peer-to-peer_multimedia_streaming_applications"}, {"score": 0.0045971138571344345, "phrase": "streaming_applications"}, {"score": 0.004483909657713567, "phrase": "isps'_concerns"}, {"score": 0.004389089062127892, "phrase": "users'_viewing_experience"}, {"score": 0.004296264970612285, "phrase": "file_sharing_applications"}, {"score": 0.003958194802333944, "phrase": "open_issue"}, {"score": 0.0037789720824759503, "phrase": "neighboring_strategies"}, {"score": 0.0035949949979695063, "phrase": "essential_aspects"}, {"score": 0.0034077704063304208, "phrase": "neighboring_overlays"}, {"score": 0.0026737455737636867, "phrase": "short_paths"}, {"score": 0.0025892330566358503, "phrase": "neighboring_overlay"}, {"score": 0.002419466507425567, "phrase": "source_peer"}, {"score": 0.002385166298265828, "phrase": "neighbor-with-nearby-peers_strategy"}, {"score": 0.0023015232625177755, "phrase": "nearby_overlay"}, {"score": 0.0022770057597574734, "phrase": "larger_diameter"}, {"score": 0.0022608057001451414, "phrase": "clustering_coefficient"}], "paper_keywords": ["Multimedia streaming", " Peer-to-peer networks", " Network traffic"], "paper_abstract": "Peer-to-peer (P2P) multimedia streaming applications need to reduce network traffic to address ISPs' concerns without sacrificing the quality of users' viewing experience. Several studies on P2P file sharing applications propose that a peer only neighbors with nearby peers to reduce network traffic, but whether this strategy is applicable to P2P multimedia streaming applications remains an open issue. In this paper, we study packet propagation behavior and the impact of neighboring strategies on system performance in P2P multimedia streaming applications. We identify two \"typical\" schemes that capture the essential aspects of the swarm-based and tree-based P2P multimedia streaming schemes, respectively, and compare their performance on two types of neighboring overlays: a random overlay where a peer selects neighbors without considering their network locations, and a nearby overlay where a peer only neighbors with nearby peers. We first conduct simulation study and then provide models to analyze packet propagation behavior on a given overlay in the two typical schemes and the impact of the neighbor-with-nearby-peers strategy on system performance. We find that in the swarm-based scheme, packets propagate along short paths (in terms of hops) on the neighboring overlay, while in the tree-based scheme, peers select parents randomly with respect to their hop counts to the source peer. Applying the neighbor-with-nearby-peers strategy reduces network traffic but results in more lost packets because the nearby overlay has a larger diameter and clustering coefficient. This problem is more severe in the tree-based scheme than in the swarm-based scheme due to their different packet propagation behavior.' (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Understanding the impact of neighboring strategy in peer-to-peer multimedia streaming applications", "paper_id": "WOS:000309697000013"}