{"auto_keywords": [{"score": 0.04014175749838657, "phrase": "ewom_appraisals"}, {"score": 0.015177865934452318, "phrase": "swot_analysis"}, {"score": 0.00984550107543474, "phrase": "ontology-based_swot_analysis_mechanism"}, {"score": 0.008825083500811527, "phrase": "strategic_planning"}, {"score": 0.004814951563359404, "phrase": "swot"}, {"score": 0.004747141873785, "phrase": "electronic_word"}, {"score": 0.004598027492787762, "phrase": "company's_strengths"}, {"score": 0.0044535760439663235, "phrase": "internal_and_external_factors"}, {"score": 0.0041485458333515, "phrase": "biased_views"}, {"score": 0.0038780652371817447, "phrase": "important_task"}, {"score": 0.0038506359988314787, "phrase": "modern_enterprises"}, {"score": 0.00376950244909, "phrase": "consumer_opinions"}, {"score": 0.0036900720643677034, "phrase": "firm's_brand"}, {"score": 0.002950374774004939, "phrase": "information_structure"}, {"score": 0.0027092368768921542, "phrase": "effective_tool"}, {"score": 0.002559501330352064, "phrase": "ewom_management_framework"}, {"score": 0.002496615320278004, "phrase": "ontology-based_swot_analysis_model"}, {"score": 0.002435270624076196, "phrase": "ontology-based_swot_analysis_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Electronic word-of-mouth (eWOM)", " Strengths", " Weaknesses", " Opportunities and threats (SWOT)", " Ontology", " Marketing analysis"], "paper_abstract": "SWOT analysis highlights a company's strengths, weaknesses, opportunities and threats by addressing internal and external factors affecting the enterprise. Although traditionally it is a tools used by management, they are likely to hold biased views, thus tampers result of the analysis. Therefore, yow to effectively conduct more effective SWOT analyses has become an important task for modern enterprises. eWOM appraisals are one form of consumer opinions, and include information a firm's brand, as well as the strengths, weaknesses, opportunities, and threats (SWOT) that exist with regard to its products or services. Through the use of eWOM appraisals, it is expected that a SWOT analysis may be more objective and provide enterprises with more accurate information to carry out more effective strategic planning. Therefore, this study develops an ontology-based SWOT analysis mechanism that can reveal the information structure of eWOM appraisals, and thus the strengths, weaknesses, opportunities, and threats of an enterprise. This approach can be an effective tool for strategic planning. Specifically this study has the following aims: (i) designing an eWOM management framework; (ii) constructing an ontology-based SWOT analysis model; (iii) providing an ontology-based SWOT analysis method; and (iv) developing an ontology-based SWOT analysis mechanism for eWOM. The results of this study were verified using questionnaires, which showed that this approach can be effective in assisting managers in their making strategic planning. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Ontology-based SWOT analysis method for electronic word-of-mouth", "paper_id": "WOS:000323875500010"}