{"auto_keywords": [{"score": 0.04709141428592274, "phrase": "csr"}, {"score": 0.012140753346738453, "phrase": "csr_announcements"}, {"score": 0.00481495049065317, "phrase": "csr_initiatives"}, {"score": 0.004545598514506788, "phrase": "firm's_corporate_social_responsibility"}, {"score": 0.004335081499311714, "phrase": "industry-level_effects"}, {"score": 0.0038764861784138117, "phrase": "cybernetic_model"}, {"score": 0.003850299959557491, "phrase": "decision_making"}, {"score": 0.003525493807130663, "phrase": "relevant_factor"}, {"score": 0.0034311578789991363, "phrase": "industry-specific_effects"}, {"score": 0.003373479748579024, "phrase": "firms'_performance"}, {"score": 0.003141598480804135, "phrase": "positive_effect"}, {"score": 0.003036832649117453, "phrase": "industry-specific_factors"}, {"score": 0.0028764048059439205, "phrase": "firm_performance"}, {"score": 0.002669525619637691, "phrase": "hotel_industry"}, {"score": 0.0026424892463535717, "phrase": "average_behavior"}, {"score": 0.0024440836179156593, "phrase": "airline_industry"}, {"score": 0.0024193249334041557, "phrase": "worst_situation"}, {"score": 0.0022300545742463262, "phrase": "csr_resources"}, {"score": 0.002162951519368368, "phrase": "first_attempt"}, {"score": 0.0021049977753042253, "phrase": "different_relationships"}], "paper_keywords": ["Corporate social responsibility", " Airlines", " Hotels", " Cybernetic model of decision making", " Market value", " Systems thinking/systems theory"], "paper_abstract": "Purpose - This study aims to examine the relationships between a firm's corporate social responsibility (CSR) activities and its performance and risk. The authors hypothesize that industry-level effects are highly determinant of the sign and magnitude of these relationships to establish a ranking of industries to identify the position of the most prominent tourism-related industries: hotels and airlines. Based on the cybernetic model of decision making and the heuristics thereof, shareholders base their investment decisions derived from CSR announcements on the idea that the industries behave differently; their fixed costs being a relevant factor. Design/methodology/approach - The authors estimate the industry-specific effects of CSR initiatives on firms' performance and risk using a sample of 583 announcements from the Spanish Stock Market. Findings - The results show that while CSR announcements have a positive effect on performance when the authors do not account for industry-specific factors, once the authors incorporate these factors into the analysis, the authors find that firm performance and risk vary quite substantially as a function of the industry to which the firm belongs. Interestingly, while the hotel industry presents an average behavior (standing at 9th position in returns, 15th in terms of risk, and 8th according to the ratio returns/volatility), the airline industry presents the worst situation of all industries: last in performance and last in risk. Practical - implications The results help managers assess their decisions and allocate CSR resources optimally. Originality/value - This article is the first attempt to empirically test and comprehensively detect the different relationships between CSR and firm performance across industries.", "paper_title": "Industry-specific effect of CSR initiatives: hotels and airlines", "paper_id": "WOS:000334146900015"}