{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "peer-to-peer_networks"}, {"score": 0.0046491050101721545, "phrase": "resource_sharing_policies"}, {"score": 0.0036921366375716005, "phrase": "favorable_scaling"}, {"score": 0.0036370297611938796, "phrase": "offered_load"}, {"score": 0.003459191419478298, "phrase": "service_capacity"}, {"score": 0.002873331232538783, "phrase": "resource_allocation"}, {"score": 0.0027327327233891865, "phrase": "peer's_performance"}, {"score": 0.0026120705848349055, "phrase": "intuitive_'fairness'_notions"}, {"score": 0.0025473475682739784, "phrase": "'unfair'_allocations"}, {"score": 0.002459414063407306, "phrase": "right_incentives"}, {"score": 0.0022022878843247257, "phrase": "system_robustness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["peer-to-peer", " file sharing", " service capacity", " incentive", " fairness"], "paper_abstract": "In this paper we model and Study the performance of peer-to-peer (P2P) file sharing systems in terms of their service capacity'. We identify two regimes of interest: the transient and stationary regimes. We show that in both regimes, the performance of P2P systems exhibits a favorable scaling with the offered load. P2P systems achieve this by efficiently leveraging the service capacity of other peers, who possibly are concurrently downloading the same file. Therefore to improve the performance, it is important to design mechanisms to give peers incentives for sharing/cooperation. One approach is to introduce mechanisms for resource allocation that are 'fair', such that a peer's performance improves with his contributions. We find that some intuitive 'fairness' notions may unexpectedly lead to 'unfair' allocations, which do not provide the right incentives for peers. Thus, implementation of P2P systems may want to compromise the degree of 'fairness' in favor of maintaining system robustness and reducing overheads. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Performance of peer-to-peer networks: Service capacity and role of resource sharing policies", "paper_id": "WOS:000235488900003"}