{"auto_keywords": [{"score": 0.04364011428330573, "phrase": "total_rejection_cost"}, {"score": 0.008643005165680485, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "scheduling_problem"}, {"score": 0.004603525341738782, "phrase": "flow-shop_scheduling_system"}, {"score": 0.00333097896868937, "phrase": "entire_set"}, {"score": 0.0033011569787033297, "phrase": "pareto-optimal_points"}, {"score": 0.003058179790439378, "phrase": "single_machine"}, {"score": 0.0028586409810976367, "phrase": "pseudo-polynomial_time"}, {"score": 0.002624423288947767, "phrase": "pareto_optimal_schedule"}, {"score": 0.0022520496048464406, "phrase": "auxiliary_problems"}, {"score": 0.0022118619998034742, "phrase": "fptas_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Flow-shop scheduling", " Scheduling with rejection", " Bicriteria optimization", " NP-hard", " Approximation algorithm", " Pseudo-polynomial time algorithm", " FPTAS"], "paper_abstract": "We study a scheduling problem with rejection on a set of two machines in a flow-shop scheduling system. We evaluate the quality of a solution by two criteria: the first is the makespan and the second is the total rejection cost. We show that the problem of minimizing the makespan plus total rejection cost is NP-hard and for its solution we provide two different approximation algorithms, a pseudo-polynomial time optimization algorithm and a fully polynomial time approximation scheme (FPTAS). We also study the problem of finding the entire set of Pareto-optimal points (this problem is NP-hard due to the RP-hardness of the same problem variation on a single machine [20]). We show that this problem can be solved in pseudo-polynomial time. Moreover, we show how we can provide an FPTAS that, given that there exists a Pareto optimal schedule with a total rejection cost of at most R and a makespan of at most K, finds a solution with a total rejection cost of at most (1+epsilon)R and a makespan value of at most (1+epsilon)K. This is done by defining a set of auxiliary problems and providing an FPTAS algorithm to each one of them. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Two-machine flow-shop scheduling with rejection", "paper_id": "WOS:000296000600020"}