{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncapacitated_facility_location_problem"}, {"score": 0.045910752496916486, "phrase": "facilities_r"}, {"score": 0.004591202593942391, "phrase": "opening_costs"}, {"score": 0.0038115535592184438, "phrase": "robust_fault-tolerant_version"}, {"score": 0.0034353020860809404, "phrase": "closest_open_facility"}, {"score": 0.0026603411931700556, "phrase": "polynomial_time_algorithm"}, {"score": 0.0024078737745407614, "phrase": "fixed_alpha"}, {"score": 0.002315719347244451, "phrase": "rftfl_problem"}, {"score": 0.002296659998222875, "phrase": "np"}, {"score": 0.0021604924928015283, "phrase": "single_failure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Facility location", " Approximation algorithms", " Fault-tolerance"], "paper_abstract": "In the uncapacitated facility location problem, given a graph, a set of demands and opening costs, it is required to find a set of facilities R, so as to minimize the sum of the cost of opening the facilities in R and the cost of assigning all node demands to open facilities. This paper concerns the robust fault-tolerant version of the uncapacitated facility location problem (RFTFL). In this problem, one or more facilities might fail, and each demand should be supplied by the closest open facility that did not fail. It is required to find a set of facilities R, so as to minimize the sum of the cost of opening the facilities in R and the cost of assigning all node demands to open facilities that did not fail, after the failure of up to a facilities. We present a polynomial time algorithm that yields a 6.464-approximation for this problem with at most one failure and a 1.488 + 7.464 alpha-approximation for the problem with at most a failures for a fixed alpha > 1. We also show that the RFTFL problem is NP-hard even on trees, and even in the case of a single failure. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Robust fault tolerant uncapacitated facility location", "paper_id": "WOS:000339702600002"}