{"auto_keywords": [{"score": 0.02783657715163716, "phrase": "bayesian_risk_decision"}, {"score": 0.015719716506582538, "phrase": "probabilistic_rough_set"}, {"score": 0.006520224141369757, "phrase": "probabilistic_rough_set_models"}, {"score": 0.004190796368475121, "phrase": "new_extension"}, {"score": 0.0041357305373417455, "phrase": "classical_probabilistic_rough_set"}, {"score": 0.003896717568943166, "phrase": "probabilistic_approximation_space"}, {"score": 0.0032591491777773035, "phrase": "bayesian_minimum_risk_decision_problem"}, {"score": 0.0028739078688746374, "phrase": "generalized_probabilistic_rough_set_models"}, {"score": 0.0023716501597131024, "phrase": "numerical_example"}, {"score": 0.0023249757987087055, "phrase": "medical_diagnosis_systems"}, {"score": 0.0021330830123432614, "phrase": "effective_assistant"}, {"score": 0.0021049977753042253, "phrase": "decision_makers"}], "paper_keywords": ["Bayesian risk decision", " probabilistic rough set", " two universes"], "paper_abstract": "We consider a problem of Bayesian risk decision based on probabilistic rough set over two universes. It is a new extension of classical probabilistic rough set on the same universe. We give four rough set models on probabilistic approximation space over two universes. Then we study the interrelationship between Bayesian risk decision and probabilistic rough set models over two universes. The results show that there must exist a kind of Bayesian minimum risk decision problem corresponding to one of the probabilistic rough set models over two universes. In fact, the conclusion also includes some generalized probabilistic rough set models on the same universe by other authors. And at the same time, the principal and validity of the Bayesian risk decision based on probabilistic rough set over two universes are tested by a numerical example of the medical diagnosis systems in detail. The probabilistic rough set approach over two universes gives an effective assistant for decision makers in the context of risk and uncertainty.", "paper_title": "On relationship between probabilistic rough set and Bayesian risk decision over two universes", "paper_id": "WOS:000301118000002"}