{"auto_keywords": [{"score": 0.04142796991747152, "phrase": "interval_arithmetic"}, {"score": 0.00481495049065317, "phrase": "hydrological_model_calibration"}, {"score": 0.004710306419574744, "phrase": "averaged_flux_input"}, {"score": 0.004669085371587273, "phrase": "flux_output"}, {"score": 0.00439041997682389, "phrase": "integral_model_input"}, {"score": 0.0038989120088094185, "phrase": "calibration_hydrological_models"}, {"score": 0.0033131804981786747, "phrase": "output_data"}, {"score": 0.003007389443770562, "phrase": "input_data_sets"}, {"score": 0.002981026404927824, "phrase": "time_series"}, {"score": 0.0029161225023394363, "phrase": "fixed_or_variable_time_intervals"}, {"score": 0.002682081928174866, "phrase": "output_value"}, {"score": 0.0026121403051734744, "phrase": "specific_point"}, {"score": 0.002499590390751339, "phrase": "linear_reservoir"}, {"score": 0.0022290883852844057, "phrase": "simple_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Conceptual rainfall run-off modelling", " Parameter calibration", " Interval arithmetic", " Linear reservoir model", " Numerical methods", " Hydrology", " Calibration"], "paper_abstract": "This paper shows that the uncertainty due to derivation of fluxes from integral model input can be at least as large as that due to uncertainty in the measurements. The method used to illustrate the problem is interval arithmetic. During calibration hydrological models often seem to perform equally well for two or more sets of parameters that differ considerably. There are many ingredients that may contribute to this. One of those ingredients is a mismatch of information present in input and output data and information used by the model. In this paper we examine one particular case where this occurs. We assume that the input data sets are time series of fluxes integrated over fixed or variable time intervals, while outputs can be the result of continuous or discrete, direct or indirect flux measurements. We assume that for model calibration purposes each output value represents a value at a specific point in time. We show that even for a linear reservoir the process of averaging and sampling may make recovery of its sole parameter impossible. We also show that these problems can be diagnosed and for this simple model also solved through the use of interval arithmetic. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A problem in hydrological model calibration in the case of averaged flux input and flux output", "paper_id": "WOS:000306041500016"}