{"auto_keywords": [{"score": 0.04812854551814997, "phrase": "intelligent_environments"}, {"score": 0.00481495049065317, "phrase": "software_simulation"}, {"score": 0.004453874101119545, "phrase": "spin_model_checker"}, {"score": 0.004034962424068988, "phrase": "methodological_guide"}, {"score": 0.0035063024767122684, "phrase": "well-known_tools"}, {"score": 0.003477255247998112, "phrase": "spin"}, {"score": 0.0030308784612749647, "phrase": "complex_software_systems"}, {"score": 0.0029530125680590413, "phrase": "industry_field"}, {"score": 0.0024103044278902916, "phrase": "complex_systems"}, {"score": 0.0022407927161620855, "phrase": "human-computer_interaction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reliability", " Intelligent Environments", " Simulation", " Verification", " Model checking", " Spin"], "paper_abstract": "This paper explains how the Spin model checker can be used to guide and inform the development of more reliable Intelligent Environments. The idea is to present a methodological guide which provides strategies and suggestions on how to model, simulate and verify these types of systems, as well as to facilitate the use of well-known tools like Spin in the development of Intelligent Environments. These tools, which have been developed by the Software Engineering community, have proven their usefulness for improving the quality of complex software systems, even in the industry field. However, researchers and developers in the area of Intelligent Environments do not usually make use of these tools. Our aim is therefore to encourage their use by colleagues working in this area to increase the reliability of these complex systems, which integrate aspects and elements of networks, sensors/actuators, ubiquitous/pervasive computing, human-computer interaction and artificial intelligence, among other related areas. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Software simulation and verification to increase the reliability of Intelligent Environments", "paper_id": "WOS:000316978800003"}