{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "good_first_impression"}, {"score": 0.00481495049065317, "phrase": "categorical_data"}, {"score": 0.00406214911915987, "phrase": "low-order_statistics"}, {"score": 0.003678414118674967, "phrase": "middle_ground"}, {"score": 0.0035925056609681194, "phrase": "parameter-free_method"}, {"score": 0.003541923233726252, "phrase": "high-quality_descriptive_summaries"}, {"score": 0.0035085965086415474, "phrase": "binary_and_categorical_data"}, {"score": 0.0031769866037536045, "phrase": "best_clustering"}, {"score": 0.003102752392819577, "phrase": "distance_measure"}, {"score": 0.0030017207229983385, "phrase": "practical_overview"}, {"score": 0.0026543514413663893, "phrase": "extensive_experimentation"}, {"score": 0.0025922974876210194, "phrase": "high-quality_results"}, {"score": 0.002125020720324262, "phrase": "estimated_supports"}, {"score": 0.0021049977753042253, "phrase": "frequent_generalized_itemsets"}], "paper_keywords": ["Attribute clustering", " MDL", " Summarization", " Categorical data"], "paper_abstract": "For a book, its title and abstract provide a good first impression of what to expect from it. For a database, obtaining a good first impression is typically not so straightforward. While low-order statistics only provide very limited insight, downright mining the data rapidly provides too much detail for such a quick glance. In this paper we propose a middle ground, and introduce a parameter-free method for constructing high-quality descriptive summaries of binary and categorical data. Our approach builds a summary by clustering attributes that strongly correlate, and uses the Minimum Description Length principle to identify the best clustering-without requiring a distance measure between attributes. Besides providing a practical overview of which attributes interact most strongly, these summaries can also be used as surrogates for the data, and can easily be queried. Extensive experimentation shows that our method discovers high-quality results: correlated attributes are correctly grouped, which is verified both objectively and subjectively. Our models can also be employed as surrogates for the data; as an example of this we show that we can quickly and accurately query the estimated supports of frequent generalized itemsets.", "paper_title": "Summarizing categorical data by clustering attributes", "paper_id": "WOS:000313116400005"}