{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_reviews"}, {"score": 0.005875227285265524, "phrase": "online_reviews_manipulation"}, {"score": 0.0044957939485759995, "phrase": "purchase_decisions"}, {"score": 0.003611751858608048, "phrase": "reader's_discretion"}, {"score": 0.0032742770692989766, "phrase": "simple_statistical_method"}, {"score": 0.0031379788088249576, "phrase": "manipulated_reviews"}, {"score": 0.0030769941082173314, "phrase": "writing_style"}, {"score": 0.00285396838599055, "phrase": "textual_information"}, {"score": 0.0027984877593293786, "phrase": "sentiment_mining_techniques"}, {"score": 0.0027802342638725505, "phrase": "readability_assessments"}, {"score": 0.0026212045623658932, "phrase": "deliberate_use"}, {"score": 0.002570237158808816, "phrase": "manipulated_products"}, {"score": 0.0021821915946356168, "phrase": "book_reviews"}, {"score": 0.0021467594103960585, "phrase": "fraudulent_manipulation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Manipulation", " Online reviews", " Ratings", " Readability", " Runs test", " Sentiments", " Text mining"], "paper_abstract": "As consumers become increasingly reliant on online reviews to make purchase decisions, the sales of the product becomes dependent on the word of mouth (WOM) that it generates. As a result, there can be attempts by firms to manipulate online reviews of products to increase their sales. Despite the suspicion on the existence of such manipulation, the amount of such manipulation is unknown, and deciding which reviews to believe in is largely based on the reader's discretion and intuition. Therefore, the success of the manipulation of reviews by firms in generating sales of products is unknown. In this paper, we propose a simple statistical method to detect online reviews manipulation, and assess how consumers respond to products with manipulated reviews. In particular, the writing style of reviewers is examined, and the effectiveness of manipulation through ratings, sentiments, and readability is investigated. Our analysis examines textual information available in online reviews by combining sentiment mining techniques with readability assessments. We discover that around 10.3% of the products are subject to online reviews manipulation. In spite of the deliberate use of sentiments and ratings in manipulated products, consumers are only able to detect manipulation taking place through ratings, but not through sentiments. The findings from this research ensue a note of caution for all consumers that rely on online reviews of books for making purchases, and encourage them to delve deep into the book reviews without being deceived by fraudulent manipulation. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Manipulation of online reviews: An analysis of ratings, readability, and sentiments", "paper_id": "WOS:000300648300012"}