{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "partial_broadcast_channels"}, {"score": 0.01551950290766091, "phrase": "conventional_secret_sharing_scheme"}, {"score": 0.015272762466080635, "phrase": "point-to-point_channels"}, {"score": 0.011512186343824475, "phrase": "partial_broadcast_secret_sharing_schemes"}, {"score": 0.009337160108445885, "phrase": "partial_broadcast_secret_sharing_scheme"}, {"score": 0.008697438622134191, "phrase": "communication_rate"}, {"score": 0.004440277230269978, "phrase": "later_stage"}, {"score": 0.004411588377842043, "phrase": "authorised_group"}, {"score": 0.004326624385772596, "phrase": "secure_point-to-point_channels"}, {"score": 0.003900257249255497, "phrase": "partial_broadcast_channel"}, {"score": 0.0038127186374325582, "phrase": "multipoint_channel"}, {"score": 0.003643470150731877, "phrase": "fixed_subset"}, {"score": 0.0035732464638415307, "phrase": "secret_sharing_schemes"}, {"score": 0.0034479873922329323, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0034145918296403874, "phrase": "partial_broadcast_channel_allocation"}, {"score": 0.003294875957676514, "phrase": "combinatorial_object"}, {"score": 0.003018468582368033, "phrase": "significant_reduction"}, {"score": 0.0027831968213396056, "phrase": "secret_size"}, {"score": 0.0027562222950919257, "phrase": "total_size"}, {"score": 0.002549604441640963, "phrase": "significant_increase"}, {"score": 0.0025248881422983553, "phrase": "corresponding_value"}, {"score": 0.0024761702541879213, "phrase": "conventional_secret_sharing_schemes"}, {"score": 0.0022756672722130424, "phrase": "high_communication_rates"}, {"score": 0.0021674482571326283, "phrase": "possible_extensions"}, {"score": 0.0021049977753042253, "phrase": "open_problems"}], "paper_keywords": ["secret sharing", " partial broadcast", " cover-free family", " perfect hash-family"], "paper_abstract": "In a conventional secret sharing scheme a dealer uses secure point-to-point channels to distribute the shares of a secret to a number of participants. At a later stage an authorised group of participants send their shares through secure point-to-point channels to a combiner who will reconstruct the secret. In this paper, we assume no point-to-point channel exists and communication is only through partial broadcast channels. A partial broadcast channel is a point-to-multipoint channel that enables a sender to send the same message simultaneously and privately to a fixed subset of receivers. We study secret sharing schemes with partial broadcast channels, called partial broadcast secret sharing schemes. We show that a necessary and sufficient condition for the partial broadcast channel allocation of a (t, n)-threshold partial secret sharing scheme is equivalent to a combinatorial object called a cover-free family. We use this property to construct a (t, n)-threshold partial broadcast secret sharing scheme with O(log n) partial broadcast channels. This is a significant reduction compared to n point-to-point channels required in a conventional secret sharing scheme. Next, we consider communication rate of a partial broadcast secret sharing scheme defined as the ratio of the secret size to the total size of messages sent by the dealer. We show that the communication rate of a partial broadcast secret sharing scheme can approach 1/O(log n) which is a significant increase over the corresponding value, 1/n, in the conventional secret sharing schemes. We derive a lower bound on the communication rate and show that for a (t,n)-threshold partial broadcast secret sharing scheme the rate is at least 1/t and then we propose constructions with high communication rates. We also present the case of partial broadcast secret sharing schemes for general access structures, discuss possible extensions of this work and propose a number of open problems.", "paper_title": "Secret sharing schemes with partial broadcast channels", "paper_id": "WOS:000240316900001"}