{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_image_segmentation"}, {"score": 0.004668059458774745, "phrase": "novel_method"}, {"score": 0.0045256353450666325, "phrase": "atanassov"}, {"score": 0.004364919932563366, "phrase": "widely_used_fuzzy_c"}, {"score": 0.004253618550301311, "phrase": "euclidean_distance"}, {"score": 0.0038959121068990517, "phrase": "new_method"}, {"score": 0.003855849747095327, "phrase": "atanassov's_intuitionistic_fuzzy_set_theory"}, {"score": 0.0037381083634085424, "phrase": "based_distance_function"}, {"score": 0.0036616109902631293, "phrase": "membership_degrees"}, {"score": 0.0034951469511975346, "phrase": "sugeno_type_fuzzy_complement"}, {"score": 0.0033883824438527316, "phrase": "non-membership_values"}, {"score": 0.003336225354214798, "phrase": "hesitation_degree"}, {"score": 0.0025230952890994236, "phrase": "noisy_environment"}, {"score": 0.002137947680862631, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "hyper_tangent_kernel"}], "paper_keywords": ["Atanassov's intuitionistic fuzzy set", " hesitation degree", " intuitionistic fuzzy cluster", " kernel", " medical image"], "paper_abstract": "This paper suggests a novel method for medical image segmentation using kernel based Atanassov's intuitionistic fuzzy clustering. The widely used fuzzy c means clustering that uses Euclidean distance has many limitations in clustering the regions accurately. To overcome these difficulties, we introduce a new method using Atanassov's intuitionistic fuzzy set theory that incorporates a robust kernel based distance function. As the membership degrees are not precise and may contain hesitation, Sugeno type fuzzy complement is used to find the non-membership values and then hesitation degree is computed. The algorithm uses all the three kernels - Gaussian, radial basis, and hyper tangent kernels. In the algorithm, for each pixel, two features are considered - pixel energy and mean and the average of the two features are taken. The method clusters the tumors/lesions/clots almost accurately especially in a noisy environment. Experiments are performed on several noisy medical images and to assess the performance of the method, the algorithm is compared with the existing non fuzzy, fuzzy, intuitionistic fuzzy methods. It is observed that the results using the proposed method that uses hyper tangent kernel seem to be much better.", "paper_title": "An Atanassov's intuitionistic Fuzzy Kernel Clustering for Medical Image segmentation", "paper_id": "WOS:000336214400013"}