{"auto_keywords": [{"score": 0.04410425397162581, "phrase": "el_gamal"}, {"score": 0.0294780629819353, "phrase": "second_strategy"}, {"score": 0.02635688574108659, "phrase": "generalized_strategy"}, {"score": 0.00481495049065317, "phrase": "backward_decoding_strategies"}, {"score": 0.004728624975677976, "phrase": "relay_channel"}, {"score": 0.004478782833067256, "phrase": "three-node_relay_channel"}, {"score": 0.004319566932528865, "phrase": "basic_coding_strategies"}, {"score": 0.004268342569419864, "phrase": "cover"}, {"score": 0.00406663414150229, "phrase": "source_message"}, {"score": 0.0030251262102203385, "phrase": "general_relay_channel"}, {"score": 0.0029707940194245216, "phrase": "first_strategy"}, {"score": 0.0022633993976138387, "phrase": "higher_achievable_rates"}, {"score": 0.0021049977753042253, "phrase": "gaussian_relay_channel"}], "paper_keywords": ["backward decoding", " compress-and-forward", " decode-and-forward", " relay channel"], "paper_abstract": "This correspondence studies coding strategies for a three-node relay channel. We start with the basic coding strategies of Cover and El Gamal: the relay decodes the source message and forward it to the destination (cooperation); the relay transmits its compressed channel outputs to the destination (facilitation); or the relay superimposes both cooperation and facilitation (generalized). In this paper, two new generalized strategies superimposing cooperation and facilitation are introduced and investigated on the general relay channel. The first strategy makes use of sequential backward (SeqBack) decoding while the second strategy makes use of simultaneous backward (SimBack) decoding. The achievable rate for the second strategy is shown to include that of the generalized strategy of Cover and El Gamal. Assuming zero-mean, jointly Gaussian random variables, the two new strategies give higher achievable rates than the generalized strategy of Cover and El Gamal for certain parameters on the Gaussian relay channel.", "paper_title": "Generalized backward decoding strategies for the relay channel", "paper_id": "WOS:000243317600028"}