{"auto_keywords": [{"score": 0.027610997160756472, "phrase": "pm"}, {"score": 0.014191883684712442, "phrase": "hm"}, {"score": 0.00481495049065317, "phrase": "holistic_project-"}, {"score": 0.004778258911940497, "phrase": "hospitality_management"}, {"score": 0.004687742829233727, "phrase": "conceptual_paper"}, {"score": 0.004147523799581407, "phrase": "scientific_sources"}, {"score": 0.003797978200741566, "phrase": "special_stress"}, {"score": 0.003697538418750941, "phrase": "possible_preventing"}, {"score": 0.003585986761045987, "phrase": "hospitality_development"}, {"score": 0.003545024951402821, "phrase": "social_and_physical_environments"}, {"score": 0.0033599501775954024, "phrase": "hm_development"}, {"score": 0.003334408970257256, "phrase": "europe"}, {"score": 0.003208999546225013, "phrase": "main_development_stages"}, {"score": 0.002690406375639144, "phrase": "evolution_stages"}, {"score": 0.002472822097373027, "phrase": "development_stages"}, {"score": 0.0022296340517805125, "phrase": "improved_understanding"}], "paper_keywords": ["Project management", " Social responsibility", " Hospitality management", " Systems thinking", " Development generations"], "paper_abstract": "Purpose - This conceptual paper aims to integrate and significantly extend past research cognitions from three different scientific fields: project management (PM), hospitality management (HM) and systems thinking (ST). As scarcely any scientific sources are available on these topics, this paper closes a gap in literature and invites to further research in this field. Special stress is given to the research of possible preventing or at least reducing of negative impacts/footprints of hospitality development to the social and physical environments. Design/methodology/approach - The authors present an overview of milestones in project- and HM development in Europe from the end of the Roman Empire till today. The main development stages are checked in view of SR and ST applications. Findings - This research is predominately theoretical, although it also presents several examples from practice that very clearly illustrate the need for merging the knowledge from these both (PM and BM) fields of expertise. The results of the evolution stages show that the development of both BM and PM has always been synchronic, and that PM has practically in all development stages been applied to HM, although this happened unconsciously and thus less effective than in other industries. Originality/value - The value of this research is an improved understanding of the need for merging the cognitions from HM and PM for more responsibility in further HM projects.", "paper_title": "Systemic integration of holistic project- and hospitality management", "paper_id": "WOS:000334146900004"}