{"auto_keywords": [{"score": 0.04905481275957967, "phrase": "non-linear_equations"}, {"score": 0.01558578599760268, "phrase": "second_derivatives"}, {"score": 0.013729220262422896, "phrase": "numerical_results"}, {"score": 0.00481495049065317, "phrase": "newton's_method"}, {"score": 0.004492950096237056, "phrase": "nice_applications"}, {"score": 0.004247180402119585, "phrase": "numerical_methods"}, {"score": 0.004074046640784066, "phrase": "new_methods"}, {"score": 0.0039014477994310055, "phrase": "theoretical_analysis"}, {"score": 0.0036029221645629225, "phrase": "proposed_iterative_methods"}, {"score": 0.0035564156572789473, "phrase": "simple_root"}, {"score": 0.003480230347985338, "phrase": "iterative_methods"}, {"score": 0.0032471982781283344, "phrase": "second_derivative"}, {"score": 0.003109519872758431, "phrase": "proposed_iterative_algorithms"}, {"score": 0.0028390477456009568, "phrase": "newton's_theorem"}, {"score": 0.0026951616152303373, "phrase": "fourth-order_convergence"}, {"score": 0.002387083859537412, "phrase": "non-linear_equation"}, {"score": 0.0021049977753042253, "phrase": "best_property"}], "paper_keywords": ["Mathematics", " Iterative methods", " Newton's method", " Order of convergence", " Fourth-order convergence"], "paper_abstract": "Purpose - Solving the non-linear equation f(x) = 0 has nice applications in various branches of physics and engineering. Sometimes the applications of the numerical methods to solve non-linear equations depending on the second derivatives are restricted in physics and engineering. The purpose of this paper is to propose two new modified Newton's method for solving non-linear equations. Convergence results show that the order of convergence of the proposed iterative methods for a simple root is four. The iterative methods are free from second derivative and can be used for solving non-linear equations without computing the second derivative. Finally, several numerical examples are given to illustrate that proposed iterative algorithms are effective. Design/methodology/approach - In this paper, first the authors introduce two new approximations for the definite integral arising from Newton's theorem. Then by considering these approximations, two new iterative methods are provided with fourth-order convergence which can be used for solving non-linear equations without computing second derivatives. Findings - In this paper, the authors propose two new iterative methods without second derivatives for solving the non-linear equation f(x) = 0. From numerical results, it is observed that the new methods are comparable with various iterative methods. Also numerical results corroborate the theoretical analysis. Originality/value - The best property of these schemes is that they are second derivative free. Also from numerical results, it is observed that the new methods are comparable with various iterative methods. The numerical results corroborate the theoretical analysis.", "paper_title": "Fourth-order variants of Newton's method without second derivatives for solving non-linear equations", "paper_id": "WOS:000306204200007"}