{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "text_categorization"}, {"score": 0.0496265667331732, "phrase": "feature_selection"}, {"score": 0.026566810399652994, "phrase": "scoring_measures"}, {"score": 0.010191931932450292, "phrase": "reduced_number"}, {"score": 0.008317329982064093, "phrase": "wrapper_method"}, {"score": 0.007566126016179327, "phrase": "hybrid_approach"}, {"score": 0.004701985831087475, "phrase": "important_task"}, {"score": 0.00459165923324494, "phrase": "irrelevant_or_noisy_features"}, {"score": 0.0040969285074699, "phrase": "filtering_approach"}, {"score": 0.003962899903266524, "phrase": "highest_score"}, {"score": 0.003725470458263889, "phrase": "information_theory"}, {"score": 0.00369022262431101, "phrase": "machine_learning"}, {"score": 0.003436242862104006, "phrase": "filtering_approaches"}, {"score": 0.0032302647179383915, "phrase": "text_domains"}, {"score": 0.0030802351224657673, "phrase": "feature_subsets"}, {"score": 0.003007846011394511, "phrase": "fast_method"}, {"score": 0.0029793675408245047, "phrase": "evaluation_function"}], "paper_keywords": ["feature selection", " text categorization", " wrapper approach", " scoring measures"], "paper_abstract": "Feature Selection is an important task within Text Categorization, where irrelevant or noisy features are usually present, causing a lost in the performance of the classifiers. Feature Selection in Text Categorization has usually been performed using a filtering approach based on selecting the features with highest score according to certain measures. Measures of this kind come from the Information Retrieval, Information Theory and Machine Learning fields. However, wrapper approaches are known to perform better in Feature Selection than filtering approaches, although they are time- consuming and sometimes infeasible, especially in text domains. However a wrapper that explores a reduced number of feature subsets and that uses a fast method as evaluation function could overcome these difficulties. The wrapper presented in this paper satisfies these properties. Since exploring a reduced number of subsets could result in less promising subsets, a hybrid approach, that combines the wrapper method and some scoring measures, allows to explore more promising feature subsets. A comparison among some scoring measures, the wrapper method and the hybrid approach is performed. The results reveal that the hybrid approach outperforms both the wrapper approach and the scoring measures, particularly for corpora whose features are less scattered over the categories.", "paper_title": "A hybrid feature selection method for text categorization", "paper_id": "WOS:000250955500001"}