{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "city_infrastructure"}, {"score": 0.00402610372759447, "phrase": "technical_and_organizational_standpoint"}, {"score": 0.0037446875860947916, "phrase": "physical_infrastructures"}, {"score": 0.0037128955884188773, "phrase": "digital_technologies"}, {"score": 0.003634587156159668, "phrase": "technological_innovation"}, {"score": 0.003394891095032025, "phrase": "future_smart_cities"}, {"score": 0.003211788912325178, "phrase": "increased_availability"}, {"score": 0.003157455511069507, "phrase": "analytical_techniques"}, {"score": 0.0030515222178491923, "phrase": "better_integration"}, {"score": 0.003025597247856977, "phrase": "physical_and_digital_infrastructures"}, {"score": 0.0029116257477000617, "phrase": "engineering_tools"}, {"score": 0.002362192695471035, "phrase": "case_studies"}, {"score": 0.0023421493941875927, "phrase": "ibm"}, {"score": 0.0023123057299992587, "phrase": "construction_company"}, {"score": 0.0023024551893939403, "phrase": "laing_o'rourke"}, {"score": 0.0022251433045184454, "phrase": "\"innovation_technologies"}, {"score": 0.0021504218042734677, "phrase": "physical-digital_integration"}], "paper_keywords": [""], "paper_abstract": "There is increasing recognition by researchers, businesses, and policymakers of the value of integrating the systems of systems of which cities are comprised. It is less clear how this can be achieved, in practice, from a technical and organizational standpoint. This paper is concerned with one element of this integration, namely, the integration of physical infrastructures and digital technologies. We argue that technological innovation has historically been crucial to the development of cities and will also be crucial in future smart cities. Cities become \"smarter'' when they make use of the increased availability of data and analytical techniques to improve effectiveness and efficiency. The better integration of physical and digital infrastructures can significantly contribute to these objectives. The engineering tools and models used in the design, construction, and operation of a city infrastructure can now utilize a suite of technologies and processes to assist this integration. This is particularly necessary and challenging when the collaborative involvement of diverse parties is required and different vintages of infrastructure and technology must be combined. This paper is based on case studies of IBM and the construction company Laing O'Rourke. It provides examples showing how these \"innovation technologies'' improve opportunity and reduce risk in physical-digital integration and provides questions for further investigation.", "paper_title": "Physical-digital integration in city infrastructure", "paper_id": "WOS:000301498300002"}