{"auto_keywords": [{"score": 0.0475984214505119, "phrase": "financial_time_series"}, {"score": 0.00481495049065317, "phrase": "clustering_financial_time_series_by_network_community_analysis."}, {"score": 0.004456717971917794, "phrase": "community_analysis"}, {"score": 0.004046020290832207, "phrase": "n_nodes"}, {"score": 0.0038924989779389424, "phrase": "time_series"}, {"score": 0.0033830587647810132, "phrase": "symbolic_time_series_analysis"}, {"score": 0.003115908199991072, "phrase": "network_communities"}, {"score": 0.002897710777957041, "phrase": "strong_similarity"}, {"score": 0.002855934865505357, "phrase": "quantitative_assessment"}, {"score": 0.0027741761880779535, "phrase": "obtained_partition"}, {"score": 0.002579847272930948, "phrase": "italy_stock_exchange"}, {"score": 0.002241816883550397, "phrase": "standard_tools"}, {"score": 0.002135812692862058, "phrase": "minimal_spanning_tree"}, {"score": 0.0021049977753042253, "phrase": "hierarchical_tree"}], "paper_keywords": ["Time series", " clustering", " network", " communities"], "paper_abstract": "In this paper, we describe a method for clustering financial time series which is based on community analysis, a recently developed approach for partitioning the nodes of a network (graph). A network with N nodes is associated to the set of N time series. The weight of the link (i, j), which quantifies the similarity between the two corresponding time series, is defined according to a metric based on symbolic time series analysis, which has recently proved effective in the context of financial time series. Then, searching for network communities allows one to identify groups of nodes (and then time series) with strong similarity. A quantitative assessment of the significance of the obtained partition is also provided. The method is applied to two distinct case-studies concerning the US and Italy Stock Exchange, respectively. In the US case, the stability of the partitions over time is also thoroughly investigated. The results favorably compare with those obtained with the standard tools typically used for clustering financial time series, such as the minimal spanning tree and the hierarchical tree.", "paper_title": "CLUSTERING FINANCIAL TIME SERIES BY NETWORK COMMUNITY ANALYSIS", "paper_id": "WOS:000286612500004"}