{"auto_keywords": [{"score": 0.04936106948081192, "phrase": "immersed_boundary_method"}, {"score": 0.010612387000973441, "phrase": "navier-stokes_equations"}, {"score": 0.00645656865186589, "phrase": "unconditionally_stable_semi-implicit_scheme"}, {"score": 0.005020121382805127, "phrase": "explicit_scheme"}, {"score": 0.004555371402128666, "phrase": "fluid_structure_interaction"}, {"score": 0.004266501496765747, "phrase": "small_time_steps"}, {"score": 0.0040978781692373005, "phrase": "explicit_method"}, {"score": 0.003995876175614403, "phrase": "approximately_implicit_methods"}, {"score": 0.003799397093447221, "phrase": "severe_time_step_stability_constraint"}, {"score": 0.0036676174658755683, "phrase": "satisfactory_performance"}, {"score": 0.0035048567587934254, "phrase": "efficient_semi-implicit_scheme"}, {"score": 0.003073988343893906, "phrase": "semi-implicit_discretization"}, {"score": 0.002709589081384597, "phrase": "small_scale_decomposition"}, {"score": 0.0024247382451294255, "phrase": "spectral_space"}, {"score": 0.0023762535034673017, "phrase": "computational_cost"}, {"score": 0.0021049977753042253, "phrase": "substantial_computational_saving"}], "paper_keywords": ["Immersed boundary method", " Navier-Stokes equations", " Implicit discretization"], "paper_abstract": "The immersed boundary method is one of the most useful computational methods in studying fluid structure interaction. On the other hand, the Immersed Boundary method is also known to require small time steps to maintain stability when solved with an explicit method. Many implicit or approximately implicit methods have been proposed in the literature to remove this severe time step stability constraint, but none of them give satisfactory performance. In this paper, we propose an efficient semi-implicit scheme to remove this stiffness from the immersed boundary method for the Navier-Stokes equations. The construction of our semi-implicit scheme consists of two steps. First, we obtain a semi-implicit discretization which is proved to be unconditionally stable. This unconditionally stable semi-implicit scheme is still quite expensive to implement in practice. Next, we apply the small scale decomposition to the unconditionally stable semi-implicit scheme to construct our efficient semi-implicit scheme. Unlike other implicit or semi-implicit schemes proposed in the literature, our semi-implicit scheme can be solved explicitly in the spectral space. Thus the computational cost of our semi-implicit schemes is comparable to that of an explicit scheme. Our extensive numerical experiments show that our semiimplicit scheme has much better stability property than an explicit scheme. This offers a substantial computational saving in using the immersed boundary method. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "An efficient semi-implicit immersed boundary method for the Navier-Stokes equations", "paper_id": "WOS:000260267700014"}