{"auto_keywords": [{"score": 0.028783675170505365, "phrase": "cssa"}, {"score": 0.015719716506582538, "phrase": "seamless_handoffs"}, {"score": 0.014435512737341805, "phrase": "streaming_data"}, {"score": 0.014018394689872656, "phrase": "network_interface"}, {"score": 0.012104641429346521, "phrase": "streaming_service"}, {"score": 0.010173449533221308, "phrase": "network_interfaces"}, {"score": 0.008667179003371482, "phrase": "multimedia_applications"}, {"score": 0.008620836248193282, "phrase": "mobile_computing"}, {"score": 0.00828100787101664, "phrase": "multi-function_devices"}, {"score": 0.008236712787789122, "phrase": "heterogeneous_network_interfaces"}, {"score": 0.004674502700801182, "phrase": "mobile_computing_technology"}, {"score": 0.003629139879878691, "phrase": "old_network_interface"}, {"score": 0.003542195914738294, "phrase": "long_time"}, {"score": 0.003188801346213604, "phrase": "troubling_manual_operations"}, {"score": 0.0028397692520679913, "phrase": "proposed_client-side_session_splice_approach"}, {"score": 0.0026618065353009, "phrase": "network_domains"}, {"score": 0.002647488300841632, "phrase": "homogeneous_communication_media"}, {"score": 0.0025152389351747627, "phrase": "different_devices"}, {"score": 0.0021335895626854538, "phrase": "intact_applications"}, {"score": 0.0021221066364072766, "phrase": "network_infrastructures"}, {"score": 0.0021049977753042253, "phrase": "streaming_servers"}], "paper_keywords": ["CSSA", " Session splice", " Handoff", " Multimedia", " Mobile computing"], "paper_abstract": "Thanks to the invention of mobile computing technology, people nowadays can have various entertainment experiences with multi-function devices and heterogeneous network interfaces. When using multi-function devices with heterogeneous network interfaces to download and play streaming data, they maybe want to switch the communication from a network interface to another one in a device (i.e., the burn-terminal handoff), or to the network interface in another device (i.e., the inter-terminal handoff). In the handoffs, they have to manually reset or initiate the application, and then re-subscribe to the streaming service because the communication bound to the old network interface is lost. They are interrupted for a long time when watching the show. They have to remember the point or the scene played in the application before the handoff in order to re-subscribe to the streaming service after the handoff. They suffer from the troubling manual operations, especially when the handoff happens frequently to the network interfaces having limited communication ranges. When roaming through networks, accordingly, they need a way to download and play the streaming data without interruption due to handoffs. They can use the proposed Client-side Session Splice Approach (CSSA) to achieve seamless handoffs for multimedia applications in mobile computing. They can rely on the CSSA to automatically finish the handoff between network domains or homogeneous communication media in a network interface, the handoff between network interfaces in a device, and the handoff between network interfaces in different devices. For achieving seamless handoffs, they can count on the CSSA to automatically re-subscribe the streaming service on behalf of the application and smartly download the streaming data at the point or the scene played in the application just before the handoff happens. They don't need to worry about the compatibility of the CSSA because the CSSA keeps intact applications, network infrastructures, and streaming servers. They can understand the principle, the practicability, the functionality, and the overheads of the CSSA through this paper.", "paper_title": "Client-side session splice approach, a novel approach to achieving seamless handoffs for multimedia applications in mobile computing", "paper_id": "WOS:000282914100005"}