{"auto_keywords": [{"score": 0.050075505639749406, "phrase": "formal_semantics"}, {"score": 0.03314881474754886, "phrase": "csp"}, {"score": 0.004766683200410046, "phrase": "extended_hierarchical_state_transition_matrices"}, {"score": 0.004578382275810468, "phrase": "table-based_modelling_language"}, {"score": 0.004016072233242585, "phrase": "non-trivial_task"}, {"score": 0.0038573081851680656, "phrase": "model_checker"}, {"score": 0.003576286811853861, "phrase": "formal_justification"}, {"score": 0.0030895394261534776, "phrase": "sequential_processes"}, {"score": 0.0028642924503126154, "phrase": "modelling_language"}, {"score": 0.002821247621250663, "phrase": "pat_model_checker"}, {"score": 0.002524688179363081, "phrase": "small_examples"}, {"score": 0.002400373755068185, "phrase": "pat."}, {"score": 0.002105007179807656, "phrase": "pat"}], "paper_keywords": ["Embedded systems", " Software modelling", " Formal semantics", " Model checking", " CSP"], "paper_abstract": "The extended hierarchical state transition matrices (EHSTMs) are a table-based modelling language frequently used in industry for specifying behaviours of systems. However, assuring correctness, i.e., having a design satisfy certain desired properties, is a non-trivial task. To address this problem, a model checker dedicated to EHSTMs called Garakabu2 has been developed. However, there is no formal justification for Garakabu2, since its semantics has never been fully formalised. In this paper, we give a formal semantics to EHSTMs by translating them into CSP, Communicating Sequential Processes. Among the variants of CSP, we use CSP#, which is the modelling language used by PAT model checker, as a target of translation. Our semantics covers most of the features supported by Garakabu2. We manually translate the small examples of EHSTMs to CSP#, and verify them by PAT. We also verify the examples directly using Garakabu2 and show that the results are same. The experiments also indicate that verification using our translation and PAT is much faster than that of Garakabu2 in some cases.", "paper_title": "A formal semantics of extended hierarchical state transition matrices using CSP#", "paper_id": "WOS:000341369900005"}