{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ad_hoc_networks"}, {"score": 0.02297069737482301, "phrase": "multipath_routing"}, {"score": 0.010376226353118044, "phrase": "ad_hoc_network"}, {"score": 0.010069417199533026, "phrase": "mobile_nodes"}, {"score": 0.005925189988291643, "phrase": "original_message"}, {"score": 0.004654210559456924, "phrase": "self-organizing_network"}, {"score": 0.004348580182733617, "phrase": "arbitrary_topology"}, {"score": 0.0039869632444468036, "phrase": "different_fields"}, {"score": 0.003882970272082245, "phrase": "security_attacks"}, {"score": 0.0037532257703888315, "phrase": "main_challenges"}, {"score": 0.003440945901489461, "phrase": "intrusion_detection"}, {"score": 0.003313380246267812, "phrase": "hard_task"}, {"score": 0.0032884384364324395, "phrase": "ad_hoc_network_characteristics"}, {"score": 0.003154566400499823, "phrase": "efficient_solutions"}, {"score": 0.003026127736667187, "phrase": "flow_transmission_confidentiality"}, {"score": 0.0028485585670146025, "phrase": "multiple_paths"}, {"score": 0.0027532820796396713, "phrase": "confidentiality_robustness"}, {"score": 0.0027325449069867222, "phrase": "transmitted_data"}, {"score": 0.0025335509856200433, "phrase": "different_disjointed_existing_paths"}, {"score": 0.002253299769886694, "phrase": "existing_ad_hoc_multipath_security_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ad hoc networks", " Security", " Confidentiality", " Multipath routing"], "paper_abstract": "An ad hoc network is a self-organizing network of wireless links connecting mobile nodes. The mobile nodes can communicate without an infrastructure. They form an arbitrary topology, where the nodes play the role of routers and are free to move randomly. Ad hoc networks proved their efficiency being used in different fields but they are highly vulnerable to security attacks and dealing with this is one of the main challenges of these networks today. Recently, some solutions are proposed to provide authentication, confidentiality, availability, secure routing and intrusion detection in ad hoc networks. Implementing security in Such dynamically changing networks is a hard task. Ad hoc network characteristics should be taken into consideration to be able to design efficient solutions. In this study, we focus oil improving the flow transmission confidentiality in ad hoc networks based on multipath routing. Indeed, we take advantage of the existence of multiple paths between nodes in an ad hoc network to increase the confidentiality robustness of transmitted data. In Our approach the original message to secure is split into shares that are encrypted and combined then transmitted along different disjointed existing paths between sender and receiver. Even if an attacker succeeds to obtain one or more transmitted shares, the probability that the original message will be reconstituted is very low. We compare our approach with existing ad hoc multipath security solutions and present Performance evaluations of our protocol SDMP (Securing Data based Multipath Routing). (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Enhancing data security in ad hoc networks based on multipath routing", "paper_id": "WOS:000274312800011"}