{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "threshold_scheme"}, {"score": 0.0047448515702010734, "phrase": "general_source"}, {"score": 0.003959447096055027, "phrase": "paper_encrypts"}, {"score": 0.0034863899423238707, "phrase": "arbitrary_t_shares"}, {"score": 0.0030696773722514105, "phrase": "limit_inferiors"}, {"score": 0.002880333728285514, "phrase": "minimum_length"}, {"score": 0.002838319783373086, "phrase": "fair_random_bits"}, {"score": 0.002573424607574822, "phrase": "shamir's_threshold_scheme"}, {"score": 0.0024028135317872, "phrase": "shannon's_cipher_system"}, {"score": 0.0023677483882740317, "phrase": "perfect_secrecy"}, {"score": 0.002344655708000408, "phrase": "fixed-length_source_coding"}, {"score": 0.002321787726770895, "phrase": "vanishing_decoding_error_probability"}, {"score": 0.002157223877108711, "phrase": "converse_coding_theorems"}], "paper_keywords": ["fixed-length source coding", " information-spectrum methods", " secret sharing scheme", " Shannon's cipher system", " threshold scheme"], "paper_abstract": "In this paper, coding theorems on the (t, m)-threshold scheme for a general source are discussed, where m. means the number of the shares and t means a threshold. The (t, m)-threshold scheme treated in this paper encrypts n source outputs X-n to m. shares at once and is required to satisfy the two conditions that 1) X-n is reproduced from arbitrary t shares, and 2) almost no information of X-n is revealed from any t - 1 shares. It is shown that the (t, m)-threshold scheme must satisfy certain inequalities including the limit inferiors in probability. One of the inequalities is closely related to the minimum length of the fair random bits needed to a dealer for realizing the (t, m)-threshold scheme. In addition, it is shown that a certain variation of Shamir's threshold scheme meets the two conditions. The same approach can be taken to the problems of Shannon's cipher system with the perfect secrecy and fixed-length source coding with vanishing decoding error probability. It is shown that the same kind of inequalities, which indicate the converse coding theorems, hold in both two cases.", "paper_title": "Coding theorems on the threshold scheme for a general source", "paper_id": "WOS:000258033700020"}