{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "web_advertising"}, {"score": 0.004388450908826472, "phrase": "world's_most_important_marketing_channels"}, {"score": 0.004242868712089958, "phrase": "content-based_advertising"}, {"score": 0.0040334640350288, "phrase": "relevant_ads"}, {"score": 0.003982741546775355, "phrase": "generic_web_page"}, {"score": 0.003738502710504415, "phrase": "personal_opinion"}, {"score": 0.0033926758710459866, "phrase": "major_tenet"}, {"score": 0.0031710903727066313, "phrase": "web-site_owners"}, {"score": 0.002805597755796506, "phrase": "sentiment_detection"}, {"score": 0.002770273247998903, "phrase": "web-based_contextual_advertising"}, {"score": 0.002735392281320413, "phrase": "proposed_sentiment-oriented_contextual_advertising"}, {"score": 0.0026445028886931837, "phrase": "contextual_advertising_matching"}, {"score": 0.0026222551419772867, "phrase": "sentiment_analysis"}, {"score": 0.0022906498741695094, "phrase": "real_ads"}, {"score": 0.0022713722522505592, "phrase": "actual_blog_pages"}], "paper_keywords": ["Web advertising", " Sentiment detection", " Marketing", " Machine learning"], "paper_abstract": "Web advertising (Online advertising), a form of advertising that uses the World Wide Web to attract customers, has become one of the world's most important marketing channels. This paper addresses the mechanism of Content-based advertising (Contextual advertising), which refers to the assignment of relevant ads to a generic web page, e.g., a blog post. As blogs become a platform for expressing personal opinion, they naturally contain various kinds of expressions, including both facts and comments of both a positive and negative nature. Besides, in line with the major tenet of Web 2.0 (i.e., user-centric), we believe that the web-site owners would be willing to be in charge of the ads which are positively related to their contents. Hence, in this paper, we propose the utilization of sentiment detection to improve Web-based contextual advertising. The proposed sentiment-oriented contextual advertising (SOCA) framework aims to combine contextual advertising matching with sentiment analysis to select ads that are related to the positive (and neutral) aspects of a blog and rank them according to their relevance. We experimentally validate our approach using a set of data that includes both real ads and actual blog pages. The results indicate that our proposed method can effectively identify those ads that are positively correlated with the given blog pages.", "paper_title": "Sentiment-oriented contextual advertising", "paper_id": "WOS:000278525700003"}