{"auto_keywords": [{"score": 0.02767016440577914, "phrase": "consolidated_problem"}, {"score": 0.00481495049065317, "phrase": "route_distance_minimization"}, {"score": 0.004776484866276242, "phrase": "stack_rearrangement_considerations"}, {"score": 0.004681653551412616, "phrase": "optimization_problem"}, {"score": 0.0044795698035664695, "phrase": "internal_movement"}, {"score": 0.00440825801245188, "phrase": "maritime_ports"}, {"score": 0.004150761431291174, "phrase": "stacker_crane_problem"}, {"score": 0.003939777921760272, "phrase": "scp"}, {"score": 0.0035778632599436024, "phrase": "cargo_containers"}, {"score": 0.0034647524666821614, "phrase": "multiple_separate_columns"}, {"score": 0.003121183062764093, "phrase": "required_container"}, {"score": 0.003083793024782014, "phrase": "substantial_re-stacking"}, {"score": 0.003010347277067459, "phrase": "considerable_effort"}, {"score": 0.0029862549873935496, "phrase": "container_stack_rearrangement_operations"}, {"score": 0.0025736694380861604, "phrase": "standard_route_distance_minimization_situations"}, {"score": 0.002384422461262006, "phrase": "suitable_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Combinatorial optimization", " Crane scheduling", " Container stacking", " Mixed integer program", " Stacker crane problem"], "paper_abstract": "We consider an optimization problem of sequencing the operations of cranes that are used for internal movement of containers in maritime ports. Some features of this problem have been studied in the literature as the stacker crane problem (SCP). However, the scope of most literature (including SCP) is restricted to minimizing the route or distance traveled by cranes and the resulting movement-related costs. In practice, cargo containers are generally stacked or piled up in multiple separate columns, heaps or stacks at ports. So, the cranes need to often rearrange or shuffle such container stacks, in order to pick up any required container. If substantial re-stacking is involved, cranes expend considerable effort in container stack rearrangement operations. The problem of minimizing the total efforts/time of the crane must therefore account for both - the stack rearrangement costs and also the movement-related (route distance) costs. The consolidated problem differs from standard route distance minimization situations if stack rearrangement activities are considered. We formally define the consolidated problem, identify its characteristic features and hence devise suitable models for it. We formulate several alternative MIP approaches to solve the problem. We compare the performance of our MIP formulations and analyze their suitability for various possible situations. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Approaches for solving the container stacking problem with route distance minimization and stack rearrangement considerations", "paper_id": "WOS:000343952100006"}