{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "book_reviews"}, {"score": 0.004761132425263795, "phrase": "user_tendency"}, {"score": 0.004707913053935566, "phrase": "collective_intelligence"}, {"score": 0.004450568197899267, "phrase": "important_documents"}, {"score": 0.0038668462001710314, "phrase": "reviewrank"}, {"score": 0.0033974527047473044, "phrase": "increasing_number"}, {"score": 0.003087419032091453, "phrase": "ranking_techniques"}, {"score": 0.0026971491199975083, "phrase": "ranking_book_reviews"}, {"score": 0.002607527117561699, "phrase": "general_purposes"}, {"score": 0.002450864311898833, "phrase": "meaningful_book_reviews"}, {"score": 0.0024097920845706795, "phrase": "voluntary_evaluation"}, {"score": 0.0021896891011033105, "phrase": "ranking_reviews"}, {"score": 0.0021651504858015364, "phrase": "experimental_results"}], "paper_keywords": ["Book review", " Information retrieval", " Ranking technique", " Collective intelligent"], "paper_abstract": "IR (Information Retrieval) systems search for important documents on the internet by measuring the importance of them. For this purpose, various ranking techniques were proposed. In this paper, we propose ReviewRank and ReviewRank(+), which are ranking techniques for estimating usefulness of book reviews based on the tendency of users. With an increasing number of people buying books online, reviews written by other people have become more significant. General ranking techniques measure the importance of documents based on references or quotations between them through hyperlinks. However, the techniques are not suitable for ranking book reviews since they were developed for general purposes. In this paper, we analyze the characteristics of meaningful book reviews based on voluntary evaluation of people and propose measures for considering the importance. We also suggest an algorithm for ranking reviews. Experimental results show that our approaches outperform both previous general and specific (searching book reviews) ranking techniques.", "paper_title": "Ranking algorithm for book reviews with user tendency and collective intelligence", "paper_id": "WOS:000359864700006"}