{"auto_keywords": [{"score": 0.048946135650417714, "phrase": "distance_judgments"}, {"score": 0.03130891940123783, "phrase": "hmd"}, {"score": 0.015230942954353989, "phrase": "virtual_environments"}, {"score": 0.009099305722460128, "phrase": "mock_hmd"}, {"score": 0.00481495049065317, "phrase": "head-mounted_display_mechanical_properties"}, {"score": 0.004203803478570494, "phrase": "head-mounted_display"}, {"score": 0.003959353513286997, "phrase": "virtual_space"}, {"score": 0.0038195342195623764, "phrase": "surprising_result"}, {"score": 0.003714195746979591, "phrase": "real_environments"}, {"score": 0.0036262124965265015, "phrase": "virtual_setting"}, {"score": 0.003512123587588346, "phrase": "available_visual_cues"}, {"score": 0.003456427643307907, "phrase": "person's_ability"}, {"score": 0.0032814236411444022, "phrase": "added_mass"}, {"score": 0.002981216610222911, "phrase": "normal_real-world"}, {"score": 0.0028643622911111942, "phrase": "real-world_viewing"}, {"score": 0.0021561514733516676, "phrase": "statistically_significant_underestimation"}], "paper_keywords": ["Human factors", " Perception", " distance judgments", " head-mounted displays"], "paper_abstract": "Research has shown that people are able to judge distances accurately in full-cue, real-world environments using visually directed actions. However, in virtual environments viewed with head-mounted display (HMD) systems, there is evidence that people act as though the virtual space is smaller than intended. This is a surprising result given how well people act in real environments. The behavior in the virtual setting may be linked to distortions in the available visual cues or to a person's ability to locomote without vision. Either could result from issues related to added mass, moments of inertia, and restricted field of view in HMDs. This article describes an experiment in which distance judgments based on normal real-world and HMD viewing are compared with judgments based on real-world viewing while wearing two specialized devices. One is a mock HMD, which replicated the mass, moments of inertia, and field of view of the HMD and the other an inertial headband designed to replicate the mass and moments of inertia of the HMD, but constructed to not restrict the field of view of the observer or otherwise feel like wearing a helmet. Distance judgments using the mock HMD showed a statistically significant underestimation relative to the no restriction condition but not of a magnitude sufficient to account for all the distance compression seen in the HMD. Indicated distances with the inertial headband were not significantly smaller than those made with no restrictions.", "paper_title": "The Effects of Head-Mounted Display Mechanical Properties and Field of View on Distance Judgments in Virtual Environments", "paper_id": "WOS:000266438000002"}