{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "temporal_data"}, {"score": 0.004774115617883476, "phrase": "business_intelligence_solutions"}, {"score": 0.004653667500876187, "phrase": "multi-dimensional_data"}, {"score": 0.004421770937919324, "phrase": "non-traditional_data"}, {"score": 0.004328576620172571, "phrase": "multi-dimensional_aggregation"}, {"score": 0.004219321533320583, "phrase": "associated_interval_values"}, {"score": 0.004060566667226606, "phrase": "temporal_databases"}, {"score": 0.0036037265181631324, "phrase": "current_database_state"}, {"score": 0.003512702405367876, "phrase": "new_aggregation_operator"}, {"score": 0.003423969509052361, "phrase": "interval_data"}, {"score": 0.0030908254851076005, "phrase": "actual_data"}, {"score": 0.0029998918671747168, "phrase": "result_groups"}, {"score": 0.002475755804232436, "phrase": "entire_interval"}, {"score": 0.0022828795331819025, "phrase": "new_operator"}, {"score": 0.0022442249871042026, "phrase": "empirical_study"}, {"score": 0.0021688641066186817, "phrase": "large_data_sets"}], "paper_keywords": [""], "paper_abstract": "Business Intelligence solutions, encompassing technologies such as multi-dimensional data modeling and aggregate query processing, are being applied increasingly to non-traditional data. This paper extends multi-dimensional aggregation to apply to data with associated interval values that capture when the data hold. In temporal databases, intervals typically capture the states of reality that the data apply to, or capture when the data are, or were, part of the current database state. This paper proposes a new aggregation operator that addresses several challenges posed by interval data. First, the intervals to be associated with the result tuples may not be known in advance, but depend on the actual data. Such unknown intervals are accommodated by allowing result groups that are specified only partially. Second, the operator contends with the case where an interval associated with data expresses that the data holds for each point in the interval, as well as the case where the data holds only for the entire interval, but must be adjusted to apply to sub-intervals. The paper reports on an implementation of the new operator and on an empirical study that indicates that the operator scales to large data sets and is competitive with respect to other temporal aggregation algorithms.", "paper_title": "Multi-dimensional aggregation for temporal data", "paper_id": "WOS:000237081600018"}