{"auto_keywords": [{"score": 0.036017577736660165, "phrase": "amas"}, {"score": 0.03395415609626196, "phrase": "almas"}, {"score": 0.007377860675515238, "phrase": "target_image"}, {"score": 0.005713339871372108, "phrase": "mas"}, {"score": 0.00481495049065317, "phrase": "atlas-based_segmentation"}, {"score": 0.0047689174754929195, "phrase": "powerful_generic_technique"}, {"score": 0.004738472391439408, "phrase": "automatic_delineation"}, {"score": 0.0046781613377273774, "phrase": "volumetric_images"}, {"score": 0.004589124394375718, "phrase": "multi-atlas_segmentation_methods"}, {"score": 0.004458722048888919, "phrase": "multiple_registrations"}, {"score": 0.004430248457624686, "phrase": "volumetric_data"}, {"score": 0.004208881856146758, "phrase": "large_number"}, {"score": 0.004089239912167375, "phrase": "good_segmentation_performance"}, {"score": 0.0037864980290391354, "phrase": "particular_target_scan"}, {"score": 0.003750260412839128, "phrase": "segmentation_process"}, {"score": 0.002958021635132416, "phrase": "computationally_cheap_atlas_selection_strategy"}, {"score": 0.0029296894027177225, "phrase": "automatic_stopping_criterion"}, {"score": 0.0028554526481670926, "phrase": "registration_results"}, {"score": 0.0026693851900137953, "phrase": "computed_tomography_scans"}, {"score": 0.002601727192945944, "phrase": "conventional_multi-atlas_method"}, {"score": 0.002432152706473349, "phrase": "available_segmentation_time"}, {"score": 0.0023402515909042515, "phrase": "mas."}, {"score": 0.002273605493468005, "phrase": "online_segmentation_challenge"}, {"score": 0.0022374020089160084, "phrase": "caudate_nucleus"}, {"score": 0.0022230821865616254, "phrase": "brain_mri_scans"}, {"score": 0.0021876814398268775, "phrase": "best_score"}, {"score": 0.0021050011192083923, "phrase": "elsevier"}], "paper_keywords": ["Segmentation", " Multi-atlas", " Atlas selection", " Local", " Stopping criterion"], "paper_abstract": "Atlas-based segmentation is a powerful generic technique for automatic delineation of structures in volumetric images. Several studies have shown that multi-atlas segmentation methods outperform schemes that use only a single atlas, but running multiple registrations on volumetric data is time-consuming. Moreover, for many scans or regions within scans, a large number of atlases may not be required to achieve good segmentation performance and may even deteriorate the results. It would therefore be worthwhile to include the decision which and how many atlases to use for a particular target scan in the segmentation process. To this end, we propose two generally applicable multi-atlas segmentation methods, adaptive multi-atlas segmentation (AMAS) and adaptive local multi-atlas segmentation (ALMAS). AMAS automatically selects the most appropriate atlases for a target image and automatically stops registering atlases when no further improvement is expected. ALMAS takes this concept one step further by locally deciding how many and which atlases are needed to segment a target image. The methods employ a computationally cheap atlas selection strategy, an automatic stopping criterion, and a technique to locally inspect registration results and determine how much improvement can be expected from further registrations. AMAS and ALMAS were applied to segmentation of the heart in computed tomography scans of the chest and compared to a conventional multi-atlas method (MAS). The results show that ALMAS achieves the same performance as MAS at a much lower computational cost. When the available segmentation time is fixed, both AMAS and ALMAS perform significantly better than MAS. In addition, AMAS was applied to an online segmentation challenge for delineation of the caudate nucleus in brain MRI scans where it achieved the best score of all results submitted to date. (C) 2009 Elsevier B. V. All rights reserved.", "paper_title": "Adaptive local multi-atlas segmentation: Application to the heart and the caudate nucleus", "paper_id": "WOS:000272460400005"}