{"auto_keywords": [{"score": 0.037579896116192446, "phrase": "rtrps"}, {"score": 0.009229112466869532, "phrase": "intersection_tests"}, {"score": 0.008713768692145013, "phrase": "bounding_spheres"}, {"score": 0.008556436508157416, "phrase": "ray_tracing"}, {"score": 0.004785682967399109, "phrase": "frustum_rays"}, {"score": 0.004756592495553215, "phrase": "dynamic_scene_rendering"}, {"score": 0.004613758998479213, "phrase": "photo-realistic_images"}, {"score": 0.004599712603988837, "phrase": "extensive_research_and_development_work"}, {"score": 0.004557828309570373, "phrase": "interactive_static_scene"}, {"score": 0.004447983733147892, "phrase": "dynamic_scene"}, {"score": 0.0042490799524136594, "phrase": "scene_change"}, {"score": 0.0039854083031404764, "phrase": "ray_plane"}, {"score": 0.0039611630554706205, "phrase": "bounding_sphere"}, {"score": 0.0037609217735040715, "phrase": "introduced_rtrps"}, {"score": 0.0036926830072270076, "phrase": "spatial_data_structure"}, {"score": 0.0034109556126786693, "phrase": "update_time"}, {"score": 0.003218721776850253, "phrase": "secondary_rays"}, {"score": 0.003199125688913676, "phrase": "shadow_rays"}, {"score": 0.0031506541919795444, "phrase": "aligned_grid"}, {"score": 0.0031029148239426485, "phrase": "ray-planes_shares"}, {"score": 0.002963980409835403, "phrase": "coherency_m"}, {"score": 0.0026797729790020235, "phrase": "parallel_projection_technique"}, {"score": 0.0025833067045287874, "phrase": "floating_point_operations_techniques"}, {"score": 0.0025286424059485745, "phrase": "structured_ray-planes"}, {"score": 0.0023355154605700095, "phrase": "lame_number"}, {"score": 0.0022037570028628295, "phrase": "ray_tracing_algorithm"}, {"score": 0.002190326602897302, "phrase": "organized_rays"}, {"score": 0.0021243898166922177, "phrase": "competitive_performance"}], "paper_keywords": ["computer graphics", " ray tracing", " intersection test", " bounding volume", " bounding sphere"], "paper_abstract": "Ray tracing is one of the most popular techniques for generating photo-realistic images Extensive research and development work has made interactive static scene rendering realistic This paper deals with in dynamic scene rendering in which not only the eye point but also the objects in the scene change then 3D locations every frame In order to realize interactive dynamic scene rendering R-nos (Ray Tracing based on Ray Plane and Bounding Sphere) which utilizes the coherency in rays. objects, and grouped-rays. is Introduced RTRPS uses bounding spheres as the spatial data structure which utilizes the coherency in objects By using bounding spheres, RTRPS can ignore the rotation of moving objects within a sphere, and shorten the update time between frames RTRPS utilizes the coherency in rays by merging rays into a ray-plane, assuming that the secondary rays and shadow rays are shot through an aligned grid Since a pair of ray-planes shares an original ray. the intersection for the ray can be completed using the coherency m the ray-planes Because of die three kinds of coherency, RTRPS can significantly reduce the number of intersection tests for ray tracing Further acceleration techniques for I ay-plane-sphere and ray-triangle intersection are also presented A parallel projection technique converts a 3D vector inner product operation into a 2D operation and reduces the number of floating point operations Techniques based on frustum culling and binary-tree structured ray-planes optimize the order of intersection tests between ray-planes and a sphere. resulting in 50% to 90% reduction of intersection tests Two ray-triangle intersection techniques are also introduced which are effective when a lame number of rays are packed into a ray-plane Our performance evaluations indicate that RTRPS gives 13 to 392 times speed up in comparison with a ray tracing algorithm without organized rays and spheres We found out that RTRPS also provides competitive performance even if only primary rays are used.", "paper_title": "A Fast Ray-Tracing Using Bounding Spheres and Frustum Rays for Dynamic Scene Rendering", "paper_id": "WOS:000276848600021"}