{"auto_keywords": [{"score": 0.04781321684995814, "phrase": "view-dependent_filtering"}, {"score": 0.01987624885828621, "phrase": "isosurface_extraction"}, {"score": 0.010752002702955784, "phrase": "active_cells"}, {"score": 0.0059813802341250714, "phrase": "time_domain"}, {"score": 0.00538595068299195, "phrase": "time-domain_slicing"}, {"score": 0.004789105805595663, "phrase": "view-dependent"}, {"score": 0.004750597411562959, "phrase": "time-varying_fields_using_persistent"}, {"score": 0.004636911517556731, "phrase": "new_algorithm"}, {"score": 0.004562629470601531, "phrase": "large_time-varying_fields"}, {"score": 0.004219965759535414, "phrase": "interval_tree"}, {"score": 0.0041860144759658015, "phrase": "optimal_searches"}, {"score": 0.004107848907565576, "phrase": "branch-on-need_octree"}, {"score": 0.0040857848010163655, "phrase": "bono"}, {"score": 0.003658591144369006, "phrase": "queried_time_step"}, {"score": 0.0032060416280655906, "phrase": "pot"}, {"score": 0.003112373698668253, "phrase": "output-sensitive_and_optimal_searching"}, {"score": 0.003013303396020895, "phrase": "consecutive_time_steps"}, {"score": 0.0029729578703205453, "phrase": "additional_searching_overhead"}, {"score": 0.002925253564017998, "phrase": "additional_active_cells"}, {"score": 0.002786671812199566, "phrase": "asymptotically_optimal_space"}, {"score": 0.00271253125510496, "phrase": "ptot"}, {"score": 0.0025840009505256373, "phrase": "core_scheme"}, {"score": 0.0025356736545188562, "phrase": "implicit_occluders"}, {"score": 0.0024882572796372116, "phrase": "cuda"}, {"score": 0.002325987522172038, "phrase": "gpu."}, {"score": 0.0022948155206355134, "phrase": "efficient_algorithm"}, {"score": 0.0022518845063179763, "phrase": "state-of-the-art_programmable_gpu"}, {"score": 0.0022038008840831783, "phrase": "main_memory"}, {"score": 0.0021278403701021674, "phrase": "time_step"}], "paper_keywords": ["Isosurface extraction", " time-varying fields", " persistent data structure", " view-dependent filtering", " out-of-core methods"], "paper_abstract": "We develop a new algorithm for isosurface extraction and view-dependent filtering from large time-varying fields, by using a novel Persistent Time-Octree (PTOT) indexing structure. Previously, the Persistent Octree (POT) was proposed to perform isosurface extraction and view-dependent filtering, which combines the advantages of the interval tree (for optimal searches of active cells) and of the Branch-On-Need Octree (BONO, for view-dependent filtering), but it only works for steady-state (i.e., single time step) data. For time-varying fields, a 4D version of POT, 4D-POT, was proposed for 4D isocontour slicing, where slicing on the time domain gives all active cells in the queried time step and isovalue. However, such slicing is not output sensitive and thus the searching is sub-optimal. Moreover, it was not known how to support view-dependent filtering in addition to time-domain slicing. In this paper, we develop a novel Persistent Time-Octree (PTOT) indexing structure, which has the advantages of POT and performs 4D isocontour slicing on the time domain with an output-sensitive and optimal searching. In addition, when we query the same isovalue q over m consecutive time steps, there is no additional searching overhead (except for reporting the additional active cells) compared to querying just the first time step. Such searching performance for finding active cells is asymptotically optimal, with asymptotically optimal space and preprocessing time as well. Moreover, our PTOT supports view-dependent filtering in addition to time-domain slicing. We propose a simple and effective out-of-core scheme, where we integrate our PTOT with implicit occluders, batched occlusion queries and batched CUDA computing tasks, so that we can greatly reduce the I/O cost as well as increase the amount of data being concurrently computed in GPU. This results in an efficient algorithm for isosurface extraction with view-dependent filtering utilizing a state-of-the-art programmable GPU for time-varying fields larger than main memory. Our experiments on datasets as large as 192GB (with 4GB per time step) having no more than 870MB of memory footprint in both preprocessing and run-time phases demonstrate the efficacy of our new technique.", "paper_title": "Isosurface Extraction and View-Dependent Filtering from Time-Varying Fields Using Persistent Time-Octree (PTOT)", "paper_id": "WOS:000270778900066"}