{"auto_keywords": [{"score": 0.04286666008487537, "phrase": "project_success"}, {"score": 0.013918415137729422, "phrase": "goal_conflict"}, {"score": 0.01293696589560445, "phrase": "privately_held_information"}, {"score": 0.008420017382743583, "phrase": "information_systems_project_success"}, {"score": 0.0077849476589884935, "phrase": "systems_developers"}, {"score": 0.00481495049065317, "phrase": "agency_theory_explanation"}, {"score": 0.004767826806287385, "phrase": "project_success._agency_theory"}, {"score": 0.004698000536608171, "phrase": "possible_explanation"}, {"score": 0.004450568197899267, "phrase": "greater_outcome-basis"}, {"score": 0.004342430078306461, "phrase": "project_manager"}, {"score": 0.003601715012418258, "phrase": "web-based_survey"}, {"score": 0.0032800186243040663, "phrase": "structural_equation_modeling"}, {"score": 0.0027741761880779535, "phrase": "analogous_relationships"}, {"score": 0.0025892330566358503, "phrase": "contract_type"}, {"score": 0.002357755095722877, "phrase": "multi-dimensional_constructs"}, {"score": 0.0021049977753042253, "phrase": "project_outcome"}], "paper_keywords": ["agency theory", " information systems project management", " contract type", " goal conflict", " monitoring", " privately held information", " project success"], "paper_abstract": "Agency theory provides a possible explanation for information systems project success and failure. The theory suggests that a greater outcome-basis of the contract between project manager and systems developers reduces goal conflict which in turn increases the likelihood of project success, and that project monitoring reduces privately held information which in turn increases the likelihood of that success. To investigate information systems project success, this study uses a web-based survey to collect data from 428 project managers and 65 other team participants. The data are analyzed for reliability and validity, and structural equation modeling is used to test hypotheses related to project success. Results show that monitoring predicts privately held information which in turn predicts project success, and that monitoring also directly predicts project success. The testing finds no analogous relationships between project success and outcome-basis or goal conflict. The study contributes by showing that contract type (i.e., more versus less outcome-based), monitoring, goal conflict, and privately held information are multi-dimensional constructs and provides instruments for their measurement. Perhaps surprisingly, it suggests that the monitoring of systems developers may be a more effective way to improve project outcome than promising to reward them for that outcome.", "paper_title": "AN AGENCY THEORY EXPLANATION OF PROJECT SUCCESS", "paper_id": "WOS:000294037500011"}