{"auto_keywords": [{"score": 0.04897433177446674, "phrase": "nwis"}, {"score": 0.04021006324458644, "phrase": "epa"}, {"score": 0.00481495049065317, "phrase": "hydrologic_data"}, {"score": 0.004385733482617193, "phrase": "unified_and_improved_data_access_system"}, {"score": 0.004324723240308028, "phrase": "nation's_vast_hydrologic_data_holdings"}, {"score": 0.0040890178236849825, "phrase": "human_impact"}, {"score": 0.004032118497047498, "phrase": "nation's_water_cycle"}, {"score": 0.003994624397219346, "phrase": "large_mission_oriented_data_repositories"}, {"score": 0.003920674807745575, "phrase": "usgs'_national_water_information_system"}, {"score": 0.00379452936798156, "phrase": "storage_and_retrieval_system"}, {"score": 0.003672427620845944, "phrase": "crucial_role"}, {"score": 0.003604421041893448, "phrase": "substantial_amount"}, {"score": 0.0035542408902458677, "phrase": "nationwide_coverage"}, {"score": 0.0031919592786945126, "phrase": "geographic_distribution"}, {"score": 0.0030747771905143273, "phrase": "mission_statements"}, {"score": 0.003003726508522467, "phrase": "different_foci"}, {"score": 0.0021750990136123367, "phrase": "available_data_content"}, {"score": 0.0021447748132703078, "phrase": "national_water_metadata_catalogue"}], "paper_keywords": ["Databases", " Data Coverage", " NWIS", " STORET", " WaterOneFlow", " Web-services"], "paper_abstract": "The need for a unified and improved data access system for the nation's vast hydrologic data holdings has increased over the past few years as researchers strive for better understanding the human impact on the nation's water cycle. Large mission oriented data repositories such as the USGS' National Water Information System (NWIS) and EPA's Storage and Retrieval System (EPA STORET) play a crucial role in providing a substantial amount of the nationwide coverage, however they do differ regionally in terms of coverage (parameters) and geospatial data density. Besides the differences in geographic distribution, repositories tend to undergo changes in mission statements and as such have different foci in their data collection activities that change as time progresses. This paper places the two water information systems next to each in an attempt to work out the differences in terms of coverage and content and how they complement each other when overlaid. This is done through the use of a number the CUAHSI Hydrologic Information Systems components, namely a web-service suite called WaterOneFlow that permits interrogation of the available data content of a national water metadata catalogue into which these two information systems have been integrated.", "paper_title": "Availability and coverage of hydrologic data in the US geological survey National Water Information System (NWIS) and US Environmental Protection Agency Storage and Retrieval System (STORET)", "paper_id": "WOS:000207785500002"}