{"auto_keywords": [{"score": 0.03767407563899196, "phrase": "sbse"}, {"score": 0.008624034027897723, "phrase": "search_based_software_engineering"}, {"score": 0.005876552989235355, "phrase": "cloud_computing"}, {"score": 0.005269528470620183, "phrase": "cloud_computing_challenges"}, {"score": 0.00481495049065317, "phrase": "cloud_engineering"}, {"score": 0.004034962424068988, "phrase": "cloud_software_engineering"}, {"score": 0.0036553070575015344, "phrase": "pragmatic_trade-offs"}, {"score": 0.0034519997658752598, "phrase": "computational_search"}, {"score": 0.0033633514001658086, "phrase": "precisely_these_kinds"}, {"score": 0.0033285306462537884, "phrase": "software_engineering_challenges"}], "paper_keywords": ["Search Based Software Engineering (SBSE)", " Cloud computing"], "paper_abstract": "Many of the problems posed by the migration of computation to cloud platforms can be formulated and solved using techniques associated with Search Based Software Engineering (SBSE). Much of cloud software engineering involves problems of optimisation: performance, allocation, assignment and the dynamic balancing of resources to achieve pragmatic trade-offs between many competing technical and business objectives. SBSE is concerned with the application of computational search and optimisation to solve precisely these kinds of software engineering challenges. Interest in both cloud computing and SBSE has grown rapidly in the past five years, yet there has been little work on SBSE as a means of addressing cloud computing challenges. Like many computationally demanding activities, SBSE has the potential to benefit from the cloud; 'SBSE in the cloud'. However, this paper focuses, instead, of the ways in which SBSE can benefit cloud computing. It thus develops the theme of 'SBSE for the cloud', formulating cloud computing challenges in ways that can be addressed using SBSE. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Cloud engineering is Search Based Software Engineering too", "paper_id": "WOS:000323870300002"}