{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "state-of-the-art_noise_reduction_schemes"}, {"score": 0.0046046429665581555, "phrase": "overall_image_quality"}, {"score": 0.004330321475256457, "phrase": "psycho-visual_experiment"}, {"score": 0.004027031316965272, "phrase": "denoised_images"}, {"score": 0.003960101604693806, "phrase": "perceptual_space"}, {"score": 0.0036826452656927877, "phrase": "quality_preference"}, {"score": 0.003561205990687285, "phrase": "scaled_perceptual_attributes"}, {"score": 0.0033864888703414903, "phrase": "two-dimensional_perceptual_space"}, {"score": 0.003311604528903634, "phrase": "processed_images"}, {"score": 0.003149094460617212, "phrase": "perceptual_spaces"}, {"score": 0.002784540221128404, "phrase": "perceived_overall_image_quality"}, {"score": 0.002677616534005393, "phrase": "impairment_vector"}, {"score": 0.0025461386232786356, "phrase": "quality_vector"}, {"score": 0.002475898613632249, "phrase": "attribute_vectors"}, {"score": 0.0022261705957258506, "phrase": "follow-up_experiment"}], "paper_keywords": [""], "paper_abstract": "In this paper we compare the overall image quality of 7 state-of-the-art denoising schemes, based on human visual perception. A psycho-visual experiment was set up in which 37 subjects were asked to score and compare denoised images. A perceptual space is constructed from this experiment through multidimensional scaling (MDS) techniques using the perceived dissimilarity and quality preference between the images and the scaled perceptual attributes bluriness and artefacts. We found that a two-dimensional perceptual space adequately represents the processed images used in the experiment, and that the perceptual spaces obtained for all scenes are very similar. The interpretation of this space leads to a ranking of the filters in perceived overall image quality. We can show that the impairment vector, whose direction is opposite to that of the quality vector, lies between the attribute vectors for bluriness and artefacts, which on their account form an angle of about 35 degrees meaning they do interact. A follow-up experiment allowed us to determine even further why subjects preferred one filter over the other.", "paper_title": "Perceived image quality measurement of state-of-the-art noise reduction schemes", "paper_id": "WOS:000241489100011"}