{"auto_keywords": [{"score": 0.04913387376964174, "phrase": "molecular_docking"}, {"score": 0.04729503869075945, "phrase": "ahas"}, {"score": 0.00481495049065317, "phrase": "bioactive_conformation_analysis"}, {"score": 0.004760394308239882, "phrase": "acetohydroxyacid_synthase_inhibitors"}, {"score": 0.004561232179195321, "phrase": "acetohydroxyacid_synthase"}, {"score": 0.004509709915324858, "phrase": "ec"}, {"score": 0.004420472010542188, "phrase": "first_common_step"}, {"score": 0.0043953478557600565, "phrase": "branched-chain_amino_acid_biosynthesis"}, {"score": 0.004187452827599427, "phrase": "one's_phenyl"}, {"score": 0.004035107125458193, "phrase": "other's_phenyl"}, {"score": 0.0037148610338776887, "phrase": "best_result"}, {"score": 0.0034889212590758865, "phrase": "comparative_molecular_field_analysis"}, {"score": 0.0034395119150793787, "phrase": "comparative_molecular_similarity_indices_analysis"}, {"score": 0.003371508176308189, "phrase": "functional_theory_calculation"}, {"score": 0.0032027318619522916, "phrase": "comfa"}, {"score": 0.0030597928729005704, "phrase": "bioactive_conformation"}, {"score": 0.0028087048250773766, "phrase": "h_bonds"}, {"score": 0.002706383680762465, "phrase": "phenyl_groups"}, {"score": 0.0026452734009203764, "phrase": "binding_pocket"}, {"score": 0.0025343769150179764, "phrase": "different_sensitivity"}, {"score": 0.002326304140277375, "phrase": "excellent_correlation"}, {"score": 0.0023064582783867645, "phrase": "tested_k-i_values"}, {"score": 0.0022933216359142736, "phrase": "wildtype_a._thaliana_acetohydroxyacid_synthase"}, {"score": 0.002254357921422124, "phrase": "high_reliability"}, {"score": 0.002184631929806752, "phrase": "first_report"}, {"score": 0.0021659920594094407, "phrase": "binding_mode"}, {"score": 0.002153653728048424, "phrase": "herbicidal_pyrimidinylthiobenzoates"}, {"score": 0.0021170579470073305, "phrase": "reported_results"}, {"score": 0.0021049977753042253, "phrase": "herbicide_resistance"}], "paper_keywords": [""], "paper_abstract": "Pyrimidinylthiobenzoates constitute an important kind of herbicides targeting acetohydroxyacid synthase (AHAS, EC 2.2.1.6), which catalyze the first common step in branched-chain amino acid biosynthesis. Due to the symmetry of 4,6-dimethoxypyrimidyl, there are two kinds of conformation of pyrimidinylthiobenzoates: one's phenyl is left-extending (named conformation-L); the other's phenyl is right-extending (named conformation-R). On the basis of the assumption that 3D quantitative structure - activity relationship (QSAR) models derived from the bioactive conformation should give the best result, a strategy of density-functional-theory-based 3D-QSAR was proposed to identify the bioactive conformation of pyrimidinylthiobenzoates by integrating the techniques of molecular docking, comparative molecular field analysis (CoMFA), comparative molecular similarity indices analysis (CoMSIA), and density functional theory calculation. The combination of three criteria of q(2), r(2), and r(pred)(2) obtained from CoMFA and CoMSIA analyses clearly indicated that conformation-R rather than conformation-L might be the bioactive conformation for pyrimidinylthiobenzoates. A further comparison between the two binding modes indicated that pyrimidinylthiobenzoates and sulfonylureas have very similar binding sites, such as Trp586, Arg380, and Pro192. However, Lys251 formed H bonds with sulfonylureas rather than pyrimidinylthiobenzoates. In addition, the orientation of phenyl groups of the two classes of compounds in the binding pocket were revealed to be opposite, which explained why the mutation of Pro192 displayed different sensitivity to sulfonylureas and pyrimidinylthiobenzoates. On the basis of the understanding of interactions between pyrimidinyl-thiobenzoates and AHAS, we designed and synthesized six 8-(4,6-dimethoxypyrimidin-2-yloxy)-4-methylphthalazin-1-one derivatives according to the 3D-QSAR models. The excellent correlation between the tested K-i values against wildtype A. thaliana acetohydroxyacid synthase and the predicted IC50 values demonstrated the high reliability of the established 3D-QSAR models. To our knowledge, this is the first report highlighting the binding mode of herbicidal pyrimidinylthiobenzoates, which consisted of the reported results of herbicide resistance.", "paper_title": "Rational design based on bioactive conformation analysis of pyrimidinylbenzoates as acetohydroxyacid synthase inhibitors by integrating molecular docking, CoMFA, CoMSIA, and DFT calculations", "paper_id": "WOS:000251216500032"}