{"auto_keywords": [{"score": 0.043743228649701246, "phrase": "genre_theory"}, {"score": 0.03097848383348216, "phrase": "web_genres"}, {"score": 0.00481495049065317, "phrase": "bookmarked_webpages"}, {"score": 0.004078502325220629, "phrase": "different_pages"}, {"score": 0.0038679618585498597, "phrase": "salient_non-topical_features"}, {"score": 0.003800215925586887, "phrase": "search_interfaces"}, {"score": 0.0035408501923902477, "phrase": "bookmark_links"}, {"score": 0.0032991276152705934, "phrase": "interview_results"}, {"score": 0.0032527939106509946, "phrase": "previous_literature"}, {"score": 0.0030199761431186434, "phrase": "content_pages"}, {"score": 0.0028944757265206332, "phrase": "clear_tendency"}, {"score": 0.002863921785266393, "phrase": "main_pages"}, {"score": 0.002744888626958772, "phrase": "bookmarked_web_links"}, {"score": 0.0024947959375982614, "phrase": "main_web_activity"}, {"score": 0.0023408288327263294, "phrase": "information_reuse"}, {"score": 0.002275477757478827, "phrase": "implicit_relevance_feedback"}, {"score": 0.0021049977753042253, "phrase": "users'_intentions"}], "paper_keywords": ["Worldwide web", " Information retrieval"], "paper_abstract": "Purpose - A total of 17 user-compiled collections of webpages, comprising 833 bookmarked links in terms of genre, are studied. The purpose of this paper is to find out whether users tend to bookmark certain web genres more than others. Genre theory helps to make sense of the different pages included in these collections, and to classify them, according to their communicative purpose and salient non-topical features, into blogs, search interfaces, articles, tutorials. Design/methodology/approach A total of 17 participants took part in the research by providing their collections of bookmark links. They were also interviewed about the reasons for bookmarking and to comment on their collections. Relying on the interview results and on the previous literature, the bookmarks were classified into four super-genres: main or access pages, transactional pages, navigational pages, and content pages. Findings The results of the classification into web genres revealed a clear tendency to bookmark main pages, such as homepages, which accounted for 42 per cent of all bookmarked web links. Moreover, some aspects of relevance were highlighted such as the connections to use, time, and context, as well as to the main web activity (browsing or searching). Originality/value Previously, bookmarks have mostly been studied as tools for information reuse, but very rarely as sources of implicit relevance feedback. In addition, from the point of view of genre theory, this research shows the importance of relating web genres to users' intentions behind queries.", "paper_title": "Genre analysis of bookmarked webpages", "paper_id": "WOS:000288233100007"}