{"auto_keywords": [{"score": 0.006929393907491882, "phrase": "proposed_algorithm"}, {"score": 0.005467637983404416, "phrase": "maximal_performance"}, {"score": 0.00481495049065317, "phrase": "uniform_synchronous_rings"}, {"score": 0.0046544807197808095, "phrase": "concurrent_nodes"}, {"score": 0.004349337717774093, "phrase": "neighboring_nodes"}, {"score": 0.004116139569480336, "phrase": "infinite_computing_phases"}, {"score": 0.0038624981944755813, "phrase": "strong_fairness"}, {"score": 0.0033865859510157238, "phrase": "state-optimal_alternator_algorithm"}, {"score": 0.003315499339103866, "phrase": "n_nodes"}, {"score": 0.0030847461428168614, "phrase": "synchronous_mode"}, {"score": 0.002931569771634119, "phrase": "snap_property"}, {"score": 0.0027390682208834013, "phrase": "transient_fault"}, {"score": 0.0026929458952693465, "phrase": "stabilization_time"}, {"score": 0.002658863179011018, "phrase": "proposed_alternator_algorithm"}, {"score": 0.0025160740422447837, "phrase": "strong_fairness_property"}, {"score": 0.002205692205167157, "phrase": "worst_case"}], "paper_keywords": ["alternator", " distributed system", " fault-tolerance", " self-stabilization", " synchronization"], "paper_abstract": "An alternator is a network of concurrent nodes, which satisfies the following conditions: (i) if one node enters its critical section, no neighboring nodes could enter their critical sections at the same computing phase; (ii) along any infinite computing phases, each node enters its critical section infinitely often. An alternator is said to exhibit strong fairness if condition (ii) is changed to: between any two consecutive critical steps of a node, all neighbors enter their critical sections exactly once. In this paper, we propose a state-optimal alternator algorithm for uniform rings with n nodes, where n is any positive integer greater than one. The proposed algorithm operates correctly for synchronous mode. Every node maintains only a two-state variable. The proposed algorithm has the snap property that the system always satisfies condition (i) of the alternator even if some transient fault occurs. The stabilization time of the proposed alternator algorithm is O(n) phases. After stabilization, the system satisfies the strong fairness property and achieves the maximal performance. We say that an alternator achieves the maximal performance if a node is allowed to enter its critical section when both its neighbors do not enter their critical sections. In the worst case, the proposed algorithm allows each node to enter its critical section every three phases.", "paper_title": "State-optimal alternator for uniform synchronous rings", "paper_id": "WOS:000246121700009"}