{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "valencia_water-distribution_network"}, {"score": 0.028920159270475015, "phrase": "control_system"}, {"score": 0.004567596860086148, "phrase": "powadima_research_project"}, {"score": 0.0041102032028337366, "phrase": "significantly_different_production_costs"}, {"score": 0.0038989120088094185, "phrase": "treatment_plants"}, {"score": 0.0035705347414368696, "phrase": "complex_operation"}, {"score": 0.0032889671598112023, "phrase": "electricity_tariff_structure"}, {"score": 0.0030295361111006866, "phrase": "epanet_hydraulic_simulation_model"}, {"score": 0.002615977783510631, "phrase": "artificial_neural_network_predictor"}, {"score": 0.002540285736232124, "phrase": "epanet_model"}, {"score": 0.00249592321829865, "phrase": "dynamic_genetic_algorithm"}, {"score": 0.0024379730432321656, "phrase": "control_settings"}, {"score": 0.0022455164874830777, "phrase": "highly_variable_demand"}, {"score": 0.0021677478798910565, "phrase": "potential_operational-cost_saving"}], "paper_keywords": ["artificial neural network", " genetic algorithm", " optimal control", " POWADIMA", " water distribution"], "paper_abstract": "The second of the two case studies in the POWADIMA research project, the Valencia water-distribution network serves a population of approximately 1.2 million and is supplied by surface,. water via two treatment plants which have significantly different production costs. The only storage available is located at the treatment plants, each of which has its own pumping station. The management of the network is a complex operation involving 4 pressure zones and 49 operating valves, 10 of which are routinely adjusted. The electricity tariff structure varies with the hour of the day and month of the year. The EPANET hydraulic simulation model of the network has 725 nodes, 10 operating valves, 2 storage tanks and 17 pumps grouped at the two pumping stations. The control system that has been implemented comprises an artificial neural network predictor in place of the EPANET model and a dynamic genetic algorithm to optimize the control settings of pumps and valves up to a 24 h rolling operating horizon, in response to a highly variable demand. The results indicate a potential operational-cost saving of 17.6% over a complete (simulated) year relative to current practice, which easily justifies the cost of implementing the control system developed.", "paper_title": "Optimizing the operation of the Valencia water-distribution network", "paper_id": "WOS:000243505900007"}