{"auto_keywords": [{"score": 0.04728622032431744, "phrase": "ill-conditioned_linear_systems"}, {"score": 0.04344739979281999, "phrase": "double_preconditioning_approach"}, {"score": 0.04228307703921031, "phrase": "double_preconditioner"}, {"score": 0.00481495049065317, "phrase": "double_preconditioning_strategy"}, {"score": 0.004566567411073082, "phrase": "iterative_methods"}, {"score": 0.004439354841093929, "phrase": "brief_numerical_analysis"}, {"score": 0.004377077848734575, "phrase": "left_preconditioners"}, {"score": 0.003978866233891427, "phrase": "iterative_diagonal_scaling_method"}, {"score": 0.003936910716320182, "phrase": "incomplete_factorization_method"}, {"score": 0.0037336520904376687, "phrase": "computational_electromagnetism"}, {"score": 0.0035533891890176823, "phrase": "bi-conjugate_gradient_algorithm"}, {"score": 0.0033579708256295847, "phrase": "simple_incomplete_factorization_method"}, {"score": 0.0031845067058084583, "phrase": "iterative_solving_method"}, {"score": 0.0030306762103395842, "phrase": "simple_preconditioner"}, {"score": 0.002687235334499192, "phrase": "condition_number"}, {"score": 0.0026682872124177233, "phrase": "higher-order_finite_elements"}, {"score": 0.0025664295665392203, "phrase": "particular_double_preconditioning_approach"}, {"score": 0.0025036399134110822, "phrase": "invertible_linear_system"}, {"score": 0.0024597305738431226, "phrase": "numerical_evaluation"}, {"score": 0.002433754579432554, "phrase": "singular_linear_system"}, {"score": 0.0022434880661725493, "phrase": "new_preconditioning_technique"}, {"score": 0.002106485888216103, "phrase": "acceleration"}], "paper_keywords": ["finite element analysis", " differential equations"], "paper_abstract": "Purpose - The aim of this paper is to accelerate the convergence of iterative methods on ill-conditioned linear systems of equations. Design/methodology/approach - First a brief numerical analysis is given of left preconditioners on ill-conditioned linear systems of equations. From this result, it is deduced that a double preconditioning approach may be better. Then, a double preconditioner based on an iterative diagonal scaling method and an incomplete factorization method is proposed. The efficiency of this approach is illustrated on two finite element models produced by computational electromagnetism. Findings - The double preconditioning approach is efficient for 2D and 3D finite element problems. The bi-conjugate gradient algorithm always converges when it is double preconditioned. This is not the case when a simple incomplete factorization method is applied. Furthermore, when the two preconditioning techniques lead to the convergence of the iterative solving method, the double preconditioner significantly reduces the number of iterations in comparison with the simple preconditioner. On the proposed 2D problem, the speed-up is between 6 and 32. On the proposed 3D problem, the speed-up is between 13 and 20. Finally, the approach seems to reduce the growth of the condition number when higher-order finite elements are used. Research limitations/implications - The paper proposes a particular double preconditioning approach which can be applied to any invertible linear system of equations. A numerical evaluation on a singular linear system is also provided but no proof or analysis of stability is given for this case. Originality/value - The paper presents a new preconditioning technique based on the combination of two very simple and elementary methods: a diagonal scaling method and an incomplete factorization process. Acceleration obtained from this approach is quite impressive.", "paper_title": "Numerical study of a double preconditioning strategy", "paper_id": "WOS:000258420500022"}