{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "medium_and_large_projects"}, {"score": 0.009752110806723868, "phrase": "xp"}, {"score": 0.004397000006837371, "phrase": "software_quality"}, {"score": 0.00429828390000229, "phrase": "customer_requirements"}, {"score": 0.003925004567341077, "phrase": "widely_used_agile_methodology"}, {"score": 0.003683097597914604, "phrase": "large_software_projects"}, {"score": 0.003535489842686145, "phrase": "weak_documentation"}, {"score": 0.0034717929086014636, "phrase": "strong_architecture"}, {"score": 0.00334780964309978, "phrase": "software_development"}, {"score": 0.0032725712584012953, "phrase": "ever-_increasing_demand"}, {"score": 0.0032429499567088113, "phrase": "agile_approaches"}, {"score": 0.0031271133933467575, "phrase": "xp's_ability"}, {"score": 0.002934237411711622, "phrase": "development_methodology"}, {"score": 0.0026427848602443267, "phrase": "xp_model"}, {"score": 0.002491015208328868, "phrase": "large-_scale_projects"}, {"score": 0.0024129269611844794, "phrase": "extended_xp"}, {"score": 0.0023372808856170386, "phrase": "case_studies"}, {"score": 0.0021049977753042253, "phrase": "medium_and_large_software_development_projects"}], "paper_keywords": [""], "paper_abstract": "Extreme programming (XP) is one of the most widely used agile methodologies for software development. It intends to improve software quality and responsiveness to changing customer requirements. Despite the facts that the use of XP offers a number of benefits and it has been a widely used agile methodology, XP does not offer the same benefits when it comes to medium and large software projects. Some of the reasons for this are weak documentation, lack of strong architecture and ignorance to risk awareness during the software development. Owing to the ever- increasing demand of agile approaches, this study addresses the problem of XP's ability to handle medium and large projects. Most of the companies that employ XP as a development methodology for medium and large projects face this problem, which echoes the importance of this problem. To address this problem, in this study XP model is extended in such a way that it equally offers its benefits for medium- and large- scale projects. As an evaluation of the extended XP, three independent industrial case studies are conducted. The case studies are described and results are presented in the study. The results provide evidence that the extended XP can be beneficial for medium and large software development projects.", "paper_title": "Agile software development methodology for medium and large projects", "paper_id": "WOS:000308914700009"}