{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "evolutionary_algorithms"}, {"score": 0.012096883519620698, "phrase": "hybrid_metaheuristics"}, {"score": 0.0044514440242754815, "phrase": "hybrid_metaheuristics_concerns"}, {"score": 0.004342430078306461, "phrase": "strong_specialization"}, {"score": 0.004236074477264556, "phrase": "flexible_architecture"}, {"score": 0.0041666157975446564, "phrase": "specialized_models"}, {"score": 0.003835972725191194, "phrase": "present_justifies"}, {"score": 0.0037419747525425586, "phrase": "suitable_ingredients"}, {"score": 0.0033743949483348626, "phrase": "existing_research"}, {"score": 0.003171358146412577, "phrase": "specialized_literature"}, {"score": 0.0030052718739167696, "phrase": "additional_results"}, {"score": 0.0028010985923790036, "phrase": "iterated_local_search_algorithm"}, {"score": 0.0027665315772006575, "phrase": "evolutionary_perturbation_technique"}, {"score": 0.0025678829712650437, "phrase": "binary_optimization_problems"}, {"score": 0.002504880563070155, "phrase": "good_performance"}, {"score": 0.002473959963690124, "phrase": "reviewed_approaches"}, {"score": 0.0024434201175883674, "phrase": "suitable_results"}, {"score": 0.0023834640793589435, "phrase": "important_conclusion"}, {"score": 0.002203117204010397, "phrase": "prospective_line"}, {"score": 0.0021579641460002523, "phrase": "effective_search_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hybrid metaheuristics", " Evolutionary algorithms", " Intensification and diversification", " Iterated local search"], "paper_abstract": "Nowadays, a promising way to obtain hybrid metaheuristics concerns the combination of several search algorithms with strong specialization in intensification and/or diversification. The flexible architecture of evolutionary algorithms allows specialized models to be obtained with the aim of providing intensification and/or diversification. The outstanding role that is played by evolutionary algorithms at present justifies the choice of their specialist approaches as suitable ingredients to build hybrid metaheuristics. This paper focuses on hybrid metaheuristics with evolutionary algorithms specializing in intensification and diversification. We first give an overview of the existing research on this topic, describing several instances grouped into three categories that were identified after reviewing specialized literature. Then, with the aim of complementing the overview and providing additional results and insights on this line of research, we present an instance that consists of an iterated local search algorithm with an evolutionary perturbation technique. The benefits of the proposal in comparison to other iterated local search algorithms proposed in the literature to deal with binary optimization problems are experimentally shown. The good performance of the reviewed approaches and the suitable results shown by our instance allow an important conclusion to be achieved: the use of evolutionary algorithms specializing in intensification and diversification for building hybrid metaheuristics becomes a prospective line of research for obtaining effective search algorithms. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Hybrid metaheuristics with evolutionary algorithms specializing in intensification and diversification: Overview and progress report", "paper_id": "WOS:000271369400007"}