{"auto_keywords": [{"score": 0.02806243336360504, "phrase": "provenance_graphs"}, {"score": 0.00481495049065317, "phrase": "computational_provenance"}, {"score": 0.004518442937844318, "phrase": "local_infrastructure"}, {"score": 0.004457309741979921, "phrase": "earth_science_data_products"}, {"score": 0.004397000006837371, "phrase": "satellite_remote_sensing"}, {"score": 0.0037336520904376687, "phrase": "scientist's_own_research"}, {"score": 0.003503497128638099, "phrase": "public_access"}, {"score": 0.0033175095965171674, "phrase": "idiosyncratic_computing_ensembles"}, {"score": 0.0032725712584012953, "phrase": "scientific_research"}, {"score": 0.003141364320497748, "phrase": "workflow_model"}, {"score": 0.0030847461428168614, "phrase": "provenance_information"}, {"score": 0.0030429511467945525, "phrase": "arbitrary_applications"}, {"score": 0.0025833500717948343, "phrase": "workflow_specifications"}, {"score": 0.0021731423856364003, "phrase": "graph_retrieval"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["ES3", " instrumentation", " lineage", " passive", " provenance", " transparency"], "paper_abstract": "The Earth System Science Server (ES3) project is developing a local infrastructure for managing Earth science data products derived from satellite remote sensing. By 'local,' we mean the infrastructure that a scientist uses to manage the creation and dissemination of her own data products, particularly those that are constantly incorporating corrections or improvements based on the scientist's own research. Therefore, in addition to being robust and capacious enough to support public access, ES3 is intended to be flexible enough to manage the idiosyncratic computing ensembles that typify scientific research. Instead of specifying provenance explicitly with a workflow model, ES3 extracts provenance information automatically from arbitrary applications by monitoring their interactions with their execution environment. These interactions (arguments, file I/O, system calls, etc.) are logged to the ES3 database, which assembles them into provenance graphs. These graphs resemble workflow specifications, but are really reports-they describe what actually happened, as opposed to what was requested. The ES3 database supports forward and backward navigation through provenance graphs (i.e. ancestor/descendant queries), as well as graph retrieval. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "Automatic capture and reconstruction of computational provenance", "paper_id": "WOS:000254463500008"}