{"auto_keywords": [{"score": 0.03765951802626425, "phrase": "bms."}, {"score": 0.015719714774698138, "phrase": "building_management_system"}, {"score": 0.00886251839468153, "phrase": "bms-wsn"}, {"score": 0.004664352260912174, "phrase": "\"_intelligent_building"}, {"score": 0.004590820632326585, "phrase": "significant_attention"}, {"score": 0.0039369107163201855, "phrase": "building's_areas"}, {"score": 0.0037336520904376687, "phrase": "main_current"}, {"score": 0.0036942726653704213, "phrase": "emerging_approaches"}, {"score": 0.003322540556404882, "phrase": "bandwidth_limitation"}, {"score": 0.0030684249587688826, "phrase": "ip-based_and_restful_architecture_approach"}, {"score": 0.0029565779145783776, "phrase": "bms"}, {"score": 0.002365815362517737, "phrase": "energy_efficiency"}, {"score": 0.002328434471939886, "phrase": "test-bed_implementation"}, {"score": 0.0022674379203603224, "phrase": "bms_application"}, {"score": 0.0021049977753042253, "phrase": "ip-based_and_restful_architecture"}], "paper_keywords": ["Building management system", " IoT", " REST", " CoAP", " 6LoWPAN", " RPL"], "paper_abstract": "The concept of an \" intelligent building\" received significant attention from academic, industry and standard development organizations when technically termed a building management system (BMS). Wireless sensor networks (WSNs) and their recent development enhanced monitoring and control applications for the building's areas. This paper surveys and analyzes advantages of the main current and emerging approaches that may be fit for BMS. Specifically, we discuss challenges including interoperability, integration, overhead, and bandwidth limitation of WSNs in BMS. Based on analyses, we highlight the advantages of an IP-based and RESTful architecture approach as the most suitable solution for BMS using WSNs (BMS-WSN). The paper also describes our future direction and design for BMS-WSN based on these advantages. The purpose is to enable interaction of users with BMS-WSN in the same way as with any website while ensuring energy efficiency. A test-bed implementation and evaluation of a BMS application is also introduced in this paper to demonstrate the feasibility and benefits of IP-based and RESTful architecture for BMS.", "paper_title": "RESTful Architecture of Wireless Sensor Network for Building Management System", "paper_id": "WOS:000300519400003"}