{"auto_keywords": [{"score": 0.03286623919278698, "phrase": "manb"}, {"score": 0.015522575845394484, "phrase": "alzheimer's_disease"}, {"score": 0.015424920029004762, "phrase": "genome-wide_data"}, {"score": 0.015231419194298608, "phrase": "patient_outcomes"}, {"score": 0.01149474940589353, "phrase": "feature_selection"}, {"score": 0.011422976895976041, "phrase": "nb"}, {"score": 0.009778276599034519, "phrase": "fsnb"}, {"score": 0.00481495049065317, "phrase": "naive_bayes_model"}, {"score": 0.004634117581810466, "phrase": "genome-wide_measurements"}, {"score": 0.004546252387071551, "phrase": "clinical_care"}, {"score": 0.004502943680955863, "phrase": "large_number"}, {"score": 0.003950631096355195, "phrase": "exponential_number"}, {"score": 0.003875674688691641, "phrase": "model-averaged_naive_bayes"}, {"score": 0.0037658881407605445, "phrase": "late_onset"}, {"score": 0.0036475333460338397, "phrase": "genome-wide_predictive_features"}, {"score": 0.003532885029484907, "phrase": "naive_bayes_algorithm"}, {"score": 0.0033891942983439146, "phrase": "measurement_performance"}, {"score": 0.0032617323680009217, "phrase": "roc_curve"}, {"score": 0.0031290354217563938, "phrase": "training_time"}, {"score": 0.002797922160172791, "phrase": "test_case"}, {"score": 0.002509770427841966, "phrase": "fsnb._manb"}, {"score": 0.0022948394240866555, "phrase": "conclusion_manb"}, {"score": 0.002244040022860764, "phrase": "clinical_outcome"}, {"score": 0.002222613784010603, "phrase": "high-dimensional_genome-wide_dataset"}], "paper_keywords": [""], "paper_abstract": "Objective Predicting patient outcomes from genome-wide measurements holds significant promise for improving clinical care. The large number of measurements (eg, single nucleotide polymorphisms (SNPs)), however, makes this task computationally challenging. This paper evaluates the performance of an algorithm that predicts patient outcomes from genome-wide data by efficiently model averaging over an exponential number of naive Bayes (NB) models. Design This model-averaged naive Bayes (MANB) method was applied to predict late onset Alzheimer's disease in 1411 individuals who each had 312 318 SNP measurements available as genome-wide predictive features. Its performance was compared to that of a naive Bayes algorithm without feature selection (NB) and with feature selection (FSNB). Measurement Performance of each algorithm was measured in terms of area under the ROC curve (AUC), calibration, and run time. Results The training time of MANB (16.1 s) was fast like NB (15.6 s), while FSNB (1684.2 s) was considerably slower. Each of the three algorithms required less than 0.1 s to predict the outcome of a test case. MANB had an AUG of 0.72, which is significantly better than the AUG of 0.59 by NB (p<0.00001), but not significantly different from the AUG of 0.71 by FSNB. MANB was better calibrated than NB, and FSNB was even better in calibration. A limitation was that only one dataset and two comparison algorithms were included in this study. Conclusion MANB performed comparatively well in predicting a clinical outcome from a high-dimensional genome-wide dataset. These results provide support for including MANB in the methods used to predict outcomes from large, genome-wide datasets.", "paper_title": "The application of naive Bayes model averaging to predict Alzheimer's disease from genome-wide data", "paper_id": "WOS:000292061700007"}