{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "journal_editor"}, {"score": 0.01029349991882254, "phrase": "moral_hazard"}, {"score": 0.00481495049065317, "phrase": "peer_review"}, {"score": 0.004716520738331953, "phrase": "principal-agent_problem"}, {"score": 0.004463723624910583, "phrase": "best_interests"}, {"score": 0.003667925754747227, "phrase": "in-depth_knowledge"}, {"score": 0.003555902292752528, "phrase": "reviewer's_effort"}, {"score": 0.003483120583663528, "phrase": "superior_information"}, {"score": 0.0034472883424839346, "phrase": "manuscript's_quality"}, {"score": 0.0029518598926717332, "phrase": "editor's_interest"}, {"score": 0.0027361626349903744, "phrase": "associate_editors"}, {"score": 0.002707993764473537, "phrase": "peer-review_process"}, {"score": 0.0025449518236394103, "phrase": "agency_theory"}, {"score": 0.002286781334850213, "phrase": "promotion-based_incentives"}, {"score": 0.002224510044064184, "phrase": "within-job_incentives"}, {"score": 0.0021490449563443025, "phrase": "referee's_performance"}, {"score": 0.0021195791482462004, "phrase": "individual_differences"}, {"score": 0.0021049977753042253, "phrase": "ability_and_promotion_opportunities"}], "paper_keywords": ["human resources management", " editors", " scholarly publishing"], "paper_abstract": "In economics, the principal-agent problem is the difficulty in motivating one party (the agent), to act in the best interests of another (the principal) rather than in his own interests. We consider the example of a journal editor (the principal) wondering whether his or her reviewer (the agent) is recommending rejection of a manuscript because it does not have enough quality to be published or because the reviewer dislikes effort and he/she must work to acquire in-depth knowledge of the content of the manuscript. The reviewer's effort provides him or her with superior information about a manuscript's quality. If this information is not correctly communicated, the reviewer has more information when compared with the journal editor. This inherently leads to an encouragement of moral hazard, where the editor will not know whether the reviewer has done his or her job in accordance to the editor's interest. Prescriptions need to be given as to how the journal editor should control the reviewers to curb self-interest. Besides the associate editors monitoring the peer-review process, incentives can be employed to limit moral hazard on the part of the reviewer. Drawing on agency theory, we examine the incentives motivating the reviewers to expend effort to generate information about the quality of submissions. This model predicts that for reviewers early in their careers, promotion-based incentives may mean there is no need for within-job incentives, but also that within-job rewards for a referee's performance should depend on individual differences in ability and promotion opportunities.", "paper_title": "The Principal-Agent Problem in Peer Review", "paper_id": "WOS:000348730000005"}