{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "engineering_design"}, {"score": 0.004743594110762319, "phrase": "empirical_and_theoretical_approaches"}, {"score": 0.004673290248999786, "phrase": "engineering_ontologies"}, {"score": 0.004337028108577593, "phrase": "engineering_design_domain"}, {"score": 0.004230382915464492, "phrase": "ontology_proposal"}, {"score": 0.004105850229681625, "phrase": "specific_application"}, {"score": 0.003848413823574867, "phrase": "ontology_engineering_design_integrated_taxonomies"}, {"score": 0.0037350832473790007, "phrase": "theoretical_approach"}, {"score": 0.0035712919163869176, "phrase": "engineering_design_theories_ontology"}, {"score": 0.0033140589981208693, "phrase": "research_methodology"}, {"score": 0.0023028105026714533, "phrase": "merged_ontology"}, {"score": 0.002223770196464436, "phrase": "template_ontology"}, {"score": 0.0021049977753042253, "phrase": "specific_context"}], "paper_keywords": ["Design Theory", " Empirical Research", " Engineering Design Ontology", " Indexing Knowledge", " Ontology Mapping and Merging"], "paper_abstract": "This paper presents a comparison of two previous and separate efforts to develop an ontology in the engineering design domain, together with an ontology proposal from which ontologies for a specific application may be derived. The research contrasts an empirical, user-centered approach to developing the ontology engineering design integrated taxonomies (EDIT) with a theoretical approach in which concepts and relations are elicited from engineering design theories ontology (DO) The limitations and advantages of each approach are discussed. The research methodology adopted is to map the ontology through examining each of the concepts and relations contained within each of the ontologies DO and EDIT with respect to the other. The comparison process results in an examination of both ontologies, with a few changes resulting from this. The importance of the two different approaches, one that is theoretically sound and another that is applicable, is recognized and argued. Finally, the merged ontology for engineering design is proposed as a template ontology that can be tailored by researchers and practitioners for a specific context", "paper_title": "Merged ontology for engineering design: Contrasting empirical and theoretical approaches to develop engineering ontologies", "paper_id": "WOS:000271131600006"}