{"auto_keywords": [{"score": 0.02946307402591444, "phrase": "miragaa"}, {"score": 0.00481495049065317, "phrase": "coordinated_effects"}, {"score": 0.004772137871562584, "phrase": "microrna_expression_changes"}, {"score": 0.004729704116022601, "phrase": "genome_aberrations"}, {"score": 0.004502943680955863, "phrase": "random_lesions"}, {"score": 0.0044231966846655394, "phrase": "biggest_advantage"}, {"score": 0.004267896572751978, "phrase": "multiple_samples"}, {"score": 0.004136469845987887, "phrase": "gene_function"}, {"score": 0.003991196463806465, "phrase": "corresponding_gene"}, {"score": 0.0036991458715587163, "phrase": "large_number"}, {"score": 0.003666217992454448, "phrase": "cancer_samples"}, {"score": 0.0035216195857272403, "phrase": "coordinated_and_almost_mutually_exclusive_manner"}, {"score": 0.003278447235176858, "phrase": "cancer_phenotype"}, {"score": 0.0030932495918679285, "phrase": "present_methodologies"}, {"score": 0.0030113280682863234, "phrase": "single_datasets"}, {"score": 0.0026686444508167875, "phrase": "coordinated_changes"}, {"score": 0.002644865209801606, "phrase": "genome_copy_numbers"}, {"score": 0.002621297299343551, "phrase": "mirna_expression"}, {"score": 0.0023754752864092437, "phrase": "genome_regions"}, {"score": 0.0023437863565921053, "phrase": "different_mirnas"}], "paper_keywords": [""], "paper_abstract": "Motivation: Cancer evolves through microevolution where random lesions that provide the biggest advantage to cancer stand out in their frequent occurrence in multiple samples. At the same time, a gene function can be changed by aberration of the corresponding gene or modification of microRNA (miRNA) expression, which attenuates the gene. In a large number of cancer samples, these two mechanisms might be distributed in a coordinated and almost mutually exclusive manner. Understanding this coordination may assist in identifying changes which significantly produce the same functional impact on cancer phenotype, and further identify genes that are universally required for cancer. Present methodologies for finding aberrations usually analyze single datasets, which cannot identify such pairs of coordinating genes and miRNAs. Results: We have developed MIRAGAA, a statistical approach, to assess the coordinated changes of genome copy numbers and miRNA expression. We have evaluated MIRAGAA on The Cancer Genome Atlas (TCGA) Glioblastoma Multiforme datasets. In these datasets, a number of genome regions coordinating with different miRNAs are identified. Although well known for their biological significance, these genes and miRNAs would be left undetected for being less significant if the two datasets were analyzed individually.", "paper_title": "MIRAGAA-a methodology for finding coordinated effects of microRNA expression changes and genome aberrations in cancer", "paper_id": "WOS:000273696900003"}