{"auto_keywords": [{"score": 0.04226255901245674, "phrase": "vawt_system"}, {"score": 0.02322730111336099, "phrase": "pitch_angle"}, {"score": 0.011493435570272685, "phrase": "square_moments"}, {"score": 0.0104068537454775, "phrase": "flow_characteristics"}, {"score": 0.00852295684335031, "phrase": "blade_profiles"}, {"score": 0.008067795309504043, "phrase": "pitch_angles"}, {"score": 0.0067885469573581575, "phrase": "self-starting_ability"}, {"score": 0.004647442352794694, "phrase": "small-size_darrieus_vawt."}, {"score": 0.004539005582217309, "phrase": "simulation_model"}, {"score": 0.004329630571352367, "phrase": "blade_camber"}, {"score": 0.0041625173012740544, "phrase": "darrieus_vertical_axis"}, {"score": 0.003954837422946628, "phrase": "uniform_wind_speed"}, {"score": 0.003527998934981411, "phrase": "user-defined_function"}, {"score": 0.003445591238183763, "phrase": "instantaneous_moments"}, {"score": 0.003286486670483032, "phrase": "flow_structures"}, {"score": 0.003247868216333148, "phrase": "vorticity_fields"}, {"score": 0.0028743610212291727, "phrase": "initial_acceleration"}, {"score": 0.0023787690061742566, "phrase": "maximum_root"}, {"score": 0.002332322771009122, "phrase": "maximum_values"}], "paper_keywords": ["VAWT", " CFD", " Pitch-angle variation", " Self-start", " Moment coefficient"], "paper_abstract": "This study builds up a simulation model, via Ansys/Fluent, to investigate the effects of pitch angle and blade camber on the flow characteristics and performance of small-size Darrieus vertical axis wind turbine (VAWT). The VAWT system is driven by a uniform wind speed (10 m/s). The blade profiles with three different cambers are NACA0012, 2412 and 4412, respectively; and the pitch angles vary between 10A degrees and -10A degrees. The user-defined function is employed to calculate the instantaneous moments produced by all the blades and rotate the VAWT system from rest. The flow structures, the vorticity fields and the performance on the blades will be addressed; also, the self-starting ability and the moment coefficient of the VAWT system are discussed. For the blade profiles studied, the initial acceleration is the largest at theta = -10A degrees and decreases monotonously as the pitch angle increases from theta = -10A degrees to theta = 10A degrees. Further, at the same pitch angle, the larger the camber of the blade (NACA4412), the better is the self-starting ability of the VAWT system. The maximum root mean square moments have the maximum values at theta = 5A degrees for all the blade profiles studied herein. The root mean square moments for NACA2412 are much higher than those of NACA0012 and 4412 at all pitch angles. However, the root mean square moments for NACA4412 are relatively insensitive to the variations in pitch angles.", "paper_title": "Effects of pitch angle and blade camber on flow characteristics and performance of small-size Darrieus VAWT", "paper_id": "WOS:000313711900010"}