{"auto_keywords": [{"score": 0.028922070799105606, "phrase": "depth-based_cameras"}, {"score": 0.00481495049065317, "phrase": "immersive_ball_game"}, {"score": 0.0047464608267006395, "phrase": "commodity_depth-based_camera"}, {"score": 0.00459039896577789, "phrase": "commodity_depth-based_cameras"}, {"score": 0.004482063543727601, "phrase": "passive_unencumbered_head_tracking"}, {"score": 0.004334657104697421, "phrase": "correct_perspective"}, {"score": 0.004252602474733162, "phrase": "immersive_computer_ball_game"}, {"score": 0.003996458454723708, "phrase": "viewpoint_update"}, {"score": 0.003176899769744057, "phrase": "depth_camera"}, {"score": 0.003043031131345537, "phrase": "accurate_measures"}, {"score": 0.002985353542495357, "phrase": "task_performance"}, {"score": 0.0029569247903654477, "phrase": "user_experience"}, {"score": 0.0029147869733574844, "phrase": "randomised_within_subjects_trial"}, {"score": 0.002623536040408411, "phrase": "multi-player_ball_game"}, {"score": 0.002488985155689794, "phrase": "ball_interaction"}, {"score": 0.0024185182010749273, "phrase": "natural_movements"}, {"score": 0.002305468528385778, "phrase": "depth-based_camera"}, {"score": 0.0022401855403251653, "phrase": "ball_game"}], "paper_keywords": ["simulation", " gaming", " recreation"], "paper_abstract": "We present the use of commodity depth-based cameras to control viewpoint from passive unencumbered head tracking. This allowed participants to maintain correct perspective while playing an immersive computer ball game, without the need to wear devices, wires or markers. Viewpoint update drives parallax that supports orientation, the judging of distance and scale, moving in response to the simulation and the feeling of presence. Its incorporation increases the validity of using simulations in applications in which any of these are important. Although updating viewpoint from a depth camera has been demonstrated, it has not undergone accurate measures of latency, task performance or user experience. A randomised within subjects trial of n = 12 participants was used to determine if head and hand tracking from depth-based cameras helped the playability and experience of a multi-player ball game. Findings suggest that experience is only improved when both ball interaction and viewpoint are controlled through natural movements and that the quality of viewpoint update from a depth-based camera was sufficient to allow a ball game to be played without inducing disorientation or nausea. This work demonstrates both a potential benefit and risk of using depth-based cameras to update viewpoint.", "paper_title": "Controlling viewpoint from markerless head tracking in an immersive ball game using a commodity depth-based camera", "paper_id": "WOS:000349938800005"}