{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lcr-exxxplorer"}, {"score": 0.004475659507646842, "phrase": "low_complexity_regions"}, {"score": 0.004425616928975799, "phrase": "protein_sequences"}, {"score": 0.004067635935640407, "phrase": "amino_acid_sequences"}, {"score": 0.003738502710504415, "phrase": "sequence_database_searches"}, {"score": 0.00357395617690842, "phrase": "biological_significance"}, {"score": 0.0034166271604770576, "phrase": "pathological_situations"}, {"score": 0.0033405704229694656, "phrase": "lcr-related_algorithms"}, {"score": 0.0032296377835432533, "phrase": "wide_appreciation"}, {"score": 0.003175556211659149, "phrase": "research_community"}, {"score": 0.0030017207229983385, "phrase": "user-friendly_software"}, {"score": 0.0023035922232490106, "phrase": "powerful_queries"}, {"score": 0.0021288561076024844, "phrase": "useful_starting_point"}, {"score": 0.0021049977753042253, "phrase": "research_efforts"}], "paper_keywords": [""], "paper_abstract": "Motivation: Local compositionally biased and low complexity regions (LCRs) in amino acid sequences have initially attracted the interest of researchers due to their implication in generating artifacts in sequence database searches. There is accumulating evidence of the biological significance of LCRs both in physiological and in pathological situations. Nonetheless, LCR-related algorithms and tools have not gained wide appreciation across the research community, partly due to the fact that only a handful of user-friendly software is currently freely available. Results: We developed LCR-eXXXplorer, an extensible online platform attempting to fill this gap. LCR-eXXXplorer offers tools for displaying LCRs from the UniProt/SwissProt knowledgebase, in combination with other relevant protein features, predicted or experimentally verified. Moreover, users may perform powerful queries against a custom designed sequence/LCR-centric database. We anticipate that LCR-eXXXplorer will be a useful starting point in research efforts for the elucidation of the structure, function and evolution of proteins with LCRs.", "paper_title": "LCR-eXXXplorer: a web platform to search, visualize and share data for low complexity regions in protein sequences", "paper_id": "WOS:000357425800021"}