{"auto_keywords": [{"score": 0.0417933804279622, "phrase": "research_team"}, {"score": 0.014335676101903444, "phrase": "generalizable_categories"}, {"score": 0.008651815759861283, "phrase": "clinical_ehr"}, {"score": 0.00481495049065317, "phrase": "patient-generated_data"}, {"score": 0.004723847090183984, "phrase": "controlling_disease"}, {"score": 0.0047013405841819025, "phrase": "inexpensive_it_-_hypertension"}, {"score": 0.004623405003209069, "phrase": "conduit-hid_intervention"}, {"score": 0.004601374835486024, "phrase": "patients'_electronic_blood_pressure_measurements"}, {"score": 0.004525088883501587, "phrase": "microsoft_healthvault"}, {"score": 0.004492781547269096, "phrase": "intermediary_data_store"}, {"score": 0.004345024152234371, "phrase": "technical_challenges"}, {"score": 0.004132411680987228, "phrase": "example_challenges"}, {"score": 0.003939565240409143, "phrase": "mediation_strategies"}, {"score": 0.003911421884625501, "phrase": "technical_development"}, {"score": 0.0038557345567111017, "phrase": "home_visits"}, {"score": 0.003764671961430287, "phrase": "telephone_calls"}, {"score": 0.003308716433852877, "phrase": "home_computers"}, {"score": 0.003246019443995452, "phrase": "healthvault"}, {"score": 0.003222814590544802, "phrase": "clinical_ehr._specific_challenges"}, {"score": 0.003087017178815267, "phrase": "application_design"}, {"score": 0.0030503185061659926, "phrase": "multiple_vendors"}, {"score": 0.0030068537906752357, "phrase": "design_changes"}, {"score": 0.0029640065729342547, "phrase": "intervention_use_cases"}, {"score": 0.0029078224462409795, "phrase": "application_designers"}, {"score": 0.0028527002687205347, "phrase": "clinic_computers"}, {"score": 0.002412736578194205, "phrase": "rct._conclusions"}, {"score": 0.002305468528385778, "phrase": "potential_challenges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Consumer health informatics", " Blood pressure", " HealthVault", " Usability", " Use case", " Human factors"], "paper_abstract": "Introduction: The CONDUIT-HID intervention integrates patients' electronic blood pressure measurements directly into the clinical EHR using Microsoft HealthVault as an intermediary data store. The goal of this paper is to describe generalizable categories of patient and technical challenges encountered in the development and implementation of this inexpensive, commercial off-the-shelf consumer health informatics intervention, examples of challenges within each category, and how the example challenges were resolved prior to conducting an RCT of the intervention. Methods: The research team logged all challenges and mediation strategies during the technical development of the intervention, conducted home visits to observe patients using the intervention, and conducted telephone calls with patients to understand challenges they encountered. We then used these data to iteratively refine the intervention. Results: The research team identified a variety of generalizable categories of challenges associated with patients uploading data from their homes, patients uploading data from clinics because they did not have or were not comfortable using home computers, and patients establishing the connection between HealthVault and the clinical EHR. Specific challenges within these categories arose because: (1) the research team had little control over the device and application design, (2) multiple vendors needed to coordinate their actions and design changes, (3) the intervention use cases were not anticipated by the device and application designers, (4) PHI accessed on clinic computers needed to be kept secure, (5) the research team wanted the data in the clinical EHR to be valid and reliable, (6) patients needed the ability to share only the data they wanted, and (7) the development of some EHR functionalities were new to the organization. While these challenges were varied and complex, the research team was able to successfully resolve each one prior to the start of the RCT. Conclusions: By identifying these generalizable categories of challenges, we aim to help others proactively search for and remedy potential challenges associated with their interventions, rather than reactively responding to problems as they arise. We posit that this approach will significantly increase the likelihood that these types of interventions will be successful. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Overcoming challenges integrating patient-generated data into the clinical EHR: Lessons from the CONtrolling Disease Using Inexpensive IT - Hypertension in Diabetes (CONDUIT-HID) Project", "paper_id": "WOS:000324312000001"}