{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_algorithms"}, {"score": 0.012285436246508312, "phrase": "decision-tree_induction"}, {"score": 0.010529626633104184, "phrase": "decision_trees"}, {"score": 0.004009555045206973, "phrase": "alternate_heuristics"}, {"score": 0.0039433581938239926, "phrase": "traditional_top-down_divide-and-conquer_approach"}, {"score": 0.003608266640131664, "phrase": "particular_components"}, {"score": 0.0035684266744407485, "phrase": "decision-tree_classifiers"}, {"score": 0.003509487090932835, "phrase": "paper's_original_contributions"}, {"score": 0.003319939715683536, "phrase": "up-to-date_overview"}, {"score": 0.0030545815929619306, "phrase": "specific_evolutionary_approach"}, {"score": 0.0022129983153880467, "phrase": "important_issues"}, {"score": 0.0021885300925245516, "phrase": "open_questions"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Classification", " decision-tree induction", " evolutionary algorithms (EAs)", " regression", " soft computing"], "paper_abstract": "This paper presents a survey of evolutionary algorithms that are designed for decision-tree induction. In this context, most of the paper focuses on approaches that evolve decision trees as an alternate heuristics to the traditional top-down divide-and-conquer approach. Additionally, we present some alternative methods that make use of evolutionary algorithms to improve particular components of decision-tree classifiers. The paper's original contributions are the following. First, it provides an up-to-date overview that is fully focused on evolutionary algorithms and decision trees and does not concentrate on any specific evolutionary approach. Second, it provides a taxonomy, which addresses works that evolve decision trees and works that design decision-tree components by the use of evolutionary algorithms. Finally, a number of references are provided that describe applications of evolutionary algorithms for decision-tree induction in different domains. At the end of this paper, we address some important issues and open questions that can be the subject of future research.", "paper_title": "A Survey of Evolutionary Algorithms for Decision-Tree Induction", "paper_id": "WOS:000303069100002"}