{"auto_keywords": [{"score": 0.0284485727829961, "phrase": "vital_structures"}, {"score": 0.00481495049065317, "phrase": "geometric_models"}, {"score": 0.004622986791421418, "phrase": "difficult_and_knowledge-intensive_task"}, {"score": 0.004494570360108983, "phrase": "internal_injuries"}, {"score": 0.004369705395855237, "phrase": "appropriate_treatment"}, {"score": 0.004342430078306461, "phrase": "physical_examination"}, {"score": 0.004248294537944227, "phrase": "imaging_data"}, {"score": 0.003940706575253453, "phrase": "canonical_knowledge"}, {"score": 0.0039038519189781135, "phrase": "specific_subject_image_data"}, {"score": 0.003759835076089236, "phrase": "three-dimensional_geometric_model"}, {"score": 0.003701401653850141, "phrase": "segmented_images"}, {"score": 0.003454858296390957, "phrase": "organ_identities"}, {"score": 0.003369322866499541, "phrase": "anatomic_reasoning"}, {"score": 0.0032858981413454802, "phrase": "regional_perfusion"}, {"score": 0.003265365666305185, "phrase": "formal_definitions"}, {"score": 0.0032449610741097992, "phrase": "arterial_anatomy"}, {"score": 0.0032246835734680377, "phrase": "corresponding_regions"}, {"score": 0.0031646057802503526, "phrase": "computer_reasoning_services"}, {"score": 0.003028727936200845, "phrase": "geometric_model"}, {"score": 0.002722468694023035, "phrase": "particular_trajectories"}, {"score": 0.0026384167183586015, "phrase": "coronary_artery"}, {"score": 0.0024014759148123736, "phrase": "medical_images"}, {"score": 0.0023789822182914877, "phrase": "computer_reasoning"}, {"score": 0.0022767594422780004, "phrase": "intelligent_computer_applications"}, {"score": 0.002248366278757655, "phrase": "image_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["anatomy ontologies", " computer reasoning", " geometric heart models"], "paper_abstract": "Objective: Medical assessment of penetrating injuries is a difficult and knowledge-intensive task, and rapid determination of the extent of internal injuries is vital for triage and for determining the appropriate treatment. Physical examination and computed tomographic (CT) imaging data must be combined with detailed anatomic, physiologic, and biomechanical knowledge to assess the injured subject. We are developing a methodology to automate reasoning about penetrating injuries using canonical knowledge combined with specific subject image data. Methods and material: In our approach, we build a three-dimensional geometric model of a subject from segmented images. We link regions in this model to entities in two knowledge sources: (1) a comprehensive ontology of anatomy containing organ identities, adjacencies, and other information useful for anatomic reasoning and (2) an ontology of regional perfusion containing formal definitions of arterial anatomy and corresponding regions of perfusion. We created computer reasoning services (\"problem solvers\") that use the ontologies to evaluate the geometric model of the subject and deduce the consequences of penetrating injuries. Results: We developed and tested our methods using data from the Visible Human. Our problem solvers can determine the organs that are injured given particular trajectories of projectiles, whether vital structures - such as a coronary artery - are injured, and they can predict the propagation of injury ensuing after vital structures are injured. Conclusion: We have demonstrated the capability of using ontologies with medical images to support computer reasoning about injury based on those images. Our methodology demonstrates an approach to creating intelligent computer applications that reason with image data, and it may have value in helping practitioners in the assessment of penetrating injury. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Using ontologies linked with geometric models to reason about penetrating injuries", "paper_id": "WOS:000238992500002"}