{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "saudi_municipalities"}, {"score": 0.006689325540853234, "phrase": "saudi_context"}, {"score": 0.004758457292840376, "phrase": "saudi_arabia"}, {"score": 0.004647442352794694, "phrase": "rapid_advances"}, {"score": 0.004620093797504386, "phrase": "information_technology"}, {"score": 0.0042914801644970265, "phrase": "gis"}, {"score": 0.004228577663320847, "phrase": "individual_departments"}, {"score": 0.004178935413340453, "phrase": "comprehensive_institutional_operations"}, {"score": 0.004105558123159003, "phrase": "fragmented_applications"}, {"score": 0.004081385289516914, "phrase": "isolated_databases"}, {"score": 0.0039626308903511764, "phrase": "overall_framework"}, {"score": 0.0038930368103015467, "phrase": "reliable_it_solutions"}, {"score": 0.0038246602895705643, "phrase": "corporate_requirements"}, {"score": 0.0036914757355166966, "phrase": "organizational_structures"}, {"score": 0.0036159291978698016, "phrase": "general_framework"}, {"score": 0.003489987735217367, "phrase": "gis_applications"}, {"score": 0.0034084648745417805, "phrase": "municipal_decisions"}, {"score": 0.0031845067058084613, "phrase": "important_issues"}, {"score": 0.0031563974745349266, "phrase": "enterprise_gis"}, {"score": 0.0030017207229983385, "phrase": "proposed_gis_framework"}, {"score": 0.00297522010445508, "phrase": "enterprise_requirements"}, {"score": 0.0029576827451501956, "phrase": "municipal_institutions"}, {"score": 0.002905686674076947, "phrase": "major_it_requirement"}, {"score": 0.0028293966058473476, "phrase": "suggested_framework"}, {"score": 0.0024189730566375215, "phrase": "key_municipal_officials"}, {"score": 0.0023834640793589435, "phrase": "main_finding"}, {"score": 0.002362408791114333, "phrase": "research_article"}, {"score": 0.0023277282036119106, "phrase": "municipal_functions"}, {"score": 0.0022399174232611853, "phrase": "corporate_it_solution"}, {"score": 0.0021940118003312397, "phrase": "data_issues"}, {"score": 0.002174626466808561, "phrase": "municipal_data_-_sources"}, {"score": 0.0021049977753042253, "phrase": "unified_municipal_data_model"}], "paper_keywords": ["GIS", " Municipal applications", " Enterprise solution", " Urban management"], "paper_abstract": "Municipalities in Saudi Arabia are working hard to make use of rapid advances in information technology (IT), especially geographic information systems (GIS), to improve their performance and increase their effectiveness. Most initiatives in IT applications, including GIS, are limited to individual departments rather than supporting comprehensive institutional operations. This has resulted in fragmented applications with isolated databases. It is obvious that the municipalities lack an overall framework to guide them through building reliable IT solutions that care for enterprise or corporate requirements. Because the Saudi municipalities share many commonalities, especially among their business functions and organizational structures, it is believed that a general framework is necessary to help them to develop their IT solutions in general and GIS applications in particular, because the majority of municipal decisions are spatially oriented. This article attempts to provide a framework for enterprise GIS for Saudi municipalities. It starts by reviewing the important issues associated with enterprise GIS to establish the basis for building a framework that is suitable for the Saudi context. The proposed GIS framework emphasizes the enterprise requirements for municipal institutions and considers GIS as a major IT requirement that can be supported by other related technologies. The suggested framework includes three main factors: business functions, tasks and data requirements. The integration of these factors provides the basis on which the municipalities can advance their aim of automating their functions. Discussion of these factors within Saudi context is presented with reference to the Municipality of Jeddah where data were based upon interviews with key municipal officials in 2004. The main finding of this research article is the identification of municipal functions and tasks that pave the way for determining applications required for the corporate IT solution. Furthermore, this article identifies data issues related to municipal data - sources, sharing and management - and calls for establishing a unified municipal data model. Finally, this article suggests that similarities among Saudi municipalities lead us to believe that IT applications can grow reasonably well by partnership among municipalities.", "paper_title": "Framework for enterprise GIS for Saudi municipalities", "paper_id": "WOS:000268719500001"}