{"auto_keywords": [{"score": 0.028532553221906464, "phrase": "general_graph"}, {"score": 0.004793617940503409, "phrase": "paths"}, {"score": 0.004688686685305843, "phrase": "common_scenario"}, {"score": 0.004666086257569752, "phrase": "competitive_location"}, {"score": 0.004205570965859848, "phrase": "inelastic_demand"}, {"score": 0.004155049685340415, "phrase": "positive_real_weight"}, {"score": 0.0040656296649390486, "phrase": "closest_facility"}, {"score": 0.003911367220315185, "phrase": "total_weight"}, {"score": 0.003681923235979914, "phrase": "p_and_r_servers"}, {"score": 0.003525074461418428, "phrase": "optimal_locations"}, {"score": 0.003358595758566157, "phrase": "p_servers"}, {"score": 0.00328625950643742, "phrase": "maximum_gain"}, {"score": 0.0032310733124059567, "phrase": "r_servers"}, {"score": 0.002954361295811154, "phrase": "discrete_case"}, {"score": 0.002855934865505357, "phrase": "absolute_case"}, {"score": 0.002530359917257626, "phrase": "strongly_polynomial_algorithms"}, {"score": 0.0023990982005125763, "phrase": "known_results"}, {"score": 0.0023702263190930033, "phrase": "first_strongly_polynomial_algorithm"}, {"score": 0.002308864220884317, "phrase": "np"}, {"score": 0.002263639474937039, "phrase": "series-parallel_graphs"}, {"score": 0.0021461840368981475, "phrase": "centroid_models"}, {"score": 0.0021049977753042253, "phrase": "first_strongly_polynomial_algorithms"}], "paper_keywords": ["Competitive location problems", " Centroids", " Paths", " Trees", " Polynomial algorithms"], "paper_abstract": "We consider a common scenario in competitive location, where two competitors (providers) place their facilities (servers) on a network, and the users, which are modeled by the nodes of the network, can choose between the providers. We assume that each user has an inelastic demand, specified by a positive real weight. A user is fully served by a closest facility. The benefit (gain) of a competitor is his market share, i.e., the total weight (demand) of the users served at his facilities. In our scenario the two providers, called the leader and the follower, sequentially place p and r servers, respectively. After the leader selects the locations for his p servers, the follower will determine the optimal locations for his r servers, that maximize his benefit. An (r,p)-centroid is a set of locations for the p servers of the leader, that will minimize the maximum gain of the follower who can establish r servers. In this paper we focus mainly on the cases where either the leader or the follower can establish only one facility, i.e., either p=1, or r=1. We consider two versions of the model. In the discrete case the facilities can be established only at the nodes, while in the absolute case they can be established anywhere on the network. For the (r,1)-centroid problem, we show that it is strongly NP-hard for a general graph, but can be approximated within a factor e/(e-1). On the other hand, when the graph is a tree, we provide strongly polynomial algorithms for the (r,p)-centroid model, whenever p is fixed. For the (1,1)-centroid problem on a general graph, we improve upon known results, and give the first strongly polynomial algorithm. The discrete (1,p)-centroid problem has been known to be NP-hard even for a subclass of series-parallel graphs with pathwidth bounded by 6. In view of this result, we consider the discrete and absolute (1,p) centroid models on a tree, and present the first strongly polynomial algorithms. Further improvements are shown when the tree is a path.", "paper_title": "Improved Algorithms for Some Competitive Location Centroid Problems on Paths, Trees and Graphs", "paper_id": "WOS:000317973900006"}