{"auto_keywords": [{"score": 0.0436624912906422, "phrase": "ehr_implementation"}, {"score": 0.020922736497245714, "phrase": "patient_visits"}, {"score": 0.009783217873565413, "phrase": "practice_productivity"}, {"score": 0.007787706547849888, "phrase": "increased_revenues"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_implementation"}, {"score": 0.004698229304089357, "phrase": "financial_impact"}, {"score": 0.004659951478263083, "phrase": "electronic_health_record"}, {"score": 0.004546970518808189, "phrase": "ambulatory_practices"}, {"score": 0.0035861227263414537, "phrase": "increased_reimbursement_rates"}, {"score": 0.003372460634140967, "phrase": "ancillary_office_procedures"}, {"score": 0.003250403288147613, "phrase": "wound_care"}, {"score": 0.003158522476399068, "phrase": "bottom_line_result"}, {"score": 0.0029100272315053253, "phrase": "productivity_losses"}, {"score": 0.0028627183712016894, "phrase": "field_reports"}, {"score": 0.0023610946923597405, "phrase": "ehr_analytics"}, {"score": 0.0022849068677290836, "phrase": "right_patients"}, {"score": 0.002266246304762945, "phrase": "conclusions_practice_reimbursements"}, {"score": 0.002184137736856711, "phrase": "long-term_decrease"}, {"score": 0.0021049977753042253, "phrase": "ambulatory_practice_context"}], "paper_keywords": ["Electronic Health Record", " Provider Productivity", " Provider Reimbursement", " Financial Impact"], "paper_abstract": "Objective To examine the financial impact of electronic health record (EHR) implementation on ambulatory practices. Methods We tracked the practice productivity (ie, number of patient visits) and reimbursement of 30 ambulatory practices for 2 years after EHR implementation and compared each practice to their pre-EHR implementation baseline. Results Reimbursements significantly increased after EHR implementation even though practice productivity (ie, the number of patient visits) decreased over the 2-year observation period. We saw no evidence of upcoding or increased reimbursement rates to explain the increased revenues. Instead, they were associated with an increase in ancillary office procedures (eg, drawing blood, immunizations, wound care, ultrasounds). Discussion The bottom line result-that EHR implementation is associated with increased revenues-is reassuring and offers a basis for further EHR investment. While the productivity losses are consistent with field reports, they also reflect a type of efficiency-the practices are receiving more reimbursement for fewer seeing patients. For the practices still seeing fewer patients after 2 years, the solution likely involves advancing their EHR functionality to include analytics. Although they may still see fewer patients, with EHR analytics, they can focus on seeing the right patients. Conclusions Practice reimbursements increased after EHR implementation, but there was a long-term decrease in the number of patient visits seen in this ambulatory practice context.", "paper_title": "The long-term financial impact of electronic health record implementation", "paper_id": "WOS:000352771500022"}