{"auto_keywords": [{"score": 0.03812022871741232, "phrase": "abstract_states"}, {"score": 0.014784883322560505, "phrase": "abstract_models"}, {"score": 0.013976177596706418, "phrase": "current_abstract_models"}, {"score": 0.013484416273430775, "phrase": "concrete_transitions"}, {"score": 0.013143646055421402, "phrase": "hyper_transitions"}, {"score": 0.010118796512593899, "phrase": "abstract_model"}, {"score": 0.00443308765153716, "phrase": "branching_time_logics"}, {"score": 0.004231699728933577, "phrase": "ordinary_transitions"}, {"score": 0.0037188360359702182, "phrase": "measured_w.r.t"}, {"score": 0.00330189927527898, "phrase": "maximal_precision"}, {"score": 0.0032176163279340206, "phrase": "new_class"}, {"score": 0.0027837615811247963, "phrase": "exponential_blowup"}, {"score": 0.00257586859792573, "phrase": "efficient_algorithm"}, {"score": 0.002471400498582011, "phrase": "model_checking"}, {"score": 0.0023834640793589414, "phrase": "maximal_precision_w.r.t"}, {"score": 0.0021049977753042253, "phrase": "abstraction-refinement_framework"}], "paper_keywords": [""], "paper_abstract": "This paper investigates both the precision and the model checking efficiency of abstract models designed to preserve branching time logics w.r.t. a 3-valued semantics. Current abstract models use ordinary transitions to over approximate the concrete transitions, while they use hyper transitions to under approximate the concrete transitions. In this work, we refer to precision measured w.r.t. the choice of abstract states, independently of the formalism used to describe abstract models. We show that current abstract models do not allow maximal precision. We suggest a new class of models and a construction of an abstract model which is most precise w.r.t. any choice of abstract states. As before, the construction of such models might involve an exponential blowup, which is inherent by the use of hyper transitions. We therefore suggest an efficient algorithm in which the abstract model is constructed during model checking, by need. Our algorithm achieves maximal precision w.r.t. the given property while remaining quadratic in the number of abstract states. To complete the picture, we incorporate it into an abstraction-refinement framework. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "3-Valued abstraction: More precision at less cost", "paper_id": "WOS:000260754400006"}