{"auto_keywords": [{"score": 0.04842950119492684, "phrase": "mind_development"}, {"score": 0.01035148608242648, "phrase": "preschoolers'_theory"}, {"score": 0.009799638612968073, "phrase": "existing_conceptual_structures"}, {"score": 0.008271618713302677, "phrase": "cognitive_adaptation"}, {"score": 0.007713388746618937, "phrase": "individual_differences"}, {"score": 0.007015136975901372, "phrase": "mind_tasks"}, {"score": 0.00481495049065317, "phrase": "load-force_adaptation"}, {"score": 0.004556901872357751, "phrase": "central_role"}, {"score": 0.004248294537944227, "phrase": "relatively_protracted_timetable"}, {"score": 0.003407549468745519, "phrase": "non-social_domain"}, {"score": 0.003306559295382181, "phrase": "twenty-five_preschoolers"}, {"score": 0.0031448288291084, "phrase": "executive_functioning_tasks"}, {"score": 0.0029611289031152856, "phrase": "unexpectedly_heavy_object"}, {"score": 0.002496722870659199, "phrase": "executive_functioning_battery"}, {"score": 0.0022810491620483737, "phrase": "children's_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Theory of mind", " Load-force adaptation", " Theory theory", " Social cognitive development", " Developmental cognitive neuroscience"], "paper_abstract": "Prominent theories of preschoolers' theory of mind development have included a central role for changing or adapting existing conceptual structures in response to experiences. Because of the relatively protracted timetable of theory of mind development, it has been difficult to test this assumption about the role of adaptation directly. To gain evidence that cognitive adaptation is particularly important for theory of mind development, we sought to determine whether individual differences in cognitive adaptation in a non-social domain predicted preschoolers' theory of mind development. Twenty-five preschoolers were tested on batteries of theory of mind tasks, executive functioning tasks, and on their ability to adapt their lifting behavior to smoothly lift an unexpectedly heavy object. Results showed that children who adapted their lifting behavior more rapidly performed better on theory of mind tasks than those who adapted more slowly. These findings held up when age and performance on the executive functioning battery were statistically controlled. Although preliminary, we argue that this relation is attributable to individual differences in children's domain general abilities to efficiently change existing conceptual structures in response to experience. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Conceptual change and preschoolers' theory of mind: Evidence from load-force adaptation", "paper_id": "WOS:000284437700011"}