{"auto_keywords": [{"score": 0.0490331333435727, "phrase": "underprivileged_students"}, {"score": 0.010473462775356794, "phrase": "online_learning_satisfaction"}, {"score": 0.010291025938336106, "phrase": "online_learning"}, {"score": 0.00481495049065317, "phrase": "learning-related_factors"}, {"score": 0.004586531354697466, "phrase": "different_purposes"}, {"score": 0.004466519142879166, "phrase": "equal_opportunity"}, {"score": 0.004292347882254774, "phrase": "korea"}, {"score": 0.004070573090297285, "phrase": "self-directed_learning_capabilities"}, {"score": 0.0030942116765996426, "phrase": "class_type"}, {"score": 0.003053402354907241, "phrase": "better_satisfaction"}, {"score": 0.0028572658971252616, "phrase": "self-study_type"}, {"score": 0.0027947199430705077, "phrase": "learning_support_function"}, {"score": 0.0026501241093379786, "phrase": "largest_influence"}, {"score": 0.002615156460073562, "phrase": "satisfaction_level"}, {"score": 0.0022696277881969896, "phrase": "assistance_models"}, {"score": 0.0022101055924375725, "phrase": "diverse_relevant_elements"}, {"score": 0.002161695357601592, "phrase": "particular_one"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distance education and telelearning", " Elementary education", " Pedagogical issue", " e-learning", " Online learning", " Online education"], "paper_abstract": "Online learning is used for different purposes such as the actualization of equal opportunity in education or excellence in education. In Korea, nationwide online learning has been launched since 2005 to boost the self-directed learning capabilities and academic achievement of underprivileged students. The purpose of this study was to examine factors affecting the online learning satisfaction of underprivileged students. The subjects in this study were 1043 students and 915 underprivileged students. The underprivileged students were found to be more satisfied with online learning than the students, and the students who were under the guidance of their online homeroom teachers (hereinafter called the students of class type) expressed better satisfaction than the others who studied on their own (hereinafter called the students of self-study type). And the learning support function (F3) was identified as the variable that exerted the largest influence on the satisfaction level of the underprivileged students. This study was significant in that it attempted to suggest what kind of assistance should be provided to raise the online learning satisfaction of underprivileged students and to set up learning assistance models geared toward underprivileged students by covering diverse relevant elements without leaning toward any particular one. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Assistance and possibilities: Analysis of learning-related factors affecting the online learning satisfaction of underprivileged students", "paper_id": "WOS:000295860100018"}