{"auto_keywords": [{"score": 0.02919282695639583, "phrase": "variable_precision_rules"}, {"score": 0.005688180880633685, "phrase": "second_algorithm"}, {"score": 0.00481495049065317, "phrase": "rough_set"}, {"score": 0.004634459424542272, "phrase": "typical_dependency"}, {"score": 0.004482063543727601, "phrase": "condition_attributes"}, {"score": 0.004418287966422041, "phrase": "real_world"}, {"score": 0.0038834787946979863, "phrase": "corresponding_disease"}, {"score": 0.003809932244103758, "phrase": "small_number_human_beings"}, {"score": 0.003529364798514874, "phrase": "standard_rough_set_method"}, {"score": 0.0034790978593553794, "phrase": "simplified_rules"}, {"score": 0.003043031131345537, "phrase": "first_algorithm"}, {"score": 0.0029996699429582835, "phrase": "typical_rough_set_method"}, {"score": 0.0027259252868643926, "phrase": "non-variable_precision_rules"}, {"score": 0.0023613185213421173, "phrase": "decernibility_matrixes"}, {"score": 0.0021049977753042253, "phrase": "computational_complexity"}], "paper_keywords": [""], "paper_abstract": "In real world, there are a lot of knowledge such as the following: most human beings that are infected by a kind of virus suffer from a corresponding disease, but a small number human beings do not. Which are the factors that negate the effects of the virus? Standard rough set method can induce simplified rules for classification, but cannot generate this kind of knowledge directly. In this paper, we propose two algorithms to find the factors. In the first algorithm, the typical rough set method is used to generate all the variable precision rules firstly; secondly reduce attributes and generate all the non-variable precision rules; lastly compare the variable precision rules and non-variable precision rules to generate the factors that negate the variable precision rules. In the second algorithm, firstly, induce all the variable precision rules; secondly, select the examples corresponding to the variable precision rules to build decernibility matrixes; thirdly, generate the factors that negate the variable precision rules. Three experimental results show that using the two algorithms can get the same results and the computational complexity of the second algorithm is largely less than the firs one.", "paper_title": "Using rough set to find the factors that negate the typical dependency of a decision attribute on some condition attributes", "paper_id": "WOS:000241790900086"}