{"auto_keywords": [{"score": 0.04811643643051334, "phrase": "public_libraries"}, {"score": 0.03611386090532678, "phrase": "cipa"}, {"score": 0.024940956049635206, "phrase": "public_schools"}, {"score": 0.004475022550508119, "phrase": "children's_internet_protection_act"}, {"score": 0.00386519448487341, "phrase": "great_amount"}, {"score": 0.0035733198242955634, "phrase": "social_institutions"}, {"score": 0.003085989256759819, "phrase": "education_research"}, {"score": 0.0029905104479072482, "phrase": "legal_background"}, {"score": 0.0028378798711397235, "phrase": "internet_access"}, {"score": 0.002678944072162297, "phrase": "perceived_value"}, {"score": 0.0026096659285441384, "phrase": "perceived_consequences"}, {"score": 0.0023254633298356894, "phrase": "dramatic_differences"}, {"score": 0.002206700502606511, "phrase": "greater_policy_context"}, {"score": 0.0021496083700137305, "phrase": "research_questions"}], "paper_keywords": [""], "paper_abstract": "Though the Children's Internet Protection Act (CIPA) established requirements for both public libraries and public schools to adopt filters on all of their computers when they receive certain federal funding, it has not attracted a great amount of research into the effects on libraries and schools and the users of these social institutions. This paper explores the implications of CIPA in terms of its effects on public libraries and public schools, individually and in tandem. Drawing from both library and education research, the paper examines the legal background and basis of CIPA, the current state of Internet access and levels of filtering in public libraries and public schools, the perceived value of CIPA, the perceived consequences of CIPA, the differences in levels of implementation of CIPA in public libraries and public schools, and the reasons for those dramatic differences. After an analysis of these issues within the greater policy context, the paper suggests research questions to help provide more data about the challenges and questions revealed in this analysis.", "paper_title": "One Law with Two Outcomes: Comparing the Implementation of CIPA in Public Libraries and Schools", "paper_id": "WOS:000263495300003"}