{"auto_keywords": [{"score": 0.03412859855504083, "phrase": "information_resources"}, {"score": 0.004691136491297242, "phrase": "formal_language"}, {"score": 0.0046390482426405324, "phrase": "multilingual_texts"}, {"score": 0.00383668723824441, "phrase": "web_pages"}, {"score": 0.003737934295442975, "phrase": "web_page"}, {"score": 0.0035744997458371335, "phrase": "chosen_natural_language"}, {"score": 0.003418186564522323, "phrase": "arbitrary_language"}, {"score": 0.0033301694494391643, "phrase": "basic_parts"}, {"score": 0.003293142761521425, "phrase": "e-speranto_interpreting_system"}, {"score": 0.0031140747752837826, "phrase": "interpretation_process"}, {"score": 0.0030001224724395354, "phrase": "e-speranto_interpreter"}, {"score": 0.0027949428646076627, "phrase": "lower_production_cost"}, {"score": 0.0026826140171754675, "phrase": "proof-of-concept_implementation"}, {"score": 0.0025940660106162404, "phrase": "slovenian"}, {"score": 0.002574788779987074, "phrase": "serbian"}, {"score": 0.0025557107385758247, "phrase": "russian"}, {"score": 0.0024529174827030787, "phrase": "similar_syntax"}, {"score": 0.0022428442879034614, "phrase": "test_documents"}, {"score": 0.0021207658298095845, "phrase": "future_development"}], "paper_keywords": ["E-speranto", " World Wide Web", " multilingual documents", " XML", " interpretation", " multilayered architecture"], "paper_abstract": "E-speranto is a formal language for generating multilingual texts on the World Wide Web. It is currently still under development. The vocabulary and grammar rules of E-speranto are based on Esperanto; the syntax of E-speranto, however, is based on XML (eXtensible Markup Language). The latter enables the integration of documents generated in E-speranto into web pages. When a user accesses a web page generated in E-speranto, the interpreter interprets the document into a chosen natural language, which enables the user to read the document in any arbitrary language supported by the interpreter. The basic parts of the E-speranto interpreting system are the interpreters and information resources, which complies with the principle of separating the interpretation process from the data itself. The architecture of the E-speranto interpreter takes advantage of the resemblance between the languages belonging to the same linguistic group, which consequently results in a lower production cost of the interpreters for the same linguistic group. We designed a proof-of-concept implementation for interpreting E-speranto in three Slavic languages: Slovenian, Serbian and Russian. These languages share many common features in addition to having a similar syntax and vocabulary. The content of the information resources (vocabulary, lexicon) was limited to the extent that was needed to interpret the test documents. The testing confirmed the applicability of our concept and also indicated the guidelines for future development of both the interpreters and E-speranto itself.", "paper_title": "The Architectural Design of a System for Interpreting Multilingual Web Documents in E-speranto", "paper_id": "WOS:000289722100003"}