{"auto_keywords": [{"score": 0.040544583678815076, "phrase": "sigma"}, {"score": 0.008663074393541748, "phrase": "pseudoinverse_learning_rule"}, {"score": 0.008492090166187074, "phrase": "cyclic_patterns"}, {"score": 0.008136881342891821, "phrase": "rhythmic_movements"}, {"score": 0.005615499927884018, "phrase": "cyclic_permutations"}, {"score": 0.0054729737602346555, "phrase": "simple_cycles"}, {"score": 0.00481495049065317, "phrase": "hopfield-type_networks"}, {"score": 0.004665891225930908, "phrase": "neuronal_activity"}, {"score": 0.0046128342233041405, "phrase": "animal_nervous_systems"}, {"score": 0.00428230507124341, "phrase": "network_connectivities"}, {"score": 0.004044193091458237, "phrase": "binary_cycles"}, {"score": 0.0038743048063966242, "phrase": "binary_matrix"}, {"score": 0.003819270233027538, "phrase": "connectivity_matrix"}, {"score": 0.003786624022366719, "phrase": "cycle's_transition_conditions"}, {"score": 0.0036171490978544607, "phrase": "structural_features"}, {"score": 0.0035965032173588753, "phrase": "admissible_cycles"}, {"score": 0.003535267442543166, "phrase": "corresponding_networks"}, {"score": 0.003348125618527277, "phrase": "nonzero_columns"}, {"score": 0.0032350520707733507, "phrase": "disjoint_subsets"}, {"score": 0.0028357713679488983, "phrase": "feedforward_chain"}, {"score": 0.002700988793510088, "phrase": "special_cases"}, {"score": 0.0026247093410046445, "phrase": "composite_cycles"}, {"score": 0.0024293180598388632, "phrase": "separable_composite_cycles"}, {"score": 0.0024085241033716736, "phrase": "completely_isolated_clusters"}, {"score": 0.0023879077085067137, "phrase": "inseparable_composite_cycles"}, {"score": 0.002216448989443201, "phrase": "successfully_retrieved_cycles"}, {"score": 0.0022037803099076423, "phrase": "continuous-time_hopfield-type_networks"}, {"score": 0.0021538240212502875, "phrase": "up-down_states"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cyclic patterns", " Hopfield-type networks", " Pseudoinverse learning rule", " Admissibility", " Network topology"], "paper_abstract": "Cyclic patterns of neuronal activity are ubiquitous in animal nervous systems, and partially responsible for generating and controlling rhythmic movements such as locomotion, respiration, swallowing and so on. Clarifying the role of the network connectivities for generating cyclic patterns is fundamental for understanding the generation of rhythmic movements. In this paper, the storage of binary cycles in Hopfield-type and other neural networks is investigated. We call a cycle defined by a binary matrix Sigma admissible if a connectivity matrix satisfying the cycle's transition conditions exists, and if so construct it using the pseudoinverse learning rule. Our main focus is on the structural features of admissible cycles and the topology of the corresponding networks. We show that Sigma is admissible if and only if its discrete Fourier transform contains exactly r = rank(Sigma) nonzero columns. Based on the decomposition of the rows of Sigma into disjoint subsets corresponding to loops, where a loop is defined by the set of all cyclic permutations of a row, cycles are classified as simple cycles, and separable or inseparable composite cycles. Simple cycles contain rows from one loop only, and the network topology is a feedforward chain with feedback to one neuron if the loop-vectors in Sigma are cyclic permutations of each other. For special cases this topology simplifies to a ring with only one feedback. Composite cycles contain rows from at least two disjoint loops, and the neurons corresponding to the loop-vectors in Sigma from the same loop are identified with a cluster. Networks constructed from separable composite cycles decompose into completely isolated clusters. For inseparable composite cycles at least two clusters are connected, and the cluster-connectivity is related to the intersections of the spaces spanned by the loop-vectors of the clusters. Simulations showing successfully retrieved cycles in continuous-time Hopfield-type networks and in networks of spiking neurons exhibiting up-down states are presented. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Storing cycles in Hopfield-type networks with pseudoinverse learning rule: Admissibility and network topology", "paper_id": "WOS:000325308900028"}