{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gene_expression_data"}, {"score": 0.049324540543845156, "phrase": "gene_sets"}, {"score": 0.03718034097391595, "phrase": "sampling_units"}, {"score": 0.03350947295400207, "phrase": "set_testing"}, {"score": 0.004701556483912018, "phrase": "methodological_issues"}, {"score": 0.004342430078306461, "phrase": "gene_ontology"}, {"score": 0.004223299391912042, "phrase": "widely_different_methodological_assumptions"}, {"score": 0.004140203942496321, "phrase": "differential_expression"}, {"score": 0.0032744315183287024, "phrase": "different_approaches"}, {"score": 0.0032099453192629976, "phrase": "preferential_methodology"}, {"score": 0.0030847461428168614, "phrase": "crucial_assumptions"}, {"score": 0.0028037753646260937, "phrase": "sampling_unit"}, {"score": 0.0026836723685046407, "phrase": "statistical_model"}, {"score": 0.0026203386550421558, "phrase": "biological_experiment"}, {"score": 0.002488183412451029, "phrase": "crucial_and_unrealistic_independence_assumption"}, {"score": 0.002316105585203396, "phrase": "simulation_experiment"}, {"score": 0.0021218313648947926, "phrase": "unnecessary_rift"}, {"score": 0.0021049977753042253, "phrase": "single_gene_testing"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many statistical tests have been proposed in recent years for analyzing gene expression data in terms of gene sets, usually from Gene Ontology. These methods are based on widely different methodological assumptions. Some approaches test differential expression of each gene set against differential expression of the rest of the genes, whereas others test each gene set on its own. Also, some methods are based on a model in which the genes are the sampling units, whereas others treat the subjects as the sampling units. This article aims to clarify the assumptions behind different approaches and to indicate a preferential methodology of gene set testing. Results: We identify some crucial assumptions which are needed by the majority of methods. P-values derived from methods that use a model which takes the genes as the sampling unit are easily misinterpreted, as they are based on a statistical model that does not resemble the biological experiment actually performed. Furthermore, because these models are based on a crucial and unrealistic independence assumption between genes, the P-values derived from such methods can be wildly anti-conservative, as a simulation experiment shows. We also argue that methods that competitively test each gene set against the rest of the genes create an unnecessary rift between single gene testing and gene set testing.", "paper_title": "Analyzing gene expression data in terms of gene sets: methodological issues", "paper_id": "WOS:000246293000009"}