{"auto_keywords": [{"score": 0.04879763532253494, "phrase": "location_prediction"}, {"score": 0.010612387000973441, "phrase": "qs-stt"}, {"score": 0.006238364121781998, "phrase": "quadsection"}, {"score": 0.005865822696213654, "phrase": "future_time"}, {"score": 0.00493630541567245, "phrase": "sequential_relationships"}, {"score": 0.004816068659187668, "phrase": "frequent_regions"}, {"score": 0.004652618420088437, "phrase": "spatial_and_temporal_information"}, {"score": 0.0046286484525233885, "phrase": "crucial_need"}, {"score": 0.004605870997059278, "phrase": "location-aware_services"}, {"score": 0.004538205894326768, "phrase": "object's_recent_movement"}, {"score": 0.0042772991345137335, "phrase": "traditional_location_prediction"}, {"score": 0.004256243266481051, "phrase": "motion_function"}, {"score": 0.004224852827988872, "phrase": "research_works"}, {"score": 0.00418335722826862, "phrase": "mining_movement_behavior"}, {"score": 0.004162761874894073, "phrase": "historical_trajectories"}, {"score": 0.00397207327140292, "phrase": "mining_movement_behaviors"}, {"score": 0.00359859325519173, "phrase": "trajectory_data"}, {"score": 0.0034336590884097495, "phrase": "temporal_information"}, {"score": 0.003228064485217067, "phrase": "spatial-temporal"}, {"score": 0.0031727293410170583, "phrase": "movement_behaviors"}, {"score": 0.0030497740719977835, "phrase": "reasonable_and_near-optimal_set"}, {"score": 0.002924335546038937, "phrase": "spatial-temporal_trajectory_model"}, {"score": 0.002895576205270499, "phrase": "object's_movement_behavior"}, {"score": 0.002874191926197893, "phrase": "probabilistic_suffix_tree"}, {"score": 0.0027153931790793295, "phrase": "corresponding_probabilities"}, {"score": 0.0024965358643826542, "phrase": "frequent_region"}, {"score": 0.0024597859192086783, "phrase": "stt"}, {"score": 0.002370243452208976, "phrase": "individual_location_prediction"}, {"score": 0.0023009592313451136, "phrase": "different_spatial_density"}, {"score": 0.0022503253892242406, "phrase": "real_trajectory"}, {"score": 0.0022336957123481036, "phrase": "different_speed"}, {"score": 0.00221718865401257, "phrase": "experimental_results"}, {"score": 0.002168394221908067, "phrase": "spatial_and_temporal_patterns"}, {"score": 0.0021049977753042253, "phrase": "existing_works"}], "paper_keywords": ["Trajectory pattern", " Movement behavior mining", " Location prediction", " Frequent region", " Spatial-temporal data"], "paper_abstract": "Location prediction is a crucial need for location-aware services and applications. Given an object's recent movement and a future time, the goal of location prediction is to predict the location of the object at the future time specified. Different from traditional location prediction using motion function, some research works have elaborated on mining movement behavior from historical trajectories for location prediction. Without loss of generality, given a set of trajectories of an object, prior works on mining movement behaviors will first extract regions of popularity, in which the object frequently appears, and then discover the sequential relationships among regions. However, the quality of the frequent regions extracted affects the accuracy of the location prediction. Furthermore, trajectory data has both spatial and temporal information. To further enhance the accuracy of location prediction, one could utilize not only spatial information but also temporal information to predict the locations of objects. In this paper, we propose a framework QS-STT (standing for QuadSection clustering and Spatial-Temporal Trajectory model) to capture the movement behaviors of objects for location prediction. Specifically, we have developed QuadSection clustering to extract a reasonable and near-optimal set of frequent regions. Then, based on the set of frequent regions, we propose a spatial-temporal trajectory model to explore the object's movement behavior as a probabilistic suffix tree with both spatial and temporal information of movements. Note that STT is not only able to discover sequential relationships among regions but also derives the corresponding probabilities of time, indicating when the object appears in each region. Based on STT, we further propose an algorithm to traverse STT for location prediction. By enhancing the quality of the frequent region extracted and exploring both the spatial and temporal information of STT, the accuracy of location prediction in QS-STT is improved. QS-STT is designed for individual location prediction. For verifying the effectiveness of QS-STT for location prediction under the different spatial density, we have conducted experiments on four types of real trajectory datasets with different speed. The experimental results show that our proposed QS-STT is able to capture both spatial and temporal patterns of movement behaviors and by exploring QS-STT, our proposed prediction algorithm outperforms existing works.", "paper_title": "QS-STT: QuadSection clustering and spatial-temporal trajectory model for location prediction", "paper_id": "WOS:000317926900005"}