{"auto_keywords": [{"score": 0.039421761528489814, "phrase": "kbe_applications"}, {"score": 0.01488145516986859, "phrase": "knowledge-based_engineering"}, {"score": 0.00481495049065317, "phrase": "knowledge-based_engineering_applications"}, {"score": 0.0042506731642425275, "phrase": "new_product_development"}, {"score": 0.0032968474833776906, "phrase": "software_services"}, {"score": 0.0030336118627011786, "phrase": "knowledge-intensive_product_development_tasks"}, {"score": 0.0027275289970185015, "phrase": "remote_software_services"}, {"score": 0.002640636493247601, "phrase": "lifecycle_management"}, {"score": 0.0025802660239538353, "phrase": "underlying_knowledge"}, {"score": 0.0025096359514694523, "phrase": "'_approach"}, {"score": 0.0023741093119014436, "phrase": "design_progresses"}, {"score": 0.0023522423291484212, "phrase": "new_insights"}, {"score": 0.002225196379204285, "phrase": "industrial_use_case"}, {"score": 0.0021843879253500894, "phrase": "conceptual_design"}, {"score": 0.002164264600379492, "phrase": "composite_aircraft_wing_covers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge Based Engineering", " KBE", " Personalization", " Codificatioh"], "paper_abstract": "Literature on Knowledge-Based Engineering (KBE) has identified challenges concerning the personalization and codification of knowledge for new product development, such as maintaining the quality, accessibility and traceability of knowledge for inspection, review and re-use, as well as managing the life-cycle of KBE applications and the knowledge contained within these applications. This paper reports on the development of a framework that realizes the management of Knowledge-Based Engineering (KBE) applications as software services, and in doing so supports the codification and personalization of knowledge that is used in performing knowledge-intensive product development tasks. The developed framework supports the elicitation and structuring of design and manufacturing knowledge, provides the capacity to run KBE applications as remote software services, and facilitates the distribution and lifecycle management of KBE applications and the underlying knowledge. A 'learning by doing' approach is supported where knowledge can both be personalized and codified as design progresses and new insights are gained. The framework has been successfully applied in an industrial use case that considers the conceptual design of composite aircraft wing covers. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A framework for management of Knowledge-Based Engineering applications as software services: Enabling personalization and codification", "paper_id": "WOS:000308122400006"}