{"auto_keywords": [{"score": 0.03413308111480944, "phrase": "tan"}, {"score": 0.02322662099357525, "phrase": "snomed_ct_target_hierarchies"}, {"score": 0.009738657105254851, "phrase": "abstraction_networks"}, {"score": 0.00626110635288464, "phrase": "quality_assurance_methodology"}, {"score": 0.00594085238895251, "phrase": "observable_entity_hierarchy"}, {"score": 0.0053685000614927415, "phrase": "large_refined_tribal_units"}, {"score": 0.004725385523804256, "phrase": "objective_large_and_complex_terminologies"}, {"score": 0.004654928974748418, "phrase": "systematized_nomenclature_of_medicine-clinical"}, {"score": 0.004383406949799696, "phrase": "compact_summarizations"}, {"score": 0.004127657126534723, "phrase": "terminology_quality_assurance"}, {"score": 0.003990385737207714, "phrase": "abstraction_network_derivation_methodology"}, {"score": 0.003356675879109443, "phrase": "hierarchy_root"}, {"score": 0.0032694619052789768, "phrase": "multiple_parents"}, {"score": 0.002987236799291296, "phrase": "exactly_the_same_multiple_tribes"}, {"score": 0.0028986672783671147, "phrase": "refined_tribal_units"}, {"score": 0.0028661330049356186, "phrase": "closely_related_concepts"}, {"score": 0.0028021527740710508, "phrase": "tan_summarizations"}, {"score": 0.00266837303806956, "phrase": "snomed_ct"}, {"score": 0.0026087958216676702, "phrase": "tan-based_quality_assurance_review"}, {"score": 0.002502995662011305, "phrase": "erroneous_concepts"}, {"score": 0.0024014759148123736, "phrase": "small_refined_tribal_units"}, {"score": 0.0021049977753042253, "phrase": "snomed_ct."}], "paper_keywords": ["SNOMED CT", " terminology quality assurance", " abstraction network", " terminology without lateral relationships", " hierarchical abstraction network", " terminology summarization"], "paper_abstract": "Objective Large and complex terminologies, such as Systematized Nomenclature of Medicine-Clinical Terms (SNOMED CT), are prone to errors and inconsistencies. Abstraction networks are compact summarizations of the content and structure of a terminology. Abstraction networks have been shown to support terminology quality assurance. In this paper, we introduce an abstraction network derivation methodology which can be applied to SNOMED CT target hierarchies whose classes are defined using only hierarchical relationships (ie, without attribute relationships) and similar description-logic-based terminologies. Methods We introduce the tribal abstraction network (TAN), based on the notion of a tribe-a subhierarchy rooted at a child of a hierarchy root, assuming only the existence of concepts with multiple parents. The TAN summarizes a hierarchy that does not have attribute relationships using sets of concepts, called tribal units that belong to exactly the same multiple tribes. Tribal units are further divided into refined tribal units which contain closely related concepts. A quality assurance methodology that utilizes TAN summarizations is introduced. Results A TAN is derived for the Observable entity hierarchy of SNOMED CT, summarizing its content. A TAN-based quality assurance review of the concepts of the hierarchy is performed, and erroneous concepts are shown to appear more frequently in large refined tribal units than in small refined tribal units. Furthermore, more erroneous concepts appear in large refined tribal units of more tribes than of fewer tribes. Conclusions In this paper we introduce the TAN for summarizing SNOMED CT target hierarchies. A TAN was derived for the Observable entity hierarchy of SNOMED CT. A quality assurance methodology utilizing the TAN was introduced and demonstrated.", "paper_title": "A tribal abstraction network for SNOMED CT target hierarchies without attribute relationships", "paper_id": "WOS:000356717100017"}