{"auto_keywords": [{"score": 0.028775236594626274, "phrase": "advanced_multi-phase_trust_evaluation_model"}, {"score": 0.00481495049065317, "phrase": "dynamic_virtual_project_teams"}, {"score": 0.004700468701207975, "phrase": "commercial_practices"}, {"score": 0.0046256566852302256, "phrase": "information_and_communication_technologies"}, {"score": 0.004286171444202565, "phrase": "limited_labor"}, {"score": 0.004167451906343558, "phrase": "major_challenges"}, {"score": 0.004101096890734065, "phrase": "vpt"}, {"score": 0.003971502222405927, "phrase": "particularly_crucial_issue"}, {"score": 0.003939748053452577, "phrase": "vpt_success"}, {"score": 0.003908246778916674, "phrase": "numerous_project_tasks"}, {"score": 0.0038305869305614504, "phrase": "team_members"}, {"score": 0.003769567397860168, "phrase": "functional_expertise"}, {"score": 0.0035067452724203124, "phrase": "different_assessments"}, {"score": 0.0034647524666821614, "phrase": "different_phases"}, {"score": 0.0033417571465258, "phrase": "previously_proposed_trust_evaluation_model"}, {"score": 0.0029862549873935496, "phrase": "worker_reliability"}, {"score": 0.0023182554418193927, "phrase": "original_model"}, {"score": 0.002244876254113051, "phrase": "different_project_phases"}, {"score": 0.0022179605282337395, "phrase": "vpt_workers"}, {"score": 0.0021738146596180404, "phrase": "secure_resource_sharing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Trust", " Virtual project team", " Resource sharing", " Collaboration"], "paper_abstract": "With the globalization of commercial practices and advances in information and communication technologies, increasing numbers of enterprises and workers are establishing cross-functional, geographically distributed virtual project teams (VPTs) to maximize competitive advantage from limited labor and resources. One of the major challenges for workers in VPT is developing trust. Trust is a particularly crucial issue for VPT success because numerous project tasks are interdependent, making team members reliant on the functional expertise of their partners. The challenge to develop trust is particularly complex because trust should consider various factors into different assessments made during different phases of a VPT. This study first introduces a previously proposed trust evaluation model for evaluating trust over the lifecycle of VPTs. The original method, which comprises a method for evaluating trust between two VPT workers and a method for evaluating worker reliability. in which direct, indirect and negative trust relationships are considered in calculating trust between workers. This study aims to improve this method and then design an advanced multi-phase trust evaluation model, which comprises calculus-based, contribution-based and affective-based trust evaluation sub-models for evaluating trust during three different VPT phases (early, middle and late project phases). The advanced multi-phase trust evaluation model is a more appropriate means of assessing degree of trust among coworkers than the original model. Therefore, using the three sub-models during different project phases can assist VPT workers in making more accurate decisions regarding secure resource sharing with other coworkers. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Advanced multi-phase trust evaluation model for collaboration between coworkers in dynamic virtual project teams", "paper_id": "WOS:000267179500041"}