{"auto_keywords": [{"score": 0.04174521107717199, "phrase": "transmission_delay"}, {"score": 0.022804448419488484, "phrase": "transmission_pipelining"}, {"score": 0.02124277362453623, "phrase": "power_consumption"}, {"score": 0.020313688128237084, "phrase": "control_packets"}, {"score": 0.019630172630451144, "phrase": "node_grouping"}, {"score": 0.01837849171680154, "phrase": "different_groups"}, {"score": 0.018042281020857247, "phrase": "sensor_node"}, {"score": 0.015520349240699232, "phrase": "group_table"}, {"score": 0.010361498679664613, "phrase": "wireless_sensor_networks"}, {"score": 0.010261362422922367, "phrase": "smac"}, {"score": 0.00481495049065317, "phrase": "low_power"}, {"score": 0.004789272640417375, "phrase": "low_latency_mac_protocol"}, {"score": 0.004564219532677855, "phrase": "periodical_sleep"}, {"score": 0.00437302709192313, "phrase": "channel_utilization"}, {"score": 0.0041786160019500265, "phrase": "increased_transmission_latency"}, {"score": 0.0037544644262310525, "phrase": "different_time"}, {"score": 0.003474040683217655, "phrase": "contention_period"}, {"score": 0.003121183062764093, "phrase": "group_indices"}, {"score": 0.0029347124880572174, "phrase": "group_time"}, {"score": 0.002751968796076333, "phrase": "multi-hop_path"}, {"score": 0.0025944417620244924, "phrase": "next_receiver"}, {"score": 0.002559913463313091, "phrase": "transmission_delay_increases"}, {"score": 0.0024922258873137093, "phrase": "transmission_pipelining_method"}, {"score": 0.00245905458142094, "phrase": "group_number"}, {"score": 0.0023120501704065777, "phrase": "sink_node_pipelining"}, {"score": 0.0022873943573862125, "phrase": "simulation_results"}], "paper_keywords": ["Wireless sensor networks (WSNs)", " MAC", " Low power", " Transmission delay"], "paper_abstract": "In wireless sensor networks (WSNs), the strategies of periodical sleep and contention to use the channel for transmission are efficient in terms of power consumption and channel utilization. However, contention and sleep cause other power consumption problems, namely the overhearing Of the control packets and increased transmission latency. In this paper, we propose the use of node grouping and transmission pipelining to reduce power consumption and transmission delay. In the design of node grouping, there are several groups in a WSN, where nodes in different groups wake up at different time. Each sensor node is initially set to belong to one of these groups. In contrast to the situation in which all nodes hear the control packets during the contention period, node grouping reduce the number of nodes that overhears the control packets at the same time to reduce power consumption, To establish communication between nodes belonging to different groups, we assign a group table to each node. The group table recodes the group indices of all the neighbors of that node. With looking up a group table in a sensor node, a sender can wake up at the group time of the receiver. As a result, two nodes belonging to different groups can communicate with other. With regard to transmission delay of a multi-hop path in WSNs, if a sender transmits data to the receiver and the receiver cannot send the data to the next receiver right now, the transmission delay increases. To reduce the transmission delay. we propose the transmission pipelining method. Transmission pipelining makes the group number of the nodes on a path to be continuous. Therefore, the sensor node is thus able to transmit data to the sink node pipelining. From the simulation results, when the number of groups is 2, the power consumed in transmitting a byte (mj/byte) and the transmission delay in our proposed design are better than those of SMAC by about 50%. When the number of groups is 4, although the transmission delay is only a little better than that of SMAC, the power consumed in transmitting a byte in our proposed design is much less than the power consumed in SMAC by 75%. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Design of a low power and low latency MAC protocol with node grouping and transmission pipelining in wireless sensor networks", "paper_id": "WOS:000259945700019"}