{"auto_keywords": [{"score": 0.03779444038009023, "phrase": "ooi"}, {"score": 0.012227740460027208, "phrase": "discrimination_function"}, {"score": 0.012122093248952786, "phrase": "ooi."}, {"score": 0.008713764663609583, "phrase": "modified_geodesic_active_contour_method"}, {"score": 0.006916620219195598, "phrase": "new_stopping_function"}, {"score": 0.006121123334689644, "phrase": "sample_pixels"}, {"score": 0.00462919213721188, "phrase": "novel_variational_method"}, {"score": 0.004588891098290524, "phrase": "color_image_segmentation"}, {"score": 0.0041136473765874815, "phrase": "main_novelty"}, {"score": 0.00397217701571219, "phrase": "stopping_function"}, {"score": 0.0038862297330905836, "phrase": "usual_geodesic_active_contour_method"}, {"score": 0.003453140302583322, "phrase": "pixel_properties"}, {"score": 0.003219553875143356, "phrase": "principal_component_analysis"}, {"score": 0.00270221723573854, "phrase": "image_gradient"}, {"score": 0.002552628669352939, "phrase": "color_information"}, {"score": 0.002443206010337041, "phrase": "active_contour_methods"}, {"score": 0.002287783663138828, "phrase": "unwanted_objects"}, {"score": 0.0021049977753042253, "phrase": "even_the_background"}], "paper_keywords": ["color image segmentation", " object(s) of interest", " discrimination function", " geodesic active contour", " principal component analysis", " interval estimation"], "paper_abstract": "In this paper, we propose a novel variational method for color image segmentation using modified geodesic active contour method. Our goal is to detect Object(s) of Interest (OOI) from a given color image, regardless of other objects. The main novelty of our method is that we modify the stopping function in the functional of usual geodesic active contour method so that the new stopping function is coupled by a discrimination function of OOI. By minimizing the functional, the OOI is segmented. Firstly, we study the pixel properties of the OOI by sample pixels visually chosen from OOI. From these sample pixels, by the principal component analysis and interval estimation, the discrimination function of whether a pixel is in the OOI is obtained probabilistically. Then we propose the energy functional for the segmentation of OOI with new stopping function. Unlike usual stopping functions defined by the image gradient, our improved stopping function depends on not only the image gradient but also the discrimination function derived from the color information of OOI. As a result, better than usual active contour methods which detect all objects in the image, our modified active contour method can detect OOI but without unwanted objects. Experiments are conducted in both synthetic and natural images. The result shows that our algorithm is very efficient for detecting OOI even the background is complicated.", "paper_title": "Color image segmentation for objects of interest with modified geodesic active contour method", "paper_id": "WOS:000243465400004"}