{"auto_keywords": [{"score": 0.049764804068700534, "phrase": "integrity_trust"}, {"score": 0.02573048914720927, "phrase": "service_provider"}, {"score": 0.010612387000973441, "phrase": "location_personalization"}, {"score": 0.009619631840995414, "phrase": "individuals'_intentions"}, {"score": 0.009525563602523589, "phrase": "mobile_services"}, {"score": 0.00943240647552992, "phrase": "current_research"}, {"score": 0.00737560889733355, "phrase": "field_study"}, {"score": 0.004705278218845159, "phrase": "mobile_merchants"}, {"score": 0.004613254605667248, "phrase": "mobile_personalization"}, {"score": 0.00422082596936636, "phrase": "important_feature"}, {"score": 0.003786062857121556, "phrase": "individuals'_perceptions"}, {"score": 0.0034409976875396596, "phrase": "eight_hypotheses"}, {"score": 0.0033075503163659055, "phrase": "self-developed_mobile_system"}, {"score": 0.00327500240690856, "phrase": "personalized_lunch_venue_recommendations"}, {"score": 0.0029373757799982356, "phrase": "participants'_perceptions"}, {"score": 0.00291806687851358, "phrase": "location_accuracy"}, {"score": 0.00289888453546698, "phrase": "location_precision"}, {"score": 0.002758968636750223, "phrase": "privacy_concerns"}, {"score": 0.002713842991944533, "phrase": "one's_intentions"}, {"score": 0.0026871217010784143, "phrase": "personalized_mobile_services"}, {"score": 0.002660662813907647, "phrase": "integrity_distrust"}, {"score": 0.0025999315182615823, "phrase": "empirical_evidence"}, {"score": 0.002324055400492893, "phrase": "genuine_personalized_mobile_services"}, {"score": 0.002293582591899972, "phrase": "substantial_investment"}, {"score": 0.002278496007505835, "phrase": "location_detection_technologies"}, {"score": 0.0021049977753042253, "phrase": "strong_incentive"}], "paper_keywords": ["Distrust", " integrity", " location personalization", " mobile personalization", " trust"], "paper_abstract": "Despite the proliferation of mobile personalization worldwide, the research to date is not definitive regarding the effectiveness of personalization on influencing individuals' intentions to use mobile services. The current research examines how an important feature of mobile services-location personalization-affects individuals' intentions to use these services. Specifically, the current research considers two features of location personalization, namely location accuracy and location precision, and examines how individuals' perceptions of these features affect their integrity trust and integrity distrust in the merchant who provides these services, which in turn affect their intentions to use the services. We developed eight hypotheses. To test them, we conducted a field study with a self-developed mobile system that provided personalized lunch venue recommendations. We recruited 236 participants to take part in the field study. After two weeks, they completed a questionnaire to report their perceptions and intentions to use the service. Our results show that the participants' perceptions of location accuracy and location precision positively affected both integrity trust and integrity distrust ( either directly or through moderation by privacy concerns). Integrity trust increases one's intentions to use personalized mobile services, whereas integrity distrust decreases it. This research provides empirical evidence to illustrate the coexistence of integrity trust and integrity distrust-on the one hand, an individual trusts the integrity of a service provider because the service provider is likely to continue keeping its promise of providing genuine personalized mobile services after making a substantial investment in location detection technologies; on the other hand, the individual distrusts the integrity of a service provider because subsequent to this investment, the service provider has a strong incentive to cheat in order to justify the investment.", "paper_title": "The Effects of Location Personalization on Integrity Trust and Integrity Distrust in Mobile Merchants", "paper_id": "WOS:000320121000003"}