{"auto_keywords": [{"score": 0.028017230475481696, "phrase": "finite_state_automata"}, {"score": 0.00481495049065317, "phrase": "protocol_conformance"}, {"score": 0.004780633011300165, "phrase": "agent_interoperability"}, {"score": 0.00472961267657106, "phrase": "open_multi-agent_systems_agent_interaction"}, {"score": 0.004040688646993609, "phrase": "priori_conformance_test"}, {"score": 0.003708033700676924, "phrase": "agreed_protocol"}, {"score": 0.003552084379143929, "phrase": "existing_proposals"}, {"score": 0.003526735797659508, "phrase": "conformance_tests"}, {"score": 0.003451766520526601, "phrase": "agents'_capability"}, {"score": 0.0032016639006812826, "phrase": "priori_conformance"}, {"score": 0.0031561148083611647, "phrase": "agent's_conversation_policy"}, {"score": 0.003023307182674672, "phrase": "formal_languages"}, {"score": 0.0029909851863915283, "phrase": "conformance_test"}, {"score": 0.0028548578165712643, "phrase": "special_finite_state_automaton"}, {"score": 0.002686124293881678, "phrase": "multi-agent_systems"}, {"score": 0.0025455220351023465, "phrase": "wide_variety"}, {"score": 0.002455889980202819, "phrase": "protocol_implementation"}, {"score": 0.002327310963701377, "phrase": "easy_applicability"}, {"score": 0.0022777800735119405, "phrase": "logic-based_language"}, {"score": 0.002174041708084857, "phrase": "concrete_example"}, {"score": 0.0021354096283081317, "phrase": "language_dylog"}, {"score": 0.0021049977753042253, "phrase": "computational_logic"}], "paper_keywords": [""], "paper_abstract": "In open multi-agent systems agent interaction is usually ruled by public protocols defining the rules the agents should respect in message exchanging. The respect of such rules guarantees interoperability. Given two agents that agree on using a certain protocol for their interaction, a crucial issue (known as '' a priori conformance test '') is verifying if their interaction policies, i.e. the programs that encode their communicative behavior, will actually produce interactions which are conformant to the agreed protocol. An issue that is not always made clear in the existing proposals for conformance tests is whether the test preserves agents' capability of interacting, besides certifying the legality of their possible conversations. This work proposes an approach to the verification of a priori conformance, of an agent's conversation policy to a protocol, which is based on the theory of formal languages. The conformance test is based on the acceptance of both the policy and the protocol by a special finite state automaton and it guarantees the interoperability of agents that are individually proved conformant. Many protocols used in multi-agent systems can be expressed as finite state automata, so this approach can be applied to a wide variety of cases with the proviso that both the protocol specification and the protocol implementation can be translated into finite state automata. In this sense the approach is general. Easy applicability to the case when a logic-based language is used to implement the policies is shown by means of a concrete example, in which the language DyLOG, based on computational logic, is used.", "paper_title": "Verification of protocol conformance and agent interoperability", "paper_id": "WOS:000237506800015"}