{"auto_keywords": [{"score": 0.044286791418152734, "phrase": "soft_human_tissue"}, {"score": 0.04359212832635725, "phrase": "compliance_discrimination"}, {"score": 0.04331718495335503, "phrase": "direct_vision"}, {"score": 0.034235324860668825, "phrase": "control_task"}, {"score": 0.03326470358782364, "phrase": "visual_cues"}, {"score": 0.00481495049065317, "phrase": "psychophysical_experiment"}, {"score": 0.004552902997092495, "phrase": "specific_focus"}, {"score": 0.0044199701363984495, "phrase": "twelve_participants"}, {"score": 0.004057258742593542, "phrase": "computer_monitor"}, {"score": 0.0037736090925144807, "phrase": "silicone_stimuli"}, {"score": 0.003429675062587355, "phrase": "video_recordings"}, {"score": 0.0030559337757849634, "phrase": "psychometric_functions"}, {"score": 0.003035847903759329, "phrase": "group_behavior"}, {"score": 0.002758968636750223, "phrase": "latter_task"}, {"score": 0.0027408292745619233, "phrase": "higher_compliance_discriminability"}, {"score": 0.002625788054806854, "phrase": "haptic_information"}, {"score": 0.0026085220231994955, "phrase": "similar_compliance_discriminability"}, {"score": 0.002523875743494305, "phrase": "visual_information"}, {"score": 0.0024099543488850924, "phrase": "direct_visual_conditions"}, {"score": 0.002339442939538854, "phrase": "direct_cutaneous_information"}, {"score": 0.0022118223311537954, "phrase": "cross-modal_integration"}, {"score": 0.0021972723598946446, "phrase": "visual_and_haptic_sensory_information"}, {"score": 0.00215419297939962, "phrase": "key_implications"}, {"score": 0.0021189380172266454, "phrase": "new_surgical_tools"}, {"score": 0.0021049977753042253, "phrase": "training_systems"}], "paper_keywords": [""], "paper_abstract": "This article describes a psychophysical experiment that investigates the effect of the source of vision on the perception of compliance with a specific focus on palpation, a basic surgical task. Twelve participants were asked to complete 4 forced-choice compliance discrimination tasks representing different modes of surgery when assessing soft human tissue. These tasks were compliance discrimination using direct vision, indirect vision on a computer monitor, only haptic information, and only indirect visual information. In the first 3 tasks, the subjects actively indented pairs of silicone stimuli covering a range of compliances simulating soft human tissue using a tool and were asked to choose which stimulus within each pair felt harder. In the 4th task, participants watched video recordings of the stimuli being indented on a monitor without touching the stimuli themselves. As a control task, participants performed discriminations using their index finger without any visual cues present. The results were used to determine psychometric functions of group behavior for all conditions. These functions suggest that participants performed best during the control task followed by that involving a combination of touch using tool and direct vision. The latter task presented higher compliance discriminability than the 3 remaining tasks. Moreover, the task using only indirect vision without any haptic information presented similar compliance discriminability to that using only touch through a tool without any visual information. It is concluded that although compliance discrimination via a tool is achievable under direct visual conditions, it remains significantly more challenging than through direct cutaneous information. The research shows the importance of visual cues for the discrimination of compliance as well as cross-modal integration of visual and haptic sensory information in compliance discrimination, with key implications for the development of new surgical tools and training systems.", "paper_title": "The Effect of Vision on Discrimination of Compliance Using a Tool", "paper_id": "WOS:000342443300005"}