{"auto_keywords": [{"score": 0.03674538296249271, "phrase": "harmony_search_algorithm"}, {"score": 0.030424249019695215, "phrase": "hss"}, {"score": 0.014277878771607242, "phrase": "high_interaction_strength"}, {"score": 0.00481495049065317, "phrase": "harmony-search-based_variable-strength_t-way_testing_strategy"}, {"score": 0.003964007795174772, "phrase": "aforementioned_issues"}, {"score": 0.00342568771304873, "phrase": "harmony_search_strategy"}, {"score": 0.0030147970456037274, "phrase": "variable-strength_t-way_strategy"}, {"score": 0.0029067776163335924, "phrase": "java"}, {"score": 0.002685558057339722, "phrase": "benchmarking_results"}, {"score": 0.0026050445177883005, "phrase": "competitive_results"}, {"score": 0.002481200970201421, "phrase": "al-based"}, {"score": 0.0022236070278432575, "phrase": "al-based_t-way_strategies"}, {"score": 0.0021569129153653777, "phrase": "pure_computational-based_strategies"}, {"score": 0.0021049977753042253, "phrase": "test_size"}], "paper_keywords": ["Variable-strength t-way testing", " Combinatorial testing", " Harmony search algorithm"], "paper_abstract": "Context: Although useful, Al-based variable strength t-way strategies are lacking in terms of the support for high interaction strength. Additionally, most Al-based strategies generally do not address the support for constraints. Addressing the aforementioned issues, this paper elaborates the design, implementation, and evaluation of a novel variable-strength-based on harmony search algorithm, called Harmony Search Strategy (HSS). Objective: The objective of this work is to investigate the adoption of harmony search algorithm for constructing variable-strength t-way strategy. Method: Implemented in Java, HSS integrates the harmony search algorithm as parts of its search engine. Result: Benchmarking results demonstrate that HSS gives competitive results against most existing Al-based (and pure computational) counterparts. However, unlike other Al-based counterparts, HSS addresses the support for high interaction strength and permits the support for constraints. Conclusion: Al-based t-way strategies tend to outperform the pure computational-based strategies in terms of test size. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Design and implementation of a harmony-search-based variable-strength t-way testing strategy with constraints support", "paper_id": "WOS:000302587100003"}