{"auto_keywords": [{"score": 0.029420333683948783, "phrase": "ligand-target_interactions"}, {"score": 0.00481495049065317, "phrase": "three-dimensional_activity_cliffs"}, {"score": 0.004649474569983707, "phrase": "public_domain_x-ray_structures"}, {"score": 0.00450933377534525, "phrase": "multiple_ligands"}, {"score": 0.004186253035932442, "phrase": "well-defined_potency_measurements"}, {"score": 0.004095692768056685, "phrase": "pairwise_manner"}, {"score": 0.003954837422946628, "phrase": "previously_reported_property_density_function-based_method"}, {"score": 0.003623453648863547, "phrase": "cliff_criteria"}, {"score": 0.0031223774204093713, "phrase": "binding_modes"}, {"score": 0.003068166587650604, "phrase": "high_crystallographic_resolution"}, {"score": 0.002923876831533028, "phrase": "different_categories"}, {"score": 0.002860546817196148, "phrase": "crystallographic_interaction_patterns"}, {"score": 0.0026321198895843173, "phrase": "short-range_interactions"}, {"score": 0.0025977542995083624, "phrase": "x-ray_structures"}, {"score": 0.002541469965286169, "phrase": "possible_reasons"}, {"score": 0.0025192983141887285, "phrase": "cliff_formation"}, {"score": 0.0024007585788965655, "phrase": "activity_cliffs"}, {"score": 0.002218668420806254, "phrase": "energy_functions"}, {"score": 0.0021993066642488237, "phrase": "structure-based_design"}, {"score": 0.0021516366862117707, "phrase": "identified_activity_cliffs"}, {"score": 0.0021049977753042253, "phrase": "subsequent_structure-based_analyses"}], "paper_keywords": [""], "paper_abstract": "Activity cliffs were systematically extracted from public domain X-ray structures of targets for which complexes with multiple ligands were available, following the concept of three-dimensional (3D) cliffs. Binding modes of ligands with well-defined potency measurements were compared in a pairwise manner, and their 3D similarity was calculated using a previously reported property density function-based method taking conformational, positional, and chemical differences into account. Requiring the presence of at least 80% 3D similarity and a potency difference of at least 2 orders of magnitude as cliff criteria, a total of 216 well-defined 3D activity cliffs were detected in the Protein Data Bank (PDB). These 3D-cliffs involved a total of 269 ligands active against 38 different targets belonging to 17 protein families. For 255 of these compounds, binding modes were available at high crystallographic resolution. All 3D-cliffs were analyzed in detail and assigned to different categories on the basis of crystallographic interaction patterns. In many instances, differences in ligand-target interactions suggested plausible causes for origins of 3D-cliffs. In other cases, short-range interactions seen in X-ray structures were insufficient to deduce possible reasons for cliff formation. The 3D-cliffs described herein further advance the rationalization of activity cliffs at the level of ligand-target interactions and should also be useful for other applications such as the calibration of energy functions for structure-based design. The pool of identified activity cliffs is provided to enable subsequent structure-based analyses of cliffs.", "paper_title": "Systematic Identification and Classification of Three-Dimensional Activity Cliffs", "paper_id": "WOS:000305588100006"}