{"auto_keywords": [{"score": 0.03604907422462016, "phrase": "web-based_intervention"}, {"score": 0.00448332888936155, "phrase": "promising_tool"}, {"score": 0.00443308765153716, "phrase": "health_behavior_change_programs"}, {"score": 0.004318027255281003, "phrase": "participant_engagement"}, {"score": 0.004005410765048467, "phrase": "internet-based_health_intervention"}, {"score": 0.003771631577951067, "phrase": "prescribed_intervals"}, {"score": 0.003356675879109443, "phrase": "six_surveys"}, {"score": 0.0032694619052789768, "phrase": "demographic_and_clinical_characteristics"}, {"score": 0.0032085525502105836, "phrase": "self-efficacy_beliefs"}, {"score": 0.003032528228056611, "phrase": "descriptive_statistics"}, {"score": 0.0027706987570488084, "phrase": "positive_outcome"}, {"score": 0.0027499252661633525, "phrase": "self_efficacy"}, {"score": 0.0026986685585382347, "phrase": "increased_engagement"}, {"score": 0.0026087958216676702, "phrase": "significantly_less_frequent_use"}, {"score": 0.0022022878843247274, "phrase": "recommended_behaviors"}, {"score": 0.0021530945641993152, "phrase": "efficacy_expectations"}, {"score": 0.0021369416775353124, "phrase": "asthma_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd"}], "paper_keywords": ["Internet", " Access to information", " Health care seeking behavior"], "paper_abstract": "Purpose: The Internet is a promising tool for delivering health behavior change programs although such interventions raise questions about participant engagement in this medium. In this study we sought to determine the characteristics of parents who engage in an Internet-based health intervention for their children (with asthma) and to distinguish parents who engage at the prescribed intervals versus those who engage less often. Methods: N = 283 parents with children who had asthma were recruited and randomized to receive a web-based intervention. Participants filled out six surveys over a 6-month period asking them about demographic and clinical characteristics, outcome expectations and self-efficacy beliefs regarding asthma control for their child, and attitudes about computers and the Internet. Descriptive statistics were used to describe the population and analyze associations. Results: Controller use and being adherent to this medication as well as positive outcome and self efficacy expectations were associated with increased engagement. Parents who logged on only once reported significantly less frequent use of the Internet than parents who logged on to all sessions. Discussion and conclusion: The results of this study suggest that it is important to find ways to increase engagement in a web-based intervention for parents who are not yet engaging in the recommended behaviors and/or who report less positive outcome and efficacy expectations around asthma management. Published by Elsevier Ireland Ltd", "paper_title": "Engagement in \"My Child's Asthma\", an interactive web-based pediatric asthma management intervention", "paper_id": "WOS:000296493000003"}