{"auto_keywords": [{"score": 0.04440921591961226, "phrase": "critical_research"}, {"score": 0.00481495049065317, "phrase": "conducting_critical_research"}, {"score": 0.004764859786310636, "phrase": "information_systems."}, {"score": 0.004545793387330536, "phrase": "interpretive_research"}, {"score": 0.0037456980766939836, "phrase": "information_systems"}, {"score": 0.0035920758080335655, "phrase": "critical_research_perspective"}, {"score": 0.0032012284065895537, "phrase": "fixed_set"}, {"score": 0.0030378759123133644, "phrase": "multiple_approaches"}, {"score": 0.0021383680500215267, "phrase": "important_subject"}, {"score": 0.0021049977753042253, "phrase": "critical_research_methodology"}], "paper_keywords": ["Research methods", " critical research", " interpretive perspective", " critical perspective", " ethics", " values"], "paper_abstract": "While criteria or principles for conducting positivist and interpretive research have been widely discussed in the IS research literature, criteria or principles for critical research are lacking. Therefore, the purpose of this paper is to propose a set of principles for the conduct of critical research in information systems. We examine the nature of the critical research perspective, clarify; its significance, and review its major discourses, recognizing that its mission and methods cannot be captured by a fixed set of criteria once and for all, particularly as multiple approaches are still in the process of defining their identity However, we suggest it is possible to formulate a set of principles capturing some of the commonalities of those approaches that have so far become most visible in the IS research literature. The usefulness of the principles is illustrated by analyzing three critical field studies in information systems. We hope that this paper will further reflection and debate on the important subject of grounding critical research methodology.", "paper_title": "A SET OF PRINCIPLES FOR CONDUCTING CRITICAL RESEARCH IN INFORMATION SYSTEMS", "paper_id": "WOS:000287637200003"}