{"auto_keywords": [{"score": 0.04256754260406186, "phrase": "hypothesis_testing_methods"}, {"score": 0.011475522214632864, "phrase": "feature_spectra"}, {"score": 0.00481495049065317, "phrase": "fault_localization"}, {"score": 0.0047631192993526465, "phrase": "major_activity"}, {"score": 0.004728874038094706, "phrase": "program_debugging"}, {"score": 0.004644329185633612, "phrase": "time-consuming_task"}, {"score": 0.004447509888681154, "phrase": "suspicious_program_elements"}, {"score": 0.0041079938275505575, "phrase": "statistical_models"}, {"score": 0.003948043391567917, "phrase": "proposed_program_features"}, {"score": 0.003891430578662587, "phrase": "failed_executions"}, {"score": 0.0036333693364337953, "phrase": "specific_distributions"}, {"score": 0.003380129564214184, "phrase": "underlying_distribution"}, {"score": 0.003190265467214105, "phrase": "real-life_feature_spectra"}, {"score": 0.003110579040263398, "phrase": "fault-localization_techniques"}, {"score": 0.00296781730323553, "phrase": "core_concept"}, {"score": 0.0029252191241632888, "phrase": "predicate-based_fault-localization_framework"}, {"score": 0.002406415352892016, "phrase": "case_study"}, {"score": 0.002198380879018061, "phrase": "non-parametric_hypothesis_testing_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fault localization", " Hypothesis testing", " Parametric method", " Non-parametric method"], "paper_abstract": "Fault localization is a major activity in program debugging. To automate this time-consuming task, many existing fault-localization techniques compare passed executions and failed executions, and suggest suspicious program elements, such as predicates or statements, to facilitate the identification of faults. To do that, these techniques propose statistical models and use hypothesis testing methods to test the similarity or dissimilarity of proposed program features between passed and failed executions. Furthermore, when applying their models, these techniques presume that the feature spectra come from populations with specific distributions. The accuracy of using a model to describe feature spectra is related to and may be affected by the underlying distribution of the feature spectra, and the use of a (sound) model on inapplicable circumstances to describe real-life feature spectra may lower the effectiveness of these fault-localization techniques. In this paper, we make use of hypothesis testing methods as the core concept in developing a predicate-based fault-localization framework. We report a controlled experiment to compare, within our framework, the efficacy, scalability, and efficiency of applying three categories of hypothesis testing methods, namely, standard non-parametric hypothesis testing methods, standard parametric hypothesis testing methods, and debugging-specific parametric testing methods. We also conduct a case study to compare the effectiveness of the winner of these three categories with the effectiveness of 33 existing statement-level fault-localization techniques. The experimental results show that the use of non-parametric hypothesis testing methods in our proposed predicate-based fault-localization model is the most promising. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Non-parametric statistical fault localization", "paper_id": "WOS:000290073600001"}