{"auto_keywords": [{"score": 0.031263928612548154, "phrase": "gbr"}, {"score": 0.007791207945009494, "phrase": "web_page"}, {"score": 0.00761591984288181, "phrase": "untrustworthy_side"}, {"score": 0.00481495049065317, "phrase": "web_spam"}, {"score": 0.004771196027464407, "phrase": "trust-distrust_propagation"}, {"score": 0.0046848707075530256, "phrase": "semi-automatic_anti-spam_algorithms"}, {"score": 0.004475798524102238, "phrase": "good_seed_pages"}, {"score": 0.00429558848734449, "phrase": "bad_seed_pages"}, {"score": 0.004237138632255772, "phrase": "entire_web"}, {"score": 0.004085115444878828, "phrase": "combined_usage"}, {"score": 0.0039027036493682887, "phrase": "better_results"}, {"score": 0.0025162511343171, "phrase": "experimental_results"}, {"score": 0.002349357968054711, "phrase": "comparable_performance"}, {"score": 0.0022340339240168846, "phrase": "tdr"}, {"score": 0.0021537217025910356, "phrase": "tdr."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Web spam", " Trust propagation", " Distrust propagation"], "paper_abstract": "Semi-automatic anti-spam algorithms propagate either trust through links from a set of good seed pages or distrust through inverse-links from a set of bad seed pages to the entire Web. It has been mentioned that a combined usage of both trust and distrust propagations can lead to better results. However, little work has been known to realize this insight successfully. In this paper, we view that each Web page has both a trustworthy side and an untrustworthy side, and propose to assign two scores for each Web page to denote its trustworthy side and untrustworthy side, respectively. We then propose the Good-Bad Rank (GBR) algorithm for propagating trust and distrust simultaneously from both directions. In GBR, the propagation of a page's trust/distrust is decided by its probability of being trust/distrust. GBR takes advantages from both trust and distrust propagations, thus is more powerful than propagating only trust or distrust. Experimental results show that GBR outperforms other typical link-based anti-spam algorithms that propagates only trust or distrust. GBR achieves comparable performance than another algorithm that propagates both trust and distrust, TDR, but is much more efficient than TDR. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Combating Web spam through trust-distrust propagation with confidence", "paper_id": "WOS:000323360400002"}