{"auto_keywords": [{"score": 0.0047820521205253035, "phrase": "feist"}, {"score": 0.004636756166068091, "phrase": "feist_publications"}, {"score": 0.004573598742696912, "phrase": "rural_tel"}, {"score": 0.004542341892683877, "phrase": "service_co."}, {"score": 0.004140613635632826, "phrase": "previous_studies"}, {"score": 0.0035972293900260414, "phrase": "pivotal_point"}, {"score": 0.003404998261799824, "phrase": "close_textual_exegesis"}, {"score": 0.00281900316527787, "phrase": "central_clause"}, {"score": 0.002799703831407504, "phrase": "subsequent_clauses"}, {"score": 0.0025604827895852646, "phrase": "classic_conceptions"}, {"score": 0.002448631085132444, "phrase": "routine_selection"}, {"score": 0.002374063735432571, "phrase": "automatic_mechanical_procedure"}, {"score": 0.0022703369939978185, "phrase": "copyright_law"}, {"score": 0.0021049977753042253, "phrase": "potential_practical_utility"}], "paper_keywords": [""], "paper_abstract": "The United States Supreme Court case of 1991, Feist Publications, Inc. v. Rural Tel. Service Co., continues to be highly significant for property in data and databases, but remains poorly understood. The approach taken in this article contrasts with previous studies. It focuses upon the \"not original\" rather than the original. The delineation of the absence of a modicum of creativity in selection, coordination, and arrangement of data as a component of the not original forms a pivotal point in the Supreme Court decision. The author also aims at elucidation rather than critique, using close textual exegesis of the Supreme Court decision. The results of the exegesis are translated into a more formal logical form to enhance clarity and rigor. The insufficiently creative is initially characterized as \"so mechanical or routine.\" Mechanical and routine are understood in their ordinary discourse senses, as a conjunction or as connected by AND, and as the central clause. Subsequent clauses amplify the senses of mechanical and routine without disturbing their conjunction. The delineation of the absence of a modicum of creativity can be correlated with classic conceptions of computability. The insufficiently creative can then be understood as a routine selection, coordination, or arrangement produced by an automatic mechanical procedure or algorithm. An understanding of a modicum of creativity and of copyright law is also indicated. The value of the exegesis and interpretation is identified as its final simplicity, clarity, comprehensiveness, and potential practical utility.", "paper_title": "So Mechanical or Routine: The Not Original in Feist", "paper_id": "WOS:000276370500013"}