{"auto_keywords": [{"score": 0.04802282272047765, "phrase": "people's_presence"}, {"score": 0.04588632966015907, "phrase": "computer-mediated_interactions"}, {"score": 0.03754363682447158, "phrase": "social_context"}, {"score": 0.00481495049065317, "phrase": "human-computer_interaction"}, {"score": 0.004745056850725867, "phrase": "cooperative_work"}, {"score": 0.004508286991825192, "phrase": "design_approach"}, {"score": 0.0037823114064881357, "phrase": "central_ideas"}, {"score": 0.003700170452390401, "phrase": "social_presence"}, {"score": 0.0031382058937207413, "phrase": "graphical_representations"}, {"score": 0.003036468052876648, "phrase": "explicit_focus"}, {"score": 0.002905914725757534, "phrase": "social_context_displays"}, {"score": 0.002853183476661506, "phrase": "new_abstractions"}, {"score": 0.0028014064098604093, "phrase": "social_information_more_visible_works"}, {"score": 0.002730488910300527, "phrase": "user-centered_design"}, {"score": 0.0023582694348219233, "phrase": "goffman's_performance_framework"}, {"score": 0.002315452777999619, "phrase": "detailed_description"}, {"score": 0.0021916007506930352, "phrase": "broader_issues"}, {"score": 0.0021049977753042253, "phrase": "media_richness"}], "paper_keywords": ["Context", " Social media", " Public displays", " Computer-mediated communication"], "paper_abstract": "In the human-computer interaction, computer supported cooperative work, and ubiquitous computing literature, making people's presence and activities visible as a design approach has been extensively explored to enhance computer-mediated interactions and collaborations. This process has developed under the rubrics of \"awareness,'' \"social translucence,'' \"social activity indicators,'' \"social navigation,'' etc. Although the name and details vary, the central ideas are similar. By making social presence and activities more visible or perceivable, they provide social context for members to make sense of situations and guide their activities more informatively and appropriately. In this work, we introduce a class of visualizations called social context displays, which use and share graphical representations to depict people's presence and activity information with an explicit focus on groups. The aim of this work is to examine social context displays in use and contribute new abstractions for understanding how making social information more visible works in general. Through our first-hand experience with user-centered design and empirical investigations of two social context displays in real settings, we uncovered not only how they provide social context to inform actions and decisions, but also how members perform and manage their self- and group-representations through the display. Drawing on Goffman's performance framework, we provide a detailed description of how people react and respond to these two social context displays and reconsider some of the broader issues associated with computer-mediated interactions such as privacy, context, and media richness.", "paper_title": "Informing and performing: investigating how mediated sociality becomes visible", "paper_id": "WOS:000314508400012"}