{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "differentiated_services"}, {"score": 0.03926342325626136, "phrase": "service_class"}, {"score": 0.008810429940540987, "phrase": "service_classes"}, {"score": 0.004414653335578912, "phrase": "service_priority"}, {"score": 0.004308630865024719, "phrase": "tcp_connections"}, {"score": 0.004132743580000062, "phrase": "throughput_and_loss_rates"}, {"score": 0.0040334640350288, "phrase": "operational_parameters"}, {"score": 0.00367228341822469, "phrase": "service_differentiation"}, {"score": 0.0036342554219547098, "phrase": "tcp"}, {"score": 0.003584025547693836, "phrase": "real-time_traffic"}, {"score": 0.0033202893707380806, "phrase": "qos"}, {"score": 0.002723186210025975, "phrase": "connections'_parameters"}, {"score": 0.002630085891013006, "phrase": "decision_problem"}, {"score": 0.002505054869094183, "phrase": "noncooperative_game"}, {"score": 0.0022963507669678815, "phrase": "nonequilibria_initial_states"}, {"score": 0.002248899833549883, "phrase": "pricing_problem"}, {"score": 0.0021795515361987144, "phrase": "resulting_equilibrium"}, {"score": 0.002149418970824546, "phrase": "network_benefit"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["TCP", " RED/AQM", " Nash equilibrium", " pricing", " service differentiation"], "paper_abstract": "The goal of this paper is to study pricing of differentiated services and its impact on the choice of service priority at equilibrium. We consider both TCP connections as well as noncontrolled (real-time) connections. The performance measures (such as throughput and loss rates) are determined according to the operational parameters of a RED (Random Early Discard) buffer management. The latter is assumed to be able to give differentiated services to the applications according to their choice of service class. We consider a service differentiation for both TCP as well as real-time traffic where the quality of service (QoS) of connections is not guaranteed, but by choosing a better (more expensive) service class, the QoS parameters of a session can improve (as long as the service class of other sessions are fixed). The choice of a service class of an application will depend both on the utility as well as on the cost it has to pay. We first study the performance of the system as a function of the connections' parameters and their choice of service classes. We then study the decision problem of how to choose the service classes. We model the problem as a noncooperative game. We establish conditions for an equilibrium to exist and to be uniquely defined. We further provide conditions for convergence to equilibrium from nonequilibria initial states. We finally study the pricing problem of how to choose prices so that the resulting equilibrium would maximize the network benefit. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Pricing differentiated services: A game-theoretic approach", "paper_id": "WOS:000236786000007"}