{"auto_keywords": [{"score": 0.041182291109493084, "phrase": "original_graph"}, {"score": 0.015557955264077659, "phrase": "online_social_networks"}, {"score": 0.014027859733023215, "phrase": "sample_graph"}, {"score": 0.004814950848222042, "phrase": "dpl"}, {"score": 0.004545793387330536, "phrase": "new_graph_sampling_method"}, {"score": 0.003610929883213109, "phrase": "sample_graphs"}, {"score": 0.003320756562046789, "phrase": "proposed_method"}, {"score": 0.0027645030021576926, "phrase": "densification_power_law"}, {"score": 0.002362320344521919, "phrase": "existing_methods"}, {"score": 0.002206700502606511, "phrase": "sampling_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Graph sampling", " Online social network", " Densification power law"], "paper_abstract": "In this paper, we propose a new graph sampling method for online social networks that achieves the following. First, a sample graph should reflect the ratio between the number of nodes and the number of edges of the original graph. Second, a sample graph should reflect the topology of the original graph. Third, sample graphs should be consistent with each other when they are sampled from the same original graph. The proposed method employs two techniques: hierarchical community extraction and densification power law. The proposed method partitions the original graph into a set of communities to preserve the topology of the original graph. It also uses the densification power law which captures the ratio between the number of nodes and the number of edges in online social networks. In experiments, we use several real-world online social networks, create sample graphs using the existing methods and ours, and analyze the differences between the sample graph by each sampling method and the original graph. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A community-based sampling method using DPL for online social networks", "paper_id": "WOS:000351803800004"}