{"auto_keywords": [{"score": 0.0434841206330199, "phrase": "cpoe_system"}, {"score": 0.01449052771111664, "phrase": "residual_risks"}, {"score": 0.01335614997226487, "phrase": "failure_modes"}, {"score": 0.011736750025873693, "phrase": "criticality_indices"}, {"score": 0.007794071783241638, "phrase": "patient_safety"}, {"score": 0.00481495049065317, "phrase": "computerized_provider_order_entry_system"}, {"score": 0.004557943646825813, "phrase": "computerized_provider_order_entry"}, {"score": 0.0045267936364577765, "phrase": "cpoe"}, {"score": 0.00438921882244081, "phrase": "future_developments"}, {"score": 0.004255807517348647, "phrase": "drug_prescription_process"}, {"score": 0.0035603802089559716, "phrase": "handwritten_and_electronic_prescriptions"}, {"score": 0.003168147459025106, "phrase": "handwritten_prescription"}, {"score": 0.0029578641378775633, "phrase": "major_safety_improvements"}, {"score": 0.00265909739882579, "phrase": "treatment_adaptation"}, {"score": 0.0026138115448726567, "phrase": "vital_signs"}, {"score": 0.0025604827895852646, "phrase": "automatic_edition"}, {"score": 0.002333620799300123, "phrase": "implemented_functions"}, {"score": 0.002278152865899792, "phrase": "risk_analysis"}, {"score": 0.002141487053045766, "phrase": "continuous_quality_improvement"}], "paper_keywords": [""], "paper_abstract": "Objectives: Quantitative evaluation of safety after the implementation of a computerized provider order entry (CPOE) system, stratification of residual risks to drive future developments. Design: Comparative risk analysis of the drug prescription process before and after the implementation of CPOE system, according to the Failure Modes, Effects and Criticality Analysis (FMECA) method. Measurements: The failure modes were defined and their criticality indices calculated on the basis of the likelihood of occurrence, potential severity for patients, and detection probability. Criticality indices of handwritten and electronic prescriptions were compared, the acceptability of residual risks was discussed. Further developments were proposed and their potential impact on the safety was estimated. Results: The sum of criticality indices of 27 identified failure modes was 3813 for the handwritten prescription, 2930 (-23%) for CPOE system, and 1658 (-57%) with 14 enhancements. The major safety improvements were observed for errors due to ambiguous, incomplete or illegible orders (-245 points), wrong dose determination (-217) and interactions (-196). Implementation of targeted pop-ups to remind treatment adaptation (-189), vital signs (-140), and automatic edition of documents needed for the dispensation (-126) were the most promising proposed improvements. Conclusion: The impact of a CPOE system on patient safety strongly depends on the implemented functions and their ergonomics. The use of risk analysis helps to quantitatively evaluate the relationship between a system and patient safety and to build a strategy for continuous quality improvement, by selecting the most appropriate improvements to the system.", "paper_title": "A risk analysis method to evaluate the impact of a computerized provider order entry system on patient safety", "paper_id": "WOS:000257794700008"}