{"auto_keywords": [{"score": 0.0402525648889651, "phrase": "pls"}, {"score": 0.015203907774448907, "phrase": "fed-batch_processes"}, {"score": 0.008713750161240224, "phrase": "smoothing_techniques"}, {"score": 0.0077468559117600255, "phrase": "promising_approach"}, {"score": 0.007003341914022151, "phrase": "regression_coefficients"}, {"score": 0.005918393379888881, "phrase": "smoothing_technique"}, {"score": 0.005043001946058431, "phrase": "different_smoothing_techniques"}, {"score": 0.004855304955221906, "phrase": "end-of-batch_quality_prediction"}, {"score": 0.004616199959832044, "phrase": "u-pls._run"}, {"score": 0.0045005151829002775, "phrase": "smoothing_constraints"}, {"score": 0.004443945538764863, "phrase": "pls_calibration"}, {"score": 0.004425616928975799, "phrase": "partial_least_squares"}, {"score": 0.004260443712398226, "phrase": "functional_analysis"}, {"score": 0.003982741546775355, "phrase": "changing_processing_conditions"}, {"score": 0.003738502710504415, "phrase": "input_profile"}, {"score": 0.0031979796189858206, "phrase": "sliding_window_filtering"}, {"score": 0.0030399874838260886, "phrase": "present_paper"}, {"score": 0.002889778121878728, "phrase": "original_approach"}, {"score": 0.002535115422089855, "phrase": "original_filtering_approach"}, {"score": 0.0021049977753042253, "phrase": "unfolded_partial_least_squares"}], "paper_keywords": ["partial least squares", " fed-batch processing", " run-to-run optimization", " unfolded PLS", " functional PLS", " penalized PLS"], "paper_abstract": "Run to run (R2R) optimization based on unfolded Partial Least Squares (u-PLS) is a promising approach for improving the performance of batch and fed-batch processes as it is able to continuously adapt to changing processing conditions. Using this technique, the regression coefficients of PLS are used to modify the input profile of the process in order to optimize the yield. When this approach was initially proposed, it was observed that the optimization performed better when PLS was combined with a smoothing technique, in particular a sliding window filtering, which constrained the regression coefficients to be smooth. In the present paper, this result is further investigated and some modifications to the original approach are proposed. Also, the suitability of different smoothing techniques in combination with PLS is studied for both end-of-batch quality prediction and R2R optimization. The smoothing techniques considered in this paper include the original filtering approach, the introduction of smoothing constraints in the PLS calibration (Penalized PLS), and the use of functional analysis (Functional PLS). Two fed-batch process simulators are used to illustrate the results. Copyright (c) 2015John Wiley & Sons, Ltd. Run to run (R2R) optimization based on unfolded Partial Least Squares (u-PLS) is a promising approach for improving the performance of batch and fed-batch processes. The optimization performs better when PLS is combined with a smoothing technique. In this paper, the suitability of different smoothing techniques in combination with PLS is studied for both end-of-batch quality prediction and R2R optimization, including filtering, the introduction of smoothing constraints in the PLS calibration (Penalized PLS), and functional analysis (Functional PLS).", "paper_title": "Evaluation of smoothing techniques in the run to run optimization of fed-batch processes with u-PLS", "paper_id": "WOS:000355987200003"}