{"auto_keywords": [{"score": 0.02730312360622679, "phrase": "design_strategy"}, {"score": 0.007102199061788574, "phrase": "\"persistent_model"}, {"score": 0.00481495049065317, "phrase": "purpose_-_this_paper"}, {"score": 0.004598933498016774, "phrase": "cybernetic_perspective"}, {"score": 0.0042928648367867835, "phrase": "derived_understandings"}, {"score": 0.004195418010131832, "phrase": "outline_specification"}, {"score": 0.004147523799581407, "phrase": "speculative_design_project"}, {"score": 0.003976523732243618, "phrase": "pliny_the_elder"}, {"score": 0.0038125469099459905, "phrase": "long_tradition"}, {"score": 0.0037834649508375544, "phrase": "partial_appropriation"}, {"score": 0.0033215617190376565, "phrase": "two-dimensional_representation"}, {"score": 0.0032585499655442404, "phrase": "subsequent_spatial_synthesis"}, {"score": 0.0031121406603482112, "phrase": "modelled_circular"}, {"score": 0.0026191799769765085, "phrase": "conceptual_underpinning"}, {"score": 0.0023525950486853937, "phrase": "built_artefacts"}, {"score": 0.002290291401956985, "phrase": "continual_expression"}, {"score": 0.0021872912745910127, "phrase": "original_notion"}, {"score": 0.0021049977753042253, "phrase": "existing_practices"}], "paper_keywords": ["observer", " model", " modelling", " black box", " design", " circularity", " architecture"], "paper_abstract": "Purpose - This paper aims to explore the relationship between modelling and design from a cybernetic perspective. Design/methodology/approach - Cybernetic understandings of the notions \"modelling\" and \"design\" are developed initially. The derived understandings are used to define an outline specification for a speculative design project based on an analysis and re-interpretation of an account from Pliny the Elder. The account is re-interpreted to address a long tradition of partial appropriation in which only the two-dimensional representation of three-dimensions by projection on to a plane is considered. The project seeks to re-adjust the focus of this account to an activity that employs two-dimensional representation as a means for subsequent spatial synthesis. It further proposes to make the relationship between model and modelled circular. Findings - There are two findings. First, an understanding that context is constructed by the observer. Second, the need to implement a meta-model to permit circularity between the model and the modelled. Research limitations/implications - This paper presents the conceptual underpinning for a project and design strategy that is yet to be investigated. Practical implications - The design strategy presented suggests the introduction of circularity into the world of built artefacts, allowing the potential for the continual expression of variety over time. Originality/value - This paper introduces the original notion of the \"persistent model\" as a design strategy complementary to existing practices. The \"persistent model\" establishes and maintains circularity between the model and the artefact as constructed, in order that the two continually inform each other.", "paper_title": "The origin of modelling", "paper_id": "WOS:000251883500005"}