{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "autonomous_climbing_robot"}, {"score": 0.0046544071297876695, "phrase": "novel_robot"}, {"score": 0.004583205112737672, "phrase": "vertical_and_rough_surfaces"}, {"score": 0.004527024978801684, "phrase": "stucco_walls"}, {"score": 0.0044991925146184025, "phrase": "termed_clibo"}, {"score": 0.004256243266481051, "phrase": "important_civilian_and_military_advantages"}, {"score": 0.004026359831748917, "phrase": "robot's_kinematics"}, {"score": 0.0038561471948364723, "phrase": "rock_climbing"}, {"score": 0.0031649018957020337, "phrase": "gripping_device"}, {"score": 0.0030123335878664064, "phrase": "wall's_surface"}, {"score": 0.0029117184554526094, "phrase": "tail-like_structure"}, {"score": 0.002805774617782258, "phrase": "locomotion_algorithm"}, {"score": 0.002728847267539957, "phrase": "autonomous_capability"}, {"score": 0.002687022487756706, "phrase": "pre-designed_route"}, {"score": 0.0025732834751685803, "phrase": "contact_forces"}, {"score": 0.002541677703992971, "phrase": "foot_pads"}, {"score": 0.002367315484467406, "phrase": "high_degree"}, {"score": 0.002295277579105177, "phrase": "experimental_robot"}, {"score": 0.0022048882869630114, "phrase": "high_reliability"}, {"score": 0.0021845387990972543, "phrase": "special_gripping_device"}, {"score": 0.002144400314994328, "phrase": "motion_planning_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Climbing", " Robot", " Claws", " Motion", " Algorithm"], "paper_abstract": "This paper presents the design of a novel robot capable of climbing on vertical and rough surfaces, such as stucco walls. Termed CLIBO (claw inspired robot), the robot can remain in position for a long period of time. Such a capability offers important civilian and military advantages such as surveillance, observation, search and rescue and even for entertainment and games. The robot's kinematics and motion, is a combination between mimicking a technique commonly used in rock climbing using four limbs to climb and a method used by cats to climb on trees with their claws. It uses four legs, each with four-degrees-of-freedom (4-DOF) and specially designed claws attached to each leg that enable it to maneuver itself up the wall and to move in any direction. At the tip of each leg is a gripping device made of 12 fishing hooks and aligned in such a way that each hook can move independently on the wall's surface. This design has the advantage of not requiring a tail-like structure that would press against the surface to balance its weight. A locomotion algorithm was developed to provide the robot with an autonomous capability for climbing along the pre-designed route. The algorithm takes into account the kinematics of the robot and the contact forces applied on the foot pads. In addition, the design provides the robot with the ability to review its gripping strength in order to achieve and maintain a high degree of reliability in its attachment to the wall. An experimental robot was built to validate the model and its motion algorithm. Experiments demonstrate the high reliability of the special gripping device and the efficiency of the motion planning algorithm. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Design and motion planning of an autonomous climbing robot with claws", "paper_id": "WOS:000295912100014"}