{"auto_keywords": [{"score": 0.03702043385058175, "phrase": "textual_similarity"}, {"score": 0.011930441699816026, "phrase": "nm"}, {"score": 0.011774412479775058, "phrase": "best_itemset"}, {"score": 0.0111845291598341, "phrase": "em"}, {"score": 0.009367320769471877, "phrase": "proposed_methods"}, {"score": 0.00481495049065317, "phrase": "itemset_construction"}, {"score": 0.004783852487938866, "phrase": "online_shopping_services"}, {"score": 0.004752954376588157, "phrase": "purpose_-_revenue_maximization"}, {"score": 0.004661446705304497, "phrase": "great_importance"}, {"score": 0.004631335513513859, "phrase": "price_comparison_shopping_services"}, {"score": 0.004107935669507044, "phrase": "effective_itemset_construction_methods"}, {"score": 0.0028195727965553367, "phrase": "real-world_dataset"}, {"score": 0.002608218347502229, "phrase": "significant_improvement"}, {"score": 0.0025248881422983553, "phrase": "items'_membership_updates"}, {"score": 0.002468142263365952, "phrase": "previous_studies"}, {"score": 0.00221729614713299, "phrase": "pcsss"}, {"score": 0.0021049977753042253, "phrase": "manual_task"}], "paper_keywords": ["Internet", " Electronic commerce", " Web site design", " Revenue maximization", " Click-through maximization", " Itemset construction", " Price comparison service", " E-commerce"], "paper_abstract": "Purpose - Revenue maximization through improving click-throughs is of great importance for price comparison shopping services (PCSSs) whose revenues directly depend on the number of click-throughs of items in their itemsets. The purpose of this paper is to present an approach aiming to maximize the revenue of a PCSS by proposing effective itemset construction methods that can maximize the click-throughs. Design/methodology/approach - The authors suggest three itemset construction methods, namely naive method (NM), exhaustive method (EM), and local update method (LM). Specifically, NM searches for the best itemset for an item in terms of textual similarity between an item and an itemset, while EM produces the best itemset for each item for maximizing click-throughs by considering all the possible memberships of the item. Finally, through combining NM and EM, the authors propose an LM that attempts to improve click-throughs by locally updating the memberships of items according to their ranks in each itemset. Findings - Through evaluation of the proposed methods based on a real-world dataset, it has been found that improvement of click-throughs is small when itemsets are constructed by using the textual similarity alone. However, significant improvement in the number of click-throughs was achieved when considering items' membership updates dynamically. Originality/value - Unlike the previous studies that mainly focus on the textual similarity, the authors attempt to maximize the revenue through constructing itemsets that can result in more click-throughs. By using the proposed methods, it is expected that PCSSs will be able to automatically construct itemsets that can maximize their revenues without the need for manual task.", "paper_title": "Revenue maximizing itemset construction for online shopping services", "paper_id": "WOS:000317149800006"}