{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "microfluidic_flow-focusing_device"}, {"score": 0.03736651879694644, "phrase": "orifice_length"}, {"score": 0.0043875257506180865, "phrase": "spurious_velocities"}, {"score": 0.004320055598195391, "phrase": "fluid-fluid_interface"}, {"score": 0.004123781267600542, "phrase": "lattice_boltzmann_simulations"}, {"score": 0.0035866734383189396, "phrase": "orifice_width"}, {"score": 0.003370907075333389, "phrase": "droplet_formation"}, {"score": 0.003234299589505403, "phrase": "different_capillary_numbers"}, {"score": 0.0030239842475439814, "phrase": "squeezing_process"}, {"score": 0.0029013950320185573, "phrase": "t-junction_configuration"}, {"score": 0.0025361866386341774, "phrase": "droplet_size"}, {"score": 0.0022053994402287925, "phrase": "critical_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Lattice Boltzmann", " Microfluidics", " Flow-focusing", " Droplet formation"], "paper_abstract": "In this work, the formation of droplets in a microfluidic flow-focusing device is studied and presented. Spurious velocities at the fluid-fluid interface were found to be very small in the lattice Boltzmann simulations. Using this technique, simulations have been performed to study the effect of geometry on formation of droplets for a microfluidic flow-focusing device. The effect of orifice width, orifice length and distance of the orifice on the mechanism of droplet formation and size of droplets is presented for different Capillary numbers. It is shown that, for Ca << 1, creation of droplets proceeds through the squeezing process that has earlier been observed in the T-junction configuration. The size of droplets increases with an increase in the (a) width, and (b) distance of orifice from the inlet. On increasing orifice length, droplet size first decreases to a minimum and increases thereafter. This study also reveals that the size of droplets becomes independent and approaches a constant beyond a critical value of the orifice length. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Droplet formation via squeezing mechanism in a microfluidic flow-focusing device", "paper_id": "WOS:000339775500020"}