{"auto_keywords": [{"score": 0.03828152818695627, "phrase": "binding_sites"}, {"score": 0.012851818874105105, "phrase": "well-known_ligands"}, {"score": 0.011815275444491263, "phrase": "chemically_diverse_ligands"}, {"score": 0.00481495049065317, "phrase": "known_fragment-fragment_interactions"}, {"score": 0.00467424463996457, "phrase": "putative_ligand-binding_sites"}, {"score": 0.004499334809770281, "phrase": "protein_function"}, {"score": 0.004461359547152617, "phrase": "knowledge-based_approaches"}, {"score": 0.004258128672571261, "phrase": "recent_increase"}, {"score": 0.00422218060227958, "phrase": "structural_information"}, {"score": 0.004151188559520802, "phrase": "binding_motif_information"}, {"score": 0.003829877278269543, "phrase": "structure_databases"}, {"score": 0.0037021153060910164, "phrase": "new_method"}, {"score": 0.0033865859510157238, "phrase": "fragment_size"}, {"score": 0.003150900886669123, "phrase": "binding_motifs"}, {"score": 0.003032820755030689, "phrase": "many-body_interactions"}, {"score": 0.0029817668105720924, "phrase": "larger_fragments"}, {"score": 0.0028216858159564808, "phrase": "main_and_side_chains"}, {"score": 0.002281930100792185, "phrase": "large_number"}, {"score": 0.0021870332034407817, "phrase": "unbound_forms"}, {"score": 0.0021049977753042253, "phrase": "conformational_changes"}], "paper_keywords": [""], "paper_abstract": "Motivation: The identification of putative ligand-binding sites on proteins is important for the prediction of protein function. Knowledge-based approaches using structure databases have become interesting, because of the recent increase in structural information. Approaches using binding motif information are particularly effective. However, they can only be applied to well-known ligands that frequently appear in the structure databases. Results: We have developed a new method for predicting the binding sites of chemically diverse ligands, by using information about the interactions between fragments. The selection of the fragment size is important. If the fragments are too small, then the patterns derived from the binding motifs cannot be used, since they are many-body interactions, while using larger fragments limits the application to well-known ligands. In our method, we used the main and side chains for proteins, and three successive atoms for ligands, as fragments. After superposition of the fragments, our method builds the conformations of ligands and predicts the binding sites. As a result, our method could accurately predict the binding sites of chemically diverse ligands, even though the Protein Data Bank currently contains a large number of nucleotides. Moreover, a further evaluation for the unbound forms of proteins revealed that our building up procedure was robust to conformational changes induced by ligand binding.", "paper_title": "Ligand-binding site prediction of proteins based on known fragment-fragment interactions", "paper_id": "WOS:000278689000054"}