{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cad-cae_programs_taking_account"}, {"score": 0.004669845451682529, "phrase": "computer-aided_design_or_simulation_courses"}, {"score": 0.004529093447865156, "phrase": "single_cad-cae_package"}, {"score": 0.004452731043379068, "phrase": "specific_criteria"}, {"score": 0.0044225461990535855, "phrase": "final_application"}, {"score": 0.004303830426772906, "phrase": "cad-cae_technologies_course"}, {"score": 0.004117647922204903, "phrase": "multidisciplinary_approach"}, {"score": 0.0037818557818203188, "phrase": "cad-cae_programs"}, {"score": 0.003414728597255129, "phrase": "important_technical_and_practical_aspects"}, {"score": 0.0031790892089501345, "phrase": "progressive_increase"}, {"score": 0.0030936482163040823, "phrase": "students'_satisfaction"}, {"score": 0.0030414140732789186, "phrase": "relevant_factor"}, {"score": 0.0028703075616629634, "phrase": "new_quality_assessment"}, {"score": 0.002681255756642227, "phrase": "different_software"}, {"score": 0.0024623110626032364, "phrase": "particularly_important_aspect"}, {"score": 0.0022078909877264884, "phrase": "urgent_and_very_necessary_steps"}, {"score": 0.0021484955960643167, "phrase": "job_interviews"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["computer-aided design", " computer-aided engineering", " simulation technologies", " FEM calculations", " teaching applications"], "paper_abstract": "Computer-aided design or simulation courses are usually focused on the use of a single CAD-CAE package, chosen according to specific criteria or final application. However, on the Expert in CAD-CAE Technologies course, taught annually at the Machine Engineering Division of the Universidad Politecnica de Madrid, we have chosen a multidisciplinary approach based on the use of three different CAD-CAE software packages, as the following paragraph will describe. This work details the results of a comparison between the CAD-CAE programs taught on that course (NX-6, Catia v.5 r.17 and Solid Edge v.20). The work has been conducted taking into account the opinions of students and teachers on important technical and practical aspects concerning the different design, simulation and calculation modules. With this comparison, it is hoped to attain a progressive increase in teaching quality by bearing in mind students' satisfaction with their own learning as a relevant factor, in accordance with the guidelines set by the Bologna Declaration regarding the implementation of the European Higher Education Area and the new quality assessment trends in teaching. Studies similar to this one may be highly useful when assessing whether the use of different software will be sufficient, as well as in situations where a choice needs to be made from among several programs in order to promote some particularly important aspect or activity. The opinions of teachers as well as students are important, particularly when students are seeking a job in Industry, as it is possible to take some urgent and very necessary steps that will meet the requirements demanded in job interviews. (c) 2010 Wiley Periodicals, Inc. Comput Appl Eng Educ 21: 641-656, 2013", "paper_title": "Comparative Study of CAD-CAE Programs Taking Account of the Opinions of Students and Teachers", "paper_id": "WOS:000325854200009"}