{"auto_keywords": [{"score": 0.0396705553661078, "phrase": "facility_location_problems"}, {"score": 0.00481495049065317, "phrase": "content_distribution_networks"}, {"score": 0.004692912358518426, "phrase": "content_distribution_network"}, {"score": 0.004510336430422002, "phrase": "specific_bandwidth"}, {"score": 0.004457995891964028, "phrase": "particular_client"}, {"score": 0.00436530211426514, "phrase": "routing_protocol"}, {"score": 0.004274527415193801, "phrase": "total_cost"}, {"score": 0.0038751504050385183, "phrase": "setup_cost"}, {"score": 0.0038301525703886585, "phrase": "unsplittable_hard-capacitated_facility_location_problem"}, {"score": 0.0037069087922811488, "phrase": "nontrivial_approximation_algorithm"}, {"score": 0.003672427620845944, "phrase": "hard_capacities"}, {"score": 0.003384029870084534, "phrase": "single_facility"}, {"score": 0.0033304747956609637, "phrase": "np"}, {"score": 0.0032522091171602557, "phrase": "bounded_factor"}, {"score": 0.0029343128039167185, "phrase": "general_metrics"}, {"score": 0.0028464607144683247, "phrase": "tree_metrics"}, {"score": 0.002628897245394997, "phrase": "nonuniform_capacities"}, {"score": 0.002410942838102255, "phrase": "exponential_running_time"}, {"score": 0.0022475295254231714, "phrase": "bin_packing"}, {"score": 0.002237036807966899, "phrase": "zero_connection_costs"}, {"score": 0.002226592967032469, "phrase": "facility_costs"}, {"score": 0.0021198271568336063, "phrase": "related_machines"}, {"score": 0.0021049977753042253, "phrase": "connection_costs"}], "paper_keywords": ["Algorithms", " Theory", " Approximation algorithm", " PTAS", " network", " facility location"], "paper_abstract": "In a Content Distribution Network (CDN), there are m servers storing the data; each of them has a specific bandwidth. All the requests from a particular client should be assigned to one server because of the routing protocol used. The goal is to minimize the total cost of these assignments-cost of each is proportional to the distance between the client and the server as well as the request size-while the load on each server is kept below its bandwidth limit. When each server also has a setup cost, this is an unsplittable hard-capacitated facility location problem. As much attention as facility location problems have received, there has been no nontrivial approximation algorithm when we have hard capacities (i.e., there can only be one copy of each facility whose capacity cannot be violated) and demands are unsplittable (i.e., all the demand from a client has to be assigned to a single facility). We observe it is NP-hard to approximate the cost to within any bounded factor in this case. Thus, for an arbitrary constant epsilon > 0, we relax the capacities to a 1 + epsilon factor. For the case where capacities are almost uniform, we give a bicriteria O(log n, 1 + epsilon)-approximation algorithm for general metrics and a (1 + epsilon, 1 + epsilon)-approximation algorithm for tree metrics. A bicriteria (alpha, beta)-approximation algorithm produces a solution of cost at most alpha times the optimum, while violating the capacities by no more than a beta factor. We can get the same guarantees for nonuniform capacities if we allow quasipolynomial running time. In our algorithm, some clients guess the facility they are assigned to, and facilities decide the size of the clients they serve. A straightforward approach results in exponential running time. When costs do not satisfy metricity, we show that a 1.5 violation of capacities is necessary to obtain any approximation. It is worth noting that our results generalize bin packing (zero connection costs and facility costs equal to one), knapsack (single facility with all costs being zero), minimum makespan scheduling for related machines (all connection costs being zero), and some facility location problems.", "paper_title": "Assignment Problem in Content Distribution Networks: Unsplittable Hard-Capacitated Facility Location", "paper_id": "WOS:000307170500001"}