{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_face_models"}, {"score": 0.008469676039123592, "phrase": "source_rig"}, {"score": 0.0047026237903774895, "phrase": "facial_deformation_system"}, {"score": 0.004506968388996092, "phrase": "facial_rig"}, {"score": 0.004139639802595566, "phrase": "specific_facial_features"}, {"score": 0.0038930368103015467, "phrase": "main_attributes"}, {"score": 0.0036095259108028105, "phrase": "sophisticated_facial_rig"}, {"score": 0.003378385493203297, "phrase": "rig_configuration"}, {"score": 0.0031619994642255846, "phrase": "different_influence_objects"}, {"score": 0.002931569771634119, "phrase": "individual_face_models"}, {"score": 0.002890266318361907, "phrase": "high_quality_geometric_or_physically-based_animations"}, {"score": 0.0027437235598539904, "phrase": "source_facial_rig"}, {"score": 0.0026293540353514075, "phrase": "unique_expressions"}, {"score": 0.002555761854502478, "phrase": "existing_animation_scripts"}, {"score": 0.002281376328251423, "phrase": "animation_pipeline"}, {"score": 0.0021656385587456952, "phrase": "major_film_and_game_companies"}], "paper_keywords": ["facial animation", " rigging", " skinning", " geometric deformation"], "paper_abstract": "We introduce a facial deformation system that allows artists to define and customize a facial rig and later apply the same rig to different face models. The method uses a set of landmarks that define specific facial features and deforms the rig anthropometrically. We find the correspondence of the main attributes of a source rig, transfer them to different three-demensional (3D) face models and automatically generate a sophisticated facial rig. The method is general and can be used with any type of rig configuration. We show how the landmarks, combined with other deformation methods, can adapt different influence objects (NURBS surfaces, polygon surfaces, lattice) and skeletons from a source rig to individual face models, allowing high quality geometric or physically-based animations. We describe how it is possible to deform the source facial rig, apply the same deformation parameters to different face models and obtain unique expressions. We enable reusing of existing animation scripts and show how shapes nicely mix one with the other in different face models. We describe how our method can easily be integrated in an animation pipeline. We end with the results of tests done with major film and game companies to show the strength of our proposal.", "paper_title": "Transferring the rig and animations from a character to different face models", "paper_id": "WOS:000261137800002"}