{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_media_data"}, {"score": 0.0496341948154792, "phrase": "feature_selection"}, {"score": 0.014667499720165914, "phrase": "social_media"}, {"score": 0.004638462976078815, "phrase": "high-dimensional_data"}, {"score": 0.004595356579614969, "phrase": "effective_data_mining"}, {"score": 0.00453144352814823, "phrase": "explosive_popularity"}, {"score": 0.004447600571127578, "phrase": "massive_and_high-dimensional_data"}, {"score": 0.004304574865291508, "phrase": "new_challenges"}, {"score": 0.003689628075766217, "phrase": "social_context"}, {"score": 0.0035542408902458677, "phrase": "social_media_users"}, {"score": 0.0030604342671868836, "phrase": "already_challenging_problem"}, {"score": 0.0029069972482610403, "phrase": "novel_feature_selection_problem"}, {"score": 0.002684819249720834, "phrase": "attribute-value_data"}, {"score": 0.002550165781755603, "phrase": "new_feature_selection_framework"}, {"score": 0.0024912073108138613, "phrase": "social_science_theories"}, {"score": 0.00237733844863506, "phrase": "real-world_social_media_web_sites"}, {"score": 0.0022793032191981404, "phrase": "proposed_framework"}], "paper_keywords": ["Feature selection", " social media data", " social context"], "paper_abstract": "Feature selection is widely used in preparing high-dimensional data for effective data mining. The explosive popularity of social media produces massive and high-dimensional data at an unprecedented rate, presenting new challenges to feature selection. Social media data consists of (1) traditional high-dimensional, attribute-value data such as posts, tweets, comments, and images, and (2) linked data that provides social context for posts and describes the relationships between social media users as well as who generates the posts, and so on. The nature of social media also determines that its data is massive, noisy, and incomplete, which exacerbates the already challenging problem of feature selection. In this article, we study a novel feature selection problem of selecting features for social media data with its social context. In detail, we illustrate the differences between attribute-value data and social media data, investigate if linked data can be exploited in a new feature selection framework by taking advantage of social science theories. We design and conduct experiments on datasets from real-world social media Web sites, and the empirical results demonstrate that the proposed framework can significantly improve the performance of feature selection. Further experiments are conducted to evaluate the effects of user-user and user-post relationships manifested in linked data on feature selection, and research issues for future work will be discussed.", "paper_title": "Feature Selection for Social Media Data", "paper_id": "WOS:000344352800003"}