{"auto_keywords": [{"score": 0.045855610830395445, "phrase": "dispensing_process"}, {"score": 0.04505268686899412, "phrase": "stand-alone_bcma_system"}, {"score": 0.0409227600835861, "phrase": "nursing_staff"}, {"score": 0.015719716506582538, "phrase": "bar-code_assisted_medication_administration_system"}, {"score": 0.014729148550879105, "phrase": "computerised_prescribing"}, {"score": 0.013656941750360566, "phrase": "dispensing_steps"}, {"score": 0.004449452743965974, "phrase": "bcma"}, {"score": 0.004232396043643437, "phrase": "teaching_hospital"}, {"score": 0.003529149828147388, "phrase": "eight_and_time"}, {"score": 0.0031098631445657158, "phrase": "procedural_errors"}, {"score": 0.0030853715963389135, "phrase": "'missing_drug_items"}, {"score": 0.0030530150560551597, "phrase": "frequently_observed_pdes"}, {"score": 0.0030130446986008277, "phrase": "'perceived_usefulness"}, {"score": 0.002989313352047128, "phrase": "job_relevance"}, {"score": 0.0025452314655691165, "phrase": "drug_administration"}, {"score": 0.0023828355407603196, "phrase": "drug_administration_process"}, {"score": 0.00237029943579966, "phrase": "pharmacy_staff"}, {"score": 0.0022783523466965187, "phrase": "periodical_assessments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Bar-code assisted medication administration (BCMA)", " Stand-alone BCMA system", " Direct observation", " Attitudes", " Dispensing", " Drug administration"], "paper_abstract": "Purpose: We assessed the effects of a bar-code assisted medication administration system used without the support of computerised prescribing (stand-alone BCMA), on the dispensing process and its users. Methods: The stand-alone BCMA system was implemented in one ward of a teaching hospital. The number of dispensing steps, dispensing time and potential dispensing errors (PDEs) were directly observed one month before and eight months after the intervention. Attitudes of pharmacy and nursing staff were assessed using a questionnaire (Likert scale) and interviews. Results: Among 1291 and 471 drug items observed before and after the introduction of the technology respectively, the number of dispensing steps increased from five to eight and time (standard deviation) to dispense one drug item by one staff personnel increased from 0.8 (0.09) to 1.5 (0.12) min. Among 2828 and 471 drug items observed before and after the intervention respectively, the number of PDEs increased significantly (P < 0.001). 'Procedural errors' and 'missing drug items' were the frequently observed PDEs in the after study. 'Perceived usefulness' and job relevance' of the technology decreased significantly (P = 0.003 and P = 0.004 respectively) among users who participated in the before (N = 16) and after (N = 16) questionnaires surveys. Among the interviewees, pharmacy staff felt that the system offered less benefit to the dispensing process (9/16). Nursing staff perceived the system as useful in improving the accuracy of drug administration (7/10). Conclusion: Implementing a stand-alone BCMA system may slow down and complicate the dispensing process. Nursing staff believe the stand-alone BCMA system could improve the drug administration process but pharmacy staff believes the technology would be more helpful if supported by computerised prescribing. However, periodical assessments are needed to identify weaknesses in the process after implementation, and all users should be educated on the benefits of using this technology. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Implementing a bar-code assisted medication administration system: Effects on the dispensing process and user perceptions", "paper_id": "WOS:000335903400006"}