{"auto_keywords": [{"score": 0.02753591178091155, "phrase": "potential_competition"}, {"score": 0.00437638976267351, "phrase": "vod"}, {"score": 0.004198323646273642, "phrase": "traditional_pricing_mechanism"}, {"score": 0.003585089792133518, "phrase": "proper_profit_distribution_mechanism"}, {"score": 0.0033964919992320024, "phrase": "mathematical_framework"}, {"score": 0.0032581736321024373, "phrase": "cooperative_game_theory"}, {"score": 0.003191134522157061, "phrase": "cooperative_profit-distribution_model"}, {"score": 0.003151572886432253, "phrase": "nash_bargaining_solution"}, {"score": 0.0029733203800202303, "phrase": "content_providers"}, {"score": 0.00286407451582299, "phrase": "fair_pareto_point"}, {"score": 0.002828556054338357, "phrase": "profit_distribution"}, {"score": 0.0027473784878300133, "phrase": "fair_and_feasible_mechanism"}, {"score": 0.0024656866249273125, "phrase": "fair_profit_distribution"}, {"score": 0.0024452510143564057, "phrase": "network_participants"}, {"score": 0.0023849523850778807, "phrase": "economic_efficiency"}, {"score": 0.00235536166148219, "phrase": "network_system"}, {"score": 0.002167235986623239, "phrase": "unbalanced_profit_distribution"}, {"score": 0.0021049977753042253, "phrase": "feasible_cooperative_method"}], "paper_keywords": ["P2P", " internet service providers", " content providers", " profit distribution", " nash bargaining solution"], "paper_abstract": "Peer-to-Peer (P2P) technology has been promoting the development of Internet applications, like Video on Demand (VoD) and file sharing. However, under the traditional pricing mechanism, the fact that most P2P traffic flows among peers can dramatically decrease the profit of ISPs, who may take actions against P2P and impede the adoption of P2P-assisted applications. So far, there is no proper profit distribution mechanism to solve this problem. In this paper, we develop a mathematical framework to analyze such economic issues. Inspired by the idea from cooperative game theory, we propose a cooperative profit-distribution model based on Nash Bargaining Solution (NBS), in which both eyeball ISPs and Peer-assisted Content Providers (PCPs) form coalitions and compute a fair Pareto point to determine profit distribution. Moreover, we design a fair and feasible mechanism for profit distribution within each coalition and give a model to discuss the potential competition among ISPs. We show that such a cooperative method not only guarantees the fair profit distribution among network participants, but also improves the economic efficiency of the network system; and the potential competition among ISPs will make the network more efficient. This paper systematically studies solutions to unbalanced profit distribution caused by P2P and presents a feasible cooperative method to increase and fairly distribute the profit.", "paper_title": "Can P2P Technology Benefit Eyeball ISPs? A Cooperative Profit Distribution Answer", "paper_id": "WOS:000343904400003"}