{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "proper_languages"}, {"score": 0.03856123806115194, "phrase": "syntactic_disambiguation"}, {"score": 0.004767546015485477, "phrase": "lexicalized_frr-automata"}, {"score": 0.004697308822154191, "phrase": "syntactical_phenomena"}, {"score": 0.004628101576367193, "phrase": "important_role"}, {"score": 0.004515004397496303, "phrase": "natural_languages"}, {"score": 0.0035600143547053287, "phrase": "freely_rewriting_restarting_automaton"}, {"score": 0.0033379819706003885, "phrase": "restarting_automaton"}, {"score": 0.0031453010852936334, "phrase": "deterministic_frr-automata"}, {"score": 0.002605329434787829, "phrase": "auxiliary_symbols"}, {"score": 0.002454835845644037, "phrase": "corresponding_characteristic_language"}, {"score": 0.0022010965931147735, "phrase": "two-dimensional_hierarchies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Analysis by reduction", " Restarting automaton", " Word-order complexity", " Lexicalization", " Language classes"], "paper_abstract": "Various syntactical phenomena play an important role when developing grammars for natural languages. Among them are the dependencies (subordination) or valences, which are closely related to the complexity of the word-order of the language considered, and the number and types of categories that are used during the process of syntactic disambiguation. Here we present the freely rewriting restarting automaton (FRR-automaton), which is a variant of the restarting automaton that is tuned towards modeling such phenomena. We study proper languages of deterministic FRR-automata that are (strongly) lexicalized, where we focus on two types of constraints: the number of rewrites per cycle, which models the degree of valences within sentences, and the number of occurrences of auxiliary symbols (categories) in the sentences (words) of the corresponding characteristic language, which models the use of categories during the process of syntactic disambiguation. Based on these constraints we obtain four variants of two-dimensional hierarchies of language classes. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Two-dimensional hierarchies of proper languages of lexicalized FRR-automata", "paper_id": "WOS:000271169800013"}