{"auto_keywords": [{"score": 0.04636706100446641, "phrase": "sci"}, {"score": 0.01824912969647776, "phrase": "local_competition"}, {"score": 0.018123516069339898, "phrase": "international_competition"}, {"score": 0.008171386816073649, "phrase": "operational_challenges"}, {"score": 0.007808996055968603, "phrase": "different_patterns"}, {"score": 0.007593959215289374, "phrase": "higher_levels"}, {"score": 0.00481495049065317, "phrase": "chain_integration"}, {"score": 0.0044736342427651185, "phrase": "supply_chain_integration"}, {"score": 0.004319765281889742, "phrase": "china"}, {"score": 0.0042151062637265126, "phrase": "taxonomy"}, {"score": 0.004185632403886255, "phrase": "cluster_analysis"}, {"score": 0.0038346288310750804, "phrase": "competition_patterns"}, {"score": 0.0038078492247427594, "phrase": "sci._findings_-_seven_competition_patterns"}, {"score": 0.0036382660173943393, "phrase": "survey_data"}, {"score": 0.0036002125374696237, "phrase": "anova_results"}, {"score": 0.0035129562812850784, "phrase": "significantly_different_levels"}, {"score": 0.00330972235893118, "phrase": "sci._post"}, {"score": 0.0032294837250130327, "phrase": "stronger_effects"}, {"score": 0.003096417317829492, "phrase": "single_country"}, {"score": 0.0028866770996648057, "phrase": "causal_explanatory_power"}, {"score": 0.00275800486983114, "phrase": "different_configurations"}, {"score": 0.002439308179084911, "phrase": "supply_chain_management_area"}, {"score": 0.0022110183535859374, "phrase": "configuration_approach"}, {"score": 0.0021801944769738618, "phrase": "dimensional_approach"}], "paper_keywords": ["China", " Supply chain integration", " Taxonomy", " International competition", " Local competition", " Operational challenge"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the influence of competition on supply chain integration (SCI). Design/methodology/approach - Survey data from 617 manufacturers in China were used in this study. Taxonomy with cluster analysis was used to investigate the patterns of competition, and analysis of variance (ANOVA) was used to investigate the influence of these competition patterns on SCI. Findings - Seven competition patterns composed of local competition, international competition, and operational challenges were identified from the survey data. The ANOVA results showed that companies with different patterns achieved significantly different levels of SCI, indicating that higher levels of local competition, international competition, and operational challenges drove higher levels of SCI. Post hoc analyses revealed that international competition had stronger effects than local competition on SCI. Research limitations/implications - The data were collected from a single country, which may limit the generalization of the findings. The data were cross-sectional and thus lacked causal explanatory power. Practical implications - The findings provide suggestions for managers to use different configurations of SCI to adapt to different patterns of competition. Originality/value - This study makes three main contributions to the literature. First, it extends the research on the relationship between competition and cooperation to the supply chain management area. Second, it extends the concept of competition by incorporating not only competitive intensity, but also competitive scope and competitive capability. Third, the use of a configuration approach rather than a dimensional approach to investigate the effects of competition on SCI solves many methodological problems.", "paper_title": "Competition and supply chain integration: a taxonomy perspective", "paper_id": "WOS:000357392700008"}