{"auto_keywords": [{"score": 0.04976229174017987, "phrase": "biomedical_and_clinical_documents"}, {"score": 0.046406428866983235, "phrase": "disease-drug_associations"}, {"score": 0.015719716506582538, "phrase": "disease-drug_knowledge"}, {"score": 0.014672400404558788, "phrase": "statistical_techniques"}, {"score": 0.01401269209708141, "phrase": "patient_record"}, {"score": 0.013207311021619603, "phrase": "medline_articles"}, {"score": 0.0046269981365987915, "phrase": "automated_acquisition"}, {"score": 0.004105850229681625, "phrase": "medlee"}, {"score": 0.004011521305179232, "phrase": "discharge_summaries"}, {"score": 0.0039323878878973284, "phrase": "drug_entities"}, {"score": 0.0038676325043529524, "phrase": "nlp_systems"}, {"score": 0.003816593863814444, "phrase": "mesh_annotations"}, {"score": 0.003728885511755734, "phrase": "eight_diseases"}, {"score": 0.003704196857903231, "phrase": "co-occurrence_statistics"}, {"score": 0.003524150055503105, "phrase": "relevant_drugs"}, {"score": 0.003477628306017313, "phrase": "ranked_lists"}, {"score": 0.0034545974376846687, "phrase": "disease-drug_pairs"}, {"score": 0.0033639840192975835, "phrase": "stronger_associations"}, {"score": 0.0032324864013225166, "phrase": "text_sources"}, {"score": 0.003024613178190338, "phrase": "umls"}, {"score": 0.0028394925080958205, "phrase": "disease-specific_knowledge"}, {"score": 0.0028113140998735366, "phrase": "feasibility_study"}, {"score": 0.002683482644900854, "phrase": "nlp"}, {"score": 0.0024941578231560055, "phrase": "specific_diseases"}, {"score": 0.002357055030818803, "phrase": "controlled_trials"}, {"score": 0.0021980296285911915, "phrase": "consistent_as_well_as_complementary_knowledge"}, {"score": 0.0021474369836979048, "phrase": "top_five_disease-drug_associations"}], "paper_keywords": [""], "paper_abstract": "Objective: Explore the automated acquisition of knowledge in biomedical and clinical documents using text mining and statistical techniques to identify disease-drug associations. Design: Biomedical literature and clinical narratives from the patient record were mined to gather knowledge about disease-drug associations. Two NLP systems, BioMedLEE and MedLEE, were applied to Medline articles and discharge summaries, respectively. Disease and drug entities were identified using the NLP systems in addition to MeSH annotations for the Medline articles. Focusing on eight diseases, co-occurrence statistics were applied to compute and evaluate the strength of association between each disease and relevant drugs. Results: Ranked lists of disease-drug pairs were generated and cutoffs calculated for identifying stronger associations among these pairs for further analysis. Differences and similarities between the text sources (i.e., biomedical literature and patient record) and annotations (i.e., MeSH and NLP-extracted UMLS concepts) with regards to disease-drug knowledge were observed. Conclusion: This paper presents a method for acquiring disease-specific knowledge and a feasibility study of the method. The method is based on applying a combination of NLP and statistical techniques to both biomedical and clinical documents. The approach enabled extraction of knowledge about the drugs clinicians are using for patients with specific diseases based on the patient record, while it is also acquired knowledge of drugs frequently involved in controlled trials for those same diseases. In comparing the disease-drug associations, we found the results to be appropriate: the two text sources contained consistent as well as complementary knowledge, and manual review of the top five disease-drug associations by a medical expert supported their correctness across the diseases.", "paper_title": "Automated acquisition of disease-drug knowledge from biomedical and clinical documents: An initial study", "paper_id": "WOS:000252312500013"}