{"auto_keywords": [{"score": 0.04840352423674945, "phrase": "heavy_hitters"}, {"score": 0.042657423330974685, "phrase": "thousand_currency_signi_center"}, {"score": 0.00481495049065317, "phrase": "distributed_heavy_hitters"}, {"score": 0.00456448259718331, "phrase": "distributed_streaming_model"}, {"score": 0.004389089062127892, "phrase": "data_distribution"}, {"score": 0.0039300808153474205, "phrase": "dot-heavy_hitters"}, {"score": 0.003607834976869384, "phrase": "element_x"}, {"score": 0.0031731685183735508, "phrase": "k_remote_sites"}, {"score": 0.003051073364818384, "phrase": "two-way_communication_channel"}, {"score": 0.002780783274864117, "phrase": "minimum_communication"}, {"score": 0.0027413748388534025, "phrase": "tracking_algorithms"}, {"score": 0.0027218799769229596, "phrase": "worst-case_communication_cost"}, {"score": 0.002570817338292482, "phrase": "total_number"}, {"score": 0.0024718415971488627, "phrase": "approximation_error"}, {"score": 0.0024108455980729284, "phrase": "previous_known_algorithms"}, {"score": 0.002359759876402679, "phrase": "lower_bounds"}, {"score": 0.0023346234464901978, "phrase": "communication_costs"}], "paper_keywords": [""], "paper_abstract": "We consider the problem of tracking heavy hitters and quantiles in the distributed streaming model. The heavy hitters and quantiles are two important statistics for characterizing a data distribution. Let A be a multiset of elements, drawn from the universe U={1,aEuro broken vertical bar,u}. For a given 0a parts per thousand currency signI center dot a parts per thousand currency sign1, the I center dot-heavy hitters are those elements of A whose frequency in A is at least I center dot|A|; the I center dot-quantile of A is an element x of U such that at most I center dot|A| elements of A are smaller than A and at most (1-I center dot)|A| elements of A are greater than x. Suppose the elements of A are received at k remote sites over time, and each of the sites has a two-way communication channel to a designated coordinator, whose goal is to track the set of I center dot-heavy hitters and the I center dot-quantile of A approximately at all times with minimum communication. We give tracking algorithms with worst-case communication cost O(k/I mu a <...logn) for both problems, where n is the total number of items in A, and I mu is the approximation error. This substantially improves upon the previous known algorithms. We also give matching lower bounds on the communication costs for both problems, showing that our algorithms are optimal. We also consider a more general version of the problem where we simultaneously track the I center dot-quantiles for all 0a parts per thousand currency signI center dot a parts per thousand currency sign1.", "paper_title": "Optimal Tracking of Distributed Heavy Hitters and Quantiles", "paper_id": "WOS:000313115700009"}