{"auto_keywords": [{"score": 0.03971731192546081, "phrase": "\"crying_baby\"_problem"}, {"score": 0.010369673558879994, "phrase": "pacifier"}, {"score": 0.00481495049065317, "phrase": "reliable_multicast"}, {"score": 0.004774324145784758, "phrase": "\"crying_babies"}, {"score": 0.004714023408114857, "phrase": "wireless_mesh_networks"}, {"score": 0.004615202066192795, "phrase": "unicast_routing"}, {"score": 0.004576253356889219, "phrase": "high-throughput_reliable_multicast_routing"}, {"score": 0.004046923261950549, "phrase": "wireless_links"}, {"score": 0.003945266418163835, "phrase": "varying_channel_conditions"}, {"score": 0.0036553070575015344, "phrase": "multicast_source"}, {"score": 0.0036090884921108086, "phrase": "varying_throughput"}, {"score": 0.003578600071301459, "phrase": "different_multicast_receivers"}, {"score": 0.003459191419478298, "phrase": "reliability_requirement"}, {"score": 0.0034299649219748513, "phrase": "poorly_connected_receivers"}, {"score": 0.0033579708256295847, "phrase": "performance_degradation"}, {"score": 0.0023309080951251335, "phrase": "average_throughput"}, {"score": 0.0023013968622710847, "phrase": "state-of-the-art_reliable_network_coding-based_protocol"}, {"score": 0.0021049977753042253, "phrase": "well-connected_receivers"}], "paper_keywords": ["Network coding", " reliable multicast", " wireless mesh networks (WMNs)"], "paper_abstract": "In contrast to unicast routing, high-throughput reliable multicast routing in wireless mesh networks (WMNs) has received little attention. There are two primary challenges to supporting high-throughput, reliable multicast in WMNs. The first is no different from unicast: Wireless links are inherently lossy due to varying channel conditions and interference. The second, known as the \"crying baby\" problem, is unique to multicast: The multicast source may have varying throughput to different multicast receivers, and hence trying to satisfy the reliability requirement for poorly connected receivers can potentially result in performance degradation for the rest of the receivers. In this paper, we propose Pacifier, a new high-throughput, reliable multicast protocol for WMNs. Pacifier seamlessly integrates four building blocks-namely, tree-based opportunistic routing, intraflow network coding, source rate limiting, and round-robin batching-to support high-throughput, reliable multicast routing in WMNs, while at the same time it effectively addresses the \"crying baby\" problem. Our experiments on a 22-node IEEE 802.11 WMN testbed show that Pacifier increases the average throughput over a state-of-the-art reliable network coding-based protocol MORE by up to 144%, while at the same time it solves the \"crying baby\" problem by improving the throughput of well-connected receivers by up to a factor of 14.", "paper_title": "Pacifier: High-Throughput, Reliable Multicast Without \"Crying Babies\" in Wireless Mesh Networks", "paper_id": "WOS:000310141400004"}