{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wireless_sensor_networks"}, {"score": 0.0045726187330434025, "phrase": "object_monitoring"}, {"score": 0.004533427352547707, "phrase": "path_protection"}, {"score": 0.004475266375001531, "phrase": "area_coverage"}, {"score": 0.004342430078306461, "phrase": "important_and_critical_objects"}, {"score": 0.004231699728933577, "phrase": "natural_question"}, {"score": 0.00307657476125683, "phrase": "first_time"}, {"score": 0.003037047249598515, "phrase": "formal_study"}, {"score": 0.0029980260560551982, "phrase": "self-protection_problems"}, {"score": 0.0024799423362011582, "phrase": "different_forms"}, {"score": 0.002365512939162727, "phrase": "np"}, {"score": 0.002304606411453748, "phrase": "efficient_approximation_algorithms"}, {"score": 0.0022848092812445533, "phrase": "centrally_controlled_sensors"}, {"score": 0.0021416404045850224, "phrase": "smart_sleep-scheduling_algorithm"}, {"score": 0.0021049977753042253, "phrase": "energy_consumption"}], "paper_keywords": ["algorithms", " design", " experimentation", " sensor networks", " coverage", " protection"], "paper_abstract": "Wireless sensor networks have recently been suggested for many surveillance applications, such as object monitoring, path protection, or area coverage. Since the sensors themselves are important and critical objects in the network, a natural question is whether they need certain level of protection, so as to resist the attacks targeting on them directly. If this is necessary, then who should provide this protection, and how it can be done? We refer to the above problem as self-protection, as we believe the sensors themselves are the best (and often the only) candidates to provide such protection. In this article, we for the first time present a formal study on the self-protection problems in wireless sensor networks. We show that, if we simply focus on enhancing the quality of field or object covering, the sensors might not necessarily be self-protected, which in turn makes the system extremely vulnerable. We then investigate different forms of self-protections, and show that the problems are generally NP-complete. We develop efficient approximation algorithms for centrally controlled sensors. We further extend the algorithms to fully distributed implementation, and introduce a smart sleep-scheduling algorithm that minimizes the energy consumption.", "paper_title": "The self-protection problem in wireless sensor networks", "paper_id": "WOS:000258297900003"}