{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "compositional_changes"}, {"score": 0.004781777766309739, "phrase": "world_river's_water_chemistry"}, {"score": 0.004401011982385274, "phrase": "metric_concept"}, {"score": 0.00425141240073214, "phrase": "statistical_point"}, {"score": 0.004149716134716874, "phrase": "application_examples"}, {"score": 0.004036455094603843, "phrase": "confidence_regions"}, {"score": 0.003953534569134559, "phrase": "analyzed_data"}, {"score": 0.003576060405460302, "phrase": "compositional_vector"}, {"score": 0.0030390745780621503, "phrase": "whole_compositional_vector"}, {"score": 0.002692132776447632, "phrase": "euclidean_space"}, {"score": 0.002655087144676306, "phrase": "restricted_part"}, {"score": 0.00246877952076635, "phrase": "d-dimensional_real_space"}, {"score": 0.002392980687386204, "phrase": "r_space"}, {"score": 0.0023437424558633013, "phrase": "basic_algebraic_operations"}, {"score": 0.002319503690965857, "phrase": "inner_product"}, {"score": 0.002248277737254846, "phrase": "euclidean_vector_space_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["River geochemistry", " Distance", " Simplex space", " Compositions"], "paper_abstract": "The paper is designed to give the reader an outline that is useful for understanding the importance of distance, as a metric concept, and its implications when compositional (geochemical) data are managed from a statistical point of view in a given sample space. Application examples are shown by considering the construction of confidence regions and mixing models. The analyzed data are related to the chemistry of the most important rivers of the world as referring to the GEMS/WATER Global Register of River Inputs when each sample (river) is represented as a composition. A compositional vector of d parts, x = [x(1),x(2),...,x(d)], is defined as a vector in which the only relevant information is contained in the ratios between its components. All the components of the vector are assumed positive and are called parts (variables), while the whole compositional vector, with the sum of the parts equal to a constant, represents the composition. In this case data are not represented by variables free to vary from 00 to +infinity within a Euclidean space but occupy a restricted part of it called the simplex. The d-part simplex. S(d), is a subset of a d-dimensional real space. In this context the metric of the R space, with the definition of basic algebraic operations and of inner product, norm and distance, thus giving an Euclidean vector space structure, cannot be applied since the scale is relative and not absolute. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Metric concepts and implications in describing compositional changes for world river's water chemistry", "paper_id": "WOS:000291419100004"}