{"auto_keywords": [{"score": 0.04964635174824772, "phrase": "neighborhood_rough_set_model"}, {"score": 0.008277289744044103, "phrase": "positive_region"}, {"score": 0.005632091712552308, "phrase": "quick_reduct_algorithm"}, {"score": 0.00481495049065317, "phrase": "reduct_algorithm"}, {"score": 0.0045804107341714, "phrase": "efficient_quick_attribute_reduct_algorithm"}, {"score": 0.0041827333568982055, "phrase": "whole_data"}, {"score": 0.003600351201298387, "phrase": "record's_theta-neighborhood_elements"}, {"score": 0.0031271133933467575, "phrase": "new_fast_algorithm"}, {"score": 0.0028037753646260937, "phrase": "vertical_bar_u_vertical_bar"}, {"score": 0.0026069623057065664, "phrase": "new_fast_positive_region_computation_algorithm"}, {"score": 0.0022743274702883456, "phrase": "comparable_experiments"}, {"score": 0.0022434880661725493, "phrase": "especially_this_algorithm"}, {"score": 0.0021632743048552536, "phrase": "big_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Neighborhood rough set", " Attribute reduct", " Bucket"], "paper_abstract": "In this paper, we propose an efficient quick attribute reduct algorithm based on neighbor-hood rough set model. In this algorithm we divide the objects (records) of the whole data set into a series of buckets based on their Euclidean distances, and then iterate each record by the sequence of buckets to calculate the positive region of neighborhood rough set model. We also prove that each record's theta-neighborhood elements can only be contained in its own bucket and its adjacent buckets, thus it can reduce the iterations greatly. Based on the division of buckets, we then present a new fast algorithm to calculate the positive region of neighborhood rough set model, which can achieve a complexity of O(m vertical bar U vertical bar), m is the number of attributes, vertical bar U vertical bar is the number of records containing in the data set. Furthermore, with the new fast positive region computation algorithm, we present a quick reduct algorithm for neighborhood rough set model, and our algorithm can achieve a complexity of O(m(2)vertical bar U vertical bar). At last, the efficiency of this quick reduct algorithm is proved by comparable experiments, and especially this algorithm is more suitable for the reduction of big data. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Quick attribute reduct algorithm for neighborhood rough set model", "paper_id": "WOS:000336011900005"}