{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "design_patterns"}, {"score": 0.010516506735069962, "phrase": "software_packages"}, {"score": 0.004706305193222972, "phrase": "open-source_software_communities"}, {"score": 0.004621148492564008, "phrase": "successful_open-source_projects"}, {"score": 0.004475798524102238, "phrase": "source_code"}, {"score": 0.004354841111644036, "phrase": "great_reuse_opportunities"}, {"score": 0.004315249628884236, "phrase": "software_developers"}, {"score": 0.0040479661688863884, "phrase": "open_source_software_reuse"}, {"score": 0.003832031470970347, "phrase": "common_design_problems"}, {"score": 0.00325069754015951, "phrase": "white_box_reuse"}, {"score": 0.003148316319108045, "phrase": "open_source_communities"}, {"score": 0.002993887707344862, "phrase": "case_study"}, {"score": 0.00243694486220507, "phrase": "design_pattern_based_class_selection"}, {"score": 0.002370955769074803, "phrase": "white-box_reuse"}, {"score": 0.0021834945657804193, "phrase": "different_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Design patterns", " Design", " Quality", " Reusability", " Empirical approach"], "paper_abstract": "Nowadays open-source software communities are thriving. Successful open-source projects are competitive and the amount of source code that is freely available offers great reuse opportunities to software developers. Thus, it is expected that several requirements can be implemented based on open source software reuse. Additionally, design patterns, i.e. well-known solution to common design problems, are introduced as elements of reuse. This study attempts to empirically investigate the reusability of design patterns, classes and software packages. Thus, the results can help developers to identify the most beneficial starting points for white box reuse, which is quite popular among open source communities. In order to achieve this goal we conducted a case study on one hundred (100) open source projects. More specifically, we identified 27,461 classes that participate in design patterns and compared the reusability of each of these classes with the reusability of the pattern and the package that this class belongs to. In more than 40% of the cases investigated, design pattern based class selection, offers the most reusable starting point for white-box reuse. However there are several cases when package based selection might be preferable. The results suggest that each pattern has different level of reusability. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "An empirical investigation on the reusability of design patterns and software packages", "paper_id": "WOS:000296415100018"}