{"auto_keywords": [{"score": 0.04733190377720633, "phrase": "linear_combination"}, {"score": 0.015567537886639652, "phrase": "block-sparse_recovery"}, {"score": 0.010589602965430529, "phrase": "block-sparse_inference"}, {"score": 0.009840540580956514, "phrase": "block_subdictionaries"}, {"score": 0.009579233870825089, "phrase": "large_class"}, {"score": 0.00481495049065317, "phrase": "random_block_subdictionaries"}, {"score": 0.004709567162738894, "phrase": "linear_model"}, {"score": 0.004299910946753963, "phrase": "signal_processing_literature"}, {"score": 0.004236908273106904, "phrase": "linear_models"}, {"score": 0.004133940019630129, "phrase": "reliable_inference"}, {"score": 0.004053362743156545, "phrase": "renewed_attention"}, {"score": 0.0036105923401756126, "phrase": "small_number"}, {"score": 0.0035141291835319682, "phrase": "block-sparse_case"}, {"score": 0.003247868216333148, "phrase": "prior_work"}, {"score": 0.0031223774204093713, "phrase": "polynomial_time"}, {"score": 0.0030614565460256897, "phrase": "near-optimal_scaling"}, {"score": 0.002843372121209168, "phrase": "spectral_norm"}, {"score": 0.0027200305495826797, "phrase": "well-conditioned_block_subdictionaries"}, {"score": 0.002538687900036229, "phrase": "block-sparse_regression"}, {"score": 0.002404706573379854, "phrase": "near-optimal_block-sparse_recovery"}, {"score": 0.00216286410656986, "phrase": "extensive_numerical_experiments"}, {"score": 0.002131106613512969, "phrase": "different_measures"}, {"score": 0.0021049977753042253, "phrase": "block-sparse_inference_problems"}], "paper_keywords": ["Block-sparse inference", " block-sparse recovery", " block-sparse regression", " compressed sensing", " group lasso", " group sparsity", " high-dimensional statistics", " multiple measurement vectors", " random block subdictionaries"], "paper_abstract": "The linear model, in which a set of observations is assumed to be given by a linear combination of columns of a matrix (often termed a dictionary), has long been the mainstay of the statistics and signal processing literature. One particular challenge for inference under linear models is understanding the conditions on the dictionary under which reliable inference is possible. This challenge has attracted renewed attention in recent years, since many modern inference problems (e.g., high-dimensional statistics and compressed sensing) deal with the underdetermined setting, in which the number of observations is much smaller than the number of columns in the dictionary. This paper makes several contributions for this setting when the set of observations is given by a linear combination of a small number of groups of columns of the dictionary, termed the block-sparse case. First, it specifies conditions on the dictionary under which most block submatrices of the dictionary (often termed block subdictionaries) are well conditioned. This result is fundamentally different from prior work on block-sparse inference because: 1) it provides conditions that can be explicitly computed in polynomial time; 2) the given conditions translate into near-optimal scaling of the number of columns of the block subdictionaries as a function of the number of observations for a large class of dictionaries; and 3) it suggests that the spectral norm, rather than the column/block coherences of the dictionary, fundamentally limits the scaling of dimensions of the well-conditioned block subdictionaries. Second, in order to help understand the significance of this result in the context of block-sparse inference, this paper investigates the problems of block-sparse recovery and block-sparse regression in underdetermined settings. In both of these problems, this paper utilizes its result concerning conditioning of block subdictionaries and establishes that near-optimal block-sparse recovery and block-sparse regression is possible for a large class of dictionaries as long as the dictionary satisfies easily computable conditions and the coefficients describing the linear combination of groups of columns can be modeled through a mild statistical prior. Third, the paper reports extensive numerical experiments that highlight the effects of different measures of the dictionary in block-sparse inference problems.", "paper_title": "Conditioning of Random Block Subdictionaries With Applications to Block-Sparse Recovery and Regression", "paper_id": "WOS:000356301600025"}