{"auto_keywords": [{"score": 0.041851968963554545, "phrase": "tag_stream_index"}, {"score": 0.00481495049065317, "phrase": "xml_document"}, {"score": 0.004692227830462433, "phrase": "branch_queries"}, {"score": 0.004632039024076267, "phrase": "branch_query_processing"}, {"score": 0.004543193737836748, "phrase": "core_operation"}, {"score": 0.004484908028307205, "phrase": "xml_query_processing"}, {"score": 0.004231699728933577, "phrase": "based_twig_join_algorithms"}, {"score": 0.0040708542958968605, "phrase": "twig_queries"}, {"score": 0.003310447652300423, "phrase": "large_document"}, {"score": 0.002709161672473817, "phrase": "structured_xml_document"}, {"score": 0.0025725382476862305, "phrase": "efficient_algorithms_kmp-match-path"}, {"score": 0.002260301305523054, "phrase": "experimental_results"}, {"score": 0.0022168460543913787, "phrase": "proposed_query_processing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "good_scalability"}], "paper_keywords": [""], "paper_abstract": "Branch query processing is a core operation of XML query processing. In recent years, a number of stack based twig join algorithms have been proposed to process twig queries based on tag stream index. However, each element is labeled separately in tag stream index, similarity of same structured elements is ignored; besides, algorithms based on tag stream index perform worse on large document. In this paper, we propose a novel index Clustered Chain Path Index (CCPI for brief) based on a novel labeling scheme: Clustered Chain Path labeling. The index provides good properties for efficiently processing branch queries. It also has the same cardinality as I-index against tree structured XML document. Based on CCPI, we design efficient algorithms KMP-Match-Path to process queries without branches and Related-Path-Segment-Join to process queries with branches. Experimental results show that proposed query processing algorithms based on CCPI outperform other algorithms and have good scalability.", "paper_title": "Clustered chain path index for XML document: Efficiently processing branch queries", "paper_id": "WOS:000241624200046"}