{"auto_keywords": [{"score": 0.048227032269683064, "phrase": "kernel_clustering"}, {"score": 0.00787638539007254, "phrase": "kernel_space"}, {"score": 0.00481495049065317, "phrase": "kernel_versions"}, {"score": 0.004769958800452922, "phrase": "recent_past"}, {"score": 0.004752079496775914, "phrase": "different_kernelized_versions"}, {"score": 0.00443308765153716, "phrase": "basic_question"}, {"score": 0.00422177384286051, "phrase": "clustering_algorithm"}, {"score": 0.00419016653753787, "phrase": "natural_subgroups"}, {"score": 0.004005410765048467, "phrase": "data_x"}, {"score": 0.0039456466422100045, "phrase": "nonlinear_transformation"}, {"score": 0.0034332736827447654, "phrase": "new_structure"}, {"score": 0.003350370138439897, "phrase": "desired_clusters"}, {"score": 0.003154701855951328, "phrase": "actual_clusters"}, {"score": 0.003066945490483524, "phrase": "transformed_space"}, {"score": 0.0028127163745564777, "phrase": "completely_irrelevant_clusters"}, {"score": 0.002729307099580315, "phrase": "philosophical_one"}, {"score": 0.0026583500966092044, "phrase": "particular_transformation"}, {"score": 0.0023390219342052623, "phrase": "normalized_mutual_information"}, {"score": 0.002330233210731173, "phrase": "adjusted_rand_index"}, {"score": 0.0023171118612446144, "phrase": "cluster_instability"}, {"score": 0.002291089893848235, "phrase": "sammon's_nonlinear_projection_method"}, {"score": 0.0022739041015999105, "phrase": "crude_visual_representation"}, {"score": 0.0022064376000055764, "phrase": "appropriate_parameters"}, {"score": 0.0021940118003312397, "phrase": "kernel_function"}, {"score": 0.002116920513039097, "phrase": "kernel_parameters"}, {"score": 0.0021049977753042253, "phrase": "algorithmic_parameters"}], "paper_keywords": ["Feature space", " fuzzy C-means (FCM)", " kernel fuzzy C-means", " kernel space"], "paper_abstract": "In the recent past, different kernelized versions of c-means (hard and fuzzy) clustering algorithms have been proposed. Here, we focus on kernel clustering of only object data, X = {x(1),..., x(n)} subset of R-p. We first raise a basic question: Should we really cluster any given object data in the kernel space? The answer is NO! Here are our line of arguments: 1) The objective of any clustering algorithm is to find natural subgroups in X, where the subgroups are defined by a measure of similarity between the vectors in X. 2) If we transform the data X into Y in another space by a nonlinear transformation and try to find clusters in Y, then such clusters can be useful if and only if Y helps us to find the same clusters that are present in X because that is our objective. 3) If Y maintains the same structure/topology as that of X, then the use of Y may not give any advantage. 4) On the other hand, if Y changes the structure (i.e., imposes a new structure) on the data and that change makes the extraction of the desired clusters present in X easier, then clustering of Y is useful. 5) But when Y imposes new (nonexistent) structures, the clustering algorithm may find very strange clusters with no relation to the actual clusters present in X. 6) Thus, when we try to cluster in a transformed space, the issue is to know if it could help us to find the clusters present in X. To get any benefit from kernel clustering (or clustering in any other transformed space), we need to answer this question first; otherwise, we may find completely irrelevant clusters without knowing it and thereby making kernel clustering useless. 7) This issue is a philosophical one and is neither dependent on the choice of clustering algorithm nor on the particular transformation (kernel function) used. 8) Except for 2-D/3-D data, we do not know of any way to answer the question in 6) and for 2-D/3-D data, since we can look at the data, we do not need kernel clustering. Therefore, there is no benefit from kernel clustering. We demonstrate and justify our claims using both synthetic and real datasets with visual assessment as well as with normalized mutual information, adjusted Rand index, and cluster instability. We propose to use Sammon's nonlinear projection method to get a crude visual representation of the data in the kernel space. We discuss the issue of how to choose appropriate parameters of the kernel function, but we could not provide a solution to this problem. Finally, we discuss how the kernel parameters and the algorithmic parameters interact.", "paper_title": "What and When Can We Gain From the Kernel Versions of C-Means Algorithm?", "paper_id": "WOS:000334178800011"}