{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "naive-bayes_learning"}, {"score": 0.03864783489310989, "phrase": "discretization_bias"}, {"score": 0.008227071323806295, "phrase": "naive-bayes_classifiers"}, {"score": 0.004761132425263795, "phrase": "managing_discretization_bias"}, {"score": 0.004655285779819366, "phrase": "quantitative_attributes"}, {"score": 0.004425616928975799, "phrase": "simple_conditions"}, {"score": 0.004183638135671596, "phrase": "true_probability_density_function"}, {"score": 0.004022137057452406, "phrase": "different_discretization_techniques"}, {"score": 0.0038668462001710314, "phrase": "classification_bias"}, {"score": 0.00378080526397273, "phrase": "generated_naive-bayes_classifiers"}, {"score": 0.0033218213825698417, "phrase": "naive-bayes_classification_error"}, {"score": 0.002918394200972564, "phrase": "training_instances"}, {"score": 0.002464709648714996, "phrase": "experimental_results"}, {"score": 0.0023694065215394593, "phrase": "statistically_significant_frequency"}, {"score": 0.0022020622730208514, "phrase": "lower_classification_error"}, {"score": 0.0021049977753042253, "phrase": "current_established_discretization_methods"}], "paper_keywords": ["Discretization", " Naive-Bayes Learning", " Bias", " Variance"], "paper_abstract": "Quantitative attributes are usually discretized in Naive-Bayes learning. We establish simple conditions under which discretization is equivalent to use of the true probability density function during naive-Bayes learning. The use of different discretization techniques can be expected to affect the classification bias and variance of generated naive-Bayes classifiers, effects we name discretization bias and variance. We argue that by properly managing discretization bias and variance, we can effectively reduce naive-Bayes classification error. In particular, we supply insights into managing discretization bias and variance by adjusting the number of intervals and the number of training instances contained in each interval. We accordingly propose proportional discretization and fixed frequency discretization, two efficient unsupervised discretization methods that are able to effectively manage discretization bias and variance. We evaluate our new techniques against four key discretization methods for naive-Bayes classifiers. The experimental results support our theoretical analyses by showing that with statistically significant frequency, naive-Bayes classifiers trained on data discretized by our new methods are able to achieve lower classification error than those trained on data discretized by current established discretization methods.", "paper_title": "Discretization for naive-Bayes learning: managing discretization bias and variance", "paper_id": "WOS:000262125400003"}