{"auto_keywords": [{"score": 0.046081391722127746, "phrase": "protein_function_inference"}, {"score": 0.00481495049065317, "phrase": "family-specific_residue_packing_motifs"}, {"score": 0.004700027722284931, "phrase": "structure-based_protein_function_prediction"}, {"score": 0.004246428036409373, "phrase": "accompanying_paper"}, {"score": 0.0041450181887917135, "phrase": "family-specific_motifs"}, {"score": 0.0038364365168131586, "phrase": "protein_family"}, {"score": 0.0036553124928363533, "phrase": "scop"}, {"score": 0.0036202551249310748, "phrase": "ec"}, {"score": 0.0035336109352157763, "phrase": "discriminating_power"}, {"score": 0.003270396852243212, "phrase": "unweighted_topological_graph_representations"}, {"score": 0.0030267296900520217, "phrase": "function_inference"}, {"score": 0.002801166393333128, "phrase": "new_members"}, {"score": 0.002760778494680823, "phrase": "scop_families"}, {"score": 0.0024342079318127423, "phrase": "structural_genomics_projects"}, {"score": 0.0023990982005125763, "phrase": "orphan_structures"}, {"score": 0.002135812692862058, "phrase": "independent_experimental_studies"}], "paper_keywords": ["Structural genomics", " Protein graphs", " Protein function prediction", " Family-specific motifs", " Frequent subgraph mining", " Orphan proteins"], "paper_abstract": "This paper describes several case studies concerning protein function inference from its structure using our novel approach described in the accompanying paper. This approach employs family-specific motifs, i.e. three-dimensional amino acid packing patterns that are statistically prevalent within a protein family. For our case studies we have selected families from the SCOP and EC classifications and analyzed the discriminating power of the motifs in depth. We have devised several benchmarks to compare motifs mined from unweighted topological graph representations of protein structures with those from distance-labeled (weighted) representations, demonstrating the superiority of the latter for function inference in most families. We have tested the robustness of our motif library by inferring the function of new members added to SCOP families, and discriminating between several families that are structurally similar but functionally divergent. Furthermore we have applied our method to predict function for several proteins characterized in structural genomics projects, including orphan structures, and we discuss several selected predictions in depth. Some of our predictions have been corroborated by other computational methods, and some have been validated by independent experimental studies, validating our approach for protein function inference from structure.", "paper_title": "Identification of family-specific residue packing motifs and their use for structure-based protein function prediction: II. Case studies and applications", "paper_id": "WOS:000272301700005"}