{"auto_keywords": [{"score": 0.025443520270282752, "phrase": "mobile_phone"}, {"score": 0.00481495049065317, "phrase": "home_base"}, {"score": 0.004621984064678252, "phrase": "mobile_telephones"}, {"score": 0.004436716583179764, "phrase": "information_and_communication_technologies"}, {"score": 0.004138575034269399, "phrase": "mobile_telephony"}, {"score": 0.003876226041373242, "phrase": "family_life_shape"}, {"score": 0.0036008372531664726, "phrase": "primary_caregivers"}, {"score": 0.00357146811369898, "phrase": "five_families"}, {"score": 0.0030193416820392554, "phrase": "different_kinds"}, {"score": 0.0027253441561528495, "phrase": "institutional_schedules"}, {"score": 0.0027030963394733916, "phrase": "transition_times"}, {"score": 0.0026810296502682916, "phrase": "children's_activities"}, {"score": 0.002659142621852998, "phrase": "important_moments"}, {"score": 0.002637433799290365, "phrase": "mobile_phone_use"}, {"score": 0.0024398167078355224, "phrase": "parents'_work"}, {"score": 0.0023322317017275803, "phrase": "wider_reach"}, {"score": 0.002275557501858879, "phrase": "physical_house"}, {"score": 0.002184137736856711, "phrase": "direct_line"}, {"score": 0.0021049977753042253, "phrase": "\"home_base"}], "paper_keywords": [""], "paper_abstract": "More attention is being paid to the development of information and communication technologies (ICTs) that are sensitive to the needs of people in their homes. By studying mobile telephony in such settings, we contribute to this discussion by examining how behaviors and characteristics of family life shape and in turn are shaped by ICTs. We present the results of a study of the primary caregivers in five families who were studied over the course of a week. We found that parents only relaxed their attachment to their mobile phones when in the presence of their children. Parents and other families perceived their phones as a means of staying connected or tethered across different kinds of situations. Ages of children and their involvement with other institutions beyond the family affected how parents oriented to their mobile phones, matching their parental shift work to those institutional schedules. Transition times between children's activities were important moments for mobile phone use between child and parent as well as parent and others because those transitions also marked a change in parents' work. Ultimately, the mobile phone facilitated the extension of a wider reach of \"home\" beyond the physical house, meaning that the parent-enhanced by the direct line of the mobile phone-was the embodiment of \"home base\".", "paper_title": "When home base is not a place: parents' use of mobile telephones", "paper_id": "WOS:000247851200003"}