{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "physical_traveling_salesman_problem"}, {"score": 0.004422632150619634, "phrase": "real-time_game"}, {"score": 0.003948613642680196, "phrase": "physical_traveling_salesman"}, {"score": 0.003678414118674967, "phrase": "good_balance"}, {"score": 0.003643807817480753, "phrase": "long-term_planning"}, {"score": 0.0035755653799043, "phrase": "optimal_sequence"}, {"score": 0.003102752392819577, "phrase": "ptsp_competitions"}, {"score": 0.0029039692582303904, "phrase": "optimal_order"}, {"score": 0.0028093921138602606, "phrase": "monte_carlo_tree_search"}, {"score": 0.0025316905609748135, "phrase": "search_space"}, {"score": 0.0021656385587456952, "phrase": "best_controller"}, {"score": 0.0021049977753042253, "phrase": "ptsp."}], "paper_keywords": ["Computational and artificial intelligence", " game search", " Monte Carlo tree search", " real-time games", " reinforcement learning"], "paper_abstract": "This paper presents a number of approaches for solving a real-time game consisting of a ship that must visit a number of waypoints scattered around a 2-D maze full of obstacles. The game, the Physical Traveling Salesman Problem (PTSP), which featured in two IEEE conference competitions during 2012, provides a good balance between long-term planning (finding the optimal sequence of waypoints to visit), and short-term planning (driving the ship in the maze). This paper focuses on the algorithm that won both PTSP competitions: it takes advantage of the physics of the game to calculate the optimal order of waypoints, and it employs Monte Carlo tree search (MCTS) to drive the ship. The algorithm uses repetitions of actions (macro actions) to reduce the search space for navigation. Variations of this algorithm are presented and analyzed, in order to understand the strength of each one of its constituents and to comprehend what makes such an approach the best controller found so far for the PTSP.", "paper_title": "Solving the Physical Traveling Salesman Problem: Tree Search and Macro Actions", "paper_id": "WOS:000333115100003"}