{"auto_keywords": [{"score": 0.04532113932343013, "phrase": "time-span_tree"}, {"score": 0.016927319067122464, "phrase": "gttm"}, {"score": 0.010612387000973441, "phrase": "generative_theory"}, {"score": 0.010524705135414827, "phrase": "tonal_music"}, {"score": 0.008067795309504043, "phrase": "time-span_trees"}, {"score": 0.004637478829869904, "phrase": "music_analysing_system"}, {"score": 0.004392566378824778, "phrase": "atta"}, {"score": 0.00421297029755273, "phrase": "structural_importance"}, {"score": 0.003763763153640936, "phrase": "music_summarization"}, {"score": 0.0037324526526073404, "phrase": "collaborative_music_creation_systems"}, {"score": 0.003535165233011893, "phrase": "current_systems"}, {"score": 0.002953711377604328, "phrase": "novel_computational_model"}, {"score": 0.0028209599545587745, "phrase": "computer_implementation"}, {"score": 0.0027857990883821504, "phrase": "main_advantage"}, {"score": 0.0026941587813581252, "phrase": "adjustable_parameters"}, {"score": 0.0022133711375320244, "phrase": "baseline_performance"}, {"score": 0.002149494537191303, "phrase": "time-span_tree_analyser"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a music analysing system called the automatic time-span tree analyser (ATTA). ATTA derives a time-span tree that assigns a hierarchy of \"structural importance'' to the notes of a piece of music based on the generative theory of tonal music (GTTM). Although the time-span tree has been applied in music summarization and collaborative music creation systems, these systems use time-span trees manually analysed by experts in musicology. Current systems based on GTTM cannot acquire a time-span tree without manual application of most of the rules, since GTTM does not resolve much of the ambiguity involved in the application of the rules. To solve this problem, we propose a novel computational model of GTTM that re-formalizes the rules through a computer implementation. The main advantage of our approach is that we can introduce adjustable parameters, which enables us to assign priorities to the rules. Our analyser automatically acquires time-span trees by con. guring the parameters that cover 17 out of 26 GTTM rules for constructing a time-span tree. Experimental results show that after these parameters were tuned, our method could outperform a baseline performance. We hope to distribute the time-span tree analyser as a tool for various musical tasks, such as searching and arranging music.", "paper_title": "Implementing \"A generative theory of tonal music\"", "paper_id": "WOS:000250551300001"}