{"auto_keywords": [{"score": 0.039657898096017025, "phrase": "cultural_differences"}, {"score": 0.03201662733684558, "phrase": "social_capital"}, {"score": 0.030670742829236146, "phrase": "sns"}, {"score": 0.00470975295439431, "phrase": "social_network_services"}, {"score": 0.0043115349257014015, "phrase": "facebook"}, {"score": 0.004273415599028542, "phrase": "myspace"}, {"score": 0.003877329308854808, "phrase": "human-computer_interaction"}, {"score": 0.003350740737336966, "phrase": "web-based_survey_study"}, {"score": 0.0032199307816384577, "phrase": "people's_republic_of_china"}, {"score": 0.0030942116765996426, "phrase": "sns_users"}, {"score": 0.0029733865110222785, "phrase": "social_capital_theory"}, {"score": 0.0029212075318449616, "phrase": "five_functions"}, {"score": 0.00278237555651743, "phrase": "contents_sharing"}, {"score": 0.002721464488351771, "phrase": "social_capital-related_activities"}, {"score": 0.002535344521369057, "phrase": "web-based_survey"}, {"score": 0.002351485871160907, "phrase": "diverse_usage_patterns"}, {"score": 0.0022696277881969896, "phrase": "korean_and_chinese_users"}, {"score": 0.0022496114364599328, "phrase": "bridging_and_bonding_social_capital_mainly_through_expert_search_and_connection_functions"}, {"score": 0.0022199503939553367, "phrase": "american"}], "paper_keywords": [""], "paper_abstract": "With the advent of Web 2.0, social network services (SNSs), such as Facebook and MySpace, have grown explosively and globally as one of core Web 2.0 applications. However, as revealed in other cultural comparison studies in the field of human-computer interaction, it is believed that cultural differences profoundly impact on how people use SNSs. Unfortunately, the differences in using SNSs have not been systematically investigated, so this study presents a web-based survey study among three nations: Republic of Korea, People's Republic of China, and the United States of America. It was assumed that SNS users form bridging and bonding social capital (borrowed from social capital theory) through the five functions of SNS that were categorized: Identity, Expert Search, Connection, Communication, and Contents Sharing. A correlation between social capital-related activities and usage patterns of SNS was expected. A total of 489 responded to the web-based survey through the three counties. Although the theory of cultural differences turned out to be insufficient to explain diverse usage patterns of SNSs, the results showed that Korean and Chinese users form bridging and bonding social capital mainly through Expert Search and Connection functions, but American users mainly use the Communication function to form bonding Social Capital. Various implications of these results for researchers and practitioners who work on and for SNSs are described as well.", "paper_title": "The Influence of Cultural Differences on the Use of Social Network Services and the Formation of Social Capital", "paper_id": "WOS:000283872800006"}