{"auto_keywords": [{"score": 0.046295259069903005, "phrase": "end_users"}, {"score": 0.03040635374985507, "phrase": "layout_rules"}, {"score": 0.008968933421847944, "phrase": "source_programs"}, {"score": 0.0048151245930148755, "phrase": "windows"}, {"score": 0.004308455856718928, "phrase": "previous_experiences"}, {"score": 0.0041450181887917135, "phrase": "user_interface_guidelines"}, {"score": 0.004007083686875716, "phrase": "software_package"}, {"score": 0.00376293585033711, "phrase": "different_experiences"}, {"score": 0.00320770578058916, "phrase": "consistent_guis"}, {"score": 0.00317681090697906, "phrase": "existing_software_packages"}, {"score": 0.003070996252787868, "phrase": "window_layouts"}, {"score": 0.002707829887747594, "phrase": "developed_guis"}, {"score": 0.002446024708601971, "phrase": "undeveloped_guis"}, {"score": 0.0023303871145705954, "phrase": "existing_guis"}, {"score": 0.0023079225317714815, "phrase": "software_packages"}, {"score": 0.0021049977753042253, "phrase": "layout_consistency"}], "paper_keywords": ["GUI", " usability", " consistency", " layout"], "paper_abstract": "To realize usability in software, GUI (Graphical User Interface) layouts must be consistent because consistency allows end users to operate software based on previous experiences. Often consistency can be achieved by user interface guidelines, which realize consistency in a software package as well as between various software packages within a platform. Because end users have different experiences and perceptions, GUIs based on guidelines are not always usable for end users. Thus, it is necessary to realize consistency without guidelines. Herein we propose a method to realize consistent GUIs where existing software packages are surveyed and common patterns for window layouts, which we call layout rules, are specified. Our method uses these layout rules to arrange the windows of GUIs. Concretely, source programs of developed GUIs are analyzed to identify the layout rules, and then these rules are used to extract parameters to generate source programs of undeveloped GUIs. To evaluate our method, we applied it to existing GUIs in software packages to extract the layout rules from several windows and to generate other windows. The evaluation confirms that our method easily realizes layout consistency.", "paper_title": "Method for Consistent GUI Arrangements by Analyzing Existing Windows and Its Evaluation", "paper_id": "WOS:000342784200008"}