{"auto_keywords": [{"score": 0.04865678212430773, "phrase": "wireless_sensor_networks"}, {"score": 0.00481495049065317, "phrase": "distributed_push-pull"}, {"score": 0.004728624975677976, "phrase": "node_localization"}, {"score": 0.004588158931776543, "phrase": "great_deal"}, {"score": 0.004533142516832776, "phrase": "research_achievements"}, {"score": 0.0038284549148537373, "phrase": "distributed_ability_design"}, {"score": 0.0036479584876742085, "phrase": "new_algorithm"}, {"score": 0.003232956879952914, "phrase": "current_calculated_distances"}, {"score": 0.002882401671602977, "phrase": "ppe"}, {"score": 0.0027133856739937133, "phrase": "unknown-location_sensor"}, {"score": 0.0025542617599268323, "phrase": "remarkably_uncomplicated_calculations"}, {"score": 0.0022497569011987587, "phrase": "previous_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Distributed localization", " Push-pull Estimation", " Virtual force"], "paper_abstract": "A great deal of research achievements on localization in wireless sensor networks (WSNs) has been obtained in recent years. Nevertheless, its interesting challenges in terms of cost-reduction, accuracy improvement, scalability, and distributed ability design have led to the development of a new algorithm, the Push-pull Estimation (PPE). In this algorithm, the differences between measurements and current calculated distances are modeled into forces, dragging the nodes close to their actual positions. Based on very few known-location sensors or beacons, PPE can pervasively estimate the coordinates of many unknown-location sensors. Each unknown-location sensor, with given pair-wise distances, could independently estimate its own position through remarkably uncomplicated calculations. Characteristics of the algorithm are examined through analyses and simulations to demonstrate that it has advantages over those of previous works in dealing with the above challenges. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Distributed Push-pull Estimation for node localization in wireless sensor networks", "paper_id": "WOS:000286701700012"}