{"auto_keywords": [{"score": 0.03746316896806198, "phrase": "security_training"}, {"score": 0.012401649489214527, "phrase": "elementary_characteristics"}, {"score": 0.00481495049065317, "phrase": "new_meta-theory"}, {"score": 0.004760394308239882, "phrase": "designing_information_systems"}, {"score": 0.004548253531664032, "phrase": "employees'_non-compliance"}, {"score": 0.0043703658695579085, "phrase": "key_concern"}, {"score": 0.00401216440036853, "phrase": "employees'_behavior"}, {"score": 0.003899385109646589, "phrase": "extant_literature"}, {"score": 0.0030337085953063125, "phrase": "security_training_principles"}, {"score": 0.0026003455833291124, "phrase": "fundamental_direction"}, {"score": 0.0025561788724870974, "phrase": "security_training_practices"}, {"score": 0.002373276186210053, "phrase": "security_training_approaches"}, {"score": 0.002254357921422124, "phrase": "security_training_approach"}], "paper_keywords": ["IS Security", " Meta-Theory", " Learning Paradigms", " IS Security Training"], "paper_abstract": "Employees' non-compliance with IS security procedures is a key concern for organizations. To tackle this problem, there exist several training approaches aimed at changing employees' behavior. However, the extant literature does not examine the elementary characteristics of IS security training, such as the ways in which IS security training differs from other forms of training. We argue that IS security training needs a theory that both lays down these elementary characteristics and explains how these characteristics shape IS security training principles in practice. We advance a theory that suggests that IS security training has certain elementary characteristics that separate it from other forms of training, and we set a fundamental direction for IS security training practices. Second, the theory defines four pedagogical requirements for designing and evaluating IS security training approaches. We point out that no existing IS security training approach meets all of these requirements and demonstrate how to design an IS security training approach that does meet these requirements. Implications for research and practice are discussed.", "paper_title": "Toward a New Meta-Theory for Designing Information Systems (IS) Security Training Approaches", "paper_id": "WOS:000294994300001"}