{"auto_keywords": [{"score": 0.044045488159163364, "phrase": "physical_and_operating_parameters"}, {"score": 0.006933318577939875, "phrase": "fms."}, {"score": 0.005824253610427522, "phrase": "flexibility_level"}, {"score": 0.004814951086600529, "phrase": "taguchi"}, {"score": 0.004740476936977635, "phrase": "physical_system"}, {"score": 0.004711009518112459, "phrase": "operating_control"}, {"score": 0.004638136142210615, "phrase": "present_manufacturing_environment"}, {"score": 0.004594951819987416, "phrase": "manufacturing_flexibility"}, {"score": 0.004509780213218666, "phrase": "strategic_competitive_tools"}, {"score": 0.0044967819026860275, "phrase": "taguchi's_method_analysis"}, {"score": 0.004398657974555281, "phrase": "alternative_resources"}, {"score": 0.004317109072311102, "phrase": "varied_parameters"}, {"score": 0.004250302819248558, "phrase": "physical_and_operating_system"}, {"score": 0.004119762981892093, "phrase": "system's_performance"}, {"score": 0.004081385289516914, "phrase": "changing_levels"}, {"score": 0.0040307683311441534, "phrase": "operational_control_parameters"}, {"score": 0.003993216345115755, "phrase": "scheduling_rules"}, {"score": 0.003894772585498127, "phrase": "desired_improved_performance_output"}, {"score": 0.003682024039203607, "phrase": "improved_performance"}, {"score": 0.0035026559604409125, "phrase": "numerous_physical_and_operating_parameters"}, {"score": 0.0033216097307700175, "phrase": "productive_levels"}, {"score": 0.0031107911390188055, "phrase": "flexible_manufacturing_system"}, {"score": 0.0030435255729392204, "phrase": "simulation_study"}, {"score": 0.0026444185820764716, "phrase": "expected_benefits"}, {"score": 0.002430474136314913, "phrase": "relative_percentage_contribution"}, {"score": 0.002283210560032092, "phrase": "relative_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["flexible manufacturing system", " flexibility levels", " physical and operating parameters", " control strategies", " Taguchi's method"], "paper_abstract": "In present manufacturing environment, the manufacturing flexibility has become one of the strategic competitive tools. Flexibility refers to the availability of alternative resources. These resources may have varied parameters, particularly related to physical and operating system. These physical and operating parameters of alternative resources may influence the system's performance with the changing levels of flexibility and operational control parameters such as scheduling rules. Is increase in a flexibility level provides desired improved performance output? If yes, than under what conditions of physical and operating parameters and under which control strategy (CS)? Is improved performance is present at all increasing levels of flexibility? Flexible manufacturing system (FMS) being consist of numerous physical and operating parameters and complex in nature, the solution to these questions can provide an understanding of the productive levels of flexibility for a given physical and operating parameters of an FMS. This paper establishes the need of modelling of the physical and operating parameters of flexible manufacturing system along with flexibility and presents a simulation study under Taguchi's method analysis of these parameters. The paper contributes an approach to study the impact of variations in physical and operating parameters of an FMS and to identify the level of these variations that do not restrict the advantages of flexibility. The results show that the expected benefits from increasing the levels of flexibility and a superior CS may not be achieved if the physical and operating parameters of alternative machines have variations. Taguchi's method analysis indicates that relative percentage contribution of variations in physical and operating parameters of alternative resources should be negligible or minimum in the performance of FMS. Their increasing relative contribution may restrict the advantages of flexibility. If these variations are higher than increase in flexibility level may be counter productive. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Flexibility performance: Taguchi's method study of physical system and operating control parameters of FMS", "paper_id": "WOS:000242697800003"}