{"auto_keywords": [{"score": 0.02934220278643732, "phrase": "critical_value"}, {"score": 0.00481495049065317, "phrase": "mixed_compression_intake"}, {"score": 0.004788765546560755, "phrase": "numerical_simulation"}, {"score": 0.0047110579937340675, "phrase": "two-dimensional_mixed_compression_intake"}, {"score": 0.004634605533299669, "phrase": "unsteady_viscous_compressible_equations"}, {"score": 0.0045968436745655004, "phrase": "stabilized_finite_element_method"}, {"score": 0.004424631631964781, "phrase": "buzz_instability"}, {"score": 0.004352807055792728, "phrase": "higher_bleed"}, {"score": 0.0042011448918579065, "phrase": "larger_back-pressure"}, {"score": 0.003924121879214595, "phrase": "unsteady_oscillations"}, {"score": 0.0037667216301666196, "phrase": "buzz_oscillations"}, {"score": 0.00366529849628973, "phrase": "fundamental_acoustic_frequency"}, {"score": 0.0036057554517052227, "phrase": "open-closed_organ_pipe"}, {"score": 0.0035086512450333476, "phrase": "big_buzz_cycles"}, {"score": 0.0033221916309083273, "phrase": "high-subcritical_state"}, {"score": 0.0032415415664504353, "phrase": "ferri"}, {"score": 0.003223883109446599, "phrase": "dailey"}, {"score": 0.0031456097265367936, "phrase": "relatively_high_bleed"}, {"score": 0.002858810756679712, "phrase": "first_case"}, {"score": 0.002541910967437926, "phrase": "second_set"}, {"score": 0.002316349088361527, "phrase": "fuel_modulation"}, {"score": 0.002278669708496024, "phrase": "low_rate"}, {"score": 0.0021991158090081085, "phrase": "high_rates"}, {"score": 0.0021456694236935804, "phrase": "slow_unstart"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["mixed compression intake", " viscous flow", " start-up", " instability", " bleed"], "paper_abstract": "Numerical simulation of the flow in a two-dimensional mixed compression intake is carried out by solving unsteady viscous compressible equations using a stabilized finite element method. The effect of bleed in starting/unstarting of the intake and controlling the buzz instability is investigated in detail. Higher bleed leads to an increase in the ability of the intake to sustain larger back-pressure for stable operation. The amount of bleed and its location is varied to understand its effect on the performance of the intake. Two kinds of unsteady oscillations are observed: little and big buzz. The frequency of the both kinds of buzz oscillations is found to be super-harmonic of the fundamental acoustic frequency of intake modeled as an open-closed organ pipe. The frequency as well as amplitudes of the big buzz cycles is larger than those of the little buzz. The little- and big-buzz are found to occur for low- and high-subcritical state of the intake and are very similar to Ferri and Dailey criteria, respectively. Buzz is eliminated when relatively high bleed is implemented, both, upstream and downstream of the throat. The effect of rate of change of back-pressure on the start/unstart of the intake is investigated. Two situations are considered. The first case is that of an intake where the back-pressure remains below the critical value. It is found that the intake remains started if the change in back-pressure is gradual. However, it unstarts if the back-pressure is changed relatively rapidly. The second set of simulations is an attempt to model the situation where the back-pressure at the exit of the intake exceeds the critical value and a logic is incorporated in the feed back loop of the fuel modulation to start the intake. Low rate of change of pressure is unsuccessful in starting the intake. Relatively high rates result in either a quick starting of the intake or a slow unstart. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Viscous flow in a mixed compression intake", "paper_id": "WOS:000297207800004"}