{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "three-class_classification_performance_assessment"}, {"score": 0.004595263305771512, "phrase": "fair_comparison"}, {"score": 0.004497262692458022, "phrase": "alternative_models"}, {"score": 0.00443308765153716, "phrase": "system_design"}, {"score": 0.004307459965946991, "phrase": "meaningful_data"}, {"score": 0.004261268957001927, "phrase": "classifier_efficacy"}, {"score": 0.004125634486868786, "phrase": "concise_and_clear_manner"}, {"score": 0.004081385289516914, "phrase": "two-class_classification_problems"}, {"score": 0.004052148727852149, "phrase": "receiver_operating_characteristic_analysis"}, {"score": 0.0040086845241492424, "phrase": "clear_and_concise_assessment_methodology"}, {"score": 0.003923144245133288, "phrase": "competing_systems"}, {"score": 0.0037845987749316632, "phrase": "\"two-class\"_classification_tasks"}, {"score": 0.003230665474330377, "phrase": "multiclass_classifiers"}, {"score": 0.0031277316566463978, "phrase": "classifier_performance_index"}, {"score": 0.0030171910207671205, "phrase": "empirical_comparisons"}, {"score": 0.00278752137116301, "phrase": "multiple_performance_indexes"}, {"score": 0.0026889720516076205, "phrase": "relative_strengths"}, {"score": 0.0025293479382942257, "phrase": "scurfield"}, {"score": 0.0024842242921857705, "phrase": "classifier_performance"}, {"score": 0.0023116191163488824, "phrase": "nakas"}, {"score": 0.002286781334850213, "phrase": "great_practical_utility"}, {"score": 0.002174346780014853, "phrase": "vus."}], "paper_keywords": ["Classification evaluation", " ideal observer analysis", " three-class receiver operating characteristic (ROC)", " volume under surface (VUS)"], "paper_abstract": "Assessment of classifier performance is critical for fair comparison of methods, including considering alternative models or parameters during system design. The assessment must not only provide meaningful data on the classifier efficacy, but it must do so in a concise and clear manner. For two-class classification problems, receiver operating characteristic analysis provides a clear and concise assessment methodology for reporting performance and comparing competing systems. However, many other important biomedical questions cannot be posed as \"two-class\" classification tasks and more than two classes are often necessary. While several methods have been proposed for assessing the performance of classifiers for such multiclass problems, none has been widely accepted. The purpose of this paper is to critically review methods that have been proposed for assessing multiclass classifiers. A number of these methods provide a classifier performance index called the volume under surface (VUS). Empirical comparisons are carried out using 4 three-class case studies, in which three popular classification techniques are evaluated with these methods. Since the same classifier was assessed using multiple performance indexes, it is possible to gain insight into the relative strengths and weakness of the measures. We conclude that: 1) the method proposed by Scurfield provides the most detailed description of classifier performance and insight about the sources of error in a given classification task and 2) the methods proposed by He and Nakas also have great practical utility as they provide both the VUS and an estimate of the variance of the VUS. These estimates can be used to statistically compare two classification algorithms.", "paper_title": "Indexes for Three-Class Classification Performance Assessment-An Empirical Comparison", "paper_id": "WOS:000265936400004"}