{"auto_keywords": [{"score": 0.03795449282887965, "phrase": "query_views"}, {"score": 0.004690305164360866, "phrase": "extensive_research_efforts"}, {"score": 0.004095692768056685, "phrase": "query_object"}, {"score": 0.003802135020791801, "phrase": "rapid_retrieval"}, {"score": 0.0037361664435836845, "phrase": "retrieval_accuracy"}, {"score": 0.002949598537993663, "phrase": "relevance_feedback"}, {"score": 0.0028731024405707277, "phrase": "query_view"}, {"score": 0.0027379609683723938, "phrase": "labeling_information"}, {"score": 0.0026321198895843173, "phrase": "efficient_approach"}, {"score": 0.0025863988422430797, "phrase": "distance_metric"}, {"score": 0.002552628669352939, "phrase": "newly_selected_query_view"}, {"score": 0.002453934333239467, "phrase": "selected_query_views"}, {"score": 0.0021422271362195734, "phrase": "retrieval_process"}, {"score": 0.0021049977753042253, "phrase": "encouraging_retrieval_performance"}], "paper_keywords": ["Intelligent query", " multi-view", " representative query view", " 3-D object retrieval"], "paper_abstract": "The explosively increasing 3-D objects make their efficient retrieval technology highly desired. Extensive research efforts have been dedicated to view-based 3-D object retrieval for its advantage of using 2-D views to represent 3-D objects. In this paradigm, typically the retrieval is accomplished by matching the views of the query object with the objects in database. However, using all the query views may not only introduce difficulty in rapid retrieval but also degrade retrieval accuracy when there is a mismatch between the query views and the object views in the database. In this work, we propose an interactive 3-D object retrieval scheme. Given a set of query views, we first perform clustering to obtain several candidates. We then incrementally select query views for object matching: in each round of relevance feedback, we only add the query view that is judged to be the most informative one based on the labeling information. In addition, we also propose an efficient approach to learn a distance metric for the newly selected query view and the weights for combining all of the selected query views. We conduct experiments on the National Taiwan University 3D Model database, ETH 3D object collection, and Shape Retrieval Content of Non-Rigid 3D Model, and results demonstrated that our approach not only significantly speeds up the retrieval process but also achieves encouraging retrieval performance.", "paper_title": "Less is More: Efficient 3-D Object Retrieval With Query View Selection", "paper_id": "WOS:000295007300014"}