{"auto_keywords": [{"score": 0.044981716411280175, "phrase": "dsp_cores"}, {"score": 0.0382538797366961, "phrase": "dsp_core"}, {"score": 0.004814999118863582, "phrase": "dsp"}, {"score": 0.004761253507368234, "phrase": "static_floating-point_arithmetic"}, {"score": 0.00440170067770959, "phrase": "data-intensive_computations"}, {"score": 0.004224286804379592, "phrase": "standalone_applications"}, {"score": 0.003919763262805793, "phrase": "multi-core_systems"}, {"score": 0.0037058116979705857, "phrase": "signal_processing_kernels"}, {"score": 0.0035298229915690974, "phrase": "high-level_synthesis"}, {"score": 0.0034514309280805106, "phrase": "lightweight_arithmetic"}, {"score": 0.0031430451507177388, "phrase": "integer_arithmetic"}, {"score": 0.003073216350080926, "phrase": "compact_dsp"}, {"score": 0.002883655046524374, "phrase": "dual-core_baseband_processors"}, {"score": 0.0027363334666886912, "phrase": "round-off_noise_ratio"}, {"score": 0.0027057544777834086, "phrase": "ieee_single-precision_fp"}, {"score": 0.0026357223464279983, "phrase": "hand-optimized_programs"}, {"score": 0.0024916819803100635, "phrase": "maximum_precision"}, {"score": 0.002427177130359851, "phrase": "single-precision_fp."}, {"score": 0.002193600680263771, "phrase": "core_size"}, {"score": 0.002128801826067279, "phrase": "chip_memory"}, {"score": 0.0021049977753042253, "phrase": "amba_ahb_interface"}], "paper_keywords": [""], "paper_abstract": "A multimedia system-on-a-chip (SoC) usually contains one or more programmable digital signal processors (DSP) to accelerate data-intensive computations. But most of these DSP cores are designed originally for standalone applications, and they must have some overlapped (and redundant) components with the host microprocessor. This paper presents a compact DSP for multi-core systems, which is fully programmable and has been optimized to execute a set of signal processing kernels very efficiently. The DSP core was designed concurrently with its automatic software generator based on high-level synthesis. Moreover, it performs lightweight arithmetic-the static floating-point (SFP), which approximates the quality of floating-point (FP) operations with the hardware similar to that of the integer arithmetic. In our simulations, the compact DSP and its auto-generated software can achieve 3X performance (estimated in cycles) of those DSP cores in the dual-core baseband processors with similar computing resources. Besides, the 16-bit SFP has above 40 dB signal to round-off noise ratio over the IEEE single-precision FP, and it even outperforms the hand-optimized programs based on the 32-bit integer arithmetic. The 24-bit SFP has above 64 dB quality, of which the maximum precision is identical to that of the single-precision FP. Finally, the DSP core has been implemented and fabricated in the UMC 0.18 mu m 1P6M CMOS technology. It can operate at 314.5 MHz while consuming 52mW average power. The core size is only 1.5 mmx1.5 mm including the 16 KB on-chip memory and the AMBA AHB interface.", "paper_title": "A compact DSP core with static floating-point arithmetic", "paper_id": "WOS:000237326800003"}