{"auto_keywords": [{"score": 0.04599283119366167, "phrase": "users'_future_routes"}, {"score": 0.00481495049065317, "phrase": "ireminder"}, {"score": 0.004240116703465252, "phrase": "mobile_phones"}, {"score": 0.00385431710959668, "phrase": "reminding_message"}, {"score": 0.00378145978325955, "phrase": "mobile_phone"}, {"score": 0.003525861581971337, "phrase": "task_location"}, {"score": 0.003459191419478298, "phrase": "field_study"}, {"score": 0.003204841443605308, "phrase": "everyday_tasks"}, {"score": 0.0029502941554043964, "phrase": "traditional_location-based_reminders"}, {"score": 0.002785978280998868, "phrase": "traditional_location-based_reminder"}, {"score": 0.0026140878612307536, "phrase": "detailed_discussion"}, {"score": 0.0025000985765154028, "phrase": "ideal_message_delivery_point"}, {"score": 0.0024372021710656585, "phrase": "discussion_results"}, {"score": 0.0023758843175179702, "phrase": "location-based_reminding_message"}], "paper_keywords": [""], "paper_abstract": "This article presents the design of iReminder, an intuitive location-based reminder that delivers reminding messages based on users' future routes. iReminder is implemented on mobile phones, and it can predict users' future routes by collecting their daily trajectory data. Then it delivers a reminding message via the mobile phone when it senses that the user is going to the task location. A field study was conducted on how iReminder extends its potential to help users perform everyday tasks and compared the method adopted by iReminder with the method used by traditional location-based reminders. The experimental results show that iReminder outperforms traditional location-based reminder because it delivers reminding messages more appropriately. A detailed discussion is also given to investigate the ideal message delivery point, and the discussion results show that a location-based reminding message is more useful and more likely to be accepted by the user if it is triggered by considering his or her future route.", "paper_title": "iReminder: An Intuitive Location-Based Reminder That Knows Where You Are Going", "paper_id": "WOS:000324671200005"}