{"auto_keywords": [{"score": 0.004593787100061613, "phrase": "reduced_dimensionality_mapping"}, {"score": 0.004471978831302331, "phrase": "kohonen_self-organizing_maps"}, {"score": 0.0043533862892678864, "phrase": "modified_tag_cloud_visualization"}, {"score": 0.0040978781692373005, "phrase": "text_sequence"}, {"score": 0.003935892934907777, "phrase": "word_pertinence"}, {"score": 0.0036553070575015344, "phrase": "mathematical_sense"}, {"score": 0.00300749708357049, "phrase": "filmscript_analysis"}, {"score": 0.0027187231747900814, "phrase": "major_gain"}, {"score": 0.0021335427588412056, "phrase": "innovative_approach"}, {"score": 0.0021049977753042253, "phrase": "plot_characterization"}], "paper_keywords": ["correspondence analysis", " semantics", " text analysis", " information display", " visualization", " filmscript"], "paper_abstract": "We relate tag clouds to other forms of visualization, including planar or reduced dimensionality mapping, and to Kohonen self-organizing maps. Using a modified tag cloud visualization, we incorporate other information into it, including text sequence and most pertinent words. Our notion of word pertinence goes beyond just word frequency and instead takes a word in a mathematical sense as located at the average of all of its pairwise relationships. We capture semantics through context, taken as all pairwise relationships. Our domain of application is that of filmscript analysis. The analysis of filmscripts, always important for cinema, is experiencing a major gain in importance in the context of television. Our objective in this paper is to visualize the semantics of filmscript, and beyond filmscript any other partially structured, time-ordered sequence of text segments. In particular, we develop an innovative approach to plot characterization. Information Visualization (2010) 9, 253-262. doi:10.1057/ivs.2009.19; published online 1 October 2009", "paper_title": "Tag clouds for displaying semantics: The case of filmscripts", "paper_id": "WOS:000284461700003"}