{"auto_keywords": [{"score": 0.03778413671149982, "phrase": "perceived_realism"}, {"score": 0.011818482602760678, "phrase": "spatial_representation"}, {"score": 0.01091613662703897, "phrase": "egocentric_representation"}, {"score": 0.01085846267189649, "phrase": "allocentric_representation"}, {"score": 0.007670789992370588, "phrase": "user's_sense"}, {"score": 0.004613940521007727, "phrase": "computer_games"}, {"score": 0.00450456611645112, "phrase": "visual_depth"}, {"score": 0.00443308765153716, "phrase": "stereoscopic_vision"}, {"score": 0.004362738436361684, "phrase": "binocular_disparity"}, {"score": 0.004339536578008533, "phrase": "prior_studies"}, {"score": 0.004316457576524889, "phrase": "important_system_features"}, {"score": 0.0038900709793274484, "phrase": "theoretical_model"}, {"score": 0.0038487848937121204, "phrase": "perceived_effects"}, {"score": 0.003571751184289622, "phrase": "important_mediating_factors"}, {"score": 0.003543273649210823, "phrase": "perceived_system_features"}, {"score": 0.0032272929113113203, "phrase": "particular_perspective"}, {"score": 0.003159106878239524, "phrase": "reference_points"}, {"score": 0.002824005136794786, "phrase": "research_questions"}, {"score": 0.0028089634624677957, "phrase": "empirical_study"}, {"score": 0.0027717078857555765, "phrase": "controlled_lab_environment"}, {"score": 0.0027495914857929584, "phrase": "total_number"}, {"score": 0.0026914710445743693, "phrase": "collected_data"}, {"score": 0.002470987929071079, "phrase": "perceived_expression_features"}, {"score": 0.0024578219177450876, "phrase": "stronger_effects"}, {"score": 0.002438203996977464, "phrase": "perceived_manipulation_features"}, {"score": 0.002150481043278758, "phrase": "study's_limitations"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Sense of presence", " Perceived realism", " Dual mode model", " Egocentric representation", " Allocentric representation", " Perceived manipulation"], "paper_abstract": "Recently, stereoscopic 3D technologies have come to be used widely in various applications including movies and computer games. Stereoscopic 3D is defined as that which provides visual depth and details by exploiting the stereoscopic vision of the eyes caused by binocular disparity. Prior studies proposed important system features of stereoscopic 3D that may increase the user's sense of presence. However, few studies, either theoretical or empirical, have investigated how these perceived system features affect the user's sense of presence. This study aims to construct a theoretical model that explains the perceived effects of stereoscopic 3D features on sense of presence, and to verify the validity of the model in the 3D computer game domain. The study focuses on spatial representation and perceived realism as important mediating factors between the perceived system features and sense of presence. According to the Dual Mode Model (DMM), two types of spatial representation are crucial for perceived realism and presence: egocentric representation and allocentric representation. Egocentric representation implies representing locations with respect to the particular perspective of the perceiver, while allocentric representation locates reference points outside of the perceiver, regardless of his or her position. Research questions in this study are: How strongly do perceived expression and manipulation features of stereoscopic 3D systems influence spatial representation? How does spatial representation influence perceived realism and presence in a stereoscopic 3D environment? In order to answer these research questions an empirical study was conducted in a controlled lab environment. A total number of 257 users participated in the study and collected data was analyzed by using structural equation modeling with SmartPLS2.0. The findings are as follows: First, both the perceived expression and manipulation features of the stereoscopic 3D system influenced spatial representation, but the perceived expression features had stronger effects than the perceived manipulation features. Second, both egocentric and allocentric representation were found to affect presence. In addition, egocentric representation was found to affect sense of presence both directly and indirectly through perceived realism, whereas allocentric representation contributed a sense of presence only indirectly through perceived realism. This paper concludes by discussing the study's limitations and implications. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "The effects of egocentric and allocentric representations on presence and perceived realism: Tested in stereoscopic 3D games", "paper_id": "WOS:000309847600010"}