{"auto_keywords": [{"score": 0.03291935512824042, "phrase": "marte"}, {"score": 0.00481495049065317, "phrase": "embedded_systems"}, {"score": 0.0042336638794732255, "phrase": "time-to-market_issues"}, {"score": 0.004130165601475531, "phrase": "stringent_quality_requirements"}, {"score": 0.004029187256595917, "phrase": "early_verification"}, {"score": 0.003778004256546193, "phrase": "advanced_development_paradigms"}, {"score": 0.0037222908218253054, "phrase": "model-driven_engineering"}, {"score": 0.0035954555250614197, "phrase": "considerable_benefits"}, {"score": 0.003472927015404464, "phrase": "embedded_system_software"}, {"score": 0.0032887360307856635, "phrase": "increasing_process_complexity"}, {"score": 0.003038066486989815, "phrase": "embedded_model-driven_product_lines"}, {"score": 0.0029199689963238726, "phrase": "involved_roles"}, {"score": 0.0022901862321082407, "phrase": "engineering_teams"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["software product line", " model-based analysis process", " model-driven development", " quality attributes", " performance"], "paper_abstract": "Nowadays, embedded systems are gaining importance. At the same time, the development of their software is increasing its complexity, having to deal with quality, cost, and time-to-market issues among others. With stringent quality requirements such as performance, early verification and validation become critical in these systems. In this regard, advanced development paradigms such as model-driven engineering and software product line engineering bring considerable benefits to the development and validation of embedded system software. However, these benefits come at the cost of increasing process complexity. This work presents a process based on UML and MARTE for the analysis of embedded model-driven product lines. It specifies the tasks, the involved roles, and the workproducts that form the process and how it is integrated in the more general development process. Existing tools that support the tasks to be performed in the process are also described. A classification of such tools and a study of traceability among them are provided, allowing engineering teams to choose the most adequate chain of tools to support the process. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Embedded software product lines: domain and application engineering model-based analysis processes", "paper_id": "WOS:000334503900005"}