{"auto_keywords": [{"score": 0.04568107674629595, "phrase": "distributed"}, {"score": 0.00481495049065317, "phrase": "distributed_partitioning"}, {"score": 0.0046781613377273774, "phrase": "scarce_resources"}, {"score": 0.004235938758522453, "phrase": "local_requests"}, {"score": 0.004168618849008299, "phrase": "canonical_example"}, {"score": 0.0041023644174418205, "phrase": "recent_work"}, {"score": 0.003998531873723384, "phrase": "potentially_serious_problem"}, {"score": 0.003928077472619765, "phrase": "mistreatment"}, {"score": 0.0038600230206554792, "phrase": "node's_access_cost"}, {"score": 0.003643607569483598, "phrase": "emulation-based_framework"}, {"score": 0.0035399770257915466, "phrase": "selfish_caching_schemes"}, {"score": 0.003015508235745547, "phrase": "cooperative_group"}, {"score": 0.0029203055813347874, "phrase": "smoother_approach"}, {"score": 0.0026693851900137953, "phrase": "distributed_and_easily_deployable_feedback-control_scheme"}, {"score": 0.0025034338848015166, "phrase": "greedy_local_manner"}, {"score": 0.0023857603808363527, "phrase": "control-theoretic_analysis"}, {"score": 0.0023178219772486868, "phrase": "minimal_access_cost"}, {"score": 0.002273605493468005, "phrase": "static_scheme"}, {"score": 0.00220177373403577, "phrase": "insignificant_degradation"}, {"score": 0.0021597662797996843, "phrase": "caching_group"}, {"score": 0.002145942273032774, "phrase": "typical_operating_scenaria"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["cooperative caching", " service overlay networks", " peer-to-peer networks", " control theory", " performance evaluation"], "paper_abstract": "The distributed partitioning of autonomous, self-aware nodes into cooperative groups, within which scarce resources could be effectively shared for the benefit of the group, is increasingly emerging as a hallmark of many newly-proposed overlay and peer-to-peer applications. Distributed caching protocols in which group members cooperate to satisfy local requests for objects is a canonical example of such applications. In recent work of ours we identified mistreatment as a potentially serious problem for nodes participating in such cooperative caching arrangements. Mistreatment materializes when a node's access cost for fetching objects worsens as a result of cooperation. To that end, we outlined an emulation-based framework for the development of mistreatment-resilient distributed selfish caching schemes. Under this framework, a node opts to participate in the group only if its individual access cost is less than the one achieved while in isolation. In this paper, we argue against the use of such static \"all or nothing\" approaches which force an individual node to either join or not join a cooperative group. Instead, we advocate the use of a smoother approach, whereby the level of cooperation is tied to the benefit that a node begets from joining a group. To that end, we propose a distributed and easily deployable feedback-control scheme which mitigates mistreatment. Under our proposed adaptive scheme, a node independently emulates its performance as if it were acting in a greedy local manner and then adapts its caching policy in the direction of reducing its measured access cost below its emulated greedy local cost. Using control-theoretic analysis, we show that our proposed scheme converges to the minimal access cost, and indeed outperforms any static scheme. We also show that our scheme results in insignificant degradation to the performance of the caching group under typical operating scenaria. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Mistreatment-resilient distributed caching", "paper_id": "WOS:000247456100001"}