{"auto_keywords": [{"score": 0.035918182345546376, "phrase": "reference_information"}, {"score": 0.00481495049065317, "phrase": "image_quality_assessment"}, {"score": 0.004511485198940203, "phrase": "image_quality_assessment_algorithms"}, {"score": 0.004399905285945236, "phrase": "perceptual_quality"}, {"score": 0.004269630481719451, "phrase": "objective_index"}, {"score": 0.004101886428528311, "phrase": "human_subjective_index"}, {"score": 0.004040688646993605, "phrase": "objective_image_quality_assessment_algorithms"}, {"score": 0.0036188435232325337, "phrase": "reduced-reference_algorithms"}, {"score": 0.0035292625231068517, "phrase": "partial_information"}, {"score": 0.00347657813672945, "phrase": "reference_image"}, {"score": 0.0033231814056233103, "phrase": "-reference_algorithms"}, {"score": 0.0028877818105020434, "phrase": "recent_no-reference_image_quality_algorithms"}, {"score": 0.002830410693265704, "phrase": "non-distortion-specific_cases"}, {"score": 0.002678433668156676, "phrase": "non-distortion-specific_no-reference_algorithms"}, {"score": 0.002362620540317279, "phrase": "current_research_trends"}, {"score": 0.0022582634725291225, "phrase": "possible_future_research_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Image quality assessment", " Learning-based", " Natural scene statistics", " No-reference image quality assessment", " Blind image quality assessment", " Non-distortion-specific"], "paper_abstract": "Over the last two decades, there has been a surge of interest in the research of image quality assessment due to its wide applicability to many domains. In general, the aim of image quality assessment algorithms is to evaluate the perceptual quality of an image using an objective index which should be highly consistent with the human subjective index. The objective image quality assessment algorithms can be classified into three main classes: full-reference, reduced-reference, and no-reference. While full-reference and reduced-reference algorithms require full information or partial information of the reference image respectively, no reference information is required for no-reference algorithms. Consequently, a no-reference (or blind) image quality assessment algorithm is highly preferred in cases where the availability of any reference information is implausible. In this paper, a survey of the recent no-reference image quality algorithms, specifically for non-distortion-specific cases, is provided in the first half of this paper. Two major approaches in designing the non-distortion-specific no-reference algorithms, namely natural scene statistics-based and learning-based, are studied. In the second half of this paper, their performance and limitations are discussed before current research trends addressing the limitations are presented. Finally, possible future research directions are proposed towards the end of this paper. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Non-distortion-specific no-reference image quality assessment: A survey", "paper_id": "WOS:000350929100009"}