{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chemical_concentration_map"}, {"score": 0.03345953020235005, "phrase": "implemented_algorithms"}, {"score": 0.00471003041684707, "phrase": "multi-robot_system"}, {"score": 0.004658426838467567, "phrase": "bio-inspired_algorithms"}, {"score": 0.00433645229352341, "phrase": "chemical_gas_concentration_map"}, {"score": 0.004014452814186653, "phrase": "khepera_iii_and_miniq_miniature_mobile_robots"}, {"score": 0.00379914165379475, "phrase": "ethanol_gas"}, {"score": 0.003615217162972726, "phrase": "decentralized_and_asynchronous_particle_swarm_optimization"}, {"score": 0.00325555555110395, "phrase": "base_case"}, {"score": 0.002947790697936243, "phrase": "position_data"}, {"score": 0.0028993944292191433, "phrase": "remote_computer"}, {"score": 0.0024299678474208023, "phrase": "dapso"}, {"score": 0.0024033113849536497, "phrase": "aco"}, {"score": 0.0021049977753042253, "phrase": "target_gas_sources"}], "paper_keywords": [""], "paper_abstract": "In this article we describe implementations of various bio-inspired algorithms for obtaining the chemical gas concentration map of an environment filled with a contaminant. The experiments are performed using Khepera III and miniQ miniature mobile robots equipped with chemical gas sensors in an environment with ethanol gas. We implement and investigate the performance of decentralized and asynchronous particle swarm optimization (DAPSO), bacterial foraging optimization (BFO), and ant colony optimization (ACO) algorithms. Moreover, we implement sweeping (sequential search algorithm) as a base case for comparison with the implemented algorithms. During the experiments at each step the robots send their sensor readings and position data to a remote computer where the data is combined, filtered, and interpolated to form the chemical concentration map of the environment. The robots also exchange this information among each other and cooperate in the DAPSO and ACO algorithms. The performance of the implemented algorithms is compared in terms of the quality of the maps obtained and success of locating the target gas sources.", "paper_title": "Experimental studies on chemical concentration map building by a multi-robot system using bio-inspired algorithms", "paper_id": "WOS:000329227800003"}