{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "probability_phylogenetic_trees"}, {"score": 0.040937157136485436, "phrase": "mp_method"}, {"score": 0.030300638905853418, "phrase": "substitution_models"}, {"score": 0.026468569238843526, "phrase": "probability_representation_model"}, {"score": 0.02622239740967105, "phrase": "phylogenetic_trees"}, {"score": 0.023218160810037324, "phrase": "substitution_model"}, {"score": 0.004482063543727601, "phrase": "main_problems"}, {"score": 0.004439445472040688, "phrase": "computational_biology"}, {"score": 0.004132411680987228, "phrase": "distance_matrix"}, {"score": 0.004034841146538891, "phrase": "maximum_likelihood"}, {"score": 0.0037199473428123175, "phrase": "optimization_criterion"}, {"score": 0.0034625012596827334, "phrase": "investigated_nucleotide_sequences"}, {"score": 0.003176899769744057, "phrase": "current_time"}, {"score": 0.00305762327908599, "phrase": "evolutionary_history"}, {"score": 0.00290087451159631, "phrase": "unobservable_substitutions"}, {"score": 0.002699960312990493, "phrase": "dm_and_ml_methods"}, {"score": 0.0025737890313763407, "phrase": "classical_mp_method"}, {"score": 0.0024301229420875155, "phrase": "reconstructed_trees"}, {"score": 0.0021049977753042253, "phrase": "mp_principle"}], "paper_keywords": ["probability representation", " substitution model", " steiner tree"], "paper_abstract": "The problem of inferring phylogenies (phylogenetic trees) is one of the main problems in computational biology. There are three main methods for inferring phylogenies-Maximum Parsimony (MP), Distance Matrix (DM) and Maximum Likelihood (ML), of which the MP method is the most well-studied and popular method. In the MP method the optimization criterion is the number of substitutions of the nucleotides computed by the differences in the investigated nucleotide sequences. However, the MP method is often criticized as it only counts the substitutions observable at the current time and all the unobservable substitutions that really occur in the evolutionary history are omitted. In order to take into account the unobservable substitutions, some substitution models have been established and they are now widely used in the DM and ML methods but these substitution models cannot be used within the classical MP method. Recently the authors proposed a probability representation model for phylogenetic trees and the reconstructed trees in this model are called probability phylogenetic trees. One of the advantages of the probability representation model is that it can include a substitution model to infer phylogenetic trees based on the MP principle. In this paper we explain how to use a substitution model in the reconstruction of probability phylogenetic trees and show the advantage of this approach with examples.", "paper_title": "Maximum Parsimony, Substitution Model, and Probability Phylogenetic Trees", "paper_id": "WOS:000285965600006"}