{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "android_science_and_animal_rights"}, {"score": 0.0035141291835319682, "phrase": "animal_rights_movement"}, {"score": 0.003296212583539166, "phrase": "moral_status"}, {"score": 0.0031070348334684356, "phrase": "legal_personhood"}, {"score": 0.003016544840824688, "phrase": "significant_differences"}, {"score": 0.002928682556953258, "phrase": "identifying_similarities"}, {"score": 0.0027200305495826797, "phrase": "human_consciousness"}, {"score": 0.0025892330566358503, "phrase": "consciousness_impact"}, {"score": 0.0025014259919355453, "phrase": "moral_dilemma"}, {"score": 0.0024405312482831646, "phrase": "android_development"}, {"score": 0.002323142666222693, "phrase": "unexpected_ramifications"}, {"score": 0.0021049977753042253, "phrase": "android_science"}], "paper_keywords": ["androids", " animal rights", " ethics", " moral rights", " legal rights", " legal personhood"], "paper_abstract": "Androids have begun to act in ways that, on the surface, seem human. However, no one is prepared to view them as anything other than property. As androids become more sophisticated, and as engineers try harder to make them 'conscious', moral, ethical and legal issues will arise. An analogy can be drawn with the animal rights movement suggesting that, with enough complexity, androids may lay claim to some moral status even though this may be less than what is required for legal personhood. However, there are significant differences between animals and androids. Identifying similarities and differences, which may ultimately depend on how we come to conceive of human consciousness, will lead to an understanding of how our ideas about consciousness impact on our concept of rights. A moral dilemma may come early in android development, and when it does, it could have unexpected ramifications if not understood by researchers. Failure to be aware of this risk could result in reactions that curtail android science.", "paper_title": "Android science and animal rights, does an analogy exist?", "paper_id": "WOS:000242913000007"}