{"auto_keywords": [{"score": 0.04022330940745259, "phrase": "proposed_model"}, {"score": 0.00481495049065317, "phrase": "job-position-dependent_learning"}, {"score": 0.00475070135279933, "phrase": "time-dependent_deterioration"}, {"score": 0.004266501496765747, "phrase": "general_scheduling_model"}, {"score": 0.0040978781692373005, "phrase": "position-dependent_learning"}, {"score": 0.0037549546301384336, "phrase": "actual_processing_time"}, {"score": 0.0035344448639851827, "phrase": "total_processing_time"}, {"score": 0.0031738126998349775, "phrase": "single-machine_scheduling_problems"}, {"score": 0.002251637552201872, "phrase": "approximation_algorithms"}, {"score": 0.0021917966722180132, "phrase": "optimal_schedules"}, {"score": 0.0021479597698614355, "phrase": "corresponding_single-machine_scheduling_problems"}], "paper_keywords": ["Approximation methods", " manufacturing scheduling", " modeling"], "paper_abstract": "Job deterioration and learning co-exist in many realistic scheduling situations. This paper introduces a general scheduling model that considers the effects of position-dependent learning and time-dependent deterioration simultaneously. In the proposed model, the actual processing time of a job depends not only on the total processing time of the jobs already processed but also on its scheduled position. This paper focuses on the single-machine scheduling problems with the objectives of minimizing the makespan, total completion time, total weighted completion time, discounted total weighted completion time, and maximum lateness based on the proposed model, respectively. It shows that they are polynomially solvable and optimal under certain conditions. Additionally, it presents some approximation algorithms based on the optimal schedules for the corresponding single-machine scheduling problems and analyzes their worst case error bound.", "paper_title": "Single-Machine Scheduling With Job-Position-Dependent Learning and Time-Dependent Deterioration", "paper_id": "WOS:000298299000014"}