{"auto_keywords": [{"score": 0.03473595171794093, "phrase": "dereferee"}, {"score": 0.00481495049065317, "phrase": "meaningful_runtime_diagnostics"}, {"score": 0.004757227624616643, "phrase": "proper_memory_management"}, {"score": 0.004042166795461166, "phrase": "runtime_environments"}, {"score": 0.0036700484729006136, "phrase": "meaningful_diagnostics"}, {"score": 0.0034759420565135253, "phrase": "memory-related_logical_errors"}, {"score": 0.003232956879952914, "phrase": "advanced_yet_thin_wrapper"}, {"score": 0.0030251262102203385, "phrase": "runtime_diagnostics"}, {"score": 0.0028650312174624635, "phrase": "development_process"}, {"score": 0.0027463775689957255, "phrase": "memory-intensive_programs"}, {"score": 0.0022497569011987587, "phrase": "transition_codes"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["C plus", " memory management", " pointers", " debugging", " testing"], "paper_abstract": "Proper memory management and pointer usage often prove to be the most difficult concepts for students learning C++ to grasp. Compounding this problem is the fact that the compilers and runtime environments traditionally used to introduce these concepts leave much to be desired with regard to generating meaningful diagnostics to assist students in tracking down and fixing memory-related logical errors. To alleviate this, we have developed Dereferee, an advanced yet thin wrapper around C++ pointers that greatly increases the quality of these runtime diagnostics, but with only a small amount of intrusion into the development process. With regard to performance, memory-intensive programs will experience execution times approximately 20-30 times slower when using Dereferee, which is comparable with other similar tools. Furthermore, the library has been designed to be customizable and easily disabled to transition codes from development to production. Copyright (C) 2013 John Wiley & Sons, Ltd.", "paper_title": "Dereferee: instrumenting C plus plus pointers with meaningful runtime diagnostics", "paper_id": "WOS:000339479400006"}