{"auto_keywords": [{"score": 0.037158875120775335, "phrase": "user_interface"}, {"score": 0.008549529721792926, "phrase": "functionally_illiterate_people"}, {"score": 0.008348540745097324, "phrase": "illiterate_people"}, {"score": 0.006243259906258561, "phrase": "print_illiterate_people"}, {"score": 0.00481495049065317, "phrase": "interface_design"}, {"score": 0.004769182299692333, "phrase": "e-learning_system"}, {"score": 0.004656647251517823, "phrase": "different_type"}, {"score": 0.004546755482549647, "phrase": "print_illiterates"}, {"score": 0.004439445472040688, "phrase": "crucial_information"}, {"score": 0.004261491533577909, "phrase": "improved_user_interface"}, {"score": 0.004172094622123562, "phrase": "developing_countries"}, {"score": 0.00401560412621627, "phrase": "remote_areas"}, {"score": 0.0031921317979928406, "phrase": "previous_researchers"}, {"score": 0.002739001004969201, "phrase": "remote_village"}, {"score": 0.0027129140419226002, "phrase": "bangladesh"}, {"score": 0.0026742419973883134, "phrase": "test_data"}, {"score": 0.0026235360404084137, "phrase": "proposed_improvement"}, {"score": 0.002488985155689794, "phrase": "target_population"}, {"score": 0.0023840346303791032, "phrase": "assigned_task"}, {"score": 0.0021560018573288666, "phrase": "successful_users"}], "paper_keywords": ["User Interface", " Illiterate people", " e-Learning"], "paper_abstract": "Among different type of illiterate people, the print illiterates suffer most from getting crucial information passed around the society. Many print illiterate people are found in the developing countries and in many cases they live in the remote areas working as farmers. These people are deprived of the knowledge generated from the latest scientific researches. This research makes some recommendations related to developing user interface especially suitable for the print illiterate people. In this regard, a user interface is developed based on the recommendations from the previous researchers. The authors find the recommendations insufficient and develop another user interface based on the improvements proposed by the authors. Later both the user interfaces are tested by two different groups of print illiterate people in a remote village in Bangladesh. The test data shows that the proposed improvement contributes significantly to make the user interface more usable to the target population. 13 out of 15 users could complete the assigned task successfully using improved user interface. Whereas only 8 out of 14 users could do the same with the other user interface. Among the successful users, the improved user interface took 26% less time than that of the other user interface. Finally some recommendations to develop user interface for the functionally illiterate people are made based on the results and observations of this research.", "paper_title": "User Interface Design of E-Learning System for Functionally Illiterate People", "paper_id": "WOS:000369851900019"}