{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_mesh_networks"}, {"score": 0.004461359547152617, "phrase": "major_concern"}, {"score": 0.004186534737631288, "phrase": "open_medium"}, {"score": 0.004055511503825102, "phrase": "physical_security"}, {"score": 0.003663067281537946, "phrase": "intrusion_detection"}, {"score": 0.0034812740368914455, "phrase": "routing_protocol"}, {"score": 0.0030457198309616694, "phrase": "routing_tasks"}, {"score": 0.002988101395789399, "phrase": "existing_protocol"}, {"score": 0.002931569771634119, "phrase": "existing_optimised_link-state_routing_protocol"}, {"score": 0.002821685815956478, "phrase": "sampling_mechanism"}, {"score": 0.002733260122876447, "phrase": "malicious_information"}, {"score": 0.0024842242921857705, "phrase": "sampling_process"}, {"score": 0.0022292394795878643, "phrase": "network_simulator"}, {"score": 0.0021049977753042253, "phrase": "highest_achieved_intrusion_detection_rate"}], "paper_keywords": [""], "paper_abstract": "Security in wireless mesh networks (WMNs) has always been a major concern ever since the existence of these networks. The open medium and the lack of physical security make the WMNs susceptible to various kinds of attacks. This study addresses the problem of intrusion detection in WMNs. The authors propose a routing protocol that is capable of detecting intrusions, while undertaking the tasks of routing in WMNs. The authors base the routing tasks in the existing protocol on the existing optimised link-state routing protocol. This protocol uses the sampling mechanism for the detection of malicious information in the network. Concepts of learning automata have been introduced to optimise the sampling process. Two new frame formats and its associated handling procedures have been developed. The authors evaluated the performance of our protocol using network simulator 3. In the experiments performed, the highest achieved intrusion detection rate with the proposed protocol was observed to be 94%.", "paper_title": "Adaptive link-state routing and intrusion detection in wireless mesh networks", "paper_id": "WOS:000287341900016"}