{"auto_keywords": [{"score": 0.028702882560575738, "phrase": "mommop"}, {"score": 0.02322730111336099, "phrase": "multiple_optimal_solutions"}, {"score": 0.010518570728861783, "phrase": "multimodal_optimization_problems"}, {"score": 0.010242017599404445, "phrase": "evolutionary_computation"}, {"score": 0.00984062629159417, "phrase": "evolutionary_algorithms"}, {"score": 0.008573663392542098, "phrase": "single_run"}, {"score": 0.007808675505418658, "phrase": "mmop"}, {"score": 0.0071432080251559405, "phrase": "transformed_problem"}, {"score": 0.004523103062368843, "phrase": "growing_interest"}, {"score": 0.003732368382223596, "phrase": "novel_transformation_technique"}, {"score": 0.0036826452656927877, "phrase": "multiobjective_optimization"}, {"score": 0.0034902664176377943, "phrase": "multiobjective_optimization_problem"}, {"score": 0.003278447235176858, "phrase": "pareto_optimal_solutions"}, {"score": 0.0031773926428131233, "phrase": "multiobjective_evolutionary_algorithms"}, {"score": 0.00303839203670705, "phrase": "representative_pareto_optimal_solutions"}, {"score": 0.0028667159745494933, "phrase": "original_mmop"}, {"score": 0.0026686444508167875, "phrase": "implicit_niching_method"}, {"score": 0.002364865100579589, "phrase": "nondominated_sorting"}, {"score": 0.0023125191783901367, "phrase": "systematic_experiments"}, {"score": 0.0022013916728990564, "phrase": "multimodal_optimization"}], "paper_keywords": ["Evolutionary algorithms", " multimodal optimization problems", " multiobjective optimization", " multiple optimal solutions", " transformation technique"], "paper_abstract": "In the field of evolutionary computation, there has been a growing interest in applying evolutionary algorithms to solve multimodal optimization problems (MMOPs). Due to the fact that an MMOP involves multiple optimal solutions, many niching methods have been suggested and incorporated into evolutionary algorithms for locating such optimal solutions in a single run. In this paper, we propose a novel transformation technique based on multiobjective optimization for MMOPs, called MOMMOP. MOMMOP transforms an MMOP into a multiobjective optimization problem with two conflicting objectives. After the above transformation, all the optimal solutions of an MMOP become the Pareto optimal solutions of the transformed problem. Thus, multiobjective evolutionary algorithms can be readily applied to find a set of representative Pareto optimal solutions of the transformed problem, and as a result, multiple optimal solutions of the original MMOP could also be simultaneously located in a single run. In principle, MOMMOP is an implicit niching method. In this paper, we also discuss two issues in MOMMOP and introduce two new comparison criteria. MOMMOP has been used to solve 20 multimodal benchmark test functions, after combining with nondominated sorting and differential evolution. Systematic experiments have indicated that MOMMOP outperforms a number of methods for multimodal optimization, including four recent methods at the 2013 IEEE Congress on Evolutionary Computation, four state-of-the-art single-objective optimization based methods, and two well-known multiobjective optimization based approaches.", "paper_title": "MOMMOP: Multiobjective Optimization for Locating Multiple Optimal Solutions of Multimodal Optimization Problems", "paper_id": "WOS:000351467400019"}