{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_realism"}, {"score": 0.01993243706618952, "phrase": "face_images"}, {"score": 0.019148038600788415, "phrase": "visual_realism_perception"}, {"score": 0.01678679557648536, "phrase": "visual_realism_judgments"}, {"score": 0.00922544556284118, "phrase": "efficient_control"}, {"score": 0.007586141140724374, "phrase": "original_face_images"}, {"score": 0.006259410095379577, "phrase": "holistic_processing"}, {"score": 0.004438062899636402, "phrase": "cg"}, {"score": 0.004244955499652296, "phrase": "viewer_reactions"}, {"score": 0.003985680946956402, "phrase": "deep_understanding"}, {"score": 0.003784049616066444, "phrase": "real_photograph"}, {"score": 0.0037283301619292636, "phrase": "cg_image"}, {"score": 0.003410768840300913, "phrase": "inverted_face_images"}, {"score": 0.0032743731084995515, "phrase": "bottom_halves"}, {"score": 0.0030514638431036714, "phrase": "different_parts"}, {"score": 0.002534539169474629, "phrase": "realistic_images"}, {"score": 0.002497172413754263, "phrase": "unrealistic_images"}, {"score": 0.002353120949568249, "phrase": "face_context"}, {"score": 0.0022927343007881846, "phrase": "face_parts"}, {"score": 0.0021927897271015657, "phrase": "first_realism-centric_study"}, {"score": 0.002152440300818582, "phrase": "human_perception"}, {"score": 0.0021049977753042253, "phrase": "general_face_perception_tasks"}], "paper_keywords": ["Design", " Experimentation", " Visual realism", " human perception", " holistic face perception", " piecemeal face perception"], "paper_abstract": "Computer-generated (CG) face images are common in video games, advertisements, and other media. CG faces vary in their degree of realism, a factor that impacts viewer reactions. Therefore, efficient control of visual realism of face images is important. Efficient control is enabled by a deep understanding of visual realism perception: the extent to which viewers judge an image as a real photograph rather than a CG image. Across two experiments, we explored the processes involved in visual realism perception of face images. In Experiment 1, participants made visual realism judgments on original face images, inverted face images, and images of faces that had the top and bottom halves misaligned. In Experiment 2, participants made visual realism judgments on original face images, scrambled faces, and images that showed different parts of faces. Our findings indicate that both holistic and piecemeal processing are involved in visual realism perception of faces, with holistic processing becoming more dominant when resolution is lower. Our results also suggest that shading information is more important than color for holistic processing, and that inversion makes visual realism judgments harder for realistic images but not for unrealistic images. Furthermore, we found that eyes are the most influential face part for visual realism, and face context is critical for evaluating realism of face parts. To the best of our knowledge, this work is a first realism-centric study attempting to bridge the human perception of visual realism on face images with general face perception tasks.", "paper_title": "Human Perception of Visual Realism for Photo and Computer-Generated Face Images", "paper_id": "WOS:000341241100003"}