{"auto_keywords": [{"score": 0.02460065023607793, "phrase": "prior_knowledge"}, {"score": 0.00481495049065317, "phrase": "pharmaceutical_drying_process"}, {"score": 0.004685855684376706, "phrase": "moment-based_methods"}, {"score": 0.0045850648862091085, "phrase": "population_balance_model"}, {"score": 0.004225950334493496, "phrase": "system_analysis"}, {"score": 0.0036886073959526396, "phrase": "non-moment-based_solution_method"}, {"score": 0.0036288831229878264, "phrase": "pbm."}, {"score": 0.0033262524445013303, "phrase": "final_result"}, {"score": 0.003219368413618912, "phrase": "computational_time"}, {"score": 0.003167217223469026, "phrase": "additional_parameter"}, {"score": 0.0026607205525625995, "phrase": "parameter_fitting_methods"}, {"score": 0.0025334249463305875, "phrase": "final_distribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["PBM", " Reconstruction methods", " Mathematical modelling", " Solution methodology", " harmaceuticalsa"], "paper_abstract": "The use of moment-based methods to solve a Population Balance Model (PBM) induces the need to reconstruct a distribution from the moments for system analysis. Several reconstruction methods are investigated (i.e. parameter fitting methods and the method of splines), compared with each other as well as with the result of a non-moment-based solution method for the PBM. The finetuning of the parameters for the method of splines was very important for the final result as well as for the computational time. An additional parameter, i.e. a different value for the first and the last interval for tol(red), was introduced to improve the result and speed up the calculation. None of the parameter fitting methods was able to correctly predict several peaks in the final distribution. In contrast, the method of splines was able to reconstruct the distribution even without prior knowledge. However, prior knowledge about the distribution does facilitate the finetuning. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Comparison of techniques for reconstruction of a distribution from moments in the context of a pharmaceutical drying process", "paper_id": "WOS:000334769200001"}