{"auto_keywords": [{"score": 0.047905977291456965, "phrase": "kolmogorov_complexity"}, {"score": 0.014046242815183858, "phrase": "autocomplex_sets"}, {"score": 0.007093373749683764, "phrase": "maximum_complexity"}, {"score": 0.00481495049065317, "phrase": "complex_and_autocomplex_sets"}, {"score": 0.004770461993586338, "phrase": "set_a"}, {"score": 0.0045224788170752424, "phrase": "characteristic_sequence"}, {"score": 0.00399881984083004, "phrase": "dnr_functions"}, {"score": 0.003952650994544525, "phrase": "recursion_theory"}, {"score": 0.00383508177668219, "phrase": "fixed-point_free_functions"}, {"score": 0.003593555152077465, "phrase": "fundamental_concept"}, {"score": 0.00357689487273538, "phrase": "theoretical_computer_science"}, {"score": 0.0034866296344989076, "phrase": "recursively_enumerable_sets"}, {"score": 0.0033750223629930858, "phrase": "alternate_proof"}, {"score": 0.0033515736929172644, "phrase": "well-known_completeness_criterion"}, {"score": 0.0032898346872897383, "phrase": "computing_dnr_functions"}, {"score": 0.00322173228196031, "phrase": "last_paragraph"}, {"score": 0.003199345207727474, "phrase": "complex_sets"}, {"score": 0.003177113200270319, "phrase": "oracle_computations"}, {"score": 0.0031331101240472787, "phrase": "weak_truth-table_computations"}, {"score": 0.003004712988422899, "phrase": "dnr_function"}, {"score": 0.002894993455998078, "phrase": "martin-lof_random_set"}, {"score": 0.0028615323526689582, "phrase": "partial_answer"}, {"score": 0.0028416410891675906, "phrase": "open_problem"}, {"score": 0.0028087949095629955, "phrase": "positive_constructive_hausdorff_dimension"}, {"score": 0.002795762692061496, "phrase": "martin-lof_random_sets"}, {"score": 0.002529706064459843, "phrase": "maximum_possible_prefix-free_kolmogorov_complexity"}, {"score": 0.0022467024793003812, "phrase": "plain_kolmogorov_complexity"}, {"score": 0.0022310754972166154, "phrase": "pa-complete_sets"}, {"score": 0.0021246816854197732, "phrase": "universal_turing_machine"}, {"score": 0.0021049977753042253, "phrase": "prefix-free_kolmogorov_complexity"}], "paper_keywords": [""], "paper_abstract": "We introduce the concepts of complex and autocomplex sets, where a set A is complex if there is a recursive, nondecreasing and unbounded lower bound on the Kolmogorov complexity of the prefixes (of the characteristic sequence) of A, and autocomplex is defined likewise with recursive replaced by A-recursive. We observe that exactly the autocomplex sets allow to compute words of given Kolmogorov complexity and demonstrate that a set computes a diagonally nonrecursive (DNR) function if and only if the set is autocomplex. The class of sets that compute DNR functions is intensively studied in recursion theory and is known to coincide with the class of sets that compute fixed-point free functions. Consequently, the Recursion Theorem fails relative to a set if and only if the set is autocomplex, that is, we have a characterization of a fundamental concept of theoretical computer science in terms of Kolmogorov complexity. Moreover, we obtain that recursively enumerable sets are autocomplex if and only if they are complete, which yields an alternate proof of the well-known completeness criterion for recursively enumerable sets in terms of computing DNR functions. All results on autocomplex sets mentioned in the last paragraph extend to complex sets if the oracle computations are restricted to truth-table or weak truth-table computations, for example, a set is complex if and only if it wtt-computes a DNR function. Moreover, we obtain a set that is complex but does not compute a Martin-Lof random set, which gives a partial answer to the open problem whether all sets of positive constructive Hausdorff dimension compute Martin-Lof random sets. Furthermore, the following questions are addressed: Given n, how difficult is it to find a word of length n that (a) has at least prefix-free Kolmogorov complexity n, (b) has at least plain Kolmogorov complexity n or (c) has the maximum possible prefix-free Kolmogorov complexity among all words of length n. All these questions are investigated with respect to the oracles needed to carry out this task and it is shown that (a) is easier than (b) and (b) is easier than (c). In particular, we argue that for plain Kolmogorov complexity exactly the PA-complete sets compute incompressible words, while the class of sets that compute words of maximum complexity depends on the choice of the universal Turing machine, whereas for prefix-free Kolmogorov complexity exactly the complete sets allow to compute words of maximum complexity.", "paper_title": "Kolmogorov complexity and the recursion theorem", "paper_id": "WOS:000236464100011"}