{"auto_keywords": [{"score": 0.04444816239028331, "phrase": "research_institutions"}, {"score": 0.014542150195867836, "phrase": "research_topics"}, {"score": 0.010851616830300337, "phrase": "emerging_themes"}, {"score": 0.010711088013819245, "phrase": "salient_ones"}, {"score": 0.00481495049065317, "phrase": "chinese_and_american_lis_research_institutions"}, {"score": 0.00465964893087681, "phrase": "salient_themes"}, {"score": 0.0030614565460256897, "phrase": "ninety_chinese_and_american_library_and_information_science_research_institutions"}, {"score": 0.002962543869356265, "phrase": "china_national_knowledge_infrastructure"}, {"score": 0.0028108690791085536, "phrase": "investigated_research_institutions"}, {"score": 0.0025977542995083624, "phrase": "treemap_technique"}, {"score": 0.0021753413850499467, "phrase": "research_fronts"}], "paper_keywords": ["Emerging themes", " Salient themes", " Research institution", " Treemap", " Contribution"], "paper_abstract": "Novelty and salience of the research topics are vital for the competitiveness of research institutions and the development of science and technology. In this study, two novel weighting methods were proposed to differentiate the emergence and salience of research topics. A methodology was constructed to measure and visualize the contributions of research institutions to emerging themes and salient ones. The methods were illustrated with the data of ninety Chinese and American Library and Information Science research institutions collected from the Engineering Compendex and China National Knowledge Infrastructure databases between 2001 and 2012. The contributions of the investigated research institutions to the emerging themes and salient ones were calculated and visualized with the Treemap technique. The institutions were further ranked by their contributions and categorized into four types. The findings can help research institutions evaluate novelty and salience of their research topics, discover research fronts and hotspots and promote their research development.", "paper_title": "Measuring and visualizing the contributions of Chinese and American LIS research institutions to emerging themes and salient themes", "paper_id": "WOS:000365130100012"}