{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "asm"}, {"score": 0.007305401479050705, "phrase": "point-based_models"}, {"score": 0.007141561152292809, "phrase": "simplification_approach"}, {"score": 0.006263921390029573, "phrase": "output_samples"}, {"score": 0.006031291022987317, "phrase": "vertical_bar_p-s_vertical_bar"}, {"score": 0.004647610117052964, "phrase": "computer_games"}, {"score": 0.004624181672506343, "phrase": "computer-animated_movies"}, {"score": 0.004531637625717547, "phrase": "important_element"}, {"score": 0.00450879114634833, "phrase": "multimedia_applications"}, {"score": 0.004440937405694194, "phrase": "conventional_polygonal_representation"}, {"score": 0.004374100323348557, "phrase": "direct_adoption"}, {"score": 0.0042865396174255966, "phrase": "model_representation"}, {"score": 0.0041374874583908535, "phrase": "mesh_construction_stage"}, {"score": 0.0031564260018809016, "phrase": "corresponding_surface_s-s"}, {"score": 0.0029930505194626605, "phrase": "previous_approaches"}, {"score": 0.002630533609282376, "phrase": "adaptive_simplification_method"}, {"score": 0.0025843206540392184, "phrase": "efficient_technique"}, {"score": 0.0024442865590979398, "phrase": "simplification_criteria"}, {"score": 0.002383162283306719, "phrase": "low_computation_time"}, {"score": 0.002317685459283719, "phrase": "geometric_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Clustering", " Model simplification", " Point clouds"], "paper_abstract": "Due to the popularity of computer games and computer-animated movies, 3D models are fast becoming an important element in multimedia applications. In addition to the conventional polygonal representation for these models, the direct adoption of the original scanned 3D point set for model representation is recently gaining more and more attention due to the possibility of bypassing the time consuming mesh construction stage, and various approaches have been proposed for directly processing point-based models. In particular, the design of a simplification approach which can be directly applied to 3D point-based models to reduce their size is important for applications such as 3D model transmission and archival. Given a point-based 3D model which is defined by a point set P (P = {p(a) is an element of R-3}) and a desired reduced number of output samples n(s), the simplification approach finds a point set P-s which (i) satisfies vertical bar P-s vertical bar = n(s) (vertical bar P-s vertical bar being the cardinality of P-s) and (ii) minimizes the difference of the corresponding surface S-s (defined by P-s) and the original surface S (defined by P). Although a number of previous approaches has been proposed for simplification, most of them (i) do not focus on point-based 3D models, (ii) do not consider efficiency, quality and generality together and (iii) do not consider the distribution of the output samples. In this paper, we propose an Adaptive Simplification Method (ASM) which is an efficient technique for simplifying point-based complex 3D models. Specifically, the ASM consists of three parts: a hierarchical cluster tree structure, the specification of simplification criteria and an optimization process. The ASM achieves a low computation time by clustering the points locally based on the preservation of geometric characteristics. We analyze the performance of the ASM and show that it outperforms most of the current state-of-the-art methods in terms of efficiency, quality and generality. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "ASM: An adaptive simplification method for 3D point-based models", "paper_id": "WOS:000279137100002"}