{"auto_keywords": [{"score": 0.047869525215773305, "phrase": "spatialized_sound"}, {"score": 0.00481495049065317, "phrase": "three-dimensional_sound_generation_field"}, {"score": 0.004647442352794694, "phrase": "new_applications"}, {"score": 0.004485735417293941, "phrase": "computer_graphics_community"}, {"score": 0.003562912424153324, "phrase": "light_and_sound_wave_propagation"}, {"score": 0.0034388111429203222, "phrase": "physically_accurate_spatio-temporal_quality"}, {"score": 0.0032800357011010728, "phrase": "hvs"}, {"score": 0.00246957392654378, "phrase": "comprehensive_overview"}, {"score": 0.002426137929553724, "phrase": "major_techniques"}, {"score": 0.002286781334850213, "phrase": "perceptual_and_cross-modal_influences"}, {"score": 0.0021940118003312397, "phrase": "current_limitations"}, {"score": 0.002142696637011647, "phrase": "in-depth_look"}, {"score": 0.0021049977753042253, "phrase": "emerging_topics"}], "paper_keywords": ["acoustic rendering", " auralization", " cross-modal interaction", " attention", " perception"], "paper_abstract": "In recent years research in the three-dimensional sound generation field has been primarily focussed upon new applications of spatialized sound. In the computer graphics community the use of such techniques is most commonly found being applied to virtual, immersive environments. However, the field is more varied and diverse than this and other research tackles the problem in a more complete, and computationally expensive manner. Furthermore, the simulation of light and sound wave propagation is still unachievable at a physically accurate spatio-temporal quality in real time. Although the Human Visual System (HVS) and the Human Auditory System (HAS) are exceptionally sophisticated, they also contain certain perceptional and attentional limitations. Researchers, in fields such as psychology, have been investigating these limitations for several years and have come up with findings which may be exploited in other fields. This paper provides a comprehensive overview of the major techniques for generating spatialized sound and, in addition, discusses perceptual and cross-modal influences to consider. We also describe current limitations and provide an in-depth look at the emerging topics in the field.", "paper_title": "Acoustic Rendering and Auditory-Visual Cross-Modal Perception and Interaction", "paper_id": "WOS:000300836400009"}