{"auto_keywords": [{"score": 0.04969089536874819, "phrase": "jaccard_distance"}, {"score": 0.048734215142491696, "phrase": "delay_tolerant_networks"}, {"score": 0.027645073573963074, "phrase": "jder"}, {"score": 0.00481495049065317, "phrase": "tolerant_networks"}, {"score": 0.004585433265422727, "phrase": "new_paradigm"}, {"score": 0.004548253531664032, "phrase": "wireless_communications"}, {"score": 0.0044385053213394175, "phrase": "store-carry-and-forward_operation"}, {"score": 0.004175533280178052, "phrase": "interesting_feature"}, {"score": 0.003960210592458847, "phrase": "new_forwarding_schemes"}, {"score": 0.0038332390893263844, "phrase": "intermittent_communications"}, {"score": 0.003605997900398767, "phrase": "social_communities"}, {"score": 0.0033373303217961803, "phrase": "social_information"}, {"score": 0.0032302647179383915, "phrase": "large_environments"}, {"score": 0.0027666443986705453, "phrase": "emergency_messages"}, {"score": 0.002688781336915723, "phrase": "different_communities"}, {"score": 0.002508663916554954, "phrase": "high_reachability"}, {"score": 0.0021837406983565098, "phrase": "real_life"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Delay tolerant networks", " Jaccard distance", " Forwarding scheme", " Opportunistic networks", " History encountered ration"], "paper_abstract": "Delay tolerant networks have arisen as a new paradigm of wireless communications in which nodes follow a store-carry-and-forward operation. Unlike other ad hoc networks, mobility of nodes is seen as an interesting feature to deliver information from a source node to a destination node. New forwarding schemes have been proposed to deal with the intermittent communications carried out by nodes in delay tolerant networks. Most forwarding schemes assume that nodes are divided into social communities and the communications are likely to be established between two nodes belonging to the same community. However, the social information is not always available, especially in large environments like cities so it has to be inferred from the history of encounters among nodes. Furthermore, there are cases in which the information has to be widely disseminated throughout the network such as alarm and emergency messages so it has to pass through different communities. In this paper, we propose JDER, a new probabilistic forwarding scheme which guarantees high reachability throughout the network by selecting cut-nodes. JDER is based on two metrics: the history encountered ration and the Jaccard distance, and it has been extensively validated through simulations using 8 different mobility models obtained from real life traces. (C) 2013 Published by Elsevier Ltd.", "paper_title": "JDER: A history-based forwarding scheme for delay tolerant networks using Jaccard distance and encountered ration", "paper_id": "WOS:000334002900025"}