{"auto_keywords": [{"score": 0.04933401710855325, "phrase": "document_segmentation"}, {"score": 0.048843518180451934, "phrase": "document_distortion"}, {"score": 0.04835764792705378, "phrase": "compression_distances"}, {"score": 0.00481495049065317, "phrase": "ncd_accuracy"}, {"score": 0.004498490110526062, "phrase": "broad_range"}, {"score": 0.0042692243768616455, "phrase": "leading_efficacy"}, {"score": 0.003926359151817743, "phrase": "particular_circumstances"}, {"score": 0.003373334961160647, "phrase": "substring_relationship"}, {"score": 0.0023133055945761235, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "diverse_nature"}], "paper_keywords": ["Algorithmic information theory", " Data compression", " Information filtering", " Word removal", " Document representation"], "paper_abstract": "Compression distances have been applied to a broad range of domains because of their parameter-free nature, wide applicability and leading efficacy. However, they have a characteristic that can be a drawback when applied under particular circumstances. Said drawback is that when they are used to compare two very different-sized objects, they do not consider them to be similar even if they are related by a substring relationship. This work focuses on addressing this issue when compression distances are used to calculate similarities between documents. The approach proposed in this paper consists of combining document segmentation and document distortion. On the one hand, it is proposed to use document segmentation to tackle the above mentioned drawback. On the other hand, it is proposed to use document distortion to help compression distances to obtain more reliable similarities. The results show that combining both techniques provides better results than not applying them or applying them separately. The said results are consistent across datasets of diverse nature.", "paper_title": "Improving NCD accuracy by combining document segmentation and document distortion", "paper_id": "WOS:000341835200009"}