{"auto_keywords": [{"score": 0.04115970230529494, "phrase": "knowledge_context"}, {"score": 0.039881608764155356, "phrase": "tree_nodes"}, {"score": 0.03390717772468698, "phrase": "different_trees"}, {"score": 0.025648119557685287, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "ontology_comparison"}, {"score": 0.004717485406306594, "phrase": "measuring_approaches"}, {"score": 0.004640929126263433, "phrase": "structural_and_geometrical_characteristics"}, {"score": 0.004364696693320128, "phrase": "minimal_cost"}, {"score": 0.0041555469216463855, "phrase": "pure_structural_perspective"}, {"score": 0.003972607172518598, "phrase": "concept_structures"}, {"score": 0.0038603905208013482, "phrase": "concept_trees"}, {"score": 0.0031071863712898214, "phrase": "classical_tree_similarity"}, {"score": 0.0030441844088874366, "phrase": "tree_transformation_operations"}, {"score": 0.0027141975147496264, "phrase": "concept_structure"}, {"score": 0.002659142621852998, "phrase": "individual_concepts"}, {"score": 0.002637433799290365, "phrase": "different_concept_structures"}, {"score": 0.0025315126622525424, "phrase": "transformation_costs"}, {"score": 0.0023610946923597405, "phrase": "different_ontologies"}, {"score": 0.0021223334214910006, "phrase": "ontology_integration"}, {"score": 0.0021049977753042253, "phrase": "ontology_trust_evaluation"}], "paper_keywords": ["Tree", " Similarity Measuring", " Transformation Operation", " Transformation Cost", " Ontology Integration", " Ontology Comparison"], "paper_abstract": "Classical tree similarity measuring approaches focus on the structural and geometrical characteristics of the trees. The degree of similarity between two trees is measured by the minimal cost of editing sequences that convert one tree into the other one from pure structural perspective. Differently, when the trees are created to represent concept structures in a knowledge context (known as concept trees), the tree nodes represent concepts, not merely abstract elements occupying specific positions. Therefore, measuring similarity of such trees requires a more comprehensive method which takes the position, significance of the concepts (represented by the tree nodes), and conceptual similarity among the concepts from different trees into consideration. This paper extends the classical tree similarity measuring method to introduce tree transformation operations which transform one concept tree to another one. We propose definitions for the costs of the operations based on the position, importance of each concept within a concept structure, and similarity between individual concepts from different concept structures in a knowledge context. The method for computing the transformation costs and measuring similarity between different trees is presented. We apply the proposed method to ontology comparison where different ontologies for the same domain are represented as trees and their similarity is required to be measured. We show that the proposed method can facilitate the initiation of ontology integration and ontology trust evaluation.", "paper_title": "A Tree Similarity Measuring Method and its Application to Ontology Comparison", "paper_id": "WOS:000270880000003"}