{"auto_keywords": [{"score": 0.040537135041717604, "phrase": "change_footprints"}, {"score": 0.004815148564113052, "phrase": "st"}, {"score": 0.004719473826242326, "phrase": "st_change_footprint_discovery"}, {"score": 0.004334280585565239, "phrase": "footprint_discovery"}, {"score": 0.004164007198843467, "phrase": "climate_change"}, {"score": 0.003766908559075843, "phrase": "diverse_set"}, {"score": 0.003729335910488339, "phrase": "research_areas"}, {"score": 0.0036553070575015344, "phrase": "time_series_analysis"}, {"score": 0.0035648266669315943, "phrase": "spatial_statistics"}, {"score": 0.003306559295382181, "phrase": "inconsistent_use"}, {"score": 0.003240895431893266, "phrase": "varied_definitions"}, {"score": 0.0031448288291084, "phrase": "existing_reviews"}, {"score": 0.003097865379563127, "phrase": "discovery_methods"}, {"score": 0.002902304851882577, "phrase": "time_series"}, {"score": 0.0027054473441439422, "phrase": "multi-disciplinary_review"}, {"score": 0.002678433668156676, "phrase": "st_change_patterns"}, {"score": 0.002560162916190598, "phrase": "possible_st_change_footprints"}, {"score": 0.002246955931290095, "phrase": "pattern_discovery"}, {"score": 0.002224510044064184, "phrase": "vector_st_datasets"}], "paper_keywords": [""], "paper_abstract": "Given a definition of change and a dataset about spatiotemporal (ST) phenomena, ST change footprint discovery is the process of identifying the location and/or time of such changes from the dataset. Change footprint discovery is fundamentally important for the study of climate change, the tracking of disease, and many other applications. Methods for detecting change footprints have emerged from a diverse set of research areas, ranging from time series analysis and remote sensing to spatial statistics. Researchers have much to learn from one another, but are stymied by inconsistent use of terminology and varied definitions of change across disciplines. Existing reviews focus on discovery methods for only one or a few types of change footprints (e.g., point change in a time series). To facilitate sharing of insights across disciplines, we conducted a multi-disciplinary review of ST change patterns and their respective discovery methods. We developed a taxonomy of possible ST change footprints and classified our review findings accordingly. This exercise allowed us to identify gaps in the research that we consider ripe for exploration, most notably change pattern discovery in vector ST datasets. In addition, we illustrate how such pattern discovery might proceed using two case studies from historical GIS. (C) 2013 John Wiley & Sons, Ltd.", "paper_title": "Spatiotemporal change footprint pattern discovery: an inter-disciplinary survey", "paper_id": "WOS:000328714200001"}