{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "word's_common_usage"}, {"score": 0.00378767277402891, "phrase": "first_experiment"}, {"score": 0.003737485125097945, "phrase": "participants'_abilities"}, {"score": 0.003543273649210823, "phrase": "non-immersive_task"}, {"score": 0.0034730657554172405, "phrase": "second_experiment"}, {"score": 0.003314591878914152, "phrase": "participants'_eye_movements"}, {"score": 0.0032489004068215407, "phrase": "immersive_task"}, {"score": 0.0031845067058084583, "phrase": "third_experiment"}, {"score": 0.0030595112110658675, "phrase": "externally_imposed_pace"}, {"score": 0.0029394074636168435, "phrase": "affective_measures"}, {"score": 0.0021333110194180997, "phrase": "positive_experience"}, {"score": 0.0021049977753042253, "phrase": "negative_emotions"}], "paper_keywords": ["immersion", " games", " eye tracking", " pace", " affect"], "paper_abstract": "Despite the word's common usage by garners and reviewers alike, it is still not clear what immersion means. This paper explores immersion further by investigating whether immersion can be defined quantitatively, describing three experiments in total. The first experiment investigated participants' abilities to switch from an immersive to a non-immersive task. The second experiment investigated whether there were changes in participants' eye movements during an immersive task. The third experiment investigated the effect of an externally imposed pace of interaction on immersion and affective measures (state anxiety, positive affect, negative affect). Overall the findings suggest that immersion can be measured subjectively (through questionnaires) as well as objectively (task completion time, eye movements). Furthermore, immersion is not only viewed as a positive experience: negative emotions and uneasiness (i.e. anxiety) also run high. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Measuring and defining the experience of immersion in games", "paper_id": "WOS:000258807700001"}