{"auto_keywords": [{"score": 0.049561472167574526, "phrase": "motor_theory"}, {"score": 0.015057811791245978, "phrase": "speech_perception"}, {"score": 0.008713768692145006, "phrase": "novel_accent"}, {"score": 0.007569011616349054, "phrase": "foreign_accent"}, {"score": 0.006249007794262213, "phrase": "mirror_neurons"}, {"score": 0.004397875849247165, "phrase": "motor_representation"}, {"score": 0.0041200448395938526, "phrase": "plausible_that_recognition"}, {"score": 0.003987755561492638, "phrase": "speech_gestures"}, {"score": 0.0035507457285983268, "phrase": "larger_framework"}, {"score": 0.0034742854447532678, "phrase": "adaptive_formation"}, {"score": 0.0033262524445013303, "phrase": "mirror_system"}, {"score": 0.003266443127727596, "phrase": "larger_system"}, {"score": 0.003242820629121494, "phrase": "neuro-linguistic_processing"}, {"score": 0.0031845067058084613, "phrase": "present_consideration"}, {"score": 0.003037736332283186, "phrase": "novel_computational_model"}, {"score": 0.002887210021573995, "phrase": "listener's_native_language"}, {"score": 0.0028249975318149468, "phrase": "core_tenet"}, {"score": 0.002515090164966655, "phrase": "native_language_repertoire"}, {"score": 0.0023903999901926224, "phrase": "later_words"}, {"score": 0.002190825828942124, "phrase": "reference_point"}, {"score": 0.0021049977753042253, "phrase": "dual-stream_neuro-linguistic_architecture"}], "paper_keywords": ["Neurolinguistics", " Computational modeling", " Mirror neurons", " Speech recognition", " Foreign accent", " Motor theory of speech perception", " Hidden Markov Models"], "paper_abstract": "The motor theory of speech perception holds that we perceive the speech of another in terms of a motor representation of that speech. However, when we have learned to recognize a foreign accent, it seems plausible that recognition of a word rarely involves reconstruction of the speech gestures of the speaker rather than the listener. To better assess the motor theory and this observation, we proceed in three stages. Part 1 places the motor theory of speech perception in a larger framework based on our earlier models of the adaptive formation of mirror neurons for grasping, and for viewing extensions of that mirror system as part of a larger system for neuro-linguistic processing, augmented by the present consideration of recognizing speech in a novel accent. Part 2 then offers a novel computational model of how a listener comes to understand the speech of someone speaking the listener's native language with a foreign accent. The core tenet of the model is that the listener uses hypotheses about the word the speaker is currently uttering to update probabilities linking the sound produced by the speaker to phonemes in the native language repertoire of the listener. This, on average, improves the recognition of later words. This model is neutral regarding the nature of the representations it uses (motor vs. auditory). It serve as a reference point for the discussion in Part 3, which proposes a dual-stream neuro-linguistic architecture to revisits claims for and against the motor theory of speech perception and the relevance of mirror neurons, and extracts some implications for the reframing of the motor theory.", "paper_title": "Recognizing speech in a novel accent: the motor theory of speech perception reframed", "paper_id": "WOS:000323655700003"}