{"auto_keywords": [{"score": 0.026984168605458464, "phrase": "game_worlds"}, {"score": 0.00481495049065317, "phrase": "computer_games"}, {"score": 0.004363846362238565, "phrase": "predictable_and_impersonal_gameplay"}, {"score": 0.004278807087784626, "phrase": "unconventional_players"}, {"score": 0.003728000957725218, "phrase": "present_research"}, {"score": 0.0036914757355166966, "phrase": "game_adaptivity"}, {"score": 0.003566422652043389, "phrase": "main_challenges"}, {"score": 0.0031070348334684356, "phrase": "generation_engine"}, {"score": 0.002943147037670826, "phrase": "adaptivity's_targets"}, {"score": 0.0028016507334576216, "phrase": "emerging_field_point"}, {"score": 0.002640781900605126, "phrase": "gameplay_expectations"}, {"score": 0.0023694065215394593, "phrase": "procedural_content_generation"}, {"score": 0.002346160830406661, "phrase": "semantic_modeling"}, {"score": 0.0022777800735119405, "phrase": "offline_customized_content"}, {"score": 0.002255431275670053, "phrase": "online_adjustments"}, {"score": 0.0021049977753042253, "phrase": "ample_research_efforts"}], "paper_keywords": ["Adaptive games", " declarative modeling", " online adaptivity", " player assessment", " player modeling", " procedural content generation", " semantic modeling"], "paper_abstract": "In computer games and simulations, content is often rather static and rigid. As a result, its prescripted nature can lead to predictable and impersonal gameplay, while alienating unconventional players. Adaptivity in games has therefore been recently proposed to overcome these shortcomings and make games more challenging and appealing. In this paper, we survey present research on game adaptivity, identifying, and discussing the main challenges, and pointing out some of the most promising directions ahead. We first survey the purposes of adaptivity, as the principles that could steer an adaptation and generation engine. From this perspective, we proceed to thoroughly discuss adaptivity's targets and methods. Current advances and successes in this emerging field point to many yet unexplored research opportunities. Among them, we discuss the use of gameplay expectations, learning preferences, and assessment data in the integrated adaptation of game worlds, scenarios, and quests. We conclude that, among other methods, procedural content generation and semantic modeling can powerfully combine to create offline customized content and online adjustments to game worlds, scenarios, and quests. These and other promising methods, deserving ample research efforts, can therefore, be expected to significantly contribute towards making games and simulations even more unpredictable, effective, and fun.", "paper_title": "Adaptivity Challenges in Games and Simulations: A Survey", "paper_id": "WOS:000295473500001"}