{"auto_keywords": [{"score": 0.027379182735969967, "phrase": "imperfect_csi"}, {"score": 0.00481495049065317, "phrase": "imperfect_csi."}, {"score": 0.004089239912167375, "phrase": "harmful_interference"}, {"score": 0.0038415095105632157, "phrase": "problem_interference_alignment"}, {"score": 0.0038047474331318974, "phrase": "iterative_equalization_techniques"}, {"score": 0.003697549393609359, "phrase": "ia"}, {"score": 0.0035060903664150115, "phrase": "low_dimensional_subspace"}, {"score": 0.002948547333717581, "phrase": "error-free_channel_state_information"}, {"score": 0.0028100102841877835, "phrase": "csi_errors"}, {"score": 0.0027564303939865476, "phrase": "substantial_performance_degradation"}, {"score": 0.002716915166374506, "phrase": "imperfect_alignments"}, {"score": 0.0026268961477241026, "phrase": "ia_precoders"}, {"score": 0.0025398521156505425, "phrase": "efficient_iterative_space-frequency_equalization"}, {"score": 0.00247944491239733, "phrase": "receiver_side"}, {"score": 0.00242047093248845, "phrase": "residual_aligned_interference"}, {"score": 0.0023515464194592195, "phrase": "iterative_equalization"}, {"score": 0.002208853811052348, "phrase": "poorly_aligned_interference"}, {"score": 0.002166711569953301, "phrase": "matched_filter_bound_performance"}], "paper_keywords": [""], "paper_abstract": "In this paper we consider a scenario, where several small-cells work under the same coverage area and spectrum of a macrocell. The signals stemming from the small-cell (macrocell) users if not carefully dealt with will generate harmful interference into the macrocell (small-cell). To tackle this problem interference alignment and iterative equalization techniques are considered. By using IA all interference generated by the small-cell (macrocell) users is aligned along a low dimensional subspace, at the macrocell (small-cells). This reduces considerably the amount of resources allocated, to enable the coexistence of the two systems. However, perfect IA requires the availability of error-free channel state information (CSI) at the transmitters. Due to CSI errors one can have substantial performance degradation due to imperfect alignments. Since in this work the IA precoders are based on imperfect CSI, an efficient iterative space-frequency equalization is designed at the receiver side to cope with the residual aligned interference. The results demonstrate that iterative equalization is robust to imperfect CSI and removes efficiently the interference generated by the poorly aligned interference. Close to matched filter bound performance is achieved, with a very few number of iterations.", "paper_title": "Iterative Equalization and Interference Alignment for Multiuser MIMO HetNets with Imperfect CSI", "paper_id": "WOS:000367951800001"}