{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "electromagnetic_imaging"}, {"score": 0.004783232571029632, "phrase": "stored_grain_monitoring"}, {"score": 0.004736045157669388, "phrase": "important_post-harvest_stage"}, {"score": 0.004689321062844586, "phrase": "food_production_chain"}, {"score": 0.0045820747375409435, "phrase": "large_metal_containers"}, {"score": 0.004190796368475121, "phrase": "grain_bins"}, {"score": 0.0036714667610391535, "phrase": "monitored_storage"}, {"score": 0.0035519826240477444, "phrase": "novel_grain-monitoring_technique"}, {"score": 0.0033465923623290034, "phrase": "side-mounted_antennas"}, {"score": 0.0031950646670695546, "phrase": "electromagnetic_energy"}, {"score": 0.0031426214970263137, "phrase": "discrete_locations"}, {"score": 0.0030808211830129304, "phrase": "optimization_algorithm"}, {"score": 0.0027346529452880585, "phrase": "synthetic_validation"}, {"score": 0.002707620139970122, "phrase": "proposed_method"}, {"score": 0.0026543514413663893, "phrase": "full_scale_hopper_bin"}, {"score": 0.002602127996667857, "phrase": "electromagnetic_field_data"}, {"score": 0.002559392185079503, "phrase": "scaled_experimental_system"}, {"score": 0.002459660938061167, "phrase": "induced_contamination"}, {"score": 0.0022196020509093694, "phrase": "reliable_and_robust_method"}, {"score": 0.0021903801614787423, "phrase": "stored_grain"}, {"score": 0.002168715943767454, "phrase": "stored_food_resources"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Grain bin imaging", " Microwave imaging", " Electromagnetic imaging", " Grain bin monitoring", " Three-dimensional imaging"], "paper_abstract": "Stored grain monitoring is an important post-harvest stage of the food production chain. Grains are usually stored in large metal containers referred to as bins or silos. During storage, there is a possibility for grain to spoil and become unusable. Therefore, monitoring of grain bins is essential to detect conditions leading to spoilage within the bin. Most current grain bin monitoring techniques lack sensitivity as they require conditions leading to spoilage to surpass a certain limit before detection is possible, and consequently a large amount of stored grain is lost during monitored storage. This paper presents the advances in developing a novel grain-monitoring technique using electromagnetic imaging, a modality that can provide global, quantitative images of grain properties throughout the bin. Side-mounted antennas illuminate the contents of the bin and a set of receivers measures the electromagnetic energy within the bin at discrete locations. Using these measurements an optimization algorithm attempts to reconstruct the contents of the bin - herein a finite-element contrast source inversion (FEM-CSI) algorithm was used. The result is a global map of the electrical properties of the grain throughout the bin. In this work we first present a synthetic validation of the proposed method for a model of a full scale hopper bin using simulations to produce the electromagnetic field data. Next, a scaled experimental system was used to collect data from grain that contained regions of induced contamination. This data was used to produce images that show the applicability of the method in practice. Results suggest that this technology has potential to provide farmers with a reliable and robust method to remotely monitor stored grain, preserving stored food resources and increasing their revenue. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Grain bin monitoring via electromagnetic imaging", "paper_id": "WOS:000366781500014"}