{"auto_keywords": [{"score": 0.027276746219092905, "phrase": "etac"}, {"score": 0.00481495049065317, "phrase": "adaptive_coding"}, {"score": 0.004784795480627637, "phrase": "countable_alphabets"}, {"score": 0.004754828422696271, "phrase": "max-stable_envelope"}, {"score": 0.0045789085863942825, "phrase": "lossless_universal_source_coding"}, {"score": 0.004550225097519697, "phrase": "stationary_memoryless_sources"}, {"score": 0.004521720473366683, "phrase": "countably_infinite_alphabets"}, {"score": 0.004166943227096525, "phrase": "natural_families"}, {"score": 0.00408909044445249, "phrase": "common_dominating_envelope"}, {"score": 0.0036285822640427525, "phrase": "hierarchical_universal_source_coding"}, {"score": 0.003571968614903263, "phrase": "important_difference"}, {"score": 0.0035273120781708655, "phrase": "envelope_classes"}, {"score": 0.003312238122534935, "phrase": "adaptive_universal_source_coding"}, {"score": 0.003129871835064893, "phrase": "natural_language_modeling"}, {"score": 0.002856881200879377, "phrase": "constructive_code"}, {"score": 0.0026741446768534824, "phrase": "expanding_threshold"}, {"score": 0.0024485031231407522, "phrase": "minimax_redundancy"}, {"score": 0.0023951255255435272, "phrase": "sequence_length"}, {"score": 0.002328199473006809, "phrase": "near-adaptive_code"}, {"score": 0.002299056585865374, "phrase": "heavy-tailed_envelopes"}, {"score": 0.00227743851871825, "phrase": "finite_and_light-tailed_envelopes"}, {"score": 0.0021929755499482174, "phrase": "closely_previous_results"}, {"score": 0.0021587119099287337, "phrase": "light-tailed_assumption"}, {"score": 0.0021049977753042253, "phrase": "regular_variation_theory"}], "paper_keywords": ["Countable alphabets", " redundancy", " adaptive compression", " minimax"], "paper_abstract": "In this paper, we study the problem of lossless universal source coding for stationary memoryless sources on countably infinite alphabets. This task is generally not achievable without restricting the class of sources over which universality is desired. Building on our prior work, we propose natural families of sources characterized by a common dominating envelope. We particularly emphasize the notion of adaptivity, which is the ability to perform as well as an oracle knowing the envelope, without actually knowing it. This is closely related to the notion of hierarchical universal source coding, but with the important difference that families of envelope classes are not discretely indexed and not necessarily nested. Our contribution is to extend the classes of envelopes over which adaptive universal source coding is possible, namely by including max-stable (heavy-tailed) envelopes which are excellent models in many applications, such as natural language modeling. We derive a minimax lower bound on the redundancy of any code on such envelope classes, including an oracle that knows the envelope. We then propose a constructive code that does not use knowledge of the envelope. The code is computationally efficient and is structured to use an expanding threshold for auto-censoring (ETAC), and we therefore dub it the ETAC-code. We prove that the ETAC-code achieves the lower bound on the minimax redundancy within a factor logarithmic in the sequence length, and can be therefore qualified as a near-adaptive code over families of heavy-tailed envelopes. For finite and light-tailed envelopes, the penalty is even less, and the same code follows closely previous results that explicitly made the light-tailed assumption. Our technical results are founded on methods from regular variation theory and concentration of measure.", "paper_title": "About Adaptive Coding on Countable Alphabets: Max-Stable Envelope Classes", "paper_id": "WOS:000360015900029"}