{"auto_keywords": [{"score": 0.03804410732293572, "phrase": "fiber_delays"}, {"score": 0.006854073795496084, "phrase": "optical_buffers"}, {"score": 0.004693167092003573, "phrase": "systematic_switched_delay_lines"}, {"score": 0.004673171774524816, "phrase": "sdl"}, {"score": 0.0046532577929955955, "phrase": "construction_methods"}, {"score": 0.004584227654920562, "phrase": "practical_and_challenging_issue"}, {"score": 0.004439719483780046, "phrase": "fault-tolerant_capability"}, {"score": 0.004116204315665808, "phrase": "straightforward_choice"}, {"score": 0.0036912347403784134, "phrase": "optimal_choice"}, {"score": 0.003639716037068574, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0033271882617245657, "phrase": "simple_packet_routing_policy"}, {"score": 0.003087284296403192, "phrase": "section_ii-a"}, {"score": 0.003054450075234415, "phrase": "feedback_system"}, {"score": 0.002657988214159276, "phrase": "larger_delays"}, {"score": 0.002629707645669084, "phrase": "smaller_delays"}, {"score": 0.0024399717841513354, "phrase": "buffer_size"}, {"score": 0.0023178219772486868, "phrase": "construction_efficiency"}, {"score": 0.0022638944685958386, "phrase": "special_choice"}, {"score": 0.0021597662797996843, "phrase": "asymptotic_construction_efficiency"}], "paper_keywords": ["fault-tolerant capability", " first-in first-out (FIFO) multiplexers", " optical buffers", " optical queues", " optical switches", " survivability", " switched delay lines"], "paper_abstract": "Recent advances in the literature have shown that there exist systematic switched delay lines (SDL) construction methods for various types of optical buffers. A practical and challenging issue of the constructions of optical buffers that has not been addressed before is on the fault-tolerant capability of such constructions. In this paper, we focus on the constructions of fault-tolerant optical 2-to-1 first-in first out (FIFO) multiplexers. We consider a feedback system consisting of an (M + 2) x (11 + 2) optical crossbar switch and M fiber delay lines with delays d(1), d(2)...... d(M). These M fiber delay lines are connected from M outputs of the crossbar switch back to M inputs of the switch, leaving two inputs (resp., two outputs) of the switch for the two inputs (resp., two outputs) of the 2-to-1 multiplexer. In one of our previous papers, we have shown a necessary and sufficient condition on the fiber delays d(1), d(2),. . . ,d(M) (specifically, the condition in (A1) given in Section 1) for such a feedback system to be operated as a 2-to-1 FIFO multiplexer with buffer Sigma(M)(i=1), d(i) under a simple packet routing policy. In this paper, we obtain another condition on the fiber delays d(1), d(2), . . . , d(M) (specifically, the condition in (A2) given in Section II-A) such that the feedback system can still be operated as a 2-to-1 FIFO multiplexer with buffer Sigma(M-F)(i=1)even after up to F of the fibers are broken, where 0 <= F <= M - 1. We show that such a choice given by (A2) is better than a straightforward choice of the fiber delays. The idea behind the choice given by (A2) is to compose fibers with larger delays by using fibers with smaller delays so that the condition in (A1) is still satisfied even after up to F of the fibers are broken. Furthermore, we obtain the optimal choice (in the sense of maximizing the buffer size) among all of the choices given by (A2). In order to compare various choices of the fiber delays, we introduce the construction efficiency for a construction of a 2-to-1 FIFO multiplexer. By specifying a special choice of the fiber delays that satisfy the condition in (A2), we are able to derive a lower bound on the asymptotic construction efficiency for the optimal choice of the fiber delays. Our results show that the (asymptotic) construction efficiency for the optimal choice is much better than that for the straightforward choice of the fiber delays.", "paper_title": "Constructions of fault-tolerant optical 2-to-1 FIFO multiplexers", "paper_id": "WOS:000250448800016"}