{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "whole_product_creation_process"}, {"score": 0.0046069985410261746, "phrase": "innovation_cycle"}, {"score": 0.004435885269134359, "phrase": "competitive_advantage"}, {"score": 0.004164644263639545, "phrase": "new_products"}, {"score": 0.003788444178071508, "phrase": "computer_based_product_synthesis"}, {"score": 0.0036246643358397272, "phrase": "product_data_management_system"}, {"score": 0.0032763212574036748, "phrase": "dedicated_data_transfer"}, {"score": 0.002887450071878095, "phrase": "arrangement_drawing"}, {"score": 0.002815383690003621, "phrase": "final_assembly"}, {"score": 0.002676587673012276, "phrase": "continuous_data_model"}, {"score": 0.0024968185204913935, "phrase": "product_creation_process"}, {"score": 0.0023290951071300433, "phrase": "engineering_workbench"}, {"score": 0.0021589195238286233, "phrase": "information_feed-back_control_system"}], "paper_keywords": [""], "paper_abstract": "Companies have to shorten the innovation cycle for products to obtain a competitive advantage. Thus not only time to market but also time for developing new products has to be reduced. Due to that several software tools are used to facilitate a computer based product synthesis. One of them is a Product Data Management System (PDMS) for the integration and administration of all kind of CAx-data. With dedicated data transfer, information processing methods and self-generating assembly sequences it is possible to shorten the time between the arrangement drawing, part production and final assembly to a few moments. Because of a continuous data model it is even possible to transmit data backward in the product creation process. The information can be used as rules for an engineering workbench or for the visualization of the progress. Consequently a PDMS as an information feed-back control system can realize a more robust and sustainable product synthesis.", "paper_title": "Process data management for the shortening of the whole product creation process", "paper_id": "WOS:000237080800062"}