{"auto_keywords": [{"score": 0.044439418729708045, "phrase": "grid_workloads"}, {"score": 0.00481495049065317, "phrase": "large_grids"}, {"score": 0.004417848254181138, "phrase": "strict_organizational_permissions"}, {"score": 0.0041773934798743405, "phrase": "grid_researcher"}, {"score": 0.003916098498242888, "phrase": "grid_workloads_archive"}, {"score": 0.0037348894128879082, "phrase": "workload_data_exchange"}, {"score": 0.003686935223424015, "phrase": "meeting_point"}, {"score": 0.0036395944934310524, "phrase": "grid_community"}, {"score": 0.003501175642882274, "phrase": "workload_archive"}, {"score": 0.0033104481447263044, "phrase": "gwa."}, {"score": 0.003212074324593725, "phrase": "grid_workload_information"}, {"score": 0.00295950473406239, "phrase": "nine_well-known_grid_environments"}, {"score": 0.002738523189244011, "phrase": "working_environments"}, {"score": 0.002437525632451029, "phrase": "parallel_production"}, {"score": 0.0023548511815224098, "phrase": "single-node_jobs"}, {"score": 0.0021789194955896124, "phrase": "immediate_applications"}, {"score": 0.002150904887042127, "phrase": "gwa"}], "paper_keywords": ["grid computing", " grid workloads", " grid traces"], "paper_abstract": "While large grids are currently supporting the work of thousands of scientists, very little is known about their actual use. Due to strict organizational permissions, there are few or no traces of grid workloads available to the grid researcher and practitioner. To address this problem, in this work we present the Grid Workloads Archive (GWA), which is at the same time a workload data exchange and a meeting point for the grid community. We define the requirements for building a workload archive, and describe the approach taken to meet these requirements with the GWA. We introduce a format for sharing grid workload information, and tools associated with this format. Using these tools, we collect and analyze data from nine well-known grid environments, with a total content of more than 2000 users submitting more than 7 million jobs over a period of over 13 operational years, and with working environments spanning over 130 sites comprising 10000 resources. We show evidence that grid workloads are very different from those encountered in other large-scale environments, and in particular from the workloads of parallel production. environments: they comprise almost exclusively single-node jobs, and jobs arrive in \"bags-of-tasks\". Finally, we present the immediate applications of the GWA and of its content in several critical grid research and practical areas: research in grid resource management, and grid design, operation, and maintenance. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "The grid workloads archive", "paper_id": "WOS:000257354200005"}