{"auto_keywords": [{"score": 0.026664819738975633, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "image_registration"}, {"score": 0.004728122501822142, "phrase": "commonly_used_technique"}, {"score": 0.004509594355983191, "phrase": "larger_field"}, {"score": 0.004285489630701221, "phrase": "overlapping_regions"}, {"score": 0.003870009704443373, "phrase": "existing_techniques"}, {"score": 0.0037588493723080757, "phrase": "image_boundaries"}, {"score": 0.003624361893008392, "phrase": "available_information"}, {"score": 0.00350742771604554, "phrase": "registration_approach"}, {"score": 0.003260860308644701, "phrase": "novel_registration_approach"}, {"score": 0.0031212935348800467, "phrase": "perceptual_grouping_approach"}, {"score": 0.0030205408413942272, "phrase": "available_structures"}, {"score": 0.00296597499768551, "phrase": "structural_maps"}, {"score": 0.00293370839211022, "phrase": "extended_regions"}, {"score": 0.0027876981671591202, "phrase": "shared_information"}, {"score": 0.002601065207135226, "phrase": "subimage_boundaries"}, {"score": 0.0024268966855267153, "phrase": "multi-modal_images"}, {"score": 0.002215329893200788, "phrase": "synthetic_and_medical_images"}, {"score": 0.0021049977753042253, "phrase": "physical_gap"}], "paper_keywords": ["Image registration", " stitching", " structure propagation", " tensor voting"], "paper_abstract": "Mosaicing is a commonly used technique in many medical imaging applications where subimages are stitched together in order to obtain a larger field of view. However, stitching, which involves alignment or registration in overlapping regions, is often challenging when the information shared by subimages is absent or small. While it is not possible to perform an alignment without overlap using existing techniques, imaging artifacts such as distortions towards image boundaries present further complications during registration by decreasing the reliability of available information. Without taking these into consideration, a registration approach might violate the continuity and the smoothness of structures across subimages. In this paper, we propose a novel registration approach for the stitching of subimages in such challenging scenarios. By using a perceptual grouping approach, we extend subimages beyond their boundaries by propagating available structures in order to obtain structural maps in the extended regions. These maps are then used to establish correspondences between subimages when the shared information is absent, small or unreliable. Using our approach ensures the continuity and the smoothness of structures across subimage boundaries. Furthermore, since only structures are used, the proposed method can also be used for the stitching of multi-modal images. Our approach is unique in that it also enables contactless stitching. We demonstrate the effectiveness of the proposed method by performing several experiments on synthetic and medical images. Moreover, we show how stitching is possible in the presence of a physical gap between subimages.", "paper_title": "Structure Propagation for Image Registration", "paper_id": "WOS:000324251000009"}