{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_combination"}, {"score": 0.0047588556219929756, "phrase": "asymptotic_inferences"}, {"score": 0.004689650818647484, "phrase": "k_independent_binomial_proportions"}, {"score": 0.004621447740470602, "phrase": "applied_research"}, {"score": 0.0036660436272785476, "phrase": "martin_andres_et_al"}, {"score": 0.0036020923276404403, "phrase": "adjusted_wald"}, {"score": 0.0034673190692473903, "phrase": "bonett"}, {"score": 0.0033277936960179892, "phrase": "zou_et_al"}, {"score": 0.0032505921489759224, "phrase": "wilson_confidence_interval"}, {"score": 0.003175175896313016, "phrase": "newcombe_method"}, {"score": 0.0031106189016953142, "phrase": "new_procedure"}, {"score": 0.00304737045343781, "phrase": "classic_peskun_method"}, {"score": 0.0030118058266380503, "phrase": "previous_methods"}, {"score": 0.0029854041893236714, "phrase": "continuity_correction"}, {"score": 0.0027823318789880714, "phrase": "eight_aforementioned_procedures"}, {"score": 0.0024236964502593254, "phrase": "optimal_method"}, {"score": 0.00224551648748308, "phrase": "excessively_wide_cis"}, {"score": 0.002206290313627494, "phrase": "additional_advantage"}, {"score": 0.002148729349266374, "phrase": "free_programme"}], "paper_keywords": ["confidence interval", " linear combination of proportions", " Peskun method", " score method", " Wald method", " Wilson method"], "paper_abstract": "Asymptotic inferences about a linear combination of K independent binomial proportions are very frequent in applied research. Nevertheless, until quite recently research had been focused almost exclusively on cases of K <= 2 (particularly on cases of one proportion and the difference of two proportions). This article focuses on cases of K > 2, which have recently begun to receive more attention due to their great practical interest. In order to make this inference, there are several procedures which have not been compared: the score method (S0) and the method proposed by Martin Andres et al. (W3) for adjusted Wald (which is a generalization of the method proposed by Price and Bonett) on the one hand and, on the other hand, the method of Zou et al. (N0) based on the Wilson confidence interval (which is a generalization of the Newcombe method). The article describes a new procedure (P0) based on the classic Peskun method, modifies the previous methods giving them continuity correction (methods S0c, W3c, N0c and P0c, respectively) and, finally, a simulation is made to compare the eight aforementioned procedures (which are selected from a total of 32 possible methods). The conclusion reached is that the S0c method is the best, although for very small samples (n(i) <= 10, for all i) the W3 method is better. The P0 method would be the optimal method if one needs a method which is almost never too liberal, but this entails using a method which is too conservative and which provides excessively wide CIs. The W3 and P0 methods have the additional advantage of being very easy to apply. A free programme which allows the application of the S0 and S0c methods (which are the most complex) can be obtained at http://www.ugr.es/local/bioest/Z_LINEAR_K.EXE.", "paper_title": "The optimal method to make inferences about a linear combination of proportions", "paper_id": "WOS:000302056500010"}