{"auto_keywords": [{"score": 0.042519307045481215, "phrase": "rm_codes"}, {"score": 0.00481495049065317, "phrase": "reed-muller_codes_for_random_erasures"}, {"score": 0.004705225396261578, "phrase": "tight_bounds"}, {"score": 0.0045820747375409435, "phrase": "binary_erasure_channel"}, {"score": 0.004556901872357751, "phrase": "binary_symmetry_channel"}, {"score": 0.004172360444377281, "phrase": "random_sets"}, {"score": 0.003536346954940087, "phrase": "different_techniques"}, {"score": 0.0032826043188559613, "phrase": "truth_tables"}, {"score": 0.0031236080850960096, "phrase": "random_columns"}, {"score": 0.003030247482854539, "phrase": "full_column_rank"}, {"score": 0.0029559346879594254, "phrase": "high_probability"}, {"score": 0.002713604305939145, "phrase": "random_errors"}, {"score": 0.0026543514413663893, "phrase": "linear_code_c"}, {"score": 0.002639740960006001, "phrase": "sufficiently_high_rate"}, {"score": 0.0026035647157861114, "phrase": "new_code_c"}, {"score": 0.0025749800842877167, "phrase": "tensorizing_c"}, {"score": 0.002532689001785861, "phrase": "subset_s"}, {"score": 0.002293103325499786, "phrase": "unique_decoding"}, {"score": 0.002261666793030715, "phrase": "high_rate"}, {"score": 0.002218376741764432, "phrase": "achieving_results"}, {"score": 0.0021879624017959493, "phrase": "weight_distribution"}, {"score": 0.0021342613107011624, "phrase": "recent_bounds"}, {"score": 0.002122507495446441, "phrase": "constant_degree"}, {"score": 0.0021049977753042253, "phrase": "degree_polynomials"}], "paper_keywords": ["Linear codes", " Reed-Muller codes", " weight enumerator", " multivariate polynomials", " tensors", " capacity"], "paper_abstract": "This paper studies the parameters for which binary Reed-Muller (RM) codes can be decoded successfully on the binary erasure channel and binary symmetry channel, and, in particular, when can they achieve capacity for these two classical channels. Necessarily, this paper also studies the properties of evaluations of multivariate GF(2) polynomials on the random sets of inputs. For erasures, we prove that RM codes achieve capacity both for very high rate and very low rate regimes. For errors, we prove that RM codes achieve capacity for very low rate regimes, and for very high rates, we show that they can uniquely decode at about the square root of the number of errors at capacity. The proofs of these four results are based on different techniques, which we find interesting in their own right. In particular, we study the following questions about E(m, r), the matrix whose rows are the truth tables of all the monomials of degree <= r in m variables. What is the most (resp. least) number of random columns in E(m, r) that define a submatrix having full column rank (resp. full row rank) with high probability? We obtain tight bounds for very small (resp. very large) degrees r, which we use to show that RM codes achieve capacity for erasures in these regimes. Our decoding from random errors follows from the following novel reduction. For every linear code C of sufficiently high rate, we construct a new code C' obtained by tensorizing C, such that for every subset S of coordinates, if C can recover from erasures in S, then C' can recover from errors in S. Specializing this to the RM codes and using our results for erasures imply our result on the unique decoding of the RM codes at high rate. Finally, two of our capacity achieving results require tight bounds on the weight distribution of RM codes. We obtain such bounds extending the recent bounds from constant degree to linear degree polynomials.", "paper_title": "Reed-Muller Codes for Random Erasures and Errors", "paper_id": "WOS:000361486800001"}