{"auto_keywords": [{"score": 0.04827794640391151, "phrase": "user-generated_content"}, {"score": 0.04150215061192846, "phrase": "business_intelligence"}, {"score": 0.00481495049065317, "phrase": "increasing_popularity"}, {"score": 0.004673530058379246, "phrase": "exponential_growth"}, {"score": 0.004328576620172571, "phrase": "useful_information"}, {"score": 0.003991932110277654, "phrase": "gold_mine"}, {"score": 0.0039077616208517026, "phrase": "great_opportunities"}, {"score": 0.003858110309630846, "phrase": "academic_research_and_business_applications"}, {"score": 0.003634587156159668, "phrase": "vast_amount"}, {"score": 0.003527712410706358, "phrase": "commonly_adopted_methodology"}, {"score": 0.003309124298009635, "phrase": "framework_fir_gathering_business_intelligence"}, {"score": 0.0031981188104809994, "phrase": "blog_contents"}, {"score": 0.00317095235382607, "phrase": "bloggers'_interaction_networks"}, {"score": 0.0029116257477000617, "phrase": "consumer_product"}, {"score": 0.0027194778713860715, "phrase": "appropriate_techniques"}, {"score": 0.0025183881730011597, "phrase": "novel_patterns"}, {"score": 0.0024863459251358217, "phrase": "blogger_interactions"}, {"score": 0.0024234763342790852, "phrase": "important_business_intelligence_questions"}, {"score": 0.002178144355363467, "phrase": "future_academic_research_and_business_applications"}], "paper_keywords": ["Business intelligence", " Web mining", " blog mining", " social networks", " design science"], "paper_abstract": "The increasing popularity of Web 2.0 has led to exponential growth of user-generated content in both volume and significance. One important type of user-generated content is the blog. Blogs encompass useful information (e.g., insightful product reviews and information-rich consumer communities) that could potentially be a gold mine for business intelligence, bringing great opportunities for both academic research and business applications. However, performing business intelligence on blogs is quite challenging because of the vast amount of information and the lack of commonly adopted methodology for effectively collecting and analyzing such information. In this paper, we propose a framework fir gathering business intelligence from blogs by automatically collecting and analyzing blog contents and bloggers' interaction networks. Through a system developed using the framework, we conducted two case studies with one case focusing on a consumer product and the other on a company. Our case studies demonstrate how to use the framework and appropriate techniques to effectively collect, extract, and analyze blogs related to the topics of interest, reveal novel patterns in the blogger interactions and communities, and answer important business intelligence questions in the domains. The framework is sufficiently generic and can be applied to any topics of interest, organizations, and products. Future academic research and business applications related to the topics examined in the two cases can also be built using the findings of this study.", "paper_title": "BUSINESS INTELLIGENCE IN BLOGS: UNDERSTANDING CONSUMER INTERACTIONS AND COMMUNITIES", "paper_id": "WOS:000311525500011"}