{"auto_keywords": [{"score": 0.04948948915272366, "phrase": "fitts'_law_coefficients"}, {"score": 0.021243332197347753, "phrase": "fitts'_law"}, {"score": 0.018499075198664432, "phrase": "delayed_feedback"}, {"score": 0.010612387000973441, "phrase": "psychomotor_delay"}, {"score": 0.005268771350348563, "phrase": "thousand_currency_sign"}, {"score": 0.0046970764288494764, "phrase": "intrinsic_property"}, {"score": 0.004658426838467567, "phrase": "human_motor_behavior"}, {"score": 0.004236074477264561, "phrase": "human_body"}, {"score": 0.00418387341007444, "phrase": "limited_capacity"}, {"score": 0.004081385289516914, "phrase": "motor_behavior"}, {"score": 0.00389994107619882, "phrase": "emergent_property"}, {"score": 0.003590383760209319, "phrase": "physiological_parameters"}, {"score": 0.0035461111918923117, "phrase": "underlying_delayed_feedback_circuit"}, {"score": 0.0033465923623290034, "phrase": "feedback_process"}, {"score": 0.0032109670662222416, "phrase": "motor_circuit_delay"}, {"score": 0.0031452231581533814, "phrase": "fitts'_law_data"}, {"score": 0.0025361866386341796, "phrase": "observed_speed-accuracy_trade-off"}, {"score": 0.0021049977753042253, "phrase": "human_movement"}], "paper_keywords": ["Fitts' law", " Psychomotor delay", " Motor performance", " Motor control", " Neurodynamics"], "paper_abstract": "An intrinsic property of human motor behavior is a trade-off between speed and accuracy. This is classically described by Fitts' law, a model derived by assuming that the human body has a limited capacity to transmit information in organizing motor behavior. However, Fitts' law can also be realized as an emergent property of movements generated by delayed feedback. In this article, we describe the relationship between the Fitts' law coefficients and the physiological parameters of the underlying delayed feedback circuit: the relaxation rate or time constant, and the psychomotor delay of the feedback process. This relationship is then used to estimate the motor circuit delay of several tasks for which Fitts' law data are available in the literature. We consistently estimate the delay to be between 0 and 112 ms. A further consequence of this model is that not all combinations of slope and Y-intercept in Fitts' law are possible when movements are generated by delayed feedback. In fact, it is only possible for an observed speed-accuracy trade-off to be generated by delayed feedback if the Fitts' law coefficients satisfy -0.482 a parts per thousand currency sign a/b a parts per thousand currency sign 3.343 [bits] where b represents the slope in bits per second and a represents the Y-intercept in seconds. If we assume human movement is generated by delayed feedback, then the Fitts' law coefficients should always be restricted to this range of values.", "paper_title": "Estimation of psychomotor delay from the Fitts' law coefficients", "paper_id": "WOS:000271442300003"}