{"auto_keywords": [{"score": 0.04532113932343013, "phrase": "research_agendas"}, {"score": 0.00481495049065317, "phrase": "information_systems"}, {"score": 0.004735254735115024, "phrase": "institutional_ecology"}, {"score": 0.004266067096140677, "phrase": "transitory_infatuations"}, {"score": 0.004143196873246147, "phrase": "it-related_innovation"}, {"score": 0.0040916230716372265, "phrase": "second_problem"}, {"score": 0.004007083686875716, "phrase": "insular_sub-communities"}, {"score": 0.00389164348807591, "phrase": "research_programs"}, {"score": 0.0038271712887391015, "phrase": "limited_theoretical_and_practical_interest"}, {"score": 0.00347657813672945, "phrase": "practical_interest"}, {"score": 0.0033482708495261864, "phrase": "seemingly_diverse_phenomena"}, {"score": 0.003265365666305185, "phrase": "common_umbrella"}, {"score": 0.00300351371036355, "phrase": "field's_research_directions"}, {"score": 0.0029291198314113608, "phrase": "market_forces"}, {"score": 0.0028209599545587745, "phrase": "larger_economy"}, {"score": 0.002627407106087633, "phrase": "particular_research_stream"}, {"score": 0.0023864566654035924, "phrase": "reflexive_inquiry"}, {"score": 0.0021049977753042253, "phrase": "industry_fashion"}], "paper_keywords": ["Information systems research", " research agenda", " ecology of markets", " institutional history", " boundary enthography", " comparative discourse analysis", " deconstruction", " reflexive inquiry"], "paper_abstract": "This essay identifies three characteristic problems in how the Information Systems field sets its research directions. First is the propensity of our field to create research agendas modeled after the transitory infatuations that industry has with certain popular topics in IT-related innovation. The second problem is our field's inclination to develop insular sub-communities that consume resources on behalf of research programs that are of limited theoretical and practical interest. A third problem is noted from time to time by our partners in industry: We sometimes neglect topics that are of practical interest to them. This paper argues that these seemingly diverse phenomena can be brought under a common umbrella by examining how the shaping of research agendas depends on forces in our field's larger institutional milieu. Specifically, we suggest that the field's research directions constitute responses to institutionally constituted market forces that arise both within academia and in the larger economy and society. Furthermore, we propose that the substance of the discourse associated with any particular research stream is dictated by the workings of these forces, in ways our community has yet to fully understand. We make four proposals for reflexive inquiry that we believe will advance this understanding and ultimately help to foster research that better serves both theory and practice, while being less subject to the whims of industry fashion.", "paper_title": "Research directions in information systems: Toward an institutional ecology", "paper_id": "WOS:000255118300001"}