{"auto_keywords": [{"score": 0.014727501008400286, "phrase": "chaos_time-series_prediction"}, {"score": 0.00481495049065317, "phrase": "chaos_time-series"}, {"score": 0.004198965651975536, "phrase": "special_cases"}, {"score": 0.00349803055484394, "phrase": "better_learning_ability"}, {"score": 0.0030655302236416502, "phrase": "cmac."}, {"score": 0.0030038988468808845, "phrase": "better_capabilities"}, {"score": 0.00248927752933113, "phrase": "lower_computational_complexity"}, {"score": 0.0024023079401125492, "phrase": "chaos_time-series_prediction_and_synchronization_applications"}, {"score": 0.0023301793939902015, "phrase": "corresponding_convergence_analyses"}, {"score": 0.0023066199295447686, "phrase": "optimal_learning_rates"}, {"score": 0.002271725588755076, "phrase": "lyapunov_stability_approach"}], "paper_keywords": ["Cerebellar model articulation controller (CMAC)", " chaos prediction", " chaos synchronization", " interval type-2 fuzzy system"], "paper_abstract": "This paper aims to propose a more efficient control algorithm for chaos time-series prediction and synchronization. A novel type-2 fuzzy cerebellar model articulation controller (T2FCMAC) is proposed. In some special cases, this T2FCMAC can be reduced to an interval type-2 fuzzy neural network, a fuzzy neural network, and a fuzzy cerebellar model articulation controller (CMAC). So, this T2FCMAC is a more generalized network with better learning ability, thus, it is used for the chaos time-series prediction and synchronization. Moreover, this T2FCMAC realizes the un-normalized interval type-2 fuzzy logic system based on the structure of the CMAC. It can provide better capabilities for handling uncertainty and more design degree of freedom than traditional type-1 fuzzy CMAC. Unlike most of the interval type-2 fuzzy system, the type-reduction of T2FCMAC is bypassed due to the property of un-normalized interval type-2 fuzzy logic system. This causes T2FCMAC to have lower computational complexity and is more practical. For chaos time-series prediction and synchronization applications, the training architectures with corresponding convergence analyses and optimal learning rates based on Lyapunov stability approach are introduced. Finally, two illustrated examples are presented to demonstrate the performance of the proposed T2FCMAC.", "paper_title": "An Efficient Interval Type-2 Fuzzy CMAC for Chaos Time-Series Prediction and Synchronization", "paper_id": "WOS:000331906100003"}