{"auto_keywords": [{"score": 0.03687030932660685, "phrase": "co-link_data"}, {"score": 0.015505893263073018, "phrase": "web_co-link_data"}, {"score": 0.01501804323888077, "phrase": "chinese_market"}, {"score": 0.01327398621346468, "phrase": "business_competitive_positions"}, {"score": 0.012449924643536545, "phrase": "business_websites"}, {"score": 0.00481495049065317, "phrase": "business_competition_positions"}, {"score": 0.004451546786101008, "phrase": "earlier_studies"}, {"score": 0.004270347498153512, "phrase": "useful_business_information"}, {"score": 0.0035994372026264478, "phrase": "similar_or_related_businesses"}, {"score": 0.00314795900369497, "phrase": "mds"}, {"score": 0.002991823455621222, "phrase": "telecommunications_industry_sectors"}, {"score": 0.0027528751037412128, "phrase": "web_data_mining"}, {"score": 0.0025802660239538353, "phrase": "global_market"}, {"score": 0.0024522530645471065, "phrase": "competitive_positions"}, {"score": 0.0023305762840188145, "phrase": "regular_data_collection"}, {"score": 0.0021945194903838132, "phrase": "business_competitive_environment"}, {"score": 0.002164264600379492, "phrase": "early_warnings"}, {"score": 0.0021049977753042253, "phrase": "competitive_landscape"}], "paper_keywords": [""], "paper_abstract": "Based on the findings from earlier studies which showed that links to business Websites contain useful business information, we examined the feasibility of using Web co-link data to compare business competitive positions. We hypothesized that the number of co-links to a pair of business Websites is a measure of the similarity between the two companies. Since similar or related businesses are competing businesses, the co-link data can be used to map business competitive positions. We selected 32 telecommunications companies for the study and collected co-link data to these companies from Yahoo!. Multidimensional scaling (MDS) analysis on the co-link data correctly mapped these companies into telecommunications industry sectors. This proved our hypothesis and further confirmed the theory that links to business Websites can be objects for Web data mining. We collected data in a way that would reflect two markets, the global market and the Chinese market. Results from the two data sets revealed the competitive positions of the companies in the two markets. We propose that regular data collection and analysis based on this method can be used to monitor the business competitive environment and trigger early warnings on the change of the competitive landscape.", "paper_title": "Comparing business competition positions based on Web co-link data: The global market vs. the Chinese market", "paper_id": "WOS:000239300600019"}