{"auto_keywords": [{"score": 0.004676345706416371, "phrase": "verifiable_settings"}, {"score": 0.004637478829869904, "phrase": "mechanism_design"}, {"score": 0.004503959683578956, "phrase": "fair_allocations"}, {"score": 0.004466519142879166, "phrase": "indivisible_goods"}, {"score": 0.004429388453288922, "phrase": "monetary_compensation"}, {"score": 0.004301834610818624, "phrase": "agents'_declarations"}, {"score": 0.004266067096140677, "phrase": "allocated_goods"}, {"score": 0.003685972800046028, "phrase": "incorrect_declared_values"}, {"score": 0.0036097844103129043, "phrase": "manipulation_attempts"}, {"score": 0.003197843245296877, "phrase": "agents'_utilities"}, {"score": 0.0031186510842824626, "phrase": "shapley_value"}, {"score": 0.003092690568543981, "phrase": "suitable_coalitional_games"}, {"score": 0.0030414140732789186, "phrase": "highly_desirable_properties"}, {"score": 0.00300351371036355, "phrase": "equal_treatment"}, {"score": 0.002627407106087633, "phrase": "maximum_possible_one"}, {"score": 0.002594652434287807, "phrase": "alternative_optimal_allocation"}, {"score": 0.0025623050508233078, "phrase": "computational_complexity"}, {"score": 0.002530359917257626, "phrase": "proposed_mechanism"}, {"score": 0.0021049977753042253, "phrase": "high_probability"}], "paper_keywords": [""], "paper_abstract": "Mechanism design is considered in the context of fair allocations of indivisible goods with monetary compensation, by focusing on problems where agents' declarations on allocated goods can be verified before payments are performed. A setting is considered where verification might be subject to errors, so that payments have to be awarded under the presumption of innocence, as incorrect declared values do not necessarily mean manipulation attempts by the agents. Within this setting, a mechanism is designed that is shown to be truthful, efficient, and budget-balanced. Moreover, agents' utilities are fairly determined by the Shapley value of suitable coalitional games, and enjoy highly desirable properties such as equal treatment of equals, envy-freeness, and a stronger one called individual-optimality. In particular, the latter property guarantees that, for every agent, her/his utility is the maximum possible one over any alternative optimal allocation. The computational complexity of the proposed mechanism is also studied. It turns out that it is #P-complete so that, to deal with applications with many agents involved, two polynomial-time randomized variants are also proposed: one that is still truthful and efficient, and which is approximately budget-balanced with high probability, and another one that is truthful in expectation, while still budget-balanced and efficient.", "paper_title": "Mechanisms for Fair Allocation Problems: No-Punishment Payment Rules in Verifiable Settings", "paper_id": "WOS:000333553800001"}