{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "facebook_places"}, {"score": 0.004469400468609653, "phrase": "theoretically_grounded_model"}, {"score": 0.004104621766670225, "phrase": "store_atmosphere_factors"}, {"score": 0.0035740424892197155, "phrase": "structural_equation"}, {"score": 0.0034987163424726546, "phrase": "research_hypotheses"}, {"score": 0.0033054920459613018, "phrase": "self-expression_influence"}, {"score": 0.003224336566887827, "phrase": "design_factors"}, {"score": 0.0029714355089328123, "phrase": "facebook"}, {"score": 0.002950374774004939, "phrase": "store_owners"}, {"score": 0.0029294877178473017, "phrase": "effective_marketing_strategies"}, {"score": 0.002767613012044169, "phrase": "free_word"}, {"score": 0.002748016244165687, "phrase": "mouth_advertising"}, {"score": 0.0025961429982767257, "phrase": "particular_location"}, {"score": 0.002559501330352064, "phrase": "important_way"}, {"score": 0.0024789326485851666, "phrase": "gratification_theory"}, {"score": 0.0024180213826477093, "phrase": "mass_media"}, {"score": 0.002308834230545883, "phrase": "social_networking_sites"}, {"score": 0.002204566591599102, "phrase": "store_atmosphere_elements"}, {"score": 0.0021503823972534096, "phrase": "appropriate_concept"}, {"score": 0.0021049977753042253, "phrase": "facebook_check-in_service"}], "paper_keywords": ["Location-based services", " Facebook Places", " Store atmosphere", " Uses and gratifications theory"], "paper_abstract": "Purpose - The purpose of this paper is to derive and empirically test a theoretically grounded model of motivations (socializing, entertainment, self-expression, and information seeking) that lead to the use of Facebook Places. Store atmosphere factors (ambient, design, and social factors) were also investigated as moderators of the relationship between the motivation and use of Facebook Places. Design/methodology/approach - Based on a survey of 504 South Korean Facebook users, this research applies a structural equation modeling approach to test the research hypotheses. Findings - The analysis revealed that motivations such as socializing, entertainment, and self-expression influence the use of Facebook Places, and design factors moderate the relationship between the motivations and the use of Facebook Places. Practical implications - This study provide insights that can help Facebook and store owners develop effective marketing strategies that could increase revenue. When users check-in at a location it creates free word of mouth advertising. Thus, identifying the factors that motivate users to check-in at a particular location will be an important way to advertise. Originality/value - While uses and gratification theory has mainly been used to study mass media, this study applied the theory to Facebook Places, a type of social networking sites-based location-based services. Additionally, this study added store atmosphere elements as moderators, which is an appropriate concept in the context of the Facebook check-in service.", "paper_title": "Motivations of Facebook Places and store atmosphere as moderator", "paper_id": "WOS:000345148100003"}