{"auto_keywords": [{"score": 0.04577680896363523, "phrase": "takagi-sugeno"}, {"score": 0.00481495049065317, "phrase": "online_takagi-sugeno_fuzzy_models"}, {"score": 0.004579780586951551, "phrase": "novel_online_self-organized_clustering_method"}, {"score": 0.0043560464825349275, "phrase": "fuzzy_models"}, {"score": 0.0040916230716372265, "phrase": "automatic_decision_algorithm"}, {"score": 0.003542557455905503, "phrase": "competitive_recursive_least_squares"}, {"score": 0.0032858981413454802, "phrase": "initial_as_well_as_long-term_learning_capabilities"}, {"score": 0.003125175084962886, "phrase": "online_learning"}, {"score": 0.0026384167183586015, "phrase": "parameter_free_method"}, {"score": 0.002447101794397243, "phrase": "highly_accurate_and_low_time-consuming_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online learning", " Self-organized clustering", " Takagi-Sugeno fuzzy model", " RLS", " CCL", " Incremental distance"], "paper_abstract": "In this paper we introduce a novel online self-organized clustering method based on the ART-2A network for Takagi-Sugeno fuzzy models. To accomplish the self-organization, we introduce an automatic decision algorithm along with solutions for merging and splitting of rules as well as the parameters they operate with, such as our novel incremental distance measurement and competitive recursive least squares. We emphasize the learning algorithm's having an impact for initial as well as long-term learning capabilities. We also emphasize the challenge for online learning, where examples are incoming in real-time and thus are unknown before they can be learned. Therefore, we solve parameter fixing by introducing a parameter free method. We show the performance of our method on various machine learning benchmarks as a highly accurate and low time-consuming method capable of adapting to different databases without the need for fixing any of its parameters according to the database. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "SO-ARTIST: Self-Organized ART-2A inspired clustering for online Takagi-Sugeno fuzzy models", "paper_id": "WOS:000352955600011"}