{"auto_keywords": [{"score": 0.04862079694002717, "phrase": "sales_configurators"}, {"score": 0.015719716506582538, "phrase": "product_variety_paradox"}, {"score": 0.004546174820239776, "phrase": "potential_customers"}, {"score": 0.0044272138900038095, "phrase": "company's_product_offer"}, {"score": 0.00436890075128947, "phrase": "product_solution"}, {"score": 0.003759142310009214, "phrase": "relatively_few_studies"}, {"score": 0.00342568771304873, "phrase": "empirical_investigation"}, {"score": 0.003163439005885435, "phrase": "psychometrically_sound_measurement_items"}, {"score": 0.003013129637451091, "phrase": "five_capabilities"}, {"score": 0.002436289099444074, "phrase": "parsimonious_measurement_instrument"}, {"score": 0.002404136142279618, "phrase": "theory_testing"}, {"score": 0.002279702500235741, "phrase": "useful_diagnostic_and_benchmarking_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Product configuration", " Software capabilities", " Measurement development", " Mass customization"], "paper_abstract": "Sales configurators are applications designed to support potential customers in choosing, within a company's product offer, the product solution that best fits their needs. These applications can help firms avoid the risk that offering more product variety and customization in an attempt to increase sales, paradoxically results in a loss of sales. Relatively few studies, however, have focused on the characteristics sales configurators should have so as to avoid this paradox. Furthermore, empirical investigation on the effectiveness of the recommendations made by these studies has been hindered by the lack of psychometrically sound measurement items and scales. This paper conceptualizes, develops and validates five capabilities that sales configurators should deploy in order to avoid the product variety paradox: namely, focused navigation, flexible navigation, easy comparison, benefit-cost communication, and user-friendly product-space description capabilities. It is hoped that this study will provide a parsimonious measurement instrument to advance theory testing in the field. Moreover, this instrument may be a useful diagnostic and benchmarking tool for companies seeking to assess and/or improve sales configurators they use or develop. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Sales configurator capabilities to avoid the product variety paradox: Construct development and validation", "paper_id": "WOS:000318465100008"}