{"auto_keywords": [{"score": 0.04367532292334258, "phrase": "multiple-attribute_group-decision-making_problems"}, {"score": 0.03571602158223337, "phrase": "expected_decision_matrix"}, {"score": 0.00481495049065317, "phrase": "different_formats"}, {"score": 0.004777917315737992, "phrase": "preference_information"}, {"score": 0.004704699244406775, "phrase": "interval_utility_values"}, {"score": 0.004668510065740584, "phrase": "interval_fuzzy_preference_relations"}, {"score": 0.004614745158543967, "phrase": "interval_multiplicative_preference_relations"}, {"score": 0.003702702337768558, "phrase": "fuzzy_preference_relations"}, {"score": 0.0036178264212372497, "phrase": "multiplicative_preference_relations"}, {"score": 0.0034806529881619454, "phrase": "uncertain_decision_matrix"}, {"score": 0.0033228699494959172, "phrase": "goal-programming_model"}, {"score": 0.0031356295480964927, "phrase": "overall_attribute_values"}, {"score": 0.002993439939273828, "phrase": "derived_overall_attribute_values"}, {"score": 0.0026965813247045427, "phrase": "objective_information"}, {"score": 0.0025842289219860795, "phrase": "subjective_decision_information"}, {"score": 0.0025347150832077175, "phrase": "information_integration"}, {"score": 0.0021213575697367148, "phrase": "developed_models"}], "paper_keywords": ["goal-programming model", " interval fuzzy preference relation", " interval multiplicative preference relation", " interval utility value", " multiple-attribute group decision making"], "paper_abstract": "Interval utility values, interval fuzzy preference relations, and interval multiplicative preference relations are three common uncertain-preference formats used by decision-makers to provide their preference information in the process of decision making under fuzziness. This paper is devoted in investigating multiple-attribute group-decision-making problems where the attribute values are not precisely known but the value ranges can be obtained, and the decision-makers provide their preference information over attributes by three different uncertain-preference formats i.e., 1) interval utility values; 2) interval fuzzy preference relations; and 3) interval multiplicative preference relations. We first utilize some functions to normalize the uncertain decision matrix and then transform it into an expected decision matrix. We establish a goal-programming model to integrate the expected decision matrix and all three different uncertain-preference formats from which the attribute weights and the overall attribute values of alternatives can be obtained. Then, we use the derived overall attribute values to get the ranking of the given alternatives and to select the best one(s). The model not only can reflect both the subjective considerations of all decision-makers and the objective information but also can avoid losing and distorting the given objective and subjective decision information in the process of information integration. Furthermore, we establish some models to solve the multiple-attribute group-decision-making problems with three different preference formats: 1) utility values; 2) fuzzy preference relations; and 3) multiplicative preference relations. Finally, we illustrate the applicability and effectiveness of the developed models with two practical examples.", "paper_title": "Multiple-attribute group decision making with different formats of preference information on attributes", "paper_id": "WOS:000251110300006"}