{"auto_keywords": [{"score": 0.045920579453929744, "phrase": "energy_consumption"}, {"score": 0.02322730111336098, "phrase": "multiple_line_buffers"}, {"score": 0.004713379149462482, "phrase": "modern_microprocessors"}, {"score": 0.004638602678192715, "phrase": "large_portion"}, {"score": 0.004565007074039171, "phrase": "chip_area"}, {"score": 0.0035527409334589317, "phrase": "novel_cache_architecture"}, {"score": 0.0035150223642728437, "phrase": "reduced_energy_instruction_caches"}, {"score": 0.003314591878914152, "phrase": "prediction_mechanism"}, {"score": 0.0030758904011907533, "phrase": "proposed_technique"}, {"score": 0.002931569771634119, "phrase": "continuous_small_filter_cache"}, {"score": 0.0025243592424524764, "phrase": "proposed_architecture"}, {"score": 0.002431699464104896, "phrase": "hotspot_cache"}, {"score": 0.002405853977978678, "phrase": "filter_cache"}, {"score": 0.0023802825369325354, "phrase": "single_line_buffer_cache"}, {"score": 0.0021620042653528846, "phrase": "considerably_less_energy"}, {"score": 0.0021049977753042253, "phrase": "cache_architectures"}], "paper_keywords": [""], "paper_abstract": "Modern microprocessors dedicate a large portion of the chip area to the cache. Decreasing the energy consumption of the microprocessor, which is a very important design goal especially for small, battery powered, devices, depends on decreasing the energy consumption of the memory/cache system in the microprocessor. The authors investigate the energy consumption in caches and present a novel cache architecture for reduced energy instruction caches. Our cache architecture consists of the L1 cache, multiple line buffers and a prediction mechanism to predict which line buffer, or L1 cache, to access next. In the proposed technique, the authors use the multiple line buffers as a continuous small filter cache that can catch most of the cache access but they access only a single line buffer, thus reducing the energy consumption of the cache. They used simulation to evaluate the proposed architecture and to compare it with the HotSpot cache, filter cache and single line buffer cache. Simulation results show that the approach is slightly faster than the above mentioned caches, and it consumes considerably less energy than any of these cache architectures.", "paper_title": "Energy efficient i-cache using multiple line buffers with prediction", "paper_id": "WOS:000259155700004"}