{"auto_keywords": [{"score": 0.049106469259210465, "phrase": "outdoor_scenes"}, {"score": 0.00481495049065317, "phrase": "high-level_understanding"}, {"score": 0.004574085781766281, "phrase": "dynamic_visual_world"}, {"score": 0.004085579055228594, "phrase": "\"transient_scene_attributes"}, {"score": 0.003921129887153952, "phrase": "scene_appearance"}, {"score": 0.0032256881625734777, "phrase": "\"transient_attribute_database"}, {"score": 0.0030171910207671205, "phrase": "novel_images"}, {"score": 0.002940626369102927, "phrase": "photo_organization_method"}, {"score": 0.002895620643297197, "phrase": "predicted_attributes"}, {"score": 0.0028076592725295646, "phrase": "high-level_image_editing_method"}, {"score": 0.002357249810661667, "phrase": "novel_appearance_transfer_technique"}], "paper_keywords": ["image database", " attribute-based image editing"], "paper_abstract": "We live in a dynamic visual world where the appearance of scenes changes dramatically from hour to hour or season to season. In this work we study \"transient scene attributes\" - high level properties which affect scene appearance, such as \"snow\", \"autumn\", \"dusk\", \"fog\". We define 40 transient attributes and use crowd-sourcing to annotate thousands of images from 101 webcams. We use this \"transient attribute database\" to train regressors that can predict the presence of attributes in novel images. We demonstrate a photo organization method based on predicted attributes. Finally we propose a high-level image editing method which allows a user to adjust the attributes of a scene, e.g. change a scene to be \"snowy\" or \"sunset\". To support attribute manipulation we introduce a novel appearance transfer technique which is simple and fast yet competitive with the state-of-the-art. We show that we can convincingly modify many transient attributes in outdoor scenes.", "paper_title": "Transient Attributes for High-Level Understanding and Editing of Outdoor Scenes", "paper_id": "WOS:000340000100116"}