{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "alveolar_bone_area"}, {"score": 0.007680571042998089, "phrase": "implant_treatment"}, {"score": 0.007621112784710374, "phrase": "prosthetic_dentistry"}, {"score": 0.0066774665964962, "phrase": "alveolar_bone"}, {"score": 0.005759584142313105, "phrase": "similar_density"}, {"score": 0.004523714526776837, "phrase": "segmented_region"}, {"score": 0.004436545340717729, "phrase": "bone_density"}, {"score": 0.004384960761826366, "phrase": "upper_and_lower_jaws"}, {"score": 0.0037662852047763112, "phrase": "nonprofessional_person"}, {"score": 0.0035108659422301985, "phrase": "intuitive_texture_mapping_method"}, {"score": 0.0032855095476183372, "phrase": "treatment_process"}, {"score": 0.003234615195382533, "phrase": "textured_image"}, {"score": 0.002968424524565369, "phrase": "corresponding_parts"}, {"score": 0.0026095369186867707, "phrase": "texture_patterns"}, {"score": 0.0025095811903520274, "phrase": "graph-cut_algorithm"}, {"score": 0.0024514505056251316, "phrase": "smooth_texture_mapping"}, {"score": 0.0023391880766516285, "phrase": "applied_texture"}, {"score": 0.0022672107906933714, "phrase": "bone_structure"}, {"score": 0.002154930852763048, "phrase": "dental_implants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bone density", " Dental implants", " Graph-cut algorithm", " Prosthetic dentistry", " Texture mapping"], "paper_abstract": "Treatment using implants is frequently employed in prosthetic dentistry. In this method, determining the bone density of the upper and lower jaws is important. Generally, a dentist can recognize the condition of the alveolar bone to be manipulated using a cone-beam computed tomography (CBCT) image. However, communicating the data to the patient is a challenge because it is difficult for the nonprofessional person to interpret the image, which contains a distribution of pixels with similar density. We present an intuitive texture mapping method of the alveolar bone area for application in implant treatment. Our method aims to help patients better understand the treatment process by using a textured image that includes several different texture patterns that reflect the density of the alveolar bone area. We segment the area in accordance with the density of corresponding parts in the alveolar bone and the gingiva. By simplifying the boundary of each segmented region, the distribution of pixels with similar density on the alveolar bone area can be easily recognized. Next, the texture patterns for several segmented regions are mapped onto the alveolar bone area using the graph-cut algorithm, which is used for smooth texture mapping at the boundary of the segmented region. The result is an applied texture on the alveolar bone area that corresponds to the bone structure. Our method is helpful for facilitating communication and understanding of treatment using dental implants. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Multiple texture mapping of alveolar bone area for implant treatment in prosthetic dentistry", "paper_id": "WOS:000348265400009"}