{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "query-term_quality"}, {"score": 0.0464180267105254, "phrase": "query_terms"}, {"score": 0.011724892160985927, "phrase": "user_preference"}, {"score": 0.004258995791471342, "phrase": "information_seekers"}, {"score": 0.0041677440361312604, "phrase": "cognitive_efficiency"}, {"score": 0.003948043391567917, "phrase": "interactive_information-seeking_process"}, {"score": 0.003794297119656863, "phrase": "cognitive_science"}, {"score": 0.0034293295415901807, "phrase": "human_indexer"}, {"score": 0.00333163309034114, "phrase": "twenty-four_participants"}, {"score": 0.0032957163929772716, "phrase": "merged_list"}, {"score": 0.0032134045046357876, "phrase": "carefully_created_set"}, {"score": 0.003011033940247791, "phrase": "displayed_list"}, {"score": 0.002872827714395808, "phrase": "human-constructed_set"}, {"score": 0.0027409477035216195, "phrase": "automatically_identified_terms"}, {"score": 0.0026628098176168682, "phrase": "strong_preference"}, {"score": 0.00260566789186855, "phrase": "information_access"}, {"score": 0.002577557228072987, "phrase": "primary_contributions"}, {"score": 0.0023462618437394616, "phrase": "replicable_procedure"}, {"score": 0.0022629214153694504, "phrase": "different_methods"}, {"score": 0.0021202820950055193, "phrase": "best_choice"}, {"score": 0.0021049977753042253, "phrase": "real-world_information-access_systems"}], "paper_keywords": [""], "paper_abstract": "The goal of this research is to understand what characteristics, if any, lead users engaged in interactive information seeking to prefer certain sets of query terms. Underlying this work is the assumption that query terms that information seekers prefer induce a kind of cognitive efficiency: They require less mental effort to process and therefore reduce the energy required in the interactive information-seeking process. Conceptually, this work applies insights from linguistics and cognitive science to the study of query-term quality. We report on an experiment in which we compare user preference for three sets of terms; one had been preconstructed by a human indexer, and two were identified automatically. Twenty-four participants used a merged list of all terms to answer a carefully created set of questions. By design, the interface constrained users to access the text exclusively via the displayed list of query terms. We found that participants displayed a preference for the human-constructed set of terms eight times greater than the preference for either set of automatically identified terms. We speculate about reasons for this strong preference and discuss the implications for information access. The primary contributions of this research are (a) explication of the concept of user preference as a measure of query-term quality and (b) identification of a replicable procedure for measuring preference for sets of query terms created by different methods, whether human or automatic. All other factors being equal, query terms that users prefer clearly are the best choice for real-world information-access systems.", "paper_title": "User preference: A measure of query-term quality", "paper_id": "WOS:000241688800001"}