{"auto_keywords": [{"score": 0.033420854256989645, "phrase": "crf"}, {"score": 0.010612335465601353, "phrase": "conditional_random_fields"}, {"score": 0.004824070031679056, "phrase": "me."}, {"score": 0.004625255533545965, "phrase": "web_pages"}, {"score": 0.004502943680955863, "phrase": "blocks'_importance"}, {"score": 0.003868257410961701, "phrase": "leaf_nodes"}, {"score": 0.00361737580940505, "phrase": "bip"}, {"score": 0.003397866151093552, "phrase": "single_sequence"}, {"score": 0.0033525843225012918, "phrase": "whole_tree"}, {"score": 0.0033079039414389833, "phrase": "related_sub-blocks"}, {"score": 0.0030520148188164084, "phrase": "crf's_transition"}, {"score": 0.0030248298759040695, "phrase": "model_correlations"}, {"score": 0.0029978863469038914, "phrase": "neighboring_labels"}, {"score": 0.0027907771648224273, "phrase": "global_optimal_solution"}, {"score": 0.0027535633837592597, "phrase": "whole_sequence"}, {"score": 0.002364865100579589, "phrase": "crf-based_system"}, {"score": 0.002271476019266231, "phrase": "training_data"}, {"score": 0.002241171326888997, "phrase": "completely_novel_sites"}], "paper_keywords": [""], "paper_abstract": "We have developed a system that segments web pages into blocks and predicts those blocks' importance (block importance prediction or BIP). First, we use VIPS to partition a page into a tree composed of blocks and then extracts features from each block and labels all leaf nodes. This paper makes two main contributions. Firstly, we are pioneering the formulation of BIP as a sequence tagging task. We employ DFS, which outputs a single sequence for the whole tree in which related sub-blocks are adjacent. Our second contribution is using the conditional random fields (CRF) model for labeling these sequences. CRF's transition features model correlations between neighboring labels well, and CRF can simultaneously label all blocks in a sequence to find the global optimal solution for the whole sequence, not only the best solution for each block. In our experiments, our CRF-based system achieves an F1-measure of 97.41%, which significantly outperforms our ME-based baseline (95.64%). Lastly, we tested the CRF-based system using sites which were not covered in the training data. On completely novel sites CRF performed slightly worse than ME. However, when given only two training pages from a given site, CRF improved almost three times as much as ME.", "paper_title": "Visual Webpage Block Importance Prediction Using Conditional Random Fields", "paper_id": "WOS:000296453900011"}