{"auto_keywords": [{"score": 0.03600704009648377, "phrase": "implicit_equation"}, {"score": 0.00481495049065317, "phrase": "computing_discriminants"}, {"score": 0.004523865550323285, "phrase": "sparse_elimination_theory"}, {"score": 0.004333973355873714, "phrase": "implicit_support"}, {"score": 0.004152018764100109, "phrase": "numeric_matrix"}, {"score": 0.004040211152784802, "phrase": "polynomial_and_rational_parameterizations"}, {"score": 0.0038106195546165574, "phrase": "base_points"}, {"score": 0.0032727116186194584, "phrase": "nullspace_dimension"}, {"score": 0.003234615195382533, "phrase": "predicted_support"}, {"score": 0.0029800360974218836, "phrase": "multivariate_polynomial_gcd"}, {"score": 0.002810520668490478, "phrase": "approximate_computation"}, {"score": 0.0027347383772384102, "phrase": "sparse_approximate_implicitization"}, {"score": 0.0026609940110902666, "phrase": "larger_problems"}, {"score": 0.002519402443228795, "phrase": "bicubic_surface"}, {"score": 0.0024803459795996116, "phrase": "novel_application"}, {"score": 0.002385326947545194, "phrase": "multivariate_polynomial"}, {"score": 0.0023209828061385596, "phrase": "multiple_roots"}, {"score": 0.0022583704173318123, "phrase": "polynomial_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Geometric representation", " Implicitization", " Linear algebra", " Sparse polynomial", " Discriminant"], "paper_abstract": "We revisit implicitization by interpolation in order to examine its properties in the context of sparse elimination theory. Based on the computation of a superset of the implicit support, implicitization is reduced to computing the nullspace of a numeric matrix. The approach is applicable to polynomial and rational parameterizations of curves and (hyper)surfaces of any dimension, including the case of parameterizations with base points. Our support prediction is based on sparse (or toric) resultant theory, in order to exploit the sparsity of the input and the output. Our method may yield a multiple of the implicit equation: we characterize and quantify this situation by relating the nullspace dimension to the predicted support and its geometry. In this case, we obtain more than one multiple of the implicit equation; the latter can be obtained via multivariate polynomial GCD (or factoring). All of the above techniques extend to the case of approximate computation, thus yielding a method of sparse approximate implicitization, which is important in tackling larger problems. We discuss our publicly available Maple implementation through several examples, including the benchmark of a bicubic surface. For a novel application, we focus on computing the discriminant of a multivariate polynomial, which characterizes the existence of multiple roots and generalizes the resultant of a polynomial system. This yields an efficient, output-sensitive algorithm for computing the discriminant polynomial. (C) 2012 Published by Elsevier Ltd", "paper_title": "Sparse implicitization by interpolation: Characterizing non-exactness and an application to computing discriminants", "paper_id": "WOS:000311972700016"}