{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "truss_structures"}, {"score": 0.049100450513748305, "phrase": "adaptive_multi-island_search_strategy"}, {"score": 0.004556901872357751, "phrase": "genetic_algorithm"}, {"score": 0.003757480190200645, "phrase": "non-dominated_front"}, {"score": 0.0036052633308076933, "phrase": "multi-objective_topology"}, {"score": 0.0033190180867511605, "phrase": "multi-objective_optimization_problem"}, {"score": 0.0029722900280316216, "phrase": "elitist_strategy"}, {"score": 0.0029114187110123105, "phrase": "archive_set"}, {"score": 0.002643386043540555, "phrase": "computation_efficiency"}, {"score": 0.002467140591777737, "phrase": "amiss-mop._results"}, {"score": 0.0023999697562763433, "phrase": "global_pareto_front"}, {"score": 0.0022092084106039834, "phrase": "generation_increases"}, {"score": 0.0021049977753042253, "phrase": "non-dominated_sorting"}], "paper_keywords": ["Multi-objective", " Genetic algorithm", " Truss", " Topology optimization", " Sizing optimization"], "paper_abstract": "This paper uses genetic algorithm to handle the topology and sizing optimization of truss structures, in which a sparse node matrix encoding approach is used and individual identification technique is employed to avoid duplicate structural analysis to save computation time. It is observed that NSGA-II could not improve the convergence of non-dominated front at latter generations when solving multi-objective topology and sizing optimization of truss structures. Therefore, an adaptive multi-island search strategy for multi-objective optimization problem (AMISS-MOP) is developed to enhance the convergence. Meanwhile, an elitist strategy based on archive set is introduced to reduce the size of non-dominated sorting to improve computation efficiency. Two numeric examples are presented to demonstrate the performance of AMISS-MOP. Results show that the global Pareto front could be found by AMISS-MOP, the convergence is improved as generation increases, and the time spent on non-dominated sorting is reduced.", "paper_title": "Multi-objective topology and sizing optimization of truss structures based on adaptive multi-island search strategy", "paper_id": "WOS:000287865600010"}