{"auto_keywords": [{"score": 0.03370968316969063, "phrase": "intervention_patients"}, {"score": 0.01512581445950995, "phrase": "consultants'_medical_recommendations"}, {"score": 0.013884015921245581, "phrase": "electronic_recommendations"}, {"score": 0.00481495049065317, "phrase": "computerized_provider_order_entry"}, {"score": 0.004671342094877447, "phrase": "referring_physicians'_implementation"}, {"score": 0.0043213410601860985, "phrase": "referring_providers"}, {"score": 0.0038447018470115146, "phrase": "geriatrics_consultants"}, {"score": 0.0037786899855446, "phrase": "pre-post_evaluation"}, {"score": 0.0032896745636186824, "phrase": "study_patients"}, {"score": 0.0030960762496815737, "phrase": "surveyed_hospitalists"}, {"score": 0.0025474814283429213, "phrase": "intervention_recommendations"}, {"score": 0.002188784900536406, "phrase": "consultant_recommendations"}, {"score": 0.0021049977753042253, "phrase": "electronic_facilitation"}], "paper_keywords": [""], "paper_abstract": "Objectives: Only half of consultants' medical recommendations are implemented. We created a tool that lets referring providers review and implement electronic recommendations made by consultants, with the hypothesis that facilitation with our tool could improve implementation. Measurements: The tool was piloted among geriatrics consultants and hospitalists. Pre-post evaluation was done with control (before pilot; N = 20) and intervention (after pilot; N = 20) patients. Consultants wrote notes containing recommendations for all study patients, and entered electronic recommendations only for intervention patients. We analyzed all recommendations and surveyed hospitalists. Results: A total of 249 recommendations were made for intervention patients versus 192 for controls (p < 0.05). Of all recommendations about intervention patients, 78% were implemented, compared to 59% for controls (p = 0.01). Of the intervention recommendations, 77% were entered electronically using our tool; of these, 86% were implemented. All 24 survey respondents indicated that the system improved quality, saved time, and should be expanded. Conclusion: Consultant recommendations were implemented 30% more often when there was electronic facilitation of recommendations.", "paper_title": "Using Computerized Provider Order Entry and Clinical Decision Support to Improve Referring Physicians' Implementation of Consultants' Medical Recommendations", "paper_id": "WOS:000264499500008"}