{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "generalized_spatio-temporal_role-based_access_control_model"}, {"score": 0.0043506951029334984, "phrase": "spatio-temporal_information"}, {"score": 0.004220314322073171, "phrase": "better_functionality"}, {"score": 0.004114641015648682, "phrase": "sophisticated_authorization_models"}, {"score": 0.003551694229680741, "phrase": "traditional_access_control_models"}, {"score": 0.0034803228231621687, "phrase": "role-based_access_control"}, {"score": 0.003410380718649286, "phrase": "spatio-temporal_access_control"}, {"score": 0.003258090521354736, "phrase": "additional_features"}, {"score": 0.0029584874121320165, "phrase": "unified_modeling_language"}, {"score": 0.002928609942884323, "phrase": "uml"}, {"score": 0.0027835848648596513, "phrase": "de_facto_specification_languages"}, {"score": 0.002672750634553146, "phrase": "numerous_features"}, {"score": 0.002618995204424126, "phrase": "subtle_ways"}, {"score": 0.00248927752933113, "phrase": "uml-based_specification_environment_tool"}, {"score": 0.0024023079401125492, "phrase": "spatio-temporal_access_control_model"}, {"score": 0.002181227522730908, "phrase": "access_control"}], "paper_keywords": ["Access control"], "paper_abstract": "With the advent of wireless and mobile devices, many new applications are being developed that make use of the spatio-temporal information of a user to provide better functionality. Such applications also necessitate sophisticated authorization models where access to a resource depends on the credentials of the user and also on the location and time of access. Consequently, researchers have extended the traditional access control models, such as role-based access control, to provide spatio-temporal access control. We improve upon these models by providing additional features that allow us to express constraints that were not possible until now. We express our model using the unified modeling language (UML) and the object constraint language that are the de facto specification languages used by the industry. Our model has numerous features that interact in subtle ways. To this end, we show how the UML-based specification environment tool can be used to analyze the spatio-temporal access control model of an application. We propose an architecture for enforcing our model and provide a protocol that demonstrates how access control can be granted and revoked in our approach. We also develop a prototype of this architecture to demonstrate the feasibility of our approach.", "paper_title": "Specification, Validation, and Enforcement of a Generalized Spatio-Temporal Role-Based Access Control Model", "paper_id": "WOS:000321641800015"}