{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "perceptual_and_conceptual_processing"}, {"score": 0.02276108500587589, "phrase": "medical_image_diagnosis"}, {"score": 0.0037188360359702182, "phrase": "verbal_protocols"}, {"score": 0.0036616109902631293, "phrase": "computational_systems"}, {"score": 0.002740885774408238, "phrase": "early_phases"}, {"score": 0.0025493457404304446, "phrase": "conceptual_activities"}, {"score": 0.0024971144603069006, "phrase": "conceptual_words"}, {"score": 0.002471400498582011, "phrase": "perceptual_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["cognitive experiment", " expertise", " protocol analysis", " medical image diagnosis"], "paper_abstract": "In this study, we selected medical image diagnosis as a task to investigate how expertise influences the relations between perceptual and conceptual processing. In an experiment, participants, namely five novices and five experts, made diagnoses on 13 CT images. We obtained two types of data concerning verbal protocols and manipulating computational systems. The segments related to perceptual and conceptual processing were extracted from these data, and the interrelations of the two components were analyzed. Consequently, we confirmed three salient features in the experts: (1) the experts verbalized more types of findings and more types of hypotheses than novices; (2) the experts generated several hypotheses in the early phases of the task; and (3) they newly verbalized many perceptual features during conceptual activities, and verbalized conceptual words during perceptual activities. These results suggest that expertise in medical image diagnosis involves not only the development of both perceptual and conceptual processing, but also the development of all ability to connect the two components. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Interactions of perceptual and conceptual processing: Expertise in medical image diagnosis", "paper_id": "WOS:000255697100005"}