{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "casam_multimedia_annotation_system"}, {"score": 0.0047306971679760175, "phrase": "cooperative_annotation"}, {"score": 0.004680851157467745, "phrase": "human_annotator"}, {"score": 0.004647911247507267, "phrase": "automated_components"}, {"score": 0.004346266306175988, "phrase": "automated_recognition"}, {"score": 0.004021267064832957, "phrase": "system's_reasoning"}, {"score": 0.003760137090849196, "phrase": "system's_work"}, {"score": 0.0036167509502276294, "phrase": "casam_system"}, {"score": 0.003478813491904962, "phrase": "current_state"}, {"score": 0.0032991276152705934, "phrase": "final_annotation"}, {"score": 0.0030093137393901355, "phrase": "human_annotator's_time"}, {"score": 0.0028437313714204087, "phrase": "higher_quality"}, {"score": 0.0024251568696803177, "phrase": "multimedia_document"}, {"score": 0.0023079225317714815, "phrase": "effective_interaction"}, {"score": 0.002196342933346204, "phrase": "media_professionals"}], "paper_keywords": ["Annotation", " Synergistic", " Collaborative", " Human", " Artificial Intelligence", " Ontology", " Video"], "paper_abstract": "The CASAM multimedia annotation system implements a model of cooperative annotation between a human annotator and automated components. The aim is that they work asynchronously but together. The system focuses upon the areas where automated recognition and reasoning are most effective and the user is able to work in the areas where their unique skills are required. The system's reasoning is influenced by the annotations provided by the user and, similarly, the user can see the system's work and modify and, implicitly, direct it. The CASAM system interacts with the user by providing a window onto the current state of annotation, and by generating requests for information which are important for the final annotation or to constrain its reasoning. The user can modify the annotation, respond to requests and also add their own annotations. The objective is that the human annotator's time is used more effectively and that the result is an annotation that is both of higher quality and produced more quickly. This can be especially important in circumstances where the annotator has a very restricted amount of time in which to annotate the document. In this paper we describe our prototype system. We expand upon the techniques used for automatically analysing the multimedia document, for reasoning over the annotations generated and for the generation of an effective interaction with the end-user. We also present the results of evaluations undertaken with media professionals in order to validate the approach and gain feedback to drive further research.", "paper_title": "CASAM: collaborative human-machine annotation of multimedia", "paper_id": "WOS:000336995900030"}