{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "radiosity-based_simulation_method"}, {"score": 0.004627244470096107, "phrase": "flat_white_diffuse_screens"}, {"score": 0.004526129302830441, "phrase": "projector-based_systems"}, {"score": 0.004407690586271672, "phrase": "virtual_reality_applications"}, {"score": 0.003826231150275071, "phrase": "radiometric_compensation_methods"}, {"score": 0.003410565849262162, "phrase": "compensation_methods"}, {"score": 0.0032774280543222843, "phrase": "radiosity-based_method"}, {"score": 0.0032342101452939977, "phrase": "light_transfer"}, {"score": 0.0032057142600527, "phrase": "immersive_environments"}, {"score": 0.002934166052954463, "phrase": "real_room"}, {"score": 0.002685558057339722, "phrase": "interreflection_compensation"}, {"score": 0.0025241429061867633, "phrase": "small_or_large_part"}, {"score": 0.0023724065150232897, "phrase": "radiometric_compensation"}, {"score": 0.0022101055924375725, "phrase": "large_part"}], "paper_keywords": ["Immersive environments", " Video projection", " Radiometric compensation", " Radiosity"], "paper_abstract": "Video projectors are designed to project onto flat white diffuse screens. Over the last few years, projector-based systems have been used, in virtual reality applications, to light non-specific environments such as the walls of a room. However, in these situations, the images seen by the user are affected by several radiometric disturbances, such as interreflection. Radiometric compensation methods have been proposed to reduce the disturbance caused by interreflection, but nothing has been proposed for evaluating the phenomenon itself and the effectiveness of compensation methods. In this paper, we propose a radiosity-based method to simulate light transfer in immersive environments, from a projector to a camera (the camera gives the image a user would see in a real room). This enables us to evaluate the disturbances resulting from interreflection. We also consider the effectiveness of interreflection compensation and study the influence of several parameters (projected image, projection onto a small or large part of the room, reflectivity of the walls). Our results show that radiometric compensation can reduce the influence of interreflection but is severely limited if we project onto a large part of the walls around the user, or if all the walls are bright.", "paper_title": "Immersive front-projection analysis using a radiosity-based simulation method", "paper_id": "WOS:000340622300003"}