{"auto_keywords": [{"score": 0.04720912624670318, "phrase": "chronic_obstructive_pulmonary_disease"}, {"score": 0.039150156501511525, "phrase": "u-health_services"}, {"score": 0.00747930216255287, "phrase": "u-health_devices"}, {"score": 0.00481495049065317, "phrase": "consumer-centered_u-health_service"}, {"score": 0.004702011439380661, "phrase": "skill"}, {"score": 0.004399525320473839, "phrase": "ubiquitous_health"}, {"score": 0.004255639740735269, "phrase": "medical_information"}, {"score": 0.004000741805312148, "phrase": "quality_healthcare"}, {"score": 0.003199687131875466, "phrase": "home_visits"}, {"score": 0.003094920033010818, "phrase": "u-health_service_system"}, {"score": 0.002787406053363446, "phrase": "different_services"}, {"score": 0.00241658945942583, "phrase": "patients'_knowledge"}, {"score": 0.0023936956017015696, "phrase": "chronic_obstructive_pulmonary_disease_self-management"}, {"score": 0.002359759876402679, "phrase": "u-health"}, {"score": 0.0022715929119140194, "phrase": "positive_attitude"}, {"score": 0.002186712881521657, "phrase": "chronic_obstructive_pulmonary_disease_patients"}, {"score": 0.0021049977753042253, "phrase": "patients'_perspective"}], "paper_keywords": ["Chronic obstructive pulmonary disease", " Telehealth", " Telemedicine", " u-Health"], "paper_abstract": "Through the use of ubiquitous health, or u-Health, services, medical information can be adapted and made accessible via computer and Internet to provide quality healthcare to anybody, any place, and any time. We developed and implemented u-Health services for patients with chronic obstructive pulmonary disease and studied their experiences with respect to their knowledge of chronic obstructive pulmonary disease and skill and attitude toward the u-Health devices. The u-Health services were composed of telemonitoring and teleconsultation supplemented with home visits. To determine its effectiveness, the u-Health service system was implemented for 2 years with 144 chronic obstructive pulmonary disease patients in a clinical experiment. The subjects were divided into three experimental groups, each provided with different services, compared before and after intervention, and among groups. The analysis of data gathered through the system suggested that u-Health services can support patients with chronic obstructive pulmonary disease, improve patients' knowledge about chronic obstructive pulmonary disease self-management, build u-Health device usage skills, and foster a positive attitude toward u-Health devices. The u-Health services for the chronic obstructive pulmonary disease patients were both feasible and effective from the patients' perspective.", "paper_title": "Effects of Consumer-Centered u-Health Service for the Knowledge, Skill, and Attitude of the Patients With Chronic Obstructive Pulmonary Disease", "paper_id": "WOS:000312797600006"}