{"auto_keywords": [{"score": 0.04327396735579452, "phrase": "antivirus_software"}, {"score": 0.007152368807539886, "phrase": "antivirus_software_shield"}, {"score": 0.006809889865885421, "phrase": "malware_writers"}, {"score": 0.004767826806287385, "phrase": "antivirus_terminators"}, {"score": 0.00462919213721188, "phrase": "arms_race"}, {"score": 0.004539005582217309, "phrase": "antivirus_programmers"}, {"score": 0.004342430078306461, "phrase": "simplest_way"}, {"score": 0.004278807087784626, "phrase": "computer_user"}, {"score": 0.004064556535109654, "phrase": "anss"}, {"score": 0.00376488621224566, "phrase": "important_part"}, {"score": 0.0027605398374811667, "phrase": "antivirus_software_users"}, {"score": 0.002706659627293686, "phrase": "system_service_descriptor_table"}, {"score": 0.0026148807877309417, "phrase": "specific_windows_apis"}, {"score": 0.0025262061502713683, "phrase": "hazardous_api_calls"}, {"score": 0.0023346234464901978, "phrase": "antivirus_applications"}], "paper_keywords": ["Antivirus software", " API hooking", " malware"], "paper_abstract": "In the last several decades, the arms race between malware writers and antivirus programmers has become more and more severe. The simplest way for a computer user to secure his computer is to install antivirus software on his computer. As antivirus software becomes more sophisticated and powerful, evading the detection of antivirus software becomes an important part of malware. As a result, malware writers have developed various approaches to increase the survivability and concealment of their malware. One of these technologies is to terminate antivirus software right after the execution of the malware. In this paper, we propose a mechanism, called ANtivirus Software Shield (ANSS), to prevent antivirus software from being terminated without the consciousness of the antivirus software users. ANSS uses System Service Descriptor Table (SSDT) hooking to intercept specific Windows APIs and analyzes them to filter out hazardous API calls that will terminate antivirus software. When using several pieces of malware that can terminate various brands of antivirus applications to make our experiments, the results show that ANSS can protect antivirus software from being terminated by them with at most 0.42% CPU performance overhead and 1.77% memory write performance overhead.", "paper_title": "Antivirus Software Shield Against Antivirus Terminators", "paper_id": "WOS:000308711100003"}