{"auto_keywords": [{"score": 0.0047472380621488616, "phrase": "data_group"}, {"score": 0.004258644418211771, "phrase": "greatest_degree"}, {"score": 0.003802135020791801, "phrase": "gene_expression_profiles"}, {"score": 0.003766369160795001, "phrase": "general_biomedical_data"}, {"score": 0.003626626504149897, "phrase": "common_context"}, {"score": 0.0033943947596098583, "phrase": "gene_expression_data_classification"}, {"score": 0.003132236287543072, "phrase": "particular_pathological_process"}, {"score": 0.0030590445140753187, "phrase": "new_depth_function"}, {"score": 0.00297346171320082, "phrase": "central_units"}, {"score": 0.002616943519478975, "phrase": "multivariate_data"}, {"score": 0.002358220053411644, "phrase": "noncontinuous_data"}, {"score": 0.0022385926290967263, "phrase": "artificial_examples"}, {"score": 0.00218623706110975, "phrase": "empirical_data"}, {"score": 0.002125020720324262, "phrase": "good_performance"}], "paper_keywords": ["Cluster analysis", " kernel", " data depth", " depth function", " central unit", " geometric variability", " proximity function", " gene expression data"], "paper_abstract": "This paper presents a solution to the problem of how to identify the units in groups or clusters that have the greatest degree of centrality and best characterize each group. This problem frequently arises in the classification of data such as types of tumor, gene expression profiles or general biomedical data. It is particularly important in the common context that many units do not properly belong to any cluster. Furthermore, in gene expression data classification, good identification of the most central units in a cluster enables recognition of the most important samples in a particular pathological process. We propose a new depth function that allows us to identify central units. As our approach is based on a measure of distance or dissimilarity between any pair of units, it can be applied to any kind of multivariate data (continuous, binary or multiattribute data). Therefore, it is very valuable in many biomedical applications, which usually involve noncontinuous data, such as clinical, pathological, or biological data sources. We validate the approach using artificial examples and apply it to empirical data. The results show the good performance of our statistical approach.", "paper_title": "The Depth Problem: Identifying the Most Representative Units in a Data Group", "paper_id": "WOS:000319477300015"}