{"auto_keywords": [{"score": 0.048564928403357514, "phrase": "new_users"}, {"score": 0.00632939010820245, "phrase": "latent_group_structure"}, {"score": 0.005055642237051252, "phrase": "new_documents"}, {"score": 0.00481495049065317, "phrase": "user_preference_prediction"}, {"score": 0.004577869668211548, "phrase": "collaborative_filtering"}, {"score": 0.004392565073466714, "phrase": "user_groups"}, {"score": 0.004157058883925715, "phrase": "relatively_new_document"}, {"score": 0.0035722806911457545, "phrase": "two-way_generalization"}, {"score": 0.0032886455096627324, "phrase": "two-way_grouping"}, {"score": 0.0032436052954996097, "phrase": "artificial_data"}, {"score": 0.0031699005399973496, "phrase": "real_data"}, {"score": 0.003083655376444887, "phrase": "probabilistic_latent_grouping_model"}, {"score": 0.0026986685585382347, "phrase": "state-of-the-art_method"}, {"score": 0.0026616868981501006, "phrase": "user_rating_profile"}, {"score": 0.0024389277933858054, "phrase": "gibbs_sampling"}, {"score": 0.002405496949144104, "phrase": "two-way_model"}], "paper_keywords": ["Collaborative filtering", " Gibbs sampling", " Graphical model", " Latent topic model"], "paper_abstract": "We tackle the problem of new users or documents in collaborative filtering. Generalization over users by grouping them into user groups is beneficial when a rating is to be predicted for a relatively new document having only few observed ratings. Analogously, generalization over documents improves predictions in the case of new users. We show that if either users and documents or both are new, two-way generalization becomes necessary. We demonstrate the benefits of grouping of users, grouping of documents, and two-way grouping, with artificial data and in two case studies with real data. We have introduced a probabilistic latent grouping model for predicting the relevance of a document to a user. The model assumes a latent group structure for both users and items. We compare the model against a state-of-the-art method, the User Rating Profile model, where only the users have a latent group structure. We compute the posterior of both models by Gibbs sampling. The Two-Way Model predicts relevance more accurately when the target consists of both new documents and new users. The reason is that generalization over documents becomes beneficial for new documents and at the same time generalization over users is needed for new users.", "paper_title": "Latent grouping models for user preference prediction", "paper_id": "WOS:000262125400004"}