{"auto_keywords": [{"score": 0.04028465982960715, "phrase": "trial_vector_generation_strategies"}, {"score": 0.00481495049065317, "phrase": "strategy_adaptation"}, {"score": 0.00476323161560059, "phrase": "global_numerical_optimization"}, {"score": 0.004712065638657606, "phrase": "differential_evolution"}, {"score": 0.004561826854638056, "phrase": "efficient_and_powerful_population-based_stochastic_search_technique"}, {"score": 0.003964007795174772, "phrase": "specific_problem"}, {"score": 0.0037150687722055727, "phrase": "trial-and-error_scheme"}, {"score": 0.0035386420095120706, "phrase": "high_computational_costs"}, {"score": 0.0034442607586033657, "phrase": "different_stages"}, {"score": 0.003370565320453525, "phrase": "different_strategies"}, {"score": 0.0033163269450817716, "phrase": "different_parameter_settings"}, {"score": 0.003158776195052182, "phrase": "best_performance"}, {"score": 0.002714779217561487, "phrase": "promising_solutions"}, {"score": 0.0025031188149336257, "phrase": "different_phases"}, {"score": 0.0023841092222805253, "phrase": "sade_algorithm"}, {"score": 0.002270745003370529, "phrase": "p._n._suganthan"}, {"score": 0.002127915423138391, "phrase": "conventional_de"}], "paper_keywords": ["Differential evolution (DE)", " global numerical optimization", " parameter adaptation", " self-adaptation", " strategy adaptation"], "paper_abstract": "Differential evolution (DE) is an efficient and powerful population-based stochastic search technique for solving optimization problems over continuous space, which has been widely applied in many scientific and engineering fields. However, the success of DE in solving a specific problem crucially depends on appropriately choosing trial vector generation strategies and their associated control parameter values. Employing a trial-and-error scheme to search for the most suitable strategy and its associated parameter settings requires high computational costs. Moreover, at different stages of evolution, different strategies coupled with different parameter settings may be required in order to achieve the best performance. In this paper, we propose a self-adaptive DE (SaDE) algorithm, in which both trial vector generation strategies and their associated control parameter values are gradually self-adapted by learning from their previous experiences in generating promising solutions. Consequently, a more suitable generation strategy along with its parameter settings can be determined adaptively to match different phases of the search process/evolution. The performance of the SaDE algorithm is extensively evaluated (using codes available from P. N. Suganthan) on a suite of 26 bound-constrained numerical optimization problems and compares favorably with the conventional DE and several state-of-the-art parameter adaptive DE variants.", "paper_title": "Differential Evolution Algorithm With Strategy Adaptation for Global Numerical Optimization", "paper_id": "WOS:000265091900012"}