{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "thin-client_diagram_editing_tools"}, {"score": 0.00458488025289647, "phrase": "software_design_tools"}, {"score": 0.004529093447865156, "phrase": "project_planning_tools"}, {"score": 0.004473982381245469, "phrase": "business_process_modelling_tools"}, {"score": 0.004392565073466714, "phrase": "'thick-client'_applications"}, {"score": 0.004312622975366676, "phrase": "stand-alone_desktop_applications"}, {"score": 0.0035668128900149814, "phrase": "collaborative_work_support"}, {"score": 0.0035233696341819437, "phrase": "web-based_integration"}, {"score": 0.0030414140732789186, "phrase": "plug-in_extensions"}, {"score": 0.002949598537993663, "phrase": "visual_design_environment_development"}, {"score": 0.0028084079003212947, "phrase": "key_user_interaction"}, {"score": 0.0027741761880779535, "phrase": "software_architecture_issues"}, {"score": 0.0023798115577749225, "phrase": "resultant_applications"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["thin-client diagramming", " software architecture", " Web and mobile user interfaces", " CASE tools"], "paper_abstract": "Diagram-centric applications such as software design tools, project planning tools and business process modelling tools are usually 'thick-client' applications running as stand-alone desktop applications. There are several advantages to providing such design tools as Web-based or even PDA- and mobile-phonebased applications. These include ease of access and upgrade, provision of collaborative work support and Web-based integration with other applications. However, building such thin-client diagram editing tools is very challenging. We have developed several thin-client diagram editing applications realized as a set of plug-in extensions to a meta-tool for visual design environment development. In this paper, we discuss key user interaction and software architecture issues, illustrate examples of interacting with our thin-client diagram editing tools, describe our design and implementation approaches, and present the results of several different evaluations of the resultant applications. Our experiences will be useful for those interested in developing their own thin-client diagram editing architectures and applications. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "Experiences developing architectures for realizing thin-client diagram editing tools", "paper_id": "WOS:000250419600002"}