{"auto_keywords": [{"score": 0.0497584468847577, "phrase": "precision_viticulture"}, {"score": 0.00481495049065317, "phrase": "remote_sensing_applications"}, {"score": 0.004655924035639928, "phrase": "long-term_effort"}, {"score": 0.0045324756541157574, "phrase": "demarcated_region_of_douro"}, {"score": 0.00398916666053909, "phrase": "surrounding_environment"}, {"score": 0.0038186039088445524, "phrase": "general-purpose_wireless_acquisition_device"}, {"score": 0.0037549546301384336, "phrase": "large_coverage_areas"}, {"score": 0.0034755154823256588, "phrase": "mesh-type_array"}, {"score": 0.0033045378860812403, "phrase": "overall_architecture"}, {"score": 0.003227643104496149, "phrase": "monitoring_system"}, {"score": 0.0030380052848799155, "phrase": "energy_issues"}, {"score": 0.0029873281676201565, "phrase": "self-sustained_operation"}, {"score": 0.002811770047652563, "phrase": "power_management_and_networking_solutions"}, {"score": 0.0025935941070969575, "phrase": "hardware_and_software_solutions"}, {"score": 0.002541741549046619, "phrase": "good_performance"}, {"score": 0.0024576084154573396, "phrase": "simple_and_compact_yet_powerful_building_block"}, {"score": 0.00232090909020124, "phrase": "drd_region"}, {"score": 0.0022290085428279846, "phrase": "wireless_sensors"}, {"score": 0.0021263705039915198, "phrase": "powdery_mildew_prediction_models"}], "paper_keywords": ["ZigBee", " wireless sensor network", " viticulture", " acquisition device", " remote sensing", " energy harvesting"], "paper_abstract": "This paper is part of a long-term effort to introduce precision viticulture in the region of Demarcated Region of Douro. It presents the architecture, hardware and software of a platform designed for that purpose, called MPWiNodeZ. A major feature of this platform is its power-management subsystem, able to recharge batteries with energy harvested from the surrounding environment from up to three sources. It allows the system to sustain operation as a general-purpose wireless acquisition device for remote sensing in large coverage areas, where the power to run the devices is always a concern. The MPWiNodeZ, as a ZigBee (TM) network element, provides a mesh-type array of acquisition devices ready for deployment in vineyards. In addition to describing the overall architecture, hardware and software of the monitoring system, the paper also reports on the performance of the module in the field, emphasising the energy issues, crucial to obtain self-sustained operation. The testing was done in two stages: the first in the laboratory, to validate the power management and networking solutions under particularly severe conditions, the second stage in a vineyard. The measurements about the behaviour of the system confirm that the hardware and software solutions proposed do indeed lead to good performance. The platform is currently being used as a simple and compact yet powerful building block for generic remote sensing applications, with characteristics that are well suited to precision viticulture in the DRD region. It is planned to be used as a network of wireless sensors on the canopy of vines, to assist in the development of grapevine powdery mildew prediction models. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A ZigBee multi-powered wireless acquisition device for remote sensing applications in precision viticulture", "paper_id": "WOS:000255330000002"}