{"auto_keywords": [{"score": 0.04876612507369841, "phrase": "perceived_usefulness"}, {"score": 0.03105568637405199, "phrase": "individual_absorptive_capacity"}, {"score": 0.011035217910709218, "phrase": "decision_quality"}, {"score": 0.007236412661509524, "phrase": "mobile_delivery_system"}, {"score": 0.0070944555526759, "phrase": "udss"}, {"score": 0.0054173797479163364, "phrase": "research_model"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_decision_support_systems"}, {"score": 0.004645860180714466, "phrase": "purpose_-_the_purpose"}, {"score": 0.004447201233380302, "phrase": "working_ubiquitous_decision_support_system"}, {"score": 0.004091130285858113, "phrase": "udss."}, {"score": 0.003573859492987647, "phrase": "delivery_workers"}, {"score": 0.003517458289610994, "phrase": "financial_incentive"}, {"score": 0.0033005860945173136, "phrase": "partial_least_square_method"}, {"score": 0.003036040409062437, "phrase": "ubiquitous_mobility"}, {"score": 0.0030119758165837625, "phrase": "context_awareness"}, {"score": 0.002917604283241353, "phrase": "positive_effects"}, {"score": 0.0025892330566358503, "phrase": "relevant_antecedents"}, {"score": 0.0024006068621542642, "phrase": "users'_decision_quality"}, {"score": 0.002270449532546444, "phrase": "working_udss"}, {"score": 0.002164505365535068, "phrase": "mediating_effects"}, {"score": 0.002130298466581199, "phrase": "absorptive_capacity"}, {"score": 0.0021049977753042253, "phrase": "ubiquitous_environment"}], "paper_keywords": ["UDSS MDS", " Ubiquitous mobility", " Context awareness", " Absorptive capacity", " Perceived usefulness", " Decision quality", " Decision support systems", " Information systems"], "paper_abstract": "Purpose - The purpose of this study is to examine a mobile delivery system as a working ubiquitous decision support system (UDSS) and determine whether it would improve decision quality. Design/methodology/approach - Ubiquitous mobility and context awareness are the two core functions of the UDSS. Hence the authors examined how they might influence individual absorptive capacity and perceived usefulness. Moreover the authors investigated how individual absorptive capacity and perceived usefulness might be related to decision quality. A total of 174 completed questionnaires were collected from delivery workers, and a financial incentive was provided to participants. To test the hypotheses the research model was analysed with the partial least square method. Findings - The results reveal that all paths are statistically valid. Individual absorptive capacity and perceived usefulness were positively influenced by ubiquitous mobility and context awareness. In addition individual absorptive capacity and perceived usefulness have positive effects on decision quality. Research limitations/implications - This research model did not consider all the capabilities enabled by the UDSS. Future study should pay attention to nomadicity, proactiveness, invisibility, and portability as relevant antecedents within the model. Originality/value - In the field of IS studies the impact of the UDSS on users' decision quality has remained unclear to date. The authors adopted a mobile delivery system as a working UDSS and applied it in their study. Thereby the authors found the mediating effects of perceived usefulness and absorptive capacity under a ubiquitous environment.", "paper_title": "The impact of ubiquitous decision support systems on decision quality through individual absorptive capacity and perceived usefulness", "paper_id": "WOS:000317635000007"}