{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "image_segmentation"}, {"score": 0.009941789262838863, "phrase": "search_space"}, {"score": 0.00481495049065317, "phrase": "aggregation_pheromone_density"}, {"score": 0.003995772867224968, "phrase": "closer_proximity"}, {"score": 0.003813669883040509, "phrase": "novel_method"}, {"score": 0.0037336520904376687, "phrase": "aggregation_behavior"}, {"score": 0.003593812067062062, "phrase": "clustering_problem"}, {"score": 0.003301461490509176, "phrase": "data_point"}, {"score": 0.0029565620771207003, "phrase": "higher_pheromone_density"}, {"score": 0.002762423953243486, "phrase": "different_positions"}, {"score": 0.002505412457777352, "phrase": "homogenous_groups"}, {"score": 0.0024527767211457046, "phrase": "proposed_algorithm"}, {"score": 0.002380934815435267, "phrase": "different_types"}, {"score": 0.002215081186105616, "phrase": "clustering_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Aggregation pheromone", " Ant colony optimization", " Clustering", " Image segmentation"], "paper_abstract": "Ants, bees and other social insects deposit pheromone (a type of chemical) in order to communicate between the members of their community. Pheromone that causes clumping or clustering behavior in a species and brings individuals into a closer proximity, is called aggregation pheromone. This paper presents a novel method for image segmentation considering the aggregation behavior of ants. Image segmentation is viewed as a clustering problem which aims to partition a given set of pixels into a number of homogenous clusters/segments. At each location of a data point, representing a pixel, an ant is placed; and the ants are allowed to move in the search space to find out positions with higher pheromone density. The movement of an ant is governed by the amount of pheromone deposited at different positions of the search space. More the deposited pheromone, more is the aggregation of ants. This leads to the formation of homogenous groups of data. The proposed algorithm is evaluated on a number of different types of images using various cluster validity measures. Results are compared with those obtained using k-means and mean shift clustering algorithms and are found to be superior. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Use of aggregation pheromone density for image segmentation", "paper_id": "WOS:000267729200010"}