{"auto_keywords": [{"score": 0.03571085515932043, "phrase": "best_position"}, {"score": 0.015230671633392702, "phrase": "gsa"}, {"score": 0.007748581539147357, "phrase": "proposed_algorithm"}, {"score": 0.00419861271409079, "phrase": "cognitive_discrete_gsa"}, {"score": 0.004141476915000558, "phrase": "cdgsa"}, {"score": 0.0037798652680135106, "phrase": "best_particles"}, {"score": 0.0032358709481309913, "phrase": "social_component"}, {"score": 0.003021392767766593, "phrase": "current_time"}, {"score": 0.0028082176224611542, "phrase": "cognitive_component"}, {"score": 0.0027197343489967322, "phrase": "intelligent_agents"}, {"score": 0.0025862736445290088, "phrase": "right_direction"}, {"score": 0.0024593458703463474, "phrase": "discrete_version"}, {"score": 0.002234031373581961, "phrase": "high_dimensional_problems"}, {"score": 0.0021537217025910356, "phrase": "better_accuracy"}], "paper_keywords": ["Cognitive component", " discrete gravitational search algorithm (DGSA)", " knapsack problem", " social component"], "paper_abstract": "The Gravitational Search Algorithm (GSA) has been proposed for solving continues problems based on the law of gravity. In this paper, we propose a Cognitive Discrete GSA (called CDGSA) for solving 0-1 knapsack problem. The GSA has used a function of time to determine the number of the best particles for attracting others in each time, while our main idea is based on attracting each particle with two cognitive and social components. The cognitive component contains the best position of the particles up to now, while the social component contains the particle with the best position in the whole of the system at the current time and the particles with the best position in the neighborhood. In the other words, the cognitive component is such an appropriate actuator for embedding in the intelligent agents like robots. Such intelligent agent or robot is guided in the right direction with the help of its best previous position. Finally, by introducing discrete version of this idea, the efficiency of the proposed algorithm is measured for 0-1 knapsack problem. Experimental results on some benchmark and high dimensional problems illustrate that the proposed algorithm has gained the better accuracy in comparison of the other similar methods.", "paper_title": "Cognitive discrete gravitational search algorithm for solving 0-1 knapsack problem", "paper_id": "WOS:000365138800050"}