{"auto_keywords": [{"score": 0.028143527725570737, "phrase": "adepts"}, {"score": 0.00481495049065317, "phrase": "interacting_services"}, {"score": 0.004777569299319633, "phrase": "large_scale_distributed_systems"}, {"score": 0.004685375117376838, "phrase": "different_services"}, {"score": 0.004266907250334316, "phrase": "natural_failures"}, {"score": 0.004233762728640565, "phrase": "malicious_activity"}, {"score": 0.004200874581076468, "phrase": "collectively_called_disruptions"}, {"score": 0.0036221822903900725, "phrase": "partial_functionality"}, {"score": 0.00277778944472107, "phrase": "concurrent_alarms"}, {"score": 0.002549096826249, "phrase": "directed_graph_representation"}, {"score": 0.0023946630984825207, "phrase": "appropriate_responses"}, {"score": 0.0022760856906838814, "phrase": "high_level_survivability_metric"}, {"score": 0.0022146817879683204, "phrase": "real_e-commerce_testbed"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["automated adaptive intrusion response", " intrusion containment", " e-commerce system", " survivability", " attack graphs"], "paper_abstract": "Large scale distributed systems typically have interactions among different services that create an avenue for propagation of a failure from one service to another. The failures being considered may be the result of natural failures or malicious activity, collectively called disruptions. To make these systems tolerant to failures it is necessary to contain the spread of the occurrence automatically once it is detected. The objective is to allow certain parts of the system to continue to provide partial functionality in the system in the face of failures. Real world situations impose several constraints on the design of such a disruption tolerant system of which we consider the following - the alarms may have type I or type 11 errors; it may not be possible to change the service itself even though the interaction may be changed; attacks may use steps that are not anticipated a priori; and there may be bursts of concurrent alarms. We present the design and implementation of a system named ADEPTS as the realization of such a disruption tolerant system. ADEPTS uses a directed graph representation to model the spread of the failure through the system, presents algorithms for determining appropriate responses and monitoring their effectiveness, and quantifies the effect of disruptions through a high level survivability metric. ADEPTS is demonstrated on a real e-commerce testbed with actual attack patterns injected into it. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Automated adaptive intrusion containment in systems of interacting services", "paper_id": "WOS:000244378800008"}