{"auto_keywords": [{"score": 0.049239058804488534, "phrase": "electronic_health_record"}, {"score": 0.030162973691103215, "phrase": "different_units"}, {"score": 0.00481495049065317, "phrase": "exam_room_use"}, {"score": 0.004329630571352367, "phrase": "patient_visits"}, {"score": 0.004278807087784626, "phrase": "clinical_workflow"}, {"score": 0.004178935413340453, "phrase": "patient-centered_care"}, {"score": 0.003584025547693836, "phrase": "ambulatory_care"}, {"score": 0.0033190180867511605, "phrase": "clinical_work"}, {"score": 0.0030195184114140063, "phrase": "associated_barriers"}, {"score": 0.0029142971957107013, "phrase": "ehr"}, {"score": 0.002426137929553724, "phrase": "ehr_use"}, {"score": 0.0021940118003312397, "phrase": "next_generation"}, {"score": 0.002130090974856205, "phrase": "va"}], "paper_keywords": [""], "paper_abstract": "Challenges persist on how to effectively integrate the electronic health record (EHR) into patient visits and clinical workflow, while maintaining patient-centered care. Our goal was to identify variations in, barriers to, and facilitators of the use of the US Department of Veterans Affairs (VA) EHR in ambulatory care workflow in order better to understand how to integrate the EHR into clinical work. We observed and interviewed 20 ambulatory care providers across three geographically distinct VA medical centers. Analysis revealed several variations in, associated barriers to, and facilitators of EHR use corresponding to different units of analysis: computer interface, team coordination/workflow, and organizational. We discuss our findings in the context of different units of analysis and connect variations in EHR use to various barriers and facilitators. Findings from this study may help inform the design of the next generation of EHRs for the VA and other healthcare systems.", "paper_title": "You and me and the computer makes three: variations in exam room use of the electronic health record", "paper_id": "WOS:000337672800023"}