{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "metabolic_stories"}, {"score": 0.04877417505503999, "phrase": "yeast_response"}, {"score": 0.048517200000440824, "phrase": "cadmium_exposure"}, {"score": 0.004722715450671519, "phrase": "case_study"}, {"score": 0.004593993534002452, "phrase": "increasing_availability"}, {"score": 0.004568671314041992, "phrase": "metabolomics_data"}, {"score": 0.004431862492928335, "phrase": "immediate_response"}, {"score": 0.004371032439709459, "phrase": "environmental_changes"}, {"score": 0.003754363606242612, "phrase": "metabolomics_experiment"}, {"score": 0.0036620541482722804, "phrase": "possible_scenario"}, {"score": 0.0034745384103495457, "phrase": "different_ways"}, {"score": 0.0033797211728461584, "phrase": "causal_link"}, {"score": 0.0032512939985881784, "phrase": "concentration_changes"}, {"score": 0.003197753852980665, "phrase": "equally_probable_stories"}, {"score": 0.003171314262220951, "phrase": "selected_ranking_scheme"}, {"score": 0.0031104662578334435, "phrase": "single_anthology"}, {"score": 0.0030592380520393985, "phrase": "unique_subnetwork"}, {"score": 0.002591026181144371, "phrase": "current_knowledge"}, {"score": 0.0024718711048717676, "phrase": "enzyme_activation"}, {"score": 0.0024043497996540653, "phrase": "alternative_pathways"}, {"score": 0.002391067964886602, "phrase": "side_effects"}, {"score": 0.002377859325230963, "phrase": "local_response"}, {"score": 0.0021462188078498817, "phrase": "simple_input_data"}, {"score": 0.0021049977753042253, "phrase": "wide_variety"}], "paper_keywords": [""], "paper_abstract": "Motivation: The increasing availability of metabolomics data enables to better understand the metabolic processes involved in the immediate response of an organism to environmental changes and stress. The data usually come in the form of a list of metabolites whose concentrations significantly changed under some conditions, and are thus not easy to interpret without being able to precisely visualize how such metabolites are interconnected. Results: We present a method that enables to organize the data from any metabolomics experiment into metabolic stories. Each story corresponds to a possible scenario explaining the flow of matter between the metabolites of interest. These scenarios may then be ranked in different ways depending on which interpretation one wishes to emphasize for the causal link between two affected metabolites: enzyme activation, enzyme inhibition or domino effect on the concentration changes of substrates and products. Equally probable stories under any selected ranking scheme can be further grouped into a single anthology that summarizes, in a unique subnetwork, all equivalently plausible alternative stories. An anthology is simply a union of such stories. We detail an application of the method to the response of yeast to cadmium exposure. We use this system as a proof of concept for our method, and we show that we are able to find a story that reproduces very well the current knowledge about the yeast response to cadmium. We further show that this response is mostly based on enzyme activation. We also provide a framework for exploring the alternative pathways or side effects this local response is expected to have in the rest of the network. We discuss several interpretations for the changes we see, and we suggest hypotheses that could in principle be experimentally tested. Noticeably, our method requires simple input data and could be used in a wide variety of applications.", "paper_title": "Telling metabolic stories to explore metabolomics data: a case study on the yeast response to cadmium exposure", "paper_id": "WOS:000329059700009"}