{"auto_keywords": [{"score": 0.045704752704274834, "phrase": "tm"}, {"score": 0.01379279048269363, "phrase": "time_intervals"}, {"score": 0.004868641273544298, "phrase": "video_training"}, {"score": 0.004777802032505079, "phrase": "two-dimensional_space"}, {"score": 0.0047409388179452255, "phrase": "empirical_study"}, {"score": 0.004668059458774745, "phrase": "linear_model"}, {"score": 0.004188198923320451, "phrase": "empirical_studies"}, {"score": 0.0041805992498499525, "phrase": "lm"}, {"score": 0.004105661429332238, "phrase": "null_hypothesis"}, {"score": 0.003855849747095327, "phrase": "traditional_lm._method"}, {"score": 0.0036427316134070007, "phrase": "basic_knowledge"}, {"score": 0.003623949225126944, "phrase": "temporal_relations"}, {"score": 0.003390971669017869, "phrase": "large_number"}, {"score": 0.0033796335027364245, "phrase": "participants'_accuracy"}, {"score": 0.0031032109441552287, "phrase": "equal_results"}, {"score": 0.002740885774408238, "phrase": "larger_number"}, {"score": 0.0024906610581090223, "phrase": "novice_participants"}, {"score": 0.0024333239726872604, "phrase": "satisfactory_result"}, {"score": 0.0023773036888252463, "phrase": "visual_queries"}, {"score": 0.0022053994402287925, "phrase": "linear_data"}, {"score": 0.002137947680862631, "phrase": "novice_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Temporal reasoning", " Time intervals", " Information visualisation", " Temporal information", " Empirical study"], "paper_abstract": "Objective:. Instead of the linear model (LM), time intervals can be represented by a two-dimensional (2D) model, which is called the triangular model (TM). Although the TM has been introduced for decades and applied in some areas, there still a lack of empirical studies on its usability. To fill this gap, this study aims to evaluate how people perform when using the TM to answer questions on time intervals, in comparison with using the traditional LM. Method: Around 250 novice participants took part in the experiment which consisted of a video training, a pretest and posttest The video training introduced the basic knowledge of temporal relations and the two representations. The pretest allowed participants to practice the knowledge they have learned and receive feedbacks of the answers. In the posttest, participants' accuracy and speed when answering the questions were recorded for analysis. The results of using the TM and the LM were compared in pairs. The null hypothesis is that the participants produce equal results with the two models. Result: The results showed that the participants scored better and spent less time when answering questions with the TM, which rejected the null hypothesis. Moreover, the score and speed when they used the TM did decline in the questions containing a larger number of intervals. In contrast the score and accuracy when they used the LM declined when questions containing a large number of intervals. Conclusion: The TM is easy to learn. After a 20-min training, novice participants can use it to solve questions and produce satisfactory result. The TM is easy and efficient for visual queries of time intervals. The TM is easy to use for handling a large number of intervals. Implication: The TM can be widely applied in analysing time intervals and linear data. Tools implementing the TM can be learned and used by novice users. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Representing time intervals in a two-dimensional space: An empirical study", "paper_id": "WOS:000338482400014"}