{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "asp."}, {"score": 0.03171924895092047, "phrase": "conditional_preferences"}, {"score": 0.00481495049065317, "phrase": "resource_consumption"}, {"score": 0.004509694461067052, "phrase": "resourced_asp"}, {"score": 0.004419703921314433, "phrase": "short_rasp"}, {"score": 0.003876806615011266, "phrase": "available_resources"}, {"score": 0.003704797078215222, "phrase": "remaining_amount"}, {"score": 0.003522579870903474, "phrase": "different_way"}, {"score": 0.002952356518921907, "phrase": "different_forms"}, {"score": 0.0025892330566358503, "phrase": "specific_answer"}, {"score": 0.002282166507956957, "phrase": "new_features"}, {"score": 0.0022478501955483007, "phrase": "syntactic_sugar"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Answer set programming", " Quantitative reasoning", " Preferences", " Non-monotonic logic programming", " Language extensions"], "paper_abstract": "In this paper, we extend our previous work on Resourced ASP, or for short RASP, where we have introduced the possibility of defining and using resources in ASP. In RASP, one can define resources with their amounts, Where available resources can be used for producing other resources and the remaining amount, if any, can be used in a different way. In this paper, we introduce P-RASP (RASP with Preferences) where it is possible to express preferences about which resources should be either consumed or produced. Moreover, conditional preferences, of different forms, allow one to express preferences according to certain conditions, that are to be evaluated \"dynamically\", namely, with respect to the specific answer set at hand. The semantic of conditional preferences is given in terms of (non-conditional) preferences, though the translation is not straightforward and thus the new features are not syntactic sugar. Complexity of P-RASP is also discussed. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Modeling preferences and conditional preferences on resource consumption and production in ASP", "paper_id": "WOS:000266983400002"}