{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_gaming_systems"}, {"score": 0.015596689970222035, "phrase": "cloud_gaming"}, {"score": 0.009642547884394377, "phrase": "measurement_techniques"}, {"score": 0.004590820632326585, "phrase": "thin_clients"}, {"score": 0.00435971969507033, "phrase": "incompatibility_issues"}, {"score": 0.004123781267600542, "phrase": "great_deal"}, {"score": 0.003823791479971016, "phrase": "large_design_space"}, {"score": 0.0037188360359702182, "phrase": "best_user-perceived_quality_of_service"}, {"score": 0.0036023971109946946, "phrase": "good_cloud_gaming_system"}, {"score": 0.0033803056981691866, "phrase": "current_cloud_gaming_systems"}, {"score": 0.003248483521309273, "phrase": "gaming_systems"}, {"score": 0.0030724971661718983, "phrase": "research_community"}, {"score": 0.0027704982687041147, "phrase": "case_study"}, {"score": 0.0026518169452004465, "phrase": "onlive"}, {"score": 0.002578946584040053, "phrase": "adaptable_frame_rates"}, {"score": 0.0022524395393089544, "phrase": "service_providers"}, {"score": 0.0021049977753042253, "phrase": "proposed_suite"}], "paper_keywords": ["Cloud gaming", " live video streaming", " measurement", " performance evaluation", " remote rendering"], "paper_abstract": "Cloud gaming, i.e., real-time game playing via thin clients, relieves users from being forced to upgrade their computers and resolve the incompatibility issues between games and computers. As a result, cloud gaming is generating a great deal of interests among entrepreneurs, venture capitalists, general publics, and researchers. However, given the large design space, it is not yet known which cloud gaming system delivers the best user-perceived Quality of Service (QoS) and what design elements constitute a good cloud gaming system. This study is motivated by the question: How good is the QoS of current cloud gaming systems? Answering the question is challenging because most cloud gaming systems are proprietary and closed, and thus their internal mechanisms are not accessible for the research community. In this paper, we propose a suite of measurement techniques to evaluate the QoS of cloud gaming systems and prove the effectiveness of our schemes using a case study comprising two well-known cloud gaming systems: OnLive and StreamMyGame. Our results show that OnLive performs better, because it provides adaptable frame rates, better graphic quality, and shorter server processing delays, while consuming less network bandwidth. Our measurement techniques are general and can be applied to any cloud gaming systems, so that researchers, users, and service providers may systematically quantify the QoS of these systems. To the best of our knowledge, the proposed suite of measurement techniques have never been presented in the literature.", "paper_title": "On the Quality of Service of Cloud Gaming Systems", "paper_id": "WOS:000330245800016"}