{"auto_keywords": [{"score": 0.04908067956118526, "phrase": "multimedia_applications"}, {"score": 0.010523289265050985, "phrase": "trm"}, {"score": 0.00481495049065317, "phrase": "partially_reliable_transport_protocols"}, {"score": 0.004655285779819366, "phrase": "partially_reliable_transport_protocol"}, {"score": 0.003722761107761564, "phrase": "existing_approaches"}, {"score": 0.0036759314172445934, "phrase": "fixed_threshold"}, {"score": 0.0035091888798162176, "phrase": "timeliness-aware_retransmission_mechanism"}, {"score": 0.003104849179057156, "phrase": "packet_sequence_number"}, {"score": 0.003014422649429416, "phrase": "packet_consumed_rate"}, {"score": 0.0029764767329116875, "phrase": "round-trip_time"}, {"score": 0.002723862897844177, "phrase": "sequence_numbers"}, {"score": 0.002655697256976997, "phrase": "simulation_results"}, {"score": 0.00240987727827622, "phrase": "qos"}, {"score": 0.0022906498741695094, "phrase": "bandwidth_waste"}, {"score": 0.0021682027434117095, "phrase": "udrr"}], "paper_keywords": ["Timeliness-aware retransmission", " Multimedia applications", " Partial reliability"], "paper_abstract": "The partially reliable transport protocol can enhance the quality of services (QoS) of multimedia applications because it reliably transmits some packets and unreliably transmits other packets. Nevertheless, determining which packets require reliable, i.e., these packets will be retransmitted if they were lost, significantly influences the performance of multimedia applications. For the determination, existing approaches adopt a fixed threshold or require information from other layers. This paper proposes a Timeliness-aware Retransmission Mechanism (TRM) that dynamically determines which lost packets should be retransmitted without any information provided from other layers. The receiver using TRM determines a threshold, which is the packet sequence number having timeliness, according to the packet consumed rate and the Round-Trip Time (RTT). Thus the sender retransmits lost packets that can timely arrive, namely, the packets have sequence numbers larger than this threshold. Simulation results shows that PR-DCCP, a partially reliable transport protocol, with TRM can efficiently increase the Decodable Frame Ratios (DFRs), which represents QoS, and decrease the Useless Data Received Ratios (UDRRs), which represents the bandwidth waste. In the simulations, TRM can achieve 8.6 similar to 10.6% DFR improvement and 15.1% 17.6% UDRR improvement on average, compared with other retransmission methods.", "paper_title": "A Timeliness-Aware Retransmission Mechanism for Partially Reliable Transport Protocols to Enhance Performance of Multimedia Applications", "paper_id": "WOS:000329336200007"}