{"auto_keywords": [{"score": 0.03396961743706252, "phrase": "betweenness_centrality"}, {"score": 0.015719716506582538, "phrase": "delay_tolerant_networks"}, {"score": 0.013725555989383532, "phrase": "dtn_routing_protocols"}, {"score": 0.004718897469501381, "phrase": "dynamic_networks"}, {"score": 0.004147756103284082, "phrase": "store-carry-and-forward_approach"}, {"score": 0.0038263136898042285, "phrase": "best_forwarding_node"}, {"score": 0.003780286517897356, "phrase": "considerable_challenge"}, {"score": 0.003749908582313067, "phrase": "additional_network_information"}, {"score": 0.003587125711973247, "phrase": "routing_protocols"}, {"score": 0.0035439655241057207, "phrase": "troublesome_task"}, {"score": 0.003473178781851477, "phrase": "centrality_metrics"}, {"score": 0.002861402531078998, "phrase": "shortest_paths"}, {"score": 0.0025761937402886954, "phrase": "static_and_dynamic_networks"}, {"score": 0.0024842242921857705, "phrase": "standard_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Delay Tolerant Networks", " Betweenness centrality", " Centrality algorithms", " Routing"], "paper_abstract": "Dynamic networks, in particular Delay Tolerant Networks (DTNs), are characterized by a lack of end-to-end paths at any given instant. Because of that, DTN routing protocols employ a store-carry-and-forward approach, holding messages until a suitable node to forward them is found. But, the selection of the best forwarding node poses a considerable challenge. Additional network information (static or dynamic) can be leveraged to aid routing protocols in this troublesome task. One could use centrality metrics, therefore providing means to differentiate the importance of nodes in the network. Among these metrics, betweenness centrality is one of the most prominent, as it measures the degree to which a vertex is in a position of brokerage by summing up the fraction of shortest paths between other pairs of vertices passing through it. So, in this paper, betweenness centrality is surveyed, that is, its definitions and variants in static and dynamic networks are presented. Also, a survey of standard algorithms used to compute the metric (exact and approximate) is presented. Finally, a survey and a discussion on how DTN routing protocols make use of the betweenness centrality metric and algorithms to aid message forwarding is also presented. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Betweenness centrality in Delay Tolerant Networks: A survey", "paper_id": "WOS:000362304400018"}