{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "project-based_organizations"}, {"score": 0.015362008176907659, "phrase": "knowledge_networks"}, {"score": 0.009837263609819263, "phrase": "corporate_performance"}, {"score": 0.008380259821112804, "phrase": "organizational_performance"}, {"score": 0.005975897040262198, "phrase": "organizational_networks"}, {"score": 0.004499334809770281, "phrase": "interorganizational_groupings"}, {"score": 0.004240116703465252, "phrase": "theoretical_model"}, {"score": 0.00416882434439484, "phrase": "project_team"}, {"score": 0.0038789122930433305, "phrase": "knowledge_network"}, {"score": 0.003846170248920779, "phrase": "kn"}, {"score": 0.0034886660821793576, "phrase": "north_america"}, {"score": 0.0034445472801689046, "phrase": "measurement_model"}, {"score": 0.0033437537557378157, "phrase": "structural_equation_modeling"}, {"score": 0.0031912706211861324, "phrase": "positive_effects"}, {"score": 0.0030199761431186434, "phrase": "project_teams"}, {"score": 0.0026252106881752067, "phrase": "firm's_success"}, {"score": 0.00229164285862567, "phrase": "appropriate_outcomes"}, {"score": 0.0022434880661725493, "phrase": "knowledge_management_initiatives"}, {"score": 0.002168531704054597, "phrase": "starting_point"}, {"score": 0.0021049977753042253, "phrase": "inter-_and_intraorganizational_networks"}], "paper_keywords": ["Social network", " Knowledge management", " Organizational performance", " Knowledge network", " Community of practice", " Project team", " Project-based organizations", " Community of interest"], "paper_abstract": "Purpose - This study aims to empirically evaluate the impact of interorganizational groupings on corporate performance in project-based organizations. Design/methodology/approach - The study develops and tests a theoretical model whereby groupings include project team, community of practice (CoP), community of interest (Col), and knowledge network (KN). Organizational performance is supported on financial, process, internal, and cultural aspects. Based on a questionnaire, data was obtained from a sample of 142 companies in North America. The measurement model was tested and confirmed by using structural equation modeling (SEM). Findings - The results confirm the positive effects of knowledge networks and communities of interest. However, the impact of project teams turned out to be negative, and communities of practice were not shown to affect corporate performance. Additionally, the results underscore the importance of organizational networks in creating conditions favorable to a firm's success. Practical implications - It was verified that knowledge networks and communities of interest affect the measures of organizational performance, including financial, process, internal, and cultural performance. This is useful for researchers and executives looking for appropriate outcomes through the implementation of knowledge management initiatives. Furthermore, this study provides a starting point for further research on the role of inter- and intraorganizational networks in project-based organizations. Originality/value - This study claims that a key to performance for project-based organizations is development and management of organizational networks in the form of knowledge networks and communities of interest", "paper_title": "Organizational groupings and performance in project-based organizations An empirical investigation", "paper_id": "WOS:000334976300003"}