{"auto_keywords": [{"score": 0.04745804949919056, "phrase": "two-phase_morphology"}, {"score": 0.015719716506582538, "phrase": "phase_diagram"}, {"score": 0.011846022265158218, "phrase": "dissipative_particle_dynamics_simulations"}, {"score": 0.004671342094877447, "phrase": "ultrahigh_molecular_weight_polyethylene_blends"}, {"score": 0.004377806391261418, "phrase": "viscosity_reduction"}, {"score": 0.004340081802944066, "phrase": "mechanical_property_maintainence"}, {"score": 0.004247180402119585, "phrase": "normal_molecular_weight_polymer"}, {"score": 0.004084920064588169, "phrase": "ultrahigh_molecular_weight_polyethylene"}, {"score": 0.0035873546546188327, "phrase": "flory-huggins"}, {"score": 0.003480230347985338, "phrase": "optimum_nmwp"}, {"score": 0.0034353020860809404, "phrase": "corresponding_conditions"}, {"score": 0.0033762956164519286, "phrase": "melt_flowability"}, {"score": 0.0033471722682967046, "phrase": "uhmwpe"}, {"score": 0.0030560920414081645, "phrase": "flory-huggins_theory"}, {"score": 0.0029647862293448895, "phrase": "molecular_chain_length"}, {"score": 0.0029392020223716966, "phrase": "nmwp"}, {"score": 0.002766171878646582, "phrase": "homogeneous_phase"}, {"score": 0.0024393978073660757, "phrase": "metastable_region"}, {"score": 0.002236762786982225, "phrase": "metastable_state"}], "paper_keywords": ["DPD", " Metastable region", " Phase diagram", " UHMWPE"], "paper_abstract": "Numerous studies suggest that two-phase morphology and thick interface are separately beneficial to the viscosity reduction and mechanical property maintainence of the matrix when normal molecular weight polymer (NMWP) is used for modification of ultrahigh molecular weight polyethylene (UHMWPE). Nevertheless, it is very difficult to obtain a UHMWPE/NMWP blend which may demonstrate both two-phase morphology and thick interface. In this work, dissipative particle dynamics simulations and Flory-Huggins theory are applied in predicting the optimum NMWP and the corresponding conditions, wherein the melt flowability of UHMWPE can be improved while its mechanical properties can also be retained. As is indicated by dissipative particle dynamics simulations and phase diagram calculated from Flory-Huggins theory, too small Flory-Huggins interaction parameter (chi) and molecular chain length of NMWP (N (NMWP)) may lead to the formation of a homogeneous phase, whereas very large interfacial tension and thin interfaces might also appear when parameters N (NMWP) and chi are too large. When these parameters are located in the metastable region of the phase diagram, however, two-phase morphology occurs and interfaces of the blends are extremely thick. Therefore, metastable state is found to be advisable for both the viscosity reduction and mechanical property improvement of the UHMWPE/NMWP blends.", "paper_title": "Metastable region of phase diagram: optimum parameter range for processing ultrahigh molecular weight polyethylene blends", "paper_id": "WOS:000304621400024"}