{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "behavioral_adaptation"}, {"score": 0.0047409388179452255, "phrase": "major_asset"}, {"score": 0.004692227830462433, "phrase": "modern_systems"}, {"score": 0.00443308765153716, "phrase": "component_updates"}, {"score": 0.0038758293658651237, "phrase": "compatible_interfaces"}, {"score": 0.0036996627006622975, "phrase": "software_adaptation_techniques"}, {"score": 0.003441352119167824, "phrase": "software_adaptation"}, {"score": 0.003336225354214798, "phrase": "reconfiguration_capabilities"}, {"score": 0.00330189927527898, "phrase": "black-box_components"}, {"score": 0.0031032109441552287, "phrase": "structural_reconfiguration"}, {"score": 0.002769395841379498, "phrase": "second_part"}, {"score": 0.0027126684113045756, "phrase": "five_notions"}, {"score": 0.0021714122348552747, "phrase": "simple_yet_realistic_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Components", " Dynamic reconfiguration", " Behavioral adaptation"], "paper_abstract": "A major asset of modern systems is to dynamically reconfigure themselves to cope with failures or component updates. Nevertheless, designing such systems with off-the-shelf components is hardly feasible: components are black-boxes that can only interact with others on compatible interfaces. Part of the problem is solved through Software Adaptation techniques, which compensate mismatches between interfaces. Our approach aims at using results of Software Adaptation in order to also provide reconfiguration capabilities to black-box components. This paper first formalizes a framework that unifies behavioral adaptation and structural reconfiguration of components. This formalization is used for statically detecting whether it is possible to reconfigure a system. In a second part, we present five notions of reconfiguration: history-aware reconfiguration, future-aware reconfiguration, property-compliant reconfiguration, one-way reconfigurability, and full reconfigurability. For each of these notions, its relevant properties are presented, and they are illustrated on simple yet realistic examples. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Structural reconfiguration of systems under behavioral adaptation", "paper_id": "WOS:000310125400004"}