{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "instructional_explanations"}, {"score": 0.004035107125458193, "phrase": "functional_relations"}, {"score": 0.0037682108720193956, "phrase": "attention_guidance"}, {"score": 0.0036001255166809793, "phrase": "psychology_students"}, {"score": 0.0032860401904845522, "phrase": "uncued_animation"}, {"score": 0.0032302647179383915, "phrase": "cardiovascular_system"}, {"score": 0.003193606324727067, "phrase": "learner-generated_self-explanations"}, {"score": 0.0031393948330209224, "phrase": "externally_provided_instructional_explanations"}, {"score": 0.003051073364818384, "phrase": "cued_animations"}, {"score": 0.0029652292779277782, "phrase": "uncued_animations"}, {"score": 0.0025561788724870974, "phrase": "higher_inference_scores"}, {"score": 0.002241517354570928, "phrase": "focused_processing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Instructional animations", " Cueing", " Self-explanations", " Instructional explanations"], "paper_abstract": "This study investigated whether learners construct more accurate mental representations from animations when instructional explanations are provided via narration than when learners attempt to infer functional relations from the animation through self-explaining. Also effects of attention guidance by means of cueing are investigated. Psychology students were given retention, inference, and transfer tests after studying a cued or an uncued animation of the cardiovascular system with learner-generated self-explanations or with externally provided instructional explanations. Results indicated that cued animations were more effective than uncued animations. Furthermore, results on retention and transfer indicated no differences between self-explaining and providing instructional explanations, but instructional explanations accompanying animations led to higher inference scores. It is concluded that whether explanations are generated or presented may be less important than the provision of cues that enable focused processing of presented or produced explanations. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Learning by generating vs. receiving instructional explanations: Two approaches to enhance attention cueing in animations", "paper_id": "WOS:000279137800022"}