{"auto_keywords": [{"score": 0.03193847181510983, "phrase": "replacement_paths_problem"}, {"score": 0.020535632348051586, "phrase": "shortest_u-to-v_path"}, {"score": 0.010612387000973441, "phrase": "fast_matrix_multiplication"}, {"score": 0.01053918697184851, "phrase": "distance_sensitivity_oracle"}, {"score": 0.006714383806980147, "phrase": "distance_sensitivity_oracles"}, {"score": 0.004748371393578422, "phrase": "n-vertex_graph"}, {"score": 0.0046394362688524475, "phrase": "data_structure"}, {"score": 0.004596561972944185, "phrase": "shortest_paths"}, {"score": 0.003826183621294773, "phrase": "real_edge-lengths"}, {"score": 0.003519187671238718, "phrase": "integral_edge-lengths"}, {"score": 0.002942495422585405, "phrase": "vertical_bar_s_vertical_bar"}, {"score": 0.0028681935786000873, "phrase": "shortest_path"}, {"score": 0.0027570267191549774, "phrase": "edge_e"}, {"score": 0.0026317312518257803, "phrase": "first_subcubic-time_algorithm"}, {"score": 0.0025832180231667853, "phrase": "small_integers"}, {"score": 0.002304941533297862, "phrase": "space_bounds"}, {"score": 0.0022729905063809766, "phrase": "failed_vertices"}], "paper_keywords": ["Shortest paths", " replacement paths", " distance oracles", " fault tolerance"], "paper_abstract": "A distance sensitivity oracle of an n-vertex graph G = (V, E) is a data structure that can report shortest paths when edges of the graph fail. A query (u is an element of V, v is an element of V, S subset of E) to this oracle returns a shortest u-to-v path in the graph G' = (V, E \\ S). We present randomized (Monte Carlo) algorithms for constructing a distance sensitivity oracle of size (O) over tilde (n(3-alpha)) for vertical bar S vertical bar = O(lg n/lg lg n) and any choice of 0 < alpha < 1. For real edge-lengths, the oracle is constructed in O(n(4-alpha)) time and a query to this oracle takes (O) over tilde (n(2-2(1-alpha)/vertical bar S vertical bar)) time. For integral edge-lengths in {-M, ... , M}, using the current omega < 2.376 matrix multiplication exponent, the oracle is constructed in O(Mn3.376-alpha) time with <(O)over tilde> (n(2-(1-alpha)/vertical bar S vertical bar)) query, or alternatively in O(M(0.681)n(3.575-alpha)) time with (O) over tilde (n(2-2(1-alpha)/vertical bar S vertical bar)) query. Distance sensitivity oracles generalize the replacement paths problem in which u and v are known in advance and vertical bar S vertical bar = 1. In other words, if P is a shortest path from u to v in G, then the replacement paths problem asks to compute, for every edge e on P, a shortest u-to-v path that avoids e. Our new technique for constructing distance sensitivity oracles using fast matrix multiplication also yields the first subcubic-time algorithm for the replacement paths problem when the edge-lengths are small integers. In particular, it yields a randomized (Monte Carlo) (O) over tilde (Mn-2.376 + M-2/3 n(2.584))-time algorithm for the replacement paths problem assuming M <= n(0.624). Finally, we mention that both our replacement paths algorithm and our distance sensitivity oracle can be made to work, in the same time and space bounds, for the case of failed vertices rather than edges, that is, when S is a set of vertices and we seek a shortest u-to-v path in the graph obtained from G by removing all vertices in S and their adjacent edges.", "paper_title": "Replacement Paths and Distance Sensitivity Oracles via Fast Matrix Multiplication", "paper_id": "WOS:000316414900001"}