{"auto_keywords": [{"score": 0.04357394901675965, "phrase": "latent_process"}, {"score": 0.03378755630941466, "phrase": "latent_variable"}, {"score": 0.03162386513424821, "phrase": "particular_location"}, {"score": 0.02881858386788793, "phrase": "latent_variables"}, {"score": 0.00481495049065317, "phrase": "correlated_count_data"}, {"score": 0.004497973025639345, "phrase": "poisson_regression_model"}, {"score": 0.004357245559948974, "phrase": "covariate_information"}, {"score": 0.0040334640350288, "phrase": "previous_approaches"}, {"score": 0.003960831041259951, "phrase": "poisson_parameter"}, {"score": 0.003535489842686145, "phrase": "normal_distribution"}, {"score": 0.0034560481756572632, "phrase": "previous_values"}, {"score": 0.0032429499567088113, "phrase": "gamma_distribution"}, {"score": 0.0031556799865964974, "phrase": "fundamental_difference"}, {"score": 0.0030291453183733897, "phrase": "poisson_distribution"}, {"score": 0.002153450937601075, "phrase": "poisson-gamma_set"}, {"score": 0.0021049977753042253, "phrase": "exact_expressions"}], "paper_keywords": ["count data", " auto-correlation", " latent process"], "paper_abstract": "We introduce an approach for incorporating dependence between outcomes from a Poisson regression model, with the possibility of incorporating covariate information. In common with other approaches, we use a latent process to induce correlation between outcomes. Previous approaches have modelled the Poisson parameter as a function of a latent process which is assumed to be log-normally distributed. Dependence is introduced by the mean of this normal distribution being a function of previous values, using either an auto-regressive process or random walk process. Instead, we use a gamma distribution for the latent variable with the fundamental difference being that instead of the rate of the Poisson distribution at a particular location (in time or space) being directly associated with the value of the latent variable at that location, the latent variables lie on the boundaries between the locations. The rate for a particular location is then modelled as a combination of the latent variables lying on its boundaries; this combination induces correlation between the rates, and thus the outcomes. The attraction of such an approach is the ease of working with a Poisson-gamma set-up in which exact expressions for expectations, variances and covariances are available.", "paper_title": "Modelling correlated count data with covariates", "paper_id": "WOS:000252359600003"}