{"auto_keywords": [{"score": 0.030747370371191487, "phrase": "de_bruijn_sequence"}, {"score": 0.00481495049065317, "phrase": "shortest_double-stranded_dna_sequences"}, {"score": 0.004654210559456924, "phrase": "protein-binding_microarrays"}, {"score": 0.004532892812505505, "phrase": "novel_technologies"}, {"score": 0.004481868017991508, "phrase": "large_sets"}, {"score": 0.004448169552315403, "phrase": "short_double-stranded_dna_sequences"}, {"score": 0.004203343568960231, "phrase": "binding_intensity"}, {"score": 0.004062937864702115, "phrase": "synthetic_enhancer_sequences"}, {"score": 0.004002044115117644, "phrase": "organism's_genome"}, {"score": 0.0036969566358089644, "phrase": "sequence_probes"}, {"score": 0.0036005006349430586, "phrase": "comprehensive_picture"}, {"score": 0.0035198224928307854, "phrase": "possible_short_sequences"}, {"score": 0.0034933321145368336, "phrase": "gene_regulation"}, {"score": 0.003154566400499823, "phrase": "key_challenge"}, {"score": 0.00302612773666719, "phrase": "minimal_number"}, {"score": 0.0029694830678462787, "phrase": "standard_way"}, {"score": 0.002486103638234488, "phrase": "shortest_possible_sequence"}, {"score": 0.0022963142779850562, "phrase": "resulting_sequence"}, {"score": 0.0021049977753042253, "phrase": "redundant_k-mers"}], "paper_keywords": [""], "paper_abstract": "Motivation: Novel technologies can generate large sets of short double-stranded DNA sequences that can be used to measure their regulatory effects. Microarrays can measure in vitro the binding intensity of a protein to thousands of probes. Synthetic enhancer sequences inserted into an organism's genome allow us to measure in vivo the effect of such sequences on the phenotype. In both applications, by using sequence probes that cover all k-mers, a comprehensive picture of the effect of all possible short sequences on gene regulation is obtained. The value of k that can be used in practice is, however, severely limited by cost and space considerations. A key challenge is, therefore, to cover all k-mers with a minimal number of probes. The standard way to do this uses the de Bruijn sequence of length 4(k). However, as probes are double stranded, when a k-mer is included in a probe, its reverse complement k-mer is accounted for as well. Results: Here, we show how to efficiently create a shortest possible sequence with the property that it contains each k-mer or its reverse complement, but not necessarily both. The length of the resulting sequence approaches half that of the de Bruijn sequence as k increases resulting in a more efficient array, which allows covering more longer sequences; alternatively, additional sequences with redundant k-mers of interest can be added.", "paper_title": "Design of shortest double-stranded DNA sequences covering all k-mers with applications to protein-binding microarrays and synthetic enhancers", "paper_id": "WOS:000321746100009"}