{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "organizational_innovation"}, {"score": 0.0047864177420244795, "phrase": "organizational_learning"}, {"score": 0.004339203636449911, "phrase": "organizational_performance"}, {"score": 0.004262481067951517, "phrase": "prior_research"}, {"score": 0.004162281538812753, "phrase": "testable_hypotheses"}, {"score": 0.0038640303886081444, "phrase": "inter-factor_correlations_matrix_and_multiple_regressions_analyses"}, {"score": 0.003728529119516347, "phrase": "findings_-_considers_oi"}, {"score": 0.0036625643243684827, "phrase": "organizational_entrepreneurship"}, {"score": 0.003619235073669304, "phrase": "competitive_advantages"}, {"score": 0.0035341028694769036, "phrase": "different_strategic_capabilities"}, {"score": 0.0034922880300145283, "phrase": "adequate_level"}, {"score": 0.0034612507694547013, "phrase": "organizational_issues"}, {"score": 0.003290494847464381, "phrase": "social_desirability_bias"}, {"score": 0.0032612451286025555, "phrase": "external_validation"}, {"score": 0.0031845067058084583, "phrase": "archival_data"}, {"score": 0.0030454408569868347, "phrase": "common_method_variance"}, {"score": 0.0029561107046138136, "phrase": "future_studies"}, {"score": 0.002929824640902227, "phrase": "greater_emphasis"}, {"score": 0.0029124302021905366, "phrase": "longitudinal_studies"}, {"score": 0.002852356597632014, "phrase": "larger_sample"}, {"score": 0.0026954557881801546, "phrase": "organizations'_managers"}, {"score": 0.0026635371397608107, "phrase": "organization's_members"}, {"score": 0.002639845784408318, "phrase": "high_levels"}, {"score": 0.0026241684260044414, "phrase": "personal_mastery"}, {"score": 0.0025471636425006155, "phrase": "personal_vision"}, {"score": 0.0024431289979171505, "phrase": "shared_vision"}, {"score": 0.00236437009958525, "phrase": "mental_models"}, {"score": 0.0023503248644593908, "phrase": "specific_actions"}, {"score": 0.0023018188296933923, "phrase": "internal_and_external_obstacles"}, {"score": 0.002234252028553481, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "strategy_capabilities"}], "paper_keywords": ["entrepreneurialism", " organizations", " innovation", " transformational leadership"], "paper_abstract": "Purpose - To analyze a series of strategic capabilities/factors that affects organizational innovation (OD and organizational learning (OL) (personal mastery, transformational leadership, shared vision, proactivity and environment) and demonstrate that OL and innovation are positively related to organizational performance. Design/methodology/approach - Based on prior research, the paper develops a number of testable hypotheses. It examines how personal mastery, transformational leadership, shared vision, proactivity and environment influence improvements in performance. The paper uses inter-factor correlations matrix and multiple regressions analyses and empirically tests these hypotheses using a sample of 408 Spanish organizations. Findings - Considers OI and OL jointly to promote organizational entrepreneurship and to increase competitive advantages. Empirically reflects the need to strengthen different strategic capabilities to achieve an adequate level of both organizational issues and thus improve performance and encourage entrepreneurship. Research limitations/implications - Survey data based on self-reports may be subject to social desirability bias. The external validation of some of the variables from the archival data of a subset of respondents increased confidence in self-reports and reduced the risk of common method variance. The paper needs to concentrate on other sectors. Future studies should place greater emphasis on longitudinal studies and should be based on a larger sample, preferably in more than one country. It would be interesting to analyze other strategic activities for entrepreneurship. Practical implications - Organizations' managers must encourage the organization's members to achieve high levels of personal mastery. This environment can be provided by continually encouraging personal vision. The style of management must be more transformational. They must foster shared vision. The leader must prepare the organization and shape the mental models. Specific actions must be taken to overcome the internal and external obstacles to shared vision. The leader will play an important role in linking the organization and the environment and generate proactivity. Originality/value - This paper is fundamental to promote strategy capabilities that are necessary to entrepreneurship (OL and OD.", "paper_title": "Antecedents and consequences of organizational innovation and organizational learning in entrepreneurship", "paper_id": "WOS:000237547900002"}