{"auto_keywords": [{"score": 0.029803522994788154, "phrase": "jordan"}, {"score": 0.00481495049065317, "phrase": "group_theoretic"}, {"score": 0.004767261858417823, "phrase": "lie_algebraic"}, {"score": 0.004673290248999786, "phrase": "sic_existence_problem."}, {"score": 0.0046269981365987915, "phrase": "symmetric_informationally_complete_positive_operator"}, {"score": 0.004126349202545883, "phrase": "general_existence_proof"}, {"score": 0.003848413823574867, "phrase": "sic_existence_problem"}, {"score": 0.0031372369299648203, "phrase": "intrinsic_interest"}, {"score": 0.003029643234751066, "phrase": "sic_problem"}, {"score": 0.0027557911038816256, "phrase": "second_result"}, {"score": 0.0027148677103585985, "phrase": "greatly_strengthened_version"}, {"score": 0.0023028105026714533, "phrase": "sic_existence"}, {"score": 0.0021049977753042253, "phrase": "independent_interest"}], "paper_keywords": ["SIC", " Lie group", " Lie algebra", " Jordan algebra"], "paper_abstract": "Although symmetric informationally complete positive operator valued measures (SIC POVMs, or SICs for short) have been constructed in every dimension up to 67, a general existence proof remains elusive. The purpose of this paper is to show that the SIC existence problem is equivalent to three other, on the face of it quite different problems. Although it is still not clear whether these reformulations of the problem will make it more tractable, we believe that the fact that SICs have these connections to other areas of mathematics is of some intrinsic interest. Specifically, we reformulate the SIC problem in terms of (1) Lie groups, (2) Lie algebras and (3) Jordan algebras (the second result being a greatly strengthened version of one previously obtained by Appleby, Flammia and Fuchs). The connection between these three reformulations is non-trivial: It is not easy to demonstrate their equivalence directly, without appealing to their common equivalence to SIC existence. In the course of our analysis we obtain a number of other results which may be of some independent interest.", "paper_title": "GROUP THEORETIC, LIE ALGEBRAIC AND JORDAN ALGEBRAIC FORMULATIONS OF THE SIC EXISTENCE PROBLEM", "paper_id": "WOS:000358188400005"}