{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stochastic_orders"}, {"score": 0.049498146181447024, "phrase": "partially_ordered_sets"}, {"score": 0.048168621566366844, "phrase": "chemical_components"}, {"score": 0.004420472010542188, "phrase": "partial_order"}, {"score": 0.004209679094023478, "phrase": "real_functions"}, {"score": 0.0037866774001097596, "phrase": "stochastic_order"}, {"score": 0.00278930116312699, "phrase": "measurable_preserving_functions"}, {"score": 0.002560352786969071, "phrase": "particular_conditions"}, {"score": 0.0024781515864648242, "phrase": "mathematical_results"}, {"score": 0.002379092507901856, "phrase": "maritime_areas"}, {"score": 0.00221063611719246, "phrase": "specific_components"}], "paper_keywords": [""], "paper_abstract": "Given X a set endowed with a partial order <=, we can consider the class of <=-preserving real functions on X characterized by x <= y implies f (x) <= f (y). Such a class of functions generates a stochastic order <=(g) on the set of probabilities associated with X by means of P <=(g) Q when integral(x) f dP <= integral(x) f dQ for all f <=-preserving functions. In this paper we analyze if the property of being order-isomorphic is transferred from partially ordered sets to the corresponding generated stochastic orders and conversely. We obtain that if two posets are order-isomorphic, the posets which are generated by means of the class of measurable preserving functions are also order-isomorphic. We prove that the converse is not true in general, and we obtain particular conditions under which the converse holds. The mathematical results in the paper are applied to the comparison of maritime areas with respect to chemical components of seaweeds. Moreover we show how the solution of the above comparison for specific components can lead to the solution of the comparison when we consider other components of seaweeds by applying the results on order-isomorphisms.", "paper_title": "On Order-Isomorphisms of Stochastic Orders Generated by Partially Ordered Sets with Applications to the Analysis of Chemical Components of Seaweeds", "paper_id": "WOS:000324154200013"}