{"auto_keywords": [{"score": 0.03015792196082935, "phrase": "thorough_analysis"}, {"score": 0.004533806239310673, "phrase": "current_internet"}, {"score": 0.0044795698035664695, "phrase": "scalability_issues"}, {"score": 0.00440825801245188, "phrase": "research_community"}, {"score": 0.004355516897622305, "phrase": "alternative_architectures"}, {"score": 0.0038152404172111815, "phrase": "future_internet_architecture"}, {"score": 0.003769567397860168, "phrase": "critical_component"}, {"score": 0.003635790924434452, "phrase": "resources_consumption_perspective"}, {"score": 0.0035350218469335573, "phrase": "security_point"}, {"score": 0.0029151341559841486, "phrase": "ietf"}, {"score": 0.0026471070725516467, "phrase": "real_packet-level_traces"}, {"score": 0.0024922258873137093, "phrase": "high_hit_ratio"}, {"score": 0.0024230746206056536, "phrase": "security_policies"}, {"score": 0.002191366809047192, "phrase": "major_fraction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Locator/ID separation", " Future Internet architecture", " Addressing and routing architectures", " Measurements"], "paper_abstract": "Victim of its own success, the current Internet is facing scalability issues that lead the research community to explore alternative architectures. In particular, the Locator/ID Split paradigm, based on the idea of separating the identity from the location of end-systems, is gaining momentum and seems to be the most promising candidate for the future Internet architecture. A critical component of any Locator/ID Split approach, from a performance and resources consumption perspective, as well as from a security point of view, is the cache. The cache is meant to temporarily store mappings, i.e., the bindings between identifiers and locations, in order to provide routers with the knowledge of where to forward packets. Taking as reference protocol LISP (Locator/ID Separation Protocol), the most successful proposal currently under discussion at the IETF, this paper presents a thorough analysis of such a component, including the implications of policies to increase the level of security, based on real packet-level traces. Our results prove that even a timeout as short as 60 s provides a high hit ratio and that the impact of using security policies is small. Furthermore, a thorough analysis of the scalability of such a component is provided along with the analysis of which class of applications contributes the major fraction of cache-misses. (C) 2012 Published by Elsevier B.V.", "paper_title": "Caching Locator/ID mappings: An experimental scalability analysis and its implications", "paper_id": "WOS:000317808400005"}