{"auto_keywords": [{"score": 0.03086053742088127, "phrase": "consensus_model"}, {"score": 0.010612387000973441, "phrase": "unbalanced_fuzzy_linguistic_context"}, {"score": 0.006709414783422984, "phrase": "incomplete_information"}, {"score": 0.005620672511347126, "phrase": "consistency_measures"}, {"score": 0.004689462599037994, "phrase": "group_decision-making_problems"}, {"score": 0.004584495834677719, "phrase": "account_different_aspects"}, {"score": 0.004332199142914195, "phrase": "different_types"}, {"score": 0.004109212945115815, "phrase": "symmetrically_and_uniformly_distributed_linguistic_term_sets"}, {"score": 0.003810348067898898, "phrase": "unbalanced_linguistic_term_sets"}, {"score": 0.0037390789999636764, "phrase": "term_sets"}, {"score": 0.003415047118340286, "phrase": "in-depth_knowledge"}, {"score": 0.002562451837774567, "phrase": "iterative_procedure"}, {"score": 0.002402921062033032, "phrase": "consensus_measures"}, {"score": 0.002340147988348115, "phrase": "main_novelty"}, {"score": 0.0022447938263410005, "phrase": "incomplete_unbalanced_fuzzy_linguistic_information"}, {"score": 0.0021944267528581094, "phrase": "consistent_solutions"}, {"score": 0.002169667676959813, "phrase": "great_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Group decision making", " Unbalanced linguistic term set", " Incomplete information", " Consensus", " Consistency"], "paper_abstract": "To solve group decision-making problems we have to take in account different aspects. On the one hand, depending on the problem, we can deal with different types of information. In this way, most group decision-making problems based on linguistic approaches use symmetrically and uniformly distributed linguistic term sets to express experts' opinions. However, there exist problems whose assessments need to be represented by means of unbalanced linguistic term sets, i.e., using term sets which are not uniformly and symmetrically distributed. On the other hand, there may be cases in which experts do not have an in-depth knowledge of the problem to be solved. In such cases, experts may not put their opinion forward about certain aspects of the problem and, as a result, they may present incomplete information. The aim of this paper is to present a consensus model to help experts in all phases of the consensus reaching process in group decision-making problems in an unbalanced fuzzy linguistic context with incomplete information. As part of this consensus model, we propose an iterative procedure using consistency measures to estimate the incomplete information. In addition, the consistency measures are used together with consensus measures to guided the consensus model. The main novelty of this consensus model is that it supports the management of incomplete unbalanced fuzzy linguistic information and it allows to achieve consistent solutions with a great level of agreement. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Managing the consensus in group decision making in an unbalanced fuzzy linguistic context with incomplete information", "paper_id": "WOS:000275589800011"}