{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "okp_companies"}, {"score": 0.00481495049065317, "phrase": "parameter_flow_chart"}, {"score": 0.0046659637258752535, "phrase": "product_development_process"}, {"score": 0.004541918674719973, "phrase": "manufacturing_companies"}, {"score": 0.0038810583785936505, "phrase": "high_value-added_products"}, {"score": 0.0037948184359488284, "phrase": "shorter_times"}, {"score": 0.0037272031155266556, "phrase": "competitive_cost"}, {"score": 0.003693846909452865, "phrase": "process_knowledge"}, {"score": 0.0030307927228223883, "phrase": "user-friendly_and_effective_way"}, {"score": 0.0026600905156986317, "phrase": "software_system_model"}, {"score": 0.0025089420019955232, "phrase": "pfc_approach"}, {"score": 0.0023557346035701096, "phrase": "prototype_version"}, {"score": 0.0022520496048464406, "phrase": "case_studies"}, {"score": 0.00216263228969761, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge representation", " Knowledge management", " Knowledge-based engineering", " Computer-aided process planning"], "paper_abstract": "Knowledge in various stages of the product development process has become increasingly important for manufacturing companies to improve their performance, especially for those One-of-a-Kind Production (OKP) companies producing highly customized products. Process knowledge is a very special type of knowledge that controls how products are best manufactured. This knowledge can help OKP companies produce high value-added products with better quality at shorter times and at a competitive cost. Process knowledge is normally hard to capture and manage and is even more difficult to represent. This paper proposes a Parameter Flow Chart (PFC) based new knowledge representation method which efficiently combines parameter information, flow chart technology, and visualization technology. The goal of this research is to provide a user-friendly and effective way of representing process knowledge for OKP companies so they can develop and accumulate their own process knowledge repository. The basic definition and principle of the approach will be introduced first and the software system model then proposed. Two related key issues, the modeling of various chart units used in the PFC approach and dealing with expressions containing various parameters, are discussed in detail. The prototype version of the system has been developed and demonstrated with case studies, which has proven the feasibility of the proposed approach. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A new process knowledge representation approach using parameter flow chart", "paper_id": "WOS:000286088800002"}