{"auto_keywords": [{"score": 0.04926778266856684, "phrase": "functional_sites"}, {"score": 0.014608716158983001, "phrase": "cellular_functions"}, {"score": 0.009558109359151256, "phrase": "mv"}, {"score": 0.00481495049065317, "phrase": "silico_approach"}, {"score": 0.0046797114400479135, "phrase": "protein_structures"}, {"score": 0.004035107125458193, "phrase": "protein-dna_and_protein-rna_interactions"}, {"score": 0.0037682108720193956, "phrase": "functional_characterization"}, {"score": 0.0035796471115594553, "phrase": "functional_biomolecular_interactions"}, {"score": 0.0033811403330431897, "phrase": "important_step"}, {"score": 0.0031754329320561317, "phrase": "novel_computational_method"}, {"score": 0.0031393948330209255, "phrase": "multi-vorffip"}, {"score": 0.0026152363154073707, "phrase": "random_forest_ensemble_classifier"}, {"score": 0.0024984517279573906, "phrase": "current_methods"}, {"score": 0.0024281181691350085, "phrase": "centralized_resource"}, {"score": 0.0022802596433757565, "phrase": "powerful_web_application"}, {"score": 0.0021049977753042253, "phrase": "non-expert_end-users"}], "paper_keywords": [""], "paper_abstract": "Motivation: Proteins execute and coordinate cellular functions by interacting with other biomolecules. Among these interactions, protein-protein (including peptide-mediated), protein-DNA and protein-RNA interactions cover a wide range of critical processes and cellular functions. The functional characterization of proteins requires the description and mapping of functional biomolecular interactions and the identification and characterization of functional sites is an important step towards this end. Results: We have developed a novel computational method, Multi-VORFFIP (MV), a tool to predicts protein-, peptide-, DNA- and RNA-binding sites in proteins. MV utilizes a wide range of structural, evolutionary, experimental and energy-based information that is integrated into a common probabilistic framework by means of a Random Forest ensemble classifier. While remaining competitive when compared with current methods, MV is a centralized resource for the prediction of functional sites and is interfaced by a powerful web application tailored to facilitate the use of the method and analysis of predictions to non-expert end-users.", "paper_title": "A holistic in silico approach to predict functional sites in protein structures", "paper_id": "WOS:000306136100007"}