{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_data"}, {"score": 0.004760394308239882, "phrase": "relational_databases"}, {"score": 0.004626680470601208, "phrase": "classical_or_fuzzy_data"}, {"score": 0.004128192012388041, "phrase": "system_portability"}, {"score": 0.0038332390893263844, "phrase": "implementation-independent_and_web-accessible_way"}, {"score": 0.0034789831290103967, "phrase": "fuzzy_relational_database_model"}, {"score": 0.003211883390828745, "phrase": "fuzzy_databases"}, {"score": 0.0031573626285069157, "phrase": "communication_channel"}, {"score": 0.0030337085953063125, "phrase": "relational_database_management_system"}, {"score": 0.0024281181691350085, "phrase": "fuzzy_and_classical_data"}, {"score": 0.0023196699954340437, "phrase": "even_an_application"}, {"score": 0.0022802596433757565, "phrase": "fuzzy_queries"}, {"score": 0.0021049977753042253, "phrase": "real_databases"}], "paper_keywords": ["Ontologies", " Fuzzy Relational Databases", " Schemas", " Protege", " Knowledge Representation", " Fuzzy Data"], "paper_abstract": "Several applications to represent classical or fuzzy data in databases have been developed in the last two decades. However, these representations present some limitations specially related with the system portability and complexity. Ontologies provides a mechanism to represent data in an implementation-independent and web-accessible way. To get advantage of this, in this paper, an ontology, that represents fuzzy relational database model, has been redefined to communicate users or applications with fuzzy data stored in fuzzy databases. The communication channel established between the ontology and any Relational Database Management System (RDBMS) is analysed in depth throughout the text to justify some of the advantages of the system: expressiveness, portability and platform heterogeneity. Moreover, some tools have been developed to define and manage fuzzy and classical data in relational databases using this ontology. Even an application that performs fuzzy queries using the same technology is included in this proposal together with some examples using real databases.", "paper_title": "An Ontology as a Tool for Representing Fuzzy Data in Relational Databases", "paper_id": "WOS:000311119400008"}