{"auto_keywords": [{"score": 0.04968705263604004, "phrase": "data_streams"}, {"score": 0.00481495049065317, "phrase": "enforce_access_control"}, {"score": 0.00471700544744796, "phrase": "access_control"}, {"score": 0.004640079189342692, "phrase": "key_component"}, {"score": 0.004583205112737672, "phrase": "computational_system"}, {"score": 0.004380540407926982, "phrase": "unauthorized_access"}, {"score": 0.003985166330358716, "phrase": "general_framework"}, {"score": 0.0039362878637371574, "phrase": "streaming_data"}, {"score": 0.0037312893857519803, "phrase": "target_stream_engine"}, {"score": 0.0035808664384880213, "phrase": "standard_query_language"}, {"score": 0.00338037259057507, "phrase": "general_solution"}, {"score": 0.0031260524791486347, "phrase": "expressive_role-based_access_control_model"}, {"score": 0.0029509483926257645, "phrase": "user_queries"}, {"score": 0.0027514186391258263, "phrase": "specified_access_control_policies"}, {"score": 0.0026622351303038885, "phrase": "deployment_module"}, {"score": 0.002607965563121546, "phrase": "rewritten_query"}, {"score": 0.0025130460190930554, "phrase": "different_stream_engines"}, {"score": 0.0021049977753042253, "phrase": "developed_techniques"}], "paper_keywords": ["Security", " Data stream", " access control", " secure query rewriting"], "paper_abstract": "Although access control is currently a key component of any computational system, it is only recently that mechanisms to guard against unauthorized access to streaming data have started to be investigated. To cope with this lack, in this article, we propose a general framework to protect streaming data, which is, as much as possible, independent from the target stream engine. Differently from RDBMSs, up to now a standard query language for data streams has not yet emerged and this makes the development of a general solution to access control enforcement more difficult. The framework we propose in this article is based on an expressive role-based access control model proposed by us. It exploits a query rewriting mechanism, which rewrites user queries in such a way that they do not return tuples/attributes that should not be accessed according to the specified access control policies. Furthermore, the framework contains a deployment module able to translate the rewritten query in such a way that it can be executed by different stream engines, therefore, overcoming the lack of standardization. In the article, besides presenting all the components of our framework, we prove the correctness and completeness of the query rewriting algorithm, and we present some experiments that show the feasibility of the developed techniques.", "paper_title": "A Framework to Enforce Access Control over Data Streams", "paper_id": "WOS:000280545800010"}