{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rationality_conditions"}, {"score": 0.049571431541439746, "phrase": "fuzzy_choice_functions"}, {"score": 0.014703313103036096, "phrase": "fuzzy_choice_function"}, {"score": 0.009245663226233065, "phrase": "revealed_preference_relations"}, {"score": 0.004351129221591406, "phrase": "banerjee"}, {"score": 0.004059673618719782, "phrase": "standard_framework"}, {"score": 0.003910879154656061, "phrase": "theory_researchers"}, {"score": 0.0038487848937121204, "phrase": "people's_choice_behavior"}, {"score": 0.0036488111139918135, "phrase": "choice_behavior"}, {"score": 0.003108911488613549, "phrase": "new_rationality_conditions"}, {"score": 0.0028391271282216758, "phrase": "relatively_complete_description"}, {"score": 0.002431699464104896, "phrase": "strong_rationality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rationality", " Fuzzy revealed preference relation", " Fuzzy choice function"], "paper_abstract": "This note investigates the rationality conditions of fuzzy choice functions. For studying the rationality of fuzzy choice functions, Banerjee introduced many regularity conditions that are defined for revealed preference relations. However, in the standard framework of economics and decision-making theory researchers usually assume people's choice behavior is observable, while the preference (behind the choice behavior) is unobservable. It is worthwhile to study rationality conditions that are defined for fuzzy choice functions instead that for revealed preference relations. For this purpose, we propose a set of new rationality conditions depending only on the fuzzy choice function. We study the connection among these rationality conditions and give a relatively complete description for them. We also find that Banerjee-rationality is too weak to capture some kind of consistency of the fuzzy choice function. This motivates us to introduce two notions on strong rationality. The relationships between our new consistency conditions and the rationality (Banerjee-rationality and strong rationality) of the fuzzy choice function are discussed. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A note on rationality conditions of fuzzy choice functions", "paper_id": "WOS:000356140000007"}