{"auto_keywords": [{"score": 0.0436316524261665, "phrase": "opinion_mining_systems"}, {"score": 0.030874552329361617, "phrase": "online_questionnaire"}, {"score": 0.00481495049065317, "phrase": "opinion_visualization_techniques"}, {"score": 0.004532988904965752, "phrase": "usability_study"}, {"score": 0.004491093879657087, "phrase": "opinion_mining_systems'_visualizations"}, {"score": 0.004073809704022463, "phrase": "important_visualization_metrics"}, {"score": 0.004017437417375057, "phrase": "questionnaire_survey"}, {"score": 0.0036951530348821116, "phrase": "information_visualization_metrics"}, {"score": 0.003644001325962353, "phrase": "likert_scale"}, {"score": 0.003446353878654566, "phrase": "web-based_online_questionnaire"}, {"score": 0.0033515736929172644, "phrase": "collected_data"}, {"score": 0.0032898346872897383, "phrase": "descriptive_statistics"}, {"score": 0.003244275497488318, "phrase": "independent_sample_t-test"}, {"score": 0.0022467024793003812, "phrase": "important_information_visualization_metrics"}, {"score": 0.0021049977753042253, "phrase": "representation_style"}], "paper_keywords": ["Information visualization", " opinion mining", " opinion visualization", " sentiment analysis", " visual opinion mining"], "paper_abstract": "In this article, we are reporting the findings of a usability study of opinion mining systems' visualizations. The objectives of this study are to first to rank the visualizations of the opinion mining systems and second to identify important visualization metrics. A questionnaire survey was designed to ask users their level of agreement or disagreement about the 11 selected visualizations against a set of information visualization metrics on a Likert scale. The data were collected by conducting seminars and using a web-based online questionnaire (N=146). The collected data were analyzed using descriptive statistics and an independent sample t-test to rank the visualizations and investigate differences between perceptions of the two groups of respondents (the participants of the seminars and the online questionnaire), respectively. The results revealed that simple, eye pleasing, easy to understand, user-friendly visualizations with less pre-knowledge required rated higher than others. It is concluded that the participants of the online questionnaire mostly required more pre-knowledge to comprehend the visualizations as compared to the participants of the seminars. The important information visualization metrics are eye pleasing, easy to understand, user-friendly, informative design, usefulness, and representation style. The results of this study could aid in the design and development of visualizations for opinion mining systems.", "paper_title": "Evaluation of opinion visualization techniques", "paper_id": "WOS:000361872600004"}