{"auto_keywords": [{"score": 0.04806878501085574, "phrase": "large_amount"}, {"score": 0.00481495049065317, "phrase": "situated_interactivity"}, {"score": 0.004703671193348433, "phrase": "complex_organizations"}, {"score": 0.004333973355873714, "phrase": "information_systems"}, {"score": 0.004200874581076468, "phrase": "electronic_format"}, {"score": 0.003885668358145471, "phrase": "different_ways"}, {"score": 0.003781005930058317, "phrase": "specific_professional_communities"}, {"score": 0.0037079710789139305, "phrase": "different_and_peculiar_culture"}, {"score": 0.0034296217420566304, "phrase": "real_time"}, {"score": 0.003324203391715804, "phrase": "syntactic_and_semantic_characterization"}, {"score": 0.002956858061485755, "phrase": "users'_characteristics"}, {"score": 0.002745438358145758, "phrase": "users_interactivity"}, {"score": 0.00243237365704391, "phrase": "document_layout"}, {"score": 0.002376027109070317, "phrase": "different_semantic_components"}, {"score": 0.0022672107906933714, "phrase": "wil_system"}, {"score": 0.0022320551224679526, "phrase": "e-document_indexing"}, {"score": 0.0021049977753042253, "phrase": "logical_structure"}], "paper_keywords": ["HCI", " Interactivity", " XML", " e-Document management"], "paper_abstract": "Complex organizations need to manage a large amount of information that their employees produce and use in the form of documents: therefore, information systems are adopted to access these documents in electronic format (e-documents) through Intranet or Internet. These documents are composed, organized and annotated in different ways according to the rules adopted by specific professional communities. Such rules reflect the different and peculiar culture and skills of the communities producing them. The large amount of information available today can be potentially accessed in real time. This has increased the need for syntactic and semantic characterization of documents and for tools that allow their effective access and exploitation on the Net, their easy retrieval and management, their annotation to adapt and personalize them on the base of users' characteristics and diversities. This paper describes the approach adopted for the Web Indexing Language (WIL) system, a system conceived for supporting users interactivity during editing, indexing, and annotating e-documents on the basis of conventions adopted for their production and distribution. In particular, the approach capitalizes on the notion that the document layout reflects the relationships among the different semantic components of the document. The model and the architecture of the WIL system aim at improving e-document indexing, searching, editing and annotating, and at exploiting the description of the logical structure of the document itself to squeeze the information about the document content which are usually grasped by a reader at a glance.", "paper_title": "e-Document management in situated interactivity: the WIL approach", "paper_id": "WOS:000207889400002"}