{"auto_keywords": [{"score": 0.015389558966545437, "phrase": "object_orientation"}, {"score": 0.015227212701553012, "phrase": "uml"}, {"score": 0.014986447942509199, "phrase": "generalization_relationship"}, {"score": 0.014788809785766797, "phrase": "uml_metamodel"}, {"score": 0.004738078275822989, "phrase": "fundamental_relationship"}, {"score": 0.004637478829869904, "phrase": "unified_modeling_language"}, {"score": 0.004490552331642995, "phrase": "\"directed_relationship"}, {"score": 0.004406994912939125, "phrase": "directed_relationship"}, {"score": 0.004301834610818624, "phrase": "semantic_domain"}, {"score": 0.004055176557424983, "phrase": "particular_form"}, {"score": 0.003874268814573721, "phrase": "model_manipulation_tools"}, {"score": 0.003802135020791801, "phrase": "uml_specification"}, {"score": 0.0036130172109597888, "phrase": "metamodeling_levels"}, {"score": 0.0032888418378433037, "phrase": "use_cases"}, {"score": 0.0030917715423273207, "phrase": "uml."}, {"score": 0.0027766627317272427, "phrase": "directed_relationships"}, {"score": 0.0025137856138000014, "phrase": "practical_and_theoretical_reasons"}, {"score": 0.0024209250169088575, "phrase": "connected_graphical_symbols"}, {"score": 0.0023189818169615135, "phrase": "syntactic_properties"}, {"score": 0.002174041708084857, "phrase": "one-way_associations"}, {"score": 0.002156571716615371, "phrase": "user_model_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Unified Modeling Language", " Model engineering", " Metamodel", " Generalization", " Directed relationship"], "paper_abstract": "Context: Generalization is a fundamental relationship in object orientation and in the UML (Unified Modeling Language). The generalization relationship is represented in the UML metamodel as a \"directed relationship\". Objective: Being a directed relationship corresponds to the nature of generalization in the semantic domain of object orientation: a relationship that is directed from the subclass to the superclass. However, we claim that the particular form this relationship adopts in the metamodel is erroneous, which entails a series of inconveniencies for model manipulation tools that try to adhere to the UML specification. Moreover, we think that this error could be due to a misinterpretation of the relationships between metamodeling levels in the UML: represented reality (MO), model (M1) and metamodel (M2). This problem also affects other directed relationships: Dependency and its various subtypes, Include and Extend between use cases, and others. Method: We analyze the features of the generalization relationship in various domains and how it has been metamodeled in UML. We examine the problems, both theoretical and technological, posed by the UML metamodel of generalization. We then compare it with the metamodel of other directed relationships. Results: We arrive at the conclusion that the metamodel of all directed relationships could be improved. Namely, we claim that, at level M2, the metamodel should not contain any one-way meta-associations: all meta-associations should be two-way, both for practical and theoretical reasons. Conclusions: The rationale for our main claim can be summarized as follows: connected graphical symbols do know each other, and the goal of a metamodel is to specify the syntactic properties of a language, ergo meta-associations must be two-way. This, of course, does not preclude at all the use of one-way associations at the user model level (M1). (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Metamodeling generalization and other directed relationships in UML", "paper_id": "WOS:000336010100002"}