{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_subjects"}, {"score": 0.0047268728636719725, "phrase": "transaction_log"}, {"score": 0.0046834372388970405, "phrase": "users'_traversal_activities"}, {"score": 0.004040123129261597, "phrase": "browsing_activities"}, {"score": 0.003929689573550262, "phrase": "health_subject_directory"}, {"score": 0.0038577428353448596, "phrase": "path_data"}, {"score": 0.0037177622939493084, "phrase": "consumer_health_portal_transaction_log"}, {"score": 0.003484864867147635, "phrase": "som_display"}, {"score": 0.003312121699003206, "phrase": "specified_subject"}, {"score": 0.0031918759137610523, "phrase": "subject_component_planes"}, {"score": 0.002652878591019016, "phrase": "health-related_directory"}, {"score": 0.0024636239664210433, "phrase": "component_analysis"}, {"score": 0.0023522423291484212, "phrase": "subject_relationships"}, {"score": 0.002204697943520258, "phrase": "medical_thesauri"}, {"score": 0.002154272413276506, "phrase": "medical_subject_directories"}, {"score": 0.0021049977753042253, "phrase": "users'_medical_information-seeking_behaviour"}], "paper_keywords": ["self-organizing map", " component plane analysis", " Web transaction log", " health subject directory", " traversal path analysis"], "paper_abstract": "Users' traversal activities among webpages can reveal associations among these webpages to some degree. Both the self-organizing map (SOM) method and component plane analysis method were used to investigate associations among the two groups of medical subjects respectively based on browsing activities. The subjects from a health subject directory were extracted and path data among these subjects were analyzed from a consumer health portal transaction log. Two focus themes were selected and two related subject clusters were identified respectively in the SOM display. The association judgements about the subjects related to a specified subject were made in the contexts of the subject component planes. Terms related to the two focus subjects (nerve and heart) and the degree to which these terms were related to the two focus subjects were identified in the study. This study shows that users' navigating activities on the health-related directory can reveal and identify the associations among the subjects on the directory, and the component analysis is reliable when it is applied to identify the subject relationships in such a situation. The findings of this study can be used to enrich medical thesauri, to optimize the medical subject directories, and to understand users' medical information-seeking behaviour.", "paper_title": "Visual component plane analysis for the medical subjects based on a transaction log", "paper_id": "WOS:000275498000003"}