{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hierarchical_secure_communications"}, {"score": 0.004709567162738894, "phrase": "secure_storage_model"}, {"score": 0.00447251540886613, "phrase": "cloud_storage_system"}, {"score": 0.004423284899590467, "phrase": "backbone_storage_system"}, {"score": 0.004342430078306461, "phrase": "data_transmission"}, {"score": 0.004278807087784626, "phrase": "data_nodes"}, {"score": 0.004169692306713217, "phrase": "non-cloud_user"}, {"score": 0.0036778708850237814, "phrase": "cloud_servers"}, {"score": 0.0034925663938977715, "phrase": "\"hierarchy_security\"_method"}, {"score": 0.003441352119167824, "phrase": "data_security"}, {"score": 0.003365930631436696, "phrase": "key_feature"}, {"score": 0.002935905915691203, "phrase": "poisson_process"}, {"score": 0.002914288956035066, "phrase": "little's_law"}, {"score": 0.0023346234464901978, "phrase": "data_storage"}, {"score": 0.002176235362654451, "phrase": "cloud_environment"}, {"score": 0.0021601997088758957, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cloud", " Performance", " Security", " P2P"], "paper_abstract": "This paper presents a secure storage model named Peer to Cloud and Peer (P2CP). P2CP uses the cloud storage system as a backbone storage system. However, when data transmission occurs, the data nodes, cloud user, and the non-cloud user are involved to complete the transaction all together. The users, typically the client peers, can communicate with each other directly, thus bypassing servers on the cloud. Similarly, cloud servers can communicate with each other in a P2P mode. We also introduce a \"hierarchy security\" method to guarantee the data security in the proposed P2CP storage model. A key feature of our P2CP is that it has three data transmission tunnels: the cloud-user data transmission tunnel, the clients' data transmission tunnel, and the common data transmission tunnel. Assuming that the P2CP model follows the Poisson process or Little's law, we not only mathematically prove that the speed of P2CP is generally better than that of the pure peer-to-peer (P2P) model, the peer to server and peer (P2SP) model or the pure cloud model, but also testify the results through simulations. Beyond security, we also investigate the performance of another characteristic of usability of the data storage, namely availability, where P2CP is more robust to the failures of peers or servers in the cloud environment. Crown Copyright (C) 2012 Published by Elsevier Inc. All rights reserved.", "paper_title": "A high performance peer to cloud and peer model augmented with hierarchical secure communications", "paper_id": "WOS:000319847600007"}