{"auto_keywords": [{"score": 0.03750005124251493, "phrase": "hardware_reuse"}, {"score": 0.03104244392514206, "phrase": "hardware_sharing"}, {"score": 0.00481495049065317, "phrase": "modern_application-specific_processors"}, {"score": 0.0047026237903774895, "phrase": "effective_exploitation"}, {"score": 0.004620093797504386, "phrase": "application-specific_parallel_patterns"}, {"score": 0.0035210624905392227, "phrase": "asip"}, {"score": 0.003479692058963528, "phrase": "accelerator_synthesis"}, {"score": 0.003260690513595527, "phrase": "published_research"}, {"score": 0.0030554300179552415, "phrase": "academic_collaborative_research"}, {"score": 0.0027796495180095657, "phrase": "big_influence"}, {"score": 0.0026986685585382347, "phrase": "major_circuit"}, {"score": 0.0025587867729949037, "phrase": "multi-objective_optimization"}, {"score": 0.0024118292918742967, "phrase": "state-of-the-art_synthesis_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Resource sharing", " Application-specific processors", " Hardware accelerator", " Area reduction", " Power reduction"], "paper_abstract": "Effective exploitation of the application-specific parallel patterns and computation operations through their direct implementation in hardware is the base for construction of high-quality application-specific (re-) configurable application specific instruction set processors (ASIPs) and hardware accelerators for modern highly-demanding applications. Although it receives a lot of attention from the researchers and practitioners, a very important problem of hardware reuse in ASIP and accelerator synthesis is clearly underestimated and does not get enough attention in the published research. This paper is an effect of an industry and academic collaborative research. It analyses the problem of hardware sharing, shows its high practical relevance, as well as a big influence of hardware sharing on the major circuit and system parameters, and its importance for the multi-objective optimization and tradeoff exploitation. It also demonstrates that the state-of-the-art synthesis tools do not sufficiently address this problem and gives several guidelines related to enhancement of the hardware reuse. (C) 2012 Published by Elsevier B.V.", "paper_title": "Hardware reuse in modern application-specific processors and accelerators", "paper_id": "WOS:000326614600017"}