{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "political_blogs"}, {"score": 0.004743594110762319, "phrase": "tensor_dimensionality_reduction"}, {"score": 0.004696608876994947, "phrase": "social_tagging"}, {"score": 0.0033639840192975835, "phrase": "different_users"}, {"score": 0.003152915289414825, "phrase": "ideological_burden"}, {"score": 0.002969821115740559, "phrase": "semantic_ambiguity"}, {"score": 0.002797329638474873, "phrase": "current_recommendation_algorithms"}, {"score": 0.00256993314099902, "phrase": "latent_semantic_relationships"}, {"score": 0.002444883254621769, "phrase": "social_blogging_system"}, {"score": 0.0023143284925318916, "phrase": "experimental_comparison"}, {"score": 0.0022799458141165587, "phrase": "proposed_method"}, {"score": 0.0022573076362326135, "phrase": "state-of-the-art_recommendation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "significant_improvements"}], "paper_keywords": [""], "paper_abstract": "Social Tagging is the process by which many users add metadata in the form of keywords, to annotate and categorize items (posts, songs, pictures, web links, products etc.). Political blogs can recommend posts to users, based on tags they have in common with other similar users. However, a post in politics may be interpreted in a number of ways by different users. This is because terms, especially in politics, carry an ideological burden and therefore it is very likely for posts to present a semantic ambiguity. The significance of this study is that in contrast to current recommendation algorithms, we apply Higher Order Singular Value Decomposition (HOSVD) on a 3-dimensional tensor to find latent semantic relationships between the three types of entities that exist in a social blogging system: users, posts, and tags. We perform experimental comparison of the proposed method against state-of-the-art recommendation algorithms with two real data sets (Wordpress and Technorati). Our results show significant improvements in terms of effectiveness measured through recall/precision.", "paper_title": "Recommending posts in political blogs based on tensor dimensionality reduction", "paper_id": "WOS:000281470100009"}