{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_availability"}, {"score": 0.004195418010131832, "phrase": "e-broker_system"}, {"score": 0.004038943596016986, "phrase": "main_contributions"}, {"score": 0.0036727235025069828, "phrase": "information_brokers"}, {"score": 0.0036207206487324506, "phrase": "value-added_routing"}, {"score": 0.0031393948330209255, "phrase": "eib_scheme"}, {"score": 0.0029652292779277782, "phrase": "better_service"}, {"score": 0.0026452734009203764, "phrase": "mobile_peers"}, {"score": 0.002570817338292482, "phrase": "broker-based_architecture"}, {"score": 0.0024513404432665153, "phrase": "data-providing_peers"}, {"score": 0.002382329940096419, "phrase": "proposed_schemes"}, {"score": 0.0023152577218214804, "phrase": "query_response_times"}, {"score": 0.0022933216359142736, "phrase": "data_availability_and_query_hop-counts"}, {"score": 0.0021659920594094407, "phrase": "recent_existing_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Economic incentive schemes", " Brokerage", " Data availability", " Mobile-P2P networks"], "paper_abstract": "In mobile ad hoc peer-to-peer (M-P2P) networks, data availability is typically low due to rampant free-riding, frequent network partitioning and mobile resource constraints. This work proposes the E-Broker system for improving data availability in M-P2P networks. The main contributions of E-Broker are threefold. First, it proposes the EIB (Economic Incentive-based Brokerage) scheme, which incentivizes relay peers to act as information brokers for performing value-added routing and replication in M-P2P networks, thereby effectively improving data availability. Second, it proposes the EIB+ (enhanced Economic Incentive-based Brokerage) scheme, which extends the EIB scheme by incorporating three different broker scoring strategies for providing additional incentives to brokers towards providing better service. Moreover, EIB+ facilitates load-sharing among the peers. Third, it experimentally determines the number of brokers, beyond which the mobile peers are better off without a broker-based architecture i.e., they can directly access data from the data-providing peers. Our performance evaluation indicates that the proposed schemes are indeed effective in improving query response times, data availability and query hop-counts at reasonable communication traffic cost in M-P2P networks as compared to a recent existing scheme. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Economic incentive-based brokerage schemes for improving data availability in mobile-P2P networks", "paper_id": "WOS:000318466100002"}