{"auto_keywords": [{"score": 0.048555664185916905, "phrase": "species_trees"}, {"score": 0.023652398455603203, "phrase": "gene_trees"}, {"score": 0.008651636822276716, "phrase": "incomplete_gene_trees"}, {"score": 0.007996511212818865, "phrase": "species_tree"}, {"score": 0.006661078845792076, "phrase": "ils"}, {"score": 0.00481495049065317, "phrase": "optimal_species_trees"}, {"score": 0.004746263721902201, "phrase": "deep_coalescence"}, {"score": 0.004215571179806372, "phrase": "phylogenomic_approach"}, {"score": 0.0041703614123283165, "phrase": "tree_estimation"}, {"score": 0.0038671299350540554, "phrase": "incomplete_lineage"}, {"score": 0.0037845987749316632, "phrase": "gene_duplication"}, {"score": 0.0037171648669537287, "phrase": "horizontal_gene_transfer"}, {"score": 0.0035346515636097533, "phrase": "frequent_problem"}, {"score": 0.0030830390264125923, "phrase": "general_case"}, {"score": 0.0028586409810976367, "phrase": "optimization_problems"}, {"score": 0.002797572252783356, "phrase": "theoretical_results"}, {"score": 0.00267931029131157, "phrase": "simulation_study"}, {"score": 0.0026600905156986317, "phrase": "existing_methods"}, {"score": 0.0024842242921857705, "phrase": "gene_sequence_alignments"}, {"score": 0.0023367260405565814, "phrase": "small_datasets"}, {"score": 0.0023116191163488824, "phrase": "second_most_accurate_method"}, {"score": 0.002166531234910196, "phrase": "mrp"}, {"score": 0.0021049977753042253, "phrase": "large_datasets"}], "paper_keywords": ["algorithms"], "paper_abstract": "The estimation of species trees typically involves the estimation of trees and alignments on many different genes, so that the species tree can be based on many different parts of the genome. This kind of phylogenomic approach to species tree estimation has the potential to produce more accurate species tree estimates, especially when gene trees can differ from the species tree due to processes such as incomplete lineage sorting (ILS), gene duplication and loss, and horizontal gene transfer. Because ILS (also called \"deep coalescence'') is a frequent problem in systematics, many methods have been developed to estimate species trees from gene trees or alignments that specifically take ILS into consideration. In this paper we consider the problem of estimating species trees from gene trees and alignments for the general case where the gene trees and alignments can be incomplete, which means that not all the genes contain sequences for all the species. We formalize optimization problems for this context and prove theoretical results for these problems. We also present the results of a simulation study evaluating existing methods for estimating species trees from incomplete gene trees. Our simulation study shows that *BEAST, a statistical method for estimating species trees from gene sequence alignments, produces by far the most accurate species trees. However, *BEAST can only be run on small datasets. The second most accurate method, MRP (a standard supertree method), can analyze very large datasets and produces very good trees, making MRP a potentially acceptable alternative to *BEAST for large datasets.", "paper_title": "Estimating Optimal Species Trees from Incomplete Gene Trees Under Deep Coalescence", "paper_id": "WOS:000305335100003"}