{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organisational_size"}, {"score": 0.004523103062368843, "phrase": "popular_construct"}, {"score": 0.004482873744893272, "phrase": "information_systems"}, {"score": 0.003991196463806465, "phrase": "churchill's_measure_development_paradigm"}, {"score": 0.003601235776892337, "phrase": "six_leading"}, {"score": 0.003163212007747804, "phrase": "size_construct"}, {"score": 0.0028795712616923462, "phrase": "construct's_content_validity"}, {"score": 0.0028411768240129585, "phrase": "concept_map_exercise"}, {"score": 0.0027907771648224273, "phrase": "multidimensional_scaling"}, {"score": 0.0024246054422073417, "phrase": "study"}, {"score": 0.0023333173799963795, "phrase": "eight_constructs"}, {"score": 0.0022613292987262177, "phrase": "smaller_and_larger_firms"}, {"score": 0.002181766829493483, "phrase": "organisational_levels"}, {"score": 0.002162316557411786, "phrase": "risk_aversion"}, {"score": 0.0021430393104977788, "phrase": "geographic_distribution"}, {"score": 0.0021049977753042253, "phrase": "respondents'_self-nominated_size"}], "paper_keywords": ["organisation size", " construct development", " measurement", " survey", " literature analysis"], "paper_abstract": "While organisational size is a popular construct in information systems ( IS) research, findings from its use have been inconsistent. Few studies have explored this inconsistency or attempted to address this problem. This paper uses Churchill's measure development paradigm to conduct three separate but related investigations into the size construct. Study 1 explored the domain and dimensions of size. Some 2000 research papers published in six leading IS journals over an 11-year period were read in order to determine what researchers thought size meant and how they measured it. The study found 21 constructs underpinning the size construct and 25 ways of measuring size, but no clear relationship between size meaning and measurement. Study 2 assessed the construct's content validity using a concept map exercise involving 41 participants. Multidimensional scaling clustered the constructs into three conceptual groups. Study 3 administered the size construct in a survey with a sample of 163 Australian firms. The study found that the data supported the constructs observed in Study 2 and that a group of eight constructs could be used to differentiate between smaller and larger firms in the sample. Analysis revealed that organisational levels, risk aversion, geographic distribution and employment reflected respondents' self-nominated size.", "paper_title": "Rethinking organisational size in IS research: meaning, measurement and redevelopment", "paper_id": "WOS:000264892800001"}