{"auto_keywords": [{"score": 0.04295798374264589, "phrase": "sb"}, {"score": 0.03927435139381456, "phrase": "h-h_bisimulation"}, {"score": 0.015559180359290124, "phrase": "stable_configuration_structures"}, {"score": 0.010066448221988438, "phrase": "reverse_steps"}, {"score": 0.00481495049065317, "phrase": "reverse_bisimulations"}, {"score": 0.004716520738331953, "phrase": "van_glabbeek"}, {"score": 0.00466806015216812, "phrase": "goltz"}, {"score": 0.003513264130359459, "phrase": "forward_transitions"}, {"score": 0.003151736708029235, "phrase": "bednarczyk"}, {"score": 0.002726740692380339, "phrase": "forward_steps"}, {"score": 0.0026161698049580804, "phrase": "bednarczyk's_result"}, {"score": 0.002310578855290687, "phrase": "auto-concurrent_events"}, {"score": 0.0021490449563443025, "phrase": "reversible_behaviour"}, {"score": 0.0021049977753042253, "phrase": "wide_range"}], "paper_keywords": [""], "paper_abstract": "Van Glabbeek and Goltz (and later Fecher) have investigated the relationships between various equivalences on stable configuration structures, including interleaving bisimulation (IB), step bisimulation (SB), pomset bisimulation and hereditary history-preserving (H-H) bisimulation. Since H-H bisimulation may be characterised by the use of reverse as well as forward transitions, it is of interest to investigate these and other forms of bisimulations where both forward and reverse transitions are allowed. Bednarczyk asked whether SB with reverse steps is as strong as H-H bisimulation. We answer this question negatively. We give various characterisations of SB with reverse steps, showing that forward steps do not add power. We strengthen Bednarczyk's result that, in the absence of auto-concurrency, reverse IB is as strong as H-H bisimulation, by showing that we need only exclude auto-concurrent events at the same depth in the configuration. We consider several other forms of observations of reversible behaviour and define a wide range of bisimulations by mixing the forward and reverse observations. We investigate the power of these bisimulations and represent the relationships between them as a hierarchy with IB at the bottom and H-H at the top.", "paper_title": "A hierarchy of reverse bisimulations on stable configuration structures", "paper_id": "WOS:000300844900007"}