{"auto_keywords": [{"score": 0.03270717212458863, "phrase": "absorptive_capacity"}, {"score": 0.01974423916514894, "phrase": "organizational_learning"}, {"score": 0.014071171996920963, "phrase": "financial_performance"}, {"score": 0.007668273902526506, "phrase": "research_model"}, {"score": 0.007149575639691041, "phrase": "important_learning_mechanism"}, {"score": 0.007061726167604501, "phrase": "knowledge_transfer_effectiveness"}, {"score": 0.00481495049065317, "phrase": "information_technology_use_as"}, {"score": 0.004236074477264561, "phrase": "theoretical_development"}, {"score": 0.004201202199968683, "phrase": "empirical_investigation"}, {"score": 0.004115267130977749, "phrase": "information_technology_use"}, {"score": 0.003997891221012094, "phrase": "theoretical_framework"}, {"score": 0.0034165310204389682, "phrase": "franchising_context"}, {"score": 0.003360464999544279, "phrase": "franchisee_use"}, {"score": 0.0026543514413663893, "phrase": "primary_and_secondary_data"}, {"score": 0.0023346234464901978, "phrase": "empirical_support"}, {"score": 0.002258546887303777, "phrase": "underlying_learning_mechanisms-outcomes_framework"}, {"score": 0.0021669202726173928, "phrase": "statistical_method"}, {"score": 0.0021049977753042253, "phrase": "theoretical_contributions"}], "paper_keywords": ["IT use", " organizational learning", " knowledge transfer effectiveness", " absorptive capacity", " IT value", " franchising"], "paper_abstract": "This study aims to contribute to the literature through the theoretical development and empirical investigation of the role of information technology use in organizational learning. We develop a theoretical framework that unpacks organizational learning into mechanisms and outcomes. The outcomes of organizational learning are distinguished at two levels: first-order and second-order. Based on the framework, we propose a research model set in the franchising context. We conceptualize franchisee use of IT provided by the franchisor as an important learning mechanism that impacts knowledge transfer effectiveness (first-order outcome) and absorptive capacity (second-order outcome). Further, the influence of IT use on financial performance is mediated through absorptive capacity. The model was tested on a sample of 783 independently owned real-estate franchisees using a comprehensive dataset comprised of primary and secondary data. The results indicate that IT use is an important learning mechanism for franchisees by impacting knowledge transfer effectiveness and absorptive capacity. In turn, absorptive capacity mediates the relationship between IT use and financial performance. The empirical support for the research model serves to affirm the underlying learning mechanisms-outcomes framework. The results are stable across the choice of statistical method and the operationalization of financial performance. Theoretical contributions, implications for practice, and limitations of the study are discussed.", "paper_title": "INFORMATION TECHNOLOGY USE AS A LEARNING MECHANISM: THE IMPACT OF IT USE ON KNOWLEDGE TRANSFER EFFECTIVENESS, ABSORPTIVE CAPACITY, AND FRANCHISEE PERFORMANCE", "paper_id": "WOS:000365390600006"}