{"auto_keywords": [{"score": 0.041947888026124834, "phrase": "original_dataset"}, {"score": 0.00481495049065317, "phrase": "data_abstraction_quality"}, {"score": 0.004762893197005439, "phrase": "multiresolution_visualizations"}, {"score": 0.0047113960612140335, "phrase": "data_abstraction_techniques"}, {"score": 0.0045850648862091085, "phrase": "multiresolution_visualization_systems"}, {"score": 0.0045108906244892165, "phrase": "visual_clutter"}, {"score": 0.004068087482412997, "phrase": "abstracted_data"}, {"score": 0.0031845067058084613, "phrase": "xmdvtool"}, {"score": 0.0030157628075954588, "phrase": "multivariate_data_analysis"}, {"score": 0.002719325177422626, "phrase": "data_abstraction_level"}, {"score": 0.002675252546913683, "phrase": "selected_regions"}, {"score": 0.0026033756286033285, "phrase": "acceptable_data_abstraction_quality_level"}, {"score": 0.0024653491388223546, "phrase": "optimal_data_abstraction_level"}, {"score": 0.0023730978395564116, "phrase": "different_abstraction_methods"}, {"score": 0.00217496508306238, "phrase": "abstraction_method"}], "paper_keywords": ["metrics", " clustering", " sampling", " multiresolution visualization"], "paper_abstract": "Data abstraction techniques are widely used in multiresolution visualization systems to reduce visual clutter and facilitate analysis from overview to detail. However, analysts are usually unaware of how well the abstracted data represent the original dataset, which can impact the reliability of results gleaned from the abstractions. In this paper, we define two data abstraction quality measures for computing the degree to which the abstraction conveys the original dataset: the Histogram Difference Measure and the Nearest Neighbor Measure. They have been integrated within XmdvTool, a public-domain multiresolution visualization system for multivariate data analysis that supports sampling as well as clustering to simplify data. Several interactive operations are provided, including adjusting the data abstraction level, changing selected regions, and setting the acceptable data abstraction quality level. Conducting these operations, analysts can select an optimal data abstraction level. Also, analysts can compare different abstraction methods using the measures to see how well relative data density and outliers are maintained, and then select an abstraction method that meets the requirement of their analytic tasks.", "paper_title": "Measuring data abstraction quality in multiresolution visualizations", "paper_id": "WOS:000241383300008"}