{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "surgical_simulation"}, {"score": 0.013465775470054765, "phrase": "mesh_generators"}, {"score": 0.004666756595735701, "phrase": "common_practice"}, {"score": 0.004211069233133584, "phrase": "different_physically_based_modelling_schemes"}, {"score": 0.0039380388343479384, "phrase": "segmented_anatomical_volumes"}, {"score": 0.0038855864345030563, "phrase": "mesh_generation_scheme"}, {"score": 0.0038167308978417306, "phrase": "unique_attributes"}, {"score": 0.0036173729405604674, "phrase": "mesh_generator"}, {"score": 0.003278447235176855, "phrase": "good_approximation"}, {"score": 0.0031071175640144943, "phrase": "computation_time"}, {"score": 0.0030248298759040695, "phrase": "real-time_interaction"}, {"score": 0.0027659126653647712, "phrase": "authors_knowledge"}, {"score": 0.002451088210833819, "phrase": "six_mesh_generators"}, {"score": 0.002418393046947528, "phrase": "surgical_simulation_scenario"}, {"score": 0.0023437863565921053, "phrase": "simulation_precision"}, {"score": 0.002241171326888997, "phrase": "high-resolution_reference"}, {"score": 0.0021049977753042253, "phrase": "different_levels"}], "paper_keywords": ["mesh generation", " FEA", " soft-body deformation", " validation"], "paper_abstract": "In surgical simulation, it is common practice to use tetrahedral meshes as models for anatomy. These meshes are versatile, and can be used with a number of different physically based modelling schemes. A variety of mesh generators are available that can automatically create tetrahedral meshes from segmented anatomical volumes. Each mesh generation scheme offers its own set of unique attributes. However, few are readily available. When choosing a mesh generator for simulation, it is critical for it to output good-quality, patient-specific meshes that provide a good approximation of the shape or volume to be modelled. To keep computation time within the bounds required for real-time interaction, there is also a limit imposed on the number of elements in the mesh generated. To the authors knowledge, there has been little work directly assessing the suitability of mesh generators for surgical simulation. This paper seeks to address this issue by assessing the use of six mesh generators in a surgical simulation scenario, and examining how they affect simulation precision. This paper aims to perform these comparisons against high-resolution reference meshes, where we examine the precision of meshes from the same mesh generator at different levels of complexity.", "paper_title": "A quantitative assessment of approaches to mesh generation for surgical simulation", "paper_id": "WOS:000257487600006"}