{"auto_keywords": [{"score": 0.04356788089023987, "phrase": "next_miss"}, {"score": 0.026294114587046957, "phrase": "stream_buffers"}, {"score": 0.0235590662448501, "phrase": "markov"}, {"score": 0.00481495049065317, "phrase": "two-phase_prediction"}, {"score": 0.0046875099587735825, "phrase": "hardware_prefetching_schemes"}, {"score": 0.0038846843242954935, "phrase": "appropriate_time"}, {"score": 0.003741371936431574, "phrase": "substantial_amount"}, {"score": 0.003701401653850141, "phrase": "hardware_storage"}, {"score": 0.0034148795808317555, "phrase": "program_flow"}, {"score": 0.0028293966058473476, "phrase": "general_prefetching_framework"}, {"score": 0.0025409639091476363, "phrase": "tpp_algorithm"}, {"score": 0.0025003054002226965, "phrase": "latest_variant"}, {"score": 0.002447101794397243, "phrase": "markov_predictor"}, {"score": 0.0024209250169088575, "phrase": "spec_cpu"}, {"score": 0.0022941723937662927, "phrase": "tpp_approach"}, {"score": 0.0021049977753042253, "phrase": "tpp_prefetches"}], "paper_keywords": [""], "paper_abstract": "Hardware prefetching schemes which divide the misses into streams are generally preferred to other hardware based schemes. But, as they do not know when the next miss of a stream happens, they cannot prefetch a block in appropriate time. Some of them use a substantial amount of hardware storage to keep the predicted miss blocks from all streams. The other approaches follow the program flow and prefetch all target addresses including those blocks which already exist in the L1 data cache. The approach presented predicts the stream of next miss and then prefetches only the next miss address of the stream. It offers a general prefetching framework, two-phase prediction algorithm (TPP), that lets each stream have its own address predictor. Comparing the TPP algorithm with the latest variant of stream buffers and Markov predictor using SPEC CPU 2000 benchmarks shows that in average (1) the TPP approach has 18% speedup compared to 1% speedup in Markov and 0.05% in stream buffers. (2) 78% of the TPP prefetches have been useful, whereas in stream buffers and Markov, only 18% and 24% of them were useful, respectively.", "paper_title": "Two-phase prediction of L1 data cache misses", "paper_id": "WOS:000242886900002"}