{"auto_keywords": [{"score": 0.037295397035480335, "phrase": "classification_rule"}, {"score": 0.00942652157518596, "phrase": "rejection_region"}, {"score": 0.00481495049065317, "phrase": "gene_expression_data"}, {"score": 0.0047135086583390585, "phrase": "classification_methods"}, {"score": 0.004219321533320583, "phrase": "separating_hyperplane"}, {"score": 0.0041835168653521, "phrase": "linear_classification"}, {"score": 0.004130376386308024, "phrase": "medical_applications"}, {"score": 0.00387459052649752, "phrase": "sufficiently_high_degree"}, {"score": 0.0037128955884188773, "phrase": "decent_accuracy"}, {"score": 0.003239304090565123, "phrase": "smallest_error_rate"}, {"score": 0.0030127172247606812, "phrase": "desired_risk"}, {"score": 0.002838033152426417, "phrase": "feature_space"}, {"score": 0.0025291601927956765, "phrase": "user-defined_parameter"}, {"score": 0.0023221983158528163, "phrase": "error_rate"}, {"score": 0.0022442249871042026, "phrase": "chosen_target_error"}, {"score": 0.002159623311924437, "phrase": "feature-selection_step"}], "paper_keywords": [""], "paper_abstract": "Motivation: The classification methods typically used in bioinformatics classify all examples, even if the classification is ambiguous, for instance, when the example is close to the separating hyperplane in linear classification. For medical applications, it may be better to classify an example only when there is a sufficiently high degree of accuracy, rather than classify all examples with decent accuracy. Moreover, when all examples are classified, the classification rule has no control over the accuracy of the classifier; the algorithm just aims to produce a classifier with the smallest error rate possible. In our approach, we fix the accuracy of the classifier and thereby choose a desired risk of error. Results: Our method consists of defining a rejection region in the feature space. This region contains the examples for which classification is ambiguous. These are rejected by the classifier. The accuracy of the classifier becomes a user-defined parameter of the classification rule. The task of the classification rule is to minimize the rejection region with the constraint that the error rate of the classifier be bounded by the chosen target error. This approach is also used in the feature-selection step. The results computed on both synthetic and real data show that classifier accuracy is significantly improved.", "paper_title": "Classification with reject option in gene expression data", "paper_id": "WOS:000258860700009"}