{"auto_keywords": [{"score": 0.04675404263653011, "phrase": "mobile_advertising"}, {"score": 0.023227301113361, "phrase": "teenagers'_mobile_advertising_acceptance"}, {"score": 0.02183663283073147, "phrase": "teenagers'_attitude"}, {"score": 0.01005874462856154, "phrase": "key_drivers"}, {"score": 0.004023120753104693, "phrase": "mobile_advertising_acceptance"}, {"score": 0.0037608593980593035, "phrase": "structural_equation_modelling"}, {"score": 0.0037272031155266556, "phrase": "findings_-_findings"}, {"score": 0.0034529760173586583, "phrase": "perceived_usefulness"}, {"score": 0.003376216135716632, "phrase": "authors'_model"}, {"score": 0.0032716011062067286, "phrase": "mobile_advertisements"}, {"score": 0.0032277611129050234, "phrase": "key_factor"}, {"score": 0.003085813569061001, "phrase": "practical_implications"}, {"score": 0.003058179790439378, "phrase": "marketing_managers"}, {"score": 0.0030036501770192865, "phrase": "mobile_advertising_campaigns"}, {"score": 0.0026009105281485888, "phrase": "message_personalization"}, {"score": 0.00257760787870709, "phrase": "content_relevance"}, {"score": 0.0025316254589087973, "phrase": "sales_messages"}, {"score": 0.0025089420019955232, "phrase": "entertainment_features"}, {"score": 0.002453116398642071, "phrase": "consumer-driven_factors"}, {"score": 0.0024202176034746337, "phrase": "perceived_control"}, {"score": 0.0021049977753042253, "phrase": "cognitive_and_affective_message-driven_factors"}], "paper_keywords": ["Mobile services", " Attitudes", " Teenagers", " Irritation", " Entertainment", " Perceived usefulness"], "paper_abstract": "Purpose - The purpose of this paper is to analyse key drivers of teenagers' attitude toward mobile advertising and its effects on teenagers' mobile advertising acceptance. Design/methodology/approach - A proposed model of affective (irritation and entertainment) and cognitive (perceived usefulness) antecedents of attitude toward mobile advertising and its effects on mobile advertising acceptance is analysed. The sample consisted of 355 Spanish teenagers. The model was tested using structural equation modelling. Findings - Findings show that entertainment, irritation and usefulness are key drivers of teenagers' attitude toward mobile advertising. Moreover, perceived usefulness reduces irritation. The authors' model also suggests that improving teenagers' attitude toward mobile advertisements is a key factor for teenagers' mobile advertising acceptance. Practical implications - This research offers practical implications for marketing managers interested in targeting mobile advertising campaigns to teenagers. Marketers should take care of the number and frequency of messages being sent in order to avoid teenagers being irritated by their advertising attempts. Marketers can improve attitude through message personalization, content relevance and enriching the sales messages with entertainment features. Originality/value - While consumer-driven factors such as perceived control or trust have deserved a lot of attention, little research has focused on the role of emotions on attitude and behaviour towards mobile advertising. This paper combines the influence of cognitive and affective message-driven factors on teenagers' attitude and behaviour towards mobile advertising.", "paper_title": "Key factors of teenagers' mobile advertising acceptance", "paper_id": "WOS:000319640600007"}