{"auto_keywords": [{"score": 0.04859537978619132, "phrase": "voronoi_diagram"}, {"score": 0.004721162131188487, "phrase": "complete_description"}, {"score": 0.004521179256835894, "phrase": "general_position"}, {"score": 0.004398331355940011, "phrase": "pairwise_skew"}, {"score": 0.004278807087784626, "phrase": "common_plane"}, {"score": 0.003640938643675543, "phrase": "real_space"}, {"score": 0.003472845095323694, "phrase": "hyperbolic_paraboloid"}, {"score": 0.0031970796597571367, "phrase": "proof_technique"}, {"score": 0.003134705849154561, "phrase": "modern_tools"}, {"score": 0.0031100973266506163, "phrase": "computer_algebra"}, {"score": 0.002966438503447793, "phrase": "fundamental_properties"}, {"score": 0.0028293966058473476, "phrase": "linear_semi"}, {"score": 0.0027200305495826797, "phrase": "two-dimensional_voronoi_cell"}, {"score": 0.002445347925313158, "phrase": "connected_component"}], "paper_keywords": ["Computational geometry", " Computer algebra", " Voronoi diagram", " Medial axis", " Quadric surface intersection"], "paper_abstract": "We give a complete description of the Voronoi diagram, in R-3, of three lines in general position, that is, that are pairwise skew and not all parallel to a common plane. In particular, we show that the topology of the Voronoi diagram is invariant for three such lines. The trisector consists of four unbounded branches of either a nonsingular quartic or of a nonsingular cubic and a line that do not intersect in real space. Each cell of dimension two consists of two connected components on a hyperbolic paraboloid that are bounded, respectively, by three and one of the branches of the trisector. We introduce a proof technique which relies heavily upon modern tools of computer algebra and is of interest in its own right. This characterization yields some fundamental properties of the Voronoi diagram of three lines. In particular, we present linear semi-algebraic tests for separating the two connected components of each two-dimensional Voronoi cell and for separating the four connected components of the trisector. This enables us to answer queries of the form, given a point, determine in which connected component of which cell it lies. We also show that the arcs of the trisector are monotonic in some direction. These properties imply that points on the trisector of three lines can be sorted along each branch using only linear semi-algebraic tests.", "paper_title": "The Voronoi Diagram of Three Lines", "paper_id": "WOS:000266240300006"}