{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "retrieval_-_robust_classification"}, {"score": 0.004543193737836748, "phrase": "soundtrack_indexing"}, {"score": 0.004484908028307205, "phrase": "multimedia_documents"}, {"score": 0.0042591158963728665, "phrase": "sound_unity"}, {"score": 0.00415050117148714, "phrase": "audio_dataflow"}, {"score": 0.00409723267214392, "phrase": "program_broadcasts"}, {"score": 0.0032259472087775138, "phrase": "forward-backward_divergence_algorithm"}, {"score": 0.0025892330566358503, "phrase": "speech_detection"}, {"score": 0.0025230952890994236, "phrase": "music_detection"}, {"score": 0.0023346234464901978, "phrase": "euclidean_distance"}, {"score": 0.0022897425998475362, "phrase": "spectral_domain"}, {"score": 0.0022312377180023282, "phrase": "audio_data_flow"}], "paper_keywords": ["classification", " indexing", " audio documents", " jingle", " segmentation", " duration", " entropy", " energy", " spectral feature"], "paper_abstract": "This work addresses the soundtrack indexing of multimedia documents. Our purpose is to detect and locate sound unity to structure the audio dataflow in program broadcasts (reports). We present two audio classification tools that we have developed. The first one, a speech music classification tool, is based on three original features: entropy modulation, stationary segment duration (with a Forward-Backward Divergence algorithm) and number of segments. They are merged with the classical 4 Hz modulation energy. It is divided into two classifications (speech/non-speech and music/non-music) and provides more than 90% of accuracy for speech detection and 89% for music detection. The other system, a jingle identification tool, uses an Euclidean distance in the spectral domain to index the audio data flow. Results show that is efficient: among 132 jingles to recognize, we have detected 130. Systems are tested on TV and radio corpora (more than 10 h). They are simple, robust and can be improved on every corpus without training or adaptation.", "paper_title": "Audio indexing: primary components retrieval - Robust classification in audio documents", "paper_id": "WOS:000240913200006"}