{"auto_keywords": [{"score": 0.049242444125261964, "phrase": "unreliable_wireless_channels"}, {"score": 0.04726673405217005, "phrase": "wireless_networks"}, {"score": 0.04658758200735744, "phrase": "real-time_flows"}, {"score": 0.03541017681763721, "phrase": "throughput_requirements"}, {"score": 0.02561119884362787, "phrase": "bidding_game"}, {"score": 0.025234962742982127, "phrase": "access_point"}, {"score": 0.00481495049065317, "phrase": "hard_delay_constraints"}, {"score": 0.004754691808174481, "phrase": "real-time_communication"}, {"score": 0.00464811139983244, "phrase": "recent_work"}, {"score": 0.004419703921314433, "phrase": "queueing_systems_perspective"}, {"score": 0.004331501320993783, "phrase": "single-server_problems"}, {"score": 0.004036369952624852, "phrase": "first_such_issues"}, {"score": 0.003916098498242888, "phrase": "server's_schedule"}, {"score": 0.0038475956342813936, "phrase": "utility_function"}, {"score": 0.0038186039088445524, "phrase": "departure_rates"}, {"score": 0.0037898298056558673, "phrase": "customer_classes"}, {"score": 0.0036216653011600514, "phrase": "delay_guarantees"}, {"score": 0.003540392285585644, "phrase": "wireless_transmissions"}, {"score": 0.0034348484776384643, "phrase": "delay_bounds"}, {"score": 0.0032906739990650087, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0032494292163722065, "phrase": "client_requirements"}, {"score": 0.003128761109107491, "phrase": "new_features"}, {"score": 0.003113013222438078, "phrase": "unavoidable_idle_times"}, {"score": 0.0026221200591873056, "phrase": "hard_delay_bounds"}, {"score": 0.0025761937402886954, "phrase": "utility_maximization_problem"}, {"score": 0.0025567574701785686, "phrase": "client_utilities"}, {"score": 0.00232286335198363, "phrase": "centralized_scheduler"}, {"score": 0.0022308855951521404, "phrase": "simple_selfish_optimization"}, {"score": 0.0021479597698614373, "phrase": "simple_on-line_scheduling_policy"}, {"score": 0.0021049977753042253, "phrase": "channel_reliabilities"}], "paper_keywords": ["Delays", " Real-time networks", " Wireless networks", " Admission control", " Scheduling", " Utility maximization", " Network utility maximization"], "paper_abstract": "We provide an account of recent work that formulates and addresses problems that arise when employing wireless networks to serve clients that generate real-time flows. From a queueing systems perspective, these problems can be described as single-server problems where there are several customer classes. Customers balk when their delay exceeds a threshold. There are a range of issues that are of interest. One of the first such issues is to determine what throughput rate vectors are feasible, and to determine the server's schedule. Another is to maximize a utility function of the departure rates of the customer classes. Real-time flows have a delay bound for each of their packets. It is particularly challenging to provide delay guarantees for real-time flows in wireless networks since wireless transmissions are unreliable. We propose a model that jointly considers the delay bounds of packets, the unreliable wireless channels, and the throughput requirements of clients. We then determine the necessary and sufficient condition for feasibility of the client requirements. The analysis and condition are interesting since this problem gives rise to some new features concerning unavoidable idle times in a system. We further derive an efficient, nearly linear time algorithm for admission control, which precisely determines whether it is feasible to fulfill the requirements of all clients in the system. We also propose two on-line scheduling policies and prove that they can fulfill the requirements of all clients whenever that is feasible. We next turn to the scenario where the throughput requirements of clients are elastic, but with hard delay bounds. We formulate this as a utility maximization problem, where client utilities are based on their throughputs. We decompose this problem into two subproblems, and show that this decomposition can be naturally implemented as a bidding game among all clients and the access point, which plays the role of a centralized scheduler. In the bidding game, the strategy of each client is to carry out a simple selfish optimization. We show that the strategy of the access point can be implemented by a simple on-line scheduling policy. A surprising result is that the channel reliabilities need not be known a priori.", "paper_title": "Queueing systems with hard delay constraints: a framework for real-time communication over unreliable wireless channels", "paper_id": "WOS:000304696200008"}