{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "glycogen_synthase_kinase"}, {"score": 0.015448758509906459, "phrase": "cyclin-dependent_kinase"}, {"score": 0.015116518652071979, "phrase": "free-energy_calculations"}, {"score": 0.004669085371587273, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004448705308279165, "phrase": "attractive_target"}, {"score": 0.004183137595671171, "phrase": "effective_inhibitors"}, {"score": 0.004003169429008801, "phrase": "challenging_task"}, {"score": 0.003916098498242888, "phrase": "protein_kinases"}, {"score": 0.0038818006513785977, "phrase": "especially_cyclin-dependent_kinases"}, {"score": 0.003477505397536663, "phrase": "sequence_alignment"}, {"score": 0.0033572130837348623, "phrase": "free-energy_decomposition_analysis"}, {"score": 0.002903311792572216, "phrase": "potent_selective_inhibitors"}, {"score": 0.0022687189700002254, "phrase": "minor_effect"}, {"score": 0.0021049977753042253, "phrase": "specific_paullone_inhibitors"}], "paper_keywords": ["Glycogen synthase kinase 3", " Cyclin-dependent kinase 5", " Paullones", " Selectivity", " Molecular dynamics simulation", " Binding free energy"], "paper_abstract": "Glycogen synthase kinase 3 (GSK-3) is an attractive target for the treatment of diabetes, and paullones have been reported to be effective inhibitors of GSK-3. However, it is still a challenging task to improve selectivity among protein kinases, especially cyclin-dependent kinases (CDKs). Here we investigated the mechanism that enables paullones to selectively inhibit GSK-3 rather than cyclin-dependent kinase 5 (CDK5) using sequence alignment, molecular dynamics simulations, free-energy calculations and free-energy decomposition analysis. The results indicate that the interaction between paullones and Val135 of GSK-3 is obviously stronger than that between paullones and Cys83 of CDK5, suggesting that paullones could be utilized as potent selective inhibitors. Meanwhile, we observed that the decrease in the interaction between paullones and the Asp86 of CDK5 favors their selectivity towards GSK-3 rather than CDK5, as demonstrated using 1-azakenpaullone as an example. Although substitution at position 9 and replacement at position 2 may influence the activity of GSK-3, they only have a minor effect on the selectivity. We expect that the information obtained here could prove useful for developing specific paullone inhibitors of GSK-3.", "paper_title": "Studying the mechanism that enables paullones to selectively inhibit glycogen synthase kinase 3 rather than cyclin-dependent kinase 5 by molecular dynamics simulations and free-energy calculations", "paper_id": "WOS:000289531300017"}