{"auto_keywords": [{"score": 0.0495290999002817, "phrase": "skin_detection"}, {"score": 0.015719716506582538, "phrase": "dempster-shafer_theory"}, {"score": 0.0047185649878632475, "phrase": "important_step"}, {"score": 0.004677847043645765, "phrase": "wide_range"}, {"score": 0.00461075951152053, "phrase": "computer_vision"}, {"score": 0.004314285113050873, "phrase": "accuracy_and_reliability_problems"}, {"score": 0.004167218012926657, "phrase": "different_conditions"}, {"score": 0.003967379852781603, "phrase": "long_training_times"}, {"score": 0.003899151860479525, "phrase": "parameter_tuning"}, {"score": 0.0036694287631595995, "phrase": "accurate_threshold_settings"}, {"score": 0.0036377310474678547, "phrase": "desirable_performance"}, {"score": 0.003554531289427866, "phrase": "available_training_data"}, {"score": 0.0033741997276290356, "phrase": "robust_fusion_framework"}, {"score": 0.0033450437338616596, "phrase": "available_information_sources"}, {"score": 0.003202987495080647, "phrase": "fusion-based_method"}, {"score": 0.0031845067058084583, "phrase": "dempster-shafer-based"}, {"score": 0.0031026497891826726, "phrase": "six_prominent_skin_detection_criteria"}, {"score": 0.002787591531872224, "phrase": "powerful_and_flexible_framework"}, {"score": 0.00273167822885383, "phrase": "available_information"}, {"score": 0.0025336179740814905, "phrase": "large_dataset"}, {"score": 0.002398002835752193, "phrase": "dssd"}, {"score": 0.002276210060619432, "phrase": "best_result"}, {"score": 0.0022499947003073654, "phrase": "bayesian_classifier"}, {"score": 0.0021857667493036786, "phrase": "generalized_dssd"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Dempster-Shafer theory of evidence", " Image processing", " Pattern recognition", " Skin detection"], "paper_abstract": "Skin detection is an important step for a wide range of research related to computer vision and image processing and several methods have already been proposed to solve this problem. However, most of these methods suffer from accuracy and reliability problems when they are applied to a variety of images obtained under different conditions. Performance degrades further when fewer training data are available. Besides these issues, some methods require long training times and a significant amount of parameter tuning. Furthermore, most state-of-the-art methods incorporate one or more thresholds, and it is difficult to determine accurate threshold settings to obtain desirable performance. These problems arise mostly because the available training data for skin detection are imprecise and incomplete, which leads to uncertainty in classification. This requires a robust fusion framework to combine available information sources with some degree of certainty. This paper addresses these issues by proposing a fusion-based method termed Dempster-Shafer-based Skin Detection (DSSD). This method uses six prominent skin detection criteria as sources of information (Sol), quantifies their reliabilities (confidences), and then combines their confidences based on the Dempster-Shafer Theory (DST) of evidence. We use the DST as it offers a powerful and flexible framework for representing and handling uncertainties in available information and thus helps to overcome the limitations of the current state-of-the-art methods. We have verified this method on a large dataset containing a variety of images, and achieved a 90.17% correct detection rate (CDR). We also demonstrate how DSSD can be used when very little training data are available, achieving a CDR as high as 87.47% while the best result achieved by a Bayesian classifier is only 68.81% on the same dataset. Finally, a generalized DSSD (GDSSD) is proposed achieving 91.12% CDR. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A skin detection approach based on the Dempster-Shafer theory of evidence", "paper_id": "WOS:000302970000015"}