{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aqua"}, {"score": 0.010301184919265413, "phrase": "question_answering_services"}, {"score": 0.004535124351828787, "phrase": "aqua_software_architecture"}, {"score": 0.004271490815763164, "phrase": "hybrid_system"}, {"score": 0.004120694410890683, "phrase": "closed-domain_and_open-domain_question_answering_system"}, {"score": 0.003927848423072668, "phrase": "incrementally_software_components"}, {"score": 0.0037664981403399064, "phrase": "intensive_use"}, {"score": 0.0035051129798529, "phrase": "important_component"}, {"score": 0.0034016119212097826, "phrase": "similarity_algorithm"}, {"score": 0.0028758391869611374, "phrase": "similarity_algorithms"}, {"score": 0.0027246967293115343, "phrase": "software_agents"}, {"score": 0.002143247921132179, "phrase": "academic_and_bibliographic_ontologies"}, {"score": 0.0021049977753042253, "phrase": "ontology_alignment_evaluation_initiative"}], "paper_keywords": [""], "paper_abstract": "This study describes AQUA software architecture for question answering services. AQUA has been designed as a hybrid system which can be used as closed-domain and open-domain question answering system. The software platform offers flexibility as incrementally software components can be added. AQUA makes intensive use of ontologies in several parts of the question answering system. An important component of AQUA is the similarity algorithm which is used to find similarities between relations and concepts in a query and classes and properties in ontologies. Furthermore, the authors have modified the similarity algorithms so that they can deal with several opinions of software agents and then combine the evidences found by each of the agent. In addition, uncertainty has been considered as uncertainty is always present when similarity is assessed. Finally, a case of study and an evaluation using academic and bibliographic ontologies from the ontology alignment evaluation initiative is presented.", "paper_title": "AQUA: hybrid architecture for question answering services", "paper_id": "WOS:000284688500006"}