{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_space"}, {"score": 0.005627261091478627, "phrase": "transfer_function"}, {"score": 0.00470862827326028, "phrase": "volumetric_transfer_function_generation"}, {"score": 0.004643366854108453, "phrase": "multi-dimensional_transfer_functions"}, {"score": 0.004502943680955863, "phrase": "effective_means"}, {"score": 0.00409508755819924, "phrase": "value_gradient_magnitude"}, {"score": 0.003808209866576388, "phrase": "voxel_distributions"}, {"score": 0.003724034990158436, "phrase": "interactive_widgets"}, {"score": 0.003531474887552889, "phrase": "trial-and-error_approach"}, {"score": 0.0034630606658026595, "phrase": "feature_space_map"}, {"score": 0.0033864888703414903, "phrase": "volumetric_space"}, {"score": 0.0032839503822188563, "phrase": "non-parametric_clustering"}, {"score": 0.003256526411907174, "phrase": "transfer_function_feature_space"}, {"score": 0.0031934216158787344, "phrase": "guide_transfer_function_generation"}, {"score": 0.0031490944606172152, "phrase": "non-parametric_kernel_density_estimation"}, {"score": 0.0031053806836154655, "phrase": "similar_features"}, {"score": 0.002895721231882758, "phrase": "binned_regions"}, {"score": 0.0028715299874549245, "phrase": "feature_boundaries"}, {"score": 0.0027690086059100495, "phrase": "temporal_volumetric_data"}, {"score": 0.0027001785756267426, "phrase": "histogram_volume"}, {"score": 0.002263861731320045, "phrase": "enhanced_exploration"}, {"score": 0.002189105604712615, "phrase": "initial_transfer_function_generation"}, {"score": 0.002164738347530834, "phrase": "reasonable_base"}, {"score": 0.0021526564019119466, "phrase": "volumetric_rendering"}, {"score": 0.002128694000627911, "phrase": "trial-and-error_overhead"}, {"score": 0.0021049977753042253, "phrase": "transfer_function_design"}], "paper_keywords": ["Volume rendering", " kernel density estimation", " transfer function design", " temporal volume rendering"], "paper_abstract": "The use of multi-dimensional transfer functions for direct volume rendering has been shown to be an effective means of extracting materials and their boundaries for both scalar and multivariate data. The most common multi-dimensional transfer function consists of a two-dimensional (2D) histogram with axes representing a subset of the feature space (e.g., value vs. value gradient magnitude), with each entry in the 2D histogram being the number of voxels at a given feature space pair. Users then assign color and opacity to the voxel distributions within the given feature space through the use of interactive widgets (e.g., box, circular, triangular selection). Unfortunately, such tools lead users through a trial-and-error approach as they assess which data values within the feature space map to a given area of interest within the volumetric space. In this work, we propose the addition of non-parametric clustering within the transfer function feature space in order to extract patterns and guide transfer function generation. We apply a non-parametric kernel density estimation to group voxels of similar features within the 2D histogram. These groups are then binned and colored based on their estimated density, and the user may interactively grow and shrink the binned regions to explore feature boundaries and extract regions of interest. We also extend this scheme to temporal volumetric data in which time steps of 2D histograms are composited into a histogram volume. A three-dimensional (3D) density estimation is then applied, and users can explore regions within the feature space across time without adjusting the transfer function at each time step. Our work enables users to effectively explore the structures found within a feature space of the volume and provide a context in which the user can understand how these structures relate to their volumetric data. We provide tools for enhanced exploration and manipulation of the transfer function, and we show that the initial transfer function generation serves as a reasonable base for volumetric rendering, reducing the trial-and-error overhead typically found in transfer function design.", "paper_title": "Structuring Feature Space: A Non-Parametric Method for Volumetric Transfer Function Generation", "paper_id": "WOS:000270778900079"}