{"auto_keywords": [{"score": 0.038683991523240216, "phrase": "yloc"}, {"score": 0.010324394795290699, "phrase": "protein_subcellular_localization"}, {"score": 0.008890862846128023, "phrase": "multiple_locations"}, {"score": 0.007068247532180824, "phrase": "subcellular_localization"}, {"score": 0.00481495049065317, "phrase": "why-interpretable_prediction"}, {"score": 0.004573748810476845, "phrase": "protein's_function"}, {"score": 0.00453772385360173, "phrase": "computational_prediction"}, {"score": 0.00443133501650381, "phrase": "viable_alternative"}, {"score": 0.004396426822203258, "phrase": "experimental_approaches"}, {"score": 0.004344577216137524, "phrase": "current_machine_learning-based_methods"}, {"score": 0.0036217089991592275, "phrase": "relevant_features"}, {"score": 0.0035789632444741056, "phrase": "protein_sequence"}, {"score": 0.003508834578859094, "phrase": "e.g._localization_signals"}, {"score": 0.0032546105164772995, "phrase": "protein_localization"}, {"score": 0.0029246121262946384, "phrase": "confidence_estimate"}, {"score": 0.002669959049383929, "phrase": "probabilistic_approach"}, {"score": 0.002596937660779953, "phrase": "dual-targeted_proteins"}, {"score": 0.0023427323356117365, "phrase": "-the-art_predictors"}, {"score": 0.0023150468182777813, "phrase": "low-confidence_predictions"}, {"score": 0.0022696277881969896, "phrase": "prediction_accuracies"}, {"score": 0.0021049977753042253, "phrase": "best_predictors"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein subcellular localization is pivotal in understanding a protein's function. Computational prediction of subcellular localization has become a viable alternative to experimental approaches. While current machine learning-based methods yield good prediction accuracy, most of them suffer from two key problems: lack of interpretability and dealing with multiple locations. Results: We present YLoc, a novel method for predicting protein subcellular localization that addresses these issues. Due to its simple architecture, YLoc can identify the relevant features of a protein sequence contributing to its subcellular localization, e.g. localization signals or motifs relevant to protein sorting. We present several example applications where YLoc identifies the sequence features responsible for protein localization, and thus reveals not only to which location a protein is transported to, but also why it is transported there. YLoc also provides a confidence estimate for the prediction. Thus, the user can decide what level of error is acceptable for a prediction. Due to a probabilistic approach and the use of several thousands of dual-targeted proteins, YLoc is able to predict multiple locations per protein. YLoc was benchmarked using several independent datasets for protein subcellular localization and performs on par with other state-of-the-art predictors. Disregarding low-confidence predictions, YLoc can achieve prediction accuracies of over 90%. Moreover, we show that YLoc is able to reliably predict multiple locations and outperforms the best predictors in this area.", "paper_title": "Going from where to why-interpretable prediction of protein subcellular localization", "paper_id": "WOS:000277225400015"}