{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatio-temporal_aggregates"}, {"score": 0.04141365795578276, "phrase": "parking_space"}, {"score": 0.004635701867952543, "phrase": "data_aggregation"}, {"score": 0.004596779715291598, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.003850566273995209, "phrase": "non-functioning_brake_lights"}, {"score": 0.0033926758710459866, "phrase": "flajolet-martin_sketches"}, {"score": 0.003117986133774198, "phrase": "additional_knowledge"}, {"score": 0.002853396755102163, "phrase": "global_demand"}, {"score": 0.0027123819773059127, "phrase": "vehicle_level"}, {"score": 0.002600194073758015, "phrase": "extensive_experimental_evaluation"}, {"score": 0.0025137856138000014, "phrase": "available_parking_space"}, {"score": 0.0021228663458966813, "phrase": "bounded_time"}, {"score": 0.0021049977753042253, "phrase": "congested_situations"}], "paper_keywords": ["Vehicular ad hoc networks", " information sharing", " spatio-temporal data aggregation", " Flajolet-Martin sketches", " communication protocols"], "paper_abstract": "This article focuses on data aggregation in vehicular ad hoc networks (VANETs). In such networks, data produced by sensors or crowdsourcers are exchanged between vehicles in order to warn or inform drivers when an event occurs (e.g., an accident, a traffic congestion, a parking space released, a vehicle with non-functioning brake lights, etc.). In the following, we propose to generate spatio-temporal aggregates containing these data in order to keep a summary of past events. We therefore use Flajolet-Martin sketches. Our goal is then to exploit these aggregates to better assist the drivers. These aggregates may indeed produce additional knowledge that may be useful when no event has been recently transmitted by surrounding vehicles or when some knowledge about the global demand may improve the decision that need to be taken at the vehicle level. To prove the effectiveness of our approach, an extensive experimental evaluation has been performed considering vehicles looking for an available parking space, that proves the interest of our proposal. The experimentations indeed show that the use of our aggregation structure significantly reduces the time needed to actually find a parking space. It also increases the percentage of vehicles finding such a resource in a bounded time in congested situations.", "paper_title": "Building, sharing and exploiting spatio-temporal aggregates in vehicular networks", "paper_id": "WOS:000338214000002"}