{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planar_graphs"}, {"score": 0.021821812147013744, "phrase": "sparse_covers"}, {"score": 0.010307358526318167, "phrase": "fixed_minor"}, {"score": 0.0036434002236454305, "phrase": "n_node_graph"}, {"score": 0.003520687960750365, "phrase": "fixed_size"}, {"score": 0.00311510526624626, "phrase": "significant_improvement"}, {"score": 0.0030847461428168614, "phrase": "previous_results"}, {"score": 0.0027159094186967247, "phrase": "degree_polynomial"}, {"score": 0.0026115277372906805, "phrase": "recursive_application"}, {"score": 0.002573424607574822, "phrase": "basic_routine"}, {"score": 0.0024264776194357993, "phrase": "novel_approach"}, {"score": 0.002287902310873394, "phrase": "distributed_computing"}, {"score": 0.002254510319372956, "phrase": "compact_routing"}, {"score": 0.002232519579957707, "phrase": "distributed_directories"}, {"score": 0.0021784745589727246, "phrase": "universal_tsp"}], "paper_keywords": ["Shortest path clustering"], "paper_abstract": "We consider the construction of sparse covers for planar graphs and other graphs that exclude a fixed minor. We present an algorithm that gives a cover for the gamma-neighborhood of each node. For planar graphs, the cover has radius less than 16 gamma and degree no more than 18. For every n node graph that excludes a minor of a fixed size, we present an algorithm that yields a cover with radius no more than 4 gamma and degree O(logn). This is a significant improvement over previous results for planar graphs and for graphs excluding a fixed minor; in order to obtain clusters with radius O(gamma), it was required to have the degree polynomial in n. Our algorithms are based on a recursive application of a basic routine called shortest-path clustering, which seems to be a novel approach to the construction of sparse covers. Since sparse covers have many applications in distributed computing, including compact routing, distributed directories, synchronizers, and Universal TSP, our improved cover construction results in improved algorithms for all these problems, for the class of graphs that exclude a fixed minor.", "paper_title": "Sparse Covers for Planar Graphs and Graphs that Exclude a Fixed Minor", "paper_id": "WOS:000335752000009"}