{"auto_keywords": [{"score": 0.03640248876579581, "phrase": "open_cultural_data"}, {"score": 0.031078477630968965, "phrase": "glam_sector"}, {"score": 0.02540191112108119, "phrase": "cultural_and_heritage_sector"}, {"score": 0.00481495049065317, "phrase": "open_digitised_cultural_content"}, {"score": 0.004627441072541506, "phrase": "cultural_and_heritage_content"}, {"score": 0.0045726187330434025, "phrase": "open_access_movement"}, {"score": 0.00450052670755585, "phrase": "increasingly_open_licensing"}, {"score": 0.0044826811976193485, "phrase": "digital_cultural_heritage_content"}, {"score": 0.004325208730208653, "phrase": "cultural_heritage_materials"}, {"score": 0.004231699728933577, "phrase": "scoping_review"}, {"score": 0.004206548500039536, "phrase": "current_digitisation_licensing_climate"}, {"score": 0.004148439687406408, "phrase": "ongoing_research_projects"}, {"score": 0.004131984479868163, "phrase": "recent_writings"}, {"score": 0.0041155942738335775, "phrase": "open_access"}, {"score": 0.0039709657945426816, "phrase": "digital_heritage"}, {"score": 0.0038390240716280302, "phrase": "digital_information_environment"}, {"score": 0.0037188360359702182, "phrase": "digital_data"}, {"score": 0.003696721710858647, "phrase": "new_advances"}, {"score": 0.0035104707931300095, "phrase": "openly_available_cultural_and_heritage_content"}, {"score": 0.0033735897354686545, "phrase": "open_and_accessible_manner"}, {"score": 0.003307157207720997, "phrase": "information_sources"}, {"score": 0.003287482882222731, "phrase": "resource_discovery"}, {"score": 0.0032420286098144885, "phrase": "high-performance_computing_facilities"}, {"score": 0.0032035667391280857, "phrase": "large_amounts"}, {"score": 0.0027704982687041147, "phrase": "open_and_reusable_fashion"}, {"score": 0.0026997429073195326, "phrase": "open_cultural_and_heritage_materials"}, {"score": 0.002636030937285069, "phrase": "social_implications"}, {"score": 0.00260473954492863, "phrase": "high-quality_oa_resources"}, {"score": 0.0025892330566358503, "phrase": "cultural_heritage_sector"}, {"score": 0.0025635932512667456, "phrase": "richer_research_environment"}, {"score": 0.0024488738006005133, "phrase": "first_time"}, {"score": 0.002419798694301991, "phrase": "current_state"}, {"score": 0.0022931641984344085, "phrase": "social_and_historical_sciences"}, {"score": 0.0022168460543913787, "phrase": "cultural_heritage_content"}, {"score": 0.002190519728921395, "phrase": "institutional_repositories"}, {"score": 0.0021218313648947926, "phrase": "position_paper"}, {"score": 0.0021049977753042253, "phrase": "open_data_agenda"}], "paper_keywords": ["Digitization", " Culture", " Heritage", " Open Access", " Digital imaging"], "paper_abstract": "Purpose - The purpose of this paper is to situate the activity of digitisation to increase access to cultural and heritage content alongside the objectives of the Open Access Movement (OAM). It demonstrates that increasingly open licensing of digital cultural heritage content is creating opportunities for researchers in the arts and humanities for both access to and analysis of cultural heritage materials. Design/methodology/approach - The paper is primarily a literature and scoping review of the current digitisation licensing climate, using and embedding examples from ongoing research projects and recent writings on Open Access (OA) and digitisation to highlight both opportunities and barriers to the creation and use of digital heritage content from galleries, libraries, archives and museums (GLAM). Findings - The digital information environment in which digitised content is created and delivered has changed phenomenally, allowing the sharing and reuse of digital data and encouraging new advances in research across the sector, although issues of licensing persist. There remain further opportunities for understanding how to: study use and users of openly available cultural and heritage content; disseminate and encourage the uptake of open cultural data; persuade other institutions to contribute their data into the commons in an open and accessible manner; build aggregation and search facilities to link across information sources to allow resource discovery; and how best to use high-performance computing facilities to analyse and process the large amounts of data the author is now seeing being made available throughout the sector. Research limitations/implications - It is hoped that by pulling together this discussion, the benefits to making material openly available have been made clear, encouraging others in the GLAM sector to consider making their collections openly available for reuse and repurposing. Practical implications - This paper will encourage others in the GLAM sector to consider licensing their collections in an open and reusable fashion. By spelling out the range of opportunities for researchers in using open cultural and heritage materials it makes a contribution to the discussion in this area. Social implications - Increasing the quantity of high-quality OA resources in the cultural heritage sector will lead to a richer research environment which will increase the understanding of history, culture and society. Originality/value - This paper has pulled together, for the first time, an overview of the current state of affairs of digitisation in the cultural and heritage sector seen through the context of the OAM. It has highlighted opportunities for researchers in the arts, humanities and social and historical sciences in the embedding of open cultural data into both their research and teaching, whilst scoping the wave of cultural heritage content which is being created from institutional repositories which are now available for research and use. As such, it is a position paper that encourages the open data agenda within the cultural and heritage sector, showing the potentials that exists for the study of culture and society when data are made open.", "paper_title": "Opening Access to collections: the making and using of open digitised cultural content", "paper_id": "WOS:000370546900008"}