{"auto_keywords": [{"score": 0.0433312844265797, "phrase": "power_consumption"}, {"score": 0.006950350009880133, "phrase": "backbone_networks"}, {"score": 0.00481495049065317, "phrase": "power-efficient_backbone_network"}, {"score": 0.0046364836476864325, "phrase": "year-by-year_increase"}, {"score": 0.004023947242621452, "phrase": "internet_infrastructure"}, {"score": 0.0039114753002009485, "phrase": "considerable_attention"}, {"score": 0.0036095259108028105, "phrase": "current_literature"}, {"score": 0.003541923233726252, "phrase": "optical_backbone_network"}, {"score": 0.003410479630045025, "phrase": "consumed_power"}, {"score": 0.0033465923623290034, "phrase": "high_traffic_loads"}, {"score": 0.003015950477134494, "phrase": "comprehensive_survey"}, {"score": 0.002519739850807611, "phrase": "relevant_studies"}, {"score": 0.0023806459272452353, "phrase": "technological_differences"}, {"score": 0.002358220053411644, "phrase": "similar_work"}, {"score": 0.002292199117499287, "phrase": "future_directions"}, {"score": 0.002125020720324262, "phrase": "prominent_research_bodies"}, {"score": 0.0021049977753042253, "phrase": "device_manufacturers"}], "paper_keywords": ["Optical fiber networks", " energy consumption", " next generation networking", " internet", " optical communication equipment"], "paper_abstract": "The year-by-year increase in electricity consumption significantly affects all nations today from environmental, social, and economic perspectives. Various studies show that, among the contributors of this increase, power consumption of the equipment forming the Internet infrastructure is significant. Consequently, considerable attention is given to finding solutions to reduce power consumption of the systems that run the Internet. Current literature suggests that the optical backbone network is responsible for the majority of the consumed power, particularly at high traffic loads. This highlights the importance of formulating solutions to reduce power consumption in backbone networks. In this paper, we provide a comprehensive survey of the most relevant research efforts on minimizing power consumption of backbone networks. We categorize our review into four broad approaches: network redesign, traffic engineering, power-aware networking, and load-adaptive operation. We highlight the findings of relevant studies and provide an analysis of their limitations. We also evaluate the technological differences of similar work and identify a number of future directions. Finally, we demonstrate that the adoption of these technologies is gathering pace among prominent research bodies, device manufacturers, and network operators.", "paper_title": "Toward a Power-Efficient Backbone Network: The State of Research", "paper_id": "WOS:000352024400011"}