{"auto_keywords": [{"score": 0.04062186730525437, "phrase": "boundary_conflicts"}, {"score": 0.00481495049065317, "phrase": "monte_carlo"}, {"score": 0.004770461993586338, "phrase": "continuum_diffusion-reaction_systems"}, {"score": 0.004267468074128779, "phrase": "standard_n-fold_kmc_method"}, {"score": 0.00413096972023037, "phrase": "parallel_architectures"}, {"score": 0.0033986345279488476, "phrase": "serial_method"}, {"score": 0.0032898346872897383, "phrase": "parallel_performance"}, {"score": 0.003125835572347772, "phrase": "particle_interactions"}, {"score": 0.0030825404960282713, "phrase": "known_analytical_solution"}, {"score": 0.0030117065110966414, "phrase": "diffusion-reaction_systems"}, {"score": 0.0029838294169759663, "phrase": "known_asymptotic_behavior"}, {"score": 0.00290173234777844, "phrase": "large_systems"}, {"score": 0.0028087949095629955, "phrase": "typical_diffusion_length"}, {"score": 0.0026811531172346676, "phrase": "global_kinetic_evolution"}, {"score": 0.0025712297362596574, "phrase": "expected_analytical_behavior"}, {"score": 0.0025121156016001886, "phrase": "controlled_approximation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["kinetic Monte Carlo", " parallel computing", " diffusion", " scalability"], "paper_abstract": "A novel parallel kinetic Monte Carlo (kMC) algorithm formulated on the basis of perfect time synchronicity is presented. The algorithm is intended as a generalization of the standard n-fold kMC method, and is trivially implemented in parallel architectures. In its present form, the algorithm is not rigorous in the sense that boundary conflicts are ignored. We demonstrate, however, that, in their absence, or if they were correctly accounted for, our algorithm solves the same master equation as the serial method. We test the validity and parallel performance of the method by solving several pure diffusion problems (i.e. with no particle interactions) with known analytical solution. We also study diffusion-reaction systems with known asymptotic behavior and find that, for large systems with interaction radii smaller than the typical diffusion length, boundary conflicts are negligible and do not affect the global kinetic evolution, which is seen to agree with the expected analytical behavior. Our method is a controlled approximation in the sense that the error incurred by ignoring boundary conflicts can be quantified intrinsically, during the course of a simulation, and decreased arbitrarily (controlled) by modifying a few problem-dependent simulation parameters. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Synchronous parallel kinetic Monte Carlo for continuum diffusion-reaction systems", "paper_id": "WOS:000254960600005"}