{"auto_keywords": [{"score": 0.04676138830146545, "phrase": "ehr"}, {"score": 0.00481495049065317, "phrase": "electronic_health_records_retrieval"}, {"score": 0.00463668357590034, "phrase": "recently_arose_problem"}, {"score": 0.00421923944095905, "phrase": "medical_records"}, {"score": 0.004156012879026324, "phrase": "growing_availability"}, {"score": 0.004062937864702115, "phrase": "digital_documents"}, {"score": 0.0037959868107895053, "phrase": "concrete_item"}, {"score": 0.0033893426032054366, "phrase": "logical_division"}, {"score": 0.003251376167695528, "phrase": "data_groups"}, {"score": 0.0031308163228919773, "phrase": "data_group"}, {"score": 0.002902903244616154, "phrase": "concrete_data_item_level"}, {"score": 0.0027325449069867222, "phrase": "medical_personnel"}, {"score": 0.0026813808976594183, "phrase": "assistance_act"}, {"score": 0.0023225152126545067, "phrase": "easier_the_work"}, {"score": 0.0022278779300543548, "phrase": "ubiquitous_computation"}, {"score": 0.0021614767508781048, "phrase": "tablet_pc"}, {"score": 0.0021370925426335953, "phrase": "pda"}], "paper_keywords": ["Electronic Health Records (EHR)", " Context", " Pertinence", " Contextualized access", " Fuzzy logic", " Access improvement"], "paper_abstract": "This paper aims to solve a recently arose problem, related to the access to the Electronic Health Records (EHR) in the Hospitals. Due to the digitalization of the information contained in the medical records, and the growing availability of devices that directly generate digital documents to include in it, the EHR are becoming unmanageable. Even more, to find a concrete item of information relevant for a given assistance act is a very hard, difficult and time-consuming task. To solve it we propose here the definition of contexts of access to the EHR, to exploit the logical division of the information inside each document in the EHR into data groups, and the computation of the pertinence of each data group to each context. It allows us to prioritize, the information in the EHR, even at a concrete data item level, according to the situation from which it is acceded. This way when the medical personnel is involved in an assistance act, the most relevant information for it is the one first showed, being able to widen the search but always according to the relevance. With it we not only improve the accessibility to the EHR and make easier the work of the doctors, but also enable other applications like the ubiquitous computation or the mobility, using devices like tablet PC's and PDA's. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Improving electronic health records retrieval using contexts", "paper_id": "WOS:000303281800003"}