{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media"}, {"score": 0.04647712278465534, "phrase": "social_media_applications"}, {"score": 0.022148289285443563, "phrase": "social_media_research"}, {"score": 0.02174203679718498, "phrase": "conceptual_framework"}, {"score": 0.01689984294369893, "phrase": "literature_review"}, {"score": 0.01016761031741184, "phrase": "critical_literature_review"}, {"score": 0.009483879799604952, "phrase": "personal_and_social_behavior_theories"}, {"score": 0.006929584754259431, "phrase": "real-life_case_study"}, {"score": 0.004776235281195212, "phrase": "considerable_attention"}, {"score": 0.0041860144759658015, "phrase": "two-stage_approach"}, {"score": 0.004152335204797172, "phrase": "first_stage"}, {"score": 0.004096801696267917, "phrase": "academic_journals"}, {"score": 0.003758492534305375, "phrase": "second_stage"}, {"score": 0.0036982302337748227, "phrase": "actual_case"}, {"score": 0.003648747692496864, "phrase": "proposed_framework"}, {"score": 0.0035902386595439146, "phrase": "social_media_application"}, {"score": 0.0035613356584415596, "phrase": "regional_division"}, {"score": 0.003532664514268134, "phrase": "international_non-government_organization"}, {"score": 0.0034110573683688154, "phrase": "diverse_business_areas"}, {"score": 0.003206037717183012, "phrase": "conceptual_social_media_application_framework"}, {"score": 0.0030214377691414724, "phrase": "wide_range"}, {"score": 0.003005190856405072, "phrase": "research_topics"}, {"score": 0.0027791677186501623, "phrase": "future_research"}, {"score": 0.0024220277948247973, "phrase": "application_solutions"}, {"score": 0.0023385630742192667, "phrase": "proposed_conceptual_framework"}, {"score": 0.0022217110026330066, "phrase": "extant_theories"}, {"score": 0.0021451344906273815, "phrase": "existing_knowledge"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["Case study", " Conceptual framework", " Literature review", " Social media applications", " Social media models"], "paper_abstract": "Purpose - In recent years, social media have attracted considerable attention. Hence, the purpose of this paper is to conduct a critical literature review of social media research with the aim of developing a conceptual framework to explain how social media applications are supported by various social media tools and technologies and underpinned by a set of personal and social behavior theories or models. Design/methodology/approach - This study adopted a two-stage approach. The first stage involves a critical literature review of academic journals in social media research, followed by the proposal of a conceptual framework that highlights the tools and technologies as well as theories and models that serve as the foundation of social media applications. The second stage involves the use of an actual case to demonstrate how the proposed framework facilitates the development of a social media application for a regional division of an international non-government organization. Findings - The literature review indicated that social media have been applied in diverse business areas with the support of various social media tools and technologies and underpinned by a range of personal and social behavior theories and models. Based upon such findings, a conceptual social media application framework was devised and its usability illustrated via a real-life case study. Managerial implications are also discussed. Research limitations/implications - Social media covers a wide range of research topics and thus, the literature review presented in this study may not be exhaustive. Nevertheless, the proposed framework and case study can both serve as reference for future research and provide recommendations for practitioners in the design and development of their own social media applications. Practical implications - This study not only explains the importance of applying social media in various business sectors, but also enhances the understanding of the infrastructure of social media applications. The study also provides insights for improving the efficiency of application solutions. Organizations are advised to adopt social media in their business based on the proposed conceptual framework. Originality/value - With a literature review of social media research and a real-life case study, this study presents a conceptual framework using extant theories and models to form a foundation for social media applications. The framework extends existing knowledge on the design and development of information systems.", "paper_title": "Social media models, technologies, and applications An academic review and case study", "paper_id": "WOS:000357392700002"}