{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "existing_methods"}, {"score": 0.004110993414942228, "phrase": "high_speeds"}, {"score": 0.0036553070575015344, "phrase": "accurate_results"}, {"score": 0.0036224139706218916, "phrase": "detection_guarantees"}, {"score": 0.003525493807130663, "phrase": "traffic_properties"}, {"score": 0.003036832649117453, "phrase": "theoretical_minimum"}, {"score": 0.002603918128553617, "phrase": "similar_principles"}, {"score": 0.002522738549524317, "phrase": "constant_sampling_probability"}, {"score": 0.002433048706565187, "phrase": "variable_sampling_rate"}, {"score": 0.0023465400668244386, "phrase": "traffic_intensity"}, {"score": 0.002162951519368368, "phrase": "minimal_configuration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Traffic measurements", " Heavy hitters", " Frequent items", " Sampling", " Scalability"], "paper_abstract": "Existing methods to detect and measure heavy-hitters (frequent items) are either lightweight but too inaccurate and memory-demanding (e.g. those relying on sampling), or too heavyweight to be deployed at high speeds. In this paper, we present several sampled-based algorithms to the problem and show that they exhibit two critical features. First, despite sampling, our schemes provide accurate results and detection guarantees that are independent of the traffic properties. Second, they are provably shown to require memory that is not only constant regardless of the amount of traffic observed and its composition, but a small factor above the theoretical minimum. Thus, unlike most solutions, ours scale in both space and speed; the use of sampling allowing to trade off performance for cost. As we will see, our algorithms build on similar principles. The first two use a constant sampling probability. Upgrading the second to support a variable sampling rate and to adjust it depending on the traffic intensity and CPU available yields our third scheme; a highly versatile solution that performs quasi-optimally and requires minimal configuration. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Scalable identification and measurement of heavy-hitters", "paper_id": "WOS:000318466100006"}