{"auto_keywords": [{"score": 0.045486939260611495, "phrase": "optical_queues"}, {"score": 0.03302077038648699, "phrase": "n_fibers"}, {"score": 0.015626237185549233, "phrase": "limited_number"}, {"score": 0.0071979859474165025, "phrase": "possible_choices"}, {"score": 0.00446080753340515, "phrase": "optical_packet"}, {"score": 0.004398457709182882, "phrase": "optical_buffers"}, {"score": 0.004319566932528865, "phrase": "optical_switches"}, {"score": 0.004302227873885534, "phrase": "fiber_delay_lines"}, {"score": 0.0042849628916423734, "phrase": "sdl"}, {"score": 0.004259182817598543, "phrase": "theoretical_studies"}, {"score": 0.004233561906098176, "phrase": "sdl_constructions"}, {"score": 0.004116012194714212, "phrase": "output-buffered_switches"}, {"score": 0.004034043638045215, "phrase": "fifo_queues"}, {"score": 0.0039141293182532715, "phrase": "delay_lines"}, {"score": 0.0034689528236980446, "phrase": "feedback_system"}, {"score": 0.003332072426367186, "phrase": "simple_packet_routing_policy"}, {"score": 0.0029469597262957057, "phrase": "main_idea"}, {"score": 0.0028940273541925078, "phrase": "extra_fibers"}, {"score": 0.002779769492357829, "phrase": "appropriately_chosen_delays"}, {"score": 0.0027574635255229567, "phrase": "effective_delays"}, {"score": 0.0024932498388507084, "phrase": "dynamic_programming_formulation"}, {"score": 0.0024732373165416957, "phrase": "divide-and-conquer_approach"}, {"score": 0.002448446849997207, "phrase": "closed-form_expression"}, {"score": 0.0023281637964056977, "phrase": "required_fibers"}, {"score": 0.0022497569011987587, "phrase": "optimal_choice"}, {"score": 0.0022361964497681934, "phrase": "fiber_delays"}, {"score": 0.002218242624828921, "phrase": "maximum_buffer_size"}, {"score": 0.0021049977753042253, "phrase": "minimum_total_fiber_length"}], "paper_keywords": ["dynamical programming", " first-in-first-out (FIFO) multiplexers", " majorization theory", " optical buffers", " optical queues", " optical switches", " Schur convex function", " switched delay lines"], "paper_abstract": "Recently, there has been a lot of attention in the literature on a less well-known aspect of queueing theory, the theory of the constructions of queues. Such an interest originates mainly from optical packet switching due to the lack of optical buffers. These constructions of optical queues are based on optical switches and fiber delay lines (SDL). Theoretical studies in the SDL constructions have been recently reported for the constructions of various types of optical queues, including output-buffered switches, first-in-first-out (FIFO) multiplexers, FIFO queues, last-in-first-out (LIFO) queues, priority queues, linear compressors, nonovertaking delay lines, and flexible delay lines. In this paper, we consider the constructions of optical 2-to-1 FIFO multiplexers with a limited number of recirculations through the fibers, which is a very important practical feasibility issue on the constructions of optical queues that has not been theoretically addressed before. Specifically, we consider the constructions of optical 2-to-1 FIFO multiplexers with buffer size at least 2(n)-1 by using a feedback system consisting of an (M + 2) x (M + 2) optical crossbar switch and M fiber delay lines under a simple packet routing policy and under the limitation that each packet can be recirculated through the M fibers at most k times. In one of our previous works, we have shown that this can be done by using n fibers with delays 1, 2, 2(2) ,..., 2(n-1) if there is no limitation on the number of recirculations through the fibers. The main idea in our constructions in this paper is to use extra fibers (other than the n fibers with delays 1, 2, 2(2) ,..., 2(n-1) with appropriately chosen delays to emulate the effective delays of the concatenations of some of the n fibers with delays 1, 2, 2(2) ,..., 2(n-1) so that the number of recirculations is reduced by so doing. It turns out that the number of fibers needed and their delays are determined based on a dynamic programming formulation obtained through a divide-and-conquer approach. We obtain a closed-form expression for the number of fibers needed in our constructions, and show that there are ((k)(r)) possible choices for the delays of the required fibers, where r is the remainder of n divided by k. Furthermore, we give the optimal choice of the fiber delays that achieves the maximum buffer size among the ((k)(r)) possible choices. Finally, we show that when n = k or n >= 2k, such an optimal choice also requires the minimum total fiber length among the ((k)(r)) possible choices.", "paper_title": "Constructions of optical 2-to-1 FIFO multiplexers with a limited number of recirculations", "paper_id": "WOS:000258913400011"}