{"auto_keywords": [{"score": 0.04616293897139308, "phrase": "motetrack"}, {"score": 0.010612387000973441, "phrase": "rf-based_location_tracking"}, {"score": 0.00767497650322926, "phrase": "beacon_nodes"}, {"score": 0.004312622975366676, "phrase": "low-power_radio_transceivers"}, {"score": 0.004227064760262924, "phrase": "modest_amount"}, {"score": 0.004184921610672245, "phrase": "computation_and_storage_capabilities"}, {"score": 0.004020492138367616, "phrase": "back-end_server"}, {"score": 0.0038431888954930083, "phrase": "mobile_node"}, {"score": 0.0037480753312398754, "phrase": "received_radio_signal_strength_signature"}, {"score": 0.0032900200522703923, "phrase": "significant_failures"}, {"score": 0.003240895431893266, "phrase": "radio_beacon_infrastructure"}, {"score": 0.0026120705848349055, "phrase": "severely_degrading_accuracy"}, {"score": 0.002496722870659199, "phrase": "highly_volatile_conditions"}, {"score": 0.0024348510123716424, "phrase": "detailed_analysis"}, {"score": 0.0024105326885334962, "phrase": "motetrack's_performance"}, {"score": 0.0023745087648471613, "phrase": "wide_range"}, {"score": 0.0021049977753042253, "phrase": "beacon_node_density"}], "paper_keywords": [""], "paper_abstract": "In this paper, we present a robust, decentralized approach to RF-based location tracking. Our system, called MoteTrack, is based on low-power radio transceivers coupled with a modest amount of computation and storage capabilities. MoteTrack does not rely upon any back-end server or network infrastructure: the location of each mobile node is computed using a received radio signal strength signature from numerous beacon nodes to a database of signatures that is replicated across the beacon nodes themselves. This design allows the system to function despite significant failures of the radio beacon infrastructure. In our deployment of MoteTrack, consisting of 23 beacon nodes distributed across our Computer Science building, we achieve a 50th percentile and 80th percentile location-tracking accuracy of 0.9 and 1.6 m respectively. In addition, MoteTrack can tolerate the failure of up to 60% of the beacon nodes without severely degrading accuracy, making the system suitable for deployment in highly volatile conditions. We present a detailed analysis of MoteTrack's performance under a wide range of conditions, including variance in the number of obstructions, beacon node failure, radio signature perturbations, receiver sensitivity, and beacon node density.", "paper_title": "MoteTrack: a robust, decentralized approach to RF-based location tracking", "paper_id": "WOS:000248884300008"}