{"auto_keywords": [{"score": 0.03420234110327117, "phrase": "minimum_cost_benchmark"}, {"score": 0.00481495049065317, "phrase": "minimum_data_sets_storage_cost"}, {"score": 0.004747679954980336, "phrase": "cloud"}, {"score": 0.0046986841646790315, "phrase": "massive_computation_power"}, {"score": 0.004585212379675535, "phrase": "cloud_computing_systems"}, {"score": 0.004474468584252318, "phrase": "computation_and_data_intensive_applications"}, {"score": 0.004345085569121329, "phrase": "large_application_data_sets"}, {"score": 0.0041174821422410544, "phrase": "pay-as-you-go_model"}, {"score": 0.0038261310307416475, "phrase": "large_volume"}, {"score": 0.0037888687452790953, "phrase": "generated_application_data_sets"}, {"score": 0.0031612033120065747, "phrase": "novel_highly_cost-effective_and_practical_storage_strategy"}, {"score": 0.003054681986032532, "phrase": "generated_data_set"}, {"score": 0.0028662606272282926, "phrase": "main_focus"}, {"score": 0.002391067964886602, "phrase": "specific_real_world_applications"}, {"score": 0.0023677483882740317, "phrase": "amazon's_cost_model_show"}, {"score": 0.0021049977753042253, "phrase": "practical_runtime_utilization"}], "paper_keywords": ["Data sets storage", " computation-storage tradeoff", " computation- and data-intensive applications", " cloud computing"], "paper_abstract": "Massive computation power and storage capacity of cloud computing systems allow scientists to deploy computation and data intensive applications without infrastructure investment, where large application data sets can be stored in the cloud. Based on the pay-as-you-go model, storage strategies and benchmarking approaches have been developed for cost-effectively storing large volume of generated application data sets in the cloud. However, they are either insufficiently cost-effective for the storage or impractical to be used at runtime. In this paper, toward achieving the minimum cost benchmark, we propose a novel highly cost-effective and practical storage strategy that can automatically decide whether a generated data set should be stored or not at runtime in the cloud. The main focus of this strategy is the local-optimization for the tradeoff between computation and storage, while secondarily also taking users' (optional) preferences on storage into consideration. Both theoretical analysis and simulations conducted on general (random) data sets as well as specific real world applications with Amazon's cost model show that the cost-effectiveness of our strategy is close to or even the same as the minimum cost benchmark, and the efficiency is very high for practical runtime utilization in the cloud.", "paper_title": "A Highly Practical Approach toward Achieving Minimum Data Sets Storage Cost in the Cloud", "paper_id": "WOS:000318499900018"}