{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "alibi_routing"}, {"score": 0.004402973626416765, "phrase": "users_undeniable_proof"}, {"score": 0.0036657110980445416, "phrase": "user-specified_set"}, {"score": 0.003634587156159668, "phrase": "\"forbidden\"_geographic_regions"}, {"score": 0.003394891095032025, "phrase": "low_overhead_proof_structure"}, {"score": 0.0031845067058084583, "phrase": "particular_timing_constraints"}, {"score": 0.0029871209444889716, "phrase": "forbidden_regions"}, {"score": 0.00268488398249084, "phrase": "primary_distinguishing_characteristics"}, {"score": 0.0025183881730011597, "phrase": "internet's_routing_hardware"}, {"score": 0.002362192695471035, "phrase": "user-provided_gps"}, {"score": 0.0023123057299992587, "phrase": "light_propagation_delays"}, {"score": 0.0022731540640627307, "phrase": "planetlab_deployment"}, {"score": 0.002253826965566618, "phrase": "larger-scale_simulations"}], "paper_keywords": ["Alibi Routing", " Provable route avoidance", " Censorship avoidance", " Peer-to-peer", " Overlay routing"], "paper_abstract": "There are several mechanisms by which users can gain insight into where their packets have gone, but no mechanisms allow users undeniable proof that their packets did not traverse certain parts of the world while on their way to or from another host. This paper introduces the problem of finding \"proofs of avoidance\": evidence that the paths taken by a packet and its response avoided a user-specified set of \"forbidden\" geographic regions. Proving that something did not happen is often intractable, but we demonstrate a low overhead proof structure built around the idea of what we call \"alibis\": relays with particular timing constraints that, when upheld, would make it impossible to traverse both the relay and the forbidden regions. We present Alibi Routing, a peer-to-peer overlay routing system for finding alibis securely and efficiently. One of the primary distinguishing characteristics of Alibi Routing is that it does not require knowledge of or modifications to the Internet's routing hardware or policies. Rather, Alibi Routing is able to derive its proofs of avoidance from user-provided GPS coordinates and speed of light propagation delays. Using a PlanetLab deployment and larger-scale simulations, we evaluate Alibi Routing to demonstrate that many source-destination pairs can avoid countries of their choosing with little latency inflation. We also identify when Alibi Routing does not work: it has difficulty avoiding regions that users are very close to (or, of course, inside of).", "paper_title": "Alibi Routing", "paper_id": "WOS:000370556200085"}