{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_blueprints"}, {"score": 0.004576253356889219, "phrase": "off-the-shelf_home_automation_technology"}, {"score": 0.004330941610682453, "phrase": "smart_homes"}, {"score": 0.004258128672571261, "phrase": "manual_configuration"}, {"score": 0.003639835714755229, "phrase": "smart_home_sensors"}, {"score": 0.0033437537557378157, "phrase": "home_automation_systems"}, {"score": 0.003259702394241964, "phrase": "intuitive_map-like_interface"}, {"score": 0.0030071857666598193, "phrase": "unique_configuration"}, {"score": 0.0029691377785333872, "phrase": "smart_home"}, {"score": 0.0028457440091791252, "phrase": "sensor_combinations"}, {"score": 0.002809732883291955, "phrase": "light_sensors"}, {"score": 0.002785978280998868, "phrase": "motion_sensors"}, {"score": 0.0025591748412278174, "phrase": "sensor-map_generation"}, {"score": 0.0024947959375982614, "phrase": "seven_different_houses"}, {"score": 0.0024736973328071026, "phrase": "different_locations"}, {"score": 0.0022530375696567136, "phrase": "almost_all_houses"}, {"score": 0.0021049977753042253, "phrase": "collected_data"}], "paper_keywords": ["Smart Homes", " Floor Plans", " Sensors", " Wireless sensor networks", " guides", " instructions"], "paper_abstract": "Off-the-shelf home automation technology is making it easier than ever for people to convert their own homes into smart homes. However, manual configuration is tedious and error-prone. In this article, we present and compare a family of solutions that automatically generate a map of the home and the devices within it using data from the smart home sensors themselves (e. g., light and motion sensors). These solutions can be used to automatically configure home automation systems or to automatically produce an intuitive map-like interface for visualizing sensor data and interacting with controllers. We call our approach Smart Blueprints because it automatically maps out the unique configuration of each smart home. We demonstrate the Smart Blueprints using a variety of sensor combinations, including light sensors, motion sensors, and magnetometers deployed on the doors and/or windows of the home. For evaluation of each combination on sensor-map generation, we deployed more than 200 sensors in seven different houses at different locations and compared the ability to use a variety of techniques to map out the configuration. We show that, in almost all houses, our system can automatically narrow the configuration down to 1-5 candidates per home using only one week of collected data.", "paper_title": "Smart Blueprints: How Simple Sensors Can Collaboratively Map Out Their Own Locations in the Home", "paper_id": "WOS:000345012500019"}