{"auto_keywords": [{"score": 0.03836287790345689, "phrase": "professional_practice"}, {"score": 0.028611901603991925, "phrase": "patient_attendance"}, {"score": 0.013106311200460269, "phrase": "ubiquitous_reflective_e-portfolio_architecture"}, {"score": 0.00481495049065317, "phrase": "medicine_courses"}, {"score": 0.004766090327062509, "phrase": "reflective_portfolios"}, {"score": 0.004737011408006966, "phrase": "pedagogical_tool"}, {"score": 0.004698514007994158, "phrase": "common_practice"}, {"score": 0.004556901872357751, "phrase": "electronic-based_portfolios"}, {"score": 0.004510648412817697, "phrase": "reflective_e-portfolios"}, {"score": 0.0044285668266548315, "phrase": "outdoor_sites"}, {"score": 0.004401538101929819, "phrase": "data_networks"}, {"score": 0.004277559730581563, "phrase": "nurse_and_medicine_courses"}, {"score": 0.004251448706726842, "phrase": "professional_practices"}, {"score": 0.004199701833128259, "phrase": "network_shortcomings"}, {"score": 0.004114847133676531, "phrase": "present_study"}, {"score": 0.004089725258435817, "phrase": "requirements_specification"}, {"score": 0.0038389110156920926, "phrase": "offline_operation"}, {"score": 0.0037613185362611193, "phrase": "professional_practice_module"}, {"score": 0.0034521328091451585, "phrase": "learning_group"}, {"score": 0.003417054482155433, "phrase": "medicine_course"}, {"score": 0.0033823313885107914, "phrase": "extensive_evaluation_questionnaires"}, {"score": 0.0032204937105518474, "phrase": "homework_tasks"}, {"score": 0.003207360864238053, "phrase": "patient_care"}, {"score": 0.0031942814007173254, "phrase": "data_sharing"}, {"score": 0.0030726480920918097, "phrase": "computer_network"}, {"score": 0.002878140062594849, "phrase": "display_sizes"}, {"score": 0.002860546817196148, "phrase": "netbook_devices"}, {"score": 0.002768511493859379, "phrase": "electronic_professional_practice_module"}, {"score": 0.0027403605798830984, "phrase": "group_activities"}, {"score": 0.0027124951328120622, "phrase": "paper-based_version"}, {"score": 0.002499508839669243, "phrase": "important_tasks"}, {"score": 0.0024842242921857705, "phrase": "main_shortcoming"}, {"score": 0.0024639898282571167, "phrase": "evaluation_tests"}, {"score": 0.00240426758768164, "phrase": "access_device"}, {"score": 0.0023411970753389796, "phrase": "new_version"}, {"score": 0.0023079225317714815, "phrase": "twofold_requisite"}, {"score": 0.0022063863214126034, "phrase": "students'_homes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic portfolio", " Ubiquitous computing", " Architecture", " Evaluation", " User perception", " Netbook"], "paper_abstract": "Background: In nurse and in medicine courses, the use of reflective portfolios as a pedagogical tool is becoming a common practice; in the last years, this practice has gradually migrated from paper-based to electronic-based portfolios. Current approaches for reflective e-portfolios, however, do not widely operate at outdoor sites, where data networks are limited or nonexistent. Considering that many of the activities related to nurse and medicine courses relate to professional practices conducted in such conditions, these network shortcomings restrict the adoption of e-portfolios. Purpose: The present study describes the requirements specification, design, implementation, and evaluation of the Ubiquitous Reflective E-Portfolio Architecture, a solution proposed to support the development of systems based on mobile and wired access for both online and offline operation. Methods: We have implemented a prototype named Professional Practice Module to evaluate the Ubiquitous Reflective E-Portfolio Architecture; the module was based on requirements observed during the professional practice, the paper-based portfolio in use, and related learning meetings in the Medicine Course of a Brazilian University. The evaluation of the system was carried out with a learning group of 2nd year students of the medicine course, who answered to extensive evaluation questionnaires. Results: The prototype proved to be operational in the activities of the professional practice of the Medicine Course object of the study, including homework tasks, patient care, data sharing, and learning meetings. It also demonstrated to be versatile with respect to the availability of the computer network that, many times, was not accessible. Moreover, the students considered the module useful and easy to use, but pointed out difficulties about the keyboard and the display sizes of the netbook devices, and about their operational system. Lastly, most of the students declared preference for the electronic Professional Practice Module in internal and in group activities, and for the paper-based version while in patient attendance. Conclusions: There is evidence that the environment where the professional practice takes place influences the usage of the e-portfolio. Mobile devices were able to support students in their professional practice; however, these devices present characteristics that must be judiciously selected, otherwise, they may limit the execution of important tasks. The main shortcoming identified during the evaluation tests was about the use of the module, and of the access device, during patient attendance. For this reason, we have envisioned a new version of the Professional Practice Module that shall follow a twofold requisite: by one side, it will include all the features of the module, to be used at the university or in the students' homes; from the other side, it will include only the features that are essential for the practice of patient attendance. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A Ubiquitous Reflective E-Portfolio Architecture", "paper_id": "WOS:000326372800016"}