{"auto_keywords": [{"score": 0.047420302825252954, "phrase": "pre-implementation_stage"}, {"score": 0.022834671241859734, "phrase": "community-dwelling_older_adults"}, {"score": 0.00481495049065317, "phrase": "electronic_technologies"}, {"score": 0.004696959887566612, "phrase": "technology_acceptance_factors"}, {"score": 0.0044917826990546255, "phrase": "post-implementation_stage"}, {"score": 0.004403480614319231, "phrase": "mixed_studies"}, {"score": 0.004381676471452105, "phrase": "seven_major_scientific_databases"}, {"score": 0.004349174009903682, "phrase": "medline"}, {"score": 0.004327644246094171, "phrase": "scopus"}, {"score": 0.00430620524294301, "phrase": "cinahl"}, {"score": 0.004253090649043267, "phrase": "inclusion_criteria"}, {"score": 0.0038798015183611275, "phrase": "actual_use"}, {"score": 0.003860580354346534, "phrase": "electronic_technology"}, {"score": 0.0035479614996805383, "phrase": "social_interaction"}, {"score": 0.0034695189961509625, "phrase": "qualitative_research"}, {"score": 0.0033177813460815346, "phrase": "six_themes"}, {"score": 0.0029447150254434842, "phrase": "social_influence"}, {"score": 0.002739906438523775, "phrase": "new_factors"}, {"score": 0.002712794864739074, "phrase": "quantitative_results"}, {"score": 0.002685950839409376, "phrase": "small_number"}, {"score": 0.002652768049567487, "phrase": "significant_influence"}, {"score": 0.0025493061218364375, "phrase": "existing_technology_acceptance_framework"}, {"score": 0.002455969295971317, "phrase": "multiple_factors"}, {"score": 0.0024316604501824937, "phrase": "post-implementation_research"}, {"score": 0.0023021895404322767, "phrase": "quantitative_methods"}, {"score": 0.0021741821763405045, "phrase": "existing_models"}, {"score": 0.002163392574631535, "phrase": "technology_acceptance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Independent living", " Aged", " Technology", " Review", " Behavior", " Assistive technology", " eHealth"], "paper_abstract": "Purpose: To provide an overview of factors influencing the acceptance of electronic technologies that support aging in place by community-dwelling older adults. Since technology acceptance factors fluctuate over time, a distinction was made between factors in the pre-implementation stage and factors in the post-implementation stage. Methods: A systematic review of mixed studies. Seven major scientific databases (including MEDLINE, Scopus and CINAHL) were searched. Inclusion criteria were as follows: (1) original and peer-reviewed research, (2) qualitative, quantitative or mixed methods research, (3) research in which participants are community-dwelling older adults aged 60 years or older, and (4) research aimed at investigating factors that influence the intention to use or the actual use of electronic technology for aging in place. Three researchers each read the articles and extracted factors. Results: Sixteen out of 2841 articles were included. Most articles investigated acceptance of technology that enhances safety or provides social interaction. The majority of data was based on qualitative research investigating factors in the pre-implementation stage. Acceptance in this stage is influenced by 27 factors, divided into six themes: concerns regarding technology (e.g., high cost, privacy implications and usability factors); expected benefits of technology (e.g., increased safety and perceived usefulness); need for technology (e.g., perceived need and subjective health status); alternatives to technology (e.g., help by family or spouse), social influence (e.g., influence of family, friends and professional caregivers); and characteristics of older adults (e.g., desire to age in place). When comparing these results to qualitative results on post-implementation acceptance, our analysis showed that some factors are persistent while new factors also emerge. Quantitative results showed that a small number of variables have a significant influence in the pre-implementation stage. Fourteen out of the sixteen included articles did not use an existing technology acceptance framework or model. Conclusions: Acceptance of technology in the pre-implementation stage is influenced by multiple factors. However, post-implementation research on technology acceptance by community-dwelling older adults is scarce and most of the factors in this review have not been tested by using quantitative methods. Further research is needed to determine if and how the factors in this review are interrelated, and how they relate to existing models of technology acceptance. (C) 2014 The Authors. Published by Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Factors influencing acceptance of technology for aging in place: A systematic review?", "paper_id": "WOS:000332397200001"}