{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "life's_first_decisions"}, {"score": 0.004760518730536645, "phrase": "information_society"}, {"score": 0.004724571550328985, "phrase": "purpose_-_the_purpose"}, {"score": 0.003435643372146385, "phrase": "additional_boundary"}, {"score": 0.003383884759373793, "phrase": "new_boundary"}, {"score": 0.0032087739900195232, "phrase": "living_things"}, {"score": 0.0026640466056415298, "phrase": "biological_level"}, {"score": 0.0025941547726803594, "phrase": "societal_level"}, {"score": 0.0025453546203590364, "phrase": "energy_efficiency"}, {"score": 0.0023771343615901185, "phrase": "better_information_gathering"}, {"score": 0.0023591417077156555, "phrase": "processing_tools"}, {"score": 0.0022200068884960836, "phrase": "social_boundaries"}, {"score": 0.0021617392821644005, "phrase": "new_perspective"}, {"score": 0.002121056250381627, "phrase": "growing_interest"}, {"score": 0.0021049977753042253, "phrase": "information_science"}], "paper_keywords": ["Behaviour", " Communication", " Evolution", " Information", " Information society", " Biology"], "paper_abstract": "Purpose - The purpose of this paper is to examine the association between information and boundaries. Life depends on boundaries; but in order to survive an organism needs to make decisions based on an interpretation of the environment beyond its boundaries: it therefore needs information. Design/methodology/approach - The paper explores the evolution of physical, social and cultural boundaries and considers how they have shaped ways in which information is gathered and used. Findings - Several evolutionary developments are reviewed. The paper argues that each one has generated an additional boundary and that each new boundary has affected the information needs within it. The paper argues that all living things use information to help address three fundamental concerns: \"Where can the energy needed to stay alive be found?\", \"How can it be stored?\", and \"How can use of energy be reduced?\" Because these questions are fundamental at a biological level they are also fundamental at a societal level. One way to increase energy efficiency was for organisms to grow larger. This brought risks which were alleviated by the evolution of better information gathering and processing tools. Amongst these tools were the means to communicate, which afforded the evolution of social boundaries. Originality/value - This is a new perspective on a topic of growing interest in information science and demonstrates further the significance of information as a factor in the shaping of life.", "paper_title": "Interpreting the world across a boundary The evolution of information from life's first decisions to the information society", "paper_id": "WOS:000341924700011"}