{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "client_and_vendor_it_capabilities"}, {"score": 0.007945020200984847, "phrase": "increase_rate"}, {"score": 0.006110748662337774, "phrase": "outsourcing_success"}, {"score": 0.004555499634179394, "phrase": "direct_and_complementarity_effects"}, {"score": 0.004172874316207784, "phrase": "resource-based_view"}, {"score": 0.003839962121679795, "phrase": "client_and_vendors_it_capabilities"}, {"score": 0.0031333949463567554, "phrase": "proposed_hypotheses"}, {"score": 0.0030056887638095883, "phrase": "client_it_capability"}, {"score": 0.0029234476524900794, "phrase": "vendor_firms"}, {"score": 0.002896535621940078, "phrase": "vice_versa"}, {"score": 0.0022878396720586044, "phrase": "bilateral_perspective"}, {"score": 0.0022458849724980904, "phrase": "support_managers"}, {"score": 0.0022149235007885826, "phrase": "better_outsourcing_decisions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IT outsourcing", " Client IT capability", " Vendor IT capability", " Outsourcing success", " Resource-based view", " Complementary perspective", " PLS"], "paper_abstract": "This study investigates the direct and complementarity effects of client and vendor Information Technology (IT) capabilities on the success of IT outsourcing. Concretizing the concepts of client and vendor IT capabilities from the resource-based view, we emphasize the importance of complementarity in IT outsourcing. It was hypothesized that the complementarity between client and vendors IT capabilities adds value to outsourcing success beyond their individual effects. We also hypothesized that the increase rate of complementarity is higher when the IT capability levels of both parties are similar (i.e., either high or low) than when those of both parties differ. The proposed hypotheses were tested by using 267 client-vendor matched data, in which client IT capability was measured by members of vendor firms and vice versa. Results indicate that client and vendor IT capabilities are significant factors in outsourcing success and that the complementarity between client and vendor IT capabilities significantly influences outsourcing success. The increase rate of complementarity is higher when the IT capability levels of both parties are similar than when those of both parties differ. The results help deepen our understanding of the bilateral perspective of outsourcing success and support managers in making better outsourcing decisions in selecting clients and vendors. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Complementarity between client and vendor IT capabilities: An empirical investigation in IT outsourcing projects", "paper_id": "WOS:000320638100012"}