{"auto_keywords": [{"score": 0.035184870928875414, "phrase": "pcg"}, {"score": 0.015719687064822692, "phrase": "real-time_strategy_games"}, {"score": 0.0044052452943364314, "phrase": "large-scale_endeavor"}, {"score": 0.004198010835867604, "phrase": "central_tasks"}, {"score": 0.00407533728096378, "phrase": "content_generation"}, {"score": 0.004045230861702083, "phrase": "namely_the_definition"}, {"score": 0.003956234229826621, "phrase": "non-player_characters"}, {"score": 0.0036870776660851007, "phrase": "great_amount"}, {"score": 0.003579280847524597, "phrase": "specialized_manpower"}, {"score": 0.003360527337581911, "phrase": "procedural_content_generation"}, {"score": 0.0031786037839399055, "phrase": "algorithmic_techniques"}, {"score": 0.003120171161064748, "phrase": "game_contents"}, {"score": 0.0030176779201170306, "phrase": "player_experience"}, {"score": 0.002875529792120695, "phrase": "different_playing_sessions"}, {"score": 0.0027097117582440687, "phrase": "underlying_algorithmic_technique"}, {"score": 0.002553431170229379, "phrase": "computational_intelligence"}, {"score": 0.0025157865918985704, "phrase": "evolutionary_algorithms"}, {"score": 0.002370663905320869, "phrase": "evolutionary_intelligence"}, {"score": 0.0023270490574896804, "phrase": "special_emphasis"}, {"score": 0.0021049977753042253, "phrase": "game_ai."}], "paper_keywords": ["Procedural Content Generation", " Artificial Intelligence", " game strategy", " self-learning"], "paper_abstract": "Videogames are one of the most important and profitable sectors in the industry of entertainment. Nowadays, the creation of a videogame is often a large-scale endeavor and bears many similarities with, e.g., movie production. On the central tasks in the development of a videogame is content generation, namely the definition of maps, terrains, non-player characters (NPCs) and other graphical, musical and AI-related components of the game. Such generation is costly due to its complexity, the great amount of work required and the need of specialized manpower. Hence the relevance of optimizing the process and alleviating costs. In this sense, procedural content generation (PCG) comes in handy as a means of reducing costs by using algorithmic techniques to automatically generate some game contents. PCG also provides advantages in terms of player experience since the contents generated are typically not fixed but can vary in different playing sessions, and can even adapt to the player herself. For this purpose, the underlying algorithmic technique used for PCG must be also flexible and adaptable. This is the case of computational intelligence in general and evolutionary algorithms in particular. In this work we shall provide an overview of the use of evolutionary intelligence for PCG, with special emphasis on its use within the context of real-time strategy games. We shall show how these techniques can address both playability and aesthetics, as well as improving the game AI.", "paper_title": "Procedural Content Generation for Real-Time Strategy Games", "paper_id": "WOS:000362593900006"}