{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_protocols"}, {"score": 0.02806237849727054, "phrase": "formal_methods"}, {"score": 0.0069450439565539234, "phrase": "quality_improvement"}, {"score": 0.004708943089688438, "phrase": "evidence-based_medicine"}, {"score": 0.004639565230823192, "phrase": "increasing_number"}, {"score": 0.004616666115467725, "phrase": "medical_practice_guidelines"}, {"score": 0.004254671386496732, "phrase": "recent_efforts"}, {"score": 0.004171259063201874, "phrase": "protocol_improvement"}, {"score": 0.004081815353871645, "phrase": "format_methods"}, {"score": 0.004059219816495496, "phrase": "informal_processes"}, {"score": 0.003685604033479918, "phrase": "adequate_protocol_representation_language"}, {"score": 0.0036133077234252633, "phrase": "formal_analysis"}, {"score": 0.003379581181734919, "phrase": "real-life_medical_protocols"}, {"score": 0.0033132678117350984, "phrase": "earlier_work"}, {"score": 0.0032724821705972357, "phrase": "knowledge_representation"}, {"score": 0.003232196964101485, "phrase": "third_aspect"}, {"score": 0.0028983407727845175, "phrase": "protocol_characteristics"}, {"score": 0.0028484940955893134, "phrase": "reference_protocols"}, {"score": 0.0027650234530228897, "phrase": "interesting_protocol_properties"}, {"score": 0.002624776882212556, "phrase": "consolidated_formal_language"}, {"score": 0.0026117958964141795, "phrase": "model_medical_practice_protocols"}, {"score": 0.0024854563979745665, "phrase": "verification_proofs"}, {"score": 0.0023418708663358895, "phrase": "medical_experts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["medical protocols", " medical guidelines", " modelling of protocols", " verification of protocols", " format methods"], "paper_abstract": "Objectives: During the last decade, evidence-based medicine has given rise to an increasing number of medical practice guidelines and protocols. However, the work done on developing and distributing protocols outweighs the efforts on guaranteeing their quality. Indeed, anomalies like ambiguity and incompleteness are frequent in medical protocols. Recent efforts have tried to address the problem of protocol improvement, but they are not sufficient since they rely on informal processes and notations. Our objective is to improve the quality of medical protocols. Approach: The solution we suggest to the problem of quality improvement of protocols consists in the utilisation of formal methods. It requires the definition of an adequate protocol representation language, the development of techniques for the formal analysis of protocols described in that language and, more importantly, the evaluation of the feasibility of the approach based on the formatisation and verification of real-life medical protocols. For the first two aspects we rely on earlier work from the fields of knowledge representation and formal methods. The third aspect, i.e. the evaluation of the use of formal methods in the quality improvement of protocols, constitutes our main objective. The steps with which we have carried out this evaluation are the following: (1) take two real-Life reference protocols which cover a wide variety of protocol characteristics; (2) formalise these reference protocols; (3) check the formalisation for the verification of interesting protocol properties; and (4) determine how many errors can be uncovered in this way. Results: Our main results are: a consolidated formal language to model medical practice protocols; two protocols, each both modelled and formalised; a list of properties that medical protocols should satisfy; verification proofs for these protocols and properties; and perspectives of the potentials of this approach. Our results have been evaluated by a panel of medical experts, who judged that the problems we detected in the protocols with the help of format methods were serious and should be avoided. Conclusions: We have succeeded in demonstrating the feasibility of format methods for improving medical protocols. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Improving medical protocols by formal methods", "paper_id": "WOS:000236616800001"}