{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "design_examples"}, {"score": 0.015568434073667505, "phrase": "powerpoint_presentation_slides"}, {"score": 0.014977504475140303, "phrase": "design_principles"}, {"score": 0.010666154560934627, "phrase": "co-explanation_condition"}, {"score": 0.008610842898668081, "phrase": "co-explaining_design_examples"}, {"score": 0.0046986841646790315, "phrase": "current_study"}, {"score": 0.004496402246090618, "phrase": "powerpoint_presentation"}, {"score": 0.003959447096055027, "phrase": "collaborative_design_activity"}, {"score": 0.003920891569777894, "phrase": "pre-service_teachers"}, {"score": 0.003099888654615187, "phrase": "nominal_pairs"}, {"score": 0.003054681986032532, "phrase": "self-explanation_condition"}, {"score": 0.002838319783373086, "phrase": "individual_learning_outcomes"}, {"score": 0.0027026375053777543, "phrase": "design_condition"}, {"score": 0.0021891781017389783, "phrase": "transactional_activity_costs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["PowerPoint", " Example-based learning", " Self-explanation", " Collaborative learning", " Design task"], "paper_abstract": "The current study investigated how people learn design principles from examples of PowerPoint presentation slides through self-explanation and co-explanation. This study also explored a strategy to improve the effectiveness of co-explanation by integrating it with a collaborative design activity. Pre-service teachers (n = 120) studied the design examples of PowerPoint presentation slides in four research conditions: co-explanation with design, co-explanation, self-explanation, and no prompt (control). Pairs of learners in the co-explanation condition explained fewer strengths and weaknesses of the design examples than nominal pairs in the self-explanation condition. Moreover, co-explanation was not more effective than self-explanation when it came to individual learning outcomes. In contrast, pairs in the co-explanation with design condition were more actively engaged in co-explaining design examples than pairs in the co-explanation condition. This study shows that co-explanation with design is more beneficial for constructing and sharing knowledge of design principles than co-explanation only. This study discussed a trade-off between constructive/interactive learning effects and transactional activity costs in co-explaining design examples. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The role of co-explanation and self-explanation in learning from design examples of PowerPoint presentation slides", "paper_id": "WOS:000325600400035"}