{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_theft"}, {"score": 0.0047823219739028325, "phrase": "encrypted_data_trees"}, {"score": 0.004701710196317656, "phrase": "major_threat"}, {"score": 0.004669845451682529, "phrase": "modern_organizations"}, {"score": 0.004638195656547484, "phrase": "potentially_large_economic_consequences"}, {"score": 0.004483120978156604, "phrase": "organization's_information_systems"}, {"score": 0.003993472712847928, "phrase": "unauthorized_data_extraction"}, {"score": 0.003939487754302632, "phrase": "basic_file_system_primitives"}, {"score": 0.003743439610143464, "phrase": "valuable_items"}, {"score": 0.0035571129372263532, "phrase": "whole_rack"}, {"score": 0.0034497831301482144, "phrase": "sensitive_files"}, {"score": 0.0032117325375830407, "phrase": "encrypted_form"}, {"score": 0.0031467766123827686, "phrase": "file_system"}, {"score": 0.0030726480920918097, "phrase": "distributed_merkle_hash_tree"}, {"score": 0.0029596622424171264, "phrase": "previous_access"}, {"score": 0.002860546817196148, "phrase": "potential_attacker"}, {"score": 0.0026995881394357504, "phrase": "associated_key"}, {"score": 0.0026359661683150984, "phrase": "probabilistic_rekeying_mechanism"}, {"score": 0.002547663224855668, "phrase": "patient_extractors"}, {"score": 0.0025131738347596586, "phrase": "experimental_results"}, {"score": 0.002177991273791155, "phrase": "introduced_overhead"}, {"score": 0.0021484955960643167, "phrase": "standard_computing_platforms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data leakage prevention", " Insiders", " Information theft"], "paper_abstract": "Data theft is a major threat for modern organizations with potentially large economic consequences. Although these attacks may well originate outside an organization's information systems, the attacker or else an insider must eventually-make contact with the system where the information resides and extract it. In this work, we propose a scheme that hinders unauthorized data extraction by modifying the basic file system primitives used to access files. Intuitively, our proposal emulates the chains used to protect valuable items in certain clothing shopping centers, where shoplifting is prevented by forcing the thief to steal the whole rack of items. We achieve this by encrypting sensitive files using nonces (i.e., pseudorandom numbers used only once) as keys. Such nonces are available, also in encrypted form, in other objects of the file system. The system globally resembles a distributed Merkle hash tree, in such a way that getting access to a file requires previous access to a number of other files. This forces any potential attacker to extract not only the targeted sensitive information, but also all the files chained to it that are necessary to compute the associated key. Furthermore, our scheme incorporates a probabilistic rekeying mechanism to limit the damage that might be caused by patient extractors. We report experimental results measuring the time overhead introduced by our proposal and compare it with the effort an attacker would need to successfully extract information from the system. Our results show that the scheme increases substantially the effort required by an insider, while the introduced overhead is feasible for standard computing platforms. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Hindering data theft with encrypted data trees", "paper_id": "WOS:000349507000012"}