{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "talmudic_public_announcement_logic"}, {"score": 0.004789437335126437, "phrase": "ordinary_dynamic_action_logics"}, {"score": 0.004469757288746157, "phrase": "possible_results"}, {"score": 0.004375735866188847, "phrase": "talmudic_logic_deals"}, {"score": 0.004238383231744549, "phrase": "legal_status"}, {"score": 0.0039976255140341446, "phrase": "future_clarifications"}, {"score": 0.003923915284959959, "phrase": "public_announcement"}, {"score": 0.003872095456544917, "phrase": "later_time"}, {"score": 0.0034171218142220426, "phrase": "talmudic_logic"}, {"score": 0.003363013780610744, "phrase": "quantum_superposition"}, {"score": 0.003240059402545145, "phrase": "pure_state"}, {"score": 0.0032143006733904344, "phrase": "talmudic_lack"}, {"score": 0.0030315379838336334, "phrase": "dying_man"}, {"score": 0.002889738881359045, "phrase": "sole_heir"}, {"score": 0.0027326445507417736, "phrase": "legal_backwards_causality"}, {"score": 0.0025296114694919685, "phrase": "unknown_inheritance"}, {"score": 0.002424108425067749, "phrase": "talmudic_reasoning"}, {"score": 0.0023478721466464888, "phrase": "new_types"}, {"score": 0.0023354007130196885, "phrase": "public_announcement_logics"}, {"score": 0.00227402797304554, "phrase": "ordinary_public_announcement_logic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Temporal logic", " Talmudic logic", " Public announcement logic"], "paper_abstract": "Ordinary dynamic action logics deal with states and actions upon states. The actions can be deterministic or non-deterministic, but it is always assumed that the possible results of the actions are clear cut. Talmudic logic deals with actions (usually legally meaningful actions which can change the legal status of an entity) which depend on the future and therefore may be not clear cut at the present and need future clarifications. The clarification is modelled by public announcement which comes at a later time after the action has taken place. The model is further complicated by the need to know what is the status of formulas at a time before the results of the action is clarified, as we do not know at which state we are in. Talmudic logic treats such states much like the quantum superposition of states and when clarification is available we get a collapse onto a pure state. The Talmudic lack of clarity of actions arises from applying an action to entities defined using the future, like the statement of a dying man on his death bed: Let the man who will win the jackpot in the lottery next week be the sole heir in my will now We need to wait a week for the situation to clarify. There is also the problem of legal backwards causality, as this man, if indeed he exists, unaware of his possible good fortune, may have himself meanwhile donated all his property to a charity. Does his donation include this unknown inheritance? This paper will offer a model and a logic which can represent faithfully the Talmudic reasoning in these matters. We shall also see that we get new types of public announcement logics and (quantum-like) action logics. Ordinary public announcement logic deletes possible worlds after an announcements. Talmudic public announcement logic deletes accessibility links after an announcement Technically these two approaches are similar but not equivalent (C) 2012 Published by Elsevier B.V.", "paper_title": "Future determination of entities in Talmudic public announcement logic", "paper_id": "WOS:000315313100004"}