{"auto_keywords": [{"score": 0.028792504635115835, "phrase": "ahp"}, {"score": 0.00481495049065317, "phrase": "mechanical_design"}, {"score": 0.004425072111844721, "phrase": "aspect_problems"}, {"score": 0.004116012194714212, "phrase": "novel_method"}, {"score": 0.00406663414150229, "phrase": "evolutionary_multi-objective_optimization_algorithm"}, {"score": 0.0037825134619339537, "phrase": "multi-constraint_problems"}, {"score": 0.0034550163444256386, "phrase": "search_process"}, {"score": 0.003099113156350047, "phrase": "new_objective"}, {"score": 0.0030069062905274976, "phrase": "multi-criteria_decision_aid_method"}, {"score": 0.0028823939507764238, "phrase": "ea_population"}, {"score": 0.0025542617599268323, "phrase": "sub-objective_functions"}, {"score": 0.0022909325048608054, "phrase": "feasible_domain"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_multi-objective_optimization"}], "paper_keywords": [""], "paper_abstract": "Although many techniques have been developed to deal with either multi-criteria or constrained aspect problems, few methods explicitly deal with both features. Therefore, a novel method of evolutionary multi-objective optimization algorithm with preference is proposed. It aims at solving multi-objective and multi-constraint problems, where the user incorporates his/her preferences about the objectives at the very start of the search process, by means of weights. It functions by considering the satisfaction of the constraints as a new objective, and using a multi-criteria decision aid method to rank the members of the EA population at each generation. In addition, the Analytic Hierarchy Process (AHP) is adopted to determine the weights of the sub-objective functions. Also, adaptivity of the weights is applied in order to converge more easily towards the feasible domain. Finally, an example is given to illustrate the validity of the evolutionary multi-objective optimization with preference.", "paper_title": "Evolutionary multi-objective optimization algorithm with preference for mechanical design", "paper_id": "WOS:000238282100052"}