{"auto_keywords": [{"score": 0.049581014501477026, "phrase": "svm"}, {"score": 0.0046176782475198085, "phrase": "m-aining_data"}, {"score": 0.004246947739596565, "phrase": "different_locations"}, {"score": 0.004202741104973709, "phrase": "processing_capabilities"}, {"score": 0.003905864553426306, "phrase": "reasonably_small_amount"}, {"score": 0.0037066895459425824, "phrase": "svm_solution"}, {"score": 0.0034267429854665035, "phrase": "local_data"}, {"score": 0.0031845067058084583, "phrase": "centralized_approach"}, {"score": 0.0027645030021576926, "phrase": "raw_data"}, {"score": 0.0024634797027967203, "phrase": "total_amount"}, {"score": 0.0023499703712897293, "phrase": "privacy-preserving_mechanism"}], "paper_keywords": ["collaborative", " compact", " coopetitive", " data mining", " data privacy", " distributed", " information sharing", " support vector machine"], "paper_abstract": "A truly distributed (as opposed to parallelized) support vector machine (SVM) algorithm is presented. M-aining data are assumed to come from the same distribution and are locally stored in a number of different locations with processing capabilities (nodes). In several examples, it has been found that a reasonably small amount of information is interchanged among nodes to obtain an SVM solution, which is better than that obtained when classifiers are trained only with the local data and comparable (although a little bit worse) to that of the centralized approach (obtained when all the training data are available at the same place). We propose and analyze two distributed schemes: a \"naive\" distributed chunking approach, where raw data (support vectors) are communicated, and the more elaborated distributed semiparametric SVM, which aims at further reducing the total amount of information passed between nodes while providing a privacy-preserving mechanism for information sharing. We show the feasibility of our proposal by evaluating the performance of the algorithms in benchmarks with both synthetic and real-world datasets.", "paper_title": "Distributed support vector machines", "paper_id": "WOS:000238865200024"}