{"auto_keywords": [{"score": 0.04197944040482405, "phrase": "named_entity_identification"}, {"score": 0.03820679588870147, "phrase": "nei"}, {"score": 0.00481495049065317, "phrase": "textual_medication_extraction"}, {"score": 0.004778923541463994, "phrase": "combined_conditional_random_fields"}, {"score": 0.004743164872278112, "phrase": "rule-based_systems"}, {"score": 0.004416465443332974, "phrase": "medical_discharge_summaries"}, {"score": 0.003771631577951067, "phrase": "conditional_random_fields"}, {"score": 0.003485304124598714, "phrase": "crf_models"}, {"score": 0.003344076203780408, "phrase": "rule-based_nei_component"}, {"score": 0.003113441660343867, "phrase": "relation_extraction_performance"}, {"score": 0.0030554300179552415, "phrase": "filtering_and_relation_extraction_components"}, {"score": 0.002920561105784389, "phrase": "official_entry_level_evaluation"}, {"score": 0.0028661330049356186, "phrase": "entity_level_analysis"}, {"score": 0.0027811441123794427, "phrase": "test_data"}, {"score": 0.002678433668156676, "phrase": "exact_matching"}, {"score": 0.0026384167183586015, "phrase": "inexact_matching"}, {"score": 0.0026087958216676702, "phrase": "rb-nei_component"}, {"score": 0.0025795158273023405, "phrase": "caf"}, {"score": 0.002550545394070177, "phrase": "significantly_weaker_result"}, {"score": 0.002521936294866969, "phrase": "crf"}, {"score": 0.002493592357827492, "phrase": "rule-based_model"}, {"score": 0.0023745087648471613, "phrase": "simple_rule-based_method"}, {"score": 0.0022273034991008326, "phrase": "potentially_inaccurate_training_data"}, {"score": 0.0021049977753042253, "phrase": "rule-based_methods"}], "paper_keywords": [""], "paper_abstract": "Objective In the i2b2 Medication Extraction Challenge, medication names together with details of their administration were to be extracted from medical discharge summaries. Design The task of the challenge was decomposed into three pipelined components: named entity identification, context-aware filtering and relation extraction. For named entity identification, first a rule-based (FIB) method that was used in our overall fifth place-ranked solution at the challenge was investigated. Second, a conditional random fields (CRF) approach is presented for named entity identification (NEI) developed after the completion of the challenge. The CRF models are trained on the 17 ground truth documents, the output of the rule-based NEI component on all documents, a larger but potentially inaccurate training dataset. For both NEI approaches their effect on relation extraction performance was investigated. The filtering and relation extraction components are both rule-based. Measurements In addition to the official entry level evaluation of the challenge, entity level analysis is also provided. Results On the test data an entry level F-1-score of 80% was achieved for exact matching and 81% for inexact matching with the RB-NEI component. The CAF produces a significantly weaker result, but CRF outperforms the rule-based model with 81% exact and 82% inexact F-1-score (p<0.02). Conclusion This study shows that a simple rule-based method is on a par with more complicated machine learners; CAF models can benefit from the addition of the potentially inaccurate training data, when only very few training documents are available. Such training data could be generated using the outputs of rule-based methods.", "paper_title": "Improving textual medication extraction using combined conditional random fields and rule-based systems", "paper_id": "WOS:000281972200011"}