{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "communicating_systems"}, {"score": 0.0046978475261364215, "phrase": "complex_systems"}, {"score": 0.00454610829874136, "phrase": "correct_behaviour"}, {"score": 0.004459857205489101, "phrase": "temporal_requirements"}, {"score": 0.004222299135545249, "phrase": "account_time_aspects"}, {"score": 0.0038893838564184107, "phrase": "passive_testing_approach"}, {"score": 0.0036320225018459263, "phrase": "passive_testing"}, {"score": 0.003524227590204673, "phrase": "temporal_restrictions"}, {"score": 0.0030814966489115334, "phrase": "empirical_study"}, {"score": 0.0030562674358159945, "phrase": "complex_system"}, {"score": 0.0030395624703152212, "phrase": "automatic_recognition"}, {"score": 0.002989991779830814, "phrase": "pipeline_architecture"}, {"score": 0.0029171429862165327, "phrase": "system's_behaviour"}, {"score": 0.0026357877401570764, "phrase": "different_errors"}, {"score": 0.0025295891681459755, "phrase": "proposed_methodology"}, {"score": 0.0024679299547216956, "phrase": "mutated_versions"}, {"score": 0.0024210112323786374, "phrase": "designed_set"}, {"score": 0.002349073225500705, "phrase": "temporal_aspects"}, {"score": 0.002273025527678093, "phrase": "proposed_technique"}, {"score": 0.00221153232497724, "phrase": "complex_timed_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software testing", " Communicating systems", " Formal methods", " Timeouts", " Passive testing"], "paper_abstract": "Context: The design of complex systems demands methodologies to analyze its correct behaviour. It is usual that a correct behaviour is determined by the compliance with temporal requirements. Currently, testing is the most used technology to validate the correctness of systems. Although several techniques that take into account time aspects have been proposed, most of them require the tester interacts with the system. However, if this is not possible, it is necessary to apply a passive testing approach where the tester monitors the behaviour of the system. Objective: The aim of this paper is to propose a methodology to perform passive testing on communicating systems in which the behaviour of their components must fulfill temporal restrictions associated with both performance and delays/timeouts. Method: Our framework uses algorithms for checking traces collected from the systems against invariants which formally represent the most relevant properties that must be fulfilled by the system. In order to support the feasibility of the methodology, we have performed an empirical study on a complex system for automatic recognition of images based on a pipeline architecture. We have analyzed the correctness of the system's behaviour with respect to a set of invariants. Finally, an experiment, based on mutations of the system, was conducted to study the level of detection of a set of invariants. Results: Different errors were detected and fixed along the development of the system by means of the proposed methodology. The results of the experiments with the mutated versions of the system indicated that the designed set of invariants was more effective in finding errors associated to temporal aspects than those related to communication among components. Conclusion: The proposed technique has been shown to be very useful for analyzing complex timed systems, and find errors when the tester has no control over their behaviour. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Passive testing of communicating systems with timeouts", "paper_id": "WOS:000355365100002"}