{"auto_keywords": [{"score": 0.04354213151544681, "phrase": "cmr"}, {"score": 0.004826897473764026, "phrase": "community_pharmacies"}, {"score": 0.004778088905211055, "phrase": "objective_many_dutch_hospitals"}, {"score": 0.004723322467153553, "phrase": "internal_systems"}, {"score": 0.0042847204413012496, "phrase": "nationwide_reporting_system"}, {"score": 0.00427410962921379, "phrase": "reporting_system"}, {"score": 0.003957735532719663, "phrase": "current_status"}, {"score": 0.003808407814695708, "phrase": "similar_systems"}, {"score": 0.003750260412839128, "phrase": "system_description_adequate_it"}, {"score": 0.003650622777534568, "phrase": "multicenter_reporting_system"}, {"score": 0.003608732492631878, "phrase": "cmr_system"}, {"score": 0.0031906408161077792, "phrase": "reported_medication_incidents"}, {"score": 0.0030938932434437178, "phrase": "healthcare_providers"}, {"score": 0.002344762593995099, "phrase": "medication_incidents"}, {"score": 0.002256155453630723, "phrase": "mental_healthcare_organizations"}, {"score": 0.0022388390432214415, "phrase": "general_practitioners"}, {"score": 0.0021049977753042253, "phrase": "different_healthcare_providers"}], "paper_keywords": [""], "paper_abstract": "Objective Many Dutch hospitals have established internal systems for reporting incidents. However, such internal systems do not allow learning from incidents that occur in other hospitals. Therefore a multicenter, information technology (IT) supported reporting system named central medication incidents registration (CMR) was developed. This article describes the architecture, implementation and current status of the CMR in The Netherlands and compare it with similar systems in other countries. System Description Adequate IT is required to sufficiently support a multicenter reporting system. The CMR system consists of a website, a database, a web-based reporting form, an application to import reports generated in other reporting systems, an application to generate an overview of reported medication incidents, and a national warning system for healthcare providers. Current Status From the start of CMR 90 of all 93 (96.8%) hospitals and 872 of 1948 (44.8%) community pharmacies participated. Between March 2006 and March 2010 the CMR comprised 15 694 reports of incidents. In the period from March 2010 to March 2011, 1642 reports were submitted by community pharmacies in CMR and the hospitals submitted 2517 reports. CMR is similar to various systems in other countries, but it seems to use more IT applications. Discussion The CMR is developing into a nationwide reporting system of medication incidents in The Netherlands, in which hospitals, community pharmacies, mental healthcare organizations and general practitioners participate. Conclusion The architecture of the system met the requirements of a nationwide reporting system across different healthcare providers.", "paper_title": "A nationwide medication incidents reporting system in The Netherlands", "paper_id": "WOS:000296491600012"}