{"auto_keywords": [{"score": 0.010523814126770732, "phrase": "machine-printed_chinese_postage_envelopes"}, {"score": 0.006547319082956913, "phrase": "experimental_trial"}, {"score": 0.005868618314700566, "phrase": "character_recognition_rate"}, {"score": 0.005819404904598426, "phrase": "postal_addresses"}, {"score": 0.00481495049065317, "phrase": "real-time_processing"}, {"score": 0.004577440795549049, "phrase": "vision-based_postal_envelope_identification_method"}, {"score": 0.004189523950071494, "phrase": "high-speed_camera"}, {"score": 0.0040334640350288, "phrase": "conveying_device"}, {"score": 0.003916098498242888, "phrase": "postal_address"}, {"score": 0.0037861265016041813, "phrase": "laser_sensor"}, {"score": 0.0032250961348210473, "phrase": "supported_font_styles"}, {"score": 0.003091767402370757, "phrase": "printed_font_size"}, {"score": 0.0024926348205500715, "phrase": "real-time_storage"}, {"score": 0.0024405312482831646, "phrase": "recognition_results"}, {"score": 0.0023395610923736595, "phrase": "subsequent_envelope"}, {"score": 0.0022145052062614514, "phrase": "real_live_mails"}, {"score": 0.0021866066626507028, "phrase": "postal_center"}], "paper_keywords": ["character recognition", " real-time vision system", " postal envelope identification", " document image processing", " pattern recognition"], "paper_abstract": "This paper describes a method of real-time processing of machine-printed Chinese postage envelopes in an automated postal system. We propose a vision-based postal envelope identification method, and a system that can be applied to rapidly moving machine-printed Chinese postage envelopes through the postal process. Our system uses a high-speed camera to capture images of envelopes running on a conveying device, and then automatically recognizes the postal address and postcode on each envelope. A laser sensor is used to trigger the camera to capture the images. Our system supports a vocabulary of 4,590 categories of characters, including 4,516 frequently used Chinese characters defined in the GB2312-80 standard, 62 alphanumeric characters, and 12 punctuation marks and symbols. Supported font styles include the Song, Fang Song, Kai, and Hei fonts, among others, at a printed font size of 7.5 points and above. The results of an experimental trial of the system with 761 envelope images representing 25,060 characters revealed that an envelope with an average of 32.9 characters could be processed and recognized within 81.38 milliseconds. The character recognition rate of postal addresses is 98.72%. Furthermore, our system also provides a method for the real-time storage of envelope images and recognition results into a database, which can be used in subsequent envelope querying, tracking and management. The results of an experimental trial with real live mails in a postal center indicated that our system could achieve a speed of 21,000 envelopes per hour, with the character recognition rate of postal addresses as high as 98.92%.", "paper_title": "A Vision-Based Fast Chinese Postal Envelope Identification System", "paper_id": "WOS:000299446100004"}