{"auto_keywords": [{"score": 0.04677143577133061, "phrase": "compendium"}, {"score": 0.00481495049065317, "phrase": "multiple_purposes"}, {"score": 0.004523103062368843, "phrase": "text_summarisation_tool"}, {"score": 0.004173603566828364, "phrase": "multi-document_summaries"}, {"score": 0.003474694300991964, "phrase": "proposed_architecture"}, {"score": 0.0032638170723261538, "phrase": "additional_stages"}, {"score": 0.002778317177178732, "phrase": "main_contributions"}, {"score": 0.00269263690712392, "phrase": "state-of-the-art_summarisation_systems"}, {"score": 0.0024842242921857705, "phrase": "textual_entailment"}, {"score": 0.0024075916292945715, "phrase": "statistical_and_cognitive-based_techniques"}, {"score": 0.002271476019266231, "phrase": "abstractive-oriented_approach"}, {"score": 0.0022112700457629494, "phrase": "abstractive_summarisation"}, {"score": 0.0021526564019119466, "phrase": "different_domains"}, {"score": 0.0021334650920198715, "phrase": "textual_genres"}, {"score": 0.0021049977753042253, "phrase": "traditional_texts"}], "paper_keywords": [""], "paper_abstract": "In this paper, we present a Text Summarisation tool, COMPENDIUM, capable of generating the most common types of summaries. Regarding the input, single- and multi-document summaries can be produced; as the output, the summaries can be extractive or abstractive-oriented; and finally, concerning their purpose, the summaries can be generic, query-focused, or sentiment-based. The proposed architecture for COMPENDIUM is divided in various stages, making a distinction between core and additional stages. The former constitute the backbone of the tool and are common for the generation of any type of summary, whereas the latter are used for enhancing the capabilities of the tool. The main contributions of COMPENDIUM with respect to the state-of-the-art summarisation systems are that (i) it specifically deals with the problem of redundancy, by means of textual entailment; (ii) it combines statistical and cognitive-based techniques for determining relevant content; and (iii) it proposes an abstractive-oriented approach for facing the challenge of abstractive summarisation. The evaluation performed in different domains and textual genres, comprising traditional texts, as well as texts extracted from the Web 2.0, shows that COMPENDIUM is very competitive and appropriate to be used as a tool for generating summaries.", "paper_title": "COMPENDIUM: a text summarisation tool for generating summaries of multiple purposes, domains, and genres", "paper_id": "WOS:000315410800001"}