{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "web-based_services"}, {"score": 0.012706047650113598, "phrase": "affective_factors"}, {"score": 0.004864243758130989, "phrase": "continuance_intention"}, {"score": 0.0046432244185370605, "phrase": "expectation-confirmation_model"}, {"score": 0.004564714619478362, "phrase": "cognitive_factors"}, {"score": 0.004509778756199663, "phrase": "perceived_usefulness"}, {"score": 0.004227297479492541, "phrase": "user_satisfaction"}, {"score": 0.00400304045240329, "phrase": "perceived_playfulness"}, {"score": 0.003978866233891427, "phrase": "perceived_enjoyment"}, {"score": 0.0038368442918503072, "phrase": "existing_continuance_intention-related_studies"}, {"score": 0.003802135020791801, "phrase": "short-term_emotional_factors"}, {"score": 0.003711098637056057, "phrase": "user's_continued_usage"}, {"score": 0.003677522700365517, "phrase": "web-based_service"}, {"score": 0.003611276113861415, "phrase": "long-term_relationship"}, {"score": 0.003327579120205541, "phrase": "established_relationship"}, {"score": 0.0032184697893776052, "phrase": "user's_continuance_intention"}, {"score": 0.0030661003993462665, "phrase": "repetitive_usage"}, {"score": 0.0029926343123778056, "phrase": "affective_and_cognitive_factors"}, {"score": 0.0029655392888938295, "phrase": "consumers'_continuance_intention"}, {"score": 0.0028509258879069006, "phrase": "extended_ecm."}, {"score": 0.0027574024919144635, "phrase": "persistent_affective_factors"}, {"score": 0.0027159094186967247, "phrase": "cognitive_and_affective_factors"}, {"score": 0.0026268035120419536, "phrase": "users'_continued_intention"}, {"score": 0.0021632743048552536, "phrase": "users'_continuance_intention"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Affective factors", " Behavioral research", " Continuance intention", " Expectation-confirmation model", " Familiarity", " Intimacy", " Web-based services"], "paper_abstract": "To date, plenty of theories, such as the expectation-confirmation model (ECM), have been proposed to explain why and how consumers are motivated to continue to use web-based services. In particular, various affective factors have been proposed to explain user satisfaction and continued use of web-based services recently in the IS community. In IS continuance research, several affective factors, such as perceived playfulness, perceived enjoyment and pleasure, have been examined. Affective factors discussed in the existing continuance intention-related studies are mostly short-term emotional factors like this. However, if a user's continued usage of a web-based service can be interpreted as a long-term relationship between a user and the service, then the factors such as familiarity and intimacy which are the emotions created accumulatively over time based on an established relationship with the user can be helpful for better explaining the user's continuance intention. Also, if relationships between consumers and web-based services have been built up due to repetitive usage, then we can assume that both affective and cognitive factors may explain consumers' continuance intention. Hence, the purpose of this paper is to propose an extended ECM. We focus on two new constructs, familiarity and intimacy, as persistent affective factors. To investigate how cognitive and affective factors are interrelated in continuance intention, we conducted surveys focusing on users' continued intention to use web-based services. The results indicate that continuance intention is affected conjointly by cognitive factors, such as perceived usefulness, and affective factors, such as familiarity and intimacy. However, the effects of affective factors such as intimacy were larger than those of cognitive factors such as perceived usefulness. In addition, the results indicate that intimacy, a purer affective concept than familiarity, affects users' continuance intention more than familiarity. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Intimacy, familiarity and continuance intention: An extended expectation-confirmation model in web-based services", "paper_id": "WOS:000291343900006"}