{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "prior_domain_knowledge"}, {"score": 0.010532353632887312, "phrase": "inductive_machine_learning"}, {"score": 0.007630958021694648, "phrase": "domain_knowledge"}, {"score": 0.006121791349218538, "phrase": "imbalanced_data_sets"}, {"score": 0.004688321299229397, "phrase": "real-world_problems"}, {"score": 0.004617455679463816, "phrase": "considerable_amount"}, {"score": 0.004246333442872459, "phrase": "data_sets"}, {"score": 0.004087609837102023, "phrase": "explicitly_expressed_domain_knowledge"}, {"score": 0.0034963129868796033, "phrase": "key_existing_approaches"}, {"score": 0.0031663432942179853, "phrase": "novel_hierarchical_semi-parametric_machine_learning_method"}, {"score": 0.0029902938871031607, "phrase": "support_vector_machine"}, {"score": 0.002900426826591769, "phrase": "vector_quantization"}, {"score": 0.0025282151875392817, "phrase": "learning_process"}, {"score": 0.002499438189264537, "phrase": "vqsvm_method"}, {"score": 0.0024242869058849446, "phrase": "fitting_imbalance_data"}, {"score": 0.0022806798371116698, "phrase": "svm_framework"}, {"score": 0.0022547140008848912, "phrase": "effective_way"}, {"score": 0.0022037099279380093, "phrase": "svm"}, {"score": 0.0021785729703227698, "phrase": "imbalance_ratio"}, {"score": 0.002153767124561527, "phrase": "data_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Prior domain knowledge", " Inductive machine learning", " Imbalance data", " Support vector machine"], "paper_abstract": "When dealing with real-world problems, there is considerable amount of prior domain knowledge that can provide insights on various aspect of the problem. On the other hand, many machine learning methods rely solely on the data sets for their learning phase and do not take into account any explicitly expressed domain knowledge. This paper proposes a framework that investigates and enables the incorporation of prior domain knowledge with respect to three key characteristics of inductive machine learning algorithms: consistency, generalization and convergence. The framework is used to review, classify and analyse key existing approaches to incorporating domain knowledge into inductive machine learning, as well as to consider the risks of doing so. The paper also demonstrates the design of a novel hierarchical semi-parametric machine learning method, capable of incorporating prior domain knowledge. The method-VQSVM-extends the support vector machine (SVM) family of methods with vector quantization (VQ) techniques to address the problem of learning from imbalanced data sets. The paper presents the results of testing the method on a collection of imbalanced data sets with various imbalance ratios and various numbers of subclasses. The learning process of the VQSVM method utilizes some domain knowledge to solve problem of fitting imbalance data. The experiments in the paper demonstrate that enabling the incorporation of prior domain knowledge into the SVM framework is an effective way to overcome the sensitivity of SVM towards the imbalance ratio in a data set. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "VQSVM: A case study for incorporating prior domain knowledge into inductive machine learning", "paper_id": "WOS:000281612300034"}