{"auto_keywords": [{"score": 0.04073657088368252, "phrase": "research_model"}, {"score": 0.03926342325626137, "phrase": "ocr_tools"}, {"score": 0.00481495049065317, "phrase": "online_customer_relations_tools"}, {"score": 0.00465067040500426, "phrase": "purpose_-_the_purpose"}, {"score": 0.004414653335578912, "phrase": "online_customer_relations"}, {"score": 0.004104132253183181, "phrase": "different_perceptions"}, {"score": 0.0037627064621795514, "phrase": "organizations'_perspective"}, {"score": 0.003697895355947004, "phrase": "customers'_perspective"}, {"score": 0.003621588555525458, "phrase": "actual_implementation"}, {"score": 0.003413800638453572, "phrase": "six_ocr_tools"}, {"score": 0.0033317342432676385, "phrase": "\"contact_form"}, {"score": 0.0030756833977949273, "phrase": "\"order-tracking_system"}, {"score": 0.0030017207229983385, "phrase": "alternative_situation"}, {"score": 0.0028000270988465486, "phrase": "effective_ocrs"}, {"score": 0.002336655334451464, "phrase": "commercial_transactions"}, {"score": 0.0022101055924375725, "phrase": "individual_tool"}, {"score": 0.0021049977753042253, "phrase": "distinct_perceptions"}], "paper_keywords": ["customer relations", " customer satisfaction", " online operations", " worldwide web", " electronic commerce"], "paper_abstract": "Purpose - The purpose of this paper is to examine the differences in how customers and organizations perceive online customer relations (OCR) tools - the online communication tools at the interface between organizations and customers - and how the different perceptions affect the implementation, use, and effectiveness of these tools. Design/methodology/approach - The research model is tested empirically in three separate studies that explore the organizations' perspective of OCR tools, the customers' perspective of OCR tools, and the actual implementation and use of these tools. Findings - The findings in this paper vary across the six OCR tools examined. The findings for the \"contact form\" suggest that the misalignment in the perspectives of organizations and customers can chive less effective online relationships. Conversely, the findings for the \"order-tracking system\" illustrate the potential of the alternative situation, when the attitudes of organizations and customers are aligned. Practical implications - This paper identifies two potential barriers to effective OCRs: misalignment between the attitudes of organizations and customers, and inconsistency between attitude and behavior on the part of organizations. The findings suggest ways for organizations to improve the effectiveness of their online strategy. Originality/value - The research model emphasizes the implementation and use of tools that support relationships rather than commercial transactions, and assumes the availability of a portfolio of OCR tools rather than concentrating on an individual tool. This study contributes by developing and testing a research model that includes the distinct perceptions and behaviors of both organizations and customers.", "paper_title": "The effectiveness of online customer relations tools - Comparing the perspectives of organizations and customers", "paper_id": "WOS:000257816500002"}