{"auto_keywords": [{"score": 0.03442732612455498, "phrase": "relay_nodes"}, {"score": 0.00481495049065317, "phrase": "mobile_opportunistic_networks"}, {"score": 0.004658426838467567, "phrase": "single_item"}, {"score": 0.004506968388996092, "phrase": "mobile_nodes"}, {"score": 0.004473982381245469, "phrase": "opportunistic_copying"}, {"score": 0.004360412703519539, "phrase": "radio_contact"}, {"score": 0.003536346954940087, "phrase": "key_contribution"}, {"score": 0.0034212450542713607, "phrase": "joint_evolution"}, {"score": 0.0033961782274326948, "phrase": "content_popularity"}, {"score": 0.002985988377995789, "phrase": "fluid_limit"}, {"score": 0.002953217535105884, "phrase": "joint_evolution_model"}, {"score": 0.002920805294420291, "phrase": "optimal_policies"}, {"score": 0.0027844017803674444, "phrase": "desired_fraction"}, {"score": 0.0025490525773769063, "phrase": "time-threshold_policy"}, {"score": 0.00241214634516517, "phrase": "optimal_time-threshold_up"}, {"score": 0.002191993482098238, "phrase": "numerical_evaluations"}, {"score": 0.0021049977753042253, "phrase": "optimally_controlled_co-evolution_model"}], "paper_keywords": ["Delay tolerant networking", " epidemic spread of information", " influence spread", " P2P content spread", " fluid limits"], "paper_abstract": "We consider a setting in which a single item of content is disseminated in a population of mobile nodes by opportunistic copying when pairs of nodes come in radio contact. The nodes in the population may either be interested in receiving the content (referred to as destinations) or not yet interested in receiving the content (referred to as relays). We consider a model for the evolution of popularity, the process by which relays get converted into destinations. A key contribution of our work is to model and study the joint evolution of content popularity and its spread in the population. Copying the content to relay nodes is beneficial since they can help spread the content to destinations, and could themselves be converted into destinations. We derive a fluid limit for the joint evolution model and obtain optimal policies for copying to relay nodes in order to deliver content to a desired fraction of destinations, while limiting the fraction of relay nodes that get the content but never turn into destinations. We prove that a time-threshold policy is optimal for controlling the copying to relays, i.e., there is an optimal time-threshold up to which all opportunities for copying to relays are exploited, and after which relays are not copied to. We then utilize simulations and numerical evaluations to provide insights into the effects of various system parameters on the optimally controlled co-evolution model.", "paper_title": "Co-Evolution of Content Spread and Popularity in Mobile Opportunistic Networks", "paper_id": "WOS:000343317500005"}