{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "proton_transfer"}, {"score": 0.014845464870395174, "phrase": "hydronium_ion"}, {"score": 0.014544982928228364, "phrase": "water_molecules"}, {"score": 0.013456836914882237, "phrase": "proton_transfer_mechanism"}, {"score": 0.010098030315599256, "phrase": "proton_transfer_process"}, {"score": 0.004755650013733963, "phrase": "aqueous_system"}, {"score": 0.004342430078306461, "phrase": "density_functional_theory"}, {"score": 0.00428892403807229, "phrase": "moller-plesset_perturbation"}, {"score": 0.0041666157975446564, "phrase": "potential_energy_surface"}, {"score": 0.003835972725191194, "phrase": "many-body_analysis"}, {"score": 0.0036653985479652854, "phrase": "relaxation_energy"}, {"score": 0.0031977096047057898, "phrase": "binding_energy"}, {"score": 0.0031193028729331667, "phrase": "complex_decreases"}, {"score": 0.002305799666781492, "phrase": "significant_differences"}, {"score": 0.002258546887303777, "phrase": "relaxation_energies"}], "paper_keywords": ["Hydronium ion", " Many-body analysis", " Proton transfer mechanism"], "paper_abstract": "The energetics of the mechanism of proton transfer from a hydronium ion to one of the water molecules in its first solvation shell are studied using density functional theory and the Moller-Plesset perturbation (MP2) method. The potential energy surface of the proton transfer mechanism is obtained at the B3LYP and MP2 levels with the 6-311++G** basis set. Many-body analysis is applied to the proton transfer mechanism to obtain the change in relaxation energy, two-body, three-body and four-body energies when proton transfer occurs from the hydronium ion to one of the water molecules in its first solvation shell. It is observed that the binding energy (BE) of the complex decreases during the proton transfer process at both levels of theory. During the proton transfer process, the % contribution of the total two-body energy to the binding energy of the complex increases from 62.9 to 68.09% (39.9 to 45.95%), and that of the total three-body increases from 25.9 to 27.09% (24.16 to 26.17%) at the B3LYP/6-311++G** (MP2/ 6-311++G**) level. There is almost no change in the water-water-water three-body interaction energy during the proton transfer process at both levels of theory. The contribution of the relaxation energy and the total four-body energy to the binding energy of the complex is greater at the MP2 level than at the B3LYP level. Significant differences are found between the relaxation energies, the hydronium-water interaction energies and the four-body interaction energies at the B3LYP and MP2 levels.", "paper_title": "Many-body energies during proton transfer in an aqueous system", "paper_id": "WOS:000281321500002"}