{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "spanning_tree"}, {"score": 0.004701985831087475, "phrase": "n_obstacles"}, {"score": 0.0043786774510943625, "phrase": "straight_line_minimum_cost"}, {"score": 0.003962899903266524, "phrase": "tree_edges"}, {"score": 0.003815064377019477, "phrase": "infinite_lines"}, {"score": 0.003371508176308189, "phrase": "asano_et_al"}, {"score": 0.0032456625605347417, "phrase": "pairwise_disjoint_line_segments"}, {"score": 0.003007846011394511, "phrase": "total_cost"}, {"score": 0.002923214590192792, "phrase": "lower_bound_constructions"}, {"score": 0.0027610089418453614, "phrase": "tight_bounds"}, {"score": 0.0027218799769229596, "phrase": "minimum_cost"}, {"score": 0.0026452734009203764, "phrase": "special_case"}, {"score": 0.00258307991054107, "phrase": "interior_disjoint_line_segments"}, {"score": 0.0025343769150179764, "phrase": "convex_subdivision"}], "paper_keywords": ["crossing number", " spanning trees"], "paper_abstract": "Given m points (sites) and n obstacles (barriers) in the plane, we address the problem of finding a straight line minimum cost spanning tree on the sites, where the cost is proportional to the number of intersections (crossings) between tree edges and barriers. If the barriers are infinite lines, it is known that there is a spanning tree such that every barrier is crossed by O(root m) tree edges, and this bound is asymptotically optimal. Asano et al. showed that if the barriers are pairwise disjoint line segments, then there is a spanning tree such that every barrier crosses at most 4 tree edges and so the total cost is at most 4n. Lower bound constructions are known with 3 crossings per barrier and 2n total cost. We obtain tight bounds on the minimum cost of spanning trees in the special case where the barriers are interior disjoint line segments that form a convex subdivision of the plane and there is a point in every cell of the subdivision. In particular, we show that there is a spanning tree such that every barrier crosses at most 2 tree edges, and there is a spanning tree of total cost 5n/3. Both bounds are the best possible.", "paper_title": "Tight bounds for connecting sites across barriers", "paper_id": "WOS:000259563600005"}