{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "challenge_decryption"}, {"score": 0.04712665802421912, "phrase": "public-key_encryption"}, {"score": 0.00467424463996457, "phrase": "adaptive_chosen-ciphertext_attacks"}, {"score": 0.00459568664065473, "phrase": "central_notion"}, {"score": 0.00416882434439484, "phrase": "challenge_ciphertext"}, {"score": 0.004116139569480336, "phrase": "decryption_oracle"}, {"score": 0.003995772867224968, "phrase": "\"no-challenge-decryption\"_condition"}, {"score": 0.0034445472801689046, "phrase": "latter_perception"}, {"score": 0.00327356326590461, "phrase": "resulting_notions"}, {"score": 0.002994449398035894, "phrase": "adversary's_attack"}, {"score": 0.0024320326084093465, "phrase": "key-encapsulation_mechanisms"}, {"score": 0.0023507916951658455, "phrase": "subtle_foundational_issues"}, {"score": 0.0021049977753042253, "phrase": "\"minor\"_definitional_\"details"}], "paper_keywords": ["Definitions", " Foundations", " Encryption", " Chosen-ciphertext attack"], "paper_abstract": "IND-CCA (indistinguishability under adaptive chosen-ciphertext attacks) is a central notion of security for public-key encryption, defined and targeted in many papers. Non-triviality of the notion requires that the adversary not query the challenge ciphertext to the decryption oracle. We point out that this \"no-challenge-decryption\" condition can be formalized in several different ways and the literature is not consistent, sometimes doing it one way, sometimes another, and assuming it makes no difference. We show that the latter perception is incorrect. It does make a difference, for the resulting notions are not equivalent. Specifically, we consider four notions corresponding to whether challenge decryption is disallowed in both phases of the adversary's attack or just in the second, and, orthogonally, whether the disallowance is \"penalty\" or \"exclusion\" based. We show that the notions are not all equivalent for public-key encryption (PKE). We then show that, in contrast, they are equivalent for key-encapsulation mechanisms (KEMs). Our work shows that subtle foundational issues exist even with notions that are supposedly well-established and unambiguous, and highlights the need to be careful and precise with regard to \"minor\" definitional \"details\".", "paper_title": "Subtleties in the Definition of IND-CCA: When and How Should Challenge Decryption Be Disallowed?", "paper_id": "WOS:000347718200002"}