{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "datalog_reasoner"}, {"score": 0.004756233569671719, "phrase": "conjunctive_queries"}, {"score": 0.004717485406306594, "phrase": "ontology-enriched_datasets"}, {"score": 0.004659951478263083, "phrase": "core_reasoning_task"}, {"score": 0.004276306563103443, "phrase": "query_answering_procedures"}, {"score": 0.0041725881174377345, "phrase": "ontology_language"}, {"score": 0.0040713749949601915, "phrase": "query_answers"}, {"score": 0.0038446194432899183, "phrase": "hybrid_approach"}, {"score": 0.003400198866111204, "phrase": "key_feature"}, {"score": 0.002759058732719621, "phrase": "first-order_knowledge_representation_languages"}, {"score": 0.002659142621852998, "phrase": "existential_quantification"}, {"score": 0.0024903420152789135, "phrase": "fully-fledged_reasoner"}, {"score": 0.0023610946923597405, "phrase": "'black_boxes"}, {"score": 0.002275557501858879, "phrase": "pagoda_system"}, {"score": 0.002229380111189829, "phrase": "datalog_reasoner_rdfox"}, {"score": 0.0021049977753042253, "phrase": "scalable_pay-as-you-go_query_answering"}], "paper_keywords": [""], "paper_abstract": "Answering conjunctive queries over ontology-enriched datasets is a core reasoning task for many applications. Query answering is, however, computationally very expensive, which has led to the development of query answering procedures that sacrifice either expressive power of the ontology language, or the completeness of query answers in order to improve scalability. In this paper, we describe a hybrid approach to query answering over OWL 2 ontologies that combines a datalog reasoner with a fully-fledged OWL 2 reasoner in order to provide scalable 'pay-as-you-go' performance. The key feature of our approach is that it delegates the bulk of the computation to the datalog reasoner and resorts to expensive OWL 2 reasoning only as necessary to fully answer the query. Furthermore, although our main goal is to efficiently answer queries over OWL 2 ontologies and data, our technical results are very general and our approach is applicable to first-order knowledge representation languages that can be captured by rules allowing for existential quantification and disjunction in the head; our only assumption is the availability of a datalog reasoner and a fully-fledged reasoner for the language of interest, both of which are used as 'black boxes'. We have implemented our techniques in the PAGOdA system, which combines the datalog reasoner RDFox and the OWL 2 reasoner HermiT. Our extensive evaluation shows that PAGOdA succeeds in providing scalable pay-as-you-go query answering for a wide range of OWL 2 ontologies, datasets and queries.", "paper_title": "PAGOdA: Pay-As-You-Go Ontology Query Answering Using a Datalog Reasoner", "paper_id": "WOS:000365178500002"}