{"auto_keywords": [{"score": 0.04930986456658361, "phrase": "adc"}, {"score": 0.021518895023583836, "phrase": "tha"}, {"score": 0.004676575291629554, "phrase": "direct_if_sampling_receivers"}, {"score": 0.004646366831056171, "phrase": "satellite_communication_systems"}, {"score": 0.004483659121004398, "phrase": "track-and-hold_amplifier"}, {"score": 0.004397313229350093, "phrase": "low_impedance_reference_and_interpolation_resistive_ladder"}, {"score": 0.004257067039134535, "phrase": "good_performance"}, {"score": 0.004229556887896042, "phrase": "input_frequencies"}, {"score": 0.004134658048970194, "phrase": "sampling_rate"}, {"score": 0.004094639048362357, "phrase": "final_post_layout_simulated_system"}, {"score": 0.003989797665674148, "phrase": "input_frequency"}, {"score": 0.003667218991565442, "phrase": "lsb"}, {"score": 0.003359647377874098, "phrase": "overall_performance"}, {"score": 0.0031079352545607267, "phrase": "complete_adc."}, {"score": 0.0028195727965553367, "phrase": "droop_rate"}, {"score": 0.002599763359352916, "phrase": "input_sensitivity"}, {"score": 0.0025578967205807843, "phrase": "input_offset_voltage"}, {"score": 0.002366110899738696, "phrase": "experimental_results"}, {"score": 0.0023431692392929353, "phrase": "good_agreement"}], "paper_keywords": ["Analog to digital converter", " Folding-interpolating", " High speed", " SiGe"], "paper_abstract": "This paper describes the design of a high-speed 8-bit Analog to digital converter (ADC) used in direct IF sampling receivers for satellite communication systems in a 0.25 mu m, 190 GHz SiGe BiCMOS process. A high resolution front-end track-and-hold amplifier (THA), a low impedance reference and interpolation resistive ladder and high resolution comparators enable the ADC to achieve good performance for input frequencies of up to one-quarter of the sampling rate. The final post layout simulated system features an ENOB of 7.2-bits at an input frequency of 3.125 GHz and a sampling rate of 12.5 GS/s with a FOM of 12.9 pJ per conversion. Both DNL and INL are within 0.5 and 1 LSB, respectively. The converter occupies 10 mm(2) and dissipates 14 W from a 3.3 V supply. The THA and the comparator, as the most critical building blocks affecting the overall performance of the ADC, were implemented experimentally and fully characterized in order to verify their performance and to ascertain the possibility of implementing the complete ADC. The THA occupies an area of 0.5 mm(2). It features a SNDR of 47 dB or 7.5-bits ENOB for a 3 GHz bandwidth, a hold time of 21 ps with a droop rate of 11 mV/80 ps and a power dissipation of 230 mW from a 3.3 V supply. The comparator occupies an area of 0.38 mm(2) and exhibits an input sensitivity of +/- 2 mV, an input offset voltage of 1.5 mV, latch and recovery times of 19 and 21 ps, respectively, and a power dissipation of 150 mW from a 3.3 V supply. The experimental results are in good agreement with simulation and expected specifications and indicate that both circuits are suitable for the implementation of the ADC and help to validate that the 8-bit 12.5 GS/s ADC is feasible for implementation in a 0.25 mu m SiGe process.", "paper_title": "An 8-bit 12.5-GSample/s SiGe ADC", "paper_id": "WOS:000277095700003"}