{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pso_method"}, {"score": 0.04192102071091637, "phrase": "available_knowledge"}, {"score": 0.04141365795578276, "phrase": "specific_problem"}, {"score": 0.007681405810497366, "phrase": "performance_improvement"}, {"score": 0.003818210967854446, "phrase": "search_performance"}, {"score": 0.0034944094552943, "phrase": "specific_optimization_problem"}, {"score": 0.003407026489727146, "phrase": "powerful_blind-search_ability"}, {"score": 0.0032115093493071366, "phrase": "so-called_knowledge_supported_pso"}, {"score": 0.0029266219967426224, "phrase": "original_pso_approach"}, {"score": 0.002889778121878728, "phrase": "knowledge-based_mode"}, {"score": 0.002689564715486338, "phrase": "proposed_ks-pso_method"}, {"score": 0.002556625752785268, "phrase": "computer_engineering"}, {"score": 0.002461241017147324, "phrase": "fractional-order_pid_controller"}, {"score": 0.0023996317685956213, "phrase": "single-layer_perceptron"}, {"score": 0.0023694065215394593, "phrase": "simulation_results"}, {"score": 0.00231987280116332, "phrase": "ks-pso"}, {"score": 0.0022051664509486206, "phrase": "novel_version"}, {"score": 0.0021773853011112882, "phrase": "well-known_pso_method"}, {"score": 0.0021049977753042253, "phrase": "original_blind-search_capability"}], "paper_keywords": ["Particle Swarm Optimization", " Knowledge-supported search", " Fractional-Order PID tuning", " Single-layer perceptron training", " Optimization techniques", " Searching"], "paper_abstract": "Purpose - The Particle Swarm Optimization (PSO) method makes few or no assumptions about the optimization problem at hand and is applicable without much information about the problem. Although this fact constitutes one of the most important advantages of the PSO method, it can also be considered as a waste of available knowledge about the specific problem, which could have drastically improved the search performance. This paper aims to introduce an improvement to the PSO method such that the exploitation of any available knowledge about the specific optimization problem can be combined with the powerful blind-search ability of the original method. Design/methodology/approach - The improvement is achieved by the so-called Knowledge Supported PSO (KS-PSO), which consists of a combination of two modes: a mode that operates according to the original PSO approach and a knowledge-based mode which the user has to design for the specific problem. Findings - The application of the proposed KS-PSO method is presented for two rather different optimization problems chosen from the domain of control and computer engineering: the model-free tuning of a Fractional-Order PID controller and the training of a single-layer perceptron. The simulation results demonstrate the performance improvement in KS-PSO as compared to the original PSO. Originality/value - This paper presents a novel version of the well-known PSO method, which achieves performance improvement by combining the original blind-search capability with the exploitation of available knowledge about the specific problem.", "paper_title": "A knowledge-supported improvement of the PSO method", "paper_id": "WOS:000318456300008"}