{"auto_keywords": [{"score": 0.05007834503226341, "phrase": "user_preferences"}, {"score": 0.049718935796994206, "phrase": "many-objective_optimization"}, {"score": 0.04179366376151451, "phrase": "different_levels"}, {"score": 0.02931228819305187, "phrase": "aep"}, {"score": 0.0046018264570209765, "phrase": "many-objective_optimization_problems"}, {"score": 0.004299621153829837, "phrase": "multi-objective_optimization"}, {"score": 0.0036691380448651443, "phrase": "new_model"}, {"score": 0.003083849594367653, "phrase": "parameter_epsilon"}, {"score": 0.0027017308406240563, "phrase": "epsilon_values"}, {"score": 0.0026611838252683507, "phrase": "user_interaction"}, {"score": 0.0024120247307686084, "phrase": "evolutionary_algorithm"}, {"score": 0.0023848164282879885, "phrase": "optimization_problem"}, {"score": 0.0023490143960001675, "phrase": "i.e._a_utilization_planning"}, {"score": 0.002279011030331704, "phrase": "considered_benchmarks"}, {"score": 0.0021049977753042253, "phrase": "basic_method"}], "paper_keywords": ["Evolutionary algorithms", " Many-objective optimization", " Nurse rostering problem", " Relation epsilon-preferred", " User preferences"], "paper_abstract": "During the last 10 years, many-objective optimization problems, i.e. optimization problems with more than three objectives, are getting more and more important in the area of multi-objective optimization. Many real-world optimization problems consist of more than three mutually dependent subproblems, that have to be considered in parallel. Furthermore, the objectives have different levels of importance. For this, priorities have to be assigned to the objectives. In this paper we present a new model for many-objective optimization called Prio-epsilon-Preferred, where the objectives can have different levels of priorities or user preferences. This relation is used for ranking a set of solutions such that an ordering of the solutions is determined. Prio-epsilon-Preferred is controlled by a parameter epsilon, that is problem specific and has to be adjusted experimentally by the developer. Therefore we also present an extension called Adapted-epsilon-Preferred (AEP), that determines the epsilon values automatically without any user interaction. To demonstrate the efficiency of our approach, experiments are performed. The method based on Prio-epsilon-Preferred is used to guide the search of an Evolutionary Algorithm. As optimization problem a very complex scheduling problem, i.e. a utilization planning in a hospital is used. The considered benchmarks consist of 2 up to 90 optimization objectives. First, Prio-epsilon-Preferred where epsilon is set \"by hand\", is compared to the basic method NSGA-II. It is shown that Prio-epsilon-Preferred clearly outperforms NSGA-II. Furthermore, it turns out that the results obtained by AEP are as good as if epsilon is adjusted manually.", "paper_title": "Incorporating user preferences in many-objective optimization using relation epsilon-preferred", "paper_id": "WOS:000360156500013"}