{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "research_units"}, {"score": 0.04933518495635904, "phrase": "reference_profiles"}, {"score": 0.004575977644865379, "phrase": "multiple_criteria"}, {"score": 0.0044002186469797476, "phrase": "real-world_problem"}, {"score": 0.004100620365805411, "phrase": "different_qualities"}, {"score": 0.004052701031142039, "phrase": "acquired_effects"}, {"score": 0.003958529104387973, "phrase": "evaluation_period"}, {"score": 0.0036315039559860654, "phrase": "subsequent_analysis"}, {"score": 0.003357633232360232, "phrase": "proposed_outranking_relation"}, {"score": 0.0030440661915657175, "phrase": "class_assignments"}, {"score": 0.0029966788947444535, "phrase": "attained_comprehensive_scores"}, {"score": 0.002622465142275264, "phrase": "corresponding_lower_profile"}, {"score": 0.0025715131759585052, "phrase": "respective_upper_profile"}, {"score": 0.002501835053002899, "phrase": "desired_cardinalities"}, {"score": 0.0022948742034852917, "phrase": "different_ways"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple criteria decision aiding", " Reference profiles", " Outranking", " Inference procedure", " Class cardinalities", " Parametric evaluation"], "paper_abstract": "We introduce a method that jointly considers multiple criteria sorting and ranking. The method derives from a real-world problem of parametric evaluation of research units carried out by the Polish Ministry of Science and Higher Education. It assigns the units to three classes representing different qualities of both acquired effects and activities undertook in the evaluation period. Although units placed in the same class are guaranteed the same level of funding, they are not considered indifferent in the subsequent analysis and, thus, need to be ordered from the best to the worst in each class. A proposed outranking relation compares the units pairwise and the result is exploited so as to get a ranking of the units. The ranking is transformed to class assignments based on the attained comprehensive scores and ranks. To enhance interpretability of the results, we infer two reference profiles (artificial reference research units) separating the classes so that each class accumulates units ranked not worse than the corresponding lower profile and worse than the respective upper profile. The procedure takes into account desired cardinalities of classes, i.e., shares of units that are judged as leading, average, or weak. We discuss several procedures with different ways of inferring the reference profiles and scoring the units. We also analyze robustness of the results. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Parametric evaluation of research units with respect to reference profiles", "paper_id": "WOS:000351792600004"}