{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "human_behavior_data"}, {"score": 0.004758053266234474, "phrase": "fuzzy_windowing"}, {"score": 0.004646258518859209, "phrase": "driver-car-environment_system"}, {"score": 0.003910278811774747, "phrase": "rather_automatic_procedures"}, {"score": 0.0035977623578676496, "phrase": "human_being"}, {"score": 0.0026714812866037584, "phrase": "nonlinear_relationships"}, {"score": 0.0026241684260044414, "phrase": "mfmv_exploration"}, {"score": 0.0025776913268808124, "phrase": "experimental_database"}, {"score": 0.002414191082427217, "phrase": "multiple_correspondence_analysis"}, {"score": 0.002315574871863272, "phrase": "inference_analysis"}, {"score": 0.002181626277903721, "phrase": "car_driving_study_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiple correspondence analysis", " Descriptive analysis", " Fuzzy windowing", " Car driving", " Driving simulator"], "paper_abstract": "In most human component system studies performed in simulators, several factors (or independent variables) (at least two, i.e., individual and time) and many variables (or dependent variables) are present. Large and complex databases have to be analyzed. Instead of using rather automatic procedures, this article suggest that, for a very first analysis at least, the human being must be present and he/she must choose a method being adapted to the data, which is different to run a method supposing that the data fit such or such model. This article suggests starting the analysis while keeping both the multifactorial (MF) and multivariate (MV) aspects. To achieve this aim, with the possibility to show nonlinear relationships, a MFMV exploration of the experimental database is performed using the pair (fuzzy space windowing, Multiple Correspondence Analysis). Then may come an inference analysis. This long (due to multiple large graphical views) but rich procedure is illustrated and discussed using a car driving study example. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Multivariate analysis of human behavior data using fuzzy windowing: Example with driver-car-environment system", "paper_id": "WOS:000306204400010"}