{"auto_keywords": [{"score": 0.047791354135974656, "phrase": "internet_new_generation"}, {"score": 0.008009729077852083, "phrase": "agent_technology"}, {"score": 0.007070922780198604, "phrase": "best_service_provider"}, {"score": 0.00481495049065317, "phrase": "dynamic_negotiation"}, {"score": 0.003811010743703935, "phrase": "diffserv_architecture"}, {"score": 0.0037493114715625784, "phrase": "policy-based_networking_management"}, {"score": 0.003531474887552889, "phrase": "control_infrastructures"}, {"score": 0.0031329184724341592, "phrase": "technical_parameters"}, {"score": 0.002704554429386671, "phrase": "user_interface"}, {"score": 0.0026175952455594277, "phrase": "user_access"}, {"score": 0.0025059724686541263, "phrase": "connectionist_clustering"}, {"score": 0.0024253827365474734, "phrase": "negotiation_profiles"}, {"score": 0.0021868576711359376, "phrase": "sls"}, {"score": 0.002151388538895855, "phrase": "user's_behalf"}, {"score": 0.0021049977753042253, "phrase": "users_behavior"}], "paper_keywords": [""], "paper_abstract": "The Internet New Generation provides a service adapted to the needs of the applications (particularly real time) including a Quality of Service (QoS) guaranteed. It is based on the DiffServ architecture and the policy-based networking management. It also uses the agent technology to solve problems and control infrastructures and flows. Access to the Internet New Generation is more difficult. The user has to choose the best service provider and indicate the technical parameters that he needs. In this paper, we investigate the use of some techniques of the AI (Artificial Intelligence) domain to implement a user interface in order to help the user access to the Internet New Generation. We use the connectionist clustering in the management of the negotiation profiles. Then we use the agent technology to help the user to choose the best service provider, dynamically negotiate the SLS on the user's behalf, follow the users behavior to be able to anticipate the negotiations and manage the re-negotiations.", "paper_title": "Artificial intelligence techniques in the dynamic negotiation of QoS: A user interface for the Internet New Generation", "paper_id": "WOS:000241448700013"}