{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "potential_experts"}, {"score": 0.029420333683948783, "phrase": "probabilistic_model"}, {"score": 0.028930494932271376, "phrase": "selection_preferences"}, {"score": 0.00481495049065317, "phrase": "exploring_question_selection_bias"}, {"score": 0.004773692073488661, "phrase": "identify_experts"}, {"score": 0.004692227830462433, "phrase": "community_question_answering"}, {"score": 0.004213519983188574, "phrase": "small_number"}, {"score": 0.0041773934798743405, "phrase": "highly_active_users"}, {"score": 0.0040186038781533946, "phrase": "large_number"}, {"score": 0.0039841418890102925, "phrase": "high-quality_useful_answers"}, {"score": 0.0038825121288253435, "phrase": "community_managers"}, {"score": 0.003170811465728631, "phrase": "current_experts"}, {"score": 0.0031435996745634424, "phrase": "cqa"}, {"score": 0.0025230952890994236, "phrase": "machine_learning_methods"}, {"score": 0.0023548511815224098, "phrase": "ordinary_users"}, {"score": 0.002255431275670053, "phrase": "higher_accuracy"}, {"score": 0.0021416404045850224, "phrase": "baseline_measures"}, {"score": 0.0021049977753042253, "phrase": "predictive_performance"}], "paper_keywords": ["Experimentation", " Human Factors", " Algorithms", " Expert identification", " question selection process", " community question answering"], "paper_abstract": "Community Question Answering (CQA) services enable their users to exchange knowledge in the form of questions and answers. These communities thrive as a result of a small number of highly active users, typically called experts, who provide a large number of high-quality useful answers. Expert identification techniques enable community managers to take measures to retain the experts in the community. There is further value in identifying the experts during the first few weeks of their participation as it would allow measures to nurture and retain them. In this article we address two problems: (a) How to identify current experts in CQA? and (b) How to identify users who have potential of becoming experts in future (potential experts)? In particular, we propose a probabilistic model that captures the selection preferences of users based on the questions they choose for answering. The probabilistic model allows us to run machine learning methods for identifying experts and potential experts. Our results over several popular CQA datasets indicate that experts differ considerably from ordinary users in their selection preferences; enabling us to predict experts with higher accuracy over several baseline models. We show that selection preferences can be combined with baseline measures to improve the predictive performance even further.", "paper_title": "Exploring Question Selection Bias to Identify Experts and Potential Experts in Community Question Answering", "paper_id": "WOS:000304415600004"}