{"auto_keywords": [{"score": 0.05007776289246189, "phrase": "nobel_prize_winners"}, {"score": 0.03592371345712793, "phrase": "prize"}, {"score": 0.004752221133109136, "phrase": "bibliometric_analysis"}, {"score": 0.004568871736067739, "phrase": "physics_prizes"}, {"score": 0.0044118153390803405, "phrase": "comprehensive_bibliometric_study"}, {"score": 0.004149792080414689, "phrase": "citation_data"}, {"score": 0.0035605741849764187, "phrase": "degree_centrality"}, {"score": 0.0032908057622663732, "phrase": "winners'_citation_history"}, {"score": 0.003219553875143356, "phrase": "halo_effect"}, {"score": 0.002898378776839434, "phrase": "rapid_decline"}, {"score": 0.0028731024405707277, "phrase": "predictive_power"}, {"score": 0.0028480459059007468, "phrase": "bibliometric_data"}, {"score": 0.00270221723573854, "phrase": "growing_size"}, {"score": 0.002475532161577715, "phrase": "implicit_hierarchy"}, {"score": 0.0022382002476510573, "phrase": "readily-identifiable_dominant_contemporary_physicists"}, {"score": 0.0021049977753042253, "phrase": "scientific_community"}], "paper_keywords": ["Nobel Prize", " Citation", " Centrality", " Scientific disciplines"], "paper_abstract": "We propose a comprehensive bibliometric study of the profile of Nobel Prize winners in chemistry and physics from 1901 to 2007, based on citation data available over the same period. The data allows us to observe the evolution of the profiles of winners in the years leading up to-and following-nominations and awarding of the Nobel Prize. The degree centrality and citation rankings in these fields confirm that the Prize is awarded at the peak of the winners' citation history, despite a brief Halo Effect observable in the years following the attribution of the Prize. Changes in the size and organization of the two fields result in a rapid decline of predictive power of bibliometric data over the century. This can be explained not only by the growing size and fragmentation of the two disciplines, but also, at least in the case of physics, by an implicit hierarchy in the most legitimate topics within the discipline, as well as among the scientists selected for the Nobel Prize. Furthermore, the lack of readily-identifiable dominant contemporary physicists suggests that there are few new paradigm shifts within the field, as perceived by the scientific community as a whole.", "paper_title": "Why it has become more difficult to predict Nobel Prize winners: a bibliometric analysis of nominees and winners of the chemistry and physics prizes (1901-2007)", "paper_id": "WOS:000274111600013"}