{"auto_keywords": [{"score": 0.04974064540897104, "phrase": "squirrel-cage_rotor"}, {"score": 0.00481495049065317, "phrase": "induction_machine"}, {"score": 0.0045817497454044565, "phrase": "real_life_applications"}, {"score": 0.004313643010028869, "phrase": "finite-element_method"}, {"score": 0.00428314621261913, "phrase": "fem_and_boundary-element_method"}, {"score": 0.004018158280364063, "phrase": "overall_view"}, {"score": 0.003933508945770709, "phrase": "implemented_mathematics"}, {"score": 0.0037163618245226755, "phrase": "mechanical_and_acoustic_simulations"}, {"score": 0.0036639675955591065, "phrase": "findings_-_a_main_result"}, {"score": 0.0035236476185949565, "phrase": "acoustic_behaviour"}, {"score": 0.003486316700608598, "phrase": "electrical_machine"}, {"score": 0.003329051037399227, "phrase": "mechanical_model"}, {"score": 0.0031563574387360465, "phrase": "structure_dynamic_problems"}, {"score": 0.0030788521585190833, "phrase": "boundary_layers"}, {"score": 0.003024655649924378, "phrase": "real_life_materials"}, {"score": 0.0027972697690729453, "phrase": "material_parameters"}, {"score": 0.00257775722777195, "phrase": "iterative_parameter_adoption"}, {"score": 0.0025233755103976317, "phrase": "significant_result"}, {"score": 0.002400985525542662, "phrase": "exactness"}, {"score": 0.0023502347146791285, "phrase": "real_behaviour"}, {"score": 0.0021580408652391767, "phrase": "complete_chain"}, {"score": 0.0021049977753042253, "phrase": "electric_machine"}], "paper_keywords": ["acoustics simulation", " induction", " finite element analysis"], "paper_abstract": "Purpose - To present results of research closely linked to real life applications and to resume the work of a period of a few years. Design/methodology/approach - The combination of finite-element method (FEM and boundary-element method is applied to simulate the electromagnetic, mechanical, and acoustic behaviour of an induction machine with squirrel-cage rotor. The paper gives an overall view of the workflow and the implemented mathematics, starting off with the two-dimensional, transient electromagnetic simulation and the succeeding three-dimensional, static electromagnetic simulation. Theory and results of the mechanical and acoustic simulations are discussed. Findings - A main result of the research work is that the simulation of the acoustic behaviour of an electrical machine is very time-consuming. Furthermore, geometry adoption, especially of the mechanical model, is very sensible. Research limitations/implications - Using the FEM for simulation of structure dynamic problems is often limited to how the boundary layers are handled. In real life materials are not \"connected\" but glued or clamped. Therefore, the behaviour can only be adapted by manipulating the material parameters. There are other methods known for simulation, which could be applied. On the other hand, measurements could be used for iterative parameter adoption. Practical implications - A significant result of the work is that the results obtained only allow for comparison. Exactness is more a question of modelling the real behaviour than matching the results to measurement in terms of values. Originality/value - This paper gives an overview of how to simulate the complete chain from electromagnetics to acoustics of an electric machine.", "paper_title": "Acoustic simulation of an induction machine with squirrel-cage rotor", "paper_id": "WOS:000237037300019"}