{"auto_keywords": [{"score": 0.03497872780869258, "phrase": "innovative_strategies"}, {"score": 0.028345798718804226, "phrase": "consumer_market_share"}, {"score": 0.00481495049065317, "phrase": "organizational_innovation"}, {"score": 0.00416882434439484, "phrase": "different_innovative_strategies"}, {"score": 0.003995772867224968, "phrase": "artificial_world"}, {"score": 0.003928572641266562, "phrase": "important_features"}, {"score": 0.003813669883040509, "phrase": "real_world"}, {"score": 0.00337224813954299, "phrase": "discrete-event_simulation_techniques"}, {"score": 0.002857849698346116, "phrase": "experimental_results"}, {"score": 0.002785978280998868, "phrase": "comparatively_conservative_innovative_strategy"}, {"score": 0.0027274643070540733, "phrase": "better_performance"}, {"score": 0.002603012037901889, "phrase": "comparatively_aggressive_innovative_strategy"}, {"score": 0.0025375331660958665, "phrase": "\"radical_innovation\"_experiment"}, {"score": 0.0024842242921857705, "phrase": "limited_changes"}, {"score": 0.0024114635128122783, "phrase": "small_innovative_change_strategy"}, {"score": 0.0023408288327263316, "phrase": "lesser-performing_organizations"}, {"score": 0.002281930100792185, "phrase": "best-performing_organizations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Organizational innovation", " Artificial world", " Consumer behavior", " Discrete-event simulation"], "paper_abstract": "The objective of this study was to construct a system that allowed organizations and consumers to interact with each other to investigate the effects of organizations adopting different innovative strategies on consumers. It was implemented by constructing an artificial world that abstracted some important features of organizations and consumers in the real world. The world consisted of four modules: organization, consumer, satisfaction (fitness) evaluation, and innovative change, which were linked into a model with discrete-event simulation techniques. Based on innovative strategies, organizations were divided into two categories: small (conservative) and large (aggressive) innovative changes. Two experiments were performed: \"incremental innovation\" and \"radical innovation\". The experimental results showed that organizations adopting a comparatively conservative innovative strategy were likely to have better performance (in terms of consumer market share) than organizations adopting a comparatively aggressive innovative strategy. The result in the \"radical innovation\" experiment showed that there were limited changes of consumer market share for the organizations adopting small innovative change strategy. By contrast, innovation provided lesser-performing organizations a good chance of surpassing best-performing organizations if they adopted some innovative strategies, which could be roughly divided into four different categories. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Incremental or radical? A study of organizational innovation: An artificial world approach", "paper_id": "WOS:000281339900091"}