{"auto_keywords": [{"score": 0.04637861632710295, "phrase": "related_works"}, {"score": 0.02464937234952462, "phrase": "reference_relationship"}, {"score": 0.00481495049065317, "phrase": "reference_relationships_among_research_papers"}, {"score": 0.004769702911065878, "phrase": "based_on_citation_context._many_efforts"}, {"score": 0.00406214911915987, "phrase": "paper_abstract"}, {"score": 0.0038930368103015467, "phrase": "useful_efforts"}, {"score": 0.0035085965086415474, "phrase": "experimental_data"}, {"score": 0.0031174595932694036, "phrase": "reference_relationships"}, {"score": 0.002641823250595624, "phrase": "scientific_papers"}, {"score": 0.0025922974876210194, "phrase": "authors'_opinions"}, {"score": 0.002125020720324262, "phrase": "original_features"}], "paper_keywords": ["Reference relationship", " citation context", " cue phrase", " citation rhetorical pattern", " citation type", " citation network"], "paper_abstract": "Many efforts have been successfully paid by researchers or developers to grasp efficiently the contents of related works with a view to making their investigations successfully, preparing their plans effectively or attaining their objectives smartly. Although the paper abstract prepared by authors themselves is one of the useful efforts in many cases the content is not always sufficient by them to know the features of objective, approach, method, experimental data, evaluation, etc. in comparison with other related works. In this paper, we focus on the text associated with citation to reveal reference relationships between papers in order to achieve an objective of analyzing the influence of related works. Citation indicates the connection between two papers. Also, the text associated with citation can reflect the contribution of scientific papers, expressions of authors' opinions or other researches and also can show the usage of the research to resolve problems. Our main discussion points in this paper are classification of reference relationship, extraction of text associated with citation and representation of reference relationship from a viewpoint of making the original features of our work clear.", "paper_title": "ANALYSIS OF REFERENCE RELATIONSHIPS AMONG RESEARCH PAPERS, BASED ON CITATION CONTEXT", "paper_id": "WOS:000302997900005"}