{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partially_eponymous_ring"}, {"score": 0.004742904841489477, "phrase": "partially_eponymous_model"}, {"score": 0.004714387899814988, "phrase": "distributed_computation"}, {"score": 0.004588158931776543, "phrase": "eponymous_models"}, {"score": 0.004319566932528865, "phrase": "anonymous_model"}, {"score": 0.004203864747683794, "phrase": "eponymous_model"}, {"score": 0.004140924670517666, "phrase": "decision_problem"}, {"score": 0.003771114171630529, "phrase": "circularly_symmetric_relations"}, {"score": 0.0035609154384221567, "phrase": "identity_multiplicities"}, {"score": 0.003117890043128058, "phrase": "topological_characterization"}, {"score": 0.0029086349651683383, "phrase": "universal_distributed_algorithm"}, {"score": 0.0027881805415682437, "phrase": "distributed_algorithm"}, {"score": 0.0027298319171606498, "phrase": "local_steps"}, {"score": 0.002616762777413686, "phrase": "message_complexity"}, {"score": 0.002500796108673293, "phrase": "graceful_degradation"}, {"score": 0.0024263474406990846, "phrase": "least_possible_eponymity"}, {"score": 0.002202651051682622, "phrase": "efficient_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed computation", " Partially eponymous", " Ring", " Solvability", " Computability", " Message complexity", " Multiple leader election", " Circularly symmetric relation"], "paper_abstract": "We study the partially eponymous model of distributed computation, which simultaneously generalizes the anonymous and the eponymous models. In this model, processors have identities, which are neither necessarily all identical (as in the anonymous model) nor necessarily unique (as in the eponymous model). In a decision problem formalized as a relation, processors receive inputs and seek to reach outputs respecting the relation. We focus on the partially eponymous ring, and we shall consider the computation of circularly symmetric relations on it. We consider sets of rings where all rings in the set have the same multiset of identity multiplicities. We distinguish between solvability and computability: in solvability, processors are required to always reach Outputs respecting the relation; in computability, they must do so whenever this is possible, and Must otherwise report impossibility. -We present a topological characterization of solvability for a relation on a set of rings. which can be expressed as an efficiently checkable, number-theoretic predicate. -We present a universal distributed algorithm for computing a relation on a set of rings: it runs any distributed algorithm for constructing views, followed by local steps. We derive, as our main result, a universal upper bound on the message complexity to compute a relation on a set of rings: this bound demonstrates a graceful degradation with the Least Minimum Base, a parameter indicating the degree of least possible eponymity for a set of rings. Thereafter, we identify two cases where a relation can be computed on a set of rings, with rings of size n, with an efficient number of O (n . Ig n) messages. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Computing on a partially eponymous ring", "paper_id": "WOS:000263635200011"}